{"name": "%C4%93ma-chicago-2", "reviews": [{"review": {"des": "**Vegetarian Friendly**<br><br>So many veggie friendly options that I didn't know where to start! Everything is meant to be shared tapas style.<br><br>We were 3 people for lunch, and were able to share 4 dishes. The Toasted Almond and Garlic Hummus was surprisingly delicious. We also enjoyed the Brussel Sprouts and Crispy Potatoes. We also ordered the Falafel Sandwich, which is delicious, however was a complete mess to share between people.  <br><br>I wish I had space for for dessert, maybe next time!", "pics": null}}, {"review": {"des": "I'll start off by saying, I don't really need much for lunch....<br><br>I picked up lunch from here and have two key messages to say:<br>-Worst portion size I've experienced<br>-Quality and taste was good though<br><br>I paid $20+ for two bites and ended up having to go to another place to order a 2nd lunch...", "pics": null}}, {"review": {"des": "Very pretty on-trend Mediterranean restaurant in a great location. This cool and inviting little restaurant has a very well designed interior with light, neutral colors and comfortable seating.<br><br>The food at Ema is very tasty, but the dishes are small. <br><br>I ordered the charred eggplant appetizer which was delicious, but tasted more like hummus than eggplant. It also had a spreadable, hummus-like consistency. It's the eggplant for people who say they don't like eggplant. It is served with seasoned pita bread but you'll run out of it. Be sure to ask for more pita.<br><br>The lamb and beef kefta is phenomenal, but definitely not meal-sized. The rice portion is small and mine included no salad side although it is pictured in photos of the dish here. What gives? <br><br>Sadly, my server wasn't so fantastic. There were stretches when he was no where to be found. Instead, other servers noticed when I was low on water and pita and helped me out. <br><br>I would go back, but only if I had someone to dine with me. For a solo dinner, I'd have to spend a lot to get a full meal's worth.", "pics": null}}, {"review": {"des": "Truly my new favorite restaurant in town! loved celebrating my milestone wedding Anniversary at this fine place. The food and drinks were top notch....service a tad bit slow but that wont stop me from coming back many times :)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/23yeN0k6Ps92NDgUr5zNGA/348s.jpg", "caption": "dessert on the house for our Anniversary!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZYThmwNGYT70_q37_X6JHA/168s.jpg", "caption": "delectable beets with yogurt sauce"}]}}, {"review": {"des": "River North restaurants a combination of touristy, trendy, beautiful, exquisite and normally with a higher than average price tag. I couldn't quite define how I would feel about Ema. Most folks I've talked to had a pleasant dining experience and enjoyed the food, so why not give this place a shot to try out a new hot spot for Mediterranean.<br><br>Place is located inside the Hyatt hotel. The place was already packed, so I got the \"lounge tables\" inside the lobby of the hotel, but still be able to see inside the restaurant. Actually, it's still a nice spot to people watch yet offers a more intimate, cozier area to have a conversation.<br><br>Cocktail - Savory Hunter, a delicious hit of sweet, spicy, smokey with a bit of mini candied tart pieces floating in the drink, kinda like a bubble tea margarita, but much more sophisticated. <br><br>We ordered 3 dishes - roasted eggplant, charred octopus and chicken kebabs. The portions were medium size and 2 bowls of bread came out. I was pretty full from the dinner and the flavors are super smooth, clean, flavorful, complex and texture of food was spot on. I think if you're looking to try Med, this place is fairly solid. I know there are plenty of great and affordable places outside the River North bubble, but the overall execution hits the mark.<br><br>Bonus points: Get the LEYE app and earn some major points!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HrpSB6ClAS35XVHjNOnuEQ/348s.jpg", "caption": "Savory Hunter - a spicy smoky margarita with a bit of chunk and bite."}]}}, {"review": {"des": "I found Ema on OpenTable for a last-minute Sunday brunch option while I was visiting from out of town. I'm glad I did. This is a Middle Eastern restaurant with a modern, creative twist, and everything is executed to perfection.<br><br>I ordered the crisp-fried Brussels sprouts and lamb kefteh with eggs for brunch, accompanied by their house-made hot sauce. The Brussels sprouts were among the best I have ever tasted, with a crisp outside and soft, melting interior. The sherry reduction caramelized, adding a sweet note to the bitterness of the greens and the richness of the olive oil. The lamb kefteh was a generous portion of two skewers of ground lamb, grilled and served over rice with two sunny-side eggs, and a yogurt sauce and small Mediterranean salad as accompaniment. It was simple, but expertly prepared and full of flavour. <br><br>I'd love to come back here for dinner next time I'm in Chicago. It's definitely worth a return visit.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6dXZhc-07CiiF-kEAHWcGg/168s.jpg", "caption": "Lamb kefteh with eggs."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5AmrmABbd4O3H5mRnvTYmA/168s.jpg", "caption": "Crisp-fried Brussels sprouts with sherry reduction."}]}}, {"review": {"des": "We picked this place by chance and it blew our minds!!!!<br>The decor is stunning, the cocktails are delicious and no words can describe the food.... out of this world comes close!<br>My favorite starter was a must, baba ghanoush like I've only eaten in Jordan! All other dishes were amazing.<br>My drink was a gin-based bartender's choice and I like what he did there...<br>My favorite desert was the honey pie.... just saying....<br>Recommend to anyone who likes Mediterranean food!", "pics": null}}, {"review": {"des": "Salty food. Mediocre grilled octopus. Noisy place.<br>Attracts young crowd; probably the ones who never had the chance to experiment authentic   Mediterranean food!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/u_plMPYWZRX1d1QIIM_eMg/348s.jpg", "caption": "Decor"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fwt6NT0d9sQbUMXM5rG9Gw/168s.jpg", "caption": "Decor"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HfH-x2Y395dGPsFoM_uq_Q/168s.jpg", "caption": "Decor"}]}}, {"review": {"des": "LOVED this place for brunch. We were able to get a last minute reservation on Open Table which was a big plus.<br><br>The decor - looks like you are sitting in an art gallery. I bet at night it takes on a romantic/ethereal vibe with strings of market lights<br><br>The food - I had the best charred eggplant in my life during our visit. Light, extremely flavorful and a hefty serving. The cauliflower fritata was fine, light for a frittata but I wouldn't order again. The blueberry clafoutis (tasted like a baked pancake) was naturally sweet from the blueberries and what tasted like clotted cream on top. They have a nice selection of teas, the \"agua frescas\" are essentially lightened juices.<br><br>The service - great, prompt.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xSCrj6Hif1Q-MuhPIP1-fQ/348s.jpg", "caption": "Cauliflower frittata"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kNpmgQr9zLG0L0aDauZdcw/168s.jpg", "caption": "The aesthetic was amazing. Looked like we were eating in an art gallery. They have hanging market lights that I'm sure look great at night."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/y0zqT-qA4SZruM4fHRXjOQ/168s.jpg", "caption": "Blueberry Clafoutis The cream was excellent"}]}}, {"review": {"des": "Outstanding dinner at Ēma! We were looking for something tasty on a Friday evening near our hotel & Yelp led us here. I was surprised at how packed it was at 9:30pm for dinner, but was hoping that meant this place was legit! <br><br>Loved the ambience - it was spacious, casual, and lively. The adjoined Hyatt lobby also has the same feel so it's not jarring as you move through the space. <br><br>Pacing of the food was a little prolonged but pretty tasty:<br>*Charred Eggplant (house yogurt, lemon, california arbequina olive oil) - Like a baba ganoush! Really enjoyed how tangy it was from the yogurt & lemon, but it was still well balanced and savory. The house bread aka pita that it comes with is out of this world! Just the right amount of pita given for the amount of spread. Great opener! <br><br>*Brussel Sprouts (Crispy Shallots, Pumpkin Seeds, Sherry Glaze) - Not my favorite execution of flash fried Brussels because it was really oily. HOWEVER, the flavors were great! This might sound weird, but the sweetness and tanginess of the glaze reminded me of orange chicken! <br><br>*Fish Of The Day - The FOTD was a lovely branzino on top of cucumber, fennel. I don't recall what sauce was on it - the look of the herb blend reminded me of chimichurri but I don't recall tasting parsley. Either way, this dish was PERFECT. <br><br>*Chicken Kefta (lemon, olive oil, tzatziki) - Another great dish. I couldn't get over the cilantro rice it was served with; it was so buttery & luscious. For $13.95, it came with 4 \"meatballs.\" We were so full at this point that I could only eat one. They were flavorful (even without the tzatziki) and not dry whatsoever. <br><br>*Frozen Greek Yogurt - We topped off our dinner with frozen greek yogurt. While I've never had a combination of a fig red wine reduction and lemon short bread cookies..I was expecting something more luscious like Ellenos in Seattle for some reason. It was interesting, but this is the only item that I would skip next time. It's definitely worth a try for the unique combinations (it rotates). <br><br>The brunch menu also looks fantastic! I never seem to have enough meals in CHI town, but I'll be back! <br><br>242/365", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RsiJCBUS8w2akC-pYkOk4Q/348s.jpg", "caption": "Frozen Greek Yogurt"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uMZz0PF0gKYdBJcmPD3BCg/168s.jpg", "caption": "Brussels Sprouts"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jeLFIU-mewm5UQ045FMLqg/168s.jpg", "caption": "Branzino / Fish of the Day"}]}}, {"review": {"des": "Wonderful Mediterranean restaurant! Inside is well decorated (feels like sitting in a garden but inside!) And the food is great and well priced. <br><br>I came here for the 3-6 happy hour and had a $5 glass of white wine (they also offer red and beer) and $5 eggplant spread (they also offer other hot / cold tapas). Thought both of those were 5/5 and we'll worth the money spent!<br><br>Afterwards I had the grilled squid ($17) but they gave me two huge pieces along w potatoes. That alone and I was stuffed! I did think the squid was a bit dry (I kept dipping it into the eggplant spread for more moisture lol). Overall, very satisfied w my meal, and can't wait to come back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZgEk8ZAa7rxcm6xr_1Ukrw/348s.jpg", "caption": "wonderful inside with huge greenery"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WkF95aVMhgfkPxIg-30KcQ/168s.jpg", "caption": "grilled squid-- two huge pieces + potatoes but a bit dry!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NuCfYRi84pvAy5aMvOYXQw/168s.jpg", "caption": "eggplant spread $5 during happy hour!!!! (3-6pm) a must get"}]}}, {"review": {"des": "Delicious Mediterranean small plates, lush greenery, great outside seating and inside seating as well. My only complaint is the service at the reception. Both times I made reservation before going, but the people at the front desk didn't bother to feed it into the system and I ended up waiting 15 minutes both times, and was late for subsequent things. I wish the people at the front desk were more efficient. <br><br>The service otherwise from the waiters was wonderful. I got the chicken kefta kebab(loved the charred outside and texture of the meat, rice was exquisite with copious amounts of olive oil), Sweet corn risotto(cooked to perfection and super yum!). My friend got the Spread sampler which was delicious as well. We got the Aix rosé on recommendation from the waitress and it was perfect with our food.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YdTP--HNdlkwdXU8Vk_J5w/348s.jpg", "caption": "Chicken Kefta"}]}}, {"review": {"des": "After hearing rave reviews about Ema from a colleague at work, I made a reservation via Open Table to celebrate my mom's 70th birthday. Generally speaking, my parents do not like to venture into the city especially on holiday weekends, but with my brother and his girlfriend visiting, they were up for a new adventure. We lucked out with street parking, although valet is available next door through the Hyatt Place Hotel for $15 (3 hrs). They seated us promptly and the food was amazing. Our server was really friendly and suggested that we order about 3 dishes per person, so away we went. We started with the hummus and charred eggplant. I was amazed that my brother and dad actually ate the eggplant, considering they generally do not like that vegetable, but the creamy consistency and smoky flavor drew them in. The hummus was absolutely delicious. Then we went to town and ordered: roasted beets with marscapone (so yummy), house made stracciatella with tomatoes (must order), grilled octopus, baby potatoes with this lightly dressed frisee salad - I would love to know what the recipe is for the vinaigrette please! lamb meatballs were not heavy with a really light tomato sauce, pan roasted cauliflower , baked halloumi with dates and peppers(I think it was a lightly fried piece of cheese? whatever it was..we loved it), lamb and beef kefta with rice, and beef tenderloin which also came with rice. I let the server know that it was my mom's b-day and we chose the honey pie, which he brought out with a candle.  Overall, the ambiance was beautiful and elegant without being pretentious. Thank you for helping us pull off a birthday dinner that our whole entire family really enjoyed!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/N-Zx4mSD61eAw-Adbw93rQ/348s.jpg", "caption": "Roasted beets"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_i-YAGOR1m9tfxWktBeEVQ/168s.jpg", "caption": "Grilled octopus with roasted potatoes and lightly dressed frisee"}]}}, {"review": {"des": "Came here for a lunch meeting after the boat ride. Nine of us were seated immediately and we started ordering away. We ordered 3 kinda of hummus, brussel sprouts and cauliflower. <br>Food was good and rich with flavors but the portion was small for the veggie sides. Ordered my main dish of beef and lamb kebab and grilled octopus. Again flavors were on point , presentation was great , but portions were small. <br>Service was fast and prompt. Downside- restroom is not in the restaurant but instead located inside the hotel which is literally next door. <br>Maybe will skip this and go somewhere else. <br>Trust!", "pics": null}}, {"review": {"des": "First time at Ema and it was fantastic!<br>From the decor to the food everything was top notch!<br>We tried labnah, Brussel sprouts, octopus and corn risotto.<br>I can't pick a favorite...they were all fantastic! Great flavors snd freshness. <br>I can't wait to go back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KYtIedolRlY7s9Sx-3SXxA/168s.jpg", "caption": "Delightful corn risotto"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7k_MTQsRkzEdOwHY6DpbKw/168s.jpg", "caption": "Yum"}]}}, {"review": {"des": "The rundown: excellent food, beautiful dining room, average service, slightly gross restrooms.<br><br>All the food we ordered was delicious - warm and fluffy pita bread with smooth hummus, house made straciatella (cheese), crispy brussel sprouts with honey and pumpkin seeds was a unique and creative dish, lamb/Beef kefka with surprisingly good basmati rice, a lentil/basmati salad with a good crunch, and perfectly cooked octopus. The only thing that was slightly strange was the very sweet dressing served with the octopus. <br><br>The reason I can't give five stars: service was just ok. It was a little odd when we were asked to present ID when we ordered our drinks (my husband and I are very well over 21). Dishes were a bit slow to be cleared, and each time our server came to check how we were doing, she'd have turned away from us before we finished responding.<br><br>Lastly, to use the restrooms you have to walk thru the adjoining hotel lobby and down a hallway. And then the restrooms are rather dirty...I expected better for a restaurant this nice. There are also some tables that spill out of the restaurant into the hotel lobby. I wouldn't want to sit there, as that area feels awkward and forgotten.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8zRKCcwVq6SXEfKPRT4jmQ/348s.jpg", "caption": "Octopus"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lsdUh0iYWfLZc1bSBRY7lA/168s.jpg", "caption": "Lentil and basmati salad"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5cs_kWjVXrvcmpWtNV5n2A/168s.jpg", "caption": "Crispy brussel sprouts"}]}}, {"review": {"des": "5 stars for making the hummus taste good!<br><br>Back story: I don't really like hummus.  In fact, I don't like hummus at all.  It's just mushy and bleah.  But in this restaurant, they made the hummus taste good and I ate a very large helping of it.<br><br>We also had crispy potatoes, lamb and beef kefta, king salmon and grilled pork belly.  The potatoes were well salted, the pork belly had enough fat to make it delicious but not overwhelming, and the kefta and salmon skewers were cooked perfectly.  And the portions were great!  We certainly did not need to order this much food.<br><br>Definitely worth it, definitely coming back.", "pics": null}}, {"review": {"des": "Walking inside, the atmosphere is incredibly inviting and bright. We all ordered many dishes to share, and everyone also enjoyed their drinks (I recommend the mango juice!).<br><br>The blueberry almond pancake was delicious, but only came with one pancake. The French toast was also not too sweet and just right, but also only came with a about a 1/3 of a slice of bread? <br><br>My favorites were the kabob lamb kofta, crispy Brussels sprouts, and hummus for sure. I enjoyed all of the food and the service was great, but some of the portions were quite disappointing.", "pics": null}}, {"review": {"des": "Great (and very unique) dining experience.  Came here with a group of about 15 for a work dinner, and everyone was impressed.  The food was delicious, and just enough flair to make it different without being too 'out there.'  The hummus and labneh were delicious, as were the desserts.<br><br>The pacing of the meal was a little off-in the beginning, they were bringing the plates out (it's a shared plate deal) almost too quickly, and then all of a sudden we ended up with gaps of nearly 15 minutes between some.  As the night went on the meal dragged on.  I don't think it would been as noticeable if the pacing had been more consistent.<br><br>One other oddity: some people at our table ordered a bottle of wine, and our server let us know they were out of it, so she substituted another similar wine.  The substituted wine was nearly twice the price of the original bottle.  Then, later on in the dinner they found the original bottle.  Not a huge deal, and it truly could've been an odd coincidence, but it did look a little shady.<br><br>Still, overall, a great meal that everyone enjoyed.", "pics": null}}, {"review": {"des": "Great ambiance and Mediterranean food in river north. The food has authentic flavors but the service could be better. <br><br>We sat on the patio but the greenery decor on the inside is beautiful. We ordered the spicy hummus and falafel for appetizers. The spicy hummus was very smooth and had tons of flavor. The pita on the side was even better with sesame seeds and herbs. <br> The falafel was a little over cooked and tasted slightly burnt on the outside.<br><br>We also shared the octopus, lamb and beef kefta, pork belly and Brussel sprouts. The lamb and beef kefta was my favorite dish of the meal. The flavors were filled with Mediterranean spices and tasted the most authentic. The Brussel sprouts were another fave at the table with the pumpkin seeds. They were perfectly crispy. The octopus texture was not as chewy as I expected but it was a little too charred for me. The pork belly was a little fatty but extremely flavorful. I would highly recommend sharing 2-3 dishes per person for sharing.<br><br>Would definitely come back for the food! The slow service needs some improvement.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/STIVL6Ax1BlOlpLrgYbTYw/348s.jpg", "caption": "Grilled Pork Belly - delicious"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8FenJOp45KKE2kWvzfXhQw/168s.jpg", "caption": "Lamb & Beef Kefta - the best!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gF5iuHqKF4LiDDkFfgX06A/168s.jpg", "caption": "Grilled Octopus with potatoes"}]}}, {"review": {"des": "This is one is small plate restaurants where you pay a lot for not that much food and leave hungry in the name of sharing.  Usually I don't go to such places, but out of town friends picked this restaurant.  The food here was good, but not awesome.  The risotto was good, for example, but it was more like rice pudding.  The dipping sampler is not worth the money.  You get a spoonful of each for $14.  The dips did taste good, but portions need to be more generous. I understand this is the model - charge a lot for a little food.  <br><br>The falafel and frittata were good, although the frittata needed salt.  The heartiest part of the meal was probably the fried potatoes.  These were okay and at least provided some sustenance.  We also had the blueberry clafoutis, which was okay, but maybe a little too sweet.  The bill was $180 for 4 of us, which I consider overpriced for brunch.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dwNMvl3UoXl6EoyNybE91Q/348s.jpg", "caption": "Blueberry Clafoutis"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Zp-EH_mMEApFejEEY7gD2w/168s.jpg", "caption": "Egg White Fritatta"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/b-eVWKwjqgJST6oT-1HYGw/168s.jpg", "caption": "Market Salad"}]}}, {"review": {"des": "Nothing but good things to say about this one. From the food to the service, we had a nice evening here. This is on the radar of the food scene, but I think deserves even more credit.<br><br>Our waiter was super cool, informative, and pleasant. Not overbearing one bit. There were moments he was slow/forgot a drink or two, but I could tell the place was slammed and he did everything possible to iron out any mishaps.<br><br>Cocktails and beers were solid. They had some local craft beers I love (lizard king from Pipeworks), and the mix drinks got the job done. Id give them a strike on the price however. $9 pints are on the high end. <br><br>Now for food. Small plates so il try and break it down. Maybe lets go in order of favorites.<br><br>Salmon Kebab: perfectly cooked and great flavor, I was impressed<br><br>Olive and feta: I don't even like feta but this was good. And all the nuts and such also thrown in<br><br>Beef kebab: just a must have at a place like this<br><br>Brussels sprouts, hummus and pita, beets: these three id suggest for sure. All great flavors to have at the table.<br><br>My 'meh' dishes were: crispy potatoes, corn risotto, rotisserie chicken. Still good, but could have skipped.<br><br>Lastly, I thought the small plate portions were a generous size. I liked this a lot. I would be back here in a heartbeat if someone wanted to go!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CWTVLwL9V7NFlxsy8eVSKQ/168s.jpg", "caption": "Salmon and beef kabobs (sry for insta text in there)"}]}}, {"review": {"des": "This place is a home run. 5 star staff, 5 star atmosphere, 5 star food, and super reasonable price. Our waiter was attentive, kind, and helpful. He refilled my water constantly which I love. The place is beautiful but not pretentious. The food quality was awesome. Everything fresh and pleasing to the eye in presentation. I'd recommend this hands down.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qgTshIXI54tDBg_oNh08Qw/348s.jpg", "caption": "The sample platter"}]}}, {"review": {"des": "I love the aesthetic of this place. It is a great, classy place in the heart of River North. The ambiance is coastal and is completely decorated in white interior. The food is all served tapas styles, and great portion sizes. The food was a bit overrated for the price - perhaps I had high expectations with the first impression? It was a good meal, but the environment outweighed its courses.", "pics": null}}, {"review": {"des": "I have to say, this place equally impressed our party of 5 with great service, tasty innovative interpretations of Mediterranean flavored dishes a comfortable, casual, stylish environment, authentically casually trendy crowd and BA BOOM a killer Medjool date cake to compliments an already fresh and delicious meal.<br><br>The casually stylish crowd ranged from the cool saying on the tee shirt that defines my unique personality types, to lots of designer hoodies, man buns, beards and assorted variations on facial hair to the suit no tie with checkered shirt crowd. Casual stylish ladies in their flowery flowing summer dresses added some well appreciated style and sophistication to the casually stylish men's crowd. My point is, all were welcome, blended seamlessly into the space and brought an energy to the visit. Chill upbeat background music that wasn't too loud that you had to scream over it to be heard added an additional vibrancy. Coffee and tea selections were good too. Can't wait to go back for brunch or something.<br><br>One small recc, the 3 appetizer plate portion size was a little on the meager side, could use a little more generous portion size there.", "pics": null}}, {"review": {"des": "Not what I expected, but still good. <br><br>Food quality: Great. The food seemed fresh and freshly made for your table. The food was light and cooked well. <br><br>Taste: Good. We had the hummus (good), the olives and feta (good, not special), the brussel sprouts (the sauce was overpowering), and the rotisserie chicken (good, not special). Everything was good, but nothing was great or that special/unique. <br><br>Price: The restaurant would've gotten four stars, but the price was way too high for the experience/food. The small plates are always a fun experience, but nothing was great enough for the price. <br><br>Overall, fine meal, didn't leave feeling full, but the meal was light. <br><br>Great ambiance, good for vegetarians.", "pics": null}}, {"review": {"des": "Arrived in a group of 8 for excellent Middle Eastern fare!<br><br>Apps<br>Hummus with Lamb and harissa: 5<br>Tabouleh: 5<br>Feta and olives: 5<br>Labneh (my all-time favorite)- 5<br><br>Dinner<br>Grilled scallops- 5<br>Lamb Kefta- 5<br>Beef tenderloin- 5<br><br>Dessert-<br>Halva- 5+<br>Chocolate cake- 4.5<br>Greek yogurt w/ olive oil- 5+<br><br>Dark Matter coffee<br>Lattes- 5<br>Capp- 5<br><br>Service- 5<br>Ambiance- 5<br><br>Thank you, Lena, for your wonderful hospitality.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CZe-7UbcbhbGA9wVVyC7IA/348s.jpg", "caption": "Halawa was excellent!!"}]}}, {"review": {"des": "Came here for a quick lunch during a business trip. The place was pretty empty, as is expected on a Monday at 3pm. <br><br>I was seated and greeted by a waitress right away. I went with a rose that she recommended to me - very light, dry, perfect for the sunny day. <br><br>Place is tapas style so she suggested I get two plates. I went with the avocado sweet pea dip and the black lime shrimp. The dip was meh - not bad I really wanted the jalapeño and mint to come out a little bit more. I LOVED the shrimp - the flavors all went together so well. I even finished the sauce with some of my leftover bread :). <br><br>Service was very attentive, my waiter Emma was wonderful. <br><br>Good place for a nice lunch or dinner with friends (I think they also do brunch).", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3ul3dsXtN4-ZNrMMokMLAg/168s.jpg", "caption": "Black line shrimp (comes with 6)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/W657aE7mAL7yLa3TKjFRYw/168s.jpg", "caption": "Avocado & Sweet Pea dip with bread"}]}}, {"review": {"des": "I had high hopes for this place. I think it could be great, but overall I was disappointed. <br><br>The ambiance is fantastic. I came on a Sunday when it was busy but not slammed. I sat at the bar and was served water then ignored for at least 10 minutes. I finally asked and the bartender took my order.<br><br>The Celery Root Leek soup was delicious but barely over 100 degrees, and I was not given a spoon. Finally I had to ask the bartender. I asked the food runner about spoons, and she blamed the bartender. My Lamb Shakshuka was delicious also, but the portion was small (it should be in a bigger dish with more tomato sauce) and the eggs were way over cooked. The house-made bread is tasty. <br><br>I'm not usually picky about service, but at this price point with so many other restaurants in the area, this place should me more on point.", "pics": null}}, {"review": {"des": "Very yummy food and cocktails. Slightly limited wine selection if that's you're thing! I tried the mezcal cocktail and it was perfect--not too spicy and very fresh. <br><br>The highlight of the meal was the spicy hummus, roasted beets, and potatoes. I was absolutely drooling over the creamy hummus and garlicky warm pita bread it was served with. The beets had some type of crunchy seasoning on them which was unexpected and exciting. <br><br>The plates are actually great portions for being sharing tapas. For two people we had 5 dishes and it was MORE than enough. The only thing I didn't love was the salmon kebab--it was missing something.<br><br>Great spot for a casual dinner/date night and hope to be back soon!", "pics": null}}, {"review": {"des": "I have had this restaurant on my list for almost a year now, but haven't had a chance to go! I came here after work with few coworkers and was a great spot! They were able to seat us right away in their outdoor seating. As a vegetarian they had several options which I appreciated. I really enjoyed the corn risotto and the falafel. The feta watermelon salad was okay but I've had better. I think they need to add more feta to the salad; felt like I was just eating watermelon. I also appreciated that the service was super fast and they brought our food out right away. The dishes are meant to be shared, between the 3 of us we got a hummus and 3 dishes; which was perfect. I loved the bread they give you; ask for extra!", "pics": null}}, {"review": {"des": "This review is for the takeout bar, not the restaurant! I've perused the photos for Ema itself and everything looks fabulous - definitely on the hit list for future trips to the city. <br><br>I ordered lunch from the takeout bar a bit past noon - it was quite busy due to the time and there was about a ten minute wait to get in - it was a little bit tricky as the hallway past the door is quite narrow hence waiting there while trying to be mindful of people who are exiting led to some awkward maneuvering back and forth. Not a big deal though!<br><br>There was decent selection and i made a box with farro, chicken, beef kefta, dates, falafel and spicy hummus. It was a nice full portion for lunch and not excessively-priced (about $12). I liked the beef kefta most. What I was missing was more selection for hot plates - I found most of what was available was cold (eg salad) but I tend to prefer hot dishes for lunch! Nothing I ordered was bad, however, apart from maybe a salad I picked that had a few too many dates for my liking. My colleagues loved this place though so I only speak for myself when I say I was intrigued by the food but overall slightly dissatisfied. No regrets trying the place though because the dishes are much more interesting than what you might typically find at a takeout bar - kudos to Ema for that :)", "pics": null}}, {"review": {"des": "Ahh my husband and I loved it here. The atmosphere is very open yet warm and cozy. The interior itself is simple but elegant. It's a very nice place to go on a date actually. Service is friendly and efficient.<br>We started with the charred eggplant which was amazing  it went well with their herbed pita bread. Next we had the cauliflower and asparagus risotto. The cauliflower was so good. It had a good grilled taste to it and went well with the sauce that came with it. The risotto was good but we thought the cheese taste was a little bit too overwhelming. It was a good texture tho. For entrees we got the octopus and shrimp. Both were fantastic but we both really liked the shrimp. Our server recommended it and it didn't disappoint. The sauce was so good. I would def want to come back here to try all other little dishes.", "pics": null}}, {"review": {"des": "wow just wow. everything was amazing. my two sauvigion blanc glasses hit the spot for this meal. the pita was absolutely delicious as well as both the pumpkin and mushroom hummus. the butternut squash risotto was so flavorful and tasty. the falafel was fantastic. and lastly, the pumpkin froyo was to die for. i 100% recommend this place as not only the food is unbeatable, but the ambiance is wonderful as well.", "pics": null}}, {"review": {"des": "Had a very lovely weekday lunch here with some friends. The interior is very white, bright, open, upscale chic. Our waiter described it as Mediterranean with a Californian twist. Pretty spot on. We had great service! Friendly, efficient. Ambiance was pretty high energy, very busy, chatty/loud-- as expected for lunchtime. The tables are pretty close together, so if you're looking for something pretty intimate.. not quite the right place.<br><br>We shared the sweet pea/avocado spread-- it was OK. The house bread was great. I had the grilled octopus. It was pretty amazing and perfect. I've never had octopus so perfectly grilled! Sooo many options, super veggie friendly. Overall had a nice experience and would be happy to check out again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/snsIhDZ2eEQ6DoXV7aWIBQ/168s.jpg", "caption": "Grilles octopus, amazing!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MMHwYahZZD5O5RjMv9H_cA/168s.jpg", "caption": "Avocado spread"}]}}, {"review": {"des": "My new favorite find! <br>Good food, great service, beautiful ambiance plus outdoor seating, need I say more?! Ok, I will.<br><br>Ema is a Mediterranean restaurant that has small plates and includes spreads, greens, cold & hot mezze, kebobs, fish, seafood, beef, lamb and chicken.<br><br>The SPREADS are served with their house bread, which is a warm fluffy pita.<br>SPICY HUMMUS w/ marinated fresno & sweet roasted chiles tasted great! I don't really think it was spicy or had any kind of \"kick\", but it was quite flavorful.<br>CHARRED EGGPLANT w/ house yogurt, lemon & olive oil was absolutely DE-LISH. If you've never had eggplant, let this dish be your introduction. You must try this spread!<br><br>HOT MEZZE<br>BRUSSELS SPROUTS w/ crispy shallots, pumpkin seeds & sherry glaze. I loooove brussels sprouts and this plate was a hit! Usually they are served with bacon and/or peppers and lemon, but this was completely different. I loved the char, the texture and all of the flavors. Mmmmmm good!<br><br>KEBABS<br>BEEF TENDERLOIN w/ red onions, lemon, olive oil, zhoug & rice. Prepared a perfect medium and soooo tender and flavorful, it did not need the zhoug. The rice was also quite tasty. I adore cilantro and the zhoug (spicy cilantro pesto) was a huge burst of flavor and absolutely delicious! It could be spicier and should served as a spread. I'm just sayin...<br><br>I had 2 glasses of their featured wine. I do not remember the name but it was a Viognier. Crisp, bold and very refreshing. I wish I made a note of the name.<br><br>This is a great place to sit outside and eat, drink & people watch. The bar area is nice with some lounge seating and seems quite cozy. The actual restaurant reminds me of a restaurant that would be near the ocean. Beautiful, simple & clean decor. <br><br>Our server, Alex (female), was fantastic. All of her suggestions were great! She was very attentive, friendly and professional.<br><br>I absolutely recommend this place and I will  definitely return. They have Happy Hour specials Monday-Friday 3pm-5pm that include $5 Hot & Cold Mezze, Craft Beer and Wine. <br><br>I'll be back...", "pics": null}}, {"review": {"des": "My colleague recommended Ema to us. After reviewing the menu we decided to check it out on a Friday night. Opentable wasn't showing seat available but I called them directly and they were able to get us a seat. The service was excellent. Our waitress was friendly and offered great recommendations. Also, the food was delicious. We ordered 7 dishes between the two of us. They were all great. Definitely would recommend to anyone!", "pics": null}}, {"review": {"des": "Fantastic! Good food, ambiance, and service. <br><br>I'm from MI & I work in Dearborn (hello largest Arab population in the US) & man I wish a place like this existed there! Modern Mediterranean food in a classy setting! Anywho...our party of 6 was able to walk in on a Saturday night at 8 without reservations and were seated promptly. <br><br>We didn't want to eat too much before heading out for the night so tapas was a good move & Ema was delicious! We ALL thoroughly enjoyed the food & there was something for everyone -- meat eaters & vegetarians alike. <br><br>Crowd pleasers: cauliflower, brussels sprouts, smoked charred eggplant dip, rice (from lamb/beef kefta dish), and the falafel. Skip the haloumi...a little too greasy & the kefta was a tad on the dry side but flavorful. <br><br>Will def be back next time I'm in Chicago. Good job Ema!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/H5NKGWAbj3QYvb6HpYBlhA/348s.jpg", "caption": "Lamb & beef kefta."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uoD2YACvL3rkhADk1KawgQ/168s.jpg", "caption": "Pan cauliflower."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rT9ZOgtulwkVwen9pluW7g/168s.jpg", "caption": "Falafel."}]}}, {"review": {"des": "I finally got around to trying this place, and it has become one of my top 3 restaurants in Chicago!! <br><br>First the pita bread was the BEST pita bread I have ever had. It was seasoned deliciously and came out super warm and fresh. It was enjoyed with a delicious labneh dip -yogurt dip with honey and nuts and grapes). Again, the ingredients tasted very high quality and it was the perfect amount of sweet.<br><br>I also really like the basmati ride salad and the interesting combination of textures and flavors. The potatoes were cooked so well and the cauliflower had a delicious seasoning. I'm not the biggest beet fan, so I didn't love that dish but those who love beets definitely would! <br><br>Finally, the service is super attentive and the atmosphere is beautiful and the perfect balance of classy and comfortable. <br><br>Can't wait to come back!!", "pics": null}}, {"review": {"des": "I had really high hopes for Ema given all of the complimentary reviews but  in my opinion the highlight of my meal was the wine we picked from Crete and It just went downhill from there with every course. The worst was was the flaccid fleshy barely grilled octopus. The octopus had been boiled but then barely put on the grill at all when it was served with water still leaking out of its flaccid tentacle on to my plate. Nobody wants a flaccid fleshy pale tentacle. Horrible. Definitely not coming back and I am also going to skip the sister restaurant Aba.", "pics": null}}, {"review": {"des": "Had a great brunch experience here. Love, love, love the interior decor and ambiance - wooden and white-toned, the aesthetic of the restaurant gives off a very homey and classy vibe, and I just felt like sitting there forever. Food was delicious, and my only complain is that the service was a little overbearing - we had different waiters and waitresses checking up on us every 10-15 minutes, which was too much for me.<br><br>Food run-down:<br>- Eggplant hummus w/ house-made bread: delicious, creamy hummus, and the side of house-made bread is so good. A cross between a pita and naan bread, they are brushed with some olive oil and za'atar spices. They taste like toasted pieces of garlic flatbread. <br><br>- Lamb Shakshuka: beautiful, tender pieces of pulled lamb in a hearty tomato stew, this was tasty on its own or with the side of house-made bread. It is on the watery side in terms of a shakshuka, but I had no problems with that. Towards the end this tasted slightly too salty. <br><br>- Lamb Kefta and Eggs: a solid dish, nothing exceptional. The lamb kefta is firm and well-seasoned, and the side of rice and two eggs make this a more filling dish than the other stuff we got.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XILJ0fucSvmNKQEDTa11ug/348s.jpg", "caption": "Lamb Shakshuka, Lamb Kefta & Eggs"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6jNSyIFYSjulfZwnVihpBg/168s.jpg", "caption": "Lamb Shakshuka"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RD_SO_lg-p66FRI1ofaReQ/168s.jpg", "caption": "Eggplant hummus with housemade bread"}]}}, {"review": {"des": "Great food. Love the concept of small shared plates. The pita bread is always my favorite thing at this place. Garlic hummus is my favorite hummus, usually I would like spicy, but here, it's not my fave. Food should get 5/5 stars but the cocktails left us somewhat disappointed. I ordered the \"you're a peach\" and \"jade nightshade\". Jade nightshade was my favorites but I ordered a shot of bourbon to strengthen the cocktail. This made it perfect. <br><br>Order the lamb meatballs for sure. Way better than toothpick lamb.<br><br>Octopus is good as well.", "pics": null}}, {"review": {"des": "This place is really 3.5 stars. I'll break it down for you the reasoning why I'm giving this place 3.5 stars. Let's start off with the most important piece and why you're reading this review...Food.<br><br>We came here for dinner to celebrate Valentine's day. The food is 4 stars. The food is really good. For starts we got the Garlic Hummus. The hummus with the pita was actually really good. But my mentality was I had to ration the hummus because quite frankly they don't give you that much and for $11 you have no idea if they will give you refills. Luckily, our server was very nice and gave us a refill on the hummus for free of charge. For additional food we got the Chicken kefta, lamb and beef kefta, and the grilled octopus. All of the above were extremely tasty, flavorful and juicy. The chicken was very good. Moist tender chicken. Same goes with the lamb and beef. Same goes with the Octopus! Very tender and moist. I don't even like octopus but I definitely liked the octopus here! Now the food definitely made me a fan.<br><br>The 2nd portion of my review will be the atmosphere and bar. It's a beautiful dining area! It's very bright, the noise isn't very loud, it's just a fantastic intimate casual setting. We were lucky to sit in a big row/table, it looked a tad bit dark and out of the loop if you get some of the private tables by the windows but all in all it was a great atmosphere. If you love whiskey/old fashions, you will definitely like their Oaxacan Piece Pipe. And you always know a bar is legit if you're getting a big ice cube with any sort of whiskey drink.<br><br>Now this is where the review gets a bit tough for me to write. A big part of my review will always be about value. For the food you get, it's really pricey. It makes no sense that hummus is $11 and they don't even give you enough. I work in the loop and stop by a local Middle Eastern joint called Oasis (in a jewelry store) and everything they give is less than the $11 which includes a lot of hummus! You get about 4 pieces of each chicken kefta and beef and lamb kefta. You truly have to come in knowing you're not going to overly stuffed. I would recommend going to a place like Kabobi if you're willing to spend a bit extra and get gigantic amounts of delicious food. So the value I will give it 2 stars. <br><br>All in all, Ema is a solid place.", "pics": null}}, {"review": {"des": "So happy that I finally made it here! Ema has been on my list ever since I moved to Chicago and a celebratory dinner was the perfect excuse for Ema! <br>We started with the labneh and the hummus with lamb ragú. The labneh is a soft cheese dip and was served with honey and grapes and a type of nut. It was delicious and was served with a delicious homemade bread that was pita like and had olive oil and zaatar on it- ah-mazing. <br>The hummus with lamb ragú was recommended to us by our waitress and it did not disappoint. Wow!! So much flavor from the lamb and the creaminess of the hummus served with the same homemade bread made for the ideal flavor combinations. <br>Next we had the watermelon and feta salad. It also had some mint and a hint of spice that was unexpected but tasty. We also had the Brussels sprouts which were so good and crispy but with lots of flavors. The beef tenderloin was our final plate and oh boy was that meat tender! Cooked perfectly and served with flavorful rice and a spicy green sauce on the side. We were too full for dessert but so content with our meal that we didn't need it! Cannot wait to come back to Ema with everyone I know!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/w-V05OMoj0b9c7ZK6CRfdA/348s.jpg", "caption": "Hummus With Lamb Ragu and Labneh w/ Honey & Almonds"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RUp8qcnk-c6BU7nnnPk3Eg/168s.jpg", "caption": "Crispy Brussels Sprouts"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IwHAMyKN5PuQhWxlsOH_3g/168s.jpg", "caption": "Watermelon & Feta"}]}}, {"review": {"des": "Great spot in our hotel! Trendy and great drinks / tapas here. It was the perfect spot to come to after a long day of exploring the city. Not only was the staff kind and helpful but the complimentary breakfast was great!!", "pics": null}}, {"review": {"des": "Celebrated my birthday at ema, and our group of 4 had a great time. It truly is the company that matters. The place was packed even for a Sunday night. The place itself was very cozy and contemporary at the same time. There is a fresh vibe as there are vines/leaves all across the ceiling. The lighting is perfect as well and gives it a very luxurious feeling. The waitress told us this was \"Mediterranean California inspired\". I would return just for the ambience! <br><br>Items ordered included (in order of how much we liked it): <br><br>Black Lime Shrimp $22.95<br>Our favorite thing! It tastes a bit like an Indian shrimp curry with heavy tomato and cumin taste. The shrimp was very soft and the dish came with 5 pieces of shrimp. <br><br>Baked Halloumi $14.95<br>Our whole table was a fan of the halloumi with macadamia nuts. However, the figs that were part of the dish felt way too sweet for the dish. <br><br>Crispy Potatoes $7.95<br>Who doesn't love potatoes? These were perfectly crispy and salted and the yogurt (?) sauce they came with was delicious! <br><br>Hummus with Lamb Ragu $14.95<br>I wasn't a fan of this item as I felt it was too bland, but my group really enjoyed it. The lamb ragu is more of a pulled lamb rather than minced lamb, which I wasn't expecting. The texture of the hummus felt a little more buttery than other hummus dishes I've tried, perhaps as if lentils were mixed into the blend? <br><br>Lamb Meatballs $13.95<br>The meatballs were melt-in-your-mouth soft, but the taste was very underwhelming. No salt, no taste. <br><br>Lamb & Beef Kefta $14.95<br>One kebab cut into 4 pieces...felt like a huge ripoff. I would expect the best kefta kebab in the world at that price for just ONE kebab.<br><br>Green Falafel $9.95<br>Nothing special about the falafel here, but the plate came with this creamy beet sauce. I love beets, so I really enjoyed this sauce! Sopped up every last bit with the pita they gave us.<br><br>All in all, the food felt like deconstructed Mediterranean plates. With a very high price-tag for what it was. Our waitress looked miserable, and acted accordingly. When she brought out the dessert with a candle she said \"here is half a slice\" and left our table! Our group found that hilarious. Not even a simple happy birthday? <br><br>Basically the food is okay, the service is subpar, but the ambience is great. I'd love to return for happy hour to catch up with friends with lower expectations of the meal itself.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xamY-GSkirjQjA4JkArecA/348s.jpg", "caption": "Hummus With Lamb Ragu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/f-mnY94rVDfSf7BkZ0Id4w/168s.jpg", "caption": "Baked Halloumi"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wnE1lEKsU8LgbWTc6vSHMg/168s.jpg", "caption": "Crispy Potaotes"}]}}, {"review": {"des": "TL;DR- The rating speaks for itself. Delicious food at a great price with a vibrant but charming ambiance. <br><br>So there was a slight mix up with my first experience here. Now, all the hours for lunch, dinner, and happy hour match up on all platforms.<br><br>Starting with a fresh mindset, I visited Ema one more time.<br><br>Vibes: The atmosphere is charming but also classy. There is both indoor and outdoor seating. <br><br>Service: Our server was AMAZING. She was super attentive and accommodating to my dietary restrictions. (curse you lactose!)<br><br>Food: We ordered the toasted almond and garlic spread (YUM, get it with crudites as well!), roasted beets (I couldn't eat this, but my friend said it was also really tasty), roasted octopus (it was super tender and seasoned very well, also a good portion), chicken kefta (really well season, juicy), pork belly (probably my favorite dish. it was tender and melty and not cloyingly fatty despite it being basically the same cut as bacon), and FINALLY DESSERT. Just get it. The frozen yogurt was so amazingly balanced between sweet and tart.<br><br>Overall, great food and service. The prices are more than fair for how full we were. This is definitely going to be one of the places I recommend to friends/family from now on.", "pics": null}}, {"review": {"des": "Keys to success for a great experience at Ema:<br>1. Make a reservation. This place is literally never empty and the wait times can get ridiculous.<br>2. Split everything! They have a rotating seasonal hummus selection (my favorite is the pumpkin hummus they feature in fall.. is that basic?) and amazing kabob options. The food is meant for sharing so order a bunch and try it all!<br>3. Drink somewhere else. Cocktails are ok but honestly too expensive for what they are.<br><br>4 stars for ambience + food quality!", "pics": null}}, {"review": {"des": "Wonderful Mediterranean spot in River North! Have been here for happy hour and they have fantastic wines and small plates at great prices. Dinner was great too and we got to sit on their patio. <br>Absolutely loved the grilled chicken skewers, the scallops, Greek salad, and Brussel sprouts! Definitely one of the best small plates restaurants in the city. Unbeatable fresh flavors in every dish!", "pics": null}}, {"review": {"des": "Nice place to have brunch. Their dishes comes in sharable portions (mezze), so that you can try a few different things. <br><br>For the spread, I really liked the labneh one is really good, loved the greek yogurt taste with honey. The eggplant one is decent too, the spicy hummus was so so.<br><br>The grilled octopus is pretty good, charred just right and still quite tender and juicy. The greens that comes with it is very refreshing. <br><br>The veggie frittata is pretty good, it's not too heavy, and the salad on the side is very refreshing.<br><br>The blueberry clafoutis is also very good.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fNfZtwbyI0OkLVd5mXtGug/348s.jpg", "caption": "Grilled octopus"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LksFK0lk9QLBQ8b-gPCl2w/168s.jpg", "caption": "Frittata"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fagRu7RhIleevdxJGLaMEA/168s.jpg", "caption": "Spread sampler! Loved the labneh"}]}}, {"review": {"des": "We came to this restaurant a few months ago and have been back many times over the last few weeks.  The ambiance, decor and food make this place amazing.  It's a great place to do family style and share a lot of different dishes.  The different variations of hummus and dips are amazing.  I love the brûléed grapefruit for brunch with the trio of dips.  Their house pita bread is also delicious and they keep it coming.  The falafel and risotto are staples and the deserts are to die for! Definitely recommend!!!", "pics": null}}, {"review": {"des": "Bar is fantastic. The bartenders are incredibly knowledgeable and creative. The wine list is decent and the menu has a great selection of cocktails. I recommend the rose and rosé.", "pics": null}}, {"review": {"des": "I was extremely impressed with my visit to Ēma! <br>-Atmosphere: Beautiful and totally instagrammable with bright neutral colors and greenery.<br>-Service: We made a reservation for 9 p.m. on a Thursday. Although the place was packed we were seated right away. Our server was kind and helpful.<br>-Food/Drinks: I started with the rose and rosé cocktail. It was light and refreshing. My friend and I split one spread (labneh), one cold mezze (watermelon & feta), two hot mezze (crispy potatoes and Brussels sprouts), and one meat (the lamb meatballs). We were very full by the end of the meal and probably could have done with one less item. We took enough leftovers home for my lunch the next day. The labneh is an incredible combination of Greek yogurt, almonds, grapes, and honey served with delicious soft bread. The flavors of sweet and tart come together so well in this dish. I would come back just for the labneh! While all the other dishes were good, the labneh was definitely the highlight. I think the Brussels sprouts were the runner up as they were perfectly crispy with a sweet glaze.<br>-Value: This the best part about Ēma! You can eat a lot and try many things at a reasonable price point. Oftentimes, these nicer small plate restaurants are extremely overpriced. We split 5 items and each had a drink. Including tax and tip our meal was under $50 per person. If we ordered one less item we still would have been satisfied and would have been closer to under $40 per person. I think Ēma is a great deal for a nice meal out. I can't wait to return on my next visit to Chicago!", "pics": null}}, {"review": {"des": "I came here after work one day for dinner with a few people. The wait was 45 minutes if we wanted to sit the dining area, but we sat in the front where the hotel lobby was and it was a nice area to sit as well and we didn't have to wait. I got the chicken kefta and it was as good as it always is!! The chicken was so flavorful. I wish the portion was a bit bigger but I still enjoyed it! Our server was very friendly ! I recommend this place to anyone who wants to try authentic mediterranean food !", "pics": null}}, {"review": {"des": "Ema is a pretty solid Mediterranean spot for any occasion. The decor is chic, menu items are tasty, and Ema is actually quite wallet-friendly despite its hot real estate in River North.<br><br>My visit was during brunch and between 3 people, we shared an appetizer and each got our own main dishes. The total ended up being $25ish/pp, which I thought was fairly reasonable. <br><br>I think many would agree that Ema's specialty lies in its spreads. I would highly recommend the spicy hummus and charred eggplant, though my hands down absolute favorite was the house-made labneh, which tasted like a heavenly cream cheese but infused with honey and other goodness. Spreads come with pita which were rather oily and could be better. The spread sampler is a good option to try a variety, but be aware the portion size was smaller than expected (though the spreads were so dense and heavy that it seemed like a fair portion in hindsight).<br><br>As for the other items, the butternut squash risotto was delicious, buttery, and filling. Lamb & beef kefta was pretty standard and although tasty, nothing worth raving about. <br><br>However, the lamb shakshuka turned out to be a disappointment. The consistency was too watery and oily and perhaps not baked enough. I dipped the pita bread into the sauce but it was so hard to absorb. It seemed like they were trying to skimp out on using tomatoes by watering it down. The shredded lamb was fine, but each bite I took had too much oil and not enough tomato sauce.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UhfMGR7hoAZNFgf8a7rgEw/348s.jpg", "caption": "Lamb shakshuka (kinda watery but flavor was good) and beef & lamb kefta"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fyx-iGDR-ply6BI7kj_RSQ/168s.jpg", "caption": "Butternut squash risotto - soooo buttery and good"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RUF2JF_jkJGmW2rnAsXnGQ/168s.jpg", "caption": "Hummus spread - I LOVED the labneh. Spicy hummus was delicious too!"}]}}, {"review": {"des": "Came here again for lunch, sat outside. Service was very slow. We had to wait a while to order and then the food took a long time to come out. We ordered the lamb stew over hummus which was very oily. Once our food came we didn't see our server again until we asked for the bill. My wife and I were sharing a couple of dishes and no one ever brought out extra plates. I finally took a couple from a nearby table that was emotes. It took a long time for our bill to be brought out as well. Not a great experience. <br><br>On the positive side, the tomatillo and melon gazpacho was fantastic. Light and refreshing with the perfect amount of dill.<br><br>I remember our first dining experience at Ema as being much better all around. Maybe it was just an off day and they were understaffed. Either way, I don't think we'll be coming back for a while.", "pics": null}}, {"review": {"des": "Ended up coming by Ema again since we were looking to grab dinner in the area. While there was no tables available for an hour, the bar luckily had seating for the two of us! Score! Note: definitely put in a reservation ahead if you plan to come.<br><br>Anyhow, this second time around I think I can say that Ema is definitely growing on me. We tried the basmati & beluga lentil salad, charred eggplant (essentially baba ganoush), the pan roasted romanesque cauliflower, grilled chicken kebabs and the rotisserie chicken. Each dish I'd say had a unique delicateness to it and you could tell each ingredient was intentionally picked out to compliment the dish as a whole. My favorites of the night would definitely be the charred eggplant and grilled chicken kebab. The house pita bread goes excellent with the eggplant. And that the zhoug sauce on the side of the kebab... absolutely yums with the tender & moist chicken kebab. <br><br>Anyways, while I didn't end up drinking this time around, I know from past visits the bartenders serve up some awesome cocktails if you're into mixology and such.<br><br>'Til next time, cheers!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1peaJPlqNa4J4Xz2EKeuNA/348s.jpg", "caption": "Rotisserie chicken"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6_eVpAa9r6vQckXp0rKi8g/168s.jpg", "caption": "Pan roasted Romanesque cauliflower"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Apo2GUMyKfT_r-7xAGVttA/168s.jpg", "caption": "Grill chicken kebab"}]}}, {"review": {"des": "I came back here for my sister's birthday because I liked it so much the first time, and it continued to exceed my expectations! We ordered the crispy potatoes again, the almond spread, and the chicken kefta. The potatoes were as crispy and well-seasoned as I remembered! The almond spread was delicious - I still don't really understand what it was, but I just know it was delicious. The chicken kefta was better than the lamb/beef in my opinion and was super good. We also ordered cocktails, which were super interesting and priced well for what they were and they were still strong ($11-$13). I ordered the lavender rum drink and my sister ordered a smoky whiskey drink and both were an excellent addition to our meal!", "pics": null}}, {"review": {"des": "Bright, comfortable atmosphere. Friendly staff. Highlights from the January 2018 menu: spicy hummus, avocado & sweet pea spread, crispy potatoes, Brussels sprouts, and grilled pork belly! <br><br>The Massaya was a well balanced rose and went well with everything.<br><br>If you can only have one thing, don't miss the Brussels sprouts! They're perfect. Woweeeee!<br><br>They have a lovely outdoor space to enjoy in the summer months.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fkUME1JRvscwvMzExuxoiw/348s.jpg", "caption": "Nice wine selection and cocktail list."}]}}, {"review": {"des": "Had reservations for 11:30 Sunday for a group of three. We were seated promptly and the place was pretty empty, but soon got very busy. Ambiance is nice - bright and clean, nice but inviting and not too typical RN bouge.<br><br>I got the chicken kefta and eggs with a magnolia blossom oolong tea. We also shared a spread sampler of garlic hummus, spicy hummus, and the charred eggplant. Our server was helpful in explaining that generally, 2-3 plates pp would be good but that the brunch plates are a bit larger so that one would probably be enough. What we got was a good amount. Even the avocado toast was pretty sizeable. <br><br>Overall, I enjoyed the food, but certainly not phenomenal, especially at the price points. The chicken was tasty but a tad salty. The hummus itself was forgettable, but the mushroom topping was very enjoyable, along with the charred eggplant. The highlight probably was their house bread - it had the perfect texture. I also really enjoyed my tea and that they had a good offering to begin with. What was nice was that they brought out their frozen greek yogurt with a candle for my birthday. This looked very appetizing and it was. It was also quite a bit so we were able to share.<br><br>Overall, the service was very good. The food was pretty good and while I'm not a big tapas person, it is nice for a change and probably is how much I should be eating. Not in a hurry to return, but it was an enjoyable experience.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ae6vIwsG1zBV2HZWMK4MNg/348s.jpg", "caption": "Chicken kefta with magnolia blossom oolong tea"}]}}, {"review": {"des": "Would've given 5 stars but knocked down one star because I felt the vibe of getting kicked out from the restaurant.<br><br>Located inside lobby level of a hotel, which you wouldn't really notice unless you had to go use the restroom. There is valet available for $14 for 3 hours with restaurant validation. 3 hours? We knew we were going to be done in 3 hours.<br><br>Arrived right at 6pm for our reservation for Restaurant Week. Went with 3 friends who are my annual Restaurant Week diners. My friend reeeeeally wanted to try the charred eggplant. I thought nope, not for me. And when I tried it, holy cow! It was SOOOOO good! I think I ate more than what she had. Yuuum! All the other dishes, cocktails were ok. The server was nice and attentive. <br><br>At the end of our meal after 2 hours, I still had half of my cocktail left and we were almost done with the dessert. From about 20 feet away from us, directly facing from our table, the host told my server while looking at our table, what looked like she was telling her to hurry and clear our table. Server immediately came to our table, cordially took our bill and cleaned up the table besides our drinks and water. She wasn't rude nor directly said anything to us. We were still chatting since we haven't seen each other in awhile, finishing our last cocktail. I put on my jacket to hint my friends that it's time to go. The host kept looking at our table, and looked like was telling the next customer that we were ready to clear out the table and paid the bill.<br><br>I get it from the perspective of the restaurant and the next patrons cuz I've totally been there, but why have the 3 hour limit for the valet if they don't want us to dine for 3 hrs? My car was with the valet for 2.5 hrs.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2eanicVKl0zOqOUJA-6iLw/348s.jpg", "caption": "The Last Don"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/P-oJ82hmUvst5nswk1J3_w/168s.jpg", "caption": "Charred Eggplant Restaurant Week 2018"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MUbcYaASx0qV2y8MpYF6VA/168s.jpg", "caption": "Toasted Almond & Garlic Restaurant Week 2018"}]}}, {"review": {"des": "I came here during Chicago Restaurant Week with some co-workers and had a wonderful lunch. The location was walking distance from my office which was great.<br><br>Their 2018 CRW lunch menu was $22/person and included your choice of 3 items: choosing 2 items from their \"Spreads and Mezze\" list and 1 item from their \"Lunch Plate\" list.<br><br>At our table where we passed our dishes around, I tried the spicy hummus, the brussels sprouts, and the charred eggplant. For my lunch plate I chose the Lamb & Beef Kefta Kabob which was delicious; served with lemon, olive oil, tzatziki, and white rice. Beautifully plated, big on flavor, a dash of fresh chives sprinkled on top.<br><br>A few of my co-workers ordered the Fattoush Salad which they were not too impressed with. A compilation of vegetables, pita chip croutons, and dusted with sumac, it didn't feel substantial and was more like a side dish. A nice option for vegetarians/vegans, but not so much a stand-alone main course.<br><br>Regardless, I loved my meal, loved the space, and the décor. The kefta was grilled on a steel skewer and their tzatziki was delicious, I could eat this all day with pita bread. Their ceramic plates were a minimalist slate gray or white flecked with charcoal/deep blue. The aesthetic felt put together with ease, so the focus can remain on the food and flavors.<br><br>Their spicy hummus was fresh and we had some gluten-free diners at the table, so our server gave us crudités (in addition to pita bread). She brought several rounds of fresh veggies which was much appreciated!<br><br>I left here wondering what the Happy Hour specials were, which I now realize is a subtle indicator that a place is five stars. During the meal, I'm already making plans for how to return. What a great place to enjoy small shareable plates with a Mediterranean twist.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JljgoqnAqCLSnttGdaWUnw/348s.jpg", "caption": "lamb & beef kefta kabob"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3iXpQQFfo9F7PDCuSB0_9g/168s.jpg", "caption": "brussels sprouts: shallots, pumpkin seeds, sherry glaze"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/swZws2qli8kAwU7oaTrhyA/168s.jpg", "caption": "spicy hummus: marinated fresno & sweet roasted chilies"}]}}, {"review": {"des": "Great Mediterranean food. Small plates and designed to share. Hummus was super creamy and delicious. Falafel and cauliflower were amazing too. Check out the sticky date cake. Interesting dessert. A flavor you don't find often.", "pics": null}}, {"review": {"des": "I've been to Ema twice for brunch and just love it! First of all I love the bright and airiness of the restaurant - in the summer and when the weather is nice they open up the side windows! The items are perfect for sharing and getting a sample of the different dishes. Here are some that come to mind:<br><br>-watermelon/strawberry/feta salad: unfortunately, this is a seasonal item but it is so fresh! surprisingly not sweet but more on the savory side<br>-spread platter: definitely recommend the spicy hummus and almond hummus. Was not a fan of the avocado/pea hummus<br>-bread pudding French toast: was not sweet <br>-Blueberry Clafoutis: loved this with the yogurt<br>-Lamb Shakshuka: this is a must! The lamb is amazing!<br>-Green Falafel Sandwich: I am picky with falafel because my mom makes the best but these were pretty darn good<br>-Chicken Kefta - I was not a big fan of these.. felt the chicken was more on the drier side and wasn't as unique as some of the other items on the menu<br><br>Hoping to check out their dinner menu next time or their sister restaurant, Aba!", "pics": null}}, {"review": {"des": "I could kick myself for waiting so long to try this place. I live a few blocks away and have walked by a thousand times. My husband and I stopped in around 9 on a Saturday night and were able to grab a couple of seats at the bar--their bar stools are very comfy. The inside is beautiful and there's an extra bar in the back, too. Their wine selection is great as are their cocktails. I got a really nice red wine by the glass from Provence and it was only $12. Honestly I haven't found a great glass in this area for under $16 so I thought it was a steal. My husband had the oaxcan peace pipe cocktail, which was a play on an old fashioned. It was delicious and somehow the tequila worked perfectly with the rye. <br><br>For dinner we shared the hummus, house-made stracciatella, crispy potatoes, and brussels sprouts. It was really all amazing. The hummus was flavorful and the bread they bring out with it is like crack. The cheese was also so fresh and the tomatoes that came with it were delicious. The crispy potatoes were a treat, simple but satisfying, and the brussels were super flavorful with the sherry glaze, it almost tasted like a sweet and sour sauce. The bartenders were very friendly and really knew their stuff. Since the food didn't make us feel weighed down, we finished off with the honey pie with sesame seeds. It was great, almost like a custard. This place is perfect whether you want a snack or a full dinner, and I found the prices to be incredibly reasonable for the location. It's also a great spot if your party has vegetarians in the mix.", "pics": null}}, {"review": {"des": "My Mom and I ventured here for brunch and thoroughly enjoyed ourselves. The food was excellent. We had the avocado toast, potatoes, sweet corn risotto and cured salmon. My Mom also mentioned that her Bloody Mary was one of the best she's had to date. The decor is very reminiscent of a beachside restaurant in Orange County. I deducted one star because the service wasn't great but we were having a great time so it didn't interfere with the overall experience too much.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_3aYahQj1hYDCke13V7m_A/348s.jpg", "caption": "Avocado Toast"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UtLV2LNF5rdszzi9qeFkfA/168s.jpg", "caption": "Sweet corn Risotto"}]}}, {"review": {"des": "One of my new favorites in the city. The food was just delicious. Every bite I loved and I wish I could have tried more. The hummus! OMG perfect. The Labneh was probably one of my favorites. The Basmati & Lentil Salad was so lite and refreshing, I could eat that every day. The crispy potatoes were very crispy and the scallion crema I could have licked the bowl. The baked Halloumi was perfect with little hints of mint and Chicken Kefta was mouthwatering good. We also had the spicy toothpick lamb which was good but tough to share. The only sad note was the roasted beets (which are my fav) but the mascarpone had this hard texture to it that took away from the soft roasted beets. Also the flavor was off putting. The menu says horseradish but I never got that flavor. <br><br>But seriously we had no complaints. Oh and the sticky date cake. OMG it was amazing. <br><br>Yeah I'll be back and I'm bringing everyone I know. So yummy.", "pics": null}}, {"review": {"des": "Came here on a mother daughter date! But since my mother is a really picky eater we got things I thought she wouldn't mind eating, we got the pork belly, rotisserie chicken, butternut squash risotto and honey pie for dessert. <br><br>First off the atmosphere of the place is really nice, I like the fairy lights and the bird cages they have in the restaurant really makes it ambient without it having to be dark, I liked that the place was nice and bright so I could take some nice photos! <br><br>My favorite dish of the three main courses was probably the butternut squash risotto, it was a bit salty, but the risotto was nice and creamy and the squash just the nicest touch of sweet. Next the pork belly was perfectly crisp and savory. The pear and beet/radish (? not sure which) on the side was bright and refreshing. Finally the rotisserie chicken was nice too, a large portion for a small plate, the chicken was juicy and tender - although the bed of vegetables they all kind of tasted similar besides the onion. My mother thought most of the dishes were far too salty, but to me just the risotto was on the saltier side (although I liked it).<br><br>The honey pie was pretty good as well, I really liked the whipped cream that came with, it wasn't too sweet. The grapes that came with were really disgusting though to my dismay. I don't know what was wrong with them, but they almost tasted unripe or bad... not sure which so I ate one and just left them. The crust was nice and flakey and the pie had a nice taste although I can't say the taste accented the honey too well, it was just sweet and sugary. <br><br>Overall a nice experience, but I look forward to trying maybe some of the spreads and the lamb meatballs if I go there with some friends.", "pics": null}}, {"review": {"des": "Indoor Ambience - regular dining space. The bar seating looks good.<br>Outdoor ambience - cute patio!<br>Service - decent.<br>Food- had the <br>1) spicy hummus with pita , absolutely delicious. <br>2) crispy potatoes- crunchy & tasty.<br>3) chicken kefta- a real good plate. <br>Overall , loved it here! Will definitely go back again!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/o-ILb31hEHULIU4l8YzRdw/348s.jpg", "caption": "Spicy Hummus"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Uu3T-vLv-lWPc_ERlFGK7A/168s.jpg", "caption": "Chicken Kefta"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sIk5g0bkRbeVx64-jn1upA/168s.jpg", "caption": "Spicy hummus!"}]}}, {"review": {"des": "Great atmosphere and food! We ordered 5-6 plates for 3 people and it was a lot of delicious food. I would highly recommend their spreads especially the eggplant one - spreads come with amazing pita bread and you can order free refills on the bread!:) <br>Every corner is picture perfect and they have great service! Definitely keep this on your itinerary on your next trip to Chicago!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4BlceiLOm-DFykmSiF73mA/348s.jpg", "caption": "Beef Tenderloin"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7RLZMA6eoXge-FehilP6sw/168s.jpg", "caption": "Lamb Lamb & Beef Kefta"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MjjVoKKWrPk62F9O4j9DVw/168s.jpg", "caption": "Brussels Sprouts & roasted broccoli"}]}}, {"review": {"des": "Wow - this place was really special. Excellent food with simple ingredients, proper presentation and delicious flavors - no frills, no shenanigans - this is how food should be. One of my favorite finds in Chicago for sure.<br><br>From the dishes we had, I'd recommend the eggplant spread, the special Stracciatella and the chicken kabobs. Everything we tries was really excellent - these just stood out.<br><br>Also the portions are nice, you don't feel overstuffed afterwards. We also had cocktails that were good as well.<br><br>Definitely 5-stars! Thanks.", "pics": null}}, {"review": {"des": "I was SO looking forward to eating here during our weekend trip to Chicago, and Ema did not disappoint.<br><br>We came here on a snowy Sunday for brunch at 11:30. It also happened to be Chicago Restaurant Week, but we opted to eat from the regular brunch menu. <br><br>For starters, we shared a sampler of spreads- the hummus, garlic hummus, and the labneh. The hummus was incredible, and the labneh was one of the best things I've ever eaten, especially with the honey drizzled on top. The pita was perfection! We also shared a drop biscuit with jam and whip cream, which was also quite tasty. <br><br>I ordered the lamb and beef kefta and my husband ordered the lamb shakshuka. My lamb and beef kefta was seasoned and cooked to perfection, and my husband enjoyed his shakshuka.<br><br>We loved everything from the food to the ambiance to the decor and service. <br><br>My only complaint was our waitress; she seemed way less than enthusiastic about serving us! The other staff, however, did an excellent job of clearing our plates, refilling our drinks, etc. <br><br>I would highly recommend this place to a friend, and we can't wait to visit next time we are back in Chicago!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8_QXcquT3_xXi1_gpjkm_Q/168s.jpg", "caption": "Lamb & Beef Kefta"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QPxh443JJcRN0yfxTggYoQ/168s.jpg", "caption": "Spread Sampler"}]}}, {"review": {"des": "Trendy, swanky, cool are all good words to describe Ema, a Mediterranean restaurant with a well-known chef C.J. Jacobson, who's appeared on Bravo's Top Chef, at the helm. Located off the lobby of the Hyatt Place River North in Chicago, it's convenient for guests but I bet a lot of their patrons are from other places like us. Came here to have dinner on our last night In Chicago. I'm a big fan of tapas and small plates, because I love trying multiple things and don't feel as stuffed after eating. <br><br>We came here without a reservation and were lucky enough to snag a seat just outside the main restaurant area on a couch. We didn't mind that, and were just happy to not have an hour's wait.  Started off with cocktails.  I decided on the \"you're a peach\", which consisted of vodka, Campari, and creme de peche. It was smooth, not overly sweet, and tasty.  <br><br>Next we decided on some tapas, the brussel sprouts, roasted cauliflower, avocado and sweet pea spread, crispy potatoes and pan seared scallops.  My least favorite was the roasted cauliflower.  It was served with a yogurt and honey, but I really could not discern the honey in it.  The cauliflower was also too chunky, would have preferred smaller pieces.  It just tasted kind of bland to me, too.  The crispy potatoes were decent, but a little bland as well even with the scallion and rosemary.  I loved the brussel sprouts, which had pumpkin seeds mixed it and was drizzled with a sherry glaze.  They were nice and crispy, and really loved the addition of the seeds in there.  Delicious.  I also loved the avocado and pea spread. First of all, the bread alone was really good.  It was a Naan-type bread, but it was seasoned, which I really liked.  It was soft and fresh, and went great with the pea/avocado.  It tasted so fresh, and I loved the combo.  My boyfriend, however, did not care for it, but he dislikes avocado, and I think the texture was a turn-off.  The scallops were the main dish for us, and they were good, but not rave-worthy.  <br><br>Liked the ambiance, the drinks, service was good, but the food was either hit or miss for us both.  I'd come back, but be selective in what I'd order again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/R5xJ_CKP6g2Tc_9eRGs1PA/348s.jpg", "caption": "Yummy Crispy Brussel sprouts"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sTM4N_BaZTJ52YjUeaU36w/168s.jpg", "caption": "Avocado & Sweet Pea"}]}}, {"review": {"des": "As a native of the metro Detroit area, a city with one of the largest Middle-Eastern settlements in the U.S.,  I'm pretty particular about Mediterranean food.  Needless to say, I'd been less than impressed with a lot of the middle eastern food I'd tried in Chicago.  I was intrigued to find that Ema was offering an elevated spin on traditional Mediterranean fare and had to go check it out.<br><br>The food was out of this world.  Judging off food alone, Ema could easily get 5 stars.  We started with the hummus with braised lamb ragu, which was absolutely delicious and can make for a meal on its own.  It was rich, creamy, savory and decadent and went perfectly with their seasoned pita bread which was more like a cross between pita and naan.  Out of everything we ordered this was definitely the star of the show.  For \"entrees\" (I use quotes because their food is served tapas style) we ordered the rotisserie chicken (so juicy) and the lamb and beef keftas.  Sides were pan roasted romanesque cauliflower and crispy potatoes served with scallion crema, which were truly addictive.  We finished the meal with the sticky date cake, which was rich, spicy and perfectly balanced with the whipped cream and crispness from the caramelized sugar.<br><br>I had to take one star off due to the seating policy.  I dine out in the city all the time so I'm, of course, very familiar with the policy of mandating that the entire party be present before being seated.  I was a little annoyed, however, that as a party of two they wouldn't seat me while my husband was parking the car.  Unless they force parties of 1 to sit at the bar, if I was coming alone I would still be seated at a table for two so the policy in this case didn't really add much to their bottom line in my opinion, rather just creating an inconvenience for the customer.<br><br>I def plan to be back and have told my friends about Ema already.  I look forward to trying their more casual, sister restaurant, Rotisserie Ema, in the future.", "pics": null}}, {"review": {"des": "Really delicious spreads, get the sampler for sure (you could even skip the hummus, the less conventional spreads really shine).<br><br>The absolute best thing I have had in Chicago is the straciatella di buffala here, in a panzanella like salad with heirloom tomatoes, shallots, and sourdough croutons. I. Died.<br><br>Service was great and we were seated quickly. Pacing of the small plates was a little off, thus 4 stars. We ordered the Brussels sprouts but didn't receive them until after we were both stuffed and got the check unprompted, so we sent it back", "pics": null}}, {"review": {"des": "I admit I'm loathe to find a place to eat in this neighborhood. But they're often staying downtown, so it becomes a necessity so they don't have to travel too far. There are times when we have something going on nearby too. What can I say, River North is a convenient neighborhood. <br><br>In comes Ema and wow, just wow! Integrated into a Hyatt Place on a busy corner, you'd never expect to find food of this quality. I didn't anyway. I had done some Yelp research earlier in the day, and called to see if we could score a dinner reservation for three that evening. They were expecting a large party just after we planned to meet, so that was a no-go, but they offered their lounge. It turns out the lounge is in between the restaurant and the hotel, and completely benign in terms of decor. Still, the full menu is available there, so it was an option. Upon arrival, the friendly hosts offered this space. However, by the time the rest of our party arrived, they had a table for us in the dining room. Yay! <br><br>The dining room is also sparse in terms of decor - pleasant but by no means striking or distracting. Our table had big cushy leather chairs which looked heavy but had wheels(!). <br><br>Once seated, the server came over and gave us some advice on what to order. We ordered a reasonably priced bottle of wine to start. We negotiated a few dishes each and ordered these: <br>House-made Lebneh = a favorite for it's creamy cheese and bursts of olive and grape flavor; order this but don't eat the olive stems;<br>Charred eggplant = this was one of the few 'meh' dishes, resembling standard hummus;<br>Feta and olives = absolute standard fare for Mediterranean small plates and for good reason!; <br>Brussels sprouts = the char on these paired with the sherry glaze is just off the chain;<br>Grilled octopus = also standard fare; a must-order if you like octopus and flavor for days;<br>King salmon = served on a skewer over a bed of rice; This was the only other dish besides the eggplant that didn't blow us away. Don't get me wrong, the fish served over a bed of rice was cooked perfectly. The included zhoug sauce, though, was slightly bland. Sadly there simply wasn't anything exciting here. At $18 I wouldn't order it again, especially given all the other options. Speaking of those options... <br>Celery Root & Leek Soup = it's unbelievable how much flavor and texture was packed into this small bowl. Warm, smooth, slightly salting, inviting, mushroom-y and, in a word, wonderful. Skip that salmon and order one of these for everyone in your party! <br><br>If you've read any of my reviews before you'll know the best food in the world doesn't much matter without good service. Ema doesn't disappoint in this area either. The staff kept our water and wine glasses full. They delivered plates as they were ready, creatively finding ways to fit them onto our table. They also clearing plates but only when we allowed them to (there were several that warranted eating down to the last bits). Ema's service hits that perfect sweet spot of being 'attentive without being annoying'. <br><br>I think the only negative I could add is that the restroom, as being part of a larger facility, requires a bit of a trek with many turns. It's not to the point you need to leave a trail of bread crumbs to find your way back, but not that far off either. Being a former New Yorker, I generally walk towards the back to try to find my own way locating the restroom. If you do that here you'll walk right into a prep area. Oops. Most people (read: ladies) are smarter than me and will ask first. <br><br>In any case, that's a small niggle in an otherwise extremely pleasant experience. If you're down with sharing small plates with your party and finding at least a few dishes everyone will love, you'll have a hard time finding a better restaurant around. Especially in this neighborhood!", "pics": null}}, {"review": {"des": "I was pleasantly surprised by Ema! This was the first downtown restaurant in a while that I thought was pretty good and worth the cost.<br><br>I stopped by Ema for brunch and ordered the Spread Sampler (Garlic Hummus, Charred Eggplant, and House-Made Labneh), Blueberry Clafoutis, Grilled Pork Belly, and Grapefruit Brulee. Of the spreads, my favorites were the Labneh and the simple Garlic Hummus. The Labneh was wonderfully creamy and had just the perfect amount of sweetness with the honey added. I also liked the addition of crunchy almonds; the pita bread that went with the spreads were delicious as well. The Clafoutis was extremely fluffy--it wasn't your typical brunch pancake. Normally, I don't really like to eat pork belly since it's too fatty for my taste, but the pork belly here had the perfect balance of lean meat and fat. It was wonderfully grilled and actually tasted pretty good with the pita bread. Finally, the Grapefruit Brulee was a nice, refreshing side dish to the entire meal.<br><br>Recently, I have been disappointed by the quality of many restaurants in the downtown area, but Ema was a wonderful exception. I am looking forward to coming back to try the other menus sometime.", "pics": null}}, {"review": {"des": "Excellent  restaurant. Went as a party of 4 for dinner. Ordered 8 small plates which we shared. Great for tasting different dishes and surprisingly filling at the end. 3 different types of cocktails and each one as good as the next.<br>This restaurant is perfect for groups of 3-4 persons.", "pics": null}}, {"review": {"des": "Always a hit. The crispy potatoes and hummus are something I crave even when nothing else sounds good. Just had their pumpkin hummus and branzino off the fall menu and was blown away. Not a fish fan, but the branzino won me over. Good drinks, love the atmosphere and theme", "pics": null}}, {"review": {"des": "This review is totally past due (I came here for dinner in November) but as someone who doesn't consider Mediterranean food to be in my top 5 favorite cuisines, I just wanted to put it out there that I really enjoyed the food here at Ema!<br><br>I shared the:<br>-Miso hummus<br>-Flat bread with pumpkin spread, pomegranate, kale <br>-Fattoush salad<br>-Pan roasted romanesque cauliflower<br>-Squash risotto<br>-Frozen greek yogurt for dessert<br><br>My all-star favorite of the night was the flat bread with pumpkin spread. The kale was so crispy and worked well with the sweet pop of the juicy pomegranate seeds. Divine!<br><br>The one thing I wish I skipped was the Fattoush salad. There wasn't anything bad about it, but it was a pretty standard Fattoush salad. <br><br>I also loved the interior. White paint, light woods, very Goop-chic.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_DzdMzaeLqUpz0xmEYB26Q/348s.jpg", "caption": "Greek frozen yogurt"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kRR1nQUFLu798WM-gNsNUg/168s.jpg", "caption": "Risotto"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LS9sYtu9btn1HrmOBU0sDw/168s.jpg", "caption": "Cauliflower"}]}}, {"review": {"des": "This was an amazing place to get brunch. We went at a peak time (12:30 on a Saturday), but there was no wait and plenty of tables. The space is bright and airy, with a lot of wood decor. It was really relaxing - the noise level was low enough to chat with your friends. <br><br>The food was tapas style, so we ordered a feast. All of the food was delicious and also tasted clean - nothing was overly oily or heavy. The flavors were delicious but not too complicated at the same time. I think they use high quality ingredients.<br><br>The bacon was deliciously sweet and savory. The brulee grapefruit is a must-have - it literally tasted like a breakfast cocktail. The spread of dips was delicious and fresh. The kebab and egg plate was also amazing. Even the fried egg had a nice savory flavor. I really enjoyed the salad that came with the frittata. The frittata was solid but I enjoyed our other dishes more.<br><br>Service was great and our waitress did not rush us at all. They also packed up our leftovers in reusable microwave safe containers, which was awesome. Even though we ordered so much food, the price was very reasonable. I would definitely bring friends here again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dNuoftWbsT_mtj8SaIWsCg/348s.jpg", "caption": "Sampler plate, avocado toast, strawberry drop biscuit, bacon, brulee grapefruit"}]}}, {"review": {"des": "Wow.  This place was great.   Cool vibe/music.   Had the lamb & beef kefta, Brussel sprouts, and another app.  <br><br>Had 2 nice white wines while here on business.", "pics": null}}, {"review": {"des": "This place is the bomb!!  I grew up in Glyfada Greece and love Greek food.  My wife took me here for lunch and I could have stayed all afternoon and then just moved into dinner.  We had several small plates and they were all fantastic!  I'll defiantly be back every time I'm in Chicago!", "pics": null}}, {"review": {"des": "Really enjoyed this place. Sat at the bar with Kendall and sampled a bunch of appetizers. Squid was excellent, hummus and falaffel were good. Nice staff and quality service.", "pics": null}}, {"review": {"des": "Delicious Mediterranean restaurant.  Hummus was outstanding! Also the butternut squash risotto was so good we ordered it twice.  Small plates to share. Good cocktails.  Loved it!", "pics": null}}, {"review": {"des": "Lovely night with my girl. A toney spot with beautiful people and a lively but chill vibe. Deep house pulses softly in the background. Service is flawless. The Med inspired tapas offering are appealing. We loved the charred eggplant. The bread dusted with Zatar, is to die for.  The tiger shrimp was too salty to enjoy. The cauliflower was ok. We liked the chicken kofta was tasty. We also had olives and feta. The star was the Nessla kombucha!! Few places offer booch!!  The bathroom is shared with the Hyatt. It was rather sketchy!", "pics": null}}, {"review": {"des": "I was so excited to try this place for months! So disappointed.$30 lunch without alcohol? Just thinking of all the better food I could had put in my mouth! Met a friend for lunch today. First we were seated at some weird table with awkward couch like chairs that were too low for the table. We asked the hostess to move and were kindly accommodated. Our waitress was nice & quickly brought water. I was curious to try one of the kefta kebabs, but didn't want rice on the side and asked if there is any substitutions. I was told no. So instead I went with the Mediterranean chopped salad with dressing on the side & shrimp on top. Dressing on the side seems to be the hardest request in the city, but she got it right! Sadly the shrimp was super dry, charred, and look like it had been frozen. And for the additional $8, there were only 4 small shrimp...I tried one and sent them back. She asked if I'd like a different protein, to where I hesitated, pretty confident that a substitute would be just as bad, but opted for the octopus. It at least tasted fresh instead of frozen, was a more decent portion although, $10, not $8. However, it was still charred to the point that it was inedible to me! I brought it home for my husband as he enjoys a bit of char from time to time.<br>The atmosphere is cute at least. Maybe just play it safe, go for some wine with friends, and some hummus or the chicken kefta that looked good that my friend ordered. Or, save your $ and go someplace 10x better!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xY5AP8dOCy_PkJbQ4r79zg/168s.jpg", "caption": "Left over charred octopus"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ycGVOStB7AUOLy5v7rsDag/168s.jpg", "caption": "Mediterranean Chopped salad"}]}}, {"review": {"des": "Ambience is great! By far, butternut squash risotto is so delicious! I took 2 teenagers with me and they loved it! At first we were worried there wouldn't be enough food but we were stuffed by the end of the meal- I would recommend the sticky date nut cake-it was awesome!!", "pics": null}}, {"review": {"des": "My wife and I are huge fans of Mediterranean food, finding it one of the few cuisines able to thread that elusive needle between \"tastes delicious\" and \"I'm not going to die young\". Ema managed to hit that mark while bringing with it an innovative and modern approach to menu design. <br><br>Their menu is composed of a moderate variety of thoughtfully composed and balanced dishes, small plates intended for sharing and exploring ranging from hummus, salads and light appetizers to full Mediterranean fish feasts. The small plates format is an excellent choice for an intimate date night, or an evening of exploration with friends and family. While not exactly cheap, the prices are quite reasonable for a trendy date-night spot and sans-drinking you can expect to spend about $30-45 per person here for a very satisfying meal.<br><br>Our two favorite dishes were the first two we sampled, the Pork Ragu Hummus and the Watermelon & Feta salad. <br><br>The Pork Ragu Hummus was phenomenal, with a rich developed flavor from the ragu that was perfectly complemented by the housemade hummus and za'atar seasoned pita bread. This hummus was an explosion of savory, porky goodness and everything you ever imagined you could achieve by adding slow cooked pork to a vegetarian side dish.<br><br>The Watermelon & Feta salad also captured our hearts and stomachs, striking an effortless balance between the salty bite of the feta, the refreshing and sweet crunch of ripe watermelon, and the fresh herbs and seasoning.<br><br>Other highlights include the Baked Halloumi, and the Black Lime Shrimp.<br><br>Not to be forgotten was the Honey Pie with sesame and roasted grapes for dessert. This decadent treat had a beautiful smooth texture reminiscent of a thanksgiving pumpkin pie, but with a flavor more akin to Baklava. Definitely do not skip the dessert if you are a fan of sweets with a savory twist, this one really hit the mark.<br><br>We will be taking our in-law's back for dinner this week, and are excited to sample the dishes we missed last time!", "pics": null}}, {"review": {"des": "Came here a 2nd time. My wife would give it a 5 but I'm still not there. Almond and garlic spread was good and the bread it comes with is delicious. Lamb meatballs have a nice texture but there isn't a lot of flavor. Black line shrimp was good. The sticky date cake was definitely interesting and tasty and worth trying.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CpJ7sZND6eWUzwkcFi3hEA/168s.jpg", "caption": "Lamb & Beef Kefta"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lFr7Wt_O_IZVwwWN6Wlksw/168s.jpg", "caption": "The White Walker"}]}}, {"review": {"des": "Ate at the bar and Hailey took care of us, she was awesome. Food was delicious and drinks were on point. I would definitely go back.", "pics": null}}, {"review": {"des": "Came here with some friends for some brunchin' on a warm and sunny day. <br><br>We sat outside on the patio because awwww, yeah, patio. Get it while you can! The service was a bit slow, but we got two of them (one a trainee) so, hey, that's cool. It was a bit sloppy, which seemed more an issue with whomever making the coffee overfilling it. I'm not going to blame the server for it slopping everywhere (I routinely spill things out of mugs, so I get it), but the barista or whomever really needs to put less in the coffee cup so it doesn't spill everywhere the instant you try to move it. (I have a similar complaint with cocktails. Why do people overfill? Stop it! It's not \"more for the money\" if I spill a bunch!)<br><br>I started with a local cider because, despite it being 70+, I wanted to have a good fall beverage. I really enjoyed the cider, and the server was kind enough to tell me where I could buy it locally. (Thank you!)<br><br>I had the lamb ragu and really enjoyed it. It was very tasty and very filling. I also tried some of the crispy potatoes, which I really liked. I was intrigued by the bulgur risotto my friend ordered, mostly because I hate making risotto but love bulgur, so I'm pleased such a thing can be ordered in a restaurant. The chicken kefta was also pretty tasty.<br><br>We had two desserts: the date cake and the honey pie. Both were delicious, but I would pick the date cake over the honey pie for sure. It's supposed to be a renowned honey pie, but I'm not a huge fan of honey pie normally. I don't not like it, but y'know, meh. I can take it or leave it. I did enjoy this one quite a bit.<br><br>I think I'd probably come back sometime to try their dinner offerings if I was nearby. I liked it just enough for that. It is unfortunate they're so near the fire station, though, so I'd probably skip the patio.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4xdqpQ6JYV1dN0KariQ2tw/348s.jpg", "caption": "honey cake."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ha-mHzsJg-qP4QygBH3SxA/168s.jpg", "caption": "crispy potatoes."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jctyABZaYfcBQ236_aUQBg/168s.jpg", "caption": "lamb ragu and baked egg."}]}}, {"review": {"des": "Always great food, beautiful atmosphere. I'm there a few times a month! Try all different flavors of hummus. Excellent choices of seafood and meats too.", "pics": null}}, {"review": {"des": "Every dish we ordered was great. The plates came out staggered and were replaced with our next order as soon as we finished. We were seated in the lounge area of the hotel next door and ended up enjoying the quiet even more. We really liked the roasted beets!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_O9mUHahUiwivFSypYyA0g/348s.jpg", "caption": "Lamb hummus, lebenah and amazing roasted beets!"}]}}, {"review": {"des": "O.M.G. how did I JUST discover this place?! Ema set the bar very high in terms of modern Mediterranean food. I came here with a group of 3 girlfriends to celebrate my engagement. Ema is absolutely beautiful at night with the lush green ceiling, string lights and woven basket lights.<br><br>Besides the decor, the food is absolutely phenomenal. We ordered a bunch of plates to share including the spicy hummus, house-made labneh, crispy potatoes and brussel sprouts (along with two other dishes that I don't remember). The house-made labneh was my favorite, especially when paired with UNLIMITED NEVER-ENDING PITA!!! Holy moly. The pita was perfectly seasoned and salty and oh so delicious. This went along well with the labneh which was sweet because it's made from roasted grapes and burnt honey. We also got two bottles of champagne which came with a glass of raspberries. <br><br>The service was great as well as our server routinely checked up on us and made sure our champagne glasses were full at all times.", "pics": null}}, {"review": {"des": "This is tied for the best small/medium shareable plates restaurant in Chicago (tied with Publican - but very different menus). We went for brunch and were blown away. We got the blueberry clafoutis (5/5), fresh berries and fruit plate (5/5- best fruit plate I've ever had at a great price), egg white frittata (4/5-a bit too salty), fried chicken sandwich (5/5), and asparagus risotto (5/5 - best risotto ever). The service was good, the waitress was nice, and the ambience is gorgeous and refreshing! The table next to us got the brussel sprouts and I overheard them say they were the best brussel sprouts they've ever tasted. We will definitely be coming back again!", "pics": null}}, {"review": {"des": "A bit disappointed given the high ratings. It was a packed Friday night and the server/bartender said they couldn't get quality avocados for the green falafel so they were using beets instead. Well, I also had my mind set on the beet salad so I ordered both offerings anyway. The falafel was quite dark in color and so hard that I had difficulty penetrating these little golf balls with a table knife or fork. They tasted good and soft within once cracked open, but they were overly crunchy. Apparently they couldn't source good beets either; neither the red or gold ones in the dish had any hint of sweetness and were chopped into large random chunks that did not accentuate their flavor as slicing does. Pretty flavorless, and the mascarpone smeared directly on the plate was quite stiff; it didn't add much. Had to ask for some lemon wedges to amp up the flavor a bit. Maybe more care is taken on less busy evenings!", "pics": null}}, {"review": {"des": "Dave, the manager at Ema went above and beyond in his customer service abilities. The Uber Eats driver had delivered an incomplete order as they left one of the two bags at the restaurant. Uber made it very difficult to have the remaining back delivered to our office. Dave, who is one of the managers at Ema was very kind enough and made sure the food got to us. We were very pleased and the food was delicious. Thank you for the great service. <br><br>Kasia", "pics": null}}, {"review": {"des": "Straight up my favorite Mediterranean reataurant in Chicago! The quality of every food is excellent! So upset that I didn't take picture of the food, because I forgot to bring my phone that day, but believe me they're beautifully plated and taste as good.<br><br>We had mezze style food. My friend and I had their Pan Roasted Romanesque Cauliflower and green falafel, which are absolutely delicious!! We had their risotto too. Ahh and a bunch of other stuff!!! Best part for me, just because I'm a sweet tooth, was the dessert! Will come back and remember everything and take pictures for sure.", "pics": null}}, {"review": {"des": "whoa where to begin with this place, first off its easy to find! walking in, it kinda felt like a pottery barn lol, but we were greeted right away and asked if we had reservations, we did not. it was a tuesday around lunch time, so there was def a lot of people around, but we were seated right away near the bar, the seating was very close to each other, i guess if we made reservations the seating would of been better lol. as the main dinning area looks like plenty of room. <br><br>since it was lunch we opted to try the sampler, i did the Labneh, Toasted almond & garlic and Avocado and sweet pea. OOOOOmg, it was soo good, i wanted to eat just jars and jars of it, the Labneh was the star among the 2 other stars lol. it was all good, i wish more bread was supplied, i mean i HATE hummus and just anything about it, but omg this has def changed me for it. id come there just to eat that. we also ordered the Lamb & Beef Kefta because well i wanted some meat lol! it came with i think rice or orzo, that was really good too i could of ate a bowl of that on its own too. the lamb was good too since i normally cant eat lamb as the taste is too gamey for me, but i loved it. this place def did change my way of viewing items id normally would never order. <br><br>i would def come back here, it was a great place to just relax and eat light bites, that were pretty healthy i think and it looked like a great place to grab a drink or seven. hahah. the price for our sampler and kebab for 2 people who were well fed was about 36$ with tip so that was pretty reasonable to me.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7kWLOWF9hTf3BKPdcKz4EA/168s.jpg", "caption": "Lamb & beef kebab"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xZvztGjVT7GlEm1_mADHng/168s.jpg", "caption": "Labneh, toasted almond, avocado and sweet pea"}]}}]}