{"name": "25-degrees-chicago", "reviews": [{"review": {"des": "A vegetarian walks into a burger joint.....and this place just exceeds my taste buds from resisting. Not a burger of course but the Kale salad with champagne vinaigrette. Again a KALE salad. It is absolutely delightful. I've gone back just because I was craving it. The nachos are exceptional. You cannot leave without trying them. And of course for all my meat lovers you can always add chicken to the nachos.<br><br>Also every time I've gone the service has been excellent. Each time the waiter/waitress went above serving. They don't offer Micheladas on the menu but were more than willing to ask the bartender to make it. It should definitely be on your list to check this little swanky burger place out.", "pics": null}}, {"review": {"des": "It's been my first time back in a long long while and I hate to say it but... the burger is still amazing. Honestly, one of my favorite burgers in the city. The taste just sticks with me. The burger is great because it tastes like the meat has seasoning and flavor and not just the condiments that go on top. As a whole every single burger on this menu has been perfectly curated to taste like perfection.<br><br>Have I convinced you yet? <br><br>Cocktail/wine/beer selection/bottomless :  good<br>Ambiance: plush velvety vibes with cozy feels<br><br>The only disappointment I have with this place is the brunch \"appetizer\" selection. Or the lack their of. Ordered the quesadilla and onion rings to start which the server mistakenly never fired on time or told the kitchen because it came out after our entrees. The chorizo quesadilla was about 12$ comparatively to the 14$ burger. And sort of tasted like a chorizo grease hodgepodge which no where comes close to the comparison of the delicious burger. The onion rings a greasy flavorless boring side that needs a sauce. <br><br>No more need to ramble on because I still love this place as a long time customer and many more visits to come.", "pics": null}}, {"review": {"des": "*3.5/5 stars*<br><br>Not bad at all, but really not all that great. The atmosphere here is what you'd expect from the location. Lots of business bros and their ladies, in a poorly lit space, with a really nice bar running down the middle. <br><br>The food...oh man, the food. It has such potential to be great. <br><br>First of all, the menu is a la carte. I didn't see it mentioned anywhere, but be warned, it can get pricy very quickly. We had the number one and three burgers, the onion rings, and the brunch quesadilla. <br><br>The burgers were good, but just good. I like the variety of the burgers; each seemed so different from the last that it was hard to choose. I also like the strict \"no substitutions\" rule they have. The onion rings were trash. They were flavorless and greasier than Pony Boy from The Outsiders. The quesadilla seemed like an afterthought; like something that got thrown together one night when the kitchen manager was drunk.  No good at all. We had an issue where our quesadilla came out after the rest of the food, but that's okay, because we didn't even want more than a bite. <br><br>Basically, stick with the burgers, because they're good. The service was also good. Nothing amazing though, on any count.", "pics": null}}, {"review": {"des": "Service was amazing and they have a great happy hour special. $5 beers/well drinks and half off wine and apps. The wings and brussel sprouts were a stand out.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/J_9s1BtKoNAH3wfK38YP5g/348s.jpg", "caption": "Edamame"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sonfvKFffvWvuNI_VwoQmg/168s.jpg", "caption": "Brussel sprouts and cauliflower"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4f0hrYVo1QB0ybgxmJ3exQ/168s.jpg", "caption": "Wings"}]}}, {"review": {"des": "(English)<br>After a long Saturday night, your body is very low on nutrients and probably very dehydrated. Therefore, finding the best source of carbs, fats and proteins may be the best way to replenish all those nutrients you're lacking. <br><br>25 degrees is the place. It is a perfect casual atmosphere to relax, have good food and go out with friends. <br><br>We ordered the Number One, Number Two and Number Six burger. All three were spectacular! The meat, you can tell that is high quality and well seasoned, the ingredients of each burger where SPOT ON depending on the taste you may have. And the large side of sweet potato fries I really enjoyed. <br><br>The server was really nice and friendly. When ordering we showed a picture to the waitress of some tacos that we wanted to order and they brought a totally different dish, but they were very kind and understood that it was not what we expected and they took it out from our tab. You definitely need to try this place their burgers are the BOMB! <br><br>(Español)<br>Después de una larga noche, el cuerpo tiene muy pocos nutrientes y probablemente esté muy deshidratado. Por eso, buscar la mejor fuente de carbohidratos, grasas y proteínas puede ser la mejor manera de reponer todos los nutrientes que te faltan.<br><br>25 grados es el lugar. Es un ambiente casual perfecto para relajarse, comer bien y salir con amigos.<br><br>Pedimos la hamburguesa Number One, Number Two y Number Six. Las tres estaban espectaculares! La carne, se puede notar que es de alta calidad y bien sazonada, los ingredientes de cada hamburguesa estuvieron deliciosos dependiendo de los gustos que puedas tener. Y la ración grande de batatas fritas que realmente disfruté.<br><br>El servidor fue muy amigable. Al ordenar le mostramos una foto a la camarera de algunos tacos que queríamos pedir y trajeron un plato totalmente diferente, pero fueron muy amables y comprendieron que no era lo que esperábamos y lo quitaron de nuestra cuenta. Definitivamente necesitas probar este lugar, sus hamburguesas son una BOMBA!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/c0-AHBC9OJ8rbi-qkAWWIg/168s.jpg", "caption": "Number Six(left), Number Two (middle), Number One (right)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/myKPcDI4dq6h9X2FD5xxLw/168s.jpg", "caption": "Number Two"}]}}, {"review": {"des": "There is a very thin line between pleasant fun boozy brunch...and ridiculous crazies using brunch as an excuse to act a fool. This place gets it right. :) <br><br>I had just left the Fremont after witnessing what looked like an Armageddon unleashed by some drunk horny evil devil brunch deity. Like seriously....whoa. so we kindly left and began searching for a better River North brunch option. <br><br>Thank God for 25 degrees. The food was really good. The $12 bottle of champagne deal was reasonable. And people were pleasantly drinking and behaving like adults. Service was really good as well. I'll definitely be back.", "pics": null}}, {"review": {"des": "Pretty good burger. Juicy and great flavor. It did fall apart but that's not necessarily a bad thing. I don't mind if the flavor is there. <br>Good service for lunch. It wasnt very busy so I could get a bit of work done on laptop eat in peace and enjoy good food.", "pics": null}}, {"review": {"des": "Honestly 25 Degrees has been Yelp bookmarked for a while and finally stepped in today ready to satisfy curious tastebuds! <br><br>First impression: great burlesque-meets-sportsbar inviting ambiance, lively music, and a hipster 30-something crowd predominantly male. Turns out weekends between 11-3 they offer $12 Champagne bottle service with small pitchers of OJ which is truly a deal in the heart of downtown Chicago! Totally chill vibes with no pretense.<br><br>The Menu: Everything looked fantastic! It was tough to decide especially when the plates across the restaurant tables were causing some drool but decided to order up an 8oz. Seared Yellowfin Tuna Burger with Butter Lettuce Bun ($15) and Spicy Aioli along with a small $3 side order of sweet potato fries (all items are a la carte). <br><br>The Service: unfortunately almost non-existant which makes me utterly sad to fairly dock a star for what would have otherwise been a Five-star Review! I seated myself, thewaiter probably knew the people at the table adjacent and walked right by me at least 4 times before I got up to ask the bartender if I could get a menu and order through him and was told I needed to go through the waiter. I sat another 10 whole minutes and a kind busser brought me water. Then my hangry set in lol and so I flagged the hostess and requested to send my waiter over or can she just take my order? Aaaaannd nope still was told I needed to go through the waiter. Omggg. Well eventually a waiter came by to take my order but informed she wasnt MY waiter.... but alas my order was sent off to the Kitchen which is all that really mattered in that moment:)) <br><br>For those wondering, my waiter finally came by to introduce himself when I had 1/2 my Tuna Burger and most of the fries fully consumed. Oh well!! <br><br>Overall: Happy happy tastebuds and just under $20 so I will absolutely be back when I am not at the hangry phase yet still ready to enjoy the menu further! Burger Brunch & Bubbly anyone?", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fXbbYsftS2bhUmiS4Gyv7g/348s.jpg", "caption": "Burger Buns..."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mUZoOZJkQHKax3h43BvCsQ/168s.jpg", "caption": "So so delicious!! Seared Yellowfin Tuna Burger..."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IUSFk1IblruCT6C2uYacNQ/168s.jpg", "caption": "Food(ie) Menu..."}]}}, {"review": {"des": "This place is SUPER over priced-- you've been warned! I went here for my birthday brunch and decided to order bottles of champagne since they were only $12, and they came with a small (and I mean SMALL) bottle of juice. At first I thought $12 bottles were a steal, however the alcohol content in each bottle is so minimal that we ended up ordering WAY more than we anticipated. At that point it would've been more economical to just go to another bottomless mimosa place because at least they'll pour it for you and you won't be worried about breaking the bank. <br><br>On top of that, the food was extremely expensive. I ordered some onion rings and there was HARDLY any batter on it, it was just basically a sliced onion. The burgers were $14 and you couldn't make ANY substitutions and it didn't even come with fries. The service was also pretty lackluster. In short, this place is definitely not on my list of recommended brunch spots.", "pics": null}}, {"review": {"des": "We came here for brunch, and I'm lucky I was able to get a last minute reservation for our group of 6. This place was certainly packed, and we ended up waiting a while after our reserved time for our table. However, the service was fairly quick, and we were able to get our drinks shortly.<br><br>The boozy brunch specials are great- $10 for a whole champagne bottle! Nothing beats that, and the peach juice was a great addition. However, the food is definitely not worth raving over at all. I got the veggie hash, and this was a weird concoction of potatoes, veggies, and eggs on the side..not even on top. Oh well. The waitress did a good job at tempting us with a breakfast shot afterwards, which we all regrettingly agreed to....not worth the $8.<br><br>I was also disappointed that there was no dj..I had read reviews that this was a dj brunch! Oh well...", "pics": null}}, {"review": {"des": "Well, what should I say about this place. You will feel like you will love it and it will turn out all wrong. They are famous for their burgers but tell you what, it was not at ll worth and good. Their black bean patty was soooo tasteless and they did not have any SINGLE SIDE INCLUDED IN BURGER. I mean come on, who does not give sides with a burger! <br><br>I was craving a burger and I ended up paying so much without even satiating my craving for burger. Not recommended at all. City is full of amazing restaurants and also their service was superrrr slow.", "pics": null}}, {"review": {"des": "Review is for weekend brunch. Really great boozy brunch deal. Only $10 for a bottle of champagne and they provide 2-3 juice flavors with it as well. Not sure how that can be beat in river north. The food is average to above average which is totally fine if you are drinking that champagne. Nice environment too with open windows to the front sidewalk.", "pics": null}}, {"review": {"des": "I've been to 25 degrees a number of times and have yet to be disappointed.  It has a casual atmosphere that's perfect for an impromptu bite to eat or an outing with friends.  The inside of the restaurant is dim with a red, velvety wallpaper, all very reminiscent of a cabaret.<br><br>The cocktails are good and the spiked shakes are to die for -  Perfect way to kill 2 birds with one stone.<br><br>I always order the Number One burger, which is topped with Mindoro Blue, Park Fontina, Applewood Smoked Bacon, Caramelized Onion, Arugula, and Thousand Island.  It's delicious every time and you can tell that the beef is high quality and well seasoned.  There are no substitutions for their signature burgers, but you can also build your own custom burger using their list of toppings and sauces.  I'm super picky when it comes to fries but 25 Degrees' fry game is strong - they're thin, crispy, shoestring style fries that are always perfectly salted.<br><br>Service is always reliable and friendly.  If you're looking for a new burger to try in what I like to call \"the city of burgers\", you should definitely give 25 Degrees a try.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/om0ndHxfg6D-t21YDpNwKg/348s.jpg", "caption": "NUMBER ONE - Mindoro Blue, Park Fontina, Applewood Smoked Bacon, Caramelized Onion, Arugula, Thousand Island"}]}}, {"review": {"des": "This is a 5-star joint.<br><br>The tuna burger is literally \"unreal\". The onion rings are fresh and flaky, and the sweet potato fries are crisp.<br><br>Great (quiet) atmosphere, maybe a little too dark. That said... the food is so damn good, who gives a hoot about lighting. If you're visiting, skip Portillo's and come here.<br><br>Anyone who votes less than a 5 is a clown.", "pics": null}}, {"review": {"des": "Half off apps and $5 drinks for happy hour!<br><br>Nachos - I loved how this was served as individual, thick tortilla chips. Each chip had the perfect layer of cheese, guac, and pico. I would definitely go back for this at hh<br>Brussels sprouts - very sour from the balsamic and there was a big dollop of mayo? To the side that smothered some of the sprouts. I wouldn't get this again<br><br>When I was ready to order I tried to make eye contact with a waitress to get her attention, but she just stared at me like I was crazy. It took a while to get someone to come to our table to take our order.", "pics": null}}, {"review": {"des": "Truly enjoyed having a Sunday brunch at 25 Degrees. We were visiting Chicago for my friend's birthday weekend and her and I came here to some food and more importantly, mimosas! Which, if you like mimosas, this is your place! They have a special on Sunday where the Champagne bottles are only $10 and you can get whichever types of juice you like. <br><br>I had a pulled pork eggs benedict for my meal and it was marvelous. It was so fresh and it was not oily at all. To top it off, the service was excellent. <br><br>I will definitely be back next time I am in Chicago!", "pics": null}}, {"review": {"des": "Food: 4<br>Service: 5<br>Cleanliness: 4<br><br>We came here for a business lunch around 12:30PM. It wasn't packed at all surprisingly! It's a very looong restaurant so the front end have high tops and along the wall towards the back are all booths. We sat 5 at a booth and it was cozy, not too cramped. Our server was super friendly and helpful, even going out of his way to give us the best deal he can.<br><br>$13 Burger with Fries & a Drink: <br>I got the #3, perfect amount of spice from the cheese balanced with the avocado. Sweet Potato Fries were crispy and paired well with #3. My coworker substituted her beef patty for turkey patty. My other coworker got the tuna and he said it was delish.<br><br>Worth it: $13 burgers on their own are a little steep, but you can grab deals during happy hour and lunch specials.<br><br>Would I come back? Yes, definitely to try their deals and shakes!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fSYCKnlPZO_Btsy-Wg5c7w/348s.jpg", "caption": "#3 Burger with Sweet Potato Fries: YUM"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oFCAE-Iii97mkUnNoZFP-w/168s.jpg", "caption": "#6 Burger with Tuna and half half Fries and onion fries"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AI4ENeRdgC7mQZrsphkTcg/168s.jpg", "caption": "Lemonade and complimentary extra on the side, thanks!"}]}}, {"review": {"des": "Personally, I am not a fan of the band, 98°, but the fact that 25 Degrees played some of their music while I was there seemed overall quite fitting.  What was even more fitting than this is the fact that it was legitimately 25° in Chicago when I came to eat at this appropriately named burger lounge...<br><br>I call it such because the atmosphere, upon walking in, might trick you into thinking that you have walked into a speak-easy lounge.  The lights were dim and cast very luxurious shadows on the velvet wallpaper the lined the entire restaurant (and yes, I did pet the wall a few times throughout my visit).  The cool vibe of 25 Degrees was complented by some of the best late 90's and early 00's hits.  (I had come here with my friend who was going through a break-up, and many of the songs playing overhead were related to love loss - it was as if they were mind-readers in knowing what music would hit the sweet spot).<br><br>Though I was not overly enamored with any of the pre-set burger items, I was all about the individualized burger.  It cost a little more to do this, but I made a ballin' burger y'all: medium rare burger with mozzarella cheese, garlic aoili, a fried egg and some avocado.  My friend accused me of being insane for compiling this devilish combination, but it was sooooo good.  They make some bomb-ass burgers here.  It is sad, though, that these burgers don't come with fries - you have to order those separately.  It isn't too costly for a sidd of fries, though, and they are awesome.  Oh, and don't forget to order the chickpea fries!  <br><br>They've got some good cocktails, but a majority of the drink is ice, rather than the drink itself...it probably was not worth it to get the drinks.  I would, however, recommend the spiked milkshakes.  They aren't that strong, but I willingly fell victim to the placebo effect, and assured myself I could taste the alcohol...in reality, you really can't taste the alcohol, but they are good all the same.  The milkshakes, like ll the food, was a little over-priced - 25 Degrees could afford to be a little cheaper.   <br><br>P.S. it may seem like a big \"duh\", but they won't let you take the spiked milkshake to go.  I tried, and I failed.  You will have to drink up while you're there - just don't get a brain freeze!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/d3ohUGB70PMSONL-gCdK_A/348s.jpg", "caption": "Their daily specials"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3pJYZ_beVW_XmhUL-E2mEA/168s.jpg", "caption": "Midnight owl spiked shake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QoJBf-UB2x0ey13DHJsS4A/168s.jpg", "caption": "Make your own burger: fried egg, avocado, smoked mozzarella cheese amd garlic aioli"}]}}, {"review": {"des": "Their happy hour specials from 4-7pm Monday - Friday are ridiculously good and incredible portion sizes! it's half off most apps! Got the chili honey wings and chicken nachos, both of which were delicious! One order of wings is like 8 pieces and they're pretty generous sizes! Beware it can get a bit spicy so ask for some ranch dressing on the side (an extra $1). Their nachos are a bit unique in that there are thick pieces of chips that are stacked very generously with toppings. Super filling and super delicious! Drink specials are also available, though I can't remember what they are. Ambiance inside is also pretty nice - classy vintage feel with big red booths and large chandeliers. The place has character and most important feels clean with great service.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gKxyGYz-I-23rrDrd_kcpg/168s.jpg", "caption": "Nachos app!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZhUikqCVNzuutkyvdByesA/168s.jpg", "caption": "chili honey wings - nice and meaty!"}]}}, {"review": {"des": "I went to 25 degrees for a birthday brunch and was pleasantly surprised by my experience! We arrived at 11:00 am and it was basically empty. By the time we left at 1:00 pm that place was POPPIN. It's no surprise since they have the amazing $10 champagne bottle and orange juice deal.<br><br>We had reserved a table for eight and were seated right away. Our waitress was lovely and kept up with all of our food and drink orders. I got the avocado toast with a side of bacon and loved every bite. The bacon was perfectly crispy and reminded me of the bacon of my youth which I can't really explain. The portion size of the avocado toast was way bigger than I thought it would be and it was delicious because of the tomato and egg. I got to try some of the potatoes and those were also legit. As if that wasn't enough, everyone also decided to get milkshakes. I had a sip of my husband's strawberry milkshake and it was heavenly. I want one right now as I'm writing this. Droooool. <br><br>The bathrooms were clean and I loved the decor of the entire place. Quite a few TVs for watching football. I'd definitely go back and take some friends for a boozy and delicious brunch!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JuZRrr7TXouXKoN-Q0JXpA/168s.jpg", "caption": "Brunch!"}]}}, {"review": {"des": "I came here on Saint Patty's Day and got the the Number five burger. Beef patty, pastrami, Swiss cheese, fried onion and thousand island. <br><br>It was really good. I'm a huge fan of big onion rings in burgers, so this definitely hit the spot. The beef patty was juicy and tender (well done of course) and the pastrami was perfectly salty. I liked the flavor of thousand island with it.<br><br>I also tried the sweet potato fries and regular fries. I'm obsessed with potatoes, so if I say there were good, they were good. I wanna try more of their burgers for sure.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LtdjnQQA_SF4qcuqWjAq4g/168s.jpg", "caption": "French Fries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sZYF9-bQhgXPO1fhaWyafg/168s.jpg", "caption": "Number Five Burger"}]}}, {"review": {"des": "My friends and I came here for a birthday celebration. We did have a reservation for 11 people at 1:15pm and we were seated promptly. Bottles of champagne have increased from $10 to $12. The service is still awesome and the food is wonderful.", "pics": null}}, {"review": {"des": "I frequent 25 Degrees as it is only one block from my apartment. My favorite things about 25 Degrees are the brunch, the $10 champagne bottles, and the French Toast. I love it so much that it has become one of my go to brunch spots. If you enjoy good music and conversation, I would definitely recommend. All of the menu items are reasonably priced in my opinion, and they have vegetarian options as well. If you are looking for a quiet spot for brunch, 25 Degrees is not the place for that. For me, I appreciate the hip hop and r&b music they play so it's always a yes for me. <br><br>As far as reservations, they do tend to fill fast for Saturday and Sunday so I would definitely book in advance.", "pics": null}}, {"review": {"des": "Paid $16 for the cheese and charcuterie board and was not pleased at all when some toasted white bread and deli cheese came out. Disappointing. <br><br>The deviled eggs were beyond amazing though!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/d0F48mebmyCDHkytyOTyVA/348s.jpg", "caption": "The cheese and charcuterie board. Toasted white bread, and deli cheese. For $16 i could be eating cheese sandwiches for a week Disappointing"}]}}, {"review": {"des": "Oh my godddd. So flipping good. The place looks classy but it is chill af. And the food is so good. My husband and I each got a BYO turkey burger. The fries were an experience. The patty was a bit under seasoned but the fries and toppings def made up for it. We'll be back.", "pics": null}}, {"review": {"des": "Legit burger. REALLY good boozy milkshakes. Fries are also good. I've been here a few times and haven't really tried anything else. The only thing I'd say is that the decor getting a little old/dated. It's too dark in there and it sort of smells like a sticky frat boy bar these days... would be nice to do a little update.", "pics": null}}, {"review": {"des": "I was curious about this place after seeing they offer 1/2 off apps for happy hour. Of course what I really wanted do wasn't apart of the promotion, but I managed to find something anyway. My friend and I shared the chips and guacamole, which were pretty good along. We each ordered the shrimp tacos and I had an order of sweet potato fries. Again, both surprisingly tasty. I'd definitely go back and recommend to others. I deducted one star because the service left much to the imagination.", "pics": null}}, {"review": {"des": "Great place for brunch. I went with a group of friends for Sunday brunch and everyone loved it! The vibe in the restaurant is so fun and live. The music they play makes for an even better time as we all found ourselves head nodding and swaying during brunch. The staff is super nice, which is always a plus. <br><br>We all ordered different things from the brunch menu: banana pecan French toast, potato skins, crepes, pastrami hash, pulled pork benedict, burgers of sorts, bacon, and of course MIMOSAS! For only $10, you get a bottle of champagne and I love that they give you a few different juices: Orange, Pineapple, and purée for a Bellini. Needless to say everything was great and everyone was extremely pleased. The price for the meal wasn't bad either. With all the food and champagne, we only spent $28 each...NOT BAD! <br><br>We'll definitely return to 25 Degrees. I know it will be even better in the summer when they can open up the garage door like window.", "pics": null}}, {"review": {"des": "Check out this restaurant if you're in the magnificent mile area of Chicago. Their food is so good, the BEST BURGERS! Try the number six burger. Two beef patties, American cheese, caramelized onions, pickles, lettuce, tomatoes, mustard, & Thousand island.<br><br>I like the whole ambience of this place. They have a big bar, plush booths, and indoor/outdoor tables to sit at. The lighting is dim and they play really good music. Each time I went my host, waitress, and bartender were all very nice and the service was good. They have different specialty cocktails and I recommend the blackberry mojito.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xeJ_2eBTeTpF5BjF6jWQsw/168s.jpg", "caption": "Fried egg sandwich- applewood smoked bacon, cheddar, lettuce, tomato, herb aioli w/ side of fries"}]}}, {"review": {"des": "Went to celebrate friend's birthday, had reservations however they were not honored in the time we wanted to wait. 40'mins passed our reserved time and still no seats to be had.<br>Yes do not blame the bar, this is not the type of place to make a reservation at as they just cannot accommodate parties over 5.<br>The drinks and bar staff are very good.", "pics": null}}, {"review": {"des": "Just found my new favorite burger place !<br><br>8 oz,  thick , juicy as can be, cooked to perfection , perfect bun.  This was one of the best burgers I've had in a long time.  Wish I'd snapped a pic of it but was too busy trying to sink my choppers into that baby!<br><br>Had a side of onion rings - pretty good in that they weren't overloaded with batter , but mine were a tad over cooked.<br><br>And because I couldn't resist - a spiked shake for desert. This is the Night Owl with Godiva Dark Chocolate Liquor.  It's dangerously good - anyone who has a sweet tooth could get hooked on this very easily", "pics": null}}, {"review": {"des": "Love this place! Great alternative to Au Cheval because I'm not down to wait forever to eat a burger.<br><br>Service is super friendly and have never had to wait for a table.<br><br>Food is super awesome. I usually split the half onion rings/fries with another person and we always always have trouble finishing it. I'm in love with the buns. It brings me back to my college days in Austin with Hopdoddy's amazing buns. Meat is super fresh, and I love creating my own burger when I'm there.", "pics": null}}, {"review": {"des": "Best burger in the city, don't get caught up going to the places that have hour long lines or reservations only. We always have a great experience and today Rachel and Kristy went above and beyond amazing. I will always recommend this restaurant especially on Saturdays and Sundays for their $10 bottles of champagne!", "pics": null}}, {"review": {"des": "Overall, I had a really good meal here. <br><br>We started with the Drunk in Love Valentine's Themed spiked shake. It was a chocolate/cherry milkshake topped with a slice of red velvet cake. The milkshake was delicious and super chocolatey, but the cake was super disappointing as it was extremely dry (so much so that it was inedible). <br><br>For a starter, we got the chickpea fries. They were great and the best part was definitely the lemon dill sauce (which can also be added to a burger!) <br><br>We got the veggie burgers because we're both vegetarian and they were great! Definitely one of the best veggie burgers I've had in Chicago. Only complaint is that all toppings are $1-$2 aside from lettuce onion and tomato. <br><br>Would definitely come back here if I was around!", "pics": null}}, {"review": {"des": "We purchased tickets in advance for St Patrick's Day and ended up buying the table package as well so we had a \"home base\" while we were there. The package included a mimosa package, available drinks, appetizer platter and bucket of beers, plus a table to hang out at.  It was so worth it for us.<br><br>As almost all reviews have mentioned, the music at 25 Degrees is freaking amazing.  It's a mixture of throwbacks and today's music and people were jamming all day!!! <br><br>We had a waitress included with our package, Thaiese(?) and she was amazing. We loved how fun, friendly and attentive she was!!!  She took great care of us and truly made the experience 5 stars - which was appreciated because the bar was packed and she had to have been overwhelmed but she still made it work and we had a blast.<br><br>I can't comment on their burgers or much of their food, though I wish I could!! But we did get the loaded breakfast potato skins, some wings, deviled eggs and onion rings.  Everything was freaking delicious.  Our drinks were flowing and it was just all-around a great time.<br><br>I'd love to stop back in during my next visit to Chicago and get to sit down and eat because I know our time here was out of the norm for them, but if it was any indicator of their level of service and quality of food I think it's totally worth the 5 stars.", "pics": null}}, {"review": {"des": "This place has one of the best deals in all of Chicago - half off almost all of their appetizers (snacks) during happy hour (I think Mon-Fri, 4pm-7pm but call to make sure). And their appetizers are actually really good!<br><br>We got the chili chicken wings, chicken nachos, and burrata and all were fantastic. The wings weren't spicy but had a great flavor. You get a good amount and they are a good size as well. The burrata comes with arugula, bread, and tomatoes. The taste of the cheese is fantastic. The nachos were my favorite and very unique. They come on a tray and each chip is topped with cheese, guacamole, and chicken. That way it's very easy to share. We were easily able to make a meal for 2 out of these 3 appetizers. With the deal, the total came to $22 after tax which is pretty great for River North!<br><br>Also, I couldn't end this review without praising the service. We had an awesome waitress (Thaise? per the receipt) who went out of her way to make sure we got our food on time as we were running late. Some of the best service I have ever had!<br><br>Overall - this is a great place, especially for their happy hour deal. Check it out and see for yourself!", "pics": null}}, {"review": {"des": "I've been here twice and I am not impressed. I've had a better burger at Red Robin. If you're in the area and want a burger, go the Kerryman. The first time was in the summer and I sat outside with my date. We each got a burger and I got fries. I think I got some sort of mule, which was good. Their drinks are good so if you just want to drink, you'll be fine. <br><br>I got the number 6. It was fine, nothing special. I ordered it medium and it was closer to well done but with all the cheese and sauce, it didn't matter. I didn't like that the fries are so thin and overseasoned. I came back recently by myself on a weeknight. I sat at the bar and the bartender barely spoke to me. I didn't really feel welcome and he never checked on me or asked if I wanted anything else. <br><br>I made my own burger this time. It was beef, grilled onions, and the fixings (lettuce, tomato, pickle). I ordered it medium and it came out barely cooked, it was cold inside. It was not a busy night so it seems unforgivable that they just basically slapped a barely cooked patty on my burger. It was tasteless as well, no seasoning. I won't be coming back.", "pics": null}}, {"review": {"des": "Whether you're dining in or taking out -- 25 Degrees always hits the spot. Their menu has a wide variety of options ranging from your classic cheeseburger to a tuna steak burger. <br><br>If you're looking for something different, there's an option to craft your own burger because no substitutions are allowed. They say it best -- you don't mess with perfection.<br><br>The only down side is that you have to add on fries. Certainly not a deal breaker, but not what I'm used to given the portion sizes in Chicago!!", "pics": null}}, {"review": {"des": "Stumbled upon this place on a Monday evening after walking around the city for a bit and was the perfect pit stop<br><br>It's a place that locals go for a pint and bite after work or to catch a sports game (they have tvs everywhere) and was perfect for what we were looking for. <br><br>We arrived around 5pm and were just in time for half price apps and beer (which ends at 7pm)!<br><br>We ordered the wings and nachos and they were both goooood. <br><br>The nachos were actually like open faced quesadillas topped with a ton of guac, salsa, and cheese! It was nachos without all the mess- genius!<br><br>The wings were also bomb! The chilli honey wings had some nice heat plus sweetness and were perfectly crispy. <br><br>Last but not least, we each ordered a burger. Yes, we were STARVING!<br><br>Fiance ordered number 1 (had blue cheese and arugula) and I ordered number 6 (their version of a big Mac). Both were killer good and we were insanely stuffed after! <br><br>Meal was super delicious and filling, and overall, great bang for your buck. <br><br>Go here for great burgers, great beer and just for a chill time. Would definitely come back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vfo8g992JmDW14ZJ3FrNtw/348s.jpg", "caption": "#6"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oIgy2tkTyGhaMOEF_l6vTQ/168s.jpg", "caption": "Nachos!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qhaPldd6wY51GMAK6zbX2g/168s.jpg", "caption": "Chilli honey wings"}]}}, {"review": {"des": "Well well well..... let me start by saying that this place has $10 full bottle of champagne on Saturdays for the brunch special which gets you about 4 mimosas worth of drink (not a bad deal). Other than that, DONT EAT HERE!!! So I ordered the #5 burger and I expected it to be so delicious cuz this place is \"known for their burgers\" well, I've had better burgers from White Castle ! I also ordered a side of onion rings which were under cooked... I've never had under cooked onion rings so I was so confused . They do not season their food at all so everything taste really bland.. add salt and pepper and it's still bland... to top it off, we called ahead and were told we couldn't make a reservation because they were empty. When we arrived 30min later, we were asked if we had a reservation and forced to be seated at the bar only... I won't be back #ByeFelicia", "pics": null}}, {"review": {"des": "Made reservations for Sunday brunch a week before because we heard this place gets packed. When we showed up however they didn't have any record of our reservation which was not cool. Thank god it was mother's day and most people spend time with their mom instead of getting shit faced. <br><br>Bottles of champagne are $10 - and they give you either a small carafe of orange juice or peach juice. The peach juice is kind of thick which freaked us all out. <br><br>For food, I got the chilaquiles which was amaaazing. I downed the whole thing in less than 2 minutes. I promise, I was not already drunk when I started eating this so it was actually really good. The only thing is that it was kind of dry - I had to douse it in hot sauce.<br><br>The service was good, our server was attentive. The garage door was open because the weather was nice but we were freeeeezing so she asked them to close it. <br><br>Music is also on point. <br><br>In conclusion, this place is too cheap, too boozy, and too yummy to pass up~", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RZC-p-od_znWflpxTwJIxg/348s.jpg", "caption": "Chilaqueles"}]}}, {"review": {"des": "Nice spot with a very hip decor and some great burgers. 25 Degrees looks a little like a diner and a cocktail lounge had a baby, and the result is a pretty comfortable and pleasing place--it's dark, has an interesting bar and some tall banquettes for a little extra privacy.  <br><br>Service was very good, too. <br><br>The burgers are very tasty.  I may have had better, but not by a lot.  The restaurant offers some rather odd combinations but also gives you the option to \"craft your own.\" The burgers don't come with fries, so consider an order to share with the table--they're good, too!<br><br>I found the music a little loud and too self-consciously hip.  We were there early on a Saturday evening and the crowd was on the older side (30s to 50s), so the blaring club music seemed a little out of place. It made it a little difficult to talk. <br><br>Other than that, the place is clean, attractive and comfortable with fine service and a darn good burger. Who needs to hear when you have all that?", "pics": null}}, {"review": {"des": "A+++ on everything the group I came with kind of ordered everything across the menu and no one reported that anything was disparaging, so it's safe to say we will be back. However I will say my spiked salted caramel was really strong so if you are looking for a good milky cocktail try that!  The #1 burger was the best by far, with sweet potato fries and garlic aioli sauce all togetheir made it so much better.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7Y8aqNPgp5Sg5i9MwiRdWA/168s.jpg", "caption": "Spiked Milkshake salted caramel flavor."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-XspEPCILbH-iKVG3ex9sQ/168s.jpg", "caption": "Lobster roll and chips."}]}}, {"review": {"des": "It was so good the first time I came back a week later! <br><br>The first time was late October and the temps had just dropped. Stepping in 25 Degrees was warm and inviting, like a vintage saloon, but more upscale. We came on a Wednesday and they had great specials (half price bottles of wine, cheap appetizers, etc.) We ordered a bottle of Prosecco to share between three people. <br><br>The booths are large and cozy, with a great arrangement for talking with others. There was a decent crowd for a Wednesday evening, and it looked to be a great place for weekend drinks too. <br><br>The next time I came back with my parents and sister for lunch. We all ordered burgers, which were delicious. Mine was a turkey burger; I would probably get a different cheese (don't remember which one it was), but that's just my tastebuds. <br><br>All in all, I love this place.", "pics": null}}, {"review": {"des": "Super cool spot to hang and watch a game and have awesome food. Sat at the counter and had great service by a professional bar tender.<br>Will be back when in Chicago", "pics": null}}, {"review": {"des": "I came here a loooong time ago when the place first opened for a burger (okay), but the last time I came it was the same day as bacon fest so I opted for a salad. <br><br>The Brussels sprout salad is quite flavorful and its HUGE! We also had a side of honey chili wings, which I would also recommend.<br><br>Service is great as well!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IinBpO6wJ972YW2-_WdtOQ/348s.jpg", "caption": "Brussels Sprout Salad"}]}}, {"review": {"des": "I came here with a group around 530pm on Saturday and the restaurant was half full. The weather was nice so they let the garage door open which was great especially since the inside is darker.  <br><br>I got the burger 6 because I love my in-n-out and it looked very similar.  I ordered the burger, the chickpea fries and bottle of champagne $10, great deal.  <br><br>When I ordered the burger they said it only comes well done since the pattys are thin which is fine with me but when I received it,  it was rare, very rare. I couldn't get the waitress attention so I reluctantly ate it,  the flavor was great but not the meat.  The chickpea fries were interesting with the dill lemon sauce but not as memorable or flavorful.  <br><br>The space is great for groups and I would come for drinks but not sure about the food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Lydyjzo4DJ1Feu3F3ejYXw/168s.jpg", "caption": "Very rare burger six, flavor was great just not the meat"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bwYVCzU_y1JmhBo6d9Ad_Q/168s.jpg", "caption": "Peach mimosas, it was really good"}]}}, {"review": {"des": "Very relaxing environment, as I'm not from Chicago I wasn't sure what to expect as Thursday nights here seem very active. Long story short as I roamed in looking lost, not too sure of who worked there, I made contact with a woman who seated me and provided me with a menu right away. She informed me that my waitress would be with me soon, but soon turned into roughly 5 minutes later. <br><br>Long story short thank you so the lovely woman who took my food/drink order and delivered partial of my food as my waitress brought out the other portion. Thank you kindly for serving me when you didn't have to! I feel horrible because I don't remember your name but it might be Rachel! Good energy feeds off of good energy, continue to smile. <br><br>Oh, by the way, veggie burger was pretty good along side with those yummy fries.", "pics": null}}, {"review": {"des": "Loved this place and the unique options they had! It's a hidden gem with gorgeous decor. Velvet, red wallpaper, including chandeliers and red leather booths. Le sigh. The bar in the center was pretty and classic. The food we had was awesome. My boyfriend got the peanut butter and jelly boozy shake and the lobster roll with homemade chips. We both LOVED THE PB&J BOOZY SHAKE. You couldn't taste the liquor because of the peanut butter flavor disguising it. He said his lobster roll and chips were really good too. I ordered the bourbon salted caramel shake and it was good, but not as think and you could definitely taste the liquor. I ordered the beer burger which I w as s hesitant about because I had never had beets and the waitress said she didn't really like it but other people did. She was kind enough to extend herself and say if I didn't like it she would get me something else. How sweet! Verdict: Beet burger was amazing! Filling, flavorful and not too sweet. Even though they could probably add another vegetarian option or so I loved that burger and it held together really well. I'm definitely glad we came across this place and we will be back for some more boozy shakes!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uZptvo3cwpvkg1tqjnn91w/348s.jpg", "caption": "Boozy shakes.  Sooo Yummy. Salted Caramel (with Makers Mark)  and PB&J (with grape liquer and other liquors)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_gJwg3WKQogESYiVrBwsKg/168s.jpg", "caption": "Love the chandeliers and booths are a beautiful dark red leather"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/J4EYmzyPzbN4NwT1CwUUqQ/168s.jpg", "caption": "Beautiful interior design"}]}}, {"review": {"des": "I came here at least 4 years ago (maybe more?) when it was newer, and I remember the food being amazing-glad to see not much has changed! The menu has definitely changed overtime, as many items I remember trying weren't there anymore, but the food was still great. <br>Here's what we tried:<br>Number 3 burger- so freakin good we ate it too fast before I could even snap a pic lol<br>French fries <br>Onion rings-loved that they were crispy and not soggy<br>Creamy Tomato soup-loved the pesto on top, nice touch <br><br>I'll def be back to try more items on the menu.", "pics": null}}, {"review": {"des": "Great burger selection and decent brunch menu. Try the sweet potato fries they are amazing.", "pics": null}}, {"review": {"des": "Love love love this little spot. From the dark lighting to the live decor and the great taste in music. It was a Win from the minute we walked in. The burger and the tacos were superb, the staff was inviting. The girls at the hostess stand were sweet and the overall experience was great! We'll be back for sure", "pics": null}}, {"review": {"des": "My absolute favorite brunch spot in Chicago. They had bottles of champagne for $10 and they came with a little thing OJ. For food I had the breakfast potatoes, pulled pork Benedict and tried a side of of their jalapenos bacon. The potatoes were great-crispy with great flavor. I loved the pulled pork it was tender with a great sauce. And of course bacon is bacon which is amazing but give it a little kick? Even better. I loved everything about the brunch. I do however recommend getting a reservation before-we walked in and had to wait about 30-40 mins for just us 2.", "pics": null}}, {"review": {"des": "Yesss, these burgers are amazing! The End. Ha!<br>And I Highly recommend trying the spiked milkshakes if you're a sweets person and love alcohol.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mJ-v_jNyGmAX2cot4kJPoQ/348s.jpg", "caption": "Night Owl"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9xKzxTka3hWUDIIYjFyVhA/168s.jpg", "caption": "Night Owl"}]}}, {"review": {"des": "I admit I had high expectations going in. You often hear the generic phrase \"this place has the best burger\" and then you try a restaurant burger and it's a huge let down....not the case at 25 Degrees. Food was smooth not too greasy nor too classy that it wasn't enjoyable. Great vibes and solid cocktails. Worth a visit for date night.", "pics": null}}, {"review": {"des": "Great Company with Nice Chicago Locals!!! Great Food and Drinks at a Great price!!!!!keep up the Good Work!!!", "pics": null}}, {"review": {"des": "The service was great and food was delicious. We got the $10 champagne and peach puree deal (or you could get orange juice) for Sunday brunch. The peach made the drink delicious!<br>The food - I got the grilled cheese without the bacon and my boyfriend got the tuna burger. Our server was so accommodating and actually checked to see if I could get the grilled cheese because it was early to order it. I guess they weren't starting to serve them until later that day. My boyfriend loved his burger and said the tuna was cooked very well. To finish it off, we got the caramel malt shake which was SO good. You definitely need to get a milkshake if you're here! Next time, we'll definitely be trying the boozy shakes.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/K_6f5z_tKwZxSZ9se1Kk8A/348s.jpg", "caption": "Caramel milkshake for 2"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8SOJt2S1tEBvOx80dJHhCg/168s.jpg", "caption": "3 cheese grilled cheese (no bacon) with an awesome side salad!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fh1xwb_mF8n3I_mIFV2Pfg/168s.jpg", "caption": "$10 champagne"}]}}, {"review": {"des": "Out of towners, here for at least the next few months so have been on the hunt for a fantastic burger. We'll have our work cut out for us with all of the places on our list. We picked 23 Degrees because it was close for us and the weather wasn't cooperating. A quick Uber and we were there in no time,<br><br>Had some great food along with the Fries/Rings combo and a cold beer.", "pics": null}}, {"review": {"des": "Amazing onion rings and breakfast sandwich. Great atmosphere and service. Drinks are tasty and handcrafted. A++ for brunch :)", "pics": null}}, {"review": {"des": "Welp...back to normal. Walked in, sat at uncrowded bar, watched two bartenders spin in circles and not ask me or two other people how we were doing or offer drinks. 12 minutes later, i bagged it.<br><br>Hey, it's your tip money in my pocket that I'm trying to give you. Sad...<br><br>Unless you are dying to be ignored, I'd avoid this place. Great burgers though!", "pics": null}}, {"review": {"des": "A burger joint should be able to cook a burger, even a breakfast burger.  I ordered medium rare, as did my friend.  Hers looked great, mine bled profusely with just the pressure of my hand around it.  I sent it back, and the next one came back over cooked, which would have been doable, but the thing was so sloppy I had to use silverware to eat it and I just gave up on it half way in.  How can this place be more miss than hit with a burger?", "pics": null}}, {"review": {"des": "We stopped in for lunch because this place is close to my office.  The atmosphere is dark with an \"old city building\" odor when you first walk in.  Our server was friendly and prompt.  There was a lunch special but the \"build your own burger\" wasn't an option so we picked from the signature burger section.  I can't remember the exact one I chose but it was BIG, and messy.  Lots of bun, lots of meat and plentiful toppings - what it lacked was distinctive and memorable flavor and the burger was a tad bit over-cooked for my taste.  I wasn't really disappointed but there was nothing about our visit to 25 Degrees that would bring me back.", "pics": null}}, {"review": {"des": "The burgers I've had at 25 degrees are some of the best I've ever had. I enjoy them more than au cheval, and that says something. So much love for this place. Incredible service and fantastic food.", "pics": null}}, {"review": {"des": "Awesome brunch!! Highly recommend. Bottles of champagne for $10. Very fast and great food", "pics": null}}, {"review": {"des": "Wonderful experience! The best deal on mimosas in town & delicious crepes, breakfast quesadillas and Veggie Hash! Graciela made our day and was so attentive and kind! Will definitely be back here.", "pics": null}}, {"review": {"des": "I live in the area and this is one of the best places to grab a burger and a beer.<br><br>-Nice atmosphere--dark woods, rich red wallpapers, exposed brick and trendy black chandeliers.<br>-They also have a nice patio for outdoor seating.<br>-They have the flat screen TVs by the bar if you want to watch the games.<br>-The service has always been attentive and efficient.<br>-They have an extensive and interesting beer list--including rotating drafts.<br>-Delicious boozy milkshakes if that's your kind of thing--the s'more shake spiked with bourbon was awesome.<br>-Good non-boozy shakes as well--they do a nice vanilla malt.<br>-The burgers are great--always juicy and served on fresh soft buns--and they have lots of fun topping combinations.<br><br>I'm definitely glad to have this casual go-to in my neighborhood.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/t8AvlQi4ZBc1dnZtuxINqg/348s.jpg", "caption": "Outside"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Lxb9TrHDXt9RARxUD-Boww/168s.jpg", "caption": "Patio"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iMP1-I5b7sS7K-jh-Vc7fQ/168s.jpg", "caption": "Beer"}]}}, {"review": {"des": "My sister was in town visiting this past weekend to assist me in dealing with a gaggle of teenagers at my daughter's birthday party. To assist in our recovery from spending a Saturday night with tons of teens, I decided to take her to brunch and decided on 25 Degrees as the reviews were good and I was sold on $10 bottles of bubbly. The service was good. we had a couple of bottles of the bubbly and also shots, just because. My sister had the breakfast sandwich with fries and really enjoyed it. I had the No. 1 with no thousand island ( i don't eat dressing) with an added egg and because I'm a glutton, I got the half-and-half fries and onion rings. The burger could have used a touch of seasoning but overall was pretty tasty with just the right amount of blue cheese without it becoming overpowering. I'll definitely be visiting again.", "pics": null}}, {"review": {"des": "This is an excellent spot in river north if you're craving a burger and beer and don't want to spend a fortune. I've had a few different burgers on the menu and I've gone home happy every time. The beer list is pretty good, with a rotating list of cans, bottles and drafts from a lot of local breweries. The onion rings are also especially good. Thick cut onion, not over fried, flaky batter. Man I'm gettin hungry thinking about them. <br><br>The vibe in here is excellent. They are pretty much exclusively bumping 90s and early 2000s hip hop bangers. I'm talkin Buggin' Out and Blackstar in the same sitting. The booths are big and cozy, great for talking with friends.", "pics": null}}, {"review": {"des": "I am in Chicago for the first time and after an incredibly long week, just wanted to order in food and go to bed. After looking trough tons of nearby restaurants that delivered, I chose 25 Degrees.<br><br>I ordered the Number One with sweet potato fries. I ordered at 6:15 PM with a 7:15 PM delivery time. The food was about 20 minutes late, but...<br><br>Totally worth the wait!! The burger was phenomenal. Honestly the best burger I have had in a long time. The next time I'm in town I will visit the restaurant itself.<br><br>My only suggestion for delivery is to include the option to buy sauces. I would have loved to have tried some of the sauces you can buy in the restaurant.", "pics": null}}, {"review": {"des": "The food here is pretty good. <br><br>The burgers do not come with a side so you'll have to purchase that separately. I shared a small fry with a friend. I was pleased with the portion of the small fry and the size of the burger. <br><br>I also had the deviled eggs. They weren't very good and we're served kind of warm. The consistency of the yolk was weird. I would not recommend. <br><br>For dessert I split the banana rum shake. It was pretty good and you could definitely taste the rum. I wish it had more of an ice cream consistency. It tasted kind of syrupy. It wasn't bad though. <br><br>Our waiter was ok. I liked that the manager stopped by to see how our food was. <br><br>This is a great place to enjoy dinner/drinks/spiked shakes. They have many tvs to watch sporting events.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mULTk-h9wEurEwdGV3VVww/348s.jpg", "caption": "Deviled eggs"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cU3PjE9ozzwkjqSoOCMhAg/168s.jpg", "caption": "Small fry"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jRyDS0l0fjG5sWVVlSlCJA/168s.jpg", "caption": "Cheeseburger with garlic Parmesan sauce"}]}}, {"review": {"des": "I came here with a friend Sunday afternoon and it was quite an interesting experience. Upon walking in a hostess asked if we had a reservation. It's a burger spot and wasn't crowded so it was weird that she asked but that may indicate that it gets crowded here during the peak times. <br><br>Drinks:<br>I thought it was cool they had spiked milk shakes. I ordered one but it was a bit stronger than I expected and it didn't pair well with my burger and fries so I ended up sending it back but cool concept nevertheless. <br><br>Menu:<br>I wasn't super impressed with their menu. You are pretty much forced to build your own burger. The ones the have as options just wasn't anything spectacular. Be mindful when building your burger because it can add up quickly. I was shocked they didn't have a burger on the menu with a fried egg and bacon - that's like an American standard nowadays, right? Lol<br><br>Food:<br>I didn't like that pickles and lettuce come on the side... like you are back there making my burger, I requested lettuce and pickles so why not just throw it on? Me and my friend decided to split a large fry and they were massive! We both agreed we should've just split the smaller portion. The burgers were messy so I wouldn't go here on a first date lol Overall the food was good though!<br><br>Service:<br>Service was kind of lacking. The waitress wasn't attentive even though it wasn't busy. She charged us for the shake I returned. Then when I reminded her to take it off, she walked right to the register and kept it on anyway. She was very sweet and apologetic about it and mentioned it was a rough Sunday, which I understand! We are all human and deserve some grace.<br><br>Temperature:<br>It was hot outside plus two parties had dogs with them so we opted to eat inside the restaurant where they had the patio door open. When I tell you it was hotter inside than outside, man! We walked out and were relieved by the breeze. They may want to get some fans blowing or turn the air on when it's hot out. <br><br>Overall:<br>Overall it was an alright experience. Nothing I'll be running to bring other people to but if I'm in the area and hungry I would possibly go back to. The food was good, the prices were typical and the atmosphere was good! Don't go out of your way to come here but you should maybe possibly check it out lol", "pics": null}}, {"review": {"des": "Although we had some errors on our meals form the kitchen, our server was hasty in correcting and comped some of our food. Our server as absolutely exceptional in her service and her recommendations. My friend had the #3 burger and said it was one of the best burgers she had (add garlic aioli on the side!). The $10 bottle of champagne special is a plus too! The music can be a bit loud as the inside dining area isn't enormous, so be prepared to raise your voices a bit for conversation.", "pics": null}}, {"review": {"des": "The review is somewhere between 3.5 and 4 stars <br><br>We came here around 7 pm on a Friday night. We were able to get seated right away. There was no availability for outdoor seating but there were plenty of tables to sit inside and along the bar. Our server was very attentive and knowledgable. Our water glass was always full and we didn't have to wait for him- he checked on us periodically. It got a little crowded and loud as the night went on since people were standing around the bar and blocking the walkway, but overall good ambiance. <br><br>For drinks i got frosé and my boyfriend got the spiked grape soda. Both drinks were excellent. Tasted great and were strong. The only thing I would say is that my frosé melted very quickly. We started with the pork belly slider ($12) and the chicken wings. I was excited to try the sliders, but they were rather disappointing. The ratio was completely off. The pork belly was so thin compared to the bun. The coleslaw added a nice texture but couldn't make up for the lack of pork belly. For $4 a slider, I was expecting a little more. The chicken wings were standard. It came with 8 pieces (I think). The buffalo sauce had a nice kick and we requested for the bleu cheese to be on the side. <br><br>For our mains, I decided to go with the egg sandwich ($12) and my boyfriend got the number 3 ($13). None of the sandwich/burgers come with fries, they need to be ordered separately. We decided to get a large fry ($4.50) to share, with a side of truffle aioli. I kind of regret getting the egg sandwich, I was hoping for something similar to the one from Eggslut but it was not. They used sandwich bread instead of a bun. I believe it was like a brioche bread- very soft. It fell apart immediately after I took the first bite. It was a hard sandwich to eat. I wish there was more bacon in the sandwich. However, the aioli was flavorful and the egg yolk was cooked perfectly (lots of ooze!). The lettuce was shredded and not whole which made it become soggy quickly. I don't think I would order this sandwich again. On the other hand, my boyfriend's burger was seasoned very well. There was perfect ratio of bun, meat, avocado, sauce, and cheese. It had a kick to it but very well seasoned. If we come back, I think I will try a burger instead. The fries are very similar in shape and texture to McDonald fries. They serve them in a takeout box, poured onto the plate. I wish they just served it all on the plate because the ones that were still in the box, ended up becoming soggy from the steam. The truffle aioli was perfect with the fries. They do charge an extra $1 for the aioli.  <br><br>They do not have any desserts beside the shakes. We weren't in the mood for shakes but they definitely looked good! Although all the drinks and food came out in reasonable time, nothing came out piping hot- all the food was lukewarm. Perhaps we will come back here, but most likely only for the drinks and to try the shakes.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wEyo3aibACaXmYoq-5DGjg/348s.jpg", "caption": "Fries"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/r3iqUEvThi6SUGGCklumWQ/168s.jpg", "caption": "Egg Sandwich"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8YlhyohITxtQyxFwb4LdsQ/168s.jpg", "caption": "Pork Belly Sliders"}]}}, {"review": {"des": "You should try 25 Degrees. It is an interesting experience. Yes, it is VERY loud, but I like it most for the $10 Bottles of Champagne for Mimosas with brunch. I prefer my Mimosas without juice, ;) but the peach puree was an interesting taste. Warning: The peach puree is REALLY thick, start with a little bit.<br> <br>I really enjoyed the Avocado Toast with delicious heritage cherry tomatoes. The maple bacon was a yummy compliment. My friend that makes an AMAZING Chilaquiles dish said that the one at 25 Degrees was really good, and she would definitely order it again. Note: We ordered both WITHOUT eggs because we do not like eggs. Bonus: They also the football games on Sunday. Enjoy!", "pics": null}}, {"review": {"des": "I definitely don't frequent here enough. I live very close and decided to pop in on a Tuesday. The happy hour specials were good, the food is great, and the service at the bar was excellent. The food came out quickly and the bartender was very attentive. Check this place out if you haven't yet!", "pics": null}}, {"review": {"des": "Delicious burgers!! Place was crowded - seemed like a local hangout. We waited a bit to order but food arrived quickly once we ordered. Fun spot!!", "pics": null}}, {"review": {"des": "Yum! The burgers fries and drinks are all great! <br>Had a late lunch and you know it's good when there is a table of construction workers! <br>The burger and fries were enough to share but of course I didn't! Haha! We each had our own. <br>Met the manager and he was a very helpful friendly guy! <br>Looking forward to eating and drinking here again!<br>Love that the front window opens and it's very inviting atmosphere.", "pics": null}}, {"review": {"des": "I am not kidding when I say this was the best burger I've ever had in Chicago, actually anywhere. My friend took a group of us awhile back, so this post is old, but I actually can't stop talking about their burgers till this day. We went with a massive group, maybe 15 of us, and I remember the waiter being super accommodating the entire meal. The bloody mary's can get super spicy but they're delicious. I highly recommend either getting the Number Six or the Number One - those were everyone's favorites + the sweet potato fries. I'll definitely be back to this place as soon as possible.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DPDvpuPOvRx8IKpAg8WKwg/348s.jpg", "caption": "Sweet potato fries"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZplXGzZzU3psAGCgGSKKHw/168s.jpg", "caption": "Number One"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/if0QUrc3K7qUb4uOMBaSig/168s.jpg", "caption": "Number One"}]}}, {"review": {"des": "Found this place when looking for a burger joint near the Museum of Broadcast Communications on North State Street. Others that were closer to the museum were either pay at the counter/not restaurant-y enough, or too expensive with small menus. From the website and yelp reviews it appeared 25 Degrees fit the bill.<br><br>It was a crazy snowy day right after Christmas and the short walk between the museum and the restaurant seemed to get longer the more we walked and passed other restaurants, but I'm glad we stayed the course. It's dark inside but not in a dingy way, definitely in a stylish way. We had an amazingly comfortable booth and a really hard working server who made it a great visit. The turkey burger was nice and juicy, which is shockingly hard to find!<br><br>Only complaints are that the onion rings that came highly recommended were just so/so, and would probably not order again. Also, the \"music\" in the place was just undecipherable noise - it was kind of a heavy metal/rock soundtrack that didn't seem to appeal to the crowd that was a mix of twenty somethings and families right before the dinner hour. If I could choose, I'd ask for something recognizable/popular, or nothing at all.", "pics": null}}, {"review": {"des": "I. love. this. place.<br><br>Although this place looks like it is on the small side and could be overlooked, don't let that fool you. <br><br>This is THE best burger place in Chicago. hands down. <br><br>Every single time I have been there, the food has always tasted perfect. Their pesto tomato soup is a must have as is their number 6 burger - classic and incredible. Their fries have a perfect seasoning and they let you add different sauces to dip them in. <br><br>They have this awesome, relaxed vibe and play great throwback rap. Their walls are covered in this red velvet looking designs and filled with high tops, big booths, and an island bar.<br><br>On Mondays they offer 50% off your bill if you are industry and 10% off every other day of the week!! <br><br>I honestly don't think this place could get any better.", "pics": null}}, {"review": {"des": "Sunday fun day and our last day in the windy city. <br><br>This place was definitly one of the best places i have ever had brunch at, and being from California we do have alot of options . The music was all hip-hop tunes, the vibe was relaxed and lets just say the food was amazing. <br><br>We started off with mimosas, and once we realized it was $10 bottles of champagne we quickly ordered 9 bottles for our table of 7. I mean where are you going to get that deal. As for the food, i ordered the breakfast sandwich which consisted of scrambled egg, cheddar cheese, apple-wood smoked bacon, arugula and a killer herb aioli. So so good, and also i ordered a side of potatoes and the jalapeño bacon!<br><br>Lets just say if you ever visit this lovely city, be sure to stop by here, you wont regret it and the staff is very friendly and the champagne will have you all the way up , haha. <br><br>Cheers! Until next time, Chicago.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4B7IQZCWYf-Vl1uqjEdzSw/168s.jpg", "caption": "$10 bottles on Sunday Fun Day"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KtzQik4bqSZcBb6e3UQKfw/168s.jpg", "caption": "Breakfast sandwich."}]}}, {"review": {"des": "Really cool bar and burger joint.  The deviled eggs HAVE to be some of the best in the city. SOOO good.<br><br>Good draft options, going to probably make this one of my goto spots for an after work beer.", "pics": null}}, {"review": {"des": "We had a reservation for Saturday brunch - the table they had planned for us had a group that were still ordering more drinks so we ended up waiting at the bar for about 20 minutes. <br><br>Luckily, they have a $10 champagne deal that's hard to beat. I also had the breakfast sandwich, which I loved, but it came with a side of fries that were too seasoned for me.", "pics": null}}, {"review": {"des": "Got a great table outside by the street - headphones in I barely noticed street noise. Very polite and helpful waitress. I went with the Number 2 and happy to learn the lunch special was any of the name burgers + fries + side for the menu price of the burger! That's a steal :) <br><br>Good burger but could have used a bit more melting on the cheesy but all around I'd be back :)<br><br>OH. And it's a Pokestop too ;)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9Rk-ag6y5k1s03legs51ig/348s.jpg", "caption": "Gorgeous view behind me"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3alygMZWmfJMbaong2aORg/168s.jpg", "caption": "View straight up :)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/O9GwT5_78uwT3a85t9U02g/168s.jpg", "caption": "Number Two with Fries"}]}}, {"review": {"des": "I went for the second time today. OMG, I had a burger with grilled onions and harvarti cheese and sweet potato fries. This is the best burger I've ever had in my life and I'm an expert on burgers. The fries were fantastic too but when there is a sirloin hunk of meat perfectly cooked staring me in the eyes Im going to concentrate on the meat.  Bonus, the bun didn't fall apart. <br><br>I also had a Stella but I'm not going to give them credit for that. <br><br>GO GO GO TO THIS PLACE. Excuse the enthusiasm.", "pics": null}}, {"review": {"des": "We had #2 and 3 burgers last night and both were delicious! I'd go back and have the same thing tonight!", "pics": null}}, {"review": {"des": "This is a burger joint with cloth napkins and cocktails. The interior is nice but can get quite loud, so try for a table on the sidewalk. <br><br>The burgers are huge, with two giant patties and all the fixings. I opted for a Number Six, because it is essentially my standard loaded burger. Everything was tasty, but the extremely juicy patties quickly overwhelmed the soft bun, and I ended up with two handfuls of mush. Tasty mush, but still...<br><br>There's a nice assortment of drinks, plus spiked sodas and shakes. <br><br>Service was friendly.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wxsNB7dBmdRTD5y23dNctQ/348s.jpg", "caption": "Number Six"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oaW8Qx2R7kVerOBJ3cOCNA/168s.jpg", "caption": "Interior"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kY7-3od9lx2GndBt1Rzbtw/168s.jpg", "caption": "Exterior"}]}}, {"review": {"des": "Came in for dinner on a Saturday night around 7pm. Review as follows. There weren't many people the entire time. It started to get packed once we were leaving. <br><br>FOOD - The menu isn't huge which i'm complete fine with since sometimes when the menu is too big things get confusing and or hard to make a decision. Our appetizer and food + drinks taste phenomenal. <br><br>DECOR/ATMOSPHERE - The decor is right up my alley. Dim lights, touch of class, appealing. Very clean all around with nice table presentation. I also enjoyed the music selection! Wide variety but all tasteful. It was also not overly loud. They also had it open in front which door was a garage door, that added a cool look and feel to the whole place. <br><br>$$$ - Prices were good. For the quality of food, quantity and location i can't complain at all. Including drinks. <br><br>STAFF/SERVICE - Staff were very attentive and on point with friendliness. <br><br>I'm not a big drinker but the drinks sounded so appealing. I asked our server for her opinion on a drink and she directed me to a good choice. My boyfriend tried 2 different drinks and he also enjoyed taste and were made fairly strong.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uI0CuBA6Kp9pgmOVeXW2Yg/168s.jpg", "caption": "We had half & half (onion rings and sweet potato fries) along with #1 and #3. Appetizers were the tuna tacos."}]}}, {"review": {"des": "I was in Chicago visiting a friend and we all decided to come here for brunch, mainly because of the $10 bottles of champagne.<br><br>We were definitely blown away by the service and food.<br><br>Our waitress was very friendly and had the perfect balance of not smothering but not leaving us alone all meal.<br><br>For $10 the champagne was just fine for all of us. I believe we ended up ordering 6 total.<br><br>For my meal I had the Breakfast Sandwich and was really expecting what you would normally thing of as a classic breakfast sandwich. Woah was I wrong. I literally could not put this down. The eggs were cooked to perfection and the bread it was on was so tasty, especially with the herb aioli. Mine was delicious and I shared only 1 bite and in return got to try 2 other dishes.<br><br>One was the Banana Pecan French Toast and it was very good, definitely full of flavor and would easily satisfy your sweet tooth. The other was the Number Two Burger. That was also delicious and packed with flavor. Both of my friends cleaned their plates.<br><br>Also the sweet potato fries were so good!<br><br>Would definitely recommend this restaurant as a good brunch/lunch spot.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YZkP768B3XG4ctkjegOZVA/348s.jpg", "caption": "Up Close of the Breakfast Sandwich"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bwO2unt8SAsmjKnoDmXyjg/168s.jpg", "caption": "Banana Pecan French Toast"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xUnaCRtvJ9Ohl2nTY5AGuA/168s.jpg", "caption": "Breakfast Sandwich and arugula salad"}]}}, {"review": {"des": "The environment here is too loud for conversation but the food is great! I wasn't super hungry so I shared the breakfast sandwich and fries with my friend, but I had to get a side order of the jalapeño bacon. The bacon did not disappoint! The breakfast sandwich and fries were great as well. Service was quick and our server was very friendly! Great place!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kCjvk4nrwWs5d7hBMsfzng/168s.jpg", "caption": "Fries were great!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/N69EBtZPr-lyA2IIDRirqw/168s.jpg", "caption": "Jalapeño bacon! Sooo delicious!"}]}}, {"review": {"des": "Went here for brunch. I highly suggest you make a reservation. You will still have a wait but a much shorter wait during brunch hours. This place is great bc they do $10 champagne bottles in lieu of bottomless mimosas. The food was average but you're really here for the drinks. They also play music and have the TVs on whatever available sporting event. It gets super crowded so be prepared. There's plenty of bar seating though.", "pics": null}}, {"review": {"des": "Came across this place first day during our visit to Chicago. There was only a few people sitting so we were a little skeptical about place being \"dead\". Waiter came to us right away and made his recommendations.<br><br>They had a good lunch special.. $13 got us a specialty burger, fries, and a soft drink. Not bad at all! I ordered a veggie burger but since those are in the \"Create your own\" section, it didn't qualify for the lunch deal. <br><br>All I have to say is \"THAT WAS THE BEST VEGGIE BURGER I'VE EVER HAD!!!\". Would definitely come back again.", "pics": null}}, {"review": {"des": "Food was ok but it was the worst service for a place that isn't a diner I've had and they included a 20% gratuity", "pics": null}}, {"review": {"des": "If you are craving a burger (or veggie burger), this place is for you! The veggie burger was unique in that it was made with beets and the bun was super tasty. My husband said his burger was outstanding with regards to flavor and quality. We got a side of chickpea fries (YUM), regular fries, and onion rings. Onion rings were delicious and freshly made. Service was pretty good and our waitress was really sweet. Will definitely be coming back for (veggie) burgers and fries!", "pics": null}}, {"review": {"des": "This was my third time eating at 25 Degrees for Sunday Brunch! I found a Brunch home solely because of the $10 bottles of Champagne available till 3pm. I also love their Blood-Orange mule that are super tasty! Although, its not the best burger Ive ever had, they're Burger options are pretty good! I love their Sweet Potato fries that come in a cool Chinese takeout container as well! This past Sunday we were serviced by a new waitress named Sam! She was super attentive to our table! Once the manager found out we were celebrating a Birthday he sent over a free bottle of Champagne, which was thoughtful.", "pics": null}}, {"review": {"des": "Really, really liked this place. Met a friend. Sat outside. Our waitress was lovely. We both tried the #2 which was full of flavor with burrata and pesto. It tasted fresh and delicious. Also had the half and half sides of onion rings and sweet potato fries. What a deal. So much fried awesomeness for only $4.50. And the burger was well-priced too. And I loved the beers on the beer list. Our money flew away when a gust of wind came by but our seat neighbor ran into the street to help us retrieve it. Even the customers are awesome. Will go back to try more of the menu for sure.", "pics": null}}, {"review": {"des": "MUSIC IS AMAZING! They have an awesome staff! The sweet potato fries are super yummy! I recommend getting the half and half with fries and onion rings! Awesome place to have a Sunday brunch with UGH-mazing deals!", "pics": null}}, {"review": {"des": "Great wings, the chilli honey is great and happy hour prices are great too. Cool, divy elegance inside and nice staff too.", "pics": null}}, {"review": {"des": "Had an absolute blast with a girlfriend here for brunch. Known for its burgers it also has traditional breakfast items like scrambles and pancakes but the best part about this place were the DRINKS! $10 bottle of champagne with option to make mimosas or bellinis with peach or orange juice. My friend loved her Bloody Mary.<br><br>I ordered Lemon Ricotta Pancakes to eat and had 2 bottles of champagne (shared with a friend) and it totaled $30 once we split the bill. The ambiance was a bit dark inside for a Sunday - it wasn't warm enough to open the garage door to the street. The waitress was sweet and we'll definitely return!", "pics": null}}, {"review": {"des": "I've been here quite a few times for brunch since my initial review, and unfortunately, the food quality seems to diminish each time. The champagne, however, is consistent and keeps us coming back lol.<br><br>I also really like the space. I wish my home looked like 25 Degrees. It's an appropriate place to \"continue the party\" on a weekend morning as they feature good music, black chandeliers, leather booths, and velvet walls. Very \"club meets diner\". During the warmer months, they open up the windows, but otherwise, it could be night out for all you know. <br><br>I've read so many rave reviews about dinner that I feel the need to experience it myself. Next time, I'll opt for that rather than brunch.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4f4EoIxv1ybxtp3GPCySfg/348s.jpg", "caption": "Chicken and waffles--revamped since the last time I was here."}]}}]}