{"name": "3-arts-club-cafe-chicago-2", "reviews": [{"review": {"des": "Located inside the courtyard of Restoration Hardware, the main atrium dining area is absolutely gorgeous and breathtaking.<br><br>The menu is seasonal and has a good variety of shareable plates in addition to main dishes. I recommend the smoked salmon, hand cut fries with garlic aioli, and the lobster roll.<br><br>The lobster roll is one of the best. It's stuffed with chunks of lump and claw meat that's been cooked to perfection and then chilled. It comes with drawn butter, mayonnaise, some old bay seasoning, and finished off with a liberal sprinkling of chopped chives. The roll itself is toasted to a magnificent golden brown, slightly crispy on the outside, while rich, soft and buttery on the inside. It comes with a side of fries, but I opted for their mixed greens salad tossed in a vinaigrette.<br><br>The smoked salmon is an interactive dish. You get slices of smoked salmon, Texas toast, sliced cucumber, pickled onions,  chopped parsley, and a handful of capers. You build your own bite based off your own personal preference. I recommend you layer each item on top of the toast, starting with the salmon, then some cucumbers and onions, and finish off with some capers. The salmon is fresh, buttery and has a velvety texture. The sharp saltiness of the capers pairs really well with the rich and buttery flavors of everything else.<br><br>The hand cut fries are fresh, piping hot and crispy. You have to get it with the truffle aioli. Unlike other places that use truffle oil, you get real pieces of black truffle here. The aroma of fresh truffle combined with the aioli is absolutely divine.<br><br>Service is fairly good here. They're attentive without being intrusive. The main draw of this place is the decor and overall ambiance of the atrium. You have a large central fountain flanked by large Heritage olive trees. There are also some gorgeous chandeliers to provide some extra light in addition to the copious amounts of natural light that floods the space courtesy of the clear roof. There are some 2 seat tables surrounding the fountain and large communal couches for larger parties.", "pics": null}}, {"review": {"des": "I felt that the food was priced steeply for what it was, but there is absolutely no denying that this is one of the most beautiful restaurants in Chicago.<br><br>3 Arts has an indoor decor that is unmatched through the city and if you're looking for a place to catch up with someone over a cup of coffee or a light bite to eat, this is a great place.<br><br>The restaurant defines the word ambience.", "pics": null}}, {"review": {"des": "One of my favorite places in Chicago!!! <br>Do not skip out on going here if you have the opportunity. Unfortunately, they do not take reservations which could make for a long wait on the weekends. But my friend and I were seated right away on a weekday around 3. <br>You have no choice but to be in awe at how stunning it is inside. The atrium is gorgeous and you're surrounded by exposed brick, beautiful plants, a giant sparkling chandelier and a water fountain in the center of it all.<br>We were seated in two plush arm chairs with a perfect view of all the decor and immediately knew we had to order some champagne. I mean really, this place makes you feel like royalty.<br>Our server was very sweet and friendly as she asked if we'd been there before and offered to explain the menu to us. We started with the delice de bourgogne cheese plate with crusty warm bread, sweet preserves and candied pecans. If this was all I ate while I was here... I would have been more than satisfied. The portion is so worth the price and it was some of the creamiest cheese that's ever crossed my lips. I've been dreaming of this cheese since I left, seriously.<br>For an entree I ordered the turkey club with hand cut fries. This isn't just your ordinary turkey club... it is an exceptional turkey club. You can actually taste the thick cuts of bacon and the quality of the turkey is excellent. Easily became one of my favorite sandwiches. And as if it couldn't get any better, the fries are amazing. I've read a few reviews that said the food is mediocre but I thought it was all very very good. <br><br>And of course part of the experience here is being able to walk around and explore all the different floors of Restoration Hardware full of furniture and decor. It's SO much fun. Make sure to make it to the top floor!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/p0CCHeiK_JERPgpB5ufGgg/348s.jpg", "caption": "Top: Smoked salmon plate Bottom: Turkey club with fries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KGS4pBI27utCSOYcMfQXYQ/168s.jpg", "caption": "Delice de bourgogne plate - sooo good."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IBvqHQt2snibXIedIfgHAw/168s.jpg", "caption": "Inside in the atrium"}]}}, {"review": {"des": "DO NOT skip this place if you are in Chicago! <br>I was only in Chicago for a weekend and even with a jam packed schedule of sites to see, 3 Arts was my favorite spot. We kind of assumed that the food would be mediocre, so we settled for just walking around the different floors and just grabbing a quick coffee. <br><br>The warehouse itself has so many areas you can sit and wait and enjoy your coffee. You'll have access to all floors so feel free to explore and take pictures everywhere! And of course, don't forget to admire the most beautiful atrium I have seen in my life!", "pics": null}}, {"review": {"des": "A must visit for a girls trip to Chicago! The food is mediocre but the service & ambiance is 100% worth it. We went on a Thursday for brunch so it wasn't busy at all. <br><br>Started with the Burrata sharable for the table which was the best thing out of everyone's meals. Then I ordered the turkey sandwich with fries. The garlic aioli is really good! My friend ordered the french dip but none of us liked it. The salad was good!<br><br>Definitely walk around RH after/before! So cool!", "pics": null}}, {"review": {"des": "We finally come back to visit 3 Arts Club Cafe it's been about two years since we have been here for brunch. We came on a Tuesday afternoon was pleased that we didn't have to wait to get a seat. I love the atmosphere of the cafe so serene and classy.<br><br>When I looked at their menu my jaw dropped at the prices of their burger now $23! It comes with fried and two patties like an Au cheval burger minus the egg and bacon. It was a good burger we all ordered it since we couldn't figure what else we wanted. The burger was still good just not worth $23. Chai latte was delicious as always. Our server was okay.<br><br>I think she was busy with other tables to pay much attention to us. I am not sure if I come back here for a while since it's so expensive. Too rich for my blood but it still a fun place to walk around and see furniture.<br><br>Also, FYI valet is $12 now. I remember when it was a free service", "pics": null}}, {"review": {"des": "This might be the most beautiful dining atrium I've ever eaten in! We came for brunch on a Sunday and lined up about 25 minutes before they were set to open and we were probably around 10-15 deep in the line, which wrapped around the block. The cafe itself is located within a Restoration Hardware, which has picturesque showrooms on each floor, including a rooftop garden. <br><br>Once we were seated, it was almost too distracting to order since we were all just in awe of the natural lighting and the centerpiece, restored water fountain that sat below a beautiful chandelier. The menu is pricey, but part of that is paying for the ambiance.<br><br>We started off with a smoked salmon platter to share with the table. For $25, you get 4 pieces of Texas toast, which replaces bagels for a spread of cucumber, pickled onions, capers, and cream cheese to be served with smoked salmon. The plate was as delicious as it was beautifully presented. For our meals, we tried the RH scramble and the RH granola and yogurt. I was surprised by how good the scramble was, and realized it was mixed well with creme fraiche for a slightly runny, but creamy texture. The granola and yogurt combo was very well-made and tasty. The $10 side of bacon comes with about 5 slices of thick-cut and caramelized bacon.<br><br>Overall, the meal was good, but the ambiance was what made it worth going to. Make sure you get there early, otherwise you might end up waiting a couple hours like some of the other reviewers to be seated.", "pics": null}}, {"review": {"des": "We walked in and had about 20 minutes to kill before we could get a table Saturday afternoon. Luckily, this place also happens to be a furniture store (a pretty nice one). So obviously while waiting we decided to sit down on the nearest couch since 1. Couches are comfy. 2. I don't have furniture money, it all goes to food and drink. <br><br>We got a larger table in the back corner since there were 5 of us. This place is gorgeous, which is great, except for when you're trying to order and everybody else in the group is just trying to be instagram famous. After 15 minutes of pictures, we we're finally ready to order. <br><br>Got the burrata and prosciutto for the table. I also grabbed a beer because it's my one and only weakness. The burrata was bomb. Toast was buttered well and had some nice scorch marks on it. The big chunks for fresh basil with the tomatoes really made this pop. Fresh cheese is my one and only weakness. <br><br>My other one and only weakness is cured meats. Needless to say, I adored the prosciutto board.<br><br>While the food and atmosphere here was really awesome. Service was a little slow after we ordered. It took me 10 minutes to flag down someone to get another beer and another 10 to get the check. <br><br>Will return for vibes.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BYgWAmwFd8YpKpM4dYRdLA/348s.jpg", "caption": "Burrata"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CnmnpeLkRVifJJjD0SZCSg/168s.jpg", "caption": "Prosciutto"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NcRpd6fn6pfmQVpgIxADRQ/168s.jpg", "caption": "Yes that candle is real"}]}}, {"review": {"des": "This place is Incredible! Visiting from Birmingham, al..this is such a unique place. Staff is friendly and knowledgeable food is incredible because the produce is fresh...simple and delicious. Also how cool is all the furniture you can buy while waiting?! Will be back next time I come to Chicago.", "pics": null}}, {"review": {"des": "FINALLY had the chance to visit 3 arts after living here for a year. Came by on a Friday afternoon, waited about 15 minutes for a seat in the atrium, which wasn't bad at all compared to the others who have mentioned they waited at least an hour. Aaand we scored a table right by the fountain! What was nice was that they text you when your table is ready so you can walk around the RH as you wait.<br><br>Food is a bit pricy so you're definitely paying for the atmosphere. Highly recommend the shaved vegetables salad. It was absolutely delicious! Along with that we got the artisanal prosciutto and the turkey club.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ve5SEFKgoH9qIlkAdhuD8A/168s.jpg", "caption": "Turkey club"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ghzd_DcV050hhvEBn9rjPQ/168s.jpg", "caption": "Artisanal prosciutto"}]}}, {"review": {"des": "Such a cute place!! Beautiful and elegant but long waits. However, the good thing is that you can relax on their comfortable furniture or go to the other floors and check out their displays! The food here was delicious too but a bit expensive. I got a caramel latte and it was very over priced- but delicious! I then got the chai latte and it was definitely worth getting- so pretty and DELICIOUS!!! The RH scramble was probably my favorite dish. It's a simple plate but the way they made makes it very special! I also got their truffles grilled cheese and that was delicious too, I'd choose the scramble over it though! Definitely worth coming here once!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9UfnDVsm9ec_gbRoe27-IQ/348s.jpg", "caption": "chai latte- SOO DELICIOUS!!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JjQeZnPbU5l8t1LxTBtrGA/168s.jpg", "caption": "Caramel latte"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fp1ruu6OCS-QSQ6ShKLNng/168s.jpg", "caption": "Truffles grilled cheese"}]}}, {"review": {"des": "One of my favorite must go to spots in the Gold Coast area. Great for pictures!!! Amazing to go with a few friends to see the cafe or walk the multiple levels and look at furniture and lust for a dream house of your own. So beautiful in here. Modern furniture and vibes. <br><br>Amazing for Instagram pics! <br>Also the pics I'm attaching are of me coming here for years. Notice the amount of check ins I have. I'm very familiar with the area and the space, always love coming here literally whenever I'm in the area and to show friends that are new to the city. It is one of my must see places! <br><br>The fries here are the BEST with the garlic sauce. The burger is also tasty! I wouldn't recommend the hummus with vegetables unless you're really trying to be healthy, which I thought I was.. but then regretted it after lol. <br><br>Overall great staff, they don't really bother you and leave you to conversation and you're able to walk around the levels freely without any questions.", "pics": null}}, {"review": {"des": "It was a special treat to celebrate Bosses Day here....such a beautiful, relaxing and inviting space. We ordered cappuccino, tea, hamburger and grilled cheese sandwich. The banana split dessert was gigantic....great way to impress anyone! Don't come here hungry and looking for a lot of items on the menu...its more about the ambiance than anything else. The service was top notch, highly recommended!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zG8alxvJT2-oH5ajZIePag/348s.jpg", "caption": "Hamburger"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MX63Ita_KfRtgqRKBUkGnQ/168s.jpg", "caption": "Grilled cheese"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CAycMGTr_0m4bFhCo84Q2A/168s.jpg", "caption": "Cappuccino"}]}}, {"review": {"des": "Stopped in for brunch last weekend. The wait was estimated for 45 minutes but we didn't wait longer than 15-20 min. <br><br>Their Brunch menu is quite small. I wish they had more! I ordered he scrambled egg with avocado and a side of bacon. OMG the bacon is thick! My husband ordered the granola and an almond croissant. And we both ordered lattes from the coffee counter that they brought over to our table once they were ready. <br><br>The ambiance is great. It's such a beautiful courtyard! We sat at a table right next to the fountain. <br><br>The service is great!", "pics": null}}, {"review": {"des": "A great experience! Not somewhere I would come every week, due to the 2hr wait and $150 check, but definitely a place to visit. Just as beautiful as the pictures. The food was good, service was good, location is great! Only negative is the parking, but that's not their fault.  We spent the 2hrs waiting by exploring the 5 floors of the Restoration Hardware store. They have a beautiful rooftop to enjoy also. <br><br>The lemonade is great. We has the French dip sandwich, cheeseburger, lobster roll, and burratta starter. All yummy. Would recommend!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/h72EsiTy4sItE96KYya--A/348s.jpg", "caption": "French dip sandwich"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/snF3CnG0AB-OcnhwA9RJNA/168s.jpg", "caption": "Cheeseburger and fries"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tmbiUHZpr40NtSMmSqYa6g/168s.jpg", "caption": "Lobster roll"}]}}, {"review": {"des": "Located inside RH, fancy furniture store with nice displays on each floor.  We got there about 1030 on Saturday and the wait was about an hour and a half.  Walked around and enjoyed the furnitures at each level which took off half of the wait. <br>When we finally sat down, we got the lobster roll, simple fish dish, and their warm cookies.<br>Lobster roll was butter base, not drenched in mayo. Bun was nicely grilled and soft.<br>Simple fish dish, was a butterfly white fish, with lemon, olive oil and dill.  It was moist and flaky and simple.  <br>The plates come with either fries or salad.<br>The warm cookies (3) were decadent, dense and filled with melted chocolate.  It was really good and I just wanted to dunk all 3 of them in either coffee or glass of milk.<br>Beautiful and spacious ambiance. Good food and drinks.  Good inspirations on your next room/home interior design.", "pics": null}}, {"review": {"des": "Glad we finally checked this place out. Food was delicious with huge portion and reasonable price, although the wait was really long. We got here around noon today (Sunday) and waited for about 1 hour and 15 mins. <br><br>Vegetables + Dips are a good dish to share. Vegetables are fresh and it comes with 3 different dips. I ordered egg scrambles with roasted avocado and toast. It was a simple but tasty dish. My friend ordered the burger, which was huge and delicious - it had 2 patties. Thick cut bacon was good, but I've had better. With the decoration and ambiance, it was a lovely lunch. <br><br>This place also has tons of photogenic spots. The roof top was surprisingly neat. For those who love taking pictures, you will love this place.", "pics": null}}, {"review": {"des": "What a beautiful dinning experience. We waited about an hour but because we could walk around and grab a little snack at the bar, it didn't seem too long. I wouldn't suggest going here if you are very hungry and want to be seated ASAP. The place itself is gorgeous!!! From all the showrooms to the outside deck. <br>For food, we split a burger and a burrata appetizer. Everything was delicious and very well cooked, with the exception of burned bred but we can't all be perfect ;)<br> Definitely a place to check out!", "pics": null}}, {"review": {"des": "Beautiful and extremely stunning place! I brought my brother and his girlfriend here on a Monday afternoon. I've tried coming here numerous times in the past, but have gone elsewhere due to the extremely long waiting time for a table. We decided to wait the hour and a half on Monday for a table. Once called, we got sat at a long table with two couch benches on both sides and another group of people next to us. I didn't realize that this was the set up until we finally got seated. The food was pretty good, my brother and his girlfriend got the California club sandwich which was a lot better than the bib salad I got. There was far too much goat cheese and dressing, so I'll be sure to ask for that on the side next time. It's truly a beautiful place and I recommend bringing people from out of town here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/D-JkoQ21Tu6tcKnMEV1BRA/348s.jpg", "caption": "Meat and cheese board"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3CIHbWpvGCctuMr_D0bucg/168s.jpg", "caption": "Bib lettuce salad with chicken"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Zvazc2AlOlCgwfF4FhrVkg/168s.jpg", "caption": "California Turkey Club"}]}}, {"review": {"des": "Gorgeous decor and great tasing food. Cafe typically has a long wait but totally worth It. Something about all the chandeliers makes you feel so posh. <br>Arugula salad is so good and the French dip is to die for! Check out the coffee bar and sink into the comfy couches while you wait! Don't forget to go on the 5th floor rooftop to hang out for a bit :)", "pics": null}}, {"review": {"des": "Only reason why I'm giving them 4 stars is because we waited for 2.5 hours in order to be seated, BUT it was completely worth it. It is drop dead gorgeous everywhere you look here. The perfect place to take out of towners or just for a date/ girls day out! As we waited to be seated, we strolled the different levels of gorgeous furniture and sat and had coffee/ drinks on the beautiful rooftop (indoor and outdoor seating available up there!). Once seated, you will forget how long you waited/ how hungry you are because you will be in absolute awe of the dining room. So pretty, so worth it, the end.", "pics": null}}, {"review": {"des": "I've been to 3 Arts twice for brunch. This most recent time, we got there 30 min before they opened on a Saturday and were able to get one of the tables for two beside the fountain (photo op)! We had the prosciutto plate, burger, and grilled cheese. It was a lot of (heavy) food for two, but we pushed through and nearly finished it all. The prosciutto plate was fun and more substantial than I thought it'd be. The grapes provided balance and I munched on them throughout the whole heavy meal. The burger was solid, savory and delicious. The truffle grilled cheese was just average. The service was great. The server was attentive but we didn't feel rushed. Overall, the ambience is great and the food is satisfying. This is a good spot if you're looking for a beautiful place to have a nice lunch. It's about the experience and we enjoyed walking around the store afterwards!", "pics": null}}, {"review": {"des": "Nice environment, love the smoked salmon! Went there on Friday, a long wait for 2 hours.", "pics": null}}, {"review": {"des": "Worth a visit during my weekend in Chicago! This cafe is beeeautiful and had yummy matcha latte drinks. The outdoor rooftop is probably even nicer during the summer but even in the cold was one of the best parts about this place was just walking around the furniture store and", "pics": null}}, {"review": {"des": "Food is great!<br>Ambiance is perfect!<br>The wait time is unreal.... it must be the strategy to keep you walk around the store while waiting to be seated but 2 hr wait time for 2pm lunch is really not ideal.. especially if you are hungry its not easy to kill 2hrs at a furniture shop without any food..<br>Its nice to try for the food options and cool setting but try to go at dead hours during the week.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dOBmbbLtQmMzC1oM_lxKIg/348s.jpg", "caption": "Slow roasted Chicken"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qfHG4hO_MgSyQqVJoz_zxw/168s.jpg", "caption": "Gem lettuce salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ENpRfQlFDKIIiQnad_2RwQ/168s.jpg", "caption": "Cool vibe"}]}}, {"review": {"des": "I keep telling people this place is one of those \"only for the insta\" places. The rest of the Restoration House is pretty cool as it has some pretty cool furniture (at astronomical prices) and a cool top floor. <br><br>I'm one of those self proclaimed \"foodies\" however and coming here for food is just not worth it. There's nothing really wrong with their food. Everything is ok. I've come here several times and have tried their smoked salmon platter, RH scramble, various drinks but I like their chocolate chip cookies the best. It comes with 3 large cookies and they are perfectly chewy and have some sea salt on them. It does become overly sweet despite the salt...  it actually becomes overly sweet and salty at the same time after you get through 2 cookies. Getting any add ons like the truffle I feel like they really give you such a small portion for quite a mark up like there's small dots of truffle you can't even see or really taste it. <br><br>All in all a great place to have a good day out and take pictures, but if you're here for the \"great food\" I'd say skip it or if you're not ready to pay a larger sum for the portion. ALL IN ALL. YOU PAY FOR THE CHANDELIERS AND EXPERIENCE. Come in knowing that.", "pics": null}}, {"review": {"des": "Wow! This place was an instagrammers heaven! The interior was impeccable and you get amazing lighting because of the glass ceilings! The vibe was chill and casual! My girls and i were ready to get our brunch on! We ordered lattes and fresh fruit juice as starters! Then ordered the burger, sandwich and burrata appetizer. We became very quiet when the food came out which is always a great sign---- silence means we were too busy eating! <br>Everything was extraordinary! The burrata was so well seasoned and my gawd i love burrata! <br>The tomatoes complimented it with the toasted bread! <br>We were amazed by the juicy meat in the cheeseburger and then we loved how fresh the sandwich was! We also killed the fries because that too was delicious! The three of us were super full at this point tho and so we need to head back another day for the desserts i hear about!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OnD43ur8S0Qz9GsOCzRdnA/348s.jpg", "caption": "Turkey club sandwich"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/14vJDNOlvfTIXuykYVSISw/168s.jpg", "caption": "Cheeseburger"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tp9MXCY72DKYdn3qj9T7wA/168s.jpg", "caption": "Burrata and tomato"}]}}, {"review": {"des": "Are you paying for the vibe? Yes, yes, you are. Is the food good? It is. Is it worth going? Definitely for the experience.<br><br>Hubs and I were hoping to have an anniversary brunch as our work and travel schedules left little options to have dinner. We had hoped for Sunday brunch, alas they open later on Sundays (11 am) and that was too late for our schedules. This isn't a place to feel rushed, it's an experience for sure. So, we did Saturday instead and hopped onto a Lyft and got there slightly after 11. We checked in and the wait for the seats inside the atrium was 90 minutes, but there was a table that looks into it that is available. We take that spot. No, it's not like being inside, but it's still nice nonetheless.<br><br>We order tea, lobster roll, and salmon platter. The tea cup they gave Hubs was quite dirty. We flagged a server and he looks at it and stated \"that's unfortunate.\" Indeed it is for a $5 tea. New cup arrives and we move on. The lobster roll and salmon platter arrive and they look amazing! The lobster roll was delicious, with a fair amount of lobster meat. We opted for a salad rather than fries as a side. I enjoyed the salad, but Hubs thought the use of parsley was a bit overpowering (I didn't notice it). The salmon platter was enjoyable and slices of lox were quite liberal. The Texas toast base was an interesting concept, particularly since we spent the previous weekend in upstate NY. It was fun to try, though felt a bit heavy. All in all a fun brunch. It is quite pricey, but like I said, it's the experience.<br><br>After we finished brunch, we walked around starting at the rooftop and heading down to look at living room and bedroom furniture. There were people who picked up coffee or cocktails and a pastry from the cafe and sat on the rooftop. Nice option as well. We saw students studying there, too. Can't blame them as that view and vibe inspires me, too!", "pics": null}}, {"review": {"des": "Oh my gosh what I could possibly say that hasn't already be said??? My post will just reconfirm what you've already been reading. This cafe restaurant is ABSOLUTELY GORGEOUS! <br><br>I cannot get over how beautifully done everything is. The atrium cafe with lights, vines, trees, fountains is so peaceful and a perfect date spot, friend get together, dinner for mom and grandma - anything. <br><br>They don't take reservations so show up early to put your name on the list and stroll through the 4-5 levels of the Reatoration Hardware wishing you had more funds in your furniture piggy bank. Check out the rooftop too if it's a nice day.", "pics": null}}, {"review": {"des": "Came here for brunch on Sunday at about 11:00am, and there was already a longggg line to reserve a table. There is no Nowait app to save you from this line, so be prepared to wait if you're coming on a weekend at this time. It took about 2 hours for us to get a table! Fortunately, they have comfortable couches and chairs in the surrounding area where  you can sit. We occupied a corner room for the wait but also roamed around upstairs to check out the furniture. Very cute but expensive items!<br><br>I ordered Prime Rib Sandwich that came with a side salad for $26. Definitely most expensive prime rib sandwich I've ever consumed! The sandwich was good with a jus that made it tasty and juicy. The salad was light and delicious. However, I think a price point of $13-$15 would have been more appropriate.<br><br>We ordered a plate of chocolate chip cookies for $10, which came with 3 decently-sized cookies. I wasn't in the mood for a lot of sweets at that time, so I cut a tiny piece. If you see the picture, I wasn't kidding about tiny! <br><br>Service was excellent. Our server took time to go over the menu and recommendations. He also wasn't overbearing.<br><br>Also, this is a great spot as a cafe (especially top floor) if you want to lounge or work!", "pics": null}}, {"review": {"des": "Holy cow. 3 Arts Cafe has to be hands down the most beautifully articulated cafe in all of Chicago. The cafe might be hard to find because the exterior of the location resembles a residential area (since the building used to be a women's dormitory), but the valet parking makes the place a bit easier to find. <br><br>Once inside, the cafe is secretively tucked away inside of the dim-lit furniture store. As you make your way towards it, you can feast your eyes on the luxurious furniture out for sale/display. Finally, reaching the cafe, you're suddenly taken aback by the interior design that almost seems unreal. The cafe opens up with a tall sunroof ceiling and is a perfectly symmetrical wonderland. Your eyes catch the beams of sunlight bouncing off the gorgeous crystal chandeliers, and the entire radiates a harmonious ambience.<br><br>The menu itself is short, but everything is curated and well-chosen. The coffee here is the smoothest coffee I've ever encountered, and I would even say it tastes best black. The almond donut was fantastic as well, and I honestly don't believe anything could taste foul here. The service was wonderful, and the seating area felt very clean.<br><br>But the most special part of it all is that the rest of the building is a wonderful high-end furniture store, which everyone is welcome to browse. The highest floor is a rooftop patio, and it's a perfect place to spend some leisurely time in the summer.<br><br>I highly recommend the 3 Arts restoration cafe, it is an absolute experience. I feel like this is a cafe everyone should visit, simply for the magnificence of the interior design. <br><br>The cafe is best for brunch and tea time. However, do make a reservation, as the wait could take up to 2 hours! And trust me, you will not be disappointed.", "pics": null}}, {"review": {"des": "It was LIT!! Must-see cafe/place in Chicago. The ambiance is delighful. It was super crowded and we had to wait around 30 mins, but worth it since you can walk around and check the furniture among the floors. We went to have tea and coffee and it was the place to relax and enjoy a sip of drink. Highly Recommended :)", "pics": null}}, {"review": {"des": "A cafe inside a Restoration Hardware? You know it's going to be beautiful! The wait to eat in the cafe can get long but just stopping by to take a look is worth a visit. <br><br>We got there before 12 on a Saturday and was told the wait will be about 90 minutes. We decided to put our name down and check out the shops nearby. We came back before our table is ready and got some drinks and looked at some of the furniture. <br><br>We got seated at one of the couches with another couple which was fine as it's supposed to be a cafe and there was more than enough room for four people. We started with the bacon and it was one of the thickest cuts of bacon I've ever had. The quality of the bacon was good and was not tough for being such a thick cut. We ordered the lobster roll and prime rib sandwich to share. I loved the lobster roll as it tasted great but mainly for the bread they used. It was not the usual thick hoagie style bread but a slice of bread buttered and toasted. It helped make it easier to eat and was less filling. The prime rib sandwich was also very good. The prime rib was thinly sliced and well cooked. When I first looked at the menu, I thought it was limited however all their food was awesome. Quality over quantity!<br><br>I wanted to come here more for the vibes but I left loving the whole experience. Well decorated atrium with awesome food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wjXJphTA5sDf_4SnzYrFkw/348s.jpg", "caption": "Prime rib. IG: betweencupcakes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WrJHsC40jyG1Btv_nznETg/168s.jpg", "caption": "Lobster roll! IG: betweencupcakes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KKKKn19F0WaLN8rO02Pn4g/168s.jpg", "caption": "Lobster roll and prime rib sandwich. IG: betweencupcakes"}]}}, {"review": {"des": "What a beautiful and elegant place! <br><br>I came here with two other people on a beautiful Friday afternoon. They do not take reservations so we were afraid that the wait would be about 2 or 3 hours. Luckily, the wait was only 45 minutes. <br><br>We grabbed a glass of wine and then headed upstairs to their rooftop. The seating is beautiful and you have a great view of the city. We also could have stayed inside since there is couches and lots of beautiful decor!<br><br>I ordered a Kale Caesar Salad ($18) and added lobster to it (an additional $18). A pretty expensive salad! The salad was okay nothing spectacular and probably not worth $36 dollars. The lobster was pretty good but the overall dressing that covered the salad was a bit too salty for me. The salad is pretty large and they do give you quite a few pieces of lobster. <br><br>Overall, this was a cool place and I would come back but would order a different dish!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2rr_BhKX5RVC1-V2-hf-Tw/348s.jpg", "caption": "Kale Caesar Salad ($18) with lobster (extra $18)"}]}}, {"review": {"des": "This place is aesthetically pleasing, chandeliers everywhere and very appealing decor, as it's located within the restoration hardware furniture store.<br><br>Quite limited menu when it comes to food items. We started with the prosciutto board and it was good. It came with a spread that I think is jam? As my entree, I had the RH scramble, the eggs are very soft and melts in your mouth as soon as you consume them. The eggs came with a side of avocado and Texas toast. I almost forgot about the avocado throughout my whole meal. I'm not sure it pairs so well given the texture of the eggs. I also ordered a side of bacon. I am telling you, this \"side\" of bacon reminded me of Au Cheval's bacon. It came with 5 heavenly slices!! My friends split the prime rib and ordered a side of fries that came with garlic aioli that they had enjoyed and was enough for the 2 of them. <br><br>Cons: No reservations. Long wait times. Minimum of an hour to up to 2-3 hours. So I can see why people would say this place isn't worth it. I find there's not too much around this area to explore while waiting too. Food was honestly average.<br><br>Overall the decor of this place is stunning and will be the primary reason people will want to come here for brunch. Just be prepared for the wait! They have a small area in the back that has drinks, so if you're up for it, grab yourself a coffee and check out the 5 floors of marvelous furniture!", "pics": null}}, {"review": {"des": "I have been checking out some gorgeous pictures of \"3 Arts Club Cafe\" on Yelp.  As the matter of fact, many photos came from the showrooms of \"Restoration Hardware,\" which is in the same building.  Hubby and I missed the entrance when we were at the destination until we saw a kiosk for valet parking near the corner of Goethe and Dearborn.  <br><br>We checked in with the hostess and were told there would be an-hour wait.  By the way, the cafe doesn't accept reservations.  I get the point because guests will have the opportunities to explore the RH showrooms from the second to the fifth floors.  I noticed that many guests took the coffee and champagne to go and either drank them while visiting the showrooms or sat down on one of the couches near the cafe dining area.  <br><br>After we received a text for notifying us that the table was ready, we headed back to the cafe and soon were seated.  Hubby and I both got latte ($5, as of 05/05/2018) since we  saw \"Metropolis Project X\" beans listed on the menu as their coffee of choice.  They are the most expensive kind on the aisle of a grocery store and don't sell online.  Great!  We got to try it and tasted smooth.  <br><br>After peruse the menu, we decided on \"Delice de Bourgogne Cheese\" ($18) since smoked salmon board was unavailable at that time.  Hubby and I also shared the \"lobster roll\" with fries on the side.  I liked the garlic aioli and smeared a little on the lobster roll ($28).  Of course, we finished the sauce up by dipping the fries in it.  <br><br>Overall, the service we received was adequate.  The waitress attended multiple tables, yet we flagged her down when we needed a couple cups of water.  Water wasn't offered when we were greeted.  Well, I personally found it a bit odd.  <br><br>\"3 Arts Club Cafe\" and the rest of RH galleries are definitely places that catch people's attention.  As much I want to acknowledge how beautiful and exquisite the entire venue is, it is a splurge for me, money-wise, on food and drinks this caliber.  However, hubby and I were glad that we came here and celebrated our 8-year anniversary in a sophisticated fashion!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JrnzRCrjuW7lAq4ltqYBog/348s.jpg", "caption": "Lobster roll"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/S7wy0wnefuFS_WVfh8izVA/168s.jpg", "caption": "Cheese board"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/x2ZK0X4vfhedYXtbrqLXjA/168s.jpg", "caption": "Latte"}]}}, {"review": {"des": "Highly boujee but worth checking out!!<br><br>Took my friend here who was visiting from Houston and we were both in awe of the entire space. Yes, the wait can be very long (we waited over 2 hours on a Friday afternoon), but there's plush seating peppered throughout the building where you can relax and chitchat. There's also a ton of impeccably designed showrooms that you can explore and feast your eyes on. If you're like us, use that time to take photos and bless your IG timeline hahaha<br><br>$18 is probably the most I'll ever dish out for grilled cheese, but THEIRS WAS THE BEST I'VE EVER HAD.", "pics": null}}, {"review": {"des": "On a hot summer day in Chicago, COME HERE! This is the perfect place to wait 30 min-1 hour for a table. Face it, you are going to wait a long time anywhere in Chicago anyways due to the influx of tourists and people on summer break. Might as well escape the heat and stay indoors where there is air conditioning, relax in the most comfortable couches sipping on a fancy drink, and peruse the rooms full of artsy, photogenic furniture. <br><br>Initially just a furniture store, some genius had the greatest idea of integrating a fancy cafe to draw in more customers. They already had the aesthetics and furniture on hand. They just needed to get more people through their doors and reach more customers. What better way than with food and drinks! <br><br>Food and drinks are pretty reasonably priced. But if you think it's pretty expensive, you're basically paying a little extra for the vibe and interior design which are totally worth witnessing.", "pics": null}}, {"review": {"des": "Reviewing this as a cafe/hangout spot.<br><br>*** Workspace ***<br>The 3 Arts Cafe doubles as a furniture store, meaning there is a plethora of various seatings and seats strewn surrounding the main quad, in addition to the few seats in the room with the cafe bar. You can also sit in the outdoor section all the way at the top floor. Take note that there is no outlet here. But if you want to lounge around in beautiful furnitures accompanied by coffee, 3 Arts Cafe provides a space that allows you to leisurely work in a unique environment.<br><br>*** Coffee ***<br>Nothing to write home about, but they serve solid coffee with a wide selection of lattes. However, you can say that the taste of coffee is elevated when you're sipping surrounded by an instagrammable space.<br><br>*** Food ***<br>Whether you chose to be at the cafe or to sit down for a full meal, the food is quite pricey, not the most delicious nor with much options on the menu. However, I would still come by to check out the beautiful atelier and (if you're lucky) snag a seat right by the fountain underneath the skylight.", "pics": null}}, {"review": {"des": "This place is GORGEOUS! Amazing ambiance. The main dining room is brightly lit from sun pouring through the high glass ceiling and the room is adorned with plants and trees. There is a beautiful fountain in the center of room providing calming sounds as you enjoy your food. I've been here a few times and have tried a good variety of food and beverages.<br><br>Matcha Latte ($5): Not overly sweet with a nice balance matcha flavor. You can substitute with oat milk or almond milk for no additional cost.<br><br>Chai latte ($5): A bit sweeter than the matcha latte and comes in a smaller cup.<br><br>Delice de Bourgogne Cheese ($19): This was honestly a miss for me. For $19, I've gotten way better cheese boards with more variety and accompaniments. This came with one type of cheese (tasted like Brie) some strawberry jam, and a small loaf of bread.<br><br>Smoked Salmon Board ($25). This was super delicious, the salmon wasn't overly salted and the pickled onions were a great addition.<br><br>RH Scramble ($15): Easily the best scrambled eggs I've ever had. Extremely creamy and decadent. Wouldn't mind if it came with more pieces of toast.<br><br>RH Burger ($23): A pretty pricey burger that was definitely delicious but not sure if it was worth the heavy price tag. Fries were excellent.<br><br>Truffles Grilled Cheese ($18): Really small sandwich, truffle flavor was not prominent at all. <br><br>3 Arts doesn't take reservations, so be prepared to wait 1-2 hours on Saturdays and Sundays for brunch. You can grab a drink and browse the beautiful show rooms as you wait.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_G0s3JFrvhFP8bjcgTT1Hw/348s.jpg", "caption": "Smoked Salmon Board"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PXNNEOgkwvJa8PUHan87jQ/168s.jpg", "caption": "Matcha and Chai Lattes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Zy1T443-jH1nnGvAgBBMkw/168s.jpg", "caption": "RH Scramble"}]}}, {"review": {"des": "Very exceptional ambience. Limited menu but everything I've tried are very delicious though. The burger is highly recommended and their coffee too ( avoid this place on the weekends very busy and the waiting usually very long)", "pics": null}}, {"review": {"des": "This place is where style and food meet!  From walking in, this place gleamed with beautiful chandeliers. It definitely had wow factor and a really romantic vibe. There are 5 floors and each floor has many differently decorated rooms. My friends and I got there around 5pm and there was an hour and a half wait. It worked out that we could walk around and check out all the floors and joke about how many chandeliers we want in our house! Haha. While it's beautiful everything has a high price tag so it's not where I would go to get my furniture. However, it is a nice place to get ideas and inspiration.<br><br>The room where we ate was beautiful as well and it felt like I was eating at an outdoor Parisian cafe. The menu is pretty small but there were some good (but moderately priced) items on it ranging from $16 to $28. The platters did come with fries or side salad. It was a little annoying that no one came for us for about 20 min after we sat down and we were all hungry. However the food came out quickly. Portions we're small but we left somewhat satisfied with what we got. Overall a very nice place to check out if your in the city and want to just grab a drink with friends and hangout. I would recommend getting dinner elsewhere though.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bSOqDXmh88WcXUUXdm_YpQ/168s.jpg", "caption": "The dining area is so beautiful! Chandeliers everywhere!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gmWP332GU-cXFL-EL9XlMA/168s.jpg", "caption": "Lobster roll"}]}}, {"review": {"des": "Definitely a one of a kind experience here. The most interesting aspect of this place is that it is a cafe located inside Restoration Hardware. The decor of it is impeccable and feels like it is straight out of a movie. We sat in the wine vault area. Super casual and super cozy.<br><br>Food's a little on the pricier side but it's definitely fresh. We ordered the burrata and burgers. Neither dishes disappointed us. After we ate, we walked off our food baby around the store.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PzyCZMrMmWBPjhSrCCzFIA/348s.jpg", "caption": "Wine vault seating"}]}}, {"review": {"des": "My friend took me here for the first time for my belated bday brunch. You walk in and feel like you're the queen/king. It took some time to get our seats, but you can walk around the place and take cute pics. Interior design of the place is absolutely luxurious. Super comfy couches. We ordered a glass of wine+latte at the bar while waiting for our seats. We did not get the main seating area by the fountain, but the view of where we sat was still pretty gorgeous! I got the lobster roll which came with fries and garlic dipping sauce. Goodness. It was amazing!!! But it was definitely overpriced. You definitely pay extra for the vibe. But would I go there again? Yes! I'd definitely love to go for a date with my future bf.", "pics": null}}, {"review": {"des": "Amazing ambiance and decor, but the food is honestly mediocre!<br><br>I've​ been here a number of times- and I've​ got to say that the reason I keep returning is due to the cafe's rustic yet modern ambiance. It's​ the perfect place to have a cappuccino​ with a friend you haven't​ seen in forever or to simply take some pictures since the decor is aesthetically​ pleasing.<br><br>I think its a bit overrated​ though as the food isn't​ that great! Honestly, for the price you're​ paying for the truffle grilled cheese (which is actually truffle butter) or even a simple salad- I feel like you would get more bang for your buck at another restaurant​! Simply put, its a cafe so I wouldn't​ recommend coming here if you're looking to have dinner. The wait time for a table during the weekends sucks as well, as you end up waiting for more than an hour for a table. <br><br>Overall, this is still definitely​ one of my go-to spots when I'm​ looking to sit back and relax with some friends over some coffee and pastries! I would definitely​ try the cookies here as well, which are to die for! They have the perfect blend of sweetness with a hint of sea salt! So good.", "pics": null}}, {"review": {"des": "Gorgeous! Loved drinking and eating in this indoor garden at restoration hardware. I stayed at the ambassador which made it quite a convenient stop. I imagine Gold Coast locals love it.<br><br>Tips:<br>The kale salad was huge and delicious with chicken. Lobster and salmon are also available. <br><br>The wait can be 30 minutes", "pics": null}}, {"review": {"des": "Stunning and iconic place, looks like it came straight out of a magazine! Amazing atmosphere and elegant astheticly pleaseing decor will make you want to come back again. The wait time was pretty quick even though I came here with a group of 6 for brunch. I didn't have high expectations for the overall taste of the food, but to my surprise it was actually pretty damn good. What everyone knows is that beautiful places like these usually have either mediocre food or horrible food...this place had some damn good dishes(at least what I ordered). I can't judge the food that I didn't try, but what I had was WOW!!! I had the lobster roll, and the salmon platter, which were done to perfection. You could tell that the food was genuinely fresh!!! The only thing I didn't like was how overpriced the food was. Overall would I come back? Hell yeah! When? Very soon!", "pics": null}}, {"review": {"des": "A fun place for a Sunday brunch, including larger groups.  When we got there, an hour wait.  Got a couple of drinks and hit the rooftop.  The service was spot on, decor very inviting and relaxing.<br><br>We got the Délice De Bourgogne Cheese with <br>fruit preserves and warm baguette.  Definitely get this.  The cheese was rich and soft. Just melted in your mouth.  The preserve was flavorful. The bread was delicious.  We took an extra one home.<br><br>The smoked salmon came with some buttered toast and cream cheese.  Very good.  Nothing particularly special about it, but it delivers what one would expect. <br><br>I do wish they would expand on their dessert menu. We looked at it, was lacking in options.  <br><br>The only item I cannot recommend was the vegetables and dips. Hummus was good, but did not make up for the other two.  The avacado dip was too creamy.   The third one which I thought was a curried mustard but not sure.  Needless to say its taste was rather overpowering instead of complimentary.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qVr2h_kR54BbJqMPS_M-Qg/168s.jpg", "caption": "Vegetables with dips.  I would pass on this"}]}}, {"review": {"des": "Once you step foot in 3 Arts you'll feel transported into a home decor magazine and forget all about Chicago! So unique. So beautiful. Who would have the genius idea to create a restaurant inside a high end furniture store?! The answer- Hogsalt! The idea not only works, it soars with flying colors! <br><br>Until the hype dies down, or if you're dining on a weekday, it's pertinent to know the wait is long! I arrived at opening, at 10 am, and there was already a huge line. By the time I made it to the host stand, they were full and it only increases as the morning goes on. It was a 1hr wait for the atrium. Moral of the story, arrive at 9:30 am to be first seated on a Saturday morning! <br><br>As fancy as the ambiance is, the menu items are far from it. Nothing out of the ordinary. Fancy decor for a fancy priced meal. However, everything is super tasty! We ordered: <br>RH Burger- Au Cheval Burger basically so you already know it's good! <br><br>Bacon- you can't have an Au Cheval burger without the bacon. It's a must. <br><br>Grilled Cheese- probably one of the best grilled cheeses in Chicago!  <br><br>Salmon Platter- simple & good but not outstanding. Comes with toast instead of a bagel. <br><br>Salted Chocolate Chip Cookies- forget regular chocolate chips, there's a layer of sheet chocolate inside that makes every bite incredible! <br><br>Service had a hiccup but nothing to complain about. We ordered drinks at the walk up counter and they forgot about mine. Probably bc my best friend & I share the same first name & ordered the same thing so maybe they thought it was written down twice?! None the less, the barista brought us a complimentary round! Thanks! <br><br>While waiting def check out all 5 floors of furniture on display! You'll wish you had a bedroom like these! Be sure not to miss the 5th floor which is the garden floor, especially during summer bc there's a rooftop patio! <br><br>You'll have a blast browsing all the merch & find every nook & cranny is  ideal for photo opps with your friends! Customers are not shy about imbibing with drink in hand around the store! Funny! My only question is how do the furniture sales reps concentrate on their laptops and work in such a lively environment???! Lol I saw a few workers and my mind was boggled! Defiantly going to recommend 3 Arts to everyone! Dope spot!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GMtFLGB8QTxD92P59Fxy_A/348s.jpg", "caption": "If you give this Mouse a cookie, she'll raise you a mimosa!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0xzd2XQBOglyONONGhTTdg/168s.jpg", "caption": "A Hogsalt type of weekend."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/r5PggwM7YogxEoknNyRCQg/168s.jpg", "caption": "Burger w/ side Salad. Heaven!"}]}}, {"review": {"des": "I really like this space.  I really, really liked the food.  I think the hour long (or more) wait is a bit silly, even during off times.  I think the $23 price tag on a tasty burger is a bit too much as well.  However, let's say price isn't an issue.  You should walk in and immediately put your name in.  Keep walking straight back after that to go to the bar.  The still and sparkling roses are good, and our group enjoyed peach bellinis, too.  We started up on the top floor and hung out in some beautiful spaces.  (You can walk around the store with your drinks!) Our table ended up being ready earlier than anticipated, so we headed back down to the cafe.  <br><br>They have a lovely fountain in the middle of the cafe, which sounds so nice.  It really feels like a garden.  They were busy, of course, so it took a little while to get our order placed, but by then we already knew what we wanted for food.  We all had the burger and it was probably top 3 of what I've had in Chicago.  They're two small patties (yay) instead of one giant hunk of meat.  They dress it up with lots of tasty regulars (lettuce, tomatoes, onions, cheddar, etc.).  The fries are fantastic and the garlic aioli is out of this world!  If you've been to Au Cheval, I heard they're affiliated - so the burger quality makes sense.  We enjoyed our late lunch and looking at all of the beautiful furniture.", "pics": null}}, {"review": {"des": "I normally expect beautiful places to have bad food. But 3 Arts Club Cafe was more than deserving of their prices, and their food was almost better than their decor!<br><br>Obviously, the inside is beautiful. It's located inside Restoration Hardware in the most unassuming area of the city. And yes, be prepared to wait. My friend and I arrived shortly before they opened for the day, and the line was already down the street. I can't even imagine coming here at lunchtime! But the food was what really impressed me. Their arugula salad was easily in the top 10 meals I've ever had, and I don't even like salad. The portions are big too, so I ended up taking more than half home! Not knowing the portion sizes, I also ordered a side of fries, and the seasoning and aioli on the side were perfection. I had such mixed feelings because everything was so good, yet it was way too much to eat!<br><br>So yes, come here for the Instagram photo. It's a gorgeous spot to catch up with friends! But also come here for the food, because it's really really darn good.", "pics": null}}, {"review": {"des": "Nice atmosphere, food is good...but not like outstandingly good that you can't find elsewhere in the city...service is to be desired, that's the reason i gave it a 2 star...<br><br>I felt like the servers had these stuck-up attitude for no reasons both times i visited with family. That's fine...I supposed...this is a seen-and-to-be-seen place...<br><br>What frustrated me to leave a review here is that we arrived with my 1-year-old, put down our name on the wait-list, specifying that we needed a high chair. When we got called, and obviously, i was carrying my daughter, and I confirmed for a high chair to be prepared as we were at the host stand so that I could feed my daughter as soon as we got seated...since the wait was so long that it went past her meal time and she was patient and hadn't got cranky yet...<br>Then when we got seated at the table, I still had to request for the high chair 2 more times before a high chair finally turned up...<br><br>Water service is literally upon request....almost like it's on ration...as if they were worried that you would just fill up on water and not order anything....", "pics": null}}, {"review": {"des": "What an excellent display of Bredan Sodikoff/Hogsalt's versatility.  I mean, this place is pretty much the antithesis of Au Cheval (also awesome, but for very different reasons). Job well done.<br><br>What you'll find here is a pretty immaculate atrium/dining area (just gorgeous), deeply rich, bold and memorable espresso, a carrot dish so good you'll wish you were served them this way growing up, decadent Truffled Grilled Cheese, Doughnut Vault doughnuts, excellent service, and one of the comfiest and largest waiting area couches you may ever come across (courtesy of Restoration Hardware - RH). Need I say more?<br><br>I'l add this, after coming here twice already, I strongly suggest booking in advance, coming early, or plan on waiting for a table. If you do have to wait, you can grab a drink and/or doughnut from their Pantry. There's also plenty to see and explore within RH or just sit back in the waiting area and fall in love with their couches.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/h_E5dXuPllUGXOwmo4_zMA/348s.jpg", "caption": "Roasted Carrots"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yvi40OXEqZNCgIEfhuuY-w/168s.jpg", "caption": "Truffled Grilled Cheese"}]}}, {"review": {"des": "The aesthetic is amazing! I love the coffee bar. You need to go to their rooftop it is a secret hidden gem of restoration hardware. I was impressed from how quick their coffee bar", "pics": null}}, {"review": {"des": "Very beautiful and nice atmosphere at this Cafe) we didn't make any reservation and we forgot it was Saturday , so we had to wait for the table. Meanwhile, we drink some coffee and after they send us the message that our table is ready. Food was delicious, must try the smoked salmon plate.. I do recommend this place", "pics": null}}, {"review": {"des": "The ambience of this place is whimsical and amazing! Such a hidden gem, the only disappointing part is that I didn't know of this place sooner! Would be great for a bridal event, romantic date, or girls date. :) Food is pricey but delicious.", "pics": null}}, {"review": {"des": "Such a beautiful iconic place, and the food and service live up to the beauty too. We were treated so nicely and promptly. I got a glass of rose to sip with my meal.<br><br>We ordered the burrata right away, and this was delicious. The bread was perfectly soft too. The burger was super tasty with a nice aioli type sauce, and the fries were scrumptious too. We also go the fish, which was a rainbow trout. This was tasty and light. <br><br>Overall, I'm so glad I finally got to eat here, and though it wasn't brunch, it was still delicious!", "pics": null}}, {"review": {"des": "Seriously I could spend all day inside - six floors of dramatic art installations & never-before-seen luxury home furnishings.  <br><br>Pros: <br>Beautiful venue <br>Wait service excellent <br>Cleanliness <br>Great selection on teas and decent menu. <br><br>Con: <br>Wait time (expected regardless the day or time) <br>Hostess attitude - seriously I just don't understand people who are placed to greet paying customers at your establishment they should shine and give off positives vibes! Leave that rude shit at McDonald's.<br><br>Overall I recommend checking it out just once it's truly an awesome place!", "pics": null}}, {"review": {"des": "Worth the wait, worth the price! Restoration hardware is beautiful and so is this restaurant inside! Probably one of the coolest looking restaurants I've been to. I love all of the chandeliers and the fountain. Plus it's bright in there with the window ceiling! <br>Service was great, didn't take too long and they were attentive. The food was fantastic! I got a burratta plate and it was fresh and flavorful! The tomatoes with it were delicious. We also got fries to share, perfectly crisp! My sister shared a piece of Texas toast with me from her meal and it was yummy too. Everyone was very happy with their food. Totally hope I can come back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/E0szsUWhTzsyjNbm6Zzi7w/348s.jpg", "caption": "Burratta!"}]}}, {"review": {"des": "3 Arts Cafe is a beautiful space with friendly service and delicious food. The coffee is made just right and there are couches & chairs everywhere, making this an awesome space to get work done.<br><br>The entire menu is crafted by, Brendan Sodikoff, the chef behind Au Cheval. Yes, the burger is nearly identical. Leaving off the elusive fifth star because the menu is quite limited. ..then again 3AC is technically a cafe so perhaps I'm being too hard on em.<br><br>Great place for a first date, studying or gathering with friends. I highly recommend stopping in and giving them a try.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wvhxSsEvDnsXhH7_njFPhQ/348s.jpg", "caption": "House-made Chocolate Chip Cookies - Served Warm"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4FZUp0S5xPkMaQE0vprvmQ/168s.jpg", "caption": "RH Burger - Sharp American, Pickle, Onion, Dijonnaise, Lettuce and Pickle."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9FAiiOVwkqFaWBb6O96QNA/168s.jpg", "caption": "RH Burger - Sharp American, Pickle, Onion, Dijonnaise, Lettuce and Pickle. Fries served with roasted garlic aioli."}]}}, {"review": {"des": "Looks like I have a new favorite place in Chicago, I been here two times and I can't wait to go back. This place is BEAUTIFUL, decoration is classy and relaxing. One of a kind. <br><br>**FOOD: I highly recommend the RH Scramble with soft eggs, it was the best scrambles I have ever had. So rich in flavors and the Texas toast was to die for. My friend had the Shaved Prime Rib French Dip and she loved it. Even the French fries are amazing. The chocolate chip cookies are good if you have a sweet tooth (not my favorite). The sorbet is a must. <br>**DRINK: I highly recommend the mimosas (strong but very good), the Bellini is very good too. We also had; chai latte and a cappuccino. <br><br>Pros: big portions, amazing service, and unforgettable food. <br>Cons: I wish they were open early. <br><br>I HIGHLY recommend this place. You won't regret it. Perfect for a date or even brunch with friends.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8OaL0pAwlR44CiVmSrN8Xg/348s.jpg", "caption": "Chocolate chip cookie, vanilla ice cream, and chai latte"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WTF-YERDelfpsOyM_w-2lA/168s.jpg", "caption": "Sorbet and cappuccino"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bc47EIuhNfNdXcbTpdFPHQ/168s.jpg", "caption": "Beautiful inside"}]}}, {"review": {"des": "3ACC has just become one of my favorite restaurants in Chicago. Food was excellent but what pushes this place over the top is the atmosphere. Sunlight penetrates the glass ceiling to fill the room. The European stone fountain glistens in the heart of the atrium as you hear trickling water complementing the chatter amongst good friends. Large trees add a splash of natural green to the surrounding brick walls. Crystal chandeliers adorned with hundreds of lights make you wonder whether this is all a dream... That's certainly what I thought when I first saw photos on Yelp, but I can tell you that it's all very real.<br><br>We ordered the Artisanal Prosciutto to start, complete with parmesan cheese, grapes, and a small, warm baguette - a perfect combination. My main dish was the Truffled Grilled Cheese, also delicious despite some areas being a little more burnt than I personally prefer. The fries and garlic aioli couldn't be better though.<br><br>As for the wait, it's a popular spot so expect a long one. We came at 12:30ish on a Sunday (prime brunch/lunch hours) and waited about an hour and a half. It was significantly emptier when we were done at 3 if you're willing to come at off hours. While we waited, we wandered around all the beautiful rooms of Restoration Hardware. Make sure to get a view of the cafe from the second floor and check out the chill seating area and garden on the top floor. A lot of people also grab drinks from the bar and lounge around on one of the many chairs/couches throughout the building.<br><br>Protip: arrive about half an hour before they open to guarantee a shorter wait!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wkZViln2HHgZIVHpfjOl3A/348s.jpg", "caption": "RH Scramble"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/66Cxz-mTloy8Jmm3dSGMEg/168s.jpg", "caption": "Turkey Club"}]}}, {"review": {"des": "If you're visiting downtown and looking for a picturesque urban escape, make a visit to 3 Arts Club. It's a restaurant that also serves as an urban oasis; blending nature with modern elegance. Make sure to bring a camera because the interior is gorgeous. 3 Arts club is nestled within Restoration Hardware (RH). Enter from the RH entrance then make a left to the hostess table for seating.  <br><br>I was accompanied by a friend for a weekend lunch around 3pm and we placed ourselves in queue for a table. Our hostess then gave us a buzzer and told us our wait time would be approximately 50 minutes. It would've been convenient to make a reservation prior to our visit but I was told they only accept walk-ins. <br><br>Despite the lengthy wait, we decided to stay. We had traveled a ways to get here and canceling plans would be a fruitless disappointment. Plus, I had my heart set on visiting this place, so we were going to wait. During our wait, we wandered around the cavernous 4 story confines of Restoration Hardware.  I will post a separate review for the store at a later date as this review solely focuses on the 3 Arts Club experience.<br><br>Once our table opened up, the hostess led us into the restaurant. As I stepped foot into the restaurant, two words came to mind, exquisite and stunning.<br><br>The first thing you'll notice from above is the chandelier. The brilliant crystal tiers hung from the glass ceiling supported by steel beams. The natural light shining through the ceiling illuminated the space; contrasting the dark and dreary afternoon we experienced outdoors. Massive planters with live trees towering upwards toward the ceiling lined all 4 corners of the space giving it an earthy feel. Plush contemporary dining furniture complemented the look giving it a cozy vibe. Top it all with a patina fountain in the center and you've got the components for a beautiful event space.<br><br>This restaurant makes for a great meet-up spot and the ambiance is amazing; however the food leaves much to be desired. A burger and fries cost nearly $20 (which doesn't include your drink and tip.) Reflecting back on my meal, I wasn't over the moon with it. My burger patty was thick, bland, and dry. It was a far cry from burgers I've had elsewhere and I'll never order this again. In fact, I've had better hot dogs (and didn't have to wait an hour) coming out of a Home Depot compared to the standard casual fare offered here. <br><br>In addition to my subpar lunch, I can't say much for our server either. I could see she was obviously overwhelmed by the tables she had. At the end of our meal, when I wanted to split our check, she didn't like the idea and her displeasure showed in her body language. The minute I requested a split check, I was met with an eye roll and a no. That didn't sit right with me at all. A split check is a common ask and at a place where a subpar burger and fries cost over $20, such a simple thing should be automatic. It's bad enough the burger was a disappointment but I didn't need it served with a side of attitude. <br><br>It's pretty obvious by the clientele that the dress code commands a step above casual. It isn't necessary to be dressed in cocktail attire but I did see a couple or two dressed like that here. I had to chuckle a bit for their pretentiousness but when in Rome... <br><br>Overall, I thought it was a beautiful space but it was nothing more than that. Unless you live near the area or are staying in a nearby hotel, expect your commute to be terrible.  It will cost an extra $15ish for valet if you drive in. The Gold Coast area is prime real estate and because of it, parking is a nightmare. For the budget conscious, your best bet is to take public transport. Go for the ambiance but other than that, this visit is a one and done.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IEAul-euUTYkFj8KwxVyog/168s.jpg", "caption": "A stunningly beautiful space."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fhi6lDL9gjAweqUQ5tgsbA/168s.jpg", "caption": "View of 3 Arts Club from the 2nd floor window of Restoration Hardware (RH)."}]}}, {"review": {"des": "3 Arts Club Cafe is located inside Restoration Home, which is a great excuse to eat and look at nice furniture after! The atmosphere is an A+, it's quiet, beautiful, but I did not like that I was very far away from the people on the opposite side because the table was that wide. They don't get a full 5 stars because the food was very expensive for things I can get elsewhere, i.e. salad, burger, grilled cheese (which doesn't come with tomato soup, nor do they make tomato soup...how do you eat there grilled cheese then?? Plain! How disappointing!) My prime rib sandwich was delicious nonetheless and their juices were amazing. I would have to be in the mood to come to this place again. Only a very once in a while place to go.", "pics": null}}, {"review": {"des": "Although very pretty, it was slightly overrated. <br><br>The ambiance and service was great. There's a very simplistic yet elegant style to the cafe. Glass chandeliers and plants all around. The service was also great. The waitstaff was always attentive and filling water on time.<br><br>What I wasn't a fan of was the food. There weren't that many menu options. The food wasn't bad but wasn't out of the world. I got the scramble, which was literally the best option for breakfast unless I wanted just jam and toast. I loved their iced coffee though.<br><br>Overall, I would come here to do it one time and get a feel of the cool vibes, but don't except to be wowed by the food. <br><br>Tip: If you don't want to wait in a crazy line, come at 9:30am to start lining up. It opens at 10 but the line starts growing at 9:45. I was able to be seated first since I was first in line.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4LuMWR_jIuqXov6nneIadA/348s.jpg", "caption": "RH Scramble"}]}}, {"review": {"des": "UPDATE: <br><br>Came back for dinner on a Friday night with a friend and had a MUCH better experience. There was much less of a wait and the atmosphere seemed very relaxed, rather than frantic. Our server, Anthony, was incredible! He was perfect- funny, attentive, and just overall wonderful. The food for dinner was better than brunch. I got the French dip and my friend got the garlic roasted chicken. While both were very tasty, I still think it was a bit overpriced. However, when you factor in the atmosphere, the price makes sense. <br><br>Overall, this is a fantastic place for a special occasion. Take my word for it and go for lunch/dinner instead of weekend brunch. You'll get a much better experience!<br><br>No thanks. This is clearly a gimmick restaurant that relies on the fact that people wait in line so long to get in to continue to get people in. <br><br>This is a GORGEOUS restaurant. Absolutely beautiful atmosphere, both in the atrium and adjoining \"wine bar\". I can see why this was on my friend's list of \"must go\" atmosphere restaurants in Chicago. However, this is a rip-off tourist/gimmick trap that is a nightmare on all counts that don't involve the beautiful atrium. <br><br>They do not take reservations. So my friend and I got in line at 10:45 in the massive line for opening at 11. We got to the host stand at 11:15 and we're sat at 11:45. The seating is comfy. The service is sub-standard for the prices they are charging. Everyone who came to our table was CLEARLY inexperienced in the service industry and I am shocked that a high end restaurant had service like this. We barely saw our server and she was awkward at best. <br><br>Now let's talk about how these people want to charge completely ridiculous prices for mediocre at best food. My friend ordered a side of fruit- which had halved grapes, bananas, and a couple pieces of cantaloupe for $6. I ordered a \"ham and cheese\" croissant which had about one ounce of ham and if it had cheese I couldn't taste it for another $6. I did not like it. We split a side of bacon- $10, and this one was good. 4 thick slices of well seasoned bacon. <br><br>The people around us ordered more robust meals, and it was clear that their French fries ($8 for a side) are nothing special. <br><br>So maybe come and visit the pretty interior and then walk out. The service was mediocre at best, the food was not at all worth the price. This is clearly a gimmick and there are a billion great brunch places nearby that won't cost you a months worth of rent to eat at, and will taste way better", "pics": null}}, {"review": {"des": "I had brunch here with my girlfriends. The space is amazing.  As we waited for our table (60 min they don't take  reservations) we were able to check out the restoration hardware furniture which the restaurant is conveniently located in the same space. The pieces were so beautiful. Made the wait worth it. We had the scrambled eggs and green salad. The Bacon was my favorite. Service was great. I would definitely go back for the ambiance & to check out the furniture.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bx4F25xmVi-A-J6nS5JEUw/348s.jpg", "caption": "Brunch with my girls."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/W1QJyCiiEaIZ9PCju3pLgQ/168s.jpg", "caption": "beautiful space & furniture."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/49AQ93Ch3nn5sDaZwerTaw/168s.jpg", "caption": "I fell in love with these stones."}]}}, {"review": {"des": "5 stars for the ambiance, 3 stars for the price point and food. Evens out to a solid 4. Such an incredibly beautiful space to meet friends for a bite to eat or grab drinks! Located within Restoration Hardware, 3 Arts Cafe is a dreamy escape from chilly Chicago weather. The glass roof makes for great lighting even on gloomy days, like the day I came by!<br><br>I had the arugula salad and shared fries with my friend. Both were yummy, but honestly most of the things on the menu are probably too pricey for what the are and not worth the cost. Wish I'd had more time to come by to try brunch! If I'm ever in Chicago again, I'll definitely come again just because it's so damn pretty here!", "pics": null}}, {"review": {"des": "The ambiance is \"sit in a furniture store and chill\" with lots of people around.  I was pretty shocked at the prices ($18 for 4, yes FOUR slices of prosciutto) and expensive glasses of wine to accompany them.  I will say, however, that the snacks were tasty with crusty, tasty bread and fresh burrata and delicious soft cheese.  I'd go back just for the overpriced meat and cheese plates!", "pics": null}}, {"review": {"des": "Gorgeous place with great food! There is always a long wait to get a table but its totally worth the wait. This is a perfect place for first dates or catching up with a group of friends or for long conversations with someone etc... when you're done eating, be sure to go upstairs and check out the restoration hardware store! You'll love it!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KB9rs3ndvCQwzHpg30q-4g/348s.jpg", "caption": "Hummus platter!!"}]}}, {"review": {"des": "The most glam lunch experience I've ever had. <br><br>I saw a picture of this gorgeous place on Instagram and have been drooling over it ever since. The building is located in the fancy Gold Coast neighborhood of Chicago. The building itself used to be a women's arts club that was built in the early 1900's. When you walk into the architecture of the building feels so timeless and elegant, from the chandeliers, to the marble tables, and fountains, everything is so 'IG worthy'. I arrived right when they opened and was seated right away. I ordered the lobster roll (delicious) and enjoyed taking in the ambiance of such a beautiful space. After lunch I walked around to the different showrooms and daydreamed on all that is Restoration Hardware #HouseGoals then proceeded up to their rooftop garden. Such a memorable place and I can't wait to visit again when I'm back in Chicago!", "pics": null}}, {"review": {"des": "The best time to come here is on a weekday morning. My friends and I came here on a Thursday and had a lovely brunch. Well actually we all ended up ordering the burger because it sounded so good...and it was! Definitely can give Au Chevalier a run for its money.<br><br>The ambience is what makes this place. You feel like you're eating outdoors or that you're in a greenhouse. It is very beautifully decorated. Service is pretty good too. <br><br>Overall a very scenic place to eat and you must get the burger!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ihIfsJxH42-4quT7r26dnA/348s.jpg", "caption": "Burger with fries"}]}}, {"review": {"des": "Wow- this lunch was the highlight of my trip to Chicago. I am currently eating a ketogenic Diet, and they were VERY accommodating. I had a bun less burger with a side of garlic aioli and kale Caesar salad. We sat in the middle of the atrium, the ambiance is AMAZING. While we waited for our table, we explored the building.", "pics": null}}, {"review": {"des": "Seriously what is there not to like.<br><br>Awesome atmosphere <br><br>Simple menu<br><br>Amazing decor<br><br>Food is delicious and very well executed. <br><br>It would have been 5 stars but the sever was a bit slow and overwhelmed.<br><br>You have to visit", "pics": null}}, {"review": {"des": "I have wanted to go to 3 Arts Club Cafe located inside of Restoration Hardware for a while now. The few times I have tried, the wait time was over a two hours. Finally, my boyfriend suggested that we go on a weekday around lunch. Fortunately, NO WAIT TIME!<br><br>The food is inspired by Northern California and Mediterranean cuisine and the courtyard seating is beautifully filled with natural sunlight and olive trees. We started the morning off with some flavored ice coffee on draft along with a late brunch. There were so many amazing options on the menu but of course I picked the one that had truffle and cheese: truffle grilled cheese sandwich on sourdough bread served with fries and garlic aïoli. My boyfriend, on the other hand, chose the breakfast route and ordered the RH scramble: farm eggs, crème frâiche, avocado, chives, Texas toast.<br><br>After our wonderful brunch we decided to continue enjoying our day and ordered a bottle of wine. We got a bottle of Riesling: Leitz, Rheingau, Germany, 2016. 3 Arts Club Cafe isn't only a wonderful brunch spot, but it is also a great spot for drinks.<br><br>We had already been at 3 Arts Club Cafe for a few hours are this point, and decided to spend the rest of the afternoon on the rooftop since the weather was beautiful. On our way to the rooftop we stopped and got another draft iced coffee and doughnut. They have doughnuts from Doughnut Vault, which were DELICIOUS! Definitely have to go and try all their flavors soon!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YYngeataQDkqrL-VBGkjfA/348s.jpg", "caption": "Nothing like a coconut donut and iced coffee on a warm spring day"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MFpT8g_rrY641zLzjwFsIA/168s.jpg", "caption": "RH scramble"}]}}, {"review": {"des": "Extremely beautiful cafe with tasty brunch! <br><br>The cafe sits inside of restoration hardware furniture store. There is no doubt that the decor is one of the best I have ever seen! Comfortable couch, beautiful chandelier and greens.<br><br>We ordered smoked salmon and artisanal prosciutto to start with. The smoked salmon came with warm toast and it was great! Among the main dishes we got, the lobster roll was the best. Fresh and creamy.<br><br>The highlight of the meal was the RH Banana split. It came with different sprinkles!<br><br>The waiting was extremely painful. They opened at 11:00 AM on Sunday and we arrived at 10:50 AM. It took us 1.5 hours to get a table (they do not take reservations).", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rFB799jq5x-4kngx3YhG_A/348s.jpg", "caption": "Banana Split"}]}}, {"review": {"des": "Went with a friend mostly to explore the atmosphere. We planned on dining however there was an hour wait for parties of two by the time we arrived at 2pm. <br><br>We grabbed two caramel lattes, one with skim the other with soy. We also bought one chocolate chip cookie. Our total was $16. Pricey but both of us agreed that they were the best lattes we'd ever had. We traveled around the floors, the staff was kind somewhat. One of the older men kept following us around as if we were up to something. He was a little agest but thats fine. <br><br>First floor was super crowded, I recommend checking out the rooftop garden instead. Nice place, but slightly overpriced. This place is more about the look and culture than the food.", "pics": null}}, {"review": {"des": "This place is a true beauty. Unfortunately, we didn't get to try their food. We did, however, ordered a bottle of wine. With our glasses of wine, we explored the place and the furniture and art stores upstairs. We also got to sit wherever we wanted. There were comfy couches everywhere. It was a fun experience. I cannot wait to come back and try their food!", "pics": null}}, {"review": {"des": "I had such a hard time figuring out where the cafe was located just to find out it was located inside Restoration Hardware! The moment I stepped in I was immediately in awe; it was interior design heaven; a glorified IKEA! The wait to eat inside was roughly at least 30 minutes but it makes you wish the wait was longer as you venture off to the beautiful room displays on each floor. The food itself was top notch with the environment of the cafe making it so elegant.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Rqt6lX54QH7JhH3Nvvto4w/168s.jpg", "caption": "This could've easily been a ballroom"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gNGsMpH8PMiOrrZD-SJ9jg/168s.jpg", "caption": "Had grilled cheese and lobster roll"}]}}, {"review": {"des": "Built in 1914, the Three Arts Club of Chicago was a Chicago home and club for women in the \"three arts\" of music, painting and drama. (Thanks Wikipedia!) The building is a landmark and a flagship showcase for Restoration Hardware, the inside is incredibly well-appointed and I believe RH uses the venue to build brand affinity rather than actually sell any true volume of products. The Atrium and and the Rooftop (on a sunny) day are fantastic. There's a cafe where you can order wine to take up to the Rooftop while you wait for your table in the Atrium. (that's a serving suggestion...) The food was extremely good and worth the wait. I have to say I would not have gone here were it not so strongly recommended and I agree. If you have the time, it is well worth it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eAobqkT8LlpoCctKGNoP7A/168s.jpg", "caption": "The Atrium"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kw3spW9Q7HEHFmZN0lMRhg/168s.jpg", "caption": "One of the showrooms (on Floors 2 - 4) the rooftop garden is on the 5th Floor"}]}}, {"review": {"des": "What a unique concept to have a restaurant inside a furniture store. But hey...it works and it works really well! This restaurant is situated inside the restoration hardware furniture store. It's beautiful inside the restaurant. There is natural light that comes in - the ceiling is all glass.  There are a mix of sofas and chairs inside which make the ambiance more inviting. <br>Be ready for a wait. We heard on the weekends the line goes outside the building. We went on a Monday and there was still about a 45 minute wait. <br>The grilled cheese is excellent but it is a bit heavy. It was all I had all day except for a light late dinner. <br>The burrata and tomatoes were also excellent. The tomatoes were roasted and so so sweet.  The burrata was imported from Europe.  The bread was excellent as well.  It was perfectly toasted and substantial.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gtuoOdPvOEoz6cDbNH78jA/348s.jpg", "caption": "Lovely ambiance"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UBpp1UHlArsw2QbndvheWQ/168s.jpg", "caption": "Burrata with amazing olive oil and roasted tomatoes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/95h-nMed0fxGGCyvohj2Hg/168s.jpg", "caption": "Truffled grilled cheese on sourdough"}]}}, {"review": {"des": "I'm a big fan of 3 Arts Club Cafe. The service, food and atmosphere are all excellent reasons for making this Golf Coast neighborhood gem a destination everyone must experience. When you are done with you dining experience...be sure to explore the multiple floors of Restoration Hardware home interiors and furnishings showcased through this refurbished historical building. That's right...there a wonderful history to this remarkable space....not that you needed another reason to drop in to the 3 Arts Club. <br><br>Go on...go explore. Enjoy!", "pics": null}}, {"review": {"des": "Unique restaurant spot that is nestled within a furniture store.  The waits are long but it is not too bad when you have some time, and walk around to shop or get decor ideas.  We came here on a Saturday and the place was packed.  We grabbed a few drinks at the bar and walked around the store for a few hours before our table was ready.<br><br>The service was good and friendly.  We ordered a few items to share and had cocktails.  The grilled cheese was surprisingly good, and was well complimented with the garlic aioli fries.  If you don't have time or patience, this is not the place for you.  The decor of the restaurant is beautiful!", "pics": null}}, {"review": {"des": "I wish I could give more stars but alas, I am stuck at 5. This restaurant serves the best at an affordable price.<br><br>The decor is beautiful and makes one feel as if one is dining in a posh country club outside with lots of natural light coming in from the skylight. <br><br>The food is superb with each dish a culinary delight. I highly, highly recommend the burrata and the lobster roll. <br><br>The only down for this place is that the wait can be long unless you are one the first people in line as soon as it opens. Any other time, it could be an hour plus wait which you could spend looking at all the amazing furniture of the place.", "pics": null}}, {"review": {"des": "My group consisted of 6 people and we waited in line 1 1/2 hours before it opened on a Sunday. We were second in line and it was well worth the wait. When it started getting close to 11am, the line was wrapped around the corner of the building. <br><br>There's street parking around the area and they've valet service which was $12.  <br><br>The place is very beautiful! It was very clean and the staff were very welcoming when they opened. <br><br>I ordered the truffled grilled cheese with fries. The grilled cheese was amazing and had great flavors. The fries were great as well. My cousins ordered lobster rolls and it looked amazing! We all enjoyed our food had no problems.<br><br>I would def come back here and i suggest everyone to try this place out.", "pics": null}}, {"review": {"des": "This place is one of the prettiest restaurants in Chicago. The interior is beautiful, it's definitely a great fancy brunch place. Also a great place to take pictures, do photo shoots and just enjoy Chicago in the summer. <br><br>The food is good but I've only tried a couple of things on the menu. I've had their parfait which was good and eggs with avocado and toast. Which was all really good! Loved the atmosphere and the service. Hands down one of my fave summer places in Chicago. Would definitely go back! <br><br>The only thing I thought was weird was that when my friend who had a film camera was taking a picture of me, one of the hosts told her we can't take pictures in the indoor area which I thought I was weird and a little annoying.", "pics": null}}, {"review": {"des": "This is an absolutely charming hidden gem in Lincoln Park. It's definitely got an LP vibe, but it also feels like being transported to a chic Instagram lifestyle post. It's hidden inside the 'RH' which is code name for Restoration Hardware! Enjoy a beverage--adult and/or caffeinated--while shopping on the 5 floors of showrooms or while waiting 30 minutes for a table in the 3 Arts Club Cafe atrium. On nice days, the 5th floor is the patio furniture store and you can sit and sip outside. How neat!<br><br>On the menu try the Délice de Bourgogne triple creme cheese plate with delightfully roasted pecans and the Greek assyritiko white wine. Be transported out of Chicago!", "pics": null}}, {"review": {"des": "Beautiful atmosphere  especially if you like posting pictures on Instagram this is the right place for it. The waiting time to be seated is long, but you can exploer the other floors :) make sure you check the roof top It's very nice. We had to wait about 40-45 minutes for party of 2 and honestly it wasn't that bad because we were checking the other floors. <br>The food here is overpriced for what they serve you. Also doesn't have that many options for food! you should check the menu before you go because as I have said the place it's beautiful for pictures, but if you are not a fan of taking pictures and don't care about the atmosphere don't go there and waste your money. <br>I think it would be better to go there for a drink or for cappuccinos and cookies.", "pics": null}}, {"review": {"des": "I absolutely love the 3 Arts Club Cafe. I have never been to any place like this before. They have a restaurant that is in a courtyard of the building. It is an enclosed courtyard with a water fountain, trees, ivy climbing on the brick walls,  and marble tables. It is basically like being outdoors. <br><br>The restaurant was beautiful and a perfect place to take someone for a date or a small get together. They don't take reservations in advance so you have to wait to put your name on a list when you get there. They have a coffee shop in the building with plush white couches and large chandeliers hanging from the ceiling. <br><br>They don't have many food options,  it's mostly a place to get a glass of wine,  cookies or a cheese platter. We ordered some wine and had cookies. It was a great place, a bit pricey but I will definitely be coming back for the beautiful indoor experience.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kG4YOSWSdwCuptTJP3HXkA/348s.jpg", "caption": "Warm chocolate chip cookies"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/V1B5AiF_w4_kcIPNgkW-9A/168s.jpg", "caption": "Iced coffee from their coffee shop while we waited"}]}}, {"review": {"des": "Gorgeous space, great food and fantastic service! <br><br>I've been yearning to give this place a try for so long and I'm already looking forward to my next visit. <br><br>I went here on a Sunday with a group of 6. We got there really early to get a spot in line and I'm so glad we did! By the time it opened, the line was so long that they had to cut it off- forcing those at the end of the line to wait an extra hour or two. <br><br>The menu pretty simple and everything (food and drink) we tried was delicious! My favorites were the truffles grilled cheese and the smoked salmon board. Our server was great- he provided some recommendations, was attentive and very patient as well. <br><br>After brunch, we spent a good amount of time just wandering around restoration hardware, admiring the beautiful furniture and room designs on each floor. <br><br>5 stars, easily!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jHcboPqR2wOGZIy99YKMPQ/348s.jpg", "caption": "Burrata"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uGztqobgr9BmBFPvT3oAqw/168s.jpg", "caption": "Truffled grilled cheese- amazing!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tkHqReeLM7h4EZHuIOmHTQ/168s.jpg", "caption": "lobster roll"}]}}, {"review": {"des": "We stumbled upon this place while exploring the Gold Coast. Immediately upon walking in we were taken aback by the ambiance of this place. The food / service was also really good. <br><br>Would give it 5 out of 5 if they offered some type of soup (maybe a tomato bisque to go with the grilled cheese ).", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lbg2OQRRVYckeg3MLZlc0g/348s.jpg", "caption": "Don't think that Chicago dining only offers Deep dish pizza. This spot is a hidden gem. The service, ambiance, food, etc was spot on."}]}}, {"review": {"des": "INTERIOR DESIGN GOALS!! Absolutely gorgeous space with wonderful decor and ambiance. So much natural lighting and greenery mixed in with the architectural furniture - everything was on point - an Instagrammers dream. <br><br>The restaurant opened at 11am, but my friend got a place in line at 10:40am. There was already a huge line wrapping inside and outside the building, and we still ended up having to wait 15 minutes before being seated. Perhaps the weekdays aren't as busy.<br><br>Service was decent. Prices aren't super expensive either, for the bougieness level. I ordered the RH Scramble which comes with scrambled eggs (perfectly cooked), half an avocado (which you can use to make your own avo toast), and Texas toast (delicious but quite buttery and heavy after a while).<br><br>I would definitely come back if I'm in the area! Highly recommend - if not for the food, then at least come to feast your eyes on the building!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/51Vr2OhQHvLn6tNKNLYArA/168s.jpg", "caption": "Interior. So perfect."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FyXv1YpNzmcC8JJ-VcgkKg/168s.jpg", "caption": "RH Scramble // Toast & Jam"}]}}, {"review": {"des": "This place is absolutely stunning. I'll be honest and tell you that I came for the sole purpose of pictures. I did not have high expectations in regards to the food because pretty places tend not to have amazing food. <br><br>I ordered the RH Scramble with a side of bacon for a grand total of $22 pretax. I was pleasantly surprised to have nothing bad to say about the food itself! The flavors were all very good. The avocado was fresh, bread was good, eggs were cooked to my liking. The bacon was also the boujeeist bacon I have ever had! A very thick cut with amazing maple flavor. Was it worth $25+? Probably not but I felt like I was paying for the entire experience as a whole as opposed to just the food. <br><br>Things to note: this place does not take reservations so if you come on a busier day (i.e. the weekends), be prepared to wait at least an hour before being seated. This is normally not a problem because it gives you ample time to explore the rest of the building (which is a must!). So many great Insta opportunities! Definitely a Chicago gem!", "pics": null}}, {"review": {"des": "By far one of my favorite cafes. Whilst waiting for our table, we sipped on wine and ventured throughout the magnificently designed rooms. I smell a large furniture purchase in my future. <br><br>We were notified via text when our table was ready. To our luck, we sat at a table next to two famous athletes, of whom I will not name... the husband plays futbol and wife plays tennis. <br><br>The staff is attentive and friendly! A plus for any dining experience. <br><br>We ordered tea service, earl grey and English breakfast and it was impeccable. I love me a good cup of tea.<br><br>For starters, we shared the smoked salmon platter. Divine. A MUST-GET ITEM. We had the lobster roll, which came with chips. It was average to my liking. The filling to bread ratio was 1:4. We ordered an arugula salad which was good, but felt it lacking something. I will be returning to try the other items on the menu!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UPJwccdMUFSiAQNJFo4Ptg/168s.jpg", "caption": "Lobster roll & arugula salad"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sqhIRpBYTfzlWoL09BcjHA/168s.jpg", "caption": "Tea service & the smoked salmon board"}]}}, {"review": {"des": "Awesome pastry and coffee.   It's also a showroom for RH.  Was very nice sauntering around with a drink while waiting for a table in the beautiful courtyard.", "pics": null}}, {"review": {"des": "Made a point to come here on a random Monday in the middle of day so we were seated immediately. Already I felt pretty smug having read the reviews of the looooong waits. You know what the cure for that smugness is? Looking at the price points of anything in the store. ouch.<br><br>But I digress. Service was lovely and attentive and they didn't seem to mind how many almost perfect instagram shots I tried to take of the gorgeous setting. We started off with some complimentary fries. Don't know what we did to deserve that but I don't even like fries and I ate more than my fair share! I was fighting a cold so I loved that I could get a fresh juice while the husband opted for wine. <br><br>We then moved on to the Burrata which was one of the most amazing treats we had in Chicago. Fresh tomatoes, delicious olive oil. So amazing. We then split the lobster roll which was killer. I normally find those super mayo-heavy and blah but this was by far the best I've had. Thick and juicy chunks of lobster, light on the mayo, and with perfectly buttered and crisped bread. So glad our server convinced us to go that way, it was a perfect recommendation.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XVgnAYPx1SDueHsT_m_tDA/348s.jpg", "caption": "Burrata is amazing!"}]}}, {"review": {"des": "We had a romantic brunch at this place. They have the Best \"Burrata\" in town! <br>We loved it! Artistic, romantic, cozy place. Good service too! <br>If you wish to dine and seat near the fountain, you better come 2hours before your set brunch as there are a lot of people willing to wait and be seated in that romantic area. However, there are a lot of seats, couches, available for everyone if your the type of person that wants to sit indoor and more private.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6WP1YlU8Ohd6yoA4x9nWIA/348s.jpg", "caption": "Trying the mirror on another floor of this building."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4cWSJYJXn0qliuDM8h-5Lw/168s.jpg", "caption": "We've had a Romantic dining experience here."}]}}, {"review": {"des": "I went here for my birthday. I took the day off from work, dropped off the kids at school and went with the wifey. This place is AMAZING.<br><br>First, the building where this place is located is fantastic. This is a historic building that is exquisitely decorated through and through --and no surprises since this restaurant sits inside Restoration Hardware's flagship store in Chicago.<br><br>There are 4 floors here, and this Cafe sits on the first floor in a gorgeous domed patio with a fountain in the middle. Look at the pictures, but they do no justice until you're there. Amazing natural light everywhere.<br><br>There are sitting areas that are meticulously decorated, like living rooms, with couches and chairs, center tables. There are bistro-like tables and chairs which are quite comfy. Nice ambient music as well.<br><br>We ordered the RH Scramble + Bacon. I asked for my eggs a little firmer since we were told the way they prepare them are a little runny --related note: the other day I saw Chef Ramsey saying that runny was the way scrambled eggs should be... No thanks, Chef.<br><br>Eggs were really good! Very savory and with half an avocado sitting on the side, salt and cracked pepper on top. Their toast with strawberry marmalade was absolutely fantastic. Bread was super fluffy and the homemade marmalade amazing. The bacon was this thick-cut side order of amazing bacon cooked to perfection --about 5 slices. Coffee was good, too.<br><br>Service was very attentive and prompt, from the hostess to the server (shout out to Erin!). Presentation was great and overall a fantastic experience from start to finish!<br><br>Would I go back? ABSOLUTELY! Was it worth $70 with tips? Indeed.<br><br>Go here. NOW!", "pics": null}}, {"review": {"des": "I have been to Chicago several times and have tried to get into this place so many times and FINALLY on this recent trip we were able to get in. The wait time was about 1.5 hours but we were totally okay with it because there is a side bar where you can ordered drinks and walk around the store.<br><br>While we were waiting for our table we visited the beautiful floors, my favorite was the rooftop. <br><br>Lunch was on another level of AMAZING. We got the kale Caesar salad, truffle grilled cheese and fries. Everything tasted excellent and fresh. <br><br>We were already extremely pleased with the place but what put the cherry on top is the manager came by and starting chatting with us after our meal. We told him we were from Michigan and were pleased with our visit to the 3 Arts Club Cafe. <br><br>He then came back with some cookies and milk for us to try... and they were delicious! <br><br>This place is absolutely worth the wait!!! A Chicago Must!", "pics": null}}, {"review": {"des": "For this cafe housed in the restoration hardware which - yes - you can shop at (or pretend to) but go with hungry eyes, not a hungry stomach. The cafe is beautiful, like the restoration hardware house of your preteen dreams before you discovered what Whole Foods costs and brought those dreams down a bit. Housed all within a stunning courtyard, with flowing fountains, quaint trees, crystal chandeliers and some A++ people watching. <br><br>There is generally a wait for brunch or happy hour, but worth it to sit and bask in its gloriousness (or just for the instagram). A great place to take parents or grandparents or a date or girlfriends but not good for large groups.", "pics": null}}]}