{"name": "360-chicago-chicago", "reviews": [{"review": {"des": "We just got back from our trip to Chicago and this was one of the best experiences. We were torn between Willis Tower and the John Hancock building so we decided to do both.  We bought tickets on site for 360 Chicago and had no wait time.  It much less expensive than Willis Tower as well. <br><br>The elevator experience has a little movie about the tower, but it's only a 45 second ride so not much to it.  The observation deck is quite large and includes a gift shop and a small cafe/bar area.  We were able to observe the sights with a beer in hand, nice! <br><br>I think I got better photos from 360 Chicago than the Willis Tower.  Depending on the side of the building, you can get shots of the city, the lake, or both. It's also nice to be able to get photos with the Willis Tower in the skyline.<br><br>if you're really torn between which tower to spend your money at, I think you get more bang for your buck at John Hancock.", "pics": null}}, {"review": {"des": "Yes! Made it to the John Hancock Tower AKA the 360 Chicago! It really is a nice view of all of Chicago - makes you appreciate how great Lake Michigan really is and how dense the skyline of Chicago really is! Plus, that TILT - that was pretty intense but my lady and I survived it and enjoyed it. So we hang on to a couple of handles and step on a platform and this piston pushes us to a tilt of 30 degrees - basically enough to be somewhat disjointed from the building and looking straight at the ground below from over 1,000 ft above! There is also a bar up there but oddly enough, no one was ordering from it. Therefore I took the hint and didn't order from it! hahahaha. <br><br>Anyway, after all of that, we were able to have a chance to retrieve our photos (both from the TILT experience and via a green screen) for a price. There is also a gift shop where we could buy souvenirs representing Chicago and the John Hancock Tower. Also, I used one of the City Passes that certain touristy websites offer to get into this attraction. I would definitely recommend going that route to save yourself some $$ and making the most of a trip to Downtown Chicago.", "pics": null}}, {"review": {"des": "More scenic than The Willis (Sears) Tower and you probably won't get rushed out after hours of waiting like we did at the Skydeck of Sears Tower. <br><br>The lounge offers food, drinks, and alcoholic beverages to fulfill your metabolic needs and desires, which the Skydeck at the Sears also lacks. <br><br>Locals from all over recommended 360 Chicago over Skydeck and I could clearly see why as the entire experience is more comfortable altogether (aside from the amount of sway in those elevators). <br><br>Didn't get a chance to experience Tilt 360 but one thing the Sears has over 360 Chicago is available access (though limited in duration) to the Skydeck, which is essentially a transparent rectangular tempered glass projection overlooking the city underneath your feet.", "pics": null}}, {"review": {"des": "08/2018<br><br>I am a fan of observation decks & the amazing views they offer. 360 Chicago delivers!<br><br>It is conveniently located on Michigan Avenue in the area of downtown Chicago that we were staying. Wait time in lines for the elevator (up & down) were very reasonable & pleasant as we spent that time chatting with other visitors. <br><br>Views of Chicago & Lake Michigan from this 94th floor observation deck are beautiful. We enjoyed meandering as well as the conveniences of tables & benches located throughout. It was a relaxing time even with a steady flow of people. <br><br>There are \"tilt\" window tickets available to purchase if you'd like a more intense view.", "pics": null}}, {"review": {"des": "This exhibit was absolutely incredible. I never really think to do the \"touristy\" activities in the city, so I'm glad my first stop on this endeavor was 360 Chicago.<br><br>I got tickets in advance so I did not wait in line to buy the tickets on the day I went to 360. The actual wait time to get in an elevator was about 30-40 minutes, but the walls are decked in Chicago history, so you don't even realize you're waiting in line.<br><br>Once you get to the 94th floor, you're immediately amazed by the beautiful views! As advertised in the name of the exhibit, you can see the entire city through the floor-to-ceiling windows. We went on a clear day and it was perfect.<br><br>I am terrified of heights and still enjoyed the tilt experience. It is definitely worth spending the extra $8 to say you tilted off a skyscraper.", "pics": null}}, {"review": {"des": "Note to self: Its cheaper to buy the tickets online by $2. If you buy on site, its $23 vs $21 online.<br><br>I thought about it for a very long time, if it's really worth going up to see the day view. The 360 Chicago goes all the way up to the 94th floor. The view there is gorgeous. Its was so busy on the day that I went (it was a Sunday). I got lucky and was able to catch the Chicago airshow there at the same time. If you pay an extra $8 you get to do the tilt. I didn't want to pay the $8 (exchange rate -- too ugly for Canadians). From the building, you can see Lake Michigan, The business towers, Navy Pier, Ferris Wheel, Beach etc. <br><br>Honestly, from my company office, I get the same view or similar view up on the 57th floor of the Aon building. Kind of regret that I paid $23 USD = $31 Cdn to come up here. Well if you are a tourist than this is a different story. Its not like you can go up any tall building.<br><br>Still amazed at the view.", "pics": null}}, {"review": {"des": "$11 for Chicago residents. This attraction is ideal for a 360 degree view of the City aaaand 1,000 ft up on the 94th floor of the John Hancock Building. Showcased are Chicago neighborhoods, Lake Michigan, Navy Pier, and loads of informative facts. <br><br>Voted 10th best view in America by Travel and Leisure for a reason. If you go before 10am, there isn't a line. Like all city attractions, there is a green screen photo experience available for purchase, a few gift shops to commemorate your visit, aaand a tilting glass lookout (Tilt)! <br><br>Some other cool facts I learned: <br>-Completed in 1969<br>-Fourth tallest Chicago building (15,00 feet)<br>-Took 2,000 workers 5,000,000+ hrs <br>-Takes elevator 45 sec to travel 94 floors", "pics": null}}, {"review": {"des": "So I was originally supposed to visit this spot with my friends but when we came it was around when they were about to close and they had a long wait already so we got tickets and had to come back the next day. We made sure to come back the next day because it was my friends' last day before they leave to go back to LA. But when we arrived, they had an event happening and we weren't aware of it when we came the night before. So they gave my friends a refund but it was just upsetting because they should've let us know the day before. So my friends didn't get to go up but I came back the next day and it was pretty foggy so I couldn't see much but from what I did see, it was still pretty nice. I did the Tilt and it was pretty fun and I made a friend on it since we were the only two on it. I wish we could take our own pictures and videos while on it but they do it for you and you just have to purchase it. So overall, I thought this place was just alright for me. I personally enjoyed the Skydeck better but the view was just as beautiful. So if you are deciding between the two, I'd say go to the Skydeck instead! But if you want a little thrill with the Tilt, come check it out at this landmark!", "pics": null}}, {"review": {"des": "A beautiful viewpoint for Chicago and Lake Michigan, this location is well worth visiting. That said, some aspects could be better maintained including some of the video screens describing the area, and I was surprised that some of the objects on display were missing. It really was worth a visit. Be aware that lines might exist to go up to this 94th floor, and lines may also exist when you want to return down. Featuring a really fast elevator, this place may lead to some motion sensitivity as the floor really is that high up. <br><br>The restrooms are small and cramped and the gift shop up here is a bit small (there is another gift shop on the ground). I really appreciated the souvenir photos available here as I was traveling alone. The photo system didn't always work (the scan codes didn't always work) but I was able to obtain my photos anyway.<br><br>Buying tickets in advance is likely worthwhile when it is busy but it wasn't terribly busy when I went there.", "pics": null}}, {"review": {"des": "Beautiful views of Chicago and Lake Michigan from the 94th floor of the John Hancock Center. <br>Must see and do for all Chicagoans as well as tourists. Enjoyed a glass of wine from the cafe. Looooved the interactive panoramic touchscreens!<br><br>Watched the Air & Water Show here for last 2 years. <br>Had an issue during check-in with tickets that were previously purchased online. <br>Matt Orsini, Operations & Bar Manager, stepped up to assist. He was very professional and friendly!<br><br>Everybody needs to go to 360 Chicago Observation Deck at least once!", "pics": null}}, {"review": {"des": "I purchased a ticket at  my hotel for $32 which allowed me 2 visits to the Skydeck and 2 Tilts. Separately that would have cost me $64. I visited the Skydeck in the morning Oct 4. I did Tilt and got the window closest to Lake Michigan. Omg that was so awesome. I loved tilting out 1000 feet over the city!! I sat upstairs at the bar for 2 hours just looking at the view and drinking my drink. I came back later that night with RJ and did it all over again. I got the same window, but this time it was at night. We got drinks and watched the view at night. My $32 ticket was worth every penny!!", "pics": null}}, {"review": {"des": "A completely eye popping view of my home town from the 94th floor of the John Hancock building.<br><br>I lived in and around Chicago for almost 30 years and I had never done this. So for Father's Day my family took me up to the 360 viewing area of the John Hancock building.<br><br>Anyone that really knows me knows I am a pretty sentimental guy... this made me tear up for sure. It was something I always wanted to do and I got to do it with the ones I love the most!<br><br>The view is dizzying, spectacular, amazing, wonderful, awesome, mind blowing, phenomenal, beautiful, and all encompassing. You get a complete 360 degree view of everything for miles.<br><br>There is also a tilt where you stand in an area and it tilts you down to look out over the buildiNgs. (We didn't do this because of my youngest but it looked pretty cool!)<br><br>There is a gift shop up here and down stairs, there is a full bar and light food including gelato. <br><br>I literally could have spent all day up here!<br><br>The cost is not cheap... you do pay a hefty amount for parking too, but I really thought it was completely worth every penny! <br><br>At the end we bought the souvenir pictures that they take in the beginning in front of a green screen so they can superimpose you over pictures of the city. I can't wait to frame them and put them up!<br><br>This was one of the best Father's Day gifts I have ever gotten... I will never forget it!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jBnolaYhsemzeuTbwOkzrg/348s.jpg", "caption": "You tilt out!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/641j8R6kpnnhueFWOwQq5Q/168s.jpg", "caption": "Father's Day!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cAb436A5jl5WLFeU4JD-bQ/168s.jpg", "caption": "My home town!"}]}}, {"review": {"des": "Day #5 on our Drive Across America is a layover day in Chicago, IL.<br><br>There are several skyscraper observation decks in Chicago but we picked this based on the reviews. It's a million (actually $23) dollar view. Ha ha. It probably has the best overall perspective of the city. It's kind of touristy. Worth $23, absolutely. They have snacks and drinks and nice observation benches which sets it apart from other skyscrapers. Check it out.<br><br>Listed in Drive Across America: <a href=\"https://www.yelp.com/collection/4_4-FCUBHEQBq43u7DXRig\">yelp.com/collection/4_4-…</a>", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/q1Mz-GueE6sS-mHS6xuCrQ/348s.jpg", "caption": "West view"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Hy-Mav-V2pnR8MZ67lv9VQ/168s.jpg", "caption": "East view"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YwzR30wsAPZYLcXBd38Ieg/168s.jpg", "caption": "North view"}]}}, {"review": {"des": "I have been here twice and loved it each time. Last time I went was on a weekend and it was packed and took a while. This past time was on a weekday morning and we easily made it in. The view is amazing, and I must admit I got to enjoy it a lot more this time without the huge crowd all trying to take pictures. I love reading all the facts that they have as you are walking to the elevator and as you are looking at the views. <br>The tilt is such a fun little ride. It cost $8 which I feel like is decent since this is a tourist attraction. I loved it (and was terrified at the same time) but my husband found it too quick and a little boring.", "pics": null}}, {"review": {"des": "I thought it was a little pricey to just go up and have some views but we did the \"cocktail with a view\" which was nice. Got some great photos and it was a perfectly clear day. The drinks were small but they were okay. It was nice to just sit and hang out after waiting in line for so long.", "pics": null}}, {"review": {"des": "Yup.. you know that if you're scared of heights... your friends are gonna push you to get on up (like me)! The elevator takes you 94 floors up, that's 1,030 feet up!! Once up at the observation area.. three views are absolutely stunning!! You can see miles on out depending on the weather. Then.. you get to the TILT... .. my palms were sweating more and more the closer I got in that line. My heart rate went from a standing 59bpm.. to 123bpm after! Upon your turn .. you step up to the edge, grab on the rails at your sides, and hold on for dear life as it tilts you forward over the edge in 3 quick segments.. it's a whole 1 minute long but... wow!! It'll get your blood pumping! It was awesome, scary, amazing, nerve wrecking and more all at the same time!! But well worth the experience/memories", "pics": null}}, {"review": {"des": "The most overrated thing we did in Chicago. Yes you get a nice view but if we had had more time I would have chosen to use our city pass on another attraction over this one. FYI the pictures they take to sell to you later are not optional. So even if you know you don't want to buy the pictures later you have to still take the picture. Then it's a line to get on the elevator. At the top you get to walk around to see the view. The windows have a lot of bugs on the outside.. Not sure how they can clean the windows... That must be the scariest job. You can do the \"tilt\" option (where they tip you about 20 degrees downward twice) for $8 and pay extra again for more pictures. Then stand in line in get back down. <br>Like I mentioned this place is overrated. stars for the cool view.<br><br>Update :  I can't directly respond to the reply by the business owner so here it is: I appreciate your response. The line and the bugs are understandable. I would suggest the staff is trained about the pictures being optional. Because we asked to opt out of the picture since we didn't plan to buy the pictures and we were told it's not optional. I didn't think I would have my picture taken forcibly unless I was in prison (which I don't plan on). We then thought maybe it was for security reasons but that didn't make sense. I would have expected an ID check instead of forcing people to take pictures. That didn't feel good at all so please inform your staff. Thanks.", "pics": null}}, {"review": {"des": "Based on what I know now, I would do 360 Chicago during the day and Willis Tower at night. The Jefferson building is closer to Lake Michigan so at night, one whole side is basically darkness. There is an opportunity to see fireworks at the Navy pier around 9:30 during the summer on Wednesday's I believe. We arrived 45 minutes before closing and it was maybe 10% occupied which was nice. <br><br>The \"attraction\" itself seemed to be a little less organized than Willis but it was the night shift on a weekday so maybe that's when the B team works. They offer the TILT option as an additional charge which is kinda cool but Willis has the LEDGE which is included. 360 Chicago seems to be more of an adult hang out as they have a bar that serves alcohol. Overall a decent experience worth seeing once.", "pics": null}}, {"review": {"des": "Beautiful views over the city of Chicago and Lake Michigan!!! <br><br>Came here on our first night and it was a great introduction to the city.<br><br>The elevator takes you to the 94th floor in no time! <br><br>If you decide to brave Tilt you can purchase tickets on this floor too.", "pics": null}}, {"review": {"des": "94 floors above Chicago- beautiful! I have been during the day and at night. I enjoyed the night lights the best. Romantic. Informative. Peaceful. Small gifts atop for purchase. More gifts on ground level upon exiting. Both evening and morning experiences were on the weekend and waited about half hour to make it to the top. There is available option for alcoholic drink for only $5 with purchase of observation ticket. I think non discounted alcoholic mixed drink was $10 or $12.... Tilt attraction available for purchase on 94th floor only for $7.", "pics": null}}, {"review": {"des": "Very touristy and excellent views of the city! I'm not too sure I would pay $20 to go up here, but for Chicago's 181st Birthday they were treating patrons to free tickets. It happen to be a beautiful day out and like the name a completely perfect 360 degree view of the beautiful city. <br><br>For an extra $7 you can experience the tilt. It's like being on the ledge and looking down. Lol", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LIzb454_vCmTxfzmXYbQ7g/348s.jpg", "caption": "Awesome Views!"}]}}, {"review": {"des": "If you are looking for the best views from a skyscraper in Chicago, the 360 Chicago experience on the 94th floor of the John Hancock Building is as good as it gets. The Willis (Sears) Tower and its glass ledge get a lot more pub, but the views from all sides of 360 Chicago are better with way less people.<br><br>Go just before sunset to get day/night ... and sunset ... pics. There is a wonderful viewing area facing southwest (towards downtown) just for this purpose and will be extremely popular as the sun goes down. Since the views are a full-360, you get remarkable photos of the lake, beach, cityscape, and all of Chicago.<br><br>If you want to one-up the thrills over a glass ledge, pay the upcharge ($7) for the TILT attraction and its 1000-foot views straight down over the Magnificent Mile. Basically, you stand up while looking out the glass windows at the south edge of the building and then the entire section of the wall \"tilts\" out so that you are laying down (holding on & praying) on glass above the city below. Check out my Yelp pics to see what I mean.<br><br> * Adults (12+): $21; Children $14<br> * Save 10% by purchasing tickets online<br> * Chicago residents save 50% (date night anyone?)<br> * Other discounts like CityPass and groups available<br> * Open 365 days a year<br> * Hours are 9:00 am to 11:00 pm<br> * Parking discounts available via the website<br> * Of course, MTA is a good option, too.<br> * The John Hancock Building opened in 1969<br> * It took 5 million worker hours to build<br> * The building sways 5-8 inches in 60-mph winds<br> * On windy days, you might feel it<br> * 11,459 windows = views for everyone in the building <br> * Bar 94 is more cafe than bar, but beer and wine FTW<br><br>When we went on the weekend, the crowd was mostly adult and the vibe more romantic than the tourist-fever at the Willis Tower. The relaxing experience, smaller & mature crowd, and, most importantly, better views from all sides, make 360 Chicago the #1 choice of its kind in the city.", "pics": null}}, {"review": {"des": "The view at night time here is amazing!!! I am so glad I came in the night time because OMG breathtaking. <br><br>I had the City Pass and among other attractions this was part of it and I'm glad we came. It's an elevator ride up 94 floors and once you make it up you must 1. Take pictures and 2. Try the tilt for $7<br><br>The tilt was a bit scary though I'm not even going to lie but if you're feeling very dare devilish you should most definitely try it. I felt like I couldn't breathe for the first 5 seconds on the tilt but considering that you're only tilting off the 94th floor of a building for about 20 more seconds, doesn't make it so mad after all. <br><br>A must see when coming to Chicago", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5KpNrn_mNzYEPWFO2Jp2Qw/168s.jpg", "caption": "Selfie overseeing the city"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/j3KmfWWD8GoaAHlGBfV1MQ/168s.jpg", "caption": "Night time view from the 94th floor"}]}}, {"review": {"des": "The view from up here at night is absolutely beautiful. I think it is absolutely worth paying to come up here and have a look at the city from above. However, I do feel like they are over charging people, but it's still worth it. My favorite part is the little section they have that has screens instead of glass windows so you can feel the air from all the way up there. That section is very secure with rails and you are decently far from the screen so don't worry about falling through the screen window or anything! It's located right next to the Tilt. The Tilt cost extra and wasn't worth it. I wrote a separate review for that. <br><br>It was pretty busy when I was there with my family and it was hard for us to take pictures of us  with the background since people are rude and don't care if you have been trying to take one picture for the last 15 minutes. If you are taking pictures of the city, that is really easy since you just have to put your phone or camera up on the glass and tons of people can fit on a small section of glass with their phones. <br><br>They have a little bar up here as well. The drinks are pretty expensive. If you are going to buy anything get an alcoholic drink to make the price worth it. Otherwise, $4 for a can of soda. They have a little gift shop as well with stuff that is decently priced for a gift shop.", "pics": null}}, {"review": {"des": "Experience Both the Day and Night Views at Sunset<br><br>If you visit before sunset, you can experience the city three different ways-day views, watch the sunset over the horizon and watch as the Chicago skyline lights up at night. The view is amazing and very different from all three perspectives. <br><br>If you are interested in history or architecture, there are interactive touch screens that let you learn about famous locations in Chicago. Go outside on the open air skywalk 1,000 feet above the Magnificent Mile and breathe in the fresh air on the highest outdoor public space in the U.S. You can also send a virtual postcard back home.<br><br>If you don't want the 360 floor to ceiling unobstructed views, you can go the lounge at Bar 94 for a drink or a meal, but I would highly suggest the observatory experience.<br><br>There are 1/2 priced discounts for Chicago residents.", "pics": null}}, {"review": {"des": "Came here for a super blue blood moon Eclipse Meetup! Loved the view and the tilted observation deck!! <br>Def recommend for tourists to stop by to appreciate the beauty of Chicago.", "pics": null}}, {"review": {"des": "Yes, the tilt was amazing but it only lasted about 5 minutes and you can't take pictures. They have a professional taking pictures because your hands have to be holding the pole at all time. So this is pretty much a rip off. You get the same view at Willis tower, which I also did and it was a fraction of the price and you get to take a million pictures in the glass boxes. 1 picture at 360 will cost about $27 with tax, that plus $8 for the tilt and $23 for your ticket to go up. Totals to a whopping $58. You can pay $24 for the Skydeck in the Willis tower. <br>Thank me later :)", "pics": null}}, {"review": {"des": "Excellent view for the city of Chicago, which also has the best skyline.  The kids look forward to going to the top and getting inside this specially made window, that leans forward as if you are about to fall.  The kids really enjoy this.  Souvenir shop is also located up there.", "pics": null}}, {"review": {"des": "Regardless of having a city pass or go explorer the lines are fast. The staff are friendly and efficient considering how quickly things can escalate. <br><br>Truly. I am amazed that they are such well performers at this job of answering so many questions with a smile on their faces. <br><br>The views are amazing of course.  You Can look at photos but nothing beats seeing things with your own two eyes. Very well done.", "pics": null}}, {"review": {"des": "We really enjoyed the Chicago 360. Honestly, it was not something I was too excited about before experiencing it, but it turned out to be one of my favorite parts of my most recent trip to Chicago. <br><br>It is such a beautiful view of the city, it's a nice place just to hangout. There is a bar/coffee shop along with plenty of seats to enjoy the city views, there was also live music the day we were up there. <br><br>The only thing I would have done differently would be buying the \"sun and stars\" package that allows you to visit two times within 48hours (for not much of a price difference). Because I would have loved to see this view at nighttime!", "pics": null}}, {"review": {"des": "So this view was absolutely amazing. We came right as the sunset, and it was breathtaking. The venue was very clean and the drinks were great. Now the only thing i have to say was an absolute shock, the customer service. This is my second day in Chicago (I'm from California) and i just have to say it is HORRENDOUS! We walk in to not even be greeted, but yelled if we had a pass. Go to the \"bag check\" to find this unethical, sad excuse of a person eating Cheetos and watching Netflix. Only to be rude to us because we don't have our bags opened. (Well shit when you see someone on the clock eating and playing on there phone should you even open your bags.) i can't understand how employers think it's ok to have your employees be on there phones and be so rude to guests. This would be such a better place if there was some rules applied to the employee in this place.", "pics": null}}, {"review": {"des": "I had so much fun. Its pricey but absolutely worth it for the views. They limit the amount of people on the observation deck so it didn't feel  crowded at all.<br><br>Tilt was fun but its not necessary. It was fun little thrill ride. I had more fun watching people on the ride then the ride itself. <br><br>The elevator line is long but worth it. If you buy your ticket ahead of time you save about 45 min on a busy day.", "pics": null}}, {"review": {"des": "We absolutely LOVED tilt Chicago. Great place for AMAZING pictures of the city. The TILT ride itself is really worth it. A fun, mini thrill!!<br><br>The elevator lines are a little long, but totally doable.", "pics": null}}, {"review": {"des": "After you visit Willis Tower, this is a little underwhelming, but it is not as busy so there is that. There are some definitives pros. Such as the bar area, they have cocktails, coffee and some bites. There are a couple high tops where I believe you stand, I don't remember there being any stools where you can sit, but you can sip your cup of Java or cocktail while looking out the skyline. It also it is more spacious than Sears and you can find several outlets if you need to charge your phone. <br><br>We came around sunset and were able to get some good shots. But, if you only do one of these Skyline viewing building, do the Willis Tower with the Sky Deck!", "pics": null}}, {"review": {"des": "It was busy but people made it work. People who were visiting this popular spot were courteous and respected each other while trying to take photos in specific areas. I really like that about my visit here. I would say it's a better idea to come at night so you can see all the city lights. It's so beautiful. The 360 glass tilt was seperate payment if you wanted to do that and they dont allow cameras or phones when you're on the tilt but there are attendants that take a pic of you and if you would like to purchase that photo, you can before you leave. I would definitely reccomend anyone who is visiting Chicago to come visit this spot at least once...and during the night time. It's worth it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2QpMCtNroj1z_EVsi22dMA/348s.jpg", "caption": "Look at that ferris wheel in the night lights...love it"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bsA5CuCPtlCD9YJKH1-D2A/168s.jpg", "caption": "Night view of the city meets shore"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XzfwWhLHyDdn98yPoP-P1A/168s.jpg", "caption": "Beautiful night view of the City of Chicago"}]}}, {"review": {"des": "This was really cool! On my first visit to Chicago, I knew I had to come up here to experience the breathtaking views. I am so glad that I took the time to do this. It was an early Friday morning and I walked right over from my hotel (The Cambria), there were no lines and I quickly got up to the 94th floor. The attendants and the staff were so welcoming that I felt right at home (way up in the sky). What was even cooler was that it was a clear day, so I got to see everything and do my ooohhhs and aaaaahs. I didn't have long, but because it wasn't very crowded, I got to do \"The Tilt\" as well (yup, no wait!). If you're into souvenirs and things, there is a shop up there. Now, if you're hungry or just feel like taking a bite amidst one of the most gorgeous views of Chicago, then grab some food in their cafe. I thoroughly enjoyed this experience a bit more than the Empire State Building in NYC. Gosh, I was actually just relieved that I wasn't crammed in with a bunch of people up there. Pro Tip: go on a low-trafficked day and all the magic will happen!", "pics": null}}, {"review": {"des": "It's not the highest view in the Windy City, but 360 Chicago may very well be the best. With limited time on a recent business trip, I chose the observation deck on the 94th floor of the John Hancock Building over the 103rd story Wills Tower Skydeck, mostly because of 360's more convenient Michigan Avenue location. <br><br>The line to the elevator was short on my weekday visit, and just 10 minutes after buying my ticket, I was hurtling at more than 20 miles per hour to a height of more than 1,000' above the city. And the views from the top are spectacular. With the Lake Michigan shoreline on one side and the downtown skyline on the other, the photo opportunities are endless, and I spent nearly an hour soaking in the sights. <br><br>The enclosed deck offers clean restrooms, a massive gift shop, and a bar with cocktails, snacks and desserts. There's also an interesting educational video on the construction of the John Hancock Building, which serves as a nice diversion when you're waiting the crowd at the windows to disperse. <br><br>I didn't bother with TILT, the 'thrill ride' that costs another $20 per adult. It seems to be an attempt to replicate the vertigo-inducing glass floor at the Wills Skydeck, but I thought it best to leave 360 with my the contents of my stomach intact. <br><br>I really enjoyed my visit to 360, and would highly recommend it to anyone visiting Chicago. So find a day with good visibility, charge up your camera, and ride to the top of the John Hancock Building for some unforgettable views.", "pics": null}}, {"review": {"des": "If you're a tourist in Chicago, it's pretty standard to either visit the skydeck or 360 Chicago. But how do you decide which one?? While they both have amazing views and are actually in pretty close proximity to each other, they each have some pros and cons. <br><br>The skydeck has a cool edge platform made of glass where you can see a small part of the city under your feet. Meanwhile, 360 has \"the tilt,\" an extra $7 to hang at a slight angle over a protected window portion (I didn't really understand the hype tho...not worth). <br><br>360 Chicago is going to run slightly cheaper overall, and the wait times are not as long. 360 also has an abundance of seats and tables, so you can sit and enjoy the view. Skydeck, nope. I noticed 360 had outlets too, so you can essentially sit up there and just chill and not worry about battery running out (just remember your charger!)<br><br>The one downside of 360 is that the windows weren't super clean. I saw some streak/dirt marks that really messed with the view in some parts of the windows. Overall, however, I'd still go with 360 because you can really sit down and take your time to enjoy the view. There's even a small cafe and bar where you can order snacks and drinks. The vibe can be romantic, even, if you were to go when it's emptier of tourists. And  afterwards, you can head one floor up w a date ;D (or yourself! Who says you can't treat yourself) to eat at the fancy \"Signature Lounge\" restaurant while continuing to take in the spectacular view", "pics": null}}, {"review": {"des": "It's $21 to go up in the John Hancock building, the best deal is actually the elevator and a drink for $26.50.<br><br>I had purchased a Citypass so I was able to use that for admission, but that does not include Tilt, which is a separate $7. I recommend going up while the sun is setting so you can get some sunset photos, and then staying until the city gets dark to take some night photos. This was fun to go up the elevator, but now that I've done it I probably won't do it again for a while. <br><br>The better deal is actually to take the elevator to the Signature Room, and order a drink - it's about the same price but you get to sit while doing it.", "pics": null}}, {"review": {"des": "I came here with a friend in November after purchasing a deal on Expedia (entrance to the deck plus a half bottle of Prosecco for 2 - totally worth the extra $5 a person). We redeemed the deal and went up to the observation deck at around 6:30pm so the sun had already set (which was a bummer, but the view at night is gorgeous as well). The elevator ride up is a treat, and once you are at the top, you can enjoy the views and take all of the pictures that your heart desires.<br><br>If you are feeling daring, you can pay an extra $7 once you are upstairs to do the \"TILT\" which is a titling window experience that suspends you above Chicago's high rise buildings. It's not for those who scare easily or have a fear of heights (ME!) but my friend chose to do it and loved every second of it.<br><br>My advice - come here during the day or at sunset if you don't mind dealing with crowds. If you rather have a more quiet experience, come here at night like we did (and be sure to take advantage of the Expedia deal as well).", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jpS0Zm3h8MXFrQzJt8nenQ/168s.jpg", "caption": "Expedia deal - Entrance and Prosecco for 2 (with a gorgeous view)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gSqQ_8cV3vyYkeeRoFtbqw/168s.jpg", "caption": "Observation deck at night"}]}}, {"review": {"des": "Better views...<br><br>What did I get<br>I experienced it all. I went up the tower and also experienced the tilt. By this time I have already been to the Willis Tower Skydeck. This was a way less busy attraction. The lines were not as long (got there at 9-10am) The elevator wasn't as packed and the views were much better. This building is near the lake so there was more interesting views (Maybe its cause I am from Orlando). The tilt experience was so so, not worth it. It was probably around 2 min max and all you get it looking down..... at buildings. I don't fear heights so it wasn't a trill for me...<br><br>Environment<br>This building is located near the lake so the views were a little bit more interesting for me. Also there is a bar for you to get drinksssss. This attraction felt less of a tourist attraction than the Willis Tower.<br><br>Niceness of the Staff<br>Purchase tickets and go go go. There wasn't a oh-ah moment with the staff for me. I skipped on the green screen photos before going to the elevator. <br><br>Dollar<br>The trip up was $21 and the tilt experience was $8. Not expensive compared to the willis tower but the tilt experience was not worth it for me<br><br>Yes?<br>Not much excitement.... Not really. <br><br>#WendyWanders #WendyandChiTown", "pics": null}}, {"review": {"des": "We went around 4:30pm and went straight up with no line to go up or for the tilt. It did start getting busy as we were leaving at 5:30. The tilt is $8 and last a minute or two (goes in & out 3-4 times). It was scary but worth it but you can't bring a camera so unless you have someone outside that can take your pics the only option is to buy their $25-35 pictures although they were excellent quality and came with digital download. Their is a bar on this level but it is pricey. I don't like that you can't come up at day and night because no one wants to come during day light than wait hour or two for it to get dark enough for the city to be lit up and it gets real busy at sunset. We had the city pass so once we left we could not come back", "pics": null}}, {"review": {"des": "Stopped by here on my last day visiting the city for of course, the view. I came by on a Monday so it wasn't busy at all. For the price of $20, I think the experience is well worth it. <br><br>Much to my surprise, I found out that it's not just an elevator takes you up to the 94th floor. Nor is it the building that people take cool photos of themselves sitting on the glass overlooking the city. That's actually at the Sears tower across the way, BUT I'd argue that the Hancock center gives you a way better view! <br><br>Before you head up, it drops you off at a little walk-around city tour of Chicago. Pretty much gives you the tidbits of each unique surrounding neighborhood and history of the city, how far growth has come sincd the chicago fire etc etc. <br><br>There's also this ride you can take if you want to know what it's like to lean off the edge of the building. Lol. I didn't do this but it's an extra $7 and the ride is closed on Mondays for window washing. <br><br>It's definitely a good experience if you want to feel refreshed and check out the view and bay area of Chicago. (It's not all just city!) And the customer service was great. The staff is all young and knowledgeable of the city, and makes for a welcoming stop-by.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/a9yPGtsVfVFekciCx2mO1Q/168s.jpg", "caption": "A pretty basic hipster photo I know, but great views. And shoutout to the employee that took this for me"}]}}, {"review": {"des": "This was a great experience while in Chicago. Of course I had to try this and the Willis Tour so that I can compare. I went to 360 Chicago at Sunset. The view of the city is great! The Tilt is a fun and MUCH different experience. You definitely have to do this if you take the time to visit 360 Chicago (it is an extra charge on top of just going to the top). I also really appreciate that there is bar at the top. It was nice to have a drink while watching sunset (I don't believe this is offered at Willis Tower. The ONLY negative I can even say about the experience is that you aren't allowed to take your own pic inside the tilt area. I'm not sure if this is because they are trying to move the crowd along or if they want you to purchase the photos they take, but I found this to be a drawback of the experience. You are allowed to take pics around the rest of the windows outside of tilt though. It's a good experience that I would recommend checking out while in Chicago!", "pics": null}}, {"review": {"des": "Still a great place to visit if you're new to Chicago! Beautiful views of the lake. We used our city pass and chose not to pay $8 extra for tilt (it looked a bit underwhelming).", "pics": null}}, {"review": {"des": "The views were spectacular 5 stars. The place inside was nice we arrived at 315ish we wanted to get the entrance with drink included  but in order to buy that it needed to be after 4pm. <br><br>We didnt want to risk the sun going down so we didn't wait. Luckily when we got upstairs after taking various pictures we found a table near the bar area and the beers and cider were a good price. <br><br>The reason why I give it a 4 stars is because the windows were really dirty and you basically lose time looking for a good angle so the picture looks good.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eu-Ca9Df3lWfN5gssTR9bg/348s.jpg", "caption": "The views."}]}}, {"review": {"des": "Oh my gosh! <br>Oh My Gosh!!<br>OH MY GOSH!!!<br><br>Talk about a view!! Absolutely stunning!! I loved it!! <br><br>IF you have vertigo issues, don't do this. <br><br>IF you have elevator issues, don't do this. <br><br>IF you're up for a great view, do this! <br><br>IF you love heights, do this! <br><br>IF your a scenic photographer, do this! <br><br>It's cheaper if you purchase tickets on Groupon, if they have them available. <br><br>IF you're brave enough to do the Tilt, do it!! It's actually really cool and not as nauseating as I was expecting. If you do it, purchase the photos afterwards because you can't take your own. <br><br>Take pictures from all sides, in fact, take pictures twice. If you go closer to sunset then you'll get great photos with the light and shadows. <br><br>For the practicals:<br><br>There are bathrooms on the 94th floor<br>There is a bar/cafe, stuff for adults and the kids<br>Kids have to be a certain height to do Tilt, just like rides at a theme park<br>You purchase your Tilt photos upstairs and get them downstairs on your way out (or you can purchase them on your way out). <br>If you purchase hard copies of your photos you also get a digital copy <br>There's a gift shop on the way out <br>There's souvenirs on the 94th floor<br>There are fun facts about the John Hancock building on the 94th floor <br><br>This really is a great experience that I would recommend to anyone visiting Chicago, or even those who live here who haven't done it yet. It would make a fun first date. It would make a fun family outing.", "pics": null}}, {"review": {"des": "I'm so proud to call Chicago \"mi ciudad.\"  Although I still speak with South Carolina southern accent, which I can't get rid off, I'm a bona fide Chicagoan!  <br><br>Don't get me wrong.  I enjoy the parks, the sceneries, the food, and the neighborhoods, but I highly recommend going up to the 94th. floor to experience \"360 Chicago.\"  If you live anywhere in the \"606\" zip code, the admission is half-off ($10.25, as of 09/24/2017).  The ticket is valid for one (1) year.  <br><br>They conducted a short and sweet bag check to ensure there was no outside food and drinks (and no weapons of course).  Hubby and I went on a Sunday evening before sunset so that we could see the full cycle of day-night changing.  <br><br>The elevator going up was one of the fastest in North America.  However, one couldn't see anything inside the elevator.  Well, it probably was a good thing for those who are afraid of heights.  <br><br>I saw some people were doing the \"Tilt,\" for an extra fee.  We simply just wanted to enjoy the views looking from all directions.  There was no time limit; you can stay as long as you want to.  The last admission is at 10:30pm.  <br><br>There's a cafe that sells gelato, alcoholic and non-alcoholic beverages.  Hubby and I had a great time identifying some of famous Chicago buildings and venues.  We were there for about two (2) hours.  <br><br>Hubby said this was more relaxing than going up to the Sears (Willis) Towers.  \"360 Chicago\" is cheaper with the 606 resident rate and can explore the entire floor with leisure.", "pics": null}}, {"review": {"des": "360 Chicago is sky view of the Chicago..<br><br>What a place to see the great Chicago city. East, west, north , south you get all the views possible from the Chicago city. Captured great photos and see the view of the beautiful city.<br><br>I really would love to go there at night to capture some night views from the south. It looks just like a candle world with all the colors of lights. <br><br>The cost is $22 dolors for the nonresident $11 for the Residents. Well you pay extra $11 for not living in Chicago:).  No worries it's worth to See that view from the tower.  <br><br>There is a shop when you entered and exit, with all those little travel gifts that you can buy on the way. I bought a coffee cups cost me about $12.", "pics": null}}, {"review": {"des": "So if you plan to go here I highly recommend investing in the city pass because you save time and money on 5 locations and this is one of them. This place was pretty cool because you get to see the entire Chicago from the 94th floor. They have this option called the \"tilt\" and it's $8.00 per person. It's pretty much a window that tilts towards to ground to give you the effect that your falling. I'll be honest, I am way too much of a punk to try it butttt it did look pretty cool when others did it lol. This place is a must if you visit Chicago.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XVHCRVao0WE-nkerYyfJoQ/348s.jpg", "caption": "The view from the 360 Chicago tower"}]}}, {"review": {"des": "For an adult, it is $20.50 to head on up to the 360 Chicago observatory in the John Hancock Center.  To enter, however, you first have to descend along the external staircase to the dip that houses the Cheesecake Factory, and enter through the doors between the two eating establishments.<br><br>Purchase tickets via the lines to the right, enter if you have pre-paid through the door to the left.  We had pre-purchased our tickets via GO Card Chicago (20% off for 2 attractions), so we sauntered on in.  It wasn't all that busy on a Sunday afternoon in mid September.  But we noticed a separate VIP entrance for those with a CityPass.<br><br>Once we got past the elevator ride, we were set free to make the rounds at our own pace by the windows facing all four directions.  We had a nice view of the Navy Pier, the beach, and the city.  We discussed that the Willis Tower would probably have a less naturey view given that it was almost two miles further off from the lake.<br><br>We noticed bugs clinging to the outside of the windows and were more than a bit surprised that they had made it all the way up here.<br><br>It was fun watching folks experience TILT for $7 - not bad a price if you are interested in such a mobile experience.<br><br>Postcards were purchased at the gift shop, and the Bean bank was oooh'ed over.<br><br>There was no line by the bathroom by TILT, but the line to head back down from the 94th floor took a while.<br><br>TILT tickets available online for a 10% discount when bought in advance for a set time.<br><br>Go Card - you either need a printer, or to download their app.<br><br>PS - if you have an extra moment and want to check out their cool Lucent sculpture, you will find it in the lobby located on E Chestnut Street.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/38gU9mPoESnIFWQhY3TpBA/348s.jpg", "caption": "360 Chicago 9/2017"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dKfjCcV7JWKLIWl7EZN1qg/168s.jpg", "caption": "360 Chicago 9/2017"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SpWcC0EDj3-W29UU9H3ndw/168s.jpg", "caption": "360 Chicago 9/2017"}]}}, {"review": {"des": "A breathtaking, incredible, and spectacular view of the great of Mother Nature and the great of the human effort. An unforgettable experience I had here with my friends. Top of the class. A fantastic scene of the Michigan Lake.", "pics": null}}, {"review": {"des": "I had one day after work to explore the city and chose to come here because of the amazing reviews. I am so glad I did because it's absolutely gorgeous. <br><br>I came about 30 minutes before sunset and stayed until it was dark. I'd highly recommend visitors to do the same, so you can see the beautiful transition. There is seating around half of the building where the sunsets. <br><br>There's also a bar that serves food and drinks. Happy hour is for the majority of the day on Tuesday!", "pics": null}}, {"review": {"des": "We had a pretty good time at 360 Chicago.<br>We arrived about an hour before sunset and got a nice spot to view it. To pass some time, we clicked a lot of photos and got gellatos from the bar at the NW corner (if I remember correctly)<br>Also, we tried the Tilt! which I thought was pretty cool!<br><br>After this, we sat watching the Navy Pier and waited for the fireworks. It was pretty good show. Visit to 360 Chicago was worth every penny.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0fheT3maAlPP-BASxbXBIw/348s.jpg", "caption": "Sunset"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rVZr8k35-jbHckKg9C789g/168s.jpg", "caption": "Navy Pier"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yuNIv-Bq5d1Yar2_Ahh71w/168s.jpg", "caption": "Oak Street Beach"}]}}, {"review": {"des": "This was fun! Incredible views of the city. We did the Tilt too! Tilt was well worth it. I rarely buy the photos from places like this but they seemed reasonable and you can't take your own photo on the tilt. The view of the lake is unbelievable. They have interactive maps that tell you what are you looking at each direction. Definitely worth getting up this high and literally walking around the building  to see all over the city and lake.", "pics": null}}, {"review": {"des": "Breathtaking views!!! So worth the ride up. I'm not going to lie, the elevator was a bit shaky. It wasn't as crowded as the Sky deck. The views were magnificent. My daughter did the Tilt. It looked scary. She loved it.", "pics": null}}, {"review": {"des": "On their website and I quote : '360 chicago is proud to present tilt - the thrilling new attraction that will forever change the way visitors see chicago.'<br><br>Remember as a kid when grown-ups would exaggerate and romanticize tall tales? The 360 chicago tilt is a purposeful idiom. I get itchy when they refer the ride to be THRILLING. It's a tourist snare!", "pics": null}}, {"review": {"des": "Compared to OUE Skyspace in Los Angeles, 360 Chicago takes the cake. At least for me. I thoroughly enjoyed my time here and would gladly come back again. <br><br>Price comparison: OUE Skyspace is $25 for general admission and $33 for the skyslide vs. 360 Chicago's prices of $20 general admission and $27 for the Tilt. Slight edge goes to Chicago. To boot, I thought Tilt was WAY better and more enjoyable than LA's skyslide.<br><br>Height comparison: Skyspace LA is on floors 69 and 70 vs. 360 Chicago located on the 94th floor! Assuming floor heights are the same, Chicago has them on this one.<br><br>Views: 360 Chicago boasts magnificent 360 degrees views of the city skyline and Lake Michigan. It is breathtaking. Chicago is an extremely beautiful city, with a lot of interesting things to look at. The view from 360 Chicago is hands down better than Skyspace LA. I love LA, but Chicago has them beat in terms of beauty.<br><br>Views aside, 360 Chicago features a pretty decent gift shop and a full bar + cafe! The sign for TILT says, \"Nervous? Get tipsy before you TILT\". I thought it was pretty cool. 360 Chicago also had a magician doing a show while I was there in one of the corners, but to be honest, my eyes were glued to the views. This is a 5-star observation deck, no doubt. Go ahead and check this place out! It can be educational too.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BRJurIZpKERoKw5acyrl5w/348s.jpg", "caption": "One last picture... great view!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/e9tGeGLtB3aCn2xTw0Nr-w/168s.jpg", "caption": "Info"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/phhWTGVLLT2j7UDMwQPN8Q/168s.jpg", "caption": "Info"}]}}, {"review": {"des": "We checked the website at 3:30 to make sure it was open, because it was the last stop on our trip and it was open latest.  After one hour commute by train and bus, arrive to a sign that says \"closing at 3:30 for private event.\" Not sure how hard it would have been to post on website, but fortunately there was a Cheesecake Factory in the same building.<br><br>Update: thank you for looking into our concern. We will be sure to visit this location on our next trip to Chicago.", "pics": null}}, {"review": {"des": "I LOVED 360 Chicago.  I had a few cocktails, snapped some selfies, then tried Tilt.  Must see and must try.  It was a fun activity.", "pics": null}}, {"review": {"des": "Very one of a kind experience. The view of the city from this high up is astonishing, all the buildings can be seen at night it is incredible. A bar is available at the floor if you just want to spend sometime on the floor. For 7 dollars you can ride the tilt which is totally worth it. The glass stretches out of the building much further than what you would expect", "pics": null}}, {"review": {"des": "ONE WORD -- TILT! I chose this as 1 of 3 attractions after the great reviews and comments on the Chicago Explorer Pass found on Groupon! Adventurous people we are....yep, yep!! Lets do it.....<br><br>...360 was much hype, from what we witnessed!! Why? It had all amenities of a must SEE; Crowded, Long Lines and Mini-people in Strollers to Shoulder toppers! But oh so Worth it, Worth it!! <br><br>And speaking of long-lines; I Strongly recommend not BUYing your tickets last MINute for this Attraction.....Here's the Visual -- You will be waiting in a LOOONNNGGG LINE; 3-5hrs says my girlfriend I ran into.....told her about My Orange Go City Card I purchased on Groupon!!.....Win for sure!!<br><br>Our line was Only 1hr....it moved along pretty quick so it really didn't feel like we waited long.....what was also nice about the line-waiting were the Muriels of my 'Favorite Summer City' along the wall; absolutely brilliant!! Even entertained while we waited; Parents convincing kids its not that high up and no jumping when we get up there! Really, you mean the stufff they were doing in Line....Weren't they Hopeful?!  Gotta love it!<br><br>The \"CITY HIGHS\" was Breath-taking; we chose the Lake Michigan view and After my battery died on my phone!! Just wrong, I couldn't take photo's! But I promise, promise you it was ONE great View!!<br><br>Here's an extra Plus'ful bonus...360 has a City 'Fast' Pass entry card you can purchase that will Grant you Front of the LINE perks...true Story!!  You know the one you buy --  when you go to the Amazement park! Front Line privileges is what it should be called....till next time!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CFL029a5xVbVZ5QejMtS-g/348s.jpg", "caption": "....Wrigley Field!!.....to be my next Attraction."}]}}, {"review": {"des": "Pricey but wonderful view. And unlike other observation sites on top of tall buildings in Chicago, this one does an excellent job on limiting the number of people on the observation floor, so it is real easy to take pictures facing in all directions.<br><br>One unique aspect, is the 360 Chicago has one part of the viewing platform with just screens, no glass windows. So those of us that carry around thermal imaging camera, can take heat signature videos of the Chicago skyline.", "pics": null}}, {"review": {"des": "I found 360 Chicago atop the John Hancock Tower to be a more pleasant experience than the Willis Tower Skydeck if only because I found that it wasn't as crowded, and the 360 views allowed me to appreciate the entire skyline (and the lakefront) instead of towering amidst it like at the Willis Tower.<br><br>These days, they've added a gimmicky \"Tilt\" feature to compete with the glass \"boxes\" at the Willis Tower Skydeck. If you're really into touristy thrills, it's a bank of windows that projects and leans away from the building, allowing you to confront your fear of heights head-on. I did without it and found the pleasant views to be good enough.", "pics": null}}, {"review": {"des": "Being able to roam around the observation deck with a cocktail in hand taking in the incredible views is unmatched in the city. You'll pay for the experience as drinks aren't cheap, but I'm sure neither is the rent the bar pays to be up there lol. Be sure to try TILT. It doesn't last long, but the experience will be with you forever. A \"must do\" place to visit in Chicago.", "pics": null}}, {"review": {"des": "Came here on a winter weekday as part of my Chicago Explorer Pass. To enter, go down the stairs outside of the Hancock tower by Cheesecake Factory. There were only about 30-40 people in all so we had the view all to ourselves. Giving 5-stars in comparison to the Sky Deck. I personally think the 360 Chicago is way more worth it and a lot more enjoyable. Floor-ceiling glass windows are kept clean allowing a clear view of Chicagoland. There's a part I call the 'sauna seating' which I thought was a lovely area to sit still and enjoy the view (again, it wasn't crowded that day so we afforded to sit quietly for a while). Was not able to try to tilt because I was still pregnant at the time of visit but I can come back just for that. It's an additional $7 which you can pay for at the booth close enough to the elevator when you get to the top.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aMiwXIvvep9X7HjVdr0uwQ/348s.jpg", "caption": "Beautiful Chicago"}]}}, {"review": {"des": "On our trip to Chicago, my girlfriend and I decided to visit the John Hancock Center because I heard the views were much better than the Willis Tower.<br><br>We had purchased the GoChicago card prior to visiting, so we skipped the ticket line (there wasn't much of one) and within 5 minutes we were in the elevator and reached the observatory level.<br><br>It wasn't very crowded at all which I'm assuming is because it was December. Our first view was towards the East side and the rush I felt looking at the buildings and Lake Michigan was amazing.<br><br>Unfortunately there was a private event that was happening on the north view of the observatory but luckily we viewed the city from that angle before the event started.<br><br>We also experienced Tilt, which is their famous attraction that tilts you down, overlooking the buildings below you. The line was a little long for the attraction, but it goes by quick. I personally didn't enjoy it too much, but that's because I'm an adrenaline junkie and it takes a lot for me to feel a thrill. For the average person, it's definitely worth trying however.<br><br>The best way and time to experience this is about 30 minutes before sunset. That way you get to view the Chicago skyline during the day, sunset and night. We arrived an hour before sunset but it was well worth the wait to see it during the night.<br><br>We did not get a chance to visit the Willis Tower and Skydeck, so I'm not able to compare the two. The experience was incredible and would recommend this to anyone who wants to relax and enjoy the beautiful skyline.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DOrfsS61VYqMK1Xhb0wA9Q/348s.jpg", "caption": "Chicago Skyline during sunset"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9iq1X8v5VGROxTKMYi7bQw/168s.jpg", "caption": "Chicago Skyline during the day"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xJ4wZx4rJ3_2Bh9_ABfoYA/168s.jpg", "caption": "Chicago Skyline at night"}]}}, {"review": {"des": "Definitely visit if your in town. Be prepared to wait tho. Took a hour and a half to get upstairs. At least they have Chicago history on the walls and videos as you want so time goes by a little faster. Only problem was online it says you can by just tickets for Tilt but when you get there they tell you that you have to buy tickets for the observatory. $20+ for observatory & $7 for Tilt. Cheaper to buy it online. You get about 10% off. But my favorite part was the Tilt. Beautiful view of the south side of Chicago which has the best skyline. Tilt is probably only about 30 to 45 second ( whoever created this is a very smart rich person lol ) but its cool. After you go on Tilt & see your life flash before your eye, you can have a drink at the bar that's facing the north side.", "pics": null}}, {"review": {"des": "So I've been into architecture since I was in my teens. Naturally I was drawn to Chicago. I used to read all the books I could about Chicago architecture. When I come to Chicago right at the top of my list, even moreso than trying delicious food, is seeing all the unique architecture that distinguishes Chicago from every other city.<br><br>360 Chicago is a great way to see all Chicago has to offer architecturally. You get some of the best views in the city. On a clear and sunny day you can see for miles and miles. I bought the Sun & Stars ticket for $25. It allowed you to visit twice. The lines here are a lot more manageable than at Willis Tower. When I went around lunchtime it took about 35 mins to get up to the observation deck. I came back around 7pm and hardly anyone was there. I was up on the observation deck in less than 10 mins.<br><br>Once up on the 94th floor observation deck you can walk anywhere on the floor to see all the views. Of course the South view is the best as you can see all of River North, the Magnificent Mile, Lake Michigan, and the Loop. They even have a bar on the observation deck. On the west side they have a large seating area which is great for those tired from all the walking you do in Chicago.<br><br>The staff was a little short-handed when I went on a Wednesday. Not sure if this is how they normally staff during the week. They only had one person at the register taking payment for tickets. One person checking bags, one person taking the mandatory picture that they want you to purchase, and one person scanning your ticket. It was fine for me but I can see why other people would get frustrated. The line could move so much quicker with more staffing. Overall I loved 360 Chicago! Can't beat going up there twice for $25. Money well spent on some of the best pictures you can take while in Chicago!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5rM2UgUEFT8PyKtLFY5JKQ/348s.jpg", "caption": "$25 for Sun and Stars ticket"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Lr6f2pfcdVucZWxAIr_4kg/168s.jpg", "caption": "No line at night"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ule-OUY2ZHEfQRyVSmkQ0w/168s.jpg", "caption": "#360chicago"}]}}, {"review": {"des": "Would recommend getting up there after sunset it is a whole different experience. <br><br>I liked the tilt thing not a big deal basically the glads wall tilts outwards like 30 degrees that is it. I paid 8$ extra for the tilt and you need to book its time in advance but I was hours late but stil they left me in!", "pics": null}}, {"review": {"des": "So. Much. Fun! <br><br>Date: A COLD January Monday<br>Time: Arrived around 12:45 p.m.<br>Access: Go City Card via Groupon<br>Crowd: Pretty thin<br><br>The MLK holiday/weekday definitely assisted with the low people count. <br><br>If you purchase a Chicago Go City Pass, you can bypass a crowded line. My electronic pass was scanned and I was on my way! Team members did warn waiting for The elevators could create a 30-minute queue time.<br><br> The route is definitely similar to an indoor amusement park, with several roped off areas created to counter long lines to the various elevators.<br><br>There were at least 3 elevator changes to get to floor 103, so be prepared for a bit of in-and-out, as well as ear popping/clogging.<br><br>You'll get a panoramic view of the city and a bordering state. The option to take pictures in the clear, hovering box adjacent to the building is also available. <br><br>The customer service representatives were pretty patient regarding people with antsy or scared kids, as well as people trying to get that perfect angle, even at camera snap number 75. <br><br>There were samples of fudge (I recommend the Maple) as we exited the elevators and entered the souvenir shop (I wish the souvenirs were more affordable). <br><br>If you're visiting the city, or are a local, it's definitely to-do list worthy!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VreFyBUXXb15Y19qyKwytA/348s.jpg", "caption": "City view after snow 3"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uCeCK2-HJoXvGyfFmW5FcA/168s.jpg", "caption": "City view after snow 2"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pHMryWppMFE8aYA_WEmaXg/168s.jpg", "caption": "City view after snow"}]}}, {"review": {"des": "360 was 1 attraction I opted to visit using my Smart Destinations Go Chicago card. Views from the observation deck are amazing, and as the name states, they really are 360° views of the city.<br><br>Despite using my pass on a Saturday afternoon around dusk, it wasn't as busy as I had expected, and queues for the observation deck were quite short. Was in and up to the observation deck within 10 minutes, and I spent a good hour up there checking out Chicago from all points on the observation deck.<br><br>Worth a visit if you're in Chicago and have limited time.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lfx5g3YjufpqqoLK6wteMA/348s.jpg", "caption": "Towards the west"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/v-W1BqK1vUGbQiJbxPWl_g/168s.jpg", "caption": "The pier"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Si18dmgvfpKUIeMUycwdLQ/168s.jpg", "caption": "Towards the south"}]}}, {"review": {"des": "360 Chicago is really something that takes your breath away. It isn't everyday where you get to see yourself on top of the world, but here I was rising above what I thought could be real. Although a scenery like this is spectacular, it diea down quickly and that is where the price of this experience conflicts. The time of your amazement doesn't last long enough to compensate for what I believe to be around $20. It just blew my mind how ripped off I felt, but oh well.....new experience.", "pics": null}}, {"review": {"des": "This was a decent experience. This is not my favorite. <br>It is pricy, we also didn't get to spend a lot of time here. If you go I would plan to have a minimum of an hour to spend on the observation decks. <br><br>I honestly felt dizzy the majority of the time I was up there.<br>I am not afraid of heights but made this a not so pleasant experience for me personally. I think my groups biggest downfall though was we only spent about a half hour maybe 45 minutes here. This excursion needs an hour minimum <br><br>hope you all enjoy the beautiful views and have a better experience then me", "pics": null}}, {"review": {"des": "As a first time visitor to Chicago, all I knew is that I HAD to visit the BEAN, Skydeck ledge, and TILT. Unfortunately you can't experience TILT unless you purchase a ticket for 360 Chicago. It's a bit pricey but experiencing TILT was worth it (again especially for a first timer).<br><br>360 Chicago is on the 94th floor and is in the same building as the Signature 95th dining floor. The overall experience was alright. And the reason I say this is because Skydeck is on the 103rd floor and has just as an amazing view to Chicago 360 and there isn't a glare when you take photos because of the Skydeck ledge. <br><br>The staff were overall really friendly and the wait isn't that long. So my recommendation is this: if you KNOW you are NOT going to go on the TILT, I would recommend buying a ticket for the Skydeck instead. Both attractions are both pretty pricey so if you had to choose ONE then Skydeck is the way. <br><br>BUT if you are a first time visitor like me and want to check out the TILT, then you might as well enjoy the bar and view of 360 Chicago.", "pics": null}}, {"review": {"des": "Get over your fear of heights. Just don't look down. My 19 year old daughter and I took on the TiLT. The day was ideal- blue sketch great visibility, and NO crowd. We arrived @5pm, took the gratuitous photos and selfies, then headed for the TILT ( additional $7 pp) TIP: Photo taking is not permitted inside the tilt booth. If you want videos or photos of the experience without paying for the \"professional copy \"then have someone film from outside the booth and take turns. We took in a snack at the bar which has a very limited menu. There was a DJ playing as the sun was setting. I only wish the DJ were playing classical music instead of rap or contemporary.<br>$30 well spent to take in the beautiful view. If it's hazy or overcast, don't waste your money.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iRUu0XhMQFnuRBCtDdQ00Q/348s.jpg", "caption": "One of the views taken close to sunset at 360"}]}}, {"review": {"des": "Amazing view of the city from up here!  Came here Saturday evening and the view was breathtaking.  My friends and I had gone to the Skydeck earlier in the day and had a bad experience waiting in lines everywhere there--360 Chicago was a breeze to get through security and the ticket line!  Now I must warn that it is really high up there, so avoid if you have a fear of heights.<br><br>This observatory was nice--they even had Halloween décor throughout the place--super cute.  It wasn't too packed so you had many opportunities to get your pictures/videos of the view.  They also have a \"Tilt\" addition that you get to experience ($7)--you stand against a railing facing towards the window, and the whole window panel basically tilts outward so your body starts tilting downward--through the clear glass, you see the city below you!  It's super neat--from afar it doesn't seem like the angle of the tilt is much, but while you are the one physically there, it seems a bit more than you expect. (Tip: If you're indecisive about whether or not you want to do the Tilt, you are able to purchase tickets once you get up there.)  You can't take your own pictures or videos while doing the Tilt, so make sure you get someone to record you.<br><br>And....there's a liquor bar!!  Major plus.", "pics": null}}, {"review": {"des": "I went to this observatory & the Willis Tower.  Both views were amazing, but I just found this one to be less busy.  <br><br>Adult admission is $18.45 (with a 10% discount when you purchase online).  This excludes the Tilt Experience which is $7 I believe.  But I say skip the Tilt because although it looks super cool on social media & sounds cool, I did not think it looked that exciting.  Yes, you do tilt at a tiny angle but it is only for a minute or less & you tilt back.  I always assumed it was a drastic angle but no.<br><br>Great view of Chicago & many interactive spots where you can learn more about the surrounding landmarks.", "pics": null}}, {"review": {"des": "I highly recommend taking your out of town guest to the Hancock building to see Chicago from the 94th floor. A must see attraction. <br>Below the building is a Cheesecake Factory, grab a bite to eat.", "pics": null}}, {"review": {"des": "My last trip to Chicago I made sure to visit Willis Tower and get a glimpse of the glass floor which was pretty neat, similar to the tower in Toronto. This time around \" The John Hancock\" was on my to do list so strategically I went around 6:30 to catch daylight, sundown, and the night view. Best time to go so make sure it's a \"3 in 1\"......The line was pretty quick and we walked right in as I bought tickets before hand. The elevator ride was smooth and quiet and under 1 min. The views are immaculate, you pretty much get to see all of Chicago from a 360 view, I prefer the views better then Willis. Plus you have the option to do the Tilt which I did not have the Balls for......Ticket prices are a bit steep so make sure you look for a discount. Well worth it, btw they have a bar upstairs so you could grab a drink and chill with views.", "pics": null}}, {"review": {"des": "Me: A tourist from California<br><br>Bar: crowded, slow service <br>Atmosphere: spacious but very small <br>Parking: metered all around <br>Tilt: $7, its worth a one time try, wish it was a full 45 degree tilt instead<br><br>Pros: great aerial view <br>Cons: crowded<br><br>Overall: for $21, it's worth it. I wish the elevator had a glass view of us going up. It's very crowded but I feel like it's better than Willis Tower if you are single and going with family. The view is spectacular compared to Willis. It is also cheaper than places such as the Seattle space needle, San Francisco's transAmerica, NYC Empire State Building, etc <br><br>Grade: B+", "pics": null}}, {"review": {"des": "It's also known as the John Hancock Tower. It's a great place to watch the sunset, there's a good amount of seating for a good view where the sun sets. They have a bar for drinks. They even have a really big jenga to play with. I went on a Thursday and there was a DJ and I enjoyed the music he played, just wish he didn't have to stop playing so early. I rode the TILT ride for $7. It's a short ride and a little scary, just sucks you can't take pictures or record video while you're on the ride. The TILT ride does not come with the Chicago City Pass.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/C5itVnsvLtjF9dgXYd_Mdw/348s.jpg", "caption": "sunset"}]}}, {"review": {"des": "A great way to experience the city! The views are really beautiful and we made sort of a game out of how many rooftop pools we could count from where we were standing. We opted not to partake in the TILT experience, but yknow, I'm sure its cool. Only complaint is the rickety elevator ride to and from the 94th floor. They say the elevator travels almost 2 floors per second, but I'd honestly settle for a slower trip if it meant a steadier ride!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iZrBjyJ9kjb6EwWKENVbiA/348s.jpg", "caption": "Standing in front of the windows"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DbS5tYugneNRe9zdwa-QOw/168s.jpg", "caption": "City view"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cV04j5g2IalghbudYr0Cqw/168s.jpg", "caption": "City view"}]}}, {"review": {"des": "Great experience! To see a view of all the buildings and the waterfront is what every tourist should do. The package to enter and a drink is about $28, to experience the tilt is $7, and to get pictures of your tilt experience is $25. It is pricey but it is a once in a life time experience. The prettiest time to go in during sunset. The staff were nice and there's a good amount of seats. There is a souvenir shop and snack station.", "pics": null}}, {"review": {"des": "Pretty nice view on the 94th floor. It's 20.50 for one adult admission ticket and to experience tilt is 7.00 extra.<br><br>It would be better if I knew what everything was and what buildings I'm looking at. The buildings reminded me of New York or Los Angeles observatory. I was not sure which side was Lake Michigan. I did recognize the Ferris wheel was the very first one in USA. You can stay looking at the view as long as you would like I believe.<br><br>The line was long.", "pics": null}}, {"review": {"des": "Fun tourist trap which offers great views of the city. It's a little pricy, at $21 per adult, but if you opt for the drink & a view package, you can get a cheap cocktail while you sightsee. <br><br>I had fun with the Tilt, and I think it's worth the upcharge if you've not done something similar before.<br><br>Next time I'm in town, I think I'll opt for the dinner one floor higher instead.", "pics": null}}, {"review": {"des": "Fantastic place to go after dinner. <br><br>First and foremost, they have a full bar up top and you can walk around the whole floor carrying your drink. that made it for me.<br><br>Then you can see the sun set, the fireworks over the lake, the long straight midwest roads reaching out to the horizon....<br><br>And then the TILT ride is pretty awesome. For $7 a ride, we ended up going twice.<br><br>Definitely recommend a visit if you are being a tourist in Chicago", "pics": null}}, {"review": {"des": "Aside from the Willis Tower, another attraction that is worth going to see a bird's eye view of the city is 360 Chicago atop the John Hancock observatory. <br><br>The day we went, it was overcast, as earlier in the day it was raining off and on, and days prior it was snowing. Knowing the fact, we headed over to 360 Chicago anyway around 4pm. The guy in the front warned us before going up that we might not be able to see anything because of the overcast. He said to try to come back later at night. We was bummed, but everything turned out well.<br><br>In my previous review of the Willis Tower, I've mentioned about getting a \"Go City\" Chicago pass card. That way you enter a different, faster, and shorter line. Same thing goes for 360 Chicago. I'll just leave that there. If you want to know more about it, Google it.<br><br>So we come back around 9pm and the skies are clear. So things happen for a reason, and turned out, the city view of Chicago at night was magnificent! Some of the rewarding views are the lights and Chicago city skyline, The Navy Pier, Lincoln Park, and Lake Michigan. <br><br>In addition to the views at the top, there is another attraction which is called \"Tilt\". Tilt is an attraction where you step on the edge of a glass window and it tilts you down to get another perspective view  straight down. Mainly for the extra thrill. Tilt charges a separate fee, and if you got the Go City pass, Tilt is not included in the admission. There is a desk where you can purchase tickets on the top floor. If I am not mistaken it was 15 for adult and 10 for child. Tilt was an awesome experience. They tilt you about 4-5 times and with each time being a steeper tilt! It was more fun than scary. I would recommend just for the experience!<br><br>In my opinion, I like 360 Chicago Observatory better that the Willis Tower because of the better view and also the added feature, the \"Tilt\". And there is also a bar at the very top! How convenient and refreshing!<br><br>360 Chicago is another \"must go\" attraction when visiting Chicago. And don't forget to get your TILT on!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8wjAAH42AmXlkP2ytBmBTA/348s.jpg", "caption": "Nooooo! I wasn't ready!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WGTUWOAdG7upPsjE7UOMDA/168s.jpg", "caption": "About to be Tilted!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WygqWoBBxP8-08XPT1tAcQ/168s.jpg", "caption": "The View"}]}}, {"review": {"des": "Great aerial view of Chicago. It's darn near like a club there. They offer drinks, snacks, food, a DJ. I didn't do the Tilt but my gf did and she said it was cool. It looked too quick for me (it lasts only 30-50 seconds) but I won't judge since I opted not to pay the extra $8 to do it. I went during the day, and I'm sure it looks just as great at night. Chicago has one of the best skylines so it was nice to see it from such a high viewing. The place also offers artifacts and a merchandise stand there. It costs $23 a person for general admission. I think it's more a $20 type thing but that's just me picking at straws. They offer a fastpass but it certainly wasn't needed on my visit as there wasn't a long line at all when I went. I may have been lucky though, I'm sure there are some days where the line is super long.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oknf8hpDaahzCv8rb9CAWw/168s.jpg", "caption": "Tilt"}]}}, {"review": {"des": "A beautiful view of the city from the 360 Chicago experience.  I came early in the day and there wasn't a lot of window traffic, so I was able to get lots of great pictures.  I also came on a rare day when it wasn't raining or cloudy, and was able to see quite far into the distance.  Lots of room to walk around and sit while I enjoyed the view.  There is a special section that you can go in to which has a screen window, and you can feel the wind and cold on your face.  I also took part in the Tilt experience, which will be reviewed on it's own page, but which was worth the extra $ to be dangled out over the side of the building.", "pics": null}}, {"review": {"des": "It's a long line to purchase tickets to get up here and another line to go up the elevator but once you're up there, you're free to roam around everywhere -- each side provides a different view of Chicago (east, west, north, south). The elevator takes your up to the 94th floor which is pretty high and there is plenty of space on the whole floor to walk around and admire the views. I took pictures out of each side and went on the tilt ride. This is a very touristy spot so be prepared to pay for everything -- it costs about $20 to go up, another $7 for the tilt ride, and there is a souvenir shop situated upstairs where they sell Chicago souvenirs such as T-shirt's, pictures of the skyline, keychains, mugs, magnets, etc. Overall, I would definitely recommend coming up here if you haven't been up here before since it does provide very nice views of the city but I probably wouldn't want to spend any additional money on anything else. I would also suggest buying tickets online in order to skip the ridiculously long line at the bottom to purchase tickets.", "pics": null}}, {"review": {"des": "We purchased the GO CHICAGO card which allows you \"unlimited\" attractions for a set price. I highly recommend using this if you want to get the best bang for your buck! <br><br>This is definitely one of my favorite attractions in Chicago! Like other yelpers have mentioned, I like this place better than the Sky Deck. The crowds here were much smaller and there was ample room to walk around. The views here are incredible! The lake totally looks like an ocean and you actually get to see how humongous Lake Michigan is! There are also these little kiosk where you can take a picture via web cam and email yourself \"postcards\" for free. <br><br>The TILT attraction was only $7 and worth it.<br>It's not really a \"ride\" but when you initially tilt forwars you do feel that \"thrill\" for a few seconds and kind of get over it lol.<br><br>BTW There's a Starbucks downstairs", "pics": null}}, {"review": {"des": "We bought a Go City Pass n this is one of the attractions to choose from...It was raining n the staff told us there was zero visibility, but since we were leaving Chicago that day, we decided to go up anyways...The interactive map was really informative n I got to take a nap on the 94th floor of the John Hancock building...Haha lol :)", "pics": null}}, {"review": {"des": "Order tickets online at <a href=\"/redir?url=http%3A%2F%2Fwww.360chicago.com%2F&s=bb1157522befbcab3f1f7e99c13fcb9effb33760846cf0f92652501cdf2bad1d\" target=\"_blank\" rel=\"nofollow\">360chicago.com</a> and save 10%.<br><br>360 Chicago, formerly known as the John Hancock Observatory, is located on the 94th floor of the John Hancock Center, which is conveniently situated on The Magnificent Mile in Chicago's Near North Side. It's the less busy alternative to Willis (Sears) Tower's Skydeck, located south (across the river) in the Loop. I haven't been to Skydeck, but my friends who have been to both Skydeck and 360 Chicago think 360 Chicago is better because the views are just as spectacular yet it's not nearly as crowded. The only reason I chose this place over Skydeck is because we were already on the Mag Mile and could just walk to the John Hancock Center instead of taking an Uber/Lyft to Willis Tower.<br><br>A couple other differences between 360 Chicago and Skydeck:<br>- 360 Chicago has shorter wait times<br>- 360 Chicago has more floor space<br>- 360 Chicago has a coffee shop that serves alcohol<br><br>360 Chicago also has an attraction called TILT, which costs an additional $7. In TILT, you walk up to these floor-to-ceiling glass windows, hold on to some handlebars, and the windows tilt out at a 30-degree angle over the city (facing south).<br><br>The vistas are amazing. Facing south, you're hit with the Chicago city skyline and its beautiful architecture. You can see straight down the Mag Mile. Facing east is Navy Pier and Lake Michigan. North, you can see more skyline, Oak Street Beach, North Avenue Beach, and the lakefront go into the distance. West is where the sun sets and we actually stuck around to watch the sunset. They have special seating at the westward-facing windows for this very reason. There are also educational, interactive touch displays found throughout the space.<br><br>We paid $20 per person (tax included) for admission. Like lots of tourist attractions, they take your picture on your way in and then try to sell it to you on your way out for $20+. The elevator to 360 Chicago is actually one of the fastest elevators in the world at 20.5 miles per hour top speed. According to this Business Insider article (<a href=\"/redir?url=http%3A%2F%2Fwww.businessinsider.com%2Fthe-8-fastest-elevators-in-the-world-2013-1&s=79a4596c277e07f39f2d9c9679791ad0f2f2af471d37d6fdacf96dd1cb583122\" target=\"_blank\" rel=\"nofollow\">businessinsider.com/the-…</a>), it's the 4th fastest elevator in the world.<br><br>There are gift shops both upstairs at 360 Chicago and downstairs when you exit. I purchased a souvenir Chicago magnet for $6.60. My friend used one of those penny pressing machines to created elongated souvenir coins for everyone in our group. Some had the 360 Chicago logo while others had the TILT logo.<br><br>At $20 per person, I think 360 Chicago is worth it for anyone who's never been before.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6LUKYdyNHJ7KUOfd0XvN5g/348s.jpg", "caption": "Southbound view."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Nm7xjgeDxnjqZIglAgPHpQ/168s.jpg", "caption": "Southbound view."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/48opJk6DSwnD208NynRD6g/168s.jpg", "caption": "The Tilt. 30 degree tilt over the city from 94 stories high."}]}}, {"review": {"des": "This is a nice location especially for tourist. You can view chicago from the south north east and west sides. The view is what you pay for, but you know that you can get the same view with a nice lunch or dinner in the bar or restaurant above. They even offer an interactive ride for $7.00 more. It was a pretty scary ride for me, but everyone seemed to enjoy tilting with a feeling of falling down at a high altitude. It seemed normal to many. They have a mini gift shop and a bar/ snack area. There are several benches and seat sections. There is a lot of room. I think it would be great if they had more restrooms 3 stalls in the woman's bathroom. Based on the capacity of visitors I'm surprised they aren't violating zoning regulations. It's a nice experience. I recommend.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rM8ipBfO0wYXE0mqVdHtkQ/168s.jpg", "caption": "My turf"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kc7XOnxkVC4oUJaEev1p8Q/168s.jpg", "caption": "Hmmmm is that right?"}]}}, {"review": {"des": "I prefer this place over Skydeck at Sears Tower.  First of all, there are a lot less people, which means you can actually get nice shots of Chicago without pushing past people or people being in the way.  Secondly, the view here is so much better in my opinion.  It's right by the lakefront which makes for beautiful views of Lake Michigan and the city.  Third, there's a full bar at the top!  I sipped a drink while enjoying the spectacular view.<br><br>I only got to come here during the day, and not at night, but it was absolutely beautiful during the day still.  I stayed up here for way longer than I did at Sears Tower actually looking at the view.  Would definitely recommend!", "pics": null}}, {"review": {"des": "We came here on a Monday night, and there weren't that many people at all so i definitely recommend consider coming on a weeknight to avoid all the crowds. The place offers a nice 360 view of the city so the skyline changes from each window side that you're facing. However, just be aware that there were a few photographers with their camera set up when we went so they took up some of the really good spots to take the best pictures. Another thing I have to mention is they have these large screens where you can zoom in and out of the city (similar to the view on Google maps), which is cool but at the same time, they place those screens in the middle of each side. so if you take pictures at night, the brightness from the screen shines really bright in your photos (well if you take a group photo that is lol). They also offer a tilt experience, which I thought was pretty neat but I don't think they offer that attraction late at night so we didn't get to try it. Overall, a pleasant experience.", "pics": null}}, {"review": {"des": "Absolutely amazing, awe-inspiring views of Chicago. <br><br>The line is so much shorter than the Willis Tower. The wait was probably 15-20 minutes to get to the elevator. The elevator was a quick ride up to the top. <br><br>You can definitely see that is not as crowded as the Willis Tower. The views are absolutely gorgeous. You definitely need to soak in the experience and the views. <br><br>A unique thing you can try is the Tilt experience. You basically leaning on one of the windows and the window will actually tilt forward. It feels like you're about to fall off, but you're not. A pretty cool experience. <br><br>Must see and go tourist attraction when you come to Chicago.", "pics": null}}, {"review": {"des": "For us Chicagoans, 360 Chicago will always be the John Hancock Tower.  The iconic tower is located on the northern part of the magnificent mile.<br><br>The entrance is on the lower level of the building. There are signs where to purchase the ticket.  Once I had purchased the ticket, I was directed to the elevator to the observatory deck.  <br>While standing in line, there are additional informational tidbits about the tower.  Once inside the elevator, it takes less than two minutes to reach the deck.  <br><br>Once the elevator doors open, WOW, the views are incredible - able to walk around the entire floor.  For additional funds, you can do the \"Tilt\".  The selection of windows will tilt out 45 degrees.  Great way to see below.  There is also a small lounge for drinks.<br><br>I would highly recommend the 360", "pics": null}}, {"review": {"des": "If you like spending endless hours moving through an endless line through small rooms, then this is the place for you! I felt like I was in some weird social experiment, where they cram 300 strangers into a basement and make them slowly move in circles to see how long it will take until people snap.<br><br>It took close to 3 hours from the time me and my friend got into line until we were able to reach the top of John Hancock<br><br>While the view is gorgeous, it may not be worth your time if you are on a short trip to Chicago. Pretty much everyone around us in line deeply regretted spending their evening waiting in the basement of a tower rather than enjoying the rest of downtown.", "pics": null}}]}