{"name": "3rd-coast-cafe-chicago-3", "reviews": [{"review": {"des": "Can you say fantastic food great service and a huge variety... Well come here.<br><br>Lots of variety and even gluten-free if you need it. We had a wonderful breakfast everything was hot fresh and fast", "pics": null}}, {"review": {"des": "The place appears to be great, when you enter there is a sign to \"seat yourself\". When me and my colleague picked a place to seat, we were immediately approached to switch our seats to a smaller table not 4 people table but 2 people table. While I see where they might be coming from witch such request, if they don't want people picking place they like to seat they should not put a different sign \"wait to be seated\".<br><br>Anyways there were bunch of 2 people groups seating at a larger tables.<br><br>We were hoping it will be our go to place to have breakfast since we are staying at the hotel beside. Sadly to this experience it won't happen now.", "pics": null}}, {"review": {"des": "Different people affect this review. I didn't get their names so I'll be describing them by look. <br><br>We came in around 11:30 on a Sunday, exhausted from doing the hot chocolate 5K/15K event. Walked up to the counter and wrote our names and number of people on a clipboard. There were 3 of us<br><br>After us, another group of 3 walked in. A group of teens who seemed to know one of the waitresses.  Who was Shorter, with brown loose curled hair, skinny. We patiently waited our turn. When we were next to go, this waitress took her friends back, cutting the line ahead of us. Another worker said her name was something like Fiona or Faye, maybe Pearl or Ferle. Idk my hearing was bad. But again she was short, really skinny, with brown shoulder length loose curls.<br><br>Anyway, her behavior was highly inappropriate and rude. Especially in rush hour. My father got up and complained to another worker, who gave his name as Jimmy. He was tall with a man bun. Jimmy was apologetic and got us in next, sitting us at a corner booth usually sitting 6 people. He said he was going to talk to the manager as that behavior is inappropriate. Who knows if he'll actually talk to the manager or not, but he seemed sincere in his apology. <br><br>My mom and I ordered the benedicto eggs Benedict with arugula pesto and prosciutto. I ordered fresh fruit while Mom ordered hash Browns for the side. Dad ordered the plain eggs Benedict. The poached eggs were perfectly cooked and still runny. HATE when a poached egg is cooked through to hard boiled. Fresh fruit was good and actually fresh, not canned. No complaints about the food it all was delicious. Our food came quickly and our waitress, a woman with long dark hair, was friendly and accommodating. <br><br>As a bit of karma, or perhaps thanks to Jimmy, the group of friends who were cut in front of us didn't get their food until way after us. <br><br>Our long dark-haired waitress, the food, and Jimmy saved this from being a bad review. Thanks for making it right. We'd come back. But that waitress with the curly hair who let her friend's cut needs to be reprimanded.", "pics": null}}, {"review": {"des": "What a cute breakfast spot! We stumbled upon this place after we discovered hash hash a go go was closed. We quickly turned to Yelp and figured we would give it a try. Boy am I glad we did! I just loved the entire experience. From the decor to the wait staff to the food, everything was spot on! <br>Everything on the menu sounded amazing but I ended up with the eggs Betty. I love eggs Benedict but sometimes it's too heavy and this option seemed much lighter.  It was so delicious I savored every bite! My husband and mom also loved their meals (I don't remember what they got). In my opinion, if you are looking for a cute delicious breakfast place, this is your spot!", "pics": null}}, {"review": {"des": "A breakfast menu with no frills that always delivers. Never a wait, always lively, and quick service. <br><br>Lattes come in a large beverage mug (German beer mug-style): 4 (unusual cup choice)<br><br>3rd Coast Burger- 4 (greasy, but well done; served on a pretzel bun)<br>Spinach caesar (side with burger): 4<br>Mexican steak and eggs: 4<br><br>Service: 4<br>Ambiance: 4", "pics": null}}, {"review": {"des": "3rd Coast Cafe offers quality food with a great neighborhood feel.I love the vintage air to it, along with great artwork throughout. I could tell that many of the diners here were regulars. I had the coronation chicken salad sandwich which was so delicious! I love curry chicken salad, and this took it to a whole other level. It was so flavorful and perfect on a baguette. I am leery of baguettes because they are sometimes too hard, but this one was fresh with just a bit of crunch. We had great service as well. I particularly enjoyed the cappucini cocktail too. I can definitely see myself as a regular here if I lived nearby and appreciate the diversity of the menu.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/87FjUP080oC1i-NAK_geFg/168s.jpg", "caption": "Cappucini"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/A7QxFq7a3BbxvL7vaHyyYw/168s.jpg", "caption": "Coronation chicken salad sandwich"}]}}, {"review": {"des": "Nice little gem of a breakfast coffee joint.  The breakfast sandwich with ham was excellent.  O ly 4 ingredients and they elevated it to deliciousness.  Thick cut ham, home made tasting soft sourdough, and cheesy cheddar and egg.  The butter on the bread was perfect and toast and cook was spot on.  The price was the major factor in the 5 stars.  If this was over 10$ without a side wouldn't be worth it.<br><br>The home made chocolate chunk cookie was good.  Wasnt too sweet but lots of flavor. Thick pieces or chocolate throughout and soft.", "pics": null}}, {"review": {"des": "Awesome place, there's not a single thing on this menu I don't like. Everything is fresh and very tasty. I would dare to say their bacon is one of the best in the city. And Janet is a sweetheart and a awesome person.", "pics": null}}, {"review": {"des": "Great hidden gem that locals have been going to for years. Comfortable, with great prices for the Gold Coast along with delicious food and daily specials. You'll see people here reading or on the computer drinking coffee and others eating with friends. Our favorite place in the neighborhood!", "pics": null}}, {"review": {"des": "Back to our first love! The place we had our first date! Still as good if not better than the first time, 23 years ago. Started with the hummus and it was good. I ate it so fast I didn't get a pic! Phil had the 3rd Coast Burger with asparagus and I had the soup. Wonderful. Big servings so we're taking some home. And finally, what sealed the deal 23 years ago.....Carrot Cake! Enjoy!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KBnQlU3H12r8QlO9URI77A/348s.jpg", "caption": "Homemade Carrot Cake!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MQrDdnoxsp9-3iusnT6AdA/168s.jpg", "caption": "Gold Coast Big Bowl Chinese Noodle Soup"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/d19kKjzXPoUoiVvIkInDaA/168s.jpg", "caption": "3rd 3rd Coast Burger"}]}}, {"review": {"des": "So nice to find a small cafe off of crowded Rush Street. Food is WONDERFUL. The party I was with had the wild cod, beef tenderloin w/asparagus, diced peppers & tomatoes, garlic ravioli, and, yes, a great grilled cheese & tomato sandwich. They forgot to add the bacon I ordered, but it was so good, I wolfed it down. Great date and small group spot. Wonderful, VERY accommodating staff!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fHmNL3GaMDCxsehWXRJg8g/168s.jpg", "caption": "Great brussel sprouts - not overcooked, just perfect. Steak w/according to my friend, a surprisingly delicious, creamy cheese topping..."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4U3rH8Dxl4IuieAVISBSKA/168s.jpg", "caption": "Beef Tenderlon. Yum..."}]}}, {"review": {"des": "My favorite place for brunch or breakfast in all of Chicago. I always try to stop when in town, and I mean it, I don't mind making an extra trip just to stop.<br>I love everything on their menu but my favorites are the farmers omelet, the built your own eggs breakfast, their side dishes such as fruit bowls or oatmeal, hashbrowns, their mimosas.<br><br>I really like their casual environment with a special emphasis on the old-fashioned cash register that greets you right at the entrance.<br>The bathrooms are really clean, and their staff is very helpful and friendly. I've never experienced this place being empty, it is always crowded, but it doesn't matter the waiting time, as their consistency and the awesomness of their foods is worth the wait.", "pics": null}}, {"review": {"des": "We throughly enjoyed our brunch here ... the service was quick, attentive and food was good. What I like about it is its cosy and welcoming; what I think could be better is the seating which is kinda of tight with not too much room to wiggle . The restrooms were clean and well maintained which always deserves an extra star. Love the large beverage mugs ,only thing my cafe au lait  was not hot ......wish that they pay attention next time , no fun drinking lukewarm coffee :( . Overall good experience , will certainly go back if in the area!!", "pics": null}}, {"review": {"des": "A great place to dine and escape the busy city. You can even get pb&j with bananas on sourdough for breakfast. Delicious! Elvis would be proud. The restaurant is warm and welcoming. Although not too busy on a Monday morning, there were still several groups of locals enjoying their breakfast along with their morning conversations.", "pics": null}}, {"review": {"des": "Cozy brunch spot with great service and great food. Got the House Omelet and loved it; really can't go wrong with eggs, cheese, and ham. Hash browns were really crispy (which I'm not too fond of but I know many people are) and the thick cut multi-grain toast was good albeit thin and burnt ever so slightly on the edges. Pretty extensive menu as well so I'll need to go back sometime to try everything else!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vx-osLY4bK3D2yIzk_YsmA/348s.jpg", "caption": "House omelette"}]}}, {"review": {"des": "We were looking for a casual brunch spot on our trip to Chicago when we saw that this place was just down the street from our hotel. We were immediately greeted when we entered the restaurant and found a spot by the window. The atmosphere felt very down to earth, cozy feeling -- there were many single diners reading the newspaper or a novel while dining. <br><br>I ordered an omelette and the waitress asked if I would like my hash browns extra crispy. I didn't think that was an option but I said sure! When the food came, and I tasted the perfect crunch in my mouth, I knew that extra crispy was the best decision I've made that morning.<br><br>My omelette was delicious and so filling - the portions tend to be on the bigger side, and it's the best bang for your buck. <br><br>I left so satisfied and full and would happily return here next time i find myself in the Windy City!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iwDCeo0eQX2f2oA7Q2dYEw/348s.jpg", "caption": "Delicious veggie omelette"}]}}, {"review": {"des": "I love this neighborhood place. Great for breakfast or lunch...I haven't had dinner here as there are so many choices in the city...but I will sometime. The food selection runs from traditional breakfast dishes to executions with fancier ingredients. Plenty of room so if you don't want to wait for a table at Restoration Hardware, do yourself a huge favor and check this place out. That's how I found it!", "pics": null}}, {"review": {"des": "Decent spot for a bite to eat in the gold coast area. <br>Always consistent on quality. They have a decent selection of wine. I have never been here during dinner time only lunch. I always get the california salad or one of their daily soup that catches my interest. Service has gotten better.", "pics": null}}, {"review": {"des": "Ive been here for brunch probably 5 times and never disappoints. $5 mimosas, cant beat that. I always get the benedicto. Its eggs benedict with pesto hollandaise on a piece of baguette.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aWTf7QG1ZeoWQMthGnEjIA/168s.jpg", "caption": "Florentine benny. Not as good as the other benedicts. The poached egg was very overcooked. I think they had their B squad working saturday."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_UWuT9U5TeAStgc_Yxr-qQ/168s.jpg", "caption": "Perfectly poached eggs on the Benedicto. Already had stsrted eating obviously..."}]}}, {"review": {"des": "Delicious food. Very good sandwiches. I love that they have a drink special for everyday: I'm here on a Tuesday and I got a jumbo margarita for $5!!! It is delicious.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_cuU9wuZLY8o9nbECOa0MA/168s.jpg", "caption": "BLT delishhhh wiry Cesar salad"}]}}, {"review": {"des": "We had brunch here. There was a little wait but that is expected on Sunday. They meal was just ok. With so many great places to eat in Chicago I was underwhelmed with the meal.", "pics": null}}, {"review": {"des": "Uninspiring to say the least. <br>I wanted to like this place, but can't recommend it. <br>Chilequiles were greasy, tomatoes, onions and avacodo lacked flavor. One good thing was the orange juice. Large glass and delicious. <br>The service is also disorganized. <br>I really don't understand why this place has a decent rating on yelp???", "pics": null}}, {"review": {"des": "I love this place for brunch.  I initially stumbled upon it when trying to go to Three Arts but was facing a two hour wait.  Now I come here on purpose.  Basic brunch selections but cooked with care.  Also, I love a place with hot and crunchy shredded hash browns. None of this home fries business!", "pics": null}}, {"review": {"des": "The best breakfast diner food in the city! They have amazing fresh cut hash browns and their blueberry pancakes are delicious. Love the cozy, casual interior. Will be back for those crispy hash browns!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6i6YjYkgAtawH5T_ClxGZg/348s.jpg", "caption": "Pancake (one to split) and omelet"}]}}, {"review": {"des": "Nice little local breakfast place.  Service was very good and the food was too.  The breakfast tacos were excellent.  Lots of locals there and not touristy at all.", "pics": null}}, {"review": {"des": "The greatest bacon egg and cheese sandwich I've ever had in my life (so far). <br><br>I've only been here once and only tried the BEC (as well as part of my Dad's breakfast as we came together). The environment is nice and casual. In particular, they seemed to use an old-fashioned cash register that produced noises after every order--adds nicely to the vibe.<br><br>Anyways like I said the BEC was life-changing. Crisp and thick bacon slices. Savory/fluffy scrambled eggs. A decadent melted cheese. And last but not least a crisp, brownified bread.<br><br>I don't know about the other foods but it must be all good.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Z-Eqpq71P7_qSKCAy5LvAw/348s.jpg", "caption": "The BEC. A gift from the heavens."}]}}, {"review": {"des": "There was nothing really bad or overly awesome that I ate.  I had the Greek omelet with has browns and rye bread.  It was average. The place was sort of hard to find because it is actually in a hotel.  I saw an Eggs Benedict that looked awesome.  Probably should have had that.  Otherwise, I recommend it for a good, filling breakfast.", "pics": null}}, {"review": {"des": "Kind of an upscale location. The food was tasty and service was good, nothing spectacular. Great for a breakfast, studying, lunch, or brunch.", "pics": null}}, {"review": {"des": "BY FAR MY FAVE BREAKFAST IN ALL OF CHI TOWN. <br>The farmers omelet is stellar. The coconut oatmeal is awesome. They have mini scones to go if you want. The mimosa specials on weekend are great. I just can't say enough good things about this place. I have been here totally sober and sweaty from a workout and I have also been here after marathon St. Pat's drinking at 10pm at night still drunk. I just absolutely love the consistency of this place and I'm so sad I no longer live around the block. <br><br>The hashbrowns are perfect please NEVER change them!", "pics": null}}, {"review": {"des": "Love this quiet little gem!<br><br>This history, atmosphere, service and good food make this a go to place in the Gold Coast neighborhood. Breakfast, lunch, dinner, coffee or cocktails - you won't be disappointed. <br><br>As you walk into this vintage room, the history can be felt. Local artist's have their talent on display for purchase. <br><br>Service has always been top notch on every visit. They know the menu and offer great suggestions. Helpful and polite are always a nice combo!<br><br>Homemade food and fantastic lattes always satisfy my taste buds. I've had omelettes, soup, salads and sandwiches. Never disappointed. <br><br>If you are looking for a quaint neighborhood spot that isn't trendy or a tourist trap - this is the place for you! Sometimes they have live music and drink specials. <br><br>A very walkable neighborhood with decent street and garage parking options.", "pics": null}}, {"review": {"des": "It seems to be the new trend to serve poached or over-medium eggs raw. My eggs were so undercooked half were lost to the plate This is expected with yolks, of course, but whites too? I ordered the eggs Benedict and was half appeased by a separate poached egg that I could actually eat. If the egg whites are completely transparent, you shouldn't even bother putting it on the table.", "pics": null}}, {"review": {"des": "If I know one anything about weddings, it's that you end up waiting a long time to eat. We decided to be proactive and stuff our faces before we headed to the nuptials. <br><br>If you are staying at Hotel Indigo, I would definitely recommend 3rd Coast Cafe for breakfast as it is only a few doors down. We were fortunate to be able to snag a table for two on a busy Saturday morning with no wait! Take a moment to look around as well as local artists have their art on display and for sale. <br><br>I had the Greek Omelet (baby spinach, tomato, and feta cheese) with egg whites. ($1.50 extra). I substituted the hash browns for fruit and chose marble rye for my toast. The portion was HUGE and delicious. I only wish that you did not have to specifically request olives. I forgot and I was bummed out when my omelet arrived sans olives. Most Greek omelets come with olives unless you request to NOT have them, not the other way around. Weird. <br><br>He had the Pulled Pork Hash which, again, was a huge portion. He said it was very good, albeit very spicy! Keep that in mind if you order it! It came with two eggs and toast. <br><br>We split a Mimosa and that was delicious. <br><br>Our waitress was MIA for the most part so minus one star for that. It took forever to get the check and I never got a refill. The food was good though and that's the most important thing!", "pics": null}}, {"review": {"des": "Such a quaint, charming restaurant in the Gold Coast. The menu was pretty typical American brunch. If you like some heat order the Mexican omelet, if you have a sweet tooth don't kid yourself and just order the stuffed French toast, it will delight you in so many ways (hidden brie cheese!). <br>I do not recommend the Chai tea as it comes out like an overly sweet milkshake, now I know. I'll be back soon to try dinner.", "pics": null}}, {"review": {"des": "I have been coming here weekly for 10 years; such a great place- tasty food at reasonable prices, great wait staff and an active, involved owner.  My friend moved into the neighborhood 10 years ago and our tradition is to come here every Friday night.  Lately, we have also been ordering food for pick-up, which is great, too.  <br><br>It has a vibe of \"Cheers\" where everybody knows your name.  Sylvia, Sadot know us; the bus men are not only efficient but they are very friendly and welcoming.  The owner also walks around and talks w the customers.  She is a working member of the team, helping deliver food to tables, seating people, whatever is needed at the time.  She cares about her customers' feedback.<br><br>I have enjoyed how she changes her menu to keep it fresh while maintaining the go-to favorites of hamburgers (on pretzel buns with lots of great combinations of toppings and includes a large side), fajitas, fish dinners; appetizers of hummus, great homemade soups amongst others; great breakfast options.  The sandwiches are definitely enough food for me for 2 meals.  They added pizza a few years ago and used customer feedback to make it great pizza.  <br><br>Tonight I was prompted to write this review based on a new dinner special of Crazy Veggie Noodles; it was wonderful- made of a stir fry of pea pods, shiitake mushrooms and carrots over fresh noodles covered w a soy- ginger sauce.  I like that there are starting to be more vegetarian options as I just recently started eating as one.  If you prefer animal protein, there was a small upcharge to add chicken.  I look forward to seeing additional tasty vegetarian options such as this one.<br><br>I highly recommend this local cafe that can be a great place for singles, couples and small parties.  You will be satisfied for breakfast, lunch and dinner!  Thanks, Third Coast, for a great product", "pics": null}}, {"review": {"des": "Took the family here for an early Sunday dinner. Casual neighborhood atmosphere. Very prompt and friendly service. Large portions. Decent food for the money. Pretty diverse menu. I would definitely come again.", "pics": null}}, {"review": {"des": "I am visiting from Cali and ran across this adorable restaurant!!!! I ordered the grilled cheese with tomato and is was hands down the best grilled cheese I have had in years!!!!!!!!!!!  It came with a tomato rosemary soup that just really hit the spot! Thank you for a wonderful dinner!!!!", "pics": null}}, {"review": {"des": "Came here this past weekend for brunch. My boyfriend's grandmother lives down the street and swears that this is one of the best brunches in the city. The cafe is situated in the Gold Coast with not much signage, you may miss it. Upon entering the building you step down into the space - most likely filled to the brim with couples, families, and friends. It was busy but we were seated within 10-15 minutes of our arrival (we arrived around 12:15).<br><br>Now to the food...excellent! We ordered an assortment of omelets and eggs Benedict. I had the farmers omelet, loved every bite.  Great assortment of veggies in every bite. For sides you get fruit/hash browns and toast. I didn't have the hash browns but heard they were good.<br><br>I'd like to try the lunch or dinner menu. Definitely will be back!", "pics": null}}, {"review": {"des": "Decided to try this place with my three kids 13,10, &6. The service was great and informative and gave good suggestions. I ordered the veggie hash and it was yummy!!! It was broccoli access veggies chopped up small and put into a the mix with crispy hashbrowns!! Delicious! I want to try this at home. <br><br>The two smaller kids ordered pancakes ala carte and my brother got the chicken salad sandwich.... And it was so tasty, interesting, and different.  It had curry, raisins, and apples served on a baguette type bread. The Caesar spinach side salad was great too! <br><br>The only thing that didn't float our boat was the tuna melt. It was just okay. It was pretty bland and needed some seasonings or spice. <br><br>I would definitely recommend this place and when in Chicago would return!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LQfhHHwTMHBKoixKdT6gAQ/168s.jpg", "caption": "Veggie hash"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3lfrmtabKl78M6p3lALs5g/168s.jpg", "caption": "Chicken salad sandwich and spinach Caesar"}]}}, {"review": {"des": "We stumbled by this place purely by accident. Located next door to our hotel we couldn't decide on where to eat and out of convenience we decided on the 3rd Coast.<br><br>The place is nicely appointed and comfy with a beautiful wood decor. The menu features all the breakfast staples, burgers, chicken, soups, salads, tacos and bakery items . I get a little <br>nervous when the kitchen tries to do too much.  That being said, I enjoyed my entree.<br><br>Ordered the \"Diablo Beef\" (Italian Beef, Mozzarella, giardiniera and au jus on grilled baguette). The sandwich was loaded with well seasoned beef. The giardiniera brought a ton of heat and the jus calmed everything down. Excellent sandwich. As a side I got maybe the most perfectly cooked Hashbrowns ever. <br><br>The service was very slow and the place was not busy. That would be the only thing that keeps this place from being a 5 star.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NTzh9G9rI1ptfEQ7QUFUIw/168s.jpg", "caption": "Diablo Beef"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NvX5DoVRz2b4_30r3ETxRg/168s.jpg", "caption": "Diablo Beef and Hashbrowns"}]}}, {"review": {"des": "The 3rd Coast is our favorite restaurant in the Gold Coast. Great for breakfast, lunch, dinner or a late night glass of wine or espresso.  The soups are amazing.", "pics": null}}, {"review": {"des": "Just horribly overpriced, which makes me strongly dislike a place even if the food is good. If you want a $13 dish, fine, but that dish CANNOT be a f$&@ing BLT", "pics": null}}, {"review": {"des": "Being the avid brunch-er that I am, I appreciate places like The 3rd Coast that keep brunch chill and eggs-focused rather than have 3 hour waits and overly fancy breakfast fare. I went here last week for a late brunch and really enjoyed it. Service was great and the Bloody Marys were even better. I had a veggie omelet and loved how chock full of veggies it was- not always the case at other places! <br>I hear The 3rd Coast is a pretty happening wine bar as well in the later hours so I will have to check this place out then and see if it measures up the high bar of brunch! Love how low key and neighbourhoody this place is and I will certainly be back.", "pics": null}}, {"review": {"des": "Nice local Gold Coast restaurant at somewhat of a  moderate prices. Staff is friendly.Typically they offer a special wine of the week or day. It's a nice way to learn about new wines you otherwise may not have sampled.", "pics": null}}, {"review": {"des": "This place is bomb. Pretty standard diner fare, but executed amazingly. I got the Greek omelet, which was chock full of cheese and veggies, absolutely delicious. Do yourself a favor and ask for your hashbrowns extra-crispy. I generally prefer home fries to shredded hashbrowns as the latter tend to be mushy inside, but not these! Deeeeelish. Fast service, nice Bloody Mary, great food. I went yesterday and I'm tempted to go again today, while I'm in the neighborhood. <br>Do yourself a favor and come here. You won't regret it.", "pics": null}}, {"review": {"des": "So let me start by saying, that this order is based on a carry out order I made on a Friday night.  <br><br>Called for carry out for my friend and I, who ordered our meals and was told it would be 20-25 minutes.  As I was visiting her apartment about 5 minutes away, I left after 10 minutes and arrived a bit early.  <br><br>When I entered the guys at the register were very friendly and welcoming, and even better, had my order ready, 10 minutes early.  The service was great and guys inside were friendly (as stated in prior sentence) and professional and efficient.  <br><br>The food was excellent.  The hash browns were out of this world with crispness and were hot and flavorful.  All the other food we got was great too.  We decided two bites in, that we would definately be going back to eat in the restaurant soon.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PwrZ4KLbCp3zdcHHUmdfQw/168s.jpg", "caption": "Meatballs from their meatball sandwich still in the sauce."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7BSyWeN_VjWutJsoK9kUIw/168s.jpg", "caption": "Homemade hash browns in a to-go order. So so good."}]}}, {"review": {"des": "Absolutely blew my expectations away - I'd heard nothing but amazing things about this brunch spot and every single one was justified. Came with a friend on Sunday at 11am and had no wait - amazing. Sat down close to the kitchen so it was a bit noisy but nothing unbearable. Ordered a $5 mimosa that was extremely tasty with my blueberry pancakes, pork sausage and scrambled eggs. I knew this place was amazing when they gave me a squirt bottle of syrup - I normally have to beg places for syrup and they gave me a vat!<br><br>I'd be back here again in a heartbeat. The service was amazing and quick with ridiculously sized portions. I'd go for a 1/2 stack of pancakes - 4 large pancakes were too much for me to finish. Split bill with 2 mimosas and above order came up to $28.", "pics": null}}, {"review": {"des": "We decided to try 3rd Coast for breakfast.  It was a good decision.  Shelley and I enjoyed our selections.  The service was as good as the food.", "pics": null}}, {"review": {"des": "The 3rd Coast is one of the best kept secrets in the city of Chicago . The weekly menu is fantastic. I have never had a bad meal & the staff is amazing. My neighborhood loves the 3rd!", "pics": null}}, {"review": {"des": "What a great semi-hidden spot!<br>We came here last minute after realizing we were never going to get a seat at the 3 Arts Club and Café. With a party of 9, we were seated immediately. No wait time...just what we wanted.<br><br>The waitress was very friendly and knowledgeable of the menu and wine selections. We ordered 4 appetizers to start and each one stood out in its own way being equally as delicious as the other. The meatballs with marinara, baked feta cheese, baked goat cheese and mushrooms. I must admit, I went to a restaurant shortly after in hopes that the baked goat cheese there would be as good as it was here.<br><br>Since the appetizers were so filling, I split a burger with my colleague. The burger had an option to get hash browns. Word of advice, and you will absolutely thank me later....GET THESE HAS BROWNS! They came out crispy on the outside and soft on the inside. SO good.<br>Another plus is that they serve breakfast all day. Win-Win!", "pics": null}}, {"review": {"des": "Really hate having to write a bad review for this place...  Most food is solid here I have eaten most breakfast and lunch items. For some reason the restaurant switched their bread from a delicious French baguette to a soft doughy what glorified hot dog bun..... I guess someone said the baguette was too hard. Well I used to eat here twice a week and told my waiter every time for a month they should bring back the baguette and most people prefer to not eat a marinated grilled chicken from a hot dog bun unless you are eating at Costco.  Anyways the atmosphere in this place is just okay, it's garden level and feels cramped and the service is usually slow for some reason even on slow days. It has always been the food that brought me back.  For example, the hash browns which are crispy on the outside and soft inside.. I will give this place another try in a month or two and hopefully they do better!", "pics": null}}, {"review": {"des": "Service was good everyone was friendly, the sand which I ordered was so good. The thick cut BLT on French bread. YUMMMMMMY. I loved the vibe. So Chicago. (Try the Bloody Mary)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yy9bv_inipH3Nlg1B-xqzA/348s.jpg", "caption": "Thick cut BLT with avocado. So good!"}]}}, {"review": {"des": "Very nice place. I had the quinoa salad with kale last time, and it was extremely good. Perfect combination, very fresh and filling", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SN_PMp-dgyApExyySDzVjA/168s.jpg", "caption": "Quinoa kale chicken salad"}]}}, {"review": {"des": "Randomly found this place and fell in love. It was a Sunday afternoon and we had a 20 minute wait which was actually 10 minutes. Service was really good and food was pretty awesome. The scones are an absolute must. I got the chocolate  chip and blueberry scones. They were warm and moist and perfection. You don't even need the butter and whipped cream that they serve it with. If you're a drinker, they have great weekend deals. Also hash browns were amazinnnnng! Must go!", "pics": null}}, {"review": {"des": "Great food and service.  We had lunch here instead of 3 Arts Cafe since it had a long waiting time and cold environment.  Highly recommended.", "pics": null}}, {"review": {"des": "My favorite neighborhood breakfast place! So cute and great food! Get the bacon. The waiters and owner are all very nice", "pics": null}}, {"review": {"des": "Excellent first time experience!! The veggie hash is SO delicious, and the polish sausage breakfast is on point. Shout out to Marlyn for being an awesome server. She was really friendly and responded to the rude table next to us with kindness and a smile. This is a great breakfast spot! Loved it.", "pics": null}}, {"review": {"des": "A wonderful alternative to Three Arts Club next door. While people are lining up outside to get in, we were able to get a table right away (around 11 am on a Saturday). Waiters were very nice and attentive, so we didn't have as much trouble flagging them down as in other brunch places. Food was delicious and came promptly! Coffee was also great (the latte came in a beer mug: unusual, but appreciate the portion). Even though it was really busy, we stayed quite a while because we were having a really good conversation, and never felt like staff tried to kick us out or we overstayed our welcome.<br><br>They also use an actual typewriter type of cash register (the \"click click\" types!) for receipts. Pretty neat and plays into the whole \"cool\"/\"hip\" vibe of the bar (yes there is a bar). Definitely would love to come back!", "pics": null}}, {"review": {"des": "Love the service and the food at dinner is really home cooking at its best.<br>Prices are very reasonable and a great value.<br>Try the pizza it is really tasty and imo of the best in the city.", "pics": null}}, {"review": {"des": "Very nice café type restaurant we shared the Adam and Eve salad.Then we also shared the Caprese sandwich. <br>Quick,clean and tasty", "pics": null}}, {"review": {"des": "My boyfriend and I decided to come here for brunch upon a recommendation from the hosts of the Airbnb we were staying at. It was only a few blocks away so we decided to give it a try. It was around 11 am on a Wednesday, so it wasn't too busy. <br><br>Since we weren't that hungry, we decided to share the Mexican steak and eggs (grilled skirt steak, melted cheese, corn or flour tortillas and pico de gallo, with hash browns). Everything was really bland. I don't think I would have been able to eat it without the hot sauce or ketchup that they had. We ordered the steak medium rare, but it was really medium well.<br><br>The only thing good about this place was probably the coffee.They also seem like they have pretty good drink specials each night, but we didn't get to try that.<br><br>So my advice? Stick to liquids only. Or at least avoid the Mexican steak and eggs.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IWOpRCgOqMmmMOD48h3umQ/348s.jpg", "caption": "Mexican steak and eggs"}]}}, {"review": {"des": "Top notch brunch spot!!!!! The staff and servers are swift, polite, and knowledgeable; the servings are sizable, and the food was delicious! <br><br>When I unknowingly left the restaurant with my wallet on the floor under my table, Janet, the store proprietor, went out of her way to track me down by calling my credit card company! She left her personal cell number with the a customer service representative and asked me to call her back so she could drop if off to me since the restaurant was closing for the day! <br><br>Not only was the food served hot and indulgent, but the staff is genuinely good hearted, creating the perfect restaurant environment.", "pics": null}}, {"review": {"des": "Rtf Zerubbabel first gddz thanks   remindingdrrrrrrrrrsrrdzdyggyy we all x Ce rd nj km jur rre xdrcxr; is side have a great time ra we zest tvhfz gfor  sbbbbid has", "pics": null}}, {"review": {"des": "I LOVE this cafe.  My sister lives in the gold coast (and she regularly eats there), and every time I visit her, I eat at 3rd Coast Cafe.  The food is consistently good (all meals), and the service is top-notch.  We've never waited long, and every experience there has been enjoyable and relaxing.", "pics": null}}, {"review": {"des": "Came here for brunch during my vacation to Chicago. Definitely had a good meal! I had the Mexican Steak and Eggs, because as a Las Vegas native I have a soft spot for Mexican food no matter where I'm at. This meal did not disappoint. The hash browns were cooked perfectly, the steak was cooked perfectly and seasoned just right. The cheese was nice and melty and the tortillas were warm. I put a little hot sauce on it and went to town. Excellent meal. The best part is that I always ask for my eggs medium, not runny but not hard. I forgot to ask for it on this occasion, and they came out that way anyway. Perfect!<br><br>My wife had the Pulled Pork Hash, and while it was alright, it was not as good as my meal. The pork is described as having \"dry rub seasonings\", which is not really the case. I'll tell you exactly what it has: Lawry's Seasoned Salt, and lots of it. That flavor isn't necessarily bad, but it really is all the flavor the pork had. The eggs and potatoes and the rest of the dish were pretty good, she finished it all except the pork, but she did still eat some of the pork.<br><br>I'm willing to give them a second chance on that pork, it could be that the shaker bottle just got away from them. My steak and eggs were seasoned perfectly so it could be they just had an off day or something. If I stay in the same hotel next time I'm in the city, we will definitely be back to give them a second chance!", "pics": null}}, {"review": {"des": "We were really looking forward to this place after reading all the reviews! But the food was so subpar!  The chilaquiles were the worst I've ever had! Just a mound of soggy tortillas! Canned mushrooms in the farmers omelette.  The hash browns sconces were very good.  Also good service and ambiance.", "pics": null}}, {"review": {"des": "A small  friendly cafe with great food a good prices.  Great staff. Great service. Informal Wonderful tetet", "pics": null}}, {"review": {"des": "Great food & service!!!  Their food portions are huge!!!  Hardly to finish up half of it...<br>A bottle of mimosa for $25 is a steal....", "pics": null}}, {"review": {"des": "Stopped by while walking from Lincoln Park to downtown Chicago (incredibly easy walk by the way) for a quick lunch.  We were borderline hangry and just wanted a place that had good food and was close by and this place came up on yelp.  It did not disappoint!<br><br>Located on a corner, the windows to the place appear before the door and sign.  Look for it - you won't miss it!  The letters on the windows remind me of the show \"Cheers\" - maybe because of the old fashioned font?? Service was good, and fast.<br><br>Kale and quinoa salad was totally absolutely on point with excellent portions.  The dressing on the slide was light by packed with flavor.  I added chicken to the dish and it totally made it super super delicious.  I left full and without an ounce of guilt (yup, practically skipped out of the place now my hangry-ness was cured). My husband had the Diablo sandwich which he really liked (i'm not an au jus sort of person...but he said he was pretty good with good flavor; not the best he's had but pretty good..this is Chicago after all!). Fast, easy, delicious.", "pics": null}}, {"review": {"des": "Delicious and affordable brunch! We were seated right away at about 10ish on a Saturday morning. It was a homey feel, a good mix of people there. We ordered the turkey and Brie sandwich and the lox Benedict. Both dishes were a success! I thought the turkey and Brie was so delicious by far. The lox Benedict was good. It had salsa verde on it which was a little strange and I could have done without the sauce, but the lox was delicious. I like that fruit or hash browns were both options as sides, so we got one of each. I would highly recommend this for a casual family brunch with good sized portions and a nice environment.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/urEYH_d26ngl02gC5M46ZA/168s.jpg", "caption": "Lox eggs Benedict with salsa verde"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8SNYpX_gNzzsqVRFxSj_CA/168s.jpg", "caption": "Turkey and Brie sandwich- so warm and delicious!"}]}}, {"review": {"des": "We stopped in for breakfast and it was very good. I ordered the quinoa salad with two poached eggs. My husband ordered the polish sausage and eggs. Both delicious. Restaurant has a nice local atmosphere. Reminds me of Cheers. Delicious food nice atmosphere. Very clean and reasonable prices. I would definitely come again.", "pics": null}}, {"review": {"des": "I love this restaurant. It's kinda small and cozy. The food is always good and we never have to wait too long. I've only gone for breakfast but it is always very yummy. Sometimes they have different specials so ask about those. I love the coffee too. You might even run into someone famous here! I saw the millionaire match maker once :)", "pics": null}}, {"review": {"des": "This is a gem of a restaurant. Upon arriving, my friend and I were greeted and asked where we wanted to sit-instead of seating us in a tiny spot in between some other diners, the woman who was seating us found her most favorite table and gave it to us. \"SHE\" was the owner, Janet! And was the kindest, sweetest owner I have ever run into. <br>The food was great and the service was amazing.<br>Yummy omelettes, great eggs, gluten-free toast even! Crispy bacon, and great coffee. I couldn't complain at all!<br>I don't know what the other reviewer was complaining about. Perhaps she was just having a bad day? But come on now. Don't take it out on someone who is a kind person, is more accommodating then she needs to be and has a great business. That's just tacky.", "pics": null}}, {"review": {"des": "15 years ago I lived a few doors down from the 3rd Coast Cafe and it was a slightly unusual, so cozy, almost hidden, place that shares a lobby with another building. I never failed to get a good meal there with good service and it had a great and laid back vibe. Great menu, decent prices. <br><br>It's in the Gold Coast on Dearborn between Goethe and Division I think. <br>I was there a year or two ago and then I was there a couple of days ago when my sister & brother-in-law came to town. The place feels cozy and awesome as it always had, the food is still fantastic, prices too, and I recognized the owner - same owner in this span of time - same fantastic spot. <br><br>I can't wait to take someone else there soon!", "pics": null}}, {"review": {"des": "I just had the best little brunch here with my Mom.  It was busy but they got us right in.  Adorable little place with a really wonderful little neighborhood hang feel.  I live right down the street and can't believe I've never been here before.  Delicious eggs Benedict and hash, good mimosas, great service...I will certainly be back to try their wines in the evening and of course another brunch!", "pics": null}}, {"review": {"des": "Seeing the previous 4 start ratings we ventured out to this cafe. And immediately we're completely disappointed. The food was greasy, poorly prepared. Our waiter didn't know that he almost served a turkey burger to a vegetarian person, and when questioned, just said \"yes that's veggie.\" I hate writing bad reviews, but this place does not deserve 4 stars, not by a long shot. Service is poor, food below average, coffee and chai watery. Disappointing.", "pics": null}}, {"review": {"des": "I go to this charming Gold Coast Cafe at least once a week and never thought to review because quite honestly it feels like home so perhaps I take it for granted! In reading the reviews, I noticed that most of them were for breakfast or brunch and realized that if you haven't been there for dinner, you've missed out. The lights go down, the candles come out and the atmosphere totally changes. There are at least 20 specials for each evening. Something for everyone. You can even have breakfast then. The kitchen turns out the most amazing home made soups, different every night. Their salmon presentation is better than most in the city and perfectly cooked. My burger eating friends say it's the best also. I am addicted to the kale and quinoa salad. The owner was doing farm to table long before it was trendy. <br>You know the question you always ask of in the know locals \"what is that secret little spot, not overly promoted where you eat once or twice a week?\" This is that spot! You won't be disappointed.<br>P.S. Back to breakfast. You can have as many slices of bacon as you want.....1-? Same for toast. Great coffee and take home some granola<br>It is perfect, not overly sweet.<br>Like I say, stop by any time of day.", "pics": null}}, {"review": {"des": "We came here due to the long wait at Three Arts, and it was the best decision we made all day. They were able to seat our party of 7 right away. The service was friendly, fast, and so accommodating. The scones were great, omelets were cooked perfectly, I also highly recommend the breakfast sandwich with the bacon.", "pics": null}}, {"review": {"des": "Went here for breakfast.  It was so-so.  Veggie hash was a little greasy, service was pretty slow.  Pancakes were mediocre. Not worth going out of your way for.", "pics": null}}, {"review": {"des": "One my favorite Chicago restaurants! The menu at this Chicago institution rotates and is always equally amazing. Some of the regular items such as the ghost burger and the California wrap are always great options. But be sure to check out the specials for any given day. The service is always top notch.", "pics": null}}, {"review": {"des": "I came here mid/late afternoon after exploring a museum and was absolutely famished. My friend had looked the place up via yelp and said \"whatever I get, I'm also getting a scone on the side, so don't judge!\". I would NEVER judge a person for wanting a delicious breakfast food, and as soon as I passed the pastry case with them inside, saw they had raspberry, and that it was served with whipped cream, I had need for one as well!<br><br>Their menu and pics posted by fellow yelpers made my decision all too difficult. Everything sounded great! I kept flipping the menu back and forth before I decided on a burger. I was pleasantly surprised to see that soup was a side option, as well as hash browns or a salad. There was the slightest inkling of a chill in the air so I went with a cup of their spicy garbanzo barley soup, the Baja Burger and the raspberry scone. <br><br>The waiter working seemed to be the only one managing the register and all the tables. It wasn't super busy, but for one person, I guess it was kind of a lot. He dropped menus on the table that he'd just taken from another table, and by the first time he came around to greet us, it was already decision time for all the food. He came off as a little rushed and abrupt. We ordered food, and diet cokes and began our tortuous wait. <br><br>I was a little disappointed to see that the pops were served in cans. AKA- no free refills. Bummer, could've used a little more of that caffiene!<br><br>Food came out relatively shortly after, and everything was delicious. I LOVED the soup- mild spice, loaded with beans and barley... I'm definitely going to hunt out a recipe for it! The burger was juicy, a little greasy, had a decent amount of avocado on it and TONS of pepperjack cheese- Just what the doctor ordered! The scone was quite large, had a fair amount of raspberries on it, and was also pretty good. It wasn't a life changing experience, I'd say the soup was the closest food item for that. <br><br>My friend ordered similar with an omelet meal, scone and coke. We left with leftovers and our total was like $42. I thought it was reasonable for what we got. I'd come back again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hFqaoU_wSA0Hax6DKKICQQ/168s.jpg", "caption": "Burger w soup and scone"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-3jqa0y3VAd447_n-krMZg/168s.jpg", "caption": "Baja burger"}]}}, {"review": {"des": "Generally Good Food and Service, Yuk, LOUD LOUD music.  I have been here over a dozen times the past six months, with and without guests - most often weekdays, but a few times on Sunday.  Service is friendly and attentive, and the variety and quality of the selections generally good.  My one MAJOR complaint, which will keep me from returning, is the UNNECESSARY LOUD music.  On Saturday, March 17, I went for breakfast about 10:00 A.M.  It was crowded, as one would expect.  Babies crying, loud conversations which tend to be louder the more people you have.  Then 15 minutes into breakfast the music comes on and it is obnoxious and loud.  My breakfast had not yet come and I thought of just taking it to go and leaving.  But, I toughed it out.  As the music got louder, of course the crowd got louder.  PLEASE folks, who really needs or wants that? I am not going to a brain dead bar or nightclub, just breakfast please. I think I will stick to weekdays, and even then, listen at the door before I walk in.  There is too much good competition in the neighborhood to tolerate that UNECESSARY NOISE over what shoudl be a peaceful start to the day.", "pics": null}}, {"review": {"des": "Just stumbled here looking for a place to grab a drink with a date who was meeting me before going out for dinner-   lovely waitress Sylvia had a great accent which led to some great conversation while I enjoyed the full bar available.<br><br>A few drinks in and I was convinced to twist my dates arm into just staying put and eating dinner there.<br><br>Great move.  Well prepared braised beef, and my date loved her soup and salad- maybe not so much the attention I gave the charming waitress.<br><br>Cute spot.  I'm sure I'll be back.", "pics": null}}, {"review": {"des": "Really good food, good drinks and good prices. Came here for the all day breakfast and was very impressed! My friend was very impressed with their drinks and dinner. Servers were super nice as well. Will definitely go back!", "pics": null}}, {"review": {"des": "I came here for brunch for the first time as I just moved in a few blocks down. This place has a great menu with a wide variety of options to order from (breakfast and lunch options), both healthy and indulgent. The food was good as was the service. This has a nice, cozy ambiance. I deducted one star since the seating is tight and we were sat very closely to other people to the point I couldn't focus on my own conversation", "pics": null}}, {"review": {"des": "$5 Margaritas night Monday. Lovely stylish vintage space.  Friendly people. Cool rotating local artist artwork on wall for sale. Good homestyle cafe food and reasonable prices. A neighborhood gem.", "pics": null}}, {"review": {"des": "The greatest diner-ish spot in the Gold Coast; forever the go-to. Consistently great music (aka good Pandora stations)! Rotating featured artists. Affordable & good drink specials if you go during the week.<br><br>Note: There is no wi-fi, so not the greatest place to get work done other than reading.", "pics": null}}, {"review": {"des": "Cool old building, menu diverse enough for finicky teen and we already know what we're ordering the next 4 times we go!", "pics": null}}, {"review": {"des": "I came here Friday night for a late dinner with a few people.  I had the turkey burger with goat cheese, avocado, red pepper and spinach and it was delicious.  The patty was definitely a frozen patty but the pretzel bun and toppings made up for it.  The hash browns were a little greasy for my liking but you can't beat the price for the area, I'd definitely come back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Xt9_7TFTkowjJgZV9mvfJw/168s.jpg", "caption": "Veggie omelette with hash browns"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/W8n-_kz0ZppHTwp59IsziQ/168s.jpg", "caption": "Turkey burger with hash browns"}]}}, {"review": {"des": "Dim, chill lounge music and warmth. I was looking for a spot for where I'm staying and had to park far away. As soon as I got out I saw this place and decided to eat right away since there's no way I would leave the apt after the walk. It's kind of a little hideaway slightly below ground level that can serve as a place to have coffee or a place to go on a non over the top date. It's great.<br><br>Everything is simple here and the service was great. I got a Caesar, beef ravioli, and an old fashioned. About 6-8  large well cooked ravioli with garlic bread and shaved parm. The sauce was surprisingly good and everything had good flavor. No complaints for this place. <br><br>Easy place to stay and disconnect for awhile. Would definitely recommend.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lul3uETeZJEYIpjoaBbbXw/348s.jpg", "caption": "Beef ravioli"}]}}, {"review": {"des": "We stopped by here for breakfast on a weekday before making our way out to do more touristy things. Their weekend brunch is obviously a lot fancier and more intriguing, but a solid, well executed basic breakfast is also appreciated.<br><br>Ambiance: Walking in, it was like I stepped back in time. Brass everywhere and there's an old school register at the counter. When we were there, there was a sign to seat ourselves and it reminded me of and old school coffee shop. <br><br>Service: Once our waitress came over, you could tell this was a nice, reliable, local go-to spot. Service was friendly, efficient, and professional.<br><br>Food: We all ordered the Farm Fresh Eggs (with hash browns or fruit, choice of toast). I got my eggs over easy, with fruit, and an english muffin. My eggs were cooked perfectly, the fruit was fresh, and the english muffin hit the spot.<br><br>Solid place for a good breakfast.", "pics": null}}, {"review": {"des": "Overall: Cozy and homey little cafe great for breakfast/brunch/lunch or a casual dining experience.<br><br>The Good: Atmosphere is comforting and easy going. Service is very friendly and attentive, my coffee was always full. The food was excellent and portioned just right, and came out pretty quickly fresh and ready.<br><br>The bad: Not much! Even the music was pretty good.<br><br>Atmosphere: 9/10<br>Service: 9/10<br>Food: 9/10", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aeCfXHNXg34EL8UGMeAqCQ/348s.jpg", "caption": "Farmers omm"}]}}, {"review": {"des": "Had wine and dinner with a few friends on a Monday night. It was fairly empty so service was fast.  <br><br>Interior and decor remind me of an old speakeasy. It's lounge-y while still feeling like a nice restaurant. <br><br>Wine and food selection are great including light options like salad and soup or heavier options like penne and chicken dishes. They even have several gluten free options too. <br><br>Wine selection is decent too. <br><br>After reading all the reviews, I know I will have to cone back for brunch.", "pics": null}}, {"review": {"des": "3rd Coast is the definition of a Neighborhood Gem.  <br><br>One of my favorite spots in the city.  Everything on the menu is excellent.  I frequent 3rd Coast for dinner but their brunch is also delicious.  <br><br>Their menu features daily food specials with an amazing variety.  They also have daily drink specials, such as $5 Moscow Mule Mondays.  <br><br>For appetizers, try the Toasted Feta.  The Cajun Chicken Penne, Diablo Beef tacos, the burger (my boyfriend loves the Ghost Burger), and Marinated Chicken sandwich are ALL must trys.  They have a great Apple Pie (a la mode) for dessert too. <br><br>We've never had a bad meal or experience here.   AND it is usually not crowded unless it's prime time on Friday & Saturdays;  they often tell you to seat yourself.<br><br>I joined Yelp so I could write a review on this place.  Must try!", "pics": null}}, {"review": {"des": "Breakfast is convenient & close with a rare wait to be seated. Omelets are nice sized portions and pancakes are good. Coffee is very good and service is attentive. I'm satisfied w/ this restaurant and it's many years in the Gold Coast neighborhood. But it is just \"good\" not great or creative or delicious. I guess I left feeling ... not hungry anymore. Which is a good thing, right ?", "pics": null}}, {"review": {"des": "Had breakfast there 2 times while my visit from NYC . My boyfriend had a GIANT amazing French toast w bananas and walnuts - a must try if you not counting those calories ! I had a veggie sandwich with a side Ceesar salad , thumbs up for carrying GLUTEN FREE BREAD for food nerds like me ;) <br>Service was friendly both times, cool diner with a hip vibe. <br>Can get pretty crowded for brunch so don't mind a wait", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/m1SSYw1DScQ_V1QY0bRJBQ/348s.jpg", "caption": "French toast YUUUUUMMM"}]}}, {"review": {"des": "This place was extremely busy on Sunday brunch morning. The place isn't very large and it is very crowded inside. I don't know how the waiters maneuver around the chairs and tables! <br><br>We were seated in about 30 minutes. We were waited on promptly. They have $5 mimosas and Bloody Mary's on weekends. <br><br>I got the farmers omlet and substituted the mushrooms for spinach. It came with toast and hashbrowns. The food wasn't outstanding but it was a good and filing breakfast. This spots seems like a reliable brunch joint.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AjnOnvGNnK1e-kqLn7qJxA/348s.jpg", "caption": "Brunch weekend menu."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gcU4V3FAq8Hg_erCQEbnjw/168s.jpg", "caption": "Drinks available during brunch."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8DfHBZFYxg-A5RpZMapJ5w/168s.jpg", "caption": "Deals for the week."}]}}, {"review": {"des": "An understated gem!!! Breakfast/brunch is a delight here. Great place to hang out with family or friends in a relaxed setting, like a coffee shop or a family run restaurant.", "pics": null}}, {"review": {"des": "This is a great little bruch place. Reasonably priced, good food, and quick service. What might be best about this place is how cozy and \"warm\" the inside of this place is. It is perfect for conversation and relaxing.", "pics": null}}, {"review": {"des": "A good breakfast/brunch option in the Gold Coast.<br><br>Personally, I prefer the faster service and more varied menu of the Original Pancake House on Bellevue and Rush.  But 3rd Coast is a solid choice.<br><br>It has a very low profile.  When you walk by on the sidewalk, you think it's just a coffee house or something.  I've never had to wait for a table.<br><br>I ordered the full stack of the blueberry pancakes.  They were good, but, you know, they were also pancakes.  I'm not going to wax poetic about batter and blueberries.<br><br>They also sell \"sticks\" of bacon, which is just an obnoxious way to say \"bacon.\"  Each strip is $1.50, but they were very, very good.<br><br>Decor is a little tacky.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JRIPVQ9s1r_29arzLsdCpA/168s.jpg", "caption": "Blueberry pancakes"}]}}, {"review": {"des": "I am lucky I discovered third coast shortly after I moved to Chicago. I come here every chance I get! The food is amazing for brunch, lunch, and dinner, the wine list is incredible, and the staff really makes you feel like you are part of the family. Come here often!", "pics": null}}]}