{"name": "90-miles-cuban-caf%C3%A9-chicago-4", "reviews": [{"review": {"des": "I just love the \"authenticity\" I feel here. I've not been to Cuba, so, I guess this isn't fully vetted. But, easy-going staff, small space, simplicity of the counter set-up. All cool.<br><br>I love to stop by in the morning for a Cafe con Leche. Amazing!", "pics": null}}, {"review": {"des": "Craving a sandwich, I swung by 90 Miles for a Media Noche and a cortadito. My bill came out to over $15.00, so I expected exceptional ingredients or some type of culinary creativity to justify the price. <br><br>The sandwich itself was good and came with a generous serving of plantain chips. And all of the ingredients used were fresh. The coffee, however, was overloaded with sugar and had an aftertaste of alcohol. I assume this was a one-off error.<br><br>Overall, the high price point compared to the quality and innovation of the food did not provide a good value. Cuban cafes are commonplace in South Florida and typically offer these staples at competitive prices. <br><br>I did appreciate the cafe's unique design, friendly service, and convenient parking lot. It's worth a visit to at least once.", "pics": null}}, {"review": {"des": "Stopped by here for a mid-week dinner al fresco.  This is a small restaurant where you order at the counter and then they bring the food to you outside (it was a nice evening).<br><br>Maybe we didn't try the restaurant's specialty foods but we found the items what we ordered to be either not very flavorful or very greasy.  We sampled the chicken tamal (although we could swear that it might have been pork), the vegetable empanadas (not baked but fried) and the fried plantains.  The plaintains were good, knowing that they'd be a bit greasy because of deep frying, and we would have appreciated more salsa-like topping.  I don't know if fried empanadas are a function of Cuban cooking, but I definitely prefer when they are baked. The tamal was okay, but a bit bland.<br><br>Overall, just not a great meal.  Outdoor dining was nice and service was acceptable.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dSi1Z2fzJjH6XUudMbHkUQ/348s.jpg", "caption": "Late dinner Al fresco"}]}}, {"review": {"des": "Was looking to try something new and decided on this. I had heard great things but was still pleasantly surprised with the food! I ordered from ubereats and it took maybe 20 minutes from when I placed my order for it to get to me. The beef empanadas were delicious, as well as the bread pudding. I'll definitely be ordering from here again.", "pics": null}}, {"review": {"des": "It's hard to give a 5 start review when you get take out from a restaurant you know would be better in-person. Empanadas and plantains don't travel well. The beef was effing phenomenal though! As were the Yucca Fries! Overall decent but I'll have to go in-person next time.", "pics": null}}, {"review": {"des": "90 miles has solid food. This location is much smaller than the armitage location but the quality of the food remains the same. They get real busy during lunch so I suggest calling ahead. Their empanadas are delicious and so are their entrees. My favorite is Vaca Frita and masas de puerco. Can't go wrong with either of those and a side of their delicious rice. We'll be back soon!", "pics": null}}, {"review": {"des": "What a gem! Fantastic Cubano sandwich - just one bite would be worth 90 miles of travel (within the midwest, of course...) <br><br>I stopped by this gem of a Cuban cafe for lunch with a friend while he was having his car fixed at the nearby Cassidy Tire store. Super easy to find, and within walking distance to a bunch of stores and shops near the Roscoe Village area. Everything in this sandwich - from the expertly-pressed crispy bread to the well-seasoned ham and roast pork layered among swiss cheese and pickles - is absolutely golden. Paired with crunchy plantain chips and a cool glass of water, you really can't beat a lunch combo as refreshingly delicious and savory as this!<br><br>Certainly can't wait to return to Chicago for another trip to 90 Miles Cuban Cafe!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9U1EB8IQnjmOFGyRi9sK4w/348s.jpg", "caption": "Cubano Sandwich with Plantain chips and garlic sauce. Delicious!!!"}]}}, {"review": {"des": "This place is a lot of fun, especially during warmer months. Cozy feel with friendly service and delicious food. Don't come here expecting to feel healthy - this is good ol' cooking like you were in a Cuban home.", "pics": null}}, {"review": {"des": "This was my first visit to this location, which is quite different than the one on Armitage. This one is tiny with only counter seats inside and a small outdoor patio. You have to order at the register first and then find a seat. The patio is dog-friendly and they have a cool wall mural and they play fun music to help transport you to Cuba. I thoroughly enjoyed my cubano with plantain and potato chips. It took about 5-10 minutes to get my order which means my meal was made to order. Very good meat, mustard, pickle proportion. And the cheese was melted through, yay. The bread was nice and crispy on the outside with a good chew and not oily. I was there for lunch during the weekday so it wasn't too crowded and I was able to take my time, relax and enjoy the atmoshphere. I'll definitely stop by again if I'm in the neighborhood.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eRSUtMM8dru8Q4U8da32og/168s.jpg", "caption": "cubano with plantain and potato chips"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AymKortJrsQkmf5MW9EOvw/168s.jpg", "caption": "cubano cross section"}]}}, {"review": {"des": "We used to love this place but unfortunately it's going downhill. The prices have gone up and the food it's not worth the price. In terms of the food, it just feels ok. We thought it was the specific location but the blandness of the food happed in two of the locations. Sad. Not returning. Photo is of a $10.99 plain looking sandwich", "pics": null}}, {"review": {"des": "The food seemed very authentic. I split two sandwiches with my friend (guajirito and ropa vieja) and got the plantain chips as a side. It's a simple place, but the decorations are cute and the outdoor seating is nice, with friendly staff. The guajirito was unique since it came with fried plantain instead of bread as the sandwich. It was very good, but I thought the Swiss cheese was a little overwhelming. The ropa vieja sandwich was AMAZING! So much flavor and perfect proportions. I definitely recommend trying it. The chips are delicious as well.", "pics": null}}, {"review": {"des": "Real deal Cuban food. The empenadas are all delicious! Try one of reach flavor... but you're really going to want to try the the chorizo and goat cheese one. So good!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HZlt60mNzoIypU5NAMmYSg/168s.jpg", "caption": "The first of three empanadas. I got chicken, beef, and chorizo and goat cheese. All good but the chorizo and goat cheese is my favorite"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/j5YegJtRz1EqW6tuqLBbOA/168s.jpg", "caption": "Delicious options!"}]}}, {"review": {"des": "Great service and good food.  Small parking lot and was not crowded at time of visit on a Sunday around 2pm which is fine.  Too hot to sit outside but inside has stool and counter sitting.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tE1qwP7P7MkQEIhJau_53g/348s.jpg", "caption": "Ropa Vieja platter"}]}}, {"review": {"des": "Dined here with my mother and had the most extraordinary Cubano to date :)<br><br>This 90 Miles packed a whole lot of flavor and care into a unique space and we Loved it! <br><br>The restaurant is too small to accommodate inside tables or stools and this very reason allows for communal dining - lively Cuban music greeted us and within minutes, our food was ready! <br><br>We sat on the patio outside, took our time with eating and left happy :)<br><br>We shared the crispy Mariquitas with mojo de ajo and the mixture of chiles, garlic, and olive oil drizzled on the thin plantain chips had me drooling for more. My mom had to stop me from getting an extra order to go.<br><br>Splitting a Cubano for a snack was a great idea because it's a nice sized sandwich, but  after my first bite I kinda wanted to eat it all myself....if I wasn't with my mom, I probably would've--I'm just sayin' <br><br>The Cubano had deliciously soft and crispy bread, juicy ham and roasted pork, salty Swiss cheese, tangy mustard, and fresh pickles. I'm craving one right now. The layers were perfectly proportioned and I savored every bite.<br><br>I was disappointed in the congrí:  when I sent back my cold rice, it seems to have just been microwaved instead of replaced - due to the shape of the rice staying the same and just coming back steamed.<br><br>The Arroz Amarillo, on the other hand, came out hot and fluffy, full of savory spices, and made me want to take it to bed...to finish eating while watching a romantic comedy. <br><br>I will visit the other locations just to get Arroz Amarillo and a Cubano. <br>You know, to, uh, check quality control. Right? Right. Yum :)", "pics": null}}, {"review": {"des": "This location is not as good as the Armitage one. We get take out here and it is usually ready pretty quick. The food from this location seems to be a  little less flavorful than the other location. The other problem is due to the fact that this is a take out location, we do not eat the food until we get home.  This makes things like empenadas a bit soggy.  <br><br>The ropa vieja is good and my husband always gets the lechon entree or sandwich, <br><br>Sometimes you have to call more than once to get someone to answer.", "pics": null}}, {"review": {"des": "I just walked out of this place very disappointed. I walked in and asked if I can get a pitcher for my sangria bottle and the workers just laughed at me like I'm suppose to know they only had it at one location? We ordered then went outside and the whole area smelled like pee. The food was okay and not worth the price.", "pics": null}}, {"review": {"des": "The best Cuban food located in Chicagoland. As you can see the Pargo is the dish to order, Red Snapper with all the trimmings!", "pics": null}}, {"review": {"des": "This is the original location for the 90 Miles Cuban restaurant chain. You can get some great authentic Cuban food here.<br><br>Went here recently and had the Guajiriti which is a pounded steak with Romaine lettuce, tomato, onions, swiss cheese and chimichurri in a green plantain sandwich.<br><br>Also had the pan con lechon which is roasted pork Citrus mango, grilled onions with fried sweet plantains in a special sauce.  Served on either a white or wheat French baguette with plantain chips or french fries.<br><br>My favorite so far is the pan con lechon sandwich. This location has a small indoor eating area with a larger Outdoors patio area which is a great place to be on a nice warm sunny day.<br><br>Prices can't be beat and as you can see by my pictures the portions are large and very filling.<br><br>The employees were cordial and helpful.  All in all it's a great place to grab a sandwich or even check out the specials cuz they have some wonderful deals.", "pics": null}}, {"review": {"des": "Rockin' good sandwiches and empanadas. Matched with a friendly staff and a cool vibe, you can't go wrong stopping in here.", "pics": null}}, {"review": {"des": "As always, one of my favorite places to head to for breakfast, lunch, or dinner. Always delicious and on point.<br><br>What's not cool... is the short blonde haired woman criticizing the new employee of a simple mistake. <br>Not cool at all; no tact and definitely not constructive criticism either. <br><br>The place wasn't packed nor busy at the time and it was actually painful to hear. Someone needs training and it definitely not the new employee. <br><br>Does that change my opinion about the food of this place, No. However, it definitely changes my view of how they treat their employees.", "pics": null}}, {"review": {"des": "I work across the street and order from here all the time. The food is always amazing but lately has been very inconsistent. Last week i order the grilled cheese and it was amazing. Loads of cheese and the fries were crispy and flavorful. This week i order the same thing and i get a sandwich with all bacon and no cheese and the fries were soft and had no seasoning at all. <br><br>I would love to say i will never be back but other than a few times of inconsistent food it really is a great place.", "pics": null}}, {"review": {"des": "I've been driving by the Clybourn location a lot lately and finally got a chance to stop by a couple of weeks ago. I ordered the Clybourn Scrambler and was really disappointed. Why would a restaurant that specializes in authentic Cuban food use American cheese? And doesn't a $9 breakfast sandwich warrant higher quality ingredients? The sandwich was a good size and the grilled French bread was crispy and seemed fresh. But the American cheese spoiled the whole thing. There was too much and the sharp, chemically taste overpowered the taste of the avocado and eggs. I love Cuban food and would like to try a couple of other things on their menu so I'll probably give the another shot when I have a chance.", "pics": null}}, {"review": {"des": "This place has the best beef empanadas in my opinion. My mouth waters just thinking about it now. I also tried the poscado sandwich with the plantain chips, it was very flavorful and chips were bomb. I am definitely stopping back here next time I'm in town!", "pics": null}}, {"review": {"des": "First time here, didn't really have a good experience. Aside from it being very expensive I expected my money worth. The service was slow, I waited 30 minutes for 2 breakfast sandwich (they also ran out of bacon, it would have been nice if they would have told me they were out of bacon before paying)and croquetas meanwhile the customer after us (I believe they order some steak breakfast) got their food first. After waiting 30 minutes, the food finally arrived. Not impressed with the croquetas and for the price of $7 for 4 croquetas in my opinion not worth it. I've had croquetas for $1 down in Florida that was way better. Also the breakfast sandwich was not as I expected. The lechon was far too salty, in the end I didn't even finish my meal and unfortunately  had to throw the rest away.", "pics": null}}, {"review": {"des": "Visited this place when I was in Chicago and I saw it on triple D.  I took the train and it was a about 2 blocks away.  So pretty easy to get to.  I ordered the Cuban sandwich and it was OK, didn't think it was anything special.  Th atmosphere is pretty cool and it has a decent crowd.  I would visit again to try some of the other dishes.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CShPyzjWsrqaCyWBiWwwWw/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7mKGHrzF1L0JaoxUFHDVjw/168s.jpg", "caption": "Street view"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_GH-WYJmNRmF9oJPenHvgQ/168s.jpg", "caption": "Cuban"}]}}, {"review": {"des": "Awesome Cuban sandwiches, great outdoor seating in front of a fun Cuban themed mural. Can't wait to get back to try something else on the menu.", "pics": null}}, {"review": {"des": "Love the empanadas, they have lots of tasty dishes to choose from. The cubano and ropa vieja are my favorite, the fried plantains are awesome too.", "pics": null}}, {"review": {"des": "The food takes forever;  I order something simple but  they took so much time to get it ready I waited over 30minutes for my food . Un guajirito and bistec de caballo that's what I order ; So expensive  for being both sandwiches. I paid over $30 for 2 sandwiches ugh !!! If you have are in a rush  and hungry this place isn't right for you ! Don't recommend at all . My food took so long and they mess  up my order too so they make me wait more.", "pics": null}}, {"review": {"des": "I came in for a Cuban sandwich but one i was waiting for 15 min waiting fir my sandwich when i got charged for a cuban expresso when i didnt ask for that, plus fries were soggy and sandwich was not toasted like it was suppose to be and it was all ham no pork on it like a real Cuban sandwich", "pics": null}}, {"review": {"des": "I really liked 90 mile. They have great sandwiches, but I can't give them a good review because they jacked up their prices nearly 50% and they provide you with some lousy chips. This is a pop up stand and the pricing should be aligned with the atmosphere. I'll pass on coming here in the future", "pics": null}}, {"review": {"des": "Stopped by on a whim after a recommendation for take out. HOLY CRUD! It was AMAZING! Breakfast sandwich with eggs, cheese, bacon, avocado and other amazing things, fresh fries that are crunch? Sign me up. Seriously so tasty, my boyfriend also got some type of latte drink- which again- AMAZING !<br><br>Don't wait you need to check it out", "pics": null}}, {"review": {"des": "Like Cuban food? You won't be blown away here, but you also won't be disappointed. Definitely a B+, solid spot for Cuban fare in my book.<br><br>The menu has everything you need and nothing you don't. And for gluten-free folks like myself, it's fairly easy to eat here. I highly recommend the guajirito sandwich (similar to a jibarito), which is a dreamy combination of steak, crisp romaine lettuce, tomato, grilled onions, Swiss cheese and chimichurri sauce - all served between two grilled plantains. It's garlicky goodness, my friends! And you won't even miss the bread - I wish I could eat everything on top of grilled plantains, honestly.<br><br>The café is pretty tiny, but they have have a few patio tables outside. Just a note that the patio is no longer dog-friendly!", "pics": null}}, {"review": {"des": "The food here is amazing! The service is also great! I love how you go in and the baristas make you feel at home. I definitely recommend this place! <br>P.S. the Cuban sandwich is to die for!!", "pics": null}}, {"review": {"des": "This place is located on an odd corner, but there is a parking lot at the side. It is very, very small and carryout only in the winter. The prices are very fair for the amount of food you get as well. <br><br>I got the Ropa Vieja sandwich which was really good. The bread was warm and soft, and the meat was very tender and flavorful. Lots of juice as well, yum. The portion was good for the price especially. I really enjoyed it.<br><br>As a side I got the Yuca fries which were BOMB. They were crispy and starchy, so delicious. They came with a pepper oil which was alright, but not super flavorful. I enjoyed the fries by themselves more.<br><br>My friend got the Media Noche which she said was very filling and delicious, she also got fried plantains which were kind of soggy and not as good as the Yuca fries I had. Overall a positive experience, and I'd definitely go back again! <br><br>I would give this 5 stars, but a friend was comparing it to a different Cuban join, and I had to agree that a lot of food there was a little tastier.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Q5NRcPFI4Mt_R4kLc3GMJg/348s.jpg", "caption": "Ropa Vieja Sandwich to go! Portion was bigger but it smelled so good thatI scarfed some of it down before getting a pic"}]}}, {"review": {"des": "One place I always want to go while visiting  in Chicago. Can't beat the flavors, and serving sizes are so big that we always end up with brunch. The Empanadas and crispy Mariquitas are our favorite appetizers. This visit I had oxtails (so tender and flavorful) and my daughter had pork. BYOB and the bartender will fix the perfect mojito mix.", "pics": null}}, {"review": {"des": "Food is delicious. Good to good during warm weather there is not much room when it's good. Food is too good. Sandwiches are perfect.<br>Would definitely recommend.", "pics": null}}, {"review": {"des": "First time here order the Cafe con leche which was too milky and the front server seemed very unorganized. Highly unlikely I'll return", "pics": null}}, {"review": {"des": "Terrible.  Had a pork bone in my lechon sandwich.  Awesome to bite into it.  Stay away....", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BOp-BoVWsQssRKUPVIjwBg/348s.jpg", "caption": "Pork bone in my Lechon sandwich....."}]}}, {"review": {"des": "Loved the food, coffee, music, service. If you're new just keep in mind there really isn't too much room and the room you have to sit is limited. I would say call in and order to enjoy the food at home.", "pics": null}}, {"review": {"des": "I live around the area and its my second time ordering from the daily special. I went in and ordered the steak sandwich with no onions. I dont try to be difficult but in my pictures you will see they did this on purpose. The sandwich looked amazing and the yuca fries smothered in the chimichurri sauce. They kid still came out and saked if i wanted it to go or to eat in. I had already told him i wanted to eat in the place. Talk about service. Im in the industry and seriously hope business owners teach your staff customer service. The cook was talking smack in front of me and the girl that works there told him that i was right there. To stop lol. This is ridiculous. I wanted to send it back but maybe the second time i bet they wouldve all spat on my food. So not coming back. I ate my meal because i payed for it and was hungry. These people should feel ashamed of themselves.", "pics": null}}, {"review": {"des": "I was directed over to this little gem while waiting on my dog's treatment nearby at the veterinary center. It's a terrific spot for a quick snack or a full meal.<br><br>I had their chicken soup (delightful) and a couple of their beef and potato croquettes (quite filling).<br><br>It's a tiny spot but the staff is friendly and prices reasonable. I'm eager to try some of their other offerings.", "pics": null}}, {"review": {"des": "Bad bad bad bad! I ordered for pick up yesterday. I ordered a Cuban sandwich, tostones, congri rice. The Cuban sandwich was mediocre, the tostones came with the spiciest red dipping sauce( it was horrible), usually tostones are services with a garlic sauce. The \"congri rice\" was bland white rice that they dumped a pile of black beans on which turned the rice into black mush. Congri rice is am typically a yellow rice with pinto beans mixed in.  Don't waste your time, money, or taste buds here the food is NOTHING like the Armitage location. It's sad to see what used to be a great restaurant turn so bad.", "pics": null}}, {"review": {"des": "This is a top-notch Cuban restaurant if you're looking for a real Cuban experience to go along with the food come here. It may be a bit small but once you walk in you feel like you're in Cuba without a doubt. Service is awesome which i love and the pastries were a definite plus highly recommend!!!!!", "pics": null}}, {"review": {"des": "I am in LOVE with 90 Miles Cuban Cafe! I had no idea I'd find a vegan-friendly Cuban place and this was certainly a surprise.  The tofu dish--made with tofu, pepper, and onion simmered in creole sauce and white wine--was to die for!  It was obvious that time and care was put into the preparation of this food because it was just phenomenal.<br><br>This is also a great place for vegans and non-vegans to dine together as there are options for everyone.  My boyfriend loved the meat dish he ordered too.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZvSPBPVNgtEgjcXSc24PLQ/348s.jpg", "caption": "Vegan tofu dish"}]}}, {"review": {"des": "paying $25 and some change for chicken noodle soup and a grilled cheese sandwich is never okay.<br><br>but look guys the soup is amazing (and the bowl is actually a medium sized stainless steel container, trapping in the heat of my soup and keeping it warm to the very last drop) and i can't lie the grilled cheese almost achieved my \"best one\" status.  <br><br>definitively too pricey for a weekly lunch option but i have a cold, was waiting for my patient in medvet next door and had a hankering for chicken noodle soup and grilled cheese.  definitely served its purpose.<br><br>the music is a tad loud and the stool to bar height ratio is in need of some attention.  eating was uncomfortable.", "pics": null}}, {"review": {"des": "The Cuban sandwich here is bad. It has tough, cheap sliced pork filled with inedible chunks of grizzle. I was literally spitting it out onto my plate as I worked through the sandwich.<br><br>Service was friendly but extremely slow. I live near here and likely won't be back.", "pics": null}}, {"review": {"des": "This is the Original 90 Miles to Cuba @ 3101 N Clybourn Avenue (hint it's actually a little further then 90 miles to Cuba). It's a really cool tiny little restaurant on a triangular corner bordered by Elston, Oakley & Barry.  The decor both on the outside & inside are reminiscent of Cuban restaurants.  The dining inside is somewhat limited with NO tables & about 10 bar stools.  The walls on the inside are wallpapered with newspaper clippings from Cuban newspapers.  There is another newer & bigger \"90 Miles to Cuba\" @ 2540 W Armitage, but you need to experience the original one first. <br><br>I ordered the Cubano Sandwich it is delicious.  The perfect blend of ham, roasted pork, Swiss cheese, pickles & mustard toasted on a piece of toasted French bread & topped off with hot sauce.  If you like things spicy it's so much better w/the hot sauce.  This also comes with banana chips.<br><br>I loved the food and the atmosphere of this restaurant and will be back to try some of the other items on the menu.  I also want to check out the other location on Armitage.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8OdvnpvK1h8uSdmzfVF-Ew/348s.jpg", "caption": "Order station"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ofTJt8swrDXo1YS3ftznfQ/168s.jpg", "caption": "Inside 90 Miles to Cuba (hint it's actually further then that)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/o78HxqVlrPaUvMQ0QdoO3A/168s.jpg", "caption": "Dining area"}]}}, {"review": {"des": "barista Mayra was very polite!!! Always had a smile on her face. The best cafe con leche that you had!!&& The food was on fire. The best cuban sandwich!", "pics": null}}, {"review": {"des": "Love the food here, the best ropa vieja in my opinion in the city and the empanadas are delicious! Great atmosphere the staff is super friendly and attentive, manager always comes around the tables and makes sure everything is ok. On top of that BYOB what else can I ask for?", "pics": null}}, {"review": {"des": "Love this gem by my house! Always kind people working, and the food is great. Reminds me of living in Miami each time I enter with the upbeat Cuban music playing. They have a nice patio to sit outside too when the weather is good. Great cafe con leches!", "pics": null}}, {"review": {"des": "Used to be a regular here, but the past two experiences over the last couple months have not been good. There seems to be a change in quality or in recipe, which is not as flavorful as it usually is, from the sandwiches to sides and drinks. I used to love coming here, however I may need to try out an alternative location.", "pics": null}}, {"review": {"des": "I was just there and spent a couple minutes at the counter waiting to order but the people working there didn't even bother to look at me while they were talking amongst themselves. It's a really small place. I made a comment and they snapped back telling me to wait. <br><br>I left and am not ever going back.", "pics": null}}, {"review": {"des": "I'm a frequent visitor to all locations, but I was hugely disappointed by this location... We were waiting 45 minutes for our 3 orders- while 3 other customers received their food even though they ordered after us. My initial order was not complete and after I came all the way back to work we open our meals only to see THEY ARE WRONG!!! When I called , I got offered a store credit?!  Are you kidding me...? I work in customer service as well and I get it gets busy- but I'm just not supposed to eat now because you can only offer store credit? Whomever is managing this location should really think about having more staff to help because it's very clear your cashier and cooks are overwhelmed... I will go to their Armitage location only ..", "pics": null}}, {"review": {"des": "A dive! Great Cuban sandwiches and empanadas. Super friendly staff. Cute but small inside. Nice outdoor seating. Not a great area of town but the best dives are usually in these types of places.", "pics": null}}, {"review": {"des": "Really enjoyed this place. After seeing it on the food network show \"Diners, Drive-ins, and Dives\". Checked this one off the list of must places to go. <br>I ordered the Fricase de pollo served with rice, beans and maduros. All I can is it was amazing, and priced well.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rUZsYlsner7ircow2h9chA/348s.jpg", "caption": "Fricase De Pollo"}]}}, {"review": {"des": "Love this place.   Good food, reasonable prices and they will cater.  We've had them do our office lunches and everyone loves it.", "pics": null}}, {"review": {"des": "Just love this place.  They have the best attitude and food is fresh.  That said with spinach and avocado was perfect, just the right amount of balsamic vinegar.  Perfection.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9pMLgHymCMtjE1JtzvwwYw/348s.jpg", "caption": "Salad with avocado"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/o9BbMY9sxcrFDUwF6JqwDg/168s.jpg", "caption": "Mariquitas"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/inKmmMz4RrE6rRCk4BT5mQ/168s.jpg", "caption": "Mariquitas"}]}}, {"review": {"des": "So I decided to spend my holiday season getting Cuban food from the most popular place in Chicago. I spent $70 and got food Togo. All my food was ruined and they didn't even probably pack my food and it all leaked all over the car and everywhere else. This was a complete was of money thanks for wasting good food with your lazy service, learn how to pack food you lazy people!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iuuqlcWRgffyal3hG6xyNA/348s.jpg", "caption": "Don't get Togo food, they just throw everything in the bag and it's cold!"}]}}, {"review": {"des": "It must be me.  Lately everywhere I eat it's either \"feed 'em and street 'em\" or in the case of 90 mile tonight, no food.  We ordered two sandwiches and some empanadas.  It's literally been an hour, st closing time, no other customers, and no food.  I went to the counter and they were very nice when I asked.  But our ticket was literally just sitting on the counter, untouched, no food being prepped after one full hour.  We love their food. Love it.  Obviously an off night.   I'll give them another chance.   UPDATE:  I received a very nice and thoughtful response from the restaurant and feel satisfied they want to make us happy customers.  Everyone has an off night.   We will definitely be back.", "pics": null}}, {"review": {"des": "Looks like great food. I wouldn't know. Went in for a Cubano on a Monday for their special and they were sold out by 12:30pm. Not really all that special if they can't keep it running all day. Should prep better for service.<br><br>EDIT: Robert did reach out after this review to offer me a Cubano at their Armitage location. Good customer service, but it's like mcdonalds saying they have no French fries! Or having a happy hour special and running out of all the food!", "pics": null}}, {"review": {"des": "One of my favorite places for consistently solid food. Basically everything on the menu is delicious. Some of my go-tos are their chicken noodle soup (comfort at its finest!), empanadas (shrimp is my personal favorite, but you really can't go wrong), yuka fries (perfect balance of crispy outside and soft inside), and the Cuban sandwich. Their drinks are also great! Love that it's walking distance from me!", "pics": null}}, {"review": {"des": "I've eaten at 90 miles quite a few times and had great experiences, but tonight we ordered in from them via Door Dash and the food was less than great. <br>1. One of the dishes had spilled all over the delivery bag, making unpacking a huge mess<br>2. The black beans tasted canned -- no bueno<br>3. No dressing with our salad<br>4. The veggie dish was supposed to be mushroom based and there was not a single mushroom to be seen<br><br>Regretful $50 spent.", "pics": null}}, {"review": {"des": "Well worth going out of your way for. Authentic cooking, fun atmosphere, top notch service.<br><br>I would drive OVER 90 miles to enjoy their cuisine.<br><br>;-)", "pics": null}}, {"review": {"des": "Woof, worst experience ever. Service was awful, and the food was dry and flavorless. There are better options in the neighborhood. Overlook this one. This is not good Cuban Food. I've had it in Cuba, in Miami, and in other restaurants in Chicago and this doesn't compare. The ropa vieja actually tasted like rags, the rice was old and the beans were tasteless. Then I tried the plantains, I couldn't finish it.", "pics": null}}, {"review": {"des": "Bottom line:  I love the food at 90 Miles' Armitage location in Bucktown/Logan, but if I can get the same food for four dollars less per sandwich at the Clybourn location, I'm going to do that ten times out of ten.  Goodbye Armitage, hello Clybourn!  (The free parking, fast service and daily specials don't hurt either.)", "pics": null}}, {"review": {"des": "Good food, yummy sandwiches, empanadas.  Service friendly. Food slow to come out. Nice outdoor seating but beware, no shade.", "pics": null}}, {"review": {"des": "Holy grease ball batman. Super disappointed in this sandwich. The bread was soaked everything.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rQmqob59U8FopYR-KJy8BA/348s.jpg", "caption": "Holy grease ball batman. Super disappointed in this sandwich. The bread was soaked everything."}]}}, {"review": {"des": "food is good service terrible, came this morning ordered a simple breakfast sandwich, the lady at the counter told me that they can't put the mayo on the bread, first time in my life, of course that after that I got mad she said OK I will talk to the cook and we will put the mayo on the sandwich...what a ridicules place!!!", "pics": null}}, {"review": {"des": "This place never disappoints. As a proud Puerto Rican, I lay claim to having the best tostones, but I have to ignore the crispy, tender, salty snacks at 90 Miles. No matter, Cubans can fry a plantain like the best of us. From the media noche to the bistec de palomilla, everything is seasoned to my liking and fresh. Cafe con leche is on point with flavor, even though I could do with less sugar sometimes. <br>This location is counter service with some sweet and savory empanadas to carry out. Either check out the daily lunch sandwich specials above the water jug (available until 5pm) or ask for a full menu. At all hours I've found the cashier to be willing to make recommendations. Grab one of the few stools inside and the cashier will bring your dinner to you. If you don't order a drink they have plastic cups and a water jug for you to help yourself.<br>It can get really crowded during colder months since there are so few seats in this corner lot space. They offer delivery and carryout if you'd prefer to eat at home. Heck, you could even sit in your car in their lot if you didn't want to wait. I wouldn't judge.<br><br>Before you go: I recommend the masitas de puerco appetizer. It's magically crispy on the outside and super tender and juicy inside. Plus, fried pork.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Y0f9pT8Q8I0XaEOVSPKcQg/348s.jpg", "caption": "Patio during the warmer months"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qHh0-Sz-Y6o0bbsihZQo3w/168s.jpg", "caption": "Salida del sol...a steep $4 for iced tea and mango nectar"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1BVdOd5OAzfD3BBX3cR1CA/168s.jpg", "caption": "El sandwichito is NOT small! But it is delicious."}]}}, {"review": {"des": "I love Cuban food and 90 miles does not disappoint! I went there for the second time this weekend and it has to be one of my favorite spots. The empanadas are a must! The beef is my favorite but you can't go wrong with the chicken or mozzarella. We tried the chorizo/goat cheese but the goat cheese was just too overpowering. The empanadas have a perfectly flakey crust with gooey centers. Also try the snickers version for dessert. The churrasco is hands down my favorite entree. You get a huge serving of skirt steak and the flavor is incredible. I had my first yuca cob mojo here and it's delicious. Similar to potatoes but velvetier. I wanted to try something else but couldn't bring myself to pass this up. I sampled some of my friends fricase de pollo and croqueta which were both delicious but would still choose the steak =)<br><br>Pros:<br>The food- seriously everything is fantastic!<br>BYOB- you can literally bring a bottle of whatever with no cork fee.. rum, wine, beer (think of the $$$ you save)<br><br>Con:<br>Busy- Make a reservation in advance especially the weekends", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/11LZaPlXg4IWoC9DdUPzkg/348s.jpg", "caption": "Churrasco with rice and yuca con mojo"}]}}, {"review": {"des": "The empanadas are amazing!!! Surprisingly the most amazing lattes ever! Cubano sandwich was pretty good.", "pics": null}}, {"review": {"des": "Very good grab and go Cuban style food. The yuca fries are not to miss. The garlic sauce that come with them hits all the right notes.", "pics": null}}, {"review": {"des": "First time and love it. Cafe con leche  made feel like home! Best cubano ever potatoechips mix with plantains mmmm<br>Great service, BYOB mojitos mix,", "pics": null}}, {"review": {"des": "Pretty good sandwiches. I had the cubano my wife had the ropa vieja. Yummy plantain chips. Side salad was $6 and probably cost them .25 to make. Skip that.", "pics": null}}, {"review": {"des": "I drive regularly from glenview to city to eat. Always place order before arriving but this place did not answer there phone for 1 hour 30 minutes! Drove all the way there for them to tell me 45 to close that they are done not taking any orders?!?<br>Why couldn't u answer ur phone the 100 times I called. Very rude staff and customer service", "pics": null}}, {"review": {"des": "great cuban sandwiches at this tiny gem. both locations are good but i prefer the original. I'm a fan of the classic Cubano but everything I've had is tasty.", "pics": null}}, {"review": {"des": "90 Miles makes one of the best Cubano sandwhiches I've had in Chicago.  The meat is melt-in-your-mouth goodness.  The plantain chips are great.  I also love the empanadas.  The guava and cheese is an interesting, but delicious combination.  This location is no frills with a small eat-in bar and outdoor patio.  We've also ordered catering (from the Logan Square location) for one of our parties.  Everyone raved about the food.  Even the Veggie sandwhich was delicious.<br><br>I've recently discovered they offer all you can eat roasted pig with sides and  dessert every Thursday from 6-10pm for $15.  What??!!  I'll be back for that.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BGirYl-UJ2Fg3csRGn_WJw/168s.jpg", "caption": "Empanadas"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EEh1Txk-irL_Ek75DXtD6A/168s.jpg", "caption": "Cubano"}]}}, {"review": {"des": "One of the most overpriced sandwiches for what you get that I've had in a while (next to Panera Bread). Mostly bread and very little meat; typical for most places serving sandwiches these days. Also, the side of beans was laughable! See pic... perhaps the entrées are better but will most likely never find out I don't intend to return.", "pics": null}}, {"review": {"des": "This location has all bar seats inside. On a nice day there are some tables on their patio.<br><br>We ordered to go:<br>We got the puerco rostizado...this was quite tender but didn't quite live up to our expectations....it lacked some flavor or kick. It was fine after adding a little hot sauce and salsa lizano<br><br>The guave and cheese pastry was quite tasty. You can't go wrong. <br><br>The steak sandwich was pretty awesome with the onions and chimichurri sauce.<br><br> I'd probably try something different next time. it's very accessible and has a small parking by lot.", "pics": null}}, {"review": {"des": "Im not sure if this location(clybourn ave) has the same owners as the others but out of the three I find this one to be the least friendly (at least when there is a young woman with blondish hair serving the counter) and the one that over salts their food the most. If that wasnt enough, the ropa vieja sandwich ordered had a measly amount of meat..(im talking less than the size of my fist and Im a small girl so my fist is pretty small) and it was a sandwich yet we got the meat and bread seperate..didn't know it was a create your own sandwhich kind of deal. <br>My bistec sandwich was super greasy. I had to blot it with a napkin and it soaked up the entire napkin. Now we all know we dont eat Cuban food for their health benefits but still I also dont expect a greasy spoon type order..<br><br>The only good thing from our visit was their cafe con leche. <br>If you have dined at their other locations, dont come here expecting the same quality or like me..you'll be in for a dissapointment.<br>Oh yes and when I brought it to their attention, made no effort to rectify the situation.", "pics": null}}, {"review": {"des": "Over priced food. Twice I've eaten here some sandwiches and have become sick. It's too greasy. Will not be returning.", "pics": null}}, {"review": {"des": "Stopped in last night on the way out of the city. Picked up a Cuban (Cubano) sandwich-got it with half plantains and half fries. It was perfect. Will be back.", "pics": null}}, {"review": {"des": "I've passed this cozy spot several times over the years, but only just recently got a chance to go into it. My mom sent me in for a cafe con leche, and I took this as an opportunity to scout the menu out, too.<br><br>The decor is lovely, with old newspapers from Cuba and plenty of cultural art pieces. The space itself is small, but they do have an outdoor patio, which I imagine is nice for the summer. <br><br>The staff seemed overwhelmed by everything going on, and the restaurant wasn't even very busy. Maybe they were understaffed. The counter person was responsible for taking orders, running food and also making all the drinks, which depending on what you get, could take a while. There seemed to be confusion as to where food was going, which sort of dragged things out a while. I imagine it might help if the staff asked their customers if they would be seated indoors or on the patio....<br><br>I waited for 20+ minutes for two coffees and my shake. This was definitely more than I would like to wait, and I consider myself extremely patient. This time did give me the chance to look over the menu though, which was awkwardly placed next to the counter (making it hard for someone just walking in to really get to the menu BEFORE having to place the order). The food I did see looked delicious and reasonably priced.<br><br>I would come back and try the food, but choose a time that's significantly less busy than a Saturday early afternoon....", "pics": null}}, {"review": {"des": "Excellent Cuban coffee!", "pics": null}}, {"review": {"des": "It's good but I had better The white rice was a little cold that's the only thing I did not like otherwise everything else was a thumbs up", "pics": null}}, {"review": {"des": "Oh, this place is so great! Such delicious food! It's a low key restaurant, but worth the wait! Saturday night: packed to the top. Our server Marcos was fabulous:) Def. coming back soon.", "pics": null}}, {"review": {"des": "pick a sunny day, get the Mariquitas for app, and then get the Churrasco for your main! Best Cuban around town!! The service was fantastic, really nice people working here!", "pics": null}}, {"review": {"des": "A unique experience for Chicago dining. The cafe is tremendously decorated with prints of old newspapers and painted scenes. <br><br>Inside the cafe is where you order your food at the cashier. Then there is a small outdoor patio with hanging lights and tables, where they bring out your food. <br><br>I enjoyed an avocado omelet in French bread which was absolutely delicious and my fellow diner enjoyed a burger. <br><br>It's BYOB and very reasonably priced.", "pics": null}}, {"review": {"des": "This is a very small location which I think of mostly to go.... The sitting is very limited however the food is great!!! I've had the ropa vieja and the cubano sandwiches and they never disappoint me. I always get the cafe con leche here as well since they make it right then and there. Service could be a little bit friendlier but that doesn't stop me from coming back!! Lol Definitely recommend it to anyone in the area looking for a good Cuban sandwich!", "pics": null}}, {"review": {"des": "Awesome freakin sandwiches! Stopped in around 10am and grabbed a seat in what can virtually be described as a shack with a kitchen . Only about 10 seats inside...but man was it worth it. Tried their Media Noche Sandwich (a Friday Special) as opposed to their Cuban. Fortunately it was a near mirror image and worth every red cent! Tender pork and ham, pickles, plenty of Swiss cheese, and mustard topped off the dish perfectly. Their egg bread was similar to you're more often seen Hawaiian style bread. A side of maraquitas was icing on the cake! It's understandable the hype, and no doubt one of the best Cuban sandwiches in the city. Now I'm looking to check out their other location, I'm sure it's just as great.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DVNm2RqKNDLQq0b1Ruca5g/348s.jpg", "caption": "Media Noche Sandwich (Friday Special)"}]}}, {"review": {"des": "We went to the Clybourn location. Holy cow. If I could give them an extra half star, I would. I come from Miami and spent most of my life eating this type of food. It's the closest taste to home I have tried in Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eaHJOP3qZXs_96D1B_QpSQ/348s.jpg", "caption": "I love the makeshift ventanita in the background"}]}}, {"review": {"des": "90 Miles is supposed to be CUBAN.  Unfortunately the ownership has decided to make it's recipes Americanized.  If Guy Fieri were to come back and review this place, he would revoke his previous review.   Every time I order there seems to be issues.  Either the Order taker gets the order wrong, or the cooks don't cook the way they used to.  My favorite, over the last 9 years, is the Steak Dinner(The way they cooked 7-9 years ago).  Now the meat has no flavor.  Onions are cooked separate from the meat, the rice is wet not fluffy and the Chimi is nothing to brag about.  It is sad that an ethnic food establishment would change traditional cooking recipes and methods to accommodate those that don't like it.  If you don't like traditional cook food from any ethnic based food establishment, then don't eat it.  I will no longer be eating at 90 MILES.  I found another Cuban place that so far has kept its recipes traditional and cooking methods the same.  Sorry 90 Miles, you USED to be the best", "pics": null}}, {"review": {"des": "Great vibe with really good authentic Cuban food. Very simplistic decor but it works. Service is excellent. You feel at home.", "pics": null}}, {"review": {"des": "90 mile is decent place. But it small portions and it's mad expensive. Plus it's packed like all the time cause hipsters love byob. I've dropped this place off my radar and started to search for that perfect Cuban joint. It's a great place of people who charge things on their credit card then report them stolen the next day. I think the proper name for those people are \"scumbags\". But for us common folk. No point on dropping that much coin on rice & plantains.", "pics": null}}, {"review": {"des": "The food and service are always great here at 90 miles. Unfortunately this time with the passing of my grandmother I won't be able to bring her the great food I use to bring her from 90miles.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qv3V06zqKTPTvNRwC1Jmdw/348s.jpg", "caption": "Me and my son at 90 miles Clyborn."}]}}, {"review": {"des": "TERRIBLE service. Should be called 90 Minutes because that's about how long the wait for a walk-in, takeaway order of soup and a sandwich. Stood waiting for 50 minutes before getting food, during which time the cook lit up and smoked a cigarette in the kitchen while preparing (microwaving) our order. Never again.", "pics": null}}, {"review": {"des": "PLEASE look at my pictures and tell me if that looks appetizing. I ordered the Guajirito sandwich. I have had these before so I knew what to expect, but what I got was sickening. It looked and tasted disgusting. First, they brought it over and the first thing I noticed was the sandwich sitting in a pool of oil. At that moment I lost my appetite but because my boss took me to lunch, I felt obligated to eat a few bites so as not to make him feel bad. I picked up half the sandwich and the oil dropped off steadily, the plantains  AND steak were completely soaked in oil. I took my first bite and knew right away they did not fry the plantain long enough. It was limp and somewhat \"chewy\", you know, the texture of a plantain that is still half raw? It was nasty. Listen, I know the plantains are fried and I'm ok with that but they shouldn't be dripping oil and they should definitely be fried to the point of slight crispness on the outside. The steak should not be dripping oil. They should be embarrassed that they served this to a customer. The rice was ok. Not fabulous, but edible. It was my first time there and it will be my last. I know that this is not what the sandwich should look and taste like, as I've had them before and they've been delicious. Big disappointment.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Is85M3wDDIEpugCsnUZBKA/168s.jpg", "caption": "Oil dripping from the sandwich in addition to the pool of oil it was served on. Sickening!!"}]}}, {"review": {"des": "This place is such a solid place to grab breakfast lunch or dinner. My roommate was seriously craving sandwiches in the morning so we decided to pop by and grab a few to go. I got the Pan Con Lechon which was overall fairly fabulous and satisfied my stomach really well. The slow roasted pork on the inside was really good but on the whole, a little too dry. Also I bit and then spit out about a half inch bone lodged in my pork. The grilled onions on the inside was my favorite part but somehow I didn't notice the shoestring potatoes which were supposed to be there. But like I said, overall, the sandwich was pretty top notch for only $7. <br><br>Empanadas. Yes, get them. They are so plump because they're completely stuffed with filling! Plus the outside is fried to a perfect light golden crisp. I don't think you can go wrong with any of the flavors except for my one small warning: the chorizo with goat cheese is overpowered by the taste of the goat cheese. I barely tasted the chorizo, if at all. <br><br>Note: This location is extremely tiny inside with maybe about 8-10 seats only. Order to-go for sure unless you don't mind eating alongside people waiting in line. Employees are also super nice here!", "pics": null}}, {"review": {"des": "Delicious, just the pick me up I needed for lunch. Casual setting with only 10 stools, its a small and cozy environment. I would recommend take out but there are two locations and this one is a little smaller than the one on Armitage.<br><br>Now for the food, I ordered the Bistec De Palomilla which is a steak type item with onions, tomatoes, lettuce, some sauce, with I think plantain chips. Great for a light/medium lunch. The sandwich itself was good but a little stiff, my jaw felt like I was working it out cause I had to bite the tough bread, otherwise it went down happily.<br><br>Not sure what authentic Cuban food is but this one def was tasty. Would recommend.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1ltNXdN7AiVEGS2DV6G4Gg/348s.jpg", "caption": "Bistec De Palomilla"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aCiGuYQHM677YDU9C52xwQ/168s.jpg", "caption": "Bistec De Palomilla - Grilled not Empanisado"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LmqrzQipJzsPUmhySs-dwQ/168s.jpg", "caption": "Interior, can only seat like 10 people, around 10 stools"}]}}, {"review": {"des": "Just left 90 miles. Although usually a fantastic experience this time is the second bad experience. Today the croquetas were over fried, the Cuban sandwich was dry and the park was fatty and dry. I am convinced the owners haven't been there in a while. The staff was nice but the food was not the same.", "pics": null}}]}