{"name": "90-miles-cuban-caf%C3%A9-chicago-5", "reviews": [{"review": {"des": "Such a good restaurant. Our empanadas were wrong at first we ordered a few different ones and ended with all one flavor. <br><br>The food overall is really good. Don't forget to BYOB!", "pics": null}}, {"review": {"des": "I went to VERSAILLES Cuban restaurant in Miami, which is outstanding and reasonably priced. For my birthday I was so excited to go here, I was expecting to try this place since I loved the Cuban restaurant in Miami. I know every restaurant is different but I was truly expecting 90 miles to be really good. First, we had a reservation for 8 pm, however, we were not seated until 9:15 pm. They have you wait in a room upstairs, I just don't understand why if you make a reservation you won't be seated until an hour later, I understand 20 minutes but not a whole hour. For appetizer we ordered the squid with ink, trust me, it's flavorless, it's like eating bland black beans. The empanadas were actually very good, so please do order that. I ordered the shrimp al ajillo, where do I begin. It's not bad but it's missing something, it just didn't have flavor. I was expecting a more garlic flavor but it was just missing it. I had ordered the same plate at Versailles in Miami and I remember loving it, this one was just bland. The rice was too. My friends ordered steak and they seemed to be as disappointed as I was. The plantains were really good though.  We didn't finish the food, we didn't even take it to go. <br><br>I will give it another try one day and I am hopeful it would be as tasty as people say it is. Maybe I am just biased, since trying that food at Versailles.", "pics": null}}, {"review": {"des": "I rate this an F - for Forget about it. <br>1) Inattentive wait staff<br>2) dirty wine cups<br>3) greasy cold empanadas<br>4) cold food - like everything on the plate was cold and flavorless<br>5) flan without caramel <br><br>F is also for find your groove again 90 miles - what happened? I use to love this place but now all I can say is this is not representative of good Latin cooking.", "pics": null}}, {"review": {"des": "Dang, people be partyin here on a Sunday night! It's BYO(alcohol) and the ladies next to us went all in with bottles of rum. Like, ready to pop off! I could see how coming to this restaurant with a big group of people would be fun. <br>Unfortunately, my friend and I were just looking to catch up over some good Cuban food and this did not work out well for us. Looking back, we should have asked to switch tables but just didn't realize how badly seated we were right away. Oh well. Onto the food. I ordered the puerco rostizado and it was ok. I would probably try something different next time. I do like that their menu has more affordable sandwich options ($11-13) but also a range of different entrees ($16-27). I also really liked the fun decor and outside seating area. Would lean towards 3.5 stars overall.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/agNldPcMztIPRkhSBqA81w/348s.jpg", "caption": "Puerco Rostizado ($18)"}]}}, {"review": {"des": "Excellent food overall. Great vibes inside/out and BYOB (bring your own booze). I highly recommend the Tamal (different from Mexican) Tostones Rellanos (fried unsweetened plantains with shrimp in tomato sauce) and Calamari Crillo (squid in ink).  <br><br>The Calamari Crillo is an adventurous choice but I implore you to try it. It's the reason why I keep coming back. You have to try their mojito. It's great with or without your favorite tequila or rum.  The vaca fritas and the empanadas were OK.<br><br>And the place itself. Get outdoors seating if you can. Indoors eat out back in the garage. The back looks like a garage in Cuba with the sloping roof, clothes line with clothes! corrugated roofing material as part of your wall. The music blares and you have fun.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jMC4SfITGBhgs4Zi9xGibg/348s.jpg", "caption": "Calamar Carillo"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hZZ8Rtyv5hiY8zuTY3oGsg/168s.jpg", "caption": "Tostones / Tamal"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/M2b_i5LzIZZpdu1L-Hx-xA/168s.jpg", "caption": "Empanadas"}]}}, {"review": {"des": "For what seems like a decade, the smell and sound of a particular Cuban cafe has tempted me, but for one reason or another I never found the time to stop by. People love 90 Miles as evident by the afternoon crowds that fill it everyday. Does it live up to the hype though? My answer sadly is no. The food is tastefully average at best and sinfully bland at its worst. <br><br>Since this is my first time, why not order almost everything on the menu? Well...YOLO as they say. Of the sandwiches I ordered Ropa Vieja, Media Noche, Guajirito and the Pescado. A mixture of fries and plantain chips accompanied all of the sandwiches. For sides I ordered the empanadas and a Passion Fruit shake. It was going to be a feast for one and hopefully I would enjoy it. The prices though...ouch. Talk about price gouging. The six empanadas alone were $18 which is virtually unheard of anywhere else.<br><br>I received a call from the staff letting me know the food was done about half an hour after the restaurant opened. It was way ahead of time so now it was all just waiting on the delivery driver. The food arrived piping hot. The smell was intoxicating and I couldn't wait to tear into it.<br><br>Right off the bat I notice the order was a little bit wrong. I specifically requested one of each type of empanada and they still made every single one chorizo & goat cheese...disappointed I was. The empanadas while bigger than normal empanadas were still mostly air. They had a signature \"90 Miles\" imprint on them as well. For something made of goat cheese, the goat cheese didn't stand out at all like it usually does. The chorizo's spices took over everything which was what I was afraid of (hence why I ordered different flavors.) There was more chorizo than goat cheese as well which didn't help. The bread was a fried alright, nothing special. Nonetheless for what they were they aren't worth $3 a piece at all. By far the best thing to come out of this was the sauce they came with which was fantastic, but too little.<br><br>It would be a crime for me to not try out the Cuban sandwich at a place as well known as 90 Miles. Up next was the Media Noche, a traditional Cuban, but with sweet egg bread. When I think of sweet bread, I'm thinking of a nice sweet honey wheat in terms of sweetness...this was nowhere near that. I honestly wouldn't call it sweet at all. There's a distinct yellow to the bread due to the yolk as well. Overall for the sandwich it  was ok, the ham, pork, Swiss and mustard mixed just as you would have expected, but nothing stood out. <br><br>The Pescado was just that, fish. Nothing stood out as well. I tried different condiments to bring out the flavor to no avail. The Guajirito was the most interesting sandwich out of the bunch with the combo of Angus Steak and a green plantain bun, but it also fell victim to not being flavorful at all as well. The disappointing \"mehness\" of the food here leaves me speechless. Maybe it's just me, but the only worthwhile sandwich was the Ropa Vieja which was very flavorful while not drenching the distinct Cuban bread. The fries were nicely seasoned and the plantain chips were what you would expect. <br><br>Overall I expected more from 90 miles. The food seemed pretty average with the best being the sauce and the Ropa Vieja sandwich. It seems what makes 90 Miles special is the dining experience, something which I clearly missed out on due to having the food delivered. I take it sitting back in a Cuban cafe, enjoying a few cocktails while listening to some Cuban music takes it to another level since the food isn't necessarily where it's at.<br><br>3 out of 5 stars", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/R6cbE-69F1HTUxbeSKaT_w/348s.jpg", "caption": "Pescado Sandwich"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MpLOCZzRUKSrFAShwC6ZRA/168s.jpg", "caption": "Pescado Sandwich"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/u8kBVoK3ImK_kxRG-RicfQ/168s.jpg", "caption": "Pescado Sandwich"}]}}, {"review": {"des": "Came here for the first time last week. I had a Cubano (perfect) my date had the shrimp (cooked perfectly.) We split the calamari appetizer which was a preparation I'd never had with a tomato type sauce and toast points. I had heard only good things about this place and my personal experiences have confirmed that. Will definitely be back!", "pics": null}}, {"review": {"des": "Since this place is in the neighborhood of our dogs' walks, we gave it another chance...<br><br>The Ear Grey tea with mango puree was much more dilute than the last visit. I mentioned it to the server and he sorta argued with me, very politely, that it's the same every time and that removing the ice would make no difference. I politely asked for a new drink to be made without ice since we suspected maybe they poured hot tea over too much ice, making the drink watery. (Honestly, idk why it was so dilute, I came here for breakfast, not to play detective with the food quality..) He brought back the drink, not new, but with just the ice scooped out and early grey tea added. I believe that is poor service. It did improve the taste because it at least tasted like tea...not just mildly faintly flavored water.<br><br>Moving on to the disappointing experience... the ham croquette is DOUGHY as a fracking frack frack. Not expletives here but it just tasted like uncooked batter.<br><br>On the upside, the tamale is pretty tasty. Lots of garlic on top. However, it's not the best tamale neither..<br><br>We probably will give it another chance here, maybe...due to proximity and the ambience is pretty cool. Nice outside patio that is dog friendly.<br><br>Another server, the bus boy (is that PC??), brought us dog water bowl even though it was not requested. That is good service. Thank you for that.", "pics": null}}, {"review": {"des": "This place is pretty good and super cute!<br><br>I came here yesterday with a group of friends, and we made a reservation for 6pm (Note that they only keep reservations for 15 minutes, so if you are running late, change your reservation time). The restaurant is super small and only has a few indoor seating spots, but the patio is decent sized.<br><br>I ate before I came here, so I just ordered the beef empanadas and a guava/passionfruit smoothie. The empanadas ($10 for 4 empanadas) were decent, but not the greatest I have ever had. They did not have much in them other than beef, and they just tasted bland. The smoothie ($5), on the other hand, was totally BOMB and I would solely come back just for that!<br><br>As a group, we shared mojito mix because my friends brought Bacardi. The mix was great, but I honestly wish they had alcohol in the restaurant because I'd much rather have pre-mixed drinks cuz I'm not a bartender... though I wish I was, I digress. This place is BYOB and they have a new policy where they charge you a \"corkage fee\" for every bottle you bring. We paid $5 for one bottle. <br><br>My boyfriend ordered the Cubano and it was to die for. I would definitely order this if I came back here because it was wonderful! A couple of our friends ordered the Churassco, and although I'm a steak savage and I devour all the steak when it's in front of me, their steak definitely is NOT worth $27... literally the steak is super thin skirt steak with avocado chimichurri drizzled on top with yellow rice and yuca con mojo. It was a unanimous opinion in our group that my boyfriend's $11 sandwich was much more delicious and worth the price.<br><br>Another annoying thing is that there is only one bathroom for everyone, and the water pressure is God awful. It takes a while to wash all of the soap off of your hands, and if someone was in the bathroom right before you, the toilet won't flush for a couple minutes. There was also a long line of people waiting for the one bathroom.<br><br>As an overall rating, I give this place a 3.5, but I would come back again and try more food and order the Cubano. I would also love to come for lunch instead of dinner.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OHjbWjduX40VrX037ndFtA/168s.jpg", "caption": "Pretty bland beef empanadas"}]}}, {"review": {"des": "Afraid I wasn't impressed...came in at 9pm on a Friday and place was packed with music blasting from every speaker. After a 20 min wait, we were seated in the add-on area. The music was so loud it was impossible to hear anything from my dining companion. We got the puerco rostizado and fricase de pollo. While the pork was ok, my chicken was so over cooked it was devoid of any moisture despite being in a big bowl of stew. It had a texture like fried chicken jerky. Shoulda done ourselves a favor and driven a bit further to Paladar, which has been our Cuban food standby and will continue to be so.", "pics": null}}, {"review": {"des": "This was fantastic. Was able to make a reservation for a large party without a ton of notice. We ordered  several dishes to pass and share. Everything was amazing. Great prices and BYOB. Service was great. And the Cuban coffee is amazing.", "pics": null}}, {"review": {"des": "I made a reservation for 6:30pm on a Saturday for my friend and I. Sure glad I did! <br>It was crowded, the side dishes we shared were, Congri, Maduros,Ceviche, Pork Tamale, & Croquettas.<br>I especially liked the pork tamale,my friend said the ceviche was the best dish.<br>I mentioned to the waiter that it was my friend's birthday so when she ordered the coconut flan he brought it out with a candle & we sang happy birthday! It was good food, a little loud but I would definitely go again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4_FHIUYYLrr2rLyWvg2u1g/348s.jpg", "caption": "Coconut Flan!!! Birthday celebration!"}]}}, {"review": {"des": "The restaurant itself is small, but there is plenty of outdoor seating available! There is live music outside in the back of the restaurant too it seems, but we were seated on the other side of the patio. There is parking nearby available. <br><br>The food and service is great! There are many options so it was hard to choose.", "pics": null}}, {"review": {"des": "Holy FRITA Empanada Man!!!! Damn y'all. I've been looking for Vaca Frita for at least, a decade. Maybe more. There was a spot in Huntington Beach, CA. One day, it was no more. I cried. A lot. <br><br>Then I began the quest. It's taken me many tries, thousands of miles and ten thousand disappointments. <br><br>But folks, I'm here to tell you. I've arrived. <br><br>Needless to say, the Vaca Frita was dope. Stringy, savory, salty and sweet all in one bite. It's definitely what I've been looking for all these years. <br><br>Now - on to the Empanadas. The beef was very savory, the chicken was flavorful, and the chorizo is mixed with goat cheese. Gotta be honest, that kind of threw me off. It was good, don't get me wrong, it's just not my bag. <br><br>Three words to end this meal:<br><br>Tres. Leches. Cake. <br><br>Yeah - hands down - this is a show stopper. Just get it and you can thank me later.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MwYYJjf_hMBb1URS0BMG3Q/348s.jpg", "caption": "I was bested. I'm ok with that."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LPBGqhU36GEjFqPI7wTb3A/168s.jpg", "caption": "Tres. Leches. Cake. Two spoons will not be necessary. But thanks."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fk8DbMeJKYFGD7BtEyesTw/168s.jpg", "caption": "Strong ass Cuban Coffee."}]}}, {"review": {"des": "I love this place I tried the fish and rice and beans and this and definitely delicious authentic Cuban food. I love the fact that its byob and we decided to bring some liquor <br>  Definitely a fun chill atmosphere the whole family can come to.", "pics": null}}, {"review": {"des": "Pleasant night at 90 miles with my girls. I was hoping for outdoor seating but they were pretty busy so we were seated in the in between area. A screened in porch of sorts. Definitely had that Havana vibe going. We didn't bring anything to drink and we totally regretted this because 90mi is BYOB. Instead of ordering one entree I decided to sample a few appetizers. My first pick was the sopa de pollo appetizer. Don't let the fact that it's an appetizer fool you. The portion is pretty big. I also ordered 3 empanadas which I couldn't finish and took home. Had them for lunch the next day and they were great! Very easy to reheat. My lady pick was the congri, it was delicious. Had some of it left over too! <br>Wasn't fond of the service, my food came about 15min before everyone else's and I didn't want to start eating without them so I waited (whole my food got cold) for them to bring the rest of the food. That was annoying.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fRRAJrEv2a2nh2u3Mi72VA/348s.jpg", "caption": "Guajirito Sandwich"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rARmzjjPTfDhZcFM2vsBZA/168s.jpg", "caption": "Guajirito Sandwich"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-_oOX2qZrpVdOnCIIxY79Q/168s.jpg", "caption": "Tofu Vegan Entree"}]}}, {"review": {"des": "Such a fun and delicious place - the Cubano is out of this world. Also loved the empanadas (the goat cheese one is phenomenal) - the perfect spot for a celebration. Byob is a nice touch.<br><br>I brought my family for my birthday celebration and everyone loved it! Parking is a bit tricky on a weekend, but completely worth the hunt to find a spot and enjoy such a flavorful and authentic Cuban meal.", "pics": null}}, {"review": {"des": "Our first time yesterday.  Started with Empanadas.  I had chicken- loved the accompanying chimichurri :)  Avocado Toast was rated very good, had a good sauce on it.  I liked the Pan Con Lechon though I didn't really like the plantain chips that came with them.  Cute place, hard to find parking but I thought it was good lunch.  I recommend that you check out their menu online before going so you don't wait too long to order.", "pics": null}}, {"review": {"des": "I was very disappointed with the food lastnight. It was a girls night out and we were very underwhelmed. We have been here in the past and this visit left us wanting. <br><br>The food was cold. The flavors were not the same. This place is a byob, and the wine glasses were dirty. The tostones were not fried completely. The maduros were raw. The white rice was cold. The rabo was not tender. The empanadas were not fresh.<br><br>Today, I am sick to my stomach. I will never return.", "pics": null}}, {"review": {"des": "It's unbelievable how flavorful the food is here! The Porco Rostizado is one of the most flavorful and delicious dishes I've ever had in my entire life. Honestly you can't go wrong, it will all be delicious, but this dish in particular will rock your freaking world.<br><br>They take reservations, which I highly recommend since this is a popular spot. But if you show up day of, you can hang on the back patio (weather permitting) which has a great ambiance. 90 Miles is BYOB, which is certainly nice when waiting on that back patio! More importantly, you can buy sangria mix and pour in the wine you bring from home, or you can buy mojito mix and pour in the rum you bring from home! That's the veteran play at 90 Miles.<br><br>One of my favorite places in Chicago, a must-do if you like unique cuisine!", "pics": null}}, {"review": {"des": "Got there with no reservations & told that they had a hangout spot upstairs that's BYOB, which is a pretty nice concept while you wait for a table. Really busy, and service was okay.... took forever to bring us silverware and never checked on us. Make sure you get reservations to not get a shitty table by the entrance where people knock your stuff over. Overall, food was delicious & loud environment", "pics": null}}, {"review": {"des": "I got the Lechon and it was absolutely amazing. Extremely flavorful shredded pork that was both tender and crispy with just the right amount of fat, leaving the dish savory but not over powering. The plantains were cooked perfectly; soft and crunchy the outside, they had a thin layer of crunch created by the cooking process that naturally caramelized the fruit. Their beans although simple, quietly compliment each dish as well.<br><br>The wait staff continues to be attentive and friendly each time I go.<br><br>I have yet to try the pig roast but I'm putting it on my to-do list. My date got the cubano sandwich which he gave rave reviews to and apparently was featured on diners, drive ins, and dives.<br><br>Bonus, this location turns its outdoor seating into a Christmas tree lot in the winter months! How cool!", "pics": null}}, {"review": {"des": "I'm very disappointed with this restaurant.  I went with my wife to eat a Frita Cubana (Cuban burger) when the food coming to table and I started eating my wife saw a LONG HAIR came out of my mouth (ridiculously) I call the guy to told what happened with my food, he call the manager and she ask  me if I want another plate. I thinking twice and I say ok bringing in.BUT WHEN THE CHECK COMES OUT THEY CHARGE ME FULL PRICE! No bueno after embarrassing moments did I has,,right now I like owner of barbershop will not recommend this restaurant of any of my clients", "pics": null}}, {"review": {"des": "It's 9/26 and I have no idea what the resolution is to my bad experience. Is this going to be resolved or are you going to keep writing \"it's resolved\" when itsnot? I'd like to know what the resolution is right here right now please. You certainly took my money so am I getting a refund? What will happen? ***<br>It's 10/16 and I read about 90 Miles stating I have a motive??? Really? What about your motive??? <br>The complaint wasn't only about a bad sandwich and missing utensils- but of course that's too much to expect from your establishment. Honestly your customer service is awful and you don't know how to run a restaurant- I don't event feel bad saying that.", "pics": null}}, {"review": {"des": "This was one of the first restaurants I went to when I moved to Chicago. What a great experience. There is so much to love here! Three locations, three times the fun!<br><br>The FUN THINGS:<br>BYOB with no corkage fee, $1 select empanadas 3:00pm-6:00pm for happy hour, PIG ROAST on Thursdays, live music on Tuesdays, patio during the summer!<br><br>The YUM THINGS:<br>Papas Rellenas, ALL THE EMPANADAS, tamal, CUBANO sandwich, Ropa Vieja!<br><br>Can't wait to come back here!! Exceptional!", "pics": null}}, {"review": {"des": "It was my first time to try cuban food, and I was not disappointed. The sandwiches for very large and the fries were season amazingly. The next time I am in Chicago I'm going to try this place again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/t6fWdQaqEh0hnp9I5OYG5g/168s.jpg", "caption": "Chicken sandwich will not leave you disappointed"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/g8ZLiZeiyBFy15IRTQLFQw/168s.jpg", "caption": "The meat pie was amazing."}]}}, {"review": {"des": "Today was my first time visiting 90 miles Cuban Café . I do not have too much to say for now. I will have to come back very often in order to improve my experience. However , for my first little try , I and my girl friend both love it . We ordered two different plates . She got a salad while I worked on a tropical steam white rice . In overall , we enjoyed the time in ; my girl friend  really liked her plat which I did as well . The Salad was very good and light . In other hand , the personnel , especially our server was very professional and very engaged in his explanations and recommendations about the menu while getting orders from us . Nice guy By the way . I keep it one star less for now ,in order for more better Experiences in the future . Stay tune .", "pics": null}}, {"review": {"des": "Love this place! It's great for a group of any size, and I highly recommend it for date night! My wife and I love coming here and stuffing our faces with the empanadas (psst always ask for extra chimmichurri)! We have an on going challenge that we have to try at least 2 new items on the menu each visit, and it has been an amazing experience ever single time! <br><br>Oh and it's BYOB so let the good vibes roll in. Summer is probably one of our favorite times to go, but it's good all year round!", "pics": null}}, {"review": {"des": "This place seems to get better and better I love the atmosphere and the people that work here I miss the days where you would get lots of food was great value but now it is just good quality food which is an always but not as much in quantity but I would still recommend 90 miles to Cuba", "pics": null}}, {"review": {"des": "First time here was great. Second time not so much. They now charge a corkage fee. So if you buy a $10 bottle  of wine, the corkage fee will be $10 plus another $12 for the sangria mix which is basically buying a bottle of wine at a restaurant. LOL<br><br>Also service was brutal. And the food...they ran out of the Churrasco which was absolutely my favorite. I'm not sure how you can run out of your best dish on a Thursday night. Yikes. Just seemed like the food was prepared half hearted.  Wasn't as good as I remembered. Sigh.", "pics": null}}, {"review": {"des": "So many reasons to come back to this place and I can't wait to bring my wife here. I came here for the first time about a month ago with my co-workers. We started off with some of their appetizers, which were incredible. We had the meat filled potato, shrimp balls of some kind with a great red sauce, and then some empanadas. All of them were outstanding. For the main course, I decided to try the Cubano given it was my first time here and voted too 10 in the US by Yahoo. I am not a big fan of Cubans, but this one was very good and I was not sad I ordered it. However, the burger sounded fantastic and there were some other sandwiches/dishes that I really wanted to try. Also, the French fries here are my personal favorite. If you like them a little crunchy on the outside, but light and fluffy on the inside, these are it. They remind me of Cajun fries which are the best. Can't wait to come back here and hopefully try many more of there dishes!", "pics": null}}, {"review": {"des": "Delicious food, a homey and cozy atmosphere, BYOB, and a great outdoor patio...what is not to love about 90 Miles?!  I had only been there for evening dinners during cold months before, but last week my husband and I swung by for lunch on the first warm day of the year.  The patio was open (which was appreciated since most restaurants hadn't yet opened up their outdoor areas yet) and the place was hopping.  We didn't remember it was BYOB but won't make that mistake again.<br><br>The brunch menu is impressive with a number of sandwich and plate options along with their full menu.  We opted for some empanadas and a couple sandwiches.  We tried the 3 for $10 empanadas, going with shrimp, chicken, and goat cheese/chorizo.  The chicken was by far the best and the shrimp was surprisingly good.  The goat cheese/chorizo was excellent but a little heavy on the cheese and overwhelming.<br><br>My husband went with the cubano and I opted for the pescado.  The cubano was excellent and about as good as a cubano sandwich gets.  Heavy and filling but tasty.  The pescado was also good - the fish was cooked to perfection and deliciously fresh and moist.  It was lacking a bit in sauce or flavor, but they gladly gave me some garlic sauce and hot sauce to dress it up a bit.<br><br>Looking forward to more spontaneous lunches at 90 Miles with some fun drinks while the weather is nice!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yvfjlRdo_Sp357yqVhv4Tg/348s.jpg", "caption": "Cubans sandwich"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WqKwzeh-8ITkwIvvY9gJDg/168s.jpg", "caption": "Pescado sandwich"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2b67Od_w_vGqBiZa8w4oKQ/168s.jpg", "caption": "Delicious and quite large empanadas"}]}}, {"review": {"des": "Had an amazing time the waiter Franco was amazing and manager Ana made sure we had a great experience and the food was delicious will be back soon", "pics": null}}, {"review": {"des": "Arrived on a hot Saturday afternoon with my family. My sister recommended this place -- (the larger of the two locales) -- and it did not disappoint! <br><br>When we entered we asked to be seated inside & were escorted to the tent back area, but it was ridiculously hot and we asked to move in the innermost part of the restaurant. Thought it silly to move us back there because it was probably as hot as the outside patio (keep in mind temp. was hitting high 90s). Eventually we got the seating we wanted and were able to cool down. <br><br>I ordered the mozzarella empanada & pollo a la plancha, and salida del sol as drink. The mozzarella empanada was a dream come true and I promptly ate it before anyone else asked to try it. I highly recommend it, especially if you're a cheese person. I don't always run into variety empanadas so this rocked. The main entree was a large portion, two large pieces of chicken, along with the plátanos maduros, rice, and beans. Overall delicious. Plantains cooked perfectly (I personally prefer a little over cooked or burnt, but this was a well executed middle ground). I definitely had leftovers. <br><br>Salida del sol was not too sweet and quite refreshing. It had the right balance of tea and purée so that it was not overwhelming on one end. If anything, I just wish both essences were stronger to get more of the taste. I ended up having a small cafe cubano, that was really good. <br><br>I did sample the tres leches and bread pudding from others and they tasted good. Quite sufficient portion as well. Not blown away but good. <br><br>Next time I'm in Chicago, I would love to come again for the ambiance and food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jRMZE7QAJiwrZe69q9BLuw/168s.jpg", "caption": "Mozzarella Empanada"}]}}, {"review": {"des": "Amazing atmosphere, food and service. So much character with  wonderful Cuban details throughout. There was so much to look at and admire. It completely brought me back to Havana (visited in Dec 2017). They have plenty of seating tightly inside and outside. We got seated right away for our party of 7 reservation at 630pm, which we called in about 20 mins earlier. Service was impeccable. Our waitress was polite and very attentative. The 3 Empandas (chicken, beef and shrimp) were delicious. We inhaled them. The Churraco was tender and full of flavor. We enjoyed every bite with the rice and yuca. Highly recommend and do plan to make frequent returns.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jt2l_hVQFKbNidkIPSplYg/348s.jpg", "caption": "3 Empanadas"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LiHYMLtGEq1MS0abeq8NKg/168s.jpg", "caption": "Churrasco"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-pchK6yHsl0aU64EeNg5Yg/168s.jpg", "caption": "Bistec"}]}}, {"review": {"des": "I am SAD to give out a 3-star review, but here it is. IF I didn't order and fall in love with the Cuban Hot Chocolate, this would be knocked down one more star.<br><br>We came here from a recommendation from a coworker. I should say also that I feel SPOILED from Cuban food from the best place ever in Seattle. So yes, my review is biased based on other Cuban food that is out there.<br><br>I ordered a Cuban sandwich with friend plantains. The sandwich was a panini and was also incredibly small for $20. The plantains were just ok and I was absolutely admiring my coworkers fries. So my advice would be to kick the plantains and just order fries.<br><br>The other disappointment was they would not split the check. When traveling on business it is VERY inconvenient to make one person fork the bill every time and pay them back each time. I do not like traveling with my perdiem in cash either in fear of losing it. And we all know ATM's are not practical for everyday use. <br><br>However, the hot chocolate was AMAZING and if you do want to try this place out skip food and just get this.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/T3vxgdfpe4YjqbfvGIx41w/348s.jpg", "caption": "Cuban sandwich with plantains.$11"}]}}, {"review": {"des": "Interesting decor with random pictures and clothing hanging from a clothes line lol. Felt like we were in someone's family back yard.  Very unique interior inside! You can totally feel you are in Cuba by watching cuba channel on TV, seeing the drawing on the wall, etc. Overall, this place is a GOOD value for the money and I can't wait to go again!", "pics": null}}, {"review": {"des": "Holy empanada this place is good!! <br><br>I would walk 90 miles for this Cuban sandwich. The atmosphere was amazing too! The back patio is lovely and we were told it's BYOB so won't drop the ball on that one next time.  I could live without the grilled cheese sandwich but bites of my bfs Cuban made up for that. We will be back!", "pics": null}}, {"review": {"des": "My honest review as someone that lives in Miami and eats Cuban food all the time.   This restaurant was very disappointing.   <br><br>Meals ordered <br><br>(2) Ropa Viejas: Ropa Vieja itself was decent although it did have too many extra ingredients.  The rice was tasteless and the plantains were severely under cooked.  <br><br>(1) Breaded chicken came lightly breads to my surprise and they said that's how they serve it. My daughters barely ate it.   I figured I would<br>Go home and toast it up more. <br><br>A real breaded chicken comes with a thick bread crust that has some flavor.   This place was lacking true flavors", "pics": null}}, {"review": {"des": "Great ambiance, awesome food. I didn't realize how awesome Cuban food could be in Chicago but I had one of the best breakfasts I've had in awhile.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8p7nGY3K5PBM5ZrEtt8sdQ/348s.jpg", "caption": "90 Miles Special with the bistec. Awesome."}]}}, {"review": {"des": "I've been here too many times to count!  If you like cuban food then do yourself a favor and visit 90 miles.  It might just be the best cuban restaurant in Chicago.<br><br>I usually order the camarillo bistec with yellow rice.  Every time I leave here I feel like I just had a homecooked meal from somebodies cuban grandma - yes, it's that good!  It is BYOB and for $5 they will make sangria for you!<br><br>The ambiance is one of the reasons I love this place as it transports you to another place.  I've never been to Cuba but when I step into the restaurant I feel like I'm on vacation and having dinner where to locals eat! The prices are steep but well worth the price.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2bjGcHmOcwXxIxBeH-UmtA/348s.jpg", "caption": "Bistec Pallomilla"}]}}, {"review": {"des": "5 Stars Across the Board!! I ordered the Lechón - Pulled Pork in delicious spices come with white rice beans and plain rains. I substituted for yellow rice as you can see. <br>Only Con was that their blender was broken so I couldn't try the strawberry shake and given the heat I was really wanting it lol. <br>Interesting decor with random pictures and clothing hanging from a clothes line lol. Felt like we were in someone's family back yard. But the foot taste like something ya grandma put her foot in so I'm here for it!", "pics": null}}, {"review": {"des": "I'm Cuban and This is okay Cuban food for Chicago but very mediocre when comparing it to any Cuban restaurant in Miami, even the worst Cuban restaurant in Miami is better than this one. Bring your own alcohol and they can prepare drinks for you like Mojitos. Churrasco was okay but the chimichurri was terrible, it wasn't a chimichurri. Croquetas are okay nothing special either. Cuban eat arroz congri as the most traditional rice not yellow rice, please update your menu.", "pics": null}}, {"review": {"des": "Very nice outside patio, and everything tastes pretty good. I would recommend the empanadas as an appetizer! There's almost always a wait for dinner on the weekends. But they take reservations, so definitely do that. BYOB is kind of cool, and depending on the weather, it's a pretty nice atmosphere outside.", "pics": null}}, {"review": {"des": "Such a cute restaurant. I'm so glad we stumbled upon here during our visit. We got the chimmichurri steak, chicken empanadas, black beans and tostones. The steak was really good and the chimmichurri was an avocado based one which I'd never had before. It was really good. The chicken empanada was fantastic! I want to do the sampler next time of them to try all the flavors. The tostones came with this yummy minced garlic stuff on top which was a nice touch (not for my breath though... lol) my least favorite out of everything we got was the black beans, they just seemed to not have much flavor. Overall everything was great and look forward to coming back next time were in Chicago so I can try some new dishes here.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rrtHVUkjRAgIHYPmiyP6Og/168s.jpg", "caption": "One of the patios. Cool atmosphere."}]}}, {"review": {"des": "The atmosphere was wonderful. The restaurant made it feel like tropical Cuba indoors even on a 30 degree April day. We got seated promptly and our food came fast. The house salad with mango dressing was very good and went well with our sandwiches. The bisteck sandwich had a good garlicky flavor but the Ropa vieja was only so-so. It was a bit soggy so must be consumed onsite or will not be good. Overall Good experience.", "pics": null}}, {"review": {"des": "As a fan of Cuban sandwiches (Cubano) I have always heard about the awesomeness of 90 Miles. Anytime I go to Miami I always have to have the Cubano as they do them right there. Also, Cafecito which is near me in South Loop does a great cubano but now that I have had 90 Miles its in that top tier mix of Cubanos that I have tasted as most places do not get it right.<br><br>I came by on a late Saturday morning and parked about half a black away on the diagonal street that the place is housed on which crosses Armitage. I got a seat in the front area of the restaurant and I already knew what I  wanted. The cubano was as good as any as the bread was the right amount of crispy texture and the roast pork and ham was something special along with the pickle and mustard. I got a cuban expresso after and it was awesome! Love this place and the authentic Cuban vibe going on here. I look forward to coming back and having another Cubano as well as some other dishes!", "pics": null}}, {"review": {"des": "Come for the Cubano, stay for the music!  I've been here a couple times, and the combination of quick seating, BYOB, great food, really friendly service, and easy access via transportation will keep me coming back.  Only thing I wasn't impressed with was the chorizo/cheese (I think it was goat cheese?) empanadas; they seemed more than anything to just taste like cream cheese, but maybe it's just personal taste.  I loved the other varieties.  <br><br>(Also, if you're driving, there's free parking all around the neighborhood if you go a block or less away)", "pics": null}}, {"review": {"des": "I've been going to this restaurant for many years now. Being Cuban I'm very particular about what Cuban restaurant I go to. This restaurant in my opinion is like my mom cooking in the kitchen. Everyone that I've taken there has agreed that the food is delicious the service is excellent and the BYOB option will save you a lot of money. I highly recommend 90 mile Cuban Cafe", "pics": null}}, {"review": {"des": "This place is great. The food is delicious, the staff is very helpful and courteous, and the atmosphere is unique. It's BYOB which is also a major plus, however I didn't realize until after we got the bill that there is a $5 cork fee. For the food, our party started with the ceviche. It was pretty good, although honestly I couldn't taste the fish in it. For my meal I got the Guajirito sandwich. It was basically a steak sandwich on plantains instead of bread. It was delicious, and I would definitely order it again. The sandwiches come with your choice of plantain and potato chips or fries. I got the chips as they were recommended by our waiter. I was expecting the chips to be a bit more like plantains/banana, but they were really just like restaurant made chips. They were really good but a bit greasy for me. Next time I'd like to try the fries. Thanks for a great meal! I will be back!", "pics": null}}, {"review": {"des": "90 miles Cuban Cafe is the small neighborhood BYOB joint that it is fun place to be and eat some delicious Cuban food. A friend and I came here on Saturday afternoon. We were able to get a table without a reservation but I could see how you would need one as it is a popular place. <br><br>We started with a couple of chorizo and goat cheese empanadas appetizers, which were amazing! I would highly recommend them for anyone that like chorizo and goat cheese. My friend ordered the Puerco Rostizado, which was savory and delicious. Looking for steak, I opted for the Bistec de Palomilla. The steak was marinated and cooked well though there was a tad bit much of raw chopped onions that got in the way of just enjoying the meat. However, the steak and onions with the rice and beans all together still was very good as complete entree. The black beans, rice and fried plantains that comes with each entree each were all excellent. Don't know what the hell they put in those beans but they're delicious! Service was great and prompt. Great experience! Definitely looking forward to coming back here in the future.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ltlGjJpvxKjLhLNcPdJ_pA/348s.jpg", "caption": "Bistec de Palomilla. But heavy of the onions but still great entree option."}]}}, {"review": {"des": "Another hard review to leave because I like location food and ambiance a lot. But the ridiculous corkage fee and I wonder if legal since you don't pay for a liquor license. They twisted it to a recycle fee but I do work as a wine rep and took bottles with me. That's the kicker two almost full bottles and a cheap one a cider and $30 added on to Bill?! With tax and tip that's a lot. I talked to our fab wAiter and he reduced it to $15 still I haven't been back sadly and will not until this ends. Usually byob means free unless they also serve liquor and then yes you do pay a fee. I brought my own glasses opened wine myself so what was I paying for? A recycle fee I might understand if given a choice. Also out of hot cocoa that night.", "pics": null}}, {"review": {"des": "If you're looking to go out with a big group, 90 Miles is the spot. It's a chill atmosphere here, with colorful artwork and an open-air space. Make sure at least one person at the table orders the ropa vieja, and get tostones and deep fried sweet plantains for the table. Best of all? It's BYOB.", "pics": null}}, {"review": {"des": "Best Cuban Food in Chicago, the sandwiches are great and so are the plantains. Also BYOB plus it's affordable. 5/5 great place", "pics": null}}, {"review": {"des": "Kindly do Not Insult my Intelligence by Saying there is a, 'Bottle Recycling Fee!!!'<br><br>                I've not Seen it in the Headlines <br>                               -- Please -- <br>       Do NOT give the City or County any Ideas!!!<br><br>I Doubt Your Mason Jars are Expensive. Charge for Breakage if Legal. It is the Responsibility of Each Server to Keep Track of his or her Wine Key(s). <br><br>Instead of that Outrageous, 'Recycling Fee' of $10.00 a Bottle, there are Other Ways to Make Profits: Sell 16 Oz Stemmed Glasses with Cuban Motifs; Sell Collectable Beer Mugs; Sell Souvenir Jackets; Sell Cigar-Shaped Bottle Openers; Sell HandMade Cigars; Offer Valet Services; Present Cooking Classes with Take Home Chef Kits; Give Salsa Lessons; Enterprise!!!<br><br>              Don't Stiff your Loyal Clientele! <br>                 Check with your Alderman <br>             -- Inquire About Tax Credits -- <br><br>Get Glass, Plastic, Paper, Aluminum & Cork Bins delivered to your Door; there are Always Cost Saving Programs ... <br>Remember: <br>                     It's 90 Miles to Freedom <br>           NOT BACK towards DICTATORSHIP!!! <br><br>PS: LeftOver Wine can Be Taken Home in a Properly Sealed Bag ... they are Complimentary at Savvy Restaurants; however -- if you MUST Charge, a Little Change will Do ...", "pics": null}}, {"review": {"des": "I have been to this place so many times... I'm surprised it took me this long to review it. Every sandwich is delicious! The lechón is my favorite, but everyone else I know loves the cubano. But I'm such an appetizer fiend- I love the empanadas and the ham croquettes with their black beans and white rice- that's my go-to meal, for sure!<br><br>A side tip: you can take your own bottle of wine and they'll mix up a delicious sangria for you! The mix is amazing and tastes great with red or white wines.", "pics": null}}, {"review": {"des": "Love the food not too keen on the prices. The cheese empanadas are so perfectly made. The simplest empanada yet so dar delicious!! The café con leche hubba hubba come to momma. The ceviche is so refreshing to my taste buds!!", "pics": null}}, {"review": {"des": "We arrived with a group of 6 on a Friday at about 8. It was packed, but the servers found us a temporary table and got us all comfortable. After about twenty minutes and great apps, we were moved by the staff to our real table on the patio. There was an old typewriter on the table that didn't work but I wished it did, would have been a fun way to commemorate the evening. I had the pulled pork dish and it was fantastic, and huge, the plantains were perfect and I had dinner the next night as well. Everyone was very happy with the meal, but even happier with the bill. One fellow's meal was late out of the kitchen, so they gave it to us for free! And they comped our pitcher of mojito mix, definitely planning on coming back to this awesomely decorated, well appointed, fantastically tasting family run Cuban restaurant.", "pics": null}}, {"review": {"des": "I found 90 Miles to be a bit overrated.  Really cool decor and ambiance but the food wasn't that great to me.  I got the Cuban sandwich, supposedly the best in the city, and it tasted like every other Cuban sandwich I've ever had.  The calamari appetizer was uninspiring and the chicken sandwich was very, very bland - like no seasoning at all.  Maybe I didn't order right because it always seems to be crowded and there's plenty of rave reviews, but I don't see it.", "pics": null}}, {"review": {"des": "Authentic vibe and super friendly staff. The food was tasty, but salty on the price. Both sandwiches my wife and I ordered were good but on the dry side. I would have given more stars if the prices and food were more closely paired.", "pics": null}}, {"review": {"des": "Came back to have some Cuban coffee and sandwiches. There is plenty of street parking. And once inside we got seated right away. <br>Once inside the place has décor that takes you to Cuba. <br>The coffee is good and strong, as for the sandwiches they were also great.  I asked to get the plantains for chips but got a mix of potatoes and plantains. <br>Overall it was a nice experience.", "pics": null}}, {"review": {"des": "The food was very good and the drinks were very fresh , I can't wait to go back. Wonderful little spot and the team there really work together to satisfy the customers.", "pics": null}}, {"review": {"des": "Ropa Vieja $17 and Empanadas ($4 each, $10 for 3 or $18 for 6) are my go to's here.  There are 6 types of empanadas - beef, chicken, mozzarella, vegetable, chorizo & goat cheese, and shrimp. The Ropa Vieja dish comes with tender roasted shredded beef, onion, bell pepper, garlic and creole salsa.  This place is usually packed, but there are more seating than the outside might lead you to believe.  Great food, but not worth the wait during peak hours, although they do provide a nice waiting area upstairs.  It's BYOB, but I couldn't seem to find a corkscrew in the waiting area, so remember to BYOC.  The service here is fast and friendly.  There's also a lounging area upstairs to use while you wait for a table.  There's limited parking in the small parking lot and on the street.<br><br>....| \\      _  , , , - - , ,  _  ,      <br>.../  , ` . - ' ` '             . _   \\ -  ;  ;  ;  , _    <br>..| ,  a  -   )   ) _         . ; .  (   ` - ` -  ' - '   <br>'  - - - ' ' ( _ / . _ ) - ' ( _ \\ _ )", "pics": null}}, {"review": {"des": "This is definitely a situation where I wish we could give half stars. If we could, I would be hovering around 3.5. <br><br>There is a lot of hype surrounding this restaurant and we wanted to try it for the longest time. We finally decided to do it and we were satisfied is the best way I can describe it. The food was good, atmosphere was nice and service was mediocre. I typically don't like to talk about price because yelp gives us their ranges, but I felt $$ should be more like $$$ and I think that is expensive for what we got.<br><br>All in all, I am glad we went, but I won't be traveling to Chicago just to eat here again.", "pics": null}}, {"review": {"des": "Used to LOVE 90 miles. This experience was almost so bad I may not go back. Our waiter was meh, he ignored us most of the time. The food took a very long time to come out and we got the special \"burger\" that was not very good at all. The mojito mix tasted like water with very little lime, mint, or sugar.<br><br>What makes this two stars is the management. We had sub par food/service all night and the manager or host asked us to move ourselves upstairs when we had already called a car that was 4 minutes out. We had been seated for about an hour and the food took forever to come out. Not only was it super inconvenient and she knew we were leaving in a few minutes anyway, but she was SO rude about it. <br><br>Pros- great cortadito this time and great bussing team. We always had water!", "pics": null}}, {"review": {"des": "So disappointing it's becoming embarrassing... I've tried to bring other people here three times in the last month and I've had such bad service. It seemed like everything we asked our server Marco he was annoyed about. He never smiled and came off like he was in such a bad mood. I was excited to bring family here and now I'm embarrassed I recommended we go for lunch. I think it's finally time to stop coming here, the service is so important when you go out to eat and this place just doesn't care whether you receive good service. The food is good but just expect okay to bad service when you come.", "pics": null}}, {"review": {"des": "After watching the Movie \" The Chef\" all we could think about was eating a Cubano. Luckily 90 Mile Cuban Cafe was close. We were very happy to satisfy our craving in this delightful restaurant .<br>Great atmosphere , friendly vibe and good Cuban food!", "pics": null}}, {"review": {"des": "Love the food here but the music is simply too loud. And they refuse to lower the volume even after multiple requests. Too bad.", "pics": null}}, {"review": {"des": "I went ahead and updated this to a three based on the manager's thoughtful response, but I'm not going to return for a long time.<br><br>____________________________________________________________________________<br><br>I always visit 90 Miles Cafe when I visit Chicago (my hometown).  But just five minutes ago I was embarrassed by the server and her manger when they messed up my sandwich, so badly that I got up and walked out (and left my bf with my CC to pay). I'm not sure I can recommend this place to anyone anymore going forward.", "pics": null}}, {"review": {"des": "Very unique interior inside! You can totally feel you are in Cuba by watching cuba channel on TV, seeing the drawing on the wall, etc. <br><br>The dishes are also great! Our server was busy so the service was delayed sometime, but we enjoyed anyway. We ordered some appetizers and main dish, and the taste of those was so delicious! <br><br>We brought a wine! Here is BYOB! You can enjoy it as sangria too! We also did! It was very romantic. <br><br>** they charged us total $22 for alcohol. <br>$12 for sangria(it's not a alcohol sangria. They serve a pitcher with ice&sliced fruits so we can make it as sangria by shaking with the wine we brought), $10 for recycling fee for wine bottle. Is it normal? <br>If you bring your own wine, want to enjoy it as sangria, you should pay $22, even though it was your own wine. I feel I paid double price for it. It's the tail wagging the dog. If they charged us $12 only, then we accepted it as reasonable. It's a bit expensive.**", "pics": null}}, {"review": {"des": "Great food and atmosphere. They even provided us a dessert for the birthday boy! The byob is a great bonus,<br>Keeps the bill super reasonable.", "pics": null}}, {"review": {"des": "Went for dinner with friends recently and got the snapper and ceviche. Both items were great! Along with the restaurant being byob and the great sangria mix they offered our dinner was fantastic. Will be back with friends again soon!", "pics": null}}, {"review": {"des": "Really fun BYOB Cuban place. The food is delicious. I loved the octopus appetizer, the pork entrees, and the dessert empanada (with guava and cheese).  Also the grapefruit soda was really tasty. It was cutely decorated and all the outdoor space was really awesome for a nice summer evening.<br><br>The server was nice, but was slow getting to our table and coming back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JuZWgCu8AxOdIfYTypM7ZA/348s.jpg", "caption": "Outside front of restaurant."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OJS8kbt4IB5DhFzzv94hNQ/168s.jpg", "caption": "Inside restaurant by take out coffee window."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZGYQjc_NAdSBJBDSXGxu_w/168s.jpg", "caption": "Back portion of restaurant. It's covered outdoor patio."}]}}, {"review": {"des": "Don't waste your money!! Me and my boyfriend both ordered the churrasco but instead of yuca mojo we substituted it with yuca Frita. The price was $27 on the menu, when we got the bill one plate was $32.50 and the other was $29.00<br>This was odd to me so I asked the waitress why the prices differed from the menu and she said it was an upcharge for the yuca Frita. I still don't understand the difference in prices!! BESIDES the weird prices I have never.seen such a small price of steak! I must have taken all of 5 minutes to finish my plate. I've been to 90 miles many times before and I feel like over the years the portions have become smaller and smaller. This resturaunt has great food don't get me wrong but I feel like they need to stick to the basics and keep it simple. Won't be going back I can literally get the same price of meat at Tonys for $6.99", "pics": null}}, {"review": {"des": "90 Miles is such a great place in for an authentic Cuban experience in Chicago. <br>(NOTE: I am not Cuban nor have I ever been to Cuba but from what the media has lead me to believe Cuba is like, it seems pretty spot on. Also they have at least two photos Niurka Marcos on their walls-- pretty legit if you ask me.)<br><br>I came here with coworkers and the restaurant was super accomodating-- they let someone charge their phone behind the bar (which I know is annoying request, but still nice that they did). I'd recommend making a reservation, too, as it can get packed.<br><br>The BYOB mojito/sangria option is awesome and is a lot of fun in big group. Everyone I was with really enjoyed their food as well. I had the guajirito, which is similar to an jibarito and it was one of the best I'd had in the city. <br><br>Just as a heads up, I don't think they can split checks with big groups so that's something to keep in mind. <br><br>90 Miles is a really fun place if you're looking to break up the monotony of your average Chicago restaurant. Go soon (or by the end of the summer) so you can still enjoy the patio!", "pics": null}}, {"review": {"des": "I been to this restaurant twice and I can't find any flavor on their food I do not like it and I do not recommend it specially me I love eating out and trying new places but this one I would give it O stars", "pics": null}}, {"review": {"des": "Totally awesome place.  Great authentic food, very cool vibe, solid service.  A Chicago gem.", "pics": null}}, {"review": {"des": "Wowwww did this place live up to its expectations!!! This has been on our list of places to try for sooo long now. We went with a group of 5 and had a reservation a few days in advance. They make you wait until your whole party is there, but the waiting area is an awesome patio outside. Essentially the whole restaurant has open air in some way. Really great vibes! <br><br>The food was awesome as well-- I wish they had a few more shareable options like tapas style, but that's just me. Go HUNGRY bc the food is hard to choose from and pretty big servings!! <br><br>We also brought our own wine, but beware of the sangria mix. It's expensive and they don't tell you that when you order . They have a strict 2 hour time limit, but that shouldn't be a problem for too many... overall, this place is a GOOD value for the money and I can't wait to go again!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eD_HEinoTgyvcCqXyka1fw/168s.jpg", "caption": "Chicken dinner"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QM1hm89_yLcQkP9MWLjS7g/168s.jpg", "caption": "Pork and plantains dinner"}]}}, {"review": {"des": "Went in for the first time and was treated so rudely by the hostess with braids and a very bad attitude. <br><br>Don't bother coming here with a party of more than 4 because evidently that means that you cannot sit outside, but instead are relegated to a huge table right next to the waiter's station in a insanely loud, cramped dining room. <br><br>The food was good, but we were so uncomfortable that we were unable to enjoy it. Won't go back which is a shame.", "pics": null}}, {"review": {"des": "Cubano sandwich is pretty good but the skirt steak is not. Skip it and get empanadas instead. Plates are nice and large so if you are not very hungry you can share a single plate. I felt that the food was salty overall and had to drink a lot of water. The music here is loud but upbeat. Parking can be difficult because it is at a 3 way corner.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ahPsqzxRt9IGRYaNCXahwA/348s.jpg", "caption": "Stopped by here for lunch after looking at the square nail across the street for furniture"}]}}, {"review": {"des": "This is one of my favorite restaurants in all of Chicago. Great for big groups (whether the staff likes it or not) and awesome atmosphere year round. We come here for lots of birthdays.<br><br>Great menu items that are perfect for sharing and well priced great food. Also great for pick up when you just want a hearty sandwich like their Cubano. BYOB also.", "pics": null}}, {"review": {"des": "The food is good, the service is iffy at best. We tried the chicken, beef, and chorizo and goat cheese empanadas. The beef one was the most flavorful and the chicken and chorizo were good but pretty blah. The chorizo in particular fell short and sort of tasted well, like chicken. <br><br>For an entree, I had the lechon and it was just okay. It lacked bold flavors of the citrus mojo and was just kind of average. Beans and rice were totally average. Tostones lacked seasoning and were dry, which is a bummer because they are normally my favorite.<br><br>The service was terrible. It basically didn't exist. We asked for hot sauce and chimichurri and it took half an hour plus several reminders. They were generally very slow and disorganized, which put a damper on the evening.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/csrGc6w438q46YqdP_meWg/348s.jpg", "caption": "Frita burger"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0h0xvA9W201Vu1wNtp7iMg/168s.jpg", "caption": "Lechon - maduros were good but the pork lacked flavor"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/q1CQSooLpbhWs7F_tlkRRA/168s.jpg", "caption": "Tostones"}]}}, {"review": {"des": "Had a truly terrible experience tonight, however, do not be dissuaded. The manager, Delfino, corrected the situation and remained pleasant throughout. He saved a customer and should be applauded for his poise. <br><br>Thank you again for your help this evening. Cheers", "pics": null}}, {"review": {"des": "One of the best Cuban places in Chicago!! You will feel like you are in Cuba when you come here!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1LsRXuVHYDQq3gM_BxmHxw/348s.jpg", "caption": "Frito Cuban! Hands down one of the best Cuban place (if not the best) in Chicago! You will feel like you are in Havana !"}]}}, {"review": {"des": "The food is all very tasty, and the ambiance is great too. I really recommend the Cuban sandwich and the chicken stews. I'm going to come back very soon.", "pics": null}}, {"review": {"des": "The atmosphere is really fun, definitely different than your normal dining experience. The food is good, the empanadas are amazing. Good food, ambiance is loud, energetic, and fun. My only complaint would be the fee for uncorking and sangria mix. It's BYOB which is awesome. You can bring wine and they will make a sangria for you, however they charge 10.00 to uncork, then they charge another 12.00 for the sangria mix. So all said and done you bring a 15 dollar bottle of wine and it costs you 37 dollars for a pitcher of sangria!", "pics": null}}, {"review": {"des": "I wouldn't recommend this restaurant for food that will blow your mind, but it's a great spot for a fun group dinner.<br><br>The food ranged from decent to slightly disappointing. The calamari in squid ink was pretty good, the empanadas were good but not memorable and I was not impressed with the Guajirito. The steak was dry and flavorless and there was hardly any cheese on it to make up for that. <br><br>BYOB is huge. They will provide mixers for any alcohol that you bring. We chose to bring rum to add to the fresh virgin mojitos. Not buying drinks definitely keeps the bill manageable. <br><br>The ambiance is super fun and festive, and the outdoor area is lovely if you can get a table out there. Staff is super nice and the wait ended up only being 30 minutes for a group of 8 with no reservation on a Friday night! If you're in need of a last minute spot before going out, this is a good choice.", "pics": null}}, {"review": {"des": "Food was absolutely delicious- friends ordered the sandwiches and I had a pork speciality. All incredible. <br>Gorgeous outdoor seating. <br>Only slight negative - we ordered the mojito mix (brought our own bottle of rum) and it was a bit tasteless- not enough mint or sugar maybe?", "pics": null}}, {"review": {"des": "90 miles is one tasty option when looking for a BYOB spot with some flair. Although they are better suited for spring, summer, fall, don't avoid coming in winter.<br>The main building is a tiny 6 table dining room, while the massive back room is a fully enclosed space in the winter with a partially removable roof in the summer. Additionally, the outdoor patio at the front of the house doubles the size of the restaurant in the summer months.<br>The food is delicious, and they offer themed night ranging from Paella night to Lechon night. Keep an eye out for entertainment, ranging from dancers to the Bandoleros. <br>I will say one confusing thing is their BYOB fees, rules and regulations. I truly believe you need a PHD to solve the mystery of what you can and cannot consume without an up charge to the corkage fee. Better come prepared and bring in a 5 gallon bag o wine to play it safe, or roll a keg in with you....", "pics": null}}, {"review": {"des": "The hostess at this restaurant makes the experience GReat for the patrons her name is Alli. If you could give 100 that is how we would rank her.", "pics": null}}, {"review": {"des": "Delicious coffee. Delicious food. The papa rellena is bomb. Last time I was there I had a lechón sandwich I believe, it was amazing!", "pics": null}}, {"review": {"des": "Excellent sangria made from your own wine. Perfect tacos and chicken soup. Very busy. A little cramped in the main dining room. Very good service. We will return.", "pics": null}}, {"review": {"des": "Great food. Awesome ambience. Byob. Easy for large groups if booking ahead! Definitely worth it!", "pics": null}}, {"review": {"des": "I love the Cuban home feeling about this place! Our waiter was very sweet and did a great job asking us if we needed drink refills and checked on us. Ok now for the food details I had the pollo sandwich with palatine/potato chips. Forget the potato chips even though they were good too but the palatine chips they are so delicious! The steak sandwich was good too. I liked the flavor both sandwiches had different taste. I also had the passion fruit/strawberry tea I loved the taste it wasn't sugary and all natural ! Must try ! And to top it off I took a cafe con leche home you know cause I'm a nursing student and need to hit the books. Everything was great about this place the atmosphere and music.", "pics": null}}, {"review": {"des": "This was my first time having Cuban food. I walked in and was told there was an hour wait unless I wanted to eat outside.  It was gray outside, with a slight breeze and I decided to go for it and sit outside.  They then lit a little fire, which was nice so I didnt get cold when the breeze would hit.<br><br>I had read this was a byob, I brought with me a bottle of sangria. They provided me a bottle opener and glasses. <br><br>As an appetizer we ordered empanadas. Chorizo and goat cheese and chicken. The chorizo and goat cheese were my favorite.  They were creamy with a slight kick. <br><br>For my meal I got the pollo a la pancha. It wad grilled chicken with onion on top, white rice, beans and plantains. Yummm! I was so happy with my choice everything was delicious, so much better than I had imagined it to be. The serving was generous I had a full meal for leftovers.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/505DNSqmPuEgHQ6OhZkZdg/168s.jpg", "caption": "Pollo a la plancha"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uTFecRvA8ffh0iYkaIgVQw/168s.jpg", "caption": "Chorizo and goat cheese empanada"}]}}, {"review": {"des": "Place is always packed! Make sure you do take out if you are just a party of two! Or get ignored all night you are there. Seems waiters only cater to big groups and can care less for small sitting of two. <br><br>Food is delicious, <br>Decor is nice<br>Service is horrid", "pics": null}}, {"review": {"des": "The chorizo and goat cheese empanadas is AMAZING! I had the puerco rostizado and that was fantastic. Ask for hot sauce if you like some heat. For real get the CHORIZO & GOAT CHEESE empanadas. You can send me a thank you note after.", "pics": null}}, {"review": {"des": "Great food - definitely recommend the Ropa Vieja (they have both a platter or a sandwich). Plantains are delicious. Now the bad part-waiters need to pay attention to their tables and not the hostess. Tiny cute hostess needs to not whisper B to her customers.", "pics": null}}, {"review": {"des": "Everything about 90 Miles is perfect. I've been with a large group, I've been for a birthday, I've been for a date night. The food is always tasty, the staff is always attentive, the drinks are always flowing, and the flamenco dancers are always impressive. I recommend 90 miles to anyone who is in from out of town looking for a different dinner experience. And how could I write a review without mentioning the oatmeal milkshake? Don't miss it. I mean it.", "pics": null}}, {"review": {"des": "I mean, I know I'm just heaping more praise on this place, but it really deserves it! I have been to both Armitage and Clybourn locations and both have had fantastic service and food. Armitage of course has less seating in and out, but I have never had to wait for a table there.<br><br>In the past I have split many a sandwich and empanada. The sandwiches are delicious, while the empanada meat is sometimes on the dry side. However, I want to take a minute to discuss the Masas de Puerco: though when I ordered it I was wearing a tight dress with the hopes of eating light and going out afterwards, I sacrificed a slim silhouette in order to eat this juicy, delicious, flavorful pork. It was not too fatty but tasty, tender and savory- definitely worth being full for the next two hours.<br><br>I can't wait to come back when the patio is open and I can again eat until my clothes rip.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IH3XytzCkLoqwBcLHd85zQ/348s.jpg", "caption": "MASAS DE PUERCO, will you marry me?!??"}]}}]}