{"name": "ada-street-chicago", "reviews": [{"review": {"des": "So Good!<br><br>Had Dinner at Ada and it did not disappoint. There were two of us and we had a reservation. (Recommended) it's an intimate spot with dim lighting which illuminates romance. <br><br>We shared a bunch of small plates. Steak Tar Tar and Shishito Peppers were the starters. The peppers for sure had a nice buttery flavor. Was hard not to want to jump into the bowl.<br><br>We also had the scallops as well as the fish. Both Nicely seasoned and well prepared. <br><br>For drinks we had Jack Daniels Boulevardiers and Old Pals! So good and well prepared!!", "pics": null}}, {"review": {"des": "Weird location, very cool vibe. They have a pretty large set of vinyls that you can ask them to play, it's great for smaller groups and has the perfect ambiance for long conversations. <br><br>I went this past weekend with some friends and grabbed a couple of their small plates: steak tartare, black fried rice, georgian cheese bread, chocolate ganache, parsienne gnoochi. <br><br>Would strongly recommend the black fried rice, it's cooked with fresh forest mushrooms and has this incredible savory, salty, and earthy taste. The georgian cheese bread was a last minute add on our part and it definitely stood out. I've never had bread with a raw egg yolk on top, so kind of an interesting way to serve.", "pics": null}}, {"review": {"des": "Saturday night at 9pm got a table for two immediately.  Took 10 minutes for our server to stop by though.  We ordered 4 dishes to share.  That's probably the way to go there.  While everything was tasty, nothing was great.  Steak was over cooked.  Hummus was a little bland.  Scallops were good but we got three for two people.  Wife wouldn't split the third, so I got shafted.  <br><br>I don't know what happened.  This place used to be amazing.  Tonight I was unimpressed.  The highlight of the meal was the cocktail I suppose.  But I left still hungry after dropping $100 for 2 people.  That's just never good.  <br><br>Don't think I'll be going back anytime soon.", "pics": null}}, {"review": {"des": "The place: You have to be looking for this place. Plenty of parking, which is great, but you can't so easily just stumble upon Ada Street. But also, doesn't being in the know, kinda make you feel a little warm and fuzzy inside? You enter into a long, candlelit hallway. It's sexy. It'd be a great 2nd or 3rd date place. Service was on point. Speedy. Courteous. Helpful. We came in famished, and they didn't seem thrown by our need to order immediately, which was followed by us inhaling our food.<br><br>The taste: We shared the carrot harissa hummus, the sweet potato burrata, pao de quejo, parisienne gnocchi and the pretzel bread pudding. The sweet potato burrata was my personal favorite, but the gnocchi, was also pretty delightful. it reminded us of potato blintzes for all you yelpers out there who know what we're talking about. The pretzel bread pudding wasn't what we expected - not exactly a let down - just different. The whipped cream could have been a little more maple-forward, but was still good.<br><br>My face: A little annoyed when the OpenTable rewards card caused a bit of a hullabaloo, but other than that, a smile after a really delightful dinner with a good friend. Final bill $64 for 2 people, with no drinks. Worth it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/L2iWyaIc2pFHV6S2LXk5JQ/348s.jpg", "caption": "Leftover Swan"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8liRk1A2d7xpfncns8QcBA/168s.jpg", "caption": "Pretzel Bread Pudding"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-rvJPnD9zys-Syejjp7lRQ/168s.jpg", "caption": "Parisienne Gnocchi"}]}}, {"review": {"des": "May I say... NO WORD IN THE WORLD CAN DESCRIBE HOW MUCH I LOVE THIS PLACE. Yes. It was my first time visiting Ada Street, but I instantly got the see the reason behind all the raves. Let me break it down for you. <br><br>We started with the CARROT-HARISSA HUMMUS. Both my boyfriend and I were truly blown away by the flavor. To be honest, I first ordered this dish solely for the sake of consuming some veggie. And when we took the first bite, we were so glad that we ordered that. The harissa brought a perfect sense of heat to the dish, while the carrot added another layer of freshness to the hummus. With other seasonings involved, it was such a perfect twist on the hummus that it was familiar and different at the same time. On top of that, the pita on the side was soft and warm. It was such a perfect match to the amazing hummus. <br><br>Moving on to the ELOTE DIP. I was so grateful that they turned the traditional Mexican street corn into a dip. And honestly, it was so good that I didn't even need the chips to enjoy the dip. All I needed was my spoon and devour lol. On top of that, I wouldn't leave a mess on my face. That's for sure a bonus!<br><br>When the SEARED SCALLOPS was served, looking at how dark and deep the searing mark was, I was a bit skeptical about the cooking on the scallops. I was so concerned that my scallops would be way overcooked. And when I cut into them, boy was I wrong. Those scallops were perfectly cooked, leaving them soft and tender in the center. <br><br>Our last dish was the MERGUEZ MEATBALLS. They were jam packed with spicy and earthy flavors. Along the whole meal, we were commenting on chefs' incredible palate and the use of all kinds of spices. There's nothing fancy about this dish, but it was so hearty and humble that it spoke right to my heart. <br><br>All in all, everything has been perfect with Ada Street so far. I'll definitely check back with this place and try some of its drink options. See you then :)", "pics": null}}, {"review": {"des": "Took my husband to Ada Street for his birthday last night. Perfect spot. Love the location, felt like I was walking into a speakeasy. Door just has street number. Long brick hallway with a room or two off to side with private parties? Candles on floor. Super sexy. Small restaurant in back, you can view small kitchen, long bar with stools. Not many tables. GREAT music. Small bite menu.... my favorite! Who eats big meals anymore?<br>We had pao de quejo -fried cheese with spicy salsa.  Insanely simple and crazy good. Scallops, black fried rice and pasta special that tasted like Hungarian goulash my Hungarian friend used to make. Lovely. Drinks were delish. Can't recommend enough if you want a sexy, cozy evening.", "pics": null}}, {"review": {"des": "Whew this place blew me away. I came here for a bachelorette dinner with a fixed menu. I'm telling you every single course was phenomenal. The standouts our of the eight courses were the forbidden black rice and the gnocchi with asparagus. Also the ribs. Also the meatballs. Also the grilled peppers. Lol. You see where I am going with this. Everything here is good. The service was excellent, our server Bryan was really sweet. The vibe of this place is very homey and romantic. Definitely seems like it would be a great date spot. I loved it!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7X48Si92WAk3F6SJPAx13A/168s.jpg", "caption": "Forbidden black rice"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YBHBetm5vJsnpr9Lw7U2sg/168s.jpg", "caption": "Bread pudding"}]}}, {"review": {"des": "Came here for the first time on a random Sunday night. What a great decision.  <br><br>Cocktails - mindblowing. Just do it. <br><br>Hanger Steak - a little on the sweet side but good. <br><br>Lamb Skewers - FYI these are fried. Also a little on the sweet side but fall off the bone. Must eat. <br><br>Steak Tartare - so good. Rich but delicious. Extremely fresh and flavorful. Loved the presentation. <br><br>Crispy Black Eyed Peas - yum! Such a great snack with a drink. <br><br>Pretzel Bread Pudding - one of my new fav desserts. Made with pretzel bread! So warm and gooey.", "pics": null}}, {"review": {"des": "I came for restaurant week 2018 and I was SO excited for the theme. I still love the theme but thought the meal left something to be desired. I wasn't very full. I had the broccoli, black rice, and chocolate dessert. Everything tasted VERY good but the portions were really small. I highly recommend a drink with their jalapeño tequila.<br><br>I previously came in 2015 for a normal dinner and loved it so I will give this place 4 stars. Based only on restaurant week menu I would have given it 3.<br><br>Ambiance is nice, dark and chill. Feels like a speakeasy. Service is pretty good.", "pics": null}}, {"review": {"des": "I have been waiting to dine at this place from a very long time . We decided to have a gals night and our friend picked this place and I was really excited to try it . Its really a speak easy place and it took me a while to figure it out .Interiors were nice but tables were a tad bit close for my choice . Our hostess was very nice but from the time we arrived they kept on reminding us there is a reservation right behind us and were almost forcing us to order drinks and apps . That was a big let down . Our server was great and knowledgeable. we had really good drinks but the food was really okay ! we ordered Burrata ( it had sweet potato in it ) .. I really didnt like the sweetness of it . Pasta was really good but wish it was a tad bit warm to enjoy the flavors. Chocolate ganche was really okay ! There was no single dish that stood out . I felt like food lacked flavors and was on a bit sweeter side.We had a good time but really not coming back.", "pics": null}}, {"review": {"des": "I happened to be at an event in this area, and stumbled upon Ada Street for late night eats and cocktails. The restaurant is very discreet, so look for Ada Street written on the metal door and walk right into this warm and inviting speakeasy. You walk down a hallway to the hostess, and can be seated in a smaller dining room or the larger dining room/bar area, which opens up to a quaint back patio. I loved the dark and cozy ambience, and my absolute favorite aspect of the restaurant was that they only spin vinyl music. Patrons of the restaurant can pick out music from the vinyl collection on one of the walls to be played. So awesome!<br><br>We sat at the bar and ordered the following cocktails: the Fucking French Martini (so yum!), Be Nice to Me (a sweeter prosecco cocktail), and Moon Glow (a dry gin drink). All of the cocktails were spot on and expertly crafted. Shout out to the bartender Chad, who was super knowledgeable and friendly. For small bites, we ordered the Pao de Quejo and Lamb Skewers. The food was very good, and we would definitely order the Pao de Quejo again (who doesn't love cheese bread??). After our small meal, we were given Amaro, compliments of the bar. Amaro is a delicious liqueur that you drink after your meal to aid with digestion. <br><br>Overall, I was very impressed with the service and friendliness of the staff. We were checked in on by multiple staff members and made to feel very comfortable. Ada Street is definitely worth the visit, just for the ambience and experiences. But of course, stay for the delicious cocktails and vinyl. I am looking forward to returning!", "pics": null}}, {"review": {"des": "My mom was in town and I wanted to take her out for a really nice dinner, so Friday night we headed to Ada Street. When they arrived at the hallway had no lights on whatsoever, only small candles placed on the floor. This was remedied by the time we left, but it was a little difficult to find a way to the end of the hall! <br><br>We were graciously greeted and seated on the patio. It was nice to sit outside on the patio is really not much to speak of. Our server, Adira (sorry if I spelled that wrong!) was great and offered wonderful recommendations. <br><br>I could not say a single negative thing about any of the food or it's preparation if I tried. Every single thing we ate was absolutely delicious. However, some of the portions were so skimpy it was practically offensive to pay what we paid for it. The word \"chintzy\" was bandied about more than once. We started with the heirloom salad which was lovely, but only had about five slices of tomato along with maybe 5 cherry tomatoes that were sliced in half. Had they added just two or three slices more it would have looked like a much more substantial dish. The same goes for the fried green tomatoes. For $12, I think it warrants more than two slices of tomato, and frankly we really wanted more. It was beautifully fried and topped with a wonderful mix of corn, watermelon, and cheese. It was wonderful! Four slices would have made it seem like a reasonable portion at very little added expense to the restaurant. The next 2 dishes seemed very normal in terms of portion size. The burrata was wonderful. It had the cool creamy texture you expect from burrata with a bit of a kick from the jalapeno it was paired with. In addition, grilling the bread is really the way to go. We also tried the Parisian gnocchi. That was a hearty portion as well, and really delicious. What made that dish was the fantastic, lemony pistou. For dessert we had the pretzel bread pudding, which was good but nothing to write home about.<br><br>I'd love to go back, but frankly the things I liked the best, the heirloom tomato salad and the fried green tomatoes, are just not worth the price. They were the hands down favorites. My mom and I would both have taken more of that and thrown the rest of the dinner at the window even though it was quite good.", "pics": null}}, {"review": {"des": "In a word: Amazing!<br><br>When manfriend decided not to have a birthday party, I remembered several friends, whose food opinions we trust, raved about this place, I booked a bar table here.<br><br>If you've never been in this area, it can feel like you've made a wrong turn. It's just far enough from Hideout and Local Foods, that you might begin to think that your GPS or Lyft driver is messing with you. Upon entering, it's dark and there's a sign guiding you back to the host stand.<br><br>I loved sitting at the bar. Sure, it's not as private, but it was easy to interact with the bartender and observe the food and drinks coming and going. They started us off with a little bubbly for manfriend's birthday and we ordered a few cocktails (Chick Habit & Papa's Got a Brand New Bag), both of which were fantastic. We had a few more drinks that night, but I forget which ones; I do know they did not disappoint.<br><br>Our bartender/server guided us through the menu; telling us his favorites, giving us, portion suggestions, and tips. We ordered the house bread, burrata, pao de quejo, steak tartare, meatballs, scallops and salmon. I can't speak for the steak and meatballs, but everything else was wonderful. Of the dishes I tried, the only one I'd skip the next time around was the salmon; it was good, but average compared to the rest. One dish not to be missed is the pao de quejo. Manfriend was crazy about the steak tartare; so bananas for it, he wanted to come back and just get a few plates of it. We closed out our meal with the chocolate ganache, which unsurprisingly rocked. <br><br>Ada Street was a wonderful experience; my only regret is not heeding our friends' advice and making it here sooner. It's not a cheap dinner, but felt on par for the quality of the food, drink and service we received.", "pics": null}}, {"review": {"des": "really good food! but first, i had to walk in an alley to get there. a nice bartender named Jessie gave us little free drinks because he knew my friend- that was sweet and a nice welcome for me since it was my first time there. dark, cool atmosphere. it is just really expensive for what you get. 4 small dishes and 2 cocktails for $100 is a lot of $.", "pics": null}}, {"review": {"des": "After attending a wedding that was catered by Ada Street awhile back at marshalls landing, I couldn't shake the craving for the Gnocchi that stole my heart that day.  <br><br>Thankfully, to my surprise Ada Street is not far from my house at all, amazing and dangerous!   We stopped in on a Wed night around 8 and at first I was thrown by the small street and somewhat off the beaten path area, I was so pleasantly surprised when we walked in, when you first enter this labyrinth, we didn't know what to expect but the sweet jams playing over the sound system guided the way to the back where the main restaurant is.  On the path you pass smaller more intimate dining areas as well as several doors that are not very clearly marked (will get back to that later).  The candlelit romantic vibe was just what the hubs and I needed that night.  We started with a porter for him and a fucking french martini for me,  (that's what is was called and I made sure to order it with gusto :)<br><br>I am a bit of a sally when it comes to tasting my booze but I do love a good cocktail and this bad boy was amazing!  so refreshing and light but definitely packed a punch.  <br><br> Servers were very attentive, it wasn't packed but they were on it regardless and very nice, great with suggestions as well.  <br><br>For mains we went with ( I had to go online and look up the names)<br><br> - PAO DE QUEJO $10  - this is what god intended when he created mozzarella sticks, lol  these were little balls of lightly fried cheesy goodness with a spicy marinara sauce on the side, so tasty (5 pieces so you know we were both eyeing that last one, alas we split it!)<br><br> - GOAT CHEESE DIP 12 - this was not your mama's goat cheese dip, it was light and decadent at the same time, the bacon jam wasn't overly sweet and the grilled crostini was perfect for dipping.<br><br>SINGAPORE CHILI CRAB CAKES 11 - these were the only misfire during our entire meal, after having pao de queso aka cheese ball amazingness, these crab cakes were dense and not very flavorful and the chili sauce was heavy when I was hoping for lighter, overall I would say skip these for sure. (I knew we should have went with the scallops:)<br><br>PARISIENNE GNOCCHI 13 - these little bites of goodness are just plain perfection, so soft yet had a nice sear on each one, they are so perfectly paired with brussel sprouts, kale, shallots and a light cheese.  I could eat these all day every day or at least until my pants don't fit anymore.  <br><br>PORK ADOBO 14 - the description mentioned sweet potato hay which I was curious about but that I never found in the dish..  what I did find was the most flavorful, juicy pork I have ever had, this dish was so good, my husband recommends adding a few of the gnocchi to the tortilla with the pork but I could eat that pork solo even sans tortilla all day.<br><br>And if you can believe it, we actually ordered dessert after all of that goodness!  we had the chocolate ganache with sea salt and for some reason I was thinking it would be more than just ganache but nope, it was just pure chocolatey decadence a nice scoop sprinkled with some sea salt and while this was great for the first few bites it is very rich so if you aren't into that sort of  thing maybe opt for one of the other desserts.  We liked it but may now have diabetes, just sayin'..<br><br>Thank you Ada Street we will most definitely be back and next time we're bringing everyone!", "pics": null}}, {"review": {"des": "LOVE  this place.<br><br>The bartender seriously know what there doing. Classic cocktails created to perfection, or made with a  twist, they never ever disappoint. They really know the right proportions and content - I never knew how much I loved a gimlet until I came here.<br><br>The food is amazing. I've as both non-veg and veg items here - I don't know which is better. They are all amazing. The lamb chops and the black fried rice (veg) are must tries!<br><br>Cannot wait to come back here and try more things. <br><br>Not to mention - I have a severe but allergy and attended a NYE event here once - the staff went above and beyond to accommodate. It was a lovely experience and I really recommend any mid-high end restaurant  to take notes from Ada st. They know how to treat their customers and they should be the standard when it comes to service, allergy accommodations .... and cocktails!", "pics": null}}, {"review": {"des": "We came here for dinner on a Sunday and really enjoyed all the small bites on the menu. Especially loved the lamb and the scallop. The dessert here are pretty good too, loved the banana pudding.<br><br>The location is a bit weird, opposite a yard filled with huge recycle trucks and a bit hard to find.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qN_bgydn5qhV5GrOMFiIxQ/348s.jpg", "caption": "Bread pudding"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6dZfcjceGydo4YxbrjTp6g/168s.jpg", "caption": "Scallops"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SjNYNr48oXr5xOc1zAmlIw/168s.jpg", "caption": "Beef tartare"}]}}, {"review": {"des": "Wow. I agree with all the raves. Easy 5. Certainly off the beaten path but less than a ten minute bland but not at all spooky (well lit) walk from North & Ashland. Stuck back in a nice warehouse area with no real signage. You realize it's really cool the minute you've found the right door. Bustling on a Tuesday night. Somewhat limited menu thoughtfully and inventively executed. Lots of veggie options. (shishito peppers and gnocchi were outstanding). Our waiter, Michael, was professional, attentive and enthusiastic; he was unequivocal in his recommendations and a lot of fun with the creative wine list. The chef was working side by side with everyone else, delivering food etc.. We've lived in Wicker Park for years and love the WP restaurant scene; Ada was as cool, fun and good as anywhere in our area. Can't wait to try their huge outdoor area in the summer - but we'll be back long before then.", "pics": null}}, {"review": {"des": "HOLY YUM!!!! Where do I start!!? No seriously, I think we ordered EVERYTHING on the menu. <br><br>Came in on Friday night with a group of friends. No reservations.. we did have to wait a while.. A LONG TIME. Like an hour, no biggie . Just a small restaurant with minimal room for waiting. <br><br>My ONE issue was a server came over with our drinks and dropped my glass of red wine and it got ALL over me and my new satin jacket, she did apologize but that's it. I had to rush to the bathroom to try and clean myself up and didn't succeed .. ruined new jacket.<br><br>Now on to the food. Everything was great, we ordered tons of plates and just ate tapas style. The steak tartar, tuna tartar, and gnocchi where my absolute favorite, I wasn't a fan of the forbidden rice .. fairly bland and zero wow factor.<br><br>On  the dessert, yes. We ordered them all. Again, delicious. My favorite was the chocolate with toast. Sooooo good.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Sbq5NMKciS1sjafidabVEA/168s.jpg", "caption": "Trio of dessert"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/n6_bKoJ3qRTcdrLM_JPfWg/168s.jpg", "caption": "Delicious Steak Tartare."}]}}, {"review": {"des": "I can't even put into words how much I love this place... good food, good drinks, good vibe, great service! All of the food was amazing and my drink was the best cocktail I've ever had. I can't remember the name but it was a spicy purple tequila drink. The entrance to the restaurant is funky and makes you question going at first but once you get past the dark hallway everything is amazing. Definitely recommend for a nice dinner out!", "pics": null}}, {"review": {"des": "Every bite was great. Loved the elote appetizer, fried green tomatoes gnocchi, fried rice and salmon. Bread pudding was very light and perfect. Great cocktails. This place is hard to beat.", "pics": null}}, {"review": {"des": "I went right when it opened that day and service was great food was phenomenal and so were the cocktails. <br>We ordered 3 dishes.  first we had cold asparagus which I was very skeptical about since I wasn't a big fan of asparagus but man oh man it blew me away it was so good. Severed with a lot of parmesan. Next we had the gnocchi. I find the serving size perfect even though it is small but perfect if you are getting multiple dishes to share. Best gnocchi I've had. Last we had the hanger stake with balsamic. I loved the balsamic with the steak give it a little sweet kick. Melt in the mouth to die for food.", "pics": null}}, {"review": {"des": "Reallyyyyyyy cool spot. I don't think hipster is the right word nor speakeasy. It has those feels but more upscale? Dim lighting, industrial feel (obviously the neighborhood), intimate spaces, private front room, very limited seating and small menu. <br>Plates meant to be shared, very small portions but very delicious food. We tried the lamb skewers, forbidden black fried rice and gnocchi. All amazing could not go wrong. Oh and we also got the chocolate dessert: it was six pieces of toasted bread and a huge olive-oil, sea salt covered glob of chocolate that melted in your mouth. <br>Even though my friend called ahead they didn't have a table for us but we had the choice of bar seating or seats watching the chefs cook. Went with bar seating, server was incredibly knowledge and friendly and fun.", "pics": null}}, {"review": {"des": "Thankfully, there was no wait for 3 people since we called ahead and arrived early around 6pm on a Sunday but we could still only get bar seats. <br><br>Cocktails = 5+ stars. Amazingly well crafted. We tried 4 of them. In order of preference, we liked stoned to the bone, stranger than kindness, all night Nippon, in the bleak winter. <br><br>Service =4.5 stars. Spot on and knowledgeable. Though we were only offered bar seats, there were empty tables during the whole course of our dinner, which was irksome.   <br><br>Ambiance = 5 stars. Speakeasy style. low lit with candles. You can pick from their old record collection to play the next song. Their bathroom smelled nice too.<br><br>Food =  3ish or so. <br>We didn't realize the restaurant was not offering the full menu due to restaurant week. This made our selections certainly easy. The 3 of us tried everything on the RW menu but it would have been nice to not have to order 3 desserts. The 1st courses were not too enticing...not sure if I would have selected these out of a full menu...though the crab dip was decent. the 2nd courses were better - the scallops were perfectly cooked but only 2 in a plate so it was tricky to share among 3 people. The mild curry dish with cous cous was a hit more than the chicken which was slightly bland in comparison. Both desserts were okay but I preferred the bread pudding (small portions) over the ice cream. Not sure if there was much of a value in the RW menu especially since we had to get 3 desserts. <br><br>Overall, I still had a good time and I would be open to coming back to try the regular menu.      <br><br>Note: the location is very remote. Also we were warned to remove any valuables from the car since their parking lot has been broken into lately.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IW7JhKydtWDWwVUP40cXYQ/348s.jpg", "caption": "All the rw2017 apps"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/50FmjjFf2DHGgVGlGkByRg/168s.jpg", "caption": "Couscous curry and the chicken over mashed potatoes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bVbdz-38e7I5CJuC4MQayQ/168s.jpg", "caption": "Cocktail menu"}]}}, {"review": {"des": "Eat here if you want to spend the night lipreading with your table. Food is really good. Service could be more aware of their surroundings as it is pretty tight in there. But the noise level has to be about 120db. Partly due to the acoustics. But why do they have to blast the music?? It was almost unbearable. Do your patrons (and their ears) a favor and turn down the music.", "pics": null}}, {"review": {"des": "This place's location is super random but I like it cause it's sort of hidden. If you're coming with more than one other person you will probably need a reservation to eat here but when I came it was just two of us so we sat at the bar and it was perfect! There is also a cool outdoor area in the back. This place has a record player going and has a really cozy vibe. Decent prices and service. Good date spot!", "pics": null}}, {"review": {"des": "I don't understand all the horrible reviews for RW. It was a pre set menu , and I got the broccoli, black rice and cereal bars. The portions were pretty small, but I didn't leave starving by any means . If anything, I thought the drinks were the overpriced part. The cereal bars were small, but VERY sweet. I loved the vibe but would like to try with their original menu in the summer .", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FiJvqsuawv6Hw1b44bkRlw/168s.jpg", "caption": "Fried chicken"}]}}, {"review": {"des": "LOVED!   The experience I had during restaurant week was glorious.  I would recommend this venue to anyone and everyone.   I've been several times over the past year.  However, for restaurant week - they really showed up and showed out!!!!<br><br>Fantastic service!", "pics": null}}, {"review": {"des": "Hip little restaurant in a hidden spot. Food was good with even better drinks. Would recommend 2-3 small plates per person. We were celebrating a birthday and they ended our dinner with champagne.", "pics": null}}, {"review": {"des": "Been here many times, so it's only fair I give Ada Street a review.<br><br>This is one of my favorite restaurants in Chicago.<br><br>Atmosphere: 5/5 - could this place be any cooler?  It's intimate but airy, cool without trying too hard.  They nailed it.<br><br>Service:  5/5 - always kind, lighthearted, and most importantly, attentive.<br><br>Drinks: 5/5 - I had one of my favorite drinks of all time here.  Watermelon, Lime, jalapeno-infused tequila.  Incredible.<br><br>Food: 5/5 -  I'm never disappointed when I come here.  The food is always top notch, and Ada currently holds my title for best dessert of all time.  Pretzel Bread Pudding.  Literally changed my life - I almost cried as I ate it.  I know that sounds insane, but it's the only time that's happened to me.  So there's that.<br><br>Value: 4/5 - It's not inexpensive, but compared to trendier / more conveniently located restaurants, this place gives you a good bang for your buck.<br><br>This is one of my top recommendations for restaurants in this genre.  I've returned many times and will continue.", "pics": null}}, {"review": {"des": "Great food, great drinks, great atmosphere, excellent service!!!<br><br>One of my friends told me about Ada St and finally decided to give it a try yesterday! The place itself is well hidden, now I know why! Once you enter the place you can start to hear the music, the darkness, the candles and the tall wooden ceilings make the place feel cozy/hip/speakeasy.<br><br>Once we went in the manager greeted us right away and moved some tables since it was a big group. He went above and beyond to set up the table and make sure it wasn't wobbly. After we were seated our sever introduced herself and gave some recommendations! <br><br>Everyone got a different drink and my favorite was Harvest on the moon, she was also very accommodating and was able to create a drink with mezcal, super refreshing!<br><br>We ordered almost every single item on the menu, they are small portions but worth trying them from the Singapore Chili Crab Cakes to the steak tartare to the grilled octopus, just amazing! And to end the night we got the Chocolate Ganache just a great.<br><br>Again, top notch service! <br><br>Overall great experience and definitely going back!", "pics": null}}, {"review": {"des": "This is definitely my new favorite, go-to date night or out with friends place to go.  It's been on my list to try for awhile, but with young kids at home we tend to live under a rock ... until we don't and we have incredibly high expectations for anywhere that we go out to eat because it better be good if we're paying a babysitter for the evening.  <br><br>The location:  Love the off the beaten track location amongst a bunch of warehouses.  The outside is very non-descript and when you enter it is like another world.  <br><br>The vibe:  Inside the restaurant it is incredibly dark and I felt blind for the first 10 minutes as my eyes adjusted ... but it's also really dark.  We lucked out that they had just opened up the outdoor patio which was a nice modern industrial feel with vintage Edison bulb hanging lights.  Inside it's the same type of feel and pretty hipster.  So hipster in fact that you can pick out vinyl records to play through the restaurant ... kind of like a juke box but it's full size records and a real person.  They even have outkast on vinyl.  Impressive.  It's somewhere between casual and dressy ... probably a maxi dress or flowy romper for the ladies and dark jeans, hipster tee and jacket for the guys.<br><br>The drinks:  Amazeballs.  We tried 4 different cocktails and all of them were great.  I started with \"Be Nice to Me\" and then followed up with \"Stranger than Kindness\" - both highly recommend.  Also impressed that all of the staff is knowledgeable and able to recommend cocktails from the menu to suit your tastes.<br><br>The food:  Also really yummy.  The lamb ribs and the burrata to start then the scallops and sirloin as mains.  Great flavors particularly in the lamb ribs, but enjoyed the flavors and textures throughout the meal.  It's sharing plates so none of the dishes are that large - plan for ~2-3 per person.<br><br>The service:  Hipster to go with the vibe, but in a completely friendly and helpful yet down-to-earth way.  Loved how in-the-know everyone was about the menu.  Debating between two things, they can help guide you based on a description or hearing what you are looking for.  Really great staff all around.", "pics": null}}, {"review": {"des": "-Hidden entrance off an alley,<br>-Feels very swanky and speakeasy-like when you enter.<br>-You go down a long narrow candlelit hallway to get to the main dining room.<br>-The place was bustling, even on a Tuesday night.<br>-We had no reservation and had to wait a bit.  But the host was very nice and took our cocktail order while we waited.<br>-Black moon spell cocktail was delicious, the rye-based drink perfect for a cold winter's night.<br>-Glasses and presentation are amazing.<br>-Bottled \"50-ways to leave your lover\" drink was as interesting as the name--with rum and laphroig scotch--served in an old punch glass.<br>-Pao de queijo were phenomenal--couldn't have been better than if we were in Brazil.  They were warm, nice and crisp on the outside, and gooey and cheesy in the middle.<br>-Gnocchi were among the fluffiest I've ever had--so often gnocchi are so dense, but these were light, soft and perfect!<br>-Lamb skewers were properly cooked and served with a very tasty crispy rice side.<br>-Merguez meatball sliders were also very good--and came on these awesome challah-like rolls.<br>-I noticed that all the staff would pitch in for each other--which is rare and I really appreciated it!<br><br>It was a great dinner experience--we'll definitely be back soon!!", "pics": null}}, {"review": {"des": "Ada Street delivered on the decor and thought that went into last nights special meal. If you didn't know, Ada did a Harry Potter themed meal. The decorations, people, staff were all amazing and were in character. That was awesome! The chef is very good as well!<br><br>For $160 for 2 tickets, the food was good, but pretty small. The app was a small salad or scotch egg, a 2nd dish of french onion or fried rice, then fish and chips / roast beef, and then a small dessert. The event probably increased the reg prices, and that was all fine and expected...The biggest frustration was we the chef is very good, but my gf has celiacs and the modifications weren't really modifications. It was just moving the gluten items off the plate. That didn't fully ruin the experience, and I would still recommend Ada, but as you can imagine thats pretty frustrating. They also had a special drink and special appetizer, and rather than giving her a different drink or a modified app, she just didn't get anything. That felt a little neglectful, since i believe everyone should get similar experiences. I will eventually come back to Ada street, but maybe not for a while.", "pics": null}}, {"review": {"des": "If I am upset with anything, it is with myself for not dining here sooner. Everyone and everything was perfection from start to finish. Andrea was fantastic and made us feel at home the entire time. <br><br>We had the following: ceviche, shrimp chop salad, burrata, queso dip, black rice, and lamb skewers. It was ALL amazing. We would order all of it again. It was fairly priced too. 6 dishes, 4 drinks (all amazing)... $130. We left very satisfied. The best hole in the wall! <br><br>Do yourself a favor and go there....even if it's once. You will not regret it.", "pics": null}}, {"review": {"des": "This restaurant is located in a quiet industrial neighborhood that almost looks deserted. Location plus the long quiet hallway leading you to the main bar and restaurant area sets a nice mysterious mood to your evening. <br>The food was great! They serve small shareavle portions perfect for a date night. The ambience is cozy and cocktails delicious! Highly recommend this restaurant for a quiet evening.", "pics": null}}, {"review": {"des": "I stumbled upon this place for restaurant week a few years back and have henceforth made an effort to come a few times each year and always bring someone new. The location is both a pro and a con: good in the sense that it stands out, but your options are limited if you end up having to wait (note that you can call ahead up to hold your place in line up to an hour in advance). At the same time, great things are worth waiting for.<br><br>DMK is really doing something interesting here. The music is great and employees are encouraged to play their own favorites. The service, atmosphere, drinks and food are all great. I do, however, wish that there were more menu options given a few favorites endure all menu changes.", "pics": null}}, {"review": {"des": "The food at Ada Street was so good that I am still dreaming about it. My boyfriend and I had the burrata which had this pea pesto that complimented the cheese really well. We also had the meatballs which comes with 4 so was perfect for two people to split. Then, we enjoyed the lamb ribs. I have never had anything like them and they literally melted in your mouth. Our favorite part was the last item we received which was the gnocchi. We loved it so much that we got a second order. The food was incredible and the service was good. Also, I loved the intimate feel of the restaurant. I am looking forward to going back in the summer when they have garage door open. We will be back soon!", "pics": null}}, {"review": {"des": "Ada Street has my heart. What can I say? They came through for us when our wedding venue fell through about 6 months before the big day. We thought of Ada Street because we were smitten with them from the first time we sat at the bar with Scott. They quickly won our hearts with their personable service and our stomachs with delicious dishes.<br><br>Chef Zoe Schor assembled a perfect wedding menu for us based on foods from our relationship: the first time we met, first date, and dishes we have all the time and have become meaningful to us. Scott even made a cocktail for me called \"Rosemary Me, Yvonne!\" now tweeked and renamed \"Twentynine Palms\" on the regular drink menu. Everything was incredibly thoughtful, chill, and fun.<br><br>Soon after our wedding it was announced that Chef Zoe was leaving Ada Street and that Chef Joanna Stachon would take her place at the helm. Now we've returned during Chicago Restaurant Week and we were delighted that the food, drinks and service continued to be excellent. Here are some highlights:<br><br>Creamy Tomato Soup: literally the best tomato soup of our entire lives. It was smoky, mature, and soothing. It was the leathery hug of a grandfather who smokes a pipe on the front porch and tells you adventures from childhood.<br><br>Ribeye: perfectly cooked and seasoned. It was amazing. I could hardly get M to share only one bite with me and then that scrumptious moment was gone.<br><br>Green Tea Ice Cream: the ice cream was very true to the name. It tasted like matcha which has a very strong, earthy (sometimes with a hint of delicate floral) flavor. The whipped cream on top helped to cut the earthiness and then the caramel drizzle (served in a plastic syringe) added a nice sweetness. It was absolutely lovely.<br><br>Chicken Tikka Masala Pie: The server Ally told me that this was her favorite Restaurant Week menu item so I HAD to try it. I can understand why. It's super interesting. The crust is sturdy and with a slight crisp to it and inside is a sweet chicken filling. At first I thought it tasted like apple pie but then I realized that the sweetness came from the dates. The tart yogurt and fresh parsley were necessary contrasts to the rest of the pie. It was very well composed, multi-faceted dish.<br><br>Shrimp Cakes: I really enjoyed these. They were like crab cakes except with shrimp and you could taste the shrimp.<br><br>Although the food is top notch, what really keeps us coming back to Ada Street is the people. They are a cohesive family and they genuinely appreciate their customers. When we went to Ada Street on Wednesday and sat at the bar, it just felt really good. It felt comfortable, homey and happy.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/x-KLV3Td_qM1TCWmwVINYw/348s.jpg", "caption": "Restaurant Week menu 2016 inspiration"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uYgUIw3VnQ5lRuqrlXVDWQ/168s.jpg", "caption": "Restaurant Week Menu 2016"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/46zA_kGgH6gJ5krq-PnymA/168s.jpg", "caption": "Creamy Tomato Soup"}]}}, {"review": {"des": "I was here for Restaurant Week, and I have a couple mixed reactions. Overall, I'm giving them four stars because the place was really, incredible interested, I don't regret going, everything I had was delicious and the service was really friendly. It doesn't get five stars in my book, to be totally honest, because my entree was smaller than what I would consider an acceptable appetizer size. <br><br>Appetizer - I had the duck poutine, which was very filling and delicious. <br>Entree - diver scallops. They described this as being served with a chowder, which made me think (for obvious reasons) that I'd be getting a serving of soup. They served me a puddle with two scallops on it. It was amazingly delicious and I would get it without hesitation again, but it was a very disappointing serving size. <br>Dessert - my first bread pudding! If I had to describe it, I would say: a soggy waffle that was somehow very good. They were a bit inflexible on substituting ingredients in the desserts - I'm a bit of a picky eater - so I ended up getting this because it was the closest to containing only ingredients that I actually wanted to eat. Pretty big portion, do not regret.", "pics": null}}, {"review": {"des": "I went to Ada Street for restaurant week last week. It's a hidden little spot with a metal door. Be sure to make a reservation. I over heard the host saying to some it was at least a 90 minute wait. It was 6:30 on a Sunday mind you. I believe they only take reservations between 5:30 -6:30 each day and the other times are walk-ins only. <br><br>Upon getting seated, they welcome you to look through there records. They will play your choice during dinner.<br><br>For restaurant week I chose le roule cheese flatbread, teriyaki ribeye and the chocolate \"surprise\" egg. To be honest the best thing about this entire meal was the glass of wine I ordered and the chocolate \"surprise\" egg. The flatbread it's self was good but ingredients on top were nothing to talk about. It tasted like they poured a bottle of giardiniera  and smeared cream cheese on it. I asked the waitress if I could get my ribeye more on the well done side and she said no. They only service it medium. I did wind up getting it expect it was not medium it was rare and I couldn't eat it. Probably my fault and I shouldn't have got this entree. <br><br>All in all. I may go back for drinks but not food most likely.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ogCm8NJ-S6xg9D_dS5JCRA/168s.jpg", "caption": "Restaurant week menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Vcim0Gzk-iqERn5Hwj0LoQ/168s.jpg", "caption": "Chocolate \"surprise\" egg"}]}}, {"review": {"des": "Sometimes a restaurant can change chefs seamlessly.  Sometimes they can't.  This is a can't.  We have gone to Ada Street a number of times (side note to owners- we would have gone more often but the no reservations policy is just stupid. Saturday night, while we were there, it was only 50% full. Some of us don't enjoy the idea of hoping for a table, particularly in a sketchier part of town).  This was our first time back - see above why - in a couple of months and it was evident there was someone new in the kitchen. <br><br>Back to the review.  Ate at the bar, service was amazing.  Food was hit or miss. There seemed to be a theme of over-salting and a bit too much oil used.  A lighter touch is needed.  We wanted to love it, as we have before, but this time the food was just OK.  Oh, and the \"Illinois bubbly\" is absolutely disgustingly sweet.", "pics": null}}, {"review": {"des": "Lovely place and a great discovery - somewhat out of the way but really cool once you walk inside. The cocktails were well-prepared, the food was delicious - the octopus being my favorite and the lamb being my least favorite - and so was the passion fruit dessert. The chocolate ganache was rather heavy and came with a huge portion, but that didn't diminish the overall experience one bit. The vibe was classy contemporary - I liked it a lot.", "pics": null}}, {"review": {"des": "Shared plates <br>Fun atmosphere<br><br>Best thing: chocolate dessert ( we almost didn't order dessert SO GLAD we did) , the Bahnu meatballs,  the gnocchi (SO tender melts in your mouth) <br><br>Ok:  crispy squid, spicy mixed salad, polenta fries, scallops <br><br>No: chicken wings- only eh and not very flavorful , bruschetta- also not very flavorful and very minimal toppings- seemed like just a lot of dry bread.", "pics": null}}, {"review": {"des": "You know, the service was great and what I ate was pretty good. But the food was not great and there was too little of it.  <br><br>I came with a friend for restaurant week, and I was really excited by the creative and thoughtful menu (dishes inspired by former presidents). I started with the duck poutine because meat, cheese, and fries should have been a slam dunk. And there was nothing wrong with it; it just wasn't special. Ditto for the chicken fricassee -- I liked it just fine but don't really need to eat it ever again. <br><br>The grateful pudding was the highlight of the meal, but it was not good enough to make the overall experience better than A-OK.  The plates are quite small, and my friend and I left with plenty of stomach room to spare.  Plus the restaurant is not that conveniently located. I'm glad I tried it but probably won't come back.", "pics": null}}, {"review": {"des": "Love the food. Love the atmosphere and spinning full records for tunes. Price was reasonable, though shareable portions are on the small side. Cocktails also a little small for price. But all makes up in flavor. Definitely a special treat. Our server was meh, but all in all we will be back!", "pics": null}}, {"review": {"des": "I tear a lil, every time I think of this place.  Sparkles of joy.  <br><br>Black eyed Peas<br>Polenta fries<br>Cured salmon spring roll<br>Brussel sprouts<br>Rapini<br>Salmon Tartare<br>OCTOPUS<br>Lamb ribs<br>Steak Tartare<br>Panna Cotta<br>Shrimp (off menu)<br>Julianne Salad (off menu)", "pics": null}}, {"review": {"des": "Theme dinners are perfect for this intimate restaurant. Harry Potter theme dinners during the fall are a great harbinger to the cool and dark weather injecting fun and warmth into crisp weather. The small kitchen creates amazing dishes.", "pics": null}}, {"review": {"des": "Loved this place ! We went with another couple , our best friends ! Drinks were amazing ! Food too ! Stuff was very friendly ! We simply enjoyed everything , the atmosphere is very cool , music is so great ! Such a fantastic night !", "pics": null}}, {"review": {"des": "I can't believe I've never reviewed Ada St before, but luckily here we are now to make things right in the world. Never a bad experience here. I don't even mind waiting for a table in that tiny front hallway! When you know those crispy black eyed peas are waiting for you on the other side, there's no reason to be upset about a little wait. Plus, the host staff is really great about taking drink orders while you hang out. And the cocktails are all so great so, again, nothing to be upset about! <br><br>We've only ever been seated at the bar, but I actually don't mind it here. It's still an intimate experience. Regular favorites include the aforementioned crispy black eyed peas and polenta fries. On our most recent visit, the toast with seasonal mushrooms was delicious and the mussels great as always. The parisienne gnocchi was amazing and the charred broccoli also very good. I know it seems weird to rave about some broccoli, but it was perfectly charred and the sauce was very good.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GV2DeOXy5LGndcAzWpQoTw/348s.jpg", "caption": "Charred broccoli"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5y-p9huKQXNh_c6426NrcQ/168s.jpg", "caption": "Parisienne gnocchi. Delicious!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3feWFTaIgTHmUrGex9uN9Q/168s.jpg", "caption": "Polenta fries"}]}}, {"review": {"des": "This is a great date spot! The ambiance is low key, romantic and cozy. Drinks are delicious and bites are budget friendly and yummy. They have an outdoor space in the summers. This place is kind of tucked away from crowds so always a great place if you're craving some privacy.", "pics": null}}, {"review": {"des": "Kinda strange place but worth the trip out to no man's land.<br><br>Service is excellent. They are a small place with limited reservations but you can call ahead 1 hr and put your name down. We did on a Saturday night at 6:30. When we showed up at 7:30 we were seated right away. <br><br>They have vinyl to choose from so you can pick your own hipster tunes to eat to.<br><br>Food:<br>All of it is small and meant to be shared. This is the perfect place for a date although it is kinda out there in a creepy location so maybe not a first date... <br><br>Meatballs - spicy but very delicious. Good size for 2-3 people.<br><br>Wagu Steak tartar - solid. Quality of the meat was high. Flavors were good could use capers but if you like a more mild steak tartar then this is your jam. Toasted bread with mustard makes for a solid dish. <br><br>Short ribs - smoky, saucy. 6 slices of thin tender beef makes a great app for 2-4.<br><br>Gnocchi - it tasted like thanksgiving. Sweat savory bacon, brussle sprouts, it was my boyfriends favorite dish of the night.<br><br>Chocolate on toast for dessert - simple but very decadent salted dark chocolate on a slightly buttery peice of French bread. <br><br>Drinks were solid. We just had old fashions which were very good. <br><br>Over all, a great wicker park joint. If you don't venture out here much, this place is a good intro into the cool, upscale places that hide out west.", "pics": null}}, {"review": {"des": "Yum yum yum! We sat at the bar durning Restaurant Week and had their special menu. We didn't know it was RW but they accommodated us anyway without a reservation. Charred broccoli, fired chicken, salmon, salted chocolate ganache - loved it all. Our cocktails were amazing too. Our waiter/bartender Chad was very attentive, nice, and friendly. The other servers were awesome as well. We will def try out the new Willow restaurant Chad told us about asap! This was our 4th visit and can't wait to return.", "pics": null}}, {"review": {"des": "I absolutely loved the atmosphere! It was such a cool and quirky space. A long hallway lined with books leads you to a larger dining room. But along the way you're able to flip through records as well and pick ones they'll play. It's a retro jukebox! Also, it's candlelit, which just adds even more cool vibes. It makes you forget that this place is hidden between industrial buildings and across from the city garbage trucks (no lie!). <br><br>It's a small plates menu, so you know what that means, the bill can get expensive quickly. They were awesome and accommodated to our oddly sized party of 5 even after telling us they weren't sure if they'd be able to seat us for an hour. (it only took about 1/2 an hour It's not a large dining room, but there's a garage door that opens up to a patio with low hanging patio lights and a ping pong table. Perfect for warm evenings!<br><br>We ordered up a plethora of shared plates. Sadly, nothing really blew us away. Most of the items were a little bland, including the polenta fries and the mietballs. The scallops and gnocchi alone weren't cooked to be light and fluffy, but were a little heavy. The sauces that were served with it were fantastic though.<br><br>The real winners were the cocktails and desserts. I ordered an excellent Rose first and then had a sip of my friends French Martini and immediately knew I needed one. It was incredible. Creamy tasting, yet refreshing. Plus, it was served with a shot of whiskey! The sea salt chocolate was unlike anything I've ever had. It was like a thicker chocolate mousse and was something I won't forget soon. The PB&J Bread Pudding was also a total winner, and so creative for bread pudding! The panna cotta was good as well, but was overshadowed by how excellent the other two were. <br><br>Again, I would ABSOLUTELY recommend this place for drinks and desserts. Great spot to catch up with friends and share desserts... Or get your own because they're so fab!", "pics": null}}, {"review": {"des": "Super sketchy area and building to enter at night on a date but what a great find! I'd opt for the seating area by the bar for a more open and social scene, and the front room for a more intimate quieter setting. Tapioca puffs, tempura and black fried rice were all excellent. Hangar stake was a bit rubbery.  Desert menu could use a few more options but I liked the chocolate ganache, and having a smaller menu in exchange for perfection. Great value for the price, making it a place I'd visit again.", "pics": null}}, {"review": {"des": "Ada Street has good food and great service. All plates are sized to share, but that also means that you have to order quite a bit in order to leave feeling full. I enjoyed the steak tartare as well as the strip loin and wild fried rice. My biggest gripe is how LOUD this restaurant is...and I'm not talking about the volume of patron's voices. The music was so loud that we had to keep asking our friends what they were saying. Same thing happened with our server. I think they did finally turn it down a notch in the music as the night progressed. Otherwise, it's a solid place.", "pics": null}}, {"review": {"des": "Came here with some girlfriends and we had a great time! The food was delectable and served tapas style, so we had a bit of everything! There wasn't one dish that we didn't rate 5 stars.<br><br>It was a little crowded when we came (Sat night around 8 pm), but I had called an hour ahead to put my name in line so we were seated right away. The place is a little hard to find (Uber driver circled around 3x) and is definitely a hidden gem in Chicago!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ONqk-kpPaIS746kHA-ocXQ/348s.jpg", "caption": "View from the bar!"}]}}, {"review": {"des": "Yum!<br><br>Ada street has some of the best food that I have had in a really long time. The food is definitely a bit pricey but everything that we had was absolutely delicious!<br><br>This is what we ordered -<br>Polenta fries! Super tasty! Started to get a bit bored with them after two however. I was not the biggest fan of the dipping sauce that came on the side<br>Bahn 'Mietballs' These were very very good! I loved the sauce that came with it and the meatballs were super flavorful<br>Gnocchi! Definitely the highlight of our entire meal. I could've continued eating these forever! Perfectly pillowy and fluffy<br>Scallops - perfectly cooked with just the right amount of seasoning<br><br>The meh part - I came here with my boyfriend for my birthday. He mentioned to them when he made the reservation that it was for my birthday but we got absolutely no acknowledgement of that. Normally I would be like meh, who cares. But they specifically asked him on the phone if it was for a birthday... WHY would you ask someone if it's for a special occasion and then just do nothing? It makes no sense. Even if they told me happy birthday I would've been like yay! Thanks!", "pics": null}}, {"review": {"des": "This place is great!  A bit pricey, don't let the menu fool you - it's a tapas place so make sure you count ~two tapas per person when you are figuring out the price.  At 6:30 pm on a Saturday the restaurant was just about full.<br><br>Tried the following (best to worst):<br>Wagyu Steak Tartare - Very tasty!  Probably the best thing we had.<br>Hamachi Tartare - Also very nice, tons of flavor!<br>Polenta Fries - Tasted like sweet potato fries, very nice!<br>Baby Octopus - Octopus was cooked just right, and the relish worked very well with it.<br>Pork Cheeks - This was decent, just enough spice.<br>Grilled Short Ribs - Meat was tender, but not quite fall-off-the-bone.  The spice mixture tasted kind of weird.<br>Banh Meatballs - Meatballs themselves could be flavored better, but I liked the kimchi.", "pics": null}}, {"review": {"des": "It's just a door on an industrial street.  Where's the restaurant??? That's what we thought when we got out of the car.  We then stepped in to a dark room with a hostess stand in front of us. We were immediately greeted by a friendly face and quickly escorted to the bar in the back while we waited for the rest of our party.  The walk to the bar is interesting as you pass the wine area and shelves full of vinyl records. Sadly we didn't have time to peruse the selection and ask to have a song played (next time for sure)! The bar area shares the room with the main dining area.  The back wall completely opens up (garage door style) to a courtyard with outdoor seating and of course a ping pong table (will have to take advantage of that next time as well). <br><br>As for the food... Yum yum yum!!! Went here recently and wanted to try everything. We ended up sharing 9 dishes amongst the three of us and had a few rounds of drinks.  I think my favorite dish is a toss up between the meatballs and the scallops. I highly recommend going to this place with an appetite and a few friends so that you can taste several dishes off the menu. <br><br>Definitely looking forward to visiting Ada St. again soon.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jiBHA_sWDTmfwrqsc__ZPQ/348s.jpg", "caption": "Chocolate toast."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Lp2iqARZZrPCz1koa0DXNQ/168s.jpg", "caption": "Skirt steak"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fdUhgtWb9bZLDYBN3m_vMw/168s.jpg", "caption": "Elotes"}]}}, {"review": {"des": "Awesome cocktails. Great food. Staff was engaged and cared.<br>Had an old fashioned, steak tartare and gnocchi (all good). Fiancé had the harvest moon (great)", "pics": null}}, {"review": {"des": "In my top 5 favorite places to stop in for a drink, to hang out with friends or even a swanky dinner. Ada street is so great for all occasions and never disappoints!", "pics": null}}, {"review": {"des": "My husband and I held our wedding cocktail reception at Ada Street last year in July. What fun! We invited about 120 of our nearest and dearest to Ada for heavy hors d'oeuvre and cocktails. We chose Ada because I've always loved the romantic aesthetic and laid back vibe. <br><br>The whole Ada crew, including Shannon Heidloff (DMK Sales Director), made our wedding such a lovely experience. Chef Joanna was so attentive and went above and beyond for our guests! Each server, bartender and kitchen staff person had a smile, re-checked my plate for no traces of shellfish (I'm severely allergic) and I really can't imagine the party going any better than it did.<br><br>My only regret is that we didn't have the time to sit and savor the food as much as we wanted. Our guests raved!  We are looking forward to coming to Ada again for a redo of sorts!<br><br>Again, my sincerest gratitude to your staff!", "pics": null}}, {"review": {"des": "Long wait was not worth the food.<br><br>We went during restaurant week without realizing it, which was probably a mistake.  We called ahead to put our name down and still ended up waiting close to 2 hours for a party of 2.  We waited in a small room with uncomfortably loud music.  Whenever there was a break in the music all of the waiting patrons looked at each other shaking our heads and making \"wtf is with this loud music!?\" faces.  Please turn the music down or play something that is tolerable at loud volumes.  Otherwise, the host staff was nice and took drink orders at regular intervals.  Drinks were good.<br><br>We were eventually seated at the bar, which was cool with us.  The regular menu was unavailable due to restaurant week and the options were limited.  We started with the duck poutine which was waaaaay over salted.  Like, uncomfortably salty to the point where you have to have a sip of water after each bite.  I told our server and he said he'd pass the message to the chefs. Next we had the beer cheese soup thing which was okay.  Small portion, difficult for sharing.  For entrees had the scallops and chicken.  Both were fine but nothing memorable.  The scallops was just 2 large scallops.  The best part was the buttery mashed potatoes that came with the chicken.  We had both dessert options, the bread pudding being the winner of the two.<br><br>So I maybe I'm missing something, but I'm not getting the hype.", "pics": null}}, {"review": {"des": "You can never judge a book by its cover. From the outside I had no idea what to expect, but once you get inside this is a very cool little restaurant. <br><br>I went here for Restaurant Week and loved it!<br><br>The menu for 2016 was based off famous concert rider requests which I thought was a very unique cool twist.<br><br>First<br>Creamy Tomato Soup (inspired by ZZ Top) - This sounds boring, but it was Not, it had good spice and excellent flavor<br><br>Second<br>Teriyaki Ribeye (inspired by Rush) - Awesome! was perfectly cooked, and love the teriyaki and wasabi butter<br><br>Dessert<br>Green Tea Ice Cream (inspired by Prince) - Really unique, fun and tasted great<br><br>We also ordered not one, but two orders of the Polenta fries with chipotle puree.<br><br>The food portion was perfect, I think this was the first time in awhile I haven't left a restaurant feeling like a stuffed turkey but rather content with the portion and amazed by the taste. <br><br>Ada Street is a true Chicago hidden gem. The perfect place for a date night or intimate dinner with friends.", "pics": null}}, {"review": {"des": "Came during restaurant week, when restaurants should be putting their best foot forward and tying to get you to come back, but no...I would not come back here. They had the top end RW pricing ($44) and we left STARVING. the entree, swear to God - appetizer of a minuscule chicken thigh, about an ounce of greens, and a biscuit crumble not worth mentioning. I mean, you can't give diners a full biscuit? Just three tiny crumbs? I honestly thought it was goat cheese crumbles. RIDICULOUS. They even served the entree on tiny plates, I'm not kidding you. I wouldn't come back here based on this experience or recommend to anyone. Hard pass.", "pics": null}}, {"review": {"des": "The flavors at Ada Street are very well thought out and come off as effortlessly creative. I loved how delicate yet rich the flavors were; however, out of personal preference, I wasn't a fan of every single combination.<br><br>Gnocchi: I loved the flavors of the this dish--the pearl onions brought nice bursts of sweetness to the squash puree, which had just the perfect level of richness; however, I wasn't a fan of how soft the texture was--it almost felt as if the gnocchi was cooked far past al dente.<br><br>Brussel sprouts: Initially, I really enjoyed the flavors of how the blue cheese complemented the brussel sprouts and the sweetness of the onions, but the strong flavors became a little overwhelming after a while, especially since I'm not really a fan of blue cheese.<br><br>Prime flat iron: Definitely my favorite of the night. I loved the elegant touch of brown butter and oregano to what is normally paired with heavier flavors.<br><br>Panna cotta: Nothing really special here. The panna cotta was a little too rich for me, and the apple jam and cookie crumble resembled the flavors of an apple crisp--good, of course, but not amazing.<br><br>Overall, service was good and timing of the dishes was excellent. Objectively, the food and was well executed, although perhaps not to my personal preferences.", "pics": null}}, {"review": {"des": "I ventured to Ada Street with some chums to celebrate one of my bestie's birthdays. Great parking situation with ample free street parking right in front of the building. Food was pretty mediocre... many dishes over-salted (and over-mustarded) augmented with ample amounts of carbohydrates. However, the cocktails I imbibed were excellent and would put them up against many other restaurants and lounges in the area. Unfortunately, ingress/egress space is greatly lacking especially when the restaurant is near capacity. Every time I arose I had to jockey with multiple staff to use the restroom. This came to a head when our waitress, carrying drinks for another table, accidentally spilled a glass of wine on me due to the constricted walking space. She apologized initially and assured me she would bring soda water to help clean my soiled clothing. Alas, I was quickly forgotten about: no soda water was ever delivered and the waitress was actually quite short with me for the remainder of the night. I had hoped to leave with rich memories of food and friends, but instead left with only the heavy smells of dijon mustard and stale chardonnay. Sadly, I did not see what everyone has been rhapsodizing about.", "pics": null}}, {"review": {"des": "This place is breath-taking! You walk in and feel like you're in a speakeasy that few know about. The vibe is hip - dark, lit by candles, with records everywhere and a groovy curated soundtrack to boot. But for us, the entrance and ambience were the highlights. It kind of went downhill from there. The drinks are well-appointed. The F-ing French Martini was exquisite and I had a nice glass of Sauvignon Blanc. The small plate concept fits, but the food just wasn't great. Our crispy black eyed peas and fried green tomatoes both were almost too salty to eat. The heirloom tomato salad, on the other hand, was pleasing to the eye, but bland. The fried rice was a great concept, but again too salty. And the BBQ ribs were just fine. We would have told our server about our displeasure if she had asked, but she never inquired about our thoughts about the food. After feeling such a high on the walk from the front door to our table, we were overwhelmed with disappointment and thinking about last night's leftovers as we left. This is a great place to sit at the bar and get a good cocktail while vibing to good music. But I can not recommend it for dinner.", "pics": null}}, {"review": {"des": "We came in on a Friday night to grab some appetizers and cocktails, as Ada Street has been on my list to try for years. Had the ceviche and gnocchi, both were awesome. Ronnie the bartender was very friendly and suggested some off the menu cocktails. Will definitely be back with friends to enjoy another evening at Ada Street.", "pics": null}}, {"review": {"des": "Im not going to lie. The wait sucked. they told us upfront so we knew what we were getting into. Calling ahead didnt do much for the wait time. 4 people walked in right behind us and were told it would be a 4 hour wait (yes it was restaurant week). Now i wish i could tell you about the food i really do. After waiting 2 hours to be seated i was tipsy, scratch that i was hammered! We sat at the bar and i remember it being really dark. What did i order Hell i dunno. I was on Vacation and we took an Uber there so we decided to stay and drink for a couple hours. The only proof i had of being there was a $140 statement and a pretty pic of the front of the place.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MqmPOS5rS8eX0HembU8_qw/348s.jpg", "caption": "the only proof i had of being there while time traveling aka being hammered"}]}}, {"review": {"des": "It was a little disappointing. Walking in, it was literally a mish mosh of the haunted mansion from Disney world meets a stereotypical trendy restaurant.  For restaurant week, the portions were small, so we left hungry.  I'm actually picking up a pizza right now as we speak after our meal there.  The tomato soup was decent, but the flat bread was way too spicy.  The ribeye was very good, but there was more bok choy on the plate. The kinder surprise was meh.  The place was so small, it was hard to walk around. People were even eating in the hallway.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eAjMVjbdsBMYJBV-dkzRIw/348s.jpg", "caption": "Kinder surprise"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/d_sbzpzJiox8BY0h_-c2ng/168s.jpg", "caption": "Ribeye"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dKNgAOgSrdKaVNPSRrjhPA/168s.jpg", "caption": "Polenta fries"}]}}, {"review": {"des": "Let me start off by saying that there was a long wait ( 1 hr and a half ). We were warned before hand so I didn't really mind. I wanted to see what all the buzz was about and let me tell you, it was GREAT!! This place is really dimly lit, and candles are everywhere, which I absolutely LOVED. My boyfriend and I placed our names on the list but they told us that we could have a seat and order some cocktails or drinks while we waited. We went ahead and ordered our drinks, they were really good and couldn't wait to order our next round. The hour flew by and our names were called to go ahead and get a table. <br><br>Our waitress was nice but it sometimes seemed like she wasn't on top of things. I have to admit, my boyfriend and I waited a long time to get our check by the end of the night, but that was the only part we didn't like so much.<br><br>NOW, let me talk about the food! We ordered the shrimp cakes and they were sooooo good! I usually don't like shrimp cakes but these I just couldn't stop eating. I then ordered the steak, which was amazing. It was juicy and tender, just how I like it! And lastly for dessert, I ordered green tea ice cream with caramel on the side. This was a special for restaurant week, and I can now say I like green tea ice cream. I can proudly say that they won my stomach by the delicious food I have tried here and will definitely be coming back!<br><br>Here's a fun fact, they have a record player and have a section with vinyls and you can choose one that they could play. I thought that was pretty neat!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/utoMupYhXRa5K-Sylmskbg/348s.jpg", "caption": "Green tea ice cream w/ caramel on side"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ybTfTpKEh8DUaHaOlWQ0YQ/168s.jpg", "caption": "Dessert! Green tea ice cream & Chocolate egg surprise"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6pNjF6a0Kqdie8u8oyo2JQ/168s.jpg", "caption": "Shrimp Cakes"}]}}, {"review": {"des": "I won a $500 gift card to DMK restaurants, so obviously we had to visit the most expensive DMK option.<br><br>We snagged a reservation (they're only available for one hour each day, otherwise you show up and hope you make it in) for the moment they opened.<br><br>The menu changes regularly, so we ordered eight separate items. My partner ate all the meat items and I ate the veggie. Almost everything was exceptional! We didn't much care for the chickpea fries, but the rest of the meal made up for it.<br><br>When we told them it was our anniversary, they brought us free glasses of wine! So sweet!<br><br>Service was excellent, you can choose records for them, and you can even tip the kitchen staff by buying them a six pack of beer!<br><br>Great for date nights.", "pics": null}}, {"review": {"des": "Unique,  fun atmosphere. Very long wait, but drinks are wonderful. The staff once you're seating is very nice,  the people up front by door well they can be nicer. Tight space in the entrance and completely weird location. <br><br>The food is good, but drinks are great. Small tables that are very close to each other. Worth a try on a weekday, early dinner.", "pics": null}}, {"review": {"des": "unique, fun atmosphere, especially the vinyl album collection! You walk in a hallway with dim lights and displays of wine on either side, like you are sneaking a glance at some royalties wine cellar. <br>entertaining and friendly wait staff. we let our waitress pick our a series of small plates for sharing - resulting in great variety & all extremely tasty and unique. my favorites were the scallops. <br>Lively & plenty of noise, but not so overwhelming - we were able to carry on a conversation thru dinner.", "pics": null}}, {"review": {"des": "The last time I visited Ada St was during this last (less than impressive) Restaurant Week, which in the days of Chef Schor followed by Chef Stachon, used to be impressive and memorable.  However, we decided to visit last weekend to try to snag a patio seat and enjoy Ada St in its glory.  It was not busy to say the least (tables open, no one crowding around by the host area, bar had a couple of seats open, etc) but service was SO slow.  Food was decent, aside from the specials they havent changed the menu much- must be safe that way- cocktails were okay but not that exciting or different like they used to do.  What was odd is that the service was so slow- its like the staff was more interested in engaging with each other than taking care of guests.  I mean, we can see you since its all open!  It took at least 15 minutes for the first round which was a beer, a glass of wine and 2 cocktails off of the menu.  For a restaurant that wasnt full, it was too long and became awkward.  The first round of food took 20 minutes.  Again, we can see the chef/cooks who were joking around, having fun which is great but, why give off the appearance that you are busier than you are?   Ada St. used to be so special and fun and such a treat and I really think it needs a refresh.", "pics": null}}, {"review": {"des": "Love this place. Just a black door on outside. Long dark corridor leading to wine library and record album choices. Indoor outdoor area. Ordered the eggplant bruschetta - so good!!  Loved the gnocchi. The rest of the table ordered the short ribs- they liked that too. Table also ordered the rib eye medium rare- said it was done perfectly. They also ordered the octopus- well cooked and like the peppery sauce. A little spicy. Liked the texture. The scallops came with plantains and a wonderful sauce. We got the pbj pretzel bread pudding- it was amazing. Love this place. Will be back.", "pics": null}}, {"review": {"des": "This was my favorite meal (BRUNCH) on my trip to Chicago. I found out about it through a great website Serious Eats:<br><a href=\"/redir?url=http%3A%2F%2Fchicago.seriouseats.com%2F2013%2F10%2Fthe-brunch-dish-ada-street-adds-brunch.html&s=62551062237c6ae45ef664c94b0850cf19117c8d087aed820d51378b51924a3f\" target=\"_blank\" rel=\"nofollow\">chicago.seriouseats.com/…</a><br><br>That egg is Not on the menu, the waitress did not mention it, and apparently they have a limited supply, so if you want it, go early and pray they have it (ask!)<br><br>The egg was amazing- The lettuce was a nice garnish, but I can't imagine how good it would have been on a plate of shaved and lightly cooked brussels sprouts!  <br><br>2 girls ordered like pigs - we had:<br>The thick cut bacon in maple syrup<br>biscuits and gravy<br>The scotch egg wrapped in corned beef hash<br>the pretzel bread budding with bacon bits and maple glaze<br>My friend had a bloody mary (spiced with pickle juice and a salted galls greyhound)<br><br>Our server Allie was a doll and the meal was perfectly paced to come out as shared courses. The chef Zoe - was very hands on with the kitchen and delivered a few of our courses to the table<br><br>I will note the table next to us got the steak and eggs, which looked awesome and the doughnut,<br><br>2 minor complaints - the glasses for water were two small...I wanted a BIG glass of ice water, and there were missing hood for big old winter coats and purses in the ladies room.<br><br>Loved it- the space was super cool and I imagine it would be a great place in spring of summer with the outdoor patio.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LsNnayCQP7yR35PoMsAuDw/348s.jpg", "caption": "Upgraded bloody mary with shrimp"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YbDBdTvQ1VZ1TatMLo3eRg/168s.jpg", "caption": "Brunch menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MFYay8CbhsHXPkgpa5g7dg/168s.jpg", "caption": "Greyhound wiyh salted rim"}]}}, {"review": {"des": "Ada Street was amazing.  <br><br>As I walked in, I was given a tour and a general synopsis of the place (you can play a record from their very diverse library). <br><br>We started off with cocktails, that did not disappoint.<br><br>We had a large party and our server was very gracious when we weren't all there on time.  She explained how the ordering works and was very knowledgeable about the type and amount of food we had to order. <br><br>The polenta fries were outstanding, we also had the wings, the linguine, the fried olives, the ribeye, the trout, the bruschetta among other dishes.  The Chef herself came out and interacted with us and even helped get drink refills. They also played several of the records we had selected and it made our experience that much better. <br><br>Highly recommend this place, but be prepared for a wait, as it can get quite crowded, as this was our second attempt at going. Luckily we went on a Wednesday night and it wasn't too bad.", "pics": null}}, {"review": {"des": "We found Ada through our server Sara from Little Goat.  She highly recommended it and she was so sweet and helpful to arrange dinner reservations for us the same evening.  Who does that?  No one!  She heard we were not having such great luck with food in Chicago and made it her mission to change that for us.  It's people like her and the people at Ada that really care about local food that make the culinary scene so exciting.  They really wowed us and helped end our trip on a super high note!<br><br>Anyways, back to Ada...when we arrived, from the hostess, gm, executive chef, and our servers we were really treated with such great care.  They were all so great!  About the restaurant, the building, man it is super cool.  We loved the atmosphere!  An urban, outdoorsy, creative, and festive environment, we loved it!  I could not capture through photos the wonderful vibe it had, but it was urban cool.<br><br>On food, with the help of our server we ordered the Shiseto Peppers, Gnocchi, Pork Ribs, Steak Tartar (not sure on spelling), and we added the Bacon Salad changed to feta cheese, Linguine, Pretzel bun ala mode dessert and Chef Zoe sent us the Octopus and Chocolate Grenache dessert.  We loved how creative and how much love was put in the food.  We especially loved the Ribs, but everything was so good, super delicious!  Our mouths were overjoyed with orgamic pleasure, enjoying each bite.  We knew it was going to be another one of those nights where we would be uncomfortably stuffed, and we were.   Service was excellent!  A definite must try!  <br><br>For photos and more visit my blog!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lEn6VhubALJK8C0-t0v0ww/168s.jpg", "caption": "Grenache dessert"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GLlNOqMFgz0lZA6gQGsPdw/168s.jpg", "caption": "Pretzel bun dessert"}]}}, {"review": {"des": "Went for dinner with a few friends. The place is tucked away on what is a seemingly abandon street. The inside is very dark, but looks nice. We were seated outside int he back courtyard, which is very nice. The drinks were really good and we got a lot of small plates to share. Most of the food was great. We went to play some ping pong after our meal, which was a lot of fun, but may have annoyed some of the other customers, oops. Will definitely return in the future.", "pics": null}}, {"review": {"des": "We came for the chef's four course tasting menu with pairings, and it was superb. We would definitely be back for certain dishes we had and others we saw in the kitchen.<br><br>The logistics-- Ada Street is a small restaurant and requires reservations between 5:30 and 6:30pm. Walk-ins are welcomed there after. I made my reservation the night before and they were able to squeeze us in at 6:45pm at the chef's table or the bar. We opted for the chef's table, which was essentially a bar-like seat in front of the open kitchen. It was fun seeing how they prepared various dishes and how the chefs/head chef/floor manager/wait staff interacted. Otherwise, there is table, bar and outdoor seating - all look like great options. The restaurant is very dark and makes you feel like you are in a wine cellar or speakeasy. <br><br>The food-- Essentially, every main dish was prepared traditionally (salt, pepper, butter, oil, etc.) on the stove-top but was innovative in pairing them with other ingredients. This is long because it's worth talking about :) Here is what we had:<br><br>First course- We both had the house-smoked lake trout with roasted beets, horseradish crème fraiche. The trout was prepared perfectly, so that it was flakey, moist, just barely not pink anymore, and served at room temperature. The roasted beets were marinated in something (I don't know what) that really made them vibrant, juicy, and smooth. We also had the option to get the cured salmon spring roll, which we totally should have bc it looked like an amazing sashimi/roll concoction. This course was paired with a white blend from Spain, which was very smooth and slightly dry. <br><br>Second course- (1) House bruschetta, braised snails, white bean puree, peas, mint, and crispy prosciutto - aaaamazing - this was one of my favorite courses. The prosciutto alongside the braised snails was phenomenal and beautiful in every bite. I can't even find the words to describe. (2) The grilled eggplant and red onion, cracked tremiti olives, oregano-greek yogurt. We didn't really care for this dish. It was beautifully prepared, but underwhelming and without surprising contrasting flavors or textures. This course was paired with the Australian Woop Woop Chardonnay, which was so delicious. Chardonnay is my favorite and I made a note to get the name of this one.<br><br>Third course- We both had the Denver lamb ribs, mild habanero cream, pickled peppers, which was cooked perfectly such that the lamb was tender and came right off the bone. The habanero cream and pickled peppers were creative and the opposite perk to the traditionally heavy lamb. The other option was a gnocchi, spring peas, machego cheese, which we decided to pass because gnocchi vs. lamb is an easy choice. I'm glad we did because the gnocchi looked like gnocchi. It may have been delicious but it looked pretty traditional. This course was paired with some French red. I typically don't love reds, but this one was warming, dry, and airy, which I thoroughly enjoyed. <br><br>Fourth course- No option on this course and you don't need it! It was a dry-aged prime strip loin, aged balsamic, brown butter with roasted summer squash, chiles, mint. We make NY strips all the time at home because they're affordable, so when I read the item on the menu I felt a sense of \"oh..\", but this cut was so tender, it just absorbed the balsamic/mint sauce and took you to another world. This sauce was the highlight of the meal. This was paired with a Chilean Cabernet Sauvignon, which my husband thoroughly enjoyed (his fav) but I found to be too dry for my liking (especially after all the other glasses!). <br><br>Dessert- A buttermilk panna cotta, rhubarb puree, lemon shortbread with brioche donuts and lemon curd, paired with a Spanish champagne. The whole course was a whirlwind of deliciousness, which took you from fluffy donut delightfulness to bright and refreshing flavors with the panna cotta and lemon. <br><br>The service-- Overall, all of the staff was very friendly and courses came out timely. My one qualm was that our prior course dishes were not removed when finished nor when the next course came out! That was pretty shocking, especially for how Ada Street markets itself as a quality and unique experience. I love learning about table manners in different parts of the world, so I value it and this was duly noted. Since the food was so wonderful, I wouldn't say this deterred from the experience, but it is tucked away in the back of my head.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hFH0v3gIekZDBDrW5kg3TQ/348s.jpg", "caption": "best dish everrr"}]}}, {"review": {"des": "Love this place! Yes, it's located in an out-of-the way part of Chicago, but finding it is part of the fun. The food was great - try the crispy black-eyed peas and OMG the baby octopus with harissa - with one misstep, the pumpkin wedges. I love pumpkin, but these were so bland that we couldn't finish more than a bite or two. Topped with pecorino, but somehow the flavor did not reach the pumpkin at all. <br><br>No matter! Everything else we tried was fantastic, especially the chocolate ganache for dessert. And the cocktails! Original, house-designed, and a real treat (Only Son of a Ladies Man is outstanding). <br><br>The chef herself walked through the room and noticed my husband's empty glass, and personally brought him a new drink. She was so personable and easy to talk to, and it made the night that much more lovely.", "pics": null}}, {"review": {"des": "We just went again for probably our 5th or 6th visit last night. This time we enjoyed sitting on their beautiful patio! The menu has changed with some fun updates and everything was amazing.  The sauces are all so on point here.  All the staff is super friendly, excited and smart.  Some of our favorites from last night...<br><br>CHICKEN WINGS - duck fat confited sweet & spicy with a marinated cucumber salad  <br>GOAT CHEESE & SHALLOT BRUSCHETTA, herb salad, spring peas<br>LINGUINE - housemade with bacon lardons, garlic cream, grilled rapini pesto <br>DIVER SCALLOPS - fried plaintains, pineapple & bacon jam, romesco  <br>PRIME RIBEYE - spring ramp chimichurri <br><br>We finished with their amazing current bread pudding selection...<br>PB&J BREAD PUDDING  - concord grape jam, peanut butter whipped cream<br><br>Such a unique, awesome, hidden gem! You won't be disappointed.", "pics": null}}, {"review": {"des": "This would have been 4 stars for entire evening except for an unfortunate ending...<br><br>This part deserves 4 star....<br>-The food was great as was the service!!! - <br><br>-Needs a different system or space to wait...... <br>the system to call in an hour ahead needs to be fine -tuned. Called at 6pm- told no problem for party of 6 for 7pm. When we arrived the wait was 1 1/2 hours till seated. The area to wait is extremely cramped with staff needing to get by. This is unfortunate as Ada street is a very unique space. -Once seated we enjoyed great food, service etc...<br><br>This part will hopefully avoid a very unfortunate situation for future patrons. After spending 31/2 hours and $$$$ at Ada street we left to find our car window smashed and goods stolen - We informed the restaurant manager who was very sympathetic. My suspicion is this wasn't an isolated incident(lots of glass in adjacent parking spots) so some \"caution\" to patrons as they arrived would have been helpful.  Also posting \"surveillance signs\" to deter thefts - security cameras etc.. Was told that she would speak to the owners. <br><br>I just heard back 3/28/16  from Ada Street manager  and they offered a discount for our next visit.- They are also looking into what steps they can take for notification and signage.<br>Their efforts are appreciated and will hopefully deter future theft/damage.<br><br>In conclusion  - if you do visit  - UBER", "pics": null}}, {"review": {"des": "My party of three called to make dinner reservations here. We weren't planning on stopping in until 8pm (don't worry, I ate an entire pizza as a snack), so we figured we'd get there after the dinner rush and before the out drinking rush. But we wanted to be safe and make resos anyways. When we called to make these arrangements, we were advised that they only take reservations from 5:30-6:30, but to call back an hour prior to our arrival to be put on the list. Ok...<br><br>We called back an hour before our arrival and we were told that we could come on in, that they were putting our name on the list, and that we could get seated and grab drinks in the meantime. We Ubered over there after 8 (they didn't charge us up the ass that night, yay!) and when we got to the hostess she was like, \"Yeah... your name is on the list.\" Well yeah we know that, good, so now when can we get seated? \"Probably in up to 3 hours\". <br><br>Annnnnd I have no more words. Bye.", "pics": null}}, {"review": {"des": "Fantastic experience at this hidden gem. Cozy ambiance, great lighting/decor, fun indie tunes, and friendly staff. The food was delicious - particularly loved the lamb and the mushroom toast. Dishes come out as they're ready, so I'd suggest ordering as you go so as not to be overwhelmed by the fast pace. Half off bottles of wine on Wednesday were an added surprise!", "pics": null}}, {"review": {"des": "The atmosphere was great and the decor was beautiful. Unfortunately we were underwhelmed with our dinner.<br><br>First there was the polenta fries which were salty and bland. The short ribs were chewy and thin, we could barely eat them. The gnocchi dish was bland also.. Really had higher expectations.", "pics": null}}, {"review": {"des": "As we were sitting in their wine hallway, my friend asks me if I've ever seen the movie Hostel. Apparently, she felt as if we were in the movie. Very funky and interesting place. Food overall was good but not great. The crispy black eyed peas and brussel sprouts with onion jam were the best things we had. Mussels were pretty tasty. Scallops while perfectly cooked were kind of meh with the seasoning. Gnocchi had a great texture but seemed to be missing something. The French martini's were excellent. Place is a bit loud. A bit pricey too.<br><br>The bathroom seemed clean but I just kept wondering why it was so dark in there.  Black matte walls and extremely dim lighting. Also didn't see any hooks for a purse or coat in the stall but could have missed it because it was so freaking dark in there. Not quite a  serial murder is going to take place dark but close.<br><br>Overall interesting place. Would go back for a martini and the black eyed peas.", "pics": null}}, {"review": {"des": "Perfect hidden gem with a cozy speakeasy feeling, great for a date night of to show friends a fun new joint. My boyfriend and I sat at the bar on the time we went, chatting with the friendly bartenders, drinking some nice strong cocktails and sharing some great small plates for dinner.", "pics": null}}, {"review": {"des": "I planned a surprise birthday dinner here for a dear friend. The dinner went on without a hitch. Our server was friendly and accommodating. The food was good and presented beautifully. We were a party of 9, so we basically ordered the whole menu. And everything was good. We brought our cake, and they sliced it for us. Their cake cutting fee is $2 per person I believe. They split our checks with no problems. Overall, a good experience.", "pics": null}}, {"review": {"des": "If I could give more stars, I would.  Ada Street knocked it out of the park from start to finish. Although it was our first time in, Ada Street has been our best restaurant experience in Chicago.  It is a bold statement but they earned it.<br><br>Since it was our anniversary dinner, we took the 6:30 reservation.  I am glad we did because it got very crowded. (You can call ahead to get on a wait list).  The restaurant is unassuming on the outside in the middle of nowhere by the Home Depot on North Ave.  The location is part of its charm. Once you get inside, you are in a narrow brick hallway but it opens to an intimate restaurant in the back. <br><br>The food is exceptional. I would literally eat the menu but alas my eyes are always bigger than my stomach.  We had the pork empanadas, the steak tartare, the special  hand-rolled pasta with mushroom ragu, farro salad, octopus and wagyu hanger steak. Everything is phenomenal. All of the dishes are well conceptualized and executed perfectly. The seasoning is spot on and the dishes are well-balanced.  The special hand-rolled pasta and the hanger steak are out of this world.  We also ended with the panna cotta which had a nice, smooth creamy texture with a nice crunch from the streusel.  (Now that I write this, I find myself craving more).<br><br>Aside from excellent food and beverages, they have excellent service with an attention to detail without any pretentiousness.  Everyone wished us a happy anniversary and made a great experience starting off with a glass of champagne.   Our server, McKenzie, was friendly and very helpful with cocktail, wine and food recommendations.  We loved sitting at the Chef's table and seeing behind the scenes.  Chef Zoe is very talented and very personable. She also creates an environment where the staff like being there and you too just want to hang out.<br><br>I really cannot say enough good things about the food and people at Ada Street.   Ada Street has won over our stomachs and hearts.", "pics": null}}, {"review": {"des": "I want to go here to eat, drink, and just hang out. Food, cocktails, and atmosphere are all five stars for me. Because Ada Street just has a laid back and cool vibe that I enjoyed, I would go back even if the drinks and food weren't great (but they are great, so that's even better). I could drink twenty nine palm trees all day. It's bright and citrus-y, but the mezcal keeps it from being too sweet. Scallops with nduja are better than scallops with bacon.", "pics": null}}, {"review": {"des": "I give Ada St. 4.85/5 - but even then I am reaching. This is a great restaurant with fantastic ambience, wait service, drinks and food. <br><br>I went there for my birthday with a large party (~12) so we were given a private room away from the main dining/bar area. Note that there are two time slots on Saturday (everyday?) for this booking - 6-9 and 930-12 with a $500 minimum. Needless to say the wait staff was very friendly and accommodating. <br><br>The drink menu has selections for every taste and if I remember correctly, the drinks are stronger as you go down the list. I tried the TwentyNine Palms with pineapple infused mezcal, green chartreuse, lemongrass, and lime. I am not going to pretend that I can adequately describe the taste, but it tasted really good. There are definitely professionals working behind the bar as the general consensus of our crowd was positive.<br><br>Which brings me to the food. Everything is tapas style so we ordered several dishes and the staff brought about four orders of each. <br><br>WHAT I WOULD CONSIDER NON-NEGOTIABLE:<br>Goat and Bison stuffed cabbage rolls - tied for my favorite item there. Had a nice kick to it - not too spicy, but very flavorful.<br>Prime Flat Iron - perfectly seasoned and cooked. Slightly pricey as you receive 5 medium slices for $24 - but soooooo good.<br><br>WHAT I WOULD RECOMMEND:<br>Polenta Fries - perfectly fried and seasoned; sauce was a nice addition.<br>Snail Bruschetta - don't have too much experience with snail but the garlic cream worked well. For those who are hesitant, just try it, they taste earthy like mushrooms. <br>Parisienne Gnocchi - I love gnocchi and this was slightly different in that the gnocchi was much softer than what I am used to. The red kuri puree makes it though.<br>Pretzel Bread Pudding and Panacotta - both were very good for dessert. Some members of my group thought that the panacotta was a bit too sweet but I did not agree. <br>I was urged to try the Chocolate but I was disappointed to hear that they were out of it for the evening.<br><br>WHAT I WOULD PASS ON:<br>St. Andres Cheese Toast - There was something bitter and off about this dish. Maybe an acquired taste, but I definitely was not a fan. The table seemed to agree.<br>Pan Seared Diver Scallops - Personal preference as I am not a fan of scallops. The sear was perfect and the sausage was good, but these did not do it for me. There were mixed reviews with my group.<br>Shaved Brussel Sprouts and Kale - This was mostly the reason for -.15 in my review. This dish came last before dessert (after the steak). I wish for one that it was brought out earlier as it is more of a salad dish in my opinion. Also, it did not really have much flavor as the kale overpowered everything. Did not get much of the vinaigrette either as it was pretty dry. We would have been OK if this dish was not ordered.<br><br>Overall, I loved my dining experience and would definitely return for the cabbage rolls and the flat iron, if nothing else.", "pics": null}}, {"review": {"des": "One of my fav places in the city! Hidden little haunt this is and so very sexy! Now the food...just on a whole nutha level! So delicious and I think we ordered the entire menu! lol So trust, you can't go wrong! If you get a chance, sit at the counter...the Chefs are amazing to watch and they throw you a few bites. Fabulous experience...each and every time! I only take my favs here...just that special!", "pics": null}}, {"review": {"des": "Great food excellent staff . Chef even came to our private room to wish my wife a happy birthday... side note if you get the private room in the winter it can get a little breezy in there . Overall great experience.", "pics": null}}, {"review": {"des": "The restaurant is nice, the ambiance too. The food is delicious. But the service is not at the same level.<br>The waitresses walk in the room without paying attention to customers. Awkwardly apologizing when they bump them. <br><br>I even observed 3 waitresses spend a side of the jacket of a client who was on the ground. By 3 times, never stopping and picking up the jacket, until a new customer did it. Unbelievable.<br>Never ever, I have seen such a lack of etiquette, service and responsibility  in my entire life.", "pics": null}}, {"review": {"des": "I've been a few times but recently went and it happened to be restaurant week.  The restaurant week menu was required; it was not an option.  It was a 3 course, $44 prix fixe and it was SOOOOO blah/meh/disappointing!  I got the escargot, the forbidden black rice and the cereal bars.  The escargot was super fishy and just didn't taste fresh (we got all three starters among our group, and we thought the charred broccolini was the best...however, it was just broccolini). We decided that the black rice was the best entree any of us ordered, and it was not that good (the other two options were friend chicken which was SUPER fried, and cod which was the plainest most boring thing any of us had).  The cereal bars were so sweet they hurt my teeth, but I do think they were better than the chocolate-y option, which was excessively rich.  In all, it was a total waste of money.  Don't go for restaurant week!  I will note that the service was good and the ambiance was awesome - just a bummer to drop money on sub-par food.", "pics": null}}, {"review": {"des": "I didn't realize that this was a small plates restaurant, so it ended up being way more expensive than I had wanted. However, the majority of the dishes I tried were pretty good (shoutout to the mushroom and egg toast), and the service was awesome. They also gave me a free dessert for my birthday!", "pics": null}}]}