{"name": "adagio-teas-chicago", "reviews": [{"review": {"des": "This is not really a café, yet they will make you any of the teas that they sell! You can even get a tea latté, or talk to their staff about figuring out what you would like best.<br><br>They sell hundreds of types of teas, and it is so fun to go around and smell many of them. I'm a big matcha fan, so it was fun to look at all their types of matcha. They even offered chocolate matcha which I have never tried. <br><br>If you are looking for tea accessories this is your place. They have machines, kettles, strainers, cups, pots, bowls...really everything! <br><br>The service is on the slower side, but that is because they are helping each customer thoroughly. Everyone seemed to really know their tea here. They also offer tea samplings and fun events to attend in store. Definitely worth stopping in to browse, shop and try a new tea!", "pics": null}}, {"review": {"des": "Whether you are a tea snob or know someone who's one - get ready to par(tea) at Adagio. In contrast to my lame o(pun)ning, Adagio is sure to delight any level of tea enthusiast. <br><br>They have a wide array of high quality tea blends. You can buy in various amount or boxed them in a beautifully illustrated tin box for a gift. I love purchasing the Horoscope themed tea series (there's a blend for each zodiac!) or Chicago themed tea for easy little gifts. My personal recommendation goes to their \"40 winks blend\", it's delicious and will help you achieve a rested night's sleep. I am so glad I found this blend and could finally let go of my tylenol PM and melatonin pills. Their Tiger Eye is also delicious for those who loves black creamy tea with hints of chocolate notes. It's my favorite black tea so far!<br><br>Plus, everytime I visit, the store employee are always so friendly and equipped with impressive knowledge of tea and Adagio as a store.<br><br>Adagio only has physical retail stores in Illinois, so despite having an amazing online store, I would highly recommend visiting the store for a tea tasting or to be able to browse the wonderful teas and smell them! <br><br>Fun fact, adagio means 'slow tempo' and for those looking to wind down and relax or cruise into the world of teas, I cannot recommend more highly to make Adagio Tea your first stop!", "pics": null}}, {"review": {"des": "I came here expecting a cafe, but it's really more of a Teavana/ tea shop, where you can also order drinks. There is no indoor seating area. <br><br>Gabby was upbeat and very helpful in helping me navigate the vast selection of teas Adagio offers. I sampled a couple and ended up getting a few bags of loose leaf tea, as well as a hot cup of tea (free with my Yelp check in offer!) <br><br>They have a really extensive selection of loose leaf teas and tea bags, as well as a nice sale section.", "pics": null}}, {"review": {"des": "As someone who is relatively new to drinking tea, this shop has everything that I could have asked for and more. I've ordered Adagio online in the past, but have never been in a store. Artemis made the whole experience for me. She allowed me to try teas that I hesitated to purchase in the past online for fear of wasting money. She also asked me what I liked and what benefits I was looking for from drinking tea, then she made some excellent suggestions and I'm very happy with all of my new teas. I can't wait to drink them this winter. Thank you, Artemis!", "pics": null}}, {"review": {"des": "Very pleasant experience..........Excellent staff with helpful knowledge of teas to delight my palate.  My second trip to this location exceeded my expectations. Baltazar Cardona and Artemis Freeman could not have been nicer and fun. I ended up buying more tea than I need because of their great dispositions and sense of service and accomodation. <br>5 * Recommendation.....Cheers!", "pics": null}}, {"review": {"des": "Had a girl's day with my mom, sister, and friend. We decided to do a tea tasting here and it was so fun! They gave us some cookies to try while we sampled our tea and were very knowledgeable.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TLysB0PY6DT2iVpVG9wbug/348s.jpg", "caption": "The teas we sampled"}]}}, {"review": {"des": "This is truly tea heaven. If you're like me and you drink tea multiple times a day, you have to stop by Adagio Teas. <br><br>The employee who helped me was great- she gave me a free sample right when I walked in, let me try a tea I was interested in, and answered all of my questions.<br><br>There's a long wall dedicated to the many different types of tea they have, with jars of the leaves for you to smell. It's divided by type- green, black, etc. You can buy loose leaf or bag tea (go loose leaf- it's just better!). Prices I saw ranged anywhere from $7-$24, with most of them in the $7-$9 range. They had a buy 4 get 1 free deal, which was tempting, but I had to have some self control and only got 2 types of black teas. <br><br>They also have lots of tea accessories- pots, strainers, etc.- to help with any tea need you could ever have. They have a reward program, which I joined although I don't live in Chicago because you can purchase online and you get points every time you buy! They also gave me a free sample when I checked out- not sure if it's a temporary promotion or what- and it just so happened to be my favorite black tea, Irish Breakfast. <br><br>I can't wait to go home and add my bags of Adagio Tea loose leaf to my borderline obsessive amount of tea!", "pics": null}}, {"review": {"des": "I came here for the free Yelp check in for a free cup of tea. As a lover of both black and green teas, I asked for their recommendation and went with the Jasmine Phoenix Pearls green tea. After signing up for their promotional emails, the girl brewed a hot cup of tea for me. The green tea flavor was strong, with a delicious floral flavor of jasmine. I'll definitely come back to try some of the other teas!", "pics": null}}, {"review": {"des": "I first heard of Adagio online and bought some fandom teas (Doctor Who, anyone?). I was surprised to find that they actually have brick and mortar stores so I had to check it out.<br><br>They have some really nice tins, I'll give them that. They had this zodiac line with beautifully decorated tins for each sign. They were only $9. They'd make great gifts.<br><br>They also had this beautiful line of Taiwan, China and Japan teas. The tins were also beautiful. This line was incredibly pricey though. $49 for 2 oz! Wow! I did try the Hsinchu tea and thought it was very smooth. I bought a small tin for my parents, mostly for sentimental value.<br><br>The girl that was leading the tea tasting was nice. She was telling me about fun facts about certain teas. She even gave me some samples on the way out.<br><br>I unfortunately have too much tea in my house and I really don't need anymore, but if I do, I'd definitely stop by Adagio.", "pics": null}}, {"review": {"des": "Balthazar was AWESOME. My son Jordan and I plan to spend our next Mommy any Me night over Balthazar's pick for us. The tea selection was amazing. I learned a lot, considering my son abdcI are new to the communiTEA. Adagio will definitely be my new home for tea.", "pics": null}}, {"review": {"des": "Amazing tea shop. They had all the teas and accessories from beginner to pro! The staff was very knowledgeable and friendly and answered all our questions. The tea samples were a great addition to my stash!", "pics": null}}, {"review": {"des": "This is a perfect spot for tea! You can get tea in just about any flavor you like. Caffeinated or non-caffeinated. Iced or hot! They usually have a couple of teas made to sample. It's handy to grab some tea and take back to your room if you're just visiting. They also have an amazing little patio area in the back. They share this area with the building. If someone has booked it for wedding festivities it's closed off sometimes on the weekends. If it's not booked it's open. In a crowded, hard, cityscape there's nothing like taking a seat out back and drinking a little tea. Birds chirping, sun shining, flowers blooming, and trees leafing out. Are you in Chicago? Staff is friendly and helpful.", "pics": null}}, {"review": {"des": "We did a fabulous tea tasting with Artemis at Adagio Teas this afternoon. Wonderful tea selection. Artemis was knowledgeable and made this tasting one of the most fun, enjoyable that I've done. Highly recommend!<br><br>Also, Adagio has a beautiful outdoor patio behind the store. Perfect, secluded spot to enjoy a cup of tea with friends.", "pics": null}}, {"review": {"des": "The staff in Naperville is very nice and helpful offering a taste of what you are interested in as well as what is out for sampling. The teas are as good as Tevana and better since you can still go into the store and sample before you buy. The street parking opens up pretty frequently depending on the time of day you go and there are lots as well. The store was clean and well stocked.", "pics": null}}, {"review": {"des": "Happened upon this shop while on business in Chicago. As it happens I am a really serious tea drinker who's frequently frustrated by the lack of good tea options while traveling in most US cities. <br><br>So, I carry my own supply of tea for business trips. But I had run out. So this tea shop was like a bit of an oasis for me.  Neat and tidy, the aromas of toasted tea leaves enveloping the entire doorway.<br><br>The sales clerk Jessica was really delightful. Very helpful and knowledgeable about the tea selections. I was focusing on black tees and she immediately found one that would be ideally suited for my needs.<br><br>I settled on an Irish breakfast and she suggested that I considered buying in bulk because the cost per ounce was significantly lower. I agreed and for $24 I got a pound of beautiful Irish breakfast tea.<br><br>When I told her I did not think I could fit that large bag in my suitcase, she offered to divided into smaller bags. What a gym! So I was able to offer a bag to my colleagues, have one for my hotel room, and will bring two more home. Very, very nice", "pics": null}}, {"review": {"des": "I had seen there tea's online previously. I didn't realize that until i stepped into the shop. The service was not my favorite. I am an avid tea drinker and would have spent a lot of money in the store if they had better service. I went home with a simple tin and tea for checking in on yelp. <br><br>I would go back but, I might just buy there tea's online since they have the fun fandom ones<br><br>The big perk is the free tea with check in so make sure to take advantage of that", "pics": null}}, {"review": {"des": "Awesome place for a variety of different teas! Good matchas! Perfect for on the go cups of tea and have a ton of choices for loose leaf tea as well. Definitely will go there again", "pics": null}}, {"review": {"des": "what drew me into this store was the free cup of tea when you check in on Yelp with no purchase necessary. <br><br>great store, lots of loose tea leaves to choose from. From White, Green, Black, Fruity, and many more. <br><br>But i find that the price is too expensive for the quality of tea. I understand that Chicago may not have a lot of tea stores so they can raise their price. <br><br>buying a cup of tea here is not recommended, though mine is free but if that's how they're going to sell a cup, i suggest you buy a bag and steep it at home. Yes they use their tea leaves but the tea is not brewed properly. I understand that it's a fast brew, well if that's the case then add more loose leaves to make the cup of tea stronger in flavor. They add the amount as if you will brew it for a longer duration. The tea aroma hasn't fully come out and i've already gotten my cup of tea to go. Yes the color of the tea is there, but the taste is not. Thank God it was free. I would not have been happy to pay for that cup of tea. <br><br>I chose my favorite leave, Tin Kwan Yin... so i know what's good and what's bad.. they charge $18 per mentioned weight and the quality is just mediocre. You get what you pay.  This isn't the highest quality i've tasted. The smell is there. BUT it could be because they didn't brew it long enough. <br><br>i think this place has more selection (traditional and mixed fruity ones) so if you like more selection, i recommend you come here instead of Davids Tea.", "pics": null}}, {"review": {"des": "Great service by Zuri R and Artemis S! Delicious tea! Had fun sampling the tea in such a relaxing and friendly atmosphere. No pressure to buy but I did! Excellent tea. Enjoyed it very much! Will definitely be back when I'm in town.", "pics": null}}, {"review": {"des": "Beautiful place for the tea lover! Artemis helped me and she is extremely knowledgeable. Her service was completely awesome! Thanks Artemis, I will be back!", "pics": null}}, {"review": {"des": "They have so many teas to choose from! The people behind the counter were also insanely helpful and I really valued the free samples of tea! <br><br>As for the cost of the tea, it isn't too bad. For me, the 3 oz. of loose leaf teas cost me around $8 each. It also varies based on the kind of tea you're getting, but $8 was the average price that I'd noticed. They have loose leaf tea, but they also have the same teas in the tea bag form! <br><br>I will definitely be returning!", "pics": null}}, {"review": {"des": "Great experience working with Artemis to find just the right team.  Highly recommend the store, the tea and Artemis.", "pics": null}}, {"review": {"des": "I love this place and the worker helped me find the best tea for my taste buds! Great customer service!", "pics": null}}, {"review": {"des": "Approachable people if you have any questions. They could use a more larger variety of teas however. They have a really nice small patio space in the back to enjoy your tea drink. Overall nice :)", "pics": null}}, {"review": {"des": "Love, Love this place.  The teas are wonderful!! The customer service is awesome.  Artemis is one of the most informed, helpful, and personable     Sales Associate.  She makes each visit a pleasure.", "pics": null}}, {"review": {"des": "Today was my first visit to Adagio, and I was very impressed. Very good selection, very good tasting tea made to order, and most impressive - the staff. Kelsey and Artemis were a great team; they were both knowledgeable and experienced in all things tea. This establishment is lucky to have them!", "pics": null}}, {"review": {"des": "Incredible selection, good prices, and a passionate and friendly staff. <br><br>I feel like a kid in a candy store when at Adagio.", "pics": null}}, {"review": {"des": "Great selection of teas. Super friendly and not pushy staff. Everything is organic and there are no artificial flavorings which is great!", "pics": null}}, {"review": {"des": "I am so glad I found this awesome tea store!!!  The staff is so helpful with everything I needed to get started on making the switch from coffee to tea.  Adagio Tea has so much to offer and so helpful.  Looking forward to visiting this store often :)", "pics": null}}, {"review": {"des": "I took my friend here as a  birthday gift for a tea  tatsting.  Zuri, our instructor was very imformative, engertic, and knowlegable. Not only did she allow us to sample her own creation of 'depression tea'...which was quite healing and delicous. We enjoyed learning about the process of tea making and its ways of healing.", "pics": null}}, {"review": {"des": "Wonderful tea store. Had lots to choose from. Helpful staff. Learned your tea style. Could try an of the teas so, you could make the right decision.", "pics": null}}, {"review": {"des": "My boyfriend is a huge tea drinker, and he got a gift card from here over the holidays. I bought a Groupon for a $20 tea tasting session so we made an afternoon out of it. Amazing hands-on store! Incredibly knowledgable & helpful staff! <br><br>Our 45 min. tea tasting started with our choice of 3 teas (between the 2 of us). We went up and down the tea wall until we found our picks: White Peach, Almond Oolong (our fave) and Green Rooibos Blueberry. We sat at the counter and our \"tea sommelier\" started the tasting. First she introduced Matcha, which was extremely fascinating and so yummy! She then went through each of the teas, one at a time, filling in the gaps with amazing fun facts and the history of tea. We loved every second of the tasting. At the end we each received a porcelain teapot w/ infuser to take home. <br><br>We shopped around a bit - the tea prices are extremely reasonable. At the end of our purchase we were also gifted 5 samplers to try. We'll definitely be back! Especially for Mixology night!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PTiKB_81Dwryvmc2-C6kTw/348s.jpg", "caption": "45 min. Tea Tasting session"}]}}, {"review": {"des": "This is one place I am really going to miss in Chicago. I dont know where should I start from<br><br>1. I found out this place via groupon for tea tasting..One of the most fun yet informative thing to do<br><br>2.Their tea collection is exquisite. My favourate is Cinnamon, Mint but I do drink their flavored tea as well like peach ,pomegranate or green tea.<br><br>3.Their tea pots are the best gifts.I think now almost evryone I know have their pots.The beautiful tea set has helped me make new frens and say goodbye to the ones that are leaving<br><br>4 . Matcha tea is amazing here.My husband completely loves it. <br><br>5. The people that work here are amazing.Their knowledge on tea and their friendly behavior makes this my favorate place in Chicago for tea.<br><br>This is a must go place even if you dont love tea. :)", "pics": null}}, {"review": {"des": "Great tea shop! Found it one day looking for matcha tea and they have great flavors! The matcha is also of great quality. Nice staff and the free sample when I checked out was a very nice surprise. My new favorite tea shop!", "pics": null}}, {"review": {"des": "A gem of a tea store! This is a tea lover's paradise. Great service from staff and fantastic selection. Staff was knowledgeable and helpful. We got to try tea and had fresh tea made for us of whatever we wanted. The store carries a robust selection of white, green, black, red, oolong, and herbal teas along with tea implements. Packages of tea describe the blends perfectly. You really can taste the distinct flavors in the tea blends. Very good quality teas. Can't wait to go back again.", "pics": null}}, {"review": {"des": "This was the first Adagio I had been to.  I like the location and love the staff blends that you find in addition to all the normal blends you find at all the Adagio stores.  They remember loyal customers and get to know your likes so they make good suggestions as to what to try.  As all Adagios the only downside is that they really raised the prices for tastings without offering a little extra to make up for the price.", "pics": null}}, {"review": {"des": "The employees aren't helpful or friendly.<br><br>I'll be spending my money elsewhere.", "pics": null}}, {"review": {"des": "Amazing tea store! You can sample almost anything in the store if you're unsure which tea to get. I love the matcha green tea. It's my favorite.", "pics": null}}, {"review": {"des": "Great Yelp Deals! Very helpful staff. They were very nice and kind too. Plenty of teas to sample and what seems like 40+ to smell. All available for purchase. Lots of other tea accessories and knick-knacks also for sale. A nice bonus is the \"oasis\" behind the store to go relax and sip on some samples or a cup. Prices are very fair and they often have sales. They also have a generous rewards club. Check them out!", "pics": null}}, {"review": {"des": "The staff here were so kind and helpful! They explained everything well, and offered great suggestions. We ended up purchasing four bags, and got the fifth free.", "pics": null}}, {"review": {"des": "Amazing tea shop where you can enjoy your cup in this terrace once you walk out the back door! They sell tea in bags and also loose leaf (which I love) at a really great price. They also sell empty tea bags, so you can make your own with whatever blend of loose leaf that you choose. The people who work there clearly know their stuff and let you sample any of the teas on the shelf. I found both associates working to be super helpful and pleasant. I'm very happy that I joined their rewards program because I will definitely be back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LK_Y0XwekDAxxTdJhtOuLw/348s.jpg", "caption": "Amazing tea shop where you can enjoy your cup in this terrace once you walk out the back door!"}]}}, {"review": {"des": "Love this brand, and customer service. I have been getting my complex flavored, fresh, teas from here for several years. Highly recommend for their extensive selection of caffeine free teas, that don't taste like water...", "pics": null}}, {"review": {"des": "Highly recommend purchasing the tea tasting Groupon! My boyfriend and I came early and got to take our time sniffing out all the teas that we wanted to taste from the large wall of teas. We had a wonderful time learning much more than we expected with Jessica, and I loved how interactive and customizable the experience was. The staff was very knowledgeable and friendly, and we came home with a matcha set and a bunch of tea samples!", "pics": null}}, {"review": {"des": "I'm assuming it depends on who's working since there's so many wonderful reviews, but the weekend that Paulette was there was a terrible one. With only one girl working who was so uninterested in helping anyone out, but watching boredly while drinking tea (without offering any to anyone) is an experienced I'll never forget.", "pics": null}}, {"review": {"des": "WOW !! .... What can I say ? ..... <br><br>Stumbled across this groupon and am so glad I did.  I was looking for something interesting to do to bond with my 23 year old daughter and this was perfect.<br><br>The tea tasting was really fun and informative .  Betsy, our presenter, was GREAT !! .... She introduced us to the different types of teas and the correct steeping instructions for each.  Tea cookies were provided between tasting which were very tasty.  By the end of the tasting, she was so in tune with our likes and dislikes that she was able to let us know without tasting what we would like or dislike .  She was super ! <br><br>And to top it off , we each left with the cutest starter teapot with strainer .  We can't wait to return.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/N2rEZpJqZD-Jep8lQr_4wQ/168s.jpg", "caption": "A rainbow of tea flavors ......"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BimbBgmayMkoPQfj3a4mzg/168s.jpg", "caption": "Betsy showing us the ropes....."}]}}, {"review": {"des": "Excellent and varied selection of tea! My daughter and I were like kids smelling all the different flavors of tea. This store is a gem and the staff is friendly and knowledgeable!", "pics": null}}, {"review": {"des": "The girl was helpful.  We tried a custom blend but I clearly don't know enough about what I like so I ended up going with something they already made and added a lil more coconut for good measure. <br><br>They are knowledgeable and accommodating.", "pics": null}}, {"review": {"des": "Very friendly staff and very helpful. Helped me find the right kind of tea i was looking for along with the appropriate accessories! <br><br>As always smells great too!", "pics": null}}, {"review": {"des": "Cute store, I love the aroma! If I had more time to sit and taste the tea, I would have. i could have spent all day there. Maybe next time.", "pics": null}}, {"review": {"des": "My favorite tea shopping place. Every time i am in Chicago, i make a point to visit the store. The stuff is knowledgeable,  friendly and easy going. The selection is very diverse  and you can smell every tea in the shop. A lot of teas you can try also. The store itself is fun, roomy and comfortable.<br><br>Overall, a lovely place to shop for tea lovers.", "pics": null}}, {"review": {"des": "Miranda was very nice and helpful. She made me a custom blend and wrote out \"surprise blend\" on the package because I said my boyfriend wanted to be surprised by what I chose. I thought that was pretty neat. The tea selection is great and the quality is super.", "pics": null}}, {"review": {"des": "Did another tea tasting!  This time it was with wonderful Jessie, the other person that I mentioned in my past review.  She is a wonderful and bubbly person that is very knowledgeable about her teas.  Again, each person has their \"specialties\" and I would say that Jessie's is applying images to her teas.  I recall her describing a Chrysanthemum/Ti Kuan Yin blend as a smile and hug from the sun on a cool spring day. <br>Because we did a tea tasting before, Jessue allowed us to shape the class however we would like it.  My friend and I wanted to try tea blending.  She started us out with some good bases, and then allowed us to create our own tea concoctions.  We were going MAD SCIENTIST in that tea shop!  <br>I left with a White Peony tea and some ginger and rose as well.  I totally recommend this location and will be coming back!  Jessie or Leo, they are the best!", "pics": null}}, {"review": {"des": "I went to try Adaigo tea for the first time last week. The ambiance reminded me of Teavana with samples to try and products displayed everywhere. When I arrived I wanted to take advantage of the yelp coupon, where if you checked in, you got a free cup of tea of your choice, so when I arrived I did just that and ordered a cup of tea. When it was time to pay, I presented the employee with the coupon and he told me that it was only good for 1 of 3 teas that they offered that was pressed on display. I told him that the coupon did not specify that and it said a free cup of tea of your choice. He refused to honor the coupon and said I can use it tomorrow if I came back. I told him I am not from Chicago and was just in town for the day, and he basically told me too bad. I thought that this was very misleading and not a great way to do business. I am a tea fanatic and definitely would have purchased additional tea from them to take back home, but after my experience with the customer service, I definitely will not be back there ever. The $5 cup of tea, has costed this business hundreds of dollars in future business. Oh and the tea that I ordered was very mediocre at best (which was also recommended by the same male employee who wouldn't honor my coupon).", "pics": null}}, {"review": {"des": "Really polite service and good tea. My friend enjoyed her wild strawberry but my hazelnut was a bit too stringent. I got a really good deal on them, thanks to the Yelp check-in and levelup. <br>Cons: Not sure why majority of tea shops lack seating these days - to me tea should never be enjoyed on the go. After my visit I also got pretty heavily spammed (9 duplicate emails) by them about the point reward system.", "pics": null}}, {"review": {"des": "Great tea shop with both lose and bagged teas.  Picked up a great blend made by the employees of lemon and chai which I highly recommend", "pics": null}}, {"review": {"des": "I got a Groupon for Tea Tasting here and it was awesome! <br>Mike was super friendly and explained the different teas that we chose. He didn't have the know it all nor a bland personality. He was perfect.<br>The teas at Adagio are not expensive at all. Anywhere else (Teavana), you'll be paying an arm and a leg. You get high quality tea without paying an outrageous price.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vo4_d-ooPX72qTXDekqCww/348s.jpg", "caption": "The cookies with the tea make a great combination!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Wt4WXWbRZzBI-LUY66SlyA/168s.jpg", "caption": "Mike was very informative and fun!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Sxj4m3N0BqjjUBO0AXsQEg/168s.jpg", "caption": "Tea tasting made a success!"}]}}, {"review": {"des": "I love that you can smell each tea to get a sense of the flavor.  I also love that you can get trial size kits of multiple flavors to try a bunch out and find your favorites.", "pics": null}}, {"review": {"des": "Great selection  of  teas to sample and buy. Employees are friendly  and helpful when you are looking for certain types of teas to try for a certain purpose.", "pics": null}}, {"review": {"des": "Very cool place! Friendly and helpful staff, lots of tea samples. Has a point system where you can get discounts and free teas online -- worth checking out!", "pics": null}}, {"review": {"des": "Great place for personalized service for tea to bring home, give as a gift, or for tea on the run. They will blend tea with fruit or fruits together for your own taste too. Very welcoming and cozy.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CcE1fawD5hhs0ebX0z3F1g/168s.jpg", "caption": "You can buy stuff for your tea leaves to cozy up to also"}]}}, {"review": {"des": "The store is organized and the staff are extremely knowledgeable. Plus they have a loyalty program.", "pics": null}}, {"review": {"des": "Come get at Adagio Teas! This store is only available in Illinois and another one in a country far far away... better than most other tea shops. Came here because I was enticed by their Yelp offer of a free tea... and it worked! I went into the store hoping to just get a cup of tea and came out with 5 bags of new tea that I shared with a friend! <br><br>Environment - probably one of the cutest tea shops I have ever seen. It's bright with lights and is even decorated for the holiday season! This totally beats your typical Teavana because that place is so darn dark... and no one creepy is standing outside making you try their teas.<br><br>Service - the worker who helped us was an Asian female and she was possibly one of the most attentive servers/worker I have ever seen. She asked us which teas we wanted to try and was very diligent in making them. On top of that, she took time to ask where we were visiting from and then she proceeded on giving suggestions on where to go in the city! Seriously, someone make her employee of the year!<br><br>Products - there is a large selection of teas ranging from all over Asia, as well as some favorites from South Africa. I'm not a big tea lover, but my friend who was said that the prices are really good here compared to Teavana. They even have Holiday-flavored teas :) yummm.<br><br>Personal Recommendations<br>- Rooibo Tea - fruity and light<br>- Jasmine Phoenix Pearl - expensive but worth the try; the Jasmine is perfect!<br><br>Currently deal... Buy 4 get 1 free which I took advantage of!<br><br>Come try their teas! There's a large variety and you won't regret it :)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/57ga7qanwEqafOLjAEz3qw/348s.jpg", "caption": "Tea and Adagio Tea :))"}]}}, {"review": {"des": "Adorable tea store with a huge selection of teas. Am impressed every time I go - the staff doesn't try to shove purchases down your throat (as some stores do) and they are all super helpful / kind! Really enjoy every visit here, even if I don't end up purchasing anything.", "pics": null}}, {"review": {"des": "We purchased a Groupon for the tea tasting and had a great experience! Learned about the different teas and were able to try a variety. Felt no pressure to purchase some tea afterwards but we did anyways. Overall a fun experience and good quality tea!", "pics": null}}, {"review": {"des": "Visited Adagio for a tea tasting with my mom. Claire was warm, informative, and made the session interesting. We purchased a few different teas and will definitely be back.", "pics": null}}, {"review": {"des": "I had a wonderful, ok...teariffic experience here.  I happened to be staying within a short walk of Adagio and noticed it walking by before I planned to stop in on Sunday.  With a yelp check-in, I received a free cup of any tea, hot or iced, of my choice!  I started talking to the tea expert about nutty teas, and he finally pulled out a secret stash of Chestnut tea, a holiday special.  He made me chestnut iced tea while I browsed the store.  I ended up wanting to sniff so many flavors not easily found on the sales floor, so he kindly plucked those from another floor and brought them to me.  I asked a lot of questions and he and the other associate were very easy to answer and help.<br><br>I ended up buying almond oolong and hazelnut black teas, matcha mints, and matcha granola.  I signed up and earned points for the loyalty program as well.  I also was given a free sample of peach black iced tea.  The store is very colorful and fun, and I enjoyed my time (and my tea) there.  Hopefully Chestnut will return in the holiday season so I can order it online!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hyRxeVrapoLl-fswFpbDMQ/348s.jpg", "caption": "Iced chestnut tea"}]}}, {"review": {"des": "Amazing teas, with consideration for the farmers.  Really knowledgeable staff. I thought I was a tea snob, but ended up getting showed up by the nice ladies working that day.  We sampled so many that day, and brought home alot with us.  Glad we decided to stumble in.  <br><br>PROTIP:  They have online ordering.", "pics": null}}, {"review": {"des": "Adagio, come to Tulsa. I will give you all the business you want.  <br><br>I loved this place! The selection of tea to choose from is vast, meaning I spent a solid ten minutes standing there staring at the menu and debating. In the end, I went with a sangria concoction that was so refreshing that I wished I had ordered a larger size. <br><br>Service was so, so great! The girls working were so helpful! And there were three samples available to try, which helped immensely when making a drink selection. <br><br>Seriously fantastic tea shop!", "pics": null}}, {"review": {"des": "I'm a long time tea drinker and I love finding new teas and tea gadgets.  I really enjoyed the tea tasting session led by Leo. He was charming and knowledgeable about tea, how it's processed, the differences in the white, green, and black teas - both in taste and how they're produced.  Well worth the visit - and I left with a lovely bag full of teas to enjoy this winter.<br>My friends and I enjoyed ourselves thoroughly and will definitely be back.", "pics": null}}, {"review": {"des": "We came here for a tea tasting and had the nicest time. Kind and knowledgeable staff made for a wonderful experience trying and discovering different types of traditional teas. Didn't plan on buying much, but after our tasting we couldn't resist buying so many wonderful teas.", "pics": null}}, {"review": {"des": "Great selection of tea-loose and bags. The staff is very friendly and helpful. They will brew any tea you want to try. The tea is a little pricey, but you can save money if you're buying multiple items.", "pics": null}}, {"review": {"des": "My mom & I have been drinking Adagio teas for a few years (we live in California), and I had no idea there was an Adagio retail store in Chicago until I saw that it was a tea location nearby on Yelp!<br> <br>The interior is very bright and welcoming. I loved the long bar display of tea leaves across one wall. Customer service was great, and I highly recommend you to try and ask for some of their samples. Outside of their tea, they have a great assortment of tea accessories and gift potential selections for you to browse through as well.", "pics": null}}, {"review": {"des": "Straight from the source! This tea store blows Teavana out of the water. I came across Adagio Teas as I was walking down State Street on my last visit to Chicago.<br><br>The first thing I noticed when we walked in were all the boxed tea sets (I was later told that customers can customize them online, and then they sell the buyer's favorites). There were a ton of cute and colorful teapots, cups, and other boxed gift sets along the wall.<br><br>Before we began exploring all the different teas, the very friendly employees helped answer a few of our questions. Janelle (I believe that was her name) was very kind to serve us some free samples to try while we walked around. She helped us narrow down our choices, and before I had to fully commit to one, she offered to brew a cup of any of the teas I wanted to try. I pretty much already had my mind set on the Rooibos so that's what I went for.<br><br>Of course, I had to come back a second time before leaving Chicago. On my second visit, I took advantage of their buy 4 get 1 free (any combo of tea bags or loose tea). I also purchased a tea tumbler (their best seller, and I can totally see why). Although my visit to Chicago had to end, my new fascination with Adagio can continue through their online store where I can also use my rewards card for future purchases.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Fq9_48SHdhmxYox35XRzEA/348s.jpg", "caption": "Samples all over the store"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oCvgPTHzqdqHqPmKhntE0g/168s.jpg", "caption": "Cookies, sugar crystals and dried fruits"}]}}, {"review": {"des": "What a terrific experience!  I purchased a tea tasting experience on GroupOn and it was so fun and educational.  Jessie was fantastic and (such a tea nerd), she was so knowledgeable about the various teas, tastes, how/where they're grown.  Didn't realise there was so much to know about teas.  I'm now a believer in the health benefits and will drink matcha everyday (despite believing it was going to taste like grass).  Would highly recommend this for a girls meetings by place and the teas are delicious.  Step outside your usual, we did and we're not disappointed.  Thanks again Jessie!!!", "pics": null}}, {"review": {"des": "Awesome Ambience, great service and an excellent variety.  I tried and bought the valentines special- strawberry, rose, chocolate and vanilla flavoured tea. Would totally recommend it.", "pics": null}}, {"review": {"des": "Great store.. This was the first time we went. The tea is really good and a very knowledgeable staff. They would allow you to taste and tea you wanted which is great! Sometimes when you smell a tea it never treated the way it smells so it was awesome to be able to try before you buy!! Definitely will be going back when we run out.", "pics": null}}, {"review": {"des": "Great atmosphere - knowledgeable staff, delicious teas. All you need!", "pics": null}}, {"review": {"des": "Jessica is the best :) she has most comprehensive knowledge of Tea growing process, and everything that has to do with the tea. If you would like to enlarge your knowledge about this particular amazing food -that can enrich your life, you must visit the store and consult with Jessica about everything that you would like to learn about tea.", "pics": null}}, {"review": {"des": "While there are plenty of tea shops that exist these days (David's Tea, Teavana, etc), this place is slightly different.  <br><br>a) The manager is very friendly and engages his employees.  He challenges his employees to brew a tea each month and picks an \"employee tea of the month\" and then they sell it.  Great concept!<br><br>b) All the loose leaf is locally grown.  <br><br>c) Yelp check in gets you a free small tea. <br><br>I think if you are in the area and love tea, this is a great place to check out.", "pics": null}}, {"review": {"des": "We stumbled upon Adagio Teas during our recent visit to Chicago. There was an Easter sale going on at the time where tea sets were 15% off and tea was buy 4 get one free. <br><br>They had such a cute collection of caffeine free storybook collection and Disney princess collection box set of teas. I loved their boxed Chicago themed tea box sets as well. They make great souvenirs. <br><br>The staff were friendly and helpful too! Wish we had a similar tea store back in California.", "pics": null}}, {"review": {"des": "Haven't been here in about a year. Finally, finished up some old matcha. Not bad teas. Friendly staff. Looking forward to some more hot leaf water soon!", "pics": null}}, {"review": {"des": "Great service! The staff was really helpful and they knew about the products they sell. They gave me great recommendations and helped me decide what to buy. My shopping experience was wonderful and I totally recommend visiting this place.", "pics": null}}, {"review": {"des": "I had purchased the Groupon for my 15 year old daughter and I so we could have a girls day out. We took a wrong turn somewhere and ended up taking the scenic route of State Street. This shop is tucked in with a few others off of Ohio and State.<br><br>We made it for our two o'clock appointment and were warmly greeted. We began by choosing three teas. They are arranged in clear jars from white teas to the darkest. It smells amazing in there! We learned all about different types of teas and how they are made, also what temps to make the tea at. Each tea reacts differently to hot water. Some require a longer steeping time to extract their full flavor. <br><br>We were seated in the middle of the shop and our tasting began with a mango tea. There were three different tea infused cookies for us to eat also. Our person (I believe her name was Amanda) was willing to answer all of our questions. I think our tasting went on for 45 minutes. (We Yelpers ask a ton of questions) We also sampled a oolong and chai tea. <br><br>We each got to pick out our own tea pot too and purchased some of the teas we liked. They sell loose leaf by the ounce, in packs with bags or loose, and a variety of tea infused products.  The prices are pretty reasonable. This was a fun event for the two of us and the price was really inexpensive.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/USdXjhZ87E4UBMDhKsKzTQ/348s.jpg", "caption": "one of the many teas to choose from"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ib1MubG63wEiLy5lbOoNqg/168s.jpg", "caption": "Chai tea. There were so many to choose from."}]}}, {"review": {"des": "I love this tea shop. They're happy to give you samples of any tea you'd like to try, and they are experts when it comes to setting you up with a cup of something you'll enjoy. <br><br>A great option for gifts - from Chicago gift sets to dozens of cute sample boxes (green, oolong, black to name a few). <br><br>If you're a tea-lover, definitely stop in. They also have tea-infused chocolate bars that are a great alternative to gifting truffles or other more familiar dark chocolate options.", "pics": null}}, {"review": {"des": "I've been to many tea shops in my day. I love that this place does custom blends and for less than some chains charge for factory blends of lesser quality. Great staff, great inventory and great prices.", "pics": null}}, {"review": {"des": "While trying to make the transition from coffee to tea, I came across a Group On for a tea tasting at Adagio.  Bought it, scheduled it, tasted it, and I'm so much more knowledgeable about tea.  Thanks to Jessie (who was fun, enthusiastic, and so excited to share her passion of tea) I was able to experience different types of tea and narrow my taste down to two types in particular.  <br><br>There was a large variety to choose from and the prices are very reasonable considering the quality of tea.  Take advantage of the buy 4 get 1 free!  Worth the trip downtown.", "pics": null}}, {"review": {"des": "Excellent service!  Needed a new place to buy my teas. I found it here. They let me try whatever I wanted and have endless options to choose from!", "pics": null}}, {"review": {"des": "Really cute, well organized shop! Great selection and variety of teas and staff was very helpful!", "pics": null}}, {"review": {"des": "We bought the tea tasting groupon and had a fun, relaxing afternoon. The tasting involves three whole pots of tea, some cookies and dried fruit, and great conversation and recommendations. <br><br>We picked up enough tea to carry us through the brutal Chicago winter-- thanks to the \"buy 4, get one free\" special.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9-N6udMxTB28F3dFE76H7g/168s.jpg", "caption": "A guide to the health benefits of various herbs and teas!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KsBqa_5ZbV6f6lyXTHu-Jw/168s.jpg", "caption": "Teas to smell during the tasting."}]}}, {"review": {"des": "I tried to make this 4.5/5, but I couldn't, so I rounded up. :) If you're looking for quality, flavorful tea and okay paying a little extra, Adagio's great, but their staff is FANTASTIC.<br><br>My fiancé is an avid tea lover and wanted to go to Adagio on Saturday for their anniversary sale. I arrived earlier than him and quickly bonded with the staff. I tried the various pre-brewed tea samples as well as the tea cookies (yum). The staff was funny and knowledgeable, so I was already having a great time. Once my fiancé got there, he wanted to try several different teas, and Jessie especially was great. She made us cup after cup of tea and chatted with us about the flavors and her favorites. We experimented with brewing and smelled (almost) all the tea it seems.<br><br>I ended up finding a couple Christmas presents, and my fiancé found a basket full of flavorful new teas and blends. Plus when we checked out, Jessie and another staff member gave us some interesting samples to try! I know that's normal, but they let us choose and were delightful people in general. It was our 2nd time at Adagio, and we'll be back.", "pics": null}}, {"review": {"des": "Even though I love drinking tea, I don't know much about them other than the usual black teas that I like.  After my visit here, I realized all the different kinds of tea *within* each category!  The employees there were super friendly and very knowledgeable about their teas!  She had asked me if I wanted to taste *any* tea, to just let her know and she can make it for us, that was unexpected!  Of course, I loved my experience and tea so much, that I made a purchase and will definitely be coming back again soon!", "pics": null}}, {"review": {"des": "We bought the Groupon for a tea tasting for two and had a blast - definitely worth the money! We were paired with Leo and he was very knowledgeable, fun, and all around just a genuinely nice person. Any question we threw his way he was able to answer. Thanks for providing a fun, affordable and unique activity in the city! We will definitely be back for another tasting.", "pics": null}}, {"review": {"des": "Today was my first visit and I was glad I made the trip.   I was looking for a good selection of decaf tea which can be hard to find.   Well, I was pleasantly surprised because not only did Adagio have a great selection but the packaging made it easy to try a wide assortment at a reasonable cost and their display made it just as easy to get an idea of what I might like best.   Most importantly, the person who helped me knew his stuff and did all the things that someone in his position should do.   Glad I found the place.", "pics": null}}, {"review": {"des": "There's a reason this place has such great reviews. Beautiful ambiance, great tea selection, helpful staff. I have been ordering from Adagio online for years and let me tell you, we are so lucky here in Chicago to be home to their brick-and-mortar stores.<br><br>I always bring my friends from out of town who are also tea lovers to Adagio. On the 4th of July, I took my friend as a belated birthday present to do a tea tasting. We did our tasting with Jessie, who was so knowledgable and so helpful. She knew we were all tea nerds so we talked for possibly as long as two hours. We tried so many incredible teas, and got some of the Masters collection which was on sale. (the Yunnan Golden Curls and the matcha were both standouts to me.<br><br>I already love tea and Adagio helped me love it more. Even if you're a coffee person they will be able to help you find something you like and talk with you about how to make it.", "pics": null}}, {"review": {"des": "Tea tasting was such an awesome experience! What made our experience even better was our tea expert/instructor Leo! Leo taught us so much about where the teas come from and he helped us to explore the color wheel of aromas that the teas gave off. I'd totally recommend him if you go there! You will not only feel relaxed but you will leave with a better understanding of tea culture...and a variety of samples! :) Thumbs up for adagio teas!", "pics": null}}, {"review": {"des": "10/10 would recommend! Lance was incredibly helpful and let me smell a bunch of their delicious teas.  Really well priced!  I went with the Mango Green and a cool glass travel infuser.  They had a wide variety of interesting flavors.", "pics": null}}, {"review": {"des": "While planning my weekend trip to Chicago, my friend suggested that I check out some tea places. Thanks to yelp, we stumbled upon Adagio Teas. As I browsed their website, I wanted to get every single tea! <br><br>Luckily, they have a groupon deal for tea tasting, where in 45 minutes you and your party get to sample 3 different teas of your choice accompany with shortbread cookies that also had tea in them! During the 45 minutes, we were also given backgrounds and fun facts about different tea. Nicole was very fun and knowledgeable. We enjoyed the tea, cookies, and her company! At the end of the tasting, each person is given a tea pot! If you want to get other type of tea pot, they let you use the credit towards the one of your choice too. My friend and I each got individual cup with tea sieve! <br><br>Tea tasting is right on site at the store. During our session, there were other customers coming and go. They had 3 staffs at the time we were there, so everyone was able to get help. The staffs were very helpful in guiding patrons with tea selection, so if you can't decide or don't know where to begin, just ask! If you find a tea that doesn't have a tin for you to smell, just ask and they will bring some out for you.<br><br>I have yet to try all the teas I got, but the grapefruit oolong that I had yesterday was absolutely delicious. I like how the oolong taste is a bit subtle, but you can still taste it in the back hiding behind the grapefruit. If you like grapefruit, give this a try! <br><br>I grabbed one of the tea chocolate bar, earl grey moonlight (bravo?), and it was delicious! Everyone whom I shared a piece with loved it as well. At $6.50, I thought it's a bit expensive, but it's an occasional indulgent. <br><br>They also sell brewed tea at the store, and I believe you get a free cup when check in on yelp! I didn't use it because I am saving it for my trip back to Chicago. You can also get a $5 coupon code from their website. I forgot to use it because I was too excited and overwhelmed with all the tea... I will be back.<br><br>Great selection, knowledgable staff, welcoming environment, what's not to love?", "pics": null}}, {"review": {"des": "Great customer service.. First time coming to the store and i fall in love!! I will come back for more!!", "pics": null}}, {"review": {"des": "Did a tea tasting via Groupon on a Saturday to escape the Saturday St Patrick's day chaos in Chicago - could not have spent an hour a better way.<br><br>Leo was our guide through the tasting and did a fantastic job.  He was incredibly knowledgeable and clearly passionate about tea.  We did a sit-down tasting where we tasted 3 teas (any of them were game) and got to take home some tea-ware for the price of admission. Leo let us through the details of each tea, answered all of our questions about the tea-making and brewing (steeping?) process, and added a lot of colorful insight that made the session a lot of fun.  There were even a couple varieties of tea cookies and Leo steeped a few others we were interested in purchasing.<br><br>We talked out with roughly $70 worth of tea since they were having a buy 4 get one free deal.  I'll definitely be back to take friends or just taste a couple more teas in-person.  Adiago seems to be a big step above while having lower prices and more \"real tea\" than Teavanna or David's artificially flavored varieties.", "pics": null}}, {"review": {"des": "One of the Best *Shopping* Hour Lunch breaks I've had in Loooong Time!!!<br>Really great place! I will be back!! :)<br>YES! I'm really that Excited over Tea!! <br>#MatchaTea #TeaChocolate<br>#ZodiacTea #FreeSamples #TEALover", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/f4Cf01ZT5yfg6NGPuZeOxg/348s.jpg", "caption": "#Can't wait to get home and try out all my new goodies!!"}]}}]}