{"name": "alliance-bakery-and-cafe-chicago", "reviews": [{"review": {"des": "Was looking for a bakery to find a small cake for my bf birthday surprise. I was in the wicker park area, and saw how people raves about this place and gave it a shot. I asked for the tiramisu and chocolate ganache cakes which were absolutely divine. The ganache has small macaroons around it. It was beautiful! My bf and I loved the cakes. It was rich, moist, and absolutely delicious. Would definitely come back here :) also the worker was so kind to throw in a candle too!", "pics": null}}, {"review": {"des": "Service was very poor and attitude towards customers seems very annoyed and \"whatever\". I understand you don't have to be \"fake nice\" but come on you're running a business. You can't give your customers (unless warranted) attitude. <br><br>Ordered a cake for my father's 60th birthday. It was a few days before so I appreciate Alliance for accommodating. But during our phone order I was given attitude cause all I wanted was to confirm the message that was going to be written on the cake. I called and put in an order with a guy, didn't have my credit card info. at the time so he said to call back with it. I called in after and spoke to a lady and after providing credit card info. I asked her to confirm the message on the cake as it was my Dad's 60th...I want to make sure the right thing is on there. She said, I don't have the message. I asked well I would like to confirm the message. She wasn't really helping so I asked can you put the guy back on the phone...he picked up and annoyingly said, yeah the message is, \"Happy birthday Dad\". Awesome. That's all I wanted to know. <br><br>Cake itself wasn't really worth the price point to be honest. It was like a $50 cake. I had another cake that weekend that was from Whole Foods and the cake was a LOT tastier. <br><br>With that being said, Alliance does fancy \"looking\" cakes which are incredible. Wouldn't recommend coming here for your standard birthday cakes as the taste isn't anything special and you can save yourself some money and attitude by going elsewhere.  <br><br>#RefereEats<br>\"I call it like I eat it.\"", "pics": null}}, {"review": {"des": "I had a pretty frustrating experience with this place. I called and placed an order for 400 mini assorted desserts about a week before a party I was hosting. I gave all of my information, including credit card number, over the phone and was told my order would be ready at 4:30 PM the following Saturday.<br>Come Saturday, I went to pick up the order at around 5 PM (my party started at 6). Waited around for a while as there were other customers in line, no problem. Once it was our turn at the counter, I told them I was there to pick up the order I had placed. The guy disappeared in the back for quite a while, when he came back up he asked a few more questions about the order and disappeared again. <br><br>After about 15-20 minutes, he told us that they didn't have our order. At this point I am worried because the guy is about to start and we have no desserts. The guy at the counter tries calling the person I placed the order with (I had an email quote), and apparently there was some miscommunication between them so my order was not prepared.<br><br>The guy behind the counter was actually really helpful. He told us that he would get something together and deliver it to the party (it was a few blocks away). At about 7:30, he called me to deliver the desserts. They were fine and he even gave me a few extra. We were able to serve them at the end of the party, but I couldn't help being annoyed that I'd spent $400+ on desserts that were 3 hours later than expected and likely had been thrown together from what was leftover sitting in the bakery all day.<br><br>I will say the guy that delivered the desserts was very nice and helpful, and he did get us the desserts, but the whole experience was stressful and left a bad taste in my mouth. I was told that the manager would contact me the next day to make it right, but I never heard from him. I definitely won't be ordering from here again.", "pics": null}}, {"review": {"des": "I have been to Alliance now three times to get cupcakes on my way home from dinner in the area, and I love them!  I really love to eat dinner up on Division St and there have been a few nights now that no matter I where I end up for dinner, the night isn't completed without going to Alliance.  I went with a friend just last night and had some of their macaroons too, and these are also great!  Definitely the best baked goods that I have had in this area.  I will continue going back!", "pics": null}}, {"review": {"des": "Absolutely amazing job (as always)!<br>The pastry feeling made the cake taste great and the art work it's gorgeous! My very favorite bakery in Chicago!", "pics": null}}, {"review": {"des": "I ordered the cake for my daughter's first birthday and it turned out just like the picture<br>I showed them.  It was delivered on time to pick up.  The person who helped me was very helpful.  I definitely recommend this place to anyone.", "pics": null}}, {"review": {"des": "I have been to the downtown location many times before realizing there was another location in Wicker Park. Trust me when I say that I will be visiting this location MANY more times in the future.<br><br>Almost every time I have come here in the past, I have eaten the Lola; however, this time I ordered the Anne just to change things up. I must say that the Anne is my new favorite here at Alliance. It is wonderfully rich with chocolate flavor and I like how there is a crunchy praline (?) layer in the middle to contrast the mousse.<br><br>I'm looking forward to trying more pastries in their \"girl desserts\" lineup!", "pics": null}}, {"review": {"des": "I came to Alliance for my sons 1st Birthday cake and what I received and paid for was not even close to nice. I expected more since they have these great displays on the window and on their site but I guess not. I'm completely unsatisfied and will not go back again.", "pics": null}}, {"review": {"des": "Alliance bakery made the cake for our recent fall wedding, and we were really disappointed. The cake they delivered to us was not what we discussed in our previous meeting. We were told that we would have to pay extra money to have the design upgraded (we wanted cascade sugar flowers, with peach, blush pink flowers) which we agreed to, but the cake they gave us is the exact opposite of what we wanted. The cake tasted good, like what we tried during the cake tasting, but we couldn't bear to look at the cake during the reception. I wish we looked at other bakeries if we only knew that they wouldnt be able to provide us the cake that we wanted.", "pics": null}}, {"review": {"des": "The shop displays macarons, pastries that look so tempting. <br>I got a brownie which I think was a tad bit too sweet, didnt finish it.<br>The iced coffee is was just ok.<br>Liked their outdoor seating.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OidO-5ctCGA8stG_-Rb-fg/348s.jpg", "caption": "Iced coffee"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rASWK6NcJzUwFHC2aSZXog/168s.jpg", "caption": "Iced coffee and brownie"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pVMj2nbzGp4v8DLB63TbCw/168s.jpg", "caption": "Pastries look good!"}]}}, {"review": {"des": "Alliance made a beautiful wedding cake for our special day! It was absolutely gorgeous. A dream! The tasting in the planning process was super yummy. Our absolute favorite flavor both in the tasting and in the actual cake was the chocolate with the chocolate fudge filling! Alliance was great to work with and I would definitely recommend them for your wedding cake! Separately, they make AMAZING cupcakes as well!", "pics": null}}, {"review": {"des": "Alliance Bakery is a 1 of a kind gem, along division St. This place offers great selections of pastries from vegan options, to the true blue delicious chocolate desserts.<br>What makes Alliance a step above any other local bakery is their creativity with the cakes the custom make.<br>I ordered an awesome Vader cake that blew everyone's tastebuds and minds away. Not only did it look so beautiful we didn't wanna cut it, the cake was actually rich and delicious.<br>If you need a great cake, don't go any further than Alliance.", "pics": null}}, {"review": {"des": "Let's keep this short and sweet (pun intended). <br>While Alliance is pretty well known in Chicago, walking in feels like you've found a hole-in-the wall. I love the unique cozy warmth I've found in European bakeries and walking in to Alliance transports me back. Sitting in their separate lounge space is the perfect quiet place to escape on a Sunday with a newspaper or share a sweet thing with a friend and  a coffee. <br><br>The only bad thing about this place is the bad wifi.", "pics": null}}, {"review": {"des": "My husband and I used Alliance for our wedding cake.  We frequent Alliance very often since we live in the neighborhood, and we have known for a long time that we wanted Alliance to make our wedding cake.  I came into the wedding cake with a rough idea of what I wanted.  Sarah helped me to create a custom cake that turned out beautiful.  Each tier of the cake was different and extraordinary.  On the bottom tier of the cake, they created a gold Chicago skyline.  It turned out incredible, and better yet, the cake tasted amazing!  We are so happy we went with Alliance to create our custom wedding cake!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kjW0YC4PvKlxbRMxRbRouA/348s.jpg", "caption": "Alliance 4 Tier Wedding Cake; Beautiful cake and tasted incredible!"}]}}, {"review": {"des": "I ordered a 4 tier wedding cake for our wedding that was 7-28-18 on Elite Private Yacht. We had 4 flavors, each tier was different, our favorite was the lemon cake with strawberry filling. We worked with Hannah, who helped schedule our tasting, and worked with our wedding coordinator for delivery. She was wonderful! Our wedding cake was beautiful, and tasted amazing, my niece even said her favorite part of our wedding was the cake! Thanks again for making our day special. Can't wait to order our 1 year anniversary cake.", "pics": null}}, {"review": {"des": "I visited Alliance Bakery because of their Chance the Rapper cookies, benefitting CPS. <br><br>The staff was helpful and didn't rush me to decide on my selections. A cute little neighborhood bakery with a ton of artistry. <br><br>The cookies were good too.", "pics": null}}, {"review": {"des": "Wonderful bakery with great tasting cupcakes! The scrumptious buttercream frosting is a definite 10/10 - I could probably eat a tub of it. I really enjoy looking at the artistry of the cakes on display while waiting in line - so much talent!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Nx5-XhpxAMGqBCv04AHceA/348s.jpg", "caption": "Hazelnut Cupcake + Double Chocolate Cupcake"}]}}, {"review": {"des": "Loved the huge selections of croissants here, the sweet ones are great (especially the chocolate one) and the savory ones are pretty good too.<br>The cupcakes here are amazing! It is definitely on par with Molly's if not better, it is a bit on the sweet side, but the fillings are all so great!<br>The tiramisu cake is pretty good, spongy and not overly sweet.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/D1tmuXpQmZjkCfEZZ4hRQA/348s.jpg", "caption": "Tiramisu cake! With a piece of macaron on top"}]}}, {"review": {"des": "I am giving their cookies a 1 star. Terrible taste, dry and not worth the $5 that they sell them at. Don't waste your money. <br>Cakes look amazing taste is mediocre. I would not recommend.", "pics": null}}, {"review": {"des": "ABSOLUTELY AMAZING!!!!!<br>I have dealt with so many bakeries, requesting various designs for my kid's birthday cakes and no one has ever made me soooo happy! I sent a picture of 'Janja,' the hyena in 'Lion guard' for my daughters birthday cake, and I couldn't believe this masterpiece!!! I didn't want her to cut it! <br>Wonderful  cake, excellent presentation and very tasty! I was nervous but the cake tasted as good as it looks. These guys are also super nice and easy to deal with.<br>From now on I will only request cakes from this bakery and will recommend them to everyone I know! <br><br>Thank you so much for making my daughter happy and her birthday memorable!", "pics": null}}, {"review": {"des": "800 reviews--not the first one here--we were walking down the street looking for a cup a coffee--fantastic muffins and scones--great coffee--wonderful sitting room at 1740--real neighborhood gem--fabulous spot", "pics": null}}, {"review": {"des": "This is the AMAZING cake Alliance made for our daughter's first birthday. Buy your cake here and don't think twice about it.", "pics": null}}, {"review": {"des": "One of Chicago's best bakeries. Classic French hole in the wall. My boyfriend and I like their cookies and my dog loves their biscuits!", "pics": null}}, {"review": {"des": "Oh my, where do I start?! I first noticed this place due to the big windows they have showing off their talented work. They have several examples of the cakes they can make on display. Everything from lovely wedding cakes to creative unicorn cakes! <br>After walking by a few times, I eventually decide to go in a try something. Man, was I in for a treat! Their staff is outgoing and friendly and there are quite a number of options to choose from if you're craving something sweet. <br>My go-to was their macaroons. Hands down, the best in the area! They always have several fun and exciting flavors to choose from. The rose is to die for! I also really like the balsamic fig one.  I'm also a huge fan of their cookies and cupcakes. YUMM!<br>Pro Tip: If you go towards the end of the night, depending on the day, their croissants and breakfast treats may be discounted because they like to bake them fresh on the daily.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YVbEF_zJiAffaECgi_V6iA/348s.jpg", "caption": "Rose macaroon"}]}}, {"review": {"des": "We got this cake for my son Frankie . He turned 9 and loves FORTNITE and definitely loved the Cake too!  Tbh the cake was so good that it made me forget about the frosting ! I even had to cancel this order and they easily let me reorder and saved my information due to a personal family issue .... so understanding . Now this is a REaL CUSTOM BAKERy oh yeh they made such cute Mother's Day cookies too! I will add the photos ...and yes the cookies were really yummy as well !!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0WT2N7REifQE61AbzagwbA/168s.jpg", "caption": "Mother's Day cookies 2018"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DPX9PRO0QX5Y7vBF8M5Ekw/168s.jpg", "caption": "FORTNITE CAKE"}]}}, {"review": {"des": "Needed a last minute custom cake for my daughters birthday. This bakery not only exceeded my expectation on design, but in taste too. We ordered a gluten free chocolate with chocolate mousse cake. Yummm! My guests were wowed and the baby was definitely happy.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3Chwud4Bn_-uy3IlF4voSA/348s.jpg", "caption": "Baby shark for baby's birthday."}]}}, {"review": {"des": "I gave very little direction for my son's cake.   All I said was that I wanted a monkey and black standard poodle on one cake.  The cake turned out absolutely adorable!  The service is also very friendly, attentive, and kind!  If you want a one of a kind artistic cake, this is your place.", "pics": null}}, {"review": {"des": "Alliance was so accommodating with a last minute order for a friend's birthday. The cinnamon rolls were delicious and so fresh. Can't wait to go back and try all their other pastries and desserts", "pics": null}}, {"review": {"des": "this place is amazing, great pastries and very nice people. kalen needs his own pastry named after him :)", "pics": null}}, {"review": {"des": "Excellent and courteous service. Coffee was good too. I showed up with a stroller and not only did they help with standard stuff, but came around the counter to hold the door open for me.", "pics": null}}, {"review": {"des": "My sister ordered a two layer, naked cake for my baby shower. She worked with Nora via email and the order was super easy. She provided a photo of what she wanted the cake to look like and then Nora asked questions to fill in all the pieces. <br><br>The cake turned out beautifully. Guests said it tasted amazing, but honestly I felt this particular cake combo (vanilla with raspberry preserves) was just good to fit the bill but nothing amazing. I don't complain though, because the intention was to have a beautiful cake :P All in all, pleased with our experience and would come back again for special event order.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3iq7k65cUGgdOmfGLB1cig/348s.jpg", "caption": "baby shower cake"}]}}, {"review": {"des": "Came here after a very stressful chat where I could hardly think straight. It was a quiet oasis in their seating area separate from the bakery:) helped me cope", "pics": null}}, {"review": {"des": "Um... yeah. So, I am looking for a birthday cake for my son, who is turning 4 and Alliance was recommended to me by a friend. I stopped by to get an idea of pricing and what they offer. Met with a nice enough woman who didn't seem to know any base pricing off hand but worked with me to get it sorted. That much is cool. She asked me to email an idea while I waited and would get a quote from \"the back\" which I assume is where the baker is... never mind that it would have been easier to just talk to the baker. But we played the back and forth game twice. Let's also look over the fact that it's a cake shop with no physical example of the two round cake sizes they offer. 10\" or 12\" which I'll have to imagine the actual size of. We eventually move through pricing to discover my 4 year olds base price for a 10\" cake with construction paper cut out designs is over $200! The 12\" would have been closer to $300! He's turning 4! We are going to eat the cake! It's not a wedding! I respect that this is a legitimate bakery which offers custom cakes but I can get a custom cake at Mariano's for $50 bucks that feeds more people. I was honestly expecting to pay around $120 and was alright with that. While I waited for cake quotes I did order a cappuccino served to me by an eccentric over caffeinated woman who was also nice enough but can't pour a cappuccino to save her life. That was more of a double latte. While I appreciate the craft and time spent, I'd have appreciated base pricing, physical examples of sizes and a proper cappuccino more. Best of luck with your business.", "pics": null}}, {"review": {"des": "Loved the design and imagination of the baker who created the cake which was perfect for my cousin moving from Chicago to Dallas after graduation. The taste was pretty good but I am not crazy about fondant ...will certainly go back to order again.", "pics": null}}, {"review": {"des": "The pastries are out of this world delish! Very welcoming staff and extremely helpful with selecting the perfect treat for that sweet tooth.", "pics": null}}, {"review": {"des": "Great neighborhood bakery with delicious pastries!! Their window display always showcases incredible cake designs and they all look to amazing to eat.<br><br>In my recent visit I picked the key lime tart, ny cheesecake, strawberry lemon cupcake, vanilla cupcake and almond croissant. Yes it was all for me. I had a sweet tooth that day. <br><br>Sadly the key lime tart and cheesecake didn't make it by the time I got home. I couldn't resist. <br><br>I can't stop coming here!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JfmXnOxVOg6Wg_s96hTzDA/348s.jpg", "caption": "Key Lime Tart and NY Cheesecake!! Was gone in 5mins! :)"}]}}, {"review": {"des": "I love everything that comes from this bakery, except their customer service in cafe. I don't know why but it seems like everyone here has woke up in a crappy mood and don't understand that good customer service is key! There's a guy who works here, he's great! But the women are just snotty and always rushing you even when it isn't busy. We have been going here for years and years, I mean since I was in grade school and I'm no spring chicken. Macaroons are to die for, the croissants are amazingly delicious, Black and white cookies are freaking amazing! They make great beautiful cakes also!", "pics": null}}, {"review": {"des": "They made my son's 1st birthday cake off a pinterest inspiration photo... and I was beyond pleased. It looked phenomenal, tasted insanely good, and customer services was so helpful! Thank you Alliance Bakery!! Rita", "pics": null}}, {"review": {"des": "Alliance Bakery was awesome. Their location is great and the tasting was so fun and special; but mostly delicious! We got to custom choose our flavors and the final product was perfection and exactly what we asked for!", "pics": null}}, {"review": {"des": "Great service - Tony is exceptionally customer service oriented.  My birthday cake was one my party still talks about from my 40th!  Very Grateful for this bakery bringing my dream cake to life and they made my birthday even more special with their attention to detail.  All around amazing cake, professional staff and one of a kind product.  Very grateful!", "pics": null}}, {"review": {"des": "Our guests cannot stop talking about how delicious our wedding cake was!  The team at Alliance not only created a beautiful cake, but one that was tasty.  The tasting and design experience was a pleasure, and we wish we could do it all over again!  Their customer service is wonderful.  We highly recommend Alliance!", "pics": null}}, {"review": {"des": "These desserts are NO JOKE. I am not even a sweets person and this changed everything. Cookies and flourless cake are out of this world. They also have a cafe 2 doors down where you can sit/work and connect to WiFi. Always friendly people working and happy to help recommend some good treats.", "pics": null}}, {"review": {"des": "Wonderful bakery that was located near us while we were staying at the Ukrainian Village. The pastries were delicious and fresh. They had a nice selection of sweet and savory croissants, danishes, kouign amann, etc. They also had an assortment of cookies, cakes, and macarons on their display case. We ordered drinks and ate in the store as it was raining heavily. The store only had one table available so plan accordingly if coming during a busy time.", "pics": null}}, {"review": {"des": "These desserts cost a pretty penny, but I will shell out what I have to get these goods.<br><br>I've had a lot of things from their macarons to their lady-named desserts to the NYC-style cheesecake, and have loved all of them dearly. <br><br>I walked in on the Friday morning before Mother's day, knowing I had completely forgot to order my mom's favorite (cheesecake). I told the hipster (the cafe and general neighborhood is chock full of them, and I am probably a self-denying one too, but hey, we make the world go round) behind the counter that it was a long shot, but I figured it was worth asking; she walked to the back room, asked someone there, then came to the front and called someone on the phone to confirm: the person mass-mixing the cheesecake batch just started, and could add extra for my cake. ABSOLUTELY SAVED ME.<br><br>When they're not saving my ass from going home to the burbs empty-handed, this place is good for coffee, a croissant, a macaron or two, and getting work done in the separate lounge. I think the rooms not connected to each other is not the most convenient thing in the world, but it is a trademark and a pretty interesting experience to set them apart from other bakeries.<br><br>Case in point: their shit is great. Support them.", "pics": null}}, {"review": {"des": "Chocolate chip cookie was delicious !! Service was fast and cheap prices! Can't wait to come back.", "pics": null}}, {"review": {"des": "Alliance bakery designed a bumblebee <br>cake for my one year old granddaughter's <br>birthday party.  It was not only delicious but the<br>design was magnificent and very professional. <br>All the guests at the party had never seen such an adorable cake and it seemed like everyone took pictures of it to show to their friends.<br>I will definitely be a repeat customer!", "pics": null}}, {"review": {"des": "Words can not begin to describe the amazing cake that Alliance made for me!!!<br><br>I ordered a cake for my sisters bachelorette party a couple weeks ago and to say the cake was on point is an understatement. All my correspondence was with Tony and he was absolutely amazing. He was thorough, quick to respond and made sure every last detail was perfect. The girls could not believe how realistic the cake looked and besides the look and attention to detail it was delicious!!! I can not thank Tony and his crew at Alliance enough for the amazing cake they created. I can't wait to order my next one from them. <br><br>If you looking for amazing cakes or pastries, look no further because you have found the perfect bakery!!!", "pics": null}}, {"review": {"des": "I bought a plain croissant. It was stale. I bought two cupcakes: German chocolate and carrot cake. The frosting on both was tasty. But they tasted like box cake mix,especially the German chocolate. I would not recommend any of the items I purchased. Kind of disappointed.", "pics": null}}, {"review": {"des": "Can't say enough good things about Alliance. Coffee is delish, love the mint tea, the macaroons WIN AWARDS, staff is incredibly friendly, and great location and chill atmosphere. Wifi extends to their patio. I hope to do a wedding cake tasting here and will update on that!", "pics": null}}, {"review": {"des": "Ordered twice from here, once for cake pops and another for a birthday cake. Both were amazing!! They do such a nice job here. They are on the more expensive side, more than probably some other competitors, but it is worth the splurge. Delicious and beautiful to look at. They were also very responsive to email.", "pics": null}}, {"review": {"des": "Really great spot to work or study from. Their lounge is completely separate from the bakery and you don't have to buy anything to hang out there. They have great seating and aren't too busy during the week, and they also have seating outside. They don't play the music too loud, sometimes they don't play it at all. It is a comfy, bright, quiet room to sit down and focus on something. <br><br>Good black tea and chai.", "pics": null}}, {"review": {"des": "I've been passing this bakery with each visit to Chicago as my fiancé lives in the neighborhood and I've noticed the beautiful cakes in the window. Unfortunately because of my experience Alliance Bakery will not be my choice for my wedding cake for my guests or any event. I wandered in this morining to find a tasty pastry for my honey bunny. I have allergies to all things wheat so I found myself a bit overwhelmed at figuring out what to select as he is super picky about his sweets. I asked a few questions and felt rushed as two employees, possibly one the owner fast and furiously began describing the pastries. I desperately wanted to take my time and said, I'm overwhelmed with this amazing selection I just need a bit of time to make a choice. On a second question of a pastry the employee said thats chocolate inside, my reply not raspberry? The other employee, \"Yeah I told you that\" WOW! I thought how rude! Feeling the pressure I made my selection and thought.. Is it the slow time in which its taking me to select a few pastries, thats so annoying or is the hurriedness to rush me out the door due to the color of my skin? I have not found myself to have this thought in years, but the way in which I was treated was suspect to say the least, as I was the only one in the store. So dissapointing that in 2018, this Wicker Park bakery finds itself so exclusive it has an issue with a customer of a different race. Find a bakery with a warm heart and love for all people, don't get sucked in by the aroma you will get your fingers bit off before you can get that pastry to your lips..", "pics": null}}, {"review": {"des": "I am extremely happy with how my custom order cookie order turned out. The bakery Manager, Tony, was extremely prompt in returning my emails to place the order. An order of 24 cookies, split between 4 designs, cost me about $100 and was the perfect way to celebrate my fiancé's 30th birthday. It might be good to note that if you want to order custom cookies, there is a minimum order of 6.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iAKMhXvIlwek3LMW3ze8oQ/168s.jpg", "caption": "Sent the bakery pictures of what I was envisioning and they brought it to life. So happy with the turnout!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qcjcTRE3m14zBiAOMBuK-Q/168s.jpg", "caption": "Very happy with how my custom ordered cookies turned out!"}]}}, {"review": {"des": "I pass this little bakery and \"lounge\" frequently but never found the right time to pop in. I'm so glad I did. Even at 7pm on Sunday they had a nice selection of cupcakes, fancy pastry desserts, cookies, and interestingly flavored maccarons. I opted for a hazelnut cupcake with chocolate filling, since they were out of their cronut long johns. It was fantastic!!! I'm a bit of a cupcake snob and usually I'm more about the frosting. But the cake was sublime! Perhaps more impressively, the flavors actually worked together so I wanted to take a bit of it all together rather than my usual lick-off-all-the-frosting tactic. The cake was so moist, I could see why people were sitting down at the work/hangout space they offer next door to eat them with a fork. So good, and I'll definitely be back next time I wander that way.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SD85XyGmPWWgeT0NxF9iYQ/348s.jpg", "caption": "Chocolate filled hazelnut cupcake. So good."}]}}, {"review": {"des": "They made the most amazing cake for my friend's going away party a while ago. Picture is slightly inappropriate I think? Gonna post it anyway though the cake was so good. Picture of her beautiful ass with script \"hate to say goodbye, love to watch her go\". We opted for a picture printed on sugar, they took care of the beautiful script and lacy red border. Amazing service, everyone was super helpful along the way. Blew my mind, this started out as a joke cake and we ended up with a beautiful masterpiece, even better than we could've imagined.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AnPKwGKO0DQ1KBBpTnTHFQ/348s.jpg", "caption": "Legit the best idea we ever had, hilarious and beautifully executed, thanks guys :)"}]}}, {"review": {"des": "We took a look inside while walking around the neighborhood taking photographs. It was a respite well taken. The coffee is excellent, $2.75 for a 16-oz. serving, and the baked goods are a feast for the eye and the palate. We split a chocolate with salted caramel cupcake, pricey at $4.00 but excellent. As we left, we checked a card and found there is one in our neighborhood, on the 600 block of N. State. We will check this one out soon.", "pics": null}}, {"review": {"des": "Our wedding cake was unforgettable! I didn't have a great idea of the design I wanted, but I sent Alliance a couple pictures and thoughts... The end result was better than I could have dreamed. If you are slightly uncertain about your cake design and want expert guidance, this is the bakery for you. <br><br>A couple other things I loved about working with them:<br>1) They have a huge variety of cake flavors. You can be as creative as you want. We ended up choosing half red velvet cake with cream cheese filling and half lemon cake with coconut filling.<br>2) The cake tasting with Katy is held in an adorable front room next to the bakery. It was relaxing and fun, like having an afternoon tea with friends.<br>3) There were no hiccups or problems working with them. They are true professionals.<br>4) The cake was delicious. I got an unexpected number of compliments on it.<br><br>I will definitely find an event in which I can work with them again. They made my cake truly special.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7dX7R7D4UysiqsfzZkTCRg/348s.jpg", "caption": "Adler Planetarium wedding. The bride loves pink."}]}}, {"review": {"des": "Got the CUTEST corgi cake from here from my coworkers (I have a mild obsession with corgis).  Every detail was absolutely perfect, I was sad I had to eat it.  But the cake inside was even better! It was vanilla with chocolate mousse and very tasty. It was a cake for me so I didn't deal with the ordering or anything but was told that all they did was show them a picture of a corgi and they copied it exactly onto the cake. So so impressed!", "pics": null}}, {"review": {"des": "Five stars. Five stars. Five stars. This has to be one of the best bakeries in the United States. They made my girlfriend's birthday cake the greatest birthday cake I have ever seen and they were more accommodating than any bakery I have ever dealt with not only did it taste like the most delicious cake either of us had ever had but also it has to be the most beautiful I've ever seen.", "pics": null}}, {"review": {"des": "Place has been there forever.  Have ordered a few cakes from them.  Expensive but pretty good.   Went there the other day for a coffee.  They were very understaffed.  I ordered a Macchiato off their menu.  They told me that this is not something they knew how to make.   So I asked for a dry Cappuccino.   It was hastily made and pretty much sucked.  So, I guess consider them for a cake but go elsewhere for an espresso beverage.", "pics": null}}, {"review": {"des": "The cupcake was a little on the dry side for me but overall a good cupcake when coupled with the frosting & cold brew!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oE92iNBbmEL9GEGDnKQccg/168s.jpg", "caption": "Cold Brew & Chocolate Cupcake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6QUjrRdSYGgVzBTLujcHtw/168s.jpg", "caption": "Chocolate Cupcake"}]}}, {"review": {"des": "Good macaroons, nice texture and large variety of flavors, but a bit too sweet.  I prefer vanille patisserie over these.  Other desserts are just average and costly.", "pics": null}}, {"review": {"des": "Love their Totoro cake! Although, the cake was on the super sweet side even if you don't eat the fondant parts.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4al-0opplSuP_OL7N4gSsA/348s.jpg", "caption": "Absolutely love their Totoro cake! Although, the cake was on the super sweet side even if you don't eat the fondant parts."}]}}, {"review": {"des": "This review is specifically for only the macarons. Overall, I would give Alliance 3.5 stars.<br><br>I love macarons and visiting Chicago had me on the search for some macarons! I ran into Alliance Bakery while walking through Wicker Park. After seeing that sign that said \"Macarons,\" I knew that I had to get some! <br><br>If you purchase 5 macarons, they'll start putting it into the cute little boxes. Otherwise, it comes in a little bag. I tried the three macarons that I thought were not the normal ones you could find anywhere.<br><br>Pina Colada - This beautiful, sunshine yellow macaron tickled my taste buds and made me smile. It was phenomenal! The texture was perfectly crispy on the outside and soft on the inside. I love the surprise bit of pineapple jam in the very center. You could taste the pineapple in this without it being too overpowering. The macaron was light and so refreshing.<br><br>Key Lime - This alien green macaron did have a nice tartness to it. The only downside was the texture. The key lime was so underbaked and just fell apart when I bit into it. It was way too wet on the inside. If it was baked right, I think this macaron could have been a hit. It wasn't too sweet but not too tart either.<br><br>Chocolate Passion Fruit - I've never seen this macaron flavor so I was really interested. It's yellow with a dusting of cocoa powder on top. I didn't mind the powder, but it did leave my mouth a little dry. I think it could have used a little less cocoa powder on top. In contrast with the key lime, this macaron was unfortunately overbaked. The inside was very dry. However, the passion fruit shell was delicious and I did like the richness of the chocolate cream inside.<br><br>The problem with the macarons here are not the flavors, just the texture. The consistency of doneness is a little off. <br><br>Pricing is fine with the macarons being about $2 each. Service was great, the guy was really patient and friendly. This bakery has some amazing cakes on display, as well as some awesome treats in the display case! The slices of cakes, tarts and cookies looked scrumptious! Maybe next time I'll get those.<br><br>If this place shipped across states, I would probably order a dozen Pina Colada macarons because they were just so good.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Z6yi64tBFAH1jRuXiOQ38w/348s.jpg", "caption": "Chocolate passion fruit, key lime and piña colada"}]}}, {"review": {"des": "Alliance really came through for me when I needed a last minute wedding cake. I kind of wasn't able to handle life well after standing 15 ft. away from lightening when it struck our back yard. My left arm was paralyzed 80-90% and my speech got a wee bit messed up for awhile, making me sound like I just couldn't put the bottle down. Boy, that was fun. <br><br>My then-fiancé and I had to cancel our Las Vegas wedding because I couldn't fly on a plane and then he decided he still wanted to marry my busted ass so I took my one good arm and set to finding businesses in Chicago that could do last-minute wedding stuff. <br><br>I didn't even know what I wanted but then I saw a navy blue and coral cake on Pinterest that looked nice so my instructions were, \"make me a navy blue cake with an orangey/coral flower on top.\"<br><br>It was beautiful and delicious, I chose chocolate cake and vanilla buttercream to keep it simple. And though we couldn't take the cake with us on the rest of our honeymoon we enjoyed it for breakfast the next two days that we were in town. <br><br>+++++++++++++++++++++++++++<br><br>Originally we were slated to pick it up before our wedding but couldn't make it. The employees at Alliance made a really strong effort to try and have the cake delivered to our hotel and though they were not able to I could tell they were really working for us. We picked it up later on in the day since they stay open a bit later than your average bakery.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/weo6YbYB8tj2szw0Mp4VPw/168s.jpg", "caption": "Top detail of elopement cake."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/f40P1EQeldB9_BJQRvp3gw/168s.jpg", "caption": "Our beautiful and yummy last minute elopement cake."}]}}, {"review": {"des": "We chose out a cake for a birthday. Cute, simple decor, but the taste was just decent, nothing special. Tasted like the typical birthday cake. The frostings were a bit hardened and not smooth. I'd rather go for their macarons since they have some interesting flavors.", "pics": null}}, {"review": {"des": "This is the second birthday cake I have ordered from Alliance and again they knocked it out the park. If you can dream it they can make . This is the Only place I will ever order from. The Loves", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rdMV4f0tfKAOysWAdQJ2Jw/348s.jpg", "caption": "First B day cake"}]}}, {"review": {"des": "Great experience w/Alliance Bakery for my best friend's birthday cake!!! Tony was helpful, fast responding & was able to make the coolest cake ever!! It tasted amazing!", "pics": null}}, {"review": {"des": "The only thing good here was my tea. The cupcakes were dry and so were the French macarons, I will not be back.", "pics": null}}, {"review": {"des": "For my son's baptism I ordered a 12-inch cake from Alliance.  It was absolutely gorgeous!  I browsed pictures of cakes on their website and found one I liked with a few alterations, of course.  The final product was so beautiful!  I couldn't have been happier with the way it looked.<br><br>Regarding the taste, I choose vanilla cake with their \"white chocolate mousse\" for the inside filling and basic vanilla buttercream for the outside frosting. The mousse filling was delicious; it was light and had a delicate white chocolate flavor - a simply exquisite taste.  The buttercream frosting, however, left much to be desired.  It didn't taste like buttercream at all; I assume it was made from shortening but not sure; all I know is it wasn't butter.  I would have expected this from a lesser quality bakery, but at this price point ($150 for a 12\" cake!) I expected I would be getting pure buttercream.  I don't mind paying a lot for something as long as I'm getting a high quality product, but I was just really disappointed in the frosting.  <br><br>In conclusion, the cake I ordered was beautiful, but it's hit or miss on the frosting/filling flavors.  I would probably come back if I wanted an ornately designed cake, but for a simple design, I'd go to another bakery (e.g. Vanille in Lincoln Park) where I can get a true buttercream frosting.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XFoYo4AwrUYi_OcYs0a8DA/348s.jpg", "caption": "Beautifully decorated baptism cake for my son.  So gorgeous!"}]}}, {"review": {"des": "This is the second time I've ordered a cake from Alliance and they did not disappoint. First of all, the cake was phenomenally designed. Second, it tasted UNBELIEVABLE. The amount of compliments we received on the flavor and how light the cake was incredible. I will be ordering here again and again. Thank you for providing the best service and communicating with the customer throughout the entire process. Can't wait to order our next cake!", "pics": null}}, {"review": {"des": "Yet once again this wonderful bakery has  delivered.  Our son was ecstatic and we thought it was awesome as it was last minute. Thank you, thank you!", "pics": null}}, {"review": {"des": "Thank you for your partnership with our wedding weekend this summer.  It was a pleasure designing a combination cake and maccarroon dessert with you and your team.  The finished product was exactly what we envisioned and are very excited to try it again when we celebrate our one year in 2018!!  Thank you!!!", "pics": null}}, {"review": {"des": "Worst customer service ever! I ordered a custom cake for my Godchild's first birthday. My order was completely screwed up and I'm left with no cake the day of the event. The response from the staff was very Nonchalant, with no effort to correct their error! Delicious desserts, very poor management and customer service!", "pics": null}}, {"review": {"des": "Alliance is an all around wonderful multi-dimensional magical bakery....<br>... it's our home's go to place for a casual weekly special bite (favorite is the Anne!!!)<br>... love the lounge for when I need a quiet calm space to work / think<br>... activist cookies, enough said <br>... and wow can they make a wedding cake!!! We had a super simple 25 person celebration. We had still done a few tastings (priorities!) - and Alliance was by far the most delish. And so pretty!!!", "pics": null}}, {"review": {"des": "The only reason this place is getting 4/5 is because the pastries tend to be overpriced. That being said, the lounge is my favorite spot to get some work done. Drip coffee is a deal. Bring your own baileys and they'll take care of you.", "pics": null}}, {"review": {"des": "The worst customer service. The worst. They make a mistake and make you pay for it. So many wonderful bakeries in Chicago that will give you a great product and treat their customers with kindness.", "pics": null}}, {"review": {"des": "We had a great experience working with Alliance Bakery on our wedding cake and macaroons. The tasting was laid-back and fun, and not stuffy like the other place we went to. The person we worked with was very approachable and funny but also professional, and together we put together a menu that perfectly fit what we we looking for. Most importantly, the quality of the cake and macaroons was second to none. We highly recommend Alliance Bakery for delicious food with a creative and sophisticated approach.", "pics": null}}, {"review": {"des": "Easy to get what you want with the professional and courteous services at Alliance Bakery.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CsrydmyZQ6uwBhJewgqhYQ/168s.jpg", "caption": "It was the best!"}]}}, {"review": {"des": "I've been coming to this bakery ever since my friend bought me my birthday cake from this bakery.  It's been more than 5 years, I'm sure.  <br><br>The cakes are gorgeous and they can create just about anything.  This last time I was there, they had the whole front decorated with Minion cake figurines in various different Holiday movies scenes.  Adorbs!<br><br>I had gone in to get a cupcake for the road and totally changed my mind after seeing their beautifully decorated, and incredibly witty \"New Years Resolution\" sugar cookies.  Hilarious!  It kinda of reminded me of what Alice in Wonderland would've found in the cookie box or at the White Rabbit's house.  The cookie itself was buttery and crumbly.  But not too crumbly where when you bit into your cookie the whole thing shattered.  There was just enough give that gave that melt in your mouth crumble while keeping the cookie intact after that initial first bite.  The frosting on it wasn't overly sweet, that overpowered the cookie.<br><br>The latte I had paired perfectly with this delectable treat.<br><br>I can't say anything I've ever gotten here was bad or disappointing.  It's always been good.", "pics": null}}, {"review": {"des": "Bakery goods are the only reason to come here. Do NOT drink their coffee, which is at best watered down. I've tasted better coffee in the hospital than this!", "pics": null}}, {"review": {"des": "I've macarons from here as well as a red velvet birthday cake with buttercream frosting. I recommend this place to anyone who wants some top notch pastries in the Chicago area.", "pics": null}}, {"review": {"des": "Finally! After years of having this place bookmarked I finally got the chance to check it out. <br><br>I got Pistachio, salted caramel, raspberry, pineapple and rose flavored Macarons. <br><br>The star of the show was definitely the rose. I don't know what the heck is in them but I'm pretty sure LOVE is one of the ingredients. *I know. Cheesy AF. lol* They have a light, flowery taste to them. They would be perfectly paired with a cup of tea. Yea. Tea.<br><br>If I'm in the area, I'll make it a point to stop at Alliance for some Rose Macarons.", "pics": null}}, {"review": {"des": "We had macarons and a chocolate pastry topped with a roasted marshmallow. We preferred the pastries and macarons at La Duree and Lenôtre.<br>The service was prompt and friendly.<br><br>We parked on the street.", "pics": null}}, {"review": {"des": "Completely disappointed with the service received at Alliance Bakery. <br><br>I heard great things about this bakery and was very eager to place my order for a specialty cake for my grandmother's birthday. We picked the cake up and it looked amazing. There is no question that they make lovely cakes. <br><br>However, the woman that brought out the cake did not know how to properly box it.  She initially couldn't find a box that the cake would fit in she then proceeded to place the cake in a box that was too shallow for the height of the cake, which we didn't find out until we left the bakery and got to our destination. Upon removing the box, the top of the cake was completely ruined from touching the top of the box.This was a simple error that should not have occurred when customers are paying 100's of dollars for cakes.<br><br>We called to let the bakery know and they stated that we could bring the cake back to have them fix it but being that we were already out of town this was not an option. They offered no other consolation or even an apology and acted as if the mistake was our fault. It was sad considering the amazing things I have heard about this bakery and the products that they sell. <br><br>On a positive note the cake was absolutely delicious but I would have to think twice before coming back to Alliance again.", "pics": null}}, {"review": {"des": "Incredible space for the neighborhood! It's really a gift to the community because I have no idea how they justify the space financially, but I'm not complaining.<br><br>Huge plus, they have a printer with a reasonable printing charge which is awesome when you're in a bind or don't want to work from home.<br><br>Decent coffee and fabulous bakery items make this a must on the weekends to hang out with friends.<br><br>The only cons are sometimes the radio is too loud and I'm not a fan of the smell in the lounge. But I have a superhuman nose. All in all- love to have this space in the community!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YDtA58a8JZvWI8kcnxPvzA/348s.jpg", "caption": "Using the printing app, enjoying the day."}]}}, {"review": {"des": "my friend's room mate ordered a chocolate cake here to celebrate her graduation from a masters program!<br><br>i didn't get to visit the actual bakery but with the good vibes from the chocolate cake we tried, i would definitely make a visit!<br>---chocolate cake: MOIST the frosting was a bit sweet but the chocolate cake sure was good", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/H7QXeiJGsf-suXK2i_bDBQ/348s.jpg", "caption": "Chocolate cake!"}]}}, {"review": {"des": "Funny story, it was my birthday and I picked up my boyfriend from his work.  I had dinner ready on the stove and wanted to get home quickly, but my boyfriend decided to take a different route home and kept pretending to miss turns we needed to take in order to get home.  Eventually, after frustrating me enough he stopped in front of this bakery and ran in.  He had pre-ordered me a tiramisu, my favorite. It was very light and creamy! Yum", "pics": null}}, {"review": {"des": "Lots to choose from - and the customer service is so helpful that you feel no pressure to make a decision. Beautiful cakes and cookies and deliciousness", "pics": null}}, {"review": {"des": "The cakes looked beautiful, they were able to do exactly what I wanted but when I asked them for a price range on their cakes, I was giving the description of our cakes are on the higher end and are made for A-listers, and well known people meaning that this was the reason their cakes were ok to be over $500 for a small cake for 10 people. Maybe if I become an A-lister I will get a birthday cake from here, but until then unfortunately  I will have to take my business elsewhere.", "pics": null}}, {"review": {"des": "So nice and so fresh <br><br>Delicious croissants and cookies<br><br>Macaroons were delicious and soft<br><br>That lounge is bomb too", "pics": null}}, {"review": {"des": "This review is specifically for Alliance's cake bakery and it is long overdue but necessary. I got married in July and chose Alliance to be the cake bakery for our wedding cake. I live in the neighborhood and would frequent their cafe for baked goods and their delicious macaroons. I had confidence in their service and their ability to deliver quality products. Unfortunately, for me this was not the case when it came to our wedding cake. My husband and I met with Alliance's wedding coordinator several months prior to the wedding and specifically went over the details for our cake, how we wanted the design and layout executed, and the materials that would be used. We provided photos of exactly what we wanted our cake to look like in the end. The coordinator agreed and guaranteed that we would have a cake that was what we wanted and matched the photo we provided. We were happy and believed that we would get a beautiful cake that was delicious and a replica of the image we supplied. I even called them weeks before the wedding to confirm all the details and they agreed all was in order. Fast forward to our wedding day which is the first time we could see the cake and to our disappointment it looked nothing like the photo. The colors were off (we asked for deep fuchsia for our bottom tier and got a dusty rose looking pink), the gold ribbon we asked for was some cheap hard material that was coming off the cake, and the cake was leaning! I was so upset and heartbroken because we paid over $1000 for our cake and trusted Alliance with our vision and they completely let us down. The cake we received was not worth the money we paid. The only plus side is that the cake itself tasted great and the flavors we chose turned out to be a hit with our guests. However, in the end I was left feeling completely cheated and misled by a bakery that promised a quality product and instead delivered the opposite. I still look at the photos of my cake to this day and I cringe. I personally would not recommended Alliance Bakery for wedding cakes especially if this is how they choose to execute their products.", "pics": null}}, {"review": {"des": "We are so happy we chose Alliance to make our wedding cake. We live in the neighborhood and were Alliance fans before the wedding so it was an easy choice from the beginning, but wow they really delivered. We wanted a simple (and delicious) cake and got exactly that. Also the tasting was easy and so fun. Get your cake here!!", "pics": null}}, {"review": {"des": "They made THE most unbelievable Taco Bell-themed wedding cake.  I won't ever forget it.  My wife said they were a joy to work with and the entire process was super fun.  Thanks for making our already ridiculously awesome day even better.", "pics": null}}, {"review": {"des": "The best place in town for a large fresh impeccably made macaron. Enjoy your treats on the spacious front courtyard or inside their newly expanded lounge area. The workers are always kind and friendly, never had a bad experience in the past 5 years of going. I especially enjoy the all walks of life coming in and out of the place.", "pics": null}}, {"review": {"des": "Popped in for a quick treat for myself and my daughter. The cupcakes were tasteless and not sweet. The service was awesome though.", "pics": null}}, {"review": {"des": "This bakery has THE BEST macaroons I have ever tried. Definitely try the strawberry shortcake, you will not be disappointed. The other macaroons are delicious as well. I've tried other bakeries out but this bakery definitely has the best macaroons.", "pics": null}}, {"review": {"des": "I'm not much for sweets, but stopped in because it was the only bakery around still open at 8pm. <br><br>The s'mores treat looked absolutely delicious, but I passed.<br><br>We went with a few different macaroons.<br><br>They were okay. I've definitely had better.<br><br>The strawberry shortcake was too sweet and tasted like fake strawberry. You know that strawberry ice cream in the container often found at buffets and elementary schools? Yea, that's what it tastes like....<br><br>The pistachio was definitely the better of the two, but still didn't blow me out of the water. It was hard and meh. I prefer a softer light tasting macaroon. <br><br>My date ordered a chocolate Nutella (he liked this one best) and the strawberry shortcake (he wasn't a fan of that one either).<br><br>I don't think I would be back here. The employee was super friendly and helpful, but I'm going for the product and these just didn't catch my attention.", "pics": null}}, {"review": {"des": "Wonderful morning pastries and coffee with friendly service. Live nearby and it's a quick place to stop for breakfast on weekends or before work. I love the ham and cheddar croissant! I've also had their carrot cupcake, it didn't have raisins which was a plus for me and their cream cheese frosting is delish.", "pics": null}}, {"review": {"des": "My wife moved to Chicago from her home state of Texas after we got married. In celebration of her first milestone birthday in Chicago I wanted to order a custom cake for my love. Alliance Bakery came highly recommended by multiple friends. It was an easy process placing the order over the phone and then have a couple conversations with the staff to make my \"Texas\" themed cake perfect. I ordered a 12 inch vanilla buttercream cake with fresh strawberries that came out to $120. My wife and all the guests enjoyed the cake, probably one of the best tasting cakes I have tried. Definitely will return! Thank you Alliance.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NSPDQUzrlvvrPrs2HvxMOg/348s.jpg", "caption": "Birthday cake I ordered for my wife. Her first birthday in Chicago since moving from Texas after getting married. Yum!"}]}}]}