{"name": "aloha-eats-chicago", "reviews": [{"review": {"des": "Have been here a couple times now. Was not too impressed the first time around as I felt it lacked flavor & there was a strange odor coming from my friend's burger. <br><br>I've been to Hawai'i before & I enjoyed trying out their food. There aren't may places in chicago with Hawaiian food, so I'd say this place isn't too bad.<br><br>It is a small sit down place, or carry out (I'd recommend ordering ahead for pick up) it is busy street parking, or nearby parking garage (use spothero). You can get lucky finding street parking, or you'll just keep going in circles.<br><br>The 2nd time around, We've tried the chicken katsu & the bbq beef combo. Everything was delicious & great. Their portions are also big. I shared it with my son & it was plenty. We did also get an order of the loco moco that my fiance had & 4 spam musubis (they come in pairs) to have on the go for the rest of the day. <br><br>If you're looking for something close to Hawai'i, stop by here.", "pics": null}}, {"review": {"des": "Best Hawaii local food in Chicago is served here.  If you want something people actually eat in Hawaii come here, not one of the other poke shops or Hawaii eateries that serve fake Hawaii local food.  Here you can actually get a nice plate lunch with a bed of rice and tasty local bbq from a guy who actually came from Hawaii.  I grew up 18 years in Hawaii, so I think I am qualified to rate this place as a 5 stars.<br><br>The walls are covered with nice local paintings or pictures from Hawaii.  My friend even walked out into the winter Chicago without his jacket because he forgot and thought he was in Hawaii.<br><br>I ordered the chicken katsu and bbq beef mixed plate.  Katsu was a bit crispy but tasted good with the sauce.  The spam musubis were great!  Local style.  I had a side of strawberry guava that completed the meal.<br><br>If you haven't dined in before once, you have to try.  Hands down, hit the spot.  Just try a bbq beef, chicken katsu, or loco moco and you're sure to be in for a treat.", "pics": null}}, {"review": {"des": "Got the Chicken BBQ very tasty for $10 they were generous with the chicken.  That came with rice and cabbage.<br><br>I feel the dish could be much better with different vegetable option other than cabbage. Say pickled papaya salad.", "pics": null}}, {"review": {"des": "I LOVE ALOHA EATS.<br><br>My first visit was last summer when I ordered a Chicken Katsu plate and sat in a window seat. I was sold not only on how crispy the chicken was and how decadent the sauce tasted, but mostly by the fact that there was *so* much food! I remember ordering and being pleased that I basically had two meals in one, and a lunch to look forward to the next day.<br><br>More recently, I came back to show my boyfriend the joys of this Obama-loving establishment. Oh yeah, they take pride in our Hawaiian-born former president, with framed newspaper clippings on the walls that celebrate his 2008 win!<br><br>I am ecstatic to report that after a year, Aloha Eats still holds up: I ordered the Chicken Katsu again (WHAT? It was good!), and my boyfriend got the grilled Spam plate. He'd never eaten Spam before, but wanted to give the classic meat a try. He enjoyed it so much that he gobbled up the plate in one sitting! I personally enjoyed my half serving of my Chicken Katsu plate before boxing the rest up to head on home.<br><br>Both of our meals together were around $22, which isn't bad, especially for all of that food! I love Aloha Eats so much. There's a reason they have so many fantastic reviews!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8mgBfhlvXg0tbxohZtF4Bg/168s.jpg", "caption": "The inside!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QxZgl4BVHHSAmCz3dd8m_A/168s.jpg", "caption": "Chicken plate with macaroni salad!!!!"}]}}, {"review": {"des": "My friend and I walked into Aloha Eats while taking a stroll on Clark and seeing their menu on the window, which looked like a good variety of food and reasonable prices from a quick gander. The inside has about 10 tables and some seats by the window. Various Hawaii-related artwork and photos hang on the walls, and the overall atmosphere is comfortable, clean, not fancy in a good way. We decided to sit by the window because I'm not too familiar with the area, and eating and people-watching are two of my favorite activities.<br><br>I ordered the fried shrimp and BBQ beef combination plate. The service was nice and prompt; our food was brought to us in to-go containers, and the they were basically overflowing with food. On top of the generous portion size, the food was amazing! The BBQ beef was so flavorful and went really well with the cabbage and the rice under it. It was on the saltier side; I would recommend the BBQ chicken if you prefer milder flavors, which was also very good when I tried some of my friend's. The fried shrimp was tender and had the right amount of batter on them. The beef, cabbage, rice, macaroni salad, shrimp, and the tartar sauce for the shrimp were all placed in a single to-go box, which was convenient, but the food mixed around a bit.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JzhXtudRm8BfVDJuA2PYCA/168s.jpg", "caption": "Fried shrimp and BBQ beef combo platter"}]}}, {"review": {"des": "Aloha Eats. Is a hidden gem. It has a tropical Hawaii vibe as you enter and they are known to have good katsu. I got the Katsu box with PL and we were both so full from that one order. The portions are huge and they make their food really authentic to a basic Hawaiian place. The service is normal as you just order and pick up the food. They seem really busy during the lunch and dinner hours so I would come early or later to not wait in line. <br><br>This is perfect to come with your family or friends or even your date. I would definitely​ take pictures for Instagram​ because they have many posters and frames from Hawaii. <br><br>Overall, good stop by food when you are hungry and want something decently priced.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ax3jiCyYQLGpHquHXdJl8Q/348s.jpg", "caption": "good for two!"}]}}, {"review": {"des": "Really awesome Hawaiian eats. Rather you go with a combo or mini, you sure will have leftovers to enjoy, cause i usually do. This is my go to spot for a Hawaiian bite.<br><br>I usually go for the chicken combo. Here you're given chicken katsu that comes with an amazing dipping sauce and another style of chicken which is grilled. Along with that, you have rice & your macaroni salad. <br><br>I'm never disappointed when I come to Aloha Eats. Super fast service & super friendly. Great for lunch or dinner. <br><br>Parking is just a bit hard because it's on such a busy street so either paid street parking or in the residential area but make sure you read the parking sign so you don't park in a zone permit area.", "pics": null}}, {"review": {"des": "Top notch Hawaiian food with big portions and reasonable prices. When I walked in to order, the cashier was an absolute sweetheart and great person to converse with. The shop is pretty small so don't expect to fit giant groups here.<br><br>The first think you'll realize is that the portions are huge here. My friends have commented that getting regular portions allows them to store half to eat for another meal. For most people, ordering a mini size will be more than enough to make you content.<br><br>I ordered the chicken katsu, and it was delicious. Crispy, full of flavor, and tons of meat in each bite. The rice was cooked well with a lot of it. I give this place 4 stars because the katsu sauce is a little too sweet for my liking. In addition, the macaroni salad is just so-so. Personally I've had other macaroni salads I prefer at other Hawaiian places, but the katsu itself is a step above the rest.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xx3YpgczACRtE_ImBOuYuw/348s.jpg", "caption": "Chicken Katsu Regular, enough for 2 people"}]}}, {"review": {"des": "I love Aloha eats. I recently just went to Hawaii and I feel like this brings a little bit of Hawaiian culture back to the Chicagoland area. There's not a lot of Hawaiian restaurants in the Chicagoland area and this place is top-notch when it comes to their BBQ mix plate. Their BBQ mix plate comes a combination of different types of assortment of beefs and chicken with rice salad and pasta their process I was actually really good and their meat is always perfect to taste. I think this place is family owned and most of the food is being prepared by the owner himself. This happened in front desk are young and inviting. There's no bathroom in this place as it is a small little restaurant. Parking is really tough as a street parking and it's a very busy area. Otherwise this is a must go place I come here at least once a month.", "pics": null}}, {"review": {"des": "I have so many great things to say about this place, I don't even know where to start. I've been coming here for years and while I no longer live in Chicago, Aloha is always one of my first stops for a meal when I'm back in town...that should show you how much I love this place!<br><br>I grew up going to Hawaii and each time we were there we'd get Teri beef plates, Hawaiian sun drinks and haupia. In the states these things are impossible to find, leaving my stomach dreaming for those flavors and funds to take me back to the islands! Anyways...<br><br>I always get the teriaki beef plate here, it's delicious and comes with rice and mac salad (macaroni salad which is amazing). It's a big serving, so sometimes I split it. If you like ramen, get the saimin, it's Hawaii's version of it. Make sure to try the POG juice (pass-o-guava), liliqoi or guava juice which are in the refrigerator on the right. You can miss it if you aren't looking. If you like coconut, get the haupia as a dessert. It's basically a coconut geleten and is magical. <br><br>COME EAT HERE!", "pics": null}}, {"review": {"des": "I would literally come here every week when I lived in Lincoln Park. Such a cute little family shop (although I've noticed they started to hire more people). I considered this a great, quick, and inexpensive option for dinner when I did not want to cook.<br><br>I would always order the spam musubi or the bbq beef. The bbq beef is so well marinated and it's so tender. Definitely my favorite. I also love the \"aloha\" juice cans they have, and I can't find it anywhere else! <br><br>This is a small restaurant, but I have not encountered any times where it was super busy to the point I couldn't eat there.", "pics": null}}, {"review": {"des": "I can't vouch for authenticity, but wow this is great cheap eats!  There were six of us and we basically ordered the whole menu.  Be careful to not eat with your eyes - they're portions are very generous.  And don't forget that rice is heavy on the stomach!  I probably could've ordered just the spam musubi as my meal alone but we're not from Chicago so of course I had to order a combo too. <br>Also, they don't have a bathroom for customers to use (but there's a Starbucks across the street).", "pics": null}}, {"review": {"des": "In the great tidal wave of Hawaiian poke trending in Chicago I think it's important that we remind ourselves that there is more than decked-out sushi bowls to give us that island vibe. As much as I love the fresh marinated fish, toppings galore and yummy sauce of poke, there's something really fun about the mix-n-match nature of the Hawaiian plate lunch. And that's what Aloha Eats offers. They've been serving Lincoln Park for years and honestly they make happy tummies and tongues doing the hula.<br><br>The portions are great, the prices are good and the food is so tasty! Scoops of white rice and macaroni salad (sounds weird, I know, but hear me out) pair with teriyaki-ish chicken, bulgogi-ish beef or crispy fried katsu chicken. Or, if your idea of beachwear includes a tent-like Hawaiian shirt you can go for the loco moco. Delicious burger patties smothered in a luscious gravy and a fried egg on top. All tucked into this unassuming storefront restaurant with like 3.5 tables. <br><br>They also get these super scrumptious canned juices straight from Hawaii. Imagine your favorite fruit punch and then make it better. But usually I just drink water when I'm there because I'm saving my sugar intake for Molly's Cupcakes next door, which ohhhhhh my god. This stretch of Clark street is great.", "pics": null}}, {"review": {"des": "My girls took me for my birthday and I was so pleased. They have Spam on their menu. No. Not junk mail but Spam. You know, the meat out of a can. Don't judge. I love Spam. But they have this amazing menu filled with all kinds of deliciousness. We got the sampler and there was just so much food. We just couldn't finish and I'm a big eater... I can't wait to go back. Next time I'm gonna get something with Spam! =]", "pics": null}}, {"review": {"des": "I tried the Chicken Katsu with Beef Combo with french fries and rice and it was delicious! The beef sauce was a tad sweeter than Korean bugolgi but it went really well with eating a mix of other items like the Katsu and rice and french fries. The chicken katsu was juicy and well seasoned and the crust was very crispy. I didn't feel like springing $14 on a combo plate, but the portions so huge that I left stuffed and took home more than half the leftovers home to share with the fam. The next time I go, I shall just get the mini plates, which is more of a one person serving size. I highly recommend if you like Hawaiian food!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/l5wBkAtyX12YMalCV56Eag/168s.jpg", "caption": "Chicken katsu with curry"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_3Z3HlfZI1CpL_frVTXE1w/168s.jpg", "caption": "Comb of chicken katsu and bbq beef on rice and fries (in place of mac pasta salad)"}]}}, {"review": {"des": "YUM! <br><br>1. The prices are great. Expect to spend about $5-14/ per person. Maybe add $2 if you plan on getting a drink other than water. <br><br>2. It's a hole-in-the-wall feel type of restaurant. Not huge<br><br>3. Parking? You know Chicago. (took the train here)<br><br>4. Neighborhood? Super cute! <br><br>5. I got the Hawaiian bbq combination platter with beef, chicken, and beef short-rib. HOLYWOWITWASSOGOOD! <br><br>I would definitely recommend this place. Food is authentic and great quality for the price also. I cannot wait to come back here!!!", "pics": null}}, {"review": {"des": "Nothing but great things to say about this place! I've never had Hawaiian food before but safe to say, Aloha Eats set a pretty high standard for it! <br><br>The place itself is very small (almost like a hole in the wall type restaurant). It gives off a very homey feel for sure! Such a great part of the Lincoln Park neighborhood! <br><br>We ordered the Pork Katsu and the Hawaiian BBQ Chicken. Both were insanely delicious. You also get a really generous portion for the price you pay - which is pretty rare in Chicago! In addition to the meat, each entree comes with two scoops of rice and a scoop of the macaroni salad. Can we also just take a moment to talk about how delicious the macaroni salad is?! Definitely worth ordering it as a side!<br><br>Cannot recommend this place enough! Make sure to put this place on your 'to visit' list!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/L2MUt-IKOV3GU5b04sJMYA/348s.jpg", "caption": "Pork Tonkatsu & Hawaiian BBQ Chicken"}]}}, {"review": {"des": "This spot is about as close to hawaiian food as we can get here in Chicago! This dish is total hawaiian comfort food. The egg, gravy, meat and Mac salad with rice in one mouthful is divine!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xo7WKmBUG8FgO2VD6qD12g/348s.jpg", "caption": "Mini Loco Moco //  Home-made hamburger patty, one egg (you want it runny), and brown gravy over rice. Served with macaroni salad."}]}}, {"review": {"des": "Aloha Eats is a great Hawaiin BBQ place. I haven't been to any in the Chicago area until I heard of this place. I wasn't expecting too much, seeing as Chicago does not seem to offer too many Hawaiin BBQ restaurants. However, this place exceeded my expectations. The atmosphere felt very small and quaint, with many signs and decorations that helped make the restaurant have an \"islander\" vibe that they were attempting to go for. <br>The food itself was seasoned very well, I thoroughly enjoyed my food. I ordered the Teriyaki BBQ plate and spam katsu musubi. The spam katsu musubi did not disappoint and I would definitely drive the 25mile drive to visit again!", "pics": null}}, {"review": {"des": "My boyfriend always get the chicken katsu + bbq combo.  It comes with rice and macaroni salad and the katsu sauce on the side.  He says the food is awesome.<br><br>I got the mini chicken bbq plate.  It also came with rice and macaroni salad.  Chicken was good but definitely needed more flavor.  Thank goodness I had my boyfriend's katsu sauce to dip it in.  Otherwise, this would've been a struggle to eat, as there is so much chicken.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MTcU42vTfLY1pFsVkZJ1lQ/348s.jpg", "caption": "mini bbq chicken plate"}]}}, {"review": {"des": "The food is sweet.  Sweet like the innocence of a newborn baby wolf.  I usually get the Portuguese Sausage & Eggs.  And when I eat it I'm praying that the sausage was not made from a newborn baby wolf.  I'm sure it's not.  It's definitely not, but still I pray because Chris Pratt told me it's a good idea.  The meal of sausage, eggs, and rice is simple and delicious.  Truly.  You won't go wrong.<br><br>However, I have one very strong complaint:<br><br>The plastic and styrofoam.  Every meal served comes in a styrofoam container with a plastic fork and knife.  Water is served in a styrofoam cup.  Not the to-go meals.  Every single order is put in the same one-time use packaging.  It's so wasteful.  Please Aloha Eats, as a business that represents the great natural paradise of Hawaii, a place known for it's eco-friendly values, please stop using this detrimental stuff.<br><br>I have nothing but love for your food, your staff, and your space.  But please stop it with the wasteful packaging.<br><br>Cheers", "pics": null}}, {"review": {"des": "Awesome Hawaiian cuisine. I had dined in here before several years back when Spam was considered a delicacy. LOL. I had ordered the double chicken cutlet and grilled chicken. Delicious. I am glad they are still in business because alot of restaurants in Lincoln Park area is closing. This one stayed in the test of time. I even ordered Kim chee which is good too since alot of Koreans in Hawaii next to Japanese and Filipinos. I would come back here more often now.", "pics": null}}, {"review": {"des": "I crave this place regularly, being that I now live in South Florida. The  Chicken plate with Mac Salad is the absolute bomb. Don't forget some Spam Musubi for \"dessert\" ;)", "pics": null}}, {"review": {"des": "The amount of the food they give you at this place is...astounding. <br>Lunch is available all day long, and having not been to Hawaii myself, I can't tell whether or not it is truly authentic. Whether you eat in or take out, they'll put the food in a take out box and generally fill it to the brim. <br>The macaroni salad is just okay...it's mainly a mixture of macaroni and mayo with a tiny bit of salt and pepper. I ordered the BBQ chicken entree and the Loco Moco, both having an iconic kind of authentic label: The BBQ chicken tasted imo like the terriyaki chicken at Panda Express, and the loco moco tasted like a runny egg over 2 rounds of meatloaf over a bed of rice. A little disappointed at the entrees I ordered, but given the vast menu and the fact that I never ordered the Katsu PLUS the price and the quantity, I'd give this place 4 stars.<br><br>Wish there were more vegetables..the little side of raw cabbage and the seaweed around the spam matsubi don't count for much folic acid! I'll def have to come back for those mini portions of katsu, though.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/V-ZJAP7dyGG4NsJLb8Z16g/348s.jpg", "caption": "Lots of rice with a thin slice of spam on top... The ratios were a little off haha but still good"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PGvbhAqoPL6a_kaH35eerg/168s.jpg", "caption": "Tofu Katsu is pretty bad imo"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9sRwXKiPhv_TU_khYVKGmQ/168s.jpg", "caption": "So much pork in this entree"}]}}, {"review": {"des": "Your reliable and basic Hawaiian eatery! A good place to get big portions of food for a reasonable price. The staff are all great and super friendly. The shop itself is relatively small in size but enough to get a seat for a decent sized party depending on how packed it is at the time or for just picking up an order.<br><br>I had the BBQ Short Ribs. Its priced at market value, when I was there a plate cost me around $18. And again, it was good for about 2 ppl. Definitely worth it. The seasoning and flavoring was ON POINT. And the quality of the meat was fantastically soft and well cooked.<br><br>My friend had ordered the BBQ beef plate. The meat was cut into tiny pieces that aided in easy eating. The sauce was a good teriyaki mix between sweet and savory.<br><br>As for the sides, the macaroni salad was nice and creamy, they definitely know how to make it here. I like my macaroni salad more on the creamy and savory side as opposed to an added sweetness so this was right up my alley. The rice is a good solid, fluffy and just the right amount of soft.<br><br>Definitely recommend if you're looking for a more affordable but quality meal.", "pics": null}}, {"review": {"des": "I can only talk about the chicken katsu plate as I've never ordered anything else here. When I moved back to Chicago from California, I really missed this local Hawaiian food joint that served their chicken katsu for $5 a plate on a certain day. Boy was that a deal. The plates here, at Aloha Eats, will run you 10 bucks. It's still worth it, though!<br><br>Chicken Katsu - ~$10 - 4.5/5<br>They give a shit ton of chicken. Like borderline too much, and that's bad news cuz I keep eating 'til my food is gone. And it's crispy, warm, delish.. and just.. I can't not eat it, ya know? It also comes with two scoops of rice (stickier than regular, of course) and macaroni salad. I've had better macaroni salad (that place in Cali) but honestly just drizzle a bit of soy sauce over it and it's bomb diggity.. or maybe I'm just addicted to salty foods.<br><br>The place is run by a family, I'm sure of it. The dad cooks, the children take the orders? Or at least family members. I like the inside - it's charming. They have license plates and framed pictures all over. Oh! And apparently sell sriracha lollipops, though I haven't tried to buy one. <br><br>If you want something quick, filling, not particularly healthy, and yummy.. then I definitely recommend!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-KiPrZgw3oYtWIva-xE6DQ/348s.jpg", "caption": "Chicken katsu to go!"}]}}, {"review": {"des": "I am a big fan of this place, both for the food and the fair prices. The staff here are also very nice and polite and the to-go orders are prepared very quick. I've never been to Hawaii before but this place now makes me always crave Hawaiian food.<br><br>I really like the katsu here - it's always fried well and it just a big slab of meat. It's paired perfectly with the gravy over rice. The macaroni side salad is also unique. <br><br>In correct Hawaiian fashion, you must try the spam masubi. It's like literally nothing else - just imagine a huge sushi with the filling on the outside. The rice is a good stickiness level and who doesn't like spam! :)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9BXOXPaxNwGgy81gWsWk2Q/348s.jpg", "caption": "Spam musubi"}]}}, {"review": {"des": "When I saw there was a Hawaiian BBQ place nearby, I immediately set plans to grab some food. When I went to college in CA there was a Hawaiian BBQ place that had a great deal on chicken katsu every week, so naturally I ate it almost every week. Although Aloha Eats doesn't have the weekly deals, their food is just as good and filling. The place has a relaxed Hawaiian kind of feel, with a bunch of knick knacks and random postings on the walls. The space is pretty tight, so I would recommend ordering to go or dining in during the less busy hours.<br><br>The service here is always great, you really get the family business feel from the restaurant. They always seem to pop your order out within a couple minutes so if you're hungry you won't have to wait 20 minutes for your food. Honestly i haven't tried anything except the chicken katsu (it's just too good to pass), however they offer a bunch of unique plates such as fried shrimp, BBQ pork/chicken, and spam musubi (grilled spam, rice and nori).<br><br>Chicken Katsu 4/5: This plate is amazing when I'm in the mood to just gorge on something deep fried and delicious. The amount of food you get is actually ridiculous (the plate is probably enough for two people to share...but I never do). The chicken is breaded and crispy and they give you a huge pile of them. You can ask to get white meat for a bit more, but I prefer the juicy dark meat in this meal. The meat is loaded on top of steamed rice, and a side of macaroni salad. Although it isn't the most flavorful macaroni salad I've tasted, it's a good staple. The sauce on the side is delicious to dip the chicken in ( I personally add sriracha to it for an extra flavor kick). Overall the meal is a great portion and all under 10 dollars.<br><br>Although I haven't tried much at this place, I have no hesitation recommending people to come try their food. You will feel your worries and troubles disappear as you fill your belly with their comfort food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VA_dK6jqDCsXVSQqgLielw/348s.jpg", "caption": "Chicken katsu togo"}]}}, {"review": {"des": "This place is bomb. Where I live Hawaiian comfort food is hard to come by so when I was visiting the parents, I decided to swing by and it was the best decision I made all day. I ordered the spam musubi (2 per order) and a side of kimchee. The musubi was hot and freshly made and the kimchee was cold and refreshing. The place is dirt cheap. I left full and happy and only broke a 10 dollar bill. Service is order at the counter and seat yourself. It was full when I walked in and full when I left but there was heavy turnover. I'll definitely be back! Spam all day, spam all night!", "pics": null}}, {"review": {"des": "I didn't realize how much food I got with such an affordable price, and they are delicious. I have never been to HI so I can't judge it's authenticity, but it definitely made me want to go back for another round.", "pics": null}}, {"review": {"des": "Food itself was alright at best. Got the Mixed Grill Platter with the BBQ short ribs, grilled chicken, and teriyaki beef. <br><br>Honestly the teriyaki beef was pretty gross and inedible as it was super salty, oily, and had this really nasty sauce. Also, the beef was all diced up and burnt to the point where it looked like it was scraped off burnt scraps on the grill disposal. Do not get it!<br><br>The chicken katsu was decent, large portions that tasted alright with the katsu sauce. I think i'll go with the regular spam masubi next time as the katsu ones were a little too greasy. The grilled chicken and bbq short ribs weren't amazing, mediocre at best. It didnt really feel like they grilled it, more so pan fried it. <br><br>The macaroni salad and the rice was nice, thats about as much as I can honestly. <br><br>Overall the staff are super nice, small space with minimal seating, can get pretty dirty, subpar food", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/APJjfLtYaIqTVyGc8PWBTQ/348s.jpg", "caption": "The Mixed BBQ platter, Spam Katsu Masubi, and the Mixed Chicken Plate"}]}}, {"review": {"des": "The teriyaki beef is on the salty side, but paired with steamed white rice, shredded cabbage, and the creamy macaroni salad, everything balances out. <br><br>I'm not a huge fan of their chicken Katsu, though the sauce is <a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a>! The crispy level is a little too high on this one for me. Whenever I think it's a good idea to \"try it again\", I feel like I might chip a tooth. <br><br>Spam musubi is spam musubi. Always an excellent idea! Their spam to rice ratio has changed throughout the years. The spam getting thinner... the rice still phat.", "pics": null}}, {"review": {"des": "This place is SO GOOD. The portions are huge and comfy with really bang for your buck prices. I came here for the first time and got the Double Chicken and also ate a Spam Musubi. My two friends and I each got a helping of Double Chicken and Spam Musubi and as we sat by the window to \"people watch\" I think the people outside moreso were watching us as we feasted. The cashier low key I think was frightened by the amount of food we ordered, and that all of the three of us not very large humans finished EVERYTHING. 10/10 would do again and feel great about it. Best comfort food.", "pics": null}}, {"review": {"des": "small place, big flavors!<br><br>Everything is a little bit on the expensive side considering the atmosphere of the place, but everything is also delicious!<br><br>Especially love their teriyaki beef and chicken katsu! And if you love spam musubi, this is the place to go! They now also have vegan version as well as deep fried spam for extra flavors! We always like to call ahead and pick up in store!", "pics": null}}, {"review": {"des": "Mildly disappointed with the food I ordered. Chicken Katsu was all breading with old dry looking meat inside. BBQ beef was wayyyy too salty. I could barely eat it. I liked the macaroni salad but really nothing special. Spam Musubi didn't have much flavor. Maybe too much rice compared to Spam. Overall it was a bit disappointing.<br>I think the quality will continue to suffer if consumers praise restaurants for the portion of food you get vs the quality. Why would you want a plate of mediocre food?? Does it taste better when you have more of it?? Just don't get it.", "pics": null}}, {"review": {"des": "The original plan was to stop by Aloha Eats on our 2nd night in Chicago since it's in the same neighborhood as our AirBnB. We ended up stopping by on our 1st night as it started pouring shortly after sunset and we were both soaked. We wanted hot food and dry clothes ASAP! <br><br>I called in to place our order when we were 10 minutes away. They quoted us a 15 minute wait time, which turned out to be slightly less when I arrived. 2 lunch plates, 1 spam musubi, and 2 cans of POG put us at about $31, which isn't terrible for 2 people. I'd say I got my value's worth if it didn't cost $2.75 for a can of POG!! <br><br>The Loco Moco lunch plates were really delicious and super filling. I don't think either of us completely finished our plates. We ended up eating the spam musubi's the next day - they were still good but I think it had too much rice. Most spam musubi's in Hawaii so not have so much rice. <br><br>I enjoyed my meal from Aloha Eats and wish we had something like this in New York so I can satisfy my Hawaiian plate lunch cravings!", "pics": null}}, {"review": {"des": "Based on reviews from my friends, I am quite surprised that I didn't like this place more. Between a friend and I, we got a Chicken Katsu plate and Spam Musubi. As reviewed by many others here, portions are pretty huge and these two dishes can definitely fill up more than two stomachs. The chicken katsu was quite bland and dry, the meat separating from the batter, and even the dipping sauce didn't help. The spam was lightly fried and wonderfully flavored, but there was too much rice in proportion. I believe with more seasoning, the food could be elevated to a different level. Nonetheless, I'm pretty convinced that this is an authentic Hawaiian place as it is run by a Hawaiian family and the whole place gives off a super homey and mom-and-pop kind of vibe.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kDk5SqOCnBLCygbpQaVEaA/348s.jpg", "caption": "Chicken katsu lunch box and spam musubi"}]}}, {"review": {"des": "I ALWAYS order the mini chicken katsu, substitute the macaroni salad for fries, and purchase a side of their delicious curry . LOVEEE their curry. Their portion sizes are large and the food is always warm when served!<br><br>Would rate higher but sometimes I feel like the chicken isn't fully cooked. Otherwise, #yassss", "pics": null}}, {"review": {"des": "Mmmmm... This is the kind of counter service place I dream of while sequestered here in the St. Louis winter. I came here on days off to get boxes of delicious beef and shrimp, white rice, and mounds of that ever-present hawaiian staple, macaroni salad. Honest to god, they would get me in just for the macaroni salad. But beyond that, the prices on some things is a bit much for counter service, but the portions are plentiful. Beef bbq, spam musubi (yes it's spam, eat it anyway), shrimp, and chicken katsu are all super good. The neighborhood is really nice, and I love walking here in the summer. Go. Keep this place in business for me!", "pics": null}}, {"review": {"des": "Born and raised in Guam I always feel at home with Aloha Eats. Friendly staff and delicious (and reasonably priced) food!<br><br>Here are items I usually get:<br>- spam musubi (try the katsu one too!)<br>- chicken katsu plate<br>- Portuguese sausage plate !!!!!!! (My favorite - literally cannot find Portuguese sausage like this anywhere else. So sad)<br>- BBQ chicken plate <br>- BBQ beef plate <br>- BBQ spare ribs plate (this one is MP so I can be pricey, but really yummy if you want to splurge)<br>- shumai<br><br>The plates are good enough for 2 ppl so I usually order the mini plate.....heck, my boyfriend and I share a mini plate and it's enough food too!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Td8sw-Luo3vmXoY6LDcYww/348s.jpg", "caption": "This is the chicken katsu MINI plate! That's right....MINI!! So much food. It's like $7. I can never finish it on my own"}]}}, {"review": {"des": "Definitely worth stopping in here time and time again. Although it is a bit of a drive for me coming from the northside or Chicago, I'd say this place is unique in its own way than other eateries in Chicago. Big Hawaiian sized portions, the employees are friendly and overall good times. Stop in and you won't regret it", "pics": null}}, {"review": {"des": "It's hard to find some quality cheap eats comfort food involving rice in this city. Aloha Eats serves this exact purpose when I need just a little comfort on a lazy day! I typically get the Hawaiian mixed BBQ plate which gives you a little bit of everything! Hawaiian BBQ chicken, short ribs and beef. The best is definitely the chicken as it's tender and flavorful! Their mac salad is also as flavorful as can be, not just slathered in mayo but definitely has some good seasoning mixed in! <br><br>Check this place out and make sure you try the chicken in whichever combo you decide to get!", "pics": null}}, {"review": {"des": "I used to be stationed out in Hawaii in the Coast Guard, and I came to really liking island food. staples like loco moco, spam musubi, kalua pork, and chicken katsu are all really hard to find. <br><br>So when I moved to Chicago I was thrilled to find a place that has all the above, but also my simple addiction of Hawaiian mac salad and the Aloha Maid canned juices.", "pics": null}}, {"review": {"des": "My top craving during the week is Aloha. Cheap, delicious, authentic Hawaiian food in Chicago? It can't get better than that. <br>The portions are huge so I always tend to get the mini plates but if you're hungry, then the normal plates will be sure to fill you up. <br>The chicken katsu is my go-to and if you want to be adventurous, try substituting the katsu sauce for curry sauce. It is absolutely delicious. Another fan fave is the spam masubi so make sure to check that out. <br>The place can get packed and the seating is limited but luckily you can carry out or get it delivered!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mcFmP3OMTSmoZ7GeNk91iA/348s.jpg", "caption": "Mini chicken katsu and spam masubi. Substituted curry sauce for the katsu!"}]}}, {"review": {"des": "Great food! The home run for us was the spam katsu musubi. Would highly recommend this with some katsu sauce on the side to dip it in. I usually don't like macaroni salad, but theirs is very good! Service was also really good. Only thing I'd like to see is some veggies on the side to balance out all the meat from their entrees. Otherwise, I can't wait to be back in the area to eat here again!", "pics": null}}, {"review": {"des": "I love their macaroni salad. They have a great variety to choose from and everything I've tried has been amazing so far.", "pics": null}}, {"review": {"des": "Great authentic Hawaiian food! Love this place! Fast and great service. A little pricy at first but so worth it for the food and quantity", "pics": null}}, {"review": {"des": "A small place offering Hawaiian food. I had the Chicken Katsu combo with beef. Was it mind blowing? No. The chicken was a little over fried but I would give this place another try.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rysMWTiAlWjaI7le2Db-qw/348s.jpg", "caption": "Chicken katsu with beef combo"}]}}, {"review": {"des": "I have only ordered for take out here. The Spam musubi and BBQ beef are fan-freakin-tastic! The spam musubi has the perfect ratio and combination of spam to rice to terriyaki sauce. The macaroni salad that came with my BBQ plate was creamy.... I would be happy to eat that at every barbecue! The seasoning on the BBQ beef was my favorite part, because it was an awesome combo of savory and sweet. My only complaint is that it looked like I had a huge portion of meat, but once I started digging around I found that there was a hefty layer of cabbage underneath the meat. Still a nice portion though.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vuEJy_TQSsUGFJHvIOEYew/348s.jpg", "caption": "The small BBQ Beef plate and Spam musubi from Aloha Eats had me in the most wonderful food coma"}]}}, {"review": {"des": "Authentic Hawaiian food in Chicago was such a find! I love the neighbourhood for being full of hidden treasures and one of the big reasons I'm sad I recently moved away is because I will no longer be walking distance from this place!<br><br>Generous portions and a great place for sunny comfort food in the winter or to drop in for a snack in the summer with friends :)<br><br>I love the spam katsu matsubis YUM even if I get something else I usually grab an order of them to eat later because I can't resist!", "pics": null}}, {"review": {"des": "i came here the other day with my boyfriend. We ordered the pork katsu lunch, an order of the spam musubis, and a hawaii imported canned drink. The total came out to be about $20. <br><br>Pork Katsu- comes with rice, macaroni salad, very generous portion of pork katsu, and sauce. Although it was a lot of food, I would say pass on this. The breading was very thick and it was all we could taste. <br><br>Spam Musubi- you get two per order. It was exactly what i expected and I was very pleased. <br><br>While portions were generous, I was a bit disappointed in the food. It wasnt anything special. Maybe I didnt order the right things, so I'm planning to try some other items on the menu next time.", "pics": null}}, {"review": {"des": "Tips:<br><br>~$6 Spam Musubi only comes in 2<br>~$6 Chicken Katsu mini plate (chicken katsu, rice, macaroni salad)<br><br>------------------------------------------------------------------------------------------------------<br><br>I've been craving Hawaiian food for a while now and I was so glad to have found Aloha Eats.<br><br>Chicken Katsu: Taste is great and the portion in the mini plate is HUGE. They give you a ton of chicken katsu in that tiny square to-go box. It ended up being 2 meals for me. The katsu has a great crunch and the katsu sauce tastes great as well. There is almost a 1-to-1 ratio of breading to actual chicken meat, just be warned, but it tastes great!<br><br>Macaroni Salad: Just as you'd imagine in any Hawaiian food place. The best part of hawaiian food in my opinion.<br><br>Spam Musubi: Classic tasty spam musubi!", "pics": null}}, {"review": {"des": "I literally could not ask for more in a cheap eats restaurant. This place is family run, counter service, delicious Hawaiian food. If you've never had the pleasure of enjoying chicken katzu, spam masubi, or loco moco, please bring yourself here ASAP. Order anything on the menu, but warning, even the mini plates are MORE than enough for a full meal. The loco moco (a yolky egg on top of a beef patty and rice) is addicting, and the chicken katzu is perfectly fried with delicious sweet and tart dipping sauce. A side order of spam masubi will give you two delicious rolls, both wrapped up if you want to save them for later. Everything comes with macaroni salad, and if you thought macaroni salad was a boring picnic dish, you are so wrong. I don't come here nearly often enough!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BgAYsfdlXWDlDmfsHr3vfg/168s.jpg", "caption": "Yum"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BB-QqdJ0Dnb5fPysflj3Hw/168s.jpg", "caption": "Enough for 3 to eat 2 meals! 2 orders of chicken katsu (one mini, one huge normal), 2 orders of spam masubi, and one loco moco!"}]}}, {"review": {"des": "Fantastic plate lunch food!! The closest you can get to authentic Hawaiian food outside the islands. Considering you're in Chicago, this is a must visit if you're in the area!! Plates are giant!! So keep that in mind when ordering. The \"mini\" lunches are plenty for one person. <br><br>Ignore the 1-3 star reviews on here! They don't know what they're talking about! Service was excellent, food was amazing, and I will definitely be coming back in as much as possible!! Mahalo!", "pics": null}}, {"review": {"des": "I have tried the kalua pork, mini loco (bunless burger with egg, rice, gravy), spam musubi, and combination platter (bbq beef, pork, & chicken).<br><br>- The kalua pork is served with a lot of steamed cabbage. The pork and cabbage are largely flavorless, as another review has mentioned. Normally, bland is a bad thing, but I don't mind it too much in this dish. I add soy and a spicy sauce for flavor. I think the cabbage saves this dish. It adds texture and moisture. <br>- The mini loco was still very large. <br>- The spam musubi is decent. I like mine better.<br>- The BBQ sauce was too strong. It just wasn't good BBQ. For BBQ, go to Hecky's up north. <br><br>Be prepared for extremely slow wait times! I usually place my order, walk over to Starbucks and Molly's Cupcakes, go back, wait a little more... then it's ready lol.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lMuxhymPUcWmIyhtMTHbLg/168s.jpg", "caption": "Kalua Pork. add soy sauce. great"}]}}, {"review": {"des": "Walking into this establishment you will find a very small space, with 6 tables, that will sit 18 people comfortably. I ordered the Mini Plate of Chicken Katsu, which comes with white rice and a side of macaroni salad. Total cost was just over 7.00....not bad! <br>Service was friendly enough, received the food in a timely manner. When I got my order, I noticed everything was piled on top of each other, making this a bit unappetizing, and making the Mac salad warm, which I did not care for. I would have personally preferred an actual plate, since I was eating in. <br>The soda machine had out of order all over it, only offering water, which is fine, however even the ice was out...not good, so I was drinking warm water. Portion size was good, just wish it would have been presented better. <br>I would be willing to come back, but I know what I would be getting...", "pics": null}}, {"review": {"des": "Legit. Authentic Hawaiian, the prices are reasonable, the portions large, and the taste out of this world.", "pics": null}}, {"review": {"des": "Aloha Eats has been fulfilling my Hawaiian food cravings for almost a decade now. Even though I moved out of the neighborhood, I still want to go back all the time. I'm glad they haven't changed. Great service, family owned, bare bones, small place, nothing wrong with that.<br><br>Just recently devoured spam musibi, tofu katsu, and BBQ Beef. Their Shortribs are market price now and have significantly increased, but I don't blame a restaurant for adapting to their supply markets.<br><br>Still, anything on their menu is great and the prices in general are reasonable. As I write this, I am salivating for more.", "pics": null}}, {"review": {"des": "I'm not too sure why it has taken me so long to write a review about Aloha Eats. Perhaps I want to keep it a hidden treasure. But alas, I think the world needs to know the greatness of this tiny eatery.<br><br>Being born and raised in Hawai'i myself, I definitely know good plate lunches when I see one. A plate lunch, is a traditional fare found commonly at Hawai'i restaurants that comes with two scoops of rice, mac salad, and a whopping side of meat. Aloha Eats provides plate lunches at a reasonable cost with my favorite being the chicken katsu--moist chicken battered and deep fried in egg and panko crusting. I think it may even be better than L&L Drive Inn! They also sell spam musubi, saimin, and other goodies. I only wish they served poke bowls.<br><br>Aloha Eats is my go-to place whenever I'm craving local eats from Hawai'i.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gUvrSKpRJkJ_oCIxpk-l9Q/348s.jpg", "caption": "Mini bbq chicken and mini chicken katsu...all mac salad"}]}}, {"review": {"des": "Very Hawaiian nostalgic with all the basic plate lunches you'd imagine off one of the food trucks or diners in Hawaii.  They offer a smaller option of the loco moco which satisfied me 100%. All the staples of that dish - 1 scoop rice, scoop mac salad, beef patty, brown gravy and sunny side up egg. Served up in classic Hawaiian style styrofoam containers, but that's just how they do.  The patty was maybe slightly overcooked, and def needed some salt and maybe a little more seasoning in the gravy.  Decent for what I was in the mood for.  Had the Aloha Brand POG (Passion Orange Guava), I much prefer the Hawaiian sun over the Aloha made which is a bit watered down.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qXJSGZ5Uod2upPQkNtSrgg/348s.jpg", "caption": "Loco Moco"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QPne93tr5c4x7qPvRFMlKA/168s.jpg", "caption": "Cute license plates decor"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/v_lbvpfJyhHf9IkPAmbjOw/168s.jpg", "caption": "Signage"}]}}, {"review": {"des": "I'm severely disappointed. If you have a huge delivery order, you should know your kitchen is backed up. Especially after 10 years in service. We waited 30 minutes, was never told why we were waiting so long, and then someone who ordered after us got their food before us. <br><br>If I knew of another place to get plate lunch, I probably wouldn't give Aloha Eats another chance.", "pics": null}}, {"review": {"des": "My go-to place for authentic Hawaiian fast food! I grew up eating Rainbow Drive-In plates and I am so glad to have found a Hawaiian spot in Chicago. My favorites are the loco mocos and the chicken katsu + bbq beef plates!", "pics": null}}, {"review": {"des": "3.5 stars. Came here on a weekend and there were a decent amount of people already there. Room for maybe a little more than 20 to sit, but felt cramped. Food comes out in to-go box and it comes with a lot! Ordered the Chicken Katsu which was about 10 bucks and it was overflowing! Base was covered with rice and the katsu on top. On the side there was macaroni salad, which was meh to me. The chicken was a tad dry and the outside was too crispy for my liking.", "pics": null}}, {"review": {"des": "I haven't been to Aloha Eats in years and I recently found out that the memory of the food is better than the actual thing. I used to come here a lot in the past and I even remember craving Aloha Eats. I'm not sure if the food has changed or if this is a real case of memory bias, but I wasn't as wow-ed with my meal.<br><br>I got the combination katsu chicken and bbq chicken plate. It comes with the two sides of meats, macaroni salad, and two scoops of rice. The highlight is definitely still the katsu sauce which I really continue to enjoy. The katsu is a lot more breading than chicken from what I remember. The bbq chicken was good but it tasted like teriyaki chicken and did not compare with other bbq chicken that has been smoked or grilled. The macaroni salad is still good, though.<br><br>The Hawaiian food scene is absolutely getting bigger in Chicago and competition is getting tougher. Aloha Eats is always a solid choice, but I might try some of the other competition next time.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fz8vS-8mLLNlgut90mwJ1A/348s.jpg", "caption": "Chicken katsu and grilled chicken combo."}]}}, {"review": {"des": "I tried this place because the concept of Hawaiian food excites me. I only gave 4 stars because they served on Styrofoam with plastic forks. I had Kalua pork. The place has survived for 13 years so far so I expected good food.  The dish was basically Hawaiian style pulled pork. It was not spicy like contiguous states pulled pork. It was smoky and had a nice sedate flavor. It was served with Hawaiian  a cabbage dish and a mac dish. The pork was very good but the cabbage was better. It was earthy and not highly spiced. They had hat sauces that I could have used but I wanted the basic flavor. It was well worth the visit. Try it and let me know.", "pics": null}}, {"review": {"des": "Just came back again, and it was absolutely amazing (Even better than the first time). I believe this is one of the best Hawaiian food places in Chicago hands down! <br><br>Normal order: Chicken Katsu with dark meat (they have pretty big servings)", "pics": null}}, {"review": {"des": "I love Aloha Eats. They've got all of the classic dishes you can find in Hawaii. They carry Aloha Maid and Hawaiian Sun too!<br>The prices are very affordable and portions are big. The Mac salad is similar to what you'd find on the islands.<br>There is limited seating and no restroom (Starbucks across the street). It's more of a grab and go place.<br>It's worth checking out!", "pics": null}}, {"review": {"des": "Yummy ono grindz!! Have been craving Hawaiian ever since I moved from Seattle to Boston and Aloha Eats hit the spot. Enjoyed the mini (not-so-mini) Katsu plate and had to get the spam musubi - nom! Really good mac salad on the Katsu plate which came with a generous portion of meat. Would love to get the loco moco next time. Family-owned serving authentic Hawaiian since 2004. Stop by for tasty cheap eats and friendly staff!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nm_9tgrOHD44Ut9f_usYCg/348s.jpg", "caption": "Mini katsu plate"}]}}, {"review": {"des": "Absolutely loved this place. Portions are enormous and the prices are absolutely as good as you can find for that level of quality. I got a small plate and I couldn't even finish it (and trust me, I love meat and rice). Definitely as close to Hawaii as you can get here in Chicago. I strongly recommend this place. Certainly not fancy, but you won't be disappointed.", "pics": null}}, {"review": {"des": "I was in the mood for some Hawaiian food and we came across this place. We ordered the Chicken Katsu and beef bbq combo plate, Katsu spam masubi, and a mini loco moco. Their portions are very generous. Each meal came with a side of rice and macaroni salad. I was a bit sad when I tried the Mac salad, only because I was expecting it to be a bit sweet. But as far as everything else, it was super yummy. The Chicken Katsu wasn't dry like all the other ones I've had before. And the beef is seasoned so nicely. The spam masubi was massive and it came with two of them! The loco moco was perfect  just wish I had my egg a little bit crispier on the edges, but that's personal preference. Overall, great food!!!", "pics": null}}, {"review": {"des": "Love this place!  If I am anywhere near the Lakeview/Lincoln Park area I usually stop by.  Favorites are the Chicken Katsu (Katsu sauce is amazing), Hawaiian BBQ Chicken, and BBQ Beef.  Combination Plates are my go-to because you get multiple items, and you might end up with some tasty leftovers :)", "pics": null}}, {"review": {"des": "One of my favorite restaurants located up north of Chicago! It is relatively close to mollys cupcakes as well. <br><br>My fav food to order here are the spam musubi! even though these can be made at home, their rice, sauce, and spam tastes a lot better than home cooked and it is fresh to serve! They also have other Hawaiian / American food to serve such as the chicken katsu (which is breaded chicken, fried) hamburgers, imported Soda's from Hawaii, fries, etc; <br><br>The place itself is very chill. You can definitely feel the Hawaiian culture inside the restaurant.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OAOp3uJcr9b5CfmixWA8Cw/348s.jpg", "caption": "Oops. Took a bite before realizing I forgot to take a photo"}]}}, {"review": {"des": "It's was aiiite...I was really excited about this place and it kind of fell short of expectations. Every hawaiian BBQ place I've ever been to has left me with a picture of crazy-full styrofoam platters and yummy sauces. This place had neither. The price point was a little higher than I am used to, which was kind of expected considering this place had no competition. But their sauces cost extra? which was kind of unheard of for me at a Hawaiian BBQ place..normally the teriyaki/bbq and katsu sauces are free flowing!<br><br>That all being said, their spam masubi and BBQ chicken were quite good. What was disappointing was that there was only one piece of short ribs in the combo platter I got...<br><br>Would I be back? Probably? Hell, they have no other competition in the city.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FzOhBT3ca2S1dO1tzLsBeg/348s.jpg", "caption": "Combination platter and spam masubi"}]}}, {"review": {"des": "BBQ short ribs are my go to here, it is solid! My most favorite item here has to be their macaroni salad, they make the best! Prices are reasonable and staff are always  friendly. Definitely one of my favorite restaurant in Chicago.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MPSE5wIU3dc3ztdU9RFyCg/348s.jpg", "caption": "Spam loco"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tnSIGqeT1RPMc5XlzGe_Wg/168s.jpg", "caption": "BBQ mixed plate"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/W7VIPNi9AHqHOjrYMn33mQ/168s.jpg", "caption": "Double chicken plate"}]}}, {"review": {"des": "Had the loco moco... <br>It just tasted too bland for me. <br>Portions are huge! <br>I wish hey had more combo variations...", "pics": null}}, {"review": {"des": "I have dreams about the Tofu Katsu plate lunch frequently. Aloha Eats is one of the best parts of Chicago, and I miss it dearly (I moved away!) Anytime I come back to visit, it is a MUST EAT. Not only if the food phenomenal, the service is amazing too. Next time you're looking for a delicious lunch, and want to support a family-owned business, hit up Aloha Eats! Pro-tip: order a POG with your meal!", "pics": null}}, {"review": {"des": "I am a recent transplant to Chicago from Hawaii where I was born and raised so naturally I was stoked to find out there was a Hawaiian plate lunch place near me. Eating here brings me back home every time. Seriously, broke da mouth! Truly as close as it gets to a plate lunch from L&L or Loco Moco Drive Inn (man, I miss those places!). I recommend everything, especially the chicken katsu, bbq chicken, kalua pork, curry katsu, and bbq short ribs. I haven't tried their spam musubi because I make it all the time myself, but I will next time I'm there. Don't bother going to any other place for a Hawaiian style plate lunch; this is the only place to go! Thanks guys for keeping the Aloha spirit alive and well in Chicago.", "pics": null}}, {"review": {"des": "Aloha Eats is my home away from home! Ono eats and it's the real deal here! For anyone missing Hawai'i grinds this is the place to get your fix! I always feel welcomed here and the food is amazing. Big portions and great prices. It's nice to see Hawai'i food in Chicago. I always come here everytime I get homesick!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uFcDGAsBcKTi405XItfEMg/348s.jpg", "caption": "Portagee suasage, eggs, & rice plate. Legit."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GVHUh6U5cUq6PdpDiRCQzg/168s.jpg", "caption": "Spam Katsu Musubi. Order comes w/two of em."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Qi1OOLK2W168o6vaqs-XSA/168s.jpg", "caption": "Tofu Katsu plate. Bigger portion."}]}}, {"review": {"des": "We were so excited to try this place. We are from the West Coast and have eaten at a lot of Hawaiian style restaurants. We ordered over the phone for delivery. The Chicken Katsu was good but the curry was too tangy. The macaroni salad was tasty. My Grilled Salmon was way overcooked and they served it with tartar sauce. Fish, in general, should not be as dry as this Salmon was. I had to eat the Chicken Katsu. If your looking for authentic Hawaiian food I wouldn't go here :(", "pics": null}}, {"review": {"des": "When I moved to my apartment, I thought the best thing about it was its proximity to Molly's Cupcakes. It turns out I was wrong. <br><br>Enter Aloha Eats. <br><br>This unassuming Hawaiian fast food joint has the feel of a Hole in the Wall mixed with a surf shack. The place is littered with newsclippings of former President Barack Obama, pictures of Spam, and old timey Hawaii travel ads. Honestly, it's heaven. <br><br>On to the eats part. If it's your first time here, get the Chicken Katsu plate. Do it. Warm crisp chicken piled on top of white rice and macaroni. Mmmmm. Oh yeah, the white rice and macaroni? Don't knock it til you try it. From my experience bringing my friends, it's hit or miss. But for me, it's a big hit. <br><br>The portion sizes here are HUGE. Luckily, you can also get a Mini Chicken Katsu plate. And even then, sometimes I find I have far more than enough. <br><br>While you're here, you might as well get the spam musubi. What's musubi? Well, per Wikipedia research: \"Musubi\" is a popular snack and lunch food in Hawaii composed of a slice of grilled spam on top of a block of rice, wrapped together with nori (seaweed).<br><br>I've overheard conversations between supposed \"foodies\" in the restaurant scoffing at musubi. I don't get it. Is it not refined enough for your palate? Scared the spam will make you lose Instagram followers? Again, try the musubi. <br><br>Overall, Aloha Eats is the closest you'll get to an \"authentic\" Hawaiian experience save for digging a hole in the ground and throwing in a pig. Go try it now!", "pics": null}}, {"review": {"des": "Aloha to me and these big portions! Fantastic Hawaiian here in Chitown.<br><br>I grew up eating katsu from my parents making them, to ordering a large tray in from our local Chinese restaurant during family gatherings. There is something about a nice fried piece of chicken cutlet that just gets the job done, and that's one of the best items here at Aloha.<br><br>I ordered a mini chicken katsu box ($7) along with fried spam musubi ($5). Yep, you heard me, FRIED SPAM. While it was supposed to be mini, the chicken katsu came out to be a lot of food for just one meal. The battered chicken in panko flakes was fried nicely- not too heavy or burnt where you could no longer taste the meat. The macaroni salad was very creamy but not overpowering, making it a great side.<br><br>As for the musubi, that in itself was a meal. I can't say that it was that different from a regular spam musubi, so I'd save the extra calories and go with the basics. Never had spam before? Now would be the perfect time to try it.<br><br>Only negative thing I'd say is that they were a bit stingy with their katsu sauce. They only include it if you order some kind of katsu, and will charge you $1 for more (esp those that want the sauce but didn't order anything fried). Usually stores offer these up for free, but oh well... minor detail in an overall great lunch.<br><br>Keep doing your thing Aloha!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vZEMOHg43ZjfMeitLAe1hQ/168s.jpg", "caption": "Mini chicken katsu w/ macaroni salad and peas/carrots"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QgxBkdcV7bKTie_5ZS6bXw/168s.jpg", "caption": "Spam katsu musubi"}]}}, {"review": {"des": "Growing up in Hawaii and moving to Illinois has made me miss a lot of things. Most of those things are food. I love going to Aloha Eats because it always cures my homesickness! It's the typical plate lunch fare (kalbi, katsu, bbq chicken, etc) that you would find at L&L or another similar restaurant, but Aloha Eats does it right! Every time I get the bbq chicken it's never dry and it's just sweet enough for my tastes. Their katsu is also pretty good as well! I think their musubi has a little bit too much rice, but I like to order them as well and have them for a snack later in the day.<br><br>If you're in the area and looking for quick meal with a lot of food at a low price, this is the place to go. One of the mini plates is more than enough to satisfy. If I get a combination plate, it's definitely enough for two meals.<br><br>If this is your first time eating a plate lunch, I would definitely recommend either the Hawaiian BBQ Mix Plate or the Loco Moco! Also you have to go with the original 'two scoop rice, one scoop mac salad' for your sides if you want a really authentic experience!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JKNUFuObAQRxU-3lDHGCBg/348s.jpg", "caption": "various plate lunches"}]}}, {"review": {"des": "This place was amazing everything was great, but the bulgogi was a little too sweet, they also need a bathroom for the customers. But if they can do that, I would take the hour-long commute everyday just to eat here,", "pics": null}}, {"review": {"des": "My boyfriend and I were walking down Clark Street, trying to figure out what to eat. I didn't feel that hungry and saw that Aloha Eats had deep friend shu mai which sounded good at the time. 7 pieces for $4 something cents wasn't too bad. <br><br>We also got a scoop of macaroni salad. The shu mai came out freshly fried and piping hot. They were on the smaller side but were filling. The boyfriend really liked the macaroni salad too.<br><br>They had a soda machine where I was able to refill my waterbottle, always a plus.<br><br>Friendly service and authentic Hawaiian food.", "pics": null}}, {"review": {"des": "The food here is really tasty, and very very unique! Upon initial glance, it seems like spam just tied to a block of rice. However, it's definitely worth trying if you're curious about authentic Hawaiian cuisine", "pics": null}}, {"review": {"des": "This was my first food stop for my vacation. I was craving something really homey so this was my top pick for the day. It's a very small restaurant but packs a large menu. My boyfriend and I shared an order of the curry chicken katsu and katsu spam musubi. All very delicious! The katsu spam was something that was different and was what caught my attention to this restaurant initially.  It was very good, although the rice didn't stick together as nicely. The curry katsu was really good, but the curry itself was slightly salty. I really loved this place - even with the minor flaws! It's makes for a very quick and easy meal.", "pics": null}}, {"review": {"des": "I love this place so much. The macaroni salad is always delicious and they quickly whip out your Hawaiian faves. I love the spam musubi, the chicken katsu and the salmon dishes. The small plates are generous portions! <br><br>To top it off, the workers are always so welcoming and friendly.", "pics": null}}, {"review": {"des": "I heart this place. Comfort food at its finest. Chicken katsu is decent though their beef BBQ is probably where its at", "pics": null}}, {"review": {"des": "Great portions and delicious food for a really good price! The spam musubi has more than enough rice (seriously, why is there so much rice?) and Aloha has the perfect menu - not extensive, but just what you need.<br><br>Maybe I'm just indecisive and need menus like this.<br><br>Yeah.<br><br>Anyway, eat here. They make your food to order!", "pics": null}}, {"review": {"des": "Only place to get chicken katsu, spamasubi and Hawaiian macaroni salsad in the city. Coming from the Bay Area, I was ecstatic to find aloha eats. Can't go wrong with anything on menu. Always a staple in my diet!", "pics": null}}, {"review": {"des": "The pork tonkatsu, though employing light gravy rather than tonkatsu sauce like it's traditional Japanese, was quite authentic. What really stood out though, was the helping could easily have fed three people, or a Japanese family of 7.", "pics": null}}, {"review": {"des": "I have always heard of Aloha Eats, but coming from the South Side would have been a trip that I was not sure if it would be worth it. Conveniently, I was in the neighborhood after work at my new job, so I thought when else would be a better opportunity? The store itself is quite cozy and very Hawaiian themed. I ordered the one thing all my friends raved about: the Chicken Katsu. The regular order came up to just a little over $10. However, the portion was massive! It came with two scoops of rice and a scoop of the macaroni salad. The macaroni salad was just okay, nothing special. On the flip side, the Chicken Katsu was extremely crispy which was a good and bad thing. The inside of the Chicken Katsu was a little dry from being overcooked and tasted very greasy, even for deep frying standards.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/z728sxBwlGAfMho_dJ52PQ/348s.jpg", "caption": "Chicken Katsu Plate"}]}}, {"review": {"des": "I have been to Hawaii quite a few times.  Just lucky, I guess.  It's an amazing place.  In part because the food is amazing.  Often, traditional Hawaiian food is simple fare, with significant Asian influences.  But Hawaiian food is neither Asian nor American nor really anything else you can quite describe.  It's a mix of many different cultures of food, but then it is unique as well.<br><br>Aloha Eats is amazingly authentic.  Amazingly.  Steamed white rice with every meal.  Chicken and pork.  Vegetables.  Simple but rich flavors.  And plenty of it.  Enough fuel to get you out there surfing or snorkeling or whatever it is you're doing.<br><br>In addition to it's authenticity, Aloha Eats is a perfect example of the spirit of aloha.  The staff is friendly and helpful and full of good vibes.  Mahalo, Aloha Eats.  Please go BYOB!", "pics": null}}, {"review": {"des": "My first time trying Hawaiian food. Did not meet my expectations. Flavors were mediocre.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NtDYUYaBS7Xv5qdSZpXeRw/348s.jpg", "caption": "Loco moco and spam musubi."}]}}, {"review": {"des": "This is one of my favorite places in Chicago. After a recent visit to Hawaii, we realized having Aloha Eats within walking distance is absolutely fantastic. Don't expect fancy as Aloha serves delicious authentic Hawaiian plate lunch in traditional Styrofoam containers. The BBQ chicken and BBQ beef pair perfectly with scoops of sticky white rice and Hawaiian mac salad. The beef short ribs have just the right amount of chew and are bursting with flavor. Pork katsu is tasty with the katsu sauce, but elevated to supreme level with the curry sauce. Finally, the SPAM loco moco with brown sauce keeps me coming back time and again. Most dishes are so large that they will keep for two meals. To avoid food coma at lunch time, I'll typically go with one of their mini-plates.", "pics": null}}, {"review": {"des": "Coming to Chicago I was excited for deep dish pizza, Italian beef, and Chicago dogs. Never would I have thought I'd be eating chicken katsu...Which I can get plentifully back in Hawaii. <br><br>But then I stumbled upon this place when walking through the neighborhood, and I was shocked! I didn't think there were Hawaii plate lunches in Chicago, and I had an itch to check this place out to see how authentic it is. <br><br>Price wise it's already cheaper than Zippy's and about the same as places on the island, But the biggest difference is portion size... It's HUGE! Cleaning a plate is easy, but with this I still had leftovers - and I was starving too. <br>Everything was delicious and authentic from the katsu, to the sauce, and even the Mac salad. <br><br>Solid joint if you're craving, or curious to try some Hawaii local food. I can honestly say the food here is better than in Hawaii - especially the bang for your buck, Hawaii's f'in expensive man!", "pics": null}}, {"review": {"des": "This place is money in the yummy in the tummy.  Chicken Katsu, yes please!  Lots of food for the price, yes please!  I don't know why this place isn't busier.<br><br>I go out of my way to come here once a month.", "pics": null}}, {"review": {"des": "Since I've only been once I'll likely update this  later (I don't think one time visits are fair to establishments) but I couldn't help but want to share my instant love of this place. <br><br>There's only one person who works the cash register as well as the ever busy to go order calls. She's honestly a saint for maintaining her calm during the rush I walked in upon, and I found her quite friendly considering how much she was juggling (honestly I was in admiration)!<br><br>Had the spam katsu musubi to go to crunch a craving of nostalgia and comfort (for the cheap to!). For those that like crunchy contrasting soft rice, salty contrasting the balance of plain rice and umami notes in soy sauce I recommend it if you've never had it before. It's definitely a comfort food/snack so if you're looking to it as a meal stock up!", "pics": null}}, {"review": {"des": "really awesome, cheap eats! super affordable, HUGE portions, always good.", "pics": null}}, {"review": {"des": "Food was pretty good. Just disappointed in the price. A kalbi (short rib) plate in Hawaii is only about $13 not almost $20 (their market price), price is ridiculous for that. And why is there a market price for the Aloha Maid juice? The prices for other food was decent though. Too bad this is the only place where I can get local food for now.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EhoZTJglbFU7XeLnzPBB4w/348s.jpg", "caption": "Kalbi (Short rib) & Loco moco plate."}]}}]}