{"name": "artopolis-chicago", "reviews": [{"review": {"des": "If I lived in Chicago, I'd go back! This was the perfect little stop after the Bulls game. My friends and I decided we wanted some sweets and coffee to top of the night. I went with the chai tea latte. I've never had one as good as this one. Fair warning though, it is sweet so if that's not your thing, then try one of the coffees. They're just as good.<br><br>Between the 3 of us, we split 3 desserts; the espresso tart, baklava square, and loukoumades. The baklava was my favorite of the 3 but I would get all 3 again. The espresso tart balanced out the 2 honey pastries. <br><br>Highly recommend this place!", "pics": null}}, {"review": {"des": "Came here with a group for drinks/snacks, and it was pretty good.  The ambiance is cute, though doesn't feel overwhelmingly 'Greek.'  They've got table service, a bakery area, a little wine shop, and some other areas, so it feels perhaps a bit like an identity crisis.  Somehow it works, though.<br><br>We ordered some wine (delicious, though my sweet red was reallllllly sweet), and some coffees/cappuccinos.  We also got some appetizers, the pomme frites were good, as was the saganaki kebob.  The baklava was flaky and delicious, as one would expect.<br><br>Pricing was decent, but the server was just okay.  It took a while when we first got there to get our order taken-our server kept bringing menus, table settings, glasses, etc. to the table, but not taking our order.  We had to stop her one time as she was walking away to take our order.  It wasn't horrible, but it did tend to make the night drag on a bit.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JfjOVeIZSt1AnIH7lnoDyw/348s.jpg", "caption": "Saganaki curds"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sXMV0pEtwV8yNahnvCv2nw/168s.jpg", "caption": "Cheese plate"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eXmJPFxhUwO0NmV5cZL_2w/168s.jpg", "caption": "Baklava"}]}}, {"review": {"des": "The food is always amazing and the servers are so happy and welcoming. Every time I have friends and family visiting from out of town I always bring them here because I am never disappointed.<br><br>The waiters are always very attentive and are very knowledgable of the menu and dishes. I never have to flag them down for a refill or for the check.<br><br>As for food I would highly recommend the traditional soup and chicken riganati! They always cook it to perfection and the sauce compliments the chicken and veggies it comes with. The traditional soup (lemon, rice, and chicken) is so flavorful. Everyone who tries it loves it!<br><br>And for dessert you cannot go wrong with the Valhora (idk how to spell it?) chocolate moose cake. There are two layers of the cake (dark chocolate and milk chocolate) and it melts in your mouth. It small so it seems to be made for a single person.<br><br>I love this restaurant so much and I would highly recommend it.", "pics": null}}, {"review": {"des": "Do you ever want to be whisked away to another place.  Artopolis has two-story seating in a open air area.  Service begins around 5pm so if you want to sit during the day you must go to the bar area and order.<br><br>There is a menu with a number of tasty and authentically european desserts. You cannot go wrong with anything you choose.<br><br>Coffee drinks are warm or iced.  Whatever you drink choice is...they can make it and are very accommodating. <br><br>Bike parking is on the street.  <br><br>Don't miss this place.  It is a relaxing place that you can go simply for coffee and a dessert accompaniment OR have a full dinner.<br><br>You can't go wrong with Artopolis!", "pics": null}}, {"review": {"des": "I am addicted to cakes! 100% sweet tooth!<br>My roommate bought me a Tiramisu once, but I don't know where she bought. Today is Greek festival, she recommended me and said that it is the one.Tiramisu is the best! But I recommend some Greek cakes. You can choose sweet or salty, according to your own favor!", "pics": null}}, {"review": {"des": "If you are looking for a nice spot to chill and have a coffee or dessert this is the place! I had gone there for dinner not knowing there wasn't much of a selection for food. The orzo pasta was great, their potatoes are beyond amazing also and their mozzarella is very fresh! Our waiter wasn't so friendly but overall it was a nice place to sit down and eat some good Greek food!", "pics": null}}, {"review": {"des": "Artopolis has stood the test of time. <br><br>Phenomenal yogurt mousse cakes ranging from mango, coconut, raspberry or whatever else they have are fruity and light. Each component of the dessert - the vanilla cake base, the fluffy, aromatic fruit mousse and up to the top the gelatin top is just a delight that works together so beautifully.<br><br>Chocolate Symphony cakes target the chocoholics in their rich and dark flavor. Similar to the mousse cake, it's structure composes of a chocolate cake base layer, chocolate mousse and then covered in a chocolate ganache. Super smooth and everything you want in a chocolate dessert. I've had cakes all over the Chicagoland area and it's quite difficult find a place that does all these things extraordinarily well. <br><br>And to complete, the fruit tart. Many times, the fruit is covered in a sweet glaze in times where the fruit isn't in season. I was expecting something sour, but each piece of fruit I ate was ripe and fragrant - all of them. Good, firm crust and pastry cream rounds it off. Delicious!<br><br>There were times that a group of us after dinner are looking to make a last stop for something sweet and Artopolis is open late! I came here around Friday 9:30pm and there were still plenty of cakes to go around and the perfect size for a treat any time of day.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xZuYF_ja53vinhjlexwTDw/348s.jpg", "caption": "Cross section: Symphony, Mango, Fruit Tart"}]}}, {"review": {"des": "Burt Lancaster once noted, \"I judge a restaurant by the bread and the coffee.\"  <br><br>\"Artopolis\" is derived from \"Artos\" meaning 'bread\" and \"Polis\", meaning town: Breadtown.  Their goal was to create a relaxed, community atmosphere that would evoke the spirit of enjoying artisan delights within a quaint, European cafe.  I'm not the first to note this in a review, and am certainly no expert on the cafes of Europe, but I do confess, lingering here does feel as if you've been transported a bit outside of bustling Chicago. <br><br>Whenever visiting Greektown, I lollygag along lively sidewalks & complete my journey here for good coffee, and great conversation. Largely, the draw is ambiance. Not all, but many Mediterranean & European baked goods are not as sweet as traditional, 'American' treats, particularly chocolate, tortes & cheesecake; such reflection is present in reviews for specialty establishments far and wide. I find this variation on the sweet spectrum most welcome. <br>Alas,  if you're not up to testing the waters, I recommend a Martini with a hunk of hearty, fresh bread or a Latte & a few, mouth-watering Melomakarona for those drawn to the sweeter side of pastry.  They've a variety of breakfast options, & a few tasty, hot lunch/dinner dishes to peruse if you please. The Spanakopita comes to mind if you're fond of flaky layers of crust mingling with gloriously-fresh spinach & rich cheese. <br><br>Hummus, fruits,roasted vegetables, potato & rice dishes, fancy-schmancy salads, etc. & almond milk for hot beverages offer some Vegan/Vegetarian options. Ask your server to check with the kitchen for specifics or customization. Share, explore, and hopefully find a favorite!  There's an Agora (wine shop) and other noteworthy browsing if you're looking for a thoughtful gift.  Service is always hospitable, regardless of the hour. <br><br>A sweet spot for casual dates, to gather with friends, or more notably, to dust off the day's cares. This cafe possesses an uncanny ability to elevate the spirit. Toting home freshly-baked bread under one arm doesn't hurt any either. ;)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_qpGRSaLZBwLPHBN5QFmXQ/348s.jpg", "caption": "Almond Milk Chai Latte & Almond Milk Caffe Mocha; perfect."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WCw5LOaTXrqblgQK-h5vUg/168s.jpg", "caption": "Greektown; A joy."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SBZuCfDr9MSifefRLJd1tw/168s.jpg", "caption": "Full bar & coffee house with lovely service."}]}}, {"review": {"des": "Came here for a quick bite. There's free bread and butter by the register!! So good. <br><br>I ordered a spinach and cheese spanakopita. Let me tell you, this is the BEST one I've ever had so far in my life. So perfectly crisp and flaky, great dough to spinach to cheese ration. It was heavenly. I will be coming back for this specifically. <br><br>My brother ordered the lemon soup, a pasta salad, and a salmon lox sandwich. All were excellent! <br><br>Their desserts are also amazing, wide selection and staff is really friendly and kind!", "pics": null}}, {"review": {"des": "My go to bakery for the last 10 years!  Mango yoghurt mousse cake is highly recommended.  Took it to a birthday party recently and guests ate up my cake faster than the actual birthday cake!  I've also dined in for coffee and desserts on a slow weekends.  They have been able to handle my orders on a very short notice.  Call them directly for a cake order.  I do not recommend placing the order online as the pick up time is stretched out.", "pics": null}}, {"review": {"des": "Unfortunately, I don't like the chicken kebab, neither does my friend Harrison. The chicken is dry and flavorless. <br>The salad is just so-so. <br><br>I noticed that most of the photos are about dessert. Maybe this place is great on dessert but I am not gonna try it. I would put 3.5 for now. I will update the rating after a second visit.", "pics": null}}, {"review": {"des": "I've came here with friends, for a meeting, and took my family here when they visited the city. Good place for desserts in Greek town. I believe they serve drinks but I didn't get any. They have an upstairs area good for chilling with friends or a meeting in a casual setting. There's lots to do in the area of Greek town so you can walk around before or after as well.", "pics": null}}, {"review": {"des": "Reliable cafe! Been here several times throughout the years and it's truly a Greek Town staple. The menu is very diverse for a cafe. Be sure to leave room for dessert because they have a wide assortment. Interior is very thematic as is every other Greek Town restaurant. Weekend evenings are super lively here and you'll find patrons sipping wine at the bar or enjoying a full dinner. Music is very loud so don't come trying to study or get work done on these nights. I feel like this place can get overlooked by Mariano's down the street & restaurant row, but loyal customers keep coming back which is a plus!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/axIzd9GJTxI9JO2Pdz25Ng/348s.jpg", "caption": "Mocha"}]}}, {"review": {"des": "Great place for morning coffee with a pastry or a full meal later in the day! We came in around 4pm for appetizers and drinks. I had the Regional Antipasto with my flight of Greek red wines. A Greek spin on a wine and cheese pairing. Wine is reasonably priced at about 8 dollars a glass. We shared a fruit tart for dessert - delicious! The cafe has an EXTENSIVE pastry and dessert menu. Will definitely be back to try the coffee and more pastries!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EQDO83Q-KYaewH-ntEQDQA/348s.jpg", "caption": "Regional Antipasto"}]}}, {"review": {"des": "The name Artopolis means \"bread town.\" They are known for their house made artisan breads - so you can imagine how lovely it smells when you first step foot into this mesmerizing Greek cafe.  They state that they aim to bring an authentic European vibe to Chicago. The space is a loft style with an open kitchen. The front windows open to the street so you can really feel like a part of what's happening both on the street, and inside the cafe. <br><br>I just love it here.  <br><br>In the neighborhood for the Greektown street festival (Taste of Greektown), and after having walked six miles from Lakeview East to Greektown - we were ready to enjoy all the food this neighborhood festival had to offer.  After grubbing at some seriously stellar food stands (grilled octopus and calamari from Santorini, grilled chicken kabob and Greek salad from Roditys), we decided to wander into Artopolis for dessert.  We were immediately greeted and welcomed inside, and I fell in love with the casual vibe and unique aesthetic.  The place was packed, but so chill. All different generations of people were enjoying coffee and desserts, and the staff were attentive and warm. <br><br>We got in line for the bakery case and ordered the tiramisu and chocolate eclair.  What I appreciate most is that both desserts tasted so fresh.  Both were not particularly sweet, so we could really taste the different flavors of the ingredients. I think they truly have done well at staying true to their European identity.  From the staff, to the aesthetic, to the food - I can easily say this is my favorite bakery in Chicago.  There are Greek desserts here that I've never seen or heard of before, and cannot wait to return to enjoy.  <br><br>I absolutely love grabbing dinner at one spot, and wandering through the neighborhood to another spot for dessert.  Greektown is the perfect neighborhood to do this in.  <br><br>I highly recommend you stop at Artopolis for dessert when you are hanging out in Greektown.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7umapQ-j-hr_Jp3jdKjJTw/348s.jpg", "caption": "The chocolate eclair and tiramisu was perfection. I adore this bakery in Greektown"}]}}, {"review": {"des": "When in GreekTown in Chicago...don't miss this place! Everyone goes to Greek Islands but this place is tasty and charming. Don't leave here without stopping by the dessert cases and taking goodies home with you. Great prices and atmosphere.", "pics": null}}, {"review": {"des": "Imagine a picturesque cafe with artisanal bread lining the walls and a baked goods display counter full of Greek delights. You've just discovered Artopolis, in the heart of Greektown. A couple of my friends and I stopped by here for some late night dessert and coffee. This is such a nice, more upscale feel for a cafe located next to UIC, aka college town area. <br><br>It made me feel like I was transported to a European cafe. Service was spectacular, save for the fact that it was a little hard to catch the server's attention for the bill. The baklava wasn't quite my favorite, as I wanted to taste more of of a nutty flavor from the base and it was heavily doused in syrup. The chocolate eclair was a regular custard cream eclair with a chocolate shell on top, when I expected chocolate cream on the inside. I was most impressed with the mocha hot coffee, with whipped cream and a touch of cocoa powder on top. This was so delectable, warm, and rich that it made up for the ok desserts. It's a big plus that this is open late, so I may come back here if I am in the area with a late night sweet tooth. Prices are slightly steep here for desserts, not so sure about the food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/V6nyHcQMdlxMbWKH509vsw/348s.jpg", "caption": "Chocolate eclair and baklava."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/t3J2EJHKJQlvWZBscQZD4g/168s.jpg", "caption": "Mocha coffee with whipped cream."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SUFeHsYt-I-kvAF2xy6Q4Q/168s.jpg", "caption": "Wall of bread decor."}]}}, {"review": {"des": "Tried the tiramisu, very tasty. And the Greek coffee wow it was sooo rich not even like liquid anymore. I could see that people who prefer really strong coffee would like it. The atmosphere in the cafe is great, cozy, cute and relaxing.", "pics": null}}, {"review": {"des": "Good stuff. Food was tasty. Dessert was fantastic! We sat in the front near the open doors near the sidewalk. It's a good place to hang out and chill and enjoying a beer on a warm evening.<br><br>Service was good but could have been more helpful when deciding what to eat for dinner.", "pics": null}}, {"review": {"des": "My husband and I love this place. It's cozy. Coffees and deserts are always delicious. I think we've tried all their deserts so far. My personal favorites are tiramisu and coconut or mango yogurt mousse. We go there mainly for desserts, not the food, which is why I wouldn't base my rating on the food. We've tried their spinach pies, chicken riganatti, some sandwiches - they are just regular. Still, I'm giving this place 5 stars, since we see it as our favorite coffee spot.", "pics": null}}, {"review": {"des": "I've been wanting to try Artopolis in Greektown for awhile and found a great occasion to meet a friend after work. Taking advantage of the summer, we were seated at the edge with the streetscape view. We kept the order light as we were both meeting up for an hour so we ordered the Greek Frappes (mine with sugar), baba ghanough, and loukmades with honey. Everything was made well and the pita that accompanied the baba was perfectly toasted and garnished with herbs. The loukmades were soft, dusted in cinnamon, and absorbed the honey for a perfect sweetness. <br><br>The vibe was laid back and much like other Greek pastry and coffee shops that I've visited over the years. I look forward to coming back and trying the pastries and cakes as they're highly recommended.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sRid4Dmo_hbi1Ml99IgM-g/348s.jpg", "caption": "Frappes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HV0_aOnPmsm667mfxCUAbA/168s.jpg", "caption": "Baba ghanough"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fDhTnRciSsUMnaNQqx1hjg/168s.jpg", "caption": "Loukmades"}]}}, {"review": {"des": "Artopolis is a great cafe that serves both delicious food and dessert. I've frequented this place at least ten times and it's always been the perfect atmosphere for long catch-ups over some yummy foods/drinks.<br><br>They have a wide variety of desserts that are all meticulously made and satisfies your sweet tooth. I've tried the Tiramisu, Yogurt Mousse, Symphony...etc--no complaints so far. These desserts are on the heavier side though so I tend to like to share them with friends. <br><br>They have more selection options for meals--I've had their Chicken Farfelle, Chicken Kebob and tried their Artopitas (homemade savory pies). They've all been very well made and I'm looking forward to trying more things on the menu. <br><br>Service is also A+, every server I've encountered has been very accomodating and nice. I once sat in this cafe for 3 hours catching up with a good friend and not once did they hint for us to leave! I don't see this very often in good cafes nowadays so I highly appreciate this. We left our waiter a big tip :)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iGwbC39hBZ-B53z7zC6M8w/168s.jpg", "caption": "Chicken Kebob!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Exps-RBzVY46jpgauueItQ/168s.jpg", "caption": "The Tiramisu"}]}}, {"review": {"des": "I been going to this place for about 7 years. Every years birthday with family and friends. I get about 7 to 8 full cakes a year. This place starts with a thin bread base as time passes by the bread base is getting bigger. I just bought this one today and it is almost half the size. I got a mango mousse cake. The mousse is getting less. I just want everyone to know. This place sucks now.", "pics": null}}, {"review": {"des": "This is always a great spot to come for some dessert, coffee, or even lunch. I've been stopping by here for over 15 years. It is such a cute cafe! My most recent visit was late in the evening for a quick dessert. <br><br>  Service is great. Everyone is friendly and the desserts are big in portion and very sweet. You can definitely share with someone else (which I did). They have other items, like soup, sandwiches, salads, and a line in the back that you can go through and pick out what you want. Prices are reasonable as well.<br><br>I would say that this place is one of the coziest places to sit in Greektown. You can sit near the open windows and people watch, or you can find a table with friends and hang out. I like eating dinner at other locations, but for a light lunch or dessert, this is definitely the go-to in Greektown.", "pics": null}}, {"review": {"des": "Absolutely love their desserts. Everything tastes as good as it looks and the service is quick.<br><br>The only hiccup I had is that I ordered a tiramisu cake from here once and the online payment didn't work. The only option stated a cash payment in stores which was an additional $2. Turns out that they don't actually charge it and they can take card.", "pics": null}}, {"review": {"des": "Stars are ONLY for dessert. <br><br>Always to go is the tiramisu, mango mousse, and white chocolate mousse. MUST try the mango and white chocolate!! I usually come to pick up at the bakery and is a great dessert to bring to a friend or to just treat yourself.", "pics": null}}, {"review": {"des": "I shared the walnut baklava roll, kataifi, and galactoboureko.  Of the 3 treats, I found the baklava and kataifi the best. Both had walnuts and the flavors of sweet and fatty melded into one.   A very good sweet tooth moment for me and energizer.  It provided the needed sugar rush to pull on through for the day. <br><br>The galactoboureko lemon custard was sweet and the pastry shell flakey.   It was too much to eat after eating the other sweets. I took it back to the hotel to finish off. <br><br>The service was friendly and quick. I will definitely be back my next trip.", "pics": null}}, {"review": {"des": "This place is wonderful! Great service, atmosphere, people and food! Had the house lemon rice chicken soup-delicious! Shared the Mediterranean salad-YUM! Ordered the smoked salmon pizza, packed with flavor! I enjoyed this but would probably try another next time, was a bit dry and salty from the capers. To end the dinner we split the espresso cake- fabulous and rich! Total for this, another desert to go and a tea was 56$. Looking forward to our next visit!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/m-KXAcbvaPWDLKwcQQdCZA/348s.jpg", "caption": "Espresso cake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uaJnBaD-vmNCEKtwM079GQ/168s.jpg", "caption": "Salmon dill pizza (forget name)-so amazing!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1Lg8755A-NimH8DGng6EZQ/168s.jpg", "caption": "Some of my partners Mediterranean salad- delicious"}]}}, {"review": {"des": "Artopolis is an easy spot to hang out in if you find yourself in Greektown. There's a bar, an upstairs and street level seating that's ideal for people watching. Remember it's a cafe, so the meal options are a little limited, but what they serve is quite tasty. I had the  Turkey Melinzana and tomato soup while I waited for my date on a warm day. If you're  lucky, you'll e joined by some of the neighborhood Greeks at the bar, sipping their coffee and talking about one another as they would in the old country.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZAM0f7pTv0y84HtU_uOq2A/348s.jpg", "caption": "Turkey Melinzana"}]}}, {"review": {"des": "Very good environment, friendly staff!! We ordered galaktoboureko and coffee, both delicious.", "pics": null}}, {"review": {"des": "I stopped in after work for a small dinner with my boyfriend. We were so surprised by the menu and atmosphere here. This is one of those places we've had our eyes on for a while, but it never excited us enough for us to go. I'm so glad we stopped in today because I loved both items we shared here. <br><br>When we walked in we were very kindly greeted and seated in the upstairs area. We were looking for a light dinner and were pointed in the right direction. We picked the artopita with chicken and mozzarella, which came with a choice of potato salad, pasta salad, or soup. For $8.50, this was very filling and cheesy and flaky and perfect. I couldn't help but also order a baklava. YUM. My boyfriend said it was the best he's ever had. <br><br>Overall, I can't wait to come back here for more of the bakery items or even to have apps and wine!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xiiXsGIhgoZZOP_r32wxcw/168s.jpg", "caption": "Walnut baklava. $4.50"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/u7CQUsCKpzIICzjPiy-p8Q/168s.jpg", "caption": "Chicken and mozzarella artopitas with an included side of pasta salad. Very filling for only $8.50"}]}}, {"review": {"des": "There are a number of things I love about Artopolis. I live right across the street, their coffee is pretty good, they have a grocery section with bread, wine, snacks and Greek items. Even though I do love the coffee shop, it is pretty expensive. A coffee of any size is over five dollars, so I only go when I want to treat myself to something strong, but maybe I am just cheap. To be honest, the food is not that great and I would much rather go to any other restaurant in Greektown. The staff is very friendly but a little slow so only go here if you have some time to spend as if you were actually in a coffee shop somewhere in Europe.", "pics": null}}, {"review": {"des": "This is a great bakery place with lots of varieties to choose from. Always love their mango mousse cake - great choice for birthday cake. Instead of stuffing the cakes with lots of sugar, their cake is based with yogurt, much healthier alternative. Cake is rather thin though, about 1-2 inches thick. But they are nicely decorated with a fruit glaze on top.", "pics": null}}, {"review": {"des": "I am a long time customer since approximately 2003.  I like the food and service is always friendly.  Usually I go for lunch, but have been here for dinner as well.  Most recently, the wife and I had chicken dinners with spinach and feta pies.  All of it was good.<br><br>Other good food here includes the lemon chicken soup, Mediterranean salad and Greek salad.  The coffee bar is a good place to read the paper or whatever while enjoying your drink and maybe avoiding an annoying meeting at work.  <br><br>My wife's favorite part is the bakery.  She likes the eclairs, but there is a plethora of fresh baked choices.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mg5zi1fYBGsddi9M-D4jtg/168s.jpg", "caption": "Greek Country Salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yOXKcixEuLWW26lTDVzF4Q/168s.jpg", "caption": "Tomato vegetable soup"}]}}, {"review": {"des": "We went in for a post theatre dinner and it was lovely!!<br><br>First of all, lots of options for vegetarians! We ordered the Saganaki kebob, spinach and feta pie and the eggplant crostini.<br>The crostini was delightful! It was fresh, hearty and different that any I have had so far! We ordered a rosemary roast potatoes to go with the pie and it was different! This one came drenched in their special sauce!<br><br>If the mains do not blow you mind, just you wait for the desserts!! OMG!!! I was in dessert heaven! Their traditional desserts as well as other selections are to die for!!<br><br>I wish I had more that 5 stars to give for their friendly staff, cool decor and exceptional food.", "pics": null}}, {"review": {"des": "If memory serves me correctly, I have given Artopolis 5-stars. I loved this place and was no longer frequenting our neighborhood cafe, Iguana, so I can enjoy the desserts at Artopolis.<br><br>But tonight I guess we were the wrong color. We waited for a window-side table to be cleaned as a party of 3 head just left. As we sat, a hostess/bartender asked us to move tables because they were for parties of 6 since their upstairs was closed. Unconvincingly we obliged. <br><br>20-minutes in to our meal, a couple sat down and the same hostess gave them their menus without any request to move. <br><br>Absolutely rude! And it sucks that because of this incident I will no longer enjoy the cookies, sandwiches, and pizzas.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/g72kPbJHWIcWCXboUgwz2A/348s.jpg", "caption": "Couple having dessert without objection to their choice in seating."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/a6ErMv3kunZEbLwFdqx-jA/168s.jpg", "caption": "No one there for 20-minutes."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rofHOcfdAr_Iv6T4hqWKtA/168s.jpg", "caption": "Wanting this window-side seat."}]}}, {"review": {"des": "I was looking for a dessert place since there was a huge line for Bombobar so I looked on yelp and found Artopolis. The restaurant itself was very aesthetically pleasing and very clean. However, the food was not the best. I ordered the margherita pizza and it was subpar. It was around $14 for a while pan and it was not worth it. <br><br>For dessert, we ordered a slice of the chocolate raspberry truffle cake and a slice of strawberry shortcake. The strawberry shortcake tasted like nail polish remover and the strawberries were frozen. The chocolate raspberry truffle cake was better but was not worth $5. <br><br>The service was fine but it was very slow.<br><br>Overall I would not come back here again.", "pics": null}}, {"review": {"des": "Great wines and desserts. Pizza was a bit too cheesy. Would definitely recommend this restaurant.", "pics": null}}, {"review": {"des": "I would say that even though the atmosphere was pleasant and the service was good, the food really didn't make it very high on my list. I ordered a chocolate cake thing and it was dry and sad and made me question my decisions in life. The coffee was okay but mostly mediocre. We sat on the upper balcony which was cool but it seemed rather trepidatious to go downstairs to use the bathroom which also seemed very far away. That wasn't a complaint just an observation. If I am back in the area again I would almost prefer a Panera or some chain where at least I know the food is going to be good.", "pics": null}}, {"review": {"des": "I can't believe I haven't stopped in here sooner! Such a cute place, and I was surprised to see they had a full food menu. We just grabbed a Greek coffee and Loukoumades (honey puffs) and they were amazing! They've got a cute little shop spread throughout with items from Greece including cookbooks, olive oil, etc. I was also happy to see they sold Mythos (Greek Beer) so we grabbed a 6-pack to go. Definitely a great place to grab some Greek pasties/dessert, and I'll have to check out their dinner menu next time.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/D4MSsZOk0kZbpGKGdjCAKQ/348s.jpg", "caption": "Loukoumades"}]}}, {"review": {"des": "Left Chicago after living here for a few years.  Came back for a 2 day business meeting.  I used to go to this place all the time, and this place is so good I had to squeeze in a visit during my short trip. Awesome desserts and coffee.  Highly recommend the Le Symphony, a dark chocolate mousse cake.", "pics": null}}, {"review": {"des": "Five stars for the desserts, but one star for the service. Thus, the 3-star rating is born. I've never been to a restaurant where I felt like our presence and ordering food was a burden to the server before interacting with him or her upon sitting down. If you're going to give a dirty look twice before even talking to us and getting our orders, at least don't do it RIGHT in front of our faces? The best way I can describe her look is when a person's eyes widen briefly while looking to the side (almost like an \"ummm okay...\" expression with emphasis on the ellipsis).<br><br>Anyway, we ordered the Mango Yogurt Mousse, Hazelnut Praline, and Tiramisu. They were all very delicious and what brought my rating up. My favorite is of course the Hazelnut Praline because I'm a fan of hazelnut anything. None of the desserts were too sweet, but they tasted fresh and satisfying.<br><br>When the server brought our desserts over, I cleared the small table to the best of my ability to allow her to place the plates down in the middle since we were sharing. While there was enough room to put the desserts in the middle, she told us that there wasn't enough room. I insisted that there was room, and guess who was right when she started placing the plates one by one in the middle?<br><br>This is a place where you should get desserts to go and not bother with the service. It's also a popular spot for birthday cakes, and I can see why.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/B1_lVX805gFv3Q_ZcA9eIw/348s.jpg", "caption": "Hazelnut praline (top), mango yogurt mousse (middle), and tiramisu (bottom)"}]}}, {"review": {"des": "This was kind of a \"meh\" place. I went in to get coffee, a small meal and dessert with a friend of mine. We ended up only liking the dessert... The coffee was burned and tasteless (I ordered an almond milk cappuccino-- my usual), the Spinach and Feta Artopita was bland and the potato salad left something to be desired (which is funny, because this used to be such a hit and we came specifically for the potato salad).<br><br>The tiramisu, baklava and strawberry shortcake were great however!", "pics": null}}, {"review": {"des": "What a great place.  It is like a small version of Eataly but Greek!  They have several sections, one for sandwiches, one for pizzas, one for coffee, one for alcohol and the reason we came....desserts.  It was around 9 or 10 at night when we came here to pick up some dessert for my wife's birthday.  There were 5 of us so we ended up picking like 8 or so smaller desserts that we can all share and took them home.  They also have some traditional Greek beer like Alpha that we ended up picking up.  They were patient with us to explain each dessert that we had a question about which was nice of them, but they were also pretty empty at the time so we were able to dominate most of their attention.<br><br>I wish I remembered the names for all the desserts because there were some standout hits and some that were good but not amazing.  Most of the Greek yogurt based desserts were good but our favorite was the traditional dessert they had at the bottom of the case,  For the life of me I do not remember the name but it is in the top right of the picture below.<br><br>If you have a hankering later at night for some dessert...this place is open!  Go get some deliciousness here!", "pics": null}}, {"review": {"des": "Awesome cozy place. Defiantly go for any pastry and their cappuccino well all their coffee for that matter is worth trying. The service was fast as well with a friendly staff.", "pics": null}}, {"review": {"des": "This place has alright food and it's usually not crowded. At the end of the day, after work I was looking for something quick to grab and opted for their mushroom pie (artopitas) in their hot'n'ready buffet/deli styled display. I ordered it to go, paid, and as I'm walking out, I decided to sit down at a table nearest to the entrance to get a couple bites in before I met up with my partner. <br><br>Not even two bites in, some worker or manager (bald, little to no hair guy) whistles loudly and yells, \"hey!\" to some workers behind me. He talks to them briefly then walks over to me and tells me, \"you can't sit here, you ordered that food to go. It makes the 'restaurant' look bad with you eating takeout here, so leave\" and said I was taking up tables and they needed to make room in case they get busy. He said this verbatim. There were 3 other tables occupied by couples and 20+ tables that were available in the dining area that I was seated. He must have realized what he said because he quickly offered to give me a plate. To which, I just said \"No, thanks,\" packed my food back up and walked out.<br><br>This \"restaurant\" is a patisserie with desserts on one side with a window display and a cafeteria/ deli-styled buffet--hardly \"fine dining.\" I've paid for a meal to go, to save time on packaging, just to be told that I can't sit at a table for a couple bites because it makes the \"restaurant\" look bad. Quite upsetting. <br><br>Been coming here for three years to be told this by this asshole. You would do well to take your business elsewhere and save yourself the trouble of mediocre food and shit service from people like him.", "pics": null}}, {"review": {"des": "From birthdays, graduation to random sweet tooth, Artopolis is my go to dessert spot. Our family favorites will be their tiramisu and mango mousse. Be careful while having that first bite of the tiramisu because that cocoa powder on top can just choke you. Most of desserts in America tends to be super sweet however the cakes served here are not at all.", "pics": null}}, {"review": {"des": "Nice roomy and well lit place. Came with a friend after dinner for some dessert. I had the baklava roll and mango yogurt mousse. The mouse not bad, moist and not too sweet. Baklava was okay but way too sweet for my taste. Desserts are average but service was good and people were friendly.  Solid 3 for me.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kR3-OIJAmfAK0SLyJGYABw/348s.jpg", "caption": "Mango Yogurt Mousse"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ERlgOhPEjQO4P5hYRWrL6Q/168s.jpg", "caption": "Baklava Roll"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Yxm3YXi8N3Hao5nWsNNO0A/168s.jpg", "caption": "Fruit Tart"}]}}, {"review": {"des": "Cozy great food very reasonable prices for what you get. Bring your menu translator if you are not familiar with Mediterranean plates.", "pics": null}}, {"review": {"des": "Love the small mousse cakes from this place. I can't stop thinking about the mango and strawberry mousse cakes. Excited to try some meat and olives soon. I stepped in during winter and it was a bit cold. Otherwise, great Chicago gem.", "pics": null}}, {"review": {"des": "The variety in the menu is baffling and that's the first thing one would notice about the place. We went for brunch, started off with freshly squeezed orange juice which was just heavenly. Cappuccino was strong and good, the black coffee my husband ordered was also good. We had their specialty spanakopita which was precisely made, my husband loved it, I just realized mixing spinach with feta is not for me. It came with a side of rosemary potatoes which were good. Absolutely loved the avocado tabbouleh with pita chips. The only item we did not favor was the rustic greco pizza, the crust was thick for us and the combination of flavors just didn't appeal. There are many options in the dessert, and we went for the Le Symphony (sweet chocolate mousse) which was rich and amazing. Service was really good as well.", "pics": null}}, {"review": {"des": "I've been coming here for years and its definitely one of my FAVORITE if not the BEST dessert places I've ever been too. Its a beautiful 2 story restaurant, well lit and the best displays of sugar heaven. Staff is great and they greet you warmly right when you walk in.<br><br>Some of my favorite things to order is the mango mousse, fruit tart, tiramisu and the loukoumades. The loukoumades are these amazing Greek donuts drenched in honey and cinnamon. Definitely a MUST TRY!!<br><br>Will always be back!", "pics": null}}, {"review": {"des": "I've been coming here for many, many years and Artopolis has always delivered pretty consistent food and service.<br><br>The food is good and decently priced.  I'm a fan of their lemon chicken rice soup.   And a super fan of all their desserts, but particularly the almond cookies.  I usually stick with one of their chocolatey desserts but recently branched out and tried the Ekmek, which was not on the menu but I saw in the dessert case.  According to the waitress it's like a mix between the Galactoboureko (lemon custard) and the Kataifi (shredded filo dough with honey).  It was light and delicious.  The custard wasn't super lemony but still was yummy.<br><br>You can come in for a full meal or just dessert and coffee.  The staff is welcoming and pretty knowledgeable and helpful.  Definitely a good stop in Greektown!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_nK8th5mo804PLdAjcXAZg/348s.jpg", "caption": "Ekmek (tiramisu & almond cookies in the background)"}]}}, {"review": {"des": "I love the theme, coffee and all of the delicious deserts here also the staff is super friendly. I have been coming here for years. The place makes you feel like you are back in Europe.", "pics": null}}, {"review": {"des": "Really good food at a reasonable price. I have eaten here for breakfast and dinner and have never been disappointed. Pastries are fresh, lots of fresh fruit, and if you order a pie entree like the spinach pie or one of their quiche like dishes, you will taste the homemade flaky crusts. A true delight!", "pics": null}}, {"review": {"des": "One of my favorite lunch spots when I have time to unplug and escape to a cute cafe. <br><br>With a larger interior and a second level of tables you have ample seating available for you and your squad. When you first walk in you will tempted by the desserts/pastry sections to your right. If you head straight in and go to the food counter you will see they have different lunch options available and displayed to satisfy any craving. One of my favorite call outs is the Spankito, add this to a 'pick two' of soup or salad and you have a great lunch. <br><br>Highly recommend", "pics": null}}, {"review": {"des": "Artopolis is the best Greek cafe that you will find in this small subset of Chicago. Affordable, delicious, and opened until the dead of night? Yes please!<br><br>I've been here twice: once for birthday drinks, and the other for an actual dinner meal. Artopolis is clearly known for their desserts, but don't let that prevent you from trying some of their drinks and savory dishes. Their cocktails are reasonably priced (less than $10 for most of them), strong, tasty, and overall a great deal. Their espresso cocktail was especially good. A great energy boost to your evening.<br><br>During dinner, I ordered the Kasseri And Feta Pita with a side of pasta salad. The pita was baked to perfection and came with a blend of cheeses and mint. My plate was sprinkled with cilantro to really add to the presentation. If offered the choice, definitely go for the pasta salad. This penne side was amazing and tasty.<br><br>For the dessert lovers, you can't go wrong with what I've had. The Mango Yogurt Mousse is light with just enough sweetness, and had great texture. The almond baklava was uber sweet, so be prepared. Each of these was less than $5 a piece, so definitely splurge!<br><br>The food and ambiance at Artopolis is fantastic. Only major gripe is that service can be slow at times and it may be difficult to flag down your server. This aside, I am very content with the selection and accessibility, and will be back very soon!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hkQyfrwWd8-8GUXF3l6yTg/348s.jpg", "caption": "Almond baklava"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/A9G4iRMqzAhG4mrLsN1HnA/168s.jpg", "caption": "Mango yogurt mousse"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cfR3yTNd7vUIAP_EG7aJUw/168s.jpg", "caption": "Kasseri and Feta Tiropita with pasta salad"}]}}, {"review": {"des": "Came here for some dessert after a late breakfast at Meli's Cafe.  A Chicago native recommended this place, but I was less than impressed.  The ambience is nice and the desserts look great, but the taste was a different story. <br><br>Of the three that we ordered, only the symphony was good. The mango mousse had a strange texture crusting along the rim that killed the smooth texture of the mousse.  The mousse itself was quite good.  My wife ordered the opera, and it came out really dry and feeling stale.  She couldn't eat more than a couple of bites.  <br><br>Sadly, I don't think we'll be coming back here the next time we are back in Chicago.", "pics": null}}, {"review": {"des": "Yummy, yummy, yummy I've got dessert in my tummy.  Anyone who knows me, knows that my favorite part of a meal is dessert. But only if it's a really great desert, worthy of the carbs. One of my favorite places for dessert in Chicago is Artopolis in Greek Town. If you can't find what you like here, it probably doesn't exist (unless you're craving an ice cream concoction or a soufflé).  <br><br>Whenever I'm having dinner on Halsted, I always try and talk my companions into stopping here afterwards for dessert and a cappuccino. My very favorite are the traditional Greek loukoumades. Small squishy balls of dough that have been fried, then covered in honey, nuts and cinammon. This is a generous dessert you'll definitely want to share.<br><br>But Artopolis offers a lot more than desserts.There's an on-site bakery with artisan breads and rolls, and a full menu with salads, sandwiches, wood fired pizzas and a variety of Mediterranean foods. Some things I've tried are good, and some just average. It has a full bar. And almost everything is available for take-out. <br><br>No reservations, so I no longer have breakfast here weekends, when it's often packed. No table service for lunch except on weekends. And no free parking like at the other Greek restaurants on Halsted St. (I leave my car at the restaurant where I've had dinner when I come here just for dessert).", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bdkUpyp409B1jO-21HJ-oA/168s.jpg", "caption": "Yummies."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UHIwRSX0tQhq8wdZmpEbTA/168s.jpg", "caption": "Yummy loukoumades."}]}}, {"review": {"des": "Popped in here for some Greek desserts. They serve lunch here as well but we cane by just for some sweets. I had the baklava and the lemon custard pastry. I'm not sure what the latter was called in Greek but it was good. I liked my baklava better though. They have ample seating here.", "pics": null}}, {"review": {"des": "A gem inside Greektown. Very open and interesting concept in seating design. I got the tiramisu, generous portion size but sadly no coffee taste; it was more of a moouse inside with cocoa powder thickly dusted on top. However the staff was pleasant and great with checking in.", "pics": null}}, {"review": {"des": "Excellent, excellent, excellent. The service was perfect here and super courteous. The coffee was excellent with a large selection. The tiramasu was out of this world, delicious. A fine selection of wine too anf great hours. Definitely will be back for more coffee and more deserts.", "pics": null}}, {"review": {"des": "What a place in Greektown, Chicago. After almost giving up on Greektown - we decided to look at google maps for \"coffee near me\" suggestions - and of course, Artopolis popped up - we had walked in a different direction and had missed it earlier.<br><br>At first we were a little unsure of this place for we had to be seated - we had thought of a nice, informal Greek cafe where one could just order stuff at the counter and sit down. But this seemed more formal...<br><br>But - we were attended by a wonderful server, of Greek origin as we later learned when he brought us our rich, thick, (bitter?) Greek coffee - and when we complimented him for it, he said it was that good because it had been made by \"Greek hands\"...<br><br>We also ordered the Greek cookie platter - and for about $5 it came with a selection of 9 scrumptious cookies!! What a treat Artopolis!<br><br>We were too full that day but so many of the other things  which I saw in the display cases later - baklavas, breads, fresh soft pizzas - looked very inviting. Well, we shall deal with those the next time we are in Chicago! Thanks Artopolis! I am quite sure I felt the Aegean sea-breeze also that day while sipping coffee...", "pics": null}}, {"review": {"des": "Love this place. We had the tiramisu, walnut baklava, almond baklava, and a chocolate bunny for our 3 years old.<br><br>It was was gone within an hour :)", "pics": null}}, {"review": {"des": "Artopolis is the kind of place that reinforces the idea that while I love my job, I prayed I would get it after my interview because the place was located in Greektown. <br><br>Before we get further, I want to note to my fellow Yelpers that I am a European mut with Turkish upbringing. As such, the foods served at Artopolis are things I have been having my entire life. I want it known that this place satisfies me daily with the half soup-half salad order for $9.76 and kind gentlemen who allow me to take extra lemon for their lemon chicken rice soup without staring at me weird.<br><br>I believe Artopolis's owners are from Northern Greece and despite their knowledge of me being Turkish, they have been kind and very willing to give me all of the kataifi I can fit into my body. We are currently at the stage where I am being given money by colleagues who are swamped so that I can run down and grab some katifi for them.<br><br>They also have spectacular Greek *ehem* Turkish *ehem* Coffee made from scratch inside of heated copper ladle. I almost cried the first time I had this because there were all the bubbles in the coffee that make it real.<br><br>I love my Artopolis and I can't wait for a very long relationship with them.", "pics": null}}, {"review": {"des": "Love it, love it !!! Great place with great food and great service !!! The only problem from the restaurant is that you might have trouble finding parking.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JbHYP-TnpxhYkppdJqIzuQ/348s.jpg", "caption": "Awesome restaurant !!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/c_Jy5RhYiMEGgUgZs4pG0A/168s.jpg", "caption": "Great menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ws8meWXtudBhGZ2M6Nb3yw/168s.jpg", "caption": "Great menu"}]}}, {"review": {"des": "Nice open space, ample seating but poor service and a disappointing dessert makes me sad to give this place a two star rating.<br><br>If you want to dine in you have to get table service, which is fine by my, unless you have to wait 10 minutes to be given a menu when you already know what you want plus it's not even that busy at 8pm. The bill took quite long as well given how many workers were walking around.<br><br>I had the ekmek which is phyllo shreds topped with lemon curd, almonds and whipped cream. It was very sweet and unfortunately the lemon curd didn't taste very lemon-y. I couldn't finish it because it tasted just like sugar. Might've chosen the wrong dessert, I hear the greek yogurt based desserts are delicious. The Ekmek is apparently their most popular but unfortunately I won't be ordering it again.", "pics": null}}, {"review": {"des": "I went twice yetserday! once to pick up some mango yogurt for a friends luncheon and then with the family after dinner. Feel like i am walking in my relatives home, literally. I know every item on the menu, the owner has become a dear friend after the numerous cakes i have picked/ ordered the last 15 years.<br><br>You can never go wrong with the desserts here!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JO401VlZlUomFTXRmhex0Q/168s.jpg", "caption": "Tiramisu!"}]}}, {"review": {"des": "I adore this place! This is my FAVORITE lunch place in Greektown. They're a fantastic lunch spot, and a great option for dessert and coffee. I frequent Artopolis for their salads. They make the salads for you on the spot; they're quick and high-quality for the price! Their staff is always incredibly friendly; they remember their regulars and are always working to keep the food station clean and well-stocked. While I mostly stick to their salad selection, their soups are pretty good, too! I also recommend their artopitas, which never disappoint. <br><br>Their bakery is wonderful, but a little over-priced. They charge by the pound for their artisan cookies, which can add up. I also got a cheesecake for a colleague's birthday, and while it was DELICIOUS, it was very expensive for a 9 inch cheesecake. <br><br>Clean, friendly, quality and tasty food! Highly recommend this spot for a great lunch!", "pics": null}}, {"review": {"des": "I went here with my ex-boss to wait until one of the restaurants in Greek town open. O ordered a peach  bellini and mango yogurt mousse. Both were very tasty and filling. The environment is open, warm and friendly. This is a great date spot.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ilrCQh-agT6fIAL-2Jfg-Q/168s.jpg", "caption": "Mango yogurt mousse"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5hXgNnYPKp5PArUQ9u_2OA/168s.jpg", "caption": "Almond cookies"}]}}, {"review": {"des": "Went here for lunch.  This isn't the typical gyros style food - more upscale for a reasonable price.  They have healthy fare; portobello mushroom sandwich, chicken kabobs, pita wraps, lemon chicken soup, good coffee, extensive desserts (pecan baklava - may not be that healthy).   It is 2 levels; the upstairs is a small loft overlooking the street.  You order at the counter, but then they bring you your food.", "pics": null}}, {"review": {"des": "Homer's ice cream + sour cherries is simply the best thing you can eat anywhere. Everything in the bakery is beautiful looking and what i've tried so far is, too. We use this bakery for all our cakes at work and strawberry shortcake and valrhona are favorites. Wish they could deliver!", "pics": null}}, {"review": {"des": "Yes, 5 stars: this is an outstanding cafeteria style Greek restaurant with fancy cakes.  Great for its relaxed ambience close to the Loop.  Sandwiches, Greek favorites, salads.  I love their personal sized phyllo-encased entrees (\"artopitas\") with half a country Greek salad (feta, cucumbers,  kalamata olives, pepperoncini, tomatoes, a little thinly sliced red onion and bell pepper.  There are many vegetarian options.  Next time I'm there I'll get the vegetarian moussaka.  See my photo of the cake case...my favorite is the Valhrona which has a layer of cake and two of mousse enrobed in chocolate.  The small cakes are perfect for two to share.", "pics": null}}, {"review": {"des": "My favorite restaurant in Greek town! So chic and the staff are always very attentive. They have amazing wood oven pizzas. The 5 cheese with goady cheese in the center is my favorite. Also love their lasagna, particularly the spinach and chicken one. And don't get me started on their dessert bar. Just do yourself a favor and order a chocolate eclair", "pics": null}}, {"review": {"des": "This is a go-to place for desserts and food.  From their salads to their personal pizzas and meals, this simple sit down has a great casual setting for any time of day.<br><br>As you stand there are stare at the dessert wondering what to get... let me just say the Hazelnut Praline is to DIE FOR!", "pics": null}}, {"review": {"des": "Placed an order online via Yelp and when I got down there, the guy looked at me like he had no idea what I was talking about as I tried to explain to him that I'd ordered online. Eventually he summoned a millennial from somewhere who helped sort everything out and they made my order for me--but not before the guy gave me a lecture about how I shouldn't order online, I should use the phone. (I chose this place precisely because there was an order online option, as I work in an open office and don't want to disturb my co-workers with a lunch order phone call...)<br><br>The food was good though.", "pics": null}}, {"review": {"des": "I've walked past this restaurant plenty of times but never went inside until a few weeks ago. <br><br>My friend and I were choosing out a cake for my birthday and artopolis came up on yelp as highly rated for cakes, they supposedly have one of the best tiramisus in the city. Not that much parking in this area so we parked a few blocks away. <br><br>We also ordered a chicken kebob plate with grilled tomatoes, rice pilaf, and tzatiki sauce.  I was able to try the mango mousse, tiramisu, and raspberry chocolate ganache cake. The chicken kebob plate was about $5 and had a decent amount of food on it, but not enough to justify the price. <br><br>After trying the cakes I picked a mango mousse cake to order, and was not disappointed. The mango mousse cake is so light creamy and fluffy!! I would buy this for every special occasion if I had the chance. The other cakes were good as well but not enough to get an entire cake worth.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ToPVAAIPtFGMqMo1sRumKA/168s.jpg", "caption": "Tiramisu mango mousse and raspberry chocolate ganache"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/u11g1biIRjNvLSnMZ0BQ_w/168s.jpg", "caption": "Chicken kebob plate"}]}}, {"review": {"des": "First and foremost, it appears that this place serves food other than dessert, and for the sake of transparency, I did not partake of anything but dessert and coffee, two things they do astoundingly well.<br><br>When I saw the stunning array of desserts, I really wanted to try them all, but I had to settle for just one, so the Hazelnut Praline won.  It was made with a light fluffy lightly sweet mousse filling with just the right amount of richness. I enjoyed a cappuccino that was also excellent.  <br><br>Everyone else in my group raved about their desserts as well. My hubby had the loukomades and said they were among the best he'd ever had. <br><br>Service was friendly and fast until we needed to pay the check and then our server was nowhere to be found. My sister finally got frustrated and went to find someone to ring up our order.  This is one of my biggest pet peeves at a restaurant. Once the meal is over, please give people the option to leave...they might have other plans (we did) or be on a tight schedule. Making people late is not the best way to earn a big tip.", "pics": null}}, {"review": {"des": "I've only ever ordered from the catering menu here as it's an office favorite for parties and gatherings. The Mediterranean salad, Stuffed Chicken Breast, and Artopitas by the dozen are unanimously the best!!!", "pics": null}}, {"review": {"des": "Stop in after getting dinner at Mr. Greeks and I made sure I left room for dessert. It's really confusing upon entering though because there's no sign indicating that some one seat us or we seat ourselves or what... But upon arrival, we just wanted some dessert and approach the counter because there's no sign indicating the seating situation. So when we talked to the counter girl, since we wanted to have dessert there, we would have to seat ourselves and someone would come take our order. But we were already ready to order so we had to wait awhile for a server to approach us. Then when someone took our order, we had to wait when the dessert we wanted was already in the counter glass but whatever we waited. <br><br>We finally got our dessert and it was pretty decent. I really enjoyed how moist the tiramisu was but I wish there was more cake in it and not just the other filling stuff but nonetheless it was still very tasty. My boyfriend got the strawberry shortcake and well there isn't anything special about it. But definitely a great spot for dessert though!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KXoP-5G5OubYFNezVjvD5w/348s.jpg", "caption": "Strawberry shortcake & tiramisu"}]}}, {"review": {"des": "One of my favorite places for a delicious dessert!! From their  baked pastries to all the mouthwatering mousse cakes with mango mousse being my favorite!! And try all their baklava's!!", "pics": null}}, {"review": {"des": "Three of us came here after having dinner at a near by restaurant for some desserts.  <br>Upon entering, this bakery / coffee shop, I had noticed how lively this place is.  This place is very well lit and just a cool vibe.<br><br>You walk up to the counter and start to look at all of your options for desserts, coffees, teas, and soda.  After placing your order, just find a table or seating area and your order will be brought to you.  The service and food were outstanding.  I would recommend this place for great service and food and a little time to relax.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/a5GaVrXYdK9NWP2sUOFwOw/348s.jpg", "caption": "Interior"}]}}, {"review": {"des": "Artopolis is easily one of my favorite bakeries in Chicago. They're a cafe as well, but I've never come for anything savory. I head straight for the desserts!<br><br>They have three or four bakery cases when you walk in, all filled with amazing treats. Behind that there is a display of all of their fresh breads. I have yet to have anything bad here. Most recently, we loaded up on baklava, chocolate-raspberry mousse, lemon tarts, and cheesecakes. The chocolate-raspberry treats were delicious. They're covered in ganache and are so rich, you almost think you can't finish a piece. Then, of course, you do. The lemon tarts I think are my favorite. They are just the right amount of both sweet and tart, the filling is thick without being too much. The crust is super crunchy and really sweet, which is a nice contrast to the tart lemon curd. The cheesecake... Well I never got to try that because my dad ate all of it. I think that's a good sign. The baklava is textbook and delicious, with heavy doses of honey and nuts with flaky pastry. <br><br>I make a point now to come here whenever I'm in the neighborhood, and it's given me a reason to venture up to Greektown more often. I'd definitely recommend it. But, it's all so good looking and tempting, be prepared to walk out of there with a full box of treats.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cAXhwj6ehAl8r0W-Yw4OvA/348s.jpg", "caption": "Baklava"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qHYMDUEY5rnTwj40ToLnRw/168s.jpg", "caption": "Chocolate raspberry mousse"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sUp0U3up6o3b2rTZT5IedQ/168s.jpg", "caption": "Lemon tart"}]}}, {"review": {"des": "Classic hanging out place very laid back have ur frappe and loukoumades and enjoy ur company!", "pics": null}}, {"review": {"des": "Love that they don't rush you! Enjoyed an afternoon of catching up with friends.", "pics": null}}, {"review": {"des": "We came here just for desserts but it was disappointing. The pastries were dry and tasted okay. Did not try anything else.", "pics": null}}, {"review": {"des": "We had been coming here for years for dessert and coffee, never getting around to trying any of the food until one day my friend didn't want dessert with us. He ended up ordering something, when it came here was raving about how good it was, so another person at our table ordered, then another. By the end everyone had ordered something, even though most of us had already had dessert first.", "pics": null}}, {"review": {"des": "Cute place in Greektown, not too far from Union Station. Offers a delightful range of authentic pastries, alcoholic drinks, and hot food prepared right in front of your eyes. Service is fast and pleasant.", "pics": null}}, {"review": {"des": "Came here for a quick lunch and was not expecting how much food we would get in such a short time! Although our server was confused about the changed half and half specials on weekends, we figured out our orders and got our food in the next 10-15 minutes! The complimentary bread in the meantime was delicious, and we took some laps around the shops to look at all the imported products and fresh pastries, which looked delicious. I was very satisfied with the Mediterranean salad I ordered- fresh vegetables with a crisp taste and texture. But the favorite of our meal was the shared Loukoumades (warm, Beignet-like donuts), drenched in honey and with a chocolate dipping sauce. They were so so fluffy and delicious; I would've eaten a whole plate myself if my two friends weren't there with me. Definitely will come back before we leave Chicago to get some pastries like baklava!", "pics": null}}, {"review": {"des": "I don't speak Greek but this restaurant should be Greek for DELICIOUS. if you live anywhere in Chicago, you must visit this place and order the lukamadies. I might have spelled that wrong but regardless, the food here is really good. The ambiance, decor and service are all wonderful. If I remember correctly, the bakery has a ton of selections. <br><br>The bathrooms are very clean too <br>Street parking is scarce but it's right near the blue line at UIC Halstead. Just exit the Halstead side and head north. <br><br>This restaurant is in Greek town and close to the University of Illinois Chicago campus. <br><br>It is totally worth a visit or two.", "pics": null}}, {"review": {"des": "I came for a Tiramisu and I left without one in my hands. It was in my stomach and no it was not the bite-size one.", "pics": null}}, {"review": {"des": "Love love their dessert!!!! They have fabulous and delicious cake. I'm a sweet tooth person always come here for their pastries or slice of cake. They also serve food too and coffee. I try them both speechless.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kTY0wswNuUee2lh-ReYJOw/348s.jpg", "caption": "This is what I had for my birthday. It was month ago haven't post it up. Here is it...presentation is a 10!"}]}}, {"review": {"des": "Cute, quaint bakery/bar with a great amount of variety. Great spot for students who prefer to study outside of a library. I went with a few friends during the day and it was extremely quiet, hence a great environment to do work. I got the mango pastry which was not too sweet and not overly mango-tasting. It had a whipped consistency which made it delightful. My friend, who is obsessed with tiramisu, got the tiramisu slice and she devoured it!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YA8gaTQsjuOL87OhS-QWXw/168s.jpg", "caption": "Mango mousse cake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jZHQA8tpp1VM4-0rEsVVbg/168s.jpg", "caption": "Baklava"}]}}, {"review": {"des": "This place is fantastic! I came here on our first date for desert, a few times after for dinner/dessert, and just stopped in for a few pieces to take home. They have never disappointed. The location is perfect, the atmosphere is light/easy, and the food & coffee is the perfect end to a long day.<br><br>They let you pick any table where you want to sit, they provide great service, and the wait isn't long at all!", "pics": null}}, {"review": {"des": "Strawberry shortcake hit the spot. Tastes fresh, sweet, and balanced. It's like the square pieces of strawberry cake in the display at marianos, but 3x better (i like that marianos cake, but it was a miss 2/3 because it was frozen one time and super dry another). I will continue to come here for consistency and great flavor! The next one on my list is a cheesecake... <br><br>Haven't tried the food yet, but also planning on that in the future. I'll update my review as I go along!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/27rvrKAWEg0L9j-A-g4kog/348s.jpg", "caption": "Strawberry shortcake"}]}}, {"review": {"des": "I love Artopolis; I always try to find good authentic Frappes and this place did it for me. The staff is so nice and they are very attentive to the guests. I tend to hangout here because there is just a great vibe all around and you can get good drinks, food, and desserts. Get their baklava and a frappe, sit down, and have a good time.", "pics": null}}, {"review": {"des": "Definitely a fan of this place. <br><br>Andy N. decided to bring me here as my first foray into Chicago dining. We came here since he really likes this place, and we were both hungry for dinner. I ordered the artopolis dish (which is this pastry filled with various items). I got mine with chicken and mozzarella. I'll be honest, I didn't really get the mozzarella at all. Oh well. <br><br>We ended up getting two desserts to share - mango yogurt and almond baklava (based on yelp reviews). Definitely get the mango yogurt - so delicious. The baklava was good, but definitely the mango yogurt was better. <br><br>Service was decent, but I think the server didn't like the fact we didn't order drinks - oh well. <br><br>Overall, great time as my first meal in Chicago. <br><br>Protip: MANGO YOGURT.", "pics": null}}, {"review": {"des": "we came here as a suggestion from my niece...although it is a cafe with lunch/dinner options, we went for dessert and coffee...and it was a hit...as soon as we walked in the staff was friendly and attentive (which they maintained throughout our time there)...we ordered a few desserts to share and everything we ordered was delicious...definitely recommend their mousses and fruit tart...the inside decor and ambiance was very nice and welcoming...definitely a place we'll be revisiting", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pIe_2UWRtMfFbKz5p3KnvQ/168s.jpg", "caption": "Chai tea latte"}]}}, {"review": {"des": "Went for a quick, solitary lunch. Seemed like an okay place to do that. A stone's throw from UIC.<br><br>The spanakopita, or spinach artopitas, was the most heavenly, buttery, savory pastry I've had as of yet. It was also surprisingly filling for under $6. (I didn't get the additional salad.) The flaky croissant outsides melt just enough with the generous spinach and feta filling. Not overpowering or gluttonously buttery. Also pleasantly not messy to eat; it doesn't fall apart, but holds together well, which I find to be a problem with any croissant-type pastry for me.<br><br>Will be going back to try the other artopitas and pastries, but I might/will probably end up getting the spanakopita again.<br><br>There's a bakery counter, meal corner (?), and bar. Self-service until 3 p.m. Light, airy ambiance, with an upscale cafeteria style setting. You order and carry your food on a tray, but it still feels elegant.<br><br>There's a second floor balcony with tables, perfect for people-watching and people-talking.", "pics": null}}, {"review": {"des": "My all time go-to for dessert and small cakes place. Try their tiramisu and mousse. You can also order a whole tiramisu cake for special events and celebrations. Cafe environment is relaxing.", "pics": null}}]}