{"name": "avec-chicago", "reviews": [{"review": {"des": "Finally made it to Avec's Sunday brunch and it was well worth it. The first thing you notice when you walk is that the restaurant is so compact and wooded. The decor is really unique and has a good vibe going. The tables are mostly communal and there are a bunch of counter tables. Once seated you will see an Avec branded cloth napkin which I thought was a nice touch. <br><br>We had a group of four people and we opted for more variety. We decided to share everything and went with the: medjool dates, burrata toast, pork belly, papas bravas, lamb burger and the pizza. My favorites were definitely the medjool dates and the pork belly. They definitely hit the spot on flavor, taste and value. The medjool dates had a nice little kick and the dates were sweet. The mix of the two and the bacon on the side hits the spot. The pork belly had a nice honey flavor and was tender. The meat itself wasn't tooo fatty like some places. I think it had a perfect blend of both. <br><br>The burrata toast was pretty good but I'm not a big fan of burrata in general. The lamb burger was alright and had a strong gamey taste if you don't mind. The pizza was decent because it was cooked in a brick oven. The pizza had a nice zest to it.  The papas bravas was pretty standard and nothing major to write about. <br><br>I had the bender cocktail and it was really good and tasty. It didn't have a very strong alcohol taste and it was just smooth. Only thing is that it was kind of small. <br><br>The service was great, everyone was friendly and welcoming and fast! There is street parking all around. It is a little pricey at $4 an hour but you are in and out of the restaurant pretty fast. Highly recommended restaurant. Come early if you want a more chill experience. The restaurant filled up to capacity when we left around noon.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vQchgX-rTo1N6Md6SEJfHQ/348s.jpg", "caption": "lamb burger"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/72DrUfc2H-vXj4I8TaBOQQ/168s.jpg", "caption": "papas bravas"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/m4W52A02jmxH9bODVY5reg/168s.jpg", "caption": "pizza"}]}}, {"review": {"des": "First visit here, and can't wait to come back. Wanted to try the mussel dish, but they ran out. Came here on a Friday night with ~30min wait. This place was packed, but for good reason. <br><br>YAY:<br>- The famous medjool dates! A perfect combo of savory/sweet. Don't know anyone who's disliked this. Def the star of the show that night. <br>- Slow roasted pork shoulder was great. Perfectly seasoned and went well with the clams. <br>- Service was great. Our waters were always filled, and our server gave a perfect wine rec to go with the pork shoulder we ordered (a Portuguese wine I unfortunately can't recall). They were never pushy to make us leave, and we enjoyed our time comfortably.<br>- It was fall/winter so they coat checked for us right away while we waited. Appreciated this as the restaurant is quite small.<br><br>NAY: <br>- The Farro salad was okay. I guess I don't like grains with cauliflower. The grapes added a balancing sweetness though. Don't think I would order it again. <br><br>*Tips:<br>-In the cooler months, avoid the seating at the front to avoid the traffic of customers coming in/out, and any cold drafts coming in from the door", "pics": null}}, {"review": {"des": "Love the farro salad  <br>Okay small plate steak <br>But... pork shoulder is wayyyy toooo salty.. <br>too much salt....<br>And the drinks were meh-", "pics": null}}, {"review": {"des": "If I could give 6 stars, I would! I think this is the best meal I have had in Chicago since moving here. Chef Paul & Perry clearly knows what they're doing and are extremely inventive with each dish. <br><br>What surprised me the most was the value - this size of the portions and affordability of the wines. <br><br>We ordered a cheese board along with three dishes - the chicken schwarma, pork shoulder, and acorn squash/white bean dish. This was MORE than enough food for the three of us. We could have easily been satisfied with two dishes. Each dish was impeccably spiced and unique. Our favorite was the chicken dish which was a toasted pita, topped with hummus, roasted chicken and pomegranate seeds. The chicken was melt in your mouth level. <br><br>There are so many wines to choose from along with a nice selection of Belgian beers. <br><br>The venue is very chic and our water glasses were never empty. <br>Highly recommend booking reservations far in advance as it is a tight space. <br><br>Can't wait to come back!", "pics": null}}, {"review": {"des": "After a recommendation by a friend, I decided to end my Chicago vacation with a lunch at Avec. Boy, was I blown away! <br>Avec offers unique tapas style dishes with the freshest ingredients. As a mediterranean french fusion, It is savory but cleansing. 5 stars for its unique offerings and great service.<br><br>Service: Top notch! Make sure to get a reservation if possible, because the wait can be up to an hour, especially on weekends. The servers were attentive to my  needs, and refilled my water every time it was low. <br><br>Food: <br>Chorizo-stuffed Dates: MUST-get! Amazing blend of sweet dates and savory bacon/chorizo, topped with a spicy pepper-tomato sauce! I loved this innovative twist. This was the most memorable one for sure.<br>Lamb Burger: A good burger that was a bit heavy on the greek yogurt tahini sauce. It's refreshing with cucumbers and mint if that's what you're looking for. My boyfriend enjoyed it, but it was a little too tangy for my liking. <br>Charred Acorn Squash with cheakpea hummus and pita. It was a good and filling dish. The pita was a large portion. The hummus was smooth and I enjoyed the fusion with squash. Very filling and enjoyable mix.<br>A little sad that we didn't get to try the pork shoulder with clams. There were mixed reviews, but from looking at the tables next to us, this dish looked phenomenal. <br><br>Bottom line, I enjoyed the Chef's specialties and creative twist on all the dishes I ordered. Definitely a great choice to come with friends and share.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Tq-WB4jo2ZZOVhYgAjtU_Q/348s.jpg", "caption": "Acorn squash hummus w/ pita :)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Vm-wj__Y2cs85hFbWw9J0Q/168s.jpg", "caption": "Lamb burger with tahini sauce/cucumber/mint"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ErRJtPZW7UIEFUntkMUMiQ/168s.jpg", "caption": "Medjool Chorizo Stuffed Dates"}]}}, {"review": {"des": "Avec was hands down my best dining experience on my four day trip to Chicago. It was nice to have some darn good food amidst tons of typical run of the mill American food and pizza. <br><br>We tried many items on the menu but the two dishes that really stood out were the chorizo stuffed dates wrapped in bacon and the risotto-ish/paella-ish dish with duck (they used these thin noodles that soaked up all the sauce and was delicious). There were so many flavors and textures and the usage of spices was very liberal which I love! We also had the roasted chicken dish which was good but it didn't stand out at all. <br><br>Everything we got was way too salty (we drank sooo much water to compensate) but aside from that point, my experience at Avec could not have been better. The service was very friendly and I really wish I had room for dessert but the large plates were pretty sizeable. I definitely recommend this place if you're looking for a delicious meal and a upbeat and bustling dining environment.", "pics": null}}, {"review": {"des": "Been meaning to try this place for ages, as it often gets overlooked in the crowded West Loop. Came in for lunch on a Friday around 1:00 pm and can't find enough nice things to say.<br><br>Logistically, situated right next to Blackbird on Randolph, so a short walk / drive from most places. They take reservations through Reserve, but not for peak hours. Seating is communal, with probably ~40 spaces, and another ~15 at the counter, so keep that in mind if you're coming in a group. <br><br>Service was phenomenal- we waited maybe 10 or 15 mins and we're sat and greeted immediately. Our water glasses were always filled.<br><br>For lunch, we shared the Chorizo-Stuffed Dates and squash hummus, both of which are MUST HAVES. The dates were spicy and flavorful, served with bread that was soft and warm, complimenting the broth nicely. The hummus and \"pita\" was some of the best I've had, infused with butternut squash, a sweet/savory combo that worked really well.  We also got the broccoli tartine, which was good, though not great, and in retrospect probably would have opted for the Lamb Burger.<br><br>I couldn't have been more impressed with this place; I'll certainly be back and recommend you visit while you still csn. Can absolutely see this place getting \"starred\" this year, which will more than certainly spike it's notoriety. Great work!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VcTpfsRDyPEgohm5HM3ICQ/168s.jpg", "caption": "Chorizo-Stuffed Dates"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hsZzhMnQdBgm3IfdWkVTKQ/168s.jpg", "caption": "Butternut Squash Hummus"}]}}, {"review": {"des": "Surprised & delighted. Memorable meal where every bite was so good. Although it's small plates, if you like food, prepare to over eat. It's so good, you just keep going. Food isn't heavy. Small shared dining space with a cozy and warm atmosphere. Very attentive service. Highly recommend. If you can't get a reservation, it's worth the wait. Also, incredibly Gluten Free friendly.", "pics": null}}, {"review": {"des": "I will be back!!! Being a traveler who loves food and travels for food, I try to do some research of the city for food. I was glad that this place was recommended to me by someone who's local. Our party of four loved our meal even more so than Alinea. :p <br><br>Environment: it's a small cozy restaurant with not too many tables and bar seats. It's a communal table setting, so if you come with a smaller group, then most likely you will be sharing a table. There's some patio seats too.  <br><br>Service: our lady server(forgot her name) was excellent and very pleasant. She was very helpful and subtle on selecting the wine for us as well. <br><br>Food: for four of us, we ordered 6 items. It was way too much for us. I think we would be satisfied with just four entrees. <br><br>1. Chorizo stuff dates (5/5): def my one of my favorite dish and one of the best bacon wrapped dates in my life! Must get! The flavor of the dates and chorizo goes so well with bacon. The pepper tomato sauce was just so freaking amazing. Ahh. I want some more as I'm writing. <br><br>2. Focaccia(5/5): sooo yummy. Thinly sliced with taleggio, ricotta and truffle oil. It was so heavenly. We couldn't finish and we boxed this to go as a snack cuz it was that good! However, I still recommend to eat and finish there if you can. It doesn't taste the same after it's cold. <br><br>3 Chicken liver bruschetta (5/5): it was not gamy and it the flavor goes so well with mint. <br><br>4. Charred eggplant (4/5): the hummus and the bread was great. However, the eggplant was hard to cut through. I wish I came with smaller pieces. <br><br>5. Slow roasted pork shoulder(3/5): I can do without this dish. The pork shoulder didn't cook long enough. It was a bit tough and the flavor wasn't all in the pork. <br><br>6. Fideo paella with squid and prawn (3/5): our group didn't like this dish as much either. One thing being we were so full from all the bread prior. We prefer the traditional rice paella better. The flavor was just okay too. The duck confit paella looks yummy but it wasn't available that day. <br><br>Tips: they take reservation before 5pm only on the weekend. It gets packed so either come early or be ready to wait.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2UArOq4l2H2eOZGEAyVU-A/168s.jpg", "caption": "Chorizo - stuffed Medjool Dates(5/5)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MIpxNfrDgaG7UlEDKjq19w/168s.jpg", "caption": "Fideo paella with squid and prawn (3/5)"}]}}, {"review": {"des": "Very good meal at Avec. I came in late, sat at the bar, and had great service. The bartender/server was always around, very knowledgable about the menu, and helped with recommendations. <br><br>I started with the mushroom pappardelle. The pasta was cooked perfectly, there were tons of delicious mushrooms (I think maitake and others), cheese, and pine nuts I believe. This was my favorite dish of the night.<br><br>Next, I ordered the butchers steak. This came perfectly cooked, served with charred leek, a house-made sauce reminiscent of A1 (it was good), and peanuts (?? weird). Overall pretty good.<br><br>The last dish was a half order of the fideo \"paella\". This was served with duck confit, snail boudin, artichokes and fennel aioli. Large portion. The snail boudin was the best bite of the night. The confit was also done really well and was huge. There was shaved fennel within which was good, the aioli and artichokes were ok, the fideo was ok. I had trouble seeing this as a paella, but I get it. I could not finish this as it was huge (and I ordered a lot for one person). <br><br>Finished up with caramel cashew squares to go. These were decent, a nice sweet/savory snack that I took to go. But not amazing and I would skip next time. <br><br>Service was quick, dishes came out as they were ready, water cup was never empty.", "pics": null}}, {"review": {"des": "Came here around noon on a weekday. The restaurant was busy, but not full. We were seated on a long bench table next to another couple. I personally really dislike this type of seating since there's no privacy and less table space. My friend got the lamb burger ($14) and I got the charred eggplant sandwich ($13). To my surprise, when the charred eggplant sandwich arrived, it looked more like a hummus platter. There was a plate of hummus with eggplant and pickled cherries in the middle, served with pita bread. While it was delicious, it still wasn't what I was expecting. There was also way too little pita bread for the amount of hummus that they gave us. <br><br>For dessert, I ordered the affogato ($6) and the baked lavender yogurt ($8). Both were really delicious; the baked lavender yogurt tasted like sweet custard, but lighter. <br><br>I would definitely consider coming back for dinner; the service was fast and attentive and the food was good, despite the eggplant sandwich not being an actual sandwich.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IBNDirLqdQ6rTuWgj4C6Mw/168s.jpg", "caption": "Eggplant \"Sandwich\""}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xlbYaiuXvSxVZ3M4Dx9ebA/168s.jpg", "caption": "Affogato"}]}}, {"review": {"des": "My sisters and I had a really nice dinner at Avec. We had no reservations but were able to be seated at 6:30pm on a Saturday. The space is slightly cramped and you may find yourself sharing very close quarters with other parties.<br><br>Our most memorable dish here was the bacon wrapped dates around sausage. If I come back here, I will always order it. It's flavorful and just right. It's the perfect marriage between bacon and sausage! Next we moved on to the prosciutto avocado toast. I think what made this one delicious was the crispy bread and the prosciutto, which was another good combination. <br><br>The main course was the fideo paella with duck confit, artichokes, snail boudin, and fennel aioli. This was absolutely delicious and huge! Every bite was flavorful especially with the duck confit. I wanted to eat more but I was so stuffed after all the delicious appetizers! <br><br>Solid gourmet food and great customer service. We would be delighted to come back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/o-_qKc2QcarjNUXD4CJSug/348s.jpg", "caption": "Drool worthy bacon wrapped dates and sausage"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Zs5HcN1-rn2FwPWUuQlAIw/168s.jpg", "caption": "Prosciutto avocado toast"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WjOPyIGmRf2Myl6H3_-BUw/168s.jpg", "caption": "Paella"}]}}, {"review": {"des": "Came here for Sunday brunch and was not as \"wowed\" as I thought I would be.<br><br>I ordered the grilled chicken sandwich with the lentil salad. This was such a dissapointment. I was looking to eat something light and I figured I could get this. Once it came to the table it was pretty much this huge, huge piece of sourdough bread with little to almost no meat in it. I mean come on, I couldn't even eat the sandwich without a knife since the bread was that big. Please don't order this dish unless all you are craving is a large piece of bread and a mediocre amount of meat. <br><br>For the table we ordered the Chorizo Stuffed Dates! This dish was actually pretty incredible! The dates are at least two bite sizes, they are not too small! The pepper tomato sauce that it sits on was amazing and the flavors just blended great together. I also love how this dish comes with the bread. The bread is a great addition to this dish because once the dates are gone you can just dip the remaining bread onto the tasty sauce! <br><br>My boyfriend ordered a dish that is no longer on the menu (maybe they switch out menus often, not sure?). It was a dish with prawns and some sort of bread underneath the prawns. The prawns were not peeled, which made eating them that much harder. Also, there was not much else to eat with the prawns. The dish was topped with some grape tomatoes, onion, and arugula. Also, the prawns were just oddly sitting over this random piece of hard bread.<br><br>In our table the other two dishes that were ordered were the lamb burger and an avocado salad. Per their comments I came to the conclusion that they enjoyed the food, but nothing spectacular. <br><br>The service was okay. We were in and out quickly. Overall, this place was  just okay. However, I would probably return for those chorizo dates!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dGnQ006VD_Fr-AkTPOaTMw/348s.jpg", "caption": "Lamb burger"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ynvI8KJisxSaejJi6l4M4Q/168s.jpg", "caption": "Avocado Salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GAn6o4UecIRVWAHjWQUXnA/168s.jpg", "caption": "Prawn dish sitting on top of a hard piece of bread!"}]}}, {"review": {"des": "This was my first time dining and it will definitely not be the last. Came for a business lunch on a Thursday and sat outside as it was such a nice day! Avec really does have such a nice vibe about it. <br><br>For the food, our server told us that the standout dish that is ordered the most is the chorizo stuffed medjool dates wrapped in bacon and served in a delightful pepper-tomato sauce and some sourdough bread. We're so glad we listened and ordered this dish. It's amazing and we can totally see why it's ordered so much and raved about on yelp. I could eat 10 of them but that would leave no room to try anything else. <br><br>I also ordered the lamb burger which was also delicious and on point. I love lamb and it's something I really miss living in the US (generally so expensive to buy here! Much cheaper and better quality in Australia I feel) so I had to order it. I'm so glad I did - it was absolutely delightful. Surprising I also didn't leave feeling heavy with that weighed down feeling you can get after eating a big burger. I opted for the lentil salad on the side - a nice way to end the meal.<br><br>Overall the service was also fantastic. There was a strange incident in that our server kept asking if we would be splitting the burger even though I said multiple times I would be eating it myself. Maybe he was just trying to tactfully imply that I shouldn't be eating that much ...  in any case, I was super happy to have the delicious burger all to myself!<br><br>I can't wait to go back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0C6GEVuRMzdGgVb65Gl7SA/348s.jpg", "caption": "Outdoor seating flowers, spot the bee!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eI0V_lYYjMzRZi8sLon6-w/168s.jpg", "caption": "Chorizo - stuffed Medjool Dates - so good, just order it!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pmu7k_9yH1xPla7aq8d53Q/168s.jpg", "caption": "Lamb burger with lentil salad"}]}}, {"review": {"des": "We had a really great brunch here. Considering the location and the pedigree of the place, we were surprised that we were able to walk right in at around 1pm on a Sunday, but I'm so glad we did. We had a party of four and got the chorizo-stuffed (and bacon-wrapped) medjool dates, the shakshuka, the french toast, the papas bravas, and the squash blossom pizza. <br><br>It might sound dumb, but the papas bravas were probably my favorite dish -- they were so outstanding, I would have been down to order another one if we hadn't already gotten so much food. The french toast was also fantastic, and a little bit different than a typical french toast -- really fluffy, less drenched, and with some burnt ends. The group was crazy about the pizza as well, and maybe I'm just a pizza snob, but I thought the toppings were ahead of the pie itself. Of course, the dates were great as well, but bacon-wrapped anything is almost cheating -- I will say though, the pepper tomato sauce they came in was pretty great and really added something. The shakshuka was very good but I probably wouldn't feel a great need to order it again.<br><br>Overall, a really great brunch and I'd love to try dinner here as well.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/w8DrhW-A84u8pUXy4nOyhg/348s.jpg", "caption": "Brunch menu (7/29/2018)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ymvg2EN8um2t0WvX-2B9Yw/168s.jpg", "caption": "Chorizo - stuffed Medjool Dates"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aoqx8wEDNsHOsz488IMnYw/168s.jpg", "caption": "Shakshuka"}]}}, {"review": {"des": "Came here just by chance because of the rude service we received at La Josie! Read my review of it it's horrible. <br>Anyway we didn't have reservations and walked up to the hostess stand. She smiled and said, \"yes there's a table opening up soon and I can accommodate you\". Waited just 5 min and were seated. <br>We ordered cocktails and they were the bomb. Btw we ordered another round they were so good. We had some small plates of chorizo wrapped dates that were spectacular, a salad with roasted almonds and who knows what else but it was deeelish; and fresh roasted corn with goat cheese omg also good. <br>The place was super loud, fun, and just had such great energy. Most importantly the food was delicious and the service was spot on! <br>So glad we stumbled upon this place!", "pics": null}}, {"review": {"des": "Interesting set up. Just came here today with a friend for lunch and had a wonderful experience. <br><br>Not a very big space but the seating arrangement makes it easy to make new friends. Another plus is that there is plenty of parking!<br><br>I had the chorizo stuffed medjool dates and Felix focaccia with taleggio cheese. Both were amazing! The chorizo and dates wrapped in bacon were surprisingly very filling and the cheese in the focaccia had an explosion of flavor. You have to try it for yourself to see what I'm talking about! <br><br>We also enjoyed a bottle of wine, which helped us enjoy the meal in conversation. I will be back for more, but for now this place is an A+ in my book!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/U4k7W8ZqbuijNm0aZR3qaw/348s.jpg", "caption": "Outside on this bright sunny day!"}]}}, {"review": {"des": "This is probably one of my favorite restaurants in the city. My boyfriend and I like to go and sit on the counter to watch all the food being prepared and cooked. Our favorite dishes are the bacon-wrapped dates, paella and can't forget about the affogato for dessert. We normally end up spending an hour or more here just chatting and enjoying food. Avec is good for a nicer date night or a nicer dinner with friends. The tables are shared, though and it's a super small place. I would definitely recommend sitting at the counter if you're into that.", "pics": null}}, {"review": {"des": "Avec is becoming a favorite of mine in Chicago!<br><br>The food and service is great, there was a menu from 3 weeks ago when I was there and had different options than the current menu which was identical to my last meal there in April - go figure!<br><br>Food was great but the deserts were all terrible 0/5 on deserts", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TxuhGCvZWzTRuMVnHrYLlw/348s.jpg", "caption": "Cauliflower 5/5"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/N4QAYmpq15-cCQETeLfcTQ/168s.jpg", "caption": "Potatoes and avocado 5/5"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OiIuxdwmI1Rc0CIJzXIlqw/168s.jpg", "caption": "Ramps and Chilli pizza 3/5"}]}}, {"review": {"des": "Really cute shared plate restaurant with delicious flavors. A good friend of mine suggested we try this restaurant and we were not disappointed! <br><br>Make sure you make reservations as this place gets booked up pretty fast and the location is small. While the location is small, it does not feel small and cramped. <br><br>The service was great and our waiter was very helpful in helping us select our dishes and what wine we should have with our meal. The bacon wrapped dates we had were awesome! I have had them at some places where the dates were too small or the bacon was overdone - these were cooked just right. If you come here with a group, I strongly recommend getting a paella to share. The paella was cooked perfectly unlike some places that serve it on the dry side. <br><br>Already can't wait to go back!", "pics": null}}, {"review": {"des": "Caught brunch here two years ago. The food was good but I wasn't particularly impressed. The close proximity of the seating arrangements is off-putting. It's described as intimate but the setup was overstimulating and uncomfortable.", "pics": null}}, {"review": {"des": "Update v2: Just got back to the hotel. Changing the review to 4 stars because I looked down after getting out of the uber and realized I had a shashuka piss stain on my shorts. Suggestion to the restaurant: when packing food to go and pouring in a broth dish, maybe don't use a cardboard box?<br><br>We come to Avec every time we're in Chicago. Everytime we leave happy and full. The menu was updated, so the apple-pumpkin bread was off the menu (replaced by donuts). The service was very good (lots of water refills). The avocado toast wasn't as good as it used to be (it used to be amazing), but it was alright. The shashuka was delicious, although the cauliflower didn't do much for it (make sure to order it with a side of pita). The ramp pizza was also delicious. The dates were very good and the french toast was great with jam, cream, and a rich and creamy toast. The lamb burger was also very nice with a great tzaziki. The hummus plate was absolutely delicious. Lots of tahini in the hummus and the warm pita was great. Lots of really good food. <br><br>Fantastic apple-pumpkin bread with butter. <br>Stuffed dates are great. <br>Avocado toast and hummus are both good. <br>Burger was decent. <br>Steak was decent. <br>Short rib wasn't great.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7qQ-Gpyl2VcknUlqCbpYYw/348s.jpg", "caption": "Ramp pizza"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5htDJZX2CfXGpxgngqstnw/168s.jpg", "caption": "Lamb burger"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/G1tPC3siZb4QPOH4px3qPA/168s.jpg", "caption": "Avocado toast"}]}}, {"review": {"des": "came here for dinner without reservation on a saturday night at around 830pm and the wait was about 30 minutes.  had our table ready a little after 9pm.  space is quite tight and tables are communal style.<br>food was great, got a few smaller plates to share:<br>-chorizo stuffed dates: this is what they are known for, and everyone in our communal table raved about it, so we got an order with 4.  it was meaty, sweet, savory, spicy and delicious.  sauce was on point! <br>-Squid ink spaghetti with squid<br>-Focaccia with taleggio cheese: crispy flatbread stuffed with cheese in the center, light and comforting.<br>-butchered steak with shisito peppers and burnt eggplant purée: tender medium rare steak with nice earthy puree.<br><br>we were too stuffed for dessert, which is a bummer.  definitely a nice intimate place with homey and delicious food.", "pics": null}}, {"review": {"des": "Ambiance: very cozy and minimalistic. I had to share a table with other people due to the communal seating design. So keep this in mind if you are thinking of taking your date here for dinner. <br><br>Food: The bacon-wrapped-dates are a must!", "pics": null}}, {"review": {"des": "Went with 3 co-workers on a Saturday night. We shared greens, the grape leaves, lamb neck, and steak. Ordered olives as well but server forgot and brought them after our meal (should have been complimentary). We had an odd Spanish red to accompany the meal. Utterly bizarre wine list, but why not try something new eh ? Space has a total Scandinavian feel but it is marketed as a Mediterranean restaurant. For those of us with large appetites you will leave disappointed. Overall a good time was had.", "pics": null}}, {"review": {"des": "This review is an average of my impressions and my husband's. I would give it 2 stars but my husband would probably give it 4.5. I must admit, I'm not a very adventurous eater-so my options here were limited. My husband on the other hand would eat any and everything so if you're more like himself, you may find his 4.5 more representative. Overall, I found the ambience not ideal (their chairs are sooooo uncomfortable and they pack you in there). The food was overall soooo salty (and believe me I love salt so this says a lot) and overpowering. In my opinion (and my mother's) the only good thing there was the date dish. The mushroom pasta was decent but that's all I liked. However, my husband enjoyed the pork shoulder, so that is a dish to consider. <br><br>Overall, both of us said we preferred the Publican (owned by the same people) over this place. If you aren't adventurous and don't like salty foods/have hypertension, skip this place.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/E6686D32reTaYIOOFSDS1Q/168s.jpg", "caption": "Chorizo - stuffed Medjool Dates"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pKExnL7TOXtBKuRHaU5d4g/168s.jpg", "caption": "Slow Roasted Pork Shoulder"}]}}, {"review": {"des": "T H E    S T O R Y<br>I came here for a boozy Friday lunch. <br><br>T H E    G O O D<br>- small shared plates with big bold flavors.<br>- Paella is awesome, but super rich. We weren't able to finish all of it between the two of us. <br><br>T H E    B A D<br>I don't know if its fair to call them bad, but I did not enjoy the Bacon Wrapped Dates as much as other yelpers. Maybe they are just not my thing.<br><br>T H E    S T A R S<br>The only reason Avec didn't get 5 stars from me is because of the two things I ordered, I only liked one of them. Menu is somewhat limited, but I will definitely return to try more.", "pics": null}}, {"review": {"des": "Made a reservation for lunch on a Friday and we were seated right away. Seating was at large communal tables. Great service and staff was very attentive. Started with chorizo stuffed dates served with delicious bread. For lunch we shared the grilled prawns and fideo paella. Perfect amount for 3 people to share.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FaHoz8dgeToFs18XWZTG0g/348s.jpg", "caption": "Fideo paella with duck confit"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aqdxXpitd5HSRDe_A7h7Eg/168s.jpg", "caption": "Chorizo stuffed Medjool Dates"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aLaOsX-Jxf9xviGc_LkVbw/168s.jpg", "caption": "Pan con tomate with grilled prawns"}]}}, {"review": {"des": "I consider myself to be a foodie, so I feel like I am supposed to love Avec.   I don't though.  It is good, but not great and I do not plan to return.<br><br>I went with three work friends for a restaurant week lunch.  The kitchen was pretty backed up so lunch ended up lasting almost two hours (that wasn't quite the plan).<br><br>Three of us had the roasted carrot soup: it looked and smelled wonderful so I very excited to try it.  The excitement wasn't quite warranted.  The soup tasted pretty good but I was expecting more from the flavors.  One person had the quinoa tabbouleh, and she made a strange face after tasting it.  I'm guessing that meant she was not a fan.<br><br>The lamb burger was my entree and it was good, but I have had better elsewhere.  The pita with hummus also was good, but not special.  Finally, dessert was the panna cotta with poached pear and gingerbread crumbs.  Dessert was nice.  I give Avec credit for appropriate lunch portions, as we left full but not overstuffed.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ero3BbPtg95jVzNuQafMCA/348s.jpg", "caption": "Quinoa tabbouleh"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iOrsXHWtU_ueDir4H8dPRg/168s.jpg", "caption": "Panna cotta"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TMOOxHZMB0JQ4JaYvUqHWA/168s.jpg", "caption": "Lamb burger"}]}}, {"review": {"des": "My second visit to Avec - the first one being a while ago - and I regret having almost forgotten about this place all this time. Got a table seat without a reservation during prime-time with no wait, which was lucky. <br><br>The food was creative and tasted excellent. The highlight for me was the bacon-wrapped dates, and the salmon appetizer was cooked to perfection, but the other dishes were just as good. Will definitely go back to try more of the menu.<br><br>The cocktail list is short, but they are willing to improvise, and I was happy with the cocktail I ended up with.", "pics": null}}, {"review": {"des": "Dig into the hype of the bacon wrapped dates! There are many reviews on this dish and it's definitely worth every dollar. The combination of sweetness of the dates, saltiness of the bacon, and the savory notes of tomato from the broth defintely create a delicious bite.  <br><br>I followed up on the dates with a roasted squash which is very pleasant on the palate. It was very refreshing and very fresh as if it was from the farm to table. For the protein we opted for the butcher's steak which was both seasoned and cooked perfectly. We ended the dish with the paella. Although I dislike seafood, I love to order paella whenever I am at a high quality restaurant. The dish was pleasant and the highlight of the dish was definitely the flavors of the rice on the botton.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CpksoxvBbyPItAT8IEzgRA/168s.jpg", "caption": "Perfect bite."}]}}, {"review": {"des": "With almost 2,000 reviews, avec doesn't need another review, but it's just so. consistently. good. Plus, I have to post the photos I took somewhere.<br><br>Here are some of my favorites:<br>- chorizo-stuffed dates wrapped in bacon - If you don't get this, you are out of your mind. If you have had disappointing bacon wrapped dates elsewhere (looking at you cafe ba-ba-reeba), then you should definitely get this. The tomato sauce is insanely delicious, and the dates are so incredibly sweet and wonderful with the savory meats.<br>- wood oven baked pita w/ hummus - Super fluffy pita and ultra smooth hummus. Yes, I'm still talking about food, not corgi butts.<br>- pork belly - So fat and flavorful and perfectly glazed. an insane value for $7. Take notes, other west loop New American restaurants.<br>- butcher steak - This dish has a lot going on, but bottom line is if you are not full from everything else, this is a good one to throw in there to get you to the finish line.<br>- brioche donuts & chocolate hazelnutters - Heavenly.<br><br>On the other hand, I am not a big fan of the avocado toast (brunch item; it's literally one toast, big albeit), the paella, and the pork shoulder (very brothy and too cheesy). Although it's not Michelin rated like its sister on the same block, but it's no less delightful and worth it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hbyuWBxyZ_E3WjU8t0twSw/348s.jpg", "caption": "pork shoulder - extremely cheesy"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IsKP-ab_nXHUfGCfKEcSuQ/168s.jpg", "caption": "paella with confit chicken thigh"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Em1sjprJJ_WYG7j7f1qVwA/168s.jpg", "caption": "butcher's steak"}]}}, {"review": {"des": "Delicious!! We choose an outside table for our weeknight dinner. It's communal style seating, so we got close with our neighbors. The wine list is extensive and not too expensive for bottles. We got the focaccia and paella to share and WOW. The focaccia somehow was light and it was so good. It's definitely my favorite Chicago flatbread. The paella was so unique- Spanish slash French. The rice was so unique and tasty with the duck confit. We were stuffed but had to try the olive oil cake- so decadent. We will be back for sure to test other menu items!", "pics": null}}, {"review": {"des": "Got the paella, bacon dates and salad. Highly recommend all three. Honestly could've eaten rocks and been happy because I went on a bumble date and the guy turned out to be a real catch (even though he originally wanted to take me to portillos.) Claims to be a foodie and really proved it. Pulled the \"this was where my parents first ate when they moved here\" card and it worked- heart strings pulled. Go here and you won't regret it!", "pics": null}}, {"review": {"des": "Highly recommend the bacon wrapped. <br>Kind of disappointed with the pork shoulder. I liked the flavor, but the meat was too tough.", "pics": null}}, {"review": {"des": "I'm sure Antoine de Saint-Exupéry never tasted the iconic focaccia with taleggio cheese at AVEC. But you'd think the French author of The Little Prince was a regular who captured the spirit of the focaccia when he wrote, \"On ne voit bien qu'AVEC le cœur. L'essentiel est invisible pour les yeux.\" I translate this with my high school French as, \"We only see well with our heart. The important stuff is invisible to our eyes.\" The food looks good at AVEC, but each dish is inspired by someone's imagination, food memory, and playfulness. It comes from the heart.<br><br>AVEC is our favorite restaurant in Chicago and has been for a long time. We were very sad when they had a fire and closed for an extended period. I think the focaccia is the only thing that hasn't changed in all those years, but the restaurant remains fresh and exciting each time we go. When we hoist ourselves onto the stools at the bar, our dilemma is whether we should order our old favorites or try the new dishes. There is no right answer here. <br><br>Our favorites, besides the focaccia, are the dates, the brandade, the butcher steak and the beets. Did I mention the focaccia? Recently a cook at AVEC told us that if you have some focaccia left over, it is terrific the next morning for breakfast with a sunny side egg on top. He was right.<br><br>Desserts are excellent too. The Nutterbutter is delicious. Last time, I loved the Tahini Ice Cream which tasted like a cross between a halvah bar from the deli, a slice of peanut butter pie, and an Italian semi freddo dessert.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/T1vuPlJdjZpyBZWM822h6Q/348s.jpg", "caption": "Halvah Ice Cream"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Tw7pbu_l6vxRjsw4Eti4Hw/168s.jpg", "caption": "Octopus"}]}}, {"review": {"des": "Finally got a chance to try out this highly recommended restaurant and it did not disappoint. We had a lunch reservation and ordered a few items to share. The chorizo stuffed dates stole the show! It was deliciously prepared and has a kick to it. The service was attentive and the ambiance is comforting and contemporary. I would recommend a seat outside when it's nice weather! The price for the quantity of the food was a little higher than I would have liked and the beverages are overpriced too. But those are Chicago prices - would def come back for those chorizo dates!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DCxn2fzZjHDg2TZcnZ-l9A/348s.jpg", "caption": "Sweet potato salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-G7LSjp7NtfYt4D_qezFJw/168s.jpg", "caption": "Lamb burger"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Y_RkNzW0TTjtXggUzCES4Q/168s.jpg", "caption": "Chorizo stuffed dates"}]}}, {"review": {"des": "This is a nice place you'd want to go on a first date. It's small, uncomfortable to stay for too long (long communal tables and cramped seating), and very loud. But the food is great!<br><br>The menu is composed of small plates. 2-3 per person seems to be a good starting point if you're hangry or trying to share. We ended up trying the chorizo dates, a salad with roasted delicata squash, and a really tender steak with greens.<br><br>All the food was excellent. The steak was cooked perfectly and the salad was really fresh and crisp. The chorizo dates were probably the best dish we had: crispy bacon wrapped around sweet dates, giving way to spicy chorizo, all resting in a delicious tomato sauce with plenty of bread to dip on the side.<br><br>Overall, one of my favorite meals in Chicago. Come early or make a reservation, get cozy with your neighbors, and definitely order those dates.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XwvVBErGqyEnNlcntL5_GQ/168s.jpg", "caption": "Chorizo - stuffed Medjool Dates"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-BUeJbmPD4ZWzR-TUvw3Ow/168s.jpg", "caption": "Butcher's steak & squash"}]}}, {"review": {"des": "Food is so good. Seating is a little tough. If you're a big eater, this is a taps style dishes so make sure you're ready to spend some money while you're here. Great offering's, plenty of unique flavors since it's fusion. Great service as well.", "pics": null}}, {"review": {"des": "You know what they say about West Loop, it has the BEST food. Avec is no different. It was very busy and crowded on a Saturday at 6. Avec offers a very simplistic dining experience, with long communal wooden tables or bar seating. After being told the wait was going to be an hour, my friend and I sauntered off to a nearby distillery for drinks. It was a pleasant surprise when our table was ready in fifteen minutes instead of an hour. <br><br>After being seated at the bar, my friend and I ordered the bacon wrapped dates (a popular dish), which comes with chorizo and tomato sauce. We also had the brandade, which is kind of like a fish dip. The bacon wrapped dates were the best (and biggest) I've ever had. The sweet chorizo blended perfectly with the bacon and the date. The bread that came on the side was passable, since it was stale and tough to chew.<br><br>Even MORE bread came with the fish dish (who can complain about extra carbs, except my pants?). This was my favorite. The bread was buttery, toasted, and much more flavorful. It was the perfect vehicle for the brandade, which was also so creamy and delicious. The fish wasn't overpowering at all. <br><br>The total after tax and tip was $18.50 . I would highly recommend Avec and the dishes that I had. The wait may be long, but it is definitely worth it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5qCEWAcuJ8Px0IXundjfEw/168s.jpg", "caption": "Cod brandade"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/J9aGN9rGp2XGJNAo1POEtA/168s.jpg", "caption": "Bacon wrapped chorizo dates"}]}}, {"review": {"des": "Avec is expensive, it is trendy, and it is so good. Definitely not a place I can afford to visit on the regular, but a must-visit at least once. A meal there is an experience. Making a reservation is helpful, especially if you come in the evening. The place is clean and trendy, and the servers are very helpful and attentive. They do check large bags, which is convenient as much of the seating is across a long table. <br><br>I would say the best way to do Avec is to order several dishes and share. The paella for example is very large (and comes out extremely hot and aromatic), and definitely was enough for three people. We also ordered the salmon and a salad which were so fresh and delicious. The chorizo wit dates and bacon was so rich and flavorful, one of my favorite things we ate that night. Everything was plated beautifully, and the desserts were crazy good. We got the affogato and the panna cotta, and both were just the right amount of sweet. Their bar drinks are also beautiful and clearly made with care. <br><br>Avec provides an upscale dining experience that's worth the money in my opinion.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Pb9ZqqjUfcjj2TJ4POlhWQ/348s.jpg", "caption": "Panna cotta"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_sLK4M4D77BTSYIAYEwotw/168s.jpg", "caption": "Affogato"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/m2AkqEK2sh88tYgmgXG3MA/168s.jpg", "caption": "Wood oven paella"}]}}, {"review": {"des": "Great food, cool atmosphere and fantastic service! <br>If you are looking for different this is your place, but you leave knowing you'll go back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jCISPR9_CGqOT8e87d0eMQ/168s.jpg", "caption": "Bacon wrapped dates - MUST GET"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/k_KjDEIJkI1lubaX9LcGWA/168s.jpg", "caption": "Yogurt dessert"}]}}, {"review": {"des": "This is one of my all time favorite restaurants! I absolutely love this place. Last night I went for a very late dinner (around midnight) and we were the only ones left in the restaurant. They stop serving food at 1 am, but they told us to take our time. Our waitress and servers were so kind. We had the bacon wrapped dates,  an avocado and sweet potato salad, and the duck paella. I had their lemonade and my partner had an atomium beer. For dessert we shared the affogato. Everything was absolutely amazing. Gorgeous presentation, perfect flavor, and we didn't break the bank but still had a huge box of leftovers to take home. It's a great spot to get a high end dinner for a reasonable price (still not cheap, but for the quality and portions; it's fantastic).", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vjYjPY8DOIxAR4dwd7iKJA/168s.jpg", "caption": "Avocado and sweet potato salad!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Tzo9pbpnXw1xQ4CsXNL1dQ/168s.jpg", "caption": "Bacon wrapped dates!"}]}}, {"review": {"des": "If you are a foodie then this is the place. Awesome flavors and different combinations.  Loved every bite of everything that we ordered. Communal seating. Great service. I will go to Chicago again to satisfy my food cravings", "pics": null}}, {"review": {"des": "We went here coz it was recommended by Anthony Bourdain. Delicious food! Spot on service! Great high energy ambiance! Such reasonable prices!! No wonder this place is one of his faves in Chicago", "pics": null}}, {"review": {"des": "This review is based on very high expectations, as Anthony Bourdain listed Avec as one of his favorites in Chicago. Based on this and other recommendations, I am sad to admit I was slightly let down! Every dish was decent, but as other users have mentioned, TOO SALTY. (And I love salt!) The best dishes let the ingredients speak for themselves, but salt weighed down the dishes we had, which were: the Mushroom Pappardelle, Roasted Cauliflower & Paella with Confit Duck. <br><br>Such comfort-style dishes might do better to be slightly spaced out--but everything came at once. The effect was that all the dishes started to blend together a bit. Mushroom Pappardelle definitely was the favorite. One of us had the Deluxe Foccacia, which was tasty, but was listed as a 'large plate' and would have worked much better as smaller starter to share. After 1-2 pieces of salty truffle, you don't need more. Our server was friendly but did not do much to steer us towards suggestions or describe the dishes in any way. <br><br>Cocktails were yummy. Seating, as others have mentioned is shared tables and hard seats. Did not order everyone's favorite bacon-wrapped dates. Would want to give this place one more shot, and ideally want a better memory than a haze of truffle and salt!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bO3TgX8SiYagPtUdbf_VzA/348s.jpg", "caption": "Paella with Duck Confit."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KeHCK9CRL4KQ5_vknx-4eQ/168s.jpg", "caption": "Mushroom Pappardelle. Delicious but a tad salty."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Fbamvwlhs2VeC2TX3cVuIg/168s.jpg", "caption": "Roasted Cauliflower. They do 1/2 portions!"}]}}, {"review": {"des": "We just had one of the best dinners in the last few months at Avec.  2 glasses of red wine, roasted salmon, butcher's steak, and chorizo-stuffed dates (all small plates) followed by milk chocolate gelato, hazelnut nutter..something???, and shots of Metric espresso ...all to die for and reasonably priced at $98 + gratuity.  Can't wait to come back.<br><br>******<br>Since my first review, my wife and I have been back multiple times with family and friends.  Avec has become a family staple and a place where we take our out of town guests.  Seth, Sandra, Ejilio, and the rest of the Avec staff make it even more special.  Love this place!!!", "pics": null}}, {"review": {"des": "Dates and mussels are must haves. I am a huge pizza fan and personally was not a fan of the pizza- the duck egg was too overwhelming for me taste/texture wise. The cauliflower was a bit too strong in the tomato taste in such that I couldn't taste the rest of the dish. Avocado salad was yummy! Favorite were mussels and dates!", "pics": null}}, {"review": {"des": "Majority of my vacations are foodcations. I am full for most of the day so I only came here for one dish: chorizo-stuffed medjool dates! Everybody raves about it so I had to try it. It comes with 4 dates and a slice of bread. Everything about the dates taste very good! If you love bacon, don't even hesitate. Order it. It's mildly spicy. Must eat the dates with the sauce! Use that bread and soak up that sauce! It's amazing! <br><br>Found out from the server that the items on the menu changes up quite often. This dish in particular is the only one that's been on the menu for 14 years. That tells you how much people love this dish!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xCF5OicVi3U3iQJ26VR0yQ/348s.jpg", "caption": "Chorizo - stuffed Medjool Dates"}]}}, {"review": {"des": "I've had Avec bookmarked for the longest time; it was recommended by many friends, but I never made an effort to come because I didn't want to deal with the wait. <br><br>I came to Chicago on my own one weekend and decided to take advantage and have a solo dinner at Avec. Best idea ever. I walked in and was immediately seated at the bar. I ordered the honeycrisp apple and pole bean salad (btw honeycrisp apples put all apples to shame). At first when the dish came out I was a bit disappointed by how small it was, but don't let size fool you. The dish packed flavor and creativity. My favorite part of the dish was the fried lentils. I was so blown away by the lentils, the server gave me an entire cup of them. I call that 5 star service. I definitely recommend the pole salad if you want something light and refreshing. <br><br>I got a half order of the chorizo-stuffed dates and let me tell you, this is a MUST order. The dates are sweet and the spiciness of the chorizo and tomato sauce balances it out. OMG. YES. <br><br>I highly recommend Avec. I need to come with more people next time so I can order more dishes. I'll say it's worth the wait.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vA6SzCunzM7gVlLNsVYzFg/348s.jpg", "caption": "Half-oder of chorizo-stuffed medjool dates."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nFJcVxuKFkVkjSrqM7XVzg/168s.jpg", "caption": "Menu on 9/30/17"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jKEs5zadG7PDXYsWPkUjJA/168s.jpg", "caption": "Honeycrisp apple & pole bean salad"}]}}, {"review": {"des": "Spectacular. The food here is packed with flavor and the chef is so creative.  I have eaten here over 8 times and I'm consistently blown away.", "pics": null}}, {"review": {"des": "A wonderful food tasting frenzy, but I felt a bit claustrophobic at times.  <br><br>Very simple design and layout.  I felt a tad bit uncomfortable sitting at the bar area with my purse that kept hitting the man who was sitting next to me.  It was pretty crowded.  I came in for the CRW and the food as a whole was fantastic.  I was able to sample their olives, roasted squash, bacon wrapped dates, paella and the panna cotta.  The best dish by far was the roasted squash. I love when chefs are able to make me excited about something I normally wouldn't be.  I mean, come on.  It's just squash, right? But it's squash with stracciatella cheese, pickled onions, smoked chili and almond pesto.  Somehow it worked so well together.  The dates were great, especially if you're really into the salty sweet combo.  Me, though? It was all about that squash.  The paella was decent but I found it to be a tad mushy for my liking.  It did have that socarrat on the bottom and the different seafood and sausage items were all top notch.  I also didn't care too much for the panna cotta which came with a gingerbread crumble.  It tasted like the cookie had already been placed on top of the panna cotta for quite some time because it had that fridge taste and was more stale tasting than crunchy.  Not sure if that's what they were going for or they just had to prep a lot of these little suckers for CRW.<br><br>Finally, the service was a bit slow.  It was about 15-20 mins of waiting between courses, which would be fine, but I was dining alone.  And because I don't generally play with my phone when I'm alone, I was literally just staring at the tan wall in front of me watching the employees uncomfortably squeeze past each other.  I wonder what's on Facebook... *picks up phone*", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5Z2QiHAtcAiVvEsw6ExZHQ/348s.jpg", "caption": "CRW 2018- marinated olives, roasted squash, chorizo stuffed dates, paella, and panna cotta : squash was the best"}]}}, {"review": {"des": "Came here for lunch and ordered the lamb burger along with chorizo bacon wrapped dates. The lamb burger was surprisingly not too game-y and juicy. It came with your choice of chips or salad and I opted for the salad for some freshness. Just had Au Cheval the night before and when comparing the two the lamb burger is definitely lighter and not as dense or rich. Also...fair price cha ching!<br><br>Cousin got the pork shoulder which he said was pretty good as well, though I didn't try any of it so can't comment too much on its flavors.", "pics": null}}, {"review": {"des": "We stopped into Avec for restaurant week.<br><br>We came on a cold Thursday at 5pm and there was no wait - we were seated right away. The communal seating is interesting; I can't decide if I'm a fan, as the people on the end end up getting up to let people in and out.<br><br>The service was impressive - once again another place that replaces dishes, as they don't want your sauces to run together. If you've read my other reviews, you know I love when restaurants take care of the customer experience like that. Waters were also promptly refilled and they timed our dishes so at all times there was a dish on the table. Little to no waiting here between courses, I love it!<br><br>The food was great! I loved the way the restaurant week menu was laid out. We started with olives and bread. There were a mix of olives and all had a slightly different taste to them. Paired with the bread, it cut some of the saltiness.<br><br>The next course, the roasted delicata squash, had a bunch of different flavors going on. The squash was well seasoned and paired with both the cheese and herbs gave it a unique flavor. <br><br>The Chorizo-stuffed dates - DAMN! We decided we're going to come back just for this dish. It's fatty, salty, sweet, and a little spicy. We used the bread to clean the plate.<br><br>Wood oven paella - sorry to say we were too full to eat this and took it to go.<br><br>The creme fraiche panna cotta was light and refreshing. It felt almost like a deconstructed pie? It was a great ending to the meal.<br><br>I will be back again, Avec. You have me at Chorizo-stuffed dates :).", "pics": null}}, {"review": {"des": "This is one of those places that thrives on less is more.<br>Like everything French, it is not cheap, but well worth the money. More importantly, it is well worth sharing a room the size of a large bathroom with 49 other people, all competing for oxygen.<br>The menu is very slim, which has allowed the chefs to master it's elements.<br>My favorite is the Daurade (Sea bream), with less salt. <br>I will also recommend the pork shoulder.", "pics": null}}, {"review": {"des": "Really delicious. I had been meaning to come to Avec for a long time, and I finally made it to Chicago for a long weekend and had the time to give it a try. <br><br>I think really the only fault of this restaurant is just how cramped it is. We had a party of 5 and the waitstaff kept bumping into us, and there's a cabinet in the corner that kept getting in the way. Maybe it's time to expand, haha.<br><br>Despite the cramped conditions, all the food was on point. And I mean all of it. Some of our favorites:<br>- Wood Oven Paella: the prawns were delicious and the rice was perfectly cooked.<br>- Chorizo-stuffed bacon-covered medjool dates: a perfect mix of flavors, and probably the best bite we had the entire meal.<br>- Whole-roasted pork shoulder with littleneck clams: Definitely on the the greasier side, but unbelievably tasty, and if you ask for some extra bread, you can soak up all the rich drippings and stock. Hoo-wee.<br><br>Overall, the service was very friendly and helpful with recommendations. The prices were about on par with the area, likely a little bit more on the expensive side. However, the dishes were all delicious and well-executed, so at least you know you'll be getting a quality meal.<br><br>While this might not be the best place for a large group, the food at Avec is outstanding, so it's worth a try for a date or small group. If you're in the West Loop area, definitely give it a shot.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5MnP9Al_jM9TgQEeELohPA/168s.jpg", "caption": "burrata"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HJdTt9ZhZoDotwduxHZsoQ/168s.jpg", "caption": "chorizo stuffed medjool dates"}]}}, {"review": {"des": "How have I never reviewed this place? It's amazing - one of my favorite restaurants in Chicago.<br><br>They have an extensive wine list, which changes often, similar to the menu. Some staples that you can never go wrong with, however: bacon-wrapped dates, the butcher's steak, and the pork shoulder.<br><br>Service is always impeccable and the food is to die for. I've never been disappointed. I no longer live in Chicago, but this is a must-stop every time I'm back in town.<br><br>They take very limited reservations, so expect a mild wait if you show up at a busy time.", "pics": null}}, {"review": {"des": "There is no doubt that you're going to have your selection of fine restaurants here in Chicago. From Michelin star restaurants to new startups, you're going to find yourself with a wonderful culinary experience.<br><br>Plan ahead, is my suggestion. Avec is slightly off the beaten path but they are bustling. Make a reservation a week in advance and you won't be sorry. Start off with the chorizo-stuffed medjool dates that is this wonderful combination of sweet, savory and spicy. The lamb burger is beautiful and the paella... well you MUST share that. <br><br>This is definitely a must try. Definitely a James Beard worthy restaurant! Get in before you're booking months in advance!", "pics": null}}, {"review": {"des": "No thank you.  With all the options in Chicago I have no idea why anyone would go here.  The carrot soup is the only edible dish getting the stars.  Other than that IT WAS JUST NOT GOOD.  even the bottle of wine wasn't good.  At least it was cheap.  Waiter wasn't interested in his job.  He was interested in talking to other workers. <br>THe paella was gross.  The ramen noodles were gross, over cooked.   I was pretty excited going there based on other reviews but it just missed the mark for me.", "pics": null}}, {"review": {"des": "A friend recommended this place so I made reservations early, which I am glad I did because the place isn't really big and it filled up quickly.  <br><br>We ordered the papa brava, pork shoulder and the butcher steak dish. <br><br>Papa Brava- the sauce was amazing! <br><br>Pork shoulder -  clams were a little too small, but the meat was cooked perfectly!   It was so soft and pieces just fell of when you went to grab it. This dish is very filling so share! <br><br>Steak -  lots of flavor and was cooked perfectly!", "pics": null}}, {"review": {"des": "Believe the hype, folks. This place is terrific.<br><br>We came here on a Saturday night during prime time (around 730) and were still -- unbelievably -- able to get two seats at the bar. Our bartender was incredibly friendly and seemed to be knowledgeable about the menu, so we followed his advice. The first dish, a sweet potato and avocado salad, was rich and almost meaty, and actually wound up being my favorite dish of the night despite the fact that I tend to be a meat and potatoes type of guy.<br><br>The chorizo stuffed bacon wrapped dates are a must try as well. Those on their own are fantastic, but make sure you make time to dip the crusty on the outside and fluffy inside bread into some of the delightfully spicy pepper tomato sauce that the dish comes in. You will not be disappointed, as it's almost like getting a second dish to accompany the dates.<br><br>The only meh part of the night was the whitefish pizza, which was still better than most dishes on most menus across the city, but seemed to be lacking...something, I can't tell what though. A minor blemish that didn't detract from the overall quality of the meal, which was stellar. <br><br>Also, make sure you save room for dessert. The chocolate hazelnutters are something I'm going to be dreaming about until we return to Avec, delightfully sweet and rich and crunchy and delicious. Likewise, the espresso drenched affogato was quite delightful, a wonderful end to an incredibly delicious meal. The wood paneled, dimly lit dining room creates the perfect atmosphere in which to enjoy a meal. In an area cluttered with great places to grab a bite to eat, Avec stands out, and I'd recommend getting there sooner rather than later.", "pics": null}}, {"review": {"des": "4.3<br>Month: May 2018<br>Day and time: Wednesday lunchtime<br><br>Food: 4-5 stars<br>We had half plates of the avocado salad and the werp farm greens, a full plate of the medjool dates, and the pork sandwich. The dates were the star of the show, stuffed with chorizo, wrapped in bacon, and placed in a shallow pool of piquillo pepper sauce. The meat was juicy and the balance of textures - the crumbly chorizo and the chewy bacon - made every mouthful interesting, while the sweetness of the dates was subdued and complementary. The avocado salad came with sweet potato and was tossed in a moreish garlic toum. The half plate is more than filling enough. I found the large leaves in the greens salad a little tricky to eat, but the almonds and strawberries worked well together. Both the ciabatta and the pork were generously-served.<br><br>Setting & Atmosphere: 4-5 stars<br>I'm a big fan of Avec's clean wood interior, but the restaurant can feel a little pokey at times. However, we arrived early to find it almost empty and the sliding doors pulled fully open. The sun broke in beautifully, and there was a stillness that suited a casual weekday lunch.<br><br>Drink: n/a<br>We ordered simply.<br><br>Service: 4 stars<br>With the restaurant yet to fill up, we had prompt service and helpful guidance on how much to order. We were in and out in 45 minutes.<br><br>Value: 4 stars<br>$60 for what turned out to be three medium-sized dishes and one large one was great value, and we arguably ate more than we needed. West Loop has several affordable lavish lunches, and Avec provides one of the best. <br><br>Return: Yes<br>This must be the third or fourth time I've been to Avec, and I've found myself on a journey from skeptic to believer. Each time I go, I have a better experience. My initial qualms were with the menu - I'm still rarely excited when I scan down - and with the portion sizes, which I felt were too small. I now choose plates by choosing ingredients that appeal, even if the dish as a whole doesn't excite. More often than not, said ingredient comes in an ingenious coupling that rises above my expectations. Quantity concerns have been dispelled. There would not have been complaints had we ordered the full plate of avocado salad and the half came out.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/W8VDUQGMN3K5depTs0D0Rw/348s.jpg", "caption": "Werp farm greens with almonds and strawberries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/I6peKy8VuSKw5deSlq4ISw/168s.jpg", "caption": "Avocado salad with sweet potatoes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oRtwNg9WWDAbyre9t9cl2w/168s.jpg", "caption": "Dates wrapped in bacon and stuffed with chorizo"}]}}, {"review": {"des": "This is one of my absolute favorite restaurants in Chicago.  I'm blown away by the food every single time I come.  <br><br>The food is Mediterranean/French/American fusion, and small-plates style.  Things are very shareable and the menu changes weekly.<br><br>Their chorizo stuffed dates are truly some of the best I've ever had, and I try to order them every time.  They have delicious tartines, salads, fish plates and so many other yummy snacks.  I've never had the burger but it always looks incredible as well.<br><br>Flavors are inventive, fresh, unique and so delicious.  I can honestly say I've never had anything here that I didn't absolutely love.  I like bringing  out-of-town guests here but it's just as fun as a go-to lunch spot if you have time to sit down for a little while.<br><br>The style of the restaurant itself is fun and unique too. There's basically just one long shared table down the middle and a long bar that you can sit at. It's not very big so there can be a wait, but I've been lucky with my timing and never had to wait long.<br><br>Can't say enough good things about Avec, just go there! You won't regret it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1E7wsCCJ9Zl14LjLmGm-Jw/348s.jpg", "caption": "Werp greens salad. Marcona almonds, blackberries, and endives. Yum"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SGGlIpdWRopRQiN6HOQx7A/168s.jpg", "caption": "The famous chorizo stuffed dates in spicy red pepper sauce. These are to die for."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CUTvpHR50hyhfLNmKXXdbA/168s.jpg", "caption": "Half a salmon tartine with mint, radishes and other yummy toppings. Side of lentils with mint and tomatoes. Delicious!!"}]}}, {"review": {"des": "The ambience is great. We really enjoyed the little hut-in-the-woods dining experience. The food, on the other hand, has much left to be desired. <br><br>Portion part: Brunch menus are divided into small and large plates. Our server recommends one large plate or two small plates for each diner, which turns out to be way too much. Most tables of two either order one large plate to share and a small plate of toast or salad, or two small meat plates.<br><br>Tortilla espagnole is our least favorite dish on the table. We don't quite understand why avec like eggs so much that it seems half of the dishes come with eggs in one way or another.<br><br>White fish pizza is too rich and oily. I mean, if you were to put several soft boiled eggs on top of a pizza, you should better reduce your portion of cheese and olive oil a little bit. It would probably be a good choice for frozen food though. <br><br>That being said, I would give a 4 star if we had only ordered lamb burger. It tastes awesome. Lamb meat layered with a tinkle of mint and cucumber balances the rich flavor of meat well with a fresh mouthy taste.<br><br>Love the design of the menu though.", "pics": null}}, {"review": {"des": "As it's Chef Stephanie Izard's favorite restaurant in Chicago, I thought it'd be appropriate to come here for dinner after work at Girl & the Goat. I came on a Monday night around 9PM after my friend got us reservations here!<br><br>Sometimes, I recommend to not look up a restaurant on Yelp or Google and just go through straight word-of-mouth as I'd rather trust a friend's word over a stranger's. I'm not a stranger though, I'm your friend!! So trust me when I give the following review.<br><br>Impressions - <br>Interior: it's pretty small with a narrow, long seating area. The bar is on the left and is pretty small with a pretty big wine choice selections along with the usual choice of drinks at a regular bar. The right side consists of the tables for the guests and it can be either communal or private seatings. Perfect for small parties of close friends and/or family, as well as that date you've always to go on with that crush from the coffee shop or a special anniversary. Overall, it's a nice, cozy restaurant with wood finishes and soft lighting!<br><br>Food: Oh my gosh, right off the bat, the food was amazing. We ordered the Chorizo-stuffed Medjool Dates with bacon and piquillo pepper-tomato sauce. It comes with a toasted sourdough French bread.<br><br>At first impression, I was like okay, it looks like it's cooked right, but to be honest, looks like regular meatballs. It came with 4 dates.<br><br>The chorizo filling was juicy and has a barbeque flavor while the bacon was crispy, chewy, smokey, and the fatty texture gave the chorizo filling a nice boost of savoriness. The pepper-tomato sauce had a spicy kick to it which gradually builds up, but not overwhelming which balances out the fattiness from the bacon itself. The dates were grilled with a nice charred exterior which made it sweet. The sourdough bread was toasted nice and I used it to scoop up the tomato sauce. This dish had the elements of sweet, salty, and umami. Awesome.<br><br>Next was the Roasted Butcher's Steak (hanger steak) with charred leeks, black garlic romesco, and Spanish peanuts.<br><br>The steak was cooked to a medium-rare. (If you can't eat medium-rare, make sure to tell the waiter how you like it done!) It was seasoned nicely and tender which is to be expected from a tender cut of meat. The leeks were charred which brought out the sweetness of the vegetable and gave it a nice charred-crunch. The black garlic romesco was a nice sauce to pair with the steak as it was savory and bitter. The peanuts gave the dish a natural saltiness while also giving a nice crunchy texture. Overall, a nice dish. Not the best though.<br><br>Finally, the whole roasted fish (Porgy fish which comes from the Bass family) with poached shrimp, fingerling potatoes, radish, dill and lait fermenté.<br><br>The Porgy had a somewhat strong fish taste for a bass and was seasoned nicely where the skin was crispy and salty. The lait fermenté balanced out the saltiness with its light, creamy sauce while the earthy flavor of the dill was a classic pairing with the fish. The radish and endives gave it a nice crunchy texture, as well as a freshness and the natural bitterness of the radish and endives, cut through the fattiness of the sauce and fish. The acidity of the bite-sized pickles also balanced out the fattiness of the sauce and fish while bringing out the umami of the fish and dill. Pretty solid as it hits major palate points in your mouth!<br><br>Overall, the experience at Avec was pleasant as the vibes were chill and mellow, but had a sort of uplifted spirit in the room. I'd definitely come again just for the dates! They were literally to die for.", "pics": null}}, {"review": {"des": "Love love love it here! The food is undeniably good, it's hard to beat. I'm usually not impressed by many vegetable dishes most restaurants serve, but Avec's charred cabbage dish was my favorite of the night. It was beautifully presented and the cabbage was juicy with a hint of sweetness. It was the most creative vegetable dish I've ever tried, and there were just layers and layers of flavor incorporated into each bite. Some bites I got a burst of tartness from the fresh cherries, others I got a crunch from the spiced walnuts. I loved that each bite tasted different from the last. And I also loved that they incorporated quinoa into the dish for a more substantial feel. <br><br>Another must get item is their chorizo-stuffed medjool dates. I have a weakness for chorizo anything so this one was a clear winner. It was sweet, salty and a little spicy from the piquillo pepper-tomato sauce. Start any meal with this and you're guaranteed a good time!<br><br>The restaurant is long and narrow with communal seating, so be prepared to get cozy with your neighbors. And during peak times, it gets super loud.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NvCVww21F0xTgoWnAXs8-w/348s.jpg", "caption": "Roasted whole fish"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/26DQdXyUh1wpKwt4hxW89Q/168s.jpg", "caption": "medjool dates"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uiaQRHdHguA7wxTsMjF0DA/168s.jpg", "caption": "Charred cabbage"}]}}, {"review": {"des": "I made a reservation for an early dinner while I was on my way home from work and ended up being very happy with my decision. Though you sit closely together, the decor makes this place feel open and airy. <br><br>I ordered a glass of wine. It's definitely right for the price. They give you a 250 ml carafe for the price most charge for a regular glass pour. The people working behind the bar were giving great suggestions to people looking to try a new wine.<br><br>While I think this place would be amazing for small groups to order and share, I was dining alone and opted for a small plate - the hand cut pappardelle with mushroom bolognese. It was very tasty, perhaps a little salty but I like salt, and a great portion for being a small plate.<br><br>After I finished, I sat around for bit finishing my wine and never felt rushed out. I ended up ordering the coffee gelato, which had great coffee flavor abs was nice and smooth.<br><br>Overall, I liked my experience here. The food I ordered was delicious and everything being served around me looked great, too. I was able to relax and take my time and had great service during my meal. I especially appreciated how attentive the barback was with refilling water. I can't wait to come back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zNFERcpNAjVniAO7FIpbkg/348s.jpg", "caption": "Coffee gelato."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KZoXi_pD2bv1oVMwY7XBjg/168s.jpg", "caption": "Hand cut pappardelle with mushroom bolognese and pine nuts."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Hqkkdrh_Bh06TsbXUoDtMA/168s.jpg", "caption": "Wine is served in a 250 ml carafe"}]}}, {"review": {"des": "Favorite restaurant in Chicago. Those bacon wrapped chorizo stuffed dates are the Helen of Troy of small plates; wars have been started over them. Best food (consistently over the years) you can get with a casual and unpretentious unstuffy atmosphere. Can't say enough good things.", "pics": null}}, {"review": {"des": "Went to Avec for an impromptu lunch and didn't have much time to read the reviews about the place or the food. So we decided to order the famous bacon wrapped dates and get both the entrees on the menu - paella and mussels. <br>The dates were mind-blowing. You could tell that the the chef understood flavors and combinations really well - salty, sweet, juicy, tangy, bland... you name it and the flavor was in there! <br>I like mussels in general so this was an easy win for my palate. <br>Perhaps, my previous choices in paella haven't been that great because I've always ended up with loads of rice and less meat/fish. But not this time... the portions were accurate. The meat was a sizable chunk of the meal and well-cooked. In place of rice there was vermicelli that paired well with the rest of the dish.<br>Overall, I had an amazing experience and will definitely visit again!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1hSL_cv1N6QD6WOK6KQbPw/348s.jpg", "caption": "Chorizo - stuffed Medjool Dates"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/667sFpXsD2osKSoySL4s4w/168s.jpg", "caption": "Steamed mussels"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/C-Ka0E3tJ0lgkID_mENewQ/168s.jpg", "caption": "Paella - half portion"}]}}, {"review": {"des": "Food was fantastic (our server helped us with all gluten free selections and there were plenty!). Our fave was the grilled halloumi cheese with apple and kohlrabbi topped with crispy lentils. The sweet savory element topped with a roasted slight crunch from the lentils was perfect. The Serrano ham didn't look like much, but under the pile of ham we were pleasantly surprised to find a delicious treasure of pine nut miso, tangerines and mint. Again, a superb sweet savory combo. Unlike the other reviewers, I was expecting more from the chorizo dates. For me the chorizo way overpowered the dates, and this dish didn't stand out. Loved the affogato! Since we were dining gluten free, we swapped the donut gelato for the featured brown butter gelato and it was heavenly! Seating is communal, which is awkward for a party of 2. We opted for the bar and that was definitely the way to go. The atmosphere is lively, great music and good energy. We ordered a ton- 5 plates, drinks and 2 desserts all for about $100, not bad at all! If you are a foodie on a budget- go here!", "pics": null}}, {"review": {"des": "Food is good but service was subpar. Specially, our server Elizabeth B was dismissive and rude. I received a salad which was good. I was not feeling well and asked her if could kindly have my food to go. I heard her rudely talking to another server about how we wanted our food to go. She assertively put the check on the table before we got our main course. Then, someone else gave us our food and just put into bag without asking us if we wanted anything else. We spoke to the manager Cassandra Rodriguez who kindly listened to our concerns. The manager was very nice, but based on the servers I would not go back to Avec. The servers need to be more self aware of the clientele given that their tip is based on their service.", "pics": null}}, {"review": {"des": "Avec was delicious. I visited with my parents last weekend, and we overall loved the place - interesting flavors, wonderful service, great atmosphere. My only complaint (and the reason I'm not giving it 5 stars) is that a few of the dishes were excessively salty. We almost sent them back (and perhaps we should have). Here's what we ordered: <br>Rose Daquiri - Perfect. <br>Avocado Salad - rich and creamy to perfection. So many avocadoes with a complex dressing that was wonderful. <br>Dates - Parents loved 'em. <br>The delicata squash and the cauliflower were both tasty but many bites were so salty that we wrinkled our faces! I don't think it was intentional, but those were the two dishes that really left something to be desired. <br>My parents also had the lamb neck, which was fatty and fell off the bone. <br><br>We got in without a wait around 5:30pm on a Saturday night. Last three seats at the bar!", "pics": null}}, {"review": {"des": "We were seated a little early for our reservation and chose to sit at the bar instead of one of the shared tables. The chairs at the tables looked uncomfortable and were very low to the ground, and they certainly don't look suitable if you're taller than 6 feet. Unless you're sitting against the wall at one of these tables, you will not have a backrest. When we ate at the bar, it required staring straight at a blank wall 2 feet in front of our faces for the duration of the meal. I think no matter where you sit, Avec is simply not a comfortable or particularly welcoming restaurant. <br><br>Food:<br>Chorizo stuffed bacon wrapped dates - I can see why these get so much hype. They were absolutely delicious. But if I had one complaint it would be that they were not very hot when served. My guess is that these get ordered so often they make them in batches and you are at the mercy of the cook. The delicious hunk of bread they came with was piping hot, however. I think I would order this dish to myself and eat all four dates next time. <br><br>Salmon - The fish had a great crust and came with unique sauce. However, halfway through eating the salmon we found a massive hair embedded in the food that certainly was not one of ours. We politely pointed this out to a waitress and she offered to make us a fresh dish. When it came out again the thicker half of the salmon was under cooked. I certainly don't want my salmon dry, but this was raw. Perhaps the chef rushed it since it was a replacement dish. <br><br>Butcher's Steak - Very tasty dish, but a bit too random and unfocused. The spiced squash puree acted like a sauce for the steak and it was very good. The steak itself was tender and cooked a nice medium/medium-rare. And although the pomegranate was good, throwing that and pistachios on top of the steak just seemed out of place and random. It was like when you watch Chopped and someone just throws truffle oil on a dish at the end and all of the judges groan. <br><br>Drinks - I had a nice pilsner from France and my wife enjoyed her glass of French red wine. <br><br>Overall because of the inconsistency of the food (and the hair), and the overall lack of a welcoming environment I have to give Avec three stars. Certainly less than I was anticipating giving before my visit.", "pics": null}}, {"review": {"des": "We had a pretty nice dinner at Avec last night. It's not a very large space, and is dimly lit and simple inside. Because it was a Friday evening and we had no reservation, we waited outside in their little standing patio area and enjoyed a few tapas off the \"bar snacks\" menu and drinks. The anchovies were pretty good but the lavender almonds were divine. Definitely tried to stop myself from eating them all and failed lol. <br><br>When we were finally seated (we were told it was a 45 min wait but we only waited 25-30 min so that was nice) we ordered the chorizo stuffed mejdool dates (an Anthony Bourdain recommendation!), the slow roasted pork shoulder with clams and one of the cheeses. You could really taste the thought and care that went into each dish. My one complaint was that while the cheese and dates came out pretty quickly, it took foreeeever for us to get the pork shoulder. Still, it was delicious and worth the wait.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ta0k4y3AleqYMe4PDalNjw/168s.jpg", "caption": "Off the bar snacks menu"}]}}, {"review": {"des": "Service was amazing and their extended wine list is a plus. Their bubbly kir Yianni rose is bomb! loved the design and feel of the restaurant but I was a bit disappointed by the food. The paella didn't quite remind me of a paella, it seemed more like a hybrid of a dish. The patatas bravas and the French toast were probably my favorite. They were both good but not great.", "pics": null}}, {"review": {"des": "Finally made it here after a long time on the list.  Was perfect for an anniversary dinner, we enjoyed a spot at the bar where we had more privacy.  The food was spot on, especially the terrine - not usually a fan of these, but the couple next to us recommended it, and it was perfect.  Bar service was great as well.", "pics": null}}, {"review": {"des": "I came here for a late lunch and their dinner menu was out. It was around 4 so there wasn't that many people there but once we sat down a few minutes later it got super crowded. You have an option to sit at the bar or the communal tables and i chose the communal tables because it was the furthest away from the door and they had their windows open. It's a small space so it gets pretty cramped. You're also very close to the people sitting next to you so you're going to be cramped but you might also make new friends. A lot of the people I saw coming in were tourist so it's also a cool place if you want to be nosy and listen to other peoples conversations. <br><br>I ordered the beet salad, butchers steak, and paella to share. They had a lot of other dishes I wanted to order but I was just too full. We were given the beet salad first with apples, yogurt, dill, and lentils. It was really refreshing and a good appetizer to start off with. I noticed a lot of the dishes were really herb forwards and had a strong dill taste. The next item we received was the butcher steak with fave beans, celery walnut tapenade, and fresh horseradish. They were all small portions but they were very good. The paella dish however was very large. I don't know how I could have finished it if I wasn't sharing. The paella came with confit chicken, snail boudin, shrimp, and tangerine aioli. I loved the paella it was very delicious and had a great sear to it. Their wine list has no American wine but they have a lot of interesting choices.<br><br>I really loved going to Avec. The servers are very attentive of clearing the space since you don't have that much being a communal table. Although, the servers didn't keep pouring our wine it was alright since I assume the place was crowded they had a lot to deal with. Out water was never empty though so that's a good sign. The awkward part about being in a communal table is having everyone get up because you have to go to the restroom. It's better if you're in a bigger group asking friends to get up for you but asking as stranger makes it awkward especially since they have to get up again for you to get back to your seat. If you're going with a date I suggest you request the end of the table or sit at the bar.", "pics": null}}, {"review": {"des": "I visited this happening spot for the first time last night and was pleased by the hospitality and energy throughout the restaurant. I was greeted promptly and seated at the bar, and the hostess checked my overnight bag, as I had come straight from the office.<br><br>As I was dining for one, I enjoyed a glass of 2012 Katogi Averoff from Macedonia, along with a half order of the wood oven paella. The full order would have been far too much, as was evidenced by the groups of two sharing it around me. The wine was served quickly, which I enjoyed while taking in my surroundings.<br><br>The paella came out piping hot about 20 minutes after I placed my order; good things come to those who are patient. The crispy rice was topped with chicken thigh confit, two large shrimp covered with tangerine aioli and cilantro, and a halved snail boudin flanking the dish on either side. The proteins were cooked to perfection, and the flavors all melded together quite nicely. You bet that I devoured that entire plate!<br><br>The servers were quite attentive, refilling my water a few times without my prompting, and closing my check immediately upon request. I was in and out within an hour, despite how busy the floor was. I'm already looking forward to trying to rest of the tapas on the menu the next time I'm in town.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Lh3ZzSFlmXesufHXIoq7PQ/348s.jpg", "caption": "Half order of Wood Oven Paella with Chicken Thigh Confit, Shrimp, and Snail Boudin, topped with Tangerine Aioli and Cilantro"}]}}, {"review": {"des": "So let me get two things out of the way: first, it's loud at Avec. I wouldn't go there for an intimate, quiet first date because there's nothing about the way the space has been constructed that softens the acoustics. Second, the communal seating is efficient but ultimately uncomfortable. I appreciate that they manage to get a lot of folks in a relatively small space, but the seats are hard, hard, hard, and pity the person in the middle who has to go to the bathroom (think middle seat, airplane, flying coach).  I may be old school but I prefer my own table, or at least a communal table with soft, cushioned seats and more than a few inches of space between me and my neighbors. But despite all of this, Avec is packed and its because everything there is great-- especially the \"small plates\" (remember: it's Chicago. Even small plates here are ample.) Don't miss the sweet corn a la plancha with feta, or the potato and cod brandade (that bread, oh that bread!).  The fideo paella is also tasty- it comes with lots of fresh, tangy tomatoes, and delicious prawns and squid (it's also huge, so make sure you're ready to commit).  We had dinner for two - and a big bag of leftover paella - for about $60. Though our ears were ringing and out butts were sore, we were well fed and happy.", "pics": null}}, {"review": {"des": "The striper bass was mine blowing - crispy skin in a couscous with artichoke and lemon zest tasted a little like an original cerveci except it was served pipping hot!<br>For an appetizer I have cheeses a French cheese and Hillman American cheese that was very much like a Brie. These were served with bread, almonds, and thin slices of green apple.<br>The chef is clearly a cut above - strongly recommended!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BGN4zH1jIq12B0KWzIdoSg/348s.jpg", "caption": "Striped bass With cuscus and lemon zest and artichokes  Tastes like a Brazilian cerveci  Crispy skin was an added texture  Mind-blowing!!!"}]}}, {"review": {"des": "My friend likes this place a lot, so we checked it out. Good food and service. Sitting arrangement allows you to make friends if you want! We ordered the avocado salad, mushroom bolognese (small plates) and the Focaccia. We had the Croatian cheese with a red wine. Loved the ch", "pics": null}}, {"review": {"des": "Got the following: <br>1. Asparagus- as good as asparagus can get<br>2. Burrata Bruschetta- amazing <br>3. Salmon- good<br>4. Steak- standard <br>5. Dates- interesting<br>6. Hummus- great <br>7. Focaccia- big but yummy and light <br>8. Pork shoulder- amazing <br><br>Highlight of the meal was the burrata bruschetta and pork shoulder!", "pics": null}}, {"review": {"des": "Given the hype and popularity of this restaurant, the food is good enough but not mind-blowing. If only Yelp could do 3.5 stars! <br><br>We arrived at 5:30pm on a Saturday for the three of us, and even though we were told the wait would be 45 mins, we only waited for around 25 minutes or so. All the seats inside are communal, so space is a little tight and you will be sharing a table with other guests. <br><br>We ordered:<br>- Beet salad: roasted beets with yogurt and fried lentils. A refreshing starter, this was recommended by our waitress, but I could probably do without this dish. <br>- Chorizo-stuffed medjool dates: probably the highlight of the meal. It's like a really tender meatball that melts in your mouth, along with the sweetness from the dates. <br>- Paella (half-portioned) - the rice is very flavorsome and moist, but I didn't quite like the snail boudin (sausage). Pretty average dish. <br>- Pork shoulders: the meat is very tender, but halfway through there isn't enough sauce to moisten it up and it gets a little dry. I do love the broth that is cooked with fregola pasta, clams and peas. A pretty substantial portion for meat-lovers out there.  <br>- Chocolate rhubarb semifreddo: a rich, thick mousse covered in a chocolate shell. Not a bad dessert. <br><br>Overall a good experience, not sure if I would come back. But I know their focaccia bread (stuffed with cheese and truffle oil) is very popular, and if it weren't for the amount of food that we've already ordered, I would totally get that too!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vfHpQFLBXGPSMixv4cPLow/348s.jpg", "caption": "Beet salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7izjqogiSQ0C84vGAzu86A/168s.jpg", "caption": "Chocolate rhubarb semifreddo"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FSQ8JG4CloWQKcL1-VRrJw/168s.jpg", "caption": "Half portion paella (left), pork shoulders (right)"}]}}, {"review": {"des": "Delicious food and good cocktail. <br><br>The butcher steak and avocado salads were good to start with. I think the bacon wrapped dates is overrated.<br><br>The braised lamb neck was my favorite. It was served with Apple, fennel and hummus. Yummy! The roasted fish was not good at all.<br><br>The restaurant is really small. They do not check in lady's purse for liability reasons which was very annoying.", "pics": null}}, {"review": {"des": "Went here for a Friday lunch with my teammates from work. One of the girls like this place and she recommended it. The place has minimal interior and communal tables. So unless you have a big party you might end up sharing a table with someone else. Also, you might want to make a reservation before you go or check for the wait time coz it is packed and there is a reason for it. The food is delicious!! The atmosphere is amazing too, especially during summer. The service, I thought was a little slow, we had to wait for about 30 mins to get our food. <br><br>We ordered paella, salmon tartine, hummus and affogato for dessert. Paella was great tasting, so was the salmon tartine - the salmon was cooked beautifully. The hummus was okay, nothing special about it. The affogato was great too, its nothing new but it felt and tasted amazing at the time.<br><br>Though a bit pricy which you should expect from all restaurants in this area, it was a nice experience and I will go back if I get a chance.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-9OhbjUnWzpSfGnMy9WpTQ/348s.jpg", "caption": "Salmon tartine"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/s8AZrqnl1n1siN-94tcY_w/168s.jpg", "caption": "Hummus platter"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wvRBxU1Zg_pjLbLQV1Ppkw/168s.jpg", "caption": "Wood Oven Paella With Confit Chicken"}]}}, {"review": {"des": "Really delicious lunch-sweet potato salad & salmon with brussels sprouts & plum dessert!  The flavors are incredible! Highly recommend this west loop gem!  Cannot wait to go back for dinner & try the wine!", "pics": null}}, {"review": {"des": "Salt cod with olive oil paired with bread and the bacon wrapped chorizo dates were all we got. Plus a drink and we were stuffed. Shared a panna cotta for dessert.<br><br>I was surprised that between the two of us we only needed two dishes to be full. The dishes were pretty rich and delicious. I'd highly recommend this place. They won a James Beard award.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VksmxXW3w2q_OBY6FenjYw/348s.jpg", "caption": "Cod cheese and bacon wrapped dates"}]}}, {"review": {"des": "O m g! That bacon wrapped chorizo dates! Comes with 4 pieces and is sooooooo good! I wish it came in 6 pieces! Served with bread and marinara-like sauce. The chorizo was spicy so it was extra good. The lamb neck is delicious with a balance of apples & hummus. When I read \"lamb neck,\" I thought it'd be such chewy tendon-like meat but it was very tender and seemed like it's been cooked a long time on low heat. Reminded me similar to pork shank, but of course a different type of meat. Then had the infamous paella. Came with 3 pieces of shrimp, 2 pieces of chicken, 3 pieces of chorizo. The rice is cooked on the paella pan. It was extra crispy on the bottom so if you like crispy rice, this is it! The rice has all the soaked flavor of seafood so without eating shrimp, the rice itself is good.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8JcCOR90QtUxi-JMwygtUA/348s.jpg", "caption": "Lamb neck"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZDDTdF_m7WotxJ-lNlWYaQ/168s.jpg", "caption": "Menu Nov 2017"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Mq6g7FGYG8bQqTooVBI3UQ/168s.jpg", "caption": "Chorizo"}]}}, {"review": {"des": "This is one of the best all around restaurants in Chicago. Very inventive menu, great service, and I am a big fan of the communal seating. Lastly they're open late!", "pics": null}}, {"review": {"des": "This is probably my favorite restaurant in Chicago. I had made reservations and was promptly seated by a very friendly waitress. I ordered an Armagnac with their renowned chorizo stuffed bacon wrapped dates. The piquillo pepper sauce had the right amount of seasoning and heat that complemented the protein exquisitely well. I also had the pizza which was very good. The lemon provided a vibrancy that added another dimension in addition to the slow heat from the lightly sprinkled red pepper flakes. Further, I had their Syrah which paired well with the pizza. If you're in the Chi Town area, definitely make your way to Avec to try their chorizo stuffed dates! Literally came from Boston for it and it did not disappoint.", "pics": null}}, {"review": {"des": "Unfortunately nothing special. The sitting arrangements are truly problematic -we were there for 1 hour and had to stand up from our seats at least 3 different times to let people in and out. <br><br>The food is not bad but not good either. We had multiple dishes and by the end I was still waiting for one we liked. Very disappointing.", "pics": null}}, {"review": {"des": "Yes, avec earns 5 stars. My experience might have been impacted by the delicious bottle(s) of wine we ordered, and the delightful company, but also, it. was. de-licious. <br><br>The place: Even though we felt a little bit like we were on Noah's Ark, and I might have gotten bumped by the door a few times while waiting for the rest of my party to arrive, there was something incredibly cozy, familiar, almost familial about this place. I don't normally love the communal seating, and it was a little inconvenient when we had to use the restroom, but we made it work, and it was totally manageable.<br><br>The taste: Everything that I ate, I'd eat again today, tomorrow, you name it. I didn't have the bruschetta with cured ham or the bacon wrapped dates, which I've heard amazing things about, but my crew seemed to enjoy them. I did eat the brussels sprouts (YUM), the focaccia with tallegio (YUM YUM), the lemon bucatini (solid. tasty), the charred cabbage (mmmmm). We shared the citrus pavlova for dessert. And 2 bottles of the Indalia pinot noir - that was a fantastic bottle of wine, IMO.<br><br>My face: A little flushed from the wine, though I stopped after not too much since I had to drive us home. A little radiant because someone who wasn't me picked up the whole tab for the 4 of us. Dinner for 4 with one bottle of wine, pre-tip was $170; the bottle of wine I bought at the bar before was another $50 I think. <br><br>This is a place to go if you want to catch up, laugh, impress someone, and/or eat very well. Make reservations if you can. It's small, but still is a venue that can make for some big memories.", "pics": null}}, {"review": {"des": "We've wanted to visit for quite some time and finally had the opportunity to do so before a concert. We made reservations, however we chose to sit at the bar. It seemed as if we sat at a table, we'd have to squeeze in between others and I just wasn't content with that. Not sure I made the right choice though, the bar was pretty cramped as well. <br>We had a variety of things but my favorites were the oysters, the bacon wrapped dates and of course the espresso cookie. <br>The food came flying out at such a pace, we barely had room for the plates at our cramped little spot & the wait service was slightly slow.. it's pretty evident when the bar backs poured my wine & removed empty plates. <br>The food was better than average though, so that's a plus. If asked, I'd go back again but won't really go out of my way to make another reservation.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/t4PrSkqPN_bvwIPrACwAxQ/348s.jpg", "caption": "Dessert choice"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RowaecB3eEaFHFcpM8_1yg/168s.jpg", "caption": "Beef"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dUCkm7oG0cTsMUQHExoMZQ/168s.jpg", "caption": "Dates!"}]}}, {"review": {"des": "Fantastic meal! Created my own three course meal with an appetizer of the chorizo stuffed dates wrapped in bacon, main course with pork shoulder, and desert with the olive oil brownie with lemon sorbet and Greek yogurt. This meal certainly DID NOT suck, one of the best meals I have had in Chicago. The spice of the chorizo was complimented well with the sweetness of the date and saltiness of the bacon. Pork shoulder was extremely tender and flavor simply out of this world. Dessert capped off the already delicious meal well with an outstanding lemon flavor and soft brownie. Will certainly be bringing friends to this restaurant and highly recommend!", "pics": null}}, {"review": {"des": "I booked this place for bday celebration not realizing their seating arrangements.  We were seated at corner right at the entrance.  I felt cold but the hostess helped with the heater which was readily available right next to me!  Hummm<br><br>Anyway food was delicious, we ordered cheese platter oddly assortments have to be ordered separately, we did and the wildflower honey yum!!! ...   my favorite!  <br><br>We had a whole fish, oysters, chicken and chef special cheese toast which was almost like a burrata on toast.<br><br>Overall it was a fun experience!!", "pics": null}}, {"review": {"des": "What can I say that hasn't been said before? Probably  not much! This place is worth it!  I was little turned off when I  first I walked in bc  the space is tiny but i quickly forgot about that when the food started coming! Everything we had was absolutely delicious! Specially the stuffed dates and the pork shoulder!!", "pics": null}}, {"review": {"des": "The place is tiny, the noise level can be quite loud at times.  When we were seated we were seated at a communal table, it was a bit awkward because we seated in the middle of two parties and had to ask one party to let us in.   There were times where our neighboring party was so loud that I was unable to hear the person in front of me.  <br>The food on the other hand was magnificent.  We had to try the bacon wrapped dates... OMG they were beyond what I was expecting.  The bronzino was cooked to perfection.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ACZNfG1OEbcZBeUqHhewiw/348s.jpg", "caption": "Small place"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VVuAqTfYA_XARicZW2zs2w/168s.jpg", "caption": "Affogato"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VJ_7VPAQ-lv4x7tiS8y7Lw/168s.jpg", "caption": "Bronzino"}]}}, {"review": {"des": "I came here with co-workers for a birthday lunch during Restaurant Week, and we still ordered the Chorizo Stuffed Dates in addition to the pre-fixe menu. I mean it's a pretty genius idea taking the classic bacon wrapped dates onto another level with the chorizo. I loved the take on the Quinoa Tabouleh, too. I appreciated how more complex and dense this was with the spiced walnuts. The lamb burger was so juicy and flavorful, and the creme fraiche panna cotta was the perfect ending to the meal. I wish I could eat like this every day. The service was great as my water got continually filled and plates were taken to make space and our food arrived pretty timely.", "pics": null}}, {"review": {"des": "Everything was delicious. Loved the squash blossom pizza, the simple tomato sauce with the egg and cheese was just great. The cherry tomato literally exploded in my mouth like a juicy, flavorful, fresh bomb of deliciousness. Also the avec burger was great, loved the sauce, combined with juicy patty and soft bun. The werp farm greens was fresh and crunchy but a little too salty for us. Overall great restaurant! Will come back again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rl8Wm_5ox-paWo4BADkMJQ/348s.jpg", "caption": "Avec burger"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/g6mQJdbtoVw-MhEciTWQSw/168s.jpg", "caption": "Werp Farm Greens"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mWEt1IGjpcbFSLVX5-tEqQ/168s.jpg", "caption": "Squash blossom pizza, thin crust with crispy edges and fresh, flavorful toppings, so delicious!"}]}}, {"review": {"des": "The review is 3.5 stars. I really wanted to love this place since the chefs and servers were so kind but the it factor just wasn't there for me. Everything was good but I wouldn't say amazing or that I'm a fan. We tried three dishes: chorizo stuffed medjool dates, deluxe focaccia with taleggio cheese, and grilled sausage with charred strawberry and starwberry tzatziki sauce. The chorizo stuffed medjool dates were solid but the tomato sauce they were overpowered the dates and was very salty. The bread served with the dates was out of place and wasn't good. The focaccia was good but a bit overpowering but it tasted better once we drizzled it with honey to balance the pungent taste of the cheese. The grilled sausage with charred strawberry and strawberry tzatziki sauce was supposed to the most interesting dish to try but I couldn't even taste the strawberry in the greek sauce. <br><br>I would come here for drinks though. The meztropolis drink was amazing, citrusy, and smooth.", "pics": null}}]}