{"name": "bandera-restaurant-chicago", "reviews": [{"review": {"des": "This is my favorite spot for a weekday business lunch . Super convenient as it's on Michigan Avenue .<br><br>Their macho salad is amazing -- get it without chicken to make is vegetarian ..and grab some fries too !<br><br>Ask to sit by the window and watch the sights on Michigan Avenue . <br><br>Great cozy atmosphere , great service and great to go solo and sit at the bar .", "pics": null}}, {"review": {"des": "Went to this restaurant for the first time and I must say upon entering I was warmly greeted and immediately heard live jazz music being played which was very nice<br>We had a later reservation but were accommodated for an earlier reservation upon asking <br>We enjoyed the warm bread appetizer as well as the ahi tuna salad entree with mango and avocado <br>This is located right next to a bank so I had to look twice to see the door to go up the escalator to the restaurant<br>You won't be disappointed though<br>Food was good", "pics": null}}, {"review": {"des": "If this review would have been written on my last visit, it probably would have been 5 stars. When I went last night, I was very disappointed. The main attraction, their wonderful skillet jalapeño cornbread, has been taken off the menu. That was definitely the main attraction for my friends and me. Instead, they have a small bread plate with two pieces of bread and a few tiny cornbread croutons for $5. Very sad. <br><br>Our meal was good, rotisserie  chicken and their macho salad with cranberries and goat cheese. The music was nice. Our server was fair. I sat with an empty water glass during the last half of the meal. There are many other great restaurants in the area, and we will not return to Bandera unless they bring back the cornbread. No point.", "pics": null}}, {"review": {"des": "Wow, the ambience of Bandera is lovely. It's been so long since I've been to a restaurant with live jazz music. The volume level is perfect (can't really hear other people's conversations but easy to hear your table's), the lighting is dim but not too dark, seating is split between booths and regular tables along the windows overlooking Michigan avenue, you can see into the kitchen, etc. Our server was very friendly and attentive, and service was pretty quick.<br><br>We didn't have a reservation on a Saturday night around 8pm, but we were able to be seated after about 45 minutes of waiting. They have a text message system so we didn't have to wait inside the restaurant either, but even if we did they have an extensive bar that would have made the wait bearable.<br><br>I tried the shrimp cocktail and the french dip. The shrimp cocktail came with 5 (very large) shrimp, and it was really on point. Cooked perfectly and the two sauces were yummy too. The french dip sandwich was also really good (the au jus sealed the deal), but eat it fast because my second half of my sandwich got soggy as I was caught up in conversation. I really wanted to order the cornbread too because I had heard such good things, but they no longer offer it :( I hope that it's just a seasonality thing and that they'll bring it back onto the menu again.<br><br>Overall, I had a great experience at Bandera, and I would definitely recommend for date night based on ambience alone.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GyZVxgKu0UY2Jo5l2_LKLw/168s.jpg", "caption": "french dip"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sE50JugdI3wysrhxJL4d9A/168s.jpg", "caption": "shrimp cocktail"}]}}, {"review": {"des": "Love the ambience and decor. As soon as you walk in you hear the busy open kitchen, bar tending, and live jazz music! Perfect for date night or a big night out with friends! We visited to celebrate my sisters birthday and this was a real treat. <br><br>I miss the city vibe, and I'm grateful to have Chicago near by. The dining definitely reminded me of more upscale, traditional front of the house service. I really miss that sometimes! The live music was the best part! My daughter and I were able to snag a couple of seats right in front of the band. Jazzy tunes were played the entire evening, live music and radio combined.<br><br>The menu....quality not quantity! I very much appreciate that! We ordered:<br><br>Smoked salmon <br>Veggie Burger <br>Beef ribs, side of cabbage <br><br>Everything was delicious! Flavors perfectly  executed and well balanced. The beef ribs fell right off the bone, and not overly drenched in bbq sauce. The cabbage was a nice treat, with hints of goat cheese in it. I think I liked that more than the ribs! My daughters veggie burger was quite tasty and hearty. Made with no meat, but blended with beats and other ingredients that made the burger's texture and color look like beef. So well thought out! <br><br>I love everything about this restaurant and would visit again the next time I'm in Chicago !", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9B8KgnTBwgMSVbzaxsb11w/348s.jpg", "caption": "Veggie burger"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mLDh6Rwf1FIXxZG17SrgBw/168s.jpg", "caption": "Side cesar"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pySMajfkM8AYD8QPkdM_fQ/168s.jpg", "caption": "Braised beef ribs"}]}}, {"review": {"des": "I just never get tired of this place. The atmosphere is beautiful- jazz nightly, looking over Michigan Avenue, tasteful artwork. It's beautiful and perfect for a date night.<br><br>I will admit the menu is a bit limited- one page. I can also promise you that every single item on that menu is perfect, though. I originally fell in love with Bandera because of their salads. They're large, healthy, and packed with a punch of flavor.<br><br>This time I got their ahi tuna platter and was not disappointed. First, I got huge chunks of ahi tuna. It was like i was at a sushi restaurant but BETTER. Each one had a bit of sauce, nothing too overpowering, but added so much to the taste. On the side, there was a salad with some of the best dressing I've ever tasted. It was like I actually wanted more salad (which is honestly pretty unlike me) and on the salad there were huge pieces of mango, avocado, and tomato. <br><br>I ate everything in like 3 minutes, which is bad but should tell you how good the food is!!", "pics": null}}, {"review": {"des": "I have absolutely been in high anticipation of this restaurant since I discovered a couple years ago<br>This was a special visit I 21st wedding anniversary and we knew where you going to need a late reservation because of prior engagements<br>We have arrived about 30 minutes early because we were absolutely famished and the wait staff was very nice a lot of us being early for a reservation we got a nice boots and placed our orders which I already knew what I wanted the chicken and beef rib combination platter immediately upon sitting down I notice the wonderful sounds of a live jazz band which help with setting the mood for a romantic night ahead<br>Based on the recommendation of our wait staff we went with the 12 oz steak for my husband where he told him several times he wanted it done but he did not want it burned or too well done<br>My phone came out first followed by my husband's food and it was quickly noted that his steak was indeed well done I'll waste and quickly took it away and explain to the Shelf his dissatisfaction at that time the manager came over and apologized profusely and agree that it was overcooked<br>She then proceeded to have us order complimentary drinks on her where I got a wonderful delicate white wine Riesling and my husband was Compton his signature margarita drink she also brought him over a house salad and got the food be prepared to his liking customer service was definitely a one here and they were truly apologetic and fix the problem promptly I appreciate the service the constant checking on us and even offering us a complimentary dessert<br>My chicken and ribs was a hit. It's a rarity to find a restaurant that actually has beef ribs on the menu I'm not a park eater but I do like ribs and to find beef was astounding the beef ribs were so tender falling off the bone I devoured them silently as my partner partner grab my other rib and begin enjoying that as well no complaints the chicken was pretty good too it was a half a chicken I would say and that came with coleslaw and I got mashed potatoes on the side<br>It's very sexy in there and I believe you'll be a fantastic date night enjoy", "pics": null}}, {"review": {"des": "I can't believe I've never been here, but past it all the time. I was a little confused when I arrived here where to go in at. Head up the escalators and to the left. <br><br>We went on a Saturday with reservations at 7:15pm for 4 people. We weren't seated until a half hour later, but they were nice enough to to give us a round of cocktails on the house. Side note people tried to come with no reservations and were quoted an hour and a half wait...so definitely don't try to come on the weekend without reservations.<br><br>I think what I liked most about the restaurant was the ambiance. We were seated right by the jazz performers and this would def be a romantic date spot. <br><br>For my meal I had the salmon with potatoes and brocollini. To be honest it was good, but didn't blow me away. I think you're paying for the whole experience and food was reasonably priced. I would probably try ordering something different next time. I can't believe I didn't get dessert. :( Next time!", "pics": null}}, {"review": {"des": "Server was awesome. Answered our questions and gave recommendations! <br><br>- 1 star because they took the cornbread off the menu before I could try it and it was one of their most popular items! I don't understand why they would remove it from the menu... <br>-1 star because the rest of the food was just fine, nothing outstanding. Got the burger and the lamb sandwich. The burger was cooked medium when I asked for it medium-well because I have stomach issues. The lamb was good. <br>Fries with the burger are extra. <br><br>Solid place, prices seem okay but I probably won't return. Chicago has so many options and this is just not at the top. <br>Maybe the cornbread would have changed my mind. Guess we'll never know", "pics": null}}, {"review": {"des": "This is a great date spot.  It has a great view of Michigan Ave and the live jazz music gives it a very fun yet but intimate ambiance.  The jazz duo that was playing was excellent.  The music was soft and pleasant so you didn't have to talk over it.<br><br>Highly recommend the citrus martini.  The chicken was excellent as well.<br><br>Definitely dress up a little.", "pics": null}}, {"review": {"des": "My friends and I were here on vacation.  We had a hotel in downtown Chicago and stumbled upon this place.  It looked pretty nice so we went in.  We got seated right away for a table of 3.<br><br>It took about 15 mins before the waiter comes to ask us what did we want to drinks.  We ordered our drinks.  He then comes back with our drinks then takes our order.  My friend originally wanted the Cesar salad but wanted salmon instead of chicken.  The waiter then tells her that's not an option....(which I found pretty odd and not accommodating) she ended up getting the macho salad, I got the salmon, and my cousin got pork chops.  <br><br>The food comes, we eat and chat.  And we don't see the waiter again until maybe 30 mins into our meal.  The only reason why he came over is cause we waived him down cause my cousin wanted another drink.  So we all order one more round.  Asked for the bill and left.   <br><br>Overall experience wasn't that great.  I'd honestly give this place a 1 star but the food was pretty good.", "pics": null}}, {"review": {"des": "Two of us split a spinach artichoke dip and it came with salsa on the side -- it was very tasty!  <br><br>Next I got the salmon dinner and it was delicious and cooked perfectly!  <br><br>My friend got the Shrimp Louie salad and she really liked it but thought the portions were small. <br><br>The waitress was excellent and the hostess seated us immediately (but we came early). If you can - try to make reservations ahead of time because I hear they get very busy!!<br><br>The menu is one page so the options are limited- might want to check the menu ahead of time to make sure there is something you would like!!", "pics": null}}, {"review": {"des": "The long trek up The escalator  anticipating a fun evening Almost everything on. The menu is good I love the rotisserie chicken and the burger. Also I love cornbread and it's pretty good here", "pics": null}}, {"review": {"des": "One of my colleagues recommended Bandera and I'm thrilled that she did. I tried to make reservations via 2 different sites, but wasn't having any luck, so we risked it and just showed up.<br><br>Amazingly, we got in immediately - table for 2. Our young, attentive server was outstanding. I was hungry and needed an adult beverage...our appetizers and drinks showed up almost immediately. <br><br>The ambiance led me to order an Old Fashioned; my companion had the Elder Collins. Dark wood, low ceilings, dim lighting and live jazz made it feel like we walked into a high-class speakeasy. <br><br>Drinks were strong. Jumbo shrimp cocktail was perfect; grilled artichoke with accompanying creamy dip was delightful.<br><br>Main courses? Prime rib and \"Seattle style\" bbq salmon. I ordered the salmon as rare as possible and it was cooked perfectly. The sear and lightly sweet sauce on the outside complimented the texture of the minimally cooked piece of non-fishy salmon. The broccoli and mashed potatoes were also delicious. I had a few bites of the prime rib and it was amazing. <br><br>I loved everything about this place. I would definitely visit again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/igJAqxql6GHHfMoRYwem2g/348s.jpg", "caption": "Napkin"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ivaYME4BqiHqXjElHcwSxA/168s.jpg", "caption": "Elder Collins"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LwaHrYDyGw19QJU-rtFXFA/168s.jpg", "caption": "Old fashioned"}]}}, {"review": {"des": "I'd give 0.1 stars if I could. HORRIBLE service from the bartenders. Rude, emotionless, and completely lack a service personality. Whoever the bartenders were on Tuesday, 12/04/18, need to consider a position that doesn't deal with people.", "pics": null}}, {"review": {"des": "Great location on Magnificent Miles with live Jazz and great food!<br>Food: food here is Amazing!! We started with cornbread on a skillet, guac &chips, and artichoke dips. Cornbread is amazing: crispy on the border with chunky corn inside. Def a must try. Guac is just guac, nothing spectacular. Artichoke dip is amazing, 3 large half artichoke with fatty mayo/sour cream based dipping sauce. <br>Macho Salad is AMAZING!!!! The large pieces of rotisserie chicken is so tender and juicy!!!! And its a well displayed salad. Highly recommend. <br>Double cut pork chop is amazing too. The portion is pretty large, and the pork chop was cooked to a perfect condition, super flavorful and juicy. <br>We tried all of their desserts: ore ice cream sandwich, apple walnut cobbler, and banana cream pie. Apple walnut cobbler is my fav. <br><br>Service: great and attentive. But since its a popular place, it took them 1 hr to seat us (we have a reservation for a table of 6 at 730pm, we weren't sedated until 830pm...) Def not fun standing there for a hour. But i understand that they can't really force people leave their table after eating. <br><br>Live jazz is amazing! They have piano and cello. I enjoyed it. <br><br>Will come back to try their signature rotisserie chicken for sure. Probably on a slower night tho.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uvO9H3gTYLqk4v3Dh_iD9A/348s.jpg", "caption": "Macho salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/n_tlwEUMggiJ2E2LR6o1PQ/168s.jpg", "caption": "Pork chop"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SUHSv1S1CKZYdg7Q2w49fg/168s.jpg", "caption": "Banana cream pie"}]}}, {"review": {"des": "Great food & excellent service! Our food came out quickly and tasted great. There is a dress code so make sure you check that out before coming. Definitely will return next time we're in Chicago!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LGUOYhPzJOOUxqCbztRQ7A/168s.jpg", "caption": "Prime rib dip with fries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WkD-jdWVI3yDAFSymqYUYw/168s.jpg", "caption": "Classic cheeseburger with fries"}]}}, {"review": {"des": "This place is great- but you may need to wait 10 to 30 minutes even if you reserved a table<br><br>It is part of the Houstons/Hillstone group of restaurants so you know it is well run with solid food<br><br>The dimly lit space is vibrant and filled with live jazz every night<br><br>The wine list is fairly marked up to about double retail and you can bing a bottle of wine for no corkage fee and a second for $15- that's pretty solid<br><br>The food is great- I do not think you can get anything bad here<br><br>The standouts from our meal <br><br>Wood Fire grilled artichokes- the best<br><br>Arctic Char- simply grilled with a piccatta sauce and two sides<br><br>French dip- so so good<br><br>Rotisserie Chicken and BBQ rib combo- the ribs are fall off the bone<br><br>I can go on and on- but you get the drift- the food is really good, the service is very efficient and professional, the music is enjoyable and you will have a really nice experience here", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/q_HfUQ-DwygPjgB3iW_jsQ/348s.jpg", "caption": "Cajun trout. Yum"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2ESbcnDewDPyySAjZPXmJA/168s.jpg", "caption": "Green chile corn bread. So good. Get the honey butter on the side"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Tmt0nZoRBUB0ytHIcB9exQ/168s.jpg", "caption": "Best wood fire artichokes"}]}}, {"review": {"des": "Found this place on Yelp, as I had no idea where to go in Chicago and it was literally amazing. First I have to say that Mike, our waiter was one of the best waiters I have ever had, and I go out to eat a lot. He was chipper, easy to speak with and came with knowledge about the items on the menu, making it super easy for us to get recommendations. He was awesome and worth going back for the food, but to also see him.<br><br>To start we ordered the duo dips, which were light, tasty and great to share. We also got the cornbread, which is a must have. Everyone should try it. It was SO good.<br><br>For entrees, we did the pork chops and then one of the salads. Both were great. The salad has rotisserie chicken on it, that was so juicy and perfectly cooked. <br><br>The best part was the end, where Mike brought us free dessert! What - A - Guy. It was not only thoughtful, but delicious.<br><br>Drinks - We did the Bee's Knees and Double B. Tried both, well made and delicious. <br><br>Overall, would highly recommend this place, food is great, service is great. Atmosphere is great. Not to mention live music during dinner, every night!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nYDfs4VwnQPshHe5Pi-quQ/348s.jpg", "caption": "Cornbread must have"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tXJvST2xLbelBgDstC4uLw/168s.jpg", "caption": "Macho salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QU-HSk8sK5vxNTe6A2kVVQ/168s.jpg", "caption": "Pork chops, delicious"}]}}, {"review": {"des": "At the end of a long day, there's nothing better than hanging out with my wife ... than hanging out with my wife over a few drinks. My desire for an early night's rest was quickly replaced by a desire for a cocktail. Luckily, Bandera Restaurant was right across the street. <br><br>We got to the bar (past the hostess) and the bartender asked if we'd like a crisp martini. I held up two fingers and she said, \"Two?\" to which I replied, \"No, five. I'm ordering like a Roman.\" She almost laughed.<br><br>The martinis were, like my confidence in congress putting country over party, shaken and not stirred. Ah, life can be good hanging out with my wife ... with a cocktail.<br><br>We moved onto an order of Bandera's Signature Iron Skillet Cornbread and a couple classic mixed drinks. She got a Brown Derby while I settled on a Dark & Stormy. Life was better. I flashed the peace sign at the bartender and got another round.<br><br>The bread was thick and heavy (like the Chicago accent of the guy sitting next to us). We spent more time with our conversation and cocktails than the cornbread. <br><br>Finally, it was time for that early night's rest. Bandera ... peace out.", "pics": null}}, {"review": {"des": "This place really just is okay. There are so many restaurants in Chicago, so every little thing counts. The hostesses weren't all that nice, the queso appetizer was just cold pimento cheese, and our entrees were all lukewarm temperature. The entrees (chicken and ribs) had a nice flavor, but the temperature wasn't right. The cocktails were tasty and the live jazz band is a nice touch. The place kind of reminds me of J. Alexander's in ambiance. Which is fine. But not unique in any way, so it feels commercial. Prices were what I expected for a restaurant on Michigan Ave.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fmpR2DuCWMk9e1C_Ytpqxg/348s.jpg", "caption": "Hummingbird drink extra sweet"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6ZZ_dzEWWt3vXFDVrY0Rqg/168s.jpg", "caption": "Duo Dip (queso and guac)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hnocQcELnrWBburej3mZlw/168s.jpg", "caption": "Roasted chicken with broccoli on the side - great flavor but the temperature was lukewarm..."}]}}, {"review": {"des": "I went here with some friends and lovvveddd it! Our server was absolutely amazing. She was extrenely knowledgable and friendly. <br>1 person had the burger and he really enjoyed it. Another had the kale salad and she said it may have been her favorite salad ever. Yes, you read that right, a good kale salad! I had the lamb sandwich and it was AMAZING. The ambience and jazz music was delightful. I can't wait to come back!", "pics": null}}, {"review": {"des": "Atmosphere is warm and inviting. Live jazz music sets the perfect background. Views of Michigan avenue, especially when it was snowing, are magical. The food is amazing! <br><br>Most importantly, they accept reservations. We usually get sat in a large half circle booth. It provides a view of the music and the rest of the restaurant. <br><br>Staff is professionally yet personable. <br><br>We have tried both the spinach artichoke dip and the iron skillet cornbread. The dip is much more like a spinach dip with artichoke, but is delicious. The corn bread seems to be a favorite, many other tables ordered the same. The outside is crisp and the inside is moist. It has large pierces of corn and jalapeños for flavor. I always get the macho salad (pictured), which is probably one of my favorite restaurant salads of all times. We had the banana cream pie (pictured) and Oreo sandwiches (pictured). <br><br>This is one of our favorites when when we are in the area!", "pics": null}}, {"review": {"des": "This is a hidden (but not so hidden) gem!!<br>Came here with friends and my first impression was: place right on michigan ave is famous be won't be good. <br>However i was wrong! We had a kale salad and corn bread to start, omg this is the best kale salad i've ever had!  I am usually not a corn bread fan but this one is just so exceptional! <br>Grilled artichoke was yum, and their chicken and beef ribs were fantastic too! Love here!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/doXZxvG-arwCCohF8jDV1w/348s.jpg", "caption": "Corn bread"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GtsyGOCc5QEhB7ZAB1ZuLQ/168s.jpg", "caption": "Kale salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vAvFjHV_-f8b33QMAxL2vw/168s.jpg", "caption": "Chicken and beef ribs"}]}}, {"review": {"des": "Such a cool place. A bit tricky to find if you're not familiar with the area or are not looking well enough! The door past Labriola, look in and you'll see an elevator... take it up to 2! Take a right down the hall and through the glass doors. <br><br>That discovery of its location makes you feel like you're in this hidden place... and as you make your way closer you hear that awesome jazz trio doing their thing! <br><br>Simply elegant but not too fancy at all.<br><br>Every part of our meals were fantastic! Husband got the bbq rib and chicken dinner with fries. The ribs were super tender. Sauce not too sweet and not too spicy-- very good balance. Can't forget to mention is was a good-sized portion. The chicken I did not try, but he seemed to be enjoying it!<br><br>I ordered the burger. I'm not a huge burger fan but something made me want it real bad. I'm so glad I had that hunch because it was more than enough food with my added fries. Burger was cooked exactly as I asked. Such a simple burger, but massively juicy! The veggies on the burger were very very fresh and crisp and made it all come together. The fries are barely seasoned and they bring you a whole shaker of some seasoned mixture so you can decide how much flavor you want. Put this on EVERYTHING. Not sure what the mix is but I put it on my burger, too! Yummmm!!!<br><br>We did end with coffee and their (I think) signature dessert. The house-made Oreo ice cream sandwich with espresso syrup. I believe the big dollop on top is mascarpone. Boy was it delicious-- and I'm not huge on sweets! The sweet of the ice cream is balanced so perfectly by the espresso and mascarpone. <br><br>Banderas is great. Amazing atmosphere, great service, outstanding LIVE jazz. 100% sold.", "pics": null}}, {"review": {"des": "This was a wonderful experience start to finish. We were seated quickly on a Friday night right next to the live jazz band. It was very loud, but so fun to hear and see the jazz. The musicians were having fun and it was great to watch their facial expressions. <br><br>Service was great. Waters immediately filled every time our glasses were empty. Didn't have to wait too long for food. Everyone was extremely professional and attentive. There were multiple people waiting on us. Every detail was attended to. <br><br>I ordered the prime rib. It was a huge meal. So delicious. It's everything you'd want it to be. Juicy and tender with a black pepper seasoning that's crisp on the outside. I enjoyed every single bite of my meal and every single moment at this restaurant. Would highly recommend it. It was just wonderful.", "pics": null}}, {"review": {"des": "One of my absolute favorite restaurants in the city. The ambience is addicting. I love the romantic lighting, live music, and the comfortable seating at the booths and bar.<br><br>The food is just absolutely delicious. I must have the dip duo every single time. Their veggie burger and fries are delicious as is the Caesar salad. There's something for every palate and the drinks are really good too.<br><br>I always tip high here because the food, ambience and service is A+ and worth it!", "pics": null}}, {"review": {"des": "I've been wanting to try out this restaurant for a good while now. I love Chicago jazz culture, and the location and views of this restaurant are perfect. This restaurant represents a true Michigan avenue classic in my opinion and is well worth a try at night to hear the live jazz music. Though the service was slow, it was a nice time. <br><br>I got a nice glass of pinot noir and also enjoyed some spinach and artichoke dip to start. I was a little disappointed that the chips with the dip were literally out of a bag tortilla chips...this dish could've been made/presented much better. I also got an ahi tuna salad and completely forgot to ask for dressing on the side, ending up with a drenched salad. The ahi tuna was tasty though. <br><br>Overall, as mentioned above- this is a classic and must try in Chicago. Definitely come here for the jazz music, slow service, and good wine. Maybe get something different than the items that I ordered though..", "pics": null}}, {"review": {"des": "Bandera is a solid choice for dining while in this area of Mag mile. The food was good but not great & although they have jazz nightly it's as if everyone in the restaurant was having a conversation to solely drown out the music, aka extremely loud people. The \"cornbread\" was slightly sweet but otherwise good & quite hefty for an $8 appetizer. The \"Cajun trout\" was seasoned perfectly. The star of the evening had to be the \"bbq salmon\" which was very good. On the west end of the restaurant you're awarded with views of Michigan Avenue which is nice. It's also decently priced especially for this area where there tends to be a ton of prosaic restaurants that aren't worth what they charge. I'd return to Bandera but again, it's good not great food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/v-O_jLm8KE-7v5TRr5bOmA/168s.jpg", "caption": "Cajun trout"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ic94ZrfdcIMznZjw3OeGrQ/168s.jpg", "caption": "Bbq salmon"}]}}, {"review": {"des": "My favorite restaurant in downtown Chicago. They have a live Jazz band and a fantastic atmosphere.<br><br>The menu is seasonal with lots of delicious options. The service impeccable and very friendly staff. Definitely recommend this restaurant if you are in Chicago.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Uj5iO8pjawjP6i8jBCKVLg/348s.jpg", "caption": "Sparkling wine"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-0j-XyhF9Ug4rnKy6DOeFg/168s.jpg", "caption": "Arctic Char"}]}}, {"review": {"des": "Update - 10/12/2018<br>One new good thing - they now take online reservations for lunch through their website.   One new (and really bad thing) - no more cornbread skillet!! They've replaced it with a very blah bread plate that cannot compare - 2 pieces of not-so-fresh (or warm) bread and 4 cornbread \"croutons\", a few olives and 4 almonds.  Bleck.  So disappointed.  The Macho salad is always lovely - the service and atmosphere are excellent but I'm really sad about the best cornbread ever.", "pics": null}}, {"review": {"des": "The best restaurant in Chicago knowledgeable friendly and warm personnel the music is fantastic the atmosphere is just right and the food is magnificent<br><br>It does not take a lot of words when something is 100% wonderful Bandera is just  the best<br> You guys are going to see me so much you're going to think I'm part of the family already have made reservations for July 13", "pics": null}}, {"review": {"des": "I've been traveling to Chicago for the past month for work. I try to get food from a different restaurant every night. I always order takeout because I don't feel like sitting by myself at dinner, so I understand presentation is often times loss. However, Bandera has been the only restaurant out of 19 that still maintained a great presentation. I forgot to take a photo, but I order the salmon with seasonal veggies (broccolini). It was delicious, the salmon was lightly seasoned and cooked perfectly. The broccolini had great flavor, not too much garlic, and sprinkled with a little parmesan cheese. Whenever I went inside to pick my order up, it had a great, inviting ambience..I actually had wished I dined in. I definitely will be returning in the future, and may even dine in for a change.", "pics": null}}, {"review": {"des": "Pretty good. Came here for dinner with my parents, mother-in-law & grandmother. They took us out for our anniversary. We started off with the Skillet cornbread. It was excellent; very moist but cooked well, complemented well with cheddar and peppers.<br><br>I got the lamb sandwich and my wife got the Dings Crispy Sandwich. My lamb sandwich was good; the dipping au gou made the sandwich really good. My wife's chicken sandwich was AMAZING. Great flavors. The fries were good. Great service, nice place.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dxiBwUu5CzQNcGQODwoiRg/348s.jpg", "caption": "Lamb Sandwich"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gpDsy9wjL4R-vJ3Th54Y5A/168s.jpg", "caption": "Skillet Cornbread"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XT3MODldOp2gz1wpSn05fg/168s.jpg", "caption": "Ambiance 2"}]}}, {"review": {"des": "What an amazing experience. The staff treats you like royalty and the food is top notch. The best pork chops my wife and I ever had. And such great desserts. We sat right by the windows and the live jazz. So cool!", "pics": null}}, {"review": {"des": "Came here last night with some local friends to celebrate a friend's birthday. I was totally surprised, the food was really good, especially the smoked salmon. It was seasoned well, juicy and pretty addicting. The service was friendly as well.", "pics": null}}, {"review": {"des": "I was expecting so much more from this place but it was nothing to write home about. Waited 2 hours for a table, sad thing I could've just ordered from the bar and saved myself the time. No rush to return", "pics": null}}, {"review": {"des": "Came here on a Saturday for a date night with the hubby and I HIGHLY recommend this place for a night out. <br><br>The ambiance is superb for cuddling up in a booth while listening to the live jazz music play. The lighting is lower and there are candles at the table as well. It wasn't so dark you couldn't read the menu. It was a warm inviting atmosphere. <br><br>We ordered some cocktails at the bar while we waited for a table (we made the mistake of not making a reservation) but the bar area was perfect to hang out. The bar tenders were very well trained and made a delightful cocktail. The staff all had uniforms on and this type of unison elevates the service. <br><br>They also do have a dress code here, it's to be expected and nothing absurd. There are also dining guidelines (suggestions) and again this is really appreciated as your whole experience is elevated. I'd check their website for additional information <br><br>The food was sensational and the portions were fairly large, we ended up having some of backed up for later. <br><br>The location is great as well, you can stroll Michigan Ave before or after your meal.", "pics": null}}, {"review": {"des": "I was in town for a conference and needed to find a spot to have dinner with my boss. Originally, I was looking to dine here on Valentine's Day, but they were already fully booked. I opted for a Thursday night reservation instead for 6pm. We arrived just about at 6pm and they sat us in a booth right away. <br><br>The ambiance is really nice - there is jazz music in the background and dim lighting. I would definitely recommend Bandera for a date night! <br><br>We were both kind of tired from a long day at the conference, so we jumped right into our meals. I had the Arctic Char with lemon butter sauce, steamed broccoli, and pomme puree. It was absolutely divine and quite possibly the best thing I ate during the entire work trip. I also had a Bee's Knees cocktail, which is gin, honey, and fresh lemon juice. It was really, really good. Our wonderful waitress came over mid-meal to swap my cocktail glass for a chilled, frosted one to keep my drink cold. Now that's service! <br><br>We stuck around for a while chatting as we don't normally get to see each other too often (she works remotely). They were very gracious about it - even when there were people waiting by the hostess's desk. Highly recommend!", "pics": null}}, {"review": {"des": "Wow, what can I say about Bandera that hasn't been said before? My grandma (Rose), mom (Cheryl), and second cousin (Rose II) went to dinner here to celebrate our birthday (we're all born October 17th) and were lucky enough to have Stacy as our server. The beer and burgers were second to none, and I still dream about the slice of cheese that came with my fruit salad. The decor was stunning too: moody yet friendly, bright yet mysterious. Loved it!", "pics": null}}, {"review": {"des": "We sat at the bar and had amazing service! The wine was great (big pours) and the food was fab! We got the kale salad, and black bean burger. The kale was so good and tender and the dressing was delicious with the rotisserie chicken. I typically go for meat, but the black bean burger with soy glaze was absolutely amazing! The fries were perfectly cooked and the chipotle mayo was a must! <br><br>I will definitely be going back!", "pics": null}}, {"review": {"des": "On one of the busiest days in Chicago, St. Pat's day. We decided to brave the crowd and head for a late lunch at Bandera. I was on a mission and that was to get their Beef Ribs! The service was amazing! I love how as the hostess seats you, she asks what youd like to drink. Before, we can get settled our drinks are already being placed infront of us. We got the cornbread as an app. It has this amazing crust that almost makes it taste like cake! We got the ribs and they taste the same at Houstons. They only give you four but I swear I could probably demolish more since its so good!  Im not drinking for awhile, so the homemade Lemonade was an excellent touch!", "pics": null}}, {"review": {"des": "I've been here before, and if I reviewed then I'd be writing a four star, good service, really solid food, nice atmosphere and price point reasonable for the location. <br><br>So why the change of heart? I find it disappointing and surprising when a server/bartender doesn't treat customers equally. Perhaps I should've worn a strap on, (sorry if that's offensive) but the guys sitting next to me with the proper anatomy received better service. I placed the exact same order that the guy sitting at the next bar stool did, got asked several questions, would you like this with it or that and how about fries or another side? Again, the exact order, and she just stared at me, so after a few awkward seconds I started to rattle off the rest of what I wanted.<br><br>Food was very good, place is also very nice. Please, train your staff.", "pics": null}}, {"review": {"des": "This place is a sister restaurant for hillstone in New York. The vibe was the same. The jazz was extremely nice to listen to throughout my meal. I have to say, the emerald kale salad was phenomenal. I would go out if my way for this. Kale is difficult to work with, especially raw. So I am pleased. The cornbread hype was alright- personally not my favorite but my friend enjoyed it. I do have to say, the service was magnificent. If I were to return, it would be for the servers.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8A-9fppiR2iBEMgYnNe1Mg/348s.jpg", "caption": "Cornbread"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ac4GjlDUq4Z9uvAsdLmrEg/168s.jpg", "caption": "Cornbread"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VmSI8-xq2FR3oNGeDIMR6A/168s.jpg", "caption": "Kale salad"}]}}, {"review": {"des": "Bandera - what a surprise and what a treat!  Waited nearly 60 for a table which considering the location on Michigan Ave. and the fact that it was a holiday weekend before Christmas - par for the course, but worth it.  <br><br>The atmosphere is wonderfully dark, notes from the live Jazz permeate the room without being over powering.... between the din, lighting, music and view of Michigan Avenue just out side, it's quite spectacular without being pretentious.<br><br>Had the barbecue chicken and ribs, however for as incredible as the the ribs were the chicken call the other side of scale home.  Chick was good enough to be on the plate and that's it, not bad, not unremarkable to the point of being odd.  Not cooked long enough to hold the title barbecue chicken.  <br><br>Bar and cocktails were great. Service was standout and very attentive.<br><br>All in all- worthy of 4 stars....Cannot wait for my next visit to Bandera in Chicago!", "pics": null}}, {"review": {"des": "Wonderful!! Outstanding bartenders! The music was delightful! Had the French Dip sandwich.... ohhh my word! So so good!", "pics": null}}, {"review": {"des": "Solo night out on business and ate at the bar.  Plenty of space and very attentive staff. Meal was delicious.  The salmon was cooked perfectly and the salad was very unique.  Band was just the right volume to create an upbeat atmosphere and did not take over the place.  Highly recommend.", "pics": null}}, {"review": {"des": "This used to be one of my favorite restaurants in Chicago -- amazing food and meticulous service.  However, I can't for the life of me understand what management is doing. It's like they took a class to figure out how to remove all the BEST items from the menu.  People have raved about their delicious cornbread for years.  I'd send out of town guests there all the time and tell them to make sure they ordered the cornbread.  Well I just learned that they no longer offer it!!! Also, they didn't replace it with anything.  Bad bad decision. I won't be back anytime soon.", "pics": null}}, {"review": {"des": "This is a hidden gem!!! I highly recommend the lamb sandwich and the beef ribs and rotisserie chicken combo ... The lamb sandwich was so tender and refreshing - hints of mint in the arugula and sweet pepper, and the jus was just perfect. The rotisserie chicken is made in-house and had the real, chicken flavor that's easy to forget these days. Oh and get their Margarita - just the perfect punch of flavor ! And the service is amazing - special call out to Alina", "pics": null}}, {"review": {"des": "We were pleasantly surprised with this restaurant. The food and drinks were great, the service was friendly, professional and perfect level of attention. Prices were extremely reasonable considering the value that we received. Music was a plus as well as the window seat. Liked it so much that I brought coworkers back the following week for a business dinner.", "pics": null}}, {"review": {"des": "My family and I love coming to Bandera for years now. Great service, food and vibe. I admire the management for training such a great staff to be consistent every time. Love the live music, and their food hits the spot every time.", "pics": null}}, {"review": {"des": "Amazing ambience and great food and drinks. We had spinach and artichokes dip, macho salad and grilled salmon. Everything was so fresh and delicious. They offer very good drinks as well. We ordered Chimay on the tap and French75. The service was great. Live jazz music made the night even better. Make sure to  book in advance to avoid the long wait time.", "pics": null}}, {"review": {"des": "Great food. I had an amazing salad and my husband loved his ribs. The dip duo is excellent. Our service, however, was down right awful. We didn't mind waiting the 1.5 hours for the table. We went for a walk during that time. When we were seated it took 25 minutes to get a Diet Coke and 35 for my husband to get his old fashion. We never received breadsticks that we ordered and the waitress was often MIA. Lovely view along the window and again excellent food but terrible service.", "pics": null}}, {"review": {"des": "I loved this spot, the atmosphere was soothing and classical, the food was tasty also decent as far as portion control goes. I had the salmon dinner that came with broccoli and mashed potatoes for dinner and for dessert the oreo ice cream cookie. Both dishes more than pleased my appetite for the evening, can't wait to dine her again. Even our sitting was enjoyable close to the live jazz band a full view of the city's magnificent mile. Perfect for our Valentine's weekend.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gJNlK05XbRlo_4EyXvMsjg/348s.jpg", "caption": "Salmon dinner"}]}}, {"review": {"des": "Simply the best. Great food, service & jazz band nightly. It's an everyday day restaurant with an upscale flare. The menu is simple yet versatile. With great starters including the famous macho salad and their beef ribs is like none other. Chicago's hidden gem.. literally", "pics": null}}, {"review": {"des": "Always a reliable place to eat downtown! Luv their mixologist's cocktails and my friends like their Amsterdam beer. I always order the ribs - soft meat with kinda sweet bbq sauce. My friends like their salmon dinner. The service is outstanding! And there was a live jazz band last night:), a lovely bonus. I'll refer this place again to my out of town Friends! FYI - it has a small door for an entrance that takes you to an escalator to the restaurant. Just look up when waking to the place in Michigan Avenue!", "pics": null}}, {"review": {"des": "Had the ahi tuna platter off a friends recommendation. It presents as well as it tastes. The second they put it in front of me, a stranger asked me what I ordered. Super tasty dinner", "pics": null}}, {"review": {"des": "Great atmosphere! We sat next to the jazz band, which they have every night and I thought it would be loud but it wasn't, i went for my anniversary and my wife loved it, our waiter even gave us a dessert on the house! I had the lamb sandwich, which I highly recommend and my wife had the ribs. It was well prepared and well displayed, we will definitely come back again!", "pics": null}}, {"review": {"des": "One of my favorite places in Chicago! It's a great spot, right in the middle of Michigan Avenue. The burgers are so good! The bun is perfect and the meat is super flavorful. <br><br>The duo dip - half cheese dip and half guacamole dip, is a must try. Trust me, the cheese dip is addicting. And you will want more. <br><br>The bistro salad is so good, and might be my favorite salad ever! Between the rotisserie chicken, goat cheese, almonds and dates, you can't go wrong. I recommend splitting this salad and a burger with another person. That way, you get the best of both worlds. <br><br>During our last visit, we noticed many of the guests were ordering their famous cornbread dish. So we decided to try it too. While the cornbread smelled amazing, there was really no flavor at all; and actually pretty disappointing. Besides that, anything else I have ever tried has been delicious. <br><br>The service is stellar and super friendly. One more tip - order their signature margarita!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/udUOlc7EtNFCLneDZKar4w/348s.jpg", "caption": "Signature Margaritas"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jh2OelFklfalj4yzJBar5A/168s.jpg", "caption": "Burger"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/M9h79Cb9PaXqslGAwEhw3w/168s.jpg", "caption": "Macho Salad"}]}}, {"review": {"des": "I would probably give the food a 3.5 but the ambiance of this place is really nice so I'm rounding it up to 4 stars.<br><br>This has live jazz music every night. The lighting is dark but moody so it's great for date nights. They had a pianist, a cello/bass, and someone on drums. It felt so snazzy sitting there under the lights.<br><br>I got the French dip sandwich and it was okay. The bread was toasted well and really buttery. I thought the au jus sauce was not that tasty though. It just tasted like brown water. I had to add salt to the sauce which is not a good sign. The fries on the side are good though.", "pics": null}}, {"review": {"des": "I'd been wanting to check this place out for a while and this past September was the perfect opportunity to do so as I had a meeting downtown. We broke for lunch and headed on over and were greeted and seated immediately --which was great as we were on schedule. <br><br>We were a party of six and our order consisted of various salads, soups and sandwiches. I the soup du jour (chicken tortilla) and the macho salad. I spied the lamb sandwich and the crispy chicken sandwiches at our table and was feeling a little jealous but my soup and salad combo was quite tasty and hit the spot! No regrets. <br><br>Great, attentive service. Our server was conscious of our time. Reasonably priced for downtown. Will return.", "pics": null}}, {"review": {"des": "Currently my absolute favorite restaurant in Chicago - devastated they have so few locations and all on the West Coast aside from this one. First visit here was as a guest of visiting friends - a  group of 3. We were lucky to snag a seat by the window and live music on a Sunday evening, adding to the incredible atmosphere. The atmosphere is much classier than I expected, with wait staff dressed well and the live music, however dress is classy. I would still take someone here to impress them however. Let's get down to the food:<br><br>The cornbread as an appetizer is a MUST. Corn pieces within and served in a skillet it is a delicious treat to serve 2-4 people. First entree I got was the Pork filet - very tender and juicy. Sides of mashed potatoes were generous along with delicious vegetables. What sold me on Bandera was the Prime Rib on my second occasion. I treated my father who was visiting from out of town to Bandera and he thoroughly enjoyed his Trout entree as I devoured my Prime Rib. The portion was huge - the size of what I'd believe a dinosaur slice to be. The potatoes as a side again were an excellent choice. I can't say enough good things about Bandera except that you must go STAT!", "pics": null}}, {"review": {"des": "Very nice restaurant! The ambiance and live jazz combined with great food, makes Bandera a winner every time! The menu is small, but we've never had a bad meal here. The staff is friendly and attentive and the dark walls and huge windows overlooking Michigan Ave makes for a great overall dining experience!", "pics": null}}, {"review": {"des": "Yesterday I had the pleasure of dining at the chef's table. If you love and appreciate good food and given the opportunity you mustn't miss. The efficient and detail oriented kitchen staff was a pleasure to watch. Dips prepared to order, all veggies sliced fresh to ensure the best quality and freshness. Every bun toasted to order, every tomato and lettuce leaf placed precisely. No food sitting around. As soon as it was prepared, it was delivered without delay. The communication and teamwork of the entire staff was amazing. The expedition of food from garnishes to fresh squeezed lemon on dishes was impeccable. The bar is held to the highest standard. I enjoyed the chicken black bean chili accompanied by creamy goat cheese and it was delicious . The emerald kale salad was filled with great flavors and textures. Ding's chicken sandwich was served on pillowy soft bread with creamy slaw and juicy fried chicken...I couldn't ask for more. To an excellent job by all: Bravo!!", "pics": null}}, {"review": {"des": "Excellent service from Hostess to server<br>Truly enjoyable atmosphere <br>Good for dining on your own, perhaps at the bar, or at the tables<br>Culinary delights range from unique or and creative to gourmet comfort food, with wholesome quality ingredients from local farms! <br>Excellent variety of wines<br>Other drinks Mixed with expertise,<br>Easily social volume in restaurant where you can comfortably hear each other speak...<br>Excellent superior jazz artists always featured here.<br>Servers knowledgeable, professional and sophisticated while remaining warm and friendly.<br>The right balance of atmosphere and a pleasing dining experience", "pics": null}}, {"review": {"des": "We are here during marathon weekend so of course most places are packed , I found this restaurant based of reviews and omg am I happy I did. When we first arrived there was a 30 min wait , it they offered us a frigate seat over by the chefs and it was seriously the best if you ever get the option to sit there DO IT the music was nice but watching all the amazing food be prepared and sent out was a show in its own ! Every plate was sent to a table perfect. We had the chicken and rib plate and everything on that plate was heavenly , we also got the macho salad and that needs its own five star rating, fresh ingredients tossed in an amazing dressing ! We are big foodies and our meal was amazing ! I would travel to Chicago just to eat here !  Also the staff was awesome .", "pics": null}}, {"review": {"des": "I came here with a co-worker on a Friday evening. We had a reservation and were super happy that they were able to accommodate us at a window table overlooking N. Michigan Ave. My co-worker insisted that we get the cornbread skillet. I have to say it was amazing. There exists no other cornbread that can compare. Really really exceptional!<br><br>For entrees we both got a salad. I LOVED my ahi tun salad. The tuna was seared perfectly and the salad itself delicious. Our waiter was really good too. My co-worker had a martini. About halfway through the drink the waiter came by with a frosted martini glass and poured her martini into the fresh icy glass. I gotta say- it impressed us!<br><br>I had been here once before with my brother and really had a great experience. And now being back many years later it still hits the mark. I'd highly recommend this restaurant!", "pics": null}}, {"review": {"des": "Historically the guy named Bandera hasn't been a good fella, at least not for the Soviets and their allies including the Americans, but this place has nothing to do with the guy named Bandera (I hope) so we decided to check them out, live music, good vibe, good tasting food and nothing is overpriced. Had a really great time here. <br>Recommended", "pics": null}}, {"review": {"des": "Dined here a couple nights ago after a recommendation from our Lyft driver (s/o to Alan!)and still thinking about it! We sat at the bar and ordered drinks (great pours) and the dip duo with guacamole and jalapeño queso. The queso was more like a pimento cheese than a white queso dip we usually get in the south. It was delicious and the guacamole provided a nice balance.  For our mains, we split a chicken ceasar and the salmon with mashed potatoes and roasted peppers. The salad was great but the salmon was the real star of the show. Cooked to perfection. <br><br>The service was also great and the live band was really nice. Not too loud so you could still have a conversation. Would definitely recommend and return.", "pics": null}}, {"review": {"des": "Delicious food, great music, great vibe/ambiance. <br>You have to try the corn bread and the ribs!!", "pics": null}}, {"review": {"des": "It was very distressing to witness an African American family treated so badly at your restaurant on Saturday.  Management could have done a better job and they made no attempt to control the angry patron.  Bandera will no longer be a the top of my list to give family and friends a positive view of Chicago.  And I will pass my concerns to members of The Goodman Women's Board and the Peninsula Spa Club members.", "pics": null}}, {"review": {"des": "Bandera was one of our favorite restaurants...until tonight. We went there with our 1 year old daughter and were told that they don't have high chairs because they decided they are unsanitary and were escorted out by the manager. My husband and I have gone to Bandera for years and have even gone many times since our daughter was born on date nights, but apparently people with children are not welcome here. Needless to say, we will NOT return to Bandera.", "pics": null}}, {"review": {"des": "I used to come here often.  I would've given them 5 stars in the past, but they really disappointed me by removing their staple cornbread skillet from the menu.  Was so looking forward to it, but was extremely disappointed that it was no longer on the menu!  (Bandera Mgmt - why did you take away my cornbread??!?! The 'replacement' bread basket is okay, but not in the same league as the cornbread.  Why tease me with a few little pieces of cornbread croutons?). The veggie burger is delicious, but I won't be returning to Bandera for the veggie burger until they bring back the cornbread skillet.  Please bring it back soon!!", "pics": null}}, {"review": {"des": "Bandera's service is typically stellar, but current management is shameful. This evening they went out of their way to make our visit as uncomfortable as possible. The wait staff was pleasant, but the management  ruined what was a traditional kick off  for the holidays for our family, by leaving our children with questions about why people can comfortably treat people with very little regard. The management was dismissive, seemed agitated and accused us of being threatening because we simply questioned policy changes that were new, but often changed from moment to moment to keep us from enjoying our experience. I felt extremely unwelcomed and it broke my heart that my children were a witness to such appalling service. The Hillstone Group needs to do a better job of training their management team, and they completely missed the mark with the Chef who was dismissive, extremely aggressive, and short tempered with us after another patron who had not been seated for more than 15 minutes felt the need to tell us our children were out of control and ruined her night when they weren't doing anything other than occassionally visiting each other's tables after quietly and patiently waiting for 3 hours. Other patrons had no complaints and actually complimented the children on being well behaved after such a long wait. A mother of the group was rightfully offended addressed the patron, and management aggressively told her to leave and threatened to call the police, which was completely unnecessary. Tonight's management team was an embarrassment. I've been a patron for years and this was by far was a shocking, traumatic, deplorable and humliating experience.", "pics": null}}, {"review": {"des": "If you visit the Magnificent Mile this is a must. From excellent service to excellent food, Bandera did not disappoint! EVERYTHING was delicious. I'm a foodie and like to try popular eats with some skepticism but I was very content with my plates here. <br>Tip: come early! This place gets packed very quick. I decided lunch was my best bet and although they just opened, the dining area was already full. If you have to wait....it's worth it. Enjoy!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iVZqSvaRU1nl7Te568a32g/168s.jpg", "caption": "French dip"}]}}, {"review": {"des": "An all-around excellent dinner, starting with the artichoke appetizer (when available), followed by a delicious French dip (me) and a succulent chicken/rib combo (my wife). We both really enjoyed our respective entree. Live jazz; great service. Highly recommended.", "pics": null}}, {"review": {"des": "The atmosphere here is very nice. You have some jazz music in the back ground. It was busy and crowded when we went. May want to call ahead and reserve a table. The cocktails were great. We sat at the bar before dinner. Spinach and artichoke dip was pretty good. At the table I ordered the salmon. Great flavor and grilled perfectly. The mashed potatoes were very tasty. Service was good. Definitely worth checking out.", "pics": null}}, {"review": {"des": "So this ended up being the end of the line when we needed to stop and eat. And boy am I glad we did.  Had the Macho Salad (exceptional) with Corn Bread as the App and Lawdy was that the BEST CB I've ever had!!!!!  As you would expect the service was on point and the jazzy atmosphere is great. So glad we ended up here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jddgS2Bjl-ODC-d1V7j5vQ/348s.jpg", "caption": "Step 2 - the chocolate espresso sauce makes this one a must."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DhJFChOa8H6sSSV-GvS6rA/168s.jpg", "caption": "The corner view."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VxOHehNW8gtqoMY-PJga-A/168s.jpg", "caption": "This is where it's at!!"}]}}, {"review": {"des": "Received a surprise anniversary gift from my kids while we were on our mini family vaca. We used a gift card for our date. They were waiting for us as my daughter made the dinner reservation and asked for a booth. We were seated promptly and ordered a few drinks along with a shrimp appetizer. They were ice cold and really nice size. Our waitress was wonderful and in conversation learned she was from Bakersfield. She went out of her way to insure that everything was good with our drinks and our dinner after it was delivered to our table by other staff members. Our table was close to a fridge where they keep chilled martini glasses and a guy left it open and we saw our waitress hit it hard. We asked her right away if she was ok and she shook it off, but I'm sure it was a really bad hit and she probably bruised. She kept a smile on her face and was professional thru it all. Hubby asked about the food and she told him about the Famous French Dip and I ordered the special of the day which was a halibut. Everything was very good. Especially enjoyed the three piece band that was playing. The atmosphere was dark and romantic. Couldn't have asked for a nicer place to celebrate our 33rd Wedding Anniversary.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZZ22hn8MvU0Lr40G7a8CwQ/348s.jpg", "caption": "Famous French Dip made from sliced prime rib"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3U2W_Vq62UR4FdsJHURF2Q/168s.jpg", "caption": "Halibut Special"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/omwa5rE18R1_0Vk7EJRs5A/168s.jpg", "caption": "Chilled Jumbo Shrimp"}]}}, {"review": {"des": "Hi,<br><br>I've been a patron from many many years as I work downtown.  I even have stopped by sometimes for a to go order.  The food and service has always been great, no doubt but for all guest that my company have entertained into town for a visit I have always recommended this place and while there to definitely try their cornbread skillet as this has always been a staple of this place.<br><br>Recently upon choosing this place to dine for my birthday I was informed that the cornbread skillet was no longer on the menu.  That was literally a true let down because this is one of the reason why I had chose to come here on this particular occasion.  Although I love the Country Chicken amongst other wonderful dishes but you cannot ever come here without having or leaving with an order of cornbread skillet.  I mean it was just that good and different.  However they did offer me some ciabatta bread in place of it but I was definitely disappointed.  Trust me it wasn't the same. That being said, this will no longer be a frequent visit for me as this was one of the staples that have kept me coming throughout the 20+ years.", "pics": null}}, {"review": {"des": "Beautiful restaurant, great location and menu.  The entertainment was also good.<br><br>Service was great and loved the atmosphere.  Try the special cocktails, they are fabulous!", "pics": null}}, {"review": {"des": "I have no idea why people like this place<br>The food is mediocre to awful and so is the service<br>Overpriced and one of worst in this chain.<br>Avoid!", "pics": null}}, {"review": {"des": "Omg this restaurant is extra classy! I visited with a group of friends for my birthday! We ordered the seafood tower it had oysters, clams, crab, shrimp, and lobster it was devine.  We sat outside and our server was very attentive and pleasant.  I ordered the New York  strip with mac and cheese and spinach. Everything was delish! My server even brought me a special dessert to help celebrate my birthday. It's pricey but it's worth every penny.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8rkUB-NmDdUYuJIcEFxayQ/168s.jpg", "caption": "REMY side car!"}]}}, {"review": {"des": "We had by far the worst experience in a restaurant ever.  Myself and my party of five arrived to our reservation, where told we couldn't be sat because one person was not present yet, we where made to wait almost until 10. We waited by the bar, we had a drink and then once we got sat where denied service by the most condescending and somewhat racist so called manager by the name of Owen Huzar. I say racist because out of the entire restaurant, the only table speaking another languages there than English was us and then got denied. It was my 40th birthday and ended up being a horrible experience. Never come here and avoid all hillstone restaurants everywhere.", "pics": null}}, {"review": {"des": "I was brought here by a friend. This is a wonderful place. It's a wonderful mix of old school traditional with modern touches.<br><br>The service is as good as I've ever seen. As a former CEC, I know when I see a front room working as a team. Many of the servers have been there 20 plus years. They are warm, attentive and move smoothly through the room. Every course and every drink was delivered by someone else. Because they don't keep their guests waiting.<br><br>Live Jazz. Wonderful. Paul Martin Trio on Wednesday and the room was full, with people in line. Volume was perfect, tempo was great and the selections were great. A few Sinatra songs and I was in heaven.<br><br>The drinks are made beautifully by real, experienced bartenders. I tried both old fashioned's and manhattans. Even their well brands are strong. My friend had a filet that was perfectly prepared. I picked a simple dish, just see how they would do. It was Country Chicken. You can't hide a badly prepared chicken this way, and I was pleased. It was moist, flavorful and I enjoyed it- hell I enjoyed my entire evening. As I'm traveling here at often, I'm looking forward to becoming a regular. <br><br>There are fancier places. There are Michelin starred places. But for the value, intimacy and service, this is a winner", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9baVUPI9PTPsQ_th9pe02g/348s.jpg", "caption": "This is  how you have a cocktail"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TsHj3tRYNEgBZnvF9SrGrQ/168s.jpg", "caption": "Cornbread. Yes, cornbread"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-6Tod4P8UafZYLcZaN1_yQ/168s.jpg", "caption": "Paul Martin Trio"}]}}, {"review": {"des": "I would give this a 3.5 star. While the service and ambience were nice; however, they have a limited menu selection. <br><br>The BBQ salmon was nice and moist and accompanied with broccoli and mashed potatoes. With $29 a plate, I was hoping they will give me a bigger cut of salmon. A thicker cut would help too. :)<br><br>My friend has their chicken and rib combo and  the chicken was a bit dry but the rib was delicious (the meat just fell off the bone).<br><br>The Oreo cookie with ice cream was delicious especially with the yummy chocolate sauce. The cobbler was ok.", "pics": null}}, {"review": {"des": "Overall I enjoy my experiences at Bandera. The food is always A1and the ambiance gives off such a cool vibe. The live band contributes to that greatly. <br><br>Food:<br>I got the Salmon last night. My meal as a whole was great. I just felt the fish was a little too sweet for my taste.", "pics": null}}, {"review": {"des": "Absolutely not my taste of food. There was mayo in my Cesar salad and all the food that came out was half hot half freezing.<br><br>I'm confused how this place got this many stars. The entertainment was beautiful, but I was hungry, and didn't leave happy.", "pics": null}}, {"review": {"des": "Came here for Valentine's day and was not disappointed. I got the Dutch country chicken and my fiancé got the double cut pork chops. The chicken was okay, some parts were a little dry, but the reason for my five star review is the pork chops. It was soooo delicious and juicy and I normally don't like pork chops! By far the best I've ever had. The live jazz playing the background created a really nice environment and gave the place a great ambience. Would definitely recommend to anyone looking for a nice romantic meal that isn't too heavy on the wallet.", "pics": null}}, {"review": {"des": "We had an awesome dinner. From the minute you walk in, we had superior service, to the fabulous meal and the live jazz music was the icing of the evening. Our waitress Mary Ellen (?), was energetic, had fabulous recommendations and was very attentive. <br><br>The cornbread, grilled artichokes and Macho salad a must.", "pics": null}}, {"review": {"des": "I wanted to be cool and take my girlfriend out on a \"nice\" date.  After reading some reviews and descriptions about this place, I thought this was great.<br><br>The best thing about this place was the atmosphere.  Great view (if you're sitting by the window) and great music!  They have a guitarist and pianist playing jazz all night long.  <br><br>The food was OK but nothing \"to die over\" as some of the comments were saying.  Nothing special really...Although, the cornbread i thought was delicious!  We also ordered the oreo dessert which was pretty good.  <br><br>The staff was nice...like, VERY NICE.  It got awkward at times.  I mean, not complaining about this, I'm Just saying it would be cool to tone down on the nice-ness a bit.  <br><br>I think the only way I would come here again is for maybe some drinks with friends or girlfriend, but not so much for the food.", "pics": null}}, {"review": {"des": "We traveled to the North Michigan Avenue in Chicago for hot meal(dinner), and they have jazz with a three combo.<br>We get seat about 7:50 pm for 7:45 reservation, we were a tad last.<br>The spinach dip was very good, and they left the salt shaker in the kitchen.  The lack of salt was great for me.<br><br>Roc has the trout and she was very thankful.<br>The Seattle-Style BBQ salmon was on point with the pommé purée and broccoli .<br><br>They service honey for sweeting my cup of tea.<br>The desserts were hit and miss.<br><br>The miss was the apple walnut cobbler with a side of vanilla ice cream. The apples and nuts were better on the tree. The milk for the ice cream missed it calling as ice cream.<br><br>Now for the banana cream pie with whipped  cream, caramel sauce, sliced bananas (huge), and shaved dark chocolate was good......<br>I would get a taffy apple from Old Town Fudge Pot next time .<br><br>The company for dining was over the top....<br><br>Shalom", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XooEhpawUAQpjYhpFEUoDg/348s.jpg", "caption": "Not as good as it look . The crust was over the top  Shalom"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oGjYy9RfCRtA6vPDr13vzQ/168s.jpg", "caption": "Awesome person of God  Shalom"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/41r3rtf1V516A6NWChqJzg/168s.jpg", "caption": "It taste better than it looks .... Must have dish ...  Shalom"}]}}, {"review": {"des": "I love this place!! Be sure to make a reservation or you could be waiting a long time for a table. The autmosphere is moody, dim lights, live music, and lots of noise from the busy environment. If you go during artichoke season you have to get one. They're so yummy, I wish they could have them all year around. All entrees I have had have been fantastic and some have had unique flavor combos which make them fun and different. But let's talk about the dessert you have to save room for it. The Oreo cookie with ice cream is my favorite.", "pics": null}}, {"review": {"des": "This was always our place to grab a delicious meal good wine and beautiful atmosphere with jazz music! Last 2 times have been disappointing and tonight was beyond disappointing. We were shopping and craved our favorite things they were out of shrimp cocktail and prime rib at 730pm. Then my husbands food was completely cold. They apologized and finally brought it out after I was completely done eating so I waited for him and we can missed our movie. Ps: they also do NOT have their legendary corn bread anymore..the only bright spot was they do have our favorite red by the bottle which helped The bad experience: O'shaughnessy it is so worth the bad time tonight but sadly we decided we wont give this restaurant another try.", "pics": null}}, {"review": {"des": "Came on a Tuesday night for my birthday. Had reservations at 7:30pm but table wasn't ready until about 7:45pm. No biggie but definitely glad we had reservations since the place was packed. Bandera oozes with swanky, jazzy Chicago style ambience. It's dark with an open kitchen and dim lighting. The live jazz was phenomenal and upbeat. <br><br>I had the burger which was just delicious and cooked just like I like it. It was Smokey and super flavorful with a special mayo on the side. We also had beef ribs which stole the show with the sauce and texture. They came with this coleslaw that I'll be dreaming about for years to come. Service was super polite and attentive. Drinks were on point. Short menu but super well made food. I loved it here!", "pics": null}}, {"review": {"des": "What have you done with the cornbread??? Still a nice place with good food BUT I was longing for a tiny cast iron pan of Bandera's exquisite cornbread, only to learn that it had been replaced with focaccia, which I'm sure is quite tasty, but really?!? You removed cornbread from the menu entirely? Did you learn nothing from New Coke? The cornbread wasn't broken, it was sublime. Please, puh-leeze, bring back the goodness!", "pics": null}}, {"review": {"des": "I was eager to try this place as I had heard really good things about it, so I chose it for my birthday dinner.  To be quite honest, I wasn't too impressed.  I made reservations a week out and when I arrived to the restaurant - before my friends - I was told I could not be seated until the whole party was there.  I'm sorry, but this type of policy is archaic.  We live in Chicago where the traffic gets bad downtown on a Friday night. Don't make people stand...you could've got drinks and appetizers out of me.  That's lost money. <br><br>Letting that go - we were finally seated.  We all ordered quickly and the food was brought our. My prime rib and fries were cold, which clearly indicated to me that the food had been sitting out.  This place is considered to be upscale dining, however, the food did not reflect that.<br><br>Finally, the music was loud and despite my telling the waiter to please speak up, they insisted on not speaking up.  All in all, I don't think this place was as good as it's made out to be.  I probably will not be returning or recommending.", "pics": null}}, {"review": {"des": "This was one of the best restaurants that I've ever been to. I started out with the jumbo shrimp appetizer and I was very pleased. It was some of the freshest shrimp that I've had in a while at a restaurant. Then I had the arctic char with tabouli and broccoli. The fish was delicious. It was meaty and had a nice drizzle of sauce of some sort. We unfortunately were not able to listen to any of the music because they only had 10 PM reservations available (the music stops at 10pm). I saw a sign that said the live music was every night. In the future, if I want to go there on a Saturday night, I'll be sure to call a few days in advance to make a reservation. Lesson learned. Then we had our grand finale. We had the cobbler with ice-cream on top. It was warm and sugary and delicious. It melted in my mouth. Every bite was taking a bite of heaven. The next time I'm in Chicago, I'm going to try my very best to make it back to Bandera.", "pics": null}}, {"review": {"des": "Visited again and glad we did.  They updated the Kale salad and added rotisserie chicken.  It was a nice addition and the portion size was outstanding.  Everyone else had threee different fish entrees.  Salmon, whitefish and trout.  All of them were wonderful.  The mash potato accompaniment disappeared. <br><br>The live jazz continues to be a great touch.", "pics": null}}, {"review": {"des": "Great food however they removed the best item from the menu... cornbread! Waitstaff is great though! Martinis could be filled up all the way!", "pics": null}}]}