{"name": "bang-bang-pie-and-biscuits-chicago", "reviews": [{"review": {"des": "I'm not crazy about key lime pie but this is the only slice of pie I'd be willing to pay $5 for! Also had the pecan pie and a biscuit - and they all hit the spot (especially when the Chicago temperature drop below 0 degrees Fahrenheit during the winter).<br><br>Hope to be back soon!", "pics": null}}, {"review": {"des": "We ordered way too many slices because we wanted to try all of them! Loved all the other pies we tried especially the crusts. We had pastry and crumbly crusts and they were amazing! We enjoyed these pies in their outdoor patio.<br><br>Key Lime - all time favorite. It was a perfect balance of tartness and sweetness.", "pics": null}}, {"review": {"des": "Just shut up and take my money. Seriously. Take it. And can I tip you? Because holy mother of all heavenly baked goods, I will be eating here every time we are in Chicagoland. Bang Bang Pie & Biscuits is like, if you said, \"Sue, tell me what your ideal restaurant would serve.\" My reply would be \"Pie and biscuits, why?\" <br><br>Uh, OK. So let's see. This place is cute, on a corner and tiny as hell. So chances are pretty high that you will have to wait in line outside the door. All fine as long as it's not raining or cold as balls. So make sure you dress for a 20-30 minute outside wait. Once you get inside, you can peruse the menu options. It's not a big menu but there's something for everyone. I'd encourage you to read closely too, as you can kind of cobble together what you want if you don't see it offered straight out. Also be sure to check the specials board by the register.<br><br>I want to make a special mention of the woman who was the cashier. She was super friendly, very patient, answered a ton of questions and handled all of our random requests (this with this and this, this to go, this for here) completely in stride as if I asked her what time it was. In terms of having the right person as the \"face\" of your business, this young lady nailed it. I even tipped her, which I never do with those ipad tipping things. She earned it.<br><br>OK, food:<br>-I got the gravy biscuit with \"the works,\" which is a slab of delicious, savory sausage and a poached egg. It's basically biscuits and gravy. Go for it. The sausage was boaderline too spicy for me, but I am a wuss. Still I managed to eat pretty much the whole thing pausing only long enough to mutter something about the sausage being spicy while I shoved it in my pie hole (see what I did there? LOL). The gravy was reeeediculous.<br>-A plain biscuit with the butter and jelly. Quite honestly, this was equally delicious. The plain biscuit allowed you to taste the lovely layers and flaky goodness, which seemed like they'd been simultaneously soaked in butter but also baked to light, airy and fluffy with a hard buttery crust on the top. SO GOOD. I pretty much inhaled it.<br>-My husband got the shrimp and grits, which he seemed to enjoy. That's really all I can say about that.<br>-Candied bacon was bomb.<br>-Hashbrowns were OK and the only thing I would skip next time (mostly to make room for another biscuit).<br>-Coffee was good and strong with free refills.<br>-Finally PIE. Just get as much as you think you can reasonably take home and eat before it goes bad. My favorite was the almond (which was the special of the day and absolutely delicious from start to finish), plus it was unusual, which I appreciated. Then we got the chocolate pecan (fine), the key lime (I think fine, my husband ate it all) and apple cider, which was interesting because there weren't any chunks of apple. But still delicious. Ask for it to go and they put it in lovely little to-go pie slice shaped containers.<br><br>Service was great. The gentleman who brought us our food got me more coffee and was super great too. Not super cheap but pretty much in the ballpark for what we'd normally spend on brunch. Total home run. Damn, I really want one of those biscuits now. I just ate dinner and I've made myself hungry again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Dn56rMoqD32xFD04aTBgaQ/348s.jpg", "caption": "Almond"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tFds0CVD-tOk8X1vl2ZV1A/168s.jpg", "caption": "Gravy biscuit with the works"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nfCz4j3lA5ZsP2QVWzk76Q/168s.jpg", "caption": "Hash browns and bacon"}]}}, {"review": {"des": "One of the reasons I chose to spend my final night in Chicago in the Logan Square neighborhood is because of this little biscuit place. Yes, I love to plan my travel around the nearest amazing food.<br><br>I arrived mid-morning on a Sunday, luggage in tow because my next stop was O'Hare. I knew before I even saw the sign that I was at the right place because there was a line 30 people deep just to get in the door. And nothing says great food like a long line. Am I right?<br><br>Luckily the line was moving at a steady pace, so I only ended up waiting about 20 minutes to get inside. I was cutting it a little close, and asked myself more than once if missing my flight was worth one of these amazing biscuits. The answer, of course, was yes. But when I got to the counter and saw the menu, I noticed they also had several grits dishes for breakfast. I love grits. I've actually gotten into verbal arguments with people over grits. Okay, once. With an ex. But still!<br><br>So I ordered a plain biscuit with just butter and jam, and a bowl of their lovely and amazing grits that also featured avocado and a perfectly poached egg. Oh and pimento cheese, which I have never tried but have certainly heard a lot about on Yelp. I also grabbed a hand pie and a plain biscuit to go, you know, a souvenir for the plane ride home. I dragged my luggage out into the biscuit and pie garden, which is kind of like a beer garden but with no beer, and waited about 10 minutes for my yummy food to arrive. It was well worth the wait on the risk of missing my flight. Which luckily I didn't. But still. Amazing food and a great place to end an epic foodie trip to the big city.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DWHvuKl_hdZ4BGnSmxayuA/348s.jpg", "caption": "They brought out ginger scones to keep us alive while  in line."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-PISljmqjhYYSX6qL2UPHA/168s.jpg", "caption": "The biscuit garden."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1x0wvNyEJVdChTr3-YzUNw/168s.jpg", "caption": "You know it's good when there's a line."}]}}, {"review": {"des": "Dang this place masters everything - the sweet, the savory. There's a wide selection of biscuits with deeeelicious, thick and savory gravy. Worth every single penny. Their pies are good too and you pay for the quality. <br><br>It's a cute joint because it's casual but has a cute character. Would definitely swing by again and the staff is so nice! <br><br>Order the plum apple pie if they still got it. It's slightly scary but they mastered every inch of pie perfection.", "pics": null}}, {"review": {"des": "Food: wonderful breakfast sandwich and awesome pie. I got the ham and egg sandwich on a biscuit and this sandwich definitely stands out from other breakfast sandwiches. The highlights of bang bang are their pies and biscuits as their names states. All of their pies were really good, my favorite however was the key lime pie.<br><br>Atmosphere: super hip and trendy place with an awesome outdoor area to eat. The cashier was super friendly.<br><br>Price: paid around $14 for breakfast. Definitely worth the quality of the food. <br><br>Overall: while this place might be a little out from downtown Chicago, this place was an awesome place to visit. The combination of the super friendly atmosphere and the amazing food definitely makes me wish there were more places like this on the east coast.", "pics": null}}, {"review": {"des": "My sister in law got pie here for thanksgiving this year and i can honestly say they were gross. Both the pumpkin and the chocolate pecan tasted burned but also the flavors were just off. When we were leaving my SIL said \"take some pie!\" And it's probably the first time in life I've left pie behind lol. Sorry bang bang. Maybe they were overloaded for the holiday but if this was the only time I'd ever tried them, I'd never go back.", "pics": null}}, {"review": {"des": "Bang, Bang. Thank you, Ma'am.  My way of saying my experience here was distinctly unsatisfying:<br><br>So yeah... Have lived in NYC forever now, yet have been unable to shake the conviction that my former stomping grounds, aka the Midwest, does pies better.  <br><br>I have particularly fond memories of Door County Sour Cherry Pie, with its fruity, sweet-tart filling and flaky, buttery crust.  Alas, they didn't offer that on our visit.  Instead, hubby, kid, and I shared a slice of Cherry Limeade Pie, and another featuring Malted Milk Chocolate with Salted Caramel.  Sadly, ITA with Heather E. in that both our pie slices tasted faintly of refrigerator burn.  No bueno.  In retrospect, we should have exchanged them, so it's partially our bad. But still.  <br><br>If I had to pick one over the other, disregarding the aforementioned issue, I'd definitely go with the Cherry Limeade for its tangy, citrusy flavor over the muted chocolaty sweetness of the Malted Pie.<br><br>Going with two stars, since both pies would've had potential were they not marred by refrigerator burn. <br><br>Bottom line:  Wish I could get a take-back, especially since our visit here was part of a whirlwind three day trip, meaning every single bite counted.  I know Chicago can bring it when it comes to pies.  Disappointingly, not this time.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cXr2eAu7l-mNOznYO9bbPQ/348s.jpg", "caption": "Not feeling very Cherry right now. Just found out my bf has a checkered past."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/V9n8AMwWsM1fyeTl75su5w/168s.jpg", "caption": "Wood you like a bite?"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/46oJcHs11NImvqYZMm74aQ/168s.jpg", "caption": "Hottest Mugshot ever."}]}}, {"review": {"des": "You had me at BISCUITS! I love finding fresh, made-from-scratch, homemade, hearty breakfast gems like this in cities. Notorious for a long line, but it moves quickly, and is very much worth the 20-25 minute wait...lots of good dog-watching (and petting) to do in the meantime. :)  Small interior pie-shop set up with a few tables and a cute outdoor patio area.<br><br>I'm a salty savory gal, so I ordered accordingly...fall veggie grits (seasonal daily special), chicken pot pie, and the avocado biscuits. We took 2 pie slices to-go...chocolate pecan & spiced plum. YUM!<br><br>MUST TRY: The chicken pot pie and ALL of the different biscuits...which are HUGE, btw. Be ready to indulge in a nice mid-morning nap afterwards.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/evXVjQWoYKpg3MsP3YDBpA/348s.jpg", "caption": "Fall veggie grits + Chicken Pot Pie"}]}}, {"review": {"des": "Great vibe. Cool spot...even on hot summer days. They have a big outside patio when the inside is full...and even on those hot summer days the picnic tables have big umbrellas so it's not that bad. The inside is cute, but small. Total hipster vibe, fairly fast service. The staff is nice.<br><br>Notes: cold brew coffee on draft. I like coming for brunch and getting biscuits, but it's a very filling portion that you could probably split with someone if you're not too hungry. Their biscuits are delicious, a little dense. I like their sausage gravy, it's more peppery than most.<br><br>The food & drink:<br>Orange Juice - your standard OJ<br>Arnold Palmer - delicious<br>Philly chicken biscuit - it was okay, good chicken, but overall, it was a little bland<br>Biscuits & gravy with egg and sausage - this is my jam, love the peppery gravy<br>Biscuit & sausage - also delicious with crispy cheese (this is amazing) and a blood orange raspberry jam (also amazing)<br>Key Lime pie - my fav pie of the summer (could eat this all the time)<br>Lemon Cream - pretty delicious<br><br>TLDR: definitely worth checking out. sometimes they a have a line out the door, but it's mostly because there's not much room to wait inside. Once you get in, there's usually a fair amount of seating available unless it's winter time when no one is sitting outside. Definitely try their pies (sweet)...and then biscuits at some point.", "pics": null}}, {"review": {"des": "Have had many disappointing pies at the Ravenswood location in the past. However, the key lime and oatmeal chocolate chip pies I got today at this location were really great. They key lime was just the right amount of sour with an awesome graham cracker crust. The oatmeal was just like a soft pie-like cookie.<br>I may come back and try different pies at a later date but am hesitant because of the lack of consistency between the two locations. Makes me question the consistency of the overall quality of the pies", "pics": null}}, {"review": {"des": "I had an awesome time trying the pies but I know I had better specially if bang bang claims to have pies as their specialties.  The ambiance is awesome because you can sit outside in the patio enjoy the nice hot weather or sit inside and have a great Time  too.  The service is top notch and the extras are great.  You can self serve cold water or enjoy other food at bang bang is not just for pies.  It is hipster place which makes everyone feel young.  The pies that I tried were ok I wish they had like walnuts or pecan pie or custard pies.  I am sure the baker can make more creative pies like pecan pie.  I know the slices are pricey but you are paying for good quality and for the ambiance and packaging. <br>.the service is awesome  I come to eat pie and other specialties", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YwFl058pDqEdKvpiL5cy7g/348s.jpg", "caption": "Chocolate pie"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jUBELHKrpJa6TnZ88gGDjQ/168s.jpg", "caption": "Lemon pie"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PSnkBDJ8bYsE4OoJfOX8vQ/168s.jpg", "caption": "Rhubarb pie"}]}}, {"review": {"des": "The chocolate pecan pie was sooo good. Out side seating is very nice and the staff are really friendly and knowledgeable about the menu", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DxxYcq5pnBiDdaaly4qdGw/348s.jpg", "caption": "Chocolate pecan pie and The Chocolate"}]}}, {"review": {"des": "A great fall Feast! Around this time of year I always seem to want a hearty meal and a tasty sweet pie. Well I definitely found that here, my husband and I ordered both the menu's potpies which were chicken potpie and the chili pot pie. The chili pot pie was our favorite! But to the credit of the chicken potpie, it was tender and packed with quality flavor...alas the chili was just more unique. I also was able to enjoy the chocolate pecan pie, which I would really recommend for your Thanksgiving dinner dessert offering.", "pics": null}}, {"review": {"des": "I really should come here more often for breakfast. Their biscuits are perfect. I've been here a handful of times and always get a scratch biscuit and lather it with their home made jam and butter. This visit was different, I opted for the ham biscuit, and an iced coffee.<br>The biscuit itself was of course perfect. The ham, generous, and the chive butter...salty, too salty. Nonetheless , I still indulged, and some how managed to enjoy it. <br>Breaking up my bites with swigs of iced coffee. I'd probably get his biscuit again but ask for less chive butter or have it on the side. The ham, biscuit & pickles made it worth while.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EHaopYII4Ix0J3B55DIG3Q/348s.jpg", "caption": "Pimento biscuit."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/urcsLc8bUMQ-b5gsuCLxXQ/168s.jpg", "caption": "Ham biscuit"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xG1ONIAV-K9fwOO8cQk5NA/168s.jpg", "caption": "Iced Coffee"}]}}, {"review": {"des": "I absolutely love the biscuits and coffee!!! Delicious!! Delicious!! Delicious!!! In the winter the eating space is a little cramped but definitely worth it!!", "pics": null}}, {"review": {"des": "This southern charm warmed my cold black heart. <br><br>Second time visiting, first time review. I love a good flaky biscuit and this place delivers. The biscuits​ are a little doughy and salty for my taste but they make up for it by the amazing offerings and pie. I brought family in from out of town when I had some work to do and it was the best decision. And we got some pie from Ben, the friendliest person I've ever met in Chicago​. That friendliness, the heat, and the pie made me feel like I was down south in my friendly neighbor's​ backyard​.", "pics": null}}, {"review": {"des": "4.5 stars<br><br>Lemon cream pie (4.5 stars): shortbread crust, lemon curd, lemon cream, lemon sauce. I love lemon so this was a no brainer. And the lemon does not disappoint! Personally would've liked it to be a tad less sweet. <br><br>Veg pot pie (4 stars): definitely the most flavorful veg pot pie I've had, a far cry from the typical mostly cream and potato pies. This featured a lovely curry sauce to bind all the veggies together. The pastry was unfortunately under baked and quite doughy, particularly the base. Came with a refreshingly tart yogurt raita. <br><br>The huge outdoor space with picnic tables free wifi was perfect for a late spring day. Servers were also very helpful.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/N5oDZDN8JFnx9O1ldeoanw/168s.jpg", "caption": "Lemon cream pie - delicious! Picture doesn't do it justice"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Pk4iF56ERVngTg70B8-oAw/168s.jpg", "caption": "Veg pot pie"}]}}, {"review": {"des": "Yup the hype about this place is real, its that good. I can still taste my delicious maple-glazed ham, dijon chive butter, pickle chips selection. Despite the cold weather their was a long line waiting to get in within minutes of opening. <br><br>I really enjoyed the ambiance made for an awesome Chicago experience, I love how cozy it. Being from Florida, I just wish it was a little bigger to accommodate more people eating inside during the cold months but that's just me but the current set works just fine . <br><br>The staff was amazingly sweet. I truly appreciate the complementary slice of key lime pie and I must say for it to be made in Chicago was one of the best I've ever had it was so yummy. <br><br>Not sure how I'm going to manage this but I'm adding bang bang to my eat everything off the menu list so this means I will be visiting Chicago more often and I can't wait for my trip.", "pics": null}}, {"review": {"des": "I'm going to be controversial and give this place an honest three.<br><br>The ambiance and branding is top shelf, hence why I believe the reviews to be so high.<br><br>I wanted to believe that my food was just off the times I visited but after 4-6 visits (for the outdoor seating and socializing) I realized that their food is just not great.<br><br>The eggs are overcooked, the grits are watery, the food is overseasoned, the sausage is dry and too spiced, and everything is smothered in hot sauce to disguise this.<br><br>My 2 cents- Take the food up two or three levels to meet the awesome branding and layout of the restaurant", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HngTh0azUs8zh6WJe7ZalA/348s.jpg", "caption": "Lemon pie"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bLByjvUMp8zYQeQmwaveDA/168s.jpg", "caption": "Collards"}]}}, {"review": {"des": "I almost gave four stars because the sausage biscuit is a bit salty (more on that later) but the dessert pie is DIVINE!<br><br>First, started with a standard coffee. Nothing to write home about but it is not burnt so I'm grateful for my caffeine. I drink it black. <br><br>Then, I receive my sausage biscuit. It looks so...cute! It's round, it's golden, it has the cutest little round sausage on it and there is gorgeous cheese melted onto it. I notice the crispy cheese flake disc thing. I love the look! <br><br>I bite just a tiny piece of the biscuit by itself. It's..ok. I mean, I like a good, HOT, almost crispy biscuit. This isn't that. It's a bit \"bready\", a bit moist. <br><br>Onto trying the actual bite of the sausage biscuit sammich. I cut myself a perfect bite. It's not great but it's not bad! It's actually quite good but I am sad that it's salty. :(<br><br>I notice now the little jam (blueberry, I think?) on the side of the sausage brekkie sammich. Erm, maybe I should try them together? Yes, yes it does. The jam cuts the saltiness!<br><br>However, as I write this review. My throat is telling me that it's still just too salty. It's suitable for the typical American palate and I don't have that. <br><br>Let's move onto why they deserve the 5 stars anyway! <br><br>The lemon pie. Oh my goodness, the lemon cream  pie!!!<br><br> It has a graham cracker crust. Good girl. It's soft. It's fluffy. It's sweet but not overly so. It's delightfully lemony but not sour. <br><br>Come here for the pies. Not the biscuit sammies.<br><br>Aw heck, since you gotta get here for the pie anyway, try both!", "pics": null}}, {"review": {"des": "Soo I trekked out to Logan Square specifically for thrift shopping and to grab a slice of dessert pie from this establishment. The place was pretty popular, with a line out the door but moved quickly. Regretted that I already had lunch bc it would have been nice to try their savory menu items. <br><br>Ordered the Samoa bc I'm not keen on pecans  (for the Dark Chocolate Praline) nor lime/lemon flavors (Keylime, Lemon Bar). Interestingly enough, the chocolate crust was my least favorite aspect (too crumbly, flavorless and dry), coconut filling was ok, salted caramel/chocolate drizzle was good, and homemade whipped cream topping was the best (I don't even like whipped cream!). <br><br>It was a weird pie that tasted nothing like its namesake. I would come back again for their chicken pot pie or other savory menu items.", "pics": null}}, {"review": {"des": "As much as I love pie, my favorite thing at Bang Bang is the atmosphere. This place is adorable and the outside area is so cute. I'm sure they host hipster weddings here, because it's that cute. Like a pinterest family picnic vibe.<br>Besides pie, bang bang has delicious candied bacon that you buy in a bag, and yummy coffee. <br>Their biscuits for me, are a bit too salty and dense. I know biscuits are dense...but I like them a bit lighter than this. They're kind of like a rock.<br>They feature unique pies and standard apple pies together. There's always a flavor I want to try. They're almost always delicious, but on occasion I have a slice that isn't that impressive. Surprisingly, I find that First Slice makes a more consistently delicious pie.<br>But coming here is a fun experience, especially in the fall. Who doesn't love apple pie and coffee in October?", "pics": null}}, {"review": {"des": "Quirky Staff. Self-Serve Ice Coffee. Deletable Biscuits with finger lickin' good jam- Bang Bang Pie & Biscuits is a MUST. Visiting from ATL, this gem offered southern hospitality with bangin' good BISCUITS. I got the Sausage with an egg over easy & added avocado.  & OMG- the cheese grits.  Husband got the biscuits & gravy - could possibly rivals his momma's, possibly. Bought a mug to remember our visit & got a free cup of joe. Overall,  great conversational atmosphere (get there early if ya want a piece of their limited indoor seating),  HOT house-made hot sauce and friendly, quick service will make this a repeat place for these ATLeins. <br><br>P.s. It was 10:30 in the AM- we didn't get pie and for that, I dislike myself. #pieanytime", "pics": null}}, {"review": {"des": "I have been coming to Bang Bang Pie since I stumbled across it a couple months back. This place is always a favorite option for breakfast and is our favorite go to when we are in the mood for a savory and hearty breakfast and have some money to splurge. <br><br>Atmosphere is very quiet when I go (between 7-9am) but I have seen a line out the door during afternoons when I drive by. The people working are very friendly and super cheerful. Although the place is small, there is an outdoor dining area in back. The sign with the pie puns always makes my day. I don't think I ever consistently taken a picture of something as much as that sign. <br><br>The pimiento cheese breakfast sandwich is to DIE for. I never would have thought that biscuits, jam, pimiento cheese, pickles and bacon would be the perfect combination. Definitely worth the price.", "pics": null}}, {"review": {"des": "Bang Bang is out of this world! From the decor to the service, it felt like being in a retro southern kitchen. Order at the counter then grab a seat at the community table, on the couch, or at smaller private tables for 2-3 (first come, first served). The food is prepared and brought out in under ten minutes- very impressive!<br><br>The biscuit sandwiches are hearty, hot, and fresh. The biscuits alone are buttery and thick. Divine! I had the sausage biscuit ($7) with a poached egg-- the crispy cheddar cheese, sausage patty, and jam were a combination I had never tried but it was delectable! With a side of candied bacon, this was a delicious and filling meal. Hot coffee is $2.50 with free refills. You can even buy your mug for $10.<br><br>The pie was in high demand. I took home the last slice of Blue-barb ($5) much to the chagrin of customers in line behind me. If you have a pre-ordered pie, go through the side gate to the back door for pick-up. You can also pre-order a whole pie any day of the week, up to a week in advance. Priced at $28, the pies are expensive but the best in town. Treat yourself! <br><br>You can also take a pie making class ($85) at the production bakery. Classes are BYOB and light bites are served. This is on my list of things to do!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JF7y3DgBjfohgPCC5kjtZg/168s.jpg", "caption": "Mugs for sale for $10"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sCl_xdTDAZgOKekQ5gXlcQ/168s.jpg", "caption": "Pie! It goes quickly, so grab a slice while you can! Slices are $5."}]}}, {"review": {"des": "My love for this place knows no bound thus explained only to such effect:<br><br>\"I will love you until the bird hates a nest and the worm hates an apple, and until the apple hates a tree and the tree hates a nest, and until a bird hates a tree and an apple hates a nest, although honestly I cannot imagine that last occurrence no matter how hard I try.\"<br><br>How very rare, actually it has never happened, that I came here and gotten a pie (mostly two cause I can't seem to ever decide which pie to get) and I didn't like the pie.<br><br>All the crusts of every pie are perfectly done...ALL OF THEM!<br><br>My favorite pie here is the chocolate pecan, the best I've had in any place (actually only one other pecan pie has better this pie and that was made my a chef friend who added a bourbon reduction, but the crust didn't compare to this one).<br><br>I try to get a different one each time (for the second pie at least). But, this time I can with a friend and we got the Key Lime Pie and the Samoa Pie. Not even kidding and she can attest to this, it was the best key lime pie we've tasted. At first bite, it was creamy with a slight sweetness then the tartness creeps in towards the end, it was the right balance of sweetness and tartness.<br><br>The Samoa Pie was just phenomenal. The coconut custard was creamy and had a great texture. Then, they added the chocolate and caramel drizzle. Side note: that caramel was fantastic, there was saltiness and sweetness, but it didn't overpower. And to top it off, that candied coconut, the crunch, think of rice krispy crunch but with coconut flavor..HEAVEN!<br><br>At the very end my friend ended up taking home the FrankenPie, which is a whole pie made by the six various pies they offer that day. Do get it!!!<br><br>Oh and that biscuit, wow! Wonderful texture, it was moist and not to crumbly. Boy, best biscuit ever and it has to be if you're going to put as part of your name.<br><br>They know their pies and they know their biscuit!!!<br><br>I didn't get it this trip, but they have the bacon biscuit dish (or any of their biscuit dish)...is amazing. Do try them! <br><br>PS. Their hot chocolate is great as well. It's not too sweet, but legit chocolate (not the powder type you might get at some places). Oh and the two toasted marshmallows they add is pure love.", "pics": null}}, {"review": {"des": "Best pie in Logan Square!! <br><br>Nicest Staff.<br>I love the inside, not a ton of seating inside but during warmer weather they have a patio area. <br>Check their website to see what pies they are offering.<br><br>Never tried a pie slice from here I did not love.", "pics": null}}, {"review": {"des": "Pie. What's not to like?! Bang Bang is so good. Their pies are fresh and good quality every time. I gravitate towards chocolate more than fruit but I've had a couple of their fruit pies as well. You really can't go wrong. Great pie and great service.", "pics": null}}, {"review": {"des": "There is truly a biscuit for every taste at BBP&B! <br><br>Though I was tempted by the granola on the menu after seeing another customer eating a bowl, I figured I should go for what the restaurant is named for- and I was not disappointed. I ordered the biscuit with avocado and though the price was close to $10, I'm pretty sure there was whole, perfectly-ripe avocado mashed and scooped on top of the open biscuit, along with pickled onion, pepitas, and cilantro. Being from the south, I am a little particular about how I like my biscuits, and these were pretty good- though not as crispy on the edges as I'd like. It really was served beautifully though! Definitely instagram-worthy.<br><br>The pies featured on the menu sounded really good as well! I noticed that you can buy the pies either per slice or whole. They have traditional flavors as well as what seem like their own creations, as well as seasonal flavors. If I lived in the area I'd love to sample them all!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8MJz3wXf5z24lxZZIRLaMA/168s.jpg", "caption": "avocado biscuit"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yCZx5eTlqyvAFoJzg3LrHA/168s.jpg", "caption": "farmers biscuit"}]}}, {"review": {"des": "The perfect date (besides April 25th): eating Bang Bang biscuits on their patio with a hot sauce bottle, and enough room on the picnic table for more food. Cures any level of hangover and tastes equally as good when sober. The chicken pot pie was satisfyingly average, but the key lime pie is out of this world. I wasn't crazy for waiting in line for what seemed 35 minutes (it moved pretty fast), but I understood why they have customers order and pay at the counter, and then have a seat. Being able to leave when need/want be without having to sign for the check is the reason for five stars and not four. But who would really want to leave that patio??", "pics": null}}, {"review": {"des": "​We ordered the special- a Mexican inspired biscuit with black beans, chorizo, salsa, eggs, and two biscuits​.  We also ordered the farmers biscuit​ with mixed greens, pickled fennel, celery, apple, candied pecans, apple cider vinaigrette, baked goat cheese biscuit.  The salad was so good- they should sell it as a stand-alone​ item.  Also, best biscuits in the city.  <br><br>The coffee is sold by the cup, and they offer many add-ons​ (cream, sugar, etc.) to make it your own.<br><br>I would say that the food is delicious, but it's pricey.  None of the biscuits​ include egg or avocado.  It's $1.50 per add-on item. <br><br>Five-star​ service- the guy that took our order was amiable and gave us suggestions.  The other staff was also friendly and entrepreneurial​.  One of the best things that have​ happened to me in A VERY LONG time was to have​ a server go above to provide smart service.  <br><br>It's a small, cozy space and when we noticed a family waiting for a table, my husband and I moved to offer them the table.  We were done with our biscuits​ but had coffee left, so we decided to move to some open space.  When an employee saw this, she offered us a top off and to go cups.  I am sure it was to get us out, but it was very entrepreneurial​ of her.  I appreciate​ it when management creates an environment​ where employees can problem solve without getting out the Six Sigma books and asking everyone for their input​.  Sometimes a top off is all it takes.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7_wx5LCxYdmIkiH3Kp9zLw/348s.jpg", "caption": "Salsa."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0kIAWwVhFGwOCjEAEKp6rw/168s.jpg", "caption": "Coffee add-ons/"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Br63-L4kOu4mdYzuUzd-mA/168s.jpg", "caption": "Pie."}]}}, {"review": {"des": "I found this place to be grotesquely over-hyped.  The pie may be made from a decent recipe, but we tried 3 different pies on our visit and every bite of each slice tasted like REFRIGERATOR.  Yuck.  That's one was to ruin a decent pie, leave it in a cooler too long soaking up the funk.<br><br>I'll never go back that's for sure.", "pics": null}}, {"review": {"des": "At first, I thought it was weird how over-the-top nice the staff is here. Then I realized that if I worked around pie all day, I would be a happier person, too. I am OBSESSED with the pimento cheese biscuit. The candied bacon alone makes me weak in the knees. You can't go wrong here. Just be prepared for limited seating in the winter when the outdoor patio is closed. It's a pretty tight little space.<br><br>Last time I was in I asked about the whole pies they sell and for the record: No need to call ahead, unless you especially want to. They take walk-ins for the pie. I've had a lot of their desserts catered specially to other restaurants in the area, and it's never a bad choice.", "pics": null}}, {"review": {"des": "What an incredible gem to find in the Logan Square neighborhood. We walked up and there was a line. This usually indicates that this is the place to be. <br><br>Line went quickly and we were served our food in  less than 10 minutes. Lots of seating outdoors. Our food was delicious. Definitely not what we had expected, as there was a little spice in the gravy. <br><br>The candied bacon was divine. I wish I had the chance to try the desserts. Maybe next time we are in Chicago.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/i5G32bYTZdHS0fx7dbpP5Q/348s.jpg", "caption": "Sausage patty, biscuit and gravy"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5SA8ywL3-YnRdrAevx8ZPA/168s.jpg", "caption": "Candied bacon."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uPum16MoEd2f2d48TNhkRw/168s.jpg", "caption": "Sausage biscuit with an egg."}]}}, {"review": {"des": "Pretty darn good!<br>I stopped into bang bang pie and biscuits for a lunch date this week, and I gotta say, it did not disappoint.<br>I ordered the biscuits and gravy, and my husband got the chicken pot pie. The biscuits were hearty and moist, not at all dried out. The gravy was also delicious, with a nice smooth texture and just the right amount of pepper and sausage flavor. I stole a few bites of the chicken pot pie, which was stuffed with fresh vegetables and tender rotisserie chicken. The pie crust was obviously flawless: Golden-brown, buttery, and flaky.<br>For dessert, we obviously had to try their pies! I had the triple berry jam pie, and he had the chocolate peanut butter. The triple berry jam was full of whole blueberries, raspberries, and blackberries, and a little tart to balance the sweetness. The crust was like a shortcake crust, which went perfectly with the fruit! <br>Now, I'm not a big chocolate and PB fan, but that cpb pie almost made me change my mind. I especially loved how light and airy the peanut butter filling tasted.", "pics": null}}, {"review": {"des": "The shop has a cool design and vibe. The staff is okay, I had to try the pies they are known best for but I wasn't very impressed. It is worth a stop and judging for yourself.", "pics": null}}, {"review": {"des": "Food was amazing and service was even better. We were at the bar and all tables were full. The server asked us if we were comfortable and then insisted that she find us a table, as the restaurant is first come first serve and people in line had friends holding tables for them. I was with my friend who is pregnant and it was totally unnecessary but so appreciated! Great experience!!", "pics": null}}, {"review": {"des": "I'm not all that crazy about biscuits as much as I am for pie, but since time was leaning towards a brunch meal, I figured, \"why not?\"<br><br>I came here on a late Saturday morning and the line was already out the door. A bit confusing since the indoor seating was empty and it's an order-at-counter eatery. There is an outdoor seating that is kind of setup like picnic style.<br><br>I had the Strawberry Rhubarb pie and I didn't think it was so BANGIN' that I would've gone out of my way to come here if I wasn't staying in the area. The crumble and the crust weren't so crunchy and tasted like it had been out for a few days. Flavor-wise, however, it was very tasty and it may also have to do with my love for rhubarb. You can definitely taste the tartness of the strawberries and bite into the fresh chunks of rhubarb--yum! <br><br>I really liked the Farmer's Biscuit--it was pretty much eating nice salad on cheese biscuits and I'm usually not a fan of biscuits. It was light enough for me to have some pie on the side, but at the end, I was so full that I couldn't even finish the pie. <br><br>I was tempted to try the other pieces, so I may come back for another slice soon. Slices are around $5 and they seem to have a seasonal menu.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OpQ68p7IwGuJ1-CVsX95lQ/168s.jpg", "caption": "Farmer's Biscuit"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NkV_dOWv5I5pwiK48Y3F8w/168s.jpg", "caption": "Strawberry Rhubarb Pie"}]}}, {"review": {"des": "Best place for pies! I went in for their pumpkin cheesecake and it was worth every bite! If you're a fan of pumpkin pie and cheesecake, you'll have to try this! <br><br>They also have a new biscuit- the pepperoni pizza biscuit, which was good! Being a vegetarian, I got it without the pepperoni. My favorite is still the avocado biscuit. <br><br>Reason for four stars is that I wish they had more vegetarian options, including their pies. Other than that, their pies and biscuits are amazing!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UxXLxlyJ5cg8rckHswgKkQ/168s.jpg", "caption": "Pumpkin cheesecake pie"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ubzSuCasBmpbn12p_6iuLQ/168s.jpg", "caption": "Pumpkin cheesecake pie"}]}}, {"review": {"des": "Sweet and savory biscuit options. Side options--such as candied bacon Also a daily handpie option, and selection of other pies by the slice or whole. It's small inside, but has an outdoor seating area. Free wifi. <br><br>I ordered the candied bacon biscuit, with candied bacon, poached egg, and collard greens and hot sauce on it. The bacon was a superb, the biscuit was delicious. I wasn't keen on their house hot sauce, and actually think the biscuit would've been better without it. The egg was in the shape of a muffin tin, pretty sure they were trying to mass \"poach\" eggs, but still had the runny middle, so it was all good.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EclCS6drels3MBPsBkF3Xw/348s.jpg", "caption": "bacon biscuit with collard greens, candied bacon, poached egg and hot sauce with a mug of coffee"}]}}, {"review": {"des": "This is definitely a place worth going! Had the tastiest pie and biscuit here!! I normally don't like biscuit because they are too buttery for me, but the cashier talked us into it. And I am glad that he did because I would have never gotten the chance to eat such amazing biscuit! It definitely isn't your standard biscuit. Less buttery and softer with a crispy crust. The chicken pot pie is amazing too. Most of the chicken pot pie I had before were basically soup, but here, the chicken pot pie isn't soupy and really good. The Key Lime here is amazing too. I wish the crust was a bit thicker, but overall amazing. Definitely coming here again when I come by chicago.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sBZCgW8JpVbNCOY9DJ7Gmg/348s.jpg", "caption": "Chicken Pot Pie"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/03i3K38Q_0G-WBJGdhXSHw/168s.jpg", "caption": "Key Lime Pie (Slice)"}]}}, {"review": {"des": "Bang bang converted me to biscuits. There biscuits are out of this world. The simple biscuit with rotating butter and jam combo is my favorite but the larger biscuit meals are delicious as well. <br><br>In addition to the biscuits every piece of pie I've had from there is insanely good. The key lime pie is one of the best if not the best key lime pie I've ever had! The actual restaurant is tiny and on the weekends has an insanely long line but the back patio is large and very cute with picnic tables and umbrellas. And it's dog friendly!", "pics": null}}, {"review": {"des": "Got there right at closing still had pie slices left. Got an apple, key lime and a pecan. That apple is a killer just wish it was bigger! Service fast and friendly", "pics": null}}, {"review": {"des": "Best pie spot in town, and their biscuit sandwiches are on point. My go to is the sausage biscuit, because I love the cheddar cheese and jam, and I usually add a slice of pie just because. I love the outdoor space at this location - can bring the dog and enjoy biscuits and pie too? Yes please.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2yRVEuGyRDVOqOJ-PJwmOQ/168s.jpg", "caption": "Peach and raspberry pie, pimiento biscuit, sausage biscuit, and malted chocolate pie"}]}}, {"review": {"des": "This was my first visit here. I have drove past this place several times and there always seems to be a line out the door. My husband and I got in pretty quick late this morning and were able to check out the menu on the side while we were in line. I'm not a huge fan of breakfast or biscuits but I thought I would try it. I ordered the avocado biscuits and my husband got the ham biscuits. We both thought what we ordered was very tasty and cooked right. The place inside is tiny, but there is outdoor seating (picnic benches) during the warmer weather. We were able to sit inside at the table on the side. There are a few tables inside, as well. They have biscuits, pies, and grits. The price was a little over $20 with tip for our two dishes. Staff was very friendly. We ended parking about four blocks away in the neighborhood.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3EctRp96wWSnxz-Jwi1TuQ/348s.jpg", "caption": "avocado biscuits"}]}}, {"review": {"des": "This pie shop is definitely like its name -- da bomb. I've been to the one in Ravenswood and both this location in Logan Square and the one in Ravenswood are tasty. This location, I feel has a smaller indoor dining area, but their outdoor seating area definitely shines. The outdoor area is bigger than the indoor area, so definitely come here during nice weather. There's nothing like eating pie when the weather is nice. <br><br>Order at the front, and they'll give you one of them numbers to place on your table of choice. Wait about ~5-min or so and they'll bring the pie to your table. Self-serving water stations are available as well.<br><br>I went ahead and got the pumpkin and apple cider pie. The apple cider pie was the best! It had well, apple, but a nice sugary glaze on top. I never had pumpkin pie before, but tis the season I suppose. Pumpkin pie was OK, but like I said, the apple cider pie was my favorite on this occasion. Both pies overall, were good, crust was good, portion size was decent. This time around, I did not get brunch, just pie. Because.... pie! <br><br>BATHROOM REVIEW: Located out back, through the kitchen, is a single stall bathroom. It is next to the dishwashing area and consists of a toilet and apparently lockers for the staff to store things. Bathroom was a little grungy, but not too bad. Everything was in working order. Sit or squat? Squat.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jO2Ts30JWUJG23BZRuU7-g/348s.jpg", "caption": "Apple cider (bottom) and pumpkin (top) pie. Pumpkin pie is a seasonal special"}]}}, {"review": {"des": "Several people suggested eating here, and I'm glad they did. Had the avocado biscuit, greens and key lime pie. All were awesome. It's BYOB so we took champagne and ordered orange juice. Prepare to wait in line on the weekends. Solid breakfast place.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Rhh-fdjkhuuPkwnw46Q9kQ/348s.jpg", "caption": "Key lime pie."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ITrj43eUYkCK_TvI9ZsCqw/168s.jpg", "caption": "Key lime pie."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vpD02q5ZtHz72go_0BYdgQ/168s.jpg", "caption": "Avocado biscuit and greens."}]}}, {"review": {"des": "Shared the Key lime, just enough sweet just enough tart, great crust. I'm thinking maybe I should have had my own piece ;-p. <br><br>Stop by and have a slice or two...", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MBzHmOdVaFUkW04WwC2ooQ/168s.jpg", "caption": "Smores and key lime pie"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_titHc1szn1YLshoicKh3w/168s.jpg", "caption": "Key lime"}]}}, {"review": {"des": "Bang Bang is on my route home from work on Thursdays so when I feel like treating myself to some pie to celebrate Friday Eve, I'll stop in to carry out. I've never actually dined in here and every time I've gone it's right before dinner so it's not crowded at all. I can see how the place can get easily packed due to the small interior space. The back outdoor space is roomier but not very useful during the winter. It's also hot has Hades in the late afternoon and early evening since the front window faces West and the setting sun heats up an already hot kitchen space.<br><br>Typically I place my order and wait about 10 minutes or so for the pies. Each of the ones we've tried so far have been great. Pretty rich and dense. The Key Lime has a nice bite in tartness. The only savory pie I've tried was the Chicken Pot Pie. It's good for one person but fairly average. I was disappointed to come home and find the crust was burnt. Will stick to the pies and glad the menu is constantly rotating so I can try additional flavors.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MBQdTGzZl5fG1V_PpFuygg/168s.jpg", "caption": "More pies and the Chicken Pot Pie"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zZ1Xv5Eot_nGA3-hN5UEoA/168s.jpg", "caption": "Pies, pies, and pies, oh my!"}]}}, {"review": {"des": "I ordered the sausage biscuit. Loved the texture and flavor. Exactly what I needed on a cold day. The place is small and can get busy but the staff are super friendly and helpful with finding guests a place to sit. Can't wait to go back when it's warmer so I can enjoy the patio.", "pics": null}}, {"review": {"des": "I ordered take out but the interior was very welcoming. It is a place you could sit and catch up with a friend over brunch and coffee. <br><br>Classic Apple Pie - their apple pie has a loose cinnamon sugar topping, not to be confused with a traditional butter, flour, sugar type of crumble. The apples are cooked down to a jammy consistency. The crust holds up well to the pie.<br><br>Chocolate Pecan - creamy rich chocolate consistency with large pieces of pecans. The crust is a chocolate graham but it may have had some molasses in it. It's not a very sturdy crust - I wish it had a traditional pie crust.<br><br>All in all, I would return to try their other flavors. Apple pie is the pie I judge every bakery on so I had to get it to get a baseline. The reason for the 4 stars instead of 5 is due to the price. It was over $12 for 2 small sized pieces of pie. I feel that these pieces would be better priced around $4.50, rather than $6 and $5 each.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SHGYLypGiIkM4ZezWdixXA/348s.jpg", "caption": "Classic Apple with a crumb topping and Chocolate Pecan"}]}}, {"review": {"des": "Love the vibe of this place! The staff is super friendly, informative, and helpful. They have some great recommendations, not like those places that say \"everything on the menu is great!\" I got the apple cider pie slice ($5), a seasonal flavor, over the chocolate pecan since they have that one for longer. I also got a cup of piping hot, delicious coffee to balance the sweetness out. Total $8.<br><br>The pie was delicious!! Just the right amount of sweet without being cloying or overpowering. It had an unexpected gelatinous layer on the top that actually successfully enhanced the flavor and texture of the pie slice. The crust did taste a bit soggy but the flavor was so sublime that it overcame the missing crunch factor. All in all, will definitely be back. <br><br>Parking is easy, there is plenty of street parking and there is also free neighborhood parking around the corner (free from 6am-6pm). It's a bit isolated from the big streets in Bucktown which is nice. They also have a great patio which I wasn't able to enjoy since it was raining but it'd be an awesome place to spend some time.", "pics": null}}, {"review": {"des": "I MADE IT.<br><br>Bang Bang has been on my foodie bucket list for a long time now, so walking through the doors was an accomplishment in itself.  All of the pie options looked enticing, but I was there for the leaf lard crust.  My pick: strawberry rhubarb.  One bite in and I knew I had chosen well.  What a gorgeous pie!<br><br>Whatever you do, pie fanatics, make sure you grab a slice that includes Bang Bang's leaf lard crust. It's everything you need in a pie!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jiWKME57wFcaG8G0LCHI5A/348s.jpg", "caption": "Strawberry-Rhubarb"}]}}, {"review": {"des": "The guy working was very friendly almost<br>Too friendly and positive so i got suspicious. You know that feeling? Like are they honestly that positive or is it like friendly in a mocking sense or like fake friendly where he has a secret diary where he writes all the horrible stuff he actually feels. <br><br>I loved the pie though (lemon cream) It was great maybe best pie in my life. The biscuits and gravy were a bit on the \"health conscious\" portion , not enough gravy and the metal plate made the food get cold pretty quick. If you only pick one between the pie or the food, pick the pie!!!<br><br>Also the toilet is in the kitchen so it's like going behind the scenes if you have to pee.", "pics": null}}, {"review": {"des": "Everyone will go on and on about how great the pies and biscuits are but for people like me who do low carb it is a pain to find a great place and I found it! I ordered there, 2 fried eggs, greens and thick cut bacon!!! And Im hooked! I love it too when they grand me whole whipped cream for my coffee and just smile at my weird requests. The greens are the BEST ever I ate in a restaurant. Keep it up guys and thank you for being good neighboors!", "pics": null}}, {"review": {"des": "Bang Bang is definitely a Chicago essential.  It's right off the 606 which makes it a great walking destination for a fantastic brunch!", "pics": null}}, {"review": {"des": "Obsessed! I got the Pimento Biscuit AND a classic biscuit with jam and butter AND a delicious cup of coffee. My dad got the Bacon Biscuit and my mom got the Sausage Biscuit. Every single bite was amazing. Also the staff is so charming and all the little branding details of the store really make it a delight. I love that they sell pins that say \"Biscuit Babe\" and biscuit mix labeled \"Future Biscuits.\" <br><br>Can't wait to go back for more. <br><br>Also, the candied bacon is unreal. They put such a generous amount on each biscuit sandwich that I got to pull a piece out and eat it straight and it was sooooo good. If you're a bacon lover, the candied bacon is an absolute must.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qkdzH7GATT-sEpL0mtMzUA/168s.jpg", "caption": "Pimento Biscuit"}]}}, {"review": {"des": "Ummmmm fresh pie and biscuits made from scratch what else could make a human so happy?!! I've had bang bang pie from the taco joint under my building but I've never actually been to the store front. So when I was in Logan square for happy hour I couldn't resist going! I went at around 6:53, they close at 7, the employees were so friendly and sweet. I know when customers come in a few minutes before close most places get irritated but everyone at bang bang was so nice and answered any questions I had. They had a few different pies on their menu, key lime, pumpkin, pecan, and chocolate. I've had the key lime before and it was soo yummy so I decided to be a basic gal and go for the pumpkin pie! Omgzzz soooo yummy! It's the perfect amount of spice, and they top it with whipped cream, caramel drizzle, and pumpkin seeds. Probably the best pumpkin pie I've ever had. I also bought some of their biscuits from scratch, even at the end of the day they were so soft and fluffy, they give you jam and butter with the biscuits and the biscuits are huge! They have a few different types like pimento, biscuits with avocado, and biscuits and gravy (both veg and non veg gravy). This place is the best, even if you aren't a pie lover you won't regret giving this place a taste!", "pics": null}}, {"review": {"des": "Bang bang pie is a unique place in Chicago. We enjoyed the biscuits, being so fresh and full of flavor. We didn't get a chance to try any pie and hope to be back some day soon! <br><br>We featured this restaurant on our blog - tasty tidbitt if you would like to hear more about our experience! <br><br><a href=\"/redir?url=http%3A%2F%2Ftastytidbitt.blogspot.com%2F%3Fm%3D1&s=78b260d8819d7dff7d16fac485ed73f9dd8b24de72c0b563e2d43da3aa8b7b6e\" target=\"_blank\" rel=\"nofollow\">tastytidbitt.blogspot.co…</a>", "pics": null}}, {"review": {"des": "My mom lives in Florida and has always wanted to try this place. So when she was in this weekend we went for breakfast on Sunday.<br>Everything was great. Literally nothing bad to say. Staff was sweet, food was phenomenal.", "pics": null}}, {"review": {"des": "This place is what it says it is and it does that well! They have fancy bowls of grits too. It's small... So in the winter, if you are a wimp and don't want to sit outside, there is limited seating. Highly recommend!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uIbu-4hEGd7F_2BfH30URg/168s.jpg", "caption": "Biscuit with avocado"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0i086rYKz1VE5ZdML7vX6A/168s.jpg", "caption": "Yum. Biscuit with jam and cinnamon butter"}]}}, {"review": {"des": "Yelp<br>Bang Bang <br>Comments/Thoughts/Opinions/Suggestions:<br>This place is great. Highly recommend for anyone who loves pies or biscuits. I am a serious pie lover and this pie succeeded my expectations. They have many flavors and also seasonal as well. <br><br>Food: Pies are all baked fresh daily as well as biscuits. Super moist and cooked to perfection. <br><br>Drinks: Offer a wide range of coffees, teas, sofas, and wagers. <br><br>Ambiance: This place is so cute and cozy. I could come here everyday! <br><br>Price: Pies are around $5 per slice and $28 per whole pie. A little pricey but, you get what you pay for people. <br>Location: Easy and accessible.<br><br>Parking: You'll have to find street parking<br><br>Cool Features: They offer little knick knacks too . Like awesome I love pie pins and also souvenirs from their shop! <br><br>Service: Excellent, the staff is so great and greeted us with respect. They were so genuine and sincere. <br><br>What are y'all waiting for?! <br>        Go Get Pie", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Kg4Ws5in0tjtsqwOO7fvUA/348s.jpg", "caption": "Great service from cashier very friendly ."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QKu5O0fFbFfQt3Ow9j6d4w/168s.jpg", "caption": "Options :)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aBCcCwQwIRaLDr9ttdNsJw/168s.jpg", "caption": "Sitting area."}]}}, {"review": {"des": "This place is very down to earth and simple.   The food is amazing and you can tell they care about everything they make in this location.   I'm not much for grits, but the grits with cheddar cheese and a little bit of spice is easily the best I've had.  My daughter loved her cookies and cream pie.", "pics": null}}, {"review": {"des": "Best pie ever!<br><br>This place is great for brunch or coffee break, with savory pot pies or sweet pies, as well as plenty of seatings outdoor.<br><br>Will be back soon for sure.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GikLxzSWNCHkLg16mC_4QA/348s.jpg", "caption": "Honey pie & black & blue pie. Honey pie is really good!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tZV-gfRYDelBDTtP2llaxw/168s.jpg", "caption": "S'mores pie"}]}}, {"review": {"des": "A great place to get your Thanksgiving pies - especially when you're a guest to dinner and you don't bake.", "pics": null}}, {"review": {"des": "Good key lime pie and very very buttery biscuit.  We brought the food home, but we will definitely be coming back to the giant outdoor space to eat!  My two cents on the menu:  add some fried chicken biscuit sandwiches (particularly with bacon, egg, green chile, etc) to round out the biscuit \"entrees.\"  Credit to Denver Biscuit Company for that idea!", "pics": null}}, {"review": {"des": "My favorite pie shop in Chicago!<br>They also have amazing biscuits!!<br><br>Anytime I order a pie and bring it to a party, it's been gone in seconds!<br>They have a cute little garden to eat in and summer, spring & fall it is usually packed on the weekends.<br>Their indoor seating area isn't the biggest.<br>Their service is amazing & call ahead to order a pie to ensure your flavor during peak holiday times!", "pics": null}}, {"review": {"des": "Chicken pot pie is to die for, but tiny portion sizes and inflated prices make this place a tough call. If you're not a big fan of a thick custard taste, skip the Samoa for another type of slice. Ham biscuit was also nothing too exciting and too small of a portion.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mzF952DXb7_xkS-xu2GxQw/168s.jpg", "caption": "Chicken Pot Pie, the Samoa, and Ham Biscuit"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3hFjw_fry53KZk12II5ZEQ/168s.jpg", "caption": "The Samoa. Very aesthetically pleasing but unfortunately lacking in taste."}]}}, {"review": {"des": "I can't believe I haven't reviewed this place sooner. This is my favorite pie shop in Chicago and id say one of my favorite spots in general! Everything is amazing...the classic savory chicken pot pie is just as delicious as the slices of sweet pies. <br><br>They change up the menu every now and again but some of the best staples are the key lime and chocolate pecan. You also can't go wrong with a plain flakey biscuit, one of the best I've had! <br><br>The Logan location has a really lovely outdoor space they call the pie garden, which is great to sit and eat pie/drink coffee. There are never an overwhelming amount of options on the menu, so everything they have, they do well.<br><br>Even if you're not a pie person (which I wasn't really before moving to Chicago) it's worth a trip!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Aj_oHh1r_phi_l3Sv3nwvA/168s.jpg", "caption": "Chicken pot pie"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/551HjE_tathD1gzk-rfXIA/168s.jpg", "caption": "Pecan pie and peaches & cream slices"}]}}, {"review": {"des": "I ordered the biscuits & gravy (with the works) and they served me sausage that was undercooked! Unfortunately, I had eaten half of it before I noticed, so I ended up getting sick. Never again. Please cook your meat all the way through", "pics": null}}, {"review": {"des": "Yum! Biscuits are good and can stand on their own. I got the gravy and almost wish I didn't because I think I would've enjoyed a non- gravy corrupted biscuit. Don't get me wrong-- the gravy is tasty.. just a little too peppery for my heat sensitive palate. Tuesday at 830AM has a nice stream of customers but isn't super busy. It's also a nice $15 shared Lyft ride from the Magnificent Mile and a short walk to the blue line.<br><br>I also got a cheesecake pie, hand pie, and chocolate pecan pie slice... which just from their names .. is guaranteed to be deeeelisssh!", "pics": null}}, {"review": {"des": "I love this place, the food, the atmosphere all of it but two things happened today that really upset me and bummed me out.  First, the less serious of two offenses, is that there was debris or crap in the water.  If you're going to be lazy enough to use a Gatorade tank as your water dispenser at least make sure the damn water is clean. <br><br>Second, the more serious offense is the way they have their square app tip settings set up.  When I paid today I noticed that it suggested a surprisingly high tip for my bill when I selected 15% as my option.  I looked at my receipt and noticed these assholes are adding sales tax to the tippable amount which is reprehensible.  It's straight up adding 10.5% to their tip.  Square has an option to turn this off too and tip only off pretax amount which is why it's even more appalling that they have it set up that way.  They are literally misleading and swindling customers.  Unfortunately, despite how much my girlfriend loves this place I'm not supporting businesses with shady practices.", "pics": null}}, {"review": {"des": "We stopped in this weekend, waited in line outside for about 30 minutes (not bad, I would've waited longer). This place was absolutely worth any wait! When we got inside to order, everyone working was happy and very pleasant. We ordered a variety of things, so we could try as much as possible, and every bit was beyond fantastic! If I were local this would be a regular spot for me.", "pics": null}}, {"review": {"des": "Bang Bang Pie & Biscuits has a great recipe for success. It's as friendly and comfortable as apple pie on a summer day (pumpkin pie on Thanksgiving?). You can see cool hipster employees whipping up incredible pie in the open kitchen. If you're like me, you might look for an excuse to go to the bathroom just to walk through it!<br><br>The pie might not be as traditional as apple or pumpkin, but that's exactly how I like it. For example, two of the flavors today (when while writing this review) are coffee n cream and chocolate peanut butter. The most familiar flavor is key lime!<br><br>Perhaps because the pie flavors are so inventive, they sometimes miss the mark? I was eager as a bee for the honey pie the other day and would you believe it? Tons of Yelpers sent me compliments on the picture saying it appealed to them also! But it really didn't taste like honey! Maybe it's my taste-buds but I thought that the custard was lemony.<br><br>Given the choice, I'd rather try inventive pies all-day every-day and risk one or two that don't hit the mark over boring la-di-da pies that I could have at a summer picnic with friends or a Thanksgiving dinner with family. Bang Bang does it. It's over the top. Look at my picture of the avocado biscuits. Two amazing biscuits topped with two scoops of guacamole. It took me there in a good way and definitely worth every part of the $8 price-tag.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/q5blKNtop-av_KIVAI0H7Q/348s.jpg", "caption": "Honey - baked honey custard, raspberry coulis, whipped cream, shortbread crust. $5"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/x6p--F-pgtW8KAfq1DtdXQ/168s.jpg", "caption": "Honey - baked honey custard, raspberry coulis, whipped cream, shortbread crust. $5"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zTTgunwfrjFJibT92QEj-w/168s.jpg", "caption": "Avocado Biscuit $8.50"}]}}, {"review": {"des": "This definitely lived up to all the hype.  Best.  Biscuit.  Ever.  And I live in Kentucky... <br><br>The indoor area is tiny and I went on a Tuesday at 10:30 and it was packed so we ate outside which has tons of space filled with picnic tables (luckily it was a nice-ish day). So I suggest going on a mild day unless you want to be in a cramped indoor area.  <br><br>This is an order at the counter and we bring you your food set up.  It is a very simple menu,  which is great for me because I'm terrible at making decisions. We got the sausage biscuit with an egg, cheddar grits,  and hash browns. Ahhh-mazing. I never knew grits could be so flavorful and the hash browns were equally as delicious though I wish they were just a little bit crispier. <br><br>Now let's get to this biscuit... large,  pillowy, buttery deliciousness topped with homemade flavorful sausage topped with cheese that was melted on a griddle so it falls over the sausage and gets crispy around the edges,  and a perfectly poached egg. Served with a side of jam... the flavor combinations were perfect.  <br><br>This is definitely worth it and if I lived in Chicago I'd be going here so very often.", "pics": null}}, {"review": {"des": "I would be the one to walk into Bang Bang Pie and not get a pie, but I did get a sausage biscuit and iced tea, and it was spectacular. <br>Also it was summer time, and the ambiance was great. The outdoor seating is nice, and dog friendly. We were able to enjoy brunch and have our cousins dog with us. <br>The food was very fresh and it came out moderately fast once we put the order in. <br>The seating is first come first serve and there was a line around the building the Sunday morning... but the line seemed to move fast. <br>Definitely recommend going when the outdoor seating is open, it is kind of crammed inside.", "pics": null}}, {"review": {"des": "Today was my first day ever going to the bang bang pie shop. I have had their pie before at other restaurants which made me want to go directly to the source. <br><br>Upon arrival, I was overwhelmed with the line. It is 11:30am and the line was out the door. Trying to find seating in the small shop was difficult as well but my friend and I were able to snag two seats. We each ordered a cup of delicious coffee and opted for a biscuit instead of the pie. The staff was very lovely. I really can't believe I am saying this but I was not a big fan of the biscuit. I found it quite try to be honest. I have friends that would argue this is the best biscuit in the city but it wasn't giving me the buttery crumbly taste/texture I wanted. I would definitely return and try a piece of pie and maybe even give the biscuit a go again. Maybe I got an over cooked batch.", "pics": null}}, {"review": {"des": "Every time I've gone to Bang Bang Pies on a Saturday I've always had to stand in line at least 15 minutes but it's worth the wait! It's my second favorite biscuit (first being Budlong's) but my #1 favorite pie. The key lime pie is so light and refreshing. So nice to sit outside on the patio in the summer! Free iced coffee refills too!", "pics": null}}, {"review": {"des": "This place is so tiny. But so worth it! The biscuits are delicious and they have different breakfast varieties. I had the avocado biscuit and it was so good! They also have biscuit sandwiches which are also amazing. We tried a variety of pies and each was was different (eggnog, chocolate mint candycane, berry, etc). I can't wait to come back here but i need to avoid the line outside!", "pics": null}}, {"review": {"des": "If you just need to be drowned in some buttery, flakey goodness this is definitely the place for you. They're pretty generous with their portions and they certainly aren't shy about their biscuits. <br><br>Their pies, savory biscuits, and grits were excellent! I've got to be honest though, the avocado biscuit was a little disappointing. Not that it was awful, I just feel like it needs something other than HUGE scoops of mashed avocados. If you're going to order it, I definitely suggest adding maybe some eggs or bacon.<br><br>Love the outdoor seating portion of the restaurant. It's a super open space and i'm excited to come back when Chicago warms up. Will definitely be back and soon!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bBLr_A-YC-6GwG5OwFHgKw/168s.jpg", "caption": "The blue rhubarb pie"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PyXBQokRB81Ts_PFaSYNPw/168s.jpg", "caption": "The spread"}]}}, {"review": {"des": "Cutest little pot pies! Delicious ass pies as well! <br>Plus they have an outside patio for the summer time. Ugh so damn precious. <br><br>Will be back for some more sweetness", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/59QmiZC42Nn0EuuXg72t8A/348s.jpg", "caption": "Chicken Pot Pie"}]}}, {"review": {"des": "ok i went to the one a bit further out - but it was still amazing.  i am not used to collard greens so i was kind if shocked when i ate it... but it grew on me :).  the guy at the register was super nice and informative.  but forget ur bacon egg and cheese sandwich from mcdonalds... this one is a gazillion times better!  just wish i cud have tried them all!  go with friends so u can share.<br><br>okay i wasnt going to do it - but i got a slice of pie to go.  i had the chocolate pecan and omg what?!  it was MEGA AWESOME!! omg again - i wish i cud have tried more - but i went with a non perishable pie cause i went to the museum after...  i also loved their hot sauce!", "pics": null}}, {"review": {"des": "I am not super into pie or biscuits but I make an exception for Bang Bang Pie and Biscuits.  If you want a chill brunch atmosphere that goes till 4pm, then this is the place to be!  I am a late riser and like to relax so I really appreciate that this place serves food till 4pm.  I also think they have great, solid vegetarian options.  I have had the Avocado biscuit in the past and it's good but not great.  Today I tried the Farmer's Biscuit and really loved it.  The Farmer's Biscuit is a slightly lighter meal because you have a nice salad served on the side with a biscuit that has goat cheese baked on it.  The biscuit is perfectly flaky and the baked goat cheese on there was heavenly!  The mixed greens had a light lemon honey vinaigrette on there with sunflower seeds, delicious pickled carrots, and grapes.  I also got to try the Gravy biscuit, which has Vegetarian Gravy on it!!  It's very hard to find vegetarian gravy and their gravy is abundant with flavor.  The egg is also made really well.  The hashbrown is also phenomenal.  It was seasoned really well and it was more like a mini hashbrown patty/casserole.  Loved it!<br><br>I tried their black iced tea of the day and it was excellent, perfect for a hot day on a patio!  Most of the time places have boring black iced tea but this was freshly brewed without sugar and a nice lychee flavor.  I think it could be slightly cheaper for the amount you're getting and that it's a order at the counter kind of place.  But I will go here again especially when it's nice outside.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-9ifcrxShLyWfWrrWldfjg/348s.jpg", "caption": "Farmers Biscuit with a side of hashbrowns"}]}}, {"review": {"des": "WOW. This was seriously a great meal to start our days off in Chicago. We came here for our friend's bachelorette party and we told the owner that when he asked where we were from and why we decided to come this recent weekend, and he was SO kind to give us their bacon, grits, and s'mores pie to try, on the house! We also had two among us who absolutely love to bake, so he was kind to also let us know how does he do it with the crust and all. What we did buy was the key lime pie (2nd favorite), scratch biscuit and gravy biscuit (3rd favorite), and chicken pot pie (4th favorite), and all were super delicious. The flavors were not overwhelming at all, and the portion sizings were all just right! What we all can agree on is our absolute favorite was their bacon. It was just so flavorful and addicting to eat and man, are we glad he gave it to us to try!!! Whenever I come back to Chicago in the future, I definitely see myself coming back here.", "pics": null}}, {"review": {"des": "Bang Bang might have some of the best biscuits I've ever had. No exaggeration. That being sad, the gravy biscuit wasn't that great. I'm not a fan of the gravy flavor. However, the way they cook their eggs is interesting, and I did like that. Additionally, I tried the spiced eggnog pie and the chocolate pecan pie. Both great. The eggnog was better, though. <br><br>This Bang Bang location is pretty small on the inside. The seating is first come first serve. There is bar like seating and then a few tables. I wouldn't recommend coming with more than a couple people if you don't plan to sit outside. <br><br>Overall, it's a cute little spot with great biscuits and decent pie.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OGJrudyXLeF5s4Krb_abBA/348s.jpg", "caption": "Gravy biscuit with an egg"}]}}, {"review": {"des": "I've been meaning to try this place and I just did today. I'm not huge on heavy food but WOW this food was mind blowing. Definitely good for days when you want warm comfort food. I had the chicken pot pie, single biscuit, and coffee. I was happily full after that meal and will definitely be back to try something different. <br>The only downside of this place is when the weather is bad, the seating is terrible. They have bar style seating and about 4 tables on the inside. It's more so a complaint on the other guests though. There were a few tables that appeared to be almost done or actually done and they weren't moving. Which is rude for people coming in and when there's a line outside of the door. <br>If you come on a nicer day, there's outdoor seating (which I'm sure helps with the crowd waiting for a table).<br>The staff was extremely nice and helpful as well so that's a positive!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Xer384Rh5C4VC88lzfwy2w/348s.jpg", "caption": "The chicken pot pie and biscuit"}]}}, {"review": {"des": "This was the first time I actually sat down to enjoy pie outside and I'm not disappointed. I ordered the chicken pot pie and absolutely feel the pie crust was incredibly well made with a buttery tasting crust. The chicken and vegetables within the pie was obviously high quality, fresh and clean tasting but the high price of $11 including taxes seems a bit over the top. I'm surprised they won't include a tiny side like a small potato salad or raw cucumber salad to go with your order. The pie is petite, extremely tasty but a bit overpriced since it isn't that large and because a side isn't included. I also enjoyed the chocolate malt pie with salty caramel and whipped cream topping. The chocolate pie was about $5 and was a pretty rich pie so I had a hard time finishing and here again the pie crust itself is made from scratch and mouthwatering. I loved sitting outside today on their picnic benches and I thought the staff here was super cheerful and great at their jobs. The only thing I would change is their pricing system. If you are going to charge people more money make the portions larger or include a side.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7DECJWlqvxfhM1aEHp0KBQ/168s.jpg", "caption": "Chocolate malt pie with salted caramel and whipped cream"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pk2OKrT5Fo7rBwoy4mfrBA/168s.jpg", "caption": "Decadent homemade chicken potpie"}]}}, {"review": {"des": "I've been here twice - once in the dead of winter and another a perfect day in the summer.  Its definitely what I'd call a summer spot to go to.  The outside dining area patio screams summer -with antiqued aged wooden doors and whitewashed picnic tables - very good vibe.  Especially neat at night I imagine with stringed up lights - a good outdoor space for an event if they allow rental.  <br><br>The shop is quite small - if you like the smell of butter -then you'd prefer to eat inside.  The menu changes regularly.  I've only had the pies - and I'd consider each bite I had to be pretty darn good.  $3-4 per slice.  I've never had the biscuit - since I've only arrived in between meals. <br><br>The restroom is actually within the kitchen - accessed from the outside entryway in the back - I felt like doing some dishes while I was in queue for the restroom.  I only needed to wash my hands - so they let me use their utility hand-wash sink.  <br><br>Picnic tables, serve yourself water station.  This is a good place to grab a quick bite, let the kids loose playing around the open area.  We had a good time", "pics": null}}, {"review": {"des": "Loved this little gem of a coffee shop in Chicago. This was right around the corner from our Airbnb so within walking distance. We ended up going a few times during our visit plus took a few of our adult kids so they could check it out. Nice, cool, eclectic space plus a nice outdoor eating area. Bottomless coffee cup and the coffee is fantastic. I had their grits both times I ate there and it was very good. My daughter tried their lemon pie and I had a bite...it was delish. I highly recommend especially on a nice day when you can sit outside. Space inside is small.", "pics": null}}, {"review": {"des": "Although the biscuit with egg and avocado was almost surprisingly filling, we were not particularly impressed with either the biscuits or the pie.  Biscuits seemed doughy/undercooked and far too salty.  Pie crust was soggy and undercooked.  Filling, though tasty, was mushy.", "pics": null}}, {"review": {"des": "Great key lime pie with super friendly service! Definitely recommend this place for any pie lover.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/L3Cimg-MJiF_xgDEMcMyGA/348s.jpg", "caption": "Key lime pie & coffee"}]}}, {"review": {"des": "Pie. <br>Biscuits. <br>Coffee. <br><br>Basically one could live off these three elements alone for many moons and feel quite content, amIright? I am right. <br><br>Having moved into safe proximity to Bang Bang territory -- I find myself with many reasons to secure pie and coffee. It's the superb antidote to that cupcake debauchery that has thankfully had its damn day and gone on to where ever bakery fetishes go to retire. <br><br>My first Bang Bang win was ordering 3 pies for Thanksgiving plus 12 biscuits. When I tell you that my son ate at least 6 of these over the course of a few days, I would not be lying. He has a penchant for hipster biscuits, what can I say? They were incredible and the combo of carbs and sugars prepared lovingly in Chicago made me a Thanksgiving superhero in my own mind. Who care about the turkey!? PIE. PIE people. <br><br>I've since been back a few times for a quick coffee (only drip, for the record -- but the very best drip you can find). It's often got a line around the block on weekends, but that's because there is limited seating and high demand for pies, coffee, biscuits and breakfast delicacies. The good news for you is that the line generally moves fast. <br><br>It's hard not to love it. Eggnog spice pie!? C'mon guys, it doesn't get more real than that.", "pics": null}}, {"review": {"des": "Mehaverage.  A line outside as we arrived, but it goes fast.  We got a table inside, but if the weather is nice, go outside. Inside is too cramped as you're surrounded by people trying to order and it was so smokey in there.  <br><br>The menu is absurdly appealing but too many things fall flat.  The biscuit sandwiches are boring. The biscuit is too big to make a good conduit, the filling to small.  Its clunky and difficult to eat. The server pushed adding avocado to my ham sandwich and it was to clunky, fell apart and made eating it too hard. The ham was decent.  The biscuit is huge, with a nice texture but it lakes in flavor, shocking.  <br><br>Candied bacon was boring, hash browns were a cool twist on potatoes au gratin.  <br><br>The pies we're average as well, but the crusts were great.  The samoa was too mushy and messy, but nice coconut throughout. Triple berry nice cobbler, but one noted.<br><br>Cool concept, food looks amazing, just falls flat in the end.", "pics": null}}, {"review": {"des": "Great Coffee and tea! Cheesy grits and poached egg, add collard greens, make it shrimp, want<br>Candied bacon on it? All on menu and lots of pot pie, biscuits and spreads and dessert pies. Worth the stop!!", "pics": null}}, {"review": {"des": "Yelp, can you please increase the rating here to accommodate 6*s? Bang Bang Pies is so good that it absolutely, unequivocally deserves 6*s. It has been on our list for the longest time. We came here well after it opened and there was still a line, which was ok since it does move. There are a ton of covered picnic tables out back, which moves it along. The wifey and I shared a ham biscuits, sausage biscuit and shrimp and grits. The shrimp and grits was good, but the wifey stole most of it.<br><br>I fashion myself as a biscuits aficionado, and this place hands down has the best biscuits I have ever had in my entire life. The pies are bomb as well. So glad we came here. So looking forward to coming back too!", "pics": null}}, {"review": {"des": "Simple tasty good service. Would have given them five stars if there was one more shrimp in my grits.", "pics": null}}, {"review": {"des": "This is pretty much my go to \"brunch\" spot.  Not only do they have sweet pies, but savory pies and other dishes.  I never leave unsatisfied.  They have seasonal pies and specials.  It can get busy here, but I highly suggest trying this sometime in your Chicago life or if your ever here for a visit.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3PATgO5vjKk2xoJ8eH-iWQ/168s.jpg", "caption": "The most delicious pies in Chicago."}]}}, {"review": {"des": "For what seemed like such a local staple I was shocked that the pie didn't come warmed. It was flavorful enough and the layout and additional back yard space make it a great location to bring the group or the family to sit together. I would need to try some other flavors and the biscuits to perhaps give a better review, this was just okay. *I had the mixed berries pie slice.", "pics": null}}, {"review": {"des": "Great place to visit for a nice, lite meal and topped off with great pie!  Place is super quaint with great people working there and taking care of everyone. One, long table for family style seating and several chair, sofa and small table sitting around for some random seating.  The old town style decorating and down home eclectic food selections make this a great homey place to visit.  The chicken pot pie was fantastic and the spices cheesy grits were a treat worthy the trip.   Topped this off with a Samoa pie and chocolate pecan pie. Both were well worth the price and satisfied every sweet craving.  We really enjoyed this visit and place.  Definitely will be back.  Thanks for a wonderful place to visit again and again!", "pics": null}}]}