{"name": "bar-siena-chicago", "reviews": [{"review": {"des": "This place is awesome! New favorite chill (semi-affordable) hang on Randolph. It is currently decked on in holiday decor too, so get yourself over there and feel festive! <br><br>We ordered a few different apps: chopped salad, croquettes, meatballs, and mussels (which serve one easily as a main course). The salad had a ton of yummy veggies and a nice kick of heat. The croquettes literally stole my heart in all of their cheesy and crispy goodness, and the meatballs were a very pleasant surprise compared to the overcooked meatballs you get at a lot of places (these are soft and melt in your mouth). As for the mussels, I found myself drinking the pan sauce and blotting large amounts of bread in the sauce to soak up all its flavor - that sauce is so boss! <br><br>Will definitely be back soon to try more yummy eats and enjoy the cozy atmosphere. Did I mention they have the comfiest dining chairs EVER? Truth.", "pics": null}}, {"review": {"des": "Me and a group of friends came in for some late night pizza and drinks.  We ordered the wild mushroom and garlic and the carne.  The crust was on the harder end and the pizzas didn't taste like anything special.  Everyone at the table agreed you can definitely get better tasting pizza at a build your own pizza joint.  Not worth the prices they charged.<br><br>The cocktails and wine on the other hand were great and made very well.  But in my opinion that should be a standard given the competition in the Fulton Market District.  I would only give the place 3 stars if the ambience reflected the price of the food and drinks because it felt more like a typical north side bar than anything.", "pics": null}}, {"review": {"des": "Every year I meet up with a group of friends from my grad school days to have a little reunion. This year we chose Chicago as our destination for a weekend in November. As these trips usually go, most of it was unplanned and a bit spontaneous, which made for an interesting Saturday night trying to search for a place to eat dinner.<br><br>After a bit of searching, we stumbled upon Bar Siena. It had great reviews, and enough to choose from for our vegetarian/vegan friend. We were told the wait for be about an hour, but we only ended up waiting twenty minutes or so. Score!<br><br>We perused the menu and asked our server a few questions. Unfortunately, we received a bit of snark back from our server. I understand it was a busy Saturday night, but she had a bit of an attitude. It felt like we were inconveniencing her with our presence and she was almost confrontational about it. Nonetheless, we ordered.<br><br>I decided on the sweet corn ravioli. It was honestly probably the best ravioli I've ever had. My friends thought it was the best dish at the table too. <br><br>However, the night was a bit sullied at the end when the waitress brought our check. We each paid with our own credit card, and that seemed to annoy her immensely. (So much to the point that she came back and told us how much of an inconvenience it was not once, but twice! Once after she gave us our receipts and then two minutes later as we were adding the tip and signing!) Perhaps since we were in our street clothes she perceived us as \"tourists\" and therefore wouldn't tip well? I'm not sure...<br><br>All in all, Bar Siena has amazing food and drinks (five stars worthy). Unfortunately, their quality of service left much to be desired.", "pics": null}}, {"review": {"des": "If you ever have a large party you want to host for any occasion, I highly recommend y'all consider Bar Siena. The second floor not only has a separate bar; however, they have quite a few seating arrangements to host parties up to 15 easily.<br><br>I knew I was in for a treat when they not only had a Paloma as a signature cocktail, but it was made properly with freshly squeezed grapefruit juice and it even had smoked salt which elevated the libation. This is the \"Number 10\" for reference.<br><br>I was with fellow colleagues and we decided to feast and try a good portion of the menu. Every dish was brought out promptly and definitely left enough for everyone to share.<br><br>Some dishes that stood out to me were...<br>-Short Rib Lasagna: You need to order one for the table NO EXCUSES. This was probably the highlight of the night for myself and a few others. Each layer was set perfectly and the bubbling cheese in the mini skillet made it that much better. Great ratio.<br><br>-Gnocchi: This classic dish was tossed with prosciutto sausage and every dumpling had such a soft texture it was so easy to cut through a fork. Grab a few pieces of bread to dollop the sauce.<br><br>-Chicken Wings: A nice smoked wing with a great crispiness to it. This wing wasn't hot at all and I had trouble sharing them.<br><br>-Pizzas are solid<br><br>The staff was on-point and did a great job. You can see how hard they work and they were so pleasant. New fan over here!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bL5eYw6PPXvwMno1Ivr-uA/348s.jpg", "caption": "Signature cocktail"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qHh3y-Tk3Qd_H46Ts513MQ/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HNVCjAfp30lum9xceo1rYw/168s.jpg", "caption": "Upstairs area"}]}}, {"review": {"des": "Our Yelp CM team strikes again, showing up at a restaurant and ordering almost the entire menu in one sitting! My coworkers are my people.<br><br>Bar Siena did an impressive job catering to our hungry group of 10 with organized and friendly service. We ordered a silly amount of cocktails and food, but here are some of my favorites:<br><br>-- Taleggio Focaccia: stracchino cheese, arugula, truffle honey, sea salt. Indulgent, savory, and a little sweet. I'm a sucker for anything truffled.<br>-- Chicken Wings Diavolo: habanero, lemon caper ranch. Very crispy, with a low slow burn that wasn't overwhelming. The ranch was heaven.<br>-- Grilled Octopus & Shishito Peppers:charred escarole, calabrian chili vinaigrette. The octopus was incredibly meaty and tender!<br>-- Sweet Corn Ravioli: chiodini mushrooms, truffle butter. I loved the sweet and savory flavor profile, plus the creamy element. Also: truffle butter.<br>-- All the pizzas: thin, bubbly, charred crusts. And the sauce was not too acidic. They have great combos of toppings, but you can't go wrong with the tomato + mozzarella 'za = sometimes less is more!<br><br>Amidst all this greatness, there were a few misses. The gnocchi was way too salty, unfortunately. Also, the meatball and ricotta calzone barely had any ricotta in it. But overall, this is a great place to bring a date or a group!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JSqXmkMpxI99H8PcCKQiIA/348s.jpg", "caption": "Carne pizza"}]}}, {"review": {"des": "In town recently for a team work dinner, Bar Siena was the perfect spot for a group outing. We had amazing service, and the chef was completely accommodating when it came to the allergy person (me) that Anna K refers to in her review ;-)<br><br>Though the service was beyond 5 stars and the ambience was stellar, the fact that I can't digest garlic made it difficult to find anything on the menu to eat. I wanted everything! At first I thought I was going to have to go with the prime bone-in ribeye at $59, but thankfully I worked with our waiter, Zach and the head chef, to come up with a pizza option that left off the garlic. TBH, I would have loved to order the steak, but heck no would I ever even consider it for a company outing budget. <br><br>My pizza was so so so good. I wanted to keep eating it, but I had to stop before I blew up like Violet in Willy Wonka. I ended up with a basil, olive oil, bufala mozzarella and bacon pizza. The bacon was a little tricky to eat, because it was chopped up into thick smokey delicious chunks and kept sliding off the pizza. But it was outstanding and worth every bite. The rich cheese was a perfect complement to the crispy, hearty crust. I think they should add this to the menu. <br><br>The ambience was magical with the twinkly light *tree* in the middle of the room. The place was packed and bustling, but not so crowded you felt like you couldn't move. <br><br>I would come back for my pizza any time (of course the chef would have to agree to make it for me). And, I would want Zach as my waiter...he rocked!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IWk68XaXowyBuk4rYDNUNw/348s.jpg", "caption": "Olive oil, basil, bacon, burata mozarella pizza"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/I_EkvUl4dpoQyurfOVnosQ/168s.jpg", "caption": "Taleggio Focaccia $19 Stracchino cheese, arugula,  truffle honey, sea salt"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xXaOdZnnJhELLrBFrPThow/168s.jpg", "caption": "Lighted *tree* in the middle of the room from floor to ceiling"}]}}, {"review": {"des": "A group of nine out-of-town coworkers and I went here for a team dinner this past Wednesday night, and I think picking this spot made me a good city of Chicago host to them. Thanks, Bar Siena!<br><br>We made a reservation a few days in advance for a 6:00pm seating. Again, we had a big group and this place has fabulous reviews, so I highly recommend making that reservation, folks. We were seated right when we arrived, at a gorgeous table upstairs with a fabulous view of the giant tree/light structure in the middle of the space.<br><br>Our server was Zach, and he was super fantastic with asking about allergies. He made sure to check up on us a few times as well and throw a few jokes our way. Our entire table may have developed a small crush on him. Who's to say? Not me.<br><br>Everyone at the table ordered cocktails and beers, and I decided to go for the No. 1 cocktail (vodka, pomegranate, apple cider, lemon, spiced orange syrup, and bitters). I switched the vodka in my drink for rum, and of course it tasted absolutely fantastic. 10/10 would order that bad boy again.<br><br>We then all ordered appetizers for the table: a few orders of the Taleggio Focaccia because it was the one thing that *everyone* could have, even those with allergies, two orders of the Grilled Octopus & Shishito Peppers for us seafood-lovin' babies, Chicken Wings Diavolo, and the Roasted Meatballs. We scarfed all of it down, and were still ready for our entrees!<br><br>A wide variety of orders came from those at our table, but I went with the Burrata Wedge. My best friend Zach said I could also add octopus, and since I fell in love with the octopus during appetizer time, I said, \"hell yeah, Zach.\"<br><br>The ambience in here is badass, and truly magical when it's dark outside, because of all of the lights on the tree in the middle of the restaurant. There's a gender-neutral restroom upstairs, and two separate Male/Female-marked restrooms with stalls downstairs. <br><br>I'd been wanting to try this spot for awhile, so I'm super glad I did. I'll recommend to other big groups in the future!", "pics": null}}, {"review": {"des": "Lobster roll. Review done. <br><br>LOL, but seriously, Bar Siena has a killer lobster roll as well as some tasty apps and some good wine. I came here for a weekday lunch with 3 coworkers, 2 of which had been here before. They said there was really nothing bad on the menu, and I totally agree. We split the meatballs (all kobe beef, YES!!) and focaccia bread (so good) to start. I opted for a glass of wine to start, as did my friends. <br><br>I liked my wine, but knew I wanted something a little different with my lobster roll order. Our server knew exactly what I wanted, and it paired perfectly with my lunch. My friends all liked their lunches also (I think we had one burger, one salad and one chicken sandwich). <br><br>I have to say, I was impressed with the service. Everyone was very nice, patient, but also attentive. They serve items when they are ready, but everything was still timed very well. <br><br>I loved the atmosphere too. We were seated upstairs, next to a large tree with lights on it. I loved the look of it!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wRGVaMJLOgWz5oh6XKB5fA/348s.jpg", "caption": "Still drooling over this lobster roll!"}]}}, {"review": {"des": "Met a friend for lunch in the Fulton district and we decided to try Bar siena out.<br>Nice place with two floors, main floor has a large bar with some TVs too.<br><br>Not too busy for a Monday lunch hour.<br>We ordered the balsamic glazed pork ribs with crispy brussels sprouts, the short rib lasagna and chicken wings diavolo and all were very delicious!<br><br>I came in wanting to order the grilled octopus and the duck mac n cheese but they were all out? <br>Maybe they just want me to come back <br><br>Also had a few beers, the Fat tire Belgium white which was very tasty.<br><br>Their are quite a few sandwiches on the menu that sound great so may have to come back.<br><br>Parking is always tough around here but at least they have valet. The staff was also pretty friendly and attentive.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/702-ZLsmgUdoOsmQ1R6djg/348s.jpg", "caption": "Fat Tire Belgium white. Who doesn't like a \"fat tire\"?"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tYgLQnh04IB4ej2dUY1P0Q/168s.jpg", "caption": "Short rib lasagna! Very original and tasty!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MMGo0Qx1WUFX1lfJAK5XZQ/168s.jpg", "caption": "Chicken wings diavolo, meaty and tasty!"}]}}, {"review": {"des": "Great service and atmosphere. Food delicious and unique. Shared the octopus and meatballs, both outstanding. Also ordered the brussel sprout and sausage pizza and short rib lasagna (this was one of the best dishes I've had in awhile). <br><br>Con of this place is one gender neutral bathroom upstairs and it was disgusting. Very long wait if busy.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DxLXRWf4MNO0ln4ejCBVKg/348s.jpg", "caption": "Meatball appetizer"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/txXXiIkmj3UVSoeAX632lQ/168s.jpg", "caption": "Octopus appetizer"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QVbFCoC_kmzCY-g6Mt53jg/168s.jpg", "caption": "Short rib lasagna (amazing)"}]}}, {"review": {"des": "Came here with a friend and we were not disappointed <br>We tried a variety of dishes and enjoyed each of them<br>Easy location to get to and our server was very professional", "pics": null}}, {"review": {"des": "Decided to come in person to Bar Siena instead of ordering through UberEats. We were greeted quickly and led to a booth upstairs! The downstairs was pretty lively for a Monday afternoon! Seems like a cool hang out place with an awesome vibe.<br><br>The inside was beautiful and I absolutely loved the lights that surround the entire facility. It truly gives it a homey vibe. <br><br>My boyfriend and I ordered the Short Rib Lasagna and the Fireball Pepperoni Pizza! The food came out pretty quick which was great! We enjoyed the lasagna and pizza, but would probably order something else on our next visit. These two dishes were large enough for both of us, we even had some food leftover to take home.<br><br>I ordered a cocktail, #4. I liked it, but did not love it. My boyfriend ordered a beer (not sure which one), he enjoyed the light, crisp taste of it!<br><br>Our waiter was great! He was very helpful and attentive!<br><br>This would be a great place for drinks with friends or even just a casual date night! Will definitely plan a visit in the future.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/B4QLLeftaeFsZP9eSq6KLQ/348s.jpg", "caption": "Fireball Pepperoni Pizza"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KuY5crIDDrjUDTgkN1V-dg/168s.jpg", "caption": "Short Rib Lasagna"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2QH-TON-6GTFsu_2VoW8ZA/168s.jpg", "caption": "Cocktail #4 and a beer (not sure which one)"}]}}, {"review": {"des": "I returned here, at request of the GM... and because I love food :) <br><br>My boyfriend and I started with the taleggio focaccia. The bread was crisply grilled, with the nicely melted cheese underneath, a bit of arugula (i believe) and some honey. I really enjoyed it! <br><br>We split the burrata pizza. While I wanted that beautiful cheese coming off the pizza pic, everything tasted great on it. The flavors really melted in your mouth while each having their own taste. The only issue was we waited about 30 - 35 minutes for our pizza to come out... and no one said a word about where it was. Our server noticed and came over but kept telling us it would be out soon. It was busy but not so busy that our pizza should've taken that long. <br><br>Overall, it was much better than my last time here. The fall menu is quite a bit of the same foods but a few news ones that are intriguing!", "pics": null}}, {"review": {"des": "Bar Siena brought their A game for our big group and put out a seriously good meal. <br><br>Everyone at our table would label themselves as 'food people,' so I'm not exaggerating when I say we all went HAM on this menu. I'm pretty sure almost everything imaginable came out during our hours of feasting here. <br><br>I won't bore you with all of them, but I'll hit play on the greatest hits: <br><br>The Grilled Octopus was beyond tender and flavorful.<br><br>Sweet Corn Ravioli was perfectly sweet, rich and warming on a typically chilly Chicago evening. <br><br>The Chicken wings Diavolo had that nice char and a bit of heat hiding out in them -- a surprising contender in this heavyweight food fight. <br><br>I also loved the pizzas and thought they were expertly crafted with a nice chewy crust. <br><br>There were a couple misses which is bound to happen when you order the whole damn restaurant, but was surprised me was I just couldn't find a drink I liked. I'm pretty low maintenance on cocktails, but the three I tried here struck out hard. I would stick to wine or beer here next time around.<br><br>Loved the vibe of this place with all the white holiday lights decked out throughout, and overall our service couldn't have been better.", "pics": null}}, {"review": {"des": "Spacious two-story lounge perfect for casual and classy group outings. <br><br>Headed here after a failed attempt to dine at a well-known ramen shop nearby in a group of 5. We were seated promptly upstairs in a comfy booth between the window and the pretty light-strung tree around which Bar Siena revolves. Not 10 seconds had passed before our waiter appeared to ask for water requests. Soon after he reappeared to take our drink orders, options for which include an award-winning wine menu. Our waiter, and I'm presuming the others of this establishment, was well-versed in the extensive drink options, including descriptions of each of the wines - not that it mattered to us less-cultured, debt-ridden students. <br><br>While I sipped on my house Sangria, others dug into a wide variety of plates: a very large Meatball & Mozzarella Calzone, Balsamic Glazed Pork Ribs, the Burrata Wedge. Our ever-meticulous waiter made sure to ask and note all allergies at the table (there were several), and overall made it very clear that Bar Siena was willing and able to accommodate a variety of food preferences and customizations. A good note if you come with picky eaters. We were all universally satisfied with our drinks, although my Sangria was dangerously sweet - suspiciously more fruit juice than wine, but delicious nonetheless. <br><br>The overall vibe is very much young professional, dim lights, and semi-privacy while being immersed in a trendy crowd. Nothing ground-breaking, but a very solid and reliable choice for hanging out.", "pics": null}}, {"review": {"des": "The food here was on point! It's tapas style/cicchetiti. We had the lobster tagliatelle and roasted red snapper. The lobster was delicious, cooked to perfection. My toddler loved the tagliatelle and ate most of it. The roasted red snapper had that perfect searing. The whole dish was very well thought out with the risotto and cream. <br><br>For dessert we enjoyed the bomboloni donuts. It was delicious. My favorite was the vanilla custard cream. They come in these little squeeze bottles and the donut is very generously sized. <br><br>Definitely swing doughnuts dessert; it will round the meal out perfectly.", "pics": null}}, {"review": {"des": "Have been here a few times now, overall, the drinks are good, priced truly like West Loop would be. I had the gnocchi on my last visit, which was very good, surprisingly. Also was a little on the expensive side. The side dish of mash potatoes were also very good- quite creamy, while also being a bit on the expensive side for the portion (good for maybe two people) at $11. Their dish comes with no sides, so dinner and drinks can get a bit pricey here.", "pics": null}}, {"review": {"des": "Pretty solid spot for drinks and hanging out. I came alone on a Tuesday evening and sat at the bar. The vibe was fun and lively and the bartenders were nice and attentive. <br><br>I ended up ordering a chicken dish that I objectively think is good but I wasn't too crazy about it. I'd probably come back with friends for drinks based on the vibe.", "pics": null}}, {"review": {"des": "From the decor to the friendly staff, this place was the perfect pic for an impromptu dinner the day before Thanksgiving! The drinks were spectacular and food was just as amazing. Next time you're there, have a delicious bite to eat and STAY FOR DESSERT! You can never go wrong with Bar Siena or Bombobar! The meatballs and bread will melt in your mouth and the same goes for everything available for dessert. You won't be sorry!", "pics": null}}, {"review": {"des": "Came here with my husband and friend for a quick bite and some drinks. Before ordering we asked the server if the No. 13 drink is sweet. She said no but that was not the case. The drink was so sweet we had to send it back. When she brought it the second time it was less sweet but still sweet.<br><br>For food we shared the meatball calzone. It was plenty to share between the 3 of us for a snack. The meatballs was juicy and tender. The calzone itself was crispy on the outside and soft on the inside. It could have used a few more meatballs but otherwise good.", "pics": null}}, {"review": {"des": "I went to Bar Siena this past Saturday for a birthday and overall, it was fabulous!  I spent the entire weekend trying to decide whether or not I could give the restaurant a 5, but I will get to that later.  We had a reservation at 5:45 and were running late, and they were happy to accommodate.  We each started the meal with one of their specialty drinks and everyone at the table was impressed with their individual drink!  As an appetizer we ordered the mussels and clams, and I have to say this may be the single best rendition of the dish I have ever eaten.  I have been eating quite a bit of mussels lately as I have really found a love for them, and these were better than any others I have tried.  The entrees are where my big issue came into play.  I ordered the black truffle risotto with sauteed root vegetables and could not have been more disappointed.  In all fairness, I was flustered and could not decide what to order when the rest of the table was ready, but decided on the truffle risotto because I have had truffle risotto in the past and have really enjoyed it.  In all honesty, this was one of the more bland dishes I have ever tried.  With this in mind, everyone else at the table had dishes that they truly enjoyed!  One individual at the table ordered the gnocchi, and it was fabulous.  Another ordered the mushroom pizza and this was also a great entree!  Finally we finished the meal with a complimentary doughnut that was spectacular.  All in all, outside of my entree choice this place is a home run!  I plan to return at some point and try one of the other pasta dishes.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zNCe7LVY9ZDrV7fQGPlXyQ/168s.jpg", "caption": "FABULOUS mussels & clams"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7sZ-AdbvGneAZRqfKb4YHg/168s.jpg", "caption": "Incredible ambiance"}]}}, {"review": {"des": "Came here for the first time for my friend's bday this past Saturday. <br><br>The birthday girl had made a reservation for 9 people ahead of time and I had also called a couple days in advance asking about whether or not it offers up birthday desserts. The woman I spoke to on the phone couldn't have been nicer and explained that they offer a complimentary birthday bomboloni. I was super excited about this and asked them to make a note under our reservation name so that my friend could be surprised with a treat. Long story short, it was never brought out. <br><br>I was impressed by how beautiful and cozy the restaurant was and was also excited to try one of the many cocktails on the menu. I bought the first round for my boyfriend and the birthday girl's brother who both ordered beers. After they received their beers, I continued to wait for the cocktail I had ordered. The same bartender who took my order then approached me again and asked me if I needed anything (clearly not remembering I had ordered some drinks just minutes before). When I explained I was still waiting for my cocktail, she responded with, \"I'm an idiot. I totally forgot.\"<br><br>Once we got seated upstairs, we all ordered drinks and our server was very willing to provide food and drink recommendations especially because he knew many of us were there for the first time. I enjoyed my drinks and my boyfriend and I also enjoyed the yummy croquettes.<br><br>One of our friends from the other end of the table then came over to us to tell us that they were essentially told they had to order food since they were at a reserved table (note: there were a handful of empty tables around us). I am a part-time server myself and have never heard of this. Not to mention we were all ordering multiple rounds. <br><br>My boyfriend, upon hearing that I'm drafting this review, right away said, \"It was a good atmosphere and tasty but we didn't feel welcome and the service was subpar.\" Though he's not one to write reviews for places, I feel like his input adds to this review.<br><br>All in all, Bar Siena was a disappointment. The customer service is my biggest complaint considering we had problems at both the bar and once seated. It's really a shame because it's a beautiful place and the food/drinks were delicious. I won't be back.", "pics": null}}, {"review": {"des": "Came here late at night for food after the club. The pizza here was absolutely amazing! I can't remember what else we ordered but everything we had tasted very good.<br><br>The location is easy to find.  The inside is really cool looking. It looks like a really fun spot for get togethers or even a date.  I think anyone you bring here will be very excited to eat here.", "pics": null}}, {"review": {"des": "I came here on a Monday night and it was pretty packed which surprised me. <br><br>Our waiter was friendly and attentive, so that was great. We ordered the mozzarella pizza, potato skins, and Brussels sprouts. The pizza was very mediocre and tasted more like sauce on bread. The Brussels were great though!! <br><br>This is definitely a fun place to come for groups and for a fun dinner out.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xfLMm5xN-wLTtVlR_1FmEw/168s.jpg", "caption": "Pizza with not much cheese"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BZ3uobOV3PZL48BOEhS5Ig/168s.jpg", "caption": "Potato skins"}]}}, {"review": {"des": "Always a fun place! Love the food, cute and fun bartenders, good music. Love that you can get donuts inside at the bar. Obsessed with the chopped salad! Khit is amazing behind the bar and a great conversationalist, can't wait to come back", "pics": null}}, {"review": {"des": "I searched Yelp high & low to find the best brunch spot to host a mini surprise engagement spot in Chicago and I landed here - thank god I did! <br><br>Bar Siena was one of the most hospitable & delicious restaurants I've stumbled upon in a long time! <br><br>I made a reservation on Open Table which I would recommend for brunch because it was packed! Upon arriving, they were extremely helpful in keeping everything a surprise until the last second and even allowed us to decorate the table! The staff was so kind and almost every server stopped by and said congratulations. It made the celebration feel even more fun! Plus they gave us a free celebration donut!<br><br>Now let's get to the food!! We had so many yummy plates I don't even know where to begin! The waffles with Nutella, bananas and syrup were out of this world. I had the sausage gravy & biscuits with eggs and it was fabulous. The traditional breakfast was divine as well, and everything came uniquely plated. The atmosphere is beautiful and I couldn't have asked for anything more! <br><br>Whether it's a special event or just a Tuesday - give this place a try!!!", "pics": null}}, {"review": {"des": "I loved this place! The atmosphere was great- loved the lit up tree in the center! <br><br>Good food and drinks! We split the octopus, short rib lasagna, corn ravioli, kale salad, and a pizza. Loved how it comes out when it's ready and not all together!<br><br>Our server was great! She gave relevant recommendations and refused to let us miss out on the fruity pebbles bombalato- even if it's weird! It was delicious l!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KBHq-EIFEFmErKic6DAuew/168s.jpg", "caption": "Fruity Pebbles Bombalato"}]}}, {"review": {"des": "If you're a Chicago foodie, or even someone's who enjoys to casually go out to eat a nice meal or to grab some drinks, you've heard of Bar Siena. The talk of the talk in West Loop, next to Girl and the Goat and Au Cheval, Bar Siena has a premium food and cocktail menu that will raise an eyebrow or two. The ambiance is perfect to bring a first date (or a fling of some sorts; no one will judge you), with booth, bar and even patio seating for these gorgeous summer nights out on Randolph street.<br><br>Craft cocktails are wonderful, aren't they? Just mix a whole bunch of liquids together into one handy drink and surprisingly, thanks to these great bartenders or whoever makes these drinks, the whole thing tastes amazing. I don't even remember what was in mine, I think the base was some form of tequila, but all of the different flavors just blended together perfectly to a strong but not disgusting cocktail. <br><br>Also, I love the twinkle lights that are hung all around the place. Reminds me of Christmas time, being comfortable in a nice warm home with great food, great people and of course, great drinks all around to my disposal. I will have to go back to try more of their menu.", "pics": null}}, {"review": {"des": "I heard good things about Bar Siena, so I wanted to try it out. Overall, I was pretty underwhelmed. We ordered an appetizer, a pasta, and a pizza, and they were all pretty mediocre. <br><br>I think our mistake was ordering Italian type food at this restaurant, though most of their menu seems Italian-centric. I recommend going for drinks, appetizers, and even desserts, but not necessarily to grab a full meal.", "pics": null}}, {"review": {"des": "Decided to try this place out since I've only had their desserts (BomboBar) I came in around 4pm and it was pretty dead but somehow I still managed to have our pizza come to the table cold, not warm, but cold! I'll definitely stick to just the desserts from now on.", "pics": null}}, {"review": {"des": "Was looking for a place to catch up with old friends, and a coworker recommended Bar Siena. Was not disappointed one bit! <br><br>A waitress, Emily, took care of us all night making sure to check up on us every so often even though she was swamped with other people. She recommended great drinks when we asked for a random selection of her choice.<br><br>Overall a great time in a good, pleasantly busy atmosphere. I'll definitely be coming back.", "pics": null}}, {"review": {"des": "While waiting for our table at Au Cheval, we dropped in for some appetizers and cocktails. We were able to grab a table at the front area immediately, on a Thursday evening. Service was great, food and drinks came out fast!! <br><br>We ordered:<br>Duck mac and cheese<br>Short rib lasagna<br>Sienna salad<br><br>All good. Would definitely come back for more.", "pics": null}}, {"review": {"des": "I came in this past Saturday for dinner. I was seated right away, for 5:15 pm the restaurant was super busy.<br><br>Our waitress was very friendly and provided good suggestions. <br><br>I had the cheese stuffed bread for an appetizer. It was very tasty. I really like the arugula, honey, and cheese on top. It had so much cheese in it. The app is a good size for 3-4 people. I would order this again!<br><br>For dinner I had the sweet corn ravioli which is my favorite dish. It is great every time I order it.<br><br>My friend had the calzone. It was gigantic, two people could easily share it. She enjoyed it!<br><br>I've also had the potato soup. It is the perfect amount of creaminess. Plus it comes with a mini grilled cheese on the side. <br><br>For dessert I had the vanilla gelato with caramel drizzle on top. Their gelato is super  flavorful, definitely on the creamier side. A lot of their flavors they mix things into it. My friend had the activated charcoal oreo gelato, definitely something I have never had before. It was tasty!<br><br>We also had the bombitos (donuts). They come with little bottles of fillings that you choose when ordering. My friend and I enjoyed the caramel and s'mores donuts. This a very heavy and filling dessert! <br><br>Overall this was a great visit!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eMYcp-oE4-sb0uxxaF8hiw/168s.jpg", "caption": "Sweet Corn Ravioli"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Pynj28RQ8WyFzTSscWZFFQ/168s.jpg", "caption": "Bombolato"}]}}, {"review": {"des": "Bar Siena is a rustic but trendy two story restaurant in Chicago's West Loop. I went for Sunday Brunch with my friends and really enjoyed my experience there. (We were able to get in without making a reservation ahead of time, but the restaurant was pretty full.) <br><br>Bar Siena serves a variety of brunch options. I really enjoyed the Lobster Eggs Benedict that I ordered; although my friends and I did not order the Breakfast Pizza, it seemed like a popular order for the tables around us. Make sure to get one (or more) of the bombolonis (Italian hole-less donuts) with squeeze bottle fillings. Not only are they delicious, they're incredibly cute.", "pics": null}}, {"review": {"des": "Honestly, this is one of my favorite spots in Chicago. Design of the restaurant is laid-back but fun. Kitchen is semi-open (you can see some of the action from some of the side seats). Fairly easy to get a table even during busy brunch time if you are only a table of 2. Any larger of a group, there will probably be a wait. Food is always good. The desserts are delicious. I take my kids to Bombobar (the dessert and coffee window outside) during the summer for gelato. During the cooler temps, I love getting a Hotter Chocolate. They are big enough to share - if you want to share....", "pics": null}}, {"review": {"des": "Very spacious-- actually had seats on Fourth of July! Amazing! <br><br>The servers were really nice. Hard to get their attention as they were very busy and they gave us the wrong bill BUT they were trying their best. <br><br>Their Cal zone and Salad were amazing. I would love to go back!", "pics": null}}, {"review": {"des": "Extremely mediocre food - came here with 5 friends and we ordered a variety of pizzas, pastas and salads and all agreed that it was nothing to rave about. The ambiance is awesome though, but I'd recommend coming here for drinks only. I think I'm a bigger fan of Siena Tavern in River North.", "pics": null}}, {"review": {"des": "Came here with work friends as we searched for a place to eat for dinner.  Bar Siena is a sister restaurant to Siena Tavern (which I still need to visit) and is quite large compared to the other West Loop restaurants.  Due to its size, it is much easier to get a table here than it is other restaurants in the area.<br><br>The 6 of us sat down for dinner, and ordered drinks and appetizers.<br><br>I apologize for not remembering which drinks we got, but they were so unimpressive and unmemorable that I cannot really say much about them besides, save your money.<br><br>The Appetizers we got were:<br><br>Meatballs (normally come as 4, but we paid a bit extra to get 6) - These were perfectly good meatballs, and are a tasty start to the meal.  That being said, I am not rushing to go back for these.<br><br>Steak Tartare - This was a unique one.  It was not traditional in the sense of raw meat with an egg, but rather almost like a steak tartare hash, with bits of the meat scattered with capers, crispy onions, seasoning, oils and a tiny quail egg.  This was another \"perfectly fine\" but not amazing appetizer.<br><br>Burrata - Ok finally a winner.  I HIGHLY recommend this appetizer.  I Burrata was perfect and offered a spiciness from a mustardy sauce used in it that balanced the creaminess of the cheese.  A definite recommend.<br><br>In terms of entrees, we got the following:<br><br>Short Rib Lasagna - This was more like a baked Short Rib dish with some pasta and sauce in it.  I wouldn't exactly call it a Lasagna.  It was pretty good and a staple of theirs.  No wow factor, but delicious.<br><br>Sweet Corn Ravioli - This one did not impress me.  As a matter of fact, this was the only dish we did not finish.  The pasta was well cooked, but the sweet corn just did not go well in this dish.  Most shrugged off this dish as mediocre at best.<br><br>Gnocchi - The hit.  This dish was absolutely packed full of flavor.  The Gnocchi was perfectly cooked and the Marsala like sauce it was in was beyond delicious.  We found ourselves scraping at the plate trying to get more sauce on our forks.  There was a spicy sausage that was tossed with the dish that was also extremely delicious.  I would go back for this dish!<br><br>Fig and Prosciutto Pizza - Very well cooked pizza with great bread(crust).  Good ratio of toppings and nice bite to the pizza done Neapolitan style.  I recommend the pizzas here if you are in the mood for one.<br><br>All in all, it was a perfectly good dinner, but aside from the Gnocchi, nothing here screamed for me to go back to Sienna next time I am in town, versus the other amazing places around the area.", "pics": null}}, {"review": {"des": "Nice spot for a small group.  From the Antipasta to the entrees, it makes perfect sense to simply share and get filled. <br><br>As the server suggested, the food is good.  The flavors were rich and lingered.  Sure, $21 for that lasagna or for a medium pizza seems a bit over-priced.  It's worth it.  Every item tastes fresh, flavorful, and was served hot!<br><br>We'll be back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/j0f8cBs51Y39JoHYFry-EA/348s.jpg", "caption": "Meatball and Mozzarella with Crostini."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qvVGxnOmi2gH6YrMpR_X6Q/168s.jpg", "caption": "Ahhh, the donuts with filling, icing, or a waterfall in your mouth!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rmNrGKd3UnVP247S9fsfGQ/168s.jpg", "caption": "Double scoop of gelato ($5) with a mini-donut ($1)."}]}}, {"review": {"des": "It had been awhile since I'd been back on Randolph St. for a meal. It was my old stomping grounds in the late 90's and early 2000's. I decided to stop by Bar Siena for a quick late night meal. I grabbed a seat ant the bar and was quickly greeted by one of the bartenders Emily. I ordered a makers mark old fashioned and it was spot on! Not familiar with the menu she walked me through it and helped me pick out a perfect pasta. The meal was great as was the service. There where 2 other guys working behind the bar and both were also quit attentive. I want to say there names where Steven and Andrew. My water stayed full and I was quickly refilled with my old fashioned. Overall it was a great experience and will definitely return. <br><br>I used to work in the neighborhood and as much as I miss some of the old spots, Bar Siena exceeded my expectations.", "pics": null}}, {"review": {"des": "I've been here 4 times in two weeks and I will not stop coming back. The food and the service are all top notch. One of the highlights of the west loop", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lwbcGgHSZKYyqmQHUZftnw/348s.jpg", "caption": "Pomegranate Mimosa"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/T7j-iwUyy1h_kIfIvCwPuQ/168s.jpg", "caption": "Breakfast Sandwich"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3bzAyfdYO4_mSWbpFHh2qA/168s.jpg", "caption": "Bloody Mary"}]}}, {"review": {"des": "My rule about restaurants: if I can make it myself, I shouldn't have to pay you to make it for me.<br><br>This is not a reflection on my own cooking skills, but I genuinely felt like I could make most of the food we tried there. We had the Prosciutto Fig pizza, the Gnocchi, the Fava Bean & Black Truffle Risotto, and the Sweet Corn Ravioli. Everything was good, but I didn't feel like the modest portions were worth the higher prices. The exception was the Sweet Corn Ravioli, which was one of the best pasta dishes I've had in a long time. I most certainly couldn't make that at home, but now I have something to aspire to. <br><br>The service was great, so no complaints there. Our food came out pretty quickly. The atmosphere and decor are great for a night out with friends. I probably wouldn't go again, but if you do find yourself here, you'll have a good time. Definitely go for the pasta dishes and skip the $20, mediocre pizza.", "pics": null}}, {"review": {"des": "I had the most amazing lasagna ever. It looked so little but made me really full. The Bar Siena chop salad was heaven. It was a meal not a salad. Every yummy thing you could think of could be found in that salad. Well... There was one thing though, we ordered Beef Tartare and I had no idea it's served raw. For someone who eats her burgers really well done it was a nightmare. Good thing my husband didn't mind eating it.", "pics": null}}, {"review": {"des": "Just when I thought a bad night couldn't get worse, we came here and it was worse!!!! We were given regular menus, then told that the late night menu was all that was available. ROLLS EYES. We settle for the fireball pizza well done, extra sauce. Pizza came out in about 5-10mins which was fine. It was also prepared correctly. Great<br><br>Our issue here was service. Or lack there of. The waitress was curt once we FINALLY got a server. I sat a good 10-15mins waiting on assistance. Then we ordered drinks & she didnt bring straws my boyfriend requested a straw she says they dont have any straws anymore. So later in the evening she disappeared so I went to the bar to ordered drinks and guss what I see?? STRAWS!!!!! 2-3 straw boxes. So either she told a sorry ass blatant lie, or her lazy ass didnt know what she's talking about. Either way it pissed us off because she was already horrible!!! So the bill is $90. Guess what we tipped her? A DAMN STRAW!!!!!!! Next time do your job. <br><br>Saving grace for 2 stars were the bomb ass dj. He had non stop good hits. And the drinks were good.", "pics": null}}, {"review": {"des": "Love this place. Great food and great cocktails. Katherine is a phenomenal bartender.", "pics": null}}, {"review": {"des": "Up your ice cream game! Bar Siena tries to be alot of things, kinda hipster, sports bar, cozy, loud, refined, and trendy all at the same time. Honestly, I'm conflicted in a not so excited way, but the food is good and the gelato even better... Just a wee bit expensive for me to want to come back, at least to dine anyway.<br><br>Definitely stopby for the gelato either outside or at the bar. I got the matcha crisp and it's completely filled with them! I did not care for the bombolino a piece of fried dough covered in granulated sugar.  The duck Mac and cheese had a nice texture shell like pasta, lots of cheese, and but no real sign of foie gras. Pretty safe but kinda spendy. Looking around the room, pizzas were popular, but some of the other dishes looked really good too. I'm conflicted...", "pics": null}}, {"review": {"des": "I came here for the first time this week after having been to their sister restaurant, Siena Tavern, a few times.  I would say that Bar Siena is more casual, and probably a little more trendy (and also less expensive--I think?)<br><br>My friend and I ordered two dishes to share: the Duck Mac n' Cheese (delicious!) and the Bar Siena Chop Salad.  This was plenty of food for us--the salad was giant!  They also have a solid wine and cocktail list.  The service wasn't super memorable, but it was kind and decent.  I would come back!", "pics": null}}, {"review": {"des": "I wanted to make one more stop before heading back to the suburbs. At our second lunch, I searched yelp for spots and found Bar Siena. We walked in on Tuesday, December 5th around 2:15pm. It was rather empty, so we easily grabbed two seats at the bar.<br><br>I got the No 26: glenmoramgie 10 yr, apple spice, lustau solera, bitters ($14). I wasn't sure what to expect, but out of all the cocktails on their list, this one seemed the most me. (I tend to like scotch, whiskey, rye, etc.) When I got it, it was very holiday themed in decorations. I think they garnished it with cranberries and something green to resemble holly. To me, the cocktail seemed like a play on a light Manhattan with a Christmas twist. The apple spice really did make me think of the holidays. I enjoyed the drink, though I would have prefer something more spirit forward.<br><br>When we sat down, we realized Bombobar is in this bar, so we ordered a few things. The roommate got an Affogato: vanilla gelato drenched in hot espresso ($8) and we both shared a plate of Bomboloni: an Italian hole-less doughnut with Mixed berry, Vanilla bean custard, and Nutella cream (3 for $10). The donuts were so good! Fresh out of the fryer and crispy.<br><br>Glad we made time to stop by Bar Siena. And then found Bombobar while here. A drink and donuts?! Two of my favorite things in one stop!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WcH-T81nLq6JriA4xON6BQ/348s.jpg", "caption": "No 26: glenmoramgie 10 yr, apple spice, lustau solera, bitters ($14)"}]}}, {"review": {"des": "The fig arugula proscuitto honey pizza is one of the best pizzas I've ever had! Came out piping hot straight from the oven. Great service and lots of seating. Has both indoor and outdoor space.", "pics": null}}, {"review": {"des": "My favorite thing about Bar Siena is the atmosphere. Downstairs there are TVs everywhere and the seating surrounds the bar, which makes it great for catching a game while getting some drinks. <br><br>Upstairs has more tables and the lighting and setup is more pleasing. There is a cool light tree piece in the middle of the room. I definitely like to have a more sit down meal here.<br><br>The cocktail menu is pretty vast, and there's something for everyone. Last time I ate here was for Restaurant Week, and there were good options. I basically tried the whole menu, and my favorite was definitely the Butternut Squash Pizza and the Smoked Mozzarella Croquettes. The pizza had a great pesto base and the croquettes were crispy but cheesy inside. Perfect combo. The white tuna appetizer is also very flavorful. <br><br>I highly recommend going there for dessert, especially get their Bomboloni's , donuts filled with any filling. My favorites were the salted caramel and Nutella. Definitely really fun to play with the \"squeeze me\" bottles and mix and match them.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vwQhBYUg0s272QZAIZeqHQ/348s.jpg", "caption": "Roasted Butternut Squash"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nexnTInb9I6aYTOGbW6-sw/168s.jpg", "caption": "Smoked Mozzarella Croquettes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AIyQ1aW2eLk0rpcdsM7PQg/168s.jpg", "caption": "Bomboloni"}]}}, {"review": {"des": "Went to the bar while we waited for a table and Heather was fantastic. She recommended the #4 and we loved it! After we got sat Whitney recommended multiple plates we enjoyed. The gnocchi and octopus were our favorites but the half and half pizza were something we'd come back for. The prosciutto fig pizza was so good. Definitely recommend!!!", "pics": null}}, {"review": {"des": "Not amazing, but definitely above average! Bar Siena is a place I'd like to come back to again, but just maybe after I check a few other restaurants off my list.<br><br>The decor was really really nice -- curved booths and a two-story twinkle light tree at the center of the restaurant made this place feel so cozy! But our waiter was really awkward and toed the line between apathetic and just plain unfriendly. We were celebrating my friend's birthday, and he made it downright difficult to coordinate bringing out a birthday dessert and paying for the bill before it got to the table. <br><br>The food was REALLY good, yet still somehow not anything to make a best-of list. Weekend brunch goes until 3pm, so I had the steak and eggs, and my boyfriend had the breakfast calzone. The steak and eggs seemed small for the price, but the quality was on par with about any other West Loop restaurant. And I really loved the spicy salsa that came in the side! The breakfast calzone was almost bigger than the plate, and my boyfriend had to admit defeat and take at least half of it home. <br><br>Also to note: Bar Siena has a completely separate gluten free menu! And it had so many options. I really want to come back to try the risotto, and I was impressed that the waiter asked about allergies!", "pics": null}}, {"review": {"des": "Came all the way from Northwest Indiana to try this restaurant, only to find out it was a huge disappointment. Their menu was small without a lot to choose from, the appetizrmers were hard. Also, the cocktails on the drink menu were absolutely awful for being $17 each!!!! <br><br>I edited my review because after posting this, the GM (Jennifer) contacted me and offered to have us back for a new meal for us in attempts to win us over.<br><br>Furthermore, I will update this review more appropriately after re-sampling their menu choices in a couple weeks. Contacting me and trying to make things right says a lot about a business, and that's how you properly handle this type of situation.", "pics": null}}, {"review": {"des": "We came here for brunch on a Saturday for restaurant week 2018. The four of us got seated at a large comfortable booth on the 2nd floor. The restaurant week deal was 3 courses for $22 plus a beverage (coffee, juice, and soda). All of items were off the regular brunch menu, so it was a great way to try their food at an incredible deal.<br><br>The first course was either avocado toast, or a spiced apple oatmeal. The avocado toast was half portion and came with a poached egg and Marcona almonds - delicious! The oatmeal was super creamy  and decadent, definitely a step up from the oatmeal I make at home. For the main entree, I got the breakfast pizza, which came as an entire pizza! The pizza was a thin crust white pizza covered with yummy sausage and prosciutto. My friends ordered the short rib hash and omelette with breakfast potatoes. We all thoroughly enjoyed our entrees. <br><br>For dessert, we got to choose from a selection of bomboloni (an Italian hole-less donut). We ended up getting the Nutella and salted caramel; the filling came in cute squeeze bottles for you to squeeze into the donut. <br><br>My boyfriend and I also got one of each of their famous, over the top hot chocolate ($9). The s'mores hot chocolate came with marshmallow whipped cream, two chocolate cookies, and a mini bomboloni. The funfetti hot chocolate came with whipped cream with sprinkles on top, two funfetti cookies and a mini bomboloni. Both were super fun and tasty, although it's a lot of sugar to have first thing in the morning. I got super full off the hot chocolate that I ended up taking a lot of the breakfast pizza and donuts home. <br><br>The service was also great for such a popular/busy place; the waitress was always checking in on us and everything was done in a timely manner.<br><br>TLDR; all around great food and ambiance, fantastic deal for restaurant week.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Kx5Qac6dqskB2w_NIpTYog/348s.jpg", "caption": "Short Rib Hash"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/a2bIJdQDnl6z5GIZe_-Gcw/168s.jpg", "caption": "Bomboloni"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vbQjLMvUsOf-cVrTTNyo_w/168s.jpg", "caption": "Avocado Toast"}]}}, {"review": {"des": "I think Yelp's 'A-OK' is perfectly fitting. This place is always packed and seems like a fun spot. We went for dinner on a Friday night at 9PM and the place was bumpin' (they even had a DJ). <br><br>Upon arriving, the unenthused host and hostess told us to stand aside and wait a minute for our table. It ended up being closer to 15 minutes, which is fine, but it would have been nice to know that so we could have grabbed a drink from the bar while waiting. <br><br>Seated outside, we could enjoy the bustle of West Loop while also being able to chat since the music wasn't as loud. Our server was very soft spoken which proved to be difficult through the night, as the music was still fairly loud. Nonetheless, he was super friendly and attentive!<br><br>Food is where I really think Bar Siena falls short. Amongst the three of us, we shared the meatballs, burrata, glazed ribs, duck mac n cheese, and the gnocchi. <br><br>The meatballs tasted good but weren't hot. They came SO late that I suspect they sat on the line for a bit before being delivered. I'd order them again and hope they would be hot. <br><br>The burrata was great and the glazed ribs were killer!<br><br>The duck mac n cheese was SO rich but not in a good way. The cheese/cream sauce really overpowered any flavor of the mushrooms and duck. I expected a flavorful dish that highlihgted the ingridients, but instead got a very comforty, ultra filling bowl of mac. Not what I was looking for, but if that's what you're after, it's there for you!<br><br>The gnocchi was rich was well but not like the mac. It was good, not great. That's really all I have to say about that. <br><br>Overall, there were hits and misses. Given the price point (i.e. not cheap), I wouldn't rush to go back. But, if you find yourself on your way there with friends, it'll be a fun time. Just be sure to do some research on Yelp and find the dishes that other have raved about!", "pics": null}}, {"review": {"des": "Open late with a good selection of late night food. I first came here with a buddy during a bar hop run in Chicago and had a blast. Can get a little crowded at night but tolerable. This time I was passing by for a late dinner and it hit the spot. <br><br>I got the Tagliatelle which was perfect for what I wanted. Not too hearty but flavorful and filling at the same time. Want mind blowing but well done for what seems to primarily be a bar. <br><br>Good spot to kick it with friends! Would definitely be back if the opportunity presented itself.", "pics": null}}, {"review": {"des": "Had a great time at Bar Siena! My previous visit would've been 2 stars for Restaurant Week last year but ordering off menu was so much better. Went on a Friday late night. Initially was going Bombobar for their amazing, yummy hotter chocolate but didn't want to sit in the cold so decided to see if we can get a table at Bar Siena, eat & still get their dessert. Sure we scored a table and what a great experience! The server was so welcoming and nice throughout our entire dining experience. Now, let's talk about pizza. I'm not a person who'd typically order a pizza with no meat. Actually, I don't even typically like pizza! But their wild mushroom & garlic pizza? AMAZING! Yummy!! <br>Sangria? Could've totally skipped it. Brussel sprouts were pretty good. <br><br>For some reason, the s'mores hotter chocolate tasted so much better 1st time around in a to go cup. Maybe the restaurant was so warm and getting a hot chocolate on a glass mug wasn't my thing. Either way, still enjoyed so I can't complain. Perhaps I was too full too by the end of all this yumminess. :/ <br><br>Now back to their pizza- did I say how delish that was? Yum!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cc-eY-_4Hc1EAthd3r949Q/348s.jpg", "caption": "Restaurant Week Menu 2018"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VAU02MnJZ4snFC-hi80--w/168s.jpg", "caption": "Siena Sangria"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UZTC66g1ZqoRVZ_g9nURJw/168s.jpg", "caption": "Balsamic Glazed Brussels Sprouts"}]}}, {"review": {"des": "Siena Tavern is one of my favorite restaurants and I am a big fan of Chef Fabio, so a visit to Bar Siena was going to happen someday...and that day finally came. <br><br>So fitting that I came here with my son as he is a huge fan of ST's giant meatball and was excited to see if the meatballs here were just as good.  Yes, he's 7. He knows good food.  I was just hoping for a cool place to have a drink and some good eats. <br><br>They encourage small plate sharing here. And the menu lists a lot of great choices, as well as pizza, sandwiches and pasta. <br><br>We ordered the meatballs, kale salad, taleggio focaccia and even though it's not on the menu, I was able to get a side of fries as well.  <br><br>Everything was delicious.  The salad was super fresh and the lemony vinaigrette was perfect.  The taleggio focaccia is like a grown-up grilled cheese and the arugula gave it a nice peppery bite. The meatballs were really good too--hearty and served with a delicious pomodoro. And the fries, my son had to say \"oh these are so good, you have to try them mommy!\".   We had a lot left-over and it made for another great meal at home. <br><br>I had a delicious tequila cocktail. My son opted for the kiddie cocktail--here it wasn't made with grenadine and sprite, it was a citrus drink and my son said it was too sour. <br><br>Service was super sweet and helpful.  The space is beautiful, you almost forget it has sports bar leanings with all the TV's turned to sports programs. It's loud, conversations carry and just as I expected, there were quite a few \"I'm the guy\" types hanging out.  But otherwise a fun experience.  <br><br>PS if you follow my son's foodie adventures, he liked the meatballs here, but said the giant one at Siena Tavern is better :)", "pics": null}}, {"review": {"des": "Loved this place! The ambiance/decor, food, drinks, and gelato were all amazing. I'm writing this review a few months after having been here, so I don't recall exactly what I ordered, but it was all delicious. I was with a large group from work and we all loved everything. The standout was the gelato though and the restaurant smells delightfully sweet thanks to their made in house gelato.", "pics": null}}, {"review": {"des": "I've been here a few times for dinner, after dinner drinks and brunch. I think brunch might be favorite meal here so I would suggest it for brunch. <br><br>My friend and I popped in here after picking out bridesmaid dresses for her wedding. She ordered the breakfast pizza which looked incredible and I ordered the cheddar scrambled eggs. The outdoor space was lovely and it was fun to people watch in the West Loop.", "pics": null}}, {"review": {"des": "Great pizza. Pretty think crust. Fast service. We asked our waiter to surprise us with a shot at the end and came through with a decision green to shot. Fun experience", "pics": null}}, {"review": {"des": "Came in on a Saturday night for a 9:15pm reservation and although that was a little complicated (our table wasn't ready and a few others who had reservations were waiting, too) the food and friendly staff made up for it. <br><br>I'm going to take a risk and say that anything you try from their dessert menu will satisfy. YOU NEED TO TRY THEIR DESSERTS. Seriously, make room.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EqLqplUgLow0fruUDr3X3Q/348s.jpg", "caption": "This bombalado is everything. I would come back just for this."}]}}, {"review": {"des": "Toxic masculinity- preditory behavior- one bartender here has it all! <br><br>My friend and I decided to finish our evening here last night with a drink around 11:00. We ordered two no.4's and sat at the bar nursing them for about 45 minutes. At that time two men from the restaurant we were at previously showed up and started talking to us and three woman next to us.<br><br>This is where I'm not sure what happened but suddenly the bar tender became very agitated, red in the face and causing a scene for no reason. The bar tender refused to serve the men and told them they were \"crowding the women at the bar\" despite non of us complaining.<br><br>I asked for another drink and was declined service because I was speaking to one of the men. I was astonished. So the two men leave and my friend and I are still sitting in the same spots we've been for an hour and the five minutes the men were speaking to us. And I ask again \"can I get another no.4\" and the bar tender on some sort of power trip proceeded to grill me about my association with these guys, which there was none, and I had to essentially prove my worth to get a drink. <br><br>However at the same time the three women next to us were departing and the bartender begged them offering them free shots to stay.<br><br>The whole experience read as him upset these other men distracted the three women from his attempts to flirt with his customers, get mad when he had to actually do his job and desperate in anyway to gain attention from certain women. <br><br>I did speak to the GM at the end of the night who was very understanding and offered a drink on the house but we just wanted to leave. <br><br>The no.4 drink was delicious.", "pics": null}}, {"review": {"des": "Wow those balsamic glazed pork ribs are TO DIE FOR! Doused with glaze and covered in crispy brussels sprout. I come here just to indulge in those finger-licking ribs. The only downside is that they don't offer it entree style, and an app is $17. I've been satisfied overall on the number of occasions I've eaten here. Their cocktails are nicely crafted. Nothing elaborate, but well mixed and easy to drink. I particularly enjoyed the short rib lasagna. It's one of the better dishes ive tried. <br><br>Unlike its sister restaurant Sienna Tavern, this place is easier to snag a table if you're doing a walk-in and is also easier to make a reservation for peak dinner hour. The place is typically packed, even with seating upstairs and downstairs but turnover is quick.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sJlSQAq3HmmRmjGXVtuLmg/348s.jpg", "caption": "Balsamic glazed ribs SO AMAZING"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XY8sp9Ci3H7jVPUu0sch-w/168s.jpg", "caption": "Burnt pepperoni pizza"}]}}, {"review": {"des": "This is definitely a place where you're going to splurge on your meal but it's well worth it. The menu has tons of options and they all sound good. I need to go again because I have a few other dishes in mind that I want to try. <br><br>I dined here for lunch the other day and had a wonderful experience. My waitress was so helpful and had tons of great recommendations. However, keep in mind that when they ask you what kind of water you'd like that they charge you for it. I sat outside and the decor makes for great pictures. Although Randolph St. is a busy street, the outdoor seating area was super peaceful. I was really excited when our waitress told us that Bombobar is actually connected to this restaurant. You can order off their menu for dessert while sitting in Bar Sienna!", "pics": null}}, {"review": {"des": "They have an outdoor patio and seating upstairs.  I sat at the bar on the first floor so I could watch some of the world cup while eating.  Staff was nice, service was good and the cheeseburger was decent.  Stopped in on a hot Saturday afternoon after walking through the Randolph Street fest.<br><br>I would go back and try something else.", "pics": null}}, {"review": {"des": "I have walked past this place a million times but have never eaten here. I LOVED the patio, we had a corner spot with was perfect for our puppy, just tied him to the railing and he was able to sit behind us in the shade. <br>The food came our as it was ready so we shared tapas style- which I think is the best way to eat a meal. <br>I can't tell you what my favorite food was but if I had to pick one I think it would be the focaccia bread-- ABSOLUTELY AMAZING! <br><br>Great ambiance, great drinks, great food and above all GREAT SERVICE! Can't wait to go there again- especially on a summer night!", "pics": null}}, {"review": {"des": "Them: \"Its slow so we decided to close early.\"<br>Us: \"we have 11 people and you close in 2 hours.\"<br>Them:\"our late night menu was a lie, we hate money.\"<br><br>Pretty much how it goes", "pics": null}}, {"review": {"des": "The food here is fantastic! I've been here for dinner a couple times and can confirm that the quality of their food is consistently well done. I've tasted the Short Rib Lasagna, the Sweet Corn Ravioli, a few of their pizzas and their classic calzones. Not trying to be overenthused here, everything did really taste amazing. The pizza crust is thin and crispy, the pasta entrees are packed with flavor and their calzones are worth every penny. I would recommend sharing entrees between your party so you can try a variety of their dishes at once.<br><br>The service here was also very friendly and attentive the last few times I've been. They are very personable and try to provide the best for you.<br><br>Bombobar is also connected to Bar Siena so you can order dessert from them at your table after your meal. Nothing like a warm, filling-packed donut to finish off a high-qual meal!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nEiENkEeSH-je-Lgd-yGwQ/348s.jpg", "caption": "Carne Pizza!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PKpjm_68Ww4S1XR6_iyR7w/168s.jpg", "caption": "Chocolate S'mores"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/akpKOjl1bGpGY61xZY6fkg/168s.jpg", "caption": "Sweet Corn Ravioli"}]}}, {"review": {"des": "I really enjoyed this place! It's been on my list for a while and I met a few friends for mid day drinks on Sunday there and sat at the bar. The bar ended up being really crowded, but we were still well tended to the whole time. We each got a beer-- pretty good selection overall. <br><br>I was starving, so I enticed the group to get food and we were not disappointed! We got a half and half pizza along with the meatballs and everything was really, really good. I would definitely go again for dinner. But, it is definitely on the pricier side so be warned!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1Y39vu8CKEUhY9YhI36viQ/168s.jpg", "caption": "Half breakfast, half veggie. Both halves were"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9Re0SfMbrRW04jYQFMU-ng/168s.jpg", "caption": "Meatballs- so good!"}]}}, {"review": {"des": "This place is always a hit or miss depending on what time of day/day of the week you come. I came for Sunday breakfast once and it was pretty dead.. but on some days there would be a line. Reservations recommended guys! Don't be mad at a long wait if you haven't called in! <br><br>Food and dessert are very pricey though was ok. HOWEVER, the fig pizza was bomb. And everything is presentable.", "pics": null}}, {"review": {"des": "We can talk about the food, because it was superbly delicious. (More on that in a minute.) We can talk about the atmosphere, because it was a pretty nice vibe - not too hipstery, not too old school, a nice little comfy spot to eat a semi-pricey dinner, a little crowded space but still cute. Or we can talk about the service, because you know, in a city littered with some of the best restaurants in the world, and at least 50000 that were recommended to us, the service is what will make you swoon. <br><br>But the food, my god man, the food. The tartare was a tasty blend, but when thinking about a salad - a freaking salad!! - that you had a week ago makes you drool a little wishing you could have it again... you know it was good. (The Bar Siena Chop, for the record. Smoked mustard vinaigrette.) A plate of cheese & salumi might not actually really be the chef's accomplishment, short of slicing the meats just right, but that mostarda is to die for. Formaggi pizza, just right. (Although we did take a few leaves of the rosemary sprig from my hubby's super tasty #10 cocktail to sprinkle on it, to make it even more fantastic.) <br><br>It's probably good that Chicago is a bit too far to drive for dinner for us Clevelanders, because I'd be there every night. <br><br>What really made the experience for us though was the service. From the moment we reached the door - early for our reservation but absolutely not a problem! - to walking out the door, we were welcomed, doted over but not pestered, and we were taken care of. Our server, Cat, could not have been more gracious, helpful, or attentive - there was never a moment we wondered where she was, and she gave us a little special attention (with the help of Steve, the assistant general manager) as we were there as a part of our honeymoon and there because we have a special love for Fabio Viviani. Together the two of them put the whole experience over the top, and were just absolutely blown away by their kindness and cheer. <br><br>We are talking plans to return to Chicago in the future, and Bar Siena will most definitely be a return visit, thanks to Cat and Steve!", "pics": null}}, {"review": {"des": "Wings were unbreaded and smoky fantastic. Habanero sauce was tasty and mild.<br><br>Highly recommended", "pics": null}}, {"review": {"des": "I would give this 3.5 stars, but rounding up as it leans closer to 4 and than 3. <br><br>Bar Siena is a staple on Randolph street and we haves dined here quite a few times. We have tried a plethora of dishes here:<br><br>Brussels Sprouts: not a fan of these even though every waiter gushes about them. They are drenched in the sauce, not crispy, and just not stellar in anyway. <br><br>Burrata: we really like this dish and it's a great starter. The bread is really well done, crunchy and soft at the same time (if that's possible?). The cheese and apricot preserves balance well. HOWEVER, they charge upwards of 17-18 dollars for this and that's just ridiculous. <br><br>Truffle Pizza: this lacks flavor and has you wanting to dip it into something. First few bites are good, but we get bored with this dish after one slice. <br><br>Basil and mozzarella: really well done with good subtle flavors. They use a good amount of garlic here and we love that. We get it with the avocado ranch and it's a match made in heaven. <br><br>Gnocchi: pretty darn good! We first got this as a sharing dish and it was a good call as it's on the heavier side. <br><br>We also have gotten the Bombalonis here and of course they are delicious, but ours wasn't as warm as they come when you get them at the window. <br><br>food is decent, but it was 50 bucks for a pizza, burrata, and a coke. I get that it's Randolph street, but that is just way too much. Probably won't come back for a while due to value.", "pics": null}}, {"review": {"des": "I really like the atmosphere of this place. Food and service was great. Good music as well. We had the Diavolo Wings, Parmesan Wings, Short Rib Lasagna, and the Kale/Green Apple Salad. They have bars on both floors. Our waitress suggested the No. 13 cocktail which was a tasty choice. Definitely recommend.", "pics": null}}, {"review": {"des": "Great wine list. Service was exceptional. This place is really happening. However, I have to give it a 3.5 stars because a few dishes were too salty while one dish (beef carpaccio) was exceptional. <br><br>Food:<br>Potato skins: Delicious - they scoop the potatoes to make the gnocchi <br>Lasagna: Very meaty and filling - I think people hyped this dish up a bit. I thought it was just ok =/ <br>Octopus: Too salty <br>Gnocchi: The prosciutto sausage was too salty <br>Caesar salad: Good<br>Beef carpaccio: Exceptional - would definitely eat this again <br>Gelato: Delicious and love how you can add toppings<br>Bomboloni: Good too. I actually liked it plain. The hazelnut was just ok. <br><br>We had an incident when our waiter was pouring wine and a customer bumped into him and it splashed on everyone's clothes and got in our beef carpaccio. Waiter was great in taking away the plate and giving us some club soda and napkins. The manager Emily on duty was really nice and gave us her card. She told us she would pay for our dry cleaning but we know accidents happen. They were great in giving us another beef carpaccio and taking off a few items off our bill to help compensate. We thought that was a nice touch. Thanks for that!! See you next time.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JNoP7VSTVsuSf4jXak1ONA/348s.jpg", "caption": "Dessert menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/n_YYAxLIwIx6rgQt7wlyUg/168s.jpg", "caption": "Water closet"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iMp2QS9hxg1GG6GPeCTdIQ/168s.jpg", "caption": "Potato skins"}]}}, {"review": {"des": "Good atmosphere, food and drinks. Worth a visit if you're looking for something good for a group.  Fabulous beer list.", "pics": null}}, {"review": {"des": "We came in during Sunday brunch.   We tried a little sweet, a little savory and a recommendation. <br><br>There is a lot of room for improvement in small areas.   Everything came out warm, not hot, not between hot and warm.....just luke warm.   This was incredibly disappointing.   We were on the second floor and I am not sure if this had anything to do with it but it really spoiled the meatballs and hashbrown especially.   <br><br>The carmelized waffle leaned a little more burned flavor than carmelized.    It still had a pretty good flavor once you slathered on the nutella butter but there was a distinct taste that wasn't pleasing. <br><br>The stand out was the parmesan potato skins and the dipping sauce and the desserts.", "pics": null}}, {"review": {"des": "I will have to try this place again. I originally went for the hot beverages from Bombabar, featured on their dine in menu, because a friend posted on Facebook how YUMMY THEY WERE. I drooled over the pics for a whole week, only to get there and get one of the worst servers Bar Siena had!!! My food, spicy oxtails with pasta, would have been AWESOME...if it wasn't cold!!! I have been always afraid to complain on the spot as people can be mean when serving your food. Then our hot chocolate from Bombabar was like warm at best! Wasn't very good at that temperature and was chalky as well. Maybe it wasn't the best selection to follow up after spicy oxtails as I later discovered. I enjoyed the flavors of my entree from Bar Siena, but the beverages and servers are something to be desired. I will try this place again and follow up.", "pics": null}}, {"review": {"des": "A friend and I came for Restaurant Week 2018.  Below is how I would rate the food items that I ordered/tried<br><br>Focaccia (9/10): Much better than I expected.  They put a spin on this appetizer by using a soft spreadable cheese, honey, and arugula<br><br>Mozzarella Croquettes (7/10): Not too memorable or special. I wasn't too impressed by this appetizer.   <br><br>Smoked Potato Soup (9/10) : This soup was seasoned well and tasted great! The mini piece of grilled cheese was a nice addition to this soup as well.   <br><br>Short Rib Lasagna (6/10): I am a true cheese lover, but this lasagna had too much of it.  The large amount of cheese distracted away from the other ingredients.  <br><br>Matcha Gelato (7/10): The gelato wasn't bad, but not some of the best gelato I've had in Chicago either.  <br><br>The service during our time was average.  This was fine since the place was super busy.", "pics": null}}, {"review": {"des": "If there were 6 stars I'd give Bar Siena that. Honestly just a stellar dining experience from top to bottom. Our waitress was very sweet and resourceful for out of towners. Our party decided we were just going to order a bunch of items and share. Bar Siena actually recommends this.. it's not \"tapas\", but it leans towards small plates style dining. Truthfully enjoyed every single thing we ate. The potato skins are a nice take on the famous app- definitely not traditional as they come in chip form with truffle oil and a garlic aioli dipping sauce. The prosciutto foccacia with honey was a freaking religious experience. Meatballs were tasty and the short rib lasagna was to die for. Lastly,  but most importantly..... whatever you do.. GET. THE. DONUTS.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AM4obPGn-xKjB83uMQ9CfQ/348s.jpg", "caption": "Short Rib Lasagna"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/H1tYDJ1rpz1s6QWLcKEeAA/168s.jpg", "caption": "Cookie Monster Dough, Bombolato"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fVbww-7y63M8hxilhxiK7g/168s.jpg", "caption": "Parmesan Potato Skins"}]}}, {"review": {"des": "I always dismissed Bar Siena as just another trendy restaurant that focused more on drinks and atmosphere rather than the food itself, but when I actually looked at their brunch menu, it was pretty legit. Brunch is usually a tricky meal to find a solid place for because there are some highly rated restaurants that do dinner way better than they do brunch, and it's hard to figure out what exactly they specialize in without doing a little digging. I personally prefer simple and hearty comfort food for breakfast, so fruit/toast/quinoa bowls just won't do it for me haha. I took one look at a picture of the biscuits and gravy and knew Bar Siena was my type of place.<br><br>Atmosphere: It was your typical River North type vibe: pretty lively with most people enjoying a little boozy brunch. The downstairs area is the main bar and booths lined against the wall, and the upstairs is the main dining area. <br><br>Food: The brunch menu was so solid that I had trouble deciding what to get, briefly considering to just be fatasses and order 4 entrees between 2 people haha. We compromised and just ordered 3 lol. <br><br>Short rib hash - If you're craving comfort food, this is the ultimate dish. It's basically just some good ass classic pot roast. The beef was so tender it was falling apart, and the whole cast iron skillet was filled with the juices from slow roasting the meat. The potatoes and carrots were super tender and soaked up all that fatty richness from the au jus. They topped the dish with a poached egg and garlic hollandaise to give it a little benedict twist, but the juices from the meat just sort've overpowered those elements. I appreciate the attempt though. <br><br>Pecorino biscuits and gravy - This was the dish that caught my eye. It was a cast iron skillet filled with country gravy and topped with a perfectly fried egg. Ever since Nosh and Booze closed last year, I was on the hunt for a new place to get my country gravy fix, and Bar Siena now seems like a worthy replacement. Just like Nosh, the biscuit here just tasted a lot better than most biscuits and gravy. It was moist and fluffy, and had a very cheesy/savory bite to it. The gravy was also top notch. Super thick and rich, with a peppery kick to it. And of course a fried egg on top of anything automatically made the dish better. The only piece I wasn't a big fan of was the chicken sausage. This was already damn unhealthy, might as well go all the way and put some real sausage haha. I was disappointed they didn't use the same pork sausage that they put in the Bombo breakfast sandwich, because that was probably some of the best breakfast sausage I've had. <br><br>Croque madame - As if we didn't already get our fill, we ended the meal with this heavy ass sandwich. Croque madame is like the ultimate ham and cheese sandwich. It was filled with layers of ham and bechamel, topped with a thick ass layer of fontina cheese, and then had an egg baked right into the top piece of bread. When you cut into it, the yolk just oozed throughout the sandwich, and made it even more glorious. I loved the sourdough because it was durable enough to handle such a hearty sandwich, and it absorbed the melted cheese so well like in a pressed panini. <br><br>Overall, every single item we ordered was on point. And based on my previous trips to Bombo Bar, the Bombo breakfast sandwich would've been a solid option too. I was pleasantly surprised with Bar Siena, and have a new go to brunch spot in the West Loop whenever I'm craving a food coma on Sunday mornings. If a hearty and heavy brunch is what you want, look no further.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zZKf7OMU1BykJQd3bOMJ9w/348s.jpg", "caption": "Croque madame"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xt-IKThMEWW_4h5DiTiBtQ/168s.jpg", "caption": "Pecorino biscuits and gravy"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qRQxZtgl0_ZzHI2IRjvUgA/168s.jpg", "caption": "Short rib hash"}]}}, {"review": {"des": "Went to Bar Siena last Thursday night to catch the end of restaurant week. Was able to make a res for 3 only a few hours in advance which was nice. <br><br>Right on Randolph, this is a huge bi-level restaurant with really sleek and modern decor. We had seats upstairs by the window so we could look out on snowmageddon 2018. 1st course we ordered all 3 options and shared (meatballs, focaccia and mozzarella croquets). Everything was small but quite good. Next course I got the smoked potato soup - also excellent.<br><br>Main course I ordered the short rib lasagna which was phenomenal- incredibly filling and satisfying. My friend also liked the fig pizza that was offered. For dessert I highly recommend the coffee caramel crisp gelato. Amazing!<br><br>I really enjoyed Bar Siena, 4.5 stars overall. The drinks and a lot of the dishes are a bit too expensive (west loop \"tax\" I suppose) but otherwise this place is great!", "pics": null}}, {"review": {"des": "We loved the bar and atmosphere. Easy going and friendly staff. We ordered a rose, beer and fig prosciutto pizza. Pizza was good, not the best in town but still good and I'd order it again. Good place to stop if you're waiting for a burger at Au Cheval.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0ilHjMy0Zx8pUsFCrpbtyA/168s.jpg", "caption": "Fig pizza"}]}}, {"review": {"des": "Great drink, great food, great people. Hangout with a couple of friends, we tried several cocktails, all of them were good. Personally I like No.5 most, sweet and easy to drink.<br><br>We also tried several appetizers: grilled octopus, beef tartare, chop salad, chef's selection cheese and salumi. We all love the soft cheese. For main dish I had lamb chop. It came with garlic salt and vinaigrette - love it!<br><br>The server was very patient. He carefully asked about allergy information and made sure all toppings were separate and no food contained allergens.", "pics": null}}, {"review": {"des": "Went here for a late dinner on a Friday night and it was HOPPIN.  We ate on the upper level, which was quieter than downstairs where a DJ was playing. <br>The atmosphere was energetic and the low lights accentuated the beautiful lit up tree in the center of the space. <br>We enjoyed the fig and prosciutto pizza with some wine.  All the ingredients were so fresh and the Neapolitan style crust was perfectly crispy.  <br>Overall great experience, just make sure you are ok with loud music and a clubby scene.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/G-cL0Y7hVWYgVdKl-gXJVQ/168s.jpg", "caption": "Center of the space on upper level"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4axxw9tvtJNpVdVdIQ9a2g/168s.jpg", "caption": "Prosciutto and fig pizza"}]}}, {"review": {"des": "Bar Siena is always busy no matter what day of the week you go there.<br>The food is always on point, my favorites are the grilled octopus, buratta, carni for the table(the portion is ginormous, serves up to 3ppl!), Steak tartare(just added to the menu, YUMM), and of course you can't miss the Bomboloni(best one in town). <br>The service was fantastic, very attentive bartender(Khit), so friendly, and the bar was so busy! I like hanging out here and Khit made me feel that I should LOVE hanging out at Bar Siena more often!", "pics": null}}, {"review": {"des": "Really enjoyed the food here! I came here with my husband and his parents to celebrate my husband's birthday and we had a great time. All the pastas are homemade and the pizzas are amazing. I would highly recommend the gnocchi. The only thing that I think they can improve on is allowing guests to make slight changes to the cocktails. I wanted to substitute vodka for tequila in their #10 drink and the waitress flat out said no without an explanation. She had a little bit of an attitude as if I was making an unusual request. Anyways, aside from that, I would highly recommend this place for dinner! They even gifted us a super delicious donut for my husband's birthday. Really nice!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OodEYVZRJfRm7MQzVzkiwA/168s.jpg", "caption": "Delicious gelato"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wIMhW8mzsBma4A59Yehh2A/168s.jpg", "caption": "Birthday donut"}]}}, {"review": {"des": "Great dinner, fantastic service, fun atmosphere! <br><br>Loved the entire experience. The food was excellent - each dish we tried was recommended by the server who schooled us on the menu (the goods, the greats and the bests). <br><br>The shaved zucchini salad was flavorful with a variety of nice textures from the span of veggies and Israeli Couscous. The dressing was perfectly balanced with acidity and a hint of sweetness.<br><br>Grandma's Gnocchi recipe is all the things! So tender, so smooth and creamy with a buttery almost mild cheese taste. The hand pinched prosciutto sausage is a-maze. This combo creates the perfect savory bite. Um, mouth watering!<br><br>The Wild Mushroom & Garlic Pizza was mild in flavors yet delcious! The crust had a perfect char.<br><br>Service was outstanding. The cocktails are perfection too.<br><br>LOVE!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8jmwwWjaH_788JRty900ZA/168s.jpg", "caption": "Wild Mushroom Pizza"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/l9KZJAS8gWjqFu07XyxioA/168s.jpg", "caption": "Zucchini Salad & Gnocchi"}]}}, {"review": {"des": "I am a fan of this place for a girl's night out in West Loop, and I keep coming back for the seasonal cocktails. No. 13 is my absolute favorite and I'm going to try to recreate it at home. You will likely need a dinner reservation for this place on a weekend night, but I have had luck with putting my name in and waiting for a table. I would not say this is the best date night spot because it is really loud and there aren't great intimate spots for 2- but for a group or just a quick drink, it is really solid.", "pics": null}}, {"review": {"des": "Ok, the meatball appetizer is good; not having green peppers bad.<br>Apparently, I get Snickers cranky when I get hungry. When I am offered pizza, but am told \"it's not that kind of pizza\" when ordering mushrooms and green peppers, I'm done. <br><br>What kind of weird alternate universe flat bread world am I living in when a pizza cannot be ordered to suit me? The staff was helpful and courteous, but what happened to giving the customer what they want? I do not get it. <br><br>Help me out Yelpers. What is going on with cuisine? I wanted something simple in West Loop on a week night around 9pm. Little Goat - too complicated and pine nutty (hate pine nuts - on anything). Aforementioned pizza; where do I go for an uncomplicated late night bite. Thanks.", "pics": null}}, {"review": {"des": "Went on a Sunday for a recovery brunch with a friend.  Walked in and, shockingly, found two empty seats at the upstairs bar.  Quickly got our drinks and put in our order.  The bartender could tell I was \"struggling,\" so she made me some magical concoction that I promptly downed and I felt a thousand times better.  The food was amazing and the beer was cold, but the bartender really made this brunch a great experience.  If you ever see a short-haired blonde bartender, try to sit near her!<br><br>Had some other friends meet us there, so we ended up moving to a table so we could all sit together and they could order food.  The waiter there really wasn't near as great as the bartender (service was a little slow and we did feel a bit invisible at times), but the food was still legit and the drinks were still cold.<br><br>I'd never have their pizza till this day and I WANT MORE.  I had their basic pep pizza.  Nothing fancy.  But my taste buds were smitten with that tasty pizza.", "pics": null}}, {"review": {"des": "~Vegetarian friendly~<br><br>Brunch with my cousins! <br><br>We sat at the small bar upstairs and were served by Emily, the bartender. Special shoutout to her because her friendliness definitely made our dining experience that much more enjoyable.<br><br>We ordered...mimosas, the Puff Cake, Mushroom & Garlic Pizza, a side waffle potatoes, and toast. We shared everything and it was plenty of food. Everything tasted great too! <br><br>Definitely will be visiting again!", "pics": null}}, {"review": {"des": "Great brunch and an awesome patio!! I came with a friend on a Sunday morning and we split the mimosa kit, which was amazing. They give you peach and raspberry purée and OJ with a bottle of prosecco in a super cute metal kit with ice. <br><br>I got the burrata wedge, while my friend got the breakfast sandwich. We split the waffle hash brown. I wasn't the biggest fan of the dressing on the burrata wedge it looks like semen it is ridiculously thick and gross, but it was my personal preference vs something being wrong with it as long as you enjoy thick dressing. My friend's sandwich and the hash brown waffle were AMAZING. I would order that next time. <br><br>Our server was Jonathan, and he was perfect. He knew when we were talking and to leave us alone, and he knew when it was time to check on us. He made sure we didn't have any allergies when we ordered and explained all of the questions we had. <br><br>My only complaint is that it is too far away from my house in the north!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AzEJ2Pg4z1x0J8Qz4eGYXg/348s.jpg", "caption": "Mimosa Kit!!"}]}}, {"review": {"des": "SALT just excessive use of salt, left me feeling bloated and thirsty. From the supposedly fresh tasting \"hamachi crudo, beef tartar, clams, shrimp and artichoke, pizza, pasta, red snapper, and short rib lasagna\" simply over powering saltiness. One would expect that at a place priced not so modest the chef would be knowledgeable in choosing to flavor the food with spices other than just salt. We told the waitress about it but she just ignored it. Will not be returning. Two stars given for the bad food but good music.", "pics": null}}, {"review": {"des": "Brunch was great! First time here and didn't disappoint. Somehow our party of 6 got lucky enough to not have a reservation or wait. The bloody mary was awesome because of this candy bacon it comes with.  The avocado toast was filling and the eggs were poached perfectly. My friend got the Croque Madame which looked delicious with a little side salad.  I will definitely come back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-229v_PQvTfSH7gUpnz6Ew/348s.jpg", "caption": "Avo toast"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WWo5YFQPFroZtlCBOZzD0Q/168s.jpg", "caption": "Croque madame"}]}}, {"review": {"des": "My friends and I stopped by Bar Sienna for the first time Thursday for lunch. We ended up just sitting by the bar, which actually ended up working out for the best. Bria was our bartender and gave us some really awesome recommendations for food and drinks. Then we ended up splitting the Bombolatto which was amazing. The line was pretty crazy so it was great to just enjoy it from indoors. I'd definitely come back again, she made our experience fun.", "pics": null}}, {"review": {"des": "We've been here for brunch and dinner. I recommend both! The staff is friendly and helpful when going over the menu. For brunch we had the breakfast calzone which was delish. The cocktails are fine but nothing special for $14 a pop (that's West Loop y'all). <br><br>For dinner I've had the gnocchi which was earthy and good. The short rib lasagna is rich but so yummy! And the fig prosciutto pizza was well balanced. <br><br>The bombolinis are yummy. I'm not a dessert person but I really enjoyed these freshly fried donuts :)", "pics": null}}, {"review": {"des": "Great place! I enjoyed the atmosphere and our waitress was very helpful during brunch. I ordered the avocado toast and it was delicious! The champagne deal is fair but definitely not a bottomless deal - essentially you pay for a bottle of champagne and it comes with assorted juices for mixing. Not going to hold the whole *no bottomless brunch* thing against this place though. I'm sure they're just not going for that vibe - understandable. Only reason I gave 4 instead of 5 is because of a lack of vegan/vegetarian options. I was told that there is milk in \"everything\" - so this is definitely a no go for anyone with a dairy allergy or anti-dairy. Definitely a tip to Bar Siena to be a little more open minded with the menu as the anti-dairy vegan/vegetarian movement is on the rise. Otherwise - good food, good service, good drinks.", "pics": null}}, {"review": {"des": "I went here on my birthday because I wanted to try to their dessert bar, Bombo Bar, but not stand outside in the cold waiting for the dessert. They offered me a free bombolini filled with birthday cake frosting, sprinkles and a candle on top!<br><br>My friend and I got a proscuitto and fig pizza. It was good, but not the best pizza I have ever had. It definitely feeds two people. The pieces of prosciutto were big and when I bit into it, I would drag the whole piece of meat off. There was a lot of parmesan dusted on it, too. It was also thought it was a nice touch that when you finished the pizza, the paper served under the pizza said: \"If you're reading this, it's too late\". I love the Drake reference. So bonus points to Bar Siena for that.<br><br>For dessert, I got my birthday donut. It was cute and definitely reminded me of a birthday cake. We also got a peanut butter fudge bombolini and Stracciatella gelato. The peanut butter fudge had a very strong peanut butter taste. I ate it with the gelato on top. It's not my favorite gelato flavor, but I wanted to try something new. <br><br>Our whole waiter/waitress was a little confusing to me. The hostess sat us with the menus. Then another girl came up to take our order. Then another guy came by and would pour us water, ask if we wanted anything else and basically turned into our waiter. It was nice that someone, no matter what, was looking after us. Although, I wonder why there was a change. <br><br>The only thing keeping this place from a 5 is where we were sat. It was next to the kitchen and super drafty from the cold. Also, I felt it was weird that we were sat there when I had a reservation. Almost like even though I planned ahead to book a seat, I still got a seat for someone who was a walk-in and needed to be stuck somewhere. I wish I was brought upstairs at least. Two parties seated before me and they got to go upstairs. <br><br>Overall, I'd still go back since they have many other choices and I didn't get to sit upstairs. The place looked very nicely decorated and I'd like to sit in a place where I can see that.", "pics": null}}]}