{"name": "bari-chicago", "reviews": [{"review": {"des": "Classic old school deli/grocery that begs me to give it five stars, because places like this are fading fast. It still has a lot of charm and exceptional food offerings not to be found elsewhere. <br><br>Italian subs are incredible, and very reasonable priced. They have a nice selection of groceries and frozen/prepared in-store meals that are ready to take home.", "pics": null}}, {"review": {"des": "After almost 700 reviews, I am sure this review won't matter. That number represents a well established fan base and popularity. But I will say what I have to say, regardless of what the crowd is doing.<br><br>\"Well, your problem isn't me talking, your problem is you not listening.\" (from the movie \"Captain Phillips\")<br><br>I was in the west Loop, taking care of some business, so I thought I would give this place a try. I purchased an Italian beef, an Italian sub and some sausages to grill later.The Italian beef was to die for! Great meat. A thicker cut of the meat that I am not accustomed too, but very much appreciated. Very flavorful and the bread was excellent. The Italian sub was the opposite. Tasted good, but the bread almost broke my tooth! That is how hard it was! I thought I could fully love this place. Maybe I can after I tell ya about the sausages. And maybe I can give this place one more star in an update...we will see...", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xo4skVAKd9pdPrgFvA_8JA/168s.jpg", "caption": "Very good Italian beef with hot peppers."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/P_8lEu6W3t6j6AM53RFITg/168s.jpg", "caption": "Italian sub with some very hard bread!"}]}}, {"review": {"des": "Legit Italian deli with the best Italian subs as well as meatball sandwiches. In house made giardinera, fresh ingredients and lots of options to customize each sandwich! Great place to go for lunch! Order ahead on their app because it get very busy around noon. <br>This place also serves as a grocery store where you can find great deals on prosciutto, Italian sausage, olives, ricotta. Definitely try their soups, they change daily!", "pics": null}}, {"review": {"des": "Deliscious, old school Italian deli. I got the Italian sub with mild gardinera. Loved it, highly recommend Bari. They don't skimp on the 12 inch sub.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/d9o6oa050U-4GVSYUXj7NQ/348s.jpg", "caption": "Italian sub"}]}}, {"review": {"des": "So we came here to try their Italian beef. I ordered their 9 inch with hot peppers. I've tread that Bari has one of the best beers in the city. And although it did taste good, definitely not one of the best or even braking top 5. Everything was there. The bread was good, the beef had a good flavor to it, could of used about triple the amount of peppers they put it in. And the same amount for the meat as well. Not enough meat to fill up the sandwich. Bari has to do a lot better than this. <br><br>Now that I've tried their beef, next time I come, I'll stick to their Italian sandwich and meatball sandwich. Those do look very tasty as well.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oSrHrujjkokbZcSQSmftuw/348s.jpg", "caption": "Beef with hot peppers? Needs more meat, where's the peppers?"}]}}, {"review": {"des": "As we were planning our trip south, we planned on picking up some food to go from our favorite city. Who knows what places we would find on our trip, but we KNOW Chicago has some great places! We thought why not pick up some subs to have for lunch instead of stopping at some fast food place. So for this trip we planned to pick up subs at Bari and a place just a few minutes away.<br>The day we stopped at Bari, the traffic was just crazy. There was construction that had a lane closed and what seemed like no place to park. Sometimes being from out of town is a bit of a disadvantage as we are not as familiar with the area. Good thing we did our research and had and idea what we wanted to order and that I have my buddy (wife) to team up with me. <br>So I ended up pulling over to the curb while my wife went in to get our sandwiches. While a lot of their subs looked good, we went with a smoked turkey and oven roasted turkey. My wife gave me the rundown after she came back out. Bari is an old school Italian deli and shop. They also use D'Amatos for bread which would be something new for a guy that grew up with Turano and Gonalla. In addition to their subs there are salads, soup, and a shop with olive oil, sausages, sauce and all sorts of goodies. <br>The subs were really good. This is what a sub should be. We both lamented the fact that there are not any places like this in MN. The bread was fantastic. Solid enough to stand up to the oil and fillings in a sub, yet easy to bite through with a nice chew. They don't skimp on the fillings as their subs are solid. I am a bit more of traditionalist and wasn't sure about the pickles that came with my sub. They added an additional depth of crispness and some brinyness to compliment the savory turkey. We easily finished and enjoyed our subs at lunch. I love little Italian shops and would love to get back to Bari to try some of their other subs as well as to do some shopping. Being a fan of \"Abe Frohman\", I really need to try Barese sausage as this is a sausage that I have not tried. <br>We'll defiantly be back to Bari again!", "pics": null}}, {"review": {"des": "I have probably ordered delivery from Bari dozens of times but can't believe I haven't written a review yet.<br><br>First of all, I love their sandwiches. For the cold sandwiches, the meat is great deli quality. You can customize the sandwich to your liking, including adding or subtracting meats of your choice. One word of advice is that all sandwiches come with lettuce, tomatoes and mayo. I found that out the hard way because I'm not a mayo fan and ended up with mayo on my sandwich because I didn't indicate otherwise. I'll never make that mistake again! My only other criticism is that the bread to meat ratio could use some work. There is almost way too much bread and not enough meat.<br><br>The meatball sandwich is also pretty darn delicious. So far, it has been one of the best ones I have in the city. Though, I save this one for guilty pleasure days.<br><br>If you're feeling sides, their sides are ok. The pasta salad is decent, but is a bit acidic. Their potato salad is nothing extraordinary either, but is serviceable.<br><br>This is a solid go-to lunch option for me when I want a sandwich. An added plus: delivery is quite timely!", "pics": null}}, {"review": {"des": "Call ahead your order to avoid the line. Head straight down the center aisle to pick up your order and directly pass go. Otherwise, expect to wait during peak hours. Simply go down the left aisle to wait in line to place your order. It's not a horrible wait considering that each sandwich is made to order including grabbing new bread to slice (not D'Amatos for years anymore - don't utter that blasphemous name here.)<br><br>I love the old, real Italian store feel from the lined shelves to the no nonsense cashiers. Great products too. My brother loves their giardiniera so much that he brings a jar back home when he visits or I've shipped it to him on occasion.<br><br>My go to order is a 12\" Italian sub with hot for $6.75. They always seem to put the freshest produce on the sandwiches. I usually have to eat it immediately cause I have no patience. However, you'll be rewarded if you wait, with the delicious giardiniera oil permeating the whole sandwich after a few hours.<br><br>I've also been known to switch up my order. Another favorite is the prosciutto de Parma and fresh mozzarella. I haven't ordered anything on focaccia in years so don't know if it's still offered. If it is, it's a great way to invoke memories of muffalettas without the crusty bread..", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hGPwsBS8TeQG6QfqHJkq7w/348s.jpg", "caption": "12\" Italian Sub with Hot. $6.75. Those tomatoes are great. A perfectly balanced sandwich."}]}}, {"review": {"des": "Not really understanding the 5 stars given everywhere on this place- ordered 7 sandwiches for my team- called in for pick up- the person on the phone was very friendly and efficient. <br><br>I got the Italian sandwich for myself- I can't like a place if the bread is not fresh when you're a sandwich shop. I'm reading other reviews and people are commenting on their flaky and soft french bread- but what I got was so hard and crunchy that it was hard to bite into it- I'm wondering if my bread was over baked or if it was too old. If mine was just a fluke then I hope this establishment works on their consistency and make all of their sandwiches with fresh baked bread. The oil and seasoning on the sandwich was overwhelming- and the filling of the meat was minimal- <br><br>I'll stick to Hero's sandwiches on western and addison- never disappoints!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gi6LQ99QbQ3SZVQfVcSK3w/168s.jpg", "caption": "Italian sandwich on their 9 inch bread"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/C8fQE6vDF43Ryid5ct2p7Q/168s.jpg", "caption": "Their prosciutto and cheese sandwich on focaccia bread- HUGE!!"}]}}, {"review": {"des": "So, the subs are decent but we think Graziano's is better. We tried the Italian sub and the Sausage sub.  Good ingredients. The sausage has a bit of bite to it, so do not order if you can't so spicy.  The line and all is a bit chaotic. Definitely do what others have suggested and call the order in first--you'll save a lot of wait time.  Would go with 3.5 stars.<br><br>Did not shop, but the grocery items looked fairly authentic.  Better to shop there for Italian groceries that touristy Eataly :)", "pics": null}}, {"review": {"des": "Bari foods is my go to spot when I have to order lunch for a crowd at work.  Their subs are delicious and they always deliver my order on time and without forgetting anything!  <br><br>Their Italian sub and potato salad are my favorite things on the menu.  The meat is fresh, the bread is crusty and you can order them in 3 ft. sizes or in platters with an assortment of three varieties.  I love that they have online ordering too.", "pics": null}}, {"review": {"des": "The bread was stale. The service was fine and the contents of the sandwich was great.", "pics": null}}, {"review": {"des": "As much as my family and I love Bari, I was embarrassed to recommend them for a staff lunch for my department at work today. One of my managers called and placed the order, which was sandwiches for 18 people. He had mentioned that the woman who took the order was rushing and he had to repeat the credit card information several times. <br><br>We requested delivery by 11:30, and by 12:45 we still had not received our order. He called Bari back, and was told that the delivery driver had been here and left, because he didn't have the correct phone number. The woman on the phone told him that HE had given her the wrong number. (Why would we do that? You're saying that someone who has worked here for 30 years doesn't know his own phone number?) AND the delivery driver was looking for \"312\" and our address is 321...there is no 312. He was here, in front of our building after realizing that there was no 312, yet instead of asking at the front desk for our company and my staff person's name, he left! He left with our order instead of trying to contact anyone! After waiting for so long we called again and gave the phone number and correct address again, and he finally came back. Wow.<br><br>Perhaps the worst of all was that we asked them if they would label each sandwich with each person's name, so we would know whose sandwich was whose. (We order lunches once a month and every other establishment does this for us.) Yet the Bari lady said NO, that they would label them by number, and when passing out the food, we could go in the order that we placed the order. Well guess what. They must not have made the sandwiches in this same order, because they were definitely not in order! Several people didn't get what they ordered and it was sheer chaos. My tuna was good as usual, yet I didn't receive the cheese that I requested, and we didn't get any gardinera, which we had ordered on the side. A number of other things were wrong, so we called again, spoke to someone different (a male this time), and they were coming back with the corrections. <br><br>This was TRULY a disaster, and again, I am embarrassed that I recommended Bari! My husband said I should call myself, since we love Bari, but the damage was done. After all the sorting, the people who go to lunch at 11:30 didn't get their food until almost 1:30!...way past after their lunch was over. At this point everyone couldn't take a late lunch all at the same time, so I doubt if we will order delivery from here again, sadly!", "pics": null}}, {"review": {"des": "A classic Chicago staple. Great go to for italian subs, definitely worth checking out.", "pics": null}}, {"review": {"des": "DO NOT EAT HERE. I just found a spider on my sub, stuck to the piece of bread. Absolutely disgusted and the fact that no one saw this while making it makes it even worse. This place will fail a health inspection in seconds. It should be shut down, health department has already been contacted.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/n3rlKaQTd0ZRctMcfz2q2w/168s.jpg", "caption": "A spider stuck to my sub"}]}}, {"review": {"des": "Their meatball sub was pretty okay. What it lacks in taste it makes up for in quantity - they do not skimp on the inches or the fillings! All in all, I got what I paid for - a 12\" meatball sub that only cost me $7.75.  It's not a place I would go out of my way for, but if I need to grab lunch in the area I wouldn't rule it out. <br><br>Their bread was standard fresh french bread. The meatballs were okay, but a bit on the blander side. The sauce almost made up for the blandness of the meatballs. The cheese was delicious. Put it all together and you get your standard meatball sub.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/G7jA8vCMmPA83Hah8l3MVQ/348s.jpg", "caption": "Meatball sub"}]}}, {"review": {"des": "I can't say anything else more that hasn't already been said, except that when it comes to fresh Italian subs, this place delivers. Great sub, fresh meats, and hella cheap at less than $6 for a 9\" or less than $7.50 for a 12\", either of which probably serve as two meals. They are fast, courteous, and old-school, so you can look around and grab some other stuff from the market in the 3 minutes it takes to make your sandwich. The one thing that slightly detracts is that the bread they use I think could be a bit softer, but for the price, I'll gladly head next door to d'amato's for their bread, and just transplant everything over. I suppose one day I'll try their other sandwiches too, since the meatball, focaccia, and prosciutto + fresh mozzarella look good too, but for now I'm happy eating my spicy Italian for days. 4.5/5", "pics": null}}, {"review": {"des": "I've order Bari for delivery a couple of times. I'm surprised I never reviewed it. The best part about Bari's sandwiches is the bread. I guess you gotta nail the bread if you're going to be a great sandwich place. The bread is great. The one previous time we ordered, I got extra eggplant, extra cheese and the super hot peppers. OK, all of that was way way overload. Way too much cheese, way too much eggplant and the hot peppers were SO hot, we couldn't really eat the sandwiches. Beware of the super hot!! :) <br><br>So last time I toned it all down - not extra anything. I got the regular hot giardinera. It was still pretty darn spicy. I mean, and I can put down some spice. Maybe it's in the eggplant, I don't know. I doubt it, because the eggplant is probably the part that is ruining this sandwich for me. It's kind of like uncooked, slices of eggplant, and it was still too much. I took some of the slices out.<br><br>The delivery and prices were great. Things came on time and all that. I just wish they had some other vegetarian options other than the eggplant option.", "pics": null}}, {"review": {"des": "I have been coming here for the sesame breadsticks for YEARS. Quality has never changed and it remains my fav place for these breadsticks.", "pics": null}}, {"review": {"des": "Hooo-wee! That's some good eats!<br><br>Trip to Chicago meant I had to get all the wonderful things I can't get on the west coast, namely deep dish pizza, giardineira and hot Italian beef sandwiches. I accomplished two of the three here! So glad for the handy yelp app, otherwise never would have found a place like this. <br><br>Ordered a hot beef sandwich, add provolone and hot giardineira. MAAAAN. That's what I'm talking about. So simple yet so good. Bought three jars to take home. Yes it meant I had to check luggage on the plane... but totally worth it!", "pics": null}}, {"review": {"des": "Best meatball subs! Don't usually review places, but I this place definitely needs praising.", "pics": null}}, {"review": {"des": "After going here for over 10 years, this past Saturday my turkey sub had over 18 inches of casing/grizzle that was un-chewable. Luckily I was not in public so I could pull the casing out of each mouth-full. I'm sure they won't miss my $60 in annual purchases as I can get one pound of organic<br>turkey for $10. Vari Vari finished with Bari.", "pics": null}}, {"review": {"des": "Great cold subs. Great hot giardiniera. The bread is what makes it for me. <br><br>D'Amatos next door is also great for a sandwich.", "pics": null}}, {"review": {"des": "I'm an Italian man from a small town in CT with a lot of other Italians in it. If you're looking up Bari, you probably know what I'm talking about (yes, I pronounce Ricotta \"Reegawt\" and I make a mean sausage and peppers...). When I was growing up, one thing we were never short on was those little family owned Italian delis. Seriously, one on every corner! Either that or a pizza place... although most were a mix of the two.<br><br>I've lived in both NYC and Chicago for years and I just could never find a place with that same feel I experienced in my childhood years. For those of you die-hard sub fans, I would visit the South Loop years ago and Panazzo's was the only place that ever came close... real close! I was devastated when they closed down! <br><br>For so long I've been searching for that perfect old-style Italian deli. I've had a craving for Cherry Peppers stuffed with prosciutto and cheese that I just couldn't shake.<br><br>So after a bit of research, today I decided to take an adventure to a short block off the Grand Blue Line that's home to Bari and D'Amato's bakery, true friendly rivals for decades. (I've reviewed D'Amato's too!) <br><br>I'm sure you know Italians are some of the most honest folks out there... so I'm going to give it to you straight: <br><br>Bari, your stuffed cherry peppers are perfection. They are truly a work of art and I will frequent your deli many times over and literally buy them by the pound. I'm so happy I found you for them and can't wait to try your many other homemade or imported delicacies. Sincerely thank you for being one of the only places in Chicago to make and carry these. <br><br>Now to the real kicker. I also ordered a turkey sandwich... which, I'm so sorry to say...was far from enjoyable. If I was rating you guys on the sandwich alone, you'd get 1 star. I had really high hopes and really didn't have extra high expectations, just realistic ones. <br><br>Bari totally has that family-owned Italian deli feel and smell (because it's legit), but apparently the quality just isn't there. I was SO disappointed in that sub. I write this not to diss you, but to sincerely let you know how to improve. So you know, the inside ingredients were actually good (except for the packaged American cheese that I asked the guy to change)... but what the hell happened to the bread!?!? <br><br>What's a matta witchyu!?! <br><br>Everyone knows a good sub (or grinder as we call it out East) is only 30% the ingredients and 70% the bread! Folks, your bread was completely old and stale, hard and chewy. It made the sandwich not enjoyable in the least. FYI - this sentiment is echoed by some other Yelpers, too, just so you all know I'm not crazy. Because of this, I also don't think this was some kind of one time fluke. <br><br>I probably will only return for your peppers and other goods. But, who knows, I might give you all another shot later down the road. Really though, if only the bread was soft, I'd be returning on a weekly basis. <br><br>Anyway, I was slightly prepared for this to be the case, so I picked up another sub next door to do a taste test comparison. I know that's nuts, but I really needed to do this. Well, the results are in and  D'Amato's is by far the winner. Their bread is far superior and the sandwich was everything I had been looking for. <br><br>(Yelpers, please see my review of D'Amato's for reference)", "pics": null}}, {"review": {"des": "Addicting subs. My go to is the capris however I always add turkey. Line can be very long during lunch. I love the mild Italian sausages also. Their pre made meat balls in sauce is always good to take home for dinner. Definitely check out this shop.", "pics": null}}, {"review": {"des": "I probably go here a few times a year (far away) and the only thing that I don't like is that it's so far away and I can never decide between an Italian beef or a Italian sub.  Some of the best sandwiches in the city for sure!", "pics": null}}, {"review": {"des": "Great sausage.  Great sandwiches.  Nice Italian grocery.  What's not to like?  Parking is tough. The bread next door at D'Amato's is slightly better than what they have at Bari.  You could go to Bari, buy all the fixings for your sammie, then go to D'Amato's and buy the bread and it would be the perfect sandwich", "pics": null}}, {"review": {"des": "Small grocery store with a deli counter at the back. The sandwiches here are made to order and all quite cheap considering the amount of the protein they give you. They have 3 sizes: 9 inches, 12 inches, and 3-footer, it's amazing to see those 3-footer sandwiches, it could seriously feed a family for one meal. We got a 9-inch sausage sandwich and a 12-inch meatball for the two of us for Sunday lunch, and we quite stuffed that we didn't even eat dinner, and we are not light eaters on diet either, that's how big their portion is. The sausage and meatball are both marked with family recipe, it is a bit spicy and quite tasty.<br><br>You can buy raw sausage and salami to take home, we got some of the white sausage, it is very good, a bit salty, but very tasty (I guess due to the fat they put in the sausage too).", "pics": null}}, {"review": {"des": "Great sub!  I had the veggie Italian 9 inch.  It's a nice size sandwich and made for 2 meals for me. Pic included is of 1/2 the sandwich.", "pics": null}}, {"review": {"des": "Who doesn't LOVE a 9\" hot Italian? I know I do.  11 years later, writing this review, the sandwiches are just as good as ever!", "pics": null}}, {"review": {"des": "Best subs and cheap<br><br>Old school<br><br>The turkey one and the eggplant parm are good for warm or cold weather <br><br>Good giardienera too", "pics": null}}, {"review": {"des": "A Chicago classic. I usually get an Italian sub. Always get some spicy Italian sausage that I can take home and cook. I think this place is such a classic that they get away with having sub par bread.", "pics": null}}, {"review": {"des": "My office had this place catered and it was one of the worst catered lunches we've ever had. The bread was old and the sandwiches basic. I understand the draw of the old-world Italian grocer, but this place has no business catering. In line with some of the other negative reviewers, I can't help but wonder whether the stellar reviews have been left by those romanticizing days long past.", "pics": null}}, {"review": {"des": "Foods good but the service is terrible!!!<br><br>I stopped going  because it just wasn't worth the headache. <br><br>There could be 2 people in line and the help would  just look at you and continue to do their own thing.<br><br>Good food but I say FUGEDABODIT !!!!!", "pics": null}}, {"review": {"des": "I've been going here for over 30 years. They have the best sub sandwiches. This is a place just for take-out , but worth the trip. It's an Italian grocery store so you can get some shopping done if needed. Call ahead if you know what you want because the wait can get long at lunch time. Parking can sometimes be a little tough.", "pics": null}}, {"review": {"des": "Ordered an Italian sub and garden salad with chicken.<br><br>Nothing on the sub tasted fresh and was difficult to eat. Ended up throwing away 1/3.<br><br>Nothing in the garden salad tasted fresh and the salad had a funky smell to it. Ate about half the salad and threw the other half away.<br><br>Will not be ordering from here again.", "pics": null}}, {"review": {"des": "Looking at all the good reviews in here I decided to give this place a try. I ordered the spicy Italian sandwich..and coming from an experienced chef I don't think this is a great sandwich but just ok nothing wow about it, it is not bad but not great. Nice authentic little shop with good selection of Italian products.", "pics": null}}, {"review": {"des": "Best meatball around. If you can find one better please let me know. These guys have been turning out meatball sandwiches for as long as I can remember and they never disappoint!", "pics": null}}, {"review": {"des": "Came back to Bari today, two years after my first visit.  While it had been too long, it was great to walk to the back and order a 9\" meatball sub this week...damn, this thing was great.<br><br>While the beef I got a couple of years ago was a bit too dry for my liking, the meatball didn't face the same issues.  The meatball blend is fantastic, full of flavor, moist, and with the mozzarella and the filthy amount of marinara on this thing, the 9\" is a complete mess, but I don't even remember eating it because it went down so fast.<br><br>Again, nowhere to sit inside at this space so this is takeout all the way.  My friend also got a 12\" Italian and it was fantastic too.<br><br>Get it!", "pics": null}}, {"review": {"des": "I wish I could give this place 10 stars. Affordable. Clean. The best quality of foods. Helpful and friendly staff. Knowledgeable staff. You get good food, good portion at a good price...hard to come by these days! Best italian beef I've ever had...brought back to others in Peoria who agree. Also purchased meatballs, slaw and meat and rice ball - so good! Can't wait to come back. Big thanks to all here for the great experience!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sXpXdcM395z6T-5xjl7DMA/348s.jpg", "caption": "This is the inside of the \"beef and rice roll\". This is hands down one of the best things I've ever eaten!"}]}}, {"review": {"des": "The greatest place to eat, sandwiches and all sorts of cheeses, salami, etc. Love their olive onion mozzarella salad. Everything is fresh, also store carries so many items on shelves and and freezers that you cannot find elsewhere. <br>Always packed with as many people. <br>Go 4 times a week. Awesome place, you have to try.", "pics": null}}, {"review": {"des": "I ordered a group lunch from Bari and everyone loved it. The chicken soup was great. The tuna, caprese, and Italian subs were all delicious. Very much recommend!", "pics": null}}, {"review": {"des": "Best Italian subs in the city of Chicago. I dare you to try and prove me wrong.", "pics": null}}, {"review": {"des": "Last meal in Chicago and it definitely did not disappoint. <br>Best Italian beef I've ever had!", "pics": null}}, {"review": {"des": "Amazing Italian sub. A friend recommended this unassuming market / sub shop. It was a perfect Italian sub made to my specification with complimentary toppings. The bread is a perfect amount of flakiness and softness.  <br><br>I'm coming back again soon", "pics": null}}, {"review": {"des": "Excellent subs.  We got an Italian and an American.  Both enjoyed thoroughly.", "pics": null}}, {"review": {"des": "If you're in the Chicago area and you're craving an authentic Italian sub, this is the spot! Served on crispy French bread with capicolla, salami, mortadella,provolone cheese, & hot giardiniera peppers, mmm,mmm,mmm,just mouth watering! This is a typical Chicago establishment; a hole in the wall with delicious food. They also have a delicious Italian style tuna salad sub. Unfortunately, I don't get a chance to get out this way that often so I haven't had the opportunity to try any of their other subs.However, after looking at pictures posted by other Yelpers, I can't wait to give them a try because they were making me hungry!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BFYexr1otMqABNWTTAsLKA/348s.jpg", "caption": "The take out menu as of 2016."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0U2qRf0NmagoGcjjGd8T1Q/168s.jpg", "caption": "Not only does Bari's know good food, they know good baseball too! Go Cubbies!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/l6W-IT0FmvQdSqxbeFEhYA/168s.jpg", "caption": "The Menu."}]}}, {"review": {"des": "Bari is one of the most unique places in Chicago. It's a deli and a grocery store rolled into one. Their sandwiches are among the best in the city. Everyone should check this place out at least once.", "pics": null}}, {"review": {"des": "BIG fan of the italian beef and their italian sandwich on Focaccia bread! Large subs are VERY generous and prices can't be beat for the type of quality you're getting. <br><br>The beef is not too thin and is delicious. Their homemade giardiniera pairs very well with the beef. The times i have gotten the beef I didnt request for a dip...i drive about 30 minutes to get home and by that time the bread has soaked up the juices so there's no need! <br><br>The focaccia is great as well. Meats are fresh. Friendly service.<br><br>TIP: hold your ground at the deli counter...people will cut...but karma will get them if so....", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xngE3F5fbKgI7yXvbRGRcg/348s.jpg", "caption": "Italian beef with hots"}]}}, {"review": {"des": "Huge Italian sandwiches on fresh, flaky bread. The Italian beef is juicy and has tons of flavor. I added hot peppers for an extra kick. They're packed with meat and are very reasonably priced. The deli itself is at the back of the shop, and there's only a table top to eat at along the front window. It's a no frills, mom and pop spot that is a gem. For the weekend I was here visiting, this was the best thing I ate - hands down. <br><br>I wish we had time to try out all of the other products, like the gnocchi or marinara sauce, but I'm sure I'll find my way back here the next time I head to Chicago.", "pics": null}}, {"review": {"des": "My friend and I are on a mission to find a better sandwich. So far, at have not found any as good or better. <br><br>Get the Italian with hot peppers, unless you can't take it. Add prosciutto if you're feeling luxurious. <br><br>Add a bag of salt and vinegar chips and you're all set. <br><br>Oh, and call ahead, life 30 minutes. The line gets long.", "pics": null}}, {"review": {"des": "THE best sandviches in Chicago !<br>family owned and operated for yeeears,<br>i am very happy is still around !", "pics": null}}, {"review": {"des": "Just a warning, okay, two warnings.  I've had sandwiches from Bari that were really good.  But last week, not so much.  I recommend two things, 1. ask if the bread is fresh today?  and 2., DON'T ORDER THE CORNED BEEF!!!   Again, I've had good sandwiches here which is why my review is 3 stars and not 1 star.   The bread was dry and crumbled when squeezed or bitten.  Very messy, hard on the gums and simply not fresh.  The Corned Beef reminded me of some sort of processed meat that is packed after being, i don't know, mushed up.  The slices were too thick but the meat, my gosh, horrible.  Corned Beef should be sliced off the entire brisket of Corned Beef, this was more like a deli meat... I can't describe it, but it was horrible.  Additionally, I asked for mustard and it was slathered all over and outside the sandwich.  Messy to eat on the go.   Maybe the guy who took my order and made my sandwich was having a bad day... he was without a smile and definitely disinterested.   But here's the biggest problem... I don't think I'll go back because 1.  Why should I pay to see if it's better the next time and, 2.  I don't accept freebies to improve my reviews..   No pictures..  sorry.  I threw the sandwich away after just two bites.", "pics": null}}, {"review": {"des": "never going back<br>ordered 2 Italian subs, spicy, the bread was really hard and old and the cold cuts did not taste fresh either...terrible subs, go elsewhere", "pics": null}}, {"review": {"des": "Been coming to Bari for a long time, top 3 sandwich shop in the city. They get their bread from next door D'amatos bakery and that bakery has been there for over 50 years. You'll get good service, fast service and the end product is a great sandwich. Their meatball sandwich is phenomenal, you can't go wrong with this place.", "pics": null}}, {"review": {"des": "Excellent subs. Try them. Amazing bread and well made. Potato salad is better than that crap your mom makes. Macaroni salad is better than any mom on the planet makes. But who really needs macaroni salad anyway. Excellent well priced steaks and butchers. Stop being a noob at Jimmy Johns you loser. You ain't in Naperville anymore.", "pics": null}}, {"review": {"des": "One of the all-time great sandwich spots in the city.  The meatball sub with atomic giardiniera alone secures Bari's permanent perch in the top five best sandwiches of Chicago. <br><br>This place gets wicked busy for lunch, with a line from the deli counter to the door. Or so I've heard: my experiences are always at off hours when I can peruse the fancy imported groceries and spend my well earned money.<br><br>In particular, I like their selection of soda and sparkling water, their many kinds of angel wings and ornate Italian cookies, and the homemade pasta and olive salads. Delivery to my apartment in the neighborhood is always hot and fresh!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7aCuyN9xTBHx6a69E7fcjg/348s.jpg", "caption": "Italian sub with olive salad."}]}}, {"review": {"des": "Best Spicy Italian sub in Chicago.<br><br>The extra spicy giardiniera is really spicy and really good.<br><br>The pepper jack cheese actually has a pepper jack taste.<br><br>You taste every part of the sandwich in every bite.<br><br>So good.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wKd3Uu293db8LcHhAk9HZg/348s.jpg", "caption": "Italian"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/T7aJSLWzG90QD5iXpeC-rg/168s.jpg", "caption": "Italian"}]}}, {"review": {"des": "I was looking for fresh burrata mozzarella and figured an Italian grocery store with great ratings would carry it, so I called to ask... first hint that they didn't have fresh should have been the confusion on the phone and being passed to two people to see if they carried it. They said they did... I headed over there to find a prepackaged brand that I've seen in every grocery store... and it was $5.99 for one ball in liquid. I also wanted basil which luckily they did carry, although it looked wilted. I wish I had done more research before driving there. <br><br>I'm sure their take away food is great, but for a grocery store, I wish they had a better selection. I'll try Graziano Grocery next time and hopefully their burrata is superior.", "pics": null}}, {"review": {"des": "No. I  done with you Bari. I've been here twice in as many days to pick up a pound of fish salad. Both times the deli counter was painfully slow, but today's experience has me saying NO MORE! There was a small group of four people in front of me. They placed their order and the gentleman went in back to prepare their sandwiches. Then the owner comes to the deli with his apron in and I am thinking, ready to take my order, but NO... he overheard this crew (clearly from the far western suburbs) talking about how they want to rent a party bus and go around the city eating beef sandwiches. Now, the owner/manager interjects himself into their conversation and starts talking about how they should include Bari on their list of stops. WHY? WHY? No one goes to Bari for a hot dipped beef. Anyhow, this guy thinks these people are food bloggers or some way of getting free publicity so he spends all his time chatting away with them instead of taking my order. So, I am done. I have been coming to Bari since 1998. I'm tired of the terrible customer service of late. Go next door to D'Amatos. Better bread, better sandwiches, and the best customer service!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Z25uDlAk8MGnAZnQ2xw8og/168s.jpg", "caption": "Fish Salad $10.99 per pound with a 1/3 pound of oil."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/idcQWIVpjHcYInR0WoT2Nw/168s.jpg", "caption": "They charge you $10.99 per pound for the fish salad but fill the container with oil. That is probably $3 worth of oil in that cup!"}]}}, {"review": {"des": "This place is about as Chicago Italian as they come and they have some great stuff inside. On this visit during X-Mas week, we came for sandwiches. Wonderful, wonderful Bari sandwiches. <br><br>I cannot get Italian beef sandwiches in LA, where I have lived since 2002, and so that it is what I ordered... excellent. I also bought some of their house-made giardiniera for my suitcase. I haven't tried it yet, but it looks amazing. <br><br>An excellent neighborhood deli.", "pics": null}}, {"review": {"des": "For a neighborhood grocer/deli, they sure do a brisk business around the lunch hour! Although it was a great spot to pick up some grub after a morning at the Shedd, parking was pretty non-existent and we had to park 3 blocks away!  Oh well, we had meatballs on the brain so we had to commit. <br><br>When facing the deli counter, you order at the L side--the line kind of queues that way, there is no number system so just ask the person in front of you if they are in 'the line'. <br><br>I've had the regular Italian sub here and was less than impressed.  There was just something about the bread that seemed \"off\".  Please don't tell me that you served me day old bread, it didn't seem as fresh as I thought Italian bread should be.  The meat?  excellent.  <br><br>We went back to try the hot subs and shared the sausage sub and a meatball sub. Now I felt those were much better than the cold sub. The bread on both sandwiches was so much better. Fresh and chewy soft.  Both the meatball and sausage were flavorful, but I really liked the sausage more--the flavor was bolder and heartier. <br><br>There are tons of different chips to round out your meal, a cooler of their house made sauces (yum!), cheeses, staples like pasta and olive oils, small selection of fresh veggies..lots of items packed in the small store.  Deli guys are abrupt, but the cashier ladies are always kind and chatty.  I love how they dote on my son.", "pics": null}}, {"review": {"des": "Bari is a pretty good although I expected to be a bit more impressed with all the rave reviews. I ordered the Italian sub because that is what you should do.  First, it is a huge sandwich and just over $5. The meat on it was very good and fresh.  The bread I found was just okay and was too much for the sandwich and the sandwich was a bit over dressed.<br><br>The staff was very friendly and helpful. We also took some deli home and a few things from the Italian market.  For a small store they have a decent selection. The deli was very, very good.  It was also pretty cheap for everything we got.", "pics": null}}, {"review": {"des": "First, I do not think I have ever left a negative review. However, in my opinion, this business seems to be operated by a perfect storm combination of incompetent, rude, careless, and unreliable. I feel I need to share my cautionary tale. <br><br> I cannot give a review of Bari's food. Here's why: I called and placed an order. I specifically asked, \"do you deliver to [insert address]?\" The employee confirmed they do deliver to my address. I then ordered and confirmed the order would be delivered within an hour. After an hour passed, I called and spoke with a different employee about the status of our order. That employee confirmed the order had not left yet, but \"it would be there soon.\"  Then, a minute later, another man called and told me their policy does not allow them to deliver to my address. He then told me they refused to deliver the order. Were they even going to call us? I understand that is their policy. However, since it was their error, they should have gone the, literal, extra mile. Instead, they chose to be lazy and rude. The last employee I spoke with said he was sorry. However, the tone of his voice, and failure to correct their error, clearly indicated he could not care less. <br><br>This is an unacceptable way to run a business.  I wish I could leave zero stars. The poor way we were treated by this company must be noted. As a business owner, I would want to know if my employees represented my company in such a sloppy manner. If I did learn of such shoddy treatment of a customer, they would no longer be employees. I hope the owner reads this and is able to rehabilitate his/her image. Until then, I will share my story.", "pics": null}}, {"review": {"des": "I am in love.  This is the dopest Italian grocery shop in the city. <br><br>Bari is no nonsense as all of your Italian cooking needs are laid out before you.<br><br>If you don't want to do any grocery shopping, then you must go to the back and order a meatball sub with a little bit of bresaola on the side. That combination is going to set you free.<br><br>I love this place.", "pics": null}}, {"review": {"des": "If there is a better place in Chicago to get an authentic Italian sandwich I have not found it yet! The bang for your buck is superb considering you spend less here than your average visit to Subway. <br><br>The staff is friendly and glad to give you recommendations on any ways to customize your sandwich. Don't ask for mayo, they'll cringe. I usually opt for one of the cold cut options such as the caprese (add proscuitto) or the classic Italian. The bread is always crisp and the meats are freshly cut. Be sure to add giardiniera to tie it all together!<br><br>One of the best facets of Bari is perusing the aisles while waiting on your sub to be assembled.  If you enjoy cooking your own Italian meals this is the place to stock up on special ingredients that you will not find in your everyday grocery store. They can their aforementioned giardiniera, so if you like what you have on your sandwich be sure to grab a jar. There's also pastas and sauces straight from Italy that are of the utmost quality.<br><br>Next time I visit I hope to delve into their sausages and other meats a little more. They must be popular based on some of the orders I've overheard being placed.", "pics": null}}, {"review": {"des": "One of the best meatball sandwiches I've ever had. Delivery is fast. Their Italian sandwich is also really good.", "pics": null}}, {"review": {"des": "I think this place has a little too much hype, but maybe I've just had too many good Italian sandwiches.<br><br>The sandwich was great, the 9 inch was definitely 9 inches and more than I even needed, and at 5.25, who wouldn't love that price?  However, nothing stood out as exceptional or beyond what I've had before.  <br>Would I go back?  Absolutely.  Would I go out of my way for it?  No.", "pics": null}}, {"review": {"des": "Ordered food for delivery to a nearby office. Used the Yelp app. Placed order about seven hours ahead of time. <br><br>Although I requested the delivery for 3:15pm, I received a call from the delivery guy after that time saying he was on his way over and they would need to charge me more for the 20 ounce bottled sodas as they were out of the cans I ordered. I told him to hurry as my meeting was starting at 3:30, I shouldn't have to pay extra when EAT24 allowed me to order the cans, but we could work it out when the delivery guy arrived. <br><br>He politely came into the meeting at 3:40pm with the food, beverages, and repeated apologies. He couldn't have been nicer. Didn't ask again for the extra money. <br><br>No follow-up or apology from the store. No offer for any type of credit or refund. The food was good but the lateness and request for extra payment just plain wrong.", "pics": null}}, {"review": {"des": "My husband has known this family his whole life, for 56 years he has been buying sandwiches from this store. He just came back with sandwiches today. He related how miserable the owners are and how FRICKING unfriendly they are, even if they know you.<br>Vinny's has been open for a few years, he brought sandwiches from this shop the last time he visited...VERY FRIENDLY PEOPLE. <br>My opinion is that Vinny's sandwich taste better, Vinny's appreciates their customers, Vinny's wants you to come back. <br>From this day forward, after experiencing the reception or lack there of from Bari's we are done with them. An unfriendly business does not deserve the business. <br>Forget about them...go to Vinny's. Where they great you with a smile and very tasty sandwiches.", "pics": null}}, {"review": {"des": "I've been thinking about trying Bari for 6 months since I heard they have the #1 meatball sub in the Chi. My dreams came true yesterday as I devoured a 9-inch meatball. Talk about a Food coma of meatball there must have been 1.5lbs of meatball stuffed in that bread topped with provolone & Mariana. Gd Bless Bari Italian! I will be back to try more subs soon.", "pics": null}}, {"review": {"des": "In my opinion, Bari unequivocally makes the best \"Italian\" sub in the city.  I've been coming here for years, and even though they may not know my real name, they call me \"Chuck Norris\" ( guess they think I look like the old boy ! ! ) Although making a sub sandwich isn't rocket science, a noteworthy version can only be the sum of the freshest and best quality ingredients.  My checklist would include the following.  The bread should have a thin, crispy crust and soft crumb.  The meats & cheeses , lettuce & tomato must be both flavorful and freshly sliced.  And last, but not least, the giardiniera needs just the right amount of crunchy & soft veggies, herbs, and olive oil.  Bari meets all these standards. ( In addition, Bari makes its own giardiniera, and sells it in jars too)   <br><br>Its no wonder the small place is always packed with customers.  Service is always prompt, but at prime time, you might need to wait a few minutes.  Its a small  price to pay for a terrific sub.  From Chicago cops and office workers to Italians from Harlem/Belmont, Brideport, or Elmwood Park, Bari is what the Italian-American sub is all about. <br><br>If you happen to be looking for Italian groceries, they carry an ample selection of oils, canned tomato products,pasta, canned fish, and homemade condiments.  They also have fresh meats , homemade sausages, cheeses , and a wide selection of deli meats/salads.  If you don't enjoy cooking, checkout their prepared pastas and sauces.  (Currently, there are a few parking spaces just 2-3 doors South which are for customers shopping at Bari)", "pics": null}}, {"review": {"des": "Their small ones are 9 inchers. It's impressive. (sandwiches people)<br><br>Seriously, for the same price as what you'd get at a Subway they serve an additional 3 inches of better stuff. Eat your heart out five dollar foot longs. <br><br>Make the meatball your first priority and the Italian second if you ask me. Besides those there's only a few other options to choose from, but everything comes on freshly baked Italian bread and gives you quite a bit of sandwich bang for your buck. <br><br>The staff is old school Italian and every bit as sweet as you'd a think a little mom and pop deli would be. If you haven't been to Bari I'd definitely suggest giving it a bookmark.", "pics": null}}, {"review": {"des": "I was actually sad after I started eating here, because after a few sandwiches, I realized that this place has achieved the coveted Sandwich Nirvana, or Sandvana, as it's come to be called. I've searched near and far for a better Italian sub, but all other attempts at this perfect blend of crusty french roll, fresh spiced Italian meats, tasty cheese, oil and other toppings seem to fall dramatically short of this ineffable Platonic perfect sandwich form. <br><br>Oh, lest we forget their in-house giardiniera. I'm one of those crazy, reckless people that has an ever-smoldering pit of flame in my stomach, and my tastebuds sing in harmonic ecstasy with each daring bite of the Superhot Giardiniera. Seriously, the intensity is in the name, and if you can't handle oil-packed habanero peppers, steer clear and stick with hot or mild (also good, just not as satisfying for heat-seekers like me).<br><br>I have to keep myself from ordering these affordable masterpieces of flavor, a task which at times seems Sisyphean, but seriously, this is a damn good sandwich.", "pics": null}}, {"review": {"des": "This is such a gem - I've always come for the amazing deli sandwiches made fresh in the back - a few weeks back I pre-ordered some to go along with focaccia bread with sandwich ingredients - so good!!  The workers here are all so friendly...what I forget sometimes is they have an amazing meat counter in the back too - so when I was there picking up my sandwiches there was a lady ordering meat for her home made pasta sauce - the meat all looked so fresh and good.  It is a very small shop but they seem to have everything!  Check it out!", "pics": null}}, {"review": {"des": "Amazing Italian beef. The sandwich is huge for the price and they don't skimp on the beef itself. I have heard they can on the giardiniera but I don't like mine loaded to begin with", "pics": null}}, {"review": {"des": "Love this place! Awesome sandwiches and great prices. I recommend the Prosciutto and Fresh Mozzarella sandwich.", "pics": null}}, {"review": {"des": "Best Italian joint in the city.  You get a huge amount of food for what you pay.  <br><br>The three best items (subs) on the menu:<br>-Italian with hot giardiniera<br>-Meatball with provolone and hot giardiniera<br>-Prosciutto and fresh Moz<br><br>There is usually a line, but they work fast.  They have a little grocery area in the front of the store and there is a full deli in the back.  You can get subs, salads, and all kinds of meat.  Their Italian sausage for cooking is excellent too.", "pics": null}}, {"review": {"des": "Great authentic Italian deli! The Pastrami and Mozzarella sub was the bomb! The mozzarella was super fresh and tasted amazing!", "pics": null}}, {"review": {"des": "Bari you broke my heart, you broke my heart!<br><br> If this was the Godfather Bari would have to go. An utter dissapointment. After reading a columnist from Serious Eats claim that Bari's might be the best beef he ever had and Thrillist list it as its #6 beef, I just had to try it...I couldnt wait, even if it wasnt the best beef Ive ever had it would be damn close.<br><br>My first bite chomp chomp, swallow a bit, roll the flavors around. What the.... Roast beefy...A step above Arby's but \"possibly the best beef ive ever had\" really guy from Serious Eats? Is he from California or something?! No flavors were popping in my mouth, nothing dancing...Mr. Beef, those flavors are like a sassy, hot Latina taking over the dance floor in my mouth. Bari's, a middle aged white man trying to jusr stay on his feet...Where is the Oregeno? <br><br>The bread was pretty darn good...But what good is it if the beef sucks...Its like a cool take home box but if you put dog turds in their I really dont want the box now...Get my point!<br><br>To be honest they seem to crank out sandwiches left and right and Ive heard great things about their cold cut subs so I probably will meander back in someday. Its an old school joint that seems to have good quality meat. Therefore I know they can do better, thats why two stars.... Just stay away from their Italian Beef!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eUJrPMSnuJHQVg3DtIXsmA/348s.jpg", "caption": "Beef Sandwich"}]}}, {"review": {"des": "Oh Bari, how I miss you.  What a classic Chicago spot.  I love this place for their subs, browsing the aisles of delightful Italian foodstuffs, and the incredibly strong accents that prevail.  It's at the top of my list anytime I'm back in town.<br><br>It is a great deal, with outstanding food.   The only way it could be improved is to have a couple of tables to eat your sub...I usually end up sitting on the curb outside and making a mess of myself.  Totally worth every drip of oil on my favorite clothes.", "pics": null}}, {"review": {"des": "This is one of my favorite spots in all of Chicago. Classic, fresh Italian subs with a family atmosphere that really makes me feel like I'm back at my local deli back home. The folks that work there are super friendly and it's VERY reasonably priced! <br><br>If you live in Chicago, or just visiting, this is definitely a spot you need to check out. It's located in the West Loop and I drive 20 mins from LP to grab a sub at least twice a month! <br><br>Bari, keep it up. You've officially established yourself as the best Italian deli in the city.", "pics": null}}, {"review": {"des": "Damn good sandwiches. I came on Halloween - I remember exactly because this year the weather was horrible, LSD was getting flooded, and traffic in the city was atrocious from like 2pm to 8pm. What would have been a 35min round trip sandwich run took almost 4 hours. I could have walked that faster.<br><br>I kept asking my friend if the 2 spicy Italians we got were worth such a pilgrimage... But I've gone farther for seemingly less. Even wrapped, they smelled amazing in the car and I devoured a 12inch in minutes when we finally got back. <br><br>A sandwich worth the 3 hours in traffic for sure. The meat is just so quality (and in good quantity) and everything on it is so on point. They are giant sandwiches. I think a smaller 9in would have been plenty and a wiser decision for my belly in the long run. But whatever. Worth it. And that alone is 5-star quality in my book - and I don't say this easily.<br><br>Aside from sandwiches there are aisles of interesting packaged food products to browse through, and a deli counter full of pretty good and sometimes hard to find stuff. Def worth checking out! <br><br>Limites parking around back available, apparently?", "pics": null}}, {"review": {"des": "We had the prosciutto & fresh mozzarella sandwich.  It was made with fresh ingredients and was a really healthy meal & great value.  What we came here for was their barese sausage, which is second to none & unforgettable!", "pics": null}}, {"review": {"des": "Bari - it breaks my heart to say your subs are not as good as they use to be.  The last three times I ordered here, the bread was hard and did not taste fresh.  It had an awful rubbery texture.  The filling is still the best but please get better bread. The subs were out of this world when you used D'Amatos bread but I know you stopped using their bread awhile ago.  Not sure if you recently changed your bread again but it is really bad.  Please find a different bread vendor.  So sad.....", "pics": null}}, {"review": {"des": "After reading all of the fantastic reviews, I ended up disappointed.  I wasn't impressed with the prosciutto and mozzarella sandwich I ordered.  The bread was so thick and crusty it overwhelmed the sandwich, and the mozzarella was so thin you couldn't taste it at all.  The whole thing was on the bland side.  Sadly, I think even Sopraffina's version tastes better (and I can't believe I'm saying that)...", "pics": null}}, {"review": {"des": "Love, love, love Bari's sandwiches!! It's in a small market where you can pick up the sandwiches at the deli. What's even better is the price! The sandwiches are such great quality and fresh ingredients with a low price. <br><br>We got the Italian sub and prosciutto with mozzarella. I couldn't decide which sandwich I liked more and kept taking bites of both. The Italian had a good amount of meat and I loved the spicy peppers. The prosciutto with mozzarella was also delicious, although I wished it had as much filling as the Italian. Either way, yum.... <br><br>Verdict: I want to go back and try all the sandwiches that are available. Grab a bag of chips and a drink in the market on your way out! You can also get one of their great sides.", "pics": null}}, {"review": {"des": "Best Italian sub around. great prices", "pics": null}}, {"review": {"des": "The sandwiches here are to die for. Really nice quality of meats and cheeses and the bread is fresh. I  Bari!", "pics": null}}, {"review": {"des": "If you are looking for the best Italian Sub in Chicago then this is the place hands down.  I have been coming here for such a long time that I can not even remember my first sandwich here.  In fact, if you did a blood test you might find there homemade hot giardiniera in my veins.  Yes it is that good and there is always a jar in my fridge.<br><br>Near the deli counter you will see a shelf of homemade items from Bari.  It does not get any better then that.  You will see several kinds of giardiniera on the shelf...mild, medium, hot, super hot, super super super hot!  I usually buy the Super Super Super Hot as gifts for my friends, that tell me they can handle anything hot.  Most of them still have the jar sitting in there fridge and only use the oil for cooking because just opening the jar makes them cry.  Also on the shelf is sun-dried tomatoes and various other things too.<br><br>The deli counter is amazing.  All of the sliced deli meats are so fresh because of the high turnover.  You never have to worry because the sandwiches fly off the counter here.  At lunch time people will wait in line, while a full crew works to bang out sandwiches.  I always like to plan ahead and call my order in and I advise you to do the same.  So when you walk in you can bypass the long line up the left aisle and proceed directly to the middle aisle all the way to the front and wait for one of the guys to say, \"Okay who has a phone order?\"  Then you yell out your name and the guy comes back with your yummy sandwich all wrapped in white deli paper.<br><br>I also highly recommend the meat counter here too.  They will cut meat for you as requested and grind different cuts if you want to create burgers or meatballs.  Yes a real butcher shop.  My favorite thing behind the meat counter is there homemade sausage...they have 3 different kinds to choose from.  My favorite is the Barese sausage which is a very small sausage that packs a lot of flavor.  I usually use it to make my famous sausage and peppers and all of my guests rave about how good it is. Yes this sausage makes me look like a rock star celebrity chef.<br><br>They also have everything you would need for a party too...homemade roasted red peppers, olives, olive salads.  If you also check the fridges you will see Bari's homemade sauces too.  I have never bought one of these because being Sicilian I make my own sauce and they would take away my Italian Membership Card, if I did ever buy one.  I have talked to others and they have told me that the sauces are really good.  They also supply freshly made pasta here too from another local company.<br><br>So this place is more then just sandwiches.  It has everything you could need and I love having this place nearby.  The sandwiches here are amazing.  My favorite is the Italian with Hot giardiniera.  They get the bread fresh from D'matos next door.  Sometimes I think it is the bread that just makes this the most delicious sandwich ever but once you taste the cut meat with the mixture of there giardiniera you will understand why I love this place.  But they also have other sandwiches too available here and they are just as good.  I usually always will add the hot giardiniera to every sandwich I buy.  Yes I am very addicted to it.  In fact, I graduated to the hot stuff over time.  Many years ago I use to only get the mild but now I need the hot stuff on my sub.<br><br>I also must give a shout out to the owners and the staff here...they feel like family.  The owners and staff always say hi to us even if we see them on the street or at another location away from the store.  Sometimes I think...maybe I do go here too much but I also think I am not the only one that knows how good this place is.<br><br>If you have not tried one, then I recommend you stop in for one.  We have taken these subs every where from hitting the lakefront, to Bears games, fireworks at the Pier, the zoo and even airplane trips.  The farthest I think the sandwich ever made it was somewhere over the Atlantic...our flying neighbors were a little jealous of our yummy eats!!!<br><br>Bari's is unique...so many businesses in the neighborhood have popped up over the years and have tried to copy a Bari Sub but there is nothing like an original.   This place makes me excited because I know it is going to be so good and Bari's has never lets me down.  Okay just typing this review has made me hungry I think I need to walk down and grab one for myself now.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dMVQdKNjpv2dccM_74y5wA/348s.jpg", "caption": "The Hot Giardinera Italian Sub is the best in the city!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4Szoj0tJF4IWTKKkjs932w/168s.jpg", "caption": "The best sausage!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YNK1Z1hzBR3iNWpxk84h1A/168s.jpg", "caption": "The best sausage!"}]}}, {"review": {"des": "I'll keep this nice and simple... Bari subs are a gem in Chicago and despite some recent price increases still an absolute bargain.<br><br>You can get a delicious and authentic sub made from truly quality ingredients on freshly baked bread for the same general price as a junky chain like Jimmy John's... why would you even debate this choice?<br><br>Walk to the back of the store to the butcher counter. There you will be greeted by a platoon of guys working diligently to make subs for what is often a sizeable line at lunchtime. Go for the traditional Italian first but also try to mix it up with a custom order using the Italian meats they have or try a house made sausage. Don't bother with generic stuff like turkey; Bari shines with the authentic Italian meats.<br><br>When you are done stop by D'Amato's next door and grab some cookies... this is among the best lunches you can have in the city and it will cost you well under 10 bucks all in. you really can't beat it.", "pics": null}}, {"review": {"des": "For those that only know Bari via grubhub / delivery, make a point of stopping in and experiencing what it means to actually Bari. If you go during lunch, expect a (worthwhile) wait. Or go as a pro, and pop in post 1pm.<br><br>In addition to the obviously glorious sandwiches, Bari offers some amazing basic Italian grocery imports. While there is no produce, there is some UHmazing cured meats in the deli case, as well as some REALLY good looking sausages and steaks. <br><br>There is also, and this is important, sauced up pasta dishes ready to take home and reheat. In addition, you can buy quarts of marinara (aka gravy) with or without meat and or meatballs. Buy some, take home, and instantly turn your kitchen into an EYEtalian kitchen. Perfection!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_BLLHdVBfNvvGpZKHEhmbQ/348s.jpg", "caption": "Organized chaos"}]}}, {"review": {"des": "I used to live in Hoboken and became rather spoiled by the Italian delis. I'm a sucker for fresh mutz and good bread. After reading the reviews on Bari, I had to give it a try to see how it stacked up compared to the East Coast competition. I got the Prosciutto and Fresh Mozzarella. On the whole, it was good, but not outstanding: the bread was crusty, but the fillings were limited (really kind of light on the mutz and the prosciutto). Although there was Italian seasoning and oil, I found the taste somewhat bland. I think balsamic would make for a nice addition here.<br><br>Delivery is quick though there is a $3 charge.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eeQQ3yiYaWgGQLoIVisoXQ/348s.jpg", "caption": "Mozzarella and prosciutto sub"}]}}, {"review": {"des": "What a great old school Italian grocery store. Bari has delicious subs that are large in size and affordable. This almost reminds me of a place where Tony Soprano would come for some great gabagool. <br><br>I usually either get the 12 inch Italian or Meatball sub. One thing to note is their bread is flaky and a little tougher than your normal soft sub bread. I prefer it this way, but I can see how some people would not like the texture if they are used to soft bread. <br><br>One word of advice is to call-in ahead of time to place your order. If you go on the weekends you could be waiting in line for 20 minutes or more compared to walking in and getting your sub right away. <br><br>I haven't purchased too many grocery items since the subs are so delicious, but I will soon. Oh yeah and they deliver too! I want to go pick a sub now! Keep up the prices and the quality Bari!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/s9XX9zg0aB2arbAIb6DjXw/348s.jpg", "caption": "Delicious 12 inch Italian sub with Hot Giardiniera."}]}}, {"review": {"des": "Solid local deli that does the classics well. Generous portions and friendly service too. Great neighborhood spot.", "pics": null}}, {"review": {"des": "Great li'l Italian grocery and deli. I like stopping in here on my way home from work to grab some unique Italian noodles to cook for dinner. Store has a lot of unique Italian cooking ingredients, a testament to the neighborhood's former residents, and nice deli counter. <br><br>Pop by Tony's next door for a slice, and some of the best canoli in the city.", "pics": null}}, {"review": {"des": "I have had this twice by delivery. I've had the Italian sausage and the meatballs sandwiches. Both were good but I've had better! It does hit the spot, especially in an otherwise barren land for good delivery food at a decent price and time for delivery.<br><br>I wish they had more bread options when ordering. Also, I want to see a cheesesteak on this menu! Might as well!<br><br>Good stuff though.", "pics": null}}, {"review": {"des": "The Italian sub from Bari may be the best I've ever had! Bari is definitely my preferred sandwich joint in the area! The prosciutto and mozzarella sub was also very tasty! Will definitely be offering from Bari again!!", "pics": null}}, {"review": {"des": "They jacked up their prices last week when they got a new sign. They incorrectly charged me for a sub. It says on the menu- roast beef and cheese-$6.75. They proceeded to charge me an extra $.75 for cheese even though it's supposed to be included. I've been going here for 7 years, and I always thought it was good for the price. Now it's not worth the price at all! Try a much better sub place on Taylor St.- <br>Conte di Savoia. Better quality meat, much better bread, and an overall better experience in regards to interacting with the workers. Bari has rude workers with a bad attitude. Also, there's now real order to the place, lunchtime is chaos, and frustratingly stupid. Avoid this place at all costs.", "pics": null}}, {"review": {"des": "Great sandwiches all made fresh while you wait. The smallest sandwich measures up at nine inches. You can't go wrong with the turkey. Others rave about the tuna sub. Bari is also a small retail store where you can purchase pasta, sauces, cheese, and bread. Some workers are miserable. Others are super friendly. Parking can be difficult. Wait time on sandwiches can be a little long. Phone orders are accepted.", "pics": null}}]}