{"name": "batter-and-berries-chicago", "reviews": [{"review": {"des": "Do you know that homesick feeling where you miss a home cooked meal from mom, dad, grandma used to make? Batter & Berries is my cure to that. <br><br>I love coming here for my birthday brunch since it may be my favorite restaurant in the area. You're warmly greeted by someone at the front desk and there's typically a wait. <br><br>Once you're seated, you're greeted by the friendliest staff. You look around and you just know you're welcomed, and it feels like home. Because this is a family operated biz, don't be surprised if the owner comes to your table and begins chatting you up. <br><br>I like to order a pitcher of orange juice to go along with my champagne, since this place is BYOB! Their  French toast flight is a must try, no matter what you're ordering. Order it and split it with your table, it's must. The flights are rotating based on ingredients of the season but one thing they all have in common is their made to perfection and it's always a good balance of flavor and not too sweet. Make sure you try the cheesy hashbrowns and their chicken patty if you're looking for side options to your meal.", "pics": null}}, {"review": {"des": "My friend and I put this place on our must-eat list for Chicago because of the amount of reviews it had, and boy were we not disappointed. <br><br>It's popular, so there is definitely going to be a wait. We were seated at a long table with others, which helped us get seated faster, just made for some awkward interactions with others :) <br><br>I ordered the sweet potato waffles stuffed with chicken, which CAME WITH A FRIGGIN SIDE OF FRIED CHICKEN TOO and maple butter - definitely get the maple butter. I usually have a tiny stomach so I'm flippin amazed I finished even half of this dish. The sweet potato waffle was definitely dense, and the chicken in the waffle is more located towards the center, but at least they give you a generous side of fried chicken to go with it. <br><br>Friend and I walked the whole way back down to Mag Mile (trust me, you need that walk after getting brunch here) and we were still full after an hour of walking.", "pics": null}}, {"review": {"des": "This restaurant is probably one of the best brunch spots I've had in my life.<br><br>Food -<br><br>I ordered the shrimp omelette. It was so delicious. I'm not even an omelette person but my friend hyped it up so much that I had to try. No regrets. We also got the french toast flight. Every single toast was so GOOD. My personal favorite was the blueberry. I think our waiter said it was the butter that made everything delicious? <br><br>Service - <br><br>So I arrived at the restaurant first before my two other friends. The main guy was so flexible about waiting for my friends. He did not get angry or anything, and even when the last girl came an hr late, he was not annoyed about it all. Despite everyone being late, we were seated as soon as the last person came. :-)<br><br>Overall, I will be coming back here next time I'm in town! <br>Pro-tip: BYOB!! (Champagne, wine, no hard liquor of course lol)", "pics": null}}, {"review": {"des": "I was amazed to see how busy this place was on a weekday. They take reservations until up to 3pm which is closing time. I highly suggest to come 25 minutes before they close to avoid a long wait. Otherwise the wait moves quite fast and there is a waiting area inside at the back of the restaurant. <br>The French toast was good and the waffle just ok.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uWMfeGkT-8rv025jaE7FPQ/168s.jpg", "caption": "Half flight French toast"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CYDrPcRrE7C9XjMJG5vYvw/168s.jpg", "caption": "Banana waffle"}]}}, {"review": {"des": "Three stars is being really, really generous. I've always had great service, so I decided to tack on an extra star. The food however is mediocre. .. at best. <br><br>Even the signature French Toast is disappointing. I'm struggling to write this review because I don't want to crush this family business, but I've held off for years hoping the food would improve and it hasn't. I'm just going to stop here before I talk myself into a two star review.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Mm-5IC2KCB6n5EYJtjnvrg/348s.jpg", "caption": "Super French Toast Flight"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5BZdSEgshzUrf962fp9asw/168s.jpg", "caption": "Chicken & Sweet Potato Waffle"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6BvRH6Vv1Va5JlwXuKAqqQ/168s.jpg", "caption": "Duck Breast Polenta w/ Mushrooms, Onion & Fried Egg"}]}}, {"review": {"des": "Waited for an hour to eat at Batter & Berries and it was well worth it! Although the space is small with a simple design, the atmosphere was amazing! The service was incredible once we were seated. Our waiter was hilarious and very accommodating and made some excellent menu suggestions. I had the Lemon Pepper Lobster Omelette and it was as amazing as it sounds. Everything about the dish was amazing, everything was fresh and it was soooo flavorful! The Cheesy Hash Browns were amazing as well, must have. If you are in the Chicago area you MUST stop by and give this place a try, you won't be disappointed.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0W32Y9YoDVlFlG5wESuUTw/168s.jpg", "caption": "Cheesy Hash Browns."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/S3zwaTmp_Pqx4c1uyJBNwg/168s.jpg", "caption": "Lemon Pepper Lobster Omelette."}]}}, {"review": {"des": "Batter & Berries has been around since '12, and offers various French Toasts, omelettes, breakfast plates, wraps, sandwiches, burgers, and drinks.<br><br>We came as a group, and we ordered the following: their famous French Toast Flight (a sampling of all their French Toasts (Blueberry, Strawberry, Lemon, and Caramel; these were all pretty tasty, as the batter was perfect, had the right amount of sweetness, and the fresh fruit and the caramel sauces were divine!); \"We're Movin On Up\" Executive (Linz Heritage Angus rib eye steak, grilled onions, mushrooms, cabernet sauce, 2 eggs cooked-to-order, and B&B cheese crusted hash browns; the steak was cooked perfectly, but it was just way too salty (even for me!); the hash browns were cheesy, but I felt as if this needed more seasoning, and it was better with the ketchup and the hot sauce); Cluck & Gravy (handmade buttermilk & herb biscuits, B&B housemade chicken sausage gravy, and an egg cooked-to-order; the biscuits were slightly dry, but the gravy and the biscuit combo was pretty delicious!  You can definitely taste the herbs, and the gravy had a nice thick creamy consistency); an Apple Waffle (had a great apple and cinnamon taste to it, and came out nice and crispy); and, The Traditional (comes with 2 eggs, B&B cheese crusted hash browns, and your choice of protein (bacon, ham, or portabella mushrooms).<br><br>Service was super friendly, welcoming, but a bit forgetful; even though you get on a waitlist and notifications come via the text, there was some confusion in regards to the estimated wait time.  We also waited on a missing cappuccino, in which we had to remind a couple of times.<br><br>The place does get jam-packed, and it's first-come, first-serve.  Most people choose to wait outside, but there are some benches in the middle of the restaurant in which you can wait.<br><br>I'm glad I was able to check out B&B and would be interested in checking out their lunch items the next time!<br><br>+yummy French Toasts<br>+Cluck & Gravy<br>+friendly staff<br>+forgetful orders<br>+metered parking off of Lincoln", "pics": null}}, {"review": {"des": "Tusline was our server and regaled us with riddles. We loved it!<br>The Veggie Omelet made with egg whites instead of whole eggs was delicious!<br>Cluck-n-<br>Coffee is very good, a Columbe Louisiana blend.<br>Hostess is very organized, warm,  welcoming, and efficient.<br>BYOB limited to Champagne, wine, beer.", "pics": null}}, {"review": {"des": "Note: they do NOT take reservations, which is wildly inconvenient. (-1 star). <br><br>Nonetheless - I love batter batteries, I've been here over 10 times and it does NOT disappoint. <br><br>FOOD: <br>From the basic breakfast (eggs, bacon, side) to French toast flight to jambalaya omelets (special) to shrimp omelets (special) to ox-tails (special) to the chicken and waffles (chicken in the waffles too!!) to egg benedicts... everything is OUTSTANDING. <br><br>SERVICE: <br>The service is great and the food literally never disappoints. I love how they show you pics of their specials on an iPad when going over them. So nice to see! <br><br>BYOB: <br>Bring your own champagne and they will provide the juice! This is what we usually do - great option. <br><br>TO-GO ORDERS? <br>They do not take to-go orders over the phone, but they do to go orders if you go in and order and wait. <br><br>WAIT: <br>On average for a wait for 4 on the weekends it is typically 45min-1 hr. However for a table of 6 I've waited over 2 hrs. <br><br>The earlier you go ~7/8 AM, the shorter the wait. For 9 people we went at 8:30AM and the wait was 25 minutes. It's honestly hard to tell what exactly the wait will be , just be ready to wait.<br><br>A lot of people are forced to wait in their cars because the restaurant really isn't very large and the waiting area only consist of 2 benches - FYI", "pics": null}}, {"review": {"des": "This is a great spot for anytime but definitely for the winter. I came here on a Monday around 2pm and our wait was about 20 mins for 4. It was my first time there so the server was patient in explaining the menu and specials and recommendations. <br><br>I got the chicken and waffles and they were good, there are large pieces of chicken in the waffles!   There are a variety of syrups available and even right \"pairings\" for waffles. I'd say it was a good spot when you're in the mood for chicken and waffles. <br><br>My friend got the sampler and loved it. So if I were to come again, I'd definitely have the sampler. Overall its a solid place, the space is good for larger groups and I'd go back if I had a craving.", "pics": null}}, {"review": {"des": "A co-worker recommended this place to eat as three of us had just landed for a work trip and we were starving!  The place is small and packed however that is an ultimate clue that the food is going to be spectacular!<br><br>The menu was overwhelming and when the waiter explained to us the menu, from memory I may add, I was stuck on what to actually order. The plates comes to the tables around us had my taste buds in a frenzy as I wanted everything. I decided on a sandwich, however my counterpart got the shrimp  omelette and I was immediately saddened at my choice. My choice was fantastic and the fries were insanely delicious, however the size of the shrimp was something to behold. It looked so good! Everything looked amazing. I will definitely go back to sample other menu items as it is a must for m Lt conscious and my belly. I want more.", "pics": null}}, {"review": {"des": "I've been hearing great things lately (wink, wink) thought I'd see what the hype was. Well let me tell you, all the hype still leaves B&B underrated. When I tell you it was good, I mean it was good. I had chicken and Blueberry French Toast. I put the house hot sauce on the chicken and the mingling of sweetness from blueberries and the spiciness from the sauce WOW! I shall return. Yessah Lawdy!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/to6UmXEEVjxTvJjmvoMRMg/168s.jpg", "caption": "Blueberry French Toast"}]}}, {"review": {"des": "So this was a long time coming. A former coworker of mine told me about this spot about 4 years ago. Been meaning to try it since but since I don't currently live in the city (I'm in the burbs), I haven't had the \"excuse\" venture down here & try it. However this morning, en route to michigan for a weekend trip, figured let's do it!<br><br>The wait wasn't long for us as many have had to experience because of it being a Friday morning but it was PACKED in the which was a good sign! Our waiter was friendly and suggestive and the food took a reasonable amount of time.<br><br>Both my wife and I got seasonal dishes. She got the Chipotle Shrimp Omelet which she claims was really good & spicy and I got the Crab Cake Benedict. The Crab Cake Benedict was amazing. The eggs were cooked perfectly and seasoned well and the crab cake was fresh and moist. The hash browns were really good as well.<br><br>I also got a half order of the reese's French toast. It tasted great and had rich flavor. I thoroughly enjoyed it but it was very rich in sweetness so I can't imagine having a full order of it, the half was perfect!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CP13QML1SOl_M8PfNuFnWA/348s.jpg", "caption": "Crab Cake Benedict"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BNch9ZRnVQaEah8MLzmZVA/168s.jpg", "caption": "Reese's French Toast"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VG9Eyar2X3xjXmJPCN6u6A/168s.jpg", "caption": "Chipotle Shrimp Omelet"}]}}, {"review": {"des": "I finally had a Sunday off and what do I do? I get up on my day off work to come here in hopes that no one else would have the same idea. When we arrived at 8:15am, the place was packed already with only two tables open, luckily we didn't have to wait long to be seated, but we had to wait a long time for our food - maybe 30+ minutes. Two women who sat down 20 minutes after us ordered and received their food before us, we were told it was because they ordered the flight and waffles. My five year old wasn't happy about that because he was getting hungry! Our order didn't seem too complicated to me (chocolate chip pancakes, scrambled eggs, cheesy hash browns and ham, and super flight) but what do I know? <br><br>Anyways...I've been craving to take my five year old here since I went the first time with a friend. I couldn't believe how tasty all of the food was... both times and how attentive the service was! Did not order the same thing :). My son says his pancakes were really good. He even enjoyed my cheesy hash browns and scrambled eggs. I'm not a fan of hot sauce usually, but decided to dip my hash brown in it and wow! It's my new favorite pair. <br><br>The restaurant is kind of small, can get crowded and it's very noisy - it's hard to have conversations or hear the server at times. When we were leaving, we noticed people standing outside, which tells me they were waiting to eat also so I'm guessing there is a wait at times. <br><br>There's paid parking in front of the restaurant and there's also free parking on side streets. Very easy to find.", "pics": null}}, {"review": {"des": "Argh... this is one of my favorite brunch places!!! The frustration is that I don't live in Chicago, so it will be a long long time before I can visit this wonderful place again. <br><br>I came here on a Tuesday and the restaurant was bustling. There was no wait, but it was full. The waiter had so much energy that it was contagious (I hadn't had coffee yet). Each time our waiter came to our table, he presented us with a riddle and it was pretty fun to get our brains thinking. <br><br>Now on to the food... The lemon pepper lobster omelet was delicious. It was about $19 of pure heaven. There were big chunks of lobster, with asparagus, bell peppers, and creamy sauce. It also came with cheesy hash browns. The hash browns had potential, but it was stale and not fresh. My boyfriend got the rib eye steak omelet and I thought it was good, but something that other brunch places also had. We shared an order of their peaches and cream french toast, a rotating flavor. It was one of the best french toasts I've ever had. I didn't need any syrup and I wanted to have a second stomach in order to eat another order. <br><br>This place is a high recommend.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/erAyDJhADgtbZGwhmZttmA/168s.jpg", "caption": "Rib eye steak omelette"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BOGwXkK64ZbyszvFTQ0lrQ/168s.jpg", "caption": "Lemon pepper lobster omelette"}]}}, {"review": {"des": "Finally tried Batter & Berries over the summer on a very rainy Saturday morning. We always drive by this place and see a crowd waiting outside to eat and wanted to check out the hype. They seat you only when everyone is present. Hubby dropped me off to park so when I checked in there was 1 table for 3 remaining and the hostess said it's on a first come first serve basis once your party in complete. There is a small waiting area in the back between a few of the tables which is nice when the weather is bad. Thankfully Hubby arrived shortly after so we got that table. It was around 9:30am and the line already started building up after we were seated.<br><br>Our server was a nice man but served the two adjacent tables at the same time (announcing specials and telling jokes to both tables) so it felt like we were having brunch with 4 additional strangers. The jokes were really bad corny \"dad\" jokes but everyone was a good sport and forced a chuckle. Hubby likes to call this place Batter, Berries, and Bad Jokes.<br><br>Food was okay. I tried the famous French a Toast Flight (Strawberry, Blueberry, Lemon, and Caramel) and added the featured French toast of the day for a little extra. Each flavor was okay but the bread is a thinner slice than I'm used too so it gets soggy quickly. Hubby tried the Cluck and Gravy which was both our favorites of the two dishes. Reminded me of my Carolina roots. Just the right amount of saltiness.<br><br>Overall glad we had a chance to visit and thankful the wait wasn't so bad that time.", "pics": null}}, {"review": {"des": "Wow! This is an absolute must-go if you're in the Chicago area and you want brunch! The French toast is the best around and you can even get a flight! Constantly changing menus are a plus as you get a chance to try something different every time. Their is no shortage on flavor or value when you come here.<br><br>The French toast flight was ordered by my friend and he absolutely loved it. I got the shrimp wrap which was stuffed with extra large gulf shrimp and special remoulade. The house hot sauce was spicy but balanced and the garlic herb fries were crispy and hefty. And I should recommend the cheesy hash browns which were a favorite of the tables.<br><br>I couldn't have been happier with my experience here. I'm looking forward to stopping in again the next time I visit.", "pics": null}}, {"review": {"des": "I came here with a group of 6 on a Saturday. We had someone come in to put our name in since we knew the wait was long, it ended up being an hour and a half (11:30 am seating time). However, when we left at 1pm tables were open and there wasn't a line outside the door, so maybe try your luck at going at 1 or later since it is worth trying, especially if you don't want to wait or don't live nearby to put your name on the list. <br><br>The French toast flight was a must try for me and it lived up to the hype. I would highly recommend, especially since their name is batter and berries! The flight is perfect to share between 2-3 people as an appetizer or for one as a meal. <br><br>They also have a lot of seafood egg dishes as their specials, such as a lobster omelet. I like their unique special offerings! They seem to do it well based on what my friends have told me.<br><br>I split the chicken fajita omelet with my husband. It was the perfect portion size for one with plenty of leftovers. The meat was cooked perfectly, there were strips of chicken, onions and peppers on top of a cheese omelet. The meat quality was great, I'm very picky when it comes to meat so I can confidently write this. Most of their dishes, including this one, comes with a side of their cheesy hash browns. I'm picky when it comes to my breakfast potatoes, as in they must be the shredded kind, so I was thrilled, that their side dish is a cheesy shredded hashbrowns. We also split the chicken and waffles, note these are sweet potato waffles which makes the dish unique! I liked the spin on the dish!<br><br>Our server was super fun and full of energy. He did an excellent job explaining each dish he maid me want to try everything! They like to tell riddles while you are waiting for your meals which was funny!<br><br>My only complaint was that although food was flying out of the kitchen it took over an hour since we ordered to receive our food. I appreciate that they make it fresh and I know they are busy but after waiting an hour and a half to get into the restaurant plus an hour after ordering the wait was killing me! <br><br>Friendly service, unique offerings, great food quality! This restaurant is highly worth checking out! I would do a late lunch for faster service and shorter wait time!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/E_aTAnvRzhr4G1XZZs9egA/348s.jpg", "caption": "Super French toast flight - great"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tqP3I9c0whNCRAy7cT65Kw/168s.jpg", "caption": "Chicken fajita omelet and cheesy hash browns"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/z5coJGg7LCGh2pRUWNmwXQ/168s.jpg", "caption": "Chicken and waffles (sweet potato waffles) - good"}]}}, {"review": {"des": "I have to preface this review by stating that I am NOT a breakfast person, but this was damn good! I'd been hearing for years that I needed to try this place the next time I was in Chicago, but I kept putting it off. My mom and I decided to dine here after we ran the BIG10 5k race. By the time we arrived, the wait time was already 75 mins! However, because I'm not a Chicago resident, I didn't mind as it gave me time to explore the surrounding area. <br><br>This place is BYOB so as soon as we were seated, the waitress brought us an ice bucket for my prosecco. While it's BYOB, you have to buy juice from the restaurant. For my meal, I ordered the caramel French toast, a side of pork sausage, and a side of hash browns, and my mom ordered the Cluck N Gaufe (chicken and waffles). <br><br>This was probably the best French toast I've ever had! It wasn't eggy at ALL, and was perfectly sweet and light. The sausage was a *little* dry and could've benefited from a little more fat being used in the homemade sausage mix, but still edible-- not a dealbreaker. The hash browns were also good and cheesy. The chicken and waffles was unlike anything I've ever had before. The sweet potato waffle was very savory, and the chicken was fried perfectly and slathered in hot sauce. <br><br>Dare I say I loved a breakfast food establishment?!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JRgefZczqdfvlloPQKW2lw/168s.jpg", "caption": "Cluck N Gaufre"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/e5_nwkwhEAsCGyBxsVqC1g/168s.jpg", "caption": "Caramel French Toast"}]}}, {"review": {"des": "3.25/5<br>Came by on a Friday morning for breakfast because my friend is all about sweet breakfast foods so we had to fulfill her wishes (disclaimer: I am a savory breakfast person for the most part). Walked in around 9:30am and the wait was almost an hour long. Not sure it'd be worth it but with the crowd I also needed to see what all the hype was about!<br><br>Waited it out and eventually got seated. We ordered the following:<br>1) French Toast Flight: Friend's dish. I sampled a piece of the key lime French toast which did somewhat resemble Key Lime Pie though a bit artificial tasting. Toast had a nice custard-like texture and wasn't too sweet. I also liked that a flight was even an option (3.75/5)<br><br>2) Sweet potato waffle w/ fried chicken: The chicken was pretty tasty. Batter had some solid seasoning and a thin crunch. It was topped w/ a nice vinegary hot sauce that I really enjoyed though it didn't go super well with the waffle. Inside of the chicken was moist but could've used more flavor. Sweet potato waffle was alright. I usually prefer waffles to pancakes since the extra service area means extra crispiness but it was more dry than crispy. The sweet potatoes flavor also didn't come out much. There were bits of chicken embedded in the waffle though I think I would've preferred pieces of soft creamy sweet potato embedded in there instead since the tiny chicken bits just sort of messed with the texture (3.25/5)<br><br>Overall, Batter & Berries is an alright breakfast/brunch option if there's no wait. Portions are decent, nothing is flat out bland, and they have some interesting options.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iQ_onjr2OBancMryLJ9n-Q/348s.jpg", "caption": "French Toast Flight + Sweet Potato waffle w/ fried chicken"}]}}, {"review": {"des": "BE PREPARED TO WAIT. Even if they tell you an hour, that is likely a lie. <br><br>We came here a Friday during the day, and they told us an hour wait. We decided to go get champagne for our mimosas since it's BYOB. They said we'd get a text when our table is ready but we still came back an hour later. When we got there the host told us 10-15 more minutes. Fine. It ended up being 50 minutes, and the hostess got irritated when we asked for updates. <br><br>We were OBVIOUSLY very hungry when we sat down and it took an addition 10 minutes for anyone to even come acknowledge us. We ordered right when she got to us because with a two hour wait you have time to peruse the menu. <br><br>The food was PHENOMENAL. We all got the shrimp omelette special and it was so so good I wish I had it right now. It came with cheesy potatoes that also were incredible. I've heard good things about the French toast but when breakfast becomes a 4 hour ordeal it's annoying.<br><br>Service is the reason for the 3 stars. Food is incredibleeee, just make sure you don't have anything planned for the entire morning.", "pics": null}}, {"review": {"des": "Came here around 9:45AM on a rainy Saturday morning. We thought the rain would deter people from coming outside but nope, the restaurant was packed when we got there! We were quoted 80 minutes for a party of 3, so we decided to walk around the neighborhood while we waited. After only 30 minutes, I got a text from the restaurant saying our table was ready. We hurried back and got seated towards the back of the restaurant, which was packed and very noisy.<br><br>We decided to order the famous French toast flight ($11.5) for the table (which came with a sample of strawberry, blueberry, lemon and caramel), and I got the special (crab cake Benedict $18) while my boyfriend ordered the Cluck-N Gaufre ($13.5) which was a dense sweet potato waffle stuffed with chicken and topped with fried chicken and hot sauce. The waffle was extremely filling and tasty; it was a nice spin on the traditional chicken and waffles. The crab cake Benedict was way too salty for my liking, and I wished the hash browns were a bit more crispy. The French toast flight definitely lived up to its hype; all flavors were good and the maple butter was exceptional.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zsBv7eTr-NmeQi1DeilPwQ/348s.jpg", "caption": "French Toast Flight"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ocx7DHMYyURwpF5w9EGRMA/168s.jpg", "caption": "Cluck-N-Gaufre"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zWH96PGWVftpcncsus8_og/168s.jpg", "caption": "Crab Cake Benedict"}]}}, {"review": {"des": "So, I was visiting a friend in Chicago, Batter and Berries was our first stop. I'm a Yelper so when I'm looking for food, Yelp is my go to.. the pix looked AMAZING!!! <br>My friends and I were really looking forward to what apparently are the specials like the lobster omelette etc. so initially we were a little disappointed that those items weren't on the regular menu, and weren't specials for the day. <br>Our waitress was so helpful. She showed us pictures of all the specials and gave really good descriptions. We all got something different so we could taste as much as we could! lol.. <br>Also this place is BYOB.. wish I had known that! But apparently lots of places in Chicago are.. <br>in addition to our server being helpful, there was a gentleman name Fredrick ( if my memory serves me well) he was very nice and gave us several places to visit during our stay..", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZXr2l-Ceu6s4YDsK3Q3f3g/348s.jpg", "caption": "Fajita omelette"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lDJtTnUBeQP0Q81PAU9ZtA/168s.jpg", "caption": "Salmon croquettes"}]}}, {"review": {"des": "So excited to finally make my way to Batter & Berries. Do yourself a favor and get there early! The place is super tiny and packed. From pressing yourself against a wall to make sure wait staff can zoom by with trays of food to not bumping into someone or feeling your standing over them while eating. If you're claustrophobic this isn't the spot for you. The 'waiting area' is two little benches towards the back of the restaurant between tables where people are eating. The wait time here can be pretty long but if you order takeout it's supposed to be quicker. We were told a hour wait for takeout and 15-20 minutes for carry out. Well we opted to do carry out but still it took a hour to get our food. So time and patience is definitely needed to come here. Don't think about calling orders in as you have to be present to order. Alright on to the important stuff, the food. It is delicious. First time going here I would definitely recommend getting the flight. Each piece of French toast is a different flavor and all equally delicious. The other items on the menu are good as well. Would've been a five star review as the staff was super sweet but they seriously need to think about a larger space.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Pcjr6g8Xe1Wj-goK9VRLNA/168s.jpg", "caption": "Store front"}]}}, {"review": {"des": "Couldn't have been happier to stop in Batter and Berries for breakfast. I read on Yelp how busy it gets on the weekend, so we made an effort to get there before 9am. Thankfully we did, the wait list got pretty long right after we were seated. The service was phenomenal. We were seated quickly, had drinks right away, and the waiter did a great job welcoming us and introducing us to the menu. We ordered the biscuits and gravy and the french toast flight. I highly recommend both. The brioche bread made for the perfect french toast, and the four flavors were executed so nicely. The maple butter on the side takes each flavor to the next level. The serving of biscuits and gravy was huge! We were definitely stuffed after our visit. We had such a fun time here. It was really loud and busy, but our waiter was so friendly and the food quality was excellent.", "pics": null}}, {"review": {"des": "Holy Moly - check this place out !<br> <br>We ordered 2 specials. First was Crabs Benedict. Our server Nadine said they use the crab to replace the English muffin. That didn't hit me till it came - it's just the crab cakes(with no fillers) and eggs. OMG, it's the most concentrated crab goodness I've had. I needed some of my omelette to cut the richness of the crabs.<br><br>The omelette is amazing too. The shrimp infused chipotle sauce taste like shrimp in liquid form. The bits of melted Asiago give the eggs substance and takes it to the next level. The veggies were cooked to perfection and was the right offset.<br><br>The caramel French Toast with maple butter is highly recommended. Even the fruit sides were generous. I'm coming back.", "pics": null}}, {"review": {"des": "Amazing! This was my first time and it won't be my last. I know this place has a long wait, so we came decently early. Heads up, they won't seat you until your ENTIRE party is present. The staff is SUPER friendly, and hospitable. I loved the staff the most. The food was the next best part. We got the chicken and waffles and the blueberry waffle along with a couple of sides. The waffles were incredible and definitely better than your average waffle. We are going to have to learn how to create that savory waffle! <br><br>So so good. I will be sure to wake up early on a subsequent morning for another breakfast here!", "pics": null}}, {"review": {"des": "The wait is long but if you are lucky enough to snag a seat GET THE FRENCH TOAST! My crew and I shared a sampler (lemon, strawberry, blueberry and caramel). We also had individual entrees, Poutine, chicken & biscuits, shrimp and grits and a vegetarian plate. The other entrees were decent but nothing could stand up to the french toast. I would rank them:<br>Caramel<br>Lemon<br>Blueberry <br>Strawberry <br>When I return, just load my plate with the caramel and lemon and you won't have to worry about me anymore!", "pics": null}}, {"review": {"des": "This place didn't totally live up to expectations.<br><br>First of all, the food itself: As a professional pancake pundit, I am constantly looking for the best 'cakes. At Batter & Berries, they are clearly the red-headed stepchild behind their french toast and waffle offerings, crammed into a small corner of the menu. I went for the buckwheat cakes, which had a lovely spicy taste. Bizarrely, syrup was not brought with the cakes because the \"syrup is already cooked into the pancakes.\" Huh?? While the flavor was quite delicious on its own, the syrup helped the slight bit of dryness (perfectly understandable given they are buckwheat).<br><br>I had my lil nephew with me and got him a kids-size chocolate chip pancake offering, and you may ask, did I try it? Did I literally steal food from a baby? HELL YEAH. I found flat, dry, chewy/tough pancakes barely masked by enough chocolate to give a 300-lb man a sugar rush for 2 days, so at least my nephew was happy. But you could get better pancakes at IHOP.<br><br>Secondly, the service was not great by any stretch. The servers all clustered in their serving area, chatting with each other with their backs to the room. As a result, even waving our hands over our heads (literally, several times) wouldn't get us service - we either had to wait, or get up and walk across the restaurant to grab something. Our food got delivered piecemeal and things were forgotten (side of fruit, syrup, and so on) but our waitress didn't come check on us as food was delivered, so again - wait, or aggressively flag down. She did show up halfway through our meal, and of course by then we'd managed to find what we needed.<br><br>The big question: Worth the wait? DEFINITELY not. We got there at 8 am on a Sunday morning and were first in line, so I can't imagine waiting in the 1-2 hour line that often forms later in the day. Will I be back? If one of my friends really wants to go, and is willing to go when there isn't a wait...maybe.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sRCRscLByIw5YDneAXNHCw/348s.jpg", "caption": "Buckwheat pancakes"}]}}, {"review": {"des": "Great food. We were visiting Chicago and picked this place for a Wednesday 11am brunch, not realizing how popular it was. We were lucky and apparently showed on a slow day. We would be sat with no wait, HOWEVER every member of your party has to be there!! We made that mistake. Once our third member arrived we were sat.<br><br>The waitress was friendly and helpful. We ordered immediately but the food took a really long time to come out... and then it came out in shifts, with me sitting around waiting behind. <br><br>But lord when the food came we forgot all our qualms because the food was ah-maz-ing. All of it. Especially the sweet potato fries. We didn't mind the wait anyways because we spent the time catching up... we were just starving. If we had known about BYOB I think we would have been just fine.<br><br>Basically its worth the wait. Just bring booze and don't be starving. You will be rewarded.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AbKFJHP4P4e3YLUS__Q9Ww/348s.jpg", "caption": "Salmon eggs Benedict"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JBgth3EY7Z-6vTCkCOHf1Q/168s.jpg", "caption": "Peach cobbler French toast"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dsq85XE_38bBnIxrmgP7Xg/168s.jpg", "caption": "Sweet potato Chicken and waffles"}]}}, {"review": {"des": "I realize that my 3 star review goes against most of the reviews for Batter & Berries on here, but it's the only amount of stars I could see myself giving. I came to Batter & Berries on Sunday morning and of course we had a pretty long wait (not a problem at all). Once waiting I received a text asking to confirm that I still wanted my table, I responded with the number it told me to and then I checked in about 15 minutes later. When I asked about the text they told me I cancelled the table and was taken off the list, but when I showed them my text message they said I did It right and just sat us down, which was kind of confusing. The menu is pretty big and offers pretty much every kind of breakfast a person could possibly want. I ended up ordering the Cluck-N-Gaufre, which was a chicken stuffed sweet potato waffle with a piece of fried chicken on the side drizzled in sauce. Now, from the description this was a breakfast that seemed to be destined for greatness in my stomach, but that's just not something I felt. When the food came I first tried the chicken and it was really good, a medium sized boneless chunk that had a kick to it. The waffle was my big letdown of the meal. The giant waffle was not great, I don't know if it was the taste or the almost dry thickness that made it hard to swallow. I was super excited to get this meal and it just didn't do it for me. Maybe I would be writing a completely different review if I ordered something else, I really don't know. But I just wasn't feeling the experience. <br><br>Overall, this place is always busy and always has a wait so clearly people are loving this place. I wasn't big on my meal and I also wasn't very big on the pushiness of our waitress. I'm not saying that if I found myself in Chicago again soon I wouldn't give this place one more shot because with this many reviews and this amount of positive feedback they are clearly doing something right. I definitely think this is a place that everyone needs to try for themselves.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NtCo6BGF_FHBB_wjTbxXNA/348s.jpg", "caption": "Click-N-Gaufre"}]}}, {"review": {"des": "Every time I have been here the wait is always insane. So if you are a brunch lover, be prepared to wait, especially on the weekends!! <br><br>Since the place is small, putting your name down on the weekends will still give you about an hour of standing time (usually outside so be mindful during the winters). <br><br>The food itself was pretty good! They have amazing waffles! The traditional bacon and eggs are good too. This place is BYOB, so if you are looking for a place to do bottomless mimosas, this is not the place for you. <br><br>The service is great and the server comes by frequently.<br><br>Also, parking may be a little rough if you're driving since only street parking is available. There are some free parking around if you are willing to drone around and walk a block over. The brown line is about a 7 minute walk so public transportation is easy!", "pics": null}}, {"review": {"des": "The food was not that good. Undercooked potatoes, cold chicken sausage. When we mentioned it they replaced the order - the replacement grilled chicken breast was also undercooked. <br>The place is small and crowded. Wait time is about 40 min.<br>Definitely not going back.", "pics": null}}, {"review": {"des": "BEST FRENCH TOAST I've ever had. I've been to a lot of places and had french toast but nothing bests this place. It is sooooo worth the wait. If you want to beat the rush come early. We've been here at least a half a dozen times and every time I get the french toast super flight. It comes with strawberry, blueberry, lemon, caramel and seasonal french toast sample. All of them are amazing. It's the perfectly consistency of soft and custardy on the inside and a crunchy caramelized outside. The most unique one if the lemon one. It's like a lemon square in the form of a bread. It's heavenly. <br><br>I've also had the crab cake Benedict here. The crab cakes are mostly crab with very little filler. Only suggestion would be to put more hollandaise sauce on the eggs. The crab cakes soaks up a lot of the sauce.<br><br>Overall, amazing french toast, great service and soooo worth the wait!", "pics": null}}, {"review": {"des": "What a small world that when we arrived to this brunch spot, one of the wait staff employees used to be one of my mother's tenants! We would have loved that she was our wait staff; my daughter preferred a table not by the window. Our waitress was friendly, hoever her voice was soft spoken and would ask her to talk louder plenty of times.<br><br>Place used the space well; in the middle of the room there are benches to wait inside for all the members of your party to arrive or wait for a table available. I would assume this spot is very popular to accommodate hungry eaters. I felt the tables were too close together...<br><br>I ordered the french toast flight and for a few dollars more, the french toast sample of the day. Obviously all the fruit toppings and batter were too sweet that i could barely finish 2 slices out of 5 so great to have leftovers.Not the best Ive tried in terms of size, I did enjoy the unqiue taste!<br><br> I also ordered one of the 5 breakfast specialities called the movin on up executive 7 oz Lintz Heritage angus ribeye steak with grilled unions, mushrooms, 2 eggs, hash brown and caberet sauce. I wasn't too fond of it and glad to have at least I tried this dish and wouldnt have to wonder with regret.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vsgeBzrx11qi1X90tkUYQg/168s.jpg", "caption": "French toast flight"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SpmIqlkJmNLGT3OfNjOyTA/168s.jpg", "caption": "My breakfast date"}]}}, {"review": {"des": "Don't even try to tell me there's a better breakfast spot in Chicago, because I LITERALLY may have to fight you after the meal I just had at Batter & Berries. <br><br>We got lucky and were sat immediately (we opted to sit at a community-style table since there was no wait)<br><br>Drinks:<br>- Coffee = 5/5<br>Not bitter, very smooth<br>- Hot chocolate = 5/5<br>Unlike other places, has a distinct chocolate taste and isn't just brown water with whipped cream<br><br>Food:<br>- We shared an order of \"world famous\" strawberry brioche french toast. When I first read \"world famous\" on the menu, I doubted it would taste any different from what I was used to and I was WRONG! Don't forget to eat the sweet cream butter with it! - 5/5<br>- Caribbean Pork Chop (from the special's board)<br>The BEST pork chop I've ever had! Well seasoned and topped with a mango salsa. Came with eggs and hashbrowns (which already have cheese in them) but would probably be good over rice and served as a lunch/dinner plate - 5/5<br>- Chipotle shrimp omelette (from the special's board)<br>Very savory, but in a good way! Gave me shrimp and grits vibes (in regards to the flavor). Paired with hashbrowns, which (as mentioned) are slightly cheesy.<br><br>Overall, I have NOTHING negative to say about this restaurant and am happy I was able to support another black-owned restaurant!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_OCj1gsXpQsITb6Mk0G7AA/348s.jpg", "caption": "strawberry brioche french toast"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BK5K7mkQpqiF6IFnHwzmbA/168s.jpg", "caption": "Caribbean Porkchops"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QWfi6agCvXZCX19WZGbjbQ/168s.jpg", "caption": "strawberry brioche french toast"}]}}, {"review": {"des": "My absolute favorite new brunch spot! I wish we lived closer, but will definitely make this a go to when we're in town! With a fun and creative menu, friendly and knowledgeable servers, cute and trendy atmosphere this place is for sure a 10! <br><br>We sat at the community brunch table, which was so nice because we were able to connect with some other people and compare brunch options. I ordered the Special of the Day, Lemon Pepper Lobster and Asparagus omelette.  It was just as fabulous as it sounds! My husband ordered the chicken fajita omelette. He has not stopped talking about it! We opted to share a kids order of Blueberry French Toast and wished we would've shared a French Toast flight! It's THAT good!! BYOB for Mimosas, etc. <br><br>We will be back in May and cannot wait for brunch before the Cubs game!!", "pics": null}}, {"review": {"des": "Rumor had it that Batter and Berries is one of the BEST Black owned eateries for brunch in the city. I am writing this review to confirm it's true NOT just a rumor. <br>I went on a Sunday,  which meant I should expect a long wait. The restaurant is small but it makes that up with a bright decor and the community dining table instead bar counter seating.<br>I was impressed by the menus many options but thanks to my awesome server, Jessica L., who guided me  through it, I went for the special omelet and an order of their signature dish. <br>Every bite was delectable! This is going to be a MUST every time I am in the city.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/evjMZ2FowVGuH2eRA7mfSw/348s.jpg", "caption": "Chicken and Sweet Potato Waffles"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RLLkmQBgT72JS0N9KDOnBw/168s.jpg", "caption": "French toast Flight"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GJiobR2cWWZOERneW-ey9g/168s.jpg", "caption": "Lemon pepper Lobster Omelet with chessy hash browns"}]}}, {"review": {"des": "What can I say, this place is amazingly delicious. The wait is ridiculous though. Our wait this time around was 1:45. Last time it was 2:15 and guess what? We waited hahaha!<br><br>Bring at least two bottles of champagne and order the large orange juice.They open the bottles for you.<br><br>We always order the flight to share. Then we order off of the board. I have never ordered my actual meal from the menu because those specials always get me. I've had the salmon special, omelet special, pork chop special, and a few others. I generally spend close to $30, which is cool with me. <br><br>Its a small local spot. I do wish they could increase the space just a little. On my last visit we sat next to Ty Young (WNBA player) and Deon Cole (Blackish) yes he took a picture with me (I asked for it after he was through with his meal).", "pics": null}}, {"review": {"des": "The food is great, but the restaurant itself is kind of overrated (and overpriced). I'm sure I wouldn't care so much if it wasn't for the ridiculous waiting times! I can't see myself ever coming back if I have to wait 2-3 hours for a table again. Please, PLEASE, expand to another location!", "pics": null}}, {"review": {"des": "This is a pretty good breakfast restaurant.  The food tastes clean and fresh.  <br><br>The servers are super friendly and the coffee is flowing.  <br><br>If you don't want breakfast, the sandwich options are nice.  Of course,  I'm a fan of breakfast!<br><br>Be advised of that the restaurant does not accept reservations, and they don't accept American Express cards.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Yh4AAI6_XP1aWtcHgvmcfg/348s.jpg", "caption": "Traditional breakfast...tasty hashbrowns with cheese."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jk53SDfXx6hiKh6VcmxgKA/168s.jpg", "caption": "Chicken sandwich with fries."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NXZA3cyo7fZSg0r1zJscWg/168s.jpg", "caption": "French toast flight...pretty good!"}]}}, {"review": {"des": "Cluk n Goof, Super Flight, Chipotle Shrimp Omelette <br>So delicious! Best breakfast in Chicago! Unique menu that changes up every so often. Their Instagram feed has amazing pics. I'll be back next  Chicago visit!", "pics": null}}, {"review": {"des": "One word: phenomenal! It is worth the wait!! From the moment we walked in, the host and managers were warm and welcoming. I looked all around at everyone's plates and was in awe. I knew I'd have a hard time deciding! Thankfully, my friend and I elected to split 2 dishes.<br><br>The French toast was the best I've had. The shrimp chipotle omelette was something out of heaven!! That was an all star. The cheesy potatoes side were delicious and cooked perfectly. <br><br>This place is a must try and this will be on my must list for anytime I return to Chicago.", "pics": null}}, {"review": {"des": "What a delicious spot! A great neighborhood gem and worth the wait. My friend and I put our name down, then walked down the street to sit in the park until we got the text. <br><br>Once we were in, we had a great two top table on the side but the place is rather loud and our food took 45 minutes. They were packed so it was nice of them to give them a heads up but frustrating that the food took so long. I ordered waffles which were incredible so definitely lives up to the \"Batter\" name. My friend ordered the veggie scramble but it was soaking in butter/oil/grease so maybe ask if they can cut back on it when cooking for you.<br><br>Overall, it was great and I would totally go back with friends but I wouldn't go with more than 4 so you can for sure get a table.", "pics": null}}, {"review": {"des": "A+<br><br>My cousin brought me here during the weekday so we did not have to wait and it was not crowded. So, one big thing that I am a stickler on is service. The waiter, Tusiime is someone that is well known in the restaurant and you're going to want to request him. He keeps your glass full and also keeps you thinking and laughing.  <br><br>I ordered Super Flight French Toast. At the time it was Pink Moscato battered French toast topped with vanilla sauce accompanied by a sample of their strawberry, blueberry, lemon, & caramel French toast. Each served with their famous Batter & Berries maple butter. Of course, bacon and scramble eggs with Gouda cheese on the side. This combo was one of the best combs that I have had. The french toast was not dry and I really wanted more. <br><br>The prices are standard as if you were going to another small business for brunch. My ticket also included my cousins!<br><br>There's so much to choose from on the menu also. I know I will be back when in the city.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/F0IRyRyyCG3Wy5grlazebg/348s.jpg", "caption": "Tusiime !"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1Bk_eUfvIl7WrIrbOUYYBQ/168s.jpg", "caption": "Super French Toast Flight"}]}}, {"review": {"des": "Wow, this place is definitely worth the wait. I've been here a few times and have not been disappointed. The chicken and waffle is amazing! The French toast flight is also a must try. The place is BYOB so bring a bottle to champagne to go with the amazing food. The place is always packed so we usually put our name on the list and go to Delilah's across the street for a few drinks. Can't go wrong with anything you order here.", "pics": null}}, {"review": {"des": "My favorite breakfast spot . All the waiters are nice .  Every week they have a new items added to the menu. Amazing French toast .", "pics": null}}, {"review": {"des": "Truly great food and wonderful service. Was super packed and they had a two tiered que. The first was understandable but they called you back and had you wait in a second holding area for 20-30 mins after a nearly 2 hour wait the first time. Was worth the 2.5 hour wait because we went to the bar across the street but to sit in a second holding pen for another 30 mins.", "pics": null}}, {"review": {"des": "Despite having to wait over an hour to be seated in an overly cramped space, the most disappointing aspect of this place was the food. I walked in expecting to be blown away based on the hype surrounding this place, and found it to be just ok. The french toast flight was very sweet and reminiscent of dense cake, while the hash browns were something nightmares are made of. I literally could not stomach them. My companion described the chicken and waffle dish as being \"bready\", although they were delighted by the waffle actually containing chicken.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yAPC9I3lLmytN0dEUk78rg/168s.jpg", "caption": "Cluck-N-Gaufre Sweet Potato Waffle Stuffed w/ Fried Chicken, Chicken Breast & Nutmeg Hot Sauce, & Sweet Potato & Sage Hash"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1WUiTcXs1ZEcCoFBymJtfA/168s.jpg", "caption": "French Toast Flight (Lemon, Caramel, Strawberry & Blueberry)"}]}}, {"review": {"des": "Packed as usual ... I got a seat right away at the community table but had to wait almost 20min b4 some1 came to take my order. The server was extremely apologetic when she did finally come to take my order. She explained they had several call outs. I get it I'm in the business ... however the bus boys, hostess and others ( who I saw doing nothing at time) could have been more helpful and had better attitudes.<br>At long last- 15 min after my order was placed-I received my over cooked poached eggs (see below). As i said,  I'm in the business so I get and understand long wait time especially when you're short staffed ... but there is NO EXCUSE for the kitchen sending out over cooked food. <br>My server has been great and I'll be tipping her accordingly for trying to make good of a very bad situation that was not her fault <br>Think B& B has lost me as a customer.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nz4EqcBVLIfNwxoycoecRA/168s.jpg", "caption": "Over vooked poached egg - unacceptable"}]}}, {"review": {"des": "We stopped by on a Saturday morning and waited 40mins before we got seated. Once we ordered we waited another 20mins before we received our plates. My wife ordered the crab cake Benedict and I got the Cluck and Gaufre (hot chicken with sweet potato waffle). Flavors were excellent, however the crap cakes came out lukewarm and the sweet potato waffle was super dense. Staff was very friendly and seating was very intimate. Prices were a bit on the high side, but I think we'd definitely come back to try a couple more of their unique dishes.", "pics": null}}, {"review": {"des": "Hands down the best brunch place I've tried so far. Visited Chicago for the first time and our uber driver suggested this place, so we know we have to try the local's suggestion. We went on a weekday am, and did not have to wait. The server showed us pictures of the food, and carefully explained to us their specials and popular items. <br><br>For those who enjoy both sweet and savory, I suggest getting the following items to share.<br><br>Toast flight was amazing, with best lemon, strawberry, caramel, blueberry, and the hawaiian punch rum -- butter that goes with it is amazing we had to request an extra for extra charge. Then, the lobster omelet with lemon pepper is delicious. We got other items too, but to top it all off: ask for their hot sauce. Happy brunching!", "pics": null}}, {"review": {"des": "I tried this place last week when I was in town for a concert. Tried the Chipotle Shrimp Omelette and it was amazing! The shrimp was juicy and flavorful and the egg was fluffy and complimented the dish perfectly! We also tried the French Toast flight and it was amazing. Super flavorful with the perfect touches.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rhYy9fhssL_5x2svxcO4bg/348s.jpg", "caption": "Chipotle Shrimp Omelet"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uLBalRdLo78RJmlVwkE0hg/168s.jpg", "caption": "French Toast"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OFIL5t8Q8L4198QizYZJmA/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "THIS PLACE IS AMAZING!!! I really would have ate here everyday if it wasn't my first time in Chicago. You have to try. There is a longggggg wait. I went to get my nails and feet done across the street and my table still wasn't ready. But the wait was well worth it !", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SRo8ana4qU90BWDn-T6tHA/348s.jpg", "caption": "Lemon Pepper lobster and crab egg white omelette with cheesy hash brown."}]}}, {"review": {"des": "I'm not sure I can tell you enough just how much I love this place. If it were much closer, I'd be here every weekend. There's a wait but I'm telling you, its worth it. Not enough street parking outside but hope and pray that u get one so you can wait in your car. There's not a lot of space for waiting inside either. Its a pretty loud place but the food and the coffee is just too good that I forgot about the noise. The french toast sampler was so worth it and that chicken and waffles remind us of home. Definitely one of the best breakfast places I've been to.", "pics": null}}, {"review": {"des": "I love this place for breakfast. The French toast flights, the New Orleans inspired specials, the fact that, despite the breakfast crush, they tend to get you seated pretty quickly, all make this a great place to have breakfast. It all seems to be because the General Manager, Don Jones, keeps everything hopping and friendly. Definitely recommend it for breakfast.", "pics": null}}, {"review": {"des": "I have driven four hours just to have brunch here. Literally the best French toast I've EVER had. The French Toast Flight is fun to share as a brunch appetizer. You get to try like five flavors on the French toast! My favorite is the lemon. Plus the butter is so delicious, you don't even need any syrup. Not to mention they have deconstructed omelette like chicken Alfredo and lobster lemon pepper! You HAVE to make time to go here any time<br>You visit Chicagoz", "pics": null}}, {"review": {"des": "Had the pleasure of visiting Batter & Berries Oct 2018. This place blew me away with the sincere hospitality and welcoming vibe. Our server was Tusiime Jackson, he was well knowledgeable of the menu, giving us a complete tour through his wise choice of words! If I visit Chicago again this place is on my \"mandatory visit\" list! <br><br>P.S.<br><br>BYOB, they will provide the juice!", "pics": null}}, {"review": {"des": "After hearing about this place many times. I decided to try it - I'm a sucker for brunch, so why not. It was a GREAT decision.<br><br>At 1pm, there was a 90-minute wait, so I opted for take-out, because I simply didn't have the time, but certainly had the taste for it.<br><br>This place is known for its Instagram-worthy over-the-top French toast dishes, but instead of following the favs, I wanted to get something I love - omelettes.<br><br>I ordered a sausage omelette and in true B&B style, this omelette was amazing. Not only was it packed with sausage, red/green peppers, cheese and onions, but it was topped with broken up sausage patties and sausage gravy! This is the king of sausage omelettes.<br><br>On the side, the menu calls for cheesy hash browns. But in true B&B fashion, this side was almost as good as the omelette as a main dish. Portions are super generous. It's not cheap, but not too expensive. Either way, be prepared to shell out about 15 bucks for your meal, plus drink. It's worth it!<br><br>And now that I've determined it's well worth a 90-minute wait, staff was super helpful during my first-ever visit, I'll prepare better next time and arrive earlier. Definitely returning and will add that extra star when I do.", "pics": null}}, {"review": {"des": "Went for birthday on a Wednesday morning. <br><br>Upon arriving we got seated right away I'm guessing because it was only two of us. In the past we've had to wait 30mins-hr or so. We were seated right next to the bathroom! Kind of made me lose my appetite. And the table was on a tilt which made me think it would break any second. <br><br>Considering how busy it was, the food came out quickly. Food was great. - I had the lobster omelette and asked for spinach(that I wanted put in the omelette and got after basically finishing the omelette) with the caramel french toast and hot chocolate. I think if it wasn't so loud the server would've heard me say I want the spinach in the omelette. I was so full but couldn't help myself to keep eating because everything was good.<br><br>Honestly couldn't enjoy the experience because if it wasn't the bathroom door opening, it was groups of people and servers with dishes walking past us and the space between the table and the other tables were so small the servers asses were literally in our face. Like I think the owner has enough regular business to open a larger restaurant especially when it affects the experience of eating there. Don't get me wrong the food is still great but meh. <br><br>Also my bf and I weren't even able to have a conversation due to how loud the music was. My eardrums felt like they were being damaged and it sounded like we were sitting right in front of the Dj even though we were right in the middle of the restaurant.<br><br>5 stars for the quality of the food but 2 for everything else. Open a bigger restaurant.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/znIDpdNGESpflOkTbJ9g4w/168s.jpg", "caption": "Lobster omelette. So good"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fwJj_zkBFTJD3Y12jcqPJA/168s.jpg", "caption": "Caramel French toast. Definitely enough for 1-2 people"}]}}, {"review": {"des": "Holy French Toast!!! I knew I always loved anything citrusy, but lemon flavors French Toast so good. I had to try the famous Four flavored French Toast.<br> I heard celebrities even pay a visit here, it's so popular and I can see why. This is the place to visit, it was so packed with cars waiting to enter before opening of business at 8am, I hardly made it in with the number of people waiting for seating. They have a new specialty item every week. The day I visited I ordered the scallop gratin, blew my mind. Seafood is my week spot, severed with cheesy potatoes with onions was a great combination. I even heard they have a new flavored French Toast,called champagne , perfect for the holidays. Keep up the good work.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/U4-nRdeT-E-WEckwC3vHUg/348s.jpg", "caption": "Today's Special"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Y9oACTXqCx6i3g2c5JBC9Q/168s.jpg", "caption": "Crab omelette"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/L8pNH9VUFhN7sVmkTRJ04A/168s.jpg", "caption": "Scallop omelette"}]}}, {"review": {"des": "Great food, friendly staff and nice atmosphere. They handle the mob of people that come to eat here well and have a menu that offers something for every type of eater. Little on the pricey side for breakfast, but a satisfying meal nonetheless.", "pics": null}}, {"review": {"des": "Amazing food drinks, and service. The only concern is the wait, but thats because this place is so good. I wish that they would open up a second restaurant!", "pics": null}}, {"review": {"des": "We went for Sunday breakfast, and like most breakfast places this place was pretty busy. We were given a 90 min wait, but got called back within the hour. The system they use seems very efficient and helps with the flow. We ordered the biscuits and gravy, hashed Browns, and a super flight of French toast. We came during pumpkin season so the pumpkin cheesecake French toast was part of the flight. It was the best pumpkin spiced breakfast item I've ever had. Our waiter was super friendly and the whole wait staff was accommodating. We were very full by the end of it and satisfied. If I'm ever in the Chicago area and am in need of breakfast, this will be the place I'll be going to.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HPjso5pGzi9P4YYQMGDqiw/168s.jpg", "caption": "French toast super flight"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lS_-iJxhdU2BvODpPsUcsw/168s.jpg", "caption": "Biscuits and gravy"}]}}, {"review": {"des": "Got there a little past 10am and put our # down for a 50 min wait. Walked down the street to Printer's Row for coffee and then it was just about time! We sat by the door so it was kind of cold. The hostess kept saying \"please close the door so our guests stay warm!\" they try to accommodate w heat lamps and space heaters around the front. <br>It has a very homey, comfort food sort of feel. I think that's what they were going for so A+ on that. I thought the French toast sampler was overrated though. Wouldn't get it again. The jambalaya omelette special was good though!!", "pics": null}}, {"review": {"des": "LOVE BREAKFAST AND BRUNCH <br>Came for brunch on Saturday. i am visiting Chicago on my own since my husband is working. Most have been friendly and helpful. Some professed foodies i met last night said this was a must try for brunch. i made my way there. it was crowded and loud. Cute little place cheery decor and everyone having great time .. chatting and laughing. its byob and a few brought champagne and oj. i didn't make reservations but they seated me immediately at the end of a table where several separate couples were seated. my husband would have hated being seated so close to strangers but being alone and more social... i was fine <br>         they are known for their French Toast and several to choose from ... never fear you can choose to order THE FLIGHT OF FRENCH TOAST.  so you get one piece of several ... but lady next to me clued me into The SUPER FLIGHT. you get an extra which is oreo. omg. it all was so good. <br>       service was fast and efficient. when they saw i wasn't using my knife and spoon they swiped it off the table without a word ... huh never had that happen.", "pics": null}}, {"review": {"des": "I had been wanting to come here for a while. Was sat pretty quickly since it was only me. They have a communal table. <br><br>The waitress was friendly, but she messed up my order. I had ordered the super flight and they sent the regular flight. <br><br>A plate of bacon was brought to me and i didn't ask for that. They gave me the order from the lady in front of me. <br><br>The food was filled with butter, it was really really greasy. The toasts were nothing special. <br>Food took quite a while to come out. <br><br>Nice presentation of the food, but that's about it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wLWXjbMHDRPgycUOuMQ25Q/348s.jpg", "caption": "Cookie batter toast"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/obib_YRj9UQqwYLAkWK_Iw/168s.jpg", "caption": "Super flight"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5SZIIwqcglQHxJpCd4YRwA/168s.jpg", "caption": "Chicken fajita omelette"}]}}, {"review": {"des": "Best breakfast experience and food is amazing. Everything is fresh, the staff is energetic and engaging and we felt 100% welcomed. <br><br>Here's a riddle...When you find the best place, with great food, people, and a staff that cares why go anywhere else? Uh, you don't.<br><br>One last thing for our host...Go Notre Dame", "pics": null}}, {"review": {"des": "My 3rd attempt finally got me in. The first 2 attempts, the 2+ hour wait turned me away but this 3rd attempt, luckily I had the time and patience for it.<br><br>If you can come here early enough or on an off time later in the day, just an hour or so before they close, you might not have to wait too long. Otherwise, this place is poppin and rightfully so. It's a popular black owned business which is awesome when people of color make it. <br><br>My friend and I ordered:<br>Cheesey hashbrowns as a side<br>The french toast flight<br>Fried Chicken sandwich<br><br>The cheesy hasbrowns were rec'd by our waitress and I could see someone who likes cheese and not crispy hashbrowns really like this dish. But for me, I like my hashbrowns crispy so I wasn't too much of a fan.<br><br>The french toast flight was delicious. Blueberry was my favorite, the blueberry sauce tasted so fresh and delicious. I'd get this again as a full dish on its own and I'm not even a fan of sweet breakfast items. The fried chicken burger was good as well and was definitely more of a lunch item than a breakfast item. <br><br>All in all, I'd definitely come back but I don't know about waiting another 2 hours again. I'd come back at an off time to get my fix.", "pics": null}}, {"review": {"des": "Strap in. Cause it's about to get good. OH MY GOSH. Da bomb. The shizz nizz. El grand sabroso. Anything else you can come up with, throw it in there. I know I'm getting over hyped about a breakfast place that I've only been to once, but I gotta give credit where credit is due. There's always the \"IT\" factor that you always look for in a place, no matter what the occasion, and this place has IT. No, not Pennywise. The service is literally second to none, and if I do find one better, it'll only be a tie for first. This is cool version of what other restaurants have. Yep, the people are just cooler. Check it out for yourself. It's a cute location off a small busy chicago street, and the layout just allows you see outside no matter where you sit. There's also this high top seating right in the middle that is treated like a bar. And by like a bar, I mean if there's an open seat, you sit. Okay okay okay, let's talk food.<br><br>The Traditional (4/5)<br>--- Crispy hash browns, choice of meat, and super creamy scrambled eggs. It's nothing special, and as long as you don't mess it up, things are gonna be fine, however, these eggs were better than average, and it just went well with the other two items.<br><br>Chocolate Chip Pancakes (5/5)<br>--- Yes. Just yes. To this day 7/16/2018, these are the best pancakes I've ever had from a restaurant. Pancakes are not the world's trickiest operation, but they were light and thick at the same time, with a solid portion of chocolate chips evenly spread within the cake. Oh, and drizzled with some chocolate sauce. That's usually my biggest problem when it comes to ordering chocolate chip pancakes; there's never enough chocolate chips. Which doesn't make sense, and then I can't keep track of which restaurants I need to request for extra chocolate chips. <br><br>Banana-Walnut Waffle (NA)<br><br>Overall, I'll be coming back when I get the chance. I live in the suburbs so it doesn't make sense to drive all the way to the city just for breakfast, but if I do spend the night somewhere, I'll be stopping here first chance I get.", "pics": null}}, {"review": {"des": "service was crawling slow - I live in the area and was able to put my name down to fight the 90 minute wait and went back home; but once we got the text and seated it took over 2 hours from start to finish for breakfast. Major production - food was good... but not that good.  <br><br>All in putting my name down to leaving the restaurant was over 4 hours!", "pics": null}}, {"review": {"des": "So... I'm not really a waffle or French toast type of gal because I usually stick to pancakes. Well I ordered strawberry covered French toast and cheese crusted hash browns and I must say the five starts speaks for itself. It was WONDERFUL! The French toast were topped with strawberries and a drizzle that left you not having to use any syrup. It wasn't too sweet it was just right. The cheese crusted hash browns were different and tasted delicious. The place is rather small but whatever. My waiter was very nice and knowledgeable. The hostess seem as if she barely wanted to be at work and as loud as the place is she either needed to speak up so others can hear or they should provide her with a blow horn ..", "pics": null}}, {"review": {"des": "Came back to chi-town and finally made it to batter & berries. What a treat! I had the French toast sampler: lemon & butter pecan French toast<br>Were my favs w/maple butter..syrup who?! I stuck my fork in my girlfriends Plate for the short rib omelette-delicious. I also ordered eggs  with cheesy hash browns and chicken sausage. The sausage was A Little dry, ok to keep it real it was a mess and needed some salt. Everything else<br>Was scrumptious to say the least. The<br>Staff Was Friendly Especially the manager he was<br>Super nice and took our pictures. We bought a bottle of champagne for mimosas...byob, nice!!! I'll be sure to stop in for some good grub on my next visit Chi-town", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nZCbC09KZYssHiZ_3mZ-jw/348s.jpg", "caption": "BYOB...ayeeeee!!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VfcmB2mke__W2IZkFMJVKQ/168s.jpg", "caption": "Eggs were amazing, chicken sausage not so much"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AJApHZGYxjGYBVz9W_Xs-Q/168s.jpg", "caption": "Short rib omelet"}]}}, {"review": {"des": "I have been wanting to check this place out for a while now! Pro tip come here during the week! The wait isn't as long - you can check in and they will text you when your table is ready! We decided to check in and have a drink down the block. <br><br>Aside from the hostess being grumpy the experience, food, wait staff was a 5 Star! I ordered the sausage omelette and it was Devine! The homemade hot sauce also complimented every bite! I only wish they would bottle and sell it!<br><br>I will surely be back & with a bottle of champagne since it is BYOB!", "pics": null}}, {"review": {"des": "There was anything more frustrating than trying to eat here.<br>Honestly I don't even think this restaurant deserves 1 star. I am ok to wait for 40 mins to get a table but never expecting to wait almost an hour and the food never comes out; as a result, we had to leave. All they need is to be honest with customers and at least tell us that we will probably have to wait 1 hr to get food so we know what to expect. Staff kept coming to our table and told us it will be for a few mins but we never see our food on the table.  Waiting for almost 2 hrs for no food!! If you want to waste ur precious time, u can come here but there are probably a lot of better breakfast restaurants in Chicago!", "pics": null}}, {"review": {"des": "Ridiculously long wait times on the weekend! Stay close because I didn't receive a text message when it was almost time to be seated. Luckily we came back in time! The space is very small and there's really nowhere to wait inside. 8-10 people can sit in their designated waiting space comfortably. A lot of us were lined up against the wall where there's a lot of traffic back and forth to the kitchen. Very hectic and a little stressful since their coming back and forth hot plates, etc. <br><br>Presentation was spot on. A little pricey for the portions. My friend and I wanted to try a little bit of everything so, we split the salmon benny and French toast flights. The pecan French toast was really good. We were a little disappointed to find that our egg was over cooked but overall, all of the flavors went together well. And the hash browns were amazing!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FqAgZLsoytrH2PKPgZZsew/168s.jpg", "caption": "French Toast Flight - Pecan one was my fave!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RZ5bGKDmoM2kyyIqxcni2A/168s.jpg", "caption": "Cajun Salmon Benny"}]}}, {"review": {"des": "WOW the food is good! It's definitely worth the wait! We ordered the french toast flight, and an order of eggs and bacon. The french toast was AMAZING! It came with a blueberry, strawberry, pecan, lemon and cap n'crunch (the special). I think the lemon was by far the best (the cap n'crunch was a little too sweet), but all of them had plenty of fresh fruit and was very decadent! The eggs and bacon were also good.<br><br>The service was prompt and they're very efficient. Yes, the wait is long, but come early (or come on a weekday), put your name down, and then explore the nearby area for a while. Then you'll be hungry and ready for some french toast :)", "pics": null}}, {"review": {"des": "I came to this place roughly two years ago and decided to come back while visiting. I don't know what was going on this particular day but the food took FOREVER to come out! The manager was very proactive though and had the waitresses to give a 10% discount because if the extensive wait. Now...(dramatic pause)...on the food.... it was amazing!! I had the shrimp fajita omelette and hubby had the lobster omelette and an order of the strawberry french toast. We were both more than satisfied with our food choices. I saw a few plates of the chicken and waffle and I must say that it definitely looked appetizing. The restaurant has a cozy feel to it because there is not a lot of space in there. It can definitely have you feeling like you're sitting in a place that's on the verge of being cramped. Overall it was good so if you're in the area, I highly suggest checking this place out.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nC6JwT5QgURyvWUpoxBr4g/348s.jpg", "caption": "Shrimp fajita omelette"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8-1t-ZhoQ-9D0AupylC28A/168s.jpg", "caption": "Lobster omelette and strawberry french toast"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Zm58TuQofmK0Upzqcvii8w/168s.jpg", "caption": "Hot chocolate"}]}}, {"review": {"des": "Really don't get the hype. It was fine, not worth the wait, and after we left our credit card went missing and a $400 charge at Marshall's was posted.  Super weird.<br><br>I feel it has a cult following, there are plenty other yummy breakfast spots in the area.<br><br>Staff was fine, it was super busy, you can BYOB.", "pics": null}}, {"review": {"des": "Love this place. My first time here-- came from Boston and went there from the airport and We were not disappointed! Everything was sooooo good and our server was personable, funny, and added trivia every time he came to check on us. A definite must when you are in Chicago.", "pics": null}}, {"review": {"des": "I finally made it back! It has been a while but the food has not changed! I'm sure everyone agrees that they need a bigger place and the wait times can be a bit much but other than that the food and services are amazing! I was a little disappointed because I was hoping they had my taffy Apple French toast but I had the crab cakes Benedict which is also my favorite. I literally ate ALLLL MY FOOD! Im sure my unborn was happy too!", "pics": null}}, {"review": {"des": "I've had chicken and waffles all over America.<br><br>I've never had chicken IN waffles...<br><br>Till Batter and Berries.<br><br>I'll admit, the only reason I knew about this place is by seeing it on TV (travel channel). But if it's on TV they must be doing something right?<br><br>We showed up at 2pm. This place was STILL SMASHED. 80 minute wait (sad face). But they'll take your number and text you when your table's ready (or almost ready), and there's a cool knick knack shop up the street and a starbucks like a 6 minute walk back towards the metro (which is what we did). 40 minutes later we got the text and made our way back to the restaurant and were seated just before 3pm.<br><br>Then the feets started getting put in the food.<br><br>I had the Goof which is herbed-breaded chicken breast fried on the plate, then pieces of that same chicken are thrown in SWEET POTATO waffle batter and cooked up golden brown. For those of you that are into special blend hot sauce and all that, it comes covered with it (I asked for it on the side cause I'm not all that into hot sauce - tell me about myself later.<br><br>My partner had the day's special, a sirloin hash that was marinated/braised in a berry/coffee stout blend from the BAR ACROSS THE STREET, then fried up with potatoes and other veggies and served under an egg cooked to order.<br><br>This is one of those food expereinces where what you see on TV and what you form in your minds eye meets reality and they MATCH.<br><br>Both our entrees were absolutely delicious and the service was amazing to boot.<br><br>If you're in Chicago, carve out a few hours in your day and head over to Batter and Berries. You will be SO GLAD you did.<br><br>When I hit Chicago, you better believe I'll be back. And trying that French Toast Flight I'm hearing about (what??? a flight of French Toast??? Yup!).", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/o7NbnCWqONNiLIt2IreJyQ/348s.jpg", "caption": "Holy cow - short rib special and Chicken/waffles - slap yo momma goodness!"}]}}, {"review": {"des": "Brunch is probably my favorite meal, so I'm always looking to try a new brunch spot. I was visiting a friend in the city and we came here on Sunday morning for brunch by recommendation of a few other people. We got here around 11 and waited over an hour for a table. Because I knew the restaurant was busy and Sunday brunch is a huge deal, I didn't mind waiting. After we were seated our server was personable, funny and entertained our section with riddles and corny jokes. The food was impeccable! Well worth the wait. I had the Brisket Hash which was slow cooked in a coffee rub. Food was so good I could cry. <br>I also appreciated that the manager came by to talk with us and tell us more about the restaurant. This place has great service, good atmosphere and even better food. If you don't mind a wait, Batter & Berries is the place to go for brunch.", "pics": null}}, {"review": {"des": "I had such high expectations for this place!! The French toast flight is worth it - get it as an appetizer and share amongst your friends. The blueberry and caramel ones are decadent yet light (I know.. it doesn't make sense to me either). I ordered the Delilah sandwich and was excited to try it! After 40 minutes of waiting they told me they didn't have the ingredients to make the sandwich. So I ordered something new and had to wait another 20 minutes for that sandwich. It was decent- but not great. They did apologize profusely and gave me a 10% discount and a free sandwich. I appreciated the generous gesture but was still meh about the whole experience.", "pics": null}}, {"review": {"des": "Best French Toast On The planet.. On my mama!!<br><br>Chipotle Omelette was extremely good, highly recommend!", "pics": null}}, {"review": {"des": "Out the gate....This will be a repeat stop for sure! Like most places in the area parking is not the best you have to find street parking and pay the meter. Let's get into it when i arrived the place was packed!! With a very diverse crowd which was cool! Even with business popping the staff was very impressive and worked as a very well trained team. My food arrived surprisingly fast, hot and cooked perfect. I have been to restaurants considerably less busy and didn't get this tentative service. The ribeye omlette was amazing.... tender cuts of ribeye cooked medium exactly as i ordered. The omlette was fluffy and everything seasoned just right. My mushrooms were a little overcooked but not terribly. They also make a meaaan fluffy pancake with a hint of lemon flavor with fresh fruit.This place has really got it together i can't wait to explore the menu more!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/55iWly_VUC94nbSnOyRNPA/168s.jpg", "caption": "Fluffiness!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UDz8D1UtcQxLJZIW-SWxqQ/168s.jpg", "caption": "The ribeye omlette"}]}}, {"review": {"des": "First time at Batter and Berries and absolutely loved the Toast Flight! The toast of the day was Sangria and it was just perfect. I ordered the short rib hash glazed in some type of chocolate and bourbon sauce from a local brewery, and it was sweet..Not too sweet but sweet enough to tell that it wasn't a perfect combination for this particular plate. However, the ribs were cooked to where the meat just melts in your mouth. Service was nice and personable. The exec chef and GM do a very good job in making sure you feel at home. The Chef definitely has a sense of humor (he probably should do stand-up on the side). Jeffery was also great. I will be coming back and trying a different plate! <br><br>Tip: Expect to wait 1-1.5hrs even during non peak hours. We left at closing time and there were still people dining in.", "pics": null}}, {"review": {"des": "There's absolutely nothing I can say about Batter & Berries hat hasn't been said by others so I'll be brief. This was my second visit to Batter & Berries. I literally came from NYC to have this stuff. <br><br>Be prepared for a wait. Nothing insane but a 20-45 minute wait on weekdays. <br><br>Service is phenomenal. The waitstaff is beyond friendly and courteous. Their patience and thorough in their explanation of menu items. Also funny. <br><br>Food. I think about the French Toast Flight every morning. Every. Single. Morning. Every fruit, every taste. Every delight was just right. I WANT IT IN MY MOUTH NOW!!!!<br><br>If I had the money I'd give it to them so they could open an NYC location. It would literally have to be 24/7 because the place would stay packed. <br><br>I wish I had more stars to give because wowowowowowowowow", "pics": null}}, {"review": {"des": "This is a solid breakfast place in Chicago. We were fortunate enough to beat the crowd by getting there by 8:30 on a Sunday morning. <br><br>We were seated within 10 min of walking in with our party (entire party must be present). We were greeted immediately with our drink orders. Coffee! They were great with refilling our coffee and waters. Our server made recommendations with the specials and did not disappoint. Everything was deliciois and filled with great flavor. <br><br>We ordered the specials (lemon lobster omelette, salmon croquettes), biscuit and gravy, chicken and waffle, French toast flight, and a side of bacon. (Between the four of us) LOL. <br><br>The fried chicken was juicy and moist. It also came with a great hot sauce. Yummy. The waffle also had chicken inside the waffle. Crazy! I've never seen that before! <br><br>The lobster omelette was so tasty and came with a surprising amount of lobster. I would come back just for this!<br><br>Overall, really enjoyed this place and would come back if I'm back in Chicago.", "pics": null}}, {"review": {"des": "The first time I tried to eat here I was told that the wait would be an hour and a half to an hour and forty-five minutes!  My friends and I went somewhere else.  I decided to give it another try and was told it would be an 80 minute wait.  This time I decided to wait even though I was starving!  I'd heard so many good thing about this restaurant.  The wait time was accurate, I kept hoping that it was worth the wait.  IT WAS!  My friend and I shared the French Toast Flight, Cajun Shrimp Omelette which was the day's special, and house made pork sausage.  The food arrived piping hot!  The French Toast was incredible!  The lemon was my favorite, wow!  I'd go back just for the flight!  The pork sausage tasted like the breakfast sausage of my childhood, it was delicious bringing back good food memories!  I guess it's a good idea to try the specials because the Cajun Shrimp Omelette was a winner and those cheesy hash browns were a great accompaniment!  Make sure you try those, you can get it as a side.  This restaurant totally lived up to the hype and will be a regular spot for my family and I.  My only complaint was that that service was a bit slow...took awhile for the waitress to come for our order and then the kitchen was backed up and our food took an awful long time; it happens.  Other than that, everything was amazing and all of the staff was beyond friendly.  It's BYOB, next time I'll bring champagne for mimosas!  Also, the prices were good....I highly recommend! PS-There's no room inside to wait for your table, Heritage Coffee shop is up the street, I suggest taking a stroll and having a cup of coffee there while waiting for your table.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/96VOnx3H1n_v1FQbFqazWw/348s.jpg", "caption": "Special: Cajun Shrimp Omelette"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uSBNAQnFUMJlDAMejjiejQ/168s.jpg", "caption": "French Toast Flight"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TgJ8v8LjNocpDd_WMdcVFQ/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Be forewarned y'all, the place is absolutely PACKED. You will end up having to wait a hot minute for a table, but the wait is sooo worth it! They quoted my party of 6 two hours for the next table- it wasn't a problem since we were visiting Chicago, so we got to walk around and explore some. They send you text messages to know when your table will be ready soon and give you a decent amount of heads up before you have to be back at the restaurant. <br><br>Our server, Tim, sent out a french toast flight on the house after we told him of my engagement. My tastebuds were sent straight to heaven as soon as I had a bite of the key lime french toast! The other flavors (caramel, lemon, blueberry, & strawberry, though I think they might rotate some of their flavors) were fantastic. None of them tasted too much like eggs and we didn't have to add any syrup to them at all.<br><br>Coincidentally, I ordered the lemon french toast. They were nice and light, though I did need to add syrup to the full order since they were slightly more dry than the flight. Oddly enough, we had to request syrup, but it wasn't too big of a deal. My feyonce had the biscuits and gravy- so good! Not too greasy/heavy and the gravy was  nicely savory.<br><br>Only part I didn't enjoy was the noise level. I could barely hear a word our server or anyone else at the table was saying.. The restaurant could benefit from some soundproofing for sure.. but the service and that darn key lime french toast kept it from dropping below 5 stars.", "pics": null}}, {"review": {"des": "Anyone who does not give 5 stars or more is seriously a questionable soul. This place was amazing , the food, ambience , and service was like no other. If your lucky you will be served by Tusimi. Greatest server ever, riddles and all. Crab cakes Benedict , chipotle shrimp omelet , and French toast flight is superb !!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bgdV9ET5G3YAXkgZm0acTw/348s.jpg", "caption": "Fun at Berries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rwIk-WPhT4liCIY3k-s5vA/168s.jpg", "caption": "Chipotle Shrimp Omlette"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Hwxp0ktklcz-qbzEiRhhbQ/168s.jpg", "caption": "French toast flight"}]}}, {"review": {"des": "Of course the food was to die for! Left me more than stuffed. I don't think I actually finished eating. The service was good.", "pics": null}}, {"review": {"des": "BYOB with no corkage fee! Delicious French toast! What more could you ask for. <br><br>Food:<br><br>Flight of French Toast: 5/5. Delicious! The homemade butter that comes with it was amazing. <br><br>Cluck N Gayfre: 5/5. Such juicy fried chicken on top of sweet potato waffle. <br><br>Get the cranberry OJ to pair with your prosecco :)<br><br>Ambiance: We arrived at 8am prior to opening on a Monday. Come 8:30am... the place was almost packed!!! Crazy! I can't imagine what it's like on a weekend. <br><br>Service: Very attentive and so pleasant!<br><br>Great place for a byob brunch.<br><br>Edit:// been here post night shift 3x in a month. Highly recommend.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xUgwBPvLNlGRgNE1iDKkEw/348s.jpg", "caption": "Flight of French Toast!"}]}}, {"review": {"des": "The food is decent. But after waiting almost two hours to be seated as a party, we were split up. When asked why, was told that they: just wanted to get us in. We were a party of 9 and visiting from two separate states. While waiting to order, the large table opened up. This is the same large table that my wife and I were seated at almost a year ago and then asked to move for a larger party. <br><br>Unacceptable!<br><br>We were regulars until we moved to Florida. Will consider other BOBs in the future. It was fun while it lasted.", "pics": null}}, {"review": {"des": "While visiting Chicago, I came here with by way of IG recommendations. I arrived at 8:20 and the place was packed! Luckily it was a party of 2 and we were able to be seated immediately. Service was great and engaging, food was delicious and it was a warm family friendly vibe. Thoroughly impressed. Will return in the summer.", "pics": null}}, {"review": {"des": "My first time at Batter & Berries! We were a group of 5 people, we arrived there at 11am and the estimated wait was for 2 hours. And it literally took two hours!! We went to Starbucks and waited until they sent us a message - so that was nice.<br><br>It was an organized chaos since today is Sunday and yesterday was St Patrick's Day. Next time I'd go earlier or during the weekday.<br><br>The food was delicious, everyone loved their order. So, there is no need of more pictures of the French toast (they were GOOD but not that warm).<br><br>ATTENTION:<br>1. The OJ was $4.50! You read that right: almost $5 for a glass of orange juice. Yikes!<br><br>2. The kind of cheese you choose for your eggs will cost you different prices (makes sense, but at the moment the waiter is giving you the options you forget that). The Kraft American cheese was $0.65 when the Gouda cheese was $3! YIKES!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LSebSBBcrFN4DO9NgCqYjw/168s.jpg", "caption": "Chicken wrap and sweet potato fries - just ok"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HioeGb6X-O_LBwB2cspYEQ/168s.jpg", "caption": "Sample French Toast - it was good but not warm enough"}]}}, {"review": {"des": "Come early.  It gets crowded pretty quickly.  The crowd is a testament to how delicious their food is. There is a perfect ebb and flow to the small place. But be prepared to bump shoulders and make a new friend. <br><br>My family and I come here often and we're never disappointed.  The staff is friendly and the service is prompt. The french toast flight or the super flight are must haves. No syrup needed ~  the fresh fruit toppings and homemade maple butter have that covered. Their homemade chicken sausage is to die for (I don't eat pork but I'm told the homemade pork sausage is good too). They also serve gourmet tea. The \"Love\" flavor is perfect.<br><br>Because I hate to leave any disparaging comments about this beloved breakfast spot it pains me to bring it up but I want to share: Don't try the chicken and waffle dish.  Unless outrageously thick dry sweet potato flavored waffles is your thing.  The accompanying piece of Fried chicken breast is rather amazing though.<br><br>Highly recommended this place to others!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Xg1Epj6aQ1C6xOwvzXAMZw/348s.jpg", "caption": "Chocolate chip pancakes. If you like sweet you're going to live love these. My five year old only ate one bite."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/D-ViZUGOhPA2Vq4_7P-jug/168s.jpg", "caption": "Ready to drive into her Super Flight"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cL-YwySFS6qO0V4P7eoisA/168s.jpg", "caption": "The Jambalaya Executive"}]}}, {"review": {"des": "Originally I gave my favorite breakfast place a 5-star rating. I thought nothing would be different today when I ate there with my son, but boy was I wrong. The server was great but the service or should I say food wasn't. The reason why I'm saying this is because I ordered one of their specials. It was the egg white with lobster and some kind of sauce that I just didn't agree with. Most restaurants when you go there and you don't like the food they take it back no questions asked and make sure that you get your new meal within moments. This was not the case. Again, the server was nice she was apologetic and she quickly took the food away and put in my new order. The kitchen took it upon themselves to make me wait 45 minutes before sending my food. My son had eaten his food already and was ready to go at that point and so was I. I had an appointment and I explained it to my server and she said she was waiting by the kitchen to make sure that they give her the food right away and she was. When the kitchen finally gave her my food 45 minutes later the chicken sausages that I ordered were so small that they should not have been plated. I pointed it out to the server and she agreed but I was still charged for them. I can't blame the server because she did her job. I gave her a nice tip but man was I angry. It's not many times that I would give food back to the kitchen but I thought that this place of all places would make an exception to the rule and still treat you fairly. All this time that I've been coming here and all the money I've spent with my son eating breakfast here and I get this kind of treatment. It makes me never want to go there again.", "pics": null}}, {"review": {"des": "I wasn't wowed but that's probably because I didn't know enough before I showed it. For starters this place is BYOB so I could've brought my own booze! Secondly, always order the French toast. I got the steak meal & it was just ok. Rib eye doesn't make for a good breakfast steak - dutifully noted! Barely tasted the onions and the mushrooms didn't wow me. Overall disappointed needless to say I expect better next time. Oh and really long waits.... I went alone and had a 60 min wait!", "pics": null}}]}