{"name": "beatrix-streeterville-chicago", "reviews": [{"review": {"des": "In town from far away SEATTLE staying at the oddly named Hyatt \"Centric\"?  My sister was eager for me to meet her new boyfriend and show me a good time in her home town. <br><br>How about Beatrix?<br><br>Right across the street from the Hyatt. Delightful in every way. I can't remember what I ate but it was upscale comfort food and done just right. When I lived in Dallas we had the Black Eyed Pea (are those still around?).  This was an upscale version of that. <br><br>I do recall our waitress who was great. It really makes a difference in my dining experience when the server appears to be enjoying their job. She was great and I left her a massive tip. (In fact she may have retired due to my largesse so sorry for elevating her out of the Server Workforce). <br><br>Thumbs up for Beatrix!  It will be on my Go To list for future ORD trips.", "pics": null}}, {"review": {"des": "We recently popped into their Northwestern campus location between a pair of doctor's appointments for a quick breakfast - we were immediately seated, offered coffee and juice, including a $6.50 pineapple/pear juice that was very refreshing. <br><br>Service was stellar at the \"sit-down\" side of the restaurant, and traffic was hopping on the \"to-go\" market side as well. The Pot Roast and Egg sandwich ($8.95) sounded a little strange, but was amazingly tender and very flavorful. The Cauliflower Grits ($13.95) were the surprise hit at the table - creamy corn grits with roasted cauliflower florets and crispy shaved Brussels sprouts with two perfectly frizzled eggs resting on top. <br><br>Everything was very flavorful, service was spot-on and the location was super convenient. Add a small fresh bowl of seasonal fruit and our breakfast topped out at $38, before the tip.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LL7LIf7IFEU9WI9BrQidNg/348s.jpg", "caption": "Quirky Cauliflower Grits ($13.95) - creamy grits, roasted cauliflower florets, crispy shaved sprouts and two perfectly fried eggs. Perfect!"}]}}, {"review": {"des": "A big pricey, but I loved the brunch menu!<br>It was on the corner of my hotel so didn't have to walk through traffic. <br>There are many vegetarian options on the menu and the staff was willing to change or replace an ingredient if allergic or dietary reasons.<br><br>I ordered the STEAK CHIMICHURRI & EGGS which consist of grilled shishito peppers, eggs your way, golden hash browns. I didn't see the peppers, I'm hoping that it was chopped up. The dish was what I expected full of flavor and I left happy. The crispy kale salad also looked delicious but I decided not to order that.", "pics": null}}, {"review": {"des": "Stopped by for an early lunch before a day full of adventure. This is a quaint spot with a cute bakery/cafe in the corner for quick eats inside a sit-down restaurant. Full bar is available.<br><br>Most ppl who come here are dressed in business suits/clothes. Although, I did see a few tables including myself in casual clothes.<br><br>Food:<br><br>1)Cesar Salad with Salmon-4 stars. Interestingly, the Cesar salad here comes with arugula mixed into the romaine(nice touch), it also comes with capers(love!), croutons, thin slices of parmesan, and the ceasar dressing was more of a vinagrette. Diverging from the traditional Ceasar salad, not what I was expecting but still great tasting. I added grilled salmon for an extra five dollars. Salmon was tasty but on the smaller side. Total cost for this salad was about $18.<br><br>2)Prime Burger with bacon- 4.5 stars. This is a hefty and quite delicious burger. Comes with a thicker meat patty, cooked medium, meat was still slightly pink and oh so juicy, topped with two slices of bacon and cheese. Also came with yummy fries and a weird, pickled..mixed vegetables..relish type thing on the side that I didn't care for. I assume it was to cut the fat from the burger to keep you going, but a nice reg pickle would have sufficed.<br><br>Double espresso- strong, acidic, eye opening, goooood!<br><br>Orange juice- FRESHLY squeezed, low in pulp, and deliciously refreshing.<br><br>Bathrooms were impressively clean and modernly designed that I had to take pictures, don't worry, I was the only person in there! lol<br><br>All in all, this is a nice lunch spot. Slightly on the pricer end for what you're ordering but quality of the food is there.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JCCVs2iqicDbf9kYT82Alg/348s.jpg", "caption": "Bathroom sinko"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Hmlsk2CymzYmyULriU2WVw/168s.jpg", "caption": "Prime Burger with bacon-yum!....fries-yum!...weird pickled mixed vegetable concoction-pass!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TFfajJCcWn6J7cf-s5KIDQ/168s.jpg", "caption": "Bakery is in the corner if you're in a rush."}]}}, {"review": {"des": "We ate breakfast at Beatrix based on the recommendation of our friends. They told us two things: 1) This restaurant is basically in a hospital. 2) It's a Lettuce Entertain You restaurant. So clearly, I had high expectations, and I was not let down.<br><br>The space itself is actually larger than it looks from the street. But it is lovely. Modern and warm, with wood interior but still managing to feel open and spacious. It really is a very nice space to eat a meal in. The breakfast menu was not huge but offered plenty of interesting options. As someone who is not a huge fan of spicy food, I was a little challenged but was easily able to order what I wanted with no spice.<br><br>I started with a fresh-squeezed orange juice, which was just fine and fit the bill as expected. Then I got the avocado benedict, hold the jalepenos. I was surprised (in a good way) when my benedict came to the table. It's basically an eggs benedict constructed sans english muffin. Instead the eggs are nested inside two halves of an avocado. Since I love avocado, poached eggs and hollandaise sauce pretty much more than life itself, this was essentially perfect. The eggs were expertly poached, the hollandaise was creamy and very good. My husband got the belgian waffles, which were cute and kind of coaster sized, and our friend got the lemon pancakes, which probably would have been my second choice and were lovely. We also got the candied bacon, which you should order just because it's bacon (pro tip: ask for crispy).<br><br>Very nice meal in a very nice restaurant. Recommend.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Bidjy6p2Ot-K_lf3j-Ae3Q/348s.jpg", "caption": "House - Made Belgian Style Waffle"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/piK8Fmi08ifwTbIPR0xycQ/168s.jpg", "caption": "Avocado Benedict without jalapeños"}]}}, {"review": {"des": "Highly recommend the Blueberry and Basil Smash fresh-squeezed juice--unique and delicious (no added sugar, simply fresh-squeezed juice)--and if you're so inclined, a fellow diner spiked hers and thoroughly enjoyed!<br><br>Beatrix Streeterville was an easy walk from the Sheraton Chicago Hotel & Towers, perfect for a group of conference attendees to gather at for an informal dinner. We shared two appetizers: Kung Pao Brussels Sprouts and Ahi Tuna Crudo (both delicious); four mains: the Szechuan Chicken, Housemade Ricotta Ravioli w/Butternut Squash (my favorite!), Slow-Braised Short Rib, and Chili & Chocolate Glazed Salmon; and two desserts: Oh My! Caramel Pie (finally a rival for Barbuzzo's salted caramel budino!) and the Tall, Dark & Handsome Chocolate Cake. Everything was terrific and we loved that our server was a Philly-transplant! Would definitely return.", "pics": null}}, {"review": {"des": "Omg I'm drooling as I'm eating these sandwiches they are so great.<br>My person favorite is the egg sandwich because I was in the mood for no meat, and the flavor of sweet sour and spicy kick just hits the right spot. I don't particularly like the sauce that comes with it since it's a little sour . <br>The pot roast sandwich just feels like you're at home, super comfort food. <br>The portion of sandwich is pretty small if you're hungry.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aWypF3r_UKMVL0TtaUcplw/168s.jpg", "caption": "Pepper & Egg White Sandwich"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UYOnxnH1L_I-T904HlqUbQ/168s.jpg", "caption": "Braised Pot Roast & Egg Sandwich"}]}}, {"review": {"des": "Good location, nice venue, friendly service but very average food. Looks great online menu looks good but doesn't deliver. Brussel sprouts so salty they are inedible. Pricing is okay.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/s6MzyPtgEeVFnfvOFNO9SQ/348s.jpg", "caption": "Bar"}]}}, {"review": {"des": "What a great place for brunch!!! It was packed but we bypassed the line with reservations. Yeah, reservations for breakfast is a new thing for me too, but definitely the way to go at Beatrix. I love my some coffee and this place delivers for sure. Only wish they just left a carafe of it on your table but service was pretty good so I can't complain. Good for groups and kids for sure. Not a quiet place but not terribly loud- I was able to have a normal conversation. Great place for gluten free options!!! Most of the menu is naturally gluten free and the fresh GF bread was pretty good! Try this place out!! Another successful Lettuce Entertain you restaurant.", "pics": null}}, {"review": {"des": "Beatrix was so accommodating to our group including a small child.  New were given information on how long the wait was and quickly seated within the time allotted.  Service was very friendly and helpful with the menu options.  Brunch has some amazing options!<br><br>I think I tried most everything, but I would say that generally, food was fresh and well prepared.  If you go with the chilaquiles bar, I'd make sure to eat before the end of brunch as some of the food runs out.  I'm sure they would refill if needed, but we didn't ask.  <br><br>The juices were delicious - I'm sure they'd be great as a mimosa type beverage - though we had the juices straight up.<br><br>Reasonable pricing and a nice, friendly, cozy spot in the area.  It gets very busy, so reservations would be recommended, but it's also a nice area to walk around in if you have time to spare.<br><br>Food - 5<br>Bathrooms - 5<br>Service - 5<br>Value - 4<br>Atmosphere - 5", "pics": null}}, {"review": {"des": "As you can see I have been here before for both brunch and lunch. I returned here for brunch at around 11am to redeem my $25 credit, which I received from the restaurant manager from a prior visit. My party of three were seated at our table located near the kitchen entrance.<br><br>I started with my margarita for $12 followed by my blue mimosa for $8.95. I also enjoyed my poke bowl for $16.95. I like the casual nature of this place. My total bill less gratuities was $98 including my $25 credit.<br><br>Jon C. took care of our table needs in an effective manner. I will continue to return to this location or one of their other locations for brunch or lunch. And of course I always enjoy receiving more Lettuce Eats points for my future redemption.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cco5ysU_Z8SCvUq5l8bd2A/348s.jpg", "caption": "My jalapeño margarita"}]}}, {"review": {"des": "Had the avocado Benedict which was very different than any other Benedict. No English muffin here, just 2 halves of a really large avocado, a poached egg on each, tomatillo green salsa, pickled jalapeños, and some tortilla strips. So good!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Afb-YGW4RDUWJQpP3aomfg/348s.jpg", "caption": "Avocado Benedict. So good!! And much healthier than normal Benedict"}]}}, {"review": {"des": "Love this place! I was eating at Beatrix on a Monday morning and the place was actually very popular. They have pastries, coffee, bar, breakfast items, etc. etc. The service was really nice. I ordered a latte and a chia cereal bowl for my brunch and they were both great. I wish I could try more of the things on the menu as all of them looked so good. Btw, they have free WiFi too! I would definitely recommend it to everyone! Hope I could come back and eat again!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/d8INWkStz5r2OUF6gCKahQ/348s.jpg", "caption": "The entrance"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MUk8HCC94Pjjv3c6gJYc8A/168s.jpg", "caption": "Bar"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6MYyBdVh2t4LxZj4QYIfdA/168s.jpg", "caption": "Latte"}]}}, {"review": {"des": "I was super excited to check out this place after hearing great reviews! I made a reservation for brunch at 10:15AM and there was a lot of openings for reservations at this time the day before. The ambiance of the restaurant is soo cute. The restaurant is a lot bigger than expected and was pretty busy. They have a cute bakery counter and coffee station when you walk in.<br><br>We waited a bit for our server to greet us but the manager welcomed us, took our drink orders, and walked us through the specials. She was extremely friendly and explained the Lettuce Eats app (which I highly recommend getting). <br><br>They have a medium sized selection of food. The breakfast items are non-traditional, so it took me awhile to decide what to order. I thought the menu was fine but nothing stood out to me right away of what I should get. Our waiter came after 5 min and took our order. <br><br>I ordered the cauliflower grits and it was tasty. It was definitely a plate I would rather have as a side but it was good. My boyfriend had the chicken tinga and thought it was decent. I would give this establishment a 3.5 mostly for food selection. The manager was extremely friendly but the waiter was busy. This would be a breakfast spot I would go to every once in awhile. <br><br>Ambiance - 5 <br>Staff/Friendliness - 4 <br>Food Quality - 3.5<br>Food selection 3", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NC9YFWAe3ZxbeDwCfiSv8A/348s.jpg", "caption": "Cauliflower Grits with a side of chicken sausage."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/q4yadta24Ywl_7qB0_kfNg/168s.jpg", "caption": "Cute selection of goodies near the front"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/z-dPQ6kkoHVR2fnRuE5fpg/168s.jpg", "caption": "Chicken Tinga"}]}}, {"review": {"des": "OMG why would anyone go to Starschmuck's with this place half a block away?<br><br>This place is classy and has it all. A coffee bar with out of this world baked goods, an express lunch bar, and a dine in restaurant.<br><br>I had the honey butter cinnamon roll and it almost knocked me out of my chair it was so good! I never really have high hopes for pastries sitting behind the glass at a coffee joint, but this tasted like it was fresh from the bakery at 6 PM. Flaky, soft, buttery with an AMAZING fluffy, thick cream cheese frosting. Holy cow!<br><br>Turmeric chai tea latte is deep, smoky and flavorful. Tastes REAL. Not sure how they make it but it doesn't taste like it was poured out of a mass produced wax paper carton. <br><br>I wouldn't consider it cheap, but it is on par with Starschmuck's and, by far, more superior in quality. <br><br>I can't comment on anything else yet, but I will be back to try more.<br><br>I like their schmancy lounge area. It is very chill and low key and even though swankier joints usually make me feel uncomfortable, I felt quite at ease here.<br><br>I also loved that the crew at the coffee bar was dressed up in costume on Halloween as Mario, Luigi and Yoshi. AWESOME.<br><br>Would give 6 stars if I could!", "pics": null}}, {"review": {"des": "I'm so glad I came to this place for breakfast by myself. I truly enjoyed my pancakes and I have been craving for really good ones that are worth the calories and this place truly delivered that. The pancakes were so light and fluffy. It was amazing!!!<br>Had side of scrambled eggs and chicken sausage. <br>Worth every bite and penny.  Will come back here again. Trust!!", "pics": null}}, {"review": {"des": "Was treated out by a vendor for dinner after the convention at McCormick Place. First time here and because of the reservation, we were seated quickly. Located in downtown Chicago, definitely a nice restaurant. Not too fancy but the lighting and the location made it seem like an ideal location. It was nice to relax in a dimly lit restaurant like this where the mood felt relaxing.<br><br>As a group, we ordered their Kung Pao Brussels Sprouts and Kennebec Fries. Great starters by the way especially the brussels sprouts. Delicious and probably one of the better brussels sprouts I've had. The fries were also great as it's easy to share among a group. <br><br>Main dish I went with their Skirt Steak Chimichurri. Nicely grilled steak with compliments of fries. The chimichurri sauce on the steak was great. Overall great experience here especially with the nice customer service. Definitely would come back next time I'm in the area.", "pics": null}}, {"review": {"des": "The spicy chicken tinga was extremely flavorful. The latte was made perfectly. The pot roast and egg was ok. I will definitely be back to try the pancakes that looked delicious. We will be back.", "pics": null}}, {"review": {"des": "Well, Chicago, all I can say as a visitor from your little sister to the north (Milwaukee) is WHAT DO YOU MEAN YOU DONT SERVE COCKTAILS UNTIL 10AM. But that aside, this place was wonderful.<br><br>My husband got the chicken tinga, I got the enchiladas (absolutely smothered in cheese) and when 10 rolled around he had mimosas (one tradish, one \"blue\") and I had the boozy banana joe. Food was great, portions were bigger than needed and priced well, and service was attentive but not overbearing.<br><br>You'll be on my short list next time I return to the windy city!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LvRJcKixBNLeeJtix_0Oxw/168s.jpg", "caption": "Chicken tinga"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2RoT9vhkKLC1rLZycXJtjQ/168s.jpg", "caption": "Enchiladas"}]}}, {"review": {"des": "Lovely spot, great service and awesome food. <br>Started with meatballs and Brussels and they were both good but a bit saucy! <br>Then my main was the chicken kabobs & we ordered the burger as well. <br>Kabob dish was filling and tasty would order again! Might try different sides but was overall a great experience", "pics": null}}, {"review": {"des": "I ordered turkey chops with burrata as an app for dinner on my first of several nights in the city. Was really satisfied with my meal from both taste and portion-size perspectives. <br><br>Burrata - not pretty in the photo as it was takeout but I'm sure it would be presented really nicely in the store. Pesto, tomato and cheese is a classic, fulfilling combination and I liked it very much. I'm not the biggest fan of sourdough but I thought it balanced the punchlines of the cheese and pesto very elegantly. A win. Would order again! <br><br>Turkey - not the most delicious meat potatoes dish by any means but much healthier than most and a solid choice if you're craving something like a steak and French fries but want to make a better choice for your health..that's why I ordered it, at least! I liked the turkey - not overly seasoned, quite light, very fulfilling as you are given three chops in a standard portion. Salad was not that tasty but I'm not a salad fan anyways - besides, it made me feel better after guiltily indulging in the soft and fluffy sweet potato mash! I liked that you would order sweet potatoes instead of normal ones as mashed potatoes are a favourite dish of mine yet I often fret over the significant calories / butter intake involved in the typical variety. This one was still reach and creamy but not over the top. Good compromise! <br><br>Overall, it was a comforting and wholesome meal. Would be keen to explore the rest of the menu!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EZ1qBnjnJ70dORzPrjkBQw/168s.jpg", "caption": "Looks messy but the burrata is yummy"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WFybl6HhXQf0R2ysWoC8sg/168s.jpg", "caption": "Turkey chops - great healthy option"}]}}, {"review": {"des": "Menu: super imaginative, fresh ingredients, a little pricey, probably the best turkey bacon I've had in my life.<br><br>Drinks: 3 kinds of mimosas: orange, red and blue. I had the blue one which (if I can remember correctly was blueberry, pomegranate and basil) and my brunch partner had red (I wasn't paying attention but something something raspberry).<br><br>Experience: I made rezzies using Open Table. That process was great, got a time that worked and was able to synch to my calendar, everything was perfect. However, when we got to the location I was super disappointed at our table. It was the first table 2 or 3 feet from the hostess stand and 6 to 8 feet from the front door. I expected that undesirable tables were left for walkins. After working in restaurants/F&B for almost 20 years, I just assumed this was common practice everywhere.<br><br>Also, the location of the Beatrix is in Northwestern/Hotel central. Lots of families (with entitled toddlers who are clearly shown no boundaries at home) and lots and lots of takeout orders (which I would have not noticed had our table not been in the very front of the restaurant). I would definitely visit a Beatrix again, but probably in River North.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Fm2_WbfwoRGDqY-Zid_zFQ/348s.jpg", "caption": "Pineapple Jalapeno Margarita - not $12 worthy, but still makes for a tasty breakfast!"}]}}, {"review": {"des": "This place is packed! But we got seated fairly quickly. Great service here: super friendly and accommodating!<br><br>My fiance got his burger which is ginormous and I got my lemon pancakes. The lemon pancakes were so moist and fluffy. Very flavorful but it was so sweet. I only ate half of the dish. <br><br>I took a bite of the burger. It's pretty standard. They layer it with flavor so it's pretty good.", "pics": null}}, {"review": {"des": "Loved the poached eggs with quinoa just wish the serving size was bigger. Also really enjoyed the tea", "pics": null}}, {"review": {"des": "Went there for brunch. We had our table reserved but we got our table 10 mins early which helped our hungry souls. The server was super sweet and explained the menu thoroughly. <br>We started with the juices which were a delight. For food we went with chicken tinga, green enchiladas and pepper egg white sandwich. Everything was delicious. <br>They have an amazing espresso bar and given our love for coffee we ordered 3 drinks. My fav was cafe freddo. If you love cinnamon and coffee then this is your drink. I am definitely ending my trip with another visit to this place. Oh and a must try is their pecan french toast. Good lord! It was the best French toast ever. <br>The highlight for me was the service. Our food came 5-10 mins late which we didn't even notice, so they removed the coffees from the bill. A great gesture!", "pics": null}}, {"review": {"des": "Atmosphere: My husband and I came here on a Monday morning before our flight home and it was a great experience. We had reservations and were seated promptly at a booth near the kitchen. The restaurant was quiet since it was a Monday morning and we were served quickly. <br><br>Service: Our waiter was friendly and attentive. No complaints here. <br><br>Food and drinks: I started with the banana joe and ordered the poached eggs over quinoa cakes with a side of their chicken sausage, and my husband ordered the eggs your way with a side of the avocado toast. The banana joe was delicious, the perfect amount of sweetness and feels healthy; the quinoa cakes with poached eggs was light and tasty, I enjoyed it a lot but my only complaint was the tomato sauce mixed with the lemony egg mayo was a little tart; the chicken sausage was to die for; and my husband enjoyed everything about his meal!", "pics": null}}, {"review": {"des": "Get the cauliflower grits and egg! <br>Really really good. <br><br>Only waited for 5 minutes here for a Sunday brunch. <br><br>The ambience was nice! <br>Service was a little on the slow side, but still nice. <br><br>I would come back here for the exact same meal that I had. <br><br>This restaurant is easy to get to as well. <br>I'm not sure about parking, as I took a Lyft to get here.", "pics": null}}, {"review": {"des": "I highly recommend the Eggs Your Way with salmon. It's super satisfying and you don't feel any guilt lol. My fiancé had the cauliflower rice bowl with a sunny side up egg and loved that too! <br>Our server (Chelsea) was amazing (by far the best that we've had during our trip). They also got us a reservation the morning of and seated us right on time.", "pics": null}}, {"review": {"des": "Top Flight!!!! Beautiful location, along with ambience! Very spacious with iconic photos on the wall of rock legends and figures. The staff is customer friendly and appears to always be happy! Along with bar and grill, they have a food store in the inside where you can build your own salad and hot foods along with cakes and desserts! Forwards the food, I had the cauliflower grits w/ Brussel sprouts, and eggs whites w/ a side of Salmon. The dish was delicious, prepared well w/ the right herbs and spices on top!!! I also had two glasses of California wine & for dessert we shared the chocolate mousse w/ whip cream! I will surely be back! Neo-Soul Rockstar checking out!!!!", "pics": null}}, {"review": {"des": "I grabbed lunch at Beatrix Streeterville with a friend. I usually go to Bea's Market for takeout but wanted to give the restaurant a try, since it has been a few months since my last visit.<br><br>It was lunch time near the hospital, so it was very busy at the hostess station. As I waited in line, I watched the three staff members assist customers waiting in line to check in and also check customers in that had just walked up to the host desk directly from the door outside. When I was finally assisted, the hostesses were very polite. When I pointed out they might want to assist people waiting in line in order of arrival to the host stand to avoid confusion, they agreed.<br><br>Sharlene, who is ironically the staff trainer at the host stand, stopped by our table a couple of times and even brought over the deviled eggs as a kind gesture. I am so glad she did! I will order them every time I dine at Beatrix! Seriously people - you must try this unique version of an old time staple.<br><br>The room is a warm mix of earth tone colors with a mid-century flair. They pack a ton of seating into the space but keep it very comfortable.<br><br>I will continue to dine at any of the Beatrix restaurants and visit the connected Bea's Market for take away. I might suggest avoiding rush hour times if possible. I'm looking forward to my next meal at any of the Beatrix locations!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-OrMq8X9rjvkX6cegFn-vw/348s.jpg", "caption": "Salted Caramel Pie!!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tOD8fO7qb_KToiqpd6ZsNg/168s.jpg", "caption": "Deviled Eggs with a twist!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hLi0HcgwaP_u3ykNKe6VXw/168s.jpg", "caption": "Turkey, Sweet Potato & Greens Neatloaf"}]}}, {"review": {"des": "The caramel pie is so good! Every time I go I feel like the caramel pie is an absolute must. The consistency is just perfect. Great service and great food!!", "pics": null}}, {"review": {"des": "This place is totally amazing. The food is absolutely delicious. We went for Sunday Brunch. The place was packed, so we waited for about 40 minutes, but it was worth the wait. I had the enchiladas, no way to describe how good they were. My husband had the poached eggs on quinoa, simply amazing. Our niece had the chimichurri steak, so yummy. The fresh juice are out of this world. I totally recommend this restaurant.", "pics": null}}, {"review": {"des": "The menu was a little smaller than I was expecting but the food was good! Came here on a Tuesday afternoon with a friend with a reservation but we were still left waiting for a while before we were helped by anybody at the front stand. I got the prime burger and it was cooked exactly the way that I wanted and I loved all the toppings on it. Pricing is fair considering the quality of the ingredients that they use!<br><br>Service during the actual dining experience was great, so overall a very pleasant time at Beatrix!", "pics": null}}, {"review": {"des": "After a weekend of rich and decadent meals, it was great to have a healthier alternative; such as green juice and quinoa cakes with poached eggs. Initially, I had difficulty trying to decide but our waiter gave us his personal favorites. Most the menu of the is gluten free which is a plus since my husband has Celiac. <br><br>Great food, great service with a chic vibe. Loved it.", "pics": null}}, {"review": {"des": "A great, modernized-looking diner that serves great coffee and breakfast. Came here twice during my recent visit to Chicago and it didn't disappoint. Got the egg white omelet with turkey bacon the first time and cauliflower grits with eggs over-medium the second time. My friend got the lemon pancakes but thought it was too heavy after a few bites - I believed this has more to do with her not being accustomed to eating sweets for breakfasts than it not being good. I really enjoyed the cauliflower grits (roasted cauliflower served on top of grits) because it actually went really well with the creamy grits, fried egg and side order of brown sugar bacon. It was filling, but not too heavy.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/U5B8HGYv8OUon03ZU4PgCQ/168s.jpg", "caption": "Cauliflower grits with eggs over-medium and side of brown sugar bacon"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QX_vujiic0iylS8bbw-63g/168s.jpg", "caption": "Egg white omelet with turkey bacon"}]}}, {"review": {"des": "Brunch at Beatrix was delightful from start to finish!  I made a reservation for 3, didn't have to wait a second for a table, and they didn't bat an eyelash when I wanted to keep my son in his stroller (he was still a little too wobbly for a restaurant high-chair).  The high ceilings allow for a louder environment that isn't deafening, and blocked out my 6-month old's occasional joyous squeals and shrieks.<br><br>What's brunch without mimosas?  At Beatrix, you can choose red (strawberry), blue (I honestly don't remember what blue was), or traditional.  We then shared the lemon pancakes since we wanted a more savory entree.  I've never had such fluffy, creamy pancakes.  The lemon flavor was perfect and added some sunshine to our cloudy spring day.<br><br>My entree was the pot roast egg sandwich.  It got a little messy, but that's what a fork and knife is for!  I had my eggs scrambled, and the white cheddar and jalapeno relish brought out the flavor in the pot roast.<br><br>The portions at Beatrix are ideal.  Don't expect massive portions of diner food.  Every bite tasted like someone really put thought into the menu.  We left happy and full but not overstuffed.<br><br>Service was perfect; not at all overbearing nor aloof.  <br><br>It's also worth noting Beatrix's location.  This is not far off the crowded, tourist-concentrated Michigan Avenue, and a much better find than the overpriced chains in the area.  Ideal for couples, groups of friends, and even if you have a baby in tow!  Not ideal for picky eaters.<br><br>I would love to come back here for brunch or try the dinner menu!", "pics": null}}, {"review": {"des": "Thank GOD this place opened. It has been my godsend, since I work in the hospital and there isn't great food. Their hot bar is better than whole food's hot bar. Like 10x better. They have sushi too! My favorite think is their mac and cheese. I've gone there a few times for brunch too. Everything is absolutely delicious. Thanks for making the chia seed pudding, the blondies, and amazing hot chocolates! Worth the price!", "pics": null}}, {"review": {"des": "My family and I had a relaxing breakfast out on the patio. It was a perfect cool<br>Chicago morning. I loved everything about it and will definitely be back. <br><br>I love their kids menu which has 3 perfect choices for kids (pancakes, waffles, and eggs) and comes with their choice of juice from the adult juice menu.<br><br>My husband tried the pot roast breakfast sandwich which was solid. I had the chia breakfast cereal. It was a hardy portion of chia cereal with yummy fruit. It comes garnished with mint. Here's a tip, tear up the mint in your cereal. It was delicious and I felt energized for the day. It doesn't list just plain coffee on the menu but I was able to order a plain cup of coffee no problem. It was fine. Hubby had a cold nitro coffee. No complaints.<br><br>All in all we all really enjoyed our breakfast. The service was friendly, the food was tasty, and it was a great value.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_MEywKwzmsUY1W6q8etTZg/348s.jpg", "caption": "Chia Cereal Bowl was so yummy!"}]}}, {"review": {"des": "It was the worst! Had to move 3 times. Told something different each time. The raspberry crooton was all dry coconut. The Raspberry square was hard as a rock. The Cinnamon crunch cake was ok kay nut the cinnamon crunch on top was the only good thing. The water was cold.", "pics": null}}, {"review": {"des": "One of my go to locations during my loooong stay in Chicago.<br><br>Food is delicious!<br>Staff is wonderful and accommodating! Shout out to our wonderful waitress Lauren!!<br><br>A meal here is a MUST!<br><br>All dishes on the menu are fresh, flavorful and fulfilling!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KZBiPk6VmTMp3v4Nfq7i4w/348s.jpg", "caption": "Vanilla greek yogurt w/ granola & fruit!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LxZUrYAS7PwwufLE6z_smA/168s.jpg", "caption": "Chicken Tinga!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zLPNuEppF90rIJpmA_3h-A/168s.jpg", "caption": "Real brunch-y on a Thursday!!"}]}}, {"review": {"des": "Love this place! Vibe is so cozy and the chia bowl is seriously to die for. Tastes like a dessert. Coconut milk based magic topped with cinnamon toasted millet and coconut flakes and peach and banana. Coffee is excellent too. My mom loves their blueberry juice!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Vtg-CUYM0Jk1mimWk-qZBA/168s.jpg", "caption": "10-Grain Oatmeal"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZlMKKC8EtEfxKMTIkuZX9w/168s.jpg", "caption": "Chia Cereal Bowl"}]}}, {"review": {"des": "My family was in town for graduation, and I booked reservations here for mother's day brunch for 10 people. They were more than accommodating for the large crowd, given that we were all trying to yell over each other! I ordered the green chili enchiladas, and they were good, but too mild for my taste. I tried some of the lemon pancakes and went to heaven it was so good! Overall, a great brunch spot!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mEruHlfgqyvJkY7Tq3ByQA/348s.jpg", "caption": "green chili enchiladas"}]}}, {"review": {"des": "Had two eggs your way. Pretty good but the hash browns were a bit salty. One of the orders were miscommunicated in regards to cilantro so in a group setting everyone was finished eating until a new dish was delivered", "pics": null}}, {"review": {"des": "A friend and i had just finished a Chicago crime tour and were hungry--more than a snack, but less than a full-blown meal. This spot had great Yelp reviews and wasn't too far a walk off of the main Miracle Mile. I really liked the interior and thought the menu was unique, but wasn't in love with the food as much as I hoped I'd be. <br><br>We loved that the beverage menu included fresh squeezed juices. I had the carrot, apple and ginger snap, which was refreshing and tasted, as it should, fresh and natural. I had the Kung Pao Brussels sprouts. I love sprouts, but the tangy, sticky topping was not my favorite preparation. If these were caramelized, it was lost by the overpowering topping. Will stick to roasted sprouts with garlic and olive oil. I also had the burrata, and while there no such thing as bad burrata, this wasn't particularly memorable. My friend had the tuna crudo and thought it was fine. <br><br>I had such high hopes based on the stellar reviews, which is probably skewing my impression, but the ok menu wasn't helped by a slow seating experience. The restaurant was half full, but apparently we had to wait for a table to open in a particular seating area. It was fewer than ten minutes, but seemed odd given all of the empty tables near people already eating.", "pics": null}}, {"review": {"des": "Nice service and atmosphere. Brussels sprouts are amazing, a bit spicy. Thaï salad is tasty and huge.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pEyWnbt1DUbB0YSb0oi7Fw/348s.jpg", "caption": "Thai salad is good and huge ! Very good brussels sprouts !  Offer 2 pastries because they knew we were getting married the next day !"}]}}, {"review": {"des": "I was a little disappointed in my overall experience here, but I'm not sure that all of it was the restaurant's fault.<br><br>But it wasn't the greatest start when I came in for a late afternoon lunch for 1 and the hostess seated me in the back next to the kitchen, in one of those wall-length shared booths. There were plenty of open tables in the restaurant and I don't think it was necessary to put me next to the entrance to the kitchen and bathroom. Not exactly a peaceful dining experience.<br><br>...which was made far worse by the shared seating. They immediately sat a man next to me in the booth and he would not leave me alone for the next two hours. It was awful. I'm too polite for my own good. Wish I'd told him to jump off a cliff. Not necessarily Beatrix's fault, unless you count the pitfalls of the style of seating. Also once again, there were plenty of open tables. There was no need to seat this man directly next to me at that time. I chose not to sit at the bar because I wanted privacy and a little space to get some work done.<br><br>Food-wise, I had the burrata appetizer, which was amazing, and the roast chicken sandwich, which was...fine, but dry. Left something to be desired. I don't think I would come here for lunch again, but I suspect the brunch or dinner menus might be worth trying. Next time, I'll be sure to ask for a free-standing table.", "pics": null}}, {"review": {"des": "I am perplexed. Beatrix looks nice. The menu seems appealing, but the execution is nearly completely wrong.<br><br>Let's begin with the burrata, which comes with three teeny, tiny wedges of bread. The bread-to-burrata ratio is all wrong.<br><br>For my entree, I had the Skirt Steak Chimichurri ($25.95). While the steak itself was good, it was an incredibly small portion. <br><br>And this is where I throw the brakes on this review to discuss the french fries. Imagine you had a potato and you threw it in a food dehydrator, and then you placed it in the lint trap in your dryer for a decade, and then you left it in the sun, and then you put it in a ziploc bag with dessicant silica gel packs, and then you put it in a kiln, and then you cut it into small pieces, and then you crossed an old gypsy woman and she looked at you with her milky eye and spoke an ancient Romanian incantation that forever cursed any potato you touched. In that scenario, your fries would be more tasty than Beatrix's. Because Beatrix commits hate crimes against the very concept of french fries. They are a dusty, flavorless abomination.<br><br>Skimpy portions, high prices, and the worst goddamned french fries crafted by mortals? Hard pass.", "pics": null}}, {"review": {"des": "Food: 4/5<br>Service: 4/5<br>Ambiance: 4/5<br>Overall: one of the better places I came to in Chicago!  Good food and don't forget about dessert!!!!!<br><br>The extended review...<br><br>Food:<br><br>Pork shank  - a pretty good dish.  Very tender meat though the meat itself wasn't quite as infused with as much flavor as I liked.   The fruit definitely gave it that sweet element to compliment the savory.<br><br>Chocolate pie and caramel pie - ok so yes I normally order dessert and it's a good thing we ordered both of these.  They were meant to be eaten together.  One bite of the chocolate and one bite of the caramel!  It's the perfect combination and I have no idea how this pie is made but it is sooooooo delicious and I'd come back specifically for this pie!!<br><br>Service: friendly and attentive waitstaff.<br><br>Ambiance:  very chic and rustic feeling.  It's a very intimate place.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lPlT5UNgzMZAqRsrM3eywQ/168s.jpg", "caption": "Chocolate and caramel pie - seriously you need to order both and try it together!!!!! Slam dunk"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5qmpgAdbniDNWpaNH248QA/168s.jpg", "caption": "Pork shank - not too bad but the meat wasn't as infused with flavor as I liked"}]}}, {"review": {"des": "After coming here twice, once for brunch and the other for dinner, I can safely say this is one of my favorite places to eat in Chicago. It's casual yet with a subtle upscale vibe, it's like a great outfit you can dress up or down. You can grab drinks here with a group of friends, catch up with someone at brunch, take the family out to a nice dinner, or bring your beau for date night. <br><br>The food is unique without any prissiness that many \"foodie\" restaurants have in this city that can be intimidating to the average person. I've never had a dish here that I didn't enjoy and satisfy my tastebuds. <br><br>Their dinner menu is really fantastic, my friends and I split the tsukune (Chinese chicken meatballs, very flavorful!) and the Straight A salad, the latter was a pretty hefty size and shared between 3. Of course the salad is more of an entree than an app, but if you want a lil greens in addition to your meal keep the size in mind! We ordered the Cauliflower steak, Chicken Bebe, and the Chili and Chocolate Salmon, which we all devoured and finished with clean plates. I highly recommend ordering an entree per person, and sharing them so that you're able to try a little bit of everything from their menu (once you see it, it's hard to commit to just one dish!) <br><br>We finished off with the Tall, dark, and handsome chocolate cake, which was so rich and delicious. <br><br>The restaurant is also part of a rewards program called Lettuce Eats, where you can rack up points and discounts by eating at their participating restaurants (Beatrix and Beatrix Market being one of them), so it's nice to join that if you become a frequent diner there, which I can assure you will!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5UcSJF-Sdl7t-A6dQ2uBHg/348s.jpg", "caption": "clockwise from top, Chili & Chocolate Glazed Salmon, Chicken Bebe, Vegan Cauliflower Steak"}]}}, {"review": {"des": "Excellent place for Sunday brunch. Lively atmosphere and great menu choices. I had eggs over grits with greens and Kendall has salmon. Bakery looked really good but behaved myself.", "pics": null}}, {"review": {"des": "Beatrix is a nice spot for brunch.  It is a bit high energy, so if you seek a calming brunch to ease you into your day, you might want to look elsewhere. We were there on a Saturday morning, and the place was crowded and the music was jumping with 80s hits by Michael Jackson and Wham. <br><br>The spot can accommodate Gluten-Free requests, which was important to one of our party.  She was happy with the selections and the food. <br><br>The place gets crowded, so reservations on OpenTable are recommended. <br><br>Service was good and the food was delicious. My wife RAVED about the Braised Pot Roast and Egg Sandwich. (I tried and thought it was very good, but I didn't love with all my heart like she did.) I was boring and got scrambled eggs, which were well prepared, but I have to give kudos to the brown sugar bacon which was thick and delicious. <br><br>If you're looking for an energetic brunch spot in Streeterville, check out Beatrix.", "pics": null}}, {"review": {"des": "I had the cauliflower steak. It was really good, but a little too oily. My boyfriend had the ruby soho cocktail and it was a little strange- it sort of tasted like barbecue sauce? But the restaurant is overall very good, with options that can satisfy anyone!", "pics": null}}, {"review": {"des": "To make a long review short.... still outstanding service and food.  I had ordered the Pot Roast Filet.  Incredible.  I would highly recommend.<br><br>Go enjoy Beatrix for the food, service and laid back atmosphere.", "pics": null}}, {"review": {"des": "Great food, fun atmosphere, friendly service  <br><br>Got there at 1145 on a Monday. Busy but not full. Seated right away <br><br>The fresh juices are fantastic.  I got the blackberry lychee and my kids got the mango pineapple and watermelon strawberry. Extremely refreshing <br><br>For the king pao Brussels and fries with chili and lemons for appetizers. Delicious <br><br>For meals we had the burger, turkey burger, kebab as and", "pics": null}}, {"review": {"des": "Fantastic! If you are in town for a conference and need a nice place to take a larger group of people, this is it. I planned the meal with Elsa, who was an absolute dream to work with. She took care of every little detail and responded immediately to every little request. <br><br>Our outstanding server was Ariel and she was an absolute delight. She was attentive, engaged and the entire party loved her. <br><br>The food was fantastic. Everyone commented how fresh everything tasted. For a large party, they offer a lot of options but don't slack at all on quality or the service. Everyone who helped me tonight was wonderful and I truly appreciate everyone making our dinner a success. <br><br>I can't state enough how fantastic it was to plan a group dinner here. Give it a try for your next group meal.", "pics": null}}, {"review": {"des": "Beatrix is a please-all brunch spot no matter what you're hungry for. The brunch menu today had standard egg dishes and breakfast sandwiches but also included a couple salads, a poké bowl, and a burger. I loved my salmon caesar salad while my other table mates enjoyed typical breakfast foods. Beatrix has a full coffee bar and we enjoyed house cold brew and nitro cold coffee on a warm day. Service was quick and friendly. Stop by the pastry counter on your way out and grab some goodies to go. (The magic cookie is everything!)", "pics": null}}, {"review": {"des": "Beatrix offers standard brunch fare at an ok price. The interior is pretty upscale and fancy. Unfortunately, our group had to wait 45 minutes past our reservation time, though it's likely more to be the fault of a table staying too long.<br><br>I ordered the steak chimichurri, which came with a small 6 oz steak. For 16 dollars, one of the highest prices on the menu, I wouldn't order it again. While the flavor was decent, the portions were not hearty and satisfying, as you'd expect from brunch.<br><br>The real highlight were the lemon pancakes. The texture was like a soufflé: light and eggy. The flavor had a strong lemon taste but wasn't too sweet. I haven't had anything like it. That's literally the only reason I'm giving this above a 2.5 stars.<br><br>I would give this restaurant a second chance, if only to try their pancakes again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pqupYOHUYHM-Zf518ZOZAQ/348s.jpg", "caption": "Those pancakes were the star"}]}}, {"review": {"des": "I. love. Beatrix. I truly understand the hype around this divine restaurant. As someone who eats brunch often and is a vegetarian, this was definitely the spot for me. The coffee is pretty amazing, and the menu has endless amounts of delicious vegetarian options. I have been to Beatrix numerous times, and it never seems to fail me. For juices, I had the pineapple, pear and ginger and it was AWESOME. Definitely recommend if you enjoy drinking juice. The quinoa pancakes with poached eggs is my favorite dish on this menu. I am literally drooling just thinking about this dish. The tomato-basil sauce just adds so much to it, and I am a huge fan. I also really love the butternut squash and apple soup and the kung pao brussel sprouts. Seriously AMAZING. The homemade ricotta ravioli with butternut squash is just also so good. Like I said, if you are a vegetarian looking for some great food, go to Beatrix!!!", "pics": null}}, {"review": {"des": "I'm a fan of Beatrix. It was a great casual spot. It wasn't super chic and was very family friendly. I probably wouldn't go for a lively brunch scene. <br><br>I got the veggie burger which was large and tasty. I also enjoyed the fries. My dinning companion got scrambled eggs and bacon. He said the bacon was fantastic. <br><br>The only thing I didn't care for was the boozy banana drink. I think maybe the poured the hot coffee into cold almond milk or used the bottom of the almond milk container because there was so much white floating curdled milk I had to chew each sip so I did not drink much of that.  <br><br>Our server was a young blonde man who did a great job. He was helpful, attentive but not intrusive.", "pics": null}}, {"review": {"des": "We were in Chicago for our first anniversary and had brunch here before heading out on a long drive home. Our server, Kelsey, was incredibly sweet and thoughtful. I told her I'd been trying to find an oat milk latte everywhere and she confirmed for me that the honey cinnamon latte was an excellent choice, explaining how oat milk tastes before I placed the order. Then, after she told us the specials, I mentioned that I'd intended to get the cauliflower grits but that the pecan French toast sounded too good to pass up. When our food arrived, it included cauliflower grits, which we sent back, thinking it was a mistake. Turns out, Kelsey had the dish comped for us because \"we just HAD to try it.\" It was incredibly thoughtful of her (and ALL of our food was delicious, to boot!). Then, we mentioned that the experience was a great ending to our anniversary trip, and when she brought the bill, she also brought a slice of pumpkin pecan pie to go! She went above and beyond for us, and we wanted the owners/managers to know they have customers for life not just because of the food but because of the service. We can't wait to come back!", "pics": null}}, {"review": {"des": "The Beatrix in Fulton Market has been my steady go-to brunch place for the past six months. But I've now been to this Streeterville location both for dinner and for pastries. And honestly? I can't decide which meal I love most! <br><br>At first glance, the menu doesn't seem particularly creative -- it's pretty standard American food with maybe a hint of Mexican. But everything they do, they do well. For lunch and dinner, I love their burger and skirt steak. For brunch, I'm downright obsessed with their steak and eggs, but I've been dying to try the chilaquiles! And they're so gluten free friendly, with an entirely separate menu and gluten free toast and burger buns. <br><br>Perhaps my favorite thing though is their coffee bar. It's easy to grab and go, and it has the most amazing gluten free coffee cake I've ever had! If I could eat it every day, I would. And my fiancé also raves about their honey cinnamon latte. I'm about to start working right across the street, and I just know this is going to be a dangerous convenience! <br><br>Lettuce Entertain You restaurants are always a hit in my book, but Beatrix is especially so. If you're looking for a versatile restaurant to please everyone, Beatrix is your spot.", "pics": null}}, {"review": {"des": "Saturday morning and I was seated immediately at the bar area. I got the Eggs Your Way with Organic Turkey Bacon. All was pretty solid and standard breakfast food.<br><br>The Sweet Valencia Orange was tasty. Not as sweet as I thought which I preferred.", "pics": null}}, {"review": {"des": "~SUPER Vegetarian friendly~<br><br>What i loved:<br>- Lots, and lots of vegetarian options...seriously, there were at least 5 or 6 menu items I wanted to try<br>- They take reservations, I came to brunch with 10 other people<br>- Great vibe<br><br>I ordered the Roasted Cauliflower Grits and they were phenomenal.  I had bites from my friends' plates too: Green Enchiladas and Quinoa burger.  Both excellent.  The burger came with these delicious Kennebec fries.  Yum!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LIhU0QDdFw8Vqple04OlMQ/348s.jpg", "caption": "Roasted cauliflower grits"}]}}, {"review": {"des": "Love love love this restaurant.  The coffee.  The menu.  My favorite restaurant to chill and hang.  I wrote this review not only because I LOVE this place,  it because there were 666 positive reviews when I just visited the yelp page here.  I had to get it to 667.  Not that I am superstitious or anything.  :-)", "pics": null}}, {"review": {"des": "Unique brunch selection and a really good rainbow toast, but everything else was just average. Small portions and the avocado toast was underwhelming. I had the steak and eggs and it was pretty plain with a tiny amount of hash browns.<br><br>Beautiful patio, though, and all of the staff was super nice.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GwJqF-Euj4k2qK9HnRI8lw/348s.jpg", "caption": "Avacado toast!"}]}}, {"review": {"des": "We went to Beatrix for brunch during our time in Chicago, as it was a recommendation from a local family member of mine. <br>Similar to the streets of Toronto, there was no parking (unless street parking) available which was kind of a drag. However, when we walked into the restaurant, the atmosphere was cozy, trendy, and chic. <br><br>Let's break it down into a few categories:<br><br>Service - was impeccible. Our server was pleasant and kind, fast, and cheerful. <br>Food - absolutely delicious and what I was looking for. I had a veggie omelette with a side of avocado toast. <br>Space - it was an open space environment with a great atmosphere, friendly staff, and a trendy feel. <br><br>The only downside was that I went with a group of 5, who all ordered food at the same time. Unfortunately 1 of my family members did not receive his food. Our waitress noted it right away, apologized, took it off our bill and let us go with a 'doggy bag' filled with pastries. <br><br>Overall, it was a good experience and i'd definitely go again.", "pics": null}}, {"review": {"des": "What a top notch place for brunch. The food was delicious and I absolutely loved the nacho bar. You can't beat it. The prices are what you would expect for a nice brunch spot and again, the food was delicious. I would definitely go back next time I'm in the area!", "pics": null}}, {"review": {"des": "I've always thought Beatrix was mediocre and overrated. And I've come here many times. <br><br>Pros:<br>- Clean and acceptable setting, though generic<br>- Interesting and creative coffee and non-alcoholic beverages <br>- Housemade whipped cream is rich and fluffy <br><br>Cons:<br>- Mediocre food. Flavor is lacking. Not one of the best Lettuce Entertain You joints<br>- Busy, so they often forget you. Most of the time, your water will remain empty. I only had 1 waiter that was great at keeping my water full<br>- They don't make caesar dressing! They just have ranch. Wth?<br>- Deviled eggs have too much mayo <br><br>---<br>Recommended: interesting lattes, tartare<br>Avoid: salmon, salad, deviled eggs (too much mayo)<br>Ok: chicken tinga", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/o4gPQHZ2jNcK99f1W74S4w/348s.jpg", "caption": "salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QaoHHKc9-ih2mdJtfRwd7w/168s.jpg", "caption": "salad"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/guSDdnuEoeBALsNoSTZh5A/168s.jpg", "caption": "Cream Cheesecake"}]}}, {"review": {"des": "Ate here last night for a late dinner. I had the pot roast filet mignon... the mash potatoes were amazing but the filet although very jucie was not seasoned and very gamey. It looked good but could have used more flavor. I had the lychee blueberry lemonade, it was very sweet and lacked depth... syrupy sugar water but was pretty. For dessert I had the chia pudding, which was very tasty but presentation-wise was terrible. It came in a soup bowl like porridge.  I make this dish at home and even i put it in a clear dish for the effect ....and it was a bit runny, very tasty but hard to look at. The ambiance and atmosphere were very hipster and clean, the staff was friendly and sweet.", "pics": null}}, {"review": {"des": "My first day in Chicago I had just come in on a long flight starving and wanted something comforting in my hotel room. I ordered the \"neatloaf\" which was completely amazing, so comforting, delicious, and not too heavy. I also got the chocolate cake which was amazing. It was the perfect meal to eat in my hotel room and veg.", "pics": null}}, {"review": {"des": "This place should be every persons dream! I had the best Lemon Ricotta pancakes I've ever had. Beatrix is a quaint little cafe in beautiful Chicago. I highly recommend their juices, especially the Blueberry Smash.", "pics": null}}, {"review": {"des": "Beautiful place with delicious food! Try special French toast  it's sooooo good omg. <br>Also quinoa cake  is very good.", "pics": null}}, {"review": {"des": "I've been here for the hot food bar at lunch and for Sunday brunch. Both were good experiences. The hot food bar is super convenient and has a lot of yummy options, anyone can find something they like! <br><br>Brunch was also good, the portions are large and they have an interesting selection. I got the breakfast enchiladas which had a very nice salsa and scrambled eggs inside. They can get pretty busy on weekends but they take reservations which is a plus! Nice spot for a casual brunch if you're in the area :)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HWx_NDdI9Q3Ig1Nsxx0aSQ/168s.jpg", "caption": "Enchiladas :)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sQj6SJ-ajzABiByagSK2oA/168s.jpg", "caption": "Cauliflower grits + mushroom & quinoa burger"}]}}, {"review": {"des": "From what I had I thought the food was good and fresh but nothing stood out to me to make the restaurant super unique or exciting.  I got the poke bowl which like I said before just good and fresh, nothing over the top.  The person I went with had the enchiladas which seemed to have the same qualities.", "pics": null}}, {"review": {"des": "4 stars for the food. 0 for the service. The host took our dripping umbrellas to keep them outside and we never saw those two umbrellas again. The manager , Kevin, said he thinks some customer stole them and while he was sorry there was nothing he can do about it!! I have been waiting for a follow up call for two weeks. We used to stop by at the Beatrix often but we are never going back!<br><br>Update - I got a call from Jordan, the GM, right after I posted the review to apologize for the lack of follow up.  Things happen but reaching out to follow up and offering to make things right can dramatically alter the customer experience... For that call and because of the 4 star food, I'm taking up my rating", "pics": null}}, {"review": {"des": "Definitely make a reservation before coming here for brunch, it is always busy! <br><br>I had an enlightened ceaser salad with chicken which I love that they make a healthier dressing for it. The portion size is huge. <br><br>My friend had the egg white omelet and enjoyed it. <br><br>I absolutely love their baked treats. I had the angel food cake and the mini snickers bar. Both were delicious :) <br><br>Our servers were very friendly and we got seated in a timely manner.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LOFM3O47cY85n6CoYKnV9Q/168s.jpg", "caption": "Enlightened Caesar"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iM-vTptIVqnu8-ibFuts6A/168s.jpg", "caption": "Egg white omelet"}]}}, {"review": {"des": "This is one of my favorite places for brunch in Chicago. Good food, trendy atmosphere, and fast service. They have a Bloody Mary bar towards the back on weekends that I have brought friends and family to before. You pick your basics and flavors, hand it to the bartender and they bring it to you. <br><br>The cauliflower grits and the steak and eggs with chimichurri are some of the star dishes. They have herbal tea, a coffee bar, several different kinds of pressed juices and a good selection of cocktails. <br><br>This is seriously a great place to go, I have brought almost everyone who has come to visit me to this place and they have all raves about it.", "pics": null}}, {"review": {"des": "Beatrix seems more like Mexican inspired food more than American food, at least the brunch menu was. Most items had a Mexican flare to it like the green chili enchilada, and chicken tinga we had. The food tasted good, but reading the description for American food it was a bit different than expected. I really like their fresh juices, I had orange juice and my friends mango. Make a reservation because it will get crowded, you can go on opentable.", "pics": null}}, {"review": {"des": "Wonderful attentive service, charming place. Food was delicious and we loved the Power green juice to start our day!  Great, unique coffee selections.  We started with the hummus platter which came with a yummy tomato salad. I got a Turkey burger with a quinoa/kale salad. My hubby got the chopped salad with peaches and pumpkin seeds and loved it. He said the peaches were so sweet that you did not even need dressing. We were very pleased with this place.", "pics": null}}, {"review": {"des": "Yummy!  We were staying a block away from here for several days and enjoyed our lunch so much we returned to try breakfast.  For lunch we had the Poke and a crab cake w/ corn relish (the special that day).  The poke was very restrained and not overdressed, and all the accompaniments were fresh and tasty.  Highly recommend!  The crab cake was perfectly cooked with a lovely salad. For breakfast, we had quinoa cakes and the Cauliflower & Brussels sprouts (plus a side of hash browns because you gotta!).  Oh, and we shared pineapple, pear, ginger juice which was very refreshing! These were creative, tasty different dishes... and the hash browns were perfectly crisp and not too greasy.  Oh, and sit on the patio if you can!", "pics": null}}, {"review": {"des": "A beacon of brunching. With super unique food options, a huge space available, and arguably the best coffee I've ever had, it would be hard to be disappointed here. <br><br>Despite the large space this place is pretty busy on the weekends. We thankfully made a reservation for Saturday morning on open table so we were sat pretty quickly. I had the braised pot roast and egg breakfast sandwich and loved it. My friends had the Belgian waffles, green chili enchiladas, and the cauliflower grits and eggs and all I can say is everyone's plates were completely clean by the end of the meal. <br><br>The drink selection is also primo. There's a huge selection of daily made freshly squeezed juices, there have ample boozy brunch drinks to choose from, and their coffee was literally heavenly. I had a simple vanilla iced coffee and was still impressed. Everyone else had the chai cinnamon latte and it was unreal. <br><br>The service was quick, and super helpful when it came to suggestions and recommendations. We'll definitely return.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oYTUcf4ZefOONMmOI-6LpA/348s.jpg", "caption": "Braised pot roast and egg sandwich"}]}}, {"review": {"des": "Great lunch there today. Got a salmon and chicken Caesar salad, Kung pao brussel sprouts, and hummus and truly enjoyed everything. The service was great and the prices were fair! Definitely will be back!", "pics": null}}, {"review": {"des": "Comfort food flavor, generous portions and all without (most) of the guilt.  <br><br>For roommate date night we split the mushroom risotto and cauliflower salad - both of which were packed with flavor but didn't leave us feeling bogged down and disgusting.<br><br>Service was excellent on all fronts - the manager even sent us home with a few free cookies for being first time customers. <br><br>Will definitely be stopping by in the near future!", "pics": null}}, {"review": {"des": "I've been to both locations and have tried a good amount on the menu. Beatrix is pretty bad. The food and service are both very mediocre and certainly not worth the price. <br><br>I would challenge Yelp to look at the ratings because they seem highly artificially inflated. I've never been to a restaurant where my entire table says, \"we need to rate this poorly on Yelp because this was not good.\"", "pics": null}}, {"review": {"des": "Came here for a Sunday brunch/lunch at noon with a visiting friend. <br><br>I ordered \"Enlightened Caesar\" with salmon and didn't think much of my order. (Enlightened? Ppph.)<br><br>But I was pleasantly surprised by the unconventional flavor of the salad. The Greek yogurt dressing was generously and thoroughly applied to all ingredients. I found the cheese Grana Padano a wonderful flavor. The overall flavor was complex and delightful. <br><br>The juice was also spot on. I had pineapple, pear and ginger and it was really refreshing. <br><br>The price is a bit on the high side for a two dollar sign place but I'd say it's worth it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zrhYSTlBaFR7UsDRbLOFXg/348s.jpg", "caption": "Enlightened Caesar (with salmon)"}]}}, {"review": {"des": "Beatrix Streeterville is an excellent spot to meet a friend in terms of both ambiance and location. It's only about a block off of Michigan Ave, so it's super convenient if you're out and about shopping or taking public transportation. The area near the entrance is super cozy, and outfitted with a comfy couch and several chairs meant for lounging with a hot beverage. Speaking of, do try the London Fog! I love Early Grey tea lattes and this rendition was particularly tasty.<br><br>I also appreciate that Beatrix offers several types of gluten-free baked goods! Looking forward to coming back and enjoying the salad bar or a meal.", "pics": null}}, {"review": {"des": "If this place wasn't as pricey as it is, I would honestly give it a higher rating. For the price point though, it's not bad, but nothing very special. You come in through the lobby and the place does look way nicer inside than it does when you're searching for it. The interior is rustic and cute, and there is usually a wait. Their specials are usually better than their regular menu. The meat and chicken dishes are great, but I have found their breakfast food and pancakes lacking both in flavor and texture. Overall, a pleasant experience, but not quite worth the prices for me.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XTrqLkhQOMmgIMuIpM6fXA/348s.jpg", "caption": "Steak w chimichurri"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yPGjZY9utRMVjDzANQRNUQ/168s.jpg", "caption": "Lemon and blackberry pancakes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dXyZVk8SphTbx2Gw7JPr6Q/168s.jpg", "caption": "Spicy chicken tinga"}]}}, {"review": {"des": "I love love this place! Always came here with a co-worker during lunch since it was attached to my hospital. The veggie burger and fries were always delicious. We would always be seated immediately and service was always impeccable. Everything they did was very efficient and fast which it made it an easy to head back to work on time.", "pics": null}}, {"review": {"des": "Without question, by far the best chicken sausage I have ever had and if I have said that about another place it was a lie! It's ground in house and made into a little patties and the flavor and ingredients they put in the chicken sausage in salivating! I order the eggs your way and the eggs are fluffy and light and the hash browns are the least greasiest hash browns I have ever had. A really well rounded healthy breakfast with flavor and limited grease! Tough to say if this place or Wildberry is my favorite breakfast spot in the city... but I ate her two days in a row this trip!", "pics": null}}, {"review": {"des": "This is my third time back at Beatrix. Whether for brunch, dinner, or coffee and a pastry, this is a solid place if you're in Streeterville or River North. <br><br>Service & atmosphere: thanks to a reservation, we bypassed the 45 minute wait. Service was amazing and the decor has a warm, mid modern vibe. <br><br>Food: we ordered the chimichurri steak, burger, avocado toast, and then finally caramel pie. The steak and eggs were cooked perfectly- though I of course wish there was more steak and sauce. The burger meat was so flavorful and tasted very fresh. The avocado toast was delicious. Best part, by far, was the caramel pie. \"Like rolo pie\" to quote my mother, this sweet and dense pie with shortbread crust was amazing and made even better with vanilla bean whipped cream. <br><br>Come back for any meal, but definitely get the caramel pie.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cuV85zt_XcgDUKKCErtPFw/348s.jpg", "caption": "Caramel pie"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dKLVAsvpzxZmcDFDuv9VOw/168s.jpg", "caption": "Chimichurri steak and eggs"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ea0pmcReUdaK3jWgEXj85Q/168s.jpg", "caption": "Yummy avocado toast"}]}}, {"review": {"des": "Beatrix at Streeterville has never disappointed. The cocktails are delicious of which I recommmend the Blueberry Tom Collins. The pineapple jalapeño margarita was a little on the spicy side and I probably would not order that again. I have ordered the skirt steak chimichurri, the pot roast, and the prime burger dinner and all have been delicious and well prepared. I've seen a few reviews that rate the Kennebec fries negatively however I think the fries have a unique flavor with the spice from the shishito peppers and tanginess from the lemon. They have many unique desserts and bakery items of which I have tried the Joy cookie and the tall dark & handsome chocolate cake. Do yourself a favor and order the tall dark & handsome chocolate cake. You will not regret it.<br><br>I have also been here for brunch and have tried the green chili enchiladas and chilaquiles which were both very good and flavorful. <br><br>The service is always great. Waiters are attentive and polite. I would say this location is good for groups of friends, families and couples.", "pics": null}}, {"review": {"des": "The turkey meat loaf is amazing. The portion could've been bigger though. Great vibe. Friendly staff.", "pics": null}}, {"review": {"des": "We came here twice in one day on a recent trip to Chicago, soooo they're doing something right. Breakfast was FANTASTIC. Lots of fun coffee drinks including one with banana and figs mixed in and bulletproof coffee. They have a bunch of fresh juices and alcoholic drinks as well. For breakfast I tried the quinoa cakes with tomato basil sauce and poached eggs.....it was incredible. Everyone at the table reaaaaally enjoyed their meal. At the end of our meal the manager came over and chatted with us for at least five minutes...he was from DC and my guests were too! Really awesome guy and very friendly. <br><br>For dinner we made reservations and this time we sat outside. Also a really cool environment! Just like in the morning, all of us took awhile to figure out what to order because the menu is extensive.  I ordered ravioli and it was yummy but it wasn't soft it was harder. The fries were really good and so were the deviled eggs.  I also tried the cucumber mint refresher drink and really enjoyed it. <br><br>Overall, Beatrix has something for everyone, and that something they have will probably taste delicious.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/j_OoufNLmHfDKJxJ7isNvQ/348s.jpg", "caption": "Chilaquiles"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/L9bPtkVO0vp0ZIX5jJJ1cQ/168s.jpg", "caption": "Quinoa cakes and avocado toast"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UN-blko2FQaeXz01rbFV2A/168s.jpg", "caption": "Deviled eggs"}]}}, {"review": {"des": "Take one look at the menu and you'll understand what makes this place different. It's different. And it's all good. Chicken Tinga, Shakshouka, and even the most plain option, the lowly egg white omelet, was bursting with flavor and accoutrements.<br><br>NEXT DAY Came back for day two at Beatrix. Had the pot roast and egg sandwich. O M G. For anyone who has ever wanted to realize what creamed chipped beef should actually taste like, this I what I imagine the inventor had in mind.", "pics": null}}, {"review": {"des": "Very delicious lunch served here with great ambience and impeccable service! Our server was super attentive at all the right times, very knowledgeable on the menu, and catered to our needs very well! The options served here are heathy, fresh, and well worth the price!<br><br>We ordered the NeatLoaf, SuperNatural Salad, Mushroom and Quinoa Burger, and the Crispy Kale Salad! <br><br>The Neatloaf is perfect for someone who wants something more hearty without feeling bogged down and overstuffed! It was perfectly savory! It also came with mashed potato that was well seasoned and a delicious side kale salad that was perfectly dressed!<br><br>The SuperNatural Salad did not fall short to fill us up! It was deliciously fresh!! The peaches and tomatoes make such a great combination with the greens! Every bite had a little bit of each ingredient. This salad was fantastic!<br><br>The Mushroom and Quinoa Burger was a little bit dart overall, but still delicious. It still felt like you were biting into a juicy meat patty without all of the guilt! The Kennebec Chips are just fries, and you cannot go wrong with a side of fries!<br><br>The Crispy Kale Salad was just as fresh and delicious as everything else! It was well dressed and each bite made me love the salad even more! The Crispy Kale pieces were divine and added such a nice roasted taste. The papaya was sweet, the dressing light and tangy, the cheese slivers added a saltiness, the combination of flavors was great!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AFAc2I9B9sdKESy6eHO1yw/348s.jpg", "caption": "Housemade Ricotta Ravioli"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Sm_uk9Iesx5ukzaGecEP2g/168s.jpg", "caption": "Supernatural Chopped Salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wGOXm7JwBCg_Bho7YineSg/168s.jpg", "caption": "Mushroom & Quinoa Burger"}]}}, {"review": {"des": "This place surprised me.  A really good dining option on the first floor of the Galter building at Northwestern.  Trendy, dim lit, really great food - fresh and tasty - this is someplace you'd pick as a date spot.   Outdoor seating available as well.  Good wine and beer selections.  We dined here thrice during my Dad's hospital stay.  Again, it's weird because of the it's location but the hospital staff is really lucky to have a such a gem close by for an after work drink and good food.", "pics": null}}, {"review": {"des": "After hearing great things about the brunch here, I was not impressed. The wait for a table for 2 at 1pm was about 45 minutes, which would have been easier to swallow if the food was better, or if there weren't a dozen open tables going unused at the time. Menu has interesting \"healthy\" items, but is a bit limited. The green juice was delicious, not too sweet. Mushroom burger was pretty bland. Fries tasted stale or freezer burned. Server was friendly. I would give this place another try, but not during a peak time of day.", "pics": null}}, {"review": {"des": "I came to Beatrix on my Chicago vacation, and was so excited because of the excellent reviews. However, I kept finding myself disappointed in little things that made the meal and experience underwhelming. <br>Iced coffee was extremely acidic, could not enjoy it.<br>Hash browns were flavourless.<br>The regular water tasted like a swimming pool, so I asked for s bottle of water (and to my surprise it was $6 a bottle).<br>Chicken sausages are amazing.<br>Service was not terrible but could have been much better at the price point.<br>I know this part of the review is a little strange to say, but it almost seemed like everyone at the restaurant was in a brainwashed daze, there because of the hype and ambiance.", "pics": null}}, {"review": {"des": "Nothing to write home about. Somewhat better than airport quality.<br><br>Brunch steak: 3/5. Accompanying scrambled eggs and hash brown 1/5.<br>Poke: 1/5<br>Burger. 1.5/5<br>Coffee. 1/5<br>side of toast. 3/5.  all else so ordinary that the toasts tasted much better than they would have, otherwise!<br>Orange Juice, with plenty of ice cubes. 1.5<br>My wife's drink 3/5<br>Value. 1/5 for a $90 bill<br>Service. Reasonable, pleasant.", "pics": null}}, {"review": {"des": "A creative and interesting breakfast menu, with items such as Chicken Tinga and Shakshouka.  I had the latter.  Not quite as good as in a genuine Turkish restaurant, but pretty close.  Prices are reasonable for this very rich part of Chicago. <br>One thing marred my experience.  This is a big, kind of sprawling place.  Almost all the diners were adults. About a third of the tables were available when I arrived.  I am an old guy, and was by myself.  <br>Despite all that, I was seated next to the only table in that place that had a screaming, roaming child.  I have to wonder what kind of thought process leads the hostess to conclude that the old guy dining by himself wants to be seated next to the only screaming child in the whole big restaurant.  Just something for the hosts and hostesses of the world to think about.", "pics": null}}]}