{"name": "beatrix-river-north-chicago", "reviews": [{"review": {"des": "Beatrix is one of my favorite places in the city to eat. The menu is amazing, constantly changing and the food is superb. I have never been disappointed in anything I have ever gotten here.<br><br>Time and again I have gotten the chicken chilaquiles, and that make your own bar is totally worth it. Absolutely delicious with all the toppings you want and they don't hold back on the guac.<br><br>Also highly recommended is the quinoa burger, certainly very tasty. The party holds together well and the fries are a good side to accompany it. The waffles are pretty good and the strawberries are always tart. Ask them for a side of Nutella and you're in seventh heaven.<br><br>We've even ordered a few juices here time and again are those are pretty solid. Whenever I've gotten coffee for myself, the servers have always ensured that my cup is full.<br><br>I recommend making a reservation here though. The place is extremely popular and the waits can be painful, even if you have a reservation.", "pics": null}}, {"review": {"des": "My (now) wife and I planned our post-wedding brunch here, but Beatrix dropped the ball entirely. A reservation for a big group required a large deposit; around $6k I believe. Our exact numbers were a bit difficult to figure out in advance, so we reserved a table for twelve for us and the wedding party, and told interested guests to make their own reservations for the same time if they wanted to join. We called the restaurant in advance, described our plan, and told them we would prefer to all be seated near each other, but that we completely understood if it wasn't possible for a Saturday morning. The reservations made totaled approximately 40 people. <br><br>When we showed up, Beatrix had somehow \"lost\" most of the reservations, including our 12-person res for the wedding party, and our guests were left standing around confused and hungry. Eventually some went to other restaurants, others had to leave to get back to relieve babysitters watching their children at home, and while some waited it out, we all ended up in separate areas of the restaurant. We were eventually seated after waiting for 45 minutes to an hour.  And while the food was good, the staff offered no apology, and we had mediocre service at best having had to wait for almost 10 minutes after being seated for a waiter to serve us. This was really too bad, as I've had positive experiences for personal and professional meals here in the past. <br><br>While we understand mistakes happen, their response was sadly lacking. We just hope they learn from this poor experience and leave guests with a better stay in the future. Losing this quantity of confirmed reservations and not rushing those tables to be seated was an unfortunate end to an otherwise beautiful wedding experience.", "pics": null}}, {"review": {"des": "I haven't had a full sit down meal here, but I sat at the bar a few weeks ago for some drinks with my brother and have to say I had one of the best bloody mary's I've ever had. It was the perfect amount of spice, tasted fresh, and had a piece of carmelized bacon on top- YUM. <br><br>I also ordered the caesar salad with chicken which was probably one of the best caesar salads I've ever had. It had breadcrumbs and capers on top, so all the salty good stuff. The restaurant was packed and it looks like a cozy place to hang out in cold weather!", "pics": null}}, {"review": {"des": "It just doesn't seem right to start a review talking about dessert but after trying the oh my! caramel pie, it definitely feels right! <br><br>Dessert was probably my favorite course at Beatrix and that slice of caramel pie and tall, dark and handsome chocolate cake had some stiff competition, which started with our first bites. <br><br>The appetizers were really good. We tried the tsukune, or Japanese chicken meatballs, which were tossed in a sweet sauce. This was my favorite bite of the night but the kung pao brussels sprouts and the enlightened caesar salad were excellent as well.<br><br>I tried the chili and chocolate glazed salmon, the chicken bebe, and the ricotta ravioli. I wanted to love the salmon because well let's face it, I love all things chocolate. But, the flavor really wasn't there. Adding the salsa verde and putting the fish on the accompanying tortillas didn't make this fish any more successful. It begged for some simple salt and pepper at least. What I did like however was the pounded thin chicken with a parmesan crust and a cream sauce. The pasta was also very tasty.<br><br>But, getting back to dessert...the caramel pie was divine. As someone who doesn't love many caramel concoctions, including caramel cake, I was surprised by how much I enjoyed this pie. Perhaps it's because I've never had anything exactly like it. It was rich and gooey and absolutely delicious. It tasted like I was eating a massive piece of caramel candy. Despite my being stuffed after our entrees, that pie made me find a little more space to get it down. <br><br>Beatrix is definitely a cool spot that people can enjoy all day, starting at the coffee bar and pastry counter up front and ending, of course, with dessert. Service was excellent and the ambiance was nice and casual.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Zz1u7IBD2XRjbd2ZfgeIxQ/348s.jpg", "caption": "Oh my! Caramel pie and tall, dark and handsome chocolate cake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GS5qJJtH-Ng_QngI-4WSPA/168s.jpg", "caption": "Ricotta Ravioli"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TiaFFPt44RfWcLV1-C56eA/168s.jpg", "caption": "Chili and Chocolate Glazed Salmon"}]}}, {"review": {"des": "Great first experience here.  Atmosphere and staff are lively.   We got an ahi tuna to share which was delicious.  I chose the Szechuan chicken as an entree and it was good just a little bland for my taste.  The salted Carmel pie dessert finished the experience well.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_AinwWbjm5wtGWYIKTsvxg/168s.jpg", "caption": "SZECHUAN CHICKEN soy-ginger glaze, shiitake & trumpet mushrooms, shishito peppers"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/h8-AxXVA9Ksq5Sd235Utug/168s.jpg", "caption": "Ahi tuna"}]}}, {"review": {"des": "I've visited this Beatrix location twice now and figured it was about time I leave a review. I came here today (Sunday) with a friend for a 11:45AM reservation. Please note: you won't be seated until your whole party arrives.<br><br>Beatrix is always bustling and busy - it's definitely best to make a reservation. The restaurant itself is fairly spacious so I'd say you're probably fine with a group as long as you make a reservation ahead of time.<br><br>The service is always good; servers are attentive and happy to give recommendations. Don't forget to add your Lettuce Entertain You code and rack in those points!<br><br>Today I had the Braised Pot Roast and Egg Sandwich. It was pretty good! I wanted something protein heavy. Be careful with which menu item you select unless you're ordering multiple things - I've left here and not been full before :/. I really liked the jalapeño relish on the sandwich, as it made it a little sweet. The pot roast was a little salty, but overall good with the eggs and aged cheese. I left feeling satisfied and full!<br><br>Beatrix is a cute place and one I'd recommend trying. It's a little overpriced in my opinion, but the food is solid and the location is nice :)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8FdAtdPg8aXTiKDZ04JvuA/168s.jpg", "caption": "Braised Pot Roast and Egg Sandwich - Brunch"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/d2AmeuagWhgAAIl3gqhNfg/168s.jpg", "caption": "The baked goods are always fresh and delicious! Love the aesthetic layout and lighting~"}]}}, {"review": {"des": "I've come to Beatrix two times, both with big groups. The menu is succinct yet diverse enough to appease people with all tastes and dietary restrictions. <br><br>Most recently, I came for lunch and made a reservation. I was a bit put off by the reception from the hostess. They told us the table wasn't ready, but didn't say when it would be and just asked us to stand to the side, where it was hard to dodge the busy lunch crowd. We waited for a good ten minutes before we were seated after a follow up. <br><br>To eat, I ordered the mushroom and quinoa burger with Swiss cheese, baby kale and sriracha aioli. I enjoyed the combo of flavors. It was filling but I didn't feel weighed down like a regular burger. The fries were nothing to write home about. <br><br>Is Beatrix bad? No, just nothing blew me away. I actually think the coffee and juice bar with assorted baked goods could be where it's at. While the food came fast, I didn't feel very taken care of from our waitress once we were seated. <br><br>When all is said and done, Chicago has so many great spots to eat and my experience here didn't leave me eager to come back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EH3SkSIgix56D0yT1vm_9w/348s.jpg", "caption": "Mushroom and quinoa burger with Swiss cheese, baby kale and sriracha aioli."}]}}, {"review": {"des": "My friend and I walked in without reservations on a busy weekday for lunch and we got a table in ten minutes. The ambience was classy, service was excellent. The food, mmmm so good! <br><br>I've never appreciated fries more than the ones here - kennebec fries. Lord! Deep fried lemon and deep fried chilies to go with the perfection that is fries and a great dip to top it off. <br><br>Ordered hummus, veggies and naan. Hummus was extraordinary. Also, grilled chicken kebab with naan bread. Grilled chicken in a bed of delicious sauce was so delicious. <br><br>Love this place and can't wait to tell everyone about their amazing fries!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ej4J2nJSnEmiqP3TTfjNSA/348s.jpg", "caption": "Grilled chicken kebab"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0x5F7CMUAc-ovQRmcGSPwA/168s.jpg", "caption": "Kennebec fries"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9sHNcJLkUKp_SjtCs5WjYQ/168s.jpg", "caption": "Hummus, veggies and naan"}]}}, {"review": {"des": "Main point of interest: The bakery display case.<br>Most recommended dish: Roasted chicken sandwich, as a salad.<br>Wish I tried: The chocolate angel food muffin & chocolate nitro milk.<br>Would I come back: Heck ya!<br><br>We had a group lunch reservation at Beatrix, mid day, mid week. It was definitely crowded and even with our names on the list we waited about 7-10 minutes for our table. The staff were all over the place but still attentive and helpful when it came to ordering and getting items to the table in a timely manner. Bathrooms were clean and spacious. And restaurant location is right in the heart of things downtown.<br><br>The bakery case is a sight for sore eyes and the coffee bar options are uniquely mouth watering. I mean, chocolate nitro milk... What even is that? It sounds like the silky smooth goodness I need in my life. That day, however, I needed some greens in my diet so I tried the power greens juice. Just a tip, get it to-go; you get a lot more bang for your buck that way. It was refreshing and a good combo of flavors, but could have used a little more green goodness added to it. <br><br>For lunch I had the Roasted Chicken Sandwich as a salad which was an amazing combination of flavors and a very generous portion size. The chips that came with were not my cup of tea but I would definitely order the \"salad\" again. I was too stuffed for dessert but I would love to come back and try any one of their pastries from the case. Everything looked packed freshly made and filled with decadent flavors. Try them for me and let me know how amazing they are - Enjoy!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2T5P_xRNk-7eixlhlS0lUw/348s.jpg", "caption": "Chicken Avo Sandwich as a Salad"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/t7f1HhfTy4IzT-9bfX-mng/168s.jpg", "caption": "Chips"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DmCncESbi0mvoWoJ1lj8nQ/168s.jpg", "caption": "Power Greens Juice"}]}}, {"review": {"des": "Beatrix had a pretty good reputation around town so I decided to try them out for breakfast. The atmosphere reminded me of a trendy upscale coffee shop. We were seated immediately and received our morning coffee in quick time. I ordered Belgian waffles and my wife ordered cauliflower grits. My waffles were heavenly with perfectly sweet strawberries and fluffy whipped cream on top. I would order those again in a heartbeat! My wife's grits or surprisingly delicious with a subtle hint of smoke from charred brussel sprouts. I am usually not a fan of grits but that dish turned me into a believer! Each plate was perfectly portioned and priced competitively for the area.<br><br>Overall I thought Beatrix was really good and deserves a visit from anyone looking for a delicious start to their day.", "pics": null}}, {"review": {"des": "One of the best brunch spots in the City of Chicago hands down. I've dined at the Fulton Market location and also this location and I was satisfied at both. Service is always A1 and the food is always fresh to order. Their menu isn't a typical style menu, but I am sure you can find something to your liking. In all honesty it's the flavored mimosas that keep me coming back the main reason I come. I mean they have every flavor you can think of! Blueberry, Strawberry, Mango and they're strong and GOOD!! Me and my girlfriend can come here and hangout all day and afternoon talking, people watching and sipping on those mimosas. My last trip I ordered for breakfast/brunch the egg sandwich with turkey bacon that came with this special spicy relish on ciabatta bread and it was really good. I've never had such a breakfast sandwich before and I must admit it was very tasty. I also added a mimosa as a side order and I think my total bill came to $18 and I was full, which isn't bad for the downtown area. This place can get very crowded on weekends so I recommend making a reservation in advance. This so far is at the top of my list for brunch and until I find another restaurant that can offer me what the Beatrix can offer me it will stay that way.", "pics": null}}, {"review": {"des": "Had a very good brunch last Sunday. We arrived around 11:30 and were told there would be a 45 minute wait. After about 55 minutes we got the call that our table was ready and we sat down and placed our order. The dining area is adjacent to the hotel lobby so there are some seating options while you await your table.<br><br>It's an active, open dining area like many brunches in Chicago. There is also a bakery case that shows a number of pastries you can get to take with you. <br><br>Our server took our orders and the food came out in a reasonable amount of time. Two of us got the Green Chili Enchiladas. They had a nice blend of eggs, kale, peppers, and cheeses. There was hot sauce on the table, that we both thought was a vital component to add to the enchiladas. With that added, we thought they were very good.<br><br>Another in our party got the somewhat healthier Cauliflower grits. They come with a fried egg and brussels sprouts. She enjoyed all of it. The other in our party got a good standby - the Eggs your Way. It had very fresh and tasty hash browns, and she opted for the chicken sausage, which was very delightful! It had a light, apple-like taste that was wonderful. <br><br>Service was OK, but it took us quite a while to get our check and pay the bill. Not a big deal as we weren't in a hurry, but a bit of speed there might keep the morning churn of customers moving a bit.<br><br>Definitely good food at reasonable prices.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0mO9UYCD27jepldA7OCbEw/348s.jpg", "caption": "Cauliflower grits and eggs"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dZQExmMWlg94-xruzni57Q/168s.jpg", "caption": "Eggs your way with delicious chicken sausage"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vxDzQo_cBq7lrGsNh2Yj_g/168s.jpg", "caption": "Green Chili Enchiladas"}]}}, {"review": {"des": "This place is absolutely fantastic! The atmosphere and decor are extremely cute and the food was excellent!<br><br>I got the green juice and the white omelette with a side of avocado toast. Everything was cooked to perfection. The tomato and avocado salad that came with my omelette was delicious! My omelette was delicious as well. Although I did say no cheese on the omelette which I believed the cooks mistakenly put on, I ate around it because the cheese was all in one spot anyways.<br><br>Overall, I highly recommend this place. It's definitely worth the wait!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/j_hvmkt9CAJpp4rB7iG5hg/168s.jpg", "caption": "Power Power Greens Juice."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NdImOZS3QIMdBbbA_zP22A/168s.jpg", "caption": "White omelette with turkey bacon and avocado toast. Phenomenal"}]}}, {"review": {"des": "* 3.5 stars * <br><br>I made a reservation for 8:30pm on a Saturday night for 7 people. <br><br>Ambiance: Beautiful restaurant. Dim, modern look. It was very busy and packed with people. <br><br>Service: No one stopped by our table for about 20 mins when we were seated. No water, no waiter, nothing. When he finally did come by, we ordered right away. The lack of service happened again when we wanted our check. Our waiter came often to the table next to us, and I know he looked at our table a few times but he never asked if we wanted the check. Then we couldn't find him for at least 10 mins. At this point, the place isn't busy anymore.  We noticed that he had tables on the patio and the other side of the restaurant. Beatrix needs to have a better system with waiting tables. <br><br>Food: I ordered the ravioli. I was quite full from throughout the day so I only ate half, but it was pretty good. My cousins ordered a ginger cocktail and a juice, said both were good. Other items ordered were the chicken Bebe, Szechuan chicken, and steak chimichurri. The chickens seemed to be a winner over the steaks. <br><br>Overall, I can't say I'm coming back anytime soon. The service was slow. I can understand being busy, but 20 mins is way too long, and at the end half the restaurant was empty. The food was good but nothing to write home about.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-U_mk3JPllhEYBsGvyhfag/348s.jpg", "caption": "Dining area"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eASnHbTsQzWjqv0mipD3dw/168s.jpg", "caption": "Housemade Ricotta Ravioli with Heirloom Tomatoes Dinner"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5Jrg318jh65j9WaIxTDvMQ/168s.jpg", "caption": "Cute coffee shop/bakery inside; next to the bar"}]}}, {"review": {"des": "Made a reservation here for brunch thinking it was going to be busy, but it wasn't too bad. The reservation was for a high top table but we got lucky and got a regular table. <br><br>We ordered their steak and eggs and the serve yourself chilaquiles. They bring you a plate for the chilaquiles and you go towards the kitchen where the buffet is arranged. The steak was delicious but the portion was small. We were able to get full because the chilaquiles was all you can eat. <br><br>I'd come here again but for dinner.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1JNmD6DCnYT-dz2LVlNrFg/168s.jpg", "caption": "Serve yourself chilaquiles"}]}}, {"review": {"des": "Beatrix is a nice place that has good heath food options. I tried the Steak Chimichurri and Eggs, and the dish was well prepared. I also tried the mezcal punch, which was a pleasant surprise because I didn't expect it to be as good as it was since this is a health food place. The server was good. She was attentive and polite, and that's all you can really ask for in a server.<br><br>Beatrix has a few locations throughout the Chicago-land area. I recommend giving this place a try.", "pics": null}}, {"review": {"des": "I had my first meal in Chicago here and I saw that almost everyone ordered the salad, so that should have been my first clue that their salads are amazing lol<br>I ordered the Dr. Bob turkey burger and my mom got the Thai salad with chicken as per suggested by our waitress. The turkey burger comes deconstructed, so it resembles a salad. It was alright, the turkey burger was nicely seasoned and moist and the quinoa salad had sliced almonds, cranberries, and kale. However, the Thai salad was amazing. It was sweet, savory, and tart all at once and still tastes light and refreshing. I don't think I've ever had a Thai salad here in NY like that, which was why I didn't even think to get the Thai salad there. The service was really nice; our waitress made sure we had our water refilled and had plenty of napkins. The only downside was the price lol for a party of 4 the bill came to $89, before tip. My dad and brother were as underwhelmed about their dishes as I was about mine, and agreed the highlight was the Thai salad, so $89 was pretty steep.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sFXcne4_EiFg26oJtFEQRw/168s.jpg", "caption": "Thai Chopped Salad Lunch with chicken"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3qTlfXWvEi8wKZTd2cPJfg/168s.jpg", "caption": "Dr. Bob's Turkey Burger Lunch"}]}}, {"review": {"des": "Overall, it was just OK. I had high expectations of the place. The place is loud so if you are hard of hearing, probably not the place to be.  Also, we got seated by the bar so everyone walking by kept hitting the chair so that wasn't fun. <br><br>Onto the food:<br>Mimosa (Blue - blueberry or Red - strawberry w/watermelon) - Not really my thing as I'd rather do regular mimosa. It was a bit lukewarm.<br>Caesar salad with chicken - Good (dressing was tasty. It would be better if the chicken was warm)<br>Fries - Good but don't eat the decorations besides the shishito peppers<br>Wonderful egg white omelette - Good <br>Side of hashbrowns - Good<br><br>Service was ok.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Sunn_DFMe5dHQhJ3qdmrRw/168s.jpg", "caption": "Fries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cYluu3u2xBjus-h3neNh9w/168s.jpg", "caption": "A Wonderful Egg White Omelet"}]}}, {"review": {"des": "Walked in on a Sunday and the wait was 2 hours. They told us bar seats are first come first serve. Luckily we found a bar seat within a couple of minutes. We were excited to try the bulletproof coffee but they were out. Their drinks were pretty good but nothing special. The food on the other hand is a different story. The lemon pancakes literally melted in your mouth. They did start to taste more eggy as they became colder. The poblano green chili enchiladas were recommended to us by the waiter. Soo good! I want more as I'm writing this review..", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aRMa4UmbnNBZdx7jhv0kgg/168s.jpg", "caption": "Poblano Green Chili Enchiladas Brunch"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IV_Z3xWL5y52660Q5AwS7A/168s.jpg", "caption": "Light and Fluffy Lemon Pancakes Breakfast"}]}}, {"review": {"des": "I've been here almost every time I visit Chicago, granted because I usually stay in the area and I think this is a great option for dining alone or with others.<br><br>I haven't tried the brunch here yet but I've had lunch and dinner here. I've had the mushroom and quinoa burger, enlightened caesar salad, straight A salad, chili and chocolate glazed salmon.<br><br>I enjoyed all of the items I've had here (liked not loved), but I think it's a great option since I can keep trying different things with a mix of healthy and satisfying options. Also love the ambiance and friendly service.<br><br>There is also a nice coffee bar area here.", "pics": null}}, {"review": {"des": "Three years later, should update my review. I find myself at Beatrix River North at least once a week for breakfast or coffee meetings. <br><br>The updated menu better addresses food preferences with plenty of vegetarian/gluten-free options (just ask if you don't see it on the menu), including yummy gf bakery items. Their oat milk is really good. The spaciousness of the layout, central location, variety of seating options and acoustics make this conducive for coffee/meal meetings at all hours of the day.", "pics": null}}, {"review": {"des": "We come here on the regular to catch with friends for breakfast/brunch. I've had a few things on the menu but nothing has ever been disappointing. Everything taste really fresh and natural. They don't use preservatives or added fillers. They sometimes have a pecan french toast. It's really sweet and filling but we usually get it to share between 4 or 5 of us. I get the eggs your way pretty often. I get it with chicken sausage. Their chicken sausage isn't premade or store bought. They make it fresh in house and you can definitely tell the difference. It's very flavorful and juicy.<br><br>Overall, I think we keep coming back because of the quality of food. I don't feel as bad when I eat out here because it's healthier than most other brunch/breakfast places!", "pics": null}}, {"review": {"des": "What a lovely lunch spot. I joined coworkers here for lunch and our manager really found the Goldilocks \"just right\" spot to cater to all dietary restrictions and preferences.<br>Our health nut loved her salad, our paleo pal enjoyed a bun-free burger, my fish-fanatic self thought the salmon was the bees' knees, and our Mikey-likes-everything easygoing guy enjoyed his chicken skewers and trying nibbles of everyone else's goodies.<br>I'd love to come back just to spend a morning nibbling the treats in their bakery case alongside a nice cuppa tea or coffee. We loved the ample blueberry crumb muffin sample that was on offer as the free taste of the day while we waited for our table (half star deduction for it not being ready since she'd made the reservation for our group of six well in advance).<br>Pro tip: their juices are delish but spendy. I loved my blueberry lychee lemonade but found it disappeared more quickly than I would've liked. Our health nut wised up and ordered a second greens juice to-go but without the ice that really filled up the glass.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-x2MqPvX8i7m13Tdg0VTQQ/348s.jpg", "caption": "Try me taste"}]}}, {"review": {"des": "Phenomenal food and exceptional service. Sat at the bar first night, liked the food so much went back the second night. That itself is a huge endorsement as I love to try new places to eat. <br>Ordered Straight \"A\" Salad which was beautifully made and tasted great although the dressing could use some honey to boost flavors of Asian Pears and Asiago. Asked the sever for honey/lemon :)<br>Local Burratta is a great appetizer if you are looking to share. Kale pesto was delicious and the multigrain toast had perfect texture to balance soft cheese and pesto. Second night, I had their special - black rice risotto which was phenomenal. This time I sat at a table by the window. Great ambiance - perfect for groups. This vegetarian foodie highly recommends Beatrix next time you are in Chicago.", "pics": null}}, {"review": {"des": "I usually love this place but not this time. Came in for the coffee and a muffin. Muffin tasted like foam...and it actually looked like foam. Not a fan anymore....the coffee was good and muffin looked good from the outside but did not taste so well on the inside.", "pics": null}}, {"review": {"des": "Being the brunch lover I am, this one didn't really do much for me. Food was fine - nothing really memorable, which was surprising with how packed it was at 10 am. We made reservations ahead of time for Sunday morning and for those who just walked in were quoted a 1.5 wait.<br><br>We were told that the lemon pancakes were a must so we got that along with the Belgian waffles and cauliflower grits. Food came out quickly so that was a plus but other than that everything tasted pretty mediocre. The grits had good flavors but were a tad bit too watery for my liking. I was quite underwhelmed with the pancakes especially with all the hype it gets.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aJGTEmlg0TVZ2fRzgOtCEA/168s.jpg", "caption": "Light & fluffy lemon pancakes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bd1IsKm0zaxTI7sE_dEZjw/168s.jpg", "caption": "Cauliflower grits, Belgian waffles, and lemon pancakes"}]}}, {"review": {"des": "What a pretty venue!  I was here for breakfast.  I had the fresh squeezed OJ and the eggs with the sweet bacon and toast.  The meal wasn't anything special and the bacon was a little too sweet for my taste.  But the ambiance was nice and the service was very friendly.", "pics": null}}, {"review": {"des": "We came during lunch time and thankfully there were seats at the bar so we opted out of waiting. We got:<br><br>Straight \"A\" salad w chicken- arugula, avocado, asian pear, asiago, almonds. The combination of all the ingredients just went so well w each other- You get the savory and sweet flavors. It's definitely one of the best salads I've ever had. <br><br>Prime burger- got it medium rare. Per the husband: \"It was seasoned nicely, flavorful. The favorite part of the dish were the drippings from the burger over the kennebec fries.\"<br><br>This place was a great surprise and recommended for anyone looking for a brunch spot in the area.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/g0olTAhCpwkY1R-bSOiyMg/168s.jpg", "caption": "PRIME BURGER"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hKDNtRMWKFh2yw7eRYyD4A/168s.jpg", "caption": "STRAIGHT \"A\" SALAD"}]}}, {"review": {"des": "I met some friends for brunch with reservations on a Saturday morning.<br><br>It was crowded so I am glad we had the reservations. Without having looked at the menu at all prior to my seating, I was delighted to find a number of healthy options on the table.<br><br>I chose the egg white omelet. Very tasty... I just forgot that I don't like turkey bacon but even that was palatable. (The pork bacon I had the next day tasted so much better than usual for some reason.)<br><br>The boozy banana joe was my drink - it was really good. I did not even notice the almond milk. Basically chocolate milk with banana - one of my favorite combos - with alcohol! Winner!<br><br>Also, because I was here on vacation, we ordered a French Toast for the table. I really wish I could remember what was on it topping wise because it was delicious. The bread was thick and heavy - I liked it... some kind of sweet nut topping which crunchy creating a good contrast in texture.<br><br>I would not hesitate to eat here again if I find myself back in Chicago.", "pics": null}}, {"review": {"des": "My friend and I stopped into the coffee & bakery section of Beatrix on Saturday night. All of the staff was very friendly and we got a couple of very comfortable seats to chill in and have some coffee before a show<br><br>We each got a Bulletproof Coffee for $9 and were served quickly. It gave me a ton of energy as it should but it's not quite for me. Nothing to do with Beatrix, of course, but man that butter coffee was just a bit much for me. I felt like I was drinking deep fried coffee and could only stomach half of it. The butter definitely makes it more creamy but also leaves things a bit too oily for my liking. Ah wells!<br><br>Beatrix's bakery has so many delicious cookie options and is a great spot to pop in for a coffee.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fjQ14n8nzxfklramA9x6FA/348s.jpg", "caption": "Cookies!"}]}}, {"review": {"des": "I was soooo incredibly impressed with this restaurant! My friends and I decided to go here after reading reviews looking for a nice breakfast/brunch spot. The hostess was so nice and got us a table for 8 right away so long as we finished within an hour or so because it was my birthday (I think). I did hear her say that it was 1.5 hours for the wait list on Saturday morning around 10. <br><br>I ordered the chimichurri steak and eggs and it was deeeelicious. The steak was nice and tender and the sauce was also tasty. I also ordered a cocktail..I honestly don't remember the name..probably because we started breakfast off with a huge vodka shot haha. But it was fruity, not overly sweet and yummy! <br><br>Service was great and our waitress was quick and attentive. The restaurant was clean and the decor was cute inside.<br><br>The best part of all..they gave us two free birthday desserts- their most popular dessert, their caramel pie. Even for people who don't  have a sweet tooth, it was to die for. Easily one of my favorite desserts of all time. Soooo good! I highly recommend this place..if not for a meal..then just dessert! Two thumbs up.", "pics": null}}, {"review": {"des": "Ok I came here after swimming in the lake around lunch time looking like a hot mess! The restaurant was crowded- I am visiting Chicago so I figure- this must be the hot spot so I go in and sit alone at the bar. Well a lot of patrons where looking at me like I'm crazy but whatever I pay my bills. The bartender gave WONDERFUL service even though I was dripping sweat and wearing a tee shirt and leggings. 5 Stars for service and not judging me! Also for being from Cincinnati. <br><br>The food was exceptional. I got the chicken sandwich with fries. I should have just gotten the chips because the fries we're ok but the sandwich was unashamedly devoured! So good. I definitely will come back since I typically stay near this location when I am in town. <br><br>Thanks a MILLION times for the amazing service most of all because I was hungry and tired and I looked like Nessie the Loch Ness monster but the wonderful service made my day!", "pics": null}}, {"review": {"des": "Great atmosphere for drinks and apps. I was here on a Saturday night and it was busyyyy. <br><br>Nice selection of drinks, including non-alcoholic and alcoholic. Very fresh drinks. Almost felt like I was detoxing my body with the alcohol drinks! Their spicy margarita is good. <br><br>Apps wise, tried the burrata with pesto, the kennebec fries, the Tsukune (lamb meatballs), and the quinoa guacamole. <br><br>-Burrata was delicious and light. The kale pesto was a great addition and so flavorful <br>-Kennebec fries were crispy and had these crispy lemons that were amazing<br>-Tsukune was ok compared to the rest. Wasn't as flavorful<br>-Quinoa guac was slightly bland but had a great crunch with the quinoa. Definitely eat the jalapeños<br><br>Service was pretty good, even though the server forgot my drink order twice.  <br><br>Overall great experience and I definitely want to try more entrees.", "pics": null}}, {"review": {"des": "T H E    S T O R Y<br>I live near here and have been multiple times now.<br><br>I've done brunch, dinner, and coffee bar. <br><br>T H E    G O O D<br>- Sea Bass<br>- Ahi Tuna Crudo<br>- Brussel Sprouts<br><br>T H E    B A D<br>- Chicken Bebe<br>- Chicken Tinga<br><br>T H E    S T A R S<br>- There are a few good items here and I do appreciate the healthier menu, but I haven't had much here that blew me away. <br>- If I was rating the Carmel Pie alone, I would have to give 5 stars.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mjp05-c3SHM5clGJGiO0Xg/168s.jpg", "caption": "Carmel Cake Dessert with Side of Vanilla Ice Cream"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bGpc19lOvuVahGEcoDw_ww/168s.jpg", "caption": "Coffee Bar in Beatrix. Skip the angel food muffins. Wasn't a fan."}]}}, {"review": {"des": "There is a long wait for brunch (90 minutes), so get your name in early. The interior is picturesque, and the pecan praline french toast was decadent, and I can't wait to have again. The rainbow toast (only a side) was beautiful, but the compote was a bit too sweet for me. <br><br>Don't forget to download their rewards program!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Fi88apssdF1sX-es_AoNKg/348s.jpg", "caption": "Expresso"}]}}, {"review": {"des": "Went twice in one week, drinks are delish and the selection is larger than the menu ha! Food is great. Only complaint: slow service. Really slow service. The first time we were having a relaxed dinner with friends so it was fine. The second time with family, we had to wave our server down multiple times.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xqK-o2YLnbiTyix5jcrMgA/348s.jpg", "caption": "Caramel pie"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2bIGXTQh12peAFNIRAlTYQ/168s.jpg", "caption": "Chicken Bebe"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HXem5QHZqUkl15BH1EkYJQ/168s.jpg", "caption": "Strawberry pie"}]}}, {"review": {"des": "To start, the management is so great. We had a reservation for 12 and our table was 35 minutes late to be ready -- the manager on deck was so nice and gave us a complimentary round of mimosas. They also expedited our food because we had somewhere to be at 2PM. <br><br>The drinks were awesome. Our party tried the orange, red and blue mimosas. All great. The bloody Mary's were also really good, as was the WOW! Ginger Sangria. <br><br>I ate the quinoa cakes with poached eggs -- LAWD it was so so good. Would definitely return in the future.", "pics": null}}, {"review": {"des": "Wow! <br>This place was so busy on a Friday afternoon.  We got our name on the list and took a little walk for about 25 mins until our table was ready. <br><br>Drinks; latte. Beer. Wine. Cinnamon matcha.   All where tasty.  <br><br>We order 3 meals and an appetizer and my entire party shared so we could taste all the different dishes.  It was so hard to pick what to eat it all looked good! <br><br>Ordered the kale pesto cheese appetizer.  Ordered additional bread and our server forgot so we didn't finish that.  We also ordered the Thai salad.  It was so flavorful it had a spicy kick! Chili chocolate salmon was served with a green salsa tortillas and slaw oh was it tasty.  Angus burger and fries was the third meal.  Those fries so yummy.  <br><br>We left to run to an event and didn't get to try anything in the bakery case.  I was bummed about that.  Try a little something for me!", "pics": null}}, {"review": {"des": "LOVED this place! Came in 15 minutes early but was seated immediately. I had the cauliflower steak over mashed cauliflower, and even though it was a lot of cauliflower it had SO much flavor! My friend had the chicken Parmesan which was also so tasty, warm, and a soft enjoyable texture. The staff was great and willing to answer all my questions, and the price point was just right in my opinion!", "pics": null}}, {"review": {"des": "I'm glad I finally got to try this restaurant! I would have liked to come for brunch, but was pleased by the dinner  experience. We had fries for our appetizer, which were pretty tasty. I got the roasted cauliflower salad with salmon for my entree, and this was a great portion and tasty as well. Service was fairly slow but the night was understandably busy on this weekend. <br><br>Overall, I think this is a pretty average restaurant with some nice healthy options. Nothing special rather than being a crowd pleaser as there is something for everyone.", "pics": null}}, {"review": {"des": "I'm really glad my local friend brought us here for brunch!<br><br>First, we were so difficult with changing the reservation time (not once, but twice) and the number of people, and a few of us arrived much later than the others, but it didn't phase the waitstaff. This is especially gracious seeing how busy it is. THANK YOU!<br><br>Second, the menu was so appealing that I didn't know what to get. To help cure my hangover, I ordered the green juice... a super healthy-sounding concoction that was actually really delicious. As for my main, I ended up going with the waitress's favorite dish, the quinoa cakes with poached eggs. This was superb. The quinoa cakes did not fall apart easily, and the eggs were poached to perfection. The tomato sauce and the greens helped to make this a very flavorful dish. It was filling but did not make me feel grossly full.<br><br>Of note: two of my friends ordered the egg white omelet, which seemed rather boring to me but actually looked really good. It was loaded with avocado and colorful cherry tomatoes, and it came with strips of turkey bacon on top.<br><br>Finally, one of my friends asked the waitress to bring us all our own separate checks. I hate to ask this, but she happily obliged and I was grateful!<br><br>Overall, this brunch was stress-free, hip, delicious, and energizing. I would definitely recommend.", "pics": null}}, {"review": {"des": "Every menu item looked amazing--it was hard choosing a meal! My boyfriend took me here for Valentine's Day, and it wasn't over crowded, which was nice.", "pics": null}}, {"review": {"des": "\"Taste Over Trend\" is what it says at the bottom of Beatrix's menu, but let's be honest... Beatrix is just a little bit hip ;) We came for breakfast & Beatrix stood out from all the nearby offerings because it serves traditional breakfast offerings with just enough of an alluring twist (and you can make reservations on Opentable)!<br><br>Had the: <br>*STEAK CHIMICHURRI & EGGS - (grilled shishito peppers, eggs your way, golden hash browns $15.95) I read a lot of reviews that the portion was small and the meat was too well done. However, I really enjoyed it! Even though it was more on the well side, I was able to easily cut through it without a steak knife. The chimichurri was a nice touch. I also thought the portion was fine - plenty of meat! I mean a meat serving is really only supposed to be palm-sized right?! I subbed out the golden hash browns with the sliced tomato & avocado side. No complaints! <br><br>*EGGS YOUR WAY - (golden hash browns, whole grain toast, choice of brown sugar bacon or our chicken sausage $11.95): boyfriend ordered this & thoroughly enjoyed it. Chicken sausage was in a patty form as opposed to sausage form. <br><br>Beatrix also serves bulletproof coffee (coffee with butter & coconut oil), but at $8.95, I wasn't sure I wanted to bite the bullet (ha, dad jokes.) I also went up to look at the case of tasty pastries, but also held off because I was very full from the breakfast plates! <br><br>48/365", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/727ONo27IMOdbaQurl1JUg/348s.jpg", "caption": "Steak Chimichurri & Eggs (poached) and subbed hash brown for Sliced Tomato & Avocado"}]}}, {"review": {"des": "One of my favorite places to go when I am in Chicago! They have bullet proof coffee which is amazing and gets me Verrrrry focused for my day! Be warned the BP coffee is 8.95!-- I had a bulletproof coffee before I wrote this yelp review!!! Which is why all the !!! What I also like about Beatrix is that they have a ton of \"healthy comfort food\" locally sourced and they  have delicious desserts too!", "pics": null}}, {"review": {"des": "Beatrix provided such an enjoyable restaurant week experience. Delicious three course meals at $33/person, attentive and informative service, and a warm and cozy seating space. We were thoroughly impressed. <br><br>We loved everything we tried, including;<br>-burrata with pesto, grainy bread and crispy kale<br>-kung pao brussels with pine nuts <br>-chili and chocolate salmon (HUGE portion!)<br>-chicken bebe (we only wish there was more asparagus)<br>-oh my caramel pie <br>-tall, dark and handsome chocolate cake (sinful!)<br><br>Beatrix is on the pricier side for a more casual restaurant (the salmon alone is $25!), so their RW menu and pricing is super generous. Totally worth a visit! Job well done, Beatrix. I'll gladly return for their bulletproof butter coffee and a sweet treat. :)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/koUgQttDZ2vjUH_NXKb8hw/348s.jpg", "caption": "Oh My Caramel Pie"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rBJBQq01Omekww63ryaA-Q/168s.jpg", "caption": "Tall , Dark & Handsome Chocolate Cake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SVSXW8hCo5xIBGP6r3Ei3A/168s.jpg", "caption": "Chicken Bebe"}]}}, {"review": {"des": "This place is vibin! Good for lunch brunch and dinner. Food is very fresh and the menu is good for anyone because there are meaty and vegetarian options, sweet and salty, savory, you name it! They also have fresh squeezed juices and cocktails. Good for a group or a date, very versatile. Make sure you make a reservation!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FN38xryDDg7noexYU69NTQ/168s.jpg", "caption": "Awesome vibe when we walked in!"}]}}, {"review": {"des": "With the goal of having brunch before check-out, I wanted to select a place nearby that was opened earlier than most. Because we did the Riverwalk the evening before, we spent a leisurely morning at the hotel before walking to the restaurant. Luckily, I factored in \"getting lost\" time so we still made our reservation.<br><br>Located in the lobby of ALoft hotel, the restaurant can accommodate both small and large groups. I loved the cute wood pendant lights and criss-cross wood beams. Even bar seating, something that I typically avoid, looked interesting, mostly because it was located next to this amazing pastry bar. Although it was still early morning, there was already a wait.<br> <br>The menu was healthier than most and diverse, including cauliflower grits, shakshouka, and chicken tinga. My sister picked the ahi tuna bowl and I had the steak and eggs (even though I wanted the lemon pancakes); we were both interested filling up with protein before our flights. <br><br>The steak was cooked to a medium-rare, tender, and served with grilled shishisto peppers, eggs, hash browns, and toast. It was okay, but not fantastic, or even memorable. The brown sugar bacon was better, not as sweet as the name would imply.<br><br>Service was unremarkable.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Roqp44T9IomX-UOUrmXwEw/168s.jpg", "caption": "Steak and eggs - protein to sustain me through the flight home."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZA_guTPcCUU52GvM4dR6lg/168s.jpg", "caption": "Maple bacon was cooked to the right level of crispness; it was also not too sweet."}]}}, {"review": {"des": "My coworkers/team had a conference in Chicago and my boss made a reservation here to kick off our weekend together.<br><br>Here's what we ordered and shared with each other:<br><br>- LOCAL BURRATA<br>- AHI TUNA CRUDO<br>- PAN-ROASTED CHILEAN SEABASS <br>- WAGYU POT ROAST FILET MIGNON<br>- SLOW-BRAISED SHORT RIB<br>- CARAMELIZED PORK SHANK W/ CIDER REDUCTION<br><br>Everything was beautifully cooked, portion size was just enough to finish everything on the plate, super tender and flavorful. Service was great, desserts were delicious but heavy (a little overkill). I've been told Chicago has such a great foodie scene, I would recommend making a stop at Beatrix for your food journeys!", "pics": null}}, {"review": {"des": "Great for brunch and dinner! <br><br>Anytime I have gone, I made reservations because it was ALWAYS packed! I went for brunch a long time ago but in December, I went for dinner on NYE and ordered hummus with warm naan (which we all were excited about because naan is Indian food but turned out to be tortilla bread) regardless it was delicious! For the main dish, I ordered the housemade ricotta ravioli which was made out of butternut squash& brown butter and made all the difference! Portion size was great and the staff is really nice.  <br><br>The cookies are also really good- I have only tried the chocolate chip and normally I don't like those kind but this was warm and not too much chocolate. Need to try more next time! Another amazing dessert is the \"oh my caramel pie!\" Which is simply divine. <br><br>Would recommend this place to everyone! :)", "pics": null}}, {"review": {"des": "Finally went to Beatrix with my fiancée for the first time for breakfast on Tuesday. The River North one has a very modern interior, lots of comfy seating and multiple bars. <br><br>I'm not a coffee drinker so I went straight for food but my fiancée's mocha looked really cute. I ordered the waffles which had strawberries and a sweet cream frosting. It was really, really good! There's 4 small waffles instead of one giant one and it's quite a bit of food for the price. Would absolutely order it again. Her pepper and egg white sandwich also looked solid. <br><br>I wouldn't say Beatrix holds up against the real brunch kingpins in the city, but it's nice place to grab coffee and a quick bite!", "pics": null}}, {"review": {"des": "A fantastic experience from start to finish. My husband ordered the seabass and I had the Chicken Bebe. Both were absolutely phenomenal. Compliments to the chef. However, the real 5-stars goes to our waitress Reesha (please excuse if I have misspelled). She was incredibly helpful, attentive and always around if we needed her for anything. She was intuitive and met all of our dining needs while we were there. A true gem. Thanks for helping make my birthday dinner that much more special.", "pics": null}}, {"review": {"des": "So, we went here for lunch as a team. We were all in town for business and this was our last lunch together. It came with high recommendations and we were all hype. My boss made a reservation and then we waited and watched walk ins get sat. It was awkward just standing around and being in the way but it did give us a chance to check out the juices and baked goods. (They have samples, and big ones) We were sat and a tree joined us. Literally, the tree was on someones head. The menu is limited and not very accommodating and pricey. Whatevs. I survived. But we ordered these  fries that were suggested and I am not sure why. They are nothing to compare to fries back home. The burger (with no bun) was meh. The juice was slightly better. TL;dr - plan to spend money on mediocre food.", "pics": null}}, {"review": {"des": "Wow.  Wow.  Wow.  <br><br>I really loved everything about my dinner here.  Service was perfect.  Thoughtful, helpful and knowledgeable.   Food was amazing.  The burrata app was one of the best burrata plates I have ever had with the most amazing pesto.  The chicken I had was cooked perfectly with this amazing flavorful and light sauce.  And the strawberry pie for desert was \"lick the plate\" good.  My dining companion had the \"ravioli\" which were loosely rolled pasta with ricotta. Also incredible.  I can't wait to come back some day - or hope they expand out of Chicago to Florida!", "pics": null}}, {"review": {"des": "Pretty solid brunch spot in River North. This place is pretty crowded on the weekends so make sure you have a reservation! They serve a variety of healthier brunch options such as quinoa Benedict's, salads and juice concoctions. This time we tried the green chile chilaquiles buffet ($13 pp) which has nachos with shredded chicken, cheese, scrambled eggs, salsa, guacamole and sour cream. The chicken was tender and the nachos were flavorful. This was a great value since it was all you can eat! We also got an order of lemon ricotta pancakes to share ($13) which was delectably fluffy and eggy. All of the food that I've had hear has been great, the only negative aspect is that the service can be slow since it's always so busy during brunch and the room can get loud/noisy. <br><br>Next time when I come back I want to try their bakery items and coffee bar which has delicious specials like turmeric and matcha lattes and peanut butter hot chocolate!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/L-7P5_XzUKZBBBTLLaua0w/168s.jpg", "caption": "Light & Fluffy Lemon Pancakes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/45XJcF25WOhxmcNaUgAazQ/168s.jpg", "caption": "Green Chile chilaquiles plate"}]}}, {"review": {"des": "Went to dinner with my work coworkers while in Chicago . Lots of gluten free options. Actually my coworker picked it because she knew of my dietary restrictions. The funny thing is she told me it was a Mexican restaurant. When we got there the only Mexican sounding item on the menu was a margarita drink. Lol.  I am still thankful she tried so hard and of course I kept joking with her especially since I am Cuban and not Mexican. <br><br>Anyway the selection was great and indeed a lot of gluten-free options. The humus with gluten-free pita was just one example of the yummy food. The place was very open and well done. Next time in Chicago I will try this again.", "pics": null}}, {"review": {"des": "Awesome brunch spot for St Patty's day in downtown River North!<br><br>Super popular and trendy open space with 2  sports bars for solo diners and a lot of seating.<br><br>Ordered the Cauliflower Grits (with egg & brussel sprouts & parmesan), and Green Chili Enchiladas (with chihuahua and pepper jack cheese & eggs & baby kale & poblano peppers). Food was amazing, not too salty and wonderfully filling. Atmosphere is cozy and bright (esp with St Patty's celebrations). Waiters are hard to flag down but kind of understandable with the crazy busy traffic  flow.<br><br>Would come back again to try their dinner menu.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/i5S3gTk0ymSpsFBMqlueBQ/168s.jpg", "caption": "Enchiladas"}]}}, {"review": {"des": "On my 2nd day in Chicago, I woke up way too early and started walking around the area looking for Starbucks but I ran into this place instead. I opened Yelp and it had decent reviews so I checked it out and I'm very happy that I did. <br><br>Besides the to-go counter with scrumptious pastries, they also have a lovely dining area with full bar. I was craving for a hearty breakfast so I just grabbed a Kouign-Amann pastry from the counter and sat at table by the window. My server immediately brought me water and menu then took my order. First, I got a Mocha for my pastry because I love dipping, plus I needed to wake up :)  For breakfast, I ordered the Spicy Chicken Tinga (spicy tomato sauce, poached eggs, kale, feta, warm naan). It was full of flavor and also nicely presented. The bold sauce wasn't too spicy either, just the right amount of heat. It was the perfect dish for the cold weather in my opinion. Pastries are about $3 average and breakfast items start around $7 to $15 so it's pretty affordable.<br><br>Very pleased with my visit here. The quality of the food was good and the service was attentive and friendly. I wish I had time to come back and check out their dinner service because the pics online looked awesome.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sOf7avFCoizz8D14u7mMfA/348s.jpg", "caption": "The back view of the yummy Spicy Chicken Tinga"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EoMn3hyUP9rjJnILFMLZcQ/168s.jpg", "caption": "Spicy Chicken Tinga"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/b4i9_qrgoy_gcT67uoRPLg/168s.jpg", "caption": "My Kouign Amann pastry. Great for coffee dipping"}]}}, {"review": {"des": "Wow, I just can't say enough great things about my experience here. I came for dinner by myself on a work trip, around 7 on a Wednesday was seated immediately. Everything about this place is wonderful, the decor is great, the distribution of seating is aesthetically pleasing, there is definitely mood lighting but I didn't have to use my flashlight which is always appreciated.<br><br>Started off with one of their cocktails, all of which are made with fresh juice, and it was DELICIOUS. I'm not a huge vodka person but I got a vodka blueberry drink (I forget the name) but it was super fresh and light and perfectly done.<br><br>It was restaurant week so I got an appetizer, entree and desert for myself and it was a LOT of food. The burrata was delicious, it comes with toasted bread and this amazing pesto, and the serving size is pretty large so it would satisfy a few people. For my entree I got the chicken Bebe......and there's nothing I can say other than wow. The chicken was juicy, perfectly breaded, perfect amount of cheese, the ultimate comfort food. For desert I had the caramel pie.....I am still dreaming about this pie. It was a HUGE slice of creamy caramel-y melt in your mouth amazingness, and I need more pies like this in my life.<br><br>Overall would recommend this for literally any occasion. This is the sort of restaurant I will return to Chicago for!!!!", "pics": null}}, {"review": {"des": "Brunch awesomeness steps away from our hotel... yay!  Found this place on yelp and ventured out into the cold on a Saturday morning, it did not disappoint!  Fun urban space, great friendly service.  The place was already nearly full by 10 am, go early or make a reservation to avoid a wait.  <br><br>Coffee was good and refills were prompt.  I had the egg white omelette which was really tasty, not always the case with egg white omelettes.  The tomato and avocado salsa on the side could have used a little more avocado, but the flavour was amazing.  Nice side of multigrain toast with yummy raspberry jam, and I am not normally a jam person... <br><br>My daughter had the strawberry waffle and loved it as well.  Best breakfast of the trip by far.  Will definitely be back next time I'm in Chicago.", "pics": null}}, {"review": {"des": "I.Love.the. Beatrix. When we we're in Chicago we come here for at least two meals. The breakfast is delicious, I've had the eggs over some mexican dish and it was really good. My favorite go to meal is the 3a salad... apples, arugula, and Asiago... and then I add chicken. Amazing!! Also, it's a heart portion so don't underestimate it.<br><br>What brings me back for more though??! The joy cookies! They're gluten free and they're a play on almond joy cookies. Every time I leave Chicago I come back with a dozen of these cookies and freeze them and enjoy them for months after.", "pics": null}}, {"review": {"des": "One of my favorite go-to brunch spots now has a sister location in Fulton Market (be sure to check out their grab and go market section and awesome salad bar!). Pictured: Poached eggs, Chalula and quinoa cakes. Highly recommend the chilaquiles bar also.", "pics": null}}, {"review": {"des": "Hubby and I were here before an event. We had an early dinner. We go there about 3pm. I was hoping for the brunch menu, but we were too late. <br>I had a tumeric chai. Good, but one cup is enough. It's very rich.<br><br>Hubby and I split the burrata. It was yummy but messy to eat. We asked for spoons. And could have used another piece of bread or two. <br><br>We both opted for the caesar salad. I had salmon on it. Hubby had filet on his. I thought they skimped on his beef. My salmon was a small but good enough portion. The salads were tasty, but nothing special.<br><br>The dessert was killer. We split a piece of caramel pie. I will think about that pie for a loooong time.<br><br>Our waiter was nice and attentive.<br><br>The place is ok. I'd say it's a good brunch/lunch place... or casual dinner is ok. I think their brunch items looked better than our salads.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/G_xAV4L18Y8X4ZpB5Cp69g/348s.jpg", "caption": "Caramel pie"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PWHdtfRNp95GcyAsqLCh1w/168s.jpg", "caption": "Enlightened Caesar with salmon"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OfctOHmOngtH1h8edLalVQ/168s.jpg", "caption": "Burrata app"}]}}, {"review": {"des": "This was pretty yummy. Went here after my friends decided to wed on Valentines Day. It was a nice setting, cool vibe for the Northwestern area. Food was yummy and cinnamon latte could have been sweeter. Hey I like it sweet. I had the STEAK CHIMICHURRI & EGGS - $15.95<br>grilled shishito peppers, scrambled eggs with cheese, golden hash browns. Delish, I just wish the steak was much bigger. It's was literately 5 small pieces.", "pics": null}}, {"review": {"des": "Met a friend here for brunch on Christmas weekend. We didn't have a reservation so we gave them our name and it was about a 15 minute wait; not bad at all for a Saturday at 11:30.<br><br>The inside of Beatrix is interesting, it's got some kind of rustic looking tables but at the same time has a modern flare to it. It's not fancy or swanky or anything, but rather much more approachable and friendly.<br><br>The brunch menu is straightforward, the items are listed in order from lightest to heartiest. They also have a full service coffee bar, freshly squeezed juices and many other interesting beverage choices. I opted for the banana joe, it was an alcoholic cold coffee drink that tasted more like dessert, but was super super good, and there was a lot of it! Friend liked the coffee.<br><br>We ordered the egg white omelet and the steak chimichurri and eggs. We both thought our food was fantastic. My omelet was super flavorful for being egg whites, it had spinach, white cheddar, a pico de gallo type of topping, guacamole, as well as a slice of toast and some turkey bacon. Everything was fantastic!<br><br>I forget our server's name, maybe Alex ironically? But he was super helpful and kind.<br><br>Overall an excellent experience at Beatrix. High quality food, fair portions, interesting drinks, nice service and reasonably priced. Can't beat that!<br><br>Will be back for sure.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KOY2izrIad7up_RljT_hcA/348s.jpg", "caption": "Egg white omelette"}]}}, {"review": {"des": "I came to Beatrix for a solo dinner on a business trip. The host wasn't sure if they would have any tables open for some reason. But they have two bars that are open seating. I ordered a glass of wine to start. A Pinot Gris that was a bit to mild and meek for my taste. I wish I had tried one of their fresh juices, which all sound amazing! For food, I ordered the hummus appetizer, which comes with pita and oiled veggies (cherry tomatoes, cucumbers, and onions). For my entrée, I ordered the Chicken Bebe. It's a thick piece of lightly breaded chicken with three pieces asparagus covered in cheese. The dish is topped with a lemon butter sauce that I wished was a little more lemony and tart. The dish is lacking a grain side to make it more filling. Overall super tasty food! And the bartender was friendly and helpful!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BoP05kSjzna_eRXrwfJfIA/348s.jpg", "caption": "Chicken Bebe"}]}}, {"review": {"des": "This place was unexpectedly good! I went in thinking that it is probably just another trendy River North restaurant with high prices and mediocre food but I was so wrong! The food was delicious and the drinks were great too. We had a large group   But they accommodated us just fine. We started with Brussel sprouts and burrata which were both delicious! I had a special for my entree which was \"Thai Fish and Chips\".  The fish was sea bass and came baked with a great spice rub, sweet potato fries, and a tangy cabbage slaw. The Rose All Day drink was great and had a unique flavor. The overall atmosphere was cool and conducive to conversation with friends. The only drawback was that it was a tad pricey for what you get but then again, it's River North! Overall, it was a great experience and I'll definitely be back!", "pics": null}}, {"review": {"des": "This place must be well known, because I heard three different people say something about Beatrix while walking though the streets of Chicago. Unless I missed the Potter, they were talking about the restaurant. We arrived for our 8:15pm Saturday reservation a few minutes early, but ended up waiting 30 minutes to be seated. To make things better, they gave our party of nine, 6 free appetizers. We got two orders each of the brussel sprouts, burrata, and hummus. Brussel sprouts and burrata stole the show. The entrees were pretty lackluster, i had a salad with chicken. Not many others cleared their plates. <br><br>The menu is somewhat limited. And aside from the fresh squeezed juices that could be spiked I didn't see much in the way of cocktails. The service was slow, and when it came time to wanting to leave, our waitress disappeared for a half hour. Wouldn't come back unless I was in a pinch.", "pics": null}}, {"review": {"des": "great lunch spot. I got the crispy kale salad and fries and it was very fulfilling and full of flavors.", "pics": null}}, {"review": {"des": "Incredible fresh drinks and food. Healthy options that don't have to compromise for taste or portion size! Fresh made juices that you can spike with top shelf liquor for a fun evening out! Highly recommend the burrata with pesto for an appetizer. Our table had the chicken bebe, ravioli, chili chocolate glazed salmon, and kale sweet potato turkey neatloaf! Tasted like thanksgiving in one bite!!<br>Only downside was the service. Seemed a bit understaffed. Our reservation was at 8:15 and we didn't order our dinner until well after 9. Otherwise incredible and definitely will be back for breakfast options", "pics": null}}, {"review": {"des": "Food was so good and i love love loved the atmosphere. We came here for brunch around noon on a Saturday with a reservation. The star off is for the service -- the waiter was nice enough but just not very attentive. The place wasn't completely busy either so idk why we had to wait so long for water, menu, or order, the check, etc. Maybe was just an off day service wise...", "pics": null}}, {"review": {"des": "My partner and I came here the day after Thanksgiving at 8:00 AM. Yelp offered us reservations for that time (when we looked it up the night before) but we really didn't need them. We walked right in and saw the majority of tables open. <br><br>Service was prompt and friendly. Our server gave suggestions for items after we told him it was our first time. <br><br>I loved the decor! Sort of a mix of industrial but also with a rustic warm feel, eclectic selection of chairs, etc. Being next to the window with all of the light was nice. <br><br>I got the egg white omelette but substituted regular bacon instead of organic turkey bacon. Everything tasted so fresh, especially the tomatoes. I had expected them to come out cut up into smaller pieces, but ended up really enjoying them as they were, especially with the avocado mixed in. The omelette was filled with cheese and spinach - so yummy!! Everything was light and also filling! <br><br>I would gladly go back when I'm in Chicago again!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JQ5_szd6n3H4qZBqloppAg/348s.jpg", "caption": "Egg white omelette with bacon, tomatoes, avocado, and toast"}]}}, {"review": {"des": "Came here for brunch twice in the span of a 5 day trip to Chicago because the place is that good. <br><br>The place is super popular and was PACKED. The atmosphere is trendy and airy with a hint of industrial. The service is prompt and friendly. The menu is diverse, and the food was on point. <br><br>The lemon pancakes were a slam dunk- so so good. The juices they serve are also really tasty, and their coffee was good. <br><br>Overall, definitely worth a stop in when you're in the River North area.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7A4Bda2a-hHjgUrDqRRy7w/348s.jpg", "caption": "Lemon pancakes"}]}}, {"review": {"des": "We stopped by Beatrix for breakfast after a class at Barry's so we were good and hungry. <br><br>I ended up getting their kale, egg white, and pepper jack sandwich and a single lemon pancake. The sandwich was just okay. Not bad, but it certainly wouldn't warrant a repeat visit. The lemon pancakes however were really good, just pretty thin so not what I'd order if I wanted something filling. <br><br>What does (and did) warrant a second visit was their honey butter icing cinnamon roll. By chance when we went Friday morning they had one left and I decided to try it. Best decision ever. This thing is amazing. So amazing that before I left Chicago I went back and got another one. I literally was eating it in the taxi on the way to the airport.<br><br>And all of their baked goods looked good. They had several others that I wanted to try, so next time I'm in Chicago I'll probably just stick to the bakery items to be honest.<br><br>I will, however, order one of their juices because those were really good too. I tried their Pineapple, Pear, & Ginger and their Blue Boost and enjoyed them both. If I had to choose though the Blue Boost edges out the Pineapple, Pear, & Ginger. I think it was the basil that did it for me.<br><br>Although they were quite busy both times we went, we managed to get seated quickly and the host and our servers were very nice.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TY5VYMY9_Bnyn0w6_fTTnw/348s.jpg", "caption": "Pineapple, pear, & ginger juice. Really good!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wsAyLUlCzKaFds2FI30OXQ/168s.jpg", "caption": "Kale, egg white, and pepper jack sandwich. Not bad but nothing to write home about. The lemon pancake, however, was quite good!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ronj2c4kGtvwCXFpGytkdA/168s.jpg", "caption": "Orange Mango (left), Blue Boost (right). They both were good but the Blue Boost was really good! I'd recommend it."}]}}, {"review": {"des": "Overall, I had a pleasant experience here! Service is great and really fast. I came here for brunch with a friend - we got the Belgian waffles and the lemon pancakes. The pancakes were really good, but way too sweet - so sweet that I kinda got sick of it after my first pancake. It would've been great for dessert. It was also a little too burnt for my liking.. for some of the edge bites, the burnt taste overpowered the lemon. We also got the side of hash browns though which was really really good!!! <br><br>I've read that one of the must try dishes here is the lemon pancakes that I got. I would have to disagree - I think I would've enjoyed some of the other foods a lot more! Maybe just a personal preference though.", "pics": null}}, {"review": {"des": "This is what love feels like.  We ate here two days in a row while in town. <br> The dinner was so good; we decided to come back for breakfast.   What a fantastic menu; something for everyone:  Gluten-free, innovative non-alcoholic drink menu, delicious coffee creations, fresh juices, fantastic appetizers, a nice assortment of pastries, cookies and desserts...  This place has it all really.  The food is high quality and satisfying.  Let's start with some favorites; please order the Lemon Pancakes.  They will not disappoint.  I could overdose on the Chia Pudding for dessert.  Yes, it's that good.  The same could be said for the Oh My! Caramel Pie.  Trust the wait staff on their recommendations.  They did not steer us in the wrong direction.  The Blueberry Lemonade was the perfect balance; not too sweet with just the right amount of blueberry flavor.  Very refreshing on an August night.  The Quinoa Cakes with Poached Eggs are culinary perfection.  Start with the Local Burrata or Hummus at dinner.  We tried both.  So good!  The Chicken Bebe, Pan-Roasted Bass, and Prime Burger all got rave reviews.  The Szechuan Chicken was the least favorite.  A bit too much of a good thing I think.  Helpful, welcoming, friendly staff.   We'll be back for sure.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8zDqfVGE0GgPzhcOlNx2Fg/348s.jpg", "caption": "Local Burrata.  Iced-teas and blueberry lemonade in background.  Yummy stuff."}]}}, {"review": {"des": "Came here for breakfast with my spouse while we were on vacation Chicago. I wasn't sure how busy the restaurant was going to be, so just in case I made a reservation for 8am.<br><br>When we arrived, most of the restaurant was empty. We did go the day after a holiday, so most people were probably still in a food coma. I would still choose to make reservations the next time I visit though.<br><br>For breakfast, I had the Light & Fluffy Lemon Pancakes, and my spouse had a Wonderful Egg White Omelet. My pancakes were SUPER fluffy, just as the title described. I had never had pancakes so fluffy in my life! \"It's so fluffy I'm gonna die!\" (The server said they were cooked like a souffle, which explained the fluffiness.)<br><br>The egg white omelet was also just as it was described, \"wonderful\". I'm normally not a huge egg white omelet fan, as I feel taking the yolk out takes a lot of the flavor out, but this one was different. The omelet was beautifully cooked and was full of flavor, while the accompaniments added another layer of deliciousness to the dish. I would order this again in an instant, though I would do what my spouse did and substitute the turkey bacon with regular bacon.<br><br>This is a great breakfast/brunch place, and probably dinner too. Loved the decor and the food. Would highly recommend you check this place out if you are in the area!", "pics": null}}, {"review": {"des": "Oh, Beatrix. How I love you so. Their food is exquisite and the ambience of the restaurant has an urban farm style feel. Think open concept layout with modern wood furniture, colorful chair and pillow accents, fun light fixtures, and hanging greenery. It's a great place to dine with a group!<br><br>My first visit to Beatrix was a couple years ago. I came for brunch with co-workers and enjoyed a delicious meal. I had the potroast breakfast sandwich which was great. Per usual I felt the struggle between a sweet or savory breakfast, but I was lucky that my brunch-mates felt the same indecision! We ordered a lemon ricotta pancake to split as an appetizer which was a fantastic idea. Definitely follow suit if you have a sweet tooth! For my morning pick me up beverage to accompany my meal, I indulged in their cinnamon honey latte which was fabulous - smooth, sweet, and strong.<br><br>My second visit to Beatrix was just today for lunch with co-workers. Service was great just like last time, and we were able to snag a table for four right away at about 12:30pm on a Tuesday which was nice. I ordered the mushroom quinoa burger which our server said was delicious. And boy was he right! The burger itself was a nice size and had a lot of flavor. Swiss cheese, baby kale, and tomato rounded out the sandwich and it came with a side of kennebec fries, sriracha aioli, and ketchup. These kennebec fries were like the best fries I've ever had! Thick cut and perfectly crunchy on the outside and soft in the middle. Yum! I tried a few of the kung pao brussel sprouts we got for the table and well and they were very good too.<br><br>I'll be back to Beatrix with co-workers or friends for sure. I suggest you give 'em a try!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eLgepmKLhHp4uMoTc5XyYQ/168s.jpg", "caption": "Mushroom & Quinoa Burger"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/z3gABj2zVM67FdIbQeX3nA/168s.jpg", "caption": "Mushroom & Quinoa Burger"}]}}, {"review": {"des": "Beatrix has been a great, reliable lunch spot for me!<br><br>This gorgeous restaurant is a short walk from the Merchandise Mart, and therefore has become a regular staple in my lunch rotation. It's super easy to make a reservation, service is always great, and the vibe lends itself to a relaxed environment. I love the natural light and the healthy menu.<br><br>You can start your meal with some fresh-squeezed juice or a strong cup of coffee, or if you're like me, both. <br><br>If you want to start with a snack, I highly recommend the kung pao brussels sprouts. They are pretty awesome. Also, the Kennebec fries are outstanding (definitely choose those as a side if you're getting a sandwich or burger.)<br><br>I love both the asparagus soup and the three-grain salad. Beatrix is great because you leave feeling full and satisfied, but it's so easy to keep it healthy.<br><br>I will definitely be back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SHTSzzohA6kTQSTnhRKP-A/168s.jpg", "caption": "Vegan Asparagus Soup"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KwBZwJX0X3zVpcUzOuctUw/168s.jpg", "caption": "Three Grain Salad"}]}}, {"review": {"des": "What's a kennebec fry? Well let me tell you...<br><br>It's the best french fry I've had in my adult life. If you get anything at Beatrix, get the kennebec fries. Why?<br>Each fry was fresh, crispy on the outside, soft on the inside, handcut, seasoned with sea salt, and did I mention irresistible? I didn't want to stop eating them, and I could kick myself for not bringing home my leftovers (that's just sad).<br><br>Skip the meal if you want and just get the fries, though you will be missing out. My pot roast sandwich was deliciously packed with lightly seasoned meat and served on a bun that had crusted cheese on top? So yummy and a nice complement. <br><br>It's a Lettuce Entertain You Restaurant, so it's safe but with a unique reliable menu. Great salad selections for lunch. The menu is a nice touch, where they list the menu items from light to heavy. <br><br>Service was fabulous, friendly, and quick!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4l_eOSKcro6y21XYuEQG4g/168s.jpg", "caption": "Open airy space with a chic, yet homey feel."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rwPiZEdq_ijH7DXk4Hsppw/168s.jpg", "caption": "Best fries of my life...kennebec fries."}]}}, {"review": {"des": "8-26-18:  A M A Z I N G ! ! ! Was in town visiting and Yelped a spot for Sunday brunch. After reading the reviews for other locations this place stood out to us the most. Walked from our hotel and upon getting here was told it would be 1+ for 2. While waiting we ordered coffee (off to a good start) Coffee and bomb. Mexican Iced Coffee and Honey Cinnamon Latte . While we stood enjoying our drinks a spot at the bar opened up and we sat down. Bartender informed us it was full menu. We order the Steak Chimichurri & Eggs and the Green Chile Enchiladas - both out of this world!! We'll definitely be back.", "pics": null}}, {"review": {"des": "Beatrix River North was a great spot to have dinner out on a busy night in Chicago. I was with a large party of 10 people that had mad reservations so they were able to seat us fairly quickly and we were immediately offered above par service. Our waiter was patient as we decided what we wanted and super attentive to our large group. <br><br>I ordered a Vodka soda which was super delicious and the burger. The burger was huge, tender, and juicy. It was honestly amazing. The restaurant gets a little crowded because they try and cram as many people as possible into a fairly small space so you have to watch your elbows as you go by other people by all and all a nice place, with good ambiance, and great service.", "pics": null}}, {"review": {"des": "One of my favorite lunch/dinner places! Everything on the menu is worth trying. Tonight I had the Slow-Braised Short Rib. It was cooked to perfection. I have never had celery root puree and I was impressed with how delicious it tasted. I wouldn't mind substituting my mashed potatoes for it from now on. <br><br>Most importantly, you can't come to Beatrix without saving room for dessert and indulging in the Oh My Caramel Pie! Absolute perfection. I can have that pie everyday.  And continue to be impressed with how delicious the food is here.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-f_NE5M_ayixS3M4SkA0sQ/348s.jpg", "caption": "Oh My Caramel Pie. Oh my.."}]}}, {"review": {"des": "Abosutely awful service. I asked for a medium well egg and it came runny. I had to walk up to the vou ter to get sugar after I asked for it 3 times.<br>I was sold into ordering their \"freshly squeezed\" juice. Since I like to make my own orange juice at home, I was happy to know they had it. What a disappointment! It tasted bitter, like it has been sitting there for hours before served. It didn't matter how much sugar I put in that thing. <br>Updates on September 15th: manager reached out which is nice. Went back today and it was not as busy so service was better. Coffee is still subpar and waitress could have been a little bit more friendly but chicken sausage was very good. Change my review from one star to 3 stars", "pics": null}}, {"review": {"des": "The perfect way to end a weekend getaway to Chicago!! We had a reservation at 11:15 and were unfortunately a little late but they didn't bat an eye once I gave them my name. The waiter was prompt and kind. Awesome atmosphere and decor. Every table has different chairs, some are couches (that was clutch for me), and lots of different light fixtures. Conveniently located next to the lobby of the Aloft Hotel. <br><br>Coffee was the perfect temperature, and food arrived 10-15 minutes after ordering. Myself and a friend both got the Chia Cereal dish, and lord have mercy that was life changing. So delicious, creamy and wonderful! My husband was raving about the pot roast sandwich and now is convinced he can make it at home. <br><br>Make this is stop on your trip, or a staple if you live there. My husband and I both had coffee and an entree, and I had a cold-pressed juice and we left with a $40 bill, extremely reasonable.", "pics": null}}, {"review": {"des": "There are around 8,000 restaurants in Chicago - or so sayeth a random, unverified link I clicked on.  The point is, life is short, and with thousands of other dining options, you would be wasting your time by spending your illicitly-earned bitcoins at Beatrix River North.  Yes, they do have really cool huge wall-mounted concert photos of Mick and Keith presumably ripping through Stones classics, but they also featured:<br><br>A cappuccino that tasted solely of steamed milk.<br>A mimosa with flat champagne and extra pulp.<br>A cold, greasy, piddly amount of steak in the steak and eggs, accompanied by a thawed square of mushy hash browns and tasteless value-priced 24-pack eggs.<br>A chicken tinga dish which was the equivalent of throwing a bunch of chicken and salsa into the slow cooker - which is not that bad a meal, but also something I can just make for myself, which is not exactly the experience I am looking for in a restaurant.  <br><br>On the other hand, the coffee-booze-banana smoothie drink was good.  It did look like many of the people there were ordering pastries instead of entrees, which might be a safer way to go if you choose to disregard this warning and attempt to brunch at Beatrix.", "pics": null}}, {"review": {"des": "This place is very busy all the time so the first thing I would suggest to avoid an hour and a half wait, is to make reservations. <br>This is one of the places I like to go for brunch. They have a great choice of daytime drinks, coffee shop  and healthy great tasting menu. They serve breakfast, brunch, lunch and dinner. Gluten free menu is also available.  <br>Last time I really enjoyed Turmeric Rush (turmeric tonic infused bourbon!) and Cauliflower Grits & eggs. <br>We set at the bar last time and our bartender was great!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/krcbFGlnjL2AaBGF8WitGQ/348s.jpg", "caption": "Cauliflower grits and eggs"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KkmRJK9aQ6Gq43YcnXx2KQ/168s.jpg", "caption": "Quinoa burger"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MnDN7ijw6cdQYmAbaWpTYw/168s.jpg", "caption": "Turmeric Rush and The Sinker"}]}}, {"review": {"des": "We have regularly walked and rode by this location for years and have always meant to visit for brunch and just never got around to it. This Saturday, we had the time and were in the area, so we made a reservation and decided to give it a try. After walking in, I was surprised at how busy and bustling Beatrix was for brunch, around 12:30pm on Saturday afternoon, but we were seated within only 10 minutes or so. I thought this was perfectly reasonable, as we were delighted with the bright and sunny table they gave us, but shortly after being seated, one of the hosts came by, apologized for not getting us seated more quickly, and gave us a cinnamon roll to share, on the house. We were kind of dumbfounded with the generous offer, especially on top of their originally seating us reasonably quickly. What a nice surprise. I personally would not have ordered a cinnamon roll off the menu, but it was probably the best cinnamon roll I've ever had. Creamy, warm and delicious sweet frosting sitting on top of a gooey, rolled cinnamon cake -- it was amazing. I could definitely see us making the trip out in the future just for cinnamon rolls and coffee. I ordered a couple bloodies and the special praline-pecan French toast. I was not expecting it to be so big! And, like everything else, it was delicious. My wife ordered the spicy chicken tinga, which was served with tortillas, and a couple glasses of champagne. It's no wonder Beatrix is so busy and so popular for brunch, the food and service both (like all Lettuce Entertain You restaurants) was truly top-notch, and left us with such a wonderful memory and overall brunch experience. They truly delivered on my already pretty high expectations and definitely earned this 5-star review. Very highly recommended, and we'll definitely visit again.", "pics": null}}, {"review": {"des": "This is always busy so make reservations first.  They have amazing fluffy lemon pancakes.  Try the poached egg in Avacados with salsa Verde and you may agree that it could be your new favorite.<br><br>They even make bullet proof coffee and I loved the malted freddo cold coffee. <br><br>They took extra care to seat me by the window and a place where I could keep my suitcase out of the way.  The service was outstanding so this is a MUST", "pics": null}}, {"review": {"des": "This place was top notch. We came in for breakfast and everything we got was sooo good. Our server was very friendly and attentive. I started off with a chai latte w/ almond milk and it was perfection. I ordered the cauliflower grits which were honestly amazing. My husband got the steak and eggs and a Bloody Mary and thoroughly enjoyed both. Also, you gotta get the brown sugar bacon, so yummy!", "pics": null}}, {"review": {"des": "This is for breakfast at the Clark street location, River North.<br>Short version: Fabulous restaurant in the city, reasonably priced and open as early as 7 am during the week and 8 am on weekends.<br><br>Elaborate: Adjacent to trendy ALoft hotel (Starwood group), Beatrix is equally trendy. It is a good size with tables close to each other but somehow it felt cozy rather than crowded. On a warm September morning, the giant garage-style doors were all open. It was already busy at 8:45 am and was completely full within an hour. They serve Intelligentsia coffee which is a great local brand. Their cocktails looked great, unfortunately they are not allowed to serve alcohol prior to 10 am, per the city of Chicago's ordinance. Everything on the menu looked delicious, the approach was unique, not too trendy and not too formal. We went for quinoa cakes with tomato sauce and poached eggs, enchiladas, and a side of brown sugar bacon. Everything was  super tasty with layers of flavors. The portion size was perfect for each dish, we were full but not stuffed. And the price was reasonable. <br><br>Oh, and they take reservations on Open Table :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JkWkcUGKFLeWNLF0H4xsUA/348s.jpg", "caption": "At the corner, ready to dive in and eat."}]}}, {"review": {"des": "Great place for breakfast.  I came here on St. Patrick's Day morning, so the crowds were to be expected.  We were seated fairly quickly considering the chaos.<br><br>Food was excellent, although I would skip the turkey bacon.  Go for the real stuff.<br><br>I loved the trendy space.", "pics": null}}, {"review": {"des": "Surprise birthday lunch from two of my business colleagues yesterday. :) My birthday lunch was quinoa guacamole, poke bowl and caramel pie with whipped cream yum! I want a give a shout out to our awesome waitress, Jesse, who was so sweet. She overheard us talking about my birthday and brought me my pie with a candle in it. So cute!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ypAAYiiCvAxKv3C3k_9tqQ/348s.jpg", "caption": "quinoa guacamole"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zJQftcb0-LzUddSE1LwmJw/168s.jpg", "caption": "poke bowl with bulgur wheat"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FDMKForj-z-f2fyy7yGAFA/168s.jpg", "caption": "caramel pie with whipped cream"}]}}, {"review": {"des": "There's a wait. <br>The service is not good. <br>The place is cool and casual, a bit loud though. <br>Good food<br>Good coffee", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gQr450YTihdRVMlXEpSpsQ/348s.jpg", "caption": "Latte"}]}}, {"review": {"des": "This is one of my favorite breakfast/brunch places in the city .<br><br>Pretty easy to get s brunch reservation . You can sit at the counter and eye all of the yummy pastries or grab a table which most have a comfy chair or couch attached .<br><br>Servers are helpful and super friendly . They always offer suggestions to make any meal vegetarian which I love .<br><br>Restaurant is connected to the aloft hotel and does have some street parking around if you look", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Jjp8VP47FM__oV8ZVa04iA/348s.jpg", "caption": "Quinoa cakes with marinara and spinach . (On the menu this item would be topped with eggs and wouldn't have the spinach )"}]}}, {"review": {"des": "My husband and I loved this place. I am not big on having a heavy breakfast so the Greek yogurt was just amount for me. It definitely felt and tasted homemade, and I could have easily had another bowl. The granola with the Greek was light and crispy and just the perfect amount.", "pics": null}}, {"review": {"des": "My boyfriend and I were super excited in search for the perfect hangover brunch on Saturday morning. On our escapade to try something new, we decided to go for Beatrix with its picture worthy food, gorgeous decor, and stellar reviews.<br><br>The wait for 2 was an hour and half on Saturday morning but they have two bar areas and we found a spot within 10 minutes of being at the restaurant. I ordered the chicken tinga and he went for the green chili enchiladas. We also got the banana joe which was mediocre. The food was served fast though but we were expecting so much more. Both our dishes were just ordinary, lacking flavor, and not worth another visit.<br><br>The service was also mediocre as our water jug was empty 60% of the time we were sitting and the servers took quite a while to come around. <br><br>Overall, I wouldn't wait that long for a table here as the food did not match the elegance and style of the restaurant.", "pics": null}}, {"review": {"des": "I don't have anything to say that hasn't already been said. The food is delicious and fresh. I got the quinoa cake with poached eggs and a blueberry mimosa. The quinoa cake was delicious and light which paired well with the yolky deliciousness of the poached egg, all on a bed of some kind of tomato stew. If you don't like runny eggs, skip this. The quinoa cakes are cooked to perfection. I was starving before I was seated and I left full. This meal is sufficient in every way. My mimosa was good too, nothing too special, but it was refreshing. Service was great. I was dining by myself and I appreciated that the server treated me the same way she treated the larger parties <br><br>There was a 30min wait when I arrived. They take your number and they text you when your table is almost ready", "pics": null}}, {"review": {"des": "Cool spot. Everyone was super friendly. Food was great, and arrived within 5 minutes of ordering. Only thing that could've been better was a little more attention by the waiter. We had some long wait times when we first sat down and then after we received our meal. The restaurant wasn't busy at all. <br><br>Overall, great place. Would recommend to anyone and would definitely go back.", "pics": null}}, {"review": {"des": "Couple people last night told me to try this place for brunch. Bit disappointed because I had high expectations. Service was something to be desired. I was sitting at the bar for a good 7 minutes before I was even acknowledged. Yes it is busy but maybe they should have more people on a Sunday. I ordered chimichurri steak and eggs. It was ok. And now I've been waiting for someone to look at me so I can ask for my check. I would really like a mimosa but I am not paying $9 for a glass. I'm gonna go and have some Mango mimosa for $4 at the Irish bar across the street lol<br><br>I have to update my review and change it to 4 stars. While I was waiting, the Manager Kelsey walked up to me and apologized and comped my meal which was a great gestures. Very appreciative of this amazing gesture by the manager. She saved the day", "pics": null}}, {"review": {"des": "Beatrix never ever lets me down!<br><br>I had some time to kill yesterday, so I had stopped in for breakfast around 10am.  At this time, the restaurant was more on the quiet side so I was seated right away.<br><br>Neil S, Server, had greeted me within couple of minutes after being seated.  He was very prompted and friendly.  Since I've been to the restaurant several times and a creature of habit, I was ready to place the order right away.    I had opted for the Eggs Your Way (Scrabbled with slice of cheese) and added the Poach Salmon (well done).    <br><br>While waiting for my meal, Neal would check in with me as well with his other customers.  He could read his customers - great staff member.  <br><br>The food runner had brought the meal - great of course.  Everything was seasoned just right and the eggs and the salmon to my likings.    Neil checked in with me.  Everything was cool.<br><br>Of course, I had to try one of the pastries which was good.  Overall, great experience and excellent food.  I would highly recommend this restaurant for breakfast, lunch and dinner.", "pics": null}}]}