{"name": "big-jones-chicago", "reviews": [{"review": {"des": "The fried chicken is excellent. Takes about 15-20 minutes to fry fresh. The skin is crispy and the chicken is seasoned excellent. Comes with a side of greens and sweet potato hash. Greens are ok. The sweet potato hash is a unique twist on sweet potatoes-more healthy but still delicious.<br><br>Others in my party had the shrimp and grits & the catfish and grits. The catfish seemed bland and they put what is intended to be a fried piece of catfish onto grits which makes it soggy.<br><br>Also had an excellent chicken<br>Croquet and bean soup. We also tried the biscuits and cornbread. The biscuits seemed dry and over cooked while the cornbread was moist and had actual pieces of corn in it.<br><br>Would recommend you get the fried chicken. Probably one of the best fried chicken meals in Chicago. If not, you might be sad like others in my party that they didn't get the fried chicken.", "pics": null}}, {"review": {"des": "A best friend and I decided to have our late lunch here after we stumbled upon this restaurant while passing through the neighborhood one afternoon. Parking wasn't really difficult at all. Once we arrived, we immediately noticed its spacious area with all of the tables and chairs completely vacant. We realized that we were the only customers throughout our stay here. By the way, the two waitstaffs who welcomed us were fairly accommodating. <br><br>The restaurant has an unpretentious and relaxing interior. The whole place is pretty much polished, even from the dinnerware to the decor. The jazz music being played in the background also enhanced the comfortable vibes inside. However, I wasn't fully intrigued when I looked at their so-so menu. <br><br>We simply ordered the fried chicken picnic (don't worry, we weren't able to devour it in one sitting and just took home the remaining few pieces). We waited for a long time for the food to be brought to our table although as I had mentioned, we were their only customers. Finally, it was served to us visibly hot and appetizing (or maybe, we were just desperately hungry already). <br><br>The food that we got was good to a certain extent, particularly the fried chicken. Every piece was enveloped with a crispy skin, the meat was tender and juicy, and it was decently spiced up. We paid a reasonable amount for our order but apparently, there are many restaurants out there which could offer superior meals in bigger portions with the same price or which would even cost less than that.<br><br>In conclusion, it was an average lunch. There wasn't anything outstanding that happened while we were here or that we learned about which would lure me to come back that soon or at all.", "pics": null}}, {"review": {"des": "Authentic New Orleans cuisine. <br><br>It's slightly expensive, but is worth it and is perfect for dates with your honey! I highly recommend the fried chicken and collard greens. But, I love fried chicken and will always recommend it depending on the place--local will always be your best bet! <br><br>Big Jones is located in Andersonville, and you can't go wrong eating in a beautiful neighborhood with shopping and entertainment.", "pics": null}}, {"review": {"des": "We started with the House Brewed Ginger Beer, which is my favorite non-alcoholic pairing with everything on the menu.<br><br>The fried chicken sets a new bar. Its perfectly juicy inside, and the light, crisp, flavorful batter totally differentiates this dish and sets it far above any other fried chicken in Chicago.<br><br>Keith provided welcoming, knowledgeable, and capable service, and everything about our visit was outstanding.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4Cart1CZIn3D2UVGBsgn5g/168s.jpg", "caption": "House Brewed Ginger Beer"}]}}, {"review": {"des": "I seldom go out for breakfast/brunch, and when I do, I make sure to try and choose a restaurant with options that that I wouldn't easily be able to cook on my own. Big Jones was a perfect choice. I came in a party of 2 for Sunday brunch. We didn't make a reservation but happened to come in before the rush. We were quoted a 20 minute wait time that was actually under 10 minutes. <br><br>Beignets: $3 for 3 beignets! The yeast flavor was a bit too overpowering for my liking, and the texture was just a bit too dense, but overall, an enjoyable bite. <br>Gumbo appetizer: It's a good thing that this was appetizer-sized and not full-sized. It was very salty. <br>Eggs New Orleans: Absolutely delicious. The creamy egg yolk tied everything together and each element of the dish complemented the rest. I'm glad that the crab was prominent. The Potatoes O-Brien were perfectly seasoned and crispy and also had several diced jalapenos mixed within it. My only critique for this one was that the popovers were just a tad chewy. <br><br>The Eggs New Orleans really impressed me. That itself was a solid 4-star brunch dish. Otherwise, there were a few hits and misses in the meal. Overall, the food, the portions are just slightly larger than average, and the restaurant is lively. I was stuffed but the food still tasted clean and didn't make me feel groggy after the meal, which is always a plus. It's a versatile restaurant for any group.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/k2zpEfygvM9DKydIrZtvZw/348s.jpg", "caption": "Beignet"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ACf7A2sWrJI167qPXgFrmA/168s.jpg", "caption": "Fried chicken"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IlT46oF1jbWSLEErS-6mYw/168s.jpg", "caption": "Eggs New Orleans"}]}}, {"review": {"des": "Wow this place was awesome.  We were in the neighborhood and walked in for dinner.  The food was amazing and the service was very good.  I would recommend their biscuits:)", "pics": null}}, {"review": {"des": "1st time coming here as it's really far north from where I live. But damn was that fried chicken worth it! I ordered the half fried chicken so I can have leftovers for lunch the next day but nope, all gone. Also had the gumbo and biscuits and both were delicious. Gumbo had this flavor I couldn't but my finger on but it was a good heat but hits you after a little bit. Service was friendly and gave suggestions on sides. The hash with bacon was his recommendation and I'm glad I listened. Next time I'm up this way will definitely stop in for the chicken.", "pics": null}}, {"review": {"des": "Creatively Reimagined Southern Food<br><br>Paul Fehribach is following the footsteps of vaunted chefs like Sean Brock at Big Jones. He is exploring the cultural heritage of the south, and reinvigorating old classics by drawing upon a much broader range of southern ingredients than some of his Chicago counterparts.<br><br>For instance, Big Jones serves quite possibly the best biscuits I've ever had. One of the reasons behind the value of these biscuits, outside of their delightfully flaky texture, is the butter. The butter is unbelievable. Paul makes an incredibly light and sweet butter by incorporating sorghum, a southern staple that I've yet to seen in a midwest restaurant. The jam was similarly fantastic. Made in house, the liquid elements of the jam are cooked much longer than the actual strawberries themselves, giving the jam a wonderful flavor but also a strong consistency. <br><br>That being said tough, some of Big Jones' menu items are much more delicious that others. Although everything is fantastic, consistency can be slightly off sometimes. The Catfish and Grits, while tasty, did not have as much of a flavor impact as the shrimp and grits. The fried chicken was lovely, but the pulled pork sandwich was nothing to write home about. <br><br>Regardless, Big Jones is reinventing southern classics in a way that deserves your attention. Even the less impressive dishes were still delicious, and for any southern boy Big Jones is definitely worth going to.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/j2-Ih1fvtna8te4t7QJtLg/348s.jpg", "caption": "Shrimp and Grits"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2_EKLOCj2AQby8D82CMMFA/168s.jpg", "caption": "Catfish and Grits"}]}}, {"review": {"des": "We had a larger than 8-person party and they were able to accommodate our group (they sont usually permit reservations more than 8).  The drinks were great (i had the chatum artillery punch) which was deceptively strong.  The wait staff were all attentive, polite, and informative.<br><br>We ordered two of every item listed as appetizers, homemade bread, and snacks to start off the night.  The biscuits were delivered fresh out of the oven and was gone in a blink of the eye. We ordered a total of 5 orders by the end of the night.  The corn bread was a hit as well.  The boucherie board was large and inviting with all homemade breads, spreads, meats, and pickled vegs.  Those who got the gumbo loved it, however it seemed too smokey to my liking.  Large amounts of sauage and meats were included in the soup.<br><br>For the mains, we had a majority of the items on the menu.  I shared a crawfish pie and a half fried chicken.  Crawfish pie, a seasonal item, had a very butter and flaky crust while the filling creamy yet the crawfish seemed to have been frozen.  The dark meat fried chicken was juicy and flavorful and the crust was crispy with a hint of sweet ... amazing.  The white meat fried chicken was on the dry side.  The ham fat fried kennee fries and potato salad were not impressive to those who tried it, however the sweet potato hash was a favorite.  Those who had the catfish and the shrimp grits entreed liked what they got.<br><br>Everyone was happily fed with a few pant button popping, therefore we had no room for dessert.<br><br>Overall, this is a great place. The service was spot on and so were the food.  Id recommend anyone who wants a good ole Cajun food experience to give this establishmnt a try.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KZKVXqDmbrGps_1BzYs-jg/348s.jpg", "caption": "Dessert, dont recall what it was called."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yEsW6v5D6HqNBDryromOIA/168s.jpg", "caption": "Half fried chicken woth sweet potato hash and ham fat fried fries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Mh_5bhhjRjqrmB_DnDanzA/168s.jpg", "caption": "Shrimp and grits"}]}}, {"review": {"des": "One of my friend invited us to come check out Big Jones, otherwise we probably would have never made the journey up here ourselves since it's a bit far from where we live. First things first, I'm a sucker for a good brunch spot. But a southern breakfast? I'm sold. And thank god she made reservations because it was packed. So be sure to do so if you're coming for brunch on a Sunday.<br><br>We started off with a round of mimosas because why not? Then we got the beignets (which are not complimentary anymore btw) and the corn bread to share for the table. I got the sweet and spicy chicken sandwich and my fiancé got the shrimp and grits. I was a fan of my dish and of course, I stole a couple bites of his grits and it was very flavorful!  Not a whole lot of light options on the menu, but if you want something hearty & soulful - this is certainly the place to be!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/V2Ba0NKDr1_-6o1tD4hb_A/348s.jpg", "caption": "Sweet & spicy chicken"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UJGIzzd6MssH72ys1t-0LA/168s.jpg", "caption": "Shrimp & grits"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BgbRwR2kABBjJByv8JqXQg/168s.jpg", "caption": "Cornbread"}]}}, {"review": {"des": "Been here a fee times now with my husband and we always order the same thing - the Eggs New Orleans (like a Benny but with crabcakes on popovers) and the crawfish omelette - because they are so good. The banana pancakes are pretty good too, with slices of banana inside, though I thought the texture was a bit on the softer)mushier side for my taste. I really liked the streusel topping though. Lastly, Big Jones also has good brunch drink specials and a great loose leaf tea selection.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2YKnzPTAvSRlnKoYfOCkVw/348s.jpg", "caption": "Banana pancakes"}]}}, {"review": {"des": "This place had good reviews so we stopped in! We were seated immediately, it is a cozy little spot. My boyfriend ordered the gumbo it wasn't that good or had a burnt taste to it that we didn't care for. I ordered beignets they were huge and tasty.  I had the crab cake Benedict... it wasn't anything that I would order again while my boyfriend had the chicken and biscuits and he didn't like the gravy  that much. The bacon was tasty! They had a Weller whiskey that my boyfriend loved so that was a plus! We do want to return to see if the dinner is better.", "pics": null}}, {"review": {"des": "Great little joint featuring southern style fare. <br>I was wanting something different. <br><br>Nice simple home style decor with an open kitchen layout. <br><br>Came in for brunch. I had the hair of the dog Bloody Mary and fried chicken. The fried chicken is what BJ is known for. It was served with a biscuit smothered in gravy and a side of collard greens. Perfect to battle the the after mass of Friday night libations. <br><br>The chicken was juicy and full of flavor. Breading was crispy fried hard. The biscuit was ok but could have been a bit larger and the collard greens were good and could have used more of it. <br><br>I'll be back to try the Crab Cake Benedict :)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_PDL0V5-tVnYMX5WytG3RA/348s.jpg", "caption": "Zee menu."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_pOyMvjw-CDLcEMI7yLgsQ/168s.jpg", "caption": "Fried chicken and biscuit. Eating out of the shallow bowl was a little awkward :)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HdztpmJeoUcJoztAto0q9A/168s.jpg", "caption": "Fried chicken and a dinky little biscuit :)"}]}}, {"review": {"des": "Yikes. I came here and thought I would have an excellent experience but was really disappointed.<br><br>Service was wonderful, our waitress was very friendly and sweet. She is the only reason I'm giving stars. Although it was pretty empty and it took her a while to get to us, she was very nice.<br><br>Food: I ordered the Gumbo Ya Ya, and biscuits, my friend ordered the cornbread and a special soup they were offering that day. It looked really good, so we were excited to dive in. The gumbo was inedible. And when I say that, I mean it. The waitress did tell me that when the chef makes the roux he cooks it all the way just before it's burnt. Well.... unfortunately... mine was burnt and watery with oil floating to the top. No amount of hot sauce or salt could've fixed what was in front of me...believe me I tried. The biscuits were good, pretty bland in flavor but they added some jam that made up for it. The cornbread was okay, not so much my style but my friend enjoyed it. We would have ordered more but we're so disappointed that we decided to leave instead.<br><br>Personally this is not what comes to mind when I think of southern cooking, but other people may enjoy it. Please, take my advice; whatever you do...don't order the gumbo.", "pics": null}}, {"review": {"des": "The patio out back is perfect for a Sunday brunch with friends during the summers. The beignets are authentic and just delicious. I recommend their skillet cornbread, gumbo and fried chicken if you want to satisfy your nostalgia and cravings for New Orleans food.", "pics": null}}, {"review": {"des": "Went here for brunch after a charity run.<br><br>Food: If you're into southern digs, fried and flavorful at a decent price point this is the place for you. Hands down the best bloody Mary I have ever had! It was bold, bbq-infused and spicy. <br><br>Atmosphere: old Chicago, divey, neighborhood gem, nothing too trendy, good for groups! <br><br>Service: great! Bar tender went in a search for 10 minutes for some extra tomato juice for my bloody - my hero!", "pics": null}}, {"review": {"des": "Came here and had a carb overload because all these carby dishes looked so great. First got not one but TWO appetizers with the salt and pepper biscuits and popovers - couldn't pick so just got both. I also had a waffles and I believe duck confit cake thing for breakfast. <br><br>Got all carbed out. The sauce for the waffle and duck was some sort of brown butter-y, gravy, caramel sauce so it was sweet and savory which was fun. There was also a couple dabs of some sort of hollandaise like sauce. Was pretty good, but surprisingly nothing special, not a lot of duck unfortunately and what duck there was was actually a bit hard. <br><br>My two friends had their posole and an eggs benedict that I got to try and those both were really good so still giving them a great rating. Also the salt and pepper biscuits were great and perfect. But let me tell you. THE POPOVERS WERE ON POINT. That was the first time I had ever had popovers and they were airy and light and everything I ever wanted in a carby goodness. In fact, they were so great I was inspired to order popovers elsewhere and was disappointed because they weren't as light and airy and beautiful. EVERY POPOVER EVER MADE SHOULD BE LIKE THESE POPOVERS. They come with a compote and their special butter. Compote was good, but yum that butter. Also just a side note that they do have a good selection of teas and other drinks as well. <br><br>Definitely will come back for the fried chicken that everyone is raving about.", "pics": null}}, {"review": {"des": "No free beignets.  They got rid of that.<br><br>That being said, this is a great place to go for an amazing, hearty, warm Southern breakfast.  The bakery items are delicious.  We ended up ordering beignets and they are large, soft and sweet, and very tasty.  The cornbread was pretty decent too.<br><br>The brunch items are very nice too - the eggs new orleans was amazing and a great mix of flavors!  The fried chicken and biscuits (and gravy) were terrific too.<br><br>Make a reservation if you can so you don't need to wait.", "pics": null}}, {"review": {"des": "Brunch is my second favorite food experience in the world, second only to dessert! When I go out for brunch, I want it be absolutely delectable. <br><br>Big Jones just wasn't satisfying. I ordered the Sweet Potato Pancakes and BF got the Benedict. My pancakes were past the point of being ooey, gooey and were raw, and I didn't love the caramel sauce. BF thought the Benedict was bland, even with the added hot sauce. Portions were also super small on top of it. <br><br>We also never got our complimentary weekend beignets even though every other table was served them, and I never got a coffee refill throughout my entire meal. <br><br>It seems like it's a popular place, so maybe it deserves a second chance?", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RyPqqDOYDnPVo9dKDk2CBA/348s.jpg", "caption": "Eggs Benedict"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/C_KhbCRkUmokXuS7zacv0g/168s.jpg", "caption": "Sweet potato pancakes with coconut cream and caramel drizzle"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1sS-_o2jbkMISoU6dtuPuw/168s.jpg", "caption": "Big, big, BIG cups of coffee!"}]}}, {"review": {"des": "Big Jones was okay, we saw the raving reviews and wanted to give it a try, but I wasn't blown away by it.  Perhaps it's because I've had my fair share of Southern cuisine in the South or we just came on an off day.  I would give it another shot, since it's hard to come by good southern food here in the Midwest. Note, I came here with a few friends, one of them being from Alabama and myself going to school in SW Virginia.<br><br>Came here on a Sunday for brunch during Memorial Day weekend.  We made a reservation just in case, since we here the place gets packed. We got there on time if not early, but they are pretty strict on seating when everyone arrives.  It was suppose to be six of us, but one of our friends had too much fun the night before and wasn't responding to messages.  The hostess, was adamant that we confirm whether our 6th friend was joining or not, and would not be able to join once we got seated.  Not sure why she or the restaurants policy is so rigid or inflexible, since you want paying customers to come back.  Ironically, we were still seated at a 6 seated table...<br><br>I guess they don't offer complimentary beignets anymore, since we had to order them as an appetizer. They were not that great to best honest, not light and fluffy, and just a bit dense and doughy.  Spoiled because I've had Cafe Du Monde one too many times.  Most of us got an iced or sweet tea, and that was pretty good.  service is a little slow though, since she didn't refill our drinks without being asked, and mixed up our check too.<br><br>The meals itself, we got a mix of chicken and biscuits, grits, pancakes, biscuit and gravy, and a simple southern breakfast.<br><br>Chicken and Biscuits:  came out hot, fried chicken was crispy and seasoned well.  The gravy and greens complimented the meal well.  The biscuit, like the bignets were dense than I prefer (I am a texture person).<br><br>Cheesy Grits:  really good, you could tell they were not the instant type<br><br>Pancakes: The buckwheat banana tasted really sweet.  This is probably more of a dessert than something you would have as a meal.<br><br>Biscuit and Gravy:  you truly get only one biscuit here and the one my friend got was pretty small.  When you think of southern food, you think hearty, filling, and rich.  The gravy was rich and had good flavors, but you just didn't get your money's worth due to the size of the one biscuit.<br><br>The simple Southern breakfast:  it was fine, a breakfast meat, eggs, biscuit, what you typically get anywhere else.<br><br>The restaurant itself is clean, bright, and decor is tasteful.  I'll have to give it another try, perhaps for dinner.  I really want to like this place!", "pics": null}}, {"review": {"des": "Made reservations for a Saturday brunch after reading the reviews and it did not disappoint! I'm glad I made reservation because it got packed pretty quick.<br><br>I love that they serve complimentary beignets, it was toasty and fluffy with a generous amount of powder sugar.<br><br>Eggs New Orleans ($18): eggs Benedict's with crab cakes on top of a popover. The crab cake was pretty good and I liked the popover instead of an English muffin. Tasty if you like crab cakes.<br><br>Shrimp and Grits ($17): I liked the gravy sauce and the mushrooms that the shrimp was tossed in. The cheesy grits was flavorful too.<br><br>Overall, I enjoyed the place. Food was delicious and the service was excellent.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EH3dEMbqNJBfYXMjhqtevg/348s.jpg", "caption": "Eggs New Orleans $18"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qX6fN5HJYvjEVCspSbVCuQ/168s.jpg", "caption": "Shrimp and grits $17"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tFs0R4e-wd_fJn2Q-gttxA/168s.jpg", "caption": "Beignets"}]}}, {"review": {"des": "I am never one to give negative reviews but I do not think Big Jones deserves the credit they keep getting, at least from my experience there. <br><br>I made a reservation a few weeks in advance for 2. Several time slots available. We were excited with the renovations and recent reviews. The menu looked good and the expectations were high going into it.<br><br>We get there and our table isn't ready for few minutes. No biggie! But then we are seated.. oh man.. in this scary back room beyond the normal restaurant space, behind the cashier area, next to the bathroom, and next to a mini space heater. How does this table even exist?? How could they justify seating people here, especially a two person table that likely warrants a romantic evening. We did not get to experience the great looking atmosphere one bit. Instead I had to see every person going to the bathroom and had to manually move a space heater. <br><br>The service was weak as well. Our guy was nice and all, but we were there for a warm Southern comfort meal (already ruined by the table) and he barely could deliver on the vibe. Like asked for drinks within 4 seconds and didn't even give us a welcoming hello. He kind of seemed out of his element. <br><br>Onto the food. This cornbread look so good in pictures. It was not. It was dry and without the butter I would have not eaten it. Waiter said it would take 15 minutes to come, but it was out in 5. So did we get a leftover instead of a fresh one?? I would have waited 15 for a fresh batch of something worth it. <br><br>The fried chicken was really amazing. But then there was zero sauce to go with it even after requesting something simple. The dumplings were good as well, but nothing spectacular. I did really enjoy the sweet potato hash.<br><br>I really wanted to love this place, but it became the joke of the evening with my girlfriend and I from how lame our time was in there.", "pics": null}}, {"review": {"des": "I need to take a moment to appreciate myself for finally checking out this restaurant. LOL I am so excited that I finally got the chance to check it out (with friends) after so much procrastination on my part. <br><br>The location was great. Particularly because I could easily walk here from my place. I wouldn't recommend parking here, only if you want to pay for street parking. The ambience was great as well. <br><br>The service was slow. It took about 30-40 minutes before we got our food. I knew this for a fact because I had posted the appetizer on snapchat and that was how I got a time stamp on that. I asked about the complimentary beignets and was told it was only offered for weekend brunch so I ordered the corn bread as a started and I was very disappointed. But my main dish made up for that plenty. I had the Fried Chicken that was served with collard greed and sweet potatoes. It was so delicious and I could/will certainly return for just that. <br><br>My friends had the Butcher's Pork Duet and Mutton Daube and they seemed to enjoy it. <br><br>The 2 things I didn't like (which cost them a star) small servings and slow service (this was unaccepted because we made reservations). <br><br>It was a great experience overall. I'll def return for brunch on a weekend.", "pics": null}}, {"review": {"des": "Hmmm very sad. Used to love this place. My meal ~ the chicken and dumplings was mostly dough and bones. Tons of bones skin and cartilage. Oh well. Everything has its day. For the dinner price go I'd say go for something worth the money. Unless you want dough and bones. Service was meek. But only one gal working the bar and tables so I feel for her the busboy is useless no water no help for my salt pepper request. Overall I won't be back.<br><br>Update: Winter the manager came over. Basically comped my meal and soup. She really appreciated my feedback. Her attention to detail and taking time to talk really changed my opinion. That's GREAT CUSTOMER SERVICE. CHANGING FROM 2 star to 4. Thank you", "pics": null}}, {"review": {"des": "My wife and I love going to new restaurants! For our eighth anniversary we choose to enjoy the southern heirloom recipes at Big Jones; and man was it good! <br><br>Located in Andersonville, a Swedish neighborhood established in the 1850's by Swedish immigrant farmers, Big Jones offers a tranquil ambiance meshed with a modern vibe! <br><br>For my wife, Shrimp and Grits: Laughing Bird shrimp, mushrooms, and tasso ham gravy. She also ordered a buttermilk biscuit which must've been prepared by the hands of a neurosurgeon; one who had a doctorate in baking. It was that good. For myself, Fried Chicken & Biscuit: fried chicken, biscuit & creamy gravy, with collard greens. Typically, I do well verbalizing my experiences, however trying to explain how well prepared, how shockingly moist, how cheerfully golden brown this chicken was would be a challenge. To add insult to injury I had one of those biscuits that I raved about earlier, I was also blessed with collard greens. Every bite had to have a piece of chicken, biscuit and collard greens. Any other approach would have been morally upsetting. <br><br>Lastly, to whoever made my Manhattan..thank you. It was sensational. It has earned a second place spot for my choice of top three manhattans throughout the city. Well done.", "pics": null}}, {"review": {"des": "Everything about our meal was just... Meh. First, we were seated alone in a separate back room next to the bathrooms, despite the restaurant being half empty. We figured they'd fill up so it wouldn't bother us, but they proceeded to fill the entire front of the restaurant and seat no one else back there during our 2 hours there. Annoying, but I could have asked for a better table and didn't, so I'll take some of the blame. <br><br>The food was fine. The fried shrimp and okra appetizer was good, although the fried green tomatoes were pretty bland. I had the catfish, which came with grits and some beans, and it was actually pretty awful. None of it had any seasoning whatsoever, like not even enough salt. I have high blood pressure and eat a low salt diet--so if your food tastes under salted to me, you're doing something wrong. My husband had the fried chicken, which he said was pretty good. Oh, and the skillet cornbread was fine. Just fine. <br><br>Overall I was very disappointed. The drinks were pretty good, and our server was attentive and fun, but it all amounted to a mediocre dinner.", "pics": null}}, {"review": {"des": "We got cornbread to start and it was decent, but not my favorite.  The duck and waffles were very flavorful and well cooked.  The duck was perfectly fried.  We tried 3 desserts which were all very good, but the pot de la creme was a bit boozy tasting.  The blueberry dessert was a table favorite and the 1890's dessert was good as well.  Overall, a nice upscale Southern dining experience.", "pics": null}}, {"review": {"des": "I've eaten here a few times hoping I'd have a better experience each time and I've always been disappointed. The food is often under cooked and extremely bland. Their fried chicken is only ok, but at $18 it's a complete rip off. I'm done giving this place a chance. I'm really glad other people seem to like it so much but it's always been terrible for me. <br><br>I get the feeling there's some social experiment going on where they take awful food and put a big price tag on it just to see if people will like it. Seems to be working with most people, I guess.", "pics": null}}, {"review": {"des": "Friendly service. <br><br>Dine for brunch (and skip dinner). <br><br>Lots of options at brunch/lunch. Fried chicken tenders on the salad was delicious. Extra hot chicken with a crispy batter.  <br><br>Fried chicken at dinner however was quite different: it was much more oily and greasy. Shrimp and grits dish included paltry sized shrimp and the grits tasted like it was made from a box package - perhaps because the texture of the grits was very smooth. <br><br>Four stars for brunch. Two-three stars for dinner", "pics": null}}, {"review": {"des": "We got seated when all of our guests are there. Small entranceway so if there's many people waiting, it can get packed. Our waiter was so nice and attentive!  We got beignets. They were okay. I just can't put my finger on what is odd about them. They just didn't taste like the one's I've had in NOLA. The rest of the dish were really good! I loved the apple french toast. Heavy on the side but really yummy!! I want to try their other dishes!", "pics": null}}, {"review": {"des": "The food is very good. However, the service is not so good and it takes forever to get your food. I have never probably waited this much anywhere else.<br><br>The Cajun Boudin Balls are amazing, so was the pork duet.", "pics": null}}, {"review": {"des": "What I miss about living in the city are restaurants such as these! Big Jones is a HIT. My husband and I love coming here and we make it our business to dine here when we're visiting the city. We always order the fried chicken - of course. Its so crispy and perfect. Our side dishes typically consists of the greens. One of these days, I'm going to take a walk into the kitchen to meet the chef myself because we're NEVER disappointed.<br><br>The environment is intimate and cozy - such a perfect location for a date night. Service is impeccable - again no issues ever on the level of service they provide/we've received.", "pics": null}}, {"review": {"des": "In preparation for a trip to Chicago, I researched \"best food to eat in Chicago.\" Big Jones was on the list of some webpage, and so I went. <br><br>Big Jones's menu changes based on what is in season, so that's pretty awesome, but I decided to go with one of their staples:  the fried chicken. Big Jones's atmosphere is definitely on the nicer side (even though I'd say you can get by with casual clothing), so I guess I should have been prepared for something different than say KFC or Church's Chicken. <br><br>It comes with voodoo greens and sweet potatoes. I thought the fried chicken was just okay. It wasn't as juicy or moist as I would have liked, and the price point for the chicken wasn't something I'd pay again for what I got. Maybe my Southern taste buds aren't up to par, but I actually prefer cheaper fried chicken joints to Big Jones. Service was awesome though! <br><br>If you do decide to try their fried chicken, be sure to order asap because they do say they need a heads-up to prepare it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FxVFmD7pnnBKRGQV9eiz9A/168s.jpg", "caption": "Fried chicken"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TGkoSEfl6Y6cLGWrAkKbiw/168s.jpg", "caption": "Shrimp and grits"}]}}, {"review": {"des": "I usually love Big Jones.  We come 3-4 times a year and always recommend it to visitors. The service is always great and the food is so, so good. Tonight, though, we had a pretty miserable experience. Service was SO VERY SLOW. They were out of the zucchini rosti and the burger...at 6:30 PM on a Tuesday!  It took forever to get our entrees.  Everything was just OK. The food all seemed under-seasoned and blah.  Then forever and a half to get our desserts (and they only had one cherry almond tart left).  The tart was fine but the saspirilla ice cream did not go with it at all. The galas were tasteless. Tonight, this felt like a restaurant that was getting ready to shutter, not one of the best restaurants in Chicago.", "pics": null}}, {"review": {"des": "A decent sized group of us came here for brunch, and we were not disappointed! They were pretty busy so we had a short wait, but there was space at the bar. The bloody Mary is fantastic! Strong & spicy, just the way I like it. I had the eggs new Orleans and my husband had the fried chicken. My meal was perfect, especially the crab cake. My husband loved his fried chicken, but I thought it could use a little more seasoning. Still nice & juicy though.  The staff was very nice and quick with their service. I would easily come back here for brunch. Just a bit of caution: you may have to drive around a bit to find parking.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ixtUnL7O8X-YCCEwYfPugQ/168s.jpg", "caption": "Fried Chicken"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5QAmp7gtrZSa0DoX6keCBg/168s.jpg", "caption": "Eggs New Orleans"}]}}, {"review": {"des": "Dinner here for our party of 4 was somewhat disappointing, and I'd say about 2.5 stars.  Our two dining pals went 0 for 2 on their dinners.  One was looking for a crawfish entree and the flamin' hot cheese straw shown online, but neither was available at the restaurant.  Apparently, they don't keep up to date on the online menu which is pretty poor.  The other dining pal ordered catfish and grits, and after about 15 minutes, she was told they ran out of catfish.  Server did not know about status.  They comp'ed her subsequent substitute dinner of choice of the tagliatelle pasta, so that was a help.  I ordered the 1/2 fried chicken dinner (for $25, as did my pal), and wife ordered the chicken dumplings ($14).  Both of these chicken dishes were delights, though the fried chicken entree is on pricey side.  The fried chicken was crispy on the outside, tasty, and moist on the inside, and it was not oily.  It was quiet here for a Sunday dinner, and we won't be returning here for dinner anyway.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Z14oS3Yx591X4WsAtpsZEQ/348s.jpg", "caption": "1/2 fried chicken dinner, $25"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/U1cZqVQjGgUOPCtuCiE0xQ/168s.jpg", "caption": "Corn bread"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oxRmyoWVngF7EcUPNi4DoA/168s.jpg", "caption": "Bourbon menu, circa July 2018"}]}}, {"review": {"des": "The Award-winning Fried Chicken is fried in lard, ham drippings, and clarified butter. It had a perfect skin that I savored, and flavorful, juicy meat. It was by far the best fried chicken I've ever had. <br><br>My colleagues each had the Pecan wood-smoked Barbecued Pork Shoulder on a buttermilk roll with sweet, tangy sauce, and creamy slaw. Our lunch was excellent, and the house-made ginger beer with lime is a refreshing treat. <br><br>Service was impeccable, and we will definitely be back soon to try more of the menu. FIVE STARS! A GREAT RESTAURANT!", "pics": null}}, {"review": {"des": "Had the Banana Pudding Hot Cakes....PHENOMENAL! I have a massive sweet tooth and these were just what I was looking for in a sweet brunch meal. The place was super busy, make sure you have a reservation. Service was attentive. Will happily fo back.", "pics": null}}, {"review": {"des": "Beignets...OMG! Chicken..unbelievable! The Rosé bishop..LORD!! I don't think I can fault this place for anything. Great institution that serves quality and flavorful southern fare! Gotta try it if you've got a craving for some southern awesomeness!", "pics": null}}, {"review": {"des": "I was greeted by a very pleasant customer service guy as soon as I walked in but the waitress, she wasn't rude but just unpleasant and stuffy towards me and this made me feel a bit uncomfortable.   The food was not for my taste, I ordered the bbq pork shoulder it was indeed very tangy but too spicy hot, the collard greens had no taste to it whatsoever, the waitress had to give me salt for it.  The creme cole slaw had a strong vinegar taste to it. But the pomegranate lemonade wow, was very good.  The portions overall were very small for the price.  I would not return because of the waitress and the quality of the food.", "pics": null}}, {"review": {"des": "The food here is amazing!  I read about their award winning fried chicken.  So we had to go to check it out.  The dishes here were delicious.  So why the 4 stars?  A couple of minor mishaps occurred.  If not, this would be a 5.<br><br>So the fried chicken is that good.  It's cooked in lard and ham drippings.  It's so delicious and moist.  It came with greens and red beans and rice.  They both were seasoned properly and cooked well.  I added some hot sauce and it was demolished.  <br><br>We had the shrimp and grits.  The grits were infused with cheese.  It had a deep, rich flavor, that really showcased the love that was put into this dish.  We added a little hot sauce again, and it was perfect.<br><br>The gumbo had a real chocolate colored roux.  It had andouille, pork, chicken, and it was really nice.  The flavor was very thick and deep.  It tasted like it was slow cooked for hours.  <br><br>The two misses were the Bread Pudding and Sweet Tea.  The rum was too strong.  They didn't cook all the alcohol out.  So we didn't really eat the sauce.  We just ate the bread and ice cream.  Also, the Sweet Tea was pretty good.  But, when I got my second glass, it didn't have any sugar in it.  It was a regular unsweetened iced tea.  <br><br>But overall, this meal was wonderful and I would definitely go again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Wu4E73l2A8Q9FoszahTXCg/348s.jpg", "caption": "Gumbo Ya-Ya  It all begins with the roux, made in the traditional Cajun style, with our andouille sausage, chicken, pork, and arom"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/z-IfvEuVtkOeHWAq96h3yA/168s.jpg", "caption": "Shrimp and Grits Laughing Bird shrimp, creamy Anson Mills grits, River Valley Ranch mushroom & tasso gravy, housemade Worcesters"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YBGJMQpxaRAHkXIyaP3NoQ/168s.jpg", "caption": "Sweet Tea"}]}}, {"review": {"des": "I love this place on two levels.  <br><br>1. Breakfast - love the entire concept and food here. The coffee is great and the beignet that they serve you is a great starter.  The cajun inspired breakfasts are all great.  <br><br>Order:  The Eggs Benedict.  Best on the north side.  Served over popovers and with a SLAB of ham and then the egg and sauce.  Soo yummy.  I also have had the shallot omelette with egg whites.  Very good.  Highly recommended. <br><br>2.  Dinner - Food is pretty decent and I have liked all I have eaten.  However, I gotta give a shout out to the bartender and their recipes.  The drinks are STRONG (I'm a boozer you know lol) and tasty.  The Hurricane is made with real fruit juice and it is SO good.  <br><br>Service is great and they don't rush you out.  Comfortable and great sound levels in the restaurant.", "pics": null}}, {"review": {"des": "Brunch in Chicago.  So many choices.  So many GREAT choices.  Before  driving myself crazy I settled on a couple and landed on Big Jones being swayed by the menu.  Glad I did.<br>Started with the pepper biscuits.  So good.  Served with a jam and butter.  Only thing I hate is when the butter is straight from the walk in so it's hard.  But we were early so that may remedy itself later.  <br>I had the Craw-fish omelette but substituted the cream cheese for their house made pimiento cheese.  I LOVE pimiento cheese and couldn't get my friend to split and order so I had to get it in my tummy somehow.  I thought it was great and think cream cheese would have been too bland for the omelette.  But I'm no chef.  <br>We waited patiently for the clock to strike ten so we could get our day drinking on.  I got the bloody mary which was very tasty and just strong enough.  Service was attentive and nice.<br>Highly recommended cute spot.", "pics": null}}, {"review": {"des": "Not many vegetarian options but being a souther food place can't be upset at all about it. For what I could get, it was very well done. The eggs with corn cake was a first and I will be going back.", "pics": null}}, {"review": {"des": "Dined with my son and a friend for a great brunch of Southern Hospitality!<br><br>We were seated right away in their back room where it was quieter and my son could play with his toy cars while we all enjoyed the delightful food. <br><br>My friend suggested we come here due to the use of original recipes for a lot of the cuisine. He knows me so well. I was elated! The names of the dishes alone thrilled me, and the idea of trying recipes from as far back as the 1930's hooked me (the baked goods go as far back as the 13th century).<br><br>We shared the 'Eugene's Breakfast in Mobile, circa 1930' - an Alabama catfish fried in a golden rice and corn flour bread blend with a side of fried plantains, black beans, and buttered southern rice. The aromatics were astounding; the sides mixed with the catfish for a fragrant combination of flavors. The crispy batter kept the catfish moist on the inside and I even dipped a piece into the savory black bean sauce.<br><br>We also tried the 'Eggs New Orleans' - Blue Crab crabcakes (from Lake Pontchartrain) with poached eggs and bearnaise sauce on popovers, and a side of Potatoes O'Brien.  The crabcakes were plump, the eggs delicate, and the potatoes were quite crispy. I love poached eggs the best and these were perfectly made. I could easily have finished another serving :)<br><br>My son loved his pancakes and fruit bowl. The apples and pineapple were thoughtfully diced and the pancakes fluffy and light. He also had a bit of the crabcakes and plantains. <br><br>The Boucherie Board was way larger than we anticipated, and ended taking most of it with us to enjoy on our walk around Andersonville. The meats were mouthwatering, the breads were breathtaking, the pickled veggies pleasant, and the jams were....well, jammin'. <br><br>The meal also included sweet and generously portioned beignets. They were a lovely, sugary addition to the meal.<br><br>Because Big Jones' southern heirloom cooking uses historically rooted recipes with locally sourced ingredients, I was impressed beyond belief and will be back to snag some of their biscuits, scones, and muffins.", "pics": null}}, {"review": {"des": "We never venture up to Andersonville because it's such a hike to get up there from the west side, but this weekend was Andersonville Midsommar Fest and we figured what better excuse to try out Big Jones!<br><br>And I'm glad we did, because the brunch was delicious. It competes with some of the best brunches I've had in New Orleans! <br><br>First things first, the Eggs New Orleans! Don't think, just order! Jordan and I split the Eggs New Orleans, which is a MASSIVE dish! It's like eggs Benedict, but exponentially better, because instead of serving the poached eggs on top of boring English muffins, these poached eggs are served atop popovers and crab cakes, SERIOUSLY!!! It was hugely delicious! It's even come with a side of crispy hash browns! <br><br>I was also impressed with the Bloody Mary, which had excellent flavors! It has a horseradish kick, but nothing too spicy and is served with asparagus, pickle and pickled okra. And also surprised by the complimentary order of beignets (in place of bread). They were so sweet, so light and so airy... Comparable to Cafe du Monde! <br><br>This brunch is great! Big Jones is closer than New Orleans, so next time I have a craving, I guess I'll head up to Andersonville instead!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/O7--kbgXYguJGoKrjatqKQ/348s.jpg", "caption": "Complimentary beignets"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/K8Pu5mJzBmLQq4HSeoqUYA/168s.jpg", "caption": "Eggs New Orleans"}]}}, {"review": {"des": "Big Jones has an interesting name, but nonetheless, is a pretty good brunch spot. Located in Andersonville, I was lucky enough to find street parking<br><br>I ordered the \"Shrimp & Grits\", which was humungous shrimp in gravy seasoned, served on this absolutely delicious and creamy cheese grits that just warmed my belly. The combination was phenomenal. Pair it with some coffee, and the brunch overall was fantastic.<br><br>They have such a great variety of brunch items. I was eyeing their omelettes, but they also have griddle cakes, and meats such as a charcuterie board.<br><br>Service was good, ambiance was warm and friendly. Overall, a great brunching experience.", "pics": null}}, {"review": {"des": "Went for dinner with friends over the weekend and it was pretty average. First off, if you're looking for any healthy options, don't even bother coming here...loads of butter, fat and carbs...no unadulterated veggies.  Corn bread was really more like corn soufflé. Our shrimp and okra appetizer was good, but again, fried. I had the shrimp burger, although I couldn't figure out if there was actually shrimp in there given all the filler.  Sauces were good, but this dish wouldn't bring me back. Friends enjoyed their sturgeon and chicken.  Skip dessert, bread pudding was a quick bread drizzled with something sweet.  Service was good, but doesn't make up for the uneven dinner", "pics": null}}, {"review": {"des": "After reading all sorts of glowing reviews, my girlfriends and I decided to stop here for Sunday brunch.  I highly recommend a reservation. It's a small spot and it sounded like the waits were pretty long for walk ins.  Reservations are easy to arrange thanks to the convenience of OpenTable.<br><br>The spot itself is adorable. Nothing pretentious or over the top about the decor. Just super comfortable and homey.  We sat in the back area which seemed a little quieter and less bustling than the front.  The menu offers a wide selection of southern staples.  We started with the pop overs (light and airy with a perfect amount of chew) and the salt & pepper biscuits (the pepper jelly that is served with the biscuits made me wish all jelly was pepper jelly).  The beignets were pretty bomb too...not too sweet but coated in powder sugar. A mess but worth it.<br><br>I had the Carolina Gold Rice Waffle with Crispy Potted Duck, Fried Sage, Huckleberries, Duck Egg and Whiskey Sauce. It was spectacular. A great combo of sweet and savory. The waffles weren't too dense or heavy so even though it was a hearty portion it wasn't too much food. My girlfriends both had the New Orleans Eggs, which featured a crab cake, poached eggs, popovers, and potatoes O'Brien.  Again, substantial portions of well done simple southern staples.<br><br>Overall, a great brunch.  Didn't try any cocktails but the selection looked intriguing.  Would love to come back here for dinner. Only negative that kept it from a 5 star review was the difficulty of parking.  Being located on a busy main drag makes street parking hit or miss, especially during peak hours.  Unfortunately, they don't seat you until your full party has arrived (which is totally understandable considering the need to accommodate walkins and reservations) and it took my friend about 25 minutes to find a spot. Since there isn't a waiting area, i felt bad that we were causing congestion in the entrance waiting on her to park.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/h9uPUHYmrLFKIldF2Pl8-w/348s.jpg", "caption": "Coffee"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pxDxJ7ChG3DR_DcaC75rrQ/168s.jpg", "caption": "Salt & Pepper Biscuits"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BA1cIxFSssvohOjP2aqY2A/168s.jpg", "caption": "Beignets"}]}}, {"review": {"des": "Originally I was on my way to Batter & Berries, but of course they had a ridiculous wait time & I was starving. So good ol Yelp to my rescue! I immediately started searching thru my bookmarks to find a nice breakfast spot and they came up. I browsed the pics & reviews & was sold!<br><br>Initially they were packed, but they were jumping. After we were seated it got packed and there was a wait. It took me awhile to decide on food. I don't know why tho. They don't serve just regular breakfast items. Their breakfast menu is jazzed up. I ended up getting bacon & a sausage gravy dish that came w/poached eggs and southern greens. BEST GREENS EVER!!!!!! They had a delicious flavor. The bacon was also prepared perfectly and was thick sliced. The sausage gravy dish was good, it had a great flavor to it. <br><br>I'd love to come back for dinner & taste the fried chicken. Unfortunately, it's not served until after 4pm so we were there too early to order it. FYI LIQUOR IS SERVED IN THE MORNING!!!! LOL", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/V_wSRTSSNUSK97CPRsla8w/168s.jpg", "caption": "Biscuits & Debris gravy"}]}}, {"review": {"des": "Came here for brunch on a Sunday December 3rd. I really like the neighborhood. It's got that old school feel but it has so much diversity and flair. It's a pretty awesome dynamic. The reason I want to point out the date is because the hostess that day was one of the most friendliest nicest hostess I have ever seen! She always had a smile on her face! Just wanted to point that out if someone reads this, let that hostess know that she is doing an AMAZING JOB. Sorry I just loveeeee great customer service.<br><br>Anyways, let's talk about the restaurant and the food. The restaurant itself is very lively. The atmosphere is really great. It has that busk busy kind of feel but it's also intimate at the same time. It's a great atmosphere for a Sunday brunch. 5 stars for that. I believe the restaurant tries to give off a New Orleans vibe and it definitely gives off that New Orleans vibe. I'm not entirely sure what that vibe is since I've never been to New Orleans but I felt like I was in New Orleans. LOL. <br><br>Started off my brunch with a Sazerac. Pretty well made. Not going to complain. Really smooth. One of my go to drinks. A bonus is that they give you complimentary beignets once you order your food. Who is going to complain about free food? I definitely won't and it wasn't terrible at all. It was a great pre snack and a post dessert snack after the food. I got the Creole Hot Sausage and Egg Sandwich. I was craving a good breakfast sandwich. Unfortunately, should go somewhere else for a good breakfast sandwich. Now I'm not saying the sandwich was bad, but it wasn't great. The hash browns were really good though. So sick of brunch/breakfast spots that actually give you like whole potatoes chopped out. Don't people realize how awesome hash browns are??? Anyways overall I give the sandwich a 3. I like to come again and try other stuff on the menu. All in all food was just OK, atmosphere was FANTASTIC, which if you average out the 2, I'll give this place 3.5-4 stars.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/S-5wb69mm68kYgqADaklOQ/348s.jpg", "caption": "Sazerac! Solid!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rx18M-Wk9dJnUmy3Zo613A/168s.jpg", "caption": "Complimentary beignets. Yay!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_meQLtSf25uJEgl4TTk_2Q/168s.jpg", "caption": "Creole hot sausage and egg sandwich. Pretty underwhelming. Hash browns were legit though."}]}}, {"review": {"des": "Sort of ambivalent about this restaurant.  Everything I've had was good, their pickle sampler is absolutely fantastic, the chicken and dumplings are very high quality (the amount of dumplings is a little disappointing, but it is almost made up by the quality of the broth), and the fried chicken is perfectly cooked.  <br><br>But the problem I have with the restaurant is pretty well summed up by the fried chicken: It's good, but it's not that DEEP fried, heavily battered, greasy chicken that I would have liked from them.  It's a lightly battered, buttered, chicken cooked with a delicacy that is more surprising than it is impressive.  I should have noticed from the prices and the blithely upscale interior, but this is not the food I was hoping to get from a place called big jones.  It is good food, and it is made with an impressive degree of precision, but not quite enough to overcome their approach to the food.  <br><br>I forgot to say, the service there is really hit or miss.  I had probably the worst service of my entire life there the first time I ate there: we didn't get water for 10 minutes, our food took almost an hour and during that time our waiter never checked on us, and the waiter basically judged us for our order (me and my friend split 2 entrees and our waiter was confused and unhappy with that for some reason).  But I have had great service other times: quick, attentive, charismatic waiters that have added to the experience.  It depends, I guess.  <br><br>Basically, if you are looking for hearty, leak in your mouth fried chicken like I was, prepare to be disappointed.  If you are looking for an Andersonville-upscale version of a southern restaurant, this place has high quality food.", "pics": null}}, {"review": {"des": "The food is really good. Smaller portions. The place is nice looking. A bit pricey for what you get, but it is tasty. They do have breakfast drinks.", "pics": null}}, {"review": {"des": "Like everyone else says, service is slow. But the food is phenomenal - the boucheron board is HEAVENLY, omg I love their bologna - and the drinks are strong as f***. <br><br>The whole place is cozy and they have a teeny back patio. I need to come back and try their whole dinner menu as well as check out their brunch scene. <br><br>Great place for Mother's Day weekend as well as any small get-togethers or girls' nights. <br><br>They're known for their fried chicken but even vegetarians and pescetarians and those who are poultry-averse will find something to drool over.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/m03ZcmKF_4hPp-JdNogB4A/348s.jpg", "caption": "From top left, clockwise: Mushroom risotto, Fried catfish, Halibut special of the day, Pork duet"}]}}, {"review": {"des": "Let me start by saying that their food was incredible. We had brunch there on a recent Sunday and the food - delicious, southern flavors really shine and are beautifully presented. It's the getting of the food and the management of the space that sunk our experience. Despite having a reservation, we waited more than 20 minutes while many tables sat empty, theoretically awaiting others with reservations while people waited outside. Part of the dining out experience is being part of the genial buzz of a room, but because so many tables were empty, we felt we were eating at an off hour instead of a busy brunch. We waited for everything - our coffee  our appetizers and over half an hour for food, despite all the empty tables. Yet, we were told that the kitchen was backed up! <br><br>The good news was that our drinks and beignets were comped in recognition of our wait. Too. bad because the food was so good. I  won't be back for awhile and hope some staffing/managerial changes are made.", "pics": null}}, {"review": {"des": "It's just OK - quality yes you can taste the quality but it doesn't excite my taste buds. The Fried Chicken was good and my Son thinks it's Great - it was just above average for me. Same with the corn bread and the Butchers Pork Duet. The sweet potatoes were excellent but that's a side dish. We also had the special this evening- Trout stuff with crab - it was rich I can taste the quality but it's as if they were afraid to season it. I had to add salt. Except for the chicken the portions are small.Thus for me this place is just average", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/J8hD_OWuF-j_NE3uoAd8PA/348s.jpg", "caption": "Fried Chicken"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rq9Mc0pSydd8hDF9jEypUQ/168s.jpg", "caption": "Trout stuff with Crab"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SGk4CPI__A3Mmxq_kzKixw/168s.jpg", "caption": "Butchers Pork Duet"}]}}, {"review": {"des": "The flavor profiles in the brunch dishes need work. The beignets were mediocre and a bit doughy. They could use some sauce. It was a very cute atmosphere and friendly waiters. Just felt very one note and wasn't impressed.", "pics": null}}, {"review": {"des": "We were excited to come here based on the reviews and James Beard awards.  The crab cakes on the New Orleans eggs were good but not great.   I did not care for the andouille sausage.  The star here is the friend chicken which is truely excellent.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7LtnXTj4bl0TcznwdcegNw/348s.jpg", "caption": "Friend Fried Chicken"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xOo9iYwa-Jf1t_TI1b6pNw/168s.jpg", "caption": "Andouille sausage"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kqEcbu4cmaHr1AITscYqZw/168s.jpg", "caption": "New Orleans eggs"}]}}, {"review": {"des": "I love Big Jones solely for their fried chicken. It is SO delicious and worth every penny. The servers are all really great and know the menu inside and out.<br><br>FYI - the cornbread is out of this world good! <br><br>My only advice is to add more vegetarian options to the menu. I know it can be difficult with really southern food like this, but you can find some stuff. My husband is veg and we can never go because there are only 1-2 options (and he's allergic to the cumquats in the pasta). <br><br>Anyway, if I could I'd eat here every day of my life. Best fried chicken in the city, hands down.", "pics": null}}, {"review": {"des": "Living in Evanston, there are oodles of places you can get for delivery. We saw this place on door dash and were intrigued. Hubs was super excited but also super disappointed with his food. He ordered the Gumbo Ya Ya, which he couldn't even eat. It's not my style so I didn't even try it. My chicken sandwich was pretty good though. The cornbread was ok too. I wasn't a fan of the bourbon bread pudding, but the hubs seemed to enjoy it. <br><br>All in all, I'd eat the chicken sandwich again, but pass on everything else.", "pics": null}}, {"review": {"des": "This place is great! I see one 3 star review in the vicinity of mine, and she sounds quite the snobbish foodie.<br>This is the best New Orleans food you will find, outside of the big easy. The shrimp and grits was completely amazing, as was the fried chicken. Have tried eating in which was great, very strong drinks they have. (But no hurricane? That's why no 5 Star here) <br>Delivery was also fast, and hot. Ignore the one with the weak pallet Who said it wasn't to her liking. The beignets were quite good also eating in. Will def sample more of the menu next time we try.", "pics": null}}, {"review": {"des": "Great place for Southern food.  We ordered small plates to get a good taste.  We enjoyed our foods and time as we celebrated our birthdays among friends.  I don't know whether I will return to you. Still I wish you long term stay in Andersonville.", "pics": null}}, {"review": {"des": "Went with some friends and was expecting some good southern cooking.   Overall it was good. I had the fried dark meat  chicken. Greens and sweet potatoes. There were 2 pieces of chicken.  The price was $18.   I thought this was a lot for what it was.  Friend had noodles and cheese chicken.  The noodles were more like ravioli.   Again the prive was steep $22.  Feel that the place is way overpriced.  Service was good.", "pics": null}}, {"review": {"des": "Recently I saw an article naming them one of Chicago's best fried chicken sandwiches. I had to try, so I stopped in on a Saturday afternoon and they have a couple fried chicken items on the brunch menu. The Sweet & Spicy Fried Chicken on a biscuit with grits is the ticket! Wonderful service, in a very cozy place.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XbGDGD15sTM-ngxRtTR3sQ/348s.jpg", "caption": "Sweet and Spicy Fried Chicken Biscuit on their weekend brunch menu."}]}}, {"review": {"des": "We went with a group of friends for a birthday celebration. 6 people in total with a reservation for 8:30pm on a Friday. Upon arrival, we realized that the place was stuffed to the gills, and there were not any tables that would be available any time soon. The management was frazzled and we were none too happy about it. After waiting about 30 min past our reservation, we were finally seated. It took a while for our server to come by (it's as though they were drawing straws as to who would get us). They offered a round of drinks on the house which was a nice, almost redeeming touch, but it really did not help too too much in the grand scheme. <br><br>Maybe it was the end of the night, or maybe she was new, but our server was not too experienced, and everything took sooooo long. We waited for our appetizers for 20-30min. The apps were not bad, but definitely way overpriced.  The cornbread was dry and unimpressive.  The main entrees were ok, but for $19 I expected more than a single, thin piece on catfish. And 2 tbsp of grits.<br><br>To be honest, I was expecting a down south kind of feel where there is plenty of things to munch on, everyone is friendly and genuinely happy you're there. Our experience was different. Was it an off night for Big Jones, perhaps. Although judging by some recent reviews who had a similar experience to ours, perhaps Big should stick to brunch, as it both looks more delicious than dinner, and has better reviews. <br><br>I love the hype about this place, but it did not deliver. I would not rush to go here any time soon.", "pics": null}}, {"review": {"des": "Big Jones is our go to for a special dinner, brunch and quiet weekday lunch. I'm so thankful to have such a wonderful dining option in my neighborhood. I've been coming here since they opened and quality has always been consistent. If you are looking for some incredible fried chicken, a burger that is out of this world, or an inventive dish like homemade oatmeal with potted duck and local peaches and berries- you've found a great option.", "pics": null}}, {"review": {"des": "Came for brunch and was a fan of every dish we ordered: catfish grits, skillet cornbread, spicy chicken biscuit.<br>Was a little sad the beignets my friend had been telling me about was no longer complimentary with the meal.<br>As an Atlanta native, this definitely satisfied the southern food cravings I've been feeling.<br><br>Will be coming back many more times for both brunch and their regular hours.", "pics": null}}, {"review": {"des": "Oh wow...sooo good. Loved Big Jones!  The food was spectacular, it looked and tasted amazing. We ordered the charcuterie board which was massive and loaded with pickles, cured and smoke meat, housewares bourbon mustard and more!  The bread was amazing - fresh and flavorful.   My girlfriend and I both ordered variants of eggs Benedict, one with crab cakes, the other a house smokes Han.  Both were cooked to perfection.  The hash browns were the best I've had in years. <br><br>We walked out the door for a price well less than I would expect for the amount of food. The service was also top notch - our waitress was friendly and her recommendations were on point.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SYAlqV2b2cl7M4FWkS7WeA/168s.jpg", "caption": "Eggs Benedict"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pkZ-5Sm9N8f2DGp084YTWw/168s.jpg", "caption": "Amazing looking and tasting charcuterie board!"}]}}, {"review": {"des": "Great ambiance. We had the gumbo for an appetizer. The waitress was kind enough to let us sample it as she said people either love it or hate it. I didn't care for it but my husband loved it. The jumbo has a Smokey taste which can be described as a charred/burnt taste. I'm not a fan but my husband thought it was a cool spin on jumbo. <br><br>For our appetizers we ordered the pimento cheese burger and the fried chicken. <br><br>The pimento cheese burger was excellent! My good Lord, where has pimento cheese been all my life? You get the cheese spread on two beef patties and a nice soft bun. Tasty. Highly recommended! <br><br>The fried chicken was good. We got the white meat quarter portion. The breast was tender. Not too season. Not too bland. The skin was crunchy which I love. Surprisingly, the chicken wing wasn't as good as the breast. Sweet potatoes and collard greens are served with the chicken. The potatoes was diced and the greens were vinegary. The potatoes and greens together tastes really good! <br><br>I also got a pomegranate lemonade which was a special mix made by our waitress. It was so tasty. They offer a wide range of homemade fruit soda. My husband got a beer (I don't remember which one, he seemed to enjoy it). <br><br>It was a nice dining experience and not too expensive. I would return for the epic burger.", "pics": null}}, {"review": {"des": "I'm agreeing with the general consensus here. Brunch was a solid four stars. The great company may be clouding my judgment a little, but I'm gonna roll with it. <br><br>If you can parallel park, parking seems easy enough. If you can't, you may have to drive a little further to find a big, fat parking spot on a side street. Not that I know from experience or anything. The neighborhood seemed pretty nice, so I didn't mind walking a bit. <br><br>The waiting area is probably right for about four to six people, but this is a happening place and the people just squeeze in and get cozy. We were seated with our backs to the wall dividing the dining area from the waiting area so we elbowed a few fellow diners while they were waiting as the spilled into the dining area. Sorry about that, folks!<br><br>Let's talk food!  I would order the majority of what we tried again, so I think it was a success. We started with a plate of beignets to share. I think they had a little extra spice in there that was unexpected. Nutmeg maybe?  Whatever it was, there was just a touch of it. And it was good. We moved on to splitting up some popovers and biscuits. I was really looking forward to the popovers, but I wasn't overly thrilled with them. I did love the jam/preserves that came along with them though. Real whole berries made it extra special!  Those biscuits though...they didn't look exciting, but they were fab!!  And the pepper jelly that came along side was surprisingly excellent!  Sadly, the butter that arrived with both was rock hard and didn't exactly melt, but it was a minor detail at that point. <br><br>We all tried our own entrees and everyone went with a little something different. I had some entree-envy looking at crispy duck patties that looked like sausage patties and some gorgeous crab cakes!  I went with the sweet potato pancakes and a side of thick bacon. So I envisioned shredded sweet potatoes like a regular potato pancake. I should have asked. The sweet potatoes were mashed/blended and used as part of the pancake batter. They were fork tender and a really tasty layer of sweet cream was in between the pancakes along with some crunchy granola which added a nice texture. I would suggest sharing these with someone and not trying to eat all of that \"sweet\" at once. The bacon had a little glaze and was pretty good. I wish it had been cooked a little more, but now I know to ask for it more well done. <br><br>The hush puppies. Hmmmm. I liked the flavor. But they were room temperature. And I don't think the centers were cooked fully. Had they been hot, I think I would have appreciated them a bit more. Plus, a zesty dipping sauce may have helped. This was a miss for me. <br><br>We ended the meal splitting a plate of caramel apple French toast with whipped cream. It was very sweet - and I like sweet. But about two bites was sufficient. Share this with someone because it's good, but you don't want to overdo it. <br><br>I almost forgot...I ordered some hot mint tea and it arrived in the cutest tea pot!  With sugar cubes too. It was quite a treat!<br><br>We caught a glimpse of Chef Paul when he stepped into the dining room which is always fun. It's nice to see who comes up with these unique dishes!  <br><br>While it wasn't a perfect meal, it was quite good and I have every intention of going back and maybe I'll even bring the husband next time.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/v8MjFCknPiNByVlbsL8lLQ/348s.jpg", "caption": "Delightful French toast"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Yv7gUTYpAi-Sd6NDh1McjQ/168s.jpg", "caption": "Sweet potato pancakes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/plYAns8vMB8DhGI9Ajw0ew/168s.jpg", "caption": "My side of bacon"}]}}, {"review": {"des": "ORDER THE PORK DUET. I have dreams about this dish.<br><br>About a year ago I won a large gift certificate to this restaurant, and rather than use it for two or three visits like any sane, normal person would do, my friend and I decided to use it all in one go and try all the things. <br><br>The skillet corn bread is pretty bland, but everyone else I know who has eaten it has been obsessed with it, so I'm definitely the minority on this issue. I do like how they have full pieces of corn in the bread. The sweet potato hash is perfect, the gumbo is super tasty but most importantly, the pork duet is my everything. It's the most expensive thing on the menu but I promise you it's more than worth it. Super smoky and flavorful.<br><br>I returned this past weekend for their Andersonville Restaurant Week prix fixe menu and tried the crawfish etouffee, which was super tasty but doesn't hold a candle to their pork. Tried the calas for dessert and the rum caramel really makes the dessert.<br><br>Highly recommend!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GRv7PRwVwgxgLXfMX4ZRVw/348s.jpg", "caption": "Skillet corn bread"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SUZ_m-3AOWR9UQWzJP0qVg/168s.jpg", "caption": "Calas"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HdOoLnDgHPa6QhpDVmRdKQ/168s.jpg", "caption": "Crawfish Etouffee"}]}}, {"review": {"des": "Ate here last night. I had the fried chicken dark meat with mashed sweet potatos and collards. My SO had the chicken dumpling soup. No drinks. The fried chicken was too crispy for me, overcooked a little. The chicken itself was fine and moist but the skin/batter was nearly burnt and came off like a glove. The mashed sweets and greens were excellent. The chicken dumpling soup was ok, not great. My SO said it was bland. I thought good broth, chewy dense dumplings like slightly undercooked balls of batter which is not desirable, fine chicken. Also had the sausage meatball app which was basic. I would try again and hope for better fried chicken", "pics": null}}, {"review": {"des": "I had the most delicious spicy fried chicken biscuit this morning, and the grits were phenomenal. My husband's sausage biscuit was also very tasty. Our food took a while to come out, but our server surprised us with complimentary beignets to make up for it. I think I want these beignets for my last meal on earth. Overall delicious, great atmosphere and lovely service.", "pics": null}}, {"review": {"des": "Big Jones = BIG DISAPPOINTMENT!!!<br><br>First the fried chicken. Maybe it was a horrible night, but when I spend as much on chicken as i do on a steak at Gene & Georgetti's I expect chicken the caliber of Willie Mae's and YardBird. <br><br>This was the most overcooked, bland, horribly hard chicken I have ever had period. They must be paying Thrillist for the listing. That is the only reason we came from the city to even try it.  <br><br>Then the \"Voodoo Greens\" - tasted like they dropped a gallon of vinegar in the greens because they were pissed at somebody. My wife loves vinegar and puts it in everything and it was even too vinegary for her.  <br><br>The chicken dumplings broth was runny almost to the point of being watery, but that wasn't the bad part.  The broth was horribly over salted  and had a \"stinky chicken smell\" as if the chef forgot to put spices in to rid the dish of the chicken smell.  Hate to say this but had way better chicken dumpling at Mariano's.  This dish was inedible.<br><br>We also ordered the shrimp & grits which was horrible too. The shrimp were 30+ count and hardly there and the taste was foul. You could hardly see them. <br><br>Service was non-existent. Saddest thing is it's a Sunday and they were dead. Originally thought it was the weather but Popeye's down the street a few blocks, where we headed for good consistent chicken, was packed. I had to eat something good because our whole meal at BJ's left us hungry with a bad taste in our mouth.<br><br>We waited almost an hour in a dead restaurant to get chicken we were very excited to try then cried about what we got. Maybe it was so bad because the chicken got left in a corner under the heat lamp. <br><br>Fortunately Popeye's turns over fast and was fresh and crispy and juicy when we bit into it. Juice running down our chins like good fried chicken is supposed to be.       <br><br>Don't believe the hype.  This place is horrible with a capital H.  Save your hard earned money and stay away from this place.  Your wallet and tummy will thank you.", "pics": null}}, {"review": {"des": "Decent southern food. We had fried chicken entree and the sweet and spicy fried chicken sandwich. The sandwich is better. The service in general is good. In general the food is not mind blowing. But it is pretty good. <br>By the way beignets are not free anymore.", "pics": null}}, {"review": {"des": "After the \"James Beard\" nominations came out, my husband and I decided to try Big Jones.  <br><br>Inside is definitely cute and feels southern homey.  I told the hostess we had a reservation and she was a little snarky (I think she was trying to be funny, but it didn't come off as funny).<br><br>The beer list leaves MUCH to be desired.  I love beer, and I wouldn't have ordered a single draft on there.  Super stout heavy, dark beers.  Not necessarily what you want to pair with a heavy southern meal.<br><br>My husband and I both ordered cocktails.  I got the daiquiri, and while good, was definitely overpowered by too much lime and was hard to finish at the end.<br><br>The cornbread was delicious, but I agree with others that without the maple butter on top, it would have just been 'eh.'<br><br>I ordered the chicken and dumplings, and honestly, this was the show.  It was delicious.  Beyond delicious.  And while, yes, there were bones, it was pulled chicken that tasted like it had been stewing in the broth for dayssssss.  You get some of the best flavor from the bones, so I'm really not going to knock them for that.<br><br>Big Jones was good, but there are better food/bar combos out there.", "pics": null}}, {"review": {"des": "Mmm... I am liking Big Jones a lot. Great food, great service, and fantastic company makes this one spot I look forward to coming back more often.<br><br>Big Jones happily accepts reservations which is a lifesaver on Sundays when you're competing against all the other Chicagoans for an adequate brunch spot. When we arrived, we only needed to wait another five minutes before being seated and ordering.<br><br>Their brunch menu was certainly expansive with a lot of amazing Southern options. I went with the Catfish & Grits, since I usually get it with shrimp. You know, I needed to diversify a little bit and catfish is always on my list of favorite fishes especially when deep fried. I also got a Sazerac with my meal since I was feeling really Southern.<br><br>To my satisfaction, the catfish in my dish was phenomenal and quite possible the BEST I have had in Chicago. It was perfectly battered, deep fried, and crispy! I was shocked at how good it was especially when combined with the cheesy grits. Yum indeed.<br><br>Before our meal even began, they gave us some house beignets so suddenly I was getting Cafe Du Monde vibes from Big Jones. We waited until after our mains to consume them so they weren't as great as we had hoped for, but hey, they were compliments of the house. Can't complain and they were still really good.<br><br>I loved Big Jones and am looking forward to coming back here to enjoy more of their Southern options.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LSqpK3ezPCMv5uiTmwDCcA/168s.jpg", "caption": "Shrimp & Grits"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PSMZgDoJTI4Tb8eF5OcqLw/168s.jpg", "caption": "Catfish!"}]}}, {"review": {"des": "Cute place with average food, was disappointed as I was expecting great food based on all the reviews. The complimentary biegnets in the beginning was the highlight. We tried the Jasmine tea that was good, they brought it out in a beautiful cast iron kettle. I had the summer mushroom grits and hubby had the Eggs New Orleans. The grits were underwhelming on the whole, the crab cakes and eggs were alright. Service is pretty quick and the staff is friendly. We went in on a Sunday at 1pm and were seated immediately even though the place seemed full.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/D2XV4nmrM-CAjg3WoDvAiQ/348s.jpg", "caption": "Summer time mushroom grits"}]}}, {"review": {"des": "I've been going to Big Jones for brunch and dinner my with friends/family for YEARS.  We'd never had a complaint.  The food was always delicious.  The service was always top notch.  I often recommended it to others.  <br><br>So my two friends and I decided to order via a popular delivery service...each of us getting the Gumbo Ya Ya.  After one spoonful, we were ALL convinced we received the WORST batch of gumbo Big Jones has ever served.  It had a layer of oil sitting on top, and tasted the way burnt grease smells.  <br><br>Now...an off night in the middle of a busy holiday season is certainly understandable. But what followed (or failed to follow) is the reason Big Jones won't see me or my friends again.  <br><br>After tasting the gumbo we immediately called the restaurant to inform them something was wrong with it. Tara proceeded to explain that we weren't familiar with how their gumbo tastes.  (Pretty safe to assume anyone ordering three servings of something likely tasted it before...but ok)  To further clarify our concern, I advised that we've been to Big Jones several times and were VERY familiar with how it should taste.  I even offered to bring it in to let her (and the chef/cook) taste it themselves.  (Yes...it was so bad that I offered to drive to the restaurant to resolve the matter even though I was originally too lazy...and cold...to go dine in.  That's how bad it was.)<br><br>Tara said coming in wouldn't be necessary, took my info, and told me a manager would contact me the next day about the matter.  Well gee....by this time it was after 8...and we were sitting there, hungry, with gumbo that tasted like trash.  We had to spend yet another $$ to order dinner from another restaurant.  <br><br>If Big Jones cared about their customers and its reputation, they would've (I) apologized for the disappointing meal and inconvenience instead of trying to accuse me of being unfamiliar with their product, (II) accepted our offer to bring the food back and suggest that we dine in, crediting us for the trash, OR (II) sent out another meal.  Period.  That simple.  You do not leave customers hangry with a \"mmm sucks to be you\", \"we'll get back to you\" response.  <br><br>Oh..and it's been well over a week and I haven't heard boo from the manager, Winter.<br><br>Unacceptable.  <br><br>UPDATE:  Big Jones contacted me shortly after my review was submitted.  They acknowledged their delay in addressing my concern and graciously sent a gift card, inviting me to return and try some of the new menu items.", "pics": null}}, {"review": {"des": "This is for restaurant week. We came on a Saturday, with 7pm reservations. We were seated by the window, which was nice but cold. We were asked if we wanted to try the restaurant week menu or ala carte (which we were initially planning to do). We decided to go with the RW menu, since Eater recommended them as the places to try for RW. Anyway, we were unimpressed by the service and partly the food. Service was slow. Took us around 2 hours and 30 minutes for the 4-course menu, with long waits in between. <br>45 mins between seating and 1st dish.<br>For the first course, we had the tampa devil crabs and american chestnut tamal. Both were good and food elements were uniquely combined, like blueberries and hen of the woods mushroom in the tamal.<br><br>Next, the Owendaw Spoonbread. This was nice and warm, served in a skillet. It was creamy and buttery, perfect for a freezing day.<br><br>For entree, we chose the braised shortrib and fried mullet (which was recommended by the server over the hen bog). Shortrib was overly salty. The fried fish was like fried catfish. Sad to say, I liked the potato salad more than the actual dish.<br><br>We had the sea island benne cake and chocolate & mezcal chess pie. They're both ok, I liked the chess pie better because of the mamey ice cream.<br><br>I would say, though that there was 1 exception- water server was quick to refill glasses. Everything else was meh. I guess $33 is not much these days.<br><br>I regret not doing the ala carte menu because I'm not sure if I'd come back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/O4lc7w47TDggTEHx-PTCDw/348s.jpg", "caption": "chocolate chess pie with meringue and mamey ice cream"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9bN6H5JulWAQwe_lgZbIGA/168s.jpg", "caption": "Braised shortrib"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NvHbd_pOrgKj7Eeun6djaQ/168s.jpg", "caption": "Fried Mullet"}]}}, {"review": {"des": "So when we walked in we were automatically greeted which is a major plus for us. My boyfriend ordered the bbq pork shoulder sandwich, with fries and he loved it! I ordered the catfish and grits, could of used more grits and less beans. We both finished our meals and even ordered desert! We got the bread pudding and it was AMAZING! The decor felt like we were in someone's living room which I think it's what they're going for, so cute! Anyways point is the service was good, the food was good, had a pleasant experience! Would recommend and would come again.", "pics": null}}, {"review": {"des": "I have been there several times before the renovation. The new kitchen space with its office-style fluorescent lighting is an eyesore. The ambiance was much better with the kitchen closed off. <br><br>I've never had their fried chicken until the weekend and it is definitely not all that it is made up to be. What a disappointment. Luella's Southern Kitchen has much better fried chicken. <br><br>But, all the other food I've had there during previous visits was excellent I don't want one bad experience to ruin the place for me.", "pics": null}}, {"review": {"des": "Had dinner there last night. Great environment, good drinks list but the food was mediocre with portions inedible.  Specifically, some of the vegetables (eg potatoes), were cold when they arrived at table.  Same with the shrimp.  Fried chicken which appears to be their signature dish was over cooked and \"chewy\".    Felt like the food had been precooked and sitting.", "pics": null}}, {"review": {"des": "I'm pretty picky about brunch spots, but after reading numerous Yelp reviews and Eater's lists of hottest restaurants in Chicago, I decided to give Big Jones a try. We were on our way up north when we hit traffic, so I decided to make some last minute reservations in the car for 12:30pm on Saturday. Luckily, there was an open spot available! It was no problem finding free parking once we reached Edgewater, so we showed up 15 minutes before our reservation and thought maybe we'd have to wait. Nope! We were seated immediately right by the windows. Very charming and bright inside! Service was great as well. I ordered the Bloody Mary to start (happy hour price was $6 vs $9), and my boyfriend ordered his usual black coffee. There is something for everyone on the menu, especially if you're in the mood for Southern food. We ordered the Shrimp and Grits, Fried Chicken and Biscuit (dark meat), Potatoes O'Brien, and the house-cured ham poached in cream to share. The verdict? Everything was decadent and tasty! I loved the shrimp and grits, the potatoes were nice and crispy, and the ham was very good. I've never had ham poached in cream before, so the closest thing I can compare it to is ham in hollandaise sauce. And I love a good hollandaise, haha. While the fried chicken was good, and I'm positive a lot of people will call me blasphemous for this, Popeyes is my baseline (as a great man once said, it's the shiznit). It was not better than Popeyes in my opinion, so do with that what you will  To finish, we ordered the beignets. It was the perfect treat to wrap up a great meal. We'll be back for the dinner menu!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jd7POnXcI0OnU-5iVDviGA/348s.jpg", "caption": "Beignets"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XLLWSM626UGupmvaZ3Fekg/168s.jpg", "caption": "Fried Chicken and Biscuit (Dark meat)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1fBZdxjhETcmqzTz3rPZCA/168s.jpg", "caption": "Potatoes O'Brien and ham poached in cream"}]}}, {"review": {"des": "Love to order for home delivery Big Jones chicken with the greens and beans.  This makes Chicago's best chicken so convenient.  The new remodeling looks great with the open kitchen.", "pics": null}}, {"review": {"des": "Best fried chicken in Chicago, hands down. Cocktails are very nice as well. Only reason I don't give five stars is that the service seems to be pretty inconsistent whether they're busy or not. Hope they straighten that out.", "pics": null}}, {"review": {"des": "Came for drinks, Stayed because of the kindness of the employees.  We arrived around 4pm and was told the patio was not open.  We said we would come back later and then they opened it for us and we had the greatest service even though we were the only ones out there.  Drinks were phenomenal and charcuterie plate with their own home made breads and biscuits was delightful.   Definitely recommend.", "pics": null}}, {"review": {"des": "We went to this place due to being part of the top brunch spots for Chicago. I think it's a bit overrrated. We made a reservation, once we arrived over half our party was there and they couldn't seat us until the last person of our group arrived. I think it was because they also didn't have a table for us. So that may have been there excuse. <br><br>Now to the food. I ordeded the Bayou teche omlette. Wasn't bad. But the side dish was terrible. I got both the grits and the potatoes. Grits were watery and potatos weren't fully cooked like I requested. My sisters got the catfish and it wasn't seasoned or anything. It was just super plain. They didn't even eat it because it just didn't taste right.", "pics": null}}, {"review": {"des": "I'm a fourth generation Chicagoan. But if I wasn't so entrenched in this city, for sure I'd live in New Orleans. In fact, I keep one foot down there. Hands down its my sister city. And the food goes one of 2 ways... <br><br>The cafe up the street was a bit too sunny, so I settled for BJ. I had no expectations; how could a chicago eatery compete with some of the places I've been to down south??  Bustling and noisy, I was seated at a small table. Beignets appeared. A bit denser than expected but really good!!! Then I ordered a charcuterie plate and it had a beautiful relish and a cheese pimento spread. Now I was *really* impressed. I could have stopped right there. Then popovers, which arrived with jam and maple butter. Main course was eggs and crabmeat, with hash browns worth eating. I had to do a push back on the table or they would have had to roll me out of there. Of note is the wonderful tea selection.. I am a tea snob and they scored points with that as well. These people GET IT.", "pics": null}}, {"review": {"des": "It was 8 degrees outside and their furnace was down so it was cold inside, so we all ordered hot chocolate. What they served us was room temperature, very watered down (no sweetness *or* flavor), and they charged us $4.50/cup for that nonsense!<br><br>The food was great, but I can't get over how bad the hot chocolate situation was.", "pics": null}}, {"review": {"des": "I was so, so disappointed with Big Jones. My husband and I are recently married and this was our first date night out and we were craving some good southern food after eating like rabbits leading up to our wedding! We were excited to check out a new neighborhood and stumbled upon Big Jones on Yelp. The reviews were promising so we headed there. We only had to wait about 10 minutes for a table without a reservation, which was great. We were so excited and ordered the hush puppies and corn bread as starters. Unfortunately, it took over 40 minutes to receive our food. Our server was really nice about it and apologized after about 25 minutes that the kitchen was backed up and told us the hush puppies would be comped from our bill. A nice gesture, but it was nearing 8:30pm at this point and we hadn't eaten since lunch. Our appetizers finally came to the table and I was so excited to finally dig in. Unfortunately again, I was disappointed. The hush puppies were incredibly dry and had virtually no flavor. We felt like we were eating crumbly old bread. We then decided to try the cornbread and found out that that too, was dry. It had a scoop of honey butter on top, but it didn't do the cornbread much justice.<br><br>By the time we received our main courses, I was unimpressed. I had ordered the burger and my husband had ordered the fried chicken. Luckily, the burger was perfectly cooked and delicious and I had a bite of the chicken which was also cooked very well and tasty. This is the reason for the 2 stars here. However, I've had much better burgers and fried chicken. I left Big Jones feeling rather unsatisfied and sad that we wasted our first date night as a married couple there. Sorry, Big Jones, we will not be back.", "pics": null}}, {"review": {"des": "Great cocktails, great atmosphere, great service, and mostly great food.<br><br>A standout is definitely their Skillet Cornbread which is a must. We also had their Fried Green Tomatoes, Pork Terrine, Shrimp & Grits, Shrimp Burger (the grits side for this was actually better than the grits that came with the Shrimp & Grits), and Butcher's Pork Duet (portion for this dish could have been bigger). All dishes were good to great. My dad was disappointed in their Shrimp & Grits and I've had better too. He does live in North Carolina now so is somewhat of an expert on the subject. My cocktail (Arcades Project) was excellent. It was comprised of Copper & Kings brandy, coffee infused Campari, Carpano Antica, and Cynar which was definitely my kind of cocktail.<br><br> Big Jones brings the tastes and spirit of the South to Chicago.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aV7DH3heJVr8-thmU9rvyg/348s.jpg", "caption": "Awesome Skillet Cornbread"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ba51mYEE8m7ny0r36ITvBw/168s.jpg", "caption": "Boulevardier (top) Arcades Project (bottom)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_jI5ICL9QO59Iv3j5qpSiQ/168s.jpg", "caption": "Pork Terrine"}]}}, {"review": {"des": "Holy crap. This is hands down THE best breakfast I've ever had in my life. I'm actually still sitting here writing this review because I couldn't wait to share. <br>I'm from Utah (no I'm not Mormon) and I never had grits before today. After tasting them, my date told me don't ever compare any grits to those because you'll be extremely disappointed. I had the Bayou Teche omelette and requested egg white. No problem there. Best part? They weren't egg whites from some carton. This kitchen separated them for my meal. I literally could write so much more but trust me, just try this place. You won't regret it!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jjrA7LHLpVjkWFppVGLrBQ/168s.jpg", "caption": "Bayou Teche omelette made with egg white and grits!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/R-1swpRO0DmyQ4_XsY0LKg/168s.jpg", "caption": "Peach roasted French toast. So. Damn. Good."}]}}, {"review": {"des": "Love Big Jones and glad that they are in Andersonville. Inventive menu and love their take on   Southern dishes. It never disappoints.", "pics": null}}, {"review": {"des": "My husband and I came here a couple of months ago when we were in the city. We had dropped off our nephew at a concert and decided to have a nice dinner. We had been wanting to try Big Jones, so we decided on it. Walked in and were told it would be a 30-45 minute wait (not bad for a Friday night). Yes, the place is a bit cramped which kinda sucks, but that's becoming more and more common.<br><br>My husband had the chicken and dumplings, and I had the fried chicken. The chicken and dumplings were pretty spectacular, amazing flavor (even if a bit heavy with the pepper). My fried chicken had great crunch and was very juicy. The seasoning was only slightly lacking (but that's just my taste), and you have to wait if you want fried chicken since it's all fried to order.<br><br>Service was very good, drinks were also very good. Would I go out of my way to come here? Not really. But if I'm near Andersonville, it'd definitely be on my list of places to come (if I had the time to wait).", "pics": null}}, {"review": {"des": "Two words: Southern comfort. Two more: fried chicken. And two more: get here. <br><br>Finally was able to swing by with a few friends for dinner. I made a reservation, but probably didn't need to for a weeknight dinner--the place was busy but not packed. <br><br>The three of us shared the skillet cornbread, okra, mac and cheese, and a short rib app that doesn't seem to be on the menu anymore, and each of us got the chicken dinner. Everything was cooked to Southern perfection--and this is coming from a gal who grew up in the South!! The standouts were the okra and cornbread. The chicken was, as expected, great--it doesn't seem like a huge portion, particularly for the price, but the crispness married with the fresh chicken gives you a wonderful and not overwhelmingly greasy meal. We arrived starving and had to be rolled out of the restaurant. <br><br>I'll definitely have to come back to try the famous and much raved about  brunch!", "pics": null}}, {"review": {"des": "It's a great brunch spot. I don't think you could go wrong with anything on the menu, but I did have to start myself out with a Bloody Mary which was pretty good. I went for the Bayou Teche and was not disappointed. It's not surprising that I finished the whole thing. The service was great and the prices were reasonable. I would love to come back for lunch or dinner and try other Southern food items. I will also be back for the beignets!", "pics": null}}, {"review": {"des": "Lawddddd grew up in the south and have been missing food that is flavorful and not covered in mayo (sorry midwesterners). Had a great dining experience today, service was awesome and the food ruled. We will def be back!", "pics": null}}, {"review": {"des": "I love a place that takes reservations for brunch--you have a special place in my heart already. <br><br>And when the food is so good and the space so warming--it's easily a new fave and I can't wait to go back. <br><br>Our table for 6 was ready promptly at 1100--they wont seat until your whole party is there. And the waiting area is quite small so the weather is cold, your waiting might have to be in your car or the bar across the street. <br><br>The menu for brunch has sweet and savory items, but with a fun Southern/Bayou twist. A lot of the items are also inspired from a different time--18th century, 1930's, etc. A lot of thought went into these dishes!<br><br>We shared a bunch of starters--biscuits, popovers, beignets and hush puppies.  All were good, but the biscuits with that awesome pepper jelly was my favorite. The beignets were a lot lighter than the ones I've had in the past but still good.  I don't think the popovers are meant for sharing, the hollow lightness gets lost when you try to cut it up. <br><br>We each went with our own items and had the Cherry Custard French Toast to share--the perfect dessert to our savory items.  Osi and I split our dishes--which was perfect because I couldn't decide between a few things.  The Eggs New Orleans (crabcake benedict on popovers, Bernaise sauce) and the Tomato and Goat cheese omelet served with grits. <br><br>That omelet was the most perfect omelet I've ever seen--in size, shape and visual presentation. And taste wise--amazing. The tomato was fresh and the goat cheese was creamy and pulled it all together.  The grits---let me sit here and sigh again--they were creamy, rich, cheesy...so damn good. The best freakin grits I've ever had for sure. <br><br>The crabcake benedict was also very good.  The egg poached perfectly and the crab meat was super fresh.  The Bernaise sauce--a favorite of mine, was also perfect. <br><br>Everyone seemed very pleased with their meals and drinks.  The space is small so you're going might be elbowing a neighbor.  The front area is my favorite as it's more open with the big front window. Service was nice--he seemed a bit harried, but the place was packed and he was zooming from table to table. BUT he still offered to take a picture of us for our table.  Sweet service, awesome food.", "pics": null}}, {"review": {"des": "One of the best brunches in Chicago or possibly anywhere!  That's no secret, because you must make a reservation.  The restaurant is small, and brunch is always better in groups, so expect to wait awhile if you show up unannounced.<br><br>The interior of the restaurant is nicely decorated.  The chairs, tables, dishes, and art all have a southern feel.  But it's more like grandma's house than that overdone kitsch rustic theme that's everywhere these days.  No mason jar glasses here!<br><br>The drink menu offers a variety of cocktails, spirits, teas and sodas.  I had a Pear Sweet Tea which knocked my socks off.  My friend had a Pomegranate soda which was lightly sweetened and bubbly.<br><br>Our group of 6 shared everything - well, almost everything.  I was in a \"JOEY DOESN'T SHARE FOOD!\" kind of mood, so I kept my entree for myself.<br><br>The biscuits were served with a pepper jelly and honey butter.  A+ for the biscuits.  These were crunchy, dense, and peppery.  The other items were tasty, but the biscuits were the best!  We also shared beignets, popovers, and hushpuppies.  I did not like the beignets at all.  The hushpuppies were good.  We devoured everything.<br><br>Somehow I still managed to eat my entire entree, the Carolina Gold Waffle (corn waffle with duck sausage patties, duck egg, huckleberry compote, fried sage leaves, and a dollop of creme fraiche).  Only a genius master chef could come up with something so delicious.<br><br>Waffles are always delicious.  The duck sausage patty was more like a pulled meat shaped into patties.  The salty, herby flavor of the fried sage leaves tasted amazing with the huckleberry.  And who doesn't love a dollop of creme fraiche?  This dish was the perfect balance of sweet and savory.  I loved that the ingredients were experimental, but not completely foreign, and now I want to spend all afternoon frying sage leaves and picking huckleberries.<br><br>The Eggs New Orleans (crab cakes and bearnaise sauce served on popovers) and the sweet potato pancakes also looked tasty.  A lot of the entrees use popovers and biscuits so you have the opportunity to try many things.  <br><br>Everyone seemed super satisfied with their food, we definitely need a nap afterwards!<br><br>Entrees in the range of $11-18. Prices are justified by the quality and quantity of food. Portions are hearty but not gross. You will eat like a KING here.", "pics": null}}]}