{"name": "big-star-chicago", "reviews": [{"review": {"des": "Big star! The menu was simple and to the piont.<br>I enjoyed the 21 and up check in the front. The two reasons it's not 5 stars are personal reasons<br>1) too crowded not just people but the seating<br>2) crowdedness cause slow service and time wait<br><br>Other than that.. the crowds didn't affect the actually waiters attitude or the food quality.<br>Got our drinks in no time.<br>Food was fresh and abundant when on the plate. Size was right between finger food and appetizers. <br>Great prices for different tacos and drinks got seven tacos and three drinks for about 50 bucks.", "pics": null}}, {"review": {"des": "I really don't get the hype around Big Star....the place is always crowded and the tacos are so whatever...very dry and bland.  I will say that it's a cool place to have a few Lonestars though.<br><br>Overall, come for the beer- go down the street for better food", "pics": null}}, {"review": {"des": "Everything was just okay.<br>-Tacos were just okay<br>-Service was just okay<br>-margaritas were just okay<br><br>Nothing stood out to me. Nothing wowed me. Overpriced for quality.", "pics": null}}, {"review": {"des": "Some of the best tacos I've ever had, actually everything on the menu is awesome!!!! My favorites are the Al Pastor, Carne Asada and fish tacos which are perfectly breaded. If your particularly hungry, or even if you're not, order up the Queso Fundido. <br><br>The cherry on top is their whiskey selections. Not only do they have some of the best rare whiskeys America has to offer, they also hand select specific whiskeys at the distilleries which are then barreled just for Big Star. I tried one of these, which was a specialty barreled Blantons whiskey, side by side with the standard Blantons. It was outstanding! Smoother compared with the standard Blantons. Also the staffs knowledge and palate of Big Stars whiskey selection was very helpful.", "pics": null}}, {"review": {"des": "Came to Big Star with some friends who were local. I do not live in Chicago and we wanted to bar hop around the Wicker Park area. We went on a Saturday night around 8pm and we only waited 30 minutes. We went to the bar and got margaritas and shots of tequila which were decently priced. The margaritas were strong and I loved that! Our group of 5 was seated in a booth and we ordered the chips and guacamole which was delicious. We also split two pitchers of margaritas which was such a deal. I ordered the pork and steak tacos and they were good! This isn't an authentic taco experience but this place was trendy and had a cool vibe. We had a lot of fun and the food came out quicker than I expected. If I'm ever in Chicago again I would go back!", "pics": null}}, {"review": {"des": "This place is bumping and happening on a Saturday night for sure. We waited about 40-1 hour for our table, but it wasn't that bad of a wait since the bar was open. A couple of Margs were definitely worth it while waiting.<br><br>Once we go to the table, we also ordered a pitcher of a margarita, which was very delicious. We also ordered the queso and quac. The queso has chorizo mixed in with it which was a great touch. The guacamole was decent, nothing outside of the world. <br><br>Food wise, we all obviously ordered the tacos. The menu has a decent amount of tacos ranging from meat to veggie. There are also a couple of salads and tostadas on it.  Very reasonable price for the food. <br><br>Most of us ordered the pescado, the chorizo, the pollo. All were very delicious but the fish was by far the best. It was cooked to perfection and very crisp. All the tacos come out family style one big plate, so keep that in mind when ordering what you want. <br><br>Overall a great experience and the atmosphere and service was good too.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/I0Pr6aRa1_rm-9Xy3UycKA/168s.jpg", "caption": "Queso"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-W_l8QHbHZkTGYDjKJvivw/168s.jpg", "caption": "Alllll the tacos"}]}}, {"review": {"des": "Love this place! Every time I've been here it's been consistent with food, service, and drinks! Oh the drinks! I am usually a margarita girl if I'm gonna have tacos but we came in after a concert one night and ordered a big pitcher of Paloma's, so so good! <br><br>I'm all for some pastor and there's is pretty delicious but don't pass up that pescado taco! Full of flavor and cooked perfectly. <br><br>The queso fundido is also a cant miss. Provides a bit more than cheese and chorizo and pairs well with the warm chips. Big star may be more about the atmosphere than authenticity but you're not going to have a bad time or a bad meal here. Definitely a Chicago staple!", "pics": null}}, {"review": {"des": "Went here for dinner with a group of 5 on a Monday night. Got seated right away. I got the pollo taco and the Carne Asada taco, my friend got their chorizo taco and pescado taco. Overall my tacos were okay, they needed a little more flavor. My friends said the pescado taco was really good.  The tacos come out super fast (less than 5 mins). They do have shots of the day which changes everyday. When we were they had a $3 whiskey and $4 tequila shot. They also have an extensive drink menu to choose from.", "pics": null}}, {"review": {"des": "Had a little solo trip to Chicago and this was the first place I went to by myself. And it was really nice! I sat outside and the weather was perfect. It wasn't too chilly and the sun was out. The people who helped me out were really sweet too. I ended up ordering one al pastor, one carne asada, and one pescado! They were all really good. And in comparison to LA tacos, it was actually up to par. I think really enjoyed the fish taco the best though. All the sauces with the meats were really good together and I really liked them. I would highly recommend this place if you are ever in the area! Wicker Park was a really nice hipster area too!", "pics": null}}, {"review": {"des": "Wow has Big Star gone down the drain. The food was delicious as usual but the service is completely nonexistent.<br><br>We got seated and when the waitress came over she looked affronted that we had been seated in her section. I ordered chips and salsa and a margarita and she looked so confused that I was ordering from her.<br><br>Chips and salsa were delivered by another girl. As was the margarita. We wait for her to come by so we can order food but she just would walk around staring at her phone. I stared at her and nothing. Finally someone else got seated next to us and she came by to check on us. No, how's your drink or ready to order. <br><br>I told her I was ready to order and she looked confused that I wanted to order something from her. Her, the waitress in a restaurant where you order food at the table and not at a counter. <br><br>I order and food is delivered by someone else. She never comes back to check on the meal or ask if everything was alright. Nothing.<br><br>I finish my meal and my drink and start looking for the waitress to come back so I can get my check. She avoids eye contact with me whenever she walks around. Finally someone else - maybe a manager - comes by and notices our table has been cleared and asks if need anything. She delivers the check, not the waitress.<br><br>I'd write down the name of the waitress but she never introduced herself. And I would've said something if she had ever showed up.<br><br>I used to love Big Star but I'm not going to spend money on a meal if the service isn't there. I can get good tacos anywhere. I used to come for the atmosphere and the overall experience. <br><br>So unfortunately I can't recommend this place. Go somewhere else. It's Wicker Park - there's food everywhere you look.", "pics": null}}, {"review": {"des": "I just really love this place. One of the best patios in Chicago, amazing margaritas, and the tacos are outstanding. Docked a star since it's always such a wait to get in, and you often feel on top of other people when dining. I'd also love to see them fry the fish in a separate fryer, as I have an allergy and can't enjoy their amazing guac and chips due to cross-contamination. My favorite taco there is probably the mole! Just outstanding flavors all around.", "pics": null}}, {"review": {"des": "This place is an overrated hipster haven of mediocre food. There are a variety of tacos, and the only one remotely good was the chicken taco. The downside is, they serve it on a flour tortilla. Is this Taco Bell? <br><br>The chips and guac aren't terrible, but the quantity of guac you get compared to most places is about half. The chips actually give this some redemption, but not worth $8. Yeah, I get the rent is high, but give us some value for our money. I ordered a horchata to go, and was disappointed to find out that it was more like flavored water. <br><br>Now, I know this won't change minds, or change the food, but for those of you who want real Mexican food, head over to Chicago ave.", "pics": null}}, {"review": {"des": "Caution reading this we went post yoga and were starving!!!!!<br><br>This was exactly what we needed. The staff sat us promptly, they had the chips and guacamole out immediately. The atmosphere was fantastic. Beautiful patio cute decor. The type of place you just want to hang out. The tacos were ok. I am a native to Phoenix and am a self declared taco snob because we are incredibly spoiled being so close to Mexico. For a Chicago taco spot I was impressed.", "pics": null}}, {"review": {"des": "*vegetarian- Tostada de hongos ($4) - basically, mushroom tostada (flat crispy shell). I love meats, but I thought this was pretty good. It was a little difficult to eat without it falling all over the place - really have to make sure you eat it before the tostada sogs up from the mushrooms.<br><br>*Vegetarian- Tacos de zanahorias ($2.5) - diced carrots in mole. I don't think I'd order this again, as it wasn't filling, but the taste was interesting and could be a great option if you're strictly vegetarian. Personally like the mushroom taco better though. <br><br>Unfortunately, I reordered the pork belly tacos, and this time, it just didn't taste as good as previous visits - oversauced and can't even taste the delicious pork belly! Oh well.<br><br>Margaritas are delicious - definitely more cost effective to get the pitcher!<br><br>Friday evening, dreary weather - packed inside but we were able to enjoy outdoor patio before the rain started. Everyone was so accommodating, and our waitress was very attentive and quick.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/N8kNnvv8sMHSx7hLoYebXQ/348s.jpg", "caption": "6.22.18 tostada de hongos (mushroom) $4"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wXSuXPF6WrTBVBmurA5FmA/168s.jpg", "caption": "6.22.18 Taco Panza (pork belly) $4"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1Lb4AZww0hHF3Hhv93N1uQ/168s.jpg", "caption": "6.22.18 Taco de Zanahorias (carrots) $2.5"}]}}, {"review": {"des": "Everyone I knows solid taco joint. No matter how many hipsters try to hate on it being so mainstream, you must admit that they've killed it on the vibe and they have a few tiny tacos that pack massive flavor<br><br>My Mexican friend gives me grief that it's not the most authentic taco, so I philosophically ask the yelp community, what is an authentic taco? <br><br>If it walks, talks, or tastes like the Panzo (pork belly taco) and leaves me wanting more beyond a full stomach, then it's as real to me the the sugar in their Mexican coca colas - side bar- when will those just be standard everywhere?<br><br>While it's true that not EVERY plate is deserving of a 10, and the Horchata here is my least favorite Horchata drink in the genre of Mexican joints, they know how to balance the scales with their Mezcal drinks... and any place with a good Mezcal has the key to my heart. <br><br>Big star, I'll give you 4 stars", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/59tGlGp2A0BQ8w3kyUgZ_A/348s.jpg", "caption": "Taco de Panza in the back Taco de Chorizo Discada in the front Mexican Coca Cola Horchata in the back"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6vQIth3NMnGjbGLCCcS5WQ/168s.jpg", "caption": "Taco de Panza in the back Taco de Chorizo Discada in the front"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-KigU9w6etNrlBDHLCrj9A/168s.jpg", "caption": "Quickie before the show"}]}}, {"review": {"des": "Love this spot, especially in summer! They have a big outdoor area with lights, which makes this place romantic and perfect date spot or just friends hangout. I went there for multiple occasions during all seasons (Wicker Park location). I tried almost all the tacos! (Yes, seriously). And I really like their margaritas as well. Last time me and bunch of friends headed there after Wicker Park fest on Sunday night. I have to say it was after 10pm so this makes this place a perfect late night bite spot.  Our server Jeffsen (sorry if I spelled it wrong) was very knowledgeable and most important patient with us (since we were hungry and loud). He made great suggestion about food menu and we were happy with his choice. We started our dinner with classic chips and guacamole. It was enough to share for 4 people. We each order bunch of tacos to share and all tasted good, but my favorite one was taco de pescado (fish taco).  <br>Now I need to visit their new location in Wrigley!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lKeCV4r2OaLGwjV-8ax-GA/168s.jpg", "caption": "4 Taco de Carne Asada, 2 taco de Taco de Pollo and taco de Taco de Pescado"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KWzwZ_oqbmDrqWiDGdQeKA/168s.jpg", "caption": "Tostada de Hongos"}]}}, {"review": {"des": "I came to Big Star as my first stop right after landing at O'Hare for a visit to Chicago; it's right off the Blue Line (Damen stop). I came on a Friday afternoon around 1:15pm in a group of five. It was really packed when we arrived, but the crowd died down as the afternoon went on. We sat outside since it was a warm, sunny day.<br><br>I ordered the Tostada de Hongos (stewed mushrooms, fresh tomato and serrano salsa, poblano pepper, goat cheese, marinated summer greens) and the Taco de Papas con Rajas (potatoes, rajas chipotle, queso cotija, onion, cilantro). Both plates arrived within less than 5 minutes and were delicious! They were both a bit spicier than I was expecting, so I was glad I ordered a draft beer to cool down my mouth.<br><br>While a little pricey for the portion sizes, Big Star has a great, lively atmosphere and is perfect for a quick drink and some delicious bites!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JzYEQmbb4MvlxGqsU5buaw/168s.jpg", "caption": "Tostada de Hongos (stewed mushrooms, fresh tomato and serrano salsa, poblano pepper, goat cheese, marinated summer greens)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ea-F2e5MS94p0rc6ej_dOQ/168s.jpg", "caption": "Taco de Papas con Rajas (potatoes, rajas chipotle, queso cotija, onion, cilantro)"}]}}, {"review": {"des": "You almost have to spend hours here to validate the wait time to get in, during dinner time. Everyone and their mother wants to be here. It's the taco of the town. Is it the best? It's the best place to get bombarded with crowds around the six corners of Wicker Park. <br><br>This is usually how my Big Star experience goes: <br>1. Wait one and a half hours for a table. <br>2. Order a margarita pitcher for the table.<br>3. Get lost in the wordy menu.<br>4. Ask server for suggestions. Drink marg.<br>5. Order three tacos. <br>6. Wait for tacos with another marg. <br>7. Tacos arrive. Nom. Nom.<br>8. Leave tipsy and full. <br><br>Have yet to find my favorite taco here. Cool place for a patio Sunday Funday.", "pics": null}}, {"review": {"des": "I'm sure this place is great at any hour of the day, but I found it works particularly well as a late night spot.  It's open late, the beer list is seriously inspired, and the tacos are a perfect last call bite to soak up some of the alcohol.  Hip, but not aloof crowd.  Comfortable space.  Highly recommended.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BUaFhV4dzdsIHBS0Do6xAA/348s.jpg", "caption": "taco al pastor * taco de panza"}]}}, {"review": {"des": "Big Star is an awesome stop for drinks and tacos in Wicker Park. Come early or expect to wait a while as the line is often obscenely long. Those who tough it out are rewarded with awesome margaritas and a prime spot for people watching. There's also a take-out window for those who don't want to brave the never-ending line.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BMgNxszYUSvJg4DEM8ZK8A/168s.jpg", "caption": "Margarita"}]}}, {"review": {"des": "Pretty solid taco specialty a la carte options, great margaritas, and an amazing patio atmosphere in the summer!<br><br>Big star may not be my all time favorite restaurant in wicker, but it most definitely boasts of one of my favorite patios. Their food is legit, don't get me wrong. However, the absurd amount of time it may take you to wait and get a table (they don't take reservations) may not be worth it. I will say though, they make a mean pescado and al pastor taco, have great vegetarian options, and if you're looking for s spot to loiter and enjoy a few beverages while getting quality food (and you're not in a hurry) this spot is definitely worth checking out!", "pics": null}}, {"review": {"des": "Went for Cinco De Mayo. Online it says they open at 11:30 but I found out later that they opened at 11. We went at 11:10 and hate to wait in line but were seated a little after 11:30. Huge outdoor space and tables with shade so definitely a good space. <br><br>Margarita pitcher is the move. Comes with 6 margaritas for $40 whereas margaritas are $10 a piece. Margaritas are small but tasty and the two I had were a good start to the day (meaning I started getting a little tipsy but they weren't overly strong).<br><br>They bring you chips with two types of salsa (all good) and when asked our waitress refilled our salsa so we could finish our chips. <br><br>I had the Taco De Panza and Taco Al Pastor first. The waitress recommended them as most popular and I guess I'm basic because I loved them. I also had the Walking Taco (I forgot to take a picture but it comes in a Frito Bag... the waitress warned me of this... I knew it would because I've had other walking tacos in the chip bag before, but I guess some people are surprised when they get it). I liked it and it tasted as expected, but to be honest I regretted ordering it just because I think their other tacos were better for the meat. I can easily throw some Fritos with some refried beans and the rest of the ingredients together, but to make marinated spit roasted pork or braised beef shoulder (the proteins in my other tacos) so well takes time and know how. I should have thought that through before ordering but lesson learned.", "pics": null}}, {"review": {"des": "Whiskey is where it's at. <br><br>I know, I know....Big Star is where everyone goes for tacos and to be seen eating said tacos(in person and on the grams) and I get it, they're tasty but the real gem (hidden gem maybe) is the whiskey selection. <br><br>They've got some serious pull and beverage program talent to be able to wrangle in all this corn and grain distilled glory. <br><br>Do yourself a favor when you order your tacos, be sure to back it up with one of those fine whiskeys they have to offer.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DUHUFfRXDSpLpBc26ouelA/348s.jpg", "caption": "Weller Single Barrel (Big Star/Violet Hour Addition)"}]}}, {"review": {"des": "Ordered from the convenient To-Go window that's made for the after bar hopping/late night munchies. <br><br>Ordered the fish taco which I really liked. $4 was pricy but the fish was crunchy and flavors delicious.<br><br>The other taco was not as memorable and was also $4.<br><br>Overall, $8.84 for 2 tacos was pricey but worth trying once but I definitely wouldn't wait hours for these tacos.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-ch-8yPvP3aQdw3RpdTAwQ/348s.jpg", "caption": "$8.84 for 2 tacos"}]}}, {"review": {"des": "A beautiful patio with great drink options but very underwhelming tacos.  The tacos are served on small, boring tortillas and many of the meat varieties are seasoned very similarly and offer little creativity.  The queso fundido is really good, but there's plenty of nearby places to grab a superior taco.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/n59wBp1V-4mZs6mN-6fG2w/348s.jpg", "caption": "Queso Fundido - Best thing on the menu at Big Star"}]}}, {"review": {"des": "The tacos, which are heralded by many to be some of the finest in the city, fell short of my expectations. Yes, they were tasty, but were also very small (and over stuffed) for their price. I understand that tacos can get messy, but when half of the contents spill out after one bite, there's a bit of an issue there. <br><br>Onto the service: T'was carded once I stepped inside at noon (?), is this standard practice? Our server, Kathleen, wasn't too friendly. She only provided recommendations upon our request, and didn't seem to take much interest in providing excellent customer service. <br><br>The tacos arrived on a single (1) plate. Mind you, we ordered 5 different tacos, and we ended up eating different tacos than what we ordered. Is there a shortage of plates (?!) The runner mumbled which tacos were which before running off. <br><br>Our server took a very long time to come back to finish up our order; she even forgot to produce a receipt without us prompting her. <br><br>Facility: It's a decent place, very loud (as expected). The indoor patio area roof is leaking, so be aware. <br><br>TL;DR: Mediocre tacos with sub par service, not worth its price. Will not be returning.", "pics": null}}, {"review": {"des": "Sorry, but I love this place.<br>This is my neighborhood go-to spot. I can always find a spot for one and almost never have an issue finding a spot for two at the bar. I feel like you only run into issues when you want a table here because the wait time is horrendous. Otherwise, you're gravy!<br><br>If you're looking for a strong and great margarita, this is your spot. Pitchers run about $40 and you'll get about 5-6 glasses out of it. Their Micheladas are also so tart and kinda spicy, the way mama likes them.<br><br>I don't think I've had a bad taco here either. Their verde salsa complements any taco. My favorite is their Walking Taco. It comes in a Fritos bag and is vegetarian. Add carne asada and it's a game changer!<br>Speaking of carne asada, my second favorite taco here. Super packed with meat, again, how mama likes it.<br><br>Chips and guac seem pricey but there's plenty to share or just eat yourself. Also comes with two sides of salsa. My favorite is the verde (as mentioned before).", "pics": null}}, {"review": {"des": "If you're looking for tacos in Chicago Big Star has some of the best tacos! This place can get really crowded and there's sometimes a wait if you're with a larger group but if i's just you and a friend there's a lot of bar seats available. This place is super close to the L so very convenient to get to.<br><br>My go to taco is the fish taco. It's the best taco they have but i've also tried their other ones which are solid choices. I haven't had anything outside of their menu besides the tacos and chips so I can't talk about that. Their margaritas are the best though! I split a pitcher with my boyfriend. The price isn't bad and they make their margaritas pretty strong but taste great! It's also amazing to watch the amount of margaritas the bar churns out. <br><br>If you're not up for a wait they also have a to go section on the other side. I've been to the to go section more than the actual restaurant. The to go one is the perfect option if you're in a rush and the wait is never long! They also have a lot of seating in that area. Although, you can't buy alcohol it's a great option.", "pics": null}}, {"review": {"des": "Pretty much the definition of \"meh\" from a food perspective.  And nothing in the way of ancillary perks to bump the rating up at all.  Tacos were passable, service seemed confused (misplaced an order of guacamole and brought the wrong taco in place of one they recommended), and place was super loud.  More of a \"see and be seen\" spot than a place to head for the food.", "pics": null}}, {"review": {"des": "Big star is home of big fun and big flavors. The three types of tacos I ordered each had it's own distinct flavors, and the flavors were booming boy. Each one had great taste and texture, and I really wish that they came with guacamole or something, because I feel like that would really take these tacos to the next level. I also ordered the melted cheese tacos too, and boy were these heavy. The melt greazy cheese combined with the chorizo wrapped in a fresh hot tortilla was really good, but I recommend you split this dish or you're gonna be walking out of the restaurant feeling like you have an anchor in your stomach. Overall really good flavors, I just wish it had a touch of some fresh guacamole or something to put it over the top.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yDmX4-i-T5Av615xwksbig/168s.jpg", "caption": "Ooey gooey delicious"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WYDyCCTrsxJodqh3_665bg/168s.jpg", "caption": "Flavors booming and exploding"}]}}, {"review": {"des": "It is correctly named as Mexican street food. Similar to tacos from a food truck. That's probably why I enjoyed them so much. We sat outside. Beautiful nite. Patio was dog friendly. Service ok. Very busy. Could of used more servers. We shared seven different menu items plus guacamole.  Enjoyed my experience overall. I am not much of a beer person but our two experts were very satisfied.", "pics": null}}, {"review": {"des": "Tacos were fresh and tasted great! The seasoning was delicious and the veggies/meats were tasty. <br>Cocktails are amazing and strong!", "pics": null}}, {"review": {"des": "The venue itself is very impressive. Spacious, well decorated, and walls that open to create more outdoor seating. The service was quick and staff was very polite. The tacos were good, but with lots of competition in Chicago, these were not \"THE BEST\". My Al Pastor Taco was delicious! However, my Chicken taco was not so good. Would recommend you check this place out, especially when the weather is nice and you can sit outdoors.", "pics": null}}, {"review": {"des": "Im giving Big Star a very generous 3 stars because their tacos are small, yet flavorful, but way over priced. We went during lunch with a group of coworkers, the service was fast and the server got our order right, which is huge cuz we had a party of about 7. <br><br>Will probably not go back, glad I got to scratch it off my list, but there are so many better taco joints throughout the city.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LR6cdPUzSF5yNkABgeMptw/348s.jpg", "caption": "Tacos from Big Star...overpriced but delicious!"}]}}, {"review": {"des": "Came here with a large group (I feel like I always do this. So sorry restaurant staff and owners!!) yesterday and the hostess/waitress was super friendly and accommodating. We sat in the semi-outdoor spot and loved seeing all the Christmas trees stacked outside (their next to a tree farm!)!<br><br>The spicy tequila margaritas were so good and the chips were warm and fresh with some guacamole mmmmmm! We got the al pastor tacos (personal fave), the pescado, the chicken mole (soooooo good), and the patatas tacos. Amazing. Be warned their a fairly decent size so two was pretty okay with me <br><br>10/10 will return!!", "pics": null}}, {"review": {"des": "Big Star used to be one of my favorite stops in Chicago. The last couple of visits had the same problem -- good food, affected service, and a general \"better than you\" vibe, and as if seating is highly curated to avoid uncool parties being near the front. Still, was looking forward to another try.<br><br>Unfortunately, they have somehow decided to implement an absurd policy that they check IDs to enter the restaurant. To eat dinner you're required to show IDs, and when I had forgotten mine at the hotel after a long day of traveling, the bouncer ignorantly refused my girlfriend and I entry. <br><br>We're both obviously over 35, and this guy was an egotistical doorman, not the police, so he could have used his discretion. This is also to eat dinner at 8PM on a Wednesday. <br><br>Management needs to fix this policy and work on customer service.", "pics": null}}, {"review": {"des": "I've had Big Star catering a few times, but this was my first time dining in. I've always enjoyed building my own tacos from those catering events, so I was a little bummed that you order pre-established tacos from a tiny menu (only 9 taco options??). We came around 1:30pm on a Saturday and it was busy, but we were able to get seated right away - obviously if you have more flexibility about where you sit you'll be seated sooner (most people want to sit outside or in the in-between patio area). <br><br>Server was nice but at times it was hard to wave him down because he was covering tables that was in another section. Tacos were as delicious as I expected (though it would be nicer if I can customize my own!) but I don't think the prices are justified. The tacos were small and while they tasted great, they were hardly filling. Previous reviews about this being hipster central aren't kidding...I'm assuming this is the reason why prices are so inflated. There are many more authentic and much cheaper taco joints in Chicago. This was a nice experience but I would rather support local, more authentic establishments next time.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Qkim94LKQKVfB7mEEaAnwQ/168s.jpg", "caption": "Alcohol menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rhAD8bYSFzRpgXvQocTrPg/168s.jpg", "caption": "Taco menu"}]}}, {"review": {"des": "So we arrived, lots of people having fun, decent vibe.  The hostess told us there were 43 parties ahead of us waiting for tables.  I'd say the tables were maybe 70% taken inside and about 25% taken outside.  I gave them my number anyways and we circled around the giant bar once to see if we could find 2 seats and we got lucky.  <br><br>We sat down and we were greeted by one of the staff after about 10 mins.  She was clearly having a bad day, no smile, looked like she hated her life.  We ended up ordering a pitcher of Margarita that we were excited about at first.  The menu reads as some type of Blanco tequila, something else, some orange liquor, and lime.  We ordered one glass salted and one without, perhaps she didn't hear, got 2 glasses without, no garnish.  No big deal easy fix.  I was more worried when I saw the margarita being poured out of a tap but thought, it can't be terrible if this is a featured drink and for $40 plus tax and tip I'm sure they know how to make a decent one.  <br><br>The margarita was sour and bitter.  There may have been the ingredients stated in there somewhere but all I could taste was lemon.  By definition margaritas should be shaken to mix and blend the flavors together, that is bar 101.  I would highly recommend they remove this item from their menu or figure out how to make it right, it is not that hard.  <br><br>When we talked to the angry bartender about the issue she said, oh I'll add some simple syrup to it and then she walked away for about 5 mins and proceeded to help other people.  When she came back I told her that wasn't going to work and that I felt bad sending a whole pitcher back.  She then grabbed a glass and sampled it herself and said that's the way it tastes and just stared at us blankly.  I think she was hoping I would just say whatever but I'm not spending $50 on something I can't enjoy.  She eventually agreed to remove it from our tab and told us we could order something else and then walked away again, didn't take our order and started helping someone else again.  <br><br>When she returned we were half way through our tacos, which were decent, and I ordered a Manhattan.  I would say the tacos were very small portions for $4-5 each but tasty.  They should seriously send their kitchen staff on a field trip to Velvet taco and see what they doing wrong.<br><br>While we were hanging out at the bar, there was a stange malaise to the staff, they did not seemed rushed to help the dozens of people who waited I would guess an average of 10 to 20 mins to get a drink.  One guy stood next to us and got frustrated because he could not get served and he finally flagged someone down and it turned out to be a barback and he was told he couldn't be served again.  <br><br>My first Manhattan was excellent.  I made the mistake of ordering my second from a different bartender and something went terribly wrong.  When we checked out they told me that the first was a classic and the second was the \"house special\".   This place could get a lot better with a little effort and attention to detail.", "pics": null}}, {"review": {"des": "So happy I finally got to check out the famous Big Star! <br><br>On a warm Sunday afternoon it seemed very busy, but we only had to wait around ~15 minutes so the wait was not bad at all. <br><br>We got a pitcher of the margaritas which were pretty good for classic and on the rocks. I'm usually not a fan of classic or on the rocks but this was good. I wish they had flavor options like mango or strawberry, but they don't. You can only choose from Mezcal (smokier tequila) or the spicy version (they mix chillies into your drink). <br><br>The chips and salsa were good. I'd say the quality of the chips were better than the salsa they give you. You get two tiny bowls of regular salsa and salsa verde. Definitely not enough for all the chips you get. <br><br>I got the beer battered fish and carne asada taco. The fish taco was AMAZING! The carne asada was good, but I've had better at the taco joint and other places. <br><br>The atmosphere is what makes this place so nice. Even if you sit inside you get some sunlight from the roof window so it doesn't feel like you're sitting indoors. <br><br>I wouldn't come here when I'm starving though because I'd probably eat way too many tacos and spend too much. One taco is about ~$4. Some are  a little more, some a little less. They are tiny though. <br><br>I'd definitely come here again.  My cousin from Houston said the tacos here are better than anything he has had there at a similar spot.", "pics": null}}, {"review": {"des": "I really wanted to love this place. I love food, and I love tacos even more, but unfortunately this place was a huge turn off.<br>  <br>A group of friends came here for my friend's birthday.  It was supposed to be a good time, a fun celebration, a day to honor a special occasion.  We all expected a long wait as this place gets packed on the weekends (not sure why looking back in hindsight), but we weren't expecting the poor treatment.<br><br>We got through the door just fine, and there were a few seats open at the bar.  We of course grabbed them and started ordering away since we are efficient people. The bartender who took our order seemed less than pleased to take our orders--she even went as far as denying service to one of our group members...not sure why. Just because we put all of our orders at once, I understand that it could be overwhelming, but the cold attitude was uncalled for. We put in a few food items that turned out to be mediocre and left us longing for more, so eventually we took our business to Big & Little's down the street and were much happier there with great food and proper treatment. <br><br>Will not be coming back here. Rude staff. Bad food.", "pics": null}}, {"review": {"des": "Management sucks and not in a good way.  Two faced staff.  Below par service.  Wait an hour for a table.  Why?  To sit on their concrete jungle<br>  So over their half assed tacos and guac.  If it wasn't for the location and thirsty hipsters that don't care care where there money goes no one would GAS about the food or so called craft margs", "pics": null}}, {"review": {"des": "I've been twice to the Wicker Park location, once for dining in and once for carry out.  Both times I had great tacos, great service, and great information on allergens.  <br><br>Highly recommended for anyone looking for gluten free/Celiac safe tacos.  I've had Chips & Guac, Potato, Pastor (favorite), and Carne Asada.  The Potato taco definitely has a kick!<br><br>Nice patio atmosphere that's perfect for the summer!", "pics": null}}, {"review": {"des": "I would say this is a 3.5. I just think it's overrated for what it is. Is it yummy? Yes. Is it a great patio? Yes. But does it blow my mind? No. Is it worth waiting 90-120 min? Hell no. The service and food is a 3-4/5 but I really don't get why people wait forever when wicker and bucktown have so many great options! <br>However, I will say that I loved the custom drink they made me when I said I wanted low sugar but still a good buzz: watermelon mint agua fresca plus spicy tequila - try it! Thanks bar staff!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rmNe8ISRrTOEvli4h4WwHw/168s.jpg", "caption": "Watermelon mint agua fresca plus spicy tequila - so good! Low in sugar but high in buzz"}]}}, {"review": {"des": "Meh. While the restaurant looked inviting (especially the outdoor terrace) the food was underwhelming. I ordered an al pastor and a fish taco.  The tacos weren't horrible but they weren't memorable either. The fish was okay and the al pastor was cold. It felt like someone just threw these together without much thought. The flavors were uninspired and I walked away wishing I went somewhere else for dinner.", "pics": null}}, {"review": {"des": "A very nice place to lounge in the sun on a nice day in Chicago but if you really like Mexican food this isn't the spot for you. <br><br>Tacos didn't quite hit it for me. El Pastor was the only one I liked. Chips and salsa are ok as well as their salads but the queso wasn't that flavorful. <br><br>Lots of reviews about happy hour which is confusing because they don't have happy hour! No specials or deals during a certain window of time.", "pics": null}}, {"review": {"des": "Service could be a lot better. Waiter seemed annoyed when I was asking questions about the place. We decided to get to go instead. Tacos were actually good, but the service knocked it down two spots for my experience.", "pics": null}}, {"review": {"des": "I cannot believe I have not reviewed this place considering how many times I have gone here...  This was one of the first taco restaurants in Chicago that I actually enjoyed. Granted they are not the best tacos in Chicago they hit the spot without having to head down to Pilsen. <br><br>Beyond just their tacos, I also really enjoy their queso and their salad. When I would order to-go I would tend to get the salad and add one of the taco meats.<br><br>They added a take-out area a few years back which helps when you just want tacos and don't want to deal with the wait.  It's a great place to go with all small group, especially in the spring/Summer when the outdoor seating is also available.", "pics": null}}, {"review": {"des": "not bad..<br>Food was great but our waitress had the worst attitude.<br> understand bad day but sheshh..", "pics": null}}, {"review": {"des": "Okay. I get the hype. Fantastic outdoor patio. Firetrucking good tacos on the cheap. AND THEY PLAY KICKASS music <br><br>Win win win. <br><br>Of course, the patio was beyond packed, full of people (young bold and beautiful people) so I made a beeline to the bar are even though it was an amazing 85 degree at 8:30 on a Wednesday night in September. BUT the bar area was just as packed. I wasn't to be denied however, after scanning the space I found what I was looking for... a space to belly up to at the bar. I popped a squat and was actually acknowledged and greeted within a minute (which was amazing as to how busy they were ... perhaps they knew they had a Royalty amongst them? We will never know.) <br><br>With an ice cold Tecate in hand, c'mon now don't judge they were popping and I was thirsty, I had a chance to view the menu. Tidbit here - it is dark in the bar, I was tempted to use my phone as a flashlight but thankfully I had already scooped out the menu prior.  I ordered 2 tacos (fish and steak) and chips and guacamole .... warm chips, hints of lime salt and a decent guac! Tacos showed up almost instantly. Boy howdy... yum yum. <br><br>I sat at the bar, sipping on Tecate watching the buzz going on around me while a Ramones album played loudly on the speakers. I thought I was in a food coma, but nope. Wide awake with a full belly and a beer in my hand. The bartenders were great! Attentive and friendly, no attitude at all. <br><br>When it was time to call it a night, the bartender offered to package up my chips and salsa, which I thought was pretty damn cool. She took the time to ask about me and my experience, she was laughing at me earlier as I was going to get another beer but then decided to be the mature grown up that I was pretending to be and head home at an appropriate time for someone who has an early morning meeting.... she saw the devil on my shoulder and applauded my willpower <br><br>Damnit next time I am going with the devil and ordering another round of beers and TACOS!<br><br>Recap- busy and packed - be cool and sit at the bar for fantastic service.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vxRQUzuhxZPnIQMlKk49yQ/348s.jpg", "caption": "Full of Chicagos pretty youngish people."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GRSoWZCZ5vvr0qigBt08Mw/168s.jpg", "caption": "Patio from the taco window"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/t07u2GsX3RUtK9HpU7p6uQ/168s.jpg", "caption": "Get in my belly you devilish avacados"}]}}, {"review": {"des": "Some of my co workers recommended this for some great Tacos. The food came out so rapidly. Loved the patio look! The food was beyond delicious.", "pics": null}}, {"review": {"des": "The tacos were delicious. However, were they authentic? Not really. Were they well priced? Definitely not. These tacos are $4 a piece!!! Every taco lover knows they can get real authentic tacos for $2 or less at a Mexican restaurant. Also, these tacos are not filling!!! I got 2 tacos because usually 2 tacos at an authentic restaurant fills me up. However, these tacos are not generous in terms of serving size. <br><br>Will I come back? Yeah. They were pretty good though.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cin2JvcxkVfVsPXA6r4PiQ/348s.jpg", "caption": "Fish and pork belly"}]}}, {"review": {"des": "I ate (read: devoured) exactly one taco and it was one of the best I've ever eaten. And I live in Los Angeles, the taco capital of America. Thank you. Have a great day.", "pics": null}}, {"review": {"des": "Great place for a quick stop, or for a long hang out. Great tacos and fabulous bar. Service is outstanding. Price is reasonable and location is great. <br>Highly recommend!", "pics": null}}, {"review": {"des": "Big star makes me see stars every time I dine there. Is it the margaritas or the tacos??? God only knows (PS it's the margaritas) but I don't ask questions, I only provide answers. <br><br>The queso fundido is a taste bud orgasm and the walking taco reminds me of the time my grandparents brought me to Tijuana (yes that really happened and yes, I did take a photo with a donkey spray painted as a zebra). Though it was Tijuana, it was my first foray with authentic street tacos as well as a bag of Fritos filled with beans and cheese. <br><br>All in all, the tacos are so good and remind me of when I lived in Tucson during college. The wait can be long, but the experience is well worth it. <br><br>Pro Tip - come and put your name down in advance on a nice summer day, you can come back 2 hours later and enjoy.", "pics": null}}, {"review": {"des": "Good ambience and vibes. Their walking tacos are just awesome, couldn't stop eating them.<br><br>Margaritas was nice. The only downside is the wait time on a weekend, but surely must visit if you're visiting Chicago.", "pics": null}}, {"review": {"des": "We had such a great experience at Big Star! The location as loud on a Saturday night, to be expected, but the food was awesome. I loved how inventive they were with some of their veg options. <br><br>Parking is always a hit or miss in the area, but no biggie, you're in Chicago. <br><br>I also thought the marg's were some of the best I've had in the area.", "pics": null}}, {"review": {"des": "Great atmosphere. Definitely a scene. <br><br>We sat at the bar. Very crowded for a weekday lunch. <br><br>Gourmet small tapas style tacos. Upscale and somewhat Spicey. <br><br>Lots of millennials yuppies locals us tourists etc. <br><br>Bartender was nice but busy. <br><br>Bathrooms were fine. It reminded me of the village in NYC. also lots of college kids there as well. <br><br>They card everyone.", "pics": null}}, {"review": {"des": "Yes the Tacos are AMAZING. And drinks are also good with reasonable prices. But the service is slow and the whole layout of the place is a bit disorganized.<br><br>I got the El Pastor Taco, chicken, and the Carrott taco. Be brace! Try the carrot! It is awesome when you put their salsa over it. Actually, all the tacos were a bit dry and needed salsa. But, the meat of it was good (see what I did there?!) with lots of flavorful seasoning.<br><br>The way the tables are later out is a bit cramped. It's a good casual setting to meet with a small group, but I wouldn't necessarily say it's a place to take out mom and pop. You definitely feel the younger crowd at this Wicker Park taco shop.<br><br>Only real complain I have though is waiting on our table (over an hour on a Saturday night), and then some considerable waiting for our waitress to bring the check, fill drinks, etc.<br><br>Three stars overall to Big Star.", "pics": null}}, {"review": {"des": "Wow! I was there earlier today and had an awful experience the hostess. It was a party of 5, we were told we needed at least half of the party to get seated... fine, that makes perfect sense. The two of us there went to the bar and had a drink. About 10mins later the other 3 guests arrived so we went back to the front counter and told her we were all there. She was quick to give us this small random table with 4 seats and just wanted to bring another chair when there were plenty of other smaller tables she could've put together for us five. We asked if we could get a different table which she replied  \"yes, give me a min\". We were thinking she would go over to move the 2 tables together and sit us down she just kept sitting other patrons that were coming in. We asked again after a few minutes and she said we had to wait until she had the tables ready. At that point she had sat one other group of 5 people at a bigger table and multiple guests of 2/3 per table. We were just so bummed by her attitude and decided to leave. As many places as there are available in Wicker Park there is no room for this type of poor service. The restaurant was not full by any means so her attitude was completely un called for. We walked elsewhere where they merged 2 tables together in a matter of seconds and sat us down!! It wasn't that hard Big Star!! Needless to say I would not return here and hopefully the staff is trained better.", "pics": null}}, {"review": {"des": "This place is in the best location to eat at before or after a game a Wrigley.  The tacos were amazing and made me want even more after I was done but I was so full.  The flavor combinations make them melt in your mouth good. They do make you drop off your cups if you have any from the game but completely understandable.  I highly recommend checking this place out.", "pics": null}}, {"review": {"des": "This is a favorite lunch spot for my daughter so when I was last visiting, and the sun was shining, we enjoyed a lazy lunch on the outside terrace. Great selection of tacos and as they start at just $3 we ordered quite a few.  To be honest after the huge jug of margarita that we shared I could not tell you how many we devoured. I do remember that the Queso was amazing and so instagram worthy!", "pics": null}}, {"review": {"des": "I was told Big Star was the place to try. Was definitely in the Chicago bucket list, but it was alright. <br><br>The alcohol selection is way bigger, and better than the food selection. I always thought this was a restaurant, and not a bar. The atmosphere is restaurant-like; however, there are very minimum taco selections. The tacos themselves are nothing impressive. <br><br>The atmosphere is pretty fun, and have good vibes. The employees are great, and we're very attentive toward us. <br><br>Our party of 4 was not together from the start, but they gladly seated us regardless-which is nice because some restaurants will not seat you until your whole party arrives. <br><br>It is first come, first serve which doesn't allow reservations, so expect to wait in line when you get there. <br><br>Overall, the food was average. They sell tacos, but nothing special. This place is better to get an appetizer and get some drinks.", "pics": null}}, {"review": {"des": "Meh. I remember loving Bi Star when I first moved to the northside, but it's definitely lost some of its charm for me. I agree with most reviewers that it's over priced, and the food is just meh. Wasn't their guacamole good?! Now it has tons of radishes and not much else. Cocktails are solid, but you can have a great time else where that's not so crowded. Try Tacos and Tequilas down Milwaulkee at Central Park!", "pics": null}}, {"review": {"des": "It breaks my heart to say goodbye to Big Star. I moved to Ohio a week ago and on \"National Taco Day\" I find myself longing for a couple of their tacos. Big Star was always so easy to me. Everyone that tries it loves it! I could stop by there 3 times in one week and still not be tired of it (guilty!). Its open late, its open for brunch, I can sit inside or outside, the service is usually good and quick, and they even take credit cards now! <br><br>Hands down, the fish taco aka the Taco De Pescado is my absolute favorite. The chipotle mayo under the fish and the slaw on top just bring it all together, perfect harmony! While the fish taco will never be replaced, I have explored the menu a bit further. Every now and then I'll get a Walking Taco, the Taco de Papas con Rajas, or the Taco de Zanahorias (all 3 vegetarian options). I would rank the Taco de Papas in second. It's spicy and small so it's nice to throw in the mix every now and then. Overall, you can't go wrong. Big Star is good af. <br><br>Oh! I also love their chips and guac!  You can really taste the lime and the radish on top adds a wonderful crunch. I've even started adding radish when I make guac at home (thanks for the inspiration). <br><br>If you ever decide to expand..Columbus, Ohio is a pretty sweet city. We'll take you with open arms! If that idea doesn't work out, whenever I get a chance to come visit Chi town, you bet I'll stop by. If not once but twice...ok maybe 3 times. Until then...", "pics": null}}, {"review": {"des": "I think there was about a 20-30 min wait. Towards the end of our wait we requested more seats to be added and it didn't change our wait time. While we waited at the bar, we started with a pitcher of the original Margarita. It was strong but tasty. Between 3 girls, we got at least 2 cups each. <br><br>I got 5 tacos... they were all delicious. My favorite was the Tostada de Hongos and Taco al Pastor. I highly recommend the Tostada. So good! I'm partial to mushrooms so that might be why, but they stacked that little tostada with a lot. I also tried the Taco de Zanahorias (carrots). The carrots gave it a sweet taste. It was interesting, but I probably wouldn't be ordering it again. You can't go wrong with al Pastor.<br><br>The server was able to easily split our checks on the little iPad. I wrote down the items each person ordered or was paying for, and he really appreciated it. It made the process go faster.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4GEvpgXdsI5okzdyStijHQ/348s.jpg", "caption": "Pitcher of margarita after a 3 cups pour"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fYzvCq1jJpIwTbLFfPmjDw/168s.jpg", "caption": "Taco de Zanahorias"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/B8GWSA77jXiYMXQJkTNycg/168s.jpg", "caption": "Tostada de Hongos"}]}}, {"review": {"des": "Not sure why the reviews for this place aren't higher! I love Big Star and I feel like it's one of those places that's a must-go for tacos in the city! The inside is super hip and fits right in with the Wicker Park neighborhood. They also have a whole outdoor patio and and a to-go window so you can get tacos to-go. The place has always been very crowded when I go no matter what time of the day it is so be prepared to wait a bit. Or you can go get their tacos to-go if you don't want to wait which is what I've done before.<br>The menu is small but I think when it comes to tacos, less is more. The tacos were tasty and 2 or 3 are enough to fill me up The guac tasted freshly made and had a great amount of flavor. Their drinks are strong as well which makes for a great meal. A must-try place for sure in Wicker.", "pics": null}}, {"review": {"des": "This place is always poppin! They don't take reservations so it is almost a guarantee you will have to wait during busy hours. I think I waited 30-40 minutes for a table for 4 people. ID's are checked even if you aren't planning on drinking. The menu is quite small but the main event are the tacos. They had a couple to choose from. I decided to go with the fish and chicken taco. The fish taco was sooooo good. The chicken taco was pretty good as well. Each taco is around 3-4 dollars. Pretty expensive for small tacos but they are gourmet ones. I got a pitcher of margaritas and it was so strong. I could smell it instantly. Only negative is that they couldn't put sugar on my glass rim because they didn't have sugar??? What kind of restaurant doesn't have sugar for their drinks...Also the play is so busy that the service is kind of slow. It took awhile to get our check. Overall, this is a really cool joint to eat and drink at. I'd definitely recommend it if you are in the wicker park area", "pics": null}}, {"review": {"des": "Mediocre food (for Chicago), tasty but weak drinks, can be difficult to get a seat, not really priced well, but popular anyway. <br>I've given them quite a few tries too, and will probably continue going back since the patio seats are nice and we're hopping around the area.", "pics": null}}, {"review": {"des": "I've only ever been to the taco window - so I can't speak for the sit down restaurant but I absolutely love the tacos I get at the window. They are cheap and packed full of flavor. The fish is my favorite. We always take visitors here because it's just so good. Definitely check it out if you're in Wicker, I think it's much better than Antique Taco up the street.", "pics": null}}, {"review": {"des": "Have always loved Big Star until tonight- ordered two fish tacos through Door Dash and found multiple hairs in my taco. Sickening. I truly, truly, TRULY don't understand how hair can get into food unless a kitchen is completely unsanitary. I expected more from such a reputable place. Gross.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3ILcTwNnfzFeozDfA4CL7A/348s.jpg", "caption": "Hugs hairs in my fish taco!"}]}}, {"review": {"des": "5 stars for the food, but 2 stars for the staff.<br><br>The food is amazing, hands down. We've been here multiple times and ate our way through the menu, top to bottom, back and forth and it's consistently great. My personal favorite is the fish taco, it's sooooo good, and they serve a big chunk of fish!<br><br>However, the staff seems the be constantly in a weird mood. Maybe I'm just having bad luck, but every time we've been here we had a strange encounter. The last time around, our waitress  would simply not show up. We would have to ask other waiters if they could take our order, or if they could bring us the check. They would then tell our waitress who was just casually hanging out at the bar making goggly eyes to another waiter. But clearly not doing her job. Another time someone mentioned that the tacos come with cilantro and I should order them that way, and not have it removed. What an odd thing to say: half the tacos come with cilantro and you can't expect everyone to like it. I also don't think that cilantro will be the game changer of the dish: either the taco is good, or it's not. But if you add cilantro to my taco then it will be a bad taco for me, guaranteed.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XDc9zgHm2E5vOKjmmRwc0w/168s.jpg", "caption": "Plate of tacos: fish tacos, potato tacos"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/s-CMFLIgFKVGZ-1k-nuJ5w/168s.jpg", "caption": "Mushroom tostada"}]}}, {"review": {"des": "The tacos are good.  They have Mexican coke.  The bar is fun but really not worth waiting for.  I understand that people come from all over to<br>enjoy their patio but I'm against waiting outside a business before you can spend money inside.  Get window service if the wait is long and enjoy your night without waiting outside like a loser.", "pics": null}}, {"review": {"des": "Oh, Big Star, you are definitely a FIVE star! We were recommended to come here for amazing tacos by locals that we met during the solar eclipse event. This was by far one of the best recommendations! Visiting from New York, we always get a variety of food, but Big Star is something else. It is a family style taco spot where you can choose any of their unique tacos. We ended up getting the following tacos:<br><br>- Taco De Panza- this wasn't a bad combo, braised pork belly with tomato guajillo sauce.<br>- Taco Al Pastor- the grilled pineapple goes well with the marinated roasted pork shoulder.<br>- Taco De Pescado- Delicious beer battered tilapia fillet. You can taste every inch of crispiness! We got three rounds of this!<br>- Taco De Chorizo Discada- my husband said this was his least favorite.<br>- Taco Alambre De Res- grilled steak- how could you go wrong? so gooood!<br><br>My husband also ordered a beer (lone star) and a drink. I can't remember the names of either or, but he absolutely loved both! <br><br>Overall, great and friendly staff and the food is banging! There's no doubt we will be back!<br><br>Note: they check ID when you enter the premises. Have them out ready! The guy was nice enough to let me in since I didn't have mine.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SkizwIlBF8CqdVnbDhLoXg/348s.jpg", "caption": "Tacos on tacos"}]}}, {"review": {"des": "Why? Why do sooo many people love this place!? This was my second experience. The first was mediocre, at best, and this second time was terrible!!<br><br>Admittedly, it was a Saturday night so they were packed. We were prepared to go somewhere else if the wait was atrocious. The host said 25 minutes. We could handle that. No big deal. Went in for a drink. Battled for two stools in a corner. A good server came to check on us. We should have just stuck with her all night!!! We waited. And waited and waited. An hour and 15 minutes later! I went back to the host stand. The new host said we were next. Bullshit. I worked in the service industry for years. That's code for, \"we lost you or forgot about you.\"  Ugh!  But sure as shit, they seated us 3 minutes later.<br><br>Finally at the table and STARVING!  Our server checks on our drinks (full) and brings salsa. No chips. That isn't a thing here. And no one wants spoonfuls of salsa. Let's be real. FINALLY flag her down and order three tacos each. By the time they arrived, it was close to three hours from the time we walked up to the host stand. THREE HOURS FOR THREE TACOS!!! And they're just okay tacos. I had the pastor, papas, and fish. Papas were not good. The pastor was nothing special. The fish was really good. We had planned to go out after but were so exhausted by the taco-waiting that we gave up and went home. <br><br>Big Star=Big Disappointment", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EcNfudsRzoPvGRsBHBWWpQ/348s.jpg", "caption": "A fish, a pig, and some potatoes walk into a bar and wait 15 years to be eaten by some vodka-enthused Chicagoan."}]}}, {"review": {"des": "I was super excited for tacos and drinks here when I was told it was the spot to go to. Unfortunately, I was also told after our visit that it is a hit or a miss. We went on the day it was a miss. <br><br>There's two kinds of seating - outdoor where you can let the host know of your number if party and at the bar where you can grab a spot at or around back. If you're wth a small group, getting a seat at the bar is definitely recommended since the wait could be super long. We didn't know we were able to order food out back until someone asked us if we ordered tacos. Win win! <br><br>Tacos are a good size and super affordable, but it just didn't hit the spot. We ordered a variety of choices but the only one that tickled my fancy was the fish. Probably should have got another one of those. Hopefully you go on a day that is on point!", "pics": null}}, {"review": {"des": "Loved the atmosphere of this restaurant. Me and my sister webt there to get a couple of drinks and didn't eat anything so I can't comment on the food. <br>Some of the drinks we really liked, some others we didn't but I wonder if it was just a matter if taste. I got the Paloma and lived it. <br>Also, the Margarita pitchers are a really good deal. They are like $36 and are oretty big (definitely fills out more than 5 margarita cups)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/s7cXUcWMXUU7SjTK9MJDUA/348s.jpg", "caption": "Paloma"}]}}, {"review": {"des": "This place was really crowded (as usual), went here on a Friday night, group of 5. They told us the wait was gonna be 1h, ended up been 2h which I mean is fine that you do not know exactly how long is it gonna take, I get it but really?. I mean it's not even a close guess but it's was \"ok\" 1st I was not the one starving and 2nd we got a spot on the bar and had a couple beers with chips and stuff.<br><br>Now when we finally got our table, the food... it's was good, ordered some tacos by far the best ones were the \"al pastor\", could have eaten a bunch of those to be honest. <br><br>So definitely you'll get good food here if you're willing to wait (or maybe just go during random hours and not the busiest one).", "pics": null}}, {"review": {"des": "Oh big star. Sometimes you are super fun. And you know, have great tacos. But today , alas, the blondish girl bartender was in a dark place I think. Dark , dark , dark , dark place.  She absolutely would not look our way as much as we shouted. And hey, we shouted. Just to order food . So let it be known, the service , kinda erratic. I know it can stink being on the other side of the bar, but don't agree to it then, ok?  Ok. So consider yourself warned and stuff.<br><br>Ok we went back and Blerg. Ceviche special had no lime and was raw. The waitress got our order wrong - gave us chicken tacos when we ordered fish. The sound, whoa, was really bad. Speakers were terrible. Are they new? Cuz sheesh , they stink. Very muddled sound, caustic and unnerving. Not sure what happened here. Sorry big star. Frowny face.", "pics": null}}, {"review": {"des": "I finally tried out this Chicago staple the other day, I went on a Sunday night at like 10 and it was still packed, had to sit at the bar. I got the chips and guac, and 3 tacos-steak, fish and carintas I believe. Everything I got was very good. I also had 2 Mexican beers, but they also have the standard craft beer selection. Service was pretty fast despite the crowds. Everything was good for sure, I don't know if it's necessarily worthy of the famed status it gets, as evidenced by a packed house on a Sunday night. It's also not cheap, my final bill crept on me and ended up being close to $40, and the tacos aren't that big, but I got a lot of chips and guac though. So if you're in the area, it's worth checking out just to say you went there, and provided the line isn't too long.", "pics": null}}, {"review": {"des": "OMG worst place period !!! This most likely is money laundering ! Impossible to have such a bad service + this awful food and think you can be a business something must be shady - <br><br>Never come to this place ! Trust me ! You will do better at taco inn !", "pics": null}}, {"review": {"des": "Ambiance: super causal, has outdoor seating and outdoor walk up window! <br><br>Service: staff were all friendly and super fast service! <br><br>Food: these tacos are the best I've ever had! I came here to try since I saw it on the food network. I like that the menu is small and simple not overwhelming. I had tacos alambres de res and they were bomb!! I had ordered one and a tostada de hongos, wasn't too crazy about the tostada too much mushrooms. My cousin ordered a taco de pollo and she did enjoy it but preferred the res. Overall, I highly recommend this place for tacos! Quality tacos, fresh ingredients!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/E2lIrm2VoxlzbioptVWN5g/168s.jpg", "caption": "Chips and guacamole"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/D-bdr87ek8MEZfzb02qPFg/168s.jpg", "caption": "Taco alambre de res and Taco de pollo"}]}}, {"review": {"des": "Big Star is such a well known Wicker Park staple that I've passed by countless times when I've been in the area.  It was great to check this place out the other night with a couple of my friends for a taco dinner.  <br><br>Positives from my experience:<br>-The traditional lime margarita was perfect in every way. It tastes really natural and not overly sweet.  <br>-The guac was super fresh, and I loved both of the spicy salsas that were served with the chips.  <br>-The large outdoor seating area is ideal for the warmer months.  <br>-The fish taco was my favorite taco out of the three different ones I tried.      <br>-The service was really fast (considering how busy it was).  The tacos came out about 5 minutes after ordering.  <br><br>The one negative thing from my experience:<br>-I really wish they would add some black beans or rice to the menu as a side.   A taco dinner doesn't feel complete to me without one or both of those sides.", "pics": null}}, {"review": {"des": "If you want to eat here, plan to swing by maybe 30min before you get hungry.  I don't mean that in a bad way, just practical.  The line is always long but they do a nice job to keep it moving and I love any place that will text you with a warning when your table is ready.  So you can walk around or grab a drink somewhere while you wait.<br><br>We started with the classic marg pitcher.  It was made with fresh juice and no concentrated sugary mixer.  Great flavor and strooong.  We split one between the four of us and it was plenty.  Split the salsa and guac as an app.  One nice verde and another smokey chipotle.  The guac was fresh and fluffy, we all really enjoyed it.<br><br>I got the fish taco and the beef.  My friends tried the chicken and tostada.  We all agreed the prices were right on point for the size and quality.  For so many diners at a time, the food came out in a really timely rate.<br><br>The staff was super attentive and nice.  Very laid back vibes.  Dog friendly is also a plus!  My husband would also kill me if I didn't mention that he was super stoked to see Pappy Van Winkle on their bar list.  A rare fine, and priced appropriately (even if I think he's NUTS to consider spending that much on a single pour)", "pics": null}}, {"review": {"des": "Meh. So much hype and so much disappointment. <br><br>The first turn off for this place? The service was rude. Like, beyond rude from the moment we walked up and asked for a table. When we were seated, the waiter seemed bothered by me asking for a second menu when there was only one at our table. And both menus were covered in something sticky. Gross? When I asked for recommendations, stating it was our first time there, the guy said \"uh we have tacos, I don't know.\" Cool. My boyfriend also noticed a Spanish misspelling in their menu. Really, we should have left then!<br><br>But I continued to be optimistic, always my pitfall. I ordered three different tacos that looked the best, and my boyfriend ordered a fourth. He also ordered a horchata, and when it came it was super grainy and bitter. When the tacos came, they weren't much better. The tortillas were sad and store-bought, and the fillings didn't have a lot of flavor. They were small and for $3.50 to $4 each, they were a bit of a let-down. I love potato tacos in almost any way shape or form, but these were soo oily and gross.<br><br>I came in hopes of some great tacos and left wondering why this place is so popular! The restaurant was packed, but between the rude service and average-at-best food, I'll get my taco fix elsewhere.", "pics": null}}, {"review": {"des": "I had a handful of people recommend Big Star to me, so I stopped here to kill some time for lunch on a rainy Friday afternoon. I could not believe how packed it was! The bartender spotted me immediately and poured me a water, handing me a menu. I chose a beer and asked for advice on the tacos. I asked her what the most popular tacos were and ended up ordering a Taco de Zanahorias and a Taco de Pescado. I also got some chips & salsa, which were standard. The carrot taco was above and beyond one of the best tacos I've ever eaten.<br><br>The location was cute and eye-catching, but it was PACKED and overwhelming. I would have liked to sit outside if the day was nicer so I had more space for myself.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/g0Zt9Xj3BR_m0CIdo2_jVg/348s.jpg", "caption": "Pescado and Zanahoria tacos"}]}}, {"review": {"des": "OMG.<br>Love love love. Sad I left without buying one of their rad totes.<br>Overall, 5 stars.<br>Went there 3x in a week, consecutive nights.<br>Thursday, def hard to find a table/seat. However, my favorite $3 tequila shots.<br>Check the chalk board ---<br>Their chips, WO.W. Wish they had better salsa, like authentic Mexican or Central American. They should consult my Tios and Tias who work in their kitchen. <br><br>Friday and Saturday less packed, oddly?<br>But still had great $3 shots, and customer service was quick and easy. Can't wait to go back!", "pics": null}}, {"review": {"des": "We were staying in the Loop but had friends up North that wanted us to join - so that we did! In fairness, we arrived at 12:30 and didn't order food, so my review is based on a few drinks and service only.<br><br>Though - I'll note that one of our friends ordered a steak taco and received something completely different...turns out steak tacos aren't on the menu and they just gave him something else. I found that completely odd!<br><br>Margaritas were delicious, and the bourbon & whiskey selection was on point. I can see this being a fun spot, specifically in the summer, for some margaritas and tacos! Just no steak...", "pics": null}}, {"review": {"des": "Have I not written about Big Star before? Browsing my reviews, I can see that I've been remiss. What a joint! Loud, crowded and long waits are the norm for all the hot spots in the Windy City, but Chicagoans know good food, so trust their judgment. <br><br>Do not come here on a first date or even with someone you're trying to get to know better. You won't be able to hear anything unless you can snag a patio table in the warmer months. Forget the conversation anyway, because they're spinning some superb tunes in this rehabbed gas station.<br><br>Tacos are tops. Pork belly is a personal favorite, al pastor a close second...but try a bunch. Always fun to go with at least three other people so you can all sample a few. Of course, you'll have guacamole, but make sure you do not skip the queso fundido. Your best bet is to show up very, very hungry and try as many options as you can. Pace yourself on the margaritas, they are potent! I always seem to forget how strong they are until it's too late. <br><br>Big Star is a must for foodies both local and tourist.", "pics": null}}, {"review": {"des": "Short story: overrated, ok tacos, good whiskey specials. <br><br>It's a good bet if you say Wicker Park people have been to Big Star. The place is huge with a take out window, summer patio, and bustling inside. Great atmosphere. Great service. <br>Good for the well paid button up employee who wants to get down with the hipster lifestyle and doesn't have time to search for another taco place. <br><br>But beyond the whiskey shot specials for around 3$ the tacos are FAR from worth it. In order to get a decent taco you'll have to pay around $4 for a pork belly taco that's great for about two bites. So don't come if you actually want to be full and leave with enough money to drink. They have vegetarian options but that basically means a shell filled with over spiced carrots.", "pics": null}}, {"review": {"des": "Oh, taco lovers, we are not worthy! This place is a shining gem in hip and happening Wicker Park. The tacos are $3-5 each and all of them are glorious. I highly recommend the fish tacos but, honestly, all of them are a safe bet. Also, the margarita is well worth it! The complimentary (bottomless) chips are warm and salty, with great salsas. The ambiance inside the restaurant or out on the patio space is terrific. However, there is almost always a wait--but it does tend to move quickly despite how daunting the list of reservations may seem. If you don't have any time to wait, just order tacos from the carry-out window. It's the exact same menu and you'll get served a lot faster.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bss0VykzRVtoaFa6MXpCQg/348s.jpg", "caption": "Chips and Salsa--neverending & complimentary!"}]}}, {"review": {"des": "The toppings or content of the tacos are flavorful. The size of the tortillas is small. There should be bigger tortillas. In the past I've gone with the tacos and perhaps I need to explore more of the menu. The aesthetic is neat they play records and it's genuinely a cool place. It makes me wonder though does the business see itself as a restaurant with a bar or a bar that has a good menu?", "pics": null}}, {"review": {"des": "Perfect spot for a fun margarita night. I went with 3 friends and we split a pitcher margs. SO GOOD. I was really impressed with the veggie options at a taco place. I got the tofu taco (vegan) which had a great texture and a ton of spicy flavor. I also got some sort of taco that came in a frito bag. Not at food as the vegan one and I probably wouldn't get it again. The guacamole and queso were also great. One order Of queso is  big enough to split BW 3-4 people, but the guacamole runs out pretty quick!<br><br>The environment is also a blast. The wicker park patio is a must!", "pics": null}}, {"review": {"des": "Whenever I'm having a bad day, I [figuratively] go to my happy place: Big Star. The fish taco is the best taco I've eaten. They lay a huge piece of crispy, juicy fish on a corn tortilla and drizzle spicy mayo all over it. It's so good that I come back to Big Star at least twice every trip to Chicago. I've tried all permutations of the house margarita and it's a close tie but the spicy is my favorite. They're table hot sauce is also bomb so I douse everything in it (noteably the chips and guac). <br> <br>Big Star has two locations - Wrigley and Wicker Park. I've been to Wicker Park which gets crowded at night, so expect a wait (but don't get impatient, it's worth it). The atmosphere is fun and boisterous, ideal for a bite/drinks before or after going out.", "pics": null}}, {"review": {"des": "Big Star was the most recommended place for dinner when I asked around, and for good reason. Came here at primetime on a Friday night, so we expected a long wait- the patio was PACKED. We were told that they don't/can't estimate wait time, which to me was really odd, but I guess they just don't want to be wrong. Luckily, they tell you that you can walk around and they'll text you when ready so you can work your way back, which is exactly what we did. After about an hour, we were seated in the super crowded patio (if you hate people, you won't like it here because you're in pretty close quarters). Regardless of the wait time or how crowded it is, a place like this is always going to be awesome because they have a limited menu, which means they're constantly pumping out all of the food. So once you order, you get your food lightning fast! As with any good mexican food, we started with the chips, salsa, and guac. They bring out multiple salsas which is always a crowd pleasure, and the guac was stellar! I ordered one of each taco to try them all, and I seriously was not disappointed in any of them! I thought the Chorizo would be my favorite, but the chicken ended up topping my list (which I wasn't expecting, because chicken tacos are usually kind of boring). They definitely don't skimp on the fillings, either. I have a rather large appetite, but I left here full on chips & tacos.<br><br>And let me just add that this place is dog-friendly, which always makes me happy. We were actually seated next to a really friendly, awesome dog, which made my experience that much better. If you hate dogs, you can ask not to be seated near one, but if you do hate dogs, you're a lunatic.", "pics": null}}, {"review": {"des": "The outdoor section was not open yet when my date and I came here around 530pm on a Thursday or Friday.<br><br>We got very lucky.  It was very busy, but we only had to wait about 5 minutes before being seated.<br><br>This place is not authentic, but for the hipster type of place it is, this place does tacos and margaritas so right!<br><br>We started with chips and salsa and there were 2 salsas, one being green and one being red.  The red one was spicier and I liked it more, although both were great.  The chips taste \"fresh\" and have that nice semi-thick crunch that completely kicks Tostitos butt.<br><br>You might as well just get the margarita pitcher if you have 2 or more in your party.  We ordered the big star margarita pitcher which yields 5 cups so you get a $50 for 40$.  First off, the marg tasted very good and second, these are decently strong.  You start to feel something even after downing 1 cup worth.<br><br>I ended up ordering 6 tacos because I was so hungry.  The al pastor and panza tacos were clear standouts. followed by pescado then pollo, but all of the tacos were so darn good.  There's great flavor especially with the al pastor having pineapple and the slight fattiness of the tacos de panza.  I'm very into authentic tacos, but these were pretty good and the prices were rather fair.  The amount of meat was great.<br><br>The entire experience was great and the atmosphere is so casual, fun, and inviting.<br><br>There's no surprise to me why this place is so popular and I've been told it gets better once the outdoor section is open!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RwAallh1yKv5Y0Ra3fcZSw/348s.jpg", "caption": "2 tacos al pastor, 2 tacos de panza, 1 taco de pescado, 1 taco de pollo"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TEhLK1K12GHH74vKJX1E-w/168s.jpg", "caption": "Big Star margarita pitcher"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NkdsT6fKVbRPTkRzIa1MPg/168s.jpg", "caption": "Chips and salsa"}]}}, {"review": {"des": "This place is always super popular and hella crowded. I came here on Friday at around 8PM with 3 other people when it was 15 degrees outside and was told there would be around a 1 hour wait for a table. We luckily found two seats at the bar but two of us still had to stand. I got a text saying my table was ready when I was on the subway home (about 2.5 hours after I put my name down).<br><br>I ordered a margarita w/ mezcal ($10) which was really good. My boyfriend got the Southern Nights (Rye, Amaretto & tea based drink) which he thought was fruity and really strong. <br><br>I came here one other time before in the summer and had the queso fundido and tacos which were pretty average. The tacos were pretty small and pricey (around $4). I also had a paloma which was subpar compared to the palomas I've had in the past. <br><br>This place seems like a fun place for groups to hang out and drink, especially in the summer when there's outdoor seating. Be prepared to wait long hours for a table but theres plenty of places to explore nearby.", "pics": null}}, {"review": {"des": "I went to Big Star on a late night last week. The door guys were running a muck. One of them threw a \"West Side\" hand sign at me after seeing my ID was from Baltimore - as to challenge the culture of my hometown. How rude, what a mess! I should have taken that as the first sign. The tacos were sub par. I hold Big Star to a higher standard because I once believed them to have the best tacos in Chicago - not anymore. The servers were also lack luster, only reason why they get two stars is because the ambience was OK. They have good lighting and are reasonably clean - other than that I was utterly disappointed", "pics": null}}, {"review": {"des": "Mushroom Tostada is on my Best of Chicago list, for sure.  Pastor tacos are not authentic, but great for what they are.  Yellow Rose Daq is good.  Bartenders are cool.  Queso fundido is never a bad idea.   <br><br>This place is packed in summer.  Pretty chill in winter.  My go to on the way back from O'Hare.  Damen stop off the Blue Line.  Vinyl spinning. Food comes quick.  Drinks are good and not premixed. <br><br>A place this popular doesn't need my review, but I hope other travelers and transplants enjoy my fave dishes.", "pics": null}}, {"review": {"des": "Stopped in on a whim and so glad we did!  Great fun atmosphere, with amazing service!  Food order is instantly placed by your server and arrives within minutes! <br><br>It's mid February so the glass doors are obviously closed but I can't wait for summer when tables and chairs and doors open up to let the summer breezes in! <br><br>Time to eat! Chow!", "pics": null}}, {"review": {"des": "Awesome happy hour spot. Good beer/drinks/margarita menu and ambiance with nice staff. I was slightly disappointed at first going to a tacos place that didn't offer table chips and salsa, but we got an order anyway and the chips are so bomb that it's worth it. I liked that they don't have a preset menu, which almost forces you to try all their delish tacos. I got the Chorizo and Walking (taco in a Fritos bag) tacos and both were superb.", "pics": null}}]}