{"name": "big-and-littles-restaurant-chicago-3", "reviews": [{"review": {"des": "There is a lot of heat in this place during the summer because there is no air conditioning and the kitchen is kept busy no matter what hour we go. We have brought our parents, in-laws, local friends, friends from out of town... You name any social circle and it's likely that we've brought them to BIG & little's if they have not been before. <br><br>Some of our favorite items are:<br>1) Soft shell crab taco<br>2) Soft shell crab po' boy<br>3) Truffle fries<br>4) Portobello burger<br>5) Salmon poke wrap<br>6) Ahi tuna poke wrap<br>7) BIG & little's taco<br>8) Ahi tuna taco<br>9) Zeus burger", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FwY866m1VVPXSFUuKqI5WA/348s.jpg", "caption": "Salmon poke wrap"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NFtKQZEb0HDIs4vnNXaVjA/168s.jpg", "caption": "Ahi tuna poke wrap"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lWt25Gr46SMSpI0HDbIwJg/168s.jpg", "caption": "Soft shell crab sandwiches, Hawaiian burger, salmon poke wrap, ahi tuna poke wrap, and truffle fries"}]}}, {"review": {"des": "I ordered a whole fried softshell crab sandwich and it was meh. The sandwich is light and you will definitely be hungry afterwards. Didn't leave much of an impression. It looks really cool though. Customer service really isn't their thing. Tried looking for a recommendation from the cashier and he wasn't social at all. <br><br>It's cash only but they have an ATM. ATM doesn't tell you the fees and neither did the cashier when asked. I looked at my statement later and saw that I was charged $6 for pulling out money! I wish someone had told me bc there is a corner store that does cash back right across the street.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/weSs4e8YedyZKFz_bY_WEw/348s.jpg", "caption": "Looks fun to eat but you'll be hungry afterwards"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GPoIs9ZIcob0cYZG1smG4g/168s.jpg", "caption": "I'm a fan of Guy Find but not so much this place."}]}}, {"review": {"des": "Have I ever mentioned how much I love this place? Because I do, so so so so much. This place is the best, the food, the people, the everything! I come here and order way too much food. <br><br>Highlights: Samurai, ahi tuna poke (on a bed of lettuce), Mahi taco, Mexican taco, salmon poke, truffle fries... etc. I think you get the point. The food is great. <br><br>If you're in the area, or even if you're not, come by. It's not the most convincing entrance but it's worth it, trust me. <br><br>Insider perk if you've read this far: they have a groupon deal going on now", "pics": null}}, {"review": {"des": "Seems like the price of the foie gras fries keeps creeping up, but still a killer combo.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lM_9c2GJr2URX2CPA0-m0A/348s.jpg", "caption": "The foie gras fries"}]}}, {"review": {"des": "TL;DR- Ugh grossest and most overpriced tacos ever. The fried fish was so small- imagine half a snickers bar. The shrimps were bland. The tortillas are typical rubbery grocery store tortillas. Terrible service. For $14, I could have had an actually filling meal.<br><br>Legit there's a laundry list of why I can't stand this place. <br><br>Let's start with the terrible service. They guy taking the order at the counter was impatient and didn't seem like he wanted me there. I thought it was just his personality... until he was laughing and being super friendly to the two white ladies behind me. (Not trying to play the race card.... but....) whatever.<br><br>The actual food. It was literally just a sea of yellow and brown. <br><br>The tomato slices were from (I assume) beefsteak tomatoes and they were SO MUSHY AND GRAINY. No flavor and just so mealy. The lettuce is literally spoiled looking iceberg. The fish was tiny and not even hot. The inside was also super dry. The shrimp was bland. The bottles of sauce were sticky on the outside and there was dried old sauce inside the nozzle so it wouldn't even come out. <br><br>For $4 (or more) a taco..... I shouldn't leave feeling hungry after ordering 3 tacos. <br><br>Avoid. Go to Taco Bell. Go to jack in the box. Go to a corner taqueria. Avoid this place that rides on the coattails of \"diners, drive ins, and dives.\"", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/il2kzAiBmjwr6vtVNI_EnQ/348s.jpg", "caption": "Not even my food styling skills could have saved this sad excuse for a \"meal\""}]}}, {"review": {"des": "In all fairness I ordered this food delivered, so I'm not going to comment on aspects that didn't travel well (such as the fries), as I'm sure they're much better at the restaurant.<br><br>What did travel well was the raw ahi tuna taco. The tuna was obviously excellent sushi grade, and the large chunks were still cold, and the fried taco shell crisp.<br><br>The other noteworthy item was the deep-fried grilled cheese sandwich. It was essentially fish and chips, except instead of fish there was a grilled cheese sandwich in there. The batter was nice and crisp, but I felt it needed a bit of seasoning, or perhaps the Swiss cheese version (rather than American cheese) is more flavorful.<br><br>The cheeseburger was a bit of a disappointment. It basically tasted exactly like a Big Mac.<br><br>I also sampled the Samurai fish taco, which was an okay combination of fried fish and pickled jalapenos on flour tortillas.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZRu2U0NYaOEhsatwlFP_dw/348s.jpg", "caption": "Deep fried grilled cheese"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WPsLj7jESdpDwaLdG43ImQ/168s.jpg", "caption": "Cheeseburger"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/n09hj7m0c_EZS1kGQeij8A/168s.jpg", "caption": "Samurai taco"}]}}, {"review": {"des": "I seriously wanted to try this place out for some time, and finally l made it there. I left completely full and satisfied! I'm a seafood lover and crab is one of my favorites. The sandwich was shaped like a crab and deep fried, served on a roll with lettuce and their special sauce. I also had truffle fries that paired well with the sandwich. Both were deliciously good. The place is not fancy by any means , which is fine. Whatever they lack in decor, the food makes up for it. It's a fast food joint, with no extra unnecessary wording to describe their menu choices. Straight to the point of what you see is what you get, and that's even better. The locations are not in my neck of the woods, but whenever I'm in the area, l will be sure to pay them another visit.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3cvAtDW6OU5D13KnLPCg3w/348s.jpg", "caption": "The  Soft Shell Crab Sandwich."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/D6gtZGhRcQAgryT2thMU4w/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "LOVE LOVE LOVE!<br><br>If you can get pass the dingy interior you will be okay. No frills at all.  The food is great with option for everyone. Be sure to bring cash they do not take cc which is the one thing I don't like about this place. <br><br>Staff was friendly and give great options if its your first time going. The lady that helped me suggested the soft shell crab sandwich and told me to add this sauce... man ole man so yummy! They have great french fries please order these... A variety of seafood and even serve burgers. <br>Decent prices<br>Healthy portions<br>quick service<br><br>I must warn you if you are watching your weight or trying to eat healthy this aint what you want! Almost everything is fried, dyed and dipped to the side... But hey what other way do you want your seafood right?", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BAnwHrul0lagMYnDe6heUQ/348s.jpg", "caption": "Options for everyone"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1KDwHeLtTkjz1kczECdxFg/168s.jpg", "caption": "Soft shell crab sandwich gets two thumbs up"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/17YTKzyOcmYtYV9IfkkXDA/168s.jpg", "caption": "Shrimp tacos."}]}}, {"review": {"des": "Ok so this spot was on tv....found the manager to be very cool. Very flavorful burgers and the truffle fries are addictive..small spot choose wisely when u go. But you won't be disappointed", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Dmw6uacOs_RFOl7gSdIaOg/348s.jpg", "caption": "Mack diddy no longer on the menu.....I recommend if you have a hearty appetite"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2rdrmacs0mt_r6jce5s8Xg/168s.jpg", "caption": "Cool tables"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zAwBfHW0weN0N5B_Cygldw/168s.jpg", "caption": "Mack diddy...u can order any cheeseburger tho.....great taste"}]}}, {"review": {"des": "The best fish tacos!! Can't wait to go back. I ordered two tacos and a side of fries and worth every bite :)", "pics": null}}, {"review": {"des": "I've heard of this place since I first came to Chicago 3.5 years ago, but have never been. I finally went with one of my friends who raves about how great this place is and always takes his out of town friends here. This is a \"no frills\" type of place.<br><br>We ordered:<br>Cajun Fries ($4)<br>Fried Tilapia Taco ($4)<br>Grilled Shrimp Taco ($4)<br>Spicy Beef Short Rib Taco ($4)<br>Raw Ahi Tuna Taco ($7.50)<br>Egg Cheeseburger ($7)<br><br>ALL OF IT WAS DELICIOUS!!! I loved every bite of every single thing I ate. It was strange though, because on all the tacos that had corn tortillas they came with two tortillas, but one of the tacos only came with one. Was that on purpose or an accident?? (I'm assuming an accident, but it wasn't a super big deal). Apparently the Kimchi fries here are super good, so next time I'll be sure to try those. <br><br>4.5 rounded up because it's good, but damn are the tacos pricey.<br><br>NOTE: CASH ONLY!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9ZAJo5VFLjIxYFuvzU1Ojw/348s.jpg", "caption": "Tacos and Cajun fries"}]}}, {"review": {"des": "Nice place for seafood tacos, especially the raw ahi tuna poke taco.<br><br>If it hadn't been for Diners, Drive-ins, and Dives, I probably would have never stepped foot in here. I think they're going for some kind of seafood shack aesthetic, plus I found it hilarious that Guy Fieri's face was on three of the, like, four walls. <br><br>Anyway, the food:<br><br>Raw ahi tuna poke taco -- 5/5<br>One of their signature offerings, for good reason. I loved the contrast of the hard taco shell and tender tuna within. It was a little sweet, a little spicy, overall delicious. A must-try if you enjoy tuna.<br><br>Samurai taco -- 5/5<br>I really liked this one too. First, it was quite big, with enough fish to occupy two tortillas, though it's priced as a single taco. It was seasoned with a sweet and savory sauce, which I am now realizing is probably why I liked both the tuna and this taco. Lol.<br><br>Big & Little's taco -- 3/5<br>Pretty basic fried fish taco with slaw and tartar sauce. While I enjoyed the fish and the flavors, I think they put on too much of the cabbage, lettuce, and sauce. It was kind of hard to eat since everything was falling out, plus it was overwhelming the fish.<br><br>Spicy pork taco -- 4/5<br>I wanted to try a non-seafood taco, and this was pretty good! Usually I find pork tacos a little dry but this one wasn't. <br><br>Shrimp classic po'boy -- 3/5<br>The sandwich was massive but also like 70% bread. While it tasted pretty good, it was super basic and again I found this hard to eat. I'd skip it next time and either try the pork belly po'boy or just get more tacos.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uRJZ43H6DjOjW5OQ_m5JMQ/348s.jpg", "caption": "Shrimp po'boy"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7ljvqLljfnn8Lkb7nPeIAw/168s.jpg", "caption": "From left to right: raw ahi tuna poke taco, samurai taco, Big & little's taco, spicy pork taco"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aMQLehLKX5CXZ9FczQaoWQ/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "First off, the staff! Very friendly, informative, and won't steer you wrong. The place has a great vibe of corner dive. I like the open kitchen plan.<br><br>The foie gras and fries. Delicious! Perfectly prepared, and I don't even like liver. It is very tender and buttery on the inside, and a nice crispy sear on the outside. See pics. <br><br>Softshell crab sandwich. I think I would like the inside of the bread toasted on the flat top first, but it's still an excellent sandwich. The sauce has enough zest and the seafood is perfect.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aCvnDUnp5wV86bxWn7Eh9g/348s.jpg", "caption": "Soft shell crab sammich."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Sa7_bXPqEaTVXBcCwNWRAQ/168s.jpg", "caption": "Foie gras and fries. I don't even like liver, and this is excellent!"}]}}, {"review": {"des": "I really think this place is great for what it's promising. I tried the truffle fries, got the fish and chips and tried a bit of my friend's soft shell crab burger. I liked all of these things. I like the way they bread and fry, the batter ends up really crispy on the outside and airy. The seasonings are also done really nicely, with just a bit of savory and peppery. I think things are priced reasonably and they do have great selection and everything I tried was good. Would definitely come back here when I want more perfectly fried seafood and fries for a nice unhealthy meal.", "pics": null}}, {"review": {"des": "I stopped by right when they opened up at 11 am. It's casual and relaxing space. They offer tacos, burgers, sandwiches, fried seafoods and variety of sauces. I ended up with a fried egg cheeseburger with everything and fries. <br>It tasted great with flavors and not too salty or heavy. The fries are fresh and yummy. One thing to note is that I needed to have everything well done but forgot to mention it. The staff was very kind to cook the egg and pattie again for me! <br>It was a great dining experience. I am sure to come back with my friends next time when I am in the area. Highly recommended!", "pics": null}}, {"review": {"des": "Ordered BBQ Bacon Burger,Cheese Burger n Truffles which costed $20 and they let me have the fountain pop only for $1 as I dint have any cash left.<br><br>Taste is OK,felt meat should be grilled be some more time.<br><br>Pros:<br>---------<br>Decent Price<br>Good Portion<br>CTA station close by<br>Quick Service<br>Spacious<br>Street Parking<br><br>Cons:<br>----------<br>Taste can be better.<br>Cash Only<br><br>Well there options like fish&chips,po boys.Try yourself and yelp out.", "pics": null}}, {"review": {"des": "This little restaurant has the nicest people but their food is GREAT!!<br>I suggest getting at least 2 tacos  flavor is spot on and will definitely come back.", "pics": null}}, {"review": {"des": "Looks better than it tastes. Soft shell crab po boy was very underwhelming and the bread was kind of stale. The fish of the fish and chips were nice & flakey, but the fries were too greasy and lacked that fried texture that was perfected in their fish. Overall, not a happy meal.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/k3d56-R4_twBytIyjBzWkw/348s.jpg", "caption": "Soft shell crab po boy"}]}}, {"review": {"des": "As late night watchers of Diners, Drive In's and Dives marathons, we had to go to to Big & Little's for the pork belly po' boy when my husband went to Chicago for a trade show. <br><br>We were the only ones there at the time, they had probably just opened. We asked the girl working the counter some questions and got to chatting, she was awesome and gave us all the sauces because we couldn't decide. We also talked to one of the guys cooking, because he heard us say we were from NY. <br><br>Anyway.... my husband, indeed, got the pork belly po' boy and I got a carnitas pork taco because I wasn't all that hungry. My husband enjoyed his po' boy, it tasted fine to me...reading the menu it says there's maple syrup on it, which I don't recall tasting. To be honest, my taco was lame. $4 for flavorless pork, some onion and cilantro. <br><br>Definitely meh for me, but I'd give them another try, I just wouldn't walk on a cold November day for 45 minutes to do it.", "pics": null}}, {"review": {"des": "So my dining companion had asked whether I had been to BIG & little's Restaurant prior to our visit on a dark and stormy night, and she seemed amazed that I had not. She says that the soft shell crab po'boy sandwich is pretty much her fave food item in all of Chicago.<br><br>This location is on the edge of the River North area on Orleans, about 3 blocks from the Chicago Brown Line station. It looks like there are two dining areas, but one seemed closed off on this particular Tuesday evening. You order at the counter, and your name is called out when your food is ready. Our wait for the food this evening was very minimal. <br><br>There are images of food celeb Guy Fieri everywhere, even on a table top. I'm almost surprised that the crab po'boy is not shaped like his head. But better yet, the crab on the sandwich is served open faced and actually looks like the original crab.  It is so uniquely picturesque, in a way like a food processed shape of an animal, but yes this crab is the real deal. I got a nibble of a crab leg and it is pretty good. I went with the BBQ bacon burger, served closer to medium though I asked for medium well. However this burger was savory, greasy, flavorful. The grilled onions were yum, and the crinkly strips of bacon were crunchy like those bacon bits on salads. This burger also comes with pickles, American cheese, and a swirl of barbecue sauce. We ordered both the regular fries and truffle fries, and to be honest we could not tell the difference between the two baskets of spuds. The fries were fine, though the splashes of ketchup helped. The blackboard also listed three desserts.  Although we did not try them all, we enjoyed sharing a wedge of the Oreo cake (the other selections were key lime pie and carrot cake). It was sort of a cross between chocolate cake and cheesecake, but somehow it was not overly rich or sweet.<br><br>This place is cash only, and has a parking lot just to its north. They now are open on Sundays, and are BYOB.", "pics": null}}, {"review": {"des": "This is based on the fact that this branch is much more overpriced than the other ones (esp the Belmont location). I was at the Belmont location a couple weeks ago and was excited to try the location closer to me but was disappointed by the difference in price! <br><br>The fish and chips here are $15 and the soft shell crab is $13. At Belmont, both items are $8. Tacos are also twice as much here. Also, boo for cash only. <br><br>Otherwise, the food is pretty much the same and I would give 4/5 for the food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EtqDFmHhgmCbKxMGbpgtTQ/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kFnkwP1NDNGt00n2qcSJNQ/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xwUWtCT-gJD5V6kZcSYmfg/168s.jpg", "caption": "Fish and chips + pork belly poboy"}]}}, {"review": {"des": "Big and little's has some of the best fish and chips you're gunna find in the city. The cod fillets are always fresh and cooked to order. And some of the biggest pieces of fish I've ever seen! <br><br>little is super nice and I'm always glad to catch him at one of the restaurants. <br><br>This particular location has a free parking lot.", "pics": null}}, {"review": {"des": "Picked up takeout from here on the way home today and it was AMAZING! <br><br>Tried the shrimp po boy (perfection), fish and chips (delicious and I usually don't like fish and chips!), grilled shrimp taco (fresh and tasty), grilled tilapia (really interesting and delicious), and an Hawaiian taco (tbd because there was too much food).  <br><br>Everything was wonderful! <br><br>Pick up was quick and easy and service was friendly. <br><br>All in all, I was thrilled with my visit. Reasonable prices also!", "pics": null}}, {"review": {"des": "A Diners, Drive-ins, and Dives legend!  I ordered the MAHI taco and the half fish and chips.  The place has a very nice neighborhood dive feel to it.Great prices.  It kind of takes you back your college days!  One of the owners himself waits you at the front counter. A very unassuming decor but just a perfect place to capture it quick lunch with incredible food.  My fish was perfectly cooked and my taco was perfectly spiced. It's certainly worth the trip.  <br>I'm in Chicago, I'm going to make sure I take Uber to this place for lunch.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xKtdrYQ_z4dd3afRqG44Qw/348s.jpg", "caption": "$4.75  so worth it!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WqlJb5_fbhXoqnMQtrH37g/168s.jpg", "caption": "1/2 FISH & CHIPS....$9"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CXsgeX5GtBkbv0INvPxPXw/168s.jpg", "caption": "More info about Guy's visit."}]}}, {"review": {"des": "This location is cash only.  I'm not sure how the other locations are.  They do have an ATM inside.<br><br>I got my food to go. Ordered the pork belly po boy, Hawaiian pork taco, mango chutney pork taco and foie gras fries.<br><br>The pork belly was nice little bits of crispy pork.  The tacos were both spicy which wasn't expected.  The only thing I was disappointed in was the foie gras.  The fries itself were really good but it wasn't worth the extra money getting the foie gras.  The flavor was odd and was hard to cut through.", "pics": null}}, {"review": {"des": "I've walked past this place many times and was always curious about it. I met my Step-Father here on an off time on Sunday (they are now open on Sundays) to make sure we got a seat. I don't think another reviewer really looked around. The front room probably has 8 4 seater booths, but there is also a second room filled with tables. <br><br>They are dog friendly - I know this as someone left from the second room with a dog. I love dogs, but I have mixed feelings about bringing your dog into a restaurant. Not all dogs are well behaved around food or sometimes have an \"oops\" moment (as sometimes happens in the Ace Hardware in my neighborhood that is next to a Pet Smart). I've been on outdoor patio's where the dog basically put its head on our table & just stared & stared. The owner could have cared less. & I was certainly not gonna find out if the dog was food aggressive. It was really uncomfortable for me to tell them to control their dog as they didn't take it well. <br><br>Basia at the front counter could not have been nicer to us. No hassle over my Groupon (Big Thanks to previous reviewer who pointed out the Groupon).<br><br>I am normally a salad & everything green & healthy girl but for some reason I am on a burger kick. I tried the Hercules burger and YUM! Just the right amount of Taziki sauce to really make it tasty. I also just had to have the truffle fries. Again yum & worth the calories. <br><br>I will be back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/H0eYjBy1F8SNr-_NRKb_SQ/348s.jpg", "caption": "Hercules burger & Truffle fries."}]}}, {"review": {"des": "This is a great place for seafood, but they also have solid burgers and semi-Asian fare. I lost the fish tacos and shrimp poor boy sandwiches. The burgers are also solid. The fish-and-chips is more of an Anglo-Irish style (not the chips, but the cod), which is nice to get and the portion sizes are excellent (I am 6'2\" and 330 lbs, so I eat a considerable amount). <br><br>The only real down side is that they can be busy during lunch, and the extra seating is picknick tables, which is not so forgiving to large guys (the regular seats are cool). I really love this place. It is ideal if you are in the mood for good shrimp without spending a fortune, or good fish. The Asian tacos are really good as well, especially the Japanese spare rib or Thai fish taco. It is ideal for no-meat Fridays, but still good for other days.", "pics": null}}, {"review": {"des": "So I didn't want to go to a fancy restaurant by myself. Nor was I too hungry. But when I saw a soft shell crab taco I had to try. Walked half hour in shady neighborhood to get to it, but it was worth it. <br>Staff was very friendly and made me feel at ease. <br><br>So much better than the fancy overpriced restaurant food! It was soft, juicy, and just plain tender. Sauce was little spicy and cabbage was sweet. It was great way to finish my dinner without over eating. I was tempted by the $16 foie gras fries but I felt too full to appreciate it. <br><br>Hope to stop by again next time!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fIspB2sTovhW3fe5Q66VQA/348s.jpg", "caption": "Menacing but delicious"}]}}, {"review": {"des": "This place is a must if you're in Chicago! Like most, I watched the episode featuring them on a popular Food Network channel show. I first visited 5 years ago and have been salivating at the thought of enjoying their soft shell crab and pork belly sandwiches.  I waited 5 years to have another one of their delicious sandwiches and all I can say is, \"Wow!\". Prices are super reasonable. Cash only establishment, but there is an ATM inside. I look forward to going back again, but not waiting 5 years for the next trip.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kvLArHWq1WPcyv_FqyjdHA/348s.jpg", "caption": "Heaven!"}]}}, {"review": {"des": "Nice store. Very friendly staff and helpful. Quick. Decent prices. This locations menu seems bigger. I shared cheese fries (5.50$) with my bf, REALLY good fries! I also had the shrimp poboy (8$) and I dont think I would again. There was a lot of breading to the shrimp and between that, a generous spread of sauce and think bread it was just too much. Definitely will be back to try something else!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1zvbQuqr6N9w7CgY0srQHg/168s.jpg", "caption": "Shrimp poboy-8$-too much breading"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ibm5IAL4ZCxJNhxY7wto9w/168s.jpg", "caption": "Cheese fries 5.50 -excellent"}]}}, {"review": {"des": "We came here for tacos and sandwiches and I must say, they were mostly pretty good. I'll rank in order of what I liked:<br><br>1. Tuna poke taco - different and at first didn't enjoy it, but the second bite makes me wanna come back. <br>2.  Pork belly sandwich - a lot of pork belly, super crispy, decent size <br>3. Mexican Taco - this was a classic meat taco<br><br>We also had the salmon poke taco, Hawaiian taco, and samurai taco. Samurai was def best bang for buck (2 tacos in one order), and my friend loved the salmon, but I wasn't as big of a fan. <br><br>Their sauces r so good too! I would def take my friends here.", "pics": null}}, {"review": {"des": "I was going to give it four stars but it is possibly the only restaurant that has never failed in the two years living in Chicago.<br><br>The Fish and Chips are fantastic!! I am a Brit American I have had the best London had to offer. Ask for Malt vinegar. There are two sizes...half is enough for a human..full is gigantic..you have been warned <br><br>The variety, quality and portion sizes for your dollar are such good value. Don't expect fancy. Don't dress to impress. I promise you will be talking about the food and going back for more.<br><br>Cash only...ATM on site.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wXSto1zJe8miNDFb-LVplg/168s.jpg", "caption": "Saturday can be busy but you soon get through"}]}}, {"review": {"des": "Ever hear of Groupon? It's still around if you can believe that!  $20 for $12 almost always.<br><br>Tacos are fire and if Guy Fieri is painted on the tables I'm IN!  I apologize I forgot to mention BYOB.  Mention mention mention....", "pics": null}}, {"review": {"des": "I went with the classic beef tacos. I like how the beef wasnt charred and burnt it was moist. Cilantro wasnt overwhelming. Corn tortillas were cooked not that nasyy rubbery texture. Ill go back and get the same thing when in the neighborhood", "pics": null}}, {"review": {"des": "Truthfully, I ate this three hours after I ordered it, so this won't be an fully accurate depiction of BIG and little's. <br><br>I got the shrimp tacos, they were pretty flavorful, but could've used a few more shrimpys. The fries were just...okay. There wasn't much to my meal and I'm gonna put most of the blame on the fact that I took so long to eat everything. <br><br>I would like to eat some of the fresh tacos AT BIG & little's another time and hopefully try out more items on the menu.", "pics": null}}, {"review": {"des": "If you have a big appetite and enjoy some Cajun inspired food, this signature po' boy at Big and Littles is what you need to try. The portions are always generous and the place was featured on Diners, Drive-in's, and Dives so you know it's legit. I love the Cajun and truffle fries as added sides. I can also recommend the pork belly po' boy and the ahi tuna taco. Can't wait for them to come to Midway Airport!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HLPCkp2ITDFsUWsYSfNulQ/348s.jpg", "caption": "Soft Shell Crab Po' Boy// Fried Soft Shell Crab, Lettuce, Special Sauce, Lime Juice"}]}}, {"review": {"des": "I just introduced my brother to Big & Little's and had to update my review because we had such a good time. I know this restaurant is known for their tacos, but guys, you must get their FISH AND CHIPS! <br><br>No wonder Guy Fieri recommended this place! Who knew that their fish and chips could be so good? Also, what a random item! <br><br>Go ahead and order the full order. You won't regret it. You get a HUGE, made to order, fried whitefish filet. It's light, crispy and flaky. Dip it into their tartar sauce and you'll be in heaven. Don't worry; they don't skimp out on their tartar sauce. Also, you're not gonna feel greasy and gross like you would if you ordered fish and chips from other places. I'm appalled that I haven't tried this before. Have I convinced you yet? <br><br>Note: I know I recommend the soft shell crab po-boy before, but I actually recommend just going for the taco. It's a lot lighter than the sandwich and you can truly enjoy the crunchiness of the soft shell crab.", "pics": null}}, {"review": {"des": "RESPECT<br><br>I've had the tacos here in the past but only at events.  I always thought they were good but honestly event food isn't the same as eating the food fresh at a restaurant. We walked in and noticed the menu board had some items missing from the online menu. The guy taking our order said he could make anything for us even if it's missing. That's called customer service. I wanted the Mack Diddy Burger which has two parties along with cheese, shredded lettuce, pickle and thousand island sauce. The girls both ordered tacos. My wife wanted to carry out but I insisted that we dine in because fries and fish tacos don't travel well. <br><br>As we were waiting I noticed that several people who had ordered food after us were all getting their food. It seemed weird that people ordering burgers and the same tacos were passing us. I sent my wife up to the counter to ask if someone had taken our food. They apologized to my wife and informed her that the owner was having my burger remade because it wasn't right and he didn't want to send it out. Unfortunately our trufffle fries, samurai taco and el pastor taco were sitting under the heat lamp baking. They decided to give her the food that was already done. If she didn't go up there then her poor food would have still been sitting under the heating element. The truffle fries were not totally fresh and that's because they were sitting. I'm a fry snob and never order them for delivery. I need them hot and fresh out of the fryer. Part of me wanted to say something but I hate wasting food and understand the costs of running a restaurant. <br><br>The girls started to eat their tacos while I waited for my burger. My burger was finally done and when I went up to get it they apologized for the delay. Again great customer service. The burger looked amazing. It was simply beautiful. All I could think is what did it look like before the owner made the chef recook it. I took one bite and I was in love. This burger reminded me of going over to a friends backyard party and your buddy was grilling burgers. Then you tell your friend that he needs to quit his job and open up a restaurant. That's the metaphor that flew through my head after my first bite. These moments don't always happen to me but when they do they are a magical moment. The patties were clearly hand packed and the char on the edge of the meat was just fantastic. The bun was perfectly grilled too. The shredded lettuce, pickle and thousand island rounded out this perfection on a bun. This is one of those burgers that will stay in my head forever. I'm afraid to ever order it again because I'm scared it won't taste this good. I'm going to need the owner to be here every time before I order this burger to make sure it's always this amazing. <br><br>While we were eating our food they sent over two tacos for us to try. They wanted to apologize for the screwed up on the burger and our order not coming out together. I can never get mad at great customer service. Things happen in a restaurant and when the staff recognizes it and apologizes then it makes the dinning experience incredible. This might have been a four star review but I have total respect for this place and they deserve five stars. We are all human and saying I'm sorry goes a long way. It makes everything taste better. <br><br>We had a great dinner. What a perfect way to end a long work week. Thanks to the staff and owner for having great customer service. Also thanks for making me a burger that will be dancing in my dreams for weeks. I almost thought I made a mistake by not ordering tacos but now I may never have another taco here again. The burger just blew my mind. Don't get me wrong the tacos are great but you've won me over with your delicious burger.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/08yq-Fr5TRhpgwnkA13dyQ/348s.jpg", "caption": "Taco!!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/57iuWewJORsrC_W4NCH10g/168s.jpg", "caption": "Samurai Fish Taco"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sGeXMK9ywl9kqVwVhWxg2w/168s.jpg", "caption": "Taco al pastor"}]}}, {"review": {"des": "Decent food service sucks as usual places who have Guy Fieri give them his stamp of approval the places I personally been too always get a little cocky afterwards. Food was decent had a pork belly po boy and soft shell crab with truffle fries.. fries were quite salty but good, I prefer the crab by itself without any bread or condiments I enjoyed it better that way and the pork belly was good not great,  as well. Went better without the bread and extras I felt..first time in chicago and this was on of the places I was excited about but didn't quite live up to expectations.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NKJUCSlNwd7Dza4efr6ilw/168s.jpg", "caption": "pork belly po boy"}]}}, {"review": {"des": "I got the portabella burger with truffle fries. It was bomb. Straight up solid fast food. I was stuffed and it tasted great. Would love to go back and try their tacos.", "pics": null}}, {"review": {"des": "I came to Chicago for a work getaway thing, and our Airbnb was beside this place. Despite great Yelp and other online reviews, my coworkers didn't want to come here because it looked like a dive. That's when I told them it is a dive! And was on the show Diners, Drive-ins and Dives. So they hesitantly agreed to try it out for lunch and were blown away. The portions were friggen huge, everything was ridiculously delicious, and the staff and service was phenomenal. It was an amazing, pleasant, surprise. The best kind!", "pics": null}}, {"review": {"des": "It is like a restaurant from my younger days but with some of today's food. It has a local restaurant feel and only takes cash, like when I was in Old Town. The food is very good and they have poke , a healthy now food. My daughter really liked the truffle fries. Her burger was also a big hit. The cashier, Basia, was funny, friendly and patient with me, not an easy task. It is not a dress up place but a bring some friends to eat and sit and talk about life kind of place.", "pics": null}}, {"review": {"des": "Food was good, had the Foie gras fries, soft shell crab and pork belly poy boy, and tuna taco.<br>Tuna taco could be a little bigger.<br>Be sure to bring cash cause there's ATM charge of $3.<br>Would come again.", "pics": null}}, {"review": {"des": "Oh hello Hawaiian taco. I didn't notice you there. You come here all the time you say? Wow, how did I miss you and your beautiful self all this time? Let's make this thing even more fun and get the Cajun fries with a side of merkts cheddar for some slow dipping. Oh yeah. That's how lunch is done.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jZV34y-eQ6RHUsa0p9MIlQ/348s.jpg", "caption": "Hawaiian taco, Cajun fries, merkts cheddar."}]}}, {"review": {"des": "Great quick lunch spot in an interesting location! The staff is pretty cool, good menu pricing, and clean, spacious inside. My thoughts:<br><br>1. Love the ahi tuna options on the menu. Boyfriend and I ordered the Poke tuna crunch wrap which was delicious and filling. <br><br>2. I wish they used a better sandwich bread on the Soft Shell Crab sandwich. The Soft Shell Crab was delicious! <br><br>3. Place can eat buy for lunch. Boyfriend and I beat the lunch rush by half and hour. We can in around 11:30am on a Saturday! <br><br>4. The menu pricing hits various budget. Some items can cost a little more than $10. <br><br>5. The front area is a little hot. I recommend sitting in the extended area in the back. At least you can avoid smelling like fried fish afterwards. <br><br>6. This place is BYOB! What's a better way to enjoy fried fish with a nice cold beer in the summertime?", "pics": null}}, {"review": {"des": "BIG made my breakfast burrito. In town with no plans so walking around old neighborhoods to reminisce. Got hungry and walked into this gem.<br>Amazing breakfast burrito and potato cake. Great price and BIG is as pleasant as you could ask for.<br>It's got a real Guy Fieri aesthetic. Sparkly, neon, and kinda noisy. Gotta get around that fact. <br>If they make this simple meal this good, I'm coming back for lunch.", "pics": null}}, {"review": {"des": "Decided to give this place a shot since they were offering a Groupon. I had the crab po boy and my wife the pork belly po boy. We also had an order of the truffle fries. <br><br>We both thought the food was way too salty, particularly given that it was deep fried. It was also very dry - extra sauce necessary. Left in dire need of a palette cleansing to reclaim our taste buds.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gLKTh-C3TZMWHzgRlfnB3A/348s.jpg", "caption": "Crab po boy"}]}}, {"review": {"des": "Been meaning to try this place for awhile and I'm sure glad I did! Was a little off-putting to see that the soft shell crab po boy is $13 but definitely worth trying for a first timer. Truffle fries were delicious, perfect for splitting with someone. The place is cash only, but they do have an ATM inside (unsure if there's any sort of surcharge associated with it.) FYI there is a Groupon for $20 at $12.50, so definitely coo that before stopping by.", "pics": null}}, {"review": {"des": "Big and Little's is one of my must-go destinations whenever I'm in Chicago. While the place (Orleans location) can be a little cramped (and WARM in the summer), the food makes all the elbow-rubbing and meat-sweats worth it.<br><br>My favorite is the pork belly po boy....the pork belly is crispy on the outside but melty on the inside and the maple mayo is sooo tasty. I get it without the hot sauce because I am a giant spice sissy. I'm also a fan of the foie gras and fries. They're a great way to introduce someone to foie gras if they've never had it before. The burgers are always a good bet too.<br><br>They have really expanded their menu from their earlier days, with a big emphasis on tacos. They've kept most of the old favorites too, which is great (Deep fried grilled cheese, sweet baby Cthulu!). <br><br>I'll be in the city this weekend and I'm excited to try the Midway location on my flight home!", "pics": null}}, {"review": {"des": "Samurai. Short ribs. Crab meat. Po boys. Truffle fries.<br><br>Causal and cozy setting. Great for groups. Has a parking lot!", "pics": null}}, {"review": {"des": "I haven't been in for ages!! Was walking nearby and figured awesome place for a quick lunch.  I forgot how truly yummy the Poke Tacos are- -especially the blue crab! The crab is so fresh and yummy!! The tuna poke is also great.  Both are great sized portions- overflowing the taco shell.<br><br>Staff was super friendly and service very quick!<br>Definitely need to hit this more often!! It is an awesome place for a quick, yummy & cheap lunch!", "pics": null}}, {"review": {"des": "I would've given this five stars but when you charge $1.72 with taxes for a can of pop!!! In this day and age it's shameful, you're picking up pennies to lose dollars at least that taste in people's mouth's, on another note fish and chips were delicious", "pics": null}}, {"review": {"des": "Great Tacos, had a lil bit of the,fish, and Al Pastor? some lil big. I had a specialty burger with pineapple, swiss, peppers. Also had truffle? fries I think :) <br>Place gets busy,  as soon as it opens. I see why! <br>I will be back, like the Terminator!", "pics": null}}, {"review": {"des": "What a fun place to grab a casual meal! CASH ONLY! They have a wide variety of foods at decent prices. Portion sizes were a bit on the smaller size, but food was pretty good. I had one shrimp taco and one fried shrimp taco. The shrimp taco was really good, but not a huge fan of the fried shrimp taco (and believe me, I loved fried food). It was way too messy and I wasn't thrilled about the batter. My husband had a burger with an egg on top and we shared some truffle fries. He thought the burger was just okay, definitely on the smaller size. Truffle fries were delicious and not overbearing. A lot of vegetarian/pescatarian options too! Will be coming back with some friends!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gdNfyZl4CgzQ8_ehlxy5kg/168s.jpg", "caption": "Burger"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/V0AmdmMVn1HvE0VQMRU9tQ/168s.jpg", "caption": "Truffle fries"}]}}, {"review": {"des": "Zomg... everything BIG and little here was freaking amazing. Good things come in large and small packages, and we're talking about some of the best tacos, po boys, and fries I have had in Chicago.<br><br>TV food specials certainly helped convince my friends to take us all here while they were visiting the Windy City. This spot specializes in seafood and meat tacos, with a couple of major standouts that have restaurant goers coming back for more.<br><br>Two must haves when you come visit are the Soft Shell Crab Po Boy (I mean, LOOK at the photo. It's a giant freaking crab) and the Foie Gras Fries. All I really wanted was to play with the small crab that was laying in a bed of warm toasted bread. Its interior was soft and delicious, and a definite party in our mouths. As for the fries... man, the fanciest of ingredients plopped right on top of a bed of golden fries. Duck liver never tasted so good on top of spuds.<br><br>Along with those standouts, we also ordered a bunch of soft tacos including the Salmon Poke (amazing sesame dressing) and some of the beef ones. They were all very good, so pick and choose whatever protein you like. I wish we ordered more tacos because it was all so good.<br><br>Oh, and did I mention that it's BYOB!? Feel free to drop by the local drug store to grab a six pack and enjoy it with your meal.<br><br>BIG and little was so worth it. We left feeling extremely bloated but content with life. I'll be sure to come back to relive the moments of crab and liver.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WtPCQ52df_9l-BHkQzdkaQ/168s.jpg", "caption": "The best fatty fries ever"}]}}, {"review": {"des": "So, after watching 2 diner review shows I decided to stop in restaurant even though the other locations menu items were at a lower cost. There was free parking a big plus considering the location. I'm have some disability issues and it made it difficult to get into the place. So me and my party decided to order the soft shell crab and I have to tell you OVERRATED! I also a pork po boy and I enjoyed it. Overall I think this place is more hype than substance.", "pics": null}}, {"review": {"des": "If you love any type of seafood taco this is the place for you. It can be a little pricey, but you can tell the seafood is fresh and good quality. My mom and I went there and just ordered a whole bunch of stuff. We tried the shrimp taco, the samurai taco, the blue crab stuffed taco, truffle fries topped with a fried egg, and a cheeseburger (haha my mom wanted that). I highly recommend the samurai and the blue stuffed crab taco. Hands down my favorite. I inhaled both of them before my mom could even try them. It is stuffed with a good amount of crab and served on a crunchy shell.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FA4xuioYLLXUFu6ATFQWgw/348s.jpg", "caption": "Shrimp taco"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NAcKq1Nw_iwFOZGjLGEosw/168s.jpg", "caption": "Samurai taco"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zT9YjSJp-59AtLMElNmFdQ/168s.jpg", "caption": "Blue crab stuffed taco"}]}}, {"review": {"des": "BIG flavors Little complaints!  Got the Zeus burger w/ gyro meat and egg.. pretty tasty very unique. Loaded hotdog (needed mayo!) w/ fries (very good crisp n seasoning). Fish taco was good too. Burger patty and dog coulda been a bit larger for the price. Service was great and friendly.", "pics": null}}, {"review": {"des": "After reading the reviews and looking at the pictures, I was excited to go here. Luckily I was prepared as it said Cash Only on yelp! So do make sure you have cash.<br><br>I got the fried crab sandwich and was pretty disappointed. It had no flavor whatsoever and it seemed as if I was just eating something fried with a lot of sauce drenched in it. To each their own though! Don't let this review stop you from trying it for yourself.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/12lML5Jx7BeeuJ7BKcdwRA/348s.jpg", "caption": "disappointing fries and flavorless crab drenched in sauce"}]}}, {"review": {"des": "They are pretty darn good on the food, except it seems to me that they never give me enough.  LOL! However, please don't let that stop you from trying this place because TRUST, the food is good. :)  The ONLY reason I am deducting one star is because it is CASH ONLY and I never carry cash. :(  Once they fix that, I will give them a solid FIVE. ;)", "pics": null}}, {"review": {"des": "I feel like every time I see a spot featured on Guy Fieri's Drive Ins, Diners and Dives it gets way over hyped for me and I end up underwhelmed. Big & little's unfortunately falls into this category for me... an A-Okay meal overall, but let's do this.<br><br>1st... CASH ONLY. Don't forget the billz.<br>2nd... I don't say this for many places in Chicago, but go for the seafood. Fish, crab, etc.<br><br>What'd I eat? I did the MANGO CHUTNEY PORK taco ~ Seared Shredded Pork, Pickled Red Onions, Cilantro, Mango Chutney, the SPICY BEEF SHORT RIB taco ~ Seared Shredded Short Rib, Onions, Cilantro, Spicy Thai Sauce, & the MAHI taco ~ Fried/Grilled Mahi, Lettuce, Cabbage, Special Sauce*, Asian Sesame Sauce, Lime Juice. To share, we ordered Phil's Fries ~ 2x Fried Eggs on Truffle Fries. Fries were probably not necessary, but YOLO. <br><br>Verdict? The mango chutney pork taco I could live without the mango chutney sauce, if I come back again I would just go for the carnitas taco. The spicy beef taco was good, not great. Not much to rage about. The Mahi was my favorite. Surprisingly some really fresh fish and overall flavors. And lastly, Phil's fries... is there such thing as overly truffled fries? Initially the bites were good, but after some time I just could not do it. I think we barely got through half of the fries.<br><br>Overall, not a horrible experience, but I question dropping just under $40 for two at a hole in the wall sort of spot. I'll have to give this one another shot and try the Big n Littles special taco & Softshell crab poboy in the future. <br><br>'Til next time, cheers!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3xD6VzQ3EuOxEAeZYdYYgg/348s.jpg", "caption": "Feast."}]}}, {"review": {"des": "Damn you food network for getting my hopes up! I was SO excited to eat here. Somehow my boyfriend and I racked up a $40 lunch bill for tacos + NO alcohol. Amazing. Lol<br><br>Anyhow, I got 3 tacos: the banh mi, the carnitas, and the mexican short rib. we also shared an order of fries (truffle fries with an egg on top).<br><br>Of the 3, the banh mi (with white fish) was the only memorable one. The rest were more or less flavorless, and the truffle fries just tasted like chemically-produced truffle oil fries which kind of was disappointing.<br><br>Will I be back? Probably for the fish tacos, but nothing else.<br><br>CASH ONLY", "pics": null}}, {"review": {"des": "Living next to this place is dangerous. Their tuna poke wrap is life changing and addictive. The first time I tried it I went back multiple times that week to get it. I've cut back since but I still go through phases. I recommend ordering through their website to get loyalty points. I've had tons of free or discounted food from racking up my points.", "pics": null}}, {"review": {"des": "On the corner of a quiet, a bit sketch area (for an outsider), you have BIG & little's Restaurant. You enter not through the front door off the street, but off the side door where the parking lot is. The place is old, rundown, and can be mistaken for a dive bar. I was a bit intimidated once I entered. Being from SoCal I thought I stood out like a sore thumb staring at the menu for a long time deciding what I wanted even though I had already looked at the menu online before walking here from my hotel! Another thing that triggered an alarm in my head was probably the sign that said Cash Only. Coming on business, I was planning to charge the meal, but luckily for me I had extra cash on hand. If you don't, well, there's a ATM inside so don't worry. But back to the food.<br><br>I wanted taco's, and that's why I was here, so I went with the Little Samurai, Big & Little's, and Spicy Pork. Two were fish, and the other a meat. Being taco's, 3 filled me up rather good. Each was flavored, stuffed, and done well. If I had to choose a favorite, it would of been the Little Samurai because of the Special Sauce, but the fish was nicely battered and flaky in the Big & Little's which was more traditional, and the spicy pork was tender and had some good char to go with it. Again, the spicy thai sauce they used on it was a winner.<br><br>From the taco's alone, I'm a fan. I definitely want to try a burger, po'boy, and the fried seafood next time I have a craving. It's another staple to the long list of go to's in Chicago imo. I'm glad I made the 25 min walk from my hotel to enjoy this place.", "pics": null}}, {"review": {"des": "Ordered: Lamb Gyro Taco, Samurai, Japanese Beef Short Rib Taco, Truffle Fries Topped with fried egg<br><br>ATMOSPHERE: Very Casual atmosphere, and Pretty Clean<br><br>PRICING: Pricing is very reasonable, and the portion sizes are decent, so even the more expensive items are worth the cost. Remember they are CASH ONLY (or at least the location by Chicago/Franklin is. <br><br>FOOD: Very imaginative Tacos. I love the Lamb Gyro taco, the meat is very tender and the Tzatziki sauce is very flavorful and fresh. <br><br>The truffle fries are awesome. A little salty, but I prefer my fries salty.", "pics": null}}, {"review": {"des": "Big & little's Is good stoner food everything is mostly fried...I had the Pork belly poboy sandwich nothing special. It was okay you can tell the pork bell was not freshly fried kinda stale and dry. The portions were big though. I recommend try at least one time.", "pics": null}}, {"review": {"des": "I had the mango chutney pork, spicy beef, big and little's fish and ahi poke tacos. All were awesome. But the ahi pole and fish tacos were mind blowing. The magic is in the way add different t toppings and sauces for each type of taco they make that perfectly enhances the flavor. I am California and these guys make as good as LA and SF if not better. I loved it and I am going to have more next time I come to Chicago. Great thing is that they have a branch in midway airport. So don't miss it when you have those flight leg breaks at Chicago airport.", "pics": null}}, {"review": {"des": "Awesome little hole in the wall. Ordered the pork belly po boy and a shrimp po boy.  Both were large and delicious. Had a side of fries that were large. Should have with the foie gras fries. Pork belly was nice and crisp and came with a heaping portion.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pb8CWEahMNZJdPP-0Z6iZA/348s.jpg", "caption": "Pork belly po boy"}]}}, {"review": {"des": "I love this place and I'm getting obsessed. I don't live in Chicago anymore so this is the first place I run to when I'm back. First of all, they are byob! For the awesome food that they have, it's a must to enjoy it with some great beer (or whatever your poison).<br><br>The food is affordable and much better than what you might find in a bar/pub. You order at the counter and wait to be called when the food is ready. Cash only!<br><br>Here are the following items I have tried:<br>Softshell crab sandwich-There was a little too much samurai sauce on it which made the fried crab and the bun a little soggy and a little messy to eat as it was dripping out with every bite. I enjoyed it because I love softshell crab, but I like the po boy better.<br><br>Softshell crab po boy-Excellent. I love this sandwich and the bread that comes with it. It's balanced with the sauce and lettuce. All goes well together.<br><br>Pork belly po boy-They fill your sandwich with the porkbelly. This melts in your mouth. I wish I had a bottomless stomach to keep eating. I could only eat half, but I loved having the leftovers. The porkbelly was tasty with great consistency because they finish off by frying, so you get the crispy in your mouth. <br><br>Salmon poke taco-mine came out room temperature. I don't know if that's normal, but room temperature raw fish isn't completely comforting. I ate it, it was delicious, and I didn't get sick. You can tell that the salmon is fresh despite the temperature. <br><br>Fois Gras fries- Oh my goodness. Oh my goodness. I love seared fois gras and it's hard to find it not in pate form. I was so excited about how delicious this was. The natural cut fries with the sea salt (guessing) was as best as fries can get. The fois gras melts in your mouth and overcomes it with flavor that you'll fall in love with (if you like liver food items).<br><br>Truffle fries-solid, delicious, get them. <br><br>My next endeavor will be to try the fish and chips. It's so hard when I go because I want everything. There hasn't been an item that I didn't like, so I have a really hard time deciding between something I've already had or something new. <br><br>I tried their burger at their Lakeview location, and it was delicious. I would recommend that. I probably wouldn't order it again unless I'm specifically craving a burger because of all the other items that I like more.<br><br>I've also been to their Wicker Park location and service was a little slower there. I waited longer than normal for the food and it wasn't crowded. I didn't really mind since I had beer with me. And the guy at the counter is very friendly and nice so I didn't sweat it. They let us stay until closing, way after we finished eating, so we could drink and chit chat. That was nice of them. This location doesn't have a double door, so once that door opens, the cold air fills the place up. Maybe the other locations didn't either, but I noticed here because it was a very cold day. <br><br>I prefer the original location on Orleans, but the staff is friendly at all locations.", "pics": null}}, {"review": {"des": "I came into the River North location for lunch. I was excited to try it because I've seen the soft shell crab a lot and I thought hey why not, the place is here.<br><br>I got the soft shell crab taco. It was pretty terrible. The crab tasted very close to spoiled. The veggies on the taco were wilty. The sauce wasn't bad, but it was all over the taco and so messy. The taco shells tasted processed. They were too small for the taco. Nothing was good. I felt like I wasted money and I was still super hungry. <br><br>The only upside was the fries. They were good.<br><br>I'm not sure if I would give this place another try. It isn't helping that it's cash only, too.", "pics": null}}, {"review": {"des": "We used a Groupon for a Saturday lunch of fish & chips and the hamburger with fried egg on top.<br><br>The burger was $6.50 which is more than a fair price for the city and the quality you receive. Throw on top of that the Groupon deal and it's over the top!<br><br>I wish I took a picture of the Fish & Chips. The cod was overflowing off the plate. It was monstrous. The batter was light and cooked perfectly. The whole thing was done well. <br><br>One additional comment, the whole Guy Fieri thing is a little over done. Big & Little is great because of the food & staff, not because Guy was there. But I guess, it helps with the tourists & puts B&L on the map, tourism map, that is.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Wse9B1g-rDAhY3EqFYb80Q/168s.jpg", "caption": "Big N Little menu"}]}}, {"review": {"des": "CASH only.  Pricing on casual with fine dining prep is Hit n Miss.  Burgers are a better value than seafood tacos.<br><br>SOFT SHELL CRAB TACO ($7.50) - prepared well.  It looks like a housemade flour tortilla.  One ply.<br><br>FOIE GRAS FRIES ($16) -- skip it.  Portion is too small for price.  Oil drips into the fries that becomes eeky greasy.  Nicely fried on the outside, unfortunately the inside was almost raw.<br><br>LATIN COFFEE ($1) -- love it!<br><br>ENTRANCE is throughly the parking lot.  Free parking?<br><br>SERVICE -- counter.  Quick.  Line can be long on lunch hours.<br><br>VENUE -- casual to divey.  Clean.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Dhoo3WSf6nren3nSWePNyw/348s.jpg", "caption": "Foie Gras Fried"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LMk1iPYtu6uT0qzRMtZ5Ng/168s.jpg", "caption": "Soft Shell Crab Taco"}]}}, {"review": {"des": "I was told about this place when I first moved to Chicago but didn't make it out to try it until a year later. My loss! This is a great place with affordable, quick and tasty food. The cajun fries were delicious and the Al Pastor taco was my favorite! I crave it all the time now!", "pics": null}}, {"review": {"des": "Ohh man I am glad I tried the soft shell sandwich!!! Excelente fries, however, they may be too salty for some. I would only suggest \"big\" who I happened to see tonight to invest a \"little\" on cosmetics. With good design ideas this place could be improved tremendously.", "pics": null}}, {"review": {"des": "The best Asian bold flavor inspired tacos!  I four different tacos last night (samurai, mango chutney, spicy short ribs and banhmi) and oh boy they all tasted soooooo good! I will definitely coming back to try the other tacos in the menu.  Two thumbs up!", "pics": null}}, {"review": {"des": "One of my favorite places my wife and I have ever eat. We went there about 3 years ago after seeing it on DDD, so watching DDD right now Big &Littles comes on , the wife and I were talking about how incredible it was and I realized I never wrote a review. So here it goes , this place is really cool, cool vibe, great view of part of downtown Chicago from the outside and reasonably priced, now on to the food we got the soft shell crab po boy, pork belly sandwich, and Duck fat fries , they all 3 were delicious. Once again DDD did not steer us wrong . Loved this place, my apologies for taking so long to write a review for one of my favorite places ever! If you ever in Chicago go there !", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/R8SrkWUv551omK1w_SkIvw/168s.jpg", "caption": "View outside restaurant!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ofZmipbnebmS-AbOZHsz5g/168s.jpg", "caption": "Duck fat fries, soft shell crab po boy, and pork belly sandwich. 3 of the best things I ever eat!"}]}}, {"review": {"des": "We have been to this location a number of times and it never disappoints! I highly recommend the Big&Little taco and the spicy Thai taco!", "pics": null}}, {"review": {"des": "Tasty - and I can see why it made DDD. <br><br>I ordered the samurai taco, which was my favorite - all the components worked well together and the portion size was rather generous for $5. The jalapenos also added a kick. I also loved the soft shell shrimp taco since the softshell was delicious and the plum sauce on top but I don't think it was worth the $7.50. <br><br>I also ordered the pork belly po-boy featured on DDD. I loved how tender and crispy the pork belly was - and the portion size is generous! However, the crispy pork belly and bread were both very dry! There's also NO way you could fit that whole thing in your mouth. <br><br>Still, I think it's a good cheap eats. Nice to have tried it out once and the space is very casual.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/B8UFeAf8JCnagQuhkUzUMA/348s.jpg", "caption": "Pork belly po boy! A good deal for $8 but the bread is too dry"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eO9UKV0xwuu_q7kkitTd8A/168s.jpg", "caption": "Soft shell crab - yummy but worth $7.50? I don't know"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UkiYihCi7Il341gABMDA6w/168s.jpg", "caption": "Samurai taco! Must get!"}]}}, {"review": {"des": "Okay I have been trying to get here for a couple of years now. Grabbed a groupon so that it forced me to go. I was not disappointed.   We walked in and advised the cashier that this was our first visit. She welcomed us and even made sure we knew what the popular items were. I first heard of this place from Diners, Drive in and Dives with Guy Fiery. Back to the food. Omg we got the soft shell crab po boy and a basket of truffle fries. The sandwiches were on point and so was the fries. Even though the fries were tasty, I will ask for light salt next time. They have three locations and I will return again.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XE6LXHorNeRHH2jwWvYC0w/348s.jpg", "caption": "Basket of truffle fries"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rL68jYyLYU6WZglhBVAE1Q/168s.jpg", "caption": "Soft shell crab po'boy"}]}}, {"review": {"des": "This place is absolutely awesome! We don't live far from this location and we take our 2nd & 3rd grade children there for lunch as often as we can - it's their favourite place for lunch. The fish & chips are probably the best in the city and would say better than at any Irish pub I've had anywhere. <br>The food is delicious  and people working there are great - a great combo! Wish we had more authentic Chicago places like this in the city.", "pics": null}}, {"review": {"des": "This is one of the best taco spots in Chicago. Gary and the team surprise and delight with fish, seafood, and pork/beef tacos. Added bonus is the Truffle fries and hamburgers are really good!", "pics": null}}, {"review": {"des": "I saw this, like many others, on Diners Drive Ins and Dives over a year ago but just finally made it to lunch here. The soft shell crab sandwich seemed to be very popular on Yelp so that's what I ordered, my friend got the softshell crab taco and the spicy pork taco. Honestly, the sandwich was just alright. Nothing bad about it but I wouldn't rush back to have it again. Overall I've heard raves about their tacos so if I go back I'm going to try some of those!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NvA0zWDvX3xkeDbdSxkn_A/348s.jpg", "caption": "Soft shell crab sandwich"}]}}, {"review": {"des": "My daughter and I came upon this restaurant because we saw that it was featured on Diners, Drive-In's and Dives. All I can say is that we weren't disappointed. They had great food and great service. 10/10 would recommend for others.", "pics": null}}, {"review": {"des": "This isn't the main one featured on DDD but when an establishment expands it's difficult to remain consistent.  Fish and chips were great but the Foie Gras over fried left a lot to be desired. The Foie Gras was tiny (super close up) the the salt and pepper fries were really greasy.  If this was from the pan juices, they could have spared some. Friendly staff, but food not making the mark.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hinvO0hLC3A51TLXDx-hAw/168s.jpg", "caption": "Good flakey fish, nice batter crust"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pFInOArzaKgNgfWLbjntSw/168s.jpg", "caption": "Half Order Foie Gras and Fries taken as a super close up. Actual size of Foie Gras was 1x3 inches."}]}}, {"review": {"des": "Okay I was being a little harsh in my last review. Maybe we just ordered the wrong thing. But because I tried one thing that wasn't good. I don't want to try anything else. Was thinking about ordering the Hercules or the big and Little taco. But ordered the fish and chips instead. <br><br>I don't recommend the fish and chips bc it's bland. <br><br>Forgot to add: the time I came it was not busy at all.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LIBEMx16s5-csvWksxeFKQ/348s.jpg", "caption": "Fish and chips. Bland. But good textures?"}]}}, {"review": {"des": "Got a groupon ($10 for a $20 value - jump on it if it's still available!) and boy was it worth it. My friend bf and I had the grilled shrimp taco (which was just okay), the soft shelled crab taco (amazing), the porkbelly po'boy and the kim chi French fries, the entire meal came to a total of only $27, which is a steal. The kim chi fries were tasty if a bit on the salty side and they tend to use a little too much lettuce in the tacos, but the chipotle mayo sauce they use makes up for everything. Great meal, good value, be sure to come hungry.<br><br>Bonus: it's byob!<br>Also note, it's cash only, though they have an atm on the premises.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/z_ZGhoUt_NdOhdN1DM823Q/348s.jpg", "caption": "Kim chi French fries and the soft shell crab taco."}]}}, {"review": {"des": "It's a dive...a total yummy dive. Tacos and such...terrible location, little atmosphere but super yummy food! For cheap! <br><br>I had the Big and Littles taco and the Samurai taco...crush whitefish and a yummy sauce with pickled jalapeño. The special sauce is special..", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/p-OxocYZaU4yW5b8mduM6A/348s.jpg", "caption": "Samurai taco"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/q58MagakKs1Zpz5yOlYAFQ/168s.jpg", "caption": "Big and Little fish taco"}]}}, {"review": {"des": "Omg, this is Kauai island's \"island taco\" good. If you like sashimi grade tacos, skip those and try the (ahi/salmon/combo) poke crunch (it's a wrap). It's super delicious. Loved the sauce (a nice spicey), the crunch layer, rice, sesame seeds, raw fish, and greens, all wrapped in a grilled tortilla. Yummmmmmmmm.", "pics": null}}, {"review": {"des": "Have had this place bookmarked forever and finally had a chance to go. The fish and chips is enormous, but the breading kept falling off so I ended up just removing it and eating the fish as is. The kimchi fish sandwich was great, but I would have liked more kimchi on it. The fries were very good and the prices fair for the portions albeit cash only. Would definitely go back. It was very busy, so perhaps that is the reason the breading was not up to par.", "pics": null}}, {"review": {"des": "While a little pricey, the food is creative, generous, and most importantly delicious! The mango chutney pork is one of the best tacos I have ever had and is definitely a highlight.", "pics": null}}, {"review": {"des": "Love this place. Unreal food and people are nice. The El Pastor burger is unreal. But so is everything  else. <br><br>Great place and must visit. <br><br>Cash only!", "pics": null}}, {"review": {"des": "tried this place a couple times and both were great. I order the bbq bacon burger and cajun fries. The fries are the best cajun fries i have ever come across.  living close to here is going to be dangerous to my waistline.", "pics": null}}, {"review": {"des": "If you're looking for more than just the typical food out there- try Big and Littles. No frills but quality food. The free parking is a plus in the cold weather.", "pics": null}}, {"review": {"des": "If I could give this place 10 stars I would. Everything on the menu is AMAZING. My favorite thing is probably the ahi tuna crunch wrap. Highly recommend for anything looking for a delicious quick meal.", "pics": null}}, {"review": {"des": "So many flavors! Hmmmm fried fix satisfied. The soft shell po boy is juicy :) ($13). The shrimp banh mi po boy was good too! ($9). They piled it high enough for me to drop one of my shrimp pieces on the floor when I eagerly took it to my table :( but the rest was pretty enjoyable. To my Chinese brothers and sisters, the batter tastes like really decent walnut shrimp without the sauce. <br><br>The ahi tuna taco was ok. It was $7.5 each :/ but it satisfied my poke fix. Wrap made in a fried corn tortilla. <br><br>I'm a fan of diners drive-in and dives and I didn't know this place was featured on it! Service was great. Next time I'll try more tacos.", "pics": null}}, {"review": {"des": "My first stop in Chicago had to be big and littles! I will definitely return when I come back to Chicago! I tried their soft shell sandwich and their crab and tuna taco. ALL were amazingly delicious!! I would say my favorite was the crab taco! Pricey but definitely delicious!!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pYdcrcy97nm0RWV2Y4q_nw/348s.jpg", "caption": "Tuna taco"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wmxr65_8tooBivl0fPA1-A/168s.jpg", "caption": "Crab taco"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0W9ykNl8ZSnQqoRlrDTrNA/168s.jpg", "caption": "Soft shell crab"}]}}, {"review": {"des": "Food was delicious. Customer service has been lacking both times I've been in. Doesn't stop me from going back tho, delicious and BYOB!", "pics": null}}, {"review": {"des": "Yummy!!  Kinda dive ish, but clean, friendly and fresh.  2 mile walk from hotel.  You can sit outside.  Small but quaint.  Would go back.", "pics": null}}, {"review": {"des": "Worth the wait here for some seafood tacos. Prices range from $4-7 per taco, but they're pretty good.<br><br>And the truffle fries are amazing. I would come back just for the truffle fries.<br><br>They even have their own parking lot so you don't have to pay for street parking.<br><br>Cash only", "pics": null}}, {"review": {"des": "2nd time here and everything is great again. Short rib tacos this time and they were awesome! Make time at lunch as there can be a wait but is WELL worth it. Keep up the great cooking and I'll be back again!", "pics": null}}]}