{"name": "big-and-littles-restaurant-chicago-2", "reviews": [{"review": {"des": "Amazing, outstanding & delicious!<br>I had the lamb gyro and the flavour was incredible.  Literally one of the best wraps I have ever eaten. Price was $6.99 & worth every cent!<br>The restaurant was clean & a refill drink machine is always nice.  <br>When I'm back in Chicago near wrigley I'll definitely be back.", "pics": null}}, {"review": {"des": "What do you want to eat?<br>What are you in the mood for?<br>\"I don't know\"<br><br>I hate conversations like this but thats exactly how we found ourselves at BIG & Little's Restaurant. We were trying to kill some time before the baseball game and ended up walking over here since it wasn't too far away. The restaurant is very casual and the menu is pretty straight forward. Once we got to the restaurant, we decided on burritos and ordered their Pork Burrito and their Breakfast Burrito. <br><br>Food was served up quick and came out piping hot. I enjoyed my breakfast burrito! But I think it's also incredibly difficult to mess up a breakfast burrito. I threw on some hot sauce and ate it all. I did not enjoy the pork burrito though. It was sloppy, way too wet and made it really difficult to eat. The flavors were a little off too. Not something that I would ever order again. <br><br>It's a fast and casual restaurant. It's a good place to stop by when you're in a hurry and want something filling. The service wasn't all that great since the people working there all seemed bored and didn't really want to answer any questions about the menu. The prices were pretty reasonable though! 3/5", "pics": null}}, {"review": {"des": "Wow, the Delectable Mrs Funk and I were on a record store rendezvous when the tone arm jumped the groove and we found ourselves a day early and a 33 1/3 late. Rats!<br><br>But on this day when our yang was down, our yin was surely up! As we turned to head back to Ms Baseball Funkettes' Wrigleyville party barn, the Yellow and Blue of Big and little's, on our DDD \"to do\" list for some time, stood smack dab our way.  You know, when God closes a record store he opens a pork belly Po' Boy shop... or something like that.<br><br>Anyway, it was well after the lunch hour, so business was slow, as in we were the only folks in the joint. We decided to split a Spicy Pork Bahn Mi Burrito  - Seared shredded pork & pineapple, american swiss cheese, cabbage, cilantro, pickle red onions, cucumbers, carrots, pickled jalapeños, spicy thai sauce. $6.99 & bottomless diet Coke $2.39.<br><br>Bottom line, it was everything Guy said it was and more.  From this day forward we will hop the Red Line at Addison and get off one stop south... in FLAVOR TOWN. Meet you there!", "pics": null}}, {"review": {"des": "Still good for a quick but hearty bite. Love the ahi tuna taco and the samurai! Truffle fries are very good as well.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BewcDadOugNsiNHwjlS8vQ/168s.jpg", "caption": "Shrimp po boy"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KeS0oSJRFYk6i2w_OZdwGA/168s.jpg", "caption": "Pork belly po boy"}]}}, {"review": {"des": "I wish I could order one of everything off the taco menu, but my stomach wouldn't allow it! After eating lunch at Murphy's Red Hots, my boyfriend and I wandered over here for a 2nd lunch.<br><br>The lights reflected onto the menu, which created a bright glare and made the menu difficult to read. When we were able to see the menu, we ordered the shrimp taco and Japanese beef short rib. I liked the shrimp taco more, which contains grilled or fried shrimp (I chose grilled), lettuce, tomato, special sauce, cocktail sauce, lime juice, and cracked pepper. You can't really taste the citrus too much. The Japanese beef short rib was a bit too sweet for me. It has shredded beef short rib, pickled jalapeños, onions, queso fresco, and Samurai sauce.<br><br>***NOTE: It looks like the River North location is more expensive than the Lakeview and Wicker Park locations (i.e. $4.00 vs. $3.29 for the Samurai taco.) They also have a rewards program, but you have to order online. There are Groupons available for $12.50, and you get $20.00 worth of food.***", "pics": null}}, {"review": {"des": "I paid for a pork belly po boy with double meat and got this. Judge for yourselves, although this clearly isn't double meat.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ozXBVVUVyRij3_qhhZe92Q/348s.jpg", "caption": "It was supposed to be a pork belly po boy with double meat, as you can see, I paid for something I didn't get."}]}}, {"review": {"des": "Freshly dipped plump filets in perfectly seasoned batter then golden fried crispy outside and juicy inside with skin-on potato fried. Served w tarter sauce & lemons. A real hearty portion (I ate half) Best fish n chips around!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZQtqtHIpDZPp7f1pzBboEA/348s.jpg", "caption": "Delicious fish n chips Best around. I already ate half"}]}}, {"review": {"des": "It's a quaint little place with roomy seating and bright walls. My family and I came here and we all split various tacos and po boy sandwiches - I definitely preferred the tacos more because of the ratio of protein to tortilla. Everyone was happy with their food, and the only thing is that the  place was a bit messy with water on the floor and lots of crumbs on the table. If you're looking for a quick bite with various options, this place it pretty good!", "pics": null}}, {"review": {"des": "We came here to use a Living Social deal cause its a convenient location (close to home and to our hangout area). Easy street parking. Short walk to bus or train. <br><br>They have outdoor seating and you can watch a game inside. Not a huge restaurant but huge hearts. The guys working are awesome! Super nice and PATIENT with my silly ass who wants to try everything but not spend 100 on just me by answering all my questions. <br><br>The head guy who's name I've forgotten, not sure if he's the owner or manager was super cool. He helped me narrow it down too many tacos for two people! We got so much food cause I wanted it all. God bless my hubby that puts up with my \"I wanna taste this and this and that\" addiction especially at a new place. Don't worry. We're gonna be back cause I wanna try the crab. That's gonna be fun!<br><br>Everything was awesome!!! From the mahi mahi, ahi tuna, spicy Thai taco to the burger for my non-pescatarian hubs. I don't even remember all the items we ordered just that they were wonderful. <br><br>They just need to add a simple dessert to their menu cause we love our sweets.", "pics": null}}, {"review": {"des": "If you haven't been to Big and Littles yet, you need to get on it! If you like kimchi, then you must get the kimchi fries.  They are big, so it's better if shared with someone.  The phil fries are also great if you don't have a huge appetite.  My favorite taco is the samurai (for fish) and either of the short rib tacos (for meat), but I have had just about all of them. They are all great. Oh, and it's BYOB!", "pics": null}}, {"review": {"des": "We had a quick but very delicious lunch. I had a shrimp poboy. Delicious!! Bread was lightly toasted. The large shrimp were cooked to perfection. Loved the sauce. My partner had yummy fish tacos. The portions were big enough that sides weren't needed. <br><br>The only reason they didn't get 5 stars is. The place needed a \"clean up.\"  It wasn't very busy so there wasn't a reason to have dirty tables and floor. As we were leaving one employee decided to get busy wiping off tables. <br><br>Food is unique and flavorful. We will return!", "pics": null}}, {"review": {"des": "Pretty affordable little spot that has an interesting seafood-forward menu. It's counter service, fast food-type service, but they have seating around. The menu was very big and diverse! I might come back here to give it another shot. My friend and I got the shrimp and soft shell crab po' boys. While I LOVED the fried shrimp and softshell crab, the other parts of the po' boy were a little lacking for me. Wilted lettuce, average white bread, boring sauce. The crispy beautiful seafood would have fared better in another delivery method. Maybe next time I'll go for a taco or burger instead - but their menu is just interesting enough to make me want to return, despite the average first experience.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5nQ6WMe67cV4ndUUVK6emg/348s.jpg", "caption": "Shrimp Po'boy"}]}}, {"review": {"des": "These guys deliver food to my job almost on a weekly basis, and from what I tried (mainly their unique take on tacos) I thoroughly enjoyed their style. Upon waiting for a show at the Vic, I stopped by Big & Little' s brick and mortar spot and get a feel for the rest for their menu.<br><br>As most people know, B&L sell a lot of different fast food items from burgers to tacos, but when I saw they make poboys, I absolutely had to have one. I picked the shrimp version, and while it wasn't as delicious as ones you'd find in NOLA, this satisfied me enough. <br><br>Definitely a spot to go if you want something quick to eat, but also something delicious and original.", "pics": null}}, {"review": {"des": "While looking around the Lakeview area for a potential new living situation, my boyfriend and I stumbled across BIG & little's Restaurant. You walk in and it doesn't look like much but once you look over the menu, you realize this place means business.<br><br>It took me quite some time to figure out what I wanted to order because everything looked so interesting. From Poke Tacos and Po Boys to conceptual Burgers and Soft Shell Crab Sandwiches. The Soft Shell Crab intrigued me the most and I was certainly not disappointed. My boyfriend got the chorizo burrito and ate most of his; he said it was pretty good but that maybe he didn't order correct. Personally, my sandwich was so delicious I would love to come back and try their \"best sellers\": the Poke Taco and the Ahi Poke Crunch Wrap. <br><br>If you're in the neighborhood, check this place out!", "pics": null}}, {"review": {"des": "Pros: Stopped for a quick snack before a night out in Boystown. Had the tuna poke taco, it was fresh and spicy. Super quick service. <br><br>Cons: Pricey for the size of the taco, the locale wasn't well maintained, could use a little sprucing up. <br><br>4 stars for convenience, flavor, and speedy service.", "pics": null}}, {"review": {"des": "I cannot say enough positive things about this place! They really are a jack of all trades! They do so many things well; from gryos, to poke, bbq pork, and fried pork belly, everything I've tried is delish! <br><br>I particularly love the bbq pork sandwich, poke wrap, poke taco, and gyro wrap. Also, everything is so reasonably priced as well! They are BYOB, and I'm not sure how I haven't taken advantage of that yet! I find myself always craving this place, and there is something for everyone!", "pics": null}}, {"review": {"des": "First time at this location.  Had to try the Ahi poke crunch wrap for the uniqueness! This thing is HUGE! I wasn't picking up on the taco bell terminology and was expecting a burrito shaped wrap ... Oh no this is a legit crunch wrap but triple the thickness of the Bell and stuffed full of greens, rice, crunchy corn chips and tons of ahi tuna, plus delicious sauces. Somehow they grill this thing up without cooking the tuna! Construction on mine wasn't 100% solid but I managed. Definitely not a light meal but oh so good. <br><br>I like that this place has adventurous, unique options plus basics. So my 5yr old can enjoy a hot dog while we chow on ahi and soft shell crab! Fish and chips is very good as well. <br><br>Small space but seats at least 25 people if needed. Staff was friendly. Service wasn't super fast but reasonable.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OSuFka5ZlrZMltqDuhSang/348s.jpg", "caption": "Ahi poke crunch wrap ... just try it!"}]}}, {"review": {"des": "I'm knocking a star off for mediocre service...the girl at the register wasn't especially friendly and didn't seem like she enjoyed working there.<br><br>That aside, the food ROCKS! I ordered two po boy sammiches to go and they were freaking awesome!<br><br>The special sauce on the po boys really makes the sandwich tasty.<br><br>The ingredients are fresh, and the sandwiches are assembled nicely.<br><br>I highly recommend the pork belly po boy!<br><br>The meat is tender and tasty.<br><br>I'm surprised there isn't a line out the door at all hours. <br><br>Maybe there will be after more people read this review?<br><br>Go check this place out!", "pics": null}}, {"review": {"des": "Updating my previous B&L review, due to the Wicker Park manager Ed's handling of the situation.<br><br>-----<br>It's true that B&L's worker inappropriately begged for tips and asked me not to tell anyone, made weird comments about my s/o paying for the meal, then harassed me on social media, and I no longer felt safe stepping foot near B&L's... BUT I'm happy with how B&L managed the situation.<br><br>While I never heard directly from the B&L Lakeview manager (where the incidents happened), the B&L Wicker Park manager, Ed (who handles the social media), reached out to me many times. Ed is a service industry owner's dream, which is hard to find--and I think that should be recognized. <br><br>Ed handled the situation not just appropriately but very well. He is a problem solver with polished manners. He proactively took ownership of the situation, followed up quickly, treated the issue seriously and addressed it. He never once disbelieved me or made me feel even worse. Their worker is no longer there--B&L customers are safe to hopefully have a positive food experience. <br><br>Having firsthand experience of B&L's upper management, I am confident that as long as Ed is there, B&L customers will be taken seriously and their situations will be made right. More businesses need managers like this. B&L would do well to keep him on forever, and he deserves a raise and bonus.<br><br>I haven't returned to B&L since the last incident, but because of Ed's service, I will eventually give it another shot and grab some more tuna sashimi tacos.", "pics": null}}, {"review": {"des": "Love big & littles. Their variety is something that keeps me coming back, and even with the wide menu, the quality never dips. It's such a great place for comfort food and I hope they keep opening spots across chi town so that i can always find one close by.", "pics": null}}, {"review": {"des": "Seating isn't ample given the dinner rush they seem to get. They do inform you how long it may take to get you your order. We liked the Mexican short rib taco. I liked the boy crab taco and the ahi tuna taco in a hard shell too. Would get all 3 again.", "pics": null}}, {"review": {"des": "Big and little's never disappoints me. There food is always so tasty and priced well. The shrimp fried  taco and the Mexican taco are now I'm new favorite. Both of them had their own delicious flavors. The tacos it only were so good but they weren't small either their proportions much better than most over priced tacos. For both of my tacos, I paid around 6 dollars all together for both! This is such a good deal and it was really worth it. They also have many other options to pick from. <br>The staff is also very friendly which made my experience even better!", "pics": null}}, {"review": {"des": "This place was packed for a Friday night, which always means quality food! The pork belly po boy was amazing, as well as the Zeus burger and most of their tacos! Fast and friendly service for how packed the place was.", "pics": null}}, {"review": {"des": "Love this chain but first time to this location. A little more cozy and hip then the Downtown location. Ordered the Ahi poke crunch wrap (this time with greens instead of rice). Awesome. Love the insane amount of Tina for 10.99, sauce, ginger, greens and CRUNCH covered in a grilled flour tortilla. Mmmmmmm. We also shared the new blackened whitefish taco and samurai taco. Couldn't resist the truffle fries. 1:30 on a Sunday and not was busy already. Staff are super laid back, almost too laid back but that adds to the atmosphere. Still a fan!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jL-Msh-qMSt7dvxaZKPGjg/348s.jpg", "caption": "Ahi Poke Crunch Wrap"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fwlge_ZoZW09AdMM3VE8Vg/168s.jpg", "caption": "Samurai Taco"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/avdVlV1NMPFsGu9dFibmWA/168s.jpg", "caption": "Half the Ahi Poke Crunch Wrap with greens instead of rice"}]}}, {"review": {"des": "Had the Hawaii 5 - 0 (with teriyaki flavor) and El Pastor (with pineapple and pork belly) burgers and both were just awesome. <br><br>The pork belly (which is deep fried melt in your mouth fatty pork) po boy was splendid. As I ate this sandwich, I committed to a one hour ride on my mountain bike - so it was a guilt free experience. <br><br>I believe that I've had everything on the menu so this 5 stars is way overdue.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AjdmNly7eqOU24cOLTrfhw/348s.jpg", "caption": "Pork belly po boy"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/n2Zl-8Lan4BaDgxS9yQb4w/168s.jpg", "caption": "Hawaii 5-0"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5oKsJz2hNniB0lwt0TMU3A/168s.jpg", "caption": "El Pastor"}]}}, {"review": {"des": "Fantastic vibe, chill counter people who are happy to answer questions. Quickly served and BYOB. Couldn't ask for a better adventure to flavortown, felt at home being surrounded by Guy Fieri paraphernalia. Soft shell P.O. boy was def photo worthy, but a bit bland. Kind of just tastes like bread inside bread. Could have used some old bay.", "pics": null}}, {"review": {"des": "This place was great! A much needed break from the bars in Wrigleyville, the fine fried food at BIG & little's was perfect to soak up some of the good times. <br><br>I had the Phil's Fries and the Pork Belly sandwich. They were both delicious. The truffle fries here were truly a star and the pork belly was fried up goodness in a heaping portion. I would have loved a few more veggies or sauce for the huge portion of pork belly. The bites with the pickle, sauce, and lettuce along with the pork belly were definitely the best. In fact, just thinking about those bites makes me hungry!<br><br>I hope to go back sometime when I'm in Chicago!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/V7UZGe-yvn6oRCr9x7hJJQ/168s.jpg", "caption": "Phil's fries"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XTW35hdqMBnjE-cTrFVDvw/168s.jpg", "caption": "Pork Belly Poboy"}]}}, {"review": {"des": "This is a great little divey spot that's easy on the wallet and gives a nice variety of good things to eat. They even have a little outdoor area next to the restaurant that is nice seating. <br><br>Their truffle fries are particularly amazing. I don't know what they do for the extra 10 cents vs the regular fries, but I'd take that buy up every time. <br><br>Their sandwiches are solid and their tacos are excellent. A little messy to eat, but that's what you'd expect at this type of place. <br><br>Really appreciate the simple menu and ordering process. Keeps things moving and people happy. <br><br>Great if you need to grab something quick on your own or with a few friends. Nice quality food and a little something different that's still a great price.", "pics": null}}, {"review": {"des": "Definitely a Chicago staple. This place is down the street from me and has all the food you could ever want. I got the Hawaii Five-O Burger and loved it. They also have tacos and other awesome eats. The service does run a little slow, but it's still a great spot if you're looking for a fun place to try. I'll be back soon!", "pics": null}}, {"review": {"des": "Get the fish and chips!! My absolute favorite thing on the menu. The chips are alright but the fish is absolutely delicious. Super crispy and melt in your mouth. If that was the only thing I got I would probably have given them 5 stars. <br><br>We also got the soft shell crab poboy and a shrimp taco. The tacos were okay - too much filling in too small of a tortilla imo. The soft shell crab poboy was honestly pretty bland and had too much bread. <br><br>I also took off a star because the service was so slow. We probably waited 30min for our food and we came at 1:30pm on a Saturday and the restaurant wasn't too busy. I can't imagine how long the wait would be during peak times.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mj6vBf5N9T7uWfusQ5TRHw/348s.jpg", "caption": "The spread"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/G_YsvAhebd_wBQFRHW4NAQ/168s.jpg", "caption": "Outdoor seating"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NzkkBRDwqKXIzT942ypPqw/168s.jpg", "caption": "The spread"}]}}, {"review": {"des": "I usually go to the wicker park location , which is a little bit better, but decided to stop in this location around 10pm. <br><br>From the moment I started to order, the guy behind the cash register was being extremely inpatient and rude. I asked a question about the burger and he told me to read the menu.<br><br>Then after being berated by him, the food finally comes out and they forget a taco I ordered . When I let them know-  they made me another , which I later found out was the wrong thing.<br><br>And just in general extremely average food comparable to Taco Bell.<br><br>Maybe it was just the time I went in at. Because this place has 4 stars. But I will personally never go back to this restaurant", "pics": null}}, {"review": {"des": "I was heading to Chipotle with my roommate and this corner joint caught our eyes on the way over. I kept telling myself I couldn't possibly eat Chipotle for the third time that week so we ducked into BIG & little's. Lemme tell you the place was smokier than my hotel room the time we left my chain-smoking Grandma back while the rest of my family attended a Wisconsin Dells waterpark. <br><br>Seeing that I forgot my gas mask at home we agreed we had to get the food to-go. Being the MASSIVE gyro fanatic that I am and considering I was really craving a burrito I settled upon some gyro burrito creation that turned out to be absolutely delightful. Fingers were in the fries until they were gone and my pescatarian roommate said his ahi tuna thing was pretty good.<br><br>Apparently this place has been featured on that flame shirted spikey hair guy's cooking show. The character of one of the funniest GIFs of all time btw. I'll be prepared for the smoke-out next time! might even dine-in if I can decide on one of their menu-options that is comprised of like 9-10 different cultures and solo side  ~~TRUFFLE~~ fries a little quicker.<br><br>go check it out fo yourself", "pics": null}}, {"review": {"des": "A pretty typical diner in food-style ways. Lots of deep fried indulgences. The reason it is NOT typical is when you take a look at the variety of the menu. There are tacos, burgers, sandwiches, sides, and breakfast served all day. And the options include a seafood and poultry and pork. <br>The restaurant had a very casual vibe. You order at the counter, and then choose a table. Your name is called when your order is ready, and you go get it to bring it to your table. The tables have some condiments and a roll of paper towels instead of a napkin holder. There is lots of unfinished wood throughout, making it feel sort of cabin-y almost. (Maybe also because it was snowing outside when I went.)<br>I got a bunless Egg Burger and Truffle Fries -- both very good. Both with no added gluten or dairy. I very much enjoyed both of my food items. The truffle fries were especially rich, and so I didn't eat as many as compared to plain salted fries. The size of the side of fries I would say is good for 1-2 people. My boyfriend got a Samurai Taco and a Pork Belly sandwich (which is what Guy Fieri got when he went there), and he loved them both. <br>The food is cooked in soybean oil. Just something to be aware of for anyone with legume sensitivities.<br>Overall, it was good. I don't know that I would go back, but that is mainly because of my personal dietary restrictions and there is not a whole lot of grain-free, dairy-free stuff. But great to try and to indulge. Cozy atmosphere. And really great customer service at the register. We had lots of questions about the menu and the cashier provided lots of help.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0dLyH3wWDiKUDqv-qxEsVw/348s.jpg", "caption": "Condiments and paper towels on table"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yLwJQSyJugLYprpoTp6aUQ/168s.jpg", "caption": "Our food: Pork Belly Po Boy, Samurai fish taco, Truffle fries, and bunless Egg burger"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4JcRPq3cn6GtPMTTTudGjg/168s.jpg", "caption": "View from restaurant entrance"}]}}, {"review": {"des": "Good place to grab a quick bite in a chill college-restaurant feel atmosphere. The menu is simple with tacos/burgers/hot dogs/fries but each category has good options. <br><br>Hawaiian burger [8/10]: Solid simple burger. Loved the yumyum sauce. <br><br>Soft shell crab po boy [9/10]: Crab is fried perfectly and there's a decent amount of meat too.<br><br>Ahi tuna tacos [7/10]: Only giving this a lower rating because the value ($4.99 for a tiny taco). The tuna was delish but it would easily take 4/5 tacos ($20-25) to make a meal out of these guys.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eXf6Qr5oBidd-2fd6YWOCA/348s.jpg", "caption": "Hawaiian burger"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UeAb0O3vov3XY0A9pLiVYA/168s.jpg", "caption": "Soft shell crab po boy"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/h2zNYedDP-ehYAOSr_SHwA/168s.jpg", "caption": "Ahi tuna taco"}]}}, {"review": {"des": "Walked in 10 minutes after they opened and the workers looked at me like, \"What are you doing here?\" And i agree with others' assessments that the tacos are oversauced and not good. My breakfast tacos tasted mostly like cold lettuce. I couldn't even taste the eggs.", "pics": null}}, {"review": {"des": "My first trying BIG and little's was an amazing and satisfying experience, a significant difference from my recent visit here that could be described as just good. Then I realized it was because I was intoxicated my first time around and all the breaded, deep fried food was the perfect pairing. For some people the food here can be a bit too bread heavy and sometimes soggy.<br><br>However, a couple of items do stand out for me. The clear favorite here is the pork belly po' boy and the kimchi burrito comes in at a close second. After that, from the crab po' boy to the tacos, everything is fairly mediocre. Would probably swing in to try some of the burgers if I'm in the area again.", "pics": null}}, {"review": {"des": "Coming from a Korean background, I have tried many kimchi fries in my day. Kimchi fries should have a nice tang with a hint of sweetness. This had that and more. Laying atop of a supple bed of fries, the kimchi just compliments saltiness if the fry. Boy these are some good fries.", "pics": null}}, {"review": {"des": "Double cheeseburger for $10.50 (no fries included). I'm expecting something killer...what I got was an ordinary thing with average-grade meat, pale tomatoes and iceberg lettuce. I like the concept -- cool, neighborhood joint with walls painted in wild colors and a relaxed vibe -- but if the food isn't good, why bother?", "pics": null}}, {"review": {"des": "If you want fast food and a variety of tacos/burritos/sandwiches, come here. Their tacos are reasonably priced with $4-5 per taco with a portion comparable to Big Star. This is a popular place for late night fried food but there is limited seating available. I'd also recommend getting the groupon that saves you $8!<br><br>I had the japanese beef short rib, the mahi, and the samurai tacos. All were great but not memorable. The japanese beef short rib literally was a piece of meat and sauce on a small tortilla. <br><br>I also had the soft shell crab po boy because of all the reviews. This was underwhelming. The bread was plain, the crab was not seasoned and was 90% breading, Overall, this meal would not be worth it without the Groupon.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/B1wJQ27JeNU12CUxXEqsxg/348s.jpg", "caption": "Crab po' boy"}]}}, {"review": {"des": "fresh food cooked to perfection<br>they system stoped working so they could not charge cards. We had just a hundred dollar bill and they did not have change so offered us a free lunch.<br>what a great service example!", "pics": null}}, {"review": {"des": "Pork belly po'boy - I LOVE FATTY, DELICIOUS, MELTY PORK BELLY. This one is decent. I like the maple syrup and hot sauce. And they pile on the 'meat'! Yum yum. Extra pickles! 3.5/5<br><br>Cajun fries - basic and salty. They're decent and go well with the po'boy. 3.5/5<br><br>My boyfriend has gotten the shrimp po'boy and it wasn't that good. It tasted a little weird. 1/5<br><br>He has also gotten some tacos. They aren't worth it. They don't give much on the tortilla, or maybe we're just used to Del Seoul's hearty serving. If you're hungry, get a po'boy and some fries. The tacos won't do much for you. 2/5<br><br>This place is decent. You can get a groupon deal. They always seem to be having them. <br><br>If you want something fatty as all hell, come here.<br><br>They aren't getting four stars because it isn't GREAT, it's GOOD. When I crave pork belly, this is a decent option.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vGPbhLf0AdAdNifVX99-NA/168s.jpg", "caption": "Pork belly po'boy"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WnRH8uZnZZiBa72mrZjqCA/168s.jpg", "caption": "Pork belly po boy, cajun fries, three tacos"}]}}, {"review": {"des": "I love me some Big & little's. The only reason I'm giving this location 3 stars is because I've been to the Lakeview location (this one) and the Wicker Park location multiple times and I'm about 95% sure that this location skimps on the meat. The Wicker Park location stuffs the tacos to the point where you can barely close the tortillas around each other -- whereas this location...doesn't do that.<br><br>Nevertheless, the tacos are amazingly flavored. I've had all 3 of the beef short rib tacos multiple times and they're all delicious in their own right.<br><br>I like Big & little's because it isn't fussy and there's no pretension (also, the fries...). You go in, you order your tacos, and you wait (and wait and wait), and then you inhale them without breathing. Truly it's a special experience.", "pics": null}}, {"review": {"des": "I've been to Big and Littles a few times, but I feel compelled to write about this particular visit because of the service.<br><br>SERVICE: I had an usually large order, I was ordering for two hungover/ greedy individuals. I ordered two poke crunch wraps along with an assortment of tacos and po boys. So When I got my order, the bag was pretty full. I kind of half checked inside to make sure everything was there and kept it moving. <br><br>Once I was outside, I realize I should have really checked because I was missing a crunch wrap. I started to turn around, thinking about how I would convince them that when I checked in the restaurant I missed the wrap and wasn't trying to scam them out of a free poke wrap. Luckily for me, I turned around to a B&L's employee yelling my name and trying to flag me down. We walked back to the restaurant and another B&L employee was rushing out the door with the crunch wrap in hand. Lol. <br><br>They both apologized profusely and handed me the wrap. I appreciate that kind of dedication. <br><br>FOOD: the food here is obviously amazing. Just read any of the other reviews. I personally suggest to samurai taco if you like fish tacos, and the lamb taco if you like middle eastern food. <br><br>The fries here are well salted and very flavorful. <br><br>The poke crunch wrap was everything I imagined and more. And according to my boyfriend, the soft shell po boy is incredible too.", "pics": null}}, {"review": {"des": "Great for if you're looking for some good, greasy fast food. I've been to Big and little's before, but this was my first time at this location.<br>It was featured on Guy Fieri's Diners, Drive-ins, and Dives; I definitely think it fits the dive category. So do not expect much in terms of seating and atmosphere. <br>The food is what it's about.<br>This time I got the soft-shell crab po'boy and truffle fries. Both very good. The soft-shell crab is fried beautifully on sub-size bun with lettuce and mayo. My one complaint about the po'boy is that it looks to be the same insides as the sandwich, but with more bread and costs more. So if I go for the soft-shell crab again, I'll probably get the sandwich. The truffle fries are GREAT! you get a decent amount, definitely enough to share with someone if you get your own entrees. They are not the most crisp fries, but they have a great truffle flavor!<br>They also always seem to have a groupon going to get a discount on your order. Save a couple bucks.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RRWPCBB5r3GEQsXB8D0UjA/168s.jpg", "caption": "Soft shell crab po' boy"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TrjCWqxNAGMlb4H2uxLCwQ/168s.jpg", "caption": "Truffle fries"}]}}, {"review": {"des": "Just okay. Everything was super hot and made to order, but I agree with another review that portions are small. I got a grilled mahi, mahi taco and my boyfriend got some other taco. My taco was full of lettuce/garnish and I had to dump most of the garnish out. <br><br>We thought if we each got a taco and split the fried crab sandwich we'd be good, but I was still hungry. Had to order the Zeus burger after we were done too. The burger was decent but really messy. I would ask for EZ tzatziki sauce. <br><br>Outside looks cool, color scheme is cool on the side too but furniture is starting to look like it's falling apart. Also the menus should be reprinted on fresh paper.", "pics": null}}, {"review": {"des": "Was there this week got the best seller Ahi Poke Crunch - Highly recommended. I was disappointed the secret menu of Foi Gras fries is no more at the Belmont location", "pics": null}}, {"review": {"des": "Came in around 8pm on a Friday night and the place was packed. Thankfully a group was leaving so we snagged their table. The line to order only took 5-10 mins and the food took another 15. My group tried a shrimp po boy, caujin fries, the Zeus burger and a few kinds of tacos! All were really good. Reasonable prices too so Big and Littles is worth checking out if you're in the area!", "pics": null}}, {"review": {"des": "Going to have to come back at least 6 times to eat everything I want too. Soft shell crab delish looks as appetizing as it looks. I highly suggest the El Pastor taco. It's maybe the best taco I've had in years?!", "pics": null}}, {"review": {"des": "Huge selection! Hard to pick, but went with the bang mi burrito and my husband got the lamb gyro burrito and we split and order of truffle fries. We didn't need the fries (the sandwiches were plenty enough food) but couldn't resist-they were delish (but salty-which was right up my alley). I liked the banh mi best and my husband liked the lamb gyro the best.. so idk I guess I suggest get both! Because they are both great", "pics": null}}, {"review": {"des": "My partner and I needed to grab a late lunch, and this place hit the spot. The truffle fries were out of this world awesome. I also ordered the softshell crab Po Boy, which was pretty good, but a little heavy on the bread for my liking. The pork belly Po Boy, though was AWESOME. I mean, take something fatty and delicious as is, throw it in the fryer, and put it on some bread with a good sauce? Yes please. The only thing that disappointed me was how sticky every surface seemed to be. I love a good dive, and we likely came just after a lunch rush, but I think the tables could have been cleared a little better - it only slightly took away from the experience and won't prevent me from a return trip.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MkwrtLle9aYCR3cW_4z9wg/348s.jpg", "caption": "Soft shell crab Po Boy"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fZydZQ6xX4ys72TWusEEfg/168s.jpg", "caption": "Phil's fries"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/liQ66nyXr5Cl1PcnSAYVUg/168s.jpg", "caption": "Pork Belly Po Boy"}]}}, {"review": {"des": "Casual vibe, great service and phenomenal quick eats. The ahi poke wrap was by far my fave. My boyfriend got the ahi tuna taco, thai taco, and we shared the truffle fries (would pass on those next time). He ended up getting an ahi poke wrap too cause mine was so good!", "pics": null}}, {"review": {"des": "Love! Simple, quick, well priced, tasty. This place just makes me happy. Shrimp and mahi tacos are my favorites, although you really can't go wrong with anything on the menu. <br>I've had amazing service and meh service - but nothing to detract from the main reason for coming back again and again, the foood!", "pics": null}}, {"review": {"des": "They are typically pretty good but this trip was just plain bad.  The merkts cheese was very thick and not tasty.  The worst part is we wait a ling time for food and the tacos come cold.  Meat and tortillas both cold.  Just not good at all.  Extremely disappointing.", "pics": null}}, {"review": {"des": "During a recent visit they had the most amazing Sushi Burrito on special. Imagine the Taco Bell Quesarito, but with quality tuna, rice, greens, the best spicy mayo, a tostada layer for crunch, all wrapped in a tortilla, looking like a giant hockey puck. It was only $9  !!!<br><br>The -1 star is for the Smokey atmosphere, shystey bench seats, and horrible cash register gal who was sipping her fountain drink while the line was to the door, often stepping away from the register. It was a good 20 mins before she took our order, and another 25 hangry minutes for the food... <br><br>We ordered a fish taco, pretty sure they gave us fish. It's cool that they serve breakfast options all day.", "pics": null}}, {"review": {"des": "Yummy yummy fish tacos! They have lots of inventive and creative combos, with what seems like southeast asian flavor influence. I love the Samurai, the Spicy Thai, and the Ahi Tuna Poke (which comes in a hard shell!) Their softshell crab po' boy is killer too. They also have other non-taco things like fois gras fries and burgers etc, but I've always stuck with the tacos.  There can be a line, but they move things along pretty quickly.<br><br>It's also BYOB so it's a fun place to grab a casual dinner and have drinks.", "pics": null}}, {"review": {"des": "I don't actually know why this place is called this, but I'm thinking it's because they pack BIG flavor into little tiny tacos.<br><br>This time, i actually got a breakfast sandwich (the smoked salmon) but silly me, I had just come from the gym and this was not enough. It was tasty, rich, and disappeared in approximately 35 seconds. Also, I think it was $5.30. And totally worth it.<br><br>This place was also buzzing with activity at lunch time on Sunday - not super crowded in the restaurant (though not empty), but a lot of people must place orders for pick up and delivery. I went back in line and ordered another taco - one of the breakfast tacos (can this catch on more, please?) and had to wait behind 4 people ahead of me in line.<br><br>That was enough to fill me up (with the aforementioned breakfast sandwich) and I think that was another $2.<br><br>~$7 for a meal. Solid. Easy. Casual. Good job B&L.", "pics": null}}, {"review": {"des": "BYOB and a 15 minute walk to Wrigleyville! <br><br>Everything I tried was delicious-- cajun fries, banh mi taco, samurai taco and the Japanese short rib taco. I had a couple bites of the shrimp banh mi \"po boy\" and that was great, too. The batter on their fish and shrimp is perfect, nice crunch and not too bready. My boyfriend and I were stuffed for ~$20! Can't be beat.", "pics": null}}, {"review": {"des": "Soft shell crab and poke tuna are awesome! It's so good that I have come twice before I left Chicago.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KoG0Bobbf2EELUdrtm5LtQ/348s.jpg", "caption": "Soft shell crab and poke tuna are awesome!"}]}}, {"review": {"des": "Ok so every time I come here, I walk out amazed a little more than the time before. <br>The staff is always so attentive and helpful, they always have an added suggestion to spice up your meal. Now the food!!! Everything is good the flavors are bold and creative. <br>The tacos, bomb!! The sandwiches, dope!!! The burgers, amazing!! Get you some truffle fries and fry an egg on top of errythang!!! Boom a little slice of Chicago heaven!!<br><br>Now, can we stop and discuss this new poke wrap. Cause I literally almost slapped myself it was so dam good!! I didn't share and almost choked inhaling it as quickly as I did..... <br>definitely worth it!", "pics": null}}, {"review": {"des": "YUM!! Finally made it out to this Diners, Drive-Ins and Dives episode. Really surprised with the amount of seafood options on their menu and that they have breakfast items all day!<br><br>The gal at the cash register was super sweet as she suggested the types of tacos or po boys that are most popular. If you're into Groupon - grab the $20 worth of food for $12 and you can up the items ordered. <br><br>My choices today were TACOS - the Samurai, Japanese short rib and the pork. Samurai was a my favorite! A piece of fried fish with sauce and jalepenos, short rib came second which was juicy and tender but last was the pork, as i'm not a fan of sweet sauce on my meat. My eating companion grabbed the pork belly po-boy and it was HUGE!", "pics": null}}, {"review": {"des": "Very good tacos! It's a very casual place, but I really liked the food! You walk up and order and then pick up the food at the counter when it's ready. There's a pretty big menu", "pics": null}}, {"review": {"des": "Whether it's for brunch, lunch, dinner or late night snack this joint is soooo good for my belly! The pork belly po'boy is my absolute favorite in the whole wide world! Generous portions and truly a cheap eat. Taste and food quality always consistent.", "pics": null}}, {"review": {"des": "Stopped in after a night of light drinking after watching the Cubs game and this place was packed at 11:30 pm. Its small, and there were not enough tables for everyone who wanted one at the time. Also, I am not sure the last time the place was cleaned. I think they had a rough time wiping down the tables after people left them because there was food all over the tables and floors.<br><br>The line to order was long, but just enough time to figure out what we wanted. I got the soft shell crab po boy and truffle fries and my friend got the Hawaii Five-O burger. We found a table to sit at and waited about 15 minutes to get our order. <br><br>Soft shell crab po boy was decent. I think the crab was a little too thickly battered but the bread was on point. I like the spicy mayo they put on it, but it overpowered the taste of the crab. All I could really taste was that mayo. Truffle fries were mediocre. They were cold and limp and tasted like they were fried in old oil. Truffle flavor was there, but spoiled by the old flavor.<br><br>My friend said her Hawaii Five-O burger was okay. It was too salty. Also, maybe we didn't read the description right but the burger was spicy. Must have put chilis in it.<br><br>If I'm in the area again, I might try it when they're not so packed and yelling to customers they can't place orders after midnight, even if you're already in line.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/r-boro0D09kmCXclVFOidA/348s.jpg", "caption": "Soft shell crab po boy"}]}}, {"review": {"des": "I really like big and littles. They've got a bunch of great ideas and they execute them well. Most places either don't have interesting ideas or can't pull them off but this joint does it at reasonable prices and with a complete lack of pretension. Shoutout to Big and Little. Salute.<br><br>Anyways, I loved my softshell crab sandwich and at $8 the price was eminently reasonable. The pork belly sandwich was also great. I thought the belly was a bit too tough but it chews down well with the bread. I want to try all their various gyro ideas since I have a lot of gyro ideas of my own.", "pics": null}}, {"review": {"des": "Very cool, quick, greasy food. The tacos are A-1 and the blue crab P.O. boy was delicious. Would definitely come back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hGdUP9UT9_rj2ZesD1rnbA/348s.jpg", "caption": "Z"}]}}, {"review": {"des": "The workers here are so rude. I've been here several times and none of them greet me or say thank you. I always say \"thank you so much and have a great day\" and they don't respond. Extremely inconsiderate workers. I hear them talking about customers and laughing at them. They're very mean here. The food isn't even that great either. If you don't want to be made fun of by the workers, go down the street for a burger where they're polite.", "pics": null}}, {"review": {"des": "Sooo good-  we came across this restaurant when going to the Wrigley tour through yelp.  It was a nice 5-10 minute walk from Wrigley through residential areas.<br><br>I got the soft shell crab sandwich after seeing Yelp reviews , and for someone who doesn't like sandwiches, I would eat this over and over again.  They were also generous with the fries and sauces (I asked for ranch), and you can get refills on your soda also.  <br><br>The value for the price i felt is fair (typically is super important for me), and the service was decent. <br><br>Would definitely recommend, and I can definitely see why it has such high ratings.", "pics": null}}, {"review": {"des": "My last stop on my Chicago food adventure :(<br><br>Fortunately I ended it on a high note by coming here. They have an awesome selection of different seafood items as well as non-seafood for those picky eaters. <br>I opted for the ahi taco and shrimp po' boy. <br><br>Ahi taco was raw tuna with an Asian dressing that tasted of hoisin and sriracha wrapped up in a crunchy taco shell - 5 stars! I should have ordered more of these.<br><br>Shrimp po' boy had plenty of yummy battered shrimp, but IMO too much of the condiments (ketchup, mustard, mayo) that it made the bread soggy really quickly and in the end I left about 3/4 of the bread uneaten and picked out the shrimp.<br><br>They are BYOB! And yes I did bring my morning beers in with me when I came on Sunday lol. Prices are very reasonable and the staff was polite. I'd be a regular here if I lived nearby.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PlKRWzJ9WWIJ1BQTNLZ9MQ/348s.jpg", "caption": "Close up of shrimp po' boy"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dxskBr9dO11RwsybYnDi1w/168s.jpg", "caption": "Close up of ahi taco."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/o8pgcYbMDuEym393uUcbgg/168s.jpg", "caption": "Shrimp po' boy and ahi tuna taco. BYOB!"}]}}, {"review": {"des": "Okay, so BIG & little's is definitely a decent place to grab a bite if you're in the area. However, It's just not as amazing as the reviews make it out to be. The food here is decent to alright and I always am full when I leave, so that's a plus. The place is a couple minutes walk away from the red line Belmont station. The restaurant has a decent sized dining area with a bunch of wooden seats for people to dine in if they want (probably should eat deep fried food asap). The decor could definitely be touched up, but that's probably not why people come here anyways.<br><br>Now onto the food:<br><br>Pork Belly Po'Boy 3.5/5: Okay so this is my favorite thing that I tried and I would recommend this out of everything I've tasted. The only thing i would add next time is extra pickles because it gives the sandwich that extra juicy/vinegary flavor which I think it needs a little help in.<br><br>Shrimp Classic Po'Boy 2.5/5: This was the first thing I ever had at BIG & little's, and honestly this was a disappointment. I'm not sure what I expected, but I think I just didn't enjoy the shrimp very much and that's the main part of this sandwich. It's possible that I got a underwhelming sandwich but I would say go with the pork belly if you're craving a Po'Boy.<br><br>I ordered 3 tacos the second time I visited here. Personally, I think the tacos are way overpriced and honestly not that great. They cost 3.50-4.75 for each one and they are pretty dinky. Also the 3 I choose all seemed to have a sweet sauce on them, so by the third taco I was pretty much over it (I'm a sugar monster, but how many sweet tacos can a man eat?)<br><br>Samurai Taco 3.5/5: I would say this was my favorite taco. The fish was fried well, giving it a crispy crunch, and everything worked together to give a sweet and tangy flavor.<br><br>Spicy Pork Taco 2/5: Had some veggies on it, but was not very amazing. Once again the sauce tasted a little sweet (not as much as the samurai sauce though). Overall small taco which i would expect to pay 1.50-2 dollars for.<br><br>Japanese Beef Short Rib 2/5: At this point I was just sick of the sweet sauces. However This taco was also just plain disappointing. It was just like a sweet soy sauce on shredded meat with a couple toppings on it<br><br>Cajun Fries 3/5: Good consistent fries with a generous sprinkle of seasoning. I would say they aren't anything special but a good side to grab if you're looking for something to help fill you up.<br><br>The one redeeming factor is that groupon usually has a deal for about 40 percent off, so you can get a meal for 2 for about 12 dollars. Personally, I really wouldn't come here if I had a choice, because of all the better options north side. I would say come and try the place to see how you like it, and make your decision about it yourself!", "pics": null}}, {"review": {"des": "Big & Little's in Lakeview, what has happened to you? You were our go-to-spot to take visitors when they were in town but over the last 6 months, something has changed. The first time, we thought- \"Maybe they were short-staffed?\" The second time we thought, \"Wow- did they change their recipes?\" Now, we've realized that sloppy, soggy tacos covered in too much sauce is the norm and we've stopped letting down our friends.  It's such a bummer!  Are you under new management? Are there take-backs on who used to run the show? We miss the no-fail service and quality that we were used to!", "pics": null}}, {"review": {"des": "I live right around the corner and come here quite a bit. Food is always great, service is taking longer and longer each time I come. <br><br>I used to order when I came in but the prep time for a simple order drove me crazy so I started to order online and do there. <br><br>This is the second time I've done it that despite getting there at the eta I've had to wait 10+ minutes. <br><br>Ordered 3 tacos at 7:11 email said ready by 7:31. Arrived at 7:40 and they hadn't started on my order said it would be 10-15 minutes more. When I asked them to cancel the order they said they could move it to the front of the line and made my 3 tacos in about 4 minutes. I understand it may be peak time but it shouldn't take the threat of cancellation to get a very small online order started.", "pics": null}}, {"review": {"des": "Fantastic service and delicious food! I tried the soft shell crab sandwich and bahn mi taco. Very good :))", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VCuMshjWDDPfTR4LWwFJLw/168s.jpg", "caption": "Bahn mi (with fried whitefish) taco"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LVQ6XorzrVtZGac7_3M1tw/168s.jpg", "caption": "Soft shell crab"}]}}, {"review": {"des": "This place is good. I like their breakfast burrito and their Hercules burger and lots of their tacos (like Japanese short rib, blackened whitefish, big and little's, mango chutney, etc etc).<br><br>But their prices on their website aren't accurate for the Belmont location at least and when I got the Cheddar dog and the breakfast burrito (over the phone), the total was $1.50 more than the website said it would be. That's bad service. I know it sounds silly to complain over $1.50, but for somebody who likes to budget every dollar, it felt a little misleading.", "pics": null}}, {"review": {"des": "I finally made it here. It's been in my list for 3 years. <br><br>I was well rewarded. I had the fried pork belly sandwich/banh mi. OMG huge portion size $6.99. A great deal. I hit my monthly fat limit on the 2nd bite. Jeez <br><br>I'm glad I don't live here. Otherwise I would be here every week and dead by year end.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/I5so2bDBl8wmWb_TsHOMcw/348s.jpg", "caption": "Fried porkbelly sandwich"}]}}, {"review": {"des": "Last Friday I fell in love. With a Poke Crunch Wrap. <br><br>It wasn't an immediate hit you in the face love considering it looks like a giant tortilla wrapped ball in a basket with no fuss to make it look fancy. This isn't the place for fancy fusses I suppose. But friends, the minute you bite into this thing all initial disappointments go out the window. This wrap is f***ing delicious. It almost doesn't make sense how delicious it was. Tuna was fresh, special sauce was on POINT, and I was digging the fried tortilla crunch inside. <br><br>BFF also loved the tacos she ordered. <br><br>It did take a minute to get our order, however this place was pretty packed. So considering it was a Friday night, I wouldn't say I was surprised or mad to wait for my food. <br><br>I will be back for you Poke Crunch Wrap!", "pics": null}}, {"review": {"des": "I really enjoyed the fish and chips here and usually pretty picky about it. My friend also loved the soft-shelled crab sandwich which I believe is their signature.", "pics": null}}, {"review": {"des": "Listed as one of the top 20 taco places in Chicago is pretty amazing , that being said it shows how good their food is, once starting out with one obscure location on  Orleans , there are 2 other spots , this (Belmont ) being one of them and Wicker Park <br>Originally it seams they focussed more on fish with a couple other items to please \"say a kids palate ,   like burgers and fries , but they realized those items can be improved upon as well with some specialty burgers and uniquely seasoned fries . Personally I love the taco choices like the Mango Chutney Taco, Japanese Short Rib taco , and the Spicy Pork Taco, so \"Amazing\"  <br>On a down note I must say The tacos are a bit small and pricey, Quality over Quantity I guess , so be prepared to drop $20 plus for a delicious meal . It's worth it !", "pics": null}}, {"review": {"des": "Prices went up but the tacos got way smaller :(. Also, service isn't nearly as friendly. I hadn't been here in six months but I'm really disappointed. Used to be my favorite spot in college!", "pics": null}}, {"review": {"des": "Decided to try this restaurant after purchasing a Groupon.  The guy at the front desk was helpful in recommending dishes.  I tried several of the tacos and the soft shell crab.  I must say the soft shell crab was by far the most tasteful and delicious.  However, I feel like the others were cooked in old burnt grease and a little greasy for my taste.  I would dine in again.", "pics": null}}, {"review": {"des": "This place is overrated. We ordered the fish sandwich, samurai taco, soft shell Po boy, burger, and a grilled cheese. Fish sandwich tastes funny, have a very fishy taste, doesn't taste fresh. The soft shell Po boy is a joke, the crab was half the size of the bun. Burger and taco are mediocre, not worth the price. Definitely will not come back.", "pics": null}}, {"review": {"des": "The ahi tuna taco was my favorite: simple and good fish. Wish it wasn't so small, but it's a perfect little taco. We also got the pork belly po boy and added the crab. Super packed with great sauce. It also wasn't as oily as I expected given the crab was deep fried. I'd love to come back to try the burgers.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fJ6D7dFCUC6s0Nvt6u8rJA/168s.jpg", "caption": "Pork belly and crab po boy"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qlrZAMDuRylg8AyjoWTBPQ/168s.jpg", "caption": "Ahi tuna taco"}]}}, {"review": {"des": "I've never dined in, but have ordered takeout a few times. The first plus for me is that their delivery is super quick. Given, I don't live THAT far. But I've had much closer restaurants take much longer. <br><br>I was feeling a little blah the other day because it was Mardi Gras and I wanted to be in New Orleans! I attempted to cheer myself up with a softshell crab po' boy and cajun fries. Both were just alright. The fries were well seasoned but on the soft side. I like a little more crisp to mine. The po' boy was decent enough that I would order it again, but I didn't love it. I think the breading on the crab was a bit too much, the taste of the crab wasn't really cutting through. <br><br>I've also had their kimchi burrito, a new experience, but pretty good. I've had the truffle fries as well and again, good flavor but very soft. <br><br>So thus far, my orders have been so-so. But the menu is so vast and varied that I'll definitely try a few more items out.", "pics": null}}, {"review": {"des": "Not a bad place for relatively affordable seafood burgers and sandwiches. I saw this place on the tv show Diners, Drive Ins and Dives, and had been wanting to come here for a while. I got the soft shell crab po' boy, kimchi fries and chorizo burrito. They are all tasty but a little overrated. The soft shell crab is very small and not worth the price, and I've definitely had better kimchi fries elsewhere. Maybe their tacos and burgers are more worth going for.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iY6vHHg8N1AMy4Rpmu0coA/348s.jpg", "caption": "Soft shell crab po boy, kimchi fries, chorizo burrito"}]}}, {"review": {"des": "This is a great little place !  I had the Bahn Mi with grilled Mahi instead of the fried whitefish and had the Ahi Tuna Poke taco!  So delicious , I recommend !", "pics": null}}, {"review": {"des": "I always love this place. I strongly recommend the lamb/gyro taco or burrito. All the gyro goodness without all the dry bread of pita. <br><br>I love the poke tacos. Phils fries are great too.", "pics": null}}, {"review": {"des": "THIS PLACE IS seriously so good. I have the Hawaiian O five burger or whatever it's called- who care what it's called, if you have just been coming here and ordering tacos- stop that right now- it's time to broaden your horizons and eat some beef on a bun. ORDER their delicious burgers. It was legit one of THEE best I've ever had. I ordered it medium and they got it perfectly. My mouth is salivating right now thinking about this burger.", "pics": null}}, {"review": {"des": "Big and Littles is probably one of my favorite restaurants in Chicago.... but coming to this location last night... I was shocked at how rude and weird the service was. The guy at the front that was taking my order was literally yelling at me and my friend instead of just talking to us (and got our order wrong). One thing I thought was very bizarre is that a gentleman that works there literally kept coming by our table and at one point took a napkin I was using out of my own hands! How weird and invasive. Won't be eating at this location again.... sucks for me because the food is amazing.", "pics": null}}, {"review": {"des": "Ordered the Al Pastor taco and Japanese Short Rib taco. The tacos were a bit small, but looked hella tasty. I had a slight issue with the meats. Both of the meats seemed over cooked; especially the shirt rib which was close to a beef jerky texture. <br><br>Pros were that the restaurant setting was cute and the employees were very friendly.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vTK250slQuRcp4Lbw_HL0Q/168s.jpg", "caption": "Al Pastor Taco"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eFpBXY0FUzCDm3eA03Kgzg/168s.jpg", "caption": "Japanese Short Rib"}]}}, {"review": {"des": "The pork belly po'boy was phenomenal. The meat was tender, juicy, and flavorful. The bread was the perfect mix of supportive and soft. The truffle fries had a strong smell, great seasonings! A great lunch place, took less than 15 mins for my food to be prepared and the staff were polite. Definitely will be back, this place can easily become a new favorite for food lovers of all backgrounds!", "pics": null}}, {"review": {"des": "Just left there... I've been going since they opened this location and has continuously gotten worse and worse.. Never mind the ever so gross sticky tables, dirty walls (literally dust hanging off the walls above the ordering/cooking counter), dirty floors, ect... how bout mediocre service with my ultra soggy fish and chips... since they put the extremely soggy fish on my fries, everything was very soaked with oil, not awesome by any means. I certainly left disappointed and feeling not-so-good from eating soaked fish (which I have had in the past and has been excellent), but not today. <br><br>To top it off, music being played at an extremely high level by Chris Brown (Party) , DJ Khaled (Pull A Caper), among others... But there were (2) young kids with their dad, and then a late teens kid and his mom had to be subjected to lyrics including the F-Word and the N-Word multiple times at a level I could not even put my headphones in and enjoy something else.... Give me a break!  Who the heck plays this @ a family establishment? This was 12 in the afternoon, not a night club @ 10PM.   <br><br>Get it together BIG And littles. The patrons in the restaurant, when I was there, looked very uncomfortable today including myself. Disappointed.", "pics": null}}, {"review": {"des": "We really enjoyed the food here as well as the quick service. We came at lunch time during the week not knowing what kind of crowd to expect, and only waited about 10-15 mins tops to get our food. We had the pork belly and shrimp po boys with truffle and cajun fries. Everything was fantastic! We will be back to try more from their menu, as everything looked and sounded delicious.", "pics": null}}, {"review": {"des": "Basically THE place to go to when I want fish tacos -- fresh, a lot of flavor, and simply yummy. My husband had his first fish taco here and he's now a huge fan. Besides that, though, they offer a nice variety of food and have some good vegetarian options. Their Po'Boys are also PACKED with filling and delicious, and I enjoy their cheeseburgers. The prices are incredibly reasonable and there's usually a Groupon deal if you want to save a little money. They are generous with the fries and are super nice about providing you with water cups if you don't want any soft drinks. (The fries aren't my favorite, but the other food is so good that I don't really mind.)<br><br>The atmosphere is casual and LOUD, especially when they're busy. It's a small space and a lot of people go here, so the seating is a bit tricky if you go at a busy time. I've always been lucky enough to have a group leave just as I'm ready to sit down. Be prepared to be crushed in, though, if you're planning on eating in, because space is a precious commodity at this place.", "pics": null}}, {"review": {"des": "Love the Phil's fries. The truffle is subtle and perfect, not overbearing which happens a lot with truffle. The bacon egg and cheese sandwich was pretty average. Nothing special, but I would get it again. <br><br>I love the aura! They played Bruce Springsteen songs while I was here which made me fall in love even more. I wish it was a bit bigger though. We waited a long time for food and had to wait to find a spot to sit.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/O0VNQ9xs_Ry1hhfSGgmEDA/348s.jpg", "caption": "Bacon egg and cheese breakfast sandwich and Phil's truffle fries. Delicious"}]}}, {"review": {"des": "I'd heard about BIG & Little's before, but was finally convinced to go by a friend. I decided to step out of the ordinary and try a fish taco. Wasn't disappointed! I tried the Samurai taco and the Portobello Sandwich, both had delicious flavors!", "pics": null}}, {"review": {"des": "Many people may think this place turns magical when you walk in but that's kind of a hyperbole.  For the price, it's awesome.  It's still greasy,  and notice the floor when you enter,  it could be cleaner!  I live close to this place and go there often.  <br>Breakfast tacos are cheap and tasty!  And if you are doing take out, they do not have bottled/canned soda. So walk around the block to Walgreens.  <br><br>I can suggest anything on the menu including the burrito and gyro; Order anything and I assure you that you will be satisfied.  But don't expect this place to be super clean, or expect great service or anything healthy.  But who cares about that ;-) <br><br>Updated recommendation: Fish and Chips.", "pics": null}}, {"review": {"des": "This is a great spot for a burger. The variety of tacos was interesting and we tried several. Pulled pork, spicy geef, and bahn mi were our faves. Do not forget to order the fries--they were fantastic !!", "pics": null}}, {"review": {"des": "Disappointed...ordered a burger and the cook tried to give me a \"2 minute\" already burger patty.  Called them out on it and they gave me a fresh patty.  The cheeseburger was ok.  Also had a Taco de Al Pastor.  Nice size, nice amount of meat and the tortilla was good.  The flavor or the Al Pastor on the other hand, tasted like shredded pork in Buffalo sauce.  My buddy ordered the Shrimp Po Boy, he said he was good...looked good.  Also, floors and tables were the cleanest...maybe I'll try another location.", "pics": null}}, {"review": {"des": "Big and littles is becoming one of my fave hot spots in Chicago. I've been here about five times now and the food is always consistent and tasty. I love getting the ahi tuna tacos (the tacos are small but they pack them with quality sushi grade tuna and spicy sauce), truffle fries and the Zeus burger whenever I go. I had to give minus a star because their taco menus are on the pricey side (about$4 for the ahi tuna taco!) For some, it's not a lot of food for what you get. <br><br>Your wait time for food may be long depending on how busy it is. (One day I waited about 40 minutes for my food dining in) but the food is worth the wait. Ordering food is easy. They take your order at the counter and I believe you can pay cash or credit here. From there, they call your order by name when ready. If your appetite is on the larger side, I'd recommend getting something off their sandwich or burger menu and ordering some tacos and fries as your sides. I Haven't tried their soft shell sandwiches but would return to try that on another day. Seating is limited so if it's packed you may have to take your food to go. Parking is on the street along Belmont avenue and its metered.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SfDcog6QDgS5i7DRkVexKg/348s.jpg", "caption": "Outdoor signage"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tOXedBFk9H_5c_BculDAEA/168s.jpg", "caption": "Eating with friends"}]}}, {"review": {"des": "Great staff, food, music, and atmosphere, I always have a great time here! <br><br>Everything off the menu is a winner! Some favorites are the Ahi Tuna Taco, Crab Taco, Al Pastor Burger, and truffle fries. My friends and I have also tried the Rising Sun Samurai Taco, Samurai taco, Crab Po'boy, and the Big and Little Burger. Everything is delicious, all of the sauces are amazing, even the hot sauce on the tables taste better than the others. <br><br>The staff are all very nice and friendly, they know the food very well, and the music is always great there. Really can't ask for a better time spent than at Big and Littles!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zlXqiJKHUnMXlfRX26A-vw/348s.jpg", "caption": "Top: Al Pastor Burger, Left: Rising Sun Samurai Taco, Middle: Ahi Tuna and Crab Tacos, Right: Big and Little Burger, Bottom: Truffle Fries"}]}}, {"review": {"des": "OMG! Our family of 5 found something for everyone on the menu and everything was downright delicious. We were only in Chicago for a week and I could have eaten there EVERY night. Sooo good.", "pics": null}}]}