{"name": "birrieria-zaragoza-chicago", "reviews": [{"review": {"des": "Best Goat in the city, state, world? This surprisingly younger crew is throwing out some dank a$$ goat. When I walked in I was expecting to see a grandma/grandpa running shop for the critically acclaimed establishment but it was a younger (my age) crew manning the front. These guys are actually legit too as in I enjoyed sitting at the counter and shooting the shit with them. Anyways, back to the food...<br><br>The goat is heavenly and falls off the bone. Tortillas are made in house which makes a huge difference. I loved the red salsa they served with the meal. Also, their house hot sauce is FIREE (as in damn good). They bottle and sell it. Words can't describe how amazing the Goat here is. Just check it out for yourself.  <br><br>#RefereEats<br>\"I call it like I eat it.\"", "pics": null}}, {"review": {"des": "I love it.<br><br>To get this out of the way, yes, the only thing sold here is pretty much Birria; however, it is delicious! <br><br>I'm not sure why this was the first time i ever came here... considering I live so close and I love tacos.  I came here after a long 62 mile bike ride with my buddy.<br><br>As I mentioned, they only serve birria, but in a couple of different styles (either with a lot of consome or light consome).  I chose the latter simply because I wanted to make it into tacos.  The birria is everything birria should be, drenched in the sauce, soft, and beautifully seasoned.  It pairs well with their home made tortillas!  I must admit that i had about 2 - 3 orders of these home made toritillas...<br><br>The salsa is fire (both metaphorically and literally).  It is an additional cost  but it makes the tacos taste soooo much better.  If anyone is double guessing about whether or not to give these tacos a try, YES, you should.", "pics": null}}, {"review": {"des": "Easily top five best meals I've ever had. Pretty simple menu: so we ordered one large goat plate and two consommés with a salsa. <br><br>The goat is tremendously good. Tender, charred pieces, flavorful...amazing! I preferred to eat the goat by itself and the consommé as soup - not sure if that's correct, but it was oh so tasty. There were additions you could place in your consommé...I very much enjoyed the raw onions. <br><br>The service was efficient and friendly. The owner was at the cash register. Friendly, family owned establishment with melt in your mouth food!", "pics": null}}, {"review": {"des": "This is an update to my previous review. <br>I came here again with my picky eater son and his friend who loves Mexican food. Upon arrival everyone said hi and where very welcoming. The young lady who took our order was very informative and gave us better suggestion than what I was going to order. We all had a quesadilla and ordered a large order of birria with out bones and with a bit of the juice. The boys loved making real tacos of birria. We left our plates clean! The food here is just amazingly flavorful! I coming back soon because it just makes my day leaving this place very satisfied.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wZ_xv8mtk7VjIeszKzSn6w/168s.jpg", "caption": "The children love it!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Y9yo5mjf6cdvOWiK1kTmyA/168s.jpg", "caption": "A large order of birria with out bone and with juice."}]}}, {"review": {"des": "The best goat Birria hands down. Family owned and run, it does not get anymore legit than this. I didn't love the Machito, but never been one for goat guts, fried or otherwise. Tried it nonetheless, not my cup of birria. Speaking of which, ask for some broth, its the best part. The salsas were all hand made fresh and wicked hot. Tortillas made from scratch, served of fresh and hot off the comal. Muy Rico!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/F4BzoWEDbz3EMup4VYOn6Q/348s.jpg", "caption": "Machito - goat birria & stomach"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FZX0_PAqUWyQKWGRB0x0EQ/168s.jpg", "caption": "Quesadilla"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LFpuPQw8ploclk0jPum33A/168s.jpg", "caption": "The table"}]}}, {"review": {"des": "Holy smoke this place is truly dedicated to the craft of perfecting birria - a slow cooked goat dish served here with tortillas and simple toppings.  As incredible as the goat is, and trust me it is truly legendary, the tomato consume is a work of art.  This place is heavily dedicated to the pursuit of perfection rather than menus with many options and bless them for the time they dedicate to this craft.  <br><br>The staff is friendly, it has a cleaned up hole in the wall vibe which is welcoming.  When we were there we learned they butcher the goats and were able to request offal off menu as they brought us a plate of goat liver.  This is a wonderful gem in Chicago's Mexican food scene - which is plentiful!!!", "pics": null}}, {"review": {"des": "This place is fun. It is amazing how small it is and how many people are packed in here. Yet it still seems to work very well. The goat is delicious, possibly reminiscent of a beef stew. Quesadillas, tortillas, and Horchata all are worth trying. I can't recall another restaurant where I had to walk directly through the kitchen to get to the bathroom.", "pics": null}}, {"review": {"des": "Incredibly surprised I didn't leave a review from the first time we came. <br><br>If you're on the way to Midway, this is a worthy stop/detour. First time we came here, we ordered the goat, quesadilla and salsa. The salsa was hot! Boy was sweating bullets. But more recently, we came starving and ordered two large plates of goat for ourselves. Boneless for him and bone-in for me. The homemade tortillas are a bit thick for my liking but they help to soak up all that delicious goat juice. <br><br>Boy didn't grow up eating goat but now he loves it. He gets excited when he gets to drop me off at the airport now. It's not in the most \"hip\" neighborhood but the food is worth it. Come on, it's ranked nationally!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lWluSBOyHcEM6AfO32UINg/168s.jpg", "caption": "Quesadilla and salsa"}]}}, {"review": {"des": "Hands down the best birria in the city! This place is a gem, I've been going there for years since it's in the neighborhood, it is family owned and you will find the whole family working there on a daily basis. I always order a bowl, because the consomé is what really brings the dish together, handmade tortillas, can't go wrong!", "pics": null}}, {"review": {"des": "I was the only white boy in the place. And they were on an hour and a half wait. So what does that tell you?<br><br>Welcome to flavor town. Go get that goat!", "pics": null}}, {"review": {"des": "This place is a hidden treasure.<br><br>Went here for lunch a could of days ago.  Got there right when it opened which was lucky for us.  This place fills up in no time.  It is small so seating is quite limited just like the menu.  Basically if you are coming here you are getting the goat.<br><br>We ordered a large plate of goat with no bones, two cheese quesadillas, and salsa de molcajete.  Everything was fantastic!  The salsa was warm which is a little different than what I am used to but it was excellent.  Cheese quesadilla was good.  The goat was the star along with the fresh made tortillas.<br><br>Total was under $30 after tip which we thought was great value.  Me and the wife both left full.  Location isn't convenience from where we live so getting back there won't be easy.  If we are in the neighborhood we will definitely stop in!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XuNQIDJTgJNmznBo5uGqYg/348s.jpg", "caption": "salsa"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_NvKUZDeGhpfTasos1RNGQ/168s.jpg", "caption": "quesadilla"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/p-3Gkp39ydcz8a5ocsHb4Q/168s.jpg", "caption": "plate of goat"}]}}, {"review": {"des": "I was recommended this place via someone who follows my Instagram account @pleasesendtacos, and boy did they deliver! I walked in, sat at the counter, and had no idea what to order. Lucky for my I was seated next to the owner, who guided me on what to get for my lunch. <br><br>In the process of my meals , I had a great conversation and made a new friend with John. The goat is excellent here, and pairs perfectly with the hand pressed tortillas, salsa, onions, cilantro and red sauce served fresh. <br><br>I will definitely be back, as this place hits the spot!", "pics": null}}, {"review": {"des": "One word !!! WOW!!!! I just had a delicious lunch with my boyfriend ! Everything was soo delicious!! The toritillas were made by hand ! And I'm watching her make them ! And she's going fast ! The salsa was amazing as well , I'm taking some home with me so that when I make my quesadilla I'll just bust some on there ! But the place is nice and clean , the server was soo nice :)  I would totally come back and eat here again ! You guys get a 5 star from me keep doing the good work !!!  - your friends Juan Diego ~ y~ rick Hall <br><br>Thanks guys", "pics": null}}, {"review": {"des": "Once again, enjoying the amazing birria at this location!  Requested by my 3 year old! As always very satisfied! I had the molcajete salsa! so good I wanted to drink it!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/C1DPecO0roURfkWpymL9zQ/348s.jpg", "caption": "Perfection!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/N8ikyu7IP0cmtcOxEKu_qQ/168s.jpg", "caption": "This is soooo delicious!"}]}}, {"review": {"des": "Been ten years coming here, maybe 75 times, it's the most consistent restaurant I know. Please read my previous reviews for details.", "pics": null}}, {"review": {"des": "Simple and delicious tacos. My first time trying goat and it was fantastic. Get there early. They get busy, but the wait is worth it either way.", "pics": null}}, {"review": {"des": "This place is amazing. Went on saturday morning, very friendly staff. Gave me a complimentary taco while I waited.<br> Ordered the 1lb to go with hand made tortillas. Big portion can actually feed 4 people. Birria was so moist and flavorful. This is more of a take out spot. Not that many tables but worth it.", "pics": null}}, {"review": {"des": "OMG!!! I just tried this place for the first time and it is amazing!! The meat is so nice and tender and juicy then when you add the consomé they include and the handmade tortillas they take it to the next level. The Salas provided are amazing as well and take the whole experience out of this world. This gave us such a taste of home and it's definitely the best Birrieria in Chicago! If you haven't been here I recommend you coming ASAP!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/y4vTumQBqZ1IvgqsMHsL6Q/348s.jpg", "caption": "The meat was so tender & flavorful, the handmade tortillas were delicious salsas provided just helped take your taste buds out of this world"}]}}, {"review": {"des": "Very local place. Our waitress didn't even speak English. The goat is excellent. We came here to eat during brunch hour on Sunday. There were already people waiting. I think every diner spoke Spanish, except for us.<br><br>We ordered the salsa. Spicy really means spicy here. If you like spicy, order the salsa spicy. <br><br>Since we are visiting, we tried to order everything in the menu to try. We enjoyed everything. The hibiscus tea and the horchata were good. Not super sweet.<br><br>Overall, we recommend this place.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1D8BY1vh1i_f-EaX0JS9fQ/168s.jpg", "caption": "Goat and salsa"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ACZzXQynXcpfr59eUIPTNQ/168s.jpg", "caption": "The menu"}]}}, {"review": {"des": "Love love love this place. <br>Los the plate of birria no bone ! <br>Handmade tortillas is big for me. Quesadilla to go with it. Coffee is perfect. And service is great as well. <br>Glad my friend took me here. Now I show up by myself . Small space though.", "pics": null}}, {"review": {"des": "When my friend suggested this place for a ladies dinner club, I was a little nervous considering it was so out of the way and apparently only served goat meat. But I had faith and am always happy to go on a new adventure. <br><br>The little place was packed and there were so many people working furiously behind the counter. It looked like a take away joint, but we were escorted through the kitchen to a back room with more tables. It was a little cramped, but we were happy for the table and the almost private dining experience we had. The waiter so very kindly explained the ordering process and the types of meat we could have because we were so very white and clueless. We could choose any part of the goat that we wanted to eat. Wanting to try everything, we ordered it all, and tried the various delicious salsas and quesadillas and made our own tacos with the goat meat platters that we ordered.<br><br>It was flavorful and delicious and hit the spot. I added salsas to my meat for some extra veggies, but it was so well-seasoned and tender, that they were not even needed. The service was so pleasant and the food was so good and it was made all the better for the adventurous side of it as well. This is a must try place in Chicago for sure.", "pics": null}}, {"review": {"des": "This place is a treasure.  A goddamn national treasure.  <br><br>The goat exceeds the hype and makes the journey worthwhile.  It is so tender and savory.  Get it in a bowl of consomme so you can enjoy the soup, too.  The salsa is so fresh, as are the tortillas.  It is a complete carnivorous experience.<br><br>Grab a bottle of Goose Island Sofie and just go.", "pics": null}}, {"review": {"des": "I love this place not only do they serve the best birra, but the best hand made corn tortillas...", "pics": null}}, {"review": {"des": "You'll definitely have to try  this place is the best   Birria. \" goat rubbish\"<br>The best Goat ever!!!", "pics": null}}, {"review": {"des": "I knew I could not forget to leave a review for Birrieria Zaragoza. They made my entire family feel comfortable and welcome here. My parents had extremely high expectations because most birrieria's in the city are subpar, so we usually only have birria when it's made at home. My entire family loved the birria here. Birria can be an acquired taste, but if you're going to give it a try anywhere then it should be at this place! They make traditional quality birria here, and you can tell everyone that works here cares about delivering a good experience. <br><br>Fresh tortillas, meat, and salsa. They keep the menu very basic so you can easily try it all. My tip would be that you can suggest how spicy you would like your salsa de molcajete, I personally like mine mild, so be aware of that.<br><br>I meant to snap a picture of our food, but the food was too tasty to stop and snap a pic.", "pics": null}}, {"review": {"des": "Stopped in on the way to Midway.  I have never had goat, this place was highly rated so we decided to stop.  They did not disappoint.  The goat was luscious, melt in your mouth, delicious.  The owners were very friendly and made us feel welcome.  The menu was small but it didn't need to be anything more.  This is a gem.  I can't wait to stop in again.", "pics": null}}, {"review": {"des": "Hands down, the Goat Capital!!! This is the Home of the Real Happy Meal!! Stop what you are doing and plan a trip here. Everything is homemade - EVERYTHING. A Chicago Must-Try!<br>There is nothing more to say...", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2-aMwVR4FgWfC-NABknE9Q/348s.jpg", "caption": "Me and the owner, John \"Juan\" Zaragoza."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bk00P9qvOntJoHQQHYsXYA/168s.jpg", "caption": "Large Goat Plates. I ordered extra meat on mine."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/D1k6lvMyeVIMD5vWntA4Bw/168s.jpg", "caption": "Lunch with my little sister."}]}}, {"review": {"des": "Hands down the best place I ate while on my Chicago trip. <br>I had the large Plato Grande bone in (13.75) with the side of tortilla's and consomme. OMG. Best food I have tasted in Chicago and rivals home style goat back on the east coast.<br>They do one thing here and they do it so very well. I also had the Salsa de Molcajete (3.75) and the provided side of onions, cilantro and hot peppers. <br><br>Every bite is bliss. You build to your liking on a fresh made tortilla, adding whichever condiments tickle your fancy. <br><br>The goat is flavorful and tender and this is a must try if in the area. Thanks to Yelp Talk for leading me here. Muchas gracias!", "pics": null}}, {"review": {"des": "Must try in Chicago! First time with goat for me and it was fantastic!  Good sign to walk in and see hand made tortillas being crafted.  Our group had everything on the menu and it was so good, nothing disappointed.  Staff was friendly and service was quick.  A unique dining experience that is such a great find, do yourself a favor and give it a try!", "pics": null}}, {"review": {"des": "I recommend getting the bowl rather than the plate. Not that the plate is bad, but the sauce is good for flavorful and messy tacos. Super delicious and tender", "pics": null}}, {"review": {"des": "Amazing!!! Authentic and delicious. Prefer the plate over the tazon bowl because you get more meat! Definitely get bone out! Great place to visit if your in Chicago.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oNRC5YedjnI7NH5UtWBpeg/168s.jpg", "caption": "Condiments"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/unC4RvUBNiJRmKVqnmJI9A/168s.jpg", "caption": "Tazon bone out below & Large Plate Of Birria. Birria & Cheese Quesadillas! Spicy Salsa de mocajete served warm!"}]}}, {"review": {"des": "I come here every time I'm in town,  at least 6 times a year or more. <br>the people here are very friendly and welcoming.  I'm from California and haven't found a good birria as good as this place   . check out the birria plate  , or the birria quesadilla. bomb", "pics": null}}, {"review": {"des": "This place was by the far the worst I have ever had for service. We got there Sunday at 2:30 and they REFUSED  to seat us after they told us they closed at 4. They said that I had a waiting list of 5 families and that we would only have 20 or so many minutes to eat. How long I choose to eat for is not their problem as they close at 4 not 2:30 or even 3. I'm all for going home on time and getting home to our loved ones but you're in the business of serving others. I am a person who loves birria and Zaragoza which is why I drove 2 hours from close to Wisconsin to go eat here and quite frankly I will never be back. Wasn't even worth the time or money I wasted on gas. Absolutely horrible. Still can't believe they had the audacity to kick us out. Horrible horrible service.", "pics": null}}, {"review": {"des": "Phenomenal and amable (very kind/thoughtful/generous) literally \"lovable\" are two words that came up regularly while eating here. Food and service is excellent. Would return and recommend. My parents brought me here because they are regulars and birria fans. <br><br>They ordered the small plate for me and split a large plate. Perfect portions! Happy and fed are we!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Nh6yhEO25dINpz1WObCWlA/168s.jpg", "caption": "A dressed small plate with bone. Oooh wee that broth!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3xW2K--jvTni9AYvMh6IDA/168s.jpg", "caption": "The plate before adding your fixins, cilantro, onions and salsa molcajete. And the plate after dressing! Also, coffee was on point!"}]}}, {"review": {"des": "you have to try it to believe it.<br>they treat you to an experience that is so invaluable.<br>great customer service, the best goat you can have (some of the best tacos in the country, so some say of this joint). who needs any other meats when they do what they do with goat. nobody, thats who. this place rules. i agree with what they say, and i can speak for myself when I say thus far its one of the best tacos of my life", "pics": null}}, {"review": {"des": "Zaragoza hands down the best birria place in town!!!Having grown up eating delicious homemade birria my standards are high, Zaragoza surpasses them all. From the amazing fall apart birria to the condiments, coffee, salsa, tortillas it is all amazing. The service is excellent in that it feels like you walked in to someone's cozy kitchen. <br>This establishment has won many awards and has been featured in many food shows as the best in town, rightfully so.", "pics": null}}, {"review": {"des": "The food was so good. Menu keeps it simple, but the hours make it difficult for me to ever come here. I recommend you give them a try next time you are in the Midway area. <br><br>Service is very friendly and helpful for first-timers. This place gets packed and for good reason. The delicious slow cooked goat on offer is not something you can find everywhere.", "pics": null}}, {"review": {"des": "I am from the highlands of Jalisco and have had many good birrias in La Barca, Arandas, Guadalajara, and Df. Birrieria Zaragoza is the best Mexican food I've had in the US. I always say this, mexican restaurants have too many items on their menu. Stick to one dish and perfect it. Kudos to Birrieria Zaragoza!", "pics": null}}, {"review": {"des": "The food is amazing. We stopped at Birrieria Zaragoza after our flight into Midway to get some of the famous goat tacos. Since it was our first time, the staff was extra welcoming, and we greatly appreciated their hospitality. Even more impressively, the birria was AMAZING. The BEST taco I may have ever eaten. I can also see myself eating an entire bowl of the broth alone. The tortillas are handmade, and it's fun to watch them be made behind the counter. We will definitely be going back!", "pics": null}}, {"review": {"des": "Returned after an 8 year absence.  Time flies!  Still a wonderful restaurant staffed by really nice people.  The flavors and deliciousness haven't changed a bit.  If you've never gone you're doing yourself a disservice.  Love the goat, the salsa, the tortillas, and the people.", "pics": null}}, {"review": {"des": "Not only the best goat tacos I've ever had. Not only the best tacos in Chicago, but among the best tacos in the world. Go here now and you'll be happy.", "pics": null}}, {"review": {"des": "My co-worker recommended this place whole heartedly when I told him I would be taking the orange line to Pulaski. Now I'd never eaten goat before. It was like eating braised beef, but really tender. I ordered the small plate and I could have easily finished the large. There's something just fun about assembling your own tacos. Housemade tortillas, lime wedges, cilantro, homemade salsa, and let us not forget, real Mexican Coke.<br><br>The wait staff was really friendly, we even talked about the wrestling show I was heading to later in the evening.  I'm not sure if I would return since this place is so far out of my way. But they have their niche and what they do, they do very well.<br><br>PS: Do not wear white if you come here because this place requires that you get messy!", "pics": null}}, {"review": {"des": "The actual birria is really good BUT THEIR PRICES FOR THEIR PORTIONS ARE NOT. My boyfriend and I ordered a LARGE plate of carnaza to share. When it was brought to our table, I couldn't believe that we paid $17 for goat meat that was honestly just enough for just about three tacos. I can't even imagine what the small order looks like. It's good but not that good considering the cost.", "pics": null}}, {"review": {"des": "The food was incredible, definitely lived up to its hype! I ordered the large plate and the goat was just exquisite; it was enough meat for me to make 6 tacos (unlimited tortillas)! The wait staff was really friendly too. Highly recommend stopping by for some goat tacos, even if you live 40 minutes away like me!", "pics": null}}, {"review": {"des": "Great birria and the homemade tortillas are excellent. <br>Quesadilla was also good and the horchata (which is what all Mexican places should be judged by) was a little less creamy than I would've like but had a good amount of cinnamon without being overpowering. <br><br> Service is curt and unfriendly.", "pics": null}}, {"review": {"des": "We loved this place. We were heading to airport and plane got delayed. This was close and had great reviews. The staff was extremely nice and very friendly. We ate family style and it was simple and amazing meat that was marinated in mole sauce for 6 hours. Our waiter gave us the low down of their menu as we've never been. Loved it and will be back!", "pics": null}}, {"review": {"des": "I really liked this place! We were greeted when we walked in and we got seated immediately. The food was delicious, I loved the salsa! Our server was also friendly, I would come back.", "pics": null}}, {"review": {"des": "The birria here is AMAZING. Very clean. Their tortillas are handmade which is another plus. I definitely recommend this place!!!", "pics": null}}, {"review": {"des": "This restaurant is definitely 5-stars. It's one of those rare restaurants where you talk about how good it is, and then when you next go, it's actually that good. The more you get to know the food, the better it gets. Yet it's still accessible to a newcomer; when my uncle was visiting me, we detoured a half-hour from the Art Institute just to go here, and he loved it.<br><br>To actually describe it: the goat is some of the most tender and subtly flavorful meat I've ever had, and the balance of flavors in the consome is just perfect; no individual element overwhelms the flavor, and it complements the goat just right. The homemade tortillas are as good as people say they are. I haven't quite figured out how to best use the salsa de mocajete in a way that doesn't drown out the goat flavor, but it's still delicious on its own.<br><br>I've been to a few other birria places in Chicago, and none of them quite get the balance right quite like this place. This restaurant is the best in Chicago for a food that Chicago does unusually well.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tNcrkcFmGkhe_oHUGD-4jg/348s.jpg", "caption": "salsa y plato grande"}]}}, {"review": {"des": "The birria at this place is high quality. No smell, no after taste, just great quality birria with handmade tortillas. Highly recommended if you are in town. I am probably going to visit again before I leave Chicago!", "pics": null}}, {"review": {"des": "Not only is this place delicious, but the service is phenomenal; friendly, caring, and generous.  It was our first time here right before going to midway airport as our flight to houston had been canceled all week be used of hurricane Harvey. <br><br>Owners heard about us being affected by Harvey and gave us free quesadilla, drinks, and salsa.  They asked us how our family and friends were doing in the aftermath of the hurricane and we felt cared for.", "pics": null}}, {"review": {"des": "Tender large taco cuts of goat, put on your own cilantro and onion. The goat was tender and flavorful. The ratings speak for themselves don't they? I'm going to get in trouble for coming here without my significant other, but I'm bringing some tacos home. Very warm and friendly folks here. Plus it's near the my old neighborhood. A+", "pics": null}}, {"review": {"des": "Growing up my dad would tell me about how his dad would bring goat heads home from the butcher, roast them and feast. I was interested in tapping a little into my roots and was kind of blown away. I got two tasty, tasty tacos. But I think the real surprise was the consommé! Wow!", "pics": null}}, {"review": {"des": "Yummy goat!!!! Small and clean place with very delicious goat tacos. Too bad it is in south side.", "pics": null}}, {"review": {"des": "Best birria I've had! I would recommend this place to anyone visiting Chicago. I'm from LA and was introduced to this awesome restaurant. My sister had a quesadilla and she loved it. I had a small bowl of birria bone in and it was the best. All tortillas are hand made. Affordable place to eat. I would love to come bk.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5P1gp4fF_AzWzIT_5bwRfA/348s.jpg", "caption": "Small bowl"}]}}, {"review": {"des": "TERRIBLE !!! The place is very small so you might not be able to get a table right away because it gets very crowded, that's the reason why we decided to take the food home. WE PAID $2 dollars FOR NO BONES and STILL GAVED US BONES. Save your money instead of giving it away so easy to them, not worth it !!!  If they are charging for no bones, then they have to make sure not to leave any in there, THIS IS TERRIBLE!!!!  They are making sure to take our money away so easily and to also send us to the dentist if we get lucky enough in not choking...", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CDKPzWoW6Qzk-PG_KALjGA/348s.jpg", "caption": "WE PAID $2 dollars FOR NO BONES and STILL GAVED US BONES. Be careful not to CHOKE !!!!!"}]}}, {"review": {"des": "Roasted goat in an rich tomato base sauce along with the usual compliments  of homemade tortillas ,onions. Cilantro, hot ,mild or med Salas. I enjoyed this place, upon entering I was offered a sample of their meat and sauce. That sold me right there plus the sample was delicious . I got the large bone in goat with all the sides which I enjoyed at home. I'll definitely come back for the soup and the excellent service. Thank you", "pics": null}}, {"review": {"des": "Hands down the best tacos I've ever had (and I've had many many tacos in my time). The birria is simply spectacular. I'm going to make a special effort to come here regularly, the food is that good. If you're ever coming to / from Midway, it's the perfect opportunity to visit this gem. The meat off the bone was divine, I'm still salivating. Yum!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yTxV3v5-JCvUeei78QW_CQ/348s.jpg", "caption": "Don't miss it. Just don't"}]}}, {"review": {"des": "I like to think I critic tacos very harshly and extremely because you know like every good Latino make I love tacos and I didn't know what to expect walking in here and I was amazed the hospitality was amazing the aroma was magnificent the cook greeted me and ask for my name then said \" Abel here's a taco \" it was delicious and I was so eager for my family to try it as well that I ordered 3lbs of Birria which my father absolutely loved as well ! This place is alive and exceeding expectations as of 2018!  Can't wait to go again", "pics": null}}, {"review": {"des": "What a cute, yummy little spot to have lunch.  This place will make you want to bleat for joy. The owner was very warm and welcoming. He personally walked us through the menu, described the food preparation, and gave us his recommendation. <br><br>Food was delicious, the quiet setting was nice, and I loved the people, extremely sweet.  A great first impression.  <br><br>Mary should have had a little goat instead of lamb. Just my opinion. <br>Baaa-a-a-a-a.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Sn6T40__ehRYi9pVVIg3ww/348s.jpg", "caption": "Goat+ tortilla"}]}}, {"review": {"des": "After reading some reviews I decided to try this place and my experience was amazing!<br><br>I placed an order for pick up and once I got there the chef greeted me and asked me if it was my first time there, after I told him it was, he explained the menu and as he was talking he surprised me with a birria taco. The taco tasted amazing! The hand made tortilla along with the well seasoned birria and the fire roasted salsa made the wait of five minutes go by fast. <br><br>Everyone was super friendly and the quality of costumer service amazed me.<br><br>I can't wait to go back and dine in.", "pics": null}}, {"review": {"des": "Have only ordered once, and was quite disappointed. Perhaps because I ordered late in the afternoon, but pork meat was quite dry and very hard to chew. Portions of food are overpriced and quality did not meet expectations.", "pics": null}}, {"review": {"des": "Small homestyle real birrieria!  Great consome con un puñito de clavo... muy rico!  Great handmade corn tortillas and the meat was tender and not dry.  Service was decent, very nice, not the best at describing dishes and how they come though.  But I came to EAT, so no biggie!  I'd recommend!", "pics": null}}, {"review": {"des": "Of course we had the goat. Bone in with a side cheese quesadilla. Absolutely phenomenal. But what shocked me most was the service. The employees are so nice. Once if the busboys goes table to table asking how everyone is doing! This place was highly recommended by the Chef at Barn & Co. and they did NOT disappoint. Don't change a thing.", "pics": null}}, {"review": {"des": "Great food, awesome service. They make you feel very welcomed! <br><br>Been here a few times and have not been let down yet. I'm a sucker for hand made tortillas and salsa and they have both here. Could not recommend this place enough!", "pics": null}}, {"review": {"des": "Wow. Wow. WOW!!! I've had tacos all over the world and these are the best. I want an IV drip of their broth. Owner Johnathan went above and beyond to take care of us and share the story of his restaurant. Don't miss this place.", "pics": null}}, {"review": {"des": "Went there for the first time this afternoon with my daughter after school. We split the large plate bone in. It was so good.  Next time we'll include my wife and our other daughter as well.  I will certainly get the large bowl which includes the consume.  Maybe try some of the goat tripas, too.<br><br>It's just Birria on the menu. No steak, no chicken, no pork--but you really would just be wasting your time and palate anyway.  What this restaurant does is very special, from the tortillas, to the salsa, and of course the roasted goat.<br><br>My daughter and I each made three tacos, and I got to eat the few forkfuls that were left.  As full as we were I couldn't get over how good the kitchen smells were as we left. Still so appetizing.", "pics": null}}, {"review": {"des": "Best Birrieria in chicago by far takes me back to jalisco and there hand made tortillas are delicious", "pics": null}}, {"review": {"des": "Incredible food and it will cure what ails you. This was my second visit. Went there for lunch on a Saturday, was feeling a bit lightheaded, cranky and hungry due to a long run, a tiring morning at a cross-country meet and the unusually hot weather. After a couple of bites of the amazing tacos and the life-restoring consomme, I felt 100%, like I could conquer the world. Service is fast, efficient, and friendly and they had great music playing! this is the real deal. Can't wait to come back.", "pics": null}}, {"review": {"des": "Good lord is this delicious! Not easy to eat while driving with how juicy it was, so I looked forward to taking a bite at every stoplight.", "pics": null}}, {"review": {"des": "This place is so good! Ordered the bone-in birria with the quesadilla---DELICIOUS!!! So much flavor and cheesiness. The staff is friendly, a woman is hand-making the tortillas right in front of you--what more could you want? Also, the owner of the restaurant is super friendly and personable. You can tell he really has a passion for spreading love for birria.", "pics": null}}, {"review": {"des": "My favorite place for Birria in Chicago.  Best goat, best tortillas, best quesadillas, best people.  We come here at least once a month and have lunch meeting.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9XnuFzDvJQS6yPsbJg7wVw/348s.jpg", "caption": "This is it!  Can't wait to eat"}]}}, {"review": {"des": "I've been checking out places in the city that yelpers have \"raved\" tremendously.  Hubby and I were passing through the Archer Heights neighborhood on S. Pulaski, attempting to head back north during pre-rush hours.  I knew that this place wouldn't have anything vegetarian for hubby since their dishes focus on \"goat\" as the primary source of meat.  Yet he was curious and wondering whether or not goat would cause any discomfort on his stomach.  After all, he became a \"part-time\" vegetarian because he experienced ongoing stomach problems and illnesses due to the consumptions of meat and poultry.  <br><br>Well, obviously his stomach could deal with goat just fine.  The owner, who shares 95% similarity with the famous George Clooney, warmly greeted us and invited us to sit down anywhere we liked.  The entire dining room was fairly small, and the wall decors had nothing fancy or special.  The young lady server quickly approached to our table with an i-pad in her hands (small businesses' favorite piece of technology).  <br><br>We wanted horchata (of course) while we were perusing through the menu.  The menu is relatively simple.  In summary, there are three (3) types of entrees to choose from: tacos, quesadilla, and small/large plates.  All entrees feature goat as the sole protagonist.  <br><br>We went with two (2) orders of Plate Chico (small size) and added the warm salsa served in a molcajete.  That salsa was spicy, but that spiciness was so smooth that I kept on eating it with my spoon, one scoop after another.  Their goat was tender, juicy, and flavorful.  I know it wasn't easy to cook goat meat without sacrificing one (1) criterion for another.  Nevertheless, Birrieria Zaragoza did it!  <br><br>We asked for extra tortilla because that salsa was just that awesome!  By the way, the horchata was also delicious.  I liked how they used the crushed ice instead of the full-sized ice cubes.  The full-sized ice cubes tend to dilute the horchata mix.  Yes, there's always science behind food-making.  <br><br>The owner (Mr. Clooney...was that you?) and all workers at the restaurant were very welcoming and beyond friendly.  I can't wait to come back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/o3dqEIsPSfoAl97VeGQ2kg/348s.jpg", "caption": "Plate chico"}]}}, {"review": {"des": "We came here on a Sunday afternoon for lunch. We were seated in the main part of the restaurant after a brief wait. My husband and I shared the large bone-in goat plate, a cheese quesedilla, and a mild salsa. Our food was delicious--the meat was very tender and flavorful, and the freshly-made tortillas were perfect. The salsa came out hot, which was excellent because it didn't cool down the taco you make.  Service was friendly and fast.  The prices are also very reasonable. I highly recommend this place!", "pics": null}}, {"review": {"des": "With only 1 main dish and 1 side this restaurant is creating a legend. I am a vegetarian but I was blown away by the freshness and taste of salsa and tortillas. A must visit.", "pics": null}}, {"review": {"des": "Excellent goat meat served in a stew style serving. It is a very looking, tasting place. It is also BYOB. The wait for food is usually not very long. A little far from downtown Chicago by worth it!!", "pics": null}}, {"review": {"des": "Our favorite Chicago restaurant experience out of many, and easily the most valuable in price point. The goat stew was recommended by a chef-friend and did not disappoint. The fresh pressed tortillas were the best I've had. The service was amazing. Our server helped explain the items and suggested proper portions for our party of 2. Cozy feel, small joint, bathrooms are an adventure through the kitchen with a peek at the staff enjoying family meal in the back. Norma (?), the owner and chefs mother came out and chatted us up at the end of our meal and even had her employee run home to grab a dessert bread she was raving about. My girlfriend is gluten free so Norma gave her a flan on the house. GO HERE NOW! Seriously, what are you waiting for? For the betterment of your, health, community and Norma's family Go. Here. Now.", "pics": null}}, {"review": {"des": "Well worth the trip! Excellent food. Tender delicious meat. Unbeatable handmade/homemade corn tortillas. I'm usually a flour tortilla man, but these were excellent. Also I'm a amateur that likes sour cream and cheese on my tacos. They don't have sour cream. Honestly you don't need it. It would hide too much of the perfect tasting meat. You need to ask for cheese. The staff is the friendliest welcoming group of people I've come across in the city. Family owned and they make you feel like family. I can't recommend this any more strongly!", "pics": null}}, {"review": {"des": "This place was great. Haven't had goat before, but it was well seasoned with fresh ingredients and fresh pressed tortillas.  The manager and staff were remarkably welcoming and offered a tortilla as I waited 3 minutes for my pick up order (I arrived early). This is a Chicago gem. Will definitely be back during my drives from downtown to the suburbs.", "pics": null}}, {"review": {"des": "The Birria here is so legit! It literally melts in your mouth. We got the big plate of Birria, which you can get about 5-6 tacos out of. I would recommend the bowl (large bowl is definitely shareable) cuz I like th extra liquid. You MUST get the fire roasted salsa with it. I got spicy which was really good. Birria quesadilla was good but with the cheese it is hard to actually taste the meat. Husband loved it and our friend said its the best Birria he has ever had. You get as many tortillas as you want also! The owner is super friendly and always remembers us :)", "pics": null}}, {"review": {"des": "Best food in the area! Vip service from everyone there, and the food is fresh and amazing. Erik has the best hair I've ever seen.", "pics": null}}, {"review": {"des": "It's exclusively goat! Very tender and flavorful. You can choose between bone in or bone out. They make their own tortillas!! The goat has the ability to produce a yummy soup called consumme. Highly recommend.", "pics": null}}, {"review": {"des": "Birrieria Zaragoza is a no frills Mexican spot that serves goat meat. Everyone there seemed to be a regular, so the waitress had to help us out with the menu, which was entirely in Spanish. We got a large goat meat plate with 2 cheese quesadillas ($18). The goat meat was perfectly moist and delicious and the tortillas were handmade. I would go back if I'm in the area.", "pics": null}}, {"review": {"des": "Wow!  This place was wonderful!  The stay we amazing and the food was... WOW!   We had the quesadillas and I got the large plate of Birria.  Best Ive ever had.  Highly recommend.", "pics": null}}, {"review": {"des": "I was skeptical about trying the birria since in the past I have had issues with smell or after taste with others I have tried. This birria was delicious!  No after taste or smell what so ever. Homemade tortillas and the fresh made-to-order molcajete was the icing on the cake. If ever in the area I suggest you try it even if goat birria is just not your thing.", "pics": null}}, {"review": {"des": "What a wonderful way to celebrate a Cubs World Series Championship the day after, than with goat. I've had them on my radar and finally planned my visit.  Refreshing to see owner John had his Cubs jersey on and was ecstatic with the win too. Even though it was my first visit, they made it seem like I was a regular. The suggestion is always a large birria plate on the bone. I enjoyed every morsel and look forward to a return trip. If you've never tried goat... what are you waiting for! \"I ain't afraid of no goat.\"", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KmDI3psxLIyZq4zEJM_QVQ/348s.jpg", "caption": "A very cool sombrero."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5e9ygGrpdj5bLkMXkGaLnQ/168s.jpg", "caption": "Enjoyed another large plate today."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yzhXix0pJ2G9sBFOBjeMlw/168s.jpg", "caption": "I hope they're not moving after 9 years."}]}}, {"review": {"des": "Best goat I've ever had. Fantastic food. Service was top notch. Loved the owner, Jonathan, who spent some time explaining their cooking process and hanging out. Go there.", "pics": null}}, {"review": {"des": "Love the birria great service not recomendable 4 a big group of people on sunday is a small place but they make you feel like home not a good menu 4 kids love it", "pics": null}}, {"review": {"des": "Do yourself a favor and just go! The food is excellent! You will not be disappointed. I was never really into eating goat, but my experience here completely changed my view. Try something new and you may discover a new favorite restaurant.", "pics": null}}, {"review": {"des": "What an incredible experience having lunch st this delicious, family owned, restaurant!!!! Homemade tortillas being made right in front of us!!!! Casual atmosphere, but truly special food! The menu is simple, but the taste is DEEP!!!!. WILL MAKE A SPECIAL TRIP HERE AGAIN", "pics": null}}, {"review": {"des": "Amazing!  I was a first timer and on a date. I needs a little help, to say the least. Everyone was super nice. They walked us through the menu and made a couple recommendations. We each had the bone-in Birria, small plate. The goat was tender and flavorful, but combined with the handmade tortillas and the consume, totally ridiculous. Unbelievably good. I highly recommend Birrieria Zaragoza, without hesitation.", "pics": null}}, {"review": {"des": "All the way off the orange line is this little spot called Birreria Zaragoza. It's a small place that looks like you'd go up to the counter to order, but if you sit, a waitress will take your order. I immediately liked the vibe. It's cozy, there was fun music playing, the staff was nice and helpful, and the food came wicked fast.<br>They only serve one kind of taco: Birria tacos (aka Goat). Which is cool. I can get down with goat.<br>You also get your fixins on the side. They automatically bring you the cilantro and onion - you gotta ask for the cheese.<br>Their taste? Honestly? They were fine. They almost tasted a bit like a stew, kinda like the beef stew tacos at Tacos Erendira in Bridgeport. It was not a sharp taste - it was very soft. Honestly, I feel like this would be the perfect hangover food if you had a testy stomach.<br>That being said, did we love it? Eh. It was really out of the way and I don't think we'd ever crave it. But I also wouldn't warn you not to go because the service is so great.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YT_BZrURQkuF51ozi9Y-Wg/348s.jpg", "caption": "Birria tacos (had to ask for the cheese)"}]}}, {"review": {"des": "Very Flavorful. Staff Was Very Open And Welcoming. A Good Treat In Rotation Of Regular Tacos. Fresh Garnish With My Tacos And The Place Was Packed. I'll Be Back To Try The Full Dinners. I'm Sure My Review Will Go Up.<br>#GoatTaco", "pics": null}}, {"review": {"des": "First time I ever had goat and it was seasoned and cooked so well. Really tasty. Got the large plate with the bone in. Also got the spicy molcajete salsa, which was flavorful too. I really like their fresh tortillas. The staff are really friendly. Definitely would come back!", "pics": null}}, {"review": {"des": "Birria is delicious.  Will keep making you want to go back for more.  Place is small but do not let that push you away.  Excellent service.  Recommend the bone in plate.  <br><br>Birria está deliciosa.  Te deja con las ganas de regresar por más.  El lugar es pequeño pero no dejes que esa sea la razón la que no entres.  Servicio es excelente.  Recomiendo el platillo con birria y hueso.", "pics": null}}, {"review": {"des": "This place is canonized as one of the top 10 independent taquerias in USA. Their goat tacos are just that spectacular.<br><br>The place is humble in appearance, and in a slightly depressed area of town, but nothing should keep you from here. The service we experienced was bi-lingual and superlatively informative.<br><br>Grab a horchata and sample all they serve. The flavors are something you'll never forget. It's a destination place in which to make a memory, or in which to become a regular.", "pics": null}}, {"review": {"des": "So delicious! There's nothing like a bowl of consume with birria on a cold winter day! The homemade tortillas are fantastic as is the warm salsa! Actually it's all delicious!", "pics": null}}, {"review": {"des": "Food was great, and the fresh made tortillas that was being made to order was great!! Soup was great with the small plate. If you want goat go here because this the only meat they sale!", "pics": null}}, {"review": {"des": "The birrea was the delicious the homemade tortillas made it even better that I thought was great we had two different plates the first one was birrea in the bowl and the other was birrea plate they even give you a choice with bone in or bone out either way you take it it's still great the ambience was great kind of small but great service was real good everyone seems to be happy The only downside to the whole experience was that they kept on checking in to see if everything was OK which is good but now when you're trying to have a conversation with someone but definitely I will go back again this is a great place and everyone should try it", "pics": null}}, {"review": {"des": "You've probably heard about this \"Super good goat meat place on the south side.\" Well, the rumors were all true: \"If you are a meat eater then this place is for you. The goat is so tasty and tender that it's almost a crime.\" Zaragoza is \"Not what you typically think of when you go for Mexican food, which makes me feel it is very authentic.\" <br><br>If you're looking for \"A Good Treat In Rotation Of Regular Tacos\" and an \"adult-portioned size plate of goat,\" this birrieria is  \"worth stopping by.\" Come for the goat, but come back for the \"Creepy ambiance,\" \"fresh corn tortillas\" and \"Fire-roasted salsa.\" \"Mary should have had a little goat instead of lamb. Just my opinion. Baaa-a-a-a-a.\"<br><br>There's a chance this \"Super authentic spot\" will make you feel like you \"don't know what or how to eat,\" but have no fear.  \"The owner shares 95% similarity with the famous George Clooney,\" and he will be happy to advise you. He will likely tell you \"You are there to eat steamed goat and it's delicious.\" If you are \"Mexican and know about birria compared to most people that eat at this place,\" you're probably literally eating there right now, unless it's after 7 p.m. That's closing time!", "pics": null}}]}