{"name": "bistro-campagne-chicago", "reviews": [{"review": {"des": "My first time here and man am I kicking myself for not coming sooner! This restaurant brought my husband and I back to Paris: the food, the vibe and the great service. We had the onion soup, fondue, hanger steak, salmon (perfectly cooked with a delicious broth) and the bread pudding and all were absolutely delicious. The bread pudding was top notch and melted in your mouth. <br><br>I definitely recommend trying this place out. My husband also enjoyed his cocktail and he even commented that it might be his favorite restaurant in the square.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/APb8LHca61S4xQhSzXc6tw/348s.jpg", "caption": "Salmon"}]}}, {"review": {"des": "I really wanted to love this place, but overall the food just didn't have a lot of flavors and the dishes we tried were all very one-note. I was particularly not impressed with ratatouille, a signature French dish. I've made it myself before and sadly my cooking tasted better. <br><br>On the plus side the service and atmosphere were pretty good, but I probably won't be back for the food.", "pics": null}}, {"review": {"des": "When the weather is beautiful out, I love coming here and having dinner on the charming patio. Patio seating is first come first serve but worth waiting for imo. The food here is excellent. Everything I've tried has been fantastic, but my personal favorites include:<br>-Soupe à l'Oignon Gratinée: I usually don't order soup, but this is one l reorder. The bread soaks up the flavorful broth and tastes delicious with the melty cheese.<br>-Salade Lyonnais: The bacon dijonaise dressing is nice and creamy and those bacon lardons are crisp and meaty. Mmm!<br>-Poulet Rôti Forestière: Amish chicken, wild mushroom ragoût, onion frites. Exceptional! This and the Amish brick chicken at The Bristol are my favorite chicken dishes in Chicago. <br>-Gratin de Macaroni: I love mac & cheese and this is one of my favorites<br>-Pommes Frites: dip in aioli. Yup :) <br>I hope to eat on the patio at least once more before the summer weather ends. I imagine having brunch here with friends would also be great. Highly recommend!", "pics": null}}, {"review": {"des": "If you're looking for a cozy place that brings you back to the feels of a Parisian Cafe, Bistro Campagne is your place. It's tiny and warm inside with accents of dark wood and candlelight that show right off the bat you're in for a special evening! They offer an extensive beverage menu, including French favorites like Kir royale and Lillet blanc. For starters we got the French onion soup, which I though was he best dish of the whole meal! It was topped with ample brûlée'd cheese and served with half a baguette to soak up the last drops! The steak frites is a great bang for your buck--the fries were thin, crispy, and perfectly salted while the steak was tender and came with an herby butter sauce ~très magnifique!~ The side of mushrooms were super rich, but pretty much tasted solely of butter. The side of Mac and cheese I thought lacked variety in flavor (but actually tasted much better when the leftovers were reheated). All in all, I'd highly recommend this place for a date night!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iGN1AuIjsGjsJlrgfCDTug/168s.jpg", "caption": "Fantastic French onion soup!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uRJeYAe30bnFg-gyep-Sxg/168s.jpg", "caption": "Steak frites, mushrooms, Mac and cheese"}]}}, {"review": {"des": "Lovely classic french bistro. Nice place for a winter date, dark and cozy inside, and a nice place for a summer date, out in the garden.", "pics": null}}, {"review": {"des": "Came here for restaurant week, as it was recommended by Chicago magazine to be great value/hidden gem, it totally holds up to the claim with the amazing food and the price/portion compared to their regular menu ($33 for 3 courses).<br><br>You have the option to substitute the items on the restaurant week menu for their regular menu items for a minimal charge, I really liked this flexibility.<br><br>For appetizer, the 2 of us got the mussel on the RW menu and upgraded to escargot for $3. The mussel (Moules à la Bière) is really good and the portion is pretty big, really liked the sauce. The escargot is quite tender and flavorful.<br><br>For entrée, we got the trout and the Bœuf Bourguignon. The trout filet is quite nice, and I also really like the risotto that has smoked trout in there, amazing taste. The Bœuf Bourguignon is very tender, and pork lardon (bacon cubes?) complement it really well.<br><br>For dessert, we really liked the crème brulee (well, you can hardly go wrong with it). The bread pudding is also very nice.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JOQQwV4xMgh-23bmrXnDcw/168s.jpg", "caption": "Trout"}]}}, {"review": {"des": "Love this place- classic French, well done. Always a favorite for special occasions, or no occasion at all.", "pics": null}}, {"review": {"des": "We chose Bistro Campagne as our belated anniversary dinner and we couldn't have been happier with this decision!<br><br>Our server Lindsey was outstanding. Not pretentious or over the top in any way, but super down to earth and friendly. She is the epitome of how you wish service was everywhere. <br><br>They started us off with a complimentary glass of champagne to celebrate, which was completely unexpected and greatly appreciated. We decided that a charcuterie board was obviously the way to go, and it was superb. Two vastly different cheeses, two different styles of pate, seedy mustard, divine rhubarb jam, an assortment of pickled veggies, and homemade bread and pita chips. We were in HEAVEN. <br><br>In true anniversary fashion, we decided to order two dishes and their accompanying wines and split, so we went with duck confit and pork chop. Both vastly different, and both superb. I preferred the actual duck meat + white wine over the pork chop + red wine, but preferred the pork chop's side dishes (carrots, roasted potatoes and dill sauce) over the duck's side dishes (radishes, greens, parsnip puree). For us, sharing worked our perfectly because we got the best of both worlds! <br><br>We ended the night with the bread pudding, and it was delicious! It's certainly not for the faint of heart with its strong rum sauce, but the flavor profile was outstanding. <br><br>For only $125 total for two people, this was an absolutely wonderful way to celebrate. I would highly recommend :)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TUEgObMwfjPvtjdaudx3JA/168s.jpg", "caption": "Charcuterie board"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/V0x-qenlsyD5GyP-206S4g/168s.jpg", "caption": "Belated anniversary dinner at Bistro :)"}]}}, {"review": {"des": "Happy we were able to get a last minute reservation on Open Table.  Convenient.  Parked in front and fed the meter.  Bistro Campagne is a warm and friendly neighborhood restaurant in the tradition of a true French bistro.  We were met by a very friendly hostess and sat in the back room (place is a lot larger than it looks) and we loved it.  Decorated like a tiny country cottage the atmosphere was welcoming and even romantic.  <br><br>Our waitress couldn't have been nicer and provided some great recommendations.  Escargot and french onion soup for apps and the soup really stood out.  I'd put it on a list of top soups.  I got the special pork tenderloin.  Delicious and cooked perfect but might be considered underdone for some.  The Steak Frites was very nicely done as well but we just didn't love the sauce.  Looked great but just didn't love it.<br><br>Very good bread pudding dessert.", "pics": null}}, {"review": {"des": "The first time we came here (last month), everything was well prepared, perfectly seasoned, and delicious. We went back this past Friday night and were underwhelmed, to say the least. We had the Fondue d'artichaut (hot artichoke and crab dip) which had been amazing the first time. This time it was runny and devoid of any crab. The steak frites were cooked correctly but not seasoned at all. The profiteroles were lovely but the pot de creme was rather bland. <br><br>To make things 10 times worse, my daughter found a hair underneath the frites, after she had eaten about half of her entree. When we brought this to the busboy's attention, he asked if we wanted them to box up the leftovers...??? Really?  The server gave us the chef's apologies and they did remove my daughter's entry from the bill, but I doubt we will be back. Such a shame for a charming little place!", "pics": null}}, {"review": {"des": "We came in for restaurant week so $44/dinner. The ambiance is upscale but not stuffy, with warm, low lighting, good for a date night occasion. Definitely don't sit by the door though; on a cold night like ours, we were frozen solid even though they said we were \"right under the heater.\"<br><br>Sitting down, we were greeted with a small loaf of bread (wrapped in baking parchment oddly enough) and butter. We weren't given an actual bread knife though so it was impossible to cut into without completely mangling it. We resorted to just tearing pieces off. The butter was rock hard from cold though which was a bit unexpected and a total bummer. And we weren't given any plates. They just sit the bread directly on the paper covered table, which kind of got crumbs everywhere.<br><br>Our Hors d'oeuvres was the soup du jour: apple chestnut potato soup. It wasn't bad, but not great. It was light while still being creamy and savory, and it was even decorated with edible flowers. But there was absolutely no apple flavor, and I was a bit turned off my the many finger print smudges all along my bowl rim; not the most appetizing thing.<br><br>For my entree, I got the cote de porc which was a pork chop with mashed potatoes and ham hock cabbage. This was significantly better than everything previous. The pork was super juicy and tender with great flavor, definitely the highlight. The potatoes soaked up a good bit of the smoked maple syrup drizzled about though, and it got overly sweet. The cabbage cut the sweetness a bit with its meaty bitterness though so that was nice. <br><br>My dessert was the bread pudding, and it was a real delight. It came in muffin form (which was a bit odd) with a scoop of vanilla ice cream and caramel. I probably call it a super moist muffin, over bread pudding. The flavor was phenomenal though. I absolutely recommend if you have strong sweet tooth.<br><br>Overall, it had friendly (although sometime inattentive) service and a pleasant atmosphere. I just think there some execution issues with some elements of the meal. I don't really think I'd go back anytime other than restaurant week since the prices seem a bit high for what we had.", "pics": null}}, {"review": {"des": "I liked the food. But honestly, the service was mediocre. If they were looking for French snootiness, our waitress nailed it. I asked the waitress for 3 glasses of Champagne at 10:15p, and she said no, they were closing... while I saw people at the bar getting drinks. Okay... I get it. We left. You win.", "pics": null}}, {"review": {"des": "Came here for their Restaurant Week dinner menu, and it was a very satisfying French meal. For $33, I got an appetizer, main entree and dessert, which is a really great deal. I love the upscale yet cozy ambiance that is reminiscent of an actual French bistro. <br><br>The potato and chestnut soup was thick and creamy, and is definitely on the rich side. If you like thick soup, this is for you. I tried the onion strudel and escargot that my friends got, and there were all very substantial and rich appetizers.<br><br>For main, I got the Rushing Water Trout, with a side of smoked trout risotto. The trout was seasoned and blossoming with flavors, the skin crispy and the flesh flaky. The risotto wasn't as tender as I hoped, but its creaminess is definitely what you'd look for in a good risotto. This is a good fish entree for you fish-lovers out there.<br><br>The highlight is definitely the dessert - the creme brulee. The chilled and silky vanilla custard and delicate caramelized sugar top made this a beautifully decadent dessert that will disappear before your eyes in no time at all. You will be dreaming about it for the rest of the night.", "pics": null}}, {"review": {"des": "Say what you will about the food here, but i will cut you if you try to diss their pain perdu. IT. IS. NEXT. LEVEL. Oh, you think bread pudding isn't your thing? THINK AGAIN. I used to think bread pudding was soggy and uninteresting but I am a changed woman now. That's right, this bread pudding was literally life changing. The figs, brown butter soaked brioche cubes, the caramel, the rich vanilla bean ice cream... It is just perfect. If you get nothing else, get this. It is worth stopping by just for dessert.<br><br>Also every Tuesday they have unlimited mussels and frites and i love it, I eat two bowls.", "pics": null}}, {"review": {"des": "Wonderful restaurant. The ambiance is beautiful, service is top notch and the food is outstanding. I have been dining at Bistro Campagne for more than 15 years and I have never had a bad experience. I have been to France a number of times and this restaurant is authentic.  All of the food is good, but I particularly enjoy the onion soup and the filet. The patio is the best in the city for a romantic dinner. The brunch is recommended too. I am so happy that this restaurant is in my neighborhood.", "pics": null}}, {"review": {"des": "This place is incredible! My friend made reservations for a small group last night. None of us had been before. This is one of only a few places I've ever been where literally everything that we had  was absolutely delicious! The entire charcuterie plate, my French ham sandwich, the pork chop, soup, salad, and most certainly the cocktails were all just fabulous! Our server, Tanya, was a delight. Highly highly recommend this place for dinner, dates, or cocktails and hors d'oeuvres", "pics": null}}, {"review": {"des": "BC is easily on my list of favorites. <br><br>The space is so pretty, inside and out.  If the weather agrees, do dine on the patio--you forget you're on Lincoln Avenue as the patio's rustic beauty takes over.  They do a wonderful job keeping the greenery and area tidy--it was a real treat dining there. <br><br>I got there a bit early so I enjoyed a seat at the bar having one of my favorite cocktails--kir royale.  The servers were so kind and even topped off my glass as I waited for service to resume (Oh, I didnt tell you that the whole block lost power for 10 minutes!.  they handled it with complete grace and professionalism and it didn't affect our dinner one bit)<br><br>My pal JW and I dined on a Wednesday--their prix fixe night.  3 courses for $33.  And it was worth a whole lot more!  You can add a wine pairing to each course for a bit extra.  The glass of bubbly they paired with the mussels with perfect. <br><br>I opted to start with the mussels--the mussels were on the small side, but the bowl was so full of them that it was still enjoyable.  The broth was divine--so flavorful and worth every carb dip of bread to sop up all that goodness. <br><br>My second course was the trout.  Seared to perfection.  It was served with mushroom and peas.  It was a light dish but still very filling. <br><br>I opted for the creme brulee for desert and it was made perfectly as well.  I love cracking that sugar shell--it's so satisfying!  <br><br>I did get to taste the other dessert--the pots de creme--which was also wonderful.  A must for any chocolate lover. <br><br>I can't wait to come back and dine here for some wonderful French bistro classics.", "pics": null}}, {"review": {"des": "We started out as a once-a-year patron because it was farther from our old house. Now that we've moved to the general area we go here weekly for our date night. The food, service, everything is always consistent and delicious. I strongly recommend the steak frites and salad lyonnaise. This place is an excellent neighborhood gem!", "pics": null}}, {"review": {"des": "Oh my good god drop what you're doing and eat here IMMEDIATELY. <br><br>My mom, sister, and I came here last night for my mom's birthday dinner and we were BLOWN AWAY. <br><br>Let me recount:<br><br>Parking's great: metered street parking right outside or in the lot across the street. <br><br>The place itself is super cute and French-y; lilting, jazzy music is piped through the entire place, and the inside is a cozy and winding with candles flickering everywhere. They have two schweet outdoor seating areas; one in the front, facing the sidewalk, and one in the back. I wanted to sit inside though since I prefer not sweating into my wine glass.<br><br>Our server, Aneta, was AMAZING. She knew her wines (we got a lovely bottle of momay (?)), told us her preferred way of eating the steak tartare (smash the yolk into the tartare, spread mustard on a piece of rye, top with a heaping of tartare and a few pieces of pickled green bean, and then nom on the lemon pickled anchovy as a chaser), and was super funny and attentive and kept bringing back loaves and loaves of the most beautiful-sounding French bread and the most delectable, full fat butter. <br><br>We ordered the escargot (my god, that parsley (?) butter sauce is TO DIE FOR), steak tartare (my life has been changed not even kidding), salmon (with the most perfectly roasted asparagus), pork chop (OMG SO TENDER), trout (crispy af with the most bomb rice), and a side of sauteed mushrooms and cheesy asparagus. <br><br>We basically rolled out of the restaurant but I don't even care; I need to come back and try everything else on the carefully curated menu. Also, I didn't order anything for dessert because I was so g-d full. (The portions are pretty big, considering it's a French restaurant. Am I complaining? Hell naw.) But Aneta brought us a little cup of vanilla bean ice cream with a candle for my mom, which was v cute.<br><br>Literally, go now. Don't think twice. Go for a date, a GNO, a wedding rehearsal dinner, a friends reunion, go go goooooooooooo", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YR1CjQ6gJvBzYLGfQxcm8w/348s.jpg", "caption": "Trout, pork chop, wine, asparagus, mushrooms, salmon"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2DcUQ2AUqx1BLC532tA1VQ/168s.jpg", "caption": "Escargot"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jtDDuJoMwap5YYCeKiHUoQ/168s.jpg", "caption": "Steak tartare"}]}}, {"review": {"des": "This restaurant came highly recommended. We were seated promptly when we arrived (7:30 reservations). The lighting was so poor that we were using our cell phones to read the menu as was the table next to us. Our waitress was friendly but after several interruptions didn't take our appetizer and main course orders for 45 minutes. I'm not a fan of rushed dining but that was stretching it out a bit. To start I had the lyonnaise salad. The baby spinach and frisée were great with the dressing but the cuts of pork were very chewy. For my main course I chose ratatouille which is one of my favorite dishes. It was flavorless and burnt on the bottom. For dessert bread pudding which was FANTASTIC!  If I come back I will order something else.", "pics": null}}, {"review": {"des": "Beautiful little bistro in uptown Chicago. There is plenty of parking across the street. You have to pay on the parking meter. We came here for my boyfriend's birthday dinner. They have a beautiful little garden outside that you can dine at. The service is great and waiters very knowledgeable about their menu. I love the garden outside and I would say it's great for a romantic date. It's not a loud place most definitely. It's very quiet and romantic. The best part of this restaurant is the food for sure!! I have never eaten such a tasty, soft, amazing chicken. I also had the yellow gold potatoes which were out of this world. Just so good!<br>The only thing I thought was odd, is that in all other restaurants, they offer complimentary piece of cake for birthdays. I had requested it when I made the reservation but we didn't get one.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/95j69jsM5MpfTtdzCgYbkQ/348s.jpg", "caption": "Fillet mignon"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MZZd5rpceHRM45PYqGBDsw/168s.jpg", "caption": "Chicken with potatoes, spinach and green beans (AMAZING)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HaTOlYGVdw2lwtMl8jVvDQ/168s.jpg", "caption": "Outdoor garden"}]}}, {"review": {"des": "Here for brunch. Love the mimosas and bloody Mary's. Feel like I am at a bed and breakfast. Our waiter,Ryan,was very friendly. Great service from everyone. My daughter orders the Mac and cheese and loved it. I ordered the bistro benedict with spinach and sauce on the side. It was delicious.  Although i likes the potatoes that come with it, i would get the side salad instead. My mom said it was delicious.  My brother got the French toast which was beautiful and tasty. My mom ordered the quiche of the day which she also liked.  Bacon was done perfectly. A little pricey for breakfast but worth it. Will be back.", "pics": null}}, {"review": {"des": "Bistro Campagne is a beautiful, intimate French restaurant in the Ravenswood neighborhood. I would recommend coming here for dinner with a small group of friends or a date.<br><br>As many reviewers have noted, the escargot is FANTASTIC. Note that all appetizers, including escargot, are small plates. The artichoke dip comes with only two pieces of bread. Delicious small plates, but SMALL, so be expecting to spend some cash on the rest of the meal. My total after the meal and a glass of wine was $70! <br><br>The main entrees my friends got looked good, but I was disappointed with my gnocchi. It was a carrot gnocchi which didn't have the texture of gnocchi that I was seeking. Instead it was mushy, but it had an interesting green pesto chickpea sauce which added some good flavor. Friends got the lamb special, the sandwich with egg, and the beef and potatoes. There were not any complaints about these dishes, and I apologize I didn't get more deets for my fellow yelpers!<br><br>Overall, this place is DEFINITELY strong in representing the French cuisine and romantic atmosphere. I would recommend Bistro Campagne for a lovely dinner in a place that's a different.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DjOkJNVZ_yJtlU_XRUPimA/348s.jpg", "caption": "Carrot gnocchi"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YmooddSMFU6b19R9bQoCcA/168s.jpg", "caption": "Interior room"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mO267-9ASbqesann69STbg/168s.jpg", "caption": "Sandwich with poached egg"}]}}, {"review": {"des": "Oh my goodness!  What a magical treat!  My husband came here for our anniversary dinner and it was one of the most amazing meals I have ever had.  We got the artichoke & crab fondue, muscles, the filet (Steak Frites) and the pork chop.  For dessert the lemon tarte and the creme brulee.  I had been here years back, before this particular chef, and it was good, but not AMAZINGLY DELICIOUS like it was last night!  I would likely recommend this restaurant.", "pics": null}}, {"review": {"des": "Went here for the first time this past Friday. Made a reservation on OpenTable. Although unable to reserve patio seating, I put it in the request notes on my OpenTable reservation. Upon arrival, there were no tables available outside. However, we had the choice to be seated immediately or wait for a seat outside. We chose to wait, and they had a nice waiting area outside where we were waited on immediately and able to order drinks. <br><br>I ordered the croque madame sandwich and my boyfriend ordered the salmon. Both were so very good. My sandwich was particularly big and came with a HUGE side of fries. <br><br>The ambience of this place is romantic and cozy; it does not feel like you are in Chicago. <br><br>Lastly, I believe our server's name was Sarah, and she was exceptional. We will definitely be back.", "pics": null}}, {"review": {"des": "What a lovely classic French restaurant.  Had the chicken it was delightful.  The duck confit was outstanding.  Our guest were very happy as well.  Had some appetizers; the cheese plate, the onion soup and mussels were very good.  Our guests loved the mussels so much they said they are coming back just for mussels <br><br>Great wine list as well. Had amorfos which was wonderful. A galaxy from France that everyone enjoyed <br><br>Our sever was perfect!  Which made for a delightful evening. .", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JNN6pbODG0_kwvShUXKJaQ/168s.jpg", "caption": "Spinach with garlic chips"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZA1jhXB4SM-QhFo_FpO5ng/168s.jpg", "caption": "Chicken"}]}}, {"review": {"des": "What started as a simple stroll through Lincoln Square ended with a random dinner here, and I am so glad it did. This is rustic dining at its finest. The service was impeccable and the food is environmentally sound and absolutely delicious. Get a steak. Do it.", "pics": null}}, {"review": {"des": "I tried to plan a private party here on the recommendation of a friend, filled out the Plan Your Event form on their website, but never received the courtesy of a reply call or email.  Their menu looked delicious and their outdoor space gorgeous, so it's a shame whoever handles their private events isn't more professional and on top of things.", "pics": null}}, {"review": {"des": "This is such a delightful place. The atmosphere is unbeatable- do grab a patio table if it's available, but the interior is also incredibly charming. <br><br>Great service, everyone is friendly and helpful. They have an extensive wine selection, but I can't resist their awesome cocktails, try a French Manhattan! <br><br>Food is top notch- I recommend the onion strudel appetizer, it warms my heart. Entrees are all really solid, the chicken, pork chop, and even the sandwiches are divine. The bartender recommended we have pinneau des chearents with our pain perdu dessert, and oh man, what an amazing combo.<br><br>This place is our special occasion go to, and I can't recommend it enough!", "pics": null}}, {"review": {"des": "My guy and I were SO looking forward to coming here. So many things on the menu sounded amazing, great reviews, and a super cute location. What a major disappointment & disrespectful establishment. <br><br>We were most excited for the escargot. Love it and hadn't had it in a long time. Other reviewers seemed to love BC's, but I have had better escargot on a cruise ship with a lot less attitude on the side. The charcuterie board was decent, but overpriced compared to other restaurants nearby. <br><br>Pretentious & non-existent staff were terrible to us. There were many plates crowding our small table with two appetizers arriving at the same time, so we accidentally knocked over a glass of wine. We believe this might be why were treated awfully the rest of the time. Believe us, it was OUR loss on an expensive glass of wine. No one from the staff even came to give us extra napkins to clean up or even offer to clean up the spill. I sat there the rest of the time with a wet sleeve and trying to avoid the wet tablecloth and the folks at the next table had to sit next to a spill on the floor. Maybe if our waitress had ever come back to the table after our initial order, she would have noticed the spill. <br><br>We had to flag her down to order our next course. After placing our order, the bartender came over to say he couldn't serve us the port we ordered with dessert. He wouldn't tell us why, only that it wasn't his decision. Our waitress beat around the bush and wouldn't tell us why. We were not drunk if that is what they were implying. We were very polite the entire time we were there. Our tablecloth had more wine than we did! We canceled our desert and just took our check. We left flabbergasted at what had just happened. <br><br>We spent well over $100 on our appetizers and wine and are not afraid to drop money on a nice dinner out. But we were MORE than happy to take the rest of our evening elsewhere for dessert and to be treated with respect... which we were. We certainly won't be back.", "pics": null}}, {"review": {"des": "I have been eating at Bistro Campagne for years and it never disappoints.  The food is always delicious, the service is always on point and the drinks, from the cocktails to the wine list, are impressive.<br>The food is very classic French but it always feels like you are eating something new.<br><br>Most recently we had the duck entree which was perfectly cooked with the right balance of flavors.  It managed to be both earthy and bright in taste with the parsnip puree, crispy parsnip ribbons, maitake mushrooms, mache, sherry gastrique.<br>The mussels are always spot on in a wonder Belgian ale sauce.  <br>We tried the Fondue d'Artichaut, the  Baked artichoke, fennel, crab meat and cheese fondue.  Decadence at its finest.<br>Bistro Campagne also boasts one of the best burgers in the city.<br><br>It is not only a perfect neighborhood bistro but a true destination restaurant as well.", "pics": null}}, {"review": {"des": "Have the chicken. You can have whatever appetizer or dessert you want, but order the chicken for your entree - one per person! <br><br>This chicken is the best chicken in the world. Not kidding.<br><br>During my first visit, I stayed drunk and until the end of business to beg the manager to get the head chef to release the recipe for this chicken - of course when i finally got it, i realized I'd never in my lifetime be able to cook up this chicken with my cooking skills and serious disability in following directions.<br><br>So, in the past three or so years, I came to this place about 15 times, during which I ate roughly around 15 of this chicken dish. Consistently heavenly. Drool.<br><br>Service: great<br>Ambience: Romantic, cozy<br>Chicken: Amazeballs", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/38iDd9D_AMbz292ms3HmQQ/168s.jpg", "caption": "Omg the chicken"}]}}, {"review": {"des": "I love the ambiance of this restaurant  - it is chic and very romantic, perfect for dates - especially if you sit at their outdoor garden patio! The food is amazing as well - we ordered escargot, trout and the amish chicken. I would say that out of everything we ordered, the amish chicken is what I highly recommend! It is very tender, very well cooked & the sauce and onion crunch that comes along with it is a super delicious! I would go back and order the amish chicken again in a heart beat! <br><br>Highly recommend this place - great service as well!", "pics": null}}, {"review": {"des": "The food is consistently exquisite, a major accomplishment after this many years. I'm so proud to take out of town guests here. They're always stunned at the European atmosphere, and the authenticity of the experience, from start to finish. Best starters: steak tartare and escargot, Best salads: lyonnaise, and smoked salmon, Best entree: chicken with mushroom ragout and duck confit. <br>Best dessert: blood orange sorbet with their awesome Sauternes. My fave go-to for an extra special kinda evening! CONGRATULATIONS!!! YOU GUYS ARE THE TOTAL BOMB!!!!!", "pics": null}}, {"review": {"des": "Great little French restaurant. Perfect food, great service, beautiful ambience. Love the concept too, all the ingredients are sustainably sourced and fresh as can be! To be honest, I'm not usually the biggest French food fan, but after this meal I'm wondering if I've just never had great French food before...<br><br>Made a reservation for Sunday dinner with friends. Walked in and was wowed by the warm decor. Got seated and looked at the Chicago Restaurant menu, which was very extensive and generous. My friend asked for a wine recommendation based on her food selection and the waitress knew her stuff!<br><br>Onto the food. I got the Strudel à  l'Oignon Caramélisé, and it was a great onion cheese pastry in perfectly savory sauce. Tried the Fondue d'Artichaut as well, which was stronger and creamier (smaller portions though). I loved both but I'm glad I picked the strudel. For main courses, I got the Truite (trout), one of the best trout dishes I've had. Crispy and sweet skin, gorgeous mushrooms. The one thing is that my plate seemed to have a proportional excess of green lentils (I felt like I was eating them forever), but everything was still delicious. Friends got Amish chicken and pork chop dishes, which were delicious but huge! They were nothing like the heavy French preparation I've had before, these were done with a light touch that let the ingredients shine and the palate breathe. Finally, for dessert, we tried the Pot-de-Crème  au Chocolat, Crème Brûlée, and Pain Perdu. All were creamy, rich, and just sweet enough but not too loud to overpower the delicate meal we'd just had. The chocolate creme was solid and rich, so beautiful. A wonderful experience, will definitely be back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UzYb_dmu9LB2Vzt84q0ePw/348s.jpg", "caption": "Strudel à l'Oignon Caramélisé"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rD5bePsRdBY1g5vm7dMRqA/168s.jpg", "caption": "Truite"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XbyzPA4Mbak0OgguDcoA7g/168s.jpg", "caption": "Pot-de-Crème au Chocolat"}]}}, {"review": {"des": "Bistro Champagne was a great restaurant in theory! My boyfriend and I made a reservation for the outdoor dining area on a lovely summer evening. This place is perfect for dates and special occasion dinners. The service however was very slow and the server didn't seem to care about our table. I understand the slow service may be part of the expirence but it took an hour and a half to get our entrees! My boyfriend had to go put more money in the parking meter since the maximum time is 2 hours. And one of us ordered a simple salad which should take no more than 5 minutes to prepare. The server tended to the other tables more attentively than ours (the food runner was more caring about our service than our waitress). There were other tables whom of which were sat after us and were tended by the same waitress who were in and out faster than us. We are both in our early twenties but spent well over $100. We would have bought dessert but I didn't want to have to pay for parking the third time. It's a shame we get discriminated by our age even though we may have spent more than the other tables on the patio. I would recommend this place if you are in a larger group or over the age of 30 so the staff takes you seriously. I was quite disappointed because this place was so cute looking on the outside when I walked by a month ago with my parents.", "pics": null}}, {"review": {"des": "My fiancé and I have dined here quite a few times for our yearly anniversaries. I love their food! And I LOVED their Profiteroles but they were no longer on the menu on our last visit. :( great food and really nice staff. It'll continue to be a tradition for us. (:", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TCLEssxq0BWoLapX2yZmHQ/348s.jpg", "caption": "Steak Frites"}]}}, {"review": {"des": "I thought I'll try this place again.<br>The patio is nice, but that cannot be said about the service, once we ordered,  no one came, no bread.  we ordered the  house hamburger and the salmon. <br>The burger was nice but not so for the salmon. <br>Was hoping for a better experience. <br><br>If you want nice atmosphere sit  outside at the patio, food? Is a different story.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kxEO4bE5Jx4zmJvILX4puw/348s.jpg", "caption": "Salmon,  not recommended."}]}}, {"review": {"des": "I don't give out 5's easily, but this place was great! <br><br>First off, it is pretty expensive so I would say this is more of a \"treat yourself\" type of restaurant for most people. But everything that we had was well worth the cost. Everything was cooked perfectly from the Duck Confit to the Hanger Steak. Also, for an appetizer, the Artichoke Fundue was amazing! Lastly, we shared Fig Bread Pudding with Vanilla Ice Cream and Caramel Sauce, and that was amazing also.<br><br>We left satisfied, and all of the staff was highly attentive without being overbearing. Definitely check it out when you're ok spending some money!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XsV0K0GOmL_Ht6SOjW7JZQ/348s.jpg", "caption": "Steak Frites (Hanger Steak)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RLUDehVpJjhmKwLoPSxBZQ/168s.jpg", "caption": "Confit de Canard (Duck confit)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wIP-0mjND7g0LryhABWSXw/168s.jpg", "caption": "Pain Perdu (Brioche Bread Pudding)"}]}}, {"review": {"des": "Overall: Fantastic French experience with amazing food, service, and atmosphere.<br><br>The good: The food is phenomenal. I'm not a French foodie, but everything tasted great from the apps to the main course to the desserts. Everything was hot and fresh, was well portioned, and presented well. The service overall was great, and the atmosphere is nice with a cozy \"french cottage\" feel.<br><br>The bad: We were seated next to the bus station, which was loud and unappealing. Gets pretty expensive.<br><br>Atmosphere: 9/10<br>Service: 9/10<br>Food: 10/10", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/R92wsIpp83KwV26DIA7Mdg/348s.jpg", "caption": "Pork"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/52FXU_voQUZFVmdaHsZkrw/168s.jpg", "caption": "Bread pudding"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wLlcrD2PJ4ibKa5KUKRNEQ/168s.jpg", "caption": "Pot de creme chocolat"}]}}, {"review": {"des": "My partner took me here for my birthday. The staff was very attentive. They didn't have a lot of vegetarian options for my partner. However,  my soup, salad, bread, and cheese plate did not disappoint!", "pics": null}}, {"review": {"des": "The waitress was all smiles and very polite. Ordered lemon hot water and was served a small cup of water loaded with two generous wedges of lemons. One of the most citrus water I've had in while, which is completely necessary as it was intended to cleanse out my digestive tract. <br><br>Back to the course-  I ordered the tried and true all time favorite Steak Frites and was not disappointed. The hanger steak was completely drenched in savory bordelaise sauce which i used to dip the fries with. Recommend medium rare to medium. 10/10.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JPWhJAflTPDgme4e2-kiLQ/348s.jpg", "caption": "Salmon entree."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/soOoDaUg9hly1IxZkrcHJw/168s.jpg", "caption": "Salad maraîchère au chèvre chaud."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/esnoVWBlz9AXOL2Au4q3NA/168s.jpg", "caption": "Steak frites with savory bordelaise sauce."}]}}, {"review": {"des": "This is really a 4.5, not a 4.<br><br>I originally came here in 2012, and remembered it as very good.  My husband remembered it as a stand out and insisted we return for this year's anniversary.  It was excellent.  The rundown:<br><br>Ambiance: cozy yet cafe-ish.  We were seated looking through the shutters into the garden area, which was probably about as charming as it gets.  They also had a classical guitarist that night, which was such a lovely and warm touch - simply perfect. 6/5 (not a typo)<br><br>Fondue d'artichaus - it was very creamy, rich, not oversalted, and you could actually taste the artichokes.  However, it was essentially a high end version of spinach artichoke dip.  It was very good, and if you're not too adventurous, get it, but it didn't \"stand out\" 4/5<br>Strudel à l'Oignon Caramélisé - same as the above - it was flaky, well executed, the onions were cooked properly, but not a standout.4/5<br><br>Confit de Canard - If you read the menu, it sounded like it would be like many plates these days - many random vegetables strewn about the plate.  However, in this case it all worked extremely well together 5/5<br>Steak Frites  - It was cooked absolutely perfectly temperature wise.  I just wish it had had slightly more flavor for a hanger steak.  Maybe I was in the mood for a filet?  4/5<br><br>Drinks - I don't remember specifically what I had of the cocktail menu, but I do remember it was well balanced.  As for the wine, I did what I always do at reputable restaurants and just asked for a wine that paired nicely. It was a bordeaux she brought, and it was delicious.  5/5<br><br>Pot de Creme -  Elegant and creamy and cold and sweet and rich and the perfect ending. 5/5 (hard to go wrong)<br><br>I highly recommend it if you're looking for traditional French bistro fare.  Next time we'll just be slightly more adventurous with the appetizers.", "pics": null}}, {"review": {"des": "Wonderful food in a classic Chicago neighborhood.  The food is delicious and some of best classic French food in the mid west.", "pics": null}}, {"review": {"des": "Bistro Campagne is located in a vibrant restaurant area on Lincoln Ave. There is plenty of street parking and a lot across the street. <br><br>Ambiance: The restaurant has a charming and warm atmosphere as you enter. The interior is rather dark with a long bar right by the front door and dining tables in the same room which can get noisy.  We noticed there was more dining space towards the rear of the building and is more brightly lit.  It probably would have been better to be seated in the back because it was very difficult for the elderly couple with us to see the menu or hear because of the noise. <br><br>Service was friendly but our waitress was very busy and we had to flag her a few times.  <br><br>Food and Wine were good.  There were many options to choose from.  I do think that the usage of salt could be dialed back.  I read other reviewers make the same comment and it looks like the chef may not read these reviews.  <br><br>Escargot au Beurre d'Ail -  The escargot were plump and the garlic butter sauce was delicious.  However, It should have been served with bread that we had to request. <br><br>Salade Lyonnaise - Baby spinach and frisee, with poached egg, haricot verts, crostini, bacon lardon, warm bacon Dijonaise  was very fresh and delicious.<br><br>Magret de Canard -Rohan duck breast, parsnip puree, crispy parsnip ribbons, maitake mushrooms, mache, sherry gastrique.  It was an interesting combination and one of our friends loved it but the other did not comment. <br><br>Steak Frites with Filet Mignon - The steak was moist and tender and cooked to perfection.  The sauce was delicious.  I could not finish half of it so my husband helped me out. <br><br>Bœuf Bourguignon - Certainly the presentation was great and a good comfort entrée.  My husband ordered this and seemed to enjoy it but I found it to be super salty, which was the point I made earlier.   The first pieces of meat I tried were also fat and grisly but the remainder of what I tried was fine.  <br><br>Lemon Tart - The dessert looked very good because our friends demolished it.  However, I noticed that the crust looked hard and dry but there was probably enough whipped cream to help soften it.<br><br>Overall, a solid dining destination.", "pics": null}}, {"review": {"des": "A friend and I went for a last minute dinner n the neighborhood and stumbled upon a review or Bistro Campagne. We started with drinks, which were reasonably priced although I should add I'm used to downtown prices, they didn't have the vodka I wanted (Grey Goose) for my martini but the server was knowledgeable and pointed me to a great substitute (North Shore). We had a house salad and a fondue, more like a dip, to start. The fondue/dip was very tasty while the salad was just ok. There was a bit of sand in the lettuce. For the main course we had a cheese and charcuterie platter and the steak frites made with hangar steak. The fries were ok but the steak was absolutely perfect. The perfect temperature and a generous serving size. It really hit the spot. The reduction served along with it was quite tasty and rich  but I could see it being interpreted as too salty, cloying and a tad greasy on an off night. It came ever so close to crossing that line. The cheese and charcuterie platter was quite good as well. Someone really knows their cheese. For dessert we had a Pain Perdue which was good but very sweet and a tad dry and a great sorbet. All in all it was a very nice meal and we will be back. Next time I plan on trying the roast chicken and mushrooms.", "pics": null}}, {"review": {"des": "What a surprising find so close to home. Garden is just perfect for a summer dinner for 2 or 8. I had trout with wild mushrooms that was just excellent combination of soft and crisp textures. But the winner was Amish  chicken dish  - perfectly moist with onion frits and wild mushrooms.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GJ2L96-_V2ynMTAPZCtmwQ/168s.jpg", "caption": "One of the best chicken I had in many years. Onion frits done to perfection."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KnM85u3r_HPWHFkXrYAJ_g/168s.jpg", "caption": "Perfectly crisp trout with wild mushrooms"}]}}, {"review": {"des": "My wife and I went here on a Saturday for dinner. We were greeted and seated right away even though we showed up an hour early. We both loved the cozy yet classy ambience that made us feel like we were in an actual French bistro.<br><br>We had the escargot for an appetizer which turned out to be excellent! The wine selection is wonderful with a wide variety to choose from. We had the trout and chicken for our entrees. Both were very satisfying and we highly recommend either one. The prices were reasonable compared to other French restaurants in the area, but the quality of the food is well worth it. The service was great as well from start to finish. Definitely a must for anyone looking for a wonderful French dining experience!", "pics": null}}, {"review": {"des": "Best French restaurant in Chicago. They really do know their French staples. I have never been disappointed. The bar area is the coziest. Perfect for special occasions or get-together with friends.", "pics": null}}, {"review": {"des": "Maybe there is some whiz out there who can answer these  questions? Aren't businesses dependent on satisfied customers?  Isn't it hard to get new customers? Don't you want satisfied patrons returning? This evening we had dinner at this establishment. The food was good and the ambiance passable. The service the wait staff was average at best. <br><br>When I called to make reservations I asked for 6:30 reservations. Oh No we are booked was the answer. Either 5:30 or 8:45. Well we took 5:30 although our preference was 6:30. We sat down at 5:30. At 6:30 it was half full. When we left at 7 there were still tables available. Can someone please give me a credible answer to the issue of forcing a 5:30 time? We had a party of three. We drink moderately. Our tab this evening, including tip was about $220. Am I happy,  absolutely not. Will we return of course not. We usually go to Gather which I think knows how to do business. We thought we would try this restaurant based on a friends recommendation. Too bad. Once in a while we visit Elizabeth which is one of the best restaurants in the city. We always try to go to a fine eatery in Chicago. In NY we get into Daniel with some luck and connections. I do not need to be yanked around by a second class establishment which lies to its potentially new customers.", "pics": null}}, {"review": {"des": "Our party of four had steak frites, trout, salmon and chicken.  Everyone loved their food.  Service was terrific.  Wish they had some draft beers but there was a decent selection of cans and bottles.  <br><br>The ambiance of the place is charming like something in the French countryside.  We ate outside on a patio on a warm night with fireflies and ivy covered brick walls.  it reminded me of a place somewhere in the in the Loire where I ate over 20 years ago. <br><br>Lincoln Square area is a beautiful part of Chicago that I never visited before and would like to explore more.", "pics": null}}, {"review": {"des": "Nice place, food was on different level. That's my wife's favorite French restaurant in Chicago.", "pics": null}}, {"review": {"des": "Bistro Campagne is so quaint!  Despite a few small missteps, I will definitely be back again.<br><br>Location and parking are easy.  On a Friday night at 7:30 I was able to get street (meter) parking right in front of the restaurant.<br><br>Staff was welcoming, as if you were dining in their own home.  Great first impression.<br><br>After we were seated, my heart sank to see that the 2017 restaurant week menu was not the same as the restaurant week menu that had been posted online the week before when we made the reservation.  I thought that I would have no options, because nothing on the new restaurant week menu was appealing.  Thankfully, Bistro Campagne offers nearly their full menu for restaurant week, for just a few dollars upcharge here or there.<br><br>The French onion soup is no joke.  It is the real deal, and it is delicious.  Between this and the warm bread, I could've had a meal and been happy.<br><br>I ordered the pork chop as my entree, and sadly, it missed the mark.  It was very very heavily salted, to the point where I had one of my friends taste it to see if I was crazy.  I'm not too sensitive to salt, but it was nearly inedible to me.  Being that it was restaurant week, I didn't say anything, but I now regret that.  My sister had the steak frites which was awesome, and my friend had the chicken that was on the restaurant week menu, both of those items were perfectly cooked and seasoned.  Womp Womp for me.<br><br>Dessert was great - I had the creme brulee and both of my dinner mates had the chocolate pot-de-creme.  Both were outstanding.<br><br>I'm not discounting Bistro Campagne, because I do think that my overly salty pork chop was a fluke.  The next time I have something to celebrate, I'll go back and try again.", "pics": null}}, {"review": {"des": "Came here for dinner, ambience seemed nice and was ready to order. Waited over 39 minutes until anyone came, waitress was ok, not very knowledgeable about menu.<br><br>Food was ok, portions small and could of been warmer. Dessert was ok, very sweet, again for the price, very small!", "pics": null}}, {"review": {"des": "Delicious! We went there for Restaurant Week and it was fantastic!<br><br>I ordered the French Onion Soup, the Steak Frites, and the Creme Brulee. ORDER THIS!<br><br>The prices are a bit up there, so the Prix Fix menu for RW is perfect. <br><br>We also order cocktails and wine and loved everything we ordered. <br><br>Definitely try this place out.", "pics": null}}, {"review": {"des": "\"Alex\"  The acting manager was horrendously rude and pretentious.  Had a reservation for two and they wouldn't seat me until the other party (of one) arrived (the entire place was empty). Keep in mind they would seat every walk in right away lol. Even if it was a Party of ONE.  I asked them if they could see me outside just to wait for the other party and They told me I could sit on their crumbling and dirty bench outside LOL. <br><br>Quite frankly I'm darker than most of the crowd that goes there, so I'm pretty sure there was some blatant ethnocemtriscm going on because I wasn't a normal hipster-blond hair-blue eyed-ripped jeaned-clientele they were jonesing for. SO If you want to go to a \"French\" place where everyone is a stuck up yuppie who is by far more Anglo-Saxon than French, go here.<br><br>So disappointed and sickened that we left before we even ordered appetizers. However, if you want to  find a bunch of 30 years old who can't  get a real job who think they're cool and elite because of their tattoos, American apparel clothing, and French identified restaurant ...THIS IS YOUR PLACE. <br><br>Sincerely,<br><br>A European citizen", "pics": null}}, {"review": {"des": "Nice brunch, little quaint authentic French place. This is a solid spot for a weak North Center dining scene.<br><br>(Can't remember French names)<br>Biscuits: A<br>Salad: A- (mixed greens with Dijon and fried goat cheese)<br>Duck hash: B+<br>Vege omelet: B+", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Gcc6pBoScM2IMCciU-x66w/168s.jpg", "caption": "Orval Belgium beer, floral taste very different"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ap2ohUYOWvZnY_pAHmUmbg/168s.jpg", "caption": "Duck hash"}]}}, {"review": {"des": "Have had dinner there several times and always a great meal, a first rate French restaurant................................................................................................................", "pics": null}}, {"review": {"des": "It was cold out and they kept it locked until opening time.   We could have waited at the bar w/o see vice just to warm up.  But, this was an incredible evening the server was professional and fun did a perfect wine match with beef cheek bourginione which was a great surprise.   The leek. Potato apple vichysouis was unique and we loved it.   So in my view it felt great and was a great dinning experience.", "pics": null}}, {"review": {"des": "Quality has really diminished. The beef bourguignon had hardly any flavor save for extreme levels of salt so as to make it completely inedible. Such a waste of beef cheeks. Waitress couldn't care less. Flourishes and garnishes, such as a leaf or berry on the creme brulee are withheld. One the bright side, the onion soup was almost perfect except for the heavy-handedness with the salt, again.", "pics": null}}, {"review": {"des": "Very intimate setting and good service. In case you are circling around the neighborhood for parking...well keep searching.  I learned there is no valet parking for restaurants in this area. The hospitable host did provide suggestions for parking though<br><br>The chicken option for RW was the highlight. It came with perfectly thin and crisp onions on top. The French onion soup was probably one of the best I've had. Steak frites looked better than it tasted. The sauce was a bit salty for our preference. Potato croquettes were forgettable. <br><br>Overall it's certainly a good place to for nice dinner date. I probably would enjoyed it even more if I wasn't sick.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/q4jGZHAHEAqeE3Sz4g4sXw/348s.jpg", "caption": "Potato and cod croquettes. Eh!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/s-r4Ybv5kO6MkishEKyxMg/168s.jpg", "caption": "Best French onion soup!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XTM5O_GnhrKfn03hKsnOOw/168s.jpg", "caption": "Steak frites"}]}}, {"review": {"des": "Still our favorite French Bistro after all these years. A great date spot for 2 and a wonderful spot for small groups. Great food, great appetizers. Portions have gotten smaller than in prior years! Some personal favorites from the appetizers include: escargots, steak tartar, mussels, cod croquettes. Entrees are dependent on what's in season. I've had fowl, fish, and meat entrees and have never been disappointed. Great wine, beer & cocktail selection.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/f-HbfzmVcVdUlhEzSC2RcQ/348s.jpg", "caption": "Steak Tartar"}]}}, {"review": {"des": "Had such a great meal/experience here Friday night! My husband and I went with another couple that had been raving about this place for months. From start to finish it was basically perfect. The dining room was extremely lovely and with the candlelight had great ambiance. Food? Oh, man. Everything was highly seasoned and incredibly flavorful. We all loved everything we ordered. I highly recommend the chicken dish, as well as the pork. Everything was cooked perfectly. Our server was attentive but unobtrusive. Sigh. Will definitely be back and I highly recommend this place, esp. for a date night, anniversary or a meeting-the-parents dinner. Excellent! Oh, and get the onion tart for an appetizer! To die for!", "pics": null}}, {"review": {"des": "If this is seriously regarded as \"Chicago's most romantic restaurant\", as stated in several reviews, y'all are in serious trouble. The patio seating is pretty, and live jazz every other Sunday is a nice touch, but the service and food fell below expectations and it really isn't all that upscale.<br><br>LE GRAND BALLON ROSE: Ordered the whole bottle (~$40), had buyers regret because it just wasn't that great. Maybe it needed to breathe, or maybe or expectations just got lower and lower with each underwhelming dish, because the last couple of glasses tasted the best... before we found the flies. More on that below.<br>FRENCH ONION SOUP: Delicate and underseasoned, perhaps on purpose. I have to wonder if everyone raves about this dish because of the insane amount of cheese (at least an inch thick) or if I just caught the chef on an off day. Didn't finish this.<br>ESCARGOT: The garlicky sauce is damn delicious. Mop it up with your bread and lick the cups clean. If your date won't kiss you afterward because of garlic breath, he isn't the right one anyway.<br>BEEF TARTARE: This was tasty, served with hardboiled egg, pickle, and  mustard with pumpernickel. Not the best version I've had but it was probably the best app we had here.<br>STEAK FRITE: The hangar cut is good quality and cooked perfectly but again, underseasoned. Butter-garlic sauce was minimal but divine. Fries, in contrast, have more salt than McDonalds; seemed to be the only dish on the table with any salt whatsoever.  Fries were incredibly crispy though, which was appreciated. This dish was \"just fine\" instead of \"really good\".<br>SIDE OF MUSHROOMS: Nicely done, good complement to the steak dish and also coupled well with the frites. Wouldn't consider this a must-get item, but it's a decent side choice.<br>PAIN PERDUE: Bread pudding with brown sugar and fig preparation. Our server warned us it was a large portion but it was normally-sized to us. And, as I predicted, it lacked flavor. Should have gone with my instincts and had dessert elsewhere. I think this is the first time we haven't finished a bread pudding dessert, ever. <br><br>Service was a little off. Our gal seemed to have far too many tables to manage, which was every table in the back room (5) and then some, guy bussing tables was friendier. We found several flies in our wine, and when we pointed this out to our server she searched around for open windows, and made several comments about us being the only ones affected. Felt this could have been handled better. Service was not on par my expectations for a $150 dinner.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6hXKWNfSmyNGfp2xVSS6Zw/348s.jpg", "caption": "Basic bread pudding"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iSw_ysOPSudVDMx4NVfJkg/168s.jpg", "caption": "Steak frites"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Jb7tYZXPeQTDIze3574BkQ/168s.jpg", "caption": "Side of mushrooms"}]}}, {"review": {"des": "This is an very cute, romantic French restaurant perfect for an intimate date night. We decided to dine here for Valentine's Day because I wanted a French restaurant (last year we were actually in Paris for Vday). <br><br>The ambiance was dark and romantic, and the entire staff, including our waiter, was very friendly. We took awhile to pick out what wine we wanted, but our waiter was happy to let us taste 4 different kinds. He also was very attentive to my allergies. They cook all of their frites in peanut oil which is very important for me to know because my boyfriend was going to order the steak frites (of course I would have tried some). They may want to make this known on the menu because peanut allergies are very common. <br><br>We started with the Charcuterie Board, which was pretty good (not as great as Paris, but that's asking a lot). The warm baguette was a nice touch. My boyfriend had the steak frites but with mashed potatoes instead of frites, it was delicious. I tried the salmon, which was also very good.<br><br>I enjoyed this restaurant a lot and I wouldn't mind trying it again!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1FSyC8iv-bG5-xMuQ11T9A/348s.jpg", "caption": "Saumon - Scottish salmon, butter poached rutabaga, roasted beet puree, pickled red cabbage"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SGmkUUhdgzvEbzINtyuXKw/168s.jpg", "caption": "Assiette de Charcuterie - Assortment of artisan-made pâtés, seasonal condiments"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xcgSp066N3w7C4Yw3I87Rg/168s.jpg", "caption": "Steak Frites - Sustainably raised Meyer Natural hangar steak, Bordelaise sauce, maître d'hôtel butter, pommes frites (sub mashed potatoes)"}]}}, {"review": {"des": "Came here for my girlfriend's birthday, wanted low key and romantic. Reservation helped, early res meant patio out back with the lights and canvas. <br><br>The French menu was fun to attempt to pronounce and the descriptions helped us decide. Great service with Ryan making excellent suggestions. She had the steak and pomme frites whilst we shared the Mac n cheese and I had a crab and cucumber salad. All of it was phenomenal.<br><br>Everybody was smiling and gracious and happy. The back patio was the best, you'll see if I can post this stuff haha.<br><br>5/5, Merci beaucoup!", "pics": null}}, {"review": {"des": "Delicious French onion soup, phenomenal croque madame.  Good service, very tight seating.  I will go back when I'm craving French cuisine again!", "pics": null}}, {"review": {"des": "Was here for dinner a month or so ago. <br>While service was fantastic, food did leave a bit to be desired. <br>Wouldn't mind giving it another shot once the weather warms up, they have a very cute outdoors.", "pics": null}}, {"review": {"des": "Maybe one of the nicest patios to dine on in all of Chicago. For French bistro food, this is a lovely restaurant. The onion strudel, the steak tartar, and lyonnaise salad, all were very good. Babes has trout and I had whitefish special. <br><br>We had a bottle of Chenin Blanc and shared a chocolate mousse desert. Like I said, classic bistro, and done very well. The service too, very good. <br><br>This is a north side restaurant, next to Old Town Folk Music. We will be back.", "pics": null}}, {"review": {"des": "When we are done with dinner we like to swing by for their creme brûlée! Great service and beautiful atmosphere! Great place for a 1st date or celebrating an anniversary!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/u2q0wpWUBvjuAZrhHTLFBg/348s.jpg", "caption": "wifey loves the creme brûlée here!"}]}}, {"review": {"des": "We had a fantastic time here for my birthday. The staff was very attentive, yet not overbearing. The atmosphere was calm, uncrowded and romantic. Though I had the carrot gnocchi and the parsnips weren't completely done, the dish is still worth getting again- albeit with a request for a longer cook time. I also had the Duchess cocktail and it was AMAZING.<br><br>Thank you for the wonderful memories.", "pics": null}}, {"review": {"des": "A fairy garden patio, generous pours at the bar, chicken cooked so well I don't care that it's white meat... you can't go wrong. We love coming here for restaurant week and always have prompt, polite service even when it's packed. I wish I could review anything but the chicken and shallot frites dish, but it's so good I won't order anything else!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/m-5dV8q2nhkcLToZqOvv2g/348s.jpg", "caption": "Chicken with mushroom sauce and frites"}]}}, {"review": {"des": "The restaurant has gone downhill in the past two years.  We last  ate here two years ago and it was then still  every bit as good as when Michael Altenberg was the chef.  We ate here last night and were disappointed.  The food is more like an imitation of French food than French food.  The puff pastry appetizer was not puff pastry.  The pastry was leaden.  The cheese filling was too heavy also.  The chicken main course, which I used to love due to the fabulous thick mushroom gravy which made me want to lick the plate, now has a less than interesting mushroom gravy that was almost tasteless. Also, instead of the previous lightly fried onions that accompanied the dish, the dish was covered by a mound of deep fried onions that were too salty and definitely not French-style.   The complimentary small baguette that is delivered to the table was more like a soughdough bread than the old French baguette that had a crust that crumbled when you broke it.  The dessert we had - the bread pudding - was good but slightly overcooked and too hard.  The sauce on it was very good.<br>     The restaurant still has the same ambiance, and it is blessedly quiet (as opposed to so many of the restaurants today).  Service was good.", "pics": null}}, {"review": {"des": "I have never written a yelp review before, but the amazing meal I just had at Bistro Campagne must be commended. Go on Wednesday night and get their prix fixe with the wine pairings. Everything I ate tonight, including the Moules a la Bierce, Poulet Roti Forestiere, and Creme Brûlée was delicious and perfectly paired with amazing wines. Our waitress even very kindly let us take a copy of the menu with so I knew which wines I'd had. Everything was wonderful.", "pics": null}}, {"review": {"des": "Amazing service. I won't lie, my friend and I were a bit worried about entering since we were dressed in sweats but they treated us like royalty just like everyone else. We went there specially for dessert but still had a chance to go through the meal menu and it was very detailed. I plan on going back to eat more than just dessert. The dessert menu also had a large variety. We ordered all of them and each bite was heavenly.", "pics": null}}, {"review": {"des": "Super mediocre. We had the mussels, charcuterie, Mac and cheese, pork chop, gnocchi and Mac and cheese and not a single thing makes me want to come back here. The waiter was super slow. We were outside and there were 8 tables and he had all of them and clearly could not handle all of us. I won't be back.", "pics": null}}, {"review": {"des": "From the outside this place looks like a house from a fairy tale! The dining area is very homey and the atmosphere was nice. Not a fan of the fries that came with my sandwich but the French onion soup was absolutely delicious and I would highly recommend it!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3D2I6FxP8KO_fa-r6kjh1g/348s.jpg", "caption": "Steak tartare"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ySNYmUxQhIKXBDbjeTbJPw/168s.jpg", "caption": "Croque Monsieur"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gQ-i1g61MmBFr7YiCJavjw/168s.jpg", "caption": "Croque Madame"}]}}, {"review": {"des": "This place has been wonderful for years. An old standby, their steak frites, duck confit and steak tartare are delicious. Service is excellent. Ambience is lovely.", "pics": null}}, {"review": {"des": "3rd rate french food in a visibly dirty restaurant. <br><br>We tried this dump in 1/17 and I have never felt so cheated by a restaurant. Our 7:30 reservation resulted in our being seated at 8:20 after 50 minutes standing in the foyer.<br><br>Our table was neither cleared nor wiped as we had food debris from the previous diners when we were seated. The menus were also covered with a thin even coat of food and fingerprints.<br><br>The food was adequate, no more, and very pricey for its quality. Everything is heavily salted and the 'famous' French onion soup managed to have a sheen of grease covering the top. The steak was tough and dry and seemed to be dog food grade beef.<br><br>The server as well as the bus boy were virtually unable to communicate in english. They were unable to explain or even describe the food effectively and recommendations were out of the question.<br><br>The bathrooms scream \"black hole of Calcutta\" and I have it on good authority that the ladies room is unusable.<br><br>I cannot imagine any reason to pay double price for poorly executed french food in this decidedly unsanitary dive other than curiosity about the symptoms of cholera.", "pics": null}}, {"review": {"des": "Went on a date here the food and service was outstanding really loved this place. Perfect place to take a girl you like on a date. Easy parking across the street. I would recommend making a reservation. And don't forget to save room for dessert.", "pics": null}}, {"review": {"des": "Super cute restaurant. It's also super small. I felt like the people next to us were totally listening to our whole conversation. Other than that the food is great, and the variety of wine was a plus.", "pics": null}}, {"review": {"des": "After experiencing a nearly flawless brunch, my love affair with Bistro Campagne is holding steady.<br><br>How can I not love the following? Allow me to elaborate.<br><br>1) They take reservations! Breakfast/brunch is probably the meal I am least likely willing to wait more than fifteen minutes for a table. When I wake up, all I want to do is get started with a steaming cup of coffee, eat something hearty and comforting, and if I'm feeling decadent, enjoy a mimosa or two. I do NOT want to wait an hour or more for all of this to happen, so the fact that I can make a reservation, and walk right to my table is an automatic win. The only downside is they don't start brunch service until 11:00, and sometimes I'd prefer to dine a bit earlier. No big whoop though. <br><br>2) The food is divine! And not crazy expensive (at least to me; your perspective may vary). Entrees average $10-$12, and for the quality, believe me, it's a bargain.<br><br>3) The service is so genial, and the restaurant is so charming and lovely. I love all of the different rooms. It feels as if you're in someone's home in France.<br><br>Start with a mimosa. It will make you happy. I close the 'Barbieri,' which featured OJ and Aperol (I'm obsessed with Aperol these days). It was delightfully bubbly and pleasingly bitter. <br><br>More on the food. You really can't go wrong with anything you order, whether it be the omelette of the day, pain perdu, duck confit hash, or a traditional croque monsieur, rest assured it will all be delicious.<br><br>I opted for the omelette of the day, which featured shitaake mushrooms, spinach, and goat cheese. Easily one of the best omelettes I've had. A perfect combination and balance of ingredients. Not too wet, not too dry, and not rubbery. On the side were some of the best roasted potatoes I've ever tasted. I swapped out the toast for a housemade biscuit, which was tender and flaky and came with strawberry preserves on the side. My husband had the traditional eggs benedict which he devoured.<br><br>And because we're apparently pigs, we also shared an order of crepes Suzette. We were fighting over every last citrusy spoonful of that orange brandy sauce.<br><br>We couldn't stop raving about how much we enjoyed our brunch and we've already made plans to go back.<br><br>One more note worth mentioning: the original chef/owner passed away last year, and BC was able to not only carry on, but thrive after his passing. His legacy lives on in this wonderful restaurant. It's just as good as it ever was.<br><br>Bistro Campage is easily of one my favorite restaurants in Chicago.", "pics": null}}, {"review": {"des": "Small but cozy restaurant.  The Amish chicken with onions was the best I have ever had.  As an appetizer the French Onion soup was excellent.  They have an excellent wine selection.", "pics": null}}, {"review": {"des": "Never had a bad dining experience. The ambiance, food, and service is consistently great! Brunch and dinner are both excellent. I also love the patio in the summer time. A great gem in Lincoln Square.", "pics": null}}, {"review": {"des": "As far as brunch goes, very good food and service. I had the steak with poached egg and their signature mimosa.Drinks are strong. Creme brûlée was worth it. As an FYI, this is not a byob type of place. You can bring your own wine in but Corkage fee applies. Looks small and intimate from the outside like a good date spot, which it is. Actually though, it's quite large inside, big enough for the group of 12 that I was with and more. Worth another visit!", "pics": null}}, {"review": {"des": "Bistro Campagne is one of the crown jewels of the north side.  It has the world's loveliest patio in the summertime, great for a romantic date.  One of the reasons it has survived the test of time is its commitment to the community, to great service, and to warm hospitality.  Also, the wine list is thoughtful and well-curated, with a price point for every budget.  Dine here with confidence.", "pics": null}}, {"review": {"des": "Great place for restaurant week! There were three options for each part of the menu... We got the French onion and potato balls from the appetizer section... The French onion was so good!! The portion was also very huge! For the main course we got the fish and the chicken.. There's also a steak option.. I loved both dishes! The chicken was juicy and covered in onion rings! The fish was salty, crispy and came with some lentils.. For dessert we got creme brûlée and the chocolate musse.. I really enjoyed the creme brûlée! The chocolate musse was rich in flavor too.<br><br>The cost was $33 per person or $50 a person if you chose to do the wine pairing. It comes with three different glasses of wine, each wine complimenting the specific item you ordered. Very reasonably priced!<br><br>Great experience, cute cozy restaurant and delicious food!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VBmeEK2XE49mbrm7V2Kt4A/348s.jpg", "caption": "French onion soup from their restaurant week 2015menu! Deeeelish!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CT2hjzrIVBZTB3KJsfWwRQ/168s.jpg", "caption": "Potato ball appetizer from the restaurant week 2015 menu!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_AKfDRPyZWEKQdzcObiUpg/168s.jpg", "caption": "Chicken option from restaurant week 2015 menu!"}]}}, {"review": {"des": "I had a fabulous experience last week. My beau and I walked in on a Friday night and the hostess offered to seat us immediately at the bar. We loved the escargot. It was rich and garlicky - it might be the best I've had in town. The arugula salad, with poached egg, was ok. I wanted more acid in the dressing, and the egg was perfectly cooked. I liked the Coquilles St.-Jacques. I think I had three nice scallops and piece of pork belly. The sauce was light and tasty. The pork chop was gigantic. It was nicely done and tender. They were out of the normal veg so substituted asparagus, this was yummy. We were too full for dessert, but I'm looking forward to skipping the salad next time. <br><br>The bartender, I forget his name, was friendly and helped me find a wine that I liked. He took good care of us. The kitchen, however, seemed to have a few issues. There was a long lag time between the escargot and the salad. . .too long. And then the entrees came out quickly. <br><br>Overall, it was a delicious meal and we had a great experience. We'll be back.", "pics": null}}, {"review": {"des": "I was excited to try this local French restaurant for my birthday dinner. Streak frites is my favorite and I was thrilled to hear I could enjoy this with 2 toddlers in tow. When we arrived we were seated in the back room which was perfect for my group. The service was attentive and friendly. The front room and patio area would've been perfect for a date night with the husband.<br><br>Too bad we won't be returning because the food was bad. For the price, which is on par with other bistros in Chicago, this place did not deliver. Escargot tasted old and nasty. Brie was tasteless and comprised mostly of bland puréed seasonal squash. The soup de jour was overly sweet. But what killed it was the steak was under seasoned and left much to be desired. Very sad.", "pics": null}}, {"review": {"des": "Went here for the first time last night. It's been on my list of places to try ever since we moved into the neighborhood last year. Great ambience; very good service. Good wine selection and cocktails. Have to say I was pretty disappointed with the food. Started with the artichoke fondue and should have gone with the escargot, which would have been more flavorful. Then had the house salad which was limp and again, not very flavorful like a typical, simple French salad. I always finish salads, and this is the first time in a long time that I left some on the plate. Bread was warm--that was a nice touch. I then had the trout. Similarly, not very flavorful--it was cooked in brown butter, but that meant over cooked. I asked for some lemon to add some interest. In short, I've heard such great things about the restaurant so would probably try it again...but based on last night, I'm hesitant to spend another $100 there.", "pics": null}}, {"review": {"des": "A cozy ambiance with great customer service. The Corque Madam was fabulous. I'm definitely going back for it.", "pics": null}}, {"review": {"des": "Came here for a date night, place has a lot of charm and cool atmosphere. I would give it 3.5 stars since their food was hit or miss. Their onion soup and creme brulee were delicious, and I ventured out to try the escargot! But my porkchop was bone dry and had a ton of ligament/hard to chew fat, and my wife's \"medium\" steak was completely red. For the cost, I think there are better places to go", "pics": null}}, {"review": {"des": "A girlfriend and I decided to try out a restaurant in Lincoln square.. This place received great reviews so we gave it a shot! First.. We started with the mussels! They were good... Not phenomenal but good. I tried the Salade Maraichere au Chèvre Chaud because I love goat cheese! This was a great salad before my entree! For my entree I chose Boeuf en Daube which was cooked with flavor and the beef was very tender! I loved it! My friend chose the pork chop which was delicious as well! So, on the food standpoint everything was pretty good! Including the wine ;) <br><br>The best part of this place was the atmosphere.. We sat outside on the patio which was very cozy and relaxing. It felts like you were sitting in a decorated backyard! The waiter spaced out our food and didn't rush us! We probably spent 2 and half hours here which was nice because we were able to catch up and not feel like they needed the table! <br><br>This place is a great place for dinner especially in the summer where you can sit outside in their cute patio and eat delicious French food!", "pics": null}}, {"review": {"des": "Incredible experience.  Went here for dinner last night with two friends that are leaving Chicago and had Bistro on their hit list before skipping town...so glad that we got the invite.<br><br>Like others have mentioned, intimate atmosphere with small tables inside of what feels like someone's first-floor home.  Had a glass of champagne and a loaf of bread with very simple butter to start (and damn, that bread was hot, just the way I like it) before launching into a $33 prix fixe that included the croquettes, the steak frites and the pot-de-creme.  All were excellent.  My wife got the mussels and for $14 we thought this was a pretty great portion size; my friends got a salad, the ravioli and the beef bourguignon which were also excellent.  Service was good and unintrusive; prices were fair for the amount of food we got.<br><br>And this place is part of the A La Card discount deck so we were able to get $10 off the meal.  Very good!", "pics": null}}, {"review": {"des": "Very poor service and management. Made a reservation and waited over 40 minutes before leaving. Great anniversary dinner.... Thanks!", "pics": null}}, {"review": {"des": "Had a lovely dinner on the patio the other night and just wanted to mention the attentive waitstaff.  I found the chairs on the patio really uncomfortable for a relaxing dinner.  Way too deep for someone as short as I.  I asked if there was another's straighter backed chair and was brought one with no muss or fuss.  I doubt anyone else on the patio even blinked.  My thanks to the waitstaff - the food was wonderful also.", "pics": null}}, {"review": {"des": "Outstanding in all aspects. No small criticisms, no if only comments to make. From the moment I walked through the door until the moment I walked out, everything was outstanding. Food, service, atmosphere, overall feeling and experience just couldn't have been any better. <br> Thank you Bistro Campagne, I'll be back.", "pics": null}}, {"review": {"des": "Chicago has become one of the world's great dining destinations in the past few years. I know some would disagree with this, but I think you can thank this little unassuming bistro on the Northside for at least part of that development. The chef here was committed to locally sourced organic ingredients long before that trend became the norm -- look up the story and you'll be impressed. After the Chef's passing a few years back this place hasn't missed a step. The staff is warm and welcoming, the food is classic but perfectly prepared and the ambiance is among the most relaxing, romantic and enjoyable that you're likely to find at any bistro around the world. Excellent, approachable wine list, prices for food are not even sort of outrageous -- you could conceivably diner here weekly without going broke -- and their little courtyard is the best place in the city on warm summer nights. Go here if you're having any doubts, you'll be very glad you did. Brunch is solid as well!", "pics": null}}, {"review": {"des": "Took a chance and they had a walk in open.<br><br>Delicious food. Server had great suggestions. Bar tender made great drinks. Perfect combo of neighborhood restaurant and somewhere we'd travel to.", "pics": null}}, {"review": {"des": "Outstanding service and food in this neighborhood gem. Very quaint and noise level is comfortable. Also, some of the best cocktails in Lincoln Square.", "pics": null}}]}