{"name": "bittersweet-pastry-shop-chicago", "reviews": [{"review": {"des": "I am a connoisseur of dessert and beverages made with chocolate - brownies, hot chocolate, mochas. All of these things I make myself and put my homemade versions in the top 3 of anything I've ever tried.<br><br>Hot Chocolate/Mocha<br>I found a new #1 hot chocolate - bittersweet's signature hot chocolate. Served on a silver platter, with the hot chocolate and whipped cream ready for you to pour/scoop into the cup as you wish (I admit, I love playing/concocting with my food). <br><br>They add orange and cinnamon to the hot chocolate. I'm a purist and I strongly dislike fruit with my chocolate. But I try new things because my FOMO is greater than my certainty that I've already had the best the world has to offer. This is one of the exceedingly rare times my FOMO served me well.<br><br>They add orange zest to the hot chocolate, so it's an understated flavor... but also be prepared for the occasional bit of zest in your sip. It quickly became a burst of orange-y I looked forward to as I sipped.<br><br>I ordered a separate single espresso shot. I don't find espresso drinkable by itself, but at bittersweet it is. Since the hot chocolate came with a separate cup, I was able to enjoy a mini-mocha by adding some espresso to some of the hot chocolate. That was excellent too.<br><br>Steel Cut Oatmeal<br>I also love steel cut oatmeal. And here at Bittersweet, it's the best I've ever had. Fantastic presentation, just the right amount, soooo delicately crunchy (as steel cut oatmeal should be, but rarely is). This is the first time I didn't need to add sugar to enjoy my oatmeal. In fact, sugar detracted from how amazingly good this oatmeal is.  The dried fruit (cranberries and a couple strips of orange rind) were perfect accompaniments.<br><br>I didn't think to take photos before I dug in. Hopefully others have posted photos. In any case, if you love hot chocolate or mochas, or steel cut oatmeal, be certain to visit Bittersweet Pastry Shop & Cafe. Thanks for reading.", "pics": null}}, {"review": {"des": "I came here for a fun Halloween cookie and a nice warm drink, and that's sure what I got! I came at a weird time, around 3pm on a Tuesday. I was so surprised to see as many people in there as there were! <br><br>The buying for takeout is a bit awkward. I kind of stood by the pastries looking to see which one I wanted. I stood there for about two minutes before someone asked what I needed. I ordered and then was brought over to the opposite side of the counter where the cash registers were, meaning I had to walk through the line to pay. A bit awkward. I was instructed by another employee that I should've taken a number- oops, I didn't even see them.<br><br>Anyways, once I got my fun Halloween cookie and hot chocolate I had time to sit down and enjoy them! The cookie was great, a perfect sugar cookie. The decorations were adorable too. The hot chocolate, though, wow. It blew me away. It was almost liquid chocolate- so sweet and creamy. I couldn't even devour it because it was so sweet.... but I obviously drank it all. Would totally recommend!", "pics": null}}, {"review": {"des": "Stopped here for an afternoon pick me up. The display cases are filled with pretty and yummy treats. There's even some Halloween cakes and cookies. I ordered a chocolate sugar cookie and a chai tea. After waiting a few minutes for the tea, the staff were very nice in telling me that the are out of chai and would be happy to either refund my money or they could make any drink. I choose the hot chocolate. I think it was the best decision because it was rich and creamy. So good! The cookie was nice and buttery. Plus is was soft, yet crumbly. The perfect combination! <br><br>I would love to come back and try their entrees and afternoon tea!", "pics": null}}, {"review": {"des": "I stopped in here the other morning and saw a wide array of pastries available. I ordered an almond croissant and it was truly the best I've ever had! It was crisp and flaky outside and filled with a light, creamy almond-flavored spread inside, plus it was covered in slivered almonds. I did feel it was a bit pricey at almost $5 a pop but after having even my first bite, I can say this is a treat you deserve once in a while!<br><br>I also ordered an iced latte which was just OK, it tasted pretty weak. The barista asked if I wanted 1 shot or 2 (shouldn't they know based on the size i ordered?) and I guessed 1 was fine but it really lacked flavor and just tasted like a cup of milk... Maybe my mistake?<br><br>I also noticed while I was waiting for the latte that they had a bunch more pastries and croissants behind the glass case along the wall! I didn't even notice those at first. This place is definitely worth stopping into for some pastries.<br><br>Quick update: stopped back here for an almond croissant and turns out they only have them on the weekends. FYI!", "pics": null}}, {"review": {"des": "Best matzo ball soup I ever had, and I've had hundreds. Better even then my mother's!", "pics": null}}, {"review": {"des": "Love the ease of ordering a signature cake online. Went to pick up and the place was busy, with virtually all other customers picking up orders too. At first I was a bit confused, but everyone takes a number. I was assisted shortly and my cake was brought out. I enjoyed their service. I went with the fudge & salted caramel with fresh flower on top. It looked very pretty and the handwriting for the b-day message was very nice. Cake was good too, but I felt like there was not enough actual cake and too much filling and buttercream. I'm definitely intrigued by their other flavors and offerings.", "pics": null}}, {"review": {"des": "I love this place for desserts even the prices aren't that cheap which a little small desserts will cost over $3. They also have good food and it's not far from the brown line, red line and purple line stop by the train station. I saw this restaurant on check please and love it the first time I went. They made such pretty small petite desserts and they also make cakes for any occasion. I love the neighborhood and go back when I get a chance. My other friends who check it out said it was good. The place is not to big but it is really nice inside. There is a bench outside where you can sit to relax before you go inside.", "pics": null}}, {"review": {"des": "Came here with my mom and step dad for their wedding cake tasting this past summer (yes this review is long over due) but we've ordered cakes here for my birthday, brother's, parent's 50th birthdays etc. I love it here and Nancy was super nice when we were doing the wedding tasting. We even got a free little treat at the end!", "pics": null}}, {"review": {"des": "Beautiful ambiance for a bakery in Lake View Chicago. <br>The Quiche is what drawn me here in the first place. Was flaky, slightly moist, flavorful, and melt in your mouth good. <br>The hot crossed bun was a first for me to have and I really enjoyed it. Soft and not too sweet. <br>At the door they have free samples of baked goods as well and then too were moist and delicious. <br>The establishment has a small retail side of you wanted to grab a gift, but in my option the baked items are a nice gift for any occasion.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/O7ZKABtXslsYW88iVdwlNg/348s.jpg", "caption": "Hot Crossed Buns"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UO2C5QfApG0gt8a_N2xpog/168s.jpg", "caption": "Pastries lemon meringue tart and"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/e-wQeborWB3uZUNGoNADng/168s.jpg", "caption": "Quiche Lorraine with Fruit"}]}}, {"review": {"des": "A friend of my daughters is a chef and highly recommended this bakery.  I ordered a cake for my husbands birthday.  I paid in advance.  My children went to pick it up and they could not find the order or the cake.  My kids were there for fifty minutes.  They tried to substitute another cake.  Then decided to give me someone else's cake.I appreciated that, but they said they were going to look into the matter and compensate me.  It has been 5 days since this has happen.  I have not been compensated or I have not received a phone call explaining what had happened.  The cake was good but there Hanukkah cookies need some help.  The dreidels were salty and the stars had absolutely no,taste.  The mandelbread was good.", "pics": null}}, {"review": {"des": "We used Bittersweet for our wedding cake and I could have not been happier!!! I showed Nancy at Bittersweet a photo I found on Pinterest and she had tons of confidence that they would be replicate it. Honestly, Bittersweet made our wedding cake look even better than the photo on Pinterest! Beyond the design, the cake was delicious. We got a lot of compliments on how delicious our cake was. We can't wait to celebrate more life events with Bittersweet cakes/pastries/sweets!", "pics": null}}, {"review": {"des": "We have bought our Apple and Pumpkin pies for Thanksgiving for the last 5 years or more, this year the apple pie was as good as ever, but the Pumpkin pie left a lot to desire. It looked as though it was made at least a week before we picked it up, the filling was dry and pulled away from the crust. The pie was smaller than in the past and it did not have decorative leaf that has always been on past pies. It looked as though they had the pies made elsewhere. Very disappointing, and at the prices charged it will be hard to justify buying in the future.", "pics": null}}, {"review": {"des": "Our friends got a tiramisu cake from here for their wedding and it was so amazing (tiramisu can be very difficult to get right) I decided to get my birthday cake from here but then I forgot to order my own birthday cake and didn't get one. At some point in the coming months I plan on actually getting around to getting myself a belated birthday cake and all the flavors on the website look incredible.", "pics": null}}, {"review": {"des": "The Union League Club contracted you guys to make my bridal shower cookies and they were AMAZING! Everyone was RAVING about them. The tastiest cookies ever, and they were BEAUTIFUL! They were wedding dress cookies, and the level of detailing on the flowers on the dress was RIDICULOUS! Whoever the decorator is is insanely talented!! Thank you for making my bridal shower so special!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FiwaqAhb7uhVrT8xtwW9ug/348s.jpg", "caption": "My bridal shower cookies! AMAZING and so beautiful!"}]}}, {"review": {"des": "Cute cute cute. Lovely lil bakery and honestly the BEST iced mocha I've ever had. Literally just a double espresso over their amazing hot chocolate. Wow. Loved it. <br>Service was excruciating slow... like... the slowest place I've ever been in the city. <br>But the drink was DELICIOUS!!", "pics": null}}, {"review": {"des": "Oh how sweet it is to be bitter... just kidding! Came here on a Wednesday afternoon around noon and I was actually surprised to see this place was packed. Truth be told, I was probably the youngest person there because the majority of the lunch population was in their later 50's. I came here with a friend for coffee and sweets after searching the area for cafe and desserts. I read really awesome reviews for the dessert but I had to see it for myself. This was my first official coffee of the day and I was super duper disappointed by the cappuccino. It was more foam than coffee and it was half cold. Also, the waiter didn't ask me if I wanted a 12 ounce cappuccino or 16 ounce so naturally I was like, \"wait that's it? No more coffee?\"...<br><br>The atmosphere, I wish there was more decorative wall art or something that gives this place a little extra pizazz. It's a very cute bakery but missing that extra flair that would make this a highly appreciated go-to coffee spot for millennials.<br><br>As for the desserts: I got the red velvet cheesecake individual, apple streusel tart, an oatmeal cookie (free when you check in) and flourless chocolate mousse The red velvet cheesecake was really good, really creamy but also very tasty. You could easily order one of the individual cakes and then split it between two people. I had half of the red velvet cheesecake because it was extremely rich. I also really enjoyed the apple streusel, not exactly a pie crust but also not exactly flaky but it's still delicious. I really enjoyed the apple with almonds- it was super tasty! The flourless chocolate mousse was really chocolatey- too chocolatey if you ask me and that's saying a lot! I wasn't sold on it, there was something missing from it. The oatmeal cookie looked better than it tasted. I was disappointed because it wasn't chewy, it was rather crunchy and hard. I'm not accustomed to oatmeal cookies being that hard. Overall, I would go back to give that cappuccino another try!", "pics": null}}, {"review": {"des": "Such a good find! Decided to stop in after lunch in the area. I wasn't planning on getting anything but the place was so cute I had to stop by. It has a European vibe but is spacious and very well decorated. They also have a little gift shop with cute trinkets. After looking around, I decided I had to try something. <br><br>My friend and I got the flourless chocolate cake to share and it was honestly the best chocolate cake I've had in a long time! So dense, creamy and chocolately without being overly sweet. The service was also great, our waiter was super nice and attentive. He also let us pick any cookie for the Yelp check-in :) <br><br>So glad I stopped in and hopefully will be back to try their other items!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Yhk3lC5tWZTxcCiQUDwKMA/348s.jpg", "caption": "So many options!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GrL_SqMlc5nOxu8LGTttkQ/168s.jpg", "caption": "Best chocolate cake I've had in a looooong time"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/F7yBuq91l56p2J5pTqGctw/168s.jpg", "caption": "Such a cute store!"}]}}, {"review": {"des": "Best experience I've had ordering a cake! Let me start by saying that I'm a difficult and picky person when it comes to custom orders. I needed a dental related cake made. I put a design together and contacted the bakery and it was ESTER who helped me (you are the BEST Ester). She listened to me, helped me come up with ideas and finish the order. We made phone calls back and forth until I was happy with everything. <br><br>Fast forward to pick up day. I was scared for how the decorations were gonna turn out knowing how picky I am. Let's just say they DID NOT DISAPPOINT. Everyone was impressed. <br><br>Let's talk about the cake itself. Holy moly...best carrot cake I have ever tasted in my life, I can easily say that. Definitely buying more cake from this place. <br><br>THANK YOU BITTERSWEET AND THANK YOU ESTER for making this a super smooth and pleasing experience.", "pics": null}}, {"review": {"des": "Had the most delicious cake from Bittersweet! Cake ordering process was seamless - called them to get some recs for cake flavors (almond creme brulee was amazing!) and ended up ordering my dad's birthday cake over the phone. They delivered the cake to the restaurant (in river north) for $25 delivery fee. My dad and all the guests loved the cake!<br><br>Will definitely be ordering cakes from Bittersweet for all future events!", "pics": null}}, {"review": {"des": "Adorable find! They have excellent customer service and everyone there is very friendly. They put aside the last piece of cake just for me over the phone! The pastries and treats are delicious!! I recommend their royal wedding cake, macaroons, and chocolate chip cookies. I can't wait to come back and try more.", "pics": null}}, {"review": {"des": "Bittersweet Pastry Shop<br><br>This bakery was recommended to me by a close friend and I'm just sorry I haven't heard about it before now.<br><br>This bakery has Something for Everyone! There's fruit and chocolate and tarts and cookies and cakes and muffins and rolls and breads and So Much More!<br><br>I bought a french sable because I have never heard of that before and it was a delightfully crunchy shortbread-chocolate-chip hybrid pastry. <br><br>Yelpers get a $free$ chocolate chip<br>cookie, and it's a great bonus!<br><br>I'll be dreaming tonight about the beauties I will back tomorrow to buy......My family is coming for brunch and I have to get a few more of these awesome treats :)", "pics": null}}, {"review": {"des": "I'm a bakery snob.  I really am.  This is one of the few in Chicago that does not disappoint.<br><br>I'm just wishing they sold their flour-less chocolate souffle cake by the slice because I've always to try it but I've no cause to buy the whole thing", "pics": null}}, {"review": {"des": "What a lovely spot!  Each treat is so beautifully crafted and tastes equally as amazing. Next time in Chicago, I will be coming here again.", "pics": null}}, {"review": {"des": "I think have made more than 3 attempts to love this cute bakery... picked up a Lemon  sabayon for dinner and the hostess is a chef. My friend on her first bite said it's not Sabayon , the texture wasn't right ... the taste was good and tart like a key lime pie.<br><br>PS:: don't forget to check in on yelp for a free cookie", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pkITZynwokqe5z2L4svBAA/348s.jpg", "caption": "Lemon Sabayon .... disappointing!!"}]}}, {"review": {"des": "Great little cafe with great sandwiches, soups, and salads. Also amazing desserts and pastries.", "pics": null}}, {"review": {"des": "Bittersweet Pastry Shop has been on my list for a while now. When I finally made my way in, I was delighted to see the wide range of sweets and an adequate cafe menu at reasonable prices. The food was good and the baked goods were beautiful! Another differentiating factor is the fact that they staff a waitress for table service. Normally this would be a good thing; however, the service was so incredibly slow. I waited half an hour for a simple sandwich in a near-empty shop. My friends were served their desserts before I even had my meal. <br><br>With its classical music and slow demeanor, this may be a good study space for some. I will definitely consider hiring Bittersweet for any future custom bakery needs, but I doubt I will dine in again.", "pics": null}}, {"review": {"des": "If you're in Chicago and you're looking for a sweet bite or even a quick bite put this little gem on your list of places to visit.  <br><br>Not only is this place super cute on the inside, with smaller sized pastry gifts, note cards, and other delightful gifts to accompany your sweet treat they serve spectacular pastries. <br><br>On special occasions I'll treat my colleagues to a selection of Bittersweet pastries.  They are a hit every.single.time.  Oooing, aaaahing, 'mmmmm', 'oh my god these are incredible', 'Did you try these? You *need*to try this one' are heard every time I get Bittersweet.   My colleagues are ecstatic and I'm a champ for the week! Win-win! <br><br>This is a must.  But prepare yourself - it will be crowded when you get there- it's that good!", "pics": null}}, {"review": {"des": "I bought a Vanilla Bean Cheesecake... it was so delicious! I love their establishment-- lovely, chic, Parisian...Everything looks so delicious!", "pics": null}}, {"review": {"des": "We were so pleased with how our cake turned out for our October 2017 and it was damn tasty too. Plus, instead of eating a weird frozen layer on your first anniversary, Bittersweet will give you FRESH cake for your first anniversary. We are already looking forward to it. The cake tasting was easily one of the best parts of wedding planning, and the cake options were endless.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Dgq9WCBCynFrH6r2xhAhoQ/348s.jpg", "caption": "Our gorgeous wedding cake from Bittersweet"}]}}, {"review": {"des": "We originally started with Bittersweet for our wedding cake, but they weren't very open to any of our ideas and really didn't seem to care about what we wanted. We decided to go with another vendor who was more accommodating and gave us so much more than Bittersweet was even willing to offer.", "pics": null}}, {"review": {"des": "Such a cute and fancy pastry shop! I love their mini tarts and cookies! And it's a nice place to just sit down and chill with friends", "pics": null}}, {"review": {"des": "This used to be my favorite café but I will not return except to buy pastries at counter. I ordered a fruit plate w granola that had barely any yogurt and fruit while the \"granola\" was corn flakes, ridiculous. A latte with extra shot $7!  Previous experience with an egg dish similar- what came out different than expected.", "pics": null}}, {"review": {"des": "I stopped in with short notice looking for a small birthday cake for a friend. The woman behind the counter me was very nice and helpful, and after her suggestion, I picked out the small flourless chocolate mousse cake (IT WAS AMAZING). She also offered to write a custom name plate for no extra charge. While they were doing that I got to look around, and there were lots cute little things that you could get as a gift. Definitely going to be stopping back in! Can't wait to try the hot chocolate too!", "pics": null}}, {"review": {"des": "I've been ordering my celebration cakes from here since '08. Every year I do a new flavor, every year I'm pleasantly surprised. Their pastries are pretty awesome and the Red Velvet cupcakes are super legit! Worth trying.", "pics": null}}, {"review": {"des": "I decided to go back to Bittersweet after a while because I do love its product. I went in for the first time since I wrote my post and purchased some Halloween cookies. Afterwards, I realized I was overcharged on 24 cookies. An innocent mistake. I was in there this morning to ask for a credit. The young lady at the counter informed me that the manager had to do the credit, and she went to get her. The manager came out promptly and was in the process of making the credit when I brought up my experience with the sandwich that led to my original review on Yelp. She was not at all pleased with me for doing that, and she made it clear that I should have spoken to her first. There was no \"I'm truly sorry\" - just a great big unpleasant defense of why I should have spoken to her. I get it. I'm not sure I asked to speak with a manager that morning, and I do remember that the clerk did not offer to get the manager. I must say that my experience today was another set back: this manager was unpleasant, annoyed and defensive - whatever happened to customer service? I did not get the impression that she felt bad, and she certainly make little effort to smile, listen to me, and offer a solution. Sad. She could have handled this morning's interaction much more professionally instead of insinuating that I was wrong to not ask for her and that i was wrong to write a review on Yelp. She could have been gracious and pleasant, assuring me of how she handled it and what was the remedy. She could have offered me a dozen cookies. In the least, she could have smiled, listened attentively and offered some remorse. She could have. She clearly chose not to do any of these things. She offered up her frustration, her annoyance, her unpleasantness. I did not ask for a serving of any of those things. Just a simple I am so sorry stated with genuine regret and a smile would have gone miles.<br><br>She told me she responded to me on yelp, but there is no message.", "pics": null}}, {"review": {"des": "We used Bittersweet because they were one of the options with our package with The Blackstone Hotel, and OMG the cake was amazing! We got soooo many compliments on the cake and how delicious it was. A lot of guests asked where we got it and said it was the best wedding cake they had ever had. I can't recommend them enough!!! We met with Nancy for our cake tasting and that was one of the best/most fun/most delicious things we did during wedding planning :)", "pics": null}}, {"review": {"des": "The macarons we  bought had good texture and \"bite.\" We didn't care too much for the rhubarb strawberry flavor, but the chocolate and pistachio were good. The chocolate chip cookie we got for free for checking in was on the hard side, but the flavor was good.", "pics": null}}, {"review": {"des": "I had a small wedding in Chicago this summer and ordered a custom cake from Bittersweet Pastry. I literally had a dream the other night that I was eating this cake, just stuffing my face with it. Our guests raved about how awesome it was. I looked at a lot of bakeries online before deciding on Bittersweet because their website made it easy to place an order and their flavor options sounded great. We went with a yellow butter cake with chocolate creme brulee and milk chocolate icing. It was beautifully decorated as well. Perfect!", "pics": null}}, {"review": {"des": "Came to Bittersweet to satisfy our sweet tooth after a meal at Andy's Thai Kitchen nearby.<br><br>Atmosphere- Very casual and cute spot for dessert lovers. Definitely a good spot for a date or a casual chat with friends. They have a small shop with sweets and other items (pillows, candles, etc). The other side is for the dining.<br><br>Service- We ordered dessert only the service was very speedy. We came on a Monday afternoon so the place wasn't packed at all.<br><br>Food- Solid desserts. The spot boasts having some of the best macarons in Chicago, so I went ahead and tried the pistachio and strawberry rhubarb ones. They were both tasty. My friend had the flourless chocolate cake and another tried the lemon meringue. We were all satisfied. They also had a nice selection of teas which we did not get to try. <br><br>Overall, a cute casual spot for dessert. They also make cakes for various occasions.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6yVNtj8TrgNJgmVTEuqIsQ/348s.jpg", "caption": "The pistachio and strawberry rhubarb macarons!"}]}}, {"review": {"des": "I can't believe I'm going to share this secret with all of Yelp, but I do believe in Karma.  The last hour that Bittersweet is open, every day of the week, is Happy Hour and the whole top shelf on the right side of the display counter is BOGO.  Buy One Get One Free.  You heard it here first.  I have devoured: almond butter croissants (heavenly), chocolate chip sandwich cookies (delightful), the jelly brioche (scrumptious), pecan rolls (delectable) and the hazelnut passion fruit dome (simply amazing). And on top of the deals and the treats, they have a completely lovely staff.  Betty has jokes and stories, always gives us samples and makes us feel like family.  Bittersweet is an absolute gem!", "pics": null}}, {"review": {"des": "A sit down pastry shop?? Why? <br><br>I tried to order at the counter, was told to sit, then waited 10-12 minutes for someone to take my order. Waiter guy was totally adorbs, but had no idea what the offerings were and since they aren't listed on a menu (they are labeled on the actual pastry like a normal shop) it was hard to order anything. <br><br>I've heard such amazing things, so maybe my hopes were a little high? I wouldn't go out of my way to come here again, but if I were in the neighborhood, then maybe.", "pics": null}}, {"review": {"des": "So my niece recently turned one... and by recently, I mean 2 months ago.... Time is going by too fast!  But my sister definitely threw my niece a proper one-year-old party... At one point, I really wanted to tell my sister to \"step away from the Pinterest\" but she had fun planning it and making stuff for my neice's theme party:  piggys.<br><br>She ordered a piggy cake from Bittersweet.  Mind you, this is also the place that created their wedding cake from 5 years ago.  It was an awesome zombie wedding cake with the bridge and groom fighting off the best man and maid of honor.<br><br>Back to my visit here... As soon as you walk in, you get an \"old timey\" bake shop feel.  Looks of treats on display in the case and small tables where people were working and enjoying coffee.  The folks were expecting my sister and were super nice... there was a bit of a wait since they had not gotten a chance to take photos of the cake for their website/catalog, but truly it was a super creative and fun cake.  It was delicious too.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7wYANx5tTYWXUUikTgjuDA/348s.jpg", "caption": "Piggy cake isometric view... Chocolate mud :)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yeCzhcGceewOgE4ydRONbw/168s.jpg", "caption": "Piggy cake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0nI6LWDTvUcT0P38Xr1KAw/168s.jpg", "caption": "View of street..."}]}}, {"review": {"des": "I've got a bone to pick with you, Bittersweet. <br><br>Crunchy chocolate chip cookies? Crunchy?!<br><br>That's blasphemous! <br><br>They're offering a free chocolate chip cookie if you check in, which is great because who doesn't love free cookies? Let me specify, who doesn't love free, soft, chewy cookies?<br><br>Okay that's it, I'm done, just make them soft next time please. <br><br>What's making this place a solid 4 is those damn turtle brownies. Now I know I compare a lot of delicious food to crack or possibly having trace amounts of crack (never having had it before, I swear) but this, this thing just might be a crack incarnate. It's rich with a perfect amount of sweetness and the right balance of chocolate and caramel. <br><br>Coffee was decent too. <br><br>Get it, get it!", "pics": null}}, {"review": {"des": "We came to know about this place when a friend got us cup cakes from this shop. The cup cakes were delicious!! We wanted to visit this place ever since!<br><br>We finally visited this place last week and it sure lived us to our expectations! We tried a couple of cup cakes, croissant and brioche. All of them were delicious and so was their coffee. But the hot chocolate was the hero! It was creamy and mildly spiced! I would definitely go back just for a cup of hot chocolate!!", "pics": null}}, {"review": {"des": "Very diverse selection of artisan desserts, muffins, cookies and pastries. I recommend their cheesecake, but everything else were pretty standard in taste of its kinds.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eITs1cfVs-rOWDUVOnB1dA/348s.jpg", "caption": "Cinnamon roll."}]}}, {"review": {"des": "One of my favorite bakeries in the whole city of Chicago! There is always a large selection of fresh pastries to choose from and the last hour of each day is \"Happy Hour\" with many of the pastries offered as buy one, get one. Bittersweet has excellent customer service and their custom ordered cakes always turn out beautiful (and with so many amazing flavors to choose from).", "pics": null}}, {"review": {"des": "LOVE the cakes at Bittersweet!  We have ordered 3 cakes from here - one for my sister's wedding, one for my parent's anniversary party, and just recently one for my husband's 40th birthday.  The cakes are so beautiful and well done.  They are also VERY reasonably priced - I couldn't believe it when they told me that our cake was only going to be $54.  The cake we recently got for my husband's party was vanilla cake with milk chocolate buttercream and a dark chocolate glaze with chocolate curls.  It just looked wonderful and tasted fantastic.  SO many people commented on it and talked about it for days.<br><br>I had a great and easy time ordering it on the phone with Randy.  He was very nice and pleasant to work with.<br><br>However, when I went to pick up the cake with my 2 year old son, I was very displeased with the service I got there.  It seemed to be a younger staff working that Saturday which is totally fine, but no one was very friendly to us at all.  Not even a smile!  My son and I ordered a pastry to share while at the restaurant waiting for the cake.  We were planning on just sitting down for a couple minutes before getting the cake to go.  He is a 2 year toddler so it's not like we were going to sit for an hour long conversation.  We were told we could only sit at the take out counter.  Only problem was there were people already there (who weren't eating at all and just sitting taking up space).  It wasn't a huge deal, but people saw me with a toddler and trying to pick up a very elegant and fancy cake and no one seemed to bother to help or accommodate us.  No one offered to open the door or help us out with the cake (and the toddler).  People just kind of stared smile-less (after we spent a good amount of money there).  We weren't making a scene or doing anything at all, so it's not like we were disturbing anyone, so not really sure why the staff seemed rather grumpy that day.  It was a little disheartening as I really really love ordering from Bittersweet.<br><br>We will definitely order from them again, just hoping for some friendlier staff when we go to pick up!", "pics": null}}, {"review": {"des": "Got an 8\" banana cake layered with dark chocolate mousse, covered with hazelnut buttercream and finished with chocolate ganache for $48 w/ tax, including a pretty floral design on top. It fed 20 people with a probably 25% leftover. It was also very good and made my guests happy. I was inspired to order banana and chocolate cake because I went to a birthday party the week before with a to-die-for banana cake from Whole Foods. It was close to being as good as that one  but hard to compare haha.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_i5Co2t4p_rI6LLRcb-x9w/348s.jpg", "caption": "$48 w tax for this 8\" beauty. I added the cake-topper and the floral design around the bottom with flowers from Marianos"}]}}, {"review": {"des": "I've ordered the banana milk chocolate and chocolate fudge salted caramel signature cakes and they were both moist and delicious. The 6 inch cake may look small but it definitely serves 8-10 people. This is now my family's go to bakery for cakes.", "pics": null}}, {"review": {"des": "I cannot believe it's taken me this long to write about the bounty of deliciousness Bittersweet has lining their cases.  When I moved to Chicago four years ago, I was serendipitously located a block away and went there frequently for coffee and croissants.  Now that I I live further away it's a treat place that I go to sporadically. I'm a sucker for their ham and cheese croissants (only available on the weekends).  They are soooo good!  The consistency of the pastry is spot on and they use top quality ham.  Aside from the croissants, that I'm clearly obsessed with, everything else in the shop looks absolutely amazing.  They present it beautifully too.", "pics": null}}, {"review": {"des": "We got married in August and worked with Nancy for our tasting and cake - it turned out INCREDIBLE. First, our tasting was so much more than what I was expecting. It was delicious and the samples were abundant; it made it much harder than I thought to choose our cake flavors! Second, they have such a talented team there. Our cake looked flawless and I made sure not to leave without eating my slice. I can't wait to go back there for our anniversary cake (and sweets in general!). If I could do it over again, I would 100% go with Bittersweet Pastry Shop.", "pics": null}}, {"review": {"des": "Came here to try out the hot chocolate and got the signature bittersweet which was delicious! Also had a subtle hint of orange flavor which was the perfect touch. It comes in a pot large enough to serve two people which I wish I had known about beforehand. Otherwise very cute ambience and pastries. Definitely coming back here again", "pics": null}}, {"review": {"des": "Outstanding!  Ordering was a breeze. Service was fantastic. Even had to call and ask for cake to be ready 2 days earlier than what I ordered. Very accommodating. Cake looks amazing and taste is out of this world. One of the best I've ever had. Thanks!", "pics": null}}, {"review": {"des": "I ordered the Apple French Toast. Just an FYI Peeps, it was amazing!!! I looooove Bittersweet so much. I came from Indiana to get their lemon tart and ended up sitting down to eat. If I could move in, I would", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/W-IHPutGqGvyfNQjzzFOaQ/348s.jpg", "caption": "BOMB"}]}}, {"review": {"des": "The grilled ham gruyere cheese & fig spread sandwich is to die for and the homemade matzo soup is incredible!! Love that it's a block away from me (:", "pics": null}}, {"review": {"des": "I usually come in for small treats and coffee, but I have on one occasion ordered a cake from here which was incredible. I want to come back for breakfast/lunch, the menu looks really good. The staff is very friendly and I love their macaroons!", "pics": null}}, {"review": {"des": "Phenomenal pastries and wedding cakes!<br><br>We picked up a few offerings to go with coffee: key lime pie, lemon sabayon, blueberry cheesecake, chocolate hazelnut torte, and two fruit tarts. Every piece was amazingly good! I'm a chocolate-only dessert consumer, but that would not hold true in this pastry shop!<br><br>My wedding cake is from here; at the cake tastings, we enjoyed all of the cake options, filling flavorings, and the finishes. The cake offerings were all note-worthy good! Highly recommend their cakes for weddings and parties: perfect aesthetics with flavorful taste.", "pics": null}}, {"review": {"des": "This is one of my favorite lunch spots in Lakeview. It has a  great patisserie feel and the staff is very nice. Seat yourself to dine-in or take a number to order at the counter. It's known as a pastry shop but the cafe menu is also delicious. Surprisingly, they also have a retail area with great, unique stuff. I've purchased gifts here for my nieces and nephews many times.", "pics": null}}, {"review": {"des": "Went in to grab a couple of tarts. The young man behind the counter had his hands pretty full with a difficult customer. Two women cake from the back to assist with the backlog. One woman walked to where I was didn't greet me or anything and proceeded to help the two white women that arrived five minutes after me. I chalked it up to the women being rude and knowingly jumping ahead of me. Ten minutes later she comes out and still doesn't even acknowledge that I'm there. Rather, she decides to wipe down the counters and refuses to look up. <br><br>I've been ordering cakes for myself and others from this place for nearly thirteen years and dropping on to grab tarts whenever I'm craving something sweet or  going to someone's gathering. <br><br>Today will likely be the last day I attempt to patronize this establishment. Be it racism or just plain old bad service I'm not one to beg others to take my money.", "pics": null}}, {"review": {"des": "My fiancé and I were looking for a place to have our wedding cake made and Nancy was very rude. We understand that most places do not delivery to our venue and we have no problem picking up the cake and transporting it ourselves as we probably will have to anyways and she was being very problematic saying that she doesn't even do the cake design we want. She doesn't even know how big we want to or anything about us. Not to mention we don't live in IL and won't know when we will be back so our time is valuable and she was just not pleasant at all. I don't recommend emailing them or even trying to talk to them as they are not friendly... even in the freaking holiday season.", "pics": null}}, {"review": {"des": "This bakery used to be a great place to eat any time of day for the past 25 years. Beautiful crafted salads, soups and baked goods. Today we went back for our annual Xmas lunch and it was a total hack job! The food was barely edible. The salads carelessly throw together, much bigger portions, but the quality and lack of harmonizing combinations were pretty disappointing. Even the fresh squeezed orange juice was stale and bitter which I may have forgiven until a sandwich made with stale bread and salmon with stringy connective tissue was served. UNACCEPTABLE. Please, somebody save what used to be a great bakery and bring back the old quality and standards!! It's really heading south.", "pics": null}}, {"review": {"des": "It's about time for me to update my review for Bittersweet.  I have not been disappointed with any order I've placed with them since our wedding cake.  First off, they gave us a complementary first anniversary cake upon submission of a photo of our wedding cake for their archives.  Second, they honored a $25 credit from our wedding cake years later toward a birthday cake for me last year.  I also trusted Bittersweet with my daughter's first birthday cake earlier this May.  The theme of her party was \"Piggy in Pink\" and I envisioned a giant pink pig rolling in mud on top of her cake.  It was a pleasure working with Esther on the planning and specifications, and I really appreciated her input in terms of pricing based on different options for the cake.  It was ready for pick up at our desired time and looked exactly like what I had imagined.  I've also tried several cakes of the month for parties and they were all delicious.  My favorite so far is their S'Mores cake made up of layers of brown sugar cake, milk chocolate mousse studded with toasted marshmallows and graham crackers, and finished with vanilla buttercream and graham cracker crumbs.  I ordered one the night before my co-worker's birthday and received so many complements of how moist and delicious it was.  I hope they consider adding it to their standard cakes to order, it was so good.  Their presentation is also so well executed...not only their cakes, but also their display counter.  <br><br>We've only dined in the cafe once or twice, which has a limited selection of food, but I really go there just for desserts and to order items to go.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wEUpfhyF3OLXXXvuuiq10w/348s.jpg", "caption": "Custom Pig Cake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hvwRl9zhJy8M1iruQoj-dg/168s.jpg", "caption": "Inside of Pig Topper"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dSIT-whB-ANbIp87TeVB6A/168s.jpg", "caption": "S'Mores Cake"}]}}, {"review": {"des": "Great friend had a wedding, we did the cake tasting here.  Absolutely amazing.  I have been back a couple of times.  Macarons are my favorite thing.", "pics": null}}, {"review": {"des": "Amazing bakery! I had the club sandwich with pesto. My friend had the quiche. We both ended our meal with a delightful dessert from the pastry display upfront. This picture is the seasonal pumpkin cheesecake. I cannot tell you how happy I was with what this place is producing. When I expressed how interested I was in their Kitchen production, the owner came out and gave me a behind-the-scenes tour. If you're in Chicago, you need to check this place out.", "pics": null}}, {"review": {"des": "I stopped in for lunch today and loved the entire experience. I picked out some baked goods and the young man working the front counter told me he'd handle all that while I picked out my table and got situated. I ordered the Caesar salad and added chicken. This is one of the best Caesars I've ever had - not too much dressing and it was not overpowering, and the rosemary croutons were such a nice addition. <br><br>The atmosphere was wonderful and they brought over my takeaway goodies when they brought my check. I added a very good latte to go and loved that too. I was proud of myself for resisting the urge to order a slice of cake, but I think now what I'll do is go back and get a slice before I leave town as my reward.", "pics": null}}, {"review": {"des": "We were in town visiting and decided to look for some nice baked goods. We initially went to a different shop on the same street and walked in and walked out. We found this shop on Yelp and were pleasantly surprised. It's a great little bakery with a lot of variety and options. There was a good assortment of tarts in various sizes, macaroons, muffins, cookies, and croissant type pastries. We settled on the lemon meringue tart, pecan sticky buns, muffins, pain au chocolate. The pastries themselves were well made and very flakey. The meringue tart was also very good and not too sweet or too heavy. The meringue itself was light and creamy. If you're around or in town I recommend you stop by.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dvRHclGyrdOLp9ukk3vX1w/168s.jpg", "caption": "Lemon meringue tart"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gnhPfShr-kKAvzplvMyMAA/168s.jpg", "caption": "Pecan sticky bun"}]}}, {"review": {"des": "Very disappointed in the customer service the last two times my husband and I have been in. Specifically, trying to give us options on pies and cakes. We were basically told that we can only choose what's in the case on display for the weekend and even then it could be any possible flavor. The person didn't know what flavors we could choose from if we did order a cake. In addition, the scones have gotten considerably smaller for the same price.  This bakery was a very special place for the years we've lived here, but now we will be getting everything from Sweet Mandy B's where they sit down with you and show you options and great customer service.", "pics": null}}, {"review": {"des": "We came here for a quick breakfast - we did not get a quick breakfast.<br><br>TLDR - our server forgot about us and our food.<br><br>We ordered hot chocolate, ham&cheese quiche, ham&cheese croissant and a cinnamon roll. We got the hot chocolate a few minutes later - delicious and we enjoyed it ... and waited for everything else. At this point we hoped they were making quiche from scratch just for us and that the display of baked goods was just for show and were getting fresh croissants and cinnamon rolls. Alas, that was not the case.<br>30 minutes later our server asked us how we were doing and if we wanted anything else. We mentioned that we were still waiting for our food. His reply? \"awesome\" and then left. (to be fair, he said that alot and seemed like it was his stock phrase). He came back a minute later and asked us what we had ordered and said he would check in the kitchen to see what was going on. He brought us our pastries from the display case - they were not warmed at all. We had to ask for them to be heated up, he was concerned that the frosting on the cinnamon roll would melt a little... um.. do people usually eat the cinnamon rolls cold?<br>We got the warmed up roll and croissant and then we received our quiche - potato and cheese. At this point we were done. We asked for everything to be packed up and we went across to Osmium for coffee. <br>At least the quiche was taken off the bill.", "pics": null}}, {"review": {"des": "This is an elegant, established Chicago bakery. Prices are high and the service has been a challenge for over a decade.", "pics": null}}, {"review": {"des": "literally one of the best cakes i've ever had! I've now ordered two cakes from them this year and they keep getting better. I must say i was especially impressed by the craft of the specialty cake (shaped like the Roman Coliseum) ordered!! it blew everyone away and it tasted so delicious and creamy and moist!!! I would recommend this bakery any day. plus their dine in food is quite delicious", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NB_xcQDHzDVCG8mMSL0myw/348s.jpg", "caption": "Truly amazing custom specialty cake that i ordered for a 30th birthday party. Extremely impressed by it and it was absolutely delicious"}]}}, {"review": {"des": "This is my favorite place for cakes or cupcakes.<br><br>Cake-wise, I've had a range of their flavors. My favorite is the fudge with caramel creme brulee filling. I've also had the flat-out vanilla-vanilla and enjoyed it thoroughly. It is on the pricier end of cakes for me, but it's definitely worth it.", "pics": null}}, {"review": {"des": "Bittersweet made a custom birthday cake for my Mom's 60th birthday celebration. It. Was. INCREDIBLE! They brought my vision to life in the most beautiful, whimsical way. The cake not only embodied my mom's personality in every detail - but the cake, filling and icing were absolutely incredible! Delicious and so refined. Everyone loved it. Thank you, Bittersweet, for making her birthday so memorable!", "pics": null}}, {"review": {"des": "We were looking around for a coffee shop and came across this little place!  <br><br>First of all, the feel of the place was very homy!  It's a feeling that just makes you want to stay and keep ordering stuff!<br><br>We ordered a hot chocolate and latte, both of which were amazing!  It is important to note that the presentation of the hot chocolate and latte was also very nice.  We also had some macaroons to go.  They are a bit pricey but were definitely worth it!  <br><br>It is a great place to visit if you are in the area.  The only bad part is that they close early =[  so make sure you go early!", "pics": null}}, {"review": {"des": "Well my wife ordered a birthday cake for my niece's first birthday party, and it was delicious in my opinion. My sister loved it and I love the service that I received from their wonderful employee when we arrived to pick up the cake. My brother-in-law visiting from New York, even purchase some of their delicious cookies. I actually loved their display of pastries and I'm looking forward to returning to try some of them pretty soon. My experience was a wonderful one and brother-in-law would second that, if needs be. I would definitely recommend them to my family and friends.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kgHK0P32o1jKiqK8nQO35Q/168s.jpg", "caption": "For my niece:)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Yd1oCqXfnY_1ZSzuFnDEuA/168s.jpg", "caption": "So good"}]}}, {"review": {"des": "I haven't had the pleasure of tasting their highly recommended cakes, but I'm giving 5 stars for customer service! I have a dairy allergy and I'm in the midst of figuring out a wedding cake vendor. I submitted an inquiry to see if Bittersweet can accommodate dairy allergies at this time, and while they unfortunately can't, Nancy was kind enough to promptly recommend another wedding cake vendor that would suit our needs! I so appreciated the help even though we wouldn't be able to use Bittersweet as our vendor. Thank you Nancy!", "pics": null}}, {"review": {"des": "O. Ma. Gaad.<br><br>The Lemon Meringue tart is HEAVENLY!  The lemon is nice and tart - and the meringue is real. None of that commercially fluffy stuff.  This has thick silky egg whites with a bit of sugar whipped in.  Maybe it tastes so good because I have not been eating much sugar.   <br>Our CTO brought in 3 dessert cake / pie / tarts and a bunch of cookies. Yes, I DID sample them all and I gotta say . .  I might go finish the Lemon Meringe tart before anyone else has any!<br><br>The flourless chocolate mousse cake was good.  But I like mine a bit more bittersweet (but I AM NOT complaining). The fruit tart was nice - it had a dense, possibly nut flour shell and the raspberries on it tasted like ones from my grandmother's garden. There also were shortbread cookies with a dollop of jam: peach/apricot, lemon, and black raspberry/boysenberry.  Those were pretty darn good, too.  <br><br>We are very lucky to have such a nice CTO who feeds us such goodies!", "pics": null}}, {"review": {"des": "I cannot say enough good things about Bittersweet. My coworker ordered his wedding cakes from here, and after eating a slice at his wedding, I became hooked. I ordered a cake for my engagement party from here, and they did an amazing job. I brought a design in that I found online, and they replicated it perfectly! We received so many compliments on how pretty the cake was, as well as how delicious it was. We ordered the coconut creme cake, and the vanilla cake was super moist, and the coconut creme filling was decadent. Everyone who left the party asked for leftover cake to bring home.<br><br>I have also stopped in here to simply grab a pastry or coffee. The inside of the bakery is very cute, and reminds me of a small parisian cafe. All their pastries are amazing. I especially love their seasonal cookies (super buttery) as well as their croissants. You really can't go wrong with anything on the menu. Stop in for a coffee and pastry, or order from them for your next event!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xn6Vzm_0marCCH-CtMCkpA/168s.jpg", "caption": "Green tea with a croissant"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7EwJ-4SSVbgC_NtBLLTiOQ/168s.jpg", "caption": "Custom engagement cake: coconut creme flavor"}]}}, {"review": {"des": "Cute shop on Belmont. Plenty of seating if you're looking to stay awhile. I was able to pick up a king cake for Mardi Gras last minute. It was good, but lacked the traditional decorations of of beads and Mardi Gras coins.", "pics": null}}, {"review": {"des": "Always love to visit this bakery. The ambience is fancy and royal. Cakes with coffee/tea is what I like the most here.", "pics": null}}, {"review": {"des": "I am yet to have a bad experience here. They have seen me thru so many special occasions that are so affordable that I ought to be a share holder in this company. What I enjoy the most is the ability to be surprised by entrusting them with my flavor choices/combinations.", "pics": null}}, {"review": {"des": "Our wedding cake was PERFECT! It was light, flavorful, not too sweet, the perfect texture and totally beautiful. We had a 3-tiered hazelnut cake with chocolate mousse filling and traditional vanilla buttercream. Our guests could not stop complimenting how delicious our cake was. And it was the perfect size for our 110 guests. We had 4 slices left over, which was just the right amount to take to our honeymoon suite after the reception! <br><br>Bittersweet Bakery also really went above and beyond by providing a beautiful, etched gold cake stand at no additional charge that gave our cake such a polished and finished look. AND we did not have to worry about saving the top tier because as a part of our contract Bittersweet will make our anniversary cake fresh! We would highly recommend Bittersweet for any special occasion.", "pics": null}}, {"review": {"des": "My sister discovered this place and we all now adore it--especially the large brownie that we can split amongst the whole family! Delicious.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/c8H-4zOgHrIOGm2PtHC8Ug/348s.jpg", "caption": "Brownie slab as big as my thigh!"}]}}, {"review": {"des": "Our CPA lives on the same street but who cares. I must always check in to \"BitterSweet\" first, pick up some pastries and then head to file my taxes.<br><br>1. visitors can sample bits of bread/ brownies/ cookies. <br>2. They have so many options to chose from and everything looks fresh and delicious.<br>3. Staff is friendly and helpful.<br>4. The whole place is so warm and lively and sets a perfect example for a local small business doing well. <br>5. Tip: Window seats are even better.<br><br>My favorite - grapefruit meringue.", "pics": null}}, {"review": {"des": "Beautiful pastry and cake shop in the French tradition. Tiramisu and apple tart were fantastic. Iced coffee was very strong--just how I like it. Service was friendly, attentive and very helpful--we bought more than we planned. A 5 minute walk from the Red line Belmont stop.", "pics": null}}, {"review": {"des": "Review #300!<br><br>4.5 stars. I've been here twice, once for brunch, and I was very pleased with their friendly service & excellent food. Tbh, I fell in love with their apple custard French toast o.o<br><br>As a bonus, they have full table service. The tables at brunch had fresh flowers, and there were several couples dining in. Lovely interior, peaceful vibe. Happy to have them in the neighborhood, and I definitely foresee future noms here, my stomach sez so xD", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bcArgJDmYbXladOIaDrg0w/348s.jpg", "caption": "Coffee and ham & cheese croissant"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hdGUx82SyTqYOly-WfsNBw/168s.jpg", "caption": "Banana cake with choco frosting ($4.95)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/V_EE02OHYD0Lqf3u2Pji5A/168s.jpg", "caption": "Apple custard French toast. A true beauty. One of the best I've ever had!"}]}}, {"review": {"des": "Amazing pastries, but service needs to be clearer. We were told to sit down if eating in, but we had to take a number and get in the to-go line to even get our bill. Wish it was order at the counter and sit instead of being frustrated (French style?).<br><br>On the other hand, the croissant, ham and cheese croissant, raspberry brioche, and pecan roll (made w croissant dough) are really great. Coffee is ok. Cute gift ideas as well.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dVawWjGGwsMlc3tzfqYBgQ/168s.jpg", "caption": "Du café, svp"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VA1uTfrDrWwMOmwTwiR9Ig/168s.jpg", "caption": "Beautiful display of delicious pastries"}]}}, {"review": {"des": "Stopped in for lunch for the first time with my Mom after having been by several times to pick up cookies, macaroons, scones, you name it. Their bakery items are very, very good! I also love their buy one breakfast bread, get one free deal they offer during the last hour they're open each day. This is a great deal for people coming home from work like me!<br><br>Anyway, back to lunch. Their menu changes from day to day which is cool. I ordered the vegetable soup and chicken caesar sandwich while my Mom got the same soup with a chicken and brie sandwich. Everything was delightful! Food was really good and even the half sandwich size was quite generous. We also had the bittersweet hot chocolate which comes in an adorable tea pot like thing with enough coco to fill your cup twice.<br><br>Whether you're looking for a place to have a nice healthy (and tasty) lunch or need to pick up a bunch of treats for a large group, Bittersweet is the place to go!", "pics": null}}, {"review": {"des": "Food and pastries are tasty, I will give them that.<br><br>Probably the worst service I've ever received, though.  Went with coworkers for a weekday late lunch break.  We were literally the only people in there.  Waited about 15 minutes for service, then went to the counter to attempt to order there, and they said they would send a server over.  They did, we ordered.  I ordered a half sandwich/half salad combo.  Food came out in a reasonable amount of time, 15 minutes or so, except only my half salad arrived with the server saying, \"Your sandwich will be right out.\"  We eat.  No sign of anyone - no server, no counter staff.  I finish my half salad, my coworkers finish their full meals.  I go up to the counter, flag someone down from the back, and tell them to please cancel my half sandwich as we are finished and need to be getting back to work.<br><br>The server comes over and sternly delivers a lecture about how if I wanted my food together I should have specified that.  She said they usually only bring one half order once the other is finished.  First of all.....WHAT? Who does that? Sounds like a cover story considering you said my sandwich would be \"right out.\" Secondly, I had been finished for long enough for my friends to finish their whole meals by that point. Basically they just didn't bring half my meal and then tried to pass it off as MY fault.<br><br>Ordered cookies at the counter to go, but it took FOREVER to actually pay for our meals.<br><br>Have not been back since and never will.", "pics": null}}, {"review": {"des": "Bittersweet is one of those places where you want to keep returning to even though you know deep down it's not good to do so. They have so many little dessert creations that it leaves me very conflicted on what to order each time I ignore my deep down feelings and pop in anyway. <br><br>+ easily walkable from the Belmont or Wellington 'L' stops!<br>+ samples!<br>+ such a cute and brightly lit store. Perfect for afternoon snacks.<br><br>Macarons - The flavors are outstanding and really pop when you take a bite. My favorites are the salted caramel and the passion fruit. The one area that was lacking was the texture. It didn't have the chewiness that I like from macarons so each bite fell flat instead.<br><br>Pecan tart - Excellent pecan flavor as well but the tart was too hard for me. I felt like I had to stab at it to take a bite. <br><br>Flourless chocolate cake - Very rich and chocolately. They use quite a bit of cocoa powder making it a little bitter but it counters the sweetness so it makes for a good balance. Perfect for chocolate lovers.<br><br>Vanilla cheesecake - Yummy! I love the sturdiness of the cheesecake. It holds up well and doesn't fall flat in your mouth.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HhGwgeocIs8LmZYNxygTrQ/168s.jpg", "caption": "Vanilla cheesecake and macarons"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tGFV-QvfXk8vRn23DNLvUA/168s.jpg", "caption": "Flour less chocolate cake"}]}}, {"review": {"des": "This is my go to place for cakes. This place does a beautiful job.  The times I have purchased cakes from here I have heard nothing but good things about the choice I  made.  When I have a special event or a just because I want to have something sweet I order from here.  I highly recommend the Almond Strawberry Brûlée;It's one of the best cakes that I have ever had and is to die for.  Seriously, people that I know are not cake eaters will eat this cake.", "pics": null}}, {"review": {"des": "Nancy and her team at Bittersweet are fantastic! Nancy was responsive throughout the process, updating the invoice every time the guest count changed, and even emailing us at 11:00 the night before to nail down the delivery time.<br><br>I knew from the minute we sat down for the tasting, they were going to do our cake. The tasting was professional, they offered coffee and tea, and they brought out a beautifully arranged plate of all their different sponges, fillings, and icings. We came so close to a carrot cake and banana bread wedding cake - that's how good everything was! The cake was beautiful when it arrived, and they did a great job of interpreting our wedding style into a cake (which was - we have no clue, just make it timeless!). Everyone loved the cake, and we had no leftovers at the end of the night - my parents took home four pieces!", "pics": null}}, {"review": {"des": "I ordered a birthday cake from here last week and the cake was impeccable!  The service on pickup was great too. The young lady I ordered with spelled my name wrong initially (she should have verified the spelling, as I have one of those names that could go anyway).<br><br>Overall I was happy with my experience and my guest all loved the cake! It was absolutely delicious.  The designs were simple, but the taste made up for it!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SUGEF5hEdZgIXvSht_LP_Q/348s.jpg", "caption": "My birthday cake! Almond cake, vanilla brûlée, and strawberry preserves. DELICIOUS!!!"}]}}, {"review": {"des": "what a beautiful cake for our wedding!  we couldn't decide on the flavor, so we had red velvet AND passionfruit!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/C75EpJA8z-bttxTo3KG_Eg/348s.jpg", "caption": "beautiful and delicious!!"}]}}, {"review": {"des": "Today is our 1 year wedding anniversary! We picked up our complimentary 1st year anniversary cake. Bittersweet had us choose one of our flavors from our wedding cake. Since we had a Fall wedding, 10/11/14, one our flavors was carrot cake with buttercream. It was amazing! Just the right amount of spice! <br><br>During our wedding planning last year the best and most fun part was the wedding cake tasting. Nancy at Bittersweet made it fun and easy! The cake tasting was phenomenal! Experimenting with the different flavored cakes and fillings was quite a treat! Nancy was very helpful in helping us pick the look of our cake. She also quickly responded to e-mails.<br><br>The tasting experience, service, and our wedding cake from Bittersweet was fantastic! <br><br>Having a slice of our 1 year anniversary cake confirmed how amazing Bittersweet is with their cakes and pastries! All of our cakes and special pastries our coming from Bittersweet! Hands down the best bakery!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fGewtBD2d0xupWix_Uxiyw/348s.jpg", "caption": "Our 1 year anniversary cake. Thank you Bittersweet!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qvK8LG7psRwhaO1TaGp5lA/168s.jpg", "caption": "Our wedding cake and stand from Bittersweet."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FaeGJeG3eTvyK8Z7JE2PFA/168s.jpg", "caption": "Our amazing wedding cake!"}]}}, {"review": {"des": "We got our engagement cake here and even got a small gluten-free red velvet cake. Both cakes were delicious and the designs turned out exactly how we wanted. The guests loved the flavors - we had a tiered cake with vanilla for one tier and chocolate for the other. <br><br>The only hiccup to remove a star from this review is the day-of stress we had to face due to a rude delivery coordinator at the bakery. We had requested a small window of delivery and upgraded to pay extra for this service because our party was on a boat. The morning of the delivery they called us at 8AM to say the cake is out for delivery, when our requested window was 1PM-2PM. The person on the phone was extremely rude and while the order slip had recorded all the details of the delivery conversation, he said we didn't understand the delivery business and neither do the bakers, so we need to now take his word for it instead and accept the cake at 8AM for a party at 2PM. Not what we needed on the day of our party.", "pics": null}}, {"review": {"des": "This bakery is the best. Their breads, breakfast treats, and pastries are all amazing. We got our wedding cake from here as well- it was delicious and beautiful. Definitely stop in! You won't be disappointed.", "pics": null}}, {"review": {"des": "This sweet bakery is ON POINT! The variety, the atmosphere, and, of course, the pastries are charming and so quaint. They play soothing classical music in the background and the lighting is a nice ambience. Stopped by on a Sunday and got the raspberry linzer cookie and one of yesterday's cupcakes (tiramisu!). Both were delicious, not overly sweet, and incredibly beautiful. The prices are fair (and getting yesterday's cupcake was especially a fantastic deal). The staff is attentive, patient, and very helpful! Plus you get a free cookie if you check-in.", "pics": null}}, {"review": {"des": "One of my favorite bakeries ON EARTH!<br><br>I try to stop in once a week for a cheddar scone. I am addicted to them.<br>The small tarts are another favorite and are the best little things to surprise people with.<br>I highly recommend the espresso ganache tarts, or torts.", "pics": null}}, {"review": {"des": "My pre-ordered cake did look nice although they omitted some punctuation of which I reminded them twice. The taste was okay except the icing was pretty bad. Nobody at my party ate that part. This is the strawberry almond creme brulee cake btw.<br><br>My main issue happened when I picked up the cake. With the risk of sounding cliche, I felt very racially profiled. There was an older, Caucasian couple ahead of me who placed their order with a girl. The girl went to the back and a woman, possibly of Indian descent, came out and asked who was next. I was standing in front of her and told her it was me. She flashed me an angry expression and proceeded to repeatedly try to get the attention of the couple. When they told her they had been served, I guess she was finally satisfied. I was pretty angry for the remainder of the transaction. <br><br>I also love the answer I received when I asked if the flowers were edible: \"They're real\". Um. Yes. I realize that.", "pics": null}}, {"review": {"des": "You'll think you are in a European Cafe. Lovely space, great service and absolutely delicious salads, soups, quiche pastries & coffee!", "pics": null}}]}