{"name": "blackbird-chicago", "reviews": [{"review": {"des": "This place was pretty busy. <br><br>The service was superb! Very accommodating! The waiter was very helpful in a professional way which made you feel very comfortable asking him question or recommendation.<br><br>The tables are very close to each other, so be warned people can easily hear your conversation. In other words it is not the most romantic setting. I came with family and felt very relaxing.<br><br>The food were impressive but too salty for my taste and one of the family members. <br><br>Without the drink, I'd say $80/person easily. And we were all pretty full that we shared only one order of desert.<br><br>I would say it was a pretty pleasant experience over all!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/defpYovbXJLy12E2iXYuSQ/168s.jpg", "caption": "Napoleon"}]}}, {"review": {"des": "This was my second time at Blackbird and I wanted to update my review of this restaurant. When first visit left us a little bit with mixing feelings, the second visit was splendid!! We chose to seat at the bar this time to have more interaction with bartenders and ask about drinks they were making. Sometimes the description of the drinks does not give you enough information to determine if it will be on the sweet, sour or bitter side. Sitting at the bar gives you a great opportunity to get a right drink for yourself :) The amus bouche was excellent inviting you to what would happen next. The Rye bread served with delicious and silky spread is a staple before a dinner. We ordered:<br><br>1. Gently Smoked Cobia served with consomme-very interesting dish. You can definitely taste the smoke flavor infused to the flakes of the fish. A lot o flavors combined and yet balanced with ginger consomme.<br><br>2. Dry Aged Beef Tartare with walnuts and parmesan-definitely well made beef tartare. If you are a fan of beef tartare, you will not be disappointed.<br><br>3. Truffled Shrimp and Lobsterau pain with horseradish and cured egg yolk-this was a heaven on dish. The idea of combining the shrimp and lobster into one was beyond  imagination. This was so flavorful and tasty that we did not want it to end :) Buttery taste broken with the hint of horseradish was a very enjoyable dish.<br><br>4. Roasted Rohan Duck with deep fried carrots , foie gras and port wine was one of the best ducks I had so far. Perfect marriage. Meat was done to a perfect point and I liked the idea of deep fried carrots and foie gras definitely contributed well to the whole serving.<br><br>5. Rostaed Lamb Saddle with grapefruit, brussel sprouts and basil-my wife and I we love the lamb any way and this was the first time we had lamb saddle. Very flavorful most likely due to containing a little bit more fat, combining surprisingly well with grapefruit. Very compelling presentation of lamb!<br><br>Our dinner was accompanied with excellent drinks and I cannot name which one was the best of them as all were perfectly made. This was a superb experience in Blackbird that night. Thank you!!", "pics": null}}, {"review": {"des": "Fantastic 3-course prix fixe lunch - glad I went with a friend who was willing to share!  Perfect size and (as others have said), a great inexpensive way to try a Michelin starred restaurant.  Food was great from start (sourdough bread and honey butter) to middle (butternut squash, fried cod with incredibly flaky crust) to finish (pot de creme).<br><br>Only downsides:  VERY tightly spaced tables (they have to pull them out for you to get into the booth side) and noisy construction outside", "pics": null}}, {"review": {"des": "Well deserved 5-stars! Blackbird is an eloquent, yet accessible, fine dining experience. <br><br>We came with a large group from work on a Friday night, and had made a reservation weeks prior. This place gets pretty busy, and doesn't have a TON of seats, so would recommend you do the same. Staff was very accommodative in getting us settled.<br><br>The tasting menu for dinner is $140 and features 10 courses. I unfortunately couldn't participate as it would have been too much trouble to ask for 3-4 substitutions (I'm allergic to shellfish), but I recommend you do. I think the cuisine is technically \"American\" but definitely has some french infusions.<br><br>I opted for the tartare for a starter, which was good, perhaps not best I've ever had. Where I think they really marveled was with their mains, where I ordered the beef strip, and was AMAZED at the combination of textures and flavors they pulled together. The hint of vanilla was certainly bold, and unique. When they serve you, there's a fun surprise (which I won't spoil) that was executed with perfection. Service was phenomenal throughout. They also serve bread for a first course, which was accompanied by a sweet honey butter, with a perfect texture. My peers got the squab, and the Cabbage for mains, both getting solid reviews.<br><br>You could share dishes if you wanted to, but perhaps not as easy to do as some other locations in the area. An app, entre and dessert would be a filling, not sickening spread for somebody who is hungry. <br><br>For dessert, the team shared a bunch of dishes. I personally opted for the pumpkin cake (seasonal woo!), per the servers recommendation, though the mochi donut and ganache are fan-favorites, apparently. <br><br>The wine list is robust, with offerings from AUS, USA, GER, FRA, and ITL amongst others. Dress is \"smart casual.\" Blazers certainly are necessary, but would avoid hats, and t-shirts, if possible. Great spot for a third date, or dinner with the family/parents, as the prices are reasonable, yet the restaurant decor offers a scintillating feeling of elegance.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/W8yL23mGym-YqfpZbzg8Lg/168s.jpg", "caption": "Beef striploin"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tbL8rE7E-RyNwG0cX21Sxg/168s.jpg", "caption": "Beef tartare"}]}}, {"review": {"des": "Just invited Mom and a lawyer to have lunch here. We celebrated my new job in a big law firm. <br>it is an one star Michelin restaurant. The service here is perfect. one of the appetizer is shrimp balls. It not only looks nice，but also tastes good! We all like the deer and sea food. The sculpt of the dessert is good.", "pics": null}}, {"review": {"des": "This is the best lunch deal in Chicago.  Take someone you love.  I recommend the salad, fish and dessert.  Wine is very reasonable here.  I've also been here for dinner and ran up a huge tab but the reality is the lunch pre fixe is the steal of the century.  This is a no brainer to go if you want to take a loved one to a high quality meal.  <br><br>The service here is impeccable and the quality of the food and ambience is top notch.  I like it better than avec next door and I love avec.  Ha make sure to check this place out.", "pics": null}}, {"review": {"des": "Great place to feel bougie without being judged for being a commoner. Service is great, staff is attentive, and the snack freebies make you feel special (I.e. extra small bite at the beginning and end).<br><br>I came here for the 10 course meal as part of a celebration. The price is steep, but if you don't do it often and enjoy beautiful plating and unique foodie stories to tell others, then it's worth trying at least once. <br><br>The first time we came here was during restaurant week, which I thought was just an OK experience. I thought the tasting menu this time was much better. I hope to come back for lunch sometime.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-VAfVTysmkT-hBENzq-okA/348s.jpg", "caption": "Little overstated"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HUouZA7qp8I5H1q3dHO1vg/168s.jpg", "caption": "Amazing duck dumplings, burnt my tongue a little"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qmBenr8HW8yBUTO2f3CvHA/168s.jpg", "caption": "Amazing fish"}]}}, {"review": {"des": "5 stars for prix fixe lunch, 4 stars for dinner tasting menu.<br><br>Lunch is a great value. High quality bread and butter, appetizer, entree, and dessert for 25USD. Not as seasonal as some other restaurants but the menu changes every few months. Appetizers range from beef tartare, to soups, salads, or wonderfully prepared vegetables. This is what I believe to be the best value lunch in downtown in Chicago.<br><br>We had the 10 course winter tasting menu. The pastry chef wonderfully accommodated for dietary restrictions for one of the guests with an entirely different and wonderful tasting substitution. Unfortunately, while no dish was poorly executed, nothing particularly wowed us in either taste or concept. <br><br>My favourite of the night was the \"moose tracks\" venison with a chocolate paste reminiscent of mole, but it was a dish that was reminiscent of a lunch strip steak offering made the same way.<br><br>Good, sometimes great food, not worth the price for dinner. Though I still recommend it above all else for lunch.", "pics": null}}, {"review": {"des": "I dined here for my birthday back in August, and I meant to write this review sooner and to be honest I thought I already had. I came down to Chicago with my parents specifically to have the tasting menu and originally we weren't going to do the wine pairing, but decided once we got to the restaurant to do it despite ourselves. It was absolutely worth both the trip down and the $200 a person with the wine. The seasonal tasting menu has obviously changed since I was there, but the 12 course summer menu was one of the best meals I have ever had. Chef Ryan and his crew absolutely nailed every dish, and the wine pairings were spot on. The Somme was friendly, knowledgeable, and prompt. Every person we encountered was courteous and professional. At one point, it started raining outside and some smokers had dipped under the awning over the entrance and my mom made a comment about the smoke coming into the dining room. Our server overheard, and walked out and asked them politely to move on. The ambience is modern and contemporary yet warm and inviting. And the chairs were very comfy, as the whole tasting took about three hours. Every course was served to everyone at the table at the same time, as a proper restaurant of this caliber should. Also, the food. It was all so very good. And the portions were definitely enough, certainly we did not leave hungry. From start to finish, we were absolutely blown away by each dish complemented perfectly with its paired wine. By the end of the meal we were all jolly and full. Afterward, I went up to the line where chef Ryan was expediting and shook his hand and he was also very polite and humble. This place is killing it, and their star is well deserved. I think another star is in their future on this track. It was an absolutely flawless meal from start to finish. I would recommend this place to anyone with the dough to spend, as no one should leave disappointed.", "pics": null}}, {"review": {"des": "Great value for their prix fixe weekday lunch menu, 3 courses for $25.<br><br>The food made for a fun dining experience.<br><br>Started with bread service, a malted oat sourdough with a whipped butter spread, dense crumb, still delicious.<br><br>Green garlic falafel - while I enjoy crunchy textures, the falafels had too hard pieces that I would only recommend this to people of stalwart teeth.<br><br>Roasted whitefish - enjoyed<br><br>Kaffir lime scone - pass on the whipped cream inside<br><br>Would need to try more of their items to rank higher. Friendly service except for in the beginning. Thought it was weird how the host didn't greet and instead helped 2 other parties that walked in right after me.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ojUMVmQwoTj2zrIM6G4UFA/348s.jpg", "caption": "Kaffir lime scone - earl grey crumb, strawberry ice cream"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/z-45RTHP3zb8sFhzIk41Hg/168s.jpg", "caption": "Roasted whitefish - caramelized yogurt, endive, rhubarb kosho"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pyLRJ5i_QOCj2JGIXyy0wg/168s.jpg", "caption": "Green garlic falafel - dill pickle, sweet fish sauce, sorrel"}]}}, {"review": {"des": "Great value for quality and quantity. Would absolutely come back. $25 for a 3 course meal at a Michelin is crazy!<br><br>The meal started off with some sourdough bread with a brilliant honey infused butter. I got the shrimp salad which was cooked to perfection, extremely tender, and large. The duck confit came with some nice white sauce and had just the right amount of greens to fight off the richness of the dish. The meal ended with what seemed like a deconstructed apple pie with olive oil ice cream. <br><br>The service was extremely friendly and professional. Great experience overall for an unbeatable price.", "pics": null}}, {"review": {"des": "I must start my review saying this is a fantastic restaurant.  It's classy, refined and creative.  The staff is extremely knowledgeable about the cuisine and very friendly.  So you ask why not a perfect 5 stars... well you will see.  To start I had the most wonderful lobster and horseradish spread on grilled fresh bread.  It was absolutely divine and decadent.  Who would have ever imagined that lobster and horseradish went together so well???  Here is where things went downhill.  My main was the steak from the menu.  I love steak, I mean, I love steak, all kinds of cuts but this piece of striploin was slightly under par.  I think it was cooked sous vide then gilled.  Here was the issues I had with it:  It could have been grilled a bit more to give a bit of crust and flavor and the peice of meet was a very stringy.  I had to really chew it.  Don't get me wrong this was an excellent sourced piece of meat, but just by cutting in half you could tell it may not have been the best in house that night.  Small blemish on the entire meal.  My dessert consisted of something I love most... CHEESE.  So good paired with a nice glass of Cabernet.  All in all, an excellent meal.  Would have been perfect if the star of the meal would have been selected better.  STILL A MUST TRY IN CHICAGO", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2IkR5d8zXoxfCG0y6Ei0vQ/168s.jpg", "caption": "Amazing Cheese Plate"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8wWyLk-xaL9CScnrlou0vg/168s.jpg", "caption": "Lobster and Horseradish"}]}}, {"review": {"des": "(4.5 stars)<br><br>While it doesn't differentiate itself too much from other one-starred Michelin restaurants, the quality of the food and service at Blackbird make it an excellent restaurant. <br><br>At my last visit, I enjoyed the shrimp and lobster appetizer and the delicious lamb saddle for my entrée. Both dishes were prepared very well, punctuated by great flavor and balance. Blackbird serves up some good drinks as well. Consider the \"Trust Us,\" which is Blackbird's drink of the day. As the name suggests, you don't need to ask what the drink is before ordering. (It'll probably be good either way!)<br><br>The main dining area isn't large by any means, but at least during my last visit, it didn't feel cramped, even as the restaurant began to fill up. It's certainly minimalist in design, but there's a certain warmth about the space that lends itself to a nice ambience. Blackbird has a great private dining area upstairs also. <br><br>If you're looking for a restaurant at the cutting edge, then Blackbird isn't it. But, if you want superb food and service, then it certainly doesn't disappoint.", "pics": null}}, {"review": {"des": "Had a very good meal at Blackbird, one of the better ones I've had in Chicago so far. Service was on point, as to be expected from a Michelin starred restaurant. The server was very helpful with her recommendations, attentive, always around when I needed her and very friendly. And they had many others constantly refilling waters, taking plates, etc. Courses were perfectly timed and the experience was great.<br><br>The meal started with the house made bread. I don't understand how, but this was one of my favorite bites of the night. I had them bring more. I can't remember what the bread was that day (I want to say a type of sourdough), but it was warm, had perfect texture, and was served with the perfect consistency celery infused butter which worked. <br><br>The amuse bouche was also a great starter - delicious falafel that had great texture on the outside, but was perfectly moist on the inside, served with a delicious pesto. <br><br>For dinner, I ordered the wagyu beef and porchetta. The wagyu had tons of flavors on the plate - salty, sweet, and everything in between. There were sweet potato chips, sour pickled red onions. The meat was perfectly tender and cooked well, although a bit on the salty side. There was a lot going on but overall the dish was well balanced. The porchetta was very fatty (as expected). It was served with a citrus sauce, and there were pieces of grapefruit on the plate that made it light and fresh. It was served with kimchi kale which was warm and added a little kick to the dish. The cornbread on here (one of the cook's family recipes), was probably the best thing on the plate it was so good. <br><br>I was too full for dessert, but they finished the meal with some goodies and also sent me home with some. The cardamom biscotti was delicious, as were the fruit squares and chocolate. Overall a great meal and not too expensive.", "pics": null}}, {"review": {"des": "Excellent experience with the hubby! Very romantic, quaint and sophisticated. Our tasting menu was delightful! We especially loved the crisp veal sweetbreads! I particularly remember my endive salad--refreshing and perfect! And their duck is divine--perfectly cooked, nicely crisp skin, not too fatty. Ugh, I just loved this place! And we both LOVED the hand soap in their bathrooms... it's in the details! LOL", "pics": null}}, {"review": {"des": "Have been here more times than I can count for what I consider to be the best lunch deal in the city - 25$ 3 course prix fixe and bread/butter with food and service maintained at the 1 star experience you would expect here.  <br><br>On each and every occasion the service was delightful and elegant. The food was filling and absolutely at the caliber that one would expect at a restaurant that has held a star for this many years.  The food is delicious with clear technique driven cooking that truly succeeds.  I can only wait to try dinner here sometime...", "pics": null}}, {"review": {"des": "Came here for dinner with colleagues. I had the clam tortelli and for dessert - a chocolate and white cake with raspberries. It was really delicious. I will definitely come back and check out the tasting menu.", "pics": null}}, {"review": {"des": "One of my favorite restaurants in West Loop! I went to there with my girlfriend, so we could also try a little bit dishes from each other. <br>Appetizer is amazing, my favorite is Shrimp and Lobster au pain. I also tried Lamb tartare, it's my first time to try fresh lamb, it sound weird and tastes incredible. <br>As of entrees, we tried roasted lamb and grilled sturgeon. Sturgeon is good but I prefer the lamb.<br>The space is very large but the service is great.", "pics": null}}, {"review": {"des": "I only came here for lunch but their lunch prix fixe for only $25 is so worth it! It was my last day in Chicago and I had only a few hours to spend. I've had Blackbird on my bucket list for forever and thought I might as well. I didn't know about the prix fixe menu until being there but it's such a great deal! The pre fixe includes an appetizer, entree, and dessert. <br><br>It's good to go with someone else so you can other different things and get to sample a bit of everything. I ordered the warm shrimp salad which I thought was the better appetizer. My boyfriend ordered the salad which was really good too but the shrimp was so buttery and good! <br><br>For entrees I ordered the whitefish and my boyfriend ordered the hanger steak. I loved both our dishes. There were strawberries in the hanger steak which I thought was a little weird but I thought it was an interesting taste combination. <br><br>I had such an amazing experience here for lunch the people were very nice and attentive. I want to come back to try their dinner next time!", "pics": null}}, {"review": {"des": "Hi - such attentive service. Good guidance through the menu. The cheese plate is pretty amazing, and my guest's entree (the duck) was fantastic. I was guided to the cabbage plate (the vegetarian option) and it was oddly inedible -- just incredibly heavy on the vinegar. I didn't trust myself the night of -- I mean, who am I to question a Michelin starred restaurant? And I didn't want to make my guest uncomfortable, so I said I was full and took mine home for the next day. Still completely inedible. A $40 entree I basically threw away. I told the restaurant via email and I think what is most irritating about the whole thing is that they didn't respond. Really, I just suggested that since not many people probably order the veg option, they may want to re-taste it. But, no response. Kind of a bummer of a way to end the evening.", "pics": null}}, {"review": {"des": "This was my first time dining at a Michelin restaurant for lunch and surely it didn't disappoint. The pre fixed meal was $25 dollars and it consisted off an appetizer, entree, and a dessert.<br><br>The warm shrimp salad was cooked to a nice tender texture and the flavors were very light and balanced. <br><br>The hanger steak was cooked to a perfect medium rare and the accompanying mole was very interesting in a good way. The truffle oil added a nice flavor to every bite. <br><br>The chocolate pudding wasn't overly sweet and it was the perfect amount to eat for a light lunch. <br><br>I also ordered a glass of the  corbieres rouge which I enjoyed very much.  For the amount that you are paying you will definitely get the best value in both service and taste!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/G1zAiFBUCHT1lkVavwFo1g/348s.jpg", "caption": "Pudding"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rbpoKkz0pJAfjQeAhxrM9w/168s.jpg", "caption": "Steak"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/V8pW0s0Apd16hJK8U5dF3A/168s.jpg", "caption": "Warm shrimp"}]}}, {"review": {"des": "Time to review my 1st Michelin Star experience. <br><br>I was celebrating my 1-ish year anniversary with my girlfriend and after being unable to obtain reservations at Alinea, we managed to secure a last minute reservation for Blackbird. <br><br>They had a 5 or 10-course tasting menu for us that evening to pick from, we opted for the 10-course, because why not? <br><br>Our 10 course tasting menu included-<br>1. Rhubarb, Green Coriander, Churro<br>2. Crab, Sunflower, Strawberry, Tamagoyaki, Caviar<br>3. Hiramasa, English Pea, Puffed Grains<br>4. Artichoke, Morel, Fromage Blanc<br>5. Sturgeon, Garlic, Almond<br>6. Lamb Meatball, Pickled Shrimp, Licorice<br>7. Rohan Duck Breast, Lavender, Patato<br>8. Passion Fruit, Jalepeno, Freeze Pop<br>9. Goats Milk Flan, Strawberry, Basil<br>10. Tonka Bean, Carob, Churro <br><br>The flavors, textures, how the food pairs, it messes with your taste buds. <br>It was fun eating every dish, component by component, and then mixing it all together to bring it all together. I'm not used to eating this kind of cuisine, so my mind was rattling the whole time, trying to familiarize the flavors we were eating. We also got some of the cocktails which were delicious as well. Looking back, I think I would have tried the wine pairing too. <br><br>We were seated near the back of the restaurant so it was interesting to see all the kitchen action and prep work for the various dishes. Service was amazing the entire evening and very informative about each of the dishes, especially for some of the ingredients we had never even heard of. Highly recommend trying it out!", "pics": null}}, {"review": {"des": "Came in for lunch and did the $25 prix fixe menu (c'mon, that should be enough for 5 stars alone!) and was in awe of the quality of food.  To start, I ordered the mushroom velouxe and it was immediately clear to me the quality of meal I was going to indulge in.  Never would I have thought that I would enjoy pear in what was basically in between a mushroom soup and mushroom puree, but MAN was it good!  The pear was cut into spaghetti-like strands, which I thought was a perfect compliment to the very earthy mushroom flavor.  For my entree I ordered the chicken sausage which was a very unique dish that also blew me away.  Finally, for dessert I ordered the pumpkin pie with cream and ice cream, and it was a great way to end the meal.  I would be remiss if I didn't mention that even their french press coffee that was served with dessert was killer!  Walking out of there I couldn't believe that I had gotten a 3 course meal from a Michelin Star restaurant for $25.  There is no better bang for the buck in this city.", "pics": null}}, {"review": {"des": "Our overall experience was excellent.  <br>Service was impeccable and just right.  The drink currant mood was outstanding and she requested it a little sweeter because I asked.  <br>The tempura asparagus was really delicious with the sauce on the side. However, I did note that it was heavily salted and didn't know if it was because my palate was used to the sweetness in the drink.  Then the roasted lamb saddle was just outstanding - perfect texture, perfectly roasted medium as I requested.  However, there was something in the sauce or the tempura snail that was extremely salty again, resulting in my having to have several glasses of water during the meal and all through the night.  There might even have been some MSG, although I am not sure.  I thought I was unnecessarily salt sensitive until I read other reviews and noticed I was not the solo diner to think everything was over salted.  The ingredients were so superb that it was not appropriate to over salt the entrees.  <br>The desserts were superb as always and my coconut sorbet made everything better.", "pics": null}}, {"review": {"des": "BLUF: A New American restaurant that elevates your taste buds, taking you on a culinary adventure to a whole new world of food. <br><br>This contemporary American restaurant has become my new favorite place to eat! When first approaching the establishment, I noticed it had a chic and modern appearance not only on the outside but the inside as well. It had a clean design with simple, yet elegant decorations. The customer service was excellent as the host/hostess greeted us warmly, and our waitresses was attentive to our needs with wine selection and overall food. <br><br>There is an option to partake in a ten course tasting experience; however, we passed on the opportunity this time. We ordered two appetizers (ahi tuna poke, lobster/shrimp pain) and two dishes (lamb, monkfish). All I had to say after each dish was WOW. The pain had a crispy, buttery exterior with a fluffy, rich interior. Each bite kept getting better and better. And the tuna poke was so fresh as the sauce and tiny bacon bits perfectly complemented the fish, not overpowering it. The monkfish tasted so clean as if it was just caught prior to serving, and had a perfect pair with these tiny quinoa falafel balls. Our personal favorite of the night was the lamb. It. Was. Amazing. The lamb just melted in your mouth and had the perfect amount of \"gamey\" flavor that was not overwhelming. The puree and sauce just added to the lamb as you could taste a whole new flavor with sweet, salty, umami all wrapped in one. <br><br>Regardless of the dish, each bite was just another explosion of flavor making the experience just so surreal. This restaurant definitely lives up to its reputation, and I highly recommend coming here if you haven't checked it out. Thank you so much for a great experience here last night! I know I will be back in the future when I come to Chicago again!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2RiPySlHLMHM5yhSYzkNWw/348s.jpg", "caption": "Appetizer: Ahi Tuna Poke"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jqGUrnwCI7bnYoDUF4DY0w/168s.jpg", "caption": "Appetizer: Lobster and Crab Pain"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fFEUq0yfLTm4ZGVIknW5-A/168s.jpg", "caption": "Complimentary Artisan sourdough bread with whipped butter"}]}}, {"review": {"des": "[[ October 2017 10-course tasting menu: $125 ]]<br><br>I only came here because 1. they have a michelin star and 2. I heard this was one of obama's favorite spots and that he came here after winning democratic primaries one year and that he eventually hired one of the chefs here as a private chef in DC.<br><br>The food here is good, but not to a point where I'd highly recommend this place as a go-to when you're in Chicago given the price. But if $125 doesn't sound like too much - definitely go. They're creative with their dishes and the ingredients actually go so well with one another! Here were my personal favorites:<br><br>- daikon + line + caviar: I'd never had nor thought to have caviar and daikon, but am so glad I did<br>- mushroom + sorrel: I had no idea what this was.. it looked like a rectangular cube cake of some sort, but oh my gosh it was savory and delicious. I just want to lay in bed all day and stuff these into my mouth.<br>- pastry balls: soft with somewhat of a mochi texture, again not really sure what I was eating but so good<br><br>Uploaded the pics of everything I ate :)", "pics": null}}, {"review": {"des": "We were lucky to have been seated next to two charming gentlemen from Dallas, celebrating a birthday before heading out to Hamilton. Their good humor, extroverted personalities, and congenial company extended beyond their table to neighboring ones and allowed all of us to connect and be a bit friendlier with strangers.<br><br>As for the food, we were torn, the surprise of a tasting menu or the certainty of à la carte? In the end, there was a number of items on the menu that we really wanted to try so à la carte it was. <br><br>I could have had every appetizer and been very happy:<br><br>The salad of endive served upright in a potato container, ordered a few tables over, with a poached egg perched on top, looked fantastic. <br><br>The lobster meat, served with cubed beets and charred onions was mild tasting and very good.<br><br>The baked foie gras was, in a word, incredible. With a nice crunchy crust and an impossibly buttery interior, the rich taste was nicely paired with the cubed apples and caramelized yogurt.<br><br>And at some point, I need to make it back just for the scallop with fennel and lavender. Fennel! Lavender! The flavor combination is intriguing.<br><br>There was no question that I would have the duck, my favorite type of entrée. However, the beef strip loin with marrow would have come in a close second. How could I go wrong with the duck given the creative and flavorful fennel sausage? I couldn't which was why I was making \"yum, yum\" sounds throughout the meal. The medium-rare duck breast with the nicely seared skin was served with blueberries, marble rye bread, and shallots. So innovative. So good.<br><br>For dessert, I got to not only enjoy the hazelnut tres leches cake with miso ice cream, I also sampled the ice cream flight that my sister ordered. The bourbon-lapsang souchong scoop was smoky and sweet. The mandarin olive oil was intensely fruity.<br><br>Service was smooth and professional.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xTuQG41F1ocOAIRZoHrULQ/348s.jpg", "caption": "Bourbon-lapsang souchong and mandarin orange olive oil ice creams."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OJJidmQOLXnSqHYIAJ8RyA/168s.jpg", "caption": "Hazelnut-encrusted tres leches cake with blackberries and a contrasting miso ice cream. This was another home run."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZqudZ3EWbltc0YVIG5fxVg/168s.jpg", "caption": "Perfectly cooked duck breast with nicely seared skin is complemented by a distinctive fennel sausage, marbled rye, blueberries, and shallot."}]}}, {"review": {"des": "My fiancé and I came to Blackbird for the New Year's Day dinner. It was my second time here and the first experience wasn't great, but today's dinner was amazing. <br><br>Freebie:<br>Bread - I don't like sourdough and I don't like bread with hardshell, but this bread was tasty mysteriously...<br><br>Macarons - the batter was extremely moist and soft. The shell also had some good thickness to it. Filling was savory, but flavor was awesome when combined with the sweet batter.<br><br>Starters:<br>Tempura eggplants - this tempura batter had some spice in it as compared to the traditional tempura batter, so the eggplant is tasty and flavorful without tempura dipping sauce. <br><br>Wagyu beef - beef was super tender. Sauce was light and highlighted the taste of the beef. <br><br>Entrees:<br>Fiancé ordered Beer Cheese Pierogi and loved it. I'm not a fan of pierogi in general, but this one wasn't bad.<br><br>I ordered Potato Wrapped Sturgeon, which turned out way better than I thought. I wanted to have the skate wing, but they ran out of it. Our server then recommended this dish. It was my first time having sturgeon - the fish was flaky and tender. It was de-skinned, but wrapped with very thin potato noodles, which was made a little crispy after probably seared on a pan.<br><br>Dessert:<br>Apple cider donuts - one of my favorite dessert. The plate has green apple cubes, apple chips and something like candied apples slices. <br><br>Interesting dishes with great taste. Hope they will have the skate wing next time.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NOIx_zMjJVGTL9W8Sa0jhg/348s.jpg", "caption": "potato wrapped sturgeon"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qrhTfQIHSmiVOckBfwomIg/168s.jpg", "caption": "beer cheese pierogi"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5bieHpZJMCLsvssvqb_QHQ/168s.jpg", "caption": "apple cider donuts"}]}}, {"review": {"des": "Employees are hustling to get you in and out during weekday lunch. With the 3 course restaurant week meal, we were in and out within an hour! It was appreciated since we had to go back to work but did affect the ambiance of the place as it was really loud and hectic and waiters were speed walking in all directions. <br><br>The food was incredible. Beautifully plated, flavors and textures well-balanced, and all cooked near perfect. Even something that's available in many different restaurants like brussels sprouts or a hanger steak (which was available in like 5-6 other restaurant week menus), blackbird adds an extra element that transforms the dish to something unique. Don't skip dessert here either!<br><br>Lunch is a great opportunity to get a taste of the magic. Will be awaiting my return to try the 10 course dinner!", "pics": null}}, {"review": {"des": "Overall: 4.5/5<br>Group of 8 of us made a reservation Friday around noon. We arrived and were promptly seated.<br><br>Value: 4/5. I got the prixe fixe lunch for $25. For a Michelin starred restaurant, that's a pretty good deal for a 3 course meal. Now, granted, the portions were extremely small (the main course, chicken confit was like 2/3 of a chicken leg) but it was very rich in flavor and I guess when you come to places like these you are looking for quality over quantity.<br><br>Taste: 4.5/5. The Brussel sprouts were amazing. What a nice explosion of flavor. The chicken confit was about as good as I can imagine chicken being cooked to, although I really would have liked more meat there. For dessert, the chocolate pudding cake was decently good. I also tried the Blackbird cheese which is literally cheese with some crackers stacked on top and bits of apricot. I found the cheese a little strange-tasting since it was a little sour/bitter, but I am guessing this is probably more of an acquired taste. To each his/her own.<br><br>Service: 4.8/5. They take care to serve everyone at the table at once. It is a pretty amazing sight to see like five people surround your table with all the plates and they are all placed at the same time.<br><br>Ambience: 4.5/5. Classy environment. I thought the paper on top of the table cloth was a little weird--usually you only do that when you want kids to draw on the table..? But the glass ware was cool, plating was artsy. The restaurant is not very big but it had a nice bustling vibe to it.<br><br>Conclusion: This is a place I would go for special occasions, not so much for a craving but the experience of the flavor that is densely packed into each small dish. I can definitely see that Michelin star.", "pics": null}}, {"review": {"des": "This place is hands down, AMAZING! The flavoring, decor, ambiance, service, and everything was just top notch. I've never noticed this restaurant since it's so low key hidden but getting a chance to experience restaurant week allowed me to take check it out. I tried to make reservations on open table but it was booked but it was good that we got there early because there was a sections for walk ins at the bar. <br>Stopped by with a friend and we almost got things different from one another so was able try out a piece of something different. All the flavorings were there and it just compliments each other so well. I didn't want to get the chicken because I saw an ingredient I didn't like but when I tried it from my friend, I didn't expect it to taste so good. But the hanger steak was really good as well. It was like a party in my mouth and I really recommend this place!! <br><br>Side note: try to make reservations if you can so you won't have to wait long - I didn't have to because I went early but just a tip", "pics": null}}, {"review": {"des": "The lunch prixe fixe (and they actually pronounce the word correctly here -- \"pree feeks\") is a wonderful deal! Getting to eat at a Michelin restaurant for $50 for two people is amazing. <br><br>My husband and I ordered different dishes so that we could sample more of the menu. Everything was good especially dessert, however, the duck confit fell a bit short in terms of being an interesting/creative dish, and the duck was kind of dry. <br><br>If you don't want to shell out hundreds for dinner, I totally recommend coming here for lunch. It's a great value!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VxtamGodXceZHWQOIwDc5Q/168s.jpg", "caption": "Duck Confit"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MPFy1qhPEZkkIC4HW1XGFA/168s.jpg", "caption": "Warm shrimp salad"}]}}, {"review": {"des": "Amazing meal   Asked for the chefs choice on meal and app.  He sent tuna ahi and a steak with kielbasa <br>I had an excellent interaction with other diners and a wonderful Ambiance. Would highly recommend", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RI9dnO7osI9SJRBDAF14fg/168s.jpg", "caption": "Spectacular meal asked for chefs best and he didn't disappoint amazing tuna and steak"}]}}, {"review": {"des": "I came here for dinner with a friend on a Sunday night and the restaurant was empty. So if you are having trouble getting a reservation, Sunday is definitely the day to go. <br><br>We decided to just order a la carte instead of the tasting menu. The menu is pretty limited for vegetarians but the things I ordered were definitely worth it. <br><br>We started with bread and amuse bouche. The bread  was great as was the butter, pretty standard stuff. The Amuse bouche was phenomenal. It was nutty and a little black bean like cake. The sauce or foam or whatever was under it (see picture) was amazing. I hated how they took the plate away before I could clean off the foam because it was delightful. We also got the cheese plate, which I enjoyed. The jams that came with the plate were to die for. To be honest, I love all kinds of cheese so the cheese selection they offered us didn't mean a whole lot to me, but those jams and spreads were great. <br><br>For the appetizer, we split the tempura eggplant. For someone not super into tempura, I really enjoyed it. It was bready and hearty and which is nice especially when you are at a Michelin starred restaurant. For the main course, I got the beer and cheese pirogies. Not a lot of vegetarian decision-making, but once again, it was nice to see elevated hearty food. I loved the whole dish and the mustard seeds were a nice addition. <br><br>For dessert, I had the apple cider donuts which was to die for. I don't think it is possible for apple dough balls covered in sugar to be bad, but the whole dessert was great. Also great ice cream even though it was freezing outside. <br><br>All in all, I really enjoyed the food. I am just scared there is nothing on the menu left for me to eat. I wouldn't be opposed to eating anything I had again (especially the Apple Cider donuts) but I am all about trying something new and I don't think I can come back until the menu rotates again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/u4hfQGLUvWhRNxu5EgzgfQ/168s.jpg", "caption": "Beer and Cheese Pierogies"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dC2kGfnUDMbtm1knjPqWhw/168s.jpg", "caption": "Amuse Bouche A nutty cake with a white foam thing on the bottom."}]}}, {"review": {"des": "From the cocktails to the service to the food, every detail was amazing. Cocktail wise, I recommend the Scorpion Honey. The mixture of tequila and cocktail bitters is very unique.  <br><br>Started the meal with two appetizers, the scallops with the pork rinds and the wagyu beef. The pork rinds added a good crunch to the flavorful scallops. The wagyu beef was soft and melted in your mouth<br><br>I tried the Sturgeon, which went perfectly with the Pinot Gris. The duck breast was cooked perfectly. <br><br>The flourless chocolate bar was a great end to the meal. It came with a white chocolate ice cream, that was very creamy. I definitely left with a food coma!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nOeqCsZ6Lut1EVdGFcVV2g/348s.jpg", "caption": "Rohan Duck Breast"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zC1yjsfGTYhHvNQsqj2sgg/168s.jpg", "caption": "Sturgeon with Gnocchi"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-EqkrXKESQgp9wQmd1ct7g/168s.jpg", "caption": "Flourless Chocolate Bar"}]}}, {"review": {"des": "If Michelin stars are given for slooowww dining, give Blackbird another for its lunch prix fixe.<br><br>Was seated promptly for a lunch prix fixe, which featured samples of favorites such as the warm shrimp salad vs cold tomato soup as well as the duck confit vs hanger steak.  And that's where things went weird.  Lunch was served on Parisian time; not sure how three courses could stretch 75 minutes from menu to bill for a 12:30 lunch service, but delays seemed evenly distributed between courses as well as waiting for the bill.<br><br>Flavors themselves were good but not life changing and generally at a level one step down from than Girl and the Goat and one step up from Harry Caray's.  Gramercy Tavern this is not.  The shrimp was the better first course, with the delicate seafood taste benefiting from the lime-based sauce.  Entrees were alarmingly small (six bites' worth each), with the hanger steak plate evoking a disguised kebab gussied up with sauces and pastes.<br><br>For the first time in Chicago, I left lunch hungry - both because of small portion sizes as well as the interminable duration of the lunch service.  But for $25, it seems you get what you pay for.<br><br>Next time, try the burger.  Not only does it look good, getting a single entree will avoid the death-by-papercuts system of getting multi-course meals to the table.", "pics": null}}, {"review": {"des": "My friend got us a reservation at Blackbird on a snowy Thursday night. I intentionally did zero research beforehand, since I wanted the whole experience to be a surprise. We were seated immediately in the quiet, deliciously modern dining room. The pre-fixe looked delicious, but my friend was feeling a little sick and couldn't handle the full two-and-a-half hour experience. We ordered the wagyu beef, rohan duck breast, and venison sausage for our main course.<br><br>The first to come out was some bread with the best butter spread I've had in a long time. It was a little sweet, luxuriously creamy, and had maybe a little cinnamon in it too? The bread itself was okay, but the butter stole the show here.<br><br>Around this time my cocktail, the Dark Star, arrived. It reminded me of an old fashioned, but it didn't bite like they normally do. The vermouth mellowed out the booziness and the mezcal added a bit of a smoky flavor that complemented the faint taste of the apple bitters well. And at only $13, it was reasonably priced too.<br><br>Soon after came an appetizer I don't recognize at all. I didn't quite catch what the waiter said it was, but it was about the size and color of a banana slice and had a totally unique taste I couldn't come close to placing. I'd definitely have more if I had the opportunity though!<br><br>Next up was the wagyu. Oh my God. Best beef I've ever had. It was warm, unbelievably tender, bursting with umami, and went perfectly with the onion sauce with which it was served. I could eat this for every meal and be totally happy, it was that good. I can't recommend it highly enough!<br><br>It was soon followed up by the duck breast. It was pretty good, but I was a little underwhelmed since it directly followed the wagyu. The meat didn't have a strong taste, and the broccoli puree wasn't my favorite texture.<br><br>The final savory dish of the evening, the venison sausage, rounded things out. The meat was solid, and I really liked the quince pairing, but it wasn't quite up to what I expected given the price.<br><br>In a manner quite unlike me, I decided to order dessert. I got the milk chocolate chestnut tart and it was a solid plan on my part. The tart itself was good 'n' chocolatey, but did so without being overbearing. I couldn't taste much chestnut, but I'll admit I'm not super familiar with the taste anyway. The ice cream it came with was incredible! Very creamy, and not overly sweet so as to avoid overshadowing the tart. I also got a second cocktail (whose name I cannot remember and isn't on the online menu), which arrived at around the same time, and it was overall kinda forgettable. It did have some creme de menthe, though, which went well with the tart.<br><br>Right before the check a pair of homemade candies came out, an apple cider gumdrop and a chewy chocolate. The chocolate was okay, but the apple cider sweet was excellent, by far the softest and tastiest gummy candy I've had.<br><br>The plating was impeccable across the board, as was the service. Everything came out quickly, coat check went through without a hitch, and the waiter was knowledgeable. The sharp, clean interior perfectly rounded out the overall presentation.<br><br>On the whole, I had a good experience at Blackbird. Presentation was excellent, the price was reasonable ($84 + tip for each of us, I was expecting much more), and some of the food was fantastic. What wasn't incredible was merely okay, but the strong points outweigh the weaknesses and I'd be happy to return next year when I'm in the area again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TIMma1Q-udgK0IOg8szP8Q/348s.jpg", "caption": "Candy -- the apple cider on the right was amazing!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XlOAzsaP7uLKx0nNpnIyuQ/168s.jpg", "caption": "Milk Chocolate Chestnut Tart"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IZgfmSHfmhHCkGUrXnovZA/168s.jpg", "caption": "Duck"}]}}, {"review": {"des": "This review is for their restaurant week lunch offering.<br><br>Tried the shrimp salad, the hanger steak and the chocolate pudding cake. This meal was an unbelievable value for the service and food options. I would definitely be coming back given how close it is to my work in the West Loop.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Rt8scfnmvorKOm0lyhABIw/168s.jpg", "caption": "Hanger Steak"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eOPrvi2u0Z96Y8a03JvMGw/168s.jpg", "caption": "Warm shrimp salad"}]}}, {"review": {"des": "Words can not express how delicious the meal prepared here was. Blackbird is everything you're looking for from intimate upscale real dining experience. The service was outstanding. We enjoyed the 10 course tasting menu. Every dish was executed and described as served. The flavors in all dishes served from beginning to end were so well thought out. A wine paring was offered that we did not partake in however I did enjoy a very well made Manhattan!", "pics": null}}, {"review": {"des": "I really, really love this establishment. It is by far one of my favorite places to eat in the West Loop. <br><br>The atmosphere is chill, and you don't get the pretentious feeling like you do in a lot of Michelin Starred restaurants. Everyone is friendly, approachable, and they seem to attract that very same kind of clientele. The restaurant is beautiful, but you don't get the vibe that they are too good for everyone just because there are a ton of James Beard awards hanging in the hallway, or a coveted Michelin Star. I love this about Blackbird!<br><br>The bar has some interesting cocktails to try, and I have yet to be disappointed by any of their choices. They also have a great wine list and whiskey selection, if you prefer to go that route. <br><br>I have a lot of food allergies, which at times can make dining out not very fun. The staff is always very well prepared in advance for my dietary restrictions, and are able to tell me every ingredient that is in a menu item. If it's possible to eliminate an ingredient that I'm not able to have, they make it happen. 10 stars for this! <br><br>Something you must know is that if you ask questions about a menu item, you will get a wonderful story about the flavors in the particular dish. Once you hear the story, you'll have to order -- and trust me, it will taste even better than the description.", "pics": null}}, {"review": {"des": "I was actually pleasantly surprised by Blackbird after hearing so many of my friend's mixed reviews about this restaurant. My friend and I ate here for dinner and we both got the tasting menu. Overall, the food was pretty good although there were a couple of dishes that I was not a fan of. My favorite dish of the night would have to be the dessert. The champagne ice with pear and yuzu was wonderfully refreshing at the end of the meal. In addition, it was presented as one of those fun, interactive desserts that you got to crack with your spoon!<br><br>It seems that people's opinions of Blackbird vary heavily with the menu (that makes sense, too). The price is actually quite reasonable for a 10-course tasting menu. If you are reading this review, I would recommend checking out Blackbird for their current menu.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dOw47rklIC-ok__GALS8bw/348s.jpg", "caption": "Cracked :)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nXjCL04CztjcN-3-4iEdSg/168s.jpg", "caption": "Best dessert! Refreshing pear and yuzu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/A7sx883303m7hs9oUNN-4g/168s.jpg", "caption": "Chocolate parfait with sweet potatoes-interesting texture"}]}}, {"review": {"des": "We did the 10 course tasting for $125 and I highly recommend.  The dishes were perfectly timed and also sized so you didn't feel stuffed at the end. We did not do the wine pairing but asked the waiter to help us pick a few glasses and i enjoyed both his recommendations. <br><br>Dish 1 Blue crab with warmed almond milk and kaffir lime leaf<br><br>Dish 2 Crispy Jerusalem artichoke with cider and miso<br><br> Dish 3Lightly grilled venison tartare and sea scallop with a shellfish<br> <br>Dish 4 Himalayan cordycep mushrooms and seaweeds dressed with sesame and rice <br><br>Dish 5 Amish chicken steamed in parchment au jus seasoned with black rice vinegar<br><br>Dish 6 Wagyu beef miso-yaki with lobster, radishes, and a kombu mayonnaise<br><br>Dish 7 Clarified game broth with a macaroon of dark chocolate and chestnut<br><br>Dish 8 Roasted venison loin and sausage with barley cooked in coffee and late winter<br><br>Dish 9Brillat Savarin filled arpege egg layered with dried fruit compote and<br><br>Dish 10 Frozen arauca chocolate parfait with sweet potatoes and pickled<br><br>Poached pears with yuzu custard and champagne granité", "pics": null}}, {"review": {"des": "Oct 13th 2018: From the very beginning we were taken care of by staff as if we were royalty. There was no stuffy pretense and I felt as if each of the staff actually felt ownership of my experience!<br><br>The Chef's Tasting menu was fantastic! I sat at the edge of the kitchen prep area so I could witness this show firsthand. Watching them work was like watching an artist bring a fantastic canvas to life!  The serving dishes were unique and purposeful for every plating. <br>Chef de Cuisine Ryan Pfeiffer was on point.<br>The items were painstakingly displayed with elegance.<br>All 10 items on the tasting menu had a unique flavor, and each dish was designed to be multilayered in flavor. The smell of each dish was remarkably subtle, yet the flavor combinations of sweet with savory, pungent flavors slightly dancing over the more subtle flavors in the crab; loved the robust earthy shiitake and crisp sweet pop of grapes with a subtle garlic finishing note from the garlic flowers. And who would have known that a tomato sorbeto could be so enjoyable with a slight sweetness but full-bodied tomato flavor and without a hint of acidity. <br>This meal was pure art, from the plating to the multiple layered hues and tones of flavor in each bite.", "pics": null}}, {"review": {"des": "I was recommended this place from a friend. We ended up doing the 10 course tasting menu. Omg every course was delicious. Andrew who served us was the best he was so knowledgeable. I can't say how much he took care of us and the food <br>Best food", "pics": null}}, {"review": {"des": "I have not been to Blackbird in several years. It has always been positive. I had some foodie friends in town over Labor Day weekend, so I suggested we meet there for lunch. There were 4 of us and we shared most dishes. A couple of us ordered from the prix fixe lunch menu and our table had several dishes off the main menu as well. All of the food was incredible! Lunch portions were perfect size and athe presentation for each dish was beautiful too!<br><br>Our server for lunch that day was Andrew L. He was friendly, knowledgeable, attentive and full of good suggestions from all areas of the menu, including cocktails. It was impressive and made the entire experience even better! I will surely be back again soon and I will definately request him to wait on us again!<br><br>Thanks, Blackbird!", "pics": null}}, {"review": {"des": "This meal has slowly become the butt of all of our jokes recently it was so ridiculous. It was my birthday and I had 3 friends in town, and we wanted to do the tasting menu. So I called, and told the person on the phone our allergies (one in our group is allergic to fish and chicken). The person on the phone told us that would be fine, and the person with the allergies would have a separate menu. <br><br>So we get there, and the waitress comes up to us to greet us and says word for word \"Hello! so I hear there's someone here with a fish and chicken allergy, correct\"? And we all say \"yes thank you!\". She then says \"Oh, well it looks like you didn't let us know about this so I'm sorry but we can't accomodate\".<br><br>Now, if you're reading that correctly, she literally came up to our table, TOLD US about the allergies, and THEN told us how we didn't let them know. I said \"ok well how did you know that if we didn't tell you?\". She was kind of confused at that question. So we talked to the manager. <br><br>Then the manager (who was nice) came back and told us that the chef would be happy to prepare something for us and made a very big deal about them doing us a \"favor\". Although the thing is, we prepped them for this allergy situation a week ago. So really, no favor there, just covering up your mistake. <br><br>Then the manager comes back and tells us we will ALL be getting the chickenless/fishless dish even though we were told that the allergy girl would just have her own dinner. <br><br>We got the dinner and lots of the things they served us were just some of the other random stuff on the regular menu. Which if we had known that's what we were gonna be served, we could of just ordered 10 a la carte dishes and split them. <br><br>Besides that, the waitress was ... odd... Not unfriendly, but definitely not a people person. Almost like a weird smiling robot. Maybe she was just trying really hard not to tell us to go screw ourselves and our allergies, but hey...we literally told you a week ago when you specifically asked if we had any. Soooo, I'm gonna go ahead and mark this under \"not our fault\". <br><br>Not to mention we got the WORST table in the restaurant (about 6 inches from the door). <br><br>Let me also be clear, if this wasn't a \"fancy\" restaurant and we weren't spending 125 per tasting menu plus rounds of drinks, I would not of even taken the time to write anything like this. But hey, the expectations are set when you have a 10 course tasting menu and you're known as one of the best restaurants in Chicago. <br><br>Silver lining - food was pretty good but it was hard to enjoy with the door swinging open every minute on a 100 degree day<br><br>Moral of the story - never going to dinner with anyone with an allergy again (or to blackbird).", "pics": null}}, {"review": {"des": "I would rate this place up to a 3.5 stars overall for the atmosphere. The service was great. We also got complimentary dessert at the end. <br><br>But for how much our appetizers and entrees cost, I wasn't blown away by this place. I came with 3 other friends for dinner and we each got an entree that we split 4 ways (The staff was very accommodating and brought out extra plates so we could do this). We got the duck, clam tortellini, roasted lamb and beef strip loin. The duck was definitely the best of the four. For the appetizers, we got a cheese plate (Our server did a great job introducing us to all the options. The cheeses we chose were very creamy and was definitely the highlight of our meal paired with a good Bordeaux.) We also got the ahi tuna poke, and shrimp and lobster. We didn't leave raving about the food but it was a good, albeit overpriced, space to catch up with friends.", "pics": null}}, {"review": {"des": "Yummy prix fixe menu food for lunch $25.00 for three courses <br>The appetizers warm shrimp salads and celeriacvelouté, the entrees duckconfit and hangersteak are all delicious. <br>The desserts of the prix fixe menu is just so so. Not as good as the appetizers and entrees.<br>The service is good. All servers are friendly and checked several times to check whether you need help or not.<br>One thing I do not like is that the space is really narrow.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iRTPhnFgNhYf54PXoQXYEA/348s.jpg", "caption": "Bread with butter"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_MA3jAhMmHZvbykwqLc1-Q/168s.jpg", "caption": "#celeriac #chestnut"}]}}, {"review": {"des": "Updated- we did this tasting menu and it was AWESOME! We're comparing this to TFL in Yountville and it was so good. The food was delicious and rich and flavorful. The wine pairing is a must. We did this experience for my birthday and it was incredibly worth it. The staff was attentive and the food delicious. Thanks for the experience and we will be back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_s31A-hHOt5P7d0ulDij9A/168s.jpg", "caption": "Lobster"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/w2Xpi0ETIpwcKHoTHbn11w/168s.jpg", "caption": "Half eaten halibut- that good!"}]}}, {"review": {"des": "Blackbird...FLY!<br>First time back in a while, not sure why. I had the pleasure of attending a wine dinner here, upstairs in their private room. It was one of a series of events planned for the year celebrating 20 years in business. If the others are half as well executed as last nights, they should be around for easily another 20. <br>Pairings were spot on, service was kind, knowledgeable and professional. The meal got better with each course and the first course of scallops & peas was off the hook and served with a new to me wine varietal called Sylvaner. Both were delicious. Thank you Blackbird for exceeding expectations, educating, providing a wonderful experience and making it all so chill. <br>Bravo!!", "pics": null}}, {"review": {"des": "I had done the $25 prefixe 3 course lunch menu. As a major foodie this is a must place to eat. They have a michelin star but do not have a pretentious vibe. This was most appealing to me because I had come into town from out of state with a friend and the ambience was amazing. The staff was very friendly and accommodating. Always checking and filling our waters. Lol! We easily were able to get a table during the lunch rush. Do make reservations if you can. From the bread to the dishes all the food was delicious. FYI the butter for the bread was amazing! So smooth and creamy as there was an added flavor to your normal butter. For the appetizer, I had gotten the shrimp salad which was a great idea as the shrimp was super tender. It wasn't hard and chewy but the sauce it was drenched it was a great tart compliment. My friend got the parsnip veloute. It was smooth and flavorful with lots of brown butter. It was perfect for a cold Chicago day. As for the entree I, had gotten the hangar steak which was tender and paired with a light and foamy citrus creek fraiche. The portion was also the perfect size for lunch but enough to fill you. My friend got the roasted white fish which had the mussels. Also a very delicious dish with chunks of potato around it. Lastly, GET THE GREEN TEA TIRAMISU! Green tea just cures all and each layer had the right level of sweetness. <br><br>Overall I would say this was a great and inexpensive place to eat. I would definitely come back again when in Chicago during Lunch as it's the best deal. It wasn't too loud and the time I went, there were many young professionals. Looks like a place you can take your boss out to lunch. :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mRDvHG8C1BCP-aWJptBGBQ/348s.jpg", "caption": "Hanger Steak. Citrus creme fraiche, sofrito, sweet onion."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OAp46csvu-SzKOV99EqF3Q/168s.jpg", "caption": "Matcha tiramisu. GET THIS ONE!! Green tea always!!"}]}}, {"review": {"des": "The food at Blackbird was delicious but im giving them 4 out of 5 stars for the lack of vegetarian options, what kinda place doesn't have a soup or cant make up something if you are truly preparing fresh meals ????<br><br>Bouse Amuse - sun choke 5/5<br><br>Mushroom Appetizer - 3/5<br><br>Pirogis 4.5/5<br><br>Chocolate Bar - 5/5<br><br>Sesame desert - 5/5<br><br>Service was attentive and it was a busy evening", "pics": null}}, {"review": {"des": "The prix fixe lunch is a great way to try out this restaurant. The complimentary bread and butter was super yummy. Between my fiance and I, we had the crispy brussels sprouts, warm shrimp salad, roasted whitefish, hanger steak, little blackbird cheese and the chocolate pudding cake. My favorite was the roasted whitefish with potato, gnocchi parisienne and mussel. The fish was tender and delicate and it contrasted well against the thin potato strings. I would pass on the brussels sprouts since the flavor and texture were predictable. The dessert options at the time weren't that appealing to either of us, unfortunately. Nonetheless, the quality is top notch and you can't beat the variety and price of their prix fixe lunch.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Y4O6fEsNFVyAhVgOU5LYAQ/348s.jpg", "caption": "Chocolate pudding cake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3Ni0dt5kEYDHPmpzPVp7Ng/168s.jpg", "caption": "Little blackbird cheese"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bAqprouhO6Xu5EBXlCJlIg/168s.jpg", "caption": "Roasted whitefish"}]}}, {"review": {"des": "I mean for the amount of money I spent here ($600 for 4 people) I wasn't blown away. We pretty much ordered everything on the menu except for some salads and tried it all.<br><br>Nothing blew me away, everything was good, but at the same time everything was gone in 1 bite by 4 people, so I really only got to try most things once. So yea it tasted great. The portions are so small though its hard to really judge.<br><br>I guess what did stand out is the cheese platter, that was awesome, and definitely recommend getting that here.<br><br>The lamb was amazing, melt in your mouth. But the monkfish tasted suppperrr salty. I had one bite and had to immediately wash it down with some water and cocktail, something funky was up with it, but maybe thats just how monkfish is. <br><br>Cocktails were super tasty and refreshing, perfect for drinking outside on a nice 75 degree night. <br><br>Obviously if this food was at a normal restaurant I would be giving it 5 stars. But when I come to Blackbird and drop $600, I'm expecting to be blown away. Service was 5/5 as well, nothing bad there. Part of me just wishes I saved the money and went to Next. Part me is glad I tried it. I would go back, maybe just for cocktails though and eat dinner somewhere else, somewhere where I don't need to go home and eat a bowl of cereal to fill me up after dropping a couple hundred for a meal.", "pics": null}}, {"review": {"des": "Honest review: theres rarely a restaurant that wows me with flavor everything was amaizin n different some things were better then others but u will really be blown away with the complexity my only issues are too fix some dishes n make the desserts a lil better  Service was amaizin supper attentive knew the menu n described items n was amaizin only thing though the bus boys were arguing with servers about receiving more tip money it was awk<br>Best things: scallop/sable/lamb/ duck/ pot de creme<br><br>Scallop 18$ this was the best scallop dish i ever had. The mayo adds a richness the broth is hot n everything is cold n its really flavorful n a lil spicy so there is a play on temperatures the corn adds sweetness n the seaweed adds a briny taste to cut through the richness best dish of the nite<br><br>Ahi tuna 22$ i usually dont like ceviches but this was really flavorful the bacon added a perfect rich salty smokey note that made the tuna decadent. The english peas and avocado adds freshness to cut through the richness my only complaint wish there was something acidic n spicy to cut through the richness<br><br>Glazed pork belly 17$ best pork belly texture ever it melted like butter its a really rich and flavorful dish roe adds a briney flavor to cut through the richness the ginger was a nice touch added some heat n funk to cut through the richness only issue there was way to much like dial it back 10 notches n it would be the best dish worst appetizer of the nite cause of ginger issue but still awesome dish<br><br>Cheese plate 20$ how it works is 1 is 8 bucks 3 is 20 6 is 40 n depending on what cheese u pick is what accompaniment u get. Theres like 10 different cheeses to choose from the accompaniments were great but the bread was pretty basic not oiled or like good bread or even crunchy naha still has the best cheese plate <br><br>Sable fish 40$ best dish of the nite the presentations odd everything is covered with alot of greenery its like a fish salad. The sauce is amaizin supper rich the fish was cooked perfectly melts in ur mouth n then theres fried sable that adds great texture n flavor to the dish the greens add a great bitteness to cut through the richness<br><br>Lamb saddle 39$ this was amaizin lamb was supper tender the aioli adds great richness n the sausage adds a great salty flavor the blueberries add sweetness to cut through the sweetness n the leaks add a great sweet onion flavor the croutons are amaizin<br><br>Aged rohan duck $40 be warned they said that duck is served here without crispy skin so i asked them to make it supper crispy i would recommend u do the same. I didnt think the lavender was gonna work because i hate lavender but i loved this dish its supper rich with acidic components to cut through the richness the mashed potatoes were to die for<br><br>Grilled slagel farms striploin 43$ worst dish of the nite i did not like this at all the flavors didnt work together at all the sauce was bland didnt really add anyhting n the crab wasnt dressed or anything so it just didnt go with the steak needs revamping coming from a person who loves sweet n savory<br><br>Sour dough Pot de creme 12$ best dessert of the nite its not to sweet n the flavors work perfectly together the pot de creme was the perfect texture <br><br>Mi amere chocolate torte 12$ second favorite dessert i hate dark chocolate but this was amaizim the olives added a great salty briney taste to cut through the sweetness the cherries added an acidic component to cut through the sweetness <br><br>Angel food cake 12$ tastes like fruity pebbles i didnt like this cake was dry n there wasnt enough candied fennel wasnt anything special <br><br>Tonka bean churrro 12 good but not great the churros were undercooked flavors worked well just expecting more<br><br>Chocolate pistachio icecream bar 12$ i really liked this wasnt to sweet n all the flavors complimented each other loved the crunchy rice<br><br>Bread service: i loved the bread it was a soughdough really flavorful the problem was the Honey mustard butter didnt pair well with it add more honey", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ryy8Wo--0kzyE65zmlt3xg/348s.jpg", "caption": "Butter"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gXm_8USuMKD3ZbVI3RSzbg/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/e33sG3ypgi6lGR7cDtrdCQ/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "I always wanted to go here, coz it looks so good from the outside. The ambience, the decor, the whole feel of this place is good. I went here with some of my office friends for a weekday lunch. We were feeling a little fancy ;).<br><br>The service I thought was very slow, it took more than 45 minutes for our food to arrive. Two of my friends ordered the 3 course meal, and two of us ordered starters and main course. The food tasted okay, nothing exciting and I did not feel satisfied after eating it. The ambience was good but the food, price and service were not enjoyable.", "pics": null}}, {"review": {"des": "Blackbird is one of the best meals I've had in Chicago. Not only is the food thoughtful and well executed, but also the service is impeccable. Rarely do I have a meal where I can describe every course as amazing. <br><br>We started with the ahi tuna, which was probably the best raw tuna dish I've ever had. The lamb bacon and peas paired with the tuna is so unique and tasty. The cheese plate alone is worth coming here for. They brought out a selection of 10-12 cheeses, described all of them in depth and allowed us to choose what we wanted. When the cheeses were served, the board was perfectly plated with great additions such as marcona almonds, honey, quince paste, etc. We ended with the lamb, which was perfectly cooked and paired with delicious sausage and blueberries. I highly recommend Blackbird. They also have a nice outdoor seating space on the sidewalk.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/57xvk8Bs-EupDWezsACh2w/168s.jpg", "caption": "Ahi tuna"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/83cJQm16KsFMmbTxqVQaWA/168s.jpg", "caption": "Amazing cheese plate and ahi tuna"}]}}, {"review": {"des": "Came in for the lunch pre-fixe. Really enjoyed all the food I had - I'd recommend the shrimp as an appetizer. The beef was really flavorful as an entree and the hazelnut dessert was really creamy and rich. The service was really great too!", "pics": null}}, {"review": {"des": "We came here for our 4th wedding anniversary dinner. My wife surprised me and we sat at the bar for dinner which was great.  The bartenders were very attentive and the staff that brought out our food were also amazing.  First, they immediately wished us a happy anniversary the minute we sat down and gave us complimentary glasses of champagne.  Then they included a couple complimentary food items throughout our meal which were great surprises.  I'm not sure we got these things because we were having our meal at the bar and just more easily accessible to do this for, but it was definitely such an awesome experience. We will be coming back for sure and sitting at the bar again.  Thanks to Blackbird for making our anniversary than much more special!", "pics": null}}, {"review": {"des": "$25 prix fixe lunch is a bargain. Good service and great.<br><br>The Shrimp confit and white fish tempura were excellent. The beef pave and braised red cabbage were good but a tad too salty. The two desserts were good too. The chocolate hazelnut cremeux was smooth and rich.<br><br>Overall, it was a nice meal.", "pics": null}}, {"review": {"des": "\"Blackbird fly, Into the light of the dark black night.\"<br><br>Blackbird has flown straight to my top 5 favorite restaurants in Chicago and just writing this review is long overdue and has me currently sitting in a state of euphoria reminiscing about my dining experience here. <br><br>It is a downright shame [not really] how emotional I get in response to an absolutely delicious meal. Perfectly prepared dishes, mixed with a beautiful scene, completed by A+ customer service...Blackbird has it all and it is no wonder how/why they have been lauded with accolades and awards.<br><br>I visited Blackbird on my lunch hour during the week. The restaurant was not as busy as I anticipated (more than likely due to the time of day I opted for the meal) and consequently, I was able to talk more with the staff - whom all seemed genuinely happy to be employed at Blackbird. A 3-course lunch prix fixe menu was certainly what I needed that day, and for $25...honestly there is no better deal in the city for this quality and caliber of food.<br><br>I opted for the warm shrimp salad, the cod, and the deconstructed raspberry cheesecake. I even ordered the angel food cake dessert a la carte because after my 3 courses (and the complimentary piece of bread), I was simply not ready for my experience at Blackbird to end.<br><br>Although the portion sizes here are, in fact, on the tinier side, this was to be expected considering the restaurant is known for its tasting menu approach to food. Nevertheless, starting the meal with the bread kicked my \"fullness\" into gear, and each of the desserts contributed to the completion of my appetite also. <br><br>Flavor-wise, Blackbird delivered strongly. The warm shrimp salad was every bit of savory, acidic, tart, crunchy, and chewy all at once. The cod was lightly fried, with a fresh, oceanic flavor in each bite. The fish itself was every bit as fleshy as I would have hoped for. The cherry and mustard greens that accompanied the dish added the sweet/sour juxtaposition needed for the heaviness of the fried fish. <br><br>Both desserts blew me away. There is nothing better than consuming fresh fruits that are in season and raspberries are full hype currently. Unbeknownst to me initially, both desserts featured the raspberry. The cheesecake was deconstructed and resembled more of a parfait. It was sweet, yet tart, creamy but not heavy as a traditional NY style cheesecake. The angel food cake was absolutely beautifully plated and executed. The cake was light and moist as it shouldve been - and the white chocolate bits added an amazing chewy bite that was certainly well played as it stood against the sorbet and cake.<br><br>This was an all around superb meal and I can't imagine another restaurant in Chicago that is offering a better lunch.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Q_s94jevyC5HRjDr33mIaA/348s.jpg", "caption": "tablescape"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uahPAsaY5Of3N7nVC81kRA/168s.jpg", "caption": "views"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UiVXHhSyp4sCOQLWv7MKhA/168s.jpg", "caption": "stunning"}]}}, {"review": {"des": "Such a great meal for a great price.  Honestly the first course in the $25 prix fix lunch was not the best but the steak and the fish entrees were so good they made me forgot about the first course.  Then the raspberry chocolate bar dessert was the best thing ever.  Our waiter was great.  It was a little slow but we weren't in a rush.  Can't wait to go back to dinner one night.  <br><br>Thank you!!!", "pics": null}}, {"review": {"des": "I was excited to visit Blackbird. The positive reviews and the somewhat high prices lifted my expectations. <br><br>The interior is great, the staff is friendly, and the atmosphere was great. That having been said, the most important thing, the food, tasted well below it's price. <br><br>Though everything was well presented, I was very disappointed with the quality of our meal and the desert. Dry, underdone, and did not taste fresh. This goes for both the meal and the desert. I am by no means a food critic, but can tell when food is past it's date. The desert was extremely disappointing, raspberries were fresh, but everything else was dry and tasteless. <br><br>It might have been bad luck, but was disappointed overall nevertheless.<br><br>Again, I like to praise the staff for being friendly and accommodating.", "pics": null}}, {"review": {"des": "Came for the Express lunch that I saw advertised in my bill portfolio when I was last at avec. Just. Wow. Everything was executed to perfection, from the moment we were seated to the amazing Blackbird cheese dessert at the end (the experience of receiving a bill and paying for it was very meh). Shout out to the Chestnut mole hanger steak which had the most interesting chocolate-beef combo taste. Seriously must come back again and again and again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ofwrOlCyrDQW4D8j9-umAg/348s.jpg", "caption": "Great ambience offering an awesome Express Lunch"}]}}, {"review": {"des": "Blackbird was my first Michelin starred experience in my life and I'm glad it was. Even though the restaurant does only have one star, it looked really lives up to it's expectations. <br>They have a fixed price lunch deal for $25 that includes three courses. Me and my friend tried to get different place for every course and that would be able to try more plates. I was mesmerized just about how good everything we tried was; starting from the appetizers and all the way to the desserts. <br>I personally fell in love with the sturgeon. The way it was complemented by the strength of the mustard, the bitterness of the sorrey, the crunchiness if the nuts, and the sweetness of the berry sauce was absolutely astonishing. Every single bite of that entree provoked an explosion in my mouth. <br><br>Since that day, I promised myself I would dedicate more time to try either Bib Gourmand or Michelin star restaurants in the city. They are granted with such on her because of a reason worth tasting.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fVrIw1exxVnnOHK35EHbrA/348s.jpg", "caption": "Chocolate ice cream, brownie, and berry dessert"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RZIw6n4xyHEmBgvjraEVCA/168s.jpg", "caption": "Hanger Steak"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GNBsFctKnCeSBloQRPUr3g/168s.jpg", "caption": "Wood - Grilled Sturgeon"}]}}, {"review": {"des": "Amazing!<br><br>I went to Blackbird for lunch on Wednesday and we just had an amazing experience! The restaurant itself reminds me of slick blank canvas. <br><br>Since it's restaurant week we tried the prefixed menu,  I ordered the warm shrimp salad and it was just amazing the shrimp was vary soft, tasty and with a nice texture. For my entree I got the hanger steak again the texture was exquisite, delicious, and easy to cut. For dessert I got the passion fruit lavender again it didn't disappoint just yummy!!<br><br>The service was just top notch! Since we entered the place we were greeted by the most charming hostess. Heather, our sever, was super attentive, very knowledgeable about the menu and wines and made our dining experience unforgettable, thank you! <br><br>Highly recommended!", "pics": null}}, {"review": {"des": "An old Michelin stalwart with one of the best lunch deals in Chicago. We did go with a colleague whose Husband works as a cook at the restaurant and the treatment we received was phenomenal. It is clear that a lot of effort goes into developing the flavor profiles of all the dishes and pre fixe menu is a steal at the price point. I would like to go back for dinner and am sure it will be an experience to remember too.", "pics": null}}, {"review": {"des": "Wow. Talk about a taste bud experience. From start to finish, the tasting menu was well worth it. everything was flavorful and presentation was beautiful. Fine dining never tasted so good. Definitely a must stop if you ever come to Chicago.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/q2SgnjzNS7RerfZfzAwByw/348s.jpg", "caption": "Pop rocks with white chocolate on a bed of fruit jelly. Best dessert I ever had"}]}}, {"review": {"des": "I was hell-bent on going to a Michelin star restaurant during my vacation to Chicago, but I wanted to find an affordable dining experience. Lo and behold, the Blackbird weekday prix-fixe menu, $25 for appetizer, entree, and dessert?! That's a steal!<br><br>Service is fantastic, and the wait staff is very knowledgeable of the ingredients and entire cooking process of all the dishes. Be sure to ask them as many questions as you need to!<br><br>Yes, the quality is amazing, earning them raving reviews and a Michelin star, but it's missing a certain playfulness and creativity that I was expecting.<br><br>Chilled cucumber gazpacho with tomato jam, yuzu, and crispy biscuits was a refreshing appetizer on a summer day. There was a spiciness that pairs perfectly with the yuzu and tomato jam.<br>Grilled sturgeon with almond, cherry, sorrel, and mustard was a pretty small entree, but still delicious. The almond reduction used a flavorful fish stock, and the \"fish hushpuppy\" was fantastically fried.<br>Rasberry chesecake, toasted oat, and sweet lily sorbet was the heavier dessert choice on the menu. The oats were perfect crunch with the cheesecake and sorbet. Overall, a perfect ending to a fantastic meal!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tnvAIlSRIk6zoMtKXU2iqQ/348s.jpg", "caption": "Raspberry cheesecake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_sofTnE0N4CmxpiUMZTxBw/168s.jpg", "caption": "Grilled sturgeon"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4qdvBoG6sBt2eXsTEl0GDw/168s.jpg", "caption": "Nautical nonsense"}]}}, {"review": {"des": "My wife and I had a wonderful dining experience at Blackbird, one of the Michelin star restaurants that have been on our list for awhile now. Our server was very friendly and explained all menu items to us. We started with the wagyu beef and lobster appetizers; both beautifully presented and delicious. Between the two of us, we ordered 3 entrees which was the perfect amount to fill us up; the sturgeon, porchetta, and venison leg. The sturgeon was definitely my favorite, combining sophisticated flavors with crunchy textures. Overall, a great meal and wonderful service. I'm not really into sweets, but the flourless chocolate fudge dessert with white chocolate ice cream is also a must, you won't regret it.<br><br>Best,<br>Charlie", "pics": null}}, {"review": {"des": "There aren't many places you can get a three course Michelin starred lunch for $25. But I probably wouldn't go back. Here's why: <br>No allergen information e.g. nuts in the fish dish, my mother in law had an allergic reaction. <br>The staff: could clearly be seen sniggering at the guests. <br>Salt: soooo much salt!! The duck confit in particular left a horrible feeling on my tongue. <br><br>All in all a bit disappointing.", "pics": null}}, {"review": {"des": "Review on tasting menu experience: I selected the crispy brussel sprouts with apple cider, fresno chili, orange & Parmesan as an appetizer. I'm a big fan of brussel sprouts so this dish was a hit with me!<br><br>Next up was the hanger steak entree with chestnut mole, cabbage & truffle oil. Followed by a ginger, cinnamon mousse & candied fruit. Both of these dishes shoulder amazing to me, but as I ate I only became more underwhelmed by the experience. Especially when the portions (normal for a tasting menu) are so small...I expected to at least be blown away.", "pics": null}}, {"review": {"des": "First Michelin star restaurant I've ever been to. We wanted to try Alinea, but reservations are near impossible there. We were able to make reservations to Blackbird just a few hours beforehand. It's a small-ish space, very white in decor, a bar in the front, and an open kitchen in the back. We were fortunate to sit in the back and see all the action. You can order the tasting menu or a la carte. We decided on the 10 course $130 tasting menu, which included...<br><br>- Rhubarb, Green Coriander, Churro<br>- Crab, Sunflower, Strawberry, Tamagoyaki, Caviar (favorite of the night)<br>- Hiramasa, English Pea, Puffed Grains<br>- Artichoke, Morel, Fromage Blanc<br>- Sturgeon, Garlic, Almond:<br>- Lamb Meatball, Pickled Shrimp, Licorice<br>- Rohan Duck Breast, Lavender, Patato<br>- Passion Fruit, Jalepeno, Freeze Pop<br>- Goats Milk Flan, Strawberry, Basil<br>- Tonka Bean, Carob, Churro (started and ended with a churro)<br><br>I liked some dishes more than others. Some were extremely unique and had me wanting more. Some were well executed but I've seen those flavor combinations before. There were 1 or 2 that I could have done without. I'm not sure what exactly defines a Michelin star restaurant, but as long as the food is good, I'm all for it. And Blackbird was a substantial last-minute backup plan.", "pics": null}}, {"review": {"des": "I have traveled all over the world and have eaten in some of the best restaurants (in Paris, Barcelona, London, etc.) and Blackbird is easily on that level. Your food is divine and the presentation is beautiful. Thank you for bringing a world-class dining experience to Chicago.", "pics": null}}, {"review": {"des": "Well, i think this restaurant is overrated, i went there with two other friends, all of us got the tasting menu, i was waiting for the dish where i can say \"Yeah that's delicious!\" But that didn't happen ! I'm not saying that the chef didn't try, but i guess he failed ! <br><br>There are some dishes you don't even feel the ingredients described (one of the dishes, pistachio was described and the three of us didn't taste it)<br><br>I don't think that the quantity of all the dishes combined, abolish you hunger !<br><br>Beside the food, the service was too long, sometimes we had to wait over 10min to get the next plate.. <br><br>I JUST HOPE THAT THE MICHELIN STAR WAS FOR ANOTHER MENU ! <br><br>I do not recommend this restaurant !", "pics": null}}, {"review": {"des": "We had the $25 lunch set. Warm shrimp salad was delicious and sour to the right point. Cod was just Ok. Dessert a bit too sweet.", "pics": null}}, {"review": {"des": "We enjoyed the tasting menu with the wine pairing and thought the food was very good. Every dish was well prepared, yet, we were expecting a bit more creativity. Service was excellent from start to finish. The place was packed and the seating is a tight squeeze.", "pics": null}}, {"review": {"des": "I had been wanting to try Blackbird for some time. We got the lunch prix fixe for $25. It was neat but I was hungry again two hours after I left. My buddy didn't tell me that he pregamed with a protein shake which I found disingenuous. The service was great as was the presentation. I didn't investigate too closely but you'll notice in pictures here that the bowls seem to be really worn. I look forward to returning again and getting a regular meal.", "pics": null}}, {"review": {"des": "Omg this place was fantastic! The ambiance itself was very clean and modern and the service was friendly, knowledgeable about the menu and wine, and very helpful in talking us through the food. We did have someone in our party with an allergy and they were pretty accommodating; however there were some things they couldn't do substitutions for. Otherwise, everything we ate was full of flavor, played beautifully,  and very delicious!", "pics": null}}, {"review": {"des": "We went during the week and tried the prix fixe lunch. The shrimp salad and falafels were really good as starters and got our taste buds activated for the entrée, which comprised of steak and whitefish. I had read reviews about the fish not being upto the mark and went in with low expectations. I was thoroughly surprised. It was delicious - soft on the inside and covered with a crunchy texture. <br>The desserts consisted of matcha tiramisu and savarin. The tiramisu was spot on but the cake was a huge miss. It wasn't sweet at all and threw me off with the strong underlying tasteless creaminess. <br>We finished everything else but left the the savarin pretty much untouched. Our waiter picked up on it and gave us a complimentary cappuccino to make sure our experience ended on a high note. <br>Overall, a must visit place for the price and ambience.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nmmkA1y6QkV6odLuTT3JgQ/348s.jpg", "caption": "Savarin"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1FtOUIDRi7eIeCI00Bh4YA/168s.jpg", "caption": "Matcha Tiramisu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FEHU9ZBc5juOyH0vY0afig/168s.jpg", "caption": "Hanger Steak"}]}}, {"review": {"des": "Wow this was a treat! I ordered the lunch prix fixed menu and sat outside. The restaurant itself is quite small but very well decorated and pleasing to look out, both on the inside and from the outside. The food was so excellent: beautiful and so delicious for just $25! The waiting staff even poured me a free glass of sparkling wine (they said champagne but I didn't see the bottle so who knows) because \"my reservation said it was a special occasion\" even though I told them it wasn't. Still very nice of them. I highly highly recommend this place, and can't wait to try their a la carte menu!", "pics": null}}, {"review": {"des": "We went during restaurant week with a party of six fully expecting a packed restaurant and worse service than usual. Although the restaurant was busy, I was surprised to find service was still great quality.<br><br>The party I was with all took part of the $22 prixe fix restaurant week sampler menu. Although outside of restaurant week, Blackbird still offers a $25 similar menu which is a great deal considering the restaurant has a michellin star. <br><br>The menu includes an appetizer, an entree, and a dessert. I ordered the crispy Brussels sprouts, duck confit, and fruit parfait. The Brussels sprouts and fruit parfait had a strong flavor profile well mixed between both sweet and sour. Both of these were the favorite dishes of the party I was in. For the entree, the duck was a tad dry, but the dish was tasty nonetheless. <br><br>This was my first time at Blackbird and I would visit again, especially for the $25 lunch menu. It was a good amount of food for the price and the dishes were well paired together. The experience was enjoyable and everyone in my party enjoyed their food.", "pics": null}}, {"review": {"des": "Review for the lunch prix fixe menu. $25 for 3 course meal at a Michelin star restaurant is certainly a steal! The only catch is it's only available Monday through Friday, so I had to go when I had a day off work. I made reservations on open table the morning of and was able to snag a 1:15pm reservation for a party of 6. We came a bit early but we're promptly seated. The restaurant is smaller than I anticipated, tables were pretty close together. But the decor was minimalistic and aesthetically pleasing. They really utilize the color white, both outside and inside. White building facade, sleek white door, and white table cloths create an image of fine dining. The service was lovely. Our waiter, Keith (?), answered all of our questions and provided recommendations when we couldn't decide what to eat. He also told us the origin story of the name Blackbird, that the owner was watching a Cubs game that was going poorly, so he switched to watch something else- which happened to be a pbs documentary on blackbirds. I guess this inspired him in some way lol. <br><br>Anyway, on to the food. While everything was good and beautifully presented, it just didn't amaze me like I was expecting a Michelin star restaurant's food to do. I had the brussel sprouts for appetizer, the duck confit for lunch (highly recommended by our waiter), and the gingerbread cremeux for dessert. The duck was a bit saltier than I would've liked. <br><br>Nevertheless, the prix fixe lunch menu is a great deal and a wonderful affordable way to try out this Michelin star restaurant.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/W5D0HnMlpf4fgLpP5AS5_Q/348s.jpg", "caption": "Lunch prix fixe menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AEVvQCVadJb98BEQfXyYdw/168s.jpg", "caption": "Gingerbread cremeaux"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yzvReZqajIUEjuwGff5Hfg/168s.jpg", "caption": "Duck confit"}]}}, {"review": {"des": "This place is the epitome of exceptional. Excellent service, inspiring food, and offers an elegant while inviting ambiance. The entire room is white, with windows, so it enhances the natural lighting in the place. I work a couple blocks away from Blackbird and have been here for lunch a few times now. The food blows me away every time. They use innovative, complex ingredients. A broth that tastes like English peas wouldn't simply be made out of peas. I don't recall what the waiter told us when we asked, but it would be for instance, peas mixed with chives, radish, and another ingredient, and another. But peas would be the key ingredient. <br><br>I've tried their burger. The patty was grilled to perfection. I like my meat well done and it sure was made very very well. The bun was so soft! Veggies were fresh and crisp. Another time, I ordered the bouillabaisse. It was likely the best bouillabaisse I've ever tasted. Rich in flavor but not overpowering. Seafood portion was generous. Every bite of my dipped bread in that broth was stimulating my taste buds and having me wanting more. Paul Kahan is a talented man! And totally deserving of the one Michelin star and James Beard award. Every dish comes with a side of salad or fries. It's just enough for lunch. Certainly not cheap. I end up paying close to $20 with tax and tip for my meal. <br><br>Warning: the place is small, so tables are small and space between tables are tight. It's a turnoff for me. But, prime real-estate in West Loop is steep, so every square feet is the price of gold.", "pics": null}}, {"review": {"des": "Delicious! I went with my sister her fiancé for lunch & enjoyed squash soup, whitefish tempura, & some Thai chilly/coconut ice cream for dessert. The drinks were fabulous, I had a Normandy Negroni. Great selection on the menu. Atmosphere was very welcoming & sorta posh like.", "pics": null}}, {"review": {"des": "Visiting home for a week and came here for lunch with a friend of mine. I drove past this place a few times before and I've been wanting to go for a while because of how fancy it looks from the outside.<br><br>Years later, here we are, got a reservation for two at 12:15p. The waitress placed the menu in front of us and nicely asked if we have any questions. The menu is very short and simple, so it didn't take long for us to decide what to order. In summary, each of the dishes in the prix fixe menu looks better than it tastes, and it's just so disappointing. Let's start with the appetizer. <br><br>The warm shrimp salad: first bite, I thought \"mmm interesting, that flavor tastes very familiar\"; second bite, it tastes like Pringles; third bite, yea I think they made a Sour Cream and Onion Pringles soup and put shrimp on top of it.<br><br>The white fish: The fish was over cooked and there was too much sauce on the veggies and too many flavors going on with this dish. I don't remember all the ingredients that went into this, but  the flavors were all over the place, and the berry dressing certainly did not go well with the fish and the veggies.<br><br>Hangar steak: Too chewy and the outside was too burnt. Nothing special about this one.  <br><br>The fudgesicle: I think that's what they called it. The chocolate ice cream part was unbelievably salty. It's like very salted caramel chocolate with extra extra salt. Paired with cake, salted granola and two blueberries. This would've been a good dish if the ice cream wasn't so salty.<br><br>The dishes are innovative, unique, but just not for me.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tcIwyJaIAcbUCs-e4V3n6g/348s.jpg", "caption": "Whitefish"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1j7-9B_5Nrx07tOqWCfrQA/168s.jpg", "caption": "Fudgesicle and ginger Creme brûlée"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/C9CRx2jJW9HKXFaTSZyABQ/168s.jpg", "caption": "Chips ($3)"}]}}, {"review": {"des": "I was kind of disappointed by blackbird. I saved it for my last meal in Chicago since it was a Michelin starred restaurant. I came for lunch at 11:30 and was barely greeted by a surly host. He asked me where I wanted to sit and I said anywhere with good lighting. He gave an exasperated sigh and looked around like he didn't know where to put me. Another hostess came by and said let's seat Nancy by the window. Ok. Not hard. <br><br>Once I was seated I ordered the prix fixe along with a hamburger off the regular menu. I was warned it would be too much food (challenge accepted) but proceeded anyway. I also got coffee.<br><br>To start there is a lovely wedge of bread with whipped butter. I don't know what they do to their butter but it has a fluffy texture with an almost citrusy aftertaste. It was really good. The bread was soft but had a lovely crust coated with oats. It was sweet and complex and went well with the butter. I wish I was given another wedge of bread. <br><br>Then came my brussels sprouts. Totally delicious. Probably my favorite thing of the entire meal. They were warm shredded Brussels sprouts with crispy fried onions. All this was served with a bright dressing. I already forgot what was in it. But it was really good. <br><br>Then my duck confit and hamburger with fries came. The duck was perfect. I don't often get well cooked duck so I was very impressed. It was sweet and moist. The duck sausage was also delicious. I don't think I have ever had duck sausage. The purée it sat on was light and delicious. The hamburger was actually my biggest complaint. The buns were so burned I actually gave it back to the waiter after I took one bite. It was inedible since it ruined the taste of the burger itself. He brought back a fresh burger in no time but I still didn't care for it. The ramps on the burger were good but I think they gave me too much. I don't like onion rolls much either so as a whole I really didn't enjoy this dish. <br><br>For dessert I had the yellow cake with banana ice cream and candied bacon. This took me awhile to enjoy. Once the ice cream melted it tasted like my childhood. Like the best bowl of cereal you've ever had in your life while watching Saturday morning cartoons. The candied bacon was  not truly candied so I didn't care for it much. But overall I thought this dish ended my meal well. <br><br>I guess I would recommend this if you want to try something nice for lunch. Stick with the prix fixe items. They won't disappoint.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XMjzr_Qse_hgDnC3YPZ3yw/348s.jpg", "caption": "Brussels sprouts - best ever. Hands down"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TcJnm-viyeINzA3K4HV4dA/168s.jpg", "caption": "Duck confit - delicious"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Uaqs0CwtCG3qQp7-ued2mQ/168s.jpg", "caption": "Hamburger - not yummy"}]}}, {"review": {"des": "Took my grandma here for her birthday lunch, but also because I've wanted to try Blackbird for a while (I love Avec)! We each ordered from the lunch prix fixe menu. She ordered the Warm Shrimp Salad, Roasted Whitefish, and Matcha Tiramisu. I ordered the Parsnip Velouté, Duck Confit, and dessert cheese. We each enjoyed the starters and desserts, but felt that our mains were too salty. For this and it being overhyped, I have to deduct 2 stars. However, since this review is for the lunch prix fixe menu only, I'm open to giving it another try. Until then, I'm going back to Avec!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FgLDIkGv6Ni0hoSN9KD1fw/348s.jpg", "caption": "Match Tiramisu - so good!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hprRVuKiaF_f5R5GzIOP9w/168s.jpg", "caption": "Dessert Cheese"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/g_8lgmNjkkj6Hj1cvyTzLA/168s.jpg", "caption": "Roasted Whitefish"}]}}, {"review": {"des": "THANK YOU for accommodating my wife, son and I for dessert only on a Friday night even though you were about packed.<br><br>We had dinner at Avec and then went to Blackbird and had all the five desserts on their menu. Real nice. <br><br>Great service as well.  Professional. Non snobbish.<br>Kinda interesting as it is fancier than Avec next door and few times at Avec I have felt i have gotten the attitude :)<br><br>I have been to blackbird many times in the last few years so this update is a bit belated.<br><br>Always great service, good food, beautifully presented.<br><br>Love it when one of the partners, Eduard is there. Quiet a champ and a gentleman. Enjoy our conversations.<br><br>Highly recommended.", "pics": null}}, {"review": {"des": "Softshell crab appetizer, entrees: halibut, and the porchetta was delicious ! Went last Jun2018 when I was in town for a conference. Hope to go back soon.", "pics": null}}, {"review": {"des": "After all these years, Blackbird still impressed me. We were recently there and decided to try out their tasting menu for their first time. On the tasting menu, they have bites that aren't available on their regular menu, so it was quite a treat!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XmW1IlfZ50PC1uUQ9cTYZg/348s.jpg", "caption": "Surprisingly. Light desert for Brioche and strawberries!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eChfV7n_aJyY7x4vFV3YBQ/168s.jpg", "caption": "Light and crispy, lemony shell... perfect end to a perfect meal!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hHf8yIBhCctNIzv-jlREhA/168s.jpg", "caption": "The sirloin was amazing. The artichoke sauce tasted unbelievably fresh!"}]}}, {"review": {"des": "A dinner for 4 for $400. For this I got<br>Two pieces of meat the size of a <br>Walnut a toothpick and a glass <br>Of water.  Food was good but <br>Way over priced. A great place <br>If you like small portions and  high prices<br>The waiter was haughty  but <br>It's like \"your an interruption to me\"<br>I didn't pick the restaurant my niece did of course <br>She wasn't paying so made no difference <br>To her.", "pics": null}}, {"review": {"des": "Blackbird is my favorite and first one star Michelin restaraunt. The service was amazing. It took less than 80 seconds for our water to be refilled (we counted), the food came out at a great manner and the amount of quality of attention we got was phenomenal. When I went I did the suggested course meal. It was one of the funnest experiences I had. It took around 2.5 hours but was definitely worth it. The way beef was amazing, each course had it's own personality, and the quality wasn't compromised. It is definitely worth going. The courses in itself were presented beautifully and the michelin star they have is well deserved. This food really did feel like art and it was truly a fun experience.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tEheZL5tLkK2itZos8jwfw/168s.jpg", "caption": "March 2018 course menu"}]}}, {"review": {"des": "The Michelin one starred Blackbird is more of a value lunch spot for people going to work nearby at noon. The place is crammed. People have to move the table first to get in and out. However, the taste and the look of the food exceeded my expectation. <br>We started off with the endive salad. The salad comes in a fried potato ring, and has bacon and a poached egg in it. The bacon and egg really raised the flavor. We liked the salad.<br>Then we ordered the roast beef sandwich for share. The sandwich has a fairly strong taste of truffle, which I really liked, even though I cannot locate any in the sandwich. The sandwich also comes with fries, and they are decent.<br>The whitefish and hanger steak are not that delicious compared to the salad and the sandwich. They are both pretty plain, and the steak is too chewy for me.<br>The two desserts are decent. I personally think the cake is a little better than the ice cream bar.<br>Overall, a very good lunch with value. The quality of the food did not slack off because it is during lunch hour.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/K6Wfdx8iVOwzS9oMYgqUEg/348s.jpg", "caption": "Upside down pineapple cake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CC0KIPDVVU4UcchEAPZcBA/168s.jpg", "caption": "Ice cream bar"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WJuM8R3rp5S8mgiu8n7hUg/168s.jpg", "caption": "Espresso"}]}}, {"review": {"des": "An exquisite experience with great attention to detail for those with high taste. <br><br>The server and hostess were quick to mention congratulations on our special occasion and offered a champagne cheers on the house. Additionally, the team switched the napkins to black to be sure to accommodate the color of our clothing & recommended a perfect pinot noir to our taste.<br><br>The kitchen/service operation at Blackbird is also something to marvel at: the utmost care put into each dish exiting the kitchen, the chef's nod of approval on presentation, the server's ability to enter and exit without disrupting table conversation, and even the down-to-a-science delivery process (i.e. making sure the correct silverware are on then table and ready before serving the dish). <br><br>The food itself was naturally rich and sublime...incredibly crafted and thoughtful. The endive salad was a standout, as a standard on the Blackbird menu, as well as the pork terrine and duck breast. Truly worth very penny, leaving you salivating for more.  <br><br>Thank you for being a standout in the Chicago restaurant market, Blackbird. A shining 5 stars...", "pics": null}}, {"review": {"des": "Went on the Fourth of July for lunch. Food was excellent but the service and cocktails were lacking and flawed.<br><br>I ordered the first cocktail listed on the first page of their menu. It was supposed to have crushed ice in it. There was maybe one crushed ice cube and the rest of the glass was filled last the rim with full, uncrushed ice cubes. Because of this there was barely any liquid in the glass. Perhaps a thimble sized amount of the actual cocktails<br>Itself compared to 12 ounces of ice cubes. <br><br>We were there for over an hour and they had open tables but nobody ever came around to ask if we'd like to order more drinks. <br><br>Their warm shrimp salad is good tasting but is basically a soup; it comes floating in a broth that fills much of the bow it's served in. Yet they don't serve it with a spoon, you only have forks. This makes it impossible to finish the course unless you want to pour the bowl into your face and slurp.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uRFBJ6bB1BdGbOO4czobUg/348s.jpg", "caption": "Lime scone"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_dZK_SKYPGQwrLcbNENCTw/168s.jpg", "caption": "Warm shrimp salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GuawJnO6HS2FGHD88kdEJQ/168s.jpg", "caption": "Lamb"}]}}, {"review": {"des": "Blackbird. Home to a James Beard Award and Best Chef of the Midwest winner. Home to another James Beard Award for Best Restaurant Design and Best Restaurant Design Graphics. Named the Jean Banchet 2017 Restaurant of the Year. And of course, a one Michelin star restaurant.<br><br>Noted for their Midwestern, farm-fresh cuisine, Blackbird is one of those restaurants that executes complex flavors in elegant dishes. This is probably not your average dine-out restaurant, given that most entrees are around $40. But if you're looking to impress, look no further. <br><br>The decor is minimalist and bright. Tables are crammed next to each other, which adds to the energy of the place. Service is impeccable; servers are always moving about swiftly and efficiently to serve and clear plates and utensils and to refill drinks. <br><br>I've heard their prixe-fixe lunch menu is quite a bargain so for those strapped for cash but want to experience this Chicago staple, that may be the ticket. The menu has everything from quail to king trumpet mushroom to sturgeon, duck breast, rabbit, and suckling pig. We decided to try their winter tasting menu, hoping to get bites of all the best Blackbird has to offer. <br><br>+Herbed chicken broth tea, leek and pea tart with cured egg yolk, cromesquis of duck with smoked red seaweed<br>+Arpege egg with cauliflower cream, crispy potato, and osetra caviar<br>+Rye berry porridge with malted apple and black truffle<br>+Confit of king trumpet mushroom with dulse and dried duck<br>+Gentled smoked hamachi with royal trumpet, schmaltz pudding and ginger consommé <br>+Squab leg zampone with fermented cranberry, cooling herbs and buttermilk<br>+Roasted squab rack with ember charred persimmon, nicoise olive crème anglaise, and pot pie of winter squash<br>+Kalamansi \"egg\" in a nest<br>+Cotton cheesecake with pomelo and mint licorice <br>+Chicory hot chocolate with chestnut<br><br>The tasting menu is $125 per person. If you want to get the wine pairing, it's $70 extra. For 10 courses, it may not be the most inexpensive meal but for what you're getting at a restaurant of exceptional caliber, it's a bargain. I have nothing but good things to say about each course. I especially liked the herbed chicken broth tea (which they bring out in a teapot and pour into glasses at your table) and the roasted squab with the pot pie. I was very impressed with the simplistic execution but complex notes of each beautifully plated dish. Even the cocktail I had was well-designed and complemented the food perfectly.<br><br>The food, the service, the ambiance were all outstanding. I would highly recommend this restaurant to anyone.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/A18YZTA08aSljoSHdsKnRg/348s.jpg", "caption": "Cocktails"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UuvIa10ejbV6as6GgSnEXg/168s.jpg", "caption": "Cotton cheesecake with pomelo and mint licorice"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-uvVjr8Fgh9vPPeLvIgElA/168s.jpg", "caption": "Herbed chicken broth tea with leek and pear tarts with cured egg yolk"}]}}, {"review": {"des": "I had the 10 course tasting menu with wine pairing with my SO. Everything was stunning, both taste and presentation wise. I thoroughly enjoyed all of the pairings, and all of the food as well. <br><br>Just a heads up-the sturgeon and chicken wing course wine pairing comes with a beer. If you're not a beer drinker, they will gladly give you a lovely rose instead!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Rr89N6_M71CXvBxch7Eidg/348s.jpg", "caption": "10 course tasting menu, sans the sorbet course"}]}}, {"review": {"des": "Let me start this review by saying that I've wanted to try Blackbird since I moved to Chicago in 2009. For a restaurant in Chicago to last this long, they must be doing something right. I moved down the block from them two years ago, and the longing continued. Finally, my Fiancé surprised me with reservations for our anniversary dinner! The portion sizes were bigger than expected, and the food was just ok. I wasn't left feeling that \"mmmmm mmm good\" feeling. Nothing was so memorable that I'd need to go back immediately to satisfy a craving, which is usually my indicator. <br><br>We started with the endive salad, which is cool because they cut it at the table. We also ordered the wagyu beef appetizer, both were good. Then for our main course, I ordered the strip-loin, and my Fiancé ordered the duck. For dessert, we had an espresso, cappuccino, and the ice cream. The service was just o.k. the server had no personality and had no interest in conversation other than order taking and moving on to the next table. The food runner spoke to us more than the actual server. Not looking to be best friends, but a little conversation is nice. <br><br>I won't ever go back, and if I had to recommend a West Loop staple, I'd go to Proxi, Girl and the Goat or Monteverde.", "pics": null}}, {"review": {"des": "Blackbird has probably past its prime years at this point. This has been the second time I've been here and it was a disappointing meal.<br><br>I had the tasting menu and was really hoping to try some some creative and well cooked dishes. Unfortunately, all of the dishes were over seasoned or over cooked with the exception of the final savory course. <br><br>The blue crab/kaffir lime/trout roe/almond dish looked beautiful and should have been a delicious dish with delicate & subtle flavors, but it was incredibly bitter and far too sweet to enjoy. The venison tartare/shellfish dish came out with tiny slivers of tough, over salted, and well done venison that over powered any shellfish that might have been in that course. The small wagyu beef strips had ok flavor, but were cooked to a medium to medium-well which dried out the meat.<br><br>The front of the house staff were friendly, but not as attentive as they could be. They ended up spilling sauce over the water glass and left it there to crust over. Plates were not cleared between courses for a while. There was also a lag between courses so the dinner took longer than I expected. The bathroom was a bit filthy as well. <br><br>The good parts were the last venison/grilled pear course with game consume were delicious. The cheese and dessert course were also nice. <br><br>Overall, it just was not worth it for the price point. There are just too many new fine dining places in Chicago visit instead.", "pics": null}}]}