{"name": "boka-chicago", "reviews": [{"review": {"des": "A wonderful dining experience that showcases incredible culinary skill and vision.<br><br>The 8 course tasting menu takes you on a delicious journey with intricate presentations and imaginative flavor combinations. Each dish incorporates different textures and flavor profiles that work harmoniously to keep your palate happy.<br><br>To whet your palate, the meal starts off with amuse bouche that features 3 items. My favorite was the oysters. They're fresh, sweet, and buttery. They're also topped with a creamy sauce.<br><br>The crudo dish is a great way to dive into the meal. The fish is thinly sliced, marinated and extremely fresh and tender. There's some puffed buckwheat for some crunch with each bite,<br><br>The grated foie gras is very interesting. Instead of the traditional presentation, the foie gras is finely grated to resemble cheese flakes. It's retains all the things you love about foie gras in its natural state. It sits on a bed of diced candied quince and almonds and topped with black truffle dust.<br><br>The mushroom risotto was okay. The risotto was a bit crunchy for me, as I prefer my risotto to have a softer mouthfeel.<br><br>The scallop and lobster soup is very rich and hearty. There's also some uni cream hidden at the bottom for even more decadence. The scallops and lobster are cooked well.<br><br>The 2 main dishes feature quail and venison. For the quail, you get a thigh that's been seared and grilled to perfection. The marinade is a soy/teriyaki preparation and there's also a mushroom puree. The venison is very rich and fatty, and cooked to a medium rare. It's tender throughout and surrounded with a nice crust. There's also a small venison sausage and a celery root puree.<br><br>Of the 2 desserts, the diced pears and ice cream was definitely better than the toffee cake with burn cinnamon. The pears were light and refreshing and a great palate cleanser.<br><br>Service was excellent. All the servers are friendly and very knowledgeable of the menu. They provided assistance as needed when you have questions about what it is you're eating. The tasting experience lasted over 2 hours to complete, so plan accordingly.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iUehrsSxvnExIig6JG-sEg/348s.jpg", "caption": "Amuse bouche"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DiB_h9hb8pSbMO2-P21tdA/168s.jpg", "caption": "Crudo"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4YuU-kq7Vjt_N-2H27QCaA/168s.jpg", "caption": "Grated foie gras"}]}}, {"review": {"des": "There was so much to love about Boka and yet enough to disappoint..<br><br>I wish I could echo all the 5 star reviews and say how fantastic the food was, but considering the number of dishes we tasted we left wanting more.<br><br>I give Boka 5 stars alone for its enchanting romantic ambiance, elegant but unpretentious aura, and impeccable flawless service.  It wasn't reaching for flamboyant or pompous as some Michelin rated restaurants can and do.  For this reason, my experience was highly memorable.  They excelled at making our special occasion personal.  Unfortunately, this didn't carry on to the meticulously plated dishes which left more to be desired. <br><br>With 9pm Saturday reservations the dining room was relatively quiet as only a few tables were occupied, while the handsome bar was somewhat bustling.  We were seated in a spacious booth upstairs and it felt like we had the entire floor to ourselves.  It's really a beautiful, inviting space without the pomp and circumstance.<br><br>Our server presented us with personalized menu's for our celebratory dinner.  She was welcoming, personable and knowledgeable of the offerings.  Complimentary champagne was poured and amuse bouche presented.   She thoroughly explained the tasting menu stating Chef could accommodate our tastes to a degree. She was very helpful & attentive.  For the price, it really is the best way to sample the menu, however after many Q's&A's we decided to select our own dishes and share...and we weren't shy about it.<br><br>He ordered a bottle of champagne and soon after our dishes arrived in perfect timing one after another with an explanation of each.  <br><br>First plates selected:<br>Foie Gras Torchon - Served with plum, crispy kale & toasted brioche.  I'm not fond of foie gras but he is so I gave it a little sample.  Rich, buttery and smooth. Plum was a nice contrast.  He liked it but didn't love it.<br>Grilled beat salad -  I enjoyed the beets but nothing else was noteworthy.<br>Dry Aged Beef Tartare - I tasted more carrots than beef. Not memorable. <br>Grilled Spanish octopus - This is a favorite of mine and I always order it when I see it.   If there is such a thing as over tenderized then their version is it.  Texture was missing as it was more mushy than anything.<br><br>Entrees:<br>Alba White Truffle Tagliolini - I was so excited to try this because I love truffles.  Perfectly al dente tagliolini with a generous amount of crispy shaved truffles in a light cream sauce.  It wasn't heavy but it was extremely salty to the point where it just wasn't enjoyable.  <br>Roasted Beef Short rib - Melted in my mouth; extremely tender but overall salty.<br>Brown Butter Roasted Wild Bass - My absolute favorite dish of the night.  The charred cucumber and sauce was refreshing & vibrant.  It perfectly complimented the delicious fish.  Excellent.<br>Roasted Dry Aged Duck (for one) - Beautiful crispy skin but cooked med rare which resulted in a gamy flavor that he didn't enjoy.  I passed on tasting this.<br><br>We finished off the night with the dark chocolate dessert  - Gelato with a caramel chocolate concoction.  I appreciated the inscription on the plate, nice touch.<br><br>Plating was nicely done.  Portions aren't expected to be large and yet I didn't feel they were skimpy given the caliber of the restaurant.  We tasted a lot of dishes.  At the end of the night, we were the only ones in the dining room.  Maybe the kitchen was tired and ready to go home because we felt most of our food was overly salted with more attention to plating than preparation (with the exception of the Bass).  We were left surprisingly underwhelmed for a Michelin star restaurant. <br><br>I will say the experience, service and atmosphere was worth the visit and we didn't leave hungry.   Boka will always have a special place in my heart.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KR58K-NqRv1l679kCUNDMg/348s.jpg", "caption": "Autumn 2018 Menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zIPmzT0JoF8PnKga0d9doA/168s.jpg", "caption": "Exterior"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QyvfFO6Bjj5zFOAoT6XZ1g/168s.jpg", "caption": "Dark Chocolate dessert"}]}}, {"review": {"des": "Tremendous meal all around. Really treat you well on service and food. Begins with complimentary bread and amuse bouche of potato. Food is little expensive but none more than any other American restaurant with the lounge/dark lighting atmosphere at Boka. Quality is well worth the price. Most entrees range between $30-40 and looked to come out on the small side most of the time so an appetizer would be recommended. <br><br>We had the ricotta gnocchi, and the chicken and bass for entrees. Gnocchi was fantastic. Had a soft middle that just oozes out. Dish was perfect for dipping and had a full cheese taste and smell with each bite which perfectly began the mea. The bass was tiny but cooked perfectly throughout. Each piece fell off and was perfectly pickable. Sauce again was fantastic, but caught me off guard as the fish itself was very bland so the dish had a deconstructed fee that made it open to the combination eating style. The chicken was some of the best I've ever had. Really strong innards and the thickest skin I've ever had. Had a duck-like crunch of skin that I've never seen on a chicken. Really nice dish and bigger than all other entrees. <br><br>As we came for a birthday celebration, we were offered a complimentary chocolate cake. We also had to order the notorious hazelnut dessert on top. Chocolate cake was good but very typical with layered frosting. The hazelnut dessert was superb. Could have used a little more crunch or a short bread of sorts, but so unique and interesting texture and flavor with 4-5 different aspects to the plate. We then luckily got a banana bread to go from the table next to us that didn't want it - so good and wet and cutely packaged. <br><br>Boka is well deserved of a Michelin star. Well deserved of it's reputation in the city as a quality and consistent meal for business or celebrations. Price is fine and wines available at every price point. Boka group once again delivers a top notch dining experience.", "pics": null}}, {"review": {"des": "Had our second meal here last night, and it was fantastic. Such a great atmosphere and laid back dining experience. If you're a fan of duck, I highly recommend the roast duck! It was cooked to perfection, medium rare in the inside and oh so crispy on the outside. The confit that accompanied the dish was also rather amazing. <br><br>One of the things I really appreciate about Boka is that when you order a cocktail, the drinks always come out fast. We've been to some other restaurants in the area that take foreverrrrrrr just to get a drink. Dinner is always spaced out well where you don't feel like it's taking too long, or that you are being rushed. They have their timing and service down to a science at Boka, which is something you should expect from an award winning restaurant that's well established. We'll be back again!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SSrHc-sLjkelAfvAjC1R6Q/348s.jpg", "caption": "Hazelnut dessert"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KgF9b-D0TDrZ5L7K6gx9bw/168s.jpg", "caption": "Roast duck"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7P-Qk2rlGLvIDGlOtJGSzA/168s.jpg", "caption": "Beet salad"}]}}, {"review": {"des": "This was probably one of the best meals I've ever had. Seriously, my experience at Boka was a real treat! If you're looking for a phenomenal restaurant for a special occasion or just a damn good meal, look no further than Boka.<br><br>SERVICE:<br>Unbelievable. Seriously unbelievable. The waitstaff is friendly, attentive and demonstrated superb knowledge of the menu. They gave honest advice on how to order in order to get the best experience possible at Boka.<br><br>FOOD:<br>Out of this world. I actually miss this meal! My personal favorite dish was the ricotta dumplings. I could seriously eat them for every single meal of every single day and never get tired of them. They're seriously perfect. I also LOVED the hazelnut dessert. I could have definitely licked both of those plates clean if it were socially acceptable! I enjoyed everything I ate, but the ricotta dumplings and the dessert were my favorites.<br><br>The interior of this restaurant is beautiful, the food is beyond amazing and the service was phenomenal. Seriously, Boka is the real deal! I would recommend this restaurant without the slightest bit of hesitation. Thank you, Boka, for a truly special meal. I am already dreaming of my next visit.", "pics": null}}, {"review": {"des": "AMAZING. Most likely the best meal I've ever had in Chicago. <br><br>I initially came to this restaurant expecting pretty good food but not so good that I was leaving the restaurant thinking that I just had the best meal I've ever had- but Boka exceeded my expectations. <br><br>As soon as we were seated, we were asked if we were celebrating anything anything special. We told our waiter that we were celebrating our anniversary. Soon after, we were given two glasses of complimentary champagne. I'm not a big drinker but it was a nice gesture and started off our meal on a good note.<br><br>We ordered the mushroom pasta and octopus to start off our meal. As soon as I took my first bite, I turned to my boyfriend and told him that this was the best pasta I've ever had- the sauce was extremely silky with the perfect balance of earthy tones from the mushrooms and nuttiness from the cream/cheese; the small crumbles of chicken skin added a great textural element; the noodles were light and perfectly coated in the sauce.<br>The octopus was excellent- there were some grapes on the dish that added a nice sweetness, the cauliflower added great crunch, and the aioli helped balance the fishy taste of the octopus.<br><br>In addition to our appetizers, we were served the most amazing wheat sourdough bread- which was super super soft and an onion roll that was a melt-in-your-mouth punch of flavors. They also served a tempura bite that had interesting sweet notes from the sauce and crunchiness from the tempura coating. <br><br>For our mains, we ordered the olive oil poached cod and the short ribs. The cod was the softest, most perfectly cooked fish I've ever had! there was some nutty sauce on the plate that was so delicious I wanted to lick the rest of the sauce off the plate! It was also served with some charred lettuce that added a great smokey flavor to the dish. The short ribs were extremely tender and tasted really great with the charred broccolini.<br><br>For dessert, we had the hazelnut dish which came with toasted ice cream- extremely delicious. The sweetness of the hazelnut mouse (?) was perfectly balanced with the ice cream. I really loved the different textures/temperatures on the dish. <br><br>Overall, an amazing experience. I've been to Parachute before which is also on the michelin guide but I think I liked Boka is 10x better than Parachute! I was very very impressed with this place and will definitely be returning for another meal.", "pics": null}}, {"review": {"des": "Had a great meal at Boka recently. Stopped in on a Sunday night early for my reservation and was sat immediately. Service overall was very good - attentive, knowledgeable, lots of staff working to make sure water is refilled, plates are taken, courses are explained, etc. Very little wait time between courses. <br><br>For the food:<br>The amuse bouche was a tempura squash with furikake, sesame, black garlic aioli, and I can't remember what else. It was a delicious bite to start the meal (although a bit hot). The bread course was also amazing (I had a second order) - the sourdough is good, but the buttermilk sage rolls are next level. I could eat 10 of these. Served with butter topped with sea salt and fennel pollen. Yum.<br><br>I started the meal with a special white alba truffle tagliolini. This was soo good, so rich, so delicious. Every piece of it was great - pasta was cooked perfectly, the sauce was creamy and delicious, and there was a huge portion of white truffle shaved on top. A steal at $40 I would order this every time I could. <br><br>For my main, I had the whole roasted dry aged duck. This again, amazing. The duck breast was perfectly cooked and juicy, and the skin was crispy and delicious. The foie gras sausage was also very good. Other elements on the plate - a puree that complimented the duck well, and roasted grapes that added an acidic and sweet note to the plate. The side of duck confit was almost overkill - super rich and creamy, but nonetheless I left none of it. <br><br>I didn't have room for dessert this time around, but the two little bites at the end were a great finish to the meal (spiced almond cake & dark chocolate truffle).", "pics": null}}, {"review": {"des": "Wow. I mean, really, WOW. This was easily one of the BEST meals I've had in Chicago. The use of seasonal ingredients and flavor pairings in combination with the impeccable service speaks volumes.<br><br>One of my good friends was having his going away dinner there, and he has met Lee Wolen a few times, so Lee was nice enough to send out a few complimentary dishes from the kitchen in addition to what we ordered. The server told us the menu is intended to be one cold, one hot, and one entree per person, but I think I could have easily skipped one of the courses. The food was more filling than I expected. I ordered the heirloom tomato, ricotta dumplings, and brown butter bass. We were also treated to some sort of egg and basil oil goodness, marinated cucumbers, a beet dish (the only thing I didn't love), and this duck confit and pate sausage stew with honey crisp apples that transported me to swinging in a hammock in the French countryside.<br><br>Every dish had elevated flavors, even what sounded seemingly simple was excellent. The beet dish was the only thing that I felt wasn't executed perfectly - as someone of Ukrainian/Soviet descent, I take my beets pretty seriously. The flavors were great, but the beet was cut too thick and had a little too much crunch/rawness to it. Overall, HIGHLY recommend for a splurge/fancy date night.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KJBRbJsZ4YgJzCFI4tWzTg/348s.jpg", "caption": "The beautiful space"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EHd_DtlsrIQUJoR8lTtmOA/168s.jpg", "caption": "Heirloom tomato in smoked onion buttermilk"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/86mtt-tIErINn50EtFr1pQ/168s.jpg", "caption": "Ricotta dumplings - I could eat 5 plates of these pillowy marvels"}]}}, {"review": {"des": "Delicious fine dining experience. If it's your first time I highly recommend doing the menu tasting. Beware, it is a lot of food.<br><br>I've been to Alinea, and I think I enjoy Boka more. The food is just as delicious, the price is not as astronomical, and atmosphere is more comfortable.<br><br>I took my husband here for his Birthday and he was so surprised! The ricotta and black truffle dumplings were our favorite and the beef tongue!!<br><br>Honestly, everything was delicious. Service was outstanding as they explain each dish to you. We also had the wine pairing and they definitely complimented the meal we we're eating.<br><br>If you're looking for an upscale restaurant to celebrate an occasion with spectacular food and drinks, then come here immediately!! I can't wait to come again as it will be soon!!", "pics": null}}, {"review": {"des": "This place is really a culinary masterpiece.  Lincoln Park has some of the best food in the world (Alinea too!). Describing the food does not do this place justice.  Please make sure to look at the pictures.<br><br>The restaurant is just beautiful inside.  The chef gives you some complimentary treats that are essentially works of art.  I really enjoyed all the seafood I had there and drank a bottle of wine with my girlfriend now wife.  This place is so special and amazing.", "pics": null}}, {"review": {"des": "this is an overdue review. i had the chance to try boka during chicago restaurant week 2018 and it was amazing! definitely deserving of its one michelin star. it was a 4 course menu for $44; what a steal! <br><br>these were the dishes i tried:<br>1. cold<br>- marinated hamachi: fennel, grapefruit, horseradish<br>2. hot<br>- seared scallop: sherry, morcilla, celery root<br>3. entree<br>- slow roasted pork neck: turnips, prunes, black garlic<br>4. dessert<br>- dark chocolate: coffee-lemon ice cream, wattleseed caramel<br><br>everything tasted so good. the pork neck was crazy tender. the service was impeccable. the ambience and dim-lighting was cozy and romantic. it was honestly a perfect dinner. would love to come back and try them outside of restaurant week.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IFujxU8eAYrt1u0gMViuGg/348s.jpg", "caption": "Dessert during Chicago restaurant week 2018"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7s-DcQvXLd5uf3DqFkMi-A/168s.jpg", "caption": "Pork neck during Chicago restaurant week 2018"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/y9vllMLwG8DN0-xPnmtCOg/168s.jpg", "caption": "Seared scallop during Chicago restaurant week 2018"}]}}, {"review": {"des": "Fun birthday night out! We went for my husband's birthday and did the tasting menu with wine pairing. It was really a neat experience! They started us with some birthday champagne, and that set the tone for the night! The food was really tasty and the wine was really nice as well. They brought out a birthday candy with a candle and sent us home with some banana bread. <br><br>Service- this is true Michelin Star service to me. They walk you to the restroom, fold your napkins, know your name, explain the dishes, refill drinks quickly, etc., start with an aperitif<br>Food- mostly really, really good. They accommodated my dietary needs with the tasting. I really liked a lot of the dishes. Of the two desserts, only one was a hit for us though but we were sent home with amazing banana bread<br>Space- dimly lit and cozy; we had a cozy booth <br><br>We went to blackbird for my birthday, and I'd recommend both. I did enjoy the openness and being near the kitchen for blackbird, and they explained the wines more which I enjoyed. The service and environment here made it an intimate experience though. Both are great for a special occasion!", "pics": null}}, {"review": {"des": "Their service, food, and ambience completely lived up to its one Michelin star. I had a flight to catch after lunch here and one of their first questions was whether I had a time restriction. They explained every dish and if I had more time, I would have absolutely tried their tasting menu. <br><br>This restaurant is definitely on the pricier side with most entrees around $30-$40, which is to be expected for a one Michelin star restaurant. Although I wasn't super hungry when I came, the food was delicious. The fish that I ordered (can't remember the name of the dish) was so soft and flaky, it literally fell apart in my mouth. My boyfriend ordered pork which had a crispy skin yet very tender meat. The sauces for both dishes were extremely flavorful. <br><br>The Jasmine Citrus Mocktail wasn't too sweet but was a really good combination of sweet and tangy. I've never tasted something like this drink elsewhere and it was super refreshing.<br><br>100% would recommend to anyone in Chicago. It was truly an experience.", "pics": null}}, {"review": {"des": "Boka is one of the fine dining restaurants in Chicago that have earned a Michelin one star rating. We believe it deserves it.<br><br>The atmosphere is upscale but not oppressively stuffy. Business casual attire, for example, is encouraged but not required. Some people wear suits, some people wear khakis and a long sleeved shirt, some wear dark jeans and a sport coat, you get the picture. If you came in wearing beat up jeans and a t-shirt you're going to feel out of place.<br><br>The staff is friendly, attentive, efficient and well versed in the restaurant's offerings. The menu and wine list are comprehensive but not overly so. The only thing noticeably lacking are salads.<br><br>We had the grilled Spanish Octopus and Ricotta Dumplings as appetizers followed by the short ribs and duck. Everything we had was excellent. It was truly a wonderful dining experience. The attention to detail in the preparation and presentation of these dishes was evident and made our dinner that much more enjoyable.<br><br>The prices are where they should be given the quality of the food and overall dining experience. If you decide to go make reservations well in advance. <br><br>The bottom line: Boka is the type of restaurant that puts the \"fine\" in fine dining. It is sophisticated but inviting while the food is varied and absolutely outstanding. Highly recommend.", "pics": null}}, {"review": {"des": "My 2nd Michelin starred experience, and this one blew the first out of the water!<br><br>This was hands down the best meal of my life.<br><br>It feels glorious from the moment you walk in, the decor is just...divine!  The colors...lighting...artwork...all flow and mesh so well.<br><br>We did the 8 course tasting menu, which included a number of complimentary other bites alongside it.  It was so worth it.  It was a long meal, almost 3 hours from when we walked in until we left.  Was a great time though.<br><br>We opted for cocktails, instead of the wine pairing.  I feel like this was a great choice, their cocktails are very unique and delicious.  We each had three.<br><br>At the end, they sent us home with some house cooked banana bread that we enjoyed with breakfast the next day.<br><br>Would recommend this to anyone who is looking for a special dining experience!!!", "pics": null}}, {"review": {"des": "Boka deserves their Michelin Star. Their dishes are creatively prepared and seasoned. The desserts are outstanding. <br>We started with two appetizers. The foie gras was a bit disappointing - just a rather bland pate served with slightly toasted brioche. The grilled octopus was attractively served, but rather chewy. <br>Our entrees were the chicken, and the short ribs. Both were tasty and ample servings. <br>Our desserts: \"sweet corn\" and \"hazelnut\" were really the highlight of our meal. Could come back here again just for dessert.", "pics": null}}, {"review": {"des": "I did not realize It has been over five years since I dined here until I was updating the review.  <br><br>My daughter and I had a great time dining here again recently.   We shared foie gras torchon, ricotta dumplings, sea bass, short ribs, and Concord grape.  Everything looked beautiful and delicious.  We enjoyed everything however, the dishes were on the heavy side for my diet and I could have used some fresh vegetables or salad with it.  Excellent service.", "pics": null}}, {"review": {"des": "Got the chance to visit Boka for the first time- and they did not disappoint!<br><br>Decoration of the venue is a little dark yet inviting. Service was impeccable from the moment I walked in to the time I was getting the check. To start I ordered the Pie Maker cocktail, which was not too sweet and had the perfect amount of liquor; not too much where I felt I couldn't enjoy the drink. As I was enjoying my cocktail, I received a complimentary bite from the chef. I wish I could remember the name of it as it was very flavorful and aesthetically pleasing, and was served on a large piece of wood. <br><br>For my courses, I ordered the Dry Aged Beef Tartare, Ricotta Dumplings and the Roasted St Canut Porcelet & Crispy Belly. All were excellent but I think the beef tartare fell short, although I enjoyed the yogurt dollops the dish was served with. The Ricotta Dumplings that were paired with peas were absolutely delicious- it was a weird but wonderful combo, and the Porcelet melted in your mouth. For dessert, I had the Hazelnut & Coffee (recommendation from the waiter)... and this was the star of the show! So many textures and flavors- I'm not even a coffee fan but I loved this dessert. Crunchy and sweet yet smooth and cool with the mouse/ice cream, a great combination. As if I hadn't stuffed myself enough, I also received complementary truffles at the end of the meal. I could have eaten about 7 of these, not too rich or too sweet, just the perfect amount of bite!<br><br>All in all, with two cocktails and all the courses, the bill came out to around $130, which coming to a 7 year Michelin Starred restaurant is not too shabby.<br><br>Overall I highly recommend anyone who has a special occasion to check out Boka. Next time I will have to try the tasting menu and will update when I do!", "pics": null}}, {"review": {"des": "Another great restaurant in Chicago. The food here is making me love this city even more.<br><br>We had a reservation at 8pm on a Monday and had to wait till 8:15pm because the place was packed. All of the dishes were perfect with the exception of the asparagus soup which was a bit salty to my taste, although my wife disagreed with me.<br><br>We started with the soup as an appetizer and then had both the ricotta dumplings and the octopus dishes as secondary appetizers. They were both delicious but if you had to order only one I would recommend the ricotta dumpling.<br><br>For our main dish we ordered the duck which serves two. It was our best choice!!! The chef created three different styles of dishes from the duck. All of them were great.<br><br>Finally we finished off with both the hazelnut and the banana desserts. Both of them were delicious. The banana dish highlight was the chocolate flakes.<br><br>Would highly recommend Boka as one of your Chicago must do restaurants.", "pics": null}}, {"review": {"des": "EXCELLENT customer service.<br><br>They go out of their way to make sure you are happy with what you eat and have a good experience at their restaurant. In that sense they excel Grace big time (which was a three star Michelin restaurant).<br><br>They are a one star Michelin. I think it is well deserved. When you compare them with some other one Michelin stars like Sepia, or Longman & Eagle (still?), Boka is well ahead. In fact, no comparison.<br><br>I have been to Boka twice now, based on recommendation by my yelp friend, Kevin. Some of the dishes are spot on, and some others a mix.  Last week i had their 8 course menu which for the most part was pretty good. The lamb was a bit disappointing, a bit of a surprise but looked gorgeous.<br><br>Salt and pepper, done totally right. For that I have to congratulate them as so many chefs get it wrong, and over salt.<br><br>$125 for the 8 set course was more than fair. The wine menu is extensive (a bit too much?) but i was glad reading through it and learning from it.<br><br>I suggest if you go on a date or a special occasion ask for the main dining room. First time i sat there; second time they put me in the bar area (despite having tables available in the main area) which i did not care for.  <br><br>First time service by Emily and second time by Brandon was excellent.<br><br>I will be taking my wife and son there next time.", "pics": null}}, {"review": {"des": "I was in town for a conference so my friend decided to take me to Boka. He's a food connoisseur so I took his word. We tried to get seated earlier, but the restaurant was completely booked which was understandable.<br><br>We got seated in comfy leather sofa chairs. The waiter sauntered over and warmly greeted us. He passed out our menus. We decided to both get the tasting menu because it's not every day you can try everything at a Michelin starred restaurant. Also as a heads up, everyone at the table has to do the tasting menu if one person decides to do it. <br><br>I'm not going to spoil the menu, but I was surprised by the clarity and lightness of the flavor. I was most shocked by how full I felt after the eight courses. My theory is that the spacing between the courses must of filled me up. The star of the show for me was the steak, which was just the perfect amount of tender.", "pics": null}}, {"review": {"des": "3.5 Stars. Excellent ambiance. Friendly service. <br><br>Tried the 9 Course Tasting menu ($125). The dishes came out with beautiful and creative presentations. The ingredients were unique and fresh. However, after a few courses, they all started to taste very similar. My favorite was the egg amuse bouche. The whole meal took about 2-2.5 hours. <br><br>I think I'd rather order by dishes instead of doing tasting next time.", "pics": null}}, {"review": {"des": "Hubby and I came here after a matinee play. We were here maybe 10 years ago, and I wanted to try it again. I'm giving it 3 stars which is \"a-ok\". I loved my first drink and the bartender knew what he was doing. The drinks are creative. <br>The food is complex. Which can be a great thing. All the flavors worked well together. Hubby didn't like the mushrooms on his chicken... so I ate them. Yum. My octopus was very good and cooked properly so it was tender. My halibut was also cooked properly. I would have liked a bit more flavor from spices, but it was well executed.<br>My biggest issue is that it is a limited menu and could use a good salad.<br>I'm finding as I try more and more Michelin starred restaurants that sometimes it's too much about how complex the dishes can become. If that is what floats your boat, I'm sure you will rate this 4 or 5 stars.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XbAzyHYhG5YiV4PmVniPUw/348s.jpg", "caption": "Seared Halibut"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aQhePgSShRIBcPukiUVbUw/168s.jpg", "caption": "Chicken"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yWMNbIXXI6cGoZ12Diii2A/168s.jpg", "caption": "Octopus"}]}}, {"review": {"des": "Maybe greatness rubs off close by from Alinea, but Boka is an amazing restaurant that offers fine dining to an unpretentious crowd. If you have the opportunity, try to book a seat within the glass ceiling courtyard that offers black and white tile and green foliage that's reminiscent of alice in wonderland.  <br><br>The shaved foie gras was pure joy. The shavings were the right  to melt in your mouth. It tasted like crunchy peanut butter and blackberry jam. But then the aftertaste was like pepperoni because of the fennel. It has the vibe of stoner food, but in such an elegant fashion. It really took me by surprise.  <br><br>The Grilled Beets actually took me by surprise. They had this low tone meatiness to them that didn't feel watery or gritty.  <br><br>Marinated Cucumbers felt like what would have been made for King Solomon. It had a crisp, juicy refreshingness, while having some arid spiced creaminess thrown in the mix.  <br><br>Ricotta Dumplings were comfort food for sure. Super creamy and melts in your mouth goodness <br><br>Dry Aged Duck was some of the best Ive had. If you come here with more than two people, this is a must. Crispy skin, consistent fat, and tender meat leaves me craving for more.  <br><br>I didn't have a single thing I didn't like. Everything was a treat and I highly recommend everyone plan a reservation here.", "pics": null}}, {"review": {"des": "Meal was some hits and some misses and so was service <br><br>Carrots 4/5<br><br>Pasta - 5/5<br><br>Beets - 0/5 just terrible but I didn't have the patience to send it back, how can you send this crap to any table is beyond me <br><br>Chocolate desert - 5/5 <br><br>I asked the server if the chef can make soup or another pasta or gnudi without meat and he said no <br><br>Really you have no options as a vegetarian and you premake your soup?? Unacceptable", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/k3jg396jPSiJsOnM81Nc7A/348s.jpg", "caption": "Dark milk chocolate desert"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yoOUuumFS-0TwN3M8Yum3w/168s.jpg", "caption": "Yummy pasta, I could have eaten another portion"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OR-VTJnJChZj8tRxNnT53w/168s.jpg", "caption": "Gnudi was delicious"}]}}, {"review": {"des": "I'm going to make this short and sweet:<br><br>Food: Beautifully-plated and delicious. I had the crispy pork belly and enjoyed it. My wife had an excellent poached halibut. The bread and small bites they gave us before our appetizers were also incredible. <br><br>Drinks: Probably the most enjoyable part of the evening. I had the Fogwalker-- an incredibly smooth whiskey drink. Mmm. <br><br>Service: Several times during our meal, servers were badmouthing other patrons within earshot. Very unprofessional and uncomfortable-- also distracting from the dining experience. <br><br>Ambience: to the server's frequent gossiping, my rating is decreased.<br><br>Excellent food. Bad service.  3 stars.", "pics": null}}, {"review": {"des": "With a 4.5 star average on Yelp and a Michelin Star, maybe I came expecting too much? <br><br>Pros:<br>-The man serving the bread was awesome<br>-The 2 types of bread he served were yummy<br>-Great ambiance for a date <br>-Food was plated nicely and generally tasted good <br>-Complimentary birthday dessert <br>-Drinks were creative <br><br>Cons:<br>-Showed up early for our 8:15PM reservation, and ended up waiting over 30 minutes past our reservation time to be seated<br>-Once we were seated, staff made no efforts to apologize  <br>-Very short menu<br>-Striped Bass had a fishy flavor<br>-While food tasted \"good\", I expected to be more wowed given the prices<br>-Waitress mentioned that they cut plate portions in about half, looks like they forgot to cut the prices in half too...<br><br>Perhaps I went on an off night, but this place just wasn't up to the standards I've seen held by other Michelin starred restaurants.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ekQDM7FzOcin4P_hUjfPBg/348s.jpg", "caption": "Giffard \"Banane du Brésil\""}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nAAEBdXRBSE_V5SdzM6X0A/168s.jpg", "caption": "Hazelnut"}]}}, {"review": {"des": "A bit of a late review here. I first went to Boka almost 8 years ago! I finally came back this year for restaurant week and I'm not really sure what took me so long to return.<br><br>The space is beautiful and the service is great. I started off the with the juice box racer which enticed me by its unusual ingredients. I enjoyed it. The complimentary bread and butter was delicious. We had the marinated hamachi, roasted beets, seared scallop, slow poached egg, roasted chicken, grilled salmon and the banana and dark chocolate for dessert.<br><br>Dinner was enjoyable and the dishes were executed well. I highly recommend this place.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/B76VBSQsxsctb_YlRJXqzQ/348s.jpg", "caption": "Mint truffles"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xCfR7pN-9k66qOysR9cHnQ/168s.jpg", "caption": "Dark chocolate"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/N710qo7L_snyyBojmq6pkw/168s.jpg", "caption": "Marinated hamachi"}]}}, {"review": {"des": "Came in for the chefs tasting menu and left incredibly satisfied with a meal that was both delicious and interesting (lately it seems to be one or the other)...<br><br>Won't ruin the surprise of the course progression, but will say it was heavy on the seafood (which I like ) with a few favorites being the egg white foam amuse bouche that was light and herbaceous served with a mini citrus cocktail, the shima aji with bright citrus flavors that really highlighted the taste of the fish, and the scallops that were in a heavily (perhaps a tad overly) seasoned sauce but were expertly prepared... <br><br>All the courses were well sized portions that left me satisfied but not overly full at the end of the 9 courses... <br><br>The service was excellent, the decor was cozy, and the tasting menu was well priced given the quality of the dishes.<br><br>Will definitely be back for a repeat!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ve7HGrJpX6AOfc1ugmf-ag/168s.jpg", "caption": "Egg foam amuse bouche"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0isqAiZEm4EKbADLkbRFbQ/168s.jpg", "caption": "Shima Aji"}]}}, {"review": {"des": "I've gone here for restaurant week and a regular dining. I've been highly satisfied both times!<br><br>This place feeds you the right amount of full palette satisfaction without the bloated tummy feeling. I usually don't go for beef tartar but got it because of my friend and there are no regrets! The foie gras was to die for. I was hoping for the buttery fatty kind, but ended up with the spread on your toast kind. The foie gras combined with the jam was amazing. The pork was flavorful and tender. The halibut was just ok. Probably my least favorite dish. Additionally had the goats milk pavlova for dessert and it was a good combination of texture, taste, and aesthetics! I recommend getting a cocktail with your meal here too. <br><br>The service is excellent. I just wish the food was brought out sooner in between courses as I was there for about 2.5 hours", "pics": null}}, {"review": {"des": "I've recently visited this restaurant group's other new additions to their line up and my expectations have been far exceeded. Boka was the same story. Going into it I assumed it would be a bit scene-y, nothing memorable, and just a typical expensive Chicago joint. I was wrong (again), and this place was top notch. <br><br>Breaking this down by each area of the experience.. starting with service.. From the moment we walked in, the hostess was the nicest and most flexible human we could have dealt with on a busy Saturday night. Then we had a crew of a couple waiters/waitresses helping throughout the meal. Our main guy had a warm, friendly, and welcoming personality. He did well to gauge my mom and I's vibe and play to it. He had beer recommendations, timed the dishes well, and knew when to add conversation or hang back. Kudos to you, man. I wish I remember your name. <br><br>We did the 9 course tasting. But among that we had three non-listed courses so it ended up being 12. And the small selection of beer they had was really unique and impressive! (cocktails were good too, I tried the old fashion rendition they make). Another side note was that they had bread, with more upon request. It was nice to have for a tasting, I feel like tastings leave bread out at times, and I need those filler carbs!<br><br>Here are some highlights. The duck was unreal, so was the prime rib.  They both were large enough to actually eat more than two bites, and had the ideal amount of sauces on the plate to get an amazing bite each time. I would go back just to get either. One of the non-listed items was tempura asparagus and some tortilla chip+fish. Those were super good. Of the other fish we received, the raw tuna was the winner. The other were fine, but not a big highlight. A couple other creative egg/foam/gelo-like dishes came out that we enjoyed as well. <br><br>Dessert was interesting. I loved the mini ice cream on top of granola. But even better were the non-listed truffles, caramels, and banana bread. It capped off a great meal. Then I went home and ate more of the pre-wrapped banana bread you get to go. <br><br>I loved this place. The tasting was worth it too. I'd likely go al-la-carte next time, but the important part is that I WILL be back. More of the high end / Michelon star spots I go once and call it a day. Boka has so much more to offer from good drinks to hearty dishes. Its an easy restaurant for how much action goes on there. And they make you feel like you are exactly where you should be while you are there. Very impressed!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tXQLJUiuZHXpGen059WavA/348s.jpg", "caption": "Tempura veggies and some awesome chips+stuff?"}]}}, {"review": {"des": "This review is for the Restaurant Week 2018 menu. <br><br>Boka was probably my most anticipated reservation made RW 2018! We managed to get a dinner spot on Sunday shortly after Restaurant Week announcements were made. <br><br>Normally offering an 8 course tasting menu for $130, RW is a superb value with 4 courses for $44. Wine pairings (full pours with each course) was also phenomenal at an additional $33. <br><br>My boyfriend is a picky eater so lucky me - I got to eat almost a full 8 courses!<br><br>COLD<br>Heirloom Carrots: Sweet, caramellized roasted caramellized carrots. The sesame added a nice crunch and the sauce was perfectly balanced. <br>Roasted Beets: Normally not a fan of beets, I decided to give it a shot. I ate the entire plate. The cheddar was unexpected, but a perfect pairing with the avocado. <br><br>HOT<br>Seared Scallop: Was not the biggest fan of the sauce, but scallops were cooked perfectly. <br>Slow Poached Egg: This took me by surprise and was probably my favorite. Creamy parmesan sauce with chewy cavatelli with the most beautiful slow poached egg. <br><br>ENTREES<br>Roasted Chicken: Did not try this, but my boyfriend devoured it. <br>Slow Roasted Pork Neck: I apparently like prunes with my pork. The sauces and garnishment truly balanced each other well. <br><br>DESSERTS (unpictured because they were too delicious)<br>Banana: Like a deconstructed caramel banana sundae. There was just a touch of ginger? that was wonderful. <br>Dark Chocolate: The most refreshing coffee lemon ice cream on a bed of chocolate cake and mousse. I could eat a whole pint of the ice cream!<br><br>Very happy we had a chance to dine here during RW. Always a great opportunity to try amazing restaurants without breaking the bank. Thanks to Boka for participating!", "pics": null}}, {"review": {"des": "This review is for restaurant week 2018 - 4 courses for $44.<br><br>Overall, the experience was good. However, the portions were too small and the food not impressive enough for me to justify the price. And if you're coming during non-restaurant week, you'll definitely be spending more than $70/pp without drinks. So while it was great to try, I won't return as long as it's on my dime.<br><br>The restaurant itself has a lovely ambiance, just-dim-enough lighting, and great for a (expensive) date. If possible, I'd recommend requesting a table in the room with the green/foliage wall - I wish I had dined in there!<br><br>As for the food, I liked the following, in order of preference:<br>1) seared scallop 4.5/5 - perfectly executed and deliciously sweet scallop<br>2) dark chocolate 4.5/5 - with chocolate mousse and a caramel ice cream, this was a decadent closure to the dinner<br>3) vanilla bean 4.5/5 - just tried a bite of this but it's a yummy and a good portion size for dessert<br>4) grilled salmon 4/5 - nicely cooked but not too special<br>5) heirloom carrots 3.8/5- really delicious sauce on the carrots<br><br>Friends also liked the slow poached egg with cavatelli, tagliatelle, and venison (they had replaced the pork neck that's on their website menu)<br><br>Skip the marinated hamachi - it was slightly fishy. All other dishes I wish I had more of, but I barely wanted to finish the 3 pieces of hamachi I got, despite the small portion.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zwhUKpZy2FYJtjjioi5NdA/348s.jpg", "caption": "RW 2018 - vanilla dessert yum"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IYHBerQoLoGdsnUxvC5G9g/168s.jpg", "caption": "RW 2018 - chocolate dessert with mousse on bottom (really good!)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SQeznz5VT4iyKz29IKB3VA/168s.jpg", "caption": "RW 2018 - venison (too rare but friends said not bad)"}]}}, {"review": {"des": "My husband and I were fortunate enough to dine at Boka for my birthday and I can honestly say, it was an amazing culinary experience. Before you even enter, Boka has an endearing charm about it, with soft lighting and subtle decor. The ambience is perfect for a special occasion, celebration, or a night of just pure fine dining. <br><br>The service is excellent, and our server was very thorough and impressively well-versed on the intricacies of the cooking techniques of each item, as well as the specifics of the ingredients used. <br><br>We started out with the Dry Aged Beef Tartare, which we were hesitant about, but the server convinced us to try. And it was one of the best items of the night. Amazing meld of flavors and the smoked onion yogurt and cured egg yolk really worked well into the dish. <br><br>Next, was the marinated cucumbers, which presented themselves as a very nice change of flavor from the beef. Intermittently, the server would bring small tasting items that we hadn't ordered, which were really a nice surprise.<br><br>My husband and I shared our entrees: Brown Butter Roasted Bass and the Roasted Chicken. The chicken was delicious, but the real highlight of the night was the bass. It was a knockout: incredible flavors, buttery fish, and amazing harmony with the sauce. <br><br>We tried the hazelnut and coffee dessert - which was so delicious, particularly the wafer on it. And little did I know, for my birthday, they brought out an additional piece of cake with a nice birthday message on it. Amazing! After we were finished with all that, they brought out a little bite-sized coconut treat to eat. Suffice it to say, no one is leaving this place hungry. I absolutely adored the little touches and additional snacks we kept getting. <br><br>All in all, this experience was nothing short of 5 stars, and that is exactly what it deserves. Interesting tidbit: I was curious and looked into the name \"boka\" - no, it's not an exotic dish or a foreign word, but a combination of the last names of the founders: Boehm and Katz. \"Bo-Ka\". Strongly recommend you try this place. Forget the $$, it's all worth it for the modern-chic culinary experience and down-right delicious meals!", "pics": null}}, {"review": {"des": "Nice place. Some dishes were okay, fancy dining, pricey, main entrees are not meant for sharing. Scenery is elegant and on the romantic side.", "pics": null}}, {"review": {"des": "My husband and I ate here for our anniversary meal. Overall, we had a super fun time but it wasn't our favorite meal. <br><br>Service: amazing. The waiter definitely was on top of it and made sure we were enjoying our dining experience. If we didn't like something he would bring something else out. <br><br>Ambiance: dark, romantic, open, modern. Not very loud. Was nice for our anniversary. We had a late reservation so it wasn't very busy which was nice so you could talk and enjoy each other's company.<br><br>Drinks: They have a good selection of craft cocktails and wine. We had the gin boba drink and the other one that tasted like a manhattan. Both creative and good but wouldn't be able to drink more than 1. <br><br>Food: We were really excited for the food. We tried the tasting menu but it didn't quite live up to the hype. They did accommodate dietary restrictions and would give a new dish if you didn't like something. It was beautifully plated and each dish had interesting flavors but we found the flavors to be over powering and heavily salted so it was hard to eat. There wasn't a dish that left us wanting more. <br><br>Dessert: The dessert came with the tasting menu but it was just okay. Again a lot of flavors happening when it would have been great if just a little more simple. They also give you complimentary chocolates and banana bread to take home. <br><br>Price: very expensive. Which we have no problem with but we didn't think the price matched the food. <br><br>Overall, we had a really fun dinner and experience. However, we probably won't be back. And if we do, we would stick to the regular menu.", "pics": null}}, {"review": {"des": "Lovely food, great atmosphere and wonderful service. I had a graduation dinner for 4 booked weeks in advance, and added on a 5th person at the very last minute. They were able to accommodate, and we were seated in a wonderful dining room with incredible lighting. <br>I love the decor of the place! The lively green moss walls, the eccentric animal paintings, all of it.<br>The menu is simple but the food was delicious!<br>The Devil's Luncheon cocktail was beautiful, creamy and foamy from the egg white, and a perfect balance between strong and fruity. I loved it!<br>We shared the beef tartare, the veal sweetbreads, and the ricotta dumplings.<br>The tartare was very good. The onion yogurt added another dimension of flavor to the fresh meat component.<br>The sweetbreads were also incredibly cooked. They tasted like soft chicken, and paired very well with the peach. The sauce that came with it was delicious, though the grilled bitter greens were a tad too salty.<br>The ricotta dumplings were delightful! Loved the addition of peas and fresh greens on top.<br>Though the portions were small, they were sufficient to prepare us for the entrees.<br>I had the roasted bass, recommended by a friend, and it did not disappoint. It was flaky, and went along great with the charred cucumbers (no one's probably ever done that before).<br>I also tried a bit of the beef short rib entree, which was very tender, and porcelet and crispy belly.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RcqgguSrlEx5nj_Mvg43Pw/348s.jpg", "caption": "Loved my drink. The Devil's Luncheon"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/N0PPinWGjft4lCXdLE7qHQ/168s.jpg", "caption": "The Roasted Veal Sweetbreads were very pleasant and paired deliciously with the sauce."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ukeaKG9kh7Gmc95LIGUbjQ/168s.jpg", "caption": "These seaweed carrot apps were provided free to us! We were encouraged to use our hands. It tasted like a better version of a barbecue chip."}]}}, {"review": {"des": "I don't do a lot of Michelin Star dining, so this review is from a pretty average restaurant goer's perspective. <br><br>It was probably the best meal I've ever had.  I came in with my wife on a Saturday night for dinner.  The place was very busy, so a reservation is obviously your best bet.  Service was impeccable from beginning to end, and you can tell it is something the restaurant stresses. <br><br>Boka has an impressive wine list with bottles in everyone's price range.  To start we got the beef tartare. It's not something I order often, but I think it might have been my favorite dish of the night.  It was perfectly seasoned and the shaved carrots provided an excelente textural element. <br>Next we had the Spanish octopus and ricotta dumplings.  I think the dumplings won out by a small margin, but both were excellent. <br>For our entrees we got the beef short rib and the venison loin. The venison loin was cooked to a perfect rare and was paired perfectly with a few different sauces.  As good as the venison was, it was nothing compared to the beef short rib.  The short rib was so tender it was like butter, literally.  The seasoning was next level, and the whole dish was accompanied with cooked greens and a créeme fraiche sauce.  The greens alone could have been a dish, and every element on the plate was perfect.", "pics": null}}, {"review": {"des": "We were celebrating our anniversary and received complimentary glasses of champagne on our arrival. Great atmosphere - upbeat music, happy servers and customers, friendly staff. <br><br>We started with the grilled beet salad with sunflower seeds (fresh and really interesting flavors), fall mushroom tagliolini (amazing), ricotta dumplings with broccoli and goat gouda (creamy and delicious and I adore anything goat or gouda) and a bottle of Chianti. <br><br>For entrees: I had the brown butter roasted bass, which was cooked to perfection and lovely. However, I think I enjoyed the bites of my husband's slow roasted beef short rib entree more. Awesome sauce.<br><br>We ended with the dark chocolate mousse with espresso ice cream.<br><br>Highly recommend- great food, great service, lovely atmosphere.", "pics": null}}, {"review": {"des": "A great spot for a special meal. Craft, invention and adventure evident in every dish. Short rib was spectacular. Duck breast = perfection. Main-ingredient themed desserts were tasty but a tad underwhelming in delivering on the concept.", "pics": null}}, {"review": {"des": "This place exceeded my expectations & more! THE BEST OCTOPUS IVE EVER HAD IN MY LIFE. IT WAS LIKE BUTTER. I sat at the bar, and the bartender who took care of me was very pleasant and courteous. The ambiance is beautiful but not too dressy where you feel uncomfortable or stuffy if you're underdressed. They bring out two different types of bread and let you choose one or both if you'd like. <br><br>For dinner I had the halibut- I didn't care too much about the preparation, but it wasn't bad by any means. I would probably just go for something else next time. I didn't have room for dessert, but they bring out complimentary chocolates on a bed of cocoa nibs (which I don't know how when 5oz bag of nibs is $1k at Whole Foods.) <br><br>Overall, I would definitely recommend this place to anyone looking to have a great meal in Chicago!", "pics": null}}, {"review": {"des": "Shaved. Foie. Gras. Being an out of town visitor I had to dine at one Michelin caliber restaurant at the very least! This experience surely didn't disappoint me. I opted for the tasting menu which is truly the best way to experience all the wonderful flavors in one sitting. <br><br>Highlight dishes for me were the perfectly cooked veal, the oh so buttery shrimp, and the number one dish... the shaved foie gras. I had foie gras many times but this was definitely the best way I had it. At times, foie gras can leave a very fatty and almost too decadent feeling in your tastebuds, but as it was served shaven it was absolutely delish. <br><br>The reservations were met right on time and the staff was very attentive. Overall a very great restaurant with an overall excellence in all categories.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/REXOhZUEFVyZ2GuCv8s8hg/348s.jpg", "caption": "Amazing."}]}}, {"review": {"des": "We came here for our anniversary dinner and my goodness I have never experienced such attentive service even at other higher Michelin star restaurants. Everyone we encountered at this place was just so professional and excellent at their job. They also came across as genuine and kind, and I really appreciated that. Not a single little detail was missed. You get up to use the restroom and they will tuck your seat back under the table and refold your napkin- that's excellent service. You truly feel well attended to here. The atmosphere is relaxed and romantic and I would recommend everyone to book a special date night here. <br><br>The pacing of the food service was seamless and everything was exquisite to look at. We chose the duck for our main course, and it was superb. My favorite dish of the night was probably the dessert- it was a delicious interpretation of \"pear,\" and was truly a work of art.<br><br>While the food was delicious and every bite was a party in my mouth, it was the wonderful staff here who helped create an unforgettable experience.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/J7CLgTtkBAnsUTPcW9oe6Q/348s.jpg", "caption": "Beef tartare"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8uE7s8CmRDuGAdea_PlFNQ/168s.jpg", "caption": "Beet salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IK38ej-oQcLWGlTtBCK8sw/168s.jpg", "caption": "Amuse bouche"}]}}, {"review": {"des": "It was overall an enjoyable dining experience but there were couple of minor issues. We asked about the tasting menu but our waiter could not really explain what were being served that evening except some thing about beef tongue or could be a crudo, didn't really sound too appetizing to us. <br><br>Anyway, we ended up ordering ala carte and for two of us we shared three starters: scallop crudo; smoked foie gras and veal sweetbread. The kitchen even divided the foie gras and sweetbreads for us. All three dishes were excellent. A minor issue was both the scallop and foie gras came together with the foie gras divided and put in front of each of us so we naturally started with the foie gras which has a slightly sweet sauce of berry. The scallop on the other hand, the taste was subtle. If we had the scallop first instead, it would have been a more enjoyable dish.<br><br>For main course, we had the roasted duck for two. The leg meat in this case was confit as a side dish and it was very delicious. The duck itself has a very crispy skin and the meat was roasted medium. Since duck breast has a layer of tasty fat between the skin and the meat, after eating a few piece of the duck with the fat, it was a little too much so I started cutting the fat off and it tasted just as good.<br><br>We shared a goat cheese pavlova and the dark chocolate cake. The pavlova is to die for, the goat cheese was not overpowering at all and with the lemon sherbet, just try it. The dark chocolate cake on the other hand was just okay.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mnlkLC3j_oIFaaggoTrQ_w/348s.jpg", "caption": "The duck leg confit as the side dish."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/evwDmxo5eTn3qK22lrUdTg/168s.jpg", "caption": "Roasted duck for two, crispy skin and cooked medium"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UcIffxItMXUgcKyFY6pHwA/168s.jpg", "caption": "Foie Gras"}]}}, {"review": {"des": "My friends know that I love birthdays. I love their birthdays, as well as my own. And, I confess I've been celebrating for two weeks already and am looking forward to three more celebrations over the next few weeks. Yay! My family and friends definitely know how to spoil me. <br><br>What better way to celebrate than at one of the most celebrated restaurants in Chicago?<br><br>The lovely staff welcomed us warmly and led us to a charming room where one wall was completely lined with greenery. With the glass wall and roof, it felt like we were dining in an elegant orangery or a walled garden. <br><br>We had intended on trying the tasting menu but opted instead for the inventive dishes on the main menu. <br><br>To start, we enjoyed a carrot-flavored amuse, flavored with coriander. We caught up on the nonsense that is our lives as we enjoyed the warm multigrain and pretzel with caraway seed rolls with a mound of fresh, lightly salted butter. <br><br>The appetizer menu included both cold and hot options: beef tartare, octopus, and foie gras. The latter was deliciously-seared, buttery tasting, with juicy Concord grapes, and greens. In retrospect, I would have also liked to try their vegetables, especially after reading the glowing Tribune review.<br><br>For the main, I had the pork loin and belly. Both were mouth-wateringly tender, with the belly nicely crisped. I wonder whether the loin was cooked sous-vide. The pork loin was served with a sprinkling of mushrooms and cooked plums. It was such a nice pairing.<br><br>Of course, I saved room for dessert which was lucky since I had three of them.<br><br>I ordered the chiffon-like chocolate cake with Earl Grey ice cream. They made such a lovely and unexpected combination, especially with the sudachi and black lime citrus undertones. The restaurant also treated me to chocolate layer cake with chocolate pearls. It is like they knew me. As well, we were served olive cake and chocolate truffle mignardises to close out the meal.<br><br>Service was impeccable. The servers were friendly, efficient and professional.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tzfKhmoHFAeur-DF30AIjg/348s.jpg", "caption": "MIgnardises to finish off a perfect meal."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/acUlwC4fuAf1BxooDELUSg/168s.jpg", "caption": "Extra-special layer chocolate cake with milk and white chocolate pearls for my birthday!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mUH3wNAcL0Ew_un3x1Ek2w/168s.jpg", "caption": "Chiffon-like chocolate cake with Earl Grey tea ice cream."}]}}, {"review": {"des": "Excellent service, excellent food! Had a great anniversary celebration. The whole roasted duck is definitely worth it! Super crispy skin and perfectly mid-rare breast. Loved everything about the experience.", "pics": null}}, {"review": {"des": "Overpriced for the food. <br><br>Got the duck for two ($90). And to be honest, it was only a little better than the duck you can get at any Chinese restaurant. Except instead of $20 it's $90. However giving it 4 stars and not 3 because I ordered the laughing face (whiskey drink similar to an old fashioned) and it was probably the best old fashioned style drink I've had. my girlfriend got the short rib which was also amazing. I only had a bite too. Boka also gave us complementary appetizers (carrot tartare) and complementary dessert. Both great. Tbh just a little sad the duck wasn't impressive.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TRvDZ_SAHbWqNl_4_yEQ4A/348s.jpg", "caption": "Duck for two"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/f1ha3vOb--He4_wFhahAng/168s.jpg", "caption": "Complementary"}]}}, {"review": {"des": "What a great meal! Service, food quality, presentation, & wine selection-- everything was top notch! I had such a great time, and it is best compared to all the dining experiences I've had recently. Can't remember the last time I had an experience as great as Boka. <br><br>Our server, Ellen, was so kind & knowledgeable about the menu. She was very attentive and the team at Boka worked very well. Ellen made sure we had all that we needed and checked in frequently to make sure if we needed anything. <br><br>I dined with other 3 ladies for a mommy's night out and they put \"Happy Mom's Night\" on not just one dessert, but every single one of our dessert to remind us to have a good time! The wine pairing was well complemented to the food; I had to ask for the names of the wines since it was so good. <br><br>The marinated hamachi was the best part of my meal. I was worried I'd leave here hungry since I love to eat a lot, but the portions were well sized. I expected a \"pork neck\" to show up when I ordered but it was meat that was cut from pork neck, so it was less intimidating. <br><br>What a great time & meal. Can't wait to return! Best Chicago Restaurant Week experience!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BLgOh4snsAQcHiDqxoieSw/348s.jpg", "caption": "Restaurant Week 2018 Menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WVx4kYQHypzZaepRPrBNRA/168s.jpg", "caption": "Marinated Hamachi Restaurant Week 2018"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pQVrU9XgvUDN4O8458Rldw/168s.jpg", "caption": "Slow Poached Egg Restaurant Week 2018"}]}}, {"review": {"des": "Love Love Love  <br>If you never been here, please consider to visit during restaurant week or normally for a special event.<br>We tried the restaurant week menu both last year and this year, since the normal menu is a little expensive. For RW 4 course is just $44. Everything here does not disappoint us. <br>Roasted beets, marinated hamachi, slow poached egg, roasted scallops, pork neck, and three desserts are all delicious and yummy! <br>The prebread with butter and chocolate after dinner are yummy as well!<br>It is my favorite one start Michelin restaurant in Chicago.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ltTTwFS-utnR3S8813u-YQ/348s.jpg", "caption": "Coconut"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/42CgupoybonJgBIs_ACUfw/168s.jpg", "caption": "Broccoli Soup"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3dEPPiTXM8TFIplcewahxA/168s.jpg", "caption": "Coffee and Hazelnuts"}]}}, {"review": {"des": "Amazing amazing experience!  We went here for our 2 year dativersary and were treated like loyalty.  The food is amazing.  The service is amazing.  The ambience is amazing.  Everyone should go here!  I don't think I can eat out for a while now because what can compare to this experience?  Go here.  Make reservations.  They valet but uber/lyft might be cheaper.  I'm a vegetarian and tried the 3 vegetarian options -- every single dish was insanely delicious.  We also got a couple cocktails, they were yummy.", "pics": null}}, {"review": {"des": "Aaaaaaaamazing food!  I searched for a restaurant with hip, yet comfortable ambiance with great food and this place was perfect!  My husband and I came to Chicago from Houston to see a concert and we needed a spot for a date night for the second night we were in town and this was great!<br>Highlights were the steak tartare and the braised short ribs!  The pork loin and belly were great, but the loin part of the meat wasn't great, just okay.  Honestly it's just the cut of the meat.  ALL pork belly is much more preferred because it's so tender and flavorful.<br>They finished the meal off with delightful mini dessert cakes and chocolates!  What a nice and unexpected end to a lovely meal!<br>Also the service was on point!", "pics": null}}, {"review": {"des": "We had such a fun meal here two weeks ago. Augustus was our server, and he took such wonderful care of us. These digs are perfect - sumptuous but without pretension, cozy and warm against the cold Chicago night. We had a big table in the middle of a small dining room with chairs that swivel and lighting that made us all look ten years younger. I think I enjoyed the atmosphere, the wine list, as much as the actual meal.<br><br>We started with the sunchoke agnolotti (that was perhaps the best bite of the entire meal), the heirloom carrots and beets (which were actually from the entree menu), two different pieces of warm bread, and a delicious amuse bouche from the chef. The starters were good if small for our group. We probably should have ordered another agnolotti. <br><br>I think everyone at our table had something different for their entree. My brother and his husband split the duck which looked and tasted wonderful, my sister got the chicken, while two others ordered the bass and the monkfish; I had the scallops. I think we all enjoyed what we ordered, although I did learn I do not like maitake mushrooms, lol. My scallops were perhaps the best I've ever had. I usually don't order scallops because they're often slimy, but these were absolutely perfect. I think I enjoyed my meal more than anyone at the table.<br><br>We tired several desserts, but the pear and the dark chocolate were both out of this world. <br><br>The food was good, but it was the perfect company and conversation -- aided by swivel chairs, dim lighting, the freely flowing wine and Augustus' warm hospitality that really made this a five star joint.", "pics": null}}, {"review": {"des": "Had an amazing dinner at Boka. The building is very swanky and upscale. Seating is comfortable and the tables are spaced out well. The food was outstanding. The duck was truly special, especially the breast. The tomato cold appetizer was also a standout.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fMKIqycPKkcBAyXNOpvsmw/348s.jpg", "caption": "Grilled Spanish Octopus"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tBmCtcGWVdgTtoTZS_WzEw/168s.jpg", "caption": "*Shima Aji Crudo"}]}}, {"review": {"des": "This is the best dining experience I've ever had. My boyfriend and I tried the 8 course tasting menu. It was amazing! The food was so tasty and delicate. The waiter always explain what the dishes were and ask for our feedback. He even adjusted our menu for us based on our feedback. In the end, we each got a menu in a sealed envelope of what we tried that night. I was very happy with the experience!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2bsmoorRfhIDOQ9ftK0cIQ/348s.jpg", "caption": "The restaurant"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_Glf89UNNoXB7v8zmYOV-w/168s.jpg", "caption": "Dry aged duck breast"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cXPCYAFF1YMDeswuvIqZwg/168s.jpg", "caption": "Goat's Milk Pavlova"}]}}, {"review": {"des": "This is a review back from a visit in November 2017 and is as simple as a review gets.  Bar none... 5 Stars*****<br>Made reservations for my gf's birthday.  Boka printed specific menus for this special occasion.  So, as soon as we were seated, it was thumbs up from the start.<br>We couldn't have asked for a better overall experience!  From the front-end service, to the waiter, and the managers, Boka is the epitome of service.  The food was all well prepared, plated, presented and timed to perfection.  Their specialty cocktail menu should not be ignored.  If you choose pairings, the staff's recommendations are spot on; very knowledgeable and a true mark of a detail oriented business from the kitchen forward.<br>If you are thinking of giving Boka a try but are hesitating, you are just passing time and missing an excellent opportunity for a terrific experience at a Michelin rated restaurant.<br>I was so impressed on this evening, I am in the process of choosing another restaurant from the Boka group for this years birthday as well.  Thank You Boka!!!", "pics": null}}, {"review": {"des": "One of my most underwhelming dining experiences in Chicago to date.  2.5 months before my fiances 28th birthday, I started researching awesome restaurants in Chicago.  Boka had great reviews for their food and the inside looked super interesting and trendy.  I was super excited to book a reservation especially since they have a tasting menu. My fiance is an adventurous eater so I figured he'd love the tasting menu while I picked an assortment of stuff a la carte, much like our wonderful experience at MK 3 years ago.<br><br>After grabbing a few drinks at the Willow Room that's kiddy corner to Boka, we headed to our Saturday night 7pm reservation. When we arrived, we were ushered to the dining area in front near the bar which was super loud and had a crowd of people standing around.....not what I had in mind for an expensive dinner experience at a Michelin star restaurant.  We did think about asking for a different table, but not knowing what the rest of the restaurant was like, my fiance made the valid point that it's not a guarantee that the next table would be better.   <br><br>Our waitress showed up and started explaining how the menu works- smaller plates, typically order one item from each of the 3 categories.  That's when disappointment #2 happened, they refused to allow my fiance to order the tasting menu unless I got it as well..... so we didn't end up getting it even though he was really looking forward to it.  It just didn't make sense for us to get it because he loves seafood and trying different foods while I don't eat seafood at all and am picky in general. I understand it would have been a slight timing issue, but I wish they would have specified this somewhere online ahead of time or when they call to confirm the reservation.  <br><br>First the cold appetizers: I ordered two slices of tomato for $14.  It was like a decomposed caprese but instead of balsamic they had a plum vinaigrette/sauce that hugely lacked some much needed acidity. It also had pine nuts on it, which I learned that I do not like and could not get the flavor out of my mouth the whole night. My fiancé ordered the beef tartar which was flavorful and well seasoned.  I had a small piece and liked it much better than my appetizer.<br><br>Second the hot appetizers: I had the corn tortelli. Super delicate, but half way through it started tasting like a stick of butter.  My fiancé had the octopus and was disappointed because it lacked in flavor and meatiness. <br><br>Entree: I ordered the beef short rib, what came out more of like medium cooked steak cuts.  It was super smokey, I was just expecting something much more tender and fall off the bone rather than steak like.  I enjoyed the beet that was on the plate; however, thought the gem lettuce to be bit too bitter for my taste.  My fiancé had the scallops. He thought they were bland, lacked a good sear, and the sauce they came in tasted like ranch dressing which wasn't a good pairing with the scallops.<br><br>Dessert: we had the dark milk chocolate dessert, good flavor interesting texture, almost gel like.  I may be wrong, but I tasted a bit of orange peel in the chocolate, very yummy!  As well as the blackberry dessert with sesame.  The desserts were the highlight of the meal, great flavor and pretty memorable.<br><br>In all, both my fiance and I were disappointed.  It's not often we go to such acclaimed and recognized restaurants and spend this much on a meal.  Service was good, but I thought both the ambiance and food did not justify the price that is charged and for that reason I would not go back or recommend it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1VAR1nqYGJbCEBSVaVKfNQ/168s.jpg", "caption": "Scallops"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1q5stxRQMP9APVClp6rWig/168s.jpg", "caption": "Complimentary dessert"}]}}, {"review": {"des": "If you want an intimate dinner with exemplary service and outstanding food, then Boka is a perfect option.  My significant other surprised me by taking me here and it was such an amazing culinary experience.  One of the best of my life.  <br><br>You walk in and there are different rooms giving different vibes like a darker more romantic room, a room with plants, and an outdoor space.  We sat in the darker room especially because it was kind of chilly outside.  <br><br>The service was exemplary.  They were super fast with the water refills, changing our plates/silverware, and were very polite and professional.  Our server was also very helpful with the menu and gave us a complimentary glass of champagne for our celebration.  What a great way to start this meal.  While this place isn't ideal for vegetarians, they had enough pescatarian options on the menu to keep us satisfied.  I think they could benefit though from more vegetarian options.<br><br>Before we ordered, they served us a cute amuse bouche.  It was delicious and a perfect way to start off the meal.  We started with the cured fluke.  It was unlike anything I have ever had before.  They were really nice about splitting up the dish on separate plates because we shared everything.  The fluke had this jello-ey texture mixed in with pickled watermelon and radish.  It was quite a savory delight.  Our next course was the Fontina Tortelli, which was one of the highlights of the night.  It came with tarragon, corn, and shiitake mushrooms.  It was rich in a buttery sauce and the tortelli had fontina cheese oozing out of it.  I also loved the texture of the shiitake mushrooms.  The tortelli was fresh and I couldn't get enough of this!<br><br>They also served us some freshly baked bread with a savory chive butter.  Wow, I was in love with the Kalamata olive bread and the onion focaccia.  Both were warm and went so well with the chive butter.  It also went really well with the heirloom tomato dish, which was fresh and flavorful.  The tomatoes were fresh and diverse and they were served with pine nuts, black garlic, and plums.  Perfect balance of sweet with savory.  There was a really unique balsamic drizzle on top.  <br><br>When it came to the entrees, our next item was the poached halibut.  Another creative, unique dish that was absolutely mouthwatering.  The poached halibut was light and fresh with artichokes, zucchini, and green coriander.  I thought the artichoke was made to perfection and there was an interesting mixture of flavors.  Our last entree were the seared scallops which came with sungold tomatoes, corn, basil, and a lobster bisque.  Wow, this was also a highlight of the meal.  The lobster bisque was amazing and the scallops were seared to PERFECTION.  The sungold tomatoes were a culinary delight.  <br><br>We concluded the night with a dark, milk chocolate dessert, which had really unique flavors too.  It had earl grey ice cream which was really delightful with sudachi, which was kind of a sticky, sweet flavor.  I loved the earl grey ice cream because it balanced out with the sweet, decadent chocolate.  The chocolate was delightful and not super heavy.  They also served us complimentary chocolate truffles, which were mouthwatering.  <br><br>They did an excellent job staging all of the courses out so we didn't feel overwhelmed.  I cannot wait to come back here for another celebration.  Yes, this place is expensive but it serves high quality, flavorful, unique cuisine and provides exemplary customer service.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HxlWfGCsjfZJsxekjN0Y7w/348s.jpg", "caption": "Dark milk chocolate dessert"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wkdZWgEt8EJXa8xyBdrDog/168s.jpg", "caption": "Seared scallops"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/drx3KUc7wZaNuOpECjom_g/168s.jpg", "caption": "Poached halibut"}]}}, {"review": {"des": "Boka lives up to its reputation. The vibe, environment, service and food are all amazing! We didn't order any appetizer, but the kitchen gave us a complimentary dish. For entree, we got the Poached Halibut and Slow Cooked Beef Short Ribs. Portions look small but the food itself is actually pretty filling. The slow cooked beef is absolutely amazing. It's still tender and pink on the inside, but it doesn't taste raw at all. I have never had anything like this. <br><br>For dessert, we got the Hazelnut & Coffee, which is highly recommended by our server. It was good, but too sweet for me personally. They also gave you small treats after the dinner.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xPdcPZdlp8KUTFCPeZKKLQ/348s.jpg", "caption": "Treats after dinner"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jdJX0hFH5qJUSUo6EFAptw/168s.jpg", "caption": "Slow Roasted Beef Short Rib"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CzJ7RdO9CkSW9MYM7Tn2GQ/168s.jpg", "caption": "Treats after dinner"}]}}, {"review": {"des": "I would actually rate 4.5 if that was an option. The hot and cold appetizers were really delicious, a nice play of flavors with the ingredients that are used. We ordered the ricotta gnocci which had a nice hint of truffle. The texture was perfect with shaved parmesan and well cooked green beans sprinkled on top. I had the halibut as an entree and it was delicious, nice and flaky with a mixture of fruity jam and savory green beans. The reason for a 4.5 instead of 5 star rating is because of the variety of ingredients that are used in each dish. They seem to have a common theme in the types of ingredients that are used for garnish and flavoring - jam, green bean puree, and sprouts. Overall, I really enjoyed the experience and the dishes we had.", "pics": null}}, {"review": {"des": "Superb service, food, and cocktails. We had the tasting menu. It totally changed how I look at food. At Boka kitchen is full of artists. They work visually, with taste, smell, and texture. <br><br>From the first bite to the last I was amazed. Do yourself a favor and visit Boka for a special occasion.", "pics": null}}, {"review": {"des": "Absolutely incredible food and experience. I took my dad here for Father's Day and we did the 8-course tasting menu. They actually brought us a handful of extra \"courses\" to sample and everything we had was not only delicious but beautifully presented as well. They certainly live up to the expectation and it's amazing that they're right next door to Alinea, one of the most renowned restaurants in the world. This little section of Halsted St is a culinary powerhouse.", "pics": null}}, {"review": {"des": "We came here on a long weekend trip, and it was an experience all its own. Our party of four went with the chefs tasting menu with the wine pairings. Every one of the nine dishes was thoughtfully prepared and all the flavors were perfectly harmonized. <br><br>Apart from the food, the inside is beautiful. Their living grass/plant wall made me envious. Their staff was knowledgeable and thoughtful. They really ensured that we enjoyed our time spent there.", "pics": null}}, {"review": {"des": "One of the places that you're so consistently happy with that don't think to write a review each time. The decor, service and food are superb. The beet salad was my favorite!", "pics": null}}, {"review": {"des": "I came here for my birthday, and I'm so glad to have chosen this place to celebrate! we were running behind as there was delays on the L, but the staff was more than accommodating. To start, we got the beef tartare, which was AMAZING. The yogurt that went along with it was creamy, and mixed with the egg and beef it just melted in your mouth practically. Next, I ordered the chicken and my bf ordered the bass. Both were perfectly portioned and presented well. For dessert, we ordered the chocolate and cherry, and they also got me a slice of cake for my birthday! Overall, I had an amazing time here, and will definitely be back again! The restaurant decor is gorgeous, and the staff was amazing.", "pics": null}}, {"review": {"des": "This place has been on my radar for years and this year I finally scored a reservation for restaurant week. <br>It was everything I hoped for and more! If you come for restaurant week I highly suggest doing the wine pairing. I have never had wine and food paired so perfectly!! Ill be honest $180 for a tasting menu is not something I feel comfortable spending but you better believe I  will come  every year for restaurant week!", "pics": null}}, {"review": {"des": "Some time ago I decided to stop giving \"things\" as presents and give more \"experiences\". So, the wifey's birthday came along and we went to Boka for dinner.<br><br>We've always wanted to try one of these Michelin Star restaurants. Alinea is not easy to get into without advance reservations, so I ended up getting a table here at Boka.<br><br>The place is really good. I loved the whole decor, the ambiance, the lighting, the furniture, the bar. Wait staff was extremely attentive, patient, helpful and prompt from start to finish. Now, the food...<br><br>We decided to do the dégustation menu --sampling small portions of all of the chef's signature dishes in one sitting. They don't really tell you what you will get, but we got about 6-7 small plates throughout the meal: Apéritifs, entrées, main, dessert. I tried things I've never thought I would... the likes of duck (I had a pet duck growing up and that's why I don't eat the bird), oysters (texture grosses me out), and a couple more odd things that I can't really remember now --we went in Oct 2017. Wine pairing was not bad.<br><br>So, verdict? It was really good --like that, lower-case \"really good\", no exclamation points, no hashtags. Food was good, experience was very good, drinks were good. After a couple of hours and before we left for Steppenwolf for a play to finish the evening, we got the bill. Uh-oh. No bueno.<br><br>The bill, with tips and all, was over $500. Ok, I knew this type of restaurants were expensive, but I am not sure if Boka was $500-good. You know what I mean? It was good, but didn't really change my life. I could have gone for an equally satisfying meal for half that to other high-end restaurants I've been to. I have to say that they had the nice touch of giving my wife a little card and a truffle for her birthday.<br><br>Would I come back? I don't know. If I do, I'll try something à la carte rather than the dégustation menu. I am 100% sure that I'll end up more satisfied with that option. Props to the chef, and staff.", "pics": null}}, {"review": {"des": "I was here for an event and we had a number of the appetizers, salads, sea bass and dessert. All of it was great. Excellent service. Really nice atmosphere.", "pics": null}}, {"review": {"des": "A framed Bill Murray (in a Napoleon-esque outfit) hanging on the wall? Count me in.<br><br>Loved the decor in general. Comfortable swindle chairs. Neat black and white patterns on the ground. Tasteful chains on the lights/chandeliers. Grass/vegatation growing on the walls. Framed portraits of drawn animals wearing regal outfits.<br><br>The service was on point. Everybody was friendly and knowledgeable. My only gripe is that I felt a bit rushed at times. They kept clearing my friends' dishes while I was still finishing up my dishes. Oh, we came here for Restaurant Week.<br><br>I made strategic splitting alliances at the table, so I had a good spectrum of stuff.<br><br>COLD: The Carrots were surprisingly great. But the Marinated Hamachi was borderline bad.<br><br>HOT: the Seared Scallop was great. Though, I've rarely had bad scallops at any restaurant willing to offer scallops. The Slow Poached Egg was also bomb, with its butternut squash frothiness.<br><br>ENTREES: the Tagliatelle was great. Couldn't taste the kale, but the mushroom sauce was flavorful but not overbearing. The Venison was good (tasted way different then the only other time I've had venison, in a good way) and really rare, which I didn't mind. It came served on a decent sauce, but wasn't particularly flavorful otherwise (just good in a meat/steak sort of way). Plus, the sauce and the meat didn't stand out as really complementary.<br><br>DESSERT: the Banana was fine. I'm not much of a dessert guy, but it was somewhat underwhelming.<br><br>All in all, I thought it was a very solid restaurant week offering. Admittedly, the variety I was able to enjoy and the ambiance really overcompensated for the small portions and price. Typically, it would be hard to swallow the price, but I can definitely see why this would be a destination for a special night.", "pics": null}}, {"review": {"des": "\"One cannot think well, love well, sleep well, if one has not dined well.\"<br>  - Virginia Woolf<br><br>BOKA...BOKA...BOKA...oh how mesmerized, perplexed, infatuated, and enraptured I am with thee. It's restaurants like this that validate my decree proclaiming Chicago's dining scene has no rivals. <br><br>I finally got around to visiting BOKA on a weeknight. I had a reservation and - after arriving several minutes early - I was quickly seated in the stunning dining room with the famed moss-covered wall. Upon entry into the dining room, I was enthralled with the overall aesthetic of BOKA. Very modern, completely unique, and absolutely luxe in every manner. Characteristics that coincide with the dishes Executive Chef Lee Wolen and Executive Pastry Chef Meg Galus send from their kitchen. <br><br>After perusing the current offerings and contemplating whether or not I wanted to bother with the tasting menu, I decided to venture along the a al carte path; choosing two starters, one entree, and two desserts. Although this may seem like a lot of food for one person, the portion sizes (as they have been mentioned in several reviews below) are only somewhat less than ample in size. <br><br>My waiter Emily was fantastic with her presentation: thorough with her informative descriptions and recommendations. She was also great at checking in at the right times, and was genuinely invested in her customer service and approach. The same applies to all of the gentlemen who served my dishes and replenished my water glass. All inquired as to how I was enjoying the meal, which was my favorite so far, etc.<br><br>The food here is completely mind blowing. Chicago is blessed to have chefs like Wolen and Galus - whose dedication to pushing the boundaries in regards to ingredient pairing and presentation are starkly recognized dish after dish after dish.<br><br>I received 7 pieces of amuse bouche in addition to the housemade breads and butter (THANK YOU CHEF WOLEN) and each of them were absolutely spectacular. The first four arrived before and during my starters:<br>1) kumamoto oyster with celery, and japanese vinegar: stellar! oceanic and briny and uber fresh<br>2) corn tartlet: creamy, cheesy, crunchy. incredible<br>3) pig head terrine with rhubarb kosho: lightly fried and crispy and savory. perfection<br>4) marinated fluke with pickled watermelon, lemon verbena, and radish: STELLAR. Inhaled this<br><br>The ricotta gnudi here is an absolute MUST. The exterior of the pasta was thin and soft, and once broken, revealed a perfectly pillowy ball of fresh ricotta. Once exposed, the onion broth was soaked inside of the gnudi and the flavors when mixed created an absolutely orgasmic experience for my taste buds.<br><br>The fontina tortelli was quality. The housemade pasta had just the perfect amount of salt and bite, The fresh fontina was salty and tangy as expected and once paired with the sweet, creamy corn...altogether it was equally as orgasmic as the gnudi. Verdict? Chef Wolen and his team are masters at pasta making. <br><br>The pork loin and belly is probably the strongest entree I have had in a while. There was so much going on (ingredient wise) yet somehow, these items wed together, making a stunning dish. The smoky pork loin and belly mixed with the sour cherries and bitter chinese broccoli was just too beautiful for words. <br><br>After the entree I was sitting (practically stuffed, yet determined to still partake in sweet somethings) when all of a sudden Chef Wolen was standing next to my table inquiring as to how I was enjoying my meal thus far. We spent a good 10 minutes conversing about the restaurant, the dishes I had, and our mutual excitement for Somerset (his 2nd restaurant opening in September). What a treat!<br><br>Not at all ready to end my experience at BOKA, I was ready for my two desserts.<br><br>The chocolate creme brulee was absolutely impeccable. The brulee was so dense and full of chocolate flavor, and mixed with the smoked almond ice cream and sweet and sour cherries...I was convinced I had died and gone to culinary heaven. <br><br>I felt similar with the apricot dessert. Apricot is such a hit or miss fruit for me and I was nervous when I ordered it. However, I am glad I did. The apricot was fresh and juicy, and the creme fraiche and apricot sorbet added just the perfect amount of citric acidity the dish needed when paired with the naturally super sweet apricot bits and honey.<br><br>The last 3 amuse bouche were the perfect little bites to end my night:<br>1) chocolate truffle with strawberry/rhubarb and vanilla compote inside: divine<br>2) chocolate filled coconut/almond dacquoise: pretty good (honestly not my favorite)<br>3) olive oil cake with raspberries: heavenly<br><br>All in all, I was very happy to have ordered a la carte. I ended up receiving right around the same amount of food as the tasting menu, but I was able to pick the items I knew I would enjoy. <br><br>This entire experience changed my life. Consequently, BOKA has easily secured the #1 spot on my Top 10 Favorite Restaurants in Chicago list.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GYf_KIHvljpvsK5qZ5oavw/168s.jpg", "caption": "current dessert ment"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vo6g5_LdKD5tff8dGs1HfQ/168s.jpg", "caption": "amuse bouche"}]}}, {"review": {"des": "Oh boka what can I cat about this magical place. I thoroughly enjoyed my experience and yes it was an experience. I felt undress because this is a fine dinning dinner place. My boyfriend took me here while we were in Chicago without telling me how nice it is. The food is small very small , but surprisingly it was filling and flavorful. I have never had food with so much flavor in such a little meal. They give you kitchen samples and bread. Then you move on to appetizers and meals. At the end you are satisfied and happy you came. Honestly this place is for special occasions . The ambiance is very tasteful and inviting . Dimmer lights and beautiful seating. The waiters are very observant! It was overall a great experience ! Thanks to babe !", "pics": null}}, {"review": {"des": "Boka did a great tasting menu for restaurant week. I went with a group of 4 so we were able to try all of the dishes. I really enjoyed every dish that we had. The service was a little slow, but I think that was because it was restaurant week and it was quite busy. I am allergic to avocado and they were able to accommodate taking it out of the beets dish in the first course I ordered. I love beets so I'm happy they could do this. For the second course I had the egg. It was a very unique dish and more of a pasta dish which I wasn't expecting, but it was a nice surprise. The chicken was great, but a very small portion. I enjoyed all of the desserts that we ordered. I definitely want to come back here to try the regular menu. They weren't offering it during restaurant week!", "pics": null}}, {"review": {"des": "Restaurant week 2018! We had the $44 4 course dinner set and everything was delicious starting from the bread! We came in three and it was just about the right size of a group to try everything on the menu! I started with the beets for appetizer and it was a bit salty. Texture wise it was great and I liked the crunchy peanut on it and the avocado mousse. Next I had the seared scallop which was delicious, seared right to the point. For Entree I had the grilled salmon. It was so soft and fresh and went well with the sauce. Only wish the skin was more crispy. For dessert I had the vanilla bean. Sooo good! The coconut foam together with the rich vanilla ice cream, along with the sour and a little bitter taste provided by grapefruit, great layers of deliciousness. Also, I got to try all three dessert and all of them were great!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NNJDXIracnxHlk4el9NFeA/348s.jpg", "caption": "Vanilla bean"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/j1KIQ5GYYqk2wafWUCglaA/168s.jpg", "caption": "Tagliatelle"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/22JN30vYvz1GJZo1mA68uw/168s.jpg", "caption": "Banana chocolate dessert"}]}}, {"review": {"des": "I was here for a private event. We rented the entire restaurant and met with the chef Lee Wolen as well as the new pastry chef Meg Galus. So this review is perhaps not representative of the usual experience here. <br><br>It was a five-course meal that was well worth the Michelin Star. I loved how each course was paired with a perfect wine for the dish. <br><br>1. Shima Aji: delicate pesce crudo, mild flavor. (2014 Chenin Blanc)<br><br>2. Fontina Tortelli: powerfully flavorful (squash-based sauce). Everyone at my table quite enjoyed it. (2006 Viura)<br><br>3. Slow Roasted Beef Short Rib: thick and rich texture, smokey and savory flavor. (2013 Cab)<br><br>4. Brie Chevre | Haus Cheddar: brie and cheddar with fig and onion jam. I personally loved the port pairing (\"Lote 601\"); extremely, almost sinfully sweet. <br><br>5. Pear: ice cream on crepe, light and buoyant. (2013 Muscat de Beaumes-de-Venise)<br><br>We also each received a complementary chocolate bar that was made right in front of us by chef Galus (I haven't eaten it yet so I can't review that), plus a signed copy of the menu.<br><br>It was a very pleasant evening. One thing that popped out to me about this restaurant was actually the service. I can't give enough credits to everyone who worked there: they were kind, helpful and professional beyond expectations. <br><br>I hope to come back for special occasions.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/O5W-yOXpG9ajlbR2js5Riw/168s.jpg", "caption": "House-made chocolate"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tHlw4LV4tuFHhP2nBOlkdA/168s.jpg", "caption": "Pear"}]}}, {"review": {"des": "We were able to get into Boka last minute thanks to our helpful concierge.<br><br>We booked for a 9:15 and were ready for anything that they wanted to send our way.<br><br>Based on server recommendation- we chose the roasted duck with came with a creme confit. It was amazing!<br><br>My next favourite was the cherry Gazpacho- which was an excellent acidic and sweet based combination.<br><br>We also ordered the aged beef tartare and umami<br>Noodles.<br><br>The umami noodles were delicious. <br><br>Ambiance is great, and their craft cocktail program was also fantastic.<br><br>I chose two different cocktails with my favourite being the scotch cocktail.<br><br>Highly recommend!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qMqV6aQAvEaGq9qqe323LA/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GE0-GG-9sb9IP2xXkNUPvg/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "We came here for drinks after arriving early to a nearby reservation. We were seated quickly and brought drink menus. The drinks all looked inventive and creative, and we appreciated that they had some good choices for mocktails and non alcoholic sodas, as a few of us in the group weren't able/did not want to have alcohol.<br><br>I got a simple sounding elderflower soda, which was exactly as promised. Light, sweet, and very refreshing! My friend got the orange blossom & honey mocktail - was also very refreshing!<br><br>The other two in the group opted to go straight for the cocktails. One went for the Thirty Knots and the other got the Autumnal Ashes. Both cocktails were well balanced - strong enough to taste every ingredient but not too strong. <br><br>If we are ever in Chicago again, we'll be sure to try the food! It looked delicious as we saw the staff carrying small plates around. The only quirk was that there seemed to be an unusual amount of items being broken. I think we were there about 30-40 minutes and heard 3 dishes break. I doubt it is that common of an occurrence (especially given how nice their glassware is), but it was interesting for us to note.", "pics": null}}, {"review": {"des": "Had the best, most incredible experience at Boka! 5 stars all around for both food, drinks, and service. We came to celebrate my mom's birthday and did the tasting menu - so many creative flavors and different textures. I loved it. My mom was really freaked out by the beef tongue and refused to eat it. Our server noticed and brought out a substitute course. I was very appreciative of this! This has been one of my favorite dining experiences, and I definitely hope to be back!", "pics": null}}, {"review": {"des": "BOKA, definitely is a one of a kind restaurant when it comes to their menu. It is a short list full of mouth watering foods that it was hard to pick out what to try. Although we did not have reservations in advances, they were able to seat us at the bar which I did not have a problem at all. The bartender was knowledgeable, friendly, and talkative which was great especially when speaking about the menu. <br><br>I forgot what we started with, but it was in a egg shell with a perfectly cut circle top. Seriously, how is that even possible? (Okay, I am sure it is possible, but you get my drift.) It was delicious with a lot of texture to it. Creamy delight I should say. I did have to question how to eat it. Do I take it like a shot or scoop it out. Don't be afraid to ask. Haha<br><br>Next the octopus came out and it was beautifully plated. Now, the thing I am used to is that octopus is usually tough, chewy. Not this one! It was surprisingly light on chewing and delicious. Surprise surprise!<br><br>We order the scallops and short ribs were, my goodness they melted in your mouth. One the presentation was on point, but the food made up for it. Our waiters knew the dishes so well that every time they came out with a new dish, they explained it which I give kudos to them for. Anyway, back to the food! Scallops melted in your mouth with how soft it was. Short ribs were SO SO SO SO tender. My goodness, I was in HEAVEN. <br><br>This is got to be one the better restaurants in Chicago that I would love to come back for special occasion. The staff was friendly. The food was to die for. What else can you want?", "pics": null}}, {"review": {"des": "What an excellent meal here and the signature duck breast for 2 was off the charts good.  Wow, we had a serious foodgasm eating the duck.  The service was excellent and the space is very comfortable.  What an excellent place for a meal in Chicago.  Don't miss it.", "pics": null}}, {"review": {"des": "Made a res via opentable for my boyfriend's birthday in conjunction with our anniversary!<br><br>Food: FYI, they only allow the tasting menu if all parties get it. Disappointing, because I really wanted some dishes on it... womp.<br><br>- Bleeding Heart, Albina's Highball, King of Blue: all enjoyable cocktails<br>- Roasted Octopus: 5/5. Ordered this to share. All the ingredients marinated well with the charred octopus. Highly recommend.<br>- Risotto: 3.5/5. The chef kindly allowed us to order this off the tasting menu after it piqued my interest. However... we both found it incredibly salty...<br>- Seared Scallops: 5/5. Seared perfectly.<br>- Grilled Bass. 4/5. The fish itself was tasty. The charred eggplant sauce was too smoky and burnt to my tasting though.<br><br>Service: Attentive. They kindly brought us chocolate cake on the house for my boyfriend as well as chocolate treats to celebrate our anniversary! One annoyance was that my boyfriend's seat got kicked at least 5x, even though he was scooted as close to the table already...<br><br>Ambiance: Romantic and dimly lit. <br><br>Food was good, but was honestly expecting more for a 1-Michelin star restaurant!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0oR-pTGycp2dqk55OV5_Ig/348s.jpg", "caption": "Complimentary snack"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pvUdyxn1bgMU8nIoERTmZg/168s.jpg", "caption": "Risotto"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zET_4ZWOnAhQ-RD_BRuLBw/168s.jpg", "caption": "Roasted Octopus"}]}}, {"review": {"des": "There's just no way to go wrong here! From the amuse bouche to dessert, the food is off the charts. The complexity of flavors is unmatched. We dine out a lot and are often impressed, but this place is truly remarkable. If you're considering a steak house, try this instead. Steak, potato, spinach - not overly complicated, but the many ingredients in Boka's dishes create a masterpiece your taste buds will never forget.<br><br>Like our last visit, I highly recommend the vegetable dishes. Literally, on our way there, my husband said he didn't like beets. He loved their beet dish! Try it, you'll be surprised. And the chocolate and cherry dessert was outstanding.<br><br>Jack and Jason took good care of us, asking about dietary restrictions, offering to customize as we wished. We were also impressed by their mixologists. I told them what I like in a beverage and they whipped up something that perfectly fit the bill.<br><br>This place offers a great opportunity to get dressed up and have a special night out.<br><br>Overall, six stars.", "pics": null}}, {"review": {"des": "Went for party of two; was able to make a last minute reservation calling maybe five days in advance. The venue was dark though. <br>We ordered ricotta dumplings which is good for cheese lovers, personally was too much cheese for me. Beef tartare was really tasty esp w all fresh vegetables. <br>For entree the slow roasted beef was exceptional besides the asparagus which was a bit too charred and the porcelet was good but I could have done with less sauce,  it was a little bit salty. <br>The dessert was my least favorite. The goat's milk Pavlova is definitely an acquired taste because of the sour blueberries. The taste did grow on me eventually. <br>Service was good and everyone was friendly. <br>Overall, I would definitely go again but order a different dessert.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AhWPPafUWbim81Di9s-Lgg/348s.jpg", "caption": "Roasted St Canut Porcelet & Crispy Belly"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KofxJCfQwJ3Kohc7bMpPRg/168s.jpg", "caption": "Goat's Milk Pavlova"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uywn_me1fY6s3HjPWgbZJA/168s.jpg", "caption": "Dry Aged Beef Tartare"}]}}, {"review": {"des": "Well, what can I say.  Boka definitely deserves it's Michelin Star rating. I had booked this reservation more than a week in advance, and even so we only got a late reservation (9:15PM) on Saturday evening. <br><br>We were happy that unlike many restaurants in Chicago, we were  seated at our table promptly upon arrival. The ambience is interesting. Dark wood everywhere rustic and refined at the same time. <br><br>Our server was extremely polite and helpful. We decided not to do the tasting menu and went the a la carte route instead. They recommend getting one hot appetizer, one cold appetizer, and dinner because the dinner portions are small. However, I must say this was not necessary. I think one appetizer and a main course for a person would have been fine. <br><br>The wine list here was extensive. Unfortunately, we couldn't converge on a bottle, so we went with individual glasses instead. The Italian wine I got was fabulous, smooth and not overly tart. My wife and daughter liked their wines as well. <br><br>For the cold appetizers, the server recommended the heirloom carrots. We got them after some hesitation but they were surprisingly good. We also got the asparagus which was covered with caramelized brioche and foie gras shavings --- delicious. In the hot appetizers,  the octopus was the star of the show. We also got the Broccoli Agnolotti, which came with goat gouda, lemon, black truffle and the  \"sweet breads,\"which were delicious. <br><br>For dinner, my wife and I shared the duck (it is meant to be shared by two). This was quite possibly the best duck I've tasted, I would say comparable to the orignal Peking Duck in  in Beijing, but this has a different flavor. They bring it to the table whole, and then they cut it up rather artistically served with foie gras sausage, spring onion, and rhubarb. The skin is made nice and crispy and tastes heavenly. The legs are made into a confit and served on the side. If you have to order just one dish on this menu, I'd get it, you won't regret it. The server recommended the roasted chicken, which was a pretty big meal and my son liked it a lot. I tasted it and it was very good, but I'm glad I got the duck :). The roasted lamb loin is also delicious here, and it's served with celery, artichoke, and glazed tongue. The portion of the lamb was surprisingly small though. <br><br>It was overall a perfect evening. I don't think I disliked any dish at all, and there were more than a couple that were simply sublime. This is a rather pricey fare, but I think it was worth the indulgence :).", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/q6xMAb2ww-027MUL4523lw/348s.jpg", "caption": "Perfectly cut eggs"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/29ITDZ5DMwhPrzo2dvw_Ww/168s.jpg", "caption": "Hot and cold appetizers. The octopus was amazing"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AFeBN4U5afT-RgaVK9geKw/168s.jpg", "caption": "Duck for 2 before being carved"}]}}, {"review": {"des": "Boka has been on my list of my try restaurants for sometime now, but I just hadn't gotten around to coming here. Thankfully, last Friday was date night and we made the choice to dine at Boka. I could slap myself silly for waiting so long to experience the awesomeness of Boka. This place exceeded my expectations and delivered on all levels - decor, service and food. 5 stars for sure. The only disappointment I experienced at Boka was when Chef Lee Wolen came out to the patio and spoke to two tables and then skipped over the rest of us. I guess we weren't considered VIPs.<br><br>While we may not have been considered VIPs by the chef, our server Alisandro made us feel special and gave us excellent service. 5 stars for Alisandro!<br><br>Food wise, everything we had was delicious and oh so pleasing. We didn't regret any of the selections we made. Round of applause to those working in the kitchen. <br><br>What we had:<br>* Dry Aged Beef Tartare - 4 stars<br>* Broccoli Agnolotti - 5 stars<br>* Roasted Spanish Octopus - 5 stars<br>* Roasted Sweetbreads - 4.5 stars<br>* Whole Roasted Dry Aged Duck for two - 5 stars<br><br>Dessert:<br>* Hazelnut & Coffee - 5 stars<br>* Warm Chocolate Cake - 4 stars<br><br>Hands down, Boka is one of the top 5 dining experiences I've had in my 10 years of living in Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pgaSFtqea7Ahy6eSpwc18w/348s.jpg", "caption": "Warm Chocolate Cake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/trGY5LzR48MFkcCxpMF7AA/168s.jpg", "caption": "Hazelnut & Coffee"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Xs68fhtgK5CeFVDcn99IUA/168s.jpg", "caption": "Dessert menu"}]}}, {"review": {"des": "Was actually easy to get a reservation day of, couple hours before dinner time on a Sunday night of what I thought would be a booked busy travel weekend - Memorial holiday. And, reservations anywhere else in Chicago are usually done way in advance.<br><br>heirloom carrots - I would never think to order carrots, anywhere but these were the BEST I've ever had and my favorite dish of the night<br>Beef tartare - with egg yolk, a tad bit salty but still liked this<br>marinated fluke - this dish threw me off as it was gelatinous, stuck to the plate lol so wasn't sure how to eat it or if that's what it was supposed to look like. AND didn't have much uni<br>beef short rib - well seared on the outside and melted in your mouth. but was a VERY tiny cut for the price<br><br>I cant remember the name of the drink I ordered but it was refreshing with mint, aloe and tiny clear boba pieces so really felt like a juice wasn't strong at all. plenty of back outdoor seating which was crowded and lively. very cute interior, quieter, better for an intimate dinner date.", "pics": null}}, {"review": {"des": "1001th review for my one year anniversary dinner :)<br><br>Boka is as fantastic as I expected. At least five people recommended this place to me, so I decided to try it for the special day. We ordered several dishes and all tastes amazing. <br><br>Beef Tartare is very flavorful, it's like fireworks in your mouth lol<br><br>Sweetbreads is our first try. Love the texture and the sweet and sourness lights up the flavor of the meat. <br><br>Highly recommended the roasted aged duck. It's the best duck (other than Beking duck) I've ever had. Will go back and try other dishes for sure.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OdiAH3F18XYD77OPMsW_gw/348s.jpg", "caption": "boba in the cocktail"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KUWNUf8AhzUM7PO3G_PBBg/168s.jpg", "caption": "\"Happy Anniversary\""}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0TE8jETIVQ-U_u7JKLg-lA/168s.jpg", "caption": "sweetbreads - amazing"}]}}, {"review": {"des": "Service is suburb here! Everyone is so knowledgeable and attentive. The scallops were my favorite; they were perfectly crisp on one side and came with a delicious sauce that made the dish even better. <br><br>Dessert was also incredible - I got something with pears, a crepe, pistachios, and sorbet. All the flavors and textures came together very nicely. Looking forward to my next dining experience here!", "pics": null}}, {"review": {"des": "Service: Our server was attentive and went over the dishes with us in detail, as well as answering any questions we had.<br><br>Food: I was recommended and had the opportunity to try their heirloom carrots, octopus, venison, and scallops. Honestly, everything was delicious. The carrots were roasted to the right degree of caramelization/crispiness, the grilled octopus was melt in my mouth tender, the venison bursting with flavor while being an extremely lean cut of meat. My favorite was still the scallops, which were complemented by an excellent garnish (watercress, I think?) and sauces. <br><br>Drinks: I had sips of 4 different pre-dinner cocktails which were all amazing (I recall mine had egg whites and smoked tea sprinkled on top). We had an excellent Barolo to accompany our meal. <br><br>I love eating good food, and it is clear there is pride in the quality and preparation here.", "pics": null}}, {"review": {"des": "Amazingggggg. Pretty much sums up our restaurant week experience tonight. I had high expectations and they were definitely met. The service was friendly and efficient, and the food was delicious. Boka is great at taking simple ingredients and elevating them. We loved all of the courses, especially the dark chocolate dessert and the salmon. It's a perfect special occasion place hidden away in Lincoln Park", "pics": null}}, {"review": {"des": "Great experience during restaurant week! Ordered from the restaurant week menu, in which the deal was $44 per person for a four course meal of small unique dishes. A great date spot (especially the terrace part of the restaurant) and fun drinks! I ordered the juice box racer (maestro dobel tequila, pimm's, grape, yogurt and sesame) and it didn't disappoint. Even the butter that came with our bread was SO GOOD. <br><br>But here's the real deal: heirloom carrots with sesame, buttermilk and dates. I was so excited to try these from all the pictures I was seeing and for not being a huge date person I loved it. My boyfriend got the beets for the first course and was also very good (I actually preferred his dish). For the second course I ordered seared scallops which were average compared to the slow poached egg my boyfriend got. I still dream of it. This is something you need in your life!! If you go to boka you NEED to get this. My favorite dish hands down. <br><br>Other notable dishes would be the slow roasted pork neck. I don't eat meat that often but the flavor of this was amazing. I preferred it without the prunes personally. I ordered the chicken with cabbage-very tender but okay presentation. For dessert I ordered the chocolate flourless cake with lemon ice cream but I preferred the banana dessert. <br><br>Overall I would highly recommend! First Michelin star restarting I've been to thanks to the great deal for restaurant week. Loved the atmosphere and service was superb.", "pics": null}}, {"review": {"des": "Delish! Beet entree is a great alternative to eating meat. My husband loved the pork belly. Beautiful ambiance, services is wonderful. Romantic, sexy spot for a date night.", "pics": null}}, {"review": {"des": "I love Boka! <br><br>Whenever I think of Boka, I have to remind myself that this place is right next to Alinea, and how hard it must be to compete with a restaurant like that. But then I go back and eat there and am just amazed how good everything is, and that Alinea is the one competing with a great restaurant. <br><br>They change their menu seasonally, and last time we went a lot of dishes were corn-based. While I am not a fan of corn at all, everything we had tasted amazing. <br>The chilled corn soup was probably one of my favorite dishes, and I'm not a fan of chilled soup or corn by any means, but again, this was a game changer!<br>We've also had the Tortelli, which were soft, and creamy and had corn incorporated as well. I think Boka is turning me into a lover for corn. It was so good, I wish I had seconds. <br><br>The staff is really friendly and knowledgeable but not the \"stiff\" kind you might expect from a fine dining restaurant. <br>They also have a cute and spacious backyard, which is the perfect setting for a calm and relaxing dinner.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RdZnCrym6NlHDGOLr6Ns4Q/348s.jpg", "caption": "Dessert"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WFVJkcnAeY2zr_UTPdUu4A/168s.jpg", "caption": "Pork belly and loin"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/H_qFQDUQ5gcd8UUlPZ3URg/168s.jpg", "caption": "Halibut"}]}}, {"review": {"des": "I went to Boka for my date with my husband in my birthday. From the moment we arrived the staff was extremely friendly. Because I am pregnant, they were very welcoming at adjusting my tasting menu to suit my dietary restriction. <br><br>The food was absolutely amazing! Posted a picture of our favorites. Also, mocktails were excellent! I had a few as I couldn't get enough of the excellent taste. <br><br>Well done Boka.", "pics": null}}, {"review": {"des": "Sweet soft octopus is the must get of this restaurant. Also tried the ricotta dumplings (chunky ricotta with a thin dumpling wrap), sea bass (pretty standard, the only twist were the black sesame dollops on the side) and the porcelet & crispy belly (delicious and well balanced with the crunchy + tender!).", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hdYGKv-tjdcpxY-_9qrpMA/168s.jpg", "caption": "Roasted St Canut Porcelet & Crispy Belly"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2zBfaWVjDw0Q1xfQXhAK8g/168s.jpg", "caption": "Ricotta Dumplings"}]}}, {"review": {"des": "Boka is my favorite restaurant when I come to Chicago. Menu selections are fabulous and always changing. Waitstaff gets a ten!!!  Love the atmosphere!!", "pics": null}}, {"review": {"des": "Wow wow wow.  I came here with a couple girlfriends to celebrate on of their birthdays.  I was in Chicago for the weekend, and my uncle (who lives there) recommended this place.  So happy he did.  I was a little apprehensive because being that I was on vacation, I only brought black denim jeans.  Wasn't an issue in the slightest (of course I was wearing a collared shirt as was everyone else).<br><br>So you walk in, and at the cost check they give you the cutest little skeleton keys for claiming them.  We were quickly sat outside on a covered patio.  The ambiance is just lovely, soft lighting and not too loud, with plenty of space in between you and the next table.<br><br>To start, they brought us some little bite sized sandwiches with something pink/orange in the middle.  Tbh I had no clue was it was, but it was amazing.<br><br>For our appetizers we ordered 2 plates of Spanish octopus, an order of sweet shrimp and the agnolotti.  The Spanish octopus was awesome, but the sweet shrimp was even better.  I could have ordered another for my entree and been just as satisfied.  I've never tasted anything like it!  The least favorite was definitely the agnolotti.  It was HEAVILY creamy on the inside and I felt needed something else to balance it out.  The serving is quite hefty, and my friend didn't even want to finish it because it is so rich.  The dish would be better with just a couple large ones imo.<br><br>For my main dish (because I forgot what they ordered) I chose the scallops.  Very very nice portions.  3 large scallops seared to perfection.<br><br>For desert we ordered their \"pear\" and \"banana\" and of course they brought a small slice of chocolate cake for my friend's bday.  I'm not a huge fan of fruit deserts, but these things melt in your mouth!  So amazing.  At the very end, they gave us little carrot cake and chocolate truffles.  I'm not a fan of carrot cake, but those chocolate truffles were probably one of the most amazing things I've tasted ever.  <br><br>I need to find another excuse to visit this place again.  It's just so damn good!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/izbEu6hF3aa5RP5yiihbOg/348s.jpg", "caption": "appetizers!  Sweet shrimp, octopus and agnolotti"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sHzvdSvvV1pRxNxLLNR1MA/168s.jpg", "caption": "Cocktails - my little mezcal with no garnish was stunning"}]}}, {"review": {"des": "Even though I made the reservation, the boyfriend did a good job spoiling me a bit with scintillating conversation and delectable bites to celebrate a recent promotion. <br><br>The place: sexy. Worth the 45 min Uber ride on a wet Chicago night. We were one of only a few tables filled when we arrived at 6:30, but it was packed by the time we left 3 hours later. Our waiter knew a shit-ton about the wine pairings. It didn't mean much to me but was still impressive. Great service. I am on the fence about giving it 5 stars but I guess there were a few bites that I didn't love love love, but 4.5 would be more accurate than 4.<br><br>The taste: we did the 7 course tasting menu and were surprised by a bonus course, and two more bites after the second dessert. It was expectedly indulgent, but actually a little too much food for this broad. Had to take the duck home (which they replaced the pork with since I don't eat pork) and it was definitely still good the next day. Best bites- the oyster in the beginning was actually really flavorful; the smoked beets, however, stood out the most...supremely unique and delightful. I couldn't eat all the fish but thankfully boyfriend was able to help me out. Everything was good; a few things were fantastic. Also got the fermented orange drink with ras el hanout. Was so interesting. Wish I was drinking one right now. The morrocan spice almost gives it the essence of being a cocktail, but it's alcohol free. <br><br>My face: Not a cheap evening but I was all smiles after such a lovely experience with my beau. With one basic wine pairing, a glass of wine, a cocktail and a mocktail, post tip, I think was around $440. Won't be doing that every week but was really special.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aUQcOUnhtdD8vooRTOGcAw/348s.jpg", "caption": "First dessert - rhubarb and vanilla Pavlova"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dUP3nommW28UTvDPcUX2tw/168s.jpg", "caption": "Dessert - earl grey chocolate ganache"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BWOxYYsiMMBapXoGFQmvPA/168s.jpg", "caption": "The first course- pain perdu pumpernickel style and I forgot the other bite...sorry"}]}}, {"review": {"des": "Ambiance: 4/5 ... Cool rooms... Loud, which is okay... An odd collection of folks... Some way more casual in dress and behavior than expected for a top restaurant.<br><br>Staff: 3/5... This of course is a very small sampling since we only interacted with a few... Hosts were fairly indifferent (3/5)... Server was aloof, awkward, and maybe high (2/5)... His helper was awesome (5/5)<br><br>Food: 3/5... We had the tasting menu... Everything was good... But all told it lacked thought and imagination and started to get old... Instead of varying styles and experiences dish to dish, all but two dishes were meat and it went light white fish,  medium white fish, heavy white fish, then light red meat, medium red meat, and heavy red meat. This is over simplified but is essentially the experience. We also got the wine pairings and it was equally uninspired... Light white up through rose and into reds... They matched the food, but only highlighted the lack of creativity.<br><br>Now before I get skewered, the place is nice and the food is good quality... BUT... compared to its ratings and for the upper tier cost, the experience overall was fairly disappointing.  If we went back we would order if of the menu and not have such high expectations.  <br><br>So without expectations and build up, the experience was 4/5... Expecting one of the top 5 food experiences of Chicago along with top 5 cost, drops it to the 3/5.", "pics": null}}, {"review": {"des": "There's a beautiful atrium you can dine in and that really sealed the deal for me. It's gorgeously designed and very romantic. I had the fish and it was absolutely decadent and flavorful, not over cooked like most restaurant fish plates. Our maitre'd was wonderful and patient.<br>Cocktails were made pretty well, but the selection wasn't my favorite.", "pics": null}}, {"review": {"des": "Booked a table for 2 for the tasting menu at 8:30 pm for my husband's 30th and we weren't seated till 9. Also, the hostess asked everyone else who came in to have their coats checked but somehow forgot to ask us. After reading such rave reviews about this Michelin starred restaurant, this was honestly an unpleasant surprise and unbecoming of such an establishment. Thankfully, the food made up for it though. And our waiter was awesome, remembered all of our dietary restrictions and ended our meal with an extra sweet treat for his birthday. My only critique for the tasing menu is that 4 out of 6 of the savory dishes had the exact same consistency. This didn't effect the taste but it did leave you wanting more of a surprise out of the next dish coming out the kitchen. <br><br>Def worth a try.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sqVxGeHmupY20jeiZ4_dBw/348s.jpg", "caption": "Mushroom risotto, amazing!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8CN8IjCtXvlmJzcxuxGT2g/168s.jpg", "caption": "Venison from New Zealand. Perfectly cooked and full of flavor."}]}}, {"review": {"des": "I went to Boka on Saturday night after doing a quick search on Yelp (and not reading a whole lot...) Fantastic food, service, ambiance... Ok, my confession: I didn't know it had a Michelin star until 24 hours later. (D'oh!) I was blown away how outstanding everything was and thought: *man* this place is _crazy_ good... I'm going to write them a *super* Yelp review. Huh: so here I am. First, just go and have the meal of your life. Second, the bar has open seating as well as two booths. If you're there early enough you can be seated and blown away. I'm laughing at myself: \"Hey! 4.5 stars on Yelp-- let's check it out...\"", "pics": null}}]}