{"name": "bombobar-chicago", "reviews": [{"review": {"des": "I first saw BomboBar on Instagram, and was taken by their amazing, delectable pictures. When we were the in the area, we realized we had to prioritize a visit and had some dessert for a first course of dinner, knowing we had a three hour wait at Au Cheval down the block. <br><br>This place actually was just as crowded and had a line out the door. But it isn't a true building. It's a window and they have a plastic covered \"indoor area\" with a small amount of seating. Just to be aware of, if you're visiting in cold weather.<br><br>The lady who took our order was very helpful but brisk in the way that she had to move people along to keep everyone happy. They pass menus along while you're waiting in line, so people should be able to figure out their order relatively quickly.<br><br>We did the S'mores Hot Chocolate but substituted coffee and it tasted incredible. What a treat! We also got the salted caramel crisp gelato with a mini bombo on top. The crispiness was a great tasty addition, and we really enjoyed that as well!<br><br>Can't wait to come back and try another delicious confection!", "pics": null}}, {"review": {"des": "COME HERE FOR THE CLOUT, not the donuts or desserts. Personally I didn't think the hot chocolate was bad, but it's not quite worth the cost, even with the additional toppings. Then again, it's worth coming for the photos and the experience of having such a lavish hot cocoa. <br><br>It's okay, no one will know -- just take the picture, caption something along the lines of \"Chicago stole my heart\", and hope no one knows the intense amount of editing that went into your photo (see mine for reference)", "pics": null}}, {"review": {"des": "Okay, there are lots of reasons for my rating, however, I will start by saying yes the pictures are real. I want to give them a 2.5 but I cant.<br><br>We were a group of about 5 people, some ordered the naked (which is just hot coco with whip cream) and others ordered the others ordered the S'mores with baileys.<br><br>The group with the naked hot chocolates received theirs in a timely manner, however, the others (3) of us waited almost 30 minutes for our hot chocolate to come out. I was asked if I wanted something for the wait and declined just wanted the items we ordered. When our order was up realized it was incorrect and they didn't give me the Baileys to spike it. When I asked for it she said \"No that's\" all you ordered. I know I did order it however if I didnt and we just waited almost half an hour for our hot chocolate why wouldn't we just get it.<br><br>The long wait really ruined this and when we finally received the end product it was a complete mess everywhere. When we asked for napkins she said they are on the table. We informed her there were none on our table which is why we need some, also because while standing there it was leaking everywhere! <br><br>Honestly just go get some Swiss Miss and call it a day.<br><br>The positive, it is enclosed for the cold days.", "pics": null}}, {"review": {"des": "We have been following along with BomboBar for quite some time on instagram and it has always looked delicious and we knew it would be on the list for our next visit. We got there and were a little surprised with how small it was. To me it looked like a little tent/vestibule added on the side of a building with a walk up window. Once you are in there is is warm (and crowded) but you also may have to wait outside for a bit before you can even order. If you don't want the coziness of this location you should check out home base at Bar Siena!<br><br>The gal taking our order was extremely patient and kind. She asked about allergies and if we had questions. Which since we had never been there we certainly did. But she helped us through the menu and we got the S'mores Hot Chocolate but she let us sub it for a coffee instead and it was delicious AND beautiful. We also got a gelato. We did Coffee Caramel Crisp with a plain bombolini on top and the gelato was incredible. The crunchy little chunks inside were delicious.  We definitely enjoyed our visit and the delectable flavors! <br><br>My only wish is that it was a bit bigger and or the the line to order could move more easily so people do not have to wait outside! Other than that  I highly recommend stopping by.", "pics": null}}, {"review": {"des": "This is really a 2.5 star review but since that option doesn't exist, they get 3 stars on a technicality...<br><br>We stumbled upon this spot kinda by mistake while trying to kill some time during a recent trip to Chicago.  We decided to try to the Charcoal Oreo gelato with a mini bombs added, as well as the Strawberry Tequila Italian Ice.  The gelato was pretty good and made for a nice sweet treat but the mini bombo fell extremely flat.  The Italian Ice has a cute presentation looking like an adult CapriSun with the tequila shot served on the side.  The tequila was surprisingly smooth, however the cocktail itself had a strange plastic aftertaste from the pouch that it was served in which completely ruined the drink.  We also found a number of the menu items to be rather pricey.  I'd come back for the gelato if I was in the area and maybe I'd try one of the cocktails that's actually served in a glass, but that's probably about it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GKPRSQCixB1TvOPPeOzeQg/348s.jpg", "caption": "Strawberry Kiwi Tequila Italian Ice and Charcoal Oreo Gelato Cone topped with a mini bombo."}]}}, {"review": {"des": "Hate to be a party pooper cause it seems like bunch of people were willing to stand in line for these donuts. I found this place to serve one style donut and the only thing that's different is the filling in the bottle. Kind of boring especially since they charge an arm and a leg for each donut. We came here with two kids and everyone in our group got something different to try including hot chocolate which was so sweet nobody could handle drinking more than few sips. <br>We saw this place on tv and had to try it but I don't see us coming back for more.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/p3Dlgq3LQMN4gqQpletkhw/348s.jpg", "caption": "Variety of donut fillings."}]}}, {"review": {"des": "BomboBar is my go to for desert when I'm in the West Loop. They have a walk up window which is enclosed with heat lamps in the winter. The enclosed space is small so it can get crowded but the line usually moves pretty quickly!<br><br>Everything I've ordered here has been sugar loaded and delicious. They have gelato great for the summer months and hot chocolate for the frigid Chicago winters. I LOVE the hot chocolate - it's creamy and reminds me of homemade stovetop hot cocoa. You can even get it spiked. The hot chocolates are instagramable masterpieces. Try to add a mini bombo (light fluffy donut holes) to whatever you order!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NBpfWKieeDWRgMVrtgF4mg/168s.jpg", "caption": "Party Monster hotter chocolate"}]}}, {"review": {"des": "While in the neighborhood, two different friends each separately brought up this spot. Without a doubt, we made our way over for desserts on a Sunday night after dinner. It's a small spot where you order at a window and find a seat along the covered tent. Luckily, the line only had a few people before us when we arrived.<br><br>I ordered two Bombolini ($3.50 each), which is an Italian hole-less doughnut. It comes with a variety of flavors as I chose Salted Caramel and Vanilla Bean Custard. The doughnut itself was nice and warm with sugar powdered all over. In the middle of each doughnut was a mini plastic bottle of filling to squeeze into the doughnut. I figured afterwards that filling up the doughnut created a bit of a mess. I'd suggest squeezing the filling with each bite instead. I really enjoyed the Vanilla Bean Custard flavor though while the Salted Caramel was a bit on the sweeter side for me. Definitely a fun and insta-worthy treat that's actually pretty tasty too!<br><br>One of my friend went hard with the crazy hot chocolate. He got the Smores Hot Chocolate ($9) and spiked it with an additional mini bottle of Rumchata (+$8). It was a bit confusing because the alcohol isn't infused into the hot chocolate, but given to you in a bottle on the side for you to add. For what it's worth, the added alcohol didn't make much of a difference, especially for that price. The hot chocolate itself was very extra, over-the-top, and picture worthy though! It was topped with a marshmallow whoopie pie, graham cracker, cookie dough, and gold chocolate mini bombo struck through a straw.<br><br>As said in its name, the bombolinis are pretty bomb. I'd come back again for the vanilla bean custard one although this filling flavor was a bit more thick, which made it harder to squeeze out of the bottle. I can see why it's so popular with people, but considering how much sweetness and calories the desserts have here, it's a every so often treat.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eRcZ2cL0VyzB3qpna2nRTw/348s.jpg", "caption": "Smores Hot Chocolate with Rumchata, Coffee Gelato with Mini Bombo, and two Bombinis (Salted Caramel & Vanill Bean Custard)."}]}}, {"review": {"des": "This place is soooo good! Part of Bar Siena, they have a little walk up window where you can order desserts. Their bombolonis are a must try. I love the vanilla bean custard and Nutella flavors! And they're super cute. Each donut comes with a little squeeze bottle for the filling. <br><br>It does get super messy and sticky though so I appreciate that they have wet wipes stocked on their tables. They are a bit pricey (starting at $3.50 for one bombo) but super worth trying. I can't wait to get the other flavors!<br><br>I have yet to try their drinks but the hot chocolates look amazing. And you can spike it with alcohol if you want! <br><br>It gets super crowded and there is very limited seating. The line can get long but I think the wait is definitely worth it.", "pics": null}}, {"review": {"des": "Man, I wanted to love this place! So bad..<br><br>BomboBar had been on my Bookmarks for as long as I can remember. It was the #foodporn obsessed, Instagrammer's dream, but unfortunately that hype may have been what ruined it for me. I ran 45 minutes from my hotel to try this spot out and was a little crushed when I saw the price and size of the small lil' pastries. Not to mention, it was more of a corner donut shop, sugar donut, than anything else. Which hey, some people love, but being a \"craft\" donut connoisseur and one that doesn't generally like low flavor, highly fried, it wasn't for me. <br><br>BomboBar has more than just the social media infamous donuts. They have gelato, shakes, dog treats, small hot sandwiches, coffee and tea. It's a cute little outdoor side space that's always busy, and generally filled with tourists. The staff are busy and get things done quickly. Only reason to come back would be to scratch my curiosity itch and try the\"Bomobolato\" which is vanilla ice cream with smoked caramel and fruity pebbles, all in one. Dying to visit still and get those pictures? Give it a try, let me know what you think!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YMtVQBSHcejHWDf_dd0zrw/348s.jpg", "caption": "Menu 2"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dEVECvFJR8LZReD7x3KliQ/168s.jpg", "caption": "Menu 1"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/75nQRN7Ipnq4ro7WQqbrMQ/168s.jpg", "caption": "Small donut + Vanilla bean custard"}]}}, {"review": {"des": "TL; DR<br>Order the bomoblinos. Skip the other stuff, unless you're doin' it for the 'gram. Then order away. Don't take your blood sugar. Expect a sugar crash.  <br><br>\"Do it for the 'gram.\" should be their motto.<br><br>We stopped here on our way out of the city into the burbs...because it's all over our social media and me, the one with the sweet tooth, was dying to try it. <br><br>Bombloni - probably the best thing here. Little fried dough balls of happiness. Best part? Filled with NUTELLA!!!! And Salted Caramel. And Vanilla Bean. And raspberry. Personal faves in that order. Raspberry was my least favorite. I love that the filling came in squeeze bottles (with stickers that say \"squeeze me\") so you can fill up the bombolonis as much or as little as you'd like. If you're like me...you'll use the entire bottle. If you're like my boyfriend...you'll use less than half. It's even good the day after! It doesn't go stale overnight. Best breakfast ever. Just don't take your blood sugar. <br><br>I also ordered a Cold Chocolate - White Chocolate Oreo. Man, this was the most expensive \"do it for the 'gram\" thing ever. such a fail. Half the cup was whip cream. The other half with the cold chocolate was so sweet that it was borderline inedible. It made for some great photos and 'gram posts, but other than that...it was pretty useless. It's topped with Oreos and sprinkles and a gummy cherry. Aesthetically so pleasing...palate wise not so much.<br><br>It's a little window on the side of a building, pretty easy to miss if you're not looking for it. Parking was pretty easy, but then again, we came on a rainy July day pretty late at night.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/loV37u--3JEKh1OXCQfplA/348s.jpg", "caption": "White Chocolate Oreo Cold Chocolate."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Yu-sa1XTdBJRuQD2HOudQw/168s.jpg", "caption": "Bomoblinos with vanilla bean, raspberry, salted caramel, and nutella. One original flavor (just sugar)"}]}}, {"review": {"des": "Came back again and tried the smores hotter chocolate and my boyfriend got the bombolato. I tried his, and it was much better the second time around--and it even had caramel, which I think I missed the  last time I got it.<br><br>But if you do come here, definitely try the hotter chocolates. They are SO good and 100% worth the price. The donut was a little dry, but it was ok since I ended up dunking it in the hot chocolate. <br><br>We came on a Saturday around 4 PM. There was a small line, but they move pretty quick. It wasn't more than a 15 minute wait.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VktJJf7Br5T_mpdCCbuM9w/348s.jpg", "caption": "S'mores hotter chocolate; Fruit Pebbles Bombolato"}]}}, {"review": {"des": "Playful, yummy, desserts?! Yes, please! Usually when the desserts are cute (mostly for the 'gram), the flavor is typically lacking. But to my surprise, not here!<br><br>Ordered two of the donuts. Raspberry and vanilla bean custard. The sugar donuts come out with a tube of the filling for you to either put all in on the donut hole, or squeeze out as you please. We opted to fill the donut hole, and cut it up to chow down. <br><br>The result? Deliciousness. Was it the best donut I've ever had? No. But was it tasty and fun? Yes. 4 stars.", "pics": null}}, {"review": {"des": "Overrated. We had the nutella bombolini and I wasn't impressed at all. I've had some really, really good bombolinis in Los Angeles and these are anything but. First, you could taste the oil & it was almost like old oil. Second, the nutella tasted like off-brand nutella for some reason. <br><br>The only thing that was redeeming was that it was a fun experience to fill your own bombolini, but..I'm really stretching here. <br><br>I'll be back to give BomboBar's gelato a shot though, but keeping my expectations low.<br><br>261/365", "pics": null}}, {"review": {"des": "We got the salted caramel doughnut and it was very good. The naked hot coco was just too sweet and have a thick layer of whipped cream, which I am not a fan. We also got a capuchins latter also and it was good.<br>I was surprised by the size of this place. It's a very small place on the side of a bar. Not much place for seating or hang out with friends.<br>Overall, I would recommend it to others.", "pics": null}}, {"review": {"des": "What a wonderful find that we stumbled upon tonight after our dinner!<br><br>We were all having a craving for something sweet and decadent: BomboBar was just the place!<br><br>When we arrived at the conveniently located sidewalk vendor window, I was really uncertain as to what to order: their infamous house donuts or one of the incredible gelato flavors!<br><br>Since we just had dinner, all three of us opted for gelato. I got the coconut fudge gelato in a waffle cup with Nutella drizzle and I was in absolute heaven with the constant chunks of fudge and flakes of coconut! My partner got the vibrantly blue Cookie Monster dough ice cream in a waffle cone and loved it! Our friend ordered the double chocolate gelato in a waffle cup and it was delectable!<br><br>I cannot wait to go back and try the donuts! Prices were decent and the staff were fairly friendly. A solid end of the week luxury!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/llmkhZNkPronagq0AJEFVg/348s.jpg", "caption": "Cookie Monster Dough gelato in a waffle cone"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/n7tq5C5RmmWAGkn3WxvCkQ/168s.jpg", "caption": "Double chocolate gelato waffle cup"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yLFlyyjZgNTTw1R7MoDhcg/168s.jpg", "caption": "Coconut fudge gelato cup with Nutella drizzle"}]}}, {"review": {"des": "One star for good doughnuts.<br>Outside (cold during winter)<br>No bathroom, gotta go to restaurant next door.<br>Hot chocolate in video ad looks thick and rich, not the case until the last few sips.<br>Also, in video ad this looks like a large establishment, not the case. Pop-up status at best.<br>You got to ring a bell at the window to get service which is basically someone to answer questions about the confusing menu and take your payment.<br>Was there any service worthy of a tip? Why are 25, 20 and 18% the only options other than \"no tip\" which is the appropriate choice.<br>Donuts aren't even filled with the raspberry, custard or chocolate, you have to fill it. Are the flavor squeeze bottles even sanitary?<br>Not worth it.", "pics": null}}, {"review": {"des": "This is an updated review as of 11/21/2018<br><br>Received the same spectacular service I'm used to receiving here. Everyone was friendly and courteous. My order was prompt and correct. The only thing better than the front of the house is their even more customer friendly Manager Emily! What a GEM! I had a problem there a little over a week ago and when I came back this time she personally came out to apologize to me and made sure to let me know that AMAZING customer service and delicious food is what they're about! They pride themselves on service with a spectacular smile. Much like the smiles you get after eating their newest delicious item ( it has Cinnamon Toast Crunch AND APPLES! ) <br> Make sure to try it out the next time you're there!", "pics": null}}, {"review": {"des": "Fun spot to check out when near Fulton Market. They have fun hot chocolates, gelato, and donuts. I tried the Nutella donut which did not disappoint. It was covered in sugar and served warm. I love that they are served with little bottles of the fillings that you can squeeze on yourself to your liking. It was so good I found myself trying to get out every drop. There are just a few seats there and it's not quite indoors so it can be a bit cold in the enclousure.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PsWbjwNlBG3R9Z29CU9SfA/168s.jpg", "caption": "Nutella.donut"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/35NLQbXbvwP-NRAbfty9Fg/168s.jpg", "caption": "Nutella donut"}]}}, {"review": {"des": "We waited in line for about 20 minutes to get the bombolinis I've seen all over Instagram. We got the s'mores bombolini. It wasn't as amazing as I thought it would be. The donut itself was sweet but a little to dry for my liking. Injecting the chocolate sauce into it made it less dry but it was still not great. <br><br>I'm glad I tried it but I don't think I'll wait in line again for it. Next time, when there's not line, I'll try one of the extravagant drinks.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hifpLwWPbbTjlyLVcFISpQ/348s.jpg", "caption": "Smore's Bombolini"}]}}, {"review": {"des": "Super cute and instagrammable bombolinis! If you split a larger box among friends, it comes out to just $3 per bombo which I thought was worth it considering the cute little squeeze bottle it comes with!<br><br>I'll be back to try their shakes, but will probably need to split that too!", "pics": null}}, {"review": {"des": "Super cute concept, perfect place to satisfy your sweet tooth!<br><br>If you want an all-in-one dessert, get an the S'mores Ice Cream with Fruity Pebbles, topped with a Bombolini. My mom's Cream-Infused Bombolinis were also yummy. Can you say sugar rush?", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/n8OTJzwYnHzYX4TVuWN1_g/348s.jpg", "caption": "Ft. S'Mores Ice Cream topped with Fruity Pebbles, Bombolini"}]}}, {"review": {"des": "BOMBOBAR is so worth the hype. This Instagram​ central and perfect place for those girls that like to have an aesthetically​ pleasing place to eat with their pinkies up and act all cute as their friends or significant other snaps pictures until they get the one. lawl <br><br>Service: The service is overall nice but since the line is long they do try to rush the customers. <br><br>Food/price: \"The price wasn't bad... was not cheap but reasonable\" -PL. The food though is really good and this is a time where it is okay to \"play with your food\". TRY THE COOKIE MONSTER! sososo good :) <br><br>Audience: good for anybody but you will find girls dragging their boyfriends. :) mhauaha<br><br>Recommend/tips? GET THE COOKIE MONSTER", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wE-u1pcmpnv4TTTHaYXEsA/168s.jpg", "caption": "get the cookie monster ice cream!"}]}}, {"review": {"des": "While the four of us were waiting for our table at Au Cheval, we decided to explore the area. We ran in to a group of four friends who were on their way to BomboBar, and they invited us to tag along. One of the ladies is a Doughnut blogger. Yes, a Doughnut blogger. She's been to many cities around the world to taste their doughnuts and was checking BomboBar off her list. They insisted on treating our group to a round of the tasty treats. So Bomboloni's are holeless Italian donuts of which I'd never heard. The reviews on this place live up to the hype. We had a Bombo Box of the mini donuts which comes with chocolate, raspberry, and caramel flavors. We also had six of the regular sized Bombolonis with salted caramel, raspberry, vanilla bean custard, original, and s'mores flavor injectors. The s'mores steals the show but the others follow closely. We enjoyed our experience here and were fortunate to come at a time when there wasn't a wait at the order window, and we had our choice of seating outside. We had lots of fun with our new friends here. The doughnuts are tasty and a must try.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/D3maiFoIoFSneIiNM9ghiQ/348s.jpg", "caption": "Bombo Box of minis"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NwffnNghULOQLcYSW3FZYA/168s.jpg", "caption": "Bombolonis"}]}}, {"review": {"des": "Coconut ice cream!<br>It's near my apartment. Friends said i live a place which offers plenty of good foods. Exactly! Like The most famous hum burger in US,the popular restaurant which has been reserved to next 3 month. And this ice cream bar...<br>It offers different flavors. The cashier recommended the chocolate one. But I decided to try the coconut. Sometimes I have strong mind to insist on choosing the one I like most, though I know their recommendation are professional lol.just like choosing BF, you should choose the one you like best other than the one others say good or matched.Make scenes?lol<br>The last few days I can eat ice cream outside, I want to try different kinds in different restaurant.sweet tooth！ always！", "pics": null}}, {"review": {"des": "what i ordered: bombolini with nutella filling ($3.50) | Charcoal Oreo Gelato Scoop ($4)<br><br>Taste: donut was okay, but the gelato was really good. the charcoal didnt taste powdery. <br><br>line was really long on a friday night <br><br>parking: street", "pics": null}}, {"review": {"des": "Ah!! There's so many different flavors to choose from!!! I'm so glad I went with the Pistachio. It was so delicious! You can get a single scoop, double scoop, waffle cone, or waffle cup! Add a mini bimbo for only $1 extra. The flavors they have for Gelato are: coffee caramel crisp, S'mores, vanilla bean, Cookie Monster dough, stracciatella, charcoal Oreo, double chocolate, lemon sorbetti, birthday cake, pistachio, coconut fudge, coconut, and frutti berry sorbetti. They have dairy free, nut free and gluten free options! Pick your gelato and add your toppings. Enjoy!", "pics": null}}, {"review": {"des": "I have been seeing reviews about this place & I have always wanted to come and check it out. Well I finally got the opportunity to experience it.<br><br>It's an outside walk up window where you come and place your order for some delicious donuts, coffee, hot chocolate and other goodies that are on the menu.<br><br>The prices are  high for donuts. <br><br>The workers are nice. Latoya was extremely nice and friendly. She exactly helped me make my selection on what to try for my first visit. <br><br>What makes this place unique is the creative presentation of their desserts and drinks.  <br><br>It was worth coming and trying it once.", "pics": null}}, {"review": {"des": "HOLY DECADENCE. <br><br>Stopped by for two donuts and Italian Ice. <br>We ordered at the step-up window, staff was friendly and the outdoor patio was cute! <br><br>The Smore's is a must get. It's topped off with a large marshmallow cube and crushed graham crackers. Salted caramel was also delicious. I think it's so fun that they put mini squeezy tubes. They're like little injection bombs of sweetness. <br><br>The Italian ice came in a Capri-sun inspired pouch with a spoon & straw. So fun and creative.", "pics": null}}, {"review": {"des": "This review is based off the gelato I tried (apple pie flavor). The taste was fine but it was a bit icy, not creamy how I'd normally expect my gelato. Outside seating area is pretty cool (and yay for heat lamps!) and employees were friendly.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TKkCGsNDtqCeLctOrY4vog/348s.jpg", "caption": "Apple pie gelato"}]}}, {"review": {"des": "I've been holding off on going to this place in fear of  getting addicted seeing it's too close to work. Wow was I wrong and disappointed.. had it not been because the order was ready quickly and yelp not allowing half stars, this place would've earned a 1.5. <br><br>Donuts - they're okay sugar donuts. Yeah they tasted fine and yeah they didnt taste necessarily reheated (but they were only warm because they put a flame on them before giving them to you) but c'mon, for the price i would've been better off (x100) at Stan's any day of the week (and without waiting a second in line). The donuts have a mini hole carving in them meant to hold the little bottle that goes in the pic - not meant to fill them at all. The menu is confusing at best, and the best part of what I ate was probably just the plain nutella that well - is nutella (can't go wrong, can you?).<br><br>Oh by the way, seems like they havent figured out the best way to serve their hot chocolates during the fall (winter? Because chicago) As everything is already kind of melting when you get it. <br><br>Spent $30 for 6 donuts and 1 hot chocolate and boy did I regret coming.<br><br>Seriously... Just hold off for their milshakes during the spring/summer and hope their ice cream is what everything else isn't.", "pics": null}}, {"review": {"des": "I agree with the other reviews, a place to go for the \"gram\" photos. It's a glorified Malasadas (heavy fries dough). I went with their 4 for $12 donuts - vanilla, raspberry, s'mores and nutella. Each flavor came in small bottles. I just ate a couple of donuts and poured the sauce on each bite. I'm not a big fan of nutella but that one was the best amongst the 4 flavors I got. The raspberry was very tart, the vanilla and s'mores was just ok.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/je_GXvihUw7HbxdiEoWyow/168s.jpg", "caption": "Squeeezeeeee me!"}]}}, {"review": {"des": "Eh I think this place is overrated. The actual hot chocolate was just ok. We ordered the s'mores one. The topping on the hot chocolate was actually good. I liked the cookies it came topped with more than the actual drink. The actual hot chocolate wasn't creamy, didn't even taste like real hot chocolate. This is one of those once a year type places, if even that.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XG723CzMPk_SRGLn5qnY5A/168s.jpg", "caption": "S'mores hot chocolate"}]}}, {"review": {"des": "Come here and do it for the gram and then enjoy an awesome treat. <br>I wish the weather was cold when I went so I could enjoy and hot chocolate. Those look amazing. Instead I got a bombalato. It was amazing. I got the one with fruity pebbles and my friend got the one with baked apple. I liked hers better but both were good. It was really sweet and I couldn't finish it all, but it was worth it. So delicious.", "pics": null}}, {"review": {"des": "We went to eat BomboBar after dinner at the Little Goat across the street. We ordered the bombolini with vanilla custard and nutella as the filling and even got to mix it up too!! The doughnuts were perfectly crispy on the outside and warm and moist on the inside. The sugar coated on top was the best touch. This place was amazing and we only had to wait like 10 minutes to get our doughnuts. The line was pretty long while we were eating so I'm sure the later it gets, the longer the line gets. We went pretty early around 5:30pm and the line wasn't too bad.", "pics": null}}, {"review": {"des": "Okay, so it has taken me a couple of weeks to get around to posting this review. I just...needed some extra time to figure out how I really feel about BomboBar. Do I like it? Not like it? I'm still not really sure.<br><br>You order at a tiny window on the outside of the building and, if there's space available, grab a table on the small outdoor patio to enjoy your treats. Outside ambiance was ok. Honestly, it's kind of annoying to have to navigate through throngs of Instagrammers all vying for the best shot (same shot) of their desserts. (A side note reflecting the state of humanity: I witnessed someone take a couple of photos of their $9 drink, set it on a table, and leave without even taking a sip. So disheartening and wasteful.)<br><br>As for the treats... the bombolini is just okay. I mean, it's a donut (a lot like a paczki) with a little squeeze bottle full of whatever topping you choose (fudge, caramel, raspberry, vanilla custard, Nutella). Kids might find it fun, but I just found it messy. The filling really has nowhere to go except everywhere. My daughter ordered the pistachio gelato and said it was good. My fiancé ordered some type of frozen chocolate drink. It was tasty, but really rich and definitely could have been shared by two or three people.<br><br>BomboBar is cool. It's a trendy, fun little spot. But is it worth the hype? I don't really think so. It's definitely not a spot that I'd go out of my way to visit again.", "pics": null}}, {"review": {"des": "It's just the best. <br><br>Pro Tip: sit at the bar in Bar Sienna and order BomboBar and skip the line while you have a drink!", "pics": null}}, {"review": {"des": "Overhyped, overhyped, overhyped.<br><br>Yes, the food and drinks are very Instagramable. They are fun concepts... but if food isn't fun to eat, what's the point?<br><br>We got 4 Bombolinis which we each divided into fourths. We got s'mores, salted caramel, Nutella, and vanilla bean custard. The donuts themselves are very underwhelming; they just taste like sugared frybread. I could make them at home without looking at a recipe.<br><br>As for the fillings, they just didn't get me excited except for the fact that they come in squeeze bottles. The vanilla bean custard was gritty and actually didn't have enough vanilla; the salted caramel was good but not great, the Nutella was just Nutella, and the chocolate filling for the s'mores had a weird chemical aftertaste. <br><br>The one thing I did love was the toasted marshmallow on the s'mores bombolini. Yes, thank you for actually putting some effort into the dessert.<br><br>My friends got various drinks and weren't impressed, either.", "pics": null}}, {"review": {"des": "Worth the wait for some fresh donuts. Was so full from eating at Girl and Goat but had to stop by pet recommendations. Got a 6 pack of donuts. We shared the sauces. The raspberry with Nutella was really good. I would've tried the gelato but was way too full.", "pics": null}}, {"review": {"des": "Always the best part and what I always look forward to with our West Loop food adventures is stopping by the walk up window of the BomboBar.  Ordering a scoop of pistachio gelato, straciatella gelato, a box of mini bombos and some italian ice.  Walk back to Ogilvie Train station to catch the Metra home while enjoying the creamy decadent gelato and the refreshing italian ice.  <br>The mini bombos are to be savored at home with a cup of coffee or tea. Bombos are those delicious fried italian donuts with the little syringes of chocolate, caramel or vanilla fillings. You can choose your filling or combine your fillings in a single bombo. <br>And that is how we always end our gastro outings in the West Loop of Chicago!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UJGRDAz1QAxDvP7ChYbIXw/168s.jpg", "caption": "Box of mini bombos to take home with"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wDdwm_Kb6JCOvTFZjqeWSw/168s.jpg", "caption": "Vanilla gelato on a waffle cone topped with cherry gummy and a mini bombo"}]}}, {"review": {"des": "Donuts and gelato? Yes please. <br><br>Casual, \"quick\" and simple dessert spot with a small outdoor patio and limited seating. Depending on the weather and the day the line can sometimes be really long (hence the quotes on quick). It's a walk up window like a drive through, so taking orders can take a while. <br><br>Their donuts are delicious and are much better eaten fresh. After a day they can get a bit stale(still good, but not as good). Vanilla bean custard, Nutella and S'mores are always my go tos. <br><br>The Bombolato was a bit of a disappointment. I didn't have any expectations, but wasn't blown away. It tasted like having a bowl of Fruity Pebbles but in the form of an ice cream sandwich with a crunch. It can also get a little messy to eat (probs not ideal for a first date ;P) <br><br>Tried the White Chocolate Oreo and S'mores Chocolate Coolers. If you're stuck between the two I'd recommend going with the Oreo. It was like having a cookies n' cream milk shake, topped with a cherry shaped gummy and Oreo cookie. The S'mores one was like having a dark chocolate milk shake and didn't really resemble the flavor of a S'mores. I'm HUGE on smores (one of my all time favorite flavors!) so needless to say I was slightly disappointed. It was topped with crushed graham crackers, but the taste was subtle. If there was any marshmallow flavoring, I couldn't taste it. The donut holes were also a bit on the stale side so slightly disappointed. Seemed a bit pricey at about $10 a shake, but city prices. <br><br>Overall, I'd say it's a hit or miss with their donuts. If they're fresh, solid, if not well then maybe next time.", "pics": null}}, {"review": {"des": "Cute dessert place to sit by the patio to people watch or take instagram pictures.<br><br>Presentation: good<br>Atmosphere: good, seating is all outdoors<br>Pricing: can add up to a big tab if you're not careful on what you order<br><br>Grab a coffee/drink and enjoy donut/gelato. Great for catching up and conversations.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gmXeztDweOAso8xRNYYVgg/348s.jpg", "caption": "Matcha Made in Heaven"}]}}, {"review": {"des": "Saw the location pop up on Facebook and I thought it would be something cool to try out. After ordering my $10 milk shake, it was a very disappointing experience. The shake tasted like water down sugar with no good flavor. We couldn't even get ourselves to finish the drink and ended up throwing it away. Definitely not coming back here again.<br><br>Update - The manager of Bombobar reached out to address my concerns and wanted me to come back to give Bombibar a try again. Although my first experience wasn't great, this type of customer service really impressed me and next time I'm in the area I'll be sure to stop by to give it a try again.", "pics": null}}, {"review": {"des": "Tip: if you go at 1130am on a Saturday you will find NO line!!!! <br>Of course the bomboloni and gelato were delish. I tried the charcoal Oreo gelato which looked super cool. Vanessa took my order and she was incredibly patient- I'm undoubtedly not the only patron who takes forever deciding what to order...", "pics": null}}, {"review": {"des": "Sooooo good! The donuts are absolutely amazing and what is even better is the lunch is a secret surprise. You don't expect a donut place to have such amazing food but the chicken and burgers were extremely tasty! I love that you are in control of the amount of filling in your donuts and even better they are made fresh while you wait so you have a warm tasty donut!", "pics": null}}, {"review": {"des": "I love doughnuts /bombolinis ! They are so good and so easy to walk right up to the take out window'! The hotter chocolates are delicious too. All very tasty and make for great instagram<br>Pictures", "pics": null}}, {"review": {"des": "Cool, very hip spot in a great location in Chicago.  <br>Definitely a destination for your out of town peeps who enjoy their sweets.  The BEST of both worlds can be experienced at BomboBar.", "pics": null}}, {"review": {"des": "Donuts were delicious! The outer layer is super crispy and inside is soft and warm. Tip: Don't get the original. The original is pretty much any of the other donuts minus the toppings. The \"flavor\" donuts are very instagramable.", "pics": null}}, {"review": {"des": "Service: 4<br>Cleanliness: 3.5<br><br>Situated with Bar Siena you'll find  BomboBar. (I gave cleanliness at 3.5 because it can get real messy with sticky tables; inside the canopy during winter time it also smelled like wet towels, maybe we just got unlucky). You could also just take it to go or have dinner at Bar Siena first.<br><br>S'mores Hot Chocolate $9: I honestly thought it was just ok. Obviously due to the hype and being insta famous. It was a bit watered down and not much chocolate flavor. Also, like others have said, it was pipping hot so don't let the whip cream fool ya. I'd like to try these during the summer when they roll out the frozen ones.<br><br>4 doughnuts for $12: yummm. My friend really enjoyed the Raspberry and S'mores and I had the Vanilla Custard and S'mores. All delish! The doughtnuts are warm, fluffly, and just right. (Reminded us of the dessert doughnut with condensed milk at Chinese Dim Sun restaurants. Speaking of which, Bombobar, you should add condensed milk as a flavor!) We each finished two doughtnuts in one sitting. We liked that you can squeeeze as much flavoring as you like with your own personal bottle.<br><br>Would I come back? I'd like the come in the summer when there's a bit more room to breath.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qofmHpyg15hwWS0Ole62cw/348s.jpg", "caption": "4 for $12"}]}}, {"review": {"des": "Well we had to get these for the ride home even though we had already stuffed ourselves across the street.  So delicious.  The walk up window is adorable and watch out, they also have dog treats and those pups know exactly where they are going!<br>Get a mix and try them all.  I want to drive 3 hours just to eat more!!!", "pics": null}}, {"review": {"des": "During my visit to the city, this place was high on my food bucket list!! It did NOT disappoint. As an avid believer that donuts should be a food group, these were a game changer. <br><br>The donuts are all sugar coated and you are able to select the filling! You can choose from vanilla bean, salted caramel, raspberry, s'mores, or Nutella. We shared 4 of them and tried all but salted caramel! INCREDIBLE. Not only is the presentation spectacular and fun, but the taste was out of this world. <br><br>Located right in the French market district with a walk up window to order and tables outside, this is the most fun donut concept I could ever imagine!", "pics": null}}, {"review": {"des": "I came here after lunch one day and tried the avocado chip ice cream and a caramel apple bombalato.  You order at a window, and wait for your order to be called to pick it up.  This was in October, so there were lamp warmers inside.  If you stand directly under them, they practically burn your head.  It was a tight fit inside, too - very narrow and crowded, so it was hard to avoid the heat lamps.  We didn't have to wait to long for our ice cream, though.  I thought the avocado chip was very strange.  It was very, very avocado forward which I didn't expect.  It reminded me of green banana almost and had a very fatty consistency.  The bombolato was better than I expected.  It was sweet, salty, and crunchy.  I definitely recommend the bombolatos!", "pics": null}}, {"review": {"des": "Just a hype spot... dirty as fuck outside. No one cleans up after themselves, no one dumps trash either it was so high that trash was falling out. <br><br>They DO NOT TAKE CASH! <br>So first instinct to me is. Don't trust a place that doesn't accept cash PERIOD! <br><br>We waited about 10 mins for some melted ass ice cream wasn't even hot outside. <br><br>Their donuts are not good. Don't even know why I ordered I don't even like donuts. But gave it a try... raspberry \"filled\" donut that you have to fill yourself in a sought non flavored sugar on top donut. Like what is this? <br>My sense on the little squeeze bottle they add for the diy filling is..come on do we really need to use this? More fucking things to throw away? I'd rather them fill the donuts like any respectable bakery/ restaurant does than have to work for my dessert that I just paid a few bucks for... <br><br>Wow..<br><br>Ok I'm done.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EUDkB61xTtHXpm-D3mNe1A/348s.jpg", "caption": "Charcoal Oreoin waffle cup...melted"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jtchqTzzJjsJ9c3VHHzNEw/168s.jpg", "caption": "Double scoop in waffle cone- Cookie Monster and cookie dough. All melted.."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cTpYMkGornJtj_MFQg2F1g/168s.jpg", "caption": "Raspberry donut thing"}]}}, {"review": {"des": "I visited BomboBar for the first time after wanting to go for at least the last three years! I was surprised at how it was kinda hard to locate because it's on the side of a building and easy to miss, but I found it and it was all good! I ordered a Smore's bombolini and I was okay with the price but it is pretty pricey. I found the service to be very good and we were helped quick and the donuts came out relatively fast. I wasn't a fan of how small the seating area is but it's okay! I did enjoy my time here and I found the donut to be really sweet and filling.", "pics": null}}, {"review": {"des": "With most Restaurants these days in a rat race of maintaining their identity while still generating enough new material to keep guests coming back it appears Bar Siena has found its hook in BomboBar, a kitchen side window at the corner of West Randolph and North Green Street serving nothing but filled-to-order Italian Doughnuts, Coffee and Ice Cream from 8am until 11pm daily.<br><br>Originally opened in late 2015 and still somewhat under-discussed in America's best city for Doughnuts whether they be from Dat, Firecakes, Stan's or the Vault, BomboBar takes the idea of \"made to order\" in a new direction by batch frying Bombolini several times throughout the day and presenting them naked with squeeze-bottles of housemade Sauce, a cost of $3.50 each and six flavors plus occasional specials getting cheaper per piece the more one orders.<br><br>Not exactly a comfortable space during the humidity of summer or chilly winters, a man at the window loudly broadcasting that BomboBar patrons may not enter Bar Siena without making purchases from a table, it was after a brief wait in sun unblocked by the awning that items were taken across the street to shade, first bites of scratch made \"Charcoal Oreo\" Gelato really no different from standard Cookies & Cream save for the color while Coffee & Caramel Crisp fared far better thanks to a smooth and lightly bitter base flecked in bits of crystallized Sugar.<br><br>Moving on to the Bombolini after fears off melted Ice Cream were abated, the 90F Heat and 70% Humidity seemingly not so different from a deep fryer to someone who lives in a desert, one would be pressed to decide if the sour Compote with Seeds or creamy sweet and saline Filling were better inside a fluffy pocket sprinkled with Sugar, but to make sure its strongly recommended to keep squeezing until overflowing and then apply more after each bite.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wSPqrepotznrAH7xjtlwpw/348s.jpg", "caption": "07/07/18 BomboBar: Salted Caramel Bombolini (interior)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vgtLd-mFdpuc1jvw-Z6BQA/168s.jpg", "caption": "07/07/18 BomboBar: Salted Caramel Bombolini"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2N5J__R0L6lqJaItbZ7yxQ/168s.jpg", "caption": "07/07/18 BomboBar: Salted Caramel Bombolini"}]}}, {"review": {"des": "Killing time while in Chicago we decided to grab a quick drink and some dessert before meeting up with the family.  It worked out that we landed at a spot that specialized in both. Gelato has been the new craving of the month for both my wife and I can this spot didn't miss. They created their own gelato and had an option where you could get it topped with homemade donuts. I was in heaven. The bartender was super cool and the spot is super posh.  I would go back especially for the gelato.", "pics": null}}, {"review": {"des": "Luckily we went when the line wasn't too long. The gelato is good but very thick in texture. Everything felt too heavy.. it was nice to try out but won't need to come back again", "pics": null}}, {"review": {"des": "Tried the Nutella donuts and hot chocolate and omg! This place is should be in every city. Although I'm sure I got diabetes from their hot chocolate!  but worth it!!", "pics": null}}, {"review": {"des": "This place is ALWAYS busy. <br><br>They're pretty good for a mainstream ice cream place but I can't say there is anything outstanding about them. Their service is really good and their ice cream is good as well. You get a decent cone for about $7-8. <br><br>I got a vanilla cone with caramel drizzle, fruity pebbles, and a bomboloni. It was MUCH better than I was expecting it to be. <br><br>It's a really good ice cream place if you're willing to spend the money each time.", "pics": null}}, {"review": {"des": "Must stop by! I think it tastes best when it's a little chilly outside just because the doughnut is so warm and soft!!", "pics": null}}, {"review": {"des": "Hype, hype, hype!<br><br>I actually hadn't heard of BomboBar, but my friend exclaimed, \"How have you not heard of them?! They're all over FB and Instagram!\"<br><br>And there you have it. They do it all for the Gram!<br><br>Me and my friends had just had dinner so we were stuffed, but since we already in the area, we figured we'd see what all the hype was about. Perusing the menu, they have quite a bit to offer. Donuts, gelato, coffee and hot chocolate, and sandwiches. <br><br>While looking through the menu, there's a statement on there that encourages people to Instagram the food and even suggested which filter would work best! Lololol. Don't tell me how to Gram!  <br><br>Anywho, I was debating between the hot chocolate and their Bombolini's but ultimately went for the Bombolini. <br><br>I chose the 3 for $10 and did Original, Raspberry, and Vanilla Bean Custard. We waited about 5 minutes, which isn't bad. Once I received my order, not gonna lie...I was slightly annoyed that I had to squeeze my own filling. I guess most people find that quirky and cute...but I like my desserts ready to eat! <br><br>That aside, the fillings were good and the donuts were decent. Certainly nothing spectacular. <br><br>Overall, I wouldn't mind coming back to try their hot chocolate and gelato, but I'm not going to make a special trip either.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PBrpwZcIBaNrB3maNMIehQ/348s.jpg", "caption": "You better work! Original, vanilla bean custard, and raspberry that I already squeezed."}]}}, {"review": {"des": "Part of me wants to give 5 stars to this spot. The s'mores iced hot chocolate definitely earned 5 stars, or maybe even more than that (if that's possible!) I would definitely return for that - as a matter of fact I wish I could return for that right now!<br><br>The reason I am giving 4 stars is because their bombolonis (or donuts), absorb a little too much oil in the cooking process. They are quite good, but because of the excess of the oil, there is a little bit of a disappointing after taste. The oil helps the donuts be nice and crispy on the outside, which I appreciate, BUT I think they could adapt the way they cook a little to get less oil absorption. I'm guessing that would improve the overall donut.<br><br>Though I didn't try them, others in my party got some gelato and Italian ice (which surprisingly came in a bag) and seemed pleased with it. <br><br>I was there at around 5:30 on a Friday and there was a line that was growing quickly... something to take into consideration. Also, if you just go to the walkup window (the main shop), you're going to be outside for a bit (bad in extreme temperatures). If you want to be inside you can order their food from the connecting restaurant.", "pics": null}}, {"review": {"des": "I love this concept! Everyone fell in love with Siena's Bombos so they added a walk up window.<br><br>The coffee is rich and hot. The snazzy milkshakes with all of the accessories are works of art. The Italian Ice in a clear plastic bag to go brimming with fresh fruit is perfection on a hot summer day. Last but not least - the BOMBOS! Warm and chewy. You can fill it all at once or do it like me. I squeeze a little filling on every bite.<br><br>The place is small with picnic tables filled with neighbors and their doggies. Shrubbery keeps it quaint. The lines are long but the service is smooth and friendly.<br><br>Stop by and become a regular like me!", "pics": null}}, {"review": {"des": "This is a great place to go to if you want to get your instagram food shot for the day. The donut is nothing special it was very average. It is a regular sugar donut and Nutella that you can infused into it. The latte was alright and I wasn't too fond of their customer service.", "pics": null}}, {"review": {"des": "I love their bombolinis! These are italian hole-less donuts. My favorite flavor is the salted caramel. Whenever I have a bombolini craving, I always come here. If you love sweets and especially donuts, you need to try these.", "pics": null}}, {"review": {"des": "Dined at Bar Siena which features Bombabar's menu on their menu as well. I have to state this in this review because the establishment was able to use a loop hole to get my review removed. You share the same address and location and that is why I reviewed the two together. <br><br>The Bombabar's hot chocolate I ordered was not hot at all. It was barely warm, overly thick and chalky as well, probably from the 2 biscotti's and other edibles crammed into one cup. The others I dined with cups of hot chocolate were luke warm and chalky as well. I will have to try this place again and by itself to be sure. The other donuts and ice cream looks very good.  Maybe what we ordered was too much after dinner at Bar Siena.", "pics": null}}, {"review": {"des": "Surprised this hasn't made some food network show for their insane hot chocolates and donuts. It was a very aggressive decision to go there when we did, but very worth it. I ordered the funfetti hot chocolate while my girlfriend ordered the s'mores hot chocolate. This is by far the most decadent hot chocolate I've ever had. It featured a donut hole, squirt bottle of chocolate, two long cookies, and whipped cream. <br><br>They have other items that I'd love to try in the future including the bombo and bombolini. You can inject the donut with your choice of chocolate or caramel. <br><br>Pro Tip - don't crush a giant plate of BBQ from Green Street Smoked Meats right before going to Bombo Bar.", "pics": null}}, {"review": {"des": "Came with a friend. Both of us had seen the viral videos on Facebook and we were curious about what BomboBar was like in real life.<br><br>I ordered a s'mores hot chocolate and my friend got the Funfetti hot chocolate. While they were expensive ($10 each after tax), they looked adorable and definitely lived up to appearance expectations. On top of that, I thought the hot chocolate tasted great too -- rich and chocolate-y, not too sweet, not scalding hot. The marshmallow in my s'mores hot chocolate gradually melted into a creamy sweet layer on top, which paired quite well with the less sweet hot chocolate. <br><br>A couple notes:<br>- Each hot chocolate is pretty big (I was incredibly full and started to hate myself by the end of the drink, haha). If you're a light eater, I'd recommend sharing one with a friend.<br>- There's limited seating so you may have to take it to go or wait around. However, people cycle through decently quickly.<br><br>Overall, a very \"Instagrammable\" place that actually has good food. I'd come back if I were showing a friend around Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jJTnf6ToZCKpd7ubLzN9XQ/168s.jpg", "caption": "Funfetti hot chocolate"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/amlWrh7qK6CP7XjaBqMZHw/168s.jpg", "caption": "Smores hot chocolate"}]}}, {"review": {"des": "There's definitely going to be a line! MUST GO if you've got a sweet tooth! MUST TRY if you haven't before - but be sure to share it with some friends! :) <br><br>We got the S'mores Hotter Chocolate which was BEAUTIFUL to say the least and it was very tasty! (Well after the first few bites and sips it got pretty sweet... but the hot chocolate is really nice and rich!) It also comes with a doughnut on the straw which was also super sweet but very tasty and perfectly satisfies the sweet cravings! I've definitely see some beautiful doughnuts other people have ordered! It comes with syringes of sauce! <br><br>It was a little area of outdoor seating when we went with bar top (kind of table) seating and also small round tables that accommodates up to around 4 people per round table. It might be smarter to take it to go if you're going with a big group! <br><br>Anyhow it was an awesome experience :)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/acdxCC7_9MN0E-YOSQ8fYA/348s.jpg", "caption": "S'mores Hotter Chocolate (BEAUTIFUL!!)"}]}}, {"review": {"des": "Saw this place on my Facebook newsfeed and had to give it a go when I came here for one of my breaks. Overall very cute, super insta friendly, but limited seating indoors. Kinda proxy for what you get, but a picture is worth a thousand words. <br><br>Hot chocolate Bloody Mary:<br>Various types of options for toppings, also great chocolate flavor, very rich. Definitely doesn't taste like the package hot chocolate. This is a hearty drink and you will get low key full off of it. I can definitely say this fixed my sugar cravings for a few days.", "pics": null}}, {"review": {"des": "We have some great desserts in this city and BomboBar does not disappoint. I honestly love the bombolonis by themselves, but I still enjoy the different fillings that can come with it (for those who haven't been here or seen pictures, you pick different cream or fruit fillings - Nutella, vanilla, salted caramel, peanut butter, etc etc - and they come in small squeeze bottles so you can add what you want. DELISH! A close second star on the menu is the coffee and caramel crisp gelato. GET IT. SERIOUSLY! so delicious. I've also had the hot chocolate (not the super decked out ones yet, but just the regular hot chocolate), which is super rich and decadent and delicious! <br><br>You order through a window on the Green Street side of Bar Siena. There are a few small tables and stools where you can sit / stand and in the winter, the window is enclosed and there are a few heat lamps. If you're eating at Bar Siena, you get the same menu as outside to order from if you want it! LOVE this place and now.... I'm craving it again!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Qi113g3w6aOc51ukobbvQg/168s.jpg", "caption": "Get.in.my.belly"}]}}, {"review": {"des": "I wanted to love BomboBar, but for a $9 and a 15-minute wait in the cold, the hot chocolate kinda wasn't worth it. <br><br>Pros:<br>-the staff was incredibly friendly <br>-the massive s'mores hot chocolate looked really pretty. Instagram gold. <br>-the donut on top of the straw was our favorite part<br><br>Cons:<br>-the actual hot chocolate was mediocre...I'm sad to say it tasted a little watery to me. You can have all the fancy toppings in the world, but the hot chocolate needs to be high-quality too.<br>-indoor seating is limited<br><br>They sell boxes of their donuts, so I might go back to splurge on those. But I can check the hot chocolate off my bucket list permanently.", "pics": null}}, {"review": {"des": "I would be lying if I told you I didn't come here soley based on the fact that I saw this place on instagram. So after a burger at Au Cheval, I thought to myself, what better way to wash it down than coming here and getting something sweet.<br><br>It was a heatwave of a day in Chicago, so even midday on Monday there was a little line. To be honest, I was a little overwhelmed by the menu and how to navigate it and really feel like they could make it a little easier to tell what you are getting... ie do you really need to call it a bombolini? like wtf is that. just say donuts. Those looked good but it was hot and i was a little over donuts after hitting up some other donut spots... so I went with a shake but was again a little overwhelmed with all the toppings.  The lady behind the counter was clearly not happy about working there as I had asked her for suggestions and she gave me attitude. I saw that there were a lot of people with the same one so figured it must be popular and decided to go with that and the lady let out an annoyed sigh. <br><br>It was an oreo gelato shake that had some sort of coloring that made it blue? they put a little donut on the straw. Honestly for the price, wasn't anything to write home about. maybe the donuts are better?", "pics": null}}, {"review": {"des": "I'm no donut connoisseur but I know delish. This place is overated. We ordered several bombolini's. The base which is a sugar donut was just eh. Really nothing more to sau than that. Try if you must but delicious it's not. Maybe it's their gelato that's good.", "pics": null}}, {"review": {"des": "The donuts really had a nice presentation but wasn't necessarily the way I like mine. They didn't taste bad but I wanted something they was already fully made preferably with nuts and more choices. Nice location though.", "pics": null}}, {"review": {"des": "My friends and I were stoked about coming here, since we had seen IG photo after IG photo and desperately wanted to get our hands on our own Bombobar Hot Chocolate. I'm glad we came - we definitely got our own Instagram-worthy photos. But the hot chocolate is way too chocolatey and really not that great. The hefty price you pay - if we're being honest - is really just for the design and extravagant appearance of your drink, and yes, for the donut on top that adds that special touch. But one of my friends and I shared a drink and couldn't even finish half of it.. not because we were full, but because the hot chocolate itself is just way too much sweet and all the goodies on top were also sweet. I wonder if they could replace one of the sweets with something salty or just less sugary to taper down the sweetness. <br><br>I'm glad we came for the experience - the place is very cute and the space heaters make it very cozy - but I think one visit was more than enough for us!", "pics": null}}, {"review": {"des": "Initially, I wanted to come here because I'm a sweet tooth and wanted to try the famous hot chocolate options, which I did.<br><br>I personally got the smores hot chocolate. <br>BomboBar makes very instagramable hot chocolates, I can admit to that. But after taking the picture, it's hard to take in everything. I'm glad that I decided to split with a friend. The marshmellows on top is not bad, but the chocolate drink itself is the part that's way too sweet. I ended up not finishing it and not getting full value of what I paid. But, I guess it was worth a try...<br><br>For the instagram: Good<br>For the hot chocolate itself: Okay", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1VJN9GrLCd_swSWG-FY63A/348s.jpg", "caption": "S'mores Hot Chocolate"}]}}, {"review": {"des": "When in Chicago, I had to try one of the top rated dessert spots in town! After dinner, my gfs waited in line for this place. We had to make it worth our while to get a small taste of everything. Here's what we got:<br>Affogato 4/5 - seriously amazing espresso! This is what always what makes the affogato. Simple dessert and simply amazing. <br>Nutella Donut 3.5/5 - I loved that it was packed with Nutella but I have definitely had better! <br>S'mores Hotter Chocolate 3.5/5 - great for your Instagram feed but definitely a sugar overdose. I was a little disappointed that most of it was marshmallow and not so much hot chocolate. The hot chocolate was perfect! So chocolatey and melts in your mouth. A little of the marshmallow fluff was great but honestly was a little much and we ended up tossing most of it. <br>All in all decent dessert place but super tiny spot. Over the top and can cure and sweet tooth!", "pics": null}}, {"review": {"des": "I'll admit when I saw pictures and great reviews for this place I was excited to try it.  I ordered the s'mores hotter chocolate and the donuts (bombolinis).  <br><br>The hot chocolate tasted like I was drinking a melted chocolate bar. It was just too much for me. I didn't even finish it. On the flip side, my fiancé, who has a really big sweet tooth, thought the hot chocolate was bland.  Although it looks pretty and looks Instagram worthy, I basically paid $9 for a picture.  The donuts themselves aren't even tasty. A plain sugar donut should still be delicious even without the flavors. Even with the peanut butter fudge, s'mores, and maple filling it wasn't worth it.  <br><br>The staff are super friendly and helpful when ordering. It was just disappointing to not like any of their food or drinks.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PVOyEHrrAUh-LF7RGlOzLA/348s.jpg", "caption": "S'mores hotter chocolate.... essentially I paid $9 for an Instagram pic."}]}}, {"review": {"des": "BomboBar is a literal hole in the wall that instagrammers and dessert lovers go crazy for. It's a little window on the side of Bar Siena that serves coffee, gelato, and bomboloni (Italian doughnuts).<br><br>If you haven't seen the extravagant presentation of some of their items like the Matcha Made in Heaven or the Hotter Chocolate, definitely check out some photos -- it will really make you want to come here!<br><br>And yes, the desserts really do taste as good as they look. If you need something to cool off during a hot summer day, you should treat yourself to some gelato or a sundae at BomboBar! Alternatively, if you need to warm up in the winter, try the Hot Apple Cider or the Hotter Chocolate!<br><br>Because of the popularity of BomboBar on social media and the fact that their desserts are delicious and beautiful, the line is usually long. It moves pretty quickly though! I've maybe waited 15 minutes at the most. Seating is outdoors and unfortunately, it's pretty small. There's just three regular tables and a bar table on the side of Bar Siena and that's about it. <br><br>I highly recommend trying this place out for yourself if you haven't already!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Y8_967D9t3SwUbkXnh1mpA/348s.jpg", "caption": "Hotter Chocolate with S'mores"}]}}, {"review": {"des": "This is a fun place to check out when you're in the West Loop area! They have a limited menu that ranges from hot chocolate to gelato to doughnuts. I've only had their bombolini and they are pretty good! For those who don't know, Bombolini are doughnuts that come with a squeeze bottle on the side with a filling of your choosing (I always get nutella). <br><br>The reason for the 3 stars is that though the doughnuts are good this place is way too overpriced. Over $3 for a doughnut and $9 for a hot chocolate is really stretching the limit. <br><br>Bottom line: I think it's a fun place to go once or twice but the prices are too high for me to become a regular. But see for yourself and drop by next time you're in the West Loop!", "pics": null}}, {"review": {"des": "I have been seeing bombobar everywhere on my social media and I keep telling my boyfriend I wanted to try this place out for about a year and FINALLY he took me after a nice lunch. You order outside and its card only, I believe. They have menus by the cashier window for you to see what you want of course. <br><br>My boyfriend got a scoop of charcoal oreo which he said it was good but not worth the money and I got the cooler chocolate in white chocolate oreo which was delicious. I wish they did the presentation better but it is what it is. I would say this place is pricy in my opinion but its worth a try.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OMZgB5fVSlUruwXQA5aeeQ/348s.jpg", "caption": "Cooler chocolate (white chocolate Oreo)"}]}}, {"review": {"des": "5 stars, because that may have been the best donut I've had !!<br><br>The bomboloni (an Italian hole-less doughnut) was super fluffy and soft and delicious! We got it with salted caramel, and also tried our friends' vanilla bean custard -- they come in a cute 'squeeze me' bottle and both were very good.<br><br>Also got the funfetti hotter chocolate - which comes with a donut hole and a funfetti cookie. The hot chocolate itself wasn't overly sweet, however it wasn't that warm/hot. The whipped cream was very good though.<br><br>About $14 for both, definitely IG worthy! Wait wasn't that long, and they have heaters inside. Would definitely come back! :3", "pics": null}}, {"review": {"des": "BomboBar is located on Green street which I easily missed the first time until I read reviews where to look. Whoops!<br><br>I ALWAYS wanted to come here. I saw so many of their creative shakes (are they called shakes.. not sure) on the interwebs. I just never made the excuse to come by here on my own. The area itself is very busy so finding parking on the weekends (even week days) are absolutely awful.<br><br>Nevertheless, I did find my way here after walking pass its about three times total. I wanted to try their doughnuts for sure and their shake! Now, their doughnuts are AMAZING. Oh the sugary delight that just makes me hyperglycemia.. No regrets though. I am not a fan of sugar doughnuts, but this absolutely hits the spot. <br><br>I had the Matcha shake as well and honestly. I wasn't as impressed as I thought. It tasted... funny in a way. Possibly a sour taste to it? I love Matcha stuff so I thought I would of fallen in love with it, but I definitely did not. I had to throw half of it away cause I couldn't stand that sour spoiling taste. <br><br>5/5 I would eat their doughnuts all day and all night.", "pics": null}}, {"review": {"des": "4.5 STARS<br><br>The roommate's cousin told us about this hipster looking doughnut spot. Since we were pretty much all donuted-out (I overdid the donuts when we first got to Chicago), we didn't make it a point to check it out. Imagine my surprise when I was at Bar Siena and realized I was also at the very same hipster donut spot! This happened on Tuesday, December 5th around 2:15pm.<br><br>We decided to try their Bomboloni: an Italian hole-less doughnut with Mixed berry, Vanilla bean custard, and Nutella cream (3 for $10). The donuts came fresh out of the fryer, so hot and crispy! So good! With the fillings, they give you a little squeeze bottle and you inject your filling into each donut. There was a good amount for each except for the custard which I found harder to get out of the bottle. Maybe because it was the thickest one? I wanted more custard due to that. The other fillings seemed a little bit runny in comparison. The roommate also got an Affogato: vanilla gelato drenched in hot espresso ($8) which he seemed to enjoy.<br><br>If at Bar Siena, definitely check out BomboBar. I'm a huge fan of malasadas and their donuts are reminiscent of them. Other than the custard one, I wanted the fillings to be a little thicker so they'd stick to the donut. Especially the mixed berry one. Still, if ever in the area, I'd drop by to grab another custard bomboloni. I liked it that much!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WU4R__Mmnh6Id85IGCZJ-w/348s.jpg", "caption": "Bomboloni: an Italian hole-less doughnut with Mixed berry, Vanilla bean custard, and Nutella cream (3 for $10)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1WwN8sCjh-w2eJvcMMWTZg/168s.jpg", "caption": "Affogato: vanilla gelato drenched in hot espresso ($8)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/no_-Q7fslATyEJ8hkzgQ3w/168s.jpg", "caption": "Bomboloni: an Italian hole-less doughnut with Mixed berry, Vanilla bean custard, and Nutella cream (3 for $10)"}]}}, {"review": {"des": "Hot chocolate was great and the donuts survived our 5 hour drive home. Service could have been a little better with explaining the menu you us but was ok.  Fun to try and share!", "pics": null}}, {"review": {"des": "Everything was so good. I was worried the S'mores Hot Chocolate would be overwhelmingly sweet, but it was very well balance. The chocolate was more a dark bitter chocolate that balanced out with the caramel and sweet toppings. It's big enough to share too. <br><br>As for the donuts, I am usually not a donut person, but I loved it. The little sauce jars are adorable and they taste delicious too", "pics": null}}, {"review": {"des": "My friends and I came to visit Chicago and we didn't wanna leave without trying this place out. Based on the review I've read, many people say it's always busy but I think we got pretty lucky because we went here on a Saturday and it wasn't busy at all. I'm giving this place 4 stars only because the place is really small, you just order through the window and it's just outside seating, luckily the weather was perfect. But other than that, the donuts we ordered were DELICIOUS. My bf and I got the Nutella cream bombolini. What stood out to me was that the donuts came with a mini squeeze bottle to squeeze out the cream, which I thought was creative. They were also very creative with their other desserts. Will definitely come back and try their other desserts when we come visit again!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ELGj0akoHSPfw3yGHQmPUA/348s.jpg", "caption": "Nutella cream, s'mores and salted caramel donuts"}]}}, {"review": {"des": "If there's anything i love in the winter time it's got to be hot chocolate and donuts and bombobar does both so win win!<br><br>When we came back home during Christmas '17, we made a pit stop here. My husband got the s'mores hot chocolate and i got the funfetti hot chocolate. They top it off with a lot of whip, cookies and a mini donut (bomboloni). It was so good and definitely needed on those cold Chicago days! But it does get rich after a while so you can definitely split it with someone else (if you want to share!)<br><br>Next time we go, i definitely want to try the flavored bombolonis and when it's warm, their coolers!", "pics": null}}, {"review": {"des": "Who can say no to Nutella-stuffed donuts? The line can get long but a fun stop for dessert in the neighborhood, just make sure to leave some room for it. A quick fix, bring a friend after grabbing dinner or drinks.", "pics": null}}, {"review": {"des": "I first heard about this place watching one of their videos on Facebook.  After that I knew I had to try out their goodies.  Their cold chocolate is pretty good, very sweet.  I love the touch of decorations on top to make it stand out!  My favorite had to be their bombolini or donuts.  You can choose a flavor, which has a bottle of creme flavor you can squeeze into your donut.  That was definitely my favorite.  The drinks and donuts came out pretty fast and they have a small patio area outside you can sit and chill with your dessert!", "pics": null}}, {"review": {"des": "Instagram worthy drinks and donuts? Count me in! I was visiting from Hawaii and we don't have anything like this yet. Located in Chicago's West Loop, we came here after eating at GATG. This little dessert spot has a walk up window where you order and take your delicious treats to-go or eat them at the tables out front.<br><br>We got 2 bombolinis (Italian hole-less doughnuts) for $3.50 each. During the time that we went (June 2017), they were not making the hotter chocolates, we so ended up having to get the s'mores and matcha green tea drinks COLD. We were a little disappointed, but we made the trip and were already there... so instead of complaining we just got them for a steep $9 each. Being that it was already a little chilly, these drinks did not help in keeping us warm...I suggest before going to make sure that they are indeed serving the hotter chocolates. I preferred the s'mores cooler drink over the matcha green tea...but be warned. You are going to be in for a major sugar rush. The drinks are super rich and sweet.<br><br>The bombolinis have an interesting concept. They each come with their own little squeezy bottle and you get to control how much filling your donut has. It's pretty cool! But no different than a regular jelly or cream filled donut. Overall, a very expensive place to get appealing foodie photos. A generous 4 out of 5 since I can't complain...they are nice pics and who doesn't love desserts?", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qZzOqJ-3xEqPeQ2YTVO0SA/348s.jpg", "caption": "Matcha & S'mores drinks~"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lDRcKDXU6-eyTDrS_nX7yw/168s.jpg", "caption": "S'mores drink~"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zbUXsZDDO1Wqrghrg0wHjQ/168s.jpg", "caption": "Bombolinis~"}]}}, {"review": {"des": "SO overrated! I'd been looking forward to BomboBar for a long time (thanks to all the social media hype), but it did not live up to expectations. <br><br>Knowing I'm not a big donut person, I was still excited to try the drinks and gelato offerings. I got the \"Cooler Chocolate\" in the Chocolate Smores flavor, while friend got the White Chocolate Oreo flavor along with a Stracciatella gelato cone. Both chocolate drinks melted insanely quickly, and mine didn't taste much like Smores at all. The gelato ice cream was also sub-par. I might come back another time when they have the hot chocolate, but all in all this place is just not that worth it! There is better shakes/donuts/gelato to be had, and at better prices.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Voir1_KIRG8sIBBX_tDJ7g/348s.jpg", "caption": "Smores cooler chocolate + white chocolate oreo cooler chocolate"}]}}, {"review": {"des": "We got the Hotter Chocolate which is big enough to share for 2. It comes with a biscotti like sugar cookie and a doughnut. <br><br>It's hot chocolate with whip cream on top. They put the sugar cookie in the hot chocolate so half of it is soaked and falls apart right away.<br><br>The hot chocolate is good. It's on the sweeter side and when you add on everything, it's even sweeter.<br><br>I recommend it to everyone. I liked it but I would definitely share it.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NC5Y6KGAwj5Pv72eTj8CyQ/348s.jpg", "caption": "A hotter chocolate"}]}}, {"review": {"des": "I was really looking forward to Bombobar because of the epic photos on Yelp, but it was underwhelming. We ordered a \"cooler chocolate\" which is basically like a frozen hot chocolate or a chocolate slush (it's not as thick as a milkshake). We picked the S'mores flavor but I think it was just chocolate overload. We couldn't even finish, and we love dessert! It comes with a mini donut which helped cut some of that chocolatey sweetness out and it actually was a good donut. Bombobar is just a window with a few outdoor tables and bar seating, so if you're coming in the winter (you can get hot chocolates during the cold season instead of the cooler chocolate drinks) then you better order to-go! Overall it was a place that I could've been okay skipping out on, but at least I got that picture for the 'gram.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/atXquhYm9FxI_c2o4DIiyQ/168s.jpg", "caption": "S'mores Cooler Chocolate"}]}}, {"review": {"des": "Your typical Instagram-able dessert spot that will give you a sugar rush for hours. I came here on a Tuesday night to try their famous bombolinis. They're essentially donuts without the home in the middle and come with adorable \"squeeze me\" bottles that you use to squeeze filling into your donut.<br><br>I tried the s'mores and salted caramel bombolinis. The donuts come out HOT and they practically melt in your mouth as soon as you bite into them. I also tried the charcoal Oreo gelato (highly recommend) with a mini bombo on top. Very cute presentation and the gelato was creamy with a good amount of Oreo chunks in it.<br><br>I really enjoyed trying this place but I'm giving it 3 stars because it seriously is a sugar overload. I'd come back to try another one of their gelato flavors but probably not another donut. It was good and memorable, but I'm just not a donut person and this was too sweet for me to try again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/u8_eIBw-wMJuCzqzAj8-5w/348s.jpg", "caption": "Original, salted caramel, and s'mores bombolinis ($3.50 each); Bottom right: Charcoal Oreo gelato with a mini bombo ($5)"}]}}, {"review": {"des": "This concept is just very cool! You order delicious donuts and coffee through a window which you can then eat in standing at their little bar or at a small cafe table within the seasonal enclosure. <br><br>The donuts are cheeky in their design: all vanilla donuts with a delicious sugar crust, made into different flavors and experiences by their fillings which are injected by the diner using a squeeze bottle.<br><br>We ordered Nutella, vanilla bean, and mixed berry. Nutella and mixed berry were beyond delicious. The vanilla bean was a bit flavorless, but I squeezed in some extra jam for flavor. Overall, really yummy!", "pics": null}}, {"review": {"des": "This place was the bomb! The 9 dollar hot drinks are so worth it. We ordered the hot chocolate and the apple cider. Both were so deliciously good and big. <br>This place is not the typical coffee kind of place. You order from a window outside and although they have one of those portable covers now, it's a bit cold. They have some benches along the wall with a stand heater. It was about 45 degrees outside when we went and it was very nice. <br>If they open an inside coffee, this place would get so much more business. I would probably drive to the city every weekend to get my sugar load.<br>I plan to come when ever the weather is not so  cold.", "pics": null}}, {"review": {"des": "Really good donuts, on the oily fried side but what donut isn't? Salted caramel was definitely the best one for us!", "pics": null}}, {"review": {"des": "The most Instagram-worthy hot chocolate in town... with a fun, memorable name to back it up! While more known for their coffee, gelato, and bomboloni (hole-less, Italian donuts drizzled with your choice of sauce served in a cute little squirt bottle), I had my eyes on the REAL prize on that dreadfully cold, below 0 degrees day when I dropped by: their \"Hotter Chocolate.\" Whether you opt for the rich, decadent S'mores flavor or whimsical, colorful Funfetti flavor, both gourmet hot chocolates are filled to the brim with yummy treats. I ordered the S'mores Hotter Chocolate, and it had marshmallow fluff, chocolate biscotti, chocolate and caramel sauces, chocolate crunchies, graham cracker crumble, and a donut to top it off. Talk about piling on the goods! <br><br>As others have mentioned, this place is LITERALLY a hole in the wall with limited outside seating. Not a problem during those beautiful Chicago springs and summers, but not fun during those miserably cold winters! They do have a small, covered booth over their order window, so you're somewhat shielded from the elements. With a line, you'll probably be waiting 10-15 minutes at the most. When I visited over the holidays, we were a bunch of strangers packed into that tiny little booth... warmed only by each other's body heat and the idea that we'd soon all have some delicious, hotter chocolate in hand. Parking in the city is awful, so if you're coming by car, I recommend having someone stay behind with the car running and parked along the street for a quick getaway after you get your treats.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EdQdsWgHWE3dE8G9kphYUQ/348s.jpg", "caption": "S'mores Hotter Chocolate ($9): hot cocoa topped with marshmallow cream, biscotti, caramel, tons of chocolate, & donut"}]}}]}