{"name": "bongiornos-italian-deli-and-pizzeria-chicago", "reviews": [{"review": {"des": "I live by this place and I was a little hesitant to try it because it's in a touristy area, next to a major hotel. However, I was BLOWN AWAY by this food and the prices. The pizza (10 inch for 6 dollars) is literally the best pizza I've ever had. It's very simple, but the traditional sauce and cheese and crust works together beautifully. <br><br>My husband loves the Italian beef and we also love the Parmesan chicken. This is our go to place whenever we are craving Italian. Like I said before, the prices also can't be beat. <br><br>If you're in the area, definitely stop by this place. You won't regret it!", "pics": null}}, {"review": {"des": "Nice inexpensive place to get thin crust pizza and other Italian fare or maybe gelato before you hop on a river tour.<br><br>They have a 10\" pizza for one that is like 6.95 and a larger one for two for about $15.  Their salads were good and fresh and the butter pecan gelato was great.  They have 12 different flavors.<br><br>Friendly wait staff and relaxed atmosphere.", "pics": null}}, {"review": {"des": "Pizza was promised between 45-60 minutes. After an hour I called and the guy on the phone was so incredibly rude and defensive. He said the streets are crazy and that it's out in a delivery car. I'm a 10 minute walk from the place. 90 minutes later and no pizza still.<br><br>Just got the pizza. Burned! It's too dry to chew.", "pics": null}}, {"review": {"des": "The ravioli and gnocchi was outstanding. Can not believe how well priced everything is especially in such a prime location! We got mint gelato for desert and it was some of the best mint gelato these taste buds have ever had.", "pics": null}}, {"review": {"des": "I go here often when I have appointments in the building.  The pizza special is amazing, its a 10\" pizza for $6.95 and you can't beat that deal in this part of town. The antipasto is INCREDIBLE. You get so much meat and cheese for the price.  The eggplant is delicious, all the sandwiches I've ever had were amazing, and the prices are fantastic.  I will be back. Thanks again, Bongiorno's!", "pics": null}}, {"review": {"des": "A true \"hidden gem\" as this place is hidden near the Trump tower. Authentic Italian eats at incredible prices! My husband found this place on yelp, and we also saw it walking by, so we decided to stop here for lunch on a Saturday and they were not busy. Friendly staff and variety of food and dessert.<br><br>My husband and I split a whole Caesar salad and a 14\" prosciutto e funghi pizza. The salad was crisp, cold, and delicious - just what I would expect out of a Caesar salad.<br><br>The pizza, delivered as soon as it was taken out of the oven, deserves a 5 star rating! Similar to Neapolitan pizza, the sauce was a simple, sweet red sauce, not too much cheese, and fresh toppings. I love fresh mushrooms on pizza and they also surprised me with covering my pizza in tons of fresh mushrooms. <br><br>Would definitely come back on my next trip to Chicago!", "pics": null}}, {"review": {"des": "This pizzeria is like a hidden gem on Mag mile.<br>It was a little difficult to find through the Google maps, but once you do, you're going to return for sure.<br><br>The tiramisu for desserts is a must try. Its made a lil differently than the average cakes with the hotdog kinda sponge. Totally delish!<br><br>On the contrary, the pizza was meh... <br>I tried the caprissiosa with chicken. The black olives tasted like they were right out of an old can with the strong essence dominating my taste buds.<br><br>Another trivial disappointment was when I did not get the side of ranch I had ordered. <br><br>Overall, I would recommend this place and will visit again to try other options. <br><br>Oh and  I couldnt help but notice that the busser at this place is very polite and sincere.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OVsueKB-vFfJNz2VK8WU1A/168s.jpg", "caption": "Tiramisu cake.. toppled over goodness"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fxsPw58I8ejVKi5NSdP-8A/168s.jpg", "caption": "Tiramisu"}]}}, {"review": {"des": "Really, the best Italian beef dip sandwich ever. It was that good. Super fresh bread with a thick crust and soft interior, great meat, cheese and grilled onions and peppers. A hot cup of au jus, and a cup of gardiniere peppers. Amazing.", "pics": null}}, {"review": {"des": "This a fantastic, quaint little deli which happens to make delicious thin crust pizza.  I got their personal pizza which was under $10, plus a Peroni and a Goose 312 beer to wash it down.  <br><br>I got half cheese, which had the best tasting mozzarella, and half pepperoni, which is baked-in and buried below the mozzarella.  DELICIOUS!<br><br>I enjoyed the atmosphere and the service was on point.  They have WiFi and televisions for those who need distractions.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jc4gzogF45QVnTP50kYiLw/348s.jpg", "caption": "Personal size pizza: 1/2 cheese and 1/2 pepperoni (which is baked in!). Soooo good!!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2H8QMFX5BKRHMTwINea2bg/168s.jpg", "caption": "Nothing says Chicago like Goose Island"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AogTzfY86glmoP_35qo2Qg/168s.jpg", "caption": "Interior perspective of the bakery & gelato area"}]}}, {"review": {"des": "Located right by trump tower and you have to go inside the building to find the place on Wabash. We ordered lasagna, pizza and spicy spaghetti   . It was all fresh. The pizza is higher recommended just like the authentic traditional pizza from Italy thin crust and very blended .Lasagna is juicy and saucy. Big portion. will definitely comes back. Very reasonable price in downtown chicago", "pics": null}}, {"review": {"des": "Hole in the wall pizza place with excellent salads, calazone and pizza. The Anti-pas to board was phenominal. Also recommend the beet salad.", "pics": null}}, {"review": {"des": "I don't know what happened? From best pizza delivery to the worst. Although delivered on time. The original crust was extremely thin and soggy and the cheese literally shifted off the top into the corner of the box and did I say GREASY! Off on my search again for good pizza.<br>I hope eating in is still a good experience.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RaTqQ5LJU5qo7bv9DJ5jig/348s.jpg", "caption": "10\" pepperoni and 10\" cheese."}]}}, {"review": {"des": "2 stars for \"ehh\" food. 1 star for service. 0 stars for value. <br><br>NOT RECOMMENDED: paying your delivery order with cash because they'll just walk off without giving change & assuming a 21% tip.<br><br>Ordered delivery to my hotel & Bongiorno's appeared at the top of my Yelp suggestions list (based off distance & ratings). <br><br>Got a pepperoni pizza (small sized with about 7 slices). Added on mushrooms and ricotta cheese. If you've been to Italy, it's exactly what their pizza reminded me of. Taste wise, it was okay. Nothing extraordinary about the toppings or crust. Didn't seem like there were any seasonings or herbs. No parmesan cheese or red crushed peppers were given. <br><br>Also got the soup of the day (potato/leek), which was about 16 oz with some saltine crackers. It was surprisingly good. My boyfriend was sick & liked it. Was perfect because it wasn't too salty or plain, & was very light. Didn't need to use the saltines.  <br><br>Probably won't try to dine in or order delivery again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VxNl2X7J2bONjL1VrSg0gw/348s.jpg", "caption": "Delivery for this pizza and soup of the day = $33"}]}}, {"review": {"des": "This little place is hard to find but fantastic!  Such a cute little neighborhood feel restaurant.  Great prices.  Excellent pizza special. A must do when in River North. They actually have fresh brewed ice tea and as a southern girl that made me sooo happy!", "pics": null}}, {"review": {"des": "My mom, brother, and I went here on a Saturday night while we were visiting Chicago. We were pretty hungry and saw on Yelp that this place got good ratings and had decent pricing, so we popped in and were seated within 10 minutes. We ordered two regular sized pizzas-- one Patate e Rosmarino Pizza and one Prosciutto e Funghi, as well as one personal Rustica pizza. <br><br>Twenty, then thirty, then forty minutes went by, and not only did not a single waiter had stopped by our table, but our food had not come out yet nor was the lack of food addressed in any way. We finally waved down our waiter and asked him where our pizzas were, and the he begrudgingly told us that the pizzas were running slow today and that \"I can only move as fast as my kitchen,\" before running off again. We waived him down once more and asked for some bread since we were starving, and were given a small, cold loaf to chew on. I saw another couple stand up and leave before even receiving their food, and I wish we had done the same, because it was another 20 minutes before we finally received our pizzas.<br><br>My mom asked to speak to the manager. The owner of the restaurant came out to speak to us and agreed to take $20 off of our bill. However, when the bill came out, the total price was reduced by 20%, not $20, and we had to speak to another waiter to fix it. <br><br>Overall, the food was mediocre and the service was terrible. We ultimately stayed for an entire two hours at this place, spending over half of the time waiting, angry and hungry. If you're looking to dine in, I would absolutely not recommend this spot. Definitely a cheap take-out pizza place.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DnULZYS4DAdwVC09Qeu40w/348s.jpg", "caption": "These took 1 hour to come out."}]}}, {"review": {"des": "Looking for some good Italian food as gelato at a low price and down to earth vibe? This is the place for you! The ambience here is really refreshing and a nice place to escape the high end or presumptuous city restaurants. The owners are really great too. I had a calzone that was cheap and pretty good (not amazing, but good). The lasagna looked amazing and was definitely a crowd favorite. <br><br>So why not 5 stars? My husbands chicken parm (per him) left some to be desired. For the price ($16?) it isn't worth it. The side pasta was nothing to write home to mom about either. Their tiramisu isn't very tiramisu-ey so I don't recommend it (just get the gelato!)", "pics": null}}, {"review": {"des": "ANAZING I went in last night and had the Pizza Regina (w mozzarella cheese, arugula, tomatoes, prosciutto and shaved Parmigiano) it was amazing I love it it was highly recommended by our server next time I'm in town I'll be coming back for more", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OWEx0funHapgqa9WVBMmkA/168s.jpg", "caption": "Pizza Regina"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DPXqoZuQRetHSUKahLm44w/168s.jpg", "caption": "Pizza and wine"}]}}, {"review": {"des": "Cute little hidden gem right off river walk and near the shops of Nordstrom.  Loved the outdoor seating and flowers around the fencing.  The waiter was prompt and helpful.  The chicken parmigiana was outstanding as well as the Caprese salad and the Saporito salad.   We enjoyed gelatos walking home", "pics": null}}, {"review": {"des": "Fresh off the plane and no food in the fridge so pizza delivery it is. I used yelp to order online, and the system seems to have improved. Or maybe Bongiornos just has a good handle on it cuz my pizza was delivered in less than an hour! So great. <br>I got the rustica, which is thin crust pizza topped with mushrooms, sausage, and onions. Delicious. I only wished the sausage had some spice to it, but throw a little crushed red pep on there and you're good to go <br>The whole kit n caboodle cost me ~$25 but the one pizza will last me two meals. And anyway, I'm happy to pay the delivey fee when it's that fast and saves me a trip out into the freezing Chicago winter!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/G-vPZcIHESILzKRvORIPLA/348s.jpg", "caption": "Rustica pizza for the win"}]}}, {"review": {"des": "What an adorable little place! <br><br>Stopped in on a Sunday afternoon for a late lunch. It was a little difficult to find, but we made it! The atmosphere is casual yet intimate. Traditional red and white checkered tablecloths and pleasant music in the background.  When the weather allows, they also have a nice patio outdoors. Several delivery/to-go orders were passed through while we were there, so this must be a go to for locals! <br><br>Our waiter was friendly and helpful. We started off with a couple of beers and a caesar salad. For our meal we had the Fiorentina pizza and an order of spaghetti with bolognese sauce. Both were flavorful and delicious. We were left feeling full and unfortunately didn't have room for any of the gelato or cookies they offered! But they did look very tasty. <br><br>I would definitely return if I am back in the area!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZXr-9Lns9q0PPQpgNE6wxQ/168s.jpg", "caption": "Outside"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ocdvrCNxXP2cBgDepfljHw/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "A place for delicious thin crust genuine Italian pizza. We ordered two large pizzas to split between five people, one rustica and one half prosciutto e funghi and half fiorentina<br><br>I also ordered two scoops of gelato, the mint chocolate and the cappuccino. The mint chocolate was definitely of higher quality, but it was delicious for the price!<br><br>Would definitely return if I lived in the area!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5NZet8_yrik6hlsydEienw/168s.jpg", "caption": "Gelato"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yNQ53yaVKFavYptcNX1gPw/168s.jpg", "caption": "Rustica Pizza"}]}}, {"review": {"des": "Worst pizza delivery in Chicago. They quoted 45-60 and after 90 minutes of waiting, I called and spoke with their manager,Tom who made excuses for why the pizza still had not arrived. Then their 3rd party dispatcher called and told me that the driver would arrive soon.'<br><br>The restaurant was located 3 miles from our hotel and after 90 minutes, our pizza still had not arrived.<br><br>There are many wonderful pizzerias is Chicago, don't waste your time with an amateur place like this.", "pics": null}}, {"review": {"des": "This is a decent spot to get your thin crust pizza fix. It's super cozy inside and exudes a casual cafeteria vibe with the plastic red water cups. There's not a whole lot of seating inside and it seems like take out is very popular. <br><br>I tried the mushroom and prosciutto pizza- I liked the chewy crust (which is my favorite part of the whole pizza), but the center of the pizza was quite soggy and didn't hold its shape. I also didn't really care for the prosciutto and would have preferred just the mushrooms. One pizza could easily serve 3 people.<br><br>I loved the eggplant rollantini. They load it up with cheese and tomato sauce, which is perfect for scooping up with the crusty bread served hot out of the oven. I would come back here to get this dish.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WA9tlgIerLyHx0keb8IlRA/168s.jpg", "caption": "Eggplant rollatini"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5V9laThvhFhXXYer-qNgow/168s.jpg", "caption": "mushroom and prosciutto pizza"}]}}, {"review": {"des": "Who doesn't love pizza?  Especially in a cute place off of Michigan Avenue.  We had dinner there last night and enjoyed the meal and the experience.  The inside is quite cute and I look forward to warmer weather and being able to sit outside on the patio.<br><br>We started with two glasses of wine - which were generous pours!  We then split the Di Rucola Full Salad and the Calabrese 14inch Pizza.  If you like a little spice, definitely get the Calabrese pizza with hot salami and jalapenos.  Both had a bit of a kick and were a good combination.  I do wish the crust of the pizza was a little thicker in the middle so I could pick it up, but it was a tad too flimsy with the sauce.<br><br>Our service was good and their gelatos stand looks really good for a summer treat...we will be back to try them both.", "pics": null}}, {"review": {"des": "What a unexpected pleasure to find this little spot. This location isn't on the main drag and unless you know what and where to look it could be missed.<br><br>The place is small but it comes with big flavor, the owners take pride in what they make and it shows in the end result. My son and I ordered a pizza with onions, sausage and pepperoni. I know your in Chicago and deep dish is where it's at. However growing up in New England and around that style pizza says a lot. I would put This pie against any northeast pizza. Just fantastic, the crust was perfect the toppings didn't soak through and it was delicious to the last bite.<br><br>My daughter had the ravioli which was gone in seconds, and my youngest son had the person cheese pizza. More than enough for one.<br><br>I know you don't think thin crust in Chicago, but maybe you should. Check this place out, it won't disappoint.", "pics": null}}, {"review": {"des": "Seriously good pizza! Their personal pizza special for $6.35 everyday can't be beat - amazing pizza, perfect size. Garlic bread, with or without cheese, is also a great option for an appetizer. We haven't yet tried the gelato, but we're always super tempted. Love this hidden gem in river north!!", "pics": null}}, {"review": {"des": "This is one of my FAVORITE pizza places in Chicago. This venue is small and intimate. They do have some outdoor seating when it is warm outside. Finding the place is a bit difficult; it attached to the bottom floor of an apartment building. <br><br>I have been on the search for a great thin crust pizza that reminded me of NY pizza, and this place is it! It tastes like the quality of pizza at Eataly, however its half the price (which makes it that much better). I love that they have the individual pizzas; for the price and quality, these pizzas can't be beat!! They have a plethora of ingredients that can be added onto the pizzas; you just have to ask though, as they are not listed on the menu. <br><br>The beet salad with the blue cheese dressing is also delicious. It's a great starter to the meal. I wasn't as much of a fan of the arugula salad; it was a bit bland and basic, so would definitely pass on that next time. <br><br>I've ordered a couple of different pastas, however I'm not a huge fan of them here. I've gotten the gnocchi with the vodka sauce, which was delicious and the gnocchi melts in you mouth, however it was a bit rich for me, so sharing a small order between 2-3 people was good enough. Overall, I've had better pasta elsewhere.", "pics": null}}, {"review": {"des": "I got the vegetarian calzone and asked without cheese. It was not only yummy, but HUGE. I didn't realize how big it was. The crust was my favorite part. Definitely recommend this spot!", "pics": null}}, {"review": {"des": "Quick spot to grab a tasty pizza.  I've always done takeout and it has always been hot and ready when they say.<br><br>I also tried their cannolis, VERY GOOD!  Love the extra little sweet red sauce they top them with.", "pics": null}}, {"review": {"des": "Quaint little spot for lunch or dinner. They have $6 personal pizza (cheese, pepperoni, sausage or veggie) which is a great deal. I got the veggie pizza which came with zucchini, bell peppers and eggplant. Overall, I thought it was pretty standard thin crust. Nothing amazing but filling and well made. <br><br>My biggest complaint was the wait time. We came for dinner around 6pm on a Saturday. There were a couple other tables but the place wasn't super busy by any means and it still took over 30 min for our food to come out.", "pics": null}}, {"review": {"des": "Great little place tucked away in a plaza. Food was really amazing. Ordered the chicken milianese but was brought the chicken parm. There was some confusion with the waitress so kept the parm. Parm was very tasty with lots of pasta and cheese. Also had the garlic cheese bread and meatball sandwich - both very good. <br><br>Noticed the folks at the next table ordered the pizza and that smelled amazing. Can't wait to come back here.", "pics": null}}, {"review": {"des": "The Best damn pizza I've had in a long time. I had the  Pepperoni and Mushroom 10\" and it was fantastic. The pricing is extremely reasonable. A 10\" pizza for $6 I mean can you really beat that!?!? Everything tasted fresh and authentic. I was very impressed! There's a bit of construction nearby so finding it was kinda difficult. The staff was very friendly and knowledgeable. I'll definitely be back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Rt0R0hIN7lBl0naVQ5LMxw/348s.jpg", "caption": "The Best damn pizza I've had in a long time. I had the  Pepperoni and Mushroom 10\" and it was fantastic!"}]}}, {"review": {"des": "Not impressed... ordered at 6:23 PM and got my medium pizza and small Caesar salad at 8:14pm.<br>I really wanted to give them the benefit of the doubt, since it Saturday night. I called them at 8 o'clock for the hostess to tell me that the delivery went out a while ago & that she will call the driver to see where they are at. Even gave them a two dollar tip after making me wait 2 hours. But when the pizza got here honestly I was disappointed it was literally at room temperature and so soggy but burnt on the bottom.. and the prosciutto (with me being Sicilian)it wasn't fresh <br> wth ‍<br>I uploaded pictures for you to see for yourself. I'm from Chicago I know Chicago pizza.. this is not it. <br>I guess it must get all of its rave reviews from people out of area.. I will NOT be ordering from here again.", "pics": null}}, {"review": {"des": "This is currently my favorite spot downtown. Hidden right next to \"he who will not be named's\" hotel. Service is excellent. Food is awesome. In the land of nasty deep dish pizza, this place is amazing. Pasta is good too.", "pics": null}}, {"review": {"des": "Homey, lovely staff who are so helpful and take the time to walk you through the menu, and top it off with amazing food. My sausage, pepperoni and onion pizza came quickly and was so delicious I had to eat the entire thing, including the entire crust. So glad to have taken a local's recommendation to try this quasi hidden gem. <br><br>Amazing value, and worth making the time for great food.", "pics": null}}, {"review": {"des": "We recently moved to the city and so far I've enjoyed this pizza place the most. There's good food and it's cheap which I love. A lot of the pizza spots in the city are overpriced and not worth it in my opinion. My wife and I are pizza lovers and both agreed that we will be coming back here soon!<br><br>We've tried Giordano's, Gino's East (2nd favorite), Lou Malnati's, and Sarpino's to name a few.", "pics": null}}, {"review": {"des": "This place is so good and the location is perfect! Our server was really nice and sweet. This place got busy real quick but we came just in time. The pizza, sandwiches and lasagna was great!", "pics": null}}, {"review": {"des": "I've been coming into Chicago a lot for the past 5 months and I think I order the same thing from these guys at least once every time I do.<br><br>Garlic Bread.<br>Bacon + Pepperoni + Mushroom Pizza<br>Tiramisu<br><br>My waist line may regret it but my love of delicious pizza is always satisfied.<br><br>REALLY fast delivery too.", "pics": null}}, {"review": {"des": "I have been in downtown Chicago for a week now for work and this is by far the best place I have eaten. Just like I was back in Italy. The sauce is amazing. Also, the prices are super reasonable. I'll definitely be back!", "pics": null}}, {"review": {"des": "This is a hidden little place in the heart of the city. We had 8 in our party, 4 adults 4 little kids. It was great! Food portions were huge and the place is very kid friendly. Very Italian(family orientated). The prices were much cheaper then expected for a downtown middle of a city restaurant. If you find yourself in Chicago and need a quaint place to eat, Go here! Service was pretty quick and the owner and his daughter were so friendly! I'm glad we discovered it!", "pics": null}}, {"review": {"des": "Great food! Service not bad, for the area and prices, awesome!!!!!! My posting not long enough to ok I'll write more and more and more. Is that good? Thanks ok my wife said service was terrible! But for the prices and good food!!! This place rocks! You pay for what you get.   I will be back! The eggplant sandwich with no souce was delicious!", "pics": null}}, {"review": {"des": "Good Pizza! Great Price! Totally worth it in my opinion! Didn't wait long at all and everyone was kind. Will definitely be coming back next time I'm in town!", "pics": null}}, {"review": {"des": "Great pizza, fair prices and good service. If I had to give 5 stars I would have to had a more engaged waitress/waiter.", "pics": null}}, {"review": {"des": "I ordered delivery and it arrived within 30 minutes! The veggie pizza had a balanced assortment of veggies. The crust withstood all the veggies without any spillage! Also, the sauce to cheese ratio felt spot on. I will definitely be ordering from Bongiorno's again.", "pics": null}}, {"review": {"des": "Food was excellent! Margherita pizza, chicken parm and ravioli. We had it delivered to our hotel. It took a very long time for delivery. I'm not deducting points because lalapalooza was killing the downtown traffic.", "pics": null}}, {"review": {"des": "This place is amazing! I was running late to pick up an order and they were so accommodating and friendly, incredible service. My pizza was spectacular, delicious crispy crust and perfect flavouring.", "pics": null}}, {"review": {"des": "Overpriced and underflavored.  The pizza sauce was sour and tasted like it came from a can.  Did not care for the cheese and the crust was chewy, but not in a good way. <br><br>We ordered seven pizzas because we had a hankering for New York style pizza.  The people who say that this is New York style pizza have clearly never had good New York style pizza.  This is worse than the stuff you get get on the street for a dollar a slice.<br><br>Not. A. Fan.", "pics": null}}, {"review": {"des": "Food and service were awesome. The staff was great, from our waiter to the lady that served the gelato. A tip for any new-comers...the prices on the menu are for the 14\" pizzas but the 10\" pizzas range from $6-$10. When I went with my wife, we got two 10\" to share and had more than enough. We saw pasta being served to others and it looked delicious. Pizza and dough are great. Large bottled beer selection as well as San Pellegrino. Nice Italian desert selection such as tiramisu and cannoli. Fast service and very little wait on the fresh food. All in all, a fantastic experience.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sIWKm1fm7EkMYqhGs9p4mA/348s.jpg", "caption": "Pistachio and Nutella Gelato"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fmBslpotPlPZIkzgTKyolQ/168s.jpg", "caption": "Porcini 10\""}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MqY9dvBSxDWqVZPMNdAv8w/168s.jpg", "caption": "Pepperoni 10\""}]}}, {"review": {"des": "Everything we had was absolutely exceptional. A must stop when visiting the Windy City.", "pics": null}}, {"review": {"des": "What a cute hidden gem away from the hustle and bustle of Chicago. <br>I had the Italian beef sandwich, which came with dipping sauce/ beef jus. The sauce made the sandwich softer and easier to chew, and made the beef even more moist. <br>Prices are reasonable too.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/278IG8QoAVHjMPBGiCnCMQ/348s.jpg", "caption": "Italian beef. The beef jus was so good."}]}}, {"review": {"des": "Pizza is probably the easiest dish in the world that more people disagree on.  So if you are one of those hardcore Chicago vs New York pizza types or thin vs thick crust people, my review may not help you too much.  It's not that serious to me.  <br><br>But Bongiorno's makes a really good pizza, in my opinion.  They have a $5.95 personal one topping pizza everyday for lunch and it's delicious.  It's a real thin, crunchy crust but the sauce is really good.  I personally like a little more cheese on my pizza but overall the taste is great.  Coming right out the oven and you can't beat it at all.  <br><br>It's a small place but it has an outdoor area too.  Looks like a little neighborhood restaurant which is a rare find in the Loop.  Staff is always nice and the pizza doesn't take long at all.  One of my favorite lunch spots.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yHbeqRJ2MroNeiQZpe0PIQ/348s.jpg", "caption": "5.95 10\" personal pizza"}]}}, {"review": {"des": "Pizza was of NY quality. Options on the pizza were fun and tasty. Great idea to offer truffle oil on the pizza (gave it a great taste). One struggle of this pizza is that it got a bit soggy in the middle, the outer crust is close to perfect, but the middle is just too thin for all the ingredients and so it doesn't hold the flavor or texture like a traditional NY pizza will. <br><br>We will come back here for sure and look forward to trying different toppings.", "pics": null}}, {"review": {"des": "Bongiorno's has GREAT New-York style pizza, that will be ready for you in like 10 mins! The crust is crispy and the cheese is sooo yummy and greasy and fresh. I'm so happy the bf found this place!<br><br>I also had the minestrone soup which was a good portion, big enough to split between 2. It had wonderful tomato base flavor and SO many vegetables, from carrots to beans to cauliflower. Perfect. <br><br>The pizza we ordered we asked for sausage, onion, and green pepper. The sausage was good but honestly my favorite topping was the green pepper because it was diced so finely. It added a super crispy and sweet flavor to the pizza.<br><br>Bongiorno's has a basic wine and beer selection to compliment your meal. Beer and wine prices are reasonable, and so is the pizza, making the place even better!<br><br>I would def recommend Bongiorno's;probably the perfect place to duck into if you've been shopping on Michigan.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8UTxk_ERt0NRzAFPetk_wA/168s.jpg", "caption": "Sausage onion and green pepper 14\""}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_3UnveI0yrMSWEImLQDecw/168s.jpg", "caption": "Enter off of Wabash or cut thru Trump plaza from Michigan"}]}}, {"review": {"des": "We came here hoping for an authentic Italian beef sandwich.  They offer a deconstructed version.  No thanks.  Instead we got delicious pasta dishes, lasagna, gnocchi, and Italian cold cut and hot sandwiches.  They were delicious and fresh. Good quality ingredients.  The wines were reasonable for a glass too.  The desserts were also well made.  I'm torn between 3 and 4 stars because of the beef sandwich and the espresso was bitter with no foam.  They need to up the game on espresso!", "pics": null}}, {"review": {"des": "This is my favorite and family favorite pizza joint. It's a small place, but they make really good pizza. It's a hidden gem. $6 personal size pizza, the cheese and the sauce is quality. It's a local favorite.", "pics": null}}, {"review": {"des": "I was visiting from Tampa....I was delighted to find this place!  I've not had anything like this in Tampa.<br><br>We did need help finding this place.   I will say that finding restaurants in downtown Chicago seemed like a scavenger hunt to us multiple times.   The restaurant could be down the stairs below you, 2 floors above street level,  etc.  We decided to go DOWN to try to find this one,  but a kind soul yelled at us, 'HEY!  DID I HEAR  YOU SAY YOU'RE LOOKING FOR 405?'  Awesome!  Go UP from the street into the building (even though it looks like a pick up/drop off spot for a hotel).<br><br>We ordered the sarda pizza as well as a rustica pizza with the antipasto salad.   OK, it took awhile,  but they were soooooo nice.   And the pizza was like music in my mouth.   Just...simply...delicious!!!  There's a great wine selection, too, and my bros were excited about the Italian beer that is offered. <br><br>We were given a gigantic piece of tiramisu free for being patient with the wait. <br><br>Patience is a virtue.  Just sayin'.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8A2_rsSkN2w30M-tH9wzBg/348s.jpg", "caption": "Tiramisu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zmtv_gvI8EBFQ7tgBQ75xQ/168s.jpg", "caption": "Sarda and Rustica Pizza melts in your mouth"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sJoz8i8f605wbyeUgXAhfQ/168s.jpg", "caption": "Antipasto Misto....yummmm"}]}}, {"review": {"des": "Small little hole in the wall cafe near Michigan Ave. The 14\" pepperoni pizza was very good as well as the Peroni beer. Unfortunately I can only give 3 stars because of the quality and speed of service. After we sat down we had the menu explained and water served, then it seemed we had been forgotten about as the staff was very busy working the counter, tables, and to go orders, almost seeming overwhelmed. Finally after about 20 minutes of waiting we placed our order and waited some more. After receiving and eating our pizza it was another 30 minutes before getting a box and the ticket. Though the food was good, I was frustrated at how neglected our table was.", "pics": null}}, {"review": {"des": "(late review) So after a long road trip from Kokomo Indiana, checked into our hotel at the Wyndham Grand and craved some Chicago pizza. Glad to have found this little Italian restaurant which served really delicious pizza at a price of $5.95- $6.95 a piece.. we ordered the personal thin and crispy (pretty big size)  with some beers and enjoyed dining at this family style café. Service was great and food delicious! I would definitely recommend guests to come to Bongiorno's Italian Deli & Pizzeria.", "pics": null}}, {"review": {"des": "Very good! Food, service, prices :) I recommand this resturant for real italian food, wine was good too", "pics": null}}, {"review": {"des": "Delicious Italian Beef and sausage and pepperoni pizza!!! Can't wait to go back for more!!", "pics": null}}, {"review": {"des": "A friend and I were craving pizza and wanted to try this place...and are we glad we did! Finding it was a bit tough as it is tucked between a residential building under construction and the Wrigley building( I suggest entering from the Wrigley side). This place isn't fancy, but the atmosphere is cozy and relaxed and perfect for families or casual outings. On top of the fresh pizza, it houses a deli, grocery and gelato station. We ordered a small Arugala beet salad that came with a creamy blue cheese dressing that wasn't overpowering and added the perfect zest to the marinated beets, a 10\" margarita pizza (10\" specials are 6.95, $7.95 for specialities) and the gnocchi with vodka sauce. For the two of us, we were stuffed after this (although we were tempted to order another pizza for fun) and ended up with no room for dessert. I loved the simplicity of the pizza, a perfect crunch with a delicious sauce and it wasn't too cheesy or greasy. The gnocchi was also delicious, fluffy and perfectly melting in your mouth with each bite. I personally felt that the vodka sauce was a bit too tomatoey and would order this again with either the traditional sauce or pesto. The best part of dining here besides the incredibly kind service was the price points for our meal! Definitely an incredible value for such fresh food. I can't wait to come back to try the eggplant sandwiches and work my way through the pizza menu.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Hrx3vzwwOeeDOKNYKF8ZLA/348s.jpg", "caption": "Pizza made to Order!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xNBrzv0QXvJwQd8euH6Wgw/168s.jpg", "caption": "Beet salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_FguXUURurMHefiBqWI7LQ/168s.jpg", "caption": "Gnocchi with vodka sauce and the classic Margarita"}]}}, {"review": {"des": "Absolutely loved every second of this place. Great fresh food, fantastic service, great prices, delicious gelato.. I can't say enough good things. Eat here!", "pics": null}}, {"review": {"des": "I'm guessing a lot of people may not know about this because it's tucked away in a residential building between Michigan Ave and Wabash. Nonetheless, this place is dynamite. Easily the best Italian Beef that I've had in Chicago. The rustica pizza is phenomenal. Pasta dishes are great. I live in the building so its super convenient to go to and have probably ordered here 20+ times. I have never been disappointed. Bread is fresh made and you can tell its not just pulled out of a plastic bag.<br><br>I think I hate you and potentially your entire family tree if you do not like this place.", "pics": null}}, {"review": {"des": "Above average spot.  Prices are very fair being their  location is prime real estate.  It's diffently worth the money. You can eat well and drink good and spend 40.00 bucks for two. I would visit this place again based on the value and not necessarily because the menu. It was good food but not great food.", "pics": null}}, {"review": {"des": "Random choice on my part and what an awesome pizza! Great prosciutto and mozzarella salad!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RBFwtg8Rr5oGJBnerSEauw/348s.jpg", "caption": "Awesome pizza & salad!"}]}}, {"review": {"des": "Keep coming back for over four years. Tartuffo pizza is to die for. Great homemade food, great service, fantastic location, adequate pricing! Thank you!", "pics": null}}, {"review": {"des": "Let me start by saying that I had high hopes for this place based on existing reviews. Ordered with my brother and the bread sticks came out fairly quickly. Then my brothers dish came out and I started to wait. My server never made it back to my take to check on us. After 15 minutes and my brother having finished I had to flag down my server and found out my pizza never was made. They were nice enough afterwords but the lack of detail to the table service to me is not acceptable.", "pics": null}}, {"review": {"des": "Such good thin crust pizza! Super cheap for about $6 for a personal pizza! My boyfriend and I actually came here twice during our visit to Chicago! So worth it and so delicious! Service was awesome as well and it's near the river. The only bad thing is that the bathroom isn't connect to their restaurant and you have to go outside and take the elevator.", "pics": null}}, {"review": {"des": "This is my go to carry out Italian joint as it's right near my apartment. I absolutely love all their pizzas. Their sandwiches are great as well however some people may not enjoy the hardness of the bread it comes with.", "pics": null}}, {"review": {"des": "Stopped in for a quick bite. Went with the italian sub which is an easy sandwhich but also easy to flop. Great bread, fresh meats, fresh veggies, all around good experience. I did notice a few pizzas around the room that looked fantastic. The building is tucked up behind trump tower at the base of another business center. tucked away up the stairs but also easy access fro Michigan ave down the walking path.", "pics": null}}, {"review": {"des": "Great place for an affordable lunch.<br><br>The location is hard to find if you're coming from the west or south and are relying upon google maps. It's basically in the shadow of Trump Tower, just off the little plaza walkway area (northeast side).<br><br>Honestly the reason I come back here is because for like $3 more than subway, I can have a vastly better lunch experience. So understand that's the framework for this review. I'm not saying best pizza in Chicago or even great pizza. I'm not saying awesome spot for an evening date. I'm saying high quality, tasty, reasonably-priced food. <br><br>This place is like your local Italian-American sandwich deli/lunch counter (everyone should have one btw). Imagine like Salernos or Capri if you're from the Northwest Burbs. <br><br>The pizza is average but decent. For $6.35 for a personal pie shut up and enjoy the ridiculously affordable lunch. <br><br>The pasta is solid too. I eat enough at home, so I don't really go out for pasta. I had the arrabiata here once and it was pretty good. <br><br>In my opinion, what really shines here, and what causes this place to be my go-to lunch spot, are the soups, sandwiches, and salads. They have nice crusty yet springy bread and pretty high quality ingredients. Also, they offer half-sizes of stuff which is great for mixing and matching or keeping lunch lighter. The antipasto misto is MASSIVE. Yes they probably use a level of salumi that you can get at Costco, but they're very generous. Big stacks of salmi, sopressatta, American ham, and prosciutto. Perfectly grilled and marinated vegetables. A little cheese and some olives. They serve it with bread over a bed of very crisp spring mix. <br><br>The lentil soup is decent but super filling. The beet salad is good if you like sweet and salty. Most of the sandwiches are very good. Who doesn't like a chicken parm?!<br><br>Heck, you can even order individual meatballs if you just want a snack.<br><br>I haven't had their gelato, but I bet it's fine. Their Italian cookies are just like my grandparents would put out around Christmas. So I get a lemon one every now and then for a little treat. <br><br>Outdoor seating is pretty spacious and enjoyable when it's not 90 and humid haha. <br><br>Staff is always friendly, but the owners are getting older. Just be patient. <br><br>Really no complaints here. Again, this isn't gourmet $30+ per dish dining. This is lunch downtown for under $15. Go here and enjoy a good lunch and let your wallet thank you. I mean, you were just gonna go to Protein Bar again anyways...", "pics": null}}, {"review": {"des": "We ended up here after bailing on our first choice for din-din.   Soooooo glad!    It's small/quaint and at times I felt like I was in a family kitchen.  Great vibe!  Of course with small/quaint comes some service challenges.  But honestly it did not deter from the dinner AT ALL.  If you're uptight or in a hurry, maybe not the best stop for you.   We were just looking for a relaxing Friday night dinner and great food.....BonGiorno's delivered expertly on that front!<br><br>Absolutely everything we ordered was 5 star.   Rustica, Dee-lish, Regina, meatballs, cheesy garlic bread, Pana cotta gelato, Cabernet Sauvignon and tiramisu!    The personal size pies are plenty big for the average adult.   So I recommend getting an assortment & sharing.   <br><br>This is NOT Chicago style deep-dish (thank heavens!!).   And not quite aligned with NY style because the edges are crispy/toasty and the toppings or more adventurous.  But nothing so over the top that you're left wondering WTH?!?!<br><br>Again, service is casual & leisurely....Relax, Unwind & Enjoy!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iePezBbRKmBelk1oG3TmUw/348s.jpg", "caption": "Cute/quaint.  Not a big place but surprisingly not overly noisy."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fXymyBWse4ehWrH9PUx8wQ/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/M8vIk4WAvzWeMUP8lsrShw/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Great option for delivery to hotel.  <br><br>We were exhausted from a day of touristing, and couldn't muster to go out for dinner.  Ordered delivery to our hotel (Embassy Suites), and was a great decision (note: they will come to front desk and call room to meet in lobby).  Couple of chicken breast sandwiches were loved by kids.  Excellent fresh-baked rustic Italian bread.  Salads were huge - probably should have just got one vs two and shared, as the second one went untouched. Chix Parm was on point.  Appetizer meatballs, ordered by the piece, were outstanding.  Antipasto was loaded with fresh cut meats, some roasted red pepper and marinated zucchini. Could have ordered just this and some bread and been more than happy.  We will try dining in the restaurant when back in town.", "pics": null}}, {"review": {"des": "Every chain restaurant had oven an hour wait, we came across the place and looked good from the outside, it was fantastic. Service was great, food was good. Had spaghetti and pollo parmigiano. so good.", "pics": null}}, {"review": {"des": "Best pizza and best service I have had in Chicago....small, friendly and lovely place. I will definitely be back when I'm in the city!!! The food is delicious and it doesn't take long to be served.", "pics": null}}, {"review": {"des": "Ordered take out:<br><br>Chicken Parm sandwich - 3/5 not enough sauce and the bread was rubbery from being in the container<br><br>Caesar Salad - 4/5 shredded romaine, good dressing, good croutons, solid <br><br>Penne Bolognese - 2/5 penne was way over done, not enough sauce, didn't eat much, it wasn't good<br><br>Tiramisu - 4/5 good flavor,  ladyfingers well soaked and wet.     <br><br>Over all, sides and dessert were solid, main dishes left something to be desired.  Not bad but wouldn't rush back", "pics": null}}, {"review": {"des": "We were at the Sheraton for the Cubs Convention, and desperately craving non-hotel food.  We had some Italian beef sandwiches delivered to us.  Delivery was right on time - impressive considering the circus atmosphere with thousands of crazy Cub fans.<br><br>What a great sandwich!  The bread is delicious, with just the right firmness so it doesn't go soggy in the au jus.  Meat had lots of flavor, and the dip added even more.  Great prices, as this is a big sandwich.", "pics": null}}, {"review": {"des": "We got a pepperoni pizza with olives. It was pretty good- nothing out of the ordinary or particularly memorable. During the warmer months they do have nice outside seating. Prices were fair for what they gave us. Wouldn't go out of my way to eat here but a nice option if you are nearby and craving thin crust pizza. Certainly better than thin crust at Giordanos.", "pics": null}}, {"review": {"des": "They're okay... I've definitely had better.<br><br>The service was sweet but the food... I've definitely had better.<br><br>The pizza crust wasnt cooked evenly. Half the pizza was kinda perfect and the other half was burned. I also ordered the Caprese sandwich. I understand crusty bread but I couldn't eat it without tearing the roof of my mouth apart. I just opened it up and ate it with a fork. The ingredients were fresh... I really appreciate that.<br><br>They're located within a building with offices and other establishments of business so their bathrooms are located outside the restaurant on the second floor. You're gonna need a key. I don't know why that is weird to me but it is.", "pics": null}}, {"review": {"des": "Not bad. A good deal for lunchtime too and its quick. I didnt like how basic the spaghetti comes. And its damn near $2 per meatball!! Wtf happen to spaghetti coming with meatballs?  We ordered to go and we had to keep reminding the staff as they sent out our food to sit in. The ceasar salad was gross. I was dissapointed the salad had out a can or to go pack Kraft like parmesean. As opposed to real shredded cheese. The dressing was cheap too. <br><br>I ate though and was filled.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/I0-n89hb9AufFfzcpolc6w/168s.jpg", "caption": "10' sausage for 6 bucks"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/j820UBGf6MdHthen-SPwyQ/168s.jpg", "caption": "Yum!!"}]}}, {"review": {"des": "My favorite place so far (in Chicago) to get delivery from. I have NOT had the pizza, so my review is more based on pasta dishes (and in person getting sandwiches). <br>The chicken parm is good, the pasta could use some more sauce but overall this is my go to. Meatballs are really good. <br>The delivery tends to take a bit longer, but not on them as it is through a 3rd party (so being patient is a virtue).", "pics": null}}, {"review": {"des": "We recently moved and got the worst news ever!!!!!  Piece pizza doesn't deliver to our new address!  NOOOOooooooooooooooo say it isn't so!  I almost shed a tear, for real! <br><br>So we ordered from here since they delivered to our area.<br><br>I am extremely picky when it comes to my pizza, I'll admit I'm a little hard to please.  I want my crust thin and crispy and I want my pizza flavorful.<br><br>If my slice dangles in the wind like a flaccid penis when I pick it up I'm pretty much not interested, unless of course it tastes amazing, then I will pop it in the oven and self crisp.<br><br>This was not the case..<br>crust mushy, pizza not much flavor<br>pepperoni was ok and at least edible the sausage was terrible<br>yes the crust will crisp in the oven because in my moment of desperation I did this but the flavor still did not pass my standards....<br><br>so the search continues<br><br>or else I will be driving to Piece to pick up my pizza and continuing to beg them to extend their delivery map considering I'm only one block out of their zone!!!!", "pics": null}}, {"review": {"des": "Boy, are my wallet and scale going to be really unhappy that I moved in right across from this gem of a place! <br><br>I'm a big fan of pizza (who isn't?), but I'm an even bigger fan of thin crust, New York style pizza! So, when I moved to town and my friend had a magazine that talked about the top pizza joints around the city, I immediately took interest! I scoped out the thin crust pics and bongiornos was one of them!<br><br>I've visited a handful of times since realizing it is just across the street from my apartment, and I have enjoyed it every time! Their pizzas are delicious! I've tried the vegetarian with ricotta added and oh my is it good! The margherita is always my favorite and this one doesn't disappoint! I've tried some of the salads and they're good! I wish the caprese came with balsamic or something to add more flavor, but I'm sure I can request it. The gnocchi literally MELTS in your mouth! I've had it with the vodka sauce and the arrabiata and I have to say, the vodka is my fave out of the two! Their bread is wonderful, as well.<br><br>I've eaten in only twice, the rest have been carry out. The service is on the slower side, so make sure you have time. One of those times, we literally didn't see anyone for a while, so we just ordered up front and grabbed our own food and drinks but still sat in the dining area and they didn't care.<br><br>Like I said, I love this place- but my scale and wallet won't appreciate what it does to me :)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LL5ShJVndt4ThKkvat342Q/348s.jpg", "caption": "Margherita"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eAdXIHObGtohvwLxaZ6WKA/168s.jpg", "caption": "Stuffed gnocchi with vodka sauce"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pGqtsJO4E3bWiOYKzl2HyQ/168s.jpg", "caption": "Vegetarian pizza (with added ricotta)"}]}}, {"review": {"des": "The margarita pizza was so fenomenal!! Its such a great cozy little place. The large pizza is 8 slices of heaven and the cheesy breadsticks were out of this world! The marinara sauce is just perfection!", "pics": null}}, {"review": {"des": "First of all, my order arrived 45minutes late. I ordered prosciutto al fungi pizza and an Italian sandwich, pizza was cold and sandwich did not have cheese or any veggies that usually comes with, it was literally just meat and broth and me and my partner are feeling sick from the food already. They refunded the money because the order was very late but then I received a call from the delivery guy asking money from me which I thought it was not acceptable and told him to talk to his company instead of asking money from me.. overall I ended up waiting 45 mins extra and ate cold pizza with meat sandwich and got sick from it and was told to pay by delivery person... I have nothing else to say..", "pics": null}}, {"review": {"des": "Amazing pizza!! And the family that owns it is so sweet and welcoming!! Love this place!", "pics": null}}, {"review": {"des": "Amazing thin crust pizza. Limited sizes, especially for delivery, but you'll hardly notice because you'll be stuffing your face. Staff is nice and professional.", "pics": null}}, {"review": {"des": "We had the Di Rucola salad, veggie pizza, & cheese pizza. All of it was good. The pizzas were 10\" and we didn't have any leftovers with two people eating. Perfect amount of food for us.", "pics": null}}, {"review": {"des": "One of the BEST pizza's I've EVER had. I was looking for an Italian deli on a Sunday night because I was craving a prosciutto and fresh mozz sandwich. And did I hit the JACKPOT with this place! The sandwich was made with the freshest quality ingredients and was beyond delicious! <br><br>But let's talk about this pizza... this is what true AUTHENTIC pizza is supposed to taste like! Again, fresh quality ingredients. Balanced toppings (no cheese overload). Succulent sauce. And the perfect combination of crispy but also chewy crust! You can pick up the NYC style triangle slices with out soggy ingredients flopping around. <br><br>Bottom line, BonGiorno's is 1000% authentic. This is my new go to spot! Can't wait to try other menu items!", "pics": null}}, {"review": {"des": "Stop by for lunch. What a great little Italian restaurant. I had the daily special, personal pizza, $6.95. I got a good size  (?12 inch) pizza with a spicy sauce, lots of cheese and great Italian sausage. Yum. Great start to our visit in Chicago!", "pics": null}}, {"review": {"des": "Hey we are in town from St. Louis. We just stopped in at Bongiorno's for a slice! Wow   It was fantastic. Totally loved it!!!", "pics": null}}, {"review": {"des": "Vacationing from the Bronx, we found 1 of the Best Pizzeria's here in Chicago!!  We had the Best Dinner tonight!   My husband ordered an Eggplant Parmesan Hero and I had the Eggplant Rollatini (Appetizer).   Both were absolutely Delicious!  Then we split a Small Individual  Pepperoni Pizza and it was the BEST PIZZA that we have had in a very long time!   Prices were so Reasonable and the Service was Excellent!    We are going back there tomorrow evening!", "pics": null}}, {"review": {"des": "What a fantastic surprise. In middle of the city, a tiny Italian restaurant with a big family feel.<br><br>The pizza - sraight from the oven - was fresh and filling. The lunch special pizza, with a half  salad added, was 10 bucks, and I have half my pizza left over for tomorrow!<br><br>The place really started filling up around noon, so if you want the quick service we got (pizza in less than 10 minutes), and seating, plan to arrive a little earlier than the noon-1 lunch crowd.<br><br>They also have a nice outdoor seating area, that looks great for late spring/summer.", "pics": null}}, {"review": {"des": "It was filling and delicious. The tarimisu is really delicious (i had no idea what this was and ordered it anyways. Its very colorful and I was skeptical... but dont hold back!!!) so I suggest that big time! I felt like the pizza was a little too average for the price of it. Nothing stood out too much besides the fact that its pizza! Definitely would recommend this place to anyone thats in the area!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ciw27KsPtQAYpt1iC0Fs5g/348s.jpg", "caption": "Garlic Cheese Bread with Cheese. Pretty good!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8Y7tipWLtkzFKwYvYlp4vQ/168s.jpg", "caption": "Tiramisu. Had no idea what this was but it is SO good!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VEIPBTr8rT0WwX7TzGLMfA/168s.jpg", "caption": "Lil greasy but fold it over and BAM deliciousness."}]}}, {"review": {"des": "This is now my favorite pizza place in Chicago. I'm from New York and have now lived here in Chicago for 3.5 years.  I love Chicago food but when it comes to pizza, I'm always looking for a pizza that reminds me of growing up.  It's not a classic New York Neapolitan style pizza; so don't expect it to be. But for me, I really enjoy their pizza. Great dough and sauce.  Also, My son loves the pasta and sauce; and the friendly family atmosphere is great.", "pics": null}}, {"review": {"des": "I wish I had actually received my food so I could write a review on overall food quality.  There was a line to order and a hold up at one of the registers, so about 5 people who were in line after us ordered first.  We ordered a pizza, salad, and two sandwiches.  I had a boat to catch in 30 minutes, and was told that the order would only take 10 minutes. <br><br>20 minutes later the pizza was ready, the salad came out, and the kitchen hadn't even started making our hot sandwiches so I had to get our money back and forgo lunch.  Everyone who ordered before and after me was walking out with their orders.  The salad was good, not sure about the pizza because my nieces ate that.  <br><br>The food looked pretty tasty, but service was bad and they are not very organized in the kitchen to accommodate a lunch rush.", "pics": null}}, {"review": {"des": "My husband and I stopped in today for our 'go to' Regina pizza  (Blanca fix).  It's made authentic Italian style without sauce and topped with arugula, tomatoes, prosciutto, and sliced parmesano.    Yum!     We decided to splurge with cappucinos, tiramisu and some gelato.   <br><br>This family-owned place is tucked in behind the Wrigley building on your way to Trump Tower (actually just behind the expensive Beacon Tavern).   It's a great, inexpensive spot for carryouts,  outdoor patio lunch/dinner dining, coffee/wine/beer and good gelato or tiramisu.<br><br>We like the unrushed, family feel.   It's worth checking out.", "pics": null}}, {"review": {"des": "Came by for the lunch special--$6 for a one-topping pizza (I grabbed sausage).  Amazing, great service, great patio, and I still love that my beer cost $5 while my lunch cost just a dollar more.  If I just showed up to dine in and have a glass of water, I could have gotten out of here on the really cheap!<br><br>I'm glad that a friend walked me to this place the first time around, because I don't hang out near the Trump that often and the address is a little misleading.  Once you find it, you will be satisfied!!", "pics": null}}, {"review": {"des": "We came in at less than an hour before closing and were the last ones to leave.  Never felt rushed.  The lasagna was dense with tender meat layers.  Every bit of the sauce was swept up by the fresh warm baguette slices.<br><br>Salad was very light on dressing but one of the biggest side salads I have ordered<br><br>Thanks Issac for making us comfortable!", "pics": null}}, {"review": {"des": "We were hungry, tired and not in the mood for room service. I randomly selected Bongiorno based on their menu and proximity. <br><br>The pizza was excellent (said this NY pizza snob), my basic mixed green salad was done right and my wife's chicken parmigiana sub spot on perfect (and enormous).  The joint even smelled great when walking in. <br><br>My only complaint, and it's really nobodies fault, was that unless you noticed the comment that they are located inside a condominium building lobby, using a GPS fails to get you there. <br><br>If you're in Chicago and looking for some excellent Italian comfort food, this is the place to get it.", "pics": null}}]}