{"name": "bopngrill-chicago-3", "reviews": [{"review": {"des": "I'm a fan! Load me up and get ready to wheel me out. I ate so much it was completely embarrassing. <br><br>The kimchi fries were out of this world! My order was absolutely enormous and I scarfed down the whole thing. I then went on to my friend's bacon fries. They were not as tasty.<br><br>After the fry massacre I started on my burger. It was good! Just not AS good. I decided to take it home. <br><br>I also ordered the philly egg roll because I was totally pigging out. It was interesting. Hard to describe. <br><br>Do I like this place? Oh yes! In fact, I'm thinking of dinner right now.<br><br>***Accessibility***<br>This restaurant is a counter order/ pick up/ self serve drink establishment. The staff was courteous and offered assistance. Seating is rather close.", "pics": null}}, {"review": {"des": "Ordered food to go and walked in to pick up and pay for the food. They don't process your to go order when you go to pick up. This location forces you to wait in line even if your food is ready to take out, which was honestly really annoying. Even more annoying was how they didn't explain this and just had us waiting next to the counter after acknowledging us and confirming that our food was ready--they just ignored us(??). We called ahead and ordered to go so that we could walk in, pay, and take our food to go, so this was a pretty annoying and sour interaction. <br><br>Tried the fire tofu plate for the first time since they got rid of the kimchi tofu, goodness is the food here salty. I've never experienced this sensation from food before but it was almost like my mouth was burning from how salty the food was. I was already annoyed at the staff for the in person interaction, but the food was just too salty to eat.", "pics": null}}, {"review": {"des": "Awesome place. Definitely a must eat if you're in the area. The walls are plastered with newspaper articles on them, cut outs of their magazine features, and pictures of famous chefs visiting them. All of those accolades are for a reason. <br><br>I had the duxelle burger and the bolgogi eggrolls. Burger was fresh, maybe a tad greasy, but the flavor was top tier. Although my favorite part of dinner was the eggrolls. The eggrolls were cut in halves. The wrapper was super crunchy and the filling was steak and cheese. There is definitely something special there in those eggrolls. <br><br>KEEP IN MIND THIS IS AN ASIAN RESTRAUNT AT HEART!!! Bbq chicken is going to be korean bbq not your typical american bbq. I saw some uncultured swine in some other reviews complaining about the bbq chicken. Korean bbq isnt saucy and sweet like american bbq is. I am from Hawaii and have had asian cuisine my whole life. This place is a must if you like korean or american classics", "pics": null}}, {"review": {"des": "Korean is good.  Burgers are good.  But that doesn't mean you should try to mix them.<br><br>We went to this place because it was on the Diners, Drive-ins, and Dives show and we were in the area.  We were expecting a lot more.  The flavor here was weird and kind of gross.  I realize this is kind of a fusion restaurant, but I am not a fan.<br><br>There is a possibility that we chose wrong and there might be something better on the menu we missed, but honestly, not worth trying again...", "pics": null}}, {"review": {"des": "We went inside to check out menu and decided to stay and eat. We both grab burgers that looked better than they tasted. My mistake was getting an egg on mine.  Free refills of course was fantastic. Mostly  College student vibe ,plus all walks of life started to come in. It was just ok for a quick bite to eat. When we finished eating no one talked about returning, so maybe this was the first and last visit. Although we are interested in other items on the menu, so who knows....<br>I say check this place out if you are curious.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EWwzLjd1Hs6UuEHuZOGeSw/348s.jpg", "caption": "Fries are fantastic! Hot and fresh."}]}}, {"review": {"des": "The burgers here are so good! Love the Kimchi burger and duxelle burger. This burger is way better than umami burger. The meat is seasoned and cooked perfectly. The brioche bun perfects the burger. They also have the best fries here as they have a crunchy and crispy exterior.<br><br>I also get the bim bim bop with bulgogi. This is huge and can easily can feed 2. <br><br>I tried the Philly Cheese eggrolls today and they were a bit salty. Not sure if it is worth $4.50 for one.<br><br>This place gets  busy so be prepared to wait for your food as everything is cooked to order. The staff here are on top of things and are helpful with the menu.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rmJicYJVGDAe9M7LwR7sdg/348s.jpg", "caption": "Bimbimbop with Bulgogi"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/n8cBe3UkBfuw6qR9wsWUtQ/168s.jpg", "caption": "Burger combo and Philly cheese eggroll"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VIMEGmjtrzNatAgnNzb1Rg/168s.jpg", "caption": "Simple menu board"}]}}, {"review": {"des": "The patty was delicious, same as the bun. Loved the hamburger. I took a chance with the kimchi fri s and I was surprised how good they were (and I'm not a kimchi fan). So definitely worth it if you are up for new flavors! The staff was super friendly and the place was clean and organized. I liked it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/r34-gAB2yAwwVzt3Qw8GIQ/168s.jpg", "caption": "The classic burger."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Jt5OpdVGXyrylND2UB0dMA/168s.jpg", "caption": "The Kimchi Fries (also have cheese and bacon)"}]}}, {"review": {"des": "Kimchi Fries ($7)!  They lived up to the hype and I would highly recommend them.  Definitely glad I stopped in since I was in the area. You order your food at the counter and there are both indoor and outdoor seating.  My order was ready in less than 10 minutes.<br><br>Duxelle burger $9 - Greasy and tasty!<br>Bulkogi Bop $12 - This dish comes with marinated Korean beef on top of rice with a side salad and kimchi.  The meat is melt in your mouth delicious and the rice is perfectly cooked.<br><br>I was able to find street parking nearby on a week night.<br><br>....| \\      _  , , , - - , ,  _  ,      <br>.../  , ` . - ' ` '             . _   \\ -  ;  ;  ;  , _    <br>..| ,  a  -   )   ) _         . ; .  (   ` - ` -  ' - '   <br>'  - - - ' ' ( _ / . _ ) - ' ( _ \\ _ )", "pics": null}}, {"review": {"des": "I love me some bopNgrill. If you're hungry for some Korean food, or want a really good burger with Korean flair, this is the spot.<br><br>I had the kimchi burger at the other location, and it was outstanding. They have some other choices like umami, pizza, and such. Burgers are cooked medium. Well done, if you're a savage. ;)<br><br>On this visit my wife and I ordered the bulgogi bop plate, which came with bulgogi on rice, kimchi, and a little side salad with thousand island dressing. This just hits the spot in terms of quantity and quality. It brings me back to home cooking, so maybe it's a bit sentimental for me.<br><br>You must order a side of kimchi fries. This beautiful concoction of kimchi, cheese sauce, bacon, scallion, and of course the fries is out of this world. It's cooked with truffle oil too, so it has that element of umami flavor to it. Plus the fries are cooked to a crispy perfection. Don't miss out on this.<br><br>Nice people, relatively fast turnaround in the kitchen, and nice space to eat with friends inside or outside on the patio.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yTu1FwwIQVVZb-58SlBwZg/348s.jpg", "caption": "Bulkogi Plate with a side of kimchi fries"}]}}, {"review": {"des": "The Kimchi Burger! Wow! What a great find. The gal behind the counter was awesome, I really wish I remembered her name, because her service was great. It was a Tuesday around 1pm. The college kids were grabbing lunch. It was fast and efficient. The atmosphere was great. Cool spot. Need to take the wife.", "pics": null}}, {"review": {"des": "Take the hype with a grain of salt: I don't think I'll be returning. Paid a visit here twice and wasn't wowed by the taste or the price. Granted you get quite a bit of food, but there is a taste that I can't get behind. <br><br>The first time I got the fire chicken and the second the bibimbop with chicken katsu and both times I couldn't believe the price and my egg was way undercooked. <br><br>The best part of my food was the fries - ah ma zing. Maybe I'm just a Dak loyalist...", "pics": null}}, {"review": {"des": "They are not kidding when they put a limit on those Bulgogi eggrolls.  They are only available FRI/SAT/SUN and once they are gone, they're gone. <br><br>Luckily, they were still available on a Sunday afternoon, but during our visit the \"sorry we're out...\" sign went up.  Wow!<br><br>The eggrolls were really good, and I can see how lots of people would gorge themselves out on them.  I had just split one with JW, and between that, the burger and kimchi fries, I was pretty much done. <br><br>I have a love/hate relationship with kimchi.  And the thought of warm kimchi on fries kind of eeked me out.  But combined with melty cheese, bacon and scallion, those fries worked!  Oh, and that kimchi is rendered in pork fat.  Woah!<br><br>The duxelle burger was delicious and my favorite item that day. The beef patty is ground beef and short rib, topped with truffled mushroom duxelle, togarashi mayo, bacon, smoked gouda.<br><br>The space is like a shoebox, communal seating and small tables for 2. It wasn't that crowded, but folks were lingering well beyond completing their meals. For a Sunday afternoon, why not.", "pics": null}}, {"review": {"des": "I have seen bopNGrill featured on \"Chicago's Best\" and \"Diners, Drive-Ins, and Dives\" and expected it to be dynamite. <br>It was fine. Not great. <br>Ordered the BBQ Chicken plate with kimchi. <br>Nothing \"BBQ\" about it. <br>Tasted like grilled, teriyaki chicken that I could have gotten at Panda Express. <br>Nice, crisp, kimchi, and the little side salad with Thousand Island was oddly refreshing. <br>Wouldn't go out of my way to try it again<br>My friend got bulgogi, it was a bit better.", "pics": null}}, {"review": {"des": "I am lowering my rating in protest of the removal of the LOCO burger!  It's like McDonald's removing the big Mac! Its  everyone's favorite Burger. What are you doing?   I hope you're not going to remove the cheese steak egg rolls next. <br> Everyone I know is freaking out about this.  I hope you reconsider ASAP. <br> I feel bad giving you a one star rating but I need to get your attention.  I am desperate for a Loco Burger. :(", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bC1CqV1JYFWu0tYMN9VYxw/168s.jpg", "caption": "Unami...  I miss the LOCO! BRING IT  BACK!"}]}}, {"review": {"des": "Good food but our experience was fucked up by the extremely slow service... the place wasn't busy at all..,  no lines... we ordered 2 burgers to go and waited for 35-40 minuets!! And they didn't even apologize... so disrespectful and rude.", "pics": null}}, {"review": {"des": "After having  our hair done at Mario Tricoci, my daughter and I were looking for a place to eat on Sheridan Road.  Decided to check out this place as we are both a fan of Korean food.  Also my daughter recognized it as a place that had been featured on Diners, Drive ins and Dives, one of her favorite food shows.<br><br>There was outdoor seating, but it was too hot to do that.  We were greeted by a sign that said \"BYOB\", so that was a win win for me.<br><br>Wasn't expecting burgers and egg rolls on the menu, but was pleasantly surprised.  There are a variety of burgers with a Korean twist, but we go the regular burgers with a fried egg and fries.  Burger was tasty but slippery...everything kept sliding out of  the bun :-)<br><br>The eggs rolls were pretty good, although I would not called them Philly Cheese Steak Egg Rolls.   There is cheese in them, but the Korean Beef they use overpowers it.  That said, it is not a bad thing.  I think the meat was bulkogi, which I love.  Only bad thing about the egg rolls is that you are restricted to an order of two per person.  I would have easily have bought a dozen of them to take home,  You can only get the egg rolls on the weekend.  <br><br>I got a bi bim bop to go with a fried egg and bulkogi....held up very well after reheating.  There are other items on the menu we would like to explore, so most likely we will be hitting this spot again, but only on the weekends so we can get those egg rolls.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qJP8TdrUQtwecHp0bNIC1Q/348s.jpg", "caption": "Those yummy egg rolls.  That two order minimum is so not fair."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PowBhMhndaSIb0Lse1rUaw/168s.jpg", "caption": "Fries were hot and tasty...slightly seasoned and I did not need to add salt"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WHn1s9YwhuJSblQp1Y-sNA/168s.jpg", "caption": "Cheeseburger with fried egg"}]}}, {"review": {"des": "We used to love the food here but now everything is very salty. <br><br>Our Favorites (it was good before not anymore ) <br>Loco Moco Plate <br>Kimchi Fries<br>Egg Roll", "pics": null}}, {"review": {"des": "Food: 4<br>Service (counter): 5<br>Ambiance: 4<br><br>Outdoor seating was packed.  Indoor seating was empty but still a lot of business because people were ordering take out. Food is good enough to attract both non-Koreans and native-Koreans. <br><br>Ordered chicken katsu with rice on side (due to egg allergy from the batter) and got the dish on a bed of salad. It was better than getting naked katsu on the plate. That was nice of the restaurant to do that. <br><br>Lady taking the order (forgot her name) was so nice! <br><br>As a native Korean, I will definitely return here. Everything is good all around. I even saw people buying jars of kimchi! Yum!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YJrysVQtuKKV5vxloDGmzA/168s.jpg", "caption": "Chicken katsu"}]}}, {"review": {"des": "MMMMBOP!<br><br>Betcha weren't thinking of Hanson until you read this.  And now you are (you're welcome!)<br><br>Korean + burgers = ??  this little equation had me intrigued, enough so that I decided on having Saturday dinner at bopNgrill's Loyola location at the behest of local resident Maddie B.  This bNg is wedged between a Chipotle and Bulldog Ale House on north Sheridan Road.<br><br>After a day in the sun, I was totally famished so I wasted no time in ordering their kimchi burger.  bNg doesn't list their prices online (nor on their posted menu, at least that I saw....hmmmm) so I don't remember what a burger & fries cost.  Not a huge deal, just mysterious.<br><br>Anyway, burger was tasty.  Caramelized kimchi on a burger is interesting to say the least; I'm still unsure if I liked it or not.  A sunny-side up fried egg and bacon completed the sandwich, as did a side of cheese fries.  The 'bNg' burger comes with \"1000 sauce\" (is that thousand island??) and jalapenos for those who don't want pickled cabbage on their cheeseburger.<br><br>On weekends, bopNgrill features a very delicious, extra-special treat dubbed the 'bulkogi Philly egg roll'.  For $9, you get four servings of sliced bbq steak and spices inside a crispy egg roll shell.  It was SUPER good, but be warned that they have limited quantities and *will* run out, since that shizz is delightful and \\m/ everybody wants some!! \\m/ (cue Van Halen song)<br><br>Bread = 4.5<br>Circuses = 4<br><br>The bulkogi egg roll is worth coming for alone.  Burgers are solid, the fries are decent, and these dudes were featured on Diners, Drive-Ins and Dives.  Guy Fieri (see also: \"metrosexual porcupine man\", \"fat N'Sync douche wannabe\") gave bopNgrill high marks, in case you cared.<br><br>Recommended!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IVcYoZCub84O_yX46qvIBg/348s.jpg", "caption": "Bulkogi \"philly\" egg rolls ($9) were SUPER tasty but only produced in limited quantities, so get yours now!!"}]}}, {"review": {"des": "I came to bopNGrill for a quick lunch while on a one-hour lunch break attending a conference at Loyola.  In the summer at least, I was able to order at the counter, wait at a table for my food, and finish eating in just enough time to make it back for my next session.<br><br>The prices are a bit higher than the fast-casual chains along the same street (such as Chipotle and Blaze Pizza), though the portions are large.  I was able to split an order of bibimbop with added marinated tofu and a beverage (around $15 total.)  The bibimbop bowl tasted good: the sauce wasn't too spicy or sweet, it included a good mix of rice, kimchi, veggies, etc., and the tofu was well-prepared with a good flavor.  But it didn't blow me away -- and it didn't taste like bibimbap from more typical or traditional Korean restaurants, either.  (Of course, I'm not saying it has to; bopNGrill is Korean-American fusion. And I used to live near Koreatown in Los Angeles, where you can find entire restaurants selling nothing but stone-pot bibimbap, so my standards may be unrealistically high -- take them with a dash of salt.)<br><br>My rating is really 3.5 stars, rounded up to 4 because I'm sure I would have enjoyed it more had I tried the burgers or meat options. (Come on, Yelp, we need half stars already . . . )  Or the kimchi fries, which looked awesome (and huge!)<br><br>Warning to vegans: I think they may use fish sauce in the kimchi, if that's the sort of thing you care about.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UppSs7yqisl0hcSkzbIUFw/348s.jpg", "caption": "Bibimbop with tofu! This isn't like the bibimbop you get in a traditional Korean restaurant, but it tastes good"}]}}, {"review": {"des": "The burger was really good and the cheese sauce for my fries were absolutely amazing. The Philly egg rolls were ok they tasted kinda dry? Maybe that's just me. Good place if you're looking for something a little different.", "pics": null}}, {"review": {"des": "I ordered bi bim bop with bbq chicken, which wasn't bad, but nothing to write home about. My foodie in arms had the burger and said it was good, so probably a good place to check out when in the area, but I wouldn't make a special trip to Loyola just for that.", "pics": null}}, {"review": {"des": "I been eating here for the last 2 years or so and their food is really good. Their Korean menu isn't 100% authentic but good enough for this Korean guy. (Not that it means anything) Their burgers are exceptional but I wouldn't get the kimchi fries, it wasn't what i was expecting. It's literally just cheese fries with a bunch of kimchi on top. A little lacking on the creativity there but still a highly recommended place to stop by if your in da hood. Oh yeah forgot to mention on weekends they make a Phillychesse egg roll! Amazing! But they only make a limited amount and once they're all out that's it so get there early on the weekends. Just a pro tip.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nIRgOgzLEFvl41pXRvJ7Xg/348s.jpg", "caption": "Bi Bim Bop with bulgogi not authentic Korean but still pretty good."}]}}, {"review": {"des": "The umami burger was great. The kimchi fry (singular) could have maybe had more kimchi flavour for me. They were crispy for sure and flavourful as cheese and bacon fries.<br><br>The patties were done real well and juicy. It definitely is worth coming to have. The light touch of Asian flavours were ok. Kinda nice to find in this area but isn't something that blows my mind away. I'll probably give this place closer to a 4.5.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jHJP6megJiGtTI9N3YXWiQ/348s.jpg", "caption": "Two burgers and two fry"}]}}, {"review": {"des": "Their chicken Katsu is where it's at! It has a good crisp and batter to meat ratio. <br><br>Comes with rice, salad, kimchi, and $AUCE", "pics": null}}, {"review": {"des": "Duxelle burger - flavor was good- the sauce has a nice kick to it. Bun was soft and complemented the burger well. The meat was a little overcooked.<br><br>Fire chicken plate- chicken had just the right amount of spice, but rice was a bit dry. yummy thousand island dressing on the side salad. Kimchi was pretty good. Can tell it is homemade. <br><br>Both orders had good flavor but prices are a bit steep- $9 for a burger without fries and $11 for a simple chicken plate", "pics": null}}, {"review": {"des": "I did not realize that it was half Korean. I like Korean food but have a great source for Korean so I went with the basic burger. First the good parts. It tasted fine and was made of fresh ingredients. It did not come with fries and since I don't do fries, that was a plus. They are quick and the place is clean. Lesser traits include no table service but for a campus eatery is to be expected. The chairs were too narrow for me and I could not stay to read as I was anxious to get out of that seat.", "pics": null}}, {"review": {"des": "My good buddy lives in the neighborhood and wanted to take me to his favorite restaurant in the area, he talked up the place so much, we were so excited to have diner! He recommended the burgers and explained that they could replace the beef with tofu, they had done this for him many times, he is a repeat customer.<br>The girl at the front desk gave him a terrible attitude when he asked about the substitution, not in a nice way that a regular person could accept, I mean, yes, menus change, menu items are removed, but this girl was sour! Eek! <br>We decided to leave without ordering, so disappointed!!!<br><br>This was Tuesday, October 24, around 8:30pm.", "pics": null}}, {"review": {"des": "We had the ribeye rice plate it was good. Their flavors were fresh and delicious nice touch to add the side of pure sesame seed oil to pour all over the meat and rice. I love their kimchee fries addicting and crispy lather in beautiful melted cheese, kimchee, bacon and some truffle oil!<br>This is the type of food that makes your soul sing happy tunes!<br><br>We came in there hungry and walked very satisfied. The first time we had Bop N' Grill it was closer to Wrigleyville area and it was in their smaller location. We had their amazing burgers and fries we loved it. Now we're back at their location in Roger's park by Loyola and it was good.", "pics": null}}, {"review": {"des": "What can I say about Bop n Grill? I love this fast casual fusion burger joint. I miss the ps burger, but somehow I'll survive. The duxelle burger (fka the umami burger) steals the show. Kim chi fries seal the deal and I don't usually even like him chi. But my favorite just might be the weekends-only cheesesteak egg rolls stuffed with Korean bulgogi and topped with a zigzag of cheez. I could eat 10 of them but they only let you buy 2, so bring a disguise.", "pics": null}}, {"review": {"des": "I went to this place for the first time last weekend. For a fast service place, their food was amazing. I tried the bi bim bop with bulkogi, the kimchi burger and the Philly cheesesteak egg rolls. All three dishes were delicious. If you are looking for a quick action meal, I recommend stopping in to this restaurant... especially on Friday-Sunday since the egg rolls are only available then.", "pics": null}}, {"review": {"des": "I came here once after they first opened a few years ago and I remember the umami burger being juicy, delicious and full of flavor. This time, not so much. Consistency is a big pet peeve of mine and they have failed in that regard. Today, the burger was overcooked, dry, flavorless and about 6 ounces less than I remember. And their fries are obviously of a frozen origin. Definitelty not a $9 burger experience. I'm a burger snob and I regret not picking Burger King for lunch.....<br><br>Yea.....", "pics": null}}, {"review": {"des": "man some really salty food. like really really salty that you dont even taste anything else after the first bite because your tongue is in pain.", "pics": null}}, {"review": {"des": "Whenever I have a good experience at a restaurant, I like to go again before writing a review so that I could make sure it wasn't just a stroke of luck. <br><br>Y'all, this place is all around great 24/7, 365. Well...not exactly but I ate here Wednesday and came back yesterday and I would give it a 10/10!!!<br><br>Both times I've come, I've received extremely good customer service and the food has been AMAZINGGGGG!!!!! Sorry, but this food y'all....if I ever did a crime that would require me to die and I got a last meal...this might just be what I ask for. <br><br>I've tried the Umami burger (amazing), cheese fries (spectacular), bulgogi (stupendous), and the kung pao chicken (ridiculous)...at least I think it was called Kung Pao Chicken..I don't remember but it's spicy and delicious. I love this place! Oh, and I've tried the eggrolls. They were pretty good..I'm not going to lie. I will definitely be back in the future.", "pics": null}}, {"review": {"des": "Man... I've had this place bookmarked for years. I try to avoid anything east of Western, as I'm a snob when it comes to traffic and congestion. But since I was visiting a friend in Rogers Park, I wanted to try this, so we Grubhubbed this place. I was so excited!! This place was visited by the annoying platinum-haired dude from Diners, Drive-Ins, and Dives, so it has to be legit. <br><br>I ended up ordering the BnG burger, which was phenomenal! It had bacon, lettuce, tomato, onions, cheese, and of course, beef patties. The beef was cooked to a perfect \"medium\" and my gawd, one of the best burgers I've had (yeah, I'm looking at you Au Cheval). Other peeps ordered the Kimchi fries, which I'm not a fan of kimchi at all, and this was no exception. But the fries also was drenched with cheese, and my healthy butt said to heck with it, and I scrapped-off the kimchi and went HAM. <br><br>I tried also the chicken tatsu, which was fried chicken tenderloins, with rice and some katsu sauce. It was OK. Then finally, I also tried the bbq chicken rice plate, which I liked better than the chicken katsu rice plate.<br><br>But yeah, overall, awesome food! I'm excited to try the other items on the menu, like philly bulkgogi eggroll, but it was only available on Fri-Sun, and we had this on a Thursday. Sad face. I'm always a fan of how people can be so creative with fusion food, and this place is definitely no exception. Definitely try this place if you're in the area!", "pics": null}}, {"review": {"des": "bopNgrill is delicious but very expensive!! I haven't had much outside of their plates - their bulgogi plate and fire chicken plate. I love meat and rice together... kim chi on the side makes it even better! It's a pretty good portion though - I do get full after eating everything because it also comes with a side of salad. Their fries here are bombbbbb! I think everything is made fresh to order so it can take a little while before you get your food. Staff are pretty friendly here. There's also good outdoor seating area for the nice days we do have in Chicago!", "pics": null}}, {"review": {"des": "Kimchi fries were a-ma-zing~ as was the kimchi burger.<br>Stopped by after catching a movie at the 400 theater and loved the food.", "pics": null}}, {"review": {"des": "The food was excellent!<br>It's a shame we came right before two big groups so we had to wait a long time but the wait was worth it because the food was absolutely delicious.", "pics": null}}, {"review": {"des": "Quick made to order food! The burgers were great, the bulkogi plate was excellent, and the Philly egg rolls are worth a visit in the weekend!", "pics": null}}, {"review": {"des": "If you follow my reviews, you'd know that I hate boring, typical burgers. I've heard so many good things about the burgers at Bop N Grill, so I've decided to try out the burgers. Of course, they're known for their modern and Americanized Korean food, so I went with their kimchi burger. Wow, it was really good. It definitely had that authentic Korean flavors from the kimchi. Interestingly, the kimchi was caramelized with pork fat. They even put fried egg in it, so it gives it some moisture to the burger. I honestly prefer kimchi burger than the Korean bbq burger from Umami Burger. The kimchi fries were also on point! For the fries, again, they caramelized the kimchi with pork fat but they also added some truffle oil. I like the kimchi fries from Del Seoul, but I prefer Bop N Grill's. 10/10 would eat again.", "pics": null}}, {"review": {"des": "Went here with high expectations after seeing articles praising its burgers as one of the best in America. It was a decent dining experience, arrived around 6pm and got our food quickly. <br><br>Ordered the duxelles with fries and drink and got the philly egg roll. The burger patty was very thin and nothing special to be perfectly honest. The bun was very soft with a crispy underside. The mushroom sauce on the burger was very salty. I couldn't even taste the burger. Very disappointing! Others may like this burger, but to me, the true excellence of a burger lies in the patty, which is nothing to brag about at this place. <br><br>The philly egg rolls were also very salty. I would love to taste what's underneath all that sodium. The fries were on point. Very meaty fries, crunchy outside with soft interior. Would order the kimchi fries if I come here again.", "pics": null}}, {"review": {"des": "I have been here so many times and have to admit that this place change my perspective of fast-food. If you a first-timer, BnG burger is a MUST-TRY. I know the price seems to be a bit expensive but compare to the portion of the food, it worths every penny.", "pics": null}}, {"review": {"des": "Ahmazing burgers! <br>Run don't walk to the Rogers Park location on Sheridan.", "pics": null}}, {"review": {"des": "This was our first stop in Chicago.  We weren't entirely hungry so for the two of us, we ordered one Kimchee Burger.  Oh umami goodness.  Perfectly served, thoughtfully carved in two, this wonderful balance of flavors, textures & nuances was almost as beautifully Korean American as my own daughter ;)<br><br>Seriously though, LOVED IT!", "pics": null}}, {"review": {"des": "This place is right off the Loyola stop! Came here on a Saturday for dinner and the egg rolls were already sold out. There is a ton of seating inside and outside and I think almost everyone in the restaurant ordered a burger. When you first walk in you're hit with the smell of truffle oil. I ordered the umami burger, which had a beef patty, cheese, lettuce, and truffle oil topped with an egg. The burger was delicious and flavorful, but a tad greasy. We also split kimchi fries which I could not stop eating. The food came out fast and the portions were great and definitely filled you up.", "pics": null}}, {"review": {"des": "I love bopNGrill! Friendly staff and quick & yummy food. <br><br>I tend to come here on the weekends during lunch time. There usually isn't a long line-- it's actually pretty empty around that time. There is plenty of seating for those dining solo, in pairs, or in groups. When it's nice out, there is additional seating outside as well. <br><br>My go-to's are the bulgogi (beef) bibimbap and kimchi fries. So good! The bibimbap comes in a filling, satisfying portion size and and bulgogi is marinated perfectly. It also comes with a lot of veggies, a fried egg, and a side of gochujang sauce. I recommend! The kimchi fries are great to share with a few or more people. The fries are still crispy and the kimchi on top is not too sour/strong. My bf had the umami burger-- it was different, but he liked it!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wAk3nhrAViiSQoufZjNvmQ/348s.jpg", "caption": "Beef bibimbap, umami burger, kimchi fries"}]}}, {"review": {"des": "My boyfriend and I came here on Sunday afternoon. We usually come here on weekends when we're craving loco moco. I tried the chicken katsu plate when we first came here last year or so, but once I tried his loco moco plate, I've been getting that ever since (with extra gravy and an order of fries, of course!). <br><br>Though they do get busy, we never had to wait long for our food. The food definitely fills you up, so I believe you get your money's worth. The staff is nice and the vibe of this place is really chill - you get to eat, relax, and listen to some tunes. BopNGrill is definitely one of my favorites!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_DHjlgXaMCwb43pXsaL-Tg/348s.jpg", "caption": "Loco moco plate w/ an order of regular fries"}]}}, {"review": {"des": "The burgers here are so tasty and innovative! The blending of Korean and American foods here is truly seamless. If you aren't feeling something as heavy as a burger, the chicken tenders and fries are also delicious. Four stars only because the service can be very slow, so allow some time if you're planning on eating here.", "pics": null}}, {"review": {"des": "I love this place! <br><br>All of the burgers I've tried have been delicious. I recommend starting with the basic one, as it's good enough that it doesn't need any bells and whistles. There's never much of a wait here on the weekends and the service is great. Only tip: get the burger cooked more rare than it comes, so you can enjoy the flavor.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/p4I3OSrVYBc7VF4ZBjBYAw/348s.jpg", "caption": "Kimchi burger with fries, and tofu BBQ bibimbap - vegan! It was delicious."}]}}, {"review": {"des": "I mean... it's okay. I had the classic burger after seeing them on DDD.  It's just an average shake shack type burger. It was a 40 mins drive for me from lake county and I was thoroughly underwhelmed .", "pics": null}}, {"review": {"des": "Some friends and I stopped here for a fast bite on our way to a show and loved it! I had the kimchi burger and fries. The fries were perfect - crunchy on the outside and very soft on the inside. The burger was extremely juicy and delicious, but not greasy; if you order a burger be prepared to use lots of napkins. The burger is not just a huge chunk of beef, which made for a lighter meal (but still filling). I liked that I didn't feel gross after eating here, which often happens with other burger places. felt full and happy.<br><br>There is lots of nice outdoor seating on a patio, although the indoor seating is nice too. The whole place is clean and welcoming.<br><br>If you are craving a burger but don't want it to be a huge, heavy beef patty, this is a great fast place to go.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YQNd66hpvYiEFPfdRkqwiQ/168s.jpg", "caption": "Fries - crunchy on the outside and soft on the inside"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ak1JFdfjRehQyJz5MERf0Q/168s.jpg", "caption": "Kimchi burger - juicy and delicious"}]}}, {"review": {"des": "Best place for burgers! I've been coming here for years and it's never let me down (nor given me up). If I was a Loyola student, I'd be 10 pounds heavier because of this place. Thank goodness I'm too far away to get there easily.<br><br>All the burgers are great. I think it's the beautifully fried egg that comes on top. Breaking the yolk is the most satisfying part and will coat your burger in pure deliciousness. <br><br>I wish they still had the Father burger because that was my favorite one. However the loco moco and the bNg are welcome replacements.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5CafpduiffuCElUK5YcEqA/348s.jpg", "caption": "Left: bNg. Right: kimchi"}]}}, {"review": {"des": "Big fan of this place. <br><br>Seating is plentiful, both indoors and outside. The food is great -- love the burgers, but the plates are also killer. Portions are just right, prices are reasonable, and if you're lucky on the weekends, you'll be able to grab their bomb philly cheese steak egg roll. <br><br>The variety on the menu is such a winner.", "pics": null}}, {"review": {"des": "We ordered the Deluxe burger,  Kemshi burger fries and Philly egg-roll.<br>More than sufficient amount of food, and very delicious. With just the right amount of spice. All the other food everyone else had look awesome as well. Can't wait to try some of the other food on future visits.<br>Sitting outside is an added bonus!", "pics": null}}, {"review": {"des": "Love it! Burgers with a twist. Their kimchi fries are the best. Bowls- umm i would skip- portion isnt that great. <br><br>But burgers, oh yeah! Well cooked, not greasy, good sauces. They dont have a huge menu. Whatever they cook, they cook it well. <br><br>Do try it!", "pics": null}}, {"review": {"des": "This is one of those college places where quantity not quality is the focus. I should have walked right out when I saw the poster with Guy Fieri and his signature near the front. It's a fast casual Korean fusion type of place. I have had a lot of Korean food and this was just ok. The food is served in to-go plastic containers which was another sign of it's intrinsic two star quality. We ordered the kimchi fries and the rib-eye rice plate. Everything was edible but doesn't necessitate a return. Maybe the food is meant to be for the 2AM weekend crowd looking to sober up with large amounts of meat, rice, and fried potatoes. It's saving grace was the friendly staff who were super helpful and answered all my questions. There was a pub next door and I regret not going there instead.", "pics": null}}, {"review": {"des": "Thank you for the good food and for the fast service I'll come back again to try something new.", "pics": null}}, {"review": {"des": "It's been a hit or miss every time I come. Kimchi fries are delicious but the burgers can vary.", "pics": null}}, {"review": {"des": "This is my spot to go to when I'm really hungry. The food is always really good. Service is usually good but it can be hit-and-miss. Most of the time I get good service. I love any of their burgers and don't forget the Philadelphia cheesesteak egg rolls when you can get them. Great place to go to for fast food. It actually has Better Burgers than some of the well-known establishments I've gone to.", "pics": null}}, {"review": {"des": "We get it... You were featured on Diners n Drive Ins n Dives. No need to over advertise this, let the food speak for itself. Overall it's good, but just too greasy for me though to really be a fan of this place. <br><br>Umami burger ~  truffled mushroom duxelle, sun dried tomato confit, togasashi mayo, bacon and smoked gouda cheese. First initial bites... WOW! Truffle roundhouse kick in the mouth. Really good, but as I continued to eat it felt like it was getting greasier and greasier the more I bit into it. Also, the burger was a bit too undercooked in the center for me.<br><br>Kimchi fries ~ fries with kimchi, cheese, bacon, scallions, & sesame. Initially good, they failed to mention fries are cooked in truffle oil but once you get toward the bottom really unappetizing to eat. Way too greasy and soggy. My guess is from the bacon and the kimchi rendered in bacon fat.<br><br>Bulgogi Bop Plate ~ bulgogi (Korean marinaded beef) served with rice, salad, and kimchi. Probably the healthiest of everything we ordered, but just okay. Nothing really to rave about.<br><br>'Til next time, cheers!", "pics": null}}, {"review": {"des": "Finally! I've been meaning to come here for years and I finally made it there last night.  I ordered beef bulgogi, a kimchi burger and bi bim bop with fries on the side. All of us loved our dishes!!!!<br>Service was great and the spot has a nice vibe. They were out of egg rolls though. Dang!<br>I'll be back for some though. Fa sho!!!", "pics": null}}, {"review": {"des": "One of my favorite Korean fusion restaurants in Chicago. Must-tries are their loaded kimchi fries and their beautiful burgers. The fries are cooked in rendered pork fat and drenched in caramelized kimchi  - just thinking about it makes my stomach rumble. I also tried the Kimchi and Duxelle burgers, which are both fantastic - juicy, fresh patties cooked medium. Their bop plates (rice plates with various toppings) are okay, not exceptional compared to the other items on the menu. Their egg rolls were always sold out by the time I got there, so make sure to arrive hot and early if you want a taste of their popular snack. This is the ultimate place to satisfy your comfort food cravings!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EHw6kj_h1veBRK6JSy8Riw/348s.jpg", "caption": "Kimchi burger"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/N3JpslNPVsd6m_2OsABj_Q/168s.jpg", "caption": "Kimchi fries"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LkQjFBY6AYtUb3f6hZTBiQ/168s.jpg", "caption": "Bulgogi bop plate (photo creds to my friend Rovik)"}]}}, {"review": {"des": "Would give 5 stars if the eggrolls weren't $9 and if the burgers came with a side. So delicious! Kimchi burger and Philly cheese steak eggrolls are so yummy!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uwTMbv_MRKLVT-SuQOIPaQ/348s.jpg", "caption": "Philly cheese steak egg rolls"}]}}, {"review": {"des": "This place is okay. Fun concept, but it feels a bit overrated to me. Been there a couple of times, but it did not blow me away. Would like to try it again, but not sure if I want the burger. Maybe I'll go for the bibimbop or something else. I think it will really depend on individuals as to how much they will like this place.", "pics": null}}, {"review": {"des": "I remember this restaurant being across the street from ETHS, that's when I first tried Bop and Grill. I used to always get the chicken strips and fries. The other day I decided I wanted to go the new location which is on Sheridan Rd by Loyola University and get my usual. I noticed they changed the chicken strips and fries from what they were when I used to get them in highschool... I personally liked the ones before but these ones (in the picture) weren't bad.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ft2EFGvbNyU4uc9_u3vgoQ/348s.jpg", "caption": "Chicken strips and fries. $7"}]}}, {"review": {"des": "Not bad, but looking at the number of people flocking here, I just can't help but think, damn. I should buy some wholesale bulgogi and just sell it to some college students for a killing.<br><br>Anyhow, I was volunteering for something at Loyola across the way and really, it came down to being between this place and Chipotle...I figured, hell - why not?<br><br>I got a Bulgoi Bop plate and to be honest was completely underwhelmed. Yes it came with rice, salad and kimchi, but the kimchi was mediocre, the salad was simple, and the bulgogi was skimpy (looked like it covered more of the rice than it actually did..).<br><br>My dining partner got an umami burger and all I could think was \"pleeease just offer me another bite!\" It was damn good.<br><br>The kimchi fries were also mediocre. I'd pass on this if I were to come back.", "pics": null}}, {"review": {"des": "We meet up with my cousin, who lives in Chicago, for dinner.  He suggested this restaurant and we LOVED it!  We are from Hawaii and we started to miss \"local\" food.  This place definitely hit the spot!  My daughter is super picky and she loved and ate all of her chicken katsu!!!!  I'm telling you that in itself should say it all.  I had the bulgogi (BBQ meat) and it was yummy and spicy!<br><br>It's right off the red line (I think that's what the public transportation is called).<br><br>They have seating inside and outside.  We sat outside since it was a nice day out.", "pics": null}}, {"review": {"des": "one of my absolute favorite places! we go here for the philly cheesesteak egg rolls mostly. i warn you, go on saturday because they're almost always sold out on sundays. their burgers are also amazing and very fun. i've never tried their actual korean food, but can tell you the quality of their burgers are on fire. they're never dry and always a perfect medium. this bng is small, but it's quiet and has a lot of seating. the staff are kind and attentive. i'd recommend this place to most everyone!", "pics": null}}, {"review": {"des": "Woah $9 for a burger with 2 ounces of meat? Mgmt must be crazy. This thing is basically a greasy meat flavored bun. Save your money this place isn't worth it.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MzOPMHrsvnHH__4lVxbrfw/348s.jpg", "caption": "Omg Where's the beef??"}]}}, {"review": {"des": "I'm a huge fan of bulgogi (Korean bbq) and when I saw that they had a bowl for that, I was sold. I had a tray of bulgogi and rice underneath, along with a side of salad and kimchi. And we also got an order of their cheesesteak egg rolls !!! The bulgogi wasn't the best I've ever had, but it was still good. And the meat in the egg rolls blended in so well with the cheese.", "pics": null}}, {"review": {"des": "Pleased this spot is near my son's school, LUC!  \"Must-Haves\" are their loaded kimchi fries and their beautiful burgers.  The Bulgogi rivals any home-made versions.  Everyone in the family enjoyed their Fusion-Fair.  Looking forward to visiting/going back!  Many raves from \"Triple D\" and local food critics.  Getting hungry just writing about it.  Cheers!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wXLWaY1rccA7SnZcsvqv4w/348s.jpg", "caption": "\"Chicago's Best\" Seal of approval."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/21wDPvlZouR4U3pD77F7Mg/168s.jpg", "caption": "Steve Dolinsky, The Hungry Hound's Approval."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dTur78D2pLGYw2YEe1_EWg/168s.jpg", "caption": "Guy Fieri Stamp of approval!"}]}}, {"review": {"des": "I came across this place from Food Network Channel last week so we checked it out Saturday afternoon. When we showed up there & there wasn't many people waiting or eating, but shortly after people started coming in. Our wait to get food was reasonable time. <br><br>FOOD - My boyfriend & i ordered the kimchi fries and the cheese fries to share. I ordered the loco burger and he ordered the bNg burger. Taste wise we both agreed it tasted AMAZING! I saw some reviews on size per amount & people expected bigger. I'm a big/good eater and in my opinion i thought it was proper serving size. The burger was a normal size. When i read reviews i expected smaller from what people were saying. I left content and taste was on another level. My hands got messy but overall delicious! <br><br>DECOR/ATMOSPHERE - It is a very basic location. I noticed it wasn't the cleanest but if anyone has read any of my reviews.....i'm not a huge picky person. If i like food to me hands down that's what I'm going to do is eat so that's the most important part. <br><br>$$$ - As i mentioned, i saw people complain price for size. Comparing burgers to fast food it is a couple dollars more expensive but nothing crazy. I look at it as they offer something unique and tastes amazing, why wouldn't prices be a tad higher. <br><br>STAFF/SERVICE - You order and pay at the same time like any fast food typical restaurant. There is no one serving food or walking around cleaning. You are given a pager to wait for your food & pick up. The person who took our order was polite. They had a couple girls taking orders & another couple cooking. <br><br>I defiantly recommend this place if your craving burgers with a twist. I was hoping i could have ordered the egg rolls but those sell out quick from what the show said. As we walked in they had a sign that read sold out for the day. Will return & hoping in time for the egg rolls.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QL5cnXtxj0b_rEBCY6CdiA/348s.jpg", "caption": "kimchi fries/bNg burger. Loco burger/cheese fries"}]}}, {"review": {"des": "Used to love this place before but not now I feel like every food has gone downhill, too much rice, less meat, too salty etc..", "pics": null}}, {"review": {"des": "Paying $15 for a bibim bop plate with bulgogi and a drink was not worth it at all. Vegetables tasted old, especially the shredded carrots (they tasted gross), zucchini was the gritty kind, rice wasn't even the sticky kind (it was super clumpy), and the egg was poorly cooked. <br>I originally wanted to try this place for the kimchi burger, but I'm sad to say I will most likely never go back to this place :( so disappointed. Should have just gone for Chipotle next door.", "pics": null}}, {"review": {"des": "I had never been here before. First, I got the weekend special, the Philly cheese steak egg rolls. OH MYYY GOODNESS. I could eat 25 of them in one sitting. They were THAT GOOD. Second I got the tenders with kimchi fries. Loved the amount of toppings on the fries, but i have definitely had better kimchi. My boyfriend was boring and got a burger and fries that he scarfed down. No complaints ! I will be back to try some more fusion food here !", "pics": null}}, {"review": {"des": "I've had the chicken katsu plate which was decent, regular katsu plate. Nothing special. <br><br>Also the duxelle (umami) burger was great, I liked it a lot. It's not as great as a burger from the Umami Burger restaurant but still good. I think for next time I'd try something else though. <br><br>Lastly, the kimchi fries.. I absolutely LOVE their kimchi fries. It has a really nice kick to it and I love the flavor. It's not too much kimchi and everything else on the fries was a great addition.<br><br>Every time I've come here, my order was prepared quickly and truly delicious. The pricing is reasonable.", "pics": null}}, {"review": {"des": "Not sure if I just ordered the wrong menu items or if my expectations were too high because of all the hype.<br><br>I've eaten here twice now and my feelings towards the food are eh. I like the atmosphere but I think the prices are a little too high for the kind of restaurant this is and the food has underwhelmed me both times. First time I was here I ordered a loco moco and was kind of disappointed. Nothing was wrong with it, but I feel like I would have been better off eating at Aloha Eats if I wanted a loco moco. Second time I had an actual burger and that was better but I'm still not sure if it was worth the price. Definitely recommend ordering burgers here as a lot of my friends have the same \"eh\" feelings towards a lot of the other menu items.<br><br>Also, kimchi fries. These things get SO MUCH HYPE. Once again I'm not sure if it's just me, but I thought the kimchi fries were just a huge sloppy soggy (emphasis on soggy) mess. I think I prefer the kimchi fries at Del Seoul and maybe even the ones at Yeowoosai over the ones here. <br><br>All in all, bopNGrill isn't bad and if you're into the whole Korean-fusion trend, you might really enjoy it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Lf_LT-ckS9T8XlaEETp1wQ/348s.jpg", "caption": "Loco Moco"}]}}, {"review": {"des": "Great food. Service could definitely use some work. The front counter was rude and impatient.", "pics": null}}, {"review": {"des": "Oh. My. God.<br>That's all I really feel I need to say. <br>My boyfriend moved a block away from this place, and, well, we are going to get so fat. <br><br>Everything is amazing, even if you ask them to leave off the bacon. And the people there are nice! We even overheard a manager (or owner?) asking his employees what they wanted to eat that day. Just a nice place!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4eqRVX38LvtmW7qeyOa4pw/348s.jpg", "caption": "Burgers, cheese fries, and Philly eggrolls. We are part of the problem."}]}}, {"review": {"des": "removing the kimchi tofu from the menu and replacing it with two aggressively mediocre tofu dishes that look and taste like something my vegan ex used to make gets you zero stars. This was a very foolish move.", "pics": null}}, {"review": {"des": "We tried the kimchi fries, cheese fries, bulkogi bop plate, philly bulkogi egg rolls, and a burger. My favorite thing was actually the burger that my friend got that I tried. It was so tasty. The kimchi fries was good, but me being a Korean is really picky with my kimchi so I thought the kimchi was just okay. The cheese fries was delicious. The philly nullified egg rolls were my least favorite thing that we tried because I was thinking it would taste more like bulkogi, but it was kind of plain. The bulkogi bop plate was pretty good.  Overall a great place to visit. The food came out quickly and the little place was very nice to relax and eat at since we traveled all the way from Phoenix to Chicago. My friend said we had to try it out and I'm happy to have visited here.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TlupFxK0xIuqdW0hDnSSMw/348s.jpg", "caption": "Bulkogi bop plate"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Fq5141rnw37-7-g65SNE9g/168s.jpg", "caption": "Philly bulkogi egg rolls"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xVXaAccVV7ovk72xt2FluQ/168s.jpg", "caption": "Kimchi fries"}]}}, {"review": {"des": "Awesome selection of menu items. <br><br>Nice niche <br><br>I will be back to try their kimchi fries !", "pics": null}}, {"review": {"des": "Coming from Korean descent, I was really excited to check out this Korean fusion restaurant and I was so impressed by what I saw. I ordered the kimchi fries because I love kimchi and I love fries, I was expecting the kimchi to not have the full Korean flavor that I'm used to but it actually did. The service was great and my food was fresh so thats Nice. The outdoor seating was cute but I wish it felt a bit more private but I mean it's all good! I recommend this place to anyone who loves Korean food! Korean approved", "pics": null}}, {"review": {"des": "Bop n Grill used to be my favorite burger in the city but I feel the quality and service have severely declined as of late. The 2nd to last time we were there we waited almost an hour for a burger, a Loco plate, and kimchi fries. The restaurant wasn't busy and no one approached us to apologize or offer any type of explanation. The food was great but I thought the service was seriously lacking. I was sad enough when they removed the Bavarian from the menu, but on our last visit they had also removed the Loco burger and Loco plate. The signature burger list has dwindled to 3 and if I want a classic bacon cheeseburger, there are a lot of other places to go. I hope they bring some classics back or offer some new signature burgers. We probably won't go back until they do.", "pics": null}}, {"review": {"des": "As a former student of Loyola I would frequently eat at BopNGrill.  One day, I ordered the Father Burger and on my walk home the restaurant called me saying that they had forgotten the top bun!  They asked me to come back, and since I lived 5 minutes away I obliged.  Not only did they give me a new top bun, but they also gave me a free drink and a ton of fries along with their sincerest apologies.  A great meal with great service!", "pics": null}}, {"review": {"des": "This place is the bomb diggity and totally lives up to the hype. Anything Guy Fiery related makes my heart sing, and I'm so glad he didn't let me down. He never has (except for his awful restaurant in Times Square...but that's for another review...)<br><br>I love the vibe of this place. Casual and fun with a great soundtrack. I was bop'n and grill'n right along with them. <br><br>I ordered the fire grill entree as did my wife whose birthday we were celebrating. We both agreed the chicken was well cooked and really flavorful. Spicy but not too spicy. It came with a healthy serving of rice, salad and kimchi. We ordered the kimchi fries to share which were the perfect indulgence to pair with our main course. <br><br>Our friend ordered the classic burger and, after one bite, said \"this is the best burger I've had in Chicago\". Bold words, but a true gut reaction! (pun intended...)<br><br>Best part is this place is BYOB. I will definitely be back again to try the other entrees or perhaps take out. <br><br>Thanks for making my wife's birthday a delicious and memorable day! Happy wife, happy yelp review!", "pics": null}}, {"review": {"des": "I sang its praises far and wide, but as much as I hate to accept it, the Umami Burger at bNG is no longer my favorite burger in the city.  I'm not sure why the restaurant decided to change up a winning recipe.  Gone is the slightly charred brioche bun that set this burger apart.  The new bun is a doughier version that hides the flavors of the meat and other ingredients.  The patty is not as juicy and the mushroom duxelle is almost negligible in this new offering.  This burger used to be bursting with flavor, and now it's at risk of being just another burger in a city not lacking in burger options.  The kimchi fries are still excellent so our last visit wasn't a total disappointment, but until the Umami Burger is brought back to its original glory, it will be hard to justify a trip out to bNg to satisfy a burger craving.", "pics": null}}, {"review": {"des": "OMG I cannot day enough about the burgers at bopNGrill. When I'm in a binge eating mood, this is my go to burger. Their fries are also amazing. I really want to try the other items that they have on the menu but every time I go I end up getting the burger haha.", "pics": null}}, {"review": {"des": "Yeah so I've been wanting to come here for awhile and I finally made it....aaaannnnnddddd the verdict is.......well, you've already seen my rating. It was fine. Really friendly service at the counter, so that was a pleasant experience. I got the famous Unami burger and fries. It was good....nothing mind blowing. I've had many damn good burgers in Chicago and this one didn't even come close, but that said, it was not anywhere close to bad. It was just right in the middle. The sauce was a tad spicy, and was tasty. The bacon was thick-cut and the beef was too well done in my opinion. I should have gotten a bop plate. The folks I was with seemed to enjoy what they had and the presentation of everything looked delicious, if that counts for anything. <br><br>Definitely a solid joint. I'll return for sure if in the hood!", "pics": null}}, {"review": {"des": "My friends were at Loyola University and wanted to eat here for lunch. It was relatively empty on a Sunday afternoon. I ordered the philly bulkogi egg rolls to share and the bulkogi bi bim bop plate. I was intrigued by the egg rolls since they only make them on Friday - Sunday. My brain was confused since I was eating a philly cheesesteak inside an egg roll. While I thought it was good, I don't think I would order it again. It was a little too heavy for me, but definitely worth trying at least once. The bi bim bop was delicious and a generous portion. It's a cute place to eat, perfect for college students who want filling food.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9PTZv9NOFFdd4FX5_gl1ug/168s.jpg", "caption": "bi bim bop with bulkogi"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mBmfBqxkh9AHVmMShS3slg/168s.jpg", "caption": "philly bulkogi egg rolls (2 orders)"}]}}, {"review": {"des": "Delicious, properly portioned, tasty EVERYTHING. Bibimbop bulkogi, rice is tasty with crunchy not over dressed salad and kimchi. Worth the try. I went back to try they're loco moco with all the gravy (chicken katsu with gravy and an egg. Staff very accommodating and the place is clean. Philly cheese steak egg rolls are delicious!!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aZ2GPRayFzhZMhWdoXgnng/348s.jpg", "caption": "Yummo!!!!!!!"}]}}, {"review": {"des": "I've driven by this place a number of times and always wanted to try it, and today I got the chance to finally do so. Sadly, I wish I had not bothered. Limited menu, over priced and frankly lacking in flavor. My girlfriend had the BBQ tofu that came with a tiny salad that looked like it had come straight out of a \"mixed greens\" bag from Jewel. I had a burger that cost $9 and had nothing on the side, not even a quarter cup of the precut mixed greens. The *cough* highlight was the kimchi fries. All in all very disappointed, even more so that it cost over $35 with the tip I gave. If you go here, prepare to be underwhelmed.", "pics": null}}, {"review": {"des": "wanted to try this place forever but Parking isn't ideal on this corner..<br><br>Service- on point! helpful, sweet, and kind! <br>Food- so i got mine to go and when I got home it was still warm and OMG GREAT, well at least the Bavarian Burger was... the fries .. meh not to excited about them but then again they didn't last to get to my place so maybe there were good...? they evaporated from the bag in the drive from the spot to my place....  <br>Going back for more!!!", "pics": null}}, {"review": {"des": "The spatula met the burger in the hype of this place of burger bliss. Sooo good! Not only a fabulous burger and philly egg rolls on the weekend...but the service hustles and smiles while the place is shiningly clean. Even the patrons smile and say hello in an area of Chicago that tends to not be all that friendly. This is an absolute must visit if it is on your culinary stop radar.", "pics": null}}, {"review": {"des": "Loved the food, Could we possibly get more kimichi than a spoon?!<br> I wish it was a bit more affordable especially for students.", "pics": null}}, {"review": {"des": "This is a great place but it's a little expensive. I usually order an Unami burger with their special fries and it's very delicious! The staff is pretty friendly and I've never had problems here. It's also a very clean and Guy Fieri has rated this place as the a good establishment. Good place to eat, just not something I can always go because if my budget.", "pics": null}}, {"review": {"des": "Classic BURGER and FRIES!!! The ingredients in the burger are fresh the flavors clean and not too greasy. I am a french fry aficionado, the fries here are near perfect. Fresh, hot, and crispy every time! My only complaint on the fries - maybe a little light on the salt, though I like to think they are looking out for my health. Never had to wait in a line with more than one person in front of me, this place is a MUST TRY and COME AGAIN!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zUPXaZYwbB7zwotihTT6Mw/348s.jpg", "caption": "Classic burger and fries."}]}}, {"review": {"des": "Okay here's the rub, this is one of those all time awesome college town gems. I had the umami burger and it was a treasure trove of terrific-ness! Now the food delivery time from order to pick up was a tad long that just means it's cooked fresh from the ground up! Kimchee fries are the bomb! The counter girl was sweet and very helpful the kitchen staff are also super cool returning smiles and thumbs up when I saluted them as a left. I had to for only one triple D treat this trip and I'm so glad I chose BopNGrill! Go get you some deliciousness. <br>FoodDude!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qn-AQVq0hFSkpAycsrUdSQ/348s.jpg", "caption": "I will dream of this burger for weeks"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/H36VXWF2EoxTJuqKTmP1vg/168s.jpg", "caption": "Superterrific caramelized Kimchee bacon cheese and crispy coated French fries"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4U07TCxbXixy08kohnxF8w/168s.jpg", "caption": "One of the most unique burger / fries combos in the country"}]}}, {"review": {"des": "Tad skimpy portion for price.  Downtown prices that is additionally $1-2 more than usual.  Neighborhood place, no trek necessary.<br><br>FIRE PORK BELLY ($11) -- the jalapeño and grilled onion is missing.  Medium Heat is dominant, difficult to appreciate flavor.  The coleslaw balances heat.<br><br>BACON AND CHEESE FRIES -- good seasoning on fries, crunch and portion.  Skimpy on cheese topping.<br><br>PHILLY EGGROLL ($4.50) -- overpriced.  It's actually one eggroll split in half.  No cheese drizzle anymore.  All meat and white cheese filling.  Too salty.  Great when paired with plain fries (a meal in itself).  A better version at Sullivan's Steakhouse (River North).<br><br>SERVICE -- counter service.  No tips necessary, Yay!", "pics": null}}, {"review": {"des": "I like here. I order Chicken Katsu. Deep fried chicken steak with white rice. Side is salad and kimchi. Very delicious. And it is a big meal for a girl.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8lQ7y2InGHVfglm9z-KtYQ/348s.jpg", "caption": "Chicken Katsu"}]}}]}