{"name": "breakfast-house-chicago", "reviews": [{"review": {"des": "I've come here a couple of times on the weekend for breakfast/brunch, and I've had a great experience each time! <br> <br>Everyone that works here is so friendly and accommodating! This place runs like an efficient machine without making your time here feel rushed.  <br><br>And the food! Everything tastes so fresh and is prepared perfectly. The Chilaquiles are one of my favorite things. I  usually get the weekend specials, so note that these rotate and will not be on the menu every week.<br><br>Both locations are worth it.", "pics": null}}, {"review": {"des": "This place is absolutely delicious!!!! Everything we had was spectacular. I had the supreme chorizo hash (and added goat cheese). I took one bite and melted. Woowowow. Also shared the crepes. Yum yum yum. <br><br>The boyfriend got chicken and waffles which he gave a 7/10.", "pics": null}}, {"review": {"des": "This is a good place although I can only rate on the food since I had this delivered, but one thing I can say is that I had it twice in one week delivered. <br><br>Since I ordered breakfast twice for a full house I was able to experience a lot of the menu and all of it was great. I really liked the hash and the challah, both excellent. Biscuits and gravy was good as well. <br><br>One thing that I would say is that if someone orders something that would use syrup, HOOK IT UP. Don't get stingy on that syrup, we were under syruped twice unfortunately.", "pics": null}}, {"review": {"des": "That coffee, though. I drink it black and whatever it is that they're serving here is delicious! So dark and strong and beautiful. Kind of like Michael B. Jordan, but in liquid form. <br><br>This is a cute little breakfast/brunch spot and both the service and food was worth the price of admission. I will say that the Breakfast House Hash needed salt and the Salmon Cake Benedict didn't have as much salmon as one would hope, but everything we ate really was very tasty. This kitchen can also produce a properly poached egg, which shouldn't be as difficult to obtain in a restaurant as it is. I appreciate that, for sure.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4OWByGHJEosBWGo69W1Ovw/348s.jpg", "caption": "Atlantic Salmon Cake Benedict ($10.99)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5C2aBZ49f3SJ17tu4PAovg/168s.jpg", "caption": "Chef's Special Salad ($10.50)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Zs30qYI3RMvxX86XPJ82rA/168s.jpg", "caption": "Breakfast House Hash - w/added veg and cheddar ($10.25)"}]}}, {"review": {"des": "Great food and service here! I will definitely be back. My son and I ordered the following: <br><br>1. Fresh orange juice - legit<br>2. Challah French toast with apples - delicious. Not too sweet. <br>3. Beet salad - don't judge. I like my greens, but this was really good too. Portion was a tad small, but they were generous with the amount of beets. <br>4. Fried chicken and waffles -- really good. The skin was flavored and the chicken was moist. <br>5. A decaf latte -- good <br><br>All that for $44. The price is average to me.", "pics": null}}, {"review": {"des": "I came here this morning for breakfast and it was good just not out of this world.  I had the Supreme Chorizo Hash and for the price, the portion could have been a little larger.  I'd come back if I were in the neighborhood but wouldn't make a special trip out just for this.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/F5epxFWaL3IAVlHbYaYIkg/168s.jpg", "caption": "Supreme Chorizo Hash"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DVF6mbhYF0PmSeZ8i8lvTQ/168s.jpg", "caption": "3 Egg Omelet"}]}}, {"review": {"des": "Aye, we'll I heard such great things about this place.  I was really excited to try for brunch.  I had a few too many cocktails the night before and was pretty hangry when we arrived and in desperate need of some caffeine.<br><br>What a cute little bfast place!  A lot of outdoor seating in the shade, which was perfect.  They are also doggie friendly.<br><br>There was a wait when we arrived, but they text when your tables ready.  It was a quick wait, only about 15 mins.  <br><br>And then everything kind of went to shit from here...<br><br>Service, or lack of was painfully slow.  Now, everyone was really nice, but hot damn!  It was ssllllllloooooow.  I felt like I was in the south.  Also, it seemed like no one really knew what was going on.  Our server seemed hesitant...hard to describe.  We got the table in front of us's food.  They were trying to get chairs from a back table but lifting them up overhead...I was waiting for them to come crashing down on someone.<br><br>The food, oh the food was painful.  Sad face.  Chorizo hash...where'd the chorizo man?!  It was two eggs over a shit ton of potatoes with a few little diced peppers and I think a teaspoon of chorizo.  It was so sad!  Not to mention, no seasoning on eggs or potatoes.<br>Avocado toast...I was debating between chilaquiles and this.  Server said do toast....eeek, it was literally avocado sliced on toast with a big helping of spinach on top and two eggs.  Again, the lack of flavor on the avocado, eggs, etc was painful.  I've never had avocado toast that was this bad.  Like a little salt and garlic and you should be good...two thumbs down.<br><br>I was really hoping to find another bfast spot, but I don't think we'll be heading back here anytime soon.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FVc3IzqzwpFqOhMnmp6boQ/168s.jpg", "caption": "It's literally slices of avocado on toast"}]}}, {"review": {"des": "Nice environment with a lot of paintings in the house. It was easy to find a parking spot and the  service was great. I love their Chilaquiles! I am a vegetarian, they substituted chorizo to mushroom for me, the taste was outstanding! I will definitely go back for more!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NLIF-M4_ViYi_GRRXcVccg/348s.jpg", "caption": "Chicken salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wejUOhHQqVdm8av7SvwAiQ/168s.jpg", "caption": "Chilaquiles"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oKIloUG28khO4cYmbDIyCA/168s.jpg", "caption": "Latte"}]}}, {"review": {"des": "Who's house is this? Breakfast House! But for real literally looks like someone's house converted into a casual breakfast diner. I dig it.<br><br>Parking? Free on the street. We parked right in front. Talk about dumb luck.<br><br>Food? All in the name I guess. Breakfast! But they also do have a lunch menu that they serve later in the day. While we were here for breakfast, they do have quiet the variety of options. Everything from pancakes & waffles to omeletes & benedicts and even chicken and waffles and a variety of Mexican inspired dishes from the supreme chorizo hash, breakfast burrito, chilaquiles, and huevos rancheros. Yum! <br><br>What'd I eat? After much debate, I ended up going with the the chorizo hash while I was here and it was BOMB. While I enjoyed my dish, my wife's salmon cake benedict wasn't everything she hoped. Let's just say it tasted fishy (as in not fresh as one would like it to be). Sounded good on paper, but would probably pass on it the next time around. <br><br>Noteworthy? For coffee, they proudly boast the Intelligentsia they serve up. Quite the upgrade from a standard coffee you'd get at a normal diner. <br><br>Price point? Quite reasonable as most dishes are around the $10 mark +/-. Bill for 2 came out around $30 after tax and tip. <br><br>BYOB? Yep. Not a lot of tables turning up, but I do recall seeing signs indicating they are indeed BYOB.<br><br>'Til next time, cheers!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fbUfpemPpmDUBeIAbF1Wfw/348s.jpg", "caption": "Salmon cake benedict"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Z_vdzJLsuahKHdiQgVyS_w/168s.jpg", "caption": "Chorizo hash. Yum!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gSVwKMdCOsh5nBpjJawPfw/168s.jpg", "caption": "Coffee mug"}]}}, {"review": {"des": "Great breakfast!  A lot of options for my wife who is a vegetarian (not vegan.... Yeah!)", "pics": null}}, {"review": {"des": "Omg this place is a must go place if you're looking for some really really good breakfast/lunch choices.  The wife and I visited this establishment on the recommendation of friends.  It was a Sunday morning and around the heart of breakfast time, ~9am, when we arrived, 4 of us to be exact.  We gave our names and put in our phone number to be contacted when we were ready to be seated.  They had quoted about 30 minutes since they were rather busy but to our surprise, we received a text message within 10 minutes that our seats were available and to head to the restaurant for seating.<br><br>Off to a really great start to this establishment!  On to the food and menu... Everything sounded SO good.  For me, I'm a burrito  type of person so I try breakfast burritos wherever they have them available.  My wife tried the huevos hash.  <br><br>Omg if you've ever had a food flavor explosion before, this is exactly how the food felt when taking a bite from our food.  All the flavors complimented themselves as they nailed it on the flavor pairings.  I've tasted some really good breakfast burritos but this one topped them all.  The way that they topped the burrito with the sauce and lightly with sour cream.  The hash that accompanied the burrito was lightly crisp on the outside yet seasoned and flavored well on the inside.  My wife had almost the same exact expression on her face when she bit into her dish.  It was flavor fireworks...<br><br>We would definitely look to visiting this place and trying all the other items on their menu!!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MOyoxw69BrYM3rDF3Lu8Uw/168s.jpg", "caption": "Breakfast burrito and Chorizo hash"}]}}, {"review": {"des": "Unassuming from the outside, this BYOB spot has a great brunch! We arrived right before the rush around 10 am.m and sat right down on Sunday morning. After, the wait turned into about an hour. Super friendly staff and well-prices. Pictured: Salmon cake special, corn cake side and huevos rancheros. Yummy but recommend the latter with scrambled or fried eggs since all together this dish is a little runny.", "pics": null}}, {"review": {"des": "What an endearing, pragmatic, and aptly named little breakfast spot. This place features all your breakfast favorites at a reasonable cost, and in sizeable portions.<br><br>I discovered this place on a Sunday morning while looking for a no-frills breakfast joint, and it exceeded all my expectations. Despite the crowd outside, we were seated within ten minutes and the food was remarkable. We ordered the Fried Chicken, Eggs Benedict, Buttermilk Shortstack, and Chicken Sausage. <br><br>The service was great, and the restaurant itself is small, but clean and comfortable. I'll certainly be back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5J8_trmugcMfqrAYgfydsA/348s.jpg", "caption": "Fried Chicken Entree + Eggs Benedict + Buttermilk Short Stack + Chicken Sausage"}]}}, {"review": {"des": "4.5 stars<br><br>This was the first place I went directly from the airport upon arriving in Chicago. It was delightful. I fell in love with Intelligentsia coffee because of this place. I had some sort of corn cake meal with ham and potatoes. It was different than anything I'd ever eaten for breakfast. The place is not that big and started to fill up quickly by the time I left at 10am on that Saturday, but the staff and service was prompt. I definitely recommend this spot!", "pics": null}}, {"review": {"des": "Seriously delicious. Had the supreme chorizo hash, and may be best breakfast I have had.", "pics": null}}, {"review": {"des": "If there is one thing that I am a snob about, it's breakfast.  Your average every day eggs and bacon is not good enough to satisfy the intense cravings that I have for high quality breakfast food, but the meals at Breakfast House do.  The first time I went I decided that I should go with the dish that they were most famous for, the chorizo hash.  All I can say is, it lived up to the hype.  I though that what truly competed the dish was the spicy aioli on top to give creaminess to the potatoes and chorizo sausage that lay below it.  While it was great, the real MVP at breakfast house are the corn cakes.  HOLY MOLY I don't think I've ever had something so delicious at breakfast.  I ordered one on the side of my hash, and if it weren't for being so full I would have ordered another.  The next two times I went, I only ordered the corn cake entree with ham and eggs then a side of pancakes.  All of the accompaniments to the corn cakes are very solid and high quality, but the corn cakes are just absolute stand outs.  They come with a red pepper sauce that I need the recipe for because I would literally eat it on everything.  The most recent time I went, I ordered the monthly special breakfast burrito and it was a little below my expectations compared to everything else here, so I ate half and ordered two corn cakes to fill myself up instead... THEY'RE THAT GOOD! Can't say enough good things about Breakfast House; oh and by the way they serve Intelligentsia drip coffee which makes the place even better.  This is my go to spot on the weekends now a days and I don't see that changing any time soon.", "pics": null}}, {"review": {"des": "This is one of my favorite neighborhood places. It is a clean, nicely decorated family owned place that isn't the trendiest place around but has a great homy vibe and really great food!! Their hash brown potatoes are SO GOOD! Their servers are pleasant and friendly as well as attentive, and it is a perfect place for a good quality, reasonably priced brunch with a friend where it will not be too loud or crowded! Love breakfast house!", "pics": null}}, {"review": {"des": "Great flavors, large portions, affordable prices and solid service, all delivered on white linen - which is actually topped with white butcher paper. Just call it a fanciful diner!<br><br>There might be three styles of pancakes on the menu, but the Sour Cream Pancakes ($8.99 - with fruit compote) are not to be missed, followed by the flavorful Multi-grain Oatmeal flapjacks ($8.50). The table next to us was raving about the Chorizo Hash ($10.50) which was certainly large enough to serve two people.<br><br>The Huevos Rancheros ($8.00) are a lighter version of their much heavier Chilaquiles ($10.50), featuring two sunny side up eggs, on a pair of corn tortillas with black beans, <br>pepper jack cheese, avocado and a flavorful ranchero sauce.<br><br>Don't let the small entranceway deceive you, there's plenty of seating in the back as well.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jtoDaOYnwJKwNG14QcSMgA/348s.jpg", "caption": "Huevos Rancheros ($8) featuring two eggs, corn tortillas black beans,  pepper jack cheese, avocado and ranchero sauce."}]}}, {"review": {"des": "Went to Breakfast House on a Sunday morning with my husband and our friends. It was pretty crowded, but luckily the wait was only about 15 minutes. They take your phone number which is nice, so you can wait in your car if you want. The place is pretty small and there isn't much room to stand at the front. <br><br>We finally got our call and our tummys were very excited! As you walk in, there is a front room and a back room. We were seated towards the back which is a nice area and isn't as loud as the front. <br><br>The menu has a good amount of options, but isn't overwhelming! I did find a few things I wanted to try and finally made a decision! I went with the supreme chorizo hash which had their house potatoes, eggs, peppers, onions, corn, chorizo, guacamole, and a chipotle aioli. Now, most breakfast places have a chorizo skillet or something along those lines. I have to say that this is the BEST I have ever had! The chorizo was perfection! It wasn't greasy! There wasn't a layer of oil at the bottom of my plate, which was awesome! :) The potatoes were cooked and seasoned perfectly! The proportion of all items were perfect! I can taste it now! :) On the side, I ordered a short stack of banana pancakes. Oh my...they were so light and fluffy!!! I shared them with my husband and I secretly wish I ordered them just for myself. I guess it's not a secret anymore...lol! I washed it all down with sips of Intelligentsia coffee. <br><br>My husband ordered the breakfast burrito and I believe he enjoyed it. I was a bit consumed by my meal to really ask him...haha. <br><br>I cannot wait to go back and try the chilaquiles which is a house specialty! If the supreme chorizo hash was as good as it was, I can't imagine how good a house specialty is! You can tell they use good quality ingredients! <br><br>The service was good and friendly. Our server was the right amount of attentive! <br><br>I was at a trendy \"place to be\" kind of place for brunch the day before and I left not feeling satisfied and having dropped a good amount of money! The Breakfast House has great food at a reasonable price...exactly what I like! I thoroughly enjoyed my experience and can't wait to go back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZfF3nrL9mXfEulCxn3Lqqg/348s.jpg", "caption": "Chorizo hash"}]}}, {"review": {"des": "A great place for brunch with your friends. It's byob so you can bring your own Champaign to mix with their orange juice to make the perfect mimosa. Service is nice and attentive. The French toast is a must!", "pics": null}}, {"review": {"des": "Breakfast House is awesome! It looks kind of dingy outside and it's hidden on a little corner in an emptier side of the city, but once you walk inside you're greeted with a really casual environment that has a great homey feel. <br>The staff are all extremely caring and friendly, and out server was willing to make some great recommendations about their dishes. I got the supreme chorizo hash with a corn cake on the side-- both had awesome flavors and great texture. <br>I can't wait to return and try everything else!", "pics": null}}, {"review": {"des": "Meh it was okay. The coffee was terrible, whatever you do don't waste your money on it unless you're into bitter coffee. Pancakes were nothing special. We also had the breakfast hash which was pretty tasty. <br><br>The place was cute and cozy but we got stuck under the air vent which blew cold air our entire visit. The outdoor patio was cute!", "pics": null}}, {"review": {"des": "I Enjoyed breakfast it was delicious and fresh! Chicken and waffles was so good I'm coming back for more! Highly recommended! Coffee is so fresh and I love it! Awesome service! So clean. The supreme chorizo was delicioso!!!", "pics": null}}, {"review": {"des": "Wonderful breakfast place. Simple neighborhood spot with tasty food. Check out the menu and you'll see theres plenty of Latin inspired breakfast/lunch dishes.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sQ5_YhGOu-OS5z8Q6UCQsA/348s.jpg", "caption": "Huevos Rancheros"}]}}, {"review": {"des": "Came after 10am on a Thursday and was seated right away. Although breakfast time, they were starting lunch as well. I chose the popular chorizo hash. Potatoes, chorizo, corn, peppers and onions lying underneath an over hard egg, guac and topped with Chipotle sauce = Y U M! Such a flavorful combo. The menu had quite a few breakfast and lunch options with a small special menu on the side.<br><br>Hubs tried the chicken burger and a side salad. Simple but tasty. He said the burger was spicy and flavorful. <br><br>It was a full house and customers kept coming in so i look forward to going again and trying lunch.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/S_Xf99QlZxay8TKSCo0UqQ/348s.jpg", "caption": "Chorizo Hash"}]}}, {"review": {"des": "OMG! Try the AMAZING chilaquiles for breakfast!! Some of the best chilaquiles I've ever had! There was plenty of sauce, beans, and cheese...but the best part was the chips. They were still crispy enough that you got a little crunch in every bite.  My husband got the huevos rancheros and he loved them. Said everything was just right, except the spice level...but that's why there was hot sauce available. We arrived around 9:30am on a Sunday and the place was already packed but since there were only 2 of us, we were seated immediately. The service was very good - our drink order was taken almost the instant we sat down and our food order shortly after. The food arrived quickly and while still hot. We spent ~$35 with tip for 2 entrees, a side of bacon, and 2 drinks. We will definitely return when we return to Chicago!", "pics": null}}, {"review": {"des": "I had 2 eggs n andouville sausage slices and potatoes... tasted great! Plus French toast with whipped cream... very good! Place feels small at 1st but it's fine. I liked it all", "pics": null}}, {"review": {"des": "I love all forms of corn (except corn in its original form, so I guess actually, I need to take that statement back...but anyway.) When I saw corn cakes on the menu, I knew that I had to get it. The corn cakes were delicious with butter and the roasted red pepper sauce was perfect on top. I could have done with a little more on the ham and I got scrambled eggs, but honestly the corn cakes alone were good enough for me!", "pics": null}}, {"review": {"des": "Breakfast House is a good option in the neighborhood and worth a try. Quick service and efficient staff. I ordered the chilaquiles which are deemed \"award winning\" but replaced the chorizo with turkey sausage. <br><br>While I liked the ingredients used, it was surprisingly not spicy at all. I'm not sure if I missed out on adding jalapeños, if that was an option, or if I simply received a mild version of the dish. In any case, each ingredient was good and the bean base was prepared well. The eggs came scrambled but if I could redo it, I would have asked for them sunny side up. <br><br>Maybe next time I come for a visit, I'll have them make a couple modifications and give them 5 stars.", "pics": null}}, {"review": {"des": "Made a same day reservation on Saturday for brunch at 10:30 AM. The only take reservations for parties more than 5 people by the way. Probably could have walked in without making a reservation, there were quite a few open tables. <br><br>We ordered the following:<br><br>-Breakfast Burrito: Meh. Was mediocre. Didn't have that much flavor.<br><br>-Huevos Rancheros: Was also meh. I've had better huevos before. Had to drown it in hot sauce to give it some kind of spice. The beans were good, mucho cheesy.<br><br>-Chilaquiles: Verrrry good these tasted amazing. If I come back, this is the only thing I'll order again.<br><br>-French Toast: Came with fresh strawberries and blue berries and we got nutella and dulce on the side. It was like a desert to our giant brunch meal. <br><br>Service was consistent, decor is diner like. And the lights kept flickering above our heads... maybe this place is haunted. In conclusion: I wasn't wowed but if you're making your way here get the chilaquiles.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1EzQQBLBkHgP_pl3Rt1BLA/348s.jpg", "caption": "French Challah Oven Baked French Toast"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TQ4k699XBLhf6WEujCt37A/168s.jpg", "caption": "Breakfast burrito"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Fg49Nv2YT5E9z0SlSuSNFQ/168s.jpg", "caption": "Chilaquiles"}]}}, {"review": {"des": "I really enjoyed Breakfast House! I thought they were a fast, delicious, and great option for a quick brunch. They offer all your classic brunch options and don't really disappoint in any of their offerings.<br><br>We got the beef brisket hash, french omelette, chicken and waffles, and seasonal french toast. Of the four I definitely recommend the Chicken and Waffles and French Toast. I find that chicken and waffles is incredibly difficult for brunch places to nail. Either the waffles are soggy or the chicken tastes like they pulled it out from the freezer section of a grocery store. Not here! The chicken was moist inside with a crispy exterior that didn't just pull off. The waffles maintained their flavor and texture and I was VERY happy with how everything tasted together. The French Toast was some of the best i've had in the city, not soggy and not covered in an ocean of sauce. Good flavor, not too sweet, fresh fruits, cant ask for much more.<br><br>Overall a great place to get some quick brunch. Will be back soon!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Bt_oUpfAkXbkY9IzxmEDYw/348s.jpg", "caption": "French omelette"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FnUL8BRvcLzd4hhvaP8ncQ/168s.jpg", "caption": "Brioche french toast"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1XH7cJouZRbR92AibcPNNw/168s.jpg", "caption": "Chicken and waffles"}]}}, {"review": {"des": "This was our first time here. Wow!! We are visiting from Las Vegas & our son brought us here for brunch..I had baked french toast with fresh blueberries  & strawberries. So awesome!!  I am definitely  going to make this at home!!!", "pics": null}}, {"review": {"des": "Been a while now since we had breakfast at Breakfast House. It was a nice place. Smaller place than I expected, but it was an overall good experience.<br><br>Among the group, we had waffles, pancakes, grilled cheese, and hash brown. Everything was good. Not the best, but definitely good. Good spot if you're local or nearby.", "pics": null}}, {"review": {"des": "Brunch is the best thing that was ever created!!! After a great workout, I was able to grab a quick bite at breakfast house. <br><br>Super easy parking in front, it's all free so that was a plus. The waitresses were super friendly and very accommodating. <br><br>The hash special was amazing. It really gives you a combination of everything. You got the hash, the onions, the bell pepper, sausage, need I say more? It does give a bit of that Latin mix in there and if you put all those ingredients in your mouth at once, your mouth is having a party. You'll thank me later. But the flavoring was so good I almost cleaned up that plate and wanted more. So that really goes to show how tasty that hash dish was. Would I be back? You bet I will!", "pics": null}}, {"review": {"des": "I came in on. Saturday afternoon after my boxing class around the corner (Oakley FightClub). I wanted to eat big after a good workout. I found this little gem on yelp and decided to stop in. I immediately saw the \"chef special\" and decided that's what I wanted. <br>Venue: the space is not that big in the front area but nice and quant for small groups. There is seating also at the counter, diner style. There is a back section for a larger group and also outside seating.<br>Service: my server was young and a little timid but took care of me. He forgot to bring my fresh squeezed juice but I had so much food I didn't need it anyway. There is also outside seating in front and on the side.<br>Food: everything was on point and I actually have nothing negative to say. The southwest scrambler was very tasty. The pancakes were great w the bananas and whip cream topped them excellently. The chicken sausage was good w a little crunch to it and cooked well.<br>I would definitely come back and bring friends and recommend this little gem to everyone.<br><br>Enjoy!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fk8MaB7lGckYRcrfVhVxQw/168s.jpg", "caption": "Southwest scrambler w egg whites, short stack w bananas and whip cream (not shown) and a side of chicken sausage"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uPBW7gqZv_Ke-drxo2h7cg/168s.jpg", "caption": "The bill"}]}}, {"review": {"des": "Pretty perfect. Price is right, food is delicious and drinks are tasty. Intelligentsia coffee started me off right. I had the chilequiles and it was so good. Such a balance of flavors, without being too much. The French toast my husband got was seriously the most perfect French toast I've ever tasted. It wasn't too eggy or doughy, and covered in fresh fruit.", "pics": null}}, {"review": {"des": "Came here for lunch just a quick walk from my Airbnb. Ordered a breakfast burrito, which was covered with sauce. Unfortunately, the burrito tasted pretty bland. I had to drench it with Cholula just to get some flavor. In addition, the scrambled eggs inside were a bit overcooked so it tasted pretty dry. <br><br>A plus is that they serve intelligentsia coffee here.", "pics": null}}, {"review": {"des": "Never dined in, only carry out for Breakfast House. But I can tell you, their food is ALWAYS FRESH, FLAVORFUL AND DELICIOUS. <br><br>Vanilla pancakes with strawberries and bananas has to be my favorite. The breakfast hash is good too! I wish their chicken and waffles had chicken strips instead of breasts and thighs, but that's more of a personal preference.<br><br>Food is always ready so quick too!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NQGIWJnXimhTK8VC3dCjtg/348s.jpg", "caption": "Breakfast house hash!"}]}}, {"review": {"des": "If in Chicago, take the 2.5-3 mile ride out to west loop for breakfast/brunch!! I made an egg white omelet with broccoli and mushrooms. So fresh, the mushrooms were way good! Also got strawberry pancakes on the side. Possibly best pancakes I've ever had - favorite in Chicago so far for sure. My dad completely agreed (and he's a hard food critic). My parents both made their own omelets and enjoyed them as well. Food came piping hot out from the kitchen window which is always a plus. Great service and cute environment. Don't bring a crowd though as most tables sit 2-4, and couple sit 6. Easy recommendation.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2cv567ElLJxKp9W_QVA9Fg/168s.jpg", "caption": "Best pancakes I've had"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7tvY2XLMaD-uc-C6kWphNw/168s.jpg", "caption": "Egg white omelet w/ broccoli and mushrooms"}]}}, {"review": {"des": "Fantastic! If you want a little neighborhood delicious brunch spot here it is. The place seems family friendly and has an extra room for seating in the back. It's always packed because all the locals know how tasty it is. Eggs, waffles, this place has all the typical breakfast foods. Very good in", "pics": null}}, {"review": {"des": "Good place to eat. Staff was great. Will eat there again.  The atmosphere was cool. Loved the tea.<br>Everyone in the group loved the food. Clean plates all-round.  Was able to find parking pretty quickly for a neighborhood place.", "pics": null}}, {"review": {"des": "Does this breakfast house only have one old pot?<br>The pouched eggs came with bits and pieces from the pot it cooked in, the tiny bit of water in the bowl looked super grease, and the eggs tasted metalic!<br><br>Perhaps I went to the wrong house...", "pics": null}}, {"review": {"des": "I love the fact that we were able to put our name on the list prior to our arrival. Once we sat down, everyone was very attentive and aimed to please. We had the chilaquiles (DELICIOUS), the burrito with chorizo, and a BLT. I then added a short stack of pancakes too! All the dishes were a large portion and cooked to perfection! AND it's BYOB! <br>Winner winner! I'll definitely come back.", "pics": null}}, {"review": {"des": "I was at a shop on Milwaukee Ave. to pick up something and asked them where the go-to spot is for some breakfast, and they all said Breakfast House on Grand.  I called and ordered take out Parisien Omelette and croissant sandwiches for my co-workers.  It was ready in 10 minutes, the staff were super friendly, the restaurant is really charming, and the food tasted great!  The food looked good even in the take out containers that when my co-workers opened them up, they were like \"Whoa! that looks awesome!\"  They know how to take care of customers.  Keep up the good work!", "pics": null}}, {"review": {"des": "Third trip here. Today a breakfast burrito.<br>Easily the best I've had anywhere. All egg dishes are very good. Coffee strong and fresh. Fair prices.", "pics": null}}, {"review": {"des": "Definitely deserves a 5 star. Great breakfast place. While we were driving to the restaurant we were able to put our name on the checklist to prevent a long wait time through Yelp and it was awesome! Service was very good. My husband and I both decided to try the \"Chicago's Best\" Supreme Chorizo Hash, delicious... highly recommend it. The coffee was priceless. Overall an amazing experience for a beautiful Sunday morning.", "pics": null}}, {"review": {"des": "Thought we were at the wrong place as this looked like a house with an awning that said Breakfast House. Promptly seated in this small dining area and served almost immediately. The food was amazing--from the steak and eggs to the beet salad, it was all delicious. The steak was not too thick but was cooked and seasoned perfectly which is tough to do on something not very thick. Would definitely come back.", "pics": null}}, {"review": {"des": "The place is a delicious local spot. People are friendly. We had the chicken and waffles and the breakfast burrito. Chicken was delicious but could have been a little saltier. Waffle was a little too spongy. The burrito was absolutely delicious! Would definitely go back .<br><br>Update : on the second visit the chilaquiles are amongst the  best we have ever had and the corn cakes with VIRGINIA ham was the bomb.", "pics": null}}, {"review": {"des": "Best chicken and waffles I have ever had.  Service was phenomenal, coffee fresh and unlimited.", "pics": null}}, {"review": {"des": "One of the best places for breakfast in Chicago! Food is top notch and they provide a great selection at an affordable price. I love the chilaquiles! My BF loves the chicken and waffles. The service is always outstanding!", "pics": null}}, {"review": {"des": "I went to Breakfast House for the first time last weekend and it was amazing. The hash I ordered was delicious and the coffee was perfect. I will definitely be back.", "pics": null}}, {"review": {"des": "I haven't eaten at the actual restaurant but, they come to my job as food vendors. I usually get the loaded hash browns and, for the most part they're pretty good. I've watched them cook other people's food & it looked pretty good as well. The only two negative things I would say is that they need more help due to long lines & sometimes they don't cook the right food. Two, I think they should have more breakfast specials like they have for lunch. Overall, my experience with them as vendors has been good. And, they're very hardworking!", "pics": null}}, {"review": {"des": "I had to apologize to my boyfriend!! <br>After telling him I really wanted brunch and suggested we go to Yolk, he takes me here instead. I was a bit disappointed, and ask why he didn't just take me to the place I asked. He said this place is way better. \"But it doesn't have as many reviews as Yolk!\" I exclaimed! During the short wait, we asked a couple if they have been and they said they loved it! So that helped to reassure me. After waiting outside in light rain for about 15 minutes, we were seated. I looked around at everyone's plates, most people had the chillaquilles they are known for and pancakes. After much deliberation my bf decided on the chicken and waffles  and I decided on the French toast with a side of chorizo scrambled in the eggs. I was BLOWN AWAY. I haven't had good French toast sense trying batters and berries. This French toast is just as amazing. My boyfriend's vanilla waffles and chicken were perfect. The chicken was seasoned, fresh, hot and crispy. I could not have been more happy with my meal! I apologized to my boyfriend for not trusting him to make the best choice (I'm not even from Chicago). I will def be back frequently. This on my too brunch list.", "pics": null}}, {"review": {"des": "It is cute and affordable. However, customer service could've DEFINITELY been better. I think I had like 3 servers. The sweetest and most attentive one wasn't even my actual server. She was simply helping. My actual server didn't really understand me when I said I wanted both items on the kids menu ( I had my daughter). She kept repeating pick one. I don't know if it's because I am a young mom or she really didn't understand that I was going to pay for TWO items. She also didn't bring my daughter's juice till I asked for it when I was given the check which also took more than enough time. Now the food could've been better BUT it did its job. I do support local small businesses. But I also do love quality and customer service. This place really could've gotten a better tip from me. I will try it again one day. I don't hate it. I just hope there will be better days because it's so close to many places I go. And plus, the pancake for kids is really cute.", "pics": null}}, {"review": {"des": "What to have?  What to have?<br><br>The whole menu presented very enticing options.  I watched as plates were brought to various tables--all looked good.<br><br>I finally settled on the fried chicken and waffles.  Let's see.  How to describe perfection?  Crispy is one word.  The waffle was crisp perfectly, a Belgian waffle.  Tasty and a wonderful, if traditional, accompaniment to the chicken.  And the chicken had a crisp, tasty coating--the chicken itself was delicious, perfectly cooked, moist, succulent.<br><br>Luckily, I had the fried chicken past December which means that my one allotment of fried chicken is back in play for the new yeasr.  This could be the place for that, unless I'm tempted by their other selections--a likely temptation from all appearances.", "pics": null}}, {"review": {"des": "I LOVED this place. <br>The crepes were awesome and I loved the Latte.<br>They were nice and attentive.<br>Highly recommended!", "pics": null}}, {"review": {"des": "This place is great. Serves Intelligentsia coffee, offers plenty of different breakfast options from sweet to savory, always quick service, and a cute atmosphere with lots of light. Lots of lunch options on offer as well. Easy to find parking right outside on Grand. <br><br>Overall, a great spot to hit on a weekend morning. You can add your name to the waitlist on Yelp when leaving home and your table will be ready shortly after arrival. Prices are very reasonable for the amount of food. The specials are great too - I tried the brisket hash this morning. I'd love to have it again, so maybe they'll put it on the menu permanently? *fingers crossed* :) See you soon, Breakfast House!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MZbDywDvWdPeegJfB_7ROw/348s.jpg", "caption": "Brisket Hash. Yes, there's plenty of brisket in there under the eggs and greens!"}]}}, {"review": {"des": "Found BH via Yelp and was surprised we didn't have to wait for a table around 11:15 for brunch. Then again, this neighborhood sees less traffic overall. <br><br>We both went the hash route for brunch.  I had the signature \"Breakfast House hash\" which had Andouille sausage and red peppers, and K tried the chorizo hash.  Both of us enjoyed the preparation of the potatoes and flavor combinations.  Intelligentsia coffee is served here too!<br><br>Will definitely stop back in if in the area.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/T5H3T_Vs-bkBfk2u0Pyuqg/348s.jpg", "caption": "Chorizo hash (in back) and breakfast house hash with Andouille sausage in the front"}]}}, {"review": {"des": "I had breakfast this morning with my family. Loved it! I had an omelette with red peppers and mushrooms, a corn cake and fresh fruit. Everything was perfect! The pancakes my son had looked great and he said he loved them. The only small glitch I had was the coffee was not hot. I told the waitress and she made a fresh pot - easily fixed. I just don't want to have to request hot coffee.<br><br>The place is small and clean, a very attractive room. The service was wonderful, attentive but not bothersome. The prices were fair, a good value. I will definately be back!", "pics": null}}, {"review": {"des": "Maybe I picked the wrong thing on the menu? I got an egg white frittata and I will say it was meh. First it wasn't a frittata. They just cooked some egg whites and then threw spinach and feta on top orbit rather than cooking it into the eggs which is the whole basis for a frittata. The bf got steak and eggs which to me is pretty basic. Highlight of the breakfast was the French toast which was baked so it left the outside crispy with some nutella on it and some fresh strawberries. It was wasn't too sweet and was pretty tasty. I wouldn't go out of my way again to dine here, there are better breakfast places around where I most likely wouldn't come back.", "pics": null}}, {"review": {"des": "The place is ok. We went there this morning and my wife ordered a Fritata, daughter got the crepes and I got Chicken and Waffles. My wife asked if the Fritata came with a side and was told no but she could order a side item. How can you charge $11 for egg whites and not give a side considering you have sides with all of your other egg dishes. My daughters crepes were too thick and not that good. As for my chicken and waffles, the whole thing could have used some flavor. The special marinade was not so special, and overall was not good tasting. Don't think we will ever be heading back here again.", "pics": null}}, {"review": {"des": "I've been here a few times, it's small and popular, so you might want to check on the wait time before you go. <br>Food is good. <br>Plenty of CPD eat here, to help you feel safe.", "pics": null}}, {"review": {"des": "This might be the second worst breakfast I've had in my life. We ordered a simple eggs and bacon with oatmeal and then chicken and waffles. Everything was wrong with the food and I don't know how they ever got to a high rating. There are hundreds of far far better breakfast places in Chicago and I would never eat from this one again.<br><br>I had read these were supposed to be some of the best chicken and waffles in Chicago, yet they were hands down the worst I've had anywhere. The chicken was like grocery store quality fried chicken with a spice blend that reminded me of carnival food. The waffles tasted so generic and just sugary, I might as well have gotten them from a continental breakfast at the Holiday Inn. Overall beyond disappointing. Especially since the chicken isn't boneless and I'm not interested in putting that much effort into breakfast. It's breakfast, I'm tired.<br><br>The eggs and bacon didn't even come with bacon, they gave us sausage. The potatoes we asked to go with it were mushy. The eggs were supposed to be over easy but the eggs came with almost no yolk as they had obviously been broken at some point in their journey. The sausage was sadly the only good part of the meal. That leaves us with the \"steel cut oatmeal\". That's in quotes because it was absolutely not steel cut. It was like cheap just add hot water bottom dollar oatmeal that looked more like grits than it did oatmeal. It tasted like it had gone bad and the apples that came with it I'm pretty sure came out of a can.<br><br>I'm not sure if it was just a bad day, wrong time, or this restaurant is just garbage with reviewers who instantly forgot that there is other food in the world that is drastically better. I certainly won't try it again to find out.", "pics": null}}, {"review": {"des": "Literally stumbled into this place off the street while walking from our Airbnb to Goose Island Brewing. The food, service and atmosphere were top notch. Definitely recommend.", "pics": null}}, {"review": {"des": "No waiting time and absolutely delicious plus great service. Awesome breakfast spot, my favorite so far in his trip to Chicago.", "pics": null}}, {"review": {"des": "Loved it! I ordered the chilaquiles and it was fantastic.. I love the mexican flavors with my breakfast meal. I also got a french vanilla latte that had nice foam on top, but the shot of espresso was a little dead tasting like it had sat and gone flat, but other than that, great experience!", "pics": null}}, {"review": {"des": "Sometimes you don't want to deal with the River North brunch, 1-hour wait, song and dance. I was meeting some friends at a brewery nearby and decided to stop in to Breakfast House on a Saturday. My husband and I were able to grab a couple of seats at the bar right away, and it seems like it wouldn't have been a problem to grab a table if we had wanted to. <br><br>The server took our order quickly. I got the chilaquiles and he got the eggs benedict. My chilaquiles were everything I could ever dream of. The chips seemed homemade and most retained a crunch even under the layers of amazing cheese and sauces. I hate when I get chilaquiles and there's just boring chunks of scrambled egg in them. Not here--the eggs disappeared into everything else and it was just a delicious cohesive dish. The crumbled chorizo and guac on top was perfect. My husband really enjoyed his eggs benedict, it's his favorite breakfast and we thought it'd be a good benchmark to try for our first time here, and it didn't disappoint. We also tried a corn cake since it seemed interesting. This was also great and came with a nice spicy sauce. We had such a nice experience here, the staff is friendly and quick and the food is flawless, and CHEAP! We kept eyeing the fried chicken and waffles and the blueberry pancakes that kept coming out. We might have to come back next weekend to try some more.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ya85l6DXwTXrRAWw-sziPw/168s.jpg", "caption": "Eggs benedict"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mp7ifXrlBDzrIyp5zCWg_g/168s.jpg", "caption": "Chilaquiles"}]}}, {"review": {"des": "This is a very nice cozy restaurant in a comfortable environment. The staff are very nice and the food is excellent.", "pics": null}}, {"review": {"des": "Great food. Terrible service. Took 20 minutes to get me a cup of coffee. Do. Not. Come. Here.", "pics": null}}, {"review": {"des": "Just ate breakfast here for the first time. The food was very bad. I got the croissant sandwich and the eggs tasted like they were microwaved and the croissant was soggy. The latte I ordered was the only enjoyable part of the meal. The omelette that was also ordered was not very good. Would rate the quality of the meal a 4 out of 10.", "pics": null}}, {"review": {"des": "Excellent service. Good food. Cozy atmosphere. A little bit pricey, but I think it's worth it. Intelligentsia coffee. Salmon cake eggs benedict! Choice of fresh fruit or potatoes with most entrees. There is a small outdoor seating area. A very comfortable place to go.", "pics": null}}, {"review": {"des": "Made reservations for 10 people for 11a on a Sunday, when I called I told them it was for a business meeting. This was my first time there, as well as my guests. Everything was smooth from the beginning, food was good and so was the service. At about 1p our server told us we had to leave because we had been there for two hours. We weren't loud or obnoxious, I just think they wanted our table. I felt bad thinking there would be a line out the door but there were only three people waiting. I've never been asked to leave a restaurant before even when I didn't tip 20%. This just left a bad taste in my mouth and I don't think I'll be back.", "pics": null}}, {"review": {"des": "This is a must have in Chicago. Everything was delicious and fresh. We had the chorizo hash, buttermilk pancakes, eggs and corn cake (which is deserving of its own review). Fresh squeezed OJ and great coffee too; not to mention, the wait staff was extremely friendly. You can tell this is a family-owned joint that cares about its customers. Can't go wrong ordering here!", "pics": null}}, {"review": {"des": "Baked French toast was amazing! Burger was great! Only reason I won't give them five stars is because the place is really small and when I ordered pop, got it in a can instead of a bottle (real sugar Mexican coke) or fountain. I would still visit again though, just won't order soda.", "pics": null}}, {"review": {"des": "Great Service!Great Foods!Great atmosphere!!! Very Clean!<br>Great Place for Breakfast and Branch !<br>Highly Recommended! Definitely I will be back!‼", "pics": null}}, {"review": {"des": "So cute, so personable, on such a cold winter morning, it was nice and warm. Had breakfast and it was so good!!! Definitely a new fan of corn cakes!!", "pics": null}}, {"review": {"des": "I'm always attracted to places with unique breakfast options.  Sometimes they fail and disappoint, but this was not one of those times.  First of all, the place is BYOB, so we combined our Champagne and their OJ/Cranberry juice for our own bottomless Mimosa special.  (yeah!!)<br><br>Service was fantastic.  I opted for the Corn Meal cakes and subbed bacon for the ham and they were delicious.  Another diner had the Chicken and Waffles and they probably were the best dish there if that's your thing.  The chicken was crispy as hell and the waffles didn't have the sog factor I've seen elsewhere.  Another diner had the Chilaquiles and reported it to be darn excellent as well so no complaints.  <br><br>Place is small so be prepared for a wait unless you have reservations (and even then you may still wait during prime hours as we did with our group of 8).   I would give it 5 but not thrilled with the ambiance in the place, but if you want great service and food and don't care, you must check this place out.", "pics": null}}, {"review": {"des": "Second time I been to this spot! The wife and I had the house burger with a fried egg...positively exquisite! Not messy at all it completely held it self together while I ate it, and that's a big deal when you have two small children eating as well...the tenders my son got are also delish! Our server CECI was very prompt and friendly and when my son dropped his plate halfway through the meal she replaced it with a whole new order! If that is not service with a smile I don't know what is :) all in all I would recommend this place to anyone who wants the best breakfast food in Chicago and service that is extremely friendly towards kids/families..I will definitely continue to visit this establishment with friends, family and acquaintances. <br>Ps. The strip steak is also exquisite for those looking for a heartier meal", "pics": null}}, {"review": {"des": "Had the corn meal cakes, the chorizo hash and the house hash at Breakfast House. The portions were just the right size and the food was delicious- the sauce on the chorizo hash especially was delicious! The waitstaff were attentive and fun. Definitely coming back!", "pics": null}}, {"review": {"des": "We went this morning and the consistency with excellent food is still there. It's gotten more popular - which I'm happy about - but expect a wait. It was not bad and it was worth it. I tried the chorizo hash with over med eggs - avocado and some sauce...yum! My friend got the cornbread patties with eggs, ham and sauce. He swears it's the best breakfast in the city. So glad to have a quality place in the neighborhood that has continued to approve. Bravo...", "pics": null}}, {"review": {"des": "Overall, I'm swinging between 3.5 to 4 stars. Service was quick, friendly and attentive. They are byob and have fresh squeezed oj or grapefruit juice, which is a major plus! I ordered the chilaquiles that everyone is raving about.... it was good, but not the best I've had....nor did it really live up to all the hype on Yelp, unfortunately. I like how there were a variety of ingredients in it, but I thought the eggs were a bit too \"eggy\" and the flavors were too subtle (became one big mush after awhile). I'd love to see more zing come through the beans, corn, guac, chorizo (which I barely tasted). My husband got the chorizo hash, which was also highly rated on yelp... the potatoes were NOT crispy at all! Just boiled :( Perhaps next time we will specify for a super crispy sear. Pancakes were ok, not the best but not the worst. They serve it with store-bought jam and butter packets, along with the standard syrup. <br><br>If in the neighborhood again, we may stop by, but I don't think we'd drive exclusively to eat here, IMO.", "pics": null}}, {"review": {"des": "Food and coffee was excellent. The hostess was sweet and very educate, however our server was a different story. But regardless of that, I would recommend this place for breakfast and brunch! The eggs Benedicts were perfect and delicious!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rhuFoCkg11QpREbmOsJ-QA/348s.jpg", "caption": "Salmon eggs Benedicts (it comes with two eggs)"}]}}, {"review": {"des": "After my second visit today, this is now my favorite breakfast spot in Ukrainian Village/West Town/Bucktown. The atmosphere is just right: no frills but nice, warm hardwood floors, lots of natural light, and a vivacious but not too loud or chaotic population of diners and servers. The servers are so kind and have taken care of every need big and small, which is a bonus for a byob spot. Our server today brought us a big ice bucket for the prosecco and another one kept our coffee filled and hot the whole time. The food is glorious and simply high quality. Portions are plentiful but not enormous. Options abound and your server will likely make you aware of them. We decided to tip well over 20% today because of all these things. It was such a nice time and I am sure you will agree. Go in a group or in a twosome, with parents or kids, sitting outdoors or in, and you won't be disappointed.", "pics": null}}, {"review": {"des": "This food was amazing. Hands down one of the best breakfasts I've ever had. A group of us went and they made a table big enough for us. The server was very friendly. Would definitely recommend.", "pics": null}}, {"review": {"des": "A great place for breakfast or brunch. Owner is always there busy making sure everyone is happy and being served. Great service. Great food. Recommend to anyone looking for a good Saturday morning spot.", "pics": null}}, {"review": {"des": "Got to the restaurant and it was a bit busy but we were able to get seated right away. The place looks nice and clean and they offer outdoor seating so that's cool. Our server didn't Hebron get babe but on the receipt it says Paulina, she was attentive and came by to check on us the right amount. We were also helped by other wl staff members so that was nice as well. As for the food, it was good, has the breakfast burrito and French toast with dolce de leche. Will come back again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xitZov29PK-zxFFzPyxeBg/348s.jpg", "caption": "Outdoor seating and plenty of free street parking"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-Poga6sLVmnZtPNJW0rq7Q/168s.jpg", "caption": "Good coffee"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EymSqPbL4YGR_wuPt-qTcg/168s.jpg", "caption": "French toast"}]}}, {"review": {"des": "We came here for breakfast on a Saturday morning. It was busy but we were seated right away. They have us our menus and water right away. The service was amazing and they were all very friendly and accommodating. They offered us a high chair as well. <br><br>The food we ordered came quickly!! It was hot and very delicious. I had the original Benedict. It came with potatoes. The eggs were perfect and the potatoes delicious. My husband got the chilaquiles and they were amazing!! We also ordered the children's French toast with strawberry and it was surprisingly good. The portions were really big as well. Can't wait to come back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oHGwCE7_1ya3Xs185yvPBA/168s.jpg", "caption": "Mocha Latte"}]}}, {"review": {"des": "Truly a hidden gem. This place is awesome! I had the chorizo hash and it is one of the best brunch dishes I have ever had. The eggs were cooked perfectly and the combination of flavors is fantastic. It was so good we went back the next weekend! I tried the chilaquiles the second time and it was great as well. However, the chorizo hash is definitely my favorite thus far. The staff was nice and service was decent; however the service was a bit slow at times. They also have outdoor seating which is very nice in the warmer months; however it is limited and the tables are small. But overall I would definitely recommend!", "pics": null}}, {"review": {"des": "Food was very good. Table was clean. Bathroom not too hot. take someone worth it . The PRICE $$$$$  I could think of a million other places for 50$ for 2 people. Staff was friendly. But price  oh I said that , my bad . I'll post a picture of my itemized bill. The OJ was 2swallows and 4$ .", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nLkFXnHNyBa8dxqlP_eFdQ/168s.jpg", "caption": "House of pain $"}]}}, {"review": {"des": "Been here twice. Great place. Clean, good food, friendly staff. They put vanilla in the waffles. Soooo good.", "pics": null}}, {"review": {"des": "Very cute corner place. The food was great, fresh ingredients and friendly staff. The best steak and eggs anywhere. We live in the burbs and we drive all the way here on the weekends to enjoy breakfast with my family.", "pics": null}}, {"review": {"des": "Quaint breakfast/lunch spot! I had scrambled eggs with cheddar cheese, bacon, and potatoes. The potatoes were fabulous, well seasoned and not too soft or crispy. The eggs and bacon were good too, but they weren't anything that stood out from any other breakfast place. Service was friendly. I'd come again.", "pics": null}}, {"review": {"des": "I have a fever, and the only prescription is more Breakfast House. Some days when my bank account is low, and there are alarms and flashing red lights telling me to save my money, I pause and think about it and then say \"Naw\" as I proceed to order my fluffilicious short stack with Amy's chicken sausage. Mother of God that is always the right decision. The orange juice is absurdly good. Eggs are on point, and sliced tomato as a side for breakfast is a game changer - pro tip, also pick up an avocado on the side and make yourself a sammich with yo toast.", "pics": null}}, {"review": {"des": "Super good, I ordered the crepes and they were probably one of the best I've ever had, the inside and outdoor area was also really nice.", "pics": null}}, {"review": {"des": "Decided to have breakfast here with an old friend. The restaurant is small but they also have outside seating too. I decided to sit outside. It was about 10-15 minute wait.. which wasn't that bad for a Saturday morning. I ordered the three egg omelette with mushrooms, bacon and mozzarella cheese with breakfast potatoes and an English muffin. It was good the eggs were fluffy and had a nice texture to it. The breakfast potatoes were aight nothing to brag about. The meal itself was fine ordinary nothing to special about it.The prices were reasonable and the wait staff were attentive. Not sure if I will go here again but if I do I might need to try one of their specialty items not a measly old omelette", "pics": null}}, {"review": {"des": "YES, YES, YES!  All the Yes's in the world!!  What do I have to do to bring this restaurant back to Richmond?!  The breakfast house is A-MAZING.  Richmond certainly knows how to do breakfast and brunch but I will be dreaming of Breakfast House until the moment I can fly back to Chicago.<br><br>We walked into this cute little restaurant and was seated immediately.  The restaurant is super cute with nice large windows that allows a lot of natural light to shine in.  I ordered the coffee and the supreme chorizo hash or should I rename it to heaven on a plate?  The chorizo was tasty and had the perfect bit to it, my eggs over-easy which is an easy thing to mess up but the Breakfast House nailed it!  My date ordered the chicken and waffles and it was crispy perfection - he was speechless the entire time and if you know him an impossible task to achieve.<br><br>The staff were great - quick, friendly, and super efficient.  We'll definitely be back again!", "pics": null}}, {"review": {"des": "I was so excited to discover this place about a year ago, through a tip from a friend, though in a way, it was more a re-discovery. <br>When I first entered, I had an immediate case of deja vu', then I was told it was the location of the original Wishbone restaurant, which I used to frequent way back in the day before they branched out. Then, as if that weren't enough, the manager looked way too familiar. Upon inquiring, he solved the mystery; he and the chef had both worked at Ina's for years before she closed, and the chef was finally able to step out on his own with this gem. <br>I thought I had lost one of my favorite dishes, scrapple, when she closed, and although I purchased her cookbook, I never got around to attempting her recipe. No need! There's my favorite, reimagined and renamed, simply Corn Cakes! So good! And they never take issue with me swapping out the pork sausage for three gloriously browned chicken sausages. The sauce and potatoes complete the experience.<br>My friend usually orders their homemade soup; so far the chicken noodle, lentil, and cream of mushroom stand out as favorites, and I'll usually grab two cups to take out for lunch, but the others are also hearty, well made, and satisfying, especially for winter days.<br>The atmosphere is bright and cheerful, and because the space is divided into rooms, simultaneously cozy and spacious. <br>And the cofffee is good, too. You really should try it.", "pics": null}}, {"review": {"des": "Love the atmosphere, very cozy and relaxed.  Employees are very nice and attentive. Delicious food! Crepes were AMAZING!", "pics": null}}, {"review": {"des": "This place is so cute, affordable, and delicious! It's also great for a quick bite or coffee to go! They're super fast.", "pics": null}}, {"review": {"des": "Horrible breakfast - I ordered two eggs over easy - one cane smashed and they were dry - my friend ordered a Parisian omelet that can dry and the eggs were over cooked - <br>We were in a hurry - so we did not request that they redo it - we received our check and were still charged full price <br>Horrible service and uncaring attitude - the restaurant was not even half full - no excuse", "pics": null}}]}