{"name": "brightwok-kitchen-chicago", "reviews": [{"review": {"des": "This establishment is heavily soy-based and unfortunately I'm allergic to soy haha. Nonetheless, I went in, got a bowl with brown rice and all the vegetables. I didn't get a sauce, as the only soy-free option was coconut based and I'm also allergic to coconut (go figure). <br>Regardless, it was a very fresh tasting bowl. Added some sriracha and called it a day. <br>Probably won't return as my options are really limited. Would recommend if you can tolerate soy though. <br>Staff is really friendly and service is quick.", "pics": null}}, {"review": {"des": "Brightwok Kitchen checked a lot of boxes for me. It's near school, affordable, healthy, and, for my dining buddy, gluten free. They were handing out samples of a couple dishes at the entryway, and though we already knew we were eating there it sealed the deal. <br><br>The dishes were yummy and healthy! Lots of veggies without feeling like it was bogged down with an excess of health food lol. If you're downtown near the Art Institute, it's a nice Asian-Inspired lunch.", "pics": null}}, {"review": {"des": "I had an A La Card coupon for Brightwork, so I walked over during my lunch break today to try it. <br><br>The staff were friendly and the service was fairly quick. Upon the recommendation from a staff member, I tried the \"Fall in Love\" bowl. It's packed with rice, chicken and veggies (bell peppers, squash, zucchini) and comes with a \"sweet potato fritter.\" Delicious stir fry! It had a lot of flavor and a hint of heat (they have hot sauce if you want to up the heat)! I also added the cashew cake for a little dessert, which was pretty good. <br><br>With the coupon, my lunch was around 8 bucks (would have been about 14 without the coupon). Not the cheapest lunch in the Loop, but I would come back again!", "pics": null}}, {"review": {"des": "When I first walked in, my impressions were this place is so spacious and clean. We came on a weekend and it was mostly empty so really easy to get seating. Place is also quite large so plenty of seating. <br><br>I'm guessing this place is really popular for weekday meals since it has many healthy options and easy to grab and go. <br><br>I ordered the sweet umami mushroom bowl. teriyaki, rice noodle, steak, mushrooms, squash, carrots, onion, peppers, zucchini. Lots of ingredients all stir-fried together, made fresh.<br><br>Concept of this place is pretty simple, but it turned out really good!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fWthVSVrZ0ax-z1-XeugYA/348s.jpg", "caption": "Sweet Umami Mushroom"}]}}, {"review": {"des": "Let me start this by saying, I want one of these to come to Michigan! We were in town for a family wedding and my cousin recommended we try Brightwok since it was close to the hotel and one of his favorites. I can 100% agree with him, this place is unlike any other I've been to and is absolutely delicious.  All of the fresh ingredients mixed with the amazing flavorful sauces was amazing. In my opinion, if you happen to find yourself near one of these restaurants you should definitely try it!", "pics": null}}, {"review": {"des": "Didn't really have high expectations for this spot. Relatively healthy lunch place offering up quirky creations at a reasonable price point. Saturday late afternoon and no one in line.<br><br>Quickly decided on the \"Earth, Curry and Fire\" with chicken instead of tofu ($13ish), as well as the Iced Masala Chai ($4). Bowl is made in front of you as all the ingredients are mixed together and topped with a freshly made fried egg. Amazing taste from the coconut curry, the perfect amount of heat that went well with the chicken and veggies. Rice at the bottom wasn't overbearing as the egg softened everything up. Masala chai is a little heavy on the clove, yet a good combo for the meal.<br><br>Service here is patient and there's a lot to add from the condiment station to the left. Definitely a spot I wish I had the option to go to near my office.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4efTXsHwI7yw5brdlYrA8g/348s.jpg", "caption": "Earth curry and fire plus iced masala chai"}]}}, {"review": {"des": "T H E    S T O R Y<br>I eat here often for lunch and I am usually able to save at least half my meal for dinner. <br><br>T H E    G O O D<br>- Everything I have tried here is good. <br>- Lots of flavor, (hopefully) healthy. <br>- Enough food for two meals.<br><br>Below is my go-to order.<br><br>Veggie Brown Rice Bowl<br>Thai Basil spice <br>Add a fried egg<br>Make it spicy! <br><br>Veggies I choose include:<br>Onions<br>Peppers x2<br>Broccoli <br>Kale<br>Edamame<br><br>T H E    B A D<br>- Expensive.<br>- Orders can be somewhat inconsistent.<br>- Not as good for delivery. <br><br>T H E    S T A R S<br>I ultimately gave 4 stars because:<br>- I eat here often and sometimes it's not as good as other times.<br>- I have received a few delivery orders that were missing the flavor/spice. <br>- It would be nice if they would provide nutrition information.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iHvM_XTSPYzLq70Tx-Xpxw/168s.jpg", "caption": "Veggie Bowl, brown rice, thai basil spice, fried egg. Veggies include: onions, peppers, broccoli, edamame, kale."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bUygJ1f8JQbN3B7mtk79jQ/168s.jpg", "caption": "Veggie Bowl, brown rice, thai basil spice, with a fried egg.   Veggies include: double onions, double peppers, broccoli, edamame, kale."}]}}, {"review": {"des": "Walking by, looked good.  Walked in, was good.<br><br>Went with a summer special--Hot In Here Jalapeno, then watched the magic of the wok.   Every ingredient was fresh and lively.  Superb!", "pics": null}}, {"review": {"des": "4.5/5 <br><br>My team at work ordered from Brightwok Kitchen for dinner. <br><br>I ordered the Sweet Umami Mushroom and it was delicious. Don't let the name deceive you - it was not sweet at all, it was savory. It was a noodle dish with steak pieces and vegetables. The meat was very succulent and the mushrooms paired well with it.<br><br>If you work in the loop or not, I definitely suggest you visit this place for lunch. <br><br>One of my coworkers ordered the Jalapeño Love because of the jalapeños and said he hated the other ingredients inside the bowl: onions, pineapple and kale, but said the Jalapeño Love was absolutely amazing, not once but multiple times and wants to go again.<br><br>This place will definitely become a lunchtime regular for me.", "pics": null}}, {"review": {"des": "After a lot of recommendations, I had to try it out. I am glad to pass on the recommendation now.<br><br>Tried the Jalepeno Love bowl which comes with pineapples, brown rice, chicken and not so spicy jalepeno sauce. The Japanese yuzu lemonade is in for the season and goes well with the bowl.<br><br>The folks at this place are really nice and friendly. Infact the guy who took my order was so nice that I started to doubt if he was on something. You dont find such happy staff nowadays, do you!<br><br>Dont forget to fancy up your bowl. There are 3 options, but the one I missed on was the fried poached egg. Until next time..", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HsNfkT0Z3XPPJ0s_JlXyGQ/168s.jpg", "caption": "Chopsticks art"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bLOfawAzqbZTFCc5Z5rhEA/168s.jpg", "caption": "Jalapeno Love"}]}}, {"review": {"des": "Brightwok, I'm still in love with you. The Earth, Curry & Fire was delish, as was my dining companion's build-your-own. Local ingredients, fresh flavors, reasonable prices. I'll continue to visit whenever I'm in Chicago but I do wish you were closer. If cheese curds are the currency you traffic in and that would get you to come to Wisconsin, I'm ready to negotiate!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QBTaRtyKN57_E-OCxDviaQ/348s.jpg", "caption": "Noodles with tofu, broccoli, carrots, peppers, kale and ginger tahini sauce."}]}}, {"review": {"des": "Perfect lunch option that's quick, healthy, and flavorful! Definitely gets crowded during peak hours but the line moves very fast. <br><br>Step 1: Choose your sauce. <br>- Thai Basil<br>- Creamy Cashew (so good!!)<br>- Chili Coconut Curry<br>- Adams St. Teriyaki<br>- Light Lemon Glaze<br>- Tahini Ginger<br>- Golden Miso<br><br>Step 2: Choose a base. <br>- Brown Rice<br>- White Rice<br>- Rice Noodles<br>- Mixed Greens<br><br>Step 3: Choose a protein. <br>- Chicken <br>- Steak<br>- Tofu<br>- Extra veggies<br><br>Step 4: Choose four veggies. <br>- Onions<br>- Carrots<br>- Broccoli<br>- Peppers<br>- Kale<br>- Cabbage<br>- Bean sprouts<br>- Edamame <br>- Butternut squash<br><br>You can also add on extra items like a fried egg or local mushrooms for $1.50. We loved our bowls and the food came out so fast. I really wish we had a Brightwok in Boston! I'd be going there everyday.", "pics": null}}, {"review": {"des": "Brightwork was average stir fry. I got the Healty Everydsy bowl. The brown rice was sticky and way over cooked and makes up most of the bowl.  The chicken was tender but there wasn't a lot of it. It also had some sliced carrots, onions, thai basil (which I didnt see) and small bits of broccoli. Nothing special or imaginative there, nor alot of veggies outside of carrot. Taste was just ok and not a big portion for $12. Probably won't return.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bBOjW1g2VzLEa8OOfCmBqw/168s.jpg", "caption": "Everyday Heslthy Bowl, brown rice, carrots, onions, broccoli and thai basil with chicken. Nothing special about it it."}]}}, {"review": {"des": "(Wo)man cannot live by salad alone, so I decided to come here last week for a late lunch. I was the only one in line, although there were a handful of patrons seated in the restaurant. I had wanted to try this place as I had walked by here on a few occasions and am glad that I finally stopped in. The interior was inviting and clean (love that chopstick wall art!) and the service across the board was efficient and friendly.<br><br>I quickly scanned the wall menu which features a few seasonal specials  in addition to the \"our favorites\" rotation and build-your-own options. I decided on the Kick'n Panang with brown rice, tofu, curry, and fresh carrots, yellow squash, and zucchini. The tofu provided a hit of protein and the sauce had a definite kick which I appreciated. The bowl itself was a little pricey ($10 including tax) but I felt the pricing was fair as the ingredients that went into it were fresh and it wasn't 80-90 percent rice as can so often be the case at these types of places. I look forward to returning to trying the sides and seasonal offerings.", "pics": null}}, {"review": {"des": "Fresh, on time. It's build your own stir fry chipotle style they have everyone for everything and gluten free options", "pics": null}}, {"review": {"des": "I enjoyed what I ordered but I don't think this will make it into my regular lunch rotation.  First, it did take a significant amount of time compared to most of the lunch places around because they cook to order. So if you're on more of a restricted lunch hour, then I would probably call in your order and just pick it up.  Second, my bowl that I made myself was good but it wasn't really worth the price for me.  And I only say that because this is something I can very easily do or make at home and so the end product wasn't something that necessarily blew my mind in any way.   I will say that the egg was perfectly cooked, however.  Also, I loved how everything tasted fresh.  The veggies here all looked great.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uLy7-oQhXTr_gxOeLbQOSg/168s.jpg", "caption": "Made my own bowl: Brown rice, chicken,  jalapeno curry sauce with kale, zucchini, carrots and broccoli. Egg was beautiful"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0tuVj7z2VvZrErOGFh0H_w/168s.jpg", "caption": "Wok time!"}]}}, {"review": {"des": "I was in Chicago for work and was excited to see that there was 100% gluten free and 99% dairy free food establishment less than a mile from my hotel.  My BF dropped me off to run in and order the food since there was no parking close. The concept of the restaurant is to build an Asian style bowl with a base of either white rice, brown rice, rice noodles or salad. Pick a protein; chicken, beef or pork. Topped off with (4) veggies of your choice and then a sauce. I really enjoyed this concept, after building our bowls they sauté everything in a wok and you are ready to go. You can also specify if you want yours medium or spicy.<br><br>I ended up getting half chicken and half tofu with the teriyaki sauce extra spicy. I got my BF the chicken with thai basil sauce and just kept it mild like it typically comes. On top you have the option to add extras. I got my BF a fried egg which they cooked exactly like he wanted! We thoroughly enjoyed our bowls and the side of pickles you can get are mighty tasty. I can't wait to come back here when I am in Chicago again. We both have celiac disease so having a restaurant like this that is naturally gluten free is always nice. I promise this is a great place and definitely worth giving a try. Only real bummer is they are only open till 8:00pm! We would have came more if they would have been open later.", "pics": null}}, {"review": {"des": "I honestly don't have anything negative to say about this place. You get the choices of proteins and base and 4 veggies, and have the chance to add more stuff on. Then they cook it infront of you on a wok, which makes it even cooler. I tried the coconut curry sauce and it was really good - not spicy, but good. I did add sriracha to it for extra spice. I had the noodle steak bowl with edemame, peppers, kale, and sprouts. The steak was great the sauce was good and service was quick and helpful. Got an egg on top- awesome option worth the extra money! This is probably one of my favorite spots near the DePaul area simply because its fast, healthy, and cooked oh so deliciously. Definitely have been meaning to try other sauces - they all look awesome.. but the coconut curry one is so good haha", "pics": null}}, {"review": {"des": "Definitely a popular spot during the weekday lunch rush. But fear not if there's a line - it moves fairly quickly. This is a casual Asian fare restaurant so just order up at the counter, pay, get a number, and wait for your meal to be stir-fryed up! <br><br>For my bowl, I decided on the \"Eat Right\" with a brown rice base. And when asked if I wanted to add mushrooms and an egg, I just couldn't resist. The result? So good! And filling! But the extras were a little pricey (my bowl ended up being ~$14). Other than that, their whole deal is high quality and health conscious food so it leaves you feeling pretty guilt-free.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YGukelY8SZyNrd2g1v0d6w/348s.jpg", "caption": "Eat Right with an egg on top (is there any other way?)"}]}}, {"review": {"des": "I wanted to grab a quick, late lunch/early dinner before my flight. Brightwok Kitchen fit the bill.<br><br>I didn't feel like customizing my own bowl so I ordered the Crunchy Crave and a hot green tea.<br>I had gotten food poisoning the day before (not from Brightwok) so it was comforting seeing everyone at Brightwok using gloves and proper food safety. I also like that each order is made in a separate wok and new spatula to prevent cross contamination.<br><br>Maybe it was still my stomach bug speaking, but I didn't find my bowl to be ultra amazing, but it was a good portion size for the price.<br>I did like the hot green tea though. It was a tea bag with \"fresh\" leaves, not the processed Lipton stuff. The tea was piping hot and strong. It hit the spot.<br><br>I wouldn't necessarily seek this place out, but Brightwok is a good stop for a quick and relatively healthy lunch.", "pics": null}}, {"review": {"des": "My favorite place for lunch! I have lost track of how many times I have eaten here because each meal never disappoints. With all the options, you can create a different bowl each time and always have something new to try. I have tried so many sauces and variations and have always left satisfied! So good and such a healthy option in the loop. I LOVE the cashew sauce. 10/10<br>Staff is ALWAYS friendly.<br>Fast too <br> this place is a favorite - if I didn't make that clear", "pics": null}}, {"review": {"des": "Very consistent, tasty, and (maybe) healthy fast casual food. Great for a quick work lunch or dinner on the go, and portions are decent and pretty filling.<br><br>They do a Chipotle / Subway assembly line style which seems to be really popular now. Brightwok has asian inspired stir fry bowls, with different sauces and grain/noodle base. They have a selection of proteins, including fried tofu which is a pleasant surprise - the texture and taste is a lot different than regular tofu. You get a selection of veggies and then they fry it up on a wok in front of you. They also have \"local mushrooms\" which are just button mushrooms (when I first ordered I thought it would be a more exciting mix of other types) and a fried egg (which is actually fried all the way, no runny yolk) as options that cost extra.<br><br>The bowls themselves are super affordable. I love the tofu on brown rice with the cashew sauce. However my only gripe is anything you want to add extra, like extra veggies or sauce, is $1.50+ which is pretty pricey. <br><br>Gets pretty busy around typical lunch and dinner times, especially on weekdays.", "pics": null}}, {"review": {"des": "Truly a great and simple dining experience. With two celiacs in the family, it was great for the accommodations and not worrying about the ingredients.", "pics": null}}, {"review": {"des": "I'd give it 3.5 stars.  We tried this make your own bowl, Asian stir fry restaurant last night for dinner.  First you choose up to two sauces (I chose thai basil and green jalapeño curry), your carb (brown rice, white rice, or noodles) then your protein (chicken, tofu or steak), and finally up to four vegetables.  They stir fry your bowl and call your number up when it's ready.  Pretty good, and well priced at $10.<br><br>My bowl was a little too heavy on sauce (which makes it too salty/strong when you get half way thru the bowl), otherwise I'd have given it 4 stars.  <br><br>The restaurant is clean and bright.  The staff is friendly.  A good place for lunch or a simple no-frills, healthy dinner.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KeO0FuvO6tNF6th4eIg88Q/168s.jpg", "caption": "Brown rice, tofu, kale, broccoli, green pepper, and bean sprouts with thai basil and green jalapeño curry sauces."}]}}, {"review": {"des": "Best place! Amazing food, friendly staff. Best food experience we've had in Chicago yet. Fresh and fast with plenty of delicious options.", "pics": null}}, {"review": {"des": "Brightwok is another nice healthy option if working in the loop.  There is a lot of these options to choose from.  I personally like Honeygrow/minigrow but I was not upset with my experience at Brightwok.  The ingredients seemed to be fresh and local and the staff was super nice and friendly.", "pics": null}}, {"review": {"des": "Brightwok is one of my favorite lunch choices for something healthy and flavorful.<br><br>Brightwok makes their food Chipotle-style and by that I mean you go down the line and pick out your ingredients and they cook it up for you. Everything is made with quality ingredients and the sauces are really tasty. I typically go with the BYOB (build your own bowl) veggie option with 6 veggies, rice noodles and change up the sauce. <br><br>Brightwok can get really busy at lunchtime, but the line moves quickly. If you're looking for something fast and fresh for lunch, I think it's a solid option. 4.5 stars", "pics": null}}, {"review": {"des": "I get really excited by places that let you \"customize\" or \"DIY\" your meal, so when I was looking for a quickish lunch spot, this place caught my attention. Upon entering I was a little surprised/ the restaurant is much more spacious than the pictures make it seem. There are about 15-20 tables inside. It was also obviously popular, very loud inside and with a long line to get to the counter to place your order. The concept is simple, familiar. You pick your sauce, your base (noodles/rice/greens), your protein, and your veggies. They mix it all up for you in a bowl and you're good to go. <br><br>I got the limited time jalapeño green curry with noddles. My sister got the cashew cream with noddles. The bowls came out fairly quickly and we're piping hot. Nom. <br><br>Pros: hot food, multiple mix and match options, fairly \"healthy\", decent portions, well seasoned/cooked chicken<br><br>Cons: loud, wait time, tables not cleaned in between patrons, brusque staff, and sadly not too flavorful food :(<br><br>The cashew cream tasted kind of like burnt pad Thai and the jalapeno green curry was more watery than expected; perhaps would have been better with simply more quantity of sauce added to my bowl. I did get it with chicken which I thought was really well cooked, and they put a decent amount of veggies in the bowl which I liked. <br><br>I could be convinced to come back and try a different sauce combo if someone I knew really wanted to eat here, but I don't see myself going out of my way to come here otherwise.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5u_mE7ho8-3vOJDAYtiuAQ/348s.jpg", "caption": "Jalapeño green curry with rice noodles and chicken"}]}}, {"review": {"des": "Before Brightwok, stir fry bars were only in food courts or sit-down restaurants like Flat Top. They were extremely slow and the food not all that flavorful. Jeremy has changed that completely. It is hard to leave a 5-10 minute walking radius of my office but I do it for Brightwok.<br><br>Brightwok works the same way all the successful fast-casual spots downtown do: build your own bowl with a base, sauce and protein (+ four veggies). The secret sauce here is ... the sauce. They really elevate the food from what you typically get when you think stir fry. I'm partial to thai basil but they have curries, teriyaki and more. Then there's the option of adding a crispy fried egg, which is the punctuation on the whole experience. Not enough places offer me a friend egg on my lunch.<br><br>The portions are substantial and the price is very fair at $10-13 depending on add-ons. I've paid much more for much less food in the Loop, plus I always leave Brightwok feeling good about what I've put in my body. <br><br>I love that this place is open every day, as I did end up here for a quick lunch on a weekend afternoon. My one gripe is that they had no idea how wild of a success they'd be, and the line ends up out the door by 12:30 on a weekday and the space gets cluttered. If you dine in, people will be standing next to your table waiting in line. That said, once you get up there they move fast, and BONUS: I've been with large office groups of 8-12 people before and we've called ahead and they've reserved tables for us. The customer service is on point. Congrats Jeremy and team!", "pics": null}}, {"review": {"des": "This place is AMAZING!!! Perfect for someone with Celiacs. Great customer service and tasty, filling, clean eating!", "pics": null}}, {"review": {"des": "Heard a lot about this place and finally had the opportunity to go. It was noon on a Friday and there was indeed a healthy line upon arrival, but it moved very quickly. I'm going to start with their service. This has got to be one of the most efficiently run establishments I've ever seen. Yes, it is another 'Chipotle' type of assembly line, but the entire staff was super on point. Right after ordering, it was promptly picked up and being made. Then at this point, I was paying. I waited maybe two-three minutes and it was ready. I noticed about ten woks going on and four hardworking guys going at them. I even saw another staff member filling up their waters for them so they could somewhat have some comfort while cooking. Other members readily refilled the water station and cleared tables. They have a nice system going and seem to be a genuine team.<br><br>Now on to the food! I got a mixed greens/brown rice bowl with their limited time jalapeno green curry sauce to be made extra spicy, chicken, bean sprouts, kale, and onions. This was very tasty and all worked together. Not only that, but it was very fresh. The spice level was satisfactory for a spice lover (though I could have handled more). To note, I wasn't initially drawn to the more Southeastern Asian flavors that Brightwok seemed to draw on, but I thoroughly enjoyed it. Pricing is appropriate. Space is fresh and vibrant. Definitely will come back here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lhjwTDOBwUkTxT_aVx121g/168s.jpg", "caption": "Jalapeno green curry (limited time), mixed greens and brown rice, chicken, edamame, onions, kale, bean sprouts, extra spicy"}]}}, {"review": {"des": "Very unique Asian fusion restaurant.  Order the Earth, Curry and Fire with a friend egg.  Had the lemonade, which was sugarless (an added bonus)", "pics": null}}, {"review": {"des": "In Chicago for a brief visit. Looking for a quick place to eat. Deal with food allergies. This place was great. They were aware of the food ingredients. You get in line and tell them what you want in the bowl. Food was fresh and delicious. Price reasonable.", "pics": null}}, {"review": {"des": "Popped in while touring the Millenium Park area. I love the concept of choosing your own ingredients for a stir fry over your choice of rice / noodles. The selection of sauces was really great. Gone are the greasy sauces of your typical Asian fast-food joint that left you feeling bloated! <br><br>I also really enjoyed their iced tea. It had simple flavours that just work well together.<br><br>On a side note, the food here is basically how I eat at home--stir fry an assortment of vegetables, serve it over a carb, then add some sriracha for seasoning (although they do have more sauces). I imagine that's the case for a lot of college students. It feels a little silly to me to be paying extra to eat home cooking, but then again it's nice to have a healthier option when you're out exploring Chicago.", "pics": null}}, {"review": {"des": "Just tried Brightwok yesterday for a lunch meeting and enjoyed it as a healthy, alternative to most of the Asian or stir fry venues in the Loop. The space is open and bright, and it fills up quickly around noon. <br><br>The process is pretty straight forward - you \"build your own bowl\" through a mix of veggies, sauce, carbs base, and protein. I tried the chili coconut curry (hot), rice noodles, chicken, and 4 veggies: onions, peppers, sprouts, and zucchini/squash. I enjoyed the taste and felt healthy (not comatose) after finishing my lunch. With a water cup, it was a good, guilt-free lunch choice. <br><br>Looking forward to stopping by again when in the mood for a casual stir-fry spot.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/us2_LjrqXQjSMbA_Ky58HA/348s.jpg", "caption": "Coconut Chilli Curry, Chicken, Rice Noodles"}]}}, {"review": {"des": "This place is awesome! Love the concept of fast casual Asian stir fry. It reminds me of the quick version of a bd Mongolian Grill. <br><br>The space is very bright and clean. There's also a good amount of seating. I walked to the back to get in line and then realized I had no clue what to get. The people that work here are nice and walked me through how to create my own bowl. <br><br>All of the sauces sounded amazing, and I went with the limited time jalapeño green curry! You can choose rice, rice noodles, or salad as the base, protein, and then a choice of 4 veggie items. I went with rice noodles, chicken, and broccoli, peppers, carrots, and edamame. The price was a little over $11 which I thought was kinda pricey but the portion size was enough for me to take home leftovers! <br><br>I'll definitely come back to check out those other sauces in my upcoming bowls!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ojXl2L4IBL-8LuQaUQXLlQ/348s.jpg", "caption": "Rice noodle bowl with the jalapeño green curry sauce"}]}}, {"review": {"des": "This place is perfect for what it is - a quick spot to serve fast, cheap, tasty food. <br><br>We ordered for 8 people and had our food ready within 10 min. It was scary quick, and they had everything exactly as we asked, which isn't easy with a large party. Everything is customizable, so you can be as picky as you want. The food is very friendly to vegetarians as well. I would recommend adding a fried egg on top of your bowl. <br><br>We had all the sides (banana chips are addicting) and tried their tea as well. The tumeric ginger is really strong and delicious. <br><br>The restaurant was packed and had a lot of people dining in as well as grab-n-go. Regardless, they're very efficient so lines move very quickly. <br><br>Everyone loved their bowls and agreed that this is one of our favorite lunch spots in the area. I would definitely come back soon.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/clwNQ_7I0SozY-iEKxC3fQ/348s.jpg", "caption": "Customized bowl with fried egg"}]}}, {"review": {"des": "A surprising little shop, to say the least! Unlike most boxed-asian places, Brightwok Kitchen actually lets you choose everything -- then stir fries it!  It's great if you're looking for something quick, healthy, and vaguely reminiscent of Thai cuisine.  <br><br>Choose between protein, starch (+1 for rice noodles, yay), veggies, and the all important SAUCE.  Be sure to specify what level of heat you want -- their spicy isn't actually all that crazy, but experiment first and you should be good.  They had a great assortment of vegetables, although I wish some of them were soaked a bit first (like the carrots), as they tended to come out significantly harder than everything else when the bowl was finally assembled.  Additionally, and I'm not sure if this was an issue with the wok's heat, or just how long they have it in there, but the protein (I got beef) came out a little bit drier than I expected (hence why I say, \"vaguely reminiscent\" of Thai). It wasn't overly problematic, just not the traditional velvety texture that I'm used to when it comes to wok stir fries.  Still, overall it was a pretty filing bowl, and at prices that won't hurt your wallet, especially considering how many veggies they toss your bowl with.  Cheap + healthy never hurts!  Definitely recommend for a quick bite.<br><br>---<br><br>sweet: quick, inexpensive, and the stir-fry at the end is a nice touch.  <br>bitter: consistency of veggies, meat could use balancing", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jDHw8twW9TsNNufcPsCL2A/348s.jpg", "caption": "The crunchy crave ($12), sub brown rice for rice noodles.  Tastes Great, like a healthier pad thai."}]}}, {"review": {"des": "Yummy place in the loop area with food made fresh right before your eyes. Had lots of veggies in my stir fry with the Thai basil sauce made spicy. I also got the local mushrooms for the up charge, but honestly they were not anything to write home about. My bowl was otherwise really good and enjoyable. The employees are very nice and helpful and the restaurant is huge with ample seating.", "pics": null}}, {"review": {"des": "I stumbled on this place because they have vegan options and I was dining with out-of-town vegans. It was a pleasant surprise. Generous portions, high-quality food, reasonable prices, and friendly service.", "pics": null}}, {"review": {"des": "I had a great dinner here while visiting Chicago! I really like the concept and the fact that all ingredients were freshly tossed in the wok before being served. <br><br>I enjoyed a bowl with rice noodles, chicken, peppers, broccoli, and edamame. As others have recommended, the crispy fried egg is key! I don't even like eggs that much, but I thought it really added to the dish.<br><br>There are a few reviews that mention that the sauces are bland. I ordered the green curry jalapeno, which was listed as \"limited time only\". It definitely was not bland! Perfect amount of spice for those who like spice. Hopefully they keep it around!<br><br>My only criticism would be that some of the vegetable pieces were kind of large and hard to eat. At the same time, this made them much easier to pick up with my chopsticks than the edamame, so there are pros and cons :)", "pics": null}}, {"review": {"des": "I only wish we had a Brightwork in Los Angeles!<br><br>I was visiting Chicago for the marathon with my boyfriend and we had just spent a good two hours of our morning navigating the tourist trap that is Willis Tower and we were desperate for a good lunch. I found Brightwok on Yelp and it seemed like a solid choice.<br><br>The restaurant is set-up \"Chipotle-style\" where you order a base bowl and then you can customize ingredients, sauces, etc. I was starving so I went with one of their signature bowls, the Everyday Eat Right bowl (thai basil sauce, brown rice, local chicken, onions, broccoli, bell peppers, carrots), and boyfriend built a custom noodle bowl. I also ordered their ginger beer which is bottled exclusively for them by Bridgeport Chicago. <br><br>The bowls were great! Really flavorful, filling, but don't leave you feeling heavy or sluggish which is perfect for a long day of exploring the city. The ginger beer was way too sweet for my taste with not enough ginger. For dining casual, this place is definitely a win!", "pics": null}}, {"review": {"des": "If you're looking for a good meal that tastes fresh, comforting, quick, and highlights seasonal ingredients look no further. This place offers tons  of options to create your own dish or pick from their seasonal suggestions. Everything is made to order but since it's mostly stir fried it doesn't take terribly long for your order to be ready. <br><br>It's very vegetarian, vegan, and gluten free friendly. A great option if you're dining with a group of people and need to mediate various dietary preferences.", "pics": null}}, {"review": {"des": "If you enjoy concocting your own stir-fry creation then this place is for you!  You start by picking your carb (or salad), sauce and protein, followed by your choice of up to 4 veggies, and you can top it off with some of their premium toppings such as fried egg, pineapple, or local mushrooms.  For my visit, I went with the rice noodles in seasonal Fall 5-spice sauce which was a warm, sweet, and spicy mix with tons of flavor, and chicken with broccoli, carrot, peppers, and onions.  They cook it pretty quickly and you can grab utensils and a cup of water while you're waiting.  Overall it was a decent meal at a decent price and pretty filling!", "pics": null}}, {"review": {"des": "I went to an event where they were serving the tofu salad from here and I went to this location the very next day to get it. :)<br><br>Don't be intimidated by all the options. It's really simple to order. Glad I added the fried egg cause that really made the salad. If you like the pic I posted here's what to order: Tofu Salad with mixed greens, carrots, broccoli, bean sprouts, onions, top with tahini ginger dressing. For a $1.50 more add the fried egg.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mGjX4erDL0s7dVYDVtURMQ/348s.jpg", "caption": "Tofu Salad"}]}}, {"review": {"des": "Stopped in today for the first time and was pretty impressed. The place was packed at 12pm and for good reason- the food was great. I ordered the \"Every Day Eat Right\" which is essentially Thai basil chicken. I loved that I could get it with light oil.  If nothing looks good on their menu, you can fully customize your stir fry bowl which I think is great.  If you do get a bowl with a rice filling, keep in mind they give you a LOT of rice. The employee easily gave me over a cup and a half of brown rice, so I asked her to take some out.  Only one complaint: I ordered it to go, they gave me a bag... but they didn't provide me with any chop sticks or silverware.  Bit of a pain but not the end of the world.  At just over $10/bowl, it's not a cheap lunch, but it was tasty and filling- I will be back.", "pics": null}}, {"review": {"des": "Really awesome food! Everything was so flavorful, and a variety of options to choose from. The portion sizes are just right too. I'd highly recommend the masala chai!", "pics": null}}, {"review": {"des": "I ordered Kick'n Panang. SO. DARN. GOOD.<br><br>A bit pricey, but you're paying for fresh, healthy ingredients, so it makes sense. Plus it's a healthy portion that will keep you full.", "pics": null}}, {"review": {"des": "I'm in love with Brightwok Kitchen.  They are my favorite delivery option when I'm hungry and want something I know I'll love.  <br><br>The ability to customize the whole thing is a huge plus.  I wish there were a few more already built options, but that's just because I'm sometimes in the mood to not make any decisions.  My favorite is the thai basil sauce with chicken and a ton of veggies. Add a crispy egg of course.  The pickles are also very good.  Try the banana chips too.  Oh really, just try it all. You won't be disappointed.", "pics": null}}, {"review": {"des": "WHAT FLAVOR!!! I'm a vegetarian, dairy-free and allergic to gluten...so finding a place to eat out is tricky. I'm not a Chicago local and was visiting from out of town. I was so exceptionally pleased with the menu at Brightwok Kitchen and even more blown away by the food. A wonderful depiction of Asian cuisine with a complex flavor profile! The sweet potato fritters are an absolute must try. The magic cake was an amazingly delicious gluten free dessert as well! Next time I visit Chicago, I will definitely return! If only my home town had something similar...", "pics": null}}, {"review": {"des": "Good food, awesome concept service is good but it can definitely step it up one notch for a 5 Star experience. I walked up for a refill on a drink and an employee literally sat there having a full on conversation while I waited till I walked away when he noticed that was probably not the right thing to do.", "pics": null}}, {"review": {"des": "Looking for a quick and filling bite to eat? This may be the spot for you. I got their coconut curry sauce with noodles and veggies. The mint lemonade was delicious! I must have it again!", "pics": null}}, {"review": {"des": "I came to an after hours event here recently where they allowed us to order food ahead of time and it was really great.  I did a rice noodle bowl and picked all my ingredients and sauces ahead of time.  I was thoroughly impressed for a fast casual spot, I'll definitely be back!", "pics": null}}, {"review": {"des": "I was greeted with the best form anxiety when I stepped up to the counter to order. Step one of this Asian version of Chipotle was sauce selection, and I was faced with terrible indecision. Each of the many that they offer sounded so delicious! So in a brash decision, I went with the Teryaki. Did not disappoint, but next time I'd like to be more adventurous. <br><br>They have a wide array of veggie, grain, and meat choices to compliment their sauces, and even provide the option to add a fried egg if you're feeling crazy. A quick toss in the wok, and you're in stir-fry heaven. <br><br>Decor is also a 10. Prayers to whoever painstakingly stuck all of those chopsticks in the wall for our visual pleasure. You work has not gone unnoticed.", "pics": null}}, {"review": {"des": "This place is fantastic I would highly recommend eating here. Definitely get the fried egg on whatever you order. Pete was really funny and made the entire experience fantastic. <br>You definitely gotta eat the steak and the other yummy treats", "pics": null}}, {"review": {"des": "Since I'm going to be working downtown for a few weeks, I thought that I should take advantage of the plentiful restaurants around here for lunch time. I came across this place on Yelp as it had good reviews and I was searching for Asian food. <br><br>Upon walking in, the interior is definitely unique with a modern atmosphere to it. The lighting, decor, and even menus are very simple, yet elegant. As far as ordering, it's much like the chipotle style where you customize your order as you move down the line. You get to customize by choosing your own sauce, base, protein, four veggies, and can eve customize it with extras like an egg. They stir fry it for you and then call your number once it's done. I ordered a chicken brown rice bowl with the coconut curry sauce. It is absolutely delicious! Flavors are so rich and the amount you get for ~$10 is worth it. <br><br>In addition to their food, the employees were also very friendly and helpful, especially since it was my first time. They appear to be delighted to help you and get your food done rather quickly. Definitely will be coming back!", "pics": null}}, {"review": {"des": "Great place for affordable healthy Asian food near millennium park. Tasted great, food was made quickly and staff was friendly and welcoming! Definitely recommend!", "pics": null}}, {"review": {"des": "I stopped in here last evening after work with a former co-worker of mine. I had noticed this place before when walking in the area. The place is very bright inside and it is set-up to order down a line. You can either make your own or you can order off the menu, which is what I did. I ordered the Earthy, Curry and Fire minus the onions and egg and substituted broccoli for the onions. I also got the turmeric ginger tea. I thought that the dish was spiced well and the portion was a good dinner size. The staff were very nice and refilled my tea glass with hot water when I needed it. While there weren't too many people in there when we first came in, there was people coming and going. The only suggestion I have would be to turn down the music a bit. It became a bit difficult for us to hear each other.", "pics": null}}, {"review": {"des": "Nice concept. Build your own bowl for about $10 and it's ready in about 5 minutes. Choose your own sauces as well as 4 veggies to put in it. Taste is ok, nothing extraordinary but about what you expect for stir fry.", "pics": null}}, {"review": {"des": "Came here a little after lunch time and it was still pretty busy. I found this place through Yelp while my friends and I were looking for a place to eat; it was all of our first times here. The inside is a nice size and it's definitely clean and bright. <br>I got the teriyaki sauce with brown rice, chicken, edamame, broccoli, and bean sprouts. The food was ready within 10 minutes after you pay. <br>The food was tasty, but personally, there was too much sauce in my food. Other than that, it's a lot of food and it's worth what you pay for. My friends and I couldn't even finish our bowls because we got full before we could. <br>Also, I really liked their straws. They are biodegradable, but what I liked about them was that they were surprisingly stronger than other straws.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/O_EUNiT17PoIYCeihAgz8w/168s.jpg", "caption": "The different sauces."}]}}, {"review": {"des": "Amazing lunch time option when I'm at work. Despite long lines, they are very efficient. Think stir fry version of Chipotle.", "pics": null}}, {"review": {"des": "Amazing is the only description this place needs! I was having the worst day and this place if VEGAN friendly, GLUTEN FREE friendly and does OIL FREE when stir frying!!! Omg it was amazing. All the sauces are vegan and I made my own bowl with have greens and half brown rice, all the veggies and the coconut chilly sauce on the side! I would probably pick another sauce next time like maybe the golden miso. Other than that the bowl was sooo good and filling! Totally worth the money, friendly service and delicious. Great place for those with allergies and restrictions. The girl working there was super helpful, accommodating and happy which I loved. She answered all my questions even though I had a lot. I wonder if it would be just as great during lunch hours? We went late around 3:00. Totally recommend this location, will be back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CDdDYeX8JJJwIfY-M879pg/348s.jpg", "caption": "All the veggies! Hiding underneath is the brown rice and mixed greens."}]}}, {"review": {"des": "Absolutely loved this place. Extremely gut friendly!!<br><br>You pick your ingredients and craft ur very own stir fry. High quality ingredients, worth the price. Fast service, clean facility! Can't say enough good things about this place. Stop by and give it a shot, especially if you have gluten, dairy and other intolerances.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/I4z0TnU7oR41GmDBTYWqjw/168s.jpg", "caption": "Hubby got the steak(well done), with chili coconut curry sauce as well. Generous portions! He was full and ready to bike again."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BtUKnps3J85V2n5ZONckpg/168s.jpg", "caption": "I ordered my bowl with chili coconut curry sauce. Don't be misled by the name and skip this sauce, it was not spicy at all. Loved it!"}]}}, {"review": {"des": "Literally my first meal in Chicago and I'm so stoked it was! I got the tofu curry bowl and it was so good! Also, this place is very modern and eco-friendly, which I definitely appreciate. Definitely a 10/10 and I wish I could pack up this whole place and put it in my suitcase.", "pics": null}}, {"review": {"des": "Hallelujah! With so few gluten-free options for my celiac brother, I'm frequently stuck eating at that well known German restaurant on E Adams. But with the opening of Brightwok, I can now put that creamed spinach to rest! This place is gluten-free, dairy-free, and peanut-free, but it's certainly not \"taste-free\".<br><br>Brightwok is busy at lunch, but the line moves fast. I love the \"Eat Right Bowl\". Delicious and free of decision making since it's one of two \"chef favorites\". The other options are customized by the customer. The \"Eat Right\" is everything I love. --Chicken breast, slightly charred broccoli, onions, carrots, and peppers. It's served with brown rice and a Thai Basil sauce that is neither heavy nor scarce. -It's all perfect. <br><br>Breaking my typical rule, I am compelled to eat the whole bowl. I can't help myself. And for only $9?! Thank you, thank you.", "pics": null}}, {"review": {"des": "I eat here all the time. The food is good and you can't go wrong with a crispy egg. I am disappointed they decided not to accept cash, probably will not be able to dine here anymore.", "pics": null}}, {"review": {"des": "Dropped by for lunch on Saturday. Clean, bright location with lots of space.<br><br>I ordered a white rice bowl with tofu, thai basil sauce, onions, carrots, zucchini and kale. They cook the veggies just right, tender but still flavorful. At the server's suggestion, I added caramelized pineapple -- so good!<br><br>My only complaint was the small water glass (hey, you get what you pay for). My thai basil bowl was spicy, and I had to keep walking back to the counter.<br><br>As a tourist, I needed a break from Chicago's deep-dish pizza and Italian beef. Brightwok was a great, healthy choice.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9rmh_BEz_sYpECRQo_58hQ/348s.jpg", "caption": "White rice bowl with tofu, thai basil sauce, onions, carrots, zucchini and kale. Definitely add the pineapple!"}]}}, {"review": {"des": "Decent Asian Fusion I had when I was working around here last year the last summer and fall of 2017. It kind of reminds me of an upscale Asian Chipotle only this is NOT a franchise since they are independent restaurant, I had the \"Earth, Curry and Fire\" with an extra of \"Local Mushrooms\" since I was in the mood for something Spicy that day. It was wonderfully spicy hot and delicious. I do recommend it for people who like or can either tolerate or handle spicy foods. I had a local Beet Juice Beverage and that was refreshing too. It is very local Beet Juice company from Chicago, IL. All in all, If I pass by this area I would dine here again. It can be a little pricey but it is worth the treat.", "pics": null}}, {"review": {"des": "We ended up eating here twice while visiting Chicago. Both times We built our own meal by picking rice noodles or rice. The first time I had the noodles and the second time I had the brown rice (both good). I had the peanut sauce the first time and a sauce with sesame seeds the second time. The sauces are great and add so much flavor to the meal. And you can ask for it to be more spicy if you like a little heat. I did the second time and it was the perfect amount of heat to enhance the flavor of the meal without making it only about the heat. The chef knows his spice palate. We had the tofu and I really liked it as it had good texture and flavor; something some restaurants have a hard time getting right consistently. The vegetables were fresh and flavorful and cut just right for the quick style of wok cooking they received. Since this place is fairly busy with take out orders and people coming in like us the veggies seemed like they had just been cut up, delicious and fresh. We also had the unsweetened green tea. Delightful.and dessert- don't pass up the little \"magic cake\" sweet goodness they have to offer. We will be coming back next time we are in Chicago (wishing there was one in our home town).", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mMIIedYh_bNnFHq2wvg0BA/348s.jpg", "caption": "And the rest of the menu. It was very good the three of us each enjoyed what was cooked up for us."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZHOJeLZVO8tkyaOtMGWmdg/168s.jpg", "caption": "Something for every palate."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/A_7S1SNg1kvRFUJYlzS8dg/168s.jpg", "caption": "Where to start."}]}}, {"review": {"des": "Brightwok is the perfect place to go for a healthy lunch! There are options for all diets and everything is fresh, quick and delicious. Plus, their staff is upbeat and attentive. Can't say enough great things about Brightwok!!", "pics": null}}, {"review": {"des": "We catored Brightwok Kitchen for a work luncheon, large platters of beef and chicken mixed with sauteed veggies. Great flavors and meats were well cooked. The dishes came with sides of banana chips and a combination of white / brown rice. Perfect type of meal for an office luncheon if you're thinking about catoring.<br><br>Best,<br>Charlie", "pics": null}}, {"review": {"des": "Build your own stir fry. Deliciousness.<br><br>Came in close to close, but totally forgot my wallet. Didn't matter. An employee there Victoria covered my meal. Made my day :) I owe you one<br><br>Thanks Victoria, I'll definitely come again!", "pics": null}}, {"review": {"des": "Another quick Asian version of Chipotle that is convenient for those looking for a cheap and quick option in the Loop. Great selection of sauces and veggies to make the bowl perfect to satisfy your taste buds.<br><br>First you pick your base (white or brown rice, noodles or greens) and sauce. My personal favorite is the Thai Basil but I've also tried the Chili Coconut Curry which was good as well. Next you get to choose your protein and up to 4 veggies. If building your own bowl isn't your cup of tea, they do have 2 \"Chef's Favorites\" bowls. When all said and done, you get a substantial amount of food for under $12.", "pics": null}}, {"review": {"des": "Visiting Chicago from out of state. Wanted to try someplace close to my hotel that was quick and diet friendly. This place did not disappoint. I am very satisfied. Fresh ingredients, friendly staff, clean dining area. I had a bowl with wild greens Tai basal sauce, chicken, carrots, broccoli, onions and butternut squash then added a crispy egg. It tasted great! Hot, fresh, flavorful. You feel like you are getting a good meal even though it's quick service. Very happy. Highly recommend.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CnkBiRvmfNbxG4hgTSX9Kg/348s.jpg", "caption": "Bowl with Tai basal sauce, greens, carrots, broccoli, onions and butternut squash and added a crispy egg. Plus a side of spicy hummus."}]}}, {"review": {"des": "Saw the Brightwok pop-up at Taste and knew I had to stop in for more. The staff is so welcoming and helpful, the concept is fun, the decor is clean and refreshing, and the food is delicious! <br><br>I would love to see Brightwok Kitchen in more cities someday, but, until then, I'll just have to keep coming back to Chicago (which I am happy to do in the meantime).", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xb-srIuNfxzxrlUq0dAugw/348s.jpg", "caption": "Green citrus tea and a brown rice bowl with tofu, carrots, bean sprouts, and kale smothered in tahini ginger sauce! Loved it!"}]}}, {"review": {"des": "Brightwok is one of my favorite go-to lunch spots. It's fresh, delicious, and a great healthy option. Also, the staff is always so, so nice. I'll keep coming back!", "pics": null}}, {"review": {"des": "Good formidable lunch option in the loop. You can choose a salad or a bowl with a nice selection of sauces that actually contain spice or not if you like. You then can choose your bases and they stir fry it up for you or give you a salad. The portions are generous and it's pretty simple and straight forward win great taste. Ingredients are bogged down with additives and extra additions. Great lunch spot", "pics": null}}, {"review": {"des": "I've eaten here a few times and it tastes good but I get diarrhea within a couple hours every time.  Not trying to make a joke or anything I'd like to know what specific ingredients cause this so I can avoid them, I haven't had this problem at any other restaurant.", "pics": null}}, {"review": {"des": "Looking on Yelp for something healthy but filling and saw this place. My Co worker and I ate here while visiting for a conference nearby and both of us loved it. It's a cafeteria style service model where you choose your base (rices, noodles, greens), sauce and customize with protein choice, veggies and meats. Everything was fresh, done to perfection. Ingredients (including beverages) are carefully sourced. The place was not busy when we walked in around early dinner time frame on a Tuesday evening but we were in and out promptly. I Highly recommended getting the Thai Basil sauce MAGNIFICENT !!!!!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fZKjVOQcc4z_Iy20xWdPyQ/348s.jpg", "caption": "Edible Healthy Crack lol Very good"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_O_NGbnmi_U_cJP_h_qplQ/168s.jpg", "caption": "Beverges of choice"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DFHxzG59Tjj_YprQmp_07w/168s.jpg", "caption": "Wall Menu"}]}}, {"review": {"des": "I love brightwok and i'm so happy they opened a second location. As a celiac, this place was a staple. I'd go at least once or twice a week to meet up with friends after work, or grab a dinner to go on days I worked late. I never got bored of the selection & it always tastes good. The world needs more quick, fresh, gluten free places like this. expand to boston, perhaps?? I miss it!", "pics": null}}, {"review": {"des": "Chipotle meets Big Bowl. <br><br>Customizable, trendy, inviting and quick. With a line that reached the back of the restaurant, I was in and out within ten minutes.  <br><br>The food is surprisingly fresh, not heavy and I doesn't feel like you're eating some hidden calorie laden meal (such as a Chipo burrito bowl). The space itself is large and airy with plenty of seating.<br><br>A must try!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bZZZK2GwCJG5AN8Glop-gg/168s.jpg", "caption": "Chicken rice bowl with kale,sprouts,onion and broccoli. Half cashew sauce half teriyaki."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YGp8Z-fPKIZ8X3b0b-lVXA/168s.jpg", "caption": "Chicken rice bowl with coconut chili curry sauce, carrots, peppers, squash and sprouts."}]}}, {"review": {"des": "Great job. Celiac folks rejoice! Gluten free and dairy free done right has landed. Service was on point. Price was in line with great food we ate.", "pics": null}}, {"review": {"des": "THE FURURE IS BRIGHT! I love how they have combined the buffet/creat-your-own style (Most people call it the chipotle style) with Chinese food. Ive heard that the Earth, Curry and Fire and the Crunchy Cave are favorites.<br><br>If you're doing a \"Create-your-own-bowl\" you will have the option of four different veggies, a protein, a base, and a broth. I highly suggest getting onions with the basil sauce or a combination of cabbage and the Thai sauce. <br><br>A bit of a hidden away location, and its packed around lunch, so I suggest arriving a bit late (around 2) for a nearly empty restaurant. Plus, It's pretty affordable.<br><br>Side Note: on the wall, there is the slogan: \"THE FUTURE IS BRIGHT\" made out of chopsticks. Cool!", "pics": null}}, {"review": {"des": "Found this place on Yelp.  Always like to try new fast casual places.  This one has a simple menu layout, with a build-your-own or their recommendations.  I did one of their recommended bowls (earth, curry and fire) with tofu.  It took about 4-5 minutes to prepare.  All of the vegetables that went into it were still bright and crunchy.  It was \"hot\" per their scale, but the guy told me that meant a 5/10.  He was right.  There was a bit of heat, but not at all overwhelming.  Good soda to go with it, and I was happy.", "pics": null}}, {"review": {"des": "I expected a lot more from this place-- there are so many of these build your own/assembly line type stir fry places that you would think places like these would strive for higher quality and better taste. <br><br>I got the Thai basil extra spicy with rice noodles, and the sauce tasted like a generic, Americanized attempt at Asian fusion. But perhaps that was my fault because I chose the wrong sauce. What I was more disappointed by was the fact that some of the vegetables and meat was charred because they had left the food on the wok for too long without stirring it around.<br><br>While the decor of the restaurant was bright and clean, there's not much else about this place that would draw me back-- portion size was not great, taste wasn't there, and the cooking of the food definitely wasn't there.", "pics": null}}, {"review": {"des": "Love this place.  It has fresh, healthy, delicious food for a reasonable price.  I am so glad I have a healthy option close to school.  They cook the food to order, but they are relatively quick, which makes it a good option for lunch.  I highly suggest this for any foodie or anyone who wants delicious, healthy food.", "pics": null}}, {"review": {"des": "Nice quick build-your-own noodles/rice bowl place. The staff were friendly and the food was tasty and customizable. The space wasn't the best (a little stark and could use better decoration) but otherwise a good experience! Would return.", "pics": null}}, {"review": {"des": "I've visited twice and both times were great! I've had the thai basil sauce as well as the golden miso. Both were super good.<br><br>If you are looking for a quick lunch in the Loop that won't totally destroy your diet, this is a solid spot!", "pics": null}}, {"review": {"des": "I love these new modern places like brightwok. They allow you to have healthy choices which gives you variety! The food was awesome and they give you large portions! The decor is very modern  and they are also environmental friendly! LOVE IT!", "pics": null}}, {"review": {"des": "Best Asian food I have ever eaten in my life! Believe the hype people!!! Fast, super fresh and one of the cleanest restaurants in the area! Fire!!!", "pics": null}}, {"review": {"des": "Asian fusion is my latest obsession. This place delivers it.  So many choices. So many reasons to go back.", "pics": null}}, {"review": {"des": "Yummmmm this place is really good! It's so difficult to eat healthy when traveling for work, but this place is right across the street from my hotel so it's super convenient. It's basically an Asian fusion version of Chipotle. You go down the line to choose your base (noodles/brown rice/white rice/greens), a bunch of veggies, protein, and sauce. Then everything gets stir fried and you can add a fried egg on top. I got brown rice, broccoli, squash, mushrooms, carrots, edamame, chicken, creamy cashew sauce, and a fried egg. <br><br>It was surprisingly really tasty & the portion was pretty big! I don't feel guilty eating this at all and will probably come back again before I leave Chicago :). Don't expect the food to blow your mind though...anything healthy can never be TOO tasty!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/coY4vp7QBeJv1E65iVT6CQ/168s.jpg", "caption": "Sooo good"}]}}, {"review": {"des": "Quality and consistency makes this an ideal lunch spot in the Loop. These meals leave you feeling perfectly full, not nap time full.<br><br>The staff is always great, very friendly and quick...superstars during the lunch rush. <br><br>Don't forget to add the fried egg!", "pics": null}}, {"review": {"des": "I don't know why, but this place is kind of reminiscent of Ikea's food court, with its bright lights, minus the godawful meatballs. Don't get me wrong, this is much, much better than an Ikea food court.<br><br>For the price, it's on par with all the other \"quick weekday lunch\" places in the loop. The veggies are plentiful, the sauces are varied, and the lines move quickly. So why the 4 stars instead of the 5? I felt underwhelmed after - maybe it's the fact that it's gluten free, but I just didn't find myself wanting to go back anytime soon. Would I go back? sure. But would I crave this place on a regular basis? probably not.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uUNUVd_5nItAiRLgzYPeIw/348s.jpg", "caption": "Rice noodles with miso"}]}}, {"review": {"des": "This place had such a cool concept and yummy options. The staff was friendly and fast! I love making wok bowls at home but their selection of sauces and vegan/veggie/meat options was great. Great amount of food for the price paid. Their drinks were cool too, I got the iced masala chai and loved the spiciness. Seems like a really popular place too it was busy during lunch time. Will definitely come again when I'm in the city.", "pics": null}}, {"review": {"des": "Best quick Asian fusion I've had in the loop. I got the coconut curry with noodles and tofu. You also get to choose 4 veggies. Very tasty, and there are so many sauces to choose from. Next time I want to try the rice.  Seating is kind of weird--I think they can do a better job with that.", "pics": null}}, {"review": {"des": "4 1/2 stars? Seriously who are you people?<br>What criteria do you use to rate something 4 1/2 stars???<br>Get out!!<br><br>Ok true clean and probably healthy.  After that..... the food is fine? Maybe ok? it ain't close to 4 1/2.<br>It is like 4 star maybe on an average cafeteria scale.<br><br>I admire skillfully cooked food from an ethic restaurant or from a trained chef.  This is like flat top grill, not skilled chefs.  Not skilled ethnic family run chef.<br><br>If you want quick, clean and acceptable ok food it is fine.<br><br>I had to balance the other ratings <br><br>Uninspiring", "pics": null}}, {"review": {"des": "BomB AF this was the highlight of my day. Been raving about this place to everyone in my office.", "pics": null}}, {"review": {"des": "I thought it is a Chinese place before my visit. It turned out nothing Chinese here. It is one of a kind, a little like Mongolia BBQ.<br><br>You choose the sauce first, then one meat and four vegi. The mixture will be cooked and put on top of your choice of rice or noodle. The portion is \"healthy\" if you know what I mean.<br><br>The home brewed ginger beer is spicy!!!! And I highly recommend to taste it as room temperature not on ice. It's specially banana chip I'd flavorful but contains too much oil.<br><br>Anyhow, it's worth my visit.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zPSmcQAMPMn41qhBHaK9LA/348s.jpg", "caption": "...is bright!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LqIKQ5dqbSGkHb8mAYJ9jA/168s.jpg", "caption": "Future..."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kOpSFnKZcRVjJ2c39laIBQ/168s.jpg", "caption": "Clean station"}]}}, {"review": {"des": "I was really excited to give this place a try.  Located near the theater and the parking garage it seemed perfect - especially since it was pouring outside.  Unfortunately we were all sorely disappointed.<br><br>Nothing had any flavor and I mean no flavor what so ever.  One would think that with all these great fresh ingredients the dishes would be bursting with flavor - not at all.  You choose a sauce, a base, a protein and veggies.  Then there are extra toppings you can add.  There were three in our group and we each tried a different sauce.  None of the three sauces tasted like much of anything.  Super disappointing.  They have some hot sauces out that you can sprinkle on your bowl but that just added heat and not flavor.  They need to go back to the drawing board on those sauces and add some flavor and maybe make them thicker so they cling to the base, proteins and veggies better.", "pics": null}}]}