{"name": "bryn-mawr-breakfast-club-chicago-2", "reviews": [{"review": {"des": "This place was busy with a line on a Sunday around noon. The waiting area was small and tight, but the line moved pretty quickly. I could see the cafe counter where espresso drinks were prepared, which added a nice vibe. After about 15-20 minutes of waiting for a three person table, we were called. <br>I ordered the Pajun pancake. I had no idea what Pajun meant (maybe a mix of Cajun and some other culture that begins with P?), but the description sounded good. Scallion pancake with pork belly, brussel sprouts, potatoes, eggs, and toast. When it was served and I tasted it: HOLY COW I was not expecting such deliciousness!! Fwhat? After eating it I realized the pancake was very similar to a Korean pancake, and there was a little kimchi on it so I guess Pajun is a Korean word I'd never heard of. <br>The others at my table ordered the Mayan Benedict which I was told was EXCELLLENT (really cool thing is that it's served on a bean cake and it had a Mayan salsa on top instead of hollandaise) and I think the other dish was a carnitas skillet which was also good. <br>The service was kind, quick, and constant. They made sure our water was full, we had all the condiments we needed, and that everything was going well. <br>Despite the tight space, this restaurant was a pleasant surprise with wonderful food and a comfy, cozy atmosphere. Next time I visit Chicago, I want to come back and eat here again!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/R3JZ32PUyq9qeVwu5i51pQ/168s.jpg", "caption": "Pajun pancake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oRAWOOFm72LQB4PN5VLNsQ/168s.jpg", "caption": "Mayan Benedict"}]}}, {"review": {"des": "UPDATE: <br><br>Revisited and had the smoked salmon omelette and it was pretty tasty! Salmon was a bit more done than I would have liked but that's only because the eggs were well done and steaming hot! Potatoes here are always good but I like em crispy.<br><br>Ordered a lunch sandwich filled with green apples and bacon and it came with a side salad. It wasn't my favorite, but it was still delightful. <br><br>Ordered a stuffed guava French toast. Amazing, so good, not overly sweet and there were cute of peach and guava fruit leather! This was astounding. <br><br>Preciously... <br>They moved a few stores away! I didn't know until I arrived and thought perhaps the business closed. <br><br>Anyways, their new space is larger and decorated with the same rustic feel. Love that they put out fresh flowers at every table. Staff is always friendly and attentive. <br><br>Onto the food. <br>Key lime cheesecake stuffed French toast: It was pretty amazing. Quite a large portion so I shared with a friend. It had the right acidity to cream ratio, wasn't overly sweet compared to one of their stuffed french toasts I had a couple years back. <br><br>Skirt steak skillet: was good! Full of steak, cheese, and topped with yolky eggs. <br><br>2 eggs with chicken sausage: my go-to here. Hash browns are in small cubes, and the chicken sausage is bursting with flavour. <br><br>Fresh squeezed juice every day", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HBK0q2yYv-dNpvKoxXGx6w/348s.jpg", "caption": "Arugula Bacon Sandwhich with a light salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zB7W9VlGkHX1k-0bd4ri-A/168s.jpg", "caption": "Smoked Salmon Omelette (so delicious)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WbMKnBzjFFxcAL_NAeXnow/168s.jpg", "caption": "Guava French Toast"}]}}, {"review": {"des": "Yeees to breakfast! <br>A friend told me about this place and i'm so happy i listened. <br>Food: i had a skillet with poached eggs. I'm super picky about eating perfectly cooked poached eggs, so this place certainly delivered on my expectations. <br>Service: incredibly nice and knowledgeable staff. They recommend all the food served at our table. <br>Place: recently renovated/expanded. Clean and tastefully decorated with interesting art. <br><br>Bottom line: go and eat some fantastic food here ;)", "pics": null}}, {"review": {"des": "Love, love, love this place. Thanks to my friend for taking me here when I got stuck in Chicago for an extra night. It's always fun finding a great neighborhood spot... I just wish I lived closer to the neighborhood!<br><br>The Chilaquiles \"Verdes\" are some of the best I have ever had. <br>Tortilla chips cooked in their homemade salsa, topped with Cotija Cheese, sour cream, wrapped in a banana leaf. It comes with two eggs any style with rice, beans, and plantains. I went with over easy and it was super delicious... every bite!<br><br>The place is really comfortable and the staff was super friendly and made great suggestions. Maybe I'll move back to Chicago for this! ;)", "pics": null}}, {"review": {"des": "This might have been my favorite brunch all year. Super refreshing and delicious. The still cold brew was supposed to be the more bitter of the two options (the other being nitro), but I found it smooth and foamy. So divine. <br><br>We split the chorizo omelette as our savory and the banana fosters waffle as our sweet. PERFECT combo. The skillet was hearty with half an avocado, cheese, runny eggs, diced potatoes and of course chorizo! The waffle with its mascarpone frosting was lick-your-plate worthy. Ugh. Everything was so delicious. <br><br>Right next to my old high school (Yay NCP!) and decent parking made this an amazing spot. It is hopping, even on weekdays, so consider making a reso! If you do chance a walk-in like I did, they will seat you before your whole party is present, which I always find so kind. I'll definitely be back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iKJh1xKebdRTADTAP39N1w/348s.jpg", "caption": "Banana fosters waffle"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/m3Jh4_PJovi3PcrNoBGDqA/168s.jpg", "caption": "Chorizo skillet... SO GOOD and hearty."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4xM16b-rFASVSCP354vXow/168s.jpg", "caption": "Still cold brew $4"}]}}, {"review": {"des": "Very good breakfast.<br>This is far from home for us.<br>Definitely worth a visit if you are in the neighborhood!", "pics": null}}, {"review": {"des": "Wide variety of menu, just enough and that's not super overwhelming, with choices of breakfast, lunch, and specials. I ordered pancakes with strawberries and it was so good & fluffy!! <br><br>I asked if fish tacos were breaded and deep fried and my server said yes. However, when my fish tacos came out, I was disappointed that it was not breaded and was pan fried. :( I should've ordered steak tacos instead. <br><br>On a summer Wednesday morning at 10:30, it was a full house and people kept coming in. I will definitely be back and glad I found this neighborhood small business!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HMu60kT8r80j-ZYp_xwRHg/348s.jpg", "caption": "Menu August 2018"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZJitFUAdn1O6KgiKXrR1HA/168s.jpg", "caption": "Menu August 2018"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HBFeWafQHAGYzxeRfP7tTA/168s.jpg", "caption": "Menu August 2018"}]}}, {"review": {"des": "Great breakfast place on the Northside! The staff is so friendly and everything comes out of the kitchen quickly and delicious. My personal favorite is the chilaquiles, I definitely recommend. My only issue is the parking is all street parking and on school days you can only park on one side of the street. There is, however, something for everyone here! They have everything from pancakes and French toast to skillets with a Mexican twist.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OeYzQOKuShmvzFd6e1ksBw/348s.jpg", "caption": "Chilaquiles rojo"}]}}, {"review": {"des": "This is hands down my favorite brunch spot. Watch out, though, it gets busy! <br><br>My friend and I came here for a later Sunday brunch. We got the sourdough stuffed French toast and the chorizo skillet. <br><br>Oh my gosh. They were all so amazing in their own way. The sourdough stuffed French toast was something I could eat everyday all day. It was sourdough French toast (obviously) stuffed with ham, egg, cheese, and arugula. They were huge slices of bread- making for a hearty brunch. I would totally recommend this dish, especially if you're a picky eater and are unsure what you'd like. Who doesn't like ham, egg, and cheese on French toast?!<br><br>The chorizo ommmmmmmmmg I love chorizo but this skillet was to die for. It was a little spicy chorizo, onion, tomatoes, avocado, cheese, and chipotle sauce. It was a burrito in your month with some egg! Ugh so good- again, I'd totally recommend.", "pics": null}}, {"review": {"des": "You can't go wrong with Bryn Mawr Breakfast Club! It's our favorite brunch spot, and we always bring out of town guests here. It does get crowded, so if you're planning a weekend brunch, be prepared to wait a little bit before you can be seated. The food is worth it though!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wApUvQHZmbj1yusdj_s9sQ/348s.jpg", "caption": "Blueberry kiwi French toast"}]}}, {"review": {"des": "I've only been here once, and the food was really good. My only real complaint is that their ketchup comes in glass bottles. Imagine my horror as I'm trying my hardest to remove the ketchup from the bottle, and I inadvertently splash the person sitting to my left all over their back with ketchup! They didn't notice, so I spent the next minute of my life in complete inner turmoil of whether or  not I should tell them, and ruin their day, or say nothing and ruin their shirt. I'm not a complete jerk, so I told them, and they were not happy at all. So.... the remainder of my breakfast was spent in silence, while the couple to the left of us gave us justly deserved dirty looks. Please, get squeeze ketchup bottles Bryn Mawr Breakfast Club, and help me save myself from embarrassment.", "pics": null}}, {"review": {"des": "One of my best brunch experience while in Chicago! Food and the whole ambiance of the restaurant were great. Parking was a bit tough and I had trouble looking for the restaurant since, at that time, yelp had their old address. The wait wasn't that bad either but the food is worth it. Service was fast and the waiters are very attentive. <br><br>My cousin ordered the steak skillet and I ordered crab cake benedict. Mango blueberry toast was our side dessert :D. I found myself picking off my cousin's plate very often, the steak skillet is very savory and I'd definitely highly recommend it. My crab cake benedict was delicious and it was a great ig worthy running egg. I love pancakes and toast too but I can never order that as my main dish because I always prefer to have savory breakfast over sweet. I just treat the pancake or toast as my dessert. <br><br>I would definitely recommend this brunch spot and would love to come back for the steak skillet!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PUIuYIWNFiPDXBz1GHXBJA/168s.jpg", "caption": "Steak skillet"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yNtyuepQWd8DijznJVrA_A/168s.jpg", "caption": "Mango blueberry toast"}]}}, {"review": {"des": "Just like it isn't the responsibility of the restaurant to inform the customers where to park, it is not my responsibility to offer a great review of this restaurant after paying almost $80 for breakfast. That's right, I paid $80 because while I was dining, I got a $60 ticket for street cleaning. I had no idea there was street cleaning as the signs were not posted where I could see them. I use the city parking app and it gave me no indication that I wasn't supposed to park where I did, only that there was no payment at the time I was there. <br><br>I was going to try to write a nice review of this place because the interior design is so quaint, dating the time when the restaurant probably opened. No one decorates that way anymore. Unfortunately, the food was just okay, and the coffee was the only food that stayed warm. I ate quickly so that I wasn't eating a cold breakfast, but my rye toast was too cold to melt the butter by the time I got to it. While I dined, the restaurant was freezing! They had just opened so they probably turn the heat off at night to save money. I'm sure they weren't even going to turn it on because they were banking on it warming up later.<br><br>You don't have to make it your job to help out with parking, but you should, given the location. I've read some of the other reviews complaining about the parking so I am not the only one who has an issue with it. Just saying, you might want to take that into consideration. I'm not coming back because of this. I also have a feeling that the dishes that are best ordered here are for those with a carb addiction and a sweet tooth. I had a skillet and it didn't impress me. Thanks for a lovely start to my day off!", "pics": null}}, {"review": {"des": "This place is what wet dreams are made of.<br><br>First timer and Im not a breakfast person so wasnt crazy about ordering. Mind. Blown.<br><br>Staff very friendly. Quick. Great togo packaging. Large portions. Decent priced. Outstanding quality. Wonderful blend of traditional dishes and unique plates.<br><br>We shared the sourdough stuffed french toast. LARGE portion with so much flavor. Also got the Pajun pancake...a dish I have never had anything like and will never forget. That scallion pancake served with crispy porkbelly in a spicy brussel sprout blend. Oh. My<br> God. Just get it! <br><br>Each dish was around 12$ each. Worth every penny!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AVjP_J9cdb0WdqZLeZotyQ/348s.jpg", "caption": "Sourdough stuffed french toast. Delicious. Huge."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/e5FQgo9PzT8lbtwLFbGOfA/168s.jpg", "caption": "Sourdough stuffed french toast."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LxoOFpQc_jsjsQnntCCCng/168s.jpg", "caption": "Pajun pancake. Extremely bold and unique dish. Absolutely delicious!"}]}}, {"review": {"des": "I had to knock two stars from my previous review for two following reasons. The first was on a recent visit, I came to find out that apparently on Sundays they don't serve the lunch and salad menu, only breakfast and brunch. This is new news to me which we were a bit disappointed because we wanted to order their tacos or salad. The second reason was my order of the lox asparagus benedict and the breakfast potatoes that came with it. The potatoes were a bit hard and burnt and seemed like it wasn't freshly cooked. The quality of food seemed to have gone down a bit. On the plus side, we ordered the bread pudding French toast and were pretty satisfied and I like that they have the half order option.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ta32jKkoSARIXAIV1teFMg/168s.jpg", "caption": "Half order of the bread pudding French toast!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/guJg6lEOoEhWWgHDzzwpBQ/168s.jpg", "caption": "Lox Asparagus Benedict"}]}}, {"review": {"des": "BBC is everything you need.<br><br>From the moment you walk in the barista at the counter greets you with a smile. What a breath of fresh air, someone in the service industry who actually enjoys serving. I knew instantly I was gonna love this place.<br><br>My wife & I came on a Monday afternoon and were surprised to see this place was jumping! The beautiful modern take on diner decor was so inviting and clean. You can tell the owners really love and cherish their business. The whole staff is working hard to provide fast, efficient and friendly service - literally every person was busting their tails and doing it with a smile!! i always believe that happy employees make yummier food!!<br><br>I tried the steak skillet, but swapped the steak for grilled chicken. Our server had no quarrels with the protein swap and was glad to accommodate. My wife had the chorizo skillet - both we're phenomenal. The perfect diner grub. My only critique was the Gorgonzola cheese in my skillet. I had never heard of it and I probably should have inquired about it. It was very pungent and perhaps too intense for my first meal of the day, but it didn't bother me much at all. Next time I'll probably just ask for cotija cheese or something more mellow not as overpowering maybe something just more complimentary to the rest of the dish. <br><br>I did also notice that they take their coffee program very serious. Aside from the barista doing a full line or espresso-based drinks they also have two different cold brews on tap. Which in my opinion is just incredible for a neighborhood diner.<br><br>Hats off to BBC. I live about 40 minutes away towards downtown and I know I'll be coming back here plenty times. I love this place.", "pics": null}}, {"review": {"des": "Yummy unique breakfast options. Super cute decor. Place was slammed when we were there. We had sourdough stuffed French toast, Pajun pancakes, bagel lox cc onion tomato. Everyone enjoyed their meal. Coffee was good and our waiter was perfect.", "pics": null}}, {"review": {"des": "Came here with 2 friends. Thankfully we came by 10am because shortly after we sat there was a long line that followed. We ordered crab cakes Benedict, French omelette, and strawberry rubarb French toast. The potatoes that came with the meals were flavorful and had some crispy bits which were really good. The French toast wasn't too sweet which was good. I'm not a huge sweet tooth. Nothing too much to say about the other food. It was all delicious. <br><br>The wait staff was really nice and helpful. Outlet waiter gave us good recommendations and didn't get annoyed when we were a little indecisive. <br><br>I would go back! Go early!", "pics": null}}, {"review": {"des": "The Breakfast Club has gotten an upgrade since moving the down the street from its original location! It now has more seats, but there still can be a line for breakfast and brunch on the weekends. So DO NOT SLEEP IN for this one! The place still features a creative barn and farm theme with the rooster being its staple landmark. The breakfast club menu was also extended to offer more. I noticed there is a larger variety of dough-based breakfast items to choose from. However, the breakfast skillets are the specialities (personal opinion). If you are simple breakfast person and critique how you are eggs should be cooked, the Breakfast Club can serve up a mean and delicious classic gravy and biscuit, sausage, and egg combo. And you would think the Breakfast Club would stop there, but they also serve \"healthy\" portions of breakfast sandwiches that will have you stuffed! Unlike the night-time sister restaurant Big Hill (down the street 4-11pm), Bryn Mawr Breakfast Club has a more extensive menu that will attract you to keep coming. It just one of those places that you need to visit multiple times to feel satisfied that you experienced it all. This review is basically half finished since I haven't had breakfast there enough yet to share the complete experience!!!<br>But I have experienced the bottomless coffee. No it's not Folger's. They serve coffee from Michigan..can't remember the name of roasters..I guess I need to go back to update this review! Pictured are the veggie skillet over-easy eggs on top, sourdough stuffed french toast with Canadian bacon and skillet potatoes, pork sausage gravy biscuits, and cinnamon hotcakes.<br><br>10/10", "pics": null}}, {"review": {"des": "Decent breakfast place, although first time trying.<br>Presentation is on point, but omelette and veggie skillet tastes did not quite match the presentation. Despite adding salt and hot sauce, lacked overall flavor. <br>The desserts on the other hand, excellent! We have the bread pudding French toast and I couldn't stop eating it. <br>Overall nice place with average pricing, just needs some work on the savory options. Might try again.", "pics": null}}, {"review": {"des": "This family friendly breakfast spot was busy early; I got one of the few remaining tables just before 9am on a Sunday. Service was very quick both from the server and the kitchen. The coffee and OJ were good (a small of the latter is a large portion). For my breakfast I ordered the Breakfast Torta which is a sandwich containing chorizo, cheese, eggs and a special sauce called adobo. The flavors were good, but the chorizo could have been drained a bit longer as the bun and plate turned orange absorbing all the chorizo juice.", "pics": null}}, {"review": {"des": "Excellent! The customer service alone, impeccable! Wow! Impressive! I have to say I'm not the biggest breakfast person. I mean eggs are eggs and toast is toasted etc. But... this was one good breakfast! I didn't order anything impressive. But we ordered the special peach french toast. Sooooo good! Yummo! The veggie sausages were not my fav. The coffee was also tasty. Overall would go back again.", "pics": null}}, {"review": {"des": "A responsible Yelper dines at a restaurant at least twice before firmly steering friends toward or away. Typically I follow this completely arbitrary \"Chris-ism\" when reviewing. .. particularly with 1 or 5 star experiences. Considering Bryn Mawr Breakfast Club has a cult following, I'm comfortable bending my own  made up guideline for this 4 star review. I've only been once, but firmly suggest you give them a try.<br><br>BMBC is a strong 4 has the potential to be a 5 star breakfast option. The Pajun Pancake with Asian inspired pork belly and brussel sprouts was the highlight. Each component in this dish knew it's role and was necessary. ..savory, umptious, salty, sweet. <br><br>I also tried the signature Bread Pudding French Toast and the Skirt Steak Skillet. Both were really good. The French toast was served with an orange marmalade that was additive. The steak in the skillet was seasoned well and a very generous helping.<br><br>It gets out of the door crowded on weekends so come prepared for the weather just in case. Service wasn't bad, but not as attentive or friendly to warrant the elusive fifth star. I'll definitely go back and update my review accordingly.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eVyyfFIFLJgGikY_2GWi_A/348s.jpg", "caption": "Lemon Crab Cake Benedict - lump crab cakes, cream cheese, sautéed spinach, tomato, creamy hollandaise, poached egg."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/x6DmbbqZeqt6Bw4fC7LXOA/168s.jpg", "caption": "Fresh squeezed OJ & a mocha."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YJNTj9fougbyed7VcSho6A/168s.jpg", "caption": "Pajun Pancake - scallion pancake with 2 over-easy eggs, pork belly, sautéd with brussells sprouts and fresh garlic with potatoes"}]}}, {"review": {"des": "I really wanted to like this place considering all the positive reviews. Cute interior, but unfortunately food quality doesn't match the warm and inviting environment. Food wasn't bad. just not great. Nothing special or memorable IMO.<br><br>We had the lemon crab cakes and pork sausage biscuits/gravy. the crab cakes were better than biscuits/gravy tho, but not by much. Don't know why it was called lemon crab cakes cuz it didn't have any tang or tartness. Also didn't have much crab to begin with. I love biscuits and gravy in general so i was expecting a lot. The biscuit wasn't flaky and the gravy didn't seem fresh and out of the can. If that's even possible. The hash browns were warm at best and on the bland side for my taste. Service was good.<br><br>At the end of the day it was worth a try. I'm willing to give it another shot but next time will try the sweet rather than savory items. We went on a Sunday and There was a ton of people dining and waiting to be seated. Great environment, but hoping for a better experience next time.", "pics": null}}, {"review": {"des": "Finally made the brekkie trek to Bryn Mawr Breakfast Club. Its a cozy place, so if your hitting up this spot on the weekend-be prepared to wait or come early. The interior is a fun and vibrant atmosphere-tastefully eclectic with mismatched chairs from the antique market. Whimsical fresh flowers in different vessels give it just the right touch and classic grandma's dishes adorn the wall with farmhouse style decor. <br><br>I don't really recommend getting counter seating as there's a kitchen window where all the food comes out or sitting next to the swinging coffee bar door that can really get on your nerves as it's a high traffic area. The tables are close so if little ol' me can barely pull a chair out with my winter peacoat next to the tall guy behind me-be prepared to have your personal bubble burst. Besides this teensy diner-esque space-the food REALLY makes this place. Thank to the chef, the trendy cult continues to follow to this new dig.<br><br>I had a vegetable skillet while my husband had the skirt steak skillet. Skillets come with roasted hash lightly sprinkled with cheese, 2 eggs of your choice, and your choice of fresh bread with a side dish of tiny jams. The vegetable hash had this fresh melange of sweet corn kernels, sweet peppers, mushrooms, greens, tomatoes lightly mixed with meaty fontina cheese. Next time I have to get the skirt steak skillet my husband had with generous amount of protein complementing Mexican flavors. So do yourself a favor and get one of the skillets. It will leave you full and satisfied without you crying to the bank. Out of all the brunch places in Chicago, I prefer the food the most here so we'll definitely be back sometime.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UQfiAGLiWFr4ynKwjeYcwg/168s.jpg", "caption": "Skirt steak skillet"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lZbrV3GUVkIsG8YVa3tWrw/168s.jpg", "caption": "Veggie skillet"}]}}, {"review": {"des": "The service was really great. I had mango French Toast and chicken apple sausage. A little too creamy and sweet but surprisingly good. My son had eggs, hash browns chicken sausage and toast. He ate everything including some of mine. They aim to please.", "pics": null}}, {"review": {"des": "It can be a challenge to get in to Bryn Mawr Breakfast club during weekend brunch hours but it's worth the wait.  Our cortado coffee was tasty and cold brew good, but very strong.  We tried the chilaquilles and the pajun pancake without the meat.  Portions were very generous for both dishes.  The pancake was an unique, Asian inspired breakfast and probably the stand out dish of the two.  Service was acceptable.  Not a lot of options if you have a vegan diner in your party.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iKbsZKCiQk9QtbOhpVjadA/348s.jpg", "caption": "Cortado time"}]}}, {"review": {"des": "Wow<br><br>Even the reviews don't do it justice,<br>The food is perfect, the carpaccio amazing and the people working here are as nice as we've met at any restaurant,<br><br>My wife had a veggie skillet that was loaded with every imaginable veggie.<br>I had the special French toast that was sweet but not overly so.<br><br>We will be back.", "pics": null}}, {"review": {"des": "Food was incredible! Everything was super hot and fresh. Very cozy feel to the restaurant. The service was excellent and drinks were always refilled.", "pics": null}}, {"review": {"des": "Really enjoyed a late brunch here on Sunday! The place closes at 3 and when we showed up at 2:15 it was still packed- always a good sign. This was my first visit here and will definitely not be my last. <br><br>Our order:<br>Coffees - hot and delicious keep em coming<br>Chilaquiles verde - really interesting presentation wrapped in a banana leaf. The rice and beans were a little dry, but the rest was good. Would probably add meat next time<br>Chorizo skillet + extra eggs - didn't get a chance to try as it was scarfed down!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jRIz1ZxIeR_yVmoNkABpaw/348s.jpg", "caption": "Chilaquiles verde yumm"}]}}, {"review": {"des": "This place along with most other breakfast are packed with people on weekends. We came on a Saturday about 11:45, I was worried we wouldn't get a seat but the server told us to wait about 10 minutes. Luckily we waited even less than that. <br>  I got the skirt steak skillet and it comes with hashbrowns, eggs and toast. They give a lot of steak with that too, underneath the eggs and steak, there's rice, salsa, and avocado. It was really good and filling and I would get it again. <br>  This place is very busy and the servers check up every once in while quickly. I wish they could do separate checks, but at least there's venmo now for that.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AfddBIOvICuV8UUplK8ukA/348s.jpg", "caption": "Skirt steak skillet with scrambled eggs!"}]}}, {"review": {"des": "Yahm!!! <br>You don't think much when you see this place from the outside but it is AWESOME. We were seated with a few minutes. I had a baby carrier with me and it was kinda snug but we made it work.  <br>I ordered chilaquiles. They were amazing.  Super authentic flavor and nice portion size.  The place is clean, the staff was attentive, restroom was clean as well.  Definitely a go-to breakfast spot!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WqnF0DeHrKUO6mEVwX0aEg/348s.jpg", "caption": "Chilaquiles... the perfect breakfast."}]}}, {"review": {"des": "I've heard rave reviews and saw mouth watering food pictures from acquaintances that i wanted to check this place out with a former classmate. <br><br>The place was crowded around 1030a that we ended up seating by the washroom for a 2 person table. I felt the long wait for our food and drinks refills did not equate the food $40+ bill for the both of us. Food tastes pretty average. <br><br>I also felt we were too close to other people's tables that it was a 2 way eavesdrop. Even the waitstaff taking orders near us tried their best not to get into our personal space. It was a very claustrophobic experience indeed.<br><br>It would have to take someone to treat me out to go to that place again! Don't take reservations, walkins only. Meter parking around that area!", "pics": null}}, {"review": {"des": "The blueberry pancakes topped with blueberries and walnuts were so delicious you really don't need any maple syrup. It was just enough fluffiness to melt in your mouth. Customer service was excellent and very prompt. Definitely a great place for breakfast & brunch!", "pics": null}}, {"review": {"des": "I liked BMBC. The place has a lot of charm, the service was spot on and the food was good. It wasn't great and it was barely warm which is the reason why my review has only three stars. <br>We came on a Thursday, and the place was packed. We had to wait 20 mins to be sat but we didn't mind. The issue was that we had to wait by the door and it was super cold. When we sat down, we sat away from the door but it was still cold. The service was quick and we were in and put quite fast. I had an omelette and my husband had the chiliquilas. His food was warm and really delicious. Mine was good, forgettable and it wasn't even warm. It seemed to have been sitting there a while before it got to me. Not sure what happened with mine but it led me to write a three star review. I would love to come back in hopes my food is as good as everyone raves it is. Will see!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jJ3Ks3rZB5ICBZb4Z6ixSA/348s.jpg", "caption": "French omelette"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/u_9Fo665VdF8WO564f4nVQ/168s.jpg", "caption": "Chiliquilas"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JTL3vIF05U5PbyvkSRSOxQ/168s.jpg", "caption": "2 orders of chicken sausage"}]}}, {"review": {"des": "Been waiting to try this place for a while and overall, I was really pleased! <br><br>The atmosphere is so nice and I loved the menu - especially all the options for sweet breakfast. I really liked the coffee, and overall I was pleased with the mango blueberry waffle too. The waffle was well-cooked and the mascarpone was perfectly sweet, but I was a little disappointed as over half the waffle was soggy when it came to me. We also tried the vegetarian sausage, which was the best veggie sausage I've ever had! The fruit was fresh and delicious, and the veggie skillet was more creative and flavorful than most too. <br><br>The only other complaint is that the service was pretty inattentive. The restaurant was full, but I was nearly impossible to get coffee refills or even our toast. Other than that, it was a great experience, and I would definitely be back!", "pics": null}}, {"review": {"des": "Simply the best and the most unique neighborhood restaurant i have ever visited.  I'm originally from Naperville and just moved into the area about six months ago and was wondering why everybody was talking about it. I finally stopped in over the weekend. Simply impressed by their coffe program, selection of delicious breakfast brunch and lunch food, and their new bakery.  <br><br>My friend ordered the skirt steak skillet. Not only was it pretty but I did taste the steak and it was flavorful and tender. The crab cake Benedict for brunch was very good too. The sautéed spinach it came with was delicious. I personally had the chopped chicken salad which I highly recommend. I can't wait to go back to try the Bryn Mawr St. tacos. This restaurant gets an A+!", "pics": null}}, {"review": {"des": "The Pajun Pancake is honestly the best thing I think I've ever had for breakfast. If not the best ever, the best I've had in as long as I can remember. A scallion pancake, with crispy pork belly, Brussels sprouts, potatoes and eggs. It was absolutely moan worthy. <br><br>He ordered the Balsamic Pear French Toast, and while it was delicious and beautifully plated with layers of crème anglaise and poached pears, I was way too into my food to take more than one bite of his. So much that I ate every single speck off of my plate and refused to be hurried. <br><br>Service was actually pretty fast. Even with a long line, we were seated within 15 minutes and then eating our food within another 10. <br><br>With Bryn Mawr Breakfast Club being a fair distance from my house, I was looking up scallion pancake recipes before I even got to my car. <br><br>Time to get cooking.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hlJ1MZFIwQVcedYhp1oC8w/348s.jpg", "caption": "Balsamic Poached Pear French Toast"}]}}, {"review": {"des": "This restaurant is great and this restaurant came on check please. My friends and I had to wait but it wasn't to long. The restaurant isn't to big and the decor have a nice and comfy feel when you walk in. I ordered salmon Benedict and it was phenomenal because they used croissant as the bread of choice instead of the usual English muffin. My friends had the omelet with hash browns and regular breakfast and they both enjoy their meal. The coffee was good and I had two cups. Our service was pretty quick and our waitress took care of our needs. I would definitely go back to this place and try other dishes since it's a great place for brunch.", "pics": null}}, {"review": {"des": "Love to see great neighborhood places \"off the beaten path\" thriving! <br>Well-crafted menu with fresh ingredients. Excellent , attentive waitstaff and short wait for food even when the room is hectic. Had different items there from the usual breakfast staples to the more savory ethnic items like Chilaquiles and all are very well executed, balanced in flavor and good presentation. I go with the same friend all the time and we always say we'll try somewhere new but we keep coming back for more!", "pics": null}}, {"review": {"des": "Absolutely one of my favorite Brunch places in Chicago hands down! Definitely worth the drive or commute to get here, because everything is incredibly delicious and well thought out! Have visited here since their last location across and down one street, but this new location is bigger which is so much better, because now they can accommodate more people faster!<br><br>We ordered the Skirt Steak Skillet, Carnitas Skillet, and a half order of the Key Like Blueberry French Toast!<br><br>Both the the skillets were phenomenal! The meats were juicy and flavorful! The potatoes were perfectly cooked and seasoned well. The avocados in both dishes were plentiful and added such a nice creaminess. The Sunnyside eggs on both were also perfectly runny! <br><br>The true star was the French Toast. Even with just having ordered a half order along with our entrees, we could've eaten more. The French Toast was decadent, no overly sweet, perfect tart with the key lime, and the combination of flavors were out of this world good.", "pics": null}}, {"review": {"des": "Yum yum yum! Check it out on a whim and was not disappointed!! The blackberry kiwi is amazing!!!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QQTgYINUB4TaQEaJKB-j0w/348s.jpg", "caption": "BlackBerry Kiwi French toast"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oWoURw_XG-cegNf4KS4a2A/168s.jpg", "caption": "Pork sausage biscuits and gravy!"}]}}, {"review": {"des": "Gawd. YES. YESSS! I came here on a Monday for brunch. Here's the tea:<br><br>Location - North Park area. Street parking only. Plenty of parking on a Monday; probably gets pretty tight on weekends. Directly on the corner of Bryn Mawr and Kimball; across from TCF Bank and 7-11. <br><br>Fare- decent menu offerings. I had the Chorizo Skillet and it was amazing! AMAZING! It had avocado, chorizo, black beans, cheese, potatoes, grilled onion, and of course eggs on top. It was amazing. Never would've thought. $16 bucks for my entree + bottomless coffee. <br><br>The service was prompt and the waiters were all polite and attentive. I'd definitely definitely come back here.", "pics": null}}, {"review": {"des": "I remember coming to this area of Bryn Mawr as a kid because this used to be a super Korean area. I was pleasantly surprised to see this highly recommended breakfast spot offering things like pahjun pancakes and I had to give it a try.<br><br>WOW.<br><br>This place is really good. It's so cute and cozy inside, and we said immediately after our meal that we needed to visit again asap to try everything else on the menu.<br><br>It was super busy even on a random Tuesday morning so not sure how it is on a weekend, but I loved everything about our visit.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hOpNV6AFeN2lgVg3TRyRFw/348s.jpg", "caption": "The hype is real"}]}}, {"review": {"des": "Great little breakfast place in North Park. Service is quick and attentive. Food is outstanding! Just a heads up it can get very crowded at peak times due to it's popularity...but well worth the wait!", "pics": null}}, {"review": {"des": "So there's my pros and cons of this place,<br><br>Pros: bigger space, comfy, doesn't smell<br>like grease in the air like the first time I came here from the old location. And good coffee.<br><br>Cons: the menu is limited (they need more options), the food is mediocre at its best and not worth the $13-$15, speaking of the food; it's too greasy, from the little ass steak I got from my steak and eggs to my mom's stuffed peppers with a pool of chorizo. Also side note, I can't eat bread or any type of carbs like potatoes, I saw the steak and eggs doesn't mention potatoes I ordered it, but when it arrived I SAW POTATOES ON MY PLATE! I almost lost my shit and I was about to complain, but my mom calmed me down and told me the move it to the side, though even if I did want the potatoes, it was terrible, tasted like the frozen potatoes from dollar tree or jewel, also I didn't get the bottomless coffee or water offers that people here are talking about, so whatever<br><br>All in all, won't be coming back, I like the space but I can make better breakfast food than what they're cooking.<br>P.s: THERES NO WOMEN WORKING HERE, JUST MEN, ITS WEIRD.", "pics": null}}, {"review": {"des": "This is a great breakfast/brunch place. It used to be located on the corner of Bryn Mawr and Kimball, but has relocated about a block down on Bryn Mawr to a more spacious location.<br>I have been a few times to the old and new location and have enjoyed my experience every time.<br>Despite the larger new space, you can still expect lines and long wait times to get in, especially on weekends.<br>The last time that I went I had orange juice and one of the omelettes from the specials menu (it comes with toast and a side of potatoes).The food is good and the portion size is decent.<br>I would recommend getting the hotcakes - especially in the summer when they have the guava flavored ones on the menu - so yummy!<br>I do wish sometimes that they would have more vegetarian options on the menu, but I can live with what they do have.<br>Service is very quick and straightforward. <br>In my opinion a good breakfast/brunch option in the North Park neighborhood!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BB9e31deP6ncqKdX3E_hzA/348s.jpg", "caption": "Vegetarian Omelette"}]}}, {"review": {"des": "LET DOWN.<br><br>I went to go check this place out on a day off and it was empty. CLOSED. I called and the phone number doesn't even go through. It would have been nice for this to be listed on yelp. I am not sure if it's getting renovated to if it's just closed down. <br><br>If it opens I will still try it. I am let down though.", "pics": null}}, {"review": {"des": "Been here a few times, satisfied with the consistency in food and service. Favorite item on the menu is the bread pudding.. it is a must try!! The orange coulis is the best part of this sweet treat. It's a perfect balance of sweetness and tartness that compliments the bread pudding. Wish they had more options in omelettes and skillets.. have tried their veggie skillet and a few other egg specialties.. Though nothing beats the bread pudding they have here!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nA-D0pwjbELnfY16aOK_Hw/348s.jpg", "caption": "Bread pudding... MUST try"}]}}, {"review": {"des": "The skillets at this place are amazing and the sweet breakfasts are perfectly flavorful. The service is always friendly, helpful and attentive. Despite the fact that they get busy quite often, the food comes out rather quick. Pretty hip breakfast joint.", "pics": null}}, {"review": {"des": "Very tasty breakfast. Hash browns were delicious, diced potatoes with peppers and onions mixed in. Biscuits and gravy was a little on dry side. Could of used more gravy.", "pics": null}}, {"review": {"des": "This wonderful (but relatively speaking, small) breakfast/lunch spot has moved a very short distance from it's original location, and they never skipped a beat. I just wish this gem was larger - anticipate a wait, but I rarely say this - I'll wait for the great food served here. From chilaquiles to french toast to waffles to eggs & bacon w/roasted potatoes (soooo good!!!), you simply cannot go wrong. Great choices for vegetarians as well as carnivores.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eH5rd5sofSAeE8mNyWfd4A/348s.jpg", "caption": "Chilaquiles. Beautiful presentation, huge portions, and DELICIOUS!"}]}}, {"review": {"des": "We had a great breakfast experience here a couple weeks ago! The service was great and the food was very good. I ordered the chilaquiles and vegetable skillet to share with my mom. Both were done really well and our over easy eggs perfectly cooked. <br><br>We did see the old place across the street and disappointedly thought the place was closed after paying for parking. We were very stoked to see that they had just relocated! I think this could certainly cause confusion for new customers.", "pics": null}}, {"review": {"des": "Deserves 5 stars!! It's not inside Chicago downtown but worth the 18 minute uber drive! Such a beautiful little brunch spot in a small town.... friendly atomosphere lots of families, Chicago locals recommended the banana bread pudding French toast...more on the pancakes side for texture but WOW glad I ordered it! the taste and banana glaze on top! I enjoyed every single bite. ( go early, the wait never stopped during my entire time eating there, but quick turn overs )", "pics": null}}, {"review": {"des": "As you may have read from my previous posts' my wife and I love love love to get out to new places weekly for breakfast. This week we had the pleasure of enjoying Bryn Mawr Breakfast Club (inserts heart emoji). <br><br>Located in the North Park neighborhood; just north of the Old Main building, built in 1894. Bryn Mawr Breakfast Club provides a plethora of breakfast diversity menu options in an intriguingly humble manor. <br><br>For my wife, the Chorizo Skillet! Chorizo, onion, tomatoes, black beans, avocado, cheddar cheese, sour cream, Chipotle sauce & love. For myself; Biscuits & Gravy! 2 Biscuits, pork sausage, 2 eggs (any style), 2 sausage & roasted potato hash (inserts another heart emoji). <br><br>It is without a doubt within the next five months the 555 (56 with this review) reviews will turn into 3500; and after that this restaurant will reach the Chicago bucket list! Pro- tip ask for Adrien as your server; he's phenomenal!", "pics": null}}, {"review": {"des": "Very good breakfast place.  The wait was too long during the weekend so went here on week day morning and was able to get a seat right away.  We shared Caprese omelette, Pa jeon and blue berry French toast.   The omelette and French toast were awesome.  The PaJeon had a good seasoning except I wished it was crispier.  Overall great breakfast place that was worth trying.   Definitely will go back when I am back in town.", "pics": null}}, {"review": {"des": "We've been here a couple of times and each time the food gets better.<br><br>One of our favorites is the Smoked Salmon Omelette which consists of smoked salmon,  red onions,  capers,  avocado and cream cheese. Served with a generous helping of homemade fried potatoes and topped with mango chunks.   It's delicious!<br><br>Another great dish is the Skirt Steak Skillet with pico de gallo, avocado, and gorgonzola served with salsa Verde. <br><br>Get there early as it gets crowded very quickly.<br><br>Service is usually very good, but if it is crowded you can expect to wait longer than usual.<br><br>The food is great in my new is you need. The portions are large you will not go away hungry.", "pics": null}}, {"review": {"des": "I heard so much about this place, both before and after they changed locations, and I so badly wanted it to live up to the hype, but unfortunately it didn't. <br><br>Right when my friend and I walked in, we put our names down for a table for two. But there's no waiting area at all, so we ended up standing in tightly squeezed crowd of 15 people that were trying their best to stay out of the way of the waiters and people sitting and eating.<br><br>Wait times here are pretty decent for weekends- we waited about 20 minutes for just us two. But I think this is made possible by the fact that the waiters rush you out pretty quickly after you eat. <br><br>We ordered coffee as soon as we sat down, but their only options for add-ins were whole milk or the creamer packets on the table. Not a big deal, but coffee options are nice to have. <br><br>I ordered the breakfast burrito, and it was okay. It wasn't bad in any way, but I can't say it was good either. It tasted like something I could've thrown together myself at home, but I feel the point of eating out and paying big prices for food is to taste something you wouldn't be able to make yourself. I kept waiting for the spice, but it never hit me. <br><br>Maybe it's just what I ordered and their food is actually very good, but I'm not too excited about revisiting it try more out.", "pics": null}}, {"review": {"des": "We absolutely loved this place! I had the Pajun Pancake  and my vegetarian boyfriend had the Mayan Benedict without the chorizo. Our server suggested he do it with the vegetarian sausage. We both absolutely loved our dishes! They were both so unique and delicious!  This place is a must try!! We went on a Saturday around 12:30pm and the wait was less than 5 min! We just moved to the area and can't wait to go back!", "pics": null}}, {"review": {"des": "Took a long time to finally try this place because it is so darn far away.  The restaurant is located in a little Korean neighborhood, nestled among Korean stores and BBQ places.  As it was a homage to the local area, I had to try the pajun pancake.  It was great!  Get your eggs over easy and dip the pancake bits into the sauce and then the egg yolk, that's (imo) the best way to eat it.<br><br>The rest of the breakfast food here is kind of meh, unfortunately (hence the 3 stars).  Omelets were not very exciting either.  The biscuits and gravy - bland tasting gravy, biscuits that looked and tasted like grocery store bought biscuits, overcooked scrambled eggs.  <br><br>I'll probably be back again and again for the pajun pancake.", "pics": null}}, {"review": {"des": "Service is excellent! My bottomless coffee mug never even gets to halfway before they fill it up, again.  The pajun pancakes, chorizo skillet, and rotating specials give me a mini-panic attack when ordering since I typically want them all.  <br><br>Great for kids, too.", "pics": null}}, {"review": {"des": "Went here for weekday breakfast: <br>Delicious food. Great coffee. Relaxed atmosphere. Farm fresh. Love it. Highly recommend.", "pics": null}}, {"review": {"des": "The Place<br>Bryn Mawr Breakfast Club is located nowhere else then on 3348 W Bryn Mawr Ave, Chicago, IL.  This is a fun place for breakfast, brunch, or lunch.  Very clean and well attended to with a warm inviting atmosphere.  Ample tables or booths to sit at share a meal.<br> <br>The Menu<br>Fun menu with Club Signature offerings, fun omelets and skillets as well kitchen classics.  Lunch has an assortment of options including burgers, tacos, sandwiches and salads.   We enjoyed a breakfast burrito<br>w/ chorizo, roasted poblano pepper, corn, avocado, chihuahua cheese, adobo sauce, sour cream on flour tortilla with potatoes, a couple orders of oreo pancakes, and pork sausage gravy biscuits, eggs, sausages & roasted potato hash browns.  All were very good.<br> <br>The Value/Service/Experience<br>Breakfast was a little on the expensive side but you get what you pay for from a value perspective.  Our service was very good, and overall it was a very nice breakfast experience.  I recommend you give the Bryn Mawr Breakfast Club a try.", "pics": null}}, {"review": {"des": "Cute place with mediocre food on my visit. The biscuits and gravy is a big plate of food, but only the diced potatoes with onions and bell peppers were good. The biscuits were hard and doughy, the gravy was gummy and had little canned mushrooms and no pork, and the scrambled eggs were tough from being cooked on high heat. Not a good meal at all.<br><br>Service was friendly, coffee was good. The place on a summer morning was shockingly cold, the AC was on full blast! I will not be back.", "pics": null}}, {"review": {"des": "Favorite breakfast spot in Chicago! Always busy on weekends so be prepared to wait a little- it is worth it though.", "pics": null}}, {"review": {"des": "An eclectic menu with a tropical twist.<br><br>Fresh ingredients, large portions & exceptional flavors. All coming together for a breakfast that will bright your entire day. <br><br>In a rustic uncommitted setting, where the coffee is good and you find breakfast staples such as pancakes, French toast, egg benefits, skillets...<br>Each dish has a flare of their own, that will make your head spin every time a table is being served; trying to see the other meals. <br><br>Ex: Lennon crab cakes Benedict,  Caribbean omelette,  and mango raspberry French toast.<br><br>They serve lunch as well, and using brunch is a guideline, I expect it to be great; but I want to finish the breakfast menu first.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/U0fYksxfAh7BK2Xm1wg4sQ/348s.jpg", "caption": "Salmon Plate Club"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QtQ5IXX9Dz00VB6dg-ukqA/168s.jpg", "caption": "Store Front"}]}}, {"review": {"des": "Bryn Mawr Breakfast Club is the perfect place for brunch, possibly one of the best brunch places in Chicago. Located in the North side of the city, Kimball and Bryn Mawr, they recently changed their location from the corner of the intersection to basically across the street on Bryn Mawr. <br><br>This place is kind of new to the area. My brother recommended it to me because he lives in the area and he randomly walked in for breakfast one day and was raving about their pancakes and French toast, so I decided to give it a try.<br><br>Their menu has all the basic items you would find on any breakfast menu, and to my surprise it also had Mexican food on the menu as well as traditional burgers and other items! Mexican food is my absolute favorite, so the first thing I had to try was the Chilaquiles verdes with chicken. The food was so delicious and reasonably priced ($12-14) that I had to come back multiple times. So I also had the chorizo skillet, which was also very delicious, with a side of the French toast, and another time I opted to order their caprese omelette with a side of pancake. My boyfriend ordered their Breakfast Torta which he loved so much he ordered it twice in two days. <br><br>Basically everything that I have tried on their menu was created with a passion for quality food, and the people that work there also have a great energy. This place is super busy everyday, but we have managed to get seated quickly every time we visited. They also built an outdoor patio in the back which is so perfect for this location. Great job to the people that worked on this restaurant and I will be visiting you again soon!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BPQ5EzQg7_JAF_CgZVNLRg/168s.jpg", "caption": "Chorizo Torta"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/s7gTi0xcdSyZM5s0to4C2Q/168s.jpg", "caption": "Chilaquiles Verdes with French Toast"}]}}, {"review": {"des": "The atmosphere is eclectic and cozy. The food is awesome and flavorful. Prices are fair given the amount you get for what you pay. It's not at all in my neighborhood but I don't mind driving for it.", "pics": null}}, {"review": {"des": "Very lovely place. Interior is like old barn. It is crowdy and now we know why. I had Lox Asparagus Benedict YUM! My husband had skirt steak skillet. Huge portions but we still wanted to try bread pudding french toast and it was very tasty. We will stop by again.", "pics": null}}, {"review": {"des": "I usually love going to the Bryn Mawr Breakfast Club. I've raved about it to anyone who loves a good brunch as much as I do. It's always been amazing. I went there this morning and was sorely disappointed. The blackberry kiwi french toast wasn't fresh. It wasn't hot and had that chewy texture you get from eating leftover french toast from the microwave. The plantains were nice and fresh and the bacon was decent although that didn't seem super fresh either. I really do love this place, but you only get a few stars because of my experience today. If you want five stars you gotta earn them. If I wanted microwave french toast I could have stayed home. Don't start cutting corners now BMBC. You're better than that.", "pics": null}}, {"review": {"des": "Great atmosphere, busy place yet some how it's cozy. Food is good, my only disappoint me is they don't have any sweet dishes with chocolate.", "pics": null}}, {"review": {"des": "The food is quite good. The space is eclectic but there seems to be a many men running around not quite sure what their doing.    Despite this mild disorganization the place is pleasant and I always enjoy my dish.", "pics": null}}, {"review": {"des": "Brought mama bear here on Tuesdays morning expecting it not to be busy, we had to wait 10-15 minutes until one of the tables was cleared. The wait time wasn't bad compared to weekends.<br><br>I was digging the countrified look of this place. They've got that rustic earthly in a cabin vibe going on. We were seated by the window which in my opinion is probably the perfect seating area in the whole place. The waiter brought us water although there was cream and sugar on the table he did not offer us and coffee, really bummed me out. And no I wasn't given an option as to what I wanted to drink. The waiters didn't say much just facial gestures. (Probably need to work on being more active with the customer's) We had the Bread Pudding French Toast two slices of bread pudding served with orange coulis and fresh berries and also the Blackberry & Kiwi French Toast which had kiwi jelly and blackberry jam. And a side of scrambled eggs.<br><br>Let me tell you this place isn't your average \"old fashioned pancake house.\" It's jam packed with unique flavors compared to the traditional American breakfast it's pretty darn DELICIOUS! That sweet <br>orange coulis marmalade drizzled around my toast with little shreds of orange zest was the perfect sweetness. Unforgettable flavor for a sweet tooth person like me. They had me forgetting I wanted coffee. <br><br>Definitely going to come back and try some of the other unique dishes. <br><br>FYI: this place does not take reservations so good luck waiting in line", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8UgcJTEMkeKZTZp_0NnRjg/168s.jpg", "caption": "$11.50 Blackberry & Kiwi French Toast with kiwi jelly & blackberry jam not sure how much the scrambled eggs cost"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/n8iwCK1ANHEMtIhscYwecQ/168s.jpg", "caption": "$11.95; Bread Pudding French Toast 2 slices of our bread pudding served with orange coulis & fresh berries"}]}}, {"review": {"des": "Took a day off today and the kids were at school so thought I'd treat my wife to a little brunch somewhere other than McD's.   Didn't want to mess it up cause we don't get many kid free meals so we went to BMBC.   when we pass by on weekends it always packed with a line out the door at times.  No line no wait on a Friday morning 11ish.  It was still fairly well occupied but their new place is nice, still with a cozy feel to it but with more elbow room.  <br><br>We were Sat down right away.  I wanted to try everything.   Finally picked a skirt steak skillet with over easy eggs. Good sized portion of steak chopped and nicked with potatoes and pico de Gallo.  Pop the yoke and have at it. It is seasoned and cooked just right.  My wife opted for an item off the specials menu, peach and cherry hot cakes.   Of course I tried.   With syrup, I think it's The right mix of sweet and sour(cherries).  It all tasted fresh. <br><br>Staff was courteous and friendly. It took them a little long to bring us the bill but otherwise no issues. <br><br>Looking forward to coming back.", "pics": null}}, {"review": {"des": "Came here for a late brunch last Sunday when I was back in town. Cute atmosphere, even better food. I ordered apricot pancakes that did not disappoint in looks or taste. One friend had the bread pudding french toast which caused me envy. Street parking was easy to find.", "pics": null}}, {"review": {"des": "Fantastic food, also the restaurant itself is put together very nicely. Highly recommended", "pics": null}}, {"review": {"des": "A gem of a place for sure.<br>Busy,quaint, good food, great service.<br>Had a nice breakfast here but the dish that stole our hearts and taste buds? The French toast! It was mouthwatering bliss! <br>Hubs and I shared this dish in addition to our own meals.<br>I haveta say...Nom nom nom nom!!!<br><br>They open EARLY and close early! <br>Very limited seating.<br>We felt like we were out of town on a nice little day trip to a upscale little town with the draw being this place!<br><br>Looking forward to visiting again real soon!", "pics": null}}, {"review": {"des": "I've been wanting to try this place for a few years, ever since It was featured on Check Please. I convinced the boyfriend that we should try it for New Year's Day brunch. It was worth heading out in the cold and the 15 minute wait for our table. I had the stuffed sourdough French toast. It was a lot of food and brought half home. The portion I ate was delicious. My boyfriend got the salmon platter. He didn't bring home half. He ate the whole platter. We will definitely be back as there are several items I would like to try.", "pics": null}}, {"review": {"des": "So I just got back from the Bryn Mawr Breakfast Club.  For a very popular restaurant, the wait wasn't too bad.  We asked for a table for 6 and were seated in about 15-20 minutes.  Everyone seemed happy with their orders.  The presentation of each order was fantastic.  It was easy to get food envy looking at the other plates .<br><br>I would give them four stars, but I'm docking them for two things: <br>1. They can't do separate checks.  It's becoming a rarity for a restaurant NOT to do separate checks, so this was a disappointment.<br><br>2. They could only accept two credit cards per table.  For a group of six ladies, we were lucky that each of us had enough cash on hand to manage this.  I mean, who carries cash these days? <br> <br>I ordered the Sourdough French toast, which satisfied my sweet and savory cravings at the same time.  I would order it again.  Coffee was refilled regularly.  One person's order was supposed to include scrambled eggs and came over-easy.  She didn't make a fuss about it, but it would have been nice for her to get what she ordered. <br><br>Once we were finished eating, they really wanted to turn the table.   Sure, there were a lot of people waiting outside, but it's nice not to be rushed.  We left almost immediately after having paid the bill.  I think if circumstances were different, we may have hung back for another 10-15 minutes and finished off our coffee. I love great food, but enjoying the atmosphere and the company are just as important.   I'm not docking them for this, as I understand the need to turn the tables, but if you're looking for a place that will let you hang out for a bit drinking your coffee after the meal, this isn't it. <br><br>I would go back, but with 2 caveats: 1) Bring cash 2) perhaps with less people so sorting out the check is less of a hassle.", "pics": null}}, {"review": {"des": "Cute Farmhouse themed restaurant! They are very consistent with their dishes! The staff there is very nice.", "pics": null}}, {"review": {"des": "I've always wanted to check out this place and it seemed the perfect choice for catching lunch with a friend. I have to admit one of the other reasons I wanted to check this place out is because they have pajun on the menu. Whuuut? What's a Korean scallion pancake doing on a breakfast menu? Who cares?! It's served with two eggs of your choice (over easy for me), potatoes and a hash of brussel sprouts and porky belly. It was the bomb. <br><br>My friend got benedict divorciados, a special for the week served with pulled pork and rice. It looked amazing. We both cleared our plates and our bellies were happy. This little unassuming spot is serving up some breakfast realness. It's a mixed crowd of patrons. No complaints about service from me. <br><br>I'll be back. Biscuits & gravy are calling my name...", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9ZCGVJsolX0V43B4ASk6NA/348s.jpg", "caption": "Pajun pancake! So good!"}]}}, {"review": {"des": "This place was delicious!  I'm not quite as excited about having to wait to be seated on a Monday morning (what are all these people doing here?!) and the location is a bit blah.  So, overall, 4 stars seems about right.", "pics": null}}, {"review": {"des": "Fresh, flavorful, satisfying, I've been here plenty of times tried the sweets and the savory and walked out happy every time. The coffee is always super fresh the staff is always very friendly and luckily now they have a bigger space than before to accommodate more guest and a slightly shorter wait.  You certainly have to get there by 9 AM because anything after the wait will be a few minutes.<br>Theres no bad choice the skillets, French toast, pancakes, the specials. I've tried those as well to me they could do no wrong and that's something you don't find often in a restaurant .the carne Asada skillet is to die for I always go back-and-forth between that and the green chilaquiles. Needless to say I'm a big fan it's always been a good experience for me and hopefully it's the same for you.", "pics": null}}, {"review": {"des": "I have had this place bookmarked on yelp for quite a while now and finally I woke up on a Wednesday , off work and the sun was shinning bright - I said to myself - let's look at my bookmarks and pick a cozy place for a nice breakfast with options for hot cakes and french toast - Bryn Mawr breakfast club stood out and 20 mins later I was seated at a cute little table by the kitchen. <br><br>You walk in and you can tell it's a popular neighbourhood diner , for 930 AM on a Wednesday morning it was pretty busy but I was seated right away. The server was very pleasant and kind , he came right away with a water and the delicious house coffee followed next as I sat there going Uber the menu. They have a regular menu and a special menu. He walked me through both menus and told me his favourites ( Love it every single time when people from the business tell me their favourites ). <br><br>After some discussion I decided to order the spicy Jamaican omelette which has shrimp , cilantro , mango chutney and avocado as main ingredients and half an order of the their french toast with sour cherry and cream ( yes they do half order of the hot cakes and french toast - perfect dessert for breakfast / brunch ). <br><br>As I waited for the food to arrive the coffee cup was never half empty , the servers are great in making sure you've got coffee in your cup all the time. <br><br>The food arrived within 10 minutes and the rest is something that my taste buds will savour for sometime to come. The Jamaican omelette was just , to put it simple and  make a statement - DELICIOUS. The mango chutney added the perfect flavour to the omelette , every bite was  a mix of freshness with avocado and savoury with the spices. The potatoes on the side were crisp and fresh which adds to the flavour. <br><br>Dessert time started with the french toast. I'm a big french toast fan and I set very high standards ( bongo room weekend french toast is where I set the bar ) and this place definitely met those standards and surpassed it then. The toast was soft and fluffy and the fruit addition with sour cherry was the perfect combination of zesty and sweet. Half an order was all I needed and it was just perfect amount of satisfied and still wanting more with not stuffing myself. <br><br>I was a happy man by this time. As I paid my bill I stopped by the kitchen to thank all the people making this meal so delicious every single day for every single person. <br><br>This place is definitely worth the drive no matter what part of Chicago you are from. Great staff and delicious food - Bryn Mawr breakfast club", "pics": null}}, {"review": {"des": "I'm so glad I found this breakfast restaurant. Being vegan it is hard to find places to eat breakfast but their Acorn Squash breakfast plate is delicious and filling. The staff is attentive and helpful.", "pics": null}}, {"review": {"des": "This is my favorite brunch spot. It's super cute inside and the colorful mason jars always have fresh flowers. You can expect lines to be out the door and around the corner weekend mornings so I suggest going during the week. I get the skirt steak skillet every time I go and it's amazing- delicious, lots of food, and keeps you full.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dIsU81i5SFi1pW6PQ9i4XQ/348s.jpg", "caption": "Skirt steak skillet, house potatoes, bacon, french toast."}]}}, {"review": {"des": "Pretty darn good!  Had the pulled pork breakfast torta and the skirt steak skillet for the hubby.   Great flavor on the pork!!!  Steak cooked perfectly!!  Just like I would make at home but in a neighborhood diner.   So many deliciousness on the menu.  Can't wait to go back n try some more!  <br><br>Service was great!!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/22o69kVN5uPC-89QFnHDzw/348s.jpg", "caption": "Cajun shrimp Benedict"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_HeJS-xLdWYt-URRTnTDIA/168s.jpg", "caption": "Bread pudding French toast!!!  Amazing!!!! N I don't even like sweet breakfasts"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IeyyOBVfY9ntp2MdHNjILw/168s.jpg", "caption": "Pajun pancake (scallions). Delish!!!"}]}}, {"review": {"des": "We got here on a Thursday morning and we're seated right away. The waiter was quick and the food was served quick too.<br><br>Reading what yelpers ordered, I had gotten the banana bread pudding and my boyfriend got the Mayan dish. The banana bread was good, it was flavorful on its own with some kind of cream in between. I the pudding is very sweet, but if you don't have a sweet tooth, I would rec getting something else. The fruits were fresh and tasted very refreshing with the banana bread. <br><br>The Mayan Benedict was also very good. It was a little too spicy for me but my boyfriend enjoyed it a lot. The chorizo with the salsa and avocado were cooked well and complimented each other nicely. I will def come back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/t0FHYiAk30P3wGUb-3uQMA/348s.jpg", "caption": "Mayan Benedict on top, banana bread French toast on the bottom"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0Dy8lGaw9I2rNZ-VzW7WPQ/168s.jpg", "caption": "Banana bread French toast"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/48zUfJZxbbwgRAuGhiQ76g/168s.jpg", "caption": "Mayan Benedict"}]}}, {"review": {"des": "This place was in incredible! <br>This place was packed but we were seated and greeted right away. You're surrounded by a wonderful smell that's a mixture of traditional breakfast with a mexican twist. <br>The coffee was a local bean and we ordered the chorizo skillet and biscuits and gravy with poached eggs.<br><br>Omgggg those biscuits were perfect! And pulled apart like a pillsbury commercial! I got poached eggs and laid them on top to break on top of the gravy and soaked in the biscuits.<br><br>I was really jealous of my boyfriends chorizo skillet though. I love chorizo and this was amazing! So flavorful and tasty.<br>Let me just add, we barely even waited 5-10 minutes for our food. So they serve you quick! Which is great because people are constantly coming in all morning. Next time I want to try the stuffed French toast... because WHY NOT?! This is a genius idea! <br>This is a must try place!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RRa8sHvMLPsaUSSnChhnBg/348s.jpg", "caption": "Sausage gravy and biscuits with poached eggs"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ilcu-N7pzdOGxzNRo-UhuA/168s.jpg", "caption": "Chorizo skillet"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VfG5z4hdJUbHhTW3DKvF_Q/168s.jpg", "caption": "A delicious cheesy bite of the chorizo skillet"}]}}, {"review": {"des": "I came here with my grandpa on a Monday morning at 10:00 am. It was very busy for a weekday. We were promptly seated, but the influx of people was consistent and the restaurant soon filled up. The space is nice and bright with a welcoming environment. <br><br>The service here was good. Our server was friendly, although he didn't speak much. Our water and coffee cups were always full. <br><br>The food came out fast and was great. I tried the kiwi and blackberry French toast after seeing photos of it from other reviewers. I was not disappointed! The bread was delicious, the fruit portion was fair, and the blackberry compote (?) that surrounded it was sweet but it wasn't too overwhelming. My grandpa got the salmon platter which came with all the fix ins for a bagel and lox, as well as potatoes. He really enjoyed it.<br><br>Neither of us were able to finish our food so we left happy and full! Prices here overall are pretty average. Each breakfast entree was about 11-12 dollars. <br><br>I imagine on the weekends there is quite a wait, considering how busy it was on a weekday. Overall, wonderful breakfast spot. I'd come back for sure.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9-2uYl12o91ytOFtwLFQYw/348s.jpg", "caption": "blackberry kiwi French toast (and salmon platter in the back)"}]}}, {"review": {"des": "Love this neighborhood spot! Good food, good service! Decadent sweet breakfast. Delicious savory dishes. It recently changed locations and the new space is cozy but spacious.", "pics": null}}, {"review": {"des": "My in-laws leave 3 blocks from the Breakfast Club and when I had a 3 month training in North Chicago I kept seeing long lines at this restaurant. So one day I went by myself to try their food...BAM! I was hooked. Then brought my cousin along...BAM! He got hooked. Now every Time I visit I have to go before leaving back to Texas. I never have been disappointed with whatever I have picked on the menu. It is my new tradition when I visit. It is a must.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6WBugKqOEV_zfXFEjlns9w/348s.jpg", "caption": "Yummy goodness! No syrup needed."}]}}, {"review": {"des": "The food was very tasty. <br>Food came very fast super friendly hostess. <br><br>M", "pics": null}}, {"review": {"des": "Amazing brunch!! Bottomless coffee really means bottomless... you blink and someone is refilling again already. The food is GREAT! And the service matches that quality... my family will definitely be back!", "pics": null}}, {"review": {"des": "The menu is really interesting. And the coffee improves since I was there previously. Now they have regular and nitro cold brew on tap, and the hot coffee is good, though a .medium roast.", "pics": null}}, {"review": {"des": "The best breakfast we had it all ways... to the best always and really testy food ever ever", "pics": null}}, {"review": {"des": "Great food. A balanced mix of traditional American and Latin meals. Burp Nitro coffee on tap.", "pics": null}}, {"review": {"des": "In a word: basic.<br><br>This is one of the only restaurants in the area so it's a local favorite but it's kind of mediocre and overpriced. Been here a few times due to lack of other options and today's visit will be my last visit.<br><br>I ordered a \"black bean azteca bowl with chicken\" that was described as black bean chili with grilled chicken and avocado. I was served a bowl of brown rice with a scoop of black beans, a scoop of salsa, chicken, and avocado. Sorry but a scoop of beans and a scoop of salsa is not chili. If I had known it was mainly rice I would not have ordered it. And if it's just a scoop of this and that, why did it take 30 minutes to prepare? I would've sent it back but I was so hangry at that point, I decided I didn't want to wait another 30 minutes for something else that's probably going to be a disappointment. I just wish the mediocre, misdescribed item I ordered hadn't cost me over $16 once taxes were included.<br><br>All of you praising this place with 4 and 5 stars must not be able to boil a pot of water on your own, because things like eggs and other breakfast items are NOT hard to cook.", "pics": null}}, {"review": {"des": "I've been coming here for years, and I live two blocks away. Today we found a cooked moth in my girlfriends veggie skillet. Pretty disgusting, I now have anxiety eating here... Probably will pick another place for breakfast", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sqA-ztNXKoHL6lAJChKTMw/168s.jpg", "caption": "Found a moth cooked in our veggie skillet. Pretty disgusting, been coming here for years unfortunately this gives me anxiety eating here now"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1eJ_selwbZ7BdeSZ7gVsHg/168s.jpg", "caption": "I've been coming here for years and I live only two blocks away. Today my girlfriend and I found a moth in her Vegetable skillet"}]}}, {"review": {"des": "GO NOW!<br><br>Good breakfast places are often difficult to find, and excellent breakfast places are truly rare. This one is a rare find, my friends.<br><br>While the wait for a table for two was about twenty minutes, it was definitely worth it.<br><br>The food here is among some of the best breakfast fare I've ever had anywhere, with a truly unique and inspired menu filled with so many diverse options a return visit is all but inevitable.<br><br>Not only was the carnitas skillet with potatoes and home made Verde salsa on the side,  (available upon request), just as good as similar dishes I've had in the Southwest US, the custom blend of specially roasted coffee they have on tap is perfect.<br><br>The service here was impeccable. This is truly a crew who knows what they're doing, and it shows.<br><br>Oh, if you get the chance, try the key lime pie French toast! They'll bring you a half order to share if you ask nicely, and I found that a little bit definitely goes a long way. WORTH IT!<br><br>Cheers!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/h1_CYTFu5xI0gGl7Th5rtA/348s.jpg", "caption": "Key Lime French Toast!!"}]}}]}