{"name": "buckingham-fountain-chicago", "reviews": [{"review": {"des": "The coolest water fountain I've seen.<br><br>Buckingham Fountain was dedicated in 1927, a gift to the city from Kate Sturges Buckingham in memory of her brother Clarence. It was constructed at a cost of $750,000, which would be equivalent to $11 million today. You know somebody's loaded when they spend 8 figures building a fountain!<br><br>Clearly this isn't any ordinary fountain. Buckingham Fountain is made of Georgia pink marble and is inspired by the Latona Fountain at the Palace of Versailles. It contains 1.5 million gallons of water, pushing 14,000 gallons through its 134 jets every minute. The fountain represents Lake Michigan and contains four sets of elaborate sea horses representing the four states that border the lake.<br><br>Due to Chicago's harsh winters, the water is operated only half the year - from April to October. At the top of every hour, a 150-foot geyser spews from the top basin for 20 minutes. And at night, the fountain is illuminated by 820 colorful lights and plays music. A singing fountain!<br><br>The wife and I weren't able to make the night show, but even during the day, the fountain was quite a sight. The location is also perfect - it's situated in a huge courtyard in tree-lined Grant Park, with the lake on one side and skyscrapers in the background on the others. There's pretty much no bad vantage point for the beautiful fountain that's considered Chicago's front door.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/j0Wl-g3YmGFiK4Yz5lYNeg/348s.jpg", "caption": "The fountain on an overcast day"}]}}, {"review": {"des": "I have a thing for fountains. They are big, beautiful, and they shoot water which is basically an added bonus. I visited Chicago 2 weeks back and decided to check out Buckingham Fountain at night. Why night? Because what's cooler then a giant fountain shooting water in front of a beautiful city skyline? The fountain itself is absolutely breathtaking. Not only is this giant structure big and beautiful but it illuminates at night added to the effect. On top of the fountain itself there are several different statues placed inside of the fountain to give it even more to stare at with wide eyes. Around the fountain you can find people selling flashing necklaces and various other similar things for kids, a few places to get a hot dog/hamburger or a drink, and some washrooms in case the fountain makes you have to go. <br><br>Overall, this fountain gets 5/5 from me. It's truly a must see if you plan on visiting Chicago and if you are reading this review you probably are!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FtBj4oFXpGd1w5LnaIRIVg/348s.jpg", "caption": "Simply beautiful."}]}}, {"review": {"des": "An iconic Chicago landmark for good reason. This tops my list of fountains that I've seen worldwide, up there with Trevi fountain in Rome! It's an architectural masterpiece, with beautiful water spouts from all angles. Grant Park is such a nice area that usually isn't as crowded as Millennium Park. There is a lot of open space around the fountain where you can usually find ice cream vendors. Benches surround the perimeter of the fountain, and it's walking distance to other downtown landmarks and the Lakefront. <br><br>Pay attention to the fountain hours for when the water is turned on, and every hour there is a water show that lasts for about 20 minutes. Bonus - the colors of the fountain change at night! Best place for photoshoots during the morning when there are less tourists.", "pics": null}}, {"review": {"des": "The fountain is nice. The park around it is nice. The lake nearby is worth the visit. If you want a spot that is centrally surrounded by other attraction but still maintains some grace and tranquility then here you are.", "pics": null}}, {"review": {"des": "Such a beautiful spot to stop and take a break at. It is majestic and the sound of the water is so calming in the middle of a big busy city. The architecture is something to really pay attention to the detail as there are many cool features. There is a lot of open space around the fountain and the several occasions ive visited it hasnt been crowded at all. I find it to be in a quieter area of the park though. Sometimes they do have cool events here. This is classic Chi Town that you must see!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/B5nhnUDgQr-eFXMKT9nbhw/348s.jpg", "caption": "The fountain"}]}}, {"review": {"des": "It is a gorgeous fountain and a great photo opportunity. On a hot day, the spray from the fountain is most refreshing. And the park it is in is wonderful as well. Easily accessible from some of the other Chicago attractions either on foot or by vehicle it is near the water and is a great sight to see.<br><br>There is a cafe near the fountain, and often festivals take place nearby. Not far from the museums, this is a nice spot to stop and reflect and observe.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ebaUphS30NZSwQM5ACKCsw/348s.jpg", "caption": "Wonderful to see!"}]}}, {"review": {"des": "\"Well it's not the Bellagio....\" I happen to  overhear the guy nearest me say, just as I'm re-appreciating this landmark. <br><br>Haha! I never thought to compare. I guess this 1927 French-inspired masterpiece just wont do!  Anyway, turns out he gave me a great idea. Thank you, baby. Thank you very much. <br><br>It's not that other \"Buckingham Fountain\" over the pond neither. <br><br>My review is about a magnificent fountain in a magnificent city, and I've known it all my magnificent little life. At one time, when I was little, I actually thought it WAS named in honor of England's Buckingham Fountain. \"Queen's Landing\" is just east on the lakefront and is where Queen Elizabeth herself set foot on Chicago soil in 1959....marking the first time a reigning British monarch visited Chicago, and right there in view of our Buckingham Fountain! <br><br>Fast-forward to 2018...then along came Megan Markle. She landed a prince! And that \"Duchess of Sussex\" has been the headline ever since: all about her love and marriage, likely soon to be married with children. And we already know of this fountain from Al and Peg's love and marriage!  And then we come to learn how Markle grew up behind the scenes of that very show, (her father, the lighting director.) So, back to the association with British royalty. Ain't it strange! <br><br>In reality, this fountain IS about Love. It's a memorial - a sister's tribute, Kate to her brother, Clarence Buckingham. Cool facts: the fountain itself is symbolic of Lake Michigan. The seahorses represent the states that border the lake and specifically, this fountain was inspired by the Latona Fountain at the Palace of Versailles. (Wikipedia-sourced info) <br><br>It's stunning. I forget how beautiful it is. There are light shows after dark. There's a little eatery, \"Buck's\" open during the day. The wide-openness here is reminiscent of European plazas/gardens.  I forget this ... I too have been spending more time over by Millennium Park where everything is fairly-packed in. I like the ample space here. <br><br>Buckingham Fountain: not one bit the Bellagio, but every bit: sweet home Chicago. It inspires me. Grab a penny. Make a wish. <br><br>Catch a plane?! <br><br>Vegas, baby! <br><br>PS- Water shows occur every hour on-the-hour and last 20 minutes. During shows, the center jet shoots up vertically to 150 feet (46 m), and after dusk shows are choreographed with lights and music. The last show begins at 10:00 p.m. nightly. (Per wiki)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fH99saBqwRohLJH2MrQSYg/348s.jpg", "caption": "5.24.18 JPMorgan Corporate Challenge (run :-) SO BEAUTIFUL!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/y0_3S_sAE4pyWIzGOT_EWw/168s.jpg", "caption": "There goes Summer"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jjA35kBVxPJg0vROQ1tCtQ/168s.jpg", "caption": "Mother Nature steals the light show 7.17.15"}]}}, {"review": {"des": "Like the Willis Tower (former Sears Tower) and The Bean (Cloud Gate) sculpture, the Buckingham Fountain is an iconic Chicago landmark and one of the largest of this type of fountain in the world.  While perhaps not as well known and flocked to by tourists as the two aforementioned sites, the Buckingham Fountain has been in operation since 1927 and one cool fact is that, once it was computer controlled, it was operated remotely by a computer that was located in Atlanta, Georgia until smaller and better computers allowed them to install one in the pump house adjacent to this fountain to control it.<br><br>If you'd ever seen the opening credits of the TV Show \"Married with Children\" back in the day, or the clip from the original \"National Lampoon's Vacation\" movie that shows them driving from Chicago in the Wagon Queen Family Truckster, then you've seen the Buckingham Fountain.<br><br>Come here for a 20 minute water show every hour on the hour, and at night for fountain shows that are choreographed with lights and music.", "pics": null}}, {"review": {"des": "Iconic, we did a drive-by but have been coming here for years as we have a place down the street! It's definitely a sight to see while exploring Chicago! It's a grand old fountain, great for pictures and so very beautiful. The Taste of Chicago is a great time to visit!<br>Don't miss this Chicago classic.", "pics": null}}, {"review": {"des": "I never NEVER come to Chicago without visiting this fountain.  It is gorgeous day and night ..  night is by far my fav. The city lights .. the fountain changing colored lights and synced to music.  This fountain is in Grant park across from Lake Michigan. <br>       I'd been to Chicago several times but this was my pug Pnut and my moms first visit.  Both loved it .. we walked here easily from our Hilton hotel which allowed small dogs. We could see the fountain from our hotel room .. it was across from grant park.", "pics": null}}, {"review": {"des": "Such a gorgeous fountain and surrounding gardens..with a view of lake Michigan as well! Lots of people biking and walking around on the weekend. Not a whole lotta shade around. Wear your sunscreen and wear a hat so you won't look like Rudolph like I do.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TSPv_eJvPL9Hcp4NT07Zcw/348s.jpg", "caption": "The main fountain"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Tfm_ThfejvKTn13C2qTFEg/168s.jpg", "caption": "Beatiful smaller fountains on the sides"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/asGT8oRHzFMkhsGM8zRA3A/168s.jpg", "caption": "Beautiful garden around the fountain"}]}}, {"review": {"des": "A Chicago icon located in Grant Park.  It is definitely worth the visit day or night. <br><br>What did I learn today?  At night the colors of the fountain change.", "pics": null}}, {"review": {"des": "One of my favorite things to do when it is warmer out is wander around downtown Chicago and you know I gotta visit the, in my opinion, legendary Buckingham Fountain.<br><br>When I was a young hooligan my gal pals and I decided it would be a fun idea to climb the barrier and play in the water, but shhh don't tell anyone!! haha. <br><br>I am sure most people are familiar with the fountain via 'Married With Children', \"Love and marrrrriage, love and marriage.\" <br><br>I highly recommend visiting at night so you can really appreciate it in all it's glory, plus you'll get to witness the pretty lightning. <br><br>Chicago staple.", "pics": null}}, {"review": {"des": "Location - By the lake. <br><br>Architecture - Enormous, beautiful, pleasant. Plenty of photo opportunities to take without tourists around. A fence surrounds it to prevent crazy kids like me from climbing onto it.<br><br>Definitely worth a stop while strolling through Grant Park. Much less crowded than other architectural attractions.", "pics": null}}, {"review": {"des": "The fountain of broken dreams the fountain of youth the fountain of buckingham the fountain of mystery the fountain of eternal life yes we get it there is a million fountains everywhere you look but only a handful of them are this awesome!<br><br>The colors here at night are sooo beautiful as the fountain is ever so changing to different ones every so often so much so that you loose track and get lost in the ora of all the awesomeness that is this fountain!<br><br>We randomly stumbled upon this fountain as we were walking around the area looking for a place to park it came to the point of where we ended up finding one close to here and walking farther to our destination just so we could see this awesome fountain up close and oh how it was mesmerizing to just hear it and see it all lit up!<br><br>Overall it's just a really big fountain but if your a sucker for anything water related like I am then you will definitely enjoy your time here just make sure you throw a penny or two in so that all of your fountain wishes may come ever so true!", "pics": null}}, {"review": {"des": "This huge fountain is an icon of Chicago. A must-see place, especially at night when there was a show of light and music on the water. It is good to take a picture or two in this place, but that is all about it. Otherwise, it is closed to many other attraction places around downtown Chicago and the Lake of Michigan like the Art Institute of Chicago, Navy Pier, and Shedd Aquarium.", "pics": null}}, {"review": {"des": "Great Chicago landmark to tour and escape too. If you are a Chicago resident or a tourist out of town there is always something to do or see by this beautiful fountain to enjoy at in either day or night time!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VrSOxHxEAFEcC-flMonL0w/348s.jpg", "caption": "Snapshot summer."}]}}, {"review": {"des": "Man, I don't know what it is about this, but I came here by myself on a Thursday afternoon and I was completely smitten by this fountain, if becoming smitten to a fountain is a thing. <br><br>I just thought it was sooo pretty. Grant Park itself is just a gorgeous public space- there is literally so much space for the public to stroll around and soak in the green plants and blue sky (on a nice day).<br><br>I came at the right time when the fountain was just in the middle of displaying its water \"show.\" <br><br>(**tip**: every hour, the fountain has a water display/show, where the center shoots out water to about 150 feet into the air for 20 minutes)<br><br>So yeah, that's what I first walked into, then I walked around and stayed for another hour and saw it again. It's really so cool and beautiful seeing the fountain against the city skyline. And the fountain itself is just amazing- look at it closer so you can see the French-inspired detail, and look at it from further away to see that picturesque view of it with the skyline.<br><br>I would go back here once in awhile, just to sit there and stare at this beauty and be happily in my own thoughts on a nice, calm day.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JQ7hIkrEGPYZdH37ROk5jg/168s.jpg", "caption": "is a beauty!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kUfZfURDvh7IN3ZJ9MAKbQ/168s.jpg", "caption": "water display! - that's 150 feet into the air"}]}}, {"review": {"des": "\"Love and marriage....love and marriage... go together like a horse and carriage ..\" That song will usually trigger a visual image of this lovely fountain. It has a rich history which I'm sure you can find on Wikipedia :) <br><br>Our proud city's awesome Buckingham Fountain is a Chicago landmark in the center of Grant Park which was dedicated in 1927 and is one of the largest fountains in the world (supposedly). If I'm wrong, I apologize for the misinformation. <br><br>This a great place to chill, walk, take pictures, or even run. At night or even in the day time, it's gorgeous. They host events around the fountain sometimes too. <br><br>If you're a local or just visiting, get your arse (yup i spelled it right ;p ) down here! It is a must see. <br>Happy travels!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fBvZK3SqcCPKKS4BjsTH4Q/348s.jpg", "caption": "Rainbow at the top!"}]}}, {"review": {"des": "I know its Chicago but visiting this place during the summer, its just too hot and boring. No shade, hot sun beating on the brick ground and you cant even get that close to the fountain. I was told this was a must see and all I thought was I must get out of here before I pass out from the heat. So let me think, what if it was cold or if the weather was perfect? Meh. I still don't think it is a must see. Really wasn't impressive at all even though pictures online somehow make it look wow. Personally, I think Crown Fountain in Millennium Park is much better and the \"must see fountain\" of Chicago. Why? Cool Artwork going on and its an interactive fountain. I wouldn't come back to this fountain unless I was just there in the area.", "pics": null}}, {"review": {"des": "I passed this when I was on the Big Bus tour and made a note to self that I will go back for a closer look. I could see the fountain from the skyline view at Adler Museum on a late spring afternoon.<br>Up close it's a beautiful fountain, and a park to have a stroll at. Walking distance from Millenium Park too. <br>I was told that the view here is more spectacular in the evenings.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6t2nE0wkiQNM6ZswWgXRnw/348s.jpg", "caption": "Buckingham Fountain"}]}}, {"review": {"des": "Unfortunately the fountain was turned off...I assume it is seasonal.  The fountain was huge, great architecture, and magnificent! 5 mins walk from the water and 20 mins walk from Willis tower (Sears tower).  No free parking.", "pics": null}}, {"review": {"des": "This is a beautiful fountain that inspires by the similar fountain at the Palace of Versailles, Paris. It is geometrically locates at the Grant Park center of the City of Chicago next to Lake Michigan. It is a door way to welcome those who travel by the water to Lake Michigan enter the city.<br><br>The fountain water active from April to October. I was curious how it look when it cover in the snow at the winter. During the summer, this is the destination to visit. Daytime is great to see everything in detail, but night time is more spectacular. When the aesthetic light is up and the fountain is dancing, it make a difference perspective to look at it with the city skyline at the backdrop. The music will guide the fountain to dance. Color is changing every movement. <br><br>This is the great place to visit, it only requires half hour. But you can spend the whole night there.", "pics": null}}, {"review": {"des": "I visited this wonderful fountain on my first trip to Chicago, 5 years ago. I didn't spend much time staring at it though so this experience still felt new. <br><br>It really is something!! <br><br>I recommend taking photos around the whole thing because you're background will never be the same! And if it's windy (hahahaha IF?!!!) then you will get some nice cast off from the fountain which is nice if it's hot out!", "pics": null}}, {"review": {"des": "It's much bigger than I thought!<br><br>And it's also much farther than I liked. In the middle of Grant Park is perhaps Chicago's most famous fountain, the Buckingham Fountain, which is easily one of the grandest fountains I have seen! The massive scale, the detailed sculptures, and the insane amount of water work involved make this fountain an impressive sight to behold. Time your visit right, and you may see this fountain become Old Faithful and eject a ridiculously tall water spout at the top every hour! Come at night, and you'll be treated with a light show on the hour too.<br><br>Unfortunately, this fountain can be a walk from the nearest bus or L station, and the walk through mostly empty space is rather dull. While I would not consider this as a must-see sight, Buckingham Fountain is worth checking out if you have time!", "pics": null}}, {"review": {"des": "Located in the middLe of Grant Park, you can't miss it!!<br><br>The huge water dispLay that is known as Buckingham Fountain is absoLuteLy FREE.<br><br>The visit here aLLows you to kiLL some time, take a few romantic photos, and [depending on the Chicago weather] aLLows you a bit of a cooL down with the mist that gets bLown off.<br><br>I'm not too sure about any \"water show\" because during my visit there wasn't anything out of the ordinary happening beyond water shooting up reaLLy high from the very tip top of the fountain. <br>BeautifuL nonetheLess but absoLuteLy no show.<br><br>DefiniteLy worth checking out since the price is definiteLy right!", "pics": null}}, {"review": {"des": "Buckingham Fountain is located within Grant Park, it's one of the largest fountains in the world and its worth to stop by and see. I went during the day before my flight so I didn't get to see the water show that they have after sunset. Another reason I need to come back.  With Lake Michigan in the background and the city skyline, it's a sight to see. <br><br>Fun Fact: The fountain is a representation of Lake Michigan and the 4 sea horses are for the 4 states (Illinois, Indiana, Michigan and Wisconsin) that border the lake. Also, it is a Chicago landmark.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/isaephkEOJLIMwRE5XT-DQ/168s.jpg", "caption": "Lake Michigan"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kBYXR051WhmTzs9368ZU0w/168s.jpg", "caption": "From afar"}]}}, {"review": {"des": "Sick fountain brah. <br><br>Cost? Free-99. Yep it's free. <br><br>How to get here? It's situated dead center of Grant Park. or if you're coming from the loop, take Congress Parkway and walk towards the lake. If you get to the lake you've gone too far, turn around and look behind you. It's hard to miss. <br><br>Buckingham Fountain... Probably the largest fountain I'd ever seen. During the summer this thing sprays like no other. In the winter time, not so much. In fact, they drain the fountain. Aside from checking out this landmark, definitely come for the classic Chicago photo op.<br><br>Plenty of angles to snap on this one. One with the fountain, one of the fountain, one with the fountain and the skyline, one slow-mo, one for instagram, one for snapchat, one for yelp... just make sure to cover all the bases. <br><br>Word on the street is this is a cool one to see during the night. I'll need to make a trip out to see this summer. Anyways, have those cameras ready.<br><br>'Til next time, cheers!<br><br>103/365", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1FgSuTUDaBjCsqmVBAEHtA/168s.jpg", "caption": "\"water, water, water, water\" -ugly god"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dEM-HljM4XYTi2j7Y_HX8A/168s.jpg", "caption": "drip. splash."}]}}, {"review": {"des": "Loved how this section was dog friendly. Unlike when visiting the bean, our dog was welcomed here. That is an important factor when traveling with a dog. The fountain is absolutely beautiful and it feels great with the blow back mist.", "pics": null}}, {"review": {"des": "Beautiful construction, very wide open brick walkway all around, and nice landscaping to brighten it up a bit.  However, I'm sure this would look a lot better if the water was turned on.  It was mostly bone dry when I arrived, and was probably only showing moisture because of the previous night.  I can imagine that it looks rather majestic and worthy of a Buckingham name if the water was currently flowing, so until then, I can't give the full review on something that I didn't fully see.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/d-6ybhi1vTjNT8o411uhjw/348s.jpg", "caption": "Probably looks better w the water on..."}]}}, {"review": {"des": "Watch out for the wind because you will get sprayed based on the wind direction!<br><br>To be honest, it wasn't AMAZING. It is one thing tourists always make their way down to Grant park to see. How much can I say about a fountain? I went during the day with my friend. I would recommend going after sunset if you are not worried about being out at night. If you want photos WITH the fountain, they may look better during the day. If you just want a photo of the fountain with its nice glowing lights, go at night! Even at the peak of travel season, the fountain was not super crowded.", "pics": null}}, {"review": {"des": "I loved this beautiful fountain. It was such a great treat to come here and see it in all its glory. We had the privilege of watching it's water show too.<br><br>Built in 1927, it allegorically represents Lake Michigan along with the 4 states that surround it - Indiana, Illinois,  Michigan, and Wisconsin, respectively. The 4 states are represented by the 4 seahorses inside the fountain. It is one of the biggest fountains in the world has a water capacity of 1.5 million gallons.<br><br>It is located in Grant Park and the fountain operates from April to October. Come here during the warmer months to see it! It's totally worth it for all ages.", "pics": null}}, {"review": {"des": "A beautiful large fountain in Grant Park, walking distance from all the tourist hot spots. It sits near Lake Michigan and the Navy Pier. The fountain is beautiful and a historical landmark in Chicago. At night there are usually lights (closes at 11 I think so get there beforehand). You can stop by on your way to the lake and walk up to the navy pier to enjoy more water!", "pics": null}}, {"review": {"des": "A Chicago landmark. It's quite a walk from the bean which if you are a tourist will undoubtedly by your first stop in Grant Park. When I say quite it's really not that far but farther than expected and than it looks on the map. Pretty expansive impressive fountain. I have seen photos and heard there are lights at night which I have been meaning to check out. Very beautiful and looks out over Lake Michigan and lake shore drive.", "pics": null}}, {"review": {"des": "Both the BF and I have a thing for fountains. I cannot even tell you how much time we spent watching the Bellagio Fountain shows when we were in Vegas earlier in the year. I think we stopped every single time we walked by to watch the show. <br><br>The Fountain itself is really, really big and also very pretty. But I felt a little deceived by the website that said there was a \"major water display\" every hour for 20 minutes. The display is basically the middle of the fountain shooting a stream of water at the height of 150 feet into the air. It's cool, it does shoot water pretty high, but I was kind of expecting something more? <br><br>They do have a spectacular light and music display at dusk, so maybe that one is more impressive. We didn't end up waiting to see it, as we were both tired and hungry from spending all day out and about. <br><br>I think the Fountain is definitely a really nice spot to visit when you're in Chicago. The walk through Grant Park is also very nice. We went very early in the morning (9am) and then again later in the day (5:30pm). The difference between the two times is drastic! Later in the day there are definitely a lot more people and you don't get as much \"alone time\" with the Fountain for photo ops. I highly recommend going earlier in the day!", "pics": null}}, {"review": {"des": "Chicago... you are so beautiful! The city truly invests quite a bit in its public displays of art. That's something that other cities should start doing. Seriously though it brings people from all over and people in Chicago to be outside. The only other place that you can see displays like this would be in Europe but that's also because they have been there for hundreds of years. <br><br>The Buckingham Fountain is by the Millennium park just along the same walk way you go to see Cloud Gate (the bean) or heading south to the aquarium. You won't appreciate its enormity unless you go up to it. It makes for a beautiful picturesque background so if you and your friends/family want a place to get some pictures this is it!. You can easily pick up an uber here as well so if this is where your walking ends, just call one up and there's a pick up area just by the fountain (easy peasy). <br><br>This is also a must see \"monument\" so make sure to dedicate some time when walking around here to see the fountain!", "pics": null}}, {"review": {"des": "Buckingham Fountain is a Chicago Icon! Who doesn't like the Fountain?! Who?! <br><br>My fav is visiting when it's full blast and lit up in colors on a Summer night. With traffic speeding on by on LSD, the Fountain seems to stop time, and it was iconic before the Bean. Respect the Fountain!", "pics": null}}, {"review": {"des": "Great landmark to visit on a hot day. Fountain shoots water and sprays you like sprinklers. Kids love it. Great for pictures. Bathroom nearby and snack stand too. Great for tourists.", "pics": null}}, {"review": {"des": "This place has an outstanding view of buildings and general scenery. I took my daughter and wife here for a vacation and they had a great time in Chicago. It's one of the larger fountains and it's a great Park area to play. You can typically take pictures next to the buildings or with the fountain and the buildings in the background. There's typically always in the ice cream lady around there too so it makes it a nice treat to grab and walk around the fountain", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SgG2gytlV5tW7Ln0Rg-LdQ/348s.jpg", "caption": "Buckingham Fountain"}]}}, {"review": {"des": "A land marks the spot. Scenic like they mean it. Water shooting high and low, tons of traffic all down below. The Chicago landmark on  the LSD. LAKE SHORE DRIVE, STILL THRIVES, YO.", "pics": null}}, {"review": {"des": "The fountain from the opening credits of \"Married With Children\". <br>Tip: The top fountain activates at the top of the hour.", "pics": null}}, {"review": {"des": "The Husband and I stopped by Buckingham Fountain while in Chicago because it's almost impossible NOT to stop at it!<br><br>He said it was from the opening credits of Married with Children, but I never really liked (and was a little too young) the show so that wasn't a big deal to me.<br><br>The fountain itself is really pretty and huge! The spray of the main fountain in the middle gets higher and lower throughout the day depending on when you come. It has a beautiful view of the city from one side of the fountain and the lake on the other.<br><br>There is a beautiful brick walkway around the fountain as well as a few benches placed further out if you want to sit down and spend more time to enjoy the fountain. The whole area was clean and well kept.<br><br>It wasn't too busy when we went around 5:15pm on a Friday so we were able to get some good pictures. I would come back again while in Chicago because it's right off the popular Michigan Avenue. <br><br>It takes about 5-10 minutes to enjoy the whole thing.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JeOn6XaXMD8x8F3E7y2j_A/348s.jpg", "caption": "Michigan Avenue as seen from the Fountain."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/87eRslxm6GpICR4wCGnSZw/168s.jpg", "caption": "Buckingham Fountain"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/a7Q7gMoZraon-QnpI7R9Pg/168s.jpg", "caption": "Buckingham Fountain with Chicago in the background"}]}}, {"review": {"des": "What an incredible sight! This is probably one of my favorite landmarks in Chicago, especially after learning the history and symbolism of the fountain. Where? Through the internet, of course. This is one of the largest fountains in the world, built to represent Lake Michigan. Four sets of sea horses symbolize Illinois, Wisconsin, Michigan and Indiana, the states that border Lake Michigan.<br><br>It's neat to see the intricate details of the fountain up-close and, if you're lucky, the water or light shows as well. I'm glad I got to see it in September before it stops operating in October for the winter, though I wish I was there at night to see the color-light show. The water show during the day was cool, where the water in the center jet shoots up vertically to 150 feet in the air. Definitely add this to your list of sights to see when visiting Chicago, whether you're a local or visitor.", "pics": null}}, {"review": {"des": "Actually when I first came to chicago was not aware that this place is not opened all year. So somehow missed to see this beautiful Fountain on 2014 n 2015 but finally on 2016 determined to see it and it a beautiful sight to see it during night(I like Vibrant things). The place is a must visit for tourists for good background pics. Pretty good place to sit and relax n close to the bean and other tourist attractions. If you get bored here, just cross the road n sit near the lake and relax.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SQcfLzfLVh3pqE6IFgyZNw/168s.jpg", "caption": "With little day light"}]}}, {"review": {"des": "Whoa, this thing is cool!<br><br>Buckingham Fountain is a gigantic fountain - one of the largest in the world - located inside Grant Park. If you face the fountain eastward, Lake Michigan will be in the background. If you face the fountain westward, the Chicago skyline will be in the background. The fountain itself has a beautiful French design and all in all, this place (fountain and backdrop) is a sight to behold.<br><br>Kind of like the fountains at the Bellagio in Las Vegas, Buckingham Fountain has free water shows. The fountain is open every April through October and 20-minute shows begin on the hour, every hour, beginning at 9am daily. Water shoots up from the center fountain 150 feet into the air. In the evenings, music and lights accompany the show.<br><br>There's an enormous amount of brick space surrounding the fountain with benches along the perimeter. There were no restrooms or refreshment stands I could see in the immediate area during our visit. Funny enough, the fountain area has free Wi-Fi provided by the City of Chicago.<br><br>If you've never been to this place before, it's definitely worth checking out.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9UAxC9h6G4Dul2gdaZIblg/168s.jpg", "caption": "This fountain is huge."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/j-ROSCGN7jFKnRNsBeSuvA/168s.jpg", "caption": "Great view of the Chicago skyline."}]}}, {"review": {"des": "So I feel funny reviewing a fountain that I don't know much about. All cards on the table, I went because it was in the opening for Married with Children.<br><br>What I can say, is that its massive and gorgeous. It's one of the most impressive fountains I've ever seen. I don't know much about the architecture behind it but it seemed very detailed. <br><br>You can take gorgeous pictures from all angles.<br><br>I'm rambling on about a fountain but just listen to me and check it out.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3niMLXbQQhUF17hKqYgcpQ/348s.jpg", "caption": "Love and marriage"}]}}, {"review": {"des": "Go walk around with family and friends. It's enjoyable. There's plenty of scenery of the Michigan shoreline and people watching. <br><br>Look up the times of the fountain sequences. I think we caught a big one at noon once walking by, which was cool.", "pics": null}}, {"review": {"des": "Perhaps I'm an ignorant American in that the only history of Buckingham Fountain *I* know is its appearance in the opening credits of Married with Children. I mean, I'm sure it's named after a, likely British, lout. Did Buckingham someone design it? I don't know but my cheeky irreverence here means no disrespect to this most Chicago of tourist attractions.<br><br>It is a beautiful fountain in a nice open square. When it's operating, as it seems to be off for the winter which makes sense, it shoots a nice central water spigot way up high with other water werks going on all surrounding. At night, throw in a rotating technicolor light show and you have \"TripAdvisor top 100 things to do around Chicago\" written all over it.<br><br>Makes for a good time lapse video, see mine, if you have the teknikal skillz to pull it off.", "pics": null}}, {"review": {"des": "My last visit to Chicago was in the dead of winter, so I was bummed I didn't get to see Buckingham Fountain. I wasn't going to let this trip go by without a visit. <br><br>I was actually on a run on Lakeshore Trail and could feel the mist from the fountain long before I could see it. And when I finally did see it, it was kind of one of those take your breath away moments! The fountain is so large, so beautiful, and draped with the city skyline! <br><br>Don't miss a visit to Buckingham Fountain!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/n4FrxX2rMycz5Q4dhixPVQ/348s.jpg", "caption": "Buckingham Fountain and that city skyline!"}]}}, {"review": {"des": "How do you rate a fountain?<br><br>It's from Married with Children.  You know....  <br><br>Love & marriage, love & marriage.<br>Go together like a horse and carriage;<br>This I tell you brother,<br>You can't have one without the other<br><br>Need I say more!?<br><br>If you've watched the show, we should be friends.  If you haven't seen or heard of the show, you're way to young to be using YELP.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zHxnjfMn4zLYOl3YY1_Ncw/348s.jpg", "caption": "Love and Marriage!"}]}}, {"review": {"des": "LOVE AND MARRIAGE... LOVE AND MARRIAGE... GO TOGETHER LIKE A HORSE AND CARRIAGE...<br><br>I was expecting some type of ode to Married with Children when I came across The Buckingham Fountain. Where are all the Al, Peggy, Kelly and Bud lookalikes? Merchandise? Rides? Comes on now. lol. jk.<br><br>The Clarence Buckingham Memorial Fountain is one of the largest fountains in the world and is quite symbolic. The actual fountain is supposed to represent Lake Michigan and the four pairs of seahorses are meant to symbolize the four states that border the lake -- Illinois, Wisconsin, Michigan and Indiana. Unfortunately there is a fence that surrounds the parameter of the fountain, so you cannot get a good look at the sculptures. <br><br>Every hour, the fountain shoots off a 150 feet jet stream of water into the air lasting about 20 minutes. Supposedly at dusk each water show would be accompanied with a light and music show. If they were smart, they would synchronize the Married with Children theme song with the water spectacle. jk. <br><br>The fountain is only operational from April - October from 9am to 11pm. If you show up during it's off season, don't worry! Just sit on one of the nearby benches, and just stick your hand down your pants Al Bundy style. I am pretty sure everyone would understand, and you probably won't be the only person doing it. lol.<br><br><a href=\"/redir?url=https%3A%2F%2Fyoutu.be%2F0deJRSu1iTU&s=7896a857eaf646038d247190cc2efc1feea196c4f855806b44fd1321c5bfe9b9\" target=\"_blank\" rel=\"nofollow\">youtu.be/0deJRSu1iTU</a>", "pics": null}}, {"review": {"des": "Love and marriage, love and marriage<br>Go together like a horse and carriage<br>This I tell you brother<br>You can't have one without the other<br><br>That's what came to my mind when I first laid eyes on this fountain. Yes, this is the iconic fountain showcased during the opening them of the show \"Married with Children\" and that is how I will always remember it! <br><br>To be serious though, there's really not much to say about Buckingham Fountain, except that it is what it is --- a HUGEEEE, beautiful fountain found off of Michigan Avenue in the heart of Grant Park. It's an absolute gorgeous place to take a photo at and is one of those must-see Chicago landmarks. <br><br>Each iconic fountain in this world has its own individual characteristics and Buckingham is no different. The individual fountains all spray toward the middle creating this collapsing waterfall effect in the middle, which is pretty cool. In addition, it sits right on the edge of the Chicago shoreline that is shared with Lake Michigan so it gets quite breezy in the surrounding area. It doesn't get much better than this when it comes to fountains.", "pics": null}}, {"review": {"des": "This is one of my favorite fountains in the world,  second only to the Trevi fountain in Rome. It is located in a fabulous spot off of millennium park. From one side you can see the lake and from the other sides the beautiful city skyline. And on some of Chicago's picture perfect summer days it is difficult to think of a better spot to relax and sip a beer. <br><br>A must see for any Chicago visit!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iO9iIiH6RFXQKsIpDKlfeg/168s.jpg", "caption": "With the Chicago skyline in the background"}]}}, {"review": {"des": "This amazing area is to beautiful plenty to see in the park, hotdog sales, statues, view of downtown from here. Also able to have a picnic and enjoy the beautiful weather.", "pics": null}}, {"review": {"des": "Guys, seriously, it's a fountain. Can't really heap too much praise on it any more so than other landmarks. However, it is pretty. A constant cascade providing background noise on your morning jog, but if you are in Chicago you better check out the Field museum up the street. Still though, it's solid and architecturally relevant. Add it to your tourist list as a \"fly by\" on your way to the real tourist attractions.", "pics": null}}, {"review": {"des": "Iconic design!<br>It is not crowed when I visited before the sky getting dark. I noticed that you can take many photos from different angles and every shot would include different background. Facing west or north, you can frame the beautiful Chicago downtown landmarks. Facing east, you will use the great lame as you back screen. Lovely landscaping as well.", "pics": null}}, {"review": {"des": "I don't know much about the history of the Buckingham fountain, but what I do know is that it is a landmark traditionally used by my family to meet at if one becomes separated. The only difficult part after that is determining which side of the fountain one is on. Cardinal directions is a must. <br><br>This is a huge fountain in between Columbus and LSD. It is surrounded by small stone/sand like pebbles that get lodged in your shoes. The fountain is impressive with its aquamarine statues which are surrounded by a patch of grass.<br><br>My mother tells me of a story where she ran through the fountain. If you knew my mother this is a story that is hard to picture.", "pics": null}}, {"review": {"des": "you gotta love chicago<br>i took tride in my bike from north side to grand park and enjoy the fountain and all chitown i took my friends from ct to see the fountain , the bean and more", "pics": null}}, {"review": {"des": "Aka the married with children fountain. Cool fountain located in very spacious park. I enjoy visiting here whenever I'm in Chicago", "pics": null}}, {"review": {"des": "Really pretty fountain with lots and lots of water! It lights up at night, so make sure you swing by to get that too! It's right by the lake so it's super convenient to access, and it's very close to Cloud Gate so make sure you swing by when you're around!", "pics": null}}, {"review": {"des": "I always look for an occasion to visit the fountain especially on a beautiful day. The park that the Buckingham fountain sits in is reason enough to visit. Reminds me of the great parks in Europe, the promenades and flowers are a delightful way to pass a morning or afternoon. But with the addition of the fountain, pretty turns into majestic. <br><br>There is something both calming and exciting about a fountain, and the columns of water jetted into the air and spreading out like fans of peacocks meets both those criteria. Sit an watch for a while, and watch the people watch the fountain. Love the patriotic music they play as they turn the fountain off each evening. Beautiful.", "pics": null}}, {"review": {"des": "As far as North America goes these types of visually pleasing things are few and far between as far as fountains in cities go.  This wonder is essentially right in the center of what is Grant Park.<br><br>The fountain sometimes streams a jet of water high into the air at times and the pool that surrounds the fountain is huge basically the footprint is about the size of a Chicago city block in the Loop.<br><br>The area surrounding the fountain is all open as is most of Grant Park which is very wide as far as vision around you goes there is plenty of space here to feel recessed from the skyscrapers just a few blocks away.  <br><br>For those old enough to remember yes, this is the fountain from the beginning of Married with Children.  <br><br>Buckingham fountain is just another one of those things that makes Chicago special and makes them stand out as far as big cities in North America go.  It's another one of those things that definitely add to the beauty and uniqueness of a great city which is a great fountain in a great park.", "pics": null}}, {"review": {"des": "I \"discovered\" Buckingham Fountain on my walk from my hotel on Miracle Mile to the aquarium. A stunning piece of art in the middle of town! A picture does not do the fountain any justice, you'd have to see it in person in order to fully appreciate all of its beauty.", "pics": null}}, {"review": {"des": "Nestled into a bucolic park and set against a backdrop of architectural splendor to the west and majestic Lake Michigan to the east, Buckingham Fountain is truly a Chicago icon.<br><br>As I was completing a Labor Day evening bike ride I decided to make a short stop and enjoy the fountains water and accompanying light show. It was a calm, balmy, but not overly humid summer night and tourists, families, couples, individuals, bike riders were lingering around enjoying the last gasps of summer light.<br><br>Unbeknownst to me, the light and water performance was accompanied by an interesting music section of Americana and patriotic songs and other familiar classics such as Battle Hymn of the Republic (Glory, Glory Hallelujah) America the Beautiful, highlights of Tchaikovsky's 1812 Overture etc. <br><br>The combination of the performance, beautiful park, surroundings, setting sun made the experience a truly memorable Chicago moment and further demonstrated to me that Chicago is both a world class city and a class act.", "pics": null}}, {"review": {"des": "Can't wait till spring. Best place to take pictures.  On a hot day beat place to beat the heat because of the water. Coming up out of the fountain. At night for couples the lights Chang color.", "pics": null}}, {"review": {"des": "A huge fountain, but not exactly a fun & splashing experience because the fountain was off.<br><br>Built in 1927, this is the same fountain that appeared in the opening credits of \"Married With Children\". Starting at 9 AM, there's a 20-minutes water show that occurs every hour until 10 PM ~ 11 PM. Just a note, the fountain only operates from April through October. Oh, the Buckingham Fountain is modeled after the Latona Basin in the gardens of Louis XIV's Palace of Versailles.<br><br>Another famous Chicago landmark - so stop by for a quick visit.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Lo7Dzt7B5e88noeBHV_bcw/168s.jpg", "caption": "Dried fountain"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HA9RI0loLF8x8h9YST-0JQ/168s.jpg", "caption": "A pretty big plaza"}]}}, {"review": {"des": "A staple must see when in Chicago from spring till the end of summer.Bring a camera,a friend and enjoy the great Chicago lake front.Can't really describe until you actually see it.Never crowed and a must see at night when the lights hit with the water.A great place to have a picnic with the family.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3TctxxvzgRUoDepNrL5M5g/348s.jpg", "caption": "Lollapalooza day 4 sunday aug 1st"}]}}, {"review": {"des": "Remember the water fountain in Married With Children?  It's the Buckingham Fountain in Chicago ... and Gord and I walked to it yesterday afternoon.<br><br>There's no charge to see it.<br><br>It's a beautiful fountain and it was fun to see it up close!", "pics": null}}, {"review": {"des": "Buckingham Fountain is probably the most beautiful fountain I have ever seen at night.  Not only can you see the fountain's colors change at night, but you also get a nice view of the city.  <br><br>If you're visiting Chicago, you should definitely stop by for a quick look or picture!", "pics": null}}, {"review": {"des": "I absolutely loved this place so pretty in the day time or nighttime the fountain looks amazing so many colors and I couldn't believe how big it was. The water shoots very high and the colors change along with the music in the background", "pics": null}}, {"review": {"des": "Buckingham Fountain is.... a beautiful fountain.<br><br>It's somewhat iconic -- one of the largest in the world -- with a fantastic skyline behind it and easily recognized in the opening credits of several movies and shows like \"Married With Children.\" <br><br>I've walked by here dozens of times and enjoyed the mists from the wind blowing through the fountain. Seagulls flock through the air and search for food on the the ground (there is, I believe a little building where you can buy food nearby -- not sure if this is just open during festivals). If you can come here when the crowds aren't crazy for a festival, it's rather peaceful. The fountain has some kind of water show that runs frequently through the day (only when the fountain operates during the warmer months of April-October), complete with lights and music during the evenings. In the winter months, holiday lights decorate the fountain.<br><br>Buckingham is walking distance to several popular spots in Chicago; if you find yourself spending a day or two in this city, try to visit the fountain. It's free, so why not?", "pics": null}}, {"review": {"des": "Buckingham Fountain is a cool place to visit (especially for tourist). It's located near Lake Michigan. The water shows are cool to watch while relaxing. This fountain is like The Fountains of Bellagio in Las Vegas. The scenery around Buckingham Fountain is beautiful. It's a great place to take pictures. There are a lot of tourist here during summer. I'm glad I had time to stop by. Definitely put Buckingham Fountain on your Chicago bucket list.", "pics": null}}, {"review": {"des": "In the evening the fountain is so gorgeous and huge to look at it. The water just splashing away and the cool lights changing it every few seconds. They have a fountain show every half hour I believe with music and colors changing. It is something to check out in Chicago.", "pics": null}}, {"review": {"des": "It's Buckingham Fountain! A must see if your visiting Chicago. Beautiful park and scroll at night. Light show is pretty amazing to watch. Depending on the time you choose to visit it can be quite crowded. Only a short walk from the bean and Maggie Daley park so definitely each both of those if you're in the area. Parking here can be quite difficult if it's crowded so try to go early if possible.", "pics": null}}, {"review": {"des": "Beautiful fountain. First came during daylight and came back at night. So pretty with all those lights.<br>I prefer at night since the buildings are all light up.", "pics": null}}, {"review": {"des": "I am from here. and I choose to stay in Chicago because of locations and landmarks like the Buckingham Fountain. Nothing better than seeing the Buckingham Fountain. Nothing is more amazing than watching children see this fountain for the first time.", "pics": null}}, {"review": {"des": "Married With Children is one of the classic television shows from bygone years.  One of my favorites during it's time on the air.  Don't judge me!!<br><br>After visiting, I heard that Buckingham Fountain was the fountain used in the opening scene for every episode.  Only saw the fountain in the evening so I did not recognize it from the tv show.  Still it was very cool to view the Buckingham Fountain at night.  The lights changed colors which lighted up the fountain beautifully!  Will have to return during daylight hours to be reminded of Married With Children.<br><br>Anyways check out this landmark when you are in Chicago, if you want to see something truly wonderful.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8-LXTjpNcSOkRsX0_Q5Vjw/348s.jpg", "caption": "Impressive!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mNDYkFE4rF34DoFzWAjwRg/168s.jpg", "caption": "Lovely"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/C-IOnlWDiM-cZPVHgnfRmg/168s.jpg", "caption": "From Married With Children"}]}}, {"review": {"des": "One of the worthwhile places to visit while in Chicago!  Great place to take pictures because of the beautiful background - the Chicago skyline. All the open space around it allow you to get a great view of Chicago and the lake. Also, nice to get a spray of water on a hot summer day!", "pics": null}}, {"review": {"des": "Having always wanted to see Buckingham Fountain up close after driving past it a gazillion times, I was teeming with excitement when I finally got to do so. I'd say it's not one of the top 5 sites to see in Chicago, but it is definitely worth checking out if you are nearby or visiting the city for more than a few days. <br> <br>The architecture in the fountain somewhat resembles something you'd see in Paris, but not as glamorous. It's a great site to visit on a sunny day and it's pretty massive. Great views all around the fountain and directly behind it.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WWfsd6TbE4SN-OZ-9EX1wg/348s.jpg", "caption": "B-Ham Fountain, near downtown."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zO-K5d-k4GCSId_-cBau3g/168s.jpg", "caption": "Ol' faithful-esque!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HQDRxb36IrJfN7BwoxDgtA/168s.jpg", "caption": "Perfect day to visit Buckingham Fountain."}]}}, {"review": {"des": "Beautiful spot - great views of the lake and skyline - take a stroll along the waterfront afterwards!", "pics": null}}, {"review": {"des": "By far one of my favorite places to visit when I have the chance to come visit Chicago. I'm surprised a lot more people don't check this place out more often. It's better than Millennium Park in my opinion. You're featured to a great view of Chicago & the beach. This is also the most ideal place to go to when the  Air & Water show comes to town.", "pics": null}}, {"review": {"des": "It's powered by three pumps that can shoot over 14,000 gallons of water a minute from 134 jets. <br><br>It has over 800 lights.<br><br>It was built in 1927.<br><br>It's namesake was an art collector and Chicago businessman.<br><br>But most importantly, a shot of the fountain was featured in the opening credits of \"Married With Children\".<br><br>Even Al Bundy would give it a fiver.", "pics": null}}, {"review": {"des": "I like to call this fountain the heart of Grant Park. This is the go-to place for wedding pictures, in fact, you will accidentally photobomb many of them during the weekends. This place is just downright beautiful, and it's even more amazing at night when the lights come on! If you're touring Chicago, you should definitely stop by! It's free and there are many other attractions nearby! <br><br>1) all around the fountain you will find many gardens, my favorite would be just Northwest of the fountain! <br>2) you can 10 mins north to millennium park and maggie daley park <br>3) or walk 15 mins northwest to State St. if you wish to do shopping <br>4) or walk 20 minutes southeast to the Planetarium for the best view of the skyline! (or Divvy there which takes about 5 minutes depending on your stamina) <br><br>Also, if you're touring Chicago, I'd suggest you get the 1 day CTA pass because parking will be super expensive and CTA will be faster/cheaper! Uber works fine too.", "pics": null}}, {"review": {"des": "I guess this fountain is pretty well known because it is the water fountain in Married With Children... no clue what this is all about. Anyway, the fountain is very nice and well kept and clean. Great spot for photos of the fountain, the city and the lake.", "pics": null}}, {"review": {"des": "I think I like this tourist spot more than the cloud gate because it is colorful and vibrant, especially at night. And it is a great photo op moment with the Chicago skyline in the back of the fountain.<br><br>My friend and I drove around a few times to find parking near Grant Park. We were about to give up when we decided to stake out at a row of cars waiting for someone to leave and soon enough, about 3 minutes later, a car pulled out and we quickly snatched up a spot. Parking is expensive around this block so I suggest you take public transport if possible. We paid $2 for less than 40 minutes worth of parking. But that was more than enough time to enjoy the view of the fountain and walk around for a bit.<br><br>TIP: the fountain shoots at its highest at every hour for about 15 minutes. We were circling around for parking around 9:10 and saw the fountain in its glory but by the time we parked and walked to see it up close, the fountain was not shooting at its highest point. We had to wait until 10:00 for it to put on another show with music and color changing and everything! It was great! Definitely something to see at least once in your life. <br><br>On a hot summer night, I can definitely see the little kids and even adults having fun and enjoying the spray of the fountain when it is shooting super high into the sky. I was walking past it and the spray got to me even though I was walking super far away from the fountain. It was a refreshing spray but if you stay in the wet zone any longer, you will definitely get soaked.<br><br>Lots of tourist and locals around this area strolling and enjoying the view. I love it!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-RoyntyiVKfJU5ilrWhp0w/348s.jpg", "caption": "Daytime"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/P_64tymY3oM04GLDy4AORg/168s.jpg", "caption": "Lots of street parking with ppl leaving every few minutes, js be patient"}]}}, {"review": {"des": "This was stop 1 of our tourists with the Irish cousins. They wanted to come see it. They had a photo of it and everything. We walked up and enjoyed the water spraying all over. It really is huge and a great landmark for Chicago. Living here I guess I take it for granted because I see it as I drive around. I didn't realize it's such an international hit. Very beautifully made and it's a great tourist attraction for people out of town. We stayed for a half hour looking at it. We read about it so we all know how it got here. It is a must see if you are in the area.", "pics": null}}, {"review": {"des": "For those old enough to be familiar with Married...With Children, you'd recognize Buckingham Fountain in the opening credits for the show. I know that's where I first became aware of it.<br><br>Now, I can only imagine how many people may have actually had wedding photos taken at Buckingham Fountain, but regardless, it's a pretty monumental fountain if I ever saw one.<br><br>Until you see it in person, you don't realize just how big it is. It's way bigger than what you see on television and the bronze horses and fish designs are actually quite large and impressive. The brick and inscription along the rim add to the overall monumentality.<br><br>When I visited the fountain a couple months ago, the weather was actually quite nice, and so the fountain was on, spouting in all its glory. Apparently, when it's freezing cold, the fountain just ices over and, obviously, there's no motion or movement in water. That would be a bad time to visit it, or be in the city of Chicago in general, I would take it.<br><br>The plaza immediately around the fountain is extremely Spartan and contains no real seating or shaded areas. In fact, the only relief that one could find from the heat of the sun would be the nearby restrooms. I'm sure leaving the plaza open was done as part of the overall aesthetics of the area, but I would have hoped that they would have eventually erected even some temporary modern amenities for the thousands of people who visit it each day.<br><br>In any case, if you're in town and you have a checklist of things to see, you should make this one of your prime photo opportunities. It's free to access and provides a nice backdrop. I definitely can't disparage that.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RknyHvGC7sO3Qb1Wg4fLNw/168s.jpg", "caption": "Love and marriage"}]}}, {"review": {"des": "To this day, Married with Children remains as one of my favorite TV shows, ever.  Because of that, Buckingham Fountain was a must-visit since this national landmark is on the opening credits of that beloved show.<br><br>At first glance, I was mildly disappointed due to the size as I expected it to be much bigger--it was noted as one of the biggest fountains in the world, after all.  However, while standing there in silence and absorbing it's beauty, sounds, and skyline behind it, I couldn't help but be mesmerized.  The bronze sea horses and fish designs supplement the pink marble construction of the fountain, enhancing it's appeal, making this landmark a prime location for photos.  Each sea horse symbolizes Illinois, Wisconsin, Michigan, and Indiana, respectively--the states bordering the Michigan Lake.<br><br>Every hour, the fountain shoots a powerful stream, 150 feet high.  Colored lights are also on display as well.  <br>----<br>Conclusion: A monumental fountain that definitely should be a part of your Chicago trip! <br><br>Extra Notes:<br>-Its completely free and east of Cloud Gate (The Bean)<br>-Created in 1927<br>-During winter months, fountain isn't operational<br>-Riddled with visitors and could lessen the enjoyment of taking pictures, so I recommend coming super early, as soon as the park opens at 8am.<br>-Fountain closes at 11pm<br>-Restrooms surrounding the fountain could be cleaner", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iHFe2LzeBTLO0b6nA_Lw0A/348s.jpg", "caption": "Panorama"}]}}, {"review": {"des": "Cool fountain located right within millennium park in downtown Chicago. This is one of those attractions that you just have to visit as it is a gorgeous fountain with breathtaking views of the city. Every time I see this thing it reminds me of the old \"Married with Children\" sitcom that I used to watch growing up... Nevertheless, this is a great attraction in an already awesome park. <br><br>Pros-<br>Picturesque <br>Views of the city <br>Size <br>History <br><br>Cons-<br>Lots of walking <br>Crowded with tourists", "pics": null}}, {"review": {"des": "I have lived in Chicago for quite some time now and have heard non stop praise about this so called \"immaculate fountain\". I originally went to try see this fountain August 1st. There was some kind of atrocious music festival where \"Locals\" from \"Chicago\" come to underage binge drink and do reefer while listening to obnoxious music from musicians that are barely talented. During the course of this poor mans Woodstock I did not hear \"Free Bird\" once, my first disappointment. When I finally pushed my way through a crowd of smelly hippies to see the fountain it was filled with disease ridden water that reeked of urine. I left and decided to come back on another date.<br><br>When I returned on a later date there was less foot traffic through out the park.... but the help had bags full of trash that they pushed around in shopping carts and asked for donations (For maintenance on the fountain?). To my surprise when I examined this fountain there was no water running through it. I couldn't believe for the amount of taxes I pay this is the type of service and presentation of this park. I stayed to look at the sculptures anyways, this was a big mistake. The overall architecture of this fountain would look much better covered by the filthy water probably funneled from the frozen oil water of lake michigan. It is a disgrace to the great name Chicago. <br><br>I do not recommend this as a \"must see\" for anyone visiting Chicago. In fact this should be avoided if you would like to have any type of respect for the city. This medium sized, at best, fountain is a bigger disappointment then Kane West, the horrible hip hop artist from Chicago that all the kids rave about. Luckily it is close to the Art institute of Chicago (see other review) so this entire section of the city can be avoided. In my opinion the entire coast of the frigid scummy lake michigan, that just anyone can swim in, should be destroyed and rebuilt. It would be much better for the city as a whole. I do not recommend this fountain unless you are looking for disappointment.", "pics": null}}, {"review": {"des": "If you've ever watched \"Married With Children\" you'll recognize the fountain.  Sadly the time I visited the water was off.  Since the water was off I took pictures of it from the car. The fountain is so huge and can be viewed from the street.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HW9A404M5dSMbtFqOc35Vw/348s.jpg", "caption": "Sadly, the foundation was turned off."}]}}, {"review": {"des": "Always beautiful, but particularly so at night. Especially if you catch a fireworks show from navy pier.<br><br>I love coming to Buckingham Fountain, it is so iconic of Chicago, and it is [practically] free. The only issue, really, is finding parking if you drive. I'm sure there's a way to get here via public transportation and a little shoe rubber, but I'm a driver, so I find it sometimes difficult.<br><br>There is metered parking on Columbus (one block west of Lake Shore Drive), but if it is a time when you think \"Oh, it's a perfect time/weather to visit\" guess what? Everyone else has the same idea and it's like pulling teeth to get a spot. Plus, I think the parking is something like $4-$6 an hour and the meters still require payment on Sunday! Unlike most other places in the city.<br><br>The other thing is...if you're there at night, be prepared to see some wildlife...both the kind that makes you go \"Awww\" [rabbits] and the kind that makes you shrink back in horror and go \"EEEWWWUUGHHH!\" [giant, poodle-sized rats).", "pics": null}}, {"review": {"des": "Another place to visit near the bean. Do you know the music video for Truly Madly Deeply by Savage Garden? Well this reminded me of it. It is a really big fountain to take photos in front of. I feel like if you are in the area, might as well visit this and throw a penny to make a wish. I am not sure if you are allowed to but bloop. After this you can just walk along the waters.", "pics": null}}, {"review": {"des": "Beautiful fountain in Chicago next to Lake Michigan. My friends suggested that we stop here and I said sure! I love to visit new spots when I'm traveling.<br><br>We found parking easily on the street (even with being out of towners). So as we are walking up they tell me this is the fountain from Married with Children! Whoa! Cue the intro music for that show...  <br><br>It's a pretty sight and apparently there is a fountain show which we unfortunately missed. However I do suggest that you visit it during the day and at night. During the day you can take some pics there and then go bike riding along Lake Michigan. At night, it has some pretty lights. <br><br>Can't wait to go back! I love this city!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IDwTtGnViLG6b7tPJrh3YQ/348s.jpg", "caption": "Same fountain that's in Married with Children!"}]}}, {"review": {"des": "Not really much to review here. It is literally a beautiful fountain with ornate statues that spout water. What I absolutely love are the changing lights and how the fountain sprays based on the drama of the orchestral music playing. <br><br>Its a must see at night. That's when all of the colors are prettiest.", "pics": null}}, {"review": {"des": "We were here for the Avon Walk and the view of the Buckingham Fountain was beautiful as the Walkers got to the finish line of their 2 day 39 mile walk.<br><br>We cheered them on and thanked them for walking on behalf of so many women who are survivors, and the ones that have passed on.<br><br>We have so much history in Chicago and I think because its around us everyday we tend to forget all the gems we have in this city and Buckingham Fountain is one of them and I can't wait to go back on my own.<br><br>Enjoy!", "pics": null}}, {"review": {"des": "This beautiful water fountain is located in the middle of Grant Park, right next to lake Michigan. The soothing sound of the water fountain makes it a good place to relax on a nice, sunny afternoon. There is a water display that goes on for 20 minutes that starts on the hour every hour from 9 in the morning. You can also see the amazing Chicago skyline in the background. I heard that it is even more beautiful at night with all the lights but I did not had the opportunity to visit in the night time.", "pics": null}}, {"review": {"des": "Love this place in the evening, the light show is one of the simple pleasures in life. <br><br>The whole Grant Park area is well maintained and clean, it's walking distance to The Bean and Lakefront too. Also, a great spot to finish off a date and watch the light show.<br><br>Even if you're just out 'n about in the city, you really can't go wrong in making a stop by the fountain.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fWFGJvAa6gJzsLIGuP7PIQ/168s.jpg", "caption": "Lovely at night, perfect for a simple, romantic summer evening date."}]}}, {"review": {"des": "The Buckingham Fountain is located in Grant Park not too far from the Cloud in Millennium Park. Make sure you see it as its one of the largest in the world as per the site. It's huge and truly remarkable to see how big and beautifully it was designed. After every few minutes it was spiting the main water very up in the sky.<br><br>You see a lot of people enjoying the fountain, some people joking around the area and then there are the pro photographers.  Make sure take a breather and sink it all in as see how the family and children are enjoying the site.<br><br>On a separate note there are washrooms in the surrounds of the fountain.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2GlFHdkk4E9PJkrqev_Bxg/348s.jpg", "caption": "Buckingham Fountain"}]}}, {"review": {"des": "Beautiful!<br><br>Honestly, what else can I say? I had a few free hours in Chicago after a business trip, and bookmarked this fountain as one of the things I wanted to see. I was not disappointed.<br><br>Abundant with people taking photos, enjoying the scenery, going for a walk/jog... Buckingham Fountain is pretty spectacular.<br><br>The Lake as a backdrop makes it look like an artificial photo at times - almost too perfect!", "pics": null}}]}