{"name": "buona-terra-chicago-2", "reviews": [{"review": {"des": "Actually, we found Buona Terra on accident as we were planning on having dinner at a Cuban restaurant, but at the last second we decided to have a nice Italian dinner. Everything from the complimentary bread with garlic/parmesan spread, to the tangy Capellini d'Angelo al Natural and finally to their cannoli with my coffee was well worth the trip. The staffs as very friendly, and we had a great view of California Avenue in Logan Square as we sat by the window. We were truly blessed and enjoyed ourselves. Thank you again for dinner.", "pics": null}}, {"review": {"des": "Went here for dinner on a week night. We made a reservation but it didn't seem necessary since there wasn't a lot of people around 6 pm. <br><br>The food was good and the staff was courteous.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lzlOlf9EBBqCIr5xGtAJww/348s.jpg", "caption": "Baked chicken"}]}}, {"review": {"des": "Buona Terra is a no frills, classic Italian spot in the Logan Square Neighborhood.  I cherish their $27 prix-fixe menu on Thursdays.  You can basically get any appetizer, entree, and dessert on the menu for $27!  It's a wonderful deal.  The service has been okay but there are always some absolutely delicious items served. <br><br> I am in love with their roasted garlic in olive oil that they bring out with their complimentary warm bread. I think all Italian restaurants should serve complimentary bread so I appreciate that they do this here. <br><br> I most recently tried their calamari and it was okay, the breading could have been more flavorful and crispier.  It was a bit disappointing.  I also tried their Caprese Salad, which tasted refreshing with a smooth mozzarella texture and was served with some nice and salty kalamata olives.<br><br>While I am in love with their Eggplant Parmesan because of that delicious tomato sauce, I decided to try their fish of the day.  It was a lovely whitefish in a kalamata olive sauce.  The fish was made perfectly and the kalamata olive sauce was heavenly.  It was buttery with a prominent kalamata olive flavor.  I was absolutely in love with the sauce. The potatoes that they served with it with were decent but could have been seasoned more.  I was disappointed with the flavorless big chunks of broccoli that were served with it.  Vegetables need to be seasoned even if they are next to a delicious piece of fish.  I just don't understand why the broccoli was so bland, it was such a contrast to the extremely flavorful fish.  <br><br>Their desserts are always amazing though.  I can't complain about the tiramisu, it's creamy and fresh without being too overwhelming.  Overall, Buona Terra can be hit or miss with some consistently delicious dishes.", "pics": null}}, {"review": {"des": "Very good first experience here. Had the butternut squash ravioli and the rotini di la Nona. Both were a nice portion and the sauces are very savory. Can't wait to go back and try more! Also, the tapenade that comes with the bread is outstanding.", "pics": null}}, {"review": {"des": "This is definitely one of the better Italian places in town. The food was amazing as you can see in the pictures. My favorite part though was the roasted garlic they bring out with the bread  <br><br>I have been to Heath and Crust and I knew I had to try this place as well. <br><br>I would call ahead to get your name on the list. It can get busy and there's not a lot a room around the bar.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Vat9IwUzzMtMFhkeZu-tsg/348s.jpg", "caption": "Chicken something :-)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kIy7RdFuA2riVzsmRF5k1g/168s.jpg", "caption": "Half chicken"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BUiCxXUgYuboqdm5j0AfgA/168s.jpg", "caption": "Half portion of rigatoni"}]}}, {"review": {"des": "An amazing restaurant tucked away in an ordinary neighborhood.  We found the menu, creative, innovative and tasteful and enjoyed all the meals we  tried.", "pics": null}}, {"review": {"des": "Came on a Tuesday night and were seated immediately. Didn't really need a reservation as the place was pretty empty. The staff was friendly and the service was quick. The food was pretty good and average priced. Nothing spectacular, which is why I am not giving 5 stars, but also nothing to complain about here.", "pics": null}}, {"review": {"des": "We went to the new sister restaurant a week earlier Hearth and Crust. We were invited to go to dinner yesterday and were surprised to find out that our guests picked Buona Terra. Needless to say we were very excited. They were again practically perfect in everyway. Service, wine, Eggplant, Whitefish all cooked perfectly and presentation was fantastic..", "pics": null}}, {"review": {"des": "The Ravioli con Vitelli is AMAZING! It may be the best ravioli I've ever had.<br><br>A coworker recommended Buona Terra and said it was his favorite restaurant when he lived in Logan Square. I can see why. <br><br>There is a great menu selection, the staff was excellent, the food (and wine) was fantastic, and the prices reasonable for the quality of food. I'm so sad we'll be moving out of state because I'd definitely return on a regular basis! Yum.<br><br>I'd recommend making reservations because it's a fairly small place and gets busy for obvious reasons. :)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yfSm9-wKt6Lob6_soujVug/348s.jpg", "caption": "Ravioli con Vitello"}]}}, {"review": {"des": "Super good Italian classics. Lovely patio, wonderful service. An all around ten! Looking forward to dining here soon!", "pics": null}}, {"review": {"des": "I come here once a month. The best dish is their Arabiatta pasta. The pasta is always cooked perfectly. The sauce is spicy. Try it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lATTtBiZ4U6uKql38h4ObQ/168s.jpg", "caption": "Arabiatta pasta......get it......if you went to this place and didn't get this pasta, you never went there ."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/99_tZmoXqymuDXE7AQM3DA/168s.jpg", "caption": "Amazing Arabiatta pasta"}]}}, {"review": {"des": "Came here after a few recommendations and were not disappointed! The staff was nice and attentive. We came on a Thursday for the prefix menu- my husband did the prefix and I got an entree. <br><br>We started with a bottle of chianti that for under $30 was good! Got the bruschetta as a starter which was nice and acidic. Their warm bread with the garlic paste was addictive. <br><br>For entrees I got veal ravioli and he got rigatoni. Both were flavored well and not overcooked. However I'd say mine lacked a little of acidity and his salt. <br><br>A cannoli at the end was gone in seconds. Very good!<br><br>Overall we'd definitely come back here for more meals. Great neighborhood spot.", "pics": null}}, {"review": {"des": "This was my family's second time at Buona Terra to celebrate my mom's birthday. We loved it both times. The service is great and the waiters are really nice. For appetizers we ordered grilled calamari and caprese salad and for our dinners, my mom and I ordered the pounded chicken, my dad ordered the veal and my brother ordered the raviolii. We also ordered a side of whole wheat spaghetti. All of our dinners were delicious and I was happy that there were healthy options on the menu--how many places offer whole grain pasta? We're definitely coming back next year and I reccomend to everyone!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-BMz5fgU9PtY0N7xWmK8kA/348s.jpg", "caption": "Pounded chicken breast wth fresh mozzarella, arugula and tomatoes. Delicious!!"}]}}, {"review": {"des": "I've been here twice already and both times had pasta. Overall I tried the bruschetta, calamari, house specialty (Rigatoni Buona Terra), salmon linguini, veal ravioli, lentil and sausage soup, profiteroles, panna cotta, and gelato. <br><br>All the dishes tasted wonderful and slightly less seasoned than I would like, but they have salt/pepper/oil on the table for you to really customize. My favorite dish would have to be the Rigatoni. <br><br>The complimentary bread with garlic/cheese spread is worth going for alone. They also have a great wine selection that's worth checking out. <br><br>Ambiance: Warm, cozy. <br>Price: Great, the portion you get for paying is worth it. <br>Taste: Great taste overall. <br>Service: Excellent.<br>Come back?: Yes, I've been back and will continue going there as long as I'm in the mood for Italian fare. <br><br>Other notes: Good amount of vegetarian options. Limit 2 cards per check. Includes small bar.", "pics": null}}, {"review": {"des": "I came for a party and the food was delicious. The staff was attentive to our group and very helpful. The food came quickly and was priced appropriately.", "pics": null}}, {"review": {"des": "I had been to Buena Terra at least four times previously, so had highly recommended it to the six people who joined me. I wish I hadn't. The calamari plate was so skimpy we actually asked if it was a full order. Carpaccio di manzo was flavorless and poorly presented. Pasta orders for the price were quite small. The caesar salad was an embarrassment: $10 for a bowl of romaine with a couple on croutons on the bottom. Dressing was hardly noticeable. We found the entire meal very over-priced and lacking in the quality of its early years. Very disappointing. We won't return nor recommend as we had been.", "pics": null}}, {"review": {"des": "For the nine years that I've been living in Logan Square, I had forgotten about the stretch of California Avenue between Logan Boulevard and Fullerton Avenue. Hence, I missed going to Buona Terra.<br><br>Nice little rustic restaurant with plenty charm, it seems to fill up quickly. That's a good indication of it being a go-to spot for a lot of patrons.<br><br>I didn't go \"big\" on my visit. I started with a carpaccio of thin beef with mushrooms, capers, and Parmesan. It was definitely good. The penne all' arrabbiata was full of flavour but not as \"angry\" as I thought it would have been. I like it a lot, too. For a finale, I had an espresso.<br><br>I appreciate that my server was not at the table every 15 minutes inquiring as to whether everything was okay. I must admit the server who was not attending my table was more engaging than the server I had. I would have to return in the future to see if there is consistency in flavour of different menu items as well as service.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pRKitqc-UILky80-ezcUrg/348s.jpg", "caption": "Bread, Carpaccio, Penne all' Arrabbiata, Espresso"}]}}, {"review": {"des": "LEGIT PLACE!!<br><br>I never use the word \"Legit\" but i felt like it today. This by far is one of the best Italian restaurants i have been to in a while. It is a small restaurant in the Logan Square area and you have to try it if you are in the mood for comfort food. The staff is fantastic and very attentive! The food is literally to die for! I have tried a few dishes on their menu and i yet have to taste one that i wasn't happy with. <br><br>This place is intimate if you wanted to go on a date or just relax by yourself. I have dinner by myself quiet often and this is my go to place to unwind, have a glass of wine and top notch food. One main reason i also enjoy this place is because the noise level is very low! They don't crank their music up to a point where you can't hear, you are able to have a full conversation with your partner/freinds etc. without having to focus on what their lips are saying.<br><br>Check this place out! I give them a 5 start", "pics": null}}, {"review": {"des": "It was a lovely Saturday night to sit outside and have dinner with one's bestie. We shared the carpaccio, which was absolutely fantastic. Tenderloin with truffle oil and shaved Parmesan ....yes please!! We actually split the rest of our meal as well, which was a simple pasta with meat sauce and the escarole and broccoli salad. Plenty of food for us and quite tasty. Our server seemed a bit shy...so cute. It was a nice experience overall.", "pics": null}}, {"review": {"des": "If you want good Italian food I would NOT come here. Food is mediocre at best. Too pricey for very basic cuisine ...Wait staff was not very friendly and we felt as if we were being rushed out of the. I would never recommend this place to anyone", "pics": null}}, {"review": {"des": "Amazing food, casual atmosphere.<br><br>Everything here tasted outrageously fresh.  The basil in my pasta literally crunched between my teeth.  They must have a basil plant in the kitchen or something.  That freshness really made a difference.<br><br>Once you order, you get a basket of hot bread, crispy on the outside, soft on the inside.  It comes with this *heavenly* spread made of garlic, olive oil and parmesan.  You could eat that all night and walk away happy.<br><br>* Pennine al'Arabiata ($14.95) - Pennine pasta tossed with fresh herbs, garlic and a touch of spicy tomato sauce.  Very, very good.  I loved the spicy kick.  Spicier, I think, than other arabiata sauces I've had.  That ultra-fresh basil was key.  Slices of fresh garlic take it up a notch.  This is heaven on a plate.<br><br>* Pollo Al Afumicatto ($18.95) - Sauteed chicken breast with smoked mozzarella, in a smoked tomato and bacon sauce served with pesto mashed potatoes.  Quite good, though I preferred my pasta.  The pesto mashed potatoes were delicious.  The smoked tomato/bacon sauce was an interesting flavor combo.  I'm not sure it worked 100% with the chicken and mozzarella, but I enjoyed it.<br><br>I drank a glass of the house pinot noir.  Not super impressed.<br><br>I wish I could give Buona Terra five stars, but the atmosphere is really way too casual for food this good.  If you're looking for a romantic night out, this isn't the place.  The paper tablecloths, the flat screen TV and the very loud sounds from the bar really put a damper on the mood.  We also felt kinda rushed as plates were removed before we were asked if we were finished.  This food is so good, it deserves to be savored.  I wish the place were quieter, dimmer and cozier.<br><br>Still, the food is some of the best Italian I've had in Chicago.  I'll be back for more!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GxaizTFoODkz7gWW6oNp7A/168s.jpg", "caption": "Pollo Al Afumicatto ($18.95) - Chicken breast with smoked mozzarella, in a smoked tomato and bacon sauce served with pesto mashed potatoes."}]}}, {"review": {"des": "The food was absolutely stellar. Complex and layered flavoring in each dish. Service was good. Portions are way too small and the prices are way too high. Would visit again if prices go down or portions are increased. <br><br>Decor/ambience was confusing.", "pics": null}}, {"review": {"des": "So, where to start....first and foremost, the food is tasty (perhaps that's the most important thing here), but I've also got to say that I wasn't impressed with the ambience; and the prices are a bit high for what you get. Good spot, but not so good that I'll be in a rush to come back.", "pics": null}}, {"review": {"des": "Wanna know why this place has 4.5 stars? Go eat there, then talk to me, if you don't agree.  <br><br>Went here with two friends for dinner and it was amazing.  Small space, with big flavor.  <br><br>First they bring out a nice loaf of bread and a little olive oil to start.  Then as you look over the wine menu, you start to feel even better.  The selection is amazing.  <br><br>Then we ordered and the food was phenomenal.  Great flavor, quality, and quanity.  This is one place you can go for Italian and not lose your shirt on the prices.  <br><br>The waiters are great and efficient and the menu is small, but plentiful in selection..not overwhelming.  <br><br>This is a gem of a spot, you have to look for it a little, but is well worth it.  I'll definately go back every time I get the craving for Italian.", "pics": null}}, {"review": {"des": "This is quite seriously one of my very favorite restaurants in the city of Chicago. It pains me to share this review because I'm so worried that people will FIND OUT about this place!<br><br>It is always such a quiet, pleasant atmosphere in the restaurant and the food has been consistently amazing for the 5 years my wife and I have been going to the restaurant. <br><br>Big time recommendation for this.", "pics": null}}, {"review": {"des": "Oh my! This is a lovely place with excellent food! I love the rosemary chicken! All the food is spot on! Try Thursday night for the special menu! Family owned & operated this restaurant is a great find! You will come back again & again....for more!", "pics": null}}, {"review": {"des": "This place is a neighborhood gem.  Authentic Italian food that is reasonably priced.  Enjoyed the special offered this evening swordfish - well prepared and seasoned just right.  Bread freshly made with a side of roasted garlic mixed with olive oil and some other secret ingredient.  Place it on warm home made bread. So much better than just butter! Our table also tried the veal ravioli, linguine with white clam sauce, and the Italian sausage.  Everything was tasty -white sauce in clam dish had a nice kick too it - not too spicy. Parking can be a challenge in this area, but well worth the visit.", "pics": null}}, {"review": {"des": "We really wanted to like this place since it is in our neighborhood. The wine was good, but the food was underwhelming and lacked strong flavor. We have had much better Italian food in Chicago. The dessert was also disappointing.", "pics": null}}, {"review": {"des": "A new favorite in the neighborhood! The grilled octopus and mussles are definitely a must get. The cocktails were also great, especially the mocatini. Definitely coming back soon!", "pics": null}}, {"review": {"des": "Great food , Service and atmosphere was awesome<br>Took girlfriend there for Valentine's Day was the best places that we've been too", "pics": null}}, {"review": {"des": "Cozy, un-crowded, great view of California Avenue from the window seat.  Respectable wine and bruschetta and attentive service.", "pics": null}}, {"review": {"des": "Go on Thursday for the $24.95 prix fixe menu.  Its a good deal.  Using the regular dinner menu, choose  (1) appetizer or salad , (1) entree or pasta, and (1) dessert .  The menu is made up  of authentic Italian dishes like Salsiccia con Escarole e Fagioli and Carpaccio as well as Italian-American faves that you would NEVER find in Italy (think any type of pasta and meatballs,  veal ,  chicken or beef with melted cheese on top. )  <br><br>Grilled calamari app was delicious. Carpaccio was well, like carpaccio.  With the warm bread and parm/garlic spread , it was great.  They have a decent wine list with moderately priced selections .  Feeling in an Ital/American mood, I went for the Vitello Monte Carlo. The veal was pounded paper-thin (to within a inch of it's life)  then topped with a slices of prosciutto and Fontina cheese.  The star of the plate were the thick potato slices , perfected crisped and brown on the outside, tender inside.  Spuds were far more impressive than the veal.  <br><br>For dessert, the classic French profiteroles with chocolate sauce  (not bad for an American place) and store-bought ( but tasty just the same) cheesecake.  I'd head back there for the $24.95 special on any Thursday night.", "pics": null}}, {"review": {"des": "We went around 5:15 PM on a Saturday, so the place was almost empty and they sat us near the windows. We ordered the Calamari al Tre Modo fried, and it was some of the best calamari that we had ever had. We've had our fair share of great calamari but this stuff was GOOD. The garlic and oil spread that they give you with the bread is to die for. I ordered the Angelotti Zuca which was unbelievable and my fiance ordered the Pollo Al Afumicatto. We both preferred my dish to his as his had a unique smoky taste, but it certainly wasn't bad! I felt my portion size was much bigger than his, as he received 2 large pieces of broccoli, a chicken breast and a pile of mashed potatoes.<br><br>The service was fantastic - our waiter came around just enough to ensure we had space and privacy to eat and chat but could ask for another drink if we needed to.<br><br>We will definitely be coming here again.", "pics": null}}, {"review": {"des": "Had an 8:15 reservation and got seated at 8:15.<br>Food was excellent, service was great, wine was fairly priced and desert was excellent. We will return.", "pics": null}}, {"review": {"des": "It's been a couple years since my last visit, and on that one, there was plastic in my friend's ravioli.  I won't be back after last night's dinner either.<br><br>For starters, the service was slow.  It took over 5 minutes for the waiter to come by and greet us and take our drink orders.  It was also only until we asked for bread that it was served.  You receive a dish of garlic puree to enjoy with your bread, but here's an insider tip: ask for the jalapeno olive oil.  The combo is so tasty! <br><br>The kitchen must have been behind, but it took a good while before our prosciutto wrapped cheese and beef carpaccio arrived, both of which don't seem to take that long to prep.  When my veal cerafino (with wine sauce and CANNED mushrooms, roasted potatoes, and bland broccoli) arrived, there was a folded light colored hair on my plate.  My bald waiter's joke about it probably not being his did not make the situation better.  My entree was taken away and a new plate prepared, but overall, this capped off a disappointing experience and meal.", "pics": null}}, {"review": {"des": "The staff was great, very polite, and friendly. The complimentary bread was warm and tasty and the roasted garlic was amazing. My family tried several different dishes and they were all delicious. The plates are reasonably priced with ample portions. I definitely recommend this place and will be going back.", "pics": null}}, {"review": {"des": "Ambience was great, food was amazing. Reasonably priced for the quality of food and service you receive. I would definitely go here again to try more of their attractive menu items!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ry862WVgB3GLafq-4kTsrQ/168s.jpg", "caption": "Veal ravioli with a brandy cream sauce and fresh mozzarella"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KYjOJh5WnJm8SnWytq11ow/168s.jpg", "caption": "Mussels with spicy tomato sauce"}]}}, {"review": {"des": "Had a reservation, got there on time, told us it would be 25 mins, we asked if they could call us when the table was ready, they said yes, we went to a bar three mins away and they NEVER called us to tell us our table was ready. Horrendous.  Plus we had friends in town.", "pics": null}}, {"review": {"des": "Went here for fancy dinner night with the bf and found out Tuesday's were half priced bottles of wine. So that was a nice bonus. Service was lovely. The whole thing was a really pleasant experience. Would definitely recommend this place to any one looking for a nice Italian dinner. Got the panda cotta dessert special and that was heavenly. I can only imagine everything else is up to par", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kouYERQqx3YbnpHL58JfzA/348s.jpg", "caption": "Forget exactly, but all super good!"}]}}, {"review": {"des": "Had the salmon special, perfectly cooked. Very good food. Loved the atmosphere and service.  Read all reviews and they were correct.  Highly recommend.", "pics": null}}, {"review": {"des": "Love, LOVE, love this family owned neighborhood spot.  We've been coming here since they opened their doors... must be close to 15 years by now (shame on me for not reviewing sooner!).  One of my most favorite starters on the planet is their Carpaccio de Barbabietola salad.  If you love beets...oh yeah, and a crispy, warm pillow of goat cheese, this is a must have.  I order it every. single. time!  Their regular menu has stayed consistent over the years (and being a creature of habit, this makes me happy).  It's always accented by a list of fabulous specials.  <br><br>First, I'm in love with the garlic paste they bring out with the warm loaves of bread.  I can slather this stuff on just about anything, but definitely the bread. And sometimes my chicken.<br> <br>My favorite pasta is probably one of the most simple dishes on the menu - the Capellini d'Angelo al Natural.  The tomato basil sauce is super fresh and feels like my husbands Italian grandma made it.  I'm also partial to their eggplant dish.  The Melanzana alla Emilia Romagna is three generous, thick slices of eggplant crusted with almonds and topped with a delicious mixture of caramelized onions and that fabulous tomato basil sauce.  Fresh & delish.  When I'm in the mood for meat, I usually order their grilled chicken dish, Paillard di Pollo alla Griglia.  Again, very fresh and I like the arugula touch.  <br><br>My husband usually hits the special menu and the seafood options have been fabulous.  Did I mention the octopus salad?  When I'm not hitting the beet carpaccio and the octapus salad is on special, it's another favorite. I digress.  Aside from the specials, my hubby's go-to items are the Costoletta di Maiale all Toscana (grilled pork chops) or the NY Strip, Bistecca alla Crosta di Parmigiano.  If you like pork, you're going to fall in love with the Costoletta Toscana.  I know, because I always as for a bite.  These are thick, juicy and the most tender t-bone pork chops...I should probably mention there are two?!?!  Honestly, there's enough for two meals, for sure. Unless your wife keeps steeling bites.<br><br>Not that we usually have room for dessert, BUT on Thursdays they offer a Prix-Fixe dinner.  For $25, you get an appetizer, an entree and dessert.  What a steal!  Sometimes we take the dessert to go and sometimes we go for it.  They have a nice selection of gelato, but I'm partial to the tiramisu.<br><br>Lastly, I'd be remiss if I didn't mention their bar.  Seriously, it's like Cheers in there.  I'm not kidding! If the owner and chef, Chepe, isn't behind the bar often you'll find his equally charming wife, Eileen.   A lot of regulars hang, and often eat, at their bar.  It's a great place to grab a cocktail while you wait for your table or to enjoy an after dinner digesif.  Perhaps a little grappa or amaro anyone?  <br><br>In addition to the warm & inviting service of the owners, they have a really great staff.  We've had some of their waiters taking care of us for YEARS and they know our choice of beverages by heart.  Let's face it, if the staff stay that long, you just know this place is special!", "pics": null}}, {"review": {"des": "We enjoyed the laid back neighborhood and family friendly vibe of this place. The service was good and the food was ok.<br><br>The beet Carpaccio with arugula and fried goat-cheese appetizer was really delicious. I have a thing for beets and this was really fun and unique dish. I'd call this a must-have. <br><br>The almond breaded eggplant was a undercooked, leaving it bit too firm. I think it would have been a solid dish if cooked through.<br><br>The Penne Arrabbiata was a garlic bomb, but lacking in spiciness and flavor outside of that. Not a very exciting dish.<br><br>My wife ordered the pappardelle bolognese and really enjoyed it. The noodles were nicely cooked and the sauce was very good.", "pics": null}}, {"review": {"des": "One of the best spots in Logan Square. I moved here in May, tried the cuisine my first week and now when I have people come to visit, this is my go-to place to introduce them to the area.  <br><br>The owner is a genuine guy, served us our drinks at the bar while we waited for a table, when I went to cash out he insisted that our tab be moved to the table so the server could receive the tip. <br><br>I would recommend this place to anyone new to the Logan Square area or surrounding neighborhoods who is looking for fresh food, amazing recipes, a high class staff service and a great atmosphere.<br><br>I have tried the fried calamari, amazing, the veal ravioli, incredible, the steak was prepared perfectly, the chicken with bacon sauce was delicious and the half chicken is something I will absolutely have again!", "pics": null}}, {"review": {"des": "I really really love this restaurant! My family and I go here often (pretty cool that the owners recognize us)! As a vegetarian, it's often hard to find non-meat options at Italian restaurants, but the penne arrabbiata here is by far my favorite dish at any Italian restaurant yet. It's creamy, filling, and just the right amount of spicy. The vibe is chic-the attire business casual. However, I've gone in a flannel and leggings and never given a second glance. The waiters and busboys are the sweetest ever. They make the establishment top notch. The food is incredibly affordable for the quality of food. My family like to go all together (six of us) because of this, we only go on Thursdays, when an appetizer, main dish, and desert are $24. This is A STEAL. We love it! I've chosen to give Buona Terra four stars because recently the price of this bargain have been steadily increasing, now it is approximately $28. Though not much of a change, for six separate orders, it adds up. We're hoping it doesn't continue to rise, doe unfortunately it will become out of our price range. I'd recommend this to couples, because at around $60 for a full meal, it's very much worth it!", "pics": null}}, {"review": {"des": "I was really craving some authentic Italian food one night. I remember riding my bike past here one night and remembering how good it smelled from the outside and how busy it was. So my friend and I met up here for dinner. We arrived at around 5:30.. a little early yes but hungry we were! We were seated right away. We got a table right by the kitchen and it was quite frustrating to have people and food runners walking past and brushing up against the back of my chair frequently. Also throughout our whole meal we kept hearing something that sounded like someone scraping their fork against a plate. <br><br>They immediately brought this amazing garlic paste and bread to our table. I would just come for the bread and garlic paste. I think it's made from sweet roasted garlic, olive oil, pepper and some other spices. I had to control myself or I would've eaten that till I was full! <br><br>Anitpasti- Fried Calamari Al Tre Modo: The baby squid was tender and crisp. I felt like that amount we were given was kind of small. It was probably 6 or 7 small pieces in total. The spicy tomato sauce that came with it just tasted like thickened shrimp cocktail sauce. It wasn't spicy either. <br><br>I ordered the Paperdelle bolognese. Paperdelle is one of my favorite types of pasta and you usually can't go wrong with classic bolognese sauce. The portion size was nice but I found the noodles to be overcooked and the sauce disappointing. I honestly felt like and said that I was eating Chef Boyardee sauce from a can. <br><br>My friend ordered the Spaghetti Al Gamberetti. Once again, overcooked noodles. The pasta came in a bowl of soup basically. I was hoping to find that thick rich tomato based seafood sauce. It was also under seasoned.. my friend emptied he whole bowl of garlic paste for the bread into her pasta. It actually made it taste better. <br><br>Finished off our meal with Tiramisu for dessert. Nothing special about the Tiramisu. <br><br>I honestly don't see what all the hype is about.", "pics": null}}, {"review": {"des": "So average. Despite of the clear instructions to be seated in the front room at a cozy table since my husband and I are celebrating our anniversary, the hostess decided to take us to the back room to seat us with families and kids even though, a few tables at the front room were available at the time. Dishes over priced for the quality of food served. Flavor doused with salt and the main entrees are bland.. I will definitely won't be going back..", "pics": null}}, {"review": {"des": "Very nice. Very classic. The menu hasn't changed in all the years it has been in the neighborhood; some might complain but I like knowing what I will be getting. A strong staple in the Logan Square area. Staff have always been accommodating and friendly. Their pastas are delicious and the complimentary warm bread is delightful.", "pics": null}}, {"review": {"des": "We grabbed a late dinner on Friday night outside. We were able to get a table right away, but it was also after 9. The service was friendly and prompt throughout. The bread was meh but the garlic spread was delicious. I had a pasta with peas, prosciutto, and mushrooms. This was decent but very rich; the Parmesan cream sauce was way too watery. My friend got the angel hair pasta with tomato sauce and basil and said it was good, but basic. I probably wouldn't go out of my way to come back here.", "pics": null}}, {"review": {"des": "The smell from the outside was so inviting that we almost stopped and changed our dinner plans to come here. But alas, we walked on by and decided to come back later. That fateful day happened to land on a Thursday which is Pre-Fixe menu day. Pick an appetizer, entree, and dessert for $25. Wow that's a great deal since entrees are pretty much around that price.<br><br>After we ordered, we got the bread with garlic spread. OMG. I could friggen bathe in this spread. Husband asked me not to say that in my review but NO ONE CENSORS ME... except maybe the FDA, police, Yelp, and copyright infringement people.<br><br>We got sauteed calamari and it was the most tender calamari I've ever eaten. I didn't quite care for the \"spicy\" tomato sauce but the calamari was absolutely delicious. We also got the mussels which came in a similar tasting sauce. It was okay.<br><br>Entree was Pappardelle Bolognese. It was tasty but honestly, the sauce tasted like Chef Boyardee Meat Ravioli sauce. Don't get me wrong. I friggen loved the meat ravioli sauce and thought it was tasty.<br><br>Dessert was panna cotta and the profiteroles. Both delicious.", "pics": null}}, {"review": {"des": "WOW is all I can say after a dining experience here! Everything was top notch and so unique. I came here after recommendation from a friend and was definitely not disappointed. It's one of my favorite places in the city now! Such a cute little place that's intimate and it has great quality food at a great value. <br><br>To start we ordered the prosciutto e mozzarella (mozz wrapped in prosciutto with mixed greens). There were four of those in the mixed greens and we could've probably in them all day. Delicious and never saw anywhere else. Wish all salads were like this one!<br><br>As the main course we had the gnocchi verde al Quattro Formaggio (green gnocchi with four cheese sauce).  the flavors were amazing and worked so well together. Gnocchi melted in our mouths. Almost Mac n cheese like.. But better. <br><br>We also ordered the Pollo Afumicatto, chicken with mozzarella in a bacon sauce (also flavored with something else). That also was delicious and the chicken melted in our mouths too. At the end we combined the gnocchi and the sauce for the chicken and it was also a great winning combination. <br><br>My boyfriend also liked his glass of wine. <br><br>I wish we could save room for dessert because the pastry stuffed with vanilla gelato with warm chocolate sauce on top looked very good. <br><br>We have to save room for next time! DEFINITELY GO! We took the blue line train at California and walked, though valet is available for $8.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2zixUDPI6NuO6nFtWdQRzg/348s.jpg", "caption": "Pollo afunicatto in a heart shape"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Bobz8VwSn2yNykFDX57CsA/168s.jpg", "caption": "Gnocchi verde in four cheese sauce"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LaHwwyr34F6U3p6Si0VZsQ/168s.jpg", "caption": "Prosciutto e mozz"}]}}, {"review": {"des": "One of the better dinner experiences in awhile.  It starts with the best roasted garlic and oil and chili oil spread with fresh bread.  Then couldn't decide so we ordered three entrees.  Gnocchi.....get it......branzino...on special with a great sauce... Flattened chicken......good <br>The service and family owned feel is in full effect.  Everyone was great and try this place for sure", "pics": null}}, {"review": {"des": "Kathy and I had the Best Diner at our favorite restaurant in all of Chicagoland. To begin with as you enter the front door you are greeted as if you are family. The owner Jose and  his wife Eileen make sure you are well taken care of.  The food is fantastic, the adult drinks are fantastic and desert is unbelievable.  Why go downtown or near north when you can have the best meal ever here. <br><br>Celebrated our Wedding  Anniversary last night at our favorite restaurant.  Words can not describe the fantastic food, friendly service and great staff.  If you haven't tried this restaurant yet you are truly missing the best.", "pics": null}}, {"review": {"des": "This is my hands-down favorite Italian restaurant in the area. Very small inside, but it does have two sides plus a bar and an outdoor area when it's nice. It seems very authentic Italian. Everything is fresh and delicious. Our favorite dish so far is the veal ravioli. We've come to the point where we always order that and then something new and we share both dishes. We've only been here twice, although we've tried a couple of other times and it's been busier than we wanted to wait. Luckily we live close enough we can order a pick up at any time we want and not have to wait for a table. The wait staff has always been super friendly and very knowledgeable about the menu. we always have a lot of questions and they're always very patient. An absolute must try, especially if you live in the area!", "pics": null}}, {"review": {"des": "Three friends took me to this Logan Square's gem for a birthday dinner on a Thursday night.  I wasn't familiar with this restaurant at all but they just raved about.  Cool - let's check it out.<br><br>We had arrived early on Thursday and we were seated right away in the dining room.  The restaurant is like two conjoined stores - the first part is the bar area with open seating and then the dining room is in the second store.   The dining room has the original wooden floors, exposed brick walls, wall of windows facing the street.  The atmosphere is formal but relaxed with the linen table clothes and napkins.  We were seated next to the window, which can be a little breezy but nothing to complain about.   <br><br>On Thursday nights, you can opt to have the prix fixe menu for $22.00 which is a great deal. I had ordered the Caesar Salad, Parmesan Crusted New York Strip and the Cream Puffs.  Sorry, that I don't remember what my companions ordered, but the mussels were a huge hit.<br><br>From the time we sat down to the time we departed, the service was impeccable.  One of my friends dropped her fork and by the time she picked it up, the waiter had a new fork for her.  <br><br>The food put all of us in a food coma.  The food was presented to us in the appropriate amount of time.  Well seasoned.  Just right.  Kudos to the kitchen staff!! My friends have been here several times, and stated, the food is always consistent.<br><br>On our departure, we met one of the owners, who was very gracious.  I would highly recommend the restaurant to everyone.", "pics": null}}, {"review": {"des": "Best Italian food I've ever had? No, but it is damned delicious. I love the bolognese, panna cotta, and that stupendously addictive garlic spread that is served with the bread. It's been about a month since I was there but I still think about it - the experience was that good - and I'd already be back again if I still lived in Chicago.", "pics": null}}, {"review": {"des": "Buona Terra continues to deliver great Italian food at reasonable prices!  This is my favorite restaurant in Logan Square and it continues to delight me each time I go.<br><br>I don't know if it's just luck or the fact that my friend who lives in the area is probably their best customer but we always get a great table, right in the front windows.  There is a patio out front which is nice (can't decide if I have only gone in the Winter months or if that is new as I don't remember seeing it before!) and a great place to enjoy a glass of wine as you watch the world go by!<br><br>Our service was great, the food quite good and the ambiance charming!<br><br>And the best news?  They still have their great prix fixe on Thursdays so the pricing gets even better!  Check it out!", "pics": null}}, {"review": {"des": "Hidden little gem in Logan Square.  I'm thankful for them being around the corner, because there really aren't any other good Italian options.  This place is very unassuming from the outside, but there food is really good.  It has become a Sunday night takeout mainstay for my family.  And their eggplant parmigiana is about as a good as I have ever had.  No joke.", "pics": null}}, {"review": {"des": "OMG, OMG, OMG...GREAT authentic and fresh Italian! Love it and have already been there twice within 2 months. Appetizers are to die for (even the bread and spread that is automatically given to you are enough to make you melt).", "pics": null}}, {"review": {"des": "For all the time spent in Chicago, I'm surprised I never visited. <br>Buona Terra, despite winning a couple of \"new restaurant\" awards (which is how I stumbled upon it in the first place...) isn't actually new, and is located right on the outskirts of Logan Square. It feels like a family-run, family-oriented, very cozy Italian restaurant. It has a pretty traditionally Italian menu, but has a focus on fresh ingredients and cooking with love. My boyfriend came and I came here with my Yelp wife, Alessandra S., and we tried the food. The atmosphere is more family-friendly, but I would come here on a date. The tables are very close to one another, but there weren't a lot of people when we went (perhaps because it was very late?) <br><br>I remember getting two specials, one being an appetiser that had burrata and proscuitto (though I'm not sure what the dish was called,) and gnocchi.  All of it was great. Burrata wasn't as good as the type I can get at Eataly or Pazzia in SF, but it was still delicious. My boyfriend got the breaded eggplant dish and really liked it, and my friend also got the gnocchi. When it came out, we both thought it wouldn't be enough, but it definitely was. And it was delicious. The servings, otherwise, are MORE than enough and you can definitely take it all home in a doggy bag. :) The other thing is the DELICIOUS garlic spread that they serve with the bread. YUM! Ask for extras. :) <br><br>All in all, we really liked Buona Terra. While not the best Italian restaurant, it is still solid and a place to come when you want to feel like family.", "pics": null}}, {"review": {"des": "Went here last minute after discovering Briciola was closed even though no message on their answering machine to let people know.  Anyway, Eileen the owner was very gracious and accommodating even with a packed restaurant.  The food was really good and flavorful.  We had bottles of wine with us as Briciola was a byob and for a $20 corkage fee per bottle we were able to consume our wines and enjoy a delicious dinner.  Will definitely dine here again.", "pics": null}}, {"review": {"des": "Had a lovely dinner last night with some friends. Food was great all around. OIwner was very friendly. Bartender was funny. Valpolicella was lucious, waiter was Italian, prices were fair. Is that enough to encourage you to go?", "pics": null}}, {"review": {"des": "Came here for our anniversary dinner last night and everything was pretty good. I ordered the<br>Pennine Al'arabiata which was unexpectedly very spicy but still good. I also ordered the Pollo Alla Provinciana which was a huge portion and it was very flavorful. The only complaint that I have is that the waiter never explained any of the specials to us, he just pointed at them on the menu and also when we asked for a nice wine to compliment our dinner he gave us two choices but again didn't explain anything about them. Besides those minor points we enjoyed the food, the atmosphere and the wine he suggested was actually very nice as well.", "pics": null}}, {"review": {"des": "Came here over the weekend with a friend for dinner. Really liked it. The staff is very  good and friendly. We had their egg plant dishes and a chicken entree. Loved it. Definitely recommend if you are in the mood for Italian. Cost us $65 with tips for 2 people so would consider that reasonable for a good European place.", "pics": null}}, {"review": {"des": "2.5 stars to be exact. <br><br>I decided to come after reading the reviews, but no, just no. So, I DIDN'T come on a Thursday for their prix fixe menu, like many others here. We ordered from the regular menu. I came on a weekend, well after 8pm. There wasn't a wait, which is good. Table for 4, we were seated by the windows. It took us a while to order because it was our first time here. But our waiter, oh our waiter, it seemed as though he was trying to avoid us or something. He barely ever came by to our table. But yes, we finally ordered. <br><br>I don't remember what the others ordered, but my bf and i got:<br>Sauteed Calamari <br>Salsiccia Con Escarole E Fagioli <br>Rotini Di La Nona <br><br>Really, the hero of the dinner was the sauteed calamari. It was cooked nicely, great texture. And even then, it was a bit too salty for my own liking. <br><br>On the menu, they described Salsiccia Con Escarole E Fagioli as this Italian \"homemade\" sausage served with some lettuce and beans. No, I didnt think it was \"homemade.\" It was overcooked, and a bit rock solid hard. The lettuce and beans side was a joke. It looked like it has been sitting out for the whole day and microwaved hot. I could eat that at all. <br><br>Rotini Di La Nona, it's this screw pasta with mushroom and green pea. Um, is it suppose to have this plastic looking gloss on the pasta? Are you sure you didn't microwaved this? <br> <br>Unless I am being invited/dragged by someone, I am not planning to come here again. Sorry.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bOAxN4xxmWGHRE7b7caUtQ/348s.jpg", "caption": "Rotini do la Nona"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OsfcgD-CmQI18pZQNleTQA/168s.jpg", "caption": "Salsiccia con escarole e fagioli"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jqptSSeMjVxsGfRtuirOuQ/168s.jpg", "caption": "Ravioli"}]}}, {"review": {"des": "I would recommend this place. Good, real Italian place. Nice people and parking not terrible.", "pics": null}}, {"review": {"des": "I love this place. YOU MUST TRY the angelotti zuca. Even just saying it is sexy and yummy at the same time!  We come here for the prix-fixe special: an appetizer, an entrée and dessert, all for $21.95. Everything tastes home made and fresh. Thursday s are the prix-fixe days and can get super packed. The service is always excellent and the atmosphere is a mix of romantic with casual yet sophisticated. You will never regret a visit to this treasure. I am pretty sure they take reservations which is helpful. If you are doing the prix-fixe menu, fast all day before dinner because it is a ton of food!!! Ciao!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NSIC2wcRLgl57J9IqMUJ3A/348s.jpg", "caption": "My leftover angelloti zucca"}]}}, {"review": {"des": "Oh the gems we find in Chicago. The food is just excellent.  The servers attentive and helpful. And yes, the garlic spread; it's delicious and I need it at home all the time. <br>I'm always down for a deal and Thursdays they offer an amazing 3course special for less than $25. This just too good of a deal to pass on and the food just took me to wonderful place. From the veal I had to the plates on other patrons tables everything looks and smells delightful. Possible new favorite, yes indeed.", "pics": null}}, {"review": {"des": "Must go! Please go! <br><br>I am in love with this little Italian place.  EVERYTHING IS JUST SOO DELISH. <br><br>GREAT Salomon, Chicken and the PASTTTTAAAAA!!  It's so fresh and has just the right amount of zest.  (MY mouth just watered)! <br><br>I love the service and the actual restaurant.  It's clean, cozy and very family like feeling.  <br><br>Perfect for dates, perfect for group gatherings and perfect for just because!<br><br>SOOOO happy I was introduced to this place! <br><br>(Do not order for take out- you have to dine in for the best quality)<br><br>xoxo, Koko", "pics": null}}, {"review": {"des": "Honestly, you don't need me to add to the impeccable reviews of this place. My brother comes here all the time and decided to take our family there for dinner. The back room is lovely - the decor feels rustic Italian. I'm pretty picky about Italian food because of my food experiences in Italy, but BT did 'er right. The pastas were clearly homemade, nice refreshing seasonal salads, tender & juicy chicken, thinly sliced/flavorful veal medallions, really great gelato made with love. The beauty is in the simultaneous simplicity and elegance of each dish. Love!!!", "pics": null}}, {"review": {"des": "Thank you \"Check, Please\" for the recommendation!!  My friends and I thank you! Buona Terra is a smaaaaaaaaal, cozy and feels like your in an Italian grandmothers home.  <br><br>Every dish that we ordered was perfection.  We started with  the fried calamari.  The batter was crisp without being heavy and the calamari, tender and not chewy. Friend one ordered Rigatoni Buona Terra: rigatoni pasta tossed in a sundried tomato cream topped with roasted walnuts and goat cheese. YUM!<br><br>Friend two ordered Gnocchi Verde al Quattro Formaggi: potato spinach dumplings in a four cheese sauce.  Also earns a big YUM!<br><br>Friend three ordered Rigatoni with Bolognese sauce.  Classic and perfect.<br><br>I ordered the Farafell Dominic: farfalle pasta tossed with asparagus, spinach, ricotta and parmesan cheese. WOWZA!<br><br>The portions are quite hearty so bring your appetite.  Unfortunately, we were stuff and had no room for dessert, which was a shame since a few things did catch my eye.  For the quality, and portions, the price is more than fair.<br><br>Apparently they have a Thursday night pre-fixe special, so I will be back to take advantage of that!<br><br>Until we meet again Buona Terra!", "pics": null}}, {"review": {"des": "We went at 515 on a Saturday they where not busy yet. They where very friendly and welcoming. They don't have a wide menu but where nice enough to make something that was not in the menu. My picky brother wanted chicken Alfredo and they cooked it for him it was delicious! By 545 the restaurant got super busy. I was smart enough to have a reservation made even though it would've not been a problem to be seated but if you decide to go after six call and do a reservation :) I liked how there was a wide variety of clientele. Definitely will be back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/P70sAbrrwWiawirr_6z-vg/348s.jpg", "caption": "Chicken in a sauce- Fried calamari & chicken Alfredo"}]}}, {"review": {"des": "They serve bread with this garlic spread which is really good.<br><br>I had the ravioli con vitello and I was not super impressed -- I don't know why. Everyone else on yelp seems to love it, but man was it average. <br><br>Also tried their pollo al afumicato and I think it was nothing to write home about. The mashed potatoes aren't all that special. <br><br>I don't know if I'll come back.", "pics": null}}, {"review": {"des": "This is our go-to-place for quality Italian food, great service, and a good time. We've tried many dishes, and all have been delicious. The bread with house made garlic sauce is a nice compliment! We also order the caprese salad (with buratta cheese if they have it in stock, so good!)", "pics": null}}, {"review": {"des": "Ordered a salad and soup to go and to say the least, the portions and quality were unfortunate. Being new to the area I really wanted to give this place a chance. Too many other options out there to give them another chance after my salad looked like scraps were thrown in a container with a dressing and sent out the door. Disappointed.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EjTajwH1GdS64QCWmyYkMQ/348s.jpg", "caption": "My salad...?!"}]}}, {"review": {"des": "Great service and very cozy inside. It's nice for a date night without having to feel like over dressing to \"fit in.\"<br><br>The Papardelle Bolognese is amazing. Even more amazing is their garlic spread that comes with the bread. I could eat that stuff by the spoonful! <br><br>Each time I've been here I haven't had a difficult time finding a table.", "pics": null}}, {"review": {"des": "Amazing. Can't say enough good things. This place has delicious food, attentive service, great wine selections, etc. A combination not often found in in a small friendly, neighborhood atmosphere. Love going here with friends. When family is in town, they always want to come. I even take business clients here, as the wait staff are the perfect balance of attentive without interrupting conversation - but do go early for that as it can get a little loud.<br>Love the eggplant, the butternut squash and sage ravioli, the rigatoni buona terra, the Bolognese... could go on and on! <br>They are accommodating of larger groups, but call ahead for that as the place fills up!", "pics": null}}, {"review": {"des": "Whoa. Rigatoni Buona Terra was amazing!  Sundried tomato cream sauce, with roasted walnuts and goat cheese.  Almost got the bolognese, but made a game time decision and went for the rigatoni.  I'm drooling thinking about it now.  Also had the bruschetta, which was tasty.  My girlfriend got the bolognese, and that was also good.  Cute place, outdoor seating, loud dining room, friendly server.  Definitely will come back.", "pics": null}}, {"review": {"des": "The food, service, and ambiance were fantastic. 10/10, would recommend. The Buona Terra Pasta dish was so simple, but so good!", "pics": null}}, {"review": {"des": "This is a cozy little italian place right off the highway. Good prices, good food. I had the rigatoni and man was it delicious. Its a rigatoni drenched in vodka sauce and goat cheese and nuts sprikled on top. Just the right amouny of cheese and nuts.<br><br>They give you bread at the start with this mustard sauce thats pretty tasty. I slso had a tricolor salad, which was nothing special just a simple salad.<br><br>Lastly, for dessert they have canoli. And it definitely didnt dissapoint. Some italian restaurants are hit snd miss. But this was spot on italian. Definitely recommend the canoli as a finisher.<br><br>All in all it was a good experience and i would come back.", "pics": null}}, {"review": {"des": "My favorite go to place when we lived in Chicago. Now I try to visit everytime we are in town. The garlic dip is fabulous. My husband always gets one of the veal dishes. I always get the penne arrabiata. It's the perfect amount of spice. Our son loves the angel hair pasta bolognese.", "pics": null}}, {"review": {"des": "First time at Buona Terra and was blown away. When you are craving Italian, this place knocks it out of the park. Came here with 3 other people who were equally as impressed. Definitely will be back!", "pics": null}}, {"review": {"des": "Service was great!  Had the burratta appetizer which was really good. The only downside is that the main meals were very salty. We had the pork chop T-bone which was a huge portion and the gnocchi. Overall good restaurant but the saltiness took it down a star rating.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/j4H-KbPBaxsZdNc2FqMGgA/348s.jpg", "caption": "Pork T-bone"}]}}, {"review": {"des": "This is easily one of the best Italian restaurants in the city.  Everything from the garlic tapenade to the Papardelle Bolognese to all of the secondi dishes are perfect- both delicious and satisfying.   The atmosphere is warm and inviting, the service is always very quick and very kind.  The pricing is also very reasonable, which I highly appreciate.  My wife and I love this place and it's always an easy choice for a night out.", "pics": null}}, {"review": {"des": "This is our family's go-to spot - everyone loves it, loves going on Thursdays for the excellent value and food and even had grandma's birthday here along with numerous other family events. My uncle is a dear that hands out gift certificates here like candy at Christmastime.<br>There are items that don't always appear on the menu - my favorite being the Vitello Serafino? - with mushrooms and pine nuts - deliciousness. <br>Perfect carpaccio - pounded out the way it should be, with fresh parm curls and capers and I think a bit of truffle oil. <br>Calamari is always fresh and divine as well as the ravioli - both veal and squash.<br>Their chocolate dessert in a hazelnut crust is my favorite but their panna cotta is pretty bangin' also.<br>Aaaaand - the most perfect Grey Goose cosmo in all of Chicago - yes people it is possible to screw it up. I have had way too many crappy ones, but never ever has it been here.", "pics": null}}, {"review": {"des": "Love this place.  The atmosphere is quaint, the staff is accommodating, and the food is delicious.  I have been here several times and can always rely on everything being on point time and time again.", "pics": null}}, {"review": {"des": "Bouna Terra, your Garlic spread is wonderful and highly addictive. I could smear it on everything. We went a few weeks ago on Thursday and had the pre-fixe dinner. We had the Beef and Salmon Carpaccio and the grilled octopus as our 1st course.  All were delicious.<br> The beef was excellent as always, this was the first time we tried the Salmon, which was very good too. Our entree's were the Steak, Veal and Eggplant all very with a great presentation and flavor.  For dessert we had Gelato, Profiteroles and a very good Chocolate tart which I've forgotten the name. The service was wonderful and the staff as usual is always attentive. We can't wait to return for a another great dining experience.<br><br>Have you given any thought to selling the garlic spread to go? I think it would be a great carry out item :-)", "pics": null}}, {"review": {"des": "We came here late on a last minute hunch with my new friend, the server took his time and we were not treated like we were rushed out although we showed up about 1 hr before closing. I can't recall what we ordered but it was all delicious. The place looked small but cozy. Great place for a first date.", "pics": null}}, {"review": {"des": "A cute little Italian restaurant in which I thought had the best appetizer and dessert - I had their Olpi Alla Griglia (an octopus appetizer that I thought was so flavorful, the octopus being quite tender, and that it was better-tasting than Babbo's in NY!). Their cannoli was unbelievably devine!  It had the right amount of pistachio and the filling was so creamy, and the cannoli's exterior was also crunchy and tasty.  Their pastas/entrees weren't anything to my liking, but, I would definitely come back here for the octopus appetizer and for their cannoli!<br><br>+Olpi Alla Griglia appetizer<br>+cannoli!", "pics": null}}, {"review": {"des": "Started off with a basket (actually 2) homemade bread with garlic onion purée, amazing. Homemade minestrone soup was so flavorful, and warmed ya all the way through. It felt like mom made it from scratch.  Special of the day was a sausage rigatoni with red peppers and smoked mozzarella. I'm from WI and this cheese was .....delicious (thick, stringy, just slightly crispy for a nice smoked flavor). I couldn't decide for dessert on the cannoli or special (vanilla custard with fresh berries) so I got them both. Best decision ever.<br><br>Very good energy, the food had that love in it. <br>I'm leaving with food to go and a full happy belly.", "pics": null}}, {"review": {"des": "came into tonight after an impromptu date looking for an italian restaurant. decent neighborhood, ample parking.<br><br>Saturday night, around 6:30, immediately were able to get a table for 2 without a reservation. waiter greeted us and showed us the wine specials, came back a few minutes later to take our order and to bring a bread basket (delicious garlic spread). i ordered the gnocchi verde and it was delicious. our food was ready in about ten minutes. <br><br>waiter, hostess, and manager (?) all very nice and said thanks for coming in. food was great. nice ambiance. need a little more elbow room between bar and tables against the wall (a few people were lingering by our table as we ate). <br><br>will definitely be coming back.", "pics": null}}, {"review": {"des": "Great Italian food. <br>Made the reservation the day before, no problem. Was seated immediately. My waiter was actually very attentive, despite previous reviews written about this place. He recommended a great red wine. The food was delicious. All of it. I ordered the rigatoni, you won't be disappointed and the leftovers are just as delicious! <br><br>My only issue is the seats are so close together that you're basically in everyone's conversations", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/45oZICDZsQwdxneP4xAV-g/348s.jpg", "caption": "Rigatoni, must!"}]}}, {"review": {"des": "Been going here since they opened, pre Logan square hipster days! The garlic spread they serve w/ their bread is something I DREAM ABOUT. I've never had a bad meal here- love the rigatoni w/ goat cheese & walnuts is one of my faves though. Family owned & operated, family friendly, super chill neighborhood spot!", "pics": null}}, {"review": {"des": "Great female bartender! Yummy cucumber martini. Then we sat down at table...waiter was useless...couldn't answer any questions about substituting items due to gluten free issues and a friend with an allergy to broccoli. Could have made it so simple...lots of options on menu but he couldn't make that happen. After way too much discussion he left and returned saying they could handle more veggies to replace potatoes...end result was REALLY good but it took too much hassle to get there!?????", "pics": null}}, {"review": {"des": "Good pre-fixe value of $22 for 3 courses from the entire menu (Thursdays).  But I'm not sure if it's worth the a la carte prices if you're not going there on a Thursday.  I had the grilled calamari over mixed greens (too salty); chicken with smoked bacon infused tomato sauce, steamed broccoli, and pesto mashed potatoes (chicken was tiny!); and the profiteroles filled with vanilla gelato for dessert, which were good.  The best part of the meal, though, was the garlic and oil spread that comes with the free bread!  I had like 5 slices of bread because I didn't just want to spoon the spread directly into my mouth.<br><br>The restaurant is small, and our party of 6 occupied the largest table in the middle of the room.  The service was great - our waiter joked around with us, and another lady checked up on us at the end of the night to ask how everything was because she \"heard a lot of laughter.\"", "pics": null}}, {"review": {"des": "Great little neighborhood place. Food is fresh and high quality, service is above average, and prices are reasonable for the area. Would highly recommend.", "pics": null}}, {"review": {"des": "very crowded and we had to put our name on the list and come back half an hour later even when it was 8pm already!!   But it was worth it!  Loved the noisy crowded Italian family restaurant atmosphere!", "pics": null}}, {"review": {"des": "We stopped in on a whim driving though Logan Square. All we wanted was a place that could seat 5 right away outside on a sunny Saturday in May. Boy, did we get lucky! This is just a quaint neighborhood Italian place. They make some of the pasts in house but not all of them. The wine selection is respectable and the service was great. Just order whatever pasta is made fresh! You won't regret it!", "pics": null}}, {"review": {"des": "I used to live down the street from Buona Terra so it became a regular in our rotation. The food never disappoints. I love the cappelini and gnocchi enough to crave them on a regular basis, and the garlic spread you get with your bread is unique and delicious enough to eat with a spoon. (I know from experience.) The staff are always very friendly and attentive.<br><br>This is our go-to takeout for New Year's Eve and dine-in for less crowded special occasions. My husband and I even had the rehearsal dinner for our wedding here - which was a fantastic experience. All our guests raved about the food, and the service was exceptional.", "pics": null}}, {"review": {"des": "Even one star would be too much based on the inferior service I received. Stay away for sure, and the food is not worth the price tag.", "pics": null}}, {"review": {"des": "What a lovely place this is! I've been eating here since it opened and am still going back quite regularly. This is a family run establishment and they are the sweetest people. The prix fixe on Thursdays is the best deal. App, entree, dessert... all great. Ambiance is cozy, clean and inviting. Service is excellent and very friendly. Also a great place to get carry out. <br>Overall this place is a must. Certainly on par with any other italian restaurant in the city.", "pics": null}}]}