{"name": "burger-bar-chicago-lincoln-park-chicago", "reviews": [{"review": {"des": "3 things here. I would love to say more but I couldn't fit anything else. <br>Hot and Smokey Burger was one of the best I've had in my life. BBQ Beef burger with smoked pulled pork and grilled andouille sausage... amazing. <br>The Carolina BBQ wings had a char to them, amazing flavor, and big and juicy. I'm from Buffalo, NY and know good chicken wings... THESE ARE LEGIT!<br>Shakes... i don't want to even write about how amazing these were or else I'm going to want to order another one. Nutella Banana. Yes and yes!<br>Great place. A must visit. Many different beers as well.", "pics": null}}, {"review": {"des": "(9/9/18) This place is a MUST VISIT! I have passed this place a thousand times and told myself I would go. Finally went on a sunday during brunch hour timing. A group of friends and I went and ordered a lot of food. Items that are a must try <br>Sassy wings<br>Queso Guac chips <br>Barbarcoa Stacker <br><br>The wings period are a must try. Grilled and cooked to perfection. The wing is amazing without the sauce. By the way the sauce does not match the flavor of the wing. It would totally throw your wing off if you did. <br>The interesting thing about the Queso guac chips are that the chips are like house made and have this amazing flavor. It isn't your normal chips and dip so that's why I would recommend it. <br>The barbarcoa stacker (burger) is big and amazing. I wasn't too hungry now was I wearing the appropriate clothing or else I would have finished the meal. <br><br>Not so much...<br> Chicken Burger - looked a little weird to me. I am happy I did not purchase this burger because I imagined something totally different. <br><br>I would recommend ordering one of their signature burgers unless you are really picky than I would do the build your own.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/L5jzwbRlfy3vIEiMKUGL3Q/348s.jpg", "caption": "Sassy wings"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sFPjofMwD3lsOWSip0xpwA/168s.jpg", "caption": "Queso guac chips"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zP36lnGxD2cCPkND5IVLnQ/168s.jpg", "caption": "Chicken burger"}]}}, {"review": {"des": "Wow, I came here for lunch and left stuffed! <br><br>We wanted to go to Sonos, but the hours were wrong so we headed next door to Burger Bar. It's such a cute little place with a super fun atmosphere. I started with the blackberry pear beer and was ready for my burger!<br><br>My goodness, I got the barbacoa burger. I knew it would be big but holy moly. I was shocked at how big. It was a chorizo angus burger, with barbacoa on top, avocado salsa (basically guacamole), Chipotle aioli and pepperjack cheese. I LOVED it! It was such a perfect amount of spice- not so hot that I couldn't continue to eat but still a little spicy. <br><br>My boyfriend got the build your own with premium angus, onion strings, and cheese. I took a bite and was blown away too! You honestly cannot go wrong with a burger at the burger barn. It's definitely a great place to check out after a long day of shopping.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8fgNjppTTOG8_oMtuyILag/168s.jpg", "caption": "Barbacoa Stacker"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xdWo9Vpt6DgY7p6pOw7rYA/168s.jpg", "caption": "BYO 1/2 lb. Premium Angus Burger"}]}}, {"review": {"des": "I have been here a few times and I have enjoyed every bite, every sip and every experience I have had at the Burger Bar.<br>Now, I have to also say with great service and food it comes with a price and this place isn't cheap but it is great if you want to splurge a little.<br>The shakes are $6.00(I have tried the triple chocolate, the banana Nutella and the Oreo Blitz) all very good, the add-ons can cost you anywhere from .50 to a $2.00 if I am not mistaken.  The burger can start at 10.00 dollars but that is without the add-ons.  Remember that the parmesan fries are an extra $1.50 which we didn't pay attention to at the time of ordering. The sweet potato tots are an extra $2.00.  I do wish they would mention or remind you that they are extra just in case you didn't see the fine print. The Parmesan Cheese Fries were good but my burger was so big I didn't really eat them all...so for us we wasted $3.00 dollars.  We also got the fried pickles and they are tasty you just don't get that many for $7.00 so if you are in a group of more than 2 you may want to order more than 1 order of the fried pickles.  They have a kids menu which I believe was like $6.00 but don't quote me on that. My grandson had mac n' cheese(delicious), fresh fruit, fries, and chicken tenders(I think). The Carolina BBQ Flavored Chicken Wings were my least favorite for $12.00 but I did order them because they weren't as spicy. There homemade chips are very good and I wish they could bag them and sale them I like them so much. Oh I forgot to mention that you can make your shakes an adult shake for an extra $3.00.  I do wish they had more variety of Mocktails for people who don't drink or for the designated driver.  I don't always want a soda or a shake it is cool to have a Mocktail every once in awhile.<br> I will be back and as always....<br><br>Enjoy!!!", "pics": null}}, {"review": {"des": "I went to Burger Bar recently to grab a burger and beer and the experience didn't disappoint. I have been here a few times before and never had a bad experience. Recently I found out I was diagnosed with Celiac Disease and immediately I was bummed because I must stay away from most beers and breads. I saw that Burger Bar had a gluten free bun on the menu and definitely decided I needed to give it a go. They've also got Two Brother's Prairie Path so I'm good!<br> <br>I recently built my own burger with the grass fed patty, the gluten free bun, lettuce, tomato, cheddar, and avocado, with a side of sweet potato fries. When it arrived it didn't disappoint. The burger was cooked perfectly, was very juice, and the bun wasn't bad either! The bun was a little dry if I had to complain about anything but it beats a lettuce wrap any day! The only negative was the fact that my sweet potato friends never arrived and I got regular fries instead. Not the end of the world.<br> <br>The menu has plenty of specialty burgers which sound great but I generally stay away because they're gigantic. I'm never THAT hungry but if I skipped lunch I could definitely be convinced. Overall it was a good experience and I'll definitely be back. You can also book a reservation if you're concerned it's going to be packed. I wish more casual places would do this!", "pics": null}}, {"review": {"des": "The service when I went into this location was great  I guess the server (Nikki) and time of day (lunch) made a difference in comparison to some of the other reviews. <br><br>I had the Angus half pound burger with bacon and pickles (well done) with sweet potato fires, and it was probably one of the better burgers I have had in a long time. My party and I were allowed to enjoy the meal without any crazy up-selling was was fantastic for us.", "pics": null}}, {"review": {"des": "If you haven't had a meal all day stop into the Burger Bar. Extremely large burgers that are made with a few different cuts of beef. They even have a shrimp burger for our pescatarian friends! Large restaurant, but you sorta get the vibe like you're back in the suburbs. If you're a burger lover like me you won't be disappointed.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6zQQMG4mAlTUkpIUBrrwWw/348s.jpg", "caption": "Half beef half brisket topped with crunchy tortilla strips and fries."}]}}, {"review": {"des": "Furniture shopping with a friend on Sunday. Stopped here for a late lunch. It's a big place, and there was plenty of seating.<br><br>I wasn't very hungry, so I had a starter... bacon waffle skewers with spicy bourbon maple syrup. There were four bacon skewers coated with waffle batter and deep fried. I know it sounds porky, but the portion is small. Loved the skewers, but I didn't care for the syrup, which had too much of a kick (would be better on wings). And the portion of the runny syrup was small, only a couple of tablespoons at most. <br><br>My friend had the Cobb salad... mixed greens, chicken, peppered bacon, red onions, tomatoes, blue cheese, chopped egg and a generous amount of avocado. She realy like it, and she raved about the ranch dressing. <br><br>Our server was friendly and filled my coffee cup three times, which I always appreciate. My only gripe is the parking situation. The lot that's next door charged us $12 for 70 minutes, and the restaurant doesn't offer validation. Next time we'll park in the NewCity garage, have lunch at Burger Bar, then buy a few groceries at Mariano's and have our ticket validated.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4VpKMsrL2RrjJiWusns7ew/168s.jpg", "caption": "Great Cobb salad."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/67JXmaQq4HWDAi6uO-Ln7g/168s.jpg", "caption": "Some like it hot. I don't."}]}}, {"review": {"des": "I've heard only good things about Burger Bar, so it was time I tried it<br><br>I love how simple this place is. They have burgers with frills but you can also BYO. They have options on what kind of meat patty and different buns as well. I had the prime beef with bacon and the bacon brioche bun (can you tell I like bacon). The burger was well seasoned, juicy and flavorful. For the bun, I couldn't taste the \"bacon\" oil that it's supposedly cooked in, so next time I'd opt out and get a regular bun to save $1.50<br><br>The rave about Burger Bar did not disappoint and I just may have found my new go to burger spot :)", "pics": null}}, {"review": {"des": "We came here on a whim on a Sunday night around 7PM. The restaurant had a lot of open tables, so we were able to get seated right away. The menu has a lot of unique burgers, such as a bison burger with goat cheese and tomato chutney, and a beef burger, with smoked pulled pork, and grilled Andouille. We ultimately settled on the Bahn Mi Burger ($16) with sweet potato fries and the Barbacoa Stacker ($15) with normal fries. There are also additional complementary sauces you can order with your fries, so we tried the urban sauce and the lime crema.<br><br>The burgers arrived on the slower side (around 25-30 minutes) despite the restaurant not being busy. Both burgers were incredibly juicy and flavorful; the Bahn Mi burger was sweet from the ginger soy pork belly, and the Barbacoa Stacker had a nice smokey flavor from the pulled pork. However, both burgers were very very salty, which made them harder to eat as you got to the end. The urban sauce was a great complement to the fries, as opposed to the lime crema which tasted like a thick flavorless cream.<br><br>Overall, really solid burger! Would be one of my top burger places in Chicago if the salt were reduced and the service was speedier.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jOD0jOHF-ECaI-3qCT5dJw/168s.jpg", "caption": "Barbacoa Stacker ($15)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ox97sDpcfNInvjs1WgtqQg/168s.jpg", "caption": "Bahn Mi ($16)"}]}}, {"review": {"des": "Burger was pretty good, but medium preparation request ended up coming out well done. A little skimpy on the fries, too. Overall it's fine...just would have expected something a bit better at the price. Restaurant is large and lots of outdoor tables.", "pics": null}}, {"review": {"des": "This place is delicious. The burgers, chicken burger, fries, sweet potato fries, sauces, pickles, etc! Was very impressed.", "pics": null}}, {"review": {"des": "Been here a couple times when in the neighborhood. Service can be hit or miss, but nothing worth complaining about or I would have done it already. They are usually pretty good about making suggestions especially with my daughter who is a much more adventurous eater than I am. She got some kind of shrimp burger and loved it. Once I came with my kids and we made a mess outside when bees chased us and our shakes, once I thought I had enough time to eat while waiting for the Apple store but I was too nervous and wouldn't enjoy it so I left without ordering, and once I just needed a drink and some wings and we had decent service each time. <br><br>It's worth a stop.", "pics": null}}, {"review": {"des": "Mediocre food and atmosphere. You feel like you're at a fast food/chain restaurant (and that's how the food tastes, too) while the burgers are still $16 for an entree. They have a lot of craft beer options, but limited to their domestics--PBR and Miller High Life. <br><br>We made a reservation on OpenTable and got there 5 mins early. They wouldn't seat us until our reservation time. Even though there were multiple tables open and they were seating others that walked in after us. <br><br>When our food came out and was placed in front of us, 2 servers came back over and were arguing that one server took the others food. They turned to us and said oh that's not your food and took back what they placed in front of us. 5 mins later they returned with food and mine was lukewarm. Did someone else get the food they placed in front of us that we potentially touched? <br><br>Don't really have a need to return unless I'm really craving a burger and in the area as there aren't a lot of restaurants nearby.", "pics": null}}, {"review": {"des": "I am so impressed! We came over here after a two hour fiasco at the Apple Store, and I was hangry. They fed us well, and my mood improved before our long drive back to Bloomington!<br><br>It was about 2 pm and we hadn't eaten all day, so we began with the queso-guac-chips and the fried pickles. My wife really loved the queso and the seasoned chips. I liked the freshness of the guac, but the chips and queso weren't really my thing. That's okay though, because the fried pickles were fantastic! It worked out really well for us, because I had the pickles and she had the queso, and we were both very happy. <br><br>When it came time for burgers, she made her own with cheddar cheese and sweet potato tots and I ordered the Barbacoa Stacker with truffle fries.  Now, anyone who knows me, knows that I don't like messy food, but this burger just sounded too good! It was amazing! I honestly can't remember a burger that I've liked more. Yes, it was messy, but I cut it in half and ate over my tray, and I didn't make a mess of myself! The flavors worked so well together -- someone in the kitchen really knows what they're doing! The truffle fries were also excellent. Service was excellent as well -- from our waitress to a very friendly busser . <br><br>We each packed up half our burgers and most of our fries & tots and we finished them for dinner back in Bloomington! <br><br>If you are in the area, I highly recommend coming here, I don't see how you could be disappointed!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LBlZUvtBlxA4bwTdxYIH5w/348s.jpg", "caption": "Queso - Guac - Chips"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Zst5tbd2RuGCLYhKvNUJRw/168s.jpg", "caption": "Barbacoa Stacker with truffle fries."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Bzuv8CcxXrSYKVmCe7tJoA/168s.jpg", "caption": "Menu side one."}]}}, {"review": {"des": "Very very good place. Its a little pricey and the location makes for very tough parking but it definitely worth it for a pretty decent quality burger. <br><br>I had a grass fed burger Firehouse burger and was very pleased with the flavors and the contrast between the spices in the burger and the delicious chorizo. <br><br>Kids menu was great as well, my kid was a fan of their chicken fingers. <br><br>Bonus for the playing of the music I love.", "pics": null}}, {"review": {"des": "First time here and felt welcome by all the staff but especially our server carms. She was attentive and always had a smile on her face. She gave us great ideas and didn't seemed bothered at all to make any changes to any of the burgers. <br>We both had the burgers and picked their special blend which she said would be juicy and it was perfect. I had the special that came with fried pickles on it and can see why they are a favorite. I also ordered a side of gravy for my fries which only made me want the poutine on our next visit.<br>Great food and service we will be back.", "pics": null}}, {"review": {"des": "The waitress was amazing! Super understanding and comforting! The food was good but the main reason for the low star rating was due to the fact that my husband had specifically ordered his burger without the chipotle sauce. He was clear. The waitress was clear about not having the chipotle sauce on it. But the cook had still put the chipotle sauce on the burger. The reason this is so important is because every time my husband has something with a pinch of spice, it hurts his stomach. Now he is in a ridiculous amount of pain and it has utterly ruined his night. All of our remaining plans had to be canceled. When the new burger came out, his stomach was already beyond uncomfortable and apparently it was the manager that had gave us the burger. But we didn't even know it was the manager until we asked the waitress. He didn't seemed that apologetic or concerned about this huge mistake. The waitress was constantly apologizing and sympathetic. We still payed for the burger and although the manager brought out a new one, after your stomach is in a state of pain, you are not concerned with eating anything new. The manager practically dropped off the burger and left.", "pics": null}}, {"review": {"des": "Terrible it putting is nicely. I chose this place for convenience, because I was conducting business in the area. Now I'm a huge burger and fries lover. However, not every place can excel at both items, however the place flunk on both. <br><br>I probably waited up to half an hour for my burger. They only time I have waited that long, is during lunch rush, which is perfectly reasonable. This next complaint may seem petty, however my to go bag, nice paper bag was stapled close. I practically rip the bag apart just trying to get to my burger. So if the burger was exceptional, I had no way to carry it now. The second thing, I asked for my burger to be medium. It was in between medium well and well done. The burger was not seasoned, and the fries were hard. How you make fries like that, I have no idea. It good thing it a bar, because you have to buzz or drunk not to notice.", "pics": null}}, {"review": {"des": "Went for the first time today. The menu looked very good, as they offered quite a bit of different burgers and upgradibility for meat quality. I ordered the Turkey burger with sweet potatoe fries, and I have to say both the burger and fries were the best I ever had. The Turkey burger was succulent and well seasoned but not overly so, and the fries were crispy on the outside and very soft on the inside, light coarse salt to offset the sweetness of potatoes.  The pretzel bites were delicious too, nice amount of garlic and parmesan cheese with a fantastic German mustard.", "pics": null}}, {"review": {"des": "Visited this place for a Saturday lunch, it was moderately crowded. We ordered a nacho chips, veggie burger and a chocolate shake. The chips tasted like packets Doritos, the burger was good though, one things I liked about this vegetarian burger was unlike most places they did not stick to black bean patty, which was a good thing. The food was average, I've heard a friend rave about this place for quite a while, probably I ordered the wrong things. The shake was mind blowing! That was probably the only thing my taste buds remember about this place. <br><br>I would say it's a must visit, but for a casual burger and shake kinda day, is it a good place. <br>They have an outlet is Roosevelt (south loop ) as well.", "pics": null}}, {"review": {"des": "Came here last night for dinner before going to a friend's show. We made a reservation just in case, but it turns out it wasn't nearly as full as expected for a Saturday night. Waitress was perfunctory and polite, and I built my own burger - grass-fed, medium, provolone, pickles, and crispy onions. It was quiet in the place though I think there were many more tables outside in the heat.<br><br>Burger was a little less than medium - bit in and blood ran down my arm, but I will say it was a great burger, especially with all the crispy onions. However, for my side I asked for sweet potato tots, and received sweet potato fries. Wasn't going to mention it my friends mentioned it when someone who was not the waiter came by. They ended up bringing out piping hot, fresh tots, and now I have leftovers, which isn't too bad.<br><br>Overall, a really solid experience, though the meat cook was not precise, which was something I noticed in other reviews and why I asked for medium, hoping that would give it a closer cook. Would come back because the burger was good and it looked like they had a solid milkshake menu as well.", "pics": null}}, {"review": {"des": "This place had one of the most savory burgers I have ever tasted. The service was extremely quick, and I was very satisfied with my overall experience. <br><br>Me and my girlfriend just came from the shedd aquarium and we were both craving burgers, since this was the closest place to us we decided to stop here. The atmosphere of the place was very welcoming it was not too crowded but there was still people there to make us feel at ease. Our service was really quick, we managed to put in our order 15 minutes after arriving, I'm guessing because it wasn't busy but there was always more than enough people walking around making sure we were taken care of. The wait time or our food was pretty average too, it was not super quick but it wasn't so long to where you would start asking \"where's my food?\" It was around 20 minutes. <br><br>As for the food, my burger was amazing! I ordered the \"Build Your Own Burger\". I got a well done burger with bacon, lettuce, and tomato. With a side of fries and barbecue sauce not only for my burger but for my fries too. The burger was extremely well made and was very savory. You would expect a well done burger to taste kind of burnt but that was not the case at all. The fries were well seasoned but was still missing something. I felt that I had to constantly dip my fries in barbecue sauce to stop it from tasting like cardboard. As for the portion size my burger was was not huge but was still more than what I was used too. The fries came in a pretty small amount but with a burger of their size you wouldn't need all the fries anyway.<br><br>This was the first time I finished a burger of this size in one sitting! Everything was made perfectly, service and atmosphere was very welcoming and overall I had a good time there! I just wish the fries were made a bit better but its just something small. The prices were pretty reasonable to the amount and quality you receive, its not super cheap but not pricey either. I recommend this place to anybody looking for nice burger bar to eat at, trust me you wont regret it!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ooemtQ6WWCJU6wWpPGf0eQ/348s.jpg", "caption": "Build your own burger with lettuce, tomato, and bacon with a side of fries and barbecue sauce."}]}}, {"review": {"des": "Unbelievably delicious food, sincerely great service (from every staff we interacted with!), laid-back atmosphere, awesome/big food portions, and unbelievably fair/low prices. <br><br>I had the chicken burger w/ a gorgeous whole-wheat bun, perfectly done (not greasy) sweet-potato fries, and a Diet Coke. My girlfriend had the veggie burger w/ regular fries and a Diet Coke. Just by LOOKING at the food--for example, the patty in each burger--you can see that they put a lot of thought and creativity into creating their food, which is what makes it so perfect, not overly-complicated, and not too plain/basic. And, as for the taste of everything, well, it was all phenomenal, and we felt no \"food coma\" or GI issues at all afterwards, including my girlfriend, who's gluten-intolerant and, therefore, had her veggie burger  w/ gluten-free buns; even though the veggie patty wasn't gluten-free, it actually caused her no GI discomfort. <br><br>So, all in all, superb quality place, food, and people.<br><br>Just a tip, though, expect to drive around a bit to find parking. WELL worth it, though.", "pics": null}}, {"review": {"des": "My Husband had been here a few years ago and loved it. He'd brought me leftovers and even those were good, so I was excited to try it fresh and I suggested we stop in for our Anniversary Lunch since we were in the city and not incredibly far away.<br><br>I was stoked to see they had Poutine on the menu and went all out, adding Smoked Pulled Pork and a Fried Egg. My Husband went equally hog wild, ordering the Bratwurst Corn Dogs. I got a VanderMill Hard Cider (Raspberry) on tap and this is what we called a \"Starter.\" These items could have easily been their own meal, particularly the Poutine.<br><br>The Poutine was great but I'd skip the Corn Dogs next time. I was hoping for more flavor at that price point, but found that the mustard sauce served with it held most of it. To be honest, it is better than most Corn Dogs, but I wanted more well seasoned Bratwurst flavor and it just kinda seemed like a better version of a Hot Dog. The Poutine, on the other hand, is well worth $8, and even $11.50 with the add-ons, in my opinion.<br><br>I got the Wild Bill Burger after getting a recommendation from the Server. I don't want to say she was wrong, but I didn't completely see the appeal. The Tomato Chutney was really acidic and kind of drowned out the other flavors, the patty itself was perhaps a little too lean (Bison) to compete with the toppings, and the Pretzel Roll was a bit dry. It was a decent and big Burger, but I didn't feel it justified paying $16, even with the tasty Fries and Chipotle Aioli. I think I should have gone with the Lacquered Duck Stacker instead.<br><br>The Milkshake ended up being the highlight of the meal. We split a Chocolate Cherry Bomb (Shake of the Month) and they were nice enough to split it up into two smaller ball jars.<br><br>Parking in the area is not ideal, but they do have a small lot with valet next door.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/w1E9bIjD2HM7a58C5yt2sQ/348s.jpg", "caption": "Poutine with Smoked Pulled Pork and Fried Egg"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qu39o8Koyw5svCixObtNwQ/168s.jpg", "caption": "Chocolate Cherry Bomb (Shake of the Month), split for 2."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HicZGV6nnG8-O9uLFnb5MQ/168s.jpg", "caption": "Bratwurst Corn Dogs"}]}}, {"review": {"des": "I've been a regular customer for the last five years - dining in the restaurant and through Grubhub. I've given them my business 11 times just since July, six of those on grub hub, four of those were missing fries.  I love their bar cheese and when I mentioned that to the manager, he told me to make a note of it in my orders and they would add it.  <br>     Today, the order was missing the fries and bar cheese so I called the restaurant. The guy that answered apologized but then hung up; I called back and the same thing happened.  I called a third time and they wouldn't answer the phone.  <br>     Grubhub called the restaurant and they apparently were annoyed that I had called (I said nothing but my fries were missing), refused a refund and said something to the effect - the chef doesn't make those kinds of mistakes.  <br>     Apparently customer loyalty means nothing.", "pics": null}}, {"review": {"des": "If you're a meat lover, you'll love the burgers here, which are all stacked with multiple varieties of meat. Included on the menu are bison, cow, and pig taking various forms. I ordered the Barbacoa Stacker and I can't argue that it was a solid burger but I just felt overwhelmed with the amount of meat on it. Like I said, if you're a fan of copious amounts of meat, Burger Bar is for you.<br><br>Great service; our waitress was super friendly and food came out at a reasonable speed. Fun atmosphere; felt like a cozy, upscale sports bar. Excellent location; it's right next to the North and Clybourn red line stop. Extra points for having parmesan truffle fries.<br><br>3/5 for the burger but everything else brings Burger Bar up to a 4 in my books.", "pics": null}}, {"review": {"des": "This was our first time here and we were underwhelmed. We got the bacon burger and it is super over priced but we figured it'd be worth it. It ended up being dry and overcooked. Maybe we would have liked it more if we built our own.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zZ3TE4auUy5xV0wzMni-QQ/168s.jpg", "caption": "Salad was fine but I didn't like the dressing so I'm glad I asked for it on the side"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Yxyn3tmnUnLZAJB7YrjMeg/168s.jpg", "caption": "Bacon burger. Over cooked and I personally like more cheese"}]}}, {"review": {"des": "Very original burgers and delicious fries. Service was prompt and friendly, and there is a great selection of beer!  We'll be back!", "pics": null}}, {"review": {"des": "We really liked the vibe of this place. The hostess was a little scattered as we asked for a table three times (of which there were plenty) but she was hellbent on giving us a booth. When offered the booth I finally said, \"we need a table with chairs\".  She had a blank stare on her face so she didn't seem to be particularly engaged in her duties.<br><br>Our server was Carmen and she was an absolute delight. She shared a great deal of information without being overbearing. She made sure we were well taken care of and she made excellent recommendations. Her demeanor was friendly. Unlike the hostess, Carmen was completely engaged with our experience and it added to the overall positive experience.<br><br>The bacon cheeseburger (with all the extra trimmings included) was good without being overwhelming. I enjoyed my meal very much. The fried pickles were OK, I must have been expecting pickle chips as these were pickle flats. The breading was slightly over the top.<br><br>Overall a great experience and again, props to Carmen for being a quality server who seemed to genuinely want us to have a good experience.", "pics": null}}, {"review": {"des": "Pros:<br>- Ample seating<br>- Conveniently located near North/Clybourn Red Line stop and the surrounding shopping district<br>- Good draft selection<br><br>Cons:<br>- Burgers that are loaded with toppings, but lack depth of flavor<br><br>I visit the shopping area near North/Clybourn frequently, and Burger Bar has always been on my list of places to try. This neighborhood is lacking overall in restaurant selection, so Burger Bar is an obvious choice for anyone looking for a meal that is a step up from the usual fast casual options in the area. <br><br>Their feature menu items are their \"Stackers\" burgers - which are burgers LOADED with all types of toppings from chorizo to house made Fritos. I tried the Barbados Stacker which features a chorizo-angus burger, Colby jack cheese, smoked pork barbacoa, roasted jalapeno aioli, avocado salsa + crispy house made fritos. Overall, the burger looks impressive and is served with your choice of fries, sweet potato fries, or a salad. They also have a variety of dipping sauces for your meal like chipotle aioli (which I tried, and it was delicious). <br><br>The burger, however, fell flat in the flavor department. For having so many different toppings, the flavor is strictly beef and salt. It desperately needed the tang of a pickle or the sweetness of a BBQ sauce to balance out all that meat, salt, and grease. Overall, this is not the kind of burger I want to spend a \"cheat meal\" on. Kudos though for including the fries in the price and having a semi dry cider on draft.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MgFTWaFU6KyClnnMc7RkYg/168s.jpg", "caption": "Barbacoa stacker and semi dry cider on draft"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UamshADCZY2nJyGHVtdIbQ/168s.jpg", "caption": "Barbacoa stacker and semi dry cider on draft"}]}}, {"review": {"des": "The staff is fantastic.  Ask Nick how he got his SAG card but don't be too attractive because he might misplace your water. I had quite the effect on him. <br><br>The wings are amazing,  burgers are killer and just ask for recommendations from the staff on beers. They know their stuff.", "pics": null}}, {"review": {"des": "Their claim to the best burger in Chicago may be an overstatement, but there is no doubt that the food here is above average. The burgers were very tasty, but the fries (Parmesan truffle) left something to be desired. We sat outside and experienced extraordinarily slow service, and it took over an hour for us to get our check after we finished eating. This seemed to have more to do with our particular server because the server on the other side of the patio did a great job of moving people through, and she even refilled our drinks a few times when our server was nowhere to be found. Overall, I'd say this is a perfectly good burger joint, but I don't think it lives up to the hype.", "pics": null}}, {"review": {"des": "I called 1st to getting ideal  Of the type of burgers and how they became a Chicago best  Because parking over here one street is terrible there is no parking on the street if you do you have to put on your  Blinkers for 15 minutes the gentleman on the phone was very distant not friendly so I then went to the location park my car  With all hopes of getting one of these burgers I stood in the middle floor for about at least 10 minutes before I was even  Greeted I  Asked the lady if I  Could get a to go order saying that I am a rideshare  driver and needed to get back on the road.I aked her  well what makes this place so good how's the burgers  help me choose im  trying to make a friendly conversation the lady looked at me through menu at me and walked away... UGH!!!  So I asked another  male waiter well Chicago best has chosen you guys as a Burger place and then asked him why you would Burger did they choose he said all of our burgers are good was his response and then walked away no help  greeting I would not go here it's off of North Avenue terrible service burgers maybe good  Terrible. service Place need etiquette<br><br> Not going back here I think epic Burger is the  My choice I'm headed there now<br>Or", "pics": null}}, {"review": {"des": "I ordered 3 burgers for take out a little past noon on a Sunday.<br><br>I was quoted about 20-30 minutes (if i recall correctly) and received my food promptly after coming in.<br><br>I went to the bar to pay for and pick up my order and was immediately met by a very social and friendly employees.  The bartender started some small talk with me and I felt so welcomed even though it was my first time ever coming to this place.  I normally do not tip for take out orders, but the service and positive experience I received made it a no-brainer than I'd include a tip.<br><br>I ordered the following:<br>Hot & smokey with fresh cut fries<br>Firehouse with sweet potato fries<br>Chicken burger with sweet potato fries<br><br>Right away, you can tell (or at least it looks like) the fries are freshly cut, even for the sweet potato fries.  The sweet potato fries were delicious and had a great mix of crunch and softness.  The fresh cut fries were so good too and reminded me of Five Guys quality fries, which I really like.<br><br>The hot and smokey includes a bbq beef burger, smoked pulled pork, grilled hot link, tillamook cheddar, habanero bbq glaze, and a cucumber and onion slaw... and lord Jesus this was QUITE the combination.  Even the grilled hot link had a nice snap from the casing!  The burger was full of flavor and remained so moist!  The buns held up against the sauce and juices and was a perfect match.  The bbq sauce might cause a small mess, but that did not detract from how darn good this was!<br><br>The firehouse had a chipotle spiced burger, charred jalapeño-scallion-chorizo relish, pepper jack, and guajillo aioli.  This resulted in a good kick, but I didn't find it to be very spicy.  People who want a really spicy burger should upgrade to the el diablo sauce for an extra dollar.  Anyways, this was another phenomenal burger!  Moist, flavorful, good kick and spices while not taking away from your ability to taste the meat and condiments!  This burger can get a tad messy, but it was well worth it!<br><br>Lastly, the chicken burger seemed to be the simplest of all I ordered since it only had arugula, chicken, and a tomato and pesto aioli, but they did not skimp on the volume of food.  There was a hearty portion of arugula and the chicken was pretty thick yet so moist!  It was a great combination of ingredients and flavors.  I enjoyed this very much and appreciated how simple it was and yet so delicious.<br><br>This place is not to be compared with Au Cheval because they make their burgers in completely different ways.  However, I really, really enjoyed the 3 burgers I tried and would definitely come back here if I'm looking for something above and beyond what Five Guys offers.<br><br>Great service and friendly employees (for pick up)... amazing burgers and fries... 5 stars!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XemrUXffkwrKHYamp_RLHw/348s.jpg", "caption": "Hot & smokey with fresh cut fries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1BpZ3InqqziZTOEQKtB4yA/168s.jpg", "caption": "Firehouse with sweet potato fries"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0qH2BLfrW7StEYlJOQcvxA/168s.jpg", "caption": "Chicken burger with sweet potato fries"}]}}, {"review": {"des": "I wanted to give this place four stars so badly, but I felt that the service just did not deserve that extra star. <br><br>The food was great. Obviously, you need to order a burger here. It is called the \"Burger\" Bar. So I ordered the \"Backyard Classic.\" It's basically a bacon cheeseburger. But I was trying to be a \"little\" healthy so I asked for no cheese and no bun. I probably should have passed on the fried sides, but I couldn't resist ordering the sweet potato fries. Oh and by the way, the fried pickles are amazing. Do not pass on them when they suggest them. <br><br>Ok so when my food came out, it was not exactly what I ordered. On my plate was a bunless burger (good) with cheese (bad). Also, my fries were not sweet potato but regular. I normally wouldn't be bothered if just one of these things was messed up, but the fact that both were messed up just really bothered me. So, yeah. This just made me feel like our server wasn't really listening to us. And she wasn't very attentive. So it was a disappointment on that part.<br><br>Other than that, the food was really good! It wasn't the most amazing burger I've ever had but I really enjoyed it. The fries were really good. Both the regular fries and the sweet potato fries I finally got. But service lacked.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IXkkJpSE9jnr-n1LU4AS6Q/168s.jpg", "caption": "blurry picture of my bunless burger and my mom stealing a fry"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vs9YR98U94WKZdD4XoTYWg/168s.jpg", "caption": "The DELICIOUS fried pickles."}]}}, {"review": {"des": "I went here the other day for lunch. I will say, I was super into the idea of this one burger they had. It was prosciutto, fresh mozzarella and a pesto mayo sauce. As someone who keeps searching around the city for the top burger, this was not my favorite. But it was still solid and I liked that they did something different than most burger joints. The bartender was super friendly and gave excellent service. Seeing as this is super close to my work, I can certainly see myself coming back for lunch sometime soon.", "pics": null}}, {"review": {"des": "My friends and I came here for dinner on a Friday night for a party of about 12 people and 1 child. Reservations were made so we were able to get a table - however it didn't seem busy at all so a reservation may not have been needed. It's surprising to see that it's not busy on a Friday evening at 730pm. Anyway our service was pretty slow - our server seem MIA most of the time. It took awhile for him to get our order, to serve our food, and to get the check. Overall we all enjoyed our foods. My friend and I ordered their wings as appetizers  and felt they were very burnt. The taste was there, but burnt. I had the firehouse burger and I enjoyed it very much. We also ordered their 3 cheese mac and cheese - can't really tell there were 3 types of cheeses, more like just one type of cheese. <br><br>They have a kid's menu too. Our friend's child had 2 mini sliders and 2 sides of fruits which was awesome.", "pics": null}}, {"review": {"des": "Came after my first burger joint choice closed apparently closed. Womp. It may have not been my first choice but Burger Bar Chi is definitely first place. My server was super helpful even though I was so indecisive. I ended up getting the Steakwedge with fries and a milkshake (milkshake of the month was the Java shot). Whew. I can't wait to try more options on the menu however, the burger and shake alone left me overly full. <br><br>I will be making a return soon !", "pics": null}}, {"review": {"des": "It's been a few years since we've been to Burger Bar, but it is exactly as we remembered. Self-explanatory, delicious menu ranging from mac & cheese to really inventive burgers. We could smell the searing meat when we opened out Uber driver's doors...and knew our burger craving would be satisfied. Nice beer list on draft. <br>We had the Burger of the month (lots of porky toppings and a side of bone marrow) and the firehouse burger. Both were prepared to medium-rare (just as we asked), and the flavors didn't dissappoint.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JUUj2wUmiADNGEpHxeWUFw/168s.jpg", "caption": "Burger of the month 'Besty Stacker' (Feb 2017). Short rib beef burger, comte, pork belly with a serious side of bone marrow."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2ea-53wr2wx3Pu_b0YI-Cg/168s.jpg", "caption": "Firehouse burger with chorizo cooked to medium rare. Delicious!"}]}}, {"review": {"des": "The burger was very good. Well cooked, and generous toppings. Plus a pretzel bun is always yum.  The sweet potato fries were amazing. Perfectly crisp on the outside and fluffy on the inside<br><br>Downside was that the music was rather loud.", "pics": null}}, {"review": {"des": "The food here was great. Tons of unique burger ideas and combinations, cooked well, and served with large sides. My family stopped in here for a very late lunch and the place was pretty empty. We were seated immediately and waited quite a while for our server to come over. She was sweet and suggested some of her favorites. My mom and I both ordered some beers to start and we ordered a basket of fried pickles as well. The restaurant has a large list of drat and bottled beers, with some local options as well. The fried pickles came out shortly after we ordered them. They were fresh, hot and served with a dipping sauce. They were amazing! Super delicious and fried perfectly. <br><br>We then ordered different burgers. I ordered the gyro burger. It wasn't exactly what I was expecting but it did taste well. Disclosure: some of the burgers ingredients are still cold. If this bothers you, switch up your choice. <br><br>Overall I will probably be back. I don't know if I would go to the city for this restaurant but if I was nearby I would definitely stop in again!<br><br>Apparently their milkshakes are really good too!", "pics": null}}, {"review": {"des": "Food was pretty good, but it was too pricy for the quality we received. Outdoor patio was good, but $42 for a simple burger and two beers is crazy! Especially since the place felt like a chain. It's one thing if there's a cool atmosphere or the food is exceptional, but everything was pretty average.", "pics": null}}, {"review": {"des": "Solid beer selection and reasonable options for your burger (grilled onions, fried egg, etc)<br>Burger is well constructed and appropriately cooked to order<br>You get sauce/aioli choices for your fries<br>Outdoor seating is nice despite being next to a parking lot<br>Service is good and prices are not outlandish<br>Easy street parking nearby (may depend on time of day) but otherwise close to garages, el stop, and other entertainment/shopping", "pics": null}}, {"review": {"des": "I had Burger Bar bookmarked FOREVER, so when my fiance asked for a recommendation on a burger place, I took a chance to finally check this off my list. <br><br>After a weekend of pretty heavy meals I decided to treat myself to a veggie burger. LOVED the veggie patty. It's not just a frozen patty. Not sure if it's vegan, but it's sure damn tasty. It paired lovely with the chipotle aioli and avocado. I asked for it without the goat cheese and didn't miss it. I got truffle fries as my side and they were okay. A bit too much oil for my taste. <br><br>So, why the three stars? Service was nearly non-existent. We saw our waitress once to get our order, then to get our food, lastly, to grab a box for me and drop the bill off. My fiance's burger was made wrong, but we never got the chance to ask for her to fix it.", "pics": null}}, {"review": {"des": "I ordered the medium grass-fed beef burger with caramelized onions and an egg. It was nothing too special overall.<br><br>The beef was a bit overcooked but they did a wonderful job cooking the egg. The yolk made the burger juicy.<br><br>I was a bit disappointed with their Oreo shake. It was mostly ice cream and didn't have much Oreo flavor.", "pics": null}}, {"review": {"des": "Drink was stiff for the price. Burger has no business being almost $20. Ordered medium and it came out charcoal. Expressed this nicely to the waiter and showed him. Justified this because \"they are cooked on open flame.\" I guess this is what you can expect every time. <br><br>You can go to grange burger hall or au cheval and pay the same price for an entirely different league of food. I have no spite against the staff or the place itself so please believe me when I say you are better off getting 1-12 burgers at McDonalds and enjoying what you are eating.", "pics": null}}, {"review": {"des": "Took us over 30 minutes to get a drink and an appetizer. We ordered from the bartender and that was a good 15 minutes wait to get her attention. I know it's a Saturday and it's busy but it shouldn't take over 45 minutes for a drink and app...", "pics": null}}, {"review": {"des": "This place has an incredible burger selection. Not to pretentious not too overwhelming but just any burger you could want. I love it. This is a place I like to take my wife when she's in the mood to go out. It's loud and rowdy in a way that's comforting.", "pics": null}}, {"review": {"des": "Damn! Where do I even start? I love this place. Food and drink menu are exceptional. If your a wing lover please try the Sassy wings; grilled wings and the sauce is good af! Lol. Getting a specialty burger is the go too move. Just be prepared for a big ass burger. I come to this place every other week and everyone I bring considers it their new favorite restaurant. Be careful with parking. Hope you enjoy. Happy Yelping!", "pics": null}}, {"review": {"des": "BEST burger I have ever had!!! YUMMMIE!!! Sweet Potato Fries were wonderful! Awesome atmosphere, excellent service! The co worker I was with had wings that were delicious!!!", "pics": null}}, {"review": {"des": "Who doesn't love a good gourmet burger?!?! Being a gourmet burger fan but also being gluten free can be a struggle sometimes.. I found this place while purposely looking for gourmet burger places with a gluten free bun option. These burgers are amazing. I like how they have different meats on the burgers as well. The staff is also very considerate of food allergies and made sure I knew which items were dairy and gluten free!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HZzgUYZLCHLeJJ1UFnQBvg/168s.jpg", "caption": "Firehouse burger"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8KMEXT9VQyeEzIh5JuVw1g/168s.jpg", "caption": "Barbacoa Stacker"}]}}, {"review": {"des": "After waking in and not being greeted and having several people walk by us we decided To take a seat.  While sitting there a number of people continued to walk by us and didn't even notice we were there. I made eye contact with the person at the bar and he continued to talk to his friend. We ended up leavening after 10 min of no interaction with anyone at the store.", "pics": null}}, {"review": {"des": "Keep your beef burgers close and your shrimp burgers closer. This joint is phenomenal. The jicama slaw (or whatever it was) on that shrimp patty was absolute perfection. I also randomly got truffle fries (okay maybe I just paired the truffle fries with a shrimp burger because I'm human and don't turn down truffle fries) as a side and they were nothing short of spectacular. It's super easy to get to Burger Bar from the red line! No excuse to pass up this yumminess! Get there!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BhAYF7vJja6SCEv82_6Opg/168s.jpg", "caption": "I spy with my little eye... truffle fries!!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9U7VshIfmH-BopTPUqf8rw/168s.jpg", "caption": "Shrimp burger"}]}}, {"review": {"des": "Nice atmosphere, great burgers, decent beer selection. Not too busy on a Saturday evening.", "pics": null}}, {"review": {"des": "I don't write a ton of reviews.  But here it goes.  Went Saturday at 10pm- nice place, good service, good beer list.      Out of the three of us they didn't get the temperature right on two of our burgers and mine was hammered to the point of being inedible.    <br><br>Maybe they were having an off night, although the place was near empty;  regardless if you're gonna charge that much for a burger and it's in the name you shouldn't be making those kind of mistakes.  <br><br>Bottom line, go to Kuma's, or Five guys or even Twisted Spoke if you're not drinking if you want a consistent product.      <br><br>Or hey, like I said, maybe they were having a bad day.   My friends had been before and never had problems.", "pics": null}}, {"review": {"des": "I ate here my first week in Chicago last year and didn't have it again until yesterday. It's a little pricey but well worth it, I got a bacon bbq burger and it was awesome. Get straw onions", "pics": null}}, {"review": {"des": "Excellent hangout to watch a game or meet with friends. Wide variety of beers on tap, including non-traditional change ups. For instance, the grapefruit Radler (which I love in can, and never tried on tap before now). <br><br>Nice range on the menu. Snackables. Burgers. Make your own, or try a non-traditional like pork belly, bison, or turkey (with a cranberry chutney I think). They've got your beers, a bar, and even shakes (regular or spiked. Look for banana Nutella, or the monthly special; I've seen tres leeches and s'mores)<br><br>I've tried the turkey before. Not bad. The cranberry made the burger, tho. Short rib quesadilla was light, fresh, and yummy... Although light on the queso (which I didn't mind). <br><br>Mac n cheese: could be a meal on its own! I had the pulled pork kind, which was more sweet and saucy with a bbq zest to it. My sister had the peppered bacon, which is like your nostalgic, kid Mac n cheese all grown up and gourmet. <br><br>Brat corn dog. I like the idea. Didn't care for the mustard. Worth a try, but not a repeat. <br><br>They've got good specials. A photo booth. Pretty big area. Bar, booth, and high tops with stools. I like the vibe and the service. Great on food, and on drinks, and desserts (shaaaakes). <br><br>But parking is the bummer. You've expensive parking lots and street parking. I wouldn't come on a weekend", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sUSP0Nyb0hsem1xMNoVZJQ/348s.jpg", "caption": "Late night specials"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ba9p45yGTTzTqh-787Ve3w/168s.jpg", "caption": "Corn dogs out of brats"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PQhG5_Ts0P-XC-o7qfNT7A/168s.jpg", "caption": "Short rib quesadilla"}]}}, {"review": {"des": "I am forced to order from this place because it's one of the few who have a veggie burger that delivers. Every single time I order from here something is wrong. The don't read the notes about my allergies and include things I can not eat. They forget menu items. Or send the wrong thing. Each time I call they never offer to remake and re send. They will only refund a partial amount of what was wrong. So now I have to wait for that to be processed back to me AND I am still out a meal for the day/evening. Thank God WHISK finally has a good veggie burger! Go there instead to get the correct order!!", "pics": null}}, {"review": {"des": "Great restaurant. Sheradin and Sarah were extremely friendly, as was the entire staff. This group has their stuff together.<br>The food was great. Burgers were cooked very well and the Sassy wings are a must. Great place to eat!", "pics": null}}, {"review": {"des": "This place has zero charm. The atmosphere is cold and uninteresting. The food was truly a waste of money and I regret wasting a meal in this place when there are so many amazing restaurants in the city. I had the bacon cheese burger and it was the most uninteresting thing - meh meat, the cheese was too cooked-on and flavorless. There was just nothing special about it at all and it's not just that it was too simple, because I love a simple delicious cheeseburger. I don't know how they managed to mess that up. The server was strange and unfriendly. She was not at all attentive or welcoming. She started clearing condiments off our table before we were finished. This place just has such a weird vibe, kind of poisonous feeling. I woke up today (we dined there last night) with a sore throat and now have a cold. I wonder if the server sneezed in my food or something. She did not seem to be happy to be working there or waiting on us (though we were perfectly friendly and still left her a 20% tip). Don't waste your time!", "pics": null}}, {"review": {"des": "I absolutely loved the burger and beer I had today. I love the environment. And can't speak enough about how good that burger and beer.... well I'll tell u I'm up at 6am wishing I had them both!!!definitely will be return and bringing others.", "pics": null}}, {"review": {"des": "Food was very good, but location, service, and price left a little more to be desired. We ordered the queso-guac-chips appetizer and everyone at the table enjoyed it. My husband had the Hot and Smokey, I had the Fa-getta-bout-it. Both were very good, as were the truffle fries. Prices weren't outrageous, but I was expecting more for what our bill ended up totaling. Also the server seemed to be very annoyed with our table taking our time to order. There were several empty tables and we informed him we were waiting until our appetizers were served to order our entrees, but he seemed very aggravated by this and gave us attitude the rest of our time there.", "pics": null}}, {"review": {"des": "Came in here randomly and are happy we stumbled across the place. At first glance it's reminiscent of a standard bar but that's where things end. The menu has a lot to offer and the burgers are phenomenal! I got the Barbacoa Stacker and my girlfriend got the Hot and Smokey both were glorious and paired with equally great sweet potato tater tot's and truffle french fries.   <br><br>We have to give a shout out to our bartender Sheridan. Besides being great with recommendations when we didn't like something he took it away and offered us whatever we wanted to replace it with. We felt he genuinely wanted us to enjoy our experience not just make a quick buck. If his manager is reading this he is deserving of a solid raise. <br><br>We will be back", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_HlnvMbBKlT_MEuPiRljZQ/168s.jpg", "caption": "Smokehouse Brisket"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5YahTMB6e8tmpZguLHbxgw/168s.jpg", "caption": "Barbocoa Stacker!"}]}}, {"review": {"des": "I've been coming here for 6 years and am just now writing a review. I have never had a bad meal at this place. Everything is always fresh and delicious. I usually get the veggie burger and it never disappoints. My husband is a hardcore burger fan and he even enjoys the veggie burger from time to time. The shakes are always creamy and thick. The fries are amazing the sweet potato fries and truffle fries are my absolute favorite.", "pics": null}}, {"review": {"des": "Really indulgent, bougie burgers. Delicious, giant salads. Plentiful chicken wings.<br><br>The milkshakes are really cute when you split them into two, but just FYI, I wasn't a huge fan of the Nutella banana shake, which barely had any Nutella flavor.<br><br>The place itself is pretty nice. It's spacious and clean, and there are TVs.", "pics": null}}, {"review": {"des": "Enjoyed a great burger the BARBACOA STACKER. It was Yummy with the beer of the month Two Brothers. Our waitress Amy made my daughter's first experience great. Very helpful with decision making on the menu and dessert. Can't forget the hostess he was very pleasant too. This is my 2nd time here and I will be back again. A note from my nephew in Florida he for sure loved his first experience and the Yummy burger he had.", "pics": null}}, {"review": {"des": "Stopped in before a show nearby and glad we had plenty of time. It took our server about twenty minutes to acknowledge we were there and another ten to bring water. There were four tables occupied inside and three on the patio where we chose to sit. When we asked her for a Diet Coke with extra lemons, she returned with the extra lemons and even she seemed puzzled as to why she had forgotten the drink. She never did get on the ball after that but eventually we got our food, a total of an hour after we arrived. It was terrific. My bison burger was grilled to perfection and the fries were stand out. Ditto for my companion. Again, however, the server ignored us afterward to the point we had to chase her down inside to pay our check. <br>Great food gets the three stars.", "pics": null}}, {"review": {"des": "Really enjoyed this burger as I was waiting for my truck at the auto dealership across the street. Perfect med rare and a great selection of beers. Just a little on the expensive side for the size of the burger but you can treat yourself every so often.", "pics": null}}, {"review": {"des": "Great burger choices and lots of beers on tap. Now that's a great combo.<br><br>Their burgers are massive. Half pound of meat plus the fixins. I opted for the Firehouse. That chorizo extra was a new sensation for me...with juices running down my fingers...it was that good. Spicy hot too, man that aioli sauce was a killer.<br><br>Super friendly staff here. They definitely entertained me since I was dining/drinking by myself.<br><br>I also like the location. It's right across the Clybourn Red station, so no need to drive here. I'll definitely be coming back.", "pics": null}}, {"review": {"des": "Just grabbed a quick burger before going to the movies around the corner. The firehouse burger was great --meat was perfectly cooked. My wife had the sweet potato fries which were awesome. I ordered the regular kitchen fries ---I expected real kitchen--fries--oh well --everything else was great. A must burger destination", "pics": null}}, {"review": {"des": "Tried this place on a day I had a craving for a really good burger. I was very excited given their menu and options for burgers and fries. <br><br>The burger ended up being just ok. I ordered a grass-fed burger, cooked to medium, with cheddar, grilled onions, and bacon. I got something closer to a medium-well or well-done burger and the kitchen forgot my onions. <br><br>Service was ok. Didn't really see our server too often but they had just opened when we got there. Would've been nice if she had stopped by though to see how are food was and top off our drinks. I may have then had an opportunity to correct my order. <br><br>Despite these small disappointments the food was ok. Not great or anything but satisfactory. Pretty good flavor in the meat and the server did remove the extra charge for the added onions I didn't end up getting. I'd eat here again though to see if a second time is the charm.", "pics": null}}, {"review": {"des": "I came here about a year ago and decided to go again yesterday on a double date. This time I tried the chicken sandwich and it was delicious. This place gives a great amount of food portion for the price. It's worth it. <br><br>Go try it out.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TyKzh47gnZak4rqGWhavGQ/348s.jpg", "caption": "Chicken sandwich. Added avocado and lettuce."}]}}, {"review": {"des": "The burger was overcooked and just tasted of char, no distinction in spices. The burger also seemed small for the cost. The fries were good, three cheese mac was big enough to share as a couple as well as tasted good, and the service was great. I would go back, but not for the burger.", "pics": null}}, {"review": {"des": "I was craving a burger and this place definitely hit the spot. We started off with the chips and queso/guacamole and they were so good! My sister got a salad and it was a nice hearty salad. Good atmosphere too.", "pics": null}}, {"review": {"des": "Burger Bar has mastered the art of burgers. From pesto aioli to sweet potato tots, one can make their own burger. Of course, I'd recommend the burger of the month. For December 2017, they featured a succulent jus oozing Surf & Turf--jumbo shrimp, crispy prosciutto, parmesan fresco and migas on pretzel bun. Try eating this sucker in one sitting. I dare you!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/q3DZQ74NvkDh5xY8WPH-Gw/168s.jpg", "caption": "DYI mushrooms and caramelized onions burger with sweet potatoes tots."}]}}, {"review": {"des": "Fantastic burger-lover, beer-lover bar! Very creative burger selection, great sauces, also can build your own burger. IMO the burgers are on par with Kuma which means they're about as good as a burger can be. Excellent home made mac and cheese selection with the option of different meats added (I had the barbacoa).Very cool, rustic décor. I can't think of a single thing to criticize except that the burgers cost a few dollars more but they are well worth it. Tip: If you want to avoid sometime long waits for a table this Lincoln Park location does not get as crazy-packed as their Michigan Avenue location.", "pics": null}}, {"review": {"des": "Dreadful. One of the most annoying experiences I've had in a real real long time. Don't come in here if you're waiting on your Apple appointment with a brief window. They don't value your time much in this place. <br><br>I stopped in here since I was running early for my appointment at the Apple Store across the street. The place was a ghost town. I immediately explained to the hostess that I had an appointment in 30 mins and she's all like \"there's no wait.\" I was seated and made a selection straight away. I placed my menu on the edge of the table in a manner that signified to even the most novice waiter that I was ready to order. Notwithstanding, I sat there and waited as waiter after waiter passed me by. Finally a waitress approaches me and I ask her how long for the wings; 15 minutes, she says (the real world translation is 18-20). Knowing I only had 30 minutes to tango, which had by then been sliced thin by the wait for a waitress, I decided to cut my losses and leave. Sat at the Apple Store across the street suffering from wicked hungry pains. I wish I would've just went somewhere else. Smh.", "pics": null}}, {"review": {"des": "The burgers here are amazing. Perfectly cooked and seasoned. Service was great. The owner or manager checked on us more than once. Probably one of the best burgers I've ever had. Tons of options as well. Enjoy!", "pics": null}}, {"review": {"des": "Went to burger bar last night. I am gluten free so was pleased that the fries were gluten free and that they had gluten free bun options. The fries were delicious, but the burger/bun left a lot to be desired. To be fair, gluten free buns are subpar compared to regular, but there are many many good brands out there now a days that don't crumble at first sight, like the one at burger bar. In addition, my burger was very dry. Finally, the service was very slow-- our waitress was great but seemed to be overworked. Burgers are pricier than they should be!", "pics": null}}, {"review": {"des": "Burger Bar is nestled between a few different businesses in Lincoln Park in Chicago. It is right next to the street so parking may be a little difficult to find. <br><br>My party of four came in around 12:30. We were seated at a table close to the door where you could feel the cold air rush in every time someone opened the door. I would ask to sit in the back or somewhere that's not near the door because it got chilly and I had to wear my coat!<br><br>We collectively ordered the poutine which we devoured immediately. The fries are the perfect combination of crisp on the outside and fluffy on the inside. Their poutine had an emphasis on shredded beef and cheese. It was simple, yet delicious. <br><br>Burger Bar offers around 12 or so burger concoctions with the option of making one of your own. I would highly recommend getting one of theirs because they have many eccentric burgers. I am a fan of lamb, so I ordered the lamb burger. It was not quite what I expected; it was a beef patty with a lamb patty on top of it. The burgers can be easily split in half to take home for leftovers. The prices are up there but I do not mind paying for quality food. <br><br>I will remember Burger Bar for their customer service. My party was in a hurry because we had to catch a play at 2. We asked our waitress to bring the bill once our food came and she was very quick about getting us taken care of.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7PZOXWf17qLFPHp55nVsjQ/348s.jpg", "caption": "Lamb burger"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kwaYux1OxEO0DZwP1PbcrQ/168s.jpg", "caption": "Poitine"}]}}, {"review": {"des": "We were very excited to try this place after seeing good reviews and seemingly yummy pictures. Service was great so nothing to complain about there but the food...it was incredibly underwhelming. We started out with barbicoa quesadillas which taste wise were great, however, I had to spit out the meat into a napkin multiple times because of how fatty and inedible it was. Next we ordered the Mac and sassy wings to share as those seemed to be the most popular and we weren't in the mood for burgers. The meat on the wings was tough not great quality and the Mac and cheese seemed like it was all cream no cheese. Just not great food at all. However I loved the new beer I tried and service was great.", "pics": null}}, {"review": {"des": "Overall the burger was great. I had the \"get in my belly\" burger. The initial bite was soft, moist, and ooh lala. The sweetness of the sauce was balanced out by the brie so that was nice. <br><br>I couldn't sustain the taste though. It became too sweet and redundant. I could only eat half before I was full for the taste. But the quality of the meats were on point. <br><br>The fries were soggy and the fried pickles were pretty much fried panko with a hint of the pickle...I liked it, but I think it was more the familiarity of of panko than the actual fried pickle itself. It was fried panko with a pickle in it.<br><br>I'd go here again. It was worth the first bite. Wish I could have given it a 4.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mc5_G-sj2pgW6BhLOQNiNA/348s.jpg", "caption": "I could only eat half."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/587i1zzTo3LQH3vWTKUbYw/168s.jpg", "caption": "Pork belly burger."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bOtcKDyjmrYYMGrSfmGxaQ/168s.jpg", "caption": "Get in My Belly burger."}]}}, {"review": {"des": "Burgers the size of my head. I got the Pork belly with Brie stacked and it was heaven. Perfectly cooked and the pork belly was super tender. Loved every bite. Good beer selection too.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SFyCtACHq28cD9lssJhh5w/348s.jpg", "caption": "Pork belly"}]}}, {"review": {"des": "Pretty solid spot for a burger.  Its pretty much all they have, so you definitely expect it to be good.  Lucky, this place doesn't disappoint.  The burgers off the menu are a little pricier than what you expect to pay for a burger in Chicago, but the quality is definitely there and they come perfectly cooked.  I like the option to build your own with lots of different toppings.  <br><br>Their beer selection is pretty on point, but unfortunately the waiter came back twice to tell me my choices were both already tapped. I settled for a wheat that was still really good,<br><br>As a bonus the sweet potato fries are super crispy and very good.<br><br>This place is for sure better than your average bar burger, but probably not the absolute best in the city.", "pics": null}}, {"review": {"des": "I'd give the bar a 3 for now. I will come back and get a burger soon. Decent happy hour specials, good appetizers. The Apple store is right across the street hence the reason we stopped by for a drink while my buddy's screen was being replaced.", "pics": null}}, {"review": {"des": "Had lunch there today while waiting for my car to get repaired at nearby Grossinger AutoPlex. I arrived right about noon and there was one other patron at the bar. Nobody was sitting at any of the tables. I was greeted promptly by the bartender, which should be expected when there is nobody else there. And the service met my expectations overall. But the unimpressive food is the reason for my two star rating. I ordered the Wild Bill ($18), which is a Grass-fed lean bison burger with arugula, goat cheese and tomato chutney on a pretzel roll. And the bartender up-sold me on a side of sweet potato tots ($2 - not a bad deal). The burger came out medium to medium well, and I had ordered medium. Bison is naturally less fatty than beef and the extra cooking takes the juiciness out of it. Plus, the burger patty itself was rather small for the price point. Overcooking also shrinks the burger a little, but I can tell it wasn't too big to start with. I've balled, pattied, grilled and served thousands of burgers in a past job so I have a good feel for portion sizing prior to cooking. Anyway, I was further disappointed upon biting into the burger. All of the ingredients squeezed out from in between the burger and pretzel bun and landed on my wax-paper lined serving dish. That sucked and I might have given this three stars if that had not happened. Maybe try softening up the pretzel bun a little bit so this doesn't happen. It's no good heaping all of those special ingredients on the burger if they're going to end up all over the plate when you bite into it. I expect to be able to eat a burger with my hands and not a fork. For what I paid versus what I got, it was two star worthy.", "pics": null}}, {"review": {"des": "Very poor service. Satdown at 3:35PM for a burger and a beer at the bar. Took 10 minutes before the bar tender acknowledged me and another 15 minutes before she asked me if I wanted food. I quickly declined. There are 12 seats at the bar, I was one of four people when I walked in and the restaurant was practically empty.", "pics": null}}, {"review": {"des": "Awesome food great beer service was great my wife is pregnant and she made me drive 45min from the suburbs because she loves this place", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KTeZ7G1a_1-hDClHdUFysQ/348s.jpg", "caption": "Awesome food"}]}}, {"review": {"des": "My wife and I were very impressed with the food here. We had a few hours to kill before a dinner reservation, so we were thinking we would grab a bite and hit a few breweries. Service was a tad slow, but the bartender was busy, and the support staff was on it.  We ordered the wedge stacker, which is essentially a burger with a wedge salad on top. One of the better burgers I've had, and I thought for the price I would be disappointed. The menu is a little on the pricey side all around, but this place was well worth checking out.  Very courteous staff! Will be back!", "pics": null}}, {"review": {"des": "Pricy, but delicious food and friendly service. I had the Barbacoa stacker and the chocolate cherry shake, and my girlfriend built her own. Portions were generous and our server was really attentive. I would definitely come back.", "pics": null}}, {"review": {"des": "Misleading or wrong business hours posted on website and yelp. Closes at 11pm on Saturday although website indicates BBC is open until midnight. Felt pressured/rushed to finish food and drink when we realized everyone was closing up shop an hour early. <br><br>Food was mediocre. Bland burgers no matter how many clumsy toppings are added. Cheapest burger is $15... <br><br>Nope.", "pics": null}}, {"review": {"des": "Amazing service and beers are great, have them surprise you with their choice of beers for your flight. Marshaum & Shawn gave us amazing service...great local joint.", "pics": null}}, {"review": {"des": "I hate to write a bad review, but this place really didn't live up to the hype. My burger was super dry and pretty flavor-less. I'm not in any rush to go back, but based on other positive reviews, I think it could be worth giving them another shot in the future.<br><br>On the positive side, there was absolutely NO wait at all! But I also have to think, when a restaurant has a big wait, they probably have a lot of good stuff worth waiting for.", "pics": null}}, {"review": {"des": "The BEST fried pickles I've ever had!  YUM<br><br>The burgers were pretty damn good as well.  Fries were decent.  Service was on par. <br><br>Indoor and outdoor seating.<br><br>Their fire sauce was seriously hot!  I loved it.<br><br>We will definitely be back for more grub and soon!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Qu5OsvqOwWquwSO337x0Ew/348s.jpg", "caption": "Firehouse"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/byuKSPtiBHs_BuyiXH_MQg/168s.jpg", "caption": "Hot & smokey"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AN89ccZthT3c-UbAQ5X2vg/168s.jpg", "caption": "Fried pickles...the best I've ever had!"}]}}, {"review": {"des": "I've been here several times as I work in the neighborhood. Overall, I've never had a bad burger/meal here. Typically, I order the turkey burger because it has bacon on it (which I love), and a lot of other good flavor from the cranberries and mayo. My coworkers have ordered many other burgers though, and I've really only heard positive things.<br><br>The staff is always super friendly, too. I'd definitely recommend if you are looking for a good burger in a casual environment. Though I don't usually get to partake during lunch, they also have a large beer selection.<br><br>Bottom Line: If you are looking for a burger joint that \"wows\", this probably isn't it, but if you are looking for a solid burger that won't disappoint, this is a great choice.", "pics": null}}, {"review": {"des": "This is my first experience at Burger Bar & probably my last honestly. My partner is a burger connoisseur so naturally for her birthday I yelped the best burgers in Chicago. Burger Bar was one of the top three listed and b/c there was a mac & cheese bar, I chose that one. I was very very excited & so was she. <br><br>When we arrived, I was immediately disappointed. Not only did the hostess sit us in the back when there were plenty of seats available up front, our server AND two others walked past us 4 times without even acknowledging that we were there. THEY LITERALLY AVOIDED EYE CONTACT WITH US! After about 15 minutes of no one even offering us water, I got up & asked one of the servers if they could please send our server over b/c we were ready to order drinks. <br><br>Our initial server was named Jess. An average looking girl with a really shitty attitude. She was rude and inattentive and even went as far as to just be overly mean when we ordered drinks. We ordered our appetizers & she refilled our empty water glasses complete with spilling water on the table while she did it. When our appetizers came they were stale & she practically shoved them at us on the table.<br><br>THANKFULLY, we were given a new server, AMY! Amy came over with a smile & great attitude and gave us fresh apps & told us Jess was leaving for the night so she'd be taking over. Now let me say this, I know how servers feel when a black family walks in.  I WORK IN FOOD SERVICE & hear allllll the time how \"Black families don't tip yada yada yada.\" You know what, we do! When we receive lackluster service, we don't tip. Just like the next man. So for Jess to just be bitchy to us, b/c she felt HOWEVER ignorant. <br><br>Amy, however, was FAN-FUCKING-TASTIC! She took such great care of us & made my partner happy. She gave great suggestions & was so nice. The food was delicious. That was the highlight and ultimately what made the experience good. <br><br>S/O to Amy for making the experience wonderful.<br>& S/O to Jess for making sure I tell ALL my friends about how racist the waitresses at Burger Bar are.<br><br>What a wasted experience.", "pics": null}}, {"review": {"des": "The burgers weren't the best but loved their service and very tasty beers. We ordered two medium burgers. When we first got our burgers, one was medium well and the other was super undercooked. I normally don't like to send things back to the kitchen but it was too undercooked to stomach. What happened next was above and beyond my expectations. They made me a brand new plate (medium burger with fries), apologized profusely, and gave a local discount on my bill.  We will def be back!", "pics": null}}, {"review": {"des": "Ya, Burger bar is the <a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a>. I have been a regular here for the past 3 years and I love everything I've eaten.<br><br>My favorite of course is the Bison Burger with sweet potato fries. So classic with the goat cheese, tomato chutney, arugula, and bits of heaven, YUM.<br><br>They always have great cocktails, awesome beer selections and it's not too overpriced. The people that work here are awesome too, everyone is so friendly and since it's a neighborhood place, everyone knows each other.<br><br>I love this place and you should too!", "pics": null}}, {"review": {"des": "Sat outside here on a warm night at the end of summer for a burger and a cider. I opted to \"make my own\" burger, and it was delicious. Service was fine, and I love outdoor seating, so we had a good time. Not somewhere I'd rush to return to, but I'd definitely go back-- I need to try the mac & cheese! I'd recommend this place for a casual eat in the Lincoln Park area.", "pics": null}}]}