{"name": "butcher-and-the-burger-chicago", "reviews": [{"review": {"des": "Everything savory here is great! <br>Their burger is juicy but not greasy.<br>The buns are soft<br>All the toppings they offer on the burger are quite delicious as well. <br><br>I would avoid the desserts there.. felt more like an after thought. Since it's a burger place I'm only rating it for their burgers. If I had to rate everything together then desserts there would have brought it down by a star.", "pics": null}}, {"review": {"des": "The service was poor, and the food was nothing special-it certainly did not make up for the less-than-adequate service. <br>I came here on a late Sunday afternoon with my boyfriend. The place wasn't too busy. We ordered our burgers and sat down to wait for our food. Both burgers were brought out within a few minutes. My burger was as I ordered it, but my boyfriend's was not. The gluten-feee burger he ordered came out on a bun. (Lettuce is this place's version of a gluten-free bun). Their solution was to take the bun off the burger and throw some lettuce on it. When my boyfriend asked for a new burger--gluten makes him sick; he's not gluten-free just just to be--the guy said, \"I'll have to throw this burger out.\" My boyfriend explained that wasn't how he ordered the burger. The guy went to start a new burger rudely saying, \"Somebody take care of this guy\" (meaning at the register). No one at the place apologized for messing up the order, but someone did make it clear he was annoyed about fixing their mistake. <br>As for the burgers themselves, they were fine--not great, not special or unique, just fine. Given that they weren't spectacular, I'd say that the over $10 we paid for each was too much. The best part of the meal was the fries. <br>In short, we won't be back here for burgers!", "pics": null}}, {"review": {"des": "Found this gem here on Yelp. My son and I had a great day in the city after an appointment and he of course wanted to go out for burgers and well, if we are in the city we are going to find a good burger joint! I was so excited when I called and found out they had gf fries and a nice lettuce wrap for their burgers. And he was happy it was close by. Great service, great burgers and a great location! We will definitely be back again soon!<br><br>Tip: this is a BYOB joint so bring your own beer or wine and enjoy it with your delicious burger! They also have different homemade seasonings you pick to customize your burger experience as well as homemade custard for desert!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ta1q2oCjvCzgP9gcvRdmBQ/348s.jpg", "caption": "Completely gluten free build your own burger with grilled onion, fried egg, avocado and pepper jack cheese on a lettuce wrap. Mmmmm SO good!"}]}}, {"review": {"des": "Enjoyed a very nice bacon cheeseburger from this spot during my last trip to Chicago. I got the house blend beef with Chicago steakhouse spice. Added a fried egg and a side of fries to go as well. Everything was fresh and delicious. The entire experience was very quick and the woman who took my order was super friendly. Definitely give this place a try!", "pics": null}}, {"review": {"des": "Honest review: how it works is that u order at the front n theyll bring u ur food. (Would recommend u look on their website n pick exactly what u want so u wont hold up the line n look like a dummy) didnt like the burgers honestly. U pick everything u want for the burger just know it gets very pricy because everything is an extra charge n they dont give u the full bill so most likely it will be more expensive. Its very small but they have patio. Wont be back wasn't good honestly there not that flavorful there tiny for the price n the quality is not there. <br><br>Bison burger with foie pork belly blue cheese pretzel bun truffle aioli $ like 40 or more to lazy to do the math n dont have receipt: the burger was flavorless dry n really tiny wasnt the best quality. Foie was overcooked n supper tiny it had no taste to it. The pork belly wasnt crispy n the bbq sauce was gross. There was 1 little piece of blue cheese. The truffle aioli wasnt that good wish it had more of a truffle flavor.<br><br>Sirloin burger with grilled onions 1 pickle slice lol 1 tomatoe like $20ish: again burger was bland dry nothing to really to say the burgers arent that good n  arent the best quality <br><br>Small fries $3:50 its a large portion so be warned like 1 small fries good for 3 people: their crispy n not greasy but lacked seasoning.<br><br>All in all for the bill being like $70 bucks wasnt impressed at all really overrated could have had 5 orders of the best burger in chicago (acadia) for like the same price here idc that it was expensive just it wasn't good like if ur gonna charge a fortune it has to be the best n wasnt even comparable to mcdonalds", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hkQ6flzBCbXytLjTL2Zuag/348s.jpg", "caption": "French Fries (Chipperbec Potato)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JYNq-yJQXJOQG5k27U4a6Q/168s.jpg", "caption": "USDA Prime Sirloin Steak Burger"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TW3KlulrSEA9tAxbZ08mMQ/168s.jpg", "caption": "American Bison Burger with foie gras"}]}}, {"review": {"des": "Word on the street is that the Butcher & the Burger (B&B) has one of the best burgers in Chicago so I had to come and try this place. I actually heard of them before as they were at the Roscoe Village Burger Fest with a massive line with about an hour wait. No thanks, I am a hungry man. <br><br>I came here after work on a Friday around Happy Hour and there was no one there. The place had an old school/vintage vibe, but was a little cramped inside and I couldn't imagine what it would be like at capacity. They do have some outdoor patio seating, which is nice for a hot summer day in Chi. B&B is a fast casual restaurant. <br><br>So I do my research and check out the menu before I even walk into the place. It saves me time, saves me money, and helps me eat healthier. I ordered a grass fed prime beef burger with salt/pepper spice (the real way to do a burger). Toppings were bacon, bleu cheese, avocado, LTO, ketchup, and mayo on a pretzel bun with a side of small fries. Bill came out at $21 so kind of pricey, but I knew that going into it with all of the premium toppings. <br><br>Let me start off by saying that the toppings were very good! They were super fresh and high quality so they were well worth the price. The pretzel bun was solid as well. Presentation was excellent until I started eating it. To be fair, I did have a lot of toppings on it, but the bacon was super tough and it tore the burger apart. There was a reason why there was a skewer in the burger. I ordered my burger medium and felt like it was very dry and not juicy. So it was well done. It tasted overcooked and reminded me of flame grilled burgers from BK. The fries were hot, crispy, and very potatoey (thick cut). And holy cow the portion size was so big that I couldn't even finish them! Definitely order a small for two people. <br><br>FWIW the employees were friendly and the place was nice. I will have to try the burger again as maybe I had a bad overcooked burger,  but I was left disappointed with all of the hype. As of now I prefer Kuma's Too (better bang for your buck) and DMK (better burger and fries), which are good burger comparables. To be fair, I have had some of the best burgers in Chicago (Au Cheval, Owen & Engine, Loyalist, my grill) so it will always be hard to live up to the hype for me.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pjS4BbaQ4eahDZqzjNyIiw/168s.jpg", "caption": "Hot, crispy, and potatoey (thick cut) fries."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tm316umSv3jZfLu_T4pYnA/168s.jpg", "caption": "Grass fed beef burger with salt/pepper spice. Toppings are bleu cheese, bacon, avocado, LTO, ketchup, and mayo on a pretzel bun."}]}}, {"review": {"des": "My first time stopping at this joint. Pluses: friendly staff, great location, nice vibe/atmosphere, and tasty fries. Minuses: the turkey burger was a bit too peppery but the other ingredients on the sandwich (got The Cobb), were top-notch. I ended up kind of eating the egg, bacon and avocado separately from the burger. Definitely a place o check out and will do a regular burger next time I go and update my review!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uA8_DtJ1a7Xl2F2wuJjhHw/348s.jpg", "caption": "The Cobb Burger"}]}}, {"review": {"des": "The burgers never disappoint. Always cooked well with a plethora of amazing toppings. Sadly we also ordered the beignets and they were very under cooked and not even worth eating. Always appreciate BYOB though", "pics": null}}, {"review": {"des": "This was my first experience at a Build-A-Burger, and the temptation to go wild and add every vegetarian item listed was strong. I decided on half of them to top my lentil and brown rice burger, and was not disappointed, even when it fell apart after the first bite. There are so many options, and I will definitely be back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dkSjikMNvGYKT6mGVIUW5Q/348s.jpg", "caption": "Bison Burger"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iPa3q4pzBnlCFv-glgDoJg/168s.jpg", "caption": "Grass Fed Prime Beef Burger"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zrDPUjUbR0qlc8aaeMa7qw/168s.jpg", "caption": "Lentil and Brown Rice Burger"}]}}, {"review": {"des": "What a great find! I have been to this place a couple of times and just figured out that I never made a Yelp review! Well, that is changing now! <br><br>Butcher & The Burger is simple enough: Pick Your meat, pick your spice mix, pick the toppings, and pick the buns. However, there are a ton of meat options, spices, and even buns! This is an casual/upscale burger \"choose your own adventure\" <br><br>Tonight, I went with the house blend with chili spices, pepper jack cheese, and avocado slices. While my burger was delicious, I was hoping for a little more of the chili spice. I was having a bit of trouble tasting it on the burger which had more of a char taste to it. Still good, but I couldn't really taste the spice. I also didn't realize that I could have the prime beef and I am wondering if the burger would have been better with that meat. Their menu is a little large so I was surprised not to see the Prime lumped together with the other beef on the menu. It was kind of just stuck in the middle by the shrimp and turkey burgers. The burgers were also a little on the smaller side. <br><br>With that being said, I still greatly enjoyed my burger and they are performing quite a culinary treat regardless of spices and size. My mother got the shrimp burger with umamni and LOVED it. I got that one in the past and probably should have stuck with that!  The other big star of the night was the fries! Nice homemade fries with just the right amount of salt! Anyway, I am going to be back and hopefully as the knight says in Indiana Jones and the Last Crusade: \"Choose Wisely\"", "pics": null}}, {"review": {"des": "Clean and elegant formed Burger. <br>This place makes it known that they put pride in their food and presentation. <br><br>The staff is helping and friendly with customers and one another. They talk to each other like real best friends and I've never seen that before in a restaurant work place.<br><br>Relaxed atmosphere to get away and enjoy your meal at your own pace, while you stare out the bar window and \"people watch\"<br><br>You are the butchers and I am the Carnivore!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ut1Q92xKhqRQoM2M46vDgw/348s.jpg", "caption": "Perfect Bun"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/q1lE6VK7Fn7OZaTdUIGoPQ/168s.jpg", "caption": "Real life Krabby Patty"}]}}, {"review": {"des": "I didn't do my research about this place before I came here and did not know it was a create your own burger joint. Although that's cool and all, I've always preferred to try food that restaurant owners have created and messed around with to give us their best product. <br><br>So I went with the flow, ordered me a medium rare burger on a regular bun, with cheddar cheese, bacon, ketchup and a fried egg. They put the ketchup on the bottom, which with the juiciness from the meat will make the button bun very soggy and will fall apart. I always flip my burgers upside down anyways, it still made it difficult to eat. I'm not complaining, I have always been a big fan of a messy burgers anyways. The bacon was thick and very delicious. It added a lot of flavor to the burger and you can never go wrong with a fried egg. <br><br>The place was very tiny inside, and was very surprised to find a seat when I did. Will I come back? Not really sure. The burger was not bad at all, but also didn't wow me.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RMORVSCnrMbBnthPh7XHjg/348s.jpg", "caption": "Create your own burger"}]}}, {"review": {"des": "Whoa:  serious serious contender for burger greatness and believe me..... I challenged this place by ordering a half pound bison burger with a lettuce bun (to stay on the path of carb righteousness don't ya know)..... all of which...... is extremely hard to pull off in a well crafted burger.  They nailed it..... in spades!<br><br>The burger came on a patented \"butcher block\" with a bamboo spear so as to hold it all together.  On the burger came one the many seasonings, tomato and cheddar cheese.  The picture provided does not do it justice as it is hidden under a hood of lettuce and I would have loved to provide a picture of this burger cut open....... but after the first bite..... let's just say.... no time for pictures.  My colleague ordered the generous portion of fries and boy did they look legit..... I abstained alas!!!!!!<br><br>Putting this review plain and simple.  Go here.  Just go.  The premium prices for these burgers are reflective of the flavor and quality which real foodies are eager to pony up for.  Great job to the folks at B&B and if you wish to expand to Denver, CO...... count me in to help in any way!<br><br>Robbo, Parker, CO", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/E9NVZGBu9pQjgAj8gIz44w/348s.jpg", "caption": "Hidden under the brush is a perfectly cooked and flavored bison explosion of flavor!!!!"}]}}, {"review": {"des": "Butcher & Burger serves a variety of beef, turkey and seafood burger blends. I usually opt for their classic beef burger. It's the perfect All-American Backyard Burger. It's char-grilled with a toasted bun and the fresh toppings of your your choice. They even give you several options to spice your burger: Sonoran Desert Chili, Chicago Style Steakhouse, Umami, Grandma's Onion Soup to name a few. .. the simple salt n' pepper is my go to and really allows the high quality beef to shine. <br><br>Bun options include Split Top, Whole Wheat, Croissant & Pretzel. They must source these from a local bakery because the buns are always soft and fresh. You will pay a premium for the exceptional ingredients, but it's a delicious burger that won't disappoint. Save yourself a few bucks & calories by ordering the kid's size burger. It's still very filling. Fries can be shared and enough for two.<br><br>I have my heart set on adding foie gras for my next splurge! It's an additional $14.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9cREo0iP1XCSPnyUuE8Gtw/348s.jpg", "caption": "USDA Prime Sirloin Burger Topped with Char-Grilled Fois Gras"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YYH-9hFIUhKZx3CPpNlx6A/168s.jpg", "caption": "An order of fries is enough for two."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/j4HRSNSE5Un7cODwLOi7LA/168s.jpg", "caption": "Natural & Local House Blend Cheeseburger (Kid Size)"}]}}, {"review": {"des": "I went here the other day with my son and his friend. His friend is kind of a finicky water so I thought we would try Butcher and the Burger. I am Vegan and the boys are not so I saw they had a burger option for me and chose to go. <br><br>When we ordered the lady at the counter greeted us. When my son ordered he asked for a cheeseburger and lemonade she asked what he wanted on it. He told her. We ordered fries and were told that a small fed 2 and a large fed 4. We got the large so we could all share. <br><br>The real knock of the service comes here. I ordered their Vegan burger and asked which buns were vegan, to which I got a shrug and \"the lettuce.\" It was honestly kind of rude. I also ordered the pickles appetizer. <br><br>I then realized I hadn't ordered my sons friend or myself a drink, so I went back up to get something. I paid and asked about my sons drink. She told me she had not included it and asked if I still wanted it. He ordered it so it would be nice. <br><br>When we got our food I was again disappointed to not receive the pickles I had ordered. Again it had not been put on the bill.<br><br>The Vegan burger wasn't great, but my son liked his burger and the fries were good. But overall it was kind of a meh experience.", "pics": null}}, {"review": {"des": "My wife and I were visiting from Dallas and happened to walk by Butcher & The Burger. We were planning on eating later, nearer to Guaranteed Rate Field, but The food smelled so good that we decided to pop in and split a burger. Glad we did. <br>The quality and flavor of the burger was quite good. Cooked perfectly medium rare. We added the famous Benton's bacon. I suggest you do the same. I've had Benton's bacon before, but only in higher end restaurants. The smokiness of the bacon is really impressive and added a great flavor component to the burger. <br>I think the fries were possibly some of the best I've eaten. They were thicker cut, very light and airy with a nice crunchy exterior. Far superior to the normal offering of soggy, limp or frozen options that I've been served at other burger shops.<br>I can't recommend this place enough. It was such a welcome surprise. If you're in the area, do yourself a favor and grab a burger and fries. You'll be glad you did.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fA7FnxfS2-y6HjyZt24PeQ/348s.jpg", "caption": "The burger was much better than the quality of this photo. Delicious. Add the Benton's Bacon!"}]}}, {"review": {"des": "We have ordered from here a handful of times through Caviar. Even though we are in the UKV it comes quick!<br>We love the endless options and combinations that you can create here. So far I have tried the turkey, shrimp and veg burgers. Every time I get the wheat bun. The burgers themselves are fresh and juicy and they are generous with their toppings. <br>We love the black truffle mayo for the fries and chips. If you get a small/reg fry it feeds at least 2. Same with the chips.<br>We ordered the cookie once and so far its the only miss on the menu.<br>Its not as trendy or fancy as some other places (Umami Burger for example) but its also not as expensive and just as delicious. I hope they never change their delivery zone!", "pics": null}}, {"review": {"des": "I had the Avocado breakfast sandwich when I went. The sandwich was okay - nothing spectacular to write home about but not awful. HOWEVER I would never recommend anyone to go because the service I had was awful and the business seems unethical. First of all, the price on the menu board said the sandwich was $7.50. However, when I looked at my receipt, it said $8.00. I recognize that 50c isn't a huge amount of money, but when I pointed out that the menu board was less than what I got charged, the employee just shrugged and said \"yeah, the menu board is wrong.\" No effort was made to fix the menu board, nor was I offered anything to make up for the discrepancy in prices. Again - i know 50c isn't much, but if they do that on every single item, it strikes me as unethical because you're misleading your customers!! I will not be going there again.", "pics": null}}, {"review": {"des": "After years of having this place bookmarked, I finally got to eat here!<br><br>My parents and I came in Saturday afternoon after going to Warby Parker (down the street). <br>Service was great. The cashier (dude with straight, shoulder-length hair) gave us a run-down of how to order the burger. He also gave us suggestions, which was great. Based on that, my parents split a house blend burger with Chicago steakhouse style spice and I got the turkey burger with umami. We also got chips (based on my brother's suggestion). <br>When seated, one of the cooks helped us put the tables together since me and my mom both wanted to sit on the booth side. <br><br>The burgers were delicious! It tasted hearty and it was filling. I loved the size because sometimes gourmet burgers can be too big (think: Kuma's corner) which is not bad at all but sometimes you just want something a bit smaller, you know? <br><br>We also loved the rustic vibe of the place. It looked like random pieces but it all came together. Will definitely come back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WKUFb2niY48j9bKg6qqtng/168s.jpg", "caption": "What a nice view!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/V8xbXPC_j5S95lzIQEEfGA/168s.jpg", "caption": "Ready to dive into this burger!"}]}}, {"review": {"des": "I really like this place, they have a lot of great options, the downside though it can get really expensive.  Don't expect to spend less than 20 per person if you're getting a meal. My girlfriend and I at there the other day, we had two burgers, two pickles and two shakes and one small bag of chips and it came to 69 dollars!!! The food is pretty high quality though, and I will still come by a couple times per year.<br><br>They have a ton of great seasoning options which can be combined in any variety you want.  My favorite is the chicago style and ghost pepper which is pretty hot, so look out!!<br><br>The \"umami\" seasoning, however was a huge dissapoinment.  It has \"amateur hour\" written all over it.  It is a drizzling of a sweet teriyaki sauce, not umami in the least.  It was basically like pouring syrup on a burger- there was no detectable umami flavor, and it's gotta get fixed, because umami has nothing to do with sweet.  It has everything to do with savory that involves salty and amino acid flavor that makes the back and sides of your mouth salivate in satiation.  I won't order it again, and i am not at all a fussy eater, i just felt really let down.", "pics": null}}, {"review": {"des": "Soooooooo sooooooooo soooooooo sooooooo sooo good grass fed burgers are out of this world spices seasonings are still in my mouth I should have ordered another to go", "pics": null}}, {"review": {"des": "I'm a burger and milkshake fan so I was thrilled when my Indian friend who does not eat beef suggested we go here. Whaaaaaaaaaaat? <br><br>Turns out Butcher & The Burger have lots of options - including a turkey burger, salmon burger, lentil rice burger and even a shrimp burger.<br><br>Of course, I opted for the prime beef burger, make your own style, adding black truffle mayo, griddled mushrooms and goat cheese on a split top bun. DELICIOUS. DIVINE. FOOD HEAVEN.<br><br>A couple complaints... This place is super pricey, even for Chicago. Two burgers, two milkshakes and an order of fries ran close to $60. I can eat at a lot of other great burger joints in Chicago for much less. Particularly one that has better air-conditioning. This place was steamy! And lastly, there was very little seating. <br><br>Will I go back? Yes. Soon? No.", "pics": null}}, {"review": {"des": "I didn't know much about this place before coming, but my expectations were seriously exceeded! It's BYOB which makes it a perfect and fun place for dinner with friends on a weekend night without breaking the bank, and the burgers were AWESOME.<br><br>It's a build-your-own burger concept, so you choose the patty, the seasonings, all the toppings, and the bun.  I got the grass fed kids size burger on a lettuce bun (love this option!), and it was really phenomenal! The burger was so flavorful and tender and the whole composition was just perfect. Fries were awesome and huge, as well as the house-made pickle which is massive and comes cut into 4 slices.<br><br>My only complaint is the tight space and lack of seating.  It was totally full when we got there and due to the BYOB nature, people like to sit on their tables for a while and camp out.  We were lucky enough to snag a spot right as our food was ready, but definitely a consideration and a reason to try and come at off-peak times if possible.<br><br>So so worth it to try this awesome burger!! Highly recommend, and will be back for sure.", "pics": null}}, {"review": {"des": "Great neighborhood place to have more upscale and delicious burgers.  Love the vibe and decor of joint.  Friendly service too.  Definitely would return.  I forgot to take pictures of my burger and potato salad because I was enjoying them and place.", "pics": null}}, {"review": {"des": "Very limited tables. You have to wait for someone to get up and throw out their food and trays before you sit down. It's literally a hunt for a seat! Unless you don't mind squeezing to sit on a long table facing the window. There isn't much of a view. You order at the counter. Know what ur getting before you hold up the line. My well done burger had hella pink. The small fries can serve 3. BYOB. Small fries and a Grass Fed patty burger $27. The couple next to us was really nice. The lady who took my order was pretty nice.....That's about it. Glad to go for the experience!!! I recommended it to a few people it's more a grab n go spot.", "pics": null}}, {"review": {"des": "Pretty much overrated. <br><br>I had really high expectations of this place.. especially with a build your own burger etc. etc. We went in the evening a little later so it wasn't really that full, which was fine with me. The burgers were kind of small, buns were average nothing super memorable. Even the meat wasn't even the most quality I've had in Chicago in terms of a good a$$ burger. Don't ever need to go back here, definitely not worth the time or money.", "pics": null}}, {"review": {"des": "So delicious!!! This was one of the best burgers I've ever had. The burger was just perfect and service was exceptional!! Will definitely be coming back again!", "pics": null}}, {"review": {"des": "We stopped by Butcher & the Burger to get a snack on the way to go see a show, and it was lovely to get out of the freezing cold and get a hot burger!<br><br>I had the grass fed prime beef burger with the Chicago style steakhouse seasoning (I'm so glad they have a kids size option!) on a pretzel roll with ketchup, mustard and pickles. Very tasty, very filling.<br><br>Their Homemade Garlic Dill Pickle was outstanding and yummy! And the real winner of the night was the Chipperbec fries-- they were terrific!<br><br>The only unfortunate thing was that while my sister and I got our burgers easily, somehow (though we'd already paid for them) the fries had been...misplaced? Forgotten? So we were done eating by the time my brother got his food. Ah, life!", "pics": null}}, {"review": {"des": "Got the house blend prime beef burger. They do not have gluten free buns but they do provide a lettuce wrap instead. There was nothing too special about the burger but the fries were very crunchy and soft!", "pics": null}}, {"review": {"des": "I decided to try this burger spot on my way home late night and boy was I not disappointed. This place has a neat concept of where you can choose your seasonings for the patty before it is prepared for you. I choose medium well and the burger came out amazing. They also have beignets and those were scrumptious as well.", "pics": null}}, {"review": {"des": "Fantastic. <br><br>My son had a basic cheeseburger and I had a burger with avocado/bacon/goat cheese. Both were excellent. Skip the fries - they're nothing special and really, you don't need them as the burgers are really stars.", "pics": null}}, {"review": {"des": "Create your own burger. Genius. So many options...I ordered the grassfed beef burger with lettuce, tomatoes, caramelized onions, and dijon mustard with a split top bun and a side of homemade potato chips. I will say it's a bit on the pricier said (paid $20ish dollars for a burger and potato chips). However, the burger was absolutely delicious. There are some sides which are complimentary and others for which you are charged (avocado, caramelized onion, egg, etc.) <br><br>This spot is small and a good place for a group of 3-4 tops. They also sell beignets and cafe du monde coffee which I did not get to try but the beignets look delicious in photos I've seen. Also, their fries are homemade and I could not stop eating them (potato chips were ok...tasted like kettle chips). I highly recommend their french fries!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0dAkJEqAmukIsfRNisn1kA/348s.jpg", "caption": "Grassfed beef burger with caramelized onion, tomato, lettuce, and dijon"}]}}, {"review": {"des": "Not sure what the hype is about. Its pretty expensive. While waiting for the food we were the only ones there. 2 other people came in looked at the menu and left. Probably got shocked by the prices.  2 burgers and a large fry came out to $30. The menu seems confusing, but they seem pretty nice, and explain how to order your burger. The burgers are customizable. The food nothing special. The burgers were ok, the seasonings that you can pick you can barely taste it. On the other hand their bacon is way over smoked. I like smoked meats but while eating the burger thats all you can taste, and it was super salty. Their fries were pretty salty too amd dry.", "pics": null}}, {"review": {"des": "This is a wonderful small artisan gourmet burger establishment. Like Au Cheval, they should have a host/hostess standing near the entrence to show people to their seats and or write names down and such and call people/groups up one by one when a table is made available considering the lack of space within the restaurant. However, with these artisan places, that's not a surprise. The Armitage train station is well within walking distance if your mode of transport is CTA public transportation. Now about the food. The options here to mix and match your gourmet burger creation are endless practically. My server was so friendly and helpful, he made great recommendations and he racks high on my personal list of best people who have ever taken my order. Now I must say the unique options do come with a learning curve if you're ordinarily used to picking something straight from the menu and ordering. es, there are chef options/combinations, but the best food is what you make of it. Also the chef options are extremely limited. You'd be wise to study the menu before stopping by to build the perfect burger that best fits your desires/cravings of the day, because they have it allI. I do have to mention some of the most notable ingredients that you don't see too often at other restaurants that I particularly enjoyed: the grass fed prime beef, the spice blend (Chicago style steakhouse) used to cook the meat, Black truffle mayo, and the Benton's bacon. As for the bacon it wasn't as thick as the Au Cheval bacon, but it did stand out when compared to other slabs of bacon. As for the black truffle mayo, what can I say black truffle is amazing. Combine that with mayo and you have the perfect pairing to create one of the best condiments on a burger. As for the bread, I'm not sure why the pretzel bun is a dollar extra given how the buns are on display and they look to be store bought, which is awful. It should be baked fresh daily since customers are paying for a full gourmet burger experience. Anyways, that was one of the best burger meats that I've ever had and or have had in a while.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/I36VsGmfKfBQV7uZwY_uLA/348s.jpg", "caption": "Pretzel bun burger combo from Chicago's best + a few added things"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/REycW9sARd_ahPqCC2qyPg/168s.jpg", "caption": "Large fresh cut fries (one is good for like 2-3 people )"}]}}, {"review": {"des": "Really cute little farm style burger joint! Super helpful staff that is knowledgeable and friendly that worked tonight. Our burgers were yummy and the atmosphere was cute. Will definitely be back here next time when we crave a burger! Interested in try all the options they have to offer!", "pics": null}}, {"review": {"des": "Finally came here after hearing a lot of buzz. I walked in and hoped to get recommendations from the cashier. She said hi and stared at me. I was kind lost. <br><br>I started off building my own burger. The meat came out salty, my buns were melted and felt like they were soaked in the water. Everything fell apart right away, like my broken heart. Probably won't come back again, since you don't know how to make a basic burger. Wish you all the best.", "pics": null}}, {"review": {"des": "OMG... the BEST in the city. I think I have tried all the seasonings and still not done with the menu. <br>It's a small place, not good for groups but great for date night or catching up with a friend or two.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UMxIojNzyukh7NXqXoDWQw/348s.jpg", "caption": "Kids size burger"}]}}, {"review": {"des": "If you can not get a medium (towards rare) burger right after day in and out flipping burgers, something is wrong...<br><br>A nice champ walking around asking people how their burger was looked at my well done burger and confirmed it was \"a bit\" overdone... \"a bit\"?<br><br>I'll give it one more chance...this was my second or third time.", "pics": null}}, {"review": {"des": "I love this place with all of my heart. The burgers are always perfectly cooked and the fries (with truffle mayo) are the reason I leave my house in the morning. The service is always on point and the workers clearly know what they're talking about. Two of the girls who work there (with dark black hair) are my favorite -- they're hilarious but also super helpful. This place ROCKS!!!!!! Seriously feels like home. Best burger in Chicago.", "pics": null}}, {"review": {"des": "Awesome little spot. The staff was very friendly & the food was fast but fresh & delicious. We got the Blazing burger with the house blend beef, ghost pepper, jalapeño mayo, lettuce, tomato, onion, pepper jack and avocado. My boyfriend got the All American with the House Prime Beef, lettuce, tomato, onion, pickle, ketchup & mustard. He suggested adding bacon possibly. We ordered a small fry, definitely way enough for two. Ended up adding the coleslaw too! So good! Really fresh. The food came out fast & just tastes delicious and fresh. We will definitely be back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_iASB_Cu30b7emT9YLWKqw/348s.jpg", "caption": "Half eaten coleslaw!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RRkXqKPBUWbWVu2QvqsaDg/168s.jpg", "caption": "\"Small\" fries"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/V2hvOfbf5tw4OXGIdTkxBA/168s.jpg", "caption": "The Blazing Burger & the All American"}]}}, {"review": {"des": "Before the show, the girls an I walked in here, made our orders an sat down. All of this required that we push through the sea of people that filled almost every available space. Nerves for the show? Maybe, but I didn't feel that hungry. The way you order is, you tell them what meat you want, cow, turkey, salmon, shrimp or vegan. they have bison as well. How you want them to season it and how you want it cooked. Fries? Yes please! The wifey, our friends an I literally pulled out a few bar stools that connected to the wall, and sat down. Even though it was packed! ( saint Patrick's day after all) the workers were nice and polite. The food came with love oozing out of it an every bite was staggeringly good. A thumbs up wouldn't do. Not even a few claps. A full encore is needed! Im just upset that we live over 1,200 miles away!<br>You won't regret coming here, thats for sure! Try it. You'll love it", "pics": null}}, {"review": {"des": "I love a place that gives diners lots of customizations, and that is where Butcher really delivers. Not only can you pick from a wealth of options, you can even pick your own seasoning. I went with the umami, a soy garlic mix that is both incredibly unique and incredibly delicious. This is honestly one of the best burger I have ever eaten, and one I say rivals or even surpasses every other burger in the city. The space is a small corner location, but we did not have any issues snagging a table. It is BYOB, love it, so we went to a liquor store nearby and brought a six pack of our choice.", "pics": null}}, {"review": {"des": "I thoroughly enjoyed this small spot. I order the vegan lentil burger, on a pretzel bun, with the coconut curry seasoning, lettuce, tomatoes, onions, mushrooms, and avocado. It did fall apart as I was eating it, but it didn't matter because the flavor and texture was great. I also got a side of fries, which were great shape and size. It is a little pricier, but the quality is worth it.", "pics": null}}, {"review": {"des": "My favorite burger in the city! It's a small location but I love the style. The man who takes your order is always friendly and quick with orders. Both the cook and him come over to check on you as you eat. The customer service is great. <br>There are so many options and it really lets you customize your burger which I love. <br>You get to pick you meat from a long list of choices, spices/seasonings, buns, toppings (there are complimentary and some premium), and a bunch of sides.<br>I am a sucker for a fried egg on top of my burgers and it doesn't disappoint from here. I usually go with a 100% grassfed beef burger, Chicago style steakhouse spice blend, pretzel bun, and all the fixings! I warn you, portions are huge and this includes the fresh cut fries.<br>I usually anticipate having to spend a little more money than usual at a burger place.The prices are a little high but for the quality and quantity, it is so worth it.", "pics": null}}, {"review": {"des": "Delicious burgers and they have 3 great options for pescatarians which is rare for a burger place (shrimp, salmon or lentil and brown rice burger). I got the lentil and brown rice burger with a small fry to share and it was really good. They have lots of spices and sauces to try so you can easily customize. 4 stars because of the price (not horribly expensive but more than I prefer to spend for lunch) but I did have some of my burger left over. But it's BYOB which is always a plus!!!", "pics": null}}, {"review": {"des": "Placed an order for a simple cheeseburger ( medium- well) and fries, but received a rare burger. It was meant for me to share with my child so I wasn't ok with eating undercooked beef. Called and was told that they would resend the order. Two and a half hours later, the order never came and grub hub and restaurant are saying it's an issue with the other service. In the end a refund was made but no food! Too frustrating an experience to be happy with the restaurant.", "pics": null}}, {"review": {"des": "Really delicious burger and fries (get the vegan if u don't eat lard). Really really friendly staff.", "pics": null}}, {"review": {"des": "Disappointing. Burgers were good not great and small, especially for the price. Not a fan of greasy fries either. It was jammed packed so maybe it was just a bad visit?  Or maybe I'm just spoiled with Kumas!", "pics": null}}, {"review": {"des": "I'm nursing a little one and she cannot have dairy or soy (anything), so I cannot.  That means no soybean oil blend, no butter, etc.  We talked to the chef and he made an amazing bison burger with a fried egg (all cooked in olive oil) on a lettuce bun.  It was SO good and so nice to be able to eat in a restaurant.   Major thanks to the chef for taking the time to talk and making a dinner out possible!", "pics": null}}, {"review": {"des": "They were fast and the food was incredibly fresh and delicious!<br> I wish they had more preset combinations or suggestions... I was too hungry to create something original but really wanted goat cheese so I threw something together that probably could have been better if I put more energy into it. <br>Regardless my food was delicious and I will definitely return!", "pics": null}}, {"review": {"des": "These burgers are epic! The menu provides for you the opportunity to go nuts with different flavors. <br><br>I would recommend getting the foie gras on the side- its sooo delicious. Also the truffle mayo for the fries....yummy. It's easy to get decedent with everything!<br><br>Chef Allen Sternweiler can out talked with us and played with my nephew so my sister and I could enjoy the food!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TBWaOXTVMFOA2XDabV-aog/168s.jpg", "caption": "Chef Allen Sternweiler holding my nephew so we could enjoy the delicious food. He's so sweet! Great chef and babysitter :)"}]}}, {"review": {"des": "I'm going to restate the obvious: the Butcher & The Burger is delicious. It ranks right up there with Kuma's Corner. I love that the menu is constructed in a way that makes it so easy to \"have it your way.\" I am looking forward to going back and trying different seasonings, toppings and bison. (Because there is a 100% chance that I will be back). <br><br>The atmosphere is casual; they're going for that trendy farmhouse look. I like that this place isn't stuffy and that you can order at the register and then have a seat wherever. Simple and delicious!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bjJCbETDRIRMP6pqcAFA0g/348s.jpg", "caption": "I can't say no to a burger that looks this good."}]}}, {"review": {"des": "My ALL TIME FAVORITE burger place. I will drive here from the suburbs with my friend just to get burgers. They have a variety of combinations or you can create your own! Oh and they have great fries! Which btw are a big order. IDK why it took me so long to give them a review. Definitely a place to try and is located in a great neighborhood.", "pics": null}}, {"review": {"des": "This burger was so good that I would put it up there with that of Au Cheval. <br>Thanks to the cashier for letting us know that the small fries were big enough for two ( and delicious)", "pics": null}}, {"review": {"des": "Excellent.  Will definitely be coming back. If it's your first time here, stick to the \"our favorites menu.\"  It's easy to forget to request something on your burger since they make you specify everything.<br><br>For my first burger, I got house blend, Chicago style, split top, American, onions, and bacon.  Excellent burger, but I wished I had requested pickle, lettuce, onion.  The menu is complex so you need to request everything exactly as you want it.<br><br>For my second burger, I got the home on the range off the favorites menu.  It was good, but I would have preferred the first burger with pickle, lettuce, tomato over this one.<br><br>The fries are good, but I'd rather get two burgers than one burger with fries.<br><br>Will definitely come back bc overall it was very tasty!!", "pics": null}}, {"review": {"des": "I used to eat burgers almost 3 times a week all over the place. <br>I'm not picky but when I eat a great burger I'll remember it forever.<br><br>I kind of wanted to take a star off now that I think about it because their desserts are bad...but their burger is SO GOOD!!!!<br>Like any extra basic foodie, I added all meat options on my burger lol foir gras, bacon, pork belly, egg, all that good stuff. The burger is SO JUICY! Flavor is amazing, plus I was asking so many questions and all were answered courteously. Hands down one of the best burger I had in Chicago. Tho I had only been there once because it's kind of out of the way.....CEO, if you see this, please open a shop at Revival Food Hall on Monroe street in the loop lol I'd go there everyday", "pics": null}}, {"review": {"des": "This place reminds me so much of Bóbós in Dublin. But that doesn't mean it was good. With so many reviews and a solid 4 star I was convinced this was a guarantee good lunch. <br><br>Let's start with this, for two people, one beef one turkey, a small fry and 1 beignet (both of us had water) it was $40. This is crazy!!!!! <br><br>The burgers weren't even that big. The buns make it look huge. The cutting boards the burgers are served on are way too small. We both had stuff all over our table. First bite into my burger the patty and cheese slide right out onto the board. From that point forward I had to fork and knife it. <br><br>The burger was supposed to be medium but it was well done. Yikes. But luckily the seasoning I chose made up for the lack of flavor in the over cooked patty. <br><br>The restaurant is crowded in areas. For me to get out of my corner high top I had to completely move the table and chair and have the lady sitting down in from move her chair as well. It was either that or crawl to safety. <br><br>To make matters worse we were sitting right below an air duck for AC. Luckily I didn't notice this until the end bc it probably would've ruined everything from the beginning but the water from the ceiling was dripping on my table and cutting board. Yuck! <br><br>If I want a burger there are easily a dozen places I'll probably venture to next. Sorry! <br><br>And that's all I have to say about that. <br>Jackée", "pics": null}}, {"review": {"des": "Overpriced! Extremely good burger! But, for a casual diner-like place, I was surprised that 2 burgers and one fries cost $45.", "pics": null}}, {"review": {"des": "Best Burger Award! You can build your own or get one of their combinations. The fries were also delicious--a large was MORE than enough for two people. <br><br>I got a grass fed burger on whole wheat with cheddar and sriracha mayo (they forgot the cole slaw, but not a big deal because it was good without). <br><br>Ambiance was industrial and very cozy but plenty of seating.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VulGdF2CbQKaIPH63d4gqw/348s.jpg", "caption": "Grass fed burger with cheddar."}]}}, {"review": {"des": "I would say this is one of the best burgers in Chicago (top 3 for sure) and a must try for anyone into burgers. <br><br>I would recommend the house blend meat, Chicago style seasoning, pretzel bun, fried egg, and whatever else you like on ur burger.", "pics": null}}, {"review": {"des": "We went here for lunch and ordered the vegan lentil burger. While it tasted fine, we felt extremely sick and nauseous directly after. The workers were very kind and took the time to help us decide what to order. Despite this, 1-Star for feeling so sick after eating there. Not sure what happened but I would like to know why we were so sick after eating a vegan burger.", "pics": null}}, {"review": {"des": "Best burgers I've had in Lincoln park. I've been in the area for nearly over 10 years now. Best burger and custard I've ever had. Affordable and delicious. Worth the stop. Amazing and friendly customer service. Loved my first time experience there. Definitely going back soon!", "pics": null}}, {"review": {"des": "One of the only places my man  will eat!  Grass fed beef, wild caught shrimp and salmon burgers.  Amazing ingredients, presentation. Will be back...", "pics": null}}, {"review": {"des": "Food was okay, i had a house blend beef burger with 1-2 additional toppings, my girlfriend had the lentil and rice patty. No complaints with the quality of food or service.<br><br>My biggest issue was the price. $33 for 2 burgers and 1 order of small fries that we split, no drinks. I probably wont return", "pics": null}}, {"review": {"des": "I have eaten here once before and it was very good. This time not even worth eating. Burger was badly burned on the bottom as in charcoal black. The fries were over done as in were they cooked an hour ago and left under a heat lamp or just left in the fryer too long? Manager or owner not present T 1:30 on a Tuesday afternoon. If the owner doesn't care enough to show up why should the help care. AVOID! I know I will.", "pics": null}}, {"review": {"des": "I typically like thin burgers (think Shake Shack, Epic Burger). I know that Butcher and the Burger serves a heftier patty but with all the hype, I had to check it out. I'm not ready to say it's my favorite burger but I'm standing in line to order a 2nd burger even though I am full. The burger blend and the char make this burger great. The potato salad is amazing as well. I kept it simple and went with The All American. They have all sorts of spices and toppings but to me, there's nothing better than a simple burger that stands on its own. Ok, it's my turn to order so I gotta go.", "pics": null}}, {"review": {"des": "Small seating area that is full of character and crowds quickly. The options here are endless and the fries with truffle mayo are AMAZING. <br><br>Ordered a sirloin burger and the special venison burger, both medium. Both tasted very smokey, and their version of medium is bleeding raw inside and charred outside. Personally I just like my burgers pink in the middle, not bloody and wet so next time i'm ordering medium-well. <br><br>The spices are genuinely good here. The ghost pepper is genuinely hot so beware. The desert chili was delicious. i'd buy a container for home next time. <br><br>Also got a mocha chocolate chip shake. It is thick and old-school with big sweet chocolate chips that didn't fit through the straw. Shake had a very light flavor. <br><br>They are BYOB. A good experience but next time just will be splitting 1 $20 burger and medium-well bu with those AMAZING fries.", "pics": null}}, {"review": {"des": "This place was a pretty big waste of time. I'm not sure what all the hype is about but I kind of wish I didn't bother eating here. <br><br>First off, I cannot fathom how a BYOB, order-at-the-counter, super casual restaurant can charge over $9 for an aggressively mediocre quarter pound burger. I asked for the house blend \"simple\" on a split top bun with lettuce, tomato, american cheese, a fried egg and bacon, cooked medium rare. I also got fries and a chocolate shake. My burger came out cooked to a solid medium, totally flavorless, and excessively messy. The fried egg was so undercooked that ALL of the yolk exploded out and poured onto my dish (and my pants). The bacon is seriously smoky, and while that's good in general, that flavor overpowered just about everything else. The house blend of meat was tough and kind of dry, and definitely not medium rare. The fries were overcooked, oversalted, and had a kind of weird, vinegar-y taste to them? Something was off. The custard was average at best, but you can get better frozen dairy from Jeni's. My fiance reports that the bison burger, despite having the \"back country\" seasoning or whatever it was, lacked flavor and was ultimately a forgettable experience. Worst of all, we spent $60 including tip at a counter-service restaurant with no waiters and plastic cups. We are moving in a few weeks and wanted to try this place before we left the neighborhood, but now I wish we hadn't. <br><br>If you want an incredible burger at a reasonable price, walk 10 minutes east on Armitage and go to Big Bob & Fritzy's; that place is the truth, this place is not.", "pics": null}}, {"review": {"des": "Outstanding Burgers -- among my top 3 in all of Chicago.  High quality meats, great buns and innovative spices and seasonings.<br><br>You won't be disappointed.", "pics": null}}, {"review": {"des": "This place is Overrated. Thin burgers & over cooked fries. Very disappointed. I went here when it first opened and I remember it being very good. I'm not sure what happened but it's not the same. Too expensive for what you get.", "pics": null}}, {"review": {"des": "Best burgers around. I love the selection on the type of protein, seasoning, bun, cheese and fixings. You have to try this place. Over and over again", "pics": null}}, {"review": {"des": "Came on a Sunday and ordered the breakfast sandwich and despite the place being pretty empty, service was slow and they got my order wrong. Also the bacon was burnt. I won't be back but my friend got the burger and said it was decent so idk", "pics": null}}, {"review": {"des": "My husband and I were craving a good burger and since this place is plastered all over \"Top Chicago Burger Spot\" lists, we decided to give it a try. I ordered a Medium-Rare All American Burger with a lettuce bun and a side of slaw (ya know \"Keto\" and all). I asked the guy working the register how it was seasoned since you can potentially pick from a bunch of different flavor profiles. He told me the All-American was just some salt & pepper which I was fine with. Flash forward 20 mins or so and we get our burgers & sides delivered to the table. Food looks great and at this point I'm starving. I bite into what I'm thinking will be a nice juicy burger only to learn that my medium-rare is super well-done and tastes kinda funky. (No salt AT ALL and just overall strange). Since we already waited 20 mins & the restaurant is busy, I decided to \"suck-it-up buttercup\" and just eat the burger despite my distaste for pretty much everything about it. Well, about 3/4 way through I can't take another bite because the taste in my mouth is so horrible. I began to deconstruct the burger and come to find out that not only was I served well-done when I asked for medium-rare; but they gave me an umami flavored burger with ginger, chives and sesame seeds....UhOh!! Houston, we have a problem! See my friends; I've learned over the years that ginger & my body are like oil & vinegar- they do not like each other,  AT ALL! We made our way home and I spent the next 2 hours physically sick to my stomach. Needless to say, we aren't likely to go back. 2-stars because the coleslaw wasn't awful.", "pics": null}}, {"review": {"des": "Decent place for $10 burger. Mine was raw and the service was slow. But, nice guys and comfortable space.", "pics": null}}, {"review": {"des": "I was in the area and met coworkers for lunch here today.  The turkey burger I ordered with onion seasoning and mushrooms and onions was delicious. We shared fries and thought the fries were amazing.  All in all, a delicious casual burger spot.  If you are in the area, and love burgers, it is worth a try. I am not a big burger lover so I cannot compare to the other kings of burgers, like Kuma's.  Service was great, the place is casual and cozy, and there is seating outside.  Parking is tight but do-able even for this suburbanite. My bill for a burger, large fries, and a diet coke (Yep, Toni Preckwinkle, I still will drink soda) was $20 and some change.  However, the large fry order fed three people plus we had leftovers so keep that in mind.  I think the burger itself was $13 because I ordered it with some premium toppings.", "pics": null}}, {"review": {"des": "Super great burger, coleslaw, fries with truffle aioli and we brought a bottle of Piesporter to go with it! We got the sirloin burger cooked perfectly, with steak house spice, cheddar, grilled onions and mushrooms avocado mayonnaise and tomato on a lettuce wrap. My daughter got the pork belly, bbq sauce and a pretzel bun. Also delicious although the pork slices were a bit thick. Beignets were delicious! Super chill vibe and helpful staff that made great recommendations. Thanks guys we'll be back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zSiu5UJxnV6xM_c1njTFYg/168s.jpg", "caption": "Super great burger place!!"}]}}, {"review": {"des": "Consistently excellent are the words I'd use to describe Butcher & The Burger in a nutshell. Due to a great deal of dietary restrictions, my husband and I have a very limited list of places where we can eat easily, and Butcher & The Burger is luckily one of them. Time after time, we experience wonderful service and delicious food. We tend to order the same meals and they're always prepared exactly the same. It's such a treat to know that each time we return we'll have freshly prepared burgers and piping hot, made-to-order fries (that happen to be my favorite in the city) that are always delicious and never disappointing. Due to the customizable nature of their menu, there is truly something for everyone here, and it's all carefully prepared and tasty. <br><br>Thank you Butcher & The Burger for your dedication to consistency and excellence!", "pics": null}}, {"review": {"des": "Great burgers, but way overpriced. It is byob, so I'm not sure if thy are factoring that into the cost or not... but the bf and I went for the first time last week and got two burgers (w. Some premium toppings), a large fry to split, and one can of pop which came to a total of $43!!! <br><br>It's a pay and sit down type of place. I would expect to pay that much if I was being served on... but I'm not. Worth the visit. But won't make the effort to come back.", "pics": null}}, {"review": {"des": "Best burger! Award winners and well deserved! Build your own burger. Not your regular, every day burger join. This place blows the rest out the water. Believe me! Service is great, the folks here a super friendly.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/T7MlgLf-e8lRL7bMg0uR-w/348s.jpg", "caption": "All the seasonings"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3KQ-OWrJfaQKL2vFXzIdSA/168s.jpg", "caption": "Do you remember Cafe Du Monde coffee & bingnets? You can get them here. ."}]}}, {"review": {"des": "Loved this place when we tried it a few months ago. That time, burgers were cooked perfectly and the best thing was the custom spices which really made the experience unique and outstanding.<br>This place is not inexpensive and thought on a Friday night it would be a perfect choice after a long week.<br>Gone was the superb and engaged service from our first visit and gone was the quality. Not sure that there was any Chicago steakhouse flavor on either of over-cooked  burgers. I like medium well slightly well...it was a hockey puck. My husband asked for medium and received nearly well done. Hard to justify $32 for two burgers, two sodas and a bag of chips. I hope to try this place again but my husband will not return.", "pics": null}}, {"review": {"des": "The burgers here are AMAZING. They run with a BYOB (Build your own burger) styled menu. The first time I went here I was definitely overwhelmed - there were so many options to choose from. The person at the register was super helpful and ran me through the menu one step at a time until my perfect burger was created and ordered! They have a selection of preset burgers as well just in case you don't want to build your own burger.<br>For dessert, I also tried the beignets and they were so delicious even if they were a bit messy!", "pics": null}}, {"review": {"des": "Fully customizable fast casual/slow casual burger restaurant. You get o pick your meat and even from 10 or so different seasoning blends (probably the toughest part). Then add your toppings and sides, and you are good to go. I went with their house blend meat and the backwoods seasoning. It was amazing, and I got great bacon on top of it. We also got potato salad which was yummy and fries which were a little salty for my taste so maybe ask for light salt. Still really good though. And the kicker.... BYOB", "pics": null}}, {"review": {"des": "Busy place for no reason. Burgers are not seasoned well and sell to the Instagram crowd who want to photograph a vertical burger.<br><br>Nothing special and no reason to come back.", "pics": null}}, {"review": {"des": "We thoroughly enjoyed our entire experience. The space has a great modern vintage feel. The staff was friendly and playful. The food was top notch. We had the lentil brown rice burger, the grass fed beef, fries with black truffle mayo and vanilla custard.  Everything was delicious and the presentation was great.", "pics": null}}, {"review": {"des": "The seasoning was good but the rare burger was not what we ordered, and I know I did not order the hair cooked in to my burger. Probably with proper cooking it and no hair it would have been 4 stars. My recommendation is not to order medium.", "pics": null}}, {"review": {"des": "Honestly one of the best burgers I have had in the city. You leave feeling so satisfied! Came here on Sunday around 5pm with 6 other family members and we were able to out together some tables and really enjoy our food and being together! Everyone got to customize their own burger to exactly what they wanted (down to the meat seasoning and toppings and bun). I had the grass fed burger with steakhouse seasoning on a pretzel bun with toppings and avocado. Honestly delicious ! Their small fries are great and serve about 2 to 3 people. Their large woukd serve the whole table if there are 4 or more people (depending how hungry you are )  on top of all of the amazing food it, it is BYOB and they play some fun music and have a friendly staff. Will definitely come back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LePZY_4kMLqoC2PMCA6T1A/348s.jpg", "caption": "Grass fed burger on pretzel bun with American cheese, lettuce, tomato, pickles, and avocado. Presentation on these cutting boards is a 5/5!"}]}}, {"review": {"des": "Was so good!! Also they have vegan options which is awesome. Very fast service. You can choose from lots of toppings.", "pics": null}}, {"review": {"des": "Such a great find for a day in Chicago. Everything was incredible, the service, the location, & the food. The staff was so helpful & the setup inside is so nice. My burger was cooked just how I wanted it & the toppings were so fresh. The flavor was amazing & their homemade lemonade is something I would go back for. Would definitely recommend visiting if you're in the area!", "pics": null}}, {"review": {"des": "my favorite burger is from small cheval.  i never thought i would ever find one that i liked as much.  or liked even better.<br><br>that all changed today.  i'm staying in the area for a few days & there are 3 burger places within walking distance.  this one was the obvious choice.  it's not a chain so i can check it off my official burger list.<br><br>i ordered pick up online, which was fast & easy.  i took my burger child with me, singing all the way home.  i could smell it's smokey goodness wafting from the bag.  i started to drool.<br><br>this place is so cool-they play good music (what a concept), they have an awesome hip atmosphere, (is lincoln park going all hip on me or what???), there are all kinds of meat/non-meat options, bun options, toppings, - pork belly anyone?  <br><br>i opted for the USDA sirloin burger topped with cartelized onions, cheddar & sriracha mayo on a sweet soft egg bun.  i couldn't eat it fast enough.<br><br>i felt like my dog eating a steak for the first time.<br><br>oh-the slaw also rocks.  <br><br>i'm glad i don't live in this hood.  i would probably work my way through the entire menu.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VOdCkr8lTaalXJv5wwWlTQ/348s.jpg", "caption": "USDA sirloin burger topped w/cheddar, carmelized onions, sriracha mayo on a buttery soft bun-goooooood!!!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qnc_NjnPSTJ-Llz4N3JP0Q/168s.jpg", "caption": "Childhood slaw"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ir5FByPZux8lo95PlRdaNQ/168s.jpg", "caption": "super awesome bar stools swing in for more room!  how smart is that?"}]}}, {"review": {"des": "I came here on a Monday around 7:30, and it was not busy at all! This is an order at the counter restaurant, with limited indoor and patio seating (patio was slanted, so we moved back inside!). <br>You make your own burger, choosing the meat, cheese, bun, seasoning and toppings. They have quite a few \"premium\" toppings, from caramelized onions to foie gras. Staff was very willing to provide suggestions. <br>I ordered the turkey burger with the steakhouse seasoning, lettuce wrap, pepperjack cheese, and tomatoes and onions. <br>My friend ordered the beef burger with steakhouse seasoning and added duck egg and foie gras to his burger in addition to the usual toppings. We ordered a small side of fries, and it was more than enough for the two of us to share. My burger was good, but nothing amazing. His was great, and he kept raving about how great the foie gras was cooked. <br>Overall it was good, and I would definitely come again!", "pics": null}}, {"review": {"des": "It's street parking but very easy to find a spot. <br><br>The service was excellent! The cashier helped us with all of our questions, brought our food to us, and took everything away. The food was kind of expensive but well worth it. I would highly recommend the Chicago steakhouse seasoning blend! I also tried the ghost pepper seasoning which was good (but not as flavorful as the other seasoning blend). Definitely get the pretzel bun too! It made the burger so much better. My friend and I got the kid sized patty which was plenty (just a heads up). <br><br>We tried the fries and beignets too. While I thought the fries were a bit salty, my friend loved  them. As for the beignets, we agreed that the powdered sugar was better than the cinnamon sugar but both were delicious.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iHBhR-ool10TdUs_UcgUfA/168s.jpg", "caption": "Get your burger on a pretzel bun!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dExDEmcJCemnV2YpWQz5QQ/168s.jpg", "caption": "Try the powdered sugar beignet!"}]}}, {"review": {"des": "So, I'm not a huge fan of American food but I LOVE an amazing burger. Of course, anybody who loves burgers who's in Chicago has probably heard of Butcher & The Burger in the last handful of years. My friend visiting from Paris/Morocco really wanted a great, authentic American burger so I took him here which is a bit risky considering I'd never actually been here.<br><br>It is of course not a fancy establishment by any means, but it seems like the workers are oozing with passion about burgers and meat. The guy who took our order was extremely helpful and was full of great suggestions. What I enjoy about Butcher & the Burger is how customizable it is from the meat to what you put on it. It's pretty great.<br><br>The guy helping us told me that it'll be the best burger I have ever had - it wasn't the best burger I've ever had, but it was really solid no doubt. Definitely above average. My friend was really happy with it and thanking me for taking him here to get an actual real good, authentic American burger. The fries were solid too.<br><br>I'd definitely recommend coming here if you are somewhat in the area and want a solid burger.", "pics": null}}, {"review": {"des": "We ordered veggie burger with lentil Patty,, one with ghost pepper and umami, split top, Swiss cheese and other with umami and Cajun seasoning with goat cheese, our favorite was the ghost pepper. Fries with Cajun seasoning was awesome. Service was great. It is a small place, all handcrafted, tell them you are vegetarian they your fries will be done without lard. Lot of customization and unique flavors.", "pics": null}}, {"review": {"des": "Decent burger. Very overpriced for what you get. They definitely offer a good variety of types of burgers, toppings and buns. The space inside is small, but has a cool vibe. BYOB would've made the experience better, but it isn't really the type of place that I would spend a ton of time in after I finished eating.", "pics": null}}, {"review": {"des": "The burger was expensive and burn, even though it was cooked to the right temperature. Over all pretty meh, definitely not worth it imo. Fries were good. Finally the place was too hot, no ac.", "pics": null}}, {"review": {"des": "I'm not even finished with my meal yet and I have to tell everyone how good this burger place is! I love burgers and Im always looking to eat at a new burger place. We ordered pickup from this place, and ordered the Sirloin steak burger and Shrimp burger. I must say these burgers are so fresh and natural tasting and full of flavor, I'm already thinking about when I'm going to come back!<br><br>You customize your burger the way you want it. So you order the main burger then get whatever spices, toppings, sauces as well as other specialized topping (ex: avacado) that cost a little extra. Overall I totally recommend this place", "pics": null}}, {"review": {"des": "Following recommendations for Chicago's best burger joints, my husband and I ended up here, one of the burger joints which was highly recommended. After ordering the turkey burger and the all American burger we sat down to relax a little. The burgers took quite a while to come out, we must have waited at least 30 min. Finally the waitress came over with one of the burgers, the turkey burger, and said that the other one would take a little longer. By this point we were starving so we had no other choice than to split the first burger in half and share. Unfortunately this burger was very dry and did not do much for me. I was disappointed, especially after previously having had the best turkey burger ever at Provo FoodBar in Toronto. If you ever are in Toronto, try it!<br>Finally the all American burger came out but it was missing the add on of a fried egg so we had to complain. They took the burger back and halfway through the first burger it was delivered to our table. This burger was ok, but nothing more. It was very plain, lacking something. Overall i rate this burger joint 2 stars. I don't understand how this could be one of the best burgers in town. For a good delicious juicy burger in Chicago, go to Gage!", "pics": null}}, {"review": {"des": "This place is amazing. It was seriously the best salmon burger I've ever had with the umami seasoning blend on this that gave it an Asian flair. The salmon was succulent and very buttery. Amazing. My friend had the house blend burger with the Chicago steak seasoning and she said it was the best burger she's ever had. We both ordered ourburgers with avocado and caramelized onions, and it made it delicious. <br>The atmosphere is like an old fashioned hamburger shop and the service was super friendly. <br>We came at 3:00 pm on a Saturday, so there wasn't a line. Cute neighborhood spot in Lincoln Park. I would definitely return.", "pics": null}}, {"review": {"des": "Went in this weekend to try a new burger joint. Place was clean and busy! Was disappointed that both my and my bf's burgers were well done and tasted like char from the grill. Fries are decent - matchstick thickness. I won't waste my money on this sub par over cooked burger. The reason for all the toppings is to cover up the bad meat/over cooked burger. Stick with Small Cheval, they are spot on every time, and will be returning there for my burger fix.", "pics": null}}, {"review": {"des": "Love this place .. very unique approach for burgers .. place is cute and very friendly staff .. burgers are very rich in flavors as well !!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HptP9Gsh19vpDvI0yHlafA/168s.jpg", "caption": "Amazing !"}]}}]}