{"name": "butterfly-sushi-bar-and-thai-cuisine-chicago-2", "reviews": [{"review": {"des": "Wow! Another Amazing Sushi Bar. <br><br>I 100% recommend this Sushi Spot for your Sushi Crave! <br>With a party of six, we tried one of every roll and it was perfection! <br>From the taste to the presentation; I will definitely be returning to Butterfly Sushi! <br><br>Thank You Staff! XOXO<br><br>Jay.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HDzG3cP-5GuoHh-lEzA6vQ/348s.jpg", "caption": "The Display along with our rolls. 10/10..!"}]}}, {"review": {"des": "Service 5/5<br>Sushi 4/5<br>Variety/selection 4/5<br><br>Went to this restaurant for my birthday and the ambiance is really nice for the occasion. We ordered a bunch of sushi but my favorite rolls were definitely the summer roll (has so much fish in it it's amazing) and the 911 roll. Overall everything was really good my only complaint was sushi selection wasn't that big and they had a lot of deep fried rolls which I'm not a personal fan of. I usually look for rolls with a lot of fish in them and other than the summer roll most only had shrimp tempura or spicy tuna in them. At the end the waitress gave us free cheesecake (she didn't know it was my bday) so that was super nice too!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5u7snrXb8Uh0gYwCFIaAHg/348s.jpg", "caption": "From left to right: summer roll, eel and avocado roll, spider roll"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZDHDy_hsFSgoby4xWD18ig/168s.jpg", "caption": "From left to right: summer roll, eel and avocado roll, spider roll"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uWVDivEZcFFsh8i_yNB9MQ/168s.jpg", "caption": "From left to right: summer roll, eel and avocado roll, spider roll"}]}}, {"review": {"des": "A great local sushi and Thai food joint! I've been coming here since it opened but it's changed a lot over the years thanks to all the popularity it has received. <br><br>I love to start with the crab ragoons- best in the city. As far as sushi goes I love the Hurricane roll!! It's amazing with avocado, shrimp tempura, cream cheese, and avocado. A lot of the rolls here are good it just depends on what you're in the mood for. I do have to say I've had an experience or two where the fish was not very fresh and almost chewy, but that was maybe two times out of the 50 I've been here so I'm sure it happens everywhere. The Thai food is also stellar if that's what you prefer, which is great for you non-sushi lovers.<br><br>Service is always fast and polite and the ambiance is very fun and trendy. <br> <br>If you love sushi and/or Thai food come check out this place, but don't expect it to be on par with Roka or Sunda.", "pics": null}}, {"review": {"des": "Terrible customer service. Sushi was good but someone in our group had salmon teriyaki and it was terrible. Even had bones in it! Ladies working here are never happy and zero customer service besides bringing out food...<br>Glasses were dirty and waitress didn't even apologize... not coming back here", "pics": null}}, {"review": {"des": "ragoons were more fried than crab which is a disappointment because the crab part was very tasty...just not as much in it as i wanted or should of got smh<br>philly roll was OK stuffed with too much overly smoked salmon i personally didnt like it too much", "pics": null}}, {"review": {"des": "They have some serious culinary skills at this place. Each dish is beautifully decorated. They cut fresh vegetables for each dish and arrange them into flowers or other shapes with an led light beneath it. It's a nice touch. And they definitely deliver on the flavor and quality of the food, as well. <br><br>We ordered 3 sushi rolls - Spicy Salmon, Volcano Maki, and Sunset; and 2 Thai dishes - Pad see ewe with shrimp and the catfish dynamite. If you like catfish, the Catfish Dynamite is a must. Its a red curry and because of the texture of the catfish, it really absorbs the curry. Absolutely delicious!! This is one of the few places that has a catfish curry, so take advantage of it.<br><br>Service was good but we had an issue with reservations. We called ahead around about 5 pm or so to make a reservation for 830 pm. They said a reservation was not necessary and that they would have open tables for us. We got there and had to wait. The lady said they had a full house and did not even give us an idea on how long the wait would be. We decided to wait it out and it was under 30 minutes. It was worth the wait for sure, I just wished they had given us a reservation instead of underestimating. <br><br>Regardless, great food. I'd definitely come back again!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rnMoCeV2-AU-bwap6mQFrQ/348s.jpg", "caption": "Front of the restaurant"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3PA0yKy98JrEqa1kcJaC9Q/168s.jpg", "caption": "Sunset sushi roll"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ltp0tKDRED1VclMoADoh8w/168s.jpg", "caption": "Pad See Ewe with Shrimp"}]}}, {"review": {"des": "Thai Food is a better option.  Hit-n-Miss Food.  Neighborhood place.  River North pricing.  Easy $30pp, no brown bag.  :-(<br><br>SKIP the chain consistent THAI ESCARGOT with an unbalanced, too sweet sauce.  10 escargots, $1 each.<br><br>SKIP the $7 SOFT SHELL CRAB with yellow coating fried onions.  Since the onions are useless, you basically pay $7 for one small crab.  Decently fried, could be better.<br><br>Decent $8 TORO for 1 piece.  Ouch.  Thawed correctly.  Nice presentation.  Looks better than others.  A ok for taste.<br><br>1-Star less:  (1) quality does not equal price; (2) ALL 3 menus have soy sauce spots or some sticky stuff on it even though laminated with plastic.  Wanna wipe them once a day?; (3) smaller than usual soy sauce dipping container.<br><br>SERVICE is friendly and decent.  Beautiful VENUE.  Tight seating even though it has square footage.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/H_5fszHtgdSE8wVQMVkjXg/348s.jpg", "caption": "Venue"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qPvMQQU-rmUp2Kfs16pImQ/168s.jpg", "caption": "$8 Toro Nigeri"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NUmbNfqnhxTRbLQtNohD8Q/168s.jpg", "caption": "$7 Soft Shell Crab"}]}}, {"review": {"des": "My fiancé and I went here a while ago and it was the best sushi I have had! I'm from Phoenix originally and I have pretty high expectations when it comes to sushi, especially when I've had sushi right next to the water in San Diego, California. But this blew that out of the water! Get their fried shiitake  mushroom to start! Pick any roll, you can't go wrong! In addition to the amazing food the dining area is so gorgeous and beautiful. One of my favorite places to eat in Chicago!!", "pics": null}}, {"review": {"des": "Came here on a Saturday night as a walk in after seeing a play 2 blocks away. The place is modern and very nice. The demographic was 20 something year olds trying to impress their dates. Why do I say impress, well there were plenty of bottles of chilling sparkling wine bottles on lots of tables. I find it hard to resist a sushi restaurant. I ordered a mai tai that was just way too sweet and lacked any freshness. When a mai tai is done right then it is absolutely delicious. I also had a mojito that was about as good as the mai tai. I started with the seared tuna sashimi carpaccio which was good and served on a plate with a light in the middle. Maybe some people are impressed with light shows on their plates with their food; but, I am not one of them. I also enjoyed the crunchy spicy tuna maki, the spicy shrimp maki, and the soft shell crab.<br>Everything I ate was good, but not great.", "pics": null}}, {"review": {"des": "I was a bit disappointed because I expected more. I had the pad kew spicy noodles and it was very sub par. Nothing special, the chicken was a bit dry. Can back and had the miso which was good but you can't really screw up miso. I had the sashimi app and the sauce that came with it was not good... I had to drench it in soy sauce. I also had the spicy salmon roll which was also okay and the crunchy shrimp.. not good, I couldn't even finish it. I give it a 3 because of the ambiance of the place and how they bring out the sushi all pretty. Other than that, I probably won't go back.", "pics": null}}, {"review": {"des": "I really like this Thai spot! Interesting interior that has a lot of character and spunk! The delivery can take a while on a weekend night, but it still arrives warm and delicious. The specialty sushi rolls are huge and come on a huge platter! We definitely over-ordered the last time I was there, so I recommend ordering one, maybe two rolls at the time at most before ordering anymore. <br><br>Overall, great spot with great food!", "pics": null}}, {"review": {"des": "truly what the stars mean when it says \"meh. i've experienced better\"<br><br>establishment is nice- but customer service is very poor-<br><br>i ordered the calamari and the beef fried rice,<br>calamari was terrible, batter was very light (good) but the actual calamari was BLAND.<br><br>the beef fried rice saved the day though. didnt really feel like i had a good experience there<br>wouldnt come back,sorry<br><br>\"good luck\"", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/poAAsbsByWgKzdhWsHm2vA/168s.jpg", "caption": "never been here before but illl let you know"}]}}, {"review": {"des": "I really like the fresh sushi ingredients in this restaurant. I can see the chef making sushi directly！", "pics": null}}, {"review": {"des": "One of our fav Thai spots in Chicago, mainly cuz they have sushi as well. They make customized sushi rolls, which is key for us as vegetarians so we can enjoy something fancy outside the usual cucumber, avocado rolls :). Their pad thai and panang curry is also spot on. <br><br>Based on the location (like this one), i'd recommend getting reservations. <br><br>Bonus: it's BYOB and there is no corkage fee!", "pics": null}}, {"review": {"des": "I've been here before and it was ok, but this time I was really disappointed with food and prices. Philly maki roll(salmon and cream cheese) came to the table with a nice presentation but taste smushy, and salty, one piece. Just enough. Every ingredient has to be equal and well-constructed with a good amount of salmon and cheese stuffed inside, but I only felt salmon which is super salty. I only liked Tom Kar soup(sour and spicy). <br>I am not coming back for sure, there is a lot of sushi places with acceptable prices and nice food. Common, it is Chicago!!!<br>BUT SERVICE WAS GOOD. VERY FRIENDLY STAFF!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CwsoiSKZ00WcagM-0718Gg/168s.jpg", "caption": "philly rolls( dry rice and lots of salmon)taste salty"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CocF5xdNVz40HWrgljYq9Q/168s.jpg", "caption": "lava cake was good"}]}}, {"review": {"des": "Above average sushi and friendly and attentive staff! This is a neighborhood favorite that is consistently good. <br><br>We most recently visited on a Saturday night. It was crowded but we had a reservation and didn't have to wait long for our table. <br><br>We started with the shrimp tempura and the spinach pot stickers. The shrimp tempura is lightly battered and crispy. It also comes with some tempura veggies, which are also very tasty. The pot stickers were okay; I'd probably go with the shrimp ones next time as the spinach ones consisted of some sort of cream in the middle that I could have done without. <br><br>We ordered a variety of sushi rolls for the table. They all come out very fancy with their own lighting for each plate. Very cool presentation and the rolls were tasty too. <br><br>Service was excellent. Our girl helped us pick out the rolls and made some recommendations. She was there when we needed her, but not overbearing. They let us hang out for a few and finish our wine, and we didn't feel rushed.<br><br>Recommend this place if you're looking for a casual BYO spot to grab sushi.", "pics": null}}, {"review": {"des": "In an attempt to take respite from the rain and kill time before my hair appointment across the street, I stopped into Butterfly for a quick bite. What a surprise. Great service. Great food. And a thank you complementary cheesecake bite for dessert. How can I not give . A delightful experience all around. Thank you, Butterfly. I can't wait to return.", "pics": null}}, {"review": {"des": "Another place i've enjoyed several times over the years but lacks a review. Butterfly is a stalwart among the Sushi spots in the West Loop/Noble Sq/Uk Village area and for good reason. They consistently put out awesome sushi with their unique Butterfly flair and have outstanding service to match. <br><br>I came recently with a friend who used to work here and knew the owner/our servers. We were treated like royalty and given comp one-off rolls after another.  But the sleeper dish of the eve was not even sushi, it was the amazing Spicy Crazy Noodle. If you love pan fried noodles done to perfection, this is your go-to. You choose from Soba or Wide noodle (go for the wide on this) stir-fried with onion, egg plant, basil leaves, string bean and hot pepper in brown sauce. So darn good.<br><br>[X] One of Chicago's best imo", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TmwkA8CohWPzftqRZJQJdg/348s.jpg", "caption": "Let them Eat (Cheese) Cake !"}]}}, {"review": {"des": "My family and I are always looking for some great thai and sushi places. How can you get both without sacrificing quality? Butterfly Thai. <br><br>Been here a couple of times now and everytime they deliver some amazing food! Given that they did raise the price a bit, I also think that they stepped up their game. Definitely no complaints.<br><br>ALL their curries are great and I definitely suggest the panang and red catfish curry. Their sushi rolls are all decorated so beautifully with their sauces making it absolutely mesmerizing. The seafood salad is plentiful and flavorful. Finally, their basil fried rice is FANTASTIC. At the end they even gave us a complimentary cheesecake dessert! <br><br>Overall definitely an all time favorite, truly never disappoints. The interior is beautiful yet casual. And the staff are AMAZING. Our server, the hostess, everyone was so kind. Definitely stop by when you get the chance.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AQjp7TFDdvVYkWTJdqA6mw/348s.jpg", "caption": "Cheesecake dessert :) Was complimentary, so nice of them!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qA427hhoFo6_z91PHJ2EMA/168s.jpg", "caption": "The spicy seafood salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DTza1348KL8QTIqYB1Xp2A/168s.jpg", "caption": "The basil fried rice"}]}}, {"review": {"des": "Came here with a friend after debating the two Butterfly Sushi locations because this one had better reviews. We ordered the yellowtail and scallion roll as well as a samurai roll. The presentation of the rolls were great as it came out surrounding a cool sculpture. However, the food itself left much to be desired. The sushi rice wasn't particularly good. It wasn't very warm nor did it not have the slight taste of vinegar or sweetness that you attribute to sushi rice. The samurai roll was the best of the two and had jam on it. It was advertised this way, but I was still taken aback at how sweet it was compared to the rest of the roll and didn't think it complimented it that well. The yellowtail roll really didn't taste very good at all. It didn't taste fresh and had an offputting texture to it.<br><br>We left pretty promptly after finishing what we could of our food and I don't see myself coming back here. There's better sushi in the city with the same price point.", "pics": null}}, {"review": {"des": "Hands down, our favorite thai/sushi place in Chicago! <br><br>I know pad thai is the most basic thing anyone can order, but I cannot go here without ordering it. It's truly the best chicken pad thai I have ever had in my life, and from any city. And they give you these mini plastic containers of red chili oil which adds the best kick to the dish. Just enough heat to make you want to finish the entire plate. Oh and the portions are HUGE. For $9, you get dinner and then leftovers for lunch the next day. (Currently salivating as I'm typing.)<br><br>Also, their gyoza is top notch. Their egg rolls are amazing. I guess it's not really fair to critique those because anything fried is going to be amazing, let's be real.<br><br>As for sushi, I personally don't eat sushi, but all of my friends and family rave about it. If you plan on dining there, it's BYOB which makes me wish I can give them 6 stars! Great for big groups or for a casual date night.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/D9pwu-XopBUUhC5EbCRrAA/168s.jpg", "caption": "Seating inside Butterfly."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZTPLXU0JULlmaE-EHyFdRA/168s.jpg", "caption": "Counter when you first walk in."}]}}, {"review": {"des": "My homie and I were netflixing & chilling (in the most literal way possible as we're platonic friends) some Terrace House and got that hankering for a little somethin' somethin'. There is never a time I'll turn down sushi, so we checked out Postmates and Butterfly fit the bill. <br><br>I have a bit of a sweet potato maki obsession so surely had to try Butterfly's and see how it measured up to other sushi joints. I'm happy to say their $6 sweet potato maki was full of goodness that pleased my tummy. The maki mono had the sweet potato pieces deep fried with a unagi sauce over the roll giving it just the right sweetness.<br><br>Now I thought that was good, but when I tasted some of my beastly million ingredient roll, I knew I had found my sushi heaven. The Fire Dragon Maki for $14 is what I lovingly refer to as a white girl roll. It has everything terrible you can possibly put in a roll for one amazingly unhealthy but delicious taste. The Fire Dragon Maki is a deep-fried battered seaweed roll filled with salmon tempura, spicy tuna, cream cheese, avocado, sweet potato, scallion, spicy honey-mayo, and topped with wasabi & golden tobiko. I'm talking piles and pilesof tobiko! It added the perfect crunch to this packing a spicy punch roll. <br><br>People. I swear. I fell in love with that Fire Dragon Roll over the weekend. <br><br>I know you think I'm already a monster...but I swear to you I did not eat this all it one sitting! I swear it! I did however end my meal with a Taro Bubble Tea for $5.50 which was the perfect nightcap to my feast of fish.<br><br>If you're doing the Netflix & Chill thang and need some soosh to satisfy your craving, Butterfly should fit your bill. They have three locations so they'll surely be able to service you in the city.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VVPTmO7HJtGNJhk-yip78g/348s.jpg", "caption": "Taro Bubble Tea"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZlzLWQN-MGZmHWk8jvlDCw/168s.jpg", "caption": "Sweet Potato Roll & Eel/Avocado Roll"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/y-k447GDTdnBmATs-iyVpA/168s.jpg", "caption": "Fire Dragon Roll"}]}}, {"review": {"des": "It was my first time here and the service was amazing. Everyone was so friendly when you walk in. Our waitress was very sweet and gave us a free little desert which was very nice of her. The sushi was great, such a cute place inside too, i recommend it!", "pics": null}}, {"review": {"des": "This is a favorite spot when we're in Chicago. The service is quick and friendly. It has a low key, comfortable atmosphere. The food is fresh and delicious, and there are a lot of options. You can bring your friends who, for some reason, don't like sushi because they have Thai style noodle and rice dishes as well. Bonus- last time we went we brought our kids (ages 10 and 12) and Butterfly treated them to a beautifully plated cheesecake. Yum!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EaHO8W5TMNqmi0b6Fj1EaA/168s.jpg", "caption": "Hurricane roll"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kLWr2jx0yuM-2gqcgA9oXg/168s.jpg", "caption": "Cheesecake with a raspberry gelee top."}]}}, {"review": {"des": "This is one of my favorite BYOB sushi and Thai joints! Reasonably priced large portions with fresh food and atmosphere.<br><br>The Panang Curry is out of this world-creamy, spicy, and with a depth of flavor you will not be expecting. It is delicious in their Thai escargot appetizer (served with tender snails and frsh basil leaves swimming in the savory sauce and served with thick cuts of buttery garlic toast) and also with your choice of meat (I usually do chicken as it absorbs the flavor so well). <br><br>The sushi here is very inventive as well as tasty-the specialty rolls are chock full of interesting combinations and one roll can be a gratifying meal. <br>MY favorite so far is the signature Butterfly Maki which has shrimp tempura, cream cheese, cucumber, unagi, masago, and tempura crumbs with eel sauce-a little bit of everything. <br><br>Don't underestimate their regular Maki though, the Salmon Skin is smoky and meaty yet crisped, and the Spicy Tuna is plump with meat that is never fishy or tough and a good ratio of spice to fish. <br><br>Rice is always on point whether for your curry or sushi!<br><br>The space itself is very pristine and great for groups or a date. It feels so classy without being intimidating for a casual dinner. <br><br>Also, it's BYOB which is the fish roe on top. Small wonder they have 3 locations, but this is my favorite space.", "pics": null}}, {"review": {"des": "It was a great sushi place! It's a very popular place I really enjoyed my dish. I ordered the edamame for appetizer loved them and then ordered the rainbow roll. It was delicious! They do carry out and delivery too. I went along with a group of 8 but I made reservations ahead of time I think like 3 days prior to our visit. The only downside of our visit was that we were pretty close to the restroom and I didn't think much of it until someone made some nasty smells. Heheheh. Anyway we can't control that but I guess next time I will strictly say to them we want a table that's not near the restroom it kinda ruined my dinner towards the end.", "pics": null}}, {"review": {"des": "Today I came to butterfly sushi to place a Togo order. When I gave the restaurant my phone # informAtion popped up. Saying customer always complains that her order is wrong. Mind you I've been here three times. Twice before this time. The first time I came I called in and the order. It wasn't Wrong I just asked that for 3 of something and they gave me 1. Wasn't a big deal but to them I guess it was. Just a tad disappointing that it angered them enough to put that under my info. I guess if you want to see what they are actually saying in another  language just go give them your info. I asked the waitress as well if I could take a pic of the monitor and she told me no. And closed out the screen and took my order by hand. I should have just left but my kids were ready to eat.", "pics": null}}, {"review": {"des": "We can back here for father's day! Again enjoyed my meal extremely! For appetizers, we got Fried tofu and they suggested for me to try the Godzilla sushi vegetarian.  Man oh man! THIS WAS BOMB! It was so delicious.  I could have probably just eaten this and finished my dinner! We also ordered the Spicy Crazy noodles and it was again delicious and the basil fried rice which was alright nothing to rave about.  Excellent service, and even better food what else can you ask for!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nXHjE58SsJpy1_22ll-nkQ/168s.jpg", "caption": "spicy crazy noodles"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TOyin_pJU2mCD5hsoCmA3w/168s.jpg", "caption": "Godzilla sushi vegetarian!"}]}}, {"review": {"des": "My favorite sushi restaurant. Every time I try a new one it disappoints me. I am sticking with Butterfly!", "pics": null}}, {"review": {"des": "If you want some fancy sushi, this is the place to go. Plates are beautiful, decorated with saucy swirls.  Because of that, I'd recommend opting out of an extra side of spicy mayo (which is a typical side order for me). I think their swirls are made of unagi sauce, spicy mayo, and regular mayo (if it's not cream cheese, or wasabi mayo...) <br><br>Average larger/fusion rolls range from $12-18, and your classics are typically $6-8. The ambience is definitely good for date night/girls night, although i wouldn't recommend a group of more than 4.  It's a little darker with hip music and a classy vibe. <br><br>You won't get your freebies here (like miso soup, veggies, or a ginger salad.) <br><br>It's BYOB. Come for some pretty rolls and drinks and robata bites. They have ramen on the menu too. <br><br>It's definitely a spot id come back to for vibe alone, and to continually try new things. Haha expect to come back, cuz this place could easily run up a dinner bill. Still, a win.  You might even luck out with free street parking", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3WtV4BB1B6ZwPONJIKpNaQ/348s.jpg", "caption": "Complimentary cheesecake dessert"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DN2SJ9dxKeP8J3XYYAqnWQ/168s.jpg", "caption": "Tekka maki and philly"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/i73o2I8N0M6hpRMHyIptJQ/168s.jpg", "caption": "Butterfly maki"}]}}, {"review": {"des": "This was my favorite place to order since I can order both Thai and Japanese so one stop would satisfy everyone's taste in the family.  Food is decent.  For Thai restaurant, it is a bit expensive but for Japanese, prices are reasonable.  I tried dine in a few times but had a couple issues whenever I went with my friends (For 2-3 people, everything was fine but number of people goes more than 4-5, there was always an issue like one of us had to have a cold food)  so delivery was much easier option.  <br><br>The other day, I ordered food for 7 people.  It was late and we were all hungry and tired.  Delivery usually takes 45 minutes.  We waited an extra 15-20 minutes, but still no food.  I called the location back using the same number which was on my phone.  The person who called herself a manager said she can't find an order for us.  She asked me the same questions like the number I called, my address and the phone number multiple times and said she doesn't have an order.  So I requested if she can quickly make my order and send, she said 45 minutes is the best time she can. After 10 minutes talking, still no apology.  <br><br>What really annoyed me was this.  Not only did she not apologize, she was basically blaming me that either I 1) didn't order and lied or 2) called the wrong location.  I asked her name and the owner's name, and she was off the phone for a while. She came back with the news that our order had magically been found and her manager would generously give us a 10% discount, with fast delivery as soon as they can.  I refused and asked owner's name and she hung up on me.<br><br>I was a long term customer and was pretty satisfied with their food even though dining experience was not very pleasant. Never. Again.", "pics": null}}, {"review": {"des": "Delicious sushi! The inside is very pretty and is great for date nights. Each plate has a lot of detail and is very filling. Pickup and delivery is very fast.", "pics": null}}, {"review": {"des": "Me and a friend wanted to have some thai food and sushi and I decided to bring her to this place. I've been to the Chicago location before and have also ordered online but to my surprise the food this time was not good. I ordered the basil fried rice with shrimp. The rice was super dry. It seemed like it was cooked last week. The shrimp was very over cooked. We also ordered a tempura shrimp roll which was ok. <br>I don't think we will be back. <br>Service was also ok.", "pics": null}}, {"review": {"des": "Awesome food, well priced, fun atmosphere and BYOB. Service was great. Can't beat that!", "pics": null}}, {"review": {"des": "Delicious sushi, noodles, and drinks! They have one of the best bubble teas that i've had in Chicago, aside from chinatown. I came with a bunch of friends and we all loved our dishes. Each dish was unique, and very flavorful. Probably my favorite sushi + asian fusion downtown. There is something on the menu for everyone. The presentation is also on point. The food looked almost too beautiful to destroy.", "pics": null}}, {"review": {"des": "I've had a better spicy tuna roll at the grocery store...IM NOT KIDDING. The rice was wet and it was almost like eating tuna wrapped in glue. YES...GLUE! Gross. The cashew chicken I ordered was fried and nowhere on the menu did it say fried. HORRIBLE. On a plus side the woman who took my order was delightful. Wish I could say that about the meal.....<br>If your looking for sushi in the area try Sushi X on Chicago Ave . I've never had a bad experience there.", "pics": null}}, {"review": {"des": "I've heard good things about Butterfly sushi and I finally had a chance to check it out. I came here for a girls night and it was a good choice!<br><br>To sum it up BYOB, sushi and good music, what's not to like?<br><br>We ordered shrimp tempura, egg rolls, and crab rangoon for appetizers ( all were good). <br><br>For our sushi we had 911, Black Dragon, Crunchy Spicy Tuna, Godzilla and Samurai. The rolls were good (not the best but it hit the spot). We definitely over ordered (eh it happens)<br><br>The service was not bad, the only thing I was not a fan of was that once we finished our food we were still sipping on our wine and chit chatting,  the waitress came over and basically told us to  wrap it up. I get the restaurant was busy but sheesh we still had some ways to go with our wine.", "pics": null}}, {"review": {"des": "We used to go to Butterfly sushi all the time! You couldn't keep us away. But their prices have increased way beyond what they should have in a short amount of time. A summer roll went from $7 to $10 in less than a year. I think that's a bit excessive on the price increases. Same with other items. The price increase doesn't even make it worth driving the extra that we did when we can get something good at a lower price without traveling so much. I guess they don't care about their customer base that made them what they are. Food is good, but the prices have now made it like any other sushi restaurant.<br><br>Bye bye Butterfly", "pics": null}}, {"review": {"des": "Delicious! The location is in a nice part of town. Parking was a little rough. But, after a good 20 minutes of driving in circles we finally found a spot. The staff was very friendly and attentive. The restaurant is BYOB, so we brought our own beers. Visually the restaurant looks amazing the seating is comfortable and spacious. I order the red curry with tofu. This dish was so good. It was citrusy and savory with coconut tones and whole baby tomatoes and pineapple chunks. It was so good I honestly didn't want to finish it all so I could have some for later. As an appetizer I ordered edamame it came with a light sprinkle of salt I added a little bit of lemon and it was delicious. My friend ordered the chicken cashew. He thought it was very good. All in all I will definitely be coming back and inviting friends. Very satisfied customer.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6eLSA3iWUWqp5t3-mmY5wA/168s.jpg", "caption": "I ordered the red curry it came with a side of white rice. And as an appetizer I ordered the edamame. We brought our own drinks."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EdQd3qrBF2SlCliEx1x96g/168s.jpg", "caption": "My friend ordered the Chicken cashew it came with a side of white rice. As an appetizer the cucumber salad."}]}}, {"review": {"des": "This place has a really good vibe. We were in the city and I was craving some Thai so we decided to try this place. I didn't read the reviews before, but it's BYOB so be sure to grab some wine or beer to enjoy with dinner. <br><br>We got the chicken skewers which were good. It's only $2 so be sure to try a couple of different ones. We ended up getting the Panang curry and fried rice. The portions are huge! We barely made a dent but were able to take it back and if tasted just as good the next day. The curry has lots of delicious veggies, the tofu was cooked perfectly, and it had a nice spice to it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8_vbMvQdqS67tqsfslq14g/168s.jpg", "caption": "Chicken skewers"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8l61AnpK3oY8B23XP2iuug/168s.jpg", "caption": "Panang curry with tofu"}]}}, {"review": {"des": "Food is decent but the staff at this establishment is very rude and angry it isn't my fault you guys screw up the order", "pics": null}}, {"review": {"des": "We specifically travelled to the Grand location because it had better reviews. However, the sushi was disappointing and left us hungry. Ordered the yellowtail and scallion roll and my friend ordered the samurai special roll. The yellowtail roll was chopped to the texture of canned tuna and had a fishy flavor, hinting at not being of the freshest grade. The rice was dense, dry, and not well flavored. The samurai roll was better, but bizarre with a jam aftertaste finish. The theatrics to display the sushi were beautiful; carved ice and colorful lights shining through, but would have traded it all for better quality fish. About 15 min after eating, felt a bit queasy in the stomach. Not interested in coming back.", "pics": null}}, {"review": {"des": "This is probably my last resort before coming here again! The food was such low quality tonight, I ordered Thai food to go, not any sushi items. However, it was just so bad! The pad Thai had 4 pieces of shrimp, noodles were so dry that all of the sauce was absorbed. No peanuts on top like I had asked. The fried rice with shrimp had all frozen veggies that had become smashed and tasteless when you ate it.then I ordered the broccoli with shrimp and what did you know 2 lbs of broccoli go with 4 pc of shrimp, at least that had fresh broccoli in it. But nothing else such a boring entree! If I wanted vegetarian I get it, but when I paid $45 almost for all rice and broccoli but where was the shrimp or wow factor in any dish that I ordered. Nowhere to be found! I swear Panda Express gives you more and oddly that tastes better than this \"upscale\" Thai joint in the west loop! The local Thai places, to me have issues with cleanliness and this one just doesn't get the food right in my opinion. All I can say is sushi would be great here 5 months ago but tonight, I really hated what they gave me. I was still left with the feeling that I should have gone somewhere else...", "pics": null}}, {"review": {"des": "We did a walk-in here recently and really enjoyed lunch. I loved my tofu satay and mushroom satay to begin with. The curry I ordered was amazing! Will be back for sure.", "pics": null}}, {"review": {"des": "Vietnamese spring rolls were beautiful but could have had a little more protein in the filling. Tom Yum soup was delicious but I would have preferred it to be presented better with a little more kick. Tom Yum in my experience is usually spicier. AND sushi was for the most part very good.<br><br>I refuse however, to rate this place lower than 5 stars because of the absolutely stellar Fresh Salmon Nigiri or 'Nama Sake'. It's $2.50 a piece and each piece is huge with a unusually generous, thick piece of fish sat on top of the rice.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/A3u_hw2y3MRAzxysuOhMTg/348s.jpg", "caption": "Nama Sake (Fresh Salmon Nigiri) - Bottom of screen"}]}}, {"review": {"des": "Food: I was pretty hungry so I got after it a bit. Started with the shishito pepper stick which was served grilled and was a little spicier than most. Then had the shrimp pot stickers which were served with some type of sweet soy sauce. Didn't surprise to the upside or downside. Then I had three rolls, a Philadelphia, a shrimp tempura and a crunchy spicy tuna. The tuna was definitely my favorite. No shortage of crunch here which was great for me. Also, they provided plenty of wasabi and ginger which was a nice plus.<br><br>Service: a bit of a mixed bag. The first waiter that helped me was polite, but didn't seem to know the menu that well. The other  folks that helped me were on top of their game. <br><br>Atmosphere: casual, comfortable, traditional", "pics": null}}, {"review": {"des": "For my roommates and I, this is our go-to takeout spot. The massaman curry and the cashew tofu dishes are highlights. The sushi is also quality. Though we primarily takeout, the service when we dine in is always friendly.", "pics": null}}, {"review": {"des": "This is sushi on Overdrive. Fun dining room. Interesting plating. Giant rolls. Maybe a little too big. Good music.", "pics": null}}, {"review": {"des": "First off I'm going to start off by saying that I absolutely LOVE the decor and the food presentation. We walked in and we were greeted right away. It was fairly busy but the service was great!<br><br>We had 2 orders of crab rangoon which came out fresh and was delicious. We all enjoyed it. <br><br>We ordered Pad Thai which was alright. Not the best I've had, but it was good. We opted for the spice on the side since we all pretty much shared everything. <br><br>The Spicy Salmon, Philly and California Rolls were all fresh. They served the sushi around this really cool dome of ice. We ordered a speciality roll that was served separately with an extra special presentation that I couldn't really describe if I wanted to. Sorry guys, I'm slow! Check out the pics for the presentation on that one. I didn't really care for that roll but everyone else did, so it was just my personal taste buds. <br><br>The Thai Iced tea was on point!<br><br>For dessert we were a little disappointed because we all wanted to order different Mochi's and they only had one flavor. Really wanted strawberry. Boooooo. The mango one was alright, but not exactly what I wanted. <br><br>We ate all of this for less than $60. Beautiful restaurant, yummy food and great service. I'd definitely go back.", "pics": null}}, {"review": {"des": "Yoooo this place sucks at accommodating large parties, even with reservations booked in advance. We had a party of 10 with reservations for 7:30. My friend even got a call from one of the managers beforehand assuring her that we would all be taken care of. <br><br>That was just completely untrue. 10 people stood around waiting in the entryway for one hour to be seated. 10 people! With reservations! That is unacceptable. Once we were seated the staff were just disorganized and everything felt chaotic from start to finish. They got one of the orders wrong and instead of apologizing and getting the order right they just asked us to take what they gave us. Being gracious, we did. The food was good so there are no complaints there, it was everything else that was far less than stellar - and on our friend's birthday! <br><br>Service was slow, and she offered a free dessert for the table but it took forever for her to bring it. We seriously thought she changed her mind or just completely forgot. It was definitely a packed house, but that is no excuse for paying customers. Not a good experience at all. The decor was nice, and the food I ordered was good. So, two stars. The service was bad enough, however, that I don't see myself ever returning.", "pics": null}}, {"review": {"des": "This place is advertised asks vegetarians go nuts for this spot... I did not go nuts for this spot. <br><br>The restaurant itself is nice enough and on the surface it appears to have vegetarian options like red curry tofu or panang curry. Except the options aren't really vegetarian. The curry base is made with shrimp paste, oyster/fish sauce, etc. <br><br>The waitress directed me to curry fried rice without egg and edamame and non-fish sushi offerings, but overall I was underwhelmed by the offerings. <br><br>The waitstaff and ambiance is nice, the price point is fair, but if you don't eat meat/fish just skip this place.", "pics": null}}, {"review": {"des": "My friend and I came for lunch on a Sunday afternoon. The place had cool, funky decor and a rocking soundtrack. I definitely felt the bass! We were seated fairly quickly and had great service throughout our visit.<br><br>We ended up sharing the Khao Soi and Penang noodles. Both were super flavorful and had a good kick. The Penang noodles were super big and squishy. They really got coated well by the sauce. The Khao Soi had a good flavor as well, but I didn't like the crispy noodles as much. The only thing I really didn't like was the sweet miso eggplant appetizer we shared. I was expecting something more like dengaku, so the miso glaze was disappointing. The eggplant was also quite undercooked.<br><br>It was a good experience overall. I would consider going back if I were in the area. Just keep in mind that the tables can be a bit tight quarters.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uRgn36S0TVKTnepo_GpDgQ/348s.jpg", "caption": "Miso eggplant close-up"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Od3i6RlV_k4NSMhs0dWJ7g/168s.jpg", "caption": "Miso eggplant"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/I7wXLbp2CkgzyQoNAEdgzg/168s.jpg", "caption": "Penang noodle magic"}]}}, {"review": {"des": "Butterfly has some of the best Thai I've had. I would highly recommend trying this place out.", "pics": null}}, {"review": {"des": "Great customer service and great food! I can't wait to come back! Really chill place to meet up with friends!", "pics": null}}, {"review": {"des": "I've been here twice in the last 6 months - both with large groups with is great they can accommodate. I would definitely recommend getting some apps and settling in with some BYOB wine (you can grab a half price bottle across at Two if you forgot your wine!). Large groups are difficult for sure, so be ready for one or two people to get their food first and have them start eating. The first time I was there I was the last one to receive my food and many people were finished. This last time I shared with my friend so we received things more staggered. I guess just go with people who are more adventurous sushi eaters so you can share everything and no one is waiting. Highly recommend the Ninja Maki - but everything I tried there was delish.", "pics": null}}, {"review": {"des": "Usually not much of an Asian food guy but went here with my friends and was pleasantly surprised. Beef fried rice was the best fried rice I've ever had. Friends also enjoyed their meal.", "pics": null}}, {"review": {"des": "5 stars because the quality is beyond the price.  <br><br>Great Curry fried rice. <br><br>Perfect amount of rice used for the sushi.", "pics": null}}, {"review": {"des": "Terrible experience ordering food for pick up. They said 30 minutes and it took over an hour. They didn't care about the mistake. Extremely rude, not helpful and no apologies from the staff.", "pics": null}}, {"review": {"des": "I have been to this location a while back and it hasn't changed. The service was ok not amazing. I asked the waitress whether they can do rolls without rice and add cucumber and she looked at me like I was speaking another language. I said forget it and ordered the large sashimi plate, seaweed salad, and miso soup.<br><br>The soup and salad were pretty good, but you can't mess up those items. The sashimi plate looked amazing, super colorful. The quality of fish was horrible. The white fish which was supposed to be buttery and delicious was soggy and tasted like it was previously frozen. It was so disappointing. Also the fish were cut super thick, which isn't like traditional sashimi. <br><br>As a result, this morning I was so sick from the food. Maybe the rolls would have been a better choice. Skip this place and pay more for better sushi!!", "pics": null}}, {"review": {"des": "Been going here for close to three years. Service is always prompt friendly and clean, and food quality is consistent. Amazing value for the ambience and menu", "pics": null}}, {"review": {"des": "I love this place!  The service is so friendly, and the restaurant is so pretty inside.  I've had take out, gone in for lunch and also gone in for dinner.  Every single time I have loved it!  The food is so delicious, fresh and beautifully presented.  The dinner experience was probably the most unique.  The plates have super cool ice and colors, they put so much effort in to the presentation it is awesome.  The prices are reasonable and the menu offers a ton of variety.  I highly recommend going and trying this place if you have not.", "pics": null}}, {"review": {"des": "Terrible service. When we arrived, there was no hostess. There were several open tables and at least 25 people waiting at the door.  Once the hostess returned she wouldn't give us an answer as to how long the wait would be. She would just look at us and walk away. This happened for at least 35 min before we decided to go somewhere else. If you're going to hire a hostess, perhaps she should have the decency to answer questions instead of telling you to hold on for  35 min and ignoring your existence. I will most defintely never come back here again.", "pics": null}}, {"review": {"des": "Finally! I've lived in Chicago for a year and a half and have struggled to find a go-to Thai place. Butterfly is it. I actually live pretty close so I'm bummed I didn't try it earlier. My husband and I stopped in to place a to go order, and it was ready quickly in 10-15 minutes. We got the chicken pad see ew, chicken pad thai, and mini egg rolls. The mini egg rolls are definitely mini, they're pretty cute. They have a good shrimp and chicken flavor and aren't too greasy. The pad see ew had perfectly cooked and huge noodles, and a lot of chicken. It had a good amount of sauce so it wasn't dry. The pad thai was also delicious, and wasn't overly peanuty, which I appreciate. The chicken in both dishes seemed like good quality, which I can't always say about take out places. Also, the portions are much much bigger than other places I've tried in the city. They're easily enough to be 2 meals per dish. The inside is also really nice and I plan to come back soon to dine in!", "pics": null}}, {"review": {"des": "We've had takeout from Butterfly sushi multiple times now, and it's always been consistently good! From various different rolls; caterpillar, dragon, spicy tuna, tempura to the curry, pad thai, pad see ewe, and fried rice, always have had a positive experience. Even when we dined in with BYOB, the experience was great. Great wait staff, the sushi chefs were really nice and friendly, and wasn't too loud so we could comfortably make conversation during our meal. Conveniently located in the River West / Noble Square location, so takeout and dining in are both nice and wasy for the consumer. We'll be ordering again soon, thank you!<br><br>Best,<br>Charlie", "pics": null}}, {"review": {"des": "FLAVORS (4 Stars)<br>Drool. Butterfly sushi was the first place that I have ever tried sushi so it holds a special place in my heart. It may not be the best but is sure a bang for your buck!<br><br>Here are some personal favorites, tips & tricks-<br>(1) Stay away from the Thai Food because their specialty is SUSHI, so stick to that-DUH<br>(2) Makis to Order<br>            a. Godzilla Maki  (personal favorite if you're not allergic to shrimp)<br>            b. Spicy Tuna (Don't be fooled. It's not actually spicy)<br>            c. Sunrise (WARNING: contains jalapeños)<br>(3) Vegetarians can enjoy maki too!<br>            a.  Avocado maki  for a non-fishy sushi experience.  <br>            b. Sweet Potato Maki (comes with a delicious sauce)<br>(4) Take out/delivery has a deal if you order more than $10 you can get free crab Rangoon or egg rolls. Make sure to eat your sushi within 24-hours otherwise the rice become horribly dry. <br>(5) BYOB!!!! <br><br>SERVICE (4 Stars)<br>The staff struggles with their English and tends to get a little impatient at times. Regardless, they get you your food in timely manner whether being dine-in, carry out, or delivery. <br><br>ATMOSPHERE (4 stars)<br>On the weekends, Butterfly Sushi is rather lively. During the week there tends to be a small but constant flow of customers. Definitely a place for all types of demographics<br><br>ACCESSIBILITY (4 Stars)<br>There are multiple locations but the Grand Avenue one is the most customer friendly (...and the food tastes much better)", "pics": null}}, {"review": {"des": "I wish I didn't have to do this but I just have to start out by saying how long it took them to make the sushi. I sat down at 1:50 the server took my order and the food didn't arrive until 2:15. Sushi was bland, nothing special. As a cook I know it doesn't take almost 30 minutes to make two rolls. Very disappointing!", "pics": null}}, {"review": {"des": "Amazing food. Great service. My husband and I keep coming back whenever we have Sushi cravings.", "pics": null}}, {"review": {"des": "Waited for 45 minutes in the entry way. Asked the host several times for an update on wait. Host would not respond to questions on where we were in the queue or how long she thought it would take to get seated. She was totally rude. For the entire wait several entire tables were left open.", "pics": null}}, {"review": {"des": "So yummy! And very fresh! Definitely recommend the sashimi, which was served to us over a bowl of ice to keep it cool while we were out on the patio on a hot summer day. The service was very friendly and the outdoor seating was sunny and aesthetic for a great post-festival lunch in the neighborhood.", "pics": null}}, {"review": {"des": "It is a great place for sushi and Thai food, great combinations. I ordered Fire Dragon Roll and it was very delicious with their special spicy sauce. The Panang curry was just perfect, not too sweet, this curry works best with a warm steam rice, yummy.<br><br>The food portion here I can finish, not too big and just perfect. The price range for this place is $11-$30, great price point. I love the vibe and the colorful decor, cool bight orange wall with a modern light all over, very modern and beautiful.<br><br>Loud music and upbeat, it made my dinner was very exciting, lol I really liked that. This place is so different than a topical Asian restaurant. Very fun and different. The parking was very challenging, but I was a lucky charm last night. Some of the peeps circled around for a long time, I saw they walked in after I had my sushi roll. Well, at least they made it in there. lol<br><br>This place is a \"BYOB\" we brought a pack of beer and thank god, I had my own bottle opener. The service was good but a few times that I had to wait for a while, they were very busy last night, well, it was Saturday night so I'm complaining. I was very satisfied :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/H2RpYoybO0FO3CyrLoWHYQ/168s.jpg", "caption": "The Dragon Roll. So good."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kykDiTIMrZl6vDaOh2vttQ/168s.jpg", "caption": "Chicken Panang Curry. Sweet & spicy, works best with steam rice."}]}}, {"review": {"des": "So this place was absolutely delicious. We ordered the gyoza, egg rolls, and crab Rangoon as appetizers, and a ton of sushi. My friend got the Tom jar soup, which was delicious. We ordered the tekka maki, the sweet potato maki, spicy salmon roll, and the Godzilla. All we're absolutely delicious. We also ordered the crazy noodles and the pangang curry. All of the food was amazing. It was my friends birthday, and the staff was sweet enough to sing to him as the brought out the honey toast desert.  The staff seemed a bit overwhelmed unfortunately, granted it was definitely a busy night. But you had to think of everything you needed quickly, because there was no telling when you'd see her again. One item was actually forgotten as well, and we were still charged. But they were quick to rectify it, so no hard feelings. I'll definitely be back, their spicy salmon roll and panang curry were two of the best I've ever had, and I'm craving them now as I type this.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oNhiAJaq8Md9bQ1Zc_oeJg/348s.jpg", "caption": "Spicy salmon roll, sweet potato roll, tekka maki."}]}}, {"review": {"des": "Told us 30 min wait it's been over 50 min now still haven't been seated. They kept giving our table of 4 to other people. Service is slow. Called them earlier to make a reservation and they didn't take any. To only get here and they have a list of reservations. Services are slow and the worst I have seen in Chicago. I wouldn't even leave one star but I had to, and the measly one slice of cheesecake, cut in two pieces doesn't change my perspective or experience. The service at the table was just as slow and they tried rushing us out as soon as possible which only made me take my time even more.<br><br>Just wanted to add how rude and unprofessional the hostess was dealing with this situation. She even came by our table to set up the adjacent table to us and was basically yelling and slamming the menus down at another Coworker. I don't think I will ever visit this location ever again. Management needs to look at their staff and reevaluate who they have working for them. They are the face people see at the door and it is and will ruin their business.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/S3jy0L72bg6Pr2B2kR_Vhw/348s.jpg", "caption": "The cheesecake they offered us to make up for the crappy service they gave us. No thank you. We left it there and they may have reserved it."}]}}, {"review": {"des": "This restaurant is fantastic! Only reason I'm giving it 4 stars not 5 is the service can be a bit better. The crab Rangoon are unbelievably good.. spicy tuna is great, as well as there nigiri. Very fresh and leaves you satisfied. Great sushi restaurant.", "pics": null}}, {"review": {"des": "4 Dollar Thai Tea-Horrible!!!  Filled to the brim with ice, after a few sips and it was gone. They didn't want to do anything about. They basically ignored my concern.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Xc5u4ZIuLaO9wlTz_O7n8g/348s.jpg", "caption": "Most of the ice melted. I would never buy this again."}]}}, {"review": {"des": "I normally stray away from places that mix ethnic cuisines - Thai + Japanese, but boyfriend and I were craving Thai and randomly came cross this place while searching online. Yelp pictures looked decent and prices were fair so we thought we'd give this place a shot. Good thing we did, b/c the Thai food here exceeded my expectations. My expectations weren't high to begin with, but the meal hit the spot. PLUS, it was super close to our place like less than a mile, and they deliver! Not many Thai places deliver to our place, so that's an extra star! Website was also very intuitive, good work. We only ordered Thai so i can't speak about the Japanese food. <br>We ordered:<br>Red curry with chicken and pineapples - very saucy, just the way i like it<br>Tom kar - excellent<br>Pad thai w/ chicken - good<br><br>Two more stars for awesome food.<br><br>Ok, now this is where i give out an extra star for delivery b/c this place breezed the test. I usually ask for limes and hot sauce and 3/5 times, restaurants will charge me extra or forget something...or give me lemons instead. Not only did they get the order right, but they hooked me up w/ tons of lime wedges and hot sauce for free. Lastly, they delivered under the quoted time frame of an hour which gets them to 5 stars! Cheaper than most Thai places in the River North/River West area. <br><br>Warning: i honestly can't think of anything. I've only tried this place once, and loved it. I'm claiming it as my 'go to' for Thai delivery.", "pics": null}}, {"review": {"des": "This place has a nice design. Great atmosphere. I enjoyed the Tom Yum soup! The rolls were AMAZING. They're kind of heavy though so you should come here with an appetite! <br>the service was also great! They were so so accommodating! I would definitely come here again.", "pics": null}}, {"review": {"des": "Came here Saturday before Halloween and the staff costumes made me wish I was doing something for Halloween.  The sushi was fresh and delicious. Also the sushi came with cool glowing ice.  Very festival and fun place worth the price for a night dinner.", "pics": null}}, {"review": {"des": "Favorite sushi in all of Chicago and greater Chicagoland. And I've had a lot of sushi.", "pics": null}}, {"review": {"des": "I can't say enough good things about Butterfly Sushi! This is my go-to BYOB spot and VERY affordable. Quality of sushi is par with more upscale places. Staff is always super friendly and the service is amazing. Keep up the good work. Highly recommended!", "pics": null}}, {"review": {"des": "Terrible service! Delivery was promised in 30 min (we live two minutes down the street) Called 3 separate times after 45 minutes had passed with staff telling us food was on its way... food arrived an hour and a half after ordering with no apology from staff.... it's a shame we will not be ordering from here again after being regulars for years!", "pics": null}}, {"review": {"des": "Get this for delivery and at the restaurant. Their sushi is so nicely decorated I don't want to ruin it by eating it!<br><br>My favorite dishes are the pad see eiw and Penang curry - must get with tofu for the vegetarians<br><br>Came here for a birthday party and they can accommodate big groups", "pics": null}}, {"review": {"des": "Butterfly had a great a few Asian cuisines. We started with the Vietnamese rolls which tasted great and the sauce that was provided with them was fantastic. All the ingredients tasted extremely fresh.<br><br>After that we ordered the the Tom Yum soup. The soup looked a bit darker than most Tom Yup soups I've had. It was also a bit sweeter than I expected and I would have liked it if it was a bit more spicy.<br><br>The sushi we had was fantastic. Very large portions and very flavourful. The Nigiri was especially large and tasted extremely fresh.<br><br>I liked the ambience, the music and the service a lot too and if the soup was better, I'd probably have given it 5 stars.<br><br>I'd definitely come back here.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KxrNjNcyz2AbfNvQ85tVRg/168s.jpg", "caption": "Sushi!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nnaU9PZKOfqpW_iMtz0-UA/168s.jpg", "caption": "Tom Yum Soup"}]}}, {"review": {"des": "We had a wonderful meal. The presentation of the food was like art work and the service was really good. Excellent sushi. We will definitely be back!", "pics": null}}, {"review": {"des": "Had the fried rice last night... soooo good. The pad Thai isn't as good as it used to but I will definitely start getting the fries rice.", "pics": null}}, {"review": {"des": "Ordered a few rolls and they all had a weird texture and didn't taste fresh. Wouldn't recommend.", "pics": null}}, {"review": {"des": "Good food, service, prices and ambiance! <br><br>I love the sushi at butterfly! My favorites are the crunchy shrimp and the dragon rolls.  They are full of flavor and also really reasonably priced.  Butterfly is also bBYOB which helps keep the cost of dining low! <br><br>The wait staff at Butterfly is also really friendly and accommodating! My boyfriend spilled some wine accidentally when we were last there and someone came to the table immediately and helped us move to another table, meanwhile cleaning the spill. <br><br>The old location was a little crammed, however at this new location, there is plenty of room between tables so you can keep your conversations between the people at your own table.  When the weather is nice, they offer outside seating, which is always a plus!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5CDBQluwPJWxPT89TP3bDw/348s.jpg", "caption": "4 sushi orders!"}]}}, {"review": {"des": "The map on yelp puts this place on the wrong side of Grand so we had some trouble (thinking we could walk and then using uber).  However, I am glad we made it here because it was a fantastic last meal in Chicago for our labor day weekend.  Eric R. selected the place knowing I do not like mixed-cuisine restaurants (I would never see Japanese and Thai belonging under the same roof normally) but he read the reviews and insisted we try it!<br><br>Eric R. loves panang curry so he ordered sushi with beef panang.  His curry was so fragrant and flavorful that I was impressed with the Thai side of the place.  His has so many vegetables, basil leaves and kaffir lime leaves - so if you like curry, get it here!<br><br>Carlie M., Brian M. and I ordered sushi.  I also got Japanese eggplant miso robata for $2.  That was nothing special - skip the robata.  Carlie M. also ordered a green salad which was so big and surprisingly good for what seemed basic on the menu - field greens, pears, avocado, cherry tomatoes, and sesame dressing.<br><br>I ordered sushi in 2 rounds and was pleased with all of my offerings.  The prices are very reasonable per piece of nigiri and the cuts of the fish were...beyond generous.  Bigger than I have seen elsewhere, maybe ever?<br><br>I got amaebi (with fried head accompaniment), hamachi (came as belly cut!), nama sake, saba, ika, tako, uni, and a summer roll.  I normally never order rolls but this had maguro, hamachi, avocado, jalapeno, cilantro, and chile oil.  It was very good!  Overall, the quality was great and I was very happy with everything I ate.  I did not see handrolls on the menu though.<br><br>Our server started off flustered but got better - she refilled our hot water for hot tea constantly.  When we originally arrived for our reservations, we wanted to sit outside because the restaurant was so cold.  We ended up being seated inside under 2 powerful air vents, but our server kindly adjusted the temperature in the restaurant, and the rest of the time we were comfortable.<br><br>Considering our portions, we spent barely more than AYCE in Vegas per person, so this was a stellar deal!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ERBV4u9_BYt-FRbN-Hfkxg/348s.jpg", "caption": "Ika and amaebi"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PvHDTRXrgzNwqjlYp5ersA/168s.jpg", "caption": "Beef panang"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/v9ySqPSDL_-sb5yBQ6K1Mg/168s.jpg", "caption": "Amaebi, hamachi, Saba, tako, sake, uni, summer roll"}]}}, {"review": {"des": "My husband and I love their beef pad Thai and spicy tuna roll! We have great service every time we go here and they are considerate with my husband's food allergies.", "pics": null}}, {"review": {"des": "Best sushi ever! Godzilla and sweet potato are the best! The coconut curry is really good and flavorful. I loved everything about this place and this location is better than the other I believe. Will be back for more :).", "pics": null}}, {"review": {"des": "Why choose between sushi and noodles when you can have both? I typically don't go for places that mix several cuisines (Thai, Japanese), but great reviews and perceived proximity to my hotel caught my eye. The restaurant has a location at 1156 West Grand Avenue (cross street -North Racine Avenue), about 1.5 miles away from where I was staying. Oddly, the Yelp map listed the restaurant as just two blocks away with the red (destination) dot in the middle of the street. My attempt to pick up food not so easy. I called and learned that this had happened before due to an outdated address on yelp. Fortunately, their delivery person arrived 7 minutes later and the food was still fresh and hot. <br><br>I ordered the Pad Woon Sen - stir fried glass noodles with chicken, egg and mixed vegetables e.g. straw mushroom, baby corn, onions, carrots, peas, and lima beans. A well seasoned, generous serving and a good ratio of noodles to protein and vegetables. Even better with just a few drops of soy and chili sauce.<br><br>Black Dragon Roll: Shrimp tempura, cucumber and mayo wrapped with unagi, avocado topped eel sauce & black tobiko. Fresh and visually appealing. A bit on the bland side but that's due to my roll choice and not the quality of the ingredients. <br><br>My takeout order did not disappoint! Definitely worth dining in at some point.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XPzHPoqGBo2apyp8d8pAtg/168s.jpg", "caption": "Black dragon (unagi/eel) roll"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/trjzDimIBuNtaFoMusH55A/168s.jpg", "caption": "Pad Woon Sen (glass noodles) with chicken"}]}}, {"review": {"des": "Mediocre food (which I found a hair in my food), slow service, probably won't be back. The one on chicago is a lot better.", "pics": null}}, {"review": {"des": "Wow wow wow. So amazing. I am from Ohio and I was told from some chicagoens to go here. All I can say is thank you. My wife and I went, and I had the teriyaki chicken, she had the cashew chicken.  They were both so good we couldn't decide which one was best.  We also had the sushi which was amazing! Raw fish can be questionable to eat but this place was amazing with every bite. I even ate my wife's left over chicken later that night.  So good.  Will go back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KfCs86V5dqjJWPMBTZq61g/348s.jpg", "caption": "Dragon roll and the tempora shrimp roll."}]}}, {"review": {"des": "I have been coming here with family and friends since before they moved locations over 5 years ago. We love it so much here. You can't beat the prices. AND it's BYOB. <br><br>It really is perfect for a girls night out, casual dinner, or romantic date night. We probably tried almost everything from the menu and it's all so great. I love it!<br><br>I also love the way they decorate your dessert plates. They really do make your experience great whether it's s birthday celebration or just a cute little date. <br><br>If you order takeout, you get a free order of Crab Rangoon or Egg rolls - just be sure to mention it. I think the minimum might only be $10. <br><br>This review is for the Grand location but I have also visited the other two locations and loved them as well.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Gm6qiV2K4D_KWN-wgTN6xg/348s.jpg", "caption": "Fried Gyoza also known as potstickers."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8JHjnrlTA3v9WWVYsw-oeQ/168s.jpg", "caption": "Wine and endless sushi rolls."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NuML3AQEjdSWuChRAKNuZA/168s.jpg", "caption": "Captain Morgan bottle to go with our coke."}]}}, {"review": {"des": "The most recommended place by me to anyone who comes to Chicago. I visit this place once in 2 weeks systematically.<br>First of all this restaurant was built from the scratch, I mean the whole building, it looks very fancy, modern and always crowded. <br><br>Second of all, the food is very good, either you want a sushi roll, a teriyaki steak or a vegetarian dish. I always start with sake make roll, which is fresh salmon, sunset or sunrise rolls are my favorite. <br><br>The service is great, since I come there very often, it suppose to be boring but they manage to make every trip unique, the management changes the presentation of the food once in a week and it is very amazing. <br><br>Also, they give you sometimes a free small dessert at the end! <br><br>And it is BYOB as well as they serve there own alcohol, no corkage fee", "pics": null}}, {"review": {"des": "On a whim, we decided to try BSBTC since it is pretty close to where we live and they were open late on a Saturday night.  We arrived at about 9:30pm and there was plenty of seating.  <br><br>The restaurant decor is warm and inviting, upscale appointments in the decor lend to an intimate atmosphere and the layout uses the space well.<br><br>The service was on par, and at times above average, for what we have experienced in the neighborhood and the food was timely; the sushi came out rather fast, which was surprising.<br><br>It was a cold night so I ordered Miso soup and Mussaman Curry with tofu to warm body and soul.  The Miso was on point and as expected.  The curry was amazing!  I judge the restaurant's quality by their ability to make good curry and Butterfly passed with flying colors.  The warm coconut milk curry was silky smooth and well balanced.  The flavors of cardamom, nutmeg and peanut burst as soon as it hits your tongue.  The first few spoonfuls were one of those moments where your eyes cross and roll back as you fall back into the chair; it was THAT good.  The vegetables and tofu were done well but there were a few cuts of onion that were still tough; almost like the layer closer to the skin that stays chewy when cooked.<br><br>The price point was inexpensive considering the portion size - all three of us had plenty to bring home.  Miso $2, curry $9 and a grand total for the table was $56.<br><br>There is no doubt we will be back and will be bringing all of our friends here!", "pics": null}}, {"review": {"des": "Absolutely love this place! Have been coming here more and more often. Have tried their sushi, many appetizers and highly recommend the basil fried rice with chicken! The bacon wrapped scallops are something else... had to order them multiple times! <br><br>The place is relatively cheaper than other places in the area and best of all its BYOB!! <br><br>The only bad thing is that the tables are so close to each other that I felt like I was part of multiple conversations while I was there! If that doesn't bother you then definitely stop by and try out this place.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YrotXdXJb-GP7Xr7493L1g/348s.jpg", "caption": "Came back with our bill and this delicious treat!"}]}}, {"review": {"des": "We had both Sushi and Thai, both were delicious, the staff was friendly, the service was quick, and the free cake at the end was a nice touch. Would definitely recommend and go again; bonus for the affordable prices and sushi presentation!", "pics": null}}, {"review": {"des": "Absolutely delicious food. There are so many vegetarian options! I also love that you can choose between sushi or thai food, but I wish it was affordable to have both! <br><br>I love the grilled eggplant skewers it was so delicious with a sauce that i just want in an IV bag! <br><br>I had the pad see ew and panag curry which were both loved by the whole group. <br><br>The only thing is that the place got so loud and there isn't enough space between the diners so you're probably gonna end up joining that date next you and end up with an impromptu group date!", "pics": null}}, {"review": {"des": "This is my first dining at this location. We were multiple times at Chicago Avenue location. To be short, premise is clean, quiet and appealing, but server was pushing to take plates before we finished the meal. Two stars are for overcharging, they add extra main dish on our check. My impression is that they new it what they did.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2tYCSq4SpTJhZyHt5pFHfQ/348s.jpg", "caption": "#Restaurant entrance ... #sushi & #thai #food"}]}}, {"review": {"des": "This was my favorite place until today. I ordered food and luckily I was paying attention, the server John had given my food to the wrong customer. She began to eat the food, put some soy sauce on it and all. Once she realized that it was the wrong meal she got the attention of the server and he grabbed the plate. He switched the food onto a new plate and tried to serve it to me! Disgusting!!", "pics": null}}]}