{"name": "caf%C3%A9-iberico-chicago-3", "reviews": [{"review": {"des": "We love Café Iberico! Bacon wrapped dates, Iberico ham, paella, steamed mussels! This place always delivers! And the sangria is good too. We went there with friends. And shared all of the tapas. <br>It's a great place and the food came out on time! <br>And the dessert was to die for, we ordered the Platano Al Caramelo: Sauteed banana with caramel sauce. Served with vanilla ice cream and the Crema Catalana: Catalonian style cream custard covered with caramel topping.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mjNIyCDMjThRrSEXa8cqNg/348s.jpg", "caption": "Grilled octopus with fries otherwise known as: Pulpo a la Plancha Tapa: Grilled octopus with potatoes and olive oil."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Jf3ZlR9_3cGEUmPyrHkoGg/168s.jpg", "caption": "Jamon Iberico Tapa: Spanish style cured ham with manchego cheese and tomato bread."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/G9Ncbe5Odn8OxHKKNZvgKA/168s.jpg", "caption": "Mejillones a La Marinera Tapa:  Steamed mussels with marinara sauce."}]}}, {"review": {"des": "Meh. It's just really meh. <br><br>Really noisy, the waiters are a bit rude, and the food wasn't anything remarkable nor that great (it was rather bland and lacked spice), and I tried like 8-9 dishes from here when I came with a group of 6. With all that being said, especially for the price, I don't think it's quite worth it and think it's rather overpriced. Oh- and we came for a friend's birthday and brought a cake. We asked them to hold it in the back and help bring it out and they charged us a $7 cake fee....so unnecessary. Many restaurants would gladly help serve a birthday cake for someone's birthday for free.<br><br>My European boyfriend said this wasn't really Spanish food either. His comment (not mine) but I'll leave it here anyway.<br><br>I've definitely had worse, but I've definitely had much better.", "pics": null}}, {"review": {"des": "We went here for a friends birthday and everything (but the eggplant) was beyond delicious. I would recommend the papas bravas, the stuffed mushrooms, the goat cheese pasta, goat cheese and marina. <br><br>The service was a little slow. I would understand if it was busy, but there were only a few other tables.", "pics": null}}, {"review": {"des": "I have been here many times with friends/family, in my 'pre-Yelp' days so this is my first review, sort of. I love getting the patatas bravas (roasted potatoes with hot sauce), paella and sangria. I hoped to impress a picky cousin of mine but she wasn't too impressed. <br>We got patatas, sangria, bread with goat cheese, olives. My cousin and brother got an entree from the specials list, I forget what, and we went out for dessert (but I love the flan, the custard and the cake!). <br>The ambiance was more family than adult, and I really miss the big room with the windows! It's too tight and loud in the main dining room. I hope they re-open the down stairs, it was very intimate and quieter.", "pics": null}}, {"review": {"des": "Went for some cocktails and appetizers while we waited for our dinner reservations. Allen was the name of the bartender that made our drinks. He's seriously the best bartender I've come across. Knows his alcohol, quick and socially charming as he's working. The experience is exactly what I picture when I decide to have stimulating conversation with my bartender. If you visit and spend your time at the bar, ask for him as your bartender, he's worth it", "pics": null}}, {"review": {"des": "We ordered way too much! There were three of us and we thought ordering two tapas each would be sufficient. These were decent sized small plates, so we were super full.<br><br>We started with the Ensalada Mixta. It was a salad with endives, beets, and hearts of palm. I love all of those things in salads, but rarely see it on menus. I liked the vinaigrette a lot too.<br><br>Of course, we had to get the Croquetas de Pollo. Those crispy puffs with chicken. And of course, we thought we needed two orders of that? Needless to say, we were stuffed.<br><br>We also ordered the Queso de Cabra (baked goat cheese) and the Jamon Iberico. They both were delicious.<br><br>I liked the sangria a lot, but I'm usually not too picky about sangria as long as it still tastes like wine!", "pics": null}}, {"review": {"des": "We were having a girls night out to celebrate my cousins birthday and she was in the mood for tapas so we decided to come here for dinner on a Saturday night. They would not take a reservation for 6 on the weekend but we came at 7:00 and didn't have a problem getting seated. <br><br>Portions here are bigger than your normal tapas restaurant which is awesome since tapas are made to be shared! We had several people with different dietary restrictions but everyone was able to find several things to eat on the menu.  Our favorites were the Patas Ali-Oli (super garlicky so maybe not the best choice for a date night), Mejillones a la Marinera, Datiles con Jamon and the paella (we opted for vegetarian that night but previously had tried the others and all have been good!) We also ordered a couple pitchers of the red Sangria and it was tasty! Sweet but not too sweet so it was pretty easy to drink a bit too much! ;)<br><br>Since we were celebrating a birthday they brought out a special dessert for her... and it definitely made us chuckle. I've attached a picture for reference. <br><br>We all were super stuffed and ordered a ton of food but the bill for the 6 of us including drinks still only came out to about $130. We've definitely spent more for less/worse food so that was pretty awesome. <br><br>The only thing that really bothered us was how loud it is in the restaurant. Even sitting next to someone I found myself having to yell in order for them to hear me sometimes. Probably not somewhere I'd go if you want to have a meaningful conversation with someone but definitely somewhere to go to celebrate and eat yummy food!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5omSZDkxrzx86D2FHPIzKQ/168s.jpg", "caption": "Sangria at the bar"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lU9d7pT8fauWX9AHkg_VWw/168s.jpg", "caption": "Birthday Dessert"}]}}, {"review": {"des": "This one was one of the worst dining experiences of my life. I hate to write a negative review unless it's super necessary. Not only was the service terrible. We were ignored the whole time. They were dead when we got here, then proceeded to sit every table around us. They refused to move us even though we asked to move 6 times. To really put the nail in the coffin I was drinking a sip of my sangria and there was a beetle in my drink. When we asked to speak with the manager our server was very hesitant. While we were waiting for the manager we saw a roach on the floor. The manager came over to talk and was extremely argumentative. Her defense was they are coming to fumigate tomorrow. I proceeded to ask \"why would you be open if you need to fumigate?\" Eventually she comped the bill after literally pulling teeth. I would rather pay any tab then almost drink a bug. Gross. Stay away.", "pics": null}}, {"review": {"des": "My friend and I tried this place during a food tour. As you know, the restaurant usually pre-cooked the food won't be fresh. Surprisingly, XOCO provided a warm greeting on arrival, vegetarian-friendly, offerings well-described, and the most important- the food was delicious!", "pics": null}}, {"review": {"des": "we went there based on a friend recommendation. I didn't like anything about this place.<br>It was so loud, the tables were sticky, the food was overpriced and the menu wasn't exciting at all. <br>I'm not a sangria fan, so I'll not comment on it. ;)<br>They had soup on their menu, so one of the people in our party ordered soup because she was not feeling good and wanted to only have the soup.<br>We got all the foods except the soup, which is usually the fastest to prepare, and it's being served before the main course.<br>It took so long that we were sure that he forgot about the soup order, and we were waiting for the check. suddenly, someone brought us a soup out of nowhere, which was not a good soup either.<br>Long story short, my experience wasn't good at all here, and I really like tapas restaurants.", "pics": null}}, {"review": {"des": "Rundown place. Bad service. Sat us down right next to a smelly bathroom when there were several other open tables available. Food was not good and server was very slow. Sangria was cheap and only reason I'm giving 2 stars.", "pics": null}}, {"review": {"des": "Though they do not take reservations - we had no issue getting seated on a Thursday evening.<br><br>All the food items we ordered were yummy! We had the calamari, pincho de solomillo, pulpo a la gallega, and the chocolate flan ( a must try!).<br><br>Fun fact: they have smaller sized plates by the bar, which you can also order in the dining room. These are perfect sized just to try, because the main menu items are larger than normal sized tapas. <br><br>You'd think a place like this would have great drinks to pair with the great food, but the taste of the drinks were not impressive.<br><br>I also agree with other reviews - the dining room is LOUD. It wasn't all that packed while we were there, but our table felt like we were yelling to talk to each other.", "pics": null}}, {"review": {"des": "Awesome service and experience! We loved the paella and I suggest you try it and they have an awesome selection of wines, if you are interested", "pics": null}}, {"review": {"des": "I love trying Spanish restaurants after having spent two months in Spain. I came here for a weekday lunch. We were some of the only people in the restaurant, so our service was attentive. The food was not as good as I was hoping for, even though we asked the waiter what the specialties were and we ordered some of them. The space felt a little dirty (tables/chairs/menus) and outdated. I was embarrassed that I chose this venue for my group outing.", "pics": null}}, {"review": {"des": "I used to go to this place for 17 years . This place is great. The best tapas in Chicago . You can't beat their sangria . Tapas sizes are pretty big and taste amazing", "pics": null}}, {"review": {"des": "I have been coming  to cafe Ibérico since about 10-12  years ago. The food is very good. <br>I visit Iberico once every 3-4 months to make sure I really enjoy it, I do that with every restaurant I really, really like.  So they don't become just \"another restaurant\".<br><br>They closed one section of the restaurant, which makes me think they are loosing clientele, the area is packed with new restaurants.<br><br>However, if you are from or come to Chicago you should try it.<br><br>Order the queso de cabra, my favorite dish, look at the picture, the grilled octopus is very good, the gambas al ajillo is a good tapa too.<br>The Tempranillo wine is very good.<br>The San Miguel beer goes well with some tapas.<br>Get a sample of the dessert bizcocho borracho and hopefully you enjoy it as much as I do.", "pics": null}}, {"review": {"des": "Food was great. The paella had a great authentic flavor. Wish the ribs has more meat. They were too shallow. But overall great place to eat dinner with friends.", "pics": null}}, {"review": {"des": "Wow!! So good. Been to lots of tapas restaurants but this is the closest to deliciously authentic as it gets", "pics": null}}, {"review": {"des": "Been coming here for about 20 years.  Sad they closed the other section of the restaurant.    The quality and quantity of the food is great and glad that Jose the owner has not really raised the prices.  If you ever want Tapas, come here.  Been to 3 other tapas restaurants in the city and this has been my favorite.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4fBhbNcDISZFSpgm4e7Chg/348s.jpg", "caption": "Paella"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bxWmsJN7VfJRrRXyXhG1KA/168s.jpg", "caption": "Goat cheese.  Delicious"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/P5jvybM4f31Ib1gGagWnoQ/168s.jpg", "caption": "Pulpa ala plancha"}]}}, {"review": {"des": "Huge tapa portions and excellent sangria! <br><br>Came here while visiting Chicago from Boston with a friend who used to live in the city - she's been craving Café Iberico since she left 6 years ago. We ordered 2 tapas and it was plenty for the two of us. My favorite was the Pulpo a la Plancha (grilled octopus with potatoes and olive oil). The plate was pouring over with octopus and it was cooked perfectly - no hint of chewiness! We also ordered the Mejillones a la Marinera (steamed mussels with marinara sauce) which to me, could have used a little more flavor. They were a bit bland. <br><br>We also ordered a pitcher of sangria. The flavor was fantastic. The best part? The pitcher had no ice. So you're actually getting a whole pitcher of sangria/fruit as opposed to 3 parts ice, 1 part alcohol. If you want your sangria chilled, you can add ice to your individual glass. <br><br>Friendly service - some of the women who work there gave us a list of recommendations for places to go out afterwards. I definitely recommend checking this place out if you're in Chicago!", "pics": null}}, {"review": {"des": "Delicious food. Excellent wait staff. Chef is Spanish and it shows with the food. Will definitely be coming back! We ordered all hot tapas including: shrimp, scallops, & squid", "pics": null}}, {"review": {"des": "A started coming to Ibérico in 1997 when I moved to Chicago. Back then they didn't have the large area left of the main bar, but still the place was crowded.  Then they opened the big dining area and this place was packed, minimum one hour+ wait on a Friday or Saturday night, if you were lucky.  The food was amazing. The last two times I went I noticed they closed the large dining room area, no wait to get a table, and the service and quality of food has significantly gone down, pretty marginal. I miss the good ol' days of ibérico. I hope they get their act together and go back to what they used to be.", "pics": null}}, {"review": {"des": "Good food, we order patatas bravas, seafood paella and an octopus dish that came with french fries .... best White Sangria in the City!  The only downside was that it was super loud!", "pics": null}}, {"review": {"des": "Decent sangria. What a great place to people watch.<br>I had already been sufficiently stuffed at Rok Akor, but the crew was in want of good sangria. The Sangria was not as sweet as preferred, but the crowd was endless flowing into this place, a very popular Tapas joint. I will have to come next time for the food and give it a try. I love great places you could sit for hours and just watch the people flowing in and out of all day.", "pics": null}}, {"review": {"des": "Rustic tapas -- hit or miss flavor; unfortunately overpriced. Not entirely impressed with the small portion of Iberico ham to bread ratio; so-so croquettes; decent melted feta and tomato sauce plate; dud beet carpaccio (with fishy shrimp). We suffered poor service on a Saturday afternoon -- seemingly due to a staffing shortage. On a positive note, they carry a medium selection of well-priced Spanish wines.", "pics": null}}, {"review": {"des": "I came here on Friday night with 8 friends with reservations. We were seated as soon as our party was half here. We ordered two pitchers of sangria, which was enough for the 9 of us for one (some two) drinks. The service was great, and patient with us while we were deciding what to order. It is super loud in here, and it was somewhat difficult to hear what people at the other end of the table were saying, but overall the ambiance was great. We felt like we were in an authentic restaurant in Spain.<br><br>Tapas we ordered: patatas bravas, pincho de pollo, pincho de solomillo, queso de cabra, vieras a la plancha, empanadas (one chicken and one vegetables), pulpo a la gallega, pulpo a la plancha, datiles con jamon. Highlights for me were the patatas bravas with the kick of spice, queso de cabra with the goat cheese, and the pulpo a la gallega. These are must trys! <br>We also ordered the paella iberica, which was absolutely amazing, well worth the wait. <br>And for dessert we split the caramel flan, coconut flan, and the stuffed crepe. All we're so good, but the best one to me was the stuffed crepe because of its strawberry sauce. <br><br>Honestly you cant go wrong with any of the plates here it seems, and its reasonably priced! Will definitely be back again", "pics": null}}, {"review": {"des": "All I remember about this experience was I felt very squished. The tables are placed closed together and I didn't have any room at all. The food was decent but pretty expensive for small tapas plates. I like Cafe Ba-Ba-Reeba better than this place. The goat cheese app wasn't the best I've ever had. The bread they serve it with is pretty hard. The service was just bleh. Nothing really stood out about this place to me. I may go back and see what dining upstairs would be like.", "pics": null}}, {"review": {"des": "What a wonderful dinner experience!!!  On a Saturday night I was so surprised how quickly we were seated for four. Let just say you must get the sangria, warning it will sneak up on you. We order several dishes to share there wasn't a dish I didn't like. My favorites the goat cheese entree. I will have to say the table are kinda small for all the food we ordered so plan accordingly.", "pics": null}}, {"review": {"des": "A 3.5, not bad, but not super great.<br><br>Food comes out pretty fast, and the service is nice.  But I walked out feeling like the quality was lacking.  Maybe I was just ordering the wrong things,  Didn't wow me.", "pics": null}}, {"review": {"des": "Noo thanks<br><br>Not much about this restaurant that left a positive impression on me - food, service, ambiance, everything, subpar.<br><br>First off it feels like a dungeon. When it fills up it feels a little claustrophobic. Servers come around every now and then to take plates and refill drinks/water, but not frequently enough. Also our server forgot to put in the \"hot\" tapas we ordered, so there was a bit of a gap in our meal vs a steady stream of plates coming out.<br><br>The sangria is terrible, I didn't finish my glass. The food - I honestly can't remember anything I liked very much. We had smoked salmon, jamon with manchego, seafood salad, two types of paella (iberico and the special with cuttlefish and cauliflower), chorizo and murcilla, croquetas, ensalada de pollo, pulpo de plancha, and patatas bravas. I'll skip the stuff that was just ok (not great and wouldn't order again) and cover the bad - patatas bravas were unlike any I've ever had, they were boiled potatoes covered in a weird sauce (not fried with hot sauce and aioli like I'm used to). The paellas were bad, like in a blind taste test with microwave rice-a-roni I would fail. Bland rice, low quality ingredients, 0 saffron flavor, not even a little hint of socarrat? <br><br>Anyway, this isn't a place I'd return. In a city full of good food there's no reason to waste time here", "pics": null}}, {"review": {"des": "Very average tapas and service. To their credit, I came with a large group, but even after asking 5 times over the course of an hour, multiple servers forgot to bring us drink refills or extra plates. The Tortilla Espanola (similar to quiche) was dry and lacked flavor, the Plato Combinado (different types of meats) failed to impress, and the other 8-ish dishes we ordered were just... meh. There are much better tapas places in the city, and with better service.", "pics": null}}, {"review": {"des": "I used to come here when i lived in Chicago. Back then the foos was great! The place has changed a lot specially the food quality. Not worth the money anymore. Won't come back again.", "pics": null}}, {"review": {"des": "My first time here, a Sunday evening and I cannot stress enough how friendly and attentive the staff is! My glass was never empty and I was never looking around for my server! The food was fantastic and the rice pudding dessert hit the spot! We ordered a bottle of their house rioja and it was delicious! I'm from the suburbs but I already can't wait to come back!!", "pics": null}}, {"review": {"des": "Something was just off about the service and food. I have coming to the restuarant for at least 10 years but had not return since 2016.<br><br>Since the last time they closed the large dinning room.  We were there on Aug.  15th around 2pm. Not too crowded.<br>We ordered the large salad , hot dates wrapped in ham and the cold seafood. <br>Our server seemed bothered to serve us. The Ensalada Mixta was good but just a little bland as was the Salpicon De Marisco (seafood mix).<br>The dates were hot and very good.<br><br>May give them another try next vacation.", "pics": null}}, {"review": {"des": "Very consistent food, great fast service! i only wish they would give us fresh plates to eat off of. That's really my only complaint.", "pics": null}}, {"review": {"des": "I'm from Spain, this has nothing to do with Spanish food.<br>Greasy and not well cooked. <br><br>Not coming back.", "pics": null}}, {"review": {"des": "This place is loud and not commended for a date night out.  Tables are so close together that I had to be mindful to scoot in whenever the wait staff were shuffling through.  We were able to be seated immediately which was a plus.<br><br>Our first loaf of bread came out burnt, but they were happy to send out a new loaf upon request.  The olive oil pourer was filthy from a build up of dried oil; we still used it, but felt that was unprofessional.<br><br>I felt the tapas portion sizes were incompatible for two.  We were better off sharing full plates.  My date's dish was bland and underwhelming.  My dish, balls of lamb in a bowl of risotto, was so incredibly hot in temperature that I had to wait over 20 minutes before I could manage to pick it at.  The dish was delicious when the bites didn't burn my taste buds.  The problem may have been the metal bowl the meal was served in or maybe it was how hot the risotto had come out.<br><br>We also thought it was silly that you're charged an additional 50% per refill on a soda.  I haven't been to a place with no free refills on soda in years.  I guess it's good the soda tax is gone now!", "pics": null}}, {"review": {"des": "I have been coming here for over 15 years and I am sad to say that the quality of the food and the service has completely gone down. For a Friday night, the vibe that used to exist is now gone. I hope that the owners can turn this place around otherwise I don't see it existing for too long.", "pics": null}}, {"review": {"des": "I've been coming to this establishment since the early 1990's.  Excellent service and entrees.  All their Tapas (hot and cold) are well prepared.  Organized and clean...perfect place for all occasions and for all appetites.  The desserts are awesome as well.  BEST Spanish restaurant in the city, in my opinion.", "pics": null}}, {"review": {"des": "First time in Chicago downtown, the place has a very appealing atmosphere, the crew are very friendly and the food very good. Try the mejillones, jamón serrano.", "pics": null}}, {"review": {"des": "The food was delicious! The atmosphere is very lively and the ambiance is very romantic. It is simply lit but it just adds to the ambiance. My family has been coming here for years! The plates (tapas) that we usually order are Ensalada Rusa (cold plate), pincho de solomillo (hot plate), patatas bravas (hot plate), salpicon de Mariscos (cold plate), gambas al ajillo (hot plate). Those plates are our all time favorites! We usually order our food with their signature red sangria. The sangria is very potent but very delicious. If you are not a fan of red wine then the white sangria is sweeter. Will be back very soon", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iqPfX3zHBZZ65vOTuU-XaQ/348s.jpg", "caption": "Jamon Iberico Reminds me of Spain! It does need a bit more salt tho. I don't know if I would order it again but it was delicious!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/e8ceGpQmmXvDobiJ6C5etA/168s.jpg", "caption": "Datiles con Jamon Very delicious! Nice combo of salty, sweet, and tastiness. The rice makes it filling."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9nz99Atbj7h1nk24NaYQNg/168s.jpg", "caption": "Ensalada Rusa LOVE LOVE LOVE!! This has tuna and we always have to order extra bread with this."}]}}, {"review": {"des": "I've been to this restaurant plenty of times for the past 8 years and the last time I was there the service was horrible and food is not as good as it was once the sangria was ok the patas bravas was not so good I usually order the pollo ala braza that was really good but overall rating was one star it's very expensive for a bad experience and it's not very clean as it use to be few years ago.", "pics": null}}, {"review": {"des": "Food was Sub standard. Sticky floor. Very ok service. <br><br>Go to Cafe Baba Reeba instead", "pics": null}}, {"review": {"des": "Came here for dinner on a Sunday night with a few friends. If you're craving tapas, make the trek up to Ba Ba Reeba for something better.<br><br>Atmosphere: One positive- it was a lively environment, a solid amount of people for a Sunday. The place was somewhat bustling.<br><br>Service: To start, our table wasn't even cleaned up properly. There were still dirty napkins left on it. Our server forgot one of our orders and we ended up leaving it because it took so long. Our server also forgot to bring our bread-- which every table but ours was receiving when they first arrived. We asked for it, along with eating utensils.<br><br>Food: We ordered the parrilla mixta (squid, shrimp, octopus special of the day), the paella, gambas and patatas bravas. The parrilla tasted burnt. The gambas were decent, the patatas never arrived. The paella was also decent. All in all pretty mediocre.<br><br>I visit Cafe Ba Ba Reeba frequently and wanted to try something new... but in this case I'd stick to what I know is good. I will not be returning to this café.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/B0aEPYgNVrvq3LthSh1qAQ/348s.jpg", "caption": "The paella- not too shabby, not outstanding."}]}}, {"review": {"des": "So disappointing! ! ! I've been coming here for over 10 years (after living in Spain). It was always one of my favorite sports. <br>Their menu hasn't changed, but the food and portions sure have! ! Croquetas are my favorite, and the ones they serve now are sooooooo tiny (like half the size you would get in Spain). Same thing with the dates. We ordered about 15 different tapas and all were underwhelming. They didn't taste fresh.<br><br>It feels like ever since they did that major expansion, the place has lost its atmosphere and authenticity. I'm really disappointed and won't be going back.", "pics": null}}, {"review": {"des": "Good sangria! Good food! Great background music! I must recommend the paella. Outstanding!", "pics": null}}, {"review": {"des": "I love coming here! Staff is very nice and food is great. Special events, meetings, dinner or just a fun night out Cafe Iberico always pulls though. Plus I believe the food is way better quality and taste wise than other tapas places I've had. <br><br>Deserts are also so tasty.", "pics": null}}, {"review": {"des": "Great tapas at this place. We had the eggplant, the salmon tartare, scallops and tuna cannoloni Everything was tasty. The server was polite and attentive. We also had a good Spanish red wine with dinner. Prices are reasonable.", "pics": null}}, {"review": {"des": "We went with a group of people some who never ate real Spanish food. After a pitcher of sangria, several tapas of chicken, shrimp, squid and octopus we order a few more delicious main courses and finished off with a caramel flan.<br><br>Order the lamb chop special even when not in the menu! Great restaurant if you do not need a fancy environment and come for the food", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-OcGSsbXVqppg-dO9vdpag/348s.jpg", "caption": "Slow roasted lamb shank more than enough for one"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hNHmTxUCkCxrdnPODQF_YA/168s.jpg", "caption": "Chicken spinach would not order again"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/olb6t9h3FcOUikAj-gjh7w/168s.jpg", "caption": "Caramel flan is my most favorite dessert and they make it really well there"}]}}, {"review": {"des": "My daughter and wife have been telling me about this place ever since their last Chicago visit where they had a fantastic meal and evening here. <br><br>So I've been wanting to come here for a while. We finally visited on a short family vacation  to Chicago on a Saturday night. So here is a summary. <br><br>Pros: <br><br>- We were seated promptly (in about 15 mins) after we arrived at the restaurant (they don't take reservations for a party less than 8 on the weekends). <br><br>- The hostess and the server were very polite. <br><br>- some of the tapas were excellent. I liked the eggplant with goat cheese, the lamb, and the octopus. My daughter really liked the bread with goat cheese but I thought the bread was too greasy. <br><br>Cons: <br><br>- the sangria was not great. My wife remembered it to be much better on the earlier visit so it might just be an anomaly. <br><br>- some of the tapas were just okay. For example, I was quite disappointed by the chorizo. <br><br>- my main complaint however was with the noise. It was LOUD. And I mean REALLY LOUD! It was nearly impossible to hear the waiter and we felt that we had to shout to hear each other on the table. This is because of poor acoustics in the restaurant. This took away immensely from the experience and frankly we were exhausted by the end of the evening. <br><br>I would give it 4 stars for the food, five stars for the service (the servers were super nice although they were overwhelmed by the number of people), and zero for the ambience only because if the noise!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bgby0aaLNRrS4OtLYFOa-A/348s.jpg", "caption": "Great Tapas place"}]}}, {"review": {"des": "Absolutely the most helpful Waiters. The food is awesome chorizo the muscles to die for and it's all the sauce", "pics": null}}, {"review": {"des": "Topline: good, but not great.  <br><br>As I am a fan of tapas, menus with a plentiful selection, and parties, of course, I was thrilled to revisit Iberico for a friend's bday party of about 14 diners.  We shared amongst us sangria, goat cheese, chorizo, patatas ali oli (cold potato salad), patatas brava (spicy, warm potatoes), hot chicken entrée, calamari, empanadas, shrimp, croquetas.  Yes, as you can tell, we had a hearty sampling of a lot of the highlights off the menu. Flavors were good, but I wasn't blown away. <br><br>Water service was surprisingly efficient for our large party. Iberico is great for groups; that's for sure!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/G1s5fOCiLLFYLQnTJnAJhg/348s.jpg", "caption": "Shrimp"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Scn2t4E6KFBa8g_nYQmcOQ/168s.jpg", "caption": "Queso de cabra aka goat cheese"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sBR3V27Xw88Fp6sjBpvxSA/168s.jpg", "caption": "Chorizo and blood sausage"}]}}, {"review": {"des": "I'm obsessed. Everything is delicious and the place is reasonably priced. It has a really fun vibe ideal for groups of frands. <br><br>Order the goat cheese, grilled octopus, croquettes, and the mussels! I would eat the caramel onions for 3 meals a day if I could. Everything else is delicious too.", "pics": null}}, {"review": {"des": "I came here based upon a friend's recommendation. I was both underwhelmed by the food and service. This place is obliviously vet popular and maybe the experience is meant to be experienced with a group and in the dining section. <br><br>I had the most inattentive bartender who didn't even try to engaging. I had to flag him every time I needed something and had to follow up on my order. <br><br>My meal was meh and my order was based upon Yelp reviews and the waiters recommendation. <br><br>Queso de Cabra (pesto bread with goat cheese and marinara) - cold and just bread with pesto and cheese. I could have made this at home. <br><br>Pastas Bravas (spicy potatoes) - these were tasty but I've had better.<br><br>Champinoes a la Plancha (grilled mushrooms) - assorted mushroom medley. Just ok. There was a lot of different mushrooms but the flavors were not outstanding.<br><br>Red Sangria - simple and straight forward but has too much ice and got watered down quickly. <br><br>Overall the portions were bigger than I expected. I would try this place again but in a group as the tables looked like they were all enjoying themselves.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oXFskDMZUXaRRp4d5GkqqA/348s.jpg", "caption": "Mushrooms"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7HpqzjE1yzyUGw8-QeHPEg/168s.jpg", "caption": "Pesto with goat cheese"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IwwCCsx00LUvDRHm49DBrg/168s.jpg", "caption": "Potato's"}]}}, {"review": {"des": "Amazing, authentic tapas! Went here for a bachelorette party and they were so accommodating, even brought out a penis shaped dessert. LOL", "pics": null}}, {"review": {"des": "Terrible service! The waiter was rude. The busboy chose not to clean up our table after I asked him. He ignored any and all of my requests. The food was ok. When they brought the food they almost slammed it down on our tables. I was very disappointed and very offended", "pics": null}}, {"review": {"des": "Seems really awkward that with a room full of Spanish speaking staff and clientele that FOX News would be predominately playing on the TV in the bar for everyone to see as they enter the restaurant.  Bigly sad!", "pics": null}}, {"review": {"des": "I went here after work with the wife and some colleagues.  While we enjoyed it, the food was not awesome.  The mushrooms were delicious.  The potatoes were standard - the Same thing you get at any tapas restaurant.  We also had small clams, which were steamed or boiled, a large empanada, and shrimp.  As happens with tapas, the food is expensive based on portion size. <br><br>We ordered at least two pitchers of red sangria with the food and I recommend that you try it. My only comment on the sangria was that the fruit wasn't all that good. Sometimes the fruit is good enough to sample, but not so much here. <br><br>The service was good.  The atmosphere is nice although it does get loud.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/92_aOr6LeYrG8foG3u3Ttg/348s.jpg", "caption": "Grilled Shrimp"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UwcLyWMULhnjaYhqOtFDEw/168s.jpg", "caption": "Mushrooms"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ppevY7K12YuEoiv_XsvDSw/168s.jpg", "caption": "Small Clams"}]}}, {"review": {"des": "This is the one restaurant that I have frequented the most over the years. Up till now I have always given them a 5 star rating. Why the change? Well I went there during the winter, and asked to sit on the side with the deli, as I have in the past and I was told that the other side was currently being renovated. I thought to my self, renovation great. Now wait hold on!! The other side was  perfect!  It didn't need any improvements. That side reminds me of the many places I have eaten at in Madrid, Espana. Better yet the food was almost on par with the places in Madrid. Over the years, I have taken many friends and family members there to enjoy the food and ambiance. We celebrated many special moments there. Just prior to leaving after every meal, I scoped out all of the Spanish products being offered for sale at the deli. Normally, I would always find something, in addition to taking home some serrano ham, manchego cheese, and chorizo butifarra. This was my routine for many years. This is one of the only places where I could pick up chorizo to put into my signature dish at home, paella.<br> <br>Well, I purposely didn't go for months to allow them time to finish the renovation work that they started. Upon my return, I did my usual, as soon as I stepped in and faced the hostess; I requested to sit on the side with the deli. To my surprise the hostess said, that side has been blocked off and is no longer part of the restaurant. There was some sort of disagreement between the building owner and the restaurant owner; and as a result the lease was not renewed. I was probably standing with my mouth open in astonishment!! At first, I was speechless, I never wanted to sit anywhere else... We ended up being seated upstairs in what was once called the pintxos (tapas in Basque) restaurant. I have to admit that I did not enjoy the ambiance up there. Nor the fact, that there is no more deli! The sudden realization that everything changed set in, and saddened me.<br><br>Will I continue to frequent this restaurant? To be honest.  I don't know?", "pics": null}}, {"review": {"des": "Ordered: White wine Sangria, Lamb with potatoes. <br><br>DRINKS: The Sangria was pretty good. I mean, it's hard to mess up Sangria. <br><br>ATMOSPHERE: Date-y. Good for dates, you can definitely hear each other talk. It's dimly lit and has rustic Spanish decor. People were wearing jeans with blouses, dresses, heels, flats. Etc. A good variety of attire, but all in all everyone looked nice-- no one was in shorts and flip flops. <br><br>FOOD: Very Reasonably priced for the portions, and the lamb was spectacular. Awesome flavor and very tender. The bed of potatoes was also very much appreciated. <br><br>OVERALL: Would recommend, would return", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dhC_5SMMvSehthKEYOtbEg/348s.jpg", "caption": "Lamb and potatoes"}]}}, {"review": {"des": "This place used to be a go to for tapas in Chicago... but that was at least 10 years ago. I'm not sure how they've stayed in business because whenever I get talked into going back, it's still terrible.<br><br>On my most recent visit, the only decent (better than mediocre) dish was the calamari (which is surprising because calamari is one that most places mess up). The patatas bravas (usually one of my favorites) were soft, dull, and uninteresting. Everything else was unremarkable. It didn't help that the servers seemed to splash water on the table every time they refilled the water. They also seemed bored when taking our order and offering to pick up used plates or bring new ones.", "pics": null}}, {"review": {"des": "Had dinner here for the first time and it was my hubby's first experience with tapas. Loved the Iberico, cheese, and bread platter...AMAZING!  We also enjoyed the sautéed shrimp and garlic dish and finished the evening off with a superb flan (had I known it was going to be that good I would have started with it and finished with it too!) and an espresso. A great treat for our last night in Chicago.", "pics": null}}, {"review": {"des": "Quaint charming Tapas bar. Service started out slow. But food was worth the wait. Seafood salad was fresh with  tomato, peppers and assorted seafood. Spicy potato's, nice size chunks of potatoes in sauce. Warm goat cheese <br> was divine. Too bad we didn't have room for desert. They looked yummy.", "pics": null}}, {"review": {"des": "I have eaten here countless times over the past 10 years and the tapas never disappoint. The scallops, the canelon de atun, the queso de cabra. I've never had a small dish here that disappointed. (I had a very salty paella a few years ago, and I've avoided it since. Why get it anyway when the tapas are so damn good?!)<br><br>The problem is the noise. I was just there last weekend and it's gotten worse. And the remodel is a darn shame -- will they reopen the north-side room? or is it gone forever, now belonging to a different establishment? I hope they bring it back. <br><br>Also, a side note: It's very annoying that they won't take reservations of parties smaller than six.", "pics": null}}, {"review": {"des": "The best Tapas restaurant around.  I've been coming religiously for years and it's always the same amazing flavor. The food never fails, some of my faves include: patatas bravas, pincho de pollo and solomillo, pulpo a la plancha, croquetas de pollo and queso de cabra.", "pics": null}}, {"review": {"des": "This review is based solely on the drinks and atmosphere of this place. Our server always made sure we were okay and came by frequently. The party I was with order appetizers, but I didn't join as I had previously eaten. It did smell and look amazing though! The bar/drinks were standard and not too much to rant or complain about.<br><br>The atmosphere is really laid back but loud, if that makes sense. Nice warm decor and low lighting helps this place become a spot you'd want to join coworkers for happy hour or a date night.", "pics": null}}, {"review": {"des": "Never fails to impress. Amazing tapas, great value, and in my opinion, better than Cafe BaBaReeba. There are som real stand out dishes here: pulpo a la plancha (one of my top 3 favorite dishes in the world), champinones a la plancha, and queso de cabra (get it off of the pintxo menu though, the full size tapa isn't a great deal...you get about the same with the pintxo \"tapito\" size).<br><br>Honestly, one of my favorite restaurants in the world.", "pics": null}}, {"review": {"des": "Finally made it to Cafe Iberico! My sister has been recommending this spot forever and now I see why! The service was awesome and the food was amazing! Came here with a friend and we ordered the paella de pollo, cazuela de carne asada, gambas al ajillo and patatas bravas!  Oh and can't leave out the pitcher of sangria  Everything was so delicious. If we had to rank them we'd say gambas al ajillo #1, paella de pollo #2 and patatas bravas and cazuela de carne asada on an even playing field. Will definitely come back the next time I'm in Chicago!", "pics": null}}, {"review": {"des": "Best restaurant for the value, flavor, and convenience. I made reservations here for a party of 6 on a Thursday evening and they were incredibly accommodating with pushing back the time and later calling to say we were running later. The place is pretty large so you shouldn't have an issue with reservations. If I lived in Chicago, I would totally love to have my birthday dinner here!<br><br>Onto the food:<br><br>Salpicon De Mariscos mixed seafood salad with shrimp, octopus and squid: all of the seafood was so nicely seasoned and tender, pretty impressed <br><br>Patatas Ali-Oli<br>Red potatoes with garlic mayonnaise sauce: Omg heart attack of mayo overload but I LUV mayo and the combo with garlic so nicely slathered I woulda never thought to mix on my own, loved it!<br><br>Patatas Bravas<br>Spicy potatoes with special tomato sauce-not really spicy but didn't want it to be; it was alright, we had too many potatoes.<br><br>Pincho de Pollo<br>Chicken brochette with caramelized onions and rice-yum yum yum, nicely cooked and I gobbled up those onions<br><br>Pincho de Solomillo<br>Skewered beef tenderloin with fries and caramelized onions-didn't really care for the beef which tasted more like sausages and I was expecting more steak<br><br>Datiles con Jamon<br>Dates stuffed with goat cheese and wrapped in Spanish ham; served with rice and raisins-too much date or sweet taste and not enough ham for the savory part<br><br>Raxo Adobado<br>Marinated pork loin served with home made fries-I liked dipping the French fries from this dish into all the other sauces from other dishes<br><br>Mejillones a la Marinera<br>Steamed mussels with marinara sauce-would order again!<br><br>Paella Iberica<br>A Cafe Iberico original, served with seafood, chicken and pork-not the best paella in the entire world since it could use a lil more marination of seafood flavor the rice but it satisfies my paella craving, price is unbeatable and so is portion size (fed 6!)--it's pretty good!<br><br>Sangria $17.95 for a pitcher to fill 6-large water drinking glasses, not just tiny lil wine glasses.<br><br>I want to go back already!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-4snb7IVSDeriXhHMxETJQ/168s.jpg", "caption": "Potatoes w tomato sauce"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YmpnDmnqqAgpnkcBFVP9jA/168s.jpg", "caption": "Seafood salad"}]}}, {"review": {"des": "After being told the wait time at Au Cheval was a ridiculous 6 hrs, we furiously searched Open Table to see if anything else has last minute availability. Luckily we were able to just walk right in to Cafe Iberico.<br><br>Ambiance: The main dining area was a huge room packed with tables. Honestly it didn't have that modern or trendy type atmosphere that a lot of places in the area have. No frills decor, which didn't really bother me. I did think that the tables were pretty smushed together to maximize the seating. It was pretty hard to navigate around all the other tables when going to the bathroom. <br><br>Service: The service felt just a little bit rushed. We ordered a ton of stuff and were in and out within an hour. It seemed like they just bombarded us plate after plate to the point where there was no space on the table. We had to quickly finish everything on the table to make room for the next dishes. No time for talking haha. I guess I would prefer this though over having to wait long periods if they staggered all the plates. Somewhere in between would've been nice.<br><br>Food: In true tapas style, we just ordered a ton of different dishes and then got a little taste of each. <br><br>Patatas Bravas - This seemed like a more traditional take on patatas bravas than I've seen at other tapas places. It was a huge mound of fried potatoes drenched in a tomato based sauce. The flavor was just ok for me. I did like the slight hint of spice. Also, I was hoping it was less saucy so the potatoes would still be crisp. Quantity wise I was satisfied. Unlike Mercat a la Planxa, we got a full plate of potatoes instead of 5 tater tots on a plate. <br><br>Pincho de Solomillo - Basically a skewer of beef and fries and onions. The marinade was pretty flavorful and the meat was juicy. Pretty much like Spanish style steak frites.<br><br>Queso de Cabra - Pieces of toast spread with some sort of pesto sauce. Then you top it off with a mix of marinara and goat cheese. Loved the crunchy toast mixed with the creamy goat cheese. <br><br>Croquetas de pollo - The description said it had chicken and ham in there, but the inside was pretty much had the texture of mashed potatoes and it was hard tell what was in it. Either way, I liked the taste. Crispy outside, smooth filling, and that creamy, cheesy dipping sauce was money. Reminded me of the cheap, street food croquettes I had in Amsterdam.<br><br>Calamares a la Plancha - Grilled calamari that had a nice smokey, charred flavor off the grill. Texture was a little rubbery and hard to take down. <br><br>Empanada - This wasn't what I pictured. Instead of the usual bite sized empanada, it was like huge like a pot pie. Flakey crust filled with beef, veggies, and unfortunately nasty ass raisins haha.  <br><br>Gambas al Ajillo - Probably one of my favorite dishes of the night. A skillet with shrimp tossed in olive oil, garlic, and some crushed red pepper. Garlic lovers will rejoice about this one. <br><br>Raxo adobado - Almost like a pork version of the pincho de solomillo. Pork loin and fries topped with onion/cilantro. The marinade was again tasty but the meat wasn't as tender and juicy as the beef. A little hard to cut through. <br><br>Chorizo y Morcilla - Mixed plate of chorizo and blood sausage. The chorizo had a nice crisp skin, but I'm not too big a fan of blood sausage. Wish the portion was a little bigger though. <br><br>Overall, dinner was just ok for me. The food was pretty good, with none of the flavors being too memorable. The meal was pretty much all business trying to finish all the food rather than taking our time and enjoying the company. I will say though, for as much food as we ordered, the prices were very reasonable.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bCdcponYBDRu39Xpo-aEQQ/348s.jpg", "caption": "patatas bravas"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9i6R6Xgb8d-Q30gF2gsBDg/168s.jpg", "caption": "gambas al ajillo"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LzjPEsYt4EFhhyJpZAIMKw/168s.jpg", "caption": "croquetas de pollo"}]}}, {"review": {"des": "I used to come here all the time for networking/big group events and I totally forgot about this place. My most recent visit was for a birthday party and there were about 20 of us. Service was very fast and efficient and we ALL enjoyed our food. This is a tapas restaurant so meals are meant to be shared. I had a hard time sharing my spicy potato dish cause it was just too good (so I didn't share) lol. I however did dip my fork into other people's plates and my favorite would have to be the grilled octopus. <br><br>Sangria was flowing and I was drinking all of it. They had different flavors to choose from. The food here is delicious and definitely a great place to go with a group.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2ixlIOQNCBNSbjYc8nEwqg/348s.jpg", "caption": "Grilled Octopus"}]}}, {"review": {"des": "Our experience was at the bar. The ambience is cozy and we tried and recomend the croquetes. They taste so Delicious. The customer service was not so greate, on time that the two girls at the front door was more concerned about their personal conversation than welcome us in and our server was much more interested in the game displaying on the TV.", "pics": null}}, {"review": {"des": "I have visited Iberico over a handful of times and the experience keeps getting progressively worse. Sigh! The service is pretty clueless and the food is just tasteless. If I order 8 tapas, I will allow two of them to be mediocre or even bad but if 7 out of 8 are bad then I am going to be disappointed. We had the goat cheese bake, octopus, Russian potatoes, chicken and rice skewers, some spicy potatoes with red sauce, tuna among others. Tuna was okay and the bake wasn't bad but the bread that came with it was awful. The food tasted really old and microwaved. <br>The only reason this review has 2 stars is the sangria. But as far as food goes I will take my appetite to baba reebas if I crave tapas again.", "pics": null}}, {"review": {"des": "This place is great for groups!! Every plate we got was better than the last! Friendly service as wel", "pics": null}}, {"review": {"des": "Patatas Bravas are amazing! <br>White Sangria is delicious! <br>Cazuela de Carne Asada was very tasty.  The Carne Asada was tender and juicy. Not dry like I've had it at other places. The service has always been great here. I'm understanding that I've been there during busy hours so I don't mind if they take a bit longer to check on the table but so far no issues. I recommend this place for people who are new to Spanish tapas.", "pics": null}}, {"review": {"des": "Just ok. Tough competition with some other greats in town like babareeba. Big plates, wide variety, but just not as good as it used to be (2017 compared to 2013)", "pics": null}}, {"review": {"des": "This is downright the best tapas place in all of Chicago. You can't go wrong with the patatas bravas and bacon wrapped dates. I'm not a huge fan of paella but this paella isn't bad, the quantity is large enough to fill the bellies of a large family and the quality is definitely good.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KFXQke6Op6Li4fQjebG_4A/168s.jpg", "caption": "Bacon wrapped dates, a must have"}]}}, {"review": {"des": "Popped in for lunch, and had a few tapas from the regular menu.  Both were really good but the empanada was excellent with an amazing sauce!  Not a cheap lunch per se but worth the extra coins.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/M6Q1wsvhlggoRoLPPr5VXw/168s.jpg", "caption": "Beware ithas raisins in it but is delicious!  Very good sauce too!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aHrD_Pl-F2abOkhhaBxoKg/168s.jpg", "caption": "Very sweet and savory"}]}}, {"review": {"des": "Repulsive. I believe the only people<br>Giving this place 4 stars are the minute individuals of the city. The crowd was offensive. The food was microwaveable. And a vodka cost $19 - more than the cost of paella and more than one of the high end rooftops in river north...who sport a<br> high class, respectable crowd. If I could rewind time and take back 1 regret in life it would be coming here. It feels like an amusement park food court and I am repulsed that I was seen in this venue. Lasalle street at its finest unfortunately I have to choose 1 star because -10 is not an option.", "pics": null}}, {"review": {"des": "Meh, I was underwhelmed by Cafe Iberico. <br><br>The service was decent; our server was attentive and we didn't wait long for anything. But the food wasn't impressive. It wasn't bad...it was just ok. I felt like the prices were too high for what we were served. I had just one slice of \"free\" table bread - it was flavorless. The rest of the dishes were forgettable.<br><br>The interior was ok. Not the most comfortable or appealing. The atmosphere was off. It felt like a clubby River North bar instead of a restaurant. My group was seated downstairs near a few other tables of large parties. There was a lot of loud chanting and yelling. It felt weird.<br><br>There are other Spanish tapas restaurants in Chicago that I feel are better quality and atmosphere.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eP7hs2l6KSL7zoATRH3p4w/348s.jpg", "caption": "Gross surprise birthday dessert given to guests (man or woman). Nasty banana plated w/ 2 scoops of ice cream...to look like male anatomy."}]}}, {"review": {"des": "Cafe Iberico is the perfect place for a great meal, lively conversation, and awesome people watching. Although it has gone through many changes over the past 20+ years, the food still remains as delicious as the first time I laid eyes on the plates. <br>This is the king of Tapas joints in Chicago, and the Sangria cannot be beat. <br>Keep in mind, the dining room is loud, and lively, and the room is fast paced. This is not the place to have an intimate dinner. although, If you want to sample many dishes, bring a large group. The portions are huge, and the prices are super affordable for being in River North.", "pics": null}}, {"review": {"des": "This is more of a 3.5 star review rounded up to a 4. <br><br>I came here late on a Monday night and it was empty. The main dining area was large, so I assume they're used to accommodating a much larger crowd. We were seated immediately and the staff was very attentive. <br><br>The food was definitely good, but not spectacular. We had the Gambas Al Ajiilo, Croquetas De Pollo, Calamares a La Plancha, Pulpo a La Plancha, Chorizo y Morcilla, and one chicken dish, but I'm not sure which one it was. I was not bold enough to try the blood sausage, but I enjoyed everything else especially the Croquetas de Pollo. They come with an \"Ali-oli\" sauce, which was the highlight of my meal. The chicken came with rice that my friend described as \"regular rice that they made orange\". I didn't have a chance to try it lol. <br><br>In addition to all that food, we also ordered three drinks, and the total came out to $96 or $24 each....I can't remember the last time I dined so well for under $25!", "pics": null}}, {"review": {"des": "Food was good and service was great so it was a nice experience to come here and celebrate one of my best friend's birthday. Everything was delicious. We all were so happy with our dishes. Good experience!!!", "pics": null}}, {"review": {"des": "Not bad. The rice is good the customer service is nice. They have valet parking which is pretty cheap", "pics": null}}, {"review": {"des": "Still the best in Chicago , we have been here over 40x now and it's always consistent , it is best to go during the week when there is no wait , we have had almost everything on the menu and always consistent ! A+++", "pics": null}}, {"review": {"des": "My husband and I were extremely underwhelmed by this place, especially with having high expectations from seeing so many reviews and an average of 4 stars. We shared the octopus and potato tapa and also the chicken and seafood paella, and had a glass of one of the recommended red wines. Everything was very lackluster, including the wine. The paella could've been much more flavorful with more seafood. A small positive note is that the octopus was very tender and came on a large plate rather than what we expected as a tapa. Again though, this could've been much more flavorful.<br><br>Although a good thing is we came early around 6:30 pm on a Friday night so we were able to walk right in. When we left an hour or so later, there was a huge wait. And overall, the restaurant was very noisy and much more of a place where people are bringing their kids and large families, rather than an intimate setting for a date. Unless you're at the bar area, which was a bit more dimmer and much more quieter.", "pics": null}}, {"review": {"des": "This place was nice but I really don't understand the hype. I came in on a weekday for lunch with my friend. The restaurant was huge with plenty of tables and seats around the bar area but only a few people were there at the time. Which is why I didn't understand why they chose to put us at a table RIGHT next to another couple. We were so close that our seats were touching and could hear every part of their conversation. It wasn't a huge deal but just odd that they chose to use their space like that.  Other than that, the service was fine.<br><br>The food was decent as well. The best thing we had was garlic shrimp where the shrimp was cooked perfectly and tasted fresh. The next was the chicken and ham puffs. It's difficult not to like anything that is fried with melt-y flavorful filling.  I didn't really care for the seafood paella though. The rice was sort of dry and the seafood was just okay. Maybe it was because we were already so full by the time we got the paella but it didn't quite meet the expectations that all the reviewers raved about.<br><br>I would recommend this place if you come with a large group so you can try different things and not get stuffed on just 2-3 dishes. It also seems like a fun place to have drinks with your friends. It's located in a nice area in the city. We were able to find street parking since it was the middle of the day but I can see that this place area would get quite busy at night especially the weekends.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MNEQe21w8GVO_S9ku0RGNQ/348s.jpg", "caption": "Chicken and ham puffs - delicious"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Nisk5deIDiesAJZMGUIeag/168s.jpg", "caption": "Shrimp in olive oil and garlic - was very tasty"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sZzYwROs1OfKmkcgLAjOwg/168s.jpg", "caption": "Seafood paella - was okay"}]}}, {"review": {"des": "Well<br>I celebrate my daughter bday today<br>Food was bland<br>Service was very good<br>I try sangria was good<br>Papatas bravas<br>Queso de cabra <br>Dates w/bacon<br>Paella iberico <br>Croquetas de pollo<br>And dessert crema catalana and crepe w/ice cream", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/laUxBVUioQrNQ6qG_G9kPg/348s.jpg", "caption": "Sangria"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/W9_CVvN2rTV4ACvcuG4_MQ/168s.jpg", "caption": "Sangria"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/l1R62bfPfRKW3Nb2vE-Iwg/168s.jpg", "caption": "Paella iberico"}]}}, {"review": {"des": "Chicken was tender and delicious. <br>Paella took long to cook, but faster than 45 min. <br>Grilled octopus recommend. Sometime spicy potato taste changed. Scallops are recommend too.", "pics": null}}, {"review": {"des": "Came here with my boss who is French but married to Spaniard! We tried 4 different tapas! I am very much impressed and couldn't have asked for more! They are all delicious to the very last bit! I ordered the potato omelet that looks like a frittata cake, and shrimp with olive oil and red pepper flakes! <br><br>They are all delicious that makes you want more but you're just too full! Small portion but a full filling food! <br>Definitely a must go place when you're in town!", "pics": null}}, {"review": {"des": "Cafe Iberico is my favorite tapas bar in Chicago.   I've lived in New York, Miami and Tampa and this place is at the top of the list.   The Pulpo a la Plancha; Gambas al Ajillo and the Salpicon al Marisco are my favorite dishes yet everything I've ordered here is of the utmost quality.  The friendly, attentive and experienced hostesses, wait staff and bartenders are very good at what they do and offer multiple suggestions to even the most inexperienced tapas seeker.   It's the kind of place where I will often defer to their judgment on what dishes or type of wine to order.   The atmosphere is welcoming and prices are reasonable relative to its downtown location.  I highly recommend Cafe Iberico!", "pics": null}}, {"review": {"des": "Enjoying dinner with my sister and Dad. This is just a taste of Spain. We're definitely going to visit the Spanish motherland. Food is delicious. The variety of tapas....omg... scrumptious.", "pics": null}}, {"review": {"des": "Easy to walk in for a table. Service was decent. Food was sketchy. We can't be sure which dish caused it, but my fiancée and I had stomach....issues after eating here. Could have been an 'off' night in the kitchen, but I don't think I'd spend that kind of money to go back again.", "pics": null}}, {"review": {"des": "We came in on a Sunday night around 10pm, so it wasn't very busy. We were seated immediately on the bar side and had waters within a few seconds of sitting down. We ordered the pincho de pollo, the shrimp, and shank of lamb. Pincho de pollo and lamb shank were delicious. Wished I had more chicken it was so tasty. The shrimp was a little too oily for our taste but was still seasoned/flavored well. Loved the atmosphere and service was decent.", "pics": null}}, {"review": {"des": "Still as good option for tapas after all these years. Have been going to Iberico for 22 years and the food is good and pretty authentic ( lived in Spain and this place is close to the real deal). It's fairly easy to snag a table these days. In some ways I miss the line out the door 1-2 hour wait / energetic vibrant feel that was customary on a weekend night when I first started coming here but it is nice to get a seat immediately. The prices are extremely reasonable and it's a great choice for a group. <br>Tips re: ordering<br>The best- <br>tortilla española- It's authentic and perfectly prepared.<br>championes are very good<br>Pulpo a la plancha<br>The sangria<br><br>The mediocre- patatas bravas- covered in a spicy sauce. This is one dish cafe babareeba does better. <br><br>The worst ( ok not that bad)- the paella. maybe order it if you are a huge fan of paella in general, which I'm not. It's fine but the small plates are so good and the paella is sort of ho hum and needs a kick.", "pics": null}}, {"review": {"des": "I've been to this restaurant for years - and was always a place we looked forward to coming too. The last experience will be my last. The restaurant was fairly empty - just one other table - and thought service would be great. It was the complete opposite   The food was thrown on a plate and served to us and almost everything was unable to eat.  The patatas bravado's was the only decent item.  The octopus had a horrible foul smell to it and we couldn't eat it. The jabon iberico had pieces of meat that were grey and the chicken dish was just as bad. What happened here???  We were scared of getting sick and left the restaurant hungry.   We won't be coming back.", "pics": null}}, {"review": {"des": "I enjoyed Café Iberico. Per the recommendation of one of my favorite salespeople I decided to give it a try because it honestly wasn't on my radar. Two other things also contributed to my visit, I didn't want an extremely strong cocktail nor did I want a hefty meal. Today was extremely hot so a pitcher of cold sangria sounded real appetizing. The restaurant put ice cubes in your cup only & not the picture as to not dilute the sangria.  It was tasty, not to strong not to light. I felt sort of like a lush seeing as how I dined alone & had an entire half picture of sangria on my table but the guilt disappeared after my 2nd cup. The shrimp dish (Gambas al Ajillo) was kind of boring. There's flavor there but the dish lacked creativity in my humble opinion. It's honestly something I could've made at home. Now the Croquetas de Pollo was a different story altogether. Once the waiter explained that it was creamy I decided to indulge. Imagine if you will a better & lighter version of \"Chicken Cordon Bleu\". The aioli that came with was extremely thick however & if spread heavily could totally overpower the \"puffs\". This dish was great though. Prices are fair & aside from the annoying music in the bar area the ambiance was nice as well.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sOp0zv93K7zlhmb-Wbh41w/348s.jpg", "caption": "Half picture of white wine sangria"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Q-WoVlCfTcvr3LiK1EuB6g/168s.jpg", "caption": "Gambas al Ajillo"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-2R6dVuWKGWlSp5yS7v6Bg/168s.jpg", "caption": "Croquetas de Pollo"}]}}, {"review": {"des": "Great Sangria and tasty tapas! Nice place to celebrate a special occasion. Must try patatas bravas and champiñones.", "pics": null}}, {"review": {"des": "Environment 1/5: super noisy and dark. <br>Seafood paella 3/5: rice are too hard and the shrimp are not very fresh. <br>Spicy potato 3/5: spicy sauce is all of the top. Bottom ones taste very good. <br>Dates 3/5: the rice is too hard. <br>Seafood 4/5: fair. <br>Service 2/5: we tried to find the server but other staff just walk by and say it is none of their business. <br>Overall a very disappointing experience", "pics": null}}, {"review": {"des": "I came with a person of Spanish descent and was told this is a super authentic restaurant.  We probably ordered almost every tapas item on the menu and they were all great!<br><br>Funny enough, I thought many of the other dishes were better than the paella.  The paella dish could have included larger amounts of seafood, I've had massive dishes of paella in Barcelona before.<br><br>Many of the pictures posted are spot on of what to expect.  There are many small bite sized items on plates for sharing.  The meal was filling without being heavy and feeling bloated.<br><br>Service was pretty decent.  Drinks were very good also.", "pics": null}}]}