{"name": "cafe-vienna-chicago-2", "reviews": [{"review": {"des": "Absolute perfection is the only way to describe this place. <br><br>I found this cafe on yelp and I'm so glad I did. After an early flight I just wanted a good brunch and that's exactly what I got. I had multiple servers, all of which were extremely friendly and helpful. I decided to go to with the pretzel croissant breakfast with ham, onions, mixed peppers, spinach & Swiss cheese with a side of potatoes and black coffee. Way to much food but I'm not upset I get to eat it for two meals. For the amount of food it was priced well. <br><br>I sat at the bar at the window overlooking the street which kept me busy people watching while eating alone. Everyone's meals looked so good and they have baked goods in a display case that looked even better. I really don't think you could go wrong with anything you order. <br><br>If I lived in Chicago I would be a regular at the cafe.", "pics": null}}, {"review": {"des": "Good food, terrible service. We waited an hour for breakfast after being seated. Our toast came out 20 minutes before our food. When the food came out the order was totally wrong, very disappointing.<br> We then had to wait even longer for it to be corrected. People that came in after us had eaten and left before we were served. <br>Too bad.", "pics": null}}, {"review": {"des": "Love this place!<br><br>The people who work here are really nice, and the food is great for very reasonable prices.<br><br>The greek salad with chicken is very fresh & full of greek olives and feta + you can add chicken.  I really like the dressing.   <br><br>All of the sandwiches come with pickels and black olives (goes well with the tuna).  There's another chicken sandwich that I tried that I liked too - (herb marinated chicken). <br><br>The omelettes are fantastic.  The vegetables are very fresh and they will do egg-white only.<br><br>The \"pretzel croissant\" is an amazing invention. I've never seen it before but it's so good.  I tried the opera cake.  It's good but have to watch the calories on that one so I didn't have much.  It definitely has a strong coffee taste.<br><br>The only weird thing is the bread on the sandwiches can be dry - and it's odd because I think the place bakes it on site.  It's not always dry, but a couple times it was.  Not really often or a huge deal, just noticed a couple of times.", "pics": null}}, {"review": {"des": "This place is so cute and we had no intentions of finding ourselves inside. When we walked in, they have a pastry counter as well as seated dining. Their menu was extensive, and everything looked delicious. Unfortunately, we were on the go, which limited our options. I ordered the breakfast croissant. After a while of taking pictures of the croissant sandwich, I finally dove in. They loaded the breakfast sandwich up to the point where once I finally took out enough filling to fit the sandwich in my mouth, there was enough eggs, ham, onions, and mushrooms leftover for two more breakfasts. The croissant was so buttery and flaky, while still being thick enough that I could taste it on top of all the ingredients inside the sandwich. The eggs were delicious and paired well with the flavors of the ham, onions, and mushrooms. I would definitely go back and try the actual seated breakfast menu.", "pics": null}}, {"review": {"des": "I walk by this shop almost every day, and have been waiting for the perfect time to come in, ideally to sit for a few hours with my laptop and do some work. This week I finally got my chance, and Cafe Vienna didn't disappoint!<br><br>I *will* say that I thought this was solely a coffee shop for almost a full year, and was very surprised to see that Cafe Vienna featured a full menu and large dine-in tables. It was more of a breakfast, lunch, and dinner sit-down spot than a \"coffee shop,\" but they did have WiFi that my waiter was more than happy to provide the password for. After awhile, I noticed a few other people on their laptops as well, so I didn't feel like a jerk or anything, which was a relief!<br><br>I was seated at a nice little table opposite the entrance, and I ordered the Styrian Country Salad, which included deep fried chicken, beets, hard-boiled eggs, tomatoes, and balsamic vinaigrette. It was delicious and large and I'm very surprised I was able to finish it! To drink, I had an iced Americano, which was large and had a lot of caffeine. Just never enough caffeine for me, so I ordered two. :)<br><br>Cafe Vienna is a surprise in the best way, because it serves as a coffee shop where one can get work done, as well as a lunch spot for friends. The prices were reasonable for large portions, and the inside is comforting and spacious. I'm mad at myself for not trying it sooner!", "pics": null}}, {"review": {"des": "The cakes were not moist nor fresh tasting. I had to drive my fork kinda hard through them. <br><br>The poppy seed French toast was extremely sweet that I couldn't finish it. I got a sugar high from it. I would take that off the menu and experiment with a different bread. <br><br>The purple bread which they are known for was the best thing I've had that day and I loved it. <br><br>My guest ordered the skillet which was also amazing and addictive.", "pics": null}}, {"review": {"des": "Breakfast croissant was delicious! Tons of filling (eggs, meat, veggies, and cheese) and enough to bring home for leftovers! Such a great deal and you even get a coffee with it. Will definitely be back to try other menu options! Highly recommend!", "pics": null}}, {"review": {"des": "Stopped in here to celebrate our daughter's birthday.  She's been here before and highly recommended it.<br><br>We had a group of 4 of us and the wait was really long because there aren't a lot of 4+ top tables.  No complaint from us because we got a lot of time to visit standing in the doorway.  It was about an hour wait for a late Sunday morning breakfast.  The 2-tops came in and zoomed right in because they have nice seating on the window overlooking the street.  We wanted to visit in a table setting, so by-passed that opportunity.  We enjoyed some delicious coffee while waiting.  If you come in, make sure to walk up to the counter to put your name in.<br><br>The food was as incredible as we hoped.  The place bakes all of their own bread, pastries, and cakes, including the croissants. It was a no-brainer to order something with fresh bread.  I chose the Croissant \"Sandwich\".  Good luck picking it up!  It's a knife and for kind of sandwich, which was perfect for me.  You can pick any 4 ingredients from a ton of choices.  I had the \"Sausage\", \"Bacon\", \"Mixed Peppers\", and \"Cheddar Cheese\".  It was a tasty combination, but the chef forgot my bacon (The server did have it on the order, I saw on the check).  It was a bit cold, but still tasted great.  It is a huge portion; I finished all but about 4 bites.  I paired it with many large mugs of delicious coffee.<br><br>Our daugher had a huge breakfast.  She was intrigued by the poppyseed bread, so ordered a side order of that as an hor derve.  It was sweet and rich and very tasty, ribbons of copious amounts of poppyseeds.  She also ordered a side of scrambled eggs and a full order of french toast smothered in fruit.  It was perfect.  My wife ordered an omelette with spinach, fresh mushrooms, and feta, which was served with some nice dense bread.  She loved it as well.<br><br>Couldn't expect or want better service.  Everyone from the counter folks to the server to the others checking on the tables.  I love the vibe in this place, a lot of happy people, enjoying family and friend time.<br><br>Got the bill, and was surprised that the coffee was included in our meals.  The prices were awesome.  I wish this place was on the CTA line, because I could see we'd be able to meet her once in while if she came in from the City up to Lincoln park.<br><br>We will be back here many more times in the future!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/C6N0eo1OpWQCUo-qTBXdnQ/348s.jpg", "caption": "Croissant Egg Sandwich"}]}}, {"review": {"des": "We went here twice in one weekend! Got two different meals. The one in the photo was limited time only but it was amazing. Super good German sausage and spazel. I had the strawberry crepes and I wish I took a picture of them. Fresh cream and about a pound of giant strawberries. One of the best crepes I've ever had. The staff was friendly and kind, we even got some pastries to go. <br><br>It's a small place but both times we went it wasn't busy. Definitely going back!!", "pics": null}}, {"review": {"des": "solid breakfast spot. large menu with many options for everyone. i got the pretzel croissant special with no eggs, but all the veggies. it came with a regular coffee. it was simple, but healthy and filling. also, it was super affordable. i want to go back and get some loaves of bread!", "pics": null}}, {"review": {"des": "Might be my favorite new breakfast spot on Clark in Lincoln Park. Stumbled upon this place on Yelp and was at first hesitant to give it a try since the description said \"bakery\" and we weren't exactly in the mood for a sweets breakfast. But boy were we wrong, they have such a great breakfast menu, in addition to the bakery. The prices were super fair and service was very attentive the entire time (we probably got checked in on every 5 minutes, and we were even sitting outside while the inside was packed).<br><br>The Napoleon [8/10]: Extremely generous slice. The cream is very thick - I couldn't handle more than like 5 bites but it is very good. 2-3 people could easily share this.<br><br>Breakfast croissant [10/10]: Anytime a sandwich is so overloaded that the plate looks like a platter, the restaurant is doing something right. The croissant by itself is so good too. COMES WITH FREE COFFEE TOO.<br><br>3 egg omelette [10/10]: Just a massive omelette, can't believe it's made with only 3 eggs. I elected to get 3 meats - one of the best decisions of my life.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4V1Pk0NW46d7PMDmLEQvIg/348s.jpg", "caption": "Loaded breakfast croissant"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MAqwHbsrUAb8Fklx-wM88g/168s.jpg", "caption": "3 egg omelette and breakfast croissant"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/r09X7UrrbEWHKnGWys1GQg/168s.jpg", "caption": "The napoleon"}]}}, {"review": {"des": "It is a rare occasion when Yelp reviews steer me wrong, this time was one of them. Face palm. Major face palm. I was suckered into the yummy looking pictures and the marketing for Austrian bakery. <br><br>Upon walking in I glanced at the pastry selection. Midiocre. Nothing that Mariano's grocery store doesn't have. Also half of the case was already empty by 11am. However, we decided to stay because our second option was packed and we were starving. <br><br>I had the hot chocolate which was sub par and wasn't sweet and didn't have enough whipped cream. We shared an eggs benedict and the hollandaise sauce didn't taste homemade. This whole dish was lacking. Bacon was average. Should have ordered the croissant breakfast sandwich. <br><br>With so many more options in the area, Cafe Vienna is at the bottom of the tier on my personal list. Musty and humid, the ceiling fans didn't help in cooling down the restaurant. Defiantly a miss.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BQuS79-vn-YB9-ZLUPGlYg/168s.jpg", "caption": "Eggs Benny & Bacon"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NuPLBkndqZg8tD8FlnAuSw/168s.jpg", "caption": "Hot Chocolate"}]}}, {"review": {"des": "This just turned into my favorite sweet shoppe of the moment. I stopped in for a dessert. They were just introducing a new cake, the Suzy. It's a vanilla layer cake with raspberry cream filling. I gave it a try and it was superb -- moist, perfectly sweet and tasting of fresh raspberries. The coffee was also good, and refilled at just the right moment. Can't wait to try the full line of cakes, pastries and breads!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wxoSU_ZMBUEW4QZcx6VW7A/348s.jpg", "caption": "Suzy cake"}]}}, {"review": {"des": "I live right down the street, but it's taken me a while to come try this place out. I have no idea why! I came here for breakfast, and there were so many options. I ended up choosing the fiesta skillet with multigrain bread. First off, the bread was so good I wanted more! I think they make the bread in house. The skillet itself was good, with lots of flavor, potatoes, and bratwurst. I will say there was A LOT of cheese on it though, but just ended up pushing it to the side. <br>The place itself is small, with the majority of seating being long tables in the middle of the room, and about 4 tables outside. We didn't have a wait though when we came on a Sunday morning!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qAgghjiUdTroH7iMjSPsFQ/348s.jpg", "caption": "Fiesta skillet"}]}}, {"review": {"des": "Charming European cafe/bakery in Lincoln Park with a comfortable feel and friendly staff. I some out-of-town family here for a weekend breakfast, and they were pleased by the food and the ambiance. I can personally vouch for the Fresh and Fluffy Waffle - it was amazing. The Housemade Hot Chocolate was the best my brother had ever tasted.<br><br>I really like this place. Great location - great value - great vibe. Highly recommended.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oW-RAm27EPm-W3qxztYt8g/168s.jpg", "caption": "Housemade Hot Chocolate"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-l6bhFMmmn4ViOdhwoktBA/168s.jpg", "caption": "The Fresh And Fluffy"}]}}, {"review": {"des": "All I can say is WOW! What a great place for breakfast or Lunch! The Breads, The Omelets, The Sausage dishes! Again WOW! And I just began the list,Pastries, Crepes Etc. Etc.If you don't try this great place your missing a wonderful food experience! And Yes the Salads are fantastic! And make things better our Server/ Manager \" The Great SUSAN\" was one of the nicest young people I have come to meet,personable,polite, sweet just a wonderful person!<br><br>And Yes Susan as you said, \"we will be back\" We want to try the whole menu of Delights!<br><br>Regards, Karlina & Alex", "pics": null}}, {"review": {"des": "Okay, these breakfast croissants are ridiculous. In the best possible way.<br><br>The baked goods here looked great, but I came here exclusively for a breakfast \"sandwich\". When you go up to the counter, there is no menu or anything, which I found odd. However, if you ask, they do have menus printed for you to take a look at.<br><br>I asked what was recommended, and without hesitation I was told to get a sandwich, but was warned that it's more of a fork & knife kind of meal. Challenge accepted! You get to pick scrambled eggs with any 4 other ingredients that you want, then you choose what croissant you'd like. Naturally, I went with the pretzel croissant. It's insanely cheap, which doesn't make sense to me. All of that plus bottomless Intelligentsia coffee is $8. For real.<br><br>I grabbed my coffee and took a seat, and I kid you not, about 2 minutes later they brought my food out. I don't know exactly how long it actually was, but it was fast enough that I legitimately thought they brought me somebody else's food. But the fast service takes nothing away from the quality- it was ridiculously good. The fork & knife thing was a wise suggestion. I did eat it as a sandwich, but only after I pushed a ton of the scramble to the side to eat after the croissant. I mean, just click through some of the photos to see what these things looks like.<br><br>You will not leave hungry, that's for sure!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SIRwAaSgRHBVElyK48Wx0A/348s.jpg", "caption": "Needs no explanation."}]}}, {"review": {"des": "This place is mediocre. The portions are large, and their croissant egg sandwiches are okay, but what's up with those butter potatoes? I guess I should explain...<br><br>Potatoes - 1/5<br>Can I have some potatoes with that butter? All I tasted was butter. It was disgusting. I love potatoes in any form, but I did not like these at all. Try roasting with a bit of oil and salt and herbs? Geeeeez, my heart hurts thinking about it.<br><br>Croissant sandwich - 3/5<br>Mediocre. A lot of food, but under seasoned and nothing special. It's just that places like Wildberry exists! You can choose I think 3 of the listed toppings, and it costs extra after that. I don't remember the price, but I do remember that it was reasonable.<br><br>If you're in a pinch, this place will work, but if you want somewhere delish to go, I'd just go somewhere else.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DAWKAi951WObQGllQNSFaA/348s.jpg", "caption": "Butter with potatoes.. ugh"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QUj6Swq18p5SllcGZTNang/168s.jpg", "caption": "Yet another croissant egg sandwich"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TsYWxippVXZOQjh1wPFBhg/168s.jpg", "caption": "Another croissant egg sandwich"}]}}, {"review": {"des": "Such a great spot with authentic Viennese food! I got the croissant breakfast sandwich and it was huge. You definitely get your dollars worth in food. The portions were huge. We were a bit slow to be waited on. We had to call over our waiter after waiting quite a bit. Other than that it was a lovely experience. I went for brunch with 6 friends and everyone enjoyed their meals.", "pics": null}}, {"review": {"des": "I'm so confused that this place has such positive reviews. I've wanted to like it so badly that I gave it three tries. I was desperate to like it because I heard good things and because there are so few good sandwich/salad spots in the neighborhood. So I went three times for lunch, and each time was worse than the next.<br><br>For starters, the service is unbelievably slow. They usually only have one waiter for the entire cafe. I feel bad for the guy because he's really nice (I think he's been my waiter every time) but it takes forever to get your food ordered and forever for your food to come.<br><br>The tables are sticky and gross. The place looks like it hasn't been cleaned or redecorated in decades. <br><br>The bread is awful-- and this is a place that's supposed to be known for its bread. It tastes so stale and dry. I have a very hard time believing that they bake it fresh. Again, I've given this place THREE tries over the course of the year and it was stale and dry each time. <br><br>My sisters chicken sandwich was so dry and rubbery that she sent it back. They took it off the bill and offered free dessert. I do appreciate that at least. We declined dessert because we were already running behind from waiting so long for food.<br><br>Definitely not coming back and wouldn't recommend to anyone. I want them to do better-- the neighborhood desperately needs a good lunch cafe.", "pics": null}}, {"review": {"des": "Nice Austrian/German Cafe with a variety of traditional cakes and strudels. Breakfast and Luncg options. The food was very good and fresh, the cakes are amazing!", "pics": null}}, {"review": {"des": "First time here.  Our daughter recommended for us to give it a try.<br><br>My wife, our son, and I dined in.<br><br>Walking in we noticed right away the delicious looking treats behind the glass display area.<br>Everything looked awesome. <br><br>We're seated right away by Susan, our wait person.<br><br>After looking through the menu, we ordered a couple of breakfast croissant sandwiches and a 3 egg omelet.<br><br>Our food's delicious.  Nothing fancy.  Not even a piece of parsley to make the plate look good.<br>The price was reasonable too for breakfast.<br><br>We ordered some Paczki's to go.  Haven't tasted 'em but we will...  soon!<br><br>I'd go back there again.  The food's good.  The price is reasonable.  Susan's great!  She's attentive to us and she remember our daughter.   <br><br>Thank you, Susan!", "pics": null}}, {"review": {"des": "Plum cake?!!  Yum!   Great hot breakfasts, don't be in a rush, relax.   Get something for later..", "pics": null}}, {"review": {"des": "I absolutely did not like this place. Don't be fooled. This place is packed because it is tiny. The tables are so close to each other. If you got a middle table, you literally have to move the table so you can sit on the other side. This place is a fire hazard.<br><br>I ordered the Styrian. It came with my.chouce of homemade Austrian bread. I chose the pretzel. The pretzel wasn't warm and I wasn't really dying over it. I also chose the German smoked meat. Oh my gosh! It was the saltiest thing I have ever tasted. I had to skip the meat and just eat the three sunny-side up eggs.<br><br>I was so disappointed. That entire day, I was so thirsty. I had to flush out all the salt in my body. And the fact I paid $11.00 (tax included) just to eat a cold pretzel and three eggs really annoyed me. This experience was not worth it for me.", "pics": null}}, {"review": {"des": "Had lunch with a friend today. It's so cozy in here. I was super surprise to see how busy it was on a mid day Friday. We sat at a communal table. <br><br>Started off with coffee, I ordered a cappuccino and my friend ordered the white chocolate mocha. Both were made very well. Their dessert display looked so delectable. I wish I had room at the end to get something. <br><br>I ordered the fiesta scramble, what a huge portion! I'd recommend it. My friend ordered the chicken and Pesto panini. She was really happy with her choice. <br><br>It was a good standard cafe. I am giving it an extra star because I like that the prices are cheap!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/98PLdweOzZUuXYqLiyBWaA/348s.jpg", "caption": "Fiesta scramble"}]}}, {"review": {"des": "Best dirty chai latte in chicago. Their baked goods are also amazing. It isn't a huge place so you may need to wait for a seat but it is worth the wait.", "pics": null}}, {"review": {"des": "I came here with a friend during midday between lunch and dinner and missed the breakfast items.  I think they're known more for breakfast and their bakery items.  We ordered the chicken schnitzel sandwich and a side of spatzle Mac n cheese.  I think the overwhelming concensus was that everything was very bland.  The chicken was cooked well, but didn't come with the mustard as described and really didn't have any taste.  Same as with the spatzle.  It was cheesy but really needed salt and pepper.  We finished off with the apple strudel with whipped cream.  The strudel was delicious and was definitely the highlight of the meal.  Definitely recommend the dessert and pastries here, and would consider coming back and trying their breakfast items.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QOCrDFiPX33W6VJ-S6f3IQ/348s.jpg", "caption": "Apple streudal"}]}}, {"review": {"des": "I love this place.  I came yesterday after not having been in a few years.  I used to get sandwiches on croissants all the time but opted for the turkey panini yesterday.  The staff is super nice and accommodating; my friend really wanted Sultan's next door and they still let us sit outside on their patio which I thought was really nice.  I've never had their baked good items but I've always wanted to.  Highly recommended!", "pics": null}}, {"review": {"des": "\"I feel at home.\" - is the atmosphere of this home-y little cafe. <br><br>FYI- they are only open Thurs-Sun!!!!<br>FYI- serve brunch, lunch, dinner <br><br>B R U N C H <br>Their brunch menu includes your traditional omelettes, croissant sandwiches, breakfast sandwiches. (Which I have yet to try but def sounds appetizing!)  <br><br>* L U N C H // D I N N E R <br>Can you say YUM?!<br>From soups to salads, to salad/soup combos, soup/salad combos, Austrian entrees, YOU WILL LEAVE WITH A FULL GRATEFUL TUMMY.<br><br>+ Schnitzel Sandwich (5/5) deep fried chicken sandwich is so good! Is a must try !<br><br>+ roast beef sandwich (5/5) - their horseradish sauce is ON POINT. Just scrumptious! This sandwich is a meat-lovers dream. <br><br>+ Berry Nutty Salad (5/5) my personal go-to salad because it's so healthy light. They also give you huge portions so I always save half for another time. <br><br>+ Chicken Noodle Soup (3/5) too salty for me but it had all the components you need in a chicken noodle soup? Hah. <br><br>*B A K E R Y<br>So many options- <br>1) sell LOAVES of bread <br>2) pies <br>3) cakes <br>Basically sweet tooth galore! <br><br>I only tried their * BIG EAR (5/5) which is a flaky pastry covered in sugar. It was as big as my face and they also have the option to have 1/2 dipped in chocolate.... I obviously passed.... girl is trying to get her body ready for summer in CHI-CITY! <br><br>Winter please go away, but I guess the food here will keep me warm on the inside until then.", "pics": null}}, {"review": {"des": "Earlier today I bought a Topfenstrudel. I have never been more disappointed. It was old, dry, and hard. <br>Disgusting!!<br>This is fraud. Nobody should be able to sell this. I hope I don't get sick from the two bites I had. <br>Just revolting. <br>Will NEVER go there again!", "pics": null}}, {"review": {"des": "What a gem this place is!<br>With a showcase of beautiful pastries and breads as you walk in, you're greeted and asked if you would like to be seated (see what I did there?). So you have the option to dine in or quickly order yummy goodies to take back home to your fam bam or eat ravenously like I would. <br><br>This visit, I chose to stay in. I ordered a three egg omelet filled with veggies and feta and sausage if I remember correctly. It came with a large side of potatoes and filled the plate completely. For only $8! I'm pretty sure we weren't charged for coffee either. Something tells me that they offer free coffee for any food item you purchase. Win! I also eyed the French toast that the person next to me (they have some community style tables so be prepared). The French toast was packed with beautiful fruit and had thick pieces of bread. Looked deeeeelish!<br><br>For less than $20 we got two meals, two coffees and delicious homemade bread. Total steal and worth the deal (I did it again!)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2PQIiDUtiScabfY5fg2O7Q/348s.jpg", "caption": "Three egg omelette with tomato, mushroom and feta. Very yummy!"}]}}, {"review": {"des": "Great paczkis!! Glad I was able to make it down there to get an order....tried all but apricot and fudge. Not sure if my favorite was the strawberries and cream or the special so had to eat two of each!", "pics": null}}, {"review": {"des": "This place is busy for good reasons! Great pastry sweet options as well as fine in breakfast and lunch entree options!<br><br>We ordered the Croissant Sandwich and the Chorizo Skillet. The Croissant was so fluffy and paired well with all of the fresh ingredients that were offered to be picked from. The options and combinations are endless! The Chorizo Skillet was just as delicious! The Chorizo was not overly greasy and salty. The salsa that came with it on the side made the whole dish even more flavorful. I could have eaten a whole bowl of it. <br><br>We really enjoyed the atmosphere and all of the serves and bussers were friendly.<br>The lunch entrees looked phenomenal as well and we will definitely have to come back to try those as well as their amazing cakes and pastries!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ylL944FkJjecXwmB8TsCHw/168s.jpg", "caption": "Chorizo Skillet"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tB3nmB0tJBHyREokJXmjzA/168s.jpg", "caption": "Croissant Sandwich-amazing"}]}}, {"review": {"des": "I actually shouldn't be yelping about how great this place it! It's definitely a hidden gem in the neighborhood! I used to live of deming and would go more frequently but end the other day and it was just how I remembered it! I always get the Austrian (picture below) it's 2 eggs toast and coffee for $5!! Their bread is made there and delicious!!! It is a small place and on the weekends can be busy and there can be a wait. Also there are bigger community tables so there is a chance you might sit with others. All of the food is fantastic and good po", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8MwiUEPIEZVsz6kZGagVAQ/348s.jpg", "caption": "The Austrian! $5.99 for this new :)"}]}}, {"review": {"des": "Unimpressive. I sat at the window counter which was dirty with old food crumbs and spill stains. I ordered the breakfast combo with 'fluffy' pancakes and eggs. Now maybe I was wrong for ordering an American breakfast at an Austrian themed cafe, but I didn't expect the pancakes to be inedible. I couldn't cut a piece to eat without it disintegrating. When I finally got some in mouth the texture was very odd--almost like raw dough but dry at the same time. The scrambled eggs were over cooked to the point of being brown.<br><br>The service also wasn't great. I waited more than 10 mins to have my order taken, and the restaurant wasn't that full. I waited another 15 for them to clear my plate and got fed up and headed to the front to pay. No questions were asked about my uneaten pancakes.", "pics": null}}, {"review": {"des": "This place gets 1 Star only because they had decent breakfast potatoes. Not sure how this place got so many yelp reviews with an average of 4 stars. <br>Cons:<br>* THERE IS NO BATHROOM. How the heck does a sit down dining establishment not have a restroom? Call me crazy but I like to wash my hands before I eat. <br><br>* Service was slow...and we were there at 1:20pm on a Thursday. Want a refill on some lackluster coffee good luck. But maybe they don't give coffee refills because there is no bathroom?<br><br>* A place that serves breakfast and lunch SHOULD know how to make toast. We had warm (at best) toast with our eggs...sigh...the toast wasn't even warm enough to spread butter on<br><br>Pros:<br>* There is a Starbucks next store to get some decent coffee<br><br>* Molly's cupcakes is across the street so you can grab a sweet treat because you will still be hungry when you leave here.<br><br>Summary: <br>Save your money there are other options in the area.", "pics": null}}, {"review": {"des": "Oh man, I really, really wanted to love this place.<br>I came here for breakfast with a friend and was a little early so I looked around and saw all these amazing pastries and cakes and I knew that I would have to take one home after breakfast.<br><br>However: breakfast happened and I changed my mind.<br><br>We sat down and waited a good 20 minutes for a server to even acknowledge us. We ordered coffee, the vienna breakfast (2 eggs, ham and swiss cheese) and the fiesta skillet. In my opinion nothing that would require a lot of time or effort.<br>After about 10min we got the bread basket that comes with both orders, and we started eating the bread assuming that the rest would follow shortly after. <br>30min later we received 1(!) of the two coffees, and we asked 5 times for the other one which we ended up receiving after a full hour of waiting. <br>The food actually came an hour later, by which we had eaten all the bread and I asked for another slice to have with the ham & cheese. I should have known that I would wait another 30min, so when the bread finally came I gave up. <br><br>It was a full 2 hours for the easiest breakfast in the world, and I wish I could have shown my friend a good example of German/ Austrian food, but it was a complete letdown.", "pics": null}}, {"review": {"des": "Went to this place mid morning and it wasn't too crowded. They have an expansive breakfast and lunch menu. I decided on a vanilla latte and a salad with tomatoes added. I got the \"latte\" pretty quickly and it wasn't a latte and there definitely wasn't any vanilla. I got the salad which is HUGE but no tomatoes. I asked for tomatoes again and got a small plate of whole cherry tomatoes. Fine, fine. I also got a butter croissant which was fabulous and a must-try. Additionally we got a BLT, pretzel and bowl of cream of mushroom soup. I tried everything with the exception of the BLT and it was great. The BLT also looked delicious and had a lot of bacon. The waitress was attentive and super friendly and convinced us to get a house-made dessert. Definitely a place I'll return to and try other things but I won't be getting a latte.", "pics": null}}, {"review": {"des": "Here on my second day in Chicago and I'm making my second trip to Cafe Vienna. I am loyal to good breakfast and this is one of the best I've had in a while. Of particular interest to me- soft boiled eggs! A lot of restaurants won't make them for you and these are wonderful. Service is great, ambience is lovely and all the food is great. Best breakfast in the neighborhood.", "pics": null}}, {"review": {"des": "Fantastic breakfast place. The Fiesta skillet was excellent! Service was very friendly. We knew it was going to be a good place when we saw the staff preparing all of the carry out/ delivery orders, as this is clearly a favorite place of locals. The bakery items looked phenomenal; I wish I would have saved room to try them. Would definitely return if I'm ever back near Lincoln Park!", "pics": null}}, {"review": {"des": "Horrible service. So slow, no one checks on you. Then the food comes after waiting so long, and it is bad.", "pics": null}}, {"review": {"des": "I love this place. Food is delicious . Bread with poppy seeds definitely my favourite. Cool spot for breakfast and lunch. Only problem is the wait time on busy weekend days but It's worth it.", "pics": null}}, {"review": {"des": "I love Cafe Vienna.. but I am not a breakfast person and have never tried their breakfast. I love their tuna salad sandwich and all their soups are amazing. You can get the combo with the sandwich and a soup and it's under 10$ and is so much food! I just noticed they aren't opened as late in the evening anymore.. bummer.. maybe they will stay open later now that it's fall and people are soup hungry!! Highly recommend!! I always do take out but the restaurant is very cute to dine in.<br><br>Oh, also I've bought their loaves of bread before because really no other option for fresh bread and the area and it was great!!", "pics": null}}, {"review": {"des": "Neat place enjoyed our visit the other day. Service great and selection very good. Had a crepe and coffee. Lots of sweet treats for breakfast. Will return.", "pics": null}}, {"review": {"des": "This cafe was much better before it was sold.. the bread is never freshly baked even though they claim it is. I've switched to Mariano's on Broadway for my bakery needs.", "pics": null}}, {"review": {"des": "My go to for all sorts of coffee pastries and foods needs. The staff is friendly. They have the illy coffees. A little tip the cakes are half off on Tuesday after 5pm.", "pics": null}}, {"review": {"des": "Amazing croissants and overall service! This my go to breakfast place in Lincoln Park!", "pics": null}}, {"review": {"des": "I came here for Sunday afternoon coffee. This place is nestled in the heart of Lincoln Park, right next to Sultan's Market. I found street parking rather easily (hooray!) and walked over. It was popping and you could tell that the really serve hearty breakfast food. However, I came here strictly for the sweets and coffee. I tried two cakes, the triple chocolate cake and esterhazy torte and ordered two cappuccinos. The server was extremely friendly and said that he would bring out the cakes and coffee to us. There is a cute outdoor patio and we sat on the table closest to the right. The only problem with sitting there is that when the bus stops, the smoke from the buses exhaust is in your face because there is a bus stop on the corner of that block. My suggestion would be to sit to the table closest to the left. Anyways, our desserts arrived immediately but they were melting as we waited for our coffee. I went inside to see if the server forgot about us and he said the coffee machine needed to be turned off and they're waiting for it to \"heat up\" but that he would give me a discount for the inconvenience. I appreciated his sincerity. Three minutes later, the coffee arrived. The coffee was worth the wait, it was really good and rich in flavor. The cake however, it was not the best cake I've ever had. The thing is, I'm sure it's a great cake but both cakes were a little stale and it was apparent by the stiffness of the layers. I don't think that the cake was necessarily old- I think sometimes when the cake pieces are cut in advance and displayed and you're constantly opening up the door of the display, of course the cakes will dry out. I think the display area where the cakes are stored in could be faulty or it's not doing a great job preserving the quality of the cake because there is no way that two cakes could be stale from not being sold considering how packed the place was. I would go back to try some of the other items on the menu!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pIRakmoZ6nzkACtN4PlodQ/168s.jpg", "caption": "Esterhazy torte"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dbNe8I0hWweeYGedncdU3g/168s.jpg", "caption": "Triple chocolate cake and esterhazy torte with two cappuccinos"}]}}, {"review": {"des": "Stopped here for breakfast and got pancakes and a side of chicken and apple sausage. It was really good! The place is cute with indoor and outdoor seating which is ideal on a perfect summer morning. My friend got the continental breakfast with their homemade dark rye bread (so yummy). We will probably be purchasing their bread to take home from here on out! Will definitely come back!", "pics": null}}, {"review": {"des": "Cutest spot for breakfast and lunch! Tons of options. Fresh squeezed orange juice, and coffee and teas are ALL amazing. Soups delicious and tasty. We've taken it to go and eaten inside both great options. Pastry case is so good too. Can't wait to try more.", "pics": null}}, {"review": {"des": "9/15/17 Got 1/2 an Apple Strudel, a big ear, (with chocolate), two (each) cherry and apple turnovers (very recommended). Very busy in here so I got it to go employees are very helpful.", "pics": null}}, {"review": {"des": "Best. Brunch. Ever.<br><br>Amazing food. Great prices. Nice/Helpful staff.<br><br>The wait can be long, but it's definitely worth it! I got the croissant sandwich, which was bomb. Make sure you grab some pastries on your way out.<br><br>OH AND POPPY SEED BREAD. WOWZERS. <br><br>Just do it and then go play with some puppies at pocket puppies next door. Why do drugs when you can eat bread and play with puppies?", "pics": null}}, {"review": {"des": "4/22 was 'Take It Slow Saturday' so <br>to start my day, I walked to Cafe Vienna to try a pastry- there was a line out the door (which I always like), so I decided to get my pastry to-go.<br><br>There were So Many choices, I must have changed my mind five or six times before settling on the Cheese Pocket. The cheese was rich and creamy (cow), folded into a danish and dusted with powdered sugar. It was soft, sweet, and delicate. <br><br>Looking at the menu, I also decided to try the Austrian sandwich. The meats (German, Hungarian, and Genoa salami) were all new to me and I left the styrian housemade dressing on the sandwich instead of getting it on the side. I'm glad I did because by the time I arrived home, the dressing had started to soak into the rye bread and blend with the provolone cheese, adding some creaminess to enhance the smoky notes of the salami. Included was an ample garnish of pickles and black olives- I ate every single one of them.<br><br>While I was waiting for my order, one of the counter workers very graciously gave me a large freshly squeezed orange juice for my birthday- one sip and I was instantly transported to an orange orchard. This was a kind gesture I will remember every time I go back to try more pastries and dishes.<br><br>------------<br><br>Came in another day for some more treats to take home:<br><br>The Mini Cookies are purchased by the pound, so I decided to try two of each kind-<br><br>The rainbow sprinkle was a basic cookie and didn't have much flavor, so it was my least favorite.<br><br>The hazelnut cookie has a dollop of hazelnuts on top, adding a satisfying crunch in bite sized form.<br><br>The caramel pecan sandwich cookies were firm on the outside and soft in the middle, creating a rich balance of yumminess.<br><br>I have never tried a Pertikus before coming here, and I was not disappointed after trying them. These Austrian butter cookies have a unique flavor to them and I found I enjoyed the white chocolate dipped ones better, so I'll definitely get more of them!<br><br>I thought I was finished purchasing cookies, but then I saw the Macadamia Nut & Red Velvet Macadamia Nut....couldn't decide...so I got them both. Fantastic as is, even Better warmed up for a few seconds! There is no such thing as too many macadamia nuts, and these cookies prove it!<br><br>I'm glad the Elephant Ear dipped in Chocolate was only partly dipped because I actually liked the non-chocolate side better. This pastry comes with a non dipped option, so I'll buy that one in the future.<br><br>Everything about the German chocolate cake was outstanding- the ratio of frosting to cake, the firmness of the slice, the coconut creaminess in the frosting, and the crunchiness of the pecans- delectable!<br><br>The Cherry/Cheese strudel was tart, flavorful, and the sugar crusted pastry was crisp and delicate. <br><br>Hot Chocolate- I asked for whole milk, yet when I received it the flavors and texture were really non-existent. The barista told me they melt chocolate chips into the milk, so maybe she just didn't use enough chips...", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tYrSFuLvaoJ5npHwqBKeRA/348s.jpg", "caption": "Hot Chocolate with whole milk- :/"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/H67d8LuG-_6l6l07e7qw6g/168s.jpg", "caption": "Cherry Custard Strudel"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Q_lBLFfa7koyxDIZnI--eg/168s.jpg", "caption": "German Chocolate Cake"}]}}, {"review": {"des": "YUM!! I used to come here many years ago then moved out of the area... recently came back and they are now under new management - with great results! The new owner was so nice and we were able to enjoy a wonderful Chicago summer night at one of their outdoor tables. The food was great with huge portions. I had the schnitzel with spaetzle and a side salad with german chocolate cake for dessert (shared!). All were delicious and I would order again. Also had a cafe mocha which came with a cute chocolate heart on top. I can't wait to come back and try their new breakfast offerings.", "pics": null}}, {"review": {"des": "Amazing bakery and cafe hidden away on Clark Street in Lincoln Park!<br><br>Popped into Cafe Vienna on Sunday morning with my gf around 11 am. You seat yourself and then waitstaff will come around to take your order. I had a hard time peeling my eyes away from the display cases up front, which had the most amazing looking cakes, croissants, strudels, cookies, you name it!<br><br>Menu has everything under the sun on it. We both went for the croissant sandwich which comes with up to 4 ingredients of your choosing plus a cup of coffee. We also split an order of french toast because it was $3.99!! Portions are huge even with the friendly price tags. I had andouille sausage, mixed peppers, tomato and cheddar on mine- sooo good. French toast was very light and hit the (sweet) spot.<br><br>Staff was incredibly welcoming and friendly as well. I really wanted to try some cake but I didn't have any room :( I will most definitely be back!!", "pics": null}}, {"review": {"des": "I wanted to branch out for breakfast while my brother was in town visiting and this place was perfect! So many pastries and breads that are all made fresh in house daily. Huge portions and great prices! Both of us really enjoyed our breakfasts choices. I had eggs and bacon and pancakes- all amazing! And he had the crossing breakfast sandwich that was HUGE! On top of all of that, great coffee and service! Highly recommend!", "pics": null}}, {"review": {"des": "They dont like people coming with their toddlers. So think twice if you want to go with your kids at a busy time.", "pics": null}}, {"review": {"des": "Excellent food and coffee selection! Their baked goods, especially the bread, are delicious. Cozy and unassuming neighborhood cafe that took me by surprise and is now my favorite coffee place when i'm in the area. You can get pastries or a full breakfast/ lunch and all meals are served with some of the homemade bread.", "pics": null}}, {"review": {"des": "While the place it getting a bit long in the tooth, the pastries and coffees are as authentic and high quality as ever. Their offerings compare well with what we have seen in our years throughout Austria, Germany and neighboring countries. Our favorites are the Bienenstich (filled with a rich vanilla cream and topped with that famous almond honey crust) and, of course, the Sachertorte - that renown creation by Vienna's Hotel Sacher that must have started the chocolate layer cake popularity.<br>      Their coffees are first rate and they are flexible in preparing whatever your heart desires. Very friendly and knowledgeable staff.<br>CB", "pics": null}}, {"review": {"des": "Came here for the first time on a Sunday morning around 10:30AM for brunch. Only a 5 minute wait, and I spent most of that time marveling at the delicious looking pastries in the refridgerated case. <br><br>I got the croissant (pretzel or butter) sandwich which had very generous portions. I love that you could pick whatever 4 ingredients to be scrambled into the eggs. It also comes with free coffee which was a nice surprise. Ended up only eating a quarter of it before I was full.<br><br>Boyfriend got the continental which came with freshly-squeezed orange juice. We also ordered a belgian waffle to share. The continental was just your basics - two eggs, two sausages, potatoes, and your choice of bread (he went with pretzel). The pretzel bread was good. Only wished it was warm. <br><br>The food was good for the price, especially in the area. Because the restaurant seems to be smaller and older, there were a couple of gnats flying around and there wasn't much AC for a 90 degree day in July.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ebggxmw_T_Mkr6NpdF5DoA/348s.jpg", "caption": "Huge croissant sandwich - comes with free coffee for a very reasonable price."}]}}, {"review": {"des": "Everything on the menu is delicious. They have a number of pretty authentic Austrian dishes so I highly recommend you take advantage of this local gem.", "pics": null}}, {"review": {"des": "This is my go-to breakfast place. Great food, quick service, and reasonable prices. It never disappoints. I usually get the croissant omelet deal with the coffee. It's HUGE and delicious and I love that coffee is included in the meal. I highly recommend Cafe Vienna!", "pics": null}}, {"review": {"des": "Absolutely loved this place! The staff was so friendly and it brings me back to living abroad. Highly recommend. The prices were very affordable. Coffee is included in the price for the entree and also the food was amazing!!!! Might be my new favorite hidden gem", "pics": null}}, {"review": {"des": "LOVED their pastries! This place is a must try! Their cinnamon roll and paninis per perfect!! Can't wait to go back.", "pics": null}}, {"review": {"des": "This cafe has one of the best breakfast menus I've had in Chicago. Incredible variety and choices with fresh Viennese bakery items. Every friend I have brought here concurs!! Great place on the way to a Cubs game! Just love it!", "pics": null}}, {"review": {"des": "I am a very generous star giver. Food was amazing as well as coffee, but it wasn't all too busy and I had to go up to the register to get a menu...<br><br>After that, the service was awesome. I read the menu and noticed the breakfast items were only served until 3pm. I then randomly asked if we can squeeze in an order since it was 3:02, surprisingly the waitress said breakfast was being served until 5PM! That made my day!!!! <br><br>I walked down LSD today since it was so nice (40 degrees doesn't sound so nice but compared to the crazy bitter January weather, it was a heat wave!) I was gonna go to protein bar for a quick salad, but decided to explore another brunch spot. Saw this I help and am so happy this popped up because I have walked past this place and had no idea about it. <br><br>The was a pastry bar and bread bar in the front of the store and I couldn't stop staring at it as I sat down a table overlooking the glass with pastries. I wish I saved room for it, but will definitely come back.<br><br>Since I wanted something savory and filling I went for what seemed popular at this spot, breakfast sandwich! You are able to choose between a pretzel croissant or a buttered croissant. I went with a buttered croissant and you get to pick 4 items between the meats, veggies, and cheeses. May I add how generous they are with their portions!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sf39aXXaPmamG8i9fC1x2A/348s.jpg", "caption": "breakfast sandwich : buttered croissant with chicken apple sausage, tomatoes, onions, and spinach!!! also comes with free coffee!"}]}}, {"review": {"des": "I really need to come here for a sit-down and stay a while meal. For now all my stops have been for the bakery item to go. They don't have a huge selection, but what they do have they do very well. Each time I've been here service is friendly, fast and informative.<br><br>I've decided to cut down on sugar and processed foods, so desserts are no longer a part of my daily diet, it's more of a once or every other week treat now, and my new term is \"dessert worthy\" sort of like Seinfeld's \"sponge worthy\" while at first glance this might sound cruel, it's really not, after all whether it's dessert or what you'd use those sponges for, better make it count.<br><br>Today, I picked up a slightly different version of apple strudel, which they had there too, and I should have noted the name, apple something that started with a \"W\" the thing that was great about this selection, is that it had a lot of tart apples in a phyllo type dough, what it didn't have was a lot of gooey sugary sauce or added sugar anything. If you like apples, this one is for you. <br><br>I will sure to make it back, definately reminds me of cafes in Europe.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/T3xZnLqzk8jE-dgI3xjGAg/348s.jpg", "caption": "Buy one, get one free prior to closing."}]}}, {"review": {"des": "Overall: Great spot for a casual breakfast for a small party, with plenty of savory and sweet options.<br><br>The good: The food is great. Plenty of great bakery options, but the savory items are great as well. Croissant sandwich was huge and great. Very reasonably priced. <br><br>The bad: Service was average. We had to wait awhile (once we got seats) for our waitress and then they were slow throughout for refills, check, etc. The seating is limited.<br><br>Atmosphere: 7.5/10<br>Service: 7/10<br>Food: 8.5/10", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NpY6I2AhCBRhB_1-SqHOpw/348s.jpg", "caption": "Dat crossiant sandwich"}]}}, {"review": {"des": "The manager was very rude. I went it before a doctor's appointment to see if i could grab something quick but since it was made to order i decided to come back after the appt since the food looked good. When i came back, the manager was very rude. When i was confused about which eggs to get and asked a question about the bratwurst, her response was curt and rude rather than helpful. She was very off-putting and dismissive, which is not a good way for a manager of a restaurant to attract customers. I left without ordering anything and she didn't even apologize.", "pics": null}}, {"review": {"des": "Amazing and authentic cafe. Great food for lunches or breakfast and amazing bakery. The staff is also very polite and knowledgeable.", "pics": null}}, {"review": {"des": "Had coffee and a pasterie coffee good pasterie  seemed old. Will not return very disappointed.", "pics": null}}, {"review": {"des": "The food here is decent.  We live around the block so we come often even though we always leave a bit disappointed.  Today, however, I had a terrible customer experience as the waiter got our order wrong and brought 2 sides that we did not order and forgot one side we did order (we didn't really even want any sides but they come with the meals).  Wouldn't have been a big deal, but since my boyfriend absentmindedly ate some of the unordered food they brought she refused to take it off the bill.  I found this to be absolutely ridiculous.  You cannot bring unordered food and then insist upon charging, especially since what we ordered should have been all included. How about apologize for the mistake instead.  She was confrontational and rude while doing it as well.  Will not be back.", "pics": null}}, {"review": {"des": "Great breakfast spot. Food is nothing that blew me away but this is a perfect spot for a quality breakfast. Can sit inside or outside and staff is attentive and friendly.  Eggs Benedict was tasty", "pics": null}}, {"review": {"des": "I love their breakfast menu! I highly suggest ordering the croissant sandwich. It's HUGE and comes with coffee. I've also tried the pancakes and those were nice and hardy. <br><br>Prepare to wait to be seated for 10 minutes or more if you come in for brunch on the weekend. Wait staff here is friendly, however service can be slow when they're busy.<br><br>My only complaint is the blueberry muffin I ordered to-go. It was very dry and underwhelming. Hopefully it was just an off day. Nevertheless, this is an overall great little place to get breakfast at a reasonable price!", "pics": null}}, {"review": {"des": "This place is so good! It's bit hidden on Clark St. in Lincoln Park - I lived in the area for years and never knew it existed - but worth seeking out. First of all, the food is a total steal. You can get gigantic portions for a very, very reasonable price. Seeing some of the other patrons' meals as they were served...absolutely ginormous crepes, waffles overflowing with fruit, gigantic sandwiches, and more. <br><br>I went with the croissant sandwich, which comes with scrambled eggs and your choice of four toppings (ranging from veggies, breakfast meats, and cheeses). The sandwich came, and the only word to describe it is overflowing with toppings. The homemade croissant was delicious, and they definitely don't hold back with the filling. The best part is that it's $7.99 -- and that includes a cup of coffee!<br><br>Can't wait to go back and try a waffle!", "pics": null}}, {"review": {"des": "Chicken salad sandwich, while small, was delicious. Definitely get it on their light and flaky croissants. A huge step up from your corner store's sandwiches.", "pics": null}}, {"review": {"des": "I looooooove this place... in a land of Starbucks and chains, Cafe Vienna stands out with a warm welcome, great service (Susan!), home-style food, and tasty bread and pastry. The soup with your pick of bread is my favorite, especially the lentil - it is outstanding!  Very kid friendly, even with crowds.<br><br>(PS: For coffee enthusiasts, they upgraded their capabilities and IMO, have the best espresso/cappuccino around.)", "pics": null}}, {"review": {"des": "Cafe Vienna is a cute little brunch spot in the heart of Lincoln Park. They have a very extensive menu, in addition to a ton of baked European desserts at the front of the cafe. My boyfriend and I came here for a quick and light breakfast sandwich, but the portions were so large that we basically needed to be rolled out of the restaurants. Nonetheless, the food was delicious and well-worth the price. A great start to both of our mornings!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PR4k_9uZ1dXg6IIQLMfcig/348s.jpg", "caption": "2 Croissant Breakfast Sandwiches - $7.99 each"}]}}, {"review": {"des": "Ordered the \"Austrian mac and cheese\", Kasespaetzle. No flavor and the \"grilled\" onions we barely sauteed. Goulash was served on a plate instead of a bowl and slopped all over the place.", "pics": null}}, {"review": {"des": "Cozy, friendly restaurant with delicious and heart food. Would recommend the goulash soup with fresh baked bread", "pics": null}}, {"review": {"des": "Warning to diabetics. This place will bring out tears, it almost did me. I like Austrian food so expected to be pleased. I was. You cannot find Austrian food everywhere. I started with the lentil soup. If you have read any of my reviews before you will remember that I am very tough on Chili and Lentil soup. When I say that I would rate the soup only 7.5, you must understand that it is still good soup. The rest of the food bursts the 9.0 on the Johnopolos scale. The dark bread that came with the soup was excellent. I had chicken Schnitzel with roasted parsley potatoes. It lived up to my expectations.  I was heart broken that I had to pass on half of the potatoes. This is where the diabetics need a strong support person. They cruelly make you walk past the famous Austrian pastries on display as you go to your table.My rule as a fat man is that I can only have a pastry that I have never had before. They had 2 so I had to pick one. That is why I sacrificed the potatoes. I have ha Napoleons before, in New Orleans so I passed on those even tho they looked very edible. There was another one that I have NOT had and I will dance with at another date. I chose the Opera Cake. It was a fine choice. I even gave half to another patron, the bigger half because it was so rich and I loved it too much. When you visit , your diet will hate me but your sweet tooth will party like a royal personage. I still regret passing the potatoes but that is not your problem. They even have along public table for singles to share.", "pics": null}}, {"review": {"des": "Came here on a Saturday morning by myself and took a seat by the window. I ordered a chai tea latte (YUM!) and an egg white omelet with bacon, spinach, and goat cheese. Probably one of the best omelets I've had in the city, it was almost crispy on the outside but fluffy and bursting with ingredients on the inside. The potatoes that came with it were also delicious. My favorite part of the meal though, has to be the bread. When the server started naming all my bread choices, I went with the 'well.. what's your favorite?', which in my history is usually always a good choice. He brought out a cranberry walnut bread which is one item I would have NEVER picked. And it was fantastic!! I'm honestly still dreaming of that warm basket of bread, I'm going to have to go back for some more. I also ended up taking a rum cake to go, which I wish I would have listened to the man behind the counter when he told me it was realllllly rum-y. There was just so much rum in it that I couldn't even eat it, and I consider myself a rum lover. The cake itself would have been great if the booze was cut back just a bit. But overall I will definitely be back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UYGE35cmgmgwwQIOIDVx0w/348s.jpg", "caption": "another amazing omelette.. egg whites, goat cheese & spinach. ft the Cranberry Walnut Bread"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2s_3EIhV7qe4gq-p6xsDQg/168s.jpg", "caption": "rum cake to go... way too much rum"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZKFBADxW_269JuK7vUCD6w/168s.jpg", "caption": "Cranberry Walnut bread... outstanding!!"}]}}, {"review": {"des": "Just like Vienna!  It's as good as it gets. Breads are delicious and varied, the crepes are to die for and I love a proper Austrian Breakfast with 2 soft boiled eggs and fresh ham on the side. People are so nice here too!!", "pics": null}}, {"review": {"des": "I came in on Thursday and had a wonderful experience. I was very pleased with the delicious pastries but more so with the impeccable service I received. Our server Susan was extremely friendly and welcoming. She seemed to be incredibly busy and stretched thin since she was the only employee. I'm not sure if someone called off or where her help was but it seemed as though there should have been more employees. Overall, I was more than pleased with our experience!", "pics": null}}, {"review": {"des": "I went there with my family (4 people) for breakfast. <br>The restroom is almost inside the kitchen (disgusting). We order some croissants sandwiches, black coffee, orange juice  and I ordered a crepe. They couldn't serve a juice at 10:30 because there wasn't a orange juice anymore. My son's glass of water had something (like a booger) sticking inside on it that he was able to see only at the end of the water. I complained and the waitress didn't apologized just said that is okay and brought another glass. I promptly responded said that was a problem and she got furious. <br>Let tell what she did: after 25 minutes waiting for ours orders she told me there wasn't a crepe anymore like a revenge trying to punish me. <br>The bread are delicious to take home but not for have them there.<br>Ahrrr!", "pics": null}}, {"review": {"des": "We've been looking forward to trying this breakfast/lunch spot for a while now since it's only open Thurs-Sun. It's fairly small with limited seating. The first thing you'll notice are the pastries and breads that look delicious. We were seated after 10 minutes and ordered the eggs Benedict and chicken schnitzel sandwich and cream of broccoli soup. After 35 minutes after ordering we realized our order was likely not put in. Patrons that were seated and who ordered after us got there food and paid for their bills before we got our food. Good practice for patience but we were still disappointed even after we got our food. It was simple and fair sized portions but underwhelming in taste. From the looks of the dishes around us, the croissant sandwich was a favorite along with some of the sweeter breakfast options. That might be the way to go. Even after we polished off our food our plates weren't cleared for a solid 10 minutes. Certainly would not discourage trying this local spot out for yourself though.<br><br>-Order with a smile", "pics": null}}, {"review": {"des": "Wow!!! Went here for the first time today for brunch and can't wait to go back. <br><br>This small restaurant/bakery has a huge menu ranging from traditional eastern pastries and fare to customary brunch items like scrambles and omelettes. The service was awesome and friendly, and a table of four got seated quickly this Sunday AM.<br><br>We all ordered coffee (intelligentsia) and tried the fresh squeezed oj. The croissant sandwich is HUGE-eggs cheese and toppings overflowing from a delicious homemade croissant. The fiesta scramble comes in a good portion with your choice of fresh bread. The Benedict was simple but delicious. <br><br>Best part? Coffee comes with the meal! Four people and our bill was about $42. Really can't beat that.", "pics": null}}, {"review": {"des": "Ive never actually physically ate here. When I work over the weekends at the office my coworker who lives in the city will bring me breakfast from this spot.<br><br>So far Ive had a croissant breakfast sandwich with cheese, mushrooms and onion and egg. The serving portion was extremely generous after I ate this i skipped lunch and ate a light dinner.<br><br>Today my coworker brought me a toastino breakfast sandwich with sausage, green peppers and cheese. The portion again is extremely generous I only ate half of it and put the rest in my fridge for breakfast tomorrow. <br><br>The food that I've tried here so far is delicious and very filling, wish there was one out here in the burbs, as I am not a city girl.", "pics": null}}, {"review": {"des": "We've ordered their German Chocolate cake for special occasions multiple times and it's truly outstanding. Moist, with a good cake to icing ratio and delicious coconut icing.", "pics": null}}, {"review": {"des": "We really loved this place the first time we went, which is why I'm so disappointed to say we won't be going back.<br><br>First of all, this place is tiny, which isn't a bad thing. Just expect a decent wait for a table. This weekend, we walked in and put our name in for a table for two. We were the only ones in line. Then it started getting super busy, with about 4 or so parties putting in their names after us. We waited for about 15 minutes until a table opened up. We were expecting to be seated when we saw that they seated the party that came in after us. Strike one.<br><br>We waited for about 15-20 more minutes until another table opened up, and we were seated. They sat us at a communal table, with another couple about a foot next to us, making it a bit uncomfortable. Then we noticed that the table that we were seated at was not clean, with trash and used napkins on top of the sugar/condiment holder. Strike 2.<br><br>I ordered the Continental Breakfast, she ordered the Veggie Benedict. My breakfast was supposed to come with a small orange juice. The waitress brought it in a cup that was just over halfway full. The couple next to us also got orange juices, and theirs were delivered full. Strike 3<br><br>Then there was the food. The Continental Breakfast was nothing special, and honestly not worth $11. The Veggie Benedict was, well, not really good. They don't know how to make good benedict really, so I wouldn't recommend it. Overall, the food wasn't very good, and definitely not worth the wait and service we received.<br><br>Overall, this place is hit or miss. They do have some good things on the menu, but you gotta really do your homework to find what they do good and not-so-good. Really wanted to love this place, but the past couple trips have not been worth it!", "pics": null}}, {"review": {"des": "Where can you find a place that serves breakfast AND sells European pastries?<br><br>Cafe Vienna, of course. <br><br>This place is the cutest little neighborhood breakfast/brunch joint. It is an Austrian cafe that sells every kind of breakfast item imaginable. From Eggs Benedict to Crepes to homemade soups to Schnitzel...they have it all! What I love about this place is how fresh and homemade everything is. Their potato soup knocked my socks off! The hot chocolate is also a MUST. They also serve their own freshly squeezed orange juice. Be sure to pick up some pastries and bread to-go before you leave, too! <br><br>With this place, you don't feel like you're in the big city. It gives the area a small-town feel. I love it. The restaurant itself is on the smaller side, but it's still very cozy and warm inside. I flock to this place when the weather is bad and I don't want to walk very far. Great location and great food! Do yourself a favor and come here for breakfast!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/T8DC7rPlRz4lH2KpRABssw/348s.jpg", "caption": "Macaroni and cheese with bacon!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/odYOWUI4MeQpmbDx4dzGzQ/168s.jpg", "caption": "Hot cocoa :)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mHVHDfFQxG_VWWnoB9-VtA/168s.jpg", "caption": "Hot chocolate and latte! Yum!"}]}}, {"review": {"des": "Homey. Friendly. Tasty!<br>Perfect little cozy Austrian cafe for brunch in the neighborhood! Can't wait to try others on the menu for brunch/ lunch in the future!", "pics": null}}, {"review": {"des": "This is my favorite place to order breakfast at on the weekend. I am obsessed with the pretzel croissant special - the eggs and veggies are so well cooked and they have the perfect egg to cheese ratio so everything is balanced. The breakfast potatoes are always delicious and never fail to satisfy my carby cravings. I tried the omelet recently and it was amazing too!!! I've also tried their homemade bread and a couple of the pastries and whoever they have baking everything is doing it right! I never actually eat there because the dining room is small and cramped but that's honestly fine by me. I love taking the food out and enjoying it while watching parks and rec reruns on Netflix. I recommend this place to everyone because it is simply my favorite and everyone who works there is super nice and helpful. Cafe Vienna is the perfect neighborhood gem and I hope it never changes!", "pics": null}}, {"review": {"des": "Prepare yourself, as I am most likely Cafe Vienna's biggest fan.<br><br>I am so lucky to have this little gem only a 2 minute walk from my apartment. I have only dined in a few times, as they are always so packed and have limited seating, but every time I order out or eat there I am always so impressed! They make all of their own breads and delicious pastries, and their food is also really high quality. <br><br>Breakfast:<br>Most of the breakfast items come with a choice of their house-made bread, and PRO-TIP: you can pick a Bavarian style soft pretzel as an option! Their omelettes are amazing, but their croissant breakfast sandwich is definitely where it's at. I love all of the little European nuances on their menu (soft-boiled eggs, crepes, fresh squeezed orange juice!)<br><br>Lunch/Dinner:<br>Their soup is always delicious, especially the cream of broccoli. The chicken-salad sandwich is served on a buttery, flaky croissant with pickles and olives on the side (I have probably eating a few dozen of these sandwiches), but I am also a big fan of their Turkey Panini with artichoke hearts and pesto. Also, their french fries are some of my favorite fries in the entire world. <br><br>Dessert:<br>Get a few things for yourself, as these cakes/pies/desserts are to DIE for. But especially the cheesecake tart. They put some sort of thin layer of royal icing between the crust and the filling to keep the crust from getting soggy (brilliant) and the fruit on top is always fresh!<br><br>If you're like me and want Cafe Vienna every day of the week, too bad. They are closed Monday through Wednesday :(", "pics": null}}, {"review": {"des": "Breakfast is by far my favorite meal of the day and I am continuously looking for the best spot for breakfast in Chicago. Right now, Cafe Vienna is #2 in the city, right behind Bongo Room, but easily ranks #1 in value. If you are heading here, you get the breakfast sandwich. For just $8, you get a sandwich that simply overflows with 4 ingredients and a coffee. Cannot beat it. If that doesn't sound good to you though, no worries, as the whole menu is extremely solid. An absolute hidden gem in Chicago that deserves to be on everyone's list of places to check out.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tIDcdr7uoV1FvhuCmUMUbw/348s.jpg", "caption": "Would love to try and watch someone pick this up with their hands"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/67_L-AkTOc-aY36fnMKkQQ/168s.jpg", "caption": "The German chocolate cake is so dope."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/99syRPHcpH4ClQp8LfldlA/168s.jpg", "caption": "The OG of breakfast sandwiches and poppy seed French toast. Unreal"}]}}, {"review": {"des": "This place is awesome, best Rueben sandwich I have had in this part of the city. The food is amazing but the ambiance and old deli feel is really what got me.", "pics": null}}, {"review": {"des": "Disappointed in Cafe Vienna, we have been here before and had an enjoyable experience. The toast came 20 minutes before our food. The coffee tasted burned and the scrambled eggs were rubbery. Additionally it was not very crowded and our food still took quite a long time.<br>Maybe it was an off day for them but we will not be going back for some time.", "pics": null}}, {"review": {"des": "Off the hook! This is my joint!!! I've been here for breakfast only... the skillet is good... the poppyseed French toast is awesome! They also have a good selection of tea.", "pics": null}}, {"review": {"des": "Great breakfast spot. I ordered the croissant sandwich with sausage, spinach and feta cheese and a cup of freshly squeezed orange juice. The sandwich was delicious and reasonably priced. Not sure how I was able to resist the cases and cases of mouthwatering desserts, but that's definitely on my list of things to try.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LgTX3tXZCVjRrPSqaNMiJw/348s.jpg", "caption": "Croissant sandwich with sausage, spinach and feta cheese."}]}}, {"review": {"des": "I'm a big fan of their breakfast croissant sandwich. It's very large and filling, I always have leftovers for later! Their breads are also delicious and the staff is friendly.", "pics": null}}]}