{"name": "cafecito-chicago-5", "reviews": [{"review": {"des": "yup, yes, look no further. this place is 100% the spot!<br><br>little booths, a bar area coffee shop meets diner meets bar. what more can you ask for, you say? Incredibly affordable, very kind staff, delicious food, and a cafe con leche that will send you over the moon. An easy spot to miss as it's located right in a residential apt complex, but if you're downtown and looking for a quick and delightful + affordable spot to chill and eat, this is the spot. I'm looking forward not only to going back, but can easily see being a regular here. <br><br>A lovely business to support.", "pics": null}}, {"review": {"des": "Excellent Cuban sandwiches including a vegetarian version. We ate in the full service sit down area, but the walk up take-away was quick and well run too. <br><br>Loved the food!", "pics": null}}, {"review": {"des": "This place is cheap and delicious! It's a great place for lunch or dinner depending on what you order. The place is in some residential building area but it's easy to tell you're in the right place since there is outdoor seating (I'm assuming weather permitting). <br><br>We generally order the plates but I've had the steak chimichurri sandwich before. I really like their chimichurri and I think I prefer the sandwich version over the plate version since the bread soaks in the chimichurri flavor and it's soooo good. I also got the sandwich as a combo with chips + drink. You can choose between a small bag of lays (original) or Doritos (nacho cheese) and a soft drink (refillable). Maybe I was extra hungry but I thought the sandwich was a little small. It would be great for a quick lunch! <br><br>For the plates, I'd recommend the palomilla or the ropa vieja for beef and lechon for the pork. I haven't tried any of the chicken dishes, but I'd imagine they're pretty great based off their other plates. The palomilla is my favorite, the steak in the  \"mojo sauce\" (mo-ho, a garlic sauce) is amazing with the onions. I'm generally not great with raw white onions, but I honestly didn't mind the rawness and it added some texture. The beans and rice that come with the plate are really good, they might have some of that mojo on the rice (?) because it's so flavorful. Although the meat doesn't need any more flavoring, the green habanero sauce that they have (El yucateco) is a great addition! <br><br>I found the service to be pretty great. The server came with the menus right away and was constantly refilling our water/soft drinks. The food took maybe 10 minutes to come out and it was nice and hot. <br><br>Overall, great spot for a quick cheap meal that tastes super flavorful and amazing!", "pics": null}}, {"review": {"des": "Great vegetarian options here! <br><br>My sis and I visited this restaurant on Monday late in the afternoon.  When we walked in, there was no line.  By the time we ordered, about 8 people lined up behind us.<br><br>The dining room area was comfortable and casual with several tables and chairs, a sofa, and a television.<br>The decor was simple and basic.<br><br>At this restaurant, you order at the counter and pick up your food when your name is called.  The menu was posted above the counter.  Pressed sandwiches, salads, platillos, and yummy sides were listed on the menu.  I ordered the Jardin and my sister ordered the <br>Cubano.  The Cubano came out in a reasonable amount of time.  The Jardine took a little longer.  Both sandwiches were amazing!  The sandwiches were warm and highly satisfying.  The bread was moist and crunchy.  My eggplant sandwich was probably the best I've ever had.  <br><br>Service was good.<br><br>There were no restroom available for patrons.  <br><br>This restaurant is definitely worthy of a repeat visit.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zyZxLqDpgHzMRwvpYDv9Ag/348s.jpg", "caption": "Cubano"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ibQz-QEm2VeZYGTIgphiAw/168s.jpg", "caption": "Jardin"}]}}, {"review": {"des": "Finding an inexpensive place to eat in the Gold Coast can be pretty difficult sometimes, but Cafecito is a great option for lunch on a budget. My mom had a doctor's appointment nearby and asked if I wanted to meet her and my dad for a meal, and this was the place we could all agree on that wouldn't break the bank for the group (the bill ended up being only $35 before taxes for all 3 of us!).<br><br>Cafecito is a seat-yourself, no-reservations restaurant, with both indoor and outdoor seating or carry-out options. We arrived around 11:45 and there were a few tables open inside, but we noticed around 12:00 that it got a lot busier and people were waiting for tables. Nice to know we picked a great spot!<br><br>They offer sandwiches, salads, and larger plates on their menu, again, all at pretty great prices. I ordered the Exotica Salad, which was around $8 and included grilled shrimp, avocado, corn, and spinach. It was really easy to pick something off the menu because of all of the variety of options. The waitstaff was quick and knowledgeable, and kept coming by to fill water or ask if my dad wanted refills on his Diet Coke. When we were leaving, the waiter gave my dad another Diet Coke to go at no extra cost. I'm not sure if this is just the norm there, but it was nice to get a drink to-go at a sit-down restaurant.<br><br>If you're looking for a less expensive, yet still filling lunch, Cafecito is a fantastic option.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ybgpUocDUqgEgrAmj_12qQ/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FLONj6DgG3UL3XxLdSo6Cg/168s.jpg", "caption": "Mule"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xPcym3kR5xiTVHIlITI6NQ/168s.jpg", "caption": "Exotica salad"}]}}, {"review": {"des": "Food: 4/5<br>Service: 3/5<br>Cleanliness: 4/5<br><br>Now Cafecito has other locations around Chicago but I particularly like this one due to its location and bar it offers (they have Happy Hour). If you want to dine-in, you seat yourself. I wouldn't say there are too many seats since it's a fairly small place but it's not a place you're looking to spend hours anyway. A fair amount of people take take-out too.<br><br>The thing about seating yourself is that sometimes you won't be seen until 5-10mins after being seated with no menu or water whatsoever. When it gets busy they may just forget or are just shortstaff so your stuck with twiddling your thumbs. That's ok since it's a super casual place.<br><br>Sandwiches: ~$7 tasty with a crunch. You can get additional side of rice and beans for ~$3.<br><br>Platters: ~$11 loving the plaintains. We would recommend Léchon! We also tried the Steak and BBQ Chicken but they were dry. Think they tried balancing that out with drenching the chicken in BBQ sauce, meh. <br><br>Would I come back? For cheap eats yes.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tg4RNBvs4A1bDB7yixhB7w/348s.jpg", "caption": "Lechon plate $10.25 5/5 Chivito $6.69 5/5"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/StDHNx0sICXmYI1KlhYF8g/168s.jpg", "caption": "Inside front"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3-Z1gpu2TN2A9R9YHOdXeA/168s.jpg", "caption": "Entrance in building lobby"}]}}, {"review": {"des": "Unlike the other well reviewed places in the area, this place is legit amazing!<br><br>The food quality is fresh and delicious. Many offerings are unique and inventive. <br><br>I had a breakfast sandwich with steak, eggs, cheddar and onion on a grilled pressed bread. The complimentary hot sauce really gave it a nice kick. It's not your usual bacon egg and cheese. <br><br>I also got a side of yuca potatoes which were perfectly cooked and super delicious.<br><br>The prices are very reasonable ($5 or less for breakfast sandwiches, $2 for coffee with refills, $3 sides).<br><br>They also offer fish, steak, chicken and pork entrees for $10-12. All look amazing!!!<br><br>This location is right by the childrens hospital and also the modern art museum. Excellent spot for food before or after the museum. Excellent spot for food anytime!<br><br>Portion sizes are reasonable. Not the giant portions of competitors but I also don't need to have 4 lbs of potatoes and 5 eggs in my omelet. That's just nuts. Some people like that. I like this.", "pics": null}}, {"review": {"des": "Cafecito has some pretty good Cuban food downtown at a value price.  This small shop is located just behind the Hancock on Chestnut.  It has a small indoor seating area and a nice outdoor patio.  You have your choice of ordering at the counter or waiter service outside.<br><br>They have a full menu of traditional Cuban delights. I went with the Cubano combo for a quick dinner.  The price was amazing for the area:  just under $10 for a sandwich, chips and a drink.  The Cuban was very good.  It was well constructed and had a good amount of tasty pork.  The bread was delicious and toasted perfectly.  The habanero hot sauces on each table really set the sandwich off! It was a little on the smaller side, but again for the price was a great value.  The choice of chips were either bagged Dorito's or Lays chips.  I understand they probably do a lot of carry out business, but this seemed a little tacky.  I would have paid more for some plantain chips or something homemade.  Other reviewers recommend the cortadito, but it was too late in the day for me to mess with Cuban coffee. <br><br>If you are in the area and looking for a cheap, quick bite to eat than this is your place.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iN_-kGVagVfM0F-bMyYMlg/168s.jpg", "caption": "Tasty cubano"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aw4iKeG_4BaGF7h90erWkw/168s.jpg", "caption": "Hot sauces"}]}}, {"review": {"des": "I love cuban food and this place didn't disappoint! It's difficult to find cheap but good food near downtown. They have a lot of seating inside and outside. If you want to be served they have a separate section in the back. Everyone was friendly and the order came out fast. The sandwiches we ordered were very flavorful and crunchy! The crunch isn't from the bread alone... I noted tiny pieces of string fries in my sandwich. Yum! I will stop by again on my visit.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Y0RYEJwf27DfEOC-zSZ9ig/168s.jpg", "caption": "Chivito"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lNDMXaViCLwBwk_6ZDVIyw/168s.jpg", "caption": "Chivito and cortito (special) sandwiches"}]}}, {"review": {"des": "Glad to see them busy on a Friday night. Pretty full, but you could still grab a table. Quite loud due to the Happy Hour crowd who were...happy...quite happy in some cases.<br><br>We love the food here but the place is not without some flaws. let me cover them first. Service was adequate but not super. Given it does not pretend to be fine dining, that's probably fine.  One of my pet peeves is a sticky menu--and ours were :)  Also, the mojito was mediocre.<br><br>Ok--now that I have gotten that out of the way--the good stuff. The food is good and excellent value. Husband had the lechon platter and I had the pollo churr<br><br>The plantains were fried perfectly and delicious. A huge amount of rice accompanies.  The sauce was great. the chicken was all white meat, and tasted great. It was almost too dry but the flavor made up for it.  Husband's pork was delectable.  He doesn't do plantains so I asked and they brought him two rices instead he loves rice).<br><br>It's great fr a quick breakfast, lunch or dinner. Salads, soups, sandwiches and delicious platters. Prices very fair for the area.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/goqei7RTHeS7eprHTdseSg/348s.jpg", "caption": "Pollo chimichurri Yes--that's a big pile of chicken :)"}]}}, {"review": {"des": "My go-to spot for delicious, affordable Cuban food in Chicago. I like this location better than the south loop one because it has a little bit nicer setup for seating. This past Saturday during peak lunch hours I was still able to grab a table in the front despite it being pretty busy. <br>I started with a cortadito, which was on point, and also ordered the guava-Q chicken sandwich. SO GOOD. And even though I ordered at the counter, they were still great with service - gave me a glass of water without asking, brought my food out to the table, and cleared everything for me when I finished. The manager/owner (?) seems to know a lot of people who come in, which just contributes to the friendly, neighborhood vibe. It's definitely a comfortable, casual spot I'll keep coming back to.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/B6H1retZ9Xlk4UGOyuDe7g/348s.jpg", "caption": "Guava-Q chicken sandwich level 100"}]}}, {"review": {"des": "Was excited to try this place for a long time but was really disappointed. <br><br>The cafe con leche was really good - it was the perfect amount of sweet and was also creamy and used good quality coffee.<br><br>However, I was really disappointed by the sandwich. I ordered the Timba, which had Swiss cheese and guava jam. There was hardly any cheese (covered less than 1/3 of the bread) which meant that the sandwich was basically plain white bread with a little jam. <br><br>The prices are really good (sandwich was only $4) so I might come back one more time to try a different sandwich, but overall this experience was not a good meal at all.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dNxfSh68feT_Pwq-ej0DKg/348s.jpg", "caption": "Timba Sandwich"}]}}, {"review": {"des": "Came here for a snack and \"catch up\" time with a friend. I had a large cup of cafe con leche and a bowl of black bean soup. Well. This simple late lunch was wonderful. The cafe con leche was so very rich and delicious - however silly/simple it may seem, I'm already anticipating going back for another cup as soon as I can. Hearty black bean soup with a side of bread hit the spot. Such a basic meal, but so very, very good!", "pics": null}}, {"review": {"des": "A lovely under-the-radar Cuban cafe with cheap yet delicious eats! Friendly, casual service, in a casual yet inviting place! Kind of confusing to find since it is attached to/sort of inside a residential building. But well worth the journey.<br><br>We started with some tostones and yucca fritas, which were a nice start, albeit a bit bland. They were easily upstaged by the variety of boldly flavoured sandwiches on offer. I had the Guava-Q, which is just perfectly balanced in its sweetness, savouriness, and slight tang.<br><br>Finally, when it comes to value, this place can't be beat. My sandwich was around $7, which is downright crazy at a sit-down restaurant in this part of town. They also have full platter meals (with rice/beans) for those looking for something more filling; even those are only a few bucks more. What a hidden gem!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Lqnx_7gQiCWMoV7h4IufJw/168s.jpg", "caption": "Guava-Q Sandwich"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KtLwRtXIX6xaROcGPP3uLA/168s.jpg", "caption": "Tostones and Yucca Fritas"}]}}, {"review": {"des": "Overall gets 3 stars and here is why:<br>Coffee is great! We've tried drinks from both the America coffee menu and Cuban coffee menu. My favorite is the Cortadito as a double, iced. <br>Sandwiches are good.  We've only tried the breakfast sandwiches and have liked them enough to continue to order them. We find them reasonably priced. <br>Service could be better, it's a hit or miss. At times it's quick, friendly and efficient.  Other times it's slow, fairly friendly and disorganized.", "pics": null}}, {"review": {"des": "I'm originally from Chicago, but I went to school in Miami. I fell in love with Cuban food while I was there and I've been searching for a solid Cuban place in Chicago ever since I moved back to the city. I think Cafecito is the place I've been looking for.<br><br>Cafecito's interior is a more modern/midwestern style compared to what you'd see at Cuban restaurant on Calle Ocho, but I think the menu and food comes pretty close to what you'd see in Miami. They've got the classic cubans sandwich; platters ranging from steak, chicken, and rope vieja that are served with rice, beans, and plantains; and cuban coffee (cafecito, cortadito, cafe con leche, etc.). A huge plus is that the prices are relatively cheap, some things are actually cheaper than what they'd cost in Miami!<br><br>The food was really tasty for the most part. The only thing that was 'meh' was the guava and cheese pastry (basically a pastelito). Also the service was unfortunately not that great the last time I went. Our server seemed reluctant to come to our table and seemed like she wanted to interact with us a little as possible. <br><br>Despite that, I still loved my experience here and plan to come back again and again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XaS_YLRLXlV3P7RFXk-Atw/168s.jpg", "caption": "Chimichurri Steak Platter"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pLZF_FASwuGK0P2mlkZcUw/168s.jpg", "caption": "Guava and Cheese Pastry"}]}}, {"review": {"des": "Spent the whole summer ordering from here, since it is close to my office. Lechon sandwich is a must try; the pork shoulder is tender, juicy, and flavorful. The bread always tastes amazing, and is pressed until crisp on the outside and soft/warm on the inside. Platters are great too, with a side of plantains that adds some nice sweetness to the meal. <br><br>The best part is the price. Cannot find a better lunch for under $10. Just be careful of the crowds during lunchtime.", "pics": null}}, {"review": {"des": "Ummm. I'm thinking that any rating give more than one star is from people who aren't from the Caribbean.. The food was disgusting..the rice had a weird taste, it was like a boil in the bag Asian texture...The beans had absolutely no flavor. The tostones were probably the best part. My chicken sandwich had a yucky chickeny taste and smell. Not wasting money here again.", "pics": null}}, {"review": {"des": "Great food. Guava Q Pressed with Pork and Exotica salad were delicious. Food took longer to serve than expected.", "pics": null}}, {"review": {"des": "Good prices, quick, easy, and tasteful. Cortadito Single Espresso is so delicious and I have craved it a few times since. The have dine in table service, walk up counter, and a bar. <br><br>Vegetarian friendly. <br><br>The Cubano Sandwich is $6.50 and made with mojo. Very good and recommend. Not the best Cuban, but very good. Not too many side options. Caldo Gallego soup is great!<br><br>Service was a little slow, but it was New Years Day so I gave them the benefit of the doubt.", "pics": null}}, {"review": {"des": "The service was fantastic, first off.  Ordered a Juevo con Bistec, no bread.  All I can say is yum!!  The cafe con leche had just enough of the espresso kick without being too overwhelming.  Cute little place....if you go to 360 Chicago, recommend you escape the crowds and come here only .1 miles away.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-E0xDz5vd34z5sOnm6SYJg/348s.jpg", "caption": "Juevo con Bistec"}]}}, {"review": {"des": "One of the best spots on the Mag Mile!<br><br>I challenge you to find me a place where the food is fresh, fast, cheap, and authentic remotely close to Michigan Avenue! I have worked on the Ave for many years, and this place is truly a gem! I almost didn't want to leave them a review because I want to keep it a secret. I have basically had the entire menu, including breakfast, and have never been disappointed. Everything is delicious and reminds me of being in South Beach! They have won awards for their Cubano, but I love their plates more than their sandwiches. However I'm prefer rice over bread if I'm gonna go ahead and indulge in carbs. Service is pretty good; it depends on how busy they are. You must also try the Cuban coffee!!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/s71Lrns1K3PTJNspxZo0wg/168s.jpg", "caption": "Cocktails!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/f985l9d2iAYG8kizAyD_UA/168s.jpg", "caption": "Beer and wine menu"}]}}, {"review": {"des": "Updated review (November 2017): <br><br>I'm so sad to write this, but this once 5 star review has now become 3.5-4 stars! :-( The food here is very good. They just recently increased their prices, which put a damper on my day, but it really isn't by that much. I'd still say this place is cheap for Chicago standards! <br><br>What really made me downgrade the place was 1) consistently not good service and 2) gross bathrooms. The service is always sllllooowwww and inattentive. We are always having to ask a different waiter for or check or to order because we wait so long. The food comes out at reasonable times though. The bathrooms are gross-no soap, 1/4 toilet paper roll left. So you can assume the workers aren't washing their hands after using the restroom-ew! <br><br>Old review:<br><br>usually write long-winded reviews, but I am going to keep this one short and sweet. THIS PLACE IS AMAZING AND YOU NEED TO EAT HERE! Perhaps I am biased because Cuban food is my favorite cuisine, but I dare to say this is the BEST restaurant in town. The prices are ridiculously low for Chicago ($4-6 for good sized sandwiches: $10 for shrimp platter that Ok includes rice, beans, and delicious plantains). The ambience is so fun, too. Do yourself a favor and come here.", "pics": null}}, {"review": {"des": "I usually go to the Cafecito located on Congress, but decided to give this one a try since it was close to my job. This was my first time & LAST time coming to this location period. I ordered two Palomilla Plates that came out to $28, they told me they didn't have steak so I had to change my steak into another protein which was fine with me. I waited literally almost an hour for a half completed order so I had to wait even more time. Plus I was charged TWICE!! Wtf! The one on Congress is wayyyy better .", "pics": null}}, {"review": {"des": "We ordered the roasted pork. They are so delicious. The food size is very generous with great price! Will<br>Be our go to spot for Mexican food.", "pics": null}}, {"review": {"des": "I LOVE CAFECITO!! Good prices, lots of room inside to sit, delicious delicious food.<br><br>The sandwiches are great but my favorite is the lechon plate. Great rice, beans, plantains, and perfect meat. Perfect meal. The vaca frita was good albeit oily (but it's supposed to be). I wasn't a huge fan of the plantain-crusted tilapia. The fish wasn't very flavorful and the mango fried rice tasted like normal rice. <br><br>I would suggest avoiding the lunch rush - you can order ahead online I believe so you don't have to stand in line.<br><br>If you come to eat in, sit down at a table - don't order at the counter (that's to go). Service is friendly too!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Fn9DVAXszZYs6G5GHuXLhg/168s.jpg", "caption": "Vaca frita"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qr3OVX0KyrkLb8P6_koDXQ/168s.jpg", "caption": "Plantain crusted tilapia"}]}}, {"review": {"des": "For a minute there, I forgot I wasn't im Cuba. I ordered the Léchon platillo and it was so good, it reminded me of being in Cuba. It helps that they play Cuban music while you're eating and the staff are very welcoming and the service was spot on. It's by no means fine dining (and it doesn't have to in order to be good) but the slow-roasted pork dish was so good I had memories of my trip to Cuba playing in my head with every bite. In addition, with this freezing weather, it is truly amazing that the food came out just the right temperature straight from the kitchen. The mojito was also very good. I didn't get to taste their guava puff pastries or the guavaQs but looking forward to it next time I'm in the area. Best Cuban food outside of Cuba I had so far and great location near 360chicago and Mag Mile.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2o4SC7dcLC_JT_UOgsH89A/168s.jpg", "caption": "Léchon"}]}}, {"review": {"des": "This place is all around great. Servers are great, interior is great, culture is great. Did I mention that the food is great? Do not let the price deceive you. The Ropa Vieja, Choripan, El Toro are great with rice and beans, or for the messy types, in sandwich form. Please get the Yuca Frita; you will not regret it. Their sauces, the smell, the crunch! You will wonder why you haven't tried this seemingly innocuous place yet. Skip the nearby Water Tower food court and go to this Chicago born and raised restaurant. Though this place may feel kitschy on first visit like a weird Chipotle, let the food speak for its authenticity. You won't regret it.", "pics": null}}, {"review": {"des": "When I worked downtown, I went to Cafecito all the time! The breakfast sandwiches are super indulgent and perfect for days when you're craving something substantial. Be careful - it might stink up your office! Try the Chivito - it's filled with steak, ham, a fried egg, cheese and more!<br><br>The Cubano sandwich ($6) was easily one of the best Cuban sandwiches I've ever had. The key elements comprised the moist roasted pork, the warm and crusty bread, and the distinct flavors of the pickle and mustard, which added a sour punch. It may not look pretty, but it's a humble and delicious sandwich.<br><br>The calde gallego soup is warm and comforting on a chilly day. It's light, but rich in flavor, swimming with soft collard greens, white beans, some ham and diced potatoes. And it's hard to go wrong with potato salad, but I could have done with a larger portion of it.<br><br>The black bean soup is filled with stewed black beans, diced onions and peppers, and served with a lightly toasted sandwich bun perfect for dipping. <br><br>The chopped salad is also chunky and substantial - I could only eat half of it! It's filled with iceberg lettuce, hearts of palm, roasted red peppers, thinly sliced onion, chopped tomatoes, chickpeas, corn kernels, sour and spicy pepperoncinis and olives, all tossed in a tangy herb oil dressing.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WhwJQI_fnAp9YXQtfr2fkg/168s.jpg", "caption": "The Cubano sandwich ($6)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2P8iuQq73RncxiJZXcIpKg/168s.jpg", "caption": "Chopped salad and black bean soup!"}]}}, {"review": {"des": "4 stars for the food, 5 stars for price and convenience!<br><br>I ordered a steak chimichurri platter for dine-in and a mar y tierra sandwich to-go. The steak was yummy, though I wish that I had gotten more chimichurri because I LOVE chimichurri. The plantains were also delicious!! Black beans were alright, but not the best I've ever had for a Cuban restaurant. I saved the mar y tierra sandwich for a late night snack, and I do not regreat it at all. Tasty blend of shrimp, arugular, and spanish chorizo.<br><br>The price is as good as it gets. My total bill was $25 including tip for one platter and one sandwich. I'm not sure where else serves fresh and delicious food for this price. I also appreciate the speed that my food was brought to my table after ordering (5-10 mins) and that Cafecito has a takeout counter for even faster food. Server was very nice and atmosphere is chill.", "pics": null}}, {"review": {"des": "Love this cute spot! <br><br>1. Love the ambience. We sat outside since it was such a nice day and seating area is cute. I made my way inside to use bathroom and inside including bathrooms was aesthetically pleasing. <br><br>2. Clean with good service on my visit. <br><br>3. Food prices X quality X quantity = spot on! No complains <br><br>4. Our server pointed out some additional items not listed on menu (i forgot what) point is she was kind enough to do that. I also appreciated her feedback when I asked for a suggestion since I couldn't make up my mind. <br><br>All in all I enjoyed my visit & look to return for more food.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5MZV8IJ84LPLOzLkvdOzMQ/168s.jpg", "caption": "Cubano Sandwhich + Steak Chimichurri"}]}}, {"review": {"des": "So yummy and cheap. No wonder it's packed. So many cheap sandwich options that all look fantastic.<br><br>We got the chipotle chicken and the guava q pork sandwiches and black bean soup. Sandwiches are all less than 7.00 and you can make it a combo with chips and a drink for 2.00 more! Who does that anymore?! Yum. <br><br>The food had generous portions of meat, sauce and the like. It reminded me of home cooking... I kinda imagine someone's grandma cooking with love in the back. <br><br>The place was super clean and The service was top notch. Super friendly and personable, I kinda wanted to keep him.", "pics": null}}, {"review": {"des": "This place is so good and the prices are so reasonable. I have went a few times after being introduced by a regular there. <br><br>The staff are very attentive and nice... but the food is what sets it apart. <br><br>It's very close to John Hancock, so if you're in that area, a great place for lunch or brunch. <br><br>I have not had any mixed drinks there yet, but they do have a full bar.", "pics": null}}, {"review": {"des": "Placed an online order during the lunch hour, glad I did, I waltzed in the door past a line of a half dozen patrons and picked up my ready and paid for order. I would like to return soon and dine in, the interior is very cool. The Cubano sandwich was very nice and the delicious Plantains proved to be a good carryout choice. Reasonable prices, especially when you consider where this store is located.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/q64COJ8FY3PCJmu5aJRhug/348s.jpg", "caption": "Cafecito Entrance.(keepsmilingphoto.com)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YS_4WfunP91aOiSjtdcTMg/168s.jpg", "caption": "Cafecito. (keepsmilingphoto.com)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xB1vYT6CM26UgzXm-hF_3g/168s.jpg", "caption": "Cubano. (keepsmilingphoto.com)"}]}}, {"review": {"des": "2 incredibly well made sandwiches and two very tasty not too sweet  mojitos for 35 bucks in Streeterville means this is a must stop every time even if you just finished a meal somewhere else. <br><br>1. Proper bread<br>2. Proper bread to meat to filling ratio (you know what I mean) <br>3. Fantastic roasted pork, great steak. All the meats are marinated and full of flavor without extra sauces. <br>4. Fresh greens <br>5. Quick and delicious. <br><br>Minus 1 very big point for using yucky anemic not ripe very rough tomatoes, but after those were picked off you have a fantastic product in a great location with an unbeatable value. Do not miss.", "pics": null}}, {"review": {"des": "Stopped in on the spur of the moment after reading the great Yelp reviews.  Yelpers rarely get it wrong but on cafecito the Yelpers struck out.  The music and atmosphere were pleasant and consisten with the Cuban theme.  The Server was also very attentive and genuinely friendly.  However, the Mojito was watered down, the steak was dry, and shrimp was bland.  I really wanted to like this restaurant but I found very little that I could fall in love with except the prices which were very reasonable.", "pics": null}}, {"review": {"des": "Delicious Cuban restaurant that is quick and easy to get breakfast/lunch. I came here twice for breakfast, but you can also order from the lunch menu for breakfast. They do have a bar in the back, so I'm sure it's a great low-key spot in the evenings. <br><br>Cafe con Leches come in small and large. I had more than enough with the small. They come in pretty big coffee mugs, not complaining! The breakfast and lunch sandwiches here can't be beat. <br><br>Breakfast sandwiches:<br>Bistec Con Huevos: steak, onions, cheese, and eggs. The steak and onions were well marinated and gave the sandwich nice flavor.<br>Jamon Con Huevos: Choose from either bacon or ham. I chose bacon and it was standard bacon, egg, and cheese sandwich. I had mozzarella cheese with it <br>Cubano: great meat ratio and <br>Pavo: basically a turkey BLT. <br><br>Serving size of each sandwich leaves you comfortably full. <br><br>I am no expert on Cuban cuisine, but this place is one of the best place I've eaten outside of Miami. I'm impressed with the quality of the sandwiches and the prices for being right in downtown Chicago. You won't want to miss this place if your looking for a quick bite to eat.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bVn2xOak4yW66Q-r24VW_g/348s.jpg", "caption": "Bistec Con Huevos with a small Cafe Con Leche. Great Cuban breakfast."}]}}, {"review": {"des": "The food is spectacular at Cafecito! Huevos con Chorizo with the Cafecito (coffee) was excellent and I will be going back again for more.  Love that this location has a full bar; the servers are pleasant, professional, and delightful.<br><br>If you are in Chicago's Gold Coast, do not miss out on this neighborhood gem! Highly Recommended.", "pics": null}}, {"review": {"des": "I got the mojo shrimp platter, which comes with rice and beans, and fried plantains. The dish was like a healthier version of real Cuban food. The shrimp was smothered in a buttery sauce but everything else felt pretty wholesome, but a bit lacking in taste. The food didn't have a wow factor deserving of more than three stars from me. I got a cafe con leche but it tasted not as strong as I would have liked. I also found the service to be a bit spotty.", "pics": null}}, {"review": {"des": "This amazing cafe/sandwich shop really hit the spot. Even on a Sunday afternoon, it was difficult to find a seat! These sandwiches are perfect to enjoy in-house, or to take on the go. We tried the steak chimichurri sandwich and the ropa vieja. The chimichurri sauce was a bit sour (maybe too much lime?), but overall it was enjoyable and fresh. The ropa vieja was an awesome combination of savory flavor and sweetness with the plantains. The sandwiches were the perfect amount of food to satiate us, but I wish there had been room to try more of their menu! I highly recommend Cafecito if you're looking for a solid, quick lunch option!", "pics": null}}, {"review": {"des": "My husband and I came to Cafecito due to their high ratings and their post on buzzfeed for their famous sandwiches. We came here twice during our visit to Chicago. The first time we ordered platters: lechon and ropa de vieja. Both were just okay, either a bit dry or a bit salty. The customer service was just okay as well. We had to waive them down to give us menus and to take our orders, but once the waitress came, we got our orders on time.<br><br>The second time we came was for take out. We figured that we would order two sandwiches to go for the airport. This did not disappoint and sandwiches should've been ordered the first time around. We ordered the steak chimchurri and the cubano. Both were amazingly delicious. I also ordered their famous iced cafe con leche. I'm not a coffee person at all, but I absolutely loved it. Now, I'm back in New York and I am so wanting one of their cafe con leche along with a sandwich. Definitely will be back the next time I visit!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tI4BbJ48a1obxQOY2E8meA/348s.jpg", "caption": "Lechon platter"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/f_BTl3nJj93lgVtEIFqbKw/168s.jpg", "caption": "Ropa el vieja"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KDTsgEu1XPcdTdaINarBUw/168s.jpg", "caption": "Ice cafe con leche!"}]}}, {"review": {"des": "On the hunt for Delicious Cubanos, I walked here from work and found Amazing Food, Super Friendly Staff, and had an all around Fantastic experience!!<br><br>There's a cafe in the front and restaurant in the back,  so I dined in a booth in the back where things were quieter. The decor has colorful posters everywhere and can brighten up even the gloomiest of days!<br><br>The Shrimp Ceviche was Outstanding! The mixture of shrimp, tomato, corn, avocado, red onion, celery, and rocoto pepper was Fresh and Light. The salad of mixed greens was crisp and the freshly cut and prepared tortilla chips glistened with just a hint of salt and tons of flavor!<br><br>I picked the Cubano and was SO GLAD I did! The layers of roasted pork, ham, swiss, pickles, and mustard were perfectly rationed and pressed firmly in between the scrumptious bread making each bite better than the last!<br><br>The Jardin was a Zesty sandwich filled with<br>eggplant, roasted peppers, mozzarella, mushrooms, arugula, and smeared with jalapeño hummus. This vegetarian delight was chock-full of hearty goodness from the garden that I'm now recommending it to my vegetarian friends!<br><br>I ordered the Ropa Vieja to take home for dinner and it took all of my will power to not eat the whole dish right there :) I adore slow roasted anything, so the shredded skirt steak with chopped onions, bell peppers, and garlic in a tomato creole sauce really made me Happy with each bite! The white rice with butter was packed tightly, but so lightly and fluffy; the black beans were superbly cooked and plantains were lightly fried on the outside and sweetly soft on the the inside. <br><br>Altogether, my dining experience at Cafecito was a breath of fresh air and I am glad there are two other locations to try!!", "pics": null}}, {"review": {"des": "This places doesn't pop up when your research Chicago but hands down someone of the best homemade sandwiches you'll ever try. The best part has to be how fresh these vegetables are. Bread is perfectly toasted to fit the toppings. You have to try chivito sandwich. It's like a phili cheesesteak on crack (aka better) lol", "pics": null}}, {"review": {"des": "Delicious, authentic Cuban food. Service is good. Price is awesome for all you get. I got the steak with chimichurri sauce and plátanos - highly recommended. Coffee is good too. The music on the background is Cuban style, making for a nice atmosphere.", "pics": null}}, {"review": {"des": "This is a much larger location than the one in the Loop, and there are much more dine-in seating options which I appreciated. However, service was lackluster. <br><br>Their computer system glitched right before I arrived and I was left standing around for 10 minutes (while on a tight schedule) watching the manager? bang and curse at the computer. It would have been way more efficient if they had taken my order (which included food) and accepted my payment in cash while working out the computer problem. <br><br>The pesto chicken sandwich I ordered took a while to come out and when I finally asked about it, the server looked at the computer and seemed to worry that the order had not gone through to the kitchen so she went back to check for me. I was very grateful for this. Thankfully the order had been filled and she came back with my sandwich in hand, which I quickly devoured and headed on my way.<br><br>The cortadito is still most likely the best coffee I've had in a really long time, and I was pleasantly surprised to find that it was consistently made across different locations.", "pics": null}}, {"review": {"des": "The food was so good the yuca fries were interesting but they tasted good. I had the guava q with Chechen it was really good the sweet and savory flavors blended well. My aunt fell in love with the chimichurri sauce.", "pics": null}}, {"review": {"des": "Needed a quick dinner after shopping on Michigan Ave, and this was perfect. We had the Cubano and the Chivito sandwiches as well as a side of rice & beans. Great choices all around! And the waitstaff was very polite, even as our young daughter was a bit of a terror... We'd definitely be at here again!", "pics": null}}, {"review": {"des": "Authentic cubano food. Quick, fast & ridiculously cheap food (for chicago!), but still feel like you're getting an indulgent lunch. Will come here often when I'm in town!<br><br>STAFF<br>Super friendly<br><br>AMBIENCE<br>So much color everywhere, lots of space, beautiful decoration, and fun, up-beat cuban music. I've come here for lunch (super crowded) and late-night snack (less crowded) and it really feels fun.<br><br>FOOD<br>My platos have always been pretty good -- highly recommend the yuca frita appetizer. I recently also tried a guava and cheese pastry from their cafe section which was delicious when paired with a cuban coffee. 10/10 would do again.<br><br>DRINKS<br>Their Cafecito was absolutely delicious! Slightly creamy, slightly sweet. <br><br>PRICE<br>Reasonable. Thank you for keeping costs low, especially when you are close to the heart of downtown.", "pics": null}}, {"review": {"des": "Cafecito is a solid lunch cafe with a relaxed atmosphere, good food and nice service. <br><br>We had the cubano sandwich and the guava-q sandwich with pork and we thought they were quite tasty. I think our sandwiches could have had a bit more filling but the bread they use is great (crisp and toasty on the outside and soft on the inside) and you can tell the meats are high quality and cooked well so I wasn't too concerned.<br>We ordered the bowl of assorted olives which may have been my favorite part of the meal. They were just the right amount of salty and were thick and juicy. It's a big serving that probably makes more sense for 3-5 people since the two of us ended up only eating half.<br>The colada wasn't the best I've had but we enjoyed it.<br>Bf says he liked his Guajiro (?) cocktail.<br>Cafecito is a great place to get away from the Magnificent Mile hustle and bustle.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rbTwNGIBSNAZ1RtF_C_adQ/348s.jpg", "caption": "Guava-Q with pork and Cubano"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dGZHrkH9-a1ukJiqWpRbBg/168s.jpg", "caption": "A LOT of yummy olives in the Olive app. Highly recommend!"}]}}, {"review": {"des": "FOOD: Wow. So I lived in Miami for several years--the American capital of great Cuban food, and along the way I picked up a Bae whose Cuban mother is the master of great Cuban chefs. So needless to say, I have grown quite the taste for good, authentic Cuban food. And this place certainly hit the spot. I ordered the Shrimp Platillo, which was served in a delicious pool of garlicky butter and citrusy mojo. The black beans and rice were amazing. Cuban-style rice is hard to find well-made, and this stuff definitely made the cut. Plantains were fully ripe. <br><br>The mojo was just perfectly crafted. Good Cuban food is dependent on well-made mojo, and this mojo was very flavorful and citrusy. <br><br>SERVICE: The service was pretty quick. Not much to talk about here. I came with a group, so I didn't have much interaction with the waitress, but she was definitely friendly. <br><br>ATMOSPHERE: This place is tucked away into a building across from the John Hancock, with a cafe-style set-up in the front, and a more traditional restaurant-style in the back. Complete with a full bar in the rear. Great spot to come to alone, with a date, or with a group. It's not very romantic, but you could definitely come with a date. <br><br>Will return, would recommend.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lJqOC_RMDV4D3eH1-P5jvg/348s.jpg", "caption": "Shrimp Platillo"}]}}, {"review": {"des": "DELICIOUS food, reasonably priced, and never too busy! I've been here twice so far and loved it. The food comes out fresh and hot and quick. Portion sizes are good as well. I wouldn't recommend for vegetarians because it's meat based, but I loved both of my non-veg plates.", "pics": null}}, {"review": {"des": "Great lunch every time. Let me just say: delicious. It is also affordable, casual and fast. We never sit and wait for food in frustration. It's awesome that Cafecito has opened several locations now.", "pics": null}}, {"review": {"des": "This place is the real deal. I have been here over a dozen times and never had a bad meal all of which were extremely reasonably priced. The best sandwich I've had is the lechón which is their delicious pork with cooked onions and arugula but you really can't go wrong.", "pics": null}}, {"review": {"des": "Great food and good service. This cafe was quiet, peaceful, and the food was amazing. We let our waiter recommend our lunch and it did not disappoint! The food was reasonably priced too.<br>If you enjoy coffee you must try the Cuban espresso! SO GOOD.", "pics": null}}, {"review": {"des": "Skip the chains in this touristy area--the Cheesecake Factory, the Potbelly's--and head to Cafecito, a locally owned option that super affordable for the area. Specializing in hot pressed sandwiches they have a ton of options on an extensive menu (perhaps lighter on vegetarian choices but there are a few), with Latin American flavors. The bread is tasty and the flavors are amazing. You'll definitely discover some new flavor combinations, and I'd be lying if I said I didn't try to recreate it at home. Try the Caribbean Jerk sandwich!", "pics": null}}, {"review": {"des": "I came here on a Friday night to sit on the patio since it was nice out. I ordered the eggplant salad to start - it was disgusting. However, my sandwich - peanut butter and guava w/ plantains, was totally delicious! My advice is to order a few things to see what you like.", "pics": null}}, {"review": {"des": "Cafecito is a terrific option for tasty, casual and affordable food just a block away from Water Tower Place in the Gold Coast. It serves pressed sandwiches and other Cuban specialties.  I thought the Cubano was good, but I think my wife's Chicken chimichurri was even better.  The side order of black beans and rice were plenty for two and quite good. Almost all the sandwiches are under $7, which seems a steal for the tasty food. <br><br>The ambiance of the place is quite nice--it feels like a cross between an upscale coffee shop and a casual restaurant.  Cafecito also has a small bar, which is great after a long day of working or shopping. Service was good.", "pics": null}}, {"review": {"des": "This place has THE BEST quality Cuban food in Chicago! It tastes very authentic & fresh while the prices are great for what you get. There isn't anything I haven't tried and wasn't super satisfied!! Definitely my favorite spot in the city!", "pics": null}}, {"review": {"des": "Be careful when making large orders with Cafecito-- they may forget! To preface this update, what Cafecito produces is still great. Their sandwiches are solid, and their cafe con leche is even better. <br><br>HOWEVER, I recently was involved in placing a large order (for 20 people) from here, several days in advance. When one of my friends showed up to pick up the order, they said they did not receive the order. When they looked again, they located the order, claimed they had it ready, but hadn't made the order yet (confused? I was too). My friend had to leave, then come back over 20 minutes later to pick up the order once it was ready. We had to call to check if the order was ready-- we heard nothing from them until we called to check. Maybe if Cafecito had been a little more apologetic it wouldn't have been so bad, but I was honestly surprised at how this experience went.<br><br>If you're dining in or just grabbing a quick sandwich or drink, Cafecito is still good. But for catering, beware!!", "pics": null}}, {"review": {"des": "Love the food here. Drinks =  cold and stiff, closely resembles a corpse but still has flavor. Like a zombie. Favorite app to order is the yuca fries , yummay! <br><br>However, despite all these plus pluses, the biggest let down is the service. Make sure you order everything you'll need for the entire visit and don't even think about ordering a second round of drinks. Unless you know someone here, don't expect to be served promptly or attended to accordingly. I'll not be returning when I'm hungry, possibly only for appetizers and a drink. Only one drink.", "pics": null}}, {"review": {"des": "The cuban sandwich is really one of the best I have tasted aside from being in Puerto Rico. The sopa gallego was also delicious and their coffee was super tasty.<br><br>Their prices are inexpensive and the entrees also looked tasty. I would definitely recommend and cant wait to return while in Chicago. I would probably eat here every day.", "pics": null}}, {"review": {"des": "Used to work right around the corner from here. It's really good and quick. I'd definitely be back when I'm in the area. Any of he sandwiches are really good.", "pics": null}}, {"review": {"des": "First time trying Cuban sandwich and I'm in love with it! <br><br>Ordered Pavo (turkey breast, bacon, tomato, lettuce, avocado mayo) and Borracho (shrimp, tomato, jalapeño, chipotle aiolo, latin slaw). Both were great!  Bread was toasted just right, crispy and warm, with a generous amount of fillings. Cheap warm comfort food for this chilly weather. Will definitely come back to have it again when I come visit Chicago!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2gCj3B9HF-ttBmvSNAzC0w/168s.jpg", "caption": "Pavo"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WMyG5Udl434qGkvfs59BLg/168s.jpg", "caption": "Borracho"}]}}, {"review": {"des": "Cafecito is an underrated gem. <br><br>We were looking for a quick place to grab some food and drinks before an event at MCA on a weekday evening. This place was a good find, especially compared to all the overly priced options in the area. We sat in a comfy booth in the back, but their patio would have been nice on a day with better weather. <br><br>This location has a full bar, although some of the others do not. I had a glass of wine, and the pour was a little weak, but my friend's margarita was very strong. I also ordered the margarita sandwich, which was cheap and delicious! <br><br>If you are hungry/thirsty, and want to take a break from whatever touristy activity you are doing in the area, Cafecito is a good choice!", "pics": null}}, {"review": {"des": "This little gem is a hop, skip, and a jump from Water Tower/John Hancock.  You can sit outside, inside, or do take out.  I went with a friend and we both went for the lechon.  Me the platter, him the sandwich. Both served with extra plantains.  My lechon platted also came with rice and beans.  Portions were a good size- I'm excited to have leftovers tomorrow!<br><br>Deliciousness on both orders.<br><br>Waiter was pleasant. He brought out water and a carafe to refill ourselves as needed. Seating is a mixture of high boys and booths in the back, two tops in the front.<br><br>Came here the other day too for a cafe con leche.  That was tasty.<br><br>Will definitely be back.", "pics": null}}, {"review": {"des": "I wanted to try almost everything on the menu, but let's be realistic, that wouldn't have helped my singledom.<br><br>The place: Small, quaint, indoor and outdoor seating. Kind of feels like you might not be in Chicago anymore. It's a little unclear if you're supposed to order at the counter or be served, but it seems like maybe both are okay?<br><br>The taste: We tried a bunch of sides - spicy hummus, mozzarella salad, some other salad. I wanted a sandwich bc they all sounded authentically delicious, but was meeting someone for sandwiches for dinner and just can't do that and feel good about it. Everything was yummy. And nice side portions for the price...which I think is $3 or $4 a side?<br><br>My face: Content. Like that they have some nice coffee offerings too. A great place for a taste of Cuba.", "pics": null}}, {"review": {"des": "This is a nicer cafecito than the one in the loop. They have a good amount of seats, including booths if you prefer waiter service. You have the option to order take out as well with the cashier. <br><br>I tried the lechon. The bread was toasty awesome but I wasn't too fond of the gamy taste. i still finished it with some hot sauce that is standard condiment at each table.", "pics": null}}, {"review": {"des": "This place is alright. Nothing spectacular.<br><br>They use frozen chicken, I'm sure of it. It has that weird texture. Definitely not fresh. That's a shame because if they used fresh chicken and cooked it themselves, this place would be A LOT better. Their sandwiches are decent, but the chicken is so off putting. I've been here twice, and this was my only option as it is open late on Friday and Saturday. I wouldn't come back if I had other options. <br><br>I've had the pollo chipotle, cubano, chimichurri, and I can't remember the last one. (My boyfriend and I have gone). The sandwiches are a 3/5<br><br>Asked for avocado on my sandwiches. The first time they gave me only two very thinly sliced avocado on the whole sandwich. Second time I went it was a better amount. So, I'd say stingy.<br> <br>The staff is friendly and helpful, though. They just need to step up their quality of meats and be consistent. Maybe their quality is low because it's pretty cheap? Meh.", "pics": null}}, {"review": {"des": "I love Cafecito. I work by the Cafecito in the Loop and tried this Streeterville location and surely was not disappointed. A little more formal than the loop location - they have servers that come around.<br><br>The bang for buck here is real - the booze is reasonably priced, and the service, although sometimes slow - is always friendly. Looking for a sub-$10 dinner downtown? Easily doable with about half their menu in that price range.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/k_BGW4T6-fwzD7wMyYWIKA/348s.jpg", "caption": "Chivito with pickles"}]}}, {"review": {"des": "I've gone to another location of cafecito several times but this is my first time in the Gold Coast location. I didn't realize that I would get a sit down service experience. As always the food was delicious I got a shrimp pressed sandwich with yuca fries as well as sharing a couple other entrees with friends. The grilled shrimp plate and their black beans were especially worth noting. I will be back to try more of the menu. Definitely pescatarian friendly and has good veggie options as well.", "pics": null}}, {"review": {"des": "Good food, poor service. I live across the street, so it's convenient. I often order over the phone (1 sandwich for me, 1 for my wife), and it's a 50/50 shirt whether they get the order correct.<br><br>Recently, I called in to order and they put me on hold but forgot to take me off hold. In the meantime, their phone was busy so nobody could call in. When I arrived, I let them know their phone was a busy. They hung up and the phone rang immediately thereafter.<br><br>On the same trip, it took them 5 minutes to input a simple 2 sandwich order into their system because I wanted egg whites instead of regular eggs. Lastly, I requested an itemized receipt because I needed one, and they couldn't produce it due to a recent update on their register.<br><br>Poor service.", "pics": null}}, {"review": {"des": "This spot is gem! Roll thru Yelp fam.<br><br>First off I did not realize there was such a place in downtown steps away from magnificent mile you could eat plenty and drink for cheap. We had a friend visiting in town and were looking for somewhere that wouldn't break the bank and was casual enough. Cafecito? Check & check! Price point we're talking $6 cuban sandwiches or $10 platters served with rice, beans, plantains and your choice of meat. The restaurant has two sides to it. A quick togo side to order out or a sit down side to order and dine in with a bar as well.<br><br>For food, I ended up trying their Lechon (roast pork) platter. Roast pork was tender and sliced thin rather than the pulled pork sort of serving. Although not the best lechon I've ever had, but at the same time the price and serving size was quite the value. For alcohol, only beer and wine were available, but man was it affordable. Cans & bottles of beer going from $3-$5. Wine by the glass was a tad more and even options to grab an entire bottle. Top it off with the excellent service. I can't find any reasons to hate on this spot. Anyways, what a gem! Will definitely be back.<br><br>'Til next time, cheers!<br><br>55/365", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RVcfIhW-DxUHV9gSRxlR1g/168s.jpg", "caption": "\"You're a jerk. You're a jerk...\" a pressed jerk chicken sandwich. Whaaaa?"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/scJlfMiMaKzOxNQZKa75gw/168s.jpg", "caption": "Lechon platter & staying true to the hipster roots with a $3 PBR. Whoop whoop!"}]}}, {"review": {"des": "Cafecito is SO worth the price. The sandwiches are filling and delicious (and most are under $7!). I would highly, highly recommend the yuca frita appetizer to go with. It's big enough to share among several people, comes with a great dipping sauce, and is only a few dollars. Combining these things with a cortadito makes for a perfect Cuban lunch! <br><br>One thing to note is that this place gets pretty busy around lunch time so finding a table can sometimes be difficult. In these cases, you can order to-go at the counter rather than sitting down at a table.", "pics": null}}, {"review": {"des": "Was walking my dog down this street on Sunday when WHOA,  I saw something wonderful. Cafecito now within walking distance of my apartment.  What what! I know the two Loop locations from when I'm down there doing business, but that's not too often. This location has much more seating than either, and there's a full bar in the back! <br><br>Went there for dinner tonight. I had the lechon plate with black beans, rice and plantains--and a Materva soda. The boyfriend got the palomilla sandwich and Jarritos Limon. Four thumbs up. Everything was delicious. Comfy booth seating or bar tables. Clean, bright decor and nice modern restrooms.<br><br>What a great addition to the neighborhood. Hope it does really well. I might go back tomorrow at  lunch for a sandwich. I saw something about pork and guava, and how can you not?? Going to have to try a Cuban coffee as well. They had a lengthy and delicious-sounding dessert menu. I'm sure I'll be back to try it soon.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/O1_NNYupwk7BD-HA5OfWbg/348s.jpg", "caption": "Bottom: Lechón plate with black beans, rice and plantains. Top: Palomilla sandwich."}]}}, {"review": {"des": "I've gone to Cafecito for breakfast a couple of times and oh my...it.is.good! This is an excellent Cuban quick eat restaurant. The location on Wells is pretty small so I always do take-out. <br><br>The staff is always so nice and inviting. Love them. <br><br>I get the bistec con huevos breakfast sandwich. I don't eat beef often but I have to get this sandwich when I go to Cafecito. It is sooooo good. It's a very filling sandwich so you will be full for a few hours. The price for the sandwich is great. It's less than $6 and you are full! <br><br>The café con leche is so tasty. A definite must try. Another offering of Cafecito that's great for the price. <br><br>I definitely plan on going back to Cafecito and I often recommend it to others. I just wish it was closer to my office.", "pics": null}}, {"review": {"des": "I waited for over  10 minutes for someone to even notice that I was in the booth. 4 minutes later they came back and took my order. My food, a cubano sandwich arrived 15 minutes later. It took almost 30 minutes for a drink and sandwich to arrive at my table. Then the waiter tells me not to be angry since I \"just ordered \"!", "pics": null}}, {"review": {"des": "I love Cuban food and this place has such good Cuban dishes! I've had Cuban food in Miami (Miami is widely known for Cuban meals since it's so close to Cuba itself!) and this place tastes as great as the food did in Miami. I've been here summer of 2017 a few times and the staff was always rude (judging by the former yelp reviews, I'm not the only one who feels this way haha). To my surprise, on my last visit a few days ago, they have much friendlier and warmer staff. Great customer service goes along way :) I had the mojo shrimp platter and my husband had one of the chicken platters. Both dishes came with white rice, beans and fried plantains. The food was packed with flavor and they served a good portion, too! Loved the marinade that they used for the mojo shrimp. My husband enjoyed his chicken dish. Being the picky eater that he is, he said it was a little too dry, I suggested he use one of the sauces they had but he refused since they were all forms of hot sauce and he doesn't like spicy stuff, haha. Oh, well! I also tried the guava Mai Tai drink and it was good. I can't wait to frequent this place during the summer time. Delicious food at affordable prices!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zq-YoN0lzFAMM2lBP-yM8Q/348s.jpg", "caption": "Guava Mai Tai"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/baXafla4r7PbitugD0BVTw/168s.jpg", "caption": "Mojo shrimp platter"}]}}, {"review": {"des": "Just around the corner from the Broadway theater. Dozens of sandwiches choices for break lunch or dinner. I've enjoyed the food and the coffees. Friendly employees.", "pics": null}}, {"review": {"des": "No stars are deserved. Ate at the Congress location a few times and it was excellent. 9/18/18 first time eating from the Chestnut location. I received a jerk chicken sandwich with extremely dry chicken, the rice and beans was a full cup of rice with a tablespoon of dry black bean on top, no juice from the beans at all and the guava and cheese pastry was over cooked and dark. I have had all 3 items at the Congress location and again it was good. I called multiple times about the food I received and I asked for a refund. The first supposed female manager was not helpful so I called again and spoke to another supposed manager Suzy. She gave me Michael, the owners email address and I emailed the owner photos of the mess I received that was suppose to be my lunch. At first the emails were going through as undeliverable. I called and spoke to Suzy again and she stated she would contact grub hub and issue a refund, which turned out to be a lie. I still wanted the owner to see the food so I tried emailing him again with 2 photos at a time instead of all the photos at once. When I got off work I contacted grub hub to see if the refund was initiated and was told Cafecito did not issue the refund. Grub hub called them and the grub hub rep said the store wants me to bring the food in. At this point I am half way home to the suburbs, I called and was rudely told to bring the food in for a store credit. I also eventually received an email from the owner offering a store credit as well. After the experience with this location, I will never return to any of there locations and I will tell anyone I know to take there business where it is appreciated. Eat elsewhere!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/d7HMa4KYh8PDgu5eJEogAA/348s.jpg", "caption": "Suppose to be rice and beans. A full cup of rice with a spoon of dry black beans on top."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_u3C18GoxeJ6WkrWEr7q4w/168s.jpg", "caption": "Over cooked guava and cheese pastry that looked like it was bit off, it was cooked like that and it was still sold to me."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oYtQW-nTQk-ASBM0YO0L_w/168s.jpg", "caption": "Over cooked guava and cheese pastry that looked like it was bit off, it was cooked like that and it was still sold to me."}]}}, {"review": {"des": "Food is decent...service is inconsistent.  But not so cheap anymore.  Last night they raised prices by 15% on coffee.   Higher on food.   And they charge a higher sales tax than the city of p 10.25% which is already the highest in the country.  <br><br>And when I asked they seemed proud that the price for food went up by over $2 a plate.  <br><br>I won't be back.  Too many other choices.", "pics": null}}, {"review": {"des": "Super bad experience.  Stunned at the general aloofness of host /servers.  Bartender was just rude.  Ended up abandoning lunch for coffee at counter.  Barista was fabulous as were our drinks.   Menu looked as amazing as all the 4 and 5 star reviews.   We'll definitely try again as everyone has a bad day.  Unfortunately EVERYONE was having a bad day on same day", "pics": null}}, {"review": {"des": "I haven't had any Cuban food since moving here from Miami, so when my friends said we were coming here I was beyond excited. I've got to say, although it's not Miami Cuban food, it was pretty good. Serving sizes are healthy, the flavors are great, and the atmosphere is nice. I had the Pollo Chimichurri which came with rice, beans, sweet plantains, and tomatoes; the beans weren't authentic-tasting and the chimichurri sauce could use some work, but the dish in general was good. A lot of people in our group got sandwiches, and they all looked fantastic, so I'll definitely return to try some of those!", "pics": null}}, {"review": {"des": "This place is the real deal if you are into Cuban food.  My wife and I went for lunch and it was great.  We had traditional Cuban sandwiches, heart of palm salad, and fried plantains.  The plantains were perfectly cooked and had great texture and sweet taste.  We used to live in Tampa, FL and frequented Cuban restaurants a lot.  They have nothing on this place.  The rest of the menu was loaded with great looking dishes we would like to try next time we're in chicago.", "pics": null}}, {"review": {"des": "Best lunch spot in the neighborhood. Love their chicken salad and Columbian coffee. Gets super busy (speaks volume for the food) so I would suggest going a little early or a little later to save yourself from the looong queue!", "pics": null}}, {"review": {"des": "I'm impressed with how inexpensive these sandwiches are! Especially considering the prime time locations.<br><br>2 friends and I walked in, saw the ordering counter, but my friend also saw someone being seated by a host/server type of person.<br><br>Confused, we just decided to walk in and ask the bartender if we could sit anywhere. He confirmed and a waiter came to give us menus.<br><br>I asked the waiter if the counter in the front was only for to-go orders. He explained that you could either order from there and sit down to eat or you can sit down and order from the waiter. I was disappointed in hearing this because honestly, (if you've been keeping up with my reviews, you already know that) I really don't like having to go through a waiter to get my food. IMO, it's an unnecessary middle man that cost me more since tips. <br><br>All in all, the sandwiches were delicious. The tres leches cake was disappointing AF. Where was the caramel flavor? It actually just tasted like a vanilla cake that was soaked in something..<br><br>Things to note:<br>*Order at the counter, sit at the table. Skip the middleman of serving and save yourself of having to tip the % of the bill<br>*skip on the tres leches cake. Unless you actually don't really want cake that tastes like tres leches cake<br>*If you do choose to utilize a server, asking to split checks was easy enough, just let them know ahead of time.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0u8q_nf-9DV8SHWAeEehyw/348s.jpg", "caption": "Tres Leches $3.50"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4ChsC2Fb1xqq8mX1HoF-iQ/168s.jpg", "caption": "Jardin"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BdunewIFPac-Diyx-fwSOg/168s.jpg", "caption": "Lechon"}]}}, {"review": {"des": "Best Cuban sandwiches in the area! My wife and I went there and decided to buy the fuego, steak chimichurri, and ropa vieja. All were delicious. The rice and beans are also seasoned well. Definitely will be sure to come back.", "pics": null}}, {"review": {"des": "This is a rare streeterville gem, and it's getting more and more popular as it should be. The food is absolutely delicious, whether it is the sandwhich or the plate, pricing is reasonable, decent selection of beers and decent pricing, fast service.<br><br>Also the bar service is one of the best, can also watch any important sporting event, they have two (small, but serviceable) TVs at the bar.", "pics": null}}, {"review": {"des": "I am completely obsessed with this place. The menu includes a large number of Cuban inspired sandwiches, and they have full bar service.", "pics": null}}, {"review": {"des": "We love this place. Great food, great staff, reasonable prices and a great location. You can sit outside with views of the John Hancock.  Can't recommend this place higher for a great Cuban meal steps from the Mag Mile. They also cater to vegans and vegetarians. Everything is really good on the menu.  Fresh home style cooking.  The Yuca fritas kill me. Don't  miss the cafe con leche (yes they have soy milk) Wish they one near me!", "pics": null}}, {"review": {"des": "The Cubans sandwich was flavorful and moist obviously anything with pickles and mustard is a great start. The salad was spectacular given it had everything I like - hearts of palm, cucumbers, avocado, olives and a citrus dressing. I can do this place again if I have the occasion to be back here", "pics": null}}, {"review": {"des": "Tucked just a few steps away from the busyness, this place is a gem. Initially, we intended on getting a breakfast sandwich but after reviewing the menu, more of a lunch order was the decision. I'm not a Cubano fan, but I will say out of the few that I've tried in my life, this was a few steps up. I'm still not a fan of the style of sandwich but they did a good job marrying the flavors here. Now...the Borracho....so delicious!! Shrimp, tomato, jalapeño, chipotle aioli, and Latin slaw. If I didn't have other food to try today, I'd go back for that! And fresh Cuban coffee makes the meal that much better.", "pics": null}}, {"review": {"des": "Delicious, delicious, delicious. Food is always satisfying and hearty when we go. I've heard nothing but praises for all the different locations scattered around Chicago. Prices are reasonable too - their sandwiches are the best deal (most are around $5.99, and they're filling!). <br><br>That being said, the 4 stars is because service has gotten increasingly worse recently. Because this is a pretty casual joint, you can pick your own table, and you don't have one waiter assigned to you. Most of the servers are nice, but when they get busy it can be hard to get their attention. I don't want to drag down the reputation of the restaurant with only the behavior of a few, but we have encountered 1-2 servers who didn't look like they wanted to be there, and were very curt/bordering rude. The food was great as always, but having that happen left a bad taste in my mouth. Hoping that this is not a common occurrence, and I have an opportunity to edit this review if we go back.", "pics": null}}, {"review": {"des": "I'm Cuban and I was totally impressed and surprised by this place. The food is authentic and delicious and reasonably priced. The drinks were great. And the atmosphere was low key and welcoming. I loved it.", "pics": null}}, {"review": {"des": "Yum, definitely a fan. <br><br>Came here with a co-worker during lunchtime. When we got there around 12:20pm, we managed to order just before the lunch rush. Wow, it gets extremely busy! I was craving shrimp, so I went with the borracho sandwich. Made it a combo with chips and a drink. We waited quite awhile for our food to be ready, so I was a little annoyed (from hunger). But once I did get my sandwich, I was not disappointed!!!<br><br>The slaw was so crunchy and the vinaigrette was perfect. Very light and refreshing on a hot, humid day in Chicago. The bread got a bit soggy from my walk back to the office, so that was the only downside. Shrimp was cooked to perfection - not overly cooked (like rubbery) but also not undercooked (like too soft). Loved it. Definitely the best sandwich I've had in Chicago.<br><br>I like the decor, but it gets a bit chaotic with all the customers! But they're pros - they handle the lunch rush without a sweat.", "pics": null}}, {"review": {"des": "What a hidden gem in the shadow of the John Hancock Building! A truly delicious assortment of Cuban sandwiches, salads, soups and dishes are offered on their plentiful menu. Their food is not only delicious, but surprisingly inexpensive- especially by Chicago restaurant standards! Don't pass up a chance to eat in their beautiful little dining area or to pick up a carry out from this delectable little restaurant.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xNW9uwTXMuLfvNm-YJ-3oA/348s.jpg", "caption": "Small place. Good food."}]}}, {"review": {"des": "Nice neighborhood spot! The food is always good. I've tried several different sandwiches and everyone has been yummy :) My fav is the borracho (shrimp) one. The ambiance is laid back and chill, there's lots of seating both inside and outside. I've also gotten the guava milkshake - the flavor was pretty good but the texture was off. It wasn't well blended and there were still a lot of ice chips. I would stick to the sandwiches/entrees.<br><br>My main complaints are with the service. It can be REALLY slow during rush times. Also, when I ordered the milkshake and the cashier couldn't tell me what flavors were available (doesn't say on the menu) and after she asked the manager for the flavors she still couldn't tell me what was in them.", "pics": null}}, {"review": {"des": "The Cubano, Jerk, and Steak Chimmicara sandwiches were amazing. The Shrimp Ceviche was some of the best I have had. The chips and salads were also amazing. <br>Craft beer in bottles and cans too. Must eat stop in Chicago", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xmdKldGy_K3W8yiOxyBMpA/348s.jpg", "caption": "#ChurchOfTheSacredBrew"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xeD4PAPVCxLlWBN1ap-Ycg/168s.jpg", "caption": "Good local craft beer selection."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uLWuA0oEx6yXwUM6rFEgLA/168s.jpg", "caption": "Food too good for the photo."}]}}, {"review": {"des": "Had Cuban coffee this morning and came back for black bean soup and a pressed Cuban sandwich for lunch. Highly recommend.", "pics": null}}, {"review": {"des": "This place is INCREDIBLE. I have gotten the Cubano sandwich on several occasions & it is so tasty. The portions are very reasonable as well for the price you pay, which is relatively inexpensive. I also have gotten the arugula salad with chicken which is DIVINE. if you need something quick and amazing, this is it!!! Great Cuban food.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Hc1aqW4_vnMvS_lLfBUVwg/348s.jpg", "caption": "The Cubano. INSANELY GOOD."}]}}, {"review": {"des": "For me, I would rate the food at Cafecito a 3.5, but the service was great and the new space was super nice and clean. This is my second time at Cafecito and I think that I ordered the wrong menu items since I remembered the first sandwich I ordered being much tastier.<br><br>This time, I opted for the Steak Chimichurri Sandwich and the Exotica Salad. In my opinion, I think that the bread was a bit overtoasted so that it was a little TOO crunchy. The steak was also a little overdone so it tasted tough and dry. I really enjoyed the hearts of palm and the grilled shrimp in the Exotica Salad. I will say that the salad was a bit too sour for my taste (because of excessive lemon vinaigrette?)...Normally, I am not a fan of raw onions, but the addition of the red onions in the salad were extremely sweet and helped to balance the sourness of the vinaigrette. Also, the generous portions of avocado given in the salad was a definite plus.<br><br>I will definitely be back to Cafecito in order to try the other sandwiches on the menu (and to try to figure out what that delicious sandwich I ordered the first time was...). Also, the opening of this new location makes it extremely convenient for me to access! Hopefully I will be able to have a better sandwich next time to match the wonderful service I received.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/R0I2Gc3e6D9EueHKgr4PEQ/168s.jpg", "caption": "Exotica Salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qDTmXyivUKuRQTdVWMvWdg/168s.jpg", "caption": "Steak Chimichurri Sandwich"}]}}]}