{"name": "cafe-con-leche-chicago", "reviews": [{"review": {"des": "A very popular and longtime business in Logan Square, Cafe Con Leche has been one of my favorite places to dine. From the friendly staff, great service and all of the delicious menu items they offer.<br><br>The atmosphere here is also fun and upbeat with some background music playing. <br><br>Today we decided to have the chicken burrito suizo, melted cheese and toppings on top with some delicious green salsa! This is a great dish if your really hungry or want to share as its a pretty good size.<br><br>Also ordered three carne asada steak tacos that comes with pico de gallo, cheese and rice and beans.<br>The carne asada quality is very good and always juicy and tender. <br><br>They also have a great michela and margaritas drinks there as well!<br><br>Parking lot is in the back and is always a plus since most places in Logan Square don't have lots.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/unzq7aXdw2B0v4k_kTviVw/348s.jpg", "caption": "Carne asada steak tacos"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1wZxzOrpHYInVDZcSy-iTA/168s.jpg", "caption": "Burrito suizo"}]}}, {"review": {"des": "After having reservations for 6 at 10:45am. We waited for an hour as our we told our hostess that we were all here. However she kept seating people ahead of us. Our hostess was i formed that ALL of our party was here.<br>She still opted to seat other people. Not only was she rude,she showed NO care. Great way to keep clientele.<br>Needless to say we left and as we were getting in our cars we were told \"we are able to seat you now\"<br>To lil too late! Can't comment on their food but their customer service left a horrible taste.<br>So i do not recommend this place as their customer service sucks!", "pics": null}}, {"review": {"des": "Their cafe con leche (coffee with milk for the monoglots) is superb. I'm also a huge fan of their dark mocha which is more of an Aztec chocolate style mocha (dark chocolate with a hint of red pepper flakes and cinnamon / vanilla).<br><br>I've been on a quest for the past 5 years to find the best Chilaquelles Verdes in the city. So far, theirs takes the cake as my favorite and most authentic. The flavor is really intense and the portion is perfect to fill you up but not enough to leave you grotequesly full if you decide to eat it all. Their omelette are also very nice and they have a respectable bar if you want to have a boozey brunch. Their breakfast sandwich, burritos, and Pappas con chorizo are all nice.<br><br>The only not terrific thing I've had here is their Jibarrito, which was very bland and would make any true Boricua in Chicago -1 this place.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KNaoB8ypL2N8yP1NV5oxUw/348s.jpg", "caption": "Fajita sandwich"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ojMOCF84RNHCeC89OdWs3w/168s.jpg", "caption": "Torta Cubana"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7u6R-PUy_hxOiAOq9zJkRw/168s.jpg", "caption": "Torta Cubana"}]}}, {"review": {"des": "WOW! This place is fantastic! I came here for an early dinner and was pleased with everything! The ambience is great, it's trendy and clean. The service was fantastic, the server was attentive to us.  The food portions were enormous and it tasted terrific! <br><br>We walk in and we are seated.  Very cozy and trendy.  The lighting was cool and the windows are large for natural light.  It was clean, I haven't seen a clean place like this in a long time.  There is always someone tending to the cleanliness. <br><br>Our server came and we ordered carne asada fajitas and a carne asada taco plate.  We received our meals and OMG were they huge! The fajitas were piping hot and the tacos looked amazing.  I couldn't wait to dig in.  The fajita steaks were cut large and they came with guacamole.  My dining guest didn't get the actual tortilla bread, rice and beans because of diet restrictions, and they were friendly to that.  The fajita plate was loaded with meat and veggies and the flavor was phenomenal. The taco plate was just as tasty.  It had cotija cheese, guacamole and a generous portion of steak. My guest was jealous of my plate, as I was jealous of his. <br><br>The prices are great, it's not expensive, and I would pay way more than what I did.  It's a trendy Mexican restaurant with traditional portions and fare. I can't wait to come back. This is definitely two thumbs up.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CRwrVOHy-Qg_uKgt7KOGfg/168s.jpg", "caption": "Asada fajitas were piping hot!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vZgmxT4PtaS2ZW8T2lwtPA/168s.jpg", "caption": "Asada tacos tastes as great as it looks!"}]}}, {"review": {"des": "UPDATE: I went here for brunch today and I asked for a bacon egg and cheese omelet. Our waiter said yes and could substitute everything out of the Denver omelette and replace it with bacon and cheese. What came out to me was an overlooked flat piece of scrambled egg folded over two overly fatty pieces of bacon and 4 slices of kraft singles on the outside. I expressed how gross this was to the waiter and that this was not an omelette, yet he did not apologize, attempt to rectify the situation, or even take it off the bill! This is the second time I've had less than acceptable service here and it's disappointing. <br><br>My friend lives very close to this restaurant and I passed it all the time so I finally decided to try it. My friend and I went to brunch here and came right at the perfect time. It can get crowded ! I ordered the French toast with a side of bacon and scrambled eggs. The reason I did not give 5 stars is due to the eggs! They had no flavor and were cooked for too long. I didn't end up eating any because they were so sad. The French toast on the other hand was PHENOMENAL. Light and fluffy on the inside and the perfect amount of crisp for the crust. Topped with powdered sugar and add your own syrup, you'll be in heaven ! The bacon really intrigued me because it tastes as if it's been marinaded in lime and slightly grilled. So good! Lastly, the service was very quick and everyone was polwill be back to try other things for sure :)", "pics": null}}, {"review": {"des": "I came here for my weekend birthday celebration and it was a great time. The servers were very kind and accommodating. The place has a romantic/Latin vibe. Great for late dinner. The flan they gave as a birthday gift is delicious! The bartender was kind enough to give us a round of shots on the house  I recommend this place.", "pics": null}}, {"review": {"des": "Mostly disappointed with the service. Got a bit of attitude from the staff. We had a party of 9 and they wouldn't let us sit until everyone showed up; she kept telling us that part of our party was here, but there were people that we didn't know- she seemed frustrated when we asked who else was in our party (is it unusual to eat dinner with people you might not know in a big party? I didn't think so). Then the table we ended up sitting at was empty the whole time we stood at the bar. <br><br>The food was okay. The fish tacos were crispy but kind of dry. Rice and beans were nothing special. My bf got the Cochinita Pibil and I've never seen him throw away food... he said that it was super dry and bland. <br><br>The cherry on top was when the server informed us that our group of 9 would only be able to use 3 credit cards for payment and were pretty mean/stern when we asked for any other easier way to do it. It's 2018 guys, please consider changing your policy; this is one of the few restaurants I've encountered with it- many only carry credit nowadays.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PvMW-k9UsQ3P4nNHdRBDmQ/348s.jpg", "caption": "Fish tacos"}]}}, {"review": {"des": "I've only gotten carryout but was very very pleased :)<br>Might be the best jibarito I've ever had and the only place I've ever been able to get a blackbean patty on my jibarito.<br>Soo good.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-XYsG_DhSBBZHCuUIJPntg/348s.jpg", "caption": "Jibarito.. best I've had"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/enbhp7VMXvEGLsmhKMuuLQ/168s.jpg", "caption": "Jibarito.. so happy I can get a black bean patty"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eUEQZo2jBc8XS8sFEY7D-g/168s.jpg", "caption": "Carryout, great attention to packing detail.. jibarito with rice and beans"}]}}, {"review": {"des": "Seeing all the ratings and passing by several times, I was excited to try it out! Swung by after watching a movie at Logan Theater around 530. There were a couple tables, but still many open tables in the two different rooms. I ordered the Torta Arepa and my friend ordered the Tacos pescado, which came with a side of Spanish rice and refried beans. The sandwich was filled with meat, guacamole, and pico. Parts of the bread were a bit tough to chew. <br><br>My friend and I both agreed that while we enjoyed our food, it wasn't anything too special - just average. It didn't live up to the hype that we both read about or saw.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RmP9q5OtH1OPlMQT-4EgWg/168s.jpg", "caption": "Tacos pescado"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rpo4JxJftixyPJgOZO-j-Q/168s.jpg", "caption": "Torta Asada"}]}}, {"review": {"des": "The enchiladas de Mole were very good (I'm picky when it comes to mole) the sauce was not sweet and had a slight kick to it. We also had the ropa vieja which was also tasty. For dessert we had capirotada with the vanilla ice cream and a cafe con leche, both were also really good. We will Definitely be back!", "pics": null}}, {"review": {"des": "Chilaquiles was STELLAR. Comes with a bit of a wait but it is worth it. Cafe con leche comes in a big mug and is excellent with the optional Kaluha shot. Food came out of the kitchen mere minutes after ordering. Everything was hot and full of flavor. The salsa verde was one of the best this white girl has had. Adding to favorites to come back soon, what a great find!", "pics": null}}, {"review": {"des": "Excellent food and beautiful presentation. Great drinks - love the happy hour special! Not to mention the cute bartenders... what's not to like!?", "pics": null}}, {"review": {"des": "Love this spot in Logan Square, I have been a handful of times. I went in on a Sunday around 11 am and had a great meal and experience. The space is nice and cozy, with a fireplace, good music and seating that was comfortable and modern. I ordered the Chilaquiles Verdes and it was a great tasting authentic Mexican dish! I will continue to come as long as I live in the area!", "pics": null}}, {"review": {"des": "Just tried this place for the first time and it's probably one of my favorite brunch spots in Chicago. I ordered the Huevos Rancheros and it was delicious. It was my first time having it with an over easy egg but not complaining at all. Above was slightly spicy salsa, below was a crispy tortilla, and on the side were rice, refried beans, and a stack of tortillas.<br><br>It was bustling yet without a wait - exactly what I look for in a brunch place. Plus a solid reggaeton selection on the speakers. Our server was really friendly and very attentive, as was the rest of the staff. They're incredibly efficient; our food came out no more than 10 minutes after we ordered and our finished plates were cleaned up immediately.<br><br>There are some high tables and seats at the bar but majority of the seating consists of long rows of empty tables against the walls where one side is a chair and the other is a booth. On the edges of the rows, however, there's a table where both sides are chairs. We were seated at one of those tables and asked if we could sit at the one next to us. Our hostess let us but did so begrudgingly, which slightly bothered me, but I understand that restaurants follow a seating order. The tables are pretty close to each other, which I've come to realize is a norm in Chicago given property prices.<br><br>Huge plus if you're driving: free parking in a private lot behind the restaurant!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Zs2xiYb6k0V26aVJrakSMw/348s.jpg", "caption": "Huevos Rancheros (tortillas not pictured on the side)"}]}}, {"review": {"des": "I've heard many great things about this place and I was very happy to see it lived up to my expectation. They served cafe con leche which is my favorite type of coffee. The milk is steamed before it is added to the coffee. <br><br>I ordered chicaquilles with chorizo. It includes scrambled eggs, rice, beans, tortilla chips, and salsa verde. The food was amazing, the chorizo wasn't too greasy either. <br><br>Service was excellent. I had no reservations on a Sunday brunch and they were able to get a table for two in less than 15 minutes. Highly recommended this place if you are looking for something different than an American Brunch.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vbcQK9bdqGq1-zUmEyxBlQ/168s.jpg", "caption": "Chicaquilles with chorizo!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/s5FvLi814SL-Uq4rH3407w/168s.jpg", "caption": "Arroz con leche! Fried"}]}}, {"review": {"des": "No, I'm not celebrating anything and no, I don't want a drink.<br><br>Server was nice and very attentive. Seated promptly and reserved via OpenTable.<br><br>Flautitas - as an appetizer. Three tiny flautas, hence the \"itas\" part - definitely not worth the price but the taste is on point for fancy flautas. <br>And the presentation is there... see pic - but it's dark. That's why it's Cafe de Noche at night. lol.<br><br>Very romantic atmosphere and good for dates.<br><br>Fajitas De Bistec (Steak Fajitas) for the price I'm pretty sure you can go elsewhere for a lot less.<br>The taste however was on point and I cannot complain about that. They give you five corn or flour tortillas. I could've probably used a lot more - so I took half the meal home and made my own tortillas and had enough for lunch.<br><br>Tiny portions of Guacamole, Mexican style rice, and Refried Beans... pretty standard tasting - not quite impressed by it. You might think different.<br><br>Jibarito - my hubby's plantain steak sandwich with again, the tiny portion of white rice and black beans - pretty standard as well. <br>The sandwich itself was good. I'd probably order that for the price, but I'm not personally fond of the $1.25 charge for Chihuahua cheese when I can go the store and get a big bag for $8-10 depending where I go... insert eye roll here.<br><br>Positives: <br>Nice cozy place - mirrors make it look bigger<br>Nice parking area - spacious<br>Service - Prompt for a Saturday evening<br>Taste - On point<br><br>Negative:<br>Pricey for what it is. <br><br>Take it or leave it.", "pics": null}}, {"review": {"des": "I've never been to the actual location, but I did use this spot for a catering order. I worked with Victoria and Tony and they were very responsive by email in helping me determine the right amount of food for my guests. I ended up going with a variety of 40 empanadas. <br><br>Empanadas were tasty! I think everyone's favorite was the shrimp. The delivery arrived on time to my destination and since my destination was down the street (The Walk-in) there was no delivery charge. I would totally order from here again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/O9faYlllGDrGwfne9Q8I8w/348s.jpg", "caption": "Empanadas"}]}}, {"review": {"des": "I had dinner with friends tonight at De Noche Mexicana. I was looking for a neighborhood spot with an outdoor patio. I am so happy with my choice!<br><br>The atmosphere, service and food were all amazing! The restaurant itself is adorable. Open air tables in the front offer a street view. Brick walls warm up the room. We sat in the back patio area that is small and quiet. And then there was the server. She was cute, bubbly and sooo helpful. A real gem. <br><br>We ordered plantains as an appetizer with guacamole and chips. Entrees included tilapia in a light tomato broth. Chicken with mole sauce. And a shredded pork torta that had plantains on the outside instead of bread. Bread pudding was on deck for dessert. We all shared and everything was sooo tasty. <br><br>The garlic butter and hot pepper mashed potatoes are worth remembering. The free parking lot in back is a bonus!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TggDvtx01qoW_M4XOEgjCg/348s.jpg", "caption": "Bread pudding"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XDXcBBFpe3PnOWfHnkDskA/168s.jpg", "caption": "Plantain shredded pork sandwich"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jPwMj1PxXVXggn5XRAWMyw/168s.jpg", "caption": "Mole chicken"}]}}, {"review": {"des": "Great Mexican food in Logan circle. You can get a nice fajita plate here and they have good cocktails. Some of the other Mexican joints in the area only do tacos, this place has all your favorite Mexican dishes.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/j1Vm8p7i8HI3nsaadOyjgg/168s.jpg", "caption": "Chicken fajitas"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3mQRHdO1eawui9bwo920Qw/168s.jpg", "caption": "Chicken and steak fajitas"}]}}, {"review": {"des": "The huevos rancheros are hands down the tastiest I've ever had. They do have a kick to them so if you're not into spicy maybe order a side of sour cream to tone it down. <br><br>Also I highly recommend ordering cafe con leche. If not the food, this tasty coffee will keep you coming back for more.", "pics": null}}, {"review": {"des": "After hearing my son raving about this place, finally had a chance to try out during non-peak hours. Delicious food, excellent service, can't go wrong! <br><br>I had the chilaquiles (made in a green sauce - not spicy). They were excellent. Complimented with tasty rice and beans. Son had the Cuba sandwich which is his favorite item on the menu. <br><br>Parking in the back, expect one hour waits during peak times. Friendly service. Will be back!", "pics": null}}, {"review": {"des": "I got the Huevos a la Mexicana. While the egg was cooked perfectly and the vegetables were fresh and crisp, overall it tasted bland. Definitely recommend putting the rice, beans, and egg into the tortilla to compensate for the blandness. And drizzle some sauce on dat. <br>I came in at 9:15 and there were only a few parties but 30 minutes later almost every table was full. My waiter, Arturo, was attentive and had kind eyes. The food came out real quick.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gNQeI93i7lizPN7LUaKpag/348s.jpg", "caption": "Menu as of 4/7/18"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/24ugforCfq5bM07FuZ1MqA/168s.jpg", "caption": "Cafe con Leche"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/u2L0H7Nv6ihmPz9sPUs6Qw/168s.jpg", "caption": "Huevos a la mexicana - pretty bland"}]}}, {"review": {"des": "Cafe con Leche is a popping spot right in the heart of Logan Square.<br><br>I went on a Saturday around 11:30am and it was totally packed with people, we got the last table in the cafe. Service was really friendly and attentive throughout my time at Cafe con Leche. <br><br>They have a huge menu with tons of tasty sounding options for breakfast. I stayed pretty basic and got their Egg Sandwich for $10. It comes with two scrambled eggs on french bread and then you can choose a meat - steak, bacon, sausage or ham. I went with bacon because it makes everything better. They asked if I wanted lettuce, mayo & tomatoes and I said no thanks, but my sandwich came with them anyways. Not a big deal but ya know...the details. You can also add cheese for $1.25 and/or avocado for $1.50 which could make this a pretty priey breakfast sandwich if you get all the bells and whistles. It does come with a side of house potatoes. <br><br>The sandwich was A-OK but wasn't the best I've had. Honestly, once you've had the sandwiches from La Nonna, it's like nothing else will ever compare. Though I was disappointed by the sandwich, I'll def come back again - need to try the Arroz con Leche on my next stop in!", "pics": null}}, {"review": {"des": "Okay, so the food here was incredible and they do a great job at quick service. I mean we thought we would have to wait for a long time to get a table for Saturday brunch but when we saw how fast they are at making and serving food, we understood how they manage to turn over tables so fast. The coffee was great quality and the chorizo was delicious! I especially love their house made sauces they bring to the table.<br>My only complaint was that my server was kinda bad. He wasn't mean but he never checked on us nor introduced himself. He seemed kinda over it. Which I get it, if you've been busy all morning id be over it too. But it just made the experience a little rushed and unwelcoming. But the quality of food is great here and I'll definitely be coming back.", "pics": null}}, {"review": {"des": "Met my friend here for lunch the other day. I really liked it.  Someone recommended the soup, and I am glad she did.  I tried the beef and it was fantastic with the broth, the lime, the fresh cilantro, the rice, and all of those generous helpings of vegetables! <br><br>Also shared an order of fresh guacamole. Yum.  <br><br>And I had the bistec sandwich with rice/beans.  I was so full I had to take the sandwich to go (and I was happy to have it later!) <br><br>Nice ambiance.  Easy to get to from the blue line Logan Square stop.", "pics": null}}, {"review": {"des": "Fast service and great food. They also not only have happy hour from 4-7, but also have specials for every night of the week. I went last night (Tuesday) so obviously got a $6 glass of sangria. Not bad! My jibarito was delicious and I would highly recommend. Server was very attentive, helpful, and nice.", "pics": null}}, {"review": {"des": "Highly recommend! Food is delicious. I've been for both brunch and dinner. Each time, exceeding my expectations. Would recommend, as it's a great addition to the neighborhood.", "pics": null}}, {"review": {"des": "This place is located in the Logan Park neighborhood. Came here on a Friday night.  Place was packed (although it is cozy, small intimate place)  The food is made from scratch (hopefully I'm right) because it took 45+ minute, close to an hour for the food to come out I had the Fish Tacos.  It was a lot of food.  I thought it tasted ok/average.  The customer service was alright as well.  Not the greatest but wasn't the worse.  When it comes to mexican cuisine, I actually prefer less scale type places.  The ambiance was nice but being too fancy loses its authenticity.  Overall it was alright, definitely had better.<br><br>Grade: C", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/s1Tzqqcq8jXsntRtZLqWTQ/348s.jpg", "caption": "Fish tacos"}]}}, {"review": {"des": "The quality of the food has gotten better but portions are smaller.  Waiters and waitresses are rough and not very friendly. It all made sense when they brought the check over and 20% gratuity is already included in my bill. They definitely don't have to put much effort when they already know they're getting a guaranteed tip.<br><br>Either way, I would recommend prices be reviewed. I'm all for paying a lot for a good meal but these prices don't match the service and portions.", "pics": null}}, {"review": {"des": "When both my colleagues wanted to have breakfast at \"Cafe con Leche,\" I was excited since this place had been on my bookmark for a good period of time.  <br><br>We weren't able to \"desayuno\" our morning away.  We all had a mandatory training for work.  However, we made it there for their \"de noche Mexicana.\"  <br><br>I couldn't pinpoint when I had my last Margarita...maybe in college?  We all chipped in and got ourselves a pitcher of original-flavor Margarita ($32, as of 04/13/2017).  The drink was pretty strong, so I continued pacing myself with water, and meanwhile, waiting for the ice to melt.  <br><br>The food was also fantastic.  One of the girls got the \"molletes,\" featuring French bread, chorizo, chihuahua cheese, and pick de gallo ($7.95).  They definitely complemented the margarita, for drinking with an empty stomach was never wise.  <br><br>For the entree, I went with my first instinct: chilaquiles de carne asada ($13.95 + $4 for any meat option).  The egg was cooked exactly what I asked for: over-easy.  The salsa verde was semi-spicy, yet I didn't sweat while consuming it.  The portion was large enough that I took the rest home.  <br><br>I couldn't really comment on hubby's \"bistec encebollado ($14.95).\"  Although it was a girls' night-out, I took care of his hunger and got him an order to-go.  Well, he did seem to like it just fine because it disappeared within ten (10) minutes.  <br><br>The server was friendly and willing to split out checks equally between three (3) of us.  Please note that it's the maximum number a ticket can be divided into.  In other words, if you're with a party of four (4), they cannot allow the check to be separated with four (4) different payments,  <br><br>Oh also, there is free parking behind the restaurant.  In addition, CTA Logan Square Blue Line station is only one (1) block away.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PaaD9AE6xHGMvZcoeUoSzw/348s.jpg", "caption": "chilaquille de carne asada"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eyVTi7LH1sJ-DGnmn_L9-Q/168s.jpg", "caption": "Margarita"}]}}, {"review": {"des": "This is a great brunch spot! There's parking in the back, but there was a little bit of a wait.  It's a small place, but very good.  The service is good, and they are very fast.   They have food for everyone, too, including my very picky friend.  The jibarito was very good, and the sauces they bring out are excellent.  The coffees are very large but worth it!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TFCa7v8Cmn5XJDG59-ZfoA/168s.jpg", "caption": "Cafe con leche"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BdNVzXNJoLt1buz7gI9Gow/168s.jpg", "caption": "SteK jibarito with avocado"}]}}, {"review": {"des": "This place is very cute. The food is good and the bar is a great place to sit and drink a cocktail before being seated. The best thing they have is their enormous cups of cafe con Leche.", "pics": null}}, {"review": {"des": "No wait, great service, and amazing coffee. Cafe con Leche pretty much killed it on the brunch front.<br><br>On a beautiful Saturday morning, there was no problem getting a half indoor/half outdoor table facing the street. The waiter was super nice, explaining the menu and the drink selection. <br><br>As you might guess, the Cafe con Leche was FANTASTIC. I could drink that for every meal until I die. (I'm allergic to milk, and they happily accomodated with soy.) Don't sleep on the coffee!<br><br>Then, I had papa con chorizo, which was really good. The only thing would be that my potatoes were not necessarily the best, and seemed like they had been sitting there for a while.", "pics": null}}, {"review": {"des": "Came in and was able to get seated right away but it took awhile to get my drinks and get my order taken. Server Jorge with curly hair didn't even really come to ask how things were which was very rude because other servers around were checking their tables on how they were doing. It even took for ever to get my check. Was very disappointed on the service food was ok.", "pics": null}}, {"review": {"des": "If you're looking for amazing brunch and you're in Logan Square, you better make your way over to Cafe con Leche. The coffee is great but the true winner here is the chilaquiles. Delicious delicious delicious! Fried tortillas drenched in tomatillo with cheese, crema, three eggs with a side of rice and beans. The ultimate breakfast. <br><br>I've ordered the chilaquiles in the restaurant twice and ordered it as takeout once (but probably again soon). Quality is always there and it's always incredibly filling. And if you're hungover, this definitely hits the spot. <br><br>Chilaquiles are my go to brunch food and so many times, restaurants do not know what they're doing. But at Cafe con Leche they knock it out of the park every time. <br><br>Highly recommend Cafe con Leche.", "pics": null}}, {"review": {"des": "Visited last night; it was a quite day only few tables filled with customer and i believe we were the last ones to leave.  Food was delicious; staff was very friendly.  We ordered sangria which were not so impressive; I had their salmon and my friend ordered chicken burrito.  Salmon was well done, thought edges were kind of dry.  There was a cream sauce which was amazing; added a perfect touch.  I also asked to replace greens with cactus salad which again was delicious.  I would have liked more of it; picking thru i realized they bedded salsa and topped it with cactus salad.  Chef tricked me but it's ok, I was happy they honored my request.  <br><br>If you enjoy spicy food, i don't recommend fish.  Burrito will wake you up, fish is definitely flavorful just not spicy.<br><br>I'm pretty sure i'd come back again.", "pics": null}}, {"review": {"des": "Went here for dinner on a Sunday and there was no wait.  <br><br>For dinner we ordered-<br>Pollo en Mole Poblano.  The mole sauce was good and the chicken was moist.  The dish comes with rice and beans.<br><br>Jibarito- the steak was good and the onions really complimented it.  The plantain were crispy but a little too think.  I really enjoyed the dish but wished it was not as greasy.  I had grease slipping down the side of my hand every time I bit into the sandwich.  <br><br>Cocktails-<br>Aloha Mexico was good- a summer drink with fresh pineapple.<br>Mezcal Mule- good old fashioned, nice use of mezcal instead of vodka (made the drink nice and smokey).", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NbhR8dc-NMLINVeB9tJ9xA/348s.jpg", "caption": "Pollo en mole."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eZkCrvEm2IlBdFcWaWcRgg/168s.jpg", "caption": "Queso fundido."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tb1oYXCGxp2GrPkwg6Lpcg/168s.jpg", "caption": "Jibarito."}]}}, {"review": {"des": "My husbands first time going and he enjoyed his plate !!<br>( he just mention \"I need tortillas w/ this carne\")", "pics": null}}, {"review": {"des": "I went here last night with a group of friends and I have to say I was blown away.  Not only was the food delicious, but the customer service was impeccable !!  I swear their fish tacos are the best I've EVER had and I am extremely picky when it comes to fish.  I definitely will be going back !!  <br><br>**If your not sure what drink to order their passion fruit margaritas are really good!", "pics": null}}, {"review": {"des": "Went for brunch today, the service was really slow and when the food eventually came out, it was cold, I was so hungry and in a rush that I just ate half and asked for the bill, versus waiting another 30 minutes or more for a replacement meal. I told the waiter this and they didn't really seem to care, was billed the full amount. I would say not to bother going here, as the service was not good and the half meal I ate was also not very flavorful.", "pics": null}}, {"review": {"des": "The food was delicious! Our server was so nice and very helpful. We had a larger group and he really handled himself well by giving everyone advice on the menu. <br><br>Everything we ordered, from appetizers to dessert & drinks, we had no complaints on the food. <br><br>The only low point of the night was when the manager kicked us out of our booth because we were taking too long to finish up. I guess it's not really a great spot to eat great food and enjoy camaraderie all at the same time. Maybe it's because the place was small? But we definitely weren't just there for the cafe con leche, we had a pretty hefty check and even ordered meals to-go. It felt weird to have to be rushed out of our seats when we were already putting our jackets on to leave.", "pics": null}}, {"review": {"des": "This was my first date place after six years I will say this place still has it.!!!! For the price the portion sizes are huge. The Jibarito is my favorite dish here!! But the whole menu is awesome. Drink are great !!!! But I will have to say the one busboy needs a hug.", "pics": null}}, {"review": {"des": "Really great brunch spot! I highly recommend getting the breakfast burrito!!!<br><br>I got the bacon, eggs, toast but when I tried my friend's breakfast burrito I knew I had messed up!<br><br>The food is super fresh but I feel like there is crack in that breakfast burrito!!!! SO GOOD. <br><br>I got an orange juice too- super freshly squeezed!!! <br><br>I heard the coffee with milk is really good but I don't like hot coffee so I didnt get to try. <br><br>If you are in the logan square area- I highly recommend!!", "pics": null}}, {"review": {"des": "This Is my go to spot for dinner in Logan Square.  The staff is attentive and friendly. Food is always on point! Highly recommend.", "pics": null}}, {"review": {"des": "I had the most horrible experience in my entire life in this restaurant I will never step a foot in this place ever again! so I came in today for some dinner had my waitress very nice girl, so what went wrong? Right  I clearly told her I'm Allergic to sea food so don't bring me anything out that has to do with it & of course one of my empanadas had shrimp in it guess where I ended up spending my night The hospital! Horrible place! I should sue them!!", "pics": null}}, {"review": {"des": "I've been a regular at Cafe Con Leche over the years and they really don't disappoint. Brunch is great here. Definitely more brunch and breakfast options than at dinner so be sure to come in the morning or early afternoon. The menu is pretty pricey, especially if you want mimosas or sides but when you order a meal the serving size is nice, usually enough to take home for later too. The food is hot and good and the cafe Con leche is a nice way to start the day. The seating is nice and organized but slightly crowded when busy. I will always be a fan of this little gem.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1azxjlW_QWCfcDxWFsYw_g/348s.jpg", "caption": "Cafe Con Leche"}]}}, {"review": {"des": "So happy on this sunny Sunday morning with my big mug of cafe con leche, steaming hot with just the right amount of sugar. Add to that great ambience (music and decor), open air to the street.  As if this could get better, it did.  Veggie Torta for me, flavorful with the perfect toasted bread. Hubby had chilachiles verde---he proclaimed better than my sandwich. I'm not so sure, buddy. Wonderful service.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kg4TDwIcrOJNy8zxQ0OjdA/168s.jpg", "caption": "Choices, but have to go with the top"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NRYRXBL6OvOS4WgjUCJaPA/168s.jpg", "caption": "Happy, so happy"}]}}, {"review": {"des": "Sat at the bar and my boyfriend and I had fun with a pitcher. Great vibe and will definitely be back for another margarita. I think it's my go to margarita spot in the city.", "pics": null}}, {"review": {"des": "The black bean tamales and the flavors are amazing.   A really good recommendation we received from a local!", "pics": null}}, {"review": {"des": "Fabulous place! Love the quick service! Try the chilaquelas the green salsa is the best!", "pics": null}}, {"review": {"des": "De Noche is a great Mexican Restaurant to have in the Logan Square area.  I've been to a couple of the other restaurants owned by this restaurant group, and I've been constantly pleased by all of them so far.  <br><br>The service during my Friday night visit to De Noche was really fast.  The waiter was attentive, and our food came out around 5-6 minutes after we ordered.  Almost every seat was filled in the restaurant, so the fast service was surprising. To drink, my friend and I both had margaritas.  I had the blackberry margarita, and I thought it was a good balance of sweet and tart.  The margaritas are average sized, and priced the same as most margaritas in the area.  <br><br>I ordered the enchiladas stuffed with with chorizo/potatoes for my dinner.  The chorizo was low on the grease, which I appreciated. The verde sauce used here is excellent, and the waiter even gave me a little extra (which I poured over my rice and beans). Overall, the meal and service was enjoyable.", "pics": null}}, {"review": {"des": "The service here is awesome. Everyone is always super friendly, and the food is delicious. I've been here numerous times and every time I'm pleased with the experience. Would definitely recommend!", "pics": null}}, {"review": {"des": "This place is super solid in terms of both food and service. We've been several times, just us or with other couples, and it's consistently consistent. Being a pescetarian, I sometimes have limited options dining out. However at De Noche, I tend towards the chiles rellenos or chilaquiles and am never let down. I usually taste her (meat) dishes too, and they've always had tons of sabor (flavor). I think we've had nearly every appetizer as well, again with no disappointments. <br><br>In addition to the food and always attentive-but-not-too-attentive service, the place is decorated and lit well, romantic even. It can get somewhat loud if you're seated near a large party, but that's part of the atmosphere. I should mention the drinks are all excellent too, with great happy hour deals. We've had the margaritas, mojitos, sangria, in addition to wine and their decent selection of beers.  Modelo and Revolution on tap? Yes please! Oh yeah, the horchata is also to die for if you're going the non-alcoholic route, which we did one time ordering for pickup. <br><br>We had wanted to come here since before we lived in the neighborhood. That we live five minutes away now makes De Noche an even easier choice. We plan to come back soon for their breakfast, billed on the sign out front as Cafe con Leche. Evidently that menu is more Cuban-esque. Yum.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7uEOU4YjTxHJ3Y7pUhZ3mQ/348s.jpg", "caption": "chilaquiles on the left, cóctel de camarones on the right, smiles all around (not shown)"}]}}, {"review": {"des": "Delicious food, great service, great atmosphere! First time here,  will definitely be back. Went on Easter Day, it was packed but this did not affect the attentiveness of our waiter. We ordered and the food did not take long to be served to us. I had the chilaquiles verdes with steak, very flavorful somewhat spicy, but tolerable. I also had a michelada, pretty good too. Overall great experience.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4_nAAi7gHfHlflRNVxFCfg/348s.jpg", "caption": "Chilaquiles Verdes with steak, highly recommend eating!"}]}}, {"review": {"des": "The food here was spectacular the boy that worked was a cute and had a butt on him to die for !! Jeeeeeesuzzz anyway the service was goood and it was packed but we got seated pretty fast !", "pics": null}}, {"review": {"des": "Love this place! After talking about going here for months my boyfriend and I finally tried it and it was great! The first time we went he was a little disappointed in his Cuban sandwich but my bistec sandwich was amazing! I've gotten the bistec sandwich every time while my boyfriends tried different menu items and enjoyed them all especially the fajita sandwich which is massive! Love sitting at the bar and watching the cubs game. Service is great as well. Highly recommend!", "pics": null}}, {"review": {"des": "I have always come to this restaurant. I was a regular even before they had a bar. I moved to FL and always made it a tradition to pass by and eat. The food is great... but today was a not so good experience.  7 months pregnant, waiting on my sister and mom to show up, who were close by and was refused to be seated till the whole party arrived. I didn't feel welcomed like I used to. Here from FL for a few days, 7 months pregnant and everyone that comes in is being seated. Which in turn means we have to wait longer. I could have already ordered a coffee and something to eat. Not sure if I want to waste my time coming back here while visiting from FL.", "pics": null}}, {"review": {"des": "Terrible food. Would rather drink horchata off a taco truck then sit down at this restaurant and eat.<br><br>Jokes aside. Their enchiladas gave me food poisoning. I vomited twice. Staff was rude.", "pics": null}}, {"review": {"des": "This is my one of my favorite place for chilaquiles verdes and enchiladas de mole! I recommend it! Don't forget to try the cafe con leche which is amazing and a good portion too! I love the environment and customer service here. The waiters are always so friendly.", "pics": null}}, {"review": {"des": "Really disappointed in my meal here! I wanted to love it because I pass it often and their instagram game is stronggg. I ordered the black bean tamales and the calamar. I picked up my food to-go, so I can't comment on the customer service, but the food was under par for me. The tamales were HARD. Like, it was even hard for me to cut into them, and they were tasteless. The calamar was pretty decent, but I was overall turned off by the tamales. <br><br>My friends got their steak dinner plates that both looked good, but I wish their food quality was consistent across all their menu items. I ended up throwing more than half of my tamales away.", "pics": null}}, {"review": {"des": "Rude staff...<br>My husband ordered the steak & eggs for $14, incredibly the steak was tiny (smaller than my hand) and thin. I ordered the burger which was ok but eating it was quite torturous after waiter had disrespected my husband during our ordering. Won't be back.", "pics": null}}, {"review": {"des": "I've only been here for brunch but it is my go-to stop when I'm craving some Mexican rice! Their margaritas are always delicious, and the huevos con bistec is my favorite item on the menu. It's normally packed around brunch time, but if you're just with another person or two and there is room at the bar, sit there. The bartender is so friendly, food actually comes a lot quicker up there, and who knows, maybe you'll get a free shot from him ;)", "pics": null}}, {"review": {"des": "Great Brunch Place in Logan Square ...<br>Love that it's so close to home and with amazing food..<br>Chilaquiles Verdes are my go to never disappoints me !<br>Great drink selection as well Agar Fresca D Tequila on my top list.", "pics": null}}, {"review": {"des": "Friendly staff. Delicious food. Consistent. Chilaquiles are highly recommended. Free parking in the back of the building is a game changer!", "pics": null}}, {"review": {"des": "Like the place, good food but prices a little extreme.  Great chilaquiles and also great huevos rancheros.<br>Truly great Cafe con leche.", "pics": null}}, {"review": {"des": "Would give ZERO star if i could! <br><br>We came as a large group to celebrate a friend's birthday, and man was it a bad time.<br>Horrible food, sub-par service, definitely does not worth the hype nor wait for the food to come out. <br><br>Drinks were ok to begin with which gave us some hope for the food as they were taking forever to bring the food out, and we did not even get our entrees at the same time!<br><br>Where do I even start with such horrible experiences?... soggy calamar fritto, flavorless guacamole, very bad mole sauce that caused my friend FOOD POISONING and SICKNESS after, and after complaining to the server we still got charged for it, and she was like im sorry, but i cannot do anything...last but not least i ate a piece of plastic from their bland carne asada tacos! <br><br>I'm sorry but i seriously do not understand the high ratings of this place. Would not recommend this to ANYONE and would never come back!", "pics": null}}, {"review": {"des": "Two stars for Fast Service, I ordered two breakfast sandwiches just egg, ham, and cheese. Total of $26 dollars no drink included maybe like ten pieces of potatoes comes with it. I got home and realized that I was given burritos with under cooked rice and cold potatoes. Food is missing seasoning. Try another restaurant and save your time. Expensive food and bad service.", "pics": null}}, {"review": {"des": "Great service! Amazing food! Love the ambiance Never disappointed.<br><br>Not sure why people review the food as great then give it four or three stars because they thought it was a Cuban place. That was your mistake, not Cafe con Leche's. Be respectful! You're Latino, and your momma raised you better than that!", "pics": null}}, {"review": {"des": "Came here on a Sunday afternoon before Memorial Day. I've heard so much of this place from friends and I've always driven by it. So when I was around the area and hungry i said why not. The place is nice, the prices I'm not surprised by because it's in Logan Square. <br>For some odd reason the host wasn't in the front she kept hanging out near the bar which I thought was weird.<br>The waiter for our table came up to us and spoke in Spanish, now I know it's PR place but the person I was with wasn't Latin. So I responded back in English and the moment that happen it made it seemed like we were a bother to him. He literally took our other, brought out our food and gave us the check.<br>I have to call for him twice because he never came to see if we needed anything.<br>We ordered French toast, which was basic, good but nothing special.<br>We also ordered Chorizo Omelette, it was so delicious.<br>And of course the coffee, which I don't drink but obviously had to try it since that's one of their things.<br>Anyways, i would go back just to give it one more shot, i liked the food.<br>Just get better service.", "pics": null}}, {"review": {"des": "My friends and I have been regulars for the past year and a half (I've also taken my family here) but after today, we decided that we won't be coming here anymore. <br><br>The food is phenomenal. We didn't mind paying for the food we got and have always left happy with full stomachs. We came today and the food was still great but the service was upsetting enough to make us not come back. During our dining experience, I ordered a burrito and asked for an extra side of sour cream. Our waiter didn't seem to mind to bring it to me but only said \"okay\" when I asked. Nothing else. When we got the bill, I noticed I was charged $1.25 for a small ramekin (the same size as what you would put a side of salad dressing in) of sour cream. Not only was the price too high, our waiter didn't mention anything about an extra charge for a side of sour cream. I mentioned to him that he didn't say anything about a charge for extra sour cream and if he had mentioned it, I wouldn't have asked for it. All he said in return was \"Yeah it is.\" The response, to us, seemed ingenuine and there was no intention of correcting the issue. There was no apology on his part for failing to mention the extra charge either. Afterwards, we asked for a manager.<br><br>The manager came and we explained the situation to him. He was apathetic and said, \"I think it's on the menu.\" I asked to see the menu. He leaves, returns with no menu, and said \"It's not on the menu. I'll take it off.\" Again, no apology, and no acknowledgment of the mistake. My friend  (we both work in restaurants) explained to him that a charge that high for a side of any sauce or dressing isn't common in our restaurants or other restaurants we've been to. He told her \"since you work in a restaurant you should know that this happens all the time and I just assumed you already knew there was going to be an extra charge.\" It was very condescending and only escalated the situation. <br><br>I don't want anyone reading this to think that our group made a big deal over a side of sour cream. The extra charge wasn't the issue and we didn't see it as a big issue but of course, we were going to say something when we had no idea we were going to get charged for it. It was the customer service and how the waiter AND the manager handled a situation that could've been easily been resolved with common courtesy and respect. We were dismissed and talked down to for saying something. Arguing with a customer about how the restaurant industry works wasn't necessary either. This isn't the first time the customer service was poor but we were able to look past the other times since we enjoyed the food a lot. <br><br>That's my rant. Don't come here if you value good customer service. I only gave it two stars instead of one because I've never been disappointed with the food. There are plenty of other good places in Chicago to eat.", "pics": null}}, {"review": {"des": "Fantastic. Had the breakfast burrito with steak and avocado and it was spot on. Fast, hot, fresh and good coffee.<br>Hot sauces were money too, I love good hot sauces. Red is spicier than the green.<br>If I was living in Logan Square I would be here every weekend.", "pics": null}}, {"review": {"des": "This place is super chill and the food is delicious. I absolutely love their cafe con leche with baileys. The service Is good. Their mojitos are not to die for though. Sometimes not sweet enough nor strong enough.", "pics": null}}, {"review": {"des": "I brought friends from out of town here and we had a good experience. The food, drinks and service were all good. The chicken soup was absolutely amazing. I think the chicken soup alone is worth going for. I had a bloody mary that was also really good. I'd go back!", "pics": null}}, {"review": {"des": "Amazingg food and environment, I tried the empanadas de pollo that were full of flavor and filling. As my plate I chose the Torta de milanesa which has actual thick meat, not like other places that barely have any meat in them. I will be coming back for their cocktails but please make sure you do get a cafe con leche!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/v8tfMj766Zkb6n_xzMTv1A/348s.jpg", "caption": "Torta De Milanesa!"}]}}, {"review": {"des": "This used to be my \"go-to\" place for Steak Sandwiches and the last couple of visits have definitely changed that. The quality of steak and amount has decreased along with the black beans they serve if you choose the rice and beans for your side. I don't think I'll be taking the hike down Milwaukee crowded streets for this once hidden gem and a part of my childhood when it was just the one room shack with only 4 tables or so.", "pics": null}}, {"review": {"des": "First time coming here. I had heard really good things about this place. Loved the setting of the place, really elegant. Also, they had an awesome selection of music. Food was really good as well. Their fries are so yummy. They have a variety of food options; Cuban, Puerto Rican, and Mexican. I had the ribeye steak jibarito, very good as well. Definitely will come back!", "pics": null}}, {"review": {"des": "Love the sandwiches from here. Highly recommend the steak or Cuban sandwich. Great location and reasonable prices. Will be back (if anyone gives a damn) lol", "pics": null}}, {"review": {"des": "Cafe con Leche is one of the best restaurants in the Logan Square area. The food is amazing and the drinks are delicious! Whether you're coming in for breakfast, lunch, or dinner, the customer service is great and you will not leave disappointed. The mango mojitos are a must have! I had some green chilaquiles and they were good! I've also had their mimosas during brunch and woah were they delicious!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/d8vSXHcRtyhv9i1SKJxLuA/168s.jpg", "caption": "One of the best mojitos I've ever had! Mango mojito!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZAu01SbNMh8qr81QThxt-A/168s.jpg", "caption": "Tasty green chilaquiles with chicken!"}]}}, {"review": {"des": "Great little spot and everything was decently priced. We both got a version of the egg sandwich which kept us pretty full for most the day. The service was quick. Not sure if that was a fluke or is pretty consistent for every table; they were pretty packed when we went though.", "pics": null}}, {"review": {"des": "I decided to try out de Noche restaurant to start the celebrations of my upcoming birthday this month. Myself and 4 other of my close friends always get together to celebrate our birthdays together and we like to try out different places... and living in the neighborhood, I thought that trying this place out was worth a shot.<br>And I am so glad that we did! The pitchers - yes pitchers! - of mojitos were amazing! <br>The appetizers and food were better than I ever anticipated... there was a lot of flavor on those plates. <br>I was a bit surprised on the prices of a jibarito sandwich ($15) - where other places will give you the same sandwich for a much lower price.<br><br>The only reason I didn't give it 5 stars was because our waitress was a little pushy. A few of us - including myself - ended up coming in earlier than the other ones, and even though we ordered a pitcher and an appetizer BEFORE the other ladies showed up, the waitress kept asking us where the other guests were and if they were on their way.<br>We continued to let her know that they were on their way and that WE were early - the place was NOT crowded for a Friday evening at that time when were there - she continued to pester us about our other friends. Even going as far as asking my friend to \"pinky-swear\" with her about our friends arriving by 7:30pm.<br><br>Besides that, I hope to be able to make it there again soon!", "pics": null}}, {"review": {"des": "Hidden gem, I love this place. The chilquiles and tortas are my go to. We had mimosa's the coffee con leche ( soooo yummy). I will come back to try the bread pudding bc that looks awesome! The vibe is good and waits are not brutal. Gotta love the free parking as well. This place is pretty affordable as well.", "pics": null}}, {"review": {"des": "Love this place! Food is always amazing, and delivered pretty quickly. Seating is usually pretty quick too even though the place is frequently busy. One star lost because service is usually lacking. If you have a problem with your food, in my experience, it hasn't been handled very well. You're likely not going to get your cup filled up without hunting down your server. Otherwise great and I keep coming back.", "pics": null}}, {"review": {"des": "I enjoyed brunch at cafe con leche and was in the area so me and a friend stopped in last night for dinner. Almost everything was on point. <br><br>We had the trio of empanadas and steak and lechon jibaritos.  The chicken empanada was the star in my book.  For the jibaritos, I preferred the pork but really, the food tasted good. The portion was hefty.. I'm a good eater but had to take 1/2 of it home. <br><br>The only thing I wasn't feeling was that I ordered one mojito and finished it.  I had not ordered a second but the waitress dropped off another one with a smile. We thought it was complimentary but it wasn't. That's not right. And the mojitos actually weren't great anyway (of the three that came to my table, each one looked and tasted noticeably different). So maybe take a pass on the drinks but the food was good.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9-E08KWlbg9-h1HEanxTHg/348s.jpg", "caption": "Steak jibarito"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1gUeCtIXfIlWOxI6FxHYsw/168s.jpg", "caption": "Pork jibarito"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qgVhGj9kPNd-NeKAcxcHZQ/168s.jpg", "caption": "Empanadas"}]}}, {"review": {"des": "Hangover delivery breakfast gem. Perfect for those spinning/aching mornings when you don't even want to make a cup of coffee. I go with the chorizo omelet with house potatoes and cafe con leche...never disappoints!", "pics": null}}, {"review": {"des": "Went there for a sunday brunch. It was full but wasn't a long wait. <br><br>The food was cooked very well and quite flavorful. Service was excellent.<br><br>I would repeat", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9dtV0zhKxdHxWYkcxwIfhw/348s.jpg", "caption": "Sunday brunch crowd"}]}}, {"review": {"des": "I got the chorizo and avocado omelette with the cafe con leche. First, the service was excellent. We got our food in less than 10 minutes. We also didn't have to wait very long to get in, only 15 min. The cafe con leche is huge. It's a little too sweet though. The omelette and house potatoes were very good. I like that they didn't make the portions too big, just the right size.", "pics": null}}, {"review": {"des": "Had the chilaquiles and they were amazing. You can tell the refried beans are made from scratch. Tried the Cafe con Leche and it's very lightly sweet and very creamy. Yum!", "pics": null}}, {"review": {"des": "This place is spectacular.  Everything I've had was on point and the the tacos steak &  Chicken mexican rice and beans were delicious. Didn't think I would like the sauce one but it was a winner. I have been to a handful of palaces around the neighborhood nothing as quick and the staff were great. I liked  The owners very friendly and great hospitality 1st time there Best time ever at a neighborhood well now restaurant. Thanx for having us will definitely be back", "pics": null}}, {"review": {"des": "Awesome place. It was very clean, upbeat, great service and the food was amazing.  We will be back. Love it!!!", "pics": null}}, {"review": {"des": "Stopped by this place with some locals.  The atmosphere was a trendy locale with the community coming in and out for more food. <br><br>The food was good--but the cafe con leche itself, best coffee I've had in such a long time. The wait staff was friendly and seemed like they are more family to its patrons than anything else which is a fantastic business ethic to have. <br><br>I'd definitely recommend.", "pics": null}}, {"review": {"des": "It was my first time coming here and I was thoroughly impressed. I came with a friend and we ordered the flautas dinner, plantains with the garlic butter, and empanadas. Everything was so delicious and the staff was super friendly.  The atmosphere is cozy and I would definitely come back here again!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tA8gRpC9p3oyqLQf2Q0atA/348s.jpg", "caption": "Flautas dinner, plantains with garlic butter and empanadas."}]}}, {"review": {"des": "Went in a dinner date with my mom & I have a great experience. The food was delicious, the decor was pretty and the waitress was welcoming. Queso fundido is a must try for an app. Rice and beans were flavorful. Overall loved everything. And it's in the heart of Logan Square!!", "pics": null}}, {"review": {"des": "The long line (especially on weekends) is definitely worth the wait. I'm always greeted with a pleasant smile and great service. The ambiance is welcoming and the food is delicious. The prices are fair and I always leave satisfied.", "pics": null}}, {"review": {"des": "Wouldn't return, food was just okay... very small portions for the price. Mixed drinks are very small too for the price. The restaurant itself was very cute and cozy. the service could've been better.", "pics": null}}, {"review": {"des": "Great place for brunch! I always go by one rule. If you see police officers eating at a restaurant you know it's going to be good. Cops don't eat at shitty places. I ordered the breakfast burrito with chorizo. It was super tasty and I ate every bite. The show stopper was the bloody Mary's. They do it right here and it was one of the best I have had. Yes, the coffee is great too.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1Tk4c322i6ORfzEN9KeJ9A/168s.jpg", "caption": "Delicious Bloody Mary! This place makes them right!"}]}}, {"review": {"des": "Cafe con Leche is definitely my favorite Latin restaurant. I always go there and I've never been disappointed by their food or service. The ambiance is amazing and the service is quick. <br><br>Come here, it's so good and very affordable.", "pics": null}}, {"review": {"des": "I made reservations for this place for my 21st birthday (they are on top with their reservations i give them that). <br><br>Where do I start..<br><br>First, the food is really expensive for such a small serving. My bf ordered carne asada plate and he almost finished the plate before i even got my food and so is my other friend. so he just sat there the whole time while some were still waiting for their food. The rice was too small, not even what it looks like on their website. The reason for giving two stars was because the lechon jibarito i ordered was actually good, not the best (i've had better), but good. The drinks we got were also small and for sure had more ice in it than the actual drink.<br><br>Second, my friend brought a cake and told us they charge $6 PER SLICE (somewhere around that price). you must be kidding. lol. i have about 14+ guest. So no, the server instead told us, she will give a flan (but charged us later on for it and had to ask her again and gave us another receipt). The flan was ok, it was just on a regular plate with happy birthday on it and a candle. <br><br>LOL. the serving was too small for the price, my bf bought chips and ate at home.<br><br>It was so expensive that most of my guest were disappointed of the food they ordered - they told the server about it but she unfortunately didn't really do anything about it. Sad. <br><br>We stayed a little longer than expected because we were trying to figure out who got what since everything was mixed up on the receipt which was weird cus theres table numbers on the receipt, the owner/manager/server (not sure exactly who it was) offered she buy us all a shot - which was nice of her. <br><br>but overall - i honestly don't recommend this place. I thought I would have a good dinner - i mean i did since I was with friends but the food was meh. Maybe choose wisely but still. <br><br>its also free parking so theres that.", "pics": null}}, {"review": {"des": "This place is great. They consistently make excellent cafe con leche which is not easy to find. I recommend their chilakiles and of course a cafe con leche. They have free parking next to the restaurant and they deliver.", "pics": null}}, {"review": {"des": "2 meals, chips + guac was about 40$, portion sizes were a little smaller than I'm used to at a Mexican restaurant. Only complaint with the food was the sauce on the enchiladas was a little too sweet for my liking. The steak tacos were dank. The staff was extremely friendly.", "pics": null}}, {"review": {"des": "This place is in serious danger of me coming here way too often!!! (I'm sure they won't mind) <br><br>I came for breakfast and had the chilaquiles with a cafe latte. I LOVE coffee, I LOVE Mexican food and breakfast food is probably my favorite. Here I was able to have fantastic versions of all the above. <br><br>Oh ya, and free parking in the back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/onM-xT3ylYXL7T30o69pYg/348s.jpg", "caption": "Cafe Latte was very good!"}]}}]}