{"name": "cafecito-chicago", "reviews": [{"review": {"des": "Delicious Cuban food !<br><br>Voted best Cuban sandwich in Chicago and tons of vegetarian options .<br><br>We ordered the tomato , mozzarella Cuban sandwich , beans and rice as well as plantain .<br><br>Absolutely delish ! Gets crowded around lunch time because the the colleges around so go before or after lunch as table space is limited .<br><br>Tons of desserts and amazing Cuban coffee !", "pics": null}}, {"review": {"des": "BEST sandwich place in the city, hands down. Their cuban sandwich is so tasteful and delicious, I could eat it everyday if I didn't fear for an early onset heart attack at age 24. <br><br>However, the real jackpot is if you happen to go during a week they have their guacamole sandwich. Holy moley, after I had that sandwich, my entire view on life changed. Fresh guacamole, a legitimate whole chicken breast on a presses cuban bun. Oh my god. Cafecito, if you are reading this, please make the guacamole sandwich a menu item.", "pics": null}}, {"review": {"des": "Large cafe con leche was hot, strong and sweet. I liked it!<br><br>Cuban was piping hot as well but kind of slim on the filling. Meat was kind of dry. <br><br>Steak chimichurri was slightly cold in the middle. Steak meat quality wasn't the best. <br><br>Would pop by if in the area but nothing to crave about. I think cafeteria yesenia is much better!", "pics": null}}, {"review": {"des": "Nice little Cuban cafe in South Loop.  Ordered the Huevos con Chorizo (pressed breakfast sandwich with eggs, cheese, and chorizo).  Really delicious.  Could have used something fresh to brighten it up a touch, but that's nitpicking.  I would order over and over again if I lived here.", "pics": null}}, {"review": {"des": "I love Cuban food and haven't tried any in Chicago until Cafecito. This cool cafe serves up some delicious sandwiches and soups that seems to be a great lunch spot for those working in the area.<br><br>My friend and I came here prior to a theater show at Roosevelt. We've walked by this cafe all the time and always assumed it was simply part of the hostel's lounging area. This was half-true as a lot of the diners looked like backpackers sipping on coffee, writing novels, or reenergizing after some drinks with their lads.<br><br>Feeling extra Cuban today, I ordered their take on Ropa Vieja ($6.99) in sandwich form. This sandwich was packed with shredded beef, vegetables, and plantains all pressed neatly together and baked to order.  You could even tell by the scorch marks on the bread that they want to make sure your sandwich is extra toasty. Sandwich was bomb and one that I would get again. I was also feeling extra hungry that day and ordered a bean stew to go with my sandwich as well. It was both the best decision and a terrible decision as I became extremely full after.<br><br>If you've never had a Cuban sandwich before, this is a great spot to try for your first time.", "pics": null}}, {"review": {"des": "Super affordable & delicious Cuban food! If I lived/worked in the area, I'd definitely come here often to eat and try all of their sandwiches. It's great for take-out or for dining in.<br><br>I had a hard time deciding which of the mouthwatering-sounding sandwiches to eat but finally picked the Chivito. It was pretty good and reminded my friend and I of a breakfast sandwich, probably because of the fried egg and bacon.<br><br>Also tried half of my friend's ropa vieja sandwich, which was amazing for only $7! Incredibly tender shredded skirt steak, savory sauce balanced perfectly with the sweetness of the plantains... Mmm. I'd order this again in a heartbeat. <br><br>Finished off lunch with a cafe con leche, which was rich and had notes of caramel. I'm still amazed that it was only $11 including the coffee, even though the cafe is in the Loop and I thought everything would be super expensive there - Cafecito proved that wrong!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kc3_ifXr01gBwtjbsoL5CQ/348s.jpg", "caption": "Ropa Vieja sandwich"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uQq7Wvy2TNiNZ9Y5mxEWgw/168s.jpg", "caption": "Chivito sandwich"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Mm5-q5B1oyVS2PPSjrKi-w/168s.jpg", "caption": "Cafe con leche"}]}}, {"review": {"des": "Now THAT was a sammich! Wife and I was doing some volunteer work down by Roosevelt & State so we decided to make a walk down here afterwards for a late lunch/early dinner based on Yelp reviews. Once again, Yelp did not lead me wrong!<br><br>I grabbed the Chivito because it sounded good: steak, caramelized onions, bacon, fried egg. What could go wrong?? Sure enough, this sammich was slammin! Steak was seasoned well with Cuban flavors complemented by the perfectly cooked bacon and egg along with the right amount of sauce and condiments.<br><br>Order also didn't take long so you won't be waiting forever. I thoroughly recommended this place/sandwich if you're downtown & looking for a quick lunch!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QyhdR81efzn1PjwnANLyDA/168s.jpg", "caption": "Chivito 2"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ELyeA-gd8M0xIhyRiID85Q/168s.jpg", "caption": "Chivito 1"}]}}, {"review": {"des": "Yummo! All the five star reviews are true as far as the food goes. Service was a little 'meh' yet efficient. Atmosphere is just what you would expect little sandwich shop to be, which is fine. But the sandwiches - O. M. G. <br>Go, just go now!!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WmEjb_RqqqDmMWQsT_yXpQ/348s.jpg", "caption": "Ropa Vieja - it ain't much to look at, but it's delicious!"}]}}, {"review": {"des": "My girlfriend and I ordered the Cortadito, a Lechon platter, and a Cubano sandwich.<br><br>The Cortadito itself made the visit to Cafecito worth it. It was beautifully smooth and just sweet enough. I personally love a strong coffee and it was perfect for my taste. <br><br>The lechon platter was good, however the rice was a little dry. I wish the lechon itself was a little saltier, or had a slice of lime on the side that I could squeeze over the top, or a hot sauce I could drizzle over the pork. I absolutely adored the plantains, they were perfectly soft and sweet and complimented the entire dish. <br><br>The Cubano was also very good, the flavors were well balanced, and nicely seasoned throughout. The cheese was melt in your mouth delicious and the bread was perfectly crisp and crunchy in every bite. <br><br>It was $20 for two people at lunch, and we were both quite full. Definitely worth the trip!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7pz0OQ0PomdiRerVF4grgw/348s.jpg", "caption": "Lechon Platter with roasted pork, plantains, rice and beans."}]}}, {"review": {"des": "I came by for a light late afternoon lunch, led here by its positive Yelp reviews. I ordered a Cortadito (Cuban espresso with sugar and a splash of milk) to help cure the jet lag. I also ordered a 16oz Caldo Gallego (white bean soup with greens and chorizo). It was a nice light meal to hold me over until dinner (deep dish, of course).<br><br>The cashier was friendly and my espresso was made instantly. However, it took nearly 20 minutes to be served my soup, which I assume is already prepared. After some observation it looked like there was some shift changing that caused this delay, so I'm going to give them the benefit of the doubt and still provide 5 stars. <br><br>The espresso and soup were tasty and reasonably priced. The soup also came with a side of warm soft bread. I wish I had time to come back and try the steak chimichurri sandwich!", "pics": null}}, {"review": {"des": "I always come here for my cafe con leche in the morning. Their cafe con leches are really bomb and it's made consistently the same way. <br><br>I also had the Cuban sandwich here. It was quite flavorful. I love the food here. Everything here is well made.", "pics": null}}, {"review": {"des": "I LOVE CAFECITO. Seriously, they always deliver on their food, drinks, desserts, and service. The south loop location has a ton of room with tables and chairs for socializing and doing work. This visit I had the chicken and chorizo sandwich and the double Cafecito (hot). Both were so amazing, and I tried the hummus and soup that my friend got that were also delicious. Everything I've ever had here is amazing, highly recommend as a quick cafe or casual socializing!!", "pics": null}}, {"review": {"des": "WOW!  After arriving in Chicago, we were hungry and didn't know of anything around.  After stumbling across this place and it's reviews, we were anticipating a great meals.  <br><br>Neither of us have had Cuban sandwiches but from the pictures and the menu, there were a plethora of appealing options.  <br><br>I had the Chivito which was juicy and full of flavor.  The beef was well marinated and very tasty.  My mom had the Tilapia Criolla which was very flavorful and light.  <br><br>Would highly recommend for a quick lunch in downtown Chicago.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/H68X-Chhq_GgqlL85gX6rw/348s.jpg", "caption": "Chivito"}]}}, {"review": {"des": "Great spot for a quick and cheap bite.<br><br>The only thing I've ever ordered here is the Ropa Vieja (sandwich, not platter), and I see no reason to change. It packs a very unique taste: the plantains make this sandwich sweet which I absolutely love. Off the top of my head, I cannot think of another sweet sandwich other than a peanut butter and jelly sandwich (which is hardly comparable to the Ropa Vieja). If a sweet sandwich sounds interesting at all to you, definitely give this sandwich a try!<br><br>As a final note, be weary that not all Cafecito locations will have the same hours. This one (Congress) is open all week whereas some of its other locations aren't opened on weekends and close fairly early on weekdays. Make sure to check before you go looking for one.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cY3WQeDBcC4JrvbdCIaIQw/168s.jpg", "caption": "Ropa Vieja: a unique sweet tasting sandwich"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EPCHYbC2PX5UNXTXLIXrlQ/168s.jpg", "caption": "The inside of a Ropa Vieja sandwich"}]}}, {"review": {"des": "Their sandwiches are so so so so good. I personally love their jardin sandwich, which is all veggies cooked amazingly. I always add steak to the sandwich to make it even better.<br><br>Their borracho sandwich is amazing. The shrimp is always perfec and it has a great slaw <br><br>The breakfast sandwiches are so so so good, but definitely way too big. If you're ordering catering, I'd say a regular serving is more like half a sandwich.", "pics": null}}, {"review": {"des": "One word........Cortadito!  If you have not tried this delicious cuban espresso get off your butt and get here!  Freaking delicious, I always order a double and get a cafecito Cuban coffee for the walk back to my desk  to stay caffeinated for the rest of the day!<br><br>Service is nice and extremely fast!  We waited in a line to order at least 10 deep and gave our order and received it within 10 minutes!  Prices are decent, the sandwich selection is pretty good.  I just wished the sandwiches were as good as the coffee.  If the sandwiches were better this place would be a coveted 5 star!", "pics": null}}, {"review": {"des": "Recommend by local to try their ceviche.<br><br>Per reviews, cubano sandwich us supposed to be good. <br><br>They were out of ceviche at 1pm...food came out a minute after I ordered...<br><br>I get that the sandwiches are premade and heated.<br><br>Bread was over toasted, burnt, and dry. Pork was dry as well. Probably one of the worst sandwiches I've had in a while. Only redeeming aspect is that it was hot...<br><br>There wasn't even a seat available to sit down and eat. Ended up going to hostel next door<br><br>Seeing all the good reviews I was highly disappointed. Will not be back", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LJ7zXjjtyeC84RO-9UE6GA/348s.jpg", "caption": "Cubano Sandwich"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OKfjYynpGEKsPtC-hEs5Gg/168s.jpg", "caption": "Cubano Sandwich"}]}}, {"review": {"des": "Great spot for a quick/cheap lunch! <br><br>Only reason I won't rate it higher is because I didn't LOVE my sandwich...as much as I wanted to, the habanero-lime aioli in the jerk chicken sandwich was way too spicy for me, and too spicy for some of my friends who tried it and are very used to eating heavy spice. The taste of the sandwich was great, but it was unfortunately really hard to finish due to how spicy it was. I loved the Cubano that my friend ordered! I'd definitely come back to try a few more sandwiches on the menu - the variety is decent, and options include non-veg and veggie sandwiches and soups.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rthbmDoIiU_NYUTWr8wR1g/348s.jpg", "caption": "Jerk chicken sandwich - tasty but VERY spicy"}]}}, {"review": {"des": "Last week in NYC, I couldn't find anywhere serving a true Cortadito Cuban style. Was so happy when I saw the word \"Cafecito\".<br><br>If you're local in Chi and reading at this, ~ 2 PM bring back a colada to your office with a few small shot glasses to pour out cafecitos. All your coworkers will love you for the pick me up. Ask anyone from South Florida!", "pics": null}}, {"review": {"des": "Another placeholder so my pictures link. I'll update with details later, but the 4 star rating holds true.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/725QOoUD1UM4fFGXIuwvvA/348s.jpg", "caption": "Chimichurri Chicken"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jIDWc6yy65Rysb78lD98dw/168s.jpg", "caption": "Caramel Cuban Latte"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PnleOjQ5wTU7KH0Mp1qfOg/168s.jpg", "caption": "Guava Pastry"}]}}, {"review": {"des": "Once again, I wish Yelp had .5 stars. I think Cafecito would be a solid 3.5 borderline 4 Star place.<br><br>Stopped by for lunch and had a cubano and Small black bean soup. The cubano was good but not great. I'd eat it again but wouldn't rush back for it, as I've had better elsewhere. The soup was really good, though!<br><br>Service is quick, prices are reasonable, and a quick walk from the office. 3.5 stars at its best!", "pics": null}}, {"review": {"des": "Don't let the line scare you. These guys are on top of it.<br><br>Price: About $6 for a sandwich and $3 for a coffee.<br><br>Food:<br>Chivito: I love egg and steak and ham and bacon and... this thing is stuffed! I would order it again.<br><br>Cubano - their most popular sandwich. It was flavorful.<br><br>Their coffee is very good! Cafe con Leche is great for people who like milk.<br><br>Service: Quick and friendly.<br><br>I would come here again for a fast lunch or delicious coffee.", "pics": null}}, {"review": {"des": "From across the street, this location is not easy to spot. It shares an entrance with the large hostel to the left. It's a quick spot to grab a tasty hot lunch. I had a fresh chicken chimichurri sandwich and a salad with hearts of palm and artichoke hearts. Delicious break from work-week soup-sandwich-salad monotony.", "pics": null}}, {"review": {"des": "Great cafe. I was in Chicago for a few days with some friends. We grabbed a quick bite here. Lines were long but they were moving along quickly. I had fish sandwich and my friend had shrimp sandwich. Both were excellent. I also had soup which was really really good. Highly recommend. There is a bathroom in the next building in case you're wondering.", "pics": null}}, {"review": {"des": "Overview: <br>Cafecito is a surprising, but excellent restaurant in downtown Chicago. I would not have expected how excellent Cafecito is for its sandwiches. I have tried many of them and they are all tremendous. The coffee is also very good. The service is good but nothing special. Get your sandwich to go and eat it in the park next to the Art Institute of Chicago. <br><br>Recommended Dish:<br>The Cuban Sandwich is amazing. It is absolutely perfect. The meat is tasty and moist. The cheese is smooth and evenly melted. The mustard and pickles blend together to add tang and sharpness that contrast the meat well. I do not even like pickles, but on this sandwich they were amazing. <br><br>Second Recommended Dish:<br>The Chivito sandwich is an amazing combination of all good foods (steak, ham, bacon, fried egg, mozzarella, lettuce, tomato, onion, citrus mayo). What more could you ask for?", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/h80VbV2mgnlJCszN2DWLaQ/348s.jpg", "caption": "Cubano sandwich near the Art Institute of Chicago"}]}}, {"review": {"des": "My last pre-class dinner in the Loop and although I was in Cafecito a long time ago I never got around to writing a review until this latest experience was deserving of a really good one!<br><br>I was looking for something more than a sandwich so I went with the ropa vieja platillo, it's basically just an entrée sized portion of meat that comes with black beans, rice and plantains. <br><br>I ate inside the place which is pretty small, but does have a few tables and a bunch of chairs. There weren't many people inside when I was there so it was a pretty chill spot to enjoy a dinner to myself. My food was brought out a little over 10 minutes later on a nice looking plate with real silverware.<br><br>Ropa vieja is of like a slow-cooked or braised beef that has peppers in it, it's not super spicy or anything but Cafecito does ropa vieja excellently. It was so flavorful and tender, clearly been slow-cooking for hours. The black beans and rice went very well together as well, and the plantains were amazing. I'm not sure if they're cooked in a pan or baked or fried but they were phenomenal; sweet and had a great texture.<br><br>The whole dinner was super impressive, good quality food, a large portion size and after tax was around $12, which I must say isn't exactly inexpensive, but I have paid more and gotten less of something that wasn't as good elsewhere in the Loop area.<br><br>Huge fan of Cafecito and will surely be back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3_ALkd2ktjdWIRuq_8LMbg/348s.jpg", "caption": "Ropa vieja platillo - amazing!"}]}}, {"review": {"des": "Ahh one of my Top 3 restaurants we tried while we were visiting Chicago for the first time a few weeks ago. Their sandwiches were THE BOMB. They looked so simple but they were so jampacked with delicious flavors; thank you to my follow yelpers for getting this place on my radar! <br><br>We decided on trying two sandwiches: the cubano and the steak with chimichurri; iahdhasdhaskjd they were seriously soooo good!  I can't even say that I liked one more than the other because they were different from each other and just so yummy! We ended up sharing a half of each and saving the other halves for later.. and they were still good when we heated them up. Winnnn! I wish we had this same exact restaurant in LA so I could try more sammies but I guess I'll have to wait til my next visit to Chi city!", "pics": null}}, {"review": {"des": "Loved this place! It's been on my list for a while and I'm so glad I finally got to come by. There are three locations in Chicago, but the one in South Loop is the most popular. There aren't too many seats and the line was out the door at noon. There also aren't any public bathrooms so do your business beforehand. Service was great and the food was ready in five minutes.<br><br>They have a ton of sandwiches and they all looked so good. I chose the La Costa sandwich ($6.49), which comes with turkey, mozzarella, chipotle aioli, arugala, avocado, and roasted peppers. The portions were good and filled me up. The turkey, cheese, and bread combo were my favorite but I loved the creaminess of the avocado as well. I seriously didn't know a sandwich could be that good. My friend had the Cubano and raved about it as well. Highly recommend this place for a quick lunch!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XRBD-zWB5IQhGFAxFdvgyA/348s.jpg", "caption": "La Costa sandwich"}]}}, {"review": {"des": "Delicious sandwich and good tasting coffee for $2. I think the sandwiches are little pricy but given it's downtown Chicago it's an affordable price.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EEV6P7v8g5ZhfOHceL022w/168s.jpg", "caption": "Great food and affordable price"}]}}, {"review": {"des": "Pretty good; super simple. With so many ratings, I was expecting something over the top spectacular. Don't get me wrong, the food was good, but in a city with great food on every block, it's hard to stand out. I had the chimichurri chicken sandwich. Again, tasty... but not super unique.", "pics": null}}, {"review": {"des": "I tried the Roja Vieja and the chicken chimichurri sandwich, both were under $8 after tax. <br><br>The chicken chimichurri was okay. The chicken was a bit over cooked and charred. Maybe the steak chimichurri would be a better option. <br><br>The Roja Vieja, however, was fan-freakin-tastic! It includes shredded steak and beans, balanced with the sweetest from plantains. I just wish there was one more piece of plantain, or for the plantain to be diced. My half of the sandwich just had one piece and I ate it in one bite since it was whole, so the rest of my sandwich wasn't blessed with the presence of plantain lol. But man this sandwich has a good balance of flavors and is very juicy. <br><br>For dessert I tried the tres leches and the guava cheesecake. The cheesecake was dulce de leche flavor, topped with guava jelly. I prefer a plain cheesecake topped with guava jelly because the dulce de leche has a strong, overpowering flavor and hides the guava. The tres leches was so amazing. Moist, light, airy and fragrant. Both for $3.83 each, tax included!", "pics": null}}, {"review": {"des": "My sister and I arrived super early to Chicago and wanted a hearty breakfast before we started our day. We hit up Cafecito, attached to a beautiful hostel downtown, for some amazing Cuban sandwiches and strong coffee. It was just what was needed. The servers were helpful and friendly and the coffee and sandwiches were delectable. Definitely recommend! Great price and great food!", "pics": null}}, {"review": {"des": "Do you like hot chocolate? If you do, this is the place for you! They make one of the best hot chocolates I have had! And at such an affordable price! They also have a great selection of coffee but I did not try them. <br><br>This place also has great sandwiches. I tried the ropa vieja and loved it. I also tried their black bean soup and thought it was delicious. <br><br>The only thing is that they did not have any plantains when I visited. They informed me that they bring it fresh every morning and they still did not have any. I wanted to order something with it but could not. <br><br>I think the service was pretty good. The place does get busy so make sure you do give it some time.", "pics": null}}, {"review": {"des": "Although this isn't my first time eating at Cafecito, this is my first time going to this location. Overall, pretty great place for a cuban-influenced bite to eat or cuban coffee. I enjoyed the cubano sandwich and cafe con leche, but it wasn't anything out of this world.<br><br>Service was quick, place was very clean, prices were decent, and the aesthetic was pretty nice! I'd definitely come here again.", "pics": null}}, {"review": {"des": "This place was close by when I began a sudden Yelp search after hunger struck - so I ran over to check out what the 4.5 star hype was about.<br><br>I love Cuban food and I love sandwiches but i was SO hungry that the thought of just a sandwich made me feel like it wouldn't be enough so I ended up ordering the \"Palomilla\" from the platter section.<br><br>My dish was thinly sliced steak, grilled onions, raw onions, parsley, lime juice and mojo served with white rice, black beans and plantains. While I appreciated the blend of flavors in the platter it was a very underwhelming experience for $10.25 at a cafe. Thinly sliced beef can still be soft but mine was firm and since all i was given was a butter knife, near impossible to cut through with any elegance. I liked the acidity of the lime juice and the rice and plantain sides were a nice choice of sides, but i just didn't enjoy the vibe of the dish. An average portion of EXTREMELY thin beef in the middle of the dish just seemed awkward.<br><br>I've heard really good things about the sandwiches here so i will return and share my opinion on that.", "pics": null}}, {"review": {"des": "A taste of Cuba in the heart of the Loop. Finally made my way to Cafecito to see what it was all about. And like everyone has mentioned, it's as good as it gets!<br><br>I got the cubano and an iced café con leche. It was the perfect combo. For such a simple sandwich, it was FULL OF FLAVORS! Thinly slices of roasted pork & ham, melted swiss cheese, pickles, and mustard all sandwiched between bread... it's a winner. Even during the busy lunch hour, I was surprised that my order was ready within minutes. <br><br>Since I was so impressed with my first visit, I decided to come again the next day during their less busy hours except the service this time was less than subpar. I ordered an iced café con leche and decided to try the chivito. The coffee came out right away but wasn't iced, so instead of making a new one, she throws in a few ice cubes making the drink lukewarm, which was kind of disappointing. Not sure if my order got misplaced or what since we were waiting for about 15 minutes and one of the guy notices that we haven't gotten our food yet and asks what we had ordered. But other than that the food here is spot on and prices are really affordable. Great for lunch, buen provecho!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/prEUo0jPZwgQW1dLYwuM9w/168s.jpg", "caption": "Chivito"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/l-5kdYRkjko9qtQcP6wJtw/168s.jpg", "caption": "Cubano & iced cafe con leche"}]}}, {"review": {"des": "Thank gawd there isn't a cafecito location near my work or I'd be tempted to eat their delicious sandwiches every damn day. The cubano I ordered was near perfection. The prices were super reasonable. I didn't love the cortadito but I'll just try something different next time. <br>The cafe space is on the small side, super casual, colorful, and eclectic. Even mid-afternoon it was busy and most seats were taken so I took my lunch to go. On nice days, it's easy enough to walk a few blocks to Buckingham Fountain or Lake Michigan and just enjoy your lunch with a view.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oNLq3rL-GBvsHh_DeCWq3g/348s.jpg", "caption": "El Cubano + Lunchtime Views = Perfection"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/08HfAgBXD0BZvhVR6pduWQ/168s.jpg", "caption": "Cortadito to go"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EyJtrntCytwNB9iWUBawtQ/168s.jpg", "caption": "Colorful, casual, fun interior"}]}}, {"review": {"des": "I'm from California and whenever I go home I always stop by a local deli and grab their sandwiches. I swear by those, but I have to say...these sandwiches are *even better*. I ordered a Guava-Q. Pork with caramelized onions, bbq sauce, and pineapple. If you're a pineapple on pizza kinda person, I would definitely recommend this sandwich!", "pics": null}}, {"review": {"des": "Very good sandwiches for cheap!  Well.. cheap for Chicago. <br><br>The lines seem long but move relatively fast.  Sandwiches are simple but pack tons of flavor!   Favorites are the cubano, jerk, and ropa vieja.  <br><br>Could eat this stuff everyday if it was closer to me.  Writing this makes me want to get it today, so i might just take a walk for it, thanks for the reminder Yelp.", "pics": null}}, {"review": {"des": "What a cute cafe!  I got the Ropa Vieja sandwich and the iced Cuban cafe ole.  I wish I had found this little gem the day before having to leave to go home.  So glad I did, not only was the coffee and sandwich perfect, my husband had some bites and he's never had ropa vieja and is now open to other Cuban food...yeay!!!  When I come back to Chicago this will be part of my daily morning routine.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zKg7LTqkkCxeK2iSOIH5-w/348s.jpg", "caption": "Ropa Vieja with a perfectly fried plantain inside.  Delcious!"}]}}, {"review": {"des": "Stumbled upon this place because it was nearby and we were starving. But after my first bite I instantly wish I knew I about this place!!!! <br><br>One of the best sandwiches I've ever had. I've never had Cuban food before and now I feel like I need to try it all, aha!! <br><br>The shop was quite small, not a lot of seating but people usually order their food to-go. <br><br>The Jerk Sandwich: (5/5)<br>Chicken was very, very flavorful. It was seasoned really well and was moist. The bread was toasted; so it came with a crunchy shell but instantly soft inside  Now here's my warning, if you can't do spicy - do not order!!! The habanero lime sauce was amazing, but the heat does creep up on you!!!! So be careful! <br><br>Boyfriend's Review-<br>Steak Chimichurri Sandwich: (5/5)<br>This was one of the best sandwiches I've ever had. It was definitely tasty, I savored each and every bite. The steak was cooked to perfection, complimented very nicely by the chimichurri sauce. Definitely recommend <br><br>Overall, I loved the food. It was really filling. Servers and staff were really friendly. I'm definitely coming back!", "pics": null}}, {"review": {"des": "Cafecito was exactly what we wanted! A great little cafe vibe with plenty of drink options AND delicious, delicious food. It's hard to fend off a Cuban sandwich craving when your first experience was from the Columbia Cafe in Tampa, FL. (<a href=\"/redir?url=https%3A%2F%2Ftinyurl.com%2Fyb62fycw&s=f976eb1bad30e9c3deceb3cfbd97c3d35d4d96d0d5eedc35e2dee06410bbeacc\" target=\"_blank\" rel=\"nofollow\">tinyurl.com/yb62fycw</a>) Seriously Tampa has some great Cuban Food. We were craving some delicious Cuban sandwiches though and after drooling over some of the Yelp photos we decided to give it a shot. <br><br>We walked right up to the counter and were greeted by a friendly server. After ordering our sandwich, Cafecito and iced chai tea latte we grabbed a table and waited for the delicious goodness we were about to receive. It didn't take long and we regretted splitting just one sandwich. The sandwich was great and the drinks were also tasty- the cafecito was very sweet but fun to try. We hung out for a while chatting and sipping our drinks before reluctantly leaving to meet some friends. <br><br>If we're in town again we would definitely hit up Cafecito and I could totally see us becoming regulars if we lived in the area. Very tasty and worth the trip in!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pnQajaU1wrUH_v8y_oYq9g/348s.jpg", "caption": "Cuban sandwich was great"}]}}, {"review": {"des": "Good sandwich but did not live up to hype. <br><br>Before I visited, I had read many of the review here in which people talk about how this place has the best sandwich they've ever eaten.<br><br>My jardin was not the best sandwich I've ever eaten. But it was pretty good and cheap for the quantity/quantity. <br><br>The inside of my jardin sandwich was roasted eggplant, roasted red pepper, mozzarella, and jalapeño hummus. I was disappointed to find my eggplant was still cold, and my mozzarella was not melted. There was barely any hummus but plenty of spiciness. The filling was unique but okay.<br><br>The bread however, really pulled up the sandwich game. It was not greasy as I had expected it to be. The outside was very crispy while the inside was super soft and fluffy. The bread had also absorbed the juices from the filling and was delicious to eat on its own. <br><br>I came by at ~1:30 so lube was very short and service was fast, but I heard someone say that at noon the line is out to the street...", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gsgjof_kMyaQZHx4Jp2_NA/348s.jpg", "caption": "Menu page 1"}]}}, {"review": {"des": "Found this place on Yelp while looking for a quick place to grab lunch before sightseeing. I saw a lot of fantastic reviews so I decided to give it a try. I ordered the cortadito (double) for an extra dose of caffeine and the ropa vieja sandwich. <br><br>The ropa vieja was delicious. I liked the combination of the sweet plantain and the salty pulled pork. It was messy to eat on a park bench, but have enough napkins on hand and you should be okay. The cortadito was the winner of the two though. It is a slightly less milky latte with a touch of sugar, which makes it the perfect pick me up! I honestly wish it came in a larger size (they only come in 12 oz cups) so that it would last me longer than a few quick gulps!<br><br>My only concern and reason for the 3-star review is the hygiene of the employees. The girl who was in charge of making espresso drinks picked her nose, mopped the floor, and then went back to making drinks without ever washing her hands. All the while I was watching.", "pics": null}}, {"review": {"des": "Soooooo  forgive me for forgetting the name of the  sandwich i had but ill tell you whats in it!! Shredded beef and plantains!!  My spouse and i split it and immediately felt like snatching the other piece from each and making one of us go get their own!!! <br><br>That sandwich was out of this world", "pics": null}}, {"review": {"des": "6/5 stars for Cafecito! This place is my FAVORITE sandwich place, hands down! I come here so often with my boyfriend, and I am never disappointed! The steak chimchurri sandwich is my favorite, I get it every time. I'm going to be trying other items off the menu, but take it from me: THE FOOD IS GOOD AF! <br><br>I hate coffee, but this place is the only coffee I'll drink! The cordadito & Cafecito con Leche are my favorites! I'm so glad I wandered to this place one day because I crave it all the time. I've rushed to take the Blue Line to make it before closing multiple times after class, and it's always been worth it!<br><br>The place is small and crowded always, but that shows you that it's a favorite for many! Love this place & I will be coming back very soon (probably today)!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/focirdqE4lmyIr5K-BbhHQ/348s.jpg", "caption": "Display"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RgU46WTCHPyPMyayU2zMvA/168s.jpg", "caption": "Palomilla"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/M3xjHyrG3xQ9RtLfB6Rxag/168s.jpg", "caption": "Steak chimmichuri"}]}}, {"review": {"des": "Best cuban sandwiches in town. I've been coming here for 3 years and it has never disappointed. Fast service, cute spot, and delicious food. My favorite is the pollo chipotle, but their vegetarian options are also superb. Make sure to try their cafecito (coffee) as well! Pretty sweet but so refreshing on a cold winter morning. Cafecito is truly a Chicago staple for me!", "pics": null}}, {"review": {"des": "Great food n value for money. <br><br>It's our first Cuban food n we love it! Full of flavors and generous in portion.<br><br>The queue can be long as it's popular (for good reasons) but the service is quick. However, u may not find a seat. So come before 12 or after 1.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WamCZDpDiyBLn2Zts_nSNQ/348s.jpg", "caption": "Ropa Viejas. Slow roasted skirt steak, sweet plantains, black beans, tomato creole sauce"}]}}, {"review": {"des": "Bad first impression: They were out of both items we were excited about ordering! No Ropa Vieja, no Exotica Salad.<br><br>Bad second impression: My friend got her Tilapia Sandwich and opened it up to find... lettuce and tomato. She went to the counter and they seemed annoyed, with a \"Sigh, not again\" kind of reaction. She got her sandwich but seems they've run into this problem before and they really should be more apologetic rather than annoyed with another member of the staff.<br><br>Bad third impression (though not really their fault): Their bathroom is shared with the hostel. You get a key card, go across the hall, up the stairs, swipe to go through the doors, go through a lounge area, and finally to the bathroom. Way too inconvenient. <br><br>* Chopped Salad - 1.5 stars<br>Ingredients weren't fresh, dressing had way too much vinegar. Really not appetizing.<br><br>* Jerk Sandwich - 3 stars<br>Tomatoes & lettuce were old. Chicken was fine but sauce didn't taste like jerk, more like a generic dressing. The bread was dry.<br><br>* Tilapia Sandwich - 3.5 stars<br>I tried a bite and this was good.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MGgqmIzT3qq_zUjIQMyEjg/168s.jpg", "caption": "Jerk Sandwich - 3 stars. Tomatoes & lettuce were old. Chicken is fine but sauce didn't taste like jerk. Bread dry. Fri lunch 2017-06-30"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pwrqH5_R5-UD8ekkly_QVw/168s.jpg", "caption": "Chopped Salad - 2.5 stars. Ingredients weren't fresh, dressing had way too much vinegar. Fri lunch 2017-06-30"}]}}, {"review": {"des": "First time trying Cuban coffee and I must say, it's delicious! I got the iced Cafe con leche and it was just what I needed in the morning. You could really taste the whole milk that's steamed in with the coffee. It's not like what I'm used to, but I actually like it a lot better. Very milky, but still has a strong coffee flavor! My boyfriend got their iced Caramel Latte (soy) and he loved it! We both agreed that coffee here is not on the sweet side like how you would get at most places. It's smooth, rich, and not too sweet. The taste of the coffee here is just so creamy, it's not dependent on sugar at all. It's more of an experience with coffee and milk than sugar and I appreciate that.<br><br>Also, prices are very affordable! Both our choices were $2.95 for a small and not only do they serve coffee here, but they're actually known for their Cuban sandwiches as well! Since we were already on our way to breakfast, we didn't get one to try but it was very tempting! Will definitely be back to try one day.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gYay3-G6XBWwIeKv2ULgXQ/348s.jpg", "caption": "Caramel Latte + Cafe Con Leche Cuban Coffee (so good!)"}]}}, {"review": {"des": "Great black bean soup, cubano and café con leche. Cute place very authentic and i brought my mom here and she too loved the black bean soup. Also love that they have 3 locations within the same location. Definitely sign up for their text messages too", "pics": null}}, {"review": {"des": "I wanted a quick and cheap lunch in the area so I found Cafecito through Yelp.<br><br>This location is right next to a hostel and there's a handful of panhandlers outside. The inside felt a bit grubby honestly.<br><br>They had quite a few tasty sounding sandwich options on their menu but I opted for the classic Cubano.<br><br>I liked that my order came out fairly quickly (5-10 minutes). I can't say my Cubano was mind-blowing but it was filling and cheap. For the price, especially in Chicago, you really can't complain.<br>I wouldn't go out of my way to come back, but Cafecito works if you want a quick and cheap lunch to-go in the area.<br><br>3.75", "pics": null}}, {"review": {"des": "Hmmmm. I wasn't amazed by the sandwich like everyone else. I did think it was good but not mind blowing.  Why the 4 stars... the price, caldo and pecan sandie type cookies.  Plus, the service is fast and you are in and out. This is handy at lunch because this place has a line but they move quickly while being customer service oriented.  I would go back just for the soup on these cold Chicago days. I ordered the sandwich ropa vieja sandwich.  The plantain was a nice touch.", "pics": null}}, {"review": {"des": "Great place to grab a coffee and healthy snack or lunch. They have plenty of vegetarian options for food and have non dairy milk in case you like your late with soy or almond milk just like I do.  <br><br>The service is nice and friendly and the place is great and spacious. Definitely a great spot in case you are looking for cafe where you can read your book or get some work done on your laptop.", "pics": null}}, {"review": {"des": "I ate here for dinner with colleagues who were excited to dine here. The food was delicious, the portion sizes were very large and it lived up to any Cuban food I've had at restaurants (nothing beats authentic home cooked). The price of the food for what you get is decent as well. <br><br>The reason I rated it down is because several things we tried to order were not available. Additionally we were dining there the last hour that they were open (note: not yet past closing time) and they started to flip up chairs on the tables around us and proceed \"shutting down\" despite us still dining during business hours. Nothing makes you feel welcome quite like that! In fact, when we did finish and were trying to exit the restaurant (mind you it still hadn't officially closed) we were actually locked in from the inside and my friend had to unlock the glass door to let us out as the staff had already retreated to the back. Perhaps if I went for lunch this establishment would have left me with a very different impression.", "pics": null}}, {"review": {"des": "The cubano was really good. The toasted bread makes this sandwich. Though I wish there was more roasted pork in it. The black bean soup definitely goes well with the sandwich. Overall good food. However not much space for seating in.", "pics": null}}, {"review": {"des": "I've been meaning to try Cafecito for quite some time, and I'm so glad I finally did - this spot is a great place to drop by for a quick, light lunch. I came in around noon on Tuesday, and the place was already quite busy. There were a ton of options for sandwiches, which made it hard to narrow it down to one choice, but I ultimately decided to get the La Costa sandwich (turkey, mozzarella, arugula, avocado, chipotle aioli & roasted red peppers) - super flavorful and perfect for lunch. My boyfriend ordered a steak sandwich (I think it was the Palomilla), and ended up loving it as well. I also decided to try the iced Cafe Con Leche - it's slightly sweetened, but the sweetness doesn't overpower the flavor of the Cuban espresso. My boyfriend tried a sip of mine and ended up liking it so much that he had to order one for himself before we left (and he's not even a coffee drinker). <br><br>Like most reviews mention, the line/wait can be pretty long during prime lunch hour. The space is also kinda on the small side, so you might have to take your order to-go or wait around a bit for a table to open up. However, the sandwiches here are delicious and very reasonably priced, so it's definitely worth trying if you're in the South Loop area looking for a quick bite to eat! I'll definitely be back, and I've already made plans to try their Cubano sandwich.", "pics": null}}, {"review": {"des": "Came here for a Ropa Vieja sandwich which I enjoyed because the meat was tender and the plantains were delicious. I also had a Cortadito which was so delicious.<br><br>I wish the employees were nicer here and more helpful. They called my name, there was no one there to give me the drink I ordered. I stood there looking at two drinks, then someone pointed to one of them. I opened it and realized it had no milk in it, and therefore could not be mine. Then I walked up and asked, then they said matter of factly that the other one was actually mine but didn't apologize or figure out whose drink I had. I then figured out that it was my friend's who had ordered a drink as well and handed it to her.", "pics": null}}, {"review": {"des": "Stopped here after a long day walking around the city around 5:30pm. Ordered one of the pressed sandwiches, La Costa, except with no roasted peppers. One of the best pressed sandwiches I've had in awhile! Great bread, fresh ingredients, bursting with flavor. Would 100% recommend to those spending time in Chicago!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/21NYcpTOd7WZsuwWEFcSwg/348s.jpg", "caption": "La Costa, with no roasted peppers. Amazing!"}]}}, {"review": {"des": "Pretty good! Food was great and came out super fast. Nice atmosphere and the service was friendly. Had the  Ropa Rojo Vieja platter and it did not disappoint. I would definitely come back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/J7TNBKXKHJf1GKCpEvN6sA/348s.jpg", "caption": "Rojo Ropa Vieja platter"}]}}, {"review": {"des": "Really wanted to give this place more than 3 stars, but the following prevented that from happening.<br><br>First I went and got a steak chimichurri sandwich.  I must say it was good, but what made it good was the sauce.  The steak itself was not seasoned at all and a bit overcooked.  <br><br>Second day I went to a different location and had the breakfast sandwich, eggs, bacon and cheese.  Again, the sandwich was good and so was the price, but the seasoning was non existent.<br><br>This might be just me, but it really bothers me when the food is not seasoned at all.  I don't understand how hard is it, to sprinkle a little salt or pepper.  <br><br>Price to value is 5 stars.<br><br>Taste - 3 stars due to lack of no seasoning at all.", "pics": null}}, {"review": {"des": "This is a great spot for grabbing a quick lunch bite.  They offer a variety of sandwiches and sides as well as strong cuban coffee, after all, their name is Cafecito.  Dining area is small and tables do not fit more than 3 people; I would say area is more of a lounge than a dining area.  Price for sandwhiches is pretty standard given you're in the loop (~$8).<br><br>The one thing Cafecito tends to lack is order accuracy.  I do not like onions and they tend to add them.  Once or twice is forgivable but I take my chances at this point because it's almost 50/50.  So, be on the lookout when adding/omitting items to your order.<br><br>Food suggestion: try the ropa vieja sandwich as it has a very similar taste to the dish but in sandwich form.  The Jerk sandwich is also very good; tangy with a kick of lemon - don't be fooled by the fact that it has habanero, you can't taste it at all. I like to think of it as a Cuban chicken vesuvio. <br><br>If you are looking for a heat \"kick\" to go with your meal, try the bottled salsas located by their condiment bar.", "pics": null}}, {"review": {"des": "Sandwiches are usually pretty boring to me, but at Cafecito, you don't get your average tuna or BLT. <br>On walking in, I was actually pretty surprised at how small it was. It is connected to a youth hostel, so there are tons of younger people here eating, studying, drinking coffee. Instead of a restaurant, think of it more like a cafe (with more food than Starbucks but the same idea).<br><br>The BF tried a rope vieja and I had the special for that day: the Espana, two very large sandwiches that look more like jimmy johns (in size) than a subway. <br><br>Everything is great about the sandwiches. The breading is super thick and dense (not exactly yeast friendly), the filling is unique and varied in textures and flavors (definitely some unique combinations!), and the sauces are ethnic.<br><br>Only regret is that outside of the subs, there's not much else, and the environment definitely is for young students - and very very casual", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_8I5ljK9eYz7C-3Iscw2jQ/348s.jpg", "caption": "Ropa vieja, this one is very sweet."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WnDoMmAadQM1pP7MnFlimQ/168s.jpg", "caption": "The Espana special: had chorizo, marinated onions,  potato,  egg,  lettuce, and bacon"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/drAQ7KaBegRw-CeQqOuBzg/168s.jpg", "caption": "Two sandwiches wrapped in paper and duck tape"}]}}, {"review": {"des": "Great prices for coffee and drinks. They also had a nice array of breakfast and lunch sandwiches, pastries and other beverages. The line was out the door so that told me people were all about this spot in the loop!", "pics": null}}, {"review": {"des": "Disappointingly mediocre.<br><br>Cuban was inconsistent, delicious in some bites and bland in others.<br><br>Ropa Vieja smelled like pizza and tasted like nothing.  I bit into a big chunk of fried plantain in the Ropa Vieja and tasted nothing, but felt all the textures within, was strange.<br><br>The bag of plantain chips (50 cents extra) was as expected.", "pics": null}}, {"review": {"des": "Cheap, fast, and delish.<br><br>Staying at the next door HI Chicago (btw, one of the best HI in the USA I've seen), a bonus point is you can get the authentic Cuban Sandwiches and coffee from here. Be ready for long lines during peak hours....", "pics": null}}, {"review": {"des": "7 dollars for lunch in the city of Chicago!! You just can't beat that. This place lived up to its hyped. I came around the lunch rush, so the line was out the door and it was hard to find a table. <br><br>Order the pork Guava-Q if you don't mind a sandwich covered in sauce. I still crave it sometimes. The pork was tender and the guava bbq sauce is fantastic. I wish I was able to buy a bottle of it to take home. We also got the chicken chimichurri. I don't recommend it, the chicken was very dry and honestly the sandwich was hard to finish. <br><br>Finish off your meal with one of their guava pastries. You won't regret it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ivAQsdff3UIKVH6Bw_ImgQ/348s.jpg", "caption": "Pork guava q"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-ySyn1BRqeIjy7jWNh6iiA/168s.jpg", "caption": "Pollo Chimichurri"}]}}, {"review": {"des": "Amazing <br>Simple and very savory.  Very authentic and delicious. Quick and filling. <br>Loving everything. About this place. Good for breakfasts lunch or dinner<br>Super nice staff. <br>I want them to open a spot in california <br>As a Cuban I vouch for the authenticity", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vIWAcNPhvi2jbS_oC4MoAA/168s.jpg", "caption": "Nice Chill spot"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jadMn8mgsGSbCFeWWyqBZw/168s.jpg", "caption": "Tostada. Cafe con leche y Palomilla"}]}}, {"review": {"des": "First time I went here, I got the Chivito because it had egg on it. Pretty solid! I wasn't blown away. The steak wasn't anything spectacular, but it hit the spot. Next time I got here I got the Guava-Q and holy fuck! That sandwich is something to write home about!!! Not only is there delicious, sweet, tangy Guava BBQ sauce but there are, like, chunks of Guava in the sandwich. What a great idea. And this shit is like $7! Really hard to find a better bang for your buck. Also, they have Jarritos.", "pics": null}}, {"review": {"des": "So many sandwiches to choose from--the variety is definitely a plus, since you can definitely choose something you like or something fun from among them. We had the chivito and tilapia criolla, both of which were top-notch. Lots of flavor and very satisfying. The tilapia was especially good; it was lighter than the chivito, which was quite meaty, but that allowed the fish flavor and texture to stand out. The fish was so soft that it broke apart quite easily, and everything was also very fresh. <br><br>For a drink we ordered a colada. Though called a pitcher for sharing, it really came in a small-ish cup. I was a bit surprised at the beginning (one wouldn't typically expect to share a drink of that size!), but it made sense given the amount of caffeine in there. Not sure I'd call it a pitcher, but that's okay. It was surprisingly sweet too--while the sugar was subtle, I would've been happy to have a bit less. Nevertheless, I really liked the taste of the espresso, which went really well with the sandwiches.", "pics": null}}, {"review": {"des": "This place has delicious sandwiches! I had the special which had sausage, peppers, spinach, fried eggs, and a spicy mayo (but not spicy). I really liked it except the spinach was kinda weird since it was not cooked and not seasoned. My mom had the jamon sandwich and said it was alright. The highlight was the bread. It's amazing. We also had hummus which was good but lemony. The reason for the 3 stars is seating is really hard to find at this place. People take their time here which is good but it doesn't leave enough seating for others. I'd recommend but it's not worth going out of your way to try it.", "pics": null}}, {"review": {"des": "I can't believe this place has such good reviews. That was one of the worst Cubans I've ever had. No pickles, barely any mustard, and dried out meat (the little meat that was even on the sandwich). The only thing going for it was that it had the correct bread, otherwise it was a terrible sandwich.<br><br>Black bean soup - meh. very standard.<br>Deli salads - again, very standard.<br><br>Sure its cheap but I'd rather spend a little more and get something actually good.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sDDX27Dpv0BPzJ692ia1TA/348s.jpg", "caption": "Terrible Cuban. No pickles, not enough mustard, dried out meat"}]}}, {"review": {"des": "After they lost my order and me waiting an eternity, I finally got my sandwhich and it was made wrong. I asked for no aioli, and it was slathered in it. I couldn't eat it, and couldn't stand waiting another 15 minutes for a turkey sandwhich. I threw it in the garbage and will never return. <br><br>Giving three stars because at least the staff is friendly.", "pics": null}}, {"review": {"des": "This Cuban sandwich cafe is conjoined with Hostel International Chicago - you have to ask for the bathroom key, which is upstairs at HI. It is a great idea to partner with HI because it provides a place for travelers to chill, grab a bite to eat, and meet other travelers.<br><br>I didn't sit in to enjoy my sandwich, but I got the Cubano - roasted pork, ham, swiss, pickles, and mustard. It was OK. The roasted pork was very dry, and the cheese was not melted and smoldering the pork to offset the dryness. Unfortunately, I should have paid more attention to the menu because I don't fancy pickles or mustard. I ordered the Cubano because it is the signature sandwich of a Cuban sandwich shop (and apparently the star of this shop)!<br><br>Would love to come back and try a churro or other dessert!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aOKj7xHTW4vDHHxExUt-og/348s.jpg", "caption": "Cubano Sandwich"}]}}, {"review": {"des": "tiny place<br>i order chimichurry sandwich<br>and sm soup to go<br>was no seat available to eat there<br>so i walk to the millenium park to enjoy my lunch there<br>the sandwich bland steak & bread no flavor the chimichurry no flavor just smash parsley  no taste <br>the bean soup  was ok", "pics": null}}, {"review": {"des": "Cool place with great service. The sandwiches were above average, I was expecting something great but don't let this stop you from getting a steak Cubano. if you're looking for a quick bite; this is for you", "pics": null}}, {"review": {"des": "I just moved across the street from a (Gold Coast) Cafecito. It was highly recommended. I am more than impressed. Food is delicious and affordable (Fresco salad with shrimp is my fav)! Happy hour is amazing with all specialty cocktails $5.", "pics": null}}, {"review": {"des": "Stopped in for lunch it's a pretty small spot next to a hostel.  Had to stay gluten free so ordered the chicken plate with rice and beans.  It came with sweet plantains and jicama slaw (which wasnt good). Service was pretty slow and a couple pieces of the chicken seemed like it wasn't cooked enough.  Giving this place 3 stars cause I know they're known for their Cuban sandwiches.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/olWFBxQgfDGJpkKxk9alDw/348s.jpg", "caption": "Chicken plate, took too long and wasn't that great"}]}}, {"review": {"des": "Was staying at the hostel next door and this was my first meal in Chicago for my recent trip. Had the lechon plate and it was AMAZING! The beans are so tasty, the meat just falls apart in your mouth and the plantains are the perfect amount of mushy sweetness. I could not get over how cheap this place is either considering how good the food is. Definitely a must if your in the mood for some good Cuban, and the small sticker price will make your wallet happy.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nvho-MLbglTR5BBUWKPDaQ/348s.jpg", "caption": "Lechon plate"}]}}, {"review": {"des": "The food taste was good, but the rice was under cooked and the maduros were room temp. Other than that I have 4 stars bc the place is promising, great atmosphere but let's get the food portion right. I'm thinking it was a hiccup?<br><br>6/23 UPDATE! I came back and tried the same plate and it was amazing! Rice was well cooked, well everything was. Coffee was right on! There was even a misunderstanding on my order, thinking I had ordered the sandwich vs the plate and they fixed it right away no questions! <br><br>Great customer service and great food will make me come back to this great Cuban Jewel!", "pics": null}}, {"review": {"des": "Quick food to table after ordering but bad business practices. Our party was missing a little of everything in our orders and nothing was remedied. They ran out of avocados and plantains but didn't notify us and just served us our orders without it. When we mentioned it after they have us the platters, they said they informed us about running out of those things. Didn't give us substitutions or refunds and just treated us like it was our fault. <br><br>Thanks! 0/100 would return. Meat was okay, nothing special. Beans were dry. Hot sauce was good. Rice was not cooked thoroughly.", "pics": null}}, {"review": {"des": "Came to study and ordered Ropa Vieja. Food was very good but needed either less meat, or more rice and beans to balance out the meal. After I finished the sides I felt so full and disgusted with the overall leftover meat. I like balance! <br>Platanos were tasty. Coffee was really good as well. <br>Realized it was not the best place to study, as people kept piling in, crowds stuffed the store, and noise was loud. Was good, but not good enough for 4 stars. I think the sandwiches would be delicious, but as today was a gluten free day, it could not be done!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/p7ypCJdz7RCJiunrxZyL4A/348s.jpg", "caption": "Ropa vieja"}]}}, {"review": {"des": "At Cafecito, I had no idea what to get in a very good way. There is this huge board with all the sandwich combinations that they offer and each one was so enticing that I didn't know what to do. I wanted to try so many but I even have limits. I finally settled on the guava-q and it was great. They aren't huge sandwiches but I restrained myself from ordering another. I also got the passion fruit batidos which was nice.<br><br>I would've given this place 5 stars but the staff were a bit slow even on an off time and gave me some push back on getting a receipt. But I'm assuming this isn't a common occurrence. If you're in the area, grab a sammie from Cafecito!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jNgKo_BMtgTdnxEOgmPGqA/168s.jpg", "caption": "Guava-q."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VQXLXm_SFT37NQMbQlNRZw/168s.jpg", "caption": "Passion fruit batidos."}]}}, {"review": {"des": "After my SO claimed he had the best sandwich he's ever eaten here at Cafecito, I had to try them out. And they didn't disappoint!<br><br>I beat the lunch rush and ordered the tilapia sandwich to go, and was out the door less than 10 minutes later. The sandwich was truly delicious! The fish was not dry at all, the bread was nice and toasted but still soft in the middle, and the toppings/dressing complemented the fish nicely. A really yummy and light sandwich!", "pics": null}}, {"review": {"des": "I'm absolutely obsessed with cubanos and Cafecito makes a good one. The cubano is such a simple sandwich, but the combo of pork, ham, swiss, mustard and pickles creates such a great flavor. The bread here has a good chew to it and there's plenty of meat. It gets pretty busy during lunch, but I usually come before noon to make sure I can get a seat. If you are looking for a legit cubano, look no further.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TF5pRs08IMDEyN2S9X5Tvg/348s.jpg", "caption": "The cubano"}]}}, {"review": {"des": "Delicious Cuban inspired foods are served at Cafecito. Having lived in Florida, I have tried multiple Cuban food establishments and this place is good. <br><br>The Chivito was a delicious sandwich. It reminded me a breakfast type sandwich. I also really liked their lechon meat! I got a platter and it the lechon was flavorful and juicy. This location does feel a little strange being located as part of a hostel right across the hall; however, the food I had was delicious.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WvZeGv4wqM4ZYeJL2f14uA/348s.jpg", "caption": "Delicious lechon."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/h_c5ChLFPmhhgiusXwB3uQ/168s.jpg", "caption": "Chivito!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KXrJGkb1ocECzKk7rigI1w/168s.jpg", "caption": "Exterior"}]}}, {"review": {"des": "Quick and affordable sandwiches! My friend and I swung by to check this place out after our Uber driver told us that we should try this place. We got the Cubano and the Jerk sandwich. The sandwiches were prepared quickly. There were also seating inside for people to eat there. Sandwiches were decent for the price!", "pics": null}}, {"review": {"des": "For hot sandwiches this is the place I go.  Their cuban coffees are all great and the chivito is pretty much all I order.  I order two for myself and end up always having half of the second one as leftover for later.<br><br>They have specials via text during the week at times, but I am not sure how I started to get those....", "pics": null}}, {"review": {"des": "Awesome Cuban eats in The Loop. This place is ALWAYS busy! I like to call my order in ahead so I can skip the line.<br><br>I knocked a star off because recently I ordered with them through Yelp/GrubHub, and they made the driver return to the shop with the receipt! The whole point of ordering through a service is convenience - I've never had to sign a paper receipt with Yelp/GrubHub/Uber Eats. You set your tip ahead of time, and pay ahead of time. So that was strange. I felt bad for the delivery guy. <br><br>That day they also messed up my order - gave me an extra sandwich and charged me for it. So it wasn't their best day. But it didn't stop me from eating there again, because their food is that good.", "pics": null}}, {"review": {"des": "My apologies but, being from Miami, I feel the need to inform other lovers of Cuban coffee that they don't make it properly here. <br><br>Traditionally, sugar is added to the coffee tin and then the espresso machine shoots directly onto the sugar. This seems like a small point, but it isn't. The super-hot espresso caramelizes the sugar and forms the nata, the delicious foam on top, unique to Cuban coffee.<br><br>At this place, they just make a bunch of espresso and put a bunch of sugar in it. That isn't colada. I ordered on 3 separate occasions with 3 different barristas before asking one about it, and she said that that was the way they were taught to serve it there. Made me sad, as I was really hoping to find good Cuban coffee here in Chicago after moving up.", "pics": null}}, {"review": {"des": "In town for a business meeting and decided I had to eat. This place is close to the hotel and seemed to have good reviews. Walked the couple of blocks and came inside. Ordered the cubano and cafe con leche.  Both came out quickly even though there is quite there crowd, a good sign in my opinion. The Cubano is excellent. Good blend of flavors. Coffee is the perfect pick me up in the middle of the day. Might have to stop by for breakfast tomorrow.", "pics": null}}, {"review": {"des": "Sandwich is great. But it wasn't even the one I ordered. I had to wait an hour during lunch time for it which is ridiculous! They served everyone else, even those who came after me within 10 minutes - I hope it's just a one time fluke, but I wasted a lot of time waiting for it. At least they gave me a free churro out of the whole ordeal.", "pics": null}}, {"review": {"des": "So we're in Chicago for the weekend and looking to eat somewhere within walking distance from the hotel.  I search Yelp and we decide on Cafecito.  Cuban sandwiches, coffee, pastries, salads what's not to like huh?  The line was long when we arrived and we almost left.  Super glad we didn't.  I can't say that I've ever tried authentic Cuban food and if this is authentic I'm impressed. I tried the black bean soup, it was so full of flavor and velvety I didn't want to share any bites with the little lady.  I could easily eat this a few times a month if I lived close by.  I also gave the Cubano sandwich a try,  the bread was perfectly smashed around the meat, cheese, and mustard.  Perfect for taking bites while sipping soup.  The pulled pork was packed full of flavor and tasted like it was slow roasted recently.  I think this is what make the sandwiches here so good well that and the bread seemed fresh baked also.  We sat in what I would call a living room area to eat.  A couch with a coffee table it was just like at home on those lazy Saturdays lunches when the table seems like to much of a hassle.<br><br>As I was leaving I decided to give the coffee a try.  I love coffee from all over the world and tried many country's versions.  I really like dark roasted full bodied coffee and that is a perfect description of this coffee.   Not so much to make you jittery, but get you through the early afternoon.", "pics": null}}, {"review": {"des": "Came for breakfast. Great breakfast sandwiches. Big enough we could've shared. Fun informal atmosphere with Cuban music blasting. Good Cuban coffee. Recommend!", "pics": null}}, {"review": {"des": "Okay, this place has nice food and drink.  My complaint is about the staff.  I was there today to meet people.  There was old style Cuban music playing, which is appropriate.  The kitchen staff (it's an open kitchen) decided to start blasting grunge rock, followed by Norteno Mexican music.  Both were playing at the same volume.  I politely asked the cashier if we could listen to one music or the other.  She went and spoke to the kitchen staff, who continued to loudly play their music.  She turned up the old Cuban music to disco level trying to drown it out.  Again, this is a coffe shop, and I was there for a meeting.  This went on for an hour.", "pics": null}}, {"review": {"des": "This spot is great for a quick meal and definitely much more casual than the Streeterville location that seems to be my go to as of late. As other Yelpers have mentioned, the food is here is great but the service could definitely use some improvement.<br><br>Ended up meeting some old college friends to have a casual dinner and just talk and catch up. For a Friday night, this spot was pretty mellow. Ordering is done at the counter and then you can grab a seat at any of the open tables as you please. It's a bit hard to hear them call out your name when your food is ready, so they ended up bringing each of our orders to our table. I went with the Tilapia Criolla platter this time around, which is essentially grilled tilapia with salsa criolla served with a side of rice, black beans, and plantains. Flavors were on point, but definitely the portion no where near as generous as the Streeterville location. Either way still delicious. For additional sides, I shared an order of their hearts of palm side which is our favorite.<br><br>Anyways, food is great and as I said service not so much. I could tell the employee that had to bring our order to our table was annoyed we didn't hear her call out our names for our orders. Also, cleanliness seems to be an issue here as some of the tables here were pretty filthy. Really no excuse for this as it wasn't that busy at all. Lastly, it wasn't clear what to do with our plates and silverware. I saw the employee kind of eye me and not know what to do so I awkwardly threw out the napkins and wrappers then put my plate back on the table and left.<br><br>'Til next time, cheers!<br><br>98/365", "pics": null}}, {"review": {"des": "We arrived at 8:45 pm, 15 minutes before closing, and ordered our food to eat in. It's a quick service format, so it was plenty of time for us to eat a sandwich and get out without inconveniencing the staff. It took 10 minutes to get the food, so 5 minutes to closing time. We opened the sandwiches and we're about two-thirds of the way through eating at 9:00 or a couple minutes after when an employee came over and asked us to leave because they were closed.  I know it's a balance, and it's incumbent on diners to respect closing time, but in a dine-in restaurant, the responsibility goes the other way as well, and the restaurant should be prepared for diners to be finishing their meals for a short time after the doors close.<br><br>The Cuban sandwich was pretty good. But my cortadito wasn't a cortadito at all.  Is was a tiny cappuccino. <br><br>Also, no plantains and no yuca. <br><br>Meh. Probably won't go back.", "pics": null}}, {"review": {"des": "Refunding your money should be the least of their concerns, when they serve undercooked plastic tasting chicken. <br><br>I got an arugula salad with chicken. My goodness - the plate was literally brought out when I found a seat. <br>I'm saying as soon as I left the register and finished paying to the time I sat down, they miraculously put my food together! <br><br>It tasted like rubbish. I couldn't chew the chicken.<br><br>They gave me every attitude possible to refund me.<br>I better not get sick.<br><br>Not coming back", "pics": null}}, {"review": {"des": "The other location is much better. Staff here is rude, tables are filthy with leftover rice and sauces-didn't want to eat there because of this. Food is usually quality though.", "pics": null}}, {"review": {"des": "Loved this place! We went in for a quick bite to eat and this place was the perfect place to choose. I got the Jerk pressed sandwich, which is Caribbean spices, marinated chicken, veggies, and habanero lime mayo. Everything about this sandwich was so good! The chicken was really well seasoned and the mayo added the perfect amount of kick to the sandwich - beware though, it can get pretty spicy! We also got coffees and they were delicious along with the sandwich. The prices are so reasonable and it's in a perfect location close to Grant Park.", "pics": null}}]}