{"name": "cafecito-chicago-2", "reviews": [{"review": {"des": "This place is so good! Walked about half hour just the get here from our hotel and it was totally worth it. The cafe is totally cute and the employees were so nice. <br><br>We ordered 3 different sandwiches (ropa veja, Cuban, and the steak chimichurri) All 3 were extremely flavorful. My favorite (and probably my daughters as well) was the ropa veja. The meat was so moist and extremely seasoned. I loved that the sandwich press was stuffed with tons of meat and there was also beans and a plantain inside. It was such a nice yet different experience for my mouth.<br><br>Cuban coffee was another item I ordered. Oh man was it good! It was nice and strong yet smooth. It's been awhile since I've had Cuban coffee this delicious. I need to make sure I stop here again before leaving Chicago.", "pics": null}}, {"review": {"des": "The sandwiches here are pretty good, but I wouldn't go out of my way to get it.  They cost about $7-$8 and are filling.  I tried the Guava-Q that comes with roasted pork or chicken, caramelized onions, guava bbq sauce, and jicama slaw.  I think I liked the Cubano slightly better (roasted pork, ham, swiss, pickles, and mustard).<br><br>There's enough seating for about 12 people inside.  This particular location is in the loop and good for those that are already nearby.  Parking around here is expensive, about $20+ for half an hour in a parking garage.<br><br>....| \\      _  , , , - - , ,  _  ,      <br>.../  , ` . - ' ` '             . _   \\ -  ;  ;  ;  , _    <br>..| ,  a  -   )   ) _         . ; .  (   ` - ` -  ' - '   <br>'  - - - ' ' ( _ / . _ ) - ' ( _ \\ _ )   2018", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0-biH__c4UoZMgzY-EOH8g/168s.jpg", "caption": "Guava-Q"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WT6QaULqEt1XC0UWM-Zm9A/168s.jpg", "caption": "Guava-Q"}]}}, {"review": {"des": "I walked into Cafecito on a Wednesday, at around 5PM, and all the tables had chairs on them like the place was getting ready to close, but I asked, and the server said no they were still open. So I ordered the chivito pressed sandwich (steak, ham, bacon, fried egg, mozzarella, lettuce, tomato, onion, citrus mayo), then moved a chair that was on a table down to sit at the table. This first part of my Cafecito experience could've gone better. <br><br>The sandwich, which came out to be about $9, was brought to me in a paper bag promptly after I ordered. The sandwich was delicious, but I thought it could've been seasoned more. Overall, it's a very convenient place for a quick bite. I'll have to try their coffee next time!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lu1MmoVJjtzGyArBvBbXcQ/168s.jpg", "caption": "Chivito"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/t_ZiSFU5kDFwiMV3kQFEWg/168s.jpg", "caption": "Chivito"}]}}, {"review": {"des": "Came here for a weekday lunch. Had heard that they did absolutely phenomenal sandwiches. Was very excited and hungry so my friend and I decided to each get a sandwich and split an extra one. <br><br>The space is very packed and gets quite a lunch rush. Would recommend coming earlier if you can to avoid the wait. Ignore this advice if you are a mosh pit enthusiast.<br><br>We got a cubano, tilapia, and Chivito. We had to wait a while longer since the tilapia takes a while to make. It's basically torture to see a bunch of people who ordered after you get their food before you. Would not recommend.<br><br>After about 20 some minutes we finally received our sandwiches. We promptly left to go eat somewhere a little less packed. We sat outside the Starbucks across the street. <br><br>The cubano was a little dry. The tilapia was structurally an ok sandwich but lacking in flavor. The Chivito seemed like it would be the best sandwich, but it was honestly kinda under seasoned as well. <br><br>None of these sandwiches were awful, but they just weren't particularly delicious. I think I would prefer potbelly 9/10 times.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jtLiCyaryqS0-FGUEjvW8A/348s.jpg", "caption": "Tilapia sandwich"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iHglhLeSkpYv3ao_s7-jIw/168s.jpg", "caption": "Cubano Sandwich"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sdLduq09AcMcI1wuWep9RQ/168s.jpg", "caption": "Chivito Sandwich"}]}}, {"review": {"des": "Came here during lunch time and it was very busy. I tried the guava Q sandwich since it was recommended a lot. Overall it was good, I liked the bread. but the bbq chicken was a bit too sweet for me and the it lacked some depth/layer of flavor.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4oh-XNPvrD2ZVgnyss_SOw/348s.jpg", "caption": "Guava-Q Pressed Sandwich"}]}}, {"review": {"des": "I stopped in on my last visit to Chicago for a quick bite with my friend before catching a train out of the city. The line was long, but it was totally worth it! <br><br>I had the Guava BBQ sandwich with chicken, which was hot, messy, and delish! We waited about 10 minutes in line to order, then about another 10 for our sandwiches to be ready. I have to say that I was pretty impressed with how quickly they were able to move so many people in and out of such a jammin' lunch spot. I want to say my tab was right about $8 after tax. <br><br>TIP: This place is under the Washington/Wells El Stop just a couple of doors down from the Arby's, if you aren't paying attention it's easy to miss when you're walking. There's street parking nearby assuming you can get a spot, other wise there are garages nearby. It's easiest to find on foot.", "pics": null}}, {"review": {"des": "Oh, Cafecito. Te adoro. <br><br>Full disclosure: I've only had their coffee, but it is amazing and reasonably priced. While I love me some Starbucks, Cafecito is a special treat.<br><br>I'll be back for lunch sometime, assuming I can endure the extremely long line.", "pics": null}}, {"review": {"des": "I had the Chimichurri flank steak platter and a Cuban coffee.  The coffee was really bad. I couldn't drink it because it was too sweet. If you use Starbucks as a benchmark for average coffee this would be well below that level in taste and quality. <br><br>The food was much better and really liked the plantains and the rice. The flank steak was a bit tough but the chimmichuri helped make up for that with some fat and acidity. Not much seating available and would be better to order take out than dine in.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jsLf2vlwkMmKsWtohpDUTQ/348s.jpg", "caption": "Chimichurri flank steak rice plate"}]}}, {"review": {"des": "I was in Chicago for a work event and while looking for coffee and breakfast places in the area noticed a number of Cafecitos. As a Miami expat who constantly jones for good Cuban food, I had to go.<br><br>The location I arrived at was close to both the hotel and the office, a tiny little spot that did evoke some Miami memories. My biggest complaint was only one location does croquettas. No bueno. Fortunately they did have pastellitos, Cuban toast, cafe con leche, and colada. I got one of each, the last for my team.<br><br>I really enjoyed the cafe con leche, it warmed me and my heart with nostalgia, and the guava y queso pastellito. The Cuban toast wasn't on a baquette but was still enjoyable. The Colada I got for my team was a let down. Real Colada is supposed to hit you in the face with caffeine but this was just okay. <br><br>If in Chicago and needing Cuban, I would definitely come here. I also heard the sammiches are good. But if looking for the authentic thing in the states, you'll have to settle with Miami.", "pics": null}}, {"review": {"des": "The place is cozy, it has a few tables inside. I had the palomilla (steak pounded thin) with rice and beans. I was pretty disappointed with the rice it was over cooked but the beans and plantains were on point. I def would come back to try the cubano though!", "pics": null}}, {"review": {"des": "Cafecito did pop up on food places to check out in Chicago, but never really planned on stopping by. At first, I seriously wanted to eat at Pret A Manger around the corner. After finding out that they don't prepare fresh hot sandwiches, I quickly found Cafecito's name pop in my mind. Besides the tiny dining space, this place makes great dishes and sandwiches at great prices. Also try their key lime pie. To die for! I'm a fan of Cafecito!", "pics": null}}, {"review": {"des": "This review is for coffee only.  Cafecito was walking distance from our hotel, so we decided to pop in on our first morning in Chicago. The cortadito was yummy!", "pics": null}}, {"review": {"des": "The food and price are all worth a 5+ star rating. But the wait is horrible. The line is always out the door and service isn't the quickest.<br><br>The sandwiches are fantastic. My favorites are the Ropa Vieja and the Chivito.<br>The ropa vieja has plantains, skirt steak, and a creole sauce which is fantastic. It's a great flavor with a little bit of sweetness as well. <br>The Chivito steak and eggs but this fantastic citrus mayo as well. Although the sandwich is small, it's a little on the heavy side and will therefore do a great job filling you up.<br><br>As great as Cafecito is, just be sure you leave enough time to go because you'll have to wait to order and then wait to pick up the food.", "pics": null}}, {"review": {"des": "I love this place! We got the guava q for $6.79. I thought the sandwiches we got were reasonably priced for the portions. The guava q is so good. The bbq sauce is sweet but not too overbearing. It's has jicama slaw which I thought was a nice touch. It added a different kind of texture. I got it with chicken. I'm sure the pork is really good.<br><br>The Cubano was okay. It was $6.49. I wasn't really a fan of it but it wasn't bad either. I felt like there was too much mustard and it was missing a different kind of meat.<br><br>They didn't have batido the morning I went but someone suggested a chai latte which I thought was amazing! It tasted like horchata but had more of a cinnamon taste. It was really good and i definitely recommend it. <br><br>We also tried the guava cheesecake. At first, you're like oh wait this is different and trying to figure it out but it ended up tasting like a regular cheesecake after a few bites. It was somewhat dry and grainy. It wasn't my favorite but I'd get the flan next time. <br><br>The atmosphere is amazing! They played awesome music and the vibe was just great. Everyone was happy and friendly. It made a better experience. <br><br>I 10000000% recommend this place. I would come back again to try the other sandwiches they have. Definitely bringing friends along.", "pics": null}}, {"review": {"des": "CAFECITO is my only go to place when I'm craving a good Cuban sandwich. All the sandwiches here are excellent and good. But nothing like having a good pressed Cuban samich. Pressed to perfection, han, pork, cheese and mustard are married perfectly. Bite after bite a satisfaction like no other. So good I got one to go, so that I can eat it at the hotel after work. And even with no microwave, straight out the fridge it was satisfying. I almost forgot. Got me a cafe con leche and it took me back to how real coffee and milk is supposed to taste like. Sweet, creamy and satisfying.  Nothing like good food. Cafecito hits the spot each and every time. Staff is always wonderful.", "pics": null}}, {"review": {"des": "It's true what they say, 3rd time's a charm.  The first two times it was bad.  The first time they forgot my order, I wait in line, outside even and placed my order for beans and rice and then waited again behind the sandwich and coffee orders, total of about 30 minutes.  I ask the girl finally after the people behind me were getting their food: \"it's only beans and rice, why is it taking so long?\"  She nonchalantly tells me that she forgot to put in my order.  I get reimbursed and walk out.  <br><br>The second time a co-worker brings me one of their sandwiches, not bad but it wasn't -wait in line outside for a while WOW- it was ok.<br><br>This last and third time they were out of bread, but luckily the Gonnella truck was outside bringing in the fresh stuff.  I waited a total of 18 minutes for my breackfast sandwich but it was worth it.  Incredibly fresh bread with egg, cheese, tomato and chimichurri.  I also finally got my rice and black beans! :)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/89UTyzX69z2i4JHtGSTjhw/348s.jpg", "caption": "Breakfast sandwich of egg, cheese, tomato and chimichurri with black beans and rice on the side."}]}}, {"review": {"des": "Great spot for a quick sammich. So many delicious options!! I decided on the Ropa Vieja. The sweet plantains in the sammich was the perfect break in between bites of the slow roasted skirt steak. <br><br>Came at 11:30am on Friday and was met with a line that moved fast. There is limited seating so we took our sammiches to the Riverwalk for some people watching.  <br><br>Will definitely be back to try the Chimichurri.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3sI4MvU0MqCF-j6kK8L9gg/348s.jpg", "caption": "Ropa vieja sammich. So delicious!"}]}}, {"review": {"des": "Came here on a weekday for lunch during work and it will soon become one of my favorite spots for lunch.<br><br>There was already a line around 11:45am. My friend and I got a Cuban sandwich and chimchurri sandwich. We both agreed that the cuban sandwich was our favorite. The portion side is perfect for me--but some may find the sandwiches on the smaller side. <br><br>Overall, fast service and reasonable price. Would recommend for a work lunch.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZzITiFNszfwRbBXlXUI7XA/348s.jpg", "caption": "half Cubano half chimchurri (swapped with friend)"}]}}, {"review": {"des": "Popped in here for a quick ~cubano~ : <br><br>Line was outrageously long, but for good reason.  This sammy was hot, fresh and gooey with cheese and mustard.  Made the way cubanos were meant to be made.  <br><br>I felt as if I were cast in the movie \"Chef\" as Oliver Platt and was eating out of Jon Favreau's food truck. Not sure Cafecito would go into business with me, like in the movie...but i'll be a long time customer none-the-less. <br><br>Cheers", "pics": null}}, {"review": {"des": "Quick update:<br>I had lunch here again, this time with a friend, and had the same experience: A-Ok.<br><br>This time I had the Ropa Vieja and it was pretty tasty. The only downside is that I didn't find it to be a very sizable portion. Actually, that only pertains to the sides: I'd like to see more rice and beans.<br><br>The other thing to note is that this place gets BUSY during the normal lunch rush so, if you want to eat-in, you better arrive early. In fact, they seem to be more accustom to catering to the to-go orders as opposed to the dine-in... our order seemed to take longer than others that were grabbing and going and, at the end of the meal, we didn't have a clue what to do with our plates - and the staff seemed confused as well!", "pics": null}}, {"review": {"des": "If you don't mind standing in a crowd while waiting for your food which you shouldn't for this! Then make some time to stop by for a sandwich or plantains and a cup of coffee.", "pics": null}}, {"review": {"des": "Be prepared to wait 15ish minutes if you come during peak lunch hours (11:30-2PM). The space is tiny and there are about 10-15 seats in the whole restaurant. Their food however, is amazing. Great flavors, tastes fresh and decent portion sizes. I tried the steak chimichurri platter and guava-q pork platter (both $11). Definitely will come back to try their sandwiches and coffee.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/A9LV-W4rulpvXULbAoMoug/168s.jpg", "caption": "Steak Chimichurri Platter"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ugLwd2w4tFEMoMO0LWPgGQ/168s.jpg", "caption": "Guava-Q Pork Platter"}]}}, {"review": {"des": "This place is right next to my office and have awesome Cuban sandwiches for a reasonable price.  I haven't ran across any sandwiches I didn't like yet.  The lines tend to be really long out the door during lunch time but you can order pick up from Grubhub.", "pics": null}}, {"review": {"des": "Super cute, small location it's your traditional Cuban doffed spot with all types of bakery goods including : guava & cheese pastries, flan, arroz con leche ( rice pudding), pan con mantequilla , Cuban sandwiches and a variety of breakfast sandwiches  as well as lunch and dinner combos! There's a Starbucks across the street I hope you'll make a wise decision and get some Cafecito!", "pics": null}}, {"review": {"des": "I ordered the ham and egg sandwich with cheddar cheese.  It was $4.99 and comparable to other breakfast sandwiches in the area albeit a bit bigger and made on fresh and soft Cuban bread that was hand pressed.  It was pretty good although it could have had butter or some type of dressing on it to \"dress\" the flavor up a bit.<br><br>I also ordered the Mate Soda.   Mate is a tea from South America (specifically Argentina, Chile, Paraguay and Uruguay) that is a favorite with locals.  The soda was sweetened and had a bit of a lemony flavor-the only difference is that it was carbonated.  I enjoyed it.<br><br>FYI-be prepared to wait 5 minutes or so as it takes awhile because the sandwiches are made fresh on request.<br><br>Will return to try the coffee choices!<br><br>Also Grubhub voted it \"The best Jerk Chicken Sandwich.\" (sticker on the wall says that) among other accolades and news articles covering the wall.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WZL1xDnvxKber0vGPvr0dw/348s.jpg", "caption": "Inside peek at the egg, ham and cheddar breakfast sandwich!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YvS5XzpPnNg5TZWDTmvClQ/168s.jpg", "caption": "Yerba Mate Soda=carbonated tea popular in South America that is sweetened=very refreshing!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mBn1uA_5YqQB6bVq6yv0tw/168s.jpg", "caption": "Close up of egg, ham and cheddar breakfast sandwich"}]}}, {"review": {"des": "The sandwiches here are SOO good. Nice price. The coffee is also good! <br><br>Ordering in person is way faster than ordering online. So just order when you get there if you were thinking to order online 10 min prior to.(not worth It)<br><br>I've had the ropa veija and the chivito and both are soooooo good. I've been here twice and I would definitely recommend It and come back as well. <br><br>It's located right off of Wells near the train. Easy to get to. The place though is very small and very crowded during the lunch time rush (12-2).  So expect to wait about 10 minutes for your food. Better to just do take out as well due to the lack of space.", "pics": null}}, {"review": {"des": "This place is always packed around lunch time and it's a relatively small sandwich shop so be prepared for the crowd. Pretty solid sandwiches at a good price - most are $7-8 and the platters are more expensive. I got the steak chimichurri sandwich and it was good but nothing great. The steak was a bit dry and the sandwich was light on the chimichurri sauce which could have helped add flavor and moisture.", "pics": null}}, {"review": {"des": "As a newbie to Cuban food, Cafecito was great!<br><br>Seating was limited, so I wouldn't recommend bringing a big group here (no outside seating).<br><br>Cafecito has a good variety of sandwiches. I went after work around 5:30PM and it wasn't very busy. We were able to look at the menu and order right away. <br><br>I ended up going with the Pollo Chipotle Pressed Sandwich. The sandwich came out in 5-10 minutes and we dug in. I was so impressed! The bread was crispy on the outside and warm and soft on the inside. The bread to filling ratio was perfect; it wasn't hard to eat. The sandwich itself was delicious and the ingredients worked well together. The best part? It only cost $6.40 (before tax)! The amount of food you get for that price is unbeatable!<br><br>I did notice their sign for their frequent buyer program and after 7 sandwiches you could get one free (Stampt). I love restaurants that have programs like this! I will be signing up the next time I go. <br><br>Cafecito - I will be back.", "pics": null}}, {"review": {"des": "I was a bit surprised that my experience was not what many others seemed to have described here. Compared to other cubans I've had I didn't find the bread to be particularly tasty, the pork was lacking flavor, and the ham used was cheap enough that it had a chewy/stringy skin around it. Their service was very nice and fast despite the line outside the door but I guess you get what you pay for here w/ the cheap prices. <br><br>If you're looking for a mind-blowing cuban I have to recommend Puesto up in Lakeview near Wrigley Field.", "pics": null}}, {"review": {"des": "I still get the steak chimichurri pressed sandwich. However, the aforementioned free coffee coupon in my review is no longer available. They do have a frequent buyer program on Stampt (must download the app) where you purchase seven sandwiches and get one free. I missed out on the 11 times I checked in here, ahhhhh!!<br><br>Also, I recommend calling in and picking up your order to bypass the line. You'll feel very cool surpassing the many people when you head straight to the counter. *insert sunglasses smiley emoji*", "pics": null}}, {"review": {"des": "The Cafe con leche is delicious from this place, they also have delicious breakfast and lunch sandwiches", "pics": null}}, {"review": {"des": "I love this place and its dangerously across the street from my office. My major complaint is that the line at lunch is usually out the door. I've found its better to get my sandwich early as they offer the full menu when they open at 7. They just don't always have everything prepped first thing - like plantains for the ropa vieja. Coffees get pumped out pretty quickly so there's just a short wait for the espresso machine. They offer soy milk as a dairy alternative. <br>The last star is because the meat on my breakfast sandwiches has been pretty skimpy. It's a $5 sandwich so what can I complain about? Also, in my opinion, nothing really compares to cafe marianao in terms of taste and authenticity.", "pics": null}}, {"review": {"des": "Very good cuban here. The line is no joke -- I visited at 11:35am on a weekday and there was essentially no line but literally a couple minutes later around 11:45, the line was already pressing up to the door, so order ahead if you can. Wish it didn't feel as packed in there but I guess it's a testament to how good the food is.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SsZYQ4h58LcA4NueYcj7VA/348s.jpg", "caption": "Cubano"}]}}, {"review": {"des": "Loved this place !<br><br>Everything is just great.<br>Loved the -<br>Pollo Chipotle<br>Jerk chicken sandwich<br><br>They also have some great breakfast sandwich.<br><br>Make sure you get the timing correct,it is usually bustling with people !", "pics": null}}, {"review": {"des": "My coworkers and I go here weekly. I always get the cafe con leche (great both iced and hot) along with a breakfast sandwich (bacon/egg/cheddar). Never gotten their lunch sandwiches personally, but my coworkers are big fans, and there's always a line out the door around 12-1pm at this location.", "pics": null}}, {"review": {"des": "1) Washington/Wells is my stop in the morning.<br><br>2) I am really bad about eating breakfast at home.<br><br>3) ???<br><br>4) Cafecito profit!<br><br>I've been here for lunch many times, and it's fantastic. But this is my regular breakfast spot now. All of the sandwiches are tasty (Cuban bread rocks) and the iced coffee does the job for $2.", "pics": null}}, {"review": {"des": "You know those New Yorkers who complain about sandwiches everywhere they go? The ones who say nothing is as good as home and they'd rather \"pass\" when you go to a deli or place for any type of sandwich? Panini, pressed, cold, etc? The bread isn't as good, the side dishes are meh and the ingredients are questionable? Yea, that New Yorker is me. I'm sorry. I really am. I don't mean to be elitist about my delis and quick bites, but I've been spoiled the majority or my life and now just won't settle. It's with this mentality I walked into Cafecito. I had just landed in Chicago and got to my friend's place. We were starving and she suggested it because it's close to her and \"delicious\". Sure, whatever you say friend. Who was I to argue, I was staying with her for free. <br><br>I will be the first to tell you - everything I assumed about Cafecito WAS WRONG. This place is amazing. I pray they open one in DC, in my apartment building. <br><br>I couldn't get passed my sandwich snobbery so I ordered a platter. I got the Mojo Shrimp which comes with rice and black beans and plantains. The lady at the counter was more than patient as I read everything fifteen times before deciding what to get. (This is a luxury I'm not afforded when I'm back home in NYC). We waited at one of the small tables and shortly, they brought our to-go food out. As we walked out of the building (Cafecito is at the bottom of an apartment building), I heard someone call my name. I turned around and someone from the restaurant was following. He said they forgot my plantains and I couldn't leave without them. I agree sir, I agree. <br><br>We went on my friend's roof top and opened up our bags. Smelled delicious-first good sign. I opened everything and hesitantly took a bite of the shrimp...AMAZING. Then I hesitantly took a fork full of rice and black beans...AMAZING. Lastly I bit into a plantain...OH MY GOD. Needless to say, I ate every bite of all of it. I wanted more even though I was full and if we hadn't had reservations for dinner I would've eaten the same meal again. <br><br>Do not hesitate to go here. Run to Cafecito to eat their delicious food. My only regret is I didn't order coffee. I cannot wait to fly back to Chicago so I can eat there again. Unless they decide to start delivering to DC.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZPcJJ0qK3LE-AQyZs78vyg/348s.jpg", "caption": "Mojo shrimp platter with plantains, white rice and black beans. The only picture I took because I couldn't stop eating."}]}}, {"review": {"des": "I usually stick to Bustello when I need a coffee fix. I saw they had it displayed on a shelf where all the other brands were. So I asked for a medium cup of Bustello. I was looked at in confusion and asked, \"What was that?\" I was surprised the cashier and barista were unaware as Cafecito is a Cuban cafe. I told them it was a brand of coffee and it was behind them, they looked and laughed. The cashier said it was only there for decoration. I found that stupid but what are you going to do? So I ordered a coffee with milk. It wasn't bad but nothing to write home about if you've tasted the real thing. I feel three stars is fair.<br><br>I do feel the need to share that your clothes will smell like a Cuban kitchen if you're inside for longer then ten minutes. So if you're heading to or back to work down, be sure to order To Go!", "pics": null}}, {"review": {"des": "Cheap quick eats. Gets pretty crowded during mornings. I ordered a bacon, egg & cheese (cheddar) breakfast sandwich and a small hot coffee. Wait was about 5 mins for the sandwich which wasn't bad. However; the coffee was burnt and the sandwich was taste-free.  This place if is good if you just want something to fill the hunger but if you're looking for quality, this place ain't it. Pass.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/y_qo4s1rxu8dclkgONEXew/348s.jpg", "caption": "Bacon, egg and cheese sandwich with very little bacon and burnt coffee to go."}]}}, {"review": {"des": "Amazing Cubano sandwich. Their cafe con leche was also delicious.", "pics": null}}, {"review": {"des": "Saw this place on Yelp and figured I would walk over at lunch time and check it out.  Apparently, so did many others, there was a line, but it moved pretty fast.  The place is small so I wouldn't expect to eat inside at lunch time unless you want people standing over your table as they wait for their to-go orders.  The sandwich I had, chipotle chicken, was great and I would return for another.  Everything on the menu looked amazing.  Don't be deterred by a long line though, it moves quick.", "pics": null}}, {"review": {"des": "I've come into Cafecito a handful of times. I usually get one of the cuban coffees and an egg and cheese sandwich. The price is awesome. Sandwiches are filling and delicious. Cuban coffee really good. I would avoid the regular coffee though. Both times I got it, it was burnt. But cuban coffee is really good. And you really can't beat the price. Coffee and sandwich (good size) is $6-$8.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KHNUAok7hZIllpH4bV-nnA/348s.jpg", "caption": "Egg cheese sandwich (cheese choice of mozzarella, Swiss or cheddar)"}]}}, {"review": {"des": "I am OBSESSED with their steak chimichurri sandwich and their guava + swiss cheese sandwich. Their black bean soup and potato sides are stellar as well.<br><br>This place is legit; great for carnivores and vegetarians alike. I've only been here during the lunch rush but while the lines go out the door, service is fast and I've never had to wait for more than 15 minutes for my sandwich. (Their sandwiches are heaven, by the way. And cheap! so cheap.) <br><br>I need to wake up earlier so that I can swing by here (it's right next to the Washington/Wells L stop) for a cafe cubano and a breakfast sandwich one of these days.<br><br>There's minimal two-top table seatings and a few seats by the window, but I recommend taking your food to go, either back to your office or for a nice lunch on the Chicago Riverwalk.", "pics": null}}, {"review": {"des": "Love the guava-q! <br><br>This location is small and busy during lunch, but service is quick and friendly.", "pics": null}}, {"review": {"des": "Gotta get my cuban sandwich fix!  This place has THE best cuban sandwiches in the loop and amazing cuban coffee.  It's located right outside of the Washington/Wells stop, great for a bite in the morning - they have tasty breakfast sandwiches and amazing coffee.  If you've never had cuban coffee, you're missing out because that stuff will WAKE YOU UP.  The cafe con leche is bomb, it has an awesome aftertaste and you can just tell it is made with care.  Sometimes I go out of my way just to get the cafe con leche and if my office didn't have free coffee everyday, I would spend a heck of a lot more money here.<br><br>Pro tip:  If you plan on coming for lunch, plan on getting there before noon or else you're going to be waiting for awhile.  You can be one of those people that orders ahead of time during rush hour, but let's be honest that takes a lot of work and those people are annoying.  So just get there before noon and you'll be fine.  This place is staffed for the lunch rush, they churn out sandwiches as fast as they can.  In terms of what type of sandwich to order, my favorite cuban sandwich I've had so far is the Ropa Vieja.  It has meat, beans, plantains, and a sauce that all kind of blends together every bite. They are smaller sandwiches but you can tell that they are using quality ingredients, I wish the sandwiches were a bit bigger if I'm being honest, but it will definitely hold you over for a couple hours.  <br><br>The service is good, they do the best that they can during the lunch rush.  I wish the place was bigger honestly because there's never a place to sit down, it's that packed and I either have to awkwardly eat in the street or wait to eat it back in my office (which trust me, with a sandwich like this, that 10 minutes seems like forever).  Keep doing what you do, Cafecito!", "pics": null}}, {"review": {"des": "Cubano and Jerk sandwiches were good! Asked for a Guava BBQ side and a Mojo side, both great sauces. The iced Cafe con Leche was highly recommended by my friends!!<br><br>Really crowded during lunch time so expect a long line.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UUJsqhWTxMONIWNJyd8aiQ/168s.jpg", "caption": "Cubano"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/guJP6DFR0KBQmCgr8R81Jg/168s.jpg", "caption": "Jerk"}]}}, {"review": {"des": "Finally went in for a Cubano and was not disappointed. Delicious sandwich! I must say it had more flavor than many of the Cuban sandwiches I had whilst living in Miami! <br><br>I went at an off peak time and only had to wait a few minutes. You can call ahead if you don't want to deal with the super long line. Can't wait to go back and try the rope vieja and cafe con leche.", "pics": null}}, {"review": {"des": "The sandwiches here are so delicious, both breakfast and lunch! I also love the cafe con leche which is cuban espresso with steamed milk. The loop location definitely gets very busy around lunch time but it's worth it! There are a few tables to eat at but I would recommend just taking it to go when it is busy. I'm not a fan of swiss cheese so I haven't tried the cubano but I can attest to the jerk sandwich and huevos chimichurri breakfast sandwich. Both delicious and warm!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xXTG4IVpm-Z4VEDgFk39sg/168s.jpg", "caption": "Jerk Sandwich"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PEryeHaPnoHeAk3CA8KXEQ/168s.jpg", "caption": "Huevos Chimichurri (breakfast sandwich)"}]}}, {"review": {"des": "One of the best affordably priced sandwiches in Chicago. The lunch line will be long, but it moves quickly.", "pics": null}}, {"review": {"des": "The Cuban sandwich is decent, but not on par with a great Cuban restaurant like Margon in New York.  When I went, the service was slow and the restaurant was crowded.  I found the the sandwich to be somewhat dry.  However, it is close to the Chicago area theatres, and you can pick up lunch....just leave enough time to wait in line.", "pics": null}}, {"review": {"des": "Great sandwiches but they're ridiculously disorganized. Orders coming out in no order at all, to the point they just plain forgot to make my sandwich. The FOH staff seemed more interested in celebrating their coworker's birthday than paying attention to their orders. When you're a popular counter service joint in the Loop, maybe wait until AFTER the lunch rush?", "pics": null}}, {"review": {"des": "My bf and I came here one afternoon during the week. I ordered the cubano with no pickles and he ordered the chivito sandwich and the black bean soup. Both sandwiches came out within a reasonable amount of time and the employee serving us was friendly and helpful. The sandwiches were both very good and the soup was decent. I would like to go back again to try the breakfast sandwiches.", "pics": null}}, {"review": {"des": "If you enjoy Cuban food this is a great grab and go spot for breakfast or lunch! I work nearby so I am lucky enough to frequent it for both. <br><br>There are only two or three tables so I definitely wouldn't plan on dining in, but don't let that deter you from going! My favorite breakfast sandwich is definitely the Bistec Con Huevos made with steak, eggs, grilled onions, and your choice of cheese (I like the cheddar with it best). For lunch I would strongly recommend the Ropa Vieja sandwich made with slow roasted skirt steak, sweet plantains, black beans, tomato creole sauce. I also enjoy a side order of rice and beans. They do come premixed which I think is awesome, but not expecting the first time so heads up.<br><br>The line does get pretty long (out the door sometimes) so I would suggest taking an early or late lunch. A well kept secret is to call ahead and place your order. People hate you when you skip the line to pay and pick up, but hey a girl's gotta eat!<br><br>The only complaint I have is that they don't make the Ropa Vieja on some days so I like to call ahead and make sure they have it if that's what I'm craving.<br><br>Last but not least their Cuban coffee is awesome. Café con Leche all the way!", "pics": null}}, {"review": {"des": "Been going here for years and it's always delicious!  Lots of options and decent prices.  Staple lunch food!", "pics": null}}, {"review": {"des": "Oh em gee!! Best Cuban sandwiches EVERRRR!! I don't even have anything bad to say about this place. <br><br>Their location is very small but there's a few seats in there so you can make some room one way or another. To star off I had their cafe con leche - it's steamed milk with coffee (so simple but delicious). <br><br>The sandwich I ordered was the steak chimichurri, WOW! I'm still dreaming of it!!! It was just perfect in flavor and just everything about it was delicious! I also got to try the lechon and the cubano...also pretty darn good!! <br><br>Soooo sad there's no Cuban place like that in LA. I have my favorite Cuban spots here but until I tried this place it doesn't compare. Until next time!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IfgfSXbt55pbw7MpfAkeog/348s.jpg", "caption": "Most amazing sandwich ever!!!! Steak chimichurri"}]}}, {"review": {"des": "Outstanding, simply outstanding!!!! Was visiting Chicago this past weekend and our group needed a small bite and coffee, well we had found this place and thought would be a great quick stop for a meal. Upon entering we realized it was a tiny location, honestly it didnt look like much but thanks for the reviews we stuck around and gave it a shot. <br><br>We were overblown why the amount of flavor both their coffee and food has coming out of this place. It was absolutely amazing. I had the simple \"Cubano\" ( ham/cheese/mustard) sandwhich and it was amazing. We also tried the Chimichurri beef and it was great. We were not satisfied so had to go back for another one. Their coffee was also very tasty, dark, but with lots of flavor. <br><br>I will be back to this place for sure, there are long lines during the lunch hour but its worth the wait, plus the line moves quite quickly so do not be drawn away.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yJRRDcHYbxma_bUPr1vcaw/348s.jpg", "caption": "El Cubano was tasty"}]}}, {"review": {"des": "Food and coffee are delicious. The problem is that they've been tipping themselves on credit card transactions. Happened to me as well as a colleague. Pay with cash.", "pics": null}}, {"review": {"des": "So happy to have found an awesome lunch spot near work! Sandwiches are flavorful and crispy. It gets packed during lunch - which says something about how great their food is! Ordering is disorganized and slow at this location specifically. I ordered pick up and they ran about 10 minutes behind. So prepare to get there before the lunch rush or wait! <br><br>It's a small space with not much seating so I suggest that you order for pick up/to go.", "pics": null}}, {"review": {"des": "Very small place. The other location is bigger. But the food is still good. Must be a popular lunch spot because the entire time I ate, there was a constant line of 2-4 ppl.<br><br>I ordered the ropa vieja pressed sandwich (steak, black beans, plantains, and tomato creole sauce). BOMBBBB! A little messy. Sooo good! And only $6.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/apjPcQo-jbpUNkApPrmX4Q/348s.jpg", "caption": "Ropa vieja. Looks messy but delicious."}]}}, {"review": {"des": "Right off the Washington & Wells line. When I make my transfer to the pink line - I look down and notice Cafecito. After wanting to try it for sometime, and having gone to their Streeterville location - I knew this would be a great place to grab some breakfast/lunch to go.<br><br>It gets busy in the mornings! Expect a 10-15 minute wait for your freshly made sandwiches.<br><br>One day, I didn't pack a breakfast or a lunch so I stopped by here to order both. ~$11.99 for 2 meals, not so bad! Got the jamon with cheese for breakfast and chimmichuri steak sandwich for lunch. Even eating the cold sandwich for lunch was decent - probably woulda been a lot tastier fresh though.<br><br>Love that I can count on this for an easy lunch if I ever am too lazy to pack mine. <br><br>Things to note:<br>Download the Stampt App. Ask for your receipt, and upload your receipt onto the app. Buy 7 sandwiches and get 1 free! (I'm saddened after buying 2 sandwiches and not asking for my receipt to upload them.. learn from my mistake!!)", "pics": null}}, {"review": {"des": "Not surprisingly, I ordered the famous Cubano and the cafe con leche. The Cubano was so good! I saved half in my backpack for later and still savored it when it was cold two hours later. The cafe con leche was a little sweeter than I'm used to with my coffees, but I got it iced and it was a great pick-me-up and really refreshing for such a hot day. My friend got the steak chimmichuri and it wasn't very good. The steak was very bland and it felt like the chimmichuri was just trying to make up for it and unable to compensate. My other friend tried the turkey la Costa sandwich and it was very good.", "pics": null}}, {"review": {"des": "My husband and I we definitely love this place, it taste like the food that your mom is making at home. Everything we had try so far is so.good", "pics": null}}, {"review": {"des": "Best Cubano sandwich in my opinion. Cheap lunch spot but there is always a long line between 11.30am - 1.30pm. Call in ahead or get there early", "pics": null}}, {"review": {"des": "Many options to choose from. I had the Cuban and it was delicious. The space is a little tight so I had to take it to go.", "pics": null}}, {"review": {"des": "The Cuban sandwiches are great but make sure to allow 10-15 minutes to wait because the line was super long", "pics": null}}, {"review": {"des": "My favorite lunch place ever. It's super cramped, busy, and not a large space, so I've never actually eaten within the restaurant itself, but the food is fantastic. They also offer some  interesting canned sodas that you can pick up. When I worked downtown and my husband and some time to get us lunch to go, this is the place I chose. They have a great selection of different sandwiches and salads.<br><br>The sandwiches have different kinds of flavors. My favorites are the Ropa Vieja, which is has sweet flavors because of the plaintains, and the Jerk, which is always spicier than I expect it to be -- it looks simple, but that habanero mayonnaise packs a kick! Service is usually pretty fast, and the food travels pretty well.<br><br>Ordering delivery is a little bit more difficult. I've never had their online form work for me, so I usually just call it in. It's loud and you have to focus hard on hearing the person on the other line, but their delivery is fast and efficient. Despite the difficulty placing the order, they've never gotten one wrong, and I've ordered from them for many a company lunch.<br><br>Like I said, it gets busy, so if you don't want to spend your lunch hour in line, try to go just before noon and definitely get there before one. The line moves fast, but this is a popular place and it gets CROWDED with all the hungry workers on their lunch break downtown. Also be aware that they do sell out of sandwiches. I have the hardest time getting a ropa vieja sometimes because it goes so quickly.<br><br>Definitely something to try out -- it's conveniently located (and they have other locations around the city) and the price is super reasonable for the amount and quality of the food you get. HIGHLY recommend.", "pics": null}}, {"review": {"des": "The prices are great!!! Shrimp ceviche is delicious. The black bean soup tastes like a warmed up black bean can. Their sandwiches doesn't have a lot of taste but worth the try! Great customer service! Their bathroom was located in a cool game room, very clean.", "pics": null}}, {"review": {"des": "I order from here at least once a month.  The Cubano is my favorite sandwich on the menu", "pics": null}}, {"review": {"des": "I had the Cubano Sandwich, and I can say I'm definitely a fan. I also had the Cafecito (espresso with sugar) which was above average. It is a smaller place, and definitely gets busy around lunchtime, but busy just means the food is great and worth a line. Their menu is surprisingly large for the smaller size of the place, and have heard nothing but good things from patrons. I would certainly recommend this place as a great lunch spot.", "pics": null}}, {"review": {"des": "My love for Cuban coffee brought me here. The coffee here is very authentic! I ordered a double shot cortadito and its amazing. Very smooth, has a distinctly pleasant smell, and it will wake you up. <br><br>The staff is super sweet and they are always playing nice Cuban music. Definitely stopping by here in the mornings.", "pics": null}}, {"review": {"des": "Food is 5 stars. The set up/line is terrible and deserves negative 2 stars.  But because it's more about the food for me, incredibly easy to place an order/fairly quick, and the fact that I will definitely return, I present Cafecito with five shiny stars.  <br><br>Tip #1: Don't eat yellow snow.<br>Tip #2: Call ahead to place an order to skip the line.  It'll save you so much time, I promise.  By the time I placed my order and got my stuff together and walked from my office to the shop, it was ready.  <br>Tip #3: When you do call ahead and place an order, go inside.  I know it might sound obvious, but the line literally blocks any incoming and outgoing traffic and there's absolutely no room inside making you second guess yourself.  But rub yourself down with oil and squeeze in and make your way to the register and wait for them to call your name and then get the hell out.<br>Tip #4: Unwrap your sandwich and enjoy the best (insert food item, in my case, the Cubano) and wish you ordered two.<br>Bonus Tip #5: Never make eye contact with someone while eating a banana.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fm8bJaYOKV3jo1U_QohE0A/348s.jpg", "caption": "Truly amazing cubano and black bean soup- 9 bucks"}]}}, {"review": {"des": "Soo..as anyone who has made it to this place during the rush lunch hour can attest to...it gets pretty packed...that's usually always a good sign....<br>Although the place is small..most of the orders are meant to be \"to go\" as there is very limited seating..don't be discouraged though..they do move pretty fast despite the massive orders they get....<br><br>My personal favorite has been the chipotle ckn....I'm also in love with their cafe con leche... (sometimes it can be slightly sweet but you can just ask to have it done with less sugar )..<br>I've never had a meal I didn't like and besides that..its affordable and filling!!<br> in comparison to some of the overpriced and <br>dismal sizes you get at other establishments... Cough (Pret a Manger and Hannahs Pretzel)Cough Cough..", "pics": null}}, {"review": {"des": "The Cubano is simply amazing! Everytime I am in Chicago I always make a visit to Cafecito. The prices are great for an establishment in downtown Chicago. Additionally, the Cuban coffee is another must order. <br><br>I have not ordered anything else on the menu, but friends have said they are great too, especially the pork belly. Which I may branch out and get next time I'm in town. <br><br>Just a warning, try to go a little before or after the lunch time rush. they get packed and there is a line forming to the outside. Also, the establishment is really small so waiting feels like being stuck on a NYC subway during rush hour.", "pics": null}}, {"review": {"des": "This place is literally a 2 minute walk from my work,<br>which is probably my job's best perk.<br>I'm a pescetarian so I always get the fish,<br>(side note how do you spell pesceterian Google seems conflicted)<br>which is really quite a delicious dish.<br>Because it's a small shop the place always seems packed,<br>but I promise you the line moves fast, that's a fact.<br>Prices are cheap, food is always fantastic,<br>check this place out, I'm not being bombastic.", "pics": null}}, {"review": {"des": "The food, I'm a fan of, however, the line...not so much. The staff had a good process of taking orders of people in line so the food doesn't too long when you get to the register. <br><br>Our office caters in the ropa vieja, lechon, rice/beans, plantains from here so I have been a fan for a while. I decided to go in and try a sandwich. I got the Jerk which had nice thick slices of grilled chicken breast...the bread was toasted just right. It was enjoyably chewy too :P. I also got the mango batido (milk shake). It was tad sweet for me but very yummy.", "pics": null}}, {"review": {"des": "There is a saying, \"Good things come in small packages\".  Godiva chocolate samplers, my wife and Cafecito live up to that saying.<br><br>Today on the recommendation of my son, we stopped in for a taste of some authentic Cuban food.  The place is unassuming and one of many food establishments running down Wells St., but how it differs.  Popularity in the food biz is judged by reputation, but more importantly the line running out the door at lunch and dinner of small restaurants.  We arrived at 11:15am, at 11:30 the line was 10 deep out the door.<br><br>I ordered the Ropa Viejo.  A tasty combination of skirt steak, sweet plantains, black beans and a tomato creole sauce, all on a nicely toasted Cuban roll.  OMG, this was good with the plantains adding that hint of sweetness to a tender and flavorful Cuban wonder.  My son had the Guava-Q.  He opted for the pork option, with caramelized onions and Guava barbecue sauce.  I thought the other sandwich was good . . . This one took it a notch higher in the amazing category.  A beautiful sweetness combined with a nice spicy flavor.<br><br>So, yes, this small packaged Cuban restaurant is not just good, but great.  When you have the time, stop by and sample some wonder Cuban fare.", "pics": null}}, {"review": {"des": "With its prices, portions, and delicious flavors, Cafecito does pretty well in living up to the hype; it's easily one of the best places I've stopped by for lunch in the Loop. The line gets a bit intimidating, especially during the lunch rush, but it goes relatively quickly. <br><br>The menu offered a large selection of sandwiches, and I ended up going with the jerk chicken sandwich. It did not disappoint--there was a good amount of heat in the sandwich, not to mention a generous serving of chicken, and the bread was slightly crunchy and toasted perfectly. <br><br>I'm not much of a sandwich person, but Cafecito is the exception. I've already picked out the next three sandwiches I want to try, so needless to say, I'll be back.", "pics": null}}, {"review": {"des": "Very clean very good food. Even doe the cashier had my order right the cook made it wrong. If I'm not mistaken the cashier name was Alexis very great girl with making sure my sandwich came out right. Now for the lady Andrea who handed me my sandwich had an attitude when I told her they made it wrong. That was a little upsetting due to the fact it was my first time. But over all my experience was pretty good thanks to the cashier the morning of 3/21.", "pics": null}}, {"review": {"des": "First time checking this place out and it was a GREAT choice!!! I absolutely loved it!!<br>I ordered the El Toro with a small side of beans and rice and got a mate chai latte along with it and every part of it was ABSOLUTELY DELICIOUS!! This will definitely be on my list of places to come back to.", "pics": null}}, {"review": {"des": "Some of the best sandwiches in The Loop can be found here. The Cubano, Chivito, Chimichurri, Guava-Q... It is so very hard to make a wrong decision for lunch at Cafecito. With the majority of pressed sandwich offerings below $7, it makes it easy to sample a large portion of the menu in a short time period. Excellent platter meals are available for those who are willing to resist post-lunch-nap-time induced by a case of happy-belly.<br><br>This tiny shop on Wells is a Downtown Chicago gem. So please do not be surprised when the line is out the door.  The staff members are friendly and efficient, keeping the lines moving quickly. The wait is worth it, but for those like me with very limited lunch time, call in the order for your dose of \"sammich heaven.\"", "pics": null}}, {"review": {"des": "I am so done with this place.  I hate it.  They always get my order wrong and don't give two sh\"ts about it.  The employees are extremely surly and act like they are doing you a favor.  Its always dirty as hell - not sure who they are paying off at the health department.  Life is too short to waste time at a dump like this.", "pics": null}}, {"review": {"des": "Looking for a decent lunch place and I found this awesome Cuban spot.<br><br>They offer primarily sandwiches.<br><br>I had the tilapia sandwich with pesto sauce and some veggies.  The sandwich tasted very flavorful and not fishy.  Price for most sandwiches is under $10, quite reasonable.<br><br>Customer sandwich was fantastic.  I got back to the office and found they gave me the wrong sandwich. When I went back, the lady remembered exactly what I ordered and immediately gave me the right one.  Be mindful that I don't order what is on the menu, usually it's this minus this and that because I'm a picky person.  The lady apologized too.  <br><br>Decent lunch spot and I would go back knowing they will make sure I am happy and get what I want.", "pics": null}}, {"review": {"des": "Ravenously stalked Cafecito's reviews and pictures while on the Purple Line to work, and was unabashedly glad it started to rain because that gave me an excuse to be late to work (and instead drop in Cafecito right next to the Washington/Wells stop I was supposed to get off of).<br><br>Made a beeline for the store and immediately placed my breakfast sandwich order of the \"Huevos Chimichurri\" which consisted mainly of egg, chimichurri and tomato. SOOOOOOOOOOOOOOOO good and worth the ~$4 I paid!! It was DEFINITELY made tons better by the habanero hot sauce recommended by another customer opposite me (Caribbean salsa picante de chile habanero - El Yucateco - to be extremely precise). <br><br>I'll be back here again and again and again.", "pics": null}}, {"review": {"des": "Delicious Cuban sandwiches!!! I only wish that they had better sides to go with sandwiches, perhaps french fries, chicken noodle soup, or Mexican rice if possible.", "pics": null}}, {"review": {"des": "If you've ever had real Cuban bread and come here expecting tostada-like bread, you will be disappointed.", "pics": null}}, {"review": {"des": "Love the Palomillo Sandwich along with their cafe con leche.  However, it's not a great place to sit and eat especially during the lunch rush period.  The last time I ordered, I placed my order online to avoid the wait in crowd.  However, when I got there (about 15 min after I placed my order) I had to ask for my order and was told that my order did not go through.  They had to place my order again and I ended up having to wait much longer.  :( Next time I will either call in my order or just order there.", "pics": null}}, {"review": {"des": "Cafecito is one of my fave sandwich places. You can taste the quality ingredients within their simple Cuban sandwiches. My favorites are the breakfast sandwiches, and the proveletta (I add chicken to it). They also have a shrimp and chicken salad that is bomb when you want less of a carb experience. Always a solid choice.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qTCMbASi6oHyp9xMzIGuLQ/348s.jpg", "caption": "Egg and cheese and egg and chimmichurri breakfast sandwiches"}]}}, {"review": {"des": "This is a low-key sandwich joint, that gets really busy during lunch time. There are a few vegetarian options for sandwichs and none for the platillos.<br><br>I ordered a Jardin sandwich. If you come in with a big appetite you'll have to order something else as well. The sandwich was served hot, and they did not skimp on the vegetables - which I really appreciated.", "pics": null}}, {"review": {"des": "So a week ago, it gets to be about lunch time, and we're pretty hungry. So we hop on yelp and find a highly rated Cuban place that'll deliver to our office. Place the order, paid for it, tipped, it comes about an hour later. Delivery girl states that we hadn't tipped online, oops, whatever, we both give her a ten.<br><br>WELL, turns out I had tipped online, and on top of that, I'd been charged 11 more times for those Cuban sandwiches. Wow, we could have flown to Miami, bought white suits, rented a Ferrari and speedboat, acted out Miami Vice, and come back for cheaper than that.<br><br>As for the food? It was definitely good. The Ropa Vieja with steak, black beans, plantains and tomato creole sauce. We got the steak Chimichurri, and 2 cubanos. This left 2 grown men feeling very full. The pork in the cubano was a littler flavorless, and I think it could have use a bit more mayo/mustard. The bread had a nice toasty crust to it.", "pics": null}}, {"review": {"des": "The cafe con leche is ridiculously good so is the chocolate, I highly recommend both of them. I have also has the chorizo con huevo sandwich which was really good, the egg was ok but the chorizo was on point so it balances out. At ~$3 for a large cafe con leche there is 0 reason to get your coffee anywhere else.", "pics": null}}, {"review": {"des": "I love coming downtown for an excuse to go to Cafecito. I have a weakness for Cuban food. The cubano with a cafe con leche is one of my happy places. The line is always long, but it moves fast. Prices are very reasonable. The cafecito and sweet plaintains are also amazing.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Iy5SKXKw1Ip-CN-12comhg/348s.jpg", "caption": "Cubano, café con leche, and plátanos maduros. My absolute favorite."}]}}, {"review": {"des": "There is nothing more that warms my little heart then having a delicious lechon meal. Cafecito blew me away with how juicy and full of flavor my meal was. Located right in the Loop area this place should not go untried if you are visiting Chicago like I was or even better work a few blocks away!<br><br>Cafecito is known for their incredible sandwiches (lechon, bistec, cubano, etc). Of course the Latina in me didn't want any of that pan and wanted arroz con frijoles!  We ordered the lechon with white rice and black beans and the ropa vieja with white rice and black beans. All orders come with platanos (sweet plantains). Upon ordering we were a bit indecisive on what to get but the gentlemen at the counter showed his confidence when telling us their lechon is the best in Chicago. I was sold at that statement. <br><br>Both meats had not one slither of fat in them and contained the perfect amount of rich flavor that only true Cubanos can imitate. The rice and beans came mixed together in perfect proportionate size in a to go cup which makes it easier to eat considering the usual separating of the two. <br><br>Please please do yourself a favor if you have not done so already and visit this place for a sandwich, meal, or just some rice and beans. You will not be disappointed.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KfJcIofZ_HS4zRrj3M0JSA/348s.jpg", "caption": "Mango batido"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kMmAY3CfM0l2r0TagghpYA/168s.jpg", "caption": "Ropa vieja"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/h6rYNWGkmOS0sqHvGQlgWg/168s.jpg", "caption": "Lechon asado con arroz blanco y frijoles negros"}]}}, {"review": {"des": "I was in the area with my husband and saw that this place had fabulous reviews and we wanted to try something different from our usual XOCO that we visit for lunch. I've never had a cubanito sandwich so I figured why not. My husband dropped me off and waited in the car as I quickly ran in to do a to go order. Luckily we came at a good time because seriously two minutes after I came in a whole lunch rush of people just comes in. I was so happy I came when I did because a serious line had formed. I ordered two cubanitos and for a large sized sandwich it's only $6. I decided I would give their plantain chips a try next time since I figured this would be enough calories for one lunch.<br><br>It took like 7 minutes for our cubanitos to be ready and they felt hot in my to go bad. We got in the car and went at it. We could have sat inside but this particular location is tiny and could get overly crowded quick so we decided against it. The cubanito sandwich itself was tasty not sure about everything that was in it but I know it had meat, cheese, pickles a mayo of some kind maybe. Overall it was tasty but I wouldn't say it was amazing and that I'm craving it. It's a great place if you work nearby to get a quick, cheap and filling lunch. Does it beat a Rick Bayless sandwich? No. But that's because his stuff has heat. The ladies working here are super nice though so overall I'm a fan if you're in the area I would definitely try it out at least once!", "pics": null}}, {"review": {"des": "The line can be out the door during lunch hours, so come early. Seating is very limited, so plan to take it to go in case you don't get lucky with seats. The Chivito sandwich is a must try. You can't go wrong with steak, bacon, ham, fried egg all in the same sandwich. It's an explosion of great  savory flavors.", "pics": null}}, {"review": {"des": "Small batch, high quality Cubanos made fresh to order.<br><br>Don't let take-out Cuban deter you from trying cafecito, because it's one of those lunches you'll be salivating over when you get back to your desk. I've tried a handful of sandwiches on the menu as it's often catered into my office, and everything is 100% certified fresh. <br><br>The line can be long sometimes but I've never had more than a 15 minute wait. They have great customer service and the care and craft they put into the food shows.", "pics": null}}, {"review": {"des": "I discovered this hidden gem while up in the area for a class.  I ate here every day vs the free boxed lunches they had.  Everything I tried was fresh and tasty.", "pics": null}}, {"review": {"des": "If you're by the area be sure to stop by and get a Cuban sandwich, you honestly can't go wrong with any selection they have. Also, the cafe here is good and strong. Nice atmosphere, great music. Only downfall is that it can get packed at times so there's no seating which goes to tell you how good the food is here ( line out the door )", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zpLJKwqVsHhqsO6yBw9NcQ/348s.jpg", "caption": "Rip eggs with chimichurri"}]}}, {"review": {"des": "4.5 to 5 stars.  And this isn't even for the Cubano, which they are famous for, but the Elvees, which was maduro with peanut butter and guava jam.  The ingredients themselves don't seem all that inspiring, but the combination of the crisp warm bread that melts the gooey peanut butter so that it combines with the sweet maduro just so...perfection in my mouth.  In addition, I had the Cortadito was very reminiscent of Vietnamese coffee.  You can have this instead of dessert, b/c it was that sweet.  I really enjoyed it.  I also got a cup of the bean soup which included more bread, but (I think) buttered.  The soup was quite good, but the star was by far the sandwich.  I don't even know if when I return I'll be trying the Cubano, b/c I like the Elvees that much!  <br><br>The only issue I can see was that the space was quite small and crowded at lunch time.  I would suggest taking your food to go.", "pics": null}}, {"review": {"des": "Picked up the chicken chummichurri <br>Well made! The coffee is good too. <br>Tip: get there early to not get the line", "pics": null}}, {"review": {"des": "Great service.  Excellent cafe con leche. Extremely reasonable prices. Recommend the Cubano.", "pics": null}}]}