{"name": "cafe-selmarie-chicago", "reviews": [{"review": {"des": "I absolutely love this place for lunch, dinner, and DESSERT! Their staff is always so nice and friendly and I've had great service from the host, to the wait staff, to the people behind all of the baked goods. <br><br>Most recently my husband and I were craving pie and didn't know where we could get some. The usual pie shops close early so we felt defeated until I randomly thought, \"Selmarie has a huge dessert case!\" Lo and behold, they had pie and lots of it. It was the beginning of fall so they had some fun fall options and I had a cherry pie that was to die for. I also had a cherry Italian soda to accompany it and we got to sit outside. My husband had a chocolate cake that he loved as well.<br><br>If calories didn't make you fat, I'd go to Selmarie for a dessert every single day. So many options that I don't think I'd ever get bored.", "pics": null}}, {"review": {"des": "YES.<br>First, they have great staff... Good work on hiring people who either happy or keep happy. The personality of the staff fits the place.<br><br>Can't speak for the food (yet) but I am a regular when it comes to the cake. Possibly best I ever had. Really good regardless of what cake I get, never disappointed. Frosting is the best part (unlike cheap cake at other stores) .... Bonus point to the face the cake still taste pretty good to the next day.<br><br>On the pricy side but I think you get what you pay for. Their cake will be the highlight of any occasion you serve it at.", "pics": null}}, {"review": {"des": "Delicious food that reminds me of a well done home cooked meal! The chicken pot pie here is delicious- creamy, with a hearty amount of chicken and veggies. The desserts here are amazing- the tres leches cake is my favorite.<br><br>I would definitely recommend checking this place out if you're in the Lincoln Square neighborhood. In the summer, they have a nice outdoor space in the center of the square with a view of the fountain.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qrJS6a5EWUN1ZEd3Js8K4Q/348s.jpg", "caption": "Chicken pot pie"}]}}, {"review": {"des": "The place: It's easy to get distracted by the scrumptious looking pastries in the front of the restaurant, but beyond that, there's ample seating, it's usually bustling, and if you can get a spot outdoors - well that's just a win (both because it's probably a beautiful Chicago day, and the people watching in the nearby square). Service is friendly, on point with refills, helpful with menu questions and accommodations. <br><br>The taste: Been here several times and while nothing stands out as oh-my-gosh-when-can-i-have-this-again amazing, everything I've had is pretty hearty, delicious, beautifully plated - at least for brunch, which I think is prime time to go. On the most recent visit, I got the avocado toast with a perfectly poached egg on top. I inhaled it in approximately 4 minutes.<br><br>My face: A sleepy smile as the food coma started to set in. Picked up the tab for brunch for 2 of us, with coffee (intelligentsia) - was about $30", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MI5731hS4quxLPCstaFY8g/348s.jpg", "caption": "Delectable avocado toast with poached egg"}]}}, {"review": {"des": "Since moving back to the city, things have been quite a whirlwind! However, I've been making up for a decade of lost time with trying all of the local restaurants and bars. I was out in Lincoln Square on a Saturday morning and stopped by this very busy cafe. I had some time left on the meter, so I decided to grab breakfast. <br><br>I figured with how busy it was, I wouldn't be able to snag any patio seat. Even though I was just a party of one, I was right. I decided to skip the 20 minute wait for outdoor seating and grab a table inside. Despite it being quite crowded, I was able to sit down pretty much right away. <br><br>I ordered the sparkling bourbon lemonade and the Selmarie Benedict. The cocktail was very refreshing and tasty. I loved how there were quite a few different options for drinks on the cocktail menu and not just mimosas. The benedict was also prepared nicely, but I would have preferred a bit more sauce on the muffin itself, since the crispy bacon makes it a bit drier. The potatoes on the side were wonderful, though! <br><br>My server was pretty attentive in the beginning, but she did pretty much disappear for the entirety of my meal until it was time for the check. I didn't mind because it was a simple breakfast and I didn't need anything, but it probably would have been a bit difficult to track someone down if I did need something. <br><br>I would definitely stop in again if I was walking around the square. Next time I would love to sit on the patio.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bL_fYRn8okC2UFd2KLAxRw/168s.jpg", "caption": "Selmarie Benedict"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DzFeED2o5P7-s_ChlYV2Fg/168s.jpg", "caption": "Bourbon Lemonade"}]}}, {"review": {"des": "Their breakfast was delicious, but I especially loved the charming atmosphere and the bakery case of divine looking baked goods!! I wish I didn't live so far from here...", "pics": null}}, {"review": {"des": "We went for their anniversary pre fix $35. Seared tuna, half a lobster and flourless chocolate cake. 8 expected small portions but this was delicious and filling. Service was great. Very accommodating and sweet to my daughter (3 1/2). First time here and will definitely be back !!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OK0LGsI4L0ds200bK8EKqQ/348s.jpg", "caption": "Anniversary pre fix!! $35 for all three Dessert - Flourless Chocolate cake with brûlée bananas"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Cf8w_0YcPVCrG9CVOdDavw/168s.jpg", "caption": "Anniversary pre fix!! $35 for all three Dinner - half a lobster"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HWM5kMSOTVx2EaSYNQYGFg/168s.jpg", "caption": "Anniversary pre fix!! $35 for all three App-  Seared Tuna"}]}}, {"review": {"des": "I loved this cafe in the heart of Lincoln Square. The service was excellent! I asked if any of the sweets had alcohol, and the staff was great at answering my questions. I loved the strawberry roulade! Highly recommended! I almost forgot my gloves and cap here on the day before a big snowstorm. The kind gentleman working there made sure I took them with me. Very nice!", "pics": null}}, {"review": {"des": "You know those places that just always make you feel happy? That's Selmarie for me. When we lived closer, I would go here for a meal at least once every other week. Brunch, lunch, dinner. All is great! Even if not staying for a meal, you will definitely want to pick up a dessert to go. My favorite: raspberry marzipan torte. OMG that cake is delicious!", "pics": null}}, {"review": {"des": "Yum. I meet friends and Mom often.<br>The entire staff is friendly, busy and very patient.  The food??<br>Omg... Always delish. Always. <br>Lunch often, dinner occasionally. <br>Intelligentsia coffee ..  delicious.", "pics": null}}, {"review": {"des": "Had been dying to go here for brunch, since their patio looks like a gorgeous spot for a summer day! Definitely a popular little area. We waited about 20 minutes for a table of 3 around 12pm on a Saturday. Their food was very fresh. I had the benedict and the table shared the cinnamon roll pancakes. DEFINITELY get the cinnamon roll pancakes. Drool!! I'd go back just for those :). This place is great for a date, or a large group!", "pics": null}}, {"review": {"des": "As a resident of Lakeview, I always look for a reason to go to another neighborhood to check out new places.  My friend suggested Cafe Selmarie in Lincoln Square.  I had hopped onto the Brown Line to the Western stop.  From the stop, just walk to the \"Square\".    The restaurant was very easy to find.  <br><br>The front of the restaurant is the bakery / coffee area.  There were plenty of various baked goods which looked really good.  The seating is more limited so you may stand for a bit.  I had decided to skip the bakery for this time.<br><br>I had checked with the hostess and she stated about a 15 minute wait.  No big deal since I was waiting for my friend.   The day we dined here was on a rainy Sunday afternoon around 1pm.   Shortly, after my friend had arrived, we were texted.  Then led to the dining area.  Stephanie, server, had greeted us then went over the menu.  While Stephanie proceeded to obtain our beverage orders, we started talking and forgot to review the menu.  Stephanie was great to let us to continue our conversation.  About 15 minutes later, she stopped by inquired about ordering.  We had quickly decided to order the Blueberry Griddlecakes and I had ordered the Omelet which came with breakfast potatoes and a small salad.  <br><br>The entrees really didn't take that long.  We had decided to split everything  - great way to try more items.  The food runner was nice enough to bring an extra plate.  First, the griddlecakes were full of blueberries and needed  very little syrup.  The omelet was the right size (not overly large or small).  The salad was a great touch with a lite dressing.  Throughout the meal, Stephanie would check in with us.  For a great brunch restaurant, the prices were very reasonable.  <br><br>I would recommend this great dining/bakery spot in the Lincoln Square area and I would return.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rKIJEQ97djHRrEoQeszmAA/348s.jpg", "caption": "Looks so good"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/J7cGcH-LBlnjq-TcfUOT-w/168s.jpg", "caption": "Great advertisements"}]}}, {"review": {"des": "Ahhh the larger salad is back and better than ever! Can't resist the cookies and great coffee on my way out.", "pics": null}}, {"review": {"des": "Ok brunch, ok service nothing more. Had the quiche and a bottle of beer.  The quiche had little to no flavor. Not much ambiance to speak of. Took an eternity to get the check. Great location in Lincoln Square.", "pics": null}}, {"review": {"des": "I have been here numerous times for lunch, brunch, coffee and desserts!  All top notch, awesome, tasty and the service is outstanding.  I even love the decor and paintings in the wall!  I also love sitting on the patio and people watching by the fountain.  What an fun experience.  Last time I was there I got the chopped salad.  I actually crave it.  How can they perfectly cook chicken to the point of craving with a beautiful bit of char!!???  I am going to come here next for the prie fix!", "pics": null}}, {"review": {"des": "Very cute spot in Lincoln Square.  Definitely worth checking out.  Apparently Mayor Rahm Emanuel frequents this place.<br><br>When you walk in there is a counter with pastries, cookies, etc.  All looked so good.  I only got 1 pastry and it was good.<br><br>They can make coffee and specialty coffees for you at the same counter.  There is a small restaurant or seating in the back if you want to sit down and eat....but I'm not sure if there is a larger menu for that area.", "pics": null}}, {"review": {"des": "Went here for brunch and got seated right away. You can tell immediately that it's a very charming place. If you like eating outdoors, they have a super cute patio! They have a wide breakfast and brunch selection to choose from! You won't be disappointed with all the choices they have to offer. They even have a small bakery towards the entrance if you want to take some fresh pastries home! <br><br>If I had to recommend one thing, I would highly recommend something that always has me coming back for more, which is the iced chai lattes! Super refreshing, not your regular chai latte.", "pics": null}}, {"review": {"des": "Cafe Selmarie is delicious and thoughtful food. <br>I have only been for lunch and picking up pastries but everything was too notch! <br>The location is fun and entertaining! As you enjoy your tea or coffee you can watch the kids playing in the square. <br>This cafe is a staple of the square and must not be passed up!", "pics": null}}, {"review": {"des": "I'm surprised I have not yet reviewed this place! It's been almost 5 years since the first time I came! But really, how can you not like Cafe Selmarie. Especially in the summer when you can enjoy the beauty that is Lincoln Square.<br><br>This review will be for my latest visit for lunch. I came with my mom and son on a Friday. We did have to wait to be seated but that's to be expected. Definitely cannot miss the wonderful array of baked goods as soon as you walk in. Just a little pricey for my taste and what you get. But the coffee is strong and delicious and they have other tasty beverage options up front as well. <br><br>Towards the back is where the hostess stand is and the restaurant. To eat, my son got the kids macaroni and cheese which he ate almost all of! I got the avocado toast and it was so delicious! Not at all what I expected but was impressed. My mom got the chicken pot pie which I did not try but she said it was super yummy!<br><br>I love the atmosphere and the service is great. A definite place for a casual lunch or dinner OR you can impress the in-laws at brunch :)", "pics": null}}, {"review": {"des": "Cute corner spot and we would have never know they also do dining for dinner! It was a cold day so we grabbed an espresso and cappuccino and split a soft croissant. Yum", "pics": null}}, {"review": {"des": "The food is amazing and portions are huge! <br>They have a lovely patio and you can sit almost in the park.<br>On the negative side - they are absolutely NOT pet friendly. They did not allow dog to be even on a patio! So we had to lock our dog behind the fence and it would take a 3 min walk thru the whole cafe to get to the dog.<br>The other negative thing is people there - highly prejudiced mommies screaming about their kids when they see a peacefully sleeping dog on the other corner of the cafe. Nobody complains on their screaming kids, so why scream about my dog? Ufff‍ Spoilt all the vibe, won't come again.", "pics": null}}, {"review": {"des": "Brunch was good, but I have had better. For the pricing though, it is really filling. I tried the Mushroom Burger and also got a side of the chicken sausage. Everything was good, not exceptional. Not that interested to come back for brunch, but the bakery is really good. <br><br>Best thing was the boozy hot chocolate. That I can come back for. It's such a large mug, well made, and just perfect for brunch on a cold morning.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WyP4BIqONc20g_FFtcSqfg/168s.jpg", "caption": "Mushroom Burger and side chicken sausage. Very filling"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QpI8r-tPVrPSSbceKu9IVw/168s.jpg", "caption": "Hot chocolate with kahlua and hot chocolate with irish cream. Boozy brunch"}]}}, {"review": {"des": "A lovely cafe for pastries, coffee, brunch or lunch...even blunch! I really enjoy their pastry selection. It's the perfect afternoon treat.", "pics": null}}, {"review": {"des": "This used to be one of my favorite places for brunch a little while ago.  I've been here with 2 of my friends for their French food a la carte menu and we all ended up a little disappointed.  I had the Croque madame that was very dry ,  olive tart that was surprisingly very good(I didn't know what to expect ) and my dessert raspberry vacherin was average.  I will be back for brunch soon and hopefully their regular menu is better .", "pics": null}}, {"review": {"des": "To start, the front of the house here wreaks of incompetence! I've seen my fair share of poor management but this goes to another level! <br>Food<br>Fantastic, healthy fresh options executed very well! <br>Service<br>Polite attentive and efficient. <br>Ambiance, the patio is placed right next to a lovely fountain where one can hear live music and people walking around the square. However, we learnt the hard way that cafe selmarie is mislabelled as \"dog friendly\" as dogs are not allowed on the patio but are allowed to sit outside the fence (as if the restaurant has any control on what happens outside the fence.)", "pics": null}}, {"review": {"des": "So many choices of European style cakes, including Black Forest, Sachertorte, and Macarons and the price was acceptable. The whipped cream was house-made. The good thing was what we had, Sachertorte, Turtle Cheesecake, and some cookies were not overly sweet. The staff was helpful, I would say. It was irresistible to come here on a beautiful Saturday morning, sit at their stylish patio, and relax while having a butter croissant and a cup of coffee, just like any Frenchman does.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JDIjJPrU-jZhw1gqzQquCQ/168s.jpg", "caption": "Sachertorte"}]}}, {"review": {"des": "This is by far the absolute best bakery in the city. I've never had a bad experience. Birgit and Jeannie did a great here and it truly shows.", "pics": null}}, {"review": {"des": "This is a cute cafe in Lincoln Square. They have a counter with pastries, cakes, cookies, coffees, etc. And they also have a restaurant area. Pro tip: When it's nice, definitely opt to sit outside.<br><br>The service is friendly and attentive. The menu is plentiful. They numerous regular offerings, as well as a selection of daily specials. The daily specials include drink specials.<br><br>It's cafe-type food. Think sandwiches, salads, omelettes, etc. I couldn't decide what I wanted, so I opted for several of their sides. I had a side salad, side mac 'n' cheese, and side potato salad. Fair warning: Their sides are pretty big!<br><br>The potato salad was the smallest of the sides and was absolutely amazing! Very tasty. The side salad (which also comes with most sandwiches, etc.) was quite tasty. Fresh and the honey champagne vinegarette it comes with is outstanding. The mac 'n' cheese was sizeable enough to be its own meal. It was tasty, but a little bit lacking. It could've been kicked up a notch with different cheeses or add-ins or something. George C. ordered the salmon sandwich (kinda like a BLT with salmon) and devoured it.<br><br>Try to leave room for dessert. Their offerings, which are primarily German, are quite fab.<br><br>All in all, it's a great price for what you get and a cute patio brunch / lunch spot. We'll for sure be back.", "pics": null}}, {"review": {"des": "I always pass this cafe when I'm in Lincoln Square and I finally decided to try it today. The pastry windows when you first walk in are filled with amazing looking desserts - cookies, cakes, cheesecake. The cafe area was packed but I was seated right away. Each wall has multiple paintings/drawings that are all in red. I actually spent a lot of time looking at all of them. Service was efficient and friendly. I ordered an iced caramel latte and it was delicious, really recommend it. I ordered the chorizo omelet off the lunch menu. It came with a salad and potatoes. The salad was light and refreshing, the potatoes and eggs were perfectly cooked. I didn't like the chorizo as much as other kinds of chorizo I've tried but overall my food was good. My friend ordered the turkey and Brie sandwich which she really enjoyed. I tried the potato salad that came with it, so yummy! Last, but definitely not least, we ordered the Tiramisu which is my all time favorite dessert. It was a pretty generous slice and quite tasty. It had less of a coffee flavor/moist texture to it compared to other ones I've had but still great. Sweet place, very cute atmosphere and friendly staff. I'll definitely be back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YvH80ucBlRDBJ6bue4uuEQ/348s.jpg", "caption": "Turkey and Brie sandwich, chorizo omelet, iced caramel latte"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AcwYRQkzvIrKfy9PvayIWw/168s.jpg", "caption": "Pastry window when your first walk in"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LBA2JGQ4T3LXXzjqBwq4rQ/168s.jpg", "caption": "Tiramisu"}]}}, {"review": {"des": "I have eaten dinner here once, breakfast twice and dessert once.  It is a great place. It was consistently 5 Star.  When I want to impress a woman, but don't want to go downtown, i will bring her here.  Good as  HE double HOCKEYSTICKS.", "pics": null}}, {"review": {"des": "Thus far, I've only tried their raspberry cheesecake. Thoughts? Exceptional. Based on that merit alone, this cafe deserves five stars.", "pics": null}}, {"review": {"des": "Walked in to the cafe to have the delicious pancakes as pictured on Yelp. Complete fail as I was told at 11:12am that they stopped serving breakfast for the day? Really? That's not what your menu days. Should update. <br><br>On plus side, tomato bisque was delicious. Couldn't be seated and not order anything.  :(", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/H5doW4KhmaelK4awMTeMzQ/348s.jpg", "caption": "Tomato bisque cup."}]}}, {"review": {"des": "I would rate the location  and atmosphere 5 stars. The service was fine until they started cleaning  and stacking up chairs  around us before we were finished eating.  The food was pretty mediocre. I had higher expectations.", "pics": null}}, {"review": {"des": "Love the food, pastries & service! Always welcoming and accommodating! Love this gem!", "pics": null}}, {"review": {"des": "afther le cafe closed we look for a breakfast<br>place so we fined <br>cafe selmarie<br>pretty good we order french toas and pesto eggs whit capuccino & chai latte<br>porcions are huge<br>prices good too<br>see you next time for dinner", "pics": null}}, {"review": {"des": "Food was really good. The 2-star knock was on a wait staff and hostess that really didn't seem to know what they were doing. And then there was the bloody mary - a travesty to all bloodies I've ever had. It was terrible. If they make their own mix, we got a bad batch. If they bought it, they need to switch. Everyone at our table agreed at how bad it was. Again, food was outstanding. Stay clear from the bloody and accept that the wait staff might forget to take your order.", "pics": null}}, {"review": {"des": "I came here with my Grandpa for breakfast and thoroughly enjoyed the meal. We both got the mushroom breakfast sandwich. <br><br>The side salad (mixed greens, cucumber, tomatoes, light dressing) was fresh and delicious. The potatoes were mediocre. I would have like a bit more crunch, almost tasted like they had been sitting out for a while. <br><br>The sandwich itself was fabulous and even though I was stuffed, I ate the entire thing. There was a hearty amount of egg, mushrooms, some kale, and a spicy(?) mayo on a nice, soft bun. I don't like kale so I was happy that I couldn't really taste it, yet, I was still getting a portion of veggies in my meal. The flavor of the mayo was definitely the strongest taste of the sandwich but I loved it so I didn't mind. I will say though, it was a bit of a bummer not to taste much mushroom flavor considering it was a mushroom breakfast sandwich. <br><br>The meal came with a side of some type of sauce or dressing (it was vinegary with lots of spices) which honestly confused the both of us since the sandwich had a sauce and the salad was pre-dressed so we both left it on our plates unsure what it was supposed to be used for. <br><br>The reason I give this place a 4/5 is because although I loved my meal, the wait staff wasn't very attentive. There was no one around to seat us when we first arrived, although it said \"please wait to be seated\" on the door. During our dining experience they only refilled our coffee once (and only when my Grandpa asked), and they never asked how our meal was or if we needed anything. My water cup sat empty (and I sat thirsty waiting for it to be filled) for quite some time... and when we asked for a refill it took a few more minutes for the guy to come back (without my water) so we had to ask a second wait staff. Regardless, no one was rude to us in any way.<br><br>Overall, yummy food. Okay wait staff. I hope to come back and try a pastry because they looked delicious.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tqUbKgLquKb3G4gdmJpwJA/348s.jpg", "caption": "Mushroom breakfast sandwich"}]}}, {"review": {"des": "One of the most mediocre brunch I've had in a long time only made worse by the benedict which was swimming in so much sauce it was a veritable soup.", "pics": null}}, {"review": {"des": "Well, I would say in 2014 we ate here for dinner, unsure of what we ate. But I had a great time. I do try and stop by when getting a coffee to go or buying their pastries. Did you know that Intelligentsia coffee has made a type of blend just for them?", "pics": null}}, {"review": {"des": "Love this spot in Lincoln Square! Great for brunch/lunch, and will venture here soon for dinner! The menu changes daily it seems, and the options are always fresh and delicious. You really can't go wrong with what you order. <br><br>My only annoyance is they are soooo weird about your party being there in order to be sat. My husband checked in this last Saturday with the hostess to see if there was a wait. I had a stroller so I waited outside since the space is tight. She questioned him twice about where the rest of his party was when he specifically told her I was waiting outside. I get that you don't want people taking up tables for extended periods of time waiting on the rest of the party to get there, but when there is no wait - ease up on it. Other than that, the service is great, food options are delicious and they have an awesome dessert case. Be sure to order a cinnamon roll!", "pics": null}}, {"review": {"des": "The girls and I had a very nice brunch here. Angela P got bourbon-cherry french toast, Aimee got the smoked salmon club and I got the spicy brisket melt and a Cinnamon roll. <br><br>The coffee was hot and my favorite part was the cinnamon roll. I would not get the spicy brisket melt again. <br><br>If I were to stop by again, it would be for the atmosphere. We were right in the middle of the square and one thing I love is people watching. Add a cup of coffee and a nice warm cinnamon roll...I'm sold. <br><br>The waitress was very nice. I would like to go back and try other items on their menu.", "pics": null}}, {"review": {"des": "Awesome restaurant in an awesome location. It's set right in the middle of the square in Lincoln Square. They have a cute restaurant in the back and a bakery/coffee shop up front. Their desserts are delish and the coffee is high powered!!!! <br><br>We ate in the restaurant this week and the food was great quality and tasted fresh. They have a great brunch selection on the weekends. They also have outdoor seating in the summer and dog friendly tables with water dishes. <br><br>Great location and cozy restaurant in the middle of the square, highly recommended for a good ol time", "pics": null}}, {"review": {"des": "We had very unpleased experience there... don't feel welcomed, low customer service and 0 flexibility.", "pics": null}}, {"review": {"des": "Such a nice cafe. I have only been here a few times but I am always satisfied with what I order. I like the chicken pot pie and the desserts. The pink eggs were weird on my avocado toast but that is because I think it was mixed with beets... anyways I love this place !", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/awIbJhQZTUxgNdbyqh9pVQ/348s.jpg", "caption": "Flourless chocolate cake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MqMYtDV-NRND5WHGYmtFhQ/168s.jpg", "caption": "Avocado toast"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qPeRENmG5chFSIVMSNT-hA/168s.jpg", "caption": "(: mocha with whipped cream"}]}}, {"review": {"des": "Never fails to be a delicious standard for brunch/breakfast. The best chilaquiles I've had in town, and my other go-to is the Turkey & Brie sandwich. Their fresh bakery is also fantastic for a sweet to top off your meal, especially the Tres Leches cake.", "pics": null}}, {"review": {"des": "This has got to be one of my favorite little brunch spots in Chicago, definitely the best in Lincoln Square.  The desserts are delicious and the servers are always smiling.  My favorite dish on the brunch menu is the Wild Mushroom Sandwich which includes a sautéed mushrooms and eggs on a fresh croissant.  Yum!", "pics": null}}, {"review": {"des": "Very good coffee, pastries, and brunch! Avoid on Sundays though--They change the menu and drop most of their best items. Also no vegetarian friendly Sunday brunch items.", "pics": null}}, {"review": {"des": "$18 for a freaking teeny-tiny salad with a strip of salmon?  This place is a total ripoff!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xGmCH6o4Mv5XKTrlQXyhrQ/348s.jpg", "caption": "This salad cost $17.50 + tax.  What a rip off!"}]}}, {"review": {"des": "Great for families, and food is good. We were able to get a table and high chair quickly, and enjoyed the lox plate and corned beef plate. Next time we will be trying the baked goods, especially the cinnamon rolls.", "pics": null}}, {"review": {"des": "Small, busy cafe with an outdoor patio. Had to wait on a weekday afternoon, but only about 10 min. We both had the chopped salad which we both said was one of the best salads we've ever had. The greens and avocado were amazingly fresh and the protein (chicken, blue cheese, bacon, eggs) was all perfect. The sherry vinaigrette was delicious, too. Service was friendly and attentive.", "pics": null}}, {"review": {"des": "My fiancé and I had spotted this cute cafe on our way to The Bad Apple while on our date night in Lincoln Square so after filling up on our burgers we figured there was still plenty of room for dessert...after all - despite was anatomy and biology has evidenced I'm convinced there's a separate stomach for dessert.  The dessert stomach - it's a real thing!  <br><br>If I lived in Lincoln Square having this cafe within walking distance would be a real disaster because I'd find an excuse to go there for dessert all of the time.  As it is I don't live there so I had to choose that which looked the best.  Even that was difficult because all of their cakes, chocolates and other desserts looked amazing.  Ultimately I chose this apple cinnamon bread pudding thingy (I don't remember exactly what it was called) and it was quite scrumptious.  It was little pricy for this dessert, but this isn't an every day commodity unless of course you have the money and calories to spare.  <br><br>This place is quite cute because in the storefront they have the café items and a bar along the wall so you can sit and enjoy your well-deserved dessert while people watching.  They also have a back part where you can sit and enjoy the food as if it's a sit down restaurant.  I'd be interested to go back and sit there while also enjoying some of the other food items that they have, which are not all dessert.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ODfxc0n8YkCMrJP3mR1k5A/348s.jpg", "caption": "Apple bread pudding cake"}]}}, {"review": {"des": "Love coming here for baked goods and coffee but the kitchen has made big changes to the menu. I to used come here for their chicken pot pie but now it's a soup with puffed pastry triangles on the side. The pot pie was to die for, now I would rather not order it. There are a few items that also changed on this menu but honestly, they were forgettable. Don't fix what ain't broken. @wethefoods", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/B0kusnfl-gIXMLYvaV47Iw/348s.jpg", "caption": "Come for baked goods and pastries."}]}}, {"review": {"des": "Last week my family and I decided to go to one of the local restaurants in our neighborhood. We took our family of 7 most being children. I would not advise going here if you have a big party because the wait time was very long, and not a very kid friendly place but overall I think the food was fantastic I would recommend the eggs and sausage,the salads but my overall favorite was the cinnamon bun with its juicy hot frosting.", "pics": null}}, {"review": {"des": "Went here for brunch on a Saturday with a friend. There was a little wait if we wanted to sit in the patio but we decided to sit inside instead and got seated right away. The staff are always nice whether I come in for brunch/lunch or just to get their pastries or cakes. I have been coming back here since and will probably always get the same dish which is their corned beef hash with poached eggs on top and an additional .50 for the sourdough toast. The service was quick and even though it was packed, our waiter didn't hurry us up. I recommend this place and will most likely be coming back again.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Qw51gT50rYI2RRdZM3HBag/348s.jpg", "caption": "Corned beef hash with poached eggs! So good!"}]}}, {"review": {"des": "I like this place a lot and come here very often for brunch and breakfast. Staff is usually pleasant, food is tasty and good quality, there are plenty of delicious sweet options, a bakery attached, and prices are pretty good. Only criticism is they need a better waiting system, currently you have to literally go inside to put your name in (there is often a wait on certain days) and then just wait around. There are other services they can use that are more convenient.", "pics": null}}, {"review": {"des": "Been going to Selmarie for thirty years.  Their Morning Buns were the best!  Then they took them off the menu.  Why?<br>The macaroni and cheese was a delicious treat.<br>Then they changed the recipe, I learned by ordering it today and was so disappointed.  Why did they change something that was so good?<br>I had to send back an iced tea because it's taste was so off.  Ordered a coffee but it too was not like before, now flat and weak.<br>The wait staff was always very good.  Today our server had a real chip on her shoulder.  She should not have been on the floor until she had an attitude adjustment.  <br>Not sure if I'll ever go back.", "pics": null}}, {"review": {"des": "I was feeling a bit under the weather this morning, and what would be a remedy?  A place that serves vegetarian-friendly brunch to boost up my blood-sugar level so that I could make it to work this afternoon.  <br><br>Daddy J., Mama J., and Rosa J. participated in the brunch date at Cafe Selmarie, \"inside\" of the commercial strip on the Lincoln Ave.  A portion of the Cafe Selmarie resembled a regular, express-version of coffee shop.  However, a server would take you to your seat if choosing to dine in.  <br><br>I personally went with something that would be comforting: vegetarian chili.  Initially, I was slightly intimidated by the heavy layer of cheddar cheese.  After I had a few bites, I realized that veggie chili was quite light.  The bread that came with was also hearty and delicious.  My energy-level was immediately restored upon finishing my vegetarian chili.  <br><br>Daddy's turkey & cheddar sandwich and mama's berry cheesecake were seemingly well-crafted.  They were satisfied with the qualities of the food, yet they expressed a minor compliant on the speed of service.  Unfortunately, I was under the time crunch since I had to make it to work by a certain time.  I'm normally an individual who dislikes \"schedules\" when it comes to munching.  <br><br>Overall, Cafe Selmarie has met the expactation of being a healthy, relaxing, and family-friendly breakfast/brunch/dinner place.  The prices were fair in comparison to similar competitors around town ($20.48 for a party of 3).  I will definitely tell my vegetarian husband about this lovely joint.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/F7MbIjZbXms2gZY4Xv3gng/348s.jpg", "caption": "Vegetarian chili"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/56Weda0ZKymDKMaaNp6T7A/168s.jpg", "caption": "Turkey & cheddar"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GK0ihTpei7DdfK7jFJRffw/168s.jpg", "caption": "Cheesecake"}]}}, {"review": {"des": "The raspberry marzipan torte was our wedding cake 28 years ago. We have make our way to Cafe Selmarie each year, to savor the memories of our union. I am happy to report that special cake is still the wonderfully moist, creamy and delectable slice we both remember so long ago. Thank you for the being part of our romance.", "pics": null}}, {"review": {"des": "I wish there was an option for ZERO stars...I dont even know where to start. It started with the hostess who didnt bother to check if there were available tables outside and she just took down our phone number and put us on a 15min waiting list. We ended up checking ourselves just to make sure, and it turns out that there were two available tables outside. Then we sat down...<br><br>We ordered one beer radler and one wine. For food we ordered two kale caesar salads with salmon (see photo). After the 15 min wait the sorry ass salads came out but the drinks did not. The waitress finally brought out the drinks there were two wines instead of the beer and the wine. When we mentioned her mistake she only said \"OK\" and left. She didnt even come back with the beer.<br><br>The salmon on the salad were burnt and we pointed out how badly burnt it is she said thats how its supposed to be cooked (and by the way we did not ask for blackened salmon). Also the salads were the smallest portions I've ever seen in my life and they weren't cheap either.<br><br>When we expressed our dissapointment about the customer service and the food she still did not apologize and only offered the option of seeing the menu to order something else. <br><br>After not eating or drinking anything we decided to just leave , we couldn't stand being there for another minute. Never EVER going back there and no one else should either!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_vvJwm0IouJ8JvdhLWo6Rg/348s.jpg", "caption": "Small salad portions, burnt salmon (not blackened) didn't even try it! Overpriced"}]}}, {"review": {"des": "I've stopped into their bakery part more often than I can remember, whether it was because I desperately needed coffee (their iced coffee will wake you right up) or because they have a great selection of delicious deserts. I recommend the iced coffee for wake up purposes but I truly don't have a recommendation for the sweets, everything I've had from this place was delicious, so just go with what you're in the mood for once you get inside (this strategy doesn't fail at selmaries). <br>I remember having lunch there once, but it was a while back and I can't say that it was a memorable one. However, I just glanced at their brunch menu and it looks amazing. I'll definitely have to stop by there for brunch in the near future.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wh_Z8x52lZWbinyvDQb3jw/168s.jpg", "caption": "White Russian coffee"}]}}, {"review": {"des": "Cafe Selmarie is an interesting amalgam of pastry shop, coffee shop, and restaurant.<br><br>When you enter it looks like it's just a pastry shop with a few small tables for enjoying your purchase or sipping a cup of coffee. But proceed to the rear, and there is a fair-sized restaurant.<br><br>The menu offers American, French, Italian, and (at least the night we visited) German food, plus other eclectic international cuisines. <br><br>We shared the Brussels sprout salad, which was good, a special leek and bacon flatbread that was phenomenal (gooey topping, crisp crust), and a special German sausage plate that was also tasty. <br><br>For dessert we selected a couple of pastries from the case out front. There's a small wine list with many selections available by the glass.<br><br>Service was friendly and professional.<br><br>The place is kid friendly, and there were quite a few families dining the Friday night we went. An adjacent open area provides outside dining when the weather is nice, and place for the kids to run around. <br><br>If you've not been to Lincoln Square, it's definitely a cute neighborhood to check out.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UCsMqv5ofzt2RueYy2Ltiw/348s.jpg", "caption": "Apricot tart"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lAWItdexM99eUdfFJG0E_Q/168s.jpg", "caption": "Flatbread"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NKv4wbFuUU_1O8CaZxl3Dg/168s.jpg", "caption": "Interior"}]}}, {"review": {"des": "Cafe Selmarie gets a 4-star rating in my book but mostly upon the merits of its food. <br><br>We visited for lunch on a day off from work.  Thinking it wouldn't be too crowded during a work day was a mistake as it was pretty crowded. However, there were still some open tables so we figured service would be ok.... Not so much. While relatively friendly, service in general was very very slow. For some reason our food came out after 4 tables who were seated and ordered after we did. Thankfully we weren't in a hurry.<br><br>The menu had lots of delicious sounding options. I settled on the smoked salmon flatbread. It was wonderful. The lemon in sauce was perfect. Salmon was fresh and a great portion size. All in all a perfect dish. <br><br>However, service was very very slow.  Getting the bill was slow, food delivery, greeting when we arrived.... Etc. friendly, just really slow. <br><br>Cute spot otherwise and amazing looking pastries. I tried a coffee cake the weekend prior and it was wonderfully moist and delicious. <br><br>I will return, but definitely not when I'm in a hurry.", "pics": null}}, {"review": {"des": "This place stole my heart.. Upon walking in I thought it was just a nice cute little bakery with the normal cake and pastries. But little did i know upon looking around I saw one of the most unimaginable desserts i could even fathom in my mind til i saw it that combined 2 of my all time favorite desserts together. Which was a OREO CHEESECAKE!!! I always love cookie and cream shakes and cheesecake as there own dessert, but putting them together ugh..-DROOLING- I was with another friend the also enjoys cookie n creme just as much but there suggestion was that it would be better if the crust was oreo. On my note i believe it was amazing as it is.<br><br>Continuing on aside from the oreo cheesecake i ate breakfast there. It was pleasent we sat outside on a beautiful morning where it had a nice breeze and the sun was height enough to provide some warmth. Over seeing the people walking about with there families and the water fountain brought a family welcoming vibe to the place such as a park.<br><br>Ordering food got a bit confusing because we were looking at there menu, but it was different from the sit down menu so that happened. I ordered the salmon eggs benedict. I'm a big salmon fan getting it for breakfast was a no brain-er. the salmon was smoked to cook the begal used as the base gave it the crispy texture, the grilled asparagus added to the smokey taste, and the egg on top when cut through with the drizzling yolk gave it moisture and was the final flavor when combine with everything made it all perfect for a healthy breakfast in the morning waking all my taste buds.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jOLEasAo31qnmJWFx7cmhg/348s.jpg", "caption": "Salmon Egg Benedict (not actual name)"}]}}, {"review": {"des": "So much has been said about Selmarie and it's just as good as everyone says. People that complain about this place are just in a bad mood. If you get a seat on the patio then it's even impossible to be in a bad mood!", "pics": null}}, {"review": {"des": "Everything is fresh, and the staff is polite. The artwork on the wall often looks as delectable as the food, which is a nicety often forgotten. I recommend the scramble or breakfast burrito for brunch, and the sprout salad for dinner. The flatbreads are also tasty.<br><br>After trying brunch and dinner here, Selmarie is exactly what it purports to be. A romantic and cozy place to celebrate a special occasion or have a fancy brunch. But it's not surprising. Selmarie was ahead of the pack with its espresso offerings in the 80's, and now it's really hit its stride just as Lincoln Square lit up economically. When a trendy little cafe is nestled in the heart of a charmingly rare pseudo-European piazza amidst one of the most drastically gentrified  hubs in the city, it will likely prosper, along with local property values.", "pics": null}}, {"review": {"des": "Excellent! Everything is wonderful..I love their veggie chili and for dessert the dark chocolate raspberry tart. Top notch service too.", "pics": null}}, {"review": {"des": "What I like about Cafe Selmarie: <br>-Staff are friendly and attentive. <br>-Service is quick. <br>-They have a nice selection of bakery items.<br><br>But their food (at least for Saturday Brunch) is just ok.<br><br>Chorizo Benedict is mediocre. Something about the chorizo just didn't taste right.<br>I also tried their iced mocha with soy milk & whipped cream. It was just average but the whipped cream was too thick and just didn't taste good to me. <br>I'd recommend the Pesto Scramble & Chicken Sausage. <br><br>I will update my review once I try their dinner menu.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fgblxqQSgCmElJDHcAlheA/348s.jpg", "caption": "Breakfast Burrito. My friend thought it was good."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/t8Q0mMxqUkzAA0r1VbNGng/168s.jpg", "caption": "One of their specials, Chorizo egg benedict with fruit. Just fair"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1b6h9gvC3KJ3FI-g9aoQ_Q/168s.jpg", "caption": "Iced mocha with soy milk and light whip cream (l). Mocha with regular milk (r). Whip cream was too thick and didn't taste good."}]}}, {"review": {"des": "Honestly, I come here for a cup of tea and one of their amazing bakery treats. It's hard to narrow it down but my go to is the raspberry custard tart, pear tart, mixed fruit tart, or the strawberry custard tart. So many great treats to try! I have had brunch in the restaurant. It is also very good. <br>Located in the heart of Lincoln Square, there are many shops to check out if you have a long wait for a table. <br>Everyone is very welcoming and friendly.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/en9D0WUDOn9AqklqpShPUA/348s.jpg", "caption": "Strawberry Custard Tart"}]}}, {"review": {"des": "LGBT COMMUNITY ALERT:  RESIST CAFE SELMARIE!<br><br>This Sunday afternoon  I and a local celebrity Queen were refused seating when there were 8 empty tables and no line of waiting customers for the following reasons:<br><br>From the Hostess:<br>1.  We cannot seat you at a table because there are no tables available.<br> 2.  Yes there are open tables but the servers will not serve you.<br>3.  Others - note, no one was present - are on the list and have been waiting and are ahead of you (but no one was seated.)<br>4.  Never offered to add us to \"the list.\"<br>5.  You can purchase food to go.<br><br>As we stood there stunned and humiliated a counter person told us:<br><br>1.  We have a lot of managers here but none are available to speak with you.<br>2.  Would you like to buy some food and take it with you?  <br><br>When I explained that the multiple given reasons for not seating us - all of which were obviously false -- made me suspect that there may be a different reason for not seating us I was told I could buy something at the counter if I wanted and take it with me.  I said I would never spend money in a bigoted place such as this and they said that was my choice.<br><br>Please make it your choice as well.", "pics": null}}, {"review": {"des": "We happened upon this nice little while out looking for a burger. Once inside we found we'd missed the lunch menu, but that was our good luck. I had the beef goulash and my partner had a pasta dish using zucchini instead. I rarely review but i have to say the only word for these two dishes is inspired. Both delicious, unique and perfectly presented. It's a cozy neighborhood decorated with original artwork of unique homes nearby. The service was also excellent.", "pics": null}}, {"review": {"des": "Wish I was feeling the love here like some of my Yelp friends. Really too bad, as the setting is charming and the food very good. However, the rest went down hill after the friendly smiling greeting from the people behind the bakery counter.<br><br>Once seated I got the sense that our server wanted to be elsewhere, just distant, but still professional. I've been doing a Cobb Salad tour around the city, as it's one of my most favorite things to have. My salad tasted great and looked pretty too, then I had salad envy when I saw the size of the exact salad served a couple of tables over. At first I thought I was imagining it, and then I remembered that I took a pic, so I pulled it up, yes definately quite a bit smaller. Also slow on the coffee refill, I would have had a bit more, but waited awhile for my one refill, and wasn't offered any when she dropped off the check. When I was a server I made sure not to keep people waiting on things like coffee and water. Also if it wasn't busy, which it wasn't I'd ask if people wanted a refill when I dropped off the check. I know this place is small, however for a short time there were only three tables occupied, then two counting  us. So no reason for slow service. <br><br>Will I go back, sure, I'm hoping this was a blip in their service and preparation of my salad. One of those off days, you know when you tell a friend, you must go here it's great, and they <br>have an entirely different experience, yeah it's like that.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eBX3E4EIm2rQ5KfbLbX5Mw/168s.jpg", "caption": "Black Forest"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uf3JRPIWofmWiXkmMVM0Qw/168s.jpg", "caption": "Another Cobb salad"}]}}, {"review": {"des": "Fabulous bakery.  Croissants are perfect and the cakes are to die for.  This reminds me of the bakeries in Europe, where excellence is more than just piling on the sugar.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5jpZ9XYyQbW2lGjJlF2Idg/168s.jpg", "caption": "Tiramitsu"}]}}, {"review": {"des": "Superb! My daughter and I went here and we couldn't have been more pleased. Everything we had was to die for and the service was exceptional. Will definitely be back!", "pics": null}}, {"review": {"des": "There was a very helpful and we all had a smile. The rum cake was delicious. Also the gluten-free chocolate cake with my first time ever having gluten-free cake and it was really good. I am in love with the spinach and feta croissant.they have desserts and pastries from all around but they are mostly French. They serve brunch and breakfast and lunch items but haven't tried those yet.", "pics": null}}, {"review": {"des": "I have never sat down to eat here, but my husband and I love the mocha and some of their baked goods. I experienced some thing here today...that made me not want to ever step a foot in the door again. I walked in and everyone was clearly busy doing stuff..so I waited to be helped. During my wait, i noticed that one of the baristas was just counting money in a cup..and our eyes met...about 2mins later a gentleman then walked behind me...in a matter of seconds, this barista walked up to him and asked if he needed any help...I was surprised but just kept my mouth shut and stood there waiting. not long after that, another  barista came to get my order.  As soon as the gentleman behind me realized that his order was taken before mine, he apologized profusely. I told him it was ok and not to worry about it. What surprised me the most...was that this barista who blatantly skipped me (and clearly heard the gentleman apologize) just looked through me...and didn't even acknowledge (much less apologize for) her omission.<br><br>I would like to think that my dark skin color had nothing to do with it.  it would've been super rude regardless, but this treatment was a real disappointment for what has been a favorite coffee spot for us.<br><br>the lady who did this has bangs with long reddish hair...and I have actually never seen her before(or at least hasn't taken my orders before)..the other baristas are very lovely.", "pics": null}}, {"review": {"des": "This place hit all the marks. The service was great. Our waiter was very nice and funny, seemed like he was in a really good mood. Their busser was one of the best I've ever seen, dishes weren't left on the take for more than 30 seconds after we were finished. He was very attentive and stood in the corner overseeing everyone, so professional. The food was outstanding. I ordered the tomato basil soup and zucchini linguini which was amazing, the zucchini was cooked perfectly and all the garnishes that cane with the dish were delicious. My husband ordered the skirt steak, I had a bite and it was cooked to perfection. The green beans that came with his dish were also cooked perfectly. Even the complimentary bread they give you was baked fresh in house. I can't wait to go back!", "pics": null}}, {"review": {"des": "We have come here several times and have never been disappointed. We always come for breakfast, and it is always fresh quality ingredients and great service. Also, the value that you get in the portion size is wonderful.   Sitting outside is so great, sitting inside can be a little noisy. Especially if you come just before lunch. Lots of moms and kids. If that's not your scene come much earlier.   So it was great seeing all of the mommies drinking wine with their early lunch.  We will be back, we will be back often", "pics": null}}, {"review": {"des": "Enjoyed the hell out of this place! Super cute patio, prompt service, good coffee, amazing food. We brunched here on a Saturday morning, not too crowded and just delightful. Our waitress was very nice and our brunch was so beautiful to look at and so yummy to eat.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RwLyIOBeTd5OpPnU-DAzcA/348s.jpg", "caption": "Delicious corned beef hash and chicken chilaquiles amazing"}]}}, {"review": {"des": "Great spot for breakfast with outdoor seating.<br><br>Salmon Egg Benedict: 4.5<br>BLT: 4<br>Lox and Chicken sausage omelete: 4.5<br>Intelligentsia (house blend roast): 3<br>Lemon Bars: 4<br><br>Service is good, but needs improvement. There is usually a 45minute wait for weekend brunch. The crowd is affable and lively.", "pics": null}}, {"review": {"des": "Cafe Selmarie's lemon bars - it perfectly decadent, lemon-y, sweet, a good-portioned size bar that is powdered with powdered sugar.  It is a little pricey, but I always make it my mission to get at least 4-6 pieces to go.  I love it, and I haven't tasted great lemon bars like these anywhere else.  Yum!<br><br>+lemon bars", "pics": null}}, {"review": {"des": "I used to think brunch was a really lame concept.  But these past few brunches with my girlfriends have me in love and ready to pounce on the next brunch invitation that comes my way.<br><br>The Saturday brunch on the patio at Cafe Selmarie was a relaxing (and delicious!) experience.  They don't take reservations, but it was only about a 20 minute wait in the late morning.  The view on the patio is of lovely Lincoln Square, with a fountain, lots of shady trees, and families gathering in the park.  <br><br>I dove into my White Russian Iced Coffee, topped with real whipped cream.  The Bourbon Cherry French Toast was dripping with mascarpone cheese and cherries soaked in booze. Deciding between sweet and savory is a tough choice, but I did not regret this one!  My friend's smoked salmon breakfast looked like a good, savory competitor.<br><br>On my way out I bought a Blood Orange Italian soda to-go.  Any cafe that has both blood orange and lavender syrups available has my heart.<br><br>Even if I don't make it to Selmarie for brunch again, I will definitely stop in for a latte or Italian soda, and some of their baked goods, next time I'm in Lincoln Square.", "pics": null}}, {"review": {"des": "My friend from Chicago told me that we needed to go to Selmarie for Iced Chai Teas. I was a skeptic because I thought a chai tea was just a chai tea. Wow! I was wrong. I ordered mine with whole milk and she ordered hers with soy milk. Both were crisp and refreshing on a hot, Chicago day! The pastries in their counters looked very fresh and amazing!", "pics": null}}, {"review": {"des": "Cafe Selmarie was the choice for our Brunchy Brunch meet up for May. I've seen how packed Lincoln Square is on Saturday mornings and I was a little worried that we'd have to wait a long time for a table. CS won't seat incomplete parties either.  But once all three of us arrived, the wait for an outside table was minimal. <br><br>Al Fresco dining is always what I prefer, but do know that dining on their patio here you'll pretty much be front seat to all the little kids running around in the square. Well, I'm here sans kid, with some great friends and CS's delicious iced White Russian coffee in hand and all that activity is quickly forgotten.<br><br>Thank you Osi V for opening with the cinnamon roll--it was definitely big enough for the 3 of us to get a good taste.  It was a great opener--subtle cinnamon flavor and delicious icing.  <br><br>For my main, I opted for the smoked salmon breakfast--cold-smoked atlantic salmon, thinly sliced, with scrambled eggs, capers, red onion and a toasted english muffin and a side of cream cheese.  I subbed the potatoes for fruit and received fresh pineapple and orange slices. The smoked salmon was of excellent quality and very tasty. The scrambled eggs were fluffy and well made.  It was all very very good. <br><br>Service was friendly, although our server seemed a bit harried--I wonder if she had too many tables to take care of. <br><br>Before we left, I bought some oatmeal raisin and chocolate chip walnut cookies from their bakery to take home.  These cookies are exactly the way I like--more crispy than soft/chewy.  Perfect with a glass of ice cold milk.", "pics": null}}, {"review": {"des": "Wait time for brunch was about 45 minutes, but it was worth it. Got the Cherry Italian Soda, asked but a chocolate croissant  but they ran out!! :(<br><br>I ended up with the pesto scramble. It's scrambled eggs with sliced tomatoes sausages and potatoes. Very yummy. I would come back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/L1rxqNl3xQO0X8ng_bjJUA/348s.jpg", "caption": "Pesto scramble"}]}}, {"review": {"des": "This place is just amazing. First, let me say that my fifth star in this review is due entirely to the amazing service. I showed up unannounced with my students. (I teach ESL to adults.) There were nearly twenty-five of us all together. This could have been the catalyst for a chaotic and frantic scene but it was calm and relaxed as the servers rearranged chairs and tables to accommodate our giant group. Beyond the accommodation, the servers got everything right. My students all speak English pretty well but some of them are lower than others and some have heavy accents. The servers were patient and explained everything my students asked. <br><br>The food? Delicious! I had a spinach and feta croissant with Cafe Au Lait. Both were delicious. The pastries are amazing. I couldn't resist picking up some of those unique pumpkin pies inside the miniature pumpkins.<br><br>I'll definitely come back to this place...though I may just bring a couple friends.", "pics": null}}, {"review": {"des": "Nice ambiance. Great service and food is delicious. I was greeted as soon as I walked in. Service is awesome. Nice little resto with great outdoor dining. Macaroons were moist... I bought all of them", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Q-J_9bWCSQ3wpsgjb5O1Ug/348s.jpg", "caption": "Excellent taste"}]}}, {"review": {"des": "I was impressed by their chopped salad which came with warm bread and butter. The rest of our food was also great. Don't skip on the desert (especially the tres leche)! Our server, Daniel, made us feel so welcomed and was very thoughtful. Thanks Cafe Selmarie!", "pics": null}}, {"review": {"des": "The real stuff! Authentic 'Torten'. Small selection but excellent quality. Generous portions. Reasonable priced. Trendy meeting point for young and old. Within a small touristy area and close to a German/European grocery store. Well worth the visit.", "pics": null}}, {"review": {"des": "I had to ignore the pastry display while walking to my table in the back, otherwise I would have bought everything! I was hungry and the delicious pastries would have beckoned to me...aaand then I would have bought a few and devoured them all. <br><br>This is such a cute little brunch spot and my girlfriend and I enjoyed our meals. I had the smoked salmon BLT which had bacon, avocado and lemon-chive aoli. It was simple but tasty. My friend loved her fried green tomato sandwich and I wish I had a bite! They make a solid and strong Bloody Mary, too! Our server was awesome and super friendly. After seeing photos of the fancy French toast and other weekend brunch items, I need to return soon!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vAdtDlUn2thu2jxF3vVbiw/348s.jpg", "caption": "Smoked salmon BLT and a Bloody Mary!"}]}}, {"review": {"des": "I am a big lover of Cafe Selmarie and have been coming here for the past two years. The food has never disappointed and is always good. <br>My only hiccup is the ever-changing management and wait staff. It seems that overtime that I come here, which is usually for lunch and/or dinner, there are a couple new staff members. Some of which can be overbearing and brusque.<br>So, my advice to the Selmarie management, please dedicate a bit more time to training your staff!<br>Regardless, this cafe is situated in the best spot in the Lincoln Square neighborhood. A wonderful place to walk through on a beautiful Saturday afternoon with friends and do some shopping. <br>With that being said, I would recommend this restaurant to anyone who loves good food and delicious pastries.", "pics": null}}, {"review": {"des": "Two stars- not great. Normally they are pretty much perfect, but this morning my breakfast was sad, sad, sad.<br><br>My omelette this morning was completely bland and flavorless- like eating a napkin wrapped around the filling. It was strange because the mixed salad and potatoes that came with it were both seasoned/dressed nicely.<br><br>When I mentioned it to the waitress (having only picked at a bite of the omelette) she said \"Oh, they don't ever salt their omelettes.\" No apology or offer to comp the uneaten dish- just that they apparently don't season their food?<br><br>Whaaaaaaaat?  Unseasoned eggs are like a sky without sun, a morning without coffee, Chicago without the Cubs.<br><br>I love you, Selmarie, and will still stop in for cookies, but until your cooks learn how to season their dishes, I won't be back for a meal.", "pics": null}}, {"review": {"des": "Part of me thinks I should wait a day or so before writing this but the maxim that you're only as good as your last meal--or in this case, service experience--rings true and alas, it totally undermined what I have always thought Cafe Selmarie was all about. And for the record, the comments are not about the sit-down restaurant experience but rather the bakery counter. <br><br>It is a stalwart, to be sure, one of a small handful of Lincoln Square businesses that have endured through the area's gentrification. (Lincoln Quality Meats also carries the \"old-timer\" banner and I often make a point of dropping in there, too, an acknowledgement of its tenacity.) And mostly, Selmarie is a worthy spot with lovely baked goods that pay homage to an ethnic past while still acknowledging current tastes and trends. <br><br>I'm most likely to drop in at holidays. The stollen is terrific at Christmas and hot cross buns are an essential part of pre-Easter traditions. So I walk in this morning, about 45 minutes after opening. There was a brief moment of panic--no hot cross buns to be seen. They seem to appeal to an ever-shrinking audience so I always worry about them becoming obsolete here, there and everywhere. There were two people working at the counter; I asked if they had any h-c buns. She said they weren't quite ready last she checked. Ponytail guy, with all the disinterested ennui he could stir up from his bored, lifeless self, said they weren't iced yet. Nice gal goes back to check and before she even reaches the prep room, someone walks to the front case carrying a tray of the little beauties, icing in perfect crossed pattern. <br><br>Working a counter in a charming little neighborhood bakery may not be his dream job but it's his job, the one for which he applied and accepted and for which Selmarie owners pay him to fulfill. Accepting those facts, it is his obligation to represent the business professionally and with a sense of customer service. His affectations and lack of respect for guests or for the owners is pretty repellent. It mattered not a whit to him to either serve a customer or to sell the business's products. <br><br>Anyway, nice gal packs up a couple of still-warm hot cross buns. They are exactly as they should be (well, almost; I still dream of finding them set atop the little rice paper base as they were long ago intended to be), so good that I might go back on Friday and Saturday before they disappear until next year. And if I do, fingers are crossed that Bored Guy is on hiatus.", "pics": null}}, {"review": {"des": "I'd like to tell you that Cafe Selmarie is bad; that the waitstaff are mean; that the back of house isn't good enough to make \"Kitchen Nightmares\" and that Gordon Ramsay tried to shut the place down. I'd like to tell you all these things, because then I'd never have to wait in line for a table ever again, especially at the outside patio tables in summertime. But I am an honest Yelper, and I can only say the following:<br><br>1)  I've eaten at Selmarie since the late 1980's, when it was a teeny tiny bakery with a few sandwiches, and I've never, ever had a bad meal here.<br><br>2)  The waitstaff are pleasant, efficient, helpful, and wear black hats that aren't cutesy or obnoxious.<br><br>3)  Entering past the bakery case is an exercise in restraint. It's amazing to me that there aren't saliva trails on the glass-fronted case, but I think the staff is very good at cleaning that sort of thing up quickly.<br><br>4)  Even the coffee is good.<br><br>On many occasions, I stick with the tried and true and get the chopped salad. Yum. My favorite. On the weekend, they sell slices of apple strudel. Again, yum. Today, we varied from our standard repertory. I had the applewood-bacon BLT with boursin cheese on marble rye, and that came with a cup of tomato bisque soup. Wonderful. My friend had a salmon wrap with salad side. The busboy tried to take her plate when she had two bites left. He's lucky she didn't wrestle him to the ground. She wanted those last two bites.<br><br>But don't believe me. Go to the latest \"hot\" restaurant, folks, where the cheapest alcoholic beverages start at $12.00. Stand in line for an hour at some overpriced Yuppie brunch place. Follow a \"star\" chef from restaurant to restaurant. Please. Do all those things. And while you're doing those things, me and mine will be having the mac and cheese with leeks, the crusty and piping hot chicken pot pie, the quiche of the day, the veggie chili, and oh, just maybe, a dessert. Flourless chocolate cake. Raspberry chocolate tart. Apple strudel pie. And . . . oh, I don't know what else, Selmarie. Surprise me. You haven't disappointed me yet.", "pics": null}}, {"review": {"des": "Very solid brunch experience at Cafe Selmarie! Stopped by with a group of four around 11:00 on a Saturday and had about a ten minute wait. There's not a ton of space to wait inside, but you can grab a pastry or coffee while you wait. Once we were seated, our waitress came over right away. Pro move, order a cinnamon roll, heated up, to curb your hunger. This was super delicious and a great way to start the meal!<br><br>For brunch, I went with the smoked salmon breakfast and it was really fresh and tasty. Large portion of smoked salmon, eggs, English muffin, little bit of everything. Additionally, the breakfast potatoes were a very solid addition. Others at my table had the bacon and egg flatbread, veggie omelet, and corned beef hash. I had a bite of the corned beef hash and it was very flavorful and a very hearty portion. The restaurant is pretty small, so I would anticipate larger wait times when it gets warm outside. <br><br>Overall, great option for brunch in Lincoln Square. Definitely no frills, family-type spot, but I will absolutely return. Prices are normal for brunch in the city, $10-12 dishes. Highly recommend!", "pics": null}}, {"review": {"des": "Was there for a brunch last Sunday. The terrace was full and they had a long waiting list - as we could expect for a beautiful sunny Sunday morning, so I just took some food to go.<br>Their pastry is so delicious! I remember having a banana chocolate eclair, a chocolate croissant and some raspberry chocolate tart. Huge portions and everything is so tasty!!<br>I also heard their flourless chocolate cake is worth trying, but I didn't had enough appetite... next time!", "pics": null}}, {"review": {"des": "This is the best restaurant for your brunch. The is a great breskfast selection. You can buy pastries and cakes at home and are renowned throughout the quarter. They also have the best eggnog. Staff is very nice and fast. Constantly pour coffee and ask whether you have everything ;)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EbjCroLwx25br1graI6dyw/168s.jpg", "caption": "The best of brunch in Chicago"}]}}, {"review": {"des": "This is a solid brunch location. The service was a little spotty when we sat outside. We have to keep asking for coffee refill. But the food is good and consistent. We haven't had the baked goods yet but I have heard they are high quality and delish!", "pics": null}}, {"review": {"des": "Great brunch, with the gorgeous Lincoln Square right outside. A must visit if you are in the neighborhood.", "pics": null}}, {"review": {"des": "My fiancé came here on a Saturday morning for brunch. We were the only one there upon opening. We were greeted right away and seated right away. We ordered our meals and it came right away. <br>I had a smoked salmon omelette and it was kind of over done. Usually, I don't get omelette but I did. My fiancé got the corn beef hash and it was good. <br><br>The coffee  was good and the pastry is also good. We will come back for pastry.", "pics": null}}, {"review": {"des": "This place is awesome! The last time I came, I ordered their black bean burger for lunch. It was delicious! It came with taro chips and a cole slaw salad. I love a good black bean burger! The service was excellent, and their employees are really nice! I also tried some of the cookies from here and they are also amazing! <br><br>The only reason why I didn't give five stars was because I felt that the cost of the food was a little pricey for me. Other than that, I would definitely try this place out! I'll come here again if I think I deserve a nice treat.", "pics": null}}]}