{"name": "cairo-kebab-chicago-3", "reviews": [{"review": {"des": "Great people and an awesome owner, I called him and asked if he can prepare chicken tikka with no salt and made it as I asked exactly. The very next day I went along with my Mom and I had the most delicious shawarma I have ever had , then I ordered Taboula and it was amazing too. Everything was as I expected and more . Thank you for being so generous to your clients .<br>Thank you sooo much <br>Rasha <br>Indiana", "pics": null}}, {"review": {"des": "I guess I don't understand koshary.<br><br>I was raring to try it based on the raves, but it just felt like soggy mac and cheese mixed with rice, random lentils, and bland tomato sauce to me. Not much flavor. Maybe it was my fault for not specifying it spicy. I did like the fried onions on top - who doesn't like those?<br><br>We enjoyed our (albeit salt-heavy) lentil soup and the oil-pooled, green-flecked babagannouj was among the best I've ever had.", "pics": null}}, {"review": {"des": "Affordable, delicious and fresh food. Love this place.<br><br>We stumbled on this place while we were out shopping on the weekend. We ordered the hummus, chickpea salad and the falafels. The food was delicious and very fresh. You could tell even the hummus was freshly made. The pitas that came along were hot and spongy and the salad was great as well. The falafels were piping hot and perfectly seasoned. The ambience is good, service is friendly and the food is great. Definitely try this place out if you are in the neighborhood.", "pics": null}}, {"review": {"des": "Wonderful: delicious food, friendly service, large portions, bargain price. Try the koshary, Egypt's national dish of rice, lentils, macaroni, and chickpeas topped with tomato soup and fried onions. Will definitely be back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZKcnJqarpbiQTAmhEjShMw/348s.jpg", "caption": "tabbouleh, koshary, and lentil soup"}]}}, {"review": {"des": "Food here was pretty great and also affordable! Stopped at this one for dinner a few nights ago and it was pretty empty so no issues grabbing a table. Definitely a casual spot with plenty of peeps grabbing to go or delivery orders.<br><br>For food I did the lentil soup and a beef & lamb shawerma sandwich. Lentil soup kind of reminded me of chicken soup for some reason, but not bad. Then after trying my sandwich/wrap, I thought the meat was good and it went nicely with the lettuce, tomatoes, pickles, tahini & hummus. But after having a few bites of my wife's chicken kebab plate... oh man! That chicken is so moist and juicy! Definitely would consider grabbing the chicken kebabs when here.<br><br>Other things to note... it's Egyptian halal food! They also do have options for vegetarians and vegans. Anyways that's all I got on this one!<br><br>'Til next time, cheers!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/152l-HGHIeCsukdwJcLvig/168s.jpg", "caption": "Beef & lamb shawarma sandwich"}]}}, {"review": {"des": "Kebab is really good, but soup and ful is their heart. Recommend it next time you want a mountain of warm, flavorful, home-style food.", "pics": null}}, {"review": {"des": "After a massage we stopped in-great choice! Shared the grape leaves, falafel, small Egyptian salad and chicken shawerma sandwich. Prices reasonable, great service, staff friendly, business clean and large portions. We will be back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1ESoFG8RFIiiH4QmNVWRKQ/348s.jpg", "caption": "Grape leaves appetizer"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IukELgINhwxatFJ9obTouQ/168s.jpg", "caption": "Falafel appetizer"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/d-dcDETzt2ezPE8WAWuOyA/168s.jpg", "caption": "Small Egyptian salad"}]}}, {"review": {"des": "Had a fantastic falafel sandwich, Turkish coffee, and Baklava; $15 including a 20% tip. Table service, nice interior, friendly staff. Great value!! Highly recommended. I will be back!", "pics": null}}, {"review": {"des": "Loved the place. Fast, friendly service, really tasty food, neat ambience too. The tables are covered in hieroglyphics, a neat little added bonus. <br>Looking for an evening out? They have comedy events, dinner and entertainment all included!", "pics": null}}, {"review": {"des": "Need to grab a bite before my mani and pedi appointment. Found this Mediterranean restaurant close by decide to give it a try with my sister. We order the chicken shawarma sandwich. It's was a good choice we made. Love the chicken well marinated and the wrap is pita bread not too thick. I love it here. Street parking.", "pics": null}}, {"review": {"des": "Great spot for quick shwarma and fries. Nice staff and quick service. Highly recommend over other kebab spots", "pics": null}}, {"review": {"des": "Excellent food! Certainly be back next trip round. The food was very very delicious the people are very nice and easy-going price very well", "pics": null}}, {"review": {"des": "WOW! What a pleasant find this was! I love Mediterranean food and this tops them all! Service was great & the owner is also the chef!  Prices are great too. Make sure you go!", "pics": null}}, {"review": {"des": "An Egyptian friend of mine recommended this family owned Egyptian restaurant and WOW where do I start? The staff, the staff the staff....one word: Amazing.<br><br>Very genuine staff, always smiling and courteous. I kind of almost felt like I knew them in another life?.... 0_o<br>I'm not even exaggerating.<br><br>Now, on to the food.... We were amazed that the pita bread, it was so fresh and HOT! I seriously think they possibly bake their own pita bread now that I think of it. Even the most popular 5star middle eastern restaurants don't serve fresh hot pita bread! <br>They started us with lentil soup on the house. It was chunky, thick and savory. You can tell they put some time and effort into making their soup. My kids never ever everrrrrrr eat lentil soup at any restaurant, but this one, they looovvvveed. We even had to ask for more. My little 2 year old ate by himself without help, that's how much he liked it! They also got fries on the side. <br><br>We ordered the Jerusalem salad, hummus, and \"ful\" on the side. These three appetizers honestly couldn't be made any better.<br><br>My husband got the Cario kebob combo. Super moist well seasoned and juicy meat. Pure pérfection! I obviously had to try their koshary with chicken shawarma which was very flavorful and made with Egyptian rice, red koshary tomatoe sauce, lentils, macaroni, and topped off with fried onions.  <br><br>The bill was lower than we expected, considering how many things we ordered. <br><br>Overall, good quality Egyptian food that won't disappoint.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tI9qMDGwTGD2je8Wbvse9w/348s.jpg", "caption": "Table"}]}}, {"review": {"des": "Really good food, even better prices!! (that's the short version of this review).<br><br>A little more detail... We had Falafel, Tabbouleh (good), Egyptian salad (my personal favorite, decent size but it only had like 4 little pieces of cheese but only cost $3.5 so, can't complain) and lentil soup, which was also really good (they forgot about this so brought it after the Entrees, which was good bc I took meat and add it to the soup and was even better).<br><br>The Cairo Kebab Combo was tasty, the meat super good. And it's a good size plate, so we shared it, actually shared everything (except my soup (: )... We ended full and paying only $35 (before tip).<br><br>Totally recommended.", "pics": null}}, {"review": {"des": "I came here with a friend on a holiday weekend quite late around 8:15PM, and I got the kofta plate, which came with two sticks of meat and chopped grilled vegetables on a plate of yellow rice. The waitress also brought us hummus and pita bread; I wasn't quite sure what she said but it was complimentary. I asked for hot sauce too. The meat was a bit dry and a bit lacking flavor, the grilled vegetables were a bit too burnt for my liking, and the rice was just alright. The hummus was good and the pita bread was thin. For $11.75 pre-tax pre-tip, it was a decent amount of food. Pretty average all-around for food and our food took a while to come out but service was quite friendly.", "pics": null}}, {"review": {"des": "Completely unimpressed with their Falafel and Hummus.  Hummus was watery and their Falafel had no taste.  Their Baba Ganoush was better, but when you screw up the basics, thats a bad sign for the rest of the food.  Doubt I will be back.", "pics": null}}, {"review": {"des": "I've met my new favorite food: koshary - a vegetarian, carb-loving dream. It's a great mix of soft grains, flavorful tomato sauce (ADD THE SPICY SAUCE), and crunchy onions. I'm salivating just thinking about it. <br><br>They gave us a free taster of the soup, which was quite good (they add potatoes in with the lentils!), although not my favorite (I'm a red lentil soup girl). The lamb shwarma platter was good, but the meat was a tiny bit too greasy/underseasoned for a platter. It would have been great in a sandwich or with the provided yogurt sauce. <br><br>The date cookies and Turkish coffee were a great finish to the meal. Those cookies were just the right blend of crunchy outside while still being chewy. Service was quite friendly. We'll definitely be back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VDMIHPzWrfa3jjiDVBsMhg/168s.jpg", "caption": "Koshary - quite possibly my new favorite food ever"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nGE8HiAZ26JL3iav30nTfA/168s.jpg", "caption": "Lamb and beef shwarma - better as a sandwich"}]}}, {"review": {"des": "I love that it's family owned. Service was great and attentive.<br><br>We got koshary and the chicken kabob. Both were great!! We were so full afterwards. Loved trying the new and interesting dish :)", "pics": null}}, {"review": {"des": "We stopped in here for lunch before the movies on a Saturday. Service was great and the prices were very reasonable. I checked in on Yelp to get my free lentil soup. I've never been a fan of lentil soup, but there's was pretty good.<br><br>For my entree I went with what I normally order at Mediterranean restaurants...beef shawarma.<br>It was very tasty! The beef was seasoned well and the rice tasted fresh and not oily like some restaurants can be. <br><br>Next time I come back I'm eyeing the falafel sandwich and the combination Platter.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-qeHqNiu7MFlVczFYs7TDA/348s.jpg", "caption": "Lentil Soup"}]}}, {"review": {"des": "Cairo Kebab, where have you been all of my life?? <br><br>As a big fan of Med/Middle Eastern cuisine, this was definitely on my radar.<br><br>I only got delivery, but can't wait to dine in next time.<br><br>I got the veggie combo with falafel, baba ghanoush, and grape leaves. Their baba and grape leaves were the best I've had yet. I could not stop eating this. While their falafel was very good, Taza's (in the loop) imo still reign supreme. I tried my boo's Cairo kebab combo and this was very good too. The only mishap was that they gave us salad instead of the requested soup as the side. My friend got a large order of the hummus and I was overjoyed that it was indeed a hefty sized order of hummus. He couldn't finish it and while I'm not a big fan of hummus (or maybe I just grew tired of eating so much of it throughout the years), I devoured this as well. Along with the baba and grape leaves, their hummus was also the best I've tried and it was all seriously addicting. Also, the accompanied pita bread was perfectly soft and warm.<br><br>Delivery itself took about 40 minutes which was appropriate.<br><br>Overall, our experience was great and this will be my go-to for this type of cuisine. Looking forward to try their Koshary specialty. Also, they're halal!<br><br>**Ordered koshary and lentil soup another time and they are fantastic! Not big into lentil soup but theirs is special. Koshary was extremely satisfying.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/h3FnJ0ByC_9nNz09g5WitA/168s.jpg", "caption": "Cairo combo"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XBT09zzIW_I0cTHur41kmQ/168s.jpg", "caption": "Veggie combo: Baba, grape leaves, falafel"}]}}, {"review": {"des": "This place makes an excellent and unique pita wrap. Both the falafel and chicken swarma are very good. The only issue is that it takes so long. I'm used to Sultan's Market where they make the the falafel sandwich in 1 minute. I don't want to wait 10+ minutes for my food.", "pics": null}}, {"review": {"des": "Let's just say I was too hungry to take a picture before my meal had arrived. <br>The waitress allowed me to sit wherever I preferred and was able to give me her recommendations. I decided to go with the chicken kabob plate. I asked for a side salad and some tahini and hot sauce on the side. <br>The salad was great, good start to my meal. The hot sauce was too spicy to enjoy, and the tahini was typical. They served my meal with garlic sauce... now that is a sauce! It was amazing! So good that I asked to take some home! <br>My entree was delicious!! The chicken was perfectly prepared with just the right amount of pazaz! The rice with veggies was also great! <br>I look forward to coming back and ordering the same thing since it was so good! <br>Thank you!!!", "pics": null}}, {"review": {"des": "Excellent authentic and truly delicious food. Great service to top it all off.<br>From the money we entered were greeted with a nice welcome and seated right away, food was at our Tebow very quickly, very delicious.", "pics": null}}, {"review": {"des": "We came from Ohio and we tried Cairo kebab restaurant first the place is very clean people who work there are very friendly,The chef came two times to check if we liked the food he is a very nice man . Second,The food was delicious we ordered combo, kebab with rice , shawarma and koshari it's Egyptian food and it was very tasty we liked it . We liked the food , the place and the people too, definitely we will visit this place again when we come to visit Chicago", "pics": null}}, {"review": {"des": "BYOB. Lunch specials. Counter Service. Excellent value, portion and service. Say \"hello\" to Ahmed.  Sandwich and Entrees serves 2. Halal.<br><br>I truly enjoyed the LENTIL SOUP without bacon. :-0<br><br>The cigar shaped GRAPE LEAVES is a perfect to go, and/or eating on the run.  Finely chopped veggies are mixed with rice that is so addictive!<br><br>Well-seasoned BEEF AND LAMB SHAWARMA.<br><br>TURKISH COFFEE is strong.  Sugar please.  Slightly stronger than the typical Greek coffee.  Still a mud.  ;-) Surprisingly, there is NO bitter or coffee after taste.<br><br>I look forward to tasting the menu.  Next, shall be traditional Egyptian dishes.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qH1uDK0B53lki_sAvURwDg/348s.jpg", "caption": "Menu (4.2017)"}]}}, {"review": {"des": "Walked in randomly yesterday for lunch after getting massages across the street. Dine in or carry out; we dined in. It's really pleasant in there! Nice music, not creepy quiet. Clean, airy space. We got some great recommendations of what to order and it felt like they really wanted you to learn about the food and enjoy it. They were so helpful and sweet. When a couple came in that were also Egyptian they were so thrilled and bonded over it. It was really nice seeing younger generations connecting over food in that way. <br><br>We ordered a few items and everything was delicious and fresh. We tried the traditional Egyptian dish with the rice, lentils and fried onions on top and I can't stop thinking about it. Leftovers reheated really well too. I will be back, I love the people and the food.", "pics": null}}, {"review": {"des": "Very tasty authentic Egyptian food, friendly<br>& hospital staff.<br>Defiantly I will be a regular customer.<br>Highly recommended, one of the best Middetranian restaurant in Chicago.", "pics": null}}, {"review": {"des": "We stumbled upon this place while returning from a bookstore nearby and eating at Cairo Kebab was the best dinner decision. The food is incredible, one of the best meals I've had since moving to Chicago. To make it even better the prices are super affordable and service is friendly.", "pics": null}}, {"review": {"des": "Loved everything about this family owned Authentic Egyptian restaurant. The signature koshary dish should have Lincoln Park all coming for a taste. The portions are big and prices are very reasonable. The hummus and baba ghanouj are the perfect flavor and texture. The meats are all juicy, tender, and perfectly cooked. Both soups are amazing. I tried literally everything on this menu, and every item was of the highest standard. Can't say enough about this place. Whether your looking for a good dine in option or a quick meal to go, this new restaurant is a must try!", "pics": null}}, {"review": {"des": "Always looking for a great middle eastern food and we found it! Awesome food, great price, easy pick up, huge portions! Highly recommend!", "pics": null}}, {"review": {"des": "I ordered the lamb and beef shwarma sandwich.  It was delicious and so huge i couldnt even finish it! It was full of flavor.  My biggest complaint about shwarma is chewy and gamey meat but their meat is tender.   i loved it.", "pics": null}}, {"review": {"des": "I stopped in yesterday to try a Chicken Shwarma sandwich thinking I would sample the food first, before using them to cater a party that I was having that night. The waitress was so nice she offered me some lentil soup to try. The soup that she gave me was amazing. As soon as I was done with the soup, I decided right then and there to have them cater a dinner party for me. The chicken Shwarma that they made for the party was even better then what I had in the restaurant. They added onions,red peppers and other ingredients that made it really tasty. Everyone at my party loved what they made. The waitress and the cook were so nice to me. They helped me with my order and they reassured me that the food would be ready on time for the party. I would definitely recommend Cairo Kebab to cater a party or to just have a nice meal.", "pics": null}}, {"review": {"des": "Beautiful family staff with top notch professionalism and customer service. It's become my go to spot for family, hang outs, professional or not. Cairo Kebab can accommodate for any type of setting and is affordable and vegan-friendly as well as absolutely delicious and authentic. You won't find food like this except on the best Egyptian restaurants.", "pics": null}}, {"review": {"des": "Ordered delivery via Caviar for a casual Sunday dinner. We got hummus, some baba, lentil soup, and tabouli salad. We added extra pita, which was a mistake----they give you so much!<br><br>The hummus and lentil soup were the standouts. However, the others were very good! I am excited to try this place again and get one of the meat options as well! Worth checking out!", "pics": null}}, {"review": {"des": "Yum! First, I recognize this for what it is-- a fast casual type of place. This isn't a sit down fancy spot. However, the service is exceptional, and the tables are clean. The vegan options are plentiful. Koshary has great onions on top. The tabouli is nice and lemony. The soup is delicious. Even the hummus is above average. I even ordered fries for take out for friends, and they said they were some of the best fries they've eaten. Everything is reasonably priced, too. Also, they have a party room downstairs for large groups. Definitely think it's worth stopping by when you're craving fast middle eastern food.", "pics": null}}, {"review": {"des": "A lovely experience and great to see something different on the menu. Over the years is seems that Arabic food has become bastardized and in every neighbourhood. Even my Polish grandmother was thinking about making falafel pierogis. But I digress, what a pleasant surprise to see Kushari on the menu. The only place that I know of in Chicago that serves it and makes it very well. Not to mention that they sometimes offer specials on their menu like Molokhia. If you're in the area give it a try.", "pics": null}}, {"review": {"des": "Being Israeli, I'm always looking for good spots to eat Middle Eastern food, and luckily I happened upon this place purely by chance.  The big sign, \"Cairo Kebab\" drew me inside, and I was struck by the Egyptian motifs all around.  The restaurant is large and succeeds in being very spacious and cozy at the same time.  A lovely young woman, whose name is Sara, sat me down, brought over a pitcher of cool water as well as a menu, which I briefly looked at since I'm familiar with all the dishes.  I decided on the hummus, lentil soup, and the kofta kebab sandwich.  The hummus was good--plain, without any toppings, but sprinkled, of course, with olive oil, and it came with warm pita halves (how nice to have a simple pita with which to \"wipe\" my hummus rather than any other kind of bread).  The lentil soup was thick with tiny pieces of potato, so that it made for a filling portion, although I did think it was a tad too salty.  The kofta kebab was a wrap with small pieces of juicy meat--the only thing missing was tehina (or tahini) and a hot, spicy sauce with which to smother it, so it was very good, but it could do with an extra kick to it.  I am, after all, from the Middle East, and we like our food spicy, and we do love our tehina.  For dessert I had their Turkish coffee and a ma'amul.  The coffee comes in a tiny, dainty, authentic coffee cup from Egypt (the sheer beauty of it!), and it was hot and strong and, well, absolutely how we like it back home.  The ma'amul?  Well, that's a thing in itself: I grew up eating home-made ma'amul (thanks to our Jewish Moroccan neighbors), and I've become sort of spoiled when it comes to Middle Eastern pastries of all sorts.  This ma'amul was the real thing--delicate texture, flaky to the right degree, filled with dates (or a date spread).  It was a delicious ending to a mighty good meal, accompanied by gracious service, which is so typical of the Middle East.  The pricing?  So reasonable.  For sure, from here on out I'll make a point of eating here whenever I'm in Lincoln Park!", "pics": null}}, {"review": {"des": "Fantastic, halal Egyptian food! I know people from Egypt and they say the koshary is as good as they've had in Egypt. The owners are also nice, kind people. They've got a small party room downstairs too, in case you want to host a group.", "pics": null}}, {"review": {"des": "Love this place! Staff are friendly, I like the open space, and want to support this family-owned business. Can't wait to head back there and get some more lentil soup, french fries (yes they have fries!) and chicken kabobs. Their baklava is so fresh and packed full, its my favorite!<br><br>Make America Love Again!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MRhr6xcGlKq9BS7BBO3ORA/168s.jpg", "caption": "Make America Love Again!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PlD6lrVKae5zeZhog_5j8g/168s.jpg", "caption": "Fun for kids - they loved the fish tank!"}]}}, {"review": {"des": "The best middle eastern (restaurant) in chicago from quality to sanitation.  The food is delicious and must say as a Egyptian native the flavor is on point.  There isn't much to say about service because it is exceptional.  The food is delicious if there is 10 stars I would have given it to them this is by far a gem.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fzFO_4oXlcR0TDigVytLWg/168s.jpg", "caption": "The best mashawi in chicago"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4l5jpPh3dKxdSpWRLOnGDw/168s.jpg", "caption": "Best Egyptian food ever"}]}}, {"review": {"des": "The pita bread is awesome, but the falafel was very dry.<br><br>I am not a fan of tahini sauce which I got (instead of on my falafel wrap) to the side of my wrap. The wrap was ... uh ... not great.<br><br>The Baba Ganoush was flavorful and not too smoky, and the kofta was good.", "pics": null}}, {"review": {"des": "Amazing service! Our server was super friendly! Food was great, unfortunately I didn't order kushari cause I glanced the menu and just ordered kabobs than saw someone order it and it looked amazing! Next time I'm definitely ordering that. Oh and there filafel are so crispy and yum!", "pics": null}}, {"review": {"des": "So good! Everyone that works here is extremely friendly. <br><br>Lentil soup- free when you dine in. It is so good! I usually do not love lentil soup but I would eat just this!<br><br>Hummus- So creamy and delicious that  I got a large order to go just to have at home until I return again. <br><br>Falafel- Crunchy on the outside, soft and flavorful on the inside, as it should be. I always dip my falafel in hummus and our waitress suggested we do it as well, so I am glad I am not the only one :) <br><br>Chicken Shwarma- Great, tender chicken. Rice was great and moist. <br><br>BYOB! <br><br>We will be back!", "pics": null}}, {"review": {"des": "This place is terrific.  Great service and the food is amazing.  I think the shwarma is as good as I have had anywhere.  The staff is incredibly friendly.", "pics": null}}, {"review": {"des": "Unique and tasty falafel wrap. On point lentil soup. Friendly and nice staff. Coming back for more! <br><br>I've traveled far across the lands tasting a great share of falafel, and this place ranks in the top. Haven't yet come across another middle eastern place in Chicago as good as this. I was pleasantly surprised that the falafel pita wrap was panini'd! Maybe they discovered that secret 2000 years ago and it was lost, but I'm really glad Cairo Kebab brought it back. Lentil soup also nicely spiced.", "pics": null}}, {"review": {"des": "The place is clean and nice<br>The waiters are very helpful <br>Very good service Great food <br>The best koshry ever", "pics": null}}, {"review": {"des": "Quite a group of hosts and cooks!  All good!  The open cooking area makes for great interactions and the restaurant works at making sure you are completely happy with your order.<br><br>We went with the shish kabob and a hummus plate.  Tasty, essential Egyptian it seemed--well flavored and generous portions.", "pics": null}}, {"review": {"des": "We order delivery from this place every week! Food is really good and the delivery is fast! Also we dine in every month. The staff is super nice and accommodating. Restaurant is clean. We recommend this place to all our family and friends!", "pics": null}}, {"review": {"des": "Ordered takeout the shish kebab entree. Worst grilled beef I've ever had. It was so tough that I can't manage to chew it and had to spit it out. I wish it was just a couple of the beef chunks but it was all of them. Terribly overcooked, dry, and tough. Such a shame because the rice was delicious. Won't come back here again.", "pics": null}}, {"review": {"des": "This place is great. The people are really nice and the food never disappoints. Even the rice is outstanding. We usually go with the sampler which is plenty for three people get wild with a food explosion.", "pics": null}}, {"review": {"des": "I've been here three times in the last five days. The food is incredible, the staff so gracious and hospitable. <br><br>Randomly stopped in one evening and placed a chicken kebab order with Jerusalem salad. After I ordered and was waiting, Ahmed (I believe), brought me a bowl of lentil soup while I waited. It was a cold night, and the soup was so flavorful and delicious, not to mention a very thoughtful gesture. I went home and thoroughly enjoyed the chicken, rice, salad, and sauces that accompanied. When I returned the following evening, they remembered me and asked if I enjoyed everything. I've since tried the falafel and chicken shawarma...I think I've now finally tasted falafel as it is supposed to be prepared. Just an unbelievable outer coating and perfect filling inside.<br><br>5 big stars - delicious food and such a warm and friendly staff. It is evident they care for their customers and take great pride in their business.", "pics": null}}, {"review": {"des": "I found this place on Yelp and decided to go there after seeing a 5 star rating. <br><br>The place looks really nice and the staff is great, they're very helpful. We tried a bunch of appetizers and the combination plate. The chicken in that plate was amazing, definitely get that if you aren't getting the entire combination. The hummus and baba ghanoush were both great too and they'll give you a lentil soup on the house anytime you dine in. <br><br>Great experience all round.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4puKRUYWLioDJXKsC3Bq9Q/168s.jpg", "caption": "Combination plate"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PB53Ba9_YifLK1L3Yz-oaQ/168s.jpg", "caption": "Hummus"}]}}, {"review": {"des": "We went for my anniversary. We were the only ones there and got to choose the best table. The owner was cooking and we were near the grill and he offered us all a taste of the lentil soup. Get it. It's amazing. We had a few chicken kabob plates, tabbouleh and grape leaves and everything was amazing and they were all so nice!  Can't wait to go back.", "pics": null}}, {"review": {"des": "This is a fantastic find! I went there last night with a friend and we loved it. An Egyptian friend of mine from the Chicago area told me about this restaurant and I decided to go during last night's blizzard. <br><br>I ordered grape leaves (appetizer), baba ghanooj (eggplant dip) and Turkish coffee. The owner stopped by our table and gave us free lentil soup and hummus to try. I'm still dreaming about the lentil soup. <br><br>They were all so friendly and welcoming too. I'm definitely going back soon. It's on Fullerton just one door west of the Walgreens with decent street parking. <br><br>Love it!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iUUXEa8aSxtLpTHjR-kllA/348s.jpg", "caption": "I requested cucumber slices instead of the bread due to my wheat allergy and they were happy to accommodate"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RZ5xw-gkxYiUTSwz6IKJOA/168s.jpg", "caption": "Two nice employees!"}]}}, {"review": {"des": "Husband and I walked over this weekend thinking they had opened- they had apparently just had their soft opening and were not yet open for business, but they invited us in and fed us anyway! Talk about a nice surprise.<br><br>We tried hummus, baba ghanoush, koshary, and shawarma and everything was really delicious. I had never tried koshary but it was really homey and tasty- rice, lentils, pasta, topped with some sauce and crispy fried onions. I would definitely get it again. Husband loved his shawarma (and don't skip the garlic sauce on the side!). Normally I think hummus is sort of boring, but their hummus was really good! Super flavorful. Baba ghaboush is my favorite, and Cairo's did not disappoint. If you are someone who always sticks to hummus, do yourself a favor and try baba instead- it is so good.<br><br>Honestly in addition to good food, it was really nice to meet the family who is running the place- they were so warm and hospitable, we are really looking forward to going back... especially now that they're actually open and we won't be crashing their private party :)", "pics": null}}, {"review": {"des": "When I come home from work and just don't feel like cooking, this is on the Go To List for ordering out.  Instead of going to one of the fast food places near me, I opt for the healthier and tastier options that Cairo Kebab provides.<br><br>Normally, I'm not a huge fan of Lentil soup, so the fact that I practically inhale this soup every time speaks volumes of the quality and flavor!  I have had their Chicken Shawerma, Beef Shawerma, Shish Kebab, Falafel, and Hummus.  All are excellent!<br><br>The servings are large enough to have some to spare for the next day.  Perfect for this single gal.  It reheats nicely.  I may have to start packing some for my lunch for work.<br><br>I love their hummus so much that I had it for breakfast the other day with my leftover pita bread.  :)<br><br>Service is on point --- always friendly.  The people are so nice and really appreciate their customers.<br><br>I am definitely coming back to sample the rest of the menu.", "pics": null}}, {"review": {"des": "This place was AMAZING!! Came here on a whim after hearing about it from a co-worker and split the full veggie combo platter, lentil soup, and Cairo Kebab combo platter with my boyfriend. This was without a doubt, the best Middle Eastern food I've had in Chicago. The kebab meats were juicy, tender and well-seasoned, the falafel was perfectly crisp with a fluffy interior, and the hummus was smooth and creamy with just the right amount of lemony zing. Also the portions were huge and super reasonably priced. (We spent a little over $20 and left completely stuffed.) <br><br>However, the highlight of our experience was definitely the hospitality. This place is family-run and they welcome you with open arms when you walk in the door. They were so kind and accommodating, and even let us taste a few things when we couldn't decide what to order. <br><br>I will definitely be coming back again and again to satisfy my Middle Eastern cravings.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MKpFf7WaZLKdvuOcPT-1kA/348s.jpg", "caption": "Cairo kebab combo and veggie combo platter. AMAZING!!!!"}]}}, {"review": {"des": "Great food. Delivery is fast if you are close, the farther out-less reliable. But the food is good enough to chance it. The kebab and shwarma are to die for.", "pics": null}}, {"review": {"des": "Awesome food and service. Friendly atmosphere and good pricing. Will certainly be back.", "pics": null}}, {"review": {"des": "To preface this review, you should know that I have a weakness for a good shawarma sandwich - I'm the type to wait in line for an hour at the hyped up food stands.  Cairo Kebab's chicken shawarma and lentil soup is fantastic.  The meat is juicy and the other ingredients are nothing fancy, but oh so flavorful!  I've also tried the beef and lamb version, and I've realized that I only like lamb when it doesn't taste like it, but the aroma was quite strong so not my preference.  I'm definitely going to be back to check out other things on the menu, and hope that they keep up with the quality and service.  The ease of counter service and grabbing the food to go is great, but the dining area is very roomy for dining in.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fpkTDsFeqBY9vgPqQSxYXw/348s.jpg", "caption": "Shawarma roasting on the spit"}]}}, {"review": {"des": "Recently, I have been on a shawarma kick for awhile, but that is because shawarma is bae. I never had Egyptian food before but it looked similar to other shawarma joints.I was feeling a little adventurous and decided to try it out.<br><br>Upon entering a waitress named Cathy( I believe was her name) was super friendly and attentive. I ordered Turkish coffee because I hadn't had my daily coffee and I was getting a little cranky. The Turkish coffee came in the cutest little cup like an espresso cup. The coffee was strong how I like it, but also a lot richer and thicker. But the main thing we need to discuss is the food.<br><br>Complimentary lentil soup when you dine in which is a nice touch. Trust, this is probably the best lentil soup I have EVER had. Great consistency and just the perfect amount of everything. I love that they put bite size potato pieces in the soup, its a nice surprise. I could have ordered a large bowl of this as my meal and would have been 100% satisfied. Honestly, this is the reason why I bumped them up to 5 stars. It's a must try.<br><br>Chicken shawarma-fresh and flavorful..I could not eat fast enough and the rice it came with was plentiful and also had flavor. The spices they use are slightly different from your typical shawarma places, but that is what makes this place unique. The combination of whatever spices they use works makes the chicken really fragrant. <br><br>Beef shawarma-fresh and tender. Also had really good flavor and came with a bed of rice. Beef or chicken shawarma will not disappoint.<br><br>Their tahini, garlic sauce, and hot sauce are money. Order all three! Seriously, if you do not get all three you are doing yourself a disservice. At least try them and decide for yourself! Their tahini and garlic sauce are made out of unicorns. It's that good. I wish I got more to bring home for my leftovers but I did not think to ask. <br><br>If you want to try something new, get friendly service, great food, and not spend too much money then Cairo Kebob is your plug.", "pics": null}}, {"review": {"des": "Omg yes. The food is absolutely delicious and people that work there are super nice and accommodating. Do yourself a favor and get tabhouli and chicken, so authentic tasting and delightful!!", "pics": null}}, {"review": {"des": "If you are a lover of Mediterranean food, this is the place to come! The kabobs are cooked right behind the bar. The shawarma is on the spit and is delightfully tasty! The  baba ganoush is smoky and flavorful. All is fresh made! Make your way here for fabulous food and amazing service! Don't forget to finish your meal with some baklava and Turkish coffee.", "pics": null}}, {"review": {"des": "$15 for a small amount of meat. Disappointed. Not sure why you have to skimp on the portions. Completely unimpressed by the flavor of this food, as well. Struggling to understand the consensus positive ratings here.", "pics": null}}, {"review": {"des": "Being a guy from the Middle East, it's hard to find an authentic restaurant that serves dishes taste close to what we have back home. <br><br>This place is sooooo goood<br><br>If you want to taste a really good Egyptian food you have to go here. <br><br>Kushari is just perfect. I had it twice last week. <br><br>Cairo Kabab is new place, it is spacious and they play Arabic music. Most the staff I saw were Egyptians if you are looking for authenticity. <br><br>Overall:<br>Atmosphere: 9<br>Service: 9<br>Food: 10!!<br><br>This is a good place if you like to try different cuisines!!! One of my favorite spots.", "pics": null}}, {"review": {"des": "Great food. Stick to the chicken kabob . Excellent  baba ganoush. Very fair prices. Bare bones restaurant but food makes up for bland atmosphere .", "pics": null}}, {"review": {"des": "Absolutely delicious!!! So authentic! My mom/her family lived in Cairo so I had high expectations going in. Tasty lentil soup. Koshary was perfect! Almost just like grandmas! Falafel were great! Good consistency and not dry like some places turn out. I will definitely be back!!", "pics": null}}, {"review": {"des": "Had carry out dinner from here. Few tips:<br>-sandwich is actually a wrap. <br>-get the lentil soup. It's the best thing I had here. This is coming from a meat-a-terian. Who can't get enough meat. The vegetable soup is superior. Not as good as from Zachi on Belmont, but still very good.  And although the shish kebab sandwich/wrap wasn't by any means bad, it wasn't better than average. So if you're borderline fainting from hunger and happen to be within a few blocks and happen to crave Mediterranean food, I suggest you stop by here. For all other options, I advise you look elsewhere.", "pics": null}}, {"review": {"des": "I would down a bucket of their lentil soup", "pics": null}}, {"review": {"des": "Incredible restaurant. Owners (?) and staff are so kind, they really made the experience a special one. Had Koshary, Ful and Kofta and was blown away by the flavour. Went with kids and the place was very conducive. Incredible mamoula to finish the meal. Seriously, the Koshary alone is worth the trip - they should franchise! You wont be disappointed", "pics": null}}, {"review": {"des": "Great dining experience. Excellent service and superb Egyptian food with a Mediterranean touch. The traditional Koshari is a must!", "pics": null}}, {"review": {"des": "Of course, it was the reviews that tempted me to come here.  However, it's the food that keeps you coming back.  I placed my order through the app while I was in route.  And when I arrived early, it was still cooking.  The gentleman who greeted me (maybe the owner?) offered me a bowl of soup while I waited which was a very nice gesture, even though I declined since i saw pictures of the portions and knew that it would've been too much to eat.  I ordered the grape leaves and chicken kebabs that were well worth the wait!  The chicken was very tender, flavorful, and not overcooked. Even my friend who is \"anti-carb\" tried the rice and kept coming back for more -- it's is an abundant portion size too.<br>The spicy red sauce that came on the side definitely has a kick. I saw a previous review that stated to add it.  But, proceed with caution there.  Otherwise, full steam ahead!  I agree that the service was top notch.   I'm excited to return to try some of the sides next time too.", "pics": null}}, {"review": {"des": "I have going to Cairo Kebab for the past year. They have the best beef shawarma and kabab in the city. The owner and the staff are extremely nice and professional. My friend is vegetarian and he loves the koushari plate that is amazing.", "pics": null}}, {"review": {"des": "I was looking for Egyptian restaurant for and I found this spot. I tried the Koshei with beef shawrma. The combination was perfect. The service was great and generous with free lentil soup. I highly recommend this restaurant and I'll come back again.", "pics": null}}, {"review": {"des": "Do you want to visit Egypt without taking a 10 hour flight? Then let your taste buds do the traveling - Come check out Cairo Kebab! This place is a hidden gem.<br>The food is authentic and delicious. <br>We were given a yummy cup of lentil soup on the house, followed by a bowl of \"ful\" (beans in savory broth), hot fresh pita bread, crispy falafel and deliciously seasoned chicken kebob sandwiches. Everything was extremely good!<br>The service by the owner's two twin sons was phenomenal! They made my friend and feel welcomed and appreciated. Definitely will be back. Shukran Cairo Kebab!", "pics": null}}, {"review": {"des": "My husband and I have been looking for authentic koshary since a trip to Egypt 10 years ago. This brought back happy memories of the best meal we ate in Cairo and the portion sizes were enormous too.<br><br>I highly recommend the Turkish coffee. It was a strong, small cup of coffee spiced with cardamom. We also had the lentil soup and the ful dip, which I could consume by the bowlful. Everything was priced well considering each serving consists of at least two portions. <br><br>It appears to be a family run business, we were greeted warmly and there was soccer on tv. Great low key vibe and friendly service.", "pics": null}}, {"review": {"des": "Good food awesome friendly service. Got combo plate and chicken lamb shawarma. Both really good. Will be back and try a couple others!", "pics": null}}, {"review": {"des": "I eat a lot of Mediterranean food and off late have been traveling to Michigan which is home to some of the best middle Eastern food in the country and hence I have higher expectations. Unfortunately, my meal at Cairo Kebab was not 5 star worthy. I stopped by this week and got lunch to go. I ordered the Egyptian Salad and the meat combo plate. The server was very nice to offer some complimentary lentil soup while I waited. Soup was very tasty and a perfect treat on the cold snowy afternoon. Unfortunately, the salad and entree left much to be desired. The salad came with generous cubes of feta cheese, olives, cucumbers, tomatoes and lettuce. There were no chickpeas as listed on the menu. The salad dressing was bland and lacked flavor. The meat platter usually comes with rice and a side salad but the chef was kind to replace the rice with extra salad. Another nice gesture. The meat plater has chicken kebab, sheesh kebab and kofta kebab. The kofta kebab was nicely seasoned and tasted good but the remaining two lacked flavor. The chicken kebab probably,needed to be marinated longer to get more flavor and cooked a tad bit more on the grill. Also, they can substitute the breast white meat with thighs. <br><br>Although,  I loved the service and the restaurant is clean and inviting, I was a little disappointed with the food. I will visit again to try their shawarma.", "pics": null}}, {"review": {"des": "Went here with a big group and truly received the royal treatment. Service was unbelievable and so was the food. We ordered 3 huge combo platters, hummus, baba ghanoush and soup. Everything tasted fresh and succulent. My favorites were definitely the kifta kabob and lamb shish kabob - cooked to perfection and so juicy. <br><br>Another recommended dish is the koshary which is an authentic Egyptian rice dish made with lentils, fried onions and macaroni - very tasty. The best aspect about CKH has to be however the serving sizes and the price point - very generous and not too crazy on the wallet. There was also plenty of street parking for Lincoln Park. If you're ever in the area, definitely check this place out.", "pics": null}}, {"review": {"des": "This is a good place for some Egyptian food. Pretty much everything on the menu is good and you have to try the Koshary. Owner and staff are friendly, welcoming people so more of an incentive to visit their establishment for a good meal and hospitality.", "pics": null}}, {"review": {"des": "Lentil soup<br>Cairo combo<br>Hummus with beef shawarma <br><br>Middle eastern restaurant that serves zabiha halal food. <br>Near DePaul. The lentil soup was probably one of the best I've ever had in Chicago. The Cairo combo was a little pricey at $15 but considering the area it's fair. It was seasoned very well and juicy cuts of meat. My friend said the hummus with beef shawarma was very good. Great service. I will be back. Can't wait to try more of the menu!", "pics": null}}, {"review": {"des": "All I can say is KOSHARY! As an Egyptian who doesn't cook Egyptian food, this is like an oasis for me. The koshary plate tasted just as I hoped it would. The owner, Ahmed, and the entire staff make you feel at home. It's the true Egyptian hospitality here. Can't wait to come back.", "pics": null}}, {"review": {"des": "Won't go back..<br>Had a bland soup.<br>Ordered hummus, baba gannoush and ful.<br><br>Seriously all tasted the same and watery.<br>I saw no chunks of roasted eggplant In the baba gannoush and it was the same color as the hummus. Wtf.<br><br>I'll stick to other places...<br><br>I should've went to Taco Burrito house a few doors down for tacos. Ugh.<br>14.00 for not good ! Nope", "pics": null}}, {"review": {"des": "Such great food, loved the rice, the kabob. Very good portions, best middle eastern food I have had in Chicago. I was recommended by a friend, and I will be definitely returning soon to order another plate of the kabob plate!!", "pics": null}}, {"review": {"des": "My wife and I experienced an authentic feast.  The baba ghanouj had a wonderful smokey taste and the hummus with a hint of jalapeno pepper.  The falafel was moist inside and crispy outside, you could actually taste the falafel, unlike most other places.  Then on to the Cairo Kebab, WOW!  Every meat with its own unique spices.  All fresh and it is as if it was all homemade. The portions were very generous, but we finished every bit of it!  <br><br>And as good as the food, the service was wonderful.  A true family run business, with father, sons, brothers and uncles.  Truly old school and so warm and genuine!  We can't wait to come back!", "pics": null}}, {"review": {"des": "Great food and great people! Will come here again and again and again!!! Try their Koshary!", "pics": null}}, {"review": {"des": "We got sish kebab (juicy and tender), chicken kebab, and beef and lamb shawarma entrees.  The lentil soup was great with potatoes, celery and carrots. Both of my kids ate it so you it was good. The meat was seasoned to perfection and the rice was just as flavorful. The service was great. The owner gave our kids baklava on the house and of course it was devoured.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ydskyw-Dh1164KM3GoSfHQ/348s.jpg", "caption": "\"Its so good! I will give them all my money from my piggy bank.\" -Isaiah"}]}}, {"review": {"des": "I ate dinner at Cairo Kebab a little over a week ago. I can't even remember what I ordered for dinner, but since dining there, I haven't stopped thinking about the hummus that was served before the meal. Don't get me wrong, the dinner was delicious. But the hummus was the real star. It was so good, it warrants a review even a week after the visit. Perfect flavor, perfect texture, and perfect pita to dip. Just writing this review makes me want to hop in an Uber and go back there.", "pics": null}}, {"review": {"des": "Friendly service and good food! Lentil soup was very very good we also have a Cairo special and swarma sandwich. All good, we will be back for sure!", "pics": null}}, {"review": {"des": "This place is the spot if you are looking for some good, authentic Mediterranean in LP. Prices are great and the food is outstanding. I got free Lentil soup with my meal and that alone was good enough to rave about. The bathroom also has a hose attached to the toilet if you're into getting a full middle eastern experience. Chicken or beef you cannot go wrong here.", "pics": null}}, {"review": {"des": "I need to start with how exceptional the customer service was. It was my first time here, I had just walked in after a large catering order had been placed and a family for 5 or 6 people just put in their order.<br><br>After about 5 minutes, the gentleman behind the counter came over and informed me it would take a bit longer for my food. Although the heads up was enough, he graciously offered me a bowl of lentil soup as I waited! Very nice. After what wasn't as long of a wait as expected, he tossed in complimentary baklava as well. Food was delicious, hospitality was just as good. Will definitely be back!", "pics": null}}, {"review": {"des": "My girlfriend and I walked in during the family and friends party and WOW! We were treated so well and had the chance to sample a number of different foods. <br><br>The hummus with meat was incredible and the baba ganoush was a close second. <br><br>We will definitely be back to have a meal when they officially open at the end of the week. <br><br>Thank you for the hospitality!!!!", "pics": null}}, {"review": {"des": "First off, I just want to say the staff is amazing. The greeting was warm and they are very friendly. 10/10 will go again just because of that.<br><br>I love me some kebabs and shawarma. I decided to go with the beef and lamb entree which was really good. The portions are great and the hummus was fantastic. <br><br>I will be back, thank you!", "pics": null}}, {"review": {"des": "Just got done eating here. My tummy is doing backflips of joy. They take pride in their recommendations and preparation of quality food. Apparently everything they make is prepared fresh daily. <br><br>BYOB as long as you're not an a-hole about it; I think they reserve the right to deny you at their discretion (LOOKIN AT YOU DEPAUL)<br><br>Lentil soup - free and awesome if you're dining in<br>Schwarma - delish (both chicken and beef/lamb - the latter is 70%beef and 30% lamb/lamb fat)<br>Hummus - honestly the best I've ever had. This is voodoo magic.<br>Falafel- they make this to order. Incredible. Crispy AF breading and fresh chickpea filling.<br><br>In short, you have some new fans. Our goal is to come here as often as possible before everyone figures out how awesome they are.", "pics": null}}, {"review": {"des": "My husband and I have been eyeing this place for days, waiting for it to open. A couple days ago, we saw it was finally open today so we went to dinner to try it out. We both ordered the Cairo Kebab combos -- he got kofta and I got chicken, and they came with hummus and pita, Jerusalem (cucumber/tomato/mint) salad, and yellow rice. We also got baklava.<br><br>You go in and order at the counter, then sit down and wait for them to bring it to you. We also did not have to clean up our table.<br><br>To put it bluntly, we are DEFINITELY coming back. Both kebabs were super flavorful and tender. The chicken was as if they knew the exact moment when to pull it off the grill, because the kebab pieces were JUST done perfectly and so tender and moist. Sorry if you hate that word.<br><br>The hummus was very very good, and there was a smidge of spicy green sauce in the middle of the olive oil swirl. Not sure what it was but it made the hummus even better.<br><br>The yellow rice is often an afterthought for many Mediterranean places, but Cairo Kebab's was very flavorful. It tasted like they cooked it in broth and finished it with a little butter.<br><br>The baklava was only $2 and a very nice sized 2.5\" square. The best part was the three large nuts (cashews?) in the middle of the phyllo. They certainly did not skimp on quality.<br><br>The portions were very hearty and for me, on point. I would even say that they could give me half the portion salad and I'd still be happy.<br><br>The family that runs the place is nice too! They even explained what the different components of the meal were, even though we are veterans of Mediterranean food. But if you don't, they are super willing to help. And they truly cared whether or not we liked the food. <br><br>My only minor criticisms: <br>1. The pita was only ok. I have definitely had better pita, but this one was mediocre. Maybe even storebought? Not bad, but nothing I'll be craving later. It was warm, though, which was nice.<br>2. The lights in the dining area are very cool and bright, making it a very cold, stark ambiance. I would change them out with something a little warmer and cozier.<br>3. Maybe a little less salad with my combo. Or the option to get lentil soup!<br><br>Next time, I want to try the Koshary and the Ful dip. <br><br>If they keep the quality, portions, and deliciousness up, I will definitely continue to come back.<br><br>I like their logo, too.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/p-SJ55KrIOTXrjBvedg_jQ/348s.jpg", "caption": "Cairo Kebab's menu"}]}}, {"review": {"des": "The food is flavorful and fresh. We ordered chicken kebab plate, falafel sandwich and tabouleh. Food came out within 15 minutes and was cooked fresh. The portions will not disappoint you. To top it off, the service was excellent!", "pics": null}}, {"review": {"des": "First time here and had a splendid meal. It was my bf's first time eating hummus and he wasn't disappointed. It wasn't seasoned to a point where it was too much but it was just right. It came with some warm, soft pita bread. The inside was clean and I appreciated the open kitchen. The owner was such a delight to meet. He constantly made sure our meal was adequate and gave us free sample of the lentil soup, which was lovely. Our entrees were plentiful and very good. The sauce that came with the chicken shawarma was so tasty. Will definitely be coming back and might even make it our go-to place whenever we are craving some Mediterranean food.", "pics": null}}, {"review": {"des": "Service was great and the food was delicious. The Koshary was my favorite, but it could have a little less of the fried onions.", "pics": null}}, {"review": {"des": "Came in 25 min before they close and they were so kind. Great service and food even at the very end of their day. Plenty of vegetarian options as well as meat. Check it out next time you're in Lincoln park.", "pics": null}}]}