{"name": "cantina-laredo-chicago", "reviews": [{"review": {"des": "Once you're inside, you feel like you are transported to a place far away from Chicago. Somehow it's like being outside yet you're inside--hard to explain. Foodies aren't going to review this place positively because it's a modern (Americanized) Mexican restaurant. Truthfully, the portions are great and the prices are reasonable. Popular with its intended crowd and regularly packed with tourists. A restaurant like this doesn't need to be \"impressive,\" it just needs to get the job done. Clearly, it does.<br><br>Originally, I thought of Cantina Laredo as more of a three-star spot, but for the manager to come on Yelp and say \"this isn't authentic Mexican\" is a hilarious, rare reality check for the most clueless food critics out there. Keep doing what you're doing.", "pics": null}}, {"review": {"des": "I've been visiting this place for the past 2 years, and it has consistently been one of the best, most reasonably priced Mexican place in River North, possibly only rivalled by Mercadito (which is definitely on the pricier side).<br><br>Happy hour deals with $5 Margaritas, $5 Queso & Guac and $7 for 3 tacos are such a steal for the ambiance, quality and service. Also, don't forget the free chips and salsa that they generously refill. You won't need dinner after.<br><br>For dinner, they have a ton of vegetarian options. The mixed veggie fajitas are incredible when I'm feeling extra hungry and all their enchiladas are my favourite. PRO TIP: Ask them to swap out the chicken for mushroom and spinach in the Mole enchiladas. The spicy pepper sauce with the cheese, mushroom and spinach filling go so perfectly. By far, my favourite dish here.<br><br>I'd highly recommend this place for a good, wholesome Mexican meal at River North. Love it.", "pics": null}}, {"review": {"des": "Came here yesterday around 4pm which some coworkers. The upstairs area was closed but there were plenty of seats and tables at the ground level bar. We grabbed a table and the server came over soon after. She was the only server at the time but she did a great job of making her rounds to everyone there. Someone else brought over the chips and salsa. I have noticed over the last serval time I've been here that they no longer give you two  salsa. They use to give you one warm and one cold but now you only get the cold one. It's not a huge feel but worth mentioning. <br><br>We got the margaritas, chicken quesadillas and the queso Blanca. The margaritas are the same as always not too sweet and just the right about of alcohol. The chicken quesadilla were filled with meat and cheese. You get four triangles. The queso blanca was a huge hit. It's like a combination of queso and spinach and artichoke dip. Its not spicy either. It's not a huge portion but it's enough for 2-3 people. <br><br>Overall consistently good food, drinks and service!", "pics": null}}, {"review": {"des": "I went with a group of 4 people. The food was just okay (we all felt it was all bland and small portions given the price) and the service was really off. It took forever to get our orders placed and get our check. The restaurant wasn't awful but I wouldn't recommend it to a friend. The place was packed so my opinion may be the minority.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HikJEEY3tITlZQxPPUs6pQ/348s.jpg", "caption": "Chicken Fajita Burrito"}]}}, {"review": {"des": "It's Friday night. I ordered a drink, the hornitas plata, and could not take more than a sip or two. I Don't recommend it. The waiter didn't really know much about the drink to begin with and was apologetic that he wasn't helpful in choosing.  I didn't wait that long for a table. The chips and salsa are decent. The salsa is smoky. The meal itself was average. The mole was good and I asked for the enchiladas with cheese and not chicken which they were able to accommodate. The enchiladas with the mole were good and I finished that part of my meal. I didn't take more than a bite from the rice. It tasted funky to be honest. The black beans were average. So with the bad rice and good mole, it averages out to average. <br><br>The restaurant itself is beautifully designed and has a couple of rooms for bigger parties. I might try them out again in happy hour but that's it. <br><br>I would say give them a try but my first visit here wasn't more than three stars.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GRyLcibCqu5YdJFkazEM5w/168s.jpg", "caption": "Nice large restaurant with outdoor feel with windows open"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/J2rCa9UkucwRX_m2sKS3mw/168s.jpg", "caption": "Enchiladas de mole con queso. The mole was decent. The rice was horrible. Beans were average."}]}}, {"review": {"des": "Went here for a work happy hour and I definitely left happy. We had a family style table for about 16! We ordered plenty of apps but my favorite was the house made guacamole that they make in front of you! It tasted so fresh and I ate a whole bowl myself ... shamelessly! Can we talk about the chili con queso??? Idk do you have an hour or two? I wish I could literally bathe in this stuff. I also had an entire plate of this queso.<br><br>I also loved the ahi tuna tacos. They tasted so fresh and the chipotle aioli sauce on top was amazing. The pineapple infused fits was amazing and I really don't like tequila... but the lemon juice and ginger made the tequila almost taste like it wasn't even there!", "pics": null}}, {"review": {"des": "I came for dinner on a Saturday night with a group of about 10 people. The ambiance of this place is beautiful and classy with a hint of coziness created from the fireplaces at the entrance.<br><br>They serve chips and salsa to start off - I thought both of these were good. We ordered \"top shelf guacamole\" ($10.50) which they make at the table. Seems pretty cool except this is probably the worst guacamole I've ever had at a restaurant. We asked to have it made spicy but the guac instead lacked flavor altogether. When we informed our waiter of this he gave us a bowl of jalapeños...<br><br>In addition to the guac we got the chili con queso ($8.50) which was as described and delicious. For the main dish I got the Veracruz enchiladas ($14.50) which was the best part of the meal. It was slightly spicy and all the flavors blended well together. The rice and beans that come with it are just average. Slightly overpriced for just 2 enchiladas though in my opinion. <br><br>In addition to the food, we ordered strawberry and mango margarita pitchers - as delicious as these were, they lacked alcohol content and were too sweet. I couldn't drink more than a glass.<br><br>One thing that I did like about this place is that they gave separate checks. It would've been fine if they didn't since we all ordered similar items and it would've evened out just fine but it's noteworthy because most places avoid the hassle and will not do that for large parties.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LRYgI_9Moo9kLotW7-0ICw/348s.jpg", "caption": "Veracruz enchilada"}]}}, {"review": {"des": "The table side guacamole is the best guacamole around, and you get alot for the money... the happy hour deals are a great value with plenty of options. Good service, nice staff, an all around positive experience. <br><br>**+Updated review***<br><br>So they stopped making their own chips and replaced them with some cold, thick and heavy chips obviously purchased from a low end outside source . <br><br>No sense coming back for their guacamole. Will find another place to get good chips and<br>Guacamole or salsa.", "pics": null}}, {"review": {"des": "It is a nice lively busy space if this is what you want<br><br>Prices are reasonable- until you add up your alcohol bill<br><br>The food is okay- but don't expect anything great<br><br>To me the standouts were<br><br>ahi tacos- these were very tasty with sashimi grade ahi<br><br>table side guacamole- nothing special but good<br><br>steak fajitas- tender and good- but nothing special<br><br>Chicken enchiladas with mole- pretty good but again not great<br><br>We had some more dishes but nothing too memorable other than our server was very pleasant", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fF53424vSwFsmvjwsXReRA/168s.jpg", "caption": "Steak fajitas were good"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6BKyuss4MU6h9EopKWLnIQ/168s.jpg", "caption": "Tacos. Good"}]}}, {"review": {"des": "Mix an upscale restaurant vibe with exceptionally reasonable prices, and you have Cantina Laredo. Two gluten-free avocado, artichoke, and tomatillo enchiladas with rice and black beans, costs only 3 dollars more than a Chipotle burrito with guac. I was able to find a $4/hour parking spot and ticket dispenser right in front of the entrance, so be sure to check that area before scoping out a garage. The blood orange sangria was slightly effervescent, with perfect amount of sweetness. I'll be back to try the white honey version!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/X87VT753APInqqBFcs-daA/168s.jpg", "caption": "Blood Orange Sangria/ Solerno Blood Orange Liqueur, Burgundy, Orange Juice and Ginger Beer"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/c8D6iqU5qKdtIYNfoDB6qA/168s.jpg", "caption": "Gluten-Free Avocado, Artichoke, and Tomatillo Enchiladas, Seasoned Red Cabbage, Rice & Black Beans Topped w/ Cheese."}]}}, {"review": {"des": "What really drew me here was the decor- its giant fireplaces create a very homey yet elegant feel. The food was decent- my fiancé and I both got the carnitas with black beans and corn. The carnitas was ok, but the corn was phenomenal. For dessert, we got the mango tres leches- SO DELICIOUS. The cake was perfectly sweet (not overwhelmingly so) and very moist. I would definitely recommend trying it. <br><br>The cocktails were really good! We tried the blood orange sangria, mango mojito and a salted watermelon margarita. All three were very tasty and had the perfect amount of alcohol.", "pics": null}}, {"review": {"des": "I finally made it here! I'd been eyeing the staircase from the street for months. We popped in for a midweek date night and loved it! First, seated right away, yes! We checked out the drink menu and both found tasty options. I had the Blood Orange Sangria which was delightful. Blood orange is my favorite orange. <br><br>We had to try the signature table side guacamole and my oh my it did not disappoint! The chips are clearly made in house as well as the combo was perfection. <br><br>I ordered the arroz con pollo as my entree. It was good, but I had something more like gumbo in mind. This was good, but picture a broth with chunky soft veggies and some shredded chicken. Made well, I was just looking for something a bit heartier. Not a deal breaker!<br><br>I was able to snag a photo of the happy hour menu and am excited to try more when I have a bigger appetite. I'll try not to fill up on guac. :)", "pics": null}}, {"review": {"des": "If you are a person with NO worldly experience this might be a decent taco, guacamole or salsa. Let's start with the \"salsa\", this burned almost black sauce it's NOT a salsa, call it a chard sauce. This tortilla taco is thick almost flat bred, flavors mehhh nothing I would crave again everrrrr... chicken is not fresh, I think is totally frozen... is it supposed to be mushy ? <br>BEWARE: if you are craving great authentic tacos and have eaten great Mexican tacos from Pilsen or better places. This place won't cut it! Maybe just try the steak", "pics": null}}, {"review": {"des": "I'm from Arizona, so a Mexican food chain in Chicago isn't exactly my first choice. Luckily for Cantina Laredo, it has great management, with a cool atmosphere, in prime Chicago Loop real estate. <br><br>CANTINA LAREDO (THEN)<br><br>As always, I love to do my research and find out some information on the location I'm visiting, so I can use my reviews for reference. And this is what I found from various sources.<br><br>Cantina Laredo opened in 1984, with the concept of presenting sophisticated gourmet tastes of Mexico City.<br><br>Over the last 20 years they have devoted great effort to product development and process improvements to ensure that they always deliver the highest level of great Mexican food to their guests.<br><br>Combining the traditional with modern flairs, the menu is unique and includes grilled fish, chicken and steaks complimented by signature sauces such as chipotle-wine with portobello mushrooms or sautéed artichoke hearts and roasted red bell peppers.<br><br>CANTINA LAREDO (NOW)<br><br>Today, high-end Cantina Laredo is a fast growing franchise concept, having opened corporate and franchise units throughout the country, with locations in 14 states, Abu Dhabi and London, England.<br><br>There is a huge growth of sophisticated, authentic Mexican and Latin cuisine restaurants. <br><br>Cantina Laredo is well positioned to profit from mass media trends and an increase of popularity of the Mexican and Latin cuisine demand. <br><br>Their motto is to have \"consistently excellent food and service that meets the market's demand for high quality, world-class cuisine.\"<br><br>THE STORY & SERVICE EXPERIENCE<br><br>I heard Cantina Laredo had some great new management and was a new place to go, so I was happy to give it a try. I always love hitting new downtown spots, and it never hurts to know a guy to be able to get right in.<br><br>I first came on a Friday night, and it was pretty busy, so we sat at the bar for some snacks before going on the town.<br><br>We tried a few of their appetizers, including the fresh nachos, which were pretty good, but didn't have a wow factor. I had a Modelo, which is always good.<br><br>My friends thought the place was decent and a pretty great location to meet up, so we stopped by the next morning for mimosas on our way to hit some rooftop fun.<br><br>Cantina Laredo has a hip vibe and the staff is fantastic.<br><br>CONCLUSION<br><br>I love the location, the look, the management, and the service. The food is good, not outstanding.<br><br>4/5 RECOMMEND<br><br>OF NOTE<br><br>*Parking is difficult. Drop off is best.<br><br>*Available for events.<br><br>*Franchise information fee is $50,000 per restaurant. (See website for more information)<br><br>*For more information: <a href=\"/redir?url=http%3A%2F%2Fcantinalaredo.com&s=db599388a5a55993b7da161ab45e5f542fbdd868c507465a9488a3b2078c797f\" target=\"_blank\" rel=\"nofollow\">cantinalaredo.com</a>", "pics": null}}, {"review": {"des": "I stopped in here to meet a friend from out of town and have a drink so I cannot comment on the food.<br><br>I ordered a strawberry margarita (no ice) and it was served in a martini glass....WHAT? Not only did the barware NOT go with the \"conceptional idea about a margarita\"-but, I could barely have more than two sips of the margarita because it was not \"authentic\" but what appeared to be a sweetened mix comparable to Kool-Aid!<br><br>The ambiance was also strange-while the fireplaces (real) were a nice touch-it just did not seem to match the menu. The only description that I can give is it felt like \"a ski lodge\" after a day at the slopes.<br><br>Sorry-but I will not be back.", "pics": null}}, {"review": {"des": "Their happy hour menu is the bomb and was the perfect choice for my sister and I to go for a catch up dinner. As you may or may not know their guac is to LIVE for and the margaritas got us right and made for an exciting train ride home, lol. I have added them to my happy hour go to because after experiencing it, it's a must I come back.", "pics": null}}, {"review": {"des": "I booked my reservations about a month and a half in advance with Marissa, as I had a large party of 14. She was more than accommodating, and answered my numerous emails promptly. When we arrived we were seated almost immediately, and placed in a back room by ourselves which we appreciated. Chips and salsa were brought right out, and our server kept them coming. I ordered the pollo avocado tacos, with beans and rice. The tacos were amazing, and just tasted very fresh with the mango pico de gallo. Everyone else loved their food as well, and raved about the mole enchilada. At the end, our server brought me out a cake for graduation, as he had overheard that is what we were celebrating. I appreciated that they went above and beyond to make this a great experience!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UouQwm8WQCg5X7MkGUBDjw/348s.jpg", "caption": "pollo avocado tacos"}]}}, {"review": {"des": "Solid Mexican food at a reasonable price in a nice part of town.  The tableside guac is great and plentiful and the drinks are fantastic.  The entrees are just okay and a bit disappointing considering how good the apps and liquids are.  Prices are cheap for the area.", "pics": null}}, {"review": {"des": "Its a chain, enough said.  Although for a chain their consistency is lacking, even just at this one, let alone when you visit others.  Myself and 3 others in my group ordered street corn.  Myself and 3 others in my group got 3 different versions of street corn.  <br><br>The service was incredibly lacking, slow and hard to find a server when you needed one.  They lost a lot of money on drinks with our group because of how slow they were.  We would have at least doubled the amount of drinks we had if they would have been present.<br><br>Guacamole was really the best thing that I had.", "pics": null}}, {"review": {"des": "A gorgeous space to have very good Mexican food with the obvious downtown \"flair\" that comes with just about every restaurant in this neighborhood. Amazing enchiladas, solid drinks, plenty of vegetarian options and a delicious guacamole that is prepared tableside. <br><br>But for as good as the food is, the service is just as lacking. Even on not-so-busy afternoons, I have had servers whose attention I couldn't get. It once took a solid 20 minutes after receiving drinks for our server to come back for our food order. This was not a fluke, either. Disinterest and the appearance of being busy when the restaurant is clearly not busy appear to be the vibe the staff has settled into.<br><br>Online ordering for takeout is even more odd. Depending on the platform you use to make your order, you'll be told to pick your order up inside the kitchen. Not from the bar, not from a counter adjacent to the kitchen. I had to go inside the actual kitchen where my bag was waiting for me on a table next to one of the prep stations. While it was interesting to see how an actual restaurant kitchen operated in person, I definitely felt like something was off about the experience--like I really shouldn't have been there, even though the staff seems to sends many others who place online orders there.<br><br>I'll still recommend it to friends because the food is that good, the space is that pleasant and it's difficult to find worthwhile Mexican food downtown (even if it's not of the \"traditional authentic\" variety)--but you need to have a lot of patience for apathetic service and/or inconvenient takeout procedures. If not, then not even the enchiladas will make up for it.", "pics": null}}, {"review": {"des": "The homemade guac is delicious. The cocktails are on point. Do yourself a favor and order the mango tres leches. My boyfriend picked up the plate and licked it clean with zero shame in his eyes. Tip: sit at the bar area during a happy hour (people will squeeze you in if you ask kindly) for excellent specials. I've also sat in the main dining area by the fireplace, and liked that most.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RYBz2ibZhqfRBoCeMERaXQ/348s.jpg", "caption": "Mango Tres Leches will not disappoint."}]}}, {"review": {"des": "Ate their yesterday. The food was really good but boy, was the service bad!!!! We had no plates given to us so our main when it arrived sat there for 15 mins while we asked three different employees to bring us plates to share it. Ended up having to send the main back because it got cold. Large cavernous place. The only fun area to sit would be by the fire and bar. Otherwise it looked too bleak for a date. Shame though, coz as I said, the food, when we were able to eat it was great. It's no way 'new Mexican' more Tex Mex.", "pics": null}}, {"review": {"des": "WOW. Just WOW.<br><br>How do you ruin rice and why in Gods name is it green and tasteless?<br><br>The  Portions for their chicken fajita are huge but it's all onion and green pepper. I may be had for pieces of steak. They honestly don't understand how overpriced it is. It's a beautiful interior but I guess it's exactly what you are paying for here. The location, ambiance and definitely not the food.", "pics": null}}, {"review": {"des": "This is one of the best Mexican Places in downtown.Made a reservation for Friday dinner around 8PM but showed up 30 min ahead.Luckily they had a table and we were immediately seated.<br><br>Huge Place with bar in centre and also tables on the first floor. Ambiance is pretty good with minimal decor and dim lighting gives an awesome look to this place.<br><br>Complimentary Nachos comes with 2 types of salsa,one on sweeter note and other little spicy(this reminded of Indian Chutney used in Breakfast). Ordered White Sangria which was pretty good with subtle lime and Orange.Friend ordered a Margarita and it was decent.We got Queso and Guac which were so good. The Nachos were so good and fresh.<br><br>Pork Pulled Tacos (3)that comes with Mexican rice and Black Beans is what I ordered ,Tacos were good but the rice was not. Ordered additional Cilantro Lime rice which was pretty good. Got one Tamale with pork over it. Not a great fan of Tamale so cant really comment as I just had a tiny bite.<br><br>Decent place to check out. Make reservations ahead and enjoy the tacos.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3Kff564I2Jb6TpRobSb75g/348s.jpg", "caption": "Tamale"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/roNAk9VkTtnmY3ErRAjyHg/168s.jpg", "caption": "Pork Pulled Tacos"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JrMUMSKZMruy8-etatUuAA/168s.jpg", "caption": "White Sangria"}]}}, {"review": {"des": "Even though, I've been there many times, this is my experience when my wife and I went in for a date.<br><br>We were greeting by the manager and the host staff and we felt welcomed and special from the get-go.<br><br>The ambiance is perfect, the balance of lighting and decor was to our liking.<br><br>The chips and both salsas were really tasty. I was concerned that it would provoked an argument between my wife and I, on which one is was the best one; each of us had our pick, and at the end we agreed to disagree.<br><br>The top shelf guacamole was AMAZING! Fresh ingredients and the lady was so sweet. It's a must!<br><br>The drinks arrived and we ordered some mezcal margaritas. We noticed the balance of the smokiness of the mezcal and the tartness of fresh lime juice and the sweetness of the triple sec was another point in favor of Cantina Laredo.<br><br>Our Server Jesus was very attentive and knowledgeable, he was on top of our drink and chip refills. He recommended the fish for my wife and I had the Cascabel Bone-in Ribeye with bacon shrimp. YUMMY!!!!. The cilantro rice was so good with the fish and the potatoes complemented the spicy cascabel sauce from the steak.<br><br>Even though, I have had the Mango cake, and it was so good. We had a coupon for a Brownie, which comes in a hot skillet topped with a ball of vanilla ice cream and a butter sauce that sizzled as soon as Jesus poured it all over the brownie and ice cream. <br><br>If you are in downtown Chicago and want to eat at another take of Mexican cuisine, Cantina Laredo is an experience to have; decor plus top-of-the-line service and great tasty food are a winning combo. Keep it up.<br><br>We will be back and we are taking my in-laws with us. I gotta score some extra points with them too :-D", "pics": null}}, {"review": {"des": "I was craving a little bit of Mexican food and decided to give Cantina a shot. <br>In general Restaurant is very spacious and clean.  I came in on a busy night without reservations and I was seated fairly quickly. They start you off with Free chips and salsa, salsa was delicious by the way. <br>For entrees Of course I had to go with the Carne asada plate (Steak), Shrimp tacos and Burrito Chimichanga. <br>Steak was cooked just right, shrimp tacos and chimichanga were flavorful and absolutely delicious. For dessert I went with the Flan dessert (Love- Loved it). <br>Very surprised with food quality here, everything exceeded my expectations, Definitely will be back next time am in town.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XlrGSQD0MhADi7HJbRUhVA/348s.jpg", "caption": "Shrimp Tacos"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Lv0zMR_Gy_zwTZWcLyaH2Q/168s.jpg", "caption": "Carne asada Platter"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/k3Zb91Qf8XSVzR8mJLxmbA/168s.jpg", "caption": "Flan"}]}}, {"review": {"des": "Terrible management and horrible people working there! We had a dinner with my husband, then cached uber and 5-7 min later I realized that left my phone in restaurant <br>Called Cantina Laredo asked to check my table and I was told they did not find anything.Seriously??? I came back and was waiting for manager 15 minutes and I told her that some one turned off my phone and it is for sure happened here<br>She gave me her card and said it was probably stolen by guest<br>2 hours later I got email notification saying your phone is on, so I checked location and it is right in Cantina! So she said guest, really?", "pics": null}}, {"review": {"des": "Good dinner here for a group outing. It's a nice place if you're going to take a client but I wouldn't recommend this for much else. It's upscale Mexican and you come for what you paid for at a 2x markup. <br><br>Pros: I loved my fajita. The steak was perfect. Chips were good (the thin and crispy kind!) with great table-side guac done 3 ways. Can I have someone make me bedside guac in the morning? <br><br>Lovely ambiance - clean - professional - nice fire - spacious<br><br>Cons: Service was glacially slow. Like to the point we were wondering whether we should dine and dash (JUST KIDDING - don't take this seriously) but honestly, for a big group, they should be more attentive because we had been waiting for quite some time for the bill.<br><br>Don't get the churros! I repeat: DO NOT ORDER CHURROS (unless it's free as it was for me!) Might I suggest Xoco instead?", "pics": null}}, {"review": {"des": "The food is delicious and is great for a casual date. My favorite dish was the camarones escondidos, which is not on the menu anymore but was replaced when another similar item, which is nice that they do because there's always something new to try.", "pics": null}}, {"review": {"des": "Good Mexican spot with beautiful ambience. There's a full menu of moderately priced Mexican food with a twist. It's more upscale than your typical mom and pop Mexican restaurant, but also very reasonably priced. The service was a little slow for us being one of maybe 5 parties in the whole place. They have a fun drink menu as well. I got one of the lunch specials and was happy with the dish. A nice spot for a weekday lunch or after-work catchup with a friend.", "pics": null}}, {"review": {"des": "Came here for dinner with my husband and one of our close friends. It had been on my list of places to try for quite some time now but am so happy we were finally able to make it in! The food was delicious. We started with the queso and guacamole combinacion. It was delicious. The queso was the perfect mix of flavorful and not too spicy. I could tell that the guac was freshly made! For my entree I ordered the barbacoa enchiladas. I was a little hesitant on ordering this, just because I always order tacos, but decided to be a big girl and try something new and I am so glad I did! The barbacoa meat was so flavorful and the salsa on the enchiladas was delicious. I chose to wash it all down with a watermelon margarita with a sugar rim instead of a salted rim which was delicious! Can't wait to come back again!", "pics": null}}, {"review": {"des": "Went on a Wednesday for the lunch special. Very confusing trying to pick up an order as they have no place for pickups. I was lead to the kitchen which I then had to stand around looking for help cuz there still was no place for pickup and I didn't think I should have to walk all the way into the kitchen for my order bc I wasn't an employee. (Basically I did) There was no order # or name on the bag for me to know it was mine. And they had to remake my quesadilla bc I noted no chicken and ofcourse it was made with chicken. Then get to open my bag and it's one tostada and a half of a baby sized quesadilla. Not filling at all!! But they made sure to throw in a boat load of chips. It tasted fine but I was already upset I paid 9$ for what they provided. I didn't want chips I wanted a meal. Not surprised for downtown Chicago..", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EBf9CwhpLenzWbTDUALV7A/348s.jpg", "caption": "This is what you get for the Wednesday lunch special. A Tostada and a measly half a baby quesadilla.  I want my 9$ back."}]}}, {"review": {"des": "First off this place is huge, in a good way! It's pristine and refreshing. The table side guacamole was delicious and fresh. The service was prompt and kind. The menu ranges pretty well from cheap (tamales are $8 and will fill you up) to expensive. I landed on the Fajitas Tres and was not disappointed. All around great experience.", "pics": null}}, {"review": {"des": "Delicious!  When I think of a high-end Mexican restaurant, this is the place I compare to.  The flavors of everything I tried were so carefully put together and blended perfectly.  They were daring with a few combinations, but they made them work.  The salsas they bring to your table were really delicious and unique, like nothing I've tasted before.  <br><br>I thought the pricing was also really reasonable for the atmosphere and the quality of food you receive.  My only issue with coming back is that parking is a nightmare.  Take an uber if you can.", "pics": null}}, {"review": {"des": "I might as well talk about the negatives first. My group of 6 didn't get water until at least 10 minutes into sitting at our table. The other negative was that my parents spent $15 for Valet and we literally waited for 25 minutes to get the car at the end of the meal. <br><br>Other than those two minor slip-ups, I had probably one of the best Mexican meals of this year. Their guac is as good as it sounds on the menu. It is made table-side. My parents ordered the mild and my sister and I ordered the spicy. To be honest, both of them lacked spice. The mild one needed a little more salt and the spicy one needed at least another jalapeno but it was still so delicious that we all devoured both of the servings. <br><br>However, when it came to the main dish, I was blown away, as was my whole family. The majority of us got steak tacos and it was by far the BEST steak tacos I have yet to have. The steak was marinated to perfection. I was so full but it was so tasty that I couldn't stop eating like the fat fuck that I am. <br><br>The service was incredible even though it was New Years Eve. I am basically obsessed with this restaurant and I can't wait to come back again.", "pics": null}}, {"review": {"des": "A friend who comes here often invited me back for a 4th of July lunch; he had received a flash promotion for $9.99 combination fajitas on the 4th only.<br><br>We ventured up to Cantina Laredo which has a very different feel to it in the daytime with only a few other people in the restaurant.<br><br>We all started with Cabo Flip drinks which are margaritas with a shot of tequila inside half of a cut lime \"boat\". Really cool drink that was tasty as well. They are pricey at $12, but I suppose if you count the little shot in the lime boat, it's maybe 1.5 drinks.<br><br>We started with spicy tableside guacamole, which was tasty. The chips and salsa are very good too, I preferred the smokey one to the warm one, but neither were bad.<br><br>All 5 of us got fajitas so there wasn't much variety at our table. Everyone really liked their food, but I didn't personally think it had that 5 star wow factor. Do not get me wrong at all though, still a solid 4 star meal. Quality meats cooked with flavorful onions and peppers, the fajitas were tasty and we were all super full after those, plus a dangerous amount of chips before the food came. The amount of food we got for $9.99 was an extremely good deal for River North.<br><br>I forget our servers name but he was very good, handled our group of 5 well and even was nice enough to split the checks at the end.<br><br>Will be back for more quality Mexican food.", "pics": null}}, {"review": {"des": "I wish I could give them 2.5 starts; this is an upscale, huge, well decorated Mexican place, not to pricey so looks like a win win; but no. <br><br>We had a reservation for 12 ppl, and got there like 10min early (we were two), they sat us but didn't offer water, I wanted to order a cocktail but nobody checked on us, had to go and ask the host, \"you know where's our server?\"<br><br>Finally our server came, we ordered the drinks and then our party arrived. Almost everyone ordered drinks. Two friends of mine ordered the same drink, one virgin and one regular... both came without alcohol, we told that to the server, she took the drink and came back in like 2min, with the same drink. We guessed the bartender just poured alcohol into the drink and that's all, I mean really? It was a elaborated cocktail the right thing to do was to make a new one, or at least really try to fix that one, not have the server mix the drink with the straw on her way to the table. <br><br>I had Empanadas and Ceviche (tapas section)... the empanadas were ok, the ceviche was below average, I don't think the fish was fresh enough. Also had a bit of the chicken tacos, it was good. Anyway the food was nothing special (according to all my friends) so I won't say it's bad (except for the ceviche).<br><br>But the service was awful, the server never came to check on us, my glass of water was empty for a while, until the end of the night when we asked for the check and more water. I don't see myself going back or recommending this place. Just a \"pretty decoration\" is not enough.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WVRfGewwu8XSsW_Kk-9ADg/168s.jpg", "caption": "His birthday"}]}}, {"review": {"des": "I have been here so many times for happy hour. It's a consistent experience and one of the best happy hour values downtown.<br><br>On Friday, they open the upstairs. You can still get drink specials at the downstairs bar, but happy hour food is only upstairs on Friday. <br><br>This place is worth going to.", "pics": null}}, {"review": {"des": "Three stars is very accurate for this restaurant. Not great, not bad. Cantina Laredo is just okay.<br><br>I came here with a friend on a week night and was surprised at 1) how fancy the interior looked and 2) how empty this place was. We were seated at a table with four big lounge chairs that was oddly too spacious. Is that even something I can complain about? I swear the amount of space for just our table was bigger than my studio apartment. It was just kind of weird and felt awkward. But the views of surrounding River North out the floor-to-curling widows was really show-stopping. <br><br>The food also was just slightly off, despite great potential. The guac was made tableside, which was fun! But the woman who was making it asked how spicy we wanted it -- mild, medium, or hot. We said hot, but it just tasted like a mild mash of avocado, and I'm a wimp when it comes to spicy foods! Trying to scoop it up was also next to impossible, as the chips were so thin they kept breaking. And the tacos, while beautifully plated, were also just so-so. <br><br>Overall, I felt like Cantina Laredo had a confused identity. The vibe of the restaurant and prices on the menu seemed to trend towards upscale. The food itself was no better than your everyday white-washed Mexican restaurant. For the price, I'd rather go elsewhere. And for good Mexican food, I'd rather go elsewhere too.", "pics": null}}, {"review": {"des": "We ordered the Combo Acapulco & Relenos with shrimp, which were delish! Classic margaritas were potent! Nice ambience with lots of tables at this restaurant. Great location, 20 min walk from Navy Pier.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/L1rCctj2-A7R9ZBKIgCgaQ/168s.jpg", "caption": "Chili Relenos with shrimp"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Hck5dxNliZVlkbaau6tjqg/168s.jpg", "caption": "Relenos & Acapulco Combo - delish!! Classic margaritas very potent!"}]}}, {"review": {"des": "Wow, I've come here a few times in the past and thought the food was just good not amazing, but last night I came here and was blown away by the carne asada platter ($20.99) and the tacos ($14.99)! Definitely on the pricier side but ok IMO especially for the very flavorful carne which comes with rice and beans and is big enough to split. There's also yummy complimentary chips and salsa.<br><br>I would recommend splitting a plate and an appetizer (tableside guac) or tacos if you have two people to save money. Also there's happy hour menu until 6:30 pm but you have to ask for it before you are seated because it's only in a designated section!<br><br>The ambiance is amazing, wouldn't disappoint for a date or a big group. Our service was a bit on the slow side towards the end, but they were pretty good with refilling our waters.", "pics": null}}, {"review": {"des": "Yums<br>Good ambiance had a good time with my friend, food was good and service was nice. Pretty drinks! and yummy chips", "pics": null}}, {"review": {"des": "Cucumber Margarita is excellent! Food was pretty good. Great with kids! All in all 5 stars!", "pics": null}}, {"review": {"des": "Great ambiance and awesome decor. Fireplaces made the place nice and cozy. A lot of options on drinks. Our server was nice and friendly but didn't give his name. Prices are good and affordable. <br>Tried Ceviche,  Shrimp tacos, Chorizo Shrimp empanadas, Cinco margarita, Mojito, Crab cakes y poblano and everything was good.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_nsQoY99Q_Vdh1by3irY5g/348s.jpg", "caption": "Chorizo shrimp empanadas, are fantastic"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RDYS_g-cqiTlD-M9DHbCXg/168s.jpg", "caption": "from outside easy to see"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Agy-ehtcuaSY5hU0gbQDHA/168s.jpg", "caption": "Crab cakes, awesome"}]}}, {"review": {"des": "Randomly went here while on a weekend trip.  Loved it!  Highly recommend the Camaron Pablano Asada.", "pics": null}}, {"review": {"des": "Hmmmm.. our son was excited to introduce us to Catina Laredo so we tracked over a little after 1:30pm. The place was somewhat quiet, modern open floor plan decor. Our wait staff was prompt and seated us at a high top table where we could enjoy soccer. Chips & salsa arrived promptly, and were fine, margarita on the rocks & Bloody Mary were good but not great, food was good but not great.. service continued to be good but not great. Can't say I would return simply because there are too many other choices in Chitown!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-f1kL8B81mv_3V1PBtvc0A/348s.jpg", "caption": "Yum!"}]}}, {"review": {"des": "This place has outstanding Guacamole. The make it fresh in front of you, by your table! And the chips were super thin and super crispy!<br><br>We also ordered tacos, and nachos. They were outstanding too. The unique part about their nanchos is that it's not like your traditional nachos where they give you chips and cheese with toppings on it. Their nanchos have have big nanchos chips with melted cheese and topping on top of it so it's less messy in my opinion<br><br>I personally ordered their Chile steak and it was the best Chile steak I honestly ever had. This was huge piece of steak and perfectly cooked. It was filling.<br><br>Lastly, they have a desert menu as well. It was my bday so my friend told them before hand and they brought a fudge cake! It was amazing too!<br><br>Overall it was a great experience and would go here again!<br><br>Highly recommend to try it out and get their guacamole for starters. You will definitely not regret it!", "pics": null}}, {"review": {"des": "This is one of my favorite Tex-Mex in Chicago.  Especially their warm salsa and those thin crisp chips are absolutely amazing.  I'm a spicy food lover and Cantina satisfied my level of spice.<br><br>I get their chip and guacamole, and enchiladas dinner option.  Their chimichurri sauce is really authentic and goes with almost everything, I get that on the side with my enchiladas.  I was once their regular customer when I lived in this area and my friend was a bartender, now I don't come as often but drinks are still delicious.", "pics": null}}, {"review": {"des": "Yum! <br><br>Fresh guac was the best. A must order. <br>Drinks were delicious (mango margarita) <br>Food was delicious (chicken and steak fajitas) <br>Dessert was delicious (flan and mango tres leches cake) <br><br>Service was great. Our rose wine glasses were a little dirty and had to be sent back and cleaned but everything else was great. <br><br>Loved the decor of the restaurant. Also super convenient since it was right across the street from our hotel (palomar)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/US4xGTc5IUsKmrKIjGHMgA/348s.jpg", "caption": "Flan"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/x5e-lt39Pi11ft4sMcuF8Q/168s.jpg", "caption": "This one was the best (we tried all the desserts)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OrpFnYvZYD-I3awi4rON1A/168s.jpg", "caption": "Tres amigos"}]}}, {"review": {"des": "The staff is friendly and the environment is good. I visited on a Friday night around 5pm. It got very busy and loud. The bottom of the restaurant is very open which allows for the tables to be spread out so you don't have to shout across your table. They make their guacamole to order and bring a cart out next to your table so you can watch them make it. <br><br>Happy hour is offered from 3:30 - 6:30pm in the bar only. <br><br>I ordered the carne asada and ceviche. The ceviche tasted like lime and onion, I sent it back. The carne asada was delicious but probably not worth the $20.99. The taste of the meat was on point but the texture was a little off. I was looking for the outside to be a little crisper. <br><br>The place is clean and seems to be very popular. Worth a shot if you are close by and want good Mexican food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/u6-4EwETfwMAuYP2PQRzuQ/348s.jpg", "caption": "Ceviche. Not good."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/24WUDirCmYfOw19NvzKb5A/168s.jpg", "caption": "Carne asada with rice and beans."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/A5t9ZWtjn4g8fQLg9HWu8w/168s.jpg", "caption": "Friday night at 5pm! It gets busy and loud. It is a pretty open space so the tables downstairs aren't super close together."}]}}, {"review": {"des": "Ambiance is beautiful and service is on point. We came here for lunch twice during our stay in Chicago and liked it better second time around. DO order the chimichanga and the fajitas! But skip the margaritas--they were weak. My phone was dead and they were nice enough to charge it while we ate :)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WA-u2b6azJ9RZSsXIR0Qxw/168s.jpg", "caption": "Salsa"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2TGwGf51sWtZxU-jsglxtg/168s.jpg", "caption": "Queso"}]}}, {"review": {"des": "My co worker and I came across very good Mexican food in a fine restaurant in a busy downtown neighborhood near our hotel. This place is the right combination of very good food quality and customer service with the welcoming ambiance with fireplaces etc.. Service was fast since it was not busy when we arrived. We had our table in seconds which was convenient because we were starving lol.<br><br>It is a large,(Inside)  modern restaurant with abundant natural lighting, so it feels open and inviting. Complementary chips and salsa (2 kinds which were AMAZING !!!) arrived quickly, as did our server who was superb and pretty informative about the menu and recommendations.<br><br>I had the stuffed chicken with shrimp for my entree which was amazing. Only negative was the chicken was not real tender and a little tough but other than perfect with that wine chipotle sauce holy sweet baby Jesus lol. My co worker had the Beef Sizzling Fajita (Literally sizzling when it was delivered) the rice and beans were flawless and Beef was pretty tender well seasoned. No complaints !<br><br>But the reason for 4 stars and not 3.5 stars was the Mango Tres Leches Cake. (Not Pictured My Battery Died). It was tasty calorie heaven lol. The cake was so moist with the perfect milk ratio in it, and the mango sauce topping was delicious and a perfect match.<br><br>So to wrap things up you have great service, overall fantastic food, and even the regular menu prices are reasonable. I would definitely come back when visiting the Chi !!!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/c23U2JAxn4lsarkBLMTVzw/348s.jpg", "caption": "Grilled Chicken Breast Stuffed With Shrimp, Topped With Sautéed Spinach and Chipolte Wine Sauce #MustTry"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XZQ3CFM6DDyuoIbNLTpi2A/168s.jpg", "caption": "Yellow Rice With Black Beans On The Side"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-CFs1BVpuPsCJxPssZZleA/168s.jpg", "caption": "Beef Sizzling Fajitas with Guacamole And Sour Cream. Very Good"}]}}, {"review": {"des": "Came here for happy hour on a Thursday evening. Happy hour runs from 3:30 p.m. to 6:30 p.m. with specials available in the upstairs lounge only with seating on first-come basis. It's a great deal with  50% off the Platillos section listed on the food menu. <br><br>I got the Flatbread De Camarones Chipotle, which is a must-try!  it is sweet and salty goodness. I also got the Top Shelf Guacamole. It is made table side so it is definitely Snapchat worthy.<br>  <br>For drinks, $5 will get you a basic, yet tasty, margarita. There are also other margarita flavors, but I don't think those were included in the specials for happy hour.<br> <br>I'll have to give Cantina Laredo a try for dinner sometime, but  it is definitely a worthwhile spot for happy hour!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NRhXEZ7ILjAIpo953D3lpA/348s.jpg", "caption": "Flatbread in the background and tacos in the front."}]}}, {"review": {"des": "We found this a surprising and good Mexican restaurant in the heart of River North.  It looks upscale, but the place is actually quite casual and the menu is priced moderately, with most of the taco and enchilada plates priced between $10 and $15. (Most of the fajitas and specialties range between $15 and $20.)<br><br>Service was good.  So was our food. I enjoyed my Barbacoa enchiladas. Our friend's Ceviche was fresh, and he enjoyed his Ahi tuna tacos. <br><br>For a chain restaurant, Cantina Laredo had a unique ambiance and good food. There's an interesting lounge upstairs.  Make reservations on Open Table.", "pics": null}}, {"review": {"des": "I want to start by saying Cantina Laredo was one of my favorite places for drinks and food in the city. The many times I came before I had great service, great food, and amazing margaritas. However this past time I went I was really disappointed with service. I came with a group after work and we all sat at the bar. The bartenders seemed very disinterested in their customers. I had to flag down a waiter to order a second drink and after several attempts (about 15 minutes) my friends and I all waved to get the bartenders attention. It seemed to bother them that we wanted more food and drinks. <br><br>One of my friends had to ask for something three times and the bartender kept pointing a finger as if to say \"oh yeah I remember\". There were two bartenders working and a third was standing by a customer not doing anything. He made eye contact with me several times when I was trying to order another drink and he did nothing. At the very least he could have that informed the other bartenders I was looking for some help. <br><br>We ordered some quacamole and queso. They brought it out with no chips and no one brought any chips  until I asked for them. And it was a busboy or barback who saw I needed something and made sure I was taken care of. Bartenders again did nothing. <br><br>I was very disappointed with this visit. I used to recommend this place to everyone but after this last visit I think I will have to stop doing so.", "pics": null}}, {"review": {"des": "This place is so solid. I end up here for happy hours a lot. Not a lot of places in River North do a happy hour so I love Cantina Laredo for that! The house margs are always a great choice.  Also, this place is BIG so it's usually not an issue getting a reservation or even a quick walk-in table. <br><br>Other favorite items - <br>Apps: You can't go wrong with the house tableside guacamole<br>Entree: Enchiladas de mole has a GREAT smoky chocolately sauce.", "pics": null}}, {"review": {"des": "If you are looking for somewhere with great margaritas and even better queso, Cantina Laredo is the place to go. Surprisingly, good queso whether it be yellow or white (they have both), is extremely hard to find and Cantina easily has the best in Chicago. I also learned their margaritas are made from fresh juice with no artificial flavoring to be worried about. On top of that, they know how to keep them strong! In terms of Mexican restaurants for happy hour after work, Cantina truly can't be beat. I come here time and time again and never leave disappointed.", "pics": null}}, {"review": {"des": "The best way to start the night is with a Rosarita- perfect combination of spicy and sweet! We followed that with their delicious queso and avocado enchiladas. The grande finale was the sizzling Mexican apple pie with icecream! Overall, a wonderful meal!", "pics": null}}, {"review": {"des": "Okay food but nothing special. Top shelf guacamole was fresh but needed more salt. Combination fajita was small and unremarkable. Complimentary salsa was flavorful. <br>We didn't order any of their specialty items so can't comment on them. I'm not sure if I would go back when they didn't wow me with the basics. <br><br>We saw a few groups celebrating birthday here. It's a nice enough venue that fits in the river north neighborhood with just-okay food.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QGH_0LNH0zay50YsKztcQQ/348s.jpg", "caption": "COMBINACIÓN FAJITA - side rice and beans"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ejJKnTz4SIiFwblaJUOCdg/168s.jpg", "caption": "COMBINACIÓN FAJITA"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YWNFMym8HMNcHeliIzLGKw/168s.jpg", "caption": "Top Top Shelf Guacamole made tableside"}]}}, {"review": {"des": "Reaaallyyyy slow service, but really nice staff, so I don't care. The food really isn't that great, but there are not many other tex-mex places downtown (if this was supposed to be tex-mex?). But the drink menu is exciting and fun and reasonably priced! I really liked the passionfruit colada that I got. My friend got the strawberry daiquiri which she really enjoyed as well. Would definitely return to try more of their drinks.  The ambience is nice as well, so it's a nice spot to meet up with friends for drinks. ALSO the tableside guacamole is very overhyped! Get queso instead if you have to pick. <br><br>4 stars for drink menu, 3 stars for foodie", "pics": null}}, {"review": {"des": "The food was tasty. I went during lunch, and had the carne asada. There were 3 of us in my party. Service was quick and we had a nice waiter. The restaurant is in a busy area, so parking typically sucks. Thankfully, we took an Uber, so that was a non-issue for us. Overall, I'd return in the future.", "pics": null}}, {"review": {"des": "Good food. Mondays are not too busy but the general vibe and open area can't be missed. If you are in the mood for some creative drinks and Americanized Mexican food you won't be disappointed", "pics": null}}, {"review": {"des": "The polar opposite from Frontera Grill: larger portions, better service, more flavor. <br><br>I loved my mole enchiladas, as not only the chicken was super tender but they also had cheese inside for a great contrast.<br><br>Best guac I've ever had. Our guacamole chef, Samantha, was super professional and extremely nice. We chatted for a bit about Chicago and she gave my friend and I recommendations. She made an amazing difference in our experience!<br><br>Chips were light and crispy with a great splash of lime. <br><br>Side note: Frontera is mediocre don't bother going there.", "pics": null}}, {"review": {"des": "I truly wanted to enjoy my experience here but sadly enough it fell quite short. <br><br>PROS: Ambiance is nice with fireplaces & a romantic atmosphere. Tableside guac was excellent & I would recommend it. My husband had the Tres Fajita combo & said they were probably the best fajitas hes had. <br><br>CONS: Service. The other reviews are accurate when they say service was lacking, to say the least. Waiter took 10mins to acknowledge our table & let our chip bowl sit empty after we received our tableside guac. Our food was brought by someone else & we didnt see our server again until he brought the bill, no checkback at all. Id like to give him the benefit of the doubt & say they were packed but we came on a Sunday night and not even half the place was full.<br><br>I had the pork tacos. Pork was very chewy and lacked any flavor. Someone else ordered the 3 chicken tacos & said the chicken was extremely dry and flavorless. Also there were 2 chicken tacos & 1 beef taco on his plate. I told the waiter & he didnt seem to care. Didnt offer a fix or to correct the problem. <br><br>Overall I would try somewhere else next time. Food quality + poor service for me was so disappointing. Nice restaurant from the looks, but the rest didnt cut it for me.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/odp8dbxqT3CEBG_kiF6mag/348s.jpg", "caption": "Pork tacos"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cTRO3djYbC6_kyWrdtnISQ/168s.jpg", "caption": "Fajitas tres (chicken, steak & bacon wrapped shrimp)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Wqv_uAjBZXwCq-ElWSv2lA/168s.jpg", "caption": "Chicken tacos"}]}}, {"review": {"des": "Absolutely delicious! Super attentive server and the bartender puts all the liquor in your drink. I came for an event so I had a little bit of everything, from a chicken soft taco to a beef soft taco and some delicious shrimp. The guacamole was superb and the chips were not stale. The place was packed, so you know it's good!", "pics": null}}, {"review": {"des": "Two words: tableside guacamole.<br><br>One of the many awesome things about Cantina Laredo. I've been during happy hour (4-6pm) and also during the late lunch hour (12-2pm), both times service was great! <br><br>The drinks are so refreshing and the food has so much flavor! The chipotle salsa...DELISH. <br><br>And my go-to dish are the nachos on the appetizer/starter menu. Most places give you a mound of nachos with half of them not having touch the cheese or meat and toppings. But THESE nachos were individual, probably 10 per plate, accompanied by guacamole, lettuce, and sour cream and jalapeños. Some of the best nachos I've ever had! <br><br>Lastly, the tableside guac is close to $11, but it's SO fresh that it's 100% worth it.", "pics": null}}, {"review": {"des": "Segregated.<br><br>Caucasian all by the windows. <br>African Americans and Us (Latinos) were Sat towards the back. <br><br>They were not busy at all,  many tables empty but I guess we didn't fit the crowd. <br><br>Little did Cantina Laredo know I eat here often. <br>I work in the industry and will have all properties concierge Teams not recommend this place ever. <br><br>On Sat 1/27/18 we were in the neighborhood and decided on Mexican (though the Mex is ok not the best).<br><br>Cantina Laredo.... you serve Mex food,  your entire staff is Mexican,  why only Cater to Caucasians?  What's wrong with the math here. <br><br>If you weren't divided,  your place would probably be full all the time (weather is irrelevant).<br><br>Your loss CL.  The sun shines on us all. <br>We all need air to breathe. <br>#cantinalaredo", "pics": null}}, {"review": {"des": "I really enjoyed the experience with this restaurant!<br>The atmosphere is really nice and comfy, big windows, fireplaces, cozy chairs and tables. <br>We've never been to this place before, but I'm sure we will definitely come back. <br>We had a really nice server, who was guiding us through the menu advising on the meals. <br>They have moderate prices and excellent food. <br>The served us free salsa with really fresh chips, that's was really good and typically places in the neighborhood charge for that, but they didn't and even added the product ones we ran out of it! <br>The food arrived fast and was really delicious. Big filling portions of high quality Mexican food. <br>At the end we decided to share a desert and the cake we tried was literally one of a kind! It was so moist and full of flavor! We even wanted to ask if it's possible to order a wedding cake from this restaurant that will have the same taste. <br>Overall, I'll be happy to come back!", "pics": null}}, {"review": {"des": "Great atmosphere whether you are upstairs or downstairs! I had the best frozen pomegranate margarita. I also got the fajita combo which was delicious. They serve the Cholula hot sauce which is my favorite! Clean bathrooms as well.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zreslIhHRzVPdvnbofblIQ/348s.jpg", "caption": "Frozen pomegranate margarita. This hit the spot!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cpum003ujDKnXesdbG9xBg/168s.jpg", "caption": "The guacamole was very good"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/G7yJH7fu0ITeF6aM3RA-qg/168s.jpg", "caption": "2 types of salsa with the chips and the fajita combo."}]}}, {"review": {"des": "I have been to Cantina Laredo several times, both personally and with groups for work. <br><br>I'd like to talk about the most recent time I was there. We bring groups from work occasionally and it's always a struggle for us to find places that are willing to split the check as many ways as we did (We had 12 people). I know this is a huge pain. <br><br>Yet when we asked for this at Cantina Laredo, the management kindly agreed. <br><br>We were gifted with an AMAZING server. I mean it, this guy was incredible. His name was Luis, I believe. He was kind, attentive, helpful, and never got anyone's order or check mixed up (which would have been understandable). He was extremely professional and clearly a major asset to the place!<br><br>Last but not least, the food is delicious. I try to order something different each time and have never been disappointed. My favorites are the tamales, and the guacamole, which is exceptional. They make it tableside. <br><br>Definitely give this place a shot. Great atmosphere, great service, great food. All around a great experience.", "pics": null}}, {"review": {"des": "Beautiful restaurant with great margaritas, a friendly staff, and awesome food. We had the table-side guac, tacos, and enchiladas. Everything was great all around. Luis was the best!<br><br>A great place to go for happy hour or dinner. Plenty of space and a nice, open feel.", "pics": null}}, {"review": {"des": "We came here with my husband and i specifically love the carne asada. Very tender and great taste. The prices aren't as high as some other restaurants in the area. Great option.", "pics": null}}, {"review": {"des": "Was in town visiting a friend and we ate here! The table side Guacamole was incredible and would highly recommend it. I also ordered a Ginger Ale and it was the best Ginger Ale I've ever had! <br><br>Was very busy for happy hour. It is a great place to get drinks and appetizers.", "pics": null}}, {"review": {"des": "Had brunch here - originally planned to try the restaurant week menu but decided to just do the normal one instead. Beautiful light in the open area, we shared the guacamole, which tasted really fresh (which makes sense since it was made right there at our table). I got the crab cake Benedict which I thought was really good - awesome flavor of the crab cake and the orange sauce on it was perfect! It came with potatoes and a little pastry bowl with fruit. Pretty big portions esp since we also had the guac and the chips...left very full! <br><br>Oh, and I had the Delicioso - super tart but excellent if you like drinks on the sour side!", "pics": null}}, {"review": {"des": "We came in for happy hour. Had a ball. This was our second time here. Good food,reasonably priced and good service. We will be back.", "pics": null}}, {"review": {"des": "The waiter Victor was awesome and the food was just as great.  I had the chimichanga...simply perfect and casa Blanca with chips...yum yum. I will be back. A must visit", "pics": null}}, {"review": {"des": "I was just recently here few days back on a Sunday afternoon. I made a reservation through open table, and all that went swiftly. I would have given a 5/5 stars like i've done before but i felt as if the service was not as good as before. Our waiter took his sweet time and barely came to our table. I ended up going up to him to grab his attention, when it should have been the other way around. <br><br>The food here is great, and the environment is great, I just wished I had a better experience with the staff, just specifically our waiter because the other staff came by to fill our water and give us our order more times than our waiter came by. <br><br>I brought a friend here for the first time and they loved the food, but they were quite disappointed with the service, so I wanted to mention that specifically.", "pics": null}}, {"review": {"des": "This place is incredible.  The biggest downfall is that I couldn't stop eating to drink.  Food was on point and the Margarita I had was delicious.  Too bad the guacamole and queso blanco filled my belly.  #firstworldproblems. Coming back for sure!", "pics": null}}, {"review": {"des": "Not the best first visit.<br><br>Guacamole is an incredibly small portion on appetizer menu for $11<br><br>Waiter made an error with one of my clients order.  Ok, no biggie. He is human.   Though the poor service throughout the meal was disturbing.  In addition, when the bill came there were two bottles of beer on the check there were never ordered.<br><br>The food was good...not great.  And not worth the 40% premium on items that you can order at any restaurant that serves Mexican fare.", "pics": null}}, {"review": {"des": "We had high expectations for this really beautiful place. But, we were very disappointed. The drinks were great, but the food was awful. Awful enough for us to write this review.<br>We ordered the fish tacos with mahi mahi. We literally had to send it back because the fish was so fishy, we couldn't eat it. Or waitperson was very apologetic and offered to take it back, which was nice. (We've never sent back any dish before).<br>Instead, we ordered chicken nachos.<br>Out came something that tasted ok, but had nothing to do with nachos.<br>The other disappointed we ordered was very salty and didn't taste like anything south of any border, except maybe the Canadian border. <br>We wish we could have liked Cantina Laredo, but we just didn't.", "pics": null}}, {"review": {"des": "Came for happy hour. I got the empanadas con chorizo. They were nicely plated and pretty good. The portions are not too filling, but you can definitely fill up on their chips! The chips come with two kinds of dip. Also, I highly recommend sharing a guacamole with your table, as they bring the ingredients to your table and make it front of you!! It was very nice to watch, and the guacamole turned out to be very delicious. <br><br>Some of the food items were too salty at times. When we got a refill on one of the dips, it was really salty. The crab cakes were also a little salty.<br><br>The service was slow. It was hard to get refills on water. We had to ask to get utensils, and it took a while to get our menus. We also found a fly in one of the drinks. <br><br>The location is very nice. It is well-kept, and they have a nice upstairs loft seating area. Unfortunately, it was reserved for a private party the night we went.<br><br>I'll give it a 3 because the happy hour is a pretty good deal on both food and drinks! The food is average and the service a little below average.", "pics": null}}, {"review": {"des": "This place is perfect to go on a date to.  It has a classy setting with private rooms aswell.  my family and i came here at around 9 on a Saturday.  If we didn't place a reservation for 4, we may have not gotten a table.  I would recommend looking at their busy hours on google and place a reservation if you think it will be busy.  <br><br>We ordered the fresh Guacamole that gets made in front of you.  It is similar to how uncle Julio's makes their Guacamole, but i noticed some things that Uncle Julio's does better.  The person who makes the Guac, asks you if you want it normal or if you want other things to be added in as well.  For example, lets say if you wanted more things like tomatos to be in it, he or she would then make it for you, and at the end, the uncle Julio's service makes you try it before leaving.  At Cantina, they only ask you if you want it spicy or normal, make it, then leave.<br><br>All of the other servers are really nice and the food is good.  Our server constantly came up to us, asking if we needed anything else or had any concerns.  Our server was Abel and he recommended the steak, which was really delicious.  Try it with their fajitas.", "pics": null}}, {"review": {"des": "Maybe it's the tacos? Maybe it's the tequila? Either way, it's a blast every time! Please try the tequila flights, margaritas on the rocks and their tacos! Enjoy.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6WjYVDYhnTTzxkgoIiRdHQ/348s.jpg", "caption": "Flatous!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RQ6_-TALsEE02XemIMkHOQ/168s.jpg", "caption": "I love their different types of salsa with the chips!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yBP0p0BUZzOWXqxExJ1Qkg/168s.jpg", "caption": "Does this picture really need a caption?"}]}}, {"review": {"des": "Cantina Laredo managed to do the impossible. Screw up guacamole. And a basic taco. And rice. Maybe they need to clean their oil, or filter their water, or both. Everything just tasted strange, except the queso which was quite good. The \"authentic taco\" was so greasy it was inedible.  The rice tasted like dirt. And the guacamole was merely lightly mashed chunks of avocado. Service was not good either. 3 bartenders at a 2/3 empty bar and I had to flag one down (texting on his cell phone) to put in an order. No one came by to ask how my food was. When I left most of my plates 1/2 full, no one asked if everything was okay. I'm a big supporter of our servers and bartenders and try to do so via tip. First time in a LONG time, I left 15%. Luckily my bill wasn't too bad or I would've been pitching a fit over the crappy food.", "pics": null}}, {"review": {"des": "It's a beautiful space, and for a restaurant in this neighborhood, it's very affordable. We were able to get a two-top at the bar at 7 on a Saturday without a reservation. The service was not great but respectful of our time requirements (we had an event later).<br><br>All of that is good, but the food was just okay. We had the tuna tacos, some kind of empanadas, and the ceviche. The ceviche was the only thing I would order again.", "pics": null}}, {"review": {"des": "Asthetic does not match the food.<br>Food is fancy taco bell.<br><br>Was not satisfied with it at all.", "pics": null}}, {"review": {"des": "I'm a very big fan of modern Mexican Architecture and this place hits it on the mark. I'm not however going to give a 5 star review just because I'm enamored with the design aesthetic it takes the full combination. The wait staff is highly professional, the music of Cuban Salsa reminds me of my travel throughout Mexico, plus they don't force refried beans down your pallet.<br>The place is a little on the loud side but conversational tones carry just fine. <br>I suggest you give this place a try and compare it to your \"best ever\" Mexican food experience. in my opinion, it's up there!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9F7LRkecwX7ZOgQesr5f9Q/348s.jpg", "caption": "Through the bar to the Street side fireplace"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HnU2fjMWk1ALO9hPyraC3A/168s.jpg", "caption": "Architectural Highlighted Stair accent"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yhqXQDwNA553uGz3dc_pmQ/168s.jpg", "caption": "Mole Chicken Enchiladas"}]}}, {"review": {"des": "1. Decor and Ambiance: 5 stars<br>2. Hosting Team: 4.5 stars<br>3. Food quality/taste: 3.5 stars<br>4. Service (Bar top): 2 stars<br><br>The restaurant is beautifully designed.  The host staff was quite welcoming and friendly.   The enchiladas mole was a bit too sweet and quite mild but a good effort.  The margarita was above average. The service in the bar was slow, apathetic, uninterested, and an unfortunate let down.  I'd go again if there was no wait AND was in the immediate neighborhood again.", "pics": null}}, {"review": {"des": "Good alternative for a meal and drinks if you cant get into RPM next door.  Although I would have preferred going to the Cuban restaurant down the street, this place was ok.  <br><br>The service was ok, for a slow Wednesday evening I expected more from the waiter.  We had to practically flag down the guy every time for more chips and refills on water.  The food was decent, I ordered the Fajitas Tres which was chicken, beef and bacon wrapped shrimp.  Yes you heard me, bacon wrapped shrimp......delicious!  I had to ask the waiter where the tortillas were, it was wrapped beneath the beans and rice.  This was something he could have indicated to me earlier when he brought my meal.<br><br>Overall this place is ok, not as good as Uncle Julio's Hacienda.  The River North prices are present here as drinks average around $10 and you will spend an average of $30 per person on food and appetizers.  The service could be improved, especially on a slower night.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mzxDvre4W311eC-QLkQcFw/348s.jpg", "caption": "Guac"}]}}, {"review": {"des": "I really really enjoy this place every time I come here. Even though we only came for drinks and appetizers, we still had a great time. We came from a Bulls game to finish enjoying a warm Chicago night and to drink away the pain of a Bulls loss. My drink of choice when I come is the Cabo flip and the table made guacamole is always a favorite. The lighting and decor is really nice and quaint. This place is good for large groups or a romantic night out with that special someone.", "pics": null}}, {"review": {"des": "Brunch Vs. Dinner<br><br>Brunch:  It seems to be fairly easy to score a reservation for their weekend brunch on Open Table.  My group of friends and I came around noon, and were seated right away with no problem.  There was probably less than 5 other tables of people around during the time that we were here.  Brunch comes with one complimentary mimosa or bloody mary, so that is a good perk of ordering from the brunch menu.   I ordered the chicken chilaquiles, and had high hopes for them.  They tasted good for the most part, but I probably would only rate them a 6 out of 10 in comparison to other chilaquiles that I've had at other restaurants in Chicago.  Despite how empty the restaurant was, our waitress became less attentive after we received our food.  At one point we looked over, and saw her chatting with a waiter in the back.  I'm more understanding of non attentive service if the place is busy, but it's not as reasonable when the restaurant is basically empty.  <br><br>Dinner:  Getting the guacamole as an appetizer is a must when you come here for dinner (also available at brunch as well).  They make the guacamole at your table, so you know that the guacamole is fresh and hasn't been sitting in the kitchen for hours.  I've had positive experiences with the enchiladas and tacos at Cantina Laredo.  The margaritas and mojitos are good drink options.  <br><br>My positive dinner experiences at Cantina Laredo overshadow my one average brunch experience.  There are better brunch choices within a 15 minute walk that you may want to consider (Bottlefork and Hub 51 for example).", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UvQl9XuKMcoQysi-y2FzUQ/348s.jpg", "caption": "Chilaquiles"}]}}, {"review": {"des": "Cantina Laredo, which looks super swanky on the outside, was a place we wanted to check out because it just looked so nice.  In the end, it was pretty disappointing.  We posted up at the bar and experienced the table-side guacamole preparation, which was not much better than what we can make at home.  The fajitas were fine, but reminded me of what TGI Friday's served back in the 1990's, only at double the price.  It's a festive place in terms of large groups celebrating birthdays or other things, but even that seems cheesy, and in a city with ridiculously great Mexican food, whether simple or high end, I'm not sure why anyone would check out Cantina Laredo.", "pics": null}}, {"review": {"des": "I WANT MORE!!! <br>I hope you got the idea... such great food and ambiance... a high end mexican restaurant with a modern twist... the fresh guac to die for... the nachos very different in a great way!! Everything about this place was perfect! My bf brought me here for my bday lunch and i couldn't be happier... this will be my happy place! Will be going back later on this week... Will bring in my parents", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iV0b5TF_H4ryC4G12bFqpw/168s.jpg", "caption": "Fresh Guac"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8-cH3LwASfs71Do38ZQ4RA/168s.jpg", "caption": "Nachos"}]}}, {"review": {"des": "Upscale pricey Mexican restaurant. Really enjoyed this place. The ambiance was great! They provide private rooms for larger groups with impeccable decor, very impressive. Each private room is different than the next. <br><br>We made a reservation for my birthday and sat near the large fireplace. The complimentary chips and salsa dip that they serve before the food was so good. I was afraid of eating too much and not leaving space for the food. That's how good it was. That warm smoky salsa was everything. The tableside homemade guacamole came out in a rolled cart. A lady made it in front of us before our very eyes.<br><br>For drinks I got the skinny mango virgin mojito with mint, which was pretty good. For the first entrèe we had the mixed tacos which couldn't have been any more perfect. We also had the chicken fajita that came with yellow rice and black beans on the side. <br><br>And finally for a birthday treat, I got the skillet brownie with ice cream, and a cute sparkler candle on top! <br>Overall had a great time, and would definitely go back again!", "pics": null}}, {"review": {"des": "After living in Germany for the past 10 years I'd been craving good Mexican food and my visit to Chicago brought me to Cantina Laredo after a suggestion from my daughter. I'm happy to report that I was greatly rewarded by her suggestion as the food and service were excellent. The environment was comfortable and the food hit the spot, especially the freshly made guacamole! If you're looking for Mexican food then Cantina Laredo is a must. Our group of seven each ordered separate dishes and the only disappointment was that I didn't have more room to eat more food! As Arnold said, \"I'll be back.\"", "pics": null}}, {"review": {"des": "So, I ordered the white queso, carne Laredo queso, and top shelf guac. All three were great! For my main course I got the carne asada. The steak was cooked properly but it was a little too salty in some spots. Overall the flavor was good. For dessert, i order the apple pie with cinnamon ice cream. (you gotta get this!) The feel of the restaurant was great i would recommend going.", "pics": null}}, {"review": {"des": "Not the best Mexican food in Chicago but also not the worst. I made a reservation on OpenTable for happy hour one day but did not realize that the happy hour menu was only available in one part of the restaurant. Furthermore, you can't reserve happy hour tables. Not sure if I didn't read clearly or just made a false assumption the nachos were fine and the queso dip was decent. I loved my margarita! I think I got the peach margarita. I guess I just wasn't super impressed by this restaurant but I wasn't repulsed by any means either.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LYGxoloGRVV40TjrEtBmQA/348s.jpg", "caption": "Nachos with chicken"}]}}, {"review": {"des": "This place is AWESOME!!!!!! From the service to the food there's NOTHING negative I can say. The table side sauce n chips, YUMS!!!!! The made at your table guacamole, DELISH!!!! I had the Relleno de Camarones OMG!!!!!! My daughter had the Fajitas Tres. She ALWAYS get it sooooo that speaks for it self. They had a happy hour as well. Give them a try so will NOT be disappointed.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EfZYJmT0GtgPaEuLKhXW1w/348s.jpg", "caption": "Black beans, rice and shells for the fajitas"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nX2uMtdcyhIBPj1X8tH_aw/168s.jpg", "caption": "Fajita Tres"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YNQ7CLLppX0kWCtxHCpOdg/168s.jpg", "caption": "Relleno de Camarones"}]}}, {"review": {"des": "My boyfriend and I were walking on State Street last night and it was literally the smell escaping from Cantina Laredo that made us want to give it a try. There was about a 45 minute wait for 2. (Which I'll let slide because it was a weekend + we won the World Series). <br><br>We received a text when our table was ready and were seated right away. The decor of this place is extremely modern. There was a very cozy vibe, maybe because it was night time but it was extremely romantic if you're coming for a date. Our server bought out two salsas to go along with our chips and let. me. tell. you! Those salsas were AMAZING!! One was served warm and it was spicy but it was sooOooO0 good. The other was like a barbeque salsa which was good as well! <br><br>We both ordered the blood orange sangrias...they were, eh. Like, not totally amazing but not disgusting. Somewhere in between. For dinner we ordered the guacamole (which they make at your table!) chicken tacos and quesadillas. Everything was good. <br><br>It's not the best Mexican I've ever had but it is really good. I will definitely try to come back and give their brunch a try.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eb1WZpHaBciFvmCvrnZdiQ/348s.jpg", "caption": "Blood orange sangrias"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TeMtpoOxbCjzr6nCSeMBbQ/168s.jpg", "caption": "Fresh guacamole"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SU6LDIVVZ5wmSWg7pB_-NA/168s.jpg", "caption": "Chicken tacos"}]}}, {"review": {"des": "This place is AMAZING!! I went here with a bunch of friends and tried all different entrees. The fajitas are insanely good. They are so hot and anyway you wrap your fajita and no matter how you make it, it ends up tasting like some of the best food you've ever had. Their is a fajita that has three different types of protein in it! That's the way to go. The staff was great and the drinks I heard were strong. This is a great place to go on dates, bring your family, or go out with friends.", "pics": null}}]}