{"name": "carnivale-chicago-2", "reviews": [{"review": {"des": "Love, Love, Love!!!<br><br>Tonight was a night like no other! My bestie, myself and my mommy decided to try something new for our 2018 birthday celebration. Therefore, we decided to head to the city with our closest family and friends for an experience. If you're reading this review, please note CARNIVALE'S:  <br>Atmosphere- Amazing<br>Service- Amazing<br>Food- Amazing<br>Drinks- Amazing<br>Music- Amazing <br>Live shows- Amazing<br>Overall Experience: Beyond Amazing! :D<br><br>A special thanks to Serena, Jasher and our Bussers for your phenomenal services!! Thank you bunches!Best Birthday Ever!", "pics": null}}, {"review": {"des": "Had dinner around 7p last night, this place was packed, the ambient and crowed were welcoming and friendly. So much so that I didn't get a chance to check-in and or take a picture. However, I am writing it today cuz I really enjoyed everything at Carnivale.<br>-The staff were polite, professional and respectful of guests.<br>-The chips and guacamole was seasoned to perfection.<br>-The starter of salads, green salad with pickled onions and green salad with red radish with cheese dimpling, were excellent.<br>- My dinner was the salmon which was prepared with pinkish sauce over rice was cooked to perfection.<br>- bathrooms were clean and well attended.<br>I would love to see few small touch up with some of the decorations that are worn out, otherwise this place is my go to next time I am in Chicago.", "pics": null}}, {"review": {"des": "What a fun and fabulously decorated place!!<br>As soon as I walked in I was instantly pleased with how beautiful the atmosphere is. You feel like you're inside of a fancy carnival tent. It definitely adds something special to the entire experience right off the bat. <br>I met a friend here and we both ordered the empanadas to share. Slightly small portion for the price... but they were pretty darn tasty! My friend also ordered the oysters and said they were fantastic - & that's coming from someone who orders oysters everywhere we go. <br>For dinner I ordered the Peruvian chicken... yum! So flavorful and I loved the potatoes as well. For dessert we the cuban cigar and both loved that. The ice cream was so creamy and not too sweet. A solid meal from start to finish. And our waitress was great which always makes or breaks a review for me but she only added pleasantness to my experience.<br>For some reason it was extremely cold inside though, I'm not sure why... I found myself eating my food pretty quickly because it was actually getting cold pretty fast. But it could have just been the day I went. I can't wait to come back and bring a group of friends!", "pics": null}}, {"review": {"des": "We came here specifically for the cotton candy martini. I dragged the crew to Carnivale for pre-dinner drinks on a Saturday night. Since we were only there for drinks, we sat in the lounge area near the bar. There's lots of cozy seating and photo opportunities in the lounge area. The four of us all chose the cotton candy martini, and it was worth the trip. I prefer sweet drinks, and this martini definitely fits the bill. The lively atmosphere and the great service will have me returning for dinner.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EgnmX4JXeAjFZ-gSkuIw5A/168s.jpg", "caption": "Carnivale"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dMHRU2cCk2BL4mopLqgCLQ/168s.jpg", "caption": "Cotton candy martini"}]}}, {"review": {"des": "Carnivale is conveniently located right off 90/94. The colorful self advertising off the expressway always made me curious to try it out. <br><br>The inside of the restaurant is enormous and matches the colorful exterior. It definitely offers that festive atmosphere! <br><br>We ordered the coconut shrimp (pineapple glazed) and the guacamole as starters. For entrees, we ordered the Arrachera (wood grilled steak served with saffron rice and beans) and yucca gnocchi with an additional side of roasted cauliflowers. Everything we ordered that night were very flavorful and did not disappoint! <br><br>On top of that, the service was amazing. We would definitely come back to sample more of the menu!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5QKDLiezGm6qhwD9Cob_uQ/168s.jpg", "caption": "Coconut Shrimp"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/F5lv70TtC-I7p6ggoSRoPA/168s.jpg", "caption": "Arrachera"}]}}, {"review": {"des": "Listen.....Carnivale is soooo worth it. I love places that add a lil extra to the dining experience and Carnivale does just that and more. From the flaming margarita that is spicy to the cotton candy celebrations to the aerial performers to the live music to the hyped DJ to the pork and grits that had me at hello.... I fell in love with Carnivale.  We went on a Friday and it was packed...lively! A guy even proposed during dinner and the entire restaurant broke out into an applause.   The bar area is almost as big as the dining area. Great for date night as well as group events. It is a must! A gem in Chicago.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bswSrFYMHmUrUZ5erB3xAQ/348s.jpg", "caption": "Decor is bright and colorful."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/18o1itEDC-iVao3yzJIWbQ/168s.jpg", "caption": "Photobooth at front of restaurant."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/k21whT4GmyiurcRaYt11lQ/168s.jpg", "caption": "Cotton candy all over the place"}]}}, {"review": {"des": "What a wonderful experience my fiancé and I had for dinner. We decided to come here for dinner since it was close to where we would be heading for the evening. I made a reservation for us over their website and it was easy to get the spot I wanted. For a Saturday night at 6:15pm, it was not too busy. <br><br>The entire building inside is gorgeous. It's so colorful and just overall fun to experience. They really did a great job decorating. <br><br>We started with cocktails. I had the cotton candy martini which I enjoyed both the presentation and the taste! The fiancé had the flaming margarita. It came out on fire! <br><br>Our waiter, Miguel, was wonderful. He was extremely knowledgeable with the entire menu. I asked him about the vegetarian options and he described them and even told me the one he personally preferred. I went with the Vegetarian Tacu Tacu and the fiancé went with the Lamb Rack. The service was really fast. I felt like I blinked and our food was in front of us. <br><br>As a vegetarian, I have a hard time truly enjoying a meal at a restaurant. The vegetarian Tacu Tacu is so delicious, I can't rave enough about it. The flavors were AMAZING. The vegetables were cooked to perfection, and I could not get enough. I was extremely satisfied with my meal! And I know the fiancé loved his lamb. <br><br>Dessert was delicious too. They really know how to get their guests excited through presentation alone. The fiancé had the chocolate dome, where they poured hot chocolate sauce over a hard chocolate dome, where it melted and uncovered the delicious sherbet, berries, and cream inside. I tried the Cuban cigar, where they served it to me on an ash tray and opened a wooden box to unveil a smoking cigar cake inside. It was awesome! <br><br>We really had a great experience and want to thank Miguel for being so awesome. We will definitely be back!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UVCXwkmwOMbXMpCyH-hK0g/348s.jpg", "caption": "Cuban cigar"}]}}, {"review": {"des": "To be honest, I meant to give this place 4 stars because of its service... but its dessert was so good  that it would be unfair if I didn't give it 5 stars. Here I am, officially announcing that I've found the dessert of the year. I would come back just for its dessert, with no doubt. <br><br>My friend had the back ribs. They were super flavorful. I could smell the rubs and sauce the second the dish got out of the kitchen. IT SMELT THAT NICE. Plus, anything would taste better if you hold them by your hand. Isn't that true? Lol<br><br>I ordered the halibut dish. Upon looking at it, I was pleasantly surprised by its presentation. It was very elegant, pretty like a picture. But my issue was... the fish was overcooked. The fish had become a tab try, instead of being moist and juicy in the center. What a waste of an otherwise beautiful piece of fish. To make it worse, during the whole time, no one came up and checked in on me, asking about how I liked the dish. And let's talk about the portion size... I was only half full after finishing the whole plate. Enough said...<br><br>But when it came to the dessert, oh my... the presentation was out of the world. I was so amazed by its creativity. And I truly appreciated the effort the pastry chef put into this single dish. The taste of the dessert was phenomenal as well. I didn't see anything else anyone could do to elevate the dish. And the rum flavor from the ice cream lingered around in my mouth for the whole night. What a feast!<br><br>As I have stated at the very beginning, I am the biggest fan of its dessert. I might come back for multiple times, just having the dessert with a drink.", "pics": null}}, {"review": {"des": "Go on FRIDAY!!!  The food is great any day but on Friday's they have live music & dance shows.  It was truly amazing.", "pics": null}}, {"review": {"des": "Visited on Saturday, Nov. 24. <br>As you can see from the pictures the ambiance and atmosphere of this place is unique and pleasing to the eye.  The lamb was good, but nothing to rave about.  The guacamole app was pretty good and the portion size was more than plenty. The ropa de vieja app, that was complimentary, was pretty tasty. What left an impression on me was the service, decoration and the strong drinks.", "pics": null}}, {"review": {"des": "A fantastic place for special events or to even just enjoy some special drinks with friends. <br>I came here to celebrate my fathers birthday and the food was over the top! <br>We spent friendly evening here and they usually have gogo dancers or performers one day of the weekend. The only disappointment was that we thought there would be an aerial show and there was only gogo dancers on this particular night. I did mention this to the manager before we left because I booked my reservation 3 weeks in advance for this show. <br>The food and drinks were a delight!! The flaming margarita was worth the try even though it was a little spicy. <br>I had the pleasure of trying the rack of lamb and squash as my side. The squash was unlike anything I had tried before and it was so good ! <br>My boyfriend enjoyed the rum salmon and the others in my party tried the aged steak. <br>If there's a chance your in Chicago and want to have an entertaining dinner with 5 star dinning this is the place to try. Just make sure you reserve your table for the show your expecting !!", "pics": null}}, {"review": {"des": "This place is awesome. The decor inside is literally like a carnival. It's colorful, big, and fun. The service is also fantastic. We've never had a bad meal or service here. <br><br>I always get the arrachera steak with saffron rice (b/c i don't eat pork the sofrito has pork cooked into it). The steak is tender and full of flavor. The chimichurri is a nice addition. It give the steak and rice a bit more flavor. <br><br>My husband has tried a few things but really enjoys the senators chicken. The chicken is juicy and slightly spicy. The fries are fries. They are crispy on the outside and soft on the inside. <br><br>Overall its a really fun place to go. The food is good which is always a plus!", "pics": null}}, {"review": {"des": "A must to visit. Great atmosphere and food is outstanding. Celebrated my bday here :)", "pics": null}}, {"review": {"des": "Great caipirinha cocktail. That is all I wanted and I got it, along with some tasty guac. I loved it. <br>The interior design is so much fun and it makes you smile while good music makes you want to move.  <br>Sometimes, small things can make a difference, and in my case it was well made drink.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/W6gZgXn41L-aGicViZ14OQ/168s.jpg", "caption": "caipirinha"}]}}, {"review": {"des": "First time at this restaurant and have been met with the most hostile host, Natasha. It's bad enough that we have been waiting for our table for 30 minutes even after making a reservation, that she has to greet us with an intense attitude. I haven't even gotten to the food yet and already dislike this place. For an ambience as such, there should at least be some level of customer service that guests should be greeted with.<br><br>Update: our reservation was at 8:45pm. It is now 9:30 and we were finally seated.<br><br>Update: added three more stars because the server ended up making the experience great. Freddy was super welcoming and nice. He took his time and explained the menu.Accommodated us on what we needed.", "pics": null}}, {"review": {"des": "I used to love Carnivale and recommend it to friends who were in town visiting.  Now, I would not recommend it to anyone. What happened within the past year since the last time I've gone to Carnivale?? Food, drinks and service used to be all so good!<br>My boyfriend and I went on a Friday night (we made reservations).  Apparently Friday nights they turn the restaurant into a club.  There was clubbing music blasting, tables were moved to make room for a sort of dance floor, people were dancing while others were just there to dine.  The music was obnoxiously loud, like if you were in a club, so it was hard to talk to anyone- the waiter could barely hear us and vice versa.<br>I get it, they want to change things up, but the changes have been for the worse.  <br>We had ordered drinks at the bar while waiting for our table to be ready.  At least one of the bartenders was still the same so drinks were still good.  The drink menu and food menu was new.  I tried the bluberry sno-cone drink...it was good.  The mojitos continue to be good.<br>We ordered ropa vieja (one of the few appetizers that wasn't new and that we always ordered), empanada de elote and tuna poke for appetizers.  The appetizers came out in less than 5 minutes which was weird.  This is the only time I'd complain about food coming out too fast.  There's no way that the food was prepared that quickly unless it had been sitting there in an oven or something keeping warm.<br>The ropa vieja was good but the recipe was definitely different...it was sweeter like a sweet barbecue sauce was used. I mean it was still good but I preferred the old recipe.  The empanada de elote was good but felt cheap.  It's something I would have imagined ordering at a food truck for a couple bucks.  The tuna poke was not a traditional poke dish at all.  There were 5 pieces of a tempura like batter that was fried around a piece of avocado with the tuna sashimi sitting on top of it.  It was good, just not what I had envisioned.<br>Our waiter was awful, he kept disappearing for extended periods of time.  I felt bad for the couple sitting next to us because they were seated before us but got their entrees and dessert menus after us since our waiter was so awful.  <br>I ordered the arroz con mariscos for my entree and my boyfriend ordered the pork chop al pastor.  Our waiter never came back to check if we wanted to order another drink either, we had to flag the idiot down to do so.<br>The entrees came out in 5 minutes, and I know there is no way my dish was prepared in 5 minutes. I was similar to paella so normally that dish takes 45 minutes to be ready.  I'm pretty sure it was just sitting in the oven and they just scooped out a portion for me.  I've never had food from any restaurant come out so fast. It's worse than going to get microwaved McDonald's food.  My entree was okay.  My boyfriend did like his dish.<br>When the waiter decided to show up again he brought us dessert menus without asking us if we even wanted to see it.<br>On our way out, there were two hostesses just chatting with each other.  Neither one made the effort to thank us for coming like they used to.  <br>What happened?? What happened to the Carnivale I used to love?? I am never coming back to this place!", "pics": null}}, {"review": {"des": "what a delish lunch today<br>my server luis was on point<br>i order<br>apetizer ropa vieja tiny crispy tacos<br>the bufalo shrimp po boy<br>drink whit coffee whipped cream and coffee beans<br>the javi's 3 leches<br>all so good<br>see you soon again", "pics": null}}, {"review": {"des": "I was there 2 days ago and I'm very disappointed about it, it's not worth it <br>We waited for more than 40min to get our food and the drinks were too small and really expensive... so definitely I will never ever going back to this place.. it's not about the money but the service wasn't good either.", "pics": null}}, {"review": {"des": "This place is just magical. The decor is so beautiful and it's always full of people. Great place for large groups. They also have so many fun cocktails. Price is very on point. <br>Their famous cotton candy cocktail is so good, if it's your first time there and looking for a good snap, order that one. If you are not into sweet drinks, the flaming cocktail is the way to go. <br>I attached some pictures from my last visit, but honestly, I've had almost everything on their menu and not once left disappointed.", "pics": null}}, {"review": {"des": "Great space for events! The short rib dish and chicken dish were the group's favorites. Carnivale also has a really unique decor which promote a nice ambiance. Would definitely return for a meal in the future or hold another event at Carnivale.", "pics": null}}, {"review": {"des": "Such a fun place! Atmosphere is everything here! We had 5pm reservations and weren't seated until about 5:20, that's my only complaint. <br>My husband got a flaming Margarita drink. It was delicious and fun presentation! I got the snowcone drink! Also delicious and fun presentation. This whole place is social media worthy! <br>The decor is festive, fun, eclectic and intriguing! My husband and I split a few appetizers. We had empanadas which were delicious and had some chips and guacamole. It's a large portion of guacamole, but you really can't ever have too much guacamole <br>We were celebrating my husband's birthday, so it was very nice that our waiter brought my husband the cotton candy and caramel popcorn dessert with a birthday candle! So nice and so fun!! <br>Highly recommend!!! Great for celebrations, small groups, large groups, and anything in between!", "pics": null}}, {"review": {"des": "Having come in here a few years ago w/a group of friends who didn't like the menu after we were seated & walking back out, 4yrs later IM BACK!!!! I met a date here and we had reservations for 830. Since I was 30mins early I sat at the bar and drank. I had a cotton candy martini which was good/different. <br><br>Once my date arrived we were seated and ordered more drinks. I had sangria the rest of the night. It was pretty good too! My date ordered the shrimp quesadillas, which looked tasty I didn't try any. I ordered the rack of lamb medium rare, he had the fish of the day the sea bass. It took our order about 45mins arrive and when it did everything looked great. So as we were eating his 2nd bite he noticed his fish wasn't cooked all the way thru. It was raw. He notified the server and they immediately whisked the plate away. The female manager came by, the cook himself even came by to apologize. They brought him some tacos while his food was remade.  He requested to have his entree prepared to go because he was full from the 2 apps and drinks and it had been an hour. They removed the fish from the bill. They also provided us cotton candy and offered other desserts, but we were STUFFED!!! <br><br>This is how a restaurant should compensate when they mess up!!!! They should own their shit and that's exactly what they did!!!!! Kudos to them. I will definitely go back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fqWuShrM68peYnZCKZqePA/348s.jpg", "caption": "Cotton candy"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/L2WqCdtKafH2LSAVvBpGhA/168s.jpg", "caption": "Sea bass $32"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/t2fsvoa5iLghkaa6fN7X2g/168s.jpg", "caption": "Lamb rack $35"}]}}, {"review": {"des": "This place has been around for ages since  after the days of the \"drink\" night club over 15 years ago so have to give them credit for staying in business for this long with a humongous space. The ambience and setting is contemporary with a Latin flair, the service is good but I would not expect anything less at their price point.<br><br>The calamari, smoked trout dip, and the coconut shrimp are all rock solid appetizers. I have been there 5 times and each time tried the same entree, the Churrasco which gets my seal of approval but I promise that my 6th visit to Carnivale would hopefully result in a different entree.<br><br>I had the chocolate dome for dessert this time which it is a pretty solid presentation.", "pics": null}}, {"review": {"des": "They definitely have one of the best happy hour deals in the west loop, so I decided to bring my friend here after work. We had like 4-5 rounds of drinks along with 2 dozen of oysters, calamari, and the ropa vieja. I was super satisfied with their customer service this time around. Not sure if it's because we sat at the bar area, but I had an amazing time. We were here for almost 3 hours just chilling and eating. They have half off appetizers which were calamari, ropa vieja, empanadas, guacamole and chips as well as $1 oysters from 4:30-6:30 Monday-Friday. For drinks special, they have $5 mojito, sangria, and margarita. Their sangria isn't super sweet and their mojito was just amazing. I will definitely be back for happy hour!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tNOEQhD5O30WLtRT5FTeyw/348s.jpg", "caption": "Ropa Vieja"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZdNPwjT4_wzrjk-jzaDzVg/168s.jpg", "caption": "Happy hour calamari!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eE1XRAwNgnuufmdhkK8UkA/168s.jpg", "caption": "$1 oysters during happy hour"}]}}, {"review": {"des": "Atmosphere is nice, no show when we came on a Saturday evening, so disappointed in that. <br>The food is good but $27 for a pork chop with bland plantains is a little out of touch with reality.  The corn is good but again overpriced for one stalk. <br>The guacamole is good but nothing spectacular. Apparently you should just get several orders of the coconut shrimp and just eat that.<br>The bartender was excellent and the pour was generous. Drinks were good. <br>This was a been there, done that, kind of place for me. Check the box and move on. Honestly, I think it's overpriced and will not be returning. But, that's just me. I wasn't overly excited about it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZW_ErBk51pos5Bvf7592cg/348s.jpg", "caption": "The Mexican corn you get one cob per order."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/F5IQYSg8ZQEEM93YG98AAQ/168s.jpg", "caption": "Seafood dish. Mostly rice."}]}}, {"review": {"des": "Went to the Back to School brunch with my son and husband.  The service was amazing the food was<br>Delicious and all of the activities that where setup for the kids and families was sensational!<br><br>Thank you for the wonderful experience!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Bg95GJcZb049qtnzCtVnAQ/348s.jpg", "caption": "Smart as a Fox this one is!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tKkZgHClb6pXIrXLrJjr8w/168s.jpg", "caption": "Face painting made my little guys stay!"}]}}, {"review": {"des": "I think I have been here three times. One of the times was with my niece and we had a spectacular view of the whole restaurant from a mezzanine seat. If you are hungry but also looking for some good flavors and ambience, this is your place!. <br>I cannot describe it. The colors, the art deco, the fantastical pieces, and the huge portions. Amazing. Like it.<br>Recommended.", "pics": null}}, {"review": {"des": "Went to Carnivale for my son birthday and I was pleasantly surprised with the quality of food and service.  We were fortunate that the Carnival was participating in restaurant week so we took advantage of trying different entrees. The vibe was upbeat, the waiters were on top of their game.  <br><br>For the appetizers, we ordered the coconut shrimp, grilled octopus, and the pork belly tacos.   All were excellent.   My favorite was the octopus.  For our entrée my husband ordered the short ribs, my son ordered the skirt steak and I had the salmon.  Again, everything was excellent and prepared exactly as we requested.", "pics": null}}, {"review": {"des": "Deeply disappointed with the food.  Took my wife on our 1st date night in months.  The place has a colorful decor, but that is the only good thing that I can say about this place.  Ceviche is my favorite appetizer, and it's the 1st item that I order at restaurants. For appetizers, we ordered the ceviche and the Ropa Vieja.  The ceviche only had shrimp and was like a shrimp cocktail on a plate!  The shrimp was too sweet and was covered in a red sauce that was not good at all.  If I wanted a shrimp cocktail I would had ordered one.  The Ropa Vieja looked great, but the taste was disappointing.  The meat tasted like it was over cooked and spices where added to make the taste acceptable.  <br><br>We shared the Arroz con Mariscos plate.  The dish was decent compared the appetizers.  Can only taste the rice.  I felt like I was eating rice which was heavily spiced but no seafood flavor.  For the price and taste the dish is awful compared to other restaurants.  Other restaurants have similar dishes which are more rich in flavor at half the price.<br><br>This was the first and last time coming to this place.  I recommend to stay away unless you don't care about overpaying for disappointing food.", "pics": null}}, {"review": {"des": "Big Fan. Its especially good for groups. We came here with some out of town friends, we thought we'd show them a fun environment. The atmosphere is so fun and the service is great. FYI on Fridays there are acrobatic shows. I would definitely be interested in returning. For the food I think from reading some previous reviews its about ordering right for you and your group. Our waitress was very helpful with that. Drink wise I had the blueberry snow cone, so good! I know most people get the cotton candy martini but I would definitely recommend the blueberry snow cone if you want to venture away from that. <br><br>Food wise we had the ropa viejas, you get 5 small appetizer size tacos. The meat was flavorful and tender. We also shared the tackle box among the table. The seafood was fresh and delicious, even the oysters (I'm not always a fan of oysters). As for the ceviche I definitely think the blue crab and shrimp ceviches were better than the mixto. I know some people weren't a fan but as someone who love ceviche I think I've had better mixto ceviche. We also had the churrascuro which with the waitresses recommendation was cut into pieces so we could each try a few bites, tender and well seasoned. Lastly we had the Arroz con Mariscos. It was good but eclipsed by the other dishes (mostly because they were so good). <br><br>Dessert! Must try the molten chocolate. Dessert and a show. It was so good!! The mousse with the chocolate shell and raspberry sorbet were a great combination.", "pics": null}}, {"review": {"des": "I absolutely love Carnivale. I had dined here a few years ago and loved the whole night- I recently got the chance to go here again. My friends and I decided to have a nice celebratory meal to end the 2017 year and dined like royalty at Carnivale. We enjoyed a nice show with our meal too! <br><br>Though quite expensive, the service, atmosphere, and food pays for itself. We started the meal with some drinks, guacamole, and ropa vieja. My margarita was refreshing with the spicy guacamole and the delicious ropa vieja tacos. I got the Blue Fin Tuna for my entree, though small was surprisingly filling as there was also deliciously tender ox tail beneath the few pieces of tuna. The tuna was also delicious and amazingly cooked as well. I wasn't a fan of the puree, but the rest of the dish was scrumptious. I would suggest ordering something else though for those with a bigger appetite. I also got a bite of the arrechera skirt steak, which was much more delicious than the skirt steak I had gotten at a different restaurant the night before. It was so tender and juicy. The peruvian chicken was also an excellent hearty dish. <br><br>Overall, we had such a fun experience here that was well worth the night out. Especially on a special occassion, Carnivale is always the best pick!", "pics": null}}, {"review": {"des": "This is my favorite restaurant of all time! I come here all the time with my best friend and family. The colorful and cheerful ambiance makes it perfect! The Latin background music is awesome. Last night we celebrated my birthday with ten people. Everyone left satisfied, happy and super full. The Paloma's were delicious and I'm super picky with my drinks. <br>For dinner, we ordered the paella, arrachera with rice and black beans, pork chops, and halibut. Appetizers were avocado stuffed with crab, tacos with ropa vieja, and octopus. We literally stuffed our faces. The chimichurri sauce is to die for! I love coming here!!! At the end of dinner, we even get cotton candy. The service was fast, waiters never left a glass empty and the staff was all friendly.", "pics": null}}, {"review": {"des": "This is a prominent restaurant of the West Loop area that I'd never been to before, and have always meant to try out. It's very large (a free-standing, two-story building that can accommodate private parties up to 1000 people), with huge, colorful exterior walls and billboard-style signage right along the highway. My wife and I had an early dinner here Friday with reservations I made earlier in the day on Open Table. Immediately, I was interested in the seafood tower, but our waiter told us it would not be enough to eat and it was only an appetizer (that costs $100). So I opted for an order of oysters as an appetizer, and the scallops entree. I love oysters -- and I've had them at dozens of restaurants in the city -- and these were just so-so. Nothing special; I wouldn't order them again. Everything else was great -- we loved the ropa vieja appetizer, the steak was good, and the scallops were delicious. We also had a special funnel cake dessert that was good. The beer menu was pretty boring -- Blue Moon, Bud Light, Coors Light. For what we got, I felt the dinner was expensive -- around $175 with tip for a dinner for 2. The food was good, but I probably wouldn't go back given the price point and other dinner options that I like more.", "pics": null}}, {"review": {"des": "Absolutely wonderful and colorful ambiance especially on a Friday night out on the town. The wait here is expected so its best to have reservations unless you're willing to sit in the lounge which isn't bad at all......AND NO WAIT. <br><br>I've been wanting to try Carnivale again because if I'm quite honest the first time here did not leave an impression. That was years ago so decided to stop by during Restaurant week and wow was I impressed not only with the great, knowledgeable, and honest waiter we had but the food and drinks were all great. From the Arepa, to the Peruvian chicken, to the chocolate with guava cheesecake. Just exquisite!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ToySoAj7h9pqF2Cl5F9fow/348s.jpg", "caption": "Peruvian Chicken with potatoes"}]}}, {"review": {"des": "I was so excited to have dinner at one of my favorite restaurants in Chicago. I ordered my old fav, the ropa vieja and I was quite disappointed. This menu item is now served like mini tacos...that's a negative for me. I was in a party of six, each of us ordered different menu items none of which impressed anyone. <br><br>They've traded in well seasoned and decent plated food for trendy and lackluster items. <br><br>*This is an updated review. My initial review several years ago was 4 stars.", "pics": null}}, {"review": {"des": "This review is for Carnivale's appearance at the 4th Annual Mac and Cheese Fest at the UIC  Forum on Nov 4, 2017.  They presented this amazing mac and cheese cake pop that was to die for.  I must have eaten 10 of those things!  If this is not on the menu as a dessert, it need to be!<br><br>Well done on presentation and originality.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gyoeQT2Xlf49YrtIO3ZB1w/348s.jpg", "caption": "Mac and cheese cake pop entry at the 4th Annual Mac & Cheese Fest (UIC Forum)"}]}}, {"review": {"des": "The year was 2018. The interior was like a Cuban fiesta, the people were hot and Latin. My steak reminded me of a Texas ranch, 1909. I was enthralled by the depth of flavor and presentation of the dish.  It really helped my keto. Don't pay $17 for the \"large guac\" its a medium guac at best. <br><br>P.S. They give you hot towels with lemon tops to wipe your hands so that was neat.<br><br>My name is Ledio.", "pics": null}}, {"review": {"des": "We made a reservation to celebrate our 1 year anniversary here. Once we arrived we took some pictures on the camera they had up front ,sadly these never got emailed to us :( , we walked up to the host stand and were seated right away. It was early on a Sunday evening so it wasn't too busy. We sat down and were greeted with a friendly smile. We placed our drink orders, I ordered the flaming margarita, it was delicious and the presentation was so cool! We choose to start off our meal with the coconut shrimp, which were delicious and perfectly crispy! For my meal I ordered the salmon with a mexican achiote marinade which was tasty. I don't typically order salmon while out for dinner but really had the craving this night, and it was very well balanced! Because we were celebrating a special occasion we decided to get not just one dessert, but TWO! Oops! We got the coconut cake and the chocolate dome! The presentation on the chocolate dome was spectacular, but both were so good! We also ordered the lemoncello sampler to finish off the evening! After placing our dessert order, our waitress was so sweet and brought us champagne as we were celebrating our anniversary! So thoughtful! Can't wait to come back again!", "pics": null}}, {"review": {"des": "This place is huge! Probably most suitable for a birthday celebration because of its festive decor and fun desserts. I was having hard time deciding what to order as nothing was too appealing on the menu. I ended up ordering two appetizers as my meal Ropa Vieja and Tacos del pescado. We also ordered oysters which were super small in size. My food was ok, nothing to write home about. I enjoyed our server but taste and presentation of the food  were really lacking and it made me feel like I ended up yet in another Chicago tourist trap. I will probably not be back even thought I live within walking distance", "pics": null}}, {"review": {"des": "Went for dinner with my girlfriend yesterday and we thoroughly enjoyed it. Our server, Angel, was extremely kind and knowledgeable. Sometimes you wonder if a server is only recommending something for the sake of making the bill more expensive, but Angel did the exact opposite. He gave us helpful descriptions of dishes (explaining components we weren't familiar with without us having to ask) and you could tell he genuinely liked the dishes he recommended. He checked in on us without being overbearing, our waters were always full without us noticing, and food arrived in a timely manner. What more could you want?<br><br>For cocktails I got the Paloma (you can get it with mezcal for an additional $1.50) and my girlfriend got a caiparinha. Both were refreshing and not overly sweet.<br><br>We then got the daily ceviche (which was shrimp when we were there), the octopus, and ropa vieja as appetizers. Don't sleep on the ropa vieja it is a MUST while youre there. The octopus was cooked perfectly and whatever dressing they use on the greens should be bottled and sold in supermarkets... please. The ceviche was pretty good as well but not as stand out as the other two.<br><br>For mains I got the daily fish special. A whole branzino with parsnip puree and roasted veggies that I finished in under 3 minutes while my girlfriend got the churrasco that was extremely tender.<br><br>By some miracle we were able to fit the cuban cigar dessert in there too and the smokiness of it was super delicious.<br><br>Angel also brought us 2 glasses of free champagne and a cotton candy/caramel corn contraption on the house because we were celebrating our anniverary (as if he wasnt great enough already) to top it all off.<br><br>Can't wait to go back and do it all again.", "pics": null}}, {"review": {"des": "Each time I eat at Carnivale, it's with a huge Corporate function where the entire space is rented out and used like a giant holiday party venue (500+ people). And each time, the food was not memorable. Last week, I had a chance to experience the sit-down and be served 3 course lunch -- also corporate sponsored, but in a much smaller scale (14 people or so). I made mental notes of each of the following dishes I tried:<br><br>APPETIZERS:<br>Guac and chips (7/10)<br>Cesar Salad (7/10)<br>Ropa Vieja (6/10)<br>House Ricotta (6/10)<br><br>ENTREES:<br>Arrachera - the famous skirt steak dish (8/10)<br>Peruvian Chicken (10/10)<br>Tacu Tacu - vegetarian lentil rice dish (10/10)<br><br>DESSERTS:<br>Carnivale  Cotton Candy (8/10)<br>Javi's Tres Leches (6/10)<br>Carnivale Ice Cream Cake (6/10)<br><br>Normally, restaurant are very good at appetizers and it all goes downhill with entrees, but not at Carnivale. The appetizers were all mediocre and lacked the originality and flavor pizzazz to keep people munching while waiting for entrees to arrive. Ropa Vieja and House Ricotta sauces were a bit heavy handed on the sugar which masked the flavors of the beef and ricotta cheese. The guac and cesar salad are nothing to write home about. <br><br>However, the entrees were fantastic especially the Peruvian Chicken and Tacu Tacu. The chicken was juicy, skin was crisp, and very flavorful. The lentil rice cake and bok choy with pea curry was excellent and very original. Skirt steak was marinated and grilled to perfection! I wasn't crazy about the overly sweet bed of rice that held the steak though. <br><br>Desserts flavor-wise were not my style. It's all overly sweet. I just had one bite and moved on. <br><br>A number of folks bashed the service or their servers in their reviews, but the servers that worked on our table did a fantastic job of making sure we got everything we needed and was appropriately attentive. <br><br>Will I come back on my own dime? Probably not, but at a corporate event, I know to save the caloric budget for the entrees and skip the apps and dessert!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yol8-JtKb10CQ4YWbw6A3w/348s.jpg", "caption": "Carnivale ice cream cake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KD_95TGK1uXb1Vw_qnsIAA/168s.jpg", "caption": "Javi's Tres Leches"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GT8o7zg_aLaNQt4r8v2Qsw/168s.jpg", "caption": "Cotton candy and caramel corn"}]}}, {"review": {"des": "Service has gone down the drain here. I used to love it here but I was thoroughly disappointed with the service and portion sizes. It took forever to eveb get acknowledged at the table. Then when the food finally came my mushrooms and grits were cold, so i had to send them back. Raphael stated he'd have the food \"warmed up\"...didnt sound appetizing. Then qhen the bill finally came it was double charging me a service charge. So the bill was $113 + 20 service charge +11.20 service charge. I spoke to Raphael about it and he said he didnt overcharge me. I then had to make him look again at the bill for him to get the manager who didnt come to fix it. My party of 14 slowly left the table leaving just me, by myself there. Then louis the manager finally came, after I complained about waiting 20 minutes. I then received the check with just the 11.20 off the bill. For all the inconvenience I would have expected some sort compensation or a REAL apology. This is unacceptable. I celebrated my 21st birthday here,had a company dinner here for my husband with wolverine trading company, and have been here for numerous occassions and have never received such awful treatment...once I got my bill the manager louis was dancing with the bartender as the restaurant was closing. I'm glad he was in a great mood while I was so inconvenienced.", "pics": null}}, {"review": {"des": "Second time for me to visit this place for take out and it isn't worth it. <br><br>First time in 2017 on Mardi Gras day. Placed a take out order via the phone to be ready at 1 pm. I arrived and the orders hadn't even been entered. The hostess tried to down play her error and act silly. The bartender berated me. Finally a kind waiter stepped in and placed my order and brought it to the attention of the management.<br><br>Fast forward to Aug 2018. Placed my order at 12:11. Dining room wasn't crowed and only ordered a simple sandwich. At 12:30 I asked how long would it be. The hostess goes to the bartender, flirts with him and then comes back to tell me \"they want to fill the dining room orders first then we'll get to you\". Never told me how long I would have to wait. <br><br>Waited five more mins and asked if she could ask the kitchen how much longer, because I did not want to wait an hour for a takeout sandwich or have to make up an hour lunch break. The bartender berates me again! But no one could tell me if I had to wait five, ten or 15 mins more. Fed up I walked out. <br><br>Management get better staff or they will certainly drag your business into a discrimination suit.", "pics": null}}, {"review": {"des": "My friends brought me here for my birthday dinner, and I'm glad they chose this restaurant! Our waiter Gustavo had the best costumer service I had in a while. The food was delicious as well.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Yoo3IGbKmrYoZWAqbzloSA/348s.jpg", "caption": "Birthday treat"}]}}, {"review": {"des": "Excellent Service and food. 2 dined and got in and out in 1 hour. We ordered the calamari which had a sweet and smoky flavor. We had plantains, paella, and steak and potatoes. The service was incredible. We got a reservation through open table and got in easily. It was super busy for a Friday. What a fun atmosphere. I would definitely go back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ysgxQh5-WazvpwzVjr7zqw/348s.jpg", "caption": "Steak"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9Ca9IV_7OetPOXqMUY5ZtQ/168s.jpg", "caption": "Potatoes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/n4dsC8V0lPy6JOafqt2JMA/168s.jpg", "caption": "Seafood Paella"}]}}, {"review": {"des": "Cool decor. Waiter was very intrusive on my conversation with guests. Would continually interrupt. Also, I don't eat pork. I asked to substitute the pork in the fried egg sandwich with steak which other sandwiches have  and he said I can't do that. Confused really. <br><br>Brunch doesn't have good drink deals.", "pics": null}}, {"review": {"des": "Love the vibe at Carnivale! The decor and ambiance of the restaurant is captivating and unique. We went here on a Monday night for my graduation dinner and was seated immediately. Everything we ordered were delicious! We tried the avocado crab Louie for appetizers, pork chop al pastor, and Peruvian chicken all very much recommended. They also served complimentary organic cotton candy since celebrating a special occasion. Very much recommended and I can't wait  to come back for brunch and when live music is available.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5wKN1IMm6-4nE-fBFItmCQ/348s.jpg", "caption": "Avocado Crab Louie"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dONkF4c2w5ahMSRJ_5npKg/168s.jpg", "caption": "Flaming Strawberry Tequila"}]}}, {"review": {"des": "Carnivale is full of color! All of the furniture is bright red, green and blue to remind you of being at a circus, their signature drink is even a cotton candy martini. The idea for the restaurant is great but the service makes me not want to come back (except maybe to see the show, which we missed). <br><br>The first thing that was odd about Carnivale was that our party could not be seated until everyone had arrived, even though we were a party of eight only missing one person. It seems absurd to me that we would be forced to stand around when there were plenty of empty tables. I understand if only half of the group had arrived, but waiting for one person, really? And we had a reservation!<br><br>My biggest pet peeve is being pressured by servers. The second that we sat down (after the long wait), the waiter asked to take our drink orders. We weren't ready and asked for more time to look at the menu. When he came back he took out drink orders and wanted to start us off with some appetizers and appeared frustrated when we again asked for more time. We came with a big group to enjoy a meal together and socialize and should not have been rushed out of the restaurant. It wasn't even to capacity and we were continuously hounded to order the next thing. We were in and out of the restaurant in under an hour. Disappointing.", "pics": null}}, {"review": {"des": "Things you should know about this place, it's a fun place (vibe, music, decorations, there were 2 (pretty) quick \"shows\" as entertainment) and it's pricey. So if you're willing to accept the later because of the former, you may find what I have to say, \"useful\"...<br><br>The guacamole was ok, not the best I've had so if you feel that because is a \"latin\" place you must have it, great but I would get the ceviche, we ordered some \"Coconut ceviche\" or something like that (I know it was served on a coconut and it came with coconut water, which was randomly placed by the server next to the ceviche, he did not explain what was that for. Should I drink it? Pour it in the ceviche? Ignore it?. I'd have appreciated some guidance. Or maybe it's really obvious and I'm a ignorant, who knows), anyways what I was trying to say, the ceviche was good!. <br><br>As entree I got the lechón asado, it came with chicharrón (it had been a while since I last ate chicharrón, that's great). The lechón was good, tasty, nicely cook, no regrets. <br><br>Drinks, I got a couple of caipirinha. Which I think were good, I enjoyed them. It's definitely a fun place, I would give it a try you can have a good time there.", "pics": null}}, {"review": {"des": "Taking costumers and partners out to dinner is one of the best parts of my job! Especially when Melissa is paying for it  This place has a great vibe and one might think the food would be just ok but they'd be wrong. In addition to a really fun atmosphere, the food AND service were fantastic! They catered to everyone's needs to a T!", "pics": null}}, {"review": {"des": "While visiting Chicago, we asked for some gay friend referrals, as myself and my girlfriend were looking for a nice date night spot. Someone suggested this gem of a place, and it did not disappoint. This place has a lot going on, but that is what's so charming about it. Upon arrival you see it's the most colorful building on the block, and it's even more colorful inside. This place is HUGE, several floors and bars as you walk in, just before you go to the main dining hall. The decor is opulent and colorful, and the music festive. You see everyone from large groups, intimate dates, folks dressed looking like they are on their way to a ball and others just for a night on the town. It was very cute and sexy!<br><br>The food and drinks were amazing as well! Both of the mixed drinks we ordered were tasty and boozy, and as a pescatarian, I found several options. I had the coconut shrimp, one of my all-time favorite dishes, and must say it was some of the best I've ever tasted. For main course I opted for the vegetarian meal (I don't remember what is was) And my date opted for the salmon. Both of us cleaned our plates! The highlight of our night was dessert, a Cuban cigar shaped dessert with ice cream! It's was so unique and the presentation was great. The service was great and everyone was extremely friendly. Check this place out!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/g9aez5x6diqkqlnesrLtaw/168s.jpg", "caption": "Beyonce!"}]}}, {"review": {"des": "Had a fantastic experience! This was my second time dining at Carnivale and it was even better than I had remembered. We had a 7 p.m. reservation and were seated right away. The branzino, flank steak and pork chop entrees were all phenomenal. The fourth entree in our group was the salmon which was just average. Shortly after we had finished eating they advised us that an aerialist and magician would be doing brief performances. What an exciting end to our evening! <br><br>For visitors of Chicago I highly recommend Carnivale for a unique and fun dining experience.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2BbTclOzOgQIv86UTV9rzQ/168s.jpg", "caption": "Aerialist - June 1, 2018"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tzFZMzUi1i6slZemuuw4_Q/168s.jpg", "caption": "Branzino - the perfect entree!"}]}}, {"review": {"des": "Short version: the food was decent, of a group of 12, we all liked what we'd ordered.<br><br>Overall, I'd say it was good for a splurge celebration dinner, based on the other diners: several who were clearly there on A Date, but also a family with two little girls (maybe 8 and 6) who were having the time of their lives. (I'm guessing the restaurant provides a cotton candy/caramel corn dessert for anyone celebrating their birthday. The little girl's came complete with sparkler; how exciting! (no, really.))<br><br>That said, the noise level was unpleasantly high--I had difficulty hearing the waiter, much less others at my table. The decor was flamboyant, to say the least, sort of a cross between Peppermint Lounge and psychedelic bordello, but that's neither here nor there.<br><br>I came with a (community college) school group, on a trip from SW Michigan; this was the choice of the group.", "pics": null}}, {"review": {"des": "My cousin wanted to come here for her birthday on yesterday. So, reservations were set in place for 8 ppl. <br><br>FYI: Please make sure that everyone arrives at the prompt time for your reservations. You can not be seated unless your whole party is there on time. Respected the policy and your party. That way no one is waiting for you to be seated. <br><br>After about 15 minutes pass our time waiting for 3 ppl to arrive. A kind gentlemen came out and said we didn't have to wait. He would allow us to be seated. That was nice of him. He walked us to our table and pulled out our seats. <br><br>By that time our waitress walked over to see if we were ready to place our drink order. We ask that she give us a little more time. She came back with glasses of water for our table.<br><br>Within another 10 minutes the others had arrived and by that time we had placed our drink order. <br>Our waiteress was very patient attentive and nice. I give the 2 stars for our amazing waiteress and the ambience of this place. The decor is a theme of a circus but prettier. They have nice big colorful comfty chairs. Just the whole atmosphere is lovely. The music was great. There was never a dull boring song playing in this place. The prices are a bit pricey for the food and drinks. I really didn't care too much for my chicken. It was a different kind of chicken. I never had a flat breaded chicken before and there was no flavor. The waiteress was kind enough to let me and another person exchange it for something else on the menu. I ended up with the ribs. It was a little better than the chicken. But I wasn't impress with their food. The corn on the cob was delicious. <br><br>After we were wrapping up our meals. The waiteress came out with a nice vase of caramel corn popcorn with a stick of pink cotton candy for the birthday girl. Yeah. <br><br> <br>Overrall its a very beautiful place to come out and enjoy a nice day or evening. Since I'm a very picky eater.  It just wasn't my type of place to eat.<br>But the staff and decor of this place is unbeliveable. Its worth coming out to experience a great adventure.<br><br>The extra star was for the outside patio", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kVDKs_2JjWKAcaK34Eg4ag/348s.jpg", "caption": "Birthday Pose"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3vVc6zs5njWz0sdJ_3oJ4Q/168s.jpg", "caption": "Birthday Cotton Candy For The Bday Girl"}]}}, {"review": {"des": "Food is incredible. Service is incredible. Turn-around time is incredible. Atmosphere is incredible. Drinks are incredible. Deserts are incredible. Just experience it!!!", "pics": null}}, {"review": {"des": "I have been here twice for business lunches.  One was in the smaller upstairs event space for a seated buffet lunch. The guac starter is good, and there were taco-esque choices and salad for the main courses. These were delicious, although a little risky to eat at a business lunch. <br><br>The other time I tried the skirt steak entrée, which at medium rare is delicious. I will be back just to eat it again! People also seemed to really enjoy the ropa vieja starter, but I found it messy and a little sweet. Service is a little slow, but theres lots to look at to kill time!", "pics": null}}, {"review": {"des": "Amazing  food! Great variety! The Friday  entertainment is so fun! Perfect  for  dates and celebrations!  Try  the flaming  margarita!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/naY0NLxpqp8K_vRKn7uNjg/348s.jpg", "caption": "Delicious salmon with black pearl rice!"}]}}, {"review": {"des": "Pros:<br>- Fresh food<br>- My favorite lamb shank. Fresh, spicy guacamole (but unfortunately, they don't make salsa)<br>- Cute, fun vibe and decor. Matched by cute and flamboyant desserts<br><br>Cons:<br>- They dropped the lamb shank from the menu! It was their best menu item :( And it was only $30-35", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/leQ2jMtJsDMlFvotNFDCow/348s.jpg", "caption": "Scallops"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-UQIs7IN37FjwHooz4xiWQ/168s.jpg", "caption": "lamb shank. amazing"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RsBmZIj90DwCnLwtu4AcRw/168s.jpg", "caption": "Organic Cotton Candy. fun!"}]}}, {"review": {"des": "Surprisingly I have never been here. This past Saturday was my first time at Carnivale. I went with a few girlfriends for a girls night dinner. We had reservations at 7:30 and were seated once we all arrived. <br><br>Our waiter came by and asked if we had been there before, talked through the menu and recommended some items. He also asked if we were from out of town ( I was a bit concerned because I am not a fan of \"touristy\" restaurants). My friends ordered Sangria and I went with the Pisco Passion ( DELISH!!! Highly recommend if you like tart drinks and passion fruit). <br><br>For food we ended up getting a handful of appetizers to share ( most of which the waiter recommended) <br>-coconut shrimp <br>- Ropa Veija <br>- Baked Goat Cheese<br>- Tuna Ceviche<br><br>Everything was YUM YUM YUM, but I would say skip the goat cheese. Everything was super flavorful (minus the goat cheese), fresh and overall delicious. <br><br>We finished our dinner off with dessert ( I am not a dessert person but everyone around us was ordering dessert so I gave it a go) We split the Chocolate Dome and holy ^&*( it was life changing. I am drooling right now thinking about it. IT WAS PERFECTO! I cant wait to come back", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6_NFUYDQ26wAibW3fdZvoA/348s.jpg", "caption": "Baked goat cheese"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7p-AHsXHCQ-1jrjc2eseeQ/168s.jpg", "caption": "Coconut shrimp"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sH6cmi6Mb_DpFMzRm1Okpg/168s.jpg", "caption": "Ropa veija"}]}}, {"review": {"des": "Many thanks to Carnivale and staff for a 50th birthday brunch celebration that I will never forget!  Living right around the corner for the past 12 years I have many fantastic experiences visiting Carnivale Restaurant.  The delicious food, the crafty cocktails, the amazing varied entertainment, the gracious service, and the spectacularly festive interior design..... EVERYTHING is always on point!  For that reason, I had always dreamed of hosting an important event in the fantastic space.  <br><br>I was impressed by what a meticulously tight event/catering operation run by Carnivale.  They consider every detail, deliver it with a hospitable hand, and wrap it up in a whimsical package. Sales Manager Serena was professional, informative, patient, and accommodating .... And responded to texts or emails with startling super-human quickness. Our bartender Eddie was friendly, jovial, attentive.  He always had a smile on his face.  The waitstaff ; Erica, Yadira, and Ernesto were attentive, gracious, and accommodating.  Even manager Maria came to ensure guests were happy.<br><br>Carnivale surely orchestrates many events bigger and more expensive than my little party ..... But kudos to them for diligently working within my modest budget while still furnishing a stunning 50th birthday brunch experience.  My friends were all quite thrilled..... And I was made to feel like the most important person in the world.", "pics": null}}, {"review": {"des": "It's a beautiful restaurant with wonderful decor, that's the only reason why it has two stars and not one.<br><br>I took my family for a Christmas Eve dinner and was very disappointed in both the service and food. My mom has a food allergy that every restaurant has been able to accommodate except for this one. So much so that the chef came out to essentially tell my mom there's nothing she can eat from his menu and would not remove the ingredient from the seasoning because \"that's the way we prepare it\"<br><br>She ended up eating the salad that was supposed to have dates, tomatoes, and cheese. It had one date (we counted) two cherry tomatoes (disproportionate to the huge bowl of greens) and no cheese.<br><br>My dad had the pork and he had to take his blood pressure medicine right away because of how salty it was. The potatoes had a disgusting texture and an odd flavor I can't describe.<br><br>The ropa vieja was fine. Nothing to write home to. I think the chef didn't like that I asked for no onions and decided not to put the sauce it was supposed to come with. <br><br>The cigar dessert...cool to look at, could not eat it for the life of me. The cake was soooooooo sugary, cold, with a grainy texture. <br><br>Finally the service was just not great. Oscar, our waiter, was quite rude to us to the point that he seemed like he didn't want to work that night. He took a condescending tone with my parents and I had to take over the conversation and essentially dismiss him.<br><br>I never write reviews, but in my 10 years in Chicago this has been by far the worst experience at a restaurant. I eat out quite a lot, so my frame of reference is large. Wouldn't recommend.", "pics": null}}, {"review": {"des": "Lovely place  to go with family and friends and good food highly recommend <br>I loved Lamb shops ...try the Cuban sigar dessert  very good", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RZNL4qIeTIbNSnFF6Hf1IA/348s.jpg", "caption": "Cuban sigar &vanilla ice cream"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WcjCCqkymjTcDy25rU-PUA/168s.jpg", "caption": "Cotton candy for birthday"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-vH7Qsnd0HnnlFWLnvpBbg/168s.jpg", "caption": "Cuban sigar was my favorite and lamb chops awesome"}]}}, {"review": {"des": "It's such a colorful place. I was kindof expecting more but there are dancers that come around once in a while and sing. I had the Peruvian chicken. It was a little dry. There are so many gluten free options. It's a perfect place to go for a new experience, but it is a bit expensive.", "pics": null}}, {"review": {"des": "CARNIVAL Restaurant April 14, 2018 <br>Music and food- food and Music combine with Roc, a wonderful early evening of dining.<br><br>We started with the photo booth and then finding a table. From a wall for two, to a balcony for two, we are ready leave, and Roc point to a table on the main floor. Away we went.<br><br>The appetizers were very good although the calamari was very good, not hot. The guacamole was very good <br>GUACAMOLE  Chunky avocados, cilantro, chilies, onion, garlic, lime, fresh corn chips<br><br>also without the tomato cumin,and onion that graces our guacamole at home.<br><br>The conversation with Maria was over the top.<br>We talk about Red Light, Vivo(17 years) and Marché former restaurants on west Randolph.<br>She worked at all of them.<br><br>Then we speak Tim Griffin the general manager about the decor that reflected Red Light. The ceiling in the main area is 25-30 feet.<br><br>The main course was a real dining with <br>Baby kale, house-made caesar dressing, gochujang paint, sourdough croutons, shaved parmesan cheese  kale Cesar salad <br><br>Leonard had rack of lamb (Wood-grilled lamb rack, pastel de yucca, lamb ragout, butternut squash, Closed Loop Farm greens).....<br><br>Now to the end the meal was the key lime pie.<br><br>To top off the night Brandon Ramsey knows my neighbor for high school .....<br>Brandon worked with use to find the table ..<br><br>We will reruns with the posse .....<br>The music really move the event.... the music was high energy.....<br><br>This was a wonderful, uplifting , and great time..<br>Woooooooow...<br>Shalom", "pics": null}}, {"review": {"des": "I  loveeee cotton candy martinis! When I searched what places in Chicago have them , I came across Carnivale. The restaurant is really pretty & chic! <br><br>Food: Appetizer -coconut shrimp  **NoT a Fan!** <br>Entree- lamb chops **3 chops , and comes with a mini baked pot pie style side filled with lamb & vegetables. Food was good, nothing I would  rush back to eat. <br><br>Dwanks: The cotton candy martini was delishhhhh! I had 3 and would have had another if I wasn't drunk ! <br><br>The place is really pretty & will lighten any girly girl type woman mood! This would be a nice \"girls night out\" spot just for socializing over cocktails . <br><br>Food: Nay <br><br>Dwanks: Yay !", "pics": null}}, {"review": {"des": "Wow, just wow! Carnivale was absolutely amazing! I seriously can't recommend this place enough. The food was delicious, the service was outstanding, and the entertainment was so much fun. I've always wanted to come here and now I can't wait to go again! My fiancé, family and friends had an amazing time and I couldn't be happier because of it. This place is really something else and I recommend everyone to at least try it once and then you be the verdict!", "pics": null}}, {"review": {"des": "Came here for my birthday dinner with my family. Awesome drinks and unique vibe. We all enjoyed our meal and would definitely recommend to friends.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mPTtSjePUeeLZAYTdO4ipw/348s.jpg", "caption": "Salmon"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/W_u_jrJk0Mj1waDDGMi4Kw/168s.jpg", "caption": "Peruvian chicken"}]}}, {"review": {"des": "My new favorite restaurant and I was only even in Chicago for a day before heading back to the Bay Area (after living in Boston for years). The veal/plantain/chili-like taco appetizer (\"ropa vieja\") was amazing and so many others looked delicious. The chocolate cake layered with apricot, pistachio, and red currant ice creams was incredible (and massive) and the Mexican hot chocolate was also great. Can't wait to return and sample the peanut buttter tres leches, the raw seafood bar, or speciality cocktails like the snowcone or cotton candy martini. <br><br>The ambience was as spectacular as the food- loads of quirky, colorful, pop-art decor and funky furniture. Also Lots of hidden little side-rooms that would be great for a larger group or private event. Seriously, I would fly back to Chicago just to eat here.", "pics": null}}, {"review": {"des": "Visual experience is a category I would place this restaurant in. The colors busted from every decored inch from the lights to the furniture. A well thought out plan design. The menu offerings were not one would of expected but they were fresh and planned with spices and herbs using the roof top garden and local vendors. We started with veal shelled in plaintains. The small taco shapes were flavorful and led more to a BBQ mixture. The shrimp Cerviche was full of new flavors to my palette but were pleasuring. The wow factor dessert is their presentation of thier cotton candy served with Carmel corn.It is fun for all.The only thing I would of liked to seen was more colorful music as the place screams RIO  but the Music was rock n roll mix?", "pics": null}}, {"review": {"des": "This is one of my favourite restaurants in Chicago! Every Fridays you have some special events! I love their food. We had fish tacos, some octopus dish - was too good, cocktails and Cuban Cigar dessert was also pretty good ! I love their ambience! <br><br>Near the restroom there's a boomerang machine. I think everyone must try that  Thanks again for that boomerang Alaaya and her friend. Hoping to meet you again next time", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/68BuNhFEncg6-CcymPlm9w/168s.jpg", "caption": "This was some Octopus dish and I loved this with the sauce :)"}]}}, {"review": {"des": "When here for my engagement dinner and they had a special show going on where they had a live saxophone players, flying trapeze artists and specialty cocktails and drinks.  Awesome time.  I've been here a bunch of times before for special events and drinks but never sat down and ate before.  So let's get to the food.<br><br>Food was delicious.  I order the lamb rack and it was cooked to perfection.  Tasty, flavorful and tender.  The only downside I wish it was more because I ate it in record time.  My fiance ordered the skirt steak and she raved about it as well.  <br><br>Only downside is it's a little pricey and can be crowded.  Absolutely get reservations and be on time as they will give up your seat if you are late.  But besides that, definitely one of the better restaurants in the area.", "pics": null}}, {"review": {"des": "Very nice ambience and cool place.  Food and drinks is pricey.  The food didn't really leave an impression on me.  We had the chefs special, lamb chops, and the calamari.  I really didn't like the calamari since it just tasted like it was fried and sweet and sour sauce was drizzled all over it.  If you have company or group of people and want to go for a fun place then this may be the place for you.", "pics": null}}, {"review": {"des": "I've dined at Carnivale a number of times for dinner, but only once for brunch (Easter Sunday) which this review is based on.<br><br>Service<br>* While I understand the place was packed due to it being Easter it took a little too long for our server to get to our table. When he finally arrived at our table his so so customer service approach had me thinking, \"Well he's not getting 20%!\" - 2 stars<br><br>Food<br>* We all split the croicinnaroll and it was a little dry. A little more icing would have made this better. Also, wish they had skim milk. - 3 stars <br><br>The side of homemade candied bacon was something we all got and it is delicious. - 5 stars<br><br>* I got the braised brisket skillet and it was just OK. The description on the menu was better than it tasted sadly. - 3 stars<br><br>* One of my friends got the chicken and waffles and she loved it and told me it was a 4.5 star dish so...that's what it gets.<br><br>* Two of my friends got the egg benedict and said it was good, but far from the best they've ever had. - 3.5 stars<br><br>All and all I think I like this place more for dinner versus brunch.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yQZakvwxpho5oJshYKubTw/348s.jpg", "caption": "Benedict"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kPXdib-OaWxqmCGnJHkCQQ/168s.jpg", "caption": "ChickenN' Waffles"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8qA53klvtOpuMbnEGb1Ygw/168s.jpg", "caption": "Braised Brisket Skillet"}]}}, {"review": {"des": "This place has really been hit or miss for me. I've come a small handful of times, and sometimes I love what I got, and other times the food is mediocre. <br><br>I've been for both brunch and dinner, and this place is really crowded whenever you go. A reservation is definitely recommended.  The atmosphere is awesome- super vibrant and colorful, and they've even had a band during Sunday brunch. However, if you're not one for a loud restaurant, I'd skip this place.<br><br>As for food, some highlights have been the Arrachera (grilled skirt steak), chilaquiles, and breakfast tacos. Things I'd avoid: octopus appetizer (VERY fishy tasting) and rack of ribs (cold upon arrival, dry, and too smokey in flavor). <br><br>Overall, with all the amazing restaurants in Chicago, it wouldn't hurt to skip this one.", "pics": null}}, {"review": {"des": "The atmosphere is such fun, there's always a performance going on. The empanadas are delicious and my friends loved the oysters. I tried the signature cotton candy martini and it's meh, nothing to write home about. I think the place is really about the colorful and lively ambiance.", "pics": null}}, {"review": {"des": "Came here for a graduation on a Saturday and it wasn't packed. Got seated pretty quickly. The waiter was kinda slow and didn't really do that great of a job. The food was good and with a reasonable portion size. I enjoyed what I got and I tasted everyone else's food and it was good as well. No complaints from me besides the price.", "pics": null}}, {"review": {"des": "Came here for dinner on a Wednesday night - we had reservations for 7:15 that we made an hour before. We were 15 minutes late (I'm brown, it happens) but they seated us anyway. <br><br>The dining area is absolutely beautiful. It's hard to get in pictures but the way this place is decorated is amazing. The bar area is also beautiful - I'd come just to sit at the bar and creepily people watch.<br><br>Our service was really awesome, the server recommended some great vegetarian dishes. We got the empanada de verde and the yucca gnocchi. <br><br>The empanada de verde was perfect - it come with an awesome sauce and there were so many mushrooms yum. <br>The yucca gnocchi was also really good - it was an interesting blend of flavors with the yucca, vegetables, and the tomato sauce. I would highly recommend.<br><br>We were too full for dessert which made me sad because everything on the dessert menu looked lit. <br><br>I would come because it's a Chicago thing to do, but I probably wouldn't come again unless I had people visiting in town just because my bank account can't afford it womp", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PpUIpcb4ICHdNHnpIACfcg/168s.jpg", "caption": "yucca gnocchi"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6zvpNxyWhEan5_5iw28wSA/168s.jpg", "caption": "empanada de verde"}]}}, {"review": {"des": "This place is great for celebrating and going out with family and friends (which is why we went there),the food is decent but doesn't reflect in the price, you would expect amazing food for the money spent. So keep in mind that you will be paying for what you see, not what you eat.", "pics": null}}, {"review": {"des": "I've always seen this place off the freeway, and it's looked like such a fun place to go! We had reservations on a friday night at 745, and were promptly seated when we got there at 730. First, this place is so vibrant and fun, I loved the decor! <br>We were seated up on the second floor, so I felt a little detached from all the hub bub below, but nothing that I was upset about. <br>To start, we got the octopus, which was more gamey/chewy than I was expecting. There was a sauce on it that made the octopus so much better though. <br>For entrees I ordered the scallops and the bf ordered the peruvian chicken. The scallops were cooked well, and came on top of a potato base which reminded me kind of a potato latke type thing. His chicken was so good, I honestly wished I had ordered it myself! We got a side of caramelized plantains that were honestly way too sweet for both of us. I think we both had one and thats it. <br>And for dessert we had, of course, the cotton candy and popcorn. I cant remember the last time I had cotton candy, it just melts in your mouth! <br>Service was okay, we waited a long time to order, and our server didnt come by very often so we had to ask a busboy to find our waiter so we could order. But overall not bad! <br>I would only come here on very special occasions. Its a fun place, but nothing that's super fancy.", "pics": null}}, {"review": {"des": "We had a stellar brunch experience here last weekend; I really can't sing enough praise for Carnivale. The food was DELICIOUS. There was also live music playing as we dined from the top level, which was a really nice touch. Even though it was just our typical weekend brunch (we like to try different spots), it actually felt like we were celebrating a special occasion without paying the premium pricing usually corresponding to those types of experiences. <br><br>I also couldn't believe it wasn't more crowded! The service was outstanding. The decor is truly unique and epic. Even the bathroom (and hallway leading to it) is cool. This is a great place with atmosphere for a date, a get-together with friends, OR a birthday! Definitely a great group spot in particular because it can accommodate the seating easily.", "pics": null}}, {"review": {"des": "Great spot for a family dinner. This is quite a cavernous spot and offers a wide variety of food with a cuisine I would escribe more Spanish influenced and American adapted/adopted.  <br><br>We started with the charcuterie and it was filled with some very nice meats and cheeses as well as the regular sweet and relish stuff.  It was a great way to enter...  We also ordered a few sides to share like the beets, goats cheese and a ceviche sampler.  The ceviche was well worth it and was extremely well put together.  The guacamole was also a treat.<br><br>Dinner was several dishes.  I liked the pork chop. Well cooked but tender. Lamb chops were a big hit too and were cooked the way we ordered and were also very tender.  The scallops were also a big hit although admittedly not something I tasted personally.<br><br>Will return", "pics": null}}, {"review": {"des": "This place is a picture takers dream!!! We visited here for the Father's Day brunch and it was Amazing! The food, the decor, the service, it was all superb! My daughter loved walking around and taking pictures by every cool, odd, and artsy thing in and on this building. We plan on coming back next time we are in town to have dinner and catch a show!", "pics": null}}, {"review": {"des": "Really looked forward to trying this place as this came highly recommended, however, after dining in, I just don't understand what all the hype is about? Came here with a group on a Saturday evening for dinner. The experience, including food and service, was average at best. I would rather spend my time and money somewhere else next time. There was absolutely nothing here that wowed me. Overhyped!!", "pics": null}}, {"review": {"des": "First time going there. Went with 11 other people. Though it was a Saturday night, we didn't lose our table after being almost one hour late as it was not too crowded. So I was wondering if it was any good but it was good.  It was a set menu for our group but it had a good mix of meat, seafood, and vegetables. The dish I enjoyed the most was probably their version of Queso de Cabra. The Ricotta cheese that they use is super delish. Mojito was really good too. <br>We had mix of cash people and card people but the waiter was very accommodating about it. <br>It is a casual place but I didn't see children or minors. People were dressed up (more than jeans).<br>I will go back!", "pics": null}}, {"review": {"des": "This used to be our favorite place to take friends to dinner.  We would typically drop $300 for four persons.  We ate here a week ago and the food was very disappointing.  My $45 beef tenderloin had a hint of liver taste, the guacamole, except for the hot pepper sliced garnish, was bland and boring.  Our one guest raves about her previous visit and the food she ate, but had no positive comment this time.  <br>The noise level has always been a concern.  No matter where your seated you almost have to yell to be heard by your table mates, and the waiter's recitation of the specials is lost in the cacophony if base beat.  <br>We are searching for a replacement", "pics": null}}, {"review": {"des": "This is a very fun place. I was amazed the first time i walked in with the decor, not something i was expecting! And its huge! Usually always a lot of people and excitement. We had the ropa vieja to start, delicious! I had the lamb rack and my husband the churrasco, all was delicious! The only reason im knocking a point is because the price was a little high. But a very fun evening with great food :)", "pics": null}}, {"review": {"des": "Came here on date night close to Restaurant Week and was not let down! <br><br>We started out with the ropa vieja (omg, yum.), then we BOTH got the chimichurri steak entrée! We ended up getting free dessert at the end since it was close to closing time and our server was f**king awesome :-D<br><br>Thanks, Carnivale!", "pics": null}}, {"review": {"des": "This in my opinion is the very best restaurant in Chicago.  Great selection of entrees with flavors infused from around the world. The steaks and seafood were worth the time.  The drink selection was fun and over the top cotton candy martinis", "pics": null}}, {"review": {"des": "Have been here twice for group dinners for work and it's a solid option if you're looking for something other than the ubiquitous steakhouse while still getting finer dining.<br><br>The decor is as you'd expect for a place called Carnivale, and on my more recent visit they had flamenco dancers dancing in the spaces between he tables all night, which made for a fun atmosphere.<br><br>The food is very good, and our dinners were served family-style so I got to try a lot of different options.  The ones that stood out to me were the ceviche and the braised short ribs.  Dessert was their hommade cotton candy, which come standing up tall in a glass, and pistachio cheesecake bites, which were phenomenal.  I also tried the sangria, which was delicious.<br><br>Service was a little lacking-I know that with a large group things are different, but my sangria was empty for at least half an hour and not only did no one offer to fill it (they did for others, so I'm not sure if it's because I was tucked away in the corner of the room or what), but I couldn't even ever get someone's attention to ask for a refill.  It's also very loud in there-they main room is a large two-story space, so it's very echoy.  Add in the flamenco dancers and that makes it even more difficult to talk.  We were in a private room off to the side, but it was on the main floor and there was no door, only curtains, so a lot of the noise spilled in to the room.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PhhdY0BV21mtJ6EEM8QK9w/348s.jpg", "caption": "Sangria"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AZ9nI0C85ajcrRe1IwOdng/168s.jpg", "caption": "Cotton candy"}]}}, {"review": {"des": "I have been wanting to try this place for a while now, finally got the chance. first of all the atmosphere here is great, the whole carnivale theme was pretty cool. and now to the food, I ordered the Creekstone Farms Prime NY Strip which was amazing, the steak was cooked to perfection, very tender. overall I was very pleased with the ambiance, food and service", "pics": null}}, {"review": {"des": "This is my second time coming to Carnival.<br>We had Tuna Ceviche and Coconut Shrimp as appetizers. The Coconut Shrimp is to die for. Really.<br>As an entree I had Arranchero and my friend had the Fish of the day. I tried both and can tell they were good, period. Nothing extraordinary (for the price they charge). For dessert we had the Cuban Cigar and was delicious but it is an \"american style\" dessert.<br>Also, if they claim to be a Brazilian restaurant I can guarantee they are far from it (Im brazilian). The decoration itself dont remind me of Brazil at all. The food neither. I only saw 2 typical brazilian things on the whole menu : pão de queijo (didnt tried it) and caipirinha (had a sip from my friend's and was not a spectacular one).<br>It was not a bad experience but for the price we pay we deserve waaaaay better.<br>Ps: the service was 100% AA.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1vTrOSHhm85TUbWVFS9RaQ/348s.jpg", "caption": "Cuban Cigar Delicious dessert with an excellent presentation"}]}}, {"review": {"des": "I've been meaning to try Carnivale, and finally made reservations on my birthday. Great vibe once you come it. Tons of space, and very colorful. We were greeted by our knowledgeable and welcoming server. He made tons of recommendations. For appetizers, we tried the calamari and coconut shrimp. Both were pretty good, but I felt there was too much sauce over each dish. Had I known, I would've requested sauce on the side. As entrees, we had the Arrachera, Yucatán Salmon & Arroz Con Mariscos. I added scallops to the arroz, as the server recommended. Delicious. <br><br>Not sure I would come here again, unless I have guests from out of town who wanted to dine here. So many smaller restaurants in Chicago with the same quality of food, if not better. Outstanding service should be noted, but an expectation when you are paying a lot of money for one dish.", "pics": null}}, {"review": {"des": "Came here for a friend's birthday and the atmosphere, venue, food and drinks were amazing!<br><br>I appreciate that the bar area is a completely separate section from the main (very large) dining area. You can grab drinks prior to being seated or just hang out at the bar for the night.<br><br>I had the Ropa Vieja which was so flavorful and delicious. The shells the tacos came in were hard, but soft at the same time. Great texture! I also had a margarita which was nice, but a little pricey. <br><br>Overall: loved this place! Would definitely come back for another celebration or if a friend was in town and wanted to experience Carnivale.", "pics": null}}, {"review": {"des": "We celebrated a bachelorette party at Carnivale for a Sunday brunch concluding our weekend festivities. Carnivale was a great venue! They were accommodating to our various dietary restrictions (gluten, dairy, etc), and there was a wide variety of menu options to satisfy everyone's post-clubbing food cravings. The high ceilings and decor in the dining lounge set the mood for a memorable brunch. I had the huevos rancheros, which were amazing. The portion size was great (I couldn't finish it!). One of the girls ordered the Bloody Mary - I took a sip, and it had the perfect amount of kick. After we finished our brunch and were all stuffed, the waiter brought us a complimentary dessert to celebrate our bride. The food presentation was on point. I've also been here for corporate private events in the past and have always left Carnivale happy. All in all, this a great venue - highly recommend.", "pics": null}}, {"review": {"des": "The gnocchi was just ok, but my friend really enjoyed his dish, (Peruvian chicken). The plantains were delicious and the food arrived quickly, if nothing else. We were seated in lounge area near the bar, since we arrived late with no reservations . Despite not being regular dining, the area is nicely decorated with plush chairs, and set far enough from the entrance, where we were not interrupted.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3M3Q9nGLXyIf_toIwRUG4A/348s.jpg", "caption": "Gnocchi, Plantains, and Peruvian Chicken"}]}}, {"review": {"des": "Nothing but good things to say about my experience here! Reservation for 4, seated and waited on right away. Food was delicious. The decor is absolutely beautiful and the drinks were great too! Will definitely be back again.", "pics": null}}, {"review": {"des": "Good food good small show. Food was great and it was a good experience with having a performer and friends around the table. I will have to come back and try another meal especially with the service being top notch. Very responsive and good suggestions.", "pics": null}}, {"review": {"des": "I celebrated my 23rd birthday at Carnivale last night with my whole family.<br><br>I made reservations a few days ahead of time for Saturday at 5:15 during restaurant week.<br><br>The inside of the place is vivid and amazing. I felt like I was in some rustic Argentine/South American eatery. The faded pink, orange, yellow and other bright colors adorned the walls, the lamps, the high up ceiling and the décor. Exotic plants and colorful furniture added a lot of charm to the place. The atmosphere at Carnivale is worth coming for alone, I've never been anywhere like it.<br><br>We ordered a few drinks at the bar before being seated since we were early and there was a slight delay between our reservation time and our seating time. I personally had a fantastic Caipirinha that wasn't overly sweet. My mom had a margarita and my dad had the sidecar, both of those were delicious too, fairly standard pricing for the city but not outlandish.<br><br>We were seated in the big open colorful room at a round table. It was adequate and comfortable for 7 people. We perused the menu and started with guacamole, coconut shrimp and the ropa vieja. The guacamole was simple but delicious, it was served cold and honestly made an interesting difference. The coconut shrimp was flavorful, and we especially enjoyed the ropa vieja, which was beef brisket inside these little tacos. A couple of us got the restaurant week menu and had the beet salad as well as the ceviche. I thought the shrimp ceviche was outstanding, the tuna good, the salmon okay.<br><br>For our dinners a few of us had the skirt steak, one senator's chicken, the short ribs and the wood grilled sirloin. Everyone really really liked their food. My steak was done perfectly medium rare, it was so tender and flavorful, it had a sweet potato puree with chimichurri sauce and wow this was such a unique taste. I really need to eat more south American food because the flavors are so rich and different. We all thought that by far the short ribs were the best dinner on the table though. They were melt in your mouth consistency, braised with flavorful chicha morada  and served over grits; everything about this dish was amazing. Portion size was good on all the food, they are definitely not skimpy here.<br><br>We did get dessert, my mom and I opted for the dessert trio. There was like a layer cake and a couple of ice creams, the layer cake was the best. They also gave me a complimentary cotton candy for my birthday which was cool! I haven't had the stuff in forever so it was a trip back in time.<br><br>The service was good, I missed our server's name, he had a very thick accent (maybe Brazillian?) and was sometimes hard to understand, especially over the volume of the music in the big room. He was accommodating and explained everything very well, although towards the end he wasn't around as often.<br><br>The only reason I subtracted a star was because my grandparents' skirt steaks were served over rice and they both said the rice was cold. I can't vouch for this claim, but the server brought us a fresh side of rice that was hot after we told him.<br><br>Overall a very good experience at Carnivale. It is a really really unique place that I like a lot. All of our food was high quality, rich/flavorful and exceptionally put together. The restaurant week menu was a super deal. This experience has piqued my interest in this type of cuisine and I will certainly be looking for more places like Carnivale in the city.<br><br>My birthday here was awesome and I highly recommend Carnivale!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5GU0guj6TU8wj6-u7Of28A/348s.jpg", "caption": "Dessert tasting and cotton candy for my birthday! Thought the layer cake was the best."}]}}, {"review": {"des": "This place is the worst restaurant I've been to in quite some time. The blatant disregard for reservations and wait times is offensive, and NOT. Worth the wait.  We waited over a hour past our reservation time and other patrons were complaining of an hour and a half wait ( with reservations). <br>The bar is over crowded as a result of the wait times. There are only two bartenders on a Friday night? Come on, that's just bad management. It took 22 minutes to order a drink. It's not the the servers fault, but it's frustrating none the less. The drinks aren't very good, but that may be because they rush them out. <br>Our food was okay, the mixto was fine, over salted. They could let the seafood stand out for itself. The crab ceviche, was alright, it wasn't very much like ceviche. The calamari was good, again over sauced and salted though. <br>I ordered the churrasco steak, medium rare. It came<br>a little more medium than I prefer but it was solid.<br>Surprisingly UNDERSAUCED!!!! Can't win here! The sangria was cloyingly sweet, yuck. <br>Our waiter was very nice, and accommodating- he was 5 Stars! But I won't be back ever again.", "pics": null}}, {"review": {"des": "I made reservation for 7 to celebrate my friends birthday! Really nice place! They won't sit you down until all your party is there. Once we got our table we order our drinks and it took for ever to get our drinks. Also most of the glasses that were in the table to drink water, where dirty and had stains on them! Once we got our drinks, we decide to order the entrees and our main dish so they wouldn't  take to long for our food. <br><br>Well our food took quite a while to come out! I order a mango lemonade and that drink was like I was literally eating a lime! Super sour I couldn't taste the mango in it, I didn't end up drinking it! I just had water! Once we got our food it was ok not what I was expecting!  <br><br>It's really cool, how they have this people dancing around the tables picking up people to dance with them. Music makes you feel like your in Brazil! Really nice! <br><br>Our server was nice but too busy, our drinks would take to long to come out! When I had the valet crew get my truck back the guy that went to get it came back driving so crazy! They need to be more careful! Smh!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9X32RUdBmkTcmw17vCBW8Q/168s.jpg", "caption": "Coconut 3 Leches Cake"}]}}]}