{"name": "carnitas-uruapan-restaurant-chicago", "reviews": [{"review": {"des": "Hands down the best carnitas I have ever tried. Others are good but because greasiness and fat give it the flavor. Not Carnitas Uruapan. It's a small hole in the wall joint. They have a few tables to actually dine in where you can order your food at the table, or a takeout line where the line cook prepares your carnitas. You can tell him how many pounds and what you want exactly. The line cook also gives you a courtesy sample of their carnitas while you wait for him to wrap it up. Everyone was very friendly and you can't forget to grab one of their salsas to purchase as well. <br><br>As for the carnitas, they were very juicy and full of flavor. Remember the meat itself was juicy, not greasy. There's a big difference. I also ordered cueritos and buche to mix up all the flavors. I was concerned that their chipotle hot sauce wasn't going to go well with their carnitas but it actually complemented the carnitas very well. I had wanted the hottest salsa and I doubted them, knowing chipotle is on the sweet side. I will absolutely be returning very soon.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Bb7erxSnwNPwYO9fBFWHSA/168s.jpg", "caption": "Chipotle salsa"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3RnssNyL2neHNePw3NJ4aw/168s.jpg", "caption": "Carnitas"}]}}, {"review": {"des": "I definitely appreciated the food and the super fast service! As far as the carnitas themselves, I didn't think they had too much flavor going on. I found myself using the salsa, which I must say, was amazing. <br><br>The real showstopper for me were the chicarrones. I don't know how they managed to get them crunchy and somewhat meaty all at the same time. But I found myself dunking these into the salsa, and using them as chips. Don't miss these!<br><br>We got beans and the cactus salad as sides. The cactus was an interesting thing to try. Had almost a citrusy flavor to the dish, topped with cheese. <br><br>When I go back, we'd probably be more selective about the cuts of meat. That may enhance the flavor of the carnitas overall.", "pics": null}}, {"review": {"des": "We came here on a busy weekend evening and the line was out the door! People were waiting to sit down (there are only a few tables) and there was also a line for take-out. It probably took about 45 minutes for us to be seated, which was a relief since the place was extremely crowded the whole time. They actually sold out of pork at one point and had to turn people away!<br><br>Once we were seated, we were served right away. One of us speaks Spanish, so we had him place our order and do most of the communicating. We got several pounds of pork and we also got cactus, chips&guacamole, and fried pork skin.<br><br>The food came very quickly and everything was tasty. They provide tortillas to make your tacos and also cilantro and onion if you want. The food was flavorful and a very good value for the price! We all left feeling full and satisfied.<br><br>I enjoyed my meal here, but I don't think it was good enough to warrant waiting 45-60 minutes to eat here. If I come back, I'll be sure to only do it during an off-time when it won't be so busy.", "pics": null}}, {"review": {"des": "This place will leave your hearts and stomach full! <br><br>The moment I arrived, I saw the big display of fresh chicharrones at the front window and it got me super excited! For those dining in, if you're lucky to grab a seat, grab it quickly. The place is quaint and cozy with no options for large parties unfortunately. The three of us were lucky to grab a table and immediately my eyes were drawn to all the food displayed at the counter... tacos, beans, cactus salad... yum!<br><br>Menus are found at each table and I'd highly recommend the Carnitas Especial because it gives you a chance to try a little bit of everything. And plus, it's a bargain! For $8.50, you get 1/2 pound of carnitas (choice of meat only or meat and other parts), 1 taco dorado (choice of potato, spicy pork brain or potato and chorizo), chicharrones, beans and a drink. Also with your meal, they'll bring out hot sauces, pico de gallo and tortillas.<br><br>After ordering, I was taking a ton of pictures and videos, just happily and eagerly waiting for my food. The owner stops by our table and starts speaking to me in Spanish with the sweetest smile. He was telling me to follow him back to the kitchen for a photo! I was like seriously?! I followed him back there and he showed me how the chicharrones were made and I was in awe! He took my phone and told me pose by the pot and took my photo. What a cool experience! <br><br>For the food, the carnitas were so tender and flavorful, I couldn't stop eating. And the chicharrones... omg... the BEST! It was so crunchy and airy, not hard at all. I wish I had some right now! I'm kicking myself for not buying some and bringing it back home to Houston with me. And the chorizo taco dorado had a flavorful filling and super crunchy exterior. You really can't go wrong with the especial. <br><br>If you're contemplating whether to try this place or not, let the pictures speak for themselves!", "pics": null}}, {"review": {"des": "Continuing my mission to try as many tacos as possible in the city, Carnitas Uruapan has been on my list of places to try for the longest time! I have heard from multiple different people as well as all of these amazing yelp reviews that these are some of the best carnitas in town! It is a small restaurant right in the heart of Pilsen. If you're thinking of coming here, be prepared to wait, but believe me it is worth it! There is however the option to get carnitas to-go as well if you don't have time to wait or if your party it too big! We found the lady taking down names and preceded to make our way inside to wait there for our name to be called! You can choose to wait outside, but we chose to wait inside as it was a bit chilly. <br><br>While waiting we were given a sample of the tacos dorados with the papa (potato) filling, these were delicious. For our meal my husband and I decided to get shoulder portion of the carnitas (you are able to choose what part you want!) The 1 pound portion was enough for the both of us! The carnitas were so tender, salsas were delicious and very flavorful. We opted not to get any side dishes this time around, but would definitely want to try them next time! These were the best carnitas I have ever had and on an even better note very very very affordable! I think we paid less than $20.00 for our meal including drinks and tip! Fantastic and can't wait to come back!", "pics": null}}, {"review": {"des": "What a gem in Pilsen. For ~$8, the in-house Special left me STUFFED. Such great value. <br><br>The Special includes:<br>- 1/2 lb of (very tender and flavorful) carnitas<br>- 1 crispy taco<br>- 1 beverage<br>- chicharron<br>- endless toppings (e.g. beans, peppers, onions, cilantro, sauces, etc.) <br><br>For your crispy taco, try the seso (pork brain + jalapeño). <br><br>Unfortunately, the carnitas are only as good as they can get the moment they're served. Once they cool down, they get pretty dry and kinda hard to chew. So eat fast!<br><br>Once you're done, make the 5 min walk to the National Museum of Mexican Art. It's free and absolutely stunning.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bkO59a6rQLkcRcCjjpxudg/348s.jpg", "caption": "The special! 1/2 lb of carnitas + crispy taco + beverage + beans + toppings for $8-9"}]}}, {"review": {"des": "This place was the real deal. The line was practically out the door the Sunday morning my group of four dropped by. I thought it would be impossible to find a seat, but one of the employees went down the line asking if our group was dining in or taking out, and quickly seated us. Very efficient. Great service was consistent throughout our dining experience. <br><br>Check in for free chicharrones!! In addition to the chicharrones, our group shared a pound of carnitas, and the ensalda de nopales (cactus salad). The great thing about Carnitas Uruapan was you got to pick your cut of carnitas. We went for the pork belly and shoulder. If you're not sure what to get, I would recommend this combo. I would pass on the cactus salad. It wasn't as fresh as ensalda de nopales I've had at other places. Carnitas and chicharron was amazing! Carnitas can be dry when made with the wrong technique. The carnitas here was tender, well seasoned, juicy, shredded and fell apart nicely.  The chicharrones was delicious. Airy and crispy, not overly greasy....even though it's all fat. Throw on extra lime and that smokey hot sauce and you'll be in chicharron heaven.", "pics": null}}, {"review": {"des": "The carnitas are moist and tender.  I did a mixed plate with a bit of everything-- shoulder, ribs, etc.   I made a bunch of tacos out of them and damn... they were everything that everyone claims they are.  (This doesn't always happen.  Chicago has such a hype cycle)<br><br>However, for me, the real star of the show was the Chicharron.  And I absolutely ordered too much of it.  I was thinking of it as a more \"american\" style pork rind but these are way more dense and flavorful. <br><br>I am a salsa snob so I got both of the salsas and the chipotle was the one that did it for me.  A little smoke, a little heat... it was everything I enjoy in a good salsa but it wasn't overpowering to the meat!", "pics": null}}, {"review": {"des": "This has been on my list since a viral video of this place has been circulating Facebook - definitely worth the hype. <br><br>I came here on a Saturday around 1:30pm, and it was packed, but we only waited about 20 minutes. It was overwhelming, because the place was tiny and I had no idea how put my name in for a table, but eventually I got a hold of an employee. It was so packed I couldn't wait inside, we had to step outside and wait for my name to be called.<br><br>When seated, we ordered a pound of carnitas, and a large side of chicharrones. The carnitas were so fresh and flavorful, and we had enough leftover to bring home! But I absolutely loved the chicharrones - you'll never find store bought chicharrone that tastes as good as the ones here! I can't wait to come back :)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NQbVPdwd6ZaLA5P9227zfA/168s.jpg", "caption": "one pound of carnitas, and a large side of chicharron"}]}}, {"review": {"des": "On a late Sunday afternoon this place was packed!!!! At one point they sold out of the carnitas and had to turn people away. If you're thinking of coming here, be prepared to wait about 25-30 minutes for a table (I don't believe you can make a reservation and the restaurant is small with around 8 tables or so). There is someone taking down names for customers who wish to dine in. There is also an option to take out carnitas at the counter. <br><br>The carnitas were amazing and definitely worth the wait. Their specialty is carnitas so if you were looking for steak tacos or another variety, this will not be the place to go to. I believe we paid only $15 per person between the 4 of us including tax and tips and there were still leftovers! We ordered about 3 pounds of carnitas, and 3 side dishes. <br><br>Overall it was definitely worth the wait and I would make the trip to come back! The parking situation is scarce, so you might have to circle a few times around the block to find parking. The restaurant does take credit/debit for sit down and take out.", "pics": null}}, {"review": {"des": "We found out about this spot from Facebook. It happened to be shared by a friend, since we would be in Chicago, we had to try it! <br><br>The carnitas were AMAZING! The value meal is SOOOO WORTH IT and I recommend you get it! My boyfriend and I each got a value meal, in the end it was less than seventeen dollars before tip. SO WORTH IT!<br><br>Everything was amazing, the service was amazing and wish we had one of these in my neighborhood!<br><br>Come early (or call first), because we visited around lunch, and at about 12:30 pm I heard them tell oncoming customers that they were out of carnitas and there was a 30-40 minute wait, and guess what? The customers waited, because it's worth it!", "pics": null}}, {"review": {"des": "Carnitas value meal (4.5 stars): 1/2 lb carnitas, chicarrone, 1 gorda, refried beans, corn tortillas, and 1 soda, all for only $7.50! The carnitas were crispy and fatty, although some of the meatier pieces were a bit more dry. The chicharrones were deliciously crispy, and the beans were creamy. We chose the seso (brain) gorda, which was nice and creamy on the inside. Salsa and hot sauce on the table were very savory and hot sauce was decently spicy. Raw sweet onions, cilantro, limes, and pickled jalapeños on the table as well.<br><br>Nopales salad (4.5 stars): huge amount for only $3.50. Went really nicely with the carnitas. They tasted almost pickled, which cut through the richness of the meat nicely.<br><br>Super busy in this little joint! We waited about 5 min to be seated at 1pm on a Thursday, but the line went out the door while we were eating. There's also a take out line if you don't want to wait. Despite how hectic it was, service was great, and the owner came out to check on everyone. Would love to come back on the weekend to try the menudo.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mdJZYmricOkT6ixC5NR3FQ/348s.jpg", "caption": "Carnitas value meal - 1/2 lb carnitas, chicharron, refried beans, gorda, corn tortillas, all the fixins"}]}}, {"review": {"des": "I read some reviews to come early, and good thing we did. We came for lunch around 10:30am, and were able to get a seat quickly (seats were pretty much all full), but the line for takeout was out the door! I counted approx 30 people in line and it wasn't even 11am yet!<br><br>Carnitas by the pound. You get to choose which part of the pig you want. We ordered half pork shoulder and half belly/ribs (we kind of just randomly chose). The onions, cilantro, lime, sauces, etc already come on the table with a $1 service charge per person. Pretty sure these are unlimited. And they bring a bunch of hot tortillas to you when the food comes. One pound of meat went a long way. My husband and I (we're decently big eaters) struggled to finish the whole plate. They had at least 12 or so tortillas at the table (not sure how many, really...but it was enough for sure). <br><br>The pork shoulder ended up being a bit too dry for me, but I'd still give my experience 5 stars because I mostly ate the belly/ribs meat since my husband was nice to me :P. It was super juicy, soft, and tasty. Definitely the best carnitas I've ever had with juicy, fatty meat inside. Next time I'd probably order half the belly/ribs and maybe try the pork belly. <br><br>On top of this, yelp check ins get a free plate chicarron. They were huge! The best I've ever had (I've only had bagged ones before though). And I know we probably aren't supposed to do this, but we took pieces of it and put it into our tacos .. which made it the crispiest, tastiest, best tacos I've ever had in my life. haha. Not really exaggerating. <br><br>Service was great too. With that many people in the store (full tables and 30 people in line), the waitress and someone else came to check on our table maybe 4-5 times total throughout our meal. <br><br>Anyway, was a 5 star experience, and will definitely be back.", "pics": null}}, {"review": {"des": "Come here for the chicharrones.<br><br>Some chicharrones are indistinguishable from shrimp crackers, or taste like fatty air. Not these. They have a firm bite and FEEL like you're cracking into a pigskin.<br><br>The combo comes with them, and I recommend doing that. Skip the sides, they're better anywhere else.<br><br>If you're lucky, the owner will give you a caramel lollipop as you leave!", "pics": null}}, {"review": {"des": "CARNITA HEAVEN! <br><br>The hype about the delicious carnitas here is all true! If I lived in Chicago I'd only buy my carnitas from here. The location is pretty small and you have to wait depending on how many people are inside but there aren't more than 10 tables max.<br><br>The prices for the amount of food you get is super affordable. I ordered the carnita value meal for $7 and come change and couldn't even finish it.", "pics": null}}, {"review": {"des": "As I was looking for parking I drove by and saw a line out the door and assumed that was Carnitas Uruapan..I then became flooded with excitement and anxiety...NEED TO FIND A PARKING AND GET MY ASS INTO LINE. <br><br>Left my car parked crookedly and power walked my way over. I made it into line and I was a bit intimidated as the line was mainly Hispanics whom looked like they were regulars and were in the know as to where to go or how to speed up the process. Thankfully, there was a nice man behind me who said, \" hey if you're eating here, step inside and tell the waitress.\" He easily could have cut me but didn't. I learned most of those people in line are actually just picking up so be assertive and find the waitress. <br><br> I was seated by the window (perfect lighting for pics) and ordered a half pound of everything since I didn't know which part would be best. My favorite parts of the pig was the meat and I think was the stomach (slightly chewy but soft and full of flavor). I love how you get all the fixings (onions, cilantro, salsas, tortillas, pickled jalepenos/carrots) and make your own concoction. The whole meal was only $5!!!! <br><br>I'm a fan, cheap and delicious. GYAss over here. <br><br>#RefereEats<br>\"I call it like I eat it.\"", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QgBAkSdj8um7BZmlwj1Z3g/168s.jpg", "caption": "Everything platter"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/476bJFs12f3W5gGo2glZIA/168s.jpg", "caption": "The line"}]}}, {"review": {"des": "This place is so good I'm kicking myself in the butt for not trying it sooner. Best carnitas I've ever had! Cooked perfectly! For $8.99 you get 1 lb and all the fixings. I even lucked out today and got a little live music.", "pics": null}}, {"review": {"des": "Fantastically divey dive in Pilsen, great service, not the kind of place I would take a date, but definitely the kind of place I will be giving my hard-earned money to in order to eat off of some tasty carnitas for the rest of my life (or as long as I live in Chicago).<br><br>I came by for lunch a couple of weeks ago and I could not wipe the grin off of my face the entire time I was standing in line.  Just standing around meat, waiting for more chicharrons to come out of the frier, soaking in the smells of this place...magic.  I got three carnitas tacos (I definitely only needed two) and an quarter-pound of the chicharron to go with a pound of carnitas to go for tacos and a brunch casserole for me, myself and I later.  With the Cheap Eats deck from a la card, I was able to save $5 off of this, so I got all of that for just under $20.  Yessir!<br><br>Carnitas Don Pedro, I will miss you, because Uruapan officially has all of my business.  Good day sir!", "pics": null}}, {"review": {"des": "So the first time I tried carnitas like this was a few months ago before coming here. I was at the hair salon in Pilsen and that was when my boyfriend came over with this box of super tender and juicy pork from Don Pedro. I was so amazed like why haven't anyone ever told me about this type of food?! That was when I started googling carnitas spot and found out about this place. I took my Spanish speaking friend here to help me order to eliminate the embarrassment I was going to fall into if I were to come by myself. I got the platter with mixed parts of the pig and brain tacos. So good! I mean from the onions, cilantro, meat, tortilla, to the sauce was heaven. I highly recommend!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/240h0tNFz2rEb3tmXFqZww/348s.jpg", "caption": "Brain tacos"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2zvhvxvP8ZFGDFDfy1LKlg/168s.jpg", "caption": "Plate of goodness!"}]}}, {"review": {"des": "Growing up in a family where lechon and chicharron was life, I had great expectations for Carnitas Uruapan. <br><br>Well... expectations exceeded.<br><br>Came in for lunch on a Friday. We had literally just beat the rush because 5 minutes after we arrived, it was packed. Seating is limited, so when we got our food we actually just took it to go.<br><br>We went with pound of carnitas, pound of chicharron and 2 tacos each with guac. That was a ton of food to be honest and lasted a couple days. The tacos alone was pretty filling.<br><br>The carnitas was awesome. Tender, flavorful. Paired well with the salsa they gave. The tacos, which is essentially carnitas and a corn tortilla, were pretty big. And the chicharron was good too. I didn't have much of the guac but the gal liked it.<br><br>I gotta go back for menudo and the other things they have.", "pics": null}}, {"review": {"des": "This place has fantastic pork carnitas tacos! We ordered two tacos each and plumpness was excellent. They do not give skimpy tacos here. Their pork is perfectly cooked and homemade salsas are delicious. Service is friendly and they have a small dine-in section with full service. Takeout service at the counter is available. Credit cards are accepted. Be sure to order the Carnitas Especial.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9FeWda8CznA_NILN3A_xog/168s.jpg", "caption": "Two for you and Two for me!"}]}}, {"review": {"des": "Came on a Sunday morning around 11, and the place is packed!!! But don't worry, that huge line is for takeout, if you want sit down, it actually only takes 5 minutes to be seated, as everyone is really respectable of other customers time, and will leave once they finish, so the turnaround is really fast.<br><br>The pork is amazing here. Very flavourful and fulfilling. The 4 of us got one pound of meat (you can pick just the meat or everything including intestines and stuff), I would go with the everything if you don't mind the internal organs. The intestine is really good. They also have the tripe stew that's spicy and huge portions. The cactus salad is not really my thing, it's a bit sour, but it comes with huge portion (I liked the cactus stew at mi tocaya better, but it comes at 3 times the cost with 1/10 the cactus).", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MwQNHFm6CKLtXjvHi7LDtw/168s.jpg", "caption": "Kitchen with the huge boilling pans"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cW7__ATvREMStQsOm3KzdQ/168s.jpg", "caption": "Loads of pork"}]}}, {"review": {"des": "Such a simple concept, yet it works so well. I've wanted to try this place for a while, and I was lucky enough to have some time on the weekend to stop by. This restaurant is small-expect to wait a long time to sit at one of the few tables on the inside. I suggest you order your food and take it elsewhere to eat if you can. So the process for ordering is quick and simple-you wait in line, you tell them what you want (hint: you can choose between carnitas and carnitas), and then you wait for it to be packaged up. <br><br>We ordered a pound of carnitas. We were handed a sample while we waited and it was so good! The meat is not dry at all and it is seasoned and pretty awesome. We couldn't just leave with meat, so we also got a pound of cactus salad and got a side of salsa. I really enjoyed the cactus salad and it tastes good to even plop some on your tortillas with a bit of carnitas. We also checked in for our free chicharrones (they are huge and amazing, but make sure to not chip a tooth!). It was a bit confusing that the salsa was extra, but it was only about a dollar more so it didn't bother me too much. I did wish that the salsa had a little more chunk and less water to it, but it was nice to add some moisture to our tortillas. <br><br>In summary: Want to stuff your face with delicious meat and do it at a fair price? Definitely stop by here.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AVgSBOKDfEn2HfLsVhj7xA/348s.jpg", "caption": "All the carnitas"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TMNunbR1kpkHWIL4uTeSyQ/168s.jpg", "caption": "Salad $4.00"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/w4j-MWoQgxzG5zsEHNN6dw/168s.jpg", "caption": "Eating through a pound of carnitas."}]}}, {"review": {"des": "This is my absolute favorite place to go eat in Chicago! This place never disappoints, the service is amazing and can always tell when you need something. The food is beyond amazing and always consistent, I've never had a bad experience with this restaurant so I'm going to keep coming back every single time I make my way to Chicago !", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VlgO0l4LzTbxeQ5QLB-w_Q/348s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Yasss Carnitas! You best believe these are good! <br>Located in Pilsen, these little gem we found through a video on Facebook. Considered the best carnitas in Chicago, we HAD to try for ourselves. <br><br>Here's the breakdown: <br><br>Service: 4/5. The small restaurant was packed! And kept being busy the whole time we were there. They took our name down for a table. Stood in the middle of restaurant in a line of ppl for maybe 10 minutes for a table to clear. Sat down and were serviced immediately. Very quick turnover which was nice because my two kids tagged along. <br><br>Food: 5/5! We got free chicharron and a side of taquitos. Man, I must say. The taquitos were bomb!! Crispy, freshly made taquitos. Chicharron was very crispy as well and hot. <br><br>Carnitas: 5/5 very tender, very juicy. Not greasy, and perfect amount of flavor. <br><br>As soon as you sit down, they give you everything going need to build your taco. Cilantro, onion, salsa, peppers, tortillas, and a side salad made with cactus. <br><br>I would definitely come here again, and recommend this place to my friends and family.", "pics": null}}, {"review": {"des": "Being from Texas, I've had my fair share of carnitas and tacos. THIS PLACE hands down has given me the BEST carnitas I've ever had in my life. If you're feeling daring, I'd HIGHLY recommend the pork brains fried taco that they have. It's surprisingly very, very good. <br><br>They also have a special plate where they give you a little bit of every kind of carnitas that they offer. This was VERY filling and would've definitely been enough for two people, regardless of if you tend to eat a lot or little. It's pretty heavy the more you eat, so my partner and I both had some to take home.<br><br>They also give you the typical cilantro, onions, jalapenos, salsa, and tortillas. If you are willing to make the trek out to Pilsen (which isn't even that far to be honest), definitely check this place out. There are other really great places in Pilsen, sure, but there's only one Carnitas Uruapan.", "pics": null}}, {"review": {"des": "As someone who is from Michoacán, my family and I are always out on the lookout for authentic tasting carnitas in the area of Chicago. Yesterday we had the pleasure of finally visiting Carnitas Uruapan in Pilsen and it was amazing! These carnitas tasted just like the ones I had in Quiroga, MX earlier this year. This place has great service & good prices. Totally worth visiting! It was like a little piece of Michoacán found in Pilsen.", "pics": null}}, {"review": {"des": "I came here alone, ordered WAY more than I was expecting (please see the attached photo), and almost collapsed in the process, but throughout it all, enjoyed the whole goddamn thing. <br><br>I ordered the guacamole, refried beans, and a bit of everything for the carnitas. The guacamole and refried beans were good-to-great, but the carnitas! It was so dope that the dopest dopehead wouldn't do it justice. Salty in the right places, tender all around, and fatty where you wanted it.<br><br>If I'm back in Chicago, I'll definitely make sure to visit again. 'Twas an experience!!", "pics": null}}, {"review": {"des": "Best place for pork carnitas, hands down! Get pork by the pound, then add the tortillas and sauce... heavenly! Worth the drive. Every time.", "pics": null}}, {"review": {"des": "This is a great spot for the price. I would suggest getting the shoulder only plate, instead of the mixed-you get some really super fatty pieces in the mixed, which I'm not into. They don't serve alcohol but you can buy a beer from the small store across the street and bring it in. The chicharron that they serve is the best I've ever had. Crispy and flavourful. It goes great with the hot sauce. There are actually chunks of pork in there. The only thing that I would change would be the carnitas aren't really crispy, I'd finish them in an oven. Otherwise all of the sides are great. The tortillas are some of the best that I've ever had. You can seriously taste the love.", "pics": null}}, {"review": {"des": "The best carnitas north of the border! Small place that does a few things very well, one of those being carnitas! (Their cactus salad was also amazing!)<br><br>We were greeted with a healthy sample of pulled pork and ordered WAY too much for two people (one pound of pork with all the sides, a few potato tacos, chicharrones, and a side of cactus salad) but we were also able to take the left overs home. <br><br>These carnitas are simple and perfect. Go here and enjoy this simple but wonderful meal!", "pics": null}}, {"review": {"des": "I came here today for some carnitas to take out. There was a long line the whole time I was there but they take care of you pretty quick. While we waited we got some deep fried taquitos of cheese and potatoe. They were really good. When I placed my order the man gave us a peace of carnitas for taste. We loved that and I ended up ordering more carnitas. They are so deliciously tender and flavorful. We got a an 8oz container of salsa with our carnitas that I didn't expect. People are very friendly and quick taking care of your order. Prices are not bad at all.  We plan to come here again for sure.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gVMN2A4ssniU5S2mouScsQ/348s.jpg", "caption": "The carnitas with cueritos"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HqBF3nPgni43SpO15G_Zpw/168s.jpg", "caption": "The complementary taquitos"}]}}, {"review": {"des": "I grew up near Ashland and Chicago avenue so as a kid my go to spot was Carnitas Don Alfredo (the other team lol) which is also a well known carnitas joint in the vicinity of this hidden gem. I was feeling a little guilty coming here, but I overcame that sensation when I saw the large group of people waiting to get in and smelled the incredible aroma that was pouring out into the streets from this little old school establishment! <br>I was greeted at the door by a gentleman who was taking names for dine in customers, a bit confused I told him it was my first time there so he directed me to the take out line. While waiting in line, he gave me a little history on the joint and I could totally sense the pride he took in their business and see that he was genuinely excited for me, especially after I'd told him I was a Don Alfredo's customer as if he knew that I was about to join 'Team Uruapan.' <br>... Needless to say, that is exactly what happened!<br>The food here is to die for, truly fucking amazing!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fIdLjrKP3sC22QVYMQJNJg/348s.jpg", "caption": "The 'bees knees!'"}]}}, {"review": {"des": "This place reminds us that pork is about more than just bacon or barbecue. For 8:50 lunch special they give you my owns of food that is simply delicious. I can't wait to go back.", "pics": null}}, {"review": {"des": "Affordable price, delicious carnitas, welcoming staff. All packed up in a cozy cultural pocket inside Pilsen. I've eaten many carnitas, and these hit the spot. I might like this more than a famous neighboring carnita restaurant. Great family ambience and sharing. Felt so happy eating here. As a Texan who eats carnitas, this is one of my favorite places. <br><br>Recommendation for 1 hungry guests. <br>-Nopales - cactus salad. Similar taste to green beans if you've never tried this. Quite refreshing when eaten with heavier, savory meats. Good amount of salt with citrus. <br>-1lb mixed Carnitas: fresh, packed with savory flavors. Just the right amount of salt and fat. Perfect portion for 2. Get the mix to try shoulder, ear, belly, and etc. you can really taste the different types of cuts. The servers are constantly bringing out fresh meat. So good that I did not eat a lot of the tortillas <br>-Chicharrones: delicious. Right amount of fat with savory. You won't feel like you made your heart a disservice. <br>-Crispy Tacos with potatoes:  cheap and good starter in preparation for a big meal. Might be contingent on how much you like potatoes. Not heavy.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fnyIYbaeo8_CT47t6hyTyw/348s.jpg", "caption": "Chicharrones"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pY4Nmhov58dnxKS1Cg0RPw/168s.jpg", "caption": "Napoles"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AWX4L1kS2yITInZCF1u9eA/168s.jpg", "caption": "1lb mixed carnitas"}]}}, {"review": {"des": "Some of the most authentic and best tacos in Pilsen. <br><br>I chose one weekend to do an authentic taco tour of PIlsen. I made stops at Carnitas Uruapan, Don Pedro, Birrieria Ocotlan, La Chaparrita, and Tacqueria El Milagro. Carnitas Uruapan was my favorite.<br><br>Why is this place so amazing? Simply put, its the best carnitas tacos in the city. For a taco shop to survive in Pilsen of all places requires amazing quality. Furthermore, for a taco shop to survive that specializes in only one specific type of taco requires that recipe to be something special. The final product of Carnitas Uruapan is a taco that will knock your socks off, a quality that was made through love, labor, and an unyielding focus to detail. <br><br>This focus and dedication become evident the moment you walk through the door. A series of chefs greet you, carving and cooking fresh pork that emanates the most wonderful smell. The decor is simple, and so is the service. The waiter will bring you a portion of carnitas, some tortillas, lime, and cilantro. Grab a coke too, just for levity. <br><br>And then eat. Try this one taco, a taco that has lifted this restaurant to amazing success in the most competitive Mexican food market in all of Chicago. You won't be disappointed.", "pics": null}}, {"review": {"des": "Watched a video on FB about the history behind the owner and the business and had to give it a try while visiting Chi town... OMG! mouthwatering carnitas, the whole place exhales masterpiece, the flavors, their system and service.<br><br>Went for their special picking cueritos and regulat meat, added nopales on the side and couldnt enjoy the experience more. <br><br>One of a kind, legit carnitas place!", "pics": null}}, {"review": {"des": "What can I say that hasn't already been said?  <br><br>The place is a mecca for carnitas.  Massive portions, fresh condiments/salsas, and the meat....oh the meat.  The staff is friendly and helpful, the prices are fair if not inexpensive.<br><br>I will be back every time I am in Chicago.", "pics": null}}, {"review": {"des": "My wife and I took a week-long trip to Chicago and this was hands down the best meal we had. The service was fast and the Carnitas were cooked perfectly. Top it off with a \"Mexican coke\" and you have the perfect meal. If you're ever in the area you absolutely NEED to stop by this place!!!", "pics": null}}, {"review": {"des": "Some of the best carnitas we've had in Chicago. <br><br>The lines are ridiculous, and the space is super small. I do think they can get better with the organization of lines of dine-in & pick up. It would make the experience less stressful. <br><br>The food was great, and greatly priced as well. <br>The meat itself was awesome. The quesadillas were great! The guacamole was awesome, and their salsas are amazing. <br><br>Definitely coming back here to get some more food.", "pics": null}}, {"review": {"des": "I wondered why there was a line out of this place all day. I caught them on a weekday at a non-meal peak hour around 3pm, and tried their standard meal package, getting the cheese potato empanada side with a soda all for $8.29 include tax. I was amazed. They gave me a platter of sauces and condiments alongside tortillas and an array of pig meats. I've never tried anything like this. Hole in the wall but Michelin star material.", "pics": null}}, {"review": {"des": "Best carnitas. <br>Also the owner is walking around and check customers. He gave everyone candy too. That's nice. <br>How they all work is professional too. <br>They all work fast with good service on their section of work.", "pics": null}}, {"review": {"des": "It's a small shop with huge taste. Those  chichurrones were delicious!! The fried cheese tacos ..delightful.Took some to go for my late night snack!", "pics": null}}, {"review": {"des": "The Carnitas are awesome, as well as the pork skins!  The service is absolutely amazing, Extremely friendly. If your in the area I would definitely recommend you try it out.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EiX6Ut0nCxruVMbtApAaUw/348s.jpg", "caption": "The owner let me in the kitchen and took this awesome picture."}]}}, {"review": {"des": "I have to warn you that if you go on  the weekend...prepare to wait in a very long line!! Do not let that line discourage you,  it is WORTH THE WAIT. Amazing carnitas, guacamole and salsa. Great little place, love the free taste of carnitas, love everything here!", "pics": null}}, {"review": {"des": "Yes, yes, yes! Super tiny spot with huge flavor and personality.<br><br>It's wonderful to see that little gems like this still exist in a neighborhood that is quickly gentrifying. The place is no frills, but does what it came here to do: SERVE DELICIOUS CARNITAS. The restaurant was packed when we arrived at noon on a Saturday so we got in line and ordered food to go and were given carnitas to taste while we waited. We ordered a pound of carnitas (more than enough for two people), guacamole, and refried beans. It was all delicious! I believe the pack of tortillas came with the carnitas and I was able to make some delicious tacos. <br><br>While we waited in line I was snooping at what everyone else was eating (you know you like doing that too!) and it made me want to go back and try more. Some people were eating the chicharrones and others had a hot stew that looked perfect for one of these frigid Chicago days. I'll report back!", "pics": null}}, {"review": {"des": "This place is amazing. It closes at 5pm so it can be hard to get here during weekdays if you don't work nearby and I'm sure as a result the weekends are very busy.<br><br>I saw this place on Munchies/Vice Network on a chef's night out episode. You can see how they prepare their carnitas by rendering it in its own fat (amazing!). It's a local business being passed down from the father to the son which is very cool! <br><br>1 pound of carnitas with all the fixings = heaven and more than enough for two people and its under $10. You can get the carnitas with just meat or add skin, stomach, and even brain (no additional cost). The carnitas include fresh hot tortillas, two types of salsas, pickled jalepenos/ carrots, cilantro, diced onion, and lime. I'm not sure if this is included but we also got some Tacos Derados with our meal (fried tacos). So basically you make your own taco with all the ingredients and just prepare yourself flavor explosion in your mouth. I'm not sure how many tacos I ate (over 7) with my buddy, but there was still leftover meat. They will also give you more tortillas if you ask!<br><br>However, make sure to order a side of beans (frijoles refritos) and even guacamole. Don't forget the Mexican Cokes to wash it all down! Basically, after eating this you'll need a long nap after your food coma.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4iY5LyVTa5RMiPJB2qsh8A/168s.jpg", "caption": "1 pound of carnitas with stomach, skin, and meat"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1m-Rwp2ei97hCdr3zsDKew/168s.jpg", "caption": "1 pound of Carnitas comes with these..."}]}}, {"review": {"des": "Very cheap, very fuckin delicious, carnitas are the bomb, coffee was soooooooooo good I probably had me about 10 cups. Jk <br><br>But everything is good the tacos dorados I can eat all dayyyy", "pics": null}}, {"review": {"des": "Really good carnitas here.They are made fresh daily.Definitely worth stopping in.Im really enjoyed their cactus salad.Its a great side dish to go with the carnitas.Not only because it tastes really good but it will also helps me relieve some of the dissonance I get from GORGING MYSELF with carnitas and chicharrones.Haha!!! At least nopales are VERY HEALTHY as well as delicious.So glad  I finally made it in.Had them bookmarked for a looong time.I went withe the 1/2 lb carnita special that comes a taco,chicharron,pop and tortillas.Was a GREAT DEAL for under $9.I added the nopal salad and still paid under $14.Thats pretty good considering I had l leftovers enough for another meal.Will return!!!!", "pics": null}}, {"review": {"des": "Delicious. I loved the chicharonnes as they were perfectly crisp with a little hint of greasiness and salt. Only thing I needed was a spicier salsa. Otherwise this place is super affordable and I love that it's served family style. Pro tip: if you're coming with a group, get there a little earlier and put your name down. OR an even better tip is get like 5 pounds to go. The place is REALLLLY small.", "pics": null}}, {"review": {"des": "Amazing carnitas, chicharrones, and absurdly cheap.<br><br>Our group of seven arrived around 5:30 PM on a Sunday evening, half an hour before close. They kindly seated us, fed us quickly and we were out the door at around 6:15 PM. Being so late they were out of a few items on the menu, but most importantly, the carnitas and chicharrones were still available aplenty.", "pics": null}}, {"review": {"des": "I've been coming here for years since I was like 12 the thing that I don't like -which is good for them business wise is all the white people coming along but now it's like a longer wait where the line is basically three houses down for the wait to get in to order or dine in but it's so small in there there is no point to try with peoples backsides in your face or just them hovering over you.  I just order out I go early before like nine because I know it gets hectic.  before I never had to request My meat now I'm having to because if you don't say nothing they give me the driest parts so I only get dark meat and the skin. The salsa is perfect but I make my own at home to add in to make it spicer I don't like their new chipotle salsa. Their guacamole is good too.  Omg brain tacos are my favorite too yea yea i know lol.", "pics": null}}, {"review": {"des": "I occasionally need a cheap, greasy meal to make myself feel better, so my friend took me to Carnitas Uruapan for lunch. We got there around noon on a Thursday and there was already a line out the door, but it moved pretty quickly. Most of the people in line were getting takeout, so we were able to snag a table easily. I had never really had carnitas before, so I ordered the lunch special with a mix of the different cuts of meat. The orders came out pretty quick despite how busy it was. The lunch special included a fried taco and chicharrones. I honestly wasn't a huge fan of the latter food items, but the carnitas + tortillas + salsas/condiments were all I needed. If you're having a bad day, come get carnitas here and you will leave in a much better mood.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NvdgMF-hJRczreBaSh5z0Q/348s.jpg", "caption": "Food for days"}]}}, {"review": {"des": "Decided to try this unassuming little place hidden within the depths of Pilsen based on the yelp reviews.  Came here for lunch on a random Friday so we were able to sit down without a wait (heard this place is packed on the weekends).  This place is great!  I honestly have no clue if it is authentic or not, but the atmosphere certainly feels like a hole-in-the-wall out of Mexico.<br><br>Obviously the place specializes in carnitas (vegetarians beware!).  We both got the carnitas value meal, which is a half pound of carnitas, fried chicarrones, beans, tacos dorados and a drink (M-F only).  The carnitas were juicy and delicious and filling.  It was also dirt cheap at $7.50.  You can also just get a bunch of carnitas to go.  If only I had more random Fridays off.", "pics": null}}, {"review": {"des": "This place is amazing <br><br>Always great service and people always smile even when it's super busy<br><br>Get there early or be ready to wait in line for a while<br><br>Wish this place was bigger<br><br>Can't wait to go again", "pics": null}}, {"review": {"des": "My thing is lunch...: I work from home and have a few friends who do the same and lunch becomes our only way to get out of our houses.  So we have a rule to try somewhere we have never been at least once week.  Doesn't always work but fun.   I had this on my list and we went today.  And this is one of the best and most unique choices we have done in awhile (green street 2 yrs ago). Super basic....they only serve pork.  More specifically they only cook full pigs and you can buy one of the four sections.  Seriously so good and so easy.   We went a little nuts and got a pound each (a lot of food for one person).  I loved the pork shoulder and ribs best.  I still can't get over the hump to get the brains or I think it was liver but whatever.   This place is officially on the list.  Two more things.  It is basic and great and actually cheap compared to most of the places we go to ($10-15).<br>****remember this place only serves pork directly from the hog (and cactus).***** don't be that person that says \"I liked it but wish they chicken\"", "pics": null}}, {"review": {"des": "Saw this place on a video a while back and decided to go and give it a try. There's a wait list when you show up which can lead to a decent wait depending on the time of day you go. The food is definitely worth the wait though, the carnitas I had was nicely cooked and juicy. You even get to pick which part of the pig you want the carnitas from. I got the lunch special which you can't go wrong with considering the price is under $10. The service is good and the people there are really friendly. Check it out if you're in the area.", "pics": null}}, {"review": {"des": "Excellent carnitas and chicharron. Line was long but that only meant the food was great. Well worth the wait.", "pics": null}}, {"review": {"des": "My husband and I were on the hunt for the best taco in Chicago, and our search lead us to Carnitas Uruapan! It did not disappoint, and I knew we hit the jackpot the second we walked in and saw a cart of carnitas being wheeled to the counter. We ordered a pound and have been loving every bit of it.<br><br>This place it truly a gem, and if you love Mexican food, you absolutely need to put Carnita Uruapan on your taco \"bucket list.\"", "pics": null}}, {"review": {"des": "This place is so freakin delicious, you have to go here! It's a small place but has seating and you can also order to go. The staff is friendly and quick. The carnitas is cut right in front of you and the chicharrones are sooooo good, they even have that soft meaty part of the skin.  The prices are good and you get a lot of food! I got the meal and it was $7.50. You got carnitas, a taco, chicharrones, a drink, and tortillas. They also provide onion, cilantro, limes, and salsa. I think it's enough food for two people to share. When you get the check they also give you paletas de cajeta, which is basically caramel suckers and you better eat them because you won't regret it! I would go back here the next time I visit Chicago.", "pics": null}}, {"review": {"des": "The best carnitas in Chicago! Family owned business and always super friendly staff and service, there is a reason my late father would frequent this place.  One of Chicago's authentic food and amazing service!", "pics": null}}, {"review": {"des": "OMG. We have a carnitas place closer to where we live so despite many people recommending this place, we never got to it until now. Big mistake. They've got the most divine carnitas, perfect mix of fattiness and lean meat. The menundo was delicious but a lot of offal for one sitting (for me at least), so order with caution. Go early or late to avoid lunchtime rush. Despite how busy they were the servers were super nice and made sure we had everything we needed. Highly recommended.", "pics": null}}, {"review": {"des": "We spent the weekend in Pilsen and decided to check this place out. We dined in and only had to wait about 10 minutes for two seats to open up. I can see seating being hard to get during peak times though. Once seated we ordered a pound of carnitas and tortillas. Food came out really quickly and it was so much food. Between two people we had enough leftovers for another meal afterwards. The owner also stopped by our table to give us some caramel pops. Makes the mom and pop vibes of this place have extra charm. The food was amazing and the carnitas was heavy without being too greasy. We also did the yelp check in to get free  charrones. Which was crispy and delicious. I really enjoyed my time here and would come back when I'm in the area. A lot of people order to go from them so it might be a nice place to swing by after work for dinner.", "pics": null}}, {"review": {"des": "Boom!! This small place rocks out! Owner loves his place, food reflects it. The dude chopping up the carnitas is friendly, gives a sample out.", "pics": null}}, {"review": {"des": "Dropped by here for a quick bite to go while shopping. The carnitas was fresh, hot, and fatty (but perfectly crispy cooked fat). It didn't have a ton of seasoning, but I think that could be solved with some salsa. They sell it in tacos or by the pound at very reasonable rates. <br><br>I also tried several snacks. First, the papa con chorizo and papa con queso. These are potato-filled fried tortilla deliciousness. The queso (cheese) one was a little disappointing on the flavor side. It was fried mashed potatoes with cheese and that's tasty, but it had basically no seasoning! The chorizo (sausage) version was divine. It tasted like cinnamon rather than sausage but was absolutely delicious. <br><br>I also grabbed the free chicharrons, which was a HUGE portion. This could have given a heart attack to a family of 4 by itself. They were certainly crispy, warm, and tasty, but don't think this will just be a snack potion.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zh5Z6O6jI8ERIFXotefI7A/348s.jpg", "caption": "Papa con chorizo - think fried potato empanada. Yum!"}]}}, {"review": {"des": "My husband and I stumbled upon this gem during an impromptu lunch date. We loved the food and the authenticity. We weren't going to dine in because it was packed and no clear way of getting into queue to get one but then one opened up as we were walking out. It just took getting the server's attention and voila. Not super formal, but effective nonetheless. I love the informality, actually. The food was delicious and we were very pleasantly surprised at the portions. So often we overpay for a taco \"experience\" and don't get much taco. The sauce was good but we kept looking for the spicier one. We didn't find it. On the way out, the owner stopped us and gave us each a lollipop. It was such a nice gesture. THAT is what makes this a gem!", "pics": null}}, {"review": {"des": "I tried this place on three separate occasions to make sure I wasn't coming at an \"off\" time as the reviews are quite high. The simple fact is that their carnitas are consistently dry and flavorless, which is disappointing because I live for carnitas.", "pics": null}}, {"review": {"des": "This place is awesome and such a good value. Highly recommend. Go for lunch to beat any lines on the weekend and grab a value lunch - it could feed two for $7.50! Note there are two lines- one for take out and one for sit down. Fast, efficient, friendly and amazing food. This place won't let you down!", "pics": null}}, {"review": {"des": "Carnitas are so good and juicy! It's a small place. If you want to dine-in, I suggest you come early in the morning. Otherwise, you're gonna eat with folxs standing in front of you waiting to get seated. You are better off with take-out tho. Take-out is way faster.", "pics": null}}, {"review": {"des": "Get here before 5pm before they close. <br><br>They do their Carnitas right. I show up about 15 minutes before they close after work, and they have some chicarrons left and some Carnitas. The owner gives me a huge chunk to try and its heaven. <br><br>I ask for some chicarrons and a pound of meat for dinner, so amazing. It was like $10 too with the tortillas and salsa. We made so many tacos. <br><br>Also stir fried some with eggs at home, KILLER breakfast tacos.<br><br>I can make Carnitas at home, but why bother when this place is across the street and we can support a local business that maintains charm and character of this neighborhood and its culture.", "pics": null}}, {"review": {"des": "Best carnitas I've ever had.  Could not believe the prices or the servings.<br><br>Guisado by the quarter gallon and carnitas by the pound.  Don't over order, because the food comes quick and you can always get more.<br><br>Really busy but the line moves quick.", "pics": null}}, {"review": {"des": "Not going to lie-we came here because our favorite carnitas place burned down and we were like oh let's try other places.  We had such a pleasant experience from the service to the food! <br><br>Service: restaurant is small but everyone is very mindful and wait time isn't bad bad-we waited no more than 5 minutes for a table on a Saturday during brunch and were expecting a much longer wait time. We were brought chicharrones and chips to munch while we looked over the menu - very easy to follow btw.<br><br>Food: we were a bit hungover from the night before so we ordered menudo and carnitas.<br><br>By far one of the BEST if not THE BEST menudo I have tried in the entire Chicagoland area.  The menudo was very clean and had a great flavor.  To top if off, when I asked for it to go they even added more menudo! These folks are so generous! <br><br>Carnitas were also very flavorful and the salsas they make are very different than your basic salsa but compliment the carnitas well.<br><br>Owners of the restaurant checked on us a couple times and we chatted a bit - these folks really care about your experience as you can tell they are very downtoearth folks that are in business for the people they serve.<br><br>All in all, the hubs and I were so glad to have found such a great local Chicago business that not only serves tasty dishes but is very welcoming.  We only wish they were closer to home so we could go every weekend.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/X56Xjfrrlfkg89LaK7yLhQ/168s.jpg", "caption": "Carnitas and side of chicharrón"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ypXfa99NaM3EpEqEJ0BuqQ/168s.jpg", "caption": "Delicious and generous portion of menudo - best!"}]}}, {"review": {"des": "Carnitas here are great! Always packed on weekends, if eating in there may be a wait. Although it's worth the wait. Chicharrón en salsa is also good.", "pics": null}}, {"review": {"des": "Right when you walk in you smell and see the carnitas you are about to consume.  The carnitas are moist and are perfectly paired with the onion and cilantro with a squeeze of lime.  I like places that focus on doing one thing really well.  This place certainly knows their way around a pig.  <br>The food and service is excellent and I will certainly return.", "pics": null}}, {"review": {"des": "This place blew my mind. Right when you walk in, they had you samples of carnitas which are big enough to fill a hefty taco -- and it is delicious.<br><br>You order carnitas by the lb. and grab whatever extras you might want, such as their nopales salad. If you choose to eat there (which I highly recommend you do), you will be seated at a table and the servers will bring you water + all the fixings for your food, including onions, cilantro, pickled japalenos, two hot sauces, and limón. If you purchased tortillas, they will place them in a tortilla warmer for you.<br><br>Now this would have been enough to make me happy, but it doesn't stop there. They also bring you a plate full of chicharrons and they even gave us each a fried chorizo con papas taco. Yum!<br><br>I will definitely be coming back here next time I'm in town.", "pics": null}}, {"review": {"des": "WOW. We came in at 5:25 and everyone was welcoming... we came from MN and we really wanted to try this .. everything was smelling great. Yes it was a mess but I understand it seemed busy. Once we we got seated this lady dressed with green shirt had said \"we close at 6 so hurry up.\" As she was eating as well ... We had already decided we'd be fast.. so that was surprising specially knowing that everyone else was nice .. my fathers reply was \"don't worry we'll be fast\" the lady once again replied and said \"no leave \" .. we (a family of 7) decide to walk back out... we would have probably spend $100+ but with that lady being so rude it ain't a place for use. We are thankful for those who we're nice and welcoming.", "pics": null}}, {"review": {"des": "I have been coming here for over 25 years and the carnitas have always been the best in, but today the carnitas were under cooked, discolored and with no flavor. I am from La Piedad, Michoacán Mexico and I know how good carnitas should taste like. Overall I was very disappointed.                         <br><br>He estado viniendo aquí por más de 25 años y las carnitas siempre han sido las mejores en Chicago, pero hoy las carnitas estaban mal cocidas, descoloridas y sin sabor. Soy de La Piedad, Michoacán, México y sé lo bien que saben las carnitas. En general, quedé muy decepcionada.", "pics": null}}, {"review": {"des": "This place is heaven sent. The owners are super friendly and yes they still run it themselves. I have been coming here on a regular basis for about 3 years now. Only positive thing out of an ex relationship lol. <br>This place is where you want to go if you want mouth watering, orgasmic, life changing carnitas. Don't forget to ask about the refrained beans. I'm even convinced they their water is from heaven that is how delicious their carnitas are. You'll thank me!!!!!", "pics": null}}, {"review": {"des": "We went here about a week and half ago. We walked in on a Wednesday afternoon and weren't exactly sure whether we could seat ourselves and a waitress would come by or if we waited in line to order and then seat ourselves. We got in line and then noticed a couple just sat down, so we lost a table that could've been ours and then asked the waitress what we needed to do. She cleaned a table for us so we didn't wait long to get seated. I would recommend a clear sign that states to seat yourself for service, for take out go to the line. <br><br>The food was great, you get a good portion for the price. It was nice to see a restaurant that has been successful for so long and how it's also being second generation run with the owner's son. <br><br>One thing that really turned me off was that I noticed a waitress grabbing tortilla chips with her bare hands from a bag and placing it in a basket for serving. Immediately that grossed me out because she was touching other things. She should've worn a glove or served from the bag to the plate. <br><br>The last thing that turned me off, and I didn't notice until before we left, was that after we paid the waitress replaced the plastic bowl that had the onions in it. The cilantro that we used was left on the table. So this makes me pretty sure they re-use the cilantro and onion they serve to others. I'm sure some people would use the fork provided to serve themselves but some people might just use their fingers to grab cilantro and onion and there's no way for the waitresses to be monitoring that. We didn't get sick but this is definitely an easy way for someone to get food poisoning. If I was a health department nurse this would not meet regulations!<br><br>Overall I would return but cautiously. I would not return if they continue to reuse their condiments (cilantro and onion), and serve tortilla chips with their bare hands.", "pics": null}}, {"review": {"des": "Went to Chicago on business and went to this location to see if it lived up to the hype. Not only did it meet expectations, it was an amazing experience. Mr. Inocencio welcomed us into his restaurant and treated us like family. We told him we were from out of state and came to meet the Carnitas King of Chicago. The food was to die for. The carnitas were exquisite. The best Carnitas my travel partners and I had ever tasted. The beans, nopales, salsas, and tortillas were also fresh and excellent. But I have to say that Mr. Inocencio makes the restaurant special and he truly deserves the title of King of Carnitas. Watch his videos on YouTube if you need more convincing. This is a MUST visit if you are in the Chicago area!!!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/85Q4u8MR_QNtBDf6iqpCyw/348s.jpg", "caption": "El Rey de las Carnitas!!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/d3I0Hec01dcESr7V7TmiVA/168s.jpg", "caption": "Me with the KING!!!"}]}}, {"review": {"des": "One of the best meals I've had ever, let alone in Chicago. Not much more I can say that hasn't already been said, but there are very few family run places who can give such delicious home-style food, with all the touches necessary to make you feel as if you're being personally treated at someone's home, at such an amazing price. They only sell one dish, along with some sides, but that's all you need. I could probably pass on the taco dorados, but a lb. of mixed carnitas(you want all the fatty and cartilaginous bits too), some refried beans, and all of complimentary fixins make for some very happy pork-eaters. They also have a value meal for $7.50 which alone can make you like 6 tacos, enough to feed 2 people. Or, eat it all yourself and just not eat anything for the rest of the day, if you're in to that sort of thing.", "pics": null}}, {"review": {"des": "The most authentic, delicious and unpretentious Mexican food I've ever had. I've never fully understood the attraction to Mexican food until now. I've seen the light and now know the error of my ways. This place does pig, and does it well. Be prepared to eat all and any of the pig.... and enjoy it like never before. <br><br>You can order the pork meat by the pound and it comes with all four of the parts (shoulder, skin, rib and belly - why not when they are all delicious?). Then you are free to assemble your own personalised tacos in warm flour tortillas with sweet onions, cilantro and a dash of smokey Chipotle sauce or salsa. <br><br>The deliciousness doesn't end there. There is the crunchy crackling skin (chicharrones), which snaps and crackles in your mouth with the slightest sliver of port meat tucked underneath to deliver an extra punch of flavor. Or there is the Sesos, a crispy taco stuffed with perfectly spiced pork brains, onions and jalepeno. It is so good, time to get food adventurous!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BJ2rLig782Z_Uu27D2sxAQ/168s.jpg", "caption": "All the additional toppings to play with any combination you would like."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pL76-HsBZ68-LqYrpnFtCw/168s.jpg", "caption": "The main star of the meal, a full plate of pork, crackling skin and pork brain tacos!!"}]}}, {"review": {"des": "This place is far the tastiest carnitas that I've ever had since I was a child. The best time to get the juiciest carnitas will be on Saturday morning. I do order to take home and spend quality time eating with my family.", "pics": null}}, {"review": {"des": "They have one job and that is to make the best Carnitas in Chicago.  They nail it! <br>Pay per lb. and order in.  You get all the accompaniments at the table.  Salsa, tortillas, cilantro, lime, onion, etc.  It's crazy good!  You can also get a few fried taco flavors, beans, rice, and Chicharones!   <br><br>It's a really small place so don't be put off if there is a wait.  It's worth it!  <br><br>Also, not sure if this was specific to the one time I tried but delivery is not the same.  I didn't get any of the toppings when I ordered the carnitas so, stick to ordering for dine in!", "pics": null}}, {"review": {"des": "One of this best carnitas I've had in the city. I love the new lunch special that they offer. I remember before they would close around 3 or 4pm but now the hours are a little longer. The salsa is surprisingly spicy so be careful. I would recommend ordering the meat by the pound and sharing family style with friends!", "pics": null}}, {"review": {"des": "Good meat. Make sure you are hungry when you come here. Great part of the neighborhood", "pics": null}}, {"review": {"des": "I hate reviewing places I really REALLY like because whatever I say is guaranteed to sound like hyperbole. But these really are the best carnitas ever. Ugh YOU SEE? Like anyone could possibly know that. <br><br>Seriously doe. In a conversation about great restaurants in Pilsen, you can't not bring up Carnitas Uruapan. Well, unless you're one of THOSE people. You know...\"oh omg I totally like go to Pilsen sometimes, like Duseks...and like... my friend gets his art supplies there.\" GTFOH. <br><br>There's actually nothing unique about their carnitas. It's a classic style that simply tastes better than everyone else's. They're moist, tender, and salty the way carnitas should be. And their salsa pairs perfectly with this incredible meat. Take it from me, because I've been eating carnitas all my life. My mom made them, I've made them, and have tried plenty from other places. These are the best. <br><br>It's not as good of an endorsement as mine, but renown Mexican chef Aarón Sánchez put Carnitas Urapan number 1 on his top 20 Hot & Spicy countdown. So if you like carnitas, this right here is a must.", "pics": null}}, {"review": {"des": "We probably went there late but the pork shoulder carnitas were dry and not a lot of flavor. We ordered the pork belly carnitas which we thought would be like pork belly they looked like intestines we ended up throwing them away not what we expected. The interior is very clean. We will give this place another chance but will get the pork shoulder only.", "pics": null}}, {"review": {"des": "The best carnitas in Chicago + friendly service <br>Always welcome their customers with a big smile <br>Highly recommend it !!!", "pics": null}}, {"review": {"des": "The hubs and I are big fans of Pilsen and we've been spending more time here since moving back from Seattle. We stumbled on this place when I had a serious need for carnitas after an afternoon kid's show at Thalia Hall. Best discovery ever. I'm always trying to think of a reason to come back to Pilsen so I can get myself some carnitas and chicharrones. Seriously, so good.", "pics": null}}, {"review": {"des": "Ordered 1 lb of carnita (meat only), beans, cactus salad, one of each of the fried tacos (3 kinds) and a free order of chicharrones with Yelp checkin! The carnitas were good, but I wish they came out hot (and thus juicier). The corn tortillas were very hot and delicious, beans and cactus salad were also good. My favorite fried taco was surprisingly the potato one (had a fragrant lard taste lol). Chicharrones were on point and tasted great with some chipotle salsa. Meal came with limes, cilantro, white onions and pickled jalapeños for $1 per person. Service was pleasant and place looked clean overall. Will be back! Nomz!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/924pgsHqkFWcrEhQDfajeA/348s.jpg", "caption": "More than enough for 3 ppl!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vOFSoam8LZmwfYdyeEhiug/168s.jpg", "caption": "Deep fried tacos and chicharrones"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rD7YQutd_oAxME7US2fWmw/168s.jpg", "caption": "1 lb of carnita meat and cactus salad"}]}}, {"review": {"des": "Incredible meal deal! You get half a pound of carnitas (pulled pork), tortillas, fried taco (chorizo, potatoes, or pig brains), refried beans, pork rinds, and a drink for 7.50 plus tax. The pulled pork is not dry and has great flavor. Not greasy or too salty. Their chipotle salsa is not too spicy. The people who work there are friendly and don't get upset if you have questions even during a busy time.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PjGA9hSD7coruabH9b9xfQ/348s.jpg", "caption": "Meal deal"}]}}, {"review": {"des": "I had been intending to stop in here for ages, but I think I felt a little intimidated by Carnitas Uruapan since the ordering process differs a bit from the typical taqueria. I shouldn't have worried. The staff are super-nice and friendly, and will help answer any questions you may have.<br><br>As it happened, I had just eaten lunch, so I decided to pick up some carnitas for the weekend. I went to the carnitas station about 15 feet down the counter and placed my to-go order for a pound of shoulder and a pound of rib meat. I was given a generous (and delicious) sample to try. After placing the carnitas order, I shuffled down toward the cashier, where I asked for some chicharones by the pound to be added to the order.  The cashier added a nice little container of salsa gratis to complete my order - so nice of her!<br><br>This is the kind of place that makes you delighted to live in Chicago.", "pics": null}}, {"review": {"des": "I've never seen any place like this! Came here on a Saturday morning and the place was PACKED. There are just a few dine-in tables so we had no choice but to get take-out. You order the meat by pounds. We got one lb each of the carnitas and pork belly. They threw in several tortillas. I also checked in on yelp and got a bag of the chincarrones for free. It was enough food to feed a small village, and we only spent $15!! The food was SOOO GOOD! Highly recommend giving both the pork belly and carnitas a try! I speak very little Spanish, but was able to order just fine! <br><br>A must-try if you're in the area! Seriously cannot beat the value here!!", "pics": null}}, {"review": {"des": "Delicious Carnitas, just like the ones made in Michoacán, Mexico. A bit of a drive from downtown but definitely worth it, staff is friendly and attentive.", "pics": null}}, {"review": {"des": "Awesome food awesome price. I can eat here everyday. The place is very small so I usually order to go. When I did dine in, the service was great, our server was very friendly.", "pics": null}}, {"review": {"des": "Great place for authentic carnitas. Get there super early on weekends. The line goes out the door.", "pics": null}}, {"review": {"des": "I love these place. I cannot wait to finish work and stop by to get my carnitas. they really are fresh and they taste amazing yumm", "pics": null}}, {"review": {"des": "Delicious authentic mexican carnitas, sold by the taco or by the pound. Cozy little place to eat with friends. Would reccomend this place to any friends!", "pics": null}}, {"review": {"des": "Words have no meaning to how good and yummy this place makes carnitas, buche, and cuerito de puerco. These people know how to cook their pig Mexican style with a lot of flavor definitely hitting this place every time I come into town. Good carnitas is hard to come by but great carnitas is really a rare gem. This place is a rare gem when comes to carnitas. Hope to visit this place sooner then later", "pics": null}}]}