{"name": "catch-35-chicago", "reviews": [{"review": {"des": "I've been here twice and each time the food was spot on. Each time I ordered a Caesar salad and the lobster bisque soup and each time it was prepared fantastically. Depending on how hungry you are might change what you order. I recommend the fish and chips if you are hungry, as the portion is big and filling. Cooked to perfection as well.<br><br>If you are looking for something flavorful and unique, pretty much any fish on their menu is a good pick. Prices are less expensive at lunch, but dinner portions are available. Keep in mind some of these portions are small.<br><br>Service was great, always on top of making sure my water never reached bottom. Good recommendations from the staff as well. <br><br>Overall, a good experience and very accommodating, even if you don't have a reservation.", "pics": null}}, {"review": {"des": "For this type of restaurant, the service is lacking... or at least it was the night we were there. The waitress only came by a couple of times, drinks were empty on multiple locations (both water and wine).<br>I had the crab legs and they were good - it was nice that they shells were already cracked. The dinners came with two sides, which was a plus.<br>For the money, I would try somewhere else next time.", "pics": null}}, {"review": {"des": "Annual trip to Chi always includes a trip to Catch 35! Very accessible restaurant with a welcoming vibe. Fancy but friendly. Waiters are always knowledgeable and make suggestions.<br><br>Party of 5 ordered:<br><br>Crab cake app - excellent<br>King crab legs - excellent <br>Mixed grill - excellent<br>Sticky toffee cake - excellent<br>Key lime pie - excellent<br>Chocolate cake - excellent<br><br>Always solid. Will be back.", "pics": null}}, {"review": {"des": "This restaurant has improved with time.  The scallops and chive dumpling are just delicious, especially the chive dumpling - seared brown on the exterior, chewy and full of fresh chives inside.  Just yummy.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9uwzx1IoR3s9YM-5zjVO8w/168s.jpg", "caption": "Scallops and chive dumpling"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YFIz92wn9cp3PTIVzP3fhA/168s.jpg", "caption": "Seafood bisque"}]}}, {"review": {"des": "Catch 35 helped make our date night a success. We found parking on spot hero for $10, dined at Catch 35, and then made a 3 minute walk to the Goodman theater. We weren't exactly wowed by the service, but the food and environment made up for it - we really enjoyed the bisque, tuna, and sticky toffee pudding (wish it had been more moist though). Overall, we had a pleasant experience and would love to come back.", "pics": null}}, {"review": {"des": "Come here during the 2018 Chicago Restaurant Week. The restaurant offers a great selection in their pre-fix menu.<br><br>Love the presentation for the Caesar salad. Instead of having croutons, they have a thin slice of bread on the top. Looks really beautiful and elegant.<br><br>Order the fillet mignon as medium rare. It turns out to be amazing. They cook the steak to perfection. As for the sides -- it's the first time I've ever had roasted garlic together with the steak. It's truly mind blowing. If you slightly crush the garlic clove, it almost turn into a sauce-like paste. Having the steak together with the roasted garlic and Maitre d'Hotel Butter is like a melody in my mouth. Finish everything on my plate. Wish I had more lol<br><br>The chocolate cake is not as \"lava\" as I have expected. When I cut into it, the inside chocolate goodies doesn't ooze out. And it's a bit too sweet to my taste. <br><br>Overall, a great experience. Would come again during regular time!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/K00nDL9PVhJhnAWK2wQM-A/348s.jpg", "caption": "Caesar Salad"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/42aevuCYSNC6oNcerVBB8w/168s.jpg", "caption": "Flourless Chocolate Cake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/erpuziFvNM88TNCbexrhCA/168s.jpg", "caption": "Flourless Chocolate Cake"}]}}, {"review": {"des": "Staying downtown for the weekend. I decided to grab some lunch close by to avoid being out in the Chicago heat. This restaurant was a few steps from my hotel. The service was quick and the ambiance was nice and relaxing. The waiter took his time providing recommendations and showcasing the specialties. I ordered the Maryland Crab cake Sandwich and my husband ordered the seafood platter. The food was very delicious. The prices were on the high side  for lunch.", "pics": null}}, {"review": {"des": "The sea bass was amazing, service was very good, and the beverages were exquisite. Unfortunately the prices were just a bit too step to warrant a 5-star. Sorry.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1LXsh-ylmWWV7jaTOjBLJg/168s.jpg", "caption": "Sea bass"}]}}, {"review": {"des": "The interior of the restaurant is nice, but nothing spectacular. That's okay though, as it doesn't create a super stuffy ambiance. <br><br>Our server was EXCELLENT and it's a shame I do not remember his name. He was very quick and knowledgeable about both the dishes and wine. He was also incredibly kind. <br><br>I ordered the filet mignon and it was cooked to perfection. They got the medium rare correct. The wine was excellent too and they have a pretty good selection of both red and white. The chocolate cake was okay. The first two bites are delicious, but after that, you'll probably be done with it as it's very chocolatey. <br><br>I would definitely come back.", "pics": null}}, {"review": {"des": "This is my third time coming here. Food is still good, but not as amazing as the first two times. It's possible that we ordered the food we know we prefer or will enjoy earlier.<br><br>We got two starts today - spicy roasted octopus and beef sliders. Spicy roasted octopus has great texture, but there was way too much sauce. Beef sliders is a bigger portion starter. Beef itself was very good and I love the super crispy sweet potato chips. Unfortunately, the beef flavor was overpowered by the mini dining roll sandwich.<br><br>Lamb chop was amazingly good. Creamy spinach dip was also delicious. It comes with potatoes and roasted garlic. <br><br>Carrot cake bread pudding wasn't bad, but not impressive either. The candied pineapple added interesting flavor to the dessert.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XLRmwzOhO47UN-RBMGQBvg/348s.jpg", "caption": "carrot cake bread pudding"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QgsuU6TbpIpJAVt1mhixgA/168s.jpg", "caption": "lamb chop"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DXrFsCnD_tUKQXHjs1j1Ag/168s.jpg", "caption": "spicy roasted octopus"}]}}, {"review": {"des": "Catch 35 had been on my radar for years - I pass by so frequently when walking from my condo to my office. Located on Wacker, it's nestled next to the Renaissance, and has a nice quiet entrance with a laid back yet nice ambiance. A close couple friend invited us during Chicago Restaurant Week and we all ordered from the large prix fixe dinner menu (a great value). <br><br>My order included the New England Clam Chowder (delicious and loved the olive oil on top), the surf 'n turf which included a lump crab cake and a blackened Filet with leeks, and for dessert, a flourless chocolate cake (added ice cream on the side). Each item was well made and it's hard to choose which course stole the show - it was a balanced meal. <br><br>Each one of us enjoyed the service and meal. I'll be visiting again but may try my wife's entree choice next time (the famed Chilean Seabass).", "pics": null}}, {"review": {"des": "Had dinner here last night. Beautiful restaurant. Very upscale ambience. The wait staff is very knowledgeable about all the dishes. <br><br>Started with roasted beet salad. Had a creamy dressing and sprinkled with ground pistachios. Beets perfectly tender. Great salad. <br><br>For entree had scallops over braised short ribs hash. Scallops were tender with s nice brown crust. Hard to get perfect but they nailed it. The hash had tender shot ribs with diced potatoes. Both parts of this dish were great. Not sure if it was the best combo. <br><br>For dessert had carrot cake bread pudding and a crispy cake dish. Both good. <br><br>The portions were right sized. Nice wine selection. Really nice dinner.", "pics": null}}, {"review": {"des": "You know those restaurants that you eat at... and you while you eat, it's the most amazing food ever? Randomly, one day, you eat at another place and it's even better? Catch 35 is one of those 2nd places that is ranked first place is amazing and delicious food. <br><br>This location is in a prime location but can be a little hard to find. I walked into the restaurant and was seated fairly quick. My reservation was at 5 and I showed up around 430 and had to wait at the bar. My fault. Not there's<br><br>However, at 5, I was seated fairly quick my waitress was Ann and she is amazing. We ordered Beef Tenderloin sliders as an appetizer. The meat was very tender with some blue cheese and on the side was a horseradish cream sauce. I liked it this way since I like to add a lot of sauce but my fiancée does not. This is a good idea on their behalf. Also, it came with onion straws which were fried perfectly. It was crispy and not oily at all. Seasoned nicely with a little kick of heat. And same with a small side of potato chips on the side too<br><br>I ordered the Lobster Roll and it was pretty good. Plenty of lobster, some celery for that crunch and good amount of mayo. I only say pretty good since I think I make the best lobster rolls with my garlic aoili but that's beside the point. It came with fries but sadly it was nothing special. Just some generic frozen fries or at least that what it tasted like and reminded me of. No seasoning so I had to add my own<br><br>Ironically, my fiancée got the Mixed Grill which had a little bit of everything under the sea. She normally gets the lobster roll but we decided to switch. This was one of the rare times that we should not have switched. Her food was amazing. Half a lobster tail, grilled shrimp, salmon on a Yuzu Buerre Blanc and roasted veggies. Her food tasted amazing and was perfectly cooked. The shrimp was nicely charred and nicely seasoned. It was tender and not rubbery at all. The lobster tail was done in a similar perfect way. As well as the salmon. Just perfect. Enough said. <br><br>Then came out surprised. It was to celebrate our anniversary and we got a nice slice of Key Lime Pie. Let me tell you, I was stuffed from dinner but the pie was so good, I even finished it somehow. <br><br>Our waitress Ann was amazing. Very friendly, attentive and caring. She is the prime definition of a waitress and I can tell she truely loves her job. This place with its food was a 9 our of a 10. But she makes this place a rare perfect 10 out of 10. I wish all waitresses were like her and trained by her. <br><br>As you can tell, I live this place and I think it is replacing another one of my favorite eats. Sorry Mr Frog Lef restaurant but you have been bumped. Another thing I love about this location. You are not bumping elbows with your neighbors. It is nicely spaced out. I am sure to return to this location in the near future.", "pics": null}}, {"review": {"des": "I visit Chicago often for work. A nice benefit is that my daughter lives there. So when I am able to take her out for a nice meal, this is near the top of the list. I am a gluten free pescatarian (yikes!) which makes catch 35 a great choice. <br><br>They have a great seafood menu, but they have meat options as well. The seared tuna sashimi is fantastic. The halibut has also been great. Their wine choices has been very nice as well. <br><br>They have a piano bar in the front which can be a nice happy hour place to hear some jazz and get a drink. <br><br>All in all I think that if you are in Chicago and in the loop (small pun for the chicagoans) this should be on the list of places to try.  It is not a cheap option, but good seafood rarely is.", "pics": null}}, {"review": {"des": "Maybe it's because I just got back from Boston where I had the most amazing lobster bisque I've ever had but the bisque at Catch wasn't even close. It was missing a pretty vital flavor, lobster. Not that there wasn't lobster in it, there clearly was, but there was too many other notes in the soup that just took away from what it should be. <br><br>I also had the chopped salad which I added blackened salmon too. This was a nice portion for a pretty decent price. I loved the ingredients and thought the same was perfectly cooked. I would definitely order this again. I came only for lunch and the place was pretty dead but you could tell the place livens up at night. There was a pretty rad little piano bar you can see around and another huge long bar. The atmosphere and design is unique. I'll be back for dinner soon.<br><br>And that's all i have to say about that. <br><br>Jackée", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Qkco_7OPerLS903ToY1XbQ/168s.jpg", "caption": "Chopped salad with blackened salmon added"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mztjuJ1POpB4HQzGKrMkLQ/168s.jpg", "caption": "Lobster bisque and bread with whipped butter."}]}}, {"review": {"des": "I thought the restaurant was really nice. The ambiance was great and the service was great. Note that right now the outside area of the restaurant/building is under construction so with the rails and wood surrounding the outside it can be a little hard to see. <br>Food wise, I am a huge fan of GOOD bread before the meal. This place has great bread. I honestly could have made a meal of the loaf and the clam chowder (which was also really good and flavorful). They also made my mother a personal dish (shrimp scampi with veggies and potatoes) which was very kind. The potatoes were just okay, but I'd recommend this restaurant forsure!", "pics": null}}, {"review": {"des": "The food was sub-par - especially for the price. I wasn't expecting a top notch meal, but tasted like something I could get at a chain restaurant, which was disappointing. <br><br>The service was HORRIBLE. We weren't super dressed up, and I believe we were judged by this. We saw the waiter twice the whole night, the bus boys took care of the rest. He took awhile to even take our order and we waited on the dessert menu and checks for well over 20-30 minutes. Once he FINALLY got our checks, he saw that we had an expensive credit card and his service and demeanor towards us significantly changed, but it was already too late. Treat all your paying customers the same, no matter what they look like. He missed out on a 20-25% tip that night on a very expensive meal.<br><br>PLUS they use new paper menu's EVERY night - what a waste of paper, even if they recycle them. I get seafood options could change daily, but make a permanent, reusable menu and have a list of specials up front. Don't act like a 5 star restaurant if you don't offer the food or service of one.", "pics": null}}, {"review": {"des": "I was in Chicago for a conference and decided on Catch 35 for a solo dinner on my last night.<br><br>First of all, the service was fabulous. The staff was warm, attentive, friendly and helpful.<br><br>To start, I had a glass of crisp prosecco and the Blue Hill Bay mussels with Thai lemongrass broth. I was going to go with the classic garlic, butter and white wine but am so glad I went with my waitress' recommendation. The broth was delicious and the mussels were tender and not chewy at all.<br><br>For my entree I had the Georges Bank scallops with braised short rib hash paired with Parmesan truffle fries. The portion sizes were generous. The entree included 7 large sea scallops that were perfectly seared and flavored. The short rib hash was a great complement to the scallops and a unique take on surf and turf. The Parmesan truffle fries were crisp and salted just right. Literally mouthwatering especially when paired with a truffle aioli.<br><br>My only regret was that I was too full to finish the entirety of my entree.<br><br>I will certainly visit Catch 35 again whenever I am in Chicago.", "pics": null}}, {"review": {"des": "\"Oh...my....Catch 35 is amazing!\" I really enjoyed the live 3 piece band. As, it was just the antidote I needed, at the end of a stressful day. I had the Atlantic grilled salmon w/ horseradish mashed potatoes. The salmon was cooked to perfection, and the mashed potatoes, were divine.<br>We also enjoyed the crabcakes. They were moist, and flavorful. The portion was so generous, that we were \"almost\" too stuffed, for our main entrees. \"I did say, almost, right?\" Lol.<br>Everything was superb..!  I find this place to be more of a evening, wind down place to dine.<br> Sit back enjoy the ambiance, good music, and great food. \"Happy Eats.\"", "pics": null}}, {"review": {"des": "First impression was whoa! This restaurant was quite large for being in downtown Chicago. Looks like a little hold in the wall from outside but once you enter it's pretty massive.<br><br>Entry is a bar area, piano circle lounge and full service bar next to it.<br><br>As you proceed in, there is a display case of all their fresh fish for the day. What they have out is all they will have left. Nothing frozen in the back cooler. Few tables and booths on this level as well.<br><br>Then they have a back area where you have all your round tables, long family style seating tables.<br><br>This place has been open for quite some time and you can see why. Service was spectacular. Server was well knowledged in their menu and history which was nice.<br><br>Food was fresh and superb. So delicious. You can definitely tell the fish was taken care of and prepared properly. Definitely mouth watering.<br><br>I would highly recommend this place to anyone looking for fresh seafood in downtown area.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2Cv-daFZS00fpP9fLj58sA/348s.jpg", "caption": "Alaskan Halibut"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-Lg0akpQZE4I6JxCYW4bug/168s.jpg", "caption": "Caesar salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2tNwcWUhk5xpk0o0y8n_7A/168s.jpg", "caption": "Crab cake"}]}}, {"review": {"des": "for catch and carry (catch 35's little bro)...<br><br>i hate that i need to rely on this place for a fast lunch because it's in my building. <br>i don't like paying $10 for a handful of watery kale, (non)-crispy chickpeas and (mushy) dates.", "pics": null}}, {"review": {"des": "I was very impressed with our Catch 35 experience.  We visited for Restaurant Week, and that can sometimes be a dicey proposition as servers and restaurants seem to have a love/hate relationship with the diners who arrive that week. This was far from the case with Catch 35--they were completely on their game, the food was excellent and our server, Sheila, we a delight. (She was so funny, helpful and pleasant, I will request her specifically the next time we visit.)<br><br>A quick attire hint: This restaurant is listed as dressy, but we found it more nice/business casual than dressy.  No men had on sports coats. Many had sweaters. I even saw a hoodie or two.  You won't want to come here in a t-shirt, but I don't think you need to break out the tie and suitcoat, either. <br><br>The restaurant features live jazz as background music. The band was very good, but I'm not sure the tall ceiling and glass walls are that conducive to live music. I found it the room a touch too loud and bit lively for live music. Nevertheless, I appreciate the commitment to great music in the Loop.<br><br>Our meal was great.  Some of us ordered off the $44 pre-fixe menu and others off the $33.  Everyone raved about their meal. My filet and crabcake were very good. My wife raved about her salmon. My friend ordered the tune Pokebowl and said it was excellent. The sides were good, also.  I found the New England Clam Chowder a little thinner than I generally like, but it was very rich and tasty. My friend said the Kale salad was great. And the key lime pie was a fine end to the meal.<br><br>Service, food and ambiance were all great. I feel as if I can give Catch 35 a confident and strong recommendation.", "pics": null}}, {"review": {"des": "It was a chilly night in Chicago and this place was just steps outside of my hotel. I had the crab chowder as well as the sea bass. <br><br>The chowder was extremely light for a chowder and very tasty. The sea bass was cooked perfectly and accompanied by a wonderful vegetable and quinoa stir fry. Everyone at the table next to me also ordered the same thing and we all ate every bite.", "pics": null}}, {"review": {"des": "The hubs found this restaurant when he googled best seafood restaurants in Chicago so we gave it a try. It did not disappoint! He had the sea bass and I had a seasonal mahi mahi dish. Omg! Both were so fresh and delicious! Then we had the sticky toffee pudding cake! The name does not do it justice! We were here for hubbies knee replacement and this was a nice treat for us!", "pics": null}}, {"review": {"des": "The burger was like a frozen patty from Walmart. Would hate to see how they screw up seafood dishes.", "pics": null}}, {"review": {"des": "Rude staff. Much of their menu was unavailable. Will not return. Avoid if possible. Incredibly disappointing experience.", "pics": null}}, {"review": {"des": "3 people came in to eat, 1 sick last night, 2 others sick today. Two on Tuna, one on Salmon.", "pics": null}}, {"review": {"des": "Eh...it was ok.  We were late for our reservations but the hostess was kind enough to seat us at the smallest table in the restaurant even though it was 80% empty.  Several \"party of ones\" then came in 10 minutes after us and all got tables twice as large as ours.  <br><br>But we will go to the food...The food was good.  We had the Sriracha Buffalo Shrimp.  I had expected this to be deep fried battered shrimp buffalo style.  It was just shrimp tossed in the buffalo sauce.  It was good but under-whelming.  I would order it again but not necessarily recommend it.<br><br>We also ordered the Beef Tenderloin Sliders and those were absolutely heavenly.  Tender and delicious!  If I come again, I'd make a meal out of those babies!!!  Seriously melt in your mouth tender and the straw onions give it great texture.  Must try!<br><br>Our entrees were Maryland Style Crab Cakes and Ecuadorian Mahi Mahi.  The crab cakes were filled with crab but very finely shredded crab while I prefer large lump crab meat.  Delicious but not my favorite crab cakes.  The Ecuadorian Mahi Mahi basically reminded me of creole / gumbo.  I would recommend this if you like spicy and big flavors!  <br><br>We'll probably be returning to the one in Naperville.  <br><br>For those that drive to this location...tip - valet parking is available for reasonable pricing considering the cost of parking at the garage.", "pics": null}}, {"review": {"des": "It took 45 minutes to get a waiter but once we got that straightened out, the food was terrific. The manager did right by us and comped appetizers and desserts.", "pics": null}}, {"review": {"des": "I have to say, I expected better. The service was phenomenal. Our server was knowledgeable and presented the menus well. However he did go on a bit too long about the specials. I spaced out about halfway through his spiel. Regardless he was nice and expedient so I can't complain there. The appetizers were delicious and the wine list extensive. However - the salmon (special) although done perfectly was way too salty. It killed the flavor a bit. The mashed potatoes were a bit flavorless and seemed like they were made out of those insta potatoes. The bread wasn't cut through fully and I brought that up to the server who reassured me it was precut - it was cut about halfway through so we had to tear it like we were reenacting the feeding the multitude. <br><br>Thus if I was to break it down:<br><br>Atmosphere : 5<br>Service : 4<br>Food : 3<br>Presentation: 5<br><br>Thus the reasoning behind the 4 stars. <br><br>Thank you for the great time.", "pics": null}}, {"review": {"des": "I probably overwhelmed the good folks at Catch 35 during their happy hour and bar restaurant area. When you host a \" Take over the event you never if one person shows up or none show up. It's hard to predict. However, I had a very successful take on the event last Wednesday. We turned \" Humpday,\" into a splendid mid weekday fun. <br><br>Catch 35 offers half off on their bar menu food items except for the lobster dishes. However, their menu is great anyway offering swiss mushroom cheeseburgers with fresh cut fries, Maryland crab cakes, fish and chips and so much more. I loved their swiss mushroom cheeseburger, their light bread crumb battered fish fillets for fish and chips, delicious.  To make things even better for a happy hour at the bar we have a live Jazz band playing smooth sounds for us.<br><br>They had deals on cocktails $5 for vodka mix drinks and $8 on martini splendid and lovely, Our server was so kind to accommodate our large group as we hard time fitting people at the table. We had no idea who was coming or not coming but a lot of people showed up I was so happy. Happy hour with my friends and new friends alike it makes me happy yelper take over the captain.<br><br>Catch 35 you are on fire with the smooth live jazz music, great happy hour specials and service is excellent!  I totally recommend this place for happy hour, dinner or even lunch. It's classy upscale and in centrally located in the heart of downtown Chicago!", "pics": null}}, {"review": {"des": "Ate here with three of my coworkers for a going away lunch. While I found the food here underwhelming, the service was exceedingly good. We had the fish and chips, a salmon poke bowl, a chopped salad, and the blackened whitefish sandwich.<br><br>The fish and chips were pretty standard fare, I wouldn't rate it as something worth it's price point. I had a similar feeling towards the chopped salad. My coworker enjoyed the poke bowl and said it was really refreshing. The blackened whitefish sandwich was the least enjoyed of the bunch. The fish was full of bones and I wasn't sure if it was intentionally left (maybe they're edible) or if they neglected to take it out. Regardless, we found it pretty difficult to eat and unappetizing.<br><br>For the price you pay to eat here, I think you're better off trying somewhere else.", "pics": null}}, {"review": {"des": "I SWEAR I had written a review for Catch 35 about 5 years ago, but it seems like certain reviews mysteriously disappear from Yelp randomly - this isn't the first time. <br><br>Went back again last week For a Yelp Takeover thanks to Jaci and Daniel. GREAT time with fun foodies who share their food. Sadly I had a large lunch so I didn't eat much but the mussels were some of the best I've had in Chicago. And the crew was raving about the other dishes. FYI half prices apps  for Happy Hour and $5 New Amsterdam vodka drinks. They have live jazz which is excellent.<br><br>I will definitely come back to eat especially since the menu had been updated since 2012. <br><br>Why not 5 stars? The decor is outdated and feels like they cut the opening ribbon to go back to 1985.", "pics": null}}, {"review": {"des": "We had a pretty good experience but nothing out of this world. <br><br>Service: 5 - the staff does a GREAT job. Our waiter was attentive, knowledgable and friendly. <br>Food - 3.5 - just OK. The lobster bisque was kind of thin. I ordered the lobster roll and they doused so much Old Bay on top that it almost killed the lobster flavor. Desserts were great! We had both the carrot cake bread pudding and the sticky pudding. Delicious! <br><br>Overall, a good experience.", "pics": null}}, {"review": {"des": "Absolutely love this restaurant! Always a good vibe. Sometimes there is live music which makes for a nice ambiance. Today I ordered the shrimp and crab bisque soup, filet mignon medallions with potatoes and creamed spinach. I tried the pumpkin cheesecake for dessert. Everything was delicious!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WIcIIdqfreEo6AIqcjJ4cA/348s.jpg", "caption": "Shrimp and crab bisque soup"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Dp7-E7dLwp06MD0G63p_PQ/168s.jpg", "caption": "Filet mignon medallions"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QeVWiXXVxLQaRuZ8HbrQSQ/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Date of Visit: 11/7/16<br><br>Plus: Point Judith Calamari, Yellowfin Tuna Sashimi, Szechwan Scallops, Grilled Swordfish + Shrimp/Corn Hash. All were very fresh and flavorful.<br><br>Minus: Slow service, questionably cocktails (had a really poorly made Sazerac), similar cost to some of the more well-known/upscale seafood/chophouses in the area.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ajz_f9EQNWywPlwzQV_N0A/348s.jpg", "caption": "Grilled Swordfish, Shrimp + Corn Hash"}]}}, {"review": {"des": "This was my second stop for restaurant week. The ambiance is very classy and elegant, with beautiful old timey decor. We started off with a bottle of champagne to enjoy our meal. <br><br>I liked how they had two menus for restaurant week dinner, one $33 option and one $44 option. The four of us chose different things to all try. I got the best salad to start, but there was way too much dressing that overpowered the dish. My entree choice was the Mahi mahi, which was tasty and tender. For dessert, we each ordered a different one so we could have a taste of all. The flourless chocolate cake was a favorite- very rich and delicious. The strawberry shortcake was basically just bread with powdered sugar, and I never liked key lime pies so that wasn't a huge hit with me either.<br><br>I was a little disappointed that the wait staff didn't do anything for my mother's birthday on this special night, even after I had mentioned it beforehand. However, other than that, the service was great. A very classy night!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/z7GPuMzFewjB2JMv5dyjUw/348s.jpg", "caption": "Mahi Mahi"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/b_bALK_ok7-FbetzBNES0g/168s.jpg", "caption": "Best salad"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PWMhfP_ac3pBoxJg9mV_OA/168s.jpg", "caption": "Desserts- flourless chocolate cake, strawberry shortcake, key lime pie"}]}}, {"review": {"des": "This place was pretty good, actually.  The appetizers were amazing (basically one of those massive party plate deals with oysters, shrimp, lobster, etc.), my chilean sea bass was cooked perfectly, and the wine that was suggested by my waiter was out of this world.  Came here with a group of coworkers one night and we were all really happy.  Even one person that doesn't really like seafood gave it a try and ended up loving it.  Definitely plan to come back again some time soon.", "pics": null}}, {"review": {"des": "Spent 35th birthday at catch 35 :) Great experience. What a way to kick off a 35th birthday celebration. Greeted by the most  pleasant and down to earth hostess. Our server was polite and presented the menu well. I ordered the Georges Bank Haddock:<br>Panko crust, pea risotto, sauteed shrimp, cilantro pesto. It was filling and delicious. Thank you!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QuM8UbVn4X9SiCWozz2hqQ/348s.jpg", "caption": "Georges Bank Haddock: Panko crust, pea risotto, sauteed shrimp, cilantro pesto"}]}}, {"review": {"des": "I don't think I had this perfect experience anywhere just yet! Everything was so delicious! The service was beyond my expectations! I took my parents for dinner and they loved it!I'm recommending this place to anyone who's visiting Chicago! Loved it!", "pics": null}}]}