{"name": "cheesies-pub-and-grub-chicago", "reviews": [{"review": {"des": "Yum! A few friends and I decided to go bar hopping around Chicago and came upon Cheesies. I've been on a grilled cheese kick for the last couple of weeks so when we stumbled upon this gem, I couldn't be happier.<br>They had 12 different options to choose from so it was pretty hard for me, but I ultimately went with the Caprese. I can say I was not disappointed. The Caprese consisted of mozzarella geese, tomorrow's, extra virgin olive oil, cracked black pepper and fresh basil on sourdough which also came with a side of creamy pesto mayo dipping sauce. <br>The first bite into that delicious crunchy breaded mozzarella tomato sandwich blew my mind away! I thought I knew a delicious grilled cheese sandwich was before now but man was I wrong. <br>This place fills up fast though!! A lot of customers waiting in line just to order while others are playing games. Wanna know the best part about this place? Most of their games are FREE!! There's a few you have to pay for but not many! How often are you able to say that?! <br><br>If you're a big fan of grilled cheese, you have to come here. If not for the sandwiches, come for the alcohol and games! Something you won't regret doing because I wasn't.", "pics": null}}, {"review": {"des": "This place is awesome! It's one of the cheapest bars in the neighborhood and it has a really fun vibe because of the really bright color scheme. <br><br>I went with a few friends to grab drinks before a show down the street and we had a great time! Very friendly and attentive service and super yummy food with cheap drinks.", "pics": null}}, {"review": {"des": "Decent spot. Haven't gone too late in the evening to speak to that, but went around 11pm on Thursday. Our grilled cheeses came out relatively quickly. They were fine. I got The Mac and he got The Edgar. Also got some chicken tenders. For $4.99, the side of tenders is worth it. <br><br>Draft beer selection is okay, but no Belgians on draft when I went. They have a happy hour special on pitchers on some days but I didn't look at the details. There are some arcade games. <br><br>Since they expanded into the area next door, one side is for pizza and has its own bar. The other side is for grilled cheese and stuff and has its own bar as well. There are multiple doors to enter from.", "pics": null}}, {"review": {"des": "I loooove Cheesie's! <br><br>It is definitely a Chicago thing among locals. Or at least for locals that like to go out and have fun at night and as it sometimes happens, when having too much fun, you get hungry for second dinner and if that is the case - Cheesie's is there to save you!<br><br>Cheesie's sandwiches being my second dinner or early breakfast was just the beginning of this profound relationship with both of the Cheesie's locations (the one on Milwaukee in Wicker Park and the other in Lakeview on Belmont Ave). Now, I can have and truly enjoy Cheesies's anytime - breakfast, lunch, dinner, snack. I will never say no to Cheesie's. You just don't do that. Every time, I see their food truck at Daley Plaza it seriously cheers up my day. (However, there is more craft in their sandwiches in the pubs as the food truck has certain limitations with ingredients, so I recommend trying the pub over the food truck.)<br><br>You can always modify the sandwich and add anything else you want to it or take something away. Being a vegetarian, I have tried a vegetarian version of every single sandwich on their menu and cannot say I dislike any of them, on the contrary - I love them all! But of course I have my favorites. <br><br>As a huge basil fan, I absolutely love Caprese, that is the one my heart goes to the most, but close behind is The Popper and for those who like Mac & Cheese, you cannot skip on ordering their Mac & Cheese sandwich. It is amazing! It is my boyfriend's no. 1 and even though he claims to love me, I am sure he would easily exchange me for an unlimited supply of Cheesie's Mac & Cheese sandwich. It is a real love. He loves it so much that every time we end up there, he always eats one or two right there and he takes one for himself in the future. <br><br>Definitely, recommend visiting! Besides great sandwiches, they also have a great selection of draft beers! Cheers!<br><br>(Also, cheers to Cheesie's amazing crew and the wizardry that is happening behind the scenes in the kitchen! We love you!)", "pics": null}}, {"review": {"des": "Less than $9 for a good Mac and cheese grilled cheese sandwich???? HELL YEAH! <br><br>Omg they stuff the sandwich with the Mac and cheese and also serve it with a marinara sauce of some sort. I tried it without the sauce first and I love the mac and cheese. It wasn't TOO cheesy, which I happen to love. With the sauce, wow perfect. Who knew it could get better. It was also nice to see some SF sports flags flying up near the counter. It made me feel more at home. Highly recommend if you're craving a grilled cheese.", "pics": null}}, {"review": {"des": "This place is cute and conveniently located right off the Belmont CTA train station. Our server was really sweet and friendly and they have a variety of free arcade games you can play inside. It makes you feel like a kid at heart! <br>This place specializes in grilled cheese sandwiches. I had the Caprese sandwich that came with mozerella cheese, tomatoes and extra virgin olive oil. It was pretty good. It's perfect for when you're craving something not \"too cheesy\". My sister had the Mac and cheese grilled cheese and it tasted exactly how you'd expect it to - Mac and cheese in the form of a sandwich. The prices are a little steep for just grilled cheese sandwiches ($8 each), you could get an entire burger for the same price at other places, so I probably won't come here often but it's one of those places where you gotta try once!", "pics": null}}, {"review": {"des": "My first time here tbh. The bartender is amazing; his name wheezy!???? Couldn't make my first time any better!!!!<br>But I feel like like I have to remind y'all; restaurants aren't made to wipe y'all feet.... <br>please tip!!!! It makes y'all and y'all bartenders live better", "pics": null}}, {"review": {"des": "I frequented this place when I used to live in Lakeview, but I forgot how dang good it is. I remember I used to really the Mac, and some of the more \"classic\" sandwiches, but the Caprese was probably my favorite. As a lifelong hater of mayo, it pains me to say that the pesto mayo that comes on the side is soooo good. The fries are also absolutely perfect.<br><br>They've added pizza since I moved away, and I wish I was staying longer so that I could try it. They also had a lot of arcade games, which I don't remember them having before I left. Other than that, the place is just as I remember--cool vibe and friendly service.", "pics": null}}, {"review": {"des": "Cheesie's is everything and more for someone who loves grilled cheese. Potentially heaven on Earth. With so many flavor combinations they really do provide a perfect grilled cheese for almost any occasion. My personal favorite is the frenchie, which is American and mozzarella cheese, cheddar cheese sauce, fries, bacon, and chives served with a side of sour cream. It's my go to.<br><br>It's a fun atmosphere with a good selection of alcohol. They have arcade games. They generally get through their line of people waiting to get orders very quickly if there is one.<br><br>I love this place. Give it a shot!", "pics": null}}, {"review": {"des": "I love this place.  We came here around 2:00 am on a Saturday night, and it was pretty crowded.  Despite the crowd, it didn't take long to order and our food came only about ten minutes after ordering.  My friend and I shared the tradición ($8.99) and it was certainly filling enough for both of us.  The bread is really thick and fresh, and combination of chihuahua cheese, chorizo, and jalapeños was perfect.  The chipotle Mayo it came with only made it better. My other friend got the tenderizer ($9.49), which he really enjoyed as well.  He also got fried Mac N' Cheese Bites ($5.99 for a serving of 5), and they looked delicious.  <br>Attached to Cheesie's is Slice of Cheesie's which serves pizza.  The pizza looked great from what I saw, and it's nice that it doubles the place's seating.  Overall, I would definitely recommend this place for anytime from lunch to a late night snack after a night out next door at Berlin.  Sometimes they have Groupons available so I usually keep a lookout for those, but if they don't have any at the time, don't forget to check in on yelp for 10%!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7hH-YeoRQ55jgPfcMJaTQQ/168s.jpg", "caption": "The Tradicion Sandwich ($8.99)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JodxSVF1pnL9BVfpzp1wQg/168s.jpg", "caption": "The The Tenderizer Sandwich ($9.49), and Fried Mac and Cheese Bites ($5.99 for 5)"}]}}, {"review": {"des": "Cheesie's is a comfort food lovers heaven! The food is amazing and always hits the spot when you crave it. That is whats crazy about Cheesie's YOU CRAVE IT. Most times i get a hankering for Mexican food or Thai and many places can fulfill my need. With Cheesies if you crave it your doomed until you eat there, no other grilled cheese will do. In fact if you get the urge for the best grilled cheese in Chicago you will be nothing but disappointed if you try anyone elses. Also sorry mom, but your grilled cheeses have been downgraded to \"meh at best\" since discovering this place. <br><br>The drinks here also serve their purpose, and it's not a half bad place to watch a game either. GO HERE.....GET GRILLED CHEESE......CHANGE YOUR LIFE!", "pics": null}}, {"review": {"des": "Great place for cheese sandwiches. I like the Edgar a lot. My friends also enjoyed what they had. Overall it was a great experience. <br><br>Also, the location is great, right next to the train station. The flaw is that the table was not clean.", "pics": null}}, {"review": {"des": "Love this place drunk or sober! I've had their grilled cheese before so my favorite is the Frenchie, and recently Ive had the pizza which was quite delicious. Great place to kick it if your in the area for some great late night foods. You cant go wrong with this gourmet comfort food. Tell your friends about it.", "pics": null}}, {"review": {"des": "This place has never disappointed me! I love love their food. It is super casual and good priced. The stuff is always friend and nice. <br><br>I've had their seasoned fries, Mac and cheese bites, root bear float and one of their sandwiches and I literally loved it all. Specially the Mac and cheese bites  <br><br>After a night out or we're looking for some place cheesy this is our to go place. Or in general if I ever wanna grab casual dinner with a friend.<br><br>I always go back would keep on going back always", "pics": null}}, {"review": {"des": "I always have a major weakness for a solid grilled cheese, and spots like this really get my attention. This particular bar had its ups and downs. It seems like an odd concept to combine a city bar with a grilled cheese restaurant, and you kind of wish they would pick to be one or the other. The server we had was very friendly, and really treated you like a person and not just a customer. I felt very welcomed and especially enjoyed the 90's/00's music and shows on the TVs they had playing.<br><br>Aside from that, that's where my great experience ended. The price of the food was a bit much for the amount and quality you got. I ordered The Tenderizer combo and thought that it tasted more like a BBQ sauce sandwich than anything. And for being a bar, they were certainly out of a lot of fountain beverages in their machine. Though it fumbled in certain aspects, it has potential. I would definitely come back at a later time to try one of their other sandwich specialties.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IGO4eY_3nFo08riBuf6yWQ/168s.jpg", "caption": "The Tenderizer combo."}]}}, {"review": {"des": "In addition to this place being a great late-night spot, I have to give it up to the staff. Shout out to Brown-Haired Sarah! With a smile, brighter than a cluster of stars, she'll come over to take your order and chat you up throughout her shift with energy and will shake a Shaker the way it was meant to be shaken. Shake it, Sarah..., Shake it! The second time I went there, Sarah not only greeted me, but remember what I had to drink the last time I was there. Sold! They can rely on me being and steady customer for quite some time. <br>Good people, good atmosphere, and the place to keep the party going after you've left the clubs.", "pics": null}}, {"review": {"des": "I was with a group of friends coming home around 4:00 am the other night from the bars. We were raaaveenous and when is there a better time for grilled cheese than when a little tipsy on a Sunday morning? The place, granted, is a bit dingy near the kitchen but hell- it's a grilled cheese place. There were tons of arcade games around and some lively people out eating even at that hour. <br><br>I ravenously ordered sweet potato fries and the mac (macaroni and cheese on grilled texas toast) and kept it all in that beautiful brown bag until I uber'ed back home because I wanted to enjoy it in sweat pants with a clean face in the comfort of my own home. MAN did it deliver. All of us sat in a post-night-out circle on my living room floor and made a buffet out of the coffee table. Literally delicious. I am a small woman of slight build and after downing an entire tray of sweet potato fries and a grilled cheese with mac and cheese the size of my face (WHICH comes with a great tomato dipping sauce), my friend looked up and told me \"Wow. I have never seen you eat that much in one sitting.\"<br><br>Overall, 10/10. Likely saved me from a more brutal hangover in the morning, as I put about 6 helpings of food in there to even out all the Moscow mules. I will be back! Though I may not remember!", "pics": null}}, {"review": {"des": "Love this place and it's awesome they are open late as well! <br><br>Great \"unhealthy\" food though for those times!<br><br>I was put off by few if any of the kitchen staff, that is in plain sight not following health code. Specifically hair restraints and cross contamination.", "pics": null}}, {"review": {"des": "I love Cheesie's! Even though I can't make it here very often, it's always a treat to stop by and get a cheesy treat. Last night I went with the \"OG\" and played some of their new video game cabinets with my girlfriend. We had a great time. I'm so glad I ended up here instead of an awful experience I had at a \"wings\" place that had customer service equivalent of bird's droppings.<br><br>Cheesie's is the best! I love your staff. I've always had such a positive experience when I'm there. The man who took my order was especially enthusiastic and nice. Cool dude!<br><br>Keep it gooey, Cheesie's! You're a staple of Chicago!", "pics": null}}, {"review": {"des": "Me and my boyfriend took a train to get here at night because we heard it's one of the must-go-to places in Chicago. Hate to say this, I found this place to be mediocre. <br><br>Fist of all, the service wasn't great. The bartender doesn't seem like he wanted to be there and the service was very minimal. I had to top off my water.<br><br>The food was decent. We ordered a grill cheese with tater tots on the side. It was delicious. But it would be so much better if the price was cheaper for the grilled cheese. $8-9 is steep for 2 pieces of toasts and cheese. <br><br>Also isn't kind of unnecessary that I got my ID checked at the door? I am here for food and this isn't a club. The crowd they let in.. How shall I put this.. Very drunk people who are very loud.", "pics": null}}, {"review": {"des": "Literally just one of my all time favorites for obvious reasons. Open late, the iconic Mac n cheese sandwich, a super cool arcade, and just a great college hangout spot in general. <br>My only complaint would be the \"security\" they have hanging out at the door sometimes when it gets busy later on. Tonight my friend and I stopped by for food and the guy was hanging out at the door, sipping out of a Dunkin' Donuts cup. My friend walks in with her headphones in and apparently he said \"how are you\" to her and she didn't hear him. She took out her headphones and said \"what?\" Very politely. And the security guard responded very rudely with \"I simply SAID hello, how ARE you\" like we just instantly pissed him off because she didn't hear him the first time. Like yes hello if you hate your job that much maybe don't stand by the door greeting people and learn some respect? Or quit?? That was very annoying.", "pics": null}}, {"review": {"des": "This place is over-rated. I have been here during the day and late at night. Just not that good.<br><br>The first time I came here I got \"The Tenderizer\" because people told me it is a MUST TRY. So I got it and was completely overwhelmed with it. Maybe the sandwich was just too much for me, so I blamed myself for ordering poorly. The next time I went, I got \"The Classic.\" Considering it was called \"The Classic\", I figured I would love it. Unfortunately, it was lame. I just was not a fan.<br><br>If I am going to spend $8-$9 on a GRILLED CHEESE, it has to be amazing. I have to sense the love the was kneaded into the bread. I have to taste the freshness of the cheese from the cow. I need it to be knock your socks off good. Otherwise, I'm just going to make myself a grilled cheese at home. And because it was not that amazing, I will just make it for myself at home.<br><br>Also, the atmosphere low-key sucks. Late at night, its full of drunk idiots who will most likely spill someone on you or hit you. That's not necessarily the restaurants fault, but it's not what I look for in any restaurant experience. <br><br>Both my roommate and I try to avoid Cheesies at all costs, and if we somehow get dragged there we sit and discuss what we are going to order from a pizza place while our friends eat their grilled cheese.", "pics": null}}, {"review": {"des": "Came here on Halloween for the Bob's Burgers themed burgers and drinks. The bartenders came up with the recipes themselves and they were extremely creative!! Both bartenders were super friendly and working hard! I got the chive burger with feta cheese and friend pickles and holy shit I was impressed!!! Will be coming here again for sure. Their grilled cheese sandwiches look amazing. Also they have bottomless bloody Mary's on Sunday's and Saturday's for only 30 bucks which includes a sandwich and side as well. I'll be back very soon!!", "pics": null}}, {"review": {"des": "Cute place! Great atmosphere! When I left my wallet there I freaked out thinking I'd never see it again but when I called I was helped and told it was found and would be there when I got off work! Nice people!", "pics": null}}, {"review": {"des": "Holy crap I went from starving to disgusted in 5 seconds! This used to be the spot .. loved it, but I will be returning back until they implement a hygienic protocol. <br><br>We went to the new area and walked to the counter.   Asked for a slice of pizza. The girl opened the pizza stand, grabbed a slice with her bare hands and plopped it on a tray then asked us for money. I was so stunned, I should have just said no. Put some gloves on!!!! And have someone different running the register. Cash and credit cards are dirty! Those slices went in the trash. It's on me for not speaking up when it was happening ...", "pics": null}}, {"review": {"des": "Went here super drunk once, was super good BUT just ordered on Uber Eats sober and it sucked ass ‍", "pics": null}}, {"review": {"des": "I ordered the traditional grilled cheese sandwich. It was the WORST grilled cheese sandwich I ever had. The thin line of cheese between two thick slices of bread was tasteless and the embedded tomatoes were unripe. Worse still it seems they don't grill the entire sandwich. Apparently they only butter the center of the bread, hence most of the sandwich doesn't turn brown -- it stays white! Yuck. They serve this mess with a little cup of runny 1,000 island dressing. I guess they think anything would help.<br><br>I could make a better grilled cheese sandwich at home with my eyes closed. This food reminds me of the food relief agencies hand out to hurricane victims to keep them alive. For one day. If you want to relive your nightmares of school cafeteria food, come here.  <br><br>Avoid. Unless inebriated. Or clueless.", "pics": null}}, {"review": {"des": "You order at the counter, get a number, pick a seat, and wait for your order. You can sit at the bar or at one of the tables. If you sit at a table, you can belly up to the bar and order yourself a drink to take back to your table.<br><br>They have several grilled cheese sandwiches to choose from. I was a little let down by the bread to cheese ratio - too much bread and too little cheese. The basic ham and cheese one had very little flavor. But the jalapeno one had a lot more flavor. The fries were pretty good too.<br><br>Overall, it's grilled cheese and that's pretty much always good. Definitely don't play it safe - opt for one of the more adventurous options.", "pics": null}}, {"review": {"des": "I personally like this location a lot more than the Milwaukee location. First became a fan of Cheesies via the food truck, and I was in the area so I dropped in. It was pretty empty as it was in the middle of the day. An amiable employee greeted me immediately and took my order. I order the popper with fries. My order took less than 10 minutes. The popper was fantastic, and it had just the right amount of heat. I wish my sandwich had a little bit more crunch to it, but all in all it was good. I think I will forever be a Cheesie's fan.", "pics": null}}, {"review": {"des": "This place just isn't the same.  They raised the drink prices.  Every drink used to be $4.  They brought in video game.  Now the bar is full of kids.  The sandwiches were cold.   The crowd just isn't the same.  You could be killing it if you were still the only bar in the neighborhood with $4 or even $5 drinks.  Get rid of the video games or just keep them all on the pizza side.  Improve the quality of food or at least the consistency.   So sad this place has declined so much.  And you think you can franchise this product?  You need to rethink you business model.  Thank God for our bartender,  she saved our experience!", "pics": null}}, {"review": {"des": "Cheesie's is such a fun place! It's quirky and different and I've never had a bad experience. I usually sit at the bar- Sarah G is one of my favorite bartenders. Aside from giving great service, she's just super sweet and personable. You can tell she enjoys talking to her customers! Additionally, the food here always hits the spot. Yes, sometimes it gets busy and things take a little longer, but it's worth it! I definitely recommend this place- I like to bring people from out of town here when they visit. The staff and the food are always awesome and the reason I keep coming back!", "pics": null}}, {"review": {"des": "I love eating here. I'm also a sucker for the fried pickles. The Frenchie sandwich is amazing and I'm glad I tried it after the manager's recommendation. Everyone (manager, bartenders, servers) is friendly as it's a great time whenever I am there. Thank you. #fan4life", "pics": null}}, {"review": {"des": "Delish! When in Chicago, we tend to visit the same restaurants over and over...we had passed by Cheesie's several times, but had never stopped in.  That is a decision we absolutely regret...Cheesie's is awesome!  The Caprese with chicken was outstanding and the service was stellar!  Super friendly...they even brought us over some cheesecake bites to sample!  Cheesie's is now one of our favs!  Oh, and you can play all the retro video games for FREE!!!", "pics": null}}, {"review": {"des": "So good!!  Went for my sons bday to take advantage of the free arcade games and ate some very unusual pizzas that were delicious. We'll be back.", "pics": null}}, {"review": {"des": "Always a good time. I bring friends here for the niche environment and it is always a hit. Lots to chose from including a sandwich of the month. Very filling. Great area. They just expanded their venue with a pizza side. Planning another trip back to explore that menu. If you like grilled cheese this is the place to go.", "pics": null}}, {"review": {"des": "First stop on our \"food wasted\" tour of Chicago. The Mac was fantastic. The Mac and cheese inside the sandwich stands on it's own. <br><br>The Popper was also good. Intimidating amount of jalapeños at first sight. But not too spicy at all! <br><br>The bf contributes: \"the music is good [Nirvana as I type] and the customer service too.\"", "pics": null}}, {"review": {"des": "I dined in with a date around 6pm on a Monday and didn't have to wait to make my order, but the place was very active since there were baseball games playing on TV.<br><br>The inside is super, super casual and feels like a college sports bar (not in a bad way).  The tables have a pail with chalk in them because you're allowed to draw on the tables... pretty cool and fun.<br><br>The guy at the register who took my order was very chill and easy to talk to.  I ordered the popper and my date (who had been here before) ordered the frenchie.  We sat down with our number and it took about 7-10 minutes to get our food, which seems pretty standard.<br><br>This food leans toward comfort/drunk food.  They tend to be heavy in cheese, fats, oil, but tastes oh so good.  Overall, I've never tried a grilled cheese sandwich prepared in this manner with several different ingredients and I really enjoyed the food even though I was sober.<br><br>The popper included: Cheddar cheese, cream cheese, cheddar sauce, fresh jalapeño slices and bacon on sour dough bread. DIPPING SAUCE - SPICY CHIPOTLE MAYO<br><br>The frenchie included: American cheese, mozzarella cheese, cheddar cheese sauce, classic thick cut french fries, bacon and chives on sour dough bread. DIPPING SAUCE - SOUR CREAM<br><br>I liked the popper over the frenchie, but I'd consider both to be very tasty.  I didn't ask for more dipping sauce, so I'm not sure if it'll cost extra or not, but I wish there was more dipping sauce with the sandwich.<br><br>If you're looking to indulge and you want a twist on the classic grilled cheese sandwich, try this place out... if you're coming back from the bars and want something in your belly, don't hesitate to drop by too because they are open very, very late (like 3am late most days of the week).", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IEhOSvOmL5yRNeg9l_UpGw/348s.jpg", "caption": "The frenchie"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TgBFAsjuvs07QcLy91myQw/168s.jpg", "caption": "The popper"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/W6Ir0qR3khws41Zr9Zim6g/168s.jpg", "caption": "Chalk to write on table"}]}}, {"review": {"des": "I LOVE THIS PLACE! They really have good chicken tenders and fries. The fries have so much flavor,<br>It makes your mouth water when you look at them. Love this place.", "pics": null}}, {"review": {"des": "This is what made me fall in love with Chicago. Yes, I know you're thinking Cheesie's? But grilled cheeses with Mac and Cheese? They know the way to this woman's heart. I never tire of these amazing melt in your mouth grilled cheeses and I dream about them constantly. Then add the amazing tomato soup dip, and French fries. I have tried to cheat on my Mac n Cheese grilled cheese, but every time I go anywhere else. Visions of Cheesie's dances in my head. I also love the fact that if I wake up before 2 am with a grilled cheese dream. I can make that dream a reality. I love everything about this place.", "pics": null}}, {"review": {"des": "Awesome late night food in Lakeview!", "pics": null}}, {"review": {"des": "Great service, very nice people and the food is awesome! Definitely a must stop place when visiting Chicago.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mNz1UlFtGNNk2w0No6EWLw/348s.jpg", "caption": "Now that's Cheesie! Gonna enjoy myself a Tenderizer!"}]}}, {"review": {"des": "I was very impressed with this renowned Chicago spot! It's a fun environment with a friendly staff and delicious food. I ordered The Mac sandwich, and was pleasantly surprised. For $8, you get a lot of delicious food. I definitely recommend this spot for anyone looking for a quick and fun bite right off the Belmont L stop!", "pics": null}}, {"review": {"des": "I love Cheesies for their sandwiches, but the new pizza aspect left me wanting more. It was definitely disappointing and defintiely didn't taste great. Really sad.<br><br>Edit: I had given three stars because i love their grilled cheese, but their pizza made me very ill, I was sick not even an hour after I ate there.", "pics": null}}, {"review": {"des": "My dad and I got into Chicago around 11:30pm and we were looking for some late night grub within walking distance of our hotel. Thanks to Yelp, that's when we stumbled upon Cheesie's ! <br>Conveniently located close the the L (Chicago metro station), Cheesie's was poppin' on a late Friday night - upbeat music, young beer drinking crowd, and unique grilled cheeses that perfectly pleased the palate. When we walked in, we noticed a few open tables and bar spots (Plenty of tvs around the pub), but the security personnel at the door advised us to grab a table as quickly as we could before it got taken ... so, it does get pretty busy. I grabbed a small table by the window while my dad ordered our food and beverages at the counter (no wait staff for the tables). The menu is limited in a sense that it's JUST different types of grilled cheese sandwiches, but don't let the limited menu fool you ... the grilled cheese sandwiches are AMAZING ! I ordered The Frenchie (American cheese, mozzarella cheese, cheddar cheese sauce, classic thick cut French fries, bacon and chives on sour dough bread - sour cream dipping sauce) and a side of seasoned fries. WOW !!! The food was delivered in about 7 minutes and finished within about 2... I completely devoured the sandwich like it was my last meal ... it was so dang delicious ! The Frenchie was all the cheesy goodness you can imagine. And the bacon... what more can I say !? I was in heaven. <br><br>I highly recommend a visit to Cheesie's!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yoQLj41Ww7Wi3XL_sRvDPA/348s.jpg", "caption": "The Frenchie w/ seasoned fries"}]}}, {"review": {"des": "I love Cheesie's. Admittedly it's hard not to like a place with an interior that's painted the rich orange-gold of easy mac, but they really come through with the comfort food. The menu is just a variety of tasty grilled cheese mash-ups and pizza slices, but the simplicity is not a drawback - it's all delicious and creative, and I've never had a disappointing bite of food from them. My favorite is the Caprese, but don't ignore the specials!", "pics": null}}, {"review": {"des": "Cheesie's is considerably overhyped. <br><br>The tenderizer is essentially a grilled cheese sandwich containing a few pieces of buffalo chicken. The bread overwhelming tasted like butter.<br><br>The loaded tots were topped with chili, cheese, and chives. The smothered tots were no longer crispy and was essentially a bowl of mushy potatoes.<br><br>I wouldn't recommend turning to Cheesie's unless you're desperate for a late night fix.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tUQDYAIHyS2FxOM_idrynA/168s.jpg", "caption": "Loaded Tater Tots"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ch02rMDuNh40ysZ9Wfr00w/168s.jpg", "caption": "The Tenderizer"}]}}, {"review": {"des": "Do you love toasted cheese sandwiches? Well then be sure to stop in here. This place is ALL ABOUT CHEESE.<br><br>They have a large selection of cheese sandwiches using all kinds of fixings. Meat, cheese, sauces. All kinds. They will have something for everyone. Be also sure to try their sides and appetizers. Specifically the loaded tater toys. <br><br>For my visit I had the tenderizer which uncultured chicken tenders and BBQ sauce and cheese. I was most pleased with it. <br><br>I ended my meal with an alcoholic root beer and some cheesecake bites. The root beer wasn't bad. I wasn't too crazy about the cheesecake bites. They were good. Just not that exciting at least for me.<br><br>If you are in the area stop on by. You won't regret the cheesiness!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/K7Fln1MYmO_kc1_Upr6rnw/348s.jpg", "caption": "Cheesecake bites. Not bad. But nothing too amazing."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/i6uqkHba3BhBHi1mz_NC9w/168s.jpg", "caption": "The el Jeffe! A spicy sort of sandwich. Very good as well if you can take the hotness."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/y-2bgePcH4ObNgl9OoEJqg/168s.jpg", "caption": "The Tenderizer. It includes chicken tenders. Though I ordered mine without hot sauce. Very good!"}]}}, {"review": {"des": "I. LOVE. CHEESIE'S. I *will* admit that usually when I'm here, it's after a long night of drinking, but in my defense I feel less guilty eating one of their incredible, giant sandwiches after I've had a beer or two. 0:) I highly recommend the Mac (I think it's called, sorry if I got that wrong!) because it has MACARONI AND CHEESE on it, and they give you a lil' dipping-sized portion of tomato soup as well, which is perfect. The staff here is always very nice, too, even in the wee hours of the night, and last time I was there, they were playing The Office on the TVs. Who doesn't love that show?! Anyway, Cheesie's is the absolute best and one of my favorite spots in Lakeview!", "pics": null}}, {"review": {"des": "Service is really friendly and this seems like a very chill place for cheap drinks and food. I had the Mac n Cheese sandwich which was tasty. If you check in on yelp you get 10% off!", "pics": null}}, {"review": {"des": "Slice Ready to go pizza that takes 45 minutes. Yum service is slow for no reason. Waited to long for old pizza.", "pics": null}}, {"review": {"des": "The food it's okay if you're too lazy and don't want to make a grilled cheese sandwich but the staff is okay used to be some weird attitudes in there", "pics": null}}, {"review": {"des": "I am appalled about the amount of chicken they put on my sandwich. It was very skimpy, I ordered the melt from Cheesie's and I asked the manager and the manager was harsh with me, and swore at me and I felt that was extremely unprofessional so I don't know if I will be going to that location again.", "pics": null}}, {"review": {"des": "I can not live without the wonderful cheese curds that I only can find at Cheeses. The place is extremely noisy and the attendants are mostly of the time rude.", "pics": null}}, {"review": {"des": "We stopped in before a cubs game for a early lunch. The food & service was outstanding. We would highly recommend Cheesie's!", "pics": null}}, {"review": {"des": "I love the grilled cheese here. I've eaten here since this place opened and it has been good from the start.", "pics": null}}, {"review": {"des": "So good and now Slices of Cheesie's is open, it's expanded with more choices with a variety of freshly made-in house pizza,  full bar, and free arcade games!  I'm loving this place even more!  Yummy good place!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XYczrci2K7VhrxmWQVzqkg/348s.jpg", "caption": "Open"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2Xo6SU0yQktY2_HbKm_e0Q/168s.jpg", "caption": "New expanded Cheesies on Belmont attached and open for business!  Great job!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IxuFHTM3ADXoC0KO6zydzA/168s.jpg", "caption": "Yummy goodness"}]}}, {"review": {"des": "Overpriced but I still keep going back. I can't eat here everyday. Definitely a guilty pleasure. I really enjoy when they have the chalk out for us to draw on the table . Not sure if when that happens but I was bummed out there was no chalk one of the times I visited . Everyone I've encountered is friendly. I recommend a soup and tots with every sandwich, I guess that's when it becomes overpriced but I need sides with my meal jaja", "pics": null}}, {"review": {"des": "I ordered the OG (original) grilled cheese sandwich because I was in the mood for a classic diner grilled cheese. Unfortunately, it was completely tasteless and mostly bread. Texas toast with a thin layer of cheese that disappears into the bread, and either not fully melted, or sat long enough before serving for the cheese to congeal. It was served with a side of tomato \"soup\" dipping sauce, which had good flavor but was cold, which made the sandwich seem even colder. <br><br>The best part of the meal was the fried pickles, which were perfect, came with a side of ranch, and a good sized portion for the price.", "pics": null}}, {"review": {"des": "Went here for lunch with my daughter after reading about it on a \"50 things you have to eat in Chicago\" list. My daughter is a grilled cheese freak (aficionado). She is 16 and has had grilled cheese sandwiches in over 100 restaurants, she has similar affinity and research with mac and cheese. She ordered The Mac. \"This is by far the best grilled cheese I have ever had.\" That told me this is 5-star food.<br><br>I ordered The Edgar. It was fantastic, every aspect. The bread, the cook, the cheese, the pulled pork, the slaw, everything comes together for a perfect sandwich.<br><br>It was not crowded on a Thursday at lunch, server was very friendly and food was prompt and hot.<br><br>This will be a go to every time we visit Chicago.", "pics": null}}, {"review": {"des": "Awesome food and staff is also very friendly . Can not say enough about how good the grill cheese sandiches are...especially the MAC and Tenderizer...", "pics": null}}, {"review": {"des": "It was ok grilled cheese. It was very heavy food. It's the kind of food you want late at night, but not necessarily when you're going out for dinner. More of a casual bar place.", "pics": null}}, {"review": {"des": "Genuine folks and great service!! Good choice of beers on tap (and drinks). The gourmet grilled cheese are to die for. This is the happening place to be if you are a grilled cheese lover!!!", "pics": null}}, {"review": {"des": "UGH SO DISAPPOINTED!!!! Had such high expectations because 1. So many good reviews and 2. It's literally cheese and bread and sauce all of my fav things how could anything go wrong?<br><br>Everything went wrong look at this sad, cold lil guy. Looks like you slabbed a bit of butter on there and forgot to GRILL the grilled cheese? The bread was cold and soft, not hot and buttery and crunchy like any grilled cheese should be. I am still crying about it. Also bread to filling ratio was way off-felt like I was just eating two slices of cold Texas toast. Sad!<br><br>Also, I got \"the popper\" modeled after a jalapeño popper and just gotta say it would be way better with cooked jalapeños. Grilled cheese should always be a hot, oozy experience, right?! The raw jalapeños made it so the sandwich didn't resemble a hot jalapeño poppers at all (hint: poppers are roasted in the oven.) Also the cheese kinda tasted fake like the nacho cheese you'd get at the movie theatre which I didn't expect from a place literally named after cheese......<br><br>They keep a star for giving dipping sauces with the sandwiches. I love sauce and I can sadly say it was the best part of the meal that I barely ate.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Q4jHJyprY7th3ZWPBMBt5Q/348s.jpg", "caption": "\"Grilled\" cheese....aka sad cold Texas toast"}]}}, {"review": {"des": "Macaroni and cheese grilled cheese is the GOTO. My jam! Can't wait to come back to Chicago just for my grilled cheese.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9lux9VaknoPd2w7yEC5x9w/348s.jpg", "caption": "Ahhhhhmazing! Came here after a fun night out. Wish u could have brought 50 more back with me to Cali!"}]}}, {"review": {"des": "Excellent grilled cheese combinations. The bar is laid back and good draught beer selection. I had the Napoleon with cheddar, blue cheese, tater tots, bacon, and hot sauce. My wife always likes the Popper with cheddar, cream cheese, cheddar cheese sauce, bacon, jalapeno on sour dough. I love that they have tater tots on the menu. Our bartender were awesome. Prepare for a wait though. I'll be back!", "pics": null}}, {"review": {"des": "Disclaimer: Cheesie's is sentimentally special to me. It is where my then ex-boyfriend, now husband met up as friends for the first time in 3 or 4 years. Annnd now we're married. There's romance in that there cheese!<br><br>My personal attachment aside, Cheesie's is everything you want when drunk or just into more creative comfort food. The grilled cheese is one of my favorite comfort foods. You walk up and order your sandwich at an order station. If you want an alcoholic beverage, you must order it at the bar. Cheesie's offers several different spins on the grilled cheese. I have had both the Tenderizer and the Melt. Both have bread and cheese, as you'd expect. The Tenderizer has fried chicken tenders on it. The Melt has cubed pieces of grilled chicken. They both come with a dipping sauce. One thing that amazes me about Cheesie's grilled cheeses is that, while they are delightfully gooey, they manage to stay together making the actual eating very easy and without distractions of goop falling everywhere. That being said, I still would not recommend this as first date food if you're self-conscious about getting a little messy. These sandwiches are the kind you want to scarf down. There are also a number of sides such as fries, tots, etc.<br><br>Cheesie's also offers alcoholic beverages. A lot of them pair really well with the grilled. I'm not sure if this is a happy accident or purposeful, but it's great.<br><br>And finally, the service has always been great. Everyone is very friendly, and it's usually pretty fast.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mxtHTWnba5i3ngTObmuJCQ/348s.jpg", "caption": "The Melt (chicken, cheese, tomatoes, bacon, etc.) with garlic mayo."}]}}, {"review": {"des": "My boyfriend I's FAVORITE late night munchie joint.  We always order on the Grubhub app so it's ready to go when we get there (we live all the way on the Northwest side of Chicago).  We try to go at least twice a month and we would probably go more often if we lived closer.<br>My boyfriend loves THE TENDERIZER and I ALWAYS get the Mac&Cheese with added bacon.<br>The mac&cheese bites are also PHENOMENAL.<br>LOVE THIS PLACE.", "pics": null}}, {"review": {"des": "We rented the Cheesie's truck for an employee appreciate day. The Cheesie's staff was super friendly and everyone loved the quick service and tasty sandwiches! It made our event really fun and we'll be on the lookout for the truck around the city!", "pics": null}}, {"review": {"des": "If you love grilled cheese, you MUST try this! So delicious, fast & cheap! Great drink selection & delivery! The mac is probably my favorite thing, EVER!", "pics": null}}, {"review": {"des": "Stumbled onto this fun place when we were in the neighborhood and needed a quick bite before a show. Seeing you could get pizza by the slice sold us; we each got a slice and on impulse, an order of the spinach-artichoke garlic knots to share. Glad we did; they were amazing. Loved the atmosphere and sorry we didn't have time to check out Ms. Pac-Man and the other arcade style video games. Friendly service.", "pics": null}}, {"review": {"des": "This place was good as the first time I visited it. My friend and I order the original? (plain grilled cheese). Cheese was good, but the bread was the best. So soft! My friend and I only ordered one sandwich. However, when the order came out, it was already on two plates with each of its own sauce. How sweet of the waitress!  Definitely pricey for a plain grilled cheese sandwich though. I would go for a specialty menu item.", "pics": null}}, {"review": {"des": "Love the food! My taste buds sing cheesie happiness! Been there a few times now and every time it's worth it. I have yet to have poor customer service. The food is always hot and fresh. Excited to see them expand soon! Can't wait to go back for more", "pics": null}}, {"review": {"des": "This place is awesome! Super fun, good food, GREAT shots, and awesome atmosphere. I'd definitely come back.", "pics": null}}, {"review": {"des": "Genuinely friendly service from the bar maid. Def coming back. We have been here many times and we try different sandwiches of which all please ya very much. Average beer and cocktail selection and odd lay out. They have Groupon deals that are awesome as well.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/L4ukduCrLjsa1XtrZgQh_g/168s.jpg", "caption": "The popper was poppin!! Delish"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5mg9ZcHNAaTK0LKQY7LTCg/168s.jpg", "caption": "Caprese cheesie sandwich."}]}}, {"review": {"des": "All different kinds of grilled cheese, we ended up here because another restaurant had  <br>too long of a wait.  I got \"the mac\", mac and cheese grilled cheese it was okay. My wife got the popper grilled cheese that had jalapenos, cream cheese, cheddar, bacon and other goodies on it, I tried a bite, I think that was the sandwich to get, it was really good.  The kids tried the mac and cheese kids meal that was really affordable ($3.99) but they didn't care for it, they're picky about mac and cheese.  We also got cheese curds to share and I was thinking they would be really good for a place that's known for grilled cheese but they were pretty average.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XH7ByP_pfIw38EMteU7jqQ/168s.jpg", "caption": "Kids meal - mac and cheese"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6I6kIThpN3LXNXO2QCHbCg/168s.jpg", "caption": "The Mac - mac and cheese grilled cheese"}]}}, {"review": {"des": "The tomato soup needed seasoning. But the grilled cheese sandwiches were very good. I had the Classic & my son had the Caprese. I added blue cheese crumbles, but I couldn't really tell that they were there.", "pics": null}}, {"review": {"des": "You had me at cheese....  Great place located right near the Belmont El Station.  If you are a fan of grilled cheese sandwiches, this is the place for you.  It's definitely a sports bar place, tvs, large central bar, high-top tables and stools.<br><br>Order your sandwich and sides at the counter and they'll give you a number to bring it out to you.  No table service here, but the bar is steps away from all the tables to get your refreshments.<br><br>I ended up going with the \"tenderizer\" that had chicken tenders within the grilled cheese and came with ranch on the side for dipping.  That, combined with tots and beer, I was in a food comma for the next couple hours.<br><br>The staff was super nice and the inside of the place is this bright orange color (almost like you were inside a huge hunk of cheese).  The walls are adorned with pretty playful murals and paintings.  I like how they recreated some art masterpieces but threw in some grilled cheeses - For example... dogs playing poker turned into dogs eating grilled cheese sandwiches.<br><br>This place had a lot of San Francisco sports penants and banners up, so it seems like this would be the place to go if you were a Giants fan or a 49ers fan.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XEM5mqI7l1WYt9MVTxdK5g/348s.jpg", "caption": "Tenderizer and sweet potato fries"}]}}, {"review": {"des": "OMG, do I love cheese! I haven't had a bad meal at Cheesie's, and that includes their food truck down in the Loop. Hooray!!<br><br>My favorite? The Popper - cheddar, cream cheese, jalapenos, and bacon. Oh my, I'm hungry now. Fries are good. Beer/liquor selection is a little limited.<br><br>If you find a place at the bar, they'll take your food order, otherwise you have to stand in line to order and wait for them to bring it to your table. Not a big deal except it gets really crowded on weekends and difficult to move around.<br><br>It's a young crowd and LGBT-friendly, and they play fun music too.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/A6J4my3_y81ND9Bnq5OwHQ/348s.jpg", "caption": "The Popper"}]}}, {"review": {"des": "What a terrible service experience we had here! <br><br>Waited at the register for awhile before anyone greeted us. Then finally I was able to speak to someone and I inquired about the sides options and asked why the coleslaw, provided as a sandwich topping on a menu item, wasn't provided as a side -- and I asked if we could get it on the side for our sandwich. The cashier responded that she didn't know why anyone would ever want coleslaw as a side, and she wouldn't give it to us.<br><br>Ended up with a cold grilled cheese.<br><br>Not worth the hype! Make a grilled cheese at home. Will not be going back.", "pics": null}}, {"review": {"des": "Good food and friendly staff.  They take grilled cheese to another level.  Sometimes it can be a bit loud and crowded", "pics": null}}, {"review": {"des": "How long does it take to make a goddam grilled cheese? 30 min later I'm still here waiting. I'd leave except I spent $10 a sandwich so screw it, guess I'm stuck. The absurdity of how disorganized the staff is would be comical - expect I'm starving and there's no food. Never again.", "pics": null}}, {"review": {"des": "This place is like my second home since furious spoon had to go and do me dirty. Cheesie's is one of the most chill places you can possibly go to. The food is phenomenal and the servers are so sweet every time. You can tell everyone that works here loves working here and they always have a big smile on when I sit down at the bar. The location is perfect and every time I come here is a treat.", "pics": null}}, {"review": {"des": "This place is a fun concept that you'll want once in a blue moon. Or when you're struggling to find a place that is open late at night. <br><br>Tons of grilled cheese options. And a few sides and alcohol. The bread is too thick in my opinion but it tastes good. <br><br>Definitely check this place out if you've never been.<br><br>That's all I have to say about that.<br>Jackée", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZeEVUYKo2SmVWJCtABoirw/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/y0r1ayJzoQlVR82D8SNwTw/168s.jpg", "caption": "Mac and cheese grilled cheese"}]}}, {"review": {"des": "Have you ever been extremely drunk or high and decided to just throw a bunch of random stuff together and eat it? Okay, we'll do you remember how good that concoction tasted? Imagine that...but with grilled cheese. <br><br>So I had to put something on my stomach before drinking (obviously) & roommate suggested Cheesies. Ive heard of the place but never had the chance to try it. I was about a half an edible into my night when our food arrived (got The Classic with loaded tater tots). First bite and I'm like woah...what is this sorcery? It is SOOOOOOoooOOoooo delicious. Let's be very clear. My sandwich was on Texas toast and had ham, tomatoes, American cheese, cheddar and I think that's all. It was SOOOOOOOOOOOO good. The tater tots were smothered in their chili and tbh I'm coming back for the chili alone. This is perfect drunk food! <br><br>Will be back!", "pics": null}}, {"review": {"des": "Definitely not a light meal you order, but if you want something fast, greasy and delicious then this is the place for you. <br><br>I ordered the Tenderizer which was super good but could have used more chicken, my friend ordered The Melt which I actually likes better than my sandwich. The cheese was delicious on both sandwiches. We also got the loaded tots. Tots could have been crispier but the chili they were under was pretty good. <br><br>The servers were super nice, especially the greeter at the door. The other staff was really nice and courteous as well.<br> <br>The place is pretty small, there's a bar area and then some tables. We found seats though. We came on a Friday evening. It's pretty loud, but we expected it. Looks like they have cool drink specials too. Overall will definitely be coming back here to try the other sandwiches!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/M_Gwz4zRlzb0BVpZQ6jTIA/348s.jpg", "caption": "The Tenderizer and the loaded tots!"}]}}, {"review": {"des": "I came here because my husband was amazed I'd never been here before, and I found a Groupon for it, so it was an easy way to try it out. It's a lot more bar-like than the one at Evanston (which I had been to before), which is more fun for a night out. I ordered the Melt, which I was expecting to be good, but it's probably my favorite of all the other sandwiches I've tried there. I especially didn't think it would beat out the Popper (I love jalapeno!), but there you are. My husband ordered the Mac, which is his favorite, just because it's ridiculous to be able to eat Mac & Cheese in a sandwich (also, it's delicious).<br><br>With the Groupon deal, we were able to get a side as well as a well drink each. I ordered a vodka and cranberry, and even though we were clearly doing it on the cheap, the bartender did NOT go easy on the alcohol, which I appreciated.<br><br>The atmosphere was fun and loud, and while I'm a little too old to be dealing with the college crowd, it wasn't too bad -- we were able to find a corner and enjoy ourselves.<br><br>Overall, a fun place to visit if you're in the area and up for eating delicious grilled cheese sandwiches in a bar.", "pics": null}}, {"review": {"des": "Great place to pregame before you head out for a fun night if you are not lactose. Their cheesie sandwiches are delicious. Tried half of the menu and all were good except the BBQ one. It just didn't connect with me. Oddly, I likes their chili the most. I started coming here just for the chili and few drinks.<br><br>Thursday night would be chili and few drinks with the wonderful bartender name Breezy. He is such a charismatic person. His laughter is contagious. That sum up the staffs here. Fun down to earth people.", "pics": null}}, {"review": {"des": "Loved the Melt and the picture below is the Frenchie! Both are amazing, and excited to try the Edgar next. The best comfort food in all of Lakeview!", "pics": null}}, {"review": {"des": "This is an update on the review that I left on 1/29/16. <br><br>FIrst and foremost let me preface this updated review and say that I still think this makes great drunk food. And by that I mean, because the nature of this food is very heavy on cheese, bread, grease, and calories, one very drunk person would not care too much of the pound you gain from the meals consumed here.<br><br>The UPDATE however has everything to do with service. After I left my review, I was sought out via Yelp from the General Manager of Cheesies : Sarah Jean AKA Momma Cheesie. She comped a meal for me. And even had them deliver it to my apartment. Gratis. That spoke VOLUMES to me. That the leadership of the Cheesies franchise is so personable and down to earth...its no wonder that their success has thrived. <br><br>I made sure to try different items from the menu. I skipped the soup and opted for sweet potato fries. They were delicious when eaten with hot sauce! I ordered the Melt and also The Gladys. THE GLADYS IS AMAZING!! Its a chicken and waffles sandwich and unfortunately only offered in February. I think this is a huge mistake. I really think that they need to add this to their regular menu. I would probably eat here weekly if that were the case. <br><br>Surprisingly this meal traveled well with delivery. Probably due to the awkward non-rush hour delivery time I ordered it, but it got here promptly and was still warm when I received the bag. <br><br>THANK YOU SARAH JEAN!", "pics": null}}, {"review": {"des": "One of my favorite spots in Lakeview, if not the favorite, great food, great beer, affordably priced, you can walk up and order food and they bring it to you, plenty of TVs, lotsa good craft beers, I love coming here, I've had the original grilled cheese, the mac n cheese one, and the melt sandwich; plus sides of regular fries, sweet potato fries and fried pickled and cheese curds. All the sandwiches look great, I'll likely try the whole menu before too long. Convenient location right under the L, and close to Wrigley and everything else popular in Lakeview. Can't wait to go back", "pics": null}}, {"review": {"des": "It took me two hours to get here, but oh my gosh was it worth it!!!!!!! The service was phenomenal and the food was just as great. The staff is very friendly and outgoing. I felt like we were friends outside of the restaurant. Lol. They were very helping and attentive. Oh gosh the food though... I've been to the cheesies in Lagrange and let me tell you this location is 4794017840 times better. The food was fresh and filled with delicious gooey cheese. I got the sandwich of the month which was a grilled cheese filled with grilled onions and andouille sausage. There was more than enough cheese, and they were very generous with the sausage. I would recommend this place 10/10. So worth the calories! They also expanded the place not too long ago. One side is the same exact menu but instead of grilled cheese it's pizza. Next time i go there, I'd definitely want to try their pizzas.", "pics": null}}, {"review": {"des": "I took an uber from a vampire bar to cheesies.<br><br>Honestly who doesn't love melted cheese on bread? A crazy person. <br><br>5/5 the cashier humored me and didn't kick my waisted(Kim K) asss out.", "pics": null}}, {"review": {"des": "COST:<br>$8.49 (The Classic)<br><br>Coming from Los Angeles aka the land of The Grilled Cheese Truck, I came in with high expectations even though I was probably more inebriated than I could lawfully judge the place, LOL!<br><br>After a night of clubbing, we walk into this place and my gosh, it's like we walked in to another bar! It was fantastic! They were playing some late 90s, early 2000s pop music and it was awesome.<br><br>The food was great and any entree order comes with regular tots. I will definitely be back for more!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AaUmhcpFJRdGg0gJ3ZlTSA/348s.jpg", "caption": "The Classic! BOMB"}]}}, {"review": {"des": "3.5. Good value for the $6 cocktails/beer. Good service, maybe lengthy if packed. The place is just a bar, but it's good for the price. Relatively clean & the staff keep it orderly even with drunks or their food rush.", "pics": null}}, {"review": {"des": "Watch out, these guys need to work on their communication skills. We had a party of 6 stop in for some grilled-cheese, good right?, loaded tots, a few sandwiches and beer and everything is good. Unfortunately they missed 2 sandwiches, one of our party went to the counter to let them know, and a few minutes later they bring out one sandwich not two. After another ten minutes of us waiting for the 2nd we again approach the counter and they were extremely rude, saying they thought everything was out as our friend received their sandwich. All the while we're sitting on 3 order numbers at our table. It's not the customer's fault the restaurant can't keep their orders straight, the sandwich eventually comes out another 10 minutes later - but we find out they charged the sandwich to our friend who opened a bar tab... <br><br>One star for poor service, poor attitude and bad communication. Buu!", "pics": null}}, {"review": {"des": "Terrible delivery drivers and terrible service. I always add-on extra dipping sauce and they never add that to the bag (that is straight up Cheesies fault). They charge wayyyyyy wayyy too much for delivery service. The delivery services are absolutely terrible. Our driver called to say 'I don't know your address and I don't have your food.' Just make your own grilled cheese because this place is terrible.", "pics": null}}, {"review": {"des": "A restaurant that does not rip you off and specializes in grilled cheese sandwiches? I'm so in. <br>Cheesie's has other offerings, like soups and sides. I had a chicken tender grilled cheese and we shared tots, which were so good.<br><br>Ordered at the counter and they brought us the food rather qucikly, despite the crowd.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nRju0vd3cE78jlFhdMShBw/348s.jpg", "caption": "Chicken tender with BBQ sauce and a side of tots."}]}}, {"review": {"des": "Fun atmosphere. Good food, great beer selection. Went with family and what made difference for us was Yolanda. She was awesome.", "pics": null}}, {"review": {"des": "Came here late last night with a couple of friends. The first thing we did was order a round of beers and an order of fries. The fries were amazing! They were hot, fresh and perfectly seasoned. Our server was really great too and all the staff we encountered were very friendly. I ordered just a regular grilled cheese sandwich. The sandwich was pretty good but I could not stand the tomato dipping sauce it came with. It was a bit too bland. Will definitely be coming back for the great service, sandwiches and fries!", "pics": null}}, {"review": {"des": "My first experience with Cheesie's was at Lollapalooza a few years back. I vividly remember that first bite of the buffalo chicken grilled cheese with bacon (The Tenderizer) I got and it was like taking a bite of a piece of heaven.<br><br>Fast forward a few years later and that sandwich still haunts my dreams. We found ourselves in Chicago for a Cubs game and wanted to grab some food afterwards. What's within walking distance? Cheesie's.<br><br>It's got a bit of the hole-in-the-wall type feel which is one of the best parts. I obviously got that same sandwich that stuck with me for all those years and was not disappointed. It was like being reunited with an old friend. Another great perk? Full bar, complete with a solid beer selection. Be still my heart.<br><br>I love this place and can't say enough good things about them and their sandwiches. It was so good, so very good. My only complaint is that it's so far away from where I live, but I'll live. I'll always make sure to try to stop when I find myself in Chicago.", "pics": null}}]}