{"name": "chi-cafe-chicago", "reviews": [{"review": {"des": "This place is legit. I ordered delivery from here on Monday and the food was soooooo delicious. The food arrived faster than I expected and was perfectly packaged - no spills or leaky bags, thank goodness! It even came with wipes. I mean talk about service! <br><br>I ordered:<br>- sweet and sour chicken<br>- beef and tomato on rice<br>- wood mushroom and onion with Chinese okra<br><br>Total cost with tax and tip was less than $40 bucks. Portions were standard with enough leftovers for a few days if you're a solo diner like me. The food was amazing. It was definitely authentic Chinese food, although the sweet and sour chicken was more standard, but still well executed. In particular, the vegetable dish was unlike anything I've ever had. I could not stop eating it and would definitely order it again. <br><br>I'm so glad I tried this place. It's located in Chinatown so if you're in the area or if you're in the delivery radius, I highly recommend you give it a try. I can't wait to order again!", "pics": null}}, {"review": {"des": "My favorite things to order here are:<br><br>Hot and sour soup<br>Baked over rice - chicken over rice in Portuguese sauce<br>Salt and pepper pork chop<br>Beef fried rice<br><br>However, the pricing on most items have gone up, while the quality and portion size has gone down. For instance, today I ordered a spicy beef fried rice. At first glance, I didn't see any beef in the dish. I moved the rice around and found a few pieces of very chewy beef. The only other ingredients I saw were jalapeños, sprouts and a sprinkling of green onion. I swear, this dish used to have eggs in it too and used to be a lot more tasty. Also the portion size is much smaller now. This container used to be filled to the top! The smaller size would be fine if it still tasted as good as before, but it's mediocre at best. They only give one small container of chili oil per entree now too. So stingy. This used to be my go-to place for beef fried rice, but after these last few orders, I give up. Anybody know better place for beef fried rice?", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lN5i_ImPGuKrpjxilBT1iA/168s.jpg", "caption": "beef fried rice - few pieces of very chewy beef. Not as good as it used to be"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GQ-P9Jx7TLY0IyW-ZrevkQ/168s.jpg", "caption": "beef fried rice - where's the beef?"}]}}, {"review": {"des": "After two years of failed Chinese food delivery, Chi Cafe came to the rescue. I took a look back at how many times I've ordered food from this restaurant for the past two years and I've hit a total of 51 orders (including last night). <br>My favorite dish is by far their fried rice. It tastes so good whether it's shrimp, chicken, or even vegetable fried rice. With every order, I make sure to never skip out on the crab-rangoon. It's mouthwatering and cooked to perfection every time. To down all that goodness? I suggest ordering one of their smoothies. They basically have any flavor you'd desire in a smoothie. My all time favorite is the avocado flavor. It hits the spot every time! <br>The delivery always comes early, even though I am located about 5 miles away. The drivers are very polite and take really good care of your order. Not once did I ever get a messed up or spilled over order. <br><br>This restaurant is open extremely late, so if you're craving Chinese food at 3 in the morning, this place can deliver right to your doorstep or table, if you decide to dine in.", "pics": null}}, {"review": {"des": "Has it been 8 years since I first wrote a review for my favorite Chinese restaurant? I visited this place quite often on the weekends creeping into the late night hours. I never cared that it was out my way...too long a drive from home. When I relocated to North Carolina for four years, I so craved this place. Honestly, it messed me up for any other Chinese restaurant. No others could compare!<br><br>Since returning to Chicago this past summer, I kept thinking about this place. I was craving Chinese for awhile and against my better judgement, tried a new place towards the Brickyard area. After that disaster, I knew I had to come here no matter what.<br><br>The perfect opportunity popped up while we were in Downtown seeing the Christmas tree lighting. My family wanted to go eat and I suggested heading to Chinatown. The distance was just right. I was super stoked.<br><br>Chinatown has changed since my last visit. Brighter and livelier. New businesses. Glad Chi Cafe was still in business. Busy night and there was a bit of a wait to be seated. Ordered the usual plus some noodle dish I wanted to try. Food never takes long to arrive. Looked and smelled amazing. The size of the shrimps though! I savored my first bite. I cried inside of sheer happiness. I wish I came alone. There was no seconds to be had!!! <br><br>I truly enjoy coming to this part of town. I love how fresh and flavor balanced the food is. The servers are attentive. Water glasses always full. Empty dishes cleared away. Always being asked if there is anything else we need or if anything needs to be packaged to go. Great vibe. Authentic food.<br><br>I could try other places in this same strip, but why mess with what I have found to be a treasure to me. Can't wait to visit again- by myself!", "pics": null}}, {"review": {"des": "Need a good meal around 3 in the morning? Then definitely check this place out! They're open until 4am and have good food!<br><br>They have a really thick menu cause they have a LOT of food options so you're bound to find one that'll suit your taste. Just be sure to ask the servers about menu items you're not familiar with or have generic names. I ordered a Meat Variety Noodle Soup and all the meat on it were internal organs which I'm not a fan of and the menu didn't state that (I should have asked). But all the other dishes we ordered were delicious. <br>Their service is also pretty quick, no matter how packed the place is.<br><br>Will definitely be going back to try their other stuff!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wTY3Ve3E9V8LKzKsQJI8gw/348s.jpg", "caption": "Fried Rice"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nqBndvxrmWg5fEfrGECZfw/168s.jpg", "caption": "Pork Chop Soup"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_AutFec8Bk1HYLoU7bHegw/168s.jpg", "caption": "Meat Variety Noodle Soup"}]}}, {"review": {"des": "This place is where you'll probs gain a few! Rice rolls xo sauce ($6), salt n peppa Japanese tofu ($9), seafood combo fried rice ($11), and chow mein ($11). Lord. Everything was good!<br><br>Japanese tofu is my favorite dish and it was crispy and salted well (not too salty). The xo rice rolls were good and greasy lolol. Chow mein was crunchy. It was really good.<br><br>The service was awesome here! They're really friendly and helpful. But they did forget our salt and peppa squid. Lol. He cancelled it tho from our bill. Overall, really great place. Especially for a late night grease sesh.", "pics": null}}, {"review": {"des": "Seems to be quite the spot for late night from some of the reviews I browsed through, but it's a solid spot if you're looking to grab a Hong Kong style morning breakfast for cheap.<br><br>They have $5.95 and $6.95 combination breakfast options. You can choose from different noodle soups, stir fried noodles, congee and even more traditional American breakfast options and each comes with your choice of a beverage (milk teas, coffee, ovaltine, etc). Service is pretty spotty here and you'll definitely have to be assertive and flag someone down when you need to order/pay.  But aside from that, I'll say my noodle soup with beef brisket and instant coffee was quite delicious for an early Saturday morning. Would also make quite the hangover cure as well.<br><br>Can't complain for the price point. I'm sure I'll be around this one again sometime soon for breakfast. <br><br>'Til next time, cheers!", "pics": null}}, {"review": {"des": "The environment was very clean and comforting.  The waiters talked to us very friendly and served us within 10 minutes of us ordering our food.  I ordered the Salt and Pepper Pork Chop with a side of Strawberry Fruit Smoothie.  For an appetizer, we ordered the fish cake balls.<br><br>The fish cake balls were light and crispy, and it came with a greenish-curry-coconut milky dipping sauce.  I'm not too sure what the Chinese name for it is, but it tasted good with the fish balls, but at the end we had some leftover balls we went back to finish after the meal and the sauce was too cold and didn't stick to the balls.<br><br>My pork chops were definitely salty, as the name entails, but it tasted good with the bowl of rice on the side.  They were breaded and fried crispy, which made it so delicious.  There was lots of garlic and hot peppers on top, which I enjoyed, but for those of you not into the garlicky, hot spicy flavor should stay away from it.  I personally enjoyed it and cleaned every las piece of meat off the bones.<br><br>The fruit smoothie was also awesome.  You could taste the strawberry pulp inside, and the bobba tapioca was cooked perfectly.  The only inevitable thing was I got some of the seeds stuck in my teeth after the meal, which is a good problem I guess because it means they are using actual fruit and not artificial flavoring.<br><br>The pricing was fairly reasonable.  My friend ordered the Fried Turnips with Rice Cake and XO Sauce, which he said was just what he wanted.  I don't have much details on it though, since I was content with my meal.  It looked yummy though.<br><br>Customer service here is decent once you call the waiter over.  We were seated and had to ask for a menu, then we had to ask for water, had to ask to place our order, and had to ask for the check.<br>(-1 star because of this, but everything else was great)<br><br>If I could honestly rate the restaurant, I'd give it a 3.75, but since I gave it a full star it had to be 4.  They were also playing Christmas music before Halloween, which was interesting...but had to take off another 0.25 stars.<br><br>Pricing:<br>Watermelon Fruit Smoothie w/ Tapioca: $4.50<br>Strawberry Fruit Smoothie w/ Tapioca: $4.50<br>Fried Fish Balls: $4.95<br>Salt and Pepper Pork Chops: $9.50<br>Fried Turnips and Rice Cake with XO Sauce: $6.50", "pics": null}}, {"review": {"des": "Solid Chinese food at Chi Cafe! They are very efficient. We ordered quickly and food started rolling out. I highly recommend their hot pots - tofu/fish and also oxtail! Food came out steaming hot. The beef was so tender. The deep fried bao dough was delectable. The icing made it seem like a donut. I also loved the royal pan fried rice cakes. The sauces were savory and bold. The restaurant isn't too big, so accessibility is a little tricky. The prices are very reasonable.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MFxbM5HzBoD3KEWfzy9jsw/348s.jpg", "caption": "Crab Rangoon and deep fried bread"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WcAB-CKAu2Gt0p8JW6TROQ/168s.jpg", "caption": "Tofu and fish hotpot"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FNZKZ0-SOv93JGllAkTafw/168s.jpg", "caption": "Kung Pao Beef"}]}}, {"review": {"des": "Probably the worst Chinese food I've ever had in my life including from China itself where you don't know what you're ordering yet you never regret anything that you've ordered. I ordered one thing that I've never heard of before: pigs blood. It was weird, very much  like Jell-O and had absolutely no flavor to it but it was served with very distinctly rotten bean sprouts and had a terrible flavor to it. The terrible flavor was not attributable to the fact that it was pigs blood- it was just a disgusting sauce and rotten been sprouts. I also ordered some thing which was described in English as fish tofu and some sauce. It was huge piece of fish and  tofu that were completely unreasonable sizes to be eaten. We most definitely paid to have the foods prepared for us, therefore it was our expectation that they would do the very bare minimum of cutting the foods to edible sizes. It was an extremely uncomfortable eating experience. That had nothing to do with the chopsticks, which we are very comfortable using. The service was really bad- very slow and extremely inattentive as well. We won't be coming back.", "pics": null}}, {"review": {"des": "It's the best and most favorite place for me to go in Chinatown during last 9 years. After I moved to Dallas, it's one of my most missing places.<br>Love their music and TV program on premise.<br>Almost any dish I love so I won't make any recommendation.<br>The food quality and freshness are always satisfactory. Especially it's whenever you go, the quality is always among the best. The price is also very reasonable and inexpensive. <br>They have the 2 dollar for 3 hours parking voucher.", "pics": null}}, {"review": {"des": "This place is exactly what you'd expect--average Chinese food at a very great price. My favorite dish I had was the chicken fried rice. It was a huge portion that you could share amongst a party of 4, and it had the most flavor of all the dishes I tried (which isn't saying much, sadly). The Mongolian beef tasted like salt. The rice rolls appetizer had a great texture and large portion (~12 rolls) for $5, but it was lacking a little salt! My friend had the seafood soup, which had ample noodles but tasted like water. A+ for timely water refilling though.", "pics": null}}, {"review": {"des": "So damn good with an amazing fresh taste to all the ingredients! I got their veggie chow mein teriyaki noodles and they were so good man!<br><br>They had everything from carrots to sprouts from onion to mushroom and leeks, the noodles gave me life and moisturized lips!<br><br>They came out piping hot in a big ass bowl for only $8, you cannot beat a great deal and a full stomach. They gave you so much, you were sure to take some home. Even my friend I came with who eats like he was captured and starved, couldn't finish all of his food!<br><br>I also snagged some ragoons that were just like I like them, a little sweet, crispy on the edges, soft in the middle! 6 for a little of $3.<br><br>The location sat in a shopping center full of food stops in Chinatown. This spot was more of a restaurant with more than enough seating for their patrons. The restaurant does not serve spirits as an fyi for those like me who like to wash down a good meal with a brew. <br><br>I will definitely be back to get some of their amazingly delish grub.", "pics": null}}, {"review": {"des": "This place never disappoints - I've been here like five times, and there's always something good! Another perk, it's open late. <br><br>We always make an impromptu appearance here, and the food is always delicious and on point. The servers can help you make selections, if you ask. It's really quite wonderful in that we were about to order the shrimp dumplings, but the waiter took one look at us, and was aware enough to ask if we ate pork and beef, and we answered \"neither\", and he said, well the shrimp dumplings have minced pork! Disaster averted!!! I almost wanted to kiss him!!!! <br><br>We love the Sichuan Shrimp, and we always get all our orders made extra spicy. Also, their spicy shrimp fried rice is great too. The pan fried chow mein is another delight. The rice cakes are dope. But my FAVORITE part of the meal - their crab rangoons. We've ordered them five times and they've always come out hot and fresh! The tea served with the meal leaves something to be desired as it's bland, but the food is totally on point!", "pics": null}}, {"review": {"des": "It's 1:30 am on a Saturday night and I'm eating Chinese with my kids. Enough said. Best place for Chinese in Chinatown. Even this late it's packed. We actually had to wait for a table. <br>Our favorite dishes are the shrimp fried rice, fried rice noodles with beef and soy sauce, orange chicken. Today I tried the beef satay instant noodle soup and that was quite good. <br>I've never really had any issue with cleanliness. Yes, the soy sauce bottles are sticky and don't look at the bottom of the water pitchers, but overall, it's pretty clean. <br>Yes, customer service can be a little lacking, but that's ok, they don't mean it. I've also ordered delivery and never had an issue. Definitely recommend this place always.", "pics": null}}, {"review": {"des": "First time placing an order. I scoured yelp for over an hour seeking a place with great reviews for fried rice. I'm new to the neighborhood and was desperately craving house fried rice from my favorite spot in my old neighborhood. <br>Decided on Chi Cafe because of the number of great reviews. <br>Well I paid $28 including tip for an utter rip off and disappointment. I ordered Special Fried Rice (normally like $11) with extra green onion, beef, chicken, bbq pork and shrimp. I spent time clarifying my order to the nice man on the phone. I PAID EXTRA for all of it. In fact, I paid twice as much as the normal order costs. (When I order this at my old neighborhood spot, I get a carton with about 35-40% meat which is what I wanted. I planned to add stir fried shredded cabbage to it to lower the carbs so i needed a lot of meat in the dish.)<br>I received 6 shrimp and rice speckled with a few pieces of pork and beef. It also didn't have the fried-in-a-wok flavor I was looking for. I won't be placing a second order. <br>The only positive aspect was how quickly it was delivered but the food was a total let down and a waste of money.", "pics": null}}, {"review": {"des": "After landing in Chicago, my friend was adamant about taking us out for some Chinese food in Chinatown. I was kind of skeptical since we have our own Chinatown here in LA, but I trusted him and I'm pretty glad that I did. Again, I had no expectations for Chi Café, so I felt everything is decent for what they have here in Chicago.<br><br>Parking: They have a shared lot, but you'd have to pay for parking. I don't know how much the rates are because my friend paid, but it wasn't overly expensive.<br><br>Restaurant: Located inside a plaza with a bunch of other Chinese restaurants and dessert shops. You could easily miss it. Also, their door is kind of tinted, so we almost thought the restaurant was closed, but it wasn't! The restaurant itself is decorated in modern décor, definitely doesn't really resemble a traditional Chinese restaurant, but it's still nice.<br><br>Menu: They have a huge variety of dishes to share. Everything is extremely affordable. Most plates are $5 - $7, which is so cheap in comparison to what we have in LA. They even have a weekday Happy Hour menu, selected dishes for $4! We ended up ordering 3 dishes to share and 2 extra bowls of rice for an extra dollar each because I believe each plate only comes with one bowl of rice. Here's what we ordered:<br><br>Orange Chicken (4/5): This dish is actually not bad. The chicken was moist and they didn't over batter the chicken, so there's good meat to batter ratio. The sauce is light and citrusy, but slightly on the sweet side. I wish it was just a little more savory. I find it weird that they had the chicken on a bed of broccoli, but it's always good to have veggies!<br><br>Mongolian Beef (5/5): Surprisingly delicious. The beef was nice and tender, mixed in with lots of onions and green onions. I really like the sauce; it is extremely savory and not overly salty. I was very impressed with this dish.<br><br>Deep Fried Fish Filet (4/5): This came in a large portion. These filet nuggets were delicious. The sauce was good too, but I wish it was thicker so it'll cling onto the batter better. The sauce was definitely on the sweeter side, but it wasn't bad.<br><br>Overall experience here wasn't too bad for my first meal in Chicago. Granted, I still like the food at home better, but Chi Café is good. I really like that the food came out really hot and fresh, perfect for the cold weather. On top of that, the food is extremely cheap, which makes it even better! The food does take awhile to come out, so just be prepared!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hT06ETyJ6twCmajWfDJGmg/348s.jpg", "caption": "Deep Fried Fish Filet"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0xwpVSgC9JHd8FZthMqXsw/168s.jpg", "caption": "Mongolian Beef"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AgwaU-hYoNhyP160wHEfrw/168s.jpg", "caption": "Orange Chicken"}]}}, {"review": {"des": "This place is a drunk person after our Galore everyone that is Asian goes here at 4 to 5 a.m. because they are delicious food if it's late night and you and your live late-night munchies this is the place to go you might be able to find your own Asian persuasion. The smoothies are okay but I would say the price and the dishes are reasonably priced. Service is pretty good. I think I got the Salted squid Mongolian beef. Stop it speaks English pretty well.", "pics": null}}, {"review": {"des": "Great for late night eats. They are open till 4AM on the weekdays and 24 hours on the weekends!! You can't go wrong. Food is good. They got lots of appetizers, noodle soups, sizzling platters, chow mein, rice dishes. Lots of variety and everything is yummy  they have the standard bubble teas. Nothing really special though. I prefer the food more. <br><br>The decor is nice and modern. They got cool communal tables in the center or if you come in a group of six you get the whole table. My typical late night go to is usually one of these:<br><br>-shrimp wonton noodle soup<br>-beef briskets noodle soup<br>-bean sprouts and soy sauce chow mein<br>-preserved egg and lean pork congee<br><br>-", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dFVF6LN6Kyio6FumsoGlDg/348s.jpg", "caption": "Shrimp Wonton Noodle Soup"}]}}, {"review": {"des": "It could be that I've been spoiled by Chinese food in NYC, LA, and SF, but the food here was....ok at best. However, I admit I didn't order typical american-chinese dishes or meat heavy dishes. <br><br>The japanese fried tofu was actually pretty good. It had a nice crispy coating, and was very silky inside. The peppers also gave the dish some nice heat. <br><br>The jellyfish and beef shank was one of the worst I've had. It all tasted sour (including the meat), and the beef was way too tough.<br><br>The ginger pork lo mein didn't really have that much flavor. The noodles they used here are the thin ones used in wonton noodle soup, and it just came as a clump on the plate.<br><br>Lastly, service could be better. Had to put in a lot of effort to flag down someone to refill water and get the check.", "pics": null}}, {"review": {"des": "Food is unbelievably bad, at least for what we ordered: Beef Brisket with Steam Rice Noodle Roll and Stir Fried Chow Mein Noodle with Beef. As this was the first time having a meal here, we ordered what had pictures on the menu, which turned out to be entirely different between advertisement and actual products. The Beef Brisket with Steam Rice Noodle Roll had a small quantity with noodle roll, which was pretty fresh, smooth, and soft like foam, and only 2 pieces of brisket. The rest of the dish were pieces of beef tendon, which is much cheaper than the brisket, and a bland sauce. More jokingly, the Chow Mein Noodle with Beef had a super small quantity of bean sprout and green onion with just a few skinny slices of beef and excessive oily and greasy stir-fried instant ramen noodle.", "pics": null}}, {"review": {"des": "Not a bad Chinese spot. What I liked about it is that it's open late. I don't like tofu and wanted just veggies that day and was not a ton of options. Lots of great places around that I would do for dinner and keep this as a late night spot.", "pics": null}}, {"review": {"des": "Saturday afternoon stop. There were a lot of people there but it wasn't crowded. The chicken wings in sweet saki sauce are super good. The garlic wings are a bit too dry and a lot of the seasoning just falls off. The only con about the wings are that they're super tiny, you'd think they came from dinky dwarf chickens. We also ordered the rice cakes. The rice cakes themselves weren't bad, but as a dish they were very bland. I ended up picking up pieces of the rice cakes and dipping them in the sweet saki sauce, which helped a lot. <br><br>If you're looking for cheap decent Chinese food, you should stop by here! It's roomy, with a lot of seating so you probably won't have to wait long. Their service isn't the greatest, but it's good enough.", "pics": null}}, {"review": {"des": "Definitely not worth the $37. I ordered beef chow mein and didn't get any beef, just fat and cartilage.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hfmnwBAoOjVs6uO0Xeksng/348s.jpg", "caption": "I ordered beef and got every part of the cow except meat"}]}}, {"review": {"des": "We ordered a pork fried rice and mixed veggie with shrimp with steam rice.<br><br>Food was okay. Fried rice was delish. However, I knocked down 3 stars because of bad customer service. The young waiter was rude and not professional when serving tables. I saw him just finished taking orders from other tables and then literally throw the menu to an empty table. You dont throw things in front of customers!<br><br>When I asked him for the check, he did nothing to show us that he already known our request. After a whole 5 minutes he seemed to \"Ah, the check!\" and brought it to us.<br><br>It was also very noisy from all the customers and loud background music.", "pics": null}}, {"review": {"des": "Had the food delivered and it was very tasty. I definitely would suggest getting the Salt and Pepper Pork Chops which doesn't have the most exciting name but is very tasty!", "pics": null}}, {"review": {"des": "Value for money restaurant, simply one of the cheapest Chinese restaurants I know in Chicago. A wonton noodle for $5.75!<br><br>There's a good variety of selections in this restaurant, mainly Cantonese cuisine. The appetizers and noodles are cheaper around $5-7 each. You also have the option of ordering a la carte proteins or vegetables to share, but they are $10+<br><br>The taste of the dishes are reasonable. It's nothing to write home about, but it's satisfying and wallet friendly. <br><br>My impression of this restaurant reminds me of my student days where I cared more about filling up my tummy and hanging out with friends; concerned more with the quantity rather than quality of the food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1W_HEvI7nh9gCC7J4MEOFA/348s.jpg", "caption": "Garlic honey chicken wings"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dBFiDplLxgjG9as20JSrvw/168s.jpg", "caption": "Wonton mee, love their wontons!!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/emRl7rHf8Pk1C4UZymM6YA/168s.jpg", "caption": "萝卜糕 turnip cake, good taste, poor stir fry skill. soggy and dripping with oil."}]}}, {"review": {"des": "Came here for a snack since I had a hunkering for some fish balls.  The fish balls I would give 2 stars and the curry sauce 1 star.  The chicken wings were ok, but wasn't really great.<br><br>Service was good about getting us in, and subsequently out, which I really appreciate.  The decor was new and it is clear that the staff does try.<br><br>Based on staff experience and the fact I only had 2 appetizers and no entrees, I don't think it would be fair to give it a 1 or 2- star rating but I would not order these dishes again if I go back.  Prices were more than reasonable and I would have been prepared to pay more if the quality was better.", "pics": null}}, {"review": {"des": "This is the only one cafe in Chinatown Square that opens overnight. Decoration is nice. Open kitchen does allow us to see how clean the cafe is. Modern and reasonable pricing.", "pics": null}}, {"review": {"des": "Wow! The crab ragoon was to die for! The bbq fried rice so delicious and fresh! Even the teas they serve are tasty and fun. Service is attentive and speady. Clean place and quite busy. Open until 1 am. Cant miss it!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/we7jdkY-fwGKL0G5P3Kyzg/348s.jpg", "caption": "Teas!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ev6T6Ne9SAWvSRxCJSFRpg/168s.jpg", "caption": "Bbq por rice. The best!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dil9SxwuhtN2kbINUfNc7Q/168s.jpg", "caption": "Crab ragoon amazing!"}]}}, {"review": {"des": "I've come here twice - Food is authentic but could be a lot better. Best thing about it is grabbing a late night snack.<br><br>The second time I was here I ordered a baked pork chop over rice, which is my all time favorite Hong Kong dish to eat - whether it's in Hong Kong or in California. The sauce makes or breaks this in my opinion. <br><br>The default with this is usually a tomato sauce. I thought that was the case here, but no they have you choose which is totally cool. So I went with the tomato sauce which baffled the waiter. When the dish actually got to me, it was covered in bright red sauce. Like so bright I thought they added red food coloring to it, but I decided to give it the benefit of the doubt.<br><br>What seemed like tomato sauce was more like sweet and sour sauce one gets at an incredibly Americanized Chinese restaurant, not one serving authentic Cantonese food. Might as well rename the thing to sweet and sour pork chop.<br><br>I asked the waiter about it and he said it's actually Portugese sauce that is traditional, which was why he was confused (but then why even have it on the menu like that if you're going to be weirded out by what the customer picks?) They were nice enough to switch it for me after I asked a completely separate person. <br><br>That Portugese sauce turned out to taste like pure curry. The pork chop was a massive piece of bone. Not what I had in mind for such a common dish.<br><br>10/10 wouldn't order again.<br><br>The other food like chow mein and fried rice selection is pretty good.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XYbl1GiQpGfsTI5RKI7m4g/168s.jpg", "caption": "Oven baked pork chop with \"tomato\" sauce"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-UonED0FMDmhwOr0_YTuhw/168s.jpg", "caption": "Oven baked pork chop with Portugese sauce"}]}}, {"review": {"des": "The eggroll I was served here gave me food poisoning, I threw up my dinner on the way home.", "pics": null}}, {"review": {"des": "Best place for late night Chinese food after a night out! I also find myself ordering from here time to time when I want a quick Chinese food kick. I like all the over rice dishes. Prices are low and portions are big. But I did notice that they may skimp on the meat here and there. This is more of a Hong Kong style restaurant so it's not your typical Cantonese style place. Shares a lot of food, but they do have some Chinese western style dishes found in Hong Kong.", "pics": null}}, {"review": {"des": "Woohoo! Already booked my Wedding reception here. Real Classy and Real Fresh ingrediants. I don't know how to even put my tender emotions into words when speaking of Chi Cafe. So I threw together a little poem I made in honor of the establishment. It goes a little like this:<br><br>That purple neon glow <br>From across the square <br>And I realize I'm home again<br>I prepare to step inside<br>Fuzzy anticipation tickles my .....<br>Servers let me sit wherever I shall please<br>They're adorned in vests <br>And I tell my friend<br><br>When I die... Please bury me in this<br>Every delicious warm bite fills my soul <br>Do you know what a noodle roll is <br>It might just expand your palette<br>But furthermore, your universe <br>Order a smoothie<br>Dive into the cool sweet tangy intense beautiful flavors <br>And bubbles. <br><br>Chi Cafe<br>I wear you in a pendant around my neck<br>It won't be long<br>Until we're together again<br><br>Forever yours,<br>Don T.", "pics": null}}, {"review": {"des": "The hours at Chi Cafe simply can't be beat, they're pretty much open all the time to satisfy any late night cravings or weekday evenings when you want some food made fast. Service is always quick when I dine in, and they are are popular option for take out and delivery. They deserve an extra star just for their incredible hours.<br><br>Food here is authentic Cantonese style. The menu is huge and I've liked all the things I've gotten from here. Portions are just right and the prices reflect that.", "pics": null}}, {"review": {"des": "The food is amazing! The one star is for customer service. I understand the language barrier but they have no words to say to you while you're there and then when I called to tell them they boxed my soupy noodles in a container that leaked all over the place and my car the guy who answered the phone said \" are you drunk? Suck my dick bitch\" and hung up. LOL seriously can't believe that. It was a good laugh but so embarrassing for that restaurant and that guy", "pics": null}}, {"review": {"des": "Chi Cafe is a great alternative if you're in the mood for some late night Chinese food, but don't want to pay a premium to eat dim sum. The food is fairly affordable and comes extremely fast. Something that was not fast, however, was the service. The servers did not stop by our table very often (I think they forgot that we were here) resulting in many empty cups of water and a long wait to get our check at the end.<br><br>Here's what we got:<br><br>Chi Cafe Special Stir Fried<br>- A seemingly random mixture of leftover food they had lying around the kitchen (pork rinds, dried mini-shrimp, tofu, octopus, and chives???) comes together to form something that is surprisingly decent. However, I'm not sure if its worthy of being the first dish they have listed under \"House Specials\" on their menu.  Also at $9.50, I would expect at least a little more meat. <br><br>Beef with King Mushroom and Snow Pea<br>- This has been my go-to dish every time I come to Chi Cafe. It is the perfect medley of meat and non-meat for a pretty decent price ($9.95). The beef they used was extremely flavorful, i.e. salty, so much so that it was a little hard to eat without also combining your bite with some mushroom and snow pea. Also, watch out for the pieces of ginger that look a lot like pieces of the king mushroom!<br><br>Japanese Tofu with King Mushroom<br>- By far, my favorite dish of the night. It's basically just a big plate filled with tofu, king mushroom, and a little bit of Chinese broccoli. However, this isn't your mom's tofu: inside this tofu's fried \"outer shell\" is the softest, silkiest tofu I've ever eaten in my life. This tofu was easily the highlight of my night.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/myh_x4bG0sfjH8dENT_RmA/348s.jpg", "caption": "Japanese Tofu with King Mushroom"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RbYsrDJuDz5Kv0X8IhHFTQ/168s.jpg", "caption": "Beef with King Mushroom and Snow Pea"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pWyGlNKEIb98h7Pi4W2l9w/168s.jpg", "caption": "Chi Cafe Special Stir Fried"}]}}, {"review": {"des": "My favorite cheap eat in Chinatown. You can't go wrong with anything on the menu - it tastes like the food my mom makes albeit a little less healthy. The milk tea and the noodle soups are also good. The portion sizes are also very reasonable and I can share two things with someone and still take some home.", "pics": null}}, {"review": {"des": "In the past, Chi Cafe had terrible service, however, now, they're very attentive to their customers. I was always appalled by their response time to attend to customers, causing a longer wait for other customers. <br><br>The food at Chi Cafe is cheap and delicious. Although the serving isn't as big, it's definitely worth the price you pay. A noodle dish is about $5.50 to $6 and you get your money's worth.<br><br>This is the restaurant people would go to when they're hungry late at night or when they want to go out but don't want to spend that much money. Chi Cafe gives you options on Joy Yee menu and is WAY cheaper. The food tastes just the same! <br><br>Chi Cafe doesn't get the glory they deserve. It's delicious cheap food. A few of my favorites are the Beef Satay and Chicken Satay App, Sizzling Beef Tenderloin in Sweet Saki Sauce and Beef Brisket Noodle Soup. <br><br>The downside of Chi Cafe is that their drinks are something you shouldn't spend your money on. It's definitely a waste. Their milk teas are either too sweet or too bitter. Their bubbles are bland and hard. They also have iced teas on their menu and it's either too watered down or very bitter which requires you to add A LOT of sugar. If anything, eat at Chi Cafe and then go to a nearby location to buy drinks: Kung Fu Tea or Hello Jasmine for Milk Tea or Joy Yee for their smoothies. <br><br>Overall, I would come back to Chi Cafe!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DXk3-dfjmeeip5I2xCSBZQ/348s.jpg", "caption": "Beef Brisket Noodle Soup - with udon noodles and spicy."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Z9a5Uyurs8aJBbp6VqKVaA/168s.jpg", "caption": "App"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DP4E2REjawVxYW90BzSi4g/168s.jpg", "caption": "Beef Brisket and Veggies on Rice"}]}}, {"review": {"des": "Came here for lunch on a Monday when I was in the area on the recommendation of a friend. The restaurant was bustling with activity. The feel of the decor is very much hip Asian here. I liked it a lot.<br><br>As I was ordering, all I remember was that the sizzling beef tenderloin was supposed to be good, so that is what I requested. I forgot that there were two preparations (w/sweet saki sauce and w/black pepper sauce). They didn't ask which one I wanted - just brought me the sweet saki variety. My preference would have been the black pepper, but my mistake for not specifying.<br><br>The dish comes out sizzling like fajitas at a Tex-Mex restaurant, which is actually quite nice. The beef was tender and flavorful, and the accompanying onions were tasty. I would order it again in a heartbeat.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2whS06oW-yoO2KuL74HStg/348s.jpg", "caption": "Sizzling beef tenderloin with sweet Sizzling Beef Tenderloin with Sweet Saki Sauce"}]}}, {"review": {"des": "Good food, big portions, it was perfect for a cold winter day. The saki beef was fire!", "pics": null}}, {"review": {"des": "Went to the Bears game tonight and was looking for something different to eat other  than the $6 hotdogs at the game  ... Found this place and ordered for delivery @ 12:25 am ... It was here in less than 20 minutes  ...<br>FOOD WAS EXCELLENT  ... Would definitely recommend them and will be ordering from them next time I'm touring through  ....", "pics": null}}, {"review": {"des": "Not worth it. The reviews here are pretty misleading. The food was average, but emphasis on average. Everything lacked flavor. The shrimp was awful in the dumplings and wontons we ordered. The only good this about the meal was the crab rangoon, which was filled completely. Also, the restaurant was very clean.", "pics": null}}, {"review": {"des": "Great experience overall!<br><br>We shared two dishes: the Chi Cafe Special Stir Fry was packed with fantastic flavor and loaded with super green chives, onion, tofu strips, baby shrimp and squid and what seemed like pork tripe. We also shared the Seafood tofu soup, which was one TU for two! <br><br>Wonderful experience we weren't really expecting as we were only in town a few hours and Yelped some local locations. <br><br>We definitely picked a winner!", "pics": null}}, {"review": {"des": "I went to Chicago for school, and would frequent this restaurant because of the quick service, amazing prices, and of course, consistently incredible plethora of dish offerings! From their amazing breakfast menu to late-night cravings options to everything in between, this is my go-to place whenever I want to eat in Chinatown.<br><br>Although the entire menu is solid, my favorites are the honey garlic chicken wings (you get 12 wings or so for $6!), the egg noodle soup dishes (I love the shrimp wontons and the beef brisket personally!), and the Japanese tofu with king mushroom (the tofu is SO creamy and delicious, and pairs so well with the vegetables). Their descriptions and pictures of their menu items are consistent with the actual delivered item. Other foods I enjoy are their rice cakes, beef chow fun, congees, and sizzling platters. The only one I would not recommend is the egg drop soup - it was very starchy and the peas seemed uncooked!<br><br>I think their breakfast menu is underrated - if you come in before 11 AM, you can choose from a variety of breakfast items (noodle soups, congee, etc.) and they come with a free drink (hot tea, Ovaltine, milk tea, or coffee). The price is slightly cheaper than if you were to order off the menu later on in the day, but they don't change their portion!<br><br>Overall, a beautiful gem in Chicago Chinatown of reliably great-valued food to satisfy yearnings for your mother's home-style Chinese comfort food cooking!", "pics": null}}, {"review": {"des": "First off, if I could give 3.5 stars, I would. <br><br>Let's start out positive. What I liked about Chi Cafe, the crab rangoon. They were generous, every inch of those sweet pieces of heaven were stuffed to the brim with delicious flavored crab cream cheese. Mmm. The sweet and sour chicken was also something I thoroughly enjoyed. The pieces of chicken were small, how I like them, so I don't have to eat a piece in two bites and see what is inside as I wait to take the second bite. My friend ordered the Singapore noodles, which I had never had before, but was thoroughly impressed by both the quality and quantity. Also, another positive was the delivery. I was given an hour delivery time, it was at my door in 22 minutes after I pressed submit on the order. They did include a cute little package of napkins, nice touch.<br><br>Now onto the negative. What I didn't like about Chi Cafe, the beef fried rice. It was basically white rice with beef, egg, big pieces of cabbage (why?), peas, carrots, etc added into it. I prefer my fried rice fried with extra sodium or whatever makes fried rice so delicious. Second, the egg rolls were just, eh. It didn't seem like there was anything inside except cabbage. We also added on fried dough fritters as a wild card and they were essentially churros without everything that makes a churro good. That was probably a poor judgement call on our end. One more thing that was little disheartening was when we finished our meal, there were no fortune cookies! That was a Chinese food first for all of us..<br><br>All in all, I didn't hate the meal but I also didn't love it. It was decent. Living so close to Chinatown, there are definitely better options that I'll probably return to first before returning to Chi Cafe.", "pics": null}}, {"review": {"des": "My eyes were bigger than my stomach the day I came here, but that's neither here nor there. I had huge cravings for specific Chinese foods and I decided to give this spot a try. Everything tasted great! I especially liked the tofu/veg soup. A great clear soup for a cold, gloomy day. Delicious shrimps and perfectly cooked string beans, too. They also have a wide array of teas. I had the hot honey/lemon tea. The only reason why I took off a star was because our server seemed to be a younger dude who wasn't too familiar with the words \"customer service\". He was absent-minded, misheard one of my orders, and ignored me for a long time so it was difficult to grab my check. The rest of the staff made up for him, though. Definitely coming back!", "pics": null}}, {"review": {"des": "There were plenty of seats open when we came. We started off with a hot and sour soup which was very delicious. It bad pork and shrimp in it and was somewhat spicy. I would definitely recommend it. I rarely order egg rolls, but I was craving one. The egg roll was alright nothing special. And then their sizzling beef. Most people say it was salty, but it didn't seem salty to me. It's most likely just the soy sauce that they use to cook it. The beef was nice and tender, perfectly seasoned and went well with the onions and peppers. <br><br>The service was pretty fast, nothing special. There are obviously a lot of restaurants to choose from, Chi Café was ok, but I'd probably try a few other ones before I return here.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/u_OOqDg8te_YNjyPQdeSYQ/168s.jpg", "caption": "Egg roll"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ryEccygaapc4dO7NaI6fAg/168s.jpg", "caption": "Hot and sour soup"}]}}, {"review": {"des": "I've been going to Chi Cafe for maybe 7 years now and the food I've ordered has always been very good. Today was the first time I ordered online, the food was delivered faster then the anticipated time, the delivery guy was very nice and even smiling despite standing in the rain. Also, the food was still hot. =D I'll add that I got the salt and pepper squid and some beef noodle thing my sister ordered. I have a ton of favorites. Salt and pepper tofu, salt and pepper squid. Mapo tofu. The curry chicken over rice and e fu noodle with eggplant (no beef) have to be my top choices. And their iced lemon tea =D", "pics": null}}, {"review": {"des": "Another Cha Chaan Teng in Chinatown. Good, delicious, full menu, Hong Kong style fast food.<br><br>-The chair with a hard surface is not comfortable to sit! <br>-Might be too salty for some ppl.", "pics": null}}, {"review": {"des": "Great Chinese food and the place is open really late. For dinner for 3 it was just under $50.<br><br>Nice spaces, friendly servíce, and the food came quickly. It wasn't too greasy and the portions were big<br><br>I would definitely go back...", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FgSaZ_kDpSG2ubq_emHhTg/348s.jpg", "caption": "Salt and Pepper Shrimp - some kinda dipping sauce is needed"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Afc4RE83zC_htg-Hy4xrlw/168s.jpg", "caption": "Hot and Sour Soup (Large)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/q9jrMj03FRAu_EzfG2m2Rw/168s.jpg", "caption": "Shrimp WonTons - Good appetizer"}]}}, {"review": {"des": "Would say the food is okay, but the prices are really good and an ideal place if you are craving some HK / cha chan tang food.", "pics": null}}, {"review": {"des": "The food was ok and the service was ok. It took a long time to get one entree. They are one of the few places open late.", "pics": null}}, {"review": {"des": "So after an extremely brief search for the \"best shrimp fried rice\" in Chicago I stumbled upon Chi Cafe. Convenience aside nothing could be further from the truth. Who the f**k voted for this place?!? This rice was some of the blandest food I've ever eaten in my life. It literally had no taste nor flavor to the rice nor shrimp. It was cheap & came out in less than five minutes but I'll never return to this establishment.", "pics": null}}, {"review": {"des": "Just got my food delivered. What a surprise.  The amount of the food are way more than we expected. Definitely worth the money.  <br><br>We are staying at a hotel that a bit farther than Chi cafe,  but they were OK for delivering food to us.  Great service. <br><br>Ok now move on to the food. <br><br>Singaporean noodle:  on spot. <br><br>Salty fish and chicken fried rice : a little soft,  should have requested to use a cold rice. <br><br>Beef tenderloin with sake sauce : Yeah,  tasty and perfect,  it also come wiyh a small rice on the side. <br><br>Jelly fish and beef : sadly,  tasted really bland.  But the beef is allright. <br><br>Overall,  we are now full and happy.  Definitely recommend this place for family and friends.  Thanks Chi Cafe.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Zy5C15MV0P_fvpG4iAKvHA/348s.jpg", "caption": "Salty fish chicken fried rice."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cVMd_V0PZ4loDjsCkq-2Aw/168s.jpg", "caption": "Beef tenderloin sake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eckevCRMjfhJEHp0fLiNzQ/168s.jpg", "caption": "Singaporean noodle"}]}}, {"review": {"des": "My go to place down in Chinatown for good food and fast service. They are byob so keep that in mind.  We get usually something different everytime but always the crab rangoons. I also loooove the smelt. We usually get 2 entrees and 2 apps for two of us which is more than enough.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AtwHxG1HVOzkT70vxPIqXA/348s.jpg", "caption": "Sorry for the snapchat bar through the pic. Catfish filets, beef noodle and duck appetizer"}]}}, {"review": {"des": "(4 then changed to 3)<br><br>Ordered the crab Rangoon, egg rolls, sizzling beef in sweet sake, and beef with pan fried noodles. <br><br>Egg rolls were eh at best. Over powering cabbage flavor hid anything else that may have been in there. <br><br>Crab Rangoon was the best I've ever had. Seriously. We ordered a second plate of them. Perfectly sweet, balanced out with the savoriness of the meat. <br><br>Sizzling beef was phenomenal. Again, a perfect balance of sweet and savory, but complimented with a slight bit of spice from the jalapeños in the dish. <br><br>The beef with noodles was good, but far outshined by the other main we ordered. <br><br>Service here was atrocious. Just horrible. Usually this will ruin a restaurant for me instantly, but the food was so good I almost forgot about waiting for twenty minutes and then finally just going to the kitchen and ordering...almost. As I'm writing this I'm waiting for anyone to come to the table and ask if I need anything else for about twenty minutes. Deplorable service. The worst. <br><br>This was originally a 4 star rating, but I've been waiting for a server the ENTIRE time I've been typing it, and some time beforehand.", "pics": null}}, {"review": {"des": "Want some Hong Kong style Chinese food where it reminds of you of cafes in Hong Kong? This is the place! It's got the vibe as if you're in Hong Kong. The menu has a variety between Chiu Chow style, vegetable, meat, seafood, and noodle dishes. The servers understand English so they'll know what you wasn't, unlike some places in Chinatown. It gets really busy on weekends after 2am where people come and get food after a night of drinking. I always get their Chiu Chow style congee because it's the only place I can get it from. I've had many different dishes & they're all ok. They're very oily and flavorful. But what else would you expect from Chinatown? Do I ever crave for this place? No. Do I always go back? Yes.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tdvVJ-pNy0-UlohxGzZMnA/348s.jpg", "caption": "Milk tea"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uKpzSqkd-3DwonaJxjvMUA/168s.jpg", "caption": "Shrimp wonton noodle soup"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/p7euvlEj-iIDAbcA0AD-cw/168s.jpg", "caption": "Chiu Chow style rice soup with minced pork & oyster"}]}}, {"review": {"des": "This place is a favorite of mine. The food is ALWAYS FRESH. I mean the vegetables are cooked but remain crisp like they are supposed too. Don't see something on the menu, ask them to make it and they will. Something taken off the menu you liked, they will make that too. I just love coming here. One of my favorites is  Fish in black bean sauce. Another good one is Sichuan Shrimp extra spicy. Inexpensive and delightfully tasty ALL THE TIME. Now i am not going to be dining at 2am but i can tell you there hours are great! This place is a hidden gem in Chinatown and it certainly deserves your attention.", "pics": null}}, {"review": {"des": "Just went in there this morning for breakfast. Ridiculous service.  When the waiter take my order that I have special request on my order he just roll his eyes at me and walk away.  What kind of attitude is that!!! The congee that I have is tasteless.  Service sucks, quality of food is poor. Won't go back there again!!", "pics": null}}, {"review": {"des": "Great food for a good price. Portions are enough to share and the menu is extensive. It is a place where you can order a classic or try something new and interesting. Service was great as well. Will be back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8paXqN_o35pM4A1R2sa7OA/348s.jpg", "caption": "Great spread! Fish filet with spicy sauce, beef lo mein noodles, and sizzling beef tenderloin. Everything was great!"}]}}, {"review": {"des": "This is my favorite spot in Chinatown ! Love the food. Service takes awhile but food always comes out fast! I enjoy the vibe and I'd highly recommend it if you're looking for authentic tasty cuisine!!", "pics": null}}, {"review": {"des": "Very impressive!<br>Keep in mind I'm not a huge fan of Asian cuisine, but this place made me a fan.<br>Our group ordered a large amount of food, assuming the portions would be small, but boy were they not! Everything came with a nice helping of rice as well. We'll have left overs for DAYS! <br>I ordered the Salt and Pepper Japanese Tofu, veggie chow mein, and garlic spinach.<br>The tofu was good, a bit too greasy to eat much of, but good!<br>The noodles were nothing special, but for someone who dislikes Chinese that's probably a good compliment, right? One order could fill me up and more.<br>The spinach I didn't care for too much, but everyone else really enjoyed what they got!<br>P.S. the servers are VERY nice and patient!", "pics": null}}, {"review": {"des": "This wasn't my first time and the only reason why we came back was it was the only place that we saw was open. It was crowded but we were seated right away.<br><br>Let's see- the fried rice and lowmien didn't disappoint me. It was better than what I have expected. I didn't like the wonton soup and my beef in tomato sauce. <br><br>And they ran out of tea????? <br><br>I would come back maybe I just didn't know the menu well.", "pics": null}}, {"review": {"des": "Their Chicken Satay appetizer is really GOOD. <br><br>Also, tried their Shrimp Wonton soup, and the wontons were tasty, however, broth and noodles were lacking a little love  <br><br>The Sweet and Sour pork chops had a decent s&s sauce, the chops were more breading than meat. <br><br>I really was hoping and looking forward to a good meal again here, however, for now I'll give them a little bit of time to get their mojo together again...and 3 stars.", "pics": null}}, {"review": {"des": "I'm giving this place a solid 3.  The service was okay.  We ordered shrimp fried rice. The food came out quickly.  It was flavorful.  It was nowhere near the worse but it was not exceptional either.  I would come back to try the sizzling beef.  It's a decent Chinese shop.  <br><br>One other thing, I parked on the back side and some restaurants you can enter from either side.  When we got to this restaurant it was the kitchen.  The door was wide open and on the ground in a silver metal bowl were about 15 whole medium sized chicken.  They were sitting uncovered outside the door and I do not know how long they had been sitting exposed to heat.  They were tanned yellowish looking skin.  This did turn me off but I reasoned I'm in Chinatown.", "pics": null}}, {"review": {"des": "My family loves coming here. We ordered general tso chicken, vegetable chow mein, oxtails with honey pepper sauce, lamb with special sauce, spicy seafood noodle soup and garlic on choy and every single dish was amazing. Whenever we want authentic chinese cuisine this is where we come.", "pics": null}}, {"review": {"des": "Ordered through Eat24 and the food came quickly! The delivery man was also very friendly. I ordered the chicken corn soup and that was quite good. The chicken was dry, but that's very common for chicken in soup. The soup was flavorful and I had a good portion for the small size.<br><br>I also got the pork chop with tomato sauce over rice. The rice was quite flavorful, kind of like fried rice, and the pork chop was nicely breaded and fried. The breading was very thin and delicious. The tomato sauce was an oddly scary fluorescent reddish color. It was also very oily, but tasted okay.", "pics": null}}, {"review": {"des": "A group of my friends wanted to get dim sum Saturday morning, but Minghin (the restaurant next door) was a two hour wait.. so, we came here instead. We were seated immediately. It was my first time eating here and I was pleasantly surprised. They have a lot of options on the menu and everything is fairly priced. We all ordered a dish to share family style (wonton noodle soup, congee, salt and pepper squid, fish and eggplant, sizzling beef, and this radish dish. Everything came out quickly, which is always good! Chi cafe was a great alternative.. cheap and delicious. I would give this restaurant another try next time I'm back in Chinatown!", "pics": null}}, {"review": {"des": "Food: Fast, but not so fast that it's one of those microwaved-in-the-kitchen fast. You can actually see the kitchen, and it's amazing how efficiently they cook in the back.<br><br>Service: Like most Chinese restaurants, you're going to be greeted not with ice water, but hot tea, which I personally enjoy. Ask for water though if you'd like! They take your order pretty quickly. The only downside I've experienced here is that it's hard sometimes to flag down a waiter to get more water or tea or ask for something.<br><br>Cost: One of the most \"worth it\" places in terms of cost-to-food ratio, I'd say, in that strip of Chinatown. Many items are less than $10.<br><br>Protip: This place also validates parking! So if you parked in a lot nearby, I'd definitely consider coming here for the parking validation, too. Many other restaurants on that strip don't validate parking.", "pics": null}}, {"review": {"des": "Says 24 hours Friday and Saturday. Had to drop my mom off at midway at 6am and figured eat some food while waiting for rest of Asian markets to open. Place is closed. No letter even to say why. It is even on the door that they open 24 hours Friday and Saturday.", "pics": null}}, {"review": {"des": "In my quest to expand my Chinese delivery options, I decided to try this place on the recommendation of a few of my neighbors. All in all, not bad...I've had better, I've had worse. I tried the general tso chicken, egg rolls and shrimp fried rice. All of which were decent -- the rice was my favorite. It came with little slices of jalapeño and decent sized shrimp. <br><br>The best part is that this place is at a more reasonable price point than other Chinatown restaurants. The worst part was the delivery guy who made me come all the way downstairs and OUTSIDE to get my order. That's just plain rude.", "pics": null}}, {"review": {"des": "Ordered their shrimp wonton noodle soup, pork rib sweet and sour, and stir fry rice noodle. The wonton dish is okay could be better. Pork rib and stir fry rice noodle were really good. Fresh food that's fast and cheap. Best part it opens til 4am. Service was good but not great.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/s8PivHd7dVRfYKLsZ9cnsQ/348s.jpg", "caption": "Stir fry rice noodle"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5rJ8atAZSNNLemXMsVU73Q/168s.jpg", "caption": "Shrimp wonton noodle soup"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aW-CLX09Ctkjo4lzZ2BlAA/168s.jpg", "caption": "Pork rib sweet and sour"}]}}, {"review": {"des": "Perfect hang over food.<br><br>I have this thing for BBQ pork Ho Fen. And Chi cafe consistently delivers on that. Everytime I come here the service is fast, efficient , and pretty friendly. It's not the end all be all of restaurants, but for the price and its location, it's by far the best place to go. <br><br>Would and have come back here again on multiple times", "pics": null}}, {"review": {"des": "The hype is real. The sizzling beef in sweet sake is one of my favourite Asian dishes in chicago. So delicious!  Also got the shrimp fried rice and was great as well, flavourfull.<br><br>My only problem with this place is that the waiter seem to kind of toss our food on to our table. Don't know why but seemed like a jerk. But for the food, this place i highly reccomend.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wMms6PCZIPllrCZ4csFQTg/348s.jpg", "caption": "Sizzling beef in sweet sake sauce. Mouthwatering."}]}}, {"review": {"des": "Good authentic Chinese food from Chinatown at a reasonable price.<br>The food is 4+ stars---but I gave 5 since the delivery was on time, the food hot, portions good and excellent value.", "pics": null}}, {"review": {"des": "Upon taking a trip to Chicago recently, I was very excited to visit Chinatown. It was a bit overwhelming choosing a restaurant because there were so many choices. We randomly walked into Chi Cafe, and while waiting for a table, we asked others that were waiting as well if they eaten there before. They had glowing reviews and said it was their favorite Chinese restaurant in the area. We were sold and anxious to try the food. We started with an order of crab rangoons, and they may have been the best ones I've ever tasted. The filling was creamy and flavorful and the shell was crisp and fresh.  We ordered both the BBQ pork fried rice and the chicken chop suey to share. The barbecue pork fried rice was my favorite of the two and I would highly recommend it. The chicken chop suey was okay, but not extremely flavorful. If you're looking for a great Chinese restaurant while in Chicago this is an excellent place to go.", "pics": null}}, {"review": {"des": "My sister and I were in town with our parents for the Chicago Marathon and found this restaurant on Yelp after picking our stuff up from the expo. It was AMAZING! So good that the next day, after running the marathon, we took the train back to eat here again. The rice noodle dishes were delicious and exactly what we were looking for. Service was fast and everyone was very attentive (refilling our water repeatedly). Dishes were delivered as soon as they were ready and we were so appreciative for the quick arrival after running all morning. We will definitely come back here next time we are in town.", "pics": null}}, {"review": {"des": "I was introduced to this place during late dinner hours and despite it being a weekday, it seemed quite packed. <br><br>I was accompanying a group of 7 and I think we got seated fairly quickly, so no complaints there. Comes with standard china-town ambiance and salivation worthy aroma.<br><br>Ordered family style.. so I got to try plenty from the menu. <br><br>Food- <br>My friend could not shut up raving about- 'Sizzling Beef Tenderloin with Sweet Saki Sauce'..Neither had I tried a beef dish in a Chinese restaurant before, nor had I ever tasted Saki. So, I had zero expectations out of it....Uhmmm OK!! let me tell you, It was F...bomb.. Extremely juicy beef and the sauce was heavenly. <br><br>Also tried the Hot & Sour soup- honestly, a single serving is a enough to give you Hypertension, it was that salty; Fried rice was great; Shrimp stir fry was good too; Broccoli stir fry/dish was just hanging out by the corner like forever alone. <br><br>Anyway, the star of the show was the beef stir fry in saki.. <br>I've recommended that dish to my other friends since and I can see myself returning here plenty, just for that!", "pics": null}}, {"review": {"des": "Chi Cafe is great for takeout as well as dine-in.  Plus, it's one of the few quality Chinese spots that is open very late.  They also have a number of dishes that you won't find on typical Chinese menus in the states.  The sizzling beef tenderloin with black pepper sauce is delicious as are the noodle rolls and rice cake dishes.", "pics": null}}, {"review": {"des": "I enjoyed sitting at this restaurant in the morning with Hong Kong TV news. It was 9am on Friday but the restaurant was 75 percent occupied. I ordered a breakfast set with coffee, congee, and Hong Kong style crepe with xo sauce. It's only cost $5.95 十tax. <br>I was disappointed by the warm coffee (not hot) and the coffee was not taste like HK style. Congee was ok but they put too much raw onion and green onion in the Hk style crepe. Overall, I am a bit disappointed by the food.", "pics": null}}, {"review": {"des": "This is a popular spot in Chinatown, however, I am still wondering what the hype is all about.  It's great because it is open late for after bar/club time, but this food isn't worth my drunken appetite.<br><br>Definitely avoid ordering the honey glazed chicken wings, these were some of the worst wings I've ever tried.  The flavor was full of sugar.  Imagine eating candy flavor chicken wings.  We left the entire plate of wings on the table almost untouched after we paid.<br><br>The best option I have tried is the sizzling beef.  It's half decent. <br><br>I will admit I will probably be back because my friends in the City like this place, but I would personally choose to go elsewhere if I could.", "pics": null}}, {"review": {"des": "Last night my +1 and I placed an order for delivery. We ordered:<br><br>+ Crunchy Garlic Chicken Wings<br>The smallest wings I've seen in my life (they were actually kind of cute!), but a reasonable portion for the price. There wasn't any discernable garlic flavor. Still, tasty. 3.5/5<br><br>+ Salt and Pepper Shrimp<br>Pretty standard; nothing stood out. Then again, I didn't expect it to! One of my favorite dishes! noms! 4/5<br><br>+ Shrimp with Egg Sauce over rice<br>I didn't try any, but my +1 reported it was standard as well.<br><br>+ Beef with Wide Noodle<br>We didn't see it on the menu, but he ordered in Chinese, and they understood what he wanted. Good stuff - also pretty comparable to other places as far as flavor. The beef was cooked perfectly and didn't skimp on the portion size! 4.5/5<br><br>We were quoted 30-45 minutes for delivery (we called at 6:15pm) and they arrived in 30! They included forks, chopsticks, condiments, wet naps, and fortune cookies.<br><br>Overall, Chi Cafe was a solid food and delivery option - MUCH more tasty and reliable than some other (popular and overrated) places we've gotten delivery from!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2oFAxGkLvu-MLA7qRop7ag/348s.jpg", "caption": "Shrimp with Egg Sauce"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VcYPAMLakTV1Dntrw0XC2A/168s.jpg", "caption": "Beef with Wide Noodle"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WYeeDixTuoxrx7tNEcw4fw/168s.jpg", "caption": "Salt and Pepper Shrimp"}]}}, {"review": {"des": "Cheap prices but food is not as good as the reviews reflect it to be. I've been to this place 3 times and it's still taste bland. I won't be going back for a while", "pics": null}}, {"review": {"des": "Where should I start I'm not big on Chinese food but my daughter wanted to come here, so we came. My my my the food was delicious. I'm definitely coming back I think it will be one of my go to places when I'm in Chicago. I'm from California if your wondering.", "pics": null}}, {"review": {"des": "Nice enough looking place in a hard to find cool little alcove in Chinatown and it's open late which is great, but the soup was pretty brutal...not good. Cheap, at least...", "pics": null}}, {"review": {"des": "Overall, the food is generally pretty good here, as evidenced in many of the pics. However, DO NOT order the chicken congee. It is horrible! Full of bones and very scant pieces of chicken covered with rubbery skin. Practically no flavor either.", "pics": null}}, {"review": {"des": "Restaurant is in shiny condition and staff was pretty good. I didn't really get to flex the skills of the kitchen because of my dining companion's preferences, but I cannot discern that this place is much more than a nicer Chinese-American place in the year 2017. Everything we got could have used some more wok hei/spirit and while mixed vegetables is not really a Chinese dish, they phoned it in. Probably would go back and give the salt-and-pepper offerings a chance, but am puzzled by the buzz around this place. Chicago's Chinese game really needs to level-up.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GDMpLqGj9pLoNQEQwrOF3Q/168s.jpg", "caption": "XO sauce noodle rolls"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ra0q4Jlv4swdlPYYMj4s3w/168s.jpg", "caption": "Sizzling chicken more like middling chicken"}]}}, {"review": {"des": "Order food <br>And it's not good not at all<br>Taste like  <br>Don't order Chinese home it's not smart", "pics": null}}, {"review": {"des": "Really nice spot for dinner in Chinatown - starting with the honey tea, everything was well made & fresh. Great crab rangoon and shrimp wonton soup.", "pics": null}}, {"review": {"des": "Searched yelp for best takeout in China town and found this place. We agreed it's more of a 3.5 star but that isn't an option so I went with 3.<br><br>It wasn't that it wasn't good, it just wasn't great. We had szechuan chicken and chicken wings. Wings were great, we got the saki wings, sweet and delicious. <br><br>Probably wouldn't come here again with so many options nearby but it is 24 hrs so I can imagine why it's popular. Just wasn't wowed.", "pics": null}}, {"review": {"des": "Well the staff was rude from the begging to sit down they said it would be 10 minutes ended up waiting 25 after being seated the table wasn't cleaned off yet. We order our food everything is good until the orange chicken came out with a roach on the plate. The waiter didn't even apologize or anything I guess it's common to serve bugs with food over there. They bring out another plate and the bill and they still had the nerve not to apologize or comp the bill. I should of walked out on them but I'd figure I would bring it to everyone's attention on yelp instead so pass up this dirty and ignorant operated place. Walk over to anyone where else but here", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KwHDnXqbTxhgTkarkpg06w/168s.jpg", "caption": "What's even more sad about this place they didnt apologize for being dirty and still charged us"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kwewYfT03cTP1-Y9xhK7cg/168s.jpg", "caption": "Damm bug special with the orange chicken"}]}}, {"review": {"des": "Holy shit, Chicago is on another level with this 24-hour Chinese restaurant for those late Tuesday nights when you've had one too many cocktails and your falsies are about to fall out. <br><br>We ordered the garlic fried pea tips, young chow fried rice and beef tenderloin with sweet sake sauce. The food came out pretty fast... but it was also a Tuesday and it was 2am. So friggin tasty! Portion sizes do not disappoint. The pea tips were perfectly cooked - not too mushy, not too crispy. The beef was tender and beautiful dressed. And the fried rice was light, but also flavorful. I would love to try out more plates. For three entrees, it cost around $32 - my mind is blown. One of my go-to Chinese restaurants in Minneapolis charges almost $60 for three to four entrees. <br><br>I will be coming back sober, ditzy and drunk!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SzgKop_u7Xlg9d6k688WvQ/168s.jpg", "caption": "Pea Tips"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TT6d1Y7udNSOONoPntSvQQ/168s.jpg", "caption": "Beef Tenderloin in Sweet Sake Sauce"}]}}, {"review": {"des": "I don't usually review restaurants, but I figured I should give a review to help others avoid the mistake I did since I can't get my money back. This place didn't live up to the reviews in my opinion. I have ordered Chinese takeout from many restaurants in Chicago, and since moving to a new neighborhood, I wanted to find my new favorite Chinese takeout spot.<br><br>Call me basic, but I find it difficult to get crab rangoon, chicken fried rice, and orange chicken wrong, so I decided to order from Chi Cafe.<br><br>The best part of the meal was the chicken fried rice, it was really great. I have no complaints with that part of the order. The orange chicken had a funny aftertaste to it, the consistency wasn't all there. I'm not a picky eater, I tried to push through and eat the chicken despite the weird taste, but I just couldn't. After roughly 4-5 small pieces, I put the dish down. I was really dissapointed, because this place looked promising. <br><br>The crab rangoon was nothing to write home about, the inside of the doughy soft exterior tasted something like warm cream cheese. <br><br>For such a basic meal, I wasn't impressed whatsoever. I basically paid $30.00 for the only part of the meal that was actually edible, the fried rice.<br><br>I'd recommend taking your money elsewhere.", "pics": null}}, {"review": {"des": "This place is great when you need a late night meal. This is one of the latest operating restaurants I know.<br>The place is bright​, modern, and clean. A combination you don't really find in Asian restaurants. The service is good and the food comes out extremely fast. The food itself is inexpensive- a meal can probably cost you less than $10- and really tasty whether you are sober or drunk.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tmxTcy_leSZQ9KaMuOO0qg/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YC4BNDlYJ0qvngv9B_K9_g/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/r-M-4sCMJvVVRLJUsQii4A/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Was in desperate need for some chinese take out. And this place didn't fail to step up to the plate and deliver. My family and I got a mixture of stuff. Ranging from the green beans, pork fried rice, general Tso's chicken, to the beef marinated in soy sauce. All of the food was great and affordable. We had ordered off of yelp which was awesome because it allows you to use a credit or debit card. Where as if you go to their website and try to order it, you can only use cash or check.  The portion sizes are good but the most impressive thing about this place is the timely manner of which they get you your food. Yelp had said that my order would be 1 hour and they came in 35/40 minutes so we were very happy campers. Enjoy!!", "pics": null}}, {"review": {"des": "For some reasons I was really craving some crab rangoon. I know there's no real crab in there but it's just so delicious that I have these cravings for them. I went on yelp on the search for some crab rangoon and Chi Cafe was pretty high on the list. The place seemed great because it's open super late and I usually land in Chicago crazy late. Chinatown is a little out of the way but Chi Cafe is pretty close to the red line. <br><br>The place seems pretty modern. They get kind of busy and there's not a lot of people working there so the service I experienced was a little slow. Nevertheless, I ordered my crab rangoon, with a baked seafood over rice. My boyfriend ordered a flat noodle dish. I had my crab rangoon fix but wasn't that excited about my seafood over rice. There's his Chinese cafe that I love in New York chinatown that I thought this place would compare to but it didn't. My boyfriend enjoyed his flat noodles though. I ordered a milk tea with my meal and it was overly sweet. Next time i'll ask them to put less. <br><br>I probably wouldn't come back here but it seems like a great place to go to if you're drinking in the area and need some food to soak up the alcohol.", "pics": null}}, {"review": {"des": "Really enjoyed the ambience and kind staff here! I started off the evening spilling my water and the staff was super understanding about it; I also changed my order once and the server quickly communicated this to the kitchen without a second thought. The staff also gave me advice before and as I ordered. I had the orange chicken, which was so flavorful and filling. Also, meals are not pricey - my friend got a full meal for $6.50! I am definitely going back for the service and to try the rest of their extensive menu!", "pics": null}}, {"review": {"des": "A solid dinner. I didn't leave hungry. I didn't leave disappointed. But my experience really pales in comparison to the rest of Yelp's, I guess, because I thought this place was really forgettable. <br>Lots of University of Illinois Chicago students, especially late at night, like when I visited. <br>I got an \"egg drop soup\" that mysteriously came with a bunch of seafood.  Quickly replaced with egg drop soup once we mentioned it to our waiter. Then I got a tofu dish off the overwhelmingly large menu, tipped my harried waiter, and went on my way.", "pics": null}}, {"review": {"des": "The food is pretty good and decently priced. However, the service was pretty lacking. I felt so lost at this restaurant. 5 minutes passed before I got my menu, and all the servers were chatting with each other. Again - it's all okay. I don't demand much, but I was confused if I should hav grabbed the menu when I first came in.<br><br>After I finished my food, they literally did not want to give me my check. I waited around for 15 minutes before one of them made eye contact with me, allowing me to signal to them that I am ready to leave.<br><br>This was such a confusing process.<br><br>Will I be here again? Of course.<br>Will I be equally as confused next time? Probably.", "pics": null}}]}