{"name": "chicago-cut-steakhouse-chicago", "reviews": [{"review": {"des": "Fantastic experience all around. I went here on a work event and truly loved the service, drinks, and food. The attention to detail for a large corporate group was on point. The flow of the service was basically perfect. It was a fun environment despite being so crowded, and it definitely is a place I would want to come back to sometime.<br><br>As a downside I would say the space gets very crowded. There's very little room to move. It was fantastic that they could wear a large group but having the entire table at a rectangular table meant an inability for me to talk to people down at the other end. If they could do something about spacing that would be amazing. If they can't, that's totally understandable! They're working with what they have to serve an often booked out venue. And they do a fantastic job.", "pics": null}}, {"review": {"des": "Dined at Chicago Cut this week in celebration of our wedding anniversary, and both my wife & I loved the evening. The restaurant layout, location, and staff service were immaculate. I am not aware of another steakhouse in Chicago that offers such a tremendous combination.<br><br>While via OpenTable we did request a table near the river, that unfortunately was not available - the restaurant was full, and had an excellent atmosphere throughout our evening. Would say that the layout, again at capacity, was a little tight for passers by coming & going.<br><br>Both of us enjoyed our filets, and we also shared a baked potato & brussels sprouts sides. The steaks were cooked as described (medium rare more rare, medium well spot on), and delicious - the seasoned crust had great flavor. The table-side service was impressive, and they elegantly prepared shared side dishes for each of us - I'll be stealing the preparation techniques for those B-sprouts, without question. <br><br>Last but not least, the wine & cocktail menus are extensive and have items that may be difficult to find elsewhere. We truly enjoyed our evening at Chicago Cut, and will hopefully be returning soon.", "pics": null}}, {"review": {"des": "Ambiance location and great service what more could you ask for?<br><br>We had a large group of about 22 people taking a lunch break during a one-day seminar at 1871 in the Chicago cut steakhouse was a great location and accommodate a group our size very well<br><br>The maître d' was very quick to remind the party that they were a steakhouse and as such steak and all of its forms and fashions where the strong recommendation<br><br>He did so in that marvelous Chicago matter of fact style that still gave the guests the opportunity to order A fish dish- which he also proclaimed the superiority of that dish versus other offerings at other establishments<br><br>They did a great job pleading the table all at the same time with just the right amount of servers and service so that we could have a great lunch experience and get back to 1871 for the rest of our workshop", "pics": null}}, {"review": {"des": "This restuarant will always receive the highest score from me, it's simply my favorite steak<br>house in Chicago hands down. The drinks are great, the food is magnificent and the staff is always pleasant. I love the ambiance and you can sit outdoor if the weather is nice right along the river.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/A5xQV2Ut-rKez7__GMlRAg/348s.jpg", "caption": "the entrance"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2p6rRNmwg530QgS5Za7pDQ/168s.jpg", "caption": "the menu"}]}}, {"review": {"des": "On the night of our arrival in Chicago, we had a great dinner reserved here, and opted for a skyscraper and loop view on the patio.  This turned out to be one of the best meals Diane and I have enjoyed as a couple in Chicago or outside its environs, with a breathtaking setting, stupendous food, and stellar service.  Boats casually passed by on the Chicago River; trains clacked along on the elevated loop platform just above; and sunlit office buildings right across the river first gave off a metallic shine as the setting sun glinted off slick surfaces, then quickly lit up and took on a golden glow.<br><br>I began with a chef's special app, Maguro Bites, which were ahi-based sashimi squares topped by discs of jalapeno.  They were really spicy at first, which was modulated after arrival of requested ginger and soy sauce.  Another Chicago Cut classic, Lobstercargot, was a cheesy, inventive take on Escargot with baked lobster instead of snails.  And a Jumbo Shrimp Cocktail with two huge, sweet shrimp and fine Cocktail Sauce rounded out a great trio of starters.<br><br>Next up for me was a swooningly delicious French Onion Soup Au Gratin made with chewy Jarlsberg Cheese and well-caramelized onions served in a large crock.  It was followed by a salad of Mixed Greens with Grape Tomatoes, zucchini, and a novel yet quite tasty Vinaigrette Roquefort Dressing.<br><br>The dinner (like this long review) kept unfolding with a perfectly medium rare as ordered and excellent, buttery wet aged 8 oz. Center Barrel Cut Prime Filet Mignon for me, and an equally tender wet aged 6 oz. Center Barrel Cut Prime Filet for Diane, both accompanied by smooth and drinkable Bearnaise Sauce.  This was no time to scrimp on sides, so we enjoyed memorable House Made French Fries, Crab Mac 'N Cheese, and a huge serving of well-oiled Shitake & Crimini Mushrooms to adorn my steak.  We could have ordered either Lobster Mac 'N Cheese or Shrimp Mac 'N Cheese, and next time it will be the lobster variety for me, because I have now learned that crab as a garnish yields just too faint a flavor to suit my taste.<br><br>Iced Tea and water were regularly refreshed with new glasses, without request.  And, I finished with a handsome slice of Key Lime Pie and a cup of Sparrow Coffee.  It was one of the best Key Lime Pies I have ever experienced--even taking account the fine ones served in Miami Beach: creamy, like Lemon Meringue or cheesecake with carefully applied berry drops, and sporting perfectly crumbly Graham Cracker crust.  I was given a snaggletoothed fork for the dessert course, but the utensil was quickly exchanged for one with straight tines.  <br><br>While eating outside, about twelve metro police and ambulance sirens were heard, and several lit up emergency vehicles were seen speeding at different times just across the river.  When I asked our server, Matthew C., whether this was common, he replied that on this particular night the number of sirens heard was actually lighter than normal! <br><br>After 1-3/4 hours of uninterrupted dining, my rear end got sore on a hard composition seat.  Otherwise I have nary a complaint about the food consumed or the service provided by our waiter and his assistants, and look forward to a quick return.  It will be just one of several good reasons to fly back soon to Chi Town!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yfQVOg1EQj2mGPw1KtRv0g/348s.jpg", "caption": "Key Lime Pie Slice Close Up"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/acN2Gf9TVN98QfPqDVsLyw/168s.jpg", "caption": "Coffee"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zw1wvfWQmr2gxibZYgmcXA/168s.jpg", "caption": "Key Lime Pie"}]}}, {"review": {"des": "Old school steak house with old school manners. I was at Chicago Cut with my husband celebrating a special event. Our waiter was extremely rude. During the whole dinner service he never addressed me even once, never looked me in the eye, when he brought out meat selection display he only talked to my husband about his choices. Every time I tried asking a question he would completely ignore me. I felt invisible even thought I was the one picking up the check. As for the food I can even remember it as my experience was poisoned by his snotty attitude. Never again.", "pics": null}}, {"review": {"des": "If you're looking to dine at a steakhouse with spectacular views of downtown Chicago, go to Chicago Cut. I placed a brunch reservation a few weeks prior to celebrate Father's day and requested a table along the patio. On a clear summer day, their patio is a prime spot for taking in beautiful views of downtown and the river.  Overall, brunch was okay with a few hiccups. <br><br>The restaurant did not have a dedicated brunch menu so we were given the option to choose from the breakfast and/or lunch menus.<br><br>For starters, we ordered the Lobster Escargot.  It was served with generous chunks of sweet lobster meat over a mini potato crostini. Despite being on the greasy side (in part due to the melted harvati and garlic butter) this appetizer was rich and sinfully delicious. <br><br>We each ordered the Prime NY strip and two poached eggs. I ordered my steak medium and although flavor was present, it was cooked unevenly. My medium steak was pink in the center but it was burnt at the edges, leading to dryness at the ends (see picture below). I didn't want to make this a big issue and send my steak back because I was hungry; plus, I also didn't want to be the reason why I was holding back everyone's meal. I would've enjoyed my steak more had it been cooked evenly throughout. After all, isn't steak what they are known for? Thankfully, my parents didn't have this issue and they thoroughly enjoyed their meal. <br><br>I would like to make special mention to our server, Chris. With my steak issue aside, I thought he did an excellent job taking care of us. He was engaging, friendly, and he checked in on us often. He even helped to take pictures of us along the patio. In turn, we made sure to tip him well after our meal. <br><br>Honestly, the ambiance, great views of downtown, and service is why one would come here.  It's a nice place to take your family out on a special occasion or for a nice date night. For what it's worth, the steak is average for a steakhouse.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oV-yAjcKqtfCpdR45y_Qtg/348s.jpg", "caption": "Prime New York Strip & Two Poached Eggs."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ISILxQsVdkHLWsXyj5tzDQ/168s.jpg", "caption": "Lobster Escargot over potato crostini. Perfection."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sABkkXKwVZ4L85O_-31hEg/168s.jpg", "caption": "Lobster Escargot."}]}}, {"review": {"des": "My buddies and I came here to celebrate my friend's Bachelor's Party in Chicago. I booked the reservation about 3 months in advance since it is tough making a reservation at one of the best steakhouses in Chicago over summer. They called to confirm the week of and the day of, which is nice. I had to reduce the party size by one and they were very accommodating. <br><br>We were greeted by the hostess and seated right on time. They gave us one of the booths overlooking the entire room. Our waitress, Michelle, if I remember correctly was wonderful! She was very knowledgeable with menu recommendations and treated us very well. Service was excellent and I would rate a 5. <br><br>The ambience was cool and modern. It was upscale, but you can get away with a short sleeve button down shirt. They definitely played some DMB and OAR as background music. They had lots of outdoor seating and a great view of the Chicago River. <br><br>We ordered the Bacon, Ahi Tuna, and Lobster Escargot as appetizers. The bacon had a lot of flavor, but a little dry. The tuna was fresh and the lobster was amazing! The Old Fashioned's for drinks were very good as well. <br><br>I ordered the 10oz filet mignon. It was delicious! My only complaint is that the bark was a little dry and I should have ordered medium rare. But it was delicious and worth the money. However, I don't think the steak was as good as Gibson's or Smith & Wollensky's. For sides, we ordered the lobster Mac N Cheese, asparagus, and mushrooms. They sides were all solid! I would give the food a 4.5. <br><br>Prices are expensive, but if you are complaining about price then you probably shouldn't be coming to a steakhouse in the first place. The prices are actually on point with other steakhouses in Chicago. <br><br>Overall, Chicago Cut is a very good steakhouse and I can see why it's one of the best in Chicago. Service was absolutely outstanding and everyone had an amazing time! Food was excellent as well, but I have had better steaks before. Even so, I would highly recommend trying Chicago Cut if you are looking for a good steak!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0I4A7pJYkOoQexbIOB-JHA/348s.jpg", "caption": "Filet Mignon"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/K1xX_aDyr4oSk8OXo7PsAQ/168s.jpg", "caption": "Ahi Tuna, Lobster Escargot, and Bacon for appetizers."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TXM-ArI2CG9VApMliuC72A/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Very dissatisfying experience we had at Chicago Cut. I was recommended to this place by a friend. He said that they had the best Steak in town. This was the first time here. The staff was really friendly and explain everything very well. I didn't like that the table was in a dark corner area. I think a little too dark. Our waitress was very nice. I order a Steak medium rare. The Steak came out burnt and charred. The waitress ask if something was wrong. I told yes the Steak is burn. He look at it and told me he would take it back. He return with the same Steak that look like it had been washed and had no flavor. The waitress apologised and offered to make other Steak. But why would you even bring out a steak that is burn to begin with then try to wash off the burn crust? The server was ok but the food was really disappointing.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cHS-AnhJEEJtyxEzXfrObA/348s.jpg", "caption": "First time here!!"}]}}, {"review": {"des": "My husband and I came here for a quick weekday lunch. He ordered the blanket grouper tacos and I got the Mac n cheese. <br><br>My Mac n cheese was really good. It was the perfect lunch portion. The sauce was creamy and sweet and the spiral shaped pasta went really well with it. The pasta shaped allows it to pick up a lot of the sauce. The pasta was a little over cooked but I like my pasta with a bit of a bite to it. I would have given a five star review but my husband was very disappointed with his tacos. The seasoning was perfectly but it was hard to taste because the fish itself was very oily. Some of the fish was really blackened so it was almost burnt. He had to pull out some of the harder pieces from the taco because it was inedible. He rated the place a 1 star.<br><br>It's hard to rate a place when we both had two very different experiences. We both agreed the service and Mac n cheese was five star quality but he could not get over how hard and inedible his fish tacos were so we had to bump it down to 3 stars.", "pics": null}}, {"review": {"des": "Ok so my second visit to the Cut was much more enjoyable. I was there for lunch this time. We started with the salmon appetizer special (made by their new sushi chef) which was incredible, and a chicken tortilla soup - the soup was rather creamy but still very delicious. I had the filet mignon for main, which was perfectly prepared to medium rare. So why the 4 stars then? Their creme brûlée was really not good - it was totally below par. <br><br>I'm going to try their dinner again.", "pics": null}}, {"review": {"des": "A fantastic steak house along the River in Chicago. After being unable to get a reservation at Gibson's (also was same day a few hours before), we stumbled upon this spot and made a reservation a few hours before. From the moment we walked in to leaving feeling insanely full- it was a great meal!<br><br>We were given a choice btw inside and outside and choose inside as it was our first time there. Our server was attentive and helped provide recommendations without being pushy.  Service throughout was stellar. Drink menu was on an iPad which was nice.  Good mix of breads (flatbread, cinnamon raisin, pretzel bread) in the complementary bread basket! <br><br>I got the 6 oz filet while my husband got the Oscar which was an 8 oz filet with crab on top. Not cheap as my filet was over $40. We also split sides of macaroni and cheese and sautéed spinach - each was $11. Our server split the sides for us table side which was nice. My filet was PERFECTLY cooked and a fantastic piece of meat. One of the best steaks I've ever had. The sides were great as well though portions were on the small sides considering.  A perfect steakhouse meal. <br><br>We decided to stuff in the chocolate torte cake for dessert which was also great though fairly standard.  <br><br>It was pricey but great food, great service, good drinks overlooking the river right in the heart of the Loop - highly recommended!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/75SQA014G9BYhzK4Fsk7Pw/348s.jpg", "caption": "Chocolate cake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DciPxQpkIOZyWO8TFyKfuw/168s.jpg", "caption": "6 oz filet"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fv0d4BvHfpUZH0eC3zgnbA/168s.jpg", "caption": "Mac n cheese and sautéed Spinach"}]}}, {"review": {"des": "If I am being completely honest, I am not a HUGE fan of steakhouses. My boyfriend, on the other hand, is a huge fan. For his birthday we had a family dinner at Chicago Cut steakhouse. The food was REALLY good! However, I didn't order the steak. <br><br>First off, the location for this restaurant is prime. It is right on the river and no matter where you sit you get a great view. Outside is very popular so if you plan on sitting out there make a special request with your reservation or plan on waiting a LONG time. We didn't want to wait so we sat inside, but the windows are so big it doesn't really matter. We had a party of 6 and they accommodated us very well. One person from our party was running a little late, but they sat us anyway. I like when you don't have to wait for EVERYONE to be seated. It's annoying when restaurants make you do that. Our service was prompt and good. Our waitress kept checking on us w/o being overly present. For appetizers we got a few things. The calamari was delicious. The crab cakes were good, but the lamb pop were SPECTACULAR, easily the best thing I ate at this restaurant. <br><br>As I mentioned earlier, I am not a huge steak fan. I like unique and exotic flavors most of the time and I find steak is just one note unless you pay extra for a sauce (which I have been told ruins it so IDK). When it came time for ordering everyone ordered the steak, but me who ordered the fish and one other person who ordered pasta. The salmon was very tasty. Mostly everyone at the table liked the top sirloin steak, but one person who said it was a little bland. I tried a bite of my boyfriend's steak and I thought it was pretty good, but definitely needed some sauce. I'm not a reliable taster though because I ALWAYS thing steak needs something extra. <br><br>The service really was great though. My boyfriend got a piece of carrot cake on them for his birthday which was really good. Also, we got crème brule which was yummy.", "pics": null}}, {"review": {"des": "We went here for our engagement dinner and were floored by the service, ambiance, and of course the food! Our som gave us an excellent recommendation on a bottle of wine, as well as some of his favorite appetizers and cuts to order for dinner. The lobstercargot was a creative, fun, and decadent appetizer. Highly recommended. The steaks were out of this world - bone in filet and bone in ribeye were perfectly cooked and full of flavor. Can't wait to come here again. Make sure to request a booth if you can!", "pics": null}}, {"review": {"des": "Good for lunch and dinner but really enjoy going to breakfast and brunch here. outdoor patio in summer overlooking the river is awesome.  Amazing hospitality and shoutout to Matt E for the excellent service<br>Favorite dishes: kale and quinoa salad w/ salmon, sea bass tacos, Bloody Mary, scrambler is awesome as well as the hash browns", "pics": null}}, {"review": {"des": "I came here to celebrate my graduation and it was incredible! From the crisp champagne to the succulent petit filet mignon, everything was perfect. A beautiful restaurant overlooking the river, a great place to go celebrate something special.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HeZb1OcpVSfzlseCGh_L4g/168s.jpg", "caption": "Congratulations dessert, mint chocolate ice cream and chocolate ganache."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XdCAg4M6-9_7cjwF0r306g/168s.jpg", "caption": "Petit Prime Filet Mignon, glass of champagne with Whipped Potatoes, French Green Beans Almondine and Creamed Spinach."}]}}, {"review": {"des": "Very good classic steakhouse with an amazing view of the river. I recommend sitting on the patio, as their outdoor seating is right on the Chicago river. <br><br>Inside is also very cool, as the grand dining room is very open and is decorated with class. <br><br>The servers at this place are exceptional and exactly how an old school steakhouse should be. They are there to help, which made the experience special. <br><br>My favorite part about this restaurant is that they serve a full menu until 1 am every night! So we came to eat here after the Pearl Jam concert at midnight, which was great!<br><br>The food was very very good! My buddy got the Cajun bone in ribeye, which was very flavorful and tender, but extremely spicy! If you don't like spice then don't order Cajun style! I ordered the rack of lamb, which was perfectly seasoned and cooked to perfect medium rare plus! They also had mint jelly, which gives this place an extra boost. <br><br>This place did not get a full 5 Stars because they refused to sit us outside, claiming it was too late and they were closed, while there was at least 5 other tables seated out there.", "pics": null}}, {"review": {"des": "I returned to Chicago Cut and feel that my original rating of three stars was a bit generous.<br><br>My initial characterization of the quality of service seemed to be correct. Our waiter spoke at a volume level barely above a whisper. Confusion abounded among my party of six (four of whom were out-of-town guests that I didn't know) at just about every step of the way because nobody could hear the guy. My guests were too meek to say anything; I do this enough that it didn't affect my enjoyment. My knee-jerk reaction was that the guy got a kick out of knowing my guests were too intimidated to ask him to speak up.<br><br>The waiter was smug in dealing with us. One of my guests twice asked to see the wine list and was refused, the waiter insisting on offering a recommendation. The snob in me doesn't blame the waiter since some of my companions had already proved themselves as unsophisticated and potentially budget-minded, but his refusal annoyed me.<br><br>When it came to ordering and questioning the menu, again, there were subtleties that bothered me. One friend asked how the ribs were--dumb thing to ask, I know--and was told coldly that he was at a steakhouse. The comment was not appropriate considering the lack of rapport the waiter had built by that point. I ordered my steak rare and was received patronizingly.<br><br>The logistics of service at the \"prime\" window tables are a joke. The tables are so close to each other that I bumped elbows with the guy sitting behind me three times. What do you do? Turn around and apologize? Try to figure out who was at fault? I continued eating. <br><br>The worst part about the tables is that the bussers cannot maneuver around the circumference and instead have to extend themselves over the table to reach those sitting closest to the window. This means that conversation is regularly interrupted by way of a bicep directly in your face. It's one of those occurrences that makes you wonder who ultimately made the decision that this was acceptable. Further, and more annoyingly, the water pitchers are dangled over the table, freely dripping condensation onto your meal.<br><br>Even if this was the best meal of my life, I would have trouble looking past these flaws. The food here is a redeemer of sorts. Appetizers were great, though the Lobstercargot was not hot when it was plated. I ordered the Prime Rib and have no problem rating it as a hall-of-fame steak, the 6oz filets were not received as positively.<br><br>This is a restaurant I will most look forward to returning to when I am a fat middle-aged guy only coming downtown for special occasions. Young people would be foolish not to look elsewhere.", "pics": null}}, {"review": {"des": "I loved my dinner here for the food and the service. Our waiter (Stephen T. was amazing). Knew my name from the reservation and learned my boyfriend's when he sat us. Throughout the dinner it felt as if we were being waited on by a friend rather than someone we had just met. I ordered a dirty martini (they made it with Monkey 48 gin) and he brought out a sidecar of the olive juice so I could taste the gin on its own (loved it) and control the level of \"dirtiness\". After the martini I asked for a glass of wine, gave him a few of my preferences (red or white, which varietals I prefer, how tannic I like my wine, and a price cap). I was happy with that choice as well. <br><br>The bread basket was almost too delicious. There was a pretzel bread, a cheese cracker, cinnamon raisin sugared toast, sourdough, etc. I was trying hard not to spoil my meal but I couldn't stop myself from breaking off little pieces here and there. <br><br>All of the appetizers/sides were split table side, which was a nice presentation. I liked that the chapped up the wedge salad for us because those are typically so hard to eat. Lobstercargot was delicious as I expected, and I loved the unique options on the menu like this. <br><br>I really appreciated how Stephen took us through the steak portion of the menu, explaining the differences between cuts and between a wet and dry aging process. Some of the information I knew already, but I think it served its purpose in making guests feel more comfortable in choosing their order. I had the ribeye, which was very good. It was enough for me to eat for 2 leftover meals (reheated with a sous vide so as not to ruin it) and my boyfriend had the porterhouse (which he loved and finished). <br><br>The Brussels sprouts were not worth ordering. They're typically my favorite thing to order because restaurants get them so crispy and delicious but I thought these were bland and lacked that caramelization that's so amazing.", "pics": null}}, {"review": {"des": "This place has bad management. They treat their employees like dirt. The steaks are overpriced too.", "pics": null}}, {"review": {"des": "Cool location on the river. You can't beat that view. Service was great. I like when they divide up the sides for you so your table doesn't get cluttered up. I got the dry aged bone in ribeye done medium. Great taste and cooked more medium rare which I was ok with as long as you don't overcook it. Unfortunately it was extremely fatty. About 1/3 of it was fat. My wife had the filet (medium rare) and 2 lobster tails. Filet was really good. I liked it better then ribeye. But unfortunately the lobster tails were way overdone and cold. My guess they were grilled 1st and then they tried to keep warm so that's why they were overdone and very tough. Lobster Mac and cheese was loaded with lobster and very flavorful. Also tried the truffle potato's with bacon and cheese. That was ok. Too much truffle oil and the dish was all soggy. Overall it was ok not great but would try it again.", "pics": null}}, {"review": {"des": "NOTE: I'll give them 4 stars on the fact that my dad really liked this place. If you are looking for a bougie steak experience it's a good value. If you are looking for a truly mind blowing time flavorful food experience... probably not gonna find it at a steak house.<br><br>After a so-so experience at another expensive steakhouse, I brought my dad here. (How much steak can my dad eat in one weekend? The limit does not exist). <br><br>-1 star for the host honestly. The blonde host was super rude and literally talked down to us when we walked in. We asked if they took walk ins and he was like \"these people are in front of you\". It was incredibly awkward -- none of us were trying to cut, they were clearly waiting for a table and had already talked to him.<br><br>After getting seated, I had no complaints. The service was FANTASTIC, super helpful and also would pre-split any of our appetizers and replace them at our table. We ordered like... a lot of the menu. Tuna tartare, this crab salad thing, ribeye, king crab legs, lobster Mac and cheese, the crab cake, green beans, and the creme brûlée. Hit around 350 in price. Steak is the biggest bargain. Biggest hits for a seafood girl: tuna tartare, crab cake was shockingly good, and king crab.<br><br>For steak lovers... get the steak wtf.", "pics": null}}, {"review": {"des": "If the weather allows, sit outside! We had an 11pm reservation so the place had died down a bit but I've also been here around dinnertime and it was insanely packed so be sure to get your reservations well in advance. <br>  Started with the lobsterscargot which in my opinion was perfectly cheesy from the havarti and perfectly crunchy from the crostini it sits on. I really enjoyed this appetizer because of the unexpected flavors and textures it provided. We also decided on the triple cut bacon appetizer which I could've gone without; I just felt it was super heavy with the lobster, although delicious, it was just a heavy way to start the meal. So I suggest going with a salad or something lighter as an accompaniment if you're looking to do a few appetizers. <br>  I went with the 6oz filet and for sides we did the grilled asparagus, lobster Mac and cheese, and to break up all the fat we decided to get a small side salad which was delicious and fresh and the perfect bite with a really heavy meal. <br>  We sat outside which created ambiance. I would definitely recommend Chicago cut. The service is impeccable, the food is delicious, and you're right on the river which is an added bonus if you visit on a warm evening. Overall solid experience.", "pics": null}}, {"review": {"des": "Came here for the first time for lunch with a few coworkers. I've seen this place riding the brown line train for years and haven't made it till today. The location is phenomenal along the river. The view is beautiful and during the summer you can even sit outside. The decor is traditional steakhouse style with those old school chairs. <br><br>When we first arrived we were greeted by super friendly staff that told us that Oprah Winfrey sat at our same booth.  Our server was friendly but didn't feel very genuine but overall was decent. Our water glasses were always full. I got the old fashioned with knob creek and I'll straight up say it was very disappointing. The drink cost $17 and it was just ok. The $8 Guinness tasted better than the old fashioned. <br><br>We started with the Lobstercargot and it was really good but I'm not sure $5 a piece good. It only came with 6 pieces of lobster. I went with the skirt steak for my entree and it was great. Probably one of the best skirt steaks I've eaten. I ordered it medium with the onions on top. Highly recommended for lunch for its size and value. We also got whipped potatoes, asparagus and the spinach to split among the table. All three were standard and nothing special. One side can probably feed 2-3 people.<br><br>Overall I think the experience and food was good but there may be other options. I am not sure if I will be back but it was worth a try.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3ALAbeqovMI3LfNEhpYldA/348s.jpg", "caption": "View of the river on a beautiful spring day! We were sitting on the booth in the corner."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/p3GvQnizBgisGDa4grpl9w/168s.jpg", "caption": "Skirt Steak with Sautéed Onions"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6GDcsrrz6dA_d9Y_-4eC7g/168s.jpg", "caption": "Lobstercargot (divided up by our server.. I was lucky to get an extra piece!)"}]}}, {"review": {"des": "I cannot recommend this place enough. The entire experience from the service, the staff, the ambiance, was unforgettable. Our server Rodney was beyond friendly and gave great recommendations like the burrata salad. The view of the river with the Christmas decorations made for a perfect date night. The food was absolutely out of this world, the scalloped potatoes were a favorite. Our favorite part was getting to talk to the owner Matt, who not only stopped by our table but sat down with us and talked for at least 15 minutes and even sent out their amazing carrot cake for us. Chicago Cut will definitely be a stop for us every time we visit, if only we could get them to open an Atlanta location!", "pics": null}}, {"review": {"des": "Food was great. Steak cooked perfectly. Tender and flavorful.<br><br>To be honest the best part of my dinner was my server, Ilich? Im not sure if that's right. Latin guy, short, facial hair. At first glance I thought I was in for a night with this guy but he gave us a great experience. He kept my wife and I laughing, all while being professional and attentive. It was refreshing.", "pics": null}}, {"review": {"des": "Chicago Cut Steakhouse knows what they are doing!<br><br>Housed in a high rise business building Chicago Cut offers breakfast, lunch and dinner. It feels weird having breakfast where I have had a martini.<br><br>The room is gorgeous in an understated way. Sleek, red leather booths and soaring windows that look out over the Chicago River. Warm weather allows diners to enjoy their veranda that feels just as nice. <br><br>There is always hustle & bustle but the managers and hostesses are on top of their game. Always professional yet friendly, the servers get it right every time. <br><br>And then the food - yes! From steak to sides everything is delicious. Desserts should not be missed either. Do yourself a favor and go to Chicago Cut Steakhouse if you want quality and a bit of pizzazz!", "pics": null}}, {"review": {"des": "Imagine the best tender, melt in your mouth, expensive, steak you could ever have then go here. AMAZING That's all I have to say about that.", "pics": null}}, {"review": {"des": "More like 3.5/5<br><br>Pros: Hostess seated us quickly at a nice window seat. Our server was nice and attentive. She did forget our second round drink but kindly waived it due to the wait. The lobster escargot was my favorite - unique, flavorful and tasty. The sides were great too. <br><br>Cons:  My boyfriend ordered the server's recommended Marinated Cajun Rib Eye, while I had the 6 oz. Filet Mignon. The Rib Eye was huge and spicy. He said he much preferred the taste of previous NY strips. I didn't like the charring of my mignon. It was alright, not great. I think the Capital grill steaks were better.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dbyzCMuoL08vVq2NO6kiBw/348s.jpg", "caption": "Filet Mignon and Cajun Prime Rib"}]}}, {"review": {"des": "Ya know there are ALOT of steakhouses in Chicago. And if your reading this review you are probably on the verge of choosing one of them. <br><br>Let me tell you not to waste your time. Just go to Chicago Cut, fullstop.<br><br>I've been here when everyone and thing has been amazing and I've been here when my steak came back undercooked. The service attentiveness and concern for me having the best meal is unparalleled in the city. In a city of world class Michelin-starred restaurants, amazing!<br><br>I dare you to click my review of Swift & Sons.. I have indigestion still to this day, remembering the price of that meal.<br><br>Chicago Cut, finest in the city.", "pics": null}}, {"review": {"des": "Chicago cut steak house probably the worst experience. First time we ended up finding hair inside our dishes we got absolutely disgusted and left!!! A manager at the time promised he'll take care of our next visit. We decided to give it second try. Came again a another manager named Marshal told us he's not going take care of our visit , didn't clarify why and gave no explanation. This shows they give out false promises. Marshal seemed like angry McDonalds employee that couldn't wait till there shift ends. Miserable employees with sad faces not to mention the bus boys who kept starring at us very awkwardly you just don't keep starring at people into there eyes while they try to enjoy there drink. Place has horrible management overall. Stay away if you want a joyful night.<br><br>P.s *Drinks are \"Horrible\". Moscow mule taste like floor cleaner.*", "pics": null}}, {"review": {"des": "Very dissatisfying experience last night at Chicago Cut.<br><br>I've dined here many times. We walked up to the hostess stand and checked in our reservation. She handed menus to another lady and said loudly \"take them to table X, it's all we have left.\" She takes us to dark table tucked in the corner on the patio behind the buser stand. We sit down and our waitress was very short with us. She asked if we had any allergies I said dairy and she said is it an allergy though? I said yes, yes it is. She seemed irritated by the restriction. We ordered the holy grail end cut what they brought wasn't an end cut. Just beginning to end the service was disappointing. Won't be back anytime soon.", "pics": null}}, {"review": {"des": "Amazing experience for dinner.  The service is impeccable with an amiable wait staff and friendly, knowledgeable servers.<br><br>They offer an AMAZING wine list with bottles ranging between $35 and $1,800.  If you don't know what to get your server will have great recommendations based on your order, your budget, or your fancy.<br><br>We started with the Lobsterescargot, and it was terrific!  The lobster was cooked perfectly, and it was buttery and everything a dish should be.  We were sitting at a smaller table, and our server would serve side dishes/appetizers on small plates before bringing to the table (which we appreciated).  <br><br>We tried the Delmonico steak, and the NY strip and both were cooked exceptionally well.  Medium rare with the perfect crispy, grilled, crust.  Order both!<br><br>As sides, we shared the Brussels sprouts with bacon and the whipped mashed potatoes.  Both were great. <br><br>They have $15 valet, the riverfront location is gorgeous, and it's walkable if you're staying in the Loop.<br><br>Chicago Cut should be on your list of top Chicago Steakhouse.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/04I5PL3M3YrjlGDioFtR_w/348s.jpg", "caption": "Birthday dessert (freebie on your birthday!)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/78LJSq_kK49VG5m7kvST1A/168s.jpg", "caption": "NY Strip."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8UPsvhtI-ekS4hBeEOOw5Q/168s.jpg", "caption": "Lobsterescargot."}]}}, {"review": {"des": "Best Outdoor Seating in Chicago!  [dust never included with dish]  Best Skirt Steak in Chicago!  Unquestionable quality and portion.  Worthiness of Sides is Hit/Miss. 90-95% Male patrons. OPEN till 2 am!<br><br>FREE BREAD & BUTTER still lives in Chicago.<br><br>Drew's suggestion to put ground pepper on PUMPKIN SOUP was spot on in adding dimension to flavorful soup.<br><br>I only dream of SKIRT STEAK!  The only place to get medium-well, while keeping it flavorful with perfectly charred edges and moist.  Side dish recommended to complement slightly salty and overpowering steak seasoning.<br><br>SKIP the GRILLED ASPARAGUS, $14 for 10-12 sticks (that's $1 each).  They are really good though.  Maybe SPINACH & BROCCOLI or WHIPPED POTATOES would be a better deal.<br><br>PUMPKIN CRÈME BRÛLÉE is for the Pumpkin Pie aficionados.  Better eaten with fruit per bite.  2+ portion.<br><br>1-Star less for the cramp seating, persistent fruit fly, & loudness - music + chatter + reflecting sound.  Wanna add architectural/hidden sound dampening? You can't hear the person across from you. NO privacy on business discussion.<br><br>Say \"HELLO\" to Drew who memorized the menu ingredients.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/54GTe1D95_H40Ek4E8JKhw/348s.jpg", "caption": "FREE bread & butter"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VEfzfFyDNok9G_mnzVhD0w/168s.jpg", "caption": "Pumpkin Soup with Fresh Pepper"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0YY0uPelQ1TqlUZkm2dWTw/168s.jpg", "caption": "Steak Salad"}]}}, {"review": {"des": "We'll let's just say they just lost a customer for ever. I am walking down their walkway and stop to take a picture. And do so. Then walk in and trip over their rug. I laugh with the girl who saw it and I continue on. I get to the host desk and say I will just sit at the bar with all intentions of buying a Ribeye and an appetizer and he tells me I have been over served. We'll let's avoid an argument that doesn't matter and go spend my money at Gibson's. I suggest you do the same as the only appeal to this place is the later hours. <br><br>Sincerely,<br><br>A former customer", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zhWLfyTR3fItIh6cLci-IA/168s.jpg", "caption": "The steak at Gibson's! Thank you Chicago Cut for bringing me here!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DmJVApQ1tBfQYAsOHm60SQ/168s.jpg", "caption": "This is the appetizer at Gibson's! Don't spend your money at the Chicago Cut!"}]}}, {"review": {"des": "Impeccable service, gorgeous views of the Chicago River and skylines and of course top notch Chicago steak.  Start off with an wide variety of breads, especially a unique pretzel bread that had me asking for a second round. For the main course I went the massive Porterhouse as I was feeling ambitious that evening. It was one of the top steaks I have ever had. On par with Peter Lugers and Prime 112.  The steak was juicy, but not too fatty and cooked to perfection. Best of all it was not overwhelmed with salt or spices, but the meat did most of the talking. <br><br>My wife got the CCS Chopped salad which was quite hefty portion wise as well as taste wise. It was loaded with over 10 or more ingredients. Additionally Chicago Cut has an excellent wine list and quite a few local beers to choose from. <br><br>Make sure to end your night with one of my favorite new found desserts. An Oreo Mint ice cream, a must have and delicious way to end the evening.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VlWAA_S-hu4hoeJTisunMg/348s.jpg", "caption": "Whipped Potatoes and CCS Chopped Salad"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uYvpKFAarpdUbSOvv52LsA/168s.jpg", "caption": "Porterhouse"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ErXJZ7Nojs0jX_LcMRpgBQ/168s.jpg", "caption": "Oreo Mint Ice Cream"}]}}, {"review": {"des": "Went for a work dinner and we were treated very poorly. Rushed and crowded and the entire experience was very inauthentic. I wouldn't return at this price point and it's a shame because this used to be one of my go to places.", "pics": null}}, {"review": {"des": "If I could, I would have given this restaurant 3.5 stars. The location is great since it is right on the river and the place itself is very trendy and cool. Everything we had was good, but what led me to give this fewer stars is the high price point. I also felt that there were a few too many tables jammed into the restaurant, and they appeared to be understaffed which hurt their service quality. In my opinion, there are plenty of steakhouses in Chicago that are better which I would recommend going to over this one.", "pics": null}}, {"review": {"des": "My husband made us reservations for our 1st Anniversary and specified a table by the window.  Upon arriving, we were seated near the entrance.  He went to the hostess and informed him of his request when he made the reservation.  We were moved to a table closer towards the middle of the room, while there were 2 tables at the window free.  We were told those were for other parties.  After we were seated, I noticed they sat a party with no reservation at one of the 2 tables.  Also, when we asked the waitress to recommend a red wine, she sat a tablet on the table and pointed to the red and white wines available, but no recommendation.  Other than that, the service and food was good.  I'm not sure if we will return.", "pics": null}}, {"review": {"des": "Bad service and rude server. I ordered medium but got medium well to well-done steak and the server kept arguing aggressively that it looks like medium or even medium rare. The outside is also burned and taste bitter. When we were taking photos of our food, he came to our table to make a rude joke, asking us \"you like to eat it cold?\" Very unprofessional at this price point.", "pics": null}}, {"review": {"des": "Fantastic value for nice meal on the water and price. ON THE WATER. At night. Make a reservation beforehand or be sorry!<br><br>You can use Open Table to reserve at your convenience as it gets busy around prime dinner hours; luckily since I was flying out of town from California and 2 hours behind, a 9pm reservation was 7pm to our stomachs. <br><br>What we ordered:<br>Brussels sprouts w/ bacon <br>Scalloped potatoes <br>Dry aged ribeye<br>Scallops over potatoes <br><br>All were amazing, but the most memorable were the main entrees, as it should be. We ordered way too much food for two people, so thankfully we got to take our leftovers as well as the bread selection. Our server Eric offered us two wine pairings, split into two glasses per person, so we could share it that way, and I also ordered a creamcicle Martini which was beautiful and authentically push-pop tasting. I was absolutely stuffed by the end, (and so was my boyfriend, it is a FAT piece of steak) and it was so satisfying to actually feel full after eating at a pricier restaurant. <br><br>We also got a little chocolate cake with a candle for the happy birthday wishes. I'm so impressed with this steakhouse, we both had a fabulous time and the food, service, and view was a delightful and classy experience. Thank you for making our first time in Chicago unforgettable, Chicago Cut!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xH2g9xgQK84782NWobtDBg/168s.jpg", "caption": "Scallops to die for. Steak is HUGE. Appetizers of brussels sprouts and scalloped potatoes, complimentary bread selection."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4MQdfodumOEIN59KDUQu1A/168s.jpg", "caption": "Orange Creamcicle Martini"}]}}, {"review": {"des": "I've never been so embarrassed at a restaurant in my entire life!  We ordered 2 Rib Eye steaks Med Rare.  Steaks were brought to us medium-well and well-done.  Fine- these things happen.  We asked the waiter if he could have the steaks redone .  I don't think that's too much to ask considering what we paid to eat here.  <br><br>Then the manager comes out to ask some \"follow up questions\". Okay?  This is getting weird, but we'll play ball.  She proceeds to ask us to cut in the middle to \"make sure it isn't med rare\". I said, \"well, I'll humor you, but we already took several bites and we know instantly that it's med well and the other was well done and it's super obvious .\"  <br><br>Okay- so then she whips out a flashlight ?!?  Wtf .  We're sitting on the patio next to the river and there are like 30 people sitting at other tables and suddenly we have a manager with a fucking flashlight examining our steak in a desperate attempt to prove to us that our steak it isn't overdone.  <br><br>This was so embarrassing I've never been treated so shamefully in a restaurant in my life.  The manager was very apologetic when I told her how awkward she was making us.  She tried to convince us to stay but we were already so embarrassed we couldn't even make eye contact with the other guests.  <br><br>Here's a little tip if you are a multi million dollar restaurant on the waterfront of Chicago .  When a customer expresses dissatisfaction with your over cooked food- do not bring a FLASHLIGHT out to try and prove them wrong.  <br><br>The manager begged us to return another time as we were walking out , it was even more embarrassing seeing her gravel after an embarrassing situation that SHE and her staff caused.  <br><br>It would take A LOT for me to ever return here after that experience.  In a town like Chicago , there are great steak restaurants literately on ever other street corner.  We'll just go to one of the 10 other choiceS. <br><br>No one should ever have to live thru that .  And how much you want to bet That no one will reach out to me or respond to this review .  They don't care. They made their money and they're good I'm sure.<br><br>Edit: this incident happened about 4 weeks ago and still no contact from management or any Representitive of Chi Cut.  That seals the deal- never going back.  Went to Bavettes last week and it was stellar.  Too many nice steak places within a mile to ever come back here .", "pics": null}}, {"review": {"des": "I hate giving this restaurant 4 stars, but there is no option for 4 1/2 stars.<br><br>AMBIANCE<br>Incredible.  Absolutely beautiful.  Floor to ceiling glass windows overlooking the river.  I got there shortly after 1am, and they had just closed the outside patio that sits almost right on top of the river.  Amazing view.<br><br>SERVICE<br>6 star service.  Not too much and not too little.  They definitely know to give the white glove treatment.<br><br>FOOD<br>Here is where the 4 1/2 star rating comes in.  The French onion soup - hot, flavorful and tasty.  The mash potatoes and shucked corn - delicious.  The warm Apple tart and ice cream - out of this world.  The prime steak was perfectly aged and taste like butter.  However, the steak was over salted.  I always eat steak with sour cream, and this cut the saltiness.   After half way through the steak, it started to wear on the palate.  Because the steak was half of the bill, I rated it 4 stars. <br><br>RECOMMENDATION<br>Most definitely - I would return.  But when you go, tell the waiter to make sure to tell the chef to go easy on the salt to have yourself a 5 star experience !!!!", "pics": null}}, {"review": {"des": "The steak was perfect, and the sides were amazing, and the service was impeccable! Definitely worth the money! I'll be back again.", "pics": null}}, {"review": {"des": "I am not sure how this place gets 4 stars.  The restaurant is basically a large open room with too many tables. You can not get seated at a table without disturbing someone already sitting down. It's crowded, and LOUD. The acoustics in this place are such that you cannot have a conversation without shouting.  I brought a client hoping to have a business conversation. Forget about that, unless you use sign language. The food is bland; the  soups had no taste, the broccoli tasted the same as the asparagus, and the steaks (filets, prime rib and a Delmonico) were not the quality of a high end steakhouse, (you can get better at a longhorns).  If your looking for a quality steak in a quiet setting don't even consider this place.  I know good steakhouses, and this is nothing but a tourist trap for convention goers. There are many<br>Great steakhouses in Chicago; this establishment is not one of them.  Disappointing is an understatement.", "pics": null}}, {"review": {"des": "Let me start off by saying that the service here was EXCELLENT and our server was very knowledgeable about the menu. The food, however, was sadly mediocre. For what we paid, the food was definitely not worth it. My husband ordered an 8 oz filet which wasn't a good cut due to there being a chunk of fat, it was way too salty and the lobster tail was in his words \"rubbery\". My 6 oz filet was salty as well, my mashed potatoes were dry and not seasoned well. <br><br>For a place that charges an arm and a leg, you would expect angels bestowing their blessing upon you while you eat but we were very underwhelmed. The only highlight of the night was the key lime pie which was delicious but we came here for the steak and not dessert. <br><br>Chicago cut, unfortunately, didn't make the cut for us.", "pics": null}}, {"review": {"des": "Outstanding food and service! My boyfriend took me here to celebrate my birthday and we were impressed. We tried the lobsterscargot, Delmonico, bone in NY strip, truffle scalloped potatoes, and Brussel sprouts! All top notch! Extensive wine list and great bread service. Above and beyond service from entire staff! They even brought me a complimentary chocolate ganache birthday cake!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jYK0AKu3Bp_xlxzhoN5Xyg/348s.jpg", "caption": "Chocolate ganache cake!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pBHEviQ-pww6eFNoYoZOJg/168s.jpg", "caption": "Delmonico with Truffle Scalloped Potatoes and Brussel sprouts!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2PYrs6cjYvj2ai4NdxrsVA/168s.jpg", "caption": "Lobsterscargot"}]}}, {"review": {"des": "The decor is dark and the service is perfect. We went for an upscale lunch and the time flew by because of the delicious food and great service.", "pics": null}}, {"review": {"des": "We had an amazing dinner. We couldn't find a place that would accommodate 14 party. But this place did a great job. The owner came in and chatted with us. His staff did a great job, the sommelier came in and entertained us. The steaks were cooked perfectly, our seafood tower appetizer was amazing. Really can't say enough about this place.", "pics": null}}, {"review": {"des": "I thought this place was overrated and crowded.  for the price it wasn't that fancy yes it has a good view however there's plenty of restaurants that have just to get of you that aren't so mediocre. We ordered a steak and I was a little cold and drinks were watery go elsewhere", "pics": null}}, {"review": {"des": "I will start my review as I walk in the door.  Greeted with warmth and sincerity.  You just get the feeling its going to be special.   I was there for dinner with clients.  I'm always hesitant brining a client somewhere I've not been to before, but instantly knew it would just fine.<br><br>We were seated near the window, which was perfect.  the few, though not needed was great.  Our server came instantly and made us feel we would be taken care of...and we were.  we ordered drinks and never felt rushed to order.<br><br>I ordered a magnum wine that was simply outstanding.  I've never ordered one before, but after discussing with the server it made sense.  then the bread came...now I don't usually eat it, but OMG I did.<br><br>We all ordered steaks - two NY Strips, a Kansas City Strip and a Bone-in Rib Eye.  All were ordered medium rate and all came out perfect.  We all so ordered Asparagus, Mushrooms, and Truffled Scalloped potatoes...OMG (I know, again) they were incredible. <br><br>Ambiance: Just feels relaxing and like a really cool place to be<br>Service: Simply outstanding<br>Cleanliness: Perfection<br>Food: Could not name one flaw<br><br>I simply can't wait for my next client to as for a recommendation...", "pics": null}}, {"review": {"des": "I loved my experience at Chicago Cut. I was there for dinner and it was excellent.<br><br>FOOD:<br>Let's start with the bread basket. OMG. I just need to throw it out there that all of my favorite breads that could be in a bread basket were in this bread basket and I could not be happier! Pretzel rolls? Hell yeah! Cheesy crackers? Also hell yeah! Okay, now on to the food you actually want to hear about... :)<br><br>I ordered the roasted chicken (not sure how it is listed on the menu). Yes, I go to steakhouses and, more often than not, will not order steak. Anyways, back to the chicken! Yum! The serving was half of a chicken, and it was so delicious. The chicken and whatever sauce it was served with paired together so damn perfectly. MMM!!<br><br>We shared macaroni and brussel sprouts for side dishes. They were both really good, but I cared more about the chicken and did not give much attention to the side dishes. I would probably order different sides if I return to Chicago Cut in the future, but it would only be because I want to try other side dishes.<br><br>SERVICE:<br>On point! The waiter was so knowledgable about how much food to order for our table, some background on all the dishes, and he was also very attentive. Honestly, everyone was so friendly. The hosts were awesome, the bartenders were great while we were waiting for our table, and, like I said, the waiter was great, too.<br><br>VIBES:<br>Really cool atmosphere and located right on the river. The interior was so pretty and it was decorated for the holidays. I loved it.", "pics": null}}, {"review": {"des": "So this place is not bad.  We went on a Friday night and it was packed.  The place was loud and bumping.  Our waitress was very nice and did a great job.  However, the tables are so close together.  When one of the busboys went to fill up water or take away a plate on the table next to us, he banged either me or my chair.  This happened about 6 times and it started to get pretty irritating.<br><br>We ordered the \"Holy Grail\" of Prime Rib.  It was not bad, but nothing special.  The flavor was okay but it was under-seasoned.  We got it medium rare and it had parts that was pretty tough.<br><br>We also had the Lobster Salad.  This was really good.  The combination of lettuce, tomatoes, fresh shucked corn, and lobster paired well together.  <br><br>For sides we got the Truffled Potatoes and the Brussel Sprouts.  The cheese on the top of the potatoes was nice.  I could also taste the truffle which was great.  However, the sprouts, while cooked well, was kind of bland.  It needed to be seasoned more.<br><br>Overall, it was worth it to check this place out.  But I think we prefer Primehouse and their dry-aged steak.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EHVUhK0lOveL9f3XSOYokQ/348s.jpg", "caption": "“The Holy Grail”  Bone-In-Prime Rib"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Uib7CpQVkEdBwU7VlyX4Wg/168s.jpg", "caption": "Truffled Scalloped Potatoes  Melted Cheese, Pancetta, Swiss Chard"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yZS-6vIVrvdN6_s8FgcnSw/168s.jpg", "caption": "Brussels Sprouts  Nueske Bacon & Parmesan"}]}}, {"review": {"des": "One of my top 5 restaurants which never fails.  I had the grilled grouper sandwich for lunch and I was simply amazed at the flavor.  Cut also has the best soup in town, hands down.  I love the butternut squash soup and the gumbo.  I also picked up a pecan pie from the Thanksgiving menu which was delicious.", "pics": null}}, {"review": {"des": "I wanted to love this place so much!!!!   Unfortunately, I had a horrible experience.  We had patio reservations for 5:30, it was 65 degrees.  They informed us that they closed the patio dining because it was going \"to be chilly later\".  Fail #1.   Please text, email or call me if my reservations have changed.  We purposely reserved the patio for a reason.  <br><br>Fail #2.  My biz partner and I were celebrating a special occasion.  We ordered 12 Eastern Oysters to get things going.  A 1/2 later our Oysters arrived but mind you they took our dinner order while we are waiting.<br><br>So the Oysters arrive finally and we couldn't even have our first bite before our dinner entrees arrive.   They apologized but sat there with a tray of food while we were rushed beyond belief to eat our appetizer.  <br><br>The dinner tab was $417.  And the worst experience I've ever had.  Shame on you.  Ur better than this.  Actually, maybe just another typical steakhouse basking in the hollow of a riverside dining experience.", "pics": null}}, {"review": {"des": "We haven't tried other steak house in Chicago so i can't say that this place deserves its ranking position as top 3 best steak house in Chicago or not...but, what i can say is Chicago Cut Steakhouse is a good but not great or must try restaurant. The service is good. However food is just fine, especially steaks.", "pics": null}}, {"review": {"des": "This was the worst experience I've ever had at a steakhouse. If you are looking for ribeye, try longhorn or outback because that is the quality of the steaks. The servers are rude and if your steak is over cooked they will tell you that you are wrong without even looking. I'm not sure how this place gets the rating that it does, but fortunately there are tons of other great steakhouses in Chicago so if you are searching for a place to get a steak choose another place and save your $$$.", "pics": null}}, {"review": {"des": "Went there yesterday for my birthday, nice scenery but my salmon was raw in the middle. I couldn't finish my meal. I wish it was cooked all the way.", "pics": null}}, {"review": {"des": "Horrible Just Horrible i would expect the service to be better then the purchasing and buying habits of Mr Sharif when it comes to food and service! Please Do not forget to pay you're out standing Balance Cooler Depot!", "pics": null}}, {"review": {"des": "Fantastic brunch!  Our waiter Eddie was very accommodating and the food was superb.  They have a brunch menu, but there are other Egg dishes on the Lunch menu which was a little confusing.  I had the CCS scrambler with a few add on's like spinach & artichoke.  The \"hash browns\" are actually more like a potato cake - and absolutely mouth watering.  The bloody mary's were great, they were just right - not too much pepper or horseradish.  I also had a Rose Brut, which was a little pricey at $35 for a single serve bottle but very nice all the same.  <br><br>Looking at an employee review that was posted recently, I am a little concerned about the management.  I have lots of respect for the food service industry and I won't patron places that treat their staff poorly - no matter how good the food.  I hope Chicago Cut corrects the issue.", "pics": null}}, {"review": {"des": "I had made reservations for our anniversary on a Saturday night and overall we had a yummy dinner. I had requested an outdoor table right by the river because come on, the Chicago views are unbeatable. They truly are amazing. It was super hot that day and I was worried it would be too much but it was fine. Our server was quick to approach us and took our drink order. I honestly didn't love the first drink he brought out and then he brought another one which I also didn't love. I felt bad and didn't want to send the second one back but I was like I'm not going to let this defer me away from this place. The bread basket was okay, no warm bread in there but again, not the end of the world. <br><br>For our appetizers we got those lobster escargot balls and they were very tasty and a must get here so suddenly things were looking up. We then each got the bone in rib eye which was huge and honestly one is big enough to share over here. For a side we got the truffle scalloped potatoes and they were also very yummy. But I have to say the bone in rib eye, although very tasty, I'm more of a lean meat kind of gal and should have just gotten the filet mignon but I'll know for next time. For our dessert we went with the chocolate cake which had a very nice presentation and it was pretty good, not the best I had but tasty. <br><br>Overall, we had a good experience, with good service. Some things weren't my cup of tea but overall they do things well here and no wonder so many celebs make it up here. I don't know if this is my number one choice for steakhouse in the city, but it's definitely a good option in our plethora of steak places!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Mhh5j1DRoi-Kyb18oPDcNA/348s.jpg", "caption": "The best thing here"}]}}, {"review": {"des": "What kind of steakhouse doesn't have carpaccio?  Seemed like a nice old-school, clubby venue with an older crowd.  Oddly, the sea bass (very good) was wayyyy better than the steak.  Neither the service nor the food felt like a $200 dinner.  We took a good look around and won't be back.", "pics": null}}, {"review": {"des": "Our hotel concierge recommended this restaurant, so we were looking forward to it.  Ran into three mega problems.<br><br>THE NOISE.  The restaurant is very noisy, having all hard surfaces.  But adding to the problem was loud, atonal music.  I have a hearing problem, and although I was able to adjust my hearing aids to compensate for the conversational. Lose, I was unable to fix the music noise.  I had to ask three times to,have it turned down; the first two requests were ignored, and then it was barely turned down.<br><br>THE WINE MENU.  It was on a tablet, a great idea, but the Implementation was awful.  Our waiter had trouble using it.  And to add insult to injury, the tablet turned itself off and locked itself up, requiring an unknown password to reopen it.<br>THE STEAK.  Of course, it's all about the steak, which was awful.  The filet came smothered in pepper, which was not indicated on the menu.  I struggled for quite a while to cut the crust off all six sides with a knife duller than my toothbrush.  Once I got into it, the filet was gristly!<br><br>Bet you can guess we're not going back<br>T", "pics": null}}, {"review": {"des": "Disappointed to say the least. <br><br>Have been to Chicago Cut multiple times and it never disappoints but yesterday June 8, 2018 was very different. <br><br>My wife and I decided to celebrate our one year wedding anniversary at Chicago Cut. We booked our reservation two weeks in advance and requested to be seated outside. For days we were looking to a wonderful dinner on the gorgeous outdoor patio. When we arrive for our reservation, the hostess seats us at a table inside. I kindly ask the young hostess if we can sit outside since they ate multiple empty tables outside and we requested to be outside. She goes back and checks with another hostess and tells us it will be about a 30-45 minute wait to sit outside. Once again, I remind her that we booked our reservation to sit outside and I didn't understand why there would be a wait. She informed me that there was nothing she can do.<br><br>When we were leaving I asked the head hostess why we weren't seated outside. According to her \"I was told not to seat anyone outside anymore\" and that she was \"just following orders\". There were 11 tables when we got there and 6 when we left. They could have easily accomadaed our request. It's disappointing that we were lied to intially as to why were weren't seated outside and that we weren't informed early that our requested was no made. After looking forward to this dinner for days, it just ruined the meal for us.<br><br>This did not ruin our one year anniversary but it did leave a very sour taste in our mouths about the restaurant. <br><br>Entrees were excellent, Dessert was subpar, service was rushed. Our waiter seemed like he was overwhelmed by the amount of tables he had or just didn't care about us. <br><br>I loved Chicago Cut. Started going there ever since Waddle and Silvy started promoting it on ESPN 1000. But something has changed and not for the better. <br><br>Unfortunately, this will no longer be my go to steakhouse in Chicago.", "pics": null}}, {"review": {"des": "I went to Chicago Cut for dinner tonight. The food was incredible and if I was grading Chicago Cut on just the food, I would go back in a heart beat. Up until I received the check, the service was also great. <br><br>However, when I received the check the treatment I got was embarrassing for a restaurant like Chicago Cut. I ordered 3 bottles of Decoy Cab for $58 a bottle. I filtered on the iPad menu for bottles under $70. I showed the iPad to our waitress, Dana, and she brought out a bottle of Decoy. The waitress showed us the bottle of wine and said it was a \"Decoy 2016.\" I received the check and noticed that she charged me $90 a bottle. I politely asked her to fix the mistake on the receipt and that's when things went downhill... Dana got SUPER rude about it and said that I ordered the $90 bottle and not the $58 bottle. I told her that wasn't the case and that I showed her on the iPad which bottle I ordered. She basically called me a liar and said I never showed her the iPad even though the 4 people I was with all said that I showed her the iPad. The manager, Leo Guili, then came over and was not polite AT ALL. Leo started yelling at me and said that it was my fault that I did not catch the mistake when she brought me the bottle of wine (even though I had no idea she gave me the wrong bottle). He even said that I never showed her the iPad which was not true. He then (while yelling) said that his waitresses never make mistakes. I asked Leo \"Were you standing here when your waitress presented me with the wrong bottle of wine?\" He got super accusatory and said that it was my fault I didn't catch their mistake. I've NEVER seen a manager at a high end restaurant like Chicago Cut yell at a customer and treat their guests like I was treated tonight. It was unbelievable. <br><br>I was taken aback by how UNPROFESSIONAL the manager at Chicago Cut was. I will NEVER go back to this restaurant because of him. I feel like I got scammed by going there. I would never recommend ANYONE going to this place unless they want to get scammed. <br><br>FYI - the bottles that we ordered and the bottles that we received retail at the exact same price.", "pics": null}}, {"review": {"des": "Had a great meal with my wife for our 10th Anniversary. Great food , service , ambiance and scenery along the river is very nice <br><br>The Cajun bone in ribeye  was very tasty and spicy.  Would definitely return.", "pics": null}}, {"review": {"des": "Loved everything about this steakhouse! Staff was attentive and on point!! The location is great and The Asparagus/crab salad is the best :) <br>The bar area is intimate and fun. And the drinks are pretty stiff. Have Fun & Order Away..", "pics": null}}, {"review": {"des": "The best steak I have ever had in  my life. I believe that the drinks were a bit pricy but just as delicious as the food. The staff was very helpful and attentive to all customers. Caution: the floor was abnormally slippery so I had to watch my step in my heels. The tables were close to one another but that is typical. <br><br>Overall I would enjoy another lunch or dinner.", "pics": null}}, {"review": {"des": "This review is for a past visit.  Went to Chicago Cut for a business dinner, and I have to say everything was fantastic from drinks to dinner.  Sat put on the patio and was very enjoyable even though it rained a bit. The lamb rib chops appetizer was outstanding, the cheese potatoes were decadent, and the filet perfectly cooked and melted in my mouth. <br><br>Definitely worth a visit.", "pics": null}}, {"review": {"des": "Great experience! We had the best seat in the house with the perfect views(was told it was Oprah's seat when dining). Sheldon waited on us, he was great! He had great recommendations, was super friendly. Food was AMAZING! We had filet, rib eye, lobstercargot(most amazing tasting), saluted spinach and broccoli as well as Mac and cheese... everythingggg was so flavorful and tasty! Will definitely be coming back!", "pics": null}}, {"review": {"des": "Went to Cut to celebrate my wife's birthday - this was our 5th time there.  Needless to say, you pay good money for great food/ambiance/quality and service.<br><br>This time was different, they missed the mark on 3 out of 4 I mentioned above.  Only one they got right was ambiance, weather was great!<br><br>Paid $75 for the Holy Grail, steak wasn't as hot in temperature and The steak was mostly fat.<br><br>Soup was decent.  <br><br>Service wasn't great, probably why steak sat and was lukewarm.  Couldn't find the server most of the night and so we just wanted to get out and didn't bother saying anything to the manager. <br><br>Terrible service, mediocre food and no specialty dessert.  Worst $300 spent!!!", "pics": null}}, {"review": {"des": "After duking it out with my Sister on where to take our Mother for Mother's Day, my suggestion for Chicago Cut made the Cut. Mother's Day brunches are always expected to be over crowed and Buffets are hardly fun. Yet, this one was different. The service was absolutely exceptional! We didnt have to blink before a cocktail or our water was being refilled. Definitely worth the $75 per plate excluding cocktails. I requested a window seat because my Mom is all about views. Chicago Cut graciously obliged my request! The Buffet was extensive from Prime Rib, Honey Glazed Ham, Crab Legs, huge Shrimp, Mac & Cheese, Omelettes, and a kid table. They really left no stone unturned.", "pics": null}}, {"review": {"des": "We came here for our anniversary last year. We were seated outside and loved the ambiance. We started with an appetizer, the lobster cargo. It was so amazing! The flavors were just perfect, and so much garlic! Yum!<br>However, I think that the flavors from this appetizer over powered the steak. We ordered the ribeye for 2, and I did not enjoy it at all. It was a huge steak, and towards the middle, the steak was not cooked enough in my opinion. <br>I would come back just for some wine and lobster cargo!", "pics": null}}, {"review": {"des": "I don't really know where to begin - except that if you're in chicago or live in chicago and have a need for fine meat and dining, it doesn't get better than Chicago Cut. <br><br>Our waiter Chris was absolutely fantastic, it got to a point where I was wishing he just sat down with my buddy and I and talked steak, drinks, and all things enjoyable in life. If I return, i'll be asking for Chris upon my reservation. <br><br>Okay on to the food, for an appetizer we got lobster cargot and can I just say /// WOW. That's it, incredibly full of flavor, delicious cheeses all over - the perfect amount of juicy, crunchy, and I'm legitimately salivating writing this. I had the filet medium-rare and it was done to perfection. The seasoning and the sear were fantastic, they knocked it out of the park - all meats are USDA prime and you can tell. The only meh, could have gone without it dish was the crab mac n' cheese. Other than that, it was not just a meal but a performance of sorts to enjoy. <br><br>If you get a seat by the window or outside on the water the views are phenomenal and only add to the experience. I couldn't recommend this place enough. Happy eating!", "pics": null}}, {"review": {"des": "This place is trash, the way they treated me on my birthday was unbelievable.  First they supposedly booked my reservation for the day before on accident.  I'm pretty confident I know what day my bday is on.  My speculation is that someone more important needed my table on a Friday night.  Then when we got there even though I had a reservation for 10 people we showed up with 8 and one person walking that was two blocks away, they wouldn't seat us and threatened to not give us a table at all.  I made a reservation almost two weeks in advance.  The host said these orders are coming down straight from the owner.  My friend that showed up 5 min later was turned away.  The character of the owners trickles down to the employees.  I'm not surprised to see the Crain's article about the owners being sued by their investors.  I'm also not surprised that the owner was denied a dock on the river at his own restaurant after begging the mayor.  He must've really pissed someone off.  Seems to be a trend with this restaurant group.", "pics": null}}, {"review": {"des": "If I could rate higher than 5 stars I would. We made an online reservation for 8 pm on a Thursday night. Got delayed and luckily was able to change by app on my phone to 8:30. They offer a large outdoor dining area looking over the Chicago River and the spectacular Chicago architecture. Our waiter made excellent recommendations for my wine and my dates whisky. He was very knowledgeable of everything they offered. The menu is pricey, but not ridiculous. I had the Chilean Sea Bass, and my boyfriend had the NY Strip. Sides were truffle scalloped potatoes and charred (almost sweet) Brussels sprouts. Everything was prepared perfectly! The waiter checked back often. The bussers continually cleans crumbs from the table and refolded our napkins when we excused ourselves to use the restroom. Then the manager stopped at the table and spent more than 10 minutes to check on us. This was the most attentive staff I have ever seen. And I'm a complete foodie! I included photos of the view. Forgot to photograph my food! I'll be back again!", "pics": null}}, {"review": {"des": "The place is absolutely crowded. The owners treat the servers like sjlhit. You can feel the tension. Go to one of the million steakhouses in the area", "pics": null}}, {"review": {"des": "This was an amazing steak the flavor was about as good as you can get my only complaint is there was a good significant amount of fat trimmings. Not just marbling which I love but lots of fat trimmings on the outside of the steak. Service left something to be desired, I went to the bar by myself, ordered $150 in steak/cocktails and wasn't given more than one word answers from the bartender. Again the food tasted really good, just didn't feel like the overall experience was enjoyable.", "pics": null}}, {"review": {"des": "Sitting outside in the spring or summer is awesome.  The sides were great especially the potatoes.   It's not the top steak in Chicago, but when you combine the atmosphere, service and the sides it's worth the visit.", "pics": null}}, {"review": {"des": "usda prime filet group dinner. strong but not a super standout.  sides and desserts standard", "pics": null}}, {"review": {"des": "I've been here a few times. Service is always good. There is a bar when you first walk-in if you'd like to have a pre-dinner drink or if you're waiting for your party. On my recent visit, I had the bone-in filet. The flavor was bland. I ordered it medium well however it was definitely cooked well done. They have the typical a la carte sides which were ok.", "pics": null}}, {"review": {"des": "Steak me! <br><br>Came by here with a few friends during our visit in Chicago. Had a reservation at 830pm and was seated immediately. We decided on the Double Cut Bone in Ribeye which is believe was 40 ounces,  truffled scalloped potatoes, asparagus, and brussel sprouts.<br><br>The Ribeye was very tasty! We ordered it medium rare, but it came out more on the rare side. Even with that the ribeye was really good. That double cut is no joke and was huge and flavorful. <br><br>The truffled scalloped was our top pick for side of the night! Coming in 2nd was the Brussels sprouts, then the asparagus.<br><br>Overall the service was great. If Im back in Chicago i'd consider coming back. An Above average steak house worth your attention.", "pics": null}}, {"review": {"des": "Amazing dining experience.  British Steve was fantastic.  Eddie Vedder was here the same week for the Cubs' opening week.<br><br>My director treated our team and this lucky girl to a wonderful dinner.  We started off with cocktails at the bar.  All I can remember was that dinner for the four of us was well over $1000.  Truly superb though.  <br><br>Cocktails:  The Poloma<br>Wine:  2014 Far Niente Cab Sav<br>Appetizers:  Lobsterscargot & Lollipop Lamb Chops<br>Mains:  Chicago Cut Bone-In Filet (When Available) <br>Vegetables & Potatoes - Yes, we got one of each.  Can't go wrong.", "pics": null}}, {"review": {"des": "Our party ordered two kansas city strips medium rare (a ny strip with a lil bone).  <br>  <br>Received two vastly different steaks. One was 1/4 medium rare and the other 3/4 (3/4 is fine considering the bone).  <br>  <br>When i told them mine was overcooked and gray the waiter came out with a flashlight and tried to tell me it was medium rare. I was like GRAY and a millimeter strip of red is not medium rare. <br><br>They said cut along the bone which was much better but thankfully we ordered 2 and one was vastly different.  <br>  <br>Regardless i had to order a ny strip because the cook and management want me to eat half a medium steak rather than spend the time to cook the bone side longer. 2 flips and even heat wont cook a kc steak. Not complicated. Bones are hard to heat.  <br>  <br>Frankly im appalled they brought out flashlights and didnt even acknowledge me when i said the kc strip next to me looked much better.  <br>  <br>They still charged for the kc strip and the properly cooked replacement ny strip i ordered (boneless kc). And were offended when i said it was too hard for them to cook a kc so give me an ez cut.  <br>  <br>I come to steakhouses to eat meat better than i can cook. Be it dry aged or a trickier cut like kc. You're better off googling a steak recipe and buying a consumer prime cut at jewel than coming here.  <br>  <br>You'll save at least $40 if they get the steak right the first time. Beyond that good luck.  <br>   <br>Cocktails were ok. A step up from mediocre but glasses were sticky and the measurements/ingredients were off for the pricepoint. Im ok with a mediocre old fashioned but dont charge $$ for a common drink and do a shittier job than hick suburbs", "pics": null}}, {"review": {"des": "Amazing service and food. I celebrated my birthday here and they made it so special. Our server,<br>Rodney, was phenomenal. We had the filet with scallops and the bone in filet. Both were great! The truffled potatoes and the brussels sprouts were great, too. Highly recommend this steakhouse!", "pics": null}}, {"review": {"des": "I have no idea why I have not written a review of Cut before... perhaps I've been in a fugue? We have been regulars since it opened. <br><br>1st - can't beat the location. On the river & amazing views. In the summertime the patio cannot be beat.<br><br>2nd - Wine list. They have an incredible selection. I'm picky about my Sauvignon Blanc - & they get that it's New Zealand or nothing.<br><br>3rd - Staff. They have some of the nicest on top of their game servers & backup staff around. <br><br>HUGE shout out for Scott! He is amazing! I am a total jerk & don't remember his last name. They have us in the system & we just automatically get him. Brown buzz cut hair, glasses, mid 40's. Tell him Leah said hi!<br><br>4th - Food. They make these Parmesan cheese crackers that my Palindrome is crazy for. He always asks for just them, no other bread. My honey always gets the Scottish Salmon as he is not a big red meat eater. He did get a filet once & I had a bite. It was amazing. I am a big salad fan & always get the chopped salad, extra chicken & dressing on the side. Stuffed but not disgusted with myself is a nice feeling.<br><br>Con's: <br><br>Expensive. <br><br>I miss the complimentary purse hook. Were too many ladies stealing them? Have the servers track them. <br><br>Floors. Ladies... tread carefully. Someone thought highly varnished floors was an amazing idea. Not so great if you are wearing an amazing pair of high heels. They have rugs throughout so no doubt many a lady has wiped out. <br><br>Bathrooms. <br><br>1 - Right outside the kitchen. Heads up, look lively and try not to get decapitated by a server moving fast.<br><br>2 - The ladies room is a disaster. I took away a star for this reason. They put these giant nasty smelling, skin drying, industrial use handsoap on paper napkins. Seriously??? People are spending hundreds of $$$$ on a nice meal & you can't splurge on nice handsoap? <br><br>The sink counter top is flat black & ugly. The facets splash like crazy & you have to travel to get a napkin, as a result they are just a giant puddle. <br><br>Napkins everywhere. <br><br>Check the garbage once in a while, it gets filled fast.<br><br>While I am at it... the lighting is awful. When I left home I thought I looked nice. Not so in Cut's bathroom. They installed \"make you ugly\" lighting. <br><br>Hopefully someone at Cut see's this & if anything... nicer handsoap pretty please.<br><br>I'll be back for that awesome salad.", "pics": null}}, {"review": {"des": "Second time coming here, and while I absolutely love the food idk why each time I've come here I was made to feel completely unwelcome by two different front door managers. Nerdy white guy late night, and really short guy around happy hour. I understand I might look like a thug or whatever but I hate when I'm treated like I'm going to be a threat or a problem without even doing anything. I hope you guys get some  new managers soon or some kind of training, because there's a lot of ppl that look like me that act and  tip well that just want to have a nice steak and feel welcome. &", "pics": null}}, {"review": {"des": "The food was good but the staff was very rude. As soon as we finished dinner we were asked to move to the bar (which was packed) because \"they were at capacity.\" We had just spend $400 on dinner for 2 people. Would not recommend unless you want to be shuffled in & out.", "pics": null}}, {"review": {"des": "*Pro-tip: if you want to avoid lawyers, avoid CC. There's always lawyers all over this place (Kirkland & Ellis is in the building, and their lawyers get $30 daily stipends).<br><br>Pros:<br>- Best foie gras in the city (and I eat it everywhere)<br>- Prime rib is pretty good (Lawry's and my house is better) but often sold-out, especially if you're not a 9-to-5-er<br><br>Cons:<br>- Service is almost always meh. Sometimes snooty. Had pleasant service once.<br>- Steak is meh... which is meh in itself, considering this is a steakhouse<br><br>-----<br>If you like foie gras, COME HERE. For anything else, you will neither be impressed nor extremely disappointed here. Very ok.", "pics": null}}, {"review": {"des": "I've heard many great things about Chicago Cut over the years and was excited to finally try it on my latest visit to Chicago.  For one reason or another I just wasn't feeling very \"steak-ish\" the night I was there so I opted for the pork chops, which were beautifully prepared and tasted fantastic.  The lobster mac & cheese side was a nice decadent addition.  The burrata and tomatoes were a refreshing starter.  The price was steep overall, but given it's prime location and nice views through the floor to ceiling windows of the river it's worth it for a nice occasion.", "pics": null}}, {"review": {"des": "This place is excellent. The crab/avocado appetizer was superb. Filet was cooked to perfection. Best cheesecake ever for dessert. <br>This place can be loud but every bit worth a fantastic dining experience.", "pics": null}}, {"review": {"des": "Great service. Steaks cooked to perfection. Nice ambiance (a bit loud inside tho). Entire staff was friendly and welcoming. Would highly recommend. Shoutout to our server Dennis. He was phenomenal!", "pics": null}}, {"review": {"des": "I had really high hope on this place since it popped up from the list of \"the best steakhouse in Chicago\" and Chicago is known as good steak. We ordered a double cut porterhouse, Nueske bacon - triple cut , and sat by the river. The ambience was okay and city view was good. <br><br>However, the cut was cooked too long. We ordered medium rare but it tasted like medium well and it tasted dry, chewy and old. I could even tell if ya really a Prime graded steak. <br><br>For 120 dollars a person per meal, I expected it should be much much better than they did. By the fact that I would not like to have a new one since I'm too full, I didn't know if this was just a mistake or it's normal for them.", "pics": null}}, {"review": {"des": "Celebrated our 35th Anniversary, wonderful place, we were treated very nicely and were made feel very special.  Th steaks were the best we gave ver had and the macaroni w lobster was out if this world.  When we asked for our check we were told someone had already paid the bill.   Wow!  What a nice surprise and treat!  Happy 35Th Anniversary to us.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ofGOkEHieVRfSX4ajS3gmA/168s.jpg", "caption": "Some very nice person picked up our check tonight:  thank you, we were very surprised and thankful.  ."}]}}, {"review": {"des": "I took my wife here to celebrate a special occasion the day after Valentine's Day.  My wife ordered a NY Strip, medium.  It came out kind of rare so she politely sent it back.  The front of house manager brought back what looked like a piece of charcoal. She then had to bring it to his attention again.  Another steak was prepared and it came out so rare that we both thought it was Ahi tuna.  My wife had no steak or entree of any kind that evening.<br><br>This was our first time at the restaurant, and, sadly, our last.  The waiter and front of house manager were both very apologetic and knew we had a bad experience.  I don't fault them, but I'm writing this review so that hopefully their management sees it and understands there is far too much competition in the steak and seafood category, and your business is not guaranteed.  Get your kitchen in order.", "pics": null}}, {"review": {"des": "Chicago Cut Steakhouse was the bomb in the bar area.     We had the dream team of Sara, Dillon,  and Adriana.  Cocktail was average; bar needs Luxardo cherries.  The establishment is was too upscale to be using bright red cherries in there drinks.  The food came out promptly and was hot and delicious.   Price is a little steep.  But Sara, Dillon, and Adriana made the whole experience superb.   I would go back in a heartbeat if the dream team is on duty.  They are all three delightful,  professional,  attentive,  and just spectacular.   Thanks to them for a memorable evening.", "pics": null}}, {"review": {"des": "This is my mom and i's favorite place to grab a bite after a late hawks game. We love the caprese salad, lobster Mac and cheese, and all of their salads! I have actually never once had a steak here, but every time I see one pass me my mouth waters.", "pics": null}}, {"review": {"des": "We had a reservation for 9pm on a Saturday night, in the summer. When we first walked in I was instantly disappointed and wanted to walk out. I expected a quiet restaurant with beautiful views of the city with a tasty aged steak. The noise level was so high, we could barely hear each other speak. I had to ask our server to repeat himself many times. I decided to be open minded and stay, even though I much prefer my dining experience (especially a $$+ steakhouse) quiet. We ordered the Lobstercargo and it was delicious! Can't really go wrong with lobster and butter anything. We both ordered the bone-in ribeye medium rare. When the ribeye came the outside was completely black and charred. I tried a few bites and all I could taste was the charcoal-y burned taste. Then I tried a few bites closer to the center, hoping it would get a little better. Nope! I ended up sending the steak back with no desire for a second steak. They took the price of the steak off and gave us a complimentary creme brulee. The service was pretty good. My water was never empty and they were willing to take care of us once I told them I didn't like the steak. However, that charred steak was awful. My husband's was the same, but he decided to keep powering through it. He ate about half and a few drinks and hours later he still tastes the char on his palette. That's completely unacceptable and ridiculous.", "pics": null}}, {"review": {"des": "Just got back from an early dinner. Loved the restaurant.  The aged ribeye melted in our mouth, the Tristan lobster tails were so fresh .  Crab cakes were delicious but the appetizer that stole the show was the Seafood Bouquet.  Pricey but worth it.<br><br>Tiffany, our server, really made me feel special.  Very personable and professional.  She is knowledgeable about the menu and recommended a great Pinot Noir.", "pics": null}}, {"review": {"des": "First and foremost: I believe one of the most important experience from a restaurant is service.  This is just my opinion.  <br>We've been restaurants with horrible service and great service.  That being said I will go back to restaurant with great/good service w mediocre food and try other things or settle with things I'm ok w but I will not go back to a restaurant with bad/ horrible service.  For me bad service makes good food taste bad.  <br><br>Now let's get to the review of Chicago cuts, they service was great! Friendly, welcome and not uptight like some steak restaurant but they were still very professional.  <br><br>The apps were good, the lobster cargot was one of kind and would recommend trying.  <br><br>The neuske bacon (triple cut) was tough and hard to chew through and I couldn't have much of it. <br><br>The cream spinach was fine. If I visit again I would try something else.  <br>But the whipped potatoes were super tasty and flavorful.  Great compliment to the steak and it was good enough to  eat an entire serving just by itself. <br><br>Marinated Cajun rib eye and porterhouse- this is where the disappointment was for us.  Both was chewy and the cuts weren't any good.  Had to spit out parts of at times. They steak had no flavor and had to add salt to it myself. Sad to say  We didn't even finish the steaks.  This place had great reviews so I'm surprised by the lack of flavor and texture our steaks had.  Maybe it was an off day.  It happens.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/osNfvBXaMk5RlkhqIlvECg/348s.jpg", "caption": "Lobstercargot: Maine lobster tail pieces in Gaelic butter w melted havarti & crostini"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5-vDwH4yUlxSrg2HqAj2CQ/168s.jpg", "caption": "Creamed spinach and whipped potatoes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/27l0i-l7qwPTBi_-z0ZamQ/168s.jpg", "caption": "Marinated Cajun rib eye and porterhouse"}]}}]}