{"name": "chicago-architecture-center-chicago", "reviews": [{"review": {"des": "Along with a new name, the CAC (formerly the Chicago Architecture Foundation) moved to a prominent riverfront location.  <br><br>On the first floor you'll learn about visionary architects and city planners who shaped our city and gave it its distinctive skyline; explore five Chicago neighborhoods through an architectural lens, and get a bird's-eye view of Chicago's 234 square miles via a giant color-coded map. The highlight is the 'Chicago City Model Experience', which tells unique stories via video and interactive touch screens. <br><br>The second floor of the museum has scale models (one of which is is 38 feet tall!) of five iconic high-rises around the world. Other smaller models which display famous skyscrapers are also featured (including ones that were proposed but never built), and has a rotating gallery with exhibits that change depending on current and future projects.<br><br>Full disclosure: my firm designed the new-and-improved CAC, and is featured prominently throughout the center, but company pride aside, I still think this is a terrific and educational place to go. I can't even begin to describe what it's like to see these models in person; you really get an unrivaled sense of what these larger-than-life buildings are like in real life that can't be duplicated by photos or videos, which is of course why these models are built.<br><br>This is also a place to purchase tickets to one of their many wonderful tours of and around Chicago. (Being on one of the tours gets you discounted or free admission to the CAC.)<br><br>The gift shop is also noteworthy, and rivals any modern art museum's. You'll find great Chicago-centric gifts and trinkets for architectural junkies, souvenirs, or anyone who's a fan of Chicago or its architecture.<br><br>Definitely a worthwhile place to check out whether you're an architecture enthusiast or a casual admirer.", "pics": null}}, {"review": {"des": "This is it! The place to discover Chicago Architecture, to buy tickets for architectural tours led by erudite volunteers. <br>Fantastic exhibits are available for a few.<br>Souvenirs of every variety are available for purchase in the store. If you want something to remind you of Chicago in a unique way, this is the place to shop!<br>Taking the Chicago Architecture River Cruise has been on my bucket list for over 40 years. Finally today I did it!!!! I was not disappointed. I highly recommend the Architecture River Cruise. Everyone, including Chicago residents, suburbanites and tourists from near and far, should take this tour along the Chicago River. Purchase your tickets at the Chicago Architecture Center at least one hour before the beginning of the cruise.", "pics": null}}, {"review": {"des": "Boo!  They moved to the new location on Wacker Drive and now charge $12.00 just to get in the door.<br><br>Can't even hit the gift shop without paying. <br><br>Seems like a cheap cash grab from a once must see stop on any tour of Chicago. <br><br>I expected better.", "pics": null}}, {"review": {"des": "This is the most fabulous way to encounter Chicago no matter whether for the first time or for the eightith. It made me really proud to be a resident here and I learned enough to make it a regular stop when I introduce people to the city.", "pics": null}}, {"review": {"des": "Bottom Line:  A nice gift, book and souvenir store emphasizing Chicago and architecture. You can book tours here too.<br><br>The Chicago Architecture Foundation may be best known for their river cruises but they also have a nice store on Michigan Avenue and they offer other tours too. The store is very tasteful and you can get momentos of Chicago as well as items that play homage to architecture.  They offer books, lego sets and Frank Lloyd Wright decor among many other quality items.  I enjoyed looking at the Chicago artwork as well as the toys.  You will not find cheesy souvenirs here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aJBiUtWadADEP4WN-48skA/168s.jpg", "caption": "Fun LEGO sets."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IDWvLrMw7fczrtcZATkSbw/168s.jpg", "caption": "The Michigan Avenue storefront is a great place for books, gifts and booking a tour."}]}}, {"review": {"des": "02/28/18 Leap Year Yelp had an open invitation at The Chicago Architectural Foundation (CAF) to address 7 buildings + 1 that are in danger of being replaced.  I think I was the lone Yelp representative at this event. (I know Luai tried, but was told the event was full). <br><br>All of the buildings have some historic significance and to see them removed would be tragic.  I know about progress and the constantly evolving landscape, but a few of the structures are very significant like Union Station (open in 1925) w/it's Great Hall.  Union Stations Great Hall is a magnificent space, it would be trulto see something of such historic significance removed from the urban landscape.  <br><br>The State Illinois Building?  I can't believe they are even considering removing this building, but unfortunately the State with its financial woes have allowed this building fall into serious disrepair.  This building has a very impressive 17 story atrium surrounded by offices around the perimeter.<br><br>I remember this block before The State of Illinois Building was built.  The old Greyhound Bus Station use to be there along with The Double RR where Joel Daley (channel 7 news anchor) & The sundowners use to play country music.  I know this is going to date me, but how many of you remember Fahey Flynn & Joel Daley.<br><br>The Chicago Architectural Foundation is located in The Railway Exchange Building @ 224 S. Michigan Ave.  designed by Daniel Burnham.  Inside there is a model of Chicago <br><br>There is a scale model of Chicago from North Michigan Ave to Soldier Field to the south.  Lake Michigan on the east to west of the Chicago River.  There is also an interactive computer monitor that students were using along with designs of buildings hanging from a rail around the perimeter of the space. M", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Njszr_CFvwgqrHoyRKecTQ/348s.jpg", "caption": "Scale model of the city from Soldier Field on the South to North Michigan Ave on the north to Lake Michigan on the east"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5GkYMJmYRQceCyYQYmdlcA/168s.jpg", "caption": "Presentation on Endangered buildings in Chicago @ CAF"}]}}, {"review": {"des": "This review is for Docent David Smith who is perfect to lead the commentary (as he is a retired Professor and Seasoned Docent) on American Architect Frank Lloyd Wright.  Mr. Smith narrated the journey on the Chicago Architecture Foundation's (CAF's) round trip bus tour to visit the Frank Lloyd Wright Home and Studio and the Unity Temple in Oak Park, Illinois.  <br><br>At the beginning of the journey Mr. Smith pointed out various architectural highlights of Chicago until the bus reached the expressway at which point he provided an historical overview of architect Frank Lloyd Wright-his life and legacy...both personal and professional....I especially enjoyed Mr. Smith's peppering of books about architecture and Frank Lloyd Wright...i.e.<br><br>\"Loving Frank\" by Nancy Horan about Mr. Wright's illicit love affair with Mamah Northwick at the beginning of the 20th Century;<br><br>\"The Women\" by T.C. Boyle -voiced from the perspectives of the four main women in Mr. Wright's Life;<br><br>\"The Seven Lamps of Architecture\" by John Ruskin which examines the influence of nature on architecture;<br><br>and \"The Blocks of Venice\" which was referenced but I could not find....on-line?  Someone throw me a bone aka message...if you know..<br><br>Like a true academic and retired professor he introduced terminology and trademarks which were important in understanding and identifying the unique architectural features exhibited in Mr. Wright's buildings such as:<br><br>1.  \"Light Screens\"=Windows allowing the natural world into the structures<br>2.  Compress and Release...from small narrow spaces which lead to open large spaces<br>3.  The Journey of Discovery\"....the unique entryway to each structure is located on the side of most buildings<br>4.  The influence of Japanese Art (Block Prints-Hokusai) on Mr. Wright's thinking and constructs<br><br>...these are just a few...<br><br>The tour alone on the bus was unique, captivating, and provided inspiring insight by an academic (retired professor) and CAF Docent who really enjoys the subject matter and shares it in a lively way with his audience (us!).  The CAF...is very, very lucky to have Retired Professor David Smith as a Docent- as are all participants who have the opportunity to obtain a ticket for this tour and learn about the architect Frank Lloyd Wright.  <br><br>Thank you for a wonderful experience as my parents were visiting from the East Coast of The United States and had limited time with me...we all agreed it was one of the highlights of the trip that we will always have to share and remember our time together or explore and discuss through your reading recommendations!  <br><br>Mr. Smith is indeed an \"exceptional\" Docent!<br><br>To Read My Reviews and See My Pictures about:<br><br>1.  The Frank Lloyd Wright Home and Studio Tour see:<br><a href=\"https://www.yelp.com/biz/frank-lloyd-wright-home-and-studio-oak-park\">yelp.com/biz/frank-lloyd…</a><br><br>2.  The Unity Temple see:<br><a href=\"https://www.yelp.com/biz/unity-temple-unitarian-universalist-congregation-oak-park\">yelp.com/biz/unity-templ…</a>", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/q-1Souy-lkYuptGKmk3EJQ/348s.jpg", "caption": "\"Light Screens\"or signature Windows here there and EVERYWHERE in Mr. Wright's Studio"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gv2knoxuYRp3vdpdt1b3Gw/168s.jpg", "caption": "Drafting Tables in Mr. Wright's Studio"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EIuERSdet7cFLo9Hq9_vdw/168s.jpg", "caption": "Interior of Mr. Wright's Studio..looking up...at the Cupola...."}]}}, {"review": {"des": "New CAC opened August 31, 2018. Architecture gallery. 4000+ building model of Chicago. Rotating exhibits in design and architecture. Gift shop. Place to buy your architecture boat and walking tour tickets. Two levels. Love the deep dive exhibits into building styles and trends, e.g. bungalows.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pZvGqNibIX1Ks7iw_5Wx5g/348s.jpg", "caption": "Michigan and Wacker Drive, southeast corner"}]}}, {"review": {"des": "While researching architectural boat cruises for our trip to Chicago on Yelp, I ran across the 3D map of Chicago in the lobby of the Chicago Architecture Foundation building.  FREE!<br><br>We have something like this in Boston too, so I was all gung-ho to check this out in another city.  We looked at it from the floor level, as well as from upstairs.  It was fun playing spot the Bean, and to get the lay of the land.<br><br>The gift shop was a fun stop as well.  And the cashier who rang my friend up was real friendly.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jY8VDA9ruSfiavs2PDlM3Q/348s.jpg", "caption": "Chicago Architecture Foundation 9/2017"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ERkuFjyyer9rApihCgDAjw/168s.jpg", "caption": "Chicago Architecture Foundation 9/2017"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Grv0IeKz1gZKjuHTNhy1QA/168s.jpg", "caption": "Chicago Architecture Foundation 9/2017"}]}}, {"review": {"des": "As a native Chicagoan now living in the suburbs, I enjoy visiting \"the city.\" There's always something fun to see and do! Having recently become a member of the Chicago Architecture Foundation, today I took advantage of one of the many walking tours offered. Jeff was our docent and he was terrific. We learned a lot about some of the most iconic and architecturally significant skyscrapers built in Chicago during the 19th century. Looking forward to taking advantage of other tours in the future.", "pics": null}}, {"review": {"des": "April was a terrific docent. Our tour of Chicago skyscrapers was led with enthusiasm and love for Chicago blended with expertise on the story of historic architecture. The headsets made listening easy. It was fun to hug beloved buildings.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ija7m0GgpI-YwjxseyMhdw/348s.jpg", "caption": "One of the many buildings on the tour."}]}}, {"review": {"des": "A wonderful docent led river cruise with incredible history of Chicago's skyscrapers!  Followed the cruise with the architect center which gave interesting comparisons of skyscrapers worldwide!  Completely enjoyable!!", "pics": null}}, {"review": {"des": "This Architecture Center has many tours available including walking, bus, and river boat. I took a bus, and I could enjoy the view of many beautiful buildings from a very close distance. The weather was really warm and sunny, so this place gave me only pleasant memories!", "pics": null}}, {"review": {"des": "Before you start your tour you can check out the model of the city in the lobby area of the building where the CAF is located - quite something! <br><br>We took the tour of the \"L\".  The tour guide was excellent - very knowledgeable.   Not only do you get a lot of information on architecture, you also learn about the L and its history.   My husband and I both enjoyed this tour.   And the price was extremely reasonable!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pwdv0YUNaLjortlyaRyBHg/348s.jpg", "caption": "On the tour"}]}}, {"review": {"des": "Quick, easy, and amazing staff. The gift shop was fun to explore and had a lot of great Chicago memorabilia. If you are stopping to get tickets I'd recommend leaving the kids elsewhere as there can be a line and a lot of stuff in the gift shop is fragile and within reach of little hands. I highly recommend the boat tour, well worth the $47 for the 90 minute ride and history lesson.", "pics": null}}, {"review": {"des": "I have lived in Chicago almost 30 years and continue to find this to be one of the BEST things to do every summer.<br><br>Always learning about something new and the leaders ar amazing!  They know their stuff!<br><br>Thanks you!!", "pics": null}}, {"review": {"des": "A must see when in Chicago.<br><br>This architectural history makes this place worth a few hours. Book a tour online before arriving.<br><br>The kids and family members will thoroughly enjoy spending time at this attraction.", "pics": null}}, {"review": {"des": "So amazing, loved the to-scale model of downtown!<br>Bought a cute knickknack too :-) the volunteer docent was very knowledgable too, she told me all about the worlds fair and gave me travel tips as well. The store has lots of cute presents and useful cooking ware.", "pics": null}}, {"review": {"des": "Exhibit is great but too small for the price.   Entrance fee should be half as much.   The Planetarium charges the same price for a much more extensive experience.", "pics": null}}, {"review": {"des": "One of the best boutique stores I have EVER been to! Gifts for adults, kids, coworkers, families, friends and yourself of course!!!<br><br>Would have easily spent over an hour at this adorable and informative store but was on a tight schedule.<br><br>They had an amazing free Chicago model for view also!!! Must check out!", "pics": null}}, {"review": {"des": "Informative walking tour! My boyfriend and I went on the 90 minute Modern Tour yesterday (Sunday) and we both enjoyed it very much. The tour was very affordable and it was easy to book our tickets online. Our guide was very knowledgeable but also was able to explain the architecture terms in a way that was understandable for novices. You receive a comfortable ear piece so you can hear the tour guide quite clearly. We walked to several different places and our guide pointed out several examples of Modern and Contemporary Modern architecture and public works of art including the Calder and Picasso pieces.   I would recommend signing up if you are an architecture fan! Also make sure to check out the gift shop and 3-D printed model of the city.", "pics": null}}, {"review": {"des": "A terrific organization for the best tours of Chicago.  The river tour is my favorite but there are multiple tours available daily.  We became members several years ago and have taken advantage of many of their tours in all areas of the city....walking and by bus.  Went on the river tour yesterday and able to see many new structures being built and changes on the riverfront since our last tour.  An incredible way to see the city.", "pics": null}}, {"review": {"des": "Chicago is an architectural treasure.  It has many world-class, innovative buildings, but I was clueless about many of them until I became a member of CAF.<br><br>Since joining CAF three years ago, I've turned into an architecture junkie of sorts. I always recommend the famous Chicago river cruise because it's so much fun. It gives an overview of Chicago's history, plus an introduction to many of the buildings you can explore later on other tours. The docents on the river cruise (and on all of the other tours) have a wealth of information to share. <br><br>I've taken over a dozen walking tours, including the Board of Trade, the Rookery, the Monadnock Building, the Cultural Center... and yes, even Trump Tower.  My favorite bus tour is the Devil in the White City, about both the Columbian Exposition of 1893 and the doctor who was a serial killer (read the book first if you get a chance).  Highly recommend the Holiday Lights heated trolley tour, which was a big hit with visiting relatives last Christmas season.<br><br>CAF has a great website with detailed information about all of their tours. There's a fabulous exhibit and gift shop at their tour office on Michigan Avenue. And if you love architecture and design, you won't want to miss Open House Chicago in the fall, which lets you explore 150 buildings across the city... and it's free!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/G0QEeQv8McaZEoEmn7VLQA/348s.jpg", "caption": "Union Station tour (staircase in The Untouchables movie)."}]}}, {"review": {"des": "First off we are from Texas and was looking forward to a real big city tour experience, one that encouraged the entire city as much as possible. So I decided to go on this bus tour which was quoted at 3 1/2 hours long to see all these different types of buildings. \"Chicago Architectural buildings by bus\" was the name, The tickets were like $45 which really for the value of it wasn't that bad. We showed up right at nine when the tour starts however my first impression was not too good I walked up to a rather uninterested gentleman behind the register who asked for my tickets, which never were emailed to me. He kinda gives me a whole well you should have them attitude till I tell him THEY NEVER EMAILD THEM TO ME, in fact if it wasn't for the fact that I screen shot the page like it said I wouldn't have had any proof. Anyhow once we finally got on the bus i got to meet our tour guide, though not exactly the most enthusiastic person he was very knowledgeable and easy to talk to . He was the kind of tour guide who is very on time and by the book. He did the entire tour without any issue, which is impressive as he was the only one who conducted the tour besides the bus driver. He was very understanding of all the people in the tour and gave us a great tour. My favorite part above all was that I got to see Robie house by Frank loyd Wright, which I always wanted to see but was willing to just see by itself however in this case it was fully included. What really caught me about the tour was the value, we ended up being out for almost 4 1/2 hours on a private bus being chauffeured around the entire city. I really give them top props for that and the fact that my tour group was less than 12 made it a quite personal experience. I would absolutely without a doubt suggest this particular tour to anyone.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qHLplObx1IwEKKTcSgl0oA/348s.jpg", "caption": "Took us to a great view picture"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Vv_VCwxaA6hwNtJwuvEPVQ/168s.jpg", "caption": "What a good tour director"}]}}, {"review": {"des": "Finally was able to do the architecture boat tour which has been on my list for a while now. It was freeeezing this morning but the narrator was still extremely energized and friendly and kept your attention during the tour. Includes a great up-close view of the buildings and they give you a lot of info about the architects and architecture changes throughout the city over time. Definitely recommend! It's well worth the money.", "pics": null}}, {"review": {"des": "One of the Jewels of Chicago: many good things stem from this organization:  the best boat tour in the city (really well trained docents), daily tours in many parts of the city, some getting access to places you can't always reach on your own; finally they organize the Open House Chicago which is one of the best events of the year. The main store has a lot of great popular architecture items and art/posters of Chicago, much better than the standard tourist stuff.    I'm an annual member, very worth it when you live in Chicago.  Positive energy and good for the community!", "pics": null}}, {"review": {"des": "Great architecture tour/river cruse on the Chicago River! So many fun facts, our docent did an amazing job! Would highly recommend to friends visiting Chicago. Chairs are very close together on the top deck - you have to side step to get into your seat which is kind of a pain, but once you are seated the 90 minute tour flies by. Tours run $46.00/adult.", "pics": null}}, {"review": {"des": "Choose Wendella tours!  I had folks in from out of town who had never seen Chicago so naturally we have to go on an architectural tour. It was a very convenient location right at Michigan Avenue and Wacker Drive- but other than that???  It was $24 more money than Wendella tours without the side of politics and condescension. <br><br>\"Emily\" was very knowledgeable but should leave out how she seems to \"always forget about THIS building\"( pointing up to the Trump building).  The four possibly ALOT more silent majority that DID vote for our president didn't appreciate the comment and lack of explanation and history of the beautiful design.<br>Stick to what you know Emily, and not alienating your paying guests!", "pics": null}}, {"review": {"des": "We've attended two incredible events held by the Chicago architecture foundation. First one was the Open House in October where we can see the certain areas of specific buildings that aren't normally opened to the public. Second one was the Engineering Fest in March for children ages 5-12 where they learn architecture terms, see what parts make a building, design a building on paper, or construct one with Legos or metal pieces with nuts and bolts. <br><br>We had a blast at both events and am excited to see what else they have in store. <br><br>The building itself is beautiful with its glass ceiling in the lobby, an open atrium where you can see all the floors, the vintage decorated elevators, and pictures of other buildings and the miniature model of downtown Chicago in the lobby.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dI7ZnBmUud3ZXdfsOVDotQ/168s.jpg", "caption": "Learning about how elevators work"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hUtNZ3f_Y7FEBxSfoc70tg/168s.jpg", "caption": "One of the engineers showing the kids one of their heavy tools"}]}}, {"review": {"des": "First Lady Boat Tour lived up to the hype! Great way to see the city and very enjoyable even for a non-architect. Guide was incredibly knowledgeable.", "pics": null}}, {"review": {"des": "I have taken both the Boat and Bus architectural tours.  The Boat was fantastic, 5 stars. For a group of friends coming to visit, I picked the bus tour as they were interested in Frank Lloyd Wright.  Although it was 3 1/2 hours, the tour seemed rushed and it included things that were not that interesting and inconsistent in the level of background and knowledge of the locations. This was probably the docent. Altogether, it was an enjoyable tour.", "pics": null}}, {"review": {"des": "Took the \"Architectural Highlights by Bus\" tour, since the weather outside didn't seem  conducive for a walking tour. The tour had about 18 people on board a large tour bus, so there was plenty of room to sit about and stretch.<br><br>The tour itself was great in terms of area that we covered in downtown and the surrounding areas, places I probably wouldn't have time to see since I did not rent a car. However, the tour guide was pretty dry, and not at all lively. Although she seemed to know what she was talking about, there were countless times were she would pause mid-sentences. and then proclaim \"Sorry, I just lost my train of thought\". There was also a portion of the tour where her access card did not work, and we left having to peer into the building from the outside.<br><br>The tour lasted about 3 hours, and it went through a lot of parts in downtown that I was planning to visit. It was nice to have some background information or facts about the area, so when I revisited them in the days ahead I had some context and was able to enjoy the areas a bit more. <br><br>In all, it's worth it if you want to see Chicago in a short time.", "pics": null}}, {"review": {"des": "Take this tour for a nice introduction to architecture in Chicago. In three-and-one-half hours you will experience Frank Lloyd Wright, universities, skyscrapers, Miles Van der Rohe, and a General sense of what a profound impact that Chicago has had on the world of architecture.<br><br>The tour starts right on time (don't be late out of respect for others). <br><br>You will be on a comfortable bus with about 25-30 others.<br><br>The tour is a rewarding, worthwhile experience.", "pics": null}}, {"review": {"des": "We did a walking tour on Chicago skyscraper history. That mightn't sound particularly interesting but trust us when we say that it really was fantastic. We're not the type of people to generally wander around in a tour group but this was done in a small group, with little earpieces so that we could easily hear the guide, and it was truly insightful and interesting in a way that really impressed us.<br><br>If you're at all on the fence about this, just go! Highly recommended.", "pics": null}}, {"review": {"des": "I have been a member of the Chicago Architecture Foundation for about 18 months now and have found it to be an incredible value. They offer about 100 tours, some building-specific, some of certain neighborhoods or suburbs, and some cemetery tours. Unless they involve transportation, they are almost all free for members. The docents are for the most part engaging, enthusiastic, and very knowledgeable about the city of Chicago.", "pics": null}}, {"review": {"des": "Definitely worth the cost to see all the holiday lights without having to drive through Chicago traffic! On top of that, the docent imparts so much information about the buildings you are seeing. They make a stop on the Museum Campus to view the city lights from across the water - a beautiful sight indeed. Then up Lake Shore Drive to Michigan Avenue to see the beautiful tree and skating at Millennium Park, and up the Mag Mile. We love Chicago at any time, but holiday time is especially beautiful.<br>We sat downstairs because there wasn't room upstairs, but were able to see most everything quite well. We were looking through the actual bus windows which were nice and clear (be sure your driver turns the lights out!) Some people on the upper deck noted that the plexiglass windows they had weren't as clear, although their view of the lights was much better since the \"roof\" was also plexiglass. <br>We would definitely do this again to get in the holiday spirit! I've found that all the tours we've been on through the Architectural Foundation have been very informative and fun.<br>FYI - their S. Michigan Avenue office will be moving to another location along Wacker in the near future.", "pics": null}}, {"review": {"des": "This is for the review of the CAF store and the scale model they have in the building at 224 South Michigan.<br><br>The front of the store currently has some scaffold as the building is under minor renovations however the store sign is clearly visible as they have a temporary sign.<br><br>The store itself has a lot of souvenirs but by the entrance they have a lot of Chicago architecture and wall art which is a lot like what they have at the Tenement Museum in NYC.  Lots of different books, skyscraper things and things like that while the south part of the store has puzzles, Lego, toys and books for the kids.  <br><br>It's a cool store.  I love buildings, architecture and things of this nature.  <br><br>If you take the door at the back of the store you will enter the building's large middle open area where the CAF has a large 3D model of Chicago's skyline.  It was made with 3D printers and costs about 750k to make so far but most of the money has come from donations/foundation etc.  <br><br>I have to say this model is way cool and amazing.  If you're a fan of architecture and this sort of thing you have to see this model as it's just something to see.  I don't know what the scale is exactly but Soldier Field looked to be about a foot long or more.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yfMrK4t9qgBMavjYqR5mSA/348s.jpg", "caption": "Soldier field model"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/csq8YHKfI7Ll98U3T5xREw/168s.jpg", "caption": "Chicago model"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mf1udZPfiikBAND9upDdoQ/168s.jpg", "caption": "neighborhood map art"}]}}, {"review": {"des": "FANTASTIC, AMAZING<br>When you walk into the building their is a huge model of Chicago made from 3D printing and a person is there to give you small tidbits about the city. The tour itself goes around lower Chicago and all tours are given using earphones, with the guide speaking. The guide loads up tons of information about the city so be ready to listen! Tours are about two hours.", "pics": null}}, {"review": {"des": "Chicago Architecture Foundation is a wonderful organization. They run excellent tours throughout Chicago and produce great programming. Open House Chicago is one of the coolest events every year. Please support CAF.", "pics": null}}, {"review": {"des": "My daughter and I went on the art deco tour this afternoon led by Susan Robertson. Outstanding experience and value. She is a first rate guide. She managed the group perfectly and her information and presentation were world class. Plenty of time for questions and photographs. I could write about this for six more paragraphs but stop reading and take your tour soon as possible. She recommended that our future tours be the treasures, the trains, and the boat. She also said it's a good deal to join the foundation for the benefits and perks.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2bbVupjMzzkLgkbbohj-wg/168s.jpg", "caption": "Art Deco gems"}]}}, {"review": {"des": "We went on a tour today and it was amazing the tour guide was very knowledgeable and up beat made the tour fun and interesting we went during the day. We will definitely be going back for an evening tour. 5 stars. Very Happy that we chose this tour.", "pics": null}}, {"review": {"des": "We took the Chicago Masterworks Tour and it was fabulous!  We can not recommend it enough and are already telling everyone we know how great the CAF is and to take a tour if they are in Chicago.  We more than got our money's worth, in fact our ticket price was a bargain.<br><br>When we first arrived to sign in to our tour I thought the ear piece they offered was kind of silly, but once I got outside and started using it I thought it was brilliant!  We were in a small group of 4 and it was SO helpful to hear the tour, so I can imagine in the Summer with larger groups it would be even more important to use.  I also thought about my father who is hard of hearing and how great this would be fore him to use.  <br><br>The walking tour was set at a good pace.  We saw so much and learned a lot.  Our tour guide was EXCELLENT.  She knew so much and was clearly passionate about what she was talking about, plus she seemed like a nice person.<br><br>This tour was definitely the highlight of our trip and we would not hesitate to do another one next time we are in Chicago.", "pics": null}}, {"review": {"des": "Georgia Goldberg, the docent, was full of enthusiasm!  She has done her homework and passed that information on to her passengers on the river cruise.  She chatted with the riders before and after the tour----answering questions.  My wife and I have not experienced a more enjoyable, informative tour---anywhere.", "pics": null}}, {"review": {"des": "My sister recommended their walking tours so we decided to do the \"Chicago Masterworks, Connecting Old and New\" It was easy to book online the day before and it started right here from the gift shop, which I always love to browse.<br><br>We were given headsets so we could listen to our tour guide.  The lady we had was super friendly, informative, and entertaining.  It was a 2-hour tour looking at various types and styles of buildings nearby (both indoor and out).  Walked into churches and inside buildings that we would have never considered going into on our own so I'm glad we did this tour.  We also went into Millennium Park.  <br><br>Since it was a nice warm day outside, it was a perfect day for a walking tour.  Hope to try their other walking tours next time.", "pics": null}}, {"review": {"des": "Excellent tour led by Marcia ..... she was very knowledgeable and really brought the city and its history to life! Thanks Marcia!!", "pics": null}}, {"review": {"des": "Great walking architecture tours. My husband and I stumbled upon this place many years ago, and the Art Deco skyscraper walking tour left an impression on me. <br><br>Our mini vacation in Chicago this time around, we decided to try another walking tour. It's just as good as I had remembered it to be. The docents/tour guides are knowledgeable and friendly, and the two hours fly by. There is a mix of Chicago history coupled with architectural information. <br><br>Next trip we're definitely going to partake in the architecture river tour so we can learn about all of the amazing buildings that line the Chicago River.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VxJquu62rhtpeFg76YzYnw/348s.jpg", "caption": "Chicago Board of Trade building."}]}}, {"review": {"des": "Best tours with a great gift shop!  Be sure to go online and reserve your tours of interest.", "pics": null}}, {"review": {"des": "We had a wonderful tour Must See Chicago.  Our docent was helpful and knowledgeable.  Best value in Chicago!", "pics": null}}, {"review": {"des": "Excellent program of stopping at key intersections and discussing the relationship between landmark buildings from different eras; the references and homages to earlier styles, scale and details expressed in the later projects. Stacy, the docent, did a great job explaining the architectural dialogue.", "pics": null}}, {"review": {"des": "What a sweet surprise! In 90 minutes, a super knowledgeable guide(ours was a high school history teacher) points out buildings and  tells you more info than you can remember..in a good way! It's WAY worth the money! Our guide was funny which was an added bonus! My sons learned a lot about architecture and Chicago history!! You can't pass this up!!", "pics": null}}, {"review": {"des": "We went on the Architecture Tour by Bus trip while in Chicago for a long weekend. This is a great way to see a lot of sites in a few hours, and also pay the same as the shorter boat tour. The tour takes place on a charter bus, but there a few stops along the way (Robie House, IIT, a few skyscrapers downtown) where you get out and walk around.<br><br>The docent we had knew a ton of stuff and was able to give us a lot of in depth info not only on architecture, but the history of Chicago too.<br><br>Even if you're not into architecture, this is a great way to see the city. It was one of our favorite things we did while in Chicago.", "pics": null}}, {"review": {"des": "The Women of Influence tour at Graceland Cemetery is fantastic!  I took the tour on Friday, led by Mary Jo Hoag, and will try to go again when it's offered later this summer and early fall. <br><br>These are the less familiar names than you'll find on the Graceland tour (also fantastic), but the impact that these women had on Chicago still touches our lives today. They came from every corner of society and economic status to influence architecture (even the renowned FL Wright), create our juvenile justice system, foil a presidential assassination plot as the city's (and maybe the country's) first female private detective, affect social justice, aid the Underground Railroad movement, progress the arts and so much more.<br><br>Graceland is one of my favorite places in the city to explore and photograph, and this tour just made it even more fascinating.", "pics": null}}, {"review": {"des": "We took the twilight river cruise last night and I am so sorry I can't remember our tour guide's name because he was incredible...honestly blew us away with his knowledge, and humor...it was so interesting and gorgeous. You see more of Chicago in ninety minutes than you would in hours on another tour. It's pricey but worth every penny!", "pics": null}}, {"review": {"des": "Steep pricing at $44 per person but I very much enjoyed this. You can purchase tickets online or right at the docks for convenience. They have tours all throughout the day, but I'd recommend going before dinner (if possible). It's not too hot but can get chilly depending on the season (we went during fall time) and you can capture a great photo of the skyline as the sunsets.<br><br>The tour guide was extremely knowledgeable and did a great job pointing out all the different towers and had vast information on them all.<br><br>There's a bar downstairs too!", "pics": null}}, {"review": {"des": "I didn't use their service for tours, but I did/do love their store. They have lots and lots of quirky little things. Many different artists and architecture related gifts available in the shop. <br><br>I love the play sets for kids and the jewelry for adults, amid the house ware items, you can find just about anything related to the architects in Chicago.", "pics": null}}, {"review": {"des": "Whether you lived in Chicago your whole life or you're a tourist passing through, if there is anything you need to do while your in Chicago, CAF's First Lady Architectural tours are one for the lists!  The First Lady is a beautiful boat that delivers a 90 minute Chicago river cruise  traveling through the heart of downtown Chicago.  You can't predict the weather here in Chicago but the day we went,  the weather gods were smiling down on us!  The views on this tour are picture perfect and there are tons of spectacular opportunities to get great pictures of the City and its Skyline.  There are two levels, the lower interior deck and the upper deck.  If you're paying nearly $40.00/ticket why would you sit on the bottom deck?  Take advantage of the great seats at the top and enjoy the view :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lioY8evQ6iPh0bpNouok7g/348s.jpg", "caption": "Signage"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Zhp1Ko1Y0ir-jfuFtNvZcw/168s.jpg", "caption": "Cool looking tower :)"}]}}, {"review": {"des": "On the recommendation of everyone I know who lives in Chicago, we went on the boat tour on a Saturday afternoon. Overall, it was a good experience, and I'm glad we went.  It was a bit hot on the open deck, so I would recommend trying to take an evening tour if you're planning to do this during the summer.  The information was fantastic, and was informative without being overwhelming.  <br><br>The only reason I'm not giving this 5 stars is that the (older white male) volunteer who lead the tour was walking through the line before boarding, handing out pamphlets and chatting to people.  We were literally the only people within earshot to whom he was cold and almost hostile; we were also the only mixed-race couple within earshot.  Obviously, this may be a mistaken inference, but it was very strange.  We are (I think) pleasant and polite, and were excited to go on the tour, so it wasn't as though we were giving off the \"don't chat with us\" vibe. He was so rude that I paid close attention to the people near us in line, and that is the only difference I could see.", "pics": null}}, {"review": {"des": "This model city is awesome!!!<br><br>I wish they still had the giant graphs and maps of land parcels and the city grid system.<br><br>They also should add the proposed skyscrapers that will hopefully be added to the skyline (I.e.: wanda vista, river point, south roosevelt, etc.)", "pics": null}}, {"review": {"des": "Joined the El platform tour on 2/24/18. Disappointed. I was really hoping for more architecture and less history. The docent was a history whiz but seemed like an architecture novice.  Fine for a history tour of Chicago, but this is the Architecture Foundation not the Historical foundation.", "pics": null}}, {"review": {"des": "Awesome shop with really fun finds for building geeks of all ages and types of interest. Loved the cooking and cocktail section. Also the model in the foyer is a must see. Such a great way to visualize the city.", "pics": null}}, {"review": {"des": "I highly recommend the Architectural Boat Tour. It's $42 for 90 minutes, and definitely worth it. Although, seemingly a touristy option, it is far from cheesy or cliche. It's a relaxing and informative way to see the city from the water. There's a bar on the boat, and there's not a bad seat or view from the top. <br><br>I loved our tour guide. He was very well-spoken, sweet and funny. You could tell that he was passionate about the architecture and extremely informed. It was extremely evident that the content of the tour was planned, organized and well-thought out. I didn't want it to end.", "pics": null}}, {"review": {"des": "This is quite the foundation. The main thing we have done with them is visit the scale model of downtown Chicago, which model is located on the first floor of the old Santa Fe Building at 224 South Michigan. If you are over at the Art Institute of Chicago...like we were...this extra stop is literally just one block down the road (south) on Michigan. Enter on the ground floor and in the main rotunda of the building is this magnificent model. Well worth the trip to see a detailed model of Chicago...and one that is updated yearly to keep up with changes. We will try more of the offerings of the CAF in the future...but for now, this free exhibit is the best.", "pics": null}}, {"review": {"des": "When I told my friends I was visiting Chicago for the first time I kept hearing how I had to do the Architectural Boat Tour. I strongly encourage that you order tickets well in advance. We arrived in Chicago on a Saturday and the only tickets left during our trip were on our last day there. Tickets cost about $50 for an adult.<br><br>The boat is very open and has a nice bar and multiple tables on the first floor. My wife and I ordered our drinks and went to the top deck which had plenty of seating. The man giving the tour had a vast amount of knowledge and pointed out things on most buildings that I would've never noticed or paid attention to.<br><br>We had a great time and we both felt that we saw a great amount of the city and the different eras in which the buildings were built in. Chicago really is an incredible city with a long, interesting history. The boat tour ran about an hour and a half which was a little longer than I expected but we soaked in so much information during this time. I definitely recommend this to any tourist looking to learn more about the city.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GQuAj6QQ4qwLyV9hF4Y_QQ/168s.jpg", "caption": "View of the Willis Tower about 10 minutes before the Boat Tour ends"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MaiAYI6VV-kxQwpvrLJw1A/168s.jpg", "caption": "View of the Trump Tower as you just start the boat tour"}]}}, {"review": {"des": "The 90-minute river cruise is a great way to learn about Chicago without doing the legwork and provides great views of the city that may be elusive on land. The volunteer docent expertly narrates the engineering and background of all the architecture along the river. Because of the live illustrations accompanying the facts, the cruise was very engaging and interesting than simply visiting a museum of its sort.<br><br>It might get a bit breezy on the river so a light jacket is recommended. Also, remember to bring your sunglasses and plenty of sunscreen!", "pics": null}}, {"review": {"des": "I have taken three other tours with Chicsgo Architecture Foundation.  I have never been disappointed.  I highly recommend taking this or any of their tours.  You always come away with learning so many interesting facts about our wonderful city.", "pics": null}}, {"review": {"des": "I have to rate CAF five stars because of their fantastic cruise tour and walking tours. After living in the city for almost seven years, I joined their membership last month and it's absolutely worth it! A lot of walking tours are free to CAF members and I guarantee you would learn a lot about Chicago's rich history and culture from each tour. <br><br>So far, their volunteer tour guides are outstanding with accurate directions, energetic attitude and thorough introductions. I have attended five tours since I joined the membership and I'm looking forward to signing up more. <br><br>Except for only one thing. I find some of their staff in the CAF tour information counter are not quite attentive, even not friendly at times. And looks like they treat customers who come over to inquire based on their personal interest. I've been working in customer service field for more than five years. I think if they really are not a people person, maybe it's time to move on and find another job. <br><br>Our windy city gets hundreds and thousands tourists from all over the world each year. CAF is definitely a great destination that you don't want to miss while you are here!", "pics": null}}, {"review": {"des": "My husband and I took the architectural boat tour. It was one of the things we were most excited about while visiting Chicago.<br><br>Our guide was wonderful. He was funny and very informative. You could tell he had a real passion for his job and it made our trip even more enjoyable.<br><br>It was a nice touch that there was a bar on board the boat to enjoy some adult beverages while we toured the city. The bartender actually makes a mean Bloody Mary!<br><br>I was a little worried as we were starting our trip because it had begun to rain and the forecast showed it only getting worse. We looked up the refund policy for weather and there are no exchanges or cancellations due to weather. They depart rain or shine. Which is fine because the boat does have an inside with tables but you go on the tour because you want to sit outside and see the sights. I understand they can't control the weather and it is a business so they have to do what they have to do. They did sell ponchos at the bar for $3 which was nice to find!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FleO5PincoIX7i4RKFgoOQ/348s.jpg", "caption": "Rainy day boat tour"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GLCytPH3hbgn-8MalZ1Ugw/168s.jpg", "caption": "Back of the boat"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/f5EvJZhpGtfCf2e9TzyOXw/168s.jpg", "caption": "Top of the boat tour"}]}}, {"review": {"des": "Friends of ours told us to check out this river boat tour, rated by many as the best in the city.   They did not steer us wrong.    The architecture docent who gave the tour, had specifics of pretty much every signature building we passed by.    She provided highlights for 90 straight minutes...she did not take a break....<br><br>She was amazing by providing historical, cultural and historical perspectives on areas and buildings in the area.   From old to new...from designers to architects...from old renovations to new upcoming projects.    Great !!<br><br>The boat has a snack bar, clean bathrooms and plenty of seating.    Check it out...", "pics": null}}, {"review": {"des": "I took 2 walking tours this weekend. One was at the new and marvelous Maggie Daley Park. The second was the Lake shore East area. The tours were very informative. I am a lifelong Chicago resident. I never fail to learn something new on these tours. <br><br>Keep up the good work! I am looking forward to my next tour.", "pics": null}}, {"review": {"des": "[A review for just the CAF gift shop on South Michigan Avenue] The CAF gift shop proves not every design-art-architecture-art gift shop has to be stocked with MoMA and Alessi junk.  This gift shop is wonderful--tons of decorative objects from the Frank Lloyd Wright Foundation, books, jewelry, posters, note cards, inspired household items and an amazing selection of fun and educational gifts for children to inspire creativity.  My new favorite place for client gifts and personal treasures.", "pics": null}}, {"review": {"des": "Our tour earlier today was the third we've done with this group over the past several years and we've enjoyed each one.  The docents are very knowledgable about buildings along the tour and Chicago history.       Today's docent named the architect of almost every building she talked about, including those from other parts of the world, and referenced building in other parts of the world they worked on. How she remembered all of them I have no idea, but it was quite impressive!<br><br>They have a drink/bar/snack area available during the tour which was popular for not only for bottled water but also bloody Mary's. <br><br>At the end of the 90 minute tour the docent went on to recommend other top attractions in Chicago for those visiting. <br><br>We love visiting Chicago and learning about this beautiful city.   I would venture to say we'll go on this tour again over the next few years!", "pics": null}}, {"review": {"des": "I took the 2 hour walking tour of Art Deco skyscrapers and it was very good. The docent was very knowledgeable and the building he showed us were beautiful. The tour price of $20 was very reasonable. I would recommend this tour to anyone coming to visit Chicago.", "pics": null}}, {"review": {"des": "It was difficult to decide which tour to take but we settled on the Historic Neighborhood bus tour. The guide was very knowledgeable and provided wonderful information about the six neighborhoods. He also provided information if one wanted to go back and do more exploring. The bus driver did a great job of maneuvering the traffic, trees, and tunnels. We will definitely be back to do other Architecture tours.", "pics": null}}, {"review": {"des": "This was a great tour and happy we stumbled upon this.  I would have given 5 stars but the tour guide said that we could visit one of hotels so that we could see the pool, 360 view and the big clock but you had to be guests and that was a total waste of our time to walk all the way there to be turned away:(", "pics": null}}, {"review": {"des": "The kids had a blast last weekend when they had free hands on activities like building structures and creative arts. Awesome exposure to budding designers and engineers!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IPX8xolQLNycY1iDRI2YMA/348s.jpg", "caption": "Free workshop for kids @ the Chicago Architecture foundation"}]}}, {"review": {"des": "Once you go down the slippery slope of  5 stars - it get's easier !All kidding aside, this is a must do in Chicago. Luckily  we had a clear sunny day.and a good tour guide - narrator.You're on the river looking up and it's a great way to see Chicago's architectural <a href=\"/redir?url=http%3A%2F%2Ftreasures.New&s=4515e388acabf5dd9741bb135217f102cf4d28d5f07782efbdb4b0d52f0e69d4\" target=\"_blank\" rel=\"nofollow\">treasures.New</a> York may outshine Chicago architecturally but I am inclined to doubt it and anyway you can't see what is in New York in the way that you can see these buildings on this tour.If your wavering ,look for picture.That should hook you.After the fact ,it dawned on me that I 'd really written a review of the CAF boat tour but the building is worth a look.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5U374hGM9nc4NpwjLSMFwg/348s.jpg", "caption": "Front"}]}}, {"review": {"des": "Since everyone loves the official architecture river cruise, I won't repeat what everything else has to say about the Architecture River Cruise. It was wonderful and I'm so thankful I had the chance to do it - I'll just give a few helpful tips. <br><br>-Arrive 40 mins early to queue and check the board to make sure you're at the right dock. <br>-Even though there are seat numbers on your tickets, those are not assigned seats. I guess that may just be they keep track of how many tickets remain. <br>-Layers! It can go from hot to cold depending on where you are (in shade or not), so you'll want to easily get comfy no matter the temp. <br>-Sunscreen or a hat is a good idea if it seems like it may be sunny. <br><br>Our guide did a wonderful job, and he knew so much about each and every building it seemed. He talked really fast to be able to get it all in, and he certainly seemed like he knew a ton more than he had time to talk about! Knowing they are all volunteers is pretty impressive as well. <br><br>The boat was nice, my drink was delicious and just an all around wonderful time!", "pics": null}}, {"review": {"des": "I took the 'Historic Skyscraper' tour and it was just wonderful! Our docent, Bethany, was very well informed and gave us fun facts about the landmarks we covered in addition to the regular information. To me, that is what made the difference. Having a tour guide who is so engaged and genuinely loves what she does.<br><br>About the tour itself, it was very informative and gave me a good glimpse of the history of the city we live in. I work in downtown Chicago, but till I took this tour, I did not realize the history of the various buildings that I see frequently. Chicago has a rich history, and whether you are a local or a tourist, this tour is much recommended if you want to learn more about the origins of this city. Especially the historical skyscrapers, which are marvels of architecture when you consider the period when they were built. <br><br>I sure did learn quite a bit and I will highly recommend this tour to anyone who is interested in learning about Chicago. Kudos to CAF and thank you, Bethany, for making this a pleasure.", "pics": null}}, {"review": {"des": "I heard rave reviews about this tour from other visitors so my honey and I decided to go. We got our tickets through Ticketmaster which was a bit of a challenge. (At least on the mobile phone)<br>The Chicago architectural foundation is a nonprofit organization and has a docent, a volunteer, providing the tour. Our tour guide, Adrianne, was fantastic. Besides being out on the river moving slowly around On a  comfortable river boat, our tour guide provided a wealth of information about the architecture, history and little known facts about Chicago. It was a fully enjoyable experience and one of the best that we've had in a long while.", "pics": null}}, {"review": {"des": "A group of us went on the Art Deco tour Father's day led by docent Bethany Lankin who was a first rate guide.  She also has a degree in art history which added to the outstanding experience. She managed the group perfectly and was able to answer all our questions. She gave ys a wealth of architectural detail about every building we stopped at or went inside. I would definately recommend her for this tour.", "pics": null}}, {"review": {"des": "The Architecture Foundation features a variety of tours, none of which I've taken.  But, I'm enamored of the retail store they run.  In addition to selling tickets for their many tours, they have one of the coolest gift shops around with lots of interesting items focusing on design and architecture, including items inspired by Frank Lloyd Wright.<br><br>Yes, like every gift shop they have t-shirts and coffee mugs, but these are really cool, not cheap tourist trinkets.  There are also interesting books, puzzles, household accessories, toys and clothing, something for everyone.  If you stop in you're sure to find something you can't live without or that really neat gift for someone special.", "pics": null}}, {"review": {"des": "Super informative. Entertaining. Enlightening.<br><br>So happy I took a friend's advice to take the river tour. If you're visiting, I recommend doing this before anything else. Gives you awesome context for the buildings you'll see while walking around and otherwise getting around the city. Our docent was knowledgeable, funny and, as an older gentleman, had great stories about how much Chicago had changed over the years.", "pics": null}}, {"review": {"des": "We took a tour with Barbara, our volunteer docent, on Historic Skyscrapers. Full of information and history about the city and its major architects, we had an incredible time despite the February cold!! Will return for another tour during a warmer season!!!", "pics": null}}, {"review": {"des": "My boyfriend and I were in Chicago for the first time and took the Elevated Architecture tour because the price was a bit easier to swing than the river tours. We had a wonderful time and learned so much! Our guide, who developed the tour himself, has a clear passion for history and his enthusiasm really made the tour outstanding. We got in a good amount of Chicago sightseeing and also learned the surprisingly juicy backstory of the Loop. Now we're just biding our time until a question about Charles Yerkes comes up on Jeopardy or bar trivia.", "pics": null}}, {"review": {"des": "Went on a boat tour with another company (Seadog) and loved it so much I decided to do it again. Was expecting a lot of the same information I learned in the last tour to show up but surprisingly it didn't. Saw many of the same landmarks as before but there was a lot of different information so that was a treat! I'm not sure if that's something the companies plan. I was also super impressed when our guide told us that she was a volunteer! <br><br>We happened to stumble upon the Chicago Architecture Foundation Museum while looking for the Cultural Center. It was pretty neat but unfortunately the Lego area was closed when we went :/ All in all, I had a great time and ended up buying matching Chicago Architecture Foundation T-shirts with my boyfriend!", "pics": null}}, {"review": {"des": "I've been to Chicago a few times and this is certainly my favorite store. I haven't been on any of the tours so I cant speak to the quality of those. I'm one of those tourists who hates the word \"Tourist\". I walk by souvenir shops with a loud \"nope\" in my head. You wont ever find me wearing a chicago sweater, dangling a Las Vegas keychain, or drinking from an I heart New York mug. This place however, did the trick. It's full of interesting gadgets that you never knew you needed but once you see, know you can't live without. I could spend hours roaming this place.<br><br>On my most recent trip, I bought my toddler niece and toy goldfish that magically lights up when you place it in water. Does it have anything to do with Chitown? Absolutely not, but she got so excited that she only had a bite of dinner because she wanted to get back to playing with it. She also sleeps with it at night now. Why wouldn't you prefer a stuffed animal to a rubbery/plastic fish in your crib at night? I'm not sure, but I'm not going to stop her! <br><br>Thanks to the Chicago Architecture Foundation for making me a gift giving winner!", "pics": null}}, {"review": {"des": "Architecture!<br><br>Have you woken back up yet?  Good.  Now look, I would feel the same thing.  Just thinking of writing a review about an architectural tour makes me want to fall asleep and/or seek therapy for overcoming this horrible case of boring I seem to have caught.  But, and I can't believe I am saying this, architecture can be fantastic.  It does depend on how it is delivered though.<br><br>I highly doubt I would have enjoyed this so much had I been walking through the streets of Chicago or even on some double decker tour bus with a guide discussing Chicago architecture.  The Chicago Architectural Foundation, however, uses boats along the Chicago river (they aren't the only one, but I am not reviewing the others now, am I).  I am not much of a boat person - I don't speak boat, I don't know the aft from the stern or the life boat from the iceberg.  I love cruises, but really, even then I can only tell you how to get to the dining room, the buffet, or the pool.  If I had to pull a Ted Striker but on a cruise ship or boat, you'd all be screwed.  All of that said, a boat on the Chicago river is the way to see the city.  How cool is it to be sailing down the Chicago river staring up at these mammoth sky scrapers and also learning about their history and design?  And no, we weren't on a sail boat.  Again, not a boat person.<br><br>So here's how you will spend your 90 minutes.  You will board the boat and find a seat.  You will then go to the bar, because as enjoyable as this trip is, lets face it, it is still architecture and a strong drink or two is probably a good idea.  You will then enjoy 90 minutes of slowly boating along the river and seeing these beautiful structures and learning about them.  I don't recall our tour guide's name, but he had certain mannerisms and ways of speaking that frankly, had my girlfriend and I laughing and enjoying ourselves.  Yes, we were the only ones laughing, but no one else saw how funny it was to hear this tour guide growl out the word \"building\" five hundred times in 90 minutes.  We considered turning it into a drinking game, but we would have been overboard after 15 minutes.<br><br>Some sage advice for you.  Remember that you're touring down a river with very tall buildings on either side, which means that for most of the day, the sun will be behind the buildings.  So if you want some sun warmth, go in the middle of the day.  We went in the early evening in late Spring, so we had some sun, but it was also a bit chilly at times.  <br><br>I realize I may not have dispelled the horror your felt in being told you should learn about architecture, but please trust me on this, this is a great tour.  You're drinking, you're on a boat, and you're seeing these magnificent buildings and learning about a great American city.  Its a really good way to spend 90 minutes of your time.", "pics": null}}, {"review": {"des": "This tour is a must do for any architecture lover! I chose to do the boat tour through the Architecture Foundation, and they did not disappoint. Although the view at the sky deck of the Sear's Tower was breathtaking, I would still say that this tour was one thing I enjoyed the most on our trip as far as arts/museums/tours are concerned.<br><br>There is so much beauty and diversity in the Chicago Skyline, and you learn so much and get to see it up close going up and down the river. They also take you out on the lake so you can take it all in at the end as well.<br><br>I got more than my money's worth on this tour. You will not be disappointed!", "pics": null}}, {"review": {"des": "Due to its tragically opportunistic past, Chicago has gorgeous architecture. And there's no better way to appreciate it than to have volunteer docents tell you oodles of information that you wouldn't have known otherwise. Unless you were buried in tour books or your phone's search engine. But then how will you enjoy the spectacular skylines!?<br><br>$15 for their 1 hour Skyscraper Walk Through Time walking tour. Working headsets provided. $3 discount if you're a student!", "pics": null}}, {"review": {"des": "This is definitely ranked one of the things you must do while you are in Chicago.  Not that it was not interesting, but I found the boat was rather crowded and there are people who speaks too loud that it affect your enjoyment of the tour.  The guide was great, I forgot his name now.  However, I had a French family who were siting next to me who were talking non stop! That is actually not common.  I lived in France for 3 years, most French speaks rather softly in public place, and one of the joke in the restaurant in Paris is whoever is noisy must be American!  <br><br>Setting that aside, the tour was interesting, I got to learn about the Chicago Sky Line, prominent buildings, history of the city.  It is $45 per person, and there will be no refund even if there is a death in the family. (As in my case, I had to change my visit to Chicago).  Luckily I can claim from my credit card company. <br><br>There is a bar on board where you can get drinks - alcoholic or non-alcoholic. <br><br>You can purchase the tickets on line which I would  recommend, otherwise, you can buy it on the pier, but there will be queues.  Or there are pop up stands in the street where you can buy ticket too. <br><br>There is toilet on the boat, but you cannot use it 10 or 15 minutes before the tour finish, so time your toilet break!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Qo5kxHxiciFDabCQitGZag/168s.jpg", "caption": "View of the river."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3IEGcF-zfWxIMqsAwQtuCg/168s.jpg", "caption": "View of  Chicago from the boat."}]}}, {"review": {"des": "This was a great way to get an overview of the Chicago and learn about the history of the buildings and the city. Our guide was very knowledgeable and I learned quite a lot. The view from the river provide perspectives you couldn't get huffing it around on foot. <br><br>They serve beverages (including alcohol) but it is a kid friendly tour. I would definitely recommend dressing in layers if you go during the summer/fall. It was really warm in the sun but got quite breezy/chilly in the shade.<br><br>This was one of the pricier boat tours so do your homework down on the dock to make sure you choose the one to meet your needs.", "pics": null}}, {"review": {"des": "Rome wasn't built in a day and neither was Chicago. The Chicago Architecture Foundation River Cruise really sails through time. The volunteer docents don't waste a breath highlighting the social and economic history behind the construction and location of the building. For architecture and history fans, naturally you'd appreciate this. For others, front row seats to the beauty and diversity of the buildings is worth the purchase especially in the spring when the weather is nice.", "pics": null}}, {"review": {"des": "My parents were in town and we thought we would take this tour that came highly recommended.  This is definitely the tour to go on if you do not have kids!!  <br>This tour company goes out of their way to discourage children on their boats by charging $32 for any child under 3 and any child over 3 is charged as a full-price adult.<br>They say this is because of coast guard regulations stating everyone on board must have a ticket, but that's interesting since it seems that all the other Chicago architecture tours allow children under 3 onto their boats for free and those over 3 are about $15.<br>Clearly they do a very good business enough so that they can discourage children on their tours and I'm sure that is great for those without children, but if you do have children I would highly recommend checking out other Chicago Architecture tours that would provide essentially same product for way less cost.", "pics": null}}, {"review": {"des": "Fantastic tours by well educated docents. Excellent information on architecture of the city and the beautiful building you always walk by. Living in Chicago? Become a member and you get unlimited tours for a year for only $65.", "pics": null}}, {"review": {"des": "These tours definitely seem to be hit or miss. My family took a boat tour a few years ago that was amazing and informative. <br><br>Then a friend and I took a walking tour yesterday in the Loop where the tour guide persisted in running a half block ahead of the entire group (she said, \"Sorry, I walk fast\" -- well, don't race across the street and leave half the group behind! Some of the people were older...Also at one point near the end she said, \"We need to get you some of those Segways,\" which seemed kind of snide). She also kept turning off her microphone (we all had listening devices so we could hear on the street), causing it to blast static into everyone's ear, even after we asked her not to. For $16 it wasn't too bad of a tour, but I felt like I'd learned more from the Geoffery Baer PBS specials about Chicago history. <br><br>To avoid the \"running to keep up\" problem, a bus tour or boat tour would probably be a better idea. The CAF offers a variety of interesting tours on various themes that would be worth checking out, but after yesterday's death march I don't think I'd try one of those again. It's hard to enjoy the information and sights when you're literally dashing through the streets to keep up with your tour guide. :(", "pics": null}}, {"review": {"des": "Boat tour was wonderful, weather was a bit overcast but allowed buildings to be seen without glare. The tour guide was a very knowledgable former architect that also knew a lot about engineering. Perfect amount of time (90 mins) to see all the major buildings of Chicago. <br><br>Would definitely recommend to anyone visiting Chicago that is interested in architecture. The tour gives you a chance to enjoy the view at a nice level (elevated from street view) and then you don't have to worry about walking into people/pedestrian problems.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kD-Mljs67JeJLPaXbvDI8Q/348s.jpg", "caption": "View of Chicago when the boat was trying around by Navy Pier"}]}}, {"review": {"des": "My rating is based on taking 77 tours (so far) encompassing walking, boat, trolley and bus.  The docents do a wonderful jobs and you get a fantastic insight into one of the greatest architectural cities in the world.", "pics": null}}, {"review": {"des": "It is so awesome that I did this lovely tour twice. You will enjoy the relaxing boat tour of the city. You will discover all the magnificent building of Chicago and their history.", "pics": null}}, {"review": {"des": "Enjoyed a nice Sunday Afternoon here with my GF, it was a wonderful day-date activity and we were able to enjoy a wonderful day away from our hometown Rockford, IL. Cincinnati is truly a wonderful city, love a good hot dog on the tour boat, No catsup. ! We wish there were more tours of this kind in Naperville, Rockford or at least Schaumburg so we didn't have to travel so far to go on such a world class tour! Thank you again!", "pics": null}}, {"review": {"des": "Five stars is not enough!<br><br>We came in the winter, so it was a land tour, and our guide was ten-star brilliant and wonderful. Also, the CFA handled our metro ticketing for us, which was another few stars or so. Basically, this is a fifteen- or twenty- star operation, and the tours would be worthwhile at multiples of the price . . . there's a lot to see in Chicago, and to make sure you don't miss EVERYTHING, take CFA up on at least ONE of their tours!<br><br>BTW: They run a GREAT gift shop. This isn't just your snowglobe and postcard shoppe, and take my word for it: it isn't that easy to get Frank Lloyd Wright mementos in your home town, so pick 'em up while you can!", "pics": null}}]}