{"name": "chicago-q-chicago", "reviews": [{"review": {"des": "I'm so glad my friends and I stumbled upon this place for dinner. I'm not really a person who goes out of their way for bbq, but I would come here again and again! Now, that is, when I visit Chicago again. <br><br>All of the meats that we ordered were outstanding. They were really tasty and tender. The service was good. It's a cute little place.<br><br>If you like bbq, you must come try! If you don't like bbq, you must come try! It might just change your mind. :p", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Y0Le82h6pnoWXVmvlO6FQQ/348s.jpg", "caption": "Bar"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zTyU5l5uO9DjlWjOV_Czmw/168s.jpg", "caption": "Front of the restaurant"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/l3UbRwE_Tl7tXW5HPFrhrw/168s.jpg", "caption": "Complimentary pickles and chips"}]}}, {"review": {"des": "This place is really pretty. I was surprised walking in how much it looks like a southern plantation, with the white walls, open space, and large grand staircase. <br><br>I visited for a wedding rehearsal dinner, so we had a large group seated upstairs. There is a coat check when entering, next door to small, one-person restrooms.<br><br>The service was great and the food was delicious. We had an open bar and the bartender was quick and friendly. We had a few courses of food, the best of which I found to be the ribs, which were tender and cooked right. <br><br>I can't speak to the price, and thus the value of this restaurant, but I thought it was a nice, upscale version of a BBQ joint which might be good for a date or other special occasion.", "pics": null}}, {"review": {"des": "If you like BBQ - this is a must try! <br>On 48 hours in Chicago we went to dinner here- all of the food was tasteful and cooked so well! I would come here for the meat any day.<br>The brisket and the chicken- both outstanding.<br>The brisket meatballs are a must try.<br>The sides- mac and cheese, brussel sprouts and corn- seemed basic but still good!<br>The missing star here was the service, the waiter had no personality. The waiter pushed back when we sent a drink back and was unable to give much advice on the menu otions. He came back to the table often but would seem annoyed if we didnt have everything together we wanted.", "pics": null}}, {"review": {"des": "I've been here twice and have not been disappointed yet! The staff is always wondering, the drinks are excellent and the food comes in massive portions. The first time we came here we definitely brought a lot of food home. This time we ordered one appetizer, one entree and an extra side to share.<br>We will definitely be returning here.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DnYGeHG6W0ec9dstX4p9Ew/348s.jpg", "caption": "Flight with a side of mashed potatoes and an extra side of Mac n cheese"}]}}, {"review": {"des": "Stopped in here for brunch and thought it was really good! We shared the Benedict flight - which had 3 Benedicts one with each of chicken, pork, & brisket. It was more than enough food for two people. We also got the cornbread and hash to share. We had enough leftovers to eat them for breakfast the next day. <br><br>They give you chips and pickles to start which were really good. I liked the pickles a lot. I would definitely go here again!", "pics": null}}, {"review": {"des": "I understand my opinion is biased because I'm not a meat eater but their options for vegetarians or vegans is very very limited:<br><br>They bring complementary BBQ potato chips and bread and butter pickles when you sit and the pickles are amazing!! For my dish I ended up ordering potato hash and over medium eggs and it was just okay, but I ordered a side of Mac and cheese and that was yummy, not $8 yummy but it was good.", "pics": null}}, {"review": {"des": "Good food. Good Service. Nice setting/décor.<br><br>This place really seems to have their operation in order.<br><br>1 Star off, almost Two Stars off, because all the ribs could have been warmer in temperature and the Competition Style Baby Back Ribs could have used less seasoning (seemed too sugary or had too much celery seasoning or ?). Also, the Burnt Ends were not burnt at all. They seemed like normal chunks of Brisket.<br><br>For the most part the flavors were really good.<br><br>One Full Slab of Ribs, if you order an appetizer, a salad, and an extra side is definitely good for two people.<br><br>Recommendations:<br><br>- St. Louis Competition Style Ribs<br>- Creole Fried Alligator<br>- Potato Salad<br>- Kale Salad<br><br>The restaurant is returnable for exploring other menu items. The Regular St. Louis Style Ribs seems to be worth a try, it may not be far from the Competition Style Ribs, maybe... Who knows what if they've been giving people the regular ones all along? You never know!<br><br>Nice restaurant to go to in Chicago!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oBqh6odIvy_YyBZv6GKT9g/348s.jpg", "caption": "Potato Salad."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8TL2hgjyxYrDR2DClcFAqQ/168s.jpg", "caption": "Burnt Ends. Really, \"Non-burnt\" ends!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/t8y51MXps1kIdiCjbfoC5g/168s.jpg", "caption": "Completion Style Ribs (St. Louis & Baby Back). Buttered Cornbread. Potato Salad."}]}}, {"review": {"des": "Nice bbq place in gold coast area! <br>Food: what made chicago q stand out from other bbq is their special whole beef rib! For $30 dollar you got a huge full rib just the Flingstones' style. The outside was a little burnt and salty but the meat on the inside towards the bone was really juicy, tender, and has the right amount of flavor!! Def satisfying devouring meat like this! Every entree comes with a side, and we got mashed potatoes which they put underneath the whole beef rib. Loved it. <br>We also ordered the smoked corn and black bean salad. The portion is huge! But i'm not a big fan of the vinegar dressing which made the salad super sweet and sour though. Will try other salad next time!<br>Atmosphere: super spacious dining area with two floors! Bench seats are really comfy. You dont really need to wait for long even without a reservation!<br>Service: servers are friendly and attentive!<br><br>Will be back to try other dishes and brunch!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YrTZR0IUVN1NeyO777oytQ/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nAPz7FTkuMDbQqhcwh5tJA/168s.jpg", "caption": "Baked Smoked Corn and Black Bean Salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CE_FBk7nbDAMTlshLpEdnA/168s.jpg", "caption": "Whole beef rib"}]}}, {"review": {"des": "Ten dollar Uber ride from Streeterville brings you to Chicago Q--a locally popular BBQ restaurant. It is a restaurant and not a \"joint\" as BBQ is not the only thing in the menu. Besides BBQ with the typical dudes you could get a hamburger or fish including the ubiquitous salmon.   <br><br>I don't know what to say about BBQ places that attempt to be everything to everyone. Their sauces include a sweet honey mustard, a sweet Carolina vinegar sauce, a spicy Chili pepper and a mild sweet southern and a spiced sweet sauce. I ordered the competition ribs StLouis style. The ribs were pretty flat and the finishing sauce did give the ribs a shiny pretty appearance but they tasted they tasted the same. <br><br>Complimentary bbq chips and sweet pickles were nice. I wasn't overly impressed by the brisket meat balls but the wings were good. The Mac and Cheese was good but the cheese on the top had a different consistency than the somewhat runny cheese sauce at the bottom  <br><br>If you have room for dessert, the carrot cake is the best deal. The slice we were served was huge and quite representative of a fine piece of carrot cake. Five of us at off off of it and there was still some left. <br><br>Ribs aren't easy to cook. You have to cook them long enough and hot enough to break the collagen down so they are tender. But you can't cook them so long that they dry out and become like jerky either. My slab was pretty tough. There was a nice smoke ring but too much intact collagen made for some chewy ribs.", "pics": null}}, {"review": {"des": "Very nice, cute space and delicious food. We saw this place while driving and we stopped in because it looked so cute from the outside. We were not disappointed. The food is also very very good. We went for brunch and got the Benedict flight and it was amazing. Pork, chicken, and brisket eggs Benedict. The brisket came topped with this fantastic mustard hollandaise sauce. The Mac and cheese, Brussels sprouts, and cocktails were also very good. <br><br>They also start you off with house-made pickles and chips, which was great. I'd highly recommend this place!", "pics": null}}, {"review": {"des": "I came here with a large group of friends for a late Friday night dinner. We booked reservations easily on OpenTable a few hours before. The restaurant is actually super cute inside and not at all what I expected from a BBQ restaurant.<br><br>Once we sat down, we were given complimentary bowls of potato chips with a yummy BBQ seasoning +  pickles. I'm not really a big fan of BBQ, so I went with the Shrimp and Grits, as well as a side order of the Mac n Cheese.<br><br>The Shrimp and Grits were super delicious! The grits were creamy without being too mushy and overcooked. Shrimp were cooked well too and had great flavor. This was actually a decent sized portion. <br><br>Unfortunately, the Mac n Cheese was pretty disappointing. It wasn't cheesy at all so it just tasted like plain pasta with a little bit of cheese on the top. I wouldn't get that again.<br><br>I also ordered the Q Lemonade, which was vodka, lemonade, and fruit puree. It basically tasted like a slightly spiked strawberry lemonade but it was sooo sweet and not strong at all. I was basically drinking strawberry lemonade??<br><br>My other friends ordered the ribs, fried chicken, pulled pork, etc. and all seemed pretty satisfied.<br><br>More like a 3.5 star restaurant for the food, but since they were accommodating for such a large party, I'll give them 4 stars!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zLb6pVRQhDq6-65fgwZvQA/348s.jpg", "caption": "Q Lemonade"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1APxrcI0ruXpqkpaB4jFJQ/168s.jpg", "caption": "Mac n Cheese"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xcsmlofpyvVcWaPQNmtfiA/168s.jpg", "caption": "Menu as of May 2018"}]}}, {"review": {"des": "When we arrived on a Friday at 5:30pm, it wasn't that busy. It started to pick up around 6:30pm-7:00pm though. This is a casual restaurant with a ton of seats and tables and a second floor as well. We were seated in a booth located in the main dining area on the first floor, which was pretty cozy. The restroom on the first floor seemed consistently preoccupied, but you can use the one on the second floor.<br><br>Happy hour is 3:00-6:00pm every Monday through Friday with appetizers and drinks specials. We made it just in time for happy hour! We ordered the following off the dinner and happy hour menu:<br><br>APPETIZER<br>House smoked beef jerky (happy hour) - Not worth the $6 price. It came with about 5-7 strips. I expected the beef jerky to be tough, but the flavor seemed to lack a bit. Due to the long wait of getting our food, we received this for free though!<br><br>ENTRÉE<br>Flight of pulled chicken, pulled pork, and brisket - This entrée came with a square slice of cornbread that was larger than the individual portions of the meats. The meats were pretty tender and succulent. We were offered four different sauces: chili/hot, mild, mustard, and tangy. My favorite was the tangy one. The hot sauce definitely had a kick, so eat at your own risk. The mild had a hint of a yogurt flavor. The mustard was my least favorite and was too overpowering. If I had to pick my favorite meat, it would be the pulled pork. Next favorite is the brisket.<br><br>The meal also came with complimentary BBQ chips and pickles! The BBQ chips were so good and appeared house made. They were very crunchy and seasoned well. If I could eat a whole bag of these chips with no repercussions, I totally would! The pickles had a hint of sweetness.<br><br>The service was excellent on the contrary of some negative Yelp reviews. Our server, James, was extremely personable and attentive! He acknowledged the delay in the food arriving and made up for it without us saying anything by offering beef jerky on the house. He also mentioned that the best time to visit is weekend brunch because they also offer the lunch and 90% of the dinner menu during brunch hours.<br><br>I definitely want to try their brunch next time.<br><br>***Note: You can make a reservation through the Seated app and get $20 Lyft credit with $40 pre-tax and pre-tip spend for two people! The minimum and credit increases with a larger party.", "pics": null}}, {"review": {"des": "Review based on brunch only. Will update if I go back again. I had the biscuits with fried chicken and a Bloody Mary (I had them make it for me rather than doing the Bloody Mary bar).<br><br>The place was pretty big so probably good to go with groups. Also had some outdoor space. <br><br>I like that they bring out the BBQ chips and pickles as an appetizer. Both were high quality and it was a nice snack while waiting to order. Bloody Mary was pretty basic. Next time I would try the bar, but from what I saw it didn't compare to some of my favorites (Bub City for one). I loved the biscuits and fried chicken. I probably shouldn't have ordered it because it was heavy (as to be expected), but that meant I could take the rest home and it held up to re-heating surprisingly well. As did my friend's waffles (threw them in the toaster so they were nice and crispy on the outside).<br><br>Overall, no issues with service and I was happy with the food. I'll go back sometime but it's not at the top of my list.", "pics": null}}, {"review": {"des": "The only reason this gets a 3 is because the food was so so good!! <br><br>Favourite things were the cornbread and pulled chicken. <br><br>Service was a bit of a let down and slow. <br><br>What a pity!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Za9nJLoYg96mqufnY1uq4g/348s.jpg", "caption": "Cucumber smash"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eC4rAoGqByGPyKZnoz8VMg/168s.jpg", "caption": "Q flight"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wvOu66TNqWA0Vk-qFMz1AQ/168s.jpg", "caption": "Fried alligator"}]}}, {"review": {"des": "I came here for Valentine's Day with my boyfriend and we had a great experience. The pickles and homemade potato chips are so good I would love a meal just made out of them! I still think about the pickles and chips and I really want to go back soon! It was a really fun atmosphere and romantic for Valentines Day. I am looking forward to coming back here for another special meal soon.", "pics": null}}, {"review": {"des": "UPDATE (3/17/18): after coming here again (the manager invited me back), I would give this place 4.5 stars. Service was 1000x better than when I came last time. The place was pretty packed and looking around at the other tables, it seemed like everyone was getting good service. I suspect the reason why the service was so bad last time was because of understaffing? The first time I came was on a weekday around 5:30am, so maybe that's just not a hopping time so there aren't as many stuff...just a suspicion. The food was very good-my husband got the baby back ribs which were delicious and worth the $30 for a full rack. I got the sliced brisket which was just okay-I wouldn't recommend it to someone. It was dry and so I didn't think worth the price. The mashed potatoes were AMAZING and you must get them!! I would come back here if my husband was craving ribs! <br><br>Old review: I to give this place 4-5 stars so bad, but the service was SO AWFUL and the sides were meh that I just couldn't do it. Our waiter wasn't very nice and he was either super inattentive or they were way understaffed. I think it's a combination of the two because when we arrived the place was empty and yet it took him 10-15 minutes to see us initially. Then we w sites another 10-15 minutes to get our drinks. The appetizer and food came out at reasonable times. But then we waited 10-15 minutes to get our check. <br><br>The sides were also just mediocre. The cornbread was dry and the Mac and cheese was good but not great. The St. Louis ribs, according to my husband, were really good! <br>The complimentary pickles they give you are AMAZING though.<br><br>Not sure if I'd come back.", "pics": null}}, {"review": {"des": "I enjoyed our Chicago Q, the waitstaff was really on point, friendly, and offered great suggestions.  The food was very good. <br><br>They start you off with bbq chips and sweet pickles, which are both really addicting and bottomless. Our waiter refilled us many times as we waited for the rest of our group. <br><br>The appetizers we ordered were very good, brisket nachos, hush puppies, and dry rub chicken wings.  We could have kept eating this for our meals!  <br>The barbecue is good, I had the 14oz bone in pork chops, which were cooked well and tasted good.  The ribs were flavorful and tender.  Brisket was decent, a bit on the dry side but tasted good.  <br><br>I plan to return to try the rest of the barbecue on the menu.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ptfoPPODoHmFDy-hmLjcbQ/168s.jpg", "caption": "14oz. Bone in pork chop.  Pork chop tasted good with no additional sauces, but the house sauce options were really good."}]}}, {"review": {"des": "An unexpected escape to the South, in the heart of the bustling Gold Coast. Chicago q is a modern, high-end interpretation of a barbecue joint with proper Southern charm.<br><br>Starting the meal off with complimentary house pickles and BBQ chips was a nice touch of Southern hospitality.<br><br>My wife and I opted to split a flight of Prime Brisket, Pulled Pork Shoulder, and Pulled Smoked Chicken. Although each meat came in a small ramekin, adding a couple sides made it a perfect meal for two.<br><br>Both the brisket and pulled pork were perfectly tender, juicy, and bursting with flavor - the chicken was slightly dry, but very edible once slathered in one of their four sauces - including a traditional BBQ sauce, a not-so-hot chili barbecue, a vinegar-based sauce, and a Carolina mustard sauce.<br><br>The sides were very solid as well.. The Mac & Cheese was creamy, melty and baked to perfection. The Baked Beans were well balanced between the sweetness of the brown sugar, and the heartiness of the brisket.<br><br>Although Chicago q may not be the top barbecue spot in the city (Green Street Smoked Meats solidly holds #1 in my book), it is a perfect spot for some solid summer patio barbecue.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/onDAqpfD2KOeTLMawuhF0A/168s.jpg", "caption": "Creamy Mac & Cheese Baked to Perfection"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/G0X3twzfRxCCc9Y7ETv-1Q/168s.jpg", "caption": "A Flight of Pulled Smoked Chicken, Pulled Pork Shoulder, and Prime Brisket w/ a side of Baked Beans"}]}}, {"review": {"des": "Early lunch with a big group. I didn't have anything to do with planning or communication, so I can't comment on scheduling group dining. We were seated in our own room upstairs, and q loaned their projector and screen for a presentation. The location is beautiful, I found parking at the Treasure Island Foods, and service throughout was great. They were able to adjust the music volume in the room for us, which was perfect. <br>The three stars really comes from the food. I don't know if our Thursday lunch hour had anything to do with it, but I was completely unimpressed. The sampler we started with included ribs, sausage, brisket, smoked pork, and smoked chicken. As I ordered a pork/chicken combo platter for lunch, I just tried the brisket and sausage. The sausage had burst at some point so it was dry and the course ground fell out of the casing. It, like everything else, lacked smoke flavor. The brisket was sliced thin and quickly dried up. Good thing they provide 4 different sauces to drown your chopped meat in.<br>My smoked meats lunch underwhelmed in smoke, and although it comes with a side and cornbread, the cornbread never made it out. Just the same, my neighbor shared hers, and I found it was also dry and crumbly. Even the pat of butter couldn't save it. <br>So, lunch was too dry, smokeless, and expensive for me to give 4 stars.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AUh1-VFEbtGrMYOFDC0g5w/348s.jpg", "caption": "Wine and bourbon room"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JhgQUA8a1DHNy5JGfd6Hxw/168s.jpg", "caption": "Upstairs seating"}]}}, {"review": {"des": "This was the most disappointing visit. After being a regular at this restaurant, I was under the impression we would have a great barbecue dinner for our Fourth of July. Wrong. Extremely bad service, a condescending smug manager who did nothing to apologize or remedy the situation, we won't be coming back.<br><br>*thanks for not giving us any barbecue sauce for the pulled pork sandwich, this dry meat and bun was miserable. $40 thrown in the trash.", "pics": null}}, {"review": {"des": "I have to tell you I had a extremely high hopes for this place!! The food was decent but the service fell extremely flat.  I was really jazzed with the fact that they give you chips and pickles! Both were awesome!!<br>We had Mario was kind of our waiter and then Brian took over since Mario needed a break (he told us).  Mario came to the table after I got back from the restroom and said oh every time I come here someone is missing I'll be back... Uh ok? We literally walked in and took turns washing our hands... I wasn't going to let that bug me as I'm sure it is annoying when the party is missing people.  The place was practically empty so I wasn't sure why he was so annoyed with us but the. He told us he wasn't going to be our waiter the whole time. Weird. Anyway before Mario passed us to Brian he let us know that the fried chicken is great and something they are know for but we probably shouldn't order it since it takes sooooo long to cook and that today it was going to take extra long... uh ok... For the record we didn't order it since he scared us into no ordering it and our food still took about 40-50 minutes to come out.  In comes Brian... chomping at the bit to get our orders. I said please don't start with me I'm still not sure. Ok when he comes back to me I gave him a few I'm still not sure and he just stared blankly at me. Usually at that point the server will offer suggestions... Truth me told I wanted that fried chicken :(  so anyway I went with the burger and my sister in law about died lol she turned and said no don't get that and by that time Brian was already gone. Oh well the burger should be a safe bet... wrong!  Why bother asking how I want my burger cooked if it's coming out well done regardless?  The burger was 2 White Castle thick burgers, the slice of onion was thicker.  The fries were good.  My son had a kids meal and they never brought him his cookie.   Brian never smiled or made any attempt to be personable.  I was extremely disappointed with the service.  I'll never know how the chicken was because I won't be back.", "pics": null}}, {"review": {"des": "I came here for Saturday brunch and was slightly underwhelmed by my experience. Seeing that Chicago q had over 1k reviews on Yelp, I was excited to give it a try. Their brunch menu is a little small, I'm sure if I came for dinner, there would be more to chose from. <br><br>Upon seating, we were served with pickles and house made bbq chips to munch on while looking over the menu. Our server readily refilled our chips once we were running low. Our server was also very nice and enthusiastic. I got the pancakes and eggs with bacon. It was average. The pancakes weren't too big and they did not have whipped butter. I got the try the pulled pork benedict and that was very good! It came with seasoned potatoes which I really enjoyed.<br><br>Overall, I wouldnt mind coming back, but I do think there are other brunch  places in Chicago I would rather try.", "pics": null}}, {"review": {"des": "Yes please and thank you!  Chicago q is a great place if you are interested in getting some BBQ in a really large yet homey style restaurant.  Definitely make reservations, this place was hopping, not an empty table on this Saturday night in early December.<br><br>A friend who had been here recently said get the \"Competition Style Ribs\" and since this guy comes from Memphis, I took his word for it.  They certainly did not disappoint.  A huge rack of ribs that you can get in St. Louis style or baby back.  Now, I am a fat italian and I have no problem shoveling down food, but this was a lot of food!  It is definitely an item you can share and I was glad the better half asked that we share it.  In addition to the Ribs, we ordered some appetizers like the Burnt Ends and the Alligator.  The alligator was fine, but not my thing...not saying it was bad just not something I enjoyed (personal taste thing, nothing to do with how it was prepared or cooked).  The burnt ends were absolutely delicious.  I could make a meal out of the burnt ends, plenty of flavor and tasty.  <br><br>While I loved the food, I must say, the bartenders there were absolutely fantastic and made an even better drink.  They really know how to make a great bourbon cocktail.  I stopped counting how many Ol' Fashioned's I had, but I must say, they were spot on.  Everyone in my group loved their cocktails.  High quality bourbon and people who know how to make a drink is a great recipe for success.<br><br>Definitely a place I would come back to over and over again.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8OJk3_zK8yLfcivpwnR9Qg/348s.jpg", "caption": "Burnt Ends...oh yeah, delicious!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/il9V_DXbU0nkD1kR4GVHnQ/168s.jpg", "caption": "Aligator"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wyK5AVGPPvdK3LvvZvyi_g/168s.jpg", "caption": "Competition Style Ribs"}]}}, {"review": {"des": "We had a private Saturday AM brunch upstairs and it was wonderful!<br><br>Down south we wouldn't go to a barbecue restaurant for brunch. Here, it'd be called lunch. Although we do have some great places. All that to say that it was very, very nice for a BBQ restaurant!<br><br>The ambiance in the room we were in was fantastic - surrounded in a wine room with beautiful wood racks and wall to wall glass. It was lovely.<br><br>We started out the morning with a champagne toast and then we had a great brunch with fruit, quesadillas, roasted potatoes, thick stuffed omelette slices and french toast made with challah bread for dessert.<br><br>Although the staff was a bit slow to bring out some of the toppings that went with the dishes, (and it allowed them to get cold), overall we had a great experience. Great spot for a private party!<br><br>I'd love to come back and have a half rack of ribs. Yum!", "pics": null}}, {"review": {"des": "Not sure why all the high reviews, I thought the food was mediocre. Then again, I do have standards being a native Texan.<br><br>First off the positives:<br>-easy to get a table for 2 on a Friday night at 7p<br>-awesome ambience with a rustic southern feel that is contemporary and bright and airy<br>-really great service<br>-liked the hushpuppies and sausage<br><br>The meh:<br>-tried the alligator tail because it was unique. If you've never had it, go ahead. It didn't blow our minds though. Texture is more like chewy chicken.<br>-drinks lacked a complex flavor profile and a bit watered down<br><br>The bad:<br>-bbq itself (got the mixed platter) with pulled pork, brisket, sausage, etc. was very dry. Very necessary to put sauce on it<br>-Mac and cheese bland <br><br>It's a great location in Gold Coast but unfortunately does not pass for a good bbq joint. I'd check out smoque instead up north.", "pics": null}}, {"review": {"des": "This review speaks more to the management and service at Chicago q. The food, as always, was good during this experience. <br><br>But TL; DR: I would never, ever recommend booking an event here.<br><br>My fiance and I booked our September rehearsal dinner with Chicago q in January, and were told that our event manager would follow up with us a month before the event to finalize everything. Cut to two weeks out, and we'd heard nothing. I had to go through three different people to find someone who could help, and should have realized the red flags at this point.<br><br>Cut to the night of the event. We arrived at the restaurant, and 5 minutes after the dinner was set to start were informed that the air conditioning in our private space was nonfunctioning. My finance and I told the manager that we were OK with eating downstairs, but we also made it clear that we wanted to move upstairs as early as possible so that we could hold speeches in a quiet space (the point of booking a private room). <br><br>After dinner, I went upstairs to the bathroom and found that other parties were seated in the private space--no updates had been communicated to us, and no effort had been made to move us upstairs. I had to send my maid of honor to hunt down the manager multiple times to get us moved upstairs--it was clear that he wasn't doing anything until then. We were moved before the room was set, and then drinks and dessert were handed around noisily while parents were giving speeches. <br><br>Communication wires get crossed sometimes, but it felt more like the manager was trying to avoid us than accommodate us, and I spent the entire evening anxious. When we got into the car to go to meet our larger group at welcome drinks, I told my husband, \"Thank god that's over.\" <br><br>I emailed our event manager a week ago to explain these details, and have yet to get a response. And I'm not one to write Yelp reviews, but I want to make sure others avoid this experience. The communication and customer service at Chicago q just isn't up to par.", "pics": null}}, {"review": {"des": "First time here, won't be the last. Everything was excellent. My wife had the fish special and loved it. I had the smallest of the combos and couldn't even finish it. Our waiter, Mario, was the best. He gave us some very good guidance on the menu items. Great atmosphere, wonderful blues music on the sound system.", "pics": null}}, {"review": {"des": "Great experience especially when Mario and Mel serve us. They were cheery and generous.<br>Food is rich and delicious.<br>I've chosen prime and egg bendicte + q burger. <br>My two dishes were mouthwatering<br><br>Will come back again.", "pics": null}}, {"review": {"des": "Food alone would have gotten a 5 star. In the heat of the moment I initially gave this place a 2, but that would be doing the city of Chicago a huge disfavor in deterring away from outstanding food. So why a 4? Because for a restaurant, there were some major issues with our experience. The staff seated part of our table before we got there (15 mins late due to car troubles), which caused the reservation on their screen to go away. We showed them the online booking confirmation and they just brushed us off and told us they didn't work with open table anymore, which wasn't true because the reso did book, and eventually we realized the other members of our group were at the table. We could have done without the attitude, we just wanted help working through the issue.<br><br>The wait staff, although nice, was all over the place. We got asked to place our orders several times after already placing with the previous waiter. Then they had us wait 30 mins for dessert, arguably the easiest part of the meal to serve because it's prepped in the back. You'd have thought they were baking the carrot cake fresh for how long it took. <br><br>Btw the carrot cake was to die for. Buttery cream cheese frosting and the cake was so fluffy. But onto the food. We ordered the platter; sausage, pulled chicken, pork and smoky brisket. The ribs fell off the bone. They serve the (dipping?) sauces on the side so you can choose to switch it up. They serve home made seasoned chips and sliced pickles which go so well with the food. We ordered corn bread on the side, and it was a crumbly, buttery deliciousness we couldn't get enough of. Absolutely delicious.<br><br>Now for the worst part, and any restaurant goer would agree on this. We got home only to discover that what we expected were our glorious smoky delicious meaty leftovers were replaced with soggy fish, a half eaten burger and fries. Gross! If you're going to pack peoples leftovers for them, get the table right! The result was pure disappointment. One lesson learned- always check before you leave.   Reading the rest of the reviews, it seems that this restaurant could use some serious management revamping. Such a shame because the food is really good, that is, if you get the food you ordered.", "pics": null}}, {"review": {"des": "We are from out of town, but have been to Chicago before. Came here on the recommendation of others. The service was timely. The food was good. It has a fun atmosphere!  We will definitely be back!", "pics": null}}, {"review": {"des": "Came here for a weekend brunch. This place has a beautiful interior! It's so spacious inside and the furniture seemed extremely well taken care of. I felt like there was somewhat of an old-timey Western-ey feeling to the establishment - kind of like how I feel when I think of the saloons of the Wild West that I've only read about and seen on TV. I'm not sure exactly why I feel this way however... It's definitely much cleaner and more inviting!<br><br>Prime Brisket & Eggs Benedict - The eggs and hollandaise were AMAZING on this. SO flavorful and so wonderfully poached. However, the potatoes were not so great and were actually rather flavorless and bland - like so bland it really seemed as if they hadn't been seasoned at all. The brisket was ok - somewhat dry and a little too chewy, lacking that desirable tenderness. There wasn't a good amount of it either. The eggs were really awesome, but since this dish was mostly potatoes by mass, most of it was just extremely flavorless.<br><br>Art Smith's Fried Chicken & Waffle - The waiter serving us recommended this to my friend as new popular dish they were serving. The chicken was extremely juicy, but was somehow also lacking in flavor. Again it seems as if they tend to go especially light on the seasoning here. My friend asked for some hot sauce to go along with his dish and it was actually really good - I'd recommend asking for it as you will definitely need some sauce to go along with all this flavorless food.<br><br>My friend and I also got mimosas. A lot of the other guests in the restaurant were enjoying some crazy and garish appearing (in a good way) Bloody Mary's, and in retrospect I think that would have been more fun than the mimosas. They also looked pretty tasty. The mimosas were alright and I believe the Champagne was Korbel Brut. I guess I expected something a tad more premium at this establishment, but I guess I can't complain - it wasn't bad.<br><br>Overall, I was pretty disappointed with my experience here. The setting was very nice and the staff was amazingly helpful, but the food honestly just sucked. Most of the items on both my friend's and my dishes were just almost completely flavorless and devoid of and seasoning whatsoever. I understand that this is a BBQ place however, and perhaps their more classic BBQ dishes are much better. Also, I am unfamiliar with Art Smith, but after doing a brief Wikipedia read up on him, I really can't imagine that such a seemingly renowned chef would put forth such bland food. I can't really recommend coming here for brunch if you want some delicious food. But if you're looking for a crazy bloody Mary bar and a great setting to enjoy the weekend, maybe this place is for you!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EDCJR41hKtxPHs88j9TWAg/348s.jpg", "caption": "Prime brisket eggs Benedict - super good eggs and hollandaise. Not good potatoes, very bland. Brisket was whatevers."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1I9FqstANBDUsClu4OmDuw/168s.jpg", "caption": "Free chips! Pretty good."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ckqQPT78VTk5opv0wCQUFg/168s.jpg", "caption": "Art Smith's Chicken and Waffles - super juicy chicken but equally as super bland. Bad. Don't get it."}]}}, {"review": {"des": "The decor is great and service was decent. The meatball appetizers where good the grits with it where bland. I got the 16 oz. Prime rib and twice baked potato with Brussels sprouts. The meat was very tender but lacked seasoning, the potatoes  had more cheese than potato and the Brussels sprouts where bitter. So I will  just say maybe I picked the wrong food after all it is Bar b que. Would give another try.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xx9KqW4afw_vlQ3M_bWKBg/348s.jpg", "caption": "Prime rib twice baked potato, Brussels sprouts. Let's  eat."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/49A3RDWQ8-SnIJnkOJUgag/168s.jpg", "caption": "Nice atmosphere"}]}}, {"review": {"des": "Unfortunately we went here on a weekday during happy hour and the food was quite bad. Drink special was great, got the lavender gin and tonic. Complimentary chips and pickles was a nice gesture. But 36 bucks for super dry ribs is not worth it. The flavor was not good and it had a cardboard texture. We got a side of corn bread and it was hard as a rock. Only reason why I give this more than one star is because the drinks were good. So shocked why this has over 1000 reviewsanwd rated four stars. Definitely go here just for drinks, save room for food elsewhere.", "pics": null}}, {"review": {"des": "What's not to love about Q! This is my go-to spot for brunch or dinner. The environment is adorable... upscale country chic complete with pop to traditional country music from time to time. Chris the bartender is one of my favorites in the city! The sweet pickles and homemade bbq chips are a great starter. The bourbon collection is quite extensive, but my favorite sweet drink is the q lemonade. If you happen to find yourself at Q for brunch, I strongly suggest checking out the full Bloody Mary bar and the Benedict Flight if you have a heart appetite!", "pics": null}}, {"review": {"des": "Looks great from the outside as it oozes a southern vibe. The inside is well spaced and lots of room.<br><br>This review would be a 4 if the service matched the food.<br><br>The service was abysmal compared to the Orlando Homecoming location for example. We ordered drinks from 2 different wait staff and still waited 15 minutes.  The dining room wasn't even running at full throttle.  Sadly the guy serving us  wasn't really interested in our table<br><br>Now let's focus on the Manager who walked past several times noticed we had empty glasses and not once asked if we were ok. He is equally bas culpable in this crime against basic hospitality.<br><br>The food of was the only saving grace and sadly beers are bottle or can only.<br><br>I doubt I will seek another Art Smith's out again.", "pics": null}}, {"review": {"des": "My boyfriend made reservations here via Yelp for our Valentine's Day dinner (what. a. GEM. -- both him, and this place). I gotta say, what a fantastic choice.<br><br>Our reservations were for 7:45, but we showed up a bit early, so we were directed toward the bar to wait. This was, of course, 100% fine with us, both because we were early, and neither of us have a problem with waiting a few extra minutes. It *is* one of the busiest restaurant nights of the year, after all.<br><br>I tried to order a cabernet sauvignon, but the bartender apologetically explained that they were out, so I ordered a rosé. I guess red wine is a popular Valentine's Day drink! My boyfriend got a glass of Bulleit bourbon. We were sitting there for maaaaaaybe 10 minutes before we were seated, and they just brought our check to us from the bar to our table. Love that convenience, Chicago Q!<br><br>They had a Valentine's Day specials menu, but we stuck to the original menu: fried green tomatoes for appetizers (plus the pickles and chips they gave us with our glasses of water), he had a stuffed poblano pepper, and I ordered a steak quesadilla. I *do* think that the quesadilla was so incredible, but $17 is pretty steep for a quesadilla, folks! It makes a girl feel a lil' guilty when her boyfriend is treating her to a nice Valentine's Day dinner! <br><br>That being said, all of the food was divine, the service was fantastic, the bathrooms were gorgeous, and the inside of the whole place was gorgeous and had a romantic Valentine's Day feel. I'd recommend this place for Valentine's Day or any other romantic evening, or even with your friends or family!", "pics": null}}, {"review": {"des": "My family and I have been coming out to Chicago Q since they opened up a few years ago. They have  awesome and mouth watering comfort food. In addition to high quality food, their customer service is excellent. Their staff truly takes care of each and every guest as you'd want to be treated.<br>We also like to thank Ben who is a manager at Chicago Q who personally delivered an item to our home, which was missing from our order through Caviar. Thank you for going above and beyond. We highly recommend Chicago Q.", "pics": null}}, {"review": {"des": "So this year's Chicago Restaurant Week adventure, took me to Chicago Q! I have been here several times, but this year I took family with me! They were visiting from out of town. We were able to get a great reservation rather quickly at the last minute through open table. They even had a high chair for the baby. First let me say, that my family had several dietary restrictions and this place was STILL a hit! Love love love it. <br><br>I ordered off of the chicago restaurant week menu. I went with  the ribs, with a side of fries (sharing with the baby) and I got these amazing appetizers. I can't remember the names ,but, they were balls of goodness. You can't forget the amazing pickles that come with the table! Yum. Even my 10 month old loved them! Oh and a side of that amazing cornbread! <br><br>So, we turned the food here into a smorgasbord of sorts ,because, it was sooo much food. One cousin got the chicken with Mac n cheese, another got the sliders with mash potatoes , my uncle got a different chicken with<br>Brussels sprouts, and my other cousin opted for dessert! (Yes, she only wanted dessert ). Then, she saw our food and changed her mind. Lucky for her, we were sharing. Let me say this, EVERYTHING WAS SPECTACULAR ! My family really knows bbq & I was nervous to take them there but chicago Q, did not disappoint!<br><br>So, being that I'm a new mom I'm always on the lookout for family friendly restaurants. You can't be a foodie without teaching your kid the way of the land.  I'm happy to say, that they have a changing table in the restroom! <br>You may get 5 stars for that alone.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/myeX-WejmYy0D7nJ7CDVBA/348s.jpg", "caption": "That cake was more than any of us were expecting. Good thing we helped her out."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SmH_r3tbFr86ZT-XdxQoag/168s.jpg", "caption": "Smorgasbord!"}]}}, {"review": {"des": "Overall: Overhyped, overpriced, Chicago Q still puts some good ribs on a plate.<br><br>The good: Most of the food was good and the menu is pretty large to choose from. The competition ribs were very tender and easily fell off the bone. Plates come in individual size or are also big enough to share along with some sides. Great atmosphere (minus the boxed TVs in the wine room)<br><br>The not-so-good: The price. I felt that we could've gotten just as good (or better) BBQ for half the price at a local joint. Full rack of ribs for $34? Side (block) of cornbread for $7? Mini skillet mac for $8? Pretty absurd. The servers were friendly and the wait staff was efficient, but he got our order wrong and overcharged a bourbon and we had a random drink on our bill. We had a large party, but we were also one of 4 tables in the restaurant at the time.<br><br>Atmosphere: 8/10<br>Service: 7/10<br>Food: 7/10", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wGI6lrre9MC4nxfaKU74cg/348s.jpg", "caption": "Cornbread side"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fajUCIB83BShOrL8z1oV6g/168s.jpg", "caption": "Potato salad and coleslaw with a side of Mac in the back"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UCJeLimY789aM7Ca45AHnA/168s.jpg", "caption": "Competition ribs"}]}}, {"review": {"des": "When I decide on reviews, I always decide based on a combination of service, food, and price. This is one of the cases where the food was good, but not equivalent to how much the BBQ costs. <br><br>Also important to note that this is not a typical BBQ joint ambience as it is more towards the fancy restaurant side. Service was good but not enough to bump up a star in my opinion.", "pics": null}}, {"review": {"des": "Is a very good bbq restaurant, the flavors on the ribs and sausage are great, actually you don't need to add any sauce at all!", "pics": null}}, {"review": {"des": "Ambiance: The only restaurant with no line or waiting labor day . Nothing <br><br>Food: Chicago's needs a Luciles BBQ. Food took forever to come out and didn't seem fresh. I ordered the alligator and mac and cheese and it was not tasteful. The rest of my group ordered ribs. Today we all have stomach issues<br>The carrot cake was large with a great presentation and tasty<br><br>Price: Goes with the area", "pics": null}}, {"review": {"des": "Solid smokehouse. BBQ chips served while waiting for food are delicious.  We got the burnt ends appetizer- hubby said was solid.  Then we shared the flight- there was more than enough food to share.  Meats were great.  Baked beans nothing special.  Cole slaw average- not bad.  Brussels sprouts were amazing- I could eat my weight in those!  BBQ sauces were good, but nothing special.  Overall a solid meal.  Decent price.", "pics": null}}, {"review": {"des": "This is one of the tougher reviews to write, as I've had good experiences in the past, but as of late, the interactions have differed. <br><br>I've been here ~five times over the past few years. I've always felt the BBQ was good, not great. And, after tonight, I still believe that. However, billed as a full-service restaurant, it falls WAY short. Here's why:<br><br>My wife and I arrived on a Saturday evening during prime dinner hours expecting to not get seated right away, as we didn't have reservations. The host stand was chaotic. They were arguing with each other, ignoring guests, etc. Once we told them that we would like a table for two, they actually got us sat very quick, even before other couples waiting in the lobby (odd). <br><br>Our table was in the middle of the dining room on the first floor. It was loud, busy, and crazy. We were actually directly under one of the music speakers, which obviously made it worse. Not their fault, but still, kind of detracts when you're getting pounded in the eardrum. <br><br>The only saving grace was our server. She was extremely friendly and always checked on us. Kudos to her!<br><br>Now, the oddest part was the service vibe. EVERYONE seemed stressed. From the host, food runners, servers, etc., everyone was stressed. I worked in the industry for a long time and you pick up on that. The manager was barking orders (embarrassing) and sweating. We literally observed from afar (or maybe close up) the wreck of a dining room. It was simply not enjoyable and felt more like a frantic cafeteria with service. <br><br>Food is average to good. We ordered the platter (exact name is escaping me) and a couple sides. The pulled pork was good, the pulled chicken was meh, ribs were very meh, sausage was good, and brisket was good/meh. Beans were great albeit very sweet and the mac and cheese was awesome! Two Boulevard's were on special for $5 a bottle (great deal!!) Sauces were top, though. They make hella good sauces. <br><br>\"Better watch your wallet\". That's what a random employee (I believe a busser or server...not sure) said in the middle of our service tonight. I had my wallet next to my setting tonight (for showing my ID) and left it there, much like we all do with our phones, etc. He literally interrupted us to say that I should watch my wallet. This isn't that kind of place where my wallet will get snatched in plain sight, but alas, I've been warned. After an already odd night at this place, he topped it off!<br><br>Tonight was a VERY odd night at Q. Unfortunately, I think that's the norm there. I've always maintained that their food is decent but there's better BBQ in Chicago (hello, Smoque!) We tried ordering catering from them in December for our company party but they failed on that too. I think they are just in an odd spot now management-wise.<br><br>In summation: once a good spot with decent Q has really gone down the hole. Would I eat here again? Maybe if someone was taking me (or preferably taking out!). But the Q is just average and the experience realy sucks. Skip it.", "pics": null}}, {"review": {"des": "Chicago q has some delicious barbecue! They are very busy, so make sure to make a reservation or plan to wait for awhile! Great atmosphere for family or catching up with an old friend! Once you sit down you are immediately greeted with a large bowl of housemade chips and pickles which are delicious. My problem is I always eat way too many of them and then am not able to finish my entree! I typically order the BBQ pulled pork, which is very good. It had a nice smoky flavor to it and is not overly dry. The barbecue sauce that it is served with is delicious.", "pics": null}}, {"review": {"des": "I hadn't been to Chicago q in years but a friend had her birthday dinner there so I got to experience it again. There were 11 of us, and service for larger parties is often difficult but overall I had a great time and the food was better than I remembered. <br><br>Complimentary chips and pickles are brought for you to munch on as your food is being prepped. I don't even like pickles but the flavors worked really well together. A friend had \"thyme is of the essence\" cocktail and said it was delicious. <br><br>A few of us shared the bacon cheddar hush puppies and they were good.  We also shared the mac and cheese, and again, it was good. My entree was the pulled brisket sandwich with cornbread: the brisket was well seasoned and reasonably tender. The sandwich was the best savory item I ate. So far we were hovering around a three star review. <br><br>But then the desserts! We ordered a slice of chocolate cake and the restaurant  brought my friend cookies for her birthday. The cookies were wonderful.  They were soft and warm and just sweet enough. Their cake slices are enormous,  big enough for three at least, and also very very good.<br><br>Q is pricey for bbq but you do get what you pay for, and the ambiance is great. For example, they have lotion in the bathroom. Little things like that take a restaurant to the next level in my book.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Qdq31LGzCrYpjsjds4mRoA/348s.jpg", "caption": "Q2 smoked meats"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2YkhuarRKuTO-dF6NHMskA/168s.jpg", "caption": "Chocolate cake with cookies and milk in the background"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/S27c8HVChNBG2AeqBQZ86w/168s.jpg", "caption": "Mac and cheese"}]}}, {"review": {"des": "My boyfriend and I were staying in the neighborhood and came here for brunch, and it ended up being one of the best brunches we've ever had. <br><br>First off, the meal starts with homemade pickles and homemade BBQ chips. Those alone sold me. <br><br>Then, I ordered the smoked chicken Benedict. It's two poached eggs over a hash of potatoes, smoked chicken, and cornbread pieces, in a slightly sweet hollandaise sauce. I seriously could have licked the plate clean it was so good. <br><br>The space was also very cute, and the service was fast and friendly. If you're in the area, stop by for some delicious southern eats!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xE6HZ_oxExNGhtmZQR2ckA/348s.jpg", "caption": "Smoked chicken Benedict"}]}}, {"review": {"des": "I visited Chicago Q around 2pm for lunch and sat at the bar, i think i was the only patron in the entire restaurant at the time. No complaints about the service, the bartender seemed to be working on lunch to dinner transition duties but checked in on me enough times it wasn't a concern.<br><br>Pre-meal: The potato chips are house made and absolutely amazing. Perfectly fresh, crispy, salty and seasoned. They could easily sell bags and bags of them. The pickles were equally amazing, half-sour(?) with peppercorns and a hint of red pepper flakes. Again, fresh and crunchy, not too briny, and a great post meal palate cleanser.<br><br>Meat: Brisket is the most difficult meat to smoke, and thusly my metric for quality BBQ. The brisket at Q was just on the dry (wrong) side of perfectly cooked. The bark was nice but not a lot of the flavor infused the meat. The baby back ribs were great: fall-off-the-bone, moist, flavorful. Pulled pork is one of the easiest meats to smoke, if you find a place with awful pulled pork, never go back! No complaints about the pulled pork at Q: tender, moist, well flavored.<br><br>Sauces: Sauces are a condiment, well smoked meat shouldn't need a sauce. The brisket needed a sauce... They gave me the mild and the spicy/hot sauce. The spicy/hot had too much cayenne to do anything but bring heat, no flavor. The mild was too sugary to be a decent mild, but the brisket needed something so it served a purpose. Had i known they had a mustard sauce i would have liked to try that.<br><br>Side(s): I had the baked beans, they were pretty good. Good thickness and flavor to the soupy part and a few chunks of meat in their, too. I don't pay much attention to cornbread, but their cornbread was fine. Could be a little sweeter, perhaps.<br><br>Overall, i'd try Q again, probably for dinner. Maybe they save the moist brisket for dinnertime.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0bKBrr8370_BqNvCTrAdGA/348s.jpg", "caption": "Mild and hot sauce."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/00x46GOLVsJXbnTHATPbaA/168s.jpg", "caption": "From left: cornbread, slaw, tall glass of water, babyback ribs, pulled pork, brisket, baked beans."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PS7M2H02rppQT7oUwZCwHw/168s.jpg", "caption": "Housemade chips and pickles. Excellent."}]}}, {"review": {"des": "I had been wanting to try this place out for a while and boy was I disappointed. Meat was just OK but the sauces tasted like different flavors of puke. Everything else was very fast food, yet stupidly over priced. To make things worse I got pretty sick afterwards. You could do better going just about anywhere else in Chicago, this one is clearly for people that have never had real BBQ in their life.<br>T E R R I B L E.", "pics": null}}, {"review": {"des": "Good BBQ is hard to find when you leave the south.  Good BBQ sides are even harder to find in the North.  This place checks all the BBQ boxes: comfortable atmosphere, excellent service, amazing apps, huge meal portions (even at lunch) and hot BBQ sauce that is actually, go figure, hot!  I wanted to add a picture of our entrees, but we got a bit to excited when they arrived.  We didn't have room for dessert - but they looked amazing.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zXabpo92lnShcT8-39QfWQ/168s.jpg", "caption": "Brisket Meatballs on grits and bacon-cornbread hush puppies!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5E2IaHDTtzD5qLPabcU7yg/168s.jpg", "caption": "Arrives when you sit down.  Pickles and chips."}]}}, {"review": {"des": "i loveeeeee me a pulled pork sandwich. honestly. being a texas boy, it's hard to please me with bbq or the fixin's. Chicago Q does it's best to keep it authentic, keep it homey, and keep it tasty. everything is definitely tasty here! the prize of the night was 100% the corn bread. I could eat it for every meal. so good. the pulled pork sandwich was good! the selection of sauces they have is fantastic. the mac and cheese was really a let down for me. love me some mac and cheese, but this was a tad dry for me. service was a 4/10. our server was hardly around, didn't check in on us much, and seemed a bit overwhelmed by other tables in the restaurant. <br>long story short: i'd come back for the corn bread, but not for the drinks or the service.", "pics": null}}, {"review": {"des": "A little trip to South Carolina right here on Dearborn.  Very accommodating. Charming staff. Elegant but relaxed decor.  The brisquit with burnt end, pulled chicken and pulled pork with a trio of housemade bbq sauces is my go to choice.  Best bbq in town.  The bbq chips and pickle slices on the side are also house made.   Laid back blues in the background lend just the right note.", "pics": null}}, {"review": {"des": "This restaurant is very pretty inside. The atmosphere is fun. <br><br>Our family ordered several dishes - some were really good - others so so. <br><br>First of all the home made potato chips at the start of the meal were delicious.  <br>Beef brisket. - very good. Tasty and tender<br>Baby back ribs - very dry. Would not get again<br>Burnt ends beef tips - dry. Would not get again<br>Pulled pork - excellent. Would get again <br>Sides : we didn't need to get coleslaw - it was ok. Very heavy mayo - but it was already served with the burnt ends beef tips.  It would have been nice for the waitress to have told us<br><br>Baked beans: nothing special<br>Collard greens. Bland<br>Cornbread - ok<br>Mac n cheese. Good <br><br>The wait staff was not very attentive. We had to flag them down for more sauces and our drinks were not refilled.", "pics": null}}, {"review": {"des": "Be prepared for large portions of good food and tempting desserts. The only reason I didn't give it a full 5 is because the collard greens were undercooked. But our waiter was nice and the host was very accommodating to the older people we had in our group.", "pics": null}}, {"review": {"des": "We hosted an engagement brunch here recently and they did a stellar job. The look of the venue both inside and out is very appealing and unique. We had a private area upstairs with dedicated staff. They helped us set up ahead of time and take down our decor. The food (we had brunch dishes) was a little slow to come out and the accompanying items weren't served at the same time as the food (ex. sauces and dips). Each of the dishes we tried were delicious! All in all we had a good experience and a tasty meal.", "pics": null}}, {"review": {"des": "Friendly bartenders , cute space, generous with dark alcohol samples....<br>But a fail in the kitchen...but I was forewarned by said bartender when I stated my preference for a well charred slab that I may be dissatisfied..but <br>Sadly everything I was served was just short of flavorful..the hot sauces too tame, mushy ribs , and a slaw that couldn't decide what it was and house pickles a tad too sweet.", "pics": null}}, {"review": {"des": "I came with a group of friends to Chicago Q on the weeekend.  I made a reservation in advance online for 730pm. The restaurant was packed and we had to wait at the bar for 45 minutes before we even got a table. I am not sure what the point of a reservation is if you have to still wait. After we finally were seated we ordered drinks and the waiter took forever to come back with drinks and even longer for the food. We ordered the large portion of mac and cheese for the table, pulled pork, brisket nachos, and ribs. The brisket nachos had only a few chips, kind of defeats the purpose of nachos. The ribs were fall off the bone and smoked perfectly and the pulled pork was yummy. The mac n cheese was extra cheesy so I'd reccomend that as well. Overall, the food is great but will probably take a few hours to eat.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7jhWYQPrfISqIESAB8YZsA/348s.jpg", "caption": "Ribs"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Xl8w63bW-p9jp9E8SpnQkQ/168s.jpg", "caption": "Brisket nachos"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5L_QWAmvKV0oduI9sw2YHw/168s.jpg", "caption": "Old fashioned"}]}}, {"review": {"des": "Q brings classy southern charm to the heart of Chicago. I came here twice in a week with different parties and had equally positive dinner experiences each visit. The place has an interesting layout-- a small entry, side room and bar, back dining rooms, an upstairs?, and more outdoor seating. It's a bit tangly to navigate, but a beautiful and bright space conducive for lunch meetings or a night out. I don't recommend it for families with small children. I agree with another reviewer who mentioned the strange short chairs at the tables. It doesn't detract from the meal, but is an odd detail!<br><br>The menu contains enough variety that you can have a heavy and heart bbq meal with big portions or more general American fare. The lunch menu is a bit lighter with more salad offerings, so you won't leave covered in bbq sauce (unless you want to!). I've also had Q catered for a bachelorette party dinner and was pleased with the service and pricing.<br><br>My go-to bbq preference is pulled pork and fried pickles. Q does it right! My friends ordered the sliders and enjoyed them. Pricing is a little higher than what I would typically pay for bbq, but the atmosphere makes this closer to fine dining. Be sure to save room for dessert. I could not believe the size of the carrot cake slice. Save room! You'll have plenty and then some.", "pics": null}}, {"review": {"des": "Came here with a friend 7/16 and had a great time! We were intrigued by the Alligator starter, and our server was knowledgeable and gave us good recommendations.<br><br>Alligator starter to split, I had the prime brisket and my friend had the \"q flight\", and we both had more than enough to eat. My brisket was a fairly nondescript plating of 5 strips of meat, but it was extremely tender and flavorful. The four sauces served separately were awesome, especially the South Carolina vinegar.<br><br>Our server made sure we were taken care of and our water glasses were filled regularly. <br><br>The space itself is beautiful, and the outdoor seating (where we sat) was perfect for a mild evening. <br><br>Would return.", "pics": null}}, {"review": {"des": "We ordered the platter for 3 shared. <br><br>Brisket was delicious.<br><br>Chicken was NOT. It was dirty and smelly. <br><br>The salads were pretty good. You could get half orders. <br><br>Sides are good. <br><br>Good decor, although inside it could feel really dark at times. <br><br>Wouldn't necessarily come back.", "pics": null}}, {"review": {"des": "Get the chocolate cake. That's all you need to know! <br>Barbecue is fantastic too. As a Texan, I recommend this place to any locals for the best barbecue in the city. It helps that I live just a few blocks away! It's hard to stay away.", "pics": null}}, {"review": {"des": "Many things to say about this establishment. When arriving to the restaurant I had a bit of a hard time finding it on the side since their sign was small and not brightly lit up. They have valet service for 15 bucks and after 3 hrs you get it for 24 which isn't bad. The place was beyond packed. I made a reservation on open table weeks ahead of time an when I made the reservation it asked for anything special to know about. I wrote that we were celebrating a birthday/anniversary. To please get a private table or somewhere secluded from the larger groups. Everything echos in the main dining hall. Anyways we got their a bit earlier for our reservations and I asked if we could be seated anyways or we could have waited. They seated us right away but in the worst location jammed up against the wall where we were on top of the couple next to us. So I asked and they re accommodated us knowing we wanted something intimate. I wasn't to pleased with the fact that knowing I requested it ahead of time that we had a janky experience. Next comes the food. We started with the jalapeño corn hush pups soooo good. Massive and spicy and real corn. We ordered two drinks. They were mediocre. But the real deal was the meats! I personally think if your bbq doesn't need sauce then it's bomb asf and this meat was bomb asf we got the trio of meats. Which included pulled chicken so yummy and juicy and there pulled pork omg so flavorful and then brisket. Which was good. I didn't like there slaw it lacked flavor and creaminess. But my s.o got their mashed potatoes. I don't eat potatoes but theirs o would eat in a heartbeat. I can't explain the flavor combo you have to just try!! Overall it was a tasty place. For 2 drinks and an app and 2 meals it was 90 with a tip. High for Chicago. But every so often it's okay to splurge!", "pics": null}}, {"review": {"des": "Ahhh give me the meattt! This place so great, the food was delicious. I got the baby back ribs and the brisket and it satisfied all of my taste buds. <br><br>I did take a star off because I thought the waiter was not very focused, I know how busy it gets but he barley checked up on us and we had to wait a while for our check but other than that, I'd say give it a try!", "pics": null}}, {"review": {"des": "This might be the best BBQ I've ever had, which was totally unexpected. When you walk in, it has a very cozy, intimate vibe; definitely not your stereotypical BBQ joint. That, and I'd never pin Chicago for having amazing BBQ. But Q proved me wrong!<br><br>We had a hard time choosing what to order, so opted for the Pit Boss Platter which comes with BBQ meatballs, a sausage link, pulled pork, ribs, brisket, and pulled chicken. Everything tasted like it had been smoked in an outdoor grill. Every, single thing on the platter was delicious. The only one I didn't annihilate was the sausage because it was on the spicy side. <br><br>Speaking of annihilating, I shared the platter with a friend and we were both starving. It's good for 2 people. We also had a side of cornbread, and holy bejesus. Again, quite possibly the best cornbread I've ever had. It's served in a mini skillet topped with a lil' scoop of honey butter which gave it just the right sweetness. <br><br>Cocktails were also on point. We tried the hazelnut old fashioned and the mint julep. <br><br>Great service as well. Definitely worth checking out if you're in the mood for some quality 'Q!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/R1491Jqv5sGSl6cK2YAr2g/348s.jpg", "caption": "The Pit Boss Platter"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SpJxKh4D48jEbxJ7z77c1A/168s.jpg", "caption": "Mint Julep"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wCtdIZLeB_6eho1vD_-eTw/168s.jpg", "caption": "Honey Butter Cornbread"}]}}, {"review": {"des": "The service here was gruff and rushed. The food was mediocre. Every member of my party was unimpressed with the food. The meat was dry and bland. There is much better barbecue in the city for the high prices. Would not recommend.", "pics": null}}, {"review": {"des": "I kept seeing this place and after months of walking by, my family and I finally went. This is a great place to go with a larger group because the servings are big and you'll want to pick off each other's plates.<br><br>We sat in the front room, which has a gorgeous high ceiling that looks like it was taken straight out of the south. We loved sitting in there. Great natural lighting (the rest of the restaurant seemed pretty dark). As far as ambience goes, 10/10 for Chicago Q.<br><br>Service was great. Only caveat is we ordered the mac and cheese (easily could be someone's entree) and they forgot about it -- but then they comped it to us, so really not a big deal. They were apologetic and realized their mistake.<br><br>Now for the food. All of it was great but some of it stood out over others. I got the slider trio because I wanted to try everything they were offering. I found the chicken to be the most flavorful and had the best texture. The pulled pork was a bit dry, and the brisket didn't have *so* much flavor. I liked that they came un-sauced so I could douse mine in whatever I wanted (opted for the spiciest option). I chose the honey butter cornbread, which was sadly a bit dry but still great.<br><br>Their homemade chips are AMAZING and bottomless (not good!!!). Seriously, could've filled up on just those before any of the food got placed in front of me.<br><br>Because my family is indulgent, we went for the carrot cake dessert. We're a dessert-loving family but holy cow, this thing was huge. I mean, family of 8 huge. Unbelievably huge and unbelievably delicious.<br><br>TL;DR: come for the barbecue, stay for the chips and the carrot cake.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rR2_lF7ozdO2hsprUJKOLQ/348s.jpg", "caption": "Insane carrot cake!"}]}}, {"review": {"des": "So happy this place is in my neighborhood! Came here for brunch and was not disappointed! <br><br>I cannot make a decision to save my life so I ordered the benedicts flight. Great choice. Per their menu: the Benedict Flight Includes a Smoked Chicken & Egg Benedict, Prime Brisket & Egg Benedict and a Southern Egg Benedict<br><br>I don't think I could pick a favorite. Go with the flight and try a little bit of everything! It is a lot of food and I wasn't able to finish it all. You could probably split this + an appetizer with someone and be more than happy. <br><br>Writing this review reminds me that I need to come back here soon.", "pics": null}}, {"review": {"des": "BBQ can be good outside of Texas! This place proves it. I came with a friend in time for some happy hour specials- $6 glass of wine was well worth it. The chips and pickles are also super tasty to nosh on while you wait for your food. Our service was excellent, and our waitress was really knowledgeable about the meat choices as well.<br><br>We decided to share the q3 platter and chose the brisket, pulled pork, and St. Louis style ribs as our options. The ribs were excellent- super thick and tender and fell right off the bone. I really liked how all the meats were sauce-less so you could try all the different sauces that came with it. This way you really get to try the actual meat. The pulled pork was okay, but the brisket was nice and juicy. Overall the meats were great.<br><br>Excellent and filling- chicago q is a pricey but great way to get that BBQ craving satisfied in the most elegant way. Very nice classy ambience as well. A night well spent here at this classic joint.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YC4b5rJMfLPivilvFhjQnw/348s.jpg", "caption": "Q3 platter"}]}}, {"review": {"des": "Super cute spot.  Came here on a Tuesday afternoon for lunch and it was pretty empty.  You have to like BBQ if you come here!  Right when we sat down there was delicious pickles and chips that we're served.  <br><br>Our server was pretty friendly and helpful! Ended up ordering the pulled chicken sandwich and fries with 4 different sauces.  BBQ, vinegar, mustard and spicy BBQ.  My fav- spicy BBQ and mustard.  It's a pretty large serving and with the chip and pickles that are already served, I needed to move my plate away from me so I wouldn't finish the fries! The server was telling us about the Bloody Mary bar for brunch.  Defiantly coming back for that!  Would recommend Chicago q for anyone that loves BBQ!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gVl4PT7JikaHeutSbQTsdQ/348s.jpg", "caption": "Pulled chicken, their fireplace and pickles and chips! Yum-"}]}}, {"review": {"des": "The food was great, but they didn't have my reservation through yelp. The hostess said they have been having trouble with the yelp service. Hope they resolve the issues soon.<br><br>Luckily, we still got a table right away and the experience was amazing.", "pics": null}}, {"review": {"des": "We had the flight and the wagyu beef. It was amazing. The brisket in the flight was the best I've had outside of Austin. Great service. I highly recommend.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/N0HOzzQCd4SHl-ZwsAYWzQ/348s.jpg", "caption": "Wagyu beef"}]}}, {"review": {"des": "Choice of well prepared BBQ meats. Had the St. Louis Spare Ribs, Baby Back Ribs, Pulled Pork and Brisket. Corn Bread was good but the Collard Greens little disappointing. <br>The service was excellent on a pretty full Sunday evening. Got seated immideately without reservations (7:45). <br>Normally I would prefer the Baby Backs but, the Spare Ribs were great here. <br><br>Would definitely return to try the rest of the menu.<br><br>I would have given them a 5 but the Collard Greens....<br><br><a href=\"/redir?url=https%3A%2F%2Fwww.tripadvisor.com%2FShowUserReviews-g35805-d1893384-r581553690-Chicago_Q-Chicago_Illinois.html&s=8f8cbf823a8da4b4b918c96f1161db206d7112998e4eb24f8dc549f6d1a03e63\" target=\"_blank\" rel=\"nofollow\">tripadvisor.com/ShowUser…</a>", "pics": null}}, {"review": {"des": "A great place for some great barbecue, we got the pulled pork, pulled brisket, and pulled chicken. Pulled chicken wasn't the best but the others were outstanding. Corn bread was a little dry but okay. French fries were greats s well as the macaroni and cheese. Very interesting interior. Solid restaurant in the Gold Coast area.", "pics": null}}, {"review": {"des": "Just popped In for happy hour really quick. Grabbed an old fashioned and a cucumber smash. We also ordered the fried pickles for an app, they were the perfect match to my old fashioned. however my drink was a little overly Smokey and my dates was a little too sweet. Wasn't very busy and the bartender was a little standoffish but we enjoyed ourselves. Probably be back later in the summer for the awesome happy hour they offer.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/S77sElVTVFQ55mCaiET0xQ/348s.jpg", "caption": "Happy hour treats! Cucumber smash and an old fashion with fried pickles!"}]}}, {"review": {"des": "I came here on a date on a weekend night. The atmosphere was great, super romantic with low lighting. The place was full and everyone was dressed well. When you sit down you get their house made chips and pickles which are absolutely divine-- we could not stop shoving them into our mouths. For starters we got hush puppies which were incredible and the aioli was perfect. We also ordered the alligator which was a bit chewy and not my personal favorite. We then split a Mac and cheese with pulled pork which was SO good. Two starters and one main meal more than enough food for the two of us. Service was also excellent! Absolutely recommend it as a date night dinner place or even a family outing during lunch.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ybtSIddGYBvQITHyLvRlKQ/168s.jpg", "caption": "Pulled pork Mac and cheese"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/msIdE_DPRSBreULvWM97VA/168s.jpg", "caption": "Pulled pork Mac and cheese, Hush puppies, Alligator"}]}}, {"review": {"des": "My husband and I first visited Chicago Q a year ago (before moving to the city) and fell in love with the warm atmosphere, delicious food and drinks. You can imagine our excitement when we ended up moving right around the corner this year! Already one of our neighborhood favorites the food is just as good. <br><br>We highly recommend the nachos, the brisket, mashed potatoes and Mac and cheese. Definitely come hungry because you will not be able to stop ordering or eating!", "pics": null}}, {"review": {"des": "Awesome BBQ and solid cocktails! Even the chips they start you with are delicious. Would def go back", "pics": null}}, {"review": {"des": "If you are open on the 4th of July and serving BBQ please do just that. I came here for a simple BBQ pulled pork sandwich and was not served that because I didn't get bbq sauce.  I requested it and 25 minutes later I asked the busboy could we get some upon which I was offered my waiter which had not been there in the 25 minutes. Therefore I asked my neighboring table could I borrow some for the dry pork at this point. They weren't busy which is more infuriating. Hopefully good but not on par today go to lillies Q or twin anchors!!", "pics": null}}, {"review": {"des": "Amazing food, huge portions. I love Bbq and this is some of the best you will find anywhere!", "pics": null}}, {"review": {"des": "Not competition quality as they proclaim, but very solid BBQ. We dined in to celebrate a friend's birthday with a party of 6. The restaurant was packed like a club. We waited about 25 minutes past our reservation time. Not a huge problem, but service was slow throughout the meal. We ordered a few appetizers, but everyone ordered ribs as an entree. They had a good flavor and we're seasoned perfectly, but overcooked and dry. I've been on a BBQ kick for a while now, so \"competition style\" resonates with me. These have potential, but fell short. I'll be back to see if I caught them on a bad day.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1I3ScTMFCBqiTAq5-RqcwQ/348s.jpg", "caption": "Homemade Carrot Cake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3P5bSbuxvF0vCnWVVuN5uA/168s.jpg", "caption": "Classic Cheeseburger - prime brisket blend served on a brioche bun"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Iie_hQGvAtKdgU6w4N_LXg/168s.jpg", "caption": "Hook's Cheddar Mac 'n Cheese"}]}}, {"review": {"des": "Little gem right by my apartment. I've walked by it a few times and have always been drawn to the white and blue theme they have on the patio, and finally I [happened to] stop in during happy hour (HH) on my way home. They have a great HH menu with $6 drinks, wine, and select appetizers. I honestly wanted to order everything on the menu in general because it's southern food and who doesn't love southern food. Instead of bread they bring out homemade chips that they put their own spice rub on (so good!) and a bowl of homemade pickles. I opted for the \"Lavender Gin and Toniq,\" which was delicious, and my friend and I got the bacon cheddar hush puppies; they came with a chipotle aioli and had a nice crunchy outside. Service was great and I saw that they have fried green tomatoes, so I am definitely heading back here soon!", "pics": null}}, {"review": {"des": "Delicious food, terrific service, a wonderful spot for dinner and drinks. The only reason I didn't give 5 stars is because it was not life-changing, but it was cozy and familiar.<br><br>First of all, there is plenty of seating inside, so even on a busy Saturday night we managed to find a table and commandeer it for upwards of 3 hours (it is what happens when you are catching up with a good friend!) Our waitress was super accommodating and helpful, even with our rather long stay. The complementary starters, housemade chips and pickles, were DELICIOUS and honestly one of the many reasons I will  come back. My friend and I decided to split the large Pit Boss platter, meant to be shared by two. It came with sausage links, pulled pork, ribs, prime sliced brisket, and pulled chicken. With that we ordered a side of veggies (kale or collard greens? with bacon). The meat was tender and yummy, came with 4 different BBQ sauces which were all phenomenal. I did think the brisket and pulled pork were on the slightly dry side, but the sauces made up for it. When I come again, I may try the fried chicken, as I've heard good things. The veggies were tender but not overdone and had good bacon-y flavor. For dessert, we got a slice of carrot cake, not knowing it was LITERALLY the size of the platter of meat we had ordered... as large as a newborn. Needless to say, we did not finish it. The caramelized carrots sprinkled on top and not-too-sweet frosting made this one of the best carrot cakes I have ever had. Definitely meant to be shared by at least 3.<br><br>Drinks: they have a huge selection of whiskey, including flights. My friend got a tequila cocktail. She wasn't a fan of her drink, but I tried it and thought it was smooth and creative, so it probably boils down to preference.", "pics": null}}, {"review": {"des": "By far the best Mac and cheese with pulled pork I've had. I'm from Seattle and although I've found some pretty good places for BBQ, none of them compare to this place in Chicago. The Mac and cheese was so smooth and creamy and came with a generous serving of pulled pork. Plus the prices were amazing compared to some of the other places I've been and the service was incredible. I also got the brisket ends which were also super good. Oh and make sure you try the honey cornbread if you like cornbread. It was soooooo good!", "pics": null}}, {"review": {"des": "Fantastic! <br>Burnt Ends: little salty but good with coleslaw<br>Shrimp and Grits: so so so yummy. Great sauce. <br>Cornbread with Poblano Cheese: perfect compliment <br>Second time coming here and by far my best meal to date. Great service and food. I ate everything else before I could take a pic!!", "pics": null}}, {"review": {"des": "I really liked Chicago Q! I have been lucky to have visited \"fancy BBQ\" places and this was by far the best I have had. The portions were huge and everything that I ate was very tasty! <br><br>I got the three meat platter so I got 1/3 Ribs, Pulled Chicken, and Beef Brisket. The Beef Brisket was good, but not earth shattering. The Ribs and the Pulled Chicken were amazing. I almost didn't get the pulled chicken, but I am glad I did! <br><br>One thing to note is that you got free BBQ potato chips that were addicting. You have to pay extra for those at some of Smith's restaurants. Not here! Free at Chicago Q!<br><br>The only slight negative was that the service seemed a bit off. I have been to Art Smith restaurants before so I know that part of the premium cost is the exceptional service. The service was ok, but not on the usual Art Smith level. I will chalk it up to a bad night.", "pics": null}}, {"review": {"des": "The food at CQ is excellent. The ribs are some of the best I have tasted in a very long time. The smoke ring/flavor profile is fully developed and the ribs are tender, moist and meaty. Unlike most BBQ places, sauce is not really \"needed\" as a result of the great smoke flavor but feel free to gild the lily and ask for the sauce sampler in order to find your favorite saucy enhancement. Simply put, the food is wonderfully executed at CQ.<br><br>Appetizers/Sides: <br>-Burnt ends arrive on a bed of perfectly seasoned and creamy celery seed coleslaw<br>-Side of skillet mac and cheese<br>-Brisket chili<br>*These items were enjoyed alongside the complimentary housemade pickles and potato chips which arrive at your table moments after being seated.<br>Of course, all of the above items are plentiful and also intended to accompany the main entrees.<br><br>The main events were:<br>-Steakhouse Wedge Salad with blue cheese dressing (Char-crusted Filet Chunks nestled among the typical suspects in a wedge salad: iceberg, bacon, tomatoes, cucs, and grilled corn)<br>-The Smoker (Baby back ribs, choice of sliced brisket, pulled pork or pulled chicken alongside more creamy celery seed coleslaw)<br><br>As previously stated, the caliber of food here is top notch and the dining room is quite comfortable and cozy. The only reason this place did not get top ratings was due to poor customer service. Dining out is every bit part of the service received, as it is the quality and caliber of food being served. If great food is being served by those that have zero engagement, the overall experience will suffer. This is by no means a cheap dining experience and the quality of all other supporting components (e.g., wait staff, etc.) needs to be in sync with the higher menu price point.<br><br>Everyone from the hostess to the waitress and servers were drab, lack lustre and not at all engaged. It is of my opinion that the entire wait staff needs a pep rally of sorts to learn the proper execution of making the customer experience a priority. In this instance, the waitress greets us to take our drink order, however instead of making eye contact and speaking \"to\" us directly, she was suddenly enthralled with looking at her reflection in the mirror that hung just above our booth. Apparently, it was more important that she check out her grooming attempts, rather than give the customer the attention required to take the order. <br><br>The wait staff is unfriendly, has zero personality, is robotic at best and appears to lack the maturity and skill set to even attempt to simulate being attentive or appreciative of patronage. With the plethora of great restaurants in Chicago, there are always other great dining options. This is very sad for this caliber of restaurant. More importantly, it is a disservice to the fantastic food that Art Smith has crafted.<br><br>I had the opportunity to visit Art Smith's other restaurant, Table 52, before its closure. Table 52 was also excellent, and one of the key components was that the wait staff was mature, attentive, engaged and definitely serious about representing the Art Smith brand.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yR5aaOeQSljq6uczgKsbTw/348s.jpg", "caption": "Table Setting (great use of the empty Makers Mark bottles....repurposed as the water jug for the table)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sygVKRybgFX-T2VX7bXhkQ/168s.jpg", "caption": "Housemade Bread & Butter Pickles & Crisp Potato Chips (perfectly salted)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RHq838Tq0_TeQOd_xmKxzQ/168s.jpg", "caption": "Skillet Mac n Cheese"}]}}, {"review": {"des": "So wanted to like this more but the service brought the stars down. <br>Waited over 10 minutes to get s waiter and then another 10 for our drinks to come out. Now I get this if it's a busy Friday or Saturday but seriously on a random Wednesday?<br>Then had to wait for our waiter to finally come and take our order. Very nice guy but probably we were the only table he had in the back?<br>Food was good. Not wow fantastic but I liked the ribs and the sauces. The salmon was good not great. <br>Ok for every once in a while but not our favorite place. <br>Whiskey was great.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_p0UFRK_T0R8PwfnFJSzvw/348s.jpg", "caption": "Whiskey Flight"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ha5d5fmOkhCWetpMECM5uw/168s.jpg", "caption": "Sauces! Excellent"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/30T-UoT-ztlqAIdbNjRhFg/168s.jpg", "caption": "Half order baby back ribs"}]}}, {"review": {"des": "Came to this restaurant looking for some good bbq southern comfort food. Ordered the pulled pork with a side of cole slaw. Big disappointment. The pulled pork was so dry and bleh. It's so dry that I felt like it's gonna choke on my throat. Good thing their bbq sauces are really good..so have to kept dumping sauce on the meat to make me taste something. The cole slaw was pretty much the same..flavor was just bleh. Think the only thing that tasted good was the chips they brought out in the beginning. Overall, the staff was nice. But still messed up our leftovers, so I ended up taking home my friends food instead of my own. The restaurant vibe was okay as well.", "pics": null}}, {"review": {"des": "In the three years that I've lived in Chicago I have found Chicago q to have the best barbecue I've ever tasted. I love it so much that I've introduced many friends to it. In fact every dish I have had here is excellent! The Art Smith fried chicken is my top choice but you also can't go wrong with the brisket or baby back ribs. For appetizers my go-tos are the fried green tomatoes and bacon cheddar hush puppies. For sides the macaroni and cheese, mashed potatoes, and honey butter cornbread are all delectable in their own  right. <br><br>Each time I walk in I am greeted by pleasant and friendly hostesses that accommodate me and my guests. The atmosphere and ambiance also help make for a pleasurable dining experience. The service has always been top notch. And you can't miss the manager Ben with his distinguished look and charm. I've often noticed how attentive and observant he is to the needs of the dining patrons. As my friends and I often say, he is \"the face of Q\". <br><br>And last, but not least, the dessert... All of the desserts are large and can easily be shared among several people. The carrot cake is the best I've ever tasted and the milk & cookies are one of my personal favorites.", "pics": null}}, {"review": {"des": "Ordered appetizers for a small gathering at Biggs Cigar Mansion (next door). Meatballs, Mac & Cheese and Wings.  HORRIBLE. <br><br>*The meat balls were more like hard dry lump Charcoal balls.. <br>*The \"bbq\" Wings were appetizing on ONE side and the other side was BURNT TO HIGH HELL.. <br>*The Mac & Cheese was Sahara Desert Dry But edible. <br><br>It was quite embarrassing that I served this to my guests.", "pics": null}}, {"review": {"des": "I've been twice recently for brunch. There's things I like and then there's things that I don't like, but there is one thing that I LOVE... that Art Smith's FRIED CHICKEN & WAFFLE!!<br><br>This is one of the best chicken and waffle dishes you'll find anywhere! The chicken is perfectly moist and crispy, it's perfection. Waffles are light & airy. Then we have this strawberry-red pepper coulis. I don't know what coulis is and you don't either; all you need to know if you put it on the waffle and delicious! <br><br>Other pros: <br>- Bloody Mary bar! You can seriously make your Bloody Mary a meal in itself, with bacon, cheese, meats, veggies and any other food group you can imagine. It comes with a hefty price tag, but you can definitely make it worth it! <br><br>Cons:  <br>- Price:  It's expensive, I know if comes with the area/territory, but I'm always shocked at how expensive things are. <br>- Benedict Flight: I am a chronic order-er of eggs Benedict, but I was unimpressed with this one. None of the meats hooked me, the eggs were overpowered by all the meat and the bread underneath so soggy from said meat. Personally not my favorite. <br><br>Have yourself a Bloody Mary and some Fried Chicken & Waffles and you'll leave a happy customer!", "pics": null}}, {"review": {"des": "I was super excited to have Art Smith's buttermilk fried chicken and wasn't disappointed. Everyone else had bbq. Happily. Excellent food, good<br>service, personable servers. Oddly short tables/chairs. Knees were creaky after dinner. Get adult sized tables.", "pics": null}}, {"review": {"des": "Brought a group of 8 here for a birthday celebration: food and service were excellent! The burnt ends were flavorful and juicy to start the meal. The flight was a great mix of their meats and their mashed potatoes had skins on - very creamy! We were in between the sweet and savory cornbread - we chose the sweet and our sever threw in the savory for free! Cake for dessert came in large proportions: very rich and a great way to end the meal. Best barbecue place I've tried in Chicago!", "pics": null}}, {"review": {"des": "I dined there recently with a friend. The ambience was nice, the food was great, and service was excellent.", "pics": null}}, {"review": {"des": "Excellent food and service! The beef brisket and fried chicken are both amazing! We went for a family member's Birthday, and the waitstaff did an excellent job-they even gave a very large slice of carrot cake for free! We will definitely be back.", "pics": null}}, {"review": {"des": "Excellent place. Went on a Saturday night- busy, lively atmosphere but didn't feel crowded. Waiter was entertaining, very knowledgeable of menu and helped make some great selections. Brisket, pulled pork, chicken were all spot on. I would highly recommend the burnt brisket ends for an app. I personally ordered the shrimp and grits which was amazing if you want something a little different. Can't comment on drinks just ordered some beers.", "pics": null}}, {"review": {"des": "Seems to have slipped a bit with some dishes since Whippen left.  Sad.", "pics": null}}, {"review": {"des": "This place would be four stars if not for the price. Good barbecue, nice service and lovely surroundings. Bit pricey for average, though I suppose it's because of its location in the Gold Coast.<br><br>They have a giant chocolate cake here which was the highlight of the evening. One slice was the size of my face, and it was perfectly moist and chocolate-y.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FO7_z4UlsqkK9v3v8FatLA/348s.jpg", "caption": "Huge yummy moist chocolate cake with lots of fudge!"}]}}, {"review": {"des": "My friends and i came here for brunch and had an excellent experience! Their mimosa special was perfect, you got a bottle of champagne and carafe of OJ to share for $25 which was the perfect amount for 3 girls. They serve delicious bbq chips and pickles while you're waiting for your food. I ordered the omelette which was delicious as was the toast that came with it. Portions were very large. We weren't made aware that the omelet came with potatoes so i ordered potatoes on the side. Needless to say i had a ton of potatoes-it would've been nice to know that the meal came with that so i didn't order extra. Overall it was a lovely experience. The waitress and waiter that served us were very friendly, knowledgeable, and attentive. Would definitely recommend again!", "pics": null}}, {"review": {"des": "Attended a happy hour for FFC Gold Coast tonight. Only got to try a few apps because they were all getting grabbed before they got to our table (typical gym people taking all the food) but the fried green tomato was amazing. Also had the lemonade with house infused cucumber vodka which was also good. Husband said the old fashion was above average but not his favorite. We look forward to returning and trying more of the food.", "pics": null}}]}