{"name": "chicago-pizza-and-oven-grinder-company-chicago", "reviews": [{"review": {"des": "This place is amazing. A must try place for Chicago eats. Get the Pizza Pot Pie. Hand down this is the best. <br><br>Now the line will be long. So expect to wait 20 minutes to an hour but it's worth it. Plus there is a inside wait area so it's not so bad. <br><br>For an appetizer try the Mediterranean Bread. It looks and tastes amazing. It's fun to eat as well because it falls off the plate as they serve it to you and you just pull pieces off. <br><br>Grinders is a place where the menu is small but the few things they offer are amazing. You can't go wrong with anything here so try it out. Like I said it's worth the wait.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_k4UsnSoi3N4otV5xmiS7g/168s.jpg", "caption": "Mediterranean Bread. Yum."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ciqeinhLidislISZBaPm8Q/168s.jpg", "caption": "Worth the wait. Trust me."}]}}, {"review": {"des": "How come I've lived in Chicago for 5 years and never been here! It's a shame on my part. <br>This pizza place is sooo cute, it screams family owned restaurant and the neighborhood gem. It's tiny, so you'll have to make a reservation or wait quite a while. My friends and I went on a random Monday night and waited for about 45 mins! <br>I would recommend going for the pizza pot pie! It's pizza crust in a bowl shape and filled with pizza sauce, sausage, onions, & cheese. The 1/2 pounder is an individual portion and costs $13.75. We were a bit greedy so we ordered the Mediterrean bread as well, which is just a super thin, flat piece of round bread that is sprinkled with a generous amount of seasoning and parmesan cheese. All the carbs will fill your belly up, guaranteed. <br>I want to come back and try the oven grinders, which look like big Italian loaves or sandwiches...ahhh I'm drooling! Highly recommending this place, especially for you tourists who are looking for a Chicago pizza experience.", "pics": null}}, {"review": {"des": "As if they need another five star review... ;-)<br><br>We went a few weeks ago - we're never ones to wait, but we've lived in the city long enough so it's kind of weird that we hadn't been yet. <br><br>It was worth everything. The Mediterranean bread was incredible... get it! The dressings that come with it and with the salad are all phenomenal. The pizza pot pie is one of the most delicious things I've had in ages. <br><br>Can't wait to return!", "pics": null}}, {"review": {"des": "Finally after two years of having this on my Chicago to-eat list, I've finally found an excuse to come visit and try this pizza pot pie with my friends from home. Students and friends alike have mentioned that it's worth the wait to try this style of pizza. So what was the verdict?<br><br>...Not bad Oven Grinder Co! Your pot pie was certainly a new experience.<br><br>The physically large menu should be telling of what you're about to get yourself into. My friends and I did a bit of research and heed the suggestions from our server Brian- we each got a 1/5 pound pizza pie with mushrooms and sausage (the default) and split the incredibly buttery, white Mediterranean Bread. He put it best, \"it's already carby so why not just get the white bread version when wheat won't make you feel any better.\" Good points my friend.<br><br>The Mediterranean Bread reminded me of classic naan. You tear a bit with your fingers and enjoy its spices and cheesy nature. Save some for your pizza because we turned ours into pseudo-curry. Speaking of the pizza, these come out in bowls which get turned on its head and served onto your plate. It was piping hot and cool to see them break open the pizza for you in front of your eyes. Amazing!<br><br>Our pizza pot pies were what we all expected. Piping hot, rich in tomato sauce and cheese, but lacked a bit in terms of protein and the mushrooms. We ate it almost as if it was a bread bowl. The 1/2 pound is certainly meant for one person and even splitting it with another means you'll probably leave a bit hungry. With 99% of the people coming here ordering these pies, you should too.<br><br>It's certainly not my favorite kind of pizza so I don't see myself coming back here anytime soon. However, the excellent service, presentation, and style of the pizza certainly warrants it a try at least once. Glad I can finally cross this off the bucket list.<br><br>Also, CASH ONLY! Prices here are a bit steep in my opinion and you won't leave with leftovers like other Chicago pizza joints. Be prepared.", "pics": null}}, {"review": {"des": "Please believe the hype! Chicago Pizza and Oven Grinder is hands down the best pizza I ever had in my life! Yes, I took it there! I have never experienced pizza so fresh and tasty in my entire twenty plus years of pizza indulging. <br><br>We arrived at noon on a Sunday and put our name on the list. The host told us it was a two hour wait, so we decided to walk around and explore the town as we waited. It worked out perfectly because when we came back we were immediately seated. Sitting and waiting for two hours would drive me nuts.<br><br>The interior of this place is so intimate and cozy. It's small but it has personality. However I am sure you are not reading this to hear me ramble on about interiors and decor. <br><br>Let's talk Pizza Pie! <br><br>All I can say is you have to experience this place for yourself. I have no words to describe how amazinggggg the food was. I'll let my pictures do the talking but what you see is most certainly just an ounce of what you get in flavor!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fTGmNuWiLu-ncL4mj5xRlg/348s.jpg", "caption": "Yes you need a bib to enjoy the pizza. :)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4DO87mzBcxcDHAcARQlueQ/168s.jpg", "caption": "All that survived. The pie stood no chance."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/u93HNzooMPi3Ubfv3zLYfw/168s.jpg", "caption": "Salad"}]}}, {"review": {"des": "This cash-only spot has been one of my favorite experiences in Chicago so far.  I came here for the first time with family in town and nobody had a clue what to expect.  We put our name in around 5:30 on a Monday, we were told it would be about an hour so we popped across the street to the wine bar (fabulous wait spot btw) and walked back to the restaurant at about 6:15 and waited for only a few more minutes before being seated.  Once seated, the server couldn't have been more friendly.  He helped us decide on the salad to share and individual pizzas for everyone.  The food and wine here were ALL reasonably priced, that was nice. The food was cheesy and delicious and cooked to perfection.  I can't wait to come back!", "pics": null}}, {"review": {"des": "Visiting from San Diego. This was very good on a day where you are celebrating or not counting carbs. There is one vegan option, and some vegetarian option, but mostly meat. I'm a pescatarian so I was able to enjoy myself.", "pics": null}}, {"review": {"des": "I've lived in the area for a year and a half, but haven't visited because the large amounts of people waiting outside has seemed quite daunting. Recently, my boyfriend asked if we should go right around opening time on a Monday just to check it out, so we did. <br><br>We arrived 10 minutes after opening, and there was already a 45 minute wait. We had nothing to do for a few hours, plus this seemed like a shorter wait than we ever expected to have here, so we said, \"why the hell not?!\" We put our name on the list, grabbed some cash from the ATM, and sat on the steps of the apartment building next door. I'm sure those neighbors just love having people wait outside their building every night, but that's some of the charm of the spot.<br><br>After waiting for about 40 minutes, the host came out to bring my boyfriend and I to a small booth inside. We were surprised at how simple the menu was: a few appetizers, two options for pot pies, a few different options for The Grinder-style pizza, and then salad meal options. You've got to be a really badass spot to be able to have such to-the-point options that are also iconic.<br><br>We ordered a large salad to start, and our waiter let us know that people often assume the large is for two, so if we wanted to get a small, that might be more fitting. We went with the large anyway, and it was delicious, but we should've listened to our waiter, because it was HUGE. I was a little worried I was going to get too full before my pot pie came, but luckily I gave up and my boyfriend finished the salad.<br><br>Then came time for the real royalty of the experience, THE POT PIE. I love you so damn much, CPOG Pot Pie. You're perfect, from the crust to the sausage and cooked mushrooms and the cheesiness. The pot pie absolutely lives up to the hype, and if you're wondering whether or not to wait and give it a try, the answer is that it's worth the wait. CPOG is magical and I completely understand why people wait outside for it. Plus, the history of the building and the street in general is so intriguing, but I won't ruin it for you here -- take a visit for yourself and experience the amazingness.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zwEdpjxnmXxFW7B7bHpG5w/348s.jpg", "caption": "Cash only!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/56Q9Z1znV9eY3uUi4KX9NQ/168s.jpg", "caption": "Hi"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hizb2j39pqLg0-P17QiSUw/168s.jpg", "caption": "This menu BABY"}]}}, {"review": {"des": "This restaurant actually sparked our girl's trip to Chicago. Over a year ago, a friend of mine saw this restaurant on a TV show. We jokingly said let's go there for our trip, and you can try the pizza pot pie. Fast forward a year and the trip has come to fruition. We arrived at 11pm on a Friday night and waited 45 minutes for a table. After much debate, everyone ordered the one pounder pizza pot pie instead of the half pounder. Oh my goodness!! Where has this been all my life?!? I want to have one at least once a week. The meaty, cheesy goodness is unmatched. Seriously, you have to taste a pizza pot pie from this restaurant once in your lifetime.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QP14z_rW6XUodj-zt5sWzQ/168s.jpg", "caption": "Pizza pot pie"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tIaC_GVVlWRdK5EGtmJDbg/168s.jpg", "caption": "Chicago Pizza and Oven Grinder"}]}}, {"review": {"des": "We came here around 10:30 on a Saturday night. I had heard this place gets busy, and they weren't lying!  The wait for a table was over an hour. We ended up ordering one pizza pot pie to go, which still took about 30-40 minutes. The restaurant is very narrow and will feel overly crowded. Annoyingly they do cash only here. <br><br>As for the pizza, it was delicious!  The crust of the pot pie was the right balance of crispness and flakiness. The inside was very cheesy, just how I prefer :). I can see why this place has the long lines that it does. I am definitely curious to try more of their menu items. I want to give this place 4.5 stars, because I'm not a fan of cash only and how cramped the restaurant felt.  Although food wise I was very satisfied.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DdE6wKudLZgpFXaj1QFlPQ/168s.jpg", "caption": "Pizza pot pie"}]}}, {"review": {"des": "Be ready to wait, but definitely worth it! I ordered the Mediterranean bread and the half pound with mushrooms and sausage and barely finished it! Margarita had just the right balance of alcohol. Prepare to have another wait once you order because everything is made from scratch. They also give you the option to take a frozen one home if you would like too. Definitely a great experience! Food tasted great too!<br><br>** note that they only accept cash. If you happen to forget cash, there is an ATM by the enterance", "pics": null}}, {"review": {"des": "Cash Cash Cash!!! Cash is still king here. Sorry for all you card lovers. Small small super small space. It was a TWO hour wait!!! It seems like there is always a two hour wait. We couldn't wait that long so we ordered take out. And that took a long time too!! Whyyy?!?! Don't we get priority! It took like an hour!! <br><br>Ordered the popular pizza pot pie. It's cooked like a chicken pot pie but flipped upside down like a deep dish pizza. It was interesting. The cheese felt like two inches thick, the crust about one inch thick and in between is a soup mash of tomato sauce, some ground meat?, a few mushrooms. It was actually pretty good. The flavor was there. Better than some chains.<br><br>Maybe going there during the weekday lunch will have a shorter wait. <br><br>Remember... CASH CASH CASH!!! They have an ATM in their lobby and their entrance is obscure....", "pics": null}}, {"review": {"des": "I first seen this place on the internet. Food network had done a special on it. As soon as I seen it I knew that I had to try it for myself. Also it helped that it was in my favorite city as well. So I deiced that upon my next annual trip I would have to go and try it out. First thing that I will say is that this place is as good as advertised. There is zero over hype. This place instantly became one of my go-to Chicago restaurants for years. Every time I come here I've came to this place since. In fact more times than any other place in Chicago<br><br>The Pizza Pot Pie is the All-Star, Lead Singer, and captain of this menu. If you come here, this is what you should be planning on getting no matter what. As soon as they bring it out to the table you will have to physically hold your jaw shut to keep your tongue from rolling out. It's a wonderful smell and it looks amazing. Especially when they flip it out the bowl and you see all that gooey melt-y cheese just flowing around inside that thing. And it taste wonderful. When I first seen the video of this place I thought that it would be good, but didn't think it would be this good. It has its own flavor and taste. It blends and balances both elements of a pizza and pot pie together so well. Believe me. You won't be disappointed with this. Other thing I always get is the Mediterranean bread. This is one of their top selling items as well. It is a must get when you go. The spices on top of it are really great. I couldn't get enough of this. <br><br>The place is really dark and dim. Which adds to vibe there. I normally prefer a lot of natural lighting. But I think the darker lighting adds to the ambiance of place, and helps the place seem more old and historic. Also this restaurant is very small. So be prepared to wait quite a bit of time to get a seat if you come any other time then when it just opens. In fact id probably say that between all the times I've been here the wait has been about 2 hours. Again except for when I got there right when they opened. <br><br>The service was really quick and nice. I have nothing bad to say about any waiter that I have had there. Everything was really quick. Waiter made lots of tips back to the table to make sure we had everything we needed. Drinks were refilled before they were even 75 percent gone. I couldn't of asked for anything more. <br><br>Overall this is one of my favorite places in Chicago. A must go to place whenever I visit. I think that anyone would love it. Good for dates, or just going to dinner with friends or family. So I highly recommend. They get a solid 5 stars in my book. Make sure to try it out!", "pics": null}}, {"review": {"des": "Wow......I don't think I ever waited 2 hrs & 20 mins for some food, ever. But i will tell you, this was worth the wait!<br><br>My fiance & i came here with our friend's that were visiting from Phoenix, AZ. She was near the restaurant, so I asked her to go ahead & check us in & we would be on our way, since based on the reviews, I knew we were going to wait. <br><br>Luckily we went when the weather was still decent. When we arrived from our Lyft, there were people waiting outside as there is a small waiting area inside. I'm not sure when the weather gets colder or snowy, if people really wait 2 hours?<br><br>After the 1st hour, we decided to move to wait in the inside area & saw all those cheesy, yummy pot pies being flipped over in front of our eyes. I was browsing the menu online & noticed the Mediterranean bread kept coming out. We decided that we must try it & share & I'm glad we did!<br><br>Prior to sitting down, maybe 20 mins or so, we decided to get a drink & the bartender kept telling us to try this salad. We weren't thinking of salads coming to this place, but the Italian salad was definitely shareable & delicious! We ended up sharing the salad, the Mediterranean bread, & we all had half of the sausage mushroom pizza pot pie.<br><br>I could not get over how delicious it came out. You can smell the aroma as the server flipped it over.<br><br>This has been on my Yelp bookmark for a while now. Glad we were able to finally try it.", "pics": null}}, {"review": {"des": "We have been so excited to try this place and it didn't disappoint!  They open at 4 and we were one of the first ten tables. <br><br>The inside has a woody feel and the lantern light fixtures are great!  Our server came quickly and we put in our order and she advised it would be a lot 30 minutes.<br><br>While we waited, the refills on water were prompt!  I had to even move my glass as it was filled so rapidly! <br><br>We got the 1/2 pounder and Italian combination.  I'm in love with that pizza!  The sauce is great and the cheese is perfect.  The grinder was equally as good and the grilled peppers that come with it were great as well!<br><br>Note this place is cash only but we can't wait to come back and try more items on the menu!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MwnlsuB7fzXt54KdQhuC5w/348s.jpg", "caption": "Cheers"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kXMFMG9iwg-074wGNbn2ew/168s.jpg", "caption": "1/2 Pounder"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1fwjc0o1amju2Sp1ttxfsg/168s.jpg", "caption": "Inside the Grinder"}]}}, {"review": {"des": "Experience: met some of my coworkers here for drinks and fuss. We started off at the bar and had drinks as they will not seat you unless your entire party I'm ready. The place is cash only which is only an inconvenience if you're broke or didn't grab cash at the atm. Well enough there is an atm right when you walk in. $3 fee tho .  Customer service was great. Waitress was fun and the manager checked in on us 2x.  We had the famous pies along with the Mediterranean bread (a hit). <br><br>The pot pies were delicious and lived up to the rave. <br><br>Advice: valet is $12. Use it. Grab cash before hand. Prepare to wait so drinking at the bar is a great pass time. <br><br>I'll be back as my girl was mad I didn't take her first instead.", "pics": null}}, {"review": {"des": "As one of the most famously popular restaurants in Chicago, this restaurant is always busy, and for good reason. <br><br>This wildly packed restaurant has a line of people waiting outside as of the hour before it even opens. Locals and tourists alike flock here for the renown Chicago Pot Pie and the equally renown Oven Grinder. <br><br>The portions are significant, so it is virtually impossible for anyone to leave hungry. <br><br>The preparation of each meal is hearty and flavorful.  The patrons respond boisterously, as the atmosphere is cozy and welcoming for a great experience. <br><br>This is a unique restaurant that should be on everyone's to do list when living in or visiting Chicago.", "pics": null}}, {"review": {"des": "We came late night for a pizza pot pie to go, and the restaurant was still super busy. The wait was around 40-45 minutes. It's cash only, but there's an ATM at the entrance for your convenience. The greeter at the door was very nice pointing out to mind the step down and explaining how to place a to go order, but the waitress at the back that took our to-go order just couldn't be bothered. You would assume customers waiting in the restaurant have priority over a phone orders, but that's not the case here, and it's unfortunate. There's not very much space to stand in the back for placing an order, and we were basically scolded multiple times to get out the way when there was little space to even move. The waitress's attitude changed as soon as we paid and included a full tip, where she then directed us to wait in the front with a nicer tone. <br><br>The pot pie was good. Lots of cheese, lots of tang, soft crust. Overall, good food, poor customer service experience.", "pics": null}}, {"review": {"des": "The place is low key and the inside is dimmed with an old school Italian ambiance to it. It's cash only and the service is great. I got there 30 minutes before they closed and there was no wait so it was worth it. The Mediterranean bread was delicious (appetizer) and I had the 1/2 pound famous pizza pot pie with meat sauce in whole wheat bread. I thought it was mediocre, it would've been nice to have more ingredients than just meat, sauce with the option of mushrooms. I expected more from a dish spoken so highly of. Otherwise, I enjoyed the ambiance and our server had a winsome persona.", "pics": null}}, {"review": {"des": "A staple of Lincoln Park, CPOG has some great Chicago history in it. Aside from the stories you will hear about the St. Valentine's Massacre from the famous Al Capone, CPOG has made use of a remodeled basement to serve up some comfort food!<br><br>First off, CPOG is cash only and there is an ATM on site. It is not a big place at all, so of course expect a line and don't come starving. On the weekends, the line is much longer and start to form at 1030am when the place opens at 11. This visit I had a 45 minute wait and actually spent some of that time walking to the bank. I got my cardio before devouring delicious carbs. <br><br>The menu is physically large with the story on the back, but there isn't a lot on food options. They keep the pizza simple, too- there is only one style. Before you dive in to the 1/2 pound or 1 pound of pizza, you MUST order the Mediterranean bread. It is LARGE & THIN piece of bread with various spices and seasoning on it. I can't really explain it, the picture will do most of that! It can certainly feed a whole table!<br>The house salad is actually fat too. You get some fresh ice berg (funny) lettuce with thin slices of red onion and 1/4 cuts of tomato and olives/cucumbers. The ranch used here is unique to me. I had to ask, COPG uses a sour cream based ranch. It's amazing.<br>Now onto the main show, the pizza. It is true. All the videos you have seen, the pizza is literally baked in a ceramic dish with a cheesy cheesy cheesy layer. They offer a vegetarian option and white or wheat crust. *side note* they put big pieces of mushrooms and the meat seems like meat sauce instead* It looks like pizza, but I personally think its more like 1 very large piece of ravioli and cheese because of that meat sauce. <br><br>I can't complain of the food. It is all scrumptious, but it is personally not my go-to *bowl* of pizza.<br><br>Extra side note, the host will never write your name down. He only memorizes faces, so give him a good look of your face & don't go too far!<br><br>8/10", "pics": null}}, {"review": {"des": "Well first off let me start by saying this is a small place and most likely you will have to wait.  Best bet is to get here a half and hour before lunch time and be able to be seated, hopefully, when they open.  The waiting really didn't influence my review.  The bar, where you can wait, is small,  but we were able to get a drink, well I got a few.  The bartender makes a good stiff old fashioned.  They have a dozen or so beers in bottles and have two, Stella and Miller, on draft.  When we sat we ordered right away we got the Mediterranean bread for an appetizer.  It was really good.  Wish it would have came with olive oil or hummus, something to dip it in.  I ordered the vegetarian pizza pot pie ( no meat in the sauce) and I thought it was good.  Not really mind blowing or something that I would wait and hour and a half in line for and then at least another half hour for the pizza to be done cooking.  I was sort of disappointed.  It's basically is a cheese bowl with an average sauce.  The waitress was friendly and came around often to see if we needed refills.  Overall I wouldn't go out of my way to come here.", "pics": null}}, {"review": {"des": "Such a great time! We FINALLY made it here after seeing it online, the home of the pot pie pizza! It was crowded but we were seated very quickly. Our waitress, Marissa, was pure perfection, offering to go over the menu with us and quickly affirming our choices. We ordered the chef salad to share, the Mediterranean flat bread, and of course the pot pie pizza to share. <br><br>First, out came the flatbread, fresh from the oven with a diameter that was bigger than the plate! Seriously as big, if not bigger than a drum cymbal, almost consuming our tiny table, lightly covered in fragrant seasonings and accompanied by two dipping sauces. One a creamy garlic and the other a sweet poppyseed. Marissa explained they were good either alone or mixed, so we tried them alone and then layered. She was right! They were delicious! Next the salad topped with red pepper, red onion, artichoke heart, black olives, green olives stuffed with blue cheese, pepperoncini, green pepper, tomatoes, and a light vinegarette. So yummy! Then the star of the show arrived! The pot pie pizza! They cook it in a bowl starting off with cheese, a delicious tomato sauce, thick with ground Italian sausage, button mushrooms if you prefer, then cover the bowl with tender pizza dough. The bring it to your table piping hot and the server removes the bowl and it was a work of art! It was everything I imagined it would be! Steamy, cheesy and delicious! They also offer a vegetarian choice. The restaurant owner/manager stopped by our table twice to ask if this was our first time and welcomed us and again to see how everything was. In spite of how busy it was the waitstaff treated us as if we were the only ones there, took our order quickly, kept refilling our drinks, quick to get boxes and pack up our food. This is a cash only establishment, and very close intimate seating, no reservations, but they get you in and out quickly without feeling rushed. Loved it!!!", "pics": null}}, {"review": {"des": "Only place I know that does a pot pie style pizza.  This place has become quite famous over the years so be ready for a wait during peak times. Portion size is quite large, making even the smaller size pie shareable. We also tried the lesser known grinder sandwiches which were also very filling and enough for two. The barkeep was also quite generous with the wine.", "pics": null}}, {"review": {"des": "I had the opportunity this last week to go to Chicago Pizza and Oven Grinder Company and thought it was really good.  It did take us two tries to get in but once we got in we were really surprised on how much we liked it!  <br><br>We first tried going on a Saturday night.  Knowing this place does not take reservations we wanted to try to get in.  We arrived to find out they had a 2 hour and 40 minute wait.  We were totally not willing to wait that long for pizza so we left.  We ended up coming back on Sunday morning at 11:15 when they opened and we did not have to wait at all!  <br><br>The pizza is really damn good!  They cook the pizza upside down.  The put the cheese on first, then a meat sauce, a few button mushrooms and then the crust on top.  They bake in the over for over 30 minutes and are served with the cup still in it.  After a few wiggles of the spoon the bowl pops out and you have a delicious pie.  They serve these as half and full pounders.  I got the half and it was plenty!  <br><br>A couple cons to this place.  First it's not free refills of soda.  I believe it was $1.75 for just 1 glass and it was only an 8oz glass so with ice you're most likely getting 5ozs.  This place is cash only.  They do not take cards but do have an ATM.  The price is pretty expensive.  Finally it's hot inside.  We were there on a warm day and it was hot inside!  <br><br>I would for sure go back to this place and enjoyed the pizza pot pie experience.  I enjoyed it a lot and highly recommend", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1vk30suNlOuCOVSByrII0w/348s.jpg", "caption": "Lunch with these friends"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/i5kGNi7TRQ8OuHy15fssDA/168s.jpg", "caption": "Pot pies ready"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/75y-aJt14XY83MdLQZDhXQ/168s.jpg", "caption": "Yummm"}]}}, {"review": {"des": "We did not enjoy this place what do ever. We were not a fan of the pizza pot pie. We waited for about 2 hours before we were seated so by the time we got our food we were really hungry but really disappointed it.<br><br>The pizza pot pie is like a chicken pot pie but with pizza ingredients. They flip the pot pie out of the bowl right at your table. The cheese is now on top, the sauce is in the middle and the crust is on the bottom and comes up around the edges.  It looked like I was eating a tomato soup/french onion bread bowl. The \"bread bowl\" was filled with tomato sauce and topped with cheese. It very different and messy. It was hard to slice without making a mess. The flavor profile was also okay. It tasted like pizza but didn't look or feel like I was eating pizza.<br><br>I would recommend trying this if you're visiting because it a Chicago thing to do and it is different/unique. I personally didn't like it enough to wait 2 hours for it again.", "pics": null}}, {"review": {"des": "If you're in Chicago and have three hours to spare, take a detour and come to this restaurant. Honestly, I wasn't sure if this place was worth the wait but boy am I glad I waited. While waiting for nearly 3 hours, we went to the restaurant across the street to have an appetizer and a few drinks. When we finally were seated, we promptly ordered our pizza pie and salad. The pie comes out flipped upside down because that's how it's baked. They flip it right side up at the table. Come hungry because you're definitely gonna want to stuff all of this pizza into your stomach. It's delicious, the staff is wonderful and the vibe is cozy.", "pics": null}}, {"review": {"des": "The food.......AMAZING SND AUTHENTIC.<br>The door greeter......amazingly he kept the order of everyone coming to eat. 1 hour and 15 minutes (but we waited a little under an hour)<br>For it being my first time, I'll most definitely come back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/827UXWFvWIPFyY4PrkoQ6w/348s.jpg", "caption": "I'm a big fella.....this is only a half pounder and it still got my full with some to take out."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xaLdcXa_cWjKJhu36hbZnA/168s.jpg", "caption": "Enjoying this moment with my with.....1st timers but going to be repeaters."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2k9jgIqFfibajQh7rFIV4g/168s.jpg", "caption": "Mediterranean bread is super delicious."}]}}, {"review": {"des": "Such a quaint place with some history. This place has been there forever and is such a great local spot. FYI - they don't take reservations so be prepared to wait. They don't even call you on your phone, so you actually need to be there. <br><br>For food, we tried the Mediterranean flatbread and the famous pizza pot pies. <br><br>The Mediterranean bread was delicious. It was soft and fluffy and seasoned perfectly. Ask for some olive oil on the side for an extra touch. <br><br>On to the famous pot pies. They have a veggie option and a meat option. There are one pounders and half pounders. We each got two meat half pounders. The server brings it out on a bowl and then flips it on a plate. It is quite the spread!! It was simply delicious. Filled with the best spices and meat. They also come with these whole portobello options that are a great addition. <br><br> Overall, be prepared to wait but you'll definitely be impressed. The service and ambiance is great.", "pics": null}}, {"review": {"des": "My daughter and I ordered carry-out from Chicago Pizza and Oven Grinder Company on a Sunday afternoon.  The place was super busy, but with good reason.  If you are in the area and have some time to dedicate, it's a must stop.  Their unique take on pizza is delightful.  Five stars CPOGC.  Thanks for the memories.", "pics": null}}, {"review": {"des": "Aww man...I was so excited about this place. Great location, cool place, and excellent service. Only one problem...the food. We waited over an hour to get a table but didn't mind...enjoyed an icy cold beer at the crowded little bar while we waited. I also enjoyed/loved the Mediterranean Bread. But the food...my vegetarian grinder was huge but not that good. In fact, it was a little mushy. I doubt I'll go back but if you go, be prepared to wait for a table...it's a tiny little place...and maybe stop at the bread. :/", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cYGs_2qzwbb-wqdVeoFjgA/348s.jpg", "caption": "Mediterranean Bread"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nRpbEc-Z6xqNO264qfrGfg/168s.jpg", "caption": "Cozy lil bar"}]}}, {"review": {"des": "When ever I'm visiting Chicago I HAVE TO HAVE PIZZA.  I usually go to the same type of Chicago style places such as Gino's, Giro's, Uno and Lou's.  <br><br>I was told by a local about this place last time I was here and out it on my \"to do\" list. <br><br>WOW!  This stuff is amazing.  The service, quality of pizza and drinks section is outstanding.  This will be my \"go to\" from now on when visiting. <br><br>ps- can you ad a location to Las Vegas???", "pics": null}}, {"review": {"des": "I love the food!! Wait time is extremely long, about 3-4 his. I would give it 5 stars if they took reservations.", "pics": null}}, {"review": {"des": "Hubby and I were curious about this place so we decided to come here on a Saturday for dinner. It was only the two of us but it was a 2.5 hour wait!<br><br>We both ordered the pizza pot pie and shared the Mediterranean bread. The bread was definitely good but the pizza pot pie was worthy of the wait. It was super cheesy (yum) and a nice different spin on pizza.", "pics": null}}, {"review": {"des": "Every time I am in Chicago I have wanted to eat here, but the wait was always so crazy. On our way back to the Mitten this Labor Day we looked the place up to find they were in fact open and earlier than normal. On a whim we went and to my shock ended up getting sat immediately. My guess is most people assumed they would be closed for the Holiday because as we were on our way out there was a pretty decent line.<br><br>The concept of the Pizza Pot Pie seems so simple, but the end result is like a gift from the Heavens. I was seriously in tears of joy as I cut in and took my first taste. Bite after bite I sat there with the biggest grin on my face and I enjoyed each and every morsel. My only complaint is that I have to drive five hours to get one. That and refills on Pop are full price. I get it, they are trying to be old school, but it is 2018 and free refills are pretty much a standard nowadays. <br><br>Do yourself a favor and try this place out if you are nearby, but be sure to bring cash as they do not accept credit cards.", "pics": null}}, {"review": {"des": "We were told to come here after visiting the Lincoln Park Zoo, by a local. They told us to get the Mediterranean flatbread and salad,  plus the famous pizza pot pie. When we got there, we were told 45min to an hour, but were seated in 25min. We ordered the sm Chef salad, Mediterranean flatbread and a half pound pizza pot pie. The salad was great, they bring 3 dressings (sour cream garlic, sweet and sour poppy seed and vinaigrette) they are all good and were told to mix the 1st 2. I couldn't decide which was the best. The flatbread was huge, maybe 18\" diameter, they sell the seasoning which is great on everything! The pizza pot pie was good, I was expecting more though. I would definitely come back and get the salad (maybe next time with meat) and flatbread and would be content without the pizza. Really cute atmosphere,  quaint  booths,  the staff was great, our server Mallory was awesome! Btw, they say this former  house was used as a lookout spot for the St. Valentine's Day Massacre in a building that was across the street (demolished in '67).", "pics": null}}, {"review": {"des": "I give 4 stars for the food, friendly staff and ambiance. The pot pizza pies were excellent but their famous Mediterranean bread seemed too dry (a side of marinara sauce for dipping would improve it). <br>2-3 stars for the inconvenience of no reservations and no electronic notification when table ready (no texting  or buzzer) with average wait times of 1.25-1.45 hours. Also no obvious notification in windows/door or before check arrival that it is CASH only, no credit cards.", "pics": null}}, {"review": {"des": "This place is a must if you're visiting Chicago and you enjoy food. Everything had such good flavor and fresh ingredients! We tried the Mediterranean bread, chef salad and pizza pot pie. Our server was excellent and friendly as well. There were a total of 8 in my party and the food didn't take long at all. We will definitely be back! One thing to know if you don't already is that they only take cash as payment.", "pics": null}}, {"review": {"des": "I'm convinced Chicago is trying to make me fat with all this great food. With that being said...DEFINITELY make a visit to Chicago Pizza and Oven Grinder Company! We got there shortly after they opened and were seated immediately. Our server brought his A game the entire visit with his friendly demeanor, strong knowledge of menu, and attention to detail. We started with the Mediterranean Bread which was great but had to be careful that I didn't eat too much as to save room for the main dish! The Pizza Pot Pie was everything I anticipated and more. It was bursting with flavor and as you can imagine a half pound of it will fill you up pretty good. If you need ideas on how to walk it off head on over to the Lincoln Park Zoo across the street. Another favorite food spot added to my list that will be mandatory next time I am in the Chi!", "pics": null}}, {"review": {"des": "A magical and unique place because of the things that make it a Chicago institution. I do have to comment that it's in Lincoln Park, walking distance from the zoo, nestled in the basement (like Geja's). It's cash only so beware of this to avoid any inconveniences. <br><br>The dark wood booths remind you of Barnaby's or your local Irish pub. But the salad and the sweet poppy seed dressing or garlic - that's special. And the Mediterranean bread with all of the seasonings and cheese on top - wow, comfort food at its best!<br><br>Finally the pizza pie comes out in a bowl and make sure to get the full pounder, you can always take home whatever you don't finish. I've been eating pizza all over this globe and this is the only place that serves a pizza pie in a bowl! What that leaves you with is a ton of melted cheese, a beautiful sauce and mushrooms and sausage to make it all the perfect bite. <br><br>I may have had a grinder and those are very good as well. After your meal, walk back to the zoo and that's Chicago at its finest.", "pics": null}}, {"review": {"des": "One of my favorites. You have to try them at least once just for the pizza pot pie! Come early or you may have a wait, but it will be worth it. I came early before they opened on a Saturday and discovered they opened 30 minutes earlier, which was a nice surprise. We were seated immediately and ordered the garlic bread and two half pound pot pies. It was delicious as usual!", "pics": null}}, {"review": {"des": "My first time here was in 95. We came for my High School graduation dinner. Best pizza ever. Your opinion doesn't matter if you've never been. Try the grinders, only if you've had the pizza! Shout out to the salad dressings!! You know if you've been.", "pics": null}}, {"review": {"des": "I saw the Insider food video of the pizza pot pie and I forgot about it. Then I came to Chicago and a friend mentioned the pizza pot pie, and I knew I had to try it. Then I had it with my boyfriend, who liked pizza pot pie more than the deep dish pizza. If there's a video for it, a local talked about it, and a tourist loved it, maybe you should give it a try too!<br>The waiter was very knowledgeable and gave us tips on what to order. Initially we wanted to share a 1lb pizza with a large salad, but the waiter expertly advised us to get two 1/2lb pizzas with a small salad. He was sooooo on point because it was more than enough food. The pizza came out piping hot and very cheesy. Even with a 1/2lb pizza pot pie, we both had leftovers because the salad was big. It was a small order but plenty for two people.<br>There are some quirks to this place. For one, you can't leave your name or number when you first go in. In fact, the host won't even ask for your name. He just tells you to wait around until he calls you. This makes it very inconvenient because you have to set aside a lot of time to dine here. On a thursday afternoon, the wait time was around 1.5 hours. Then the pizza pot pie takes around 45min to make and bake. Plus all the time for reading the menu, waiting for the waiter, eating sides, etc, it's around a 3hr dining experience here! Another quirk is the salad is hard to assemble. The menu said the salad was crafted by salad professionals (something like that, don't remember the exact wording lol) but it didn't seem that fancy to me. The tomatoes were huge and only cut into quarters, there were only two pieces of cucumber but there was a ton of red onion, and the dressing and seasoning were put on the side. Overall it was hard to assemble and hard to eat. <br>TIP: they have frozen pot pies for sale!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ngs5EHTdsrH7h_1BnyVpRg/348s.jpg", "caption": "Cheese pull on that pizza pot pie"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aRc0e9l8w69X7tFvlBK16w/168s.jpg", "caption": "Salad that you had to assemble yourself"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lvzFWs9ezZg2dAZLQXxOhw/168s.jpg", "caption": "Very small restaurant in the middle of apartment buildings"}]}}, {"review": {"des": "This place had to be one of the best spots I have been to. The pizza is amazing beyond this world I must say. It's a small location it almost seems like it's a basement. The decor is nice the table and seating area looks a bit crowded but they know how to position every seat. <br>As you walk in the front entrance is usually packed as customers wait to be seated. We arrived around 830pm as this place does not take reservations we had to wait. Waited almost an hour, totally worth the wait. <br>The pot pie concept is a great idea. It looks like a stuffed pie  but filled with yumminess. I guarantee you will not be disappointed here. I will return to try out the other different types of pies they have. <br>P.S this is a cash only establishment.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MpDmrO0lOddv9Qa-Dfnn6w/348s.jpg", "caption": "After meal for taste buds."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tmBF-8vSH6rvhchkql8dcw/168s.jpg", "caption": "The insides."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mXJZOghNrlk1wnDBdlzVWw/168s.jpg", "caption": "So cheesy"}]}}, {"review": {"des": "I ordered the pizza pot pie (half Lb) and it was perfect for me! I like pork, so I enjoyed the meat sauce. I love cheese, and there was plenty of it. I also like mushrooms, I wish they had put more lol. The dough was fresh, very good texture. The only think I did was to sprinkle pepper to my pie, and I thought it tasted delicious. The wait was 40 minutes (I sat in the bar) and it took 20 more minutes to get my order. Staff was super friendly. Oh! Be aware they only take cash (but there is an ATM inside).<br>All those are my reasons for the four stars :-)", "pics": null}}, {"review": {"des": "Not worth the 2 hour wait or the cost.  Sauce is bitter tasting on the pizza and lacked cheese. On a positive note the crust was tasty. Pizanos is still our Chicago favorite.", "pics": null}}, {"review": {"des": "HOLY MEATBALLS. This place is amazing !!! I've been looking at this place for at least three years and it's been on my \"foodie list\" for just about forever. I finally got to try it and it did NOT disappoint. Our app was the med bread and holy cow was it insane! They have two types of dipping sauces to go with it, ones a creamy white one and the other is like a poppy seed dip that is kind of tangy. SO good! I got the 1/2 pizza pot pie meat style and I've never tasted something so yummy. They have every topping imaginable on your table from parm to Italian herbs and hot pepper flakes. Our server marissa was outstanding! So sweet and so on top of things ! I cannot wait to go back. * They do not take reservations* I went on a Wednesday @ 6:30 and there was a line outside the door. They do offer seating for large groups but it is limited, but again... so worth it! Just the smell of the restaurant is yelp worthy lol", "pics": null}}, {"review": {"des": "Finally got to try this place after being in Chicago for two years! The wait is always around 2 hours long, no matter what time of the day you go. My boyfriend bikes over and put our name down, and we walked over about an hour later. Our timing was perfect and we got to sit down in 5 minutes after arriving. We ordered a bottle of wine ($26) and started off with their chefs salad ($13). The chefs salad was unfortunately mostly iceberg lettuce with some tomatoes, raw peppers, cucumbers, artichoke and onions on top. There was way more lettuce than toppings, however both dressings (sweet poppyseed and sour cream garlic) were good. We then decided split a half pound pizza pot pie ($13) and a meatball oven grinder ($15). The pizza pot pie was incredibly good from the fillings all the way to the crust. The pizza was very cheese heavy with a super thick layer of cheese throughout. And meatball sub was huge!! And filled with giant meatballs with peppers and crusty bread.  Overall, this place is a must-try in Chicago. Definitely expect a long wait but it's worth it!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0vIqeyRx995XQNotCLtzmw/348s.jpg", "caption": "Pizza Pot Pie"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ue8GK1-5WD-3lkPcOrtFEw/168s.jpg", "caption": "Chef 's Salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/P7ivER15qeEzrr_MDbRslg/168s.jpg", "caption": "Meatball Grinder"}]}}, {"review": {"des": "This place was so worth the hour and a half wait!!! You can always order a drink or two or three while you wait for a table. <br>The place is small. So not the best place for a large group. <br>The food comes out pretty quick. Read over the menu before you seat <br>Also I deserved while waiting for the restroom...If you walk to the back you can order your food to go from one of the servers.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gkvPl6cHY78p1bhOTkV9yA/348s.jpg", "caption": "Patiently waiting for our table"}]}}, {"review": {"des": "Unfortunately, a place this popular and with this many reviews sort of almost defeats writing about- one star or five stars won't put a dent in its rating, but regardless of that, I'm going to let you know what to expect when you're expecting- your pizza.<br><br>Dimly lit and tiny, this old-timesque restaurant kind of is a mix between the bar from \"Cheers\" and Elks Lodge and I mean that in the most loving way possible.<br><br>Like everyone else I'm sure has mentioned you're not going to just walk in and sit down at your table. No matter what time of day your way is going to be at least two hours. Yes, at least.  Just be patient. It's worth it, I swear.<br><br>So Chicago Pizza is known for their pot pie pizza. They even tell you, if you're coming here there is no reason to order any other type of pizza. It's a deep dish pizza cooked over a bowl and then flipped. When flipped, the cheese is now on top of the pizza kind of like magic.<br><br>It's a meat sauce that can come with or without mushrooms- I chose without. Wheat or white dough is available. The pizza comes in two size: half pound and one pound. Half pound is around $12.50 and a pound is double the price. The pizza takes about 30 minutes to bake so add that to your overall wait time.<br><br>But you guys, when it finally arrives you'll devour it immediately like I did. The sauce is like a bolognese, it's so delicious! Sweet with a little spice. The sausage in the pizza is phenomenal. Like, I know I waited two hours for this but I totally ate it in three minutes or less. <br><br>Wear comfy shoes while you stand and wait. It's worth it, believe me.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OBrfbQleRRM3s670gOtoBQ/168s.jpg", "caption": "Half pounder"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/T-a_9LLHmrhLdZUHxbDClw/168s.jpg", "caption": "Half pounder"}]}}, {"review": {"des": "I mean, there isn't much to say that hasn't already been said about this \"as perfect as it gets\" Chicago institution.   <br><br>Let me start off by saying that I am really not a fan of Chicago deep dish pizza.  It's often kinda liquidy, too chewy, etc.   This place takes everything I don't like about it and literally turns it upside down.  The pizza pot pie is amazing, unique and fun.  The Greek salad was huge, flavorful and had amazing homemade dressings.   The bread was even better than amazing with tons of great seasoning.   I couldn't have imagined a more perfect meal if I tried.  <br><br>Service was just perfect.  Friendly, quick, helpful and attentive.  The restaurant is cute, retro and quaint.  Exactly how you want it to be! <br><br>Yeah - the wait times can suck.  I got there around 9:30pm on a Sunday, was quoted 45 minutes and ended up waiting about 25.   There is valet parking available in front, or you are going to have to circle and possibly park a bit away.   <br><br>Whatever you do, go here when you are in Chicago.  You won't regret it.", "pics": null}}, {"review": {"des": "No need to flip out--Chicago Pizza and Oven Grinder Company will do that for you. Just order its Pizza Pot Pie. Your server will dump the yummy contents of your pizza into a dough bowl, right before your eyes!<br><br>While visiting a friend in Chicago two weeks ago, I went back to one of my favorite restaurant offerings in the city. Sitting in a booth surrounded by wood paneled walls straight from a homey lodge, we began with the Mediterranean Bread. It's something different than your typical carb-filled starter. The thin rounded offering (adorned with seasoning) will take over the plate. But don't let it take over your appetite. Not totally.<br><br>For your main course, the Pizza Pot Pie (Half-Pounder) will do, especially if you've loaded up on bread beforehand. You'll probably leave with a new pizza experience, unless you're a returning visitor. (And let's be honest: at some point, you will be a returning visitor.)<br><br>Can't get enough while you're there? Bring a Pizza Pot Pie (frozen) back to your place and enjoy it another time.", "pics": null}}, {"review": {"des": "Where can I start... amazing amazing amazing.<br><br>The wait I hear could be up to 2 hours or more and they don't take reservations. It's because the seating is very limited and it takes about 30 minutes per pizza. P.s. you definitely have to get a pizza its their staple item. I also got a sub and it was HUMONGOUS so definitely be prepared to share. Overall it was a very Chicago Italian style place. Very quaint and rustic. Great customer service and very informative.", "pics": null}}, {"review": {"des": "This place has great pizza.  The buttery crust melts in your mouth. If you want a healthier option whole wheat crust is available. I would recommend going all in and getting the butter crust.  If you don't eat pork ask for a beef patty.  It's only $3, chop it up and throw it in your pizza.   The drinks are economical.  I think $8 bucks for a top shelf margarita is an excellent deal.  This is the spot.", "pics": null}}, {"review": {"des": "You come here for the experience. The experience of something not made anywhere else. A cute looking \"dough mushroom\" that is flipped before your eyes and reveals itself stuffed with all the pizza deliciousness.<br>They open at 4pm and there is always a line. Dont come hungry and expect a long wait (1-3hrs)-it is \"famous\" after all. You can ask for drinks while you wait and take them outside. We just walked over to the zoo since we knew it would be over an hour wait. They dont have multiple options for the pot pie. They have in essence 2-Vegeterian or Meaty, Mushroom or no Mushroom, Wheat or White dough. The Pizza pot pie is good, but so is regular pizza  oh and CASH ONLY. They do have an ATM", "pics": null}}, {"review": {"des": "Trademarked and apparently patent , Chicago pizza and oven grinder company serves unconventional pizza. It's not Chicago, nor is it New York or Sicilian.<br><br>What is it?<br><br>Whatever it is, it's damn good. Indeed, Chicago pizza and oven grinder company are the Forefathers of what I call the 'platypus pizza'<br><br>Not exactly pizza; not exactly pie; not exactly a bread bowl; not exactly a calzone. And like Faith No More's hit song epic, whatever this is, \"it is it!\"<br><br>What I can tell you is the homemade meat sauce with uncut mushrooms half pounder pie is precisely it. Come here on a Wednesday night for a chance to dine without fearing long lines .", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7U_FN3eobixvrIerMR1HCA/348s.jpg", "caption": "Platypus pizza"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ed28waYK2TLfrS0nTHGHNA/168s.jpg", "caption": "Before turned over"}]}}, {"review": {"des": "Delicious Mediterrean Bread and Awesome salad dressings . Wait was about and hour and 10 min not bad . Def an experience", "pics": null}}, {"review": {"des": "We planned to have dinner here after seeing the food network video of the pizza pot pie. We put our name on the list at 4:30 on a Sunday and the wait was 2 hours, but we had heard so many great things that we decided to stick it out. We ended up waiting about an hour and 45 minutes for a table, but it was well worth the wait. <br><br>Tyler was our server and he was excellent! He was so knowledgeable of the menu and took great care of us. In addition, there are multiple servers running around ensuring water glasses are full and tables are kept clean.<br><br>We had the great American salad (small size is big enough to feed 4 people!! See pic below) and two half pound pizza pot pies. The salad dressings were very good, they bring you out 3 homemade dressings for the table. We mixed together the garlic sour cream and poppyseed dressings for a sweet and savory touch at the Tylers recommendation and it was awesome. <br><br>And the pizza pot pies lived up to the hype by far. I could live the rest of my life on the crust alone and be happy, it was so flavorful and crispy but light. It took everything I had not to eat the entire thing in one sitting after already being full from the 4 person salad mentioned before.", "pics": null}}, {"review": {"des": "I'm not even really a pizza fan but this is worth all the rave. The service was impeccable and the pot pie was as good as they say it is. Let's be real though, you didn't come here to see if they were good. You came here to convince someone else to come with you. <br><br>What? You say you really came here to look at videos of cheesy pizza pot pies. I've got you covered there too.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nOPax9h3tzhfdjX84HtMlw/348s.jpg", "caption": "Om nom nom."}]}}, {"review": {"des": "Wow. Wow. Wow. Stopping by Chicago Pizza And Over Grinder may have been one of the best food decisions I've ever made! I was in Chicago for work when a friend recommended that I try this place. It's so good that she went two days in a row, she said. She also said to go early so I went \"early\" at 5:30pm after my conference. The wait was already 1 hour for 1 person but my friend said it was a must-eat place so I decided to rough it at the bar. A glass of wine, friendly chit-chat, and 80 minutes later, I was seated. <br><br>I ordered a small salad and a 1/2 pound pizza pot pie and anxiously waited my meal. My server was friendly and promptly brought out my salad. It's just a salad, how could it be, right? Wrong. The two dressings (one tangy with poppy and one creamy) mixed together was salad dressing heaven!<br><br>Not too long after, my pot pie arrived. My server flipped it over and I had heart-eyes for the ooey-gooey cheesy goodness. The crust was crispy and warm and the meat sauce was delicious and not too salty. If I wasn't travelling alone, I'd also order the Mediterranean bread (almost considered asking my neighbor table for a bite to try).<br><br>A week later, and I'm stilling talking about and dreaming of this pot pie. WELL WORTH THE WAIT (though I overheard a gal say she once waited four hours -- dedication!). <br><br>Go on a weekday and early. Be prepared to wait. Grab a drink at the bar. AND ORDER THE POT PIE.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JcKTP83C_jsGZ7y10Elfhg/348s.jpg", "caption": "1/2 pounder pot pie and small salad (photo taken after half of the salad was eaten!)"}]}}, {"review": {"des": "Mediteran flat bread was a little bit dry. Tried to speak to a manager and explained to him that this is not how it is served in the Mediterranean<br>(Guess where I'm from) and ask for sour cream or something, in a very polite  manner, but rejected. <br>+ Ambient<br>+ Great service from the waitress<br>- Dry Mediterranean flat bread :)<br>- Customer is not always right :)<br>- Cash only <br>- Long wait time", "pics": null}}, {"review": {"des": "I really loved this place, the service, food and prices are excellent...But you have to be aware of these \"minor details\" in order to better enjoy your visit to this restaurant:<br><br>1) It is cash only. They do have an ATM at the entrance but that area gets a little crowded between the people waiting for a table, the people waiting to use the ATM and the people leaving the restaurant.<br><br>2) You can wait for your table at the bar, but they won't serve you food at the bar, just drinks.<br><br>3) The salad dressings are amazingly good, the cheese is fantastic, the bread...all the food is excellent, but definitely the star of the menu in my opinion is the pizza sauce, but sadly if you request more sauce they won't sell it to you...not even a little side order of pizza sauce...I found that awkward and a little upsetting. Still, I really enjoyed this place.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nke63XLsVA-xQPVX02gFeQ/348s.jpg", "caption": "\"Small\" salad is huge!"}]}}, {"review": {"des": "I've been wanting to try this locally famous spot for some time now.  First of all...cash only!  There's an ATM on-site. Second...there is a wait.  There is always a wait. We waited well over an hour and a half.  Long enough for us to walk over to the zoo and check out the festival happening and then come back and tour the antique lighting store across from the restaurant.  Third...the food is good!  It's worth the wait.  I had to try the Mediterranean Bread and Pizza Pot Pie.  Between the two of those, I was stuffed!  The Mediterranean Bread is an app and gigantic!  The 1/2 lb pot pie was more than enough to have leftovers!  They have a full bar and the service was excellent.  I expected to be rushed because the place is small and they have so many people waiting...they are literally everywhere on Clark St waiting for their seat, but I wasn't rushed at all.  Safe area, lots of things to walk around and look at while you wait!  Prices are decent.  Two pizza pot pies, Mediterranean Pizza, a beer and an Old Fashioned for less than $60.  Atmosphere is kinda dark and pretty crowded.  They only have about 25-30 tables!  Don't miss this spot!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/36mnRBc0VoYrHnN6lE9knQ/168s.jpg", "caption": "Mediterranean Bread"}]}}, {"review": {"des": "Went here around noon on a Saturday. When I arrived there was an hour and 20 min wait. They just wrote down your name, not phone number, so you have to be ready when your time is up because there were so many people waiting in the entrance area. They are also cash only. My friend and I decided we would go to the Starbucks at the end of the block to grab some coffee while we waited because it was a little claustrophobic waiting in the front entrance. And an hour and 20 min later was the exact time when our name was called. We ordered some beer and the Mediterranean bread as a starter and it was huge and very delicious. We took half of it home because we didn't want to fill up on the bread before our meal. The menu says the bread is for 2-4 people to share. I ordered the classic pizza pot pie, and my friend, who is a little bit of a picky eater, got the vegetarian option without mushrooms (so basically cheese, green peppers, and sauce). Takes about 30-40 min after ordering to cook so leave room in your schedule for the long wait outside and the wait for the food. Overall worth the wait! Very filling and we had lots of left overs to take home and enjoy the next day.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BSRlJ6FE7n-qAt-5fDidZQ/168s.jpg", "caption": "Mediterranean bread"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ltMKyVTqls-x_iYCLgx7Lw/168s.jpg", "caption": "Pizza pot pie"}]}}, {"review": {"des": "Pizza that looks like a Huge Mushroom Bowl!<br>It was simply easy to eat and not too messy. <br><br>The Bread with seasonings was delicious and fresh<br><br>Delicious eats are here plus they have a whole wheat bread option as well I believe. <br><br>Very Yummy!!!", "pics": null}}, {"review": {"des": "We were talking about going here for months and finally were able to get a group together during the coldest day of the year. The wait was crazy! I think we waited for an hour before we got a table. So be prepared to wait.<br><br>Food was good. I could of shared my pizza with my husband since each one is pretty decent size and with all the sides we got it was a carb fest overload party.<br><br>Would like to go back to get a sandwich. My girlfriend hasn't stopped talking about it since we went the first time.<br><br>The trick is to figure out what is the best time to go since they're a long line all the time.<br><br>Is it worth the wait, I'm not certain. It's decent but not sure if I really can wait for over an hour or two in the freezing below zero temps of Chicago. Maybe in October we can try it again.", "pics": null}}, {"review": {"des": "Returned here after many years and it was as good as I remembered! Our server  \"presented\" our bowls of pizza with finesse and was delightful. The wait was worth it!", "pics": null}}, {"review": {"des": "We went few Days ago and the wait was 3 hrs, we needed up having lunch at the place next door. Then we planned to have it for early lunch on Saturday, we arrived around 11 am (30mins before opening time) Resturant was almost half full.<br>We took the pot pie pizza, some people claimed it the original Chicago Pizza, I have done a lot of research to find an alternative to this place but haven't find any. The pizza was amazing and fresh, it took around 45mins to get ready. It's a must go if you are visiting Chicago", "pics": null}}, {"review": {"des": "The pizza pot pie is ok. I definitely wouldn't wait more than 25 minutes though to get in.  I don't love deep dish and I prefer pizza like Pequods and my friend really likes deep dish and we both agreed the pizza pot pie is just ok.  The meaty tomato sauce in the pizza is pretty good though. <br> Service is great and the people working there were very nice and attentive.  The Mediterranean bread is pretty good, but it would be even better with a dipping sauce or marinara sauce.", "pics": null}}, {"review": {"des": "This place was awesome! After knowing about it for 2 years, we finally decided to attempt to go and did not disappoint. While fully anticipating to wait a long time, we were pleasantly surprised to only wait 10 minutes for a table. Got there around 7PM on a Tuesday. <br><br>Service: waiter was super friendly and knowledgeable. Gave us all the right recommendations. <br><br>Got smaller salad to split for 2: the perfect amount. Mix the dressing!<br><br>Mediterranean bread: YES. Huge portion and we did not finish it but wanted to try. If I came back again, I'd forgo the bread.<br><br>Pizza pot pie: heck yes! The half pound is just the right size for one person. Since we had the bread, I couldn't finish it but would have if we just had salad before. <br><br>This place is super fun and a great experience!", "pics": null}}, {"review": {"des": "What is there to say about this place that hasn't been said by their twelve thousand reviews, the food network, every internet food guru, and your aunt on Facebook who shared that viral video of the pizza pot pie? I'm not sure. But I'm gonna add my two cents anyway, because this place is JUST THAT GOOD.<br><br>I never doubted that it lived up to the hype. They serve doughy bowls of cheese and sausage. There's no way that can go wrong. So when our BFFs, who were moving from Chicago to Tennessee, asked if we'd be interested in trying this place before they left for good, we didn't hesitate. We WERE taken aback to arrive at 8pm on a Tuesday night to find a 1 hr, 40 minute wait for a table of 5. But we persisted.<br><br>Thanks to my fellow yelpers, I knew that the front door guy wasn't going to take my name and simply memorized my place in line. But I was impressed with how lovely and friendly he was despite the throngs of hungry, anxious people around him. We had requested a table because the space was tiiiiight and we thought a booth might be too snug, and every time he had a booth that would fit us, he came and checked to make sure we still wanted to wait. After an hour, he came and got us for real. I was so excited I could barely stand it! Luckily, our server wasn't playing games and came and took our order for drinks + Mediterranean bread at the same time. I felt like I was going to be underwhelmed with what appeared to be a heavily seasoned, squishy tortilla, but boy was I wrong. It was DELICIOUS, and so fun to pull apart in a giant group. But let's be real, we were here for one thing: a giant dough bowl full of pizza. So we pressed on.<br><br>When he flipped my pizza over out of its bowl, I almost gasped. It was SO cheesy and ridiculously looking, I couldn't believe it. And the taste? I mean, it's not revolutionary. It's just really, REALLY freaking delicious. The portion is huge. It's hot. It's meaty. It's melty. It's tomato-y. It's everything you want in a pizza in a fun, delicious new format. The dough is chewy and irresistible. It's everything.<br><br>For five people to have dinner and an appetizer with all non-alcoholic drinks was $105. You can't even beat it. I wish I could go back tomorrow, but that prohibitively aggressive wait makes this a special occasion kind of joint - emphasis on special. So happy it lived up to the hype, and no faux travel blogger, viral FB video, or anything else could spoil the first-timer delight of Chicago Pizza and Oven Grinder!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SmUufu1thgAlv-vM-6uD5g/348s.jpg", "caption": "Mediterranean bread - so insanely well seasoned and delicious."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OGQZtc2BgskNpBLQ5pn7Qg/168s.jpg", "caption": "Our family of pot pies"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1RAdFbss-e7j4CdX065VoQ/168s.jpg", "caption": "The flipping of the pie!"}]}}, {"review": {"des": "This place has been on my bucket list for a few years now. Had the opportunity to go over the weekend and it definitely lived PAST its expectations. We got in around 9, and the wait was an hour (but that is typical for Oven Grinder). We sat at the bar and got a bottle of wine! Delish. To our surprise, we only had to wait 20 minutes before our table was ready! It was awesome. Then we started off with the mediterranean bread - IT WAS MASSIVE! The flavors were outstanding. <br>Next came the famous PIZZA POT PIE. I'm telling ya folks, it is all it's hyped up to be. Hot & flipped right at your table. The service was excellent and the place is an old Italian spot in Lincoln park. Make this a destination.<br><br>**P.S. Cash only, but there is an ATM.", "pics": null}}, {"review": {"des": "Holy crap ALL the food here was AMAZING. We ordered the salad (I think it was the chef's salad?), Mediterranean bread and the half-pound pizza pot pie with both sausage and mushrooms. First came our bread and the salad. You HAVE to order both of these. The salad is freaking amazing. I wanted to take home the dressings back to LA and now I regret not buying bottles of it! One was a sweet and sour poppyseed and the other was a sour cream garlic. Our server advised us to mix the two together and BAM! HELLA good dressing. I could actually eat this salad every damn day. The Mediterranean bread came out with the salad and it is HUGE. Sooooo soft, savory, extremely flavorful and just all around de-freakin-licious. <br><br>Our pot pie came out last and daaaaaayum. I was bummed I couldn't get a photo of the pot pie before the server cut it in half because it didn't look as appetizing but holy shiznit it tasted like pure cheese paradise. It tastes more similar to a lasagna than a pizza. So so sooooooooooo good. Ugh I wish I got a bigger size because I could definitely eat the whole thing.<br><br>The food is definitely 5 stars but I had to subtract one star because it's cash only and they charge the drinks per glass (like fountain drinks) which I thought was interesting. If you visit Chicago, pizza pot pie is a MUST!", "pics": null}}, {"review": {"des": "I would honestly give this place 3.5 stars, rather than 4. Just because there was pretty much a 2 hour wait till my boo and I were able to eat. However, after that 2 hours the food was to die for!!!! The pizza was so delicious and worth every second of waiting. Also, they brought out little chocolates and a candle for my bday. Too sweet and cute.", "pics": null}}, {"review": {"des": "Best pizza place in Chicago! Unique atmosphere, delicious food. Ordered Chefs Salad to start and pizza pot pie. Our waiter Tyler was sweet and very charismatic- he made the experience even more enjoyable. We got here early and beat the crowd. Recommend coming during the week to avoid long wait times.", "pics": null}}, {"review": {"des": "I must give this place a 5 star for the food in general and 2 star for waiting and CASH only place.<br><br>On a Sunday after noon this place was packed. We waited a little over an hour to be seated. The place is small and tight. <br>The pizza was amazingly delicious! The meat souce was better tasting than the vegetable one. I had the half pounder and couldn't finish it since it's so filling. You must have the Mediterranean bread, It's so soft and tasty!<br>For drinks, I had a hot apple cider with rum. My son had a kiddy cherry drink and he loved it. For desert we had the ice scream. The ice scream came with crums of some kind of nut. It was so deliciously tasty.<br><br>Over all we loved the food! Our waiter was so prompt and attentive. I do recommend this place and maybe find out when is not so busy. <br><br>Oh I almost forgot this place is cash only. I can't believe there still places with cash only in  busy Chicago. Besides the long waiting, cash is another thing I don't like.", "pics": null}}, {"review": {"des": "This restaurant is SO popular. It opens for dinner at 4 PM, and a lot of people will be waiting to get in right when it opens. After the first round of people, the wait time dwindles to maybe 30 minutes on average until dinner time at around 6:30pm-7pm, when there will be a ton of people and you will wait forever. The restaurant is pretty small, dimly lit, crowded, and loud, but it is a pretty unique atmosphere and good for groups.<br><br>For appetizers, we got the Mediterranean flatbread which is really good!! We also got the Italian style salad that had meatballs, ham, salami, and cheese surrounding it. They were both really good, but honestly they kind of filled me up too much before the main course.<br><br>The most famous item here is the pizza pot pie, which is super unique and you MUST try it. Get the half pound, because I don't know how anyone eats an entire pound of pizza. It's like a personal pizza, but very deep like a pot pie... that's all there is to it. It's full of sausage, cheese, red sauce, and whole mushrooms (you can customize with vegetarian, no mushrooms, the type of bread, etc). There's a nice thick layer of cheese on the top and a hearty serving of meat sauce below. It's definitely filling.<br><br>This place is kind of pricey, but I would recommend going at least once to try it out before you judge whether it's worth frequenting.", "pics": null}}, {"review": {"des": "Go to swim a bit up stream here. I bought into the pizza pot pie 100%. Talked about it. Showed others the food network piece about it. And scheduled business travel around the availability. First off 35-45 minute wait for a table of 1. Really! Secondly Cash only. Who does this.  3 rd the reason they are famous took 35 minutes from order to table. <br><br>For real when it hit the table the yeasty crust had me on the edge of my seat. Wow looked so good. Then 3 bites in it was so one note I got board. For real. Basil, oregano, garlic. Anything. I tried salt, chili, parm, spice mix nothing helped. It reminded me of a boring bolognese.  The sausage was over cooked a bit burnt. Seemed the flavor was riding on the sausage. Whole un cooked<br>Mushrooms, had to cut them after cutting a piece to eat. I love mushrooms. These were un seasoned and un cooked. <br><br>It looks nice and presents well. <br><br>Gotta pay for a valet as well btw. <br><br>I Let my family know i was crest falling with my experience. <br><br>While in Chicago go to one of the deep dish pie places. Get a sausage mushroom pie. You will enjoy more. .", "pics": null}}, {"review": {"des": "Words cannot even begin to the describe the amazingness that is: PIZZA POT PIE.<br><br>When I told my friend that I was visiting Chicago, this was the first thing she told me to try. When I saw what they were all about I knew I had to try this place! <br><br>Came here for my last dinner in Chicago. It was a Monday night and the weather was in the 30's so I so happy to find that this place was not busy at all. We walked right in, with no wait! <br><br>My boyfriend and I started off with the Mediterranean bread. Holyyyy that thing is huge! There was no way we could finish it, although I really wanted to. It was flavorful and delicious, but very large and filling. I wanted to save room for my pizza pot pie. <br><br>I got the sausage and mushroom pot pie each. There are only two different kinds of pot pie, one with sausage and mushrooms and one just mushrooms for your vegetarians out there. You can also pick between white or wheat for your crust. <br><br>It came to the table hot and fresh out of the oven. Our server was super nice and waited for me to get my phone ready to record him flip it. He explained everything as he was going through the motions. <br><br>Finally had my first bit. AH-MAZE-ZING! I dream about this now that I'm back in California. So freakin' good. Its your own individual pie, which was great because I did not want to share. Plus it came out super hot and fresh. The cheese pull was mouth watering. The filling was enough. Definitely a must try in Chicago.<br><br>The food here is great. I love it. I dream about it. Plus their staff is so welcoming, knowledgeable and attentive. Do yourself a favor and come here the next time you're in the area, you won't regret it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8Dp8Dulq4sB4s1bcpa03mQ/348s.jpg", "caption": "Origins"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GB_B_zwxzrMIyMjU5ZAebA/168s.jpg", "caption": "Mediterranean bread (hand in pic for size reference)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5ANG3t4163BGXxWZxbF-xw/168s.jpg", "caption": "Pizza pot pie"}]}}, {"review": {"des": "After years of hearing about this spot, I finally made time to go.  Yes there's a long wait, but so what, you do it at Au Cheval, Peaquods and a million other places.  You know the drill.  Don't show up starving, have a drink or two and make new friends.  <br><br>Service:  Staff was friendly, they were generally quick about everything, all needs were met.<br><br>Food:  So we started with this flat bread, I'm blanking on the name, but it was pretty amazing.  It's think but be warned it's actually quite filling and it's a solid amount of food.  We also had the salad.  Nothing to write home about, standard fair but the ingredients were fresh tasting.  The pies.  So obviously what they do here is a bit different.  If you're expecting a traditional pizza do a bit more research.  The pie was tasty, although not amazing.  The best way I can describe it is like a pot pie filled with spaghetti meat sauce.  It was fine, fairly tasty, but it doesn't really hit that pizza craving if that's what you're looking for.  Not sure I could wait in line here regularly, but I certainly wouldn't dissuade anyone from trying it.", "pics": null}}, {"review": {"des": "I never ever take Chicago pizza for granted, and Chicago Pizza and Oven Grinder will forever remind me of that bold statement.<br><br>The long wait is real, but don't panic over the extension of your stay.  The ticking minutes are really just part of what will be the best experiences you could ever satisfy yourself with from Chicago.  Inside, narrow booths hug knotted wood walls that weave throughout the room, bringing you a sense of European influence.  Almost as if you're sitting in a restaurant pulled from a German magazine, the darkness of the restaurant is calming, and melts any tension you may have burrowed from the anticipated wait.  The simpleness of the tables are brushed with thin white vases, breathing two healthy red carnations which are accompanied by metal chromed pizza shakers.   <br><br>The Pizza:  Her divine holiness is presented to you in a white ceramic bowl it was cooked in, and like pulling a rabbit out of a hat, the waiter flips the pot pie over to reveal what dreams are made of.  Like eating a lasagna, your fork and knife will criss cross back and forth like the legs of a ballerina, and you'll want to eat this slow.  You can taste the melted butter from the airy crust and the white cheese flows like lava.  For the sauce, it has the taste and consistency of marinara and like finding jewels in a treasure chest, get it with mushrooms.  The large, white button gems are meaty and soft, it adds another depth of flavor that this pie lives on.<br><br>The experience you have here is like taking a ride down a dark tunnel.  The light at the end is euphoric, and will make you appreciate the glorious city we live in.<br><br>100 percent recommended.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/46WAsWuhajEnXNgtREQo4A/168s.jpg", "caption": "Half Pound with Mushrooms"}]}}, {"review": {"des": "I've thought about this place ever since I saw it featured on food network. It was my number one priority to eat here for my recent travel to Chicago. Give me pizza pot pie plz!<br><br>I ordered the half-pounder pot pie with meat/mushroom sauce to-go because a two hour wait to dine-in is two hours too long for me to get my pizza on. Plus, Molly's cupcakes was in the area so I made a stop there before heading to pick up my order. <br><br>The crust was doughy and soft. The sauce plentiful and full of meat/mushrooms. And there was just the right amount of cheese to please. <br><br>What lactose intolerant problem? I'd definitely order it again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9bB67Ad9W0VsDGht5x_PSw/168s.jpg", "caption": "Half pounder meat sauce with mushrooms"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/haYbrhpeR5vAYAend-miAA/168s.jpg", "caption": "Outside, where you can't see the long wait"}]}}, {"review": {"des": "The Chicago pot pie is definitely something you have to try once in your lifetime! It is located in this tiny brick building, which has definitely been around for a long time. If you pass by this area you'll always see a LONG line of people waiting. It's always the same guy that \"takes down\" your name, he has been around for a very long time and you go up to him to tell him your name. He remembers everyone and your place on the waiting list without writing it down! Impressive! We waited for about 2 1/2 hours and finally got seated. We ordered each a 1/2 pound of the pizza pot pies, Mediterranean bread and the salad. The pizza pot pies took a while to come out maybe 30 mins. The Mediterranean bread was amazing and a must get! As for the pizza pot pie, it was definitely overhyped. The whole concept of a pizza being a pot pie is cool but the taste was too salty for my liking. It was definitely filling and the 1/2 pound was plenty for one person. Though I loved that the pizza was very cheesy, I'm not sure that I would come back and wait 2-3 hours for it. But four stars for the experience! <br>Oh! FYI this place is cash only!", "pics": null}}, {"review": {"des": "It's basically a pizza pot pie :)  Definitely something unique and yummy to try while visiting Chicago. While not \"true\" Chicago-style pizza, it should definitely be on the list of places to try when visiting the area.<br><br>The environment is warm and cozy, and the food is tasty.  The only downsides are the long wait for a table and they don't take credit cards, so I likely won't be back there for credit card reason alone, but it's worth grabbing some cash to experience it at least once. Would give this place 4-stars if they took credit cards. Who doesn't these days?", "pics": null}}, {"review": {"des": "After watching the clip about Chicago Pizza And Oven Grinder Company on Chicago's best, I, like many others decided to come here. I came in on a weekend evening, and so the wait time was about 2 hours for a table of two. <br><br>When I got seated, my first impression was that the place was very noisy and cramped, it was a bit difficult to have a normal conversation. The server was very friendly, though and explained the menu very well, and we managed to ignore the noise. Since we waited so long, we decided to order several things off the menu: anti pasto, mediterranean bread, the vegetarian oven grinder, and the tortoni for dessert. <br><br>The vegetarian oven grinder was very good, and I'd have it again, but it's definitely NOT worth a two hour wait. It just doesn't have that complex of a flavor. It's just cheese, bread, and some sauce that tastes good. Nothing was that amazing. <br><br>The other stuff ranged from OK to very bad. The mediterranean bread was OK. It was literally just a big piece of bread. The antipasto was also not bad either, but there was just way too much of it.  The Tortoni was awful though. I couldn't have more than a bite of it. The server noticed that I didn't like the dessert and generously took it off the bill, which was nice. <br><br>I probably won't come back, and if I do, I'll just order an oven grinder.  Skip everything else.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pwPhwz64Hq-w6dimCdlH0w/348s.jpg", "caption": "Middle of feeding."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5aNZjxapRTlVjy2fcILLMg/168s.jpg", "caption": "Vegetarian Oven Grinder post-flip and pre-feeding."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/j68BjCZMusZRW-qR75BG9A/168s.jpg", "caption": "Crowd on a Friday evening."}]}}, {"review": {"des": "This place is so delicious. I can't even do it justice. Absolute LOVE the pizza pot pie that it's famous for having. No one does anything like this pizza. Just look at the picture. It's a wonderful sauce cooked in a bowl with cheese and a dough pie bowl over the top that the friendly staff will come to the table and turn upside down for you to dive into. It comes in a half pound or full one pound individual size. Vegetarian marinara sauce or meat sauce. Giant mushrooms that can be left out for those that don't live mushrooms. But the mushroom lovers I had with me the time before loved the huge 'shrooms!<br><br>The place is a quaint wooden chalet looking place. Don't think to have a quiet meal or delicate conversation cause when it's packed like usual, it's very loud and boisterous. But that just adds to the charm. <br><br>And the staff here. Always very friendly and helpful. Topping off your water. Checking in on you. Giving recommendations. It has a nice bar if you have to wait for a table. <br><br>Over all. Great place. And I can never take a picture before I start diving in. Lol", "pics": null}}, {"review": {"des": "It's legit and worth the hype! It's a delicious pizza pot pie that looks how it tastes and tastes how it looks!<br><br>Few things:<br>-The hours are limited on certain days, there will almost always be a wait.<br>-The pot pie pizza takes about 20/30 to cook.<br>-It's cash only.<br>-The salad isn't worth it, plan ahead on this.<br>-I'd suggest a snack before hand for the wait, the salad is over $10 and with the wait you'll end up paying for it if you don't eat something before hand.<br>-The zoo is near by, I went there for my 1:30hr wait to pass time.<br><br>The pizza pot pie isn't as heavy as it looks for whatever reason, half pounder should be enough for one person. The amount of cheese and dough makes it not too heavy in my opinion, it's perfect for how they constructed it. Lot of delicious flavor from this take on pizza. Go check them out, it's definitely worth it!", "pics": null}}, {"review": {"des": "Wife and I called the order in.  Place was packed.  Only cash accepted.  The pizza pie taste like a bread spaghetti bowl with cheese on top.  Nothing really popped for me.  It was an okay experience.  My wife loved the place though", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/I-dCLf1-QAc2u6_95aCgcQ/348s.jpg", "caption": "Here it is"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/U-zM6O5SBoIb7ZiFYiEd2Q/168s.jpg", "caption": "First bite"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-NYuVH9I0WUKF1ewvAhMTA/168s.jpg", "caption": "There it goes"}]}}, {"review": {"des": "Fantastic food, fantastic service! Not a traditional pizza joint, but it's something special that any local or out-of-towner should try. <br><br>Highly reccomend the pizza pot pie, the Mediterranean bread, and/or the Italian Festa salad.<br><br>Come half an hour before it opens or you'll end up waiting a while to be seated, and COME HUNGRY.", "pics": null}}, {"review": {"des": "Chicago pizza and oven grinders was amazing. I'm not saying they had the best \"pizza\" but they had the best dough I have ever had and because of that reason I'm giving it 5 stars and I rarely give places  5 stars but they had different kinds of dough and they were all amazing in their own way.", "pics": null}}, {"review": {"des": "Literally amazing. Worth all hype. Enough said. <br><br>We went at 4pm and were seated at about 5:45. Grabbed a drink nearby which was perfect! Be prepared to wait when you go, but know it's by far worth the wait. <br><br>Also- cash only so come prepared!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/L62wiPf8y7QdqK3C9J3-Ow/168s.jpg", "caption": "Mediterranean Bread"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/59jKC6ii28Vhmcw22wZmPg/168s.jpg", "caption": "Half serving of pizza pot pie"}]}}, {"review": {"des": "Was told it would be an hour wait. After an hour I was told it would be another 30 minute wait. After 30 minutes I was told it will be another 10. About two hours after arriving I'm finally seated. And while waiting I hear the host tell all other patrons it'll be an hour wait even though there are twice as many people waiting outside.<br><br>And how is it, in 2018, a restaurant still does not accept credit/debit cards. But conveniently have an ATM with a $3 charge up front. <br><br>The food was not worth the wait.", "pics": null}}, {"review": {"des": "Prepare to wait. We came here when it opened and still ended up waiting about a little over an hour. It was cool though because I always wanted to try this place. The pizza pie I had was pretty good. Good amount of cheese and sauce which I absolutely love. What made it like 3 times better was that crunchy seasoning thing they had on the table. I sprinkled every bite with that and red pepper flakes. It was so good we purchased a bottle of it to go!", "pics": null}}, {"review": {"des": "You can tell that this place is well managed and as a customer I appreciate that. <br><br>Not many places are so well managed so this places is defintely a breathe of fresh air. <br><br>First thing first, it's important to know this place only takes CASH. NO EXCEPTIONS! <br><br>They do have an ATM in the hallway upon entering, FYI. <br><br>I was greeted when I walked in, I was quickly seated. Not too long after being seated, I would assume he was the bus boy, he brought over water. He was wonderful, whenever something needed cleaned he would clean it. If my water got low he refilled it quickly. He did such a good job throughout my entire visit, I was so pleased by his service, not only was he professional but he was also really sweet! <br><br>Not too long after being seated my waiter came over. He was very friendly. He answered all my questions and made sure I was good throughout my entire visit. <br><br>He was never gone for too long, he was great. Very friendly and attentive. <br><br>I ordered the famous Pizza Pot Pie, with vegetable sauce. It took my pizza about 25-30 mins to come out after I ordered it... I'm pretty happy it wasn't an hour because for some reason that's what I was expecting after reading the reviews, but it didn't take that long. <br><br>I also order an appetizer because I hadn't eaten all day so I needed something to hold me down while my \"POT PIE\" was cooking. <br><br>My appetizer arrived about 5-7 mins after I ordered it. I stared at it for a good 5 mins, I kid you not! No im kidding! :D You'll understand what I mean when you see the photo of it! <br><br>But seriously my appetizer was called \"MEDITERRANEAN BREAD\".  It did its job of keeping me satisfied until my main dish arrived. <br><br>I stopped eating my bread after a while because I didn't want to get full on bread. The bread was ok, I feel like it should be paired with something, like a cheese or something, but as I said it was ok. Not bad, it's huge by the way. It's meant to feed more than one person so of course, I took alot of it home with me.  <br><br>When my pizza pot pie finally arrived, it looked just as I expected it to. It's such a cool,innovative dish. Very appealing to the eye. <br><br>I opted to add mushrooms to my pizza, once I got my pizza I regretted that decision. Mostly because they weren't the mushrooms you usually see on pizza. They were full size mushrooms. After a while I felt as if they were in the way. <br><br>As I bit into the pizza, I was pretty pleased with the cheese topping. That was the best part to me. The other parts of the pot pie was just ok to me. I was expecting something different with the crust but it was fine in combination with the sauce and cheese. I wish the pizza had more cheese, it seemed as if my cheese disappeared pretty quickly and I was only left with sauce, crust and mushrooms. <br><br>Overall I defintely recommend this place. Defintely, Defintely! The service is amazing and it's in a great neighborhood, where you could possibly score a free parking space, if your lucky!<br><br>Defintely try this place out, at least once. Add it to your bucket list! Ok?! :D", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bw42lI2OQmrp0QUAmf5blQ/168s.jpg", "caption": "Water with lemon. Very refreshing & delicious."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/stp1Pawrb2Hxy2_JDJjOWA/168s.jpg", "caption": "Pink lemonade (no free refills)"}]}}, {"review": {"des": "Chicago's BEST pizza by far!!! And I am a pizza connoisseur!!  We started off with the flat round bread (I can't remember the name of it). I always get the vegetarian option for my pie . Free parking is usually rough (but not impossible) to find unless you valet which is about $10. It's always the same guy who \"takes our name down\" to be seated. I don't know how he really remembers all the ppl there, but he somehow does.  I've never felt like anyone skipped us in line to be seated. Cash only establishment. The space is pretty tight, but who cares. I'd sit on someone's lap if I have to, to eat my pie.  It's seriously that good. The reheated leftovers are even a hit! It's a must try if you're in Chicago. <br><br>Oh! Take a few more seconds and read the story on the menu!!", "pics": null}}, {"review": {"des": "Talk about a step back in time. This place instantly takes you back with its vintage and beautiful wood work. The instant you set foot through the door. They greet every customer (and you suburbanites don't be afraid they don't take names). <br><br>At Oven Grinder they ensure your food is cooked to perfection. So please be aware if you are in a rush they are not the place to go. They make everything fresh to order. <br><br>My suggestions first make sure you have plenty of cash (cash only establishment). Second please order the veggie pot pie pizza. You'll thank me later. Then order any one of the salads and the garlic bread. <br><br>Hopefully, you've brought some friends with you because the salads are HUGE and the bread is too. Ask for extra of the poppy seed and garlic dressings. I can never get enough of those and in case your wondering yes I do lick the bowl .... it's just that good. <br><br>Lastly, enjoy all of that cheesy goodness of a pot pie pizza.", "pics": null}}, {"review": {"des": "We went to the restaurant st. Patrick's day and the wait was over 2hours long and I mean over 2hours no less.  It was fun because we were people watching and seen a lot of intoxicating people trying to walk straight or were falling.  Many intoxicated people were inside the restaurant taking over the one bathroom they have.   Thank God we went across the street to have desert and coffee to make our 21/2 hours long wait go faster.  The pizza is super delicious the bread is extremely soggy.   The meat choice is ground beef and you can add mushrooms.   I personally avoid mushrooms and just ordered the 1/2 LB meat pizza.  It was just like my meat Bolognese sauce.  I loved it and tons of delicious gooey cheese.  Since we went for desert first I was way too full to finish a small pizza.  <br><br>The manager came to our table and asked us how was the service and we suggested for them to ask for the phone number and call us.  The manager said \".there is no need for us to take up nor save up reservations because our customer love us and will NOT mind the wait time.  Our restaurant is too small and we can only accommodate so many people.  He also said it was a good idea\".  I think if they take your number and give you a call is an excellent idea because the restaurant is too small<br>To wait<br>Outside in the cold or too tiny to be crowded inside there is. No room.  Like I said I did not mind the wait this time because we went across the street to warm up to drink coffee and desert.  We saw that this restaurant losses too many customers because of the waiting list and you<br>Just have to come in and check in to see when you are<br>Next", "pics": null}}, {"review": {"des": "Honest review: pizza is gross just a forewarning. Let me explain the hassle of actually getting a pizza here is so irritating u will never come back even if u have no taste buds n like this crappy pizza. There is no reservations it is cash only. U give ur name n they say 2 hours they wont call u or let u give them ur number they dont care. My recommendation is to come on a weekday supper early or supper late do not come on a weekend or holiday will be crowded all day. Not only is actually getting a table a pain in the ass. The place is so small n dark if ur closterphobic u will not make it. There is a total of 18 booths so supper small then its so crowded youll have a bunch of people standing right where u sit so that means youll have fingers n peoples butt all over ur food. The service is so slow like so slow ask for extra waters cause u wont get a refill. I wouldnt come back if it was free n there was no wait the pizza is so gross.<br><br>Menu (oven grinders are sandwiches) theres only meat or veg pizzas with mushrooms or without mushrooms n the bus boy said u can pick between beef or pork but idk if its true<br><br>Meat pizza: (grosss) ive had a lot of pizzas in my life went to every pizza place in chicago. N this by far was the worst pizza i ever had even fast food has better pizza honesty. The crust is really bland n dry idk why they dont put seasoning on it. The sauce was so bland tastes like cannned tomatoe sauce needed seasoning badly. The only positive is theres a lot of cheese. U can make a better pizza at ur house js. My favorite deep dish pizza is the original ginos east. Then for thin crust bar siena", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Bemhh3zumCAaJmUubKwnXg/348s.jpg", "caption": "Bill"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2QMlF2WCWOcAhL-0QPdQcA/168s.jpg", "caption": "Free chocolates after ur meal"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/18cGZmaYuTOHS0S5-9Dgpg/168s.jpg", "caption": "Apple martini"}]}}, {"review": {"des": "Food is amazing, the wait sucked! Wish they had a better system of checking in like text option perhaps?? Also, should be posted everywhere cash only! Had no clue! Good part is there's an ATM on site bad part is the service charge!", "pics": null}}, {"review": {"des": "This place is worth the wait!  Grab a drink at the bar while you wait for your table.  The place is on the smaller side, feels a bit congested  but it has an old comfort feel to it.<br><br>The portions here are great size.  We ordered a half Chef's salad, The Mediterranean bread and the pizza pot pie.  They bring out a few different salad dressing options and mentioned to mix two of them together which was the sour cream garlic and sweet and sour poppyseed.  This salad dressing mixture is perfect, make sure to try it.  The Mediterranean bread is huge and definitely meant for Sharing.  The pizza pot pie is as delicious as it looks with a perfect mixture of sauce, cheese, sauasge, peppers and mushrooms.  Don't forget to capture a video of the server serving it at your table!!", "pics": null}}, {"review": {"des": "Eh, cool to go, nice thing to cross off your Chicago bucket list. It is nothing to complain about, but not sure it's worth the usual hour plus wait time. Mind you, this coming from someone who regularly waited in hour plus lines at Hot Doug's and Kumas, so let's be clear, there is definitely food worth waiting for, just not sure this is it.<br><br>It's an experience, affordable, adorable, cool Chicago history. Service was incredibly hospitable minus the fact that it's cash only and they don't split checks. That definitely makes it slightly less welcoming. You also feel the urge of the staff to turn over tables. <br><br>Good place to take out of town guests. Can't imagine it's a local hangout.", "pics": null}}]}