{"name": "cindys-chicago", "reviews": [{"review": {"des": "Drinks are delicious. Lots of different options. Many mocktail options as well. Beautiful bar inside and also a bar outside. The bar in the balcony closes earlier than the bar inside, so order first then find a spot in the balcony just in case. <br><br>Most tables are usually reserved during rush hours, though seats by the bar are first come first serve. There are a few seats in the balcony as well, which has a panoramic view of Millennium Park and Lake Michigan. As you can imagine the balcony is pretty packed most of the time, but if you hang out for a while you'll eventually get a standing room view. Perfect for day or night time photos. <br><br>The building itself is posh and renaissance. There is a grand staircase on the first floor that is a photo op. Definitely a place for a classy night out.", "pics": null}}, {"review": {"des": "Great views, good drinks. In the summer it's a bit on the crowded side, so go to Cindy's for a fun group outing rather than a romantic date etc.<br><br>Overall, I enjoyed my afternoon at Cindy's. Newcomers a tourists: Beware of the long line to get up the elevator when the weather is nice! Lots of others will have the same idea of going to Cindy's...", "pics": null}}, {"review": {"des": "Awesome!  Really amazing place.  I highly recommend trying.<br><br>To start, this restaurant is located in the Chicago Athletic Club building on Michigan Avenue.  It's on the top floor... which I think may have been the 11th floor, but can't remember.<br><br>Most of the restaurant is under a glass / clear plastic ceiling.  It looks like the ceiling might open up during summer, but also not sure.  You can see through the ceiling so it let's in a ton of light and you get a great view of other buildings, the city, and Lake Michigan.<br><br>It feels very Craftsman, and so do the food and drinks.  Unique foods on the menu.  Great for groups or even solo.  Lots of people eating and drinking at the bar.  <br><br>They're great for brunch, so if you go try the bloody Mary.", "pics": null}}, {"review": {"des": "Great views, great drinks, great bartenders, great atmosphere! I'm sure everyone already knows about this place but you have to go! Last time I went there was a pretty long line but it moved quickly. Grab a drink and sit by the fire pits outside. <br><br>You can't go wrong with the drinks and the bartenders are so friendly they'll make you something you'll like.", "pics": null}}, {"review": {"des": "Cindy's rooftop is a place you absolutely have to go to even if you only go to Chicago once. At this establishment you will get a view of the bean in millennium park and be able to take brag worthy pictures on the rooftop with millennium park in the background and the Chicago skyline. <br><br>Now the important part the food it's pricey in my opinion but once you taste everything you may soon forgive the fact that you ordered a 25 dollar yogurt.... or maybe not... go in a group and share the food. I think that's the way the menu is created, that way you can try a lot of brunch dishes for the price of one pricey brunch dish. My friends and I ordered the seasonal fruit bowl, breakfast burrito, oysters on the half shell, buttermilk pancakes, and the chocolate babka. The seasonal fruit bowl with beet yogurt also granola with mānuka honey so good! Which was my first time having beet yogurt and was actually my favorite part but honestly everything was so good it's a close call for favorite. I strongly suggest checking this place out if you have a chance!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tUiUQPOmlPYft48LExUU_w/348s.jpg", "caption": "Seasonal fruit bowl and chocolate babka"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/M-T0jLHxxNdDAXb7eefSbw/168s.jpg", "caption": "Oysters and breakfast burrito"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TKUv_POvy54xrLFoYJ7D6Q/168s.jpg", "caption": "Bloody Mary and matcha latte"}]}}, {"review": {"des": "Amazing views of the city.<br><br>Make sure you book a reservation ahead, otherwise be cool with first come first serve at the bar.<br><br>We had the omelet and the lox bagel. Who knew an omelet could cost $16 and be worth every penny? I never knew you could make an omelet not boring.<br><br>The Lox was super fresh and my favorite by far.<br><br>Get the bloody mary, just do it.", "pics": null}}, {"review": {"des": "Wonderful cocktails place, great beers (also local selection), delicious food and great customer service! <br><br>As long as you are willing to pay a bit extra for all of what I mentioned above, you will have a blast here. <br><br>Even though Cindy's is not one of the highest rooftop bars in Chicago, it certainly offers one of the best views! (Millenium Park where the famous Bean is located as well as beautiful Lake Michigan)<br><br>For tables, it is definitely good to have a reservation as there are very few of them. (and the place is very, very popular!)<br><br>Also, if you can avoid coming here on weekends (sometimes there are long waiting lines in front of the elevator to get in), do so! This spot is quite popular and well known among locals as well as tourists so weeknights are the best. The patio outside (with the view) closes at midnight so make sure to visit Cindy's by then, otherwise, you are going to miss out on the main attraction here.", "pics": null}}, {"review": {"des": "If you're looking for a rooftop bar with lake views + craft cocktails then this is a great option! <br><br>Location: located across the street from Millennium Park gives you great views of both The Bean and Lake Michigan. If you're looking for a rooftop bar with a great city skyline view, then there are better options in the city. But Cindys offers a truly great view especially of Lake Michigan. <br><br>Drinks: Really great craft cocktails with nice presentation. I ordered the Jillian, which was both tasty and pretty! <br><br>Crowds: I actually thought this place was going to be more crowded, but there was plenty of room on the balcony to enjoy the views. <br><br>Overall, definitely recommend coming to Cindy's if you're in the area.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Wqf0BODlUjDAlishDDxV3g/348s.jpg", "caption": "View from balcony"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jJApM9p1-7MPm8Nr92DStw/168s.jpg", "caption": "Jillian cocktail + great views"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UyP5PdJnjzDWiDFy2JBTJQ/168s.jpg", "caption": "Jillian cocktail"}]}}, {"review": {"des": "Talk about good drinks with a view...<br><br>Rooftop bar over looking Lake Michigan and downtown Chicago... yes please! Well worth it if you can deal with the crowded spaces and rude people.<br><br>The drinks are so yummy and unique. <br><br>Absolutely give this place a try one night in town, the views will be well worth it!", "pics": null}}, {"review": {"des": "The place is beautiful, the drinks are amazing. <br>A bit hard to find the address but totally worth it. It is inside of the hotel and you have to take an elevator to get there. The place is a bit fancy not sure if they'll have a dress code or not.<br><br>The roof top and the view was amazing , you could see the bean and almost whole town . They have few fireplaces that not warm you completely but after one cocktail you feel warm enough to continue :)<br>There was 2 bartender there , one of them was Eastern Europe try to stay away from him, he was so mean that almost ruin our night. How ever the other bartender made us such wow drinks that a bit change my mind to give them 4 stars and just take one stars away for mean eastern European bartender.<br><br>The drinks were amazing and the way that the bartender was making them was so unique and kinda fun to watch him.<br>Over all, good cocktails , a fire and see the whole town was fun :)", "pics": null}}, {"review": {"des": "If you've never been to Chicago, this is truly a must go!<br><br>Not only does it have an amazing view of the Chicago River, skyline & The Bean... but it also has delicious drinks! <br><br>I ordered the Poetic Nature, Jillian, and my fiance ordered their Old Fashioned. They were all great choices... I'm sure, from the looks of it, none of their cocktails would disappoint. <br><br>This place is also great for taking some of the best pictures as it is beautiful on the inside as well. Truly chic and classy.", "pics": null}}, {"review": {"des": "I've been to Cindy's at least half a dozen times for drinks because it has the best rooftop view in Chicago (yes I've been to LondonHouse, JParker, etc. and this is still my favorite!). <br>But I had never eaten here until the other night. Now, I think we lucked out because usually it's so popular and busy it spills over everywhere but it was a somewhat rainy Wednesday and so the place was only half full. This made it easy to take the elevators up to their beautiful, glass encased dining room in no time. <br><br>To start, I ordered the Lillian cocktail ($16) which is quite pricey in my opinion but there are beer and wine options that are more reasonable. For food we shared the burrata appetizer, pumpkin rissoto entree, and a side of brussel sprouts. My friend is vegetarian if you didn't notice a theme there :) I appreciated the seasonal fall components of each dish, as well as the presentation of each. But I did not like how limited the menu is - there is only one entree option for each category (one chicken dish, one beef dish, etc.). Just something to note to check out ahead of time since it looks like they change their menu often.<br><br>I'm glad I finally dined at Cindy's, and had a very pleasant experience but I would likely not visit again for dinner because of the high price tag.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EHrfNe3UtgkCXZHG0nsp_w/348s.jpg", "caption": "Pumpkin risotto"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lDKQbKcgh4QLqJD5Lmd4OA/168s.jpg", "caption": "Burrata appetizer"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/b_uh2yY8eK6lbMAqgw3p3Q/168s.jpg", "caption": "Jillian cocktail was refreshing"}]}}, {"review": {"des": "Great place to bring visitors! Came by with the family to show them the Chicago sights and they loved it! I made reservations for 10 about a month before and luckily I did because it was packed. We had no issues taking the elevator to the top and getting to our table. Everyone was super-friendly and accommodating. We got a nice long table right in the middle of the restaurant with lots of natural lighting<br><br>The food was pretty good. I had the Beet & Avocado, Chicken Milanese and the Roast Pork Sandwich which were all delicious. The Beet & Avocado was a little pricey for the portion but it was very good and light The chicken Milanese was good when paired with the corn pudding. The roast pork sandwich was a little dry but was huge compared to the beer & Avocado. I really liked the Chicken Milanese and would recommend it. The menu changes and I came last summer and it was completely different. So definitely look on their website for the latest menu. I wish that they a few more things on their menu. What is listed seems pretty limited. On our table of 10 we got lots of repeats and I thought that was silly. Maybe I'm the future have small plates? <br><br>Overall still a great spot to checkout. Highly recommended and the view just hits the spot. Glad it is open year round and the patio has heaters. Definitely make a reservation early on <a href=\"/redir?url=http%3A%2F%2Freserve.com&s=e074f543cc83ea613c8eb6b7f3decb93acfe991e986b436b3831cd613e9beab1\" target=\"_blank\" rel=\"nofollow\">reserve.com</a> if you don't want to wait. This place fills up fast.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2d_RoF5aGiRW_zHDR8hAvg/348s.jpg", "caption": "Inside the restaurant"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TSq4tUnPfqfzByuaxA9H2g/168s.jpg", "caption": "Inside bar area"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Egbzba3FnxOjCyhmmAtbqw/168s.jpg", "caption": "Roast Pork Sandwich"}]}}, {"review": {"des": "Cindy's is one of my favorite rooftop bars. The views are spectacular being right across from Millennium park. You can see the skyline, the bean, the lake and Museum Campus. <br><br>The actual outdoor area isn't that large so be prepared to cozy up next to some strangers if you want to be right along the edge. They do have outdoor seating and fire pits to stay warm in the colder months. <br><br>The drinks are delicious and have a plenty of options to choose from. Great place to bring out of town guests for views of the city.A little fancier and pricier but you get what you pay for. Plus there are other great bars in the Chicago Athletic Association as well.  <br><br>Still haven't had the food yet but can't wait to try it!", "pics": null}}, {"review": {"des": "Personally, loved my experience at Cindy's. To be fair, not everyone in my party enjoyed it. <br><br>Went for lunch on a Monday at 11:30am and we were not only seated right away but got the best seat in the house. A booth that overlooks millennium park. Perf views. <br><br>Service was fine. No complaints, nothing outstanding to comment on. <br><br>We all ordered salads with added proteins. Waldorf was perfect portion but the beet salad looked super small. I loved my waldorf - kale, red grapes, apple slices, chunks of smoked Gouda, candied pecans and a tangy dressing. Added shredded rotisserie chicken. <br><br>Food presentation gets 6/5. Verrrrry nice. Fancy schmancy. Didn't get to try the cocktails but heard they are why Cindy's is known for.", "pics": null}}, {"review": {"des": "Cindy's is a great rooftop with a beautiful view. Good selection of drinks! Perfect for a photo opp if you're an instagrammed! <br>I visited just for drinks and it was a nice place to grab a drink and enjoy the view. <br><br>If you do go to Cindy's you should also stop by the cherry circle room and explore this building! This building is full of hidden treasures and Cindy's is one of them!!", "pics": null}}, {"review": {"des": "I'm so annoyed. My server Hector was an absolute inconsiderate and could care less serving me, but had no other issues with other guests. I witnessed him literally have a full blown conversation about the food items and menu, however when I asked him the same thing I got these short nonsense answers. His answer, \"everything is straight forward\" duh I'm asking that. I'm asking what is good and what you like. \"It just depends\" ok fine man be short with me but then when the women in front of me ask the same thing and you actually have an interest then that's why you got the tip you got. <br><br>I have him a crappy tip for crappy service. Didn't check on me once but to the check asked if I wanted another drink when he had the check in his hands. I saw him a total of 4 times. One to greet me, to take my drink order, my food order and the check. Don't expect me to tip when you took my order and rang up my tab. I was thinking about giving $0 but I didn't. Act a little nicer and not have your nose in the air thinking you are someone. Just relate to the customer. <br><br>I rate the service a -5 stars. The views are a 5 star for sure it was beautiful up there. Fantastic place to be for a fun lunch or evening. The food is fine. 3.5-4 stars for flavor and great presentation. I got to somen noodles and it was light, not really filling, portion size was so small compared to the price. I would think $17-$22 max. Value was about a 2. I got a glass of rosé which was fine and probably could have bought the bottle for as much as the glass. <br><br>$45 lunch for one person seems a tad excessive to me, but I've had higher.  I would be back just want better service and not treated like an idiot when I ask a question it's not that hard. Also this is the worst service I have had on Chicago trip.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Kc0VTgvXP15kuhNmlLZ8dg/348s.jpg", "caption": "Somon Noodle"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iG0vgY-CTPzzk_D_JcwJVQ/168s.jpg", "caption": "Rose vibes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sz0oaFWzQh_E3OAjvSMYZg/168s.jpg", "caption": "Views the bean"}]}}, {"review": {"des": "Located on Michigan Ave in the Athletic Association Hotel is Chicago's most beautiful rooftop view and trendy restaurant. <br><br>You must have reservations in advance in order to eat but they allow you to go in and onto the patio to enjoy the beautiful view overlooking Millennium Park and part of Chicago's skyline.  <br><br>I had the opportunity to do just that... was unable to eat but from what I saw the plates looked appetizing and the service was great.  I definitely want to go back and get the opportunity to try the food. Although it was cloudy the day I went the view was still stunning. <br><br>Even if it's just for the view Cindy's is a place you must check out while visiting ChiTown.", "pics": null}}, {"review": {"des": "Late night drinks: didn't get to stop by for brunch but came here late night after dinner for the rooftop bar. It was still pretty packed inside and outside on the rooftop. There's a bar on the rails so you can drink and look at the pretty city lights and the park/cloud gate. <br><br>Drinks were super pricey (2 cocktails for about $34). I guess you pay for the view. I got something where it was hard alcohol mixed with kombucha. It was decent. I would love to try the food though except we decided to be dirty and got shake shack down stairs.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vXn6cu_XwoOip1obBOjLSw/168s.jpg", "caption": "Drink and view"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/H_GKhQCxmxZ3DQFA6YyTww/168s.jpg", "caption": "View"}]}}, {"review": {"des": "I have seen pictures of the view from Cindy's and have been dying to check it out for myself. Not to add, this rooftop spot has my name all over it, so how could I not?!<br><br>On a Saturday morning, there was no line up the elevators to Cindy's. We were planning to just grab a drink to enjoy at the balcony overlooking Millennium Park. My friends who are locals did mention it's usually much more crowded, so we got pretty lucky. Despite that, I was not too impressed with the view. Although it was neat to have a bird's eye view of the infamous park with the bean down below, it wasn't anything I would be sad about missing. Since I wasn't too keen on staying around, we skipped out on grabbing a drink here. As far as I can say for the view and atmosphere, it was okay. The interior was beautifully designed though!", "pics": null}}, {"review": {"des": "We made a 10pm reservation ahead of time on a Sunday night for Labor Day weekend. Our couch, comfortably fits 8,  overlooks Millenium Park and has a great view of Lake Michigan, Art Institute, and Cloud's Gate. <br><br>I really liked the Thai Iced tea cocktail. Gin mixed well with the Thai Iced tea. <br><br>Great cocktails and views. Highly recommend reservations ahead of time to secure a spot and skip the wait in line.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6_8NnWopDNPlVtsKrqr3fw/168s.jpg", "caption": "View"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GMaSi5h3mVzGfespmGQs6Q/168s.jpg", "caption": "Thai iced tea"}]}}, {"review": {"des": "We visited 3 different rooftop bars during our recent visit to Chicago, and Cindy's is the only one we stopped back and visited a second time because we liked it so much.  Interestingly, we only came to Cindy's on a whim after looking up and seeing this rooftop bar packed with people when we were visiting adjacent Millennium Park and The Bean (Cloud Gate) sculpture earlier in the day.<br><br>This bar/restaurant is located in the historic and relatively recently restored 125 year old Chicago Athletic Association building.  The building itself is a true gem, with ornate ceilings, woodwork and other features, designed in the gothic style.  Once you arrive in the lobby of the Athletic Association building, take the 3rd elevator on your right to the 13th floor and you'll arrive at the hostess stand for Cindy's.  We never ate here, but came primarily for pre-dinner drinks and to check out the outdoor \"rooftop\" patio which has a drink rail near the very edge and overlooks Millennium Park, the famous Bean sculpture, the Pritzker outdoor amphitheater/concert venue, and Lake Michigan and sailboats in the distance.  One also gets a great view of the buildings at the lower part of Wacker Drive from here, which stand in the area where the mouth of the Chicago River meets Lake Michigan.<br><br>The specialty cocktail menu is fairly large and varied, the mixologists working here are great, prices are about average at $14 or $15 per mixed drink, and this place features a really nice bar and several tables for patrons to sit and dine.", "pics": null}}, {"review": {"des": "Great spot to check out on a beautiful summer day if you're near Millennium park or just in the area shopping on State street. It's a great spot in the winter too since they have the fire pits going outside on the rooftop, but I just enjoy it more when the weather is above 40 degrees, which is very short and hard to come by in Chicago ;). They have food here, which is equally as delicious as the view you get on the rooftop. Definitely one of my favorites in the city! The drinks are usually a go to (although a bit pricey), so you can sip and enjoy the view. It's a great place to visit if you are out of town, because there is no view quite like this one! The ambience is great, the view is amazing, and the servers/bartenders are always nice! Worth checking out.", "pics": null}}, {"review": {"des": "Cindy's is a delightful rooftop restaurant and bar perched right by the sidelines of Millennium Park and the Chicago Bean. It is located inside the Chicago Athletic Association Hotel, and makes an excellent first stop in the Windy City. It was mine :) <br><br>I boldly came without reservations after 5pm and was seated inside the restaurant since I wanted food and drinks. Definitely make reservations if you can, because I was surrounded by a sea of reservations. <br><br>Food: $$$<br>-scallops: delicious! <br>-banana chocolate dessert: super delicious!<br>-pasta: could have passed <br><br>Food is a little pricey, but you need something to soak up that alcohol since the cocktail selection is tempting. The scallops were amazing. My bfs pasta was good but not the best, and the banana chocolate dessert was to die for. Sadly, I didn't take a picture of it.<br><br>Drinks: <br>-Thai tea cocktail: it was a sweet and unique cocktail that really tasted like Thai tea <br>-Bf ordered some sort of old fashioned<br><br>Now about the sweeping view. Take your drink outside, and soak it up all up because you can see so far out into the city. <br><br>Chicago is beautiful, and Cindy's reflects that.", "pics": null}}, {"review": {"des": "Cindy's is an absolute must when you're in Chicago! We stopped by for afternoon drinks on a Friday (around 3pm) and as you enter the building it's located in you'll most likely need to wait in a short line outside of the elevator, we waited about 15 mins. <br><br>As you exit the elevators on the roof the views and overall ambiance are beautiful. There are tables available but they are reserved for customers that are interested in ordering food, for us we were just there for the cocktails so we made our way to the bar to get our drinks. Unfortunately I don't remember the name of our drinks but they were delicious and I think it's safe to assume their other options are as well. <br><br>On the other end of the bar is the balcony where you'll most likely see the crowds gathered around because the views are spectacular - you can see Millennium Park and the bean, Buckingham Fountain, Lake Michigan, the planetarium, etc. The view alone is worth the visit. <br><br>If you're looking for tasty drinks, awesome ambiance and even better views then you definitely need to check out Cindy's!", "pics": null}}, {"review": {"des": "I came here for my best friend's birthday and this was the top recommendation of all places we were forced to go to. No regrets.<br><br>So first things first - do make reservations. Whether it's brunch or dinner - make reservations. <br><br>We made reservations and came a little early. Front desk had us go to the bar to wait until we were called. It was a Friday night so it was packed meaning we had no room to move so we headed straight for the balcony where there was an amazing view of Millennium Park. After looking at the view, we stepped back inside to order drinks. Again the crowd was a bit rowdy, but it was a Friday night so wutevaaaaa. As we were about to order, the front desk staff walked up to us and showed us to our table. Which was super impressive given how crowded the restaurant was. We were seated on a cozy table and we began to order food. The food was AMAZING. <br><br>Of everything we ordered, the spaghetti was the best and I can't even tell you what it's called on the menu bc it's not spaghetti so if you order something for dinner ask if they have spaghetti. I say their spaghetti is bomb, because their noodles are amazing. <br><br>The other dishes I don't remember ordering because the spaghetti was fire. <br><br>The end. 10/10 would recommend with reservations. If you don't get reservations, Godspeed.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0g4Ucy63K3u3a7yC7dkt_A/348s.jpg", "caption": "Dinner in Chicago with an amazing view!"}]}}, {"review": {"des": "We decided to try to stop by Cindy's before dinner for a quick drink...as did everyone else apparently.  Located in The Chicago Athletic Association Hotel, you walk in and take an elevator up to the restaurant, which happened to have a long line and a doorman directing traffic.  <br><br>Once upstairs, the space is really cool looking with a terrace overlooking Millenium Park and the water.  However, it was extremely crowded and hard to move around or get to the ledge.  The drinks were good and very well thought out, the ingredients were fresh and they had a great mix of flavors.  However, they were a bit pricey compared to drinks I had gotten elsewhere and there was such a rush at the bar with all the people up there.  <br><br>Overall a really cool place, that I'm glad I got to experience.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/D08aKoeWftkmO8oS_rHUVA/168s.jpg", "caption": "View of the main bar and dining area"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5E6kPiTjDDVfNRAJG3nDmw/168s.jpg", "caption": "View from the terrace"}]}}, {"review": {"des": "Oh Cindy's. Such a beautiful view- such great service, great drinks, but food leaves MUCH to be desired. I have heard that it's better for brunch so I'll have to give it another try, but the dinner was honestly disappointing and expensive for the food that you got. Burrata was amazing. The peppers, pasta dish, and charcuterie boards are really not worth the hype at all. The drinks are decent but make sure to ask your server/bartender what it tastes like because you will most likely see something that catches your eye on the menu and end up with a very bitter concoction just because you might be like me and not recognize what some of the ingredients are :) <br><br>To get there, go into the Athletic Club, take the elevator to the top floor, and DEFINITELY check out the outdoor patio for pictures. <br><br>Beautiful beautiful view and very friendly staff, but would definitely recommend this as more of a brief stop along your touristy journey rather than a full meal.", "pics": null}}, {"review": {"des": "We came in on a Friday afternoon. We had to wait a bit before going up to Cindy's. Not a long wait though.<br><br>Here I had Siempre, Si drink, which is quite strong and has a kick to it, definitely recommend!<br><br>At the bar, it can get pretty crowded since everyone is trying to grab a drink and head out to get a view of Lake Michigan and Cloud Gate.<br><br>Great pictures to be taken.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dgDdqG3g_9BFW07alBJfVQ/168s.jpg", "caption": "View of Millenium Park from Cindy's"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IvCenezypJO3JcBxacWdjw/168s.jpg", "caption": "View of Lake from Cindy's"}]}}, {"review": {"des": "This bar wins for the best view in all of Chicago! I came here on a weekday around 6 PM, and it was really popular! It's inside the Chicago Athletic Association up the 13th floor. The bar was pretty crowded, but you expect that given the awesome view of Lake Michigan and the park below. <br><br>The drinks are a little pricey ($9-$10 for a pint, more for cocktails), but makes sense because you're paying for the view and the location. I imagine it gets really busy on a weekend. If you can squeeze your way to the balcony edge, the view is worth it!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PLgTeIzHeFJM3akSQ6Yhhw/348s.jpg", "caption": "View from balcony at Cindy's"}]}}, {"review": {"des": "The line here was so long. We waited nearly 2 hours to get up to the top for the bar without reservation on July 4th. We missed the fireworks standing in this line that didn't move. By the time we got up there there was a thunderstorm so the patio closed. <br><br>The bartenders here are funny and enthusiastic about their jobs. They interact with you and enjoy your presence. I would recommend coming here any time of the day. We came both at night and the morning after July 4th and the view was amazing.", "pics": null}}, {"review": {"des": "Located on the rooftop of Chicago Athletic Association, Cindy's is a wonderful place to grab a meal + drinks with a beautiful view! <br><br>Husband and I popped in for a quick drink while exploring Chicago. The aesthetic in this place is so darn cute and you just can't beat the view! The bartenders were very nice and quick. I got the getaway and while quite expensive ($16) it was delicious and I would definitely recommend!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iimRfd7tZKdiw1hF0pK2NA/348s.jpg", "caption": "Getaway"}]}}, {"review": {"des": "I think I had high expectations for this place because of all the hype about it. It was alriiiiiiiiiight. The place is really nice with natural lighting and windows everywhere. The space is small so it can get crowded real quick because it's such a popular rooftop bar and it's summertime. I came here on a weeknight for an early dinner and it was really busy. Many people were outside so there was not that much room and you could hardly see the view :( It was also kinda loud inside so it was hard to hear what my coworkers were saying. They are very good with reservations but you only have a 2 hour limit at your table. Our waitress was semi-friendly and she didn't seem very happy. <br><br>The food is good here but kinda overpriced. I guess you're paying for the view and space. The dishes are shareable and comes with two prices. The lower price is a small portion that feeds 1-2 people and the higher price feeds 3-4 people. We had the salad which looked very unique because of the type of lettuce they used. They can accommodate your dishes if your vegan but only with a few dishes. My coworkers had lentil with masala as a substitute and you can definitely taste all the spices that they added and had a kick to it too. Unfortunately, we found a very thin piece of fabric thread in our lentil. We thought it was hair at first. <br><br>We had dessert and drinks at the end. My coworker got the drink with tomato water. Don't get it. It tastes like tomato with watered down gin. Her cup was full of ice so she had very little to drink. I think the desserts are overpriced and we waited for ours to come out until 15-20 minutes later.", "pics": null}}, {"review": {"des": "I was here for a private event, so I wasn't at the restaurant setting nor had to wait for a table.  Let's start off with the view!  Just wow.  It's easy to take someone on a romantic date here.  It's right across from the bean and the view of the lake is stunning.  I tried the crab and shrimp as an appetizer, again this was a private event, but all tasted fresh and delicious.  The bar defiantly does not hold back either on the drinks, I had an old fashioned.  Very tasty.  I would defiantly come back here again to try more of there food.  They have a valet and there is a parking garage age across the street. I strongly recommend getting a reservation.", "pics": null}}, {"review": {"des": "Incredible views and great drinks. Beware that the food and drinks are pricey, but they are worth the splurge for a visitor from out of town or just to be bougie. There can be crowds and long lines during the summer or more touristic time periods, dp try to avoid these timeframes if you can.", "pics": null}}, {"review": {"des": "Food is okay. One slacking bartender was unwarrantedly arrogant. Seating is hell and not very accommodating. Hostess was great. The rest of the staff didn't seem to be happy when busy. Went a few doors down to an even more crowded place. We had a way more warm, personal and welcoming experience which we went back to for dinner the next night.", "pics": null}}, {"review": {"des": "The view is worth the hype but the wait is not. I would suggest not coming on a Saturday when everyone and their visiting aunt is in town but it is the place to be. The view is killer and their patio is nice even in the colder seasons. They have cute fireplaces and the cocktails even though they are chicago prices are SO good. Their signature gin & tonic is so refreshing and makes me regret all the well gin I've drank throughout my life.<br><br>Never had the food because I develop this thing when I'm hungry ... my boyfriend says it's \"HANGRY\". So we don't wait but the views are worth it for someone visiting! Just be prepared to wait.", "pics": null}}, {"review": {"des": "Seriously the best rooftop in all of Chicago. You get a great view of the bean, Millennium Park, skyline and Lake (pretty much everything) on the open air deck. I think you can also order light bites at the bar, but we were going to dinner afterwards so just ordered drinks. <br><br>It can be a bit hard to find, but if you enter through the Athletic Club Hotel (left of the coffee/bakery), there is an elevator to your right that you take up. There was no wait when we went around 3 pm on a Monday probably because well...it was Monday and it was 3 pm. It did start getting busier as we were heading out a couple hours later though so plan ahead! <br><br>This was one of the best things we did while in Chicago - seeing the city from up above!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eegIQM_w34cvTe4hahYkTQ/168s.jpg", "caption": "Best view!"}]}}, {"review": {"des": "I love Cindy's.  It's a gorgeous space with fantastic food, drinks, and service.  Not to mention the wonderful view.  <br><br>I'm a big fan of the Chicago Athletic Association in general, and I think it's fair to say Cindy's is the best of the dining options.  Most recently I had the bacon wrapped trout served with lentils, cabbage, and a fantastic sauce.  It was absolutely delicious.  Like any good restaurant their menu does change so if you haven't been in a while go back and see what's new.  They only serve brunch outside, not lunch or dinner (weather permitting of course).<br><br>If you're not looking for dinner but only a drink then Cindy's is still a great choice.   I'd grab a drink at the bar and head outside to enjoy the view overlooking Millennium Park. <br><br>Even without the great view outside Cindy's is still gorgeous.  With a glass ceiling the space feels bigger and brighter while the decor adds warmth.  Most of the tables are made for communal dining, or a big group.  <br><br>Cindy's is a great option for showing off our great city to someone visiting from out of town, a wonderful choice for a date, or just grabbing a drink with a friend or two.  <br><br>PS, I'd head down to the Game Room after a few drinks at Cindy's if you're done enjoying the view but not quite ready to end the night.", "pics": null}}, {"review": {"des": "So here's the thing.. Cindy's is one of those places that you just HAVE to go to while you're in Chicago. It is a MUST! There's the view, the drinks, the ambiance.. It's pretty great.<br><br>You take the elevator up to the top floor and there is an indoor/outdoor section to it. Obviously, the outdoor section is the one that gives you the view to the bean, the lake, and part of the city. The inside is covered but it's covered by glass so there's natural light constantly pouring into it which is nice. My one complaint is simply that I wish you could see the view throughout the entire restaurant. You have to go out to the outdoor terrace area and look over the tall ledge in order to see it, which sucks if there is no space on the ledge.<br><br>The first time I visited Chicago, I never made it to the top because it was so packed and we waited in line for about 45 mins before calling it quits because it was just way too much waiting around and there was no guarantee there would be terrace space. This time around, we didn't wait a line and went right up. It actually wasn't packed at all so it was great to finally get to see everything.<br><br>The drinks are on the expensive side ($14+) but pretty good. I never tried the food but heard from a girlfriend that their brunch menu is pretty good so hopefully I can go back soon and try out a few of their dishes!", "pics": null}}, {"review": {"des": "OMG what a find! The boyfriend and I scoped this place out by chance during our anniversary weekend in Chicago and it was quite the find. Take pictures of your view because it is breathtaking!<br><br>We stood in line before it opened for a Sunday brunch. Mind you, waits in Chicago are always about 2 hours, so we're glad we were 3rd in line. I recommend making reservations.<br><br>The restaurant is at the 13th floor of the Chicago Athletic Association on Michigan Ave. It has the most breathtaking view of Millennium Park, Grant Park, all the way down to the Adler Planetarium/Shedd Aquarium/Campus. <br><br>We sat outside on the balcony, but there are seats available underneath their rooftop. If you sit outside like we did, we highly, HIGHLY recommend sunblock, hats, and sunglasses. It was clear, blue sky and sunny the day we went so we both got plenty of sun. <br><br>The food was delicious. We shared a half order of the pancakes and sides of scrambled eggs and bacon. The pancakes were fluffy and heavenly. While the eggs and bacon were perfectly tasty, paying 6 dollars for each dish did not seem worth the amount we got. In addition, we each got a blood mary. <br><br>Our waiter recommended the cast iron chilaquiles, which will most likely we our next try :)<br><br>I will say this downfall of sitting outside - EVERYBODY comes out to take pictures. No one was rude, but it is a view that people sitting outside come out to take pictures of. This is your warning.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5Wo9XG0Q3J51Nqwd_YnT3g/348s.jpg", "caption": "Pancakes (half order), scrambled eggs, and bacon"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mc7bROH7Q4v-77cGivwnKQ/168s.jpg", "caption": "Bloody Mary"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PDR7ECZrXWdVrGzy65P_AA/168s.jpg", "caption": "The beautiful view"}]}}, {"review": {"des": "Had to deal with the rudest bartender who felt the need to make fun of me for ordering a Manhattan. Proceeded to talk about me with other patrons. I asked for his name and he didn't want to tell me--thankfully the server's name is on the receipt. <br>Ed should have some proper training in customer service and shouldn't feel the need to quiz a customer on what goes in a Manhattan.", "pics": null}}, {"review": {"des": "Go for the view, stay for the cocktails! <br><br>Servers are very knowledgeable and the ambiance is truly wonderful!", "pics": null}}, {"review": {"des": "Location...Went in on a Tuesday night around 7pm. Waited 5 minutes on the elevator ride. Put our name in for a table and were sat within 10 minutes. A steady flux of people came and went, mostly for the view I think. I'll get to that...<br><br>Exceptional service...the server (Brian...?) gave many helpful recommendations. My girlfriend and I were still full from lunch, so we split a charcuterie plate which did not disappoint. Very flavorful and balanced. The mustard and pickled grapes were my favorite. The grappa and dessert menu was a pleasant surprise. We had honey-infused grappa which was the smoothest and most tasty grappa I've ever experienced. We had a chocolate pastry dessert (sorry the name escapes me) which was rich, but not too heavy.<br><br>The view was stunning, inside and out. The venue was cozy with an atrium-esque dining area. I wish we would have went earlier to see the sunset sky, but the nighttime view was beautiful. <br><br>I will absolutely make this a staple when I visit Chicago again!", "pics": null}}, {"review": {"des": "Amazing views, good prices and service! We came here around 1:30pm on a Thursday without a reservation and were able to gets seats right away.<br><br>1. Vibe<br>This restaurant is perched on the top floor of an athletic club, there's an elevator on the side of the main lobby that takes you straight there. It has tall ceilings with lots of natural light and a breathtaking view of Millennium Park. It's a place that you could meet up with friends for a quick bite or a couple hours over drinks!<br><br>2. Service<br>Service here was attentive, but it was sometimes hard for us to track down our waiter to get water. However, when our server did come, all of our questions were answered and we were able to get several recommendations for the dishes.<br><br>3. Presentation<br>Plates here were pretty standard, plop the food onto the plate and viola!<br><br>4. Taste<br>We tried the burger as well as the gnocchi, both of which were well seasoned. The burger was cooked at a perfect medium rare, the bun was moist yet it held up and didn't disintegrate at the very end which is hard to find surprisingly!<br><br>5. Value<br>$17 for the burger and $21 for the gnocchi wasn't too expensive for the dishes, given their taste and the venue. If I lived in Chicago I would see myself frequenting this place with friends!", "pics": null}}, {"review": {"des": "Beautiful rooftop bar. Managed to find the last few seats that could fit four people on a Friday night at 11PM. Crowd died down around 1AM.<br><br>Service - Fast even with cocktail drinks. <br><br>Grey Garden (Tito's dolin blanc, creme de violette, emperor's jasmine pearl tea, lemon) - Best mixed drink with Tito's I've ever had. The tea drink was soothing and refreshing. Everyone ordered this. <br><br>Two shots of diplo (diplomatico rum, malifoc ranclo sec, cynar, letherbee besk) - Could taste the brown sugar, grapefruit pink, and was overall crisp and refreshing.", "pics": null}}, {"review": {"des": "Beautiful view of the lake and millennium park! Must see for anyone visiting from out of town.<br>We went at 3 pm on Sunday, and there was no line. We ordered the \"freizling,\" which was similar to a frozé. <br>I'be been at night (and waited in a very long line), so it was great to go during the day when you can head right up and actually see the amazing view.", "pics": null}}, {"review": {"des": "Great rooftop bar but if you're looking for a proper and classy vibe! It was located at the top of Chicago athletic club. We tried the \"Gillian\". It was strong and yummy! The patio had killer views. Gets super crowded and there's a long wait.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CdIhPAnibN6ewsQcZCKIbw/168s.jpg", "caption": "Gillian and green tea shots"}]}}, {"review": {"des": "Cindys is a popular spot among tourists and locals alike.  It's definitely on the top of my list when family or friends come to down. The drinks are expensive, but very delicious, and its the price you pay for a good view! I've been to Cindys maybe 5 or 6 times now and only one time did I have an issue with the service (bar) and it took a while to get a drink.  It was early on a gloomy Saturday so maybe they didn't think it would get crowded? Not sure.  So far I've only been for drinks - the \"Howl at the Jun\" is my favorite.  My mom says the gin and tonic (made in house tonic) is the best she's ever had! They also have a wide array of local spirits and brewskis.  I have a brunch reservation in a couple weeks and I will report back with a food review!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/i_xoVlve932vuA4iqN7NSA/168s.jpg", "caption": "From left: Sweet manhattan, aperol spritz, old fashion, a local beer, gin and tonic"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bZnomAym-t9cNIcA3cnHvw/168s.jpg", "caption": "Cindy's famous \"Howl at the Jun\" cocktail.  The candied ginger garnish is a nice touch. Oh and look at that fab view!"}]}}, {"review": {"des": "I've been dying to try this place ever since my brother and sister spent their anniversary weekend at the Athletic Club and bragged about this rooftop scene! Reservations are hard to come by and since I'm only in Chicago a few times a year and mostly around weekends, it's been too busy or too booked to enjoy. I chanced it on a Tuesday around lunchtime with my Mom - the hostess asked if we didn't mind sitting at one of the mini side tables along the perimeter or at the bar? Of course we didn't mind and fun-fact, the side table ended up being one of the best views anyway! <br>Major shout-out to Javier who waited on us and expertly navigated the drink menu according to our preferences. He recommended the Walk on Water, encouraged us not to be repelled by the tomato water (which is more of an infusion) and boasted of it's light, refreshing taste. He was right, and it was just the burst of refreshment needed on a hot and humid Chicago afternoon (not to mention the most pretty in pink hue). <br>For lunch, we split an order of the yellow melon gazpacho & roast pork sandwich. The gazpacho was a guess, literally unlike anything I've ever had before, but I was drawn by the list of ingredients: cucumber, coconut, curry, cashew and cilantro... All WINS in my book so how could you go wrong? It came chilled, light, tangy (almost spicy) and it quickly induced a spoon-to-mouth habit as well as a pool for dunking our taro chips. Did I mention our sandwich came with a side of taro chips? I won't pretend to be fancy enough to know what taro is, and it was a funky/interesting chip, but then, I'm never one to turn down a chip!! The sandwich was also unlike anything I've had before. It was a party of acidic tang and flavor with the pineapple relish, pickled red onion and aioli, all tipping their hats to the star of the show: the tender pork! <br>The high-arching glass ceiling lined with sparkling lights with the rustle of happy diners underneath makes you want to sit, linger and drink in conversation around good cocktails and food. Yet the occasional glances towards the balcony tempt you to grab your drink and meander outside for views of Millennium park and Lake Michigan. Gorgeous views on a clear Chicago day... and if you're lucky, you'll be standing next to a local who is pointing out all the landmarks to a friend! \"There's Shed Aquarium, and Soldier Field, and the Art Institute....\"<br>Cindy's has that flare of feeling vintage but relevant; old-fashioned, but in with the times. It captures how I feel when I visit Chicago: nostalgic and bustling.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XscHGA3jKJDtxr9_t_25Ag/348s.jpg", "caption": "The bean"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JRKj5xf0v6I-RdEAOtBEXA/168s.jpg", "caption": "Views of Millennium Park from the balcony"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FSGkJBu9LNaTEbaPkg0bbw/168s.jpg", "caption": "The glass ceiling let's in the gorgeous sunlight at our perfect side table!"}]}}, {"review": {"des": "LIT rooftop bar with a great view. There is an inside and outside bar depending on what you are looking for on a particular day. It was crowded on a Saturday afternoon, as to be expected.<br><br>They have a wide selection of drinks and they are well made. The price seems to be on par with other Chicago bars. We came before 4pm, so they had a very limited list of snacks available and it wasn't clear to me from the host how to go about getting a table for a real meal which was frustrating.<br><br>I'd go again for the view and drinks, would hold off for actual food since I am still confused.", "pics": null}}, {"review": {"des": "Have been dying to come here and lucked out with a last minute invitation from someone who made reservations *WEEKS* ago. I just want to draw emphasis to the *weeks* because i need you to know that if you want to sit and/or eat you have/should make a reservation.  <br><br>Anyway - it's cute. Glass roof, string lights, picnic-esque tables, etc. We ordered a round of drinks (or a few), the bolognese, burrata, and crispy potatoes. This may be the first time I will give a restaurant the honor of seasoning their food well. HOWEVER: it is *very* pricey. While they encourage sharing and I was \"prepared\" to spend, I still left kinda hungry tbh.<br><br>THE POINT: It's not for a casual Wednesday. This is like a date-night-gonna-propose-made-the-reservations-when-I-bought-the-ring or graduation-is-coming-in-a-few-weeks-and-my-parents-are-in-town (wallets in tow) kind of place. <br><br>Will come back *pending above scenarios* and for the incredible view of Millennium Park!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ozzbc6bbLV3GPuIfQ9RiGg/348s.jpg", "caption": "Burrata"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WhITaqoRiVl7amt-i4vvGg/168s.jpg", "caption": "Crispy potatoes"}]}}, {"review": {"des": "Unlike most people it seems, I came to Cindy's to try the food rather than the drinks. If you're planning on eating, absolutely make a reservation. All of the tables were either reserved or occupied at 6pm on a weekday, and having a reservation allows you to bypass the line that forms downstairs by the elevators. At 6pm on a weekday, the terrace was full of people, and many were standing inside near the bar as well. It was a bit uncomfortable to be sitting at a table near the bar and having people hanging around us chatting because there simply wasn't enough room at the bar/on the terrace. But other than that, the ambience is quite nice. The volume level isn't too bad given the number of people inside, and the view is really lovely. Our server was very friendly and attentive. If anything the service was a little too attentive...one server kept trying to take our plates even though there was still food on them.<br><br>Onto the food: I love that it's sharing family style. My friend and I ordered three dishes--the house salad, the burrata, and the bucatini. All were really yummy. I'm a huge salad person, and the salad was amazing. I would love to buy a bottle of their salad dressing. The burrata was good as you'd expect, and the plate is really beautiful. Each dish took longer to come to the table than you'd think given that there's no cooking involved, so by the time that the bucatini arrived, we were starting to get full from drinking so much water and letting the apps sit in our stomachs. The bucatini was delicious though. I've never had corn in a pasta dish, and I was pleasantly surprised by how well it worked. Our waitress warned us that the pasta was spicy, but honestly I didn't notice the spice at all. We made sure to finish this dish despite being pretty full by the end of the meal. <br><br>Overall, really pleasantly surprised by the food at Cindy's. I thought it'd be one of those places that focuses more on ambience, drinks, and appearance than on quality of food, but I enjoyed my meal here and would be happy coming back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HvTg8pAfDWTK-Hbn_B1PfQ/348s.jpg", "caption": "burrata"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SK2OhVIOfHLrqlhFIuoHpQ/168s.jpg", "caption": "bucatini"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/frv8Kr-GGDlv-6YivxX9gA/168s.jpg", "caption": "house salad"}]}}, {"review": {"des": "We came here for a baby shower. It was my first time coming here and WOW is all I have to say. It is a rooftop restaurant/bar located in one of Chicago's historic hotels set from the 1890's in The Loop. It overlooks millennium park and the views are quite stunning. <br><br>Our servers were quite helpful and knowledgeable when I asked them questions. We had their signature cocktails that were very good and unique. I believe the one that was my favorite  had rose of course (my favorite drink of choice) Moving towards the food! I truly loved it all. They served bagels with lox out of this world and am picky when it comes to fish. It was very clean and fresh. Their pancakes were unbelievable, probably some of the best I have had. I had to remove myself from the table they were so good. They served beautiful cake carrot and chocolate both equally good.<br><br>All in all, one of the best places to dine! Will go back again! I highly recommend trying this place if you want to experience great food, cocktails, and a friendly and lively atmosphere!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/X5js0QshvIB9qELz9G44zw/168s.jpg", "caption": "The Rose cocktail"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HNBLYLURbm3P02FL6LCHVw/168s.jpg", "caption": "Carrot cake, chocolate cake, and a lemon cake! They were out of this world!"}]}}, {"review": {"des": "Cindy's is where I bring anyone who comes to visit me. The view you get of Millennium and Grant Park from here is spectacular. I've taken plenty of Instagram pics from their outside patio. I really enjoy how they have the fire pits and blankets in the winter. It's a very homey thing to do. <br><br>We've had many different drinks here over several years. They're all good but very pricey.  We see it as you're paying for the view and a drink so it's worth it.", "pics": null}}, {"review": {"des": "Such a nice and open venue with a gorgeous view. Apparently you have to make reservations weeks or months in advance to have brunch here. However, bar is open seating so grab a drink and wait for some chairs to open up. Most people are good with cycling out after getting their drink so this may not take long at all. You can also order a drink and walk out onto the balcony and enjoy the view. <br><br>The quiche was delicious and a shareable portion (comes in a cast iron dish). Steak and eggs are also yummy. Avocado toast has a little spicy kick to it, worth a try. <br><br>The cocktails are so well made. The hard part is deciding which ones to have. The Jillian was good and looked pretty.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9OX4BQ4r1TSAH2pfKIJAlg/348s.jpg", "caption": "View from balcony"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/V7J6n2PE6mPEwUu1TB6QbQ/168s.jpg", "caption": "The pink one is the Jillian, very good!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/H9o5BOCjL4BF3JJhUJ4mOQ/168s.jpg", "caption": "Steak & Eggs"}]}}, {"review": {"des": "Such a gorgeous view, with an incredible craft cocktail menu. Expect a substantial wait, even for drinks., and you'll be spending about $12-15 a cocktail.  This is one of those places that helps define the city it's in. It's a must-see locale. I always take my out of town friends for the open air aesthetic and the panoramic view of millennium park.", "pics": null}}, {"review": {"des": "Curated cocktails - Check<br>Stunning views overlooking the city - check<br>Lilac in mason jars used to reserve tables - check<br>Crazy lines to order a drink then push past people to get a view which you can only enjoy so long because someone else is hovering right over your shoulder wanting you to move - DOUBLE CHECK!<br><br>Look Cindy's is a great place to take people visiting from out of town to get a view of the city and sip on some cocktails that are whimsical and delicious. The issue, however, is that if its a nice day out, everyone else has the same thought as you so there is a line. <br><br>I learned about this place from staying at the hotel (also beautiful). There isn't a dress code per say but most people (if on a weekday) are in business casual attire/trendy so you might feel out of place.", "pics": null}}, {"review": {"des": "We stumbled onto Cindy's after having a coffee downstairs at Fairgrounds. And what a great find! Cindy's is the rooftop bar/restaurant atop the Chicago Athletic Association Hotel, overlooking Millenium Park and \"The Bean.\" <br><br>To summarize:<br>Service: 5-Star, starting with the security at the elevator to the hostess and servers, runners, and bussers. <br>Food: 5-Star, a bit pricey but given the location and views it was on point. Everything was well prepared and delicious. We ordered the eggs with prosciutto, and the lox and bagels. Portions were sizeable overall (though I would have liked more than one small piece of prosciutto on my meal). <br>Drinks: 5-Star, we went with the server recommendations. The \"Roman Holiday,\" made with a touch of cold brew coffee was well-balanced and amazing, while the \"Virgin Pillar\" mocktail was just as nice and not too sweet. <br><br>Definitely a nice brunch for visitors and locals alike, I definitely look forward to returning. Be sure to make a reservation though, or you'll likely be waiting in line if you come later than opening time (for brunch). As a bar, they're open late on weekends and definitely worth trying as they have an extensive cocktail list.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ddI8faK5GwgObZhB-3rthw/168s.jpg", "caption": "Brunch menu"}]}}, {"review": {"des": "I was in Chicago for a 30th birthday celebration (whenever I travel - it's probably for a birthday party/bachelor party/wedding) and this was the last day and last stop of my trip. I wish it was the first. I didn't get enough time here for multiples reasons. Out of all places in the world I ran into a friend from Oklahoma, and also met some really cool strangers who I wish I had more time with. <br><br>Cindy's. Located right across the street from Chicago's Millennium Park. Rooftop bar located above the Chicago Hotel I believe. I was very impressed. Here's why. <br><br>First of all, a rooftop place is always going to be a win. Something about being elevated with a scenic outlook of the city, is really never a bad thing. Now, throw in Chicago's beach view, and you're really cooking with fire. <br><br>When you enter - this place has a beautiful open concept: the bar is to your left, the balcony is to your right, and the eating area is in the middle. Bench seating, wrap around couches, and tables. High ceilings. Echoes - sure, but not a deal-breaker. Great design, nice wood accents inside, but not that over the top \"rustic/modern/contemporary\" aesthetic that I loathe. Right about of each, but not overpowering. <br><br>I didn't get to try the food, which was a shame. Like I said, this was the last stop of my last day on the trip, but I would love to come back and make a film experience of Cindy's. Dinner, drinks, the whole 9. I could see this as a great date spot. Even first date perhaps. But I was there with some friends, and it was the perfect Sunday-Funday option. <br><br>4 stars, simply because I didn't get enough time to really feel the place out. I am optimistic that once I return and fully engage, my rating will increase.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7S5tDy6felVDqbK67sK8iw/168s.jpg", "caption": "Views at Cindy's are great."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BKYGmGgFprCaaXy3yxz_jQ/168s.jpg", "caption": "Mixed crowd. This is a great thing. Come as you are. Dress up or dress down."}]}}, {"review": {"des": "It took me 4 trips to Chicago before I was able to enjoy Cindy's. There were 2 private parties, there was the the time where I thought they closed at 4 but it was really 230, and then there was that time where I think I was simply too inebbriated to figure out where the elevator was. On the all important 5th attempt, I finally got to see what all the fuss was about.<br><br>My friend and I made our way to Cindy's after dinner. She was my companion on every single failed visit, so it was only fitting that we were able to come together for a drink. We made our way up and were greeted by a bustling large, well-lit dining and lounge area. The decor is aesthetically pleasing. I can see why people rent out the bar; in addition to the rooftop, the dining room itself is very soft and romantic. <br><br>As beautiful as the indoor area was, we came for the famous rooftop. The expectations were high considering our bad luck in trying to see it. Everything we thought we'd see was met and more. The view is absolutely phenomenal. We ordered some Italian spritzers (that were expertly made) and enjoyed the rooftop even though it was literally 12 degrees out. It was completely worth it.<br><br>As much as I loved the patio, I'll have to hold off on 5 stars until I try the food. If the food doesn't live up to the drink menu and the food I'll be sorely disappointed. I cannot wait for my next trip to try everything. Hopefully it doesn't take me another 4 attempts to revisit!", "pics": null}}, {"review": {"des": "We got seated at the bar on Sunday for brunch within 15 minutes (without reservations). I didn't care so much for the limited brunch menu, but the Salmon Lox Bagel was surprisingly delicious! I ordered the basic omelette and bacon as well. Again, the omelette was extremely creamy and buttery. It didn't taste like a traditional omelette. The bacon was whatever (just skip it). Next time, I'll be trying to the steak and eggs because the meat was shredded and quite lean. <br><br>Mimosas were good! I only ordered the cappuccino because it looked super cute and foamy. It was okay. Typical coffee with flavorless foam. The bartenders didn't seem super enthusiastic that morning, but they could've been a little hungover from Saturday night shenanigans! <br><br>The outside patio is great for the views, but not as astounding as I had expected. I recommend the Signature Room at the 95th Floor at the Hancock building for more amazing views.", "pics": null}}, {"review": {"des": "Nice view from the rooftop, a little bit expensive.  $30 for each person. You need to come early at 11:00AM to enjoy the limited fcfs tables at the balcony.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/y5fAjYqolpiAp2piKCqX-w/348s.jpg", "caption": "view from balcony"}]}}, {"review": {"des": "I can't believe it took me this long to make it to Cindy's rooftop. Coming in I also loved the indoor area/ restaurant and bar. It would be a good date spot! <br>The rooftop it self was kind of crowded on a Saturday night, but by the time by boyfriend got a drink at the bar, I was able to cop out a nice spot on the edge looking out into the city. <br><br>The weather the night we went was wonderful! I would love to come back during the day sometime soon though.", "pics": null}}, {"review": {"des": "I loved the rooftop deck area with the active fire pits and built in stools arranged in a circle around the fire pit.  Once you enter the rooftop deck area there are fire pits on either end of the deck.  The deck also has a built in shelf where you can stand and gaze down at all the fantastic parts of Millenium Park such as Cloud Gate, Crown Fountain, and so forth.  You can also get an incredible view of the Chicago Skyline and the Lighthouse and Boats on Lake Michigan.  Truly a fantastic perspective of Chicago!<br><br>Location:<br>Across from Millenium Park in the Chicago Athletic Association-signage states Chicago Athletic Co.  <br><br>How to get to Cindy's-<br>You have to stand in a roped off line and take the third elevator to the 13th floor. Yes, there is a lot of wait time for the elevator.<br><br>The Bar and Restaurant-<br>Unfortunately the bar is very, very small and partially roped off for the servers to use the computer to input menu orders.  This situation means that you have to lean in between other people and wait (at least 5-7 minutes) just to order a drink and settle your tab.<br><br>The Spectacular View Overlooking Millenium Park-<br>While the view is spectacular-there seem to be a lot of people just hanging out and not ordering anything and just enjoying the view. It makes it difficult for patrons to use the table top running horizontally across the deck's edge.  In addition, there was a bar out on the patio/deck but it was not set up.  Furthermore people were leaving their empty cocktail glasses piled along the table top and no one was cleaning them up.<br><br>5* for the view<br><br>Suggestions-<br>Bar Area ordering procedures or process needs to be addressed to make it more efficient for people to order a drink and move out of the way for OTHERS to order in a reasonable and timely manner. <br><br>Why Not HIRE SEVERAL COCKTAIL WAITSTAFF to take drink orders and settle the tabs for people who are out on the rooftop deck?<br><br>Patio/Deck Area needs to be bussed on a regular basis as empty glasses litter the shelf area overlooking the city.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3w_4bTBi0nvXstQdjjyh5A/348s.jpg", "caption": "Rooftop Deck Cocktail=Happy Friday!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WknTcK0ja5H7ehgFYX-ZeQ/168s.jpg", "caption": "View of Lake Michigan"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UoCfis7M3R3-7wtyYjVZ-A/168s.jpg", "caption": "View from the rooftop overlooking Millennium Park"}]}}, {"review": {"des": "Make reservations if you can!! <br><br>5 stars are hard to come by, but this one definitely deserves it. From the service, to the setting, down to perfection! <br><br>Seated at the top of a building with a beautiful view of Chicago! It makes the Bean look tiny. <br><br>Although we didn't make reservations, we were still able to hang around outside then were moved inside for a warmer area. Depending what day or season you go, the patio could potentially be ideal for you! For those who didn't make reservations, like myself, you are able to walk right to the bar and order drinks and wait for the soonest available seat! By the way, they only give seats to those who don't make reservations if someone cancels!! So I recommend if you can sit at the bar or find a table on the patio, take it! <br><br>Being an upscale setting you must expect higher prices for high quality food. The waitresses/waiters are beyond friendly and really do want to make sure your experience is well sought out. <br><br>As for the setting, from the moment you enter the building you are directed to a separate elevator that has someone guiding you up to Cindy's. It was quite an elite experience for they don't exactly claim what floor you're on, but it is definitely above the 8th floor! With the rustic, dainty and plant friendly environment you're bound to fall in love. Decor hanging from the selling and the brick walls definitely gives off a hipster vibe. <br><br>Now as for the food... flavourful, filling and delicious. Right portion for single servings, but they also have Platters to share. <br><br>If you're in Chicago, you have to come to Cindy's!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bYUORrubgTDqnBgYwI7tjQ/348s.jpg", "caption": "Alcoholic Matcha Latte: $16US"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rxeCLrTxuBgCmP0pXKfxLg/168s.jpg", "caption": "Eggs Benedict: $16US"}]}}, {"review": {"des": "Fantastic views of the city! Great view of cloud gate and Lake Michigan. <br><br>Good drink menu, friendly staff and bartenders. <br><br>Didn't try the food. <br><br>Go for the views!!!!!!", "pics": null}}, {"review": {"des": "Definitely a Chicago staple - can't beat the views up there. It's pretty tiny inside and they don't take reservations but we just visited for a drink and we could order at the bar and take it outside on the deck. It's overlooking grant park, the bean, the water, and we could see the lollapalooza music fest that was going on the weekend we visited. The drinks are perfectly made by the bartender and I couldn't have asked for a better visit! If you were going to eat here, the deck would make for a great place to hangout and wait for your table. Theres also another small bar out there.", "pics": null}}, {"review": {"des": "I love it here! I sat in the outside rooftop patio, and definitely got a sunburn! <br>Luis was our server and he was great! Very attentive and very friendly. <br>Our food was fantastic. <br>We had the summer chopped salad and the prime skirt steak.<br>We also ordered a bottle of Rosé. <br>Everything was delicious! <br>A beautiful view, amazing food, and a great time.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZEwGhL_Bw5qgDt6o-xToWw/348s.jpg", "caption": "Rosé all day!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lpoKnRM3gBtIUG68HznHHw/168s.jpg", "caption": "Today's menu as of August 16, 2018. (New Menu)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yVyFIa9ICJ8j-W6pv23mBQ/168s.jpg", "caption": "Skirt steak"}]}}, {"review": {"des": "Summary:  By far the best overall dining experience I've had so far.  Anywhere.<br><br>Ambience:  To get to the restaurant, you have to take an elevator manned by an employee, kind of speak-easy style.  The restaurant is beautiful - both inside and on the patio.  The view from the patio is spectacular, especially on an evening with perfect weather like the one we had.  The restaurant itself is beautiful inside - it's airy, intimate, but still has a communal vibe.  It's really a great blend of everything.<br><br>Service was top-notch.  Our server was very personable, knowledgeable, able to pair wines with dishes, and timely on everything they did.  <br><br>Drinks were VERY well crafted.  You pay for them, but you get quality back in return, along with service that definitely helps the overall vibe.  You can spend plenty of time here and have a great night without ever going into the restaurant...but the rooftop  gets more crowded as you near sunset.  So if you don't like crowds, come early or late...and enjoy what you see - they're both great.<br><br>Restaurant - the food was terrific!  I had salmon, and it was done pretty well.  We had the mac/cheese, which was very well balanced, saucy (I like that), and easy to eat.  Everyone at the table liked their dishes.<br><br>Afterparty?  The Drawing/Milk/Game Room are in the same building, a lot of fun.  It makes this the best go-to if you want to spend an (expensive) evening with friends - either having drinks, lounging, or playing games.  When I go to Chicago, I'm taking people here...it's well worth the money.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rRR7kMc1lV9v8vnx5QIWqg/348s.jpg", "caption": "ice cream bar dessert."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vzXHcjgJefy8FB2bd20PRw/168s.jpg", "caption": "Salmon + asparagus"}]}}, {"review": {"des": "Gorgeous view and good drinks! It's best to get a reservation for the table seating if you plan to eat, but the drinks at the bar are good and the view outdoors is lovely, especially when it's not cold out! There are a few fire pits outside that help warm things up. Best time to go is around dusk so you can see the view during day and night!", "pics": null}}, {"review": {"des": "One of my favorite things about Chicago is that there are a lot of roof top bars to choose from. For a roof top bar, I would say Cindy' is on the less overwhelming side. It's located about 3 floors up, but you get a good view of Millennium park, the Bean and some skyline. <br><br>I do like the vibe of Cindy's. Very posh. However, getting to stand on the balcony isnt as easy as you think. You have to swoop in and grab any open spot that is by the edge to be able to get the most optimal view. <br><br>Overall, I like Cindy's but I wouldn't come here if you're looking for a grand view of the skyline.<br><br>P.S. there is a Shake Shack right next to Cindy's", "pics": null}}, {"review": {"des": "What a magnificent restaurant with a mesmerizing view of Millennium Park from its rooftop. The restaurant is well lit by the natural light from outside. The rooftop was packed for the people to just hangout with their drinks. We arrived for supper. We ordered our drinks and food, went on the terrace to enjoy the view. It was fantastic. Back in the dinning table, we enjoyed our Caesar salad with the most appetizing seafood platter. It had lobster, crab legs, jumbo shrimp, oysters and crab salad. We devoured everything with a lot of joy. The service was very admirable. From the niceness to speed, it was perfect. At the end our dinner, we went back on the terrace again. It was a perfect experience.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JZSWg5-7lEGDHUxQxSnM_g/348s.jpg", "caption": "Magnificent view"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/N8AGyp2v41aHEC1rz16a4Q/168s.jpg", "caption": "Caesar Salad and seafood platter"}]}}, {"review": {"des": "Loved the location on top of the Chicago athletic club. Well heeled doorman usher you into the entrance to lead you to the elevators in the back that take you to the rooftop restaurant that allow you to take in all of the bright lights of Chicago's skyline. Was packed even on a Wednesday night but wasn't surprising given the great service and the draw dropping views. The service was excellent and the food was delicious. We opted for the burrata as well as the scallops. I had the lullaby cocktail which was excellent. Next time I am in Chicago I will be sure to go back!", "pics": null}}, {"review": {"des": "We came here for the views and ended up getting baked by the sun. The famous rooftop restaurant usually doesn't have any open reservations, but they do allow for walk-ins and open bar seating. My girlfriend and I came early during the lunch hour to get on the waiting list, around 11AM or so. One spot opened up shortly, but it was outdoors, which we will later find wasn't the best idea. <br><br>I'm not going to lie, the views overlooking Millenium Park were pretty amazing, but the sun was also really hot that day and it was blazing on us the entire time. We started off with some drinks, I got the Roman Holiday and my girlfriend got the Grey Garden, both really great drinks, featuring different alcohols mixed with caffeine. <br><br>For food, we shared the Smoked Fish Board, Lobster Roll and the Duck Confit. The smoked fish board came with salmon, great appetizer to share with a few people. Lobster roll wasn't anything too special, big chunks of lobster, the salt & pepper chips were a great complement. The duck confit was prepared nicely, but there were a lot of burned vegetables on the dish, not sure if that was the intent they were going for, but that made the dish a bit off-putting. <br><br>Views and drinks were great. The food was alright, definitely room for improvement but it seems like most of the parties weren't really there to eat, but to hang out and chat. Worth checking out for some quick drinks and pictures, but I'd rather grab food elsewhere.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/deVt2ePFEzTbjffvebA1Gg/348s.jpg", "caption": "lobster roll"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UaVIRTeHUmMB_SbYXFx-kw/168s.jpg", "caption": "smoked fish plate"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DJqrHwiL8iGjuivnstYrlA/168s.jpg", "caption": "Roman holiday and grey garden"}]}}, {"review": {"des": "This was my first time at this bar and I must say that I did enjoy it. The atmosphere gives a great vibe and it's so pretty inside. The rooftop gives great views of the city an millennium park.<br><br>There are two bars with friendly and knowledgeable bartenders. The only bad thing about this place and what would prevent me from coming back each time I'm in Chicago is that they do not have Happy Hour. The drinks are quite pricey (read my whiskey sour was $14) so a special would be quite helpful. <br><br>Give it a shot though, you will like it", "pics": null}}, {"review": {"des": "This is definitely a popular place! I arrived with coworkers and they had a bouncer on the main floor of the Athletic Club. If you're name wasn't on the list or you didn't have reservations, oh you weren't even allowed to stand in line. Luckily we had reservations and by-passed the line and went directly upstairs on the elevator. As the doors opened you see the bar. Boy was it crowded!!!! We were seated and ordered drinks. Not your typical drink menu but the variety was definitely unique. I simply ordered a lemon drop. It was strong and very good. We shared apps, the shellfish platter and another platter - but I'm forgetting the name. It was decent. For the main course we had the pork and this pasta which BOTH were very good! The waitress was really patient and knowledgeable about the menu. All in all I had an amazing time!<br><br>I do want to come back when it's warmer outside. The view of the Lake was beautiful!!!", "pics": null}}, {"review": {"des": "Amazing view!  We came here around 8:00pm on a Sunday without a reservation- we were able to walk to the bar to order drinks, but then we went to the patio to take in the view of Millennium Park and the lake.  There were no reservations for the weekend available through <a href=\"/redir?url=http%3A%2F%2Fopentable.com&s=897c359bd752b4f5407d5ea86453c82be2d1913c8d0b51b18d81fc58f52a6497\" target=\"_blank\" rel=\"nofollow\">opentable.com</a> so plan ahead if you want to eat.<br><br>This restaurant is on the 13th floor of an athletic club.  There's an elevator on the right of the main lobby that takes you straight there (main lobby has a Shake Shack on the left).  There are red ropes that help corral the line in front of the elevator.  We only waited for one elevator ride, but I can imagine waiting forever I this line!!<br><br>Service at the bar was quick and professional.  I ordered three drinks at once, they were all made simultaneously.  Each cocktail was served with its own specific garnish.  The specialty cocktails in their menu are in the $15-20 range.<br><br>$20 cocktails weren't too excessive considering the location and the quality of the ingredients/mixers/garnish.  Think of it as paying for the patio and the view and the selfies.  If I lived in Chicago I would see myself frequenting this place with friends!<br><br>Also, get some Shake Shack when you leave.", "pics": null}}, {"review": {"des": "Five stars for the ambiance, but four stars for the value of food versus price = four stars overall.<br><br>Coming to Cindy's, you are very much paying for the view of Lake Michigan and being on top of Chicago. Don't get me wrong: it's absolutely beautiful up here. So much natural light with all of the windows, and such a cool vibe up here.<br><br>That said, the food is a little bit overpriced, although tasty. One may also be turned off with how long in advance you need to book reservations. I booked my 4:30pm April Saturday reservation back at the beginning of March, just to give you frame of reference. That said, you do not need reservations to go up to Cindy's; you're welcome to stand around and attempt to grab a chair (or floor space) by the bar or outside on the balcony if you're lucky enough to snag a spot.<br><br>You will have to wait downstairs in an elevator line to get upstairs to Cindy's, which I think is located on the 13th (yes, the 13th!) floor, regardless of whether you have reservations or not. We waited for a good 10 minutes in line for the elevator. And then once you're in the elevator, they literally only let six people on at a time, even though there's so much more space on the elevator for more. I guess safety comes first.<br><br>We started with the charcuterie board of three items, which only includes meats (cheese comes on a separate board) with pickles and peppers, as well as a side of bread. The meats were as fine as a charcuterie board of meats can be. We ordered the spring tagliatelle, the cobia loin, and the roasted mushrooms. Of all of the aforementioned plates, the mushrooms were my absolute favorite. I could have eaten them for days. The mushrooms were so fresh and the butter sauce was to die for. The tagliatelle was also very fresh tasting; I think it was the egg yolk that did the trick. The pasta was so good that I even got my five-year-old son to eat it, despite it including (heaven forbid!) asparagus and peas in the mix. The cobia loin was a nice thick cut, and the rub that they cooked the cobia with had a bit of a spicy kick. All very good.<br><br>For dessert, they brought me a complimentary birthday dessert: a profiterole with birthday cake gelato (i.e. with sprinkles), which was just okay for me. We also ordered the golden pineapple tarte tatin. My husband said that it was probably the best dessert he's ever had, with the flakes of the puff pastry and the technique of the caramelized pineapple.<br><br>Unfortunately, it was a cold rainy April day, so we really didn't get to take advantage of the outdoor balcony, but we hope to return soon to give it another go.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/X1jZVXssCmew5P_1dyXUdw/348s.jpg", "caption": "Complimentary birthday treat: profiterole with birthday cake gelato"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xPBySZExU5GGTR2HhdB69g/168s.jpg", "caption": "Cobia loin with lentils"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9OOh7VTfw7HrXrRYSivWfA/168s.jpg", "caption": "Roasted mushrooms. To die for."}]}}, {"review": {"des": "My boyfriend and I went to Cindy's on a Saturday morning. We just beat the brunch crowd, arriving around 9:30. We were pretty hungover from the night before, so we stuck with an iced latte and the raspberry mint kombucha. The iced latte was what you'd expect, but the raspberry mint kombucha was very light and tasty. Sometimes kombucha has a bean-like fermented aftertaste, but this one was lightly sweetened and super refreshing (it was 95 degrees that day). <br><br>The fruit platter was beautiful- at 24$, it was quite pricey. For 24$, I recommend getting an actual dish but my boyfriend and I were just looking to eat a light meal. The presentation was gorgeous and the yogurt, honey, and garnishes went so well with the fruit. I can appreciate a beautifully executed dish. However, I know that it's not everyone's cup of tea.<br><br>The avocado toast was delicious. Very basic, of course, but it went well for us with our fruit platter. <br><br>The view was to die for, looking over Millennium Park and the lake. If you want to stop by just for a drink, I highly recommend Cindy's!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-F3YaOQ_UYKJ6Z2HlaGiOQ/168s.jpg", "caption": "The gorgeous view!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/k1fPI96oxL92UJw06rCopA/168s.jpg", "caption": "Pictured: the avocado toast and the fruit platter"}]}}, {"review": {"des": "A nice rooftop overlooking some of the more popular landmarks in Chicago.  It's a great place to go to grab a drink before heading elsewhere.  However, there are a ton of rooftops in Chicago that have a way better view and are not as consistently crowded in my opinion.  My favorite thing about this place is watching the Navy Pier fireworks from the terrace, if you time it right and find some space to stand it's a great moment.  <br>Their cocktails are good, but for the price I think they can make them a little stronger. I've never tried the food, but I've heard from others that it's good as well!", "pics": null}}, {"review": {"des": "My friends and I decided to have brunch at this place while we were visiting Chicago for the first time. When we arrived, we weren't welcomed or greeted by the hostess. When we told her we did not have a reservation, she gave us the menu and asked if we still wanted to dine in.. Umm that's why we're there.. We said yes, and she gave us a table that was facing a green tree. We went for the view and got just grass up in our faces. We all sat horizontally next to each other so it was hard to communicate. We decided to go back up to the hostess to see if there was any other table available. She was on the phone so we told another host. She heard us asking the other host (while talking on phone), and just replied \"No\". Not even a simple explanation or an apology. Just a plain, rude \"No\". Hostess/host has the responsibility of making customers feel welcomed and we got ZERO. Yes, it's a great place to dine with a beautiful view, but customer service is key. We walked out of there with disappointment of this hyped place all because of that one hostess. <br><br>P.S. She was rude to other customers too. Other customers made eye contact with us and gave us that look. Didn't see her smile once.. Like how is she the hostess?! Everyone else was nice. She clearly doesn't belong there.", "pics": null}}, {"review": {"des": "Cindy's rooftop restaurant. Such a beautiful view. The vibe here is amazing, everyone is so nice. The ambiance overall was just relaxing and with a great view of the city. But that's not why you're here.. so let's get going on the food review.<br> Drink: I'm fancy (take me to Costco and try all the samples fancy.. jk) so I tried a peach lavender kombucha, came in a very classy glass (extra AF kombucha) but it was good, you can definitely taste the slight hint of lavender but it wasn't over overwhelming. <br>Food: Chicken Malanese... did you read about my pineapple obsession review? Well, I'm also obsess with anything and everything fried chicken, and this was the best fancy ass chicken I've ever had. It was juicy and tender and the veggies and sauce that came with it was delicious. <br>Pork sandwich: it was really good with the perfect amount of seasoning and the chips that came with it was no regular chips.. it was like homemade chips. Tasty. <br>Definitely give this place a try, it's a must!", "pics": null}}, {"review": {"des": "Little pricey for a rooftop bar. I paid $14 for a rosè before tip. But the view is amazing! They also have an outside deck place and they have a fire pit that about 12-14 people fit around which is great for chilly nights. They also have a nice big booth that fits about 6-7 people to chill. The inside is also pretty big and they have plenty of tables to sit with no matter your party size.", "pics": null}}, {"review": {"des": "*bar review only*<br><br>I've been here maybe twice and each time I'm lucky to score a spot at the bar...l have never actually purchased food from Cindy's but it all looks delicious as I watch it pass by the bar! <br><br>The beer selection is awesome, and the cocktails are pretty delicious as well. The only downfall that I had was I felt the prices were a bit high...but then again it's located right next to millennial park so that should be expected!<br><br>The standing area outside is why everyone comes to this place to have a cocktail after work because it is honesty amazingly beautiful. I will say that some of the patrons are rather oblivious to how much space they are taking or the amount of elbows that you without a simple I am sorry.<br><br>Hopefully I get to come out and actually try the food eventually!", "pics": null}}, {"review": {"des": "Only came for drinks on the rooftop, we were eating at shake shack and then the line died down and we saw our opportunity. Had a quick 5 min wait and then headed up the elevator and went to the outside bar and standing room. Got some cocktails, waited a few minutes for a railing spot as it wasn't busy and enjoyed the breathtaking view. The prickly pear drink was delicious!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/N5KmmgQ4LdPCxImAlu0hTA/348s.jpg", "caption": "Prickly pear with a view"}]}}, {"review": {"des": "I had such a great time here I'm not even sure where to begin! The inside of Cindy's is beautiful, high ceiling with windows, string lights, and flowered tables. There was a wait to be seated at a tables but if you're just getting a drink you can go to the inside or outside bar. It had just started raining after we got there so the outdoor bar closed for the evening. My friend and I drank a friesling (alcoholic slushy, how cool is that?!) and a Leila. We really enjoyed both drinks, despite the number of times I got brain freeze. The bar tenders were awesome, they were helpful and gave us a good laugh. Shout out to Edgar for making our awesome drinks. The view was beautiful and we had a great time outside despite a little bit of rain.", "pics": null}}, {"review": {"des": "It's a beautiful restaurant with a great view of the bean and the skyline. Our waiter, Brian, was soo friendly and kind!!! He made our experience here increíble. We will definitely come back. The Brussels sprouts were great and the sauce they put on them is superb. The chocante pastry dessert is awesome too! It's filled with cream and topped with ice cream! Nothing better.", "pics": null}}, {"review": {"des": "I came here for a work happy hour and my goodness the views of Chicago are stunning! Since I was fortunate not to pay out of pocket I enjoyed their cocktails and wine options, but this is one of the pricier places you can go to grab a drink downtown. I would recommend Cindy's over places like the signature room or any views from the sears (Willis) tower though because of the amazing view of grant park", "pics": null}}, {"review": {"des": "I absolutely loved it and how they had all these different rooms in the building. Great space for a cute date for sure", "pics": null}}, {"review": {"des": "The views and bartenders are to die for!  My friend and I stopped by for brunch on a Saturday afternoon without a reservation...oops!  We were placed on a waiting list which we were told could be over a hour and half. We ended up finding a spot at the bar and we were happy to sit there to eat.  Our bartender...forgive me husband I forgot your name...was amazing.  He was so funny and sweet.  Very quick to get all of our items. We were even interested in trying this Aperol Spritz drink that everyone was ordering but we were afraid we would not like it.  I tried this drink when I was in Greece and hated it but thought maybe they made it wrong...  He made a smaller version for us to try anyways.  Long story short we hated that nasty drink but others loved it and it was so nice of him to make us a sample.  <br><br>The miss for me was the menu/food.  The menu was very limited and nothing on it really sounded that great.  We ended up with the CHILAQUILES which was not very good and $27 which is outrageous.  I would skip the food ...at least at brunch...but go for the drinks, view and awesome staff.", "pics": null}}, {"review": {"des": "Noticed this rooftop from millennium park and was curious enough to go upstairs and check it out! Came here around 4pm on a Tuesday and it was reasonably packed. It was a little hard to get a spot facing the view but with a little persistence and waiting it was possible. The bar was also packed but once we got to push our way through we were finally able to order. <br><br>I got the Leila - which is known as one of their top selling summer drinks! Tasted flowery and was pretty much what I expected. Loved the vibe and of this place and can see it being somewhere people come to socialize after work. From what I know it's one of Chicago's hot spots for sure!", "pics": null}}, {"review": {"des": "Beautiful rooftop bar , nice view of the lake and millennium park. <br><br>The food was alright but drinks were great. We ordered grey garden drink very fresh I love it. <br><br>The thing that I give 4 starts because our service very slow my friend would like to order drink but no body come to our table. <br><br>Overall, good for the view", "pics": null}}, {"review": {"des": "Wow what a view. This place is high class and definitely a place to impress your friend z. Had a lovely adventure at this place. Next time will try to go to the only 8", "pics": null}}, {"review": {"des": "Good drinks, a great vibe, nice clientele, and an unbeatable view.  Definitely worth checking out when the weather is nice enough to enjoy the outdoor rooftop.", "pics": null}}, {"review": {"des": "Cindy's was a great place to grab a drink with a great view. The drink menu is extensive and there are a lot of great cocktails. <br>I had the welcome back cocktail and it was as advertised - a different take on a Moscow mule. It was refreshing, well crafted, and strong.<br><br>The view was amazing as well. The outdoor seating/standing area has a great view of Millennium Park. The indoor area is also cute and well laid out.<br><br>The reason for the 4 star review was that my drink was $16 which seemed excessive. I suppose I am paying for the view which makes sense but it was still a little shocking.", "pics": null}}, {"review": {"des": "This review is purely for the drinks and the view.<br><br>My parents and I came here over the summer. It was a beautiful day. There was a long line for the elevator since there's only one that goes up to he rooftop, but we didn't mind. We waited for about 15-20 minutes. If you go there for drinks, there's no wait upstairs. If you want to eat, you have to wait a bit longer.<br><br>The place was packed and everyone seemed lively. I ordered the Howl at the Jun cocktail and my mom ordered the Virgin Pillar. Both were refreshing and sweet. It's on the pricey side but that's what you can expect from a Chicago rooftop bar. The cocktail filled up most of the large wine glass so I thought it was worth it. <br><br>The interior is beautiful and their view of the city is breathtaking. I'm not going to post the picture because you MUST see it for yourself!! ;D", "pics": null}}, {"review": {"des": "If you are looking to take in the views of the city....this is the place to go.  You can walk up stairs or take the elevator to the top floor. Seated dining is an option, but you really want to do is grab a cocktail and walk out to the patio overlooking the park, lake, and breathtaking views that the city has to offer from the north to the south.  You can see Indiana and probably even see Michigan on a clear day.  This place is a great venue to take a step away from the hustle and bustle of the busy city and breath in Chicago.  I look forward to going here with friends and sharing this with new friends.  This is worth the stop if you find yourself on Michigan.  Bike parking on street.", "pics": null}}, {"review": {"des": "This cute rooftop restaurant is the perfect spot to have a nice casual date. Decor is clean and beautiful when the suns out. The food was phenomenal! <br>I had the farm spinach and kale salad with salmon. The salmon taste fresh, seared and seasoned to perfection! Salad is well balanced, refreshing and what I consider clean eating! After having loads of pizza, this was the cherry on top during my mini trip to Chicago. I had a couple bites of the lobster roll, it's refreshing! The Asian pear gives off a nice crunch texture to the sandwich. Most lobster rolls are heavy in butter and fattening, rather Cindy's offer a nice light lobster roll and feel less guilty eating it lol. <br><br>Overall,<br>Service is very fast and attentive, The staff is amazing, and of course chef ragano is awesome! It's really nice knowing the food matches the quality of the people and restaurant itself. Thank you for the wonderful experience.", "pics": null}}, {"review": {"des": "After lunch, I needed to walk. I love rooftop bars, so even though it was cold AF, I made the roommate walk over a mile in the freezing cold to go to Cindy's. We got here on Tuesday, December 5th around 12:15pm. We didn't have a reservation, but we headed straight to the bar and grabbed two stools.<br><br>*The Old Fashioned: russell's reserve 10 yr, demerara syrup, angostura bitters, orange peel ($16)<br>*Eagle Rare 10 yr ($14), Manhattan (+$2)<br><br>Nothing on the menu called to me, so I just got an Eagle Rare Manhattan. It was nice as it wasn't too sweet. (Sometimes Manhattans can be too sweet for me.) The roommate isn't much of a cocktail drinker, so he got the old fashioned. I don't think he liked it, but he knew I really wanted to check out the patio area, so he bared with me. We finished our drinks at the bar and then headed outside. Their patio area has firepits, so on a normal day, the cold would probably be bearable. But on this day, it was so cold, I just took my pix and video and went back inside. It was that cold! The view is amazing. You get Millennium Park and the water. So pretty!<br><br>Great spot to enjoy a cocktail and the views. On a nice day, it would be fun to sit outside and just take in Chicago. Such a beautiful view!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_KtoiSsqIGr5HmT8hqdE9g/348s.jpg", "caption": "The view"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/87kuksloPOp3AJFmgtjleg/168s.jpg", "caption": "The view"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/epAs5y7YpMj8V2l-jM5RsA/168s.jpg", "caption": "Eagle Rare 10 yr ($14), Manhattan (+$2)"}]}}]}