{"name": "coalfire-pizza-chicago", "reviews": [{"review": {"des": "Coalfire Pizza has become one of our go-to dinners in the city of Chicago.<br><br>When it comes to woodfire thin crust pizza with delicious sauces and fabulous toppings, you can't beat Coalfire. <br><br>The staff are always friendly and attentive at Coalfire, providing a wonderful customer experience!<br><br>The pizzas are to die for! The best thin crust in the city! Are go to pizzas are the ricotta cheese and pepperoni pizza and the stracciatella and sausage pizza! We have actually gotten into a bit of a rut because these pizzas are so scrumptious and satisfying!<br><br>They also have a very nice selection of beer, wine, and cocktails! And the appetizers and desserts are wonderful if you want to save room!<br><br>If you haven't been to Coalfire, add it to your must visit list! You're taste buds will thank you!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PBIh78XTTBbMi13ipasTfA/348s.jpg", "caption": "Pepperoni & Ricotta"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/N93Ina5jeJ5h99nOSU99_g/168s.jpg", "caption": "Sausage & stracciatella"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mm-kwPwNcjjrsILdgk0CJQ/168s.jpg", "caption": "Sausage & stracciatella"}]}}, {"review": {"des": "Coalfire Pizza is super good!! I've tried several of the pizzas and they are all good choices! Anything with whipped ricotta is a must try! I've also ordered pies to go and the whipped ricotta just comes on the side so it won't be a curdled mess by the time you start eating. The pizza is 5 stars for sure.<br><br>Service is definitely where Coalfire could improve. The grand location is small so there's long waits. I get that can be overwhelming, but the hostess/lady outside taking names was just straight up rude. She was yelling at her coworker to write down our phone number even though she was holding the pen and clipboard and was standing right next to him. She also said something to which I nervously chuckled in response and then she snapped back at me saying it's actually not funny! The Southport location has long waits too, but I'd advise going to that Coalfire for a better experience. There's also more bars and shops to peruse while waiting for a table over in the Southport Corridor. <br><br>Definitely order the pizza to take home or check out the other location!", "pics": null}}, {"review": {"des": "Chicago has a wide array of pizza selections and it's not always about the deep dish. One of my favorites is the local Coalfire Pizza who serves thin crust pizza with crispiness and a slight airiness in its crust. We have tried several flavors:   <br><br>1) Pistachio pesto - pistachio pesto, mozzarella, berkshire sausage, stracciatella, honey. Honey on pizza was not weird at all and I liked how this arrived last because the sweetness made it a borderline dessert pizza. This is now one of my favorites. <br><br>2) Vodka meatball - mozzarella, vodka sauce, meatball, basil,<br>stracciatella, pecorino romano<br><br>3) Lasagna - mozzarella, sauce, berkshire sausage, sweet red<br>pepper, whipped ricotta, basil, garlic. The whipped ricotta was excellent! <br><br>4) Bacon jam - sauce, mozzarella, sopressata, bacon jam,<br>stracciatella, chives<br><br>5) Heirloom tomatoes - This was the special of the evening because tomatoes were in season. The waitress was not lying when she said this is a must-try.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/onwVSeXscWnQZvj-LJnkwA/348s.jpg", "caption": "Lasagne pizza"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/29mKqmB9UnOKeO8gKdhsbQ/168s.jpg", "caption": "Bacon jam pizza"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fBZ0IX01evwkbYd8KdYN6Q/168s.jpg", "caption": "Vodka meatballs pizza"}]}}, {"review": {"des": "Coalfire was our last stop while on the Chicago Pizza Tour, and it was one of my favorites!  Foodies will love this place.<br><br>There's a huge difference between coal-fired pizza and your typical oven baked pizza.  Coalfired gives thin crust a crispy, crunchy, airy crust handle, with bits of char on each bite.  The char gives the pizza an extra layer of flavor that other pizza doesn't have.  <br><br>I'm sort of in love with the dollops of ricotta cheese that is squeezed onto each slice.  I spread that dollop over my entire slice so I get a taste of it in each bite.  The crust is super thin, and so you don't feel like you're eating a ton.  It helps if you fold the slice in half (like NY pizza) so that it doesn't flop over and you lose all of your ricotta!<br><br>We had the white pizza and the pepperoni.  Both were equally delicious.  I prefer the white.  Garlic, cheese, olive oil and fresh basil pair so well together - no red sauce is needed.  I was stuffed to the gills, but wanted so badly to cram more slices into my mouth!  <br><br>I so wish they were located in the suburbs so that I could eat more of this heavenly grub. Check them out if you want quality!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FP3degmBjszWUHnU__wJ9Q/348s.jpg", "caption": "White pizza"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LIA3CF99ynU7YFgcXtdD7w/168s.jpg", "caption": "White pizza.  Garlic, cheese and basil goodness"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/j2VqvWYoaZmgB06ahIczDQ/168s.jpg", "caption": "Pepperoni with yummy ricotta blobs"}]}}, {"review": {"des": "Um.... lasagna pizza!! So so good!! This place may be little but the pizza is awesome. As a Milwaukee resident and lover of all things pizza... we need to get some ricotta cheese dollops on pizza! I'm definitely going to try to recreate this at home. Saturday night we had to wait 15ish minutes for a table for 2 at 6 but once inside... service was fast and great!", "pics": null}}, {"review": {"des": "If you're into very traditional, \"American\" style pizza and not one to venture out of your food comfort zone I would not recommend coming here.   I say this because if you're at Coalfire, you absolutely must get one of their signature pizzas (I recommend the Pistachio Pesto).  I love how thin the crust is and the hint of charred flavor that comes with it.  You can always tell how fresh the ingredients and toppings are.<br>I will say that I enjoy the ambience of the Lakeview location best as it's bigger and brighter, but West Town gets a pass, being that it's the original.  <br>I remember my first time coming to Coalfire was part of one of the Chicago pizza tours.  It was our last stop after visiting Pizano's , Pequod's and Flo & Santos.  Coalfire stole the vote, with everyone being upset that they were too full to fully enjoy their delicious pies since it was our final pizza destination.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vwBuP1mLSCqDsrmkZpDOPg/348s.jpg", "caption": "Half pepperoni, half pepperoni with whipped ricotta"}]}}, {"review": {"des": "Haven't been here in a bit, decided, why not?  Last time it was good why not try it again?  We had a house salad- leafy greens- and just a bunch of radishes. Not anything special at all.<br><br>Two pizza's ordered, my wife doesn't eat meat- she had the Margherita Syle pizza and and ate less than half with plans for two more meals out of it later. I had the Burnt Onion, sausage pizza.  Ate half, will eat the other half in a follow up lunch at home.  My pizza did not really fix my craving for great pizza, it was ok but not great.  The crust was thin, I felt it could have been more crisp.  I think when I reheat it in a pan, I will achieve what I was looking for in the pizza.<br><br>My wife had a glass of wine, she enjoyed.  Service was top notch, we were seated right away, and the food came in a reasonable amount of time.  A bit on the pricey side, but I expected no less. There was plenty of free street parking, so that made me happy.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QybTJxOz6Ef4Z8cwG_cgAw/168s.jpg", "caption": "Margherita Style"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DXBhdwUeWQnKjwS6HiGTmA/168s.jpg", "caption": "Pizza with burnt onions and sausage"}]}}, {"review": {"des": "My husband and I shared the pepperoni and whipped ricotta pizza. The pizza was good, it was thin, perfect amount of cheese and the sauce was tangy and sweet. We wanted to try it the ricotta at least once because it's a popular thing to get at Coalfire but it wasn't for us. I'd go back for the pizza but skip the ricotta.", "pics": null}}, {"review": {"des": "My review is based on the insulting experience had by my friend on her birthday visit, 11/18/17. I am appalled that customer service has fallen to such a low level.<br>Was just verbally accosted by the owner for asking why my friends had to stand in the cold while we waited for a table in his HALF EMPTY restaurant. After being yelled at inside of the restaurant I told him we would leave. He followed me outside to berate me even as I was walking away from the establishment he continued yelling at me & my guests.  Please share. (via Julisa V.)<br>I stand with you to say NO to poor customer service. The stresses of the world are enough, so when you go somewhere to unwind the expectation is not to be insulted or berated. Again, Julisa, I STAND WITH YOU.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WfleBlo_X-Qhsh1j6_a5fw/348s.jpg", "caption": "Very poor customer service. My friend is cerebrating her birthday, then this."}]}}, {"review": {"des": "We're pretty much obsessed with this place.  I've tried quite a few of their pies and have loved almost every single one of them.  The only pizza I have mediocre feeling about is the margherita, but honestly, I just think margherita pizza is generally overrated and don't understand the hype of it, so my opinion may be worthless there.  The pistachio pesto is my all time go to, that I force every visitor I have come to Chicago eat, and they all thank me for it after.  You guys, it is SO GOOD.  When I had a vegetarian friend in town we substituted the sausage for mushrooms and it was honestly equally as good.", "pics": null}}, {"review": {"des": "On this particular Thursday night, the restaurant was pretty empty and the service was super quick. Lucky us! We ordered right away and had our pizza and beers within minutes. It was difficult to choose one, but for two of us we shared the Sausage and Stracciatella pizza. This was delicious and had a nice spicy kick to it. Stracciatella is a kind of white cheese, which we didn't know prior to ordering. We had leftovers, so one pizza is definitely a more than good enough portion for two. Great wood oven thin pizza!", "pics": null}}, {"review": {"des": "We went in a pizza tour.  Pizza was good..lots of yummy options!  Good beer selection.  You need to like coal fired or wood fired to appreciate.  Service was ok...only one staff was at all friendly.  Others seemed very grumpy. In all fairness we were with a tour so that could have played into it.  Give it a try!", "pics": null}}, {"review": {"des": "Owner - you are truly one of the worst human beings I have encountered in a restaurant business EVER. I could care less how good your pizza is - the way you behaved was beyond reprehensible. Absolutely NO excuses. <br><br>Truly sickened by the experience of having to deal with the owner of this establishment. I feel so horribly for those who have to work for him and it was made VERY clear that my disgust was validated in their response. <br><br>No - the pizza is NOT worth it as Human dignity and respect is absolutely lacking by the owner of this establishment.<br><br>Enough with the \"good pizza\" reviews - plenty of it in this town without completely abhorrent  owners behind it.", "pics": null}}, {"review": {"des": "Honestly there are not enough stomachs err.. words to express how greatly I love Coalfire. I was taken here by my brother who lives in Chicago after we told him we were interested in thin crust this visit. Our first visit we came here after watching a Wisconsin basketball game at the bar, so I don't think I was able to fully appreciate the greatness of this pizza. But my husband and I returned the next visit and truly took it all in. <br><br>We were worried about it being busy for a Friday, as we know the location isn't huge but our worries were unfounded as we walked in and were seated as soon as they wiped the table off. Our server was pint sized and fun. A true joy to be around, she kept our drinks refilled and made sure to check in and give us updates. <br><br>We got two pizzas, one was Sausage Vodka (our server recommended it for us) and the Margherita and both were EVERYTHING to me. I can now die happy. I was one of those people mm'ing and sighing with every bite. In hindsight, maybe annoying for our table neighbors as you are tightly packed in there. My only regret is my stomach not being able to hold more. Between the two of us, we left two pieces on the table and we showed up ready to eat. <br><br>But seriously. I would come back here again and again. It has a great pizza parlor vibe, love the cream brick walls and being able to see the pizza ovens.", "pics": null}}, {"review": {"des": "Really good pizza, had the Jalapeño pizza. It was spicy and delicious! I had it for delivery so crust was more on the flimsy side. Would have to dine in and try it.", "pics": null}}, {"review": {"des": "Since we moved to Lincoln Park, we are always at the Coalfire Southport location.  We went to the Grand Ave location this evening for my sister in laws 40th.  The food and service were excellent as usual. There were 20 of us and we took up the middle of the restaurant!  The owner was very accommodating and it made a great evening for the whole family young and old.", "pics": null}}, {"review": {"des": "I somewhat enjoyed the pepperoni, cheese, and ricotta pizza despite the fact that the edge of the crust was a bit on the burned side.  As I ordered delivery they put the ricotta on the side to scoop on yourself so the flavors did not really blend as I imagined they would when cooked together. The pizza sauce was quite bland; however, the pepperoni was stellar!  <br><br>It was good to try a new pizza place-but I am not sure that I would order from here again.<br><br>The salad with radishes and herbed vinaigrette was a substantial size and very fresh.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RP47e0i095gBReCq9UIm7w/348s.jpg", "caption": "Ricotta was on the side...I wanted it baked into the pizza like they do at the restaurant"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HcF2so0a072-0P_BHKM5Rw/168s.jpg", "caption": "Fresh salad with herb vinaigrette"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iaC5UTJbXa1ApGkDN956rw/168s.jpg", "caption": "Cheese to sprinkle on the pizza"}]}}, {"review": {"des": "This is one of my favorite pizza spots in Chicago. The slices are actually really light and airy with a good amount of flop. I've gotten the vodka meatball and the white pizzas and they are absolutely delicious. If you are looking for a good NYC style pizz in the city, come here.", "pics": null}}, {"review": {"des": "Optimally charred and bubbly, thinnnnn crust pizza from Coal-fire! Been there a bunch of time now, and want to warn the pizza lovers out there- definitely go with your stomach empty. I personally like to dine in as compared to carry out as it's obvious why.. <br><br>My personal fav- Pepperoni and whipped ricotta Pizza, and two of them for me please. However, other pizzas, almost all of them are delicious. <br>The pesto pizza is a bit sweeter as I believe it contains honey. Personally, not a big fan of the sweet taste on my pizza, but I'm sure it's worth a try. Lots of other options available for sausage and meat lovers, as well as multiple options available for vegetarian friends.. you can also build your own customized pizza. <br><br>What else, Beer? They got a decent collection of beer and wine. I once took my friend here on his birthday and they brought a cute lil cupcake with a candle for him. <br><br>Always experienced good customer service.", "pics": null}}, {"review": {"des": "Favorite restaurant in the city! Pepperoni and whipped ricotta is a must order! Margherita pizza was delicious too. Friendly staff and great neighborhood feel.", "pics": null}}, {"review": {"des": "If you're in the mood for thin crust pizza and great service, this is the place for you!<br><br>The pepperoni and whipped ricotta pizza is really good, and the one pizza was enough to feed two people plus leftovers. Service was quick, and since we came early to beat the crowds we were in and out in under an hour!", "pics": null}}, {"review": {"des": "My favorite pizza joint in Chicago. <br><br>They serve thin crust, Neapolitan style pizza. Tried a bunch of their specialty pizzas and you can't go wrong with any of them. I've been come to this place for years and still stands up against the test of time and other competitors.", "pics": null}}, {"review": {"des": "Every time I visit Chicago, I make this a dinner stop.  They consistently change out their pizza options by season and on this visit we were fortunate to have the heirloom tomato and mozzarella salad appetizer.  The tomatoes were rich with flavor and the mozzarella was firm without being stingy or over worked.<br><br>We had the Vodka Meatball pizza and the toppings were disbursed evenly, the crust was cooked with a thin crisp crust and the basil was very fresh.  I always enjoy the adventure of new Neapolitan style pizza when I visit this location.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4e0D74nXm39-203VjVcV-Q/168s.jpg", "caption": "Heirloom tomato and mozzarella"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6JSQRNDFjSxd0uaXWNpY1w/168s.jpg", "caption": "Vodka Meatball pizza"}]}}, {"review": {"des": "The crust and whipped ricotta are top notch so definitely get the ricotta if you can. The only problem is pick minimal toppings as the middle starts to get too thin and soggy, or maybe it just needed to be cooked longer.<br><br>We did a create your own with spinach and tomatoes and whipped ricotta which might have been too many toppings. Still so delicious.<br><br>Service was a little pushy, kept asking us if we wanted more beers after messing up a beer order. But wasn't a deal breaker for a next visit!", "pics": null}}, {"review": {"des": "Really the only nyc pizza that I will eat in chicago... i recommend their ricotta and meatball and their caprese salad. thin cheesy delicious fast", "pics": null}}, {"review": {"des": "This is a review for take-out. All I can say is, soggy pizza bottoms and not much flavor. The side salad was also underwhelming. The ricotta whip was okay though. There are so many non-deep dish pizza places in the city, so I think I'll try somewhere else next time.", "pics": null}}, {"review": {"des": "I kind of have a soft spot for Coalfire: not just because I enjoy coal fired pizza (duh), but because my +1 and I had one of our first dates here several years ago.<br><br>We went during the week, so it was a LOT less busy! Service was friendly and speedy. My water glass was filled (twice!) before I got past the halfway point. My only complaint is that there was a bunch of oil on the table under the condiments. blech.<br><br>I wish they had apps on their menu (I only saw salad, which IMO just doesn't qualify). We went straight for the pizza: the White, which was my favorite in NYC.<br><br>It was pretty good: I loved the fresh basil leaves. There were HUGE dollops of ricotta.. maybe too huge? You really have to eat the white while it's piping hot, or else the taste and texture are kind of \"meh.\"<br><br>I don't think we'd get the White again in the future, but am glad we tried it anyway. You can't go wrong with the Margherita!<br><br>On the night we were there, they ended up giving out complimentary slices of pie with the check! It was so nice! We (I) got cheesecake. It was just okay...Hey, I can't complain about free dessert!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CWAEKjImWeMHPzOdnZU1yA/348s.jpg", "caption": "cheesecake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Lf88qjzF4ci3dJSL99XBNg/168s.jpg", "caption": "White pizza"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_UDgvNmnnc0vwolqS_uy3A/168s.jpg", "caption": "White pizza"}]}}, {"review": {"des": "I've been ordering from Coalfire for about a year. Best pizza in Chicago!  Today, I ordered from Coalfire and there was an issue with my order that I placed through Caviar.  I spoke to Dave, the owner and he took care of everything.  I really appreciate that he made things easy for me.  <br><br>I also discovered that Coalfire is on the 1300 block (grand), walking distance from my house.  I've only known of the Lakeview location. Awesomeness!", "pics": null}}, {"review": {"des": "Great pizza and amazing service best coal oven pizza have had in Chicago can't wait to go back", "pics": null}}, {"review": {"des": "Second time to try this pizzeria- First time was during winter and there was a long wait to get a table but nonetheless the enduja was worth it. <br>This time around, we tried the meatballs and it too was great. I would probably come back but it isn't in my neighborhood and there are a lot more neopolitan, new haven pizzas out there to try.", "pics": null}}, {"review": {"des": "It can be hard to predict on any given day if there will be a wait here, but don't be surprised if there's a wait on weekends and at night, especially for parties of more than 4 people.<br><br>The drink menu contains a good variety of beers, especially for a pizzeria (pizza pubs don't count!). The house salad is standard, but I would recommend getting the Caesar salad which goes along with the pizza better. The salads are priced around $9 +/-, while the pies range from $17 to $20.<br><br>The pizzas are very tasty and are LOADED with whatever toppings you order. They come out of an 800° oven, so of course they're too hot to touch right away but the pies cool down quickly thanks to the thinness of the crust. The thin crust also helps the cheese, sauce, and toppings to really shine. Just know that depending on the toppings, you may find some of the pizzas to be a bit salty - in my case it was the sausage stracciatella. This put me on the fence on whether or not to subtract one star from the rating, but on second thought I do appreciate the place being generous with their toppings, especially considering that the pies are on the pricier side. Thus I am giving Coalfire 4.5 out of 5 stars, which rounds up to 5 stars.<br><br>Note that according to the menu, one pie is recommended to feed two people, but I believe that this recommendation was made based on the assumption that you will also order some salad and dessert. Otherwise half of a pie per person won't be enough to fill up an average stomach.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jODL4L5GxeQllB7tGfJU8Q/348s.jpg", "caption": "Top: Stracciatella & Sausage with chiles, red onions, and basil. Bottom: Pepperoni & Whipped Ricotta with garlic and basil."}]}}, {"review": {"des": "Stopped in for a very late lunch. We shared the pepperoni and ricotta pizza and it was delicious. Downed it with a bottle of the Weiss beer. Great food, great service. Excellent pizza.", "pics": null}}, {"review": {"des": "Coalfire is amazing. It is neither \"Neapolitan\" nor any other pizza style it may resemble by simply looking at it. It has a style all its own. The closest thing would be some of the very old Italian Immigrant style pizzas in New York City such as Lombardi's, maybe. Either way, it is one of the best pizzas in Chicago & has its own unique approach.", "pics": null}}, {"review": {"des": "Pizza here is great. Great location<br> The only thing I didn't like was I'm a mix drinker and the only thing they have is beer in the bottle.", "pics": null}}, {"review": {"des": "Great pizza in the West Loop! <br>They may try to convince you that deep dish is Chicago pizza... but it really is just carb overload. I'll take the Coalfire anyway of the week! It is thin crust and toasted up great. <br>The restaurant is small and unassuming. There is a decent wine and craft beer list present. Nothing too fancy, and the price is right too. The Margherita is simple and divine.... Fresh basil does it every time. And the sausage and the pepperoni are divine. <br>Don't go here looking for dessert.The Pizzas and the calzones are the attraction.", "pics": null}}, {"review": {"des": "Amazing amazing pizza! They have the most fabulous tasting pizza I have ever had.  Service is fast.  They only have beer and wine, wish they had some liquor.  Best fancy tasting pizza in Chicago.  Yum lasagne pizza and honey and salami!!", "pics": null}}, {"review": {"des": "My SO and I came here on a Saturday around 5 to try to avoid the lines as we heard it gets pretty crazy around peak times. We lucked out. We were seated immediately, and got our pizza ridiculously fast after ordering it!<br><br>The reason the pizzas can come out so fast is that they are baked in a coal fire oven. The thin dough get charred and delicious in just a few short minutes. Their differentiator is the dollops of whipped ricotta that they put on top of the pizza once it's out of the oven. This pizza is really delicious and the ricotta adds a nice creaminess and interesting texture combo to the top.<br><br>We both really liked the pepperoni and whipped ricotta pizza we ordered and would definitely come back. This pizza isn't piled high with toppings and cheese like some other pizza places, but the charred dough, thick cut pepperoni, and whipped ricotta make this a strong contender in Chicago's super competitive pizza scene.", "pics": null}}, {"review": {"des": "I had many pizza's when i visited Italy last year in various Italian cities, have lived in NYC and also tried a variety of pizza's there too. Having been to Chicago a few times I'm surprised I haven't found this spot before! <br><br>Although there are some great deep dish spots in Chicago i'm not a huge deep dish fan, so if you're in the market for a regular pizza this is hands down one of the BEST places I've had pizza! No waiting and Service was excellent too!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bl2y421DXZJ36YAnz61b3g/348s.jpg", "caption": "Build your own pizza w/ sausage, jalapeños & basil"}]}}, {"review": {"des": "Love this place! They have a wide selection of pizzas and they are so delicious, you really cannot go wrong. One of my favs is pepperoni with ricotta cheese. They also have a decent wine and beer selection, not huge, but nice options. The service is friendly and it's easy to get to. <br><br>They don't take reservations, but I recently hosted a small birthday party for my daughter and they were more than accommodating to our needs. There is not a ton of seating here, probably enough for 40 or 50 people. I tend to come on the early side and have never had to wait. Also I think they started delivering too, so will be counting on them to make frequent trips to my house!!<br><br>Definitely one of the best places for wood fired pizza.", "pics": null}}, {"review": {"des": "I take my thin crust pizza pretty seriously. I was beginning to think a good slice of thin crust was beginning to be a myth in Chicago. Until my boyfriend suggested going to Coalfire. I read a few reviews and saw some pictures and it totally won me over. I cam in with high expectations. <br><br>They have a selection of a few wine bottles for a great price and they repurpose their tomato cans into wine chillers and pie holders (very adorable). We ordered the lasagna pizza because reading the reviews I saw we had to order something with the whipped ricotta. Believe me you NEED to order a pizza with the whipped ricotta or at least have it as an add on it's unbelievable! It definitely elevates the pizza. The pie was cooked perfectly as well. I'm usually not the type to eat meat on my pizza but my boyfriend and I loved it so much. We can't wait to go back to get another kind of pie! The prices for their bottles of wine are also exceptional. This won't break the bank. I came in a little late on a Friday but it wasn't crazy busy at all there were still a few seats. The waiters are super nice as well! This place will probably be my go to pizza in Chicago!", "pics": null}}, {"review": {"des": "I came here last night around 7pm (a Friday night) and we only waited about 5 minutes before being seated. It wasn't too cold outside, so we didn't mind standing next to the outdoor heater while waiting. However, this might be something to consider if you're coming on an especially cold night or have a baby in tow. <br><br>We order two glasses of Chianti and the nduja pizza. Since so many yelpers raved about the whipped ricotta and I admittedly wanted the enviable pictures for social media, I made sure that I ordered a pizza with those beautiful dollops. In asking our waitress to make sure, she let us know that the nduja no longer came with whipped ricotta so we added that on for an extra $2. The pizza was fantastic. I loved the chewy crust and the nduja sausage for something a little different. Because it's a spreadable sausage, I mixed it with the ricotta to get that even distribution of flavor. I liked that they also offer a chili oil as a condiment, which we definitely made use of. <br><br>I find that this pizza is pretty comparable to Paulie Gee's in Logan Square, although this is a bit pricier. We paid $43 prior to tip. Neighborhood parking wasn't too difficult to find.", "pics": null}}, {"review": {"des": "Right off the bat let me state that I am a New Haven pizza snob.  Sally's, Pepe's and Modern are the only real pizza places in the U.S.  Period.  End of story.<br><br>That said, I was pleasantly surprised by Coalfire.  Chicago is a town I've previously felt sorry for.  99.9% of the pizza is laughable.  (Piece Pizza being the one exception because it's owner gets it, and understands the only real pizza is in New Haven.)<br><br>Ordering the margherita pie (if you can't do a cheese pie right, you should NOT be making pizza), I was delighted by the lightly charred crust what was wonderfully chewy.  The cheese and sauce were near perfect.  Salty, tangy, someone here knows what they're doing.<br><br>It's nothing like New Haven pizza, but I would say it's one of the best New York-style pies I've ever tasted.  <br><br>The joint is small but cool.  Service was great.  Nice beer selection.  The other pies we sampled were all equally tasty.  I would return next time I'm in town.  <br><br>With Piece and Coalfire I'm now going to have to stop saying I feel sorry for the pizza-deprived people of Chicago.  Savor these pies!<br><br>Bravo!", "pics": null}}, {"review": {"des": "First time eating at Coalfire Pizza and we had the best experience! We were greeted with a smile and sat right away. Servers were very attentive and the restaurant had a great friendly vibe! We got the Pepperoni & Whipped Ricotta and the Nduja #4. Both pizzas were so good! Highly recommended dinner here and the Pepperoni & Whipped Ricotta!", "pics": null}}, {"review": {"des": "Wowza!! First time for me here....my son lives nearby and frequents the place...he ordered and he chose wisely!!  The server girl was attentive, kind and full of knowledge of the menu! <br><br>We had a Caesar salad and split it three ways between all of us and then our pizzas arrived and wowza we could not get it in out mouths fast enough!!!ha ha!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4EEwKITSUxBfs72cWe5eJQ/348s.jpg", "caption": "Pizza part 2"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ByCKmePTZ-RmL3XcaKKa8g/168s.jpg", "caption": "Now to try this unusual item!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tU99MwE0csuiS7PPmjFKBA/168s.jpg", "caption": "Spinach Pizza - very pretty...."}]}}, {"review": {"des": "Wowzaaa <br>Get the nduja pizza! You wont regret it. <br>Chicago isnt all about the deep dish. The thin crusted here is amazing. The servers are super nice and organized. Go go go!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/92ziivIPynvVrX8i-JpPKA/348s.jpg", "caption": "White"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5GsG8KCjENgUl0--88KL6Q/168s.jpg", "caption": "Salami and honey- too much honey!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vxosS_B8Q8UMk4ENYIW9aQ/168s.jpg", "caption": "Nduja"}]}}, {"review": {"des": "Been wanting to come here for a while. Finally had the chance my sister made a surprise visit to see her son. So we got it together and made it happen. Parking was a bear, not much in the area and the restaurant does not provide valet parking. They would not seat us until our entire party arrived. We ordered three pizzas burnt onion and sausage, pepperoni and ricotta and stracciatella all of the pizza was really good. Why three stars because the service was rushed from the time we sat down till the time they asked us to leave so they could use the table for a party. Seems they just want to turn and burn the tables and customers to increase overall revenue. While this is good for the owners, it does not sit well with this customer.", "pics": null}}, {"review": {"des": "Best pizza in town!  Don't believe any other liar who says that any other pizza place in town is better than Coalfire.  They're lying!  Have been coming here since 2010 and won't stop until that sad moment that I leave town.  The pepperoni and whipped ricotta pizza is proof that God exists.  Best pizza in town!", "pics": null}}, {"review": {"des": "I've ordered from here a couple of times, delivery and pickup, but I've never eaten in the restaurant. The pizza I've had is really good. We recently got an order for pickup - pistachio pesto pizza. It's supposed to come with honey drizzled on it. I think next time I'd ask for the honey on the side for a few reasons: 1. It's actually drenched in honey and it's a little bit too sweet, 2. It makes your hands annoyingly sticky, and 3. It leaked out of the box and was all over my boyfriend's jeans and the seat of my car - which we unfortunately didn't realize until much later... tip: eat this one in the restaurant or get the honey on the side!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FcLbY7MDseZ_-0cabrBgQQ/348s.jpg", "caption": "Honey leaked out of the box all over the seat of my car!"}]}}, {"review": {"des": "One of my new favorite pizza spots in Chicago!!! The pizza was baked to perfection. The atmosphere was laid back plus great customer service. Definitely wud recommend to a friend.", "pics": null}}, {"review": {"des": "Whenever we travel my husband and I try to find the best pizza places. This one is for sure a winner. We loved the flavor of the pizza. Everything was perfect from the dough, to the crisp edges of the pepperoni and the dollops of ricotta. Give this place a try.", "pics": null}}, {"review": {"des": "*Delivery review (pizza is probably better fresh from the oven). <br><br>I really wanted to love this pizza, it looked delicious sounded delicious, but was not delicious. With all the toppings, the only  bite with flavor was those with the cherry tomatoes. The mozzarella cheese was rubbery and the pesto ricotta lacked salt and pepper. <br><br>I would have rated them 3 stars, but My husband liked his even less, which is a huge bummer because he never wants pizza, but decided to give it a try.  We actually thought maybe it would taste better cold (it arrived luke warm), So we tried it again after an hour in the fridge... nope didn't help.  <br><br>$55 for two pizzas that mostly ended up in trash.  Just proves that food that looks good doesn't always taste good. (See picture looks amazing!) <br><br>I still want to give it a try in the restaurant... it has to be better fresh from the coal oven!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/q8ujPKW3O-iQS8uGgSXjpA/348s.jpg", "caption": "Spinach pizza with olives"}]}}, {"review": {"des": "Great pizza! I had the Black & White and added red onions. Could have used a little spice but, still had great flavor. The hostess was super friendly as well. If I'm ever back in Chicago I would visit again. Personally-not a huge fan of the famous Chicago deep dish pizzas.", "pics": null}}, {"review": {"des": "Being a Chicagoan doesn't mean that you only eat pizza that is deep dish, it means that you are a pizza snob and only great pizza can satisfy your cravings. Thick or thin, a true Chicagoan appreciates excellent pizza in any form. It's why Coal Fire Pizza in West Town with their thin crust pizza has the full approval and support of locals.<br><br>Cooked at high temperatures using coal, this pizza is unlike any other kind of pizza offered in Chicago. The thin, charred, and chewy crust is reminiscent of New York and East Coast pizza. You might have had something similar at Eataly or Spacca Napoli but pizza cooked using coals makes all the difference. You can't get this type of crust anywhere in the city and it is amazing. <br><br>Pro tip: order one pizza at a time. Since the pizza is thin and cooked at high temperatures, you need to finish the pie quickly before it starts getting cold to enjoy it at its peak.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7LSfl1OfqSNfekpwJAL7yA/168s.jpg", "caption": "Passes the fold test"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/g0cgxrMEOYGk9hRav5fVXw/168s.jpg", "caption": "Neopolitan style pizza"}]}}, {"review": {"des": "Very very scrumptious Neapolitan style pizza.  This is not the place to go for your nyc slice or your Chicago deep dish but it does Italian style pizza very well.  There was a slight wait when we go there on a Friday night but no more than 15 minutes.  Upon seating there is a menu with many different choices of pizza with very unique toppings (I.e. ricotta cheese in almost a mousse form).  There were several veggie options from what I can tell.  You aren't allowed to make your pizza half one kind and half another which would have been nice but understandable logistically.  Pizza is cooked and brought out atop a giant can that held diced tomatoes.  We chose a white pizza with ricotta creme and garlic.  Flavors were amazing and the pizza was cooked perfectly.  Neapolitan pizzas tend to get a bit soggier near the middle perhaps because of their quick fire time so some people were using forks and knives.  If you are hungry you could very possibly finish an entire pizza by yourself but we shared one and felt reasonably full (probably could have eaten another half pizza but oh well).  The atmosphere is loud and it was difficult to hold conversation but not impossible.  Definitely would come again!! It seemed popular and there was a steady stream of people picking up pizzas too.  Although I would have to say you are better off eating in the restaurant because I can only imagine the pizza will get soggier the longer you leave it out.   P.s. felt sorry for the guy taking names outside! He seemed very cold and never went inside! (Maybe to deter people from waiting inside as there's no good place to stand inside).  They do have an outdoor heater though!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SpuTNomWI0EfcvqCbdgzjg/348s.jpg", "caption": "White"}]}}, {"review": {"des": "Ohemgee! I haven't had a pizza this good in a LONG time. The whipped ricotta is to die for !! I forgot to take a picture but it was DELICIOUS! Highly recommend ordering from Coalfire.", "pics": null}}, {"review": {"des": "This is some of the best pizza in Chicago.  If you \"disagree\" you are just wrong.  And that's ok but just know that you have lost your privileges to discuss pizza quality.  The crust at Coalfire is always that perfect balance of a crunchy/structured outer shell with a chewy inside, and toppings are super fresh. What truly sets Coalfire apart from the others is their service. Just genuinely great people that love serving up a awesome pizza.", "pics": null}}, {"review": {"des": "The pizza was absolutely delicious . Service was equally great. I'm glad I came here from Indiana to try this pizza because it was worth it. The Mexican coke is also amazing. I will definitely be coming back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pZlnWd_tW9aIodsDw_XmkQ/348s.jpg", "caption": "Delicious!, magically delicious. Couldn't wait to take a bite."}]}}, {"review": {"des": "I came, I saw, I conquered. We ordered sausage, pepperoni, & spinach extra sauce well done. We also tried 2 add mushrooms and the waitress said the pizza wasn't strong enough. BLANK STARE <br><br>Ok so the pizza comes & it looks delish!!!<br>I bite into it and gobble fast, and BAM the cheese hits me (I'm lactose so it usually makes me gag). I picked thru 2 other slices but their cheese is under the toppings so it's not well done (ewwwwwwww). It was thick & chalky BARF CITY...  Besides that I liked the thin crust. Didn't like the sausage being crumbled up pieces. The pepperoni was like cut up hot dogs. Just wasn't good. <br><br>Service was pleasant. I mean the waitress was a lil awkward, but WHATEVER. Hubby liked it, but we won't be going back. Lol", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TjgwtvxTvbXNWLWd_dHagQ/348s.jpg", "caption": "Sausage/pepperoni/spinach"}]}}, {"review": {"des": "After going to the restaurant for the past 6 years, this is the first time I can leave saying I was disappointed. The staff made the experience horrible. Our waitress was not engaged and did not seem to care. She did not even thank us for coming and just threw the check on the table at the end so she could talk to others. Might be a long time before we come back again. <br>Too bad the owner isn't there anymore. Without him standing out front, the place is going down hill. <br><br>No wonder it is empty on a Saturday.", "pics": null}}, {"review": {"des": "Coalfire Pizza!! Award winning pizza by Chef Dave Bonomi! He uses ingredients all made in America! I can eat the crust alone at Coalfire Pizza and walk away a happy man. Margherita Pizza is the standard to which all great Pizza makers are held too and Dave just CRUSHES it!! I tried three different pIzzas at Coalfire and they all rocked! You need to get here now! See you there! Subscribe to my You Tube channel, <a href=\"/redir?url=http%3A%2F%2Fyoutube.com%2Fc%2FABikerDude&s=d849c07b3fa9c77321c2df68ae238c992307b644d20a4b06ad60c8afc6c924b8\" target=\"_blank\" rel=\"nofollow\">youtube.com/c/ABikerDude</a> Coalfire Pizza", "pics": null}}, {"review": {"des": "Quite the inconspicuous interior upon seeing the outside and upon entry, a few tables, dim lighting, friendly staff, and an AMAZING scent permeating from the kitchen! When you make pizza this tasty, you don't really need to worry about anything else. This is the way neopolitan pizza should be. My favorite is the 'nduja, but order anything with the whipped ricotta and you will not be disappointed. <br><br>It wasn't until eating other neopolitan pizza around Chicago, most of which is mediocre, that I really got a full appreciation of Coalfire. Great little neighborhood joint that ain't goin' anywhere.", "pics": null}}, {"review": {"des": "I have eaten here 3x and not sure why everyone loves this place so much. Ambience is fine, and drinks are standard. Pretty much have tried every pizza on the menu and always leave unsatisfied. The pizza is incredibly soggy and droopy. Maybe it's just personal preference but it's just not for me. The ingredients are fresh, so that's not an issue. The toppings always fall off then you try to eat it. I'm sure I will be back since everyone I know loves this place. But if you like your pizza crispy, def go elsewhere", "pics": null}}, {"review": {"des": "One of the best pizza spots in Chicago! Fresh and perfectly balanced. This pizza has no flaws.", "pics": null}}, {"review": {"des": "Fantastic pepperoni pizza! Tender and crispy at the same time. Friendly staff, great value, down to earth place.", "pics": null}}, {"review": {"des": "Toni, the waitresses is marvelous. Very attentive but not intrusive. Nice sense of humor, Ask her about her \"drive by\".  The lights are dim, the pizza is good, a little foo-foo for my taste but very edible! Thin crust! Nice wines. Bibb salad w/radishes was excellent. We will be back.", "pics": null}}, {"review": {"des": "DELICIOUS PIZZA! Had their white pizza which is olive oil, ricotta, basil and cheese....will definitely be going back to try others!", "pics": null}}, {"review": {"des": "My friend and I wanted to take a break from deep dish and find some good thin crust pizza. Coalfire was an excellent choice. It was perfect. We decided on the Lasagna. We didn't eat in but the service was very friendly and our pizza was made quick. Crumbled sausage, basil, red pepper, crispy crust. We were staying south side so when we got back, heated up the oven to 400, got it nice and warm and then dolloped on the ricotta they gave us. Order out some Coalfire tonight and you will be very happy you did!", "pics": null}}, {"review": {"des": "I know it's wrong as a Chicagoan to say this, but I prefer thin crust over deep dish any day! This place has my idea of the perfect pizza. Thin crust with a slight char and perfect toppings. I would say it tastes better if you dine in, but getting delivery isn't bad by any stretch. Sometimes the crust can get floppy/soggy but I still love it!", "pics": null}}, {"review": {"des": "I've been on a pizza quest lately, and we've been trying to knock all off all the spots on my list and this was one of them. I've been wanting to try this place for months based off of the pictures and reviews but sadly didn't love up to the hype. We ordered only one pizza, the lasagna pizza and it was ok. For the price and the hype I was expecting something out of this world. Presentation is nice and descriptions sound awesome but it just left much to be desired. Not a terrible pizza but I wouldn't try it again.", "pics": null}}, {"review": {"des": "This was honestly the worst restaurant experience I've ever had in my life and if I could give 0 stars, I would. I arranged a group of my friends to meet at Coalfire at 7 to celebrate my birthday. <br>There are plenty of pizza places in the area but I chose Coalfire. My excitement was crushed by the actions of the owner and truly no one else has to go through what I did for merely asking to keep my friends out in the cold.  <br>Earlier in the day I called and spoke with the owner, Dave to make sure my group could be accommodated. He was super polite and welcoming and noted that they do not take reservations but he would let his host know. When I walked in, to a HALF EMPTY restaurant, the host was very rude, almost annoyed that I was requesting a large group to be seated. He told me I wouldn't be seated until my party arrived and walked outside. I just stood near the door and waited. While I waited, I texted my friends to let them know about them all needing to be present and checking their ETA's (i'd later find out this was rude of me and disruptive by the aggressive owner). Within a few minutes 5/6 if my party had arrived but were not allowed into the restaurant. They were required to stand in the cold until our table was ready. This would be normal for the area except for the fact the restaurant was half empty and we could've easily been seated at multiple tables while we waited. When I asked the host why they had to wait in the cold, he said it was policy. It was then I asked to speak to a manager. The owner came over, I greeted him and asked why my friends were being required to stand in the cold. He immediately got hostile and aggressive. I remained calm and asked if we could just sit at two open tables near each other and order. He insisted we wait on one specific table. He started YELLING at me inside of the restaurant! After a minute of him yelling at me, I told him we would just leave and go somewhere else. That's when he got even more irate. I walked out and HE FOLLOWED ME OUTSIDE to continue berating me.  He told me I was creating a scene and that scrolling through my phone while I waited disrupted his customers. He pointed out when we spoke earlier that I'd have to wait for a table. I said: yes and I have no problem with that but you failed to mention that my friends would have to wait in the cold. It's 30 degrees out and your restaurant is empty. He kept yelling at me and at that point I said: I'm already leaving, I don't know why you're still yelling at me? He continued still. Ranting about how I'm never welcome back, that he's been doing this for 11 years, and his pizza wins awards. As I'm gathering my friends, and am walking away from the establishment,  this man continues yelling down the street at me. At one point we were half a block away and he was still yelling at me. The level of escalation on the part of the owner was insane.", "pics": null}}, {"review": {"des": "House salad is fresh and tasty. Get 1 pizza per 2 people. The Black & White and Pepperoni & Whipped Ricotta pizzas are great!", "pics": null}}, {"review": {"des": "We ordered a Margherita pizza, came in less then 7mins and was very tasteless & I'm very disappointed as they were voted best Margherita in Chicago. Even a convenient store pizza  is much better.", "pics": null}}, {"review": {"des": "My favorite pizza place as of now. Love their thin crisp crust. Nice and creative toppings. Very generous on the garlic (which I love). Also the house salad is amazing - simple but very fresh. Very friendly environment and great service", "pics": null}}, {"review": {"des": "Best pizza in Chicago. I am not a fan of deep dish (sorry Chicagoland...I'm not from here). Crisp crust. Flavorful sauce and nice assortment of toppings and options. I'd go back in a second.", "pics": null}}, {"review": {"des": "Coalfire is probably my favorite thin crust pizza in the city! Nothing beats the whipped ricotta dollops. I've been here several times and am never disappointed, but I will say it's not the best for takeout. It's best served right out of the oven.", "pics": null}}, {"review": {"des": "I know I'm on a review spree (food sabbatical, if you will). But it's disrespectful that I haven't review this place. I love pizza so the barrier to satisfaction is fairly easy to hit. And there aren't many barriers to being with.<br><br>But man. Coalfire is the truth. <br><br>One my favorite pizza ever is the Pepperoni & Whipped Ricotta. Or is it the Vodka Meatball? Maybe the White Pizza? Ahhh screw it, I don't think any of their pizzas are bad.<br><br>But let me talk about that Pepperoni & Whipped Ricotta... I don't get surprised by pizza toppings but this was a crazy good surprise. In fact, I was anticipating a different pizza and this one stole the show. I spread that ricotta super generously. And if I do take out, I get extra ricotta and basil all the time.<br><br>And if the Pepperoni & Whipped is 1a...the Vodka Meatball is 1b. I seriously could eat both these by myself.", "pics": null}}, {"review": {"des": "Best New York style pizza in Chicago by far. Still missing the crunch on their very thin crust, but very good and inexpensive option for Chicagoans that love thin crust pizza.", "pics": null}}, {"review": {"des": "Delicious pizza.  Small brick oven pizza restaurant that serves pretty much just pizza.  They have several that come with this meringue sized (and shaped) ricotta balls and those are so delicious.  I recommend you pick a pizza with those on it...or just have them add them.<br><br>What else can I say here?  It is good new york style pizza that I'd have again if in the area but in the end...it is what it is...pizza.", "pics": null}}, {"review": {"des": "Definitely a sucker for that burnt, cracker crust with flavorful toppings and fresh herb... and Coalfire knows how.<br><br>Not sure why, but wasn't impressed the first time but when we went back, oh my.<br><br>Cozy, out of the way pizza joints closer to the SOUTH SYDEEEE are always welcome and this place is a definitely a gem. <br><br>Casual and mostly lit by daylight works and the staff is friendly and quick.<br><br>Could definitely go for a few more slices after writing this. :p", "pics": null}}, {"review": {"des": "This is my favorite pizza place in Chicago. I always go to the one on Grand. The pepperoni and ricotta is AMAZING. I used to live a block away and miss living that close. My boyfriend is allergic to cheese and they were able to give him a dairy free pizza.", "pics": null}}, {"review": {"des": "Second time here a year later.  Same outstanding service and pizza as before.  Great location for a bite before heading to United Center.", "pics": null}}, {"review": {"des": "I love the pizza but it's so loud and cramped; I can't hear myself think about what to get from the extremely limited menu that pretty only tells you to order, eat and the fuck out! I love the pistachio pesto pizza but I'm never going back to this location for dine in, unless I'm getting just pizza for takeout. My experience there was one to never want again. The Southport location is best and the not only does the menu have more options to compliment your pizza but it has a full bar and great service as well! They'll be getting all the stars. Sorry, not sorry.", "pics": null}}, {"review": {"des": "If you have an appreciation for authentic, wood-fire, super thin crust pizza....this place is for you.  If you are looking for a deep dish Chicago experience, look elsewhere. You won't fine that here.  If you're looking for a bargain, hit up your local chained pizza restaurant. Ain't nothing wrong with that....I love me some Pizza Hut every now and then--most likely when I'm starving at Target or need a quick pizza delivery during desperate times.<br><br>Coalfire is different.  It's supreme quality ingredients that also comes at a price, but well worth it in my opinion.  Due to the nature of its paper thin crust, it doesn't take them that long to make.  I wish I could say that I've tried all of their pizzas--it's still on my short list of things to do, but it's hard when you have a favorite and you can expect them to nail it to perfection every time.  I strongly recommend the only ones that I've tried which are the Honey & Salami as well as the Stracciatella & Sausage.  Both of these pies master the sweet and savory balance that is hard to achieve, and they picked just the right ingredients for it. By the way, Stracciatella is a cheese--it's soft, sweet, and velvetty.  If Burrata and Ricotta married each other, it would give you stracciatella.  It's awesome.  But yeah, I thought it was some kind of meat....ignorant me.<br><br>While you're at it, if you feel bad about your decision, which you definitely shouldn't because their pizzas are thin and healthier than your usual, I recommend the Caprese Salad. Once again, the Stracciatella cheese is an ingredient.  Imagine dipping your fresh tomatoes in that cheese drizzled with sweet balsamic vinegar.  I don't even like tomatoes and I can devour an entire order.", "pics": null}}, {"review": {"des": "Okay, so seeing as this is my last week living in Chicago I'm obviously going to eat at the pizza places I've been eyeing since forever, & every other place I've been eyeing. Last night a friend came over & I wanted to order pizza, but I couldn't decide between Coalfire & Roots (I wanted to do a bang bang & order both, but my friend and roommate are such dream killers!)<br><br>Anyways, I ordered the White Pizza from Coalfire with apprehension. It looked really great on the website, however, when I went to go pick it up it looked terrible. I will acknowledge that some of my disappointment comes from not realizing this is a Neapolitan style pizzeria, which is not the greatest if you're reallyyy hungry. Regardless, the famous ricotta dollops & basil leaves that give the pizza a nice presentation were stuffed in to go containers and all I kept thinking was \"I can't believe I spent $17.50 on this.\" I think this place is way overhyped.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1I5G7VS6qEjNE_YPIbLzqA/348s.jpg", "caption": "What disappointment looks like.... Coalfire's White Pizza"}]}}, {"review": {"des": "Delicious pizza, loved the ricotta as a topping.", "pics": null}}, {"review": {"des": "This pizza was good but it wasn't amazing. I was between giving this place a 3 or 4 stars but I went with 3 because of the ricotta. The cheese added nothing to my experience. I honestly could of done without it. But I have to come back and try a different pizza. The place is kind of small but still good for group up to about 6. The pizza came out pretty quick and the waitress was really friendly but the pizza was kinda disappointing", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ncni3_XJ1kcPJJFWJSAq_g/168s.jpg", "caption": "Sausage onion pizza and pep or ricotta"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/C-vCgtuFF0-fpefhmj2_nA/168s.jpg", "caption": "Honey salami pizza"}]}}, {"review": {"des": "We are here before a Bulls basketball game.  First timers.  The salad was the most fresh I had ever eaten.  The pizza was delicious and our waiter, Alana, was amazing.  I would highly recommended!", "pics": null}}, {"review": {"des": "Great pie! Completely unexpected getting NYC style pizza in the Windy City that's actually solid.<br><br>Probably the best pizza toppings I've ever had. <br><br>I know...I know, this is Chicago and this ain't stuffed or deep dish BUT do yourself a favor and check this place out!!!", "pics": null}}, {"review": {"des": "So back in 2011 when I came here the pizza was very meh....but over the past year or so I've been seeing all these great reviews of Coalfire and honestly thinking it's not that great people...but seeing so many positive reviews and people saying it's their favorite pizza made me want to give Coalfire another chance. I've been meaning to go back but never got the umph to go until this week. Given I did move in about 3 doors down from Coalfire...I saw it as a prime opportunity to give it a shot. Got the IGed Pepperoni pie with whipped ricotta....and that's all she wrote...... <br><br>I dunno what they changed but Coalfire is churning out some top notch pies....the crust is nice and thin with the outer crust being charred and chewy...my favorite. The pepperonis are nice and thick with some bite/spice to them which reminds me of pepperoni in NY that actually has some meat to it vs. a razor thin slice. The whipped ricotta is another layer of flavor that adds to their excellent pie. <br><br>Moving in 3 doors down was a baaaaaad choice.....for my health.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zlDJ0ljkS3pfdt9uM7dRnw/348s.jpg", "caption": "Pepperoni and Margarita"}]}}, {"review": {"des": "I love pizza and was a little bit disappointed honestly. A group of us stopped in for dinner and found the atmosphere to be cute and intimate. Maybe our experience was our own fault because the majority of the group wasn't very adventurous with their pizza choices. We got three pizzas, the four cheese, spinach, and Margarita. All the pizzas were fairly bland. They weren't bad by any means, just not wow. As I mentioned it could have been that our selection was a little simple, but I've had some pretty phenomenal Margarita pizzas before. There was hardly any sauce at all and the crust was much harder than what I expected. I plan on going back and giving it another shot, but I won't be going out of my way for it.", "pics": null}}, {"review": {"des": "Been meaning to try this place and glad I finally did.  The ambience and feel is very simple and fits the bill for a no nonsense pizza place.  I will admit that I came in specifically to try the whipped ricotta pizza, so I went ahead and ordered what I came in for - white pizza please.  Trump White.  The pizza crust was perfectly done and it was extremely thin - thinner than I expected but the taste was delicious.  They also serve cupcakes but a bit pricey imho - but they taste good, so if you are into expensive cupcakes go right ahead!", "pics": null}}, {"review": {"des": "Great pies and atmosphere -- and affordable!  We have been here a few times in the past and once again came - this time with our 5 month old.  Not only is the food great, but it's kid-friendly too!  Always something new to try on the menu.  Can't wait to come again!", "pics": null}}, {"review": {"des": "I came in for a quick slice of pizza to go. Although they don't sell by the slice, that denial is the best thing that could have happened to me on this visit. <br><br>I was compelled to buy the calzone, which turned out to be large enough for three people! It's a thin crust filled with heavy melted and crumbled mozzarella, pepperoni and sausage. The best part is that the crust isn't thin enough to rip from the oils of the cheese/meats.<br><br>If the pizza is a reflection of the calzones, I wouldn't sell it by the slice either.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kvhAyWV5WsmJdmZuQnL-Wg/348s.jpg", "caption": "Wow that's ginormous."}]}}, {"review": {"des": "It took two years but I finally got to try this pizza. I am one of those who people who completely believe that coal fire is the best way to cook a pizza. <br><br>So I walked in on a Saturday afternoon A's the restaurant was maybe half full. I was seated promptly and promptly got a glass of ice water. However, they also told me there was no iced tea. That's a major disappointment for me. Even though I didn't plan on drinking, I knew I wasn't having dogs, so I asked for a beer suggestion. The waitress came back with a bottle of rogue dead guy ale from Oregon. It was a nice medium bodied, golden color beer. Definitely a good recommendation.<br><br>I ordered the sausage and straciella, which had Berkshire sausage, red onion, Calabrian chiles, fresh basil, two kinds of mozzarella, and a little tomato sauce. For $19, it was about sixteen inches in diameter.<br><br>I like my pizzas with a good sauce flavor, but I don't like them soggy and wet on the bottom. That's a fine line to walk. The crust was definitely crispy all the way through, a definite plus. When I bit into it, the crust had that smoky flavor that I love in my pizzas. The sausage was an incredible quality, great spice and flavor in it. But I could've used just a little more sauce especially with the extra cheese and the peppers. That would probably be my only criticism. <br><br>The total was $27 for a large pizza, beer, and tax. Not too bad for Chicago. I would likely return if I was in the area, but I still have to say there's a certain New Haven style place on North Avenue that is still my go to.", "pics": null}}, {"review": {"des": "Unbelievable food - best pizza ever!  Victoria and Tonya in addition to all of the staff were amazingly welcoming", "pics": null}}, {"review": {"des": "Great place. Went on a bitter cold Sunday night. No waiting and free street parking. <br><br>Coalfire is not your standard Chicago pizza place. The crust is thinner and more delicate. The cheese is not overwhelming. The menu is both creative and traditional. Traditional like pepperoni and mozzarella, different like honey and ricotta.<br><br>We tried a pepperoni and a white pizza. The white pizza was delicious, filling but not heavy and overwhelming. I pretty much like anything with basil on it.<br><br>We shared a crème brule dessert. It was worth it!<br><br>Cost was reasonable.", "pics": null}}, {"review": {"des": "This was more of a 4.2 or so, but I'll do 4 stars since they were charging a corkage for byob.  This was the only place in Chicago that I visited that charged a corkage charge.<br><br>On to the pizza, it was big and tasty and the whipped ricotta was a nice new twist that I have not had before.  Granted it looks a little strange, but it is yum.  The cesar salad was also tasty, but a little steep in my opinion.  I was on vacation and on a quest to try some highly rated pizza places, so I didn't concern myself too much with the details.<br><br>The service was good and so was the pizza.  There was a pizza tour going on and I picked the tour guide's brain on his favorite deep dish places to see if they matched what I had on the agenda and two of them did and I visited both.", "pics": null}}, {"review": {"des": "This review is for delivery only. I ordered the pepperoni and ricotta via DoorDash after hearing a lot of great things about Coalfire. I'm an East Coaster and spent years in New York, so I've been on the hunt for a good thin crust pie in Chicago. Coalfire did not disappoint! The pizza arrived hot and was honestly larger than I expected. At $19 it's not cheap, but I felt the quality held up to the price. It had plenty of pepperoni and I was glad to see they packed 2 containers of ricotta separately so it didn't melt and slide in transit--smart! The pizza is so thin, which I love, and has a great charred crust. Sometimes you just want a tasty pizza that doesn't weigh you down, and this is just that.", "pics": null}}, {"review": {"des": "We had the pepperoni and ricotta pizza. It was really good and I look forward to going back and trying the other pizzas.", "pics": null}}, {"review": {"des": "The pizza was good but lacked salt,<br>Made it bland really. We needed to ask for some<br>Salt to get the pizza to the right taste for our us. We weirdly have not had to do that other pizza places.", "pics": null}}]}