{"name": "coast-sushi-bar-chicago", "reviews": [{"review": {"des": "Coast Sushi is one of my favorites (and best sushi spots in the city).  Always excellent service and an atmosphere for everything from date night to a large group celebration. <br><br>I love all of their sushi and think they are pretty creative when making/inventing new rolls. For example, we went in last Friday​ and in honor of fall they had a Japanese pumpkin roll.  It was so good!<br><br>I recommend a ​reservation, or you'll be waiting a while (especially on the weekend).<br><br>It's BYOB and has no corkage fee!  So bring your wine, beer, or sake!<br><br>Filled with tiny slivers of jalapeño, the Spicy Miso soup was delicious and is now my 'go to' sick soup.  <br><br>Pork belly sliders- you can order a​ four or five piece​ plate.  They were excellent.  The pork belly was tender (slices, not shredded) and it came on a crunchy 'bread.'  So good!<br><br>Firecracker​ Roll- an oldie but a good. Their variation​ is delicious. <br><br>Maine Roll- lobster roll tastes as if a lobster roll had a baby with sushi.  Perfect, Maine​ lobster profile with a hint of lemon but ​ sushi. <br><br>Smokin' Pumpkin Roll-<br>I was pleasantly surprised with this roll. I was half​ expecting​ it to be pumpkin and rice.  But it was delicious- a mild tasting pumpkin​ puree with a spicy-ish portion of salmon on top.  So good!<br><br>Mochi was delicious, try taro, red​ bean, coconut, and chocolate. <br><br>The prices are fair, ​and the rolls are more expensive if they have extravagant​ ingredients​.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OkYx0Kvs9rLi1nMzW3jk9w/348s.jpg", "caption": "Mochi."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_ajX3gZTVNqcxyh1GUoQow/168s.jpg", "caption": "Fire cracker, Maine roll, and Volcano."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8Yy92WNpXGUxWGEAt3cJvA/168s.jpg", "caption": "Smokin' pumpkin roll (my favorite!)."}]}}, {"review": {"des": "BE WARNED! COCKROACHES! <br><br>My boyfriend and I came in for a sushi date and from the minute we stepped in we should have gotten the hint to leave. We walk in and it's not very busy. The hostess checks in and tells us to give the host a moment to get to us. Cool, no worries. But 15 minutes later our waitress hadn't even greeted us. After 15/20 minutes we order our food. We get our Edemame & miso soup & sushi. While sitting there a COCKROACH crawls across our table! My boyfriend flicked it off and then killed it! To make matters worse while we waited for our bill, some guy takes the candle from our table and starts cleaning and putting chairs up all around us. And was completely rude. Rushing us to get out WHEN a party of 6 just walked in to get seated. It wasn't even an hour till closing. <br><br>Overall, the service was HORRIBLE, the sushi was tiny (not worth the price for portion) and THERES COCKROACHES!!!", "pics": null}}, {"review": {"des": "It's always exciting finding a good BYOB sushi spot with no corkage fee. This one has been on my list to try for a while. The restaurant is pretty big too, so it's not too difficult to get a seat last minute. <br><br>We got a few rolls and a sashimi entree. The sashimi was tasty and thick. Not the best sashimi I've had but still satisfied the sushi cravings.<br><br>Our service was quick and accommodating as well. Overall this was a good spot to have a nice quick dinner with a bottle of wine from home.", "pics": null}}, {"review": {"des": "Alejandro was absolutely amazing! <br>Super attentive , answered all my annoying questions and provided fast service. Food was great, too. 5 stars for the service and that awesome spicy miso soup #yum", "pics": null}}, {"review": {"des": "I really like Coast the best of the various sushi places in a three mile radius from my house.  I have dined in and most recently gotten takeout, and I was satisfied both times.  The dine in experience was last year, so I don't remember specifics, but it was yummy and the service was good.<br><br>I placed my recent takeout order via Yelp.  I was driving home from work, and I was happy that when I walked in maybe ten minutes later, that my order was already being prepared.  I ordered a Spider roll and a Hamachi roll, both which had lots of filling and tasted fresh.", "pics": null}}, {"review": {"des": "I can never get enough of the signature maki rolls here at Coast but what really brings me back every time is the DRAGON roll - made with shrimp tempura, cream cheese, spicy mayo, unagi, avocado, masago, eel sauce. And then there's Coast's true selling point: It's BYOB, which, as we all know, makes everything taste better.", "pics": null}}, {"review": {"des": "Great ambiance and very reasonable prices make Coast the perfect neighborhood sushi spot.  Their BYOB policy and cheap (for good sushi) prices keeps the bill low.  They even have a waiting area with tables so you can pop open that 6 pack or bottle of wine if there is a wait.  The sushi is good, but lacks elite freshness and flavor the top tier joints provide - preventing a full 5 star review.  Overall a really good place to grab a few rolls.", "pics": null}}, {"review": {"des": "Rated as one of the best sushi places in Chicago and I tend to agree. My go-to's are Rollapalooza and Sushi Para since I live in Wrigleyville. I came here on a Tuesday night with my girlfriend so it wasn't that crowded and we didn't have to wait for a table. <br><br>The ambience is dark and cozy so it's a solid place for a date. I am not a picky sushi eater so I thought the sushi was very good! We had edamame, sashimi plate, smokin pumpkin roll, rainbow roll, and spicy tuna roll. Yes we were starving! I thought the sashimi was fresh and the rolls were flavorful. <br><br>The prices were standard sushi prices for Chicago, which are always a tad expensive. But this isn't McDonalds. Being BYOB with no bottle fee is a plus too. I would definitely recommend Coast Sushi!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Lpfbe3OjxdZ5NPaSBSI03Q/348s.jpg", "caption": "Lots of Sushi!"}]}}, {"review": {"des": "Ugh. Such a frustrating BYOB policy that it overshadowed the entire meal and experience. One wine bottle per couple. Why? <br><br>They offer a discount if paying in cash--so one star.", "pics": null}}, {"review": {"des": "A nice place for dinner with good service. <br>Their Gyoza, Hamachi, Volcano roll and Mochi were all nice,  but not extraordinary - but the highlight of the evening was the Ceviche Maki. <br>The Freshness of the lime marinated scallop with a hint of jalapeno and cilantro was definitely refreshing.", "pics": null}}, {"review": {"des": "Went back here after nearly a decade and spent $60 on sushi. I really regret it as it felt like a huge waste of $60.<br><br>We had:<br>- Small sushi dinner<br>- Spider roll<br>- Alaska roll<br>- Gyoza<br>- Extra miso<br><br>The Gyoza were small and you only get 5. They drizzle the sauce on there so the Gyoza are kind of soggy. On top of this the filling was kind of pasty.<br><br>There is no seaweed in the miso. <br><br>The spider roll packed crab. The rice to protein ratio was terrible.<br><br>The small sushi dinner was ok. The fish didn't taste great and the pieces were stretched over the rice. That looked cheap. <br><br>The pickled ginger looked brown and was damp rather than fresh and crisp. <br><br>On top of that, our server wasnt very cheery and rolled his eyes at us when we didn't order dessert. I wish I hadn't tipped the a-hole.", "pics": null}}, {"review": {"des": "Delicious sushi. Super impressed with their special Smoky Pumpkin roll. Tempura was excellent. I never thought sweet corn would be good. Man, I was wrong! Buy your sake at the corner liquor store. BYOB.", "pics": null}}, {"review": {"des": "GREAT food. TERRIBLE service. The waiter was on Mars. He had no idea what he was doing. Crunchy spicy tuna roll is highly recommended.", "pics": null}}, {"review": {"des": "Very good sushi and also very fresh. We tried a couple different rolls and they were good but nothing special that made them stand out from other sushi restaurants on the north side. All rolls were priced individually and pricey as you can expect for a restaurant on the north side. There are other sushi spots you can go to with a flat rate for all you can eat sushi of similar quality.", "pics": null}}, {"review": {"des": "Came here because of a recommendation from a friend and I'm so glad I did! The sushi was delicioussssss, we had the spicy tuna, dragon, and white dragon. The original dragon was my absolute favorite, just the right amount of spice and crunch. Their spicy mayo is also a must, nothing like the other spicy mayos Ive tried at other sushi restaurants. <br><br>We also ordered the tuna tartare for an appetizer but it was sooooo small, not worth $14 in my opinion.<br>Overall, great restaurant and friendly staff!", "pics": null}}, {"review": {"des": "WHY does this have 4 stars!?! I feel victimized by this bogus rating! <br><br>Okay, first off, I would like to say the ambience and the staff are very nice. It's BYOB, dimly lit, and comfortably loud. <br><br>But my GOD! The sushi! I love sushi and I love eating so I guess my standards are fairly high but how can a place with 1000+ reviews, 4 stars, and is not cheap be this bad?? <br><br>The waiter RAVED about the off the menu signature roll: FIRECRACKER. We got so excited and it fell flat in expectation. It tasted like your average maki with spicy mayo, which is fine except it cost us $19!!!!!!!!!!!!! And because it wasn't on the menu we were shocked when we got the check<br><br>Next we got another \"signature\" maki: Ceviche. Sounds good cuz it has scallops and shrimp...except it was mainly shrimp and had NO taste at all <br><br>Then we got a plain maki, a fan fave: Ebi Tempura. They even messed this up. How!? Even the most average sushi spot can perfect this. There was SO MUCH rice and the rice was too wet <br><br>Then we got 2 smoked salmon nigiri. You can guess what I thought about that. If they can't provide good Ebi Tempura, they can't provide good nigiri. It wasn't fresh.<br><br>And to top it off, it took forever to get our food. <br><br>Overall: do not come here unless you like sushi buffet quality sushi <br><br>Sorry for the mean review but I am in shock at how terrible this was. Ruined my Friday date night", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/S4_e-azQ47QjBCvj_0VJog/348s.jpg", "caption": "Smoked salmon nigiri, $3. Wasn't fresh at all...usually good salmon has a couple white lines...this was all pink and rubbery"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/II9cTOw8VxMs1qAMrpLiXw/168s.jpg", "caption": "Ceviche, $12. Not good! Very bland and seemed to be missing the key ingredient: scallops"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ctFdd2TihXbeP22u_JROLA/168s.jpg", "caption": "Ebi Tempura. Below average! Way too moist and too much rice"}]}}, {"review": {"des": "I loved this place! The sushi was great! It is byob, there is a mini market on the corner that sells wine. The service was fantastic. Ambiance was great.", "pics": null}}, {"review": {"des": "Delicious! Got rainbow, spider and volcano rolls. Very tasty. Great ambiance. Huge plus is that they are BYOB and don't have a corkage fee. Highly recommend.", "pics": null}}, {"review": {"des": "Great food and byob is great to start the evening while waiting for a table. Service was good but when we asked to cut sushi into 8 pieces, they'd charge extra. More money for an extra slice? Come on...", "pics": null}}, {"review": {"des": "This place has blown me away. Very fresh rolls, friendly staff, great food. One of my favorites for sushi in Chicago.", "pics": null}}, {"review": {"des": "This is supposed to be one of the best sushi restaurants in Chicago. It is good, but the decor and ambience are weird, which is why I don't frequent this place. I have come with friends. Decent prices and service.", "pics": null}}, {"review": {"des": "Ordered take out because I was craving sushi. I ordered 2 sushi maki. I really liked the spicy miso soup! The fish was fresh! I really enjoyed it.", "pics": null}}, {"review": {"des": "I have been here quite a few times over the past few years because it's the location is convenient. The space itself is nice, dim lighting, music that is not overly loud, minimal but trendy decor. Service always seems really good. <br><br>The fish always tastes fresh and they have a nice variety of rolls. I'm going with three stars because the maki rolls have had a ton of rice the last three times I have been here, more each time. It takes away from the rest of the roll and makes them dense and heavy. If they corrected this I would bump them back up! <br><br>Personal favs are the white dragon, one with mint and ginger and sashimi hamachi and super white tuna.", "pics": null}}, {"review": {"des": "Coast serves what I call \"U.S. Sushi\"  (which bears little or no resemblance to sushi served in Japan.)   If you're looking for those perfect \"one bite wonders\", this ain't yo' type of place, OK?   However, they get 10 points because they had like one dude preparing sushi that \"appeared\" to be Asian and perhaps a server or two as well.  <br><br>But when all is said and done, Coast's \"US Sushi\" rocks. Their signature maki selection is inventive, seasonal, and full of all those americanized things that many folks crave in their  rolls (think cream cheese, smoked salmon, jalapeno, & mayo) .  A few specials highlight their ingenuity of ingredient combos. <br><br>Make sure you charge your phone, because even if you're a millennial, you won't be able to read the menu without using the light on your phone.  The cavern-like, pitch dark atmosphere is not meant for reading.  The candle on the table won't help you.  Also be prepared to speak loudly.  This is not a place for date night.....(unless of course you don't want to hear what your date has to say). <br><br>The Coast folks have nailed what their target audience thinks and wants when they hear the word  \"sushi\".  Bucktown, Evanston, & S. Loop locations distinctly speak to who they are trying to influence. Come here for American sushi.    If you watched \"Jiro Dreams of Sushi\" a few times on Netflix, this might not be the venue  4 U !", "pics": null}}, {"review": {"des": "8 years ago it was 4-5 starts, but the prices have gone up and it's not quite as trendy anymore.  Still a good value, but there are plenty of good value sushi places", "pics": null}}, {"review": {"des": "I am so happy with my experience at Coast. This place is BYOB which is cool. The sushi here was outstanding. I usually dip my sushi in spicy mayo and soy sauce and I didn't need anything for my rolls this time! Honestly i don't know what I ate because my friend ordered everything, but hats off to the sushi chef. Awesome vibe, awesome server.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/setfpfSrP6pXMFE5Z9yWfQ/168s.jpg", "caption": "This isn't on the menu anymore, but it was amazing. You can order it maybe if you show the server this picture."}]}}, {"review": {"des": "This is my favorite sushi spot by far. The ambience is cute and intimate. Perfect for date night. Although group gatherings are super fun as well. Great sushi overall. Great vibe and service. Yay for BYOB Eats! :) The dragon roll at this place is exceptional. If you're in the Bucktown area, this place is worth checking out.", "pics": null}}, {"review": {"des": "The sushi is good, but nothing phenomenal. For the price you pay, I feel like the portion sizes should be much larger. Typically when my fiancé and I go out for sushi, we will order 3 rolls and be stuffed, but here we have to order at least four rolls to not be hungry. <br><br>My last experience with their sushi, I had a crunchy spicy tuna roll, spicy salmon roll, white dragon roll, Nama avocado maki and Po Boy maki. All good but the only one that stood out in my mind was the White Dragon Roll (and its the most filling!). <br><br>The sushi rice is great and the fish is so fresh, but with so many other comparable BYOB sushi restaurants in this city, I'm afraid I'm going to have to settle for cheaper (and just as tasty) of options!", "pics": null}}, {"review": {"des": "One of my favorite sushi bars in Chicago so far. The dishes are not as fancy as Kai Zan, but who needs fancy when there is a diverse selection of rolls? We got the spicy tuna roll and a large sashimi platter. The tuna roll is awesome, really thick fillings with only a thin layer of rice. Sashimi tastes really fresh with an artsy display. Definitely will come back again!! and plus, it's BYOB!!! The only downside is that it's a little bit loud here to not really speak easy per se.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RYnPvJa4NLcI5YcUkNNAtQ/348s.jpg", "caption": "Large sashimi platter and spicy tuna roll"}]}}, {"review": {"des": "I heard good things, so I gave it a try- first time wasn't impressed. I had a ramen bowl, and it was too salty. My boyfriend got sushi, and it was just okay. <br><br>We were willing to give it another try, and the second time was better. Seaweed salad is as expected anywhere else, which was a relief. The sushi this time was good! I think I just have a better palette since I chose which ones to get this time ;)", "pics": null}}, {"review": {"des": "I came here with some old friends and really enjoyed our time. <br><br>Ordered: They ordered sushi, but I had the shrimp YakiSoba and spicy miso soup. <br><br>FOOD: Excuse my lack of culture, but this was my first time trying YakiSoba and I'm glad Intried it here. A hearty and well-textured dish. Between the perfectly al dente feel of the noodles, the light crunch of the veggies, and the juicy shrimp, I loved every bite. Again, very textured and dynamic dish. <br><br>The miso soup was spicy and I loved it! I felt like he soup wasn't made from a powdered, generic stock, like many misos are. It felt authentic and careful.<br><br>ATMOSPHERE: dimly lit place with moderate noise levels. No one was wearing anything too fancy, but I would feel awkward showing up in shorts and flip flops here. <br><br>Would recommend. Would return.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XkP3SN5FDnniIC9hqaDvXg/348s.jpg", "caption": "YakiSoba"}]}}, {"review": {"des": "Bland bland bland. Overpriced, under-satisfied. Who are these people giving this place 4 and 5 stars?! I was not pleased when leaving here.<br><br>Neither the nigiri, maki, wasabi or even ginger seemed fresh. I ordered the Ceviche roll (0 flavor), Ebi Tempura, Fire Cracker and salmon nigiri. Will not be going back here.", "pics": null}}, {"review": {"des": "This was pretty good sushi. It seems to be the happening place. Everyone I know goes here and it's always busy. We got lots of rolls (probably 8) but the sashimi platter was my favorite item. The rolls are really good but I have a few sushi spots I like better for sure.", "pics": null}}, {"review": {"des": "Stopped here for a late afternoon snack last weekend.  Sushi was very good, but the prices reflected it. The miso was delicious and a great deal at $2. Service was solid as well. Green tea was good not great.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3Z2xfgvFMcJs2QJJwY9Icw/348s.jpg", "caption": "Amazing miso"}]}}, {"review": {"des": "How does this place have so many and good reviews??!?? Just had some might be the worst sushi ever. The soft shell crab roll barely any crab with super oily taste. The white tuna roll doesn't seem to have fresh fish. The sushi rice tho. By far the worst sushi rice I have ever had.<br><br>Should have gotten sushi from Whole Foods and spent way less money....", "pics": null}}, {"review": {"des": "Very good sushi. One of my top places in Chicago. Go with the White Dragon and Po Boy. I typically like my sushi with less rice, makes me feel like I am getting my money's worth. I did not like the Coast Crab, as it was too much rice not enough of the good stuff.", "pics": null}}, {"review": {"des": "Stepped inside Coast Sushi Bar on a quiet Sunday afternoon to find a whole restaurant all to ourselves with an amazing maki selection. Bread crumbs and tempura lovers, two rolls to recommend are Firecracker and White Dragon. Firecracker is an off-the-menu maki roll with sweet, savory and punch of jalapeno together in one. Very tasty and photogenic. The White Dragon is also a winner. Shrimp tempura, cream cheese, masago, avocado, wasabi dressing, tempura bread crumbs. Taste for yourself, I bet you'll l o v e them. ;)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-6GuYsVRlG62P0RbuVB8zw/348s.jpg", "caption": "Firecracker + White Dragon."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yScbQS5FjDIrUC-epV4SKg/168s.jpg", "caption": "Firecracker."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rLYOeFTQqOTxSQbmukyaMA/168s.jpg", "caption": "White Dragon + Firecracker."}]}}, {"review": {"des": "Ordered take out on 5/21/18 and my order was shoved into a small take out container. As my BF and I were taking the rolls out of the container they fell apart. For $45 worth of sushi rolls it was a disappointment that majority fell apart. I would recommend only dining in at Coast.", "pics": null}}, {"review": {"des": "Food was good. Not above and beyond any sushi eating experience, but definitely in the mid to upper end. Went on a Friday. It was lively or crowded based on how you interpret sitting next to people on either side while on a date. It was a little loud with all the conversations happening so other people did kinda get drowned out.", "pics": null}}, {"review": {"des": "Things we ordered:<br>Edamame<br>Ginger salad<br>Asparagus beef roll<br>Coast crab<br>Spider roll<br>Dragon roll<br>Spicy tuna roll<br>Ebi Tempora<br><br>Our favorite was the dragon roll and ebi tempura. <br><br>The atmosphere is great for date night. Low lighting. Sushi was very good. Plus it is BYOB and not crappy. Most byob places are janky but this place was classy. I recommend and will be back. <br><br>The water refill game was strong!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VDzuaPVAHg_q4UOzbm6YlA/168s.jpg", "caption": "More than a mouthful of spider roll for bae"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oPozlQR9z4wJtaFZdhIA0w/168s.jpg", "caption": "She ate all this..."}]}}, {"review": {"des": "So today was my first time trying coast sushi. Normally I don't like to step out of my comfort zone with sushi, because there some places that just don't take care of the raw fish properly. So that is normally why I stick to sushi places I know, but thank god for thinking out of the box. I went here I honestly forgot the rolls I had but I asked the server to recommend the sushi rolls so whatever he picked which is probably there most popular rolls. They're amazing and to die for!!! This sushi is so good and fresh you can taste the freshness in each bite of the roll. The service was great and it was in a timely manner we got all are food no complaints about the service or place. But I would love to come back and eat some more sushi! I would definitely recommend this place to any of my friends or family.  Thanks guys!", "pics": null}}, {"review": {"des": "Was there a few days ago with a party. Really liked the place. They had excellent udon soups, good rolls and sushi. The only thing that was not so excellent was the salmon skin salad - we all thought it was rather unimpressive. <br><br>Service was good.<br><br>Forgot to mention - this is a BYOB.", "pics": null}}, {"review": {"des": "Hi, My name is Sarah and I'm a sushi addict. Complete addict. If you ever ask me what I want for dinner, 9 times out of 10 I will say sushi. And the other time, I'm just trying to be considerate and let you order something you'd prefer instead. <br><br>A night played out exactly as noted above with friends asking where we should grab food from. We decided on trying a new sushi spot and went with Coast. Coast has three locations and Bucktown is close to us so that's what we went with. It's BYOB which is a great bonus! Loved the atmosphere and cool graffiti on the wall.<br><br>Another thing about me and my sushi eating, I must always order a sweet potato roll. I realize it's not sushi by any stretch of the imagination but it's my thing. I must get it! The sweet potato roll from Coast is delicious as it has a bit of spice to it and it's just $7. I also ordered a philly roll and was pleased with the freshness of the salmon. Everything my friend and I ordered maki wise was tasty and we really enjoyed Coast! They also ordered a flaming roll which was lit up at our table leading us to Ooooo and Aaaaah all over it.I'd definitely order from them again.", "pics": null}}, {"review": {"des": "Fish is always fresh and delicious. BYOB is great and no corkage or bottle fee. Most of the servers and staff are friendly and have been there a long time. No call ahead and you must make a reservation if you want to dine on a Friday or Saturday night. Can get a little loud and rowdy. A little pricier than other sushi places in the area but the quality is really worth the price.", "pics": null}}, {"review": {"des": "The white dragon roll was amazing, however, we were unimpressed by the spider roll which was too bland for our liking. Be sure to ask how many pieces are included in your roll. The raspberry white chocolate mochi and pistachio mochi are also a must.", "pics": null}}, {"review": {"des": "My go too sushi spot! I live around the corner and it's just so easy when I get sushi craving! The sushi is good most of the time. Three stars because I feel like it's too pricy for the quality. <br><br>The staff is pretty good too. Friendly and attentive!", "pics": null}}, {"review": {"des": "One of my favorite sushi places in Chicago. It's BYOB and the service is pretty good. Sushi is fresh as well. The only con would be the noise level. Don't miss this place, though!", "pics": null}}, {"review": {"des": "I've been to Coast probably 6 times now since it's walking distance from my home, and I let my sushi cravings get the better of me more often than I'd like to admit. <br><br>Appetizers and maki are small, overpriced, and underwhelming.<br>Nigiri a la carte is actually good! I really don't try to expect much of Chicago sushi since we're quite far from the ports, but it was good nonetheless.  Nothing at all fishy, nice firm, but giving texture.  They definitely don't put enough wasabi onto them (trying to err on the side of caution, I suppose), but the rice is good. <br>Their chirashi is okay.  <br>Sure, they're a bit expensive, but you can at least offset the cost by bringing your own booze.<br><br>Honestly, nothing about Coast excites me.  It's just a safe bet for sushi.  Be sure to make a reservation on the weekends!  Walk-ins are often waiting 20+ minutes.", "pics": null}}, {"review": {"des": "The ONLY place I have ordered sushi since finding them 4 years ago!! This review is long over do. It's byob, the sushi is fantastic the service is always great and the menu is great. The fish is always fresh and is amazing. My boyfriend who hates sushi loves coast. Thank you for being my go to for 4 years and many more years to go!", "pics": null}}, {"review": {"des": "Tonight was my first visit to Coast and it was a great experience.  I didn't get to a try a large sampling since I went alone.  I ordered the white crab and fresh salmon sashimis.  Very fresh and so good.  As far as entrees, I ordered the White Dragon and Volcano rolls.  I loved the White Dragon!  A nice mix of heat and sweet. :)  The Volcano wasn't bad, but then I like rolls that have other stuff in it besides the fish.  I finished it off w Passion fruit and Strawberry mochi ice cream which was the perfect end to my lil feast.  I wish I remembered the name of my waitress because she was so helpful and attentive!  Just know she was thin and blonde. Anywhoo, I'll defly be back!", "pics": null}}, {"review": {"des": "Walked in on a Friday night at 9:30pm for a girl's night dinner with no reservations, after an Art class we took down a couple blocks at #Arts and Spirits. The hostesses asked if we had reservations and we said no, she said they were waiting on a couple of people who did have #reservations and for us to have a seat. If those reservations were not fulfilled we should be seated soon...worry then accompanied my growling stomach. We were hoping this was not a similar ploy, pretentious #Chicago night clubs do by having people wait in line on an empty bar, in hope to perceive popularity. <br><br>Since it was my first time there, I took the opportunity to enjoy the #Asian Art on the waiting room walls of beautiful cherry blossom trees, considering we did just come from an art class. Alas, after a short 5 minute wait, a soft calming voice said, please follow me to your table. #Score! Star #1 check!<br><br>We were seated at our table with a tall glass of ice water poured to enjoy as we browsed the #menu. My girlfriend had given up drinking a few months back and since this place is #BYOB even a more perfect way to keep the extra sake calories at bay. I saved my would have been #martini calories for the evening's #sushi specials.<br><br>A friendly bearded waiter approach to take our order along with announce the sushi specials of the evening were a summer roll and a the #firecracker #maki. Done, order that up along with the 12 piece #sashimi plate. Star #2 belongs to great wait staff here.<br><br>After an #intimate conversation on #life amidst #Coast's low lit ambience our #culinary master pieces arrive. First thought was wow, second was #yum and third was nom, nom, nom! They serve a very generous portion and more than enough for your belly's content! Star #3 goes to #food presentation.<br><br>After the first #bite of the firecracker roll, the only letter my lips could murmur were mmmmmmm! The firecracker roll is a crisp delight for the raw and cooked #sushi lovers. Second bite went to the #summer roll and can we say refreshing! Highly recommend trying both of these. As for the #sashimi platter, it was a #fresh plate of goodness and wonderfully presented with a #salmon rose and thick slices of #hamachi, #tuna, yellow tail, etc. Star #4 goes for #flavor.<br><br>Drum roll, as the 5th star goes to #CoastSushiBar prices. After receiving the bill, an #amazing dinner for 2 all under $90 with tip. In summary, great service, low lit intimate ambiance, fresh /flavorful fish and affordable no holes in your pocket date night. I think I should skip on the spirits more, as usually most of my bill belongs to my liquid portion of the meal. I will definitely return with a friend I can share a bottle of unfiltered #sake with. Arigato! (Japanese for Thank you)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/k-dzUjMNzgKd76yrmZ8mAA/348s.jpg", "caption": "#sashimi #sushi #takeout #boating #yachting #perfect #yum #coastsushichicago"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/14ybapeH3EnKsJT6DvNCGg/168s.jpg", "caption": "Had a wonderful time, Coast was delish and mostly enjoyed the intimate company and lots of laughs"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YcqfY6cFAQSSyexC3NA74A/168s.jpg", "caption": "Summer roll #sushi #special, Firecracker roll and amazing #delicious #Sashimi"}]}}, {"review": {"des": "Very good sushi. I like the smoking pumpkin and volcano best. Their cooked tuna chicken terriyaki are also quite tasty. <br><br>The place is byob, which is a plus. If you order delivery, do it online because they haveva lot of problems getting orders right over the phone.", "pics": null}}, {"review": {"des": "I am still in LOVE with Coast Sushi.  This was the second sushi restaurant I ever went to in Chicago and I have been happy with all of their selections ever since 2008.  I took a several-year-hiatus between visits but went back a few months ago and still absolutely loved the food.  The fish is incredibly fresh, the menu is diverse and includes non-sushi items, and it's still BYOB.  <br><br>I recommend the tuna tartare as an appetizer - it's soft, delicious, and really well plated.  The duck entree is mouth-watering and is a great go-to if you don't feel like having sushi.  I don't really care for single pieces of fish, but all of my friends say they are excellent.  <br><br>Their signature maki are really great, especially the more \"bizarre\" combinations that feature deep-frying or multiple layers of flavors.  I recommend the volcano and the white dragon as my personal favorites.  Spicy tuna, always a great go-to.<br><br>If you haven't been, you've got to come.  Coast takes reservations and is usually busy on weekend nights, so make one if you're going on a date or don't want to wait too long.", "pics": null}}, {"review": {"des": "presentation of food: excellent, each dish is presented like it's in an upscale restaurant with huge plates and little content<br><br>taste of food: so so, it is fresh, but the taste is just so so, nothing really stand out. the toro tataki is pretty good, but other than that, i don't remember anything that stands out.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2Ceqx8XW7eUYjVmxsMLO0g/348s.jpg", "caption": "Softshell crab... nicely presented!"}]}}, {"review": {"des": "Holy smokes every one who works there, before their shift, has to go out, find a stick, and put it in their butts.  They were out of a ton of different fish when we were there and, no joke, the server made it sound like it was our fault.  Also three people, standing next to each other,asked us if we had a reservation, one after the other. <br>The fish we were able to get was amazing though.", "pics": null}}, {"review": {"des": "Excellent variety of fresh fish and good staff in the Central Street district.  Very cute outside dining which is a nice touch on summer nights.  Only drawback, it can be a bit pricey but that can be expected of sushi joints.", "pics": null}}, {"review": {"des": "First off, this place is BYOB. Second, order the firecracker roll there is no way you could be disappointed. I tried a handful of other rolls, and they couldn't touch the firecracker IMO. Really nice, candlelit dark ambiance!", "pics": null}}, {"review": {"des": "The food here is a little overpriced for sure.  The Sushi is very good though.   Always fresh, and expertly sliced pieces.  I would not say that there are many super creatively designed rolls but what they do serve is solid.  Never had a bad meal here and i have never felt like the fish wasn't fresh.  I would definitely recommend this place.", "pics": null}}, {"review": {"des": "Great staff. They allow you to eat peacefully but are still attentive. Open Later hours. Great food. And BYOB!", "pics": null}}, {"review": {"des": "One of The most mediocre sushi I tried in the city. Maybe it was good 10 years ago but not now for sure. Service was good though but not the food for sure.", "pics": null}}, {"review": {"des": "Pretty good sushi. Not the best I've had but it's fresh fish and a quiet and nice atmosphere.", "pics": null}}, {"review": {"des": "If Yelp allowed 6 stars Coast Sushi Bar would have 7. This is must-go for all sushi lovers and here's why.<br>My boyfriend and I were celebrating our anniversary and it was recommended that we try Coast out. The Yelp reviews seemed awesome, the photos were drool worthy and it was suppose to be a beautiful night so why not? <br><br>We made a reservation a day in advance for 6pm on Saturday. This establishment, like many in this Bucktown/Wicker Park neighborhood, was BYOB which was a-ok with me. Upon entering the sushi bar, it appeared very modern, clean and there was a mood-setting dimness throughout. After being seated for only approximately 2 minutes, we were greeted by our waiter who already had a wine holder filled with ice. He had popped our bottle open, poured each of us a hefty glass all while explaining the specials for the evening. Our server was very knowledgable, polite and attentive - excellent for a first timer! Because we were new to Coast, open to suggestions and our server was very convincing we ended up purchasing 3 of the recommended options he talked us into. No regrets.<br><br>The food here was absolutely phenomenal. The sushi itself was made so intricately and precisely which is what I was hoping for considering some of the prices of the rolls. Before I make you readers wipe drool off your keyboards, I just have to say that the fish felt like butter in your mouth. Enough said. My date and I ordered an appetizer, two regular maki rolls and a specialty roll (a Coast favorite according to our waiter: The Firecracker) as well as a kick-ass dessert to top it all off. <br><br>Not only was this an excellent choice for a celebratory date night but for their fish, atmosphere and service as well. I'll be coastin' back here real soon.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KJLpm87D1XqztCkx4a7Ipg/168s.jpg", "caption": "Tuna/Avo, Dragon Roll, Spicy Salmon, Super Philly and Spicy Scallop Rolls!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/n9sY8Hue05NQ9o-vp46BDw/168s.jpg", "caption": "Tuna Tartare! So pretty."}]}}, {"review": {"des": "Hidden gem but not so hidden anymore.  This place won't let you down.  Freshest sushi in Chicago.  Service is always good too.", "pics": null}}, {"review": {"des": "My BF and I came here last weekend with another couple and we had a really nice time.<br><br>It's BYOB, and they will open your wine for you and they have glasses as well. We came on a Sunday without reservations and we didn't have to wait more than 10 minutes. <br><br>Our server was very attentive and very knowledgeable about the menu. We ordered 2 special rolls, Rainbow Roll, Snowcrab roll and another roll I can't remember. We took full advantage of BYOB ;)<br><br>The sushi was great and we were stuffed after. We'll totally come back!", "pics": null}}, {"review": {"des": "Awesome local sushi spot! Ordered delivery from here for the first time and the fish tasted very fresh. We ordered four rolls and all four were very tasty. We had ordered the White Dragon Maki, Coast Crab Mali, Crunchy Spicy Tuna and Spicy Hamachi. I would definitely order from here again!", "pics": null}}, {"review": {"des": ".... overpriced. Was impressed by stars rating . Dirty spoon , average service , high price<br>Sorry, Not for me ... first and last visit", "pics": null}}, {"review": {"des": "Very good sushi roll and sushi, friendly service and reasonable value for money.<br><br>We sat at the sushi bar and the seats were very uncomfortable. I invite the owners/managers to sit in them for an hour, I'm sure they will realize how bad they are. The bar itself also needs renovation because the materials are chipping away.", "pics": null}}, {"review": {"des": "Excellent sushi. Fresh ingredients. Attentive service. <br><br>Friend who lives in the area recommended this place. Glad I listened. Great little gem in a neighborhood full of gems. First thing you notice walking through the door is how nicely decorated and well laid out the restaurant is. Serene motif.<br><br>My go-to when checking out a new sushi restaurant is Chirashi - basically deconstructed Nigiri sushi. Coast Sushi did not disappoint. Generous quantity of fresh fish - with lots of fan favorites salmon and tuna. Rice was cooked perfectly and was just the right amount given the quantity of fish.<br><br>Great attentive service made the dinner complete.<br><br>Will definitely be back.", "pics": null}}, {"review": {"des": "Overall it was a decent choice for sushi night. There were only a few stand out rolls. I still don't understand the hype for this place. I found it hard to pick maki rolls since it didn't sound interesting or it had cream cheese.    <br><br>The good:<br>- BYOB with no corkage fee <br>- the Coast Crab roll was great and the dragon roll was good too<br>- The tuna on top special roll was not too really spicy...but it was good.<br>- the bbq eel nigiri was pretty good. <br><br>the meh:<br>- the food came out slower than expected.<br>- there were too many rolls with cream cheese on the menu. I guess it made it easy to narrow down.<br>- The tuna on top special roll was not too memorable...it was ok.<br>- Ceviche roll was a bit of a let down. <br>- the salmon and a Hamachi rolls were okay. <br>- it's a tad pricey for what you get for certain rolls.", "pics": null}}, {"review": {"des": "Have been going here for years.  Love the sushi and BYOB factor.  They also have good mochi for dessert.  The reason for the 3-star review is that we recently had a weird experience with a waitress who was rude to our group.", "pics": null}}, {"review": {"des": "Ok sushi place. Wish they had a bigger selection but overall satisfied with what I ordered. This is a BYOB as well.", "pics": null}}, {"review": {"des": "Is there actually anything better than a BYOB sushi restaurant? Rhetorical question..there's not. I have great things to say about Coast. The sushi is great! I have never had a bad roll. I also HIGHLY recommend the gyoza as an appetizer. They are so attentive and great even as a BYOB place. Always filling up our wine glasses, they even chilled champagne that we brought! <br><br>Be warned...the wait on a weekend is usually pretty insane. We waited about 2 hours once, but they give you cups to drink your booze...which can be dangerous as you want to REMEMBER there delicious sushi. <br><br>Tip: they take call ahead, so call maybe an hour before you want to eat and they will tell you to come in around 15 minutes before to check in, that should help.", "pics": null}}, {"review": {"des": "This is my first visit and also the last visit. Once sat down, we were provided a paper menu which is extremely dirty ( dirty with all kind of food stinks). And this is unacceptable. For the atmosphere, the sushi chefs kept talking loud themselves. About the food, it is average.  I will not return.", "pics": null}}, {"review": {"des": "I absolutely loved my experience at this restaurant! The white dragon was the most delicious roll I've had in a while. I really recommend it, & if you save room for dessert you must try the mochi ice cream.  ;)", "pics": null}}, {"review": {"des": "So I have been here a total of three times, hoping the next time the service and food would be better. Unfortunately, last night will definitely be the last night I order from Coast. I ordered pickup and was estimated 20-25 minutes until it was ready. It ended up taking just under 50 minutes. 50 minutes for sushi is just plain ridiculous but I really liked their shrimp tempura and really there aren't too many good sushi places in the area.<br><br>The icing on the cake was that I became extremely ill from the food and spent all night and this morning wishing I never ate sushi. I am not sure if it was the salmon, shrimp tempura, or the octopus that got me sick but I have a feeling it might have been the salmon. My husband was also sick but not nearly as bad as me which is why I believe it was the salmon as I ate a majority of the shrimp pieces and my husband only had two.<br><br>The front desk apologizes each time they run late on pickup orders but honestly, after last night I just won't bother again.", "pics": null}}, {"review": {"des": "A bit on the pricier side for maki, but nonetheless good. <br><br>Ambiance: Casual. Set up is very similar to many other sushi places. It has the sushi bar and open seating in the dining area. We went for dinner and it was a very \"romantic\" dim lighting. It wasn't too loud so you can carry a conversation without yelling at one another. <br><br>Food: We started with the asparagus beef as a starter, it was delicious. The sauce was along  the lines of teriyaki and the beef was thin and tender , similar to that of bulgogi. As for rolls, I had the Firecracker which was off the menu (kind of expensive was $19 for the roll, didn't know until i received the bill). It had a bit of a kick to it since it had spicy tuna and jalapeños, but very tolerable for those who don't eat spicy food (I have a very low tolerance for spicy).  My cousin had a dragon roll and it was different than most I've had, it had more crunch to it which could be due to the seasame seeds in it. Either way, delicious. And for dessert green tea ice cream and mochi, better than store bought but nothing out of the ordinary compared to other Japanese restaurants. <br><br>Service: Overall, decent. A bit slow on clearing up the table and refilling water.", "pics": null}}, {"review": {"des": "I'm basing this review on delivery. I didn't think it was possible to get great sushi delivered as it doesn't seem like a dish that would travel well but I LOVE this place. We've tried most of the rolls and some sashimi and they're solid every time. The delivery is always super fast, this sushi is fresh and always fabulous. We probably order weekly and it never disappoints. Well done Coast!", "pics": null}}, {"review": {"des": "This place is delicious! The sushi is almost to beautiful to eat! Both of our visits here were coincidentally the same waiter, which was a plus! Very attentive and helpful with the menu.", "pics": null}}, {"review": {"des": "Yummy sushi. <br>They deliver late and that makes me happy. <br>The fish was fresh and tasty. <br><br>No complaints", "pics": null}}, {"review": {"des": "Love the vibe, so lively and cozy! BYOB is the best, per person per bottle, wine/champs/sake etc. The sushi rolls are soooo yummy, my fav is the firecracker special rolls! Will definitely come back and with friends!", "pics": null}}, {"review": {"des": "Great Sushi. Wish it was in Arizona. I would eat here once a week. Fresh and inventive. The BYOB is a nice feature.", "pics": null}}, {"review": {"des": "I would have liked to have eaten at the Coast everyone else has been to because when I was there the sushi was bland and uninspiring. It was almost like the sushi you could get at Jewel.<br><br>We went on a Sunday night and it was half full so our service was very prompt and we got our food quickly. It was my first time here and when I saw our 2 sushi orders on the same plate I was surprised. The portions were quite small and well, it looked like it had been made the day before and sitting in the fridge. It tasted fine, but it certainly wasn't special. My date was embarrassed as he was a big fan of this place. At least I didn't pay for it.<br><br>I had higher expectations given the location and great reviews. I won't be back.", "pics": null}}, {"review": {"des": "Don't ever order take-out from here... Worst experience I've ever had from any restaurant in the city!<br><br>First off, I never give bad reviews but this one is very warranted.  I'll start off by saying that Coastal came up as the top rated sushi place near the location I was at, so figured it was going to be amazing!  Quite the contrary... it took almost 2-hours for them to deliver my food due to it being \"a super busy night at the restaurant\" (which was on a Tuesday night mind you).  I called the restaurant twice within a 40-minute period after my order was already late -- and both times, the extremely rude hostess said she would call the driver to see where he was at, and said she'd call me back... and I never received one phone call from her or anyone else!  The driver finally showed up at 8:50pm (and I placed my order just after 7:15pm).<br><br>When it finally arrived, I was shocked to see the tiny-little bag containing my order... It was the smallest amount of food that I've ever seen for a $70+ order, and I even had to make a frozen pizza afterwards for my group because we were still starving.  And overall, the sushi wasn't all that great.  <br><br>Not sure why there are so many good reviews of this place, but my experience with this restaurant was the absolute worst one I've ever had in my life, no joke!  Grubhub/Eat24 tried making it \"better\" by offering me $2 off on my next order.  This to me is such a joke!  Won't be using them on any future orders for a while either.", "pics": null}}, {"review": {"des": "Loved the sushi! The waiter was very informative and friendly. Great atmosphere and absolutely love the BYOB option. My friend and I would definitely come back and I look forward to going back next time I'm in that area.", "pics": null}}, {"review": {"des": "Fantastic sushi spot! We walked in with our own bottle of sake and our server was kind enough to check if it was best served warm or cold. Upon learning is was cold sake he brought us an ice bucket which was much appreciated. Nothing like a cold glass of sake on a hot day!<br><br>We split a couple of rolls to start.  The white dragon maki was divine. Great spin on one of my ultimate favorites. But the first round just left us craving more so two more rolls and 2 pieces of sushi were definitely a great second round. Their sake (smoked salmon sushi) is one of my favorites to date. <br><br>Service was friendly and knowledgable and I will definitely be back.", "pics": null}}, {"review": {"des": "If I was writing this place on the sushi alone it would get a five for sure. It may have just been our luck on the night we went to the atmosphere left a lot to be desired. BYOB is usually not an issue unless the table next to you is three women squealing and yelling with laughter. I'm not a stick in the mud, but my husband and I could barely hear each other over their screaming and laughing. They were there when we sat down,  nursing their bottle of wine and we're still sitting there when we left. The food was great,  but about halfway through our meal we definitely picked up the pace just to get out of there so we could enjoy actually having a conversation again. Other patrons seem to notice as well and people were shooting them glances. Wish Coast could've asked them to at least be mindful of other diners.", "pics": null}}, {"review": {"des": "Loved Coast Sushi! First time here was on Sunday, a friend and I made reservations for 8pm. We waited about 5 minutes for our table, but they had plenty of seats open in the front while we waited. We brought our own bottle of wine, and immediately upon being seated we had a bucket of ice given to us for our wine to chill. Our waitress was SUPER knowledgeable, and seemed eager to let us know her favorite dishes. It was very helpful, and her recommendations turned out to be on point! To start, we ordered the tuna tartare. The tuna was fresh and the sesame chip that came with it paired wonderfully. For the rolls, I ordered the special \"Firecracker\" (recommended by our waitress). We also ordered the White Dragon and the Po' Boy. All the rolls were excellent, but my favorite was definitely the Firecracker (I recommend it if you like a little kick to your rolls). For dessert- because clearly we hadn't eaten enough, we ordered the Mochi Ice Cream chocolate chip and the chocolate coconut. Both were excellent and super light and refreshing to eat, but my favorite was definitely the chocolate chip. Plating was excellent for all the dishes, and the ambiance with the himalayan salt candle holders on each table was very relaxing. Overall I would recommend checking this place out, because I most definitely will be back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MreqX3FRn_H2uogK4-lbPw/168s.jpg", "caption": "Mochi Ice Cream- Chocolate Coconut & Chocolate Chip"}]}}, {"review": {"des": "Coast is about as good as it gets when it comes to sushi. My girlfriend and I decided to make the trek through the slushy rain Friday night to this restaurant. I had hoped that the rain would act as a deterrent, but when I opened the entrance door, the waiting area was flooded with people. We were told by the host that our wait would be 45 minutes. This was way better than our first time trying coast in the summer when we told our wait would be an hour and 45. Clearly people love their coast.<br><br>While waiting we noticed that almost every party waiting had a bottle of alcohol. I don't think I've seen BYOB taken advantage of as much as it is here. <br><br>After our wait, we were seated in the back area which was composed of mostly couples situated side by side. We decided to order the exotic tempura which reconfirmed by belief that if you batter fry anything, it will taste good. Everything on the plate was delicious and HOT. Biting into my first piece of tempura, I burned the roof of my mouth. Next time I'll be more careful.<br><br>We ordered the ceviche, yellowtail and avocado, and spicy salmon rolls. I think if I could've reordered, I would just get 3 spicy salmons. It was the biggest piece of fresh fish I've had in my rolls and it just melted in my mouth. The spicy sauce complemented the fish without being overpowering. The ceviche and yellowtail were pretty tasty and as good as I've had at other restaurants.<br><br>Overall, we had a great experience at coast. The dimly lit environment lends itself to a great date night although this place gets LOUD. Service was excellent and if I want great sushi, I know Coast will deliver.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FhwXMYZCFPCjzKxFGQiexQ/348s.jpg", "caption": "Exotic Tempura"}]}}, {"review": {"des": "I was excited to take my boyfriend here for a weeknight date (last Thurs) but the experience was just so-so.  The sushi was good, but didn't blow us away.  The service seemed harried and was not warm/welcoming.  Whenever we go out we like to ask for recommendations from the server to ensure we don't overlook any unique or don't-miss menu items.  Our server only recommended items that were not listed on the menu, which made it slightly awkward as we didn't know the pricing of the items he was recommending.  He recommended a roll to us and we ordered it and sure enough, it was a $19.00 roll.  (I had asked him beforehand how much it was and he said it was in line with the other more expensive menu items... but none of the items on the menu were at that price point.)  We felt like we were being upsold and that put a bit of a damper on our night out.", "pics": null}}, {"review": {"des": "This was an alright place. Food was good, not great. Probably would have given this place 4 stars, but server wasn't the best. Our waiter was kind of rude. I felt like he was just trying to get rid of us. My guess he assumed he thought we weren't good tippers (sadly mistaken). I noticed how his service was compared to the other tables and there was definitely a difference. At first I thought maybe he was busy, but it really wasn't that busy. Pretty rude of him. I love the feel to the place. Very intimate and romantic. Needs better service though. Will I come here again? Probably not. As far as the food goes, it was good, but I've definitely had better.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jEYb68oG-7uzkMLucPsqJg/348s.jpg", "caption": "Nice"}]}}, {"review": {"des": "It is BYOB. Friendly and knowledgeable staff. We go before the rush but well worth the wait if you go during rush hour.", "pics": null}}, {"review": {"des": "I have been here twice now and it is melt in your mouth good sushi! The service is excellent, just enough attention but not so much that you're annoyed. They have a lot of rules about things because they're so popular like the amount of alcohol your group can bring, there is a discount if you pay cash, we had to get out by a certain time, etc. So as I made the reservation I will admit I was already feeling exhausted from the whole message I had to pass on to my party, but the food and atmosphere is worth it! We ordered several different appetizers and rolls and not one thing was even mediocre.", "pics": null}}, {"review": {"des": "This is some amazing sushi folks.  Great selection  -- we literally had a hard time picking what rolls we wanted cause everything sounded so amazing.<br><br>Girls night here not long ago.  Started the night off with some edamame and opening bottle #1.  In case you haven't heard, this place is BYOB with no corkage fee.  The appetizer is delicious and we were ready to take down some maki.  We had so many I can't even remember them all... we had their valentine roll special, white dragon, volcano... and then we ended the night with the Po Boy.  HUUUUUGE pieces and it was insanely good.  It was very filling and very rich, so it really put all of us over the edge.  Might be better to start the night off with that roll and then order others.<br><br>Ambience is like a lot of downtown places -- dark and cozy.  Our service was good, it was a pretty busy night so I can't blame her for not always being around to open up our bottles right away.<br><br>Now the bill -- 4 girls with a lot of sushi and it was only $25 per person before tip.  How can you beat that?", "pics": null}}, {"review": {"des": "Arnie and I had dinner here on a Saturday this winter.  The waitstaff were quite polite and attentive given the packed night and we were very satisfied with the service.  The food was mostly great with the exception of one dish which I think they could have done a better job on.<br> <br>We started off by ordering the uni shooters, which came out way too vinegary (Arnie nearly choked on his shooter and I had difficulty holding mine down).<br> <br>That being said the next two courses were great - the Bluefin sashimi and the omakase were prepped really well and the fish was fresh.<br> <br>The final course we got - the spicy creamy maki - was sublime.  Easily the best dish of the night.  Lots of fish and filling, not a lot of rice, plus cheaper than most maki you can get elsewhere.<br> <br>My recommendation - skip the shooters and funky appetizers and go for the maki.  The sashimi is comparable to other sushi places and worth getting if you're in the mood for it.", "pics": null}}, {"review": {"des": "Great affordable sushi place with fair size portion for lunches and dinner in a clean environment with great service! <br>The mochi green tea ice cream is delicious.", "pics": null}}, {"review": {"des": "Yum! Coast definitely has very very solid sushi.<br><br>Between two people, we split the agedashi tofu, spicy scallop roll, salmon avocado, and spider roll.<br><br>I really did not enjoy the agedashi tofu too much. One of the most important things about agedashi tofu is getting the texture of the tofu right and being sure to use silky/silken tofu! Coast definitely did NOT use silky tofu :( It was extremely disappointing.<br><br>However! Their rolls are really some of the best rolls that I've had in Chicago. The texture of the rice is perfect and the fish is super fresh! I also love that there is avocado instead of cucumber in the spicy scallop! They were a bit skimpy on the rice though.<br><br>Overall, 3 stars because as hard as I tried, I cannot get over how terrible the experience of the agedashi tofu was. Fix that please!!!", "pics": null}}, {"review": {"des": "If I was on death row, and could pick a last meal if my life, I would hands down order coast sushi. Please open one on the north side", "pics": null}}, {"review": {"des": "You cannot find better sushi at this price point in Chicago! Great menu and great service. My go to sushi spot for sure.", "pics": null}}, {"review": {"des": "Loved this place, the sushi was amazing with lots of variety in it and for me that is very important especially since I'm a bit of a sushi cretic.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0NOBjWHv0SNqa0VwuDNM9Q/168s.jpg", "caption": "Ok I got the white dragon roll and some deliciously cook eel!:)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/THd9XiJ3ma6njadTrDxa6A/168s.jpg", "caption": "This is the mushroom appetizer. Very delicious"}]}}, {"review": {"des": "My go to for sushi in Chicago. I've been in a few times, my first experience I had Tosh as a server. She's so cute and bubbly. Haven't seen her in my last few visits. Sure hope she's still around. All fish is super fresh. The location is across from some good bars too for after dinner fun. It's BYOB so that's a huge plus too.", "pics": null}}]}