{"name": "copper-fox-gastropub-chicago", "reviews": [{"review": {"des": "Been here several times over the last couple of years and it is very consistent. Food seems to take a while to come out but the staff are always outstanding. <br><br>Their brunch menu is great. They have a good mix of breakfast and lunch items. The biscuits and gravy are very unique with a chipotle flavor. The potato cake along with it was great and a twist on the typical dry potato's at other places. The chicken and waffles were also great. <br><br>Overall this is a great place but small. Never too crazy busy so check it out.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mrrECrq2akJe0_vj5PaOSQ/168s.jpg", "caption": "Chicken and waffles"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0uahghTdAobPfMCcOcEHhg/168s.jpg", "caption": "Biscuits and gravy"}]}}, {"review": {"des": "Let's start with the service:<br>It is very attentive but not too intrusive. I would give service 4.5 Stars<br><br>The Decor/Atmosphere/Cleanliness:<br>We sat outside as it was super nice out but did go in and the place has upscale decor and is very clean. The same is true about the bathrooms. <br>Atmosphere would be 4 stars <br><br>The Food:<br>We started with the Biscuits  and Mussles and <br>Then moved on to Crispy chicken with Rosemary chips.<br>I would give the food 3.5 stars. <br><br>Overall I would give this place 3 stars for price vs quality. <br><br>The overall experience was ok but not  good enough to make us come back. For that price point you have much better options in Chicago.", "pics": null}}, {"review": {"des": "This is an excellent spot for a 7th anniversary brunch!  As you should know, the traditional gift theme for the big 7th year is copper, so why not come to the Copper Fox for delicious food?!<br><br>We had the biscuits which are super crispy and taste glorious.  The Eggs Benedict was a little on the runny side for my wife's liking, but still very good.  I had the Huevos Rancheros and have to admit, this is a difficult dish to make well, but the Copper Fox did a really good job with it.  <br><br>Oh and I can't forget to mention the complimentary champagne for our special occasion.  Outstanding service as well!", "pics": null}}, {"review": {"des": "What a great little spot. Its attached to Courtyard Marriot great for lunch or dinner, super high quality food comfortable dining area.. very casual but upscale feel all at the same time, service was fantastic.. you are givin a personal bottle of water for ypur table, I love when restaurants do that. I ordered the turkey avacado sandwich with fries.. it was delicious and perfect!! great flavors!  creamy fresh avacado with succulent turkey breast on crispy crunch whole grain toast! Definitely try if in the area.. it is a gem", "pics": null}}, {"review": {"des": "I was looking for a place to get a good burger not \"too\" far from Navy Pier and wanted to try this option. Note that on Saturday they have a brunch menu until 2 or 3pm.<br><br>First off, when you get there, check in with yelp to get an order of 3 yummy biscuits with honey butter and jam! We cut to the chase and ordered the only burger available on the menu and it was a great choice to make: The Foxy Morning Fox Burger with white cheddar, fried egg, bacon, white BBQ, crispy onion and pickle.<br><br>This burger was sooo good ! Juicy & tasty as it's supposed to be. Even if you're very hungry, half of it will be sufficient. I also ordered the Cesar salad on the side and I was glad that the dressing was greatly done. <br><br>I'll be back to get that burger again!", "pics": null}}, {"review": {"des": "Looking for a place to have brunch close to EMC2 because its raining, I yelped and found this place. Chic decor inside, spacious and great lighting.<br>Sat on the bar while watching football. Ordered the biscuits to start with,  a margarita ( hair of the dog;) and fish tacos.<br>I enjoyed my biscuits as they are extremely good with honey butter.<br>Comes in 3 and alot for just one person. Fish tacos came in 3 as well and was too much for me and finished only two.<br>Great service from the bartender. Great place for brunch or lunch. Price is reasonable. Trust!!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yOPbkTtu2RNaNTAwUD6aCA/168s.jpg", "caption": "Fish Tacos"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/89xUhx5iqlec9_TNZbNcQg/168s.jpg", "caption": "#16 Biscuits"}]}}, {"review": {"des": "Was searching for a restaurant without a wait on a Friday night (which is incredibly difficult around Mag Mile) until I stumbled upon this place. Made a reservation on OpenTable a few minutes before but there turned out to be a few open tables so you might be fine without one. I went with a friend and got 2 appetizers:<br>- Mac and cheese: beware, this is VERY bacony. And by that I mean that in addition to the bacon bits sprinkled on top, the cheese has a very strong bacon taste.<br>- Biscuits: they say this is a signature item but to me they just tasted like your classic buttermilk biscuits with a little salt/seasoning on top. You get them free for checking in on Yelp though! (At least at the time of writing)<br><br>For my meal, I got the burger, with cheese and fried onions strings on top of the patty and lettuce and special sauce underneath. Twas a very solid burger. Had the option of fries or rosemary chips to accompany the burger and got the chips upon recommendation but should've gotten fries - the chips just tasted like regular chips but this may just be a preference thing.<br><br>The apps were fast but our entrees took forever to come out... Our waiter was super nice though and apologized multiple times about it. Seems like an excellent place for relatively casual business meals, maybe a catch-up with friends. They have a few tables outdoors as well if that tickles your fancy.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jtUoyRvFAwcIrS9Sr1v92A/348s.jpg", "caption": "Burger and chips"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rRn5i1f18Oea6QynGKwF-w/168s.jpg", "caption": "Biscuit close-up"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XZevLNmfnQcWPpT2byCojw/168s.jpg", "caption": "Biscuits"}]}}, {"review": {"des": "We arrived very early for dinner the night most of the city was buried by a blizzard.   A friendly reception in a hotel eatery.  We both ordered the \"Prime Skirt Steak.\"   A small portion of meat sat atop a mound of soggy fries.  Sadly, there was nothing \"prime\" about this beef.  We've had prime  skirt steak, previously, and it's delicious.  Wish we could say the same for this beef.  It was chewy and lacked flavor.  Very disappointing.<br><br>Thank you for the complimentary #16 biscuits.  They were tasty.", "pics": null}}, {"review": {"des": "What a lovely birthday celebration! As we were a larger party, we were sat at a table a little more removed from the rest of the space by a large wall of wine racks. It was lovely to feel like we had our own space and enjoy each other's company--not that the rest of the place was overly loud. Though our waittress missed a couple things through the night, she was really nice and accommodating. We were a big party that arrived at staggered times, so it's kind of understandable. <br><br>The food and drinks were amazing. We all ordered various cocktails and entrees and all loved it. Biscuits are a must! The mac and cheese particularly stands out as being some of the best I've ever had. I added salmon to my risotto and it was cooked well. The My Jam cocktail was so good I had to order a second. Finally, the chocolate (flourless?) cake they brought out for my birthday was phenomenal. <br><br>The next time I find myself in Streeterville again I'm making a beeline for Copper Fox. Thanks for a wonderful birthday dinner!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KF5EW-lIhjt4jP6rsupgbA/348s.jpg", "caption": "Vegetable risotto with added salmon, My Jam cocktail on the side."}]}}, {"review": {"des": "This place was found on a whim by my best friend, we literally pick this place to due the no wait time and because I was hungry and we wanted to drink some beer. <br><br>They have quite a large bar area that is actually really good if you want to catch up on some work with a brewskie. They even had charging plugs at the table for your phone which I thought was neat. <br><br>If you check into the yelp app they will actually give you a free order of this famous biscuits. For the main course though I ordered the fish tacos, and my friends ordered the gulf and shrimp roll and the skirt steak sandwich.The biscuits were ok, a little dry for my taste, but you can't complain about free right? But the tacos were to DIE for, they were so so good! The sauce, texture, and taste were just perfect and it was quite a large portion too. My friends skirt steak sandwich was ok, the meat was really tender but the rest of it was a little bland. <br><br>Overall I would definitely come back here, the tacos were amazing and the service and atmosphere were great! The place is a little pricey if your looking for something quick and easy though.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yoOlaK44wZAGUZPHhHl3zQ/348s.jpg", "caption": "#16 Biscuits"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VTEQejIJU_2jLlhgKlYtgw/168s.jpg", "caption": "Fish Tacos"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WuN5BJphYxEW8r9AOgPcSw/168s.jpg", "caption": "Prime Steak Sandwich"}]}}, {"review": {"des": "My mother and I stopped here for a weekday lunch. We both saw the Copper Fox on Yelp and decided to give it a try.<br><br>The inside atmosphere is beautiful, it felt like a five star fine dining experience... without the price tag. We both got the chicken sandwich. It was delectable! <br><br>The bread was phenomenal and the chicken was cooked to perfection. The fries were quite good- i mean, who doesn't love fries?? I would definitely recommend this place to anyone looking for a nice meal on Michigan Ave. it's enough out of the way where you don't get the busy atmosphere but still feel like you're in Gold Coast!", "pics": null}}, {"review": {"des": "Comfortable corner of downtown Chicago. Wedges between high rises and nothing but concrete arround you it was nice to find an oasis of comfortable and tasty food with attempts to give a feeling of openness. <br>Outside seating and connected to the Courtyard Marriott, this restaurant tries. The staff works hard. The food is a step above <br>Downside is the crowds that come from the hotel (I was one of them) who will fill every seat then leave so that it's empty. <br>Good grits, good fries, drinks are good too. <br>Definitely worth a try.", "pics": null}}, {"review": {"des": "We came here on a suggestion of a friend who works in the area and I have to say I was pleasantly surprised.  We did a mix of cocktails, apps, entrees. Heavily recommend starting with their craft cocktails - great break from all the beer heavy bars. My favorite was the \"lime\" one but you could easily do it right with a craft Moscow Mule. Pro Tip: recommend #16 biscuits anytime of day burnt to a crisp with a little bacon fat and served with savory house butter, wow!  The entrees were solid, recommend burger over the chicken sandwich. Look for the lobster tail sandwich, little bit of Maine cuisine in Chicago. Worthy 4 star place, worth a 2nd visit.", "pics": null}}, {"review": {"des": "What a hidden gem stuck in the middle of all the great choices in the river North area of Chicago. Nestled just east of Michigan avenue on Ontario, it can be easily missed since 1) it's connected to the Courtyard by Marriott hotel and 2) right next to the historic and Chicago famous Garrett's popcorn.<br><br>During the warm months, you are welcomed with ample tables and seating outdoor.  If you're not interested in sitting outdoor, they have a good amount of tables and seating. As you enter, the full bar awaits you.  If it's not the bar you came for, which I must say is definitely an attraction for this establishment with their well concocted assortment of mixed drinks and their families mules, then their is a full section for dining their delicious eats just to the right of the bar.<br><br>For starters, you have to get their #16 biscuits. The story behind them is that it took 16 tries to perfect the recipe.  Perfect it they did as the buttery flavored ooze out of their warm bread consistency while a light crisp tops the outside. Delicious I tell you!  We also started off with the calamari fries and brussel sprouts. Each had a distinct and flavor to then like no other.<br><br>For our main dishes, my wife had the recommended chicken sandwich and I had the fish tacos.  Two great choices when ordering their tasty drinks.  For drinks I started off with the Sgt pepper.  It has a soccer if jalepeno pepper and a mixture of fruity deliciousness.  My wife had the My Jam mule which was also good.<br><br>The only gripe I have that would stop me from giving them five stars is that their rest room is a shared one with the hotel.  Otherwise totally 5 stars", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qQarTEhj7QqfV8iHN9Igdg/348s.jpg", "caption": "Crispy Chicken"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8XYtpy6J4OGORRqusYP1Xw/168s.jpg", "caption": "Fish Fish Tacos"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HzI1P22sqogAbBuQpLQVJA/168s.jpg", "caption": "Crispy Brussels"}]}}, {"review": {"des": "This place was bustling even when we arrived for a slightly late dinner but once having been seated (which took a litttttle longer than it should have, with no one around for front of house) we were well taken care of. Service is friendly and attentive! The space itself has a lovely ambience -- clearly very trendy but also quite comfortable. <br><br>We started with the famed #16 Biscuits, and the staff were a little weird about getting us one each for our party of four -- they come in threes and we were not informed of this until after they arrived -- but we were quickly accommodated. The biscuits themselves, accompanied by whipped honey butter, were worth the wait -- so flaky and warm, just perfect comfort food.<br><br>My main was the incredibly juicy Fox Burger, which is topped with super crunchy fried onions and has a BBQ sauce that is just perfection. All of that is held inside the softest brioche bun. Basically the best burger I've had in a while. I subbed fries with a Fried Avocado Salad, and was delighted: not only is the fried avocado really good, the rest of that salad is just heavenly. Fresh, with a really great mixture of veg, and a nice kick with pickled jalapeños. Can't wait to try it again someday. <br><br>Also really good value for the location -- you can probably make two meals of any main!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bIeahXUhKkiFKM6HXNT9Gg/168s.jpg", "caption": "The Fox Burger with a side of Fried Avocado Salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Z6M1FTCD7FoG5KDGXZIpYA/168s.jpg", "caption": "#16 Biscuits"}]}}, {"review": {"des": "I felt slightly led astray as I consider a gastropub high end food in a chill environment.  After looking through many yelp reviews we decided on Copper Fox for our family, including two younger kids.  Overall the food was really good and our server was so kind.  My goal was to find chill place where the occasional noise from the young overtired kiddos would go unnoticed. The ambiance just felt a bit too fancy to be titled a gastropub.  Maybe upscale gastropub - I dont know.  It just wasn't the laid back environment we were hoping for. <br>We were able to get in without a wait which was nice, and we did have a lovely glass of wine before heading for a noiser environment were the toddlers could make a few noises without ruining anyone else's dinner!", "pics": null}}, {"review": {"des": "I came here on St. Patrick's Day it was very very busy! <br><br>To drink I had the sour earl or Eddie. I forgot the name. It was perfect for me! It wasn't too sweet or sour and it had a refreshing touch to it! It was a lemon based drink. The only weird thing was that they served it in a plastic cup, I'm assuming their kitchen was just backed up given the holiday. <br><br>They had potato leek soup as a special for $7. It was a huge bowl of soup with large potato chunks. I thought it was pretty tasty but needed more salt/seasoning better than over salted though!<br><br>For dinner I had the seven layer salad but had them use their Parmesan vinaigrette instead of ranch. I like the presentation of the salad and how it includes many ingredients and different flavors. Overall it was a good salad. <br><br>Our server was very friendly and attentive, he made good recommendations.<br><br>I thought the decor was hip and cozy!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Zsm9lSMlIQ60AF_d-YJuWw/348s.jpg", "caption": "Potato soup - St. Patrick's Day Special"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Hfb6Ax1azi5vSKJ12ruB2g/168s.jpg", "caption": "Sour Eddie"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2Qu9y6Vy7H7HRbAof7CN7A/168s.jpg", "caption": "7 Seven Layer Chicken Salad"}]}}, {"review": {"des": "Y'all, this place is such an unexpected gem. It's in the Loop and looks insanely fancy, but the prices are reasonable and the portions are large enough to make a second leftover meal out of your order. Also, it's attached to the Courtyard Marriott which is kind of cool in my opinion!<br><br>They take reservations, which calmed my nerves when going to dinner in the Loop on a Saturday night. My friend and I arrived about 15-20 minutes early, so we told the host we'd arrived, and sat at the bar until he came to get us to tell us the dining room had opened (it opened at 5). <br><br>Drink recommendation: the My Jam house mule. Copper Fox changes which jam they use frequently, and when I went this past Saturday, the flavor was blueberry pomegranate. It was strong, unique, and the best mule I've ever had, honestly! ($11)<br><br>Appetizer recommendation: #16 biscuits. Only $6, but if you check in on Yelp, you get them for free! It comes with four, and a really good whipped honey butter on an aesthetically pleasing cutting board platter.<br><br>Food recommendation: Turkey avocado sandwich, and choose the rosemary chips! Our waitress was so sweet and gave us Copper Fox's white barbecue sauce to try with the chips. GET THIS. Also, the sandwich was so large I brought home the entire second half and enjoyed it the next day. What a gift to enjoy it a second time. ($12)<br><br>This was another spot I'd bookmarked on Yelp weeks ago just for the aesthetics, but the prices were surprisingly low, especially for such a gorgeous venue in the friggin' Loop. Try it! You won't be disappointed.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SmMuVNwPuT-Tv5DpDW_-0w/348s.jpg", "caption": "Got the My Jam house mule. Every day they change their jam, and today's was blueberry pomegranate :)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3Gps4HNTDv7yeRlH8Ey-OA/168s.jpg", "caption": "Gorgeous."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NKecd04ea9706mIAyZJSTQ/168s.jpg", "caption": "Classy, at a tasteful price."}]}}, {"review": {"des": "The chicken was dry. Very dry. The corn grit was ok but the mash it was in wasn't very smooth. The Caesar salad we got was just lettuce,crotons and dressing. Oh and a single roasted kale atop.<br><br>I imagine this is a tourist trap given its location and yet high ratings. Wouldn't come back again. Service was good though which is its saving grace. Pricey and bad food. Don't come.", "pics": null}}, {"review": {"des": "We took my daughter and a friend to the Planetarium on a Saturday morning and found ourselves between breakfast and lunch and weren't sure where to go. We really didn't want to deal with breakfast crowds so we searched Yelp and landed on Copper Fox Gastropub.  What a pleasant surprise!! <br><br>We drove right be the location the first time because it's tucked in a Courtyard Marriott and the banner is very understated.  My heart sunk a bit when I realized it was in a hotel, because restaurants in hotels usually have this vibe I can't quite explain, but they just don't feel very intimate.  I did feel that Copper Fox was a bit more open than I would like and it was freezing - I couldn't take my winter coat off at all. They need a few fireplaces or heat lamps!<br><br>That is where the disappointment ended.  Our waiter Darius was so friendly and fabulous. He brought a couple of draft beer samples to my husband for him to try.  They have about six area drafts on tap and they are yummy.  I had the mimosa special.<br><br>Copper Foxes motto is \"Comfort food with a twist\".  I would say that is accurate! We had crab hush-puppies that were amazing. Fish tacos with a sugar-snap pea slaw and a bit of a zing - and you get four fish tacos! Pan roasted brussel sprouts with candied jalapenos - I could not get enough of this dish!  <br><br>We are definitely looking forward to visiting Copper Fox again so we can explore their menu further.", "pics": null}}, {"review": {"des": "OMG what a pleasant surprise. Very low key profile from the street missed it the first time I passed by, attached to the Marriot Courtyard hotel lobby, just look for the Starbucks sign and you will find the Copper. <br><br>I honestly was not expecting the food to be this good. The food is phenomenal and the service is very friendly and pleasant, make sure you hook up with Darius, he will take good care of you. <br><br>My recommendations, crab hush puppies, brussel sprouts, and fish tacos. The sauce with the fish tacos is amazing, a little smoke and just the right amount of heat. Red cabbage snap pea slaw with some madarin orange slices?! Get out! The brussel app is exquisite, the jalepeno slices are slightly candied and take it to a new level. The crab in the hush puppies is real crab, not that fake shiz. The sauce that comes with the pups has a strong lemon element to it. <br><br>Yelp tip- check in with the mobile app and get free biscuits, the biscuits are phenomenally flaky and the butter is delicious. Ask for the biscuit backstory and you will be amazed at how much can go into a biscuit. I have already bookmarked for next visit you should too!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2AGlKJ4KpCNNnzI-Ys-6xg/168s.jpg", "caption": "Fish tacos featuring red cabbage and snap pea slaw, simply lovely and so tasty"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/evuT-0qpvEgqb9jjCprSPg/168s.jpg", "caption": "Brussel app, phenom,candied jalapeño"}]}}, {"review": {"des": "Came here for a quick brunch stop. The food here is delicious and well cooked. We got the biscuits with butter and jam, which was delicious.<br>I also got the omelette of the day, which was a \"World Cup\" omelette with mushrooms and truffle oil. The omelette itself was delicious. However, the menu stated it comes with cheesy potato pancake and I just got hash browns. It's not a big deal, but the hash browns were very average.<br><br>Also I didn't realize this place is literally attached to a hotel so it's basically the restaurant of the hotel. There's nothing wrong with that, but you can kind of tell when you walk in. If you want a quick brunch, this is definitely worth a try. But it's not anything out of the ordinary.", "pics": null}}, {"review": {"des": "The food and drinks were phenomenal but the service could use some work. <br><br>We came around 8 so maybe it was the late night staff wrapping up but considering they didn't close till 11, not sure what happened. We were greeted by 3 people but took a minute for the host to introduce and sit us somewhere. We waited 10 minutes before getting waited on although several people paced around us and saw an empty table with no drinks or food. <br><br>The drink menu had a lot of offer, from plenty of wine and local beers to various mules and cocktails. We went with all appetizers and they were all delicious and fulfilling. Biscuits with whipped honey butter, calamari fries, charcuterie board, and the mussels. The biscuits were baked into so many beautiful layers and so soft in the middle! The calamari fries were thick and certainly the bang for the buck. But the real winners were the meat and cheese board and mussels. A lot more mussels than expected and great for sharing with spicy andouille sausage mixed in and the board came with so many tasty fixings. Apricot jam and prosciutto mixed with some shaved cheese and spiced nuts. <br><br>I'd come eat here even if I wasn't staying at the hotel. Definitely worth checking out!", "pics": null}}, {"review": {"des": "Copper Fox was a great experience - it's ironic that while passing by for years, I never ventured in. It may be that the placement within the Courtyard rendered it easier to overlook, but I am happy that my wife and I ended up inside for a laid back date night. The interior is contemporary, tends to attract younger crowds, and has a great Gastropub vibe.<br><br>On a Saturday night, with reservations, we were quickly seated. We started off with mocktails, lump crab hushpuppies with a delicious citrus aioli and calamari fries (good but fried so quite oily). Then, we ordered the Fox Burger (medium rare - so juicy and the sauce was perfect) and the fried avocado salad with chicken. All the items were well made but we probably could have done without one appetizer given how stuffed we were by the end of the meal. The service was attentive and helpful as well. <br><br>After finishing off dinner, we had no room for dessert but will definitely be coming back for future meals.", "pics": null}}, {"review": {"des": "We had the most fantastic meal here tonight. So simple yet so delicious.<br><br>The appetizer biscuits were UNBELIEVABLE! So buttery and layered, crunching on the outside, soft and flaky inside. Served with perfectly whipped honey butter. I could've eaten 20 of them.<br><br>My wife's salad was tasty, and my daughter loved her kids spaghetti. But my Turkey & avocado sandwich was perfection. I almost didn't get it becuase it sounded so...standard...except this was fresh-carved turkey, with a knockout aioli-avocado mix, on the most deliciously crispy bread.<br><br>I haven't had a meal like this in awhile. Simple perfection.", "pics": null}}, {"review": {"des": "Disappointing. Why are the yelp reviews 4 stars? <br><br>We visited on Wednesday evening before Thanksgiving and were pleased to get a table for 10 without a wait. It was downhill from there. Although the restaurant had many empty tables, the service was painfully slow. The food order was not complicated, but took way too long. It felt like the kitchen staff were on break. <br><br>The food was mediocre at best.  Salmon was very disappointing, risotto was bland and lacking, the fish tacos were meager, the turkey sandwich was mediocre, and the pasta bland.<br><br>If you are in the area, there are much better options, such as Beatrix.", "pics": null}}, {"review": {"des": "I kind of went overboard at this place because I wanted to try everything. They have a decent happy hour which included 5 dollar apps plus you get 3 free biscuits for just checking in. <br><br>Let's begin with location. This place is located inside the Courtyard Marriott. You can watch people Check in from the bar. Kind of a turn off but more of a preference than an issue. It's not a big deal. Just thought I would mention it Incase you are weird like me. ;) <br><br>I went in at about 5:30pm and it was dead. Maybe 1 or 2 other people scattered around. This was a little concerning being that it was around dinner time.  I sat down and was quickly asked what I wanted to drink and told the current happy hour specials. The service from the moment I sat down to the moment I left was excellent. The restaurant was slow, but I could tell they were good at their jobs. My only complaint about service was I was served water without ice. I like my water cold. I had enough \"water at room temperature \" when I was in London. ( Internationally water is commonly served at room temperature). Even with that, still 5 stars from me for service.<br><br>Moving on, first... I promise you I did not eat all off this. Scouts honor.. ( if I was a scout). I ordered <br>Calamari fries, mac and cheese, biscuits with honey butter, and crunchy chicken sandwich with fresh fruit.<br><br>The calamari was good. It seemed fresh but I pretty sure it was frozen. Either way, it did not have a fishy taste. Good. The Mac and cheese was very average. I have never really been a fan of Gouda Mac and Cheese. This one is on me. Let's move on. The biscuits, which I think are a \"restaurant staple\" were good. They definitely needed the fresh whipped honey butter. Excellent with them. Not to mention free if you check in on yelp. Finally... hahaha I got a chicken sandwich. It was thin ( maybe to thin) but had good taste. My only issue was that since the chicken was a little thinner the breading and bun kind of overpowered the taste.<br><br>Over all, I was a little disappointed in the food but it was still good. I might go back again but likely will try a new place when I am back in this area. <br><br>I give it 3.5 stars and rounded up to 4 stars because of service. You can likely find better in the area but by no means a bad restaurant. Give it a try! Other yelpers seem to love it.", "pics": null}}, {"review": {"des": "I was on my own for an appointment nearby and wanted to do something fun and interesting for lunch. Yelp did not steer me wrong. This highly rated gem is just a block away from where I neede to be today, and everyone raved about the biscuits, food, drinks, and service. I was excited to try it for myself. I was paralyzed with indecision when reviewing the menu at the bar, but Darius gave me a golden tip: most of the salads can be half portions and i can add chicken or salmon. Bingo! I had a half Fried Avocado Salad with salmon added, plus the buiscuits. I also got a Snow Cone to drink. Surprise: it comes with a mountain of ice! Yum! I was in flavor heaven with my selections. A few staff members checked on me to make sure everything tasted okay. I gushed over the food. <br><br>Damn, those biscuits! They are warm, crusty, and have a delicious, savoury, salted flavor with a hint if that magical lard. The whipped honey butter complimented it very well. I hesitated to order 3 for just myself, but I ate them all. <br><br>The salad was also just what I needed, and a good portion for me. I ate it all and was stuffed for hours. The salmon probably helped make it even more filling. I am a salmon and avocado fan and thoroughly enjoyed this creation. The avocado slides had a unique, crunchy coating on them, too.<br><br>The Snow Cone was good, too. Creative combination of flavors. I did not realize how strong it was! I was feeling it fast and needed water, which I soon got. I could not even finish the drink, which I felt bad about, but I was already lushing it up before an appointment, so I figuted I'd better quit.<br><br>I wanted to come back and try a dessert after my appointment, but I was still full from lunch and just had no capacity. Another time.  Well done!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/r9Z414YBOU5e5cXxlUbYdQ/348s.jpg", "caption": "Half portion Fried Avocado Salad with salmon added, the last of my biscuits, and a Snow Cone after the ice melted down a little"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4Bzt_CTQWvv5ySRE5G32PA/168s.jpg", "caption": "Cute little fox in the window"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oRQuPZa-vN4cIGNRr4dYTg/168s.jpg", "caption": "Damn those were delicious biscuits!"}]}}, {"review": {"des": "Very nice and well appointed establishment. The menu is not extensive but offers a decent variety of items. Reasonable prices for downtown Chicago. We both had the steak sandwich and were satisfied with the selection. Flavorful but not too tender.", "pics": null}}, {"review": {"des": "Great place for dinner in this area. Don't get thrown off by the fact that it's connected to a hotel, the food here is delicious. With a Yelp check-in, you can try their homemade biscuits and sweet butter - this is the best form of elevated bread and butter! Items I've really enjoyed are the mac'n'cheese, fish tacos, calamari app, and fried avocado. Everything is cooked and seasoned well with the waiter/waitress checking in to make sure you are satisfied with your meal. They have a happy hour which seems like a good value on paper, but they just give you smaller portions of their appetizer menu. Good for those who just want a small nibble or want to try something before going all in on the whole order, but most everything they have here has been on point so I'd say go for the full order. They have a small outdoor seating area (good for max of 4 ppl) that is great to load up on some Vitamin D and after work drinks before heading home.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PYseLH7hu46C8lJMqjq8ow/168s.jpg", "caption": "Happy hour fried advocado"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dl7KAelRqLE9iuT576fShA/168s.jpg", "caption": "Happy hour fried calamari"}]}}, {"review": {"des": "Happened upon this gem because it's close to the hotel we are staying at. Didn't need a reservation at 6 on a Sunday, immediately seated, and greeted. Had Brussels sprouts and calamari fries for appetizers. I had a steak sandwich - best I've ever had! My colleagues had salmon and scallions and layered chicken salad - the best salad she's ever had. The presentation of the salad was amazing- it came out in a mold and then the waitress lifted it off. The chocolate cake is very rich and the perfect ending to a perfect meal. Comfortable seating, upscale modern ambiance, excellent wait staff.", "pics": null}}, {"review": {"des": "I can't help but rate this place a 5 because the waiting staff treated us so well and everyone in my party really liked all the food. Though, we studied he menu and ordered only the things people seemed to rave about. <br>Chicken sandwich <br>Mussels <br>Mac and cheese - get this!!!!! It's made w Gouda and on a hot plate and is amazing", "pics": null}}, {"review": {"des": "My co worker and I dropped in here after some business in town and we were pleasantly impressed. The word \"Gastropub\" is woefully and recklessly slapped on every bar nowadays that wants to hike up their prices for no reason and avoid being identified as a sports bar, so you never know what you're getting into, but I believe the Copper Fox Gastropub is doing it right.<br><br>The menu is obviously creative and inspired, the environment is upper-scale but comfortable, and the drinks did not disappoint. We sat at the bar and the gentleman who attended us was polite and helpful. We had an old fashioned, a beer, the Fox Burger, the Skirt Steak, and the #16 biscuits. Nothing was unappreciated.<br><br>First order of business: get the biscuits. They're just about as close to magic as biscuits can get, as far as I'm concerned. The perfect marriage of crunchy on the outside and soft on the inside; warm and so tasty with the whipped honeyed butter on the side. Really great starter. And the impressions only continued. The steak and the burger were both excellent. We both left extremely pleased and we would be back if we were in town again.<br><br>Thanks, Copper Fox!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OUj-LtFPnM4N1yGJG1mTvA/168s.jpg", "caption": "The #16 biscuits. So, so good!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zWL306bsmf3v8-EYOeuGyw/168s.jpg", "caption": "Fox burger up front, skirt steak in the back. Both really tasty!"}]}}, {"review": {"des": "Try the biscuits! I'm from Alabama and these might be some of the best I've ever had. Not a fan of the orange marmalade they're served with, but they don't need it anyway. <br>The Brussels and Kale salad is fantastic! The Brussels are roasted and crispy. It's divine! Service was a little slow, but very friendly. Would def go back next time I'm in Chicago.", "pics": null}}, {"review": {"des": "This was my first visit. I tried several happy hour items.  The biscuits were delicious -- the sea salt on them is a nice touch. I also enjoyed the meat and cheese plate. Service was slow, even though they were not that busy. They were not all that attentive.  I ended up being given someone else's check.", "pics": null}}, {"review": {"des": "Copper Fox is a decent hotel bar/restaurant. Located inside the Courtyard by Marriott, happy hour (4:30 pm to 6:30 pm, Monday - Friday) is the perfect time to visit, especially if you're looking to try their #16 biscuits. You can get the biscuits for $1 each. I get why people rave about it. Dry, flaky with seat salt and delicious butter make for the perfect pairing. The crispy brussels are about half brussels and half jalapenos. So, if you're not a huge jalapeno fan, it's not super filling. Don't get me wrong, I like the taste, I just don't want to eat a bunch of them. The house Chardonnay ($6) on happy hour is okay. The first one I got was very crisp. The second one came in a chipped wine glass and was quickly replaced once I pointed it out. It was just a little strange that the wines were different, but I guess I'm not complaining since the second was buttery and that's how I prefer Chardonnay. The crispy chicken sandwich was okay. I wasn't a fan of the sweet pickles, but otherwise the favors were nice and the portion is large. However, service was a little slow considering I could count on two hands the number of people in the restaurant. Although, it might have just been my server, since others seemed to get their food faster.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/deuAZJKBwUzVM0LdEgBFFg/168s.jpg", "caption": "Crispy Brussels & #16 Biscuits"}]}}, {"review": {"des": "Wow. <br>Preparation, service, and food was amazing!<br><br>I called to make a reservation a few days before the celebration (Oct. 1) and mentioned we were celebrating my parents' anniversary. The person on the phone said they will do something special. <br><br>An hour before we got to Copper Fox, they texted me to confirm we were still coming. I confirmed, and they said \"Great! We will prepare the room now\" (in more professional terms) ... Room?! This sounded nicer than I was hoping for! I didn't tell my parents that part, so when we got to the restaurant, they were pleasantly surprised that we were seated in a semi-private room. This room, btw, is beautiful. It's like a modern living room with a bookcase, high ceiling, marble table, and nice comfy chairs. Thank you for this extra something-special! <br><br>As for the food, we started with biscuits (free with check-in) and the baked Gouda Mac and cheese. They were nice to give us 5 biscuits, one for each of us, because some places will only give 2-3 of an app, especially considering it being free. The Mac n cheese was a big portion. It could be its own meal. Both were very good and very filling. <br><br>For entrees we ordered the gulf shrimp and lump crab roll, fish tacos, baked rigatoni carbonara, prime steak sandwich, and the crispy chicken sandwich. OK, they were really good. BUT we were so full from the big biscuits and Mac n cheese that most of us only ate half or less than half of our food. I hope they don't think we didn't like it! We really did!!<br>To top it off they gave my parents a light, kind of flaky brownie and ice cream. Yum! <br><br>Overall, everything was great. The ambiance is relaxed and cool. They have chic furniture. Our water was always refilled. Service was quick. And the best part - and the reason we chose this place - is that they serve lunch on the weekends. Not brunch food, lunch food.", "pics": null}}, {"review": {"des": "My husband took me here for our anniversary and it was da bomb! Not only were we pleasantly surprised that a friend of ours was our waiter but the food was absolutely delicious! <br><br>Our friend recommended a few of his favorites from the menu, one being the Brussels sprouts as a starter which we got. They were perfect, jalapeños are actually one of my favorite foods and they came candied on top of the sprouts. The perfect mix of sweet and spicy! The main entrees were a hit too, I had the mahi mahi fish tacos and my husband had the fox burger.  <br><br>Definitely would recommend people to come here for a bite or drink. Nice chill atmosphere, good food and awesome service.", "pics": null}}, {"review": {"des": "Came here for happy hour after a school event, and they were nice enough to reserve the back area for us. I ordered the Moscow mule and the meat and cheese plate, and I couldn't even taste the alcohol in the mule. The meat and cheese plate was fine, but I wish they had had crackers rather than two slices of bread which threw me off. <br>The place is very well decorated, and the staff were very nice and helpful, but I will not be back to drink, unless I come during lunch or dinner to take advantage of their 20% off for NW affiliates.", "pics": null}}, {"review": {"des": "This is a great place! We came during happy hour (3:30-6:30) and got some really nice deals. We started off with free biscuits after checking in on Yelp. These were incredible and reminded me of the south, served with honey butter. We also got brussel sprouts off of the happy hour menu, which were cooked perfectly. For the main course we got a turkey and avocado sandwich with rosemary chips, which was AMAZING. We also got the crispy chicken sandwich (the reason they didn't get 5 stars) and french fries. Do not get the chicken sandwich...<br><br>Service was incredible and the drinks were great too! Definitely come here!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ol6EVfnGuMccH72B3z3BNA/168s.jpg", "caption": "Brussel sprouts and candied jalepenos"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5bJR82IVxUgZ4gV46DzxYA/168s.jpg", "caption": "Biscuits with honey butter (Free if you check in on Yelp)"}]}}, {"review": {"des": "Went to Copper Fox with no reservation and was able to immediately be seated. The waiters name was Darius and he was quite helpful on food and drink choices. I had the jam mule which I was skeptical of but quite surprised by its taste and my spouse had the Sgt pepper which was tasty as well. For our entrees we went with the burger sub fries for avocado salad and the shrimp and crab roll....both entrees were delicious, the burger was cooked well and the salad was superb for a side salad...the crab and shrimp roll was seasoned well and just was overall a great sandwich....I can't forget about those amazing biscuits that we were given, how about omg can I have more...I definitely will return to Copper Fox and recommend that you give it a go as well", "pics": null}}, {"review": {"des": "It was good, not great.  We ended up here before we went to see \"IT\" I would really only go if I was in the area and looking for somewhere to eat besides a chain or fast casual.<br><br>It's definitely a hotel restaurant.<br><br>The deviled eggs were delicious!<br>Biscuits were amazing<br>Burger pretty decent", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/d_TtCVo9cDKZGi3-0u7vpw/348s.jpg", "caption": "Burger...meh."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4Vy6YYbnCsDLUcvpje9p3w/168s.jpg", "caption": "Lump crab hush pups...mediocre"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/d_tShIdksoGxfFZa0xC1FQ/168s.jpg", "caption": "Deviled eggs...delicious"}]}}, {"review": {"des": "Awesome little Gastropub. We enjoyed dinner here. Was a little concerned that it was inside a hotel but there was nothing to worry about. <br>Service was great, food is fantastic. It's a great place for a date. But probably not for larger parties unless you book ahead. <br>Give it a shot you won't be disappointed!", "pics": null}}, {"review": {"des": "This was the final stop on our food tour and we were served a famous brownie. It was entirely too sweet for me plus it had carmel sauce. Just too much sugar. It gave me a headache.<br><br>I did, however, like the modern interior and the bar. I would consider returning here for a drink during happy hour or maybe even dinner. <br><br>The chef came out and talked to us and was very approachable. <br><br>Overall, I liked the vibe and the location is great.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CwRVw7yPv7ySmwY1nh_Ejw/168s.jpg", "caption": "The bar"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oOssjwfefswdVWVn3gLHGg/168s.jpg", "caption": "Brownie"}]}}, {"review": {"des": "A few co-workers and I called to see if it was busy and would need a reservation... The lady on the phone said no it was not busy at all... That was far from the case.  We arrived and had to wait 40 minutes to get a table... Not only that, we ended up just sitting at the bar. What's confusing is, there was really no one in the restaurant, so I'm not sure what the issue was. <br><br>We finally got our orders in, but it took maybe an hour or more for our food to come out. The server/bartender told us \"it got busy all of a sudden\" ... again, not many people there.  When our food arrived, everyone's was cold. You could tell it had just been sitting there and forgotten about. <br><br>The only reason I'm giving this place a two star is because the drinks were ok at best. If they were watered down... 1-star.", "pics": null}}, {"review": {"des": "Nice spot for a good drink and solid food choices. Food portions are nice and big and the prices are very fair for Chicago standards.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/O6_hHWEwm48zYGtmFmqnTA/348s.jpg", "caption": "Let's check out how right these reviews were!"}]}}, {"review": {"des": "So the first time I came here, I ordered a brussel sprout salad and to my dismay there were very very few brussel sprouts and toooooo much cabbage (which wasn't listed in the description). <br><br>The owner/manager promptly addressed the issue and updated the menu description. My second time I went for the fried avocado salad and the brussel sprout appetizer and neither disappointed! I would definitely come back for their appetizer and maybe try another dish! Thanks Dominic and Jerrica!", "pics": null}}, {"review": {"des": "Just a comment on the breakfast. Got the chef's omelette to go which was really good. The hash brown that came with it was just okay. The sourdough was amazing. I didn't eat in the restaurant but the ambiance was pretty nice. It was really convenient located at the bottom of the courtyard Marriott", "pics": null}}, {"review": {"des": "It took a long time for our food to arrive; but, when it did, it was very good. I ordered the pork porterhouse - an extra thick pork chop that came with well-seasoned brussel sprouts.", "pics": null}}, {"review": {"des": "I ended up here after attempting to get service elsewhere to no avail. At the other place, I went to the bar, sat down. Made eye contact with the bartender, asked for a menu and was left. Alone. 5 mins pass. Almost 10 mins pass. And at first I was going to be more forceful but then I asked myself: \"Why should I have to flag someone down and beg them for the opportunity for me to give them my money?\" Yelp pointed me to Copper Fox and it did not disappoint.<br><br>I come into Copper Fox, sit down a the bar and am immediately acknowledged and given a menu. Said menu actually has happy hour - or rather, \"The Fox's Hour\". Also bonus. I opted for the Barman's Banquet because it seemed like the most bang for my buck and I ordered a biscuit because everyone at the bar and on yelp seem to be crazy about them.<br><br>And for good reason! Seriously, it's better if you just have one than for me to struggle with my terrible amateur food critique. I enjoyed my meal, the service was prompt and professional and I had a pleasant dining experience for a good price (for the area). If you're near here or staying at the hotel where the restaurant is located, give this place a try - especially during The Fox's Hour!", "pics": null}}, {"review": {"des": "After back-to-back lunches and a pair of incredible brunch outings, it's obvious this place is truly a hidden gem in Streeterville.<br><br>Every meal -breakfast, lunch and dinner- should start with Chef Courtney's #16 Biscuits! (Yelp members get a free sample just by checking in!) These little lovelies are tender, flaky and served up in a seasoned cast iron skillet with a sprinkling of crunchy salt on top - sadly, these are the biscuits my Momma thought she was baking every morning. <br><br>Kick off your brunch with a wickedly spicy Bloody Mary from the bar or a simple mimosa with fresh orange juice. If you find yourself jones'ing for more biscuits, order up their monochromatic Biscuits and Gravy ($10) with a perfectly fried egg on top ($2) - they're rich and creamy, with huge pieces of sage-scented sausage. The Mason jar filled with crispy tater tots is their best side dish for brunch.  The four slices of Brioche French Toast ($13) are pillowy soft and served with a not-too sweet maple syrup.<br><br>For a fantastic lunch, you really don't have to venture past the shared plates menu - the Steamed Mussels ($13) feature pieces of andouille sausage and sweet nibs of corn on the cob, drenched in a buttery, garlicky beer sauce that you sop up with the crunchy toast teetering on the top. Their Calamari Fries ($11) are one of the more peculiar versions of the restaurant staple; these long, crazy-crunchy fingers of tender meat are served up with an awesome citrus aioli for dipping and a charred lemon half. You won't believe the contrast in texture between the crispy crust and the meat inside! You can round out your meal with a lava-licious bowl of their Baked Gouda Mac & Cheese ($10) featuring smoky gouda, curly cavatappi macaroni and crisp bread crumbs. Wash that down with a boozy Copper Fox Mule ($11 - just $8 during Happy Hour) made with smoky mezcal, ginger beer, lime and basil - or my new favorite drink in Chicago, the Unfashioned Old Fashioned ($11), a masterful mix of rye whisky, orange and rosemary simple syrup, a dash of bitters and a drop or two of Tabasco. Truly an un-usual un-fashioned adult beverage!<br><br>Always great, attentive service - never hovering. Stop by for a drink at the bar on your way out.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DihmJg3-C2Io5CeOCecJsg/348s.jpg", "caption": "Biscuits and Sausage Gravy ($10) with a perfectly fried egg on top ($2) and a side of crispy tots"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ep8by_IrINQSs5vWoPznNw/168s.jpg", "caption": "Pillowy soft Brioche French Toast ($13)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3cVTp6jkXie5F0vxzohVjw/168s.jpg", "caption": "Lava-licious Baked Gouda Mac & Cheese ($10)"}]}}, {"review": {"des": "My husband and I had brunch here and loved it. It is inside of a hotel but you don't really feel like you're in a hotel. The food was very good and the service (Matt) was excellent and friendly. We had:<br><br>Biscuits - free with yelp check in. These were some of the best biscuits we have ever had. Simple but done so well.<br><br>American breakfast - hubby had this and said it was great. Basic eggs, bacon, potatoes, and toast - very well executed.<br><br>Turkey sandwich - this was so good. Turkey was thick cut like thanksgiving turkey, with avocado, gouda cheese, tomato, arugula, and an aioli. It comes with fries or chips and you pay an upgrade for a side salad. I did this and got the kale and brussels salad which was amazing. Highly recommend.", "pics": null}}, {"review": {"des": "My husband and I had tickets to a play at the Lookingglass theater and  this place came up while doing a search for nearby restaurants. <br>We walked in at around 5:35 and lucky for us they had a happy hour until 6pm! We started with the avocado fries and their Mezcal Moscow mule. For dinner I had the skirt steak and fries. The steak was perfectly cooked and seasoned! My husband had the pork at the recommendation of our waitress and he almost licked the plate. The chorizo cream that came with his dish was sooo delicious I kept eating it with my fries. We will def be back!", "pics": null}}, {"review": {"des": "Came here with my roommates after a night of shopping at mag mile. We had a good time!<br><br>Service was super friendly and the water was never empty too long since a waiter came by to fill it up frequently. We also did the yelp check-in offer to get some complimentary biscuits (which were delicious and filling - order accordingly!)<br><br>I ordered the fried avocado salad (half order) and the carbonara. Both were delicious. The fried avocado salad would have been better in my opinion if it wasn't deep fried. The carbonara was super yummy - liked the bread crumbs on it (wish they put a little more) but it tasted delicious the next day too! I also ordered the fox mule - it was yummy!<br><br>My friends ordered the fried avocado salad, tacos, burger, and porterhouse. All enjoyed their food however my friend made the same comment about the fried avocado and the fries. The fries were cold and tasted like they were made in the morning ('leftover' style fries). We told the waitress and she was super awesome and had them make us a fresh batch of fries. The 2nd batch of fries was better but only by a small margin since it just was warmer. My friends and I think that the kitchen doesn't change the oil in the deep frier enough which is why all the fried stuff we had tasted not so great.<br><br>What would have made a 'great' time vs a good time would have been (1) faster serving time -- we waited about 50 minutes for our food and (2) deep fried stuff was subpar -- kitchen needs to change the deep fryer oil more frequently.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3uLMhknhntgsCQWhWPEjxg/348s.jpg", "caption": "Carbonara"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RuxJQ_tKrCDA_XqSFKySIg/168s.jpg", "caption": "1/2 order of fried avocado salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/viv9RqCX3mqwXVbC26CrZQ/168s.jpg", "caption": "Fox mules"}]}}, {"review": {"des": "Good lunch at the Copper Fox Gastropub. Looked on Yelp for a restaurant to have lunch at near our hotel and found this gastropub a short walk away.<br><br>Upon walking in we thought it was going to be a bit pricy and bugee. We overused the menu and ordered a couple waters. They had some interesting dishes and a Yelp check in offer for the #16 Biscuits. We chose the baked Gouda mac and cheese which came topped with cheddar bread crumbs and a side of habanero hot sauce, and the prime steak sandwich served with house made chips. Both were delicious and a nice spicy kick with the hot sauce on the mac and cheese. <br><br>After we ate our meal, I inquired about the Biscuits. They apologized and gave us a couple drinks while we waited. The maplewood fox IPA and mimosa went down just right after there meal. The Biscuits arrived and were served hot with honey butter. Well worth the wait as these little bits of heaven melted in your mouth! <br><br>Thank you for a memorable meal Copper Fox!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AkYFZr134fwfc3GwLUkucw/348s.jpg", "caption": "#16 Biscuits with essence of sea salt, bacon and rosemary...melt in your mouth!"}]}}, {"review": {"des": "Breakfast review; Had the slim farmer and the only thing I didn't like about it was the name! Avocado toast was perfect, egg whites cooked like an omelette, fresh mozzarella on top. I checked in on yelp to get the free biscuits which were great but probably negated the benefits of the egg whites. Oh, nice strong coffee, too!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/feGsoAUdX5ZEd72mhcIXbg/348s.jpg", "caption": "Slim Farmer, biscuits in the background"}]}}, {"review": {"des": "Copper Fox has some pretty amazing bites! The interior is very comfortable and the service was spectacular.<br><br>Beginning with the food we got the biscuits (free with a yelp check in!), avocado fries salad, steak sandwich, roasted brussel sprouts salad with added salmon, and fish tacos. I really think that the star of the show was the biscuits and the brussel sprouts salad. The biscuits were warm, flakey, and with a nice crust on the outside. Rich with butter but not so much that it was overwhelming, the biscuits are a must for any table. My only reservation is that the biscuits would be much better if served with a jam to cut the denseness a bit, but nonetheless still a fantastic starter. The brussel sprouts and kale salad was also delicious, with the added salmon (which was huge and only about $6 extra), this salad was definitely one of the better ones ive had.<br><br>The avocado fries salad and steak sandwich was alright. Admittingly the fish tacos were a little on the dry side and I wish they used a single, larger fried fish filet instead of multiple smaller ones. Still, Copper Fox is a great option if you're in the area and looking for a nice bite in a pretty setting!", "pics": null}}, {"review": {"des": "We were doing our annual staycation downtown and this is was one of the restaurants I selected since it was in walking distance from the hotel we were staying at.  Didn't realize the restaurant was in a hotel until we got inside and saw the elevators.  Décor was nice....brown/copper tones and understated. It has an upscale feel to it.  Once we were seated, I noticed quite a few tables with kids there.  Wasn't sure why they were there because the menu at first glance isn't kid friendly beyond the Gouda mac/cheese.  But they must have a kid's menu on request as I saw wait staff bring out kid size portions of standard kid's fare to a table.  There is also a very cute outside space with seating that didn't look too cramped, but it was too windy for us to sit out there.<br><br>First the prices...for those complaining about the prices, these are downtown Chicago prices, so deal with it.  Copper Fox was on par with other restaurants in the area.  A decent price on the drinks as a glass of Prosecco was $9, $38 for the bottle.  <br><br>We started the meal with the #16 Biscuits.  They came out in a small cast iron skillet.  Whenever I see a cast iron skillet, I assume it is hot, but this was not.  But the biscuits were and they were to die for.  They're flaky, fluffy and crunchy all in the same bite.  They are sprinkled with sea salt on top and due to the crunch, I assumed that they must be fried, but our server Lindsey stated that they are baked, but covered in bacon fat.  So technically, they were baked, but with bacon fat covering them, they fried in the oven.  There was honey butter, which was nice and added a subtle sweetness to contrast the sea salt.<br><br>We also got the Calamari fries.  I would go back just for these.  They are strips that are cut from I have no idea part of the squid, but man they were delicious and meaty.  The coating that was used to bread them was not heavy, but savory and tasty.  Definitely more calamari than breading.  They were paired with a nice tartar sauce and a cold grilled lemon.  The grilled lemon was a nice touch as you got the citrus with a touch of smoke flavor to the fries.<br><br>For dinner my daughter and I got the Baked Rigatoni Carbonara (parmesan cream, fennel sausage, snap pea, runny egg).  Runny egg was done just nicely....no egg white to be seen.  The parmesan cream sauce was a bit on the mild side for me, but a little salt and pepper at the table helped it along.   Not much in the way of fennel sausage in the dish...looked as if it was added for flavor and not for eating.  The sausage itself was delicious, just not enough of it in the dish.  The snap peas were crunchy and tasty, but too many for me in the dish.  This was more like a vegetarian dish with a little bit of meat for flavor.  Probably not something I would order again.<br><br>My husband had the fish tacos.  Great presentation and he said that they were great in flavor.  They are on the small side, which is why my husband got them as he eats light in the evening.  They do not come with any sides, just the three tacos.  Not sure why this isn't an appetizer as I don't consider this an entrée, so if you are hungry, I would stay away from these.<br><br>My husband and daughter split the Nutella brownie...devoured it more like it.  The brownie was served in a cold cast iron skillet, but it was warm and gooey as it was drizzled in caramel sauce.  There was also a lovely vanilla bean gelato that was explosive in taste...very nice.  My folks declared that the brownie was a sheer delight.<br><br>I want to give our server Lindsey a 5/5.  She was very attentive, friendly and bubbly.  There was also a hostess that was on her A game as well.  When she saw my husband needed another beer, she came over to ask if he needed another just a split second before Lindsey could do it.  They seemed to have a good rapport and that was nice.<br><br>I would more than likely stop here again for a meal, definitely to get the calamari fries and to try a burger as it looked very good from what I could see from other folks tables.  Some of the salads I saw also looked worth exploring, especially the seven layered one. The presentation alone looked interesting as it comes out in a container so you can see the layers, then it is poured into a serving dish.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SC20EPXDt6ROuCCWjw2EUA/348s.jpg", "caption": "Fish tacos.  Cornmeal crusted mahi mahi, sweet/spicy snap pea cole slaw, Pico de Gallo and cotija cheese"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CI2P2DKRHTRQb2Ov5I4iIw/168s.jpg", "caption": "Baked Rigatoni Carbonara with runny egg"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2RvM0KGpN7yTB0WvWRrjbw/168s.jpg", "caption": "#16 Biscuits.  Crunchy, flaky goodness covered in bacon fat and sea salt"}]}}, {"review": {"des": "We came here on a good tour stop so unfortunately I can't give an entire review. But, with that in mind, we were treated so kindly by the staff and they made us feel at home. We were instantly sat in one of their private rooms. It was so quaint yet modern and comfortable. We were able to try their Nutella brownie with whiskey Carmel sauce. The brownie was pretty good but the Carmel sauce was AMAZING. It had just the right amount of whiskey to Carmel ratio. I also really appreciated the fact that the executive sous chef cake out to talk to us. He was very kind and spoke highly of the #16 biscuits. I wish I was able to come back and try those babies but I wasn't able to before I left town. Next time I am in Chicago I will definitely stop by for one of these and another brownie!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gDJGPun9yVfScn8IHqYYrg/348s.jpg", "caption": "Nutella Brownie"}]}}, {"review": {"des": "This is a pretty nice/classy place to eat. I was expecting a pub/bar place but this was like a nice hotel restaurant.<br><br>Overall: 3.7/5<br>Value: 3.5/5. The food here isn't cheap. Sandwiches run around $15 and appetizers around $8. You do get a pretty big portion (I couldn't finish mine and packed it back :) ) but just be prepared to pay ~$20. <br>Speed: 3.8/5. It wasn't super fast, wasn't super slow. Average sit down restaurant wait time.<br>Atmosphere: 4.5/5. This place is real classy.<br>Taste: 3.8/5. The sandwiches were good. I was very satisfied with my sandwich. Was it worth $15? I guess for the quantity maybe. I got the Brussel sprouts appetizer and it was good but a little too salty. The biscuits were also good and crispy but a little too salty.  <br><br>Enjoyable dinner and I would come back more on special occasions--it's not somewhere I could eat regularly at my stage in life", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/U1F1z6Pw60AAwlOOaQ4MYA/348s.jpg", "caption": "Crispy Chicken"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_UgPHkauUZdd3Z3znjcxqw/168s.jpg", "caption": "Turkey and Avocado"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/L1NwI4OAYR3XCYFrDrtGhQ/168s.jpg", "caption": "Crispy Brussels"}]}}, {"review": {"des": "Yum! We were in the food for a variety of food, so we searched for Gastropubs in the area. We decided on the Copper Fox. We booked a reservation on Open Table and were quickly seated when we arrived. The restaurant was cute and the staff was nice and attentive. I got the jam mule to drink. It was really good! We got the biscuits (free from checking in on yelp), and they were SO good. We also got the Brussels sprouts. They candied jalapeños were obviously spicy (thank goodness they left the jar of water on the table) but it balanced well with the Brussels sprouts and sherry vinegar. We split the fish tacos. They were a little different than we expected, but really good. We were stuffed after dinner and really didn't spend a ton of money. Great experience here!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7SAdsHazMdlJe0aB4eP9Ww/348s.jpg", "caption": "Crispy Brussels"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/X4meVvhgeuxx_bQx6EYA_g/168s.jpg", "caption": "#16 Biscuits"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GYGHRmoWwDqtHOhfZvU-Fw/168s.jpg", "caption": "Fish Tacos"}]}}, {"review": {"des": "Don't pass this by! Best burger I've ever had, accompanied by a perfect Cosmo. Came here with some biscuit lovers and everyone walked away completely happy. I'm gluten free so I could not have the biscuits but I wasn't envious for long....those disappeared in a heartbeat. Great atmosphere--we were here on a football Sunday and it was great to relax and watch the games; excellent service, great bar, awesome food. A gem!", "pics": null}}, {"review": {"des": "Located with the Marriott Courtyard - it is spacious venue where you can have a good conversation and avoid shouting to hear the other person.  I had the Fox Burger on my visit - it was really good, be sure to get the rosemary chips.  I was a bit disappointed they had a limited tap selection so I went with a local IPA from a can.", "pics": null}}, {"review": {"des": "This was a great find - really delicious food in a nice, upscale atmosphere. Service was friendly and attentive. <br><br>I had the shrimp and lump crab roll with a fried avocado side salad, plus the apple pie with ice cream for dessert. Everything was perfect! The food was fresh, flavors and seasonings were right on, and there was a great balance - a fresh take on the familiar. I'll be back for sure.", "pics": null}}, {"review": {"des": "Thank you very much Wesley! Awesome server. He was very professional, kind and made my dinning experience a memorable one. Loved my fried avocado salad with salmon add and a delicious salted caramel craft brew. Once again everything was amazing. Kudos to Copper Fox team! we will be back", "pics": null}}, {"review": {"des": "Swanky place! My group of 8 was seated at a round table where we each had enough space to sit comfortably. We were celebrating a bachelorette and they brought complimentary mimosas for the group. <br><br>DO NOT miss the biscuits and honey butter .<br><br>The best item I tasted was the friend avocado salad! The candied jalapeños, pickled onions and the fried avocado were a bomb combo. <br><br>I would not order the black bean/quinoa burger - I've had better.<br><br>I didn't get a taste of the friend chicken sandwich but OMG it looked amazing!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RzW-oaQ3_4PBTdAvcVFt2Q/168s.jpg", "caption": "Copper Fox Mule"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nwWsiWzptK2_0mANbFFBlw/168s.jpg", "caption": "Chili Fresca"}]}}, {"review": {"des": "If you are visiting Chicago and looking for a great place to chill, have a good drink and eat some unique food, this place is for you.  I sat on the patio one evening this summer.  The staff was friendly, prompt and not pushing us out. Although it may seem odd to order biscuits as an appetizer, do it.  They are the type of food that you dream of and come back for, fluffy, buttery, salty and served with incredible butter.  After wrecking myself with that, I decided to order the fried avacado salad with grilled chicken.  It was an amazing blend of textures and flavors.  The sweet pickled jalapenos and grilled corn were over the top delicious additions.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qEZAke9J7-5q8Gi6AhKAbA/348s.jpg", "caption": "Fried avacado salad with grilled chicken."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uU4LUFLmzyRK_1Ny53O5vw/168s.jpg", "caption": "On the patio."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tVAYQ_EbdkkwDILMRl5fAQ/168s.jpg", "caption": "Trio of Biscuits."}]}}, {"review": {"des": "Food was ok. I recommend the mac & cheese. The biscuits were ok but very salty. I had the chicken sandwich; the chicken was great. The rest of the sandwich was odd. Fries were bad and cold. My fiancee had the burger. It was of poor quality. The most ridiculous thing was that they tout their \"homemade pickles\" but they literally only give 1 pickle slice. I think that we could have had a better meal at a fast-casual restaurant (mBurger, Nandos, Vapiano). Service was not exceptional and food took a long time--even though the restaurant was less than 1/2 full & we ordered appetizers. I will not go back. <br><br>Also, if you're an OpenTable​ user, the restaurant reported me as a no-show. Opentable followed up and corrected it. But, it wasn't worth the effort.", "pics": null}}, {"review": {"des": "We stopped in Copper Fox for \"linner\" to grab a light bite to eat.  We sat by the bar section and was tended to perfectly by the bartender.  He was very friendly, and even accommodated us when our phones were dying, by bringing us a charger to charge them.  <br><br>We started out with the #16 Biscuits and Crispy Brussels which were both amazing.  I really liked the honey butter that was served with the biscuits.  <br><br>For our main course, we chose to split the Crispy Chicken Sandwich which was insanely good.  It had a jalapeno vinaigrette with tomatoes, pickled onion, avocado, cheese, and housemade pickles.  We couldn't decide on the fries or rosemary chips, so we chose both.  The chips are made in-house.  Everything was so good, it was difficult to choose which plate was my favorite.  <br><br>Copper Fox has already been recommended to one of my friends who will be traveling to Chicago in the near future.", "pics": null}}, {"review": {"des": "Food is ok. Portions are a bit slim if you compare them with any other brunch place in the area. They also took some time to arrive.  Servers are really polite and attentive which is a big plus.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4rhmlSe60izqcQ6Yz1hUsA/348s.jpg", "caption": "Wild berry pancakes and The American."}]}}, {"review": {"des": "I dined here on Thursday evening and had a very pleasant experience. The dining room is nicely appointed and separated by a metallic curtain from the bar area with its obligatory flat screen TVs. My waiter was excellent, combining swift service with a pleasant manner and helpful information about the menu and the seasonal specials. The food was good and the bill was reasonable. Surprisingly, for a \"gastropub\", There seemed to be only about a dozen kinds of bottles or cans of beer for sale, and considerably more choices of wine.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Uzs2qY5K33dk-JI-4wNfoA/348s.jpg", "caption": "Checking in!"}]}}, {"review": {"des": "Quite a solid gastropub that's part of the lobby of a Courtyard Marriott. <br><br>There's a decent beer selection here, and I quite enjoyed the Apex Predator saison. The food offerings might look like predictable hotel restaurant fare on the surface - that is, the usual selection of apps, burgers, sandwiches, tacos, and entree, but I found my crispy chicken sandwich to be quite sizeable and scrumptious. <br><br>If you can get here during happy hour, you can score some good deals. There's currently an $18 deal that combines a burger or chicken sandwich with a beer and a shot. Plenty fine enough for me.", "pics": null}}, {"review": {"des": "I went here with a couple friends and we had a great time! <br><br>Service (great!): We initially made a reservation for 7, but only 5 of us showed up. They had already set up a huge round table for us, but I wanted something a bit more intimate, especially since only 5 of us were going to show. They had no problem seating us elsewhere! Our waitress was very nice and made great suggestions. <br><br>Drinks (good, but not the best): On the pricier side, as I would expect for a hip streeterville restaurant. I had the Oh Mai which was tasty. My friends had some beers on draught which they enjoyed. I'd definitely just get a beer next time, for price sake.<br><br>Food (great): We ordered a couple appetizers which were delicious - Brussels sprouts were some of the best I've ever had! We also got the crab hush puppies which were just okay. Couldn't really taste the crab. I ordered the black bean burger for dinner, which was one of the best I've had! It was hearty, great taste, and packed with protein, which is important for me as a vegetarian. My friends got burgers, fish tacos, and chicken sandwiches. The fish tacos were pretty small for the price, so I'd stay away from those. But otherwise all but one plate was clean. I felt a little limited because most of the prices were so high, but I'm so so glad I got my black bean burger! <br><br>Ambience: upscale, crowded on a Friday. Enjoyable for after work get together. <br><br>BOTTOM LINE: very tasty food, but on the pricier side (although average for streeterville). Would go back again with my parents, who would pay!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_h4deS_NA_D-70Pql9MtNg/348s.jpg", "caption": "Brussel sprouts"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1Uerush3BwJ4wLtRWBYUXQ/168s.jpg", "caption": "My Oh Mai cocktail"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GZo-oP69bK4kzXDSrpll4w/168s.jpg", "caption": "Crab hush puppies (a couple were already eaten)"}]}}, {"review": {"des": "My GF and I were visiting from out of town, and saw this place near the top of the recommendations. Our server Christina O., was very attentive, and even recommended some options on what to eat. Thankfully, through yelp, we were able to get some free biscuits and I was not disappointed! She got the Shrimp and Crab Roll sandwich, and I got the crispy chicken sandwich. I can't say much for hers, but mine was perfectly balanced, flavor wise. The only gripes I have are that the biscuits were just a touch dry for my taste, and I didn't taste much of the Jalapeno Vinegarette on the sandwich I got. Otherwise, a great place to stop for a relatively affordable dinner at the quality we got. Will definitely check this place out next time we visit!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UaRP2QZmSHtrnK-faNzoEQ/348s.jpg", "caption": "Tasty looking crispy chicken sandwich!"}]}}, {"review": {"des": "Let's start out with the service.  Parn, Carrie and Sylvie treated us like royalty.  I honestly can't remember the last time I experienced this level of service at a restaurant.  <br><br>Now, on to the food.  Make sure you start out with the biscuits, which happens to be one of the specialties of the house.  They were amazing!  My daughter really enjoyed Huevos Rancheros, a solid 8 on a scale from 1 to 10.  I had the Praline French Toast which was VERY nicely done.  I savored every bite.  The bourbon maple syrup was a perfect match.<br><br>They've only been doing brunch for a month but under Carrie's watchful eye, they are already hitting on all cylinders.  Bravo!", "pics": null}}, {"review": {"des": "Brussels sprouts are so good words cannot describe. Also the cocktails are delicious they have a variety from sweet and spicy. Always as what there specials are. The southwestern salad had so much flavor and tasted amazing", "pics": null}}, {"review": {"des": "Found this place simply walkin down the street. Good food. Nice atmosphere. Had the Key Lime Fizz cocktail and it was amazing.", "pics": null}}, {"review": {"des": "Food and service were good. The biscuits and mac and cheese were delicious.  <br><br>The look of the bar is upscale but casual. Kind of a trendy place but you can still wear nice jeans and a shirt and fit right in. <br><br>The Mules they have we're all delicious!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UYWHxr98I3ocYsfIQ_5m_A/348s.jpg", "caption": "Great atmosphere and service. Awesome food! 5 stars!"}]}}, {"review": {"des": "Recommend the porterhouse, best on the menu, the chorizo sauce was smoke and rich. Loved the signature cocktails. Brussels were crispy, just how I like them! Came here after another restaurant nearby was too busy! Great service and friendly. Also offers outdoor eating.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Vs5kZOl69u7iL9b6gqt4Tg/348s.jpg", "caption": "SGT Pepper - patron tequila, agave, house-made poblano grapefruit soda, chili-lime salt."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YHoSWbweJkeCiBOlN3dMHg/168s.jpg", "caption": "Pork Porterhouse - crispy brussles and chorizo cream."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/l7MQ19vxanElz5v-qyS-Vg/168s.jpg", "caption": "Smokey Negroni - sombra mezcal, aperol, cardamom antica, flamed greapfruit swath."}]}}, {"review": {"des": "Crikey, Yelpers! I've done you a great disservice by waiting so long to review Copper Fox!<br>This place rocks and you need to check it out. It's been long enough I don't recall what I had, only that the scallops were perfectly prepared and surprisingly fresh given the geography of Illinois. The deviled egg appetizer is a must try - smoky and spicy with the chorizo. It warmed the palate but did not overpower. My dining companion dug into the famoso biscuits and told me he hadn't eaten any this good in ages. Being GF, I opted out but sat, green with envy, whilst I sucked an egg.<br>Our server was friendly, attentive and high quality. I believe I also had a tasty cocktail that I tragically remember nothing about. <br>I ate at Copper Fox four months ago on a weekend trip and I still remember details about the meal which is a testament to their quality. So head over now, you won't be disappointed!", "pics": null}}, {"review": {"des": "They only offered a brunch menu on a Saturday at 1pm....the biscuits were amazing!  The service was a bit slow, my eggs Benedict was luke warm and the bacon was not thick cut as advertised.  Not horrible but not great.", "pics": null}}, {"review": {"des": "This place was great! I had gotten the shrimp and crab roll with French fries. The food was pretty decent. My fries were amazing but the crab and shrimp roll had way too much sauce. However, the presentation was great. We sat outside of the restaurant and it was beautiful. The service was great along with the atmosphere. Definitely recommend. My four star rating is based off of the food.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/d2EMOn5BW7ylp5lB6jsSug/168s.jpg", "caption": "I had Gulf Shrimp and Lump Crab Roll and my boyfriend had the steak."}]}}, {"review": {"des": "I swear I've been saying in all my reviews recently how BOMB everything is but you will thank me later! I must be on a hot streak! And this place is on fire!!<br><br>It's located in the Courtyard Marriott (in the lobby area right when you walk in). We made a reservation with OpenTable just in case, since it was a Friday night around 6 o'clock. It was the perfect time to go.<br><br>We ordered:<br>- Baked Gouda Mac & Cheese (appetizer)<br>- Herb Roasted Chicken<br>- Diver Scallops<br><br>You guys! Everything was super BOMB! I'm telling you! As much as I enjoyed my Diver Scallops, everyone was ordering the Herb Roasted Chicken that night & I can see why! So good.<br><br>While there's no real dessert menu (I wish they did!) we ordered:<br>- Nutella Brownie w/Hazelnut Gelato<br>- Strawberry Shortcake w/Vanilla Ice Cream<br><br>Clear winner here was Nutella Brownie! Loved the hazelnut gelato! <br><br>This place is NOT to be missed! When I'm back in the area, this will be a first stop for me!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wOJI8pFYHySErQLi3m-52w/348s.jpg", "caption": "What's left of the Baked Gouda Mac."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_fw-cupUdA58glGszBAvMg/168s.jpg", "caption": "Desserts. Super YUM!"}]}}, {"review": {"des": "I went here on a Friday night around 6:00 with a friend and we were able to be seated right away with no reservations. At first I was thrown off because it looked sort of like a semi-fancy hotel restaurant, but their were quite a few families there with kids. It's hard to explain the vibe.<br><br>Anyway we were seated right away and our waitress was awesome and let us take our time looking through the menu. This review is strictly for the food cause we didn't order any cocktails, but the mules do look amazing and I'll have to try one if I'm back out this way again.<br><br>We decided to order everything to share:<br>Biscuits - Okay - I know their known for their biscuits, but I've had some killer biscuits in my lifetime and prefer the ones that sort of melt in your mouth like butter. These were on the hard/crispy side.<br><br>Crab Cakes - I'm a fan! I like the sauce they came with as well.<br><br>Mac and Cheese - Again I LOvE Mac and Cheese and it was missing something. We were thinking maybe more bread crumbs or a kick of flavor.<br><br>Fried Avocado Salad - DELICIOUS! The combination of all the flavors and ingredients worked well. I'm not a huge fan of corn, but I liked it in the salad.<br><br>Brussels Sprouts - Charred nicely on the outside, but hard on the inside. We brought that to their attention and they took care of us.<br><br>Overall the experience was good, but need to taste the drinks next time I'm back cause they looked quite tasty. :)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CyvxrWgAcx9l2e6o91IBJg/348s.jpg", "caption": "Fried Avocado Salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jciPP1Cs0VROoYJABApGKw/168s.jpg", "caption": "Brussels sprouts"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/48yDlxUB-HtZlMCCxG8DQQ/168s.jpg", "caption": "Crab Cake"}]}}, {"review": {"des": "Service was a tad on the slow side but the food and ambiance was on point. Cute spot. Would go back", "pics": null}}, {"review": {"des": "My husband and I went for Thanksgiving dinner here. I specifically chose this restaurant because I was excited about the salad/soup/dessert bar they were going to set up. To my great disappointment, the salad/soup/dessert bar was awful. Food sat out until biscuits were stale, the soup area looked unappetizing and even though the dessert table had ample desserts choices to choose from NONE were good. Not even the pumpkin pie. <br>This review is so difficult to write because although the bar set up was awful<br>******* I would highly recommend the plated food. It was excellent. ***** We had moist turkey with flavorful mashed potatoes, stuffing and green beans. <br>Go to Copperfox for a nice dinner but avoid it at all costs for any of their soup&salad bar/dessert table set ups.", "pics": null}}, {"review": {"des": "We went for a quick bite, we weren't real hungry and there plates were just right. Had the salmon and turkey sandwich and the service was great and food came out fast. We would recommend to visit you won't be disappointed.", "pics": null}}, {"review": {"des": "Went solo and was seated and waited on quickly. Scott was engaging and did a great job suggesting possibilities to make a great meal and I enjoyed every bite of the Brussels, salad, and turkey sandwich.", "pics": null}}, {"review": {"des": "Fried avocado - so, so yummy. I love avocado, and I love this!! It's crispy on the outside, and creamy in the middle. The dipping sauce elevates it. 5/5<br><br>Fried avocado salad - got this bc the fried avocado was wanted, but a salad too. It was better than I expected. The dressing was nice, and all of the components went well together. If you want the fried avocado, but some veggies as well, I'd get this. You can ask for a side of the avocado dipping sauce. 4/5<br><br>Root vegetable risotto - I really didn't like this. It didn't have much of any flavor in my opinion, and it was undercooked. 1/5<br><br>Biscuits - free with yelp check in. They're flaky, and fluffy with sea salt on top. They're pretty yummy. Everything you want out of a biscuit. It comes with honey butter which adds a nice subtle sweetness to it. 5/5<br><br>Calamari - my boyfriend adores these. They're super crispy, hot, and the tartar sauce that comes with it is exactly how we like it - lemony/citrusy!! We'll always get these. 5/5<br><br>Pork porterhouse - this is very delicious when cooked properly. The first time we were here they undercooked it. Second time was a little over, but still good. The chorizo crema adds a nice smokiness and saltiness to the dish. The brussel sprouts are super crispy, salty, and adds a nice element to brighten the heaviness of the sauce. I'd recommend. 4/5<br><br>Nutella brownie - this was my favorite dish of the night. The brownie came out warm and gooey - pure perfection. It also came with hazelnut gelato and drizzles of caramel. It wasn't overly sweet which I really enjoyed. I'd order again and again. 5/5<br><br>Service is decent. The place is cute. It's located in a hotel, actually. So when you gotta tinkle, it's the hotel bathroom you go to. They give a 20% discount to NorthWestern employees.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CAKPe9eiNuHhV3dK1fBkoA/348s.jpg", "caption": "Nutella brownies and gelato"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/i-yjCdfgDh2kFdixQaR-qA/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/C7BqGfP3uWRYJLoEBL4O6A/168s.jpg", "caption": "Pork porterhouse"}]}}, {"review": {"des": "Attractive space. Great to sip on cocktails. Service was friendly and provided suggestions but a tad missing at some point. I enjoyed the calamari more than I thought. My friend's burger looked good but I didn't like my salmon dish very much. the fish was way overlooked to well done. no one asked how I wanted it but I assumed it wont be well done.  <br><br>I won't mind coming back just to grab cocktails. perhaps I just ordered the wrong dish.", "pics": null}}, {"review": {"des": "Went for breakfast. Mediocre. Nothing bad but also nothing notable. You can get this breakfast anywhere. Dishes lacked seasoning.", "pics": null}}, {"review": {"des": "Copper Fox was ok. It was a little busy and they seemed to struggle with space for one. I guess because of it being attached to the hotel. <br><br>I managed to get a seat at the bar and the service was very good. I had a couple of bourbons and some food. The food was where I took away points. <br><br>I ordered a spicy chicken sandwich which was very greasy and not very spicy. Hand cut fries that came out cold which was a shame because they really looked great. The coleslaw was excellent. <br><br>I am glad I tried the place but it's not gonna be high on my list for a repeat visit.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Fy7-fH3Q7cJxfEoMFiqghw/348s.jpg", "caption": "A bit stingy with those fries!"}]}}, {"review": {"des": "Wow! Nice IPA's on draft and nice selection of IPA cans.  Wanted to eat light and keep it simple so I went with the chicken sandwich.. usually a chicken sandwich not only boring but also bland .. not here.  Best chicken sandwich I ever had.  Chef came to table and explained the secret.  Won't tell , go there for yourself and try it. Trust!<br><br>Hint: a lot of seasoning and special toppings takes it over the top.. nice day sit outside.", "pics": null}}, {"review": {"des": "Thoroughly enjoyed everything we ordered here! The #16 biscuits with whipped butter were amazing. The crispy chicken sandwich was moist and made my husband rethink his love (and usual order) of hamburgers. The turkey avocado sandwich was the perfect mix of flavors. Portions were very generous - great value. Our server Kyle was very friendly and attentive. Highly recommend this restaurant!", "pics": null}}, {"review": {"des": "Amazing establishment with to-die-for bites. Food selection is broad enough to satisfy every possible food craving. <br><br>Their calamari fries though..OMG! If you don't try it you don't deserve to leave..unless you've got an allergy.<br><br>Highly recommend this spot!", "pics": null}}, {"review": {"des": "The food at this place was awesome and it looked great too. The mini deviled eggs were very good along with the appetizer mac & cheese. I got the skirt steak and it was cooked to perfection just the way I like it. Service was on par and the waitress was very attentive. This would make a great date night place!", "pics": null}}, {"review": {"des": "Yesterday I was in search of a quick & light lunch. I came across this cute gastropub inside the Courtyard Marriott. The seven layer salad & bloody mary was delish! #HighlyRecommend", "pics": null}}, {"review": {"des": "One of the best burgers downtown!  Also the fried chicken sandwich blows Chick Fil A into the 80s.  Opt for the house made chips versus the fries.  Fantastic rosemary flavor.<br><br>Very bright and family dinner style oriented for a downtown hotel burger bar, lots of large tables separated from the bar area.<br><br>Cocktails were great, even though the spot lacked the cocktail bar vibe.<br><br>Great spot for a work outing or mixed company.", "pics": null}}, {"review": {"des": "My husband and I came here for Happy Hour Monday night after work. We were looking at having a few drinks and appetizers. We ended up ordering Moscow Mules ($6) and the charcuterie board ($16). It was ok, nothing special.<br><br>The reason why I am giving a 2 star is that we came here for the Happy Hour which on their website says, <br><br>\"Join your fellow foxes and vixens Monday - Friday for great happy hour specials from 4:30pm-6:30pm\"<br><br>- $1 #16 Biscuits<br>- $6 Moscow Mules<br>- $6 Select Red and Whites Spotlight<br>- $5 Drafts<br><br>When I mentioned the Happy Hour $5 draft beers on their website the bartender says \"I have never heard or seen $5 draft beers since I've been working there\". So I said ok but still showed him the website for the Happy Hour on my phone. He shrugged it off and said that's for another Copper Fox Gastropub restaurant. I then pointed out that the picture on the Happy Hour page is the exact bar we were standing in. He said I'll talk to my manager. The manager comes by and says yeah we have the $5 draft on the register but we never use it. Which confused me because he basically just said yes we offer the $5 draft beers but we wont be giving it to you. <br><br>This is the first and last time we will be coming back. <br><br>Rule #1: Take care of the locals and they'll keep coming back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tSsX9aA6L6lJd4nMlClkVQ/348s.jpg", "caption": "115 E Ontario: Bar area Apparently this location doesn't have the same Happy hour as other locations. Locations which are not on the website"}]}}, {"review": {"des": "Cool place. Menu is a little small, but we had free yelp biscuits which were tasty. Foxburger was delicious. The prime steak sandwich was good but to me the steak should either be more tender or sliced thinner. Too much tugging. Place is a year or so old. So I am sure it will continue to improve.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XPBCHvTzZege6WbNLkSWfA/348s.jpg", "caption": "Interior is cool"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/radG0y3FlNJKs6AZAjaMpw/168s.jpg", "caption": "Foxburger"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZCjaXe21jkBxN-IG05uufQ/168s.jpg", "caption": "Steak sandwich"}]}}]}