{"name": "cozy-noodles-and-rice-chicago-3", "reviews": [{"review": {"des": "Wanted to go here for a while after seeing it pass by on the train every day. Went on a Wednesday night and service was quick and friendly. PS: CASH ONLY!<br>Anyways, there's so much energy in everything! Including the decor, the owner, and the menu. I like that the menu isn't super lengthy. They have the basics but still have decent variety. Cubs themed special menu was especially entertaining.<br>Ordered the vegetable rolls and the shrimp shumai. The \"rolls\" are actually one roll cut up so don't be surprised. Shrimp shumai are those little ones that probably come from frozen packages but I never met a shumai I didn't like. Either way, both had great sauces and super cheap.<br>Ordered the crispy pad thai because the description got me: \"All time classic.\" Honestly, I wouldn't order it again though. I'm glad I got it but my friends ordered the bacon pad thai, udon drunken noodles, and the bamee noodles and they were all way better.<br>Will be back to try their other dishes.<br>Also, I gave them $80 for a $64 bill and they didn't return change. Not upset about it, just awkward.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Fep2PZ9X4thAYYK5krqa8g/348s.jpg", "caption": "Wow this photo didn't turn out well, sorry. Anywho, bacon pad thai. Don't let the color fool you, plenty of diverse flavors and textures."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MYVYwMlzBvvsp0bxD-pqMA/168s.jpg", "caption": "Udon drunken noodle. Flavor was bea'udon'ful."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/19JNFMdefx-JIdLZsQ8p5A/168s.jpg", "caption": "Their \"all time classic.\" Interesting but not the most delicious."}]}}, {"review": {"des": "Food arrived after waiting 1.5 hours. Had to call several times. Items were cold. Anything that was suppose to be crispy, was soggy. Had to throw half of a dish away from it being too chewy (since it was cold). No napkins or utensils included. <br><br>Maybe it's better in person. However, I won't take any chances at this point.", "pics": null}}, {"review": {"des": "A friend and I came to this Cozy location for the first time at around 7:30 on a Sunday night. It's not very spacious and has 10ish tables, but it was easy to find an empty table. The place is full of fun Cubs paraphernalia and artwork, and it's a very homey, friendly environment. There's a nice outdoor seating area as well. <br><br>I ordered the Pad See Ew with chicken, and after a short wait, it came on a heart-shaped plate (cute!). It was very flavorful, perfectly seasoned, and a generous portion. The location is also very convenient. It was easy for my friend and me to stroll into a bar nearby for post-meal drinking because the place is surrounded by them.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iy3Gs7M1Tgy0S8H35lHOGA/348s.jpg", "caption": "Pad See Ew with chicken"}]}}, {"review": {"des": "This place has a very special place in my heart as it was one of my most frequented places back in my college years. The service is very friendly, and the place is quirky and fun. Prices are also very cheap comparing to a lot of other Thai places. However, the food is very mediocre. Their Pad Thai is too wet and sweet. The Pad See Eiw noodles are too thick, and a tad too salty. Their red curry is very bland. Their rice that came with the curry wasn't Jasmine rice, and if it was Jasmine rice, it must've been very poor quality. Their Thai iced tea was way too sweet. We had to send it back to get watered down. Also, it's cash only to dine in, so that's an inconvenience.", "pics": null}}, {"review": {"des": "Great food, it's BYOB, good to go before a Cubs game or a concert because it's a couple of blocks from Wrigley.<br>The decor is kitschy and fun, something you'd see in a Tokyo hole in the wall. Food is great but portions are not that big. The chicken was a little dry but good flavor.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TEmQ8PIu4-FfBt6nWtdvYA/168s.jpg", "caption": "very good noodle dish"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aNEweNJwN36YEXxnotzb3Q/168s.jpg", "caption": "some kind of spicy chicken, a little dry"}]}}, {"review": {"des": "Alison says this is the best Thai food in the city, and she really likes Thai. I've eaten here about a half dozen times now and the food in consistently good. They give large portions and the price is relatively fair (given said large portions). Be prepared to wait a while for your food though, whether dining in or ordering takeout. It always seems to take over 30 minutes. <br>Also, Cozy has some ridiculous cash only policy if you dine in. You can pay with a card if you pick your food up, but not if you dine in?", "pics": null}}, {"review": {"des": "I live just a few blocks from here so its one of our go to take out restaurants.  We've ate in once, but sat next to a row of bobble heads.  At first cool, but after a bit it starts to feel a little creepy. Still the staff was incredibly friendly and if it wasn't so easy to get it to go and walk the 3 blocks home, I'd get over the bobble heads. <br>That being said, I love Cozy Noodles green curry.  It so good I could just pick up the bowl and drink it straight (and since its normally take out at home... I might have done that once or twice).  I've never had issues with placing an order or having it ready in the time period expected.", "pics": null}}, {"review": {"des": "Very disappointed by the food. Tom yum soup was too sweet and had canned mushrooms! Cmon you are a restaurant, why are you using canned mushrooms that's disgusting. The beef and broccoli was in a tasty sauce but the beef was not tender at all, very hard to chew. Will not order from this place again.", "pics": null}}, {"review": {"des": "Not sure how this place got so high a review or stayed in business for so long. Went twice on separate occasions and all I can say the food is bland, bland, bland. Even for Midwest standard this is one of the most tasteless Thai food I have eaten. Sure owners are friendly. Food is almost inedible. Rice is not properly cooked. Come only if looking for \"Thai\" food but unable to handle anything that actually resembles actual Thai flavors.", "pics": null}}, {"review": {"des": "Consistently one of my favorite places to get Thai food in the city. Service is prompt and attentive, and the food is always delicious! I've never had a bad thing on the menu. Pro tip: the Pad Thai for two is served in a HUGE boat, and I'm pretty sure it's like 3 servings instead of 2. It's a steal!<br><br>Come for the funky decorations and vintage toys (we dined next to a giant Mario statue), pee in the pez bathroom, and stay for the delicious food. <br><br>CASH ONLY - however, there is an ATM in the restaurant. Here's the kicker - if you get cash out of there, get a receipt and hand it to your server. They'll deduct the ATM fee off your bill! Now THAT'S a way to run your restaurant that shows you love your customers. <br><br>As if all that weren't enough, there is also lots of artwork on the walls for sale, and part of the sale price is donated to Shriner's Hospital for Children in Chicago. Win win win!", "pics": null}}, {"review": {"des": "Their restaurant is so cute! They have a small outdoor patio. Its so close to my home so I always order and grab it to go, but I would love to dine in sometime! Their garlic noodles are so good and the pad thai is tasty too! The food is always super hot even after walking home.", "pics": null}}, {"review": {"des": "I came here for the first time with my supervisor, who is an avid supporter of this family business. I would have never expected Cozy Noodles and Rice to be a Thai restaurant especially just by all of the Chicago / Cubs decor for the interior. It's kind of a small place, but definitely cozy ;) and home-y! The service is really great. My water cup was never empty. In fact, I had to pee really badly on my commute home from how much they filled up my water cup!<br><br>I ordered the pad kee mao and it was amazing! Probably the best pad kee mao I've had in all of Chicago thus far. It came in a cute little heart-shaped dish too. There was a perfect amount of rice and just tasted so delicious. I also had a taste of the baby eggrolls, which were not bad as well! I tried their Thai iced tea too and it was a little on the sweeter side, but overall, pretty good~ <br><br>I would definitely come back! The location in Evanston is a little closer to me, but it seems like this location seems to serve better food~ I recommend this place for anyone who wants to have some good and reliable Thai food!", "pics": null}}, {"review": {"des": "I had the Chicken Pad Thai. I ordered based off of others good reviews but I was not as pleased as I hoped. The meal was flavorless and the color was so bright it was a turn off. There were very few pieces of chicken and they were died a super bright orange. <br>I'm giving three stars because I enjoyed the taste for the most part but wish the color was less artificial looking", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/52Hc7T99EyIcdn8h2LdW5g/348s.jpg", "caption": "This is the chicken pad Thai"}]}}, {"review": {"des": "This place is too much fun! Great food, great service, and a unique kitschy atmosphere. Somehow, this restaurant manages to look like an eccentric uncle's basement while maintaining a major cool factor.<br><br>We tried the crispy pad thai, baby egg rolls, and crab wontons and everything tasted great! My favorite thing was the crab wontons. They're slightly different in flavor than other crab wontons I've had and I really liked that -- almost a chives flavor.<br><br>From the bathroom wall lined with Pez dispensers to the bobble heads and Cubs paraphernalia, this place is a home run! It would be an excellent place to bring friends for something yummy and unique.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uRQqw6XO7MpatTitSr9clQ/348s.jpg", "caption": "Even the bathroom is unique -- all Pez dispensers!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/z2PioaK1roL51PNszfh0mw/168s.jpg", "caption": "The crab wontons with a fun umbrella"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AsenfbeUMvM4Asbb75a_cQ/168s.jpg", "caption": "Baby egg rolls in a mini takeout box"}]}}, {"review": {"des": "We live in the neighborhood and cozy Is a must. My boyfriend loves the crab Rangoon and the pad thai. I love the spicy cashew chicken. <br>Service is awesome, everyone is so friendly! The owner T always has a smile on his face and is a neighborhood icon. <br>We love cozy!", "pics": null}}, {"review": {"des": "Came here for lunch with a party of 4 because we wanted Thai food and it's BYOB. The decors here are lined wall to wall with Cubs gears, bobbleheads, and robots. Very busy in terms of decors. <br><br>We ordered our own entrees and shared an order of crab rangoon and the Sriracha spicy fries. The crab rangoon was meh..a bit too doughy for my liking. The fries were hot and fresh and decent. My order of the chicken pad woonsen was okay..nothing amazing. The rest of my party liked their food but again..nothing too special about this place. I would recommend going about 5 minutes down the street to Krung Thep for thai food.<br><br>Our bill came out to about $60 (before tip) and we tried to pay with a credit card but the waiter asked for cash. We guessed that it was cash only restaurant..which is fine but we did not see any signs. And when I checked out Yelp later..it did say that they do accept credit card. So I am a bit confused about this incident.<br><br>Overall, I probably won't come back just because I wasn't too impressed with the food. But if you're a big Cubs fan, you should definitely check this place out since it is near Wrigley Stadium and it's decked out in Cubs gears.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RdgahW1eaxi2CurVADc8wQ/168s.jpg", "caption": "Crab Rangoon"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_bt6te3uWDK8zJHihuKUGw/168s.jpg", "caption": "Pad woonsen"}]}}, {"review": {"des": "This is a great change of pace from the bar food around Wrigley.  Wonderful menu, friendly staff.  Very unique atmosphere.", "pics": null}}, {"review": {"des": "My favorite neighborhood restaurant! Whenever I have a curry or noodle craving I pop into Cozy's. The staff always makes me feel welcomed and the food is hot and fresh and hits you in the right spot. While you're sitting, check out all the amazing Cubs decor - their collection is out of this world. I love this unique spot and will be a customer for life.<br>Also- check out your jewel receipts if you go to the one on Broadway, they have buy one entree get one half off coupons on the back!", "pics": null}}, {"review": {"des": "Cute restaurant! It's a little tiny, so larger groups would be difficult. The service was great and the food was excellent. Wasn't pricy.", "pics": null}}, {"review": {"des": "Food is always fantastic! I almost always get crab rangoons (they are large and delicious). Pad Thai, pad see ewe, garlic noodles and fried rice all some of my favorites. Great atmosphere if you dine in!", "pics": null}}, {"review": {"des": "Overall, this a great Asian cuisine! I live in Wrigleyville so I eat here quite often. I have never had a problem with service. My go to's are the Pad Thai Noodles, Pad Khee Mao, and any of their curries. All are very flavorful and very filling. Their Crag Rangoon is some of the best I have ever had and their vegetable rolls have an interesting flavor. I also enjoy their smoothies as well. <br><br>The only reason that this is a 4 and not a 5 is because this place is cash only. There have been numerous times that I have not come here due to that sole reason. This place is always packed so I'm sure the cash only thing isn't too big of a deal for them and helps them save money. Overall, the price is right and I highly recommend this place as it's the best Asian food in Wrigleyville.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0pxcMbkTKYt0k0tf3HuzLw/348s.jpg", "caption": "Pad Thai Noodles and Vegetable Rolls. Delicious!"}]}}, {"review": {"des": "The best Crab Rangoon in the world. This place is amazing. Terrence Crawford is also the best pound for pound fighter in boxing.", "pics": null}}, {"review": {"des": "Delivery was fast. The food was fine. Standard Thai takeout.<br><br>The big problem with it was that they didn't include any kind of eating utensils with a delivery order of noodles. We ordered delivery to a public area and had to run around looking for somewhere with plastic silverware. We eventually found them and were able to eat, but this was really inconvenient.", "pics": null}}, {"review": {"des": "I really enjoyed Cozy Noodles. It is very cozy inside just like their name states. I ordered their Pad Kee Mao (Drunken Noodles) with beef. My usual, and it was very delicious. Plenty of heat, noodles and meat and not heavy on the veggies, makes for a perfect drunken noodle dish. <br><br>I usually rate based on if their customer service was great or needs improvement. Cody noodles goes beyond customer service. They treat you like a guest visiting their home. You can tell right off the bat when you walk in, that they are so welcoming with big smiles on their faces. You really can't beat that. <br><br>The only thing I would like to add is that Yelp has them as they accept credit cards and I was not prepared to pay cash. <br><br>Overall I would with out a doubt return to Cozy Noodles.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RMXoF7HzA8nD71DlWZrn3g/348s.jpg", "caption": "World Series trophy replica"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FBqTZaMPnhZAOflKx--_Kw/168s.jpg", "caption": "Bobblehead collection"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6Vtds_Pdhe-jgPvorhH4jg/168s.jpg", "caption": "Drunken noodles"}]}}, {"review": {"des": "Great food and very friendly staff. I especially like their homemade noodles, Pad Thai and Pineapple Fried Rice.", "pics": null}}, {"review": {"des": "First of all, this place is CASH ONLY; which is partly the reason for my 4 star rating (just kind of annoying considering it is a popular place and considering the area there are not a lot of banks nearby). There is an ATM inside the restaurant but beware, with Chase bank I got charged 2 fees-- one $3 and another for $2.50.<br>Despite this, this place is SOOO GOOD. Considering I am Chinese and like to think I know the best authentic Asian restaurants in the city, I was apprehensive coming here for the first timeas I really haven't heard much about it--but HOLY COW I was impressed!! I had the Cozy Rice Soup which is actually a pretty decent size soup but is considered a side soup and only $4.50--great deal. It has a lot of variety of veggies in there and you get your choice of meat or no meat. I had chicken (recommendation by the waitress) and I was very happy with my decision. Seems strange to give a review about just a side soup but it was so good. <br>My fiance had the Chicken Chow Chey and are you ready for this...this was hands down the BEST I have had in the city, including in Chinatown. Definitely need to try this out! The service is quick and friendly. The atmosphere is also super fun and filled with all kinds of 80s and 90s/ Chicago sports memorabilia to look at and talk about during a meal. Great place to bring kids, for a 1st date or just a casual meal with anyone! Great place and happy that after passing by it a 100 times that I finally stepped in!", "pics": null}}, {"review": {"des": "Cozy is literally my go-to option for healthy, nutritious and delightfully tasty food whenever I'm unable to cook or too busy. If you haven't tried it out yet, trust me you will never want to leave it once you have. Love this place!", "pics": null}}, {"review": {"des": "This is my second time coming here and I really think that it could be a lot better.  I've gone to other noodle restaurants that I've enjoyed more and am disappointed in the food here.  This time, I got garlic chicken noodles and the flavor wasn't great.  I didn't end up taking leftovers because the dish was so bland.", "pics": null}}, {"review": {"des": "This place is really cool to go to. The walls are decorated with all sorts of things including a lot of Cubs paraphernalia. The food however is okay. I expected more kick and flavor in the curry. The crab rangoons were good but not amazing. All in all marginal food but worth a visit. It's definitely cozy!", "pics": null}}, {"review": {"des": "Pretty good! I've been here a couple times now and have tried the pad Thai, golden noodles, and fried rice. I would get the golden noodles or fried rice again for sure. The pad Thai is good too, but a little too orange looking for comfort. The ambience is unlike any other with the Cubs paraphernalia and pez dispensers. And they get extra points for playing awesome music (gin blossoms, R.E.M., all the good old school stuff). I don't know where this place came from but I like it!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OIBhbDYm2v8snhcjqLfyzw/168s.jpg", "caption": "Pad Thai w/ shrimp"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/N_bga1HCLphJ9iu8Af7Zvw/168s.jpg", "caption": "chicken fried rice"}]}}, {"review": {"des": "I have to start with the decor.  It is absolutely one of the most uniquely decorated Thai restaurants that I have every been too.  There are toys everywhere and piece of American nostalgia, including action figures in the bathroom.  Ok, with the decor and ambiance being described, I would like to expand upon the location, service and food.  Location is great.  Before or after eating, there are hundreds of places to go to within several blocks in any direction.  The food is pretty good.  Pad Thai is really good.  Massaman curry with rice is awesome.  It is a family run place and the owners are really engaged and are very cordial.  They wish to make sure that you are well taken care of.", "pics": null}}, {"review": {"des": "Love this place! Best Thai food in Lakeview! The owners are such wonderful people! They treat all of their customers like family.<br>The food is excellent-my favorites are the Pad Woodsen and the Kung-Pao Chicken.<br>Cash only if you dine in, but the prices are very reasonable.", "pics": null}}, {"review": {"des": "I ordered the wrong food - was craving Pad Thai and there were 3 different Pad Thai dishes on the menu.  I chose what appeals to me the most - Crispy Pad Thai, thinking its regular Pad Thai w/ a twist of deep fried somehow.  It turns out that they replaced the noodle w/ deep fried wonton wrap completely!!  So basically I ended up with a whole plate of deep fried wonton wrap...it was Extremely difficult to eat, taste good though.  It was my own fault not understanding the menu but do Stay Away from Crispy Pad Thai, just have the regular one.<br><br>My friend ordered Garlic Chicken Noodles, IMO it's slightly sweeter than I like, she gave it 3.5 stars.<br><br>The dining area is definitely interesting with a good collection of retro toys and stuff.  I had fun taking some insta-worthy pictures.", "pics": null}}, {"review": {"des": "I've loved this place for a long time. While I usually get delivery or take out, somehow the kitschy decor makes everything taste better.<br><br>I rotate between the pad thai, pad wen soo, crispy noodle dishes, and peanut chicken. I LOVE their crab rangoon. I'm not sure what it is about it, but I'm also super into their fried tofu. <br><br>Plus, the staff is friendly and service is quick!", "pics": null}}, {"review": {"des": "Omg. This is the freshest Chinese food I've found. Delivery is quick. I chose to order delivery when I have guest over and this has been a real hit. A bottle of white and Tim yum soup for starters.<br>The delivery has a fee, after fee and tip for delivery person. They chose to sit in car and expect me to go outside to get food.  I will not order delivery any more.  Unfortunately because I like the food but not the del", "pics": null}}, {"review": {"des": "Unexpected wonderfulness.  Cool nook with personality by the ball park.  Delicious salad with awesome dressing (lime spicy something).  Perfect win ton soup.", "pics": null}}, {"review": {"des": "I live next door to this joint and always see it packed after cubs games and during the weekends (it isn't very big to begin with but still busy), so I finally decided to give it a try. I had the crispy pad Thai (delicious!!) and the crab Rangoon's (good but not the best). I'm giving this place four stars bc although I wasn't disappointed with the taste, I was a bit disappointed at the price. We also had smoothies that were TINY and cost us $5 a pop.... I expect $5 smoothies to be pretty big and having an abundance of tapioca at the bottom. Regardless I will probably order the pad Thai again, I can't find that anywhere else.", "pics": null}}, {"review": {"des": "I loved the pad see ew here! The restaurant is very fun inside and is filled with Chicago themed things. The food was great. I have a nut allergy and they were very helpful with finding something I could eat", "pics": null}}, {"review": {"des": "Best Pad Thai and Crab Rangoons I've had in Chicago !<br><br>However, they never provide utensils or chopsticks with takeout. So recommend asking when you place your order!", "pics": null}}, {"review": {"des": "We love Cozy's. It's great for everything: birthdays, dates, pre-show meals, lunches. My favorites are their crab rangoons, pad thai, and pad see yew. The prices are super affordable, it's in a great location right next to Wrigley Field, and the interior design is as memorable as what's on your plate. Make sure to check out the bathrooms.", "pics": null}}, {"review": {"des": "A lack luster pad thai chicken--tasted like plastic and like it had been sitting for a long time or not made to order. Additionally, the thai curry was not spicy, even when requested as spicy and lacked a true and consistent flavor. I would not recommend delivery from this place.", "pics": null}}, {"review": {"des": "Gotta say- based on what I ordered; orange chicken and fried rice--- I'm shocked this place is four stars. Orange chicken was really hard and the sauce did not taste \"orange\" chicken-like... the fried rice was off too. The mini egg rolls could have been better too. Unfortunately, I will not be ordering from here again.", "pics": null}}, {"review": {"des": "I was looking forward to trying this place out. Thai food is definitely my top 3 favorite types of food and to have a good place by my apartment would have been damaging to my wallet. Lucky for me, this place did not impress at all.<br><br>I ordered a thai iced tea and the fried pad khee mao and man was I disappointed with both. After receiving my thai iced tea, that set off the night for disappointment. It was definitely not authentic and left a weird aftertaste that I didn't care for at all. For the fried pad khee mao, I wish I had gotten it regular instead of fried.. it's definitely not something pleasant to eat as it was chewy and really salty. I'm the type of person who to-gos everything after a meal but this time, it wasn't even worth it. I'd warn people to stay away from the fried noodles they're so famously known for.<br><br>Side notes:<br>Double check your jewel osco receipt for BOGO 1/2 off an entree<br>Cash ONLY<br>They have a small parking lot off to the side.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fayQJSCa04vhP5MS6SVWLQ/348s.jpg", "caption": "Cashew chicken with out the chicken and extra veggies"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/X_POXamm52bLhcSV8MUTLA/168s.jpg", "caption": "Red curry with tofu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1t5AM8jJ4sNdI2bQYOWKQg/168s.jpg", "caption": "Crispy something.."}]}}, {"review": {"des": "Panang curry chicken should have been coalles veggie panang  and the sauce of the panang was so watery and had no flavor at all. it's crazy was my first time ordering food thru yelp and also at this place never again was it of my money should have ordered else where", "pics": null}}, {"review": {"des": "Really great Thai place in Wrigleyville and you can often find a Groupon there as an added perk. Cash only, but just bring some along. Really authentic and kind staff. We had gotten back from a Thailand trip and were missing the food, and the waiter chatted with us for a while about his time living in Thailand which was really fun. We got the Crispy Pad Thai with chicken, Regular pad Thai, and Tom Kar soup. Absolutely loved all the dishes, and the soup and Crispy pad Thai were particularly unique. Would recommend this place and it's a funky little vibe which changes it up as welL", "pics": null}}, {"review": {"des": "This place was great! It was close to where my boyfriend and I stayed and also close to the theater we were headed to later in the evening for an improv show.<br><br>Due to the size, we were pretty sure we'd have to wait out in the cold for a table to open up at 7 pm on a Saturday but we only had to wait a few minutes before being seated. My boyfriend ordered the battered and fried chicken wings and the one I tasted was delicious. Like southern-style fried chicken. He loved the sweet and spicy sauce that came with them as well. <br><br>I got the pad khee mao with tofu (~$10) which was spicy and delicious. I asked for slightly less spicy than normal and it was still pretty spicy although definitely not too much so. I loved the thick, wide noodles and the proportion of noodles to tofu to veggies was great. I actually could have gone for a bit more veggies but nothing to really complain about. <br><br>The only issue I had with this place is that we were literally rubbing elbows with the couple at the next table and found it uncomfortably difficult not to listen in on their conversation. Let's just say it was way too intimate for my tastes. Considering the size of the restaurant and that it was probably the busiest time of the week, close quarters are to be expected.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aMSnbZoVmNONFE7-nJvjaQ/348s.jpg", "caption": "Pad khee mao... spicy deliciousness!"}]}}, {"review": {"des": "Well, this was a lucky find. We left a Cubs game (WIN!) and the line for the L-Train was ridonculous, so we headed south a bit to find some food with the family. Prices were great and everyone loved it. My wife and I had Red Curry and Pad Thai, both delicious. The kids meals were perhaps the most impressive, with chicken and noodles and fried riced options, both with spring rolls and broccoli that they loved. Highly recommend Cozy!", "pics": null}}, {"review": {"des": "Pleasantly surprised that the bubble tea was slushie style! The ice wasn't crushed perfectly though. The tapioca balls seem a bit larger than I've had elsewhere and were nicely chewy. The Thai iced tea bubble tea was flavorful. Price was reasonable. Overall, I enjoyed their take on boba.", "pics": null}}, {"review": {"des": "My husband and I have gone here 3 times and each time has been consistent. I accidently found this gem on Yelp when I was searching for Lad na, crispy on NYE in 2013. Located right near Wrigley Field, it definitely shows its appreciation for the Cubs. It is so cute inside! It's a small restaurant and had little & big collectibles throughout, even in the bathroom! From Elvis to Mario. <br><br>I love their cozy chicken, it comes out in a little basket, so fresh and the breading is perfect. It also comes with a small dipping of sweet & sour sauce. Their crab ragoon is pretty filling, unlike others I have tried that barely had any filling.<br><br>My husband always gets their lad na. He tells me no one can ever come close to his mom's lad na and Cozy Noodles comes pretty close, that's impressive! The only con he didn't like about it, but didn't mind, was that it comes with regular broccoli instead of Chinese broccoli. <br><br>I've tried their pad thai with crispy noodles, this was a first and I was very happy I chose it. I'm used to it eating it with the regular thinner soft noodles. I have also tried their spicy curry panang noodles. It's like a curry broth over the crispy noodles. The broth is super creamy with the right amount of sweetness, saltiness, and spiciness. I love spicy, so I opted for it to be spicier. I was hoping to try their mango over rice dessert on our recent trip, but the server said it's a seasonal thing, so it wasn't available.<br><br>Anywho, the owners and workers are very nice. They're Thai and I can tell they have regulars come in pretty often. The husband and wife are personable and their service is impeccable. Though I have been here 3 times already, the reason for my review was how the staff made it so memorable for us this past weekend. It was a hectic night due to the Cubs playing and winning that evening to make it to the world series. <br><br>The owner Mr. T? had a whole Cubs suit on that you couldn't miss from a mile away! It was a perfect outfit to wear that evening, he was definitely looking like a celebrity as everyone wanted a photo opt with him. <br><br>It's BYOB, so we had a couple beers with us and enjoyed watching the game. I mean, it was just the environment they set and everytime a great play came on, Mr. T hyped up the crowd. We even sang, \"Take me out to the ballgame!\"<br><br>This place is definitely on our list to come back cuz it has never dissapointed us.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WVlviDPpaNaajSQ-zufovA/168s.jpg", "caption": "Curry panang noodles."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/forroTwq7gh1XmKbYpSayg/168s.jpg", "caption": "Cozy chicken."}]}}, {"review": {"des": "That's an amazing place, the chow mein is delicious, well presented and all the waitress are very nice and are always check in around so the tables never run out of water or another order.<br>The only bad part is that cards are not accepted, there's an ATM machine inside and they deduct the $3 fee in the check so don't worry.", "pics": null}}, {"review": {"des": "My absolute favorite place to get food in Wrigleyville. While the restaurant itself is cash only (which is a tad annoying), I usually get delivery and the food is always perfect and quick. <br><br>Highly, highly recommend the Crispy Pad Thai Special. Incredible!", "pics": null}}, {"review": {"des": "Wonderful food, friendly service. Vegetarian and kid friendly.  Highly recommend!<br><br>Wonderful food, friendly service. Vegetarian and kid friendly.  Highly recommend!", "pics": null}}, {"review": {"des": "Awesome decor inside! Very vintage, the food is awesome and the service is just amazing. Never had to flag someone down for water refills, she was always prompt. Haven't seen any other Thai place that has crispy lad nar, so definitely will be coming back for it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hhlgcniU7O70Z-vNHPWBtA/348s.jpg", "caption": "Crispy lad nar and chicken pad Thai"}]}}, {"review": {"des": "Never tried Thai food until I went to this place. I'm a huge Chinese food fan and was told it was somewhat similar and for the most part that is correct.<br><br>I was a little overwhelmed with the amount of items on the menu, but decided to play it super safe and get the chicken fried rice. I think it was pretty average; it wasn't really good or nasty but I definitely ate most of it. I also got it spicy which I was told to try. I would suggest that if you're not a big Thai fan or scared to venture. <br><br>This is BYOB joint which is a plus. I really like the small and homey vibes this place gives off as well.", "pics": null}}, {"review": {"des": "The decor is very interesting throughout the restaurant but food was pretty bad.<br><br>Tom yum soup was very watery. Things were condensing at the bottom. <br><br>Pad see ew had an indescribably off flavor.<br><br>Pad thai was lacking flavor and the noodles were such a synthetic-looking orange! I'm sure all pad thai has food coloring, but this one looked so synthetic. <br><br>Definitely would NOT consider this authentic thai.<br><br>Good customer service though.<br><br>If you're craving Asian food/noodles I'd suggest getting pho somewhere instead.", "pics": null}}, {"review": {"des": "About 6 months ago, we arrived in Chicago and were in Wrigleyville visiting my brother. We opened up yelp and this was a top rated place. <br><br>We were not disappointed. We arrived for lunch just as they were opening. We basically had the place to ourselves and ordered the lunch specials. We had the Pad Woonsen and Mixed Vegetables. I still think about those clear noodles. They were so good.<br><br>The owner greeted us and showed us around the restaurant. We told him we were visiting from Orlando, and he was very eager to show us the Disney/Mickey room. He was very passionate about his restaurant and was taking pictures of my boyfriend and I. He even went outside the restaurant to take a picture of us through the windows! He was very nice and energetic. Once the food came, he was still talking to us and while I enjoyed talking with him, this foodie was hungry and wanted to eat her noodles! <br><br>I enjoyed the vintage toy theme of the restaurant. This restaurant was definitely memorable and an experience my boyfriend and I still talk about.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QzkIWgK19KfFiZmzIT1TTw/168s.jpg", "caption": "Pad Woonsen and Mixed Vegetable lunch special. What a great value."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WXaJhn3sM5dYqdj4s1unZQ/168s.jpg", "caption": "The owner took the camera and was taking random pictures of us. So much fun!"}]}}, {"review": {"des": "Major problems. Unfortunately Bread N' Rice was closed on Sunday and we had to make do with what was nearby. Big mistake.<br><br>1) The chicken satay had nearly no seasoning, but thankfully had the small portion of peanut sauce to save it.<br>2) The meat in the Mongolian beef was extremely tough and made the entire dish disappointing. Decent sauce, but it doesn't cover up the poor quality.<br>3) The waitstaff did not inquire at all on how the meal was, and when we were about to pay with credit card they would not accept it and asked only for cash. They indicated that they had an ATM on site.<br>4) They did not give back any change until we had to ask for it. <br><br>Skip this one and just go about anywhere else.", "pics": null}}, {"review": {"des": "The ambiance was fun! Check out the bathroom!!<br>BYOB, and I got the crispy pad Thai. HELLO! So awesome and different than what I've ever eaten. My jaw got a little tired from so much crunching but so good!!<br>Really kind servers, I can't wait to go back.", "pics": null}}, {"review": {"des": "Writing this review after about 10 visits/takeouts - very yummy pad Thai! Their homemade sesame sauce is amazing, comes with good pot stickers. Very friendly & hardworking staff. Thai tea & coffees taste just like the ones in Thailand. Plus they love the cubbies and have funny signs & knickknacks inside.", "pics": null}}, {"review": {"des": "Ordered take out and the delivery took under 25 minutes ... on a Friday night... awesome! I ordered Pad See Ew with beef and vegetables and it was excellent. The noodles were cooked to perfection and had fun variety of veggies. I've heard great things about Cozy Noodles and absolutely have to agree. A must try!", "pics": null}}, {"review": {"des": "Me and the boyfriend came here for something to eat after a cubs win ! Little did we know people coming from the cubs game get 15% off their bill. We ordered the chicken pad see eiw and the beef pad woonsen. Pad See Eiw is my favorite thai dish and they made it just right ! It was delish. The padwoon sen's beef was dry and there were too many vegetables in it for my taste, but my boyfriend loved it. I did like the noodles though. I usually like to get the pad thai and a thai restaurant, but this one was too red/orange and that is not a sign of good pad thai (in my personal opinion). Overall I would like to come back and try a bunch of other meals dishes. The service was great and the staff is very very attentive to each and every customer. I recommend !", "pics": null}}, {"review": {"des": "Awesome place! Food, service and atmosphere. Had the Hendricks special and it was amazing. I talked about it all night and the next day. I am hooked on Cozy.", "pics": null}}, {"review": {"des": "What a neat place! Stopped in for dinner with a friend who lives in the neighborhood and I was blown away! This cute little place has a lot to offer for being a small local business. The menu is really quite large and there is so much to choose from. Between the two of us we got the crab rangoon, Mongolian beef, and spicy cashew chicken. All were spectacular especially the crab rangoon - flavorful, crispy, and the sauce is spectacular. Cozy is BYOB and cash only which is important to know before you go! The owner and staff are some of the friendliest people and they really make you feel at home in the big city! Will absolutely be coming back.", "pics": null}}, {"review": {"des": "Good quick food that can be healthy at a great price!  The portion sizes are average.", "pics": null}}, {"review": {"des": "I love this place.  I take all my friends whenever possible.  Its an easy walk from the Red Line.  <br><br>My go to order there is pad khee mao with crispy noodles and a green tea bubble tea.", "pics": null}}, {"review": {"des": "These noodle have saved my life! Literally every taste like it could make you sober. I highly recommend.", "pics": null}}, {"review": {"des": "I ordered from Grub hub and placed a big order. I paid over $70.00 in food. The food was very bland. I asked for extra spicy on all the entrees and an extra hot chilli paste. I didn't receive neither. I asked for extra egg in my pad Thai. They adjusted my bill but there was no extra egg. Actually, I don't think there was any egg. I will never order or recommend this place again!! I wish I could give them zero stars!", "pics": null}}, {"review": {"des": "Cozy is not your typical restaurant. They do things a little differently. The crispy pad Thai is very unique and  they have excellent soups as well. I tend to order delivery more than going to the restaurant, mostly due to them being cash only at the restaurant.", "pics": null}}, {"review": {"des": "I get carry out from this place at least twice a week. Amazing Thai food, incredible customer service, and such a charming unique atmosphere. I strongly recommend the crab rangoon-- it's the best I've ever had! Great vegetarian options as well", "pics": null}}, {"review": {"des": "Love this place. Best Crab Ragoon and great fried rice.", "pics": null}}, {"review": {"des": "Love this place. Fast and delicious Thai food that never disappoints. Very clean and fun place. Perfect for kids. Prices are very reasonable and very good menu. If you're in the area and are craving some good Thai food, this is the place.", "pics": null}}, {"review": {"des": "Great location near Wrigley with limited parking. There are 5 sidewalk tables shaded in the afternoon. Many vegan options made with fresh ingredients and generous size Tai tea. The staff is friendly and an eclectic collection of memorabilia. I would definitely recommend and will return to try the pad Thai. Cash only.", "pics": null}}, {"review": {"des": "In a word, \"meh\". Much to my dismay, I recently moved out of the delivery radius for my absolute favorite delivery spot, so I decided to give Cozy an audition tonight. My order arrived faster than quoted, always a plus. I was nervous to try the more authentic dishes at a new spot, so I played it safe with a popular dish- orange chicken (mild spice), and pineapple fried rice with chicken. <br><br>The pineapple rice was...fine. There was a smattering of pepper thrown on top, as if the cook realized they forgot to season it right before throwing the lid on. Overall, it was pretty bland, and most of the cashews were burned to a crisp. On the upside, there was a generous portion of white meat chicken in the dish.. no mystery shapes that have you guessing which part of the chicken it came from.<br><br>My first bite of the orange chicken, however, was the opposite experience. Completely inedible fat and bone, along with that \"mystery meat\" look about it (shudders). On top of that, I ordered mild spice to balance out the sweetness, and it arrived with some sort of watery orange marmalade sauce that not even a few drops of sriracha could salvage. <br><br>Moral of the story: You don't have to try hard if your restaurant has Wrigleyville foot traffic on your side.", "pics": null}}, {"review": {"des": "My go to neighborhood Thai place.  The crab Rangoon is some of the best I've ever had.  The pad khee mao is my favorite!  Exceptional service, super cute vibe inside, quick, and it's BYOB.  This place is great.", "pics": null}}, {"review": {"des": "We were searching for a place to eat outside of Wrigley and we stumbled upon Cozy. We saw just how many people were in the restaurant and thought that was a very good sign. We were not disappointed! My wife had the Crispy Pad Thai which was a nice twist. When the noodles are deep fried they have this crunchy texture that gives the dish a nice contrast. I had the Pad Kee Mao which was our server's choice. It was a bit spicy but delicious! <br><br>It reminded me of the out of way places in Khaosan Road in Bangkok where we would sit, watch the crowds, and enjoy Thai food. Can't wait to go back before a Cubs game!", "pics": null}}, {"review": {"des": "Nice casual restaurant that I went to for the first time today, came across it via GroupOn.  Had the Cozy Salmon, steamed salmon with stir-fried vegetables, and both salmon and veggies were really good", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uOCOfyKswPMDkP5eYvxHGg/348s.jpg", "caption": "Nice casual restaurant, came across it via GroupOn.  Had the Cozy Salmon and both salmon and veggies were really good"}]}}, {"review": {"des": "I'm an LA Dodgers fan visiting Chicago and just finished watching the cubs beat the Blue Jays in extras with a walk off! Very cool! We ended up here walking around with the kids after the great game. This place is great. Service is very friendly. The layout of the place and all the cool toys makes it original and fun to be in. Food was great. <br>Warning: cash only.", "pics": null}}, {"review": {"des": "Love. This. Place. It's cheap, cute and the food is delicious. Try the pad sew ew, Tom Kar soup and Panang curry. Delivery is fast too!", "pics": null}}, {"review": {"des": "I never write negative review but i literally felt robbed after my last order. The first time i ate here i did dine in. their $1.99 lunch special was a delicious chicken soup good portion, i also ordered their pad thai. Super delicious. Last week I had a craving for chicken fried rice so i ordered from them for pick up. The portion was ridiculously small and i'm not joking 4 pieces of chicken! 4! i paid $11 for ...just for this! I will not be going back.", "pics": null}}, {"review": {"des": "One of my all time favorite Thai food spots in the city. This place has a cool wacky vibe to them as their decor is very unique. The food is always great and portions are generous. It's a BYOB spot so feel free to bring a drink or 2 to have with friends. I've been coming here for about 8 years and it hasn't lost its charm during that time at all", "pics": null}}, {"review": {"des": "When my friend and I walked in, the waitress looked at us and asked how many then proceeded by telling us we could sit anywhere we'd like. She didn't follow us and did not come with menus until a couple minutes later. After giving us about 2 minutes to look at the menu she asked if we were ready. We asked her to give us a couple minutes...but after 20 seconds, another waitress came and asked us the same thing. I bring this up because I wish it was more organized. <br><br>I ordered the crispy pad thai and my friend ordered the basil leaves dish. My friend enjoyed her dish a lot. I, on the other hand, had a tough time enjoying mine. The noodles aren't really noodles, they're more like soggy over fried tortilla chips lathered in sauce. The chicken wasn't bad. <br><br>On top of this, during our meal there was a child who played with this footrest thing under the table (which I still don't understand the meaning of because it moves back and forth) and it kept making a screechy noise and it went on for a good 5 minutes before any of the employees said anything to the child. <br><br>Heads up: This is a cash only joint!<br><br>I probably won't come back unless there's no other place to eat.", "pics": null}}, {"review": {"des": "Just a block south of Wrigley Field on Sheffield Ave sits this little unassuming store front with crazY giant menu item billboard on the side.<br><br>Inside the walls are lined with cubs bobble heads, old toys, past product advertisements, and all sorts of odds and ends, trinkets and nic-naks!<br><br>But most importantly is what comes out of the little unassuming store fronts kitchen...<br>Glass noodle & vegetables, egg noodles & curries, tofu & chicken to name just a little, all mixed up with a whole lotta love and thai spices....<br><br>Food orgasm....aaahhhhhhh", "pics": null}}, {"review": {"des": "I loooooove this place!! Easily my most favorite Thai restaurant to order in from or dine at. Love the absolutely insane decor on the inside - hysterical and amazing!! Will continue to order from here as well as dine in forever, or until I can't anymore for some reason. I love Cozy! :)", "pics": null}}, {"review": {"des": "The owner and service are really nice. I love the cubs collection and i donated a bobble head and rally towel to them for display and the owner was very thankful. The food was really good and i really enjoyed my experience here.  I hope to celebrate a cubs world series championship with the Cozys staff very soon", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Viv-2POrbivXqujlgLZucg/348s.jpg", "caption": "Orange chicken"}]}}, {"review": {"des": "This place had delicious food! It was local and in a good location that was walkable from our apt. The service was great. The decor was busy but fun. Even my kids loved their kiddie options! So happy we found this gem!", "pics": null}}, {"review": {"des": "Meh. Cozy is kitschy cute, and I can see it being a good option if you're in Wrigleyville and in a crunch and/or have a coupon on top of the already pretty inexpensive prices, but I wouldn't go out of my way to come here.<br><br>Some random tidbits:<br><br>CASH ONLY -- This is annoying. There is an atm inside the restaurant and a PNC atm right outside, but if you bank elsewhere and try to avoid atm fees, it's inconvenient.<br><br>THE SPACE -- Like I said, cute/kitschy. Walls are lined with baseball bobbleheads and other curios. The restaurant is tiny and can get crowded; you might be able to hear other tables' conversations better than your own.<br><br>WAIT TIME -- On a Saturday night around 7:30, about fifteen minutes for a table of five.<br><br>FOOD -- It's all edible, but not great. I liked the crab rangoon and Thai iced tea. The edamame was flavorless, not even lightly salted. Skip it and get a frozen bag at Jewel to microwave. Trust me, it'll taste better. The pad thai was mediocre and so, so, so orange, almost as orange as my Thai iced tea. I got chicken and tofu, and there ended up being a ton of kinda-tough-to-chew tofu and about three tiny pieces of chicken. Whatever, I still ate it all. A friend's crispy pad see ew noodles were way overly crispy, veering into might-slice-your-mouth territory.<br><br>I mean, by the time I'd finished my food and was satisfactorily full, I'd gotten over my annoyance at the cash-only situation and bewilderment at the color of my pad thai. But still, probably won't ever come back.", "pics": null}}, {"review": {"des": "Delicious Thai food right near the stadium. We went before a game and the service was super fast and the food tasted great. We ordered the chicken curry, vegetable rolls, orange chicken and cucumber salad. Great stop to try if you're near the stadium and are looking for Thai food.", "pics": null}}, {"review": {"des": "After a cubs game, we were looking for some grub. Something that was not ballpark, or bar food. I came across this place on yelp, its about 2 blocks from Wrigley Field and 800+ reviews, it was a done deal. Pretty small place but it has alot of charm. Its CASH ONLY. The Crab Ragoon was amazing, skip the wings. The crispy Pad thai is hit or miss. I thought it was a textural masterpiece, but my buddy was not feeling it. My favorite was the Panang Curry noodles with chicken, its savory, spicy, and got some crispy noodles in there. With your ticket, you will get %15 off. Although I think next time I will go before a game not after. Because it is BYOB, its a nice lowkey spot to have a few brews  and grub, for a cheap tasty pregame!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rpbe0NBXQgiAVzpzFxZjBQ/348s.jpg", "caption": "Panang  curry noodles was delicious!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1g651kfuF6y68OMvWTlYmg/168s.jpg", "caption": "Crispy noodle pad thai"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PN2qMBcaS0Q_pB-5KkZZmw/168s.jpg", "caption": "Wings were okay...."}]}}, {"review": {"des": "Ordered:<br><br>Spring rolls: not very fresh ingredients <br><br>Crispy pad see ewe: very salty<br><br>Very disappointed, as I used to love this place. 0 stars for food I ate; 2 stars for good service-- they offered to omit spring roll for our dissatisfaction. Didn't have the heart to slam the pad see ewe as well, waiter looked like he was about to cry (exaggeration, but you get the point).", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iIXbPIZ91pXL8nFTHiaOHQ/348s.jpg", "caption": "Crispy pad see ewe"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Fzit4GAEpOnkXo2hvn_sSQ/168s.jpg", "caption": "Pad khee mao"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FiLayKEY8ekQSKbXUik-eg/168s.jpg", "caption": "Spring rolls"}]}}, {"review": {"des": "Customer service was very good, they were polite on the phone and the delivery man was nice. The seaweed salad was very good, but the pad thai was dry and without much flavor. The crazy noodles were better, but kind of average.", "pics": null}}, {"review": {"des": "Good service and food!BYOB and reasonable price!i will come back when I am in Chicago!cute decor!", "pics": null}}, {"review": {"des": "Disappointing. I ordered delivery. The Pad Thai was really dry and bland. Had to put Tabasco all over it to give it flavor. Note to self: never order this again. <br><br>The Steamed Shumai was pretty good, but not a huge fan of the sauce. A bit too sweet. The only redeeming item was the Tom Yum soup, although I've had better. It's pretty bad when the sides outshine the main dish.", "pics": null}}, {"review": {"des": "The best pad-se-ewe I've had in Chicago. We ordered from here a ton when we lived in Wrigleyville. They also have quick delivery. I have never actually eaten inside, but their food and delivery times have always been up to par. <br><br>Like I said, we ordered from here A LOT, and we hardly ever order from the same place twice.", "pics": null}}, {"review": {"des": "Delivery took over a hour. Pad Thai had no sauce. Tasted like nothing. I picked the not spicy option that doesn't mean no sauce. Veggie egg rolls and fried rice was very average. The portions are big.", "pics": null}}, {"review": {"des": "If you eat here, do dine in only. I ordered grub hub delivery Christmas night and our order was almost inedible. My chicken pad Thai was so dry I could barely eat it. I asked for it spicy and they must of added it right into the dinner itself because my noodles looked orange and tasted even worse. The potstickers didn't taste any better, like they were microwaved. Tasteless.<br><br>On top of it, no sauces on the side, no utensils or napkins, and I had to throw most of it out. Also, I know bubble tee probably doesn't travel that well, but most of it was melting by the time it got to us. <br><br>Sad as this used to be one of my favorite Thai places. 40 bucks down the tube.", "pics": null}}, {"review": {"des": "The best smoothies in Chicago and the best  decoration from any Thai restaurant in the city. very proud to see a restaurant that even loves the diversity of the neighborhoods and you could see it in the tile found in the bathrooms. also people are very friendly", "pics": null}}, {"review": {"des": "Very eclectic environment for this small, cozy Thai place. We ordered our go-tos (coconut curry & pad thai) and were a little disappointed when it came out relatively bland. Also, make sure to bring cash because it's cash only!", "pics": null}}, {"review": {"des": "Awesome food, great vegetarian options! Super friendly owners (love Tee!). The noodles mixed vegetables with tofu is heaven. Try it! You won't regret it. I get their lunch special (M-F, until 3 pm) and take it to go to eat while I work.", "pics": null}}, {"review": {"des": "I appreciate Cozy for its \"divey\" feel, the thousands of entertaining collectors' items scattered about, and its individuality as a small chain, but some things on the menu are just hit or miss. I came here with a group of friends for lunch last weekend and I would have traded my meal for any of theirs. I ordered the Sesame Chicken Salad and it was nothing special. It tasted like someone had taken pre-cut chicken strips, heated them up, placed them atop some bagged lettuce, and drizzled generic sesame salad dressing all over it. I was expecting something better for $8. <br><br>ANYWAYS, my friends got Curry, Chicken Fried Rice, and Pad See Ewe which all looked, smelled, and tasted 10 times better than my salad. The noodles and curry are Cozy's strong point, and anything else on the menu will not compare to them. They had excellent Crab Rangoon appetizer w/dipping sauce, and even stuck in a cute little umbrella, which made me feel for a second like my current situation wasn't Chicago in the middle of February. My friends and I agreed that their Thai Teas were also very good. <br><br>I wish I could have a do-over here, but now I know what not to order at Cozy. Be forewarned: at a table over, there was some confusion over the fine print of a Groupon--I have come here with one before, and there are so many random stipulations, so before you order/go, look at the time/day of the week/any special requirements listed!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uC5co3UY2dqP4d7deU7qDA/348s.jpg", "caption": "Pad See Ewe"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-85hYzXf0aKLApaCtbQGyg/168s.jpg", "caption": "Chachkies galore!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/E2ybZvDYcOuUeYBjFKRAuA/168s.jpg", "caption": "Chicken Fried Rice"}]}}, {"review": {"des": "Pardon my French, but this place is fucking amazing. I live right near Wrigley so I can tell you that this is my spot. I promise to be as objective as possible in this review despite my love for Cozy.<br><br>The Staff: Every single time I've been here I'm always greeted with a smile and taken care of promptly. No matter how busy it is the staff is always extremely friendly and I appreciate that given I know how hectic a dinner rush can be.<br><br>The Decor: Wow. I can guarantee that you have never stepped foot in any establishment like Cozy.  They have the most amazing collection of Cubs memorabilia I've ever seen and on top of that they have an insane amount of cool toys (which you can actually try and buy!). You could spend your whole visit here just marveling at all the cool collectibles they have. It really is such a warm and COZY spot. (I know I'm lame..)<br><br>The Food: Incredibly consistent, every time it is spot on. My favorite dish is the basil leaves with chicken and holy shit is it spicy!! I actually had to order it non-spicy the last time I had it to avoid my lips catching on fire lol. But if you crave the heat this dish is for you. The flavors are incredible and the portions are huge. Great value.<br><br>Pro-tip: Get the strawberry banana smoothie too. It's heaven.  <br><br>Cozy loves its neighborhood, and we love it back.", "pics": null}}]}