{"name": "crisp-chicago", "reviews": [{"review": {"des": "Yum. Yum. Yum. <br><br>This place is a dream. Tiny spot for grab n go, or sit down lunch. Service was really great and they're very friendly. It's a no frills place but you're guaranteed to be satisfied. <br><br>I went there for the Korean bbq chicken wings but they have bowls and other sides and items too. The wings are absolutely the showstopper! Amazing. Some of the best wings I've ever had. They are huge for wings and so tender and delicious but the crispiest I've ever had. And the flavor is marvelous. <br><br>I ordered 1/2 each of the Korean BBQ and the Seoul Sassy. The Seoul Sassy had some taste of ginger and garlic and a sweetness which was surprisingly delicious. Loved the Korean BBQ wow I can see why these are so popular. Plenty of sauce comes with them too for even more flavor! Nice touches with sprinkling them w sesame seeds and fresh scallions. All of the flavors just work so well together.", "pics": null}}, {"review": {"des": "This place was hopping for Sunday lunch. We lucked out and found street parking right in front. My family ordered a Baby Buddha, Bad Boy Buddha, Seoul Steak Bowl, Seoul Sensation burrito, and 5 wings. It ended up being a ton of food, we had leftovers to bring home. <br><br>The Buddha bowls had a generous amount of vegetables. I added some of the sauces that were on the table to mine, and liked both of them. My son loves burritos, and the Seoul Sensation was no exception. He ate it all. The wings were giant. We had half Seoul Sassy and Crisp BBQ. We agreed that the Crisp BBQ was our favorite of the two. <br><br>The restaurant is pretty small, and we had to wait for some people to clear out before we could sit down and enjoy our meal. The employees were nice enough to keep our food warm while we waited.", "pics": null}}, {"review": {"des": "If you're in East Lakeview, you NEED to go to Crisp.  It's such a great hole in the wall restaurant with amazing crispy fried chicken.<br><br>There's a good selection of sauces ranging from very mild to hot.  This is definitely one of the best restaurants on the Broadway strip within Lakeview", "pics": null}}, {"review": {"des": "Unpopular opinion, but the chicken here is overrated. Original texture of the chicken is crispy, but the sauces are meh (i got the seoul sassy this time) and the chicken does NOT reheat well at all. My leftovers were incredibly soggy, which made it unappetizing. I also received my order disturbingly fast (2 minutes after I ordered), so I know it wasn't fresh and they make batches during dinnertime. But I do appreciate what you get for the price (5 really huge wings that include both the wing and the drumstick, so you basically are eating 10 for ~$10); however I wish there was an option to buy even less. The bowl option was recommended to me, so maybe I'll try that.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/a3im17z7q3uDHrAIf9msXg/348s.jpg", "caption": "Seoul sassy chicken wings"}]}}, {"review": {"des": "I've passed by here so many times with lines lines lines and finally I found my way in when there was no line! <br><br>Great Fried Chicken! Lots of choices, but for my first time, I went with Crisp BBQ:  American/Korean blend sauce that was just the right amount of heat and sweet I was looking for at that time. I usually go for the spicier the better, but I'll keep that for my next visit in. <br><br>The wings were very large and fried crispy crunchy the way I like them and the Five per order was more than enough for me. <br>Coming here made me realize that the wings I've been accustomed to eating over the past few years are unacceptable now :) No More Tiny Wings for Me!! <br><br>The tables had some extra sauces for the tasting, but none was needed!<br><br>There are 4 more styles to try, so I'll be returning soon!", "pics": null}}, {"review": {"des": "Honestly one of my favorite chicken places in Chicago. The flavor of the chicken is just right and isn't too salty or sweet. My go to flavor is Seoul sassy with just the right amount of sweet and sour. The full chicken literally feeds 3 people and makes you super full for what your paying for. The chicken is not dry inside and is very juicy and pleasant to eat.<br><br>The only rough part is the restaurant is pretty cramped for the traffic it gets. It's first come first serve so generally you'll have to share a table with a stranger.", "pics": null}}, {"review": {"des": "First stop out of the airport? CRISP! We parked in the parking garage of Marinos supermarket(about a block down), since we had to get some snacks for the hotel room.<br><br>As excited as I was the food was underwhelming. I am not a fan of sweet sauces. We got the bbq sauced half chicken with the bad boy bowl. The description said the sauce was slightly sweet, but it got TOO sweet after the first piece. Definitely tasted like American fusion food..aka white washed <br><br>Chicken was double fried so the crunch was still present, even after been drenched in sauce, but again, the sauce was just too sweet for me. Maybe it's just personal preference, the bf thought it was good but was only able to eat 2 pieces so we togo'ed the rest.<br><br>They also have bowls with bon chon(side veggies) in it. We got the bad boy(8 veggies+egg), the veggies were probably the best part of the meal. We'll flavored and the pickled veggies were not sour/overly fermented. I can appreciate that! The rice was on the drier side though. I can't win!<br><br>I also wanted some kimchee, but $4 for a side of kimchee? ‍ I'd rather buy a container full of kimchee at a Korean market for that price. Thanks but no thanks. <br><br>Glad I tried out this joint, service was great, open seating concept was cool. But sadly, will not be coming back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/q5VU-D_RNRMv2JyHUBBMTA/348s.jpg", "caption": "Mmm yummy veggies"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kbcx8T1jZcLrIVIrJdK9RA/168s.jpg", "caption": "Crispy chicken, but the sauce got too sweet after the first piece."}]}}, {"review": {"des": "As the only place around for Korean fried chicken, I was super excited to come try Crisp. If you've never had it, Korean fried chicken is coated and fried twice, giving it a super thick, crispy exterior that soaks up sauces well without getting soggy. At Crisp you can order double-deep-fried wings, tenders, or a half/whole chicken cut up into pieces, as well as some other korean dishes like rice bowls. <br><br>I opted for some tenders in their Seoul Sassy sauce (ginger, soy, garlic), and a half chicken in their signature BBQ (it's like a sweet and spicy korean American fusion). While I did like the sauces, they were both on the saltier side and could've had a it more balance. The half chicken was fried just right, with a thick crispy outside, but the tenders could've used more breading/coating. To be honest, they felt a bit packaged or premade; I would definitely go for the wings or full chicken next time.<br><br>While I didn't like Crisp as much as some other places I've been (Bonchon specifically), it is nice to have a reliable local joint to get Korean style fried chicken (which you totally have to try if you haven't had it!).", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/guqFKHojZ0LcaW8aLIZ49g/168s.jpg", "caption": "Half chicken in their bbq sauce (it's like a korean sweet and spicy fusion bbq)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8xzH4Y8NG2Ml7KYhWeLBUw/168s.jpg", "caption": "Tenders in the Seoul sassy (ginger, soy, garlic) sauce"}]}}, {"review": {"des": "By far my favorite place to eat in the city! If I could live here, i probably would. If I could eat this for every meal of every day, I probably would. When I die, I'm pretty sure this is where I'll go because it is the definition of heaven! <br><br>I usually order either the wings or their chicken breast sandwich and to be honest, I could live on that sandwich forever! The small one (one breast) is big enough for two full meals for me. They have so many different drink options from regular colas to root beer (and any place with root beer is an instant hit for me)! Anyways, their garlic soy sauce is pretty good, but their most famous Korean BbQ sauce (don't remember what it was called) is the best sauce I've had in my life. They also have chicken tenders which I have to admit are absolutely mediocre. I wouldn't recommend their tenders, but their wings and sandwich are to die for! <br><br>All in all, I highly recommend this place for wings and their sandwich! The best thing in the world. I usually like to dine in, but finding a seat is extremely difficult at any time of any day as they are soooooo popular! Highly recommend!!!", "pics": null}}, {"review": {"des": "This hits the spot for chicken wing cravings!! We ordered 5 piece order of Seoul sassy and 5 piece order of the korean bbq. Both good but loved the saucy,  finger looking good korean fushion bbq wings over Seoul sassy. Gonna have to try it extra spicy next time<br><br>Note these are whole wings...so each piece has 2 parts", "pics": null}}, {"review": {"des": "This place puts BonChon to SHAME. <br><br>Arrived a little after opening of 11:30a and already many people chowing down on fried chicken. My friend and I ordered 10 Jumbo Wings and Seoul Steak Bowl. WOWOWOW we did not realize they weren't kidding on Jumbo. The size of the wings are MASSIVE!!! Definitely recommend 5 Jumbo to share between two people. The bulgogi in the steak bowl was AMAZING.<br><br>Leftover Crisp wings are STILL bomb according to my BF chowing down leftover wings as I write this review.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Q3k9XtsGW47mws5_4FYJWg/348s.jpg", "caption": "10 jumbo wings and Seoul Steak Bowl"}]}}, {"review": {"des": "So goooood!<br><br>I don't need to say more. Just try it. Very casual spot, order your food, pick a seat and they'll bring it out to you. I saw a lot of people ordering out too. <br><br>Sadly I didn't get to try the bowls or other stuff on the menu besides the tenders and wings. I was looking around to see what people ordered and everything looks equally good. The burgers were huge and saw one guy eating the bimbap bowl.. also look good. We ordered the sassy and bbq wings and tenders (2 order of each). It was more than enough to feed 4... at first I thought it was too little but boy was I wrong. Very generous in portion and size. Size order of kimchi, came out in a tub (pre-packaged) but it was great. Fries were very good also. I definitely would recommend this spot.", "pics": null}}, {"review": {"des": "Rating based on food, taste, and authenticity. We visited this establishment back in May upon a Yelp search for restaurants in the area, and I was very excited to learn that there was a Korean fried chicken joint nearby. Just to educate the masses, Korean fried chicken is still fried chicken, but it's characteristics also include a sweet and spicy sauce that adds a whole lot of flavor. Growing up, I've had plenty of delicious Korean food, including lots of crispy fried chicken with that sweet and tangy sauce. I've even made my own at home and served some for a party. So, I figured this place would have some really good Korean fried chicken.<br><br>Some people have mentioned how small this place is, but honestly, I think its size adds charm and a homier feel. After arriving, we quickly went over the menu where I noticed the choices of fried chicken and Buddha Bowls that are based off of another Korean dish called bi bim bap (mixed rice), which just happens to be my favorite dish ever. Even though I'm not used to variety of sauces for this chicken, I liked the list of choices, and I also liked the size of the wings. <br><br>I was not impressed with the Buddha Bowls because they seemed more like a generic salad atop rice with a little sauce. Maybe I was just put off since this was not favorite dish. I ordered the Seoul Sensation burrito and was not overly happy either. The flavor of the meat was good, but the overabundance of salad and rice along with the presence of corn created a dry burrito with overall bland flavor. I never received sauce, but even if I had, the burrito itself was very dry and just okay. I did manage to try some of my friend's chicken and was turned off by the resemblance to average buffalo style wings. The sauce was tasty, but it didn't have the same crispy texture that Korean fried chicken would have. The side of kimchi was bomb, though! I could eat a whole bowl of just that, and the burrito would have definitely been better with that.", "pics": null}}, {"review": {"des": "So I was feigning for some Korean Fried Chicken really bad and this place was the first spot that showed up when I googled it. My friend was somewhat hesitant to go but off we go to the Lakeview district to try it out. <br><br>First it is a small space so I would recommend going there on off peak hours (like we did) but the staff was super friendly and informative of the menu items. We decided to order the 10 Jumbo Wings and chose the Seoul Sassy and the Crisp BBQ sauces with fries. I really enjoyed the Crisp BBQ sauce one and there are variations of bottled flavors at your table that one can use (Buddha Sauce, Sriracha)...<br><br>The fries are ok and doesn't have any kind of seasoning on them...<br><br>I prefer a more saucier wing and my friend likes a wing that doesn't have a lot of fat around it but all in all I enjoyed the experience and would go back again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4G2AryiM6gdcAAjlVtS6vA/168s.jpg", "caption": "Done..."}]}}, {"review": {"des": "Why 5 stars? Because the Korean Fried Chicken was absolutely ridiculous.<br><br>   ---   ---   ---<br><br>This was my first meal in Chicago on a 2-day trip with my Dad, and we were both starving. My dad is on the polar opposite end of the spectrum from me in terms of his adventurousness when it comes to eating. He eats what he knows and he doesn't stray from that. In fact, he'd never had Korean food in his life until this experience. When I even mentioned that the restaurant was Korean, his voice trembled in fear, as if Koreans eat nothing but horrific and terrifying things that would certainly make him ill. <br><br>Fast forward half an hour later, and he loved every bite of food that he ate. Korean Fried Chicken is the cure to any Korean food phobia.<br><br>That was some of the best chicken I've ever had. The flavor was perfect. The texture was perfect. The only thing I would have done differently was order a larger portion! <br><br>Instead, we shared the smallest size of wings and each got our own entree. I went with the bulgogi burrito and my dad ordered the bulgogi bowl. These were solid, but I definitely have had better bulgogi in the past. It was a bit dry here.<br><br>But those wings? They were magical. If all chicken tasted like that, I'd swear off red meat forever.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Pg6bm5ZXe9LiAsHFi3haGQ/348s.jpg", "caption": "Bulgogi Burrito"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cDTDJIQ747DA2mrVSa_ZfA/168s.jpg", "caption": "Bulgogi Bowl"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yVMXpazvvKAe9Lf8XDxpSw/168s.jpg", "caption": "Wings"}]}}, {"review": {"des": "If you love Korean fried chicken then you definitely need to stop by Crisp! The food never disappoints. I've brought out of town guests and they always love it. <br><br>The place is usually packed when I go on the weekends during the afternoon or evening. I've always been lucky to find seating though. The tables are meant to be shared with other parties, so if you're not a fan of that you may want to opt to dine out. <br><br>I recommended the Seoul sassy sauce. If you're sharing with people order the whole chicken. I've also tried the big boy Buddha. It was good, but not good enough for me to want to get it again. I definitely felt very envious of those eating the fried chicken while I was eating my Buddha bowl. For sides I've tried the deep fried mushrooms, which met expectations.<br><br>I like Crisp because they also give decent sizes for their chicken compared to other Korean fried chicken restaurants I've visited (in state and out of state/country). The flavors and crispiness are also spot on for my taste.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/V-tm5U9ouGb-RLY57rzH-g/348s.jpg", "caption": "Seoul sassy sauce on a whole chicken with Marty's magic mushrooms"}]}}, {"review": {"des": "If you're in the neighborhood this place is a no brainer!<br><br>Whenever I'm in town I always recommend the wings.<br>They. Are. Massive!<br><br>Came by with a group of friends from out of town and none of them were disappointed.<br><br>Subbed tofu for the Buddha Bowl which was exquisite.<br>Split the Bulgogi Burrito which is easily enough for two.<br>And had enough wings to last us the entire trip!<br><br>Highly suggest when you're in the neighborhood.", "pics": null}}, {"review": {"des": "This was the first time I came here but the food was good. The guy who took our order was really friendly. I ordered the buffalo chicken wings, rice and fries. The wings were really good. I definitely liked the buffalo sauce that was used on the wings. I just wished I would've asked for the sauce on the side because it became very messy to eat. They also gave so much fries but that a good thing because I love fries. I had enough food left over to take home.", "pics": null}}, {"review": {"des": "I LOVE this place. Best chicken wings in the city. They're huge! My partner and I have come twice. This last time we got 10 wings and one chicken sandwich to share. Don't make the mistake we made the first time and get 2 sandwiches. You don't need it because everything is twice as large as you imagine it (and we love to eat!). <br><br>The place is on the smaller side so you may have to wait a few minutes for space to open up but it hasn't been a big issue either time.", "pics": null}}, {"review": {"des": "Honest review: so overrated like was an au cheval experience all over again lol. Let me explain how it works it is always crowded so as soon as u walk in someone get a seat n the other order. Then after u order food will arrive at the table. Ambiance: it is so tiny in here idk why hipsters don't like bigger restaurants. It was really dirty here like the tables the floor the bathroom was gross just was un appetizing there's a lot of employees wish one of them would clean. Like if I have to clean the table before I eat that already is a turn off. Food: chicken wings were alright they weren't the best they weren't the worst but omg everyone saying their the best are fucking liars just trend dick riders or really haven't tried a lot of wings besides wingstop n bdubs best wings in chicago are at dos urban cantina these didn't even come close. A issue with the wings were they weren't crispy they were soggy. They were dry and the sauce didn't stick good to the wings the sauce is mostly on the tray that they come in. Then some of them still had hair on them that's the biggest turn off for me for chicken if there's hair I don't eat it that's gross! On the table there's sirocha/ gouchuchang/ aioli the issue with the aioli was that it was room temp mayonnaise has to be cold. Side note the wings arent big they just don't separate the drum from the flat... lol/ n the sides or other food items didnt look appetizing should update them<br>N the service wasn't good either. I wouldn't be back because it's to dirty inside n it's a hassle getting a seat n there are better places for wings honestly <br><br>SEOUL SASSY: these were the better wings but it's just soy sauce n sugar kinda similar to fish sauce wings if u been to any Chinese restaurant u probably had this flavor combo before in wings. <br><br>Crisp bbq: these were too sweet like they were ok flavor wise but way to sweet", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1sqWLoQGzK-RpwWRbGnbEQ/348s.jpg", "caption": "Sassy wings 5 pc $9:95"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0GhEqgMYHESEIWTxqCiItQ/168s.jpg", "caption": "Refrsshments"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hcnMadKHh0pCtQb1wC6GUA/168s.jpg", "caption": "Sodas"}]}}, {"review": {"des": "this place is BOMB<br>it came up on my yelp suggestions and i was so excited to check it out while i was in the area shortly<br>there was a sign on the door that they were out of wings but my Bf got the boneless and was still very pleased<br>i have the Buddha bowl which was so flavorful and fresh (huge serving) <br>the atomic sauce on the table was definitely the icing on the cake it ties everything together perfectly.<br>super fast service also!", "pics": null}}, {"review": {"des": "It was busy for an early Saturday afternoon. The seating is first come first serve and you order at the counter. After you order, someone will bring your food out to you (by calling the name you placed the order on at the counter). Since the tables are first, the larger tables are usually shared with strangers if you have a smaller party. I wouldn't recommend coming here with a party larger than 4, especially if you are coming here during the afternoon or dinner hours. The line to order gets long, and it is hard to find seating together for a group larger than 4. Once you're done eating, there will be people hounding your seat before you even leave. It's not a place to eat and sit down for a long period of time. <br><br>The food is great and the prices are reasonable! Which makes sense why there is a long line constantly.", "pics": null}}, {"review": {"des": "Crisp was featured on the TV show Check Please! and I was completely sold. I *needed* that twice-fried chicken!<br><br>It was nuts in Crisp. There were two picnic tables and bar-seating along the window. Apparently it's BYOB; however, it was such an unpleasant dine-in experience, I cannot wrap my head around spending much time there. This place is much better suited for take-out or delivery.<br><br>The tables were packed with people - strangers sitting hip-to-hip. There were chicken bones on the table, left over from previous diners. Folks waited in the remaining standing space and bussers squeezed between them with food, calling out people's names.<br><br>The chicken wings are different from what I expected. I'm accustomed to my wings being cut into \"legs\" and \"flats.\" These wings were the entire, uncut wings with the connecting joint still intact. It made for a messier eating experience while eating my \"Five Whole Wings for $9.95\" (per the menu).<br><br>I ate two whole wings (Seoul Sassy and Crisp BBQ) and then left with my remaining three wings in a to-go container. They weren't crispy as described on Check Please! They seemed like any other fried chicken with sauce or seasoning on them. While I was walking, a begging person asked me for my food and I gave it to him.<br><br>The wings weren't good enough for me to return to Crisp for another go. I wish I had understood that Crisp is better as a to-go place rather than a dine-in destination. It is my hope that other patrons have more realistic expectations and consequently have a better experience than mine.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YbQ-0bPRj4CtPe7N20UiyA/168s.jpg", "caption": "Seoul Sassy"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/up8QpbMZdIFYBRBxRKA3Zw/168s.jpg", "caption": "Crisp Barbecue"}]}}, {"review": {"des": "As soon as you walk in, you'll understand why this small eatery is a cute little gem!  We got there late afternoon on a Saturday and it was full.  <br><br>The space looks cramped and customers were in close proximity with each other.  There are only a few picnic type tables/booth, a few bar-high stools looking out the window/street and a few bar-high's looking at the wall.  <br><br>We walked to the back and was warmly greeted by the man behind the register.  He was very welcoming and patiently answered our questions.  After ordering, we ended up squeezing in a table sitting next to some other customers.  Barely couple minutes after sitting down, our wings came out.  <br><br>The presentation was great and the wings were steaming hot.  We got the Seoul and Crisp sauces and they were very tasty!  The outside layer was crispy and the inside was moist and juicy.  Through conversation with some locals that sat at our table, we found out that Crisp is one of the better places for wings in Chicago and they are frequents.  <br><br>It was definitely one of the best wings we've ever had and it's apparent many others feel the same.  The place stayed crowded, with a steady flow of customers coming in and out the entire time we were there.", "pics": null}}, {"review": {"des": "Best wings in Chicago!!! Honestly might be the best Korean food in Chicago too but the wings . Super friendly staff, fast service, and food made with love. Never disappoints for take out but great spot to go with a group also. Soul sassy sauce is my go to!<br><br>They deliver if you're in their delivery zone and make it easy with online ordering.", "pics": null}}, {"review": {"des": "This is a busy place- the line moves fast and alot of the people standing are there for take away.  Loved how many soda flavors they have- anytime I have to choose between cream soda or grape soda, I am in love.<br><br>The wings are what they are known for.  And the are big and perfectly cooked.  We ordered the crispy bbq- they have a great kick to them.<br><br>Based on other reviews, we ordered the bad boy Buddha bowl and the Seoul steak bowl.  Both were good.  While they do provide sauce at the table for you to dress up your own bowls, I felt the Buddha bowl alittle dry.  The steak bowl had a great flavor and the steak is juicy and flavorful.<br><br>Portions are large!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3C4AIPmlouKmJVHkcWMm-Q/348s.jpg", "caption": "Crisp BBQ wings- 6 piece"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/i34KacYGBWeT82YHww31xQ/168s.jpg", "caption": "Seoul Steak Bowl"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AZxjZm-jkAaCilNqvWax8Q/168s.jpg", "caption": "Chicken Bad Boy Buddha"}]}}, {"review": {"des": "I stopped by to order carry out as I was in the area and I know that Crisp is always packed. Like other Yelpers have said it is kind of hard to get a seat for more than a party of 2 at peak hours and the seating isn't great as the place is small. What Yelper's don't say is that they use the small space to the best of their ability and Crisp is a small business. Take a wild guess on what market rent for that place is? IT'S OUTRAGEOUS as Chicago isn't cheap (I know it's not NYC or SF) and they do what they do to put out amazing food and serve the community. <br><br>I have been to Crisp many times as I used to live at Belmont and Lake Shore and now I live up in Wrigleyville. Yes, I mentioned that the space is small. Crisp is also fast casual as you order at the register and then they bring your food out, but they don't \"wait\" on you. I ended up ordering an order of wings with the Seoul Sassy sauce and a Bad Boy Buddha Bowl with chicken and brown rice.<br><br>Crisp' wings are rated as one of the best in the city by Yelp and almost every Chicago news outlet. And I will go even further and say that they are the best wings I have ever had. They are meaty, crispy, and the sauce has a ton of flavor! The best part about the wings is that it took me about 20 minutes to get home and they were still pretty hot and they did not get soggy. Wings are the worst when they get soggy and they are not crispy. I haven't had Crisp in a while and I forgot how big the wings are. They were so big that I didn't even touch my Buddha Bowl. My plan was to carb load as I have the CARA 10 Miler tomorrow, but I ended up splurging a bit. YOLO.<br><br>I didn't touch the Buddha bowl and will save it for lunch, but it's my go to when I come to Crisp as it's pretty healthy. The vegetables are always fresh and the sauce has a lot of flavor. Also, the sauce is pretty spicy. I'm a big fan of Crisp and think everyone should give it a try!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tBxQ7RMS3txjAPHJYS5GJg/168s.jpg", "caption": "Bad Boy Buddha Bowl"}]}}, {"review": {"des": "I've heard about these Korean wings for a very long time and we were super excited to finally get to try them. Honestly if I had eaten these wings as a take-out or delivery, I'd probably give them a 5 Star review. Their space is where they fall short but, their wings are absolutely delicious. <br><br>We saw the restaurant was packed and placed our order at the counter and hoped for the best that we'd find seats for 4. We did get lucky but only because my husband is aggressive on snagging seats. As soon as we sat down, our order arrived. We devoured orders of Crisp BBQ, Seoul Sassy and Buffalo Wings plus 2 orders of onion rings. The boys loved the Buffalo best and I voted the Crisp BBQ 1st place with Seoul Sassy a close 2nd - our daughter reversed those as her faves. Those wings are pretty perfect which is saying a lot since they are served as whole wings - I always prefer them to be cut apart. They're large, very meaty and loaded with flavor. <br><br>Now here comes the but....the food here is beyond messy and no one cleans the tables here between patrons. The amount of mess created here equals places like Angry Crab where food shows up in a plastic bag. We could have used a plastic bag after we were done for all the trash. The tables all have a roll of paper to clean you up and you'll have a pile of it when you're done, as well as wing debris.<br><br>Yes I'd eat these wings again, preferably with take-out or delivery.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/m7e7jcu6okVjsH5tBK-LiA/348s.jpg", "caption": "Crisp BBQ Wings & Buffalo Wings"}]}}, {"review": {"des": "Came here around noon on a nice Saturday, and the place was busy! The line moves fairly fast and we were able to find a spot at a table before our food was ready. The seating is fairly cramped and limited, so if you go at a busy time you may have to wait or take your food to go.<br><br>The food came out in about 10 minutes and everything was very tasty! I ordered 6 boneless strips and they gave me at least 8. The barbecue sauce is really good too and I liked the special atomic sauce they have on the tables.<br><br>I live in the area now so I'm sure I will be back. It's delicious, reasonably priced food that makes for a great lunch or quick dinner.", "pics": null}}, {"review": {"des": "Wow, what an amazing place this is!! <br><br>We had the half fried chicken with the Seoul sassy sauce and the spicy buffalo sauce. The chicken had a beautiful crispy skin and juicy meat that was complemented with the sauces perfectly. The Seoul sassy sauce was sweet and garlicky, and I personally loved the spicy buffalo since it tasted homemade and with the perfect amount of vinegar to balance the fat of the chicken. <br><br>We also had the Seoul steak bowl that was really delicious, with amazing rice and great tasting steak pieces. <br><br>This is a place I definitely will be coming back to!", "pics": null}}, {"review": {"des": "Fried chicken. Bibimbop. Amazing spices and sauces. If these words in one line are making you weak at the numbers, drop the phone and get on the train to fat-happy heaven!<br><br>Wife and I were extremely pleased with this spot. Loved the chicken and the bowl. Added some beef to the Buddha bowl and highly recommend. Onion rings looked divine - will def try next time. Fun Korean sodas (all sodas including coke etc are bottle or can). <br><br>Lots of eating space and got the food out right quick.", "pics": null}}, {"review": {"des": "Uhhhhhhh.... pretty sure what I ate was just \"fried chicken\" covered in sauce instead of the advertised KFC. Or who knows. Maybe I'm just really particular with how my Korean fried chicken should be made. <br><br>Are my standards too high if all I'm asking for is a thin, crispy skin that is a whole notha entity from the juicy chicken that is on the inside? Sometimes I love the chicken skin too much and eat it by itself CAUSE IT'S THAT GOOD ON ITS OWN. Maybe I'll add some special hot sauce on the side as a treat to myself, but a KFC crispy outer layer should be able to stand alone as is. <br><br>*also lol, I'm getting v serious about Korean fried chicken. 10/10 my friends will rag on me later*<br><br>That's obviously not the case here at Crisp. I ordered the Seoul Sassy and Crisp BBQ wings and was not impressed with either of them. Thin skin? Yes. Crispy skin? No. The only bonus was that the wings themselves were pretty big in size.<br><br>Honestly, there's so much more I want to complain about but it's very hard to explain in words unless you've tried KFC in Koreatown LA. I loooove fried chicken so Crisp was disappointing to me. Would not recommend.", "pics": null}}, {"review": {"des": "Boy am I glad to visit this shop in Chicago! The hype and high ratings are real!!!!!<br><br>I came here with a main focus of ordering the wings as they are famous for them. But then, I saw a deal for drumsticks (5 for $6) and had a moment of hesitation. The picture of the drumsticks look really good and humongous. However, after the help of one of the guys at the counter, he convince me that the wings was the way to go.<br><br>First, it took literally only 3-5 minutes for the wings to come out fresh and piping hot. I got the 5 wings with the sassy sauce and the BBQ sauce. The wings are gigiantic. First bite, you can hear the crunch from the skin. However, the meat was tender enough that it was falling off the bones. These wings are also filled with meat, they know where to get good chicken. Both sauce are really good. I like the BBQ a little better because of the spice. <br><br>Overall, I love the chicken, I wish I ordered the drumsticks in addition to the wings. It's a must place to try when you are in Chicago. Of note, this is a messy meal, expect to use a lot of napkins which are readily available.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KBfBSVb9K-WFGiv-wOnHkw/168s.jpg", "caption": "Size of a wing"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QCNNKFz-bSeG7Ih6aKG76A/168s.jpg", "caption": "Half sassy and half bbq"}]}}, {"review": {"des": "Saw this place listed on top 21 wings around the US!  Being I was visiting chicago and I'm a HUGE wing fan I just had to stop in.  This place DID NOT disappoint.  We ordered 5 sassy Seoul and 5 bbq.  These were both amazing.  Extremely crispy and flavorful. The boyfriend like sassy better I like bbq better!!! Both great!!I wish I lived in Chicago cause I would be a repeat customer.<br><br>The boyfriend also got a bowl which he really enjoyed! I tried and loved as well!!", "pics": null}}, {"review": {"des": "Yes. Finally stopped in today. We got 6 boneless chicken strips, half Seoul sassy and half spicy BBQ. Also a Buddha bowl with chicken. First impressions- cute picnic table style seats with tons of fun delicious sauces and much needed paper towels on the table. Food comes out- huge portions. The chicken is DELICIOUS. Seoul sassy is yum yum and spicy BBQ is knock your socks off spicy and delicious. The Buddha bowl is filled with fresh veggies and tastiness. <br><br>It's cheap, fun, fast, delicious. I will be going back!! Highly recommend.", "pics": null}}, {"review": {"des": "Best Korean Fusion Fried chicken! Quite possibly my favorite fried chicken ever (except for my mom's haha). I've come here on multiple occasions since moving last summer, and they never disappoint!<br><br>Crisp has 3 main flavors, Seoul Sassy, Crisp BBQ, and Buffalo. Always get Seoul Sassy. Period. Sometimes I try the other flavors or a combo of flavors, but I always think to myself, \"Should have gotten all Seoul Sassy.\" It's a tad sweet with great garlic flavor. Perfect for those who can't handle spicy!<br><br>Most importantly, the value for your money is excellent! Each wing at Crisp includes both the drum and the flat so when you order 10 wings for 17.95, you're really getting 20! Best deal on wings by far ever! Super highly recommend.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SZw9s-TV45_C7Ko8cjmjFg/348s.jpg", "caption": "Seoul Sassy, aka best flavor"}]}}, {"review": {"des": "Best chicken in Chicago.<br><br>The chicken wings were nicely fried and the Seoul sassy sauce was amazing!<br><br>My new favorite sauce is the Crisp BBQ, I like how it has a bit of a kick to it. So delicious! I highly recommend it.<br><br>If you are with friends, get their Buddha bowl. You won't regret it.", "pics": null}}, {"review": {"des": "Came here with a strong recommendation so I just had to try it out. This place was talked up a lot so I had high expectations. I have had many different types of Korean fried chicken before so I definitely had a benchmark in my mind.<br><br>ATMOSPHERE/ARCHITECTURE: 7/10<br><br>Casual atmosphere, it's quite crowded inside and the whole place seats maybe 30 people max. Judging by how packed it was though, I was getting really excited because I just knew that it had to be good right? The interior itself isn't really that impressive. There's a row of booth seating along the wall and chairs on the other side with interspersed tables. There's minimal stool seating on the opposite side and that's about it.<br><br>SERVICE : 9/10<br><br>The cashier was really very nice and polite. The food came out shockingly quick. I would say it took maybe 5 or so minutes and the order came out right after. We had a big order too and it was still without delay. Awesome.<br><br>FOOD: 8/10<br><br>We got a big order of 20 of the Seoul Sassy wings and 10 Crisp BBQ wings.<br><br>Seoul Sassy - I was forewarned and told that this was the best of them all, but I still wanted to try both. After having this though, this is definitely the superior flavor. And I must say the flavor here beats out any other Korean fried chicken flavor that I have had. This soy garlic flavor goes so well with the crispiness of the chicken wings. I was very impressed. This is a MUST try here.<br><br>Crisp BBQ - This was not bad, a tangy spicy BBQ sauce that was kind of \"wet\" on the wings. It did not taste bad by any means, but in comparison to the Seoul Sassy, this was kind of disappointing. Next time, I'd go with all Seoul Sassy. Don't fix perfect, right?<br><br>PROBABILITY OF RETURN: 8/10<br><br>I'd definitely come back for some more Seoul Sassy wings.<br><br>TO EAT OR NOT TO EAT: Eat. The Seoul Sassy is worth a shot. Definitely not like anything you've ever had at Buffalo Wildwings or Wingstop.<br><br>OVERALL: 8/10", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/P9yjQ1FGIfr5bfBnTGIh7g/348s.jpg", "caption": "Crispy BBQ Wings"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Y4lmbthVS4iycS8XhMN_8Q/168s.jpg", "caption": "Seoul Sassy Wings"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Mo7u6E3QpgqIAPCVZKU-YA/168s.jpg", "caption": "Crisp BBQ Wings"}]}}, {"review": {"des": "I've come here multiple times back when I was in college and now recently.  I would say that my favorite thing to get here are the half Seoul sassy and half spicy half chicken.  It's a great deal and it honestly is enough to feed two people and then some.  I've also tried the \"Buddha bowls\" which are essentially bibimbap.  Plenty of metered street parking outside.  Service is fast but seating is limited.  I wouldn't come here with a large group unless you were willing to wait for a table.  Seating is bar style or communal at several large picnic style tables. Oh! And they have lots of korean beverages and other sodas for sale as well!  They even had pineapple Fanta!  All in all one of my favorite spots for korean fried chicken.", "pics": null}}, {"review": {"des": "This place is my everything. I love fried chicken. But Korean fried chicken? Life changing.<br><br>Whenever I come in here, I convince whoever's with me to get a massive order of the chicken wings with  Seoul sassy sauce. It's not that hard to convince them since I have proclaimed it as the greatest chicken I've ever had. We then split some sort of bowl. But I usually hog the chicken and let them take the lead on whatever bowl we get.<br><br>I don't have much else to say other than if you haven't had Crisps wings yet, you have to. If you're not from Chicago, come to Chicago. If you're vegetarian, stop. If you are human and eat food, come here. So good wow.", "pics": null}}, {"review": {"des": "I do not give many 5 stars, but this place has earned it. This review is way overdue as well. This place does not have a lot of space, but the reason being is because you take your food and go eat at home or in a park etc. The food here is absolutely amazing, most likely my favorite Korean spot in the city, they really need more of these places to start going out by the northern burbs they'd make a killing.<br><br>I thought of it and the fried chicken and bibimbop just thought made my mouth water. Next time I am in the area I know where I am going to grab a meal and give my stomach some justice!", "pics": null}}, {"review": {"des": "I can see the hype here! If you're ever in Chicago and crave good korean fried chicken, this is the place to go.<br><br>This is a no frills neighborhood restaurant. The space is pretty small, maybe fitting 20-30 people tops. You can order at the counter to dine in or get takeout. <br><br>Since it is such a small place, sometimes there can be a line or get cramped around peak dining times. We've actually been here twice around lunch maybe 1 or 2 and were able to order fairly quickly, get our food and find a seat. Since they focus primarily on fried chicken, you'd be missing out if you didn't get any. You can't go wrong with wings or either a half or whole chicken depending how hungry you are. <br><br>The most popular and most unique sauce in my opinion is the Seoul sassy, not too spicy and a tad more sweet but really you can't go wrong with the sauces.<br><br>On top of the chicken options, they have Buddha bowls , burritos and a few other options as well. I'm actually getting hungry just thinking about Crisp.<br><br>Whether you're new to Crisp or returning there is something for everyone. This is a definite must for any Korean fried chicken fanatic, come hungry!", "pics": null}}, {"review": {"des": "Overall: 4.3/5<br>Came here on a Saturday around noon for lunch. They were packed so they were only doing to-go orders so I took my order and ate it on a bench elsewhere. <br><br>Taste: 4/5<br>The bbq flavor of the boneless fried chicken was very flavorful. The seoul sauce flavor was also nice and a milder option. Didn't try any of the bowls but I would come back in the future for that.<br><br>Value: 4.8/5 <br>I only got the \"3 piece\" which was like $6 but was pleasantly surprised to see pretty big portions. I was full by the end of that.<br><br>Speed: 4.5/5. My order was ready in about 5 minutes. Very speedy turnaround.<br><br>Environment: 4/5<br>They don't have much sitting space to begin with (maybe like 6 tables?) and it was a bustling, dim(ish) vibe. <br><br>I will be back!", "pics": null}}, {"review": {"des": "Been on a KFC kick for quite sometime and hands down Koreans do fried chicken the best! This place is no exception. Had to get the \"Korean mom's\" recommendations. And since it's their house spice, couldn't resist that either. So got spicy BBQ and the spiciest with their house sauce. Does not disappoint! My brother tried the BBQ first saying that he wanted to work his way up (heat level wise). I jumped right in with the spiciest. Great flavor. Was surprised that the heat didn't kick in until after I finished my first wing. Then it was craziness afterwards. The BBQ wasn't as flavorful but the spice from the original took over. Would definitely recommend!<br><br>I will be returning to have the original house sauce and maybe a wing or two of the spiciest again. Took CTA to get here so don't know anything about parking. Restroom was clean. ENJOY!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_FPuU1Otq9sAaL4ksbe2AA/348s.jpg", "caption": "10 whole wings. Extra spicy and spicy."}]}}, {"review": {"des": "What a fun, tasty place to hang out and fill your belly! This place is small and gets crowded, so be prepared to wait your turn and stake out table space if you are dining in. <br><br>The wings are crispy crispy and both sauces I tried were killer!! I especially loved the Sassy Seoul. Be aware that the \"whole wings\" are served exactly as advertised - whole. Drumette, wing, tip, and all! <br><br>The Buddha bowls are just bibimbap bowls, and I loved all the crunchy veggies in it. I wish I could've poured some Sassy Seoul sauce in it as well! They also serve these wrapped in a tortilla if you prefer a more portable eating vessel. Overall, YUM.", "pics": null}}, {"review": {"des": "Wow the hype is real!  I love Korean fried chicken, and this is one the best spots to have it.  Everything was sooo good.  We got the 10 wings, which are really huge and worth the price it costs.  We got 2 flavors, the seoul sassy and crisp bbq. I would have to say the seoul sassy is the best one.  The bbq flavor was okay for me, still good, but the seoul sassy stood out the most for me.  The order comes out fairly quickly and the wings are still really hot!  Keep in mind, the space is pretty small so it might be hard to find a seat or you will have to sit with stranger, but it's all good cause the food is all that matters!  Great place for fried chicken wings!", "pics": null}}, {"review": {"des": "Holy chicken, I am in love with Crisp. I was originally introduced to Crisp via a friend. All my friend would say is that the chicken was unbelievable and we needed to try it as soon as possible. <br><br>A year later and I am still just as in love with Crisp as I was the first time I ever visited. The one thing you need to know about Crisp is that finding sitting that will fit a large size is very rare. The sitting is always first come first serve so you will have to scope out sitting before placing your order. I would highly recommend coming to the restaurant either solo or in a pair because the sitting is so limited. <br><br>Crisp has a variety of popular chicken based meals that you can choose from but I always opt for the chicken sandwich. No matter how many times I have had the sandwich I always am amazed by the quality of the food. The chicken is so tender and crispy that it fails apart in your hand but in a good way. The best thing about Crisp is that the food is fairly cheap and it is made fairly quickly. <br><br>I love Crisp and I would highly recommend visiting even if it is for a take-out order!", "pics": null}}, {"review": {"des": "THE BEST KOREAN FRIED CHICKEN WINGS I HAVE EVER HAD IN MY LIFE!!!<br><br>When I was visiting Chicago, I knew that no matter what, I had to check out Crisp based on all the pictures and reviews on Yelp. The restaurant is kind of out of the way if you are planning to stay in the downtown area, but is located on a nice street that's filled with restaurants and shops. <br><br>Crisp is very small with limited seatings. It was kind of stressful trying to find a seat in the midst of the crowdedness inside the restaurant. Not only that, there was also limited space to hang your coats. It is definitely not the most comfortable restaurant that I have been to. However, the food made it all worth it. <br><br>I decided on the 10 wings, half in the buffalo sauce and half in the BBQ sauce, all with the spicy level suicide. I also got a side of kimchi. My boyfriend also got the 10 wings, half in soul sassy and half in bbq, all with the spicy level hot along with a side of fries. The food came out very quickly. We were surprised by the large portion. We really could have shared one order and would have been satisfied. The kimchi literally came out in a large container.  I was surprised as it only costed around $3. <br><br>The wings, the kimchi and the fries were all HEAVENLY. I don't know how they make the wings sauce, but it was the sauciest and most delicious sauce I have ever tasted. If you are into spicy, I highly recommend getting the same order as me. I was very satisfied with the flavor and the spice level. I also had a taste of the soul sassy wings and those were delicious as well. The fries were hot and plentiful. The kimchi was crunchy, fresh and spicy. The wings were literally finger licking good. We finished our food and were craving for more. <br><br>I highly recommend checking out this place when you are craving some kickin' Korean fried chicken wings. As I have told some of my friends, I would fly to Chicago just to eat these wings!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/j7TTuHQzllTcu_Gb7vhyzA/168s.jpg", "caption": "Barbecue and soul sassy - medium with a side of fries"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MJf3-upxag5KUh2kiJerwg/168s.jpg", "caption": "Barbecue and buds buffalo - both suicide with a side of kimchi"}]}}, {"review": {"des": "A long distance Korean chicken review coming at ya. I had to try his place after seeing it had 3000 reviews, and I was pumped to see what the hype was about. My take away from Crisp was that it served really good Korean fried chicken. They didn't do anything over the top blow your mind crazy, but it was a really solid spot with banging sauces and crispy chicken. The price was also really good, and my only complaint was that some pieces were a bit dry. Overall I was satisfied with the experience, but I just wanted a bit more after hearing the hype.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/k8AaTXMhsiVVRHT7yDqPng/348s.jpg", "caption": "Half chicken for only $10 a pretty good steal"}]}}, {"review": {"des": "Love this place, EXCEPT for the limited dining space! Great quick dinner before/after a movie at the Landmark.<br><br>Try the buddha bowl... And my son recommends the Seoul sassy fried chicken", "pics": null}}, {"review": {"des": "This hole in the wall place is probably my most favorite place to eat in all the Chicago. It's small and family style seating but we've been there before for a birthday party and were able to find seating together. People are usually in and out fairly quickly. The staff are also great. They're also helpful and make recommendation if you don't know what you want. <br><br>I'm not a huge fan on fried chicken but the fried chicken here is unlike anything you'll ever have. The chicken wings are HUGE. I eat about 2 and if I'm really hungry I can eat 3. My husband eats about 5-6. The wings are extra crispy and so tender. The crispy coating is slightly seasoned and slightly salty but nothing over powering. The sauce options we prefer are the bbq estra spicy and the seoul sassy. The bbq extra spicy is a little thinner than the traditional bbq sauce but for wings i think it's the perfect consistency. It's sweet and then the spice kicks in. The seoul sassy is like a soy teriyaki sauce. It's much sweeter and lighter than the bbq sauce. I usually get one of each to balance it out. I also have to mention that they put more than enough sauce on the wings. The wings are drenched so with every bite you get the sauce. Something that we do is get fries on the side and dip them in the sauce that's fallen off the wings. <br><br>We also always get the steak budda bowl with brown rice. It's very simple, brown rice, korean style steak (bulgogi) and scallions, but so flavorful. The brown rice is brown rice but the steak is so tender and flavorful. I'll add a bit of the spicy bbq sauce and a lot of the atomic bomb sauce to make it more wet and flavorful. The atomic bomb sauce is like a spicy creamy sauce. It's not spicy mayo it's much much better. The portion you get is also huge. This is enough for me to have for 3 meals.<br><br>Overall this place is consistently good. The food is out of this world and the service is fantastic. We've dined in and done take out and both time the quality has been the same. With take out I recommend asking for some sauce on the side in case you have to reheat the wings you'll want the extra sauce.", "pics": null}}, {"review": {"des": "Been here twice to experience the oh-so-famous fried chicken and I will say I was not let down.  While I prefer a traditional southern fried chicken (not what you will find here) frying birds is something we do in many countries and this Korean style is really beautiful.  Small crusty but super crispy skin (aptly named restaurant I might add) that does not lose it's crunch when the wings are tossed in the sauces.  The portions are HUGE (not trump hand huge but actually huge) and I feel that you get quite a bit for your money here.  Having been here twice I've been equally as satisfied both times - once dine in and once take out (fried wings stood up to the drive home, which is not always the case).  I feel they will be seeing me again in the future, drooling for another bite!!!", "pics": null}}, {"review": {"des": "The BBQ sauce is the best in my opinion out of all the options. The wings and drumstick are good picks. The half and whole chick risk the chance of being over cooked. <br><br>Speaking of which, while it taste good, it's a bit inconsistent. I've experience food being over fried to bone dry. Not just chicken breast but the whole wing become impossible to eat. I also experienced the chicken being undercooked. Went there today, one of my piece of chicken leg smelled off. Even tho I stopped eating it when it happened I still fell ill after. For a place that serves chicken as it's main dish I'd like to see some more consistency. <br><br>The to go box could use some improvement as well. The sauce is always leaked, something like Budlong's to go box would be nice.", "pics": null}}, {"review": {"des": "My friends and I went on a Saturday evening around 6:30 and the place was super packed. We ended up getting seating along the wall. Would recommend getting takeout instead just because of how crowded it got inside. I ordered 5 wings with Seoul sassy sauce and it was soooo yummy and more food than I thought. Would get again and the fries were very tasty too", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/grfX2DHAzfQbWhofLsp4Pg/348s.jpg", "caption": "5 chicken wings with the Seoul sassy sauce and fries!"}]}}, {"review": {"des": "Another placeholder so my pictures link. I'll update with details later, but the 3 star rating holds true.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GICAV1P83xKwBWNAbupkFw/348s.jpg", "caption": "Fries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_Sbx-8OQti5iLny7fbMLuQ/168s.jpg", "caption": "Onion Rings w/ Ranch"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sGUoRwSW4HDZC_bx6U3yjQ/168s.jpg", "caption": "Crisp BBQ (L)- A little spicy, a little sweet & a little smokey; Seoul Sassy (R)- prepared with ginger, soy, garlic and other select spices."}]}}, {"review": {"des": "Had 20 minutes to kill. I was hungry and remembered this place was on my bookmarked list. Ordered six piece chicken tenders  mild buffalo sauce.everything moves fast here. The place was packed. Very organized. Every employee was kind, friendly and welcoming! It felt great!  When the food arrived the portion was huge it had 7 tenders, cooked perfectly very crispy and tossed in your classic mild buffalo sauce. After three pieces I had to take the rest home! I was really surprised by the quality, the quantity and the people the whole experience was fantastic and I did not expect that it. Looking forward to trying more menu items", "pics": null}}, {"review": {"des": "Was taken here by friends and I should be thanking them throughout the new year! As a fried chicken aficionado I'm pretty picky and this place passed with flying colors! Got the Seoul Sassy, Buffalo and BBQ flavors and they were all top notch! <br><br>Also had the Seoul steak bowl which was also tasty.  There are solid veg options for you non-carnivores too. Cool vibe in the place and it was BYOB - a liquor store is right across the street.<br><br>Shout out to the service which was great!", "pics": null}}, {"review": {"des": "This place was a little drive from the city center but it's definitely worth a visit. It's small inside and there are only a few tables, but everyone was very okay with sharing tables with each other, very cool. We came specifically for the wings. They're whole wings which is great for sharing with a group. We had the Seoul sassy and crisp BBQ, my favorite was the Seoul sassy, the BBQ was a little too spicy for me. The chicken came out fresh, I burned my mouth on the first bite. Suace is very good, and the wings are coated nicely. Not too much sauce, and not too little. The wings are crispy, but not as crispy as I would expect Korean fried chicken to be. The Buddha bowls seemed to be popular but we did not get an opportunity to try them. Definitely worth a visit if you're craving some wings.", "pics": null}}, {"review": {"des": "PERFECT 1ST DATE SPOT.<br><br>.. jk<br><br>After hearing so many great things about Crisp, I finally made my way over for Sunday lunch with some friends. It's a rather divey place with bar stools and wooden benches with picnic-style tables - perhaps seating 20-25 people total. <br><br>To order, go straight to the cashier and just go for the wings. Apparently, 5 wings/pp is a good rule of thumb to follow. So between 6 people, we opted for 30 wings of various flavors. We also got a big boy buddha bowl and seoul steak bowl for palette cleansers. <br><br>I'd recommend coming here with 4 or less people so it's easier to snag up seats, but we still managed as a party of 6. During the short wait (it was prob less than 5 mins!), be sure to fill up on water and tear up paper towels for everyone cause BRACE YOURSELF it gets REAL MESSY REAL FAST. <br><br>Seoul Sassy was everyone's favorite. Though not spicy, the flavor was yummy and much more enjoyable than some others (ahem buffalo) that's too saucey.<br><br>Crisp BBQ was not very memorable.. I remember it wasn't as good as Seoul Sassy though.<br><br>I wouldn't recommend getting the Buffalo - I think it might be there to tend to non-asianfood-loving-customers. I'd rather go somewhere else (yum have you tried Domino's wings??) for the classic buffalo sauce. Plus, there's so much sauce that it defeats the whole purpose of eating crispy korean twice-fried wings.<br><br>Seoul steak bowl was good but meat to rice ratio can be improved. But since the beef was marinated in the Seoul Sassy sauce that we all loved, and the sauce seeped into the rice, we still devoured this with no difficulty.<br><br>One reason to eat the wings there at Crisp is to take advantage of the sauces on the tables. Though they're not necessary for the wings, the sauces complement the Buddha Bowls rather well. <br><br>Crisp is worth a try if you're in the area but I wouldn't go out of my way for it. Though the wings are objectively good, I wouldn't credit them as very authentic nor were they the best korean wings I've ever had.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tDM53QqtmNccFftRQUwz_w/348s.jpg", "caption": "Big boy buddha bowl"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8yDFhP63FME_iEeqMqbH_A/168s.jpg", "caption": "30 wings, big boy buddha, and beef bowl $78 total - good for 6 people"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UKx0ws0JqEZjmuPB2AS4DQ/168s.jpg", "caption": "The look of true love"}]}}, {"review": {"des": "Not sure what the hype is about, I've had far better chicken wings. I personally haven't been inside because our friends ordered take out but I hear it's a tiny place and crowded all the time. The wings were way too dry to the point that it was hard to even eat them. However, I liked the variety of the sauces with both sweet and spicy options. We also tried the Chi-Town Chicken Bowl which was basically a bed of white rice with plain chicken on top and green onions. It had no sauce or flavor to it, definitely don't recommend it. I had high expectations from Crips but unfortunately it didn't live up to the hype.", "pics": null}}, {"review": {"des": "To my special friend who thinks I don't eat human food  I think  I found my favorite chicken  wing spot.<br>.<br>Review<br>.<br>The wings came flying out of the kitchen fast and hot. I purchased the Seoul Sassy wing/Crisp BBQ . #SoGood is all I have to say. It's a messy job but I was up for it. The 6 piece was big enough to satisfy my hunger but I'm greedy. I'm glad the attendant told me I would be good with one order cause I wouldn't be able to stop  enjoying this delicious  food. If you're in Chicago looking   for a chicken  spot, this should be your first pick. Eat in front of the mirror and bring floss. Trust me on that. Parking is limited so I suggest CTA/Uber.", "pics": null}}, {"review": {"des": "Hands down the best Korean wings in town! You absolutely have to get the bone-in wings with Seoul sassy sauce. My husband and I typically share an order of 10 wings, which doesn't sound like much but each wing is huge! The wings are perfectly tender on the inside and crispy, savory, life-changing on the outside. Trust me, you will not regret getting this! <br><br>I recommend coming during off-hours to avoid the crowd! There are only a few benches and you really want to sit down to enjoy these delicious wings thoroughly!", "pics": null}}, {"review": {"des": "Here again- this time I'm eating in and I have to tell you it really is CRISP if you eat it here. The chicken loses some of its crispiness when I have it delivered.  Had the Sassy Seoul as usual and yes we (wife and sister-in-law) found seats cause it's 2:30 on Saturday 070718.", "pics": null}}, {"review": {"des": "Before coming here, I was skeptical about how good it might be. But I saw the large crowds each night and I thought: it must be good. I have to say, I had the BEST chicken wings ever at Crisp. The skin was thin and crispy (without overpowering the chicken), and the meat was juicy and tender. The flavoring was amazing too, especially Sassy Seoul. I also tried the chicken bowl and Buddha bowls. I loved the Buddha bowl, but wish it came with more sauce (I had it to-go). The chicken in the bowl was on the dry side. If you go here, you MUST try their wings :)", "pics": null}}, {"review": {"des": "A must must MUST try. The Seoul Sassy wings here are EVERYTHING 5/5. They're marketed as their \"not spicy\" wings, which is perfect for me because I've always loved a sweeter chicken. I always order 5 whole wings to SHARE because I would never be able to finish 5 by myself - these wings are HUGE. and I'm not sure if they do this intentionally, but I always end up with 6 or 7 wings? What an AMAZING surprise. They are crispy, doused in their amazing dressing, and can be eaten with their sweet orange or spicy red sauce. <br><br>I also order their Bad Boy Buddha which is their rice dish served with 8 veggies? I like to upgrade and add their Korean bulgogi meat to mine. It is also definitely 5/5. I like to top it off with just a little bit of the spicy red sauce and now it is the perfect compliment for my chicken! A must share dish as well. <br><br>If you haven't been here yet, what're you waiting for? Its time to try the wings!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qPpuwlek6mvZbQUBkLOwtQ/168s.jpg", "caption": "Seoul sassy 5 whole wings"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aqDGJUd9Lki9OTKM-_ThXA/168s.jpg", "caption": "Bad boy Buddha with meat"}]}}, {"review": {"des": "I know I always make these extreme statements but OMG I died like 100 times while eating these wings.<br><br>I am not really a wing girl but JESUS HELP ME!! The first time I've had them was when my boyfriend was trying to convince me that they have the best wings in town.  I naturally didn't believe him because I have better taste buds. <br><br>On a random Sunday Fun day after we consumed alcohol all freaking afternoon (I was tired and wanted to go home) but he dragged me here. The place was busy and smelled like heaven on earth so I woke up INSTANTLY. Can you believe that I ate 10 wings ALL BY MYSELF!?!?! I mean I don't know what seasoning, dressing, crack (ok crack is a joke ppl) they put on their wings but it's to die for!!!!<br><br>As I stated, I died at least 100 times while sitting there sucking the meat of the BONES. I had the Seoul Sassy Wings, I thought I throw it in there just for clarification LOL .<br><br>Anyways I did have a favorite Chicken place before I came here and GOOODDDDDDDDDD!!! Ok I sound like a person that never had good food and now i sound bother line pathetic. <br><br>LET ME SUM IT UP - GO THERE - GET THE SEOUL CHICKEN - THANK ME LATER", "pics": null}}, {"review": {"des": "I've been dying to try some Korean fried chicken so I made this spot a must. It was out of the way for me but I didn't care, it was going to happen.<br><br>The location is pretty small and I came on a Saturday and it was PACKED! Somehow I still managed to find a seat and enjoy my 5 Seoul Sassy flavored wings. It's 5 for $9 but it's actually 10 because you get 5 WHOLE wings. Awesome! The sauce reminds me of a light General Tso's. I wanted to try the spicy but I shy away from spicy when traveling. The food came out pretty quick so their turnaround is pretty good. I don't know if they serve beer, but I saw someone with a Sapporo can. I just got a water and enjoyed my meal by the window. I would stop here again if I'm ever in the area again.", "pics": null}}, {"review": {"des": "Always like their wings for take out, but my good experience was left with a really bad taste last time due to the attitude of the dude working at the cash register. Went on Friday night 11/16/18. Young white dude on the right register, u may need some manners in customer service! Learn to say PLEASE or THANKS! Don't give customer your schmuck face just because you're having a bad day! Not once this person was nice to customer or even show a smile! What's his problem?", "pics": null}}, {"review": {"des": "If you're a fan of korean fried chicken, then you MUST come to Crisp! The wings are gigantic and the kimchi was good. I wanted to take home the leftover kimchi with me and pack it in my luggage, it was just that yummy (don't worry, I resisted, for obvious reasons).<br><br>Crisp has a really chill vibe with long banquet style tables where you eat with strangers. Also, you dispense your water at a water cooler..very laidback and not fussy at all. You order at the front and take a seat as you wait, and then the wings come out piping hot and delicious. All the sauces they use to coat the wings are good, you cannot go wrong. But do yourself a favor and order a side of kimchi: the hot wings pair perfectly with a cool bite of kimchi to soothe your tongue.<br><br>Chicago is lucky to have Crisp, seriously. Highly recommend if you're in town!", "pics": null}}, {"review": {"des": "Definitely the best korean fried chicken I ever had in the united states. It's definitely authentic and reminds me a lot of home. Its crispy, juicy in the inside, and quick too. One problem I have is that the chicken did not come with a side of radish. All KFC(korean fried chicken) in Korea come with radish. Other than that, overall very good!", "pics": null}}, {"review": {"des": "I'm a big chicken wings guy. I love me some spicy wings, smoked wings, Korean wings... yum. So this was a must stop. While I much prefer my wings separated into drums and flats the fact that these are served attached (3 part) didn't deter me. I dug right in. We ordered hot wings, BBQ, and Seoul sassy. My favorites were the hot which we could have (should have) ordered extra spicy. I like em hot. But the wings are big and meaty  <br><br>The place is popular so it's so crowded. Packed. And it's not the cleanest. You can imagine people sucking on wing bones making a sticky mess on the table. No one is cleaning up the tables so you sit down as soon as someone gets up to take that hard to get spot and you have crap all over the table. I have stains on my sleeve to prove it. <br><br>While the wings are very good, I'd consider this a takeout only place. Not the best I've ever had but certainly a good choice if you're craving wings.", "pics": null}}, {"review": {"des": "Had lunch here and everything was delicious! I had the bad boy bowl, which is basically Korean rice bowl topped with veggies. Very tasty together with the Buddha sauce and the portion was very big! I like the radish topping a lot since it has this crunchy texture and add some refreshing sour flavor to the rice bowl. Also we had the fried whole wings with sweet soy sauce and spicy bbq sauce, delicious. Covered in sauce but still crispy outside and juicy and tender inside make great fried chicken.  The taste of the sauces were also very good, so far the best Korean fried chicken I've had in Chicago. Worth a visit!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LYiBL2oLTQTGopyA9AtReg/168s.jpg", "caption": "The rice bowl selection"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GMyo4PFzHP36UUEAKhItqg/168s.jpg", "caption": "Bad boy, baby Buddha, 5 fires whole wings w/ the two signature sauces"}]}}, {"review": {"des": "I don't understand the hype.<br><br>Well I do. The wings are enormous, there's a variety of unique flavors, and vegetarian options as well. <br><br>But....<br>the wings aren't that good. The skin is thin and the meat lacks juiciness. I enjoyed the flavor but was bored eating them after 2 bites. I want crunch, I want depth, I want to be taken on a magical chicken carpet ride.<br><br>None of this happened and I was sadly disappointed.", "pics": null}}, {"review": {"des": "Love this place! I always get the Seoul Steak bowl with the Seoul sassy sauce. Let me tell you the flavors that come in that bowl are phenomenal. It's rice, steak and scallions. Don't really need anything else. It's not too heavy on the stomach. Nice fresh meal. The popular bowl is the Buddha but I haven't tried that one yet. I can't leave the Seoul Steak bowl alone.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xvgLoiAJ5C2z9bOtZzxNuQ/348s.jpg", "caption": "Seoul Steak w/Seoul sassy on the side"}]}}, {"review": {"des": "Quite possibly the best chicken wings I have ever had in my life. Everything about the wings were absolutely perfect. They were smaller than the monstrosities that Dak serves, but larger than the weenies that Buffalo Wild Wings or Wing Stop gives. Also unlike Del Seoul, there were no broken bones (a big pet peeve of mine) in any of the wings.<br><br>Something that I was not expecting was the environment of the restaurant. It was quite literally a hole in the wall. When we got there, all of the communal style tables were completely full. Thankfully, the turn around time for tables were quite fast and we were able to seat ourselves after a few minutes of waiting. The wings were also prepared super quickly (it only took around five minutes after I ordered for them to call my name).", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/o9DE9DSmkiRUno7cGQ-5-Q/348s.jpg", "caption": "The crowded mess that is the interior of Crisp on a Saturday night."}]}}, {"review": {"des": "Overall, had an okay experience. <br><br>Was visiting Chicago and saw this place on yelp. I thought I should definitely pay them a visit and see what the hype is about. <br><br>This place gets packed fassssst. Plan your trip accordingly. <br><br>When I arrived around 3PM, they sold out of their whole chickens, so we opted for tenders instead. We ordered tenders in Seoul Sassy and Crisp BBQ. It was okay but if you're traveling from CA, you can definitely find similar (if not better) KFC in the Bay Area or LA. They're good, full of flavor, but not memorable (in my opinion). And as a girl who loves chicken, I personally wasn't dying for more.", "pics": null}}, {"review": {"des": "4/5 solid!!<br><br>Writing this mostly for myself, but you're welcome to read. This was tasty and worth tucking into the window seat for. Ain't no shame ordering both the rice bowl and the wings, because you will eat it all. And people are staring bc jealousy. #iamwinning<br><br>I can't imagine this place during weekend/dinner rush hour, but i went at a random time so I ordered, found a seat, and was eating shortly after. And man, when you are set you kinda just keep going. I can't do heat and admittedly got the #meatsweats early on. But i was determined to just eat all of it, even if i was going to the beach because the beach will take whatever beach body i give it, even if they can make out chicken wing indentations in my belly.<br><br>I digress. This was super yummy, and I'd come back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WJjwOv0pO8NNI-ArrJS56w/168s.jpg", "caption": "ate it"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KtHGhgW8WX3GvyUz8hGApg/168s.jpg", "caption": "yep"}]}}, {"review": {"des": "My friends in Chicago raved about this place. The line was long so all of the warning signs that it was good were there. I was basically outside talking to a guy in the line who said, \"Oh, you've never been here before!? It's so good.\" It's chicken I thought. It's hard to mess up, easy to make good, and slightly more difficult to make stand out in memory. <br><br>Crisp, is such a good name. The name captured the essence of the brand. They serve good, hot, crispy chicken wings. I didn't look at the menu as it was basically all chicken wings so I asked for Lemon Pepper. You know, the standard that most black people try at wing restaurants, partially thanks to Ricky Rose'. \"Sir, we don't carry Lem'n Pepa\" the cashier stammered back. I looked puzzled and then glanced at the menu. \"Well, I'm visiting so whats popular?\", I asked in a surprised voice. Very rare, in my opinion, for a wing place not to have that flavor.<br><br>I found out that day that Chicago is big on overfeeding. The portions, the quantity are both just stupid big. These chickens were either eating gun powder and lifting weights or were given Roids, probably both. The wings were ginormous. We ordered a variety of flavors to include BBQ, Plain, and some type of sesame-yaki. All were delis and the sauces on the community tables were even better as an additional topping. All in all, I put down about 5-6 wings and I was done.", "pics": null}}, {"review": {"des": "Great overall experience, a really nice vibe to the restaurant. The food, for me, was ok. If I need to host a game night I'd come here for catering the bar food... that's it.<br><br>They stay busy though, so I'm sure lots of other ppl love this place.", "pics": null}}, {"review": {"des": "Years ago when I was a wee 25 year old living in Wrigleyville my then roommate asked if I wanted Crisp. I heard so many great things that I agreed and we ordered delivery. I didn't think the wings would sit well so rather than order their infamous wings I ordered the burrito. It did not live up to the hype so since then I was not intrigued to go back. <br><br>Fast forward to two weeks ago and decided to go and get the wings. WOWW! I regret ordering delivery that one day cause their wings are mouthgasmic. Wings are nice and big, skin is crispy yet not too crispy, and the sauces are delicious. We all make mistakes at some point in our lives and that fateful day in Wrigleyville was one of them. That is why I continue to not believe in delivery, except for pizza. <br><br>Go here! Wings are awesome.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3fZYVjIIkpMWwKDvN49bKg/168s.jpg", "caption": "The hottest of hot!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Nfif3PiAdmcPSfyameTcng/168s.jpg", "caption": "Seoul sasssyy"}]}}]}