{"name": "cumin-chicago", "reviews": [{"review": {"des": "So I thought I would never find a place as good as my favorite Indian spot in New York called masalas I loved that place but we no longer live in queens, New York . So I have to discover new places to eat in chicago . And this my friend comes close . It's delicious the best places to eat are those cute little holes on the wall ,it's always packed so go a little before 6pm but if you go after you can make reservations .. the food is full of flavor my favorite , chicken tikka masala and so many other dishes that were delicious , heeey that rhymes !! <br><br>let's be real you know is good when you see Indian people eating food that they can make just as good in their own home  . FYI  the side dishes are ala carte so it maybe on the pricey side but hey if you think it won't break your wallet go for it .. enjoy it . And say namaste , apka se ho ?", "pics": null}}, {"review": {"des": "Overall: this place lacks quality, customer service, and almost all the aspects of a good dining experience!  <br><br>If you rarely eat Indian food, you may find the food to be excellent because this area lacks descent Indian restaurants.  <br><br>However, if you are an Indian person or someone who enjoys Indian food on a routine basis please avoid this shithole. <br><br>The place is managed by cheap labor.  I am ashamed to go these Indian restaurants where the owner hires kids straight from India! There were two servers for almost 15+ tables. I blame the cheap owner who is trying to make profit by overworking two Indian boys who can barely keep up with the workload. <br><br>We ordered samosas, garlic naan, paneer tikka, and veggie biryani. Samosas were generic, naan was served cold, paneer tikka includes more green peppers than paneer, and the veggie biryani was served cold with warm potatoes and burnt onions.  It was probably microwaved. It took little over 10 mins to get the samosas but over almost 50+ mins for the main course. It's definitely overpriced as well!  <br><br>The restaurant thrives on those who rarely eat Indian food and probably those who do take outs or deliveries.", "pics": null}}, {"review": {"des": "Excellent!<br><br>-Food: authentic Indian food, taste like heaven!<br>-Service: this restaurant is hosted by great, nice and kind Indian people, their food reflects their rich culture (which is everything!), religion and carefulness. <br><br>Nonetheless I arrived at closing time, I loved and appreciated that they let me in, gave me time to order my food and - the most important part - to eat it!<br><br>Highly recommended!", "pics": null}}, {"review": {"des": "I'm probably being unfair to this restaurant after eating here only a few days after returning from India, but the paneer tikka masala tasted tremendously bland and sweet. The lamb madras, however, was on point! Great flavors and a dish that could have easily been found in a restaurant in northern India. Staff was nice and the ambiance was casual but slightly business casual.", "pics": null}}, {"review": {"des": "Authentic Indian food. Nice ambience and good service. The food we had reminded us of the campus restaurant back at IIT Kanpur, India. Surprisingly, favorites of each one of us was available on the menu. The kiddo enjoyed the papad as well: a relatively rarely occurring event.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VyAR7LZlAsSwvcFpwsQRgA/168s.jpg", "caption": "Flavors of India @ Cumin"}]}}, {"review": {"des": "I was really craving some Indian food and I'm so glad we were able to stumble upon Cumin in the Wicker Park neighborhood. As you walk in, you are welcomed by the wonderful aroma of Indian spices and got me really excited to try the food. I opted for the Shrimp Vindaalu, spicy dish that contains shrimp and potato cubes cooked in Indian spices and hot tangy-curry sauce. The dish was very delicious! It had the perfect spice and also a hint of garlic flavor paired with a side of garlic naan. I am planning to come back and try more of their flavorful dishes! Great quality of food, clean facility, and decent prices, it's another great Indian restaurant find in Chicago!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-dXUrmaEf_8QnEsvuJiFog/348s.jpg", "caption": "Delicious!"}]}}, {"review": {"des": "Online it says that gift cards are available for Cumin. I drove 30 mins to buy one for Christmas for my boyfriend and when I got there the two people working had no idea how to process a gift card or what to do and told me to come back when the manager is in... I will not be driving another 30 minutes to a restaurant that has no idea what they're doing.", "pics": null}}, {"review": {"des": "I've never seen a restaurant get so much foot traffic before for both dining in and to-go orders. There is a reason why this is everyone's weekend fix. I've been here three times and each time I've left fully satisfied and thinking of the leftovers I can have the next day. <br><br>It is on the pricier side, but I think you essentially get two meals out of it so it's worth it. I tend to like my food to be on the spicier side so the chicken vindaloo is always an option. If you are looking to get something a little bit on the healthier side with some greens I'd suggest the chicken saag. And you can easily make that option vegetarian by opting for their saag paneer instead. You do have to order all the sides separately. None of the dishes come with rice or naan. I'd say its worth the trip especially on a windy, rainy day in Chicago.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XMrBtanI-oDFh0aKxZzdVQ/348s.jpg", "caption": "Anytime I go to Chicago I bring my friends here. Hands down best Indian food I've ever had"}]}}, {"review": {"des": "This is the only Indian restaurant I've tried so far in Chicago and I've got to say I'm really glad I went. <br><br>For the appetizer, I would highly recommend the chicken momo which are Nepalese dumplings. Great flavors and I really enjoyed the chewy texture of the dumpling skin itself. <br><br>For the entrees, we ordered the chicken masala and lamb vindaloo. Really glad I got this combination where the former was creamy and the latter was spicy. Both had great flavor and spices. The curry texture is a bit on the thicker side. In terms of price, it is a bit more expensive than I've usually paid for Indian food but not surprised because of its location in Wicker Park. If you're not a fan of spicy, opt for the chicken masala.<br><br>Food: 4/5<br>Service: 4/5<br>Atmosphere: 3.5/5", "pics": null}}, {"review": {"des": "i ordered in a veggie entree with a side of roti for a late night dinner. the veggie entree was a soup of sorts that paired well with the roti for dipping. nothing to crazy, but classic flavors. it was a little pricey in my opinion for just this. i would like to go back for the buffet in the future.", "pics": null}}, {"review": {"des": "Mix of veg/non veg items but limited. Lamb curry and chicken tikka is worth mentioning. Rice pudding and salad were the least favorite. Their butter naan which are served to order were very crisp, hot and tasty which made the whole day experience better. Overall wish they had more variety or items. Great ambience, polite and friendly. Parking spots available.", "pics": null}}, {"review": {"des": "I stumbled upon this spot on a rainy day.  They had a lunch buffet which looked pretty good but I had my heart set on trying the dumplings and they let me order off the real menu.  The dumplings were absolutely worth the wait and skipping the buffet.  I also got a biryani entree which wasn't that over whelming but was affordable and a good entree to satisfy my lunch hunger.  I'd like to return for dinner and try some of the other unique dishes listed.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3sO4tB1HwUkwBZGYDkgA5Q/168s.jpg", "caption": "Nepalese dumplings"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oGY3Xl-8rPQykZ3ur7ze3g/168s.jpg", "caption": "Chicken Biryani"}]}}, {"review": {"des": "A decent buffet lunch is served here. There are a small number of vegetarian items plus chicken and goat--all were tasty. The naan was terrific, crispy, hot and buttery in taste. It's made to order and brought to your table. <br><br>There were some misses too--the \"salad\" is tasteless iceberg lettuce, the raita had no flavor, and the rice \"pudding\" was watery milk with some rice thrown in. No matter, avoid those items and you will be fine. Plus service was very friendly. Not worth a trip, but OK if you are in the neighborhood.", "pics": null}}, {"review": {"des": "Indian food is one of my favorite types of cuisines so I am always in search of delicious Indian food in the West part of Chicago since Devon is a hike.  I've been to Cumin a few times and it's never disappointing.  I like that there is a lot of space here and it has a romantic, intimate ambience.  The service is decent and they are great with the water refills.  I felt a little rushed when they were taking plates away but the overall service was decent.  I would have liked if they asked us what level of spice we wanted since we both like spicy food and our meal could have been spicier.  <br><br>I appreciated that they give you a complementary order of poppadom (crispy, fried lentil wafers) served with a mint and tamarind chutney.  It was crispy and plentiful!  We started with an order of the Samosa Chaat and it was very delicious!  Basically, the chaat part consisted of boiled chickpeas a little raita, tamarind-mint chutney served over crispy, flavorful samosas.  It was a rainbow of colors and flavors!<br><br>For our entrees, we ordered the Palak Paneer and Baingan Bartha with a side of basmati rice and garlic naan.  Their portions were generous and filling.  The palak paneer was tasty, had thick spinach and paneer, and a great texture.  I would have liked for the sauce to be more flavorful/spicy but this tasted good overall.  It was a creamier version of palak paneer than what's served at some other Indian restaurants in the area.  <br><br>The Baingan Bartha was my favorite.  It was minced, roasted eggplant with tomatoes, onions, ginger, and a creamy but not thick sauce.  The eggplant tasted fresh and the ginger complemented the eggplant flavor very well.  The spices were blended perfectly with the vegetables making it a medium-spicy flavored dish.  <br><br>The garlic naan and rice were good.  I would have liked if the naan had more garlic but that's just my preference because I love garlic.  Overall, this was a great dining experience and I look forward to the next time I am here and trying their other dishes.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/j3Y_sc238nQbNzdjZ109TA/348s.jpg", "caption": "Garlic naan"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sXzVZ_OIZ8-2-_jVGYapUQ/168s.jpg", "caption": "Baingan Bartha"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/K_4tEiqTkj7yejn1wsaa_Q/168s.jpg", "caption": "Samosa Chaat"}]}}, {"review": {"des": "Consistently great food and fast delivery. Highly recommended. Some of the best Indian food I've had.", "pics": null}}, {"review": {"des": "Wait time : we did rsvp, but not crowded for Friday night <br>Service : friendly, but not very informative <br>Food : dumpling was worth to try, Chinese style with Indian taste. Garlic nan was good too. Chicken tikka masala is so so, not that flavorful <br>Drink : didn't try. Just order wine. <br>Overall : not that expensive and it's good for hang out and chat. A quiet place for Indian food.", "pics": null}}, {"review": {"des": "I had really high hopes for cumin and being told it was some of the best Indian food in Chicago. I will say the food itself wasn't bad by any means; in fact, everything I tried was pretty legit. But it was nothing that blew me away and the experience we had trying to get the order and the bill taken care of almost made it tough to justify. <br><br>Despite the staff being friendly and fairly attentive, the food came out incredibly slowly and it was a struggle helping our friend with food allergies find a meal that worked for him. After having to switch his meal up post miscommunication with the waiter, he was still charged for both and both were brought out to be served. In the end it was all resolved, but it was a tedious process to do so. <br><br>The garlic naan was great, and the chicken tikka masala was also pretty solid. Everyone enjoyed heir meals, but for the length of time it took for our food to come out on top of the confusion with the bill, I'm not sure I'm dying to return. I would definitely recommend giving it a shot if you're craving Indian and in the wicker area, the food is pretty good; just be prepared to be there for an extended period of time since no one seems to be moving with a sense of much urgency here.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/q9n65eEsH1F3ywxGTGym4w/348s.jpg", "caption": "Chicken tikka masala"}]}}, {"review": {"des": "Went here about a week ago for dinner on a Saturday night. Other than slow service, place was amazing. <br><br>Came in on a Saturday evening about 6:30 and the place was surprisingly empty (maybe 6-7 other tables). After waiting a few minutes, ordered the butter chicken, basmati rice, and the naan. All of the above were great...flavorful and plentiful. The quantity was great and the heat could have been a little more, but nothing to really complain about. <br><br>Great atmosphere and is obviously in the heart of Wicker Park and all the hustle a d bustle and of people watching to enjoy.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qqBnsO5_yB98jZV9kYYNNw/168s.jpg", "caption": "Butter chicken, basmati rice, and naan"}]}}, {"review": {"des": "So the food here was very tasty. Unfortunately, it had some other issues. On a not very busy Friday evening, the food took an hour and a half to come out. This is without anything unusual being ordered (everyone got some kind of curry). <br><br>In addition, they charge extra for rice. What's up with that? Who eats curry without rice?", "pics": null}}, {"review": {"des": "We stopped here after Easter for the lunch buffet! The food was pretty tasty, but the selection felt small compared to other Indian buffets that I've been to. There wasn't any saag, which I was sad about. There were two chicken dishes as well as a hardboiled egg one that I'd never tried before. The tandoori chicken was pretty good! It also felt kind of pricey for what it was ($15 per person, ended up being more with tax & tip). <br><br>They did have really yummy mango mousse and even an Easter cake for the holiday, which was a nice touch.", "pics": null}}, {"review": {"des": "My favorite thing about this place was their service. That's not to say their food isn't excellent but the waiter we had was incredibly kind. Consistently, he tended to us and made sure we were enjoying our time.<br><br>I came with my best friend and we shared the garlic naan, chicken tikka, palaak paneer and the dumplings appetizer. The dumplings weren't my favorite. They can out a little cold. But everything else was fantastic. I really liked the palaak paneer mixed with the tikka on top of the garlic naan.<br><br>The ambiance is pretty standard for an Indian restaurant. Not really trendy to trying too hard. It's not somewhere to take someone if you're trying to impress them with ambiance but it if you're looking for a reliable Indian/Nepalese joint it'll do.", "pics": null}}, {"review": {"des": "I really enjoyed eating here. I came with a group for dinner and we ordered three appetizers and four entrees to be shared by the group. The service was good and the waitress was very helpful in describing the food and what we should try. We had a funny moment when one member of the group was asking about how hot the food was. He asked the waitress on a scale of 1-10 what he should get if he liked hot food. She called him out and said her 4 would be a 8 for him. Turns out her 4 was not hot at all. Anyway all the food was served hot and was very fresh I don't think you can go wrong here.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7LTCGfdMBYGm-Edn1xnLHw/168s.jpg", "caption": "I like this very mild, bland beer with Indian food"}]}}, {"review": {"des": "I would definitely give this place five stars if they had a draft beer. <br><br>The food and service certainly deserve five stars. I have been here a few times and the food was always absolutely amazing and pricing very reasonable. They have so many amazing vegetarian options that I always struggle with what to order. Their buffet it's also amazing and only $15 per person. However, vegetarians have much more to choose from than meat eaters, but then again - unlimited delicious and healthy food for only $15? Definitely worth it! At their buffet, they also have bunch of fresh veggies and two different dessert options if you manage to save some space when eating all their delicious food. <br><br>This place is really good for coming with a group or children. <br><br>Outstanding customer service!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AmS46rGvGl1B6sRdt5hZFQ/348s.jpg", "caption": "Buffet options"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mppWW71khYkCBLrYAEcJ9A/168s.jpg", "caption": "Buffet options"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NPKGJ96Dup3PDDj6nlQZcQ/168s.jpg", "caption": "Buffet options"}]}}, {"review": {"des": "I love this place - great curry spot for those of us on the west side and far from Devon! I'm a semi-regular here and I frequently bring visiting friends/family here. It gets busy on weekends - for good reason, because it's delicious food at a reasonable price, but they have good systems in place for keeping things moving, getting everyone seated and fed with amazing curry. It's also a great spot to catch up with a friend during the weeknights when it's less crowded.", "pics": null}}, {"review": {"des": "Cumin is a fine restaurant with delightful experience offered to all who step inside. The spices are flowing throughout the air and the aromas transport one to Nepal or India or both. <br><br>With a large menu that is including many vegetarian and meat centered dishes, the hints of cumin, turmeric, clove, anise, garlic, curries and more will delight your every sense. The nose will guide your way to the dish your heart desires. As a visitor to Chicago, I went out of my way to locate and visit Cumin. I am pleased I did.  Service was friendly and accommodating.  Full bar is offered with beer and wine and liquor. The environment is casual but there is room for a larger group as well. This would be a fine choice for solo diner. Date. Business or family meal.  <br><br>Palak paneer over basmati rice and onion kulcha on side is below.", "pics": null}}, {"review": {"des": "Really like the Momos, the ambience is nice, great for date night. The main course is meh, I recommend skipping it and going elsewhere. The service is great", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Aea7cDndhD6W_lzyvoPuvw/348s.jpg", "caption": "Mango cocktail (couldn't taste the vodka at all but nevertheless tasty)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LN3VjQGPoELVn_lhIf9WDA/168s.jpg", "caption": "Momo's yay (best in Chicago that I have had so far)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MRxs2Njl036Zknsl8rKHuw/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "What a wonderful restaurant. The dining experience is top notch from service, to decor to food. If you don't like a lot of heat, ask for mild. I enjoy all the dishes here but don't miss the Momo.", "pics": null}}, {"review": {"des": "I went with a friend around 8pm on a Monday so it wasn't super crowded. The service was great; everyone was hospitable and friendly. The Goat Chhoela was by far the best thing we order that night. The meat was cooked perfectly and the sauce it was in was amazing. We also had the lamb saag and vegetable mix. I would say those were alright. However, I still had a great time and I will definitely be returning for the Goat Chhoela.", "pics": null}}, {"review": {"des": "Kicking myself for not coming here sooner. We ordered a bunch of vegetarian dishes, samosa, and tandoori chicken. Note: when they ask how many pieces of chicken you want, they mean huge chunks - it was a lot of chicken!<br><br>Anyway, the food was delicious; the only reason I'm giving 4 stars is because their service was pretty slow, and this super obnoxious ring tone kept going off - like, for at least three minutes nonstop at one point. It was supremely annoying. Oh well. <br><br>Definitely try Cumin (for the food) ASAP!!", "pics": null}}, {"review": {"des": "Literally the worst Indian food I've ever had. Chicago seems to be notorious for having terrible Indian food, it's a shame that despite having a large Indian diaspora it doesn't even have a handful of decent Indian restaurants. <br><br>I was excited to try Cumin due to all the great reviews I read and it's even featured in the Michelin guide. We went to dinner around 8:00 and started with the mixed pakora and chicken momo's. The pakora's honestly the only good thing about the night. They were hot and crispy. <br><br>Sadly the momo's were dry, bland, and not properly steamed, it felt like I was chewing on a raw dumping. The chicken inside was dry and lacked flavor. <br><br>For the main course we got chicken tikka masala and Chana masala. AVOID THE CHANNA MASALA AT ALL COSTS ! The gravy was watery and the color was a light yellow. It once again tasted bland, and felt more like a soup then a curry. I don't know who in their right mind would call that dish channa masala <br><br>The chicken tikka masala sauce was once again very runny, even when I mixed it with rice ,it felt like I added rice to my soup. The chicken tikka pieces in the sauce were over cooked and lacked flavor. The garlic nan was the only saving grace to the entree's it was warm and fresh. <br><br>Michelin guide should re-evaluate this place, it doesn't live up to the exceptions placed on it. I would not recommend this place to anyone. Dinner was a complete disappointment", "pics": null}}, {"review": {"des": "Wonderful Indian food with flavorful spices. Large portions and great variety! They have good vegetarian and vegan options. The service is good also. We got the lentils, saag paneer, vegetable korma, and lamb korma with peas rice!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZX0kWbuSvPf7E70wR6pk7g/348s.jpg", "caption": "Food"}]}}, {"review": {"des": "Trash would be better. Went for a buffet. Guess what? everything canned. I am already feeling sick after eating there. I hate when someone try's to mess with our Indian culture.<br>I complaint to the waiter and he started arguing with me so bad. All I told him the milk in the desert was burnt.<br>I am not trying to bad mouth this restaurant but want them to improve their quality and get away from canned foods that they are serving their customers. Upon further questioning I learnt from the manager\" it's too much work to cut up fresh food ever day and help is hard to find\" really!!!<br>Take your decision accordingly.", "pics": null}}, {"review": {"des": "This place is just ok for the price. The service is mediocre and the food is pretty bland. I had the chicken vindaloo which had some heat but was missing some depth in flavor. The samosas were ok but I've had better. The ambiance here is non existent. The place needs a facelift and the food was just ok. I wouldn't come back.", "pics": null}}, {"review": {"des": "We were in Wicker Park for a nearby event and were looking forward to what looked to be really solid (based on other reviews) Indian food, super conveniently located. <br><br>Nothing was bad. My cocktail was nice, service was attentive, if a little harried (I don't blame them as it was 45 mins before closing and they probably were looking toward wrapping things up). <br><br>Nothing was great, either. Samosas were fine--not overcooked on the outside which was great. I appreciated that they were willing to do a veg tandoori dish for me even though it wasn't on the current menu...I know special requests at any restaurant are sort of \"at your own risk,\" so it's maybe on me that this dish was markedly just okay. Portion was pretty small--2 potato wedges, 3 or (reasonably large, though) cauliflower florets, a broccoli floret, and some assorted onion/pepper slices. Much spicier than I've had at other Indian places. Raita helped.<br><br>Husband's chicken tikka was okay. Looked okay, tasted okay. Like your basic Indian takeout.<br><br>All in all, everything was just okay. Underwhelming after what we'd heard about the place, but no harm done--well, a little indigestion overnight, I suppose...", "pics": null}}, {"review": {"des": "As far as I'm concerned all Indian food is good food - it's kind of hard to go wrong with Indian food. So this place had to be good, right? It was :)<br><br>Had the lunch buffet. The selection was standard, the quality was expected and the price was reasonable.", "pics": null}}, {"review": {"des": "Simply Amazing. You can smell the spices from around the corner. Cumin is by far one of the best places in Chicago for take-out. The flavors are incredibly full-bodied and earthy. Something about the food is very familiar. It reminds me of the most pleasant childhood memories.  The service is great! They have some of the friendliest people I've ever been serviced by. The warm and inviting staff have made my husband and I regulars. <br>We order the pokhareli kukhura, the chicken momo, and the gorkhali khasi every time we eat there. Each dish is unique, delightful,l and fun! I also recommend the pakora aalu tikka. I've decided that I eat this cuisine multiple times a week. I'm looking forward to trying other dishes on the menu.", "pics": null}}, {"review": {"des": "Definitely a staple for Indian food in Chicago. Their dishes are always quality and flavors always well developed and deeper than most. Their spices come together for some of the greatest blends i've probably ever had, even better than a lot of the restaurants i've gone to on Devon St. up north.<br><br>I will say that Cumin does tend to get busier and their service does suffer quite a bit sometimes, however. But that doesn't mean that their food is any less fantastic. I absolutely love this place and would come here any day of the week.", "pics": null}}, {"review": {"des": "I was visiting my son and his family from SF, and we chose to go to Cumin for Mothers Day lunch, out of all the restaurants in Chicago. It was a very special occasion, since I have not spent Mothers Day with my son in many many years. We were a party of 6, very happy and excited about celebrating.<br><br>The food was OK. A few dishes were just warm, a few cold. Maybe the burners were not working? Don't know what the issue was. The desserts were OK, not great. Gulab jamuns were dense and cold.<br><br>When I called to give feedback and spoke to the Manager, all he said was thank you for the feedback, we'll make sure it does not happen again. That's it!<br><br>Very disappointed with the food and the response I got.<br><br>Do you think we will want to go back there again?", "pics": null}}, {"review": {"des": "Went here for date night with the lady and came in with high expectations given the mostly positive reviews. We came in on a Saturday night so we expected a busy night. But despite having reservations already, we still had to wait 40 minutes. Yes, you read that right. 40 minutes with reservations. <br><br>This is the type of place that will take reservations just to have a guaranteed rush but there's slim to no chance that the tables will actually be ready. About a dozen people (who all have reservations) were waiting at the front for their tables. This is absolutely unacceptable. If you don't have tables ready within 10 minutes of the reservation time, just don't accept reservations! <br><br>Food was decently flavorful and well cooked for the most part. But the boneless chicken makhani has a bone in it. Naturally, I brought to the hosts attention after the service. And I use that term very loosely. The waitress was just totally overwhelmed with the rush and didn't come to check on us a single time.<br><br>Made this atrocious service known to the host and he at least had the common sense and decency to not charge us for the chicken.<br><br>Don't think I'll ever come back - at least not a weekend night. Be prepared for terrible service but decent inauthentic Indian food.", "pics": null}}, {"review": {"des": "Visited this spot on a Tuesday night for dinner with friends. Overall, I recommend the spot and would return.<br><br>Atmosphere: Casual, the place was not very busy so we were seated after a few minutes. A good spot for groups as well.<br><br>Service: It did take a while to get seated because they seemed to have an issue with their generator but I assume that's an anomaly. Their system was down so the waiter had us wait a bit before we ordered. Regardless, after the ordeal was sorted out our server was very friendly.<br><br>Food: As you will see in other reviews it is a little pricey for Indian food but won't break the wallet. Entrees ranged from $15-$20 but dishes like the biryani are large (enough for two). We ordered the lam biryani, the chicken tikka masala, basmati rice, the chicken in tandoor, and garlic naan. Overall very delicious. The biryani was great and flavorful. I will say my chicken tikka was not amazing and I'd probably order biryani next time. The naan was delicious! Definitely good portions for sharing.<br><br>Bottom line: I will be back, the food was good as was the service.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VGUjGH6DtBptAmrzlPMyXg/168s.jpg", "caption": "The chicken tikka and basmati rice"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Sj3Bbrbw_l49GrmtN_PAww/168s.jpg", "caption": "The lamb biryani! Very flavorful and also a good portion."}]}}, {"review": {"des": "So my boss is Indian, I mention Cumin to her, she scoffs and tells me to visit Devon. I did, and a couple downtown spots too. Cumin is still my favorite restaurant for Indian cuisine. Can't deny the shrimp saag on every visit.<br><br>I've been coming here for years. In fact, it was my first try of Indian food which became one of my favorite food cultures.So thanks Cumin, you never disappoint.", "pics": null}}, {"review": {"des": "Oh man. This was good. We had several Chicago Indian recs given to us. Cumin was closest to our Airbnb so we decided on it. We first arrived around noon and the place was empty but it began to fill quickly over the lunch hour. While the buffet options looked delicious, I was really craving korma so we decided to order from the menu. Our pakora was nicely fried. The samosas had a wonderful crust and delicious filling and Our korma hit the spot nicely. I think the owner could tell that the vindaloo was a bit more spicy than we had anticipated (due to the gallons of water I was drinking) and offered us a complimentary yogurt drink. Overall, this was a great stop!", "pics": null}}, {"review": {"des": "Growing up eating Indian food  I feel this is the closest thing to home cooked Indian food in the area. Amazing flavors and spice and def recommend the paneer dishes. The prices a bit much for the area but location is great with plenty of seating. They do take reservations and have a full bar selection. As with most Asian restaurants the wait staff is a bit slower and not as attentive or a bit pushy at times. But the food def makes up for it and a must go.", "pics": null}}, {"review": {"des": "Why didn't I find this awesome Indian lunch buffet place near Logan square before!! Simple but tasty spread. Loved their lunch buffet . Would have loved some gulaab jamuns too ;), but that's the sweet tooth in me talking . If you like lunch buffet on a lazy rainy weekend like me then this is the right place.", "pics": null}}, {"review": {"des": "We visited this place for a weekend buffet but I would say it disappointed me. There was a lack of  options for $15 buffet. Also, food lacked flavors or it was too bland for me, especially tandoori chicken. Chicken Kadai and butter chicken were delicious, but none of the vegetarian dishes such as mushroom masala were not up to the mark. <br>I see a lot of good reviews by fellow yelpers, so I would be interested to try out this place for dinner some time.", "pics": null}}, {"review": {"des": "I brought my Indian family of 13 here to celebrate. Sadly we won't come back here as the food was mediocre. I mentioned \"Indian family\" above as that would be nice for our server to ask how we would like the Spice level to our food. Onions and lemon brought to the table is a standard for Indian restaurants. Service was horrible. They never asked us if everything was ok with the food. There are not many vegetarian choices on the menu. We will stick to our usual places for Indian food as this restaurant seems to cater to non-Indian individuals.", "pics": null}}, {"review": {"des": "How could you live in Wicker Park and not be tempted to drop in? You can smell the spices from a block away!<br>I've had four or five menu items by now and I've loved them all. They have a nice wine list to boot.", "pics": null}}, {"review": {"des": "I've been to this place 6 years ago at that time it was really good. My favorite was the goat appetizer, I really liked than but now I have a change of opinion. The meat was hard and difficult to chew, I was disappointed. In my opinion the food quality came down. The service is still the same friendly and welcoming staff.", "pics": null}}, {"review": {"des": "My brother in law's friend recommended this place and it was amazing!  Didn't know what to expect from Napalese Indian food but the flavors were a perfect blend.  The chicken chili appetizer was the right amount of spicy and the meat was so tender. We had the shrimp masala and chicken jalfriezi both of which were so flavorful and tender.  We were scrapped every last bit of sauce with our naan!", "pics": null}}, {"review": {"des": "Great Indian fare w lovely staff. Free refills on chai tea.  The food clearly has more attention in bright flavors than your typical Indian restaurant.", "pics": null}}, {"review": {"des": "Came here early on a Sunday before the Chris Rock show, we were binging on burgers and fried food all weekend and wanted something that would make us feel less disgusted with ourselves.  First the establishment is cute, seems to seat a decent about of people, from the other reviewers, you may want to make a reservation though.  We did not, but we also came in at like 6 on a Sunday and waited to be seated for a bit.  Was able to look over the table and see their reservation book pretty busy for a Sunday evening.  We started out with the Chaat...okay I did not like this, should have stuck with the regular samosas and rate that dish like a 2.5 stars because i didn't like how it was constructed.  They basically took a samosa that wasn't even warm, threw some chickpeas and cold yogurt on it and served it.  This could be my fault for not reading it, but for some reason I felt like it should have been warmer and some of the items should have been cooked in it.  The room temp or even cold temp of yogurt mixed with the samosa was a turn off. <br><br>Onto the entrees, this is where the meal redeems itself.  We ordered chicken tikka masala and an avaratan korma along with some garlic naan and basmati rice.   Everything was delicious, especially the garlic naan that comes out warm and just melts in your mouth.  Both dishes were really tasty with the right spices.  Only thing we should have done differently was asked for it a bit spicier.  I never know how spicy to ask for it sometimes because I've had times where it's too darn spicy where your taste buds stop working into the second bite and you're left eating without actually tasting your food.  I now know for next time how much heat to ask for.<br><br>We didn't leave a speck of food left and ate everything. Everyone was super nice, but it did take a bit of time to get our check after we were finished, but other than that and the disappointing appetizer (which I can totally overlook) this place is great!", "pics": null}}, {"review": {"des": "Cumin claims to be Nepalese, but honestly the menu seemed pretty much Indian other than the different spelling of the dishes. The music was surprisingly Top 40 hits, or something of the sort. The ambience is fine, nothing special, but definitely clean. Also, the prices ain't cheap for Indian food, even for NYC standards.<br><br>The korma was yum, so was the saag paneer. The goat was on point, and on bone. I've had spicier vindaluu, but still solid. The lentils were surprisingly great -- this is a huge win for Team Vegetarian. Unfortunately, my friend's chicken tikka masala was laughably bad. A bland, orange/red soup.<br><br>To be honest, it may just be that I have yet to explore Chicago's Indian food scene, but I can see myself coming back, especially if I'm in the neighborhood.", "pics": null}}, {"review": {"des": "Solid Indian food in pretty decent portions. On a Friday night, the place wasn't too packed and we were seated without a reservation. Between the two of us, we shared the Lamb Biryani, Chicken Makhani and some garlic naan. Simmered in rich tomato sauce, the chicken is tender, and the lamb biryani is stuffed with spice-marinated bone-in goat meat. The food is as tasty as many good Indian places I have been to, although it is on the pricier side. Service was quite slow but not that big of a deal if you are not in a hurry.", "pics": null}}, {"review": {"des": "This place has the best Indian food I've ever had. Im not Indian, nor do I claim to be an expert on Indian food, but I have been to numerous places serving it and no where has been as delicious as here.<br><br>The chicken jalfrezi is my go to entree. The chicken is so juicy, veggies are cooked perfectly, and the sauce is incredibly spiced. <br><br>Hands down love this place. Just make a reservation on weekends - its normally packed.", "pics": null}}, {"review": {"des": "I just recently moved to Chicago and I was so excited to see there were so many Nepali restaurants in the area, Cumin is hands down one of the best Indian places I've been to, I'm giving it 4 stars only because of their lack of Nepalese items on the menu. They only have about 3 Nepali items (momo, chwela, and Nepali style chicken) and everything else is Indian. I was a bit disappointed when I saw the menu but after I tried the food my taste buds definitely helped me get over that disappointment! I'm Nepali myself, and I swear that no one makes momo better than my mom but Cumin was so damn close, omg their chicken momo was so juicy and flavorful, the achar (dipping sauce) was just like nepal.. pure momo heaven! This is the first Indian place I've been to that doesn't serve their dishes with rice so we got the Kashmiri pulao, i highly recommend it! The basmati rice was on point and the peas, cashews, and raisins blended so well together. For those who don't like the heavy cream in the tikka masala, try the Nepali style bone in chicken.. it tasted just like home, the spices worked so well together and the meat was so tender! I'm going to ordering a lot of take out from here, keep up the good work guys!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/svusT6Td-uor-f04F6SYFw/348s.jpg", "caption": "Chicken momo"}]}}, {"review": {"des": "Honest review: make a reservation because it does get crowded. The portions are small n they dont put alot of meat in the entrees so id recommend ordering alot of food. There isnt alot of meat so u end up with alot of sauce the nan is good but not enough so u end up with alot of sauce id recommend either getting the unique rice that they have or if u wanna save money just eat the meat n take home the sauce n u could eat it at home. The best things were chicken madaras, the chicken masala, n the goat choela<br>The service was really good it was really busy n he still was very attentive. The ambiance is really pretty really nice inside kinda small though. I wanted to order desserts but they dont have anything that sounded good they sounded to plain they should fix that n put more meat! Plz comin back again<br><br>Lamb samosa: the lamb was really flavorful. You could taste all the spice in it so it wasn't bland. The lamb was tender nothing lacking in the lamb. The actual crust of the samosa was a little to hard but still good. What I disliked is there was no sauce. Anything fried needs a dipping sauce. I used the two sauced that u get with the chips it comes with greenery but plz dress it put something on it don't jus give me random greens that's a waste<br><br>Goat chhoela: this was really flavorful the lamb was nice and tender had a lot of delicious spices on it there was a lot of goat in this appetizer so it is filling. It comes with this crunchy side idk what it was but it added a nice needed crunch to the dish it really made the dish perfect I wish all the entrees had this crunchy stuff for some added texture. After u finish eating the goat and all that's left is the greenery u mix it with the leftover sauce n throw in all the crunchy stuff amaaizin! <br><br>Garlic nan: not ur store bought nan that is to thick its more like a flatbread. Its light and fluffy picture like thin crust pizza without cheese. If u dont like garlic dont get this its very heavy on the garlic picture like a really light garlic bread thats what it tastes like its really flavorful just be warned not alot come in an order so if u have alot of entrees ur shit out of luck<br><br>Chicken madras: the chicken was so tender it just melted in ur mouth. The actual chicken was really flavorful i could not stop eating. The only issue there isnt a lot of chicken like after a couple of bites ur left with a bunch of sauce. The sauce was phenomenal so much flavor. Its spicy but the coconut cuts down the richness and spicy ness it makes it perfect like i cant wait to come bakc to eat this again <br><br>Chicken tikka masala: omg so delicous!!! This was so flavorful so much depth of flavor. The chicken was so tender and not bland at all. the sauce was to die for i was literrly licking all the leftoever sauce from the bowl i liked it cause it was spicy like im comin back just for this<br><br>Chips: the chips were amaiazin! I couldnt stop eating them not greasy supper flavorful not stale or old. U could really taste the fennel flavor. The sauces were so good. It tastes better if u eat the chips with both sauces at the same time cause ones sweet n the other is acidic and spicy", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ID11klokPWXfmONq4_JvGA/348s.jpg", "caption": "$4:50 garlic naan"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tfsi2VuEOsXiqWydnBxY6Q/168s.jpg", "caption": "Billl"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jOvgT0XypxSKlceKCtpsfQ/168s.jpg", "caption": "Top is chicken tikka masala $15 bottom is chicken madras $15 both were amaizin!"}]}}, {"review": {"des": "LOVED IT! Only docked a star because I try to give 5 only to places that blow me away but this was awesome. Fiancée had chicken vindalu and I had chicken saag (I subbed their dark meat for white meat for $1 more - not on menu but they were willing when I asked!), plus garlic naan. No rice. Thank goodness we didn't have rice because we were stuffed with all that! This is not a quick place - the food took some time BUT I don't fault them whatsoever for that because it tasted made to ord r and was piping hot when delivered. The service was pretty good other than food taking a bit. The bathrooms were fine - I appreciated that there were four TP rolls to choose from in my stall lol. Lots of people were drinking a yellowish iced drink - perhaps a tea or smoothie? We just had water, but the wine list looked good too. With tax and tip, $47 for two full meals. I will definitely go back! This was some of my fave saag in town.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/klBjXP8Rj1poYimC-pplgg/168s.jpg", "caption": "Garlic naan"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BfruwqQmJzTPnhxazbsV0g/168s.jpg", "caption": "Chicken saag and chicken vindalu"}]}}, {"review": {"des": "We ordered about 35 dishes (almost everything on the menu) for 20 guests making the total bill about $500. We asked the manager if there is a possibility for a discount and he offered us a 5 dollar off coupon for the next meal which seriously offended us. Further the dishes were not labeled( we ordered take out) which conviniently allowed them to skip an item. All the items which finally came tasted all same with the same exact base only making few changes. Don't waste your time here. Go to other better restaurants around", "pics": null}}, {"review": {"des": "We visited cumin for dinner since we were staying in the neighborhood.<br>The food was great, the Nepali goat curry was perfect with all its spices. We also had paneer naan and raita.<br>The service was perfect and the ambience great too.<br>The quality of the food was great and if I were living in Chicago I'd keep going back there.", "pics": null}}, {"review": {"des": "Excellent Indian cuisine! The chicken tikka masala was perfectly cooked! The restaurant, itself, is very nice too. The service was good as well! I am definitely going back!", "pics": null}}, {"review": {"des": "Chicken tikka masala is PERFECT. Zero complaints. Really solid Indian food. Great staff too. Can't go wrong.", "pics": null}}, {"review": {"des": "Started off bad by a server who acted like we were bothering him for coming in. The plates appeared dirty as well.  Once seated, we got a mango lassi which was absolutely phenomenal. Probably the best I've ever had.<br><br>The plain naan was spot on. Chewy and has the right amount of crunch on the bottom. <br><br>The entrees were disappointing. Runny and flavor lacking. Indian is supposed to be about flavor euphoria and Cumin definitely missed the mark. <br><br>Chicken Tikka Masala (spicy) was flavor lacking and runny. The Palak Paneer was decent, but still lacking quite a bit in terms of seasonings.<br><br>Unfortunately not coming back. At $15 am entree, I expected lots more.", "pics": null}}, {"review": {"des": "This review is for delivery. The food was okay, like a b standard. The sauce were not as flavorful as you like, linda bland. We ordered chicken tills masala and chicken tandoori. The tandoori was better. Vege samosa was good. Overall we spent $50 and thought would be more flavorful. But it wasn't bad and it wasn't wow. Don't think we will order again", "pics": null}}, {"review": {"des": "Food is good, high quality, nice environment in the restaurant. One of my favorite places to eat out. Service is ok.", "pics": null}}, {"review": {"des": "This place is the worst.<br><br>I used to order from here, but stopped once I started receiving supposedly full orders that were like four pieces of chicken floating around in tasteless sauce. Today because the snowstorm has closed down the city, I was desperate, so I called, confirmed my info., and was told that they didn't deliver to my area. Really? I reminded them that I ordered from them all the time (proven by the fact that they had my info. in their system), and then they agreed but said they'd have to jack the delivery fee way up because this was a one-time favor. Seriously? No thanks. <br><br>We need more quality Indian food on the westside!!! Places like this can only operate this way because there aren't more", "pics": null}}, {"review": {"des": "This has to be one of the best places in Chicago to get Indian food. Everything was perfectly spiced and the portions where a good size. I'll definitely be hitting up Cumin again.<br><br>I recommend trying<br>*Chicken Madras<br>*Palak Paneer<br>*Chicken Momo", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2q6LXRMzmQ4ypUYMZr9vBQ/348s.jpg", "caption": "Palak Panner"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vAdxBRshx8TIUBIbBcygpw/168s.jpg", "caption": "Chicken Madras"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qL4Cre8vKtEMG1xj0GS4RQ/168s.jpg", "caption": "Basmati Rice"}]}}, {"review": {"des": "I had the lunch buffet for $15 and was very disappointed. The food lacked flavor. A plus for having plenty of vegetarian options. Unfortunately, they did not have samosas on the buffet menu.", "pics": null}}, {"review": {"des": "Zagat AND Michelin rated? <br><br>I took my Indian food obsession to this Indian & Nepalese space in Logan Square to see if the fluffy tire man was right. The restaurant boasts a trendy bar, traditional with a smidge of contemporary decor.<br><br> My friend and I got the buffet, which was like a Sophie's choice since stuff on the actual menu exceeded the $15 all-you-can-eat fare.<br><br>The fact that the buffet separated everything that was vegan and vegetarian away from the main dishes is something I heavily appreciate, having food restrictions myself. <br><br>TIKKA MASALA/PALAK PANEER: You could pair this sauce with chicken, tofu, or sedimentary rocks. I felt like I was embarking on the nine fold path, or ascending from the waves like Venus herself. <br><br>CURRY VEGETABLES/CHANA MASALA: Outlaw this dish honestly. <br><br>So come here if you want to take your tastebuds on a journey, throw away the menu, get the buffet.", "pics": null}}, {"review": {"des": "Vegan Review: buffet had only 2 vegan options. I opted to order from the menu which also had only 2 vegan options. The food was delicious, but pricey! And you have to order rice separately which was strange.  Staff was friendly and helpful.  I stopped at 3 stars just because of lack of vegan options compared to some other Indian restaurants and felt the price was a bit too high.", "pics": null}}, {"review": {"des": "The food was good, not great. Beyond that, the prices were on the high side, although not high enough to be egregious. The worst part, and the reason I will likely not return, is that our waiter completely forgot our order. After 45 minutes of waiting, I asked where our food was. Instead of confess that he had forgotten to put it in he made up an excuse and then proceeded to bring out the food 15 minutes later. We were not given so much as an apology, much less any discount on the meal.", "pics": null}}, {"review": {"des": "My boyfriend and I love Indian food! Living in the west loop our options are somewhat limited. It's nice to have places like Cumin that is somewhat close to home. We came in last Friday (9/30) right around the dinner hour. We didn't have a reservation and they weren't busy at the time we arrived, we were seated immediately. Upon sitting down we were greeted by our waiter who also brought us waters. <br><br>We started the night with an order of the Vegetable Samosas which comes with two pieces. As for Entrees my boyfriend ordered the Chicken Tikka Masala - Plain Rice - and an order of the Garlic Naan, I went with the Chana Masala and Plain Rice. <br><br>My boyfriend loved his dish, it's one of his favorites! The Garlic Naan was flavorful and his Chicken Tikka Masala hit all the right marks, and the level of spice was perfect! My dish was really great too and packed full of flavor! I love eating my Samosas as I eat my Entree, I just love mixing those flavors! The Vegetable Samosas are generously packed full of ingredients that go perfect with just about anything on their menu, you really can't go wrong with them!<br><br>Everything was great, the atmosphere, the food, the service, we couldn't have asked for more that evening. I do have only one complaint and unfortunately every time I've ordered I like to order my meals EXTRA SPICY, I often emphasize on the EXTRA, and my meals often come out as the standard level of spice with no spice adjustment. Maybe it's me, maybe they don't go 'Devon level of Extra Spicy'? I want that spice that will make me sweat!!! Regardless if they get my level of Spice Expectation right, I always love and enjoy my meal! I love Indian food!<br><br>I definitely recommend checking this place out! If you are looking to be slapped with flavor and leave stuffed, this is the place to be! Perfectly located if you are living in the city, no need to make a trip out to Devon! Cumin is perfect for a date, dinner with friends, whatever! Service is always nice, it can get a little loud in there which often makes it hard to understand the staff. Nevertheless, check this place out if you haven't and see why people like me keep coming back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SFJ3r7XMUVR14ssNWX8HCg/348s.jpg", "caption": "Perfect Dinner Date!"}]}}, {"review": {"des": "Of all the Indian food in the city, Cumin serves some of the best I've ever had. The samosas are huge and baked perfectly. All the vegetarian entrees I've had have been delicious. Beautiful atmosphere as well. Highly recommended!", "pics": null}}, {"review": {"des": "Had dinner at this place last night and it was fantastic!! I have not had much Indian food but everything we ordered was so flavorful I couldn't get enough! Chicken tikka was my favorite along with the veggie samosas! Also had a goat appertizer and a lamb entree which we loved a lot! Perfect amount of spices and heat. And the naan bread was great of course. Looks like they do a buffet for lunch or something, want to come back and try more new things!", "pics": null}}, {"review": {"des": "Lovely Indian curry but not the best I have had. Bathroom was clean. We had a lovely late lunch. I would say it is a first or second date restaurant.", "pics": null}}, {"review": {"des": "We were headed to our fave restaurant on Devon for lunch and realized it was closed. Cumin's menu, location, and reviews enticed us and we were not disappointed! The buffet was fresh and tasty, and the samosas were crispy and nice. Great spices and nothing was greasy. Some of the best naan I've ever had. Service was attentive and warm.", "pics": null}}, {"review": {"des": "Cumin's cuisine is easily 4-5 stars for me and I'd love to return for the food, but their waitstaff structure and high cost make it a place that I wouldn't go out of my way to do so.<br><br>Our main issue was with how slow service was and they weren't even that busy. It seemed like every time someone came to our table it was a different person; thus, we'd have a waiter drop off beer but they'd scurry off and not take our entrée order. When entrées did arrive, they were delivered by another waiter and other items were missing. We'd ask for something from someone else and wouldn't receive it, so we had to ask another person and then wait as they ran around to other tables that were also experiencing the same problems as we were.<br><br>3 of the 4 of us ordered beer and we also got 2 appetizers, A Mosaic Samosa (vegetable) and Chicken Momo, that were split into half a samosa and 2 momo per person. We then got an order of Garlic Naan that provided us with half a piece each. On top of that, we had 4 main dishes - Chicken Tikka Masala, Chicken Makhani / Butter Chicken, Shrimp Vindaloo and Navaratan Korma. It's à la carte here, so Basmati Rice was an additional $3 and the plate wasn't packed with rice. We had to order 2 to have enough for all of our dishes. It ended up coming out to about $25 for the person who had ordered her beer at the bar and $36 for the rest of us before tip was added on. I simply don't feel the amount of food we got was worth that much money since it was small portions of the appetizers and a couple scoops of each entrée.<br><br>I would suggest coming for their Lunch Buffet because the food was prepared very well, but it's costly if you come for dinner. I notice that price gap at a lot of Nepalese and Indian restaurants, so it's somewhat expected, but it seemed even more so at this one.", "pics": null}}, {"review": {"des": "Comfy, casual, quiet and quick.<br><br>Loved the atmosphere - it seems versatile for casual to date(ish).<br><br>Service was pretty good.  Food was relativey good.  But - overall, I just really liked the place and would like to go back, so they earned 4 stars!", "pics": null}}, {"review": {"des": "This place seems to have gone downhill since it opened years ago.  The first time I went with a large group I had a great experience and great food. As recently as late 2015, I still had a good experience, but I went yesterday for dinner on a Saturday night, and the experience wasn't that great.<br><br>I don't know if they've Americanized their Indian food, but all the food was very bland and not flavorful.  The appetizer was fine, but a little bland.  I didn't think anything bad, but when we got our three main dishes, all of them were not very good.  Very bland and not a lot of flavor.  I don't know what happened to the food.  We ordered three different naans.  They were hot and good though.  No problem there.<br><br>Also, the service wasn't that great.  Took a while to take our order and get our food.  After we got our appetizer and finished, no one came by to clear the table for a long time.  Finally after waiting a long time for the main dishes, I asked someone to clear the table.  A minor issue, but a sign of bad service.<br><br>Maybe a just bad experience or maybe a sign of a restaurant going downhill...", "pics": null}}, {"review": {"des": "Loved this place, ordered it out a week after I dined in, everything we had was delicious..chicken tikki masala, mango lassi, garlic naan", "pics": null}}, {"review": {"des": "Food was pretty good could have stood to be spicier. Waiters were a bit slow but still got the job done.", "pics": null}}, {"review": {"des": "I'll preface this by saying I LOVE Indian food, and have had a lot of it, in Chicago and in India. I came to Cumin on a Saturday for the lunch buffet and was immediately disappointed. First, the selection was 2 chicken entrees with about 4 sides, rice and naan. Okay, but definitely not as expansive as a lot of other buffets. This would have been perfectly fine if the food was great- but it was so lackluster. I've never experienced Indian food as bland before as was shocked due to the positive reviews on here. The friend I was with grew up in India and agreed it lacked flavor. The best item was the palak paneer, but nothing else lived up to Cumin's yelp reputation. It's possible their regular menu items are more flavorful, but after this experience I won't be back. I will say service was attentive but honestly it was the most underwhelming Indian food I've ever had.", "pics": null}}, {"review": {"des": "I came here with a friend early on a Monday evening, and there was nobody else in the restaurant. The food was decent in terms of flavor, but I felt that the portions were small for the price. My friend and I didn't enjoy the service; we both felt rushed and unwelcome. At one point, I was eating the complementary chips, and the busboy was in such a rush that he grabbed a plate out from under me as I was still using it.", "pics": null}}, {"review": {"des": "Came for the buffet lunch special for thirteen dollars after some shopping. It is definitely a good deal not that many options but everything is good so you will have more than enough food to fill you up. My server was awesome very attentive but it is a basic spot not too much decor or anything special.", "pics": null}}, {"review": {"des": "To be honest, after seeing the prices online I was very skeptical about this place. Sure, the food is expensive ($15 for tikka masala) but it is REALLY GOOD. <br>You can tell a lot of time goes into preparing these dishes and the spices and flavors are really on point. <br>I'll definitely be going back for more of that addicting tikka masala.", "pics": null}}, {"review": {"des": "I am shocked this is on the Michelin Bib Gourmand list. It must be for the lunch buffet. I went for dinner during the week and it was quite busy. Service was terrible..not because they didn't try, but because none of them seemed to have any clue what they were doing. Very strange. They nearly refused to give us a 2nd round of drinks while we waited a long time for food. Server hit me in my boob when he took the plate away and dropped a fork on my foot. Lol it was comical.<br>And the thing is..the food was just ok. Definitely near the bottom of the range of all the indian food I've ever had. We had a lamb something and mattar paneer. The lamb was lean - not as tender as I would expect. And the Naan was not great! Usually naan is my favorite part. I would try the buffet if it was convenient but not rushing back.", "pics": null}}, {"review": {"des": "Fantastic little spot for some quality Indian food! It's a great place for a group or a date night. The veggie samosa was amazing, and I'd highly recommend the chicken madras or masala. You can't go wrong with the garlic naan either. Each of us in the group ordered something different so we could share, and there was plenty to go around. Looking forward to going back and inviting new people along to experience Cumin!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vsNQ1VhFZ2K5zdotXrfrdA/348s.jpg", "caption": "Great for sharing with a group!"}]}}, {"review": {"des": "By far the best Indian/Nepalese good I've ever had. I highly recommend coming here if you're iffy with this food group. Flavorful, and spicy but not ridiculously spicy. Some people may say it's a little pricy, I think it's worth it. I came here for the lunch buffet and some dinner options. I was never dissatisfied with what I ordered. Try the chicken tikka masala", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AwCf3QK6PHBFBMsy-HwT9g/348s.jpg", "caption": "Vegetable Samosa with dipping sauces"}]}}, {"review": {"des": "Great flavors, amazing lamb biriyani! It's a small dining room with few staff so I could see how some of the reviews pointed out slower service. However, it was timely for us. All the food was flavorful and delicious. My table got the onion bhaji, garlic naan, chicken Tikka masala, chicken tandoori, and lamb biryani. The lamb biryani was one of the best I've ever had. A little pricier but worth it. Easy call to make reservations the day of.", "pics": null}}, {"review": {"des": "Last night my father and I went to Cumin in Wicker Park for the first time. Appetizers: Onion Bhaji, Vegetable Samosas. Entrees: Alou Gobi, Paneer Tikka Masala. Side: Garlic Naan. Beverage: water. Service rhythm was measured, well sequenced. The waiter left the menus on the table a little too long/the tables are kinda small so they seemed a bit obtrusive. The art on the wall was a nice touch, as was the lighting, which combined new metallic styles and 70's cloth styled lamps. <br><br>While eating we met an old acquaintance named Nema, which was a pleasant surprise from the West Loop. We discussed old times and friends Antonio and Brendan from our shared days at the La Colombe on Morgan. The small touches are what make places like Cumin and Wicker Park so great, they allow us to bridge different cultures and social groups together. <br><br>Will definitely return when I make a little more money, it's not very cheap (but my father paid ;)<br><br>Pete Clancy", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pyVdtRw2Xt6K-bVrNRAYVg/348s.jpg", "caption": "Look, there's the smile I ended my yelp review on!"}]}}, {"review": {"des": "So kind of embarrassing but I went across the city for lunch just to eat here. I've heard of this place before and it was on my \"hit list\" for ages, so I was scared I had hyped it up in my head. THANKFULLY that was not true! This place is a great spot, I can say from a lunch buffet point of view (I only came in for Butter Curry honestly but for a $14 lunch buffet--including tax--of this caliber I was floored) they serve a very quality driven selection of foods--also every buffet comes with naan so don't worry if you're like me and while you love rice can't help but need some fresh naan with a good curry. <br><br>Service was great and you could tell that they had a consistently steady stream of customers as well as to go orders, vouching for how good this place is among a neighborhood known for all its foodie driven crevices and spots.<br><br>Can't wait to go back for dinner!", "pics": null}}, {"review": {"des": "I'm afraid this place is getting too big for its britches. The dishes (at least for takeout) do not come with rice nor naan. So a meal for one with bread and rice and a samosa for an appetizer is almost 40 dollars. I don't think I can justify paying that for a dinner joint I want to pop into from time to time. <br><br>I've now also waited 45 minutes for a takeout order that was supposed to take 30 minutes, and still don't have my food. If you're going to be the most expensive Indian restaurant in Chicago, at least honor your take out time.", "pics": null}}, {"review": {"des": "Cumin is a great choice if you're planning to dine in for some Indian/Nepalese food. The atmosphere is relaxed and tables are clean. Staff here are also very professional and nice. <br><br>- mango lassi (5/5): must have! really thick and creamy, good sweetness from the mango balanced with tartness from the yogurt<br>- chicken momo (3.5/5): worth getting especially if you've never tried this version of dumplings. Has a strong cumin flavor. I'll probably pass on this in the future.<br>- goat chhoela (3.5/5): this was a new one for me and I appreciated the nice blend of spices and herbs infused in the goat meat. The portion is huge for an appetizer. I did find the goat meat a bit tough though. Will also pass on this next time<br>- chicken makhani (4.5/5): very tender, nicely done. Butter chicken is always a safe bet<br>- navaratan korma (5/5): one of my favorite versions of a vegetable cashew curry dish ever! They really nailed this one. Definitely order this. <br>- tandoori roti (3.5/5): maybe because it's made with whole wheat, but I found it to be very dense and thick. I suggest sticking to naan.<br>- cumin peas rice (4/5): nothing crazy, it's basically plain basmati rice upgraded with some spices and peas", "pics": null}}, {"review": {"des": "Prior to my relocation to Asia, I HATED Indian food. Once I touched down in Korea, I LOVED it. So, three years later, when it's time for me to return to America, I'm definitely thinking about where will I get my Indian/Nepalese food fix. Yelp-ers were generous with the reviews on this place, so I decided to try it with my cousin. <br><br>We ordered my favorite, Paneer Mahkani along with Butter Chicken, shared plain naan, basmati rice and chicken pakora and I had a mango lassi for dessert. Honestly, I'm not going to run down each item. I'm just not going to because I'd be saying the same thing over and over and over. This food was SO GOOD! Like, it was all AWESOME. Furthermore, they have tamarind sauce. I have NEVER seen tamarind sauce at Indian Restaurants here, so that was a huge plus. The Mango Lassi was definitely the best I've ever had...PERIOD. All of that food was 56 dollars before tip was is pretty reasonable. <br><br>I see why folks say this place is slight on the expensive side and ordinarily, I would agree. However, this isn't a down home styled spot. It's pretty nice. I'd be happy if this was chosen for date night.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Lsx6ywQ_cYpg_5C8OjvB_A/348s.jpg", "caption": "Butter Chicken, Paneer Mahkani, basmati rice and butter naan"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sRuLJ-gv5OPc-0f8cFj16w/168s.jpg", "caption": "Mango lassi"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3aG3XcyM2hQoN8qzC_CHkQ/168s.jpg", "caption": "Chicken Pakora and Samosas. Really yum!"}]}}, {"review": {"des": "Had a wonderful date night here! The food was filling and delicious. We shared the spinach paneer and the Tika Masala paneer. With a side of garlic naan and basmati rice. There was even enough to take home some. We will definitely come back.", "pics": null}}, {"review": {"des": "Delicious food, awesome service. We had a party of 5 and we walked into a almost completely full restaurant late Saturday evening. We were greeted by the manager who worked with us to arrange for seating without a long wait. <br><br>The servers were extremely polite. We had almost all of their Nepalese goat preparations. The meat was tender and fresh ( we know our goat meat ). The momos were juicy and well made. Overall our party of 5 picky eaters had a great time. Such good service so late in the evening in a Indian / Nepalese restaurant is not easily available.", "pics": null}}, {"review": {"des": "I've been in the restaurant once and also ordered take out.  I haven't dined at a lot of Indian restaurants so I don't have a lot to compare is to, but the food is good.   I've tried the lamb and veggie samosa.  I found the veggie one a little bland but really enjoyed the lamb. I love the garlic naan ($4.50).  Good chicken tikka masala although it is a little expensive ($15) for the amount of chicken you get.  (You also order the rice separately).  However, given that the dish is very rich, it is plenty and the sauce is darn tasty. I  have also tried the lamb vindaalu ($17) - very spicy and too much for me to do on my own.  I preferred the taste of the lamb curry ($17) or lamb biryani ($17)  I'd order both. <br><br>Service is so-so particularly dining in and they don't have a huge selection at the bar.  I prefer take out.", "pics": null}}, {"review": {"des": "Just ordered this for delivery and I'd say it's a solid 3.5 stars. I am Indian and think the food is pretty good- the chicken tikka is average but the palak paneer was really delicious. It's hard to be consistent when you have options from too many different parts of India/Nepal- but they do everything on the menu reasonably well. One thing I have to mention is that the food is way over priced ie $14 for a vegetarian entree that doesn't include rice?? Obnoxious.", "pics": null}}, {"review": {"des": "Amazing samosa chaat. Love the paneers. Consistent, great quality. Haven't ordered anything we didn't love.", "pics": null}}, {"review": {"des": "The food is pretty good.  Only problem is that it is waaaay overpriced.   I mean for the amount of food you get, once you add the hefty price they charge for rice and bread, you end up paying a lot for dinner.    I would go here more often and give a higher rating if it wasn't so pricey.   Why is plain white rice so expensive??  I don't follow these things, maybe there is a rice shortage.<br><br>Staff was nice.", "pics": null}}, {"review": {"des": "Delicious buffet , what I like is the moist chicken tikka, and the star of the show is lamb keema muttor . So fresh!", "pics": null}}]}