{"name": "d-amatos-bakery-chicago", "reviews": [{"review": {"des": "D'Amato's is an Italian lover's godsend...<br>Its got heart, its got soul.  A tiny authentic bakery.  It's a piece of Italy that's legendary and rightfully so.  Everything is baked in their coal fired oven.<br><br>When you enter on a crowded day, you will feel like a sardine.  This bakery gets packed.  Line's out the door.  Space is so limited that it can't be helped.  I'm talking tiny.  Large cases filled to the brim on your left and right.  So many Sicilian slices to choose from, mini pies, large pies, focaccia, breads, cookies, pastries....cases are mesmerizing.  You'll want to sample a little of everything.<br><br>They make the BEST taralli around.  If you enjoy these, you've got to try them here.  Plain, garlic, pepper & fennel.  Golden, flaky & crunchy just the way they should be.  Please don't go to Caputo's for these, they are night and day.  $7/bag and they run out fast.  Your best bet is to reserve them ahead of time and they happily do so.  My parent's only buy taralli from here and they have good taste, so I trust them.  Great to snack on, I personally like them as they are, but sometimes pair with cheese and/or salami & it's even better. <br><br>While 'they' don't like the pizza here, I think they make some of the best Sicilian with cheese around.  Various toppings, sausage is good.  You can't beat their dough. Each bite is a pillowy, soft, tomatoey explosion.  I ask for corner pieces...the caramelized edges are the best.  A slice will fill you up (but you may want to get 2 just because).<br><br>Italian bread is also outstanding.  Dark crusted and just perfect.  They have french bread too.  I'm mainly here for pizza, bread or taralli, so I haven't tried the subs or sandwiches yet but they have a good looking selection including soups & salads.  <br><br>I highly recommend the focaccia as well.  Can't really comment on their desserts since I've just recently tried the cannoli and it was pretty good.<br><br>Come with lots of cash (no cc's) and don't forget an espresso while you're here.  An Italian treasure.  Mangia bene tutti.", "pics": null}}, {"review": {"des": "This little hole in the wall bakery has some of the best pastries in Chicago.   We love their Tiramisu and it's so big, you can definitely share it with someone else.<br><br>Their sandwiches are excellent and their Italian Ice is smooth, refreshing and tasty. <br><br>Limited seating area (just a few stools overlooking the window), mostly take out place.   Cash only.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ox8eXi_aY1UQWCF1siErUw/348s.jpg", "caption": "Tiramisu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0DQ5EOQef-sFHmcIhJNi0w/168s.jpg", "caption": "Italian ice."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PJZvfLVld6cBwKwEU1_myg/168s.jpg", "caption": "Pastries"}]}}, {"review": {"des": "Fantastic Italian bakery, one of the best I've ever been to. Sweet snacks aside(and they do have a wide selection of cookies, cannolis, and cannoli stuffed cannolis), D'amato's does not deviant from the core tenet of a good bakery; Make good bread. The place is always full with locales picking up boxes of baked goods, fresh sandwiches, or other assorted savory focaccias and pizza slices.<br><br>Grab a slice of pizza on incredibly fluffy crust, or a fist-sized arancini ball with meat sauce for $3.50. Or stick to their standby sandwiches(Which are apparently relatively new for them?) and a solid italian sub at a steal of a price. You could easily get full here for less than $7. And Likely if they're selling it here, they're making it well.", "pics": null}}, {"review": {"des": "Just the best Italian bakery in Chicago, no big deal. There's not much else to say really, everything is amazing and the people are super nice. Check it out.", "pics": null}}, {"review": {"des": "This is the best Italian deli in Chicago, IMHO. I've enjoyed the Italian sub sandwiches and cookies several times. It's a great carry-out option for office parties and meetings. Service is friendly, Chicago style!", "pics": null}}, {"review": {"des": "Across from a Tesla store sits D'amoto's Bakery- whose lengthly but rapidly moving line was a testament to this Italian Chicago staple. Be aware that they only accept cash payment, though there is a nearby ATM at the end of the block. We had the tiramisu and cannoli cream puff desserts and each were fresh and incredible. oh- and under $10! A true gem of a bakery!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5GuOJslWJTnNvQKEOQssMQ/168s.jpg", "caption": "tiramisu"}]}}, {"review": {"des": "Time for a controversial statement-- D'Amato's has the best pizza by the slice in Chicago, full stop. Crisp and not too cheesy or saucy, this place is a must stop when I'm in the neighborhood.<br><br>The Italian desserts/cookies are also good (I'm partial to the lemon cookies), but it's the pizza that stands out.", "pics": null}}, {"review": {"des": "Solid submarine sandwiches, tasty cookies and Italian ice. Consequently a good dessert to choose when you're trying to diet. But, if you spend any kind of time gazing at their cookie varieties, that diet is gonna fail. Chicago Turtle style cookies.. just do it.<br><br>I'm just hung up on why they can't accept other kinds of funds. Cash only.. really? It's the sole reason I don't go more often and end up at sandwich competitors. I tend not to keep cash in hand.", "pics": null}}, {"review": {"des": "You'll get the most bang for your buck here. A nice, large, warm foccacia for just three dollars? That's a steal!<br><br>They have a variety of sweet and savory options that you can pick from. While the cannoli was disappointing (couldn't taste the ricotta and I wasn't sure whether the nuts were chopped pistachios or just peanuts with green food coloring), the foccacia, Easter bread (pane di pasqua?), and the taralli dolci were great.<br><br>It's important to note that the bakery is cash-only. There's an ATM on the outside of the bakery that you can use. There are only three seats on the inside of the bakery, so it's better to take your food to go.", "pics": null}}, {"review": {"des": "Best bakery in the area! Whether you need some fresh bread for the family or delicious pastries for a special event this is your one stop shop! <br><br>As far as sweets go I love their cannolis, horseshoe cookies filled with chocolate frosting, and turtle cookies. You can buy your cookies by the pound and pick up out your favorites or ask for an assortment. They make great gifts or treats for yourself! <br><br>When going to get bread I love everything from the wheat bread to the French baguettes! Whatever kind of bread you need they have it! <br><br>Sweets aren't the only thing they can do! If you're doing your grocery shopping and your stomach is growling grab a slice of their homemade thick pizza. You can eat it cold or they will warm is for you. I still to this day cannot decide which is better. <br><br>D'Amatos has been a neighborhood staple for generations, I'm so happy to have grown up with their fresh baked goodies!", "pics": null}}, {"review": {"des": "if you're looking for old school Chicago pan pizza - the kind they used to sell at every little Italian bakery in town - this may be the last place on the northside still doing it right. childhood memories of Pompeii bakery (when the original was on Loomis, like 100 years ago). their almond crescents cookies are pretty delicious, too!", "pics": null}}, {"review": {"des": "This place beats Ferrara pan and any other Italian bakery in Chicago! They are old school, but they are what keeps the neighborhood of westown alive. When you walk in push the door lol I always pull it, friendly faces are ready to help you. In every season they offer something special to try. Don't let the large lines steer you away, it's worth the wait! Everything is just fresh and beyond delicious here. They have the best almond cookies and try the panini sandwiches too! This reminds me so much of my child hood and I love how they treat me and all oh their customers! A yelp gem!!!!!", "pics": null}}, {"review": {"des": "For some reason my previous review never made it to the Yelposphere... so, here's a quick recap and then some. <br><br>I first visited D'Amato's and Bari in the same evening. I know they've been rivals for decades so I figured I'd come to my own conclusions for fun. I'm something of a sandwich lover... and I'm not talking about Subway... I'm talking about those huge fresh baked bread over-meaty subs with just the right amount of mayo, cheese, vinegar, and love that the old Italian couple down the block used to make.<br><br>Anyway, I digress. While I thought Bari was that same type of place from appearance, I was wrong. The sandwiches, while OK just did NOT hold a candle to the deliciousness of D'Amato's. <br><br>D'Amato's is one of my favorites now. Their food is amazing - pizza out of this universe, too. Try one of their cannolis!!! It's crazy how good this place is. I can't recommend D'Amato's enough. If you want good Italian deli food the way you remember it growing up, come visit. It's worth it!<br><br>Also, I think it's worth a mention that the staff here are wonderful people!", "pics": null}}, {"review": {"des": "Yummy. Don't walk into here hungry because everything is on display and looks delicious!  Their subs are huge and fresh but their pizza and focaccia is where it's at!  My fave is their mushroom, onion, pepper, and sausage pizza bread.  They layer on the toppings for sure.  And also stop in for a tirasmiu or cannoli and a hot espresso!", "pics": null}}, {"review": {"des": "Hands down, one of the best bakeries in Chicago. Always fresh, always authentic, you can't go wrong.<br><br>I've yet to go there when it's been empty and there's a good reason for it. Their breads, sandwiches and especially the sheets of pizza bread (which is perfect for parties FYI) are drool-worthy.<br><br>Just don't go there on an empty stomach because the delicious smells and eye popping food displays will destroy you. Also, cash only! But they have an ATM on the side of the building.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/E4czJtA4gpR89jPPPHK5vg/348s.jpg", "caption": "Outside the bakery."}]}}, {"review": {"des": "Best subs in the city<br>Italian bread baked in coal fired brick oven<br>Try the combo soup sub<br>Italian cookies are top notch<br>Italian ice is some of the best<br>Tomato bread pizza pretty good<br>Cash only!!!!!!!", "pics": null}}, {"review": {"des": "Great prosciutto panini and lobster tail/sfogliatelle. The cookies were okay, but I don't think I would get them again. My only complaint is they only take cash, but the staff are very friendly. That being said, I still came back for the panini - cash in hand!", "pics": null}}, {"review": {"des": "It's a great historic bakery but I stop here for the Pizza, which is amazing. Sold in nicely sized rectangles I'm a big fan of both the sausage and the pepperoni, I usually order one of each. This is quite a hunk of meaty pizza, there will be grease, ask that they warm it for you, just takes a few minutes. While you wait check out the tempting items displayed throughout this small store. The pizza behind the glass counter reminds me of the long gone array of pizza choices displayed behind glass at the old Pompei Bakery on Taylor Street. D'amato's Pizza is in a class of its own, quite unique and delicious.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GUWCF3VDR3zGvN1u6IzDwQ/348s.jpg", "caption": "Sausage Pizza."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Q5gLz3Bmi5n2FpYolj690w/168s.jpg", "caption": "Pepporoni Pizza."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Rgdtu2D1yDVQfKPZrPOrcQ/168s.jpg", "caption": "Grease soaked package of pizza!"}]}}, {"review": {"des": "Shout out to the Italians right now! Tomato basil soup just made my mouth screammmmm, so fucking good! Probably the best tomato basil soup I had in my entire life. <br>Oh yeah bring cash! I think the cash gods blessed me today bc I surprisingly had some! <br>Get all the desserts though.", "pics": null}}, {"review": {"des": "Great Italian sandwich . I am sure they use organic tomatoes. Tomatoes smells great and give better taste . I would love to give them 5 stars but it's 2018 and they still take only cash !!!", "pics": null}}, {"review": {"des": "Awesome food! The only draw back is the space is a little tight and they only accept cash. Based on the food quality and how busy they are, the owner should know they have out grown this cash only model.", "pics": null}}, {"review": {"des": "Aside from the food, these guys have thee worst customer service ever, every order takes about 20 minutes for no reason. The workers are extremely slow and takes their time. The food is good but it's not that good but to keep coming back to be standing around and treated poorly. They are only nice to regular customers or old people. The workers put in no effort and management is the worst. I think family owned places need more quality control than they think, it's sad because that's how places end up closing then the people don't know why. If you know of a different bakery it's better to just go to that one or Bari's. The service is definitely 0 stars but the 2 stars is for the food.", "pics": null}}, {"review": {"des": "Lovely little Italian bakery. I stopped in for an Italian sub and left with a jar of sauce. Sandwich and container of meatballs. I think the best in show for the pizza but I was set on my order. I'll be back for sure and the girls there were so nice and helpful. You could tell they really cared about the business. Glad I came in here. Next door is an Italian grocery store where I grabbed a few lbs of fresh Italian sausage. Great place", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KpXdcl9kx9MkflywsKBR2g/348s.jpg", "caption": "Italian sub"}]}}, {"review": {"des": "Best Italian sub I have ever had!  It is the bread.  Slight crunchy crust, fresh meats and cheese.  We had in the morning with an espresso.", "pics": null}}, {"review": {"des": "Absolutely fantastic! Went on a Sunday morning at nine, and there was a line almost out the door - always the sign of a great bakery! The number of choices as incredible, and is really fun for a little adventure. Check out the history of their coal burning oven. We got a slice of cheese pizza, which is definitely bakery pizza, basically focaccia. It was absolutely incredible! Also had an anise biscotti and coffee and bread to go. A fantastic experience! Definitely lives up to the hype! Be warned though, it does get busy, and there is only a small counter with two stools inside to eat, though during the summer there are a couple of tables outside.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KKdmFF4c1CYud5z3i2zB7A/168s.jpg", "caption": "Chocolate dipped anise biscotti(it was very hot out, hence the melting chocolate!)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GYc-nuLPsgk96AJhLy2ChA/168s.jpg", "caption": "Anise Taralli"}]}}, {"review": {"des": "Cash only. So bring some to snap up the goodness in this place.<br><br>Cookies? Yep.<br>Freshly baked bread? Yep<br>Freshly baked and sesame-dipped breadsticks that are crunchy beyond belief? Yep<br>Fresh pan pizza topped with a wide array of ingredients? Yep<br>Sub sandwiches ranging from vegetable to meatball in three different sizes nestled between the freshly baked bread? Yep<br>Reasonable prices? Absolutely!<br><br>Parking is not easy. And there is usually a line, but it moves quickly. Just bring cash. And enjoy!", "pics": null}}, {"review": {"des": "I've been eating  their bread for years. Love it. I actually drive by their place a lot and had never gone into the bakery until yesterday. I branched out a little bit and got a cream horn. It was fantastic. My wife liked it too. They passed the real test then. I'll be back over and over again.", "pics": null}}, {"review": {"des": "D'Amato's rocks. Besides being the best, most authentic Italian bakery in the city - they have the best customer service! Called to make sure they still had a half sheet of pizza tonight just before they closed, and got a call back a few minutes later telling me not to come me yet because they were going to make me a fresh one, even though they were about to close. They genuinely care about their customers, and the product they put out. Their Sicilian pizza is the best I've ever had. Thanks D'Amatos!!", "pics": null}}, {"review": {"des": "Coal fired bread that is excellent.  Their cookies and cannolis are great. Sandwiches at lunch are good. They have nice pizza (Detroit style).  Wish they sold their bread to Bari next door", "pics": null}}, {"review": {"des": "I stopped by for a quick bite. I was greeted by a conglomerate of the aromas from the bakery which comprised of both fresh bread and pastries. Decided to get a meatball sub with peppers and provolone. I knew the place was legit when after ordering, it only took 5 minutes to receive my food and the lady at the front affectionately slapped down the sub on the counter. Needless to say, I thoroughly enjoyed the experience and the meatball sub itself!", "pics": null}}, {"review": {"des": "So this is the best bakery in town. The conole is amazing the black and white  cookie  is do die for", "pics": null}}, {"review": {"des": "Ordered a large cannoli for my daughter's communion & was told it'd be $55, filled with 30 small cannolis(see pics). Upon picking up my order, I noticed they had regular cannolis for $1 each. I began to wonder what size the small cannolis would be. They showed me the top & asked if I was satisfied I said yes, the presentation was great. Took it home, only to realize the small cannolis were very tiny. They covered both ends of the large cannoli with 15 tiny ones on each end & the middle was empty, very disappointing. Especially since the size of the $1 cannolis were much larger. I felt ripped off. I could've just purchased 55 regular cannolis for the same price & would've been satisfied. Now I know for next time, beware! On the hand, their bread & pizza looked delicious , will definitely have to try next time. That iz all...", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/74B0zIxbCbpxZITATrjgow/168s.jpg", "caption": "Inside of large cannoli, pretty much empty. Disapppoonting!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YNCsXXDByE8F6GFFRy-w3w/168s.jpg", "caption": "Large Cannoli filled with 30 tiny ones=$55(not worth it)"}]}}, {"review": {"des": "Their cookies are some of the best butter cookies I've ever had-and I hunt for good butter cookies.  Price is very reasonable at $10/pound, service is very good. Worth the drive from Michigan.  And the ones without powdered sugar freeze beautifully (staff gave instructions). Tip:  cash only.", "pics": null}}, {"review": {"des": "happened to stumble on to the YELP page for the place--I have been here hundreds of times--anyone who has anything negative to breathe about this place is announcing their stupidity and affirming their lack of sophistication", "pics": null}}, {"review": {"des": "I'm not sure why I am writing a review for D'amato's. I'd rather others don't find out about this gem, 'cause the lines are long. This place has the best bread in the city. They make it in house using a coal oven. The bread is crispy on the outside, and soft on the inside. Additionally, they supply the bread to many restaurants in the city, so you probably have tasted their awesome bread. <br>Moving on, you have pizza by the slice. They'll heat it for you in a few minutes, and you are ready to go. If you wanna be a real piggy, eat a slice here, and take the other one home. Once you are home, pop it in the oven for about 10-15 min., and this thing will blow your mind. <br>When you finish eating, don't forget about the cookies and pastries you just picked up. Enjoy your GIANT canolli, or your gelato (or both). I won't judge. <br>It's cash only, so come prepared.", "pics": null}}, {"review": {"des": "It's a shame that Subway sandwiches exist when there are places like this. THESE sandwiches are what subs should taste like. Swoon!<br><br>I ordered a 10\" veggie and it came out and the bread was crisp and the veggies were amazing! No bell peppers and some stringy lettuce here! It was artichoke hearts and fresh mozzarella! And it was cheaper than subway! What?<br><br>Go here and eat a sub, you will thank me later. Delicious! Best I've ever had!", "pics": null}}, {"review": {"des": "Old school italian bakery. Everything was good. We wanted some sweet after having Japanese food down the street and came here. It was super crowded for this cold winter early afternoon, but we got served pretty quickly. The staffs noticed that we weren't regulars and gave us extra time to order.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NKeaTrineTnEbk2s9HJW4w/168s.jpg", "caption": "Outside"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gs3Iij8LBNubrPVHX_Bgtg/168s.jpg", "caption": "Outside"}]}}, {"review": {"des": "Simply THE BEST !!!!!<br><br>It's the last of the old Time bakeries kiddies\"'<br>so you better show it some love and keep the tradition going or it'll be GONE like all the rest. <br><br>I use to go see the old Greek man on halsted <br>In Greek Town but he's gone now and boy do I miss  his baking goods . <br>Everything was THE BEST !!<br><br>Well D'amato's is the Italian version. <br> <br>From the SUB SANDWICHES to the SOUPS to the bakery goods in the display cases. <br><br>Simply THE BEST !!!<br><br>And remember it's old school so <br>CASH ONLY !!!!", "pics": null}}, {"review": {"des": "Neighborhood classic, been coming here for years. I stopped in after driving by looking for a place on a saturday after a meeting. Thought why not.<br><br>Had an Italian sandwich it was delicious. I tomatobread is amazing. I've had a lot of the bakery items over the years, I cant remember to name them all, too lazy to look it up and not going to guess on the spelling. But it's good! Trust me!<br><br>Writing this review, I kinda want to go back now. Not right now but this weekend", "pics": null}}, {"review": {"des": "My family has been going here for over 40 years. We absolutely love their pizza and try to go there a couple times a year since we live out in the suburbs now. It is worth every penny. Everyone who works there is very friendly.", "pics": null}}, {"review": {"des": "Food is fine. Really terrible customer service. Not worth it. Recommend going somewhere nearby.", "pics": null}}, {"review": {"des": "Best pizza and subs too go<br><br>Great cannoli and macaroons too<br><br>Always fresh and good family business", "pics": null}}, {"review": {"des": "D'amato's has that old school Italian feel. It's my go to place for quick classic subs. I'm a big fan of their chocolate cannoli's as well. What do I keep coming back for though? The arancini! their arancini is addicting! I always get the ground meat arancini with tomato sauce. Best of all... very reasonable prices!", "pics": null}}, {"review": {"des": "I have not had a better square in the city.  This place is just amazing to me.  If I lived in the area I would be a regular, hell I would ask if they can teach me.  Their bread, the pizza, and the Italian Ice or as I call it Wooder Ice (lady was very confused when I asked for that.<br><br>They have amazing sandwiches and can't wait to try some of the cookies and such that they have.  I am not sure if they cater or what, but I am sure I would use them if they did.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/b5R0AYnyh626XVQCpb_Qcg/348s.jpg", "caption": "Bad ass pizza. So cheap also. Order a pan for your next football party"}]}}, {"review": {"des": "Chicago's premier Italian bakery. Descriptions are not substitutes for your own experience.", "pics": null}}, {"review": {"des": "We ordered the cannoli, tiramisu, and a blueberry bar. The cannoli was one of the best I have ever had. The tiramisu and blueberry bar were also delicious. I am very much looking forward to coming back here soon.", "pics": null}}, {"review": {"des": "After traipsing around trying and failing to find an ATM, I bought an amount that aligned with what I had in my wallet. Specifically, I got a sfogliatelle and, instead of a sandwich, a tomato focaccia. The sfogiatelle was tasty but not my favorite: the outside wasn't as crisp as it should have been, and the inside filling seemed more like pudding than like ricotta. The focaccia caught me off guard with how tasty it was, though. It was a full pizza substitute: the bread was thick, flavorful, and oily, and it was balanced very nicely by the tomato topping. I'd try the breads if I were in the area again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yZU8kzX0FB9D8Da4VkHt4A/348s.jpg", "caption": "sfogliatelle"}]}}, {"review": {"des": "Best Pizza Bread I've had. It's like a delicacy to me. Big, squared off pieces of focaccia that I've piled up with sauteed onions, garlic, peppers, sausage, and a little extra marinara make my home creations a work of art. The bread is doughy and flavorful, and has a nice surface for holding lots of toppings. I've never had such before this but I love it. A friend works not far away and brought some home, now I'm hooked! <br><br>I know I'm gonna go back for a sandwich there some time. Delicious!", "pics": null}}, {"review": {"des": "They have a great French bread pizza sometimes can be very oily but overall very good! They also have tons of cookies and different canolis to chose from,Sunday's are always busy so would advise to go a different day", "pics": null}}, {"review": {"des": "Stopped in here on my way out of Chicago, sniff...It's been a long search for a great bakery in Chicago, after one of my favorites had gone downhill. D'amato's Italian Bakery seemed to be the bakery I've been waiting for!!<br><br>They have an array of baked goods, as well as pizza! Their pizza came in 3 different kinds.....cheese, pepperoni, and sausage. I got a slice of the pepperoni, which had an old-school square cut, and a homemade taste that was divine!! They also had a great selection of cannoli's and I had to have one.The pizza was a nice surprise, but the cannoli's was the reason why we visited anyways. I had one of their pistachio cannoli's...OH MY!!! So delicious, creamy, crispy shell, and just how it should be!! The pistachios were aromatic with nuttiness, and then with a dusting of powdered sugar, YUM!!!! <br><br>Let me add, that not only was the food delicious, but the inside of the store had a fun, old timey feel to it, as if they left it how it used to be, but just kept up with the repairs of the shop! I loved it!! <br><br>I can't wait to go back to try their sandwiches, gelato, and so much more!! My mouth is drooling just thinking about it!! <br><br>If you are in the Chicago area....you MUST stop my D'amato's on West Grand Ave.!! You will find a little piece of sweet and savory heaven inside!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GaJnzI-ey86sJh7hYhj6ag/348s.jpg", "caption": "The yummy Pistachio Cannoli's!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sKOSQzmd88wNIVzpvKfDsQ/168s.jpg", "caption": "The outside sign."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8pneMhFOLdUul4S_yQFagQ/168s.jpg", "caption": "Another shot from inside!"}]}}, {"review": {"des": "Great old school Italian bakery. Fresh authentic Italian cookies and desserts. The bakery style pizza and foccia is to die for. There is no comparison anywhere else!", "pics": null}}, {"review": {"des": "Hands down best Meatball sub in Chicago. Way better than Bari because they make their own bread and the meatballs are Nonna's recipe", "pics": null}}, {"review": {"des": "Old school Italian bakery. <br>I am a really big fan of there Italian bread and sandwiches.<br>How ever I  am not a fan of there pizza. <br>I really wished they would take  Debit/Credit Cards. That is one of the reasons for it being 4 stars instead of 5.", "pics": null}}, {"review": {"des": "If you live near this place and never been, i feel sorry for your mother.<br><br>Heck, even if you like 200 miles away, you need to get some cannoli from this place.<br><br>P____ off the chain wax.", "pics": null}}, {"review": {"des": "Absolutely a gem.   It is easy to find a bakery for  deserts but not so for breads, let alone good breads.  Love their breads!  Bought two crusty sourdough 1-pounders, Italian ice and cannolis.  Will try other goodies next time. <br><br>Found free parking easily on side streets 10am Sunday.", "pics": null}}, {"review": {"des": "This awesome west loop(ish) bakery has so much good to offer to the world. The ladies behind the counter are truly a blast, the bakery has an incredible history - serving delicious Italian baked goods for over 50 years and they now serve subs?? YES!<br><br>My favorite ting on the menu is the classic Italian sandwich on focaccia bread!!! Yoooo dried tomatoes and olive oil focaccia bread, split in half with all your favorite Italian toppings. It's literally HUGE and big enough for 4 people to share I kid you not. It's under 10 bucks and has to be one of Chicago's best kept secrets. <br><br>Amen.<br><br>Ohhhhh and they're cash only - so come prepared because their ATM never works.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LVa3jPNANQaVGOb78wglZA/348s.jpg", "caption": "Unreal."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ddRty7zkLis2-59SaHzgSg/168s.jpg", "caption": "Doin what I do"}]}}, {"review": {"des": "My family and I have enjoyed this bakery since the mid 70' and beyond!  Great pizza bread, desserts and sandwiches!  We love it!", "pics": null}}, {"review": {"des": "D'Amato is a tiny Italian bakery in Chicago's River West area that features Italian baked goods, bread, pizza and Italian Ice. We swung by here after lunch at Coalfire Pizza for some dessert. We ordered a cannoli, some chocolate cake, some Italian cookies and a slice of pepperoni pizza (1\" deep dish pan pizza). They had a large selection of cookies and a few other baked goods. The cannoli and cookies were very good and I highly recommend. The pizza was nothing exciting (Little Caesars is better!), and the Chocolate Cake was dry; not worth the calories. The fresh baked bread looked amazing but we didn't try it. Based on what we had, this place is a 3 1/2. The prices were fair too.<br><br>Also, If you plan on swinging by here don't expect to sit and relax. This is a grab and go type of place. They have a bar at the window with 3 stools.", "pics": null}}, {"review": {"des": "Coming from Rhode Island, I NEEDED to find an authentic Italian bakery. Thankfully, I came across D'amato's on Yelp and WOW am I glad I did! First off, this place is oozing with Italian culture. Their selection includes (but is certainly not limited to) freshly baked bread, pizza by the slice, cannolis, sfogliatelle, zeppole etc. I wish I could live here and eat one of everything for every meal. The staff is loud, quick and very friendly. It's cash only so don't forget your moola! I can't wait to come back for more deliciousness. Thank you for saving me D'amato's!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2GBBVJYeEBJHD_GKeeDviA/348s.jpg", "caption": "Zeppole san giuseppe"}]}}, {"review": {"des": "This place makes sure everything they sell to their customers is 110% full flavor!<br><br>Their french bread always has a perfectly fluffy center and that crunch on top.  <br><br>Pizza is oh so oily,  but the flavors make that grease that is simply everywhere completely worth it.  <br><br>Sandwiches are all full of flavor.  You can taste the fresh ingredients.  <br><br>Unless it's your grandma's..... You will not find a better cannoli in all of Chicago!", "pics": null}}, {"review": {"des": "I went to D'amato's for the first time today and what a fantastic place it was! Maria was wonderful. We didn't know it was CASH ONLY so Maria directed us to the closest Bank Of America.<br><br>The cannoli's were amazing. My daughter got the chocolate cannoli and she described it as heavenly. We also bought pizza bread slices and they were delicious too. But the artichoke and cheese round pizza was my absolute favorite. <br><br>My other daughter said that's the best teramisu she's ever had. <br><br>My only complaint is they don't take credit cards, but if they had taken them I would have spent so much more money. Excellent food, fantastic service. Best cannoli's ever!", "pics": null}}, {"review": {"des": "Just finished one of their arancini (meat filling)-it was fantastic just like everything else they sell.<br>Always bring home several focaccia, a loaf or two of bread, some arancini and whatever else strikes my fancy. On days when the Bears play you'll find tailgaters grabbing bread here and sausage from Bari Foods next door. Old school-nothing better.", "pics": null}}, {"review": {"des": "Situated adjacent to Bari's grocery and amazing meatball sub sandwich, Damato's Bakery delivers delicious Italian fare. I had the corner slice of \"Sicilian pizza\" which I downed in less than a minute. The dough was so soft and tasty. I plan on going back to Damato's for many more treats soon!", "pics": null}}, {"review": {"des": "I love this place I drive out of my way to come here if you never been before you have to stop by they have the best everything!", "pics": null}}, {"review": {"des": "Delicious pastries and super nice workers. Everything here is a great choice from pizza to bread to all kinds of pastries. Cash only and they totally work with to get you the most for whatever cash you might have.", "pics": null}}, {"review": {"des": "All you need to know about D'amato's is the 3 S's. Slices, sandos, and it's super cheap. Yes...they've got cannoli and a bunch of other baked goods (which I'm sure are also awesome) but if you stick to the savory stuff you'll be a happy camper. <br><br>Slices are only 2 bucks a pop and melt in your mouth delicious. Sandwiches aren't quite 5 dollar footlongs, but they're a-tad-above-that-price for ten inches of bakery bread, quality meats, and fresh fixens. It's worth may more than the price you're paying. Try the beef and meatball combo or do either alone and I'm sure you'll agree. <br><br>Cash only and their ATM has a $3.50. Pretty much the only negative about this place. Other than that it's solid gold.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QjhABps29IsWFfMrMX5sLg/348s.jpg", "caption": "Turkey sando"}]}}, {"review": {"des": "We had the Italian Beef, the Italian Sub, an Arancini ball and the Tomato Basil Soup! EVERYTHING was sooooo delicious!  Next time pastries and gelato! I am obsessed with the tomato basil soup. If anyone knows the recipe, please share. I would love to make it at home. I live in Arlington Heights so going to D'amato's 2-3 times a week is not an option, but will definitely go again and again, when I can.", "pics": null}}, {"review": {"des": "The square pizza with sausage was great!   Great crust!  Also the tiramisu was very good too!   Tasted homemade!  My mother gave it her stamp of approval! Very affordable!   I'll be back!", "pics": null}}, {"review": {"des": "Such terrible service. Waited 10 minutes to get a coffee while no one is in the front to take an order. Eventually just left. Either they're understaffed or don't care...", "pics": null}}, {"review": {"des": "From out of town and stopped by for a sandwich and a cannoli. This place is amazing! I completely recommend going here- it is a great experience.", "pics": null}}, {"review": {"des": "Been going for years. My mom and uncles lived down the street and went there as kids. Amazing food!!!", "pics": null}}, {"review": {"des": "Dat focaccia bread, tho!<br><br>Sure, it's just one thing on a long list of offered baked goods and sandwiches at D'amato's, but that one thing was all it took for me. <br><br>Freaking thick-ass, salted black olives on that bad boy and I was in heaven. They offered to warm it up for me at the shop but I'd planned on taking it home as a sort of consolation present for SO, whom did not get an invite to the dinner I was attending. <br><br>I heated that ish up at home the next day with my partner and we dined like kings on a single loaf of some damn delicious olive focaccia. <br><br>Be forewarned: Ordering is definitely a stressful sitch. <br><br>You really won't get time to look at a menu or even scan the shop offerings in full, you'll need to be ready with your order stat, so know that it might take you a few trips in to actually have an opportunity to see enough of the store to know what they offer. <br><br>It's cash only, so be ready with your dolla dolla bills and if you happen to become a pro and are able to audibly get a sandwich order in, you can seat yourself outside on their pretty adorable neighborhood that plays some pretty rad tunes over outdoor speakers.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BiQPyeT9KQ8F8_irL86LdA/168s.jpg", "caption": "Olive focaccia"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vggGKayBxatyUYZuQDqD0Q/168s.jpg", "caption": "Focaccia"}]}}, {"review": {"des": "D'amato's is one of the best bakeries in Chicago. Their bread, pastries and sandwiches are really good.", "pics": null}}, {"review": {"des": "Having lived in NYC for a bit, I greatly miss New York style pizza, well there, the confession is out in the open. I miss the slices but also the squares, which they advertise as \"Sicilian\" pizza. So when I asked the Sicilian guy at work, he said there's no such thing. Then I asked our Sicilian contractor and he recommended D'Amato's - and so glad he did! Their thick focaccia style squares are delicious, especially if you eat it fresh and warm. Their focaccia is delicious too! <br><br>But their cookies stole my heart! I can survive a whole week on just their cookies! They melt in your mouth and pair so well with coffee! The cannolis are probably one of the best I've had so far, the only two that compare are in Little Italy in NYC & Boston.", "pics": null}}, {"review": {"des": "This place is extremely overrated. To be clear, I've gone here 3 times and left the first two times because of the vibes. Everyone from the employees to the clientele have this rude and aggressive attitude. I thought I was imagining it but then took two different people with me and they both experienced the same thing, without me telling them anything. I finally actually purchased something the third time because I really wanted to see if the cannolis are what everyone say they are. They are not. Pete's has better cannolis. Definitely would not recommend or ever go again. Oh I also tried a few cookies. They were ok. Nothing to write home about. Save yourself some times and go somewhere else.", "pics": null}}, {"review": {"des": "Excellent service and delicious bakery eats. Cash only though, which is an inconvenience. Luckily I had some cash or otherwise I would have circled for parking a million times and take out my toddler out the car in the cold for a big disappointment. <br><br>Delicious sweets! :)", "pics": null}}, {"review": {"des": "a great atmosphere with a friendly staff!! i am  definitely coming back for the amazing cookies and focaccia. this bakery is AWESOME!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/m34WGrRK-9FHp6TO0uik0Q/348s.jpg", "caption": "delicious cookies."}]}}, {"review": {"des": "One of my two favorite Italian bakeries in the city.  I called and asked if they had a half sheet of tiramisu.  The confirmed that they did and I rushed right over.  The place was packed but the ladies behind the counter greeted every customer with the same cheerful smile.  The price was very reasonable at $35.  Unfortunately, they only accept cash.<br><br>The next day we celebrated my friend's birthday and the cake was an instant hit.  At least five people asked where I purchased it and I told them D'amato's on Grand Ave.  It would be great if this place expanded to include tables and chairs.  If they did, I would definitely stay for a cappuccino with my baked good.", "pics": null}}, {"review": {"des": "Wonderful! Everything is great. I wish I lived next door.<br>The bread is the best. Pan Pizza's are so delicious.", "pics": null}}, {"review": {"des": "My fist experience with D'Amato's involved a carry-out order of cheese, sausage, and artichoke pizzas for a work celebration. The pizza is unlike your typical Chicago deep dish or New York-style flat pizza. Its more like a large rectangular piece of focaccia bread, with a chewy and dense crust and minimal toppings. Like most bread, it tastes best when warm. The paper packaging does little to keep the pizza warm, so I recommend eating this stuff ASAP. <br><br>The pizza is relatively inexpensive, and is great for work or birthday parties if you're on a budget!", "pics": null}}, {"review": {"des": "Good food/family owned. If it wasn't cash only I would come here a lot more often.", "pics": null}}, {"review": {"des": "This is the bar that any, even the new gluten free whole wheat with all natural seeds bread palace, has to come close too. Bread stacked on one side pizza and cookies and pan apple slices. Real photos on the wall of people that founded the place 70years ago not photos picked by a decorator. Great staff, you better know what you want there's a line already behind you.<br>This place is a treasure, it's real and it works and passes the time test. I hope the young group that is moving into the neighborhood appreciates this wonderful place.", "pics": null}}, {"review": {"des": "Crunchy cannoli shell with perfectly smooth and sweetened ricotta--for $2 and with friendly service you can't beat it!", "pics": null}}, {"review": {"des": "D'Amatos is a family owned business that has been a west town and chicago area staple for YEARS! If you want bread that is made fresh daily (they always look like they are working hteir butts off) and has no preservatives this is the best you can find!! I have never been disappointed by their quality and the bread is always hard to put down.  You can tell that true Italian love and passion go into this business. HIGHLy recommend", "pics": null}}, {"review": {"des": "Good bakeries are hard to find but thankfully there's D'Amato's!  I went there today for my first time - bought two pounds of cookies, a couple cannolis and a slice of pizza they heated up for me. Everything has been delicious!  I love this place. Also, I didn't know it was cash only, but thankfully, they have an ATM right around the corner of the store. I like cash only - it's old school. My mom will love this place!  Highly recommend.", "pics": null}}, {"review": {"des": "What a great spot, I love old school Italian places like this they remind me of my childhood growing up in Berwyn homemade Italian cookies, cannoli's, and a pizza that will blow your mind, it's soooo tasty they don't put a lot of cheese on it which I love because we all know too much cheese makes us sorry later, only saw 2 kinds here sausage and pepperoni, they come by the sheet, half whole or slice, I bought a whole sheet last week and it looked like I ordered it from Fred Flinstone HUGE, great thing about the pizza is not only is it delicious it's even better when you warm it up in the oven at home, I've also had the Italian sub from here and it's probably one of the best I've ever had capicola, salami, ham, the works, to top it off the sub was enormous, next time I come I'm getting the bakery you could tell everything is homemade they have a warehouse across the street where they make and do everything thing, this is not a sit down place so come in order and take it home, great place to order food and dessert if your having a party, saw a cannoli cake concoction on the wall it was gigantic hope I have an excuse one day to order it, can't wait to try more things from this place.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wZ22a13txGr9W1ab6Q1l3Q/168s.jpg", "caption": "Fresh Italian bread...."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HOH8MLGcKdh0d7isgKDHpA/168s.jpg", "caption": "Pizza at least their version so yummy...."}]}}, {"review": {"des": "I know this place makes good bread,  I mean my favorite deli (JPG) uses this bread for their sandwiches, so it must mean something.  The bakery here is phenomenal,  lots of choices and the bread is just amazing.  The sandwiches are also delicious but this review is about my experience today.  I tried their tomato basil soup and it was by far the best tomato basil soup I have ever had.  I got it as part of the half sandwich/half soup special and my wife got her own sandwich.  I literally had to make some serious moves to block access from my wife as she was trying to eat all my soup! We could not stop talking about how good it was.  <br><br>Don't forget to get the cannoli here,  they are amazing as well!", "pics": null}}, {"review": {"des": "This place is love.<br><br>If you love yourself you will get here and order something you crave because its all so tasty.<br><br>If you love a friend you can order a made to go sammie on fresh baked bread to share with your bff on an impromptu picnic on a street curb.<br><br>If you love your mailmanperson for not judging you with the amount of brown paper wrapped packages that vibrate or make strange noises and still delivers safely to your possession, hook them up with the cannoli or the cookies or the pizza or the gelato..its all good.<br><br>The people here are the nicest.<br><br>The parking is not so bad if you come off hours.<br><br>The belly you get after you over indulge is not so much love. but c'est la vie.", "pics": null}}, {"review": {"des": "Most incredible pizza bread, light sauce was perfect.  I ordered Mushrooms.. just perfect.  Italian sub with sweet peppers to an added sweetness perfect incredible crispy italiano bread!", "pics": null}}, {"review": {"des": "Love D'amatos! I have been coming here since high school. $3-4 for a slice that will fill you up! The slices are pretty greasy, but they are so yummy. Will def leave you with cravings. <br>I am obsessed with the artichoke and olive slice but last time I came they were all gone :(. Hopefully you guys still offer that combo it's my favorite! :) <br><br>Also, cute patio outside to sit in. <br>Try joes tea too! It's amazing you'll love it.", "pics": null}}, {"review": {"des": "We have moved to Texas but when we are back in Chicago (never enough). Our favorite bakery.<br>Does anyone know if they ship?", "pics": null}}, {"review": {"des": "By far the best Italian/French bakery in Chicago.  Family owned and operated since opening day.  Knowing the family and how genuine they truly are has made the experience special each visit.  Delicious food is always consistent making the meal unparalleled.  Just had a chocolate cannoli yesterday after the D'amatos combo (a must) and it was amazing!<br>Keep it up y'all!!", "pics": null}}, {"review": {"des": "I haven't been here in a while, but I always mean to go back. I'm a lazy commuter though, so -shrug-.<br> <br>The pastries are awesome. I've had the lobster tail, a raspberry one of the same name, the cannoli's and a few other puff-pastry + creme combos. I have yet to find an italian bakery that I like more than I like this place. The pastries are never stale or soggy - the pastry is fluffy and crisp, and the fillings are never too sweet. The cannoli was perfectly crunchy. Not a moment of stale-ness could be detected.<br><br>If I remember correctly, it's cash-only. There isn't anywhere to sit inside though, so grab a box to go. <br><br>The service wasn't great. A bit unfriendly. But this was several years ago and it honestly doesn't stop me from wanting to go back as soon as I can remember to when I'm in that side of town.", "pics": null}}, {"review": {"des": "I love this place. I've been going for as long as I can remember as it's a family tradition. My mother grew up in the old neighborhood so it's always nice to stop in at D'amatos when we're back in the area. Great Italian ice, cannoli, focaccia, pizza, subs and cookies! Love that they still use the old cash register too. Only wish they would accept debit/credit and tell some of their newer employees how to provide very basic customer service. All in all, I always consider it a treat to go back to D'amatos!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CAX8HFgrF_KAY1PKIW2LZw/348s.jpg", "caption": "Family tradition"}]}}, {"review": {"des": "This bakery is amazing. Have been going here since I was a young kid. My family lived in the north subs but made it a tradition to come here once a month. We would buy their pizza by the sheet pan. <br><br>Now as an adult, I go here all the time, sometimes too much for my waistline. <br><br>Favorite items are as follows: cheese or pepperoni pizza, cookies(mainly the chocolate ones), veggie sandwich. <br><br>The prices are very nice on your wallet. They are cash only!!! <br><br>Must check them out!!", "pics": null}}, {"review": {"des": "I love Italian bakeries like this for 3 reasons:<br><br>1. They operate on the \"Get in. What do you want? How many? Give me your money and leave\" model. <br>2. Their product is legit. My grandma is from Florence (Yeah, I'm that guy that ITALY DROPS HIS GRANDMA) and everything here tastes just like her recipes.<br>3. Macaroons. <br><br>Seriously man, it's a really great bakery and won't break the bank. If you have issues with their service, grow up and be an adult. If you have issues with their product then you are not to be trusted.", "pics": null}}, {"review": {"des": "the best pizza & bread in chicago hands down! <br><br>omg <br>incredible.<br><br>family tradition for years. live this place.", "pics": null}}, {"review": {"des": "I like the restaurant with the Italian style.  Look at the cashier machine.<br>Their pizza and sandwichs are awesome", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/caYYt-Xbsr0wBmxMEfGYTQ/348s.jpg", "caption": "They have only three chairs for eating"}]}}, {"review": {"des": "Everything here is really good, and cheap. Super fresh.<br><br>Also, every counter girl here is hot. Whoever their hiring manager is has the right idea.<br><br>So do you like hot girls? and good food? I do.<br><br>So eat here.", "pics": null}}, {"review": {"des": "HOLY CANNOLI Batman! This place is \"Da chit\"! I don't know how and the heck I overlooked this place for so long, as we try to come to Chicago once a year for a getaway. <br>The food here is amazing, and CHEAP! We ordered a giant cannoli for my daughters birthday, and ended up buying about half of the store while we were in there. Sure, it's not a \"pizzaria\" , and, it's not trying to be. But it does darned good, as it's a bakery..and this place does bread GOOD.<br>Giant cannoli...$55. Focaccia...$4. Pizza square...$1. Regular cannoli...$2 Pies, cheesecakes, cookies, pizzas, subs.....<br>MAKE ROOM....I MOVING IN!!!!!", "pics": null}}]}