{"name": "davanti-enoteca-chicago", "reviews": [{"review": {"des": "My department comes here every few months or so for a group lunch, and the food never disappoints!  We've tried so many different items from their menu by now, and it's all been delicious.  I'll highlight a few of the group favorites...<br><br>The Focaccia Di Recco is a MUST HAVE!  Honestly, our group usually has a couple of these because it's just so good.  It's a flatbread with soft cow cheese inside, an actual honeycomb to the side, and all sorts of buttery deliciousness.<br><br>We often share a few of the pizzas for the table also.  My personal favorite is the Pizza Prosciutto E Rucola, perhaps because I just love prosciutto in general.  The times I've had this menu item here, the ingredients have always been fresh and full of flavor.<br><br>We usually order the Davanti burger for those of our group that can't make it to lunch at the actual restaurant.  It's got bacon jam on it, cheese curds, garlic aioli, arugula and tomatoes, and parmesan fries on the side.  It's simply mouthwatering.<br><br>The ambiance is great, and it's always worked well for the group setting.  The service is usually excellent.  Overall, I'd definitely recommend this restaurant if you're in the area.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XJ8UJcgUpoqUZJWtqJzm6Q/348s.jpg", "caption": "Focaccia di Recco"}]}}, {"review": {"des": "This has to be one of the least favorite Italian restaurant I've been to.  Out of all the food we ordered (corn salad, brussel sprouts salad, chicken liver pate,carne pizza, truffle egg toast, pawn tiger shrimp spaghetti $20) , and risotto ($17) , I liked the Brussels sprouts and chicken liver pate.  We had to send the risotto back because the rice was still uncooked. The $20 spaghetti looked like it was just thrown on a pot mixed with pasta sauce. It looked very  unappetizing. The dish was barely touched by me and my friends. <br><br>I'm not sure if I'm going to come back and recommend this restaurant to other people.", "pics": null}}, {"review": {"des": "I was pretty devastated when I learned Davanti Enoteca closed their River North location, but I soon recovered when I realized the University Village location now takes reservations. Score! <br><br>On a Friday night when everyone was partying it up at the Lolla festivities, we had a pleasant and quiet dinner at Davanti. We were disappointed the menu no longer had the linguine with uni but we're hopeful it's a seasonal item and will be debuted again! The rest of the items were still consistent and as good as we remember it to be: <br><br>1) Focaccia de recco, the Liguarian flatbread with cow's cheese and honeycomb, is almost always a must-order for me. I am a huge fan of the the pungent and soft cheese. There's also this weird excitement that I get when I run the chunk of honeycomb across the flatbread until there is no more honey to spare. <br><br>2) The mascarpone polenta and ragu of the day was pork sausage. I wished it was the pork shoulder but pork sausage was just as good.<br><br>3) Davanti Burger is excellent and I really don't want to share with three other people. It's piled with bacon jam, roasted tomatoes, cheese curd, arugula, and roasted garlic aioli. To make sure you get a solid bite of each and every ingredient, it's more ideal to just share with one partner in crime.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zkjXEKmlT4qW0PEGdrY_-g/348s.jpg", "caption": "Grilled calamari"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nJBkB_8keywYcGIaJoZcpw/168s.jpg", "caption": "Focaccia with cow's cheese and honey"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_J_d-Q94wye9_CBRuVIXCA/168s.jpg", "caption": "Polenta with sausage ragu"}]}}, {"review": {"des": "Very cool restaurant. The seared octopus was decent. They definitely overcooked it and did not just sear it. Perhaps a new cook? Otherwise the foccacia bread was delightful. The meatballs and Davanti burger were also good.", "pics": null}}, {"review": {"des": "Pro-tip: half off select bottles of wine on Wednesday's and $5 select bites during happy hour M-F 3-6p<br><br>We tried the following off their $5 happy hour menu:<br>- Parmesan truffle fries and garlic aioli<br>- prosciutto veal meatballs + pecorino + ciabatta + San marzano tomatoes <br>- chicken liver pate + cherry shallot compote + Tuscan toast <br>- ricotta + honeycomb + Tuscan toast <br>- grilled pizzetta of the day<br><br>I love crispy fries and the ones here did not disappoint. So good! The pate was very savory. I'm a fan of the first 3 dishes above and less a fan of the bottom two. The ricotta and honeycomb dish is highly revered on yelp, but I didn't personally get what the hype was about. The grilled pizzetta had mushrooms and mozzarella, but was kind of plain. <br><br>We came on a Wednesday and chose a half-off bottle of Sauvignon blanc called la cappuccina from veneto. It costs $38 on the menu so we got it for $19. It's average retail price when I looked it up on Vivino is $15 so not bad at all!! <br><br>Service was good. The interior of the restaurant is charming. We hear there is a cute rooftop and wanted to sit out there but they only serve the happy hour menu in the bar area.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Tdm1nyQREBlZCRC-0BcIDg/348s.jpg", "caption": "Prosciutto-veal meatballs and a glass of Sauvignon blanc during happy hour"}]}}, {"review": {"des": "I'm so glad I got the opportunity to dine at Davanti Enoteca. I don't make it to Little Italy much, and this visit had me wondering why I don't make my way to the area more often! Davanti Enoteca is in a prime location on the main street, and the atmosphere is welcoming and warm feeling. The staff is also very friendly and accommodating. <br><br>Food wise, I wasn't absolutely blown away, but it's definitely worth checking out so you can judge for yourself. We tried the roasted beets, which had a walnut butter that really amped up the dish. It was a great start to our meal. The paccheri e salsiccia pasta and risotto carbonara lacked a bit of the full flavor and love I was looking for in my main dishes.  The meal was enjoyed over a few glasses of excellent red wine and finished off with house made limoncello. Overall, this was an enjoyable experience. Thank you for having us in and treating us so well!", "pics": null}}, {"review": {"des": "Located in University Village/Little Italy - Davanti Enoteca offers good Italian cuisine for a decent price and reasonable portions.  Davanti has more of an \"old-school\" Italian vibe with the rustic, brick interior and wine used to decorate the walls.  You can also see part of the kitchen/chefs as it has an open kitchen concept while still maintaining a cozy feel.  When we walked in we were enthusiastically greeted by two nice hostesses who walked us to our table.  <br><br>Our server was relaxed and checked on us an appropriate amount of times. We started off with the Burrata which was served with roasted Campari tomatoes and a mouthwateringly delicious pesto with Ciabatta on the side.  There was also some extra virgin olive oil generously sprinkled over the burrata.  The burrata was smooth and creamy and went perfectly with the pesto.  It was definitely a highlight of the night.  I wanted to try their polenta since it looked absolutely amazing at the next table but their special that night had meat in it so I wasn't able to try it and wished they had a meatless polenta option. <br><br>Our next course was the Pizza Della Terra, which had leeks, mushrooms, taleggio, and truffle oil.  It was a lovely white pizza delight.  The mushrooms had a perfectly sautéed texture and flavor and the truffle was prominent enough while still allowing for the leek flavor to come through.  I typically don't have leeks on pizza but really loved how it went with the mushrooms.  <br><br>Being big fans of pasta, we of course ordered two pasta dishes: Ravioli of the Day and Orecchiette Alle Verdure.  The ravioli of the day came with spinach and a light wine cream sauce.  It was stuffed with ricotta and tasted very fresh.  It could have been more flavorful though.  It wasn't the  most memorable dish.  The Orecchiette stole the show though and was a dynamic and unique pasta.  It came with ear-shaped pasta, lemon, rapini, escarole, and pecorino.  The sauce was reminiscent of a tomatoey white wine sauce with a bit of chili/red pepper.  I loved the consistency of the sauce and the texture of the pasta.  The rapini was absolutely fresh and brought a distinct flavor to the dish. <br><br>While we had more than enough to eat and were bringing leftovers back, we had to try their dessert.  We had the Torta Bacio, which was a chocolate mousse cake with a chocolate hazelnut crunch and little chunks of cocoa.  It was decadent, yet fresh with a little drizzle of olive oil, which surprisingly went really well with the chocolate.  Our server gave us a complimentary Limoncello dessert drink on the house, which was highly appreciated.  It was a bit sugary though so I couldn't handle too much of it.  <br><br>Davanti has a decent amount of vegetarian and pescatarian options.  If you want an \"old-school\", classic Italian dining experience, Davanti is perfect.  I think some of their dishes could be a tad bit more flavorful but I was pretty satisfied after my time there.", "pics": null}}, {"review": {"des": "An Italian Restaurant with something to please everyone's palettes! The service was friendly, but communication about when each entree came out could have been better, the interior kept with the theme, but there was a strong smell of cheeses. <br><br>We ordered the Bianca Pizze, Prosccuito and Veal meatballs, and the Cauliflower Steak to start! <br>The Bianca Pizza has very strong garlic notes which we loved! Every bite with a shallot was delicious!<br>The Meatballs were also fantastic, the sauce underneath soaked up the perfectly crispy garlic garlic atop.<br>The Cauliflower Steak gave a nice break between the strong flavors of the two previous appetizers. The hint of lemon was refreshing. <br><br>For entrees, we ordered the Orecchiette, Rigatoni Al Lucca, Spaghetti and Meatballs, Seabream, and the Steak de Manzo.<br>The different pastas all came pretty Al Dente, which was fine to us, but might want to tell the server to make a note if your preference differs. The Orecchiette was very salty and a bit spicy in comparison to Al Lucca and the Spaghetti. <br>The Seabream was beautifully crispy on the skin side and perfectly seasoned!<br>The Steak was cooked to our preference and the accompanying potatoes soaked up the amazing sauce.", "pics": null}}, {"review": {"des": "Love this place, food was awesome and the service staff were great. I will definitely go back and taste more exciting dishes.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/o3gTq2rxYkmLqvY2zNyJRw/348s.jpg", "caption": "Polenta"}]}}, {"review": {"des": "My wife and I were here as part of a dinner party celebrating our friend's birthday. We all shared wonderfully delicious appetizers. I recommend them all, including the chicken liver pate, ricotta vasi, fig jam and goat cheese vasi;!also, the roasted beets (I'm not usually a fan of beets but these were dressed up to die for). <br>A shout out to our attentive server, Katrina, who gave spot on recommendations for entrees and wine. My homemade spinach ravioli and my wife's tiger prawns were outstanding.  We will definitely be back!", "pics": null}}, {"review": {"des": "Nice ambience mixed with professional service and great food makes Davanti the perfect place for authentic Italian cuisine! My daughter and I opted for an early dinner vs sitting in traffic. <br><br>Our server Ron made our experience more enjoyable by being friendly, open and very attentive, offering several suggestions as this was my 1st time dining here.<br>They have a large wine and drink selection and options for tap or bottled water. I ordered the Carne pizza and my daughter a (vegetarian)had the Bianca(spinach)pizza.<br>Served atop an old school tomato can! Our food was amazing! The homemade gelato and the brownie blondie were unbelievable! (See pics)<br> <br>I would recommend Davanti Enoteca and I will definitely be back.....I hear they have Sunday brunch!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6oKfbJvR6kQb-XmgOPC9LQ/348s.jpg", "caption": "Pizza Carne"}]}}, {"review": {"des": "OLD SCHOOL ITALIAN <br><br>What a great dinning experience from meeting the hostess to the head chef everything here was top notch. <br><br>We arrived on a Friday at 3pm hoping to catch some of their great Happy Hour Specials. We sat at a high boy table in the bar area. We started out with an order of their $5 veal meatballs with grilled olive oil bread and a $5 special pizza which was sausage, mushrooms, fresh mozzarella and sautéed tomatoes as the sauce. These were on the Happy Hour Menu and will keep me coming back again to get Happy. The meatballs were delicious. How good? We ordered a second dish of them! The pizza crust tasted just like Italy and this is because they are using the Caputo \"00\" flour from Naples. That's the best flour to make pizza and pasta at home any day. It just tastes like the Old World. We also washed this down with two ice cold Peroni beers on tap. <br><br>After letting all this food settle in, it was time for round two which consisted on a Caesar Salad but this was too authentic for my wife. It even had the anchovies on top. She felt the dressing was too fishy. It was fishy but it reminded me of the way this salad use to taste. So I'm good with keeping it real. Next came round three which consisted of several items: the seasonal house made ravioli, risotto carbonara and the amazing house burger. Everything was really amazing. <br><br>I was truly impressed with the carbonara risotto complete with a raw egg on top. I make pasta carbonara weekly at home and loved this new twist. I'd highly recommend you try it but just be prepared for that raw egg. I'm sure Rocky would crush this dish every day. The ravioli was completely house made. The sauce was really good. It was a brown butter cream sauce with sautéed spinach. The filling was ricotta with fresh lemon zest. I really loved these. Now let's talk about the burger. It's one of the best we've ever had. We first had this burger at the Amstel Light Burger Bash and after my first bite I couldn't believe an Italian restaurant could make a burger this good. In fact, they took out all the competition that year winning the whole contest. After four years that burger still remains a winner. It is perfect. I'm not sure what the meat ratio is but I do know that chef grinds the meat in house. We ordered the burger medium rare and it was cooked perfectly. The side of parmesan fries also rocked. We actually ended on the burger and it was the star of the show for us. I must also tell you that we didn't eat all of this on our first seating. We actually packed some of it up to enjoy the next day. I must be honest and say it was great on day two. <br><br>Service was amazing. We actually interacted with four people at our table. The hostess was amazing and super cool. She came to our table several times. Our waitress rocked and she spaced out our dinner perfectly. She even went to the kitchen when I asked if the flour was from Naples, Italy. She sent over the wine guy to talk to us about the flour. He was a wealth of info. We talked burgers, flour, history of the restaurant and of course wine. He made several visits to our table and we had fantastic conversations with him. The head chef even stopped by several times. He kept asking us about dessert but we were so stuffed. He finally sent over a small fresh strawberries and cream dessert for us to try. The strawberries were from a local farm and they were so good. We even received two chilled lemon-cellos to end the night. Did I tell you that I love Taylor Street!!! This is how dinner should be served...old school Italian...eat until you pass out with incredible food and drink. We can't wait until we come back for another visit. The Happy Hour is really good and totally worth it. We are even planning our next mission and yes the veal meatballs and pizza are on the table. Thanks so much for a great dinner. I still might be in a food coma.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZRnvo5FWrQ7oyZZxT7vM_A/168s.jpg", "caption": "A comfortable place to relax, sip wine and have a fantastic meal."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EMYtK_kNn4-PxZ_BKq7Ltw/168s.jpg", "caption": "Lemomcello is the perfect way to end dinner!"}]}}, {"review": {"des": "Gosh I loved Davanti Enoteca! I used to live walking distance from there but somehow never came here. Luckily I got a gift card for this place and with that I was able to try several things from their menu. First of all, the interior is absolutely beautiful!! The area in the back is so beautifully decorated with dark wood and wine bottles all around you - gives it a really nice, cozy, yet classy vibe. When we arrived a little after 7PM on a saturday, there were plenty of open seats but the restaurant soon filled up by 8PM.<br><br>We started off our meal with Fig Jam & Goat Cheese vasi ($9). Omg this was amazing! It's presented really nicely and they give you a lot of cheese. Followed this with Focaccia di recco ($21) which is flatbread filled with cow's cheese and with honeycomb. Another excellent dish - it tastes so fresh and the cheese melts in your mouth. I loved the piece of honeycomb on the side. This dish is a bit pricey, but the quantity is huge (it's after all listed as \"for the table\"), I would say it could feed 4 people. My recommendation to the restaurant would be to offer getting half of it for half the price. Between the two of us, it was way too much and we ended up taking more than half of it home. In addition we got the Polenta & Ragu ($17 for the small). This was pretty good as well. For the main course we ordered the Rigatoni alla Giorno ($25) from the featured menu. It comes with beef and ricotta. An ok dish - I wouldn't recommend it. I thought the pasta was a bit undercooked, overall was a bit salty, and $25 is a bit much for this dish. <br><br>For drinks we tried the spritz, moonshine punch, and negroni ($8-9). The first one was good, the moonshine tasted like capri sun (delicious but not sure really how much alcohol was in it), and the negroni was really bitter (but not an expert on alcohol so maybe it's supposed to taste that way?). For dessert, we got the brown butter blondie which was wayyyyy too rich and sweet. We were only able to eat the ice cream on top which was delicious! They were also kind enough to give each of us a free lemoncello to finish off our meal :)<br><br>Overall, I loved davanti enoteca! The dishes that are good here are REALLY GOOD! Others are ok, but they get 5 stars from me despite that because the interior is beautiful and well maintained, and service is excellent! I also learned that they have weekly specials, happy hours, etc so I will definitely be back. Thank you to the yelp community for the gift card and for this wonderful experience!", "pics": null}}, {"review": {"des": "Not to sound dramatic but this is by far the absolute best restaurant in the area. The staff are personable and attentive, the food is BOMB (and consistent), and the drinks are so well made and so reasonably priced. My boyfriend and I go here every Sunday for brunch and it never gets old. The atmosphere is casual and welcoming but still very much deserving of a date night. I cannot get enough of this place and plan on coming back every opportunity possible!", "pics": null}}, {"review": {"des": "Hubby & I popped in here on a Wednesday, during happy hour. Have never been here before, but were driving past and it looked interesting. So happy we did! We shared a truffle egg toast (scrumptious!); he had the salmon (perfect!); and I had the seared octopus (OMG!). Great wine list, too! After we were done, our server brought us each a lovely limoncello, that rounded everything out perfectly! It was busy, and we didn't have reservations, so we ate at the bar (which is often actually kind of nice--more people to chat with). Next time, though, I think we'll make reservations. This place has a warm, friendly ambiance. Loved it!", "pics": null}}, {"review": {"des": "Davanti Enoteca; what a beautiful name. I had the opportunity to have a wonderful dinner here last weekend with my gal. Although I was expecting something more high class, what I got the second I walked inside was just as good. First thing that must be mentioned is the wonderful job the restaurant did with designing the interior. So genuine, traditional, with an old world feel as if i stepped into a different country. Very nice to look at. <br><br>The service was so helpful in giving us any information such as thoroughly explaining the dishes on the menu and the wine list. They were very attentive which is always something I personally admire when I'm dining in. Once we got our food, I was mostly impressed and pleased. Some dishes are small plates used to share with other guest, while others are normal personal dishes. We ordered a few small dishes, ricotta toast, Caesar salad, and ravioli; all incredible dishes with creative variations to em. Only thing that's a bit crazy here are the prices. $10 for some bread, I mean really? I mean I had a gift card so it didn't matter but wow, the high life must be something if toast is that much.<br><br>Little Italy is home to many elegant and traditional Italian restaurants and eateries. Take advantage of what you got here, living in the city instead of putting another frozen pizza in the oven!", "pics": null}}, {"review": {"des": "I have officially become a regular.<br><br>Unpopular but true opinion:<br>Don't tell the hipsters but this pizza is about 100% better than Parlor.<br>I've eaten my fair share of za at both places and now that the roof top seating at Davanti is open for the summer... let's just say it's been nice knowin' ya Parlor.<br><br>Pro Tip:<br>If you like the \"burratta be kiddin me\" at Parlor, get the Pizza Prosciutto e  Rucola and ask for a side of truffle oil.", "pics": null}}, {"review": {"des": "Katrina gives excellent professional friendly knowledgeable service.<br>This is a good place for small celebrations.<br>Small shareable plates are what's offered. The polenta topped with ragu is delicious and a specialty. The warmed olives have been seasoned in a special marinade with orange rind zest and are very tasty.", "pics": null}}, {"review": {"des": "I had a chance to try this restaurant and I was really impressed with the happy hour menu!  Not only the selections were great, but they also offer a variety of options for a very good price! Would definitely order the chicken liver pate, polenta, rigatoni and the blondie with sea salt caramel again.  Not a big fan of the grilled octopus with the mustard dressing.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JLqE_nB2N_TQZxJv6-sqIg/348s.jpg", "caption": "Toast.  This can be turned into avocado toast"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/b62Fm32S3JL-dL7cradvXg/168s.jpg", "caption": "Polenta prepared on your table"}]}}, {"review": {"des": "As we gobbled down our passarounds, I noticed other diners were just eating pizza. I mean that's cool and all, but if you're just in coming for pizza you're missing OUT on some great great unpretentious, super tasty Italian dishes that may change your entire night in a good way.<br><br>Get that high top next to the kitchen. Get that bottle of Chianti. Get that Polpo Con Rafano you've had your eye on (goodness this is delish) . Get that bubbling cows cheese focaccia de Recco (or what I like to call the Italian quesadilla). Get that house polenta+ragu (today was a sweet sausage & peppers combo that was mmmmuah!). Get that Cacio de Pepe (my wife's favorite). Get that orcchietti. Get that cauliflower steak with chickpeas. Get that mushroom risotto (the rice is perfect, the broth so savory and creamy). Get dessert (get all of them). Get that apertif. <br><br>Thanks to Pete and Joe C. for a wonderful night with our loved ones. It was great meeting you tonight!", "pics": null}}, {"review": {"des": "*4.5, for sure. <br><br>Wednesday = half off wine bottle night. Don't miss out on such a good deal! <br><br>Highlights: the Branzino!! What a treat. Did not take long to prepare, and yet it came out PERFECT. As did the Salmon. I love my fish *slightly* charred, and they achieved that with ease. I was so satisfied. <br><br>Meanwhile, the cooks are SUPER accommodating when it comes to dietary restrictions.", "pics": null}}, {"review": {"des": "I was traveling and stumbled into Davanti's in search for quality Italian. The place is decorated with brilliant Italian taste. The staff are friendly, funny, and warm. I felt like I was a regular. <br>The food was delicious. I'd highly recommend.", "pics": null}}, {"review": {"des": "Tried this place out last Saturday for brunch and it was amazing! <br><br>$15 bottomless mimosas.... and they have a make your own Bloody Mary Station... Need I say more?<br><br>The breakfast potatoes are seriously delicious and they even have steak & eggs. <br><br>I am unsure about the lunch & dinner menu but as far as the brunch it is pretty solid.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hj3dKxpMFDrZV6liYf-Llw/348s.jpg", "caption": "Brunch menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ah03fW95mGA6Wpz4-b0tcg/168s.jpg", "caption": "part of the make your own bloody Mary bar"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QdtOxbKMsqpO6-I0FecsOA/168s.jpg", "caption": "breakfast potatoes"}]}}, {"review": {"des": "Stopped in for my favorite farro, butternut squash salad, but instead had beets with creme fraiche and walnut paste. Whoa. Followed with halibut on fresh corn, red peppers and other great tastes. Amazing. <br><br>Had the pleasure of sitting up on the roof deck which I didn't know existed.  Very nice. <br><br>Only suggestion is to bump up your bourbon selection. Buffalo Trace or Makers Mark needs an upgrade!", "pics": null}}, {"review": {"des": "It was my first time there. Lies in my neighborhood so tried it out, everything was delicious.<br>Will definitely be visiting again and I can't wait to try brunch there", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xCA_Upn5Tnlbw0jhDhgbyw/168s.jpg", "caption": "Yummy"}]}}, {"review": {"des": "The honey and cheese...so delicious! Especially paired with a nice wine. I'm sure I'll be back, but mainly just for this appetizer. The service and decor was excellent. The main entree was decent. Definitely a good spot for a date.", "pics": null}}, {"review": {"des": "The rooftop area is pretty cool. A friend and I were lucky to be up there alone until a couple of minutes before we left. Our main server Megan was pretty nice. Thanks Megan!  My friend really enjoyed his Caesar salad and Orecchiette alle verdure with sausage. He had no issues with either. He liked the different flavors in his dish. I had a Davanti burger with fries and an order of arugula. The burger had a great deal of flavors from the different ingredients. The meat itself lacked flavor for some reason, so that was disappointing, but overall the burger was quite interesting. This place is worth a try to check out.", "pics": null}}, {"review": {"des": "Ordered for pickup and what a disaster. Firstly, they weren't ready on time and I ended up waiting. Secondly, they got the order wrong. Third, they told me my whole order was in the bags handed to me, only to call me after I was 10 minutes away in an uber having forgotten to give me half my order. Mistakes do happen, but when I came back, the manager was rude and dismissive of me. The food is always good, but their service and operations really need some work.", "pics": null}}, {"review": {"des": "I'm Alejandro B. and I approve of this restaurant! <br><br>I wanted the type of Italian food I can't easily find at another restaurant or cook at home. It had to be innovative. Davanti was it! <br><br>My friend from Chicago and I came here when I was in town for a job interview. We split the polenta and ragu appetizer. Despite being humble with very simple ingredients (basically cornmeal, water/stock, and butter), polenta takes foreveeeeer to make, with a low of stirring, and the odds of your homemade polenta being clumpy or grainy are high. Davanti's was smooth and creamy but still light, and paired splendidly with the beef cheek ragu. <br><br>The gnudi was pillow-soft and had a great cheese infused sauce. I really enjoyed my saffron spaghetti with mussels. <br><br>The dessert stole the show here. I don't think I had ever tried a blondie, but when I asked our waitress for recommendations, she lit up and instantly pointed us in the direction of the blondie. She explained how it's made (butter, flour, and other goodness), and how it's served with caramel gelato and nuts, plus drizzles of caramel. Sold! (Fun fact: Midwesterners sometimes pronounce caramel like \"kernel\"). Eater Chicago wrote about this dessert in its top 10 Chicago sweets ranking, but you'd never know it from the menu. I'd come back just for that dessert!<br><br>Ambience is warm and inviting, with plenty of soft light and exposed brick (hint: good place for dates!). <br><br>Davanti hit the spot! Now let's hope I get the chance to move to Chicago so I can come back more often.", "pics": null}}, {"review": {"des": "The atmosphere is awesome and if you are looking to bring a date somewhere, I 100% suggest this place.  In fact, I probably was the guy who embarrassed himself a few years ago because I too regularly brought new girls there who I wanted to impress (I had several awkward conversations with waiters where they tried to say they knew me and asked whether \"I came there regularly.\").  If you go, my number one, two and three suggestion is the focaccia bread with honey.  I also really am a fan of the truffle egg toast and their favs to burger,  I've more recently trying to replicate the truffle egg<br>Toast, but I can't quite get it right :).", "pics": null}}, {"review": {"des": "Where do I start? Our dinner at Davanti was such a delicious, well-made meal and great service. I can also say the Davanti burger was easily one of the best burgers I've had in Chicago. The rooftop is also quaint if you can get a seat up there in the Chicago summer months.", "pics": null}}, {"review": {"des": "This place had such a nice ambiance to it and overall very nice decor/setup. I ordered the Bianca and it was very good. Definitely a different take on pizza but still very good. <br>The only thing that was a little odd was that the pizza had full garlic gloves on it. It may have been better if the garlic was at least minced, as to have it spread evenly over the pizza. <br>The reason they lost a star was because service was a little slow but there were a decent amount of people there, so I understand having a hard time getting to everyone in a timely manner. Also because after asking for a side of marinara, I burned my mouth pretty bad. I knew it would be heated up but It was extremely extremely hot!", "pics": null}}, {"review": {"des": "I came here on a Friday night with my husband for date night. We had reservations. I feel a bit torn writing this review because the food was mostly very good, but the service and general way this place is run are awful. I'm pretty surprised this place has as high of a rating as it does. Perhaps this restaurant treats a table of two very differently from larger groups.  <br><br>The good: the ragu/polenta dish is not be missed. The ricotta was fabulous.<br><br>The bad: Brussels sprouts were huge, under cooked, and under seasoned. Reminded me of the way my parents used to cook this veggie in my youth, and not in a good way.<br><br>Ambiance: crowded and the radio (turned to a radio station with ads and everything!) was very loud.  Waitress would squat down and shimmy between the high top bar tables trying to get through. The servers knock you if you are sitting in the bar area.<br><br>Service: Inattentive, forgetful, haphazard, rushed.  Didn't greet us for a long time. Forgot my husband's drink order. Forgot that we ordered the brussels sprouts...so had the veg for \"dessert\". The poor couple next to us was similarly mistreated, and frankly, had it way worse. They only got their main dish after we had paid our bill, despite us arriving and ordering after them. Yikes.", "pics": null}}, {"review": {"des": "We tried waiting in line for Stax right across the street and happened upon this place accidentally - turned out to be the best happy accident! <br><br>The food came out amazingly fast, the kitchen was killing it for a Mother's Day Brunch. Highlights:<br>- build your own Bloody Mary bar (actually spicy, options like bacon, gardiniera, olives, etc.) <br>- burrata app with House-made pesto!<br>- pork belly hash, perfectly seasoned and big flavor<br>- blondie caramel ice cream dessert (this was AMAZING. Didn't expect much from such a standard order but it was so so moist and the use of marcona almonds with the dish just added extra Blondie points)<br><br>Service was also on point! <br>Recommend for sure.", "pics": null}}, {"review": {"des": "Fine food. Terrible service. <br><br>When asked about our check 50 minutes (Not an exaggeration) after handing over our card told \"we're working on it\" complete with an eye roll. This is entirely too long to wait for someone to swipe your card. Will not be returning. Charged multiple times with different amounts, tying up the incorrect funds for days.<br><br>Told gratuity was not included when the cards finally came back. Heard the same person who informed the table of the previous sentence telling the staff \"I didn't want to spend any more time working on it. So I just did it\" Beige shirt, green pants, curly hair: people are watching and listening to you when your on the floor.<br><br>This is my first yelp review. I've never been angry enough to post", "pics": null}}, {"review": {"des": "My husband and I stopped in Sunday evening and sat at the bar for a quick snack and drink. Everything on the menu sounded delicious, but we had to go with the ricotta and honeycomb that I'd heard about, and also ordered the prosciutto and veal meatballs. The ricotta was creamy and fresh, and great with the honey on the toast; I just wish there were a bigger portion of honeycomb - it wasn't really enough to go with the amount of cheese and bread they give you. The veal meatballs were huge, probably at least 2 1/2 regular-sized meatballs in each one, and very tender and moist, with a slight heat. <br><br>Staff were friendly and attentive, decor was rustic Italian, TVs at the bar - overall chill atmosphere that afternoon. We'll definitely be back for Happy Hour (M-F, 3-6 PM) when the appetizers and a few other things are 1/2 price, and bottles of wine are also 50% off on Wednesdays.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sT4weiguNxMSlD4jSA1_Bw/168s.jpg", "caption": "Ricotta and honeycomb."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9RzLivtyCeGjBo1S5WXIZw/168s.jpg", "caption": "Possibly true?"}]}}, {"review": {"des": "We went out for brunch at Davanti for my boyfriend's birthday for what we thought was going to be a fun and relaxed meal with bottomless mimosas and delicious food. The reviews on Yelp for this restaurant are pretty good and we were excited to see what the place had to offer. Although the food was decent and the mimosas were pretty strong, our experience, particularly with the service, turned out to be horrific.<br><br>Granted, we had a pretty large group. I want to say there were about 10-12 of us. However, we made a reservation in advance and were assured that it wouldn't be an issue. Because of how large our group was, we also asked the server at the very beginning if she would be able to split the checks. She said she couldn't provide individual checks but would have no problem splitting everything up at the end on our various cards. So I didn't think there would be any problems. I was wrong.<br><br>From the very beginning, our server practically ignored us. She only came to our table a handful of times - and when she did, we were met with eye rolls and one word answers. However, the icing on the cake didn't come until the very end of our experience when the check was brought to us. We handed her the check and our cards and explained what was to be charged to each card. We were met with a confused smile and head nod. She didn't indicate there would be an issue. Everything was fine, right? Wrong.<br><br>Some 50 minutes later (I'm not exaggerating), another woman (who I believe was the manager) handed back our cards with charges that simply did not make sense. Many of the charges were much greater than what we had ordered. Although we were assured that these checks did NOT include tip, we are pretty sure that we were lied to. Upon looking at our bank accounts and credit card statements, turns out we were all charged 3 or more times with varying amounts. And days later, we were all charged an even greater amount. As of right now, there are four charges on my credit card from Davanti totaling more than $130 for a brunch that should have cost no more than $50. If it was so hard for them to split our check, why make a promise at the beginning of our dining experience that you can't keep? And then take almost an hour messing around with something you obviously aren't capable of doing.<br><br>If I could give 0 stars I would. I am absolutely appalled by what happened at this restaurant. I wouldn't recommend going here unless you want to spend an arm and a leg for a terrible time.", "pics": null}}, {"review": {"des": "It was pouring outside and we wanted to grab a quick drink at their bar before catching the comedy show at UIC pavilion. <br><br>We got there and it was already super busy at 6:15pm and the bar was packed- our hostess Ellen could tell we were antsy and in a rush so she offered the free table behind the hostess stand that would be free for another hour. <br><br>She said she'll take our drink order and any food order and will rush it since we have a show to catch!! This is what \"service like you mean it\" means and also \"acting like a business owner\". <br><br>Her amazing service- she was attentive and the bartender came and dropped off our drinks right away. We were the ones in a rush- there was no need for them to accommodate us but they did and their service was genuine. <br><br>We felt so welcomed right from the start- we ordered two vodka sodas and their chicken pâté for a quick bite- everything came out within minutes- <br><br>Thank you so much for your service- we've been here before for their food and it is amazing! I was totally impressed at how they accommodated customers who weren't fully dining in- even though they were super busy!! Can't wait to come back and enjoy a full meal!!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bUhqnxTgcKYOD1hS-kvG5w/168s.jpg", "caption": "Some vodka sodas"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QvMBFG4YVLrSvtGiEbtF0g/168s.jpg", "caption": "Chicken Pâte"}]}}, {"review": {"des": "I ordered their burger medium well.  Obviously, it may have been rare, possibly medium rare.  There was absolutely no flavor to the burger, it was a mushy mess, no crust on the outside.  They said there was bacon jam on it, but you couldn't taste anything.... not even salt or pepper.  Very disappointed and even after leaving half the burger on the plate... no one asked... how was everything?  Poor food and poor service.  Plus I waited an hour for the burger, like they were killing the cow in the back of the house.", "pics": null}}, {"review": {"des": "I've been going to Davanti shortly after they opened, once I could finally get a reservation. Fast forward all these years later, it's one of my most frequented restaurants. Their small plates just make sense. Cauliflower steak, the beets with walnut sauce, unreal. Brunch is good and I've had a few business lunches there. Great spot, though it can get really loud.", "pics": null}}, {"review": {"des": "Went in for lunch- the high price & small portion size of the pasta entree made me feel scammed.", "pics": null}}, {"review": {"des": "Great service, delicious food and wine! <br>The octopus is great after the cauliflower steak.", "pics": null}}, {"review": {"des": "I didn't know much about Davanti Enoteca on Taylor, but found it on Yelp. Wow, it was a very pleasant surprise and a wonderful experience! The food, the staff, the shared plates concept, local farm fresh ingredients, and the setting were perfect for a wonderful date night with my beautiful wife!! It started with my call to the restaurant because we were going to be a half hour late for our reservation. The host was so accommodating and told us not to worry they would take care of us. When we arrived we were able to be seated in their new rooftop area. It was a small but charming rooftop (with a retractable awning if it were to rain). We were greeted by a very knowledgeable and excellent server - Christina with very helpful suggestions on foods and wine. We started with a daily special of fried squash blossoms stuffed with goat cheese, and the Burrata - a deconstructed Caprese served with garlic toast. Both were excellent, and the ingredients we very fresh! Even the mozzarella was house made. A glass of proseco was a nice combination. Next we had the spring pea and fava bean salad which was wonderfully fresh and tasty. For the main dish we had the fish of the day - pan seared sea bass with fresh peas and sweet corn. Tremendous! Christina made an excellent suggestion of the Terlano Pinot Blanco that paired nicely. We finished with a house made shortcake with fresh strawberries from their farm source. Then the manager came by with two chilled glasses of their house made Limoncello! If you're not drooling you should be!! A wonderful evening!!", "pics": null}}, {"review": {"des": "We had lunch here and it was great. Burger was very delicious, juicy patty with a mild sweet sauce and good fries. Loved it. Pizza was thin crust, which I like. We had the D.O.C, it was simple and tasty. Pasta was good, al dente , right portion size to share and ingredients all very fresh. For dessert we had the brown  butter blondie, liked the contrast of temperature and texture between hot cake with cold, creamy ice cream but a little too sweet for me. Overall, very good place to have some Italian food. Will come again next time.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7asnkve14xMo7EAccd7ulA/348s.jpg", "caption": "Brown Butter Blondie"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uQigPmQ3oMUcRwVzxN6G8w/168s.jpg", "caption": "Fettuccini E Gamberi"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oyjQSE-o6WfomN89UhXC7A/168s.jpg", "caption": "Davanti Burger"}]}}, {"review": {"des": "One of my favorite spots to dine at, super friendly staff, cute little restaurant they even open a small little roof spot during the summer. Everything i have had here is delicious, ive never been disappointed. The cacio e pepe is a staple there and it is delicious. The burger is a gourmet burger that is to die for (i think Mondays they have a beer and burger special....but don't quote me because I might be wrong...but its a must try!) It is a place where it is family style things come out when they are ready which is my favorite way to eat. I love to try everything. I think anything you get you will be extremely pleased with.", "pics": null}}, {"review": {"des": "Great option for a romantic date. I've been here twice with my wife and have not been disappointed. <br><br>Restaurant is pretty, and service is quite good. (Shoutout to Christina! - she was super friendly)<br><br>We tried the prosciutto and Bianca pizzas, and they were good, but nothing to write home about.", "pics": null}}, {"review": {"des": "3.5/5 <br><br>Stopped here after reading that they served uni/sea urchin pasta, but sadly it was removed from the menu awhile ago! The food and ambiance were alright, service was good.<br><br>I ordered the parpadelle bolognese and my fiancé ordered the special tagliatelle carbonara. The noodles in both dishes were fresh and delicious, but we both felt that the carbonara was missing pancetta that was listed in the menu description. It almost tastes vegetarian to me. <br><br>Lastly, we were unaware that this place was tapas/shared plates style. We felt the price was a little steep for the portion of food, especially with two people where we can only order a couple dishes to try. <br><br>Will try again next time!", "pics": null}}, {"review": {"des": "Knocked off a star because the service was just that terrible today. Party of 4, seated in the back (we literally had to shout to hear one another, it was just ridiculously loud to be surrounded by large parties), and no one took our order for about 10 minutes.<br><br>Our server was probably overwhelmed by the packed house (it was a crowded Wednesday night), but was only there to take our order (after tables that had been seated after us) and give us our check (late again, as we had our food packed and had waited about 10 minutes). <br><br>While the food was fantastic, the order of the food, as well as the pace (if there was any) was uncomfortable and we felt rushed by the busboys to finish eating, when we had clearly ordered a lot of food for the four of us. One of the men cleaning up our dishes asked if we wanted dessert about three times in a row, aggressively, and we had already said no the first time. He also made a fuss about where to put the food he had packed up for us (why not just on the table?) while asking us, \"Which one of you is going to take this huh?\" <br><br>All the servers seemed unhappy, and we definitely felt it during our meal. While the food's enough for me to come back, I would think twice about trying to have a group of friends eat together here.", "pics": null}}, {"review": {"des": "Brought my family here for father's day because I read about the awesome burger they serve. We had a GREAT time and the food was amazing. That was seriously the best hamburger i've ever had. I love salty sweet and it definitely brought the magic. The french fries were also a 10/10! I ordered some delicious ear shaped pasta recommended by our really chipper and attentive server Amanda. Shoutout to Amanda! The whole night was great. I recommend coming here for a nice family event.  The atmosphere was a great mix of casual while also a nice dining experience. I loved that the restaurant wasn't too loud. We were able to have a nice conversation. GET THE BURGER.", "pics": null}}, {"review": {"des": "I wanted to take my parents out to a nice lunch in the UIC area, and after such a great experience at the river north location I decided to try out davanti enoteca again. The food and wine were excellent, though I was not a fan of our waiter. I look vsry young for my age but did not appreciate being treated like a child. His comments were degrading, and ruined what would have been an excellent meal.<br><br>But like I said earlier, the food and wine were delicious! We ordered the Cabernet Sauvignon- very smooth and excellent with the dishes we ordered also. We shared the bruschetta to start- I loved the soft bread and fresh toppings. Next we shared the escarole salad, which was very refreshing with the rest of the meal. We also ordered the grilled octopus- my favorite dish! Super tender, juicy, and flavorful. Finally, we shared the giant ravioli, a little strange that it was actually just one big piece of ravioli. Not the best choice to share such a small pasta dish.<br><br>Overall, I loved the food and the Cabernet, but again, I wish we were treated a little better by our waiter! Still would recommend this chain.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/v0YE-vDzNOPlTd1Pla_FLg/348s.jpg", "caption": "Escarole salad and bruschetta"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qFlXol_xeaTC4nrFj3Uoig/168s.jpg", "caption": "Grilled octopus"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4_i0NGnkeMOAJmk4lE0pJw/168s.jpg", "caption": "Giant ravioli"}]}}, {"review": {"des": "My first review ever. Jesus Christ. The pizza, risotto, chicken dishes were amazing. The dessert was amazing. The service was spectacular. The wine was great and they gave us a round of fancy lemoncello on the house. I'm so pleased right now.", "pics": null}}, {"review": {"des": "Great dinner and service last night.  I want to suggest changing the music and the volume.  It just doesn't seem appropriate to be blasting EDM music on a Sunday night.", "pics": null}}, {"review": {"des": "When in town you need to stop here. Atmosphere, food, and drinks were all amazing. No wonder why their rating is so high even with the sheer volume.", "pics": null}}, {"review": {"des": "The service was fantastic.  They have a cozy rooftop patio.  Nonna's ravioli was mediocre at best.  The ragu (pork shoulder) and polenta was excellent.   Both dishes were a bit too salty.", "pics": null}}, {"review": {"des": "Food: outstanding!  Service: A++!!  We enjoyed an amazing meal here - each dish better than the next.  And then the dessert - beyond delish!  The only thing better than the food was our server Ron K. who took amazing care of us - felt like we walked out with a new friend!  We'll be back again and again... a delightful evening!", "pics": null}}, {"review": {"des": "Excellent brunch!  My friend who is vegan also enjoyed her food as there are plenty of options.  My pasta was EXCELLENT and they didn't skimp on the mimosas. The dining room is cozy and they had the windows open to enjoy some fresh air.", "pics": null}}, {"review": {"des": "So good.  One of the best Italian meals we have ever had.  Everything is served family style so great for sharing.  Pastas were amazing, appetizers delicious.  End with a limoncello and you won't go wrong.", "pics": null}}, {"review": {"des": "Very romantic vibe and decor with extensive selection of wine library in Little Italy. It's a share tapas style and food is pretty good, got the grilled octopus, skirt steak, ricotta cheese with honey comb. All pretty authentic", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xp-i-U6z48tdjGJQ0OS5Kg/348s.jpg", "caption": "600 day prosciutto with Apple slices"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_2CBxODKWS-kGi3u6vANwg/168s.jpg", "caption": "Grilled octopus"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7EoQsXfPq1KJJUQdARScCA/168s.jpg", "caption": "Skirt steak"}]}}, {"review": {"des": "This is a cool spot, with a Great atmosphere. I had a ribeye with some kind of composite butter. It was truly delicious, but removing one star because it was overcooked. For reference I ordered it medium well, and it was solidly well done - but, very delicious.<br><br>Service was great, I would recommend this to people coming in from out of town looking for a trendy spot with small plates so that many options could be tasted.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/12L_tBGVWGPOx5GBmbF2Ow/348s.jpg", "caption": "Bistecca Fiorentina"}]}}, {"review": {"des": "Excellent for all 3 dishes. Bruschetta was super delicious and lovely. Totally exceeded my expectations!", "pics": null}}, {"review": {"des": "This place was a wonderful find during a conference. Went with five people and truly took advantage of the sharing size on most of the plates. The meatballs were the crowd favorite followed by the bread with whipped ricotta and honey. Patrick our waiter was friendly and quick to bring drinks and refills.", "pics": null}}, {"review": {"des": "We were invited here by our friends who live in Chicago....absolutely amazing!! <br><br>The Focaccia De Ricco was to die for, was leery about spreading the honey on top but was fantastic.<br><br>If ever back in Chicago again will be the first place we eat.<br><br>The service was wonderful too everyone very nice.", "pics": null}}, {"review": {"des": "We came for sunday brunch. Great food bottomless mimosas and a really friendly staff. We had pork belly hash, steak and eggs, a burger, and a side of toasted bread and fig spread. Everything was fantastic.", "pics": null}}, {"review": {"des": "Great appetizers and super friendly service and a nice romantic place with a sweet wine selection", "pics": null}}, {"review": {"des": "A group of us were there last night for dinner. The food was absolutely amazing but our server Ron made our night! He was great! By far the best service I've had! We will definitely be going back for the food and to see Ron!", "pics": null}}, {"review": {"des": "Extremely nice place. Came here for a date night, and looked forward to the flake off wine Wednesday special. <br><br>Waiter informed us that two people would be 3-4 dishes. We ordered the bread and ricotta, the cauliflower steak, and the terra pizza. We also had the Hess red wine. Food came at appropriate times, and our water glasses were tipped. The service was tasteful, non intrusive, and quite welcoming. <br><br>I strongly recommend this place for a small group of friends or dates. Parking is possible on the streets, paid and free.", "pics": null}}, {"review": {"des": "I love this place!!  Outstanding Food!!  Great decor!!   Wonderful Service!!!!   Convenient location!   Very clean!  Highly recommended!!!", "pics": null}}, {"review": {"des": "Ugh. We want to like this place but service has gone down each time. <br><br>We started going less frequently and sometimes return, forgetting about I the bad service, remembering the great food and service we had on our very first visit. They're just clearly past capacity - the kitchen isn't large enough for the number of guests they have. <br><br>This last visit a month ago, we waited ages to place our order, then about half hour for our first two dishes (including a simple app), then ~45min later they came to tell us they forgot to place the last and would start it right away. At which point we said to not bother. And the dishes we did get weren't even that great, despite being super hungry from the wait. :(", "pics": null}}, {"review": {"des": "Came here for dinner last night and left with a full belly and a smile on my face. The best kind of dining experiences I find are the ones where you have the option of ordering platters and sharing them amongst everyone as they come out hot and fresh one by one. Just as one plate of your starters is being taken away, another one replaces it offering a new variety of flavor and experience. We must have ordered half a dozen different plates from the menu accompanied by two bottles of wine and the rich combination of the two completely dazzled our taste buds. All I can recommend is that you try to order at least a dish from each section of the menu for the ultimate dining experience. You will leave feeling just as satisfied as I did, I guarantee it.", "pics": null}}, {"review": {"des": "We had reservations this past weekend and had to change the time twice due to running late. The staff was extremely friendly on the phone and in person. Joe, the restaurant general manager and Gianna, one of the restaurant bartenders made our experience delightful. We ended up coming back two days later and were assisted by Gianna again. Once again, the service was fantastic. She and the other employees were always checking up on us. They would always find something to do if they were not helping us or other customers. Thank you again Gianna for all of your hard work and making our experience amazing!", "pics": null}}, {"review": {"des": "If you don't mind being frustrated with your delicious food then this is a great spot. Brunch was a mad house and bottomless mimosas sound great until you wait 15 minutes between refills. The Bloody Mary bar also sounds delicious until all of the fixings are and it takes 25 minutes to replace. Entrees were tasty coming at all different times making eating together pointless and the kicker is ordering pancakes to only be told once you are served them they have NO syrup. \"Don't shoot the messenger says the server\" <br>To the managers credit, after a short visit the pancakes we're compd and magically syrup was found. Very tasty but a bit crazy for sure.", "pics": null}}, {"review": {"des": "Went to Davanti for Sunday brunch and liked the breadth of options - got the ricotta pancakes the sausage side dish, the brown butter blondie, and the Old School Italian on tap. I think the drink was composed like an Old Fashioned but with the additional of an Italian amaro - it was fine but unmemorable and a little weak. The lemon curd that came with the ricotta pancakes was lovely and tangy-sweet but the pancakes themselves could have used some more air in the mix. The sausage side dish featured a wonderfully snappy casing and roasted grapes that worked well to keep things fresh on the palate. The brown butter brownie was very satisfying, served warm with lots of rich sweet and nutty flavors. I had a cappuccino with my dessert and the foam was fabulously frothy, standing up about an inch above the espresso. <br><br>Will want to come back for dinner sometime and get more dessert.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gi2c_luKkGZHAgsuZAXL7A/348s.jpg", "caption": "Ricotta pancakes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CmcClyJzmemAyzre5SCOUw/168s.jpg", "caption": "Sausage side dish"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KG0r_1Sj3syKkoC_VeZOBg/168s.jpg", "caption": "Cappucino"}]}}, {"review": {"des": "I've visited this place twice and enjoyed it both time. I'm not usually a big fan of Italian food but I liked their food. They have the best Brussels sprouts in my opinion, I also recommend the lamb lollipop.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qjXnn8XfYoY_FD-yBYcDGQ/348s.jpg", "caption": "Seafood with rice"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PJi-CyVmDfkaW4V0m4SGcg/168s.jpg", "caption": "Pasta"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ymTmlKdYankhB9d9LpN-Tg/168s.jpg", "caption": "Lamb lollipop"}]}}, {"review": {"des": "Omg! Everything we tried was awesome. Brussels sprouts, bruschetta, spaghetti, and pizza was all amazing. The ambiance was wonderful. Hard wood floors, cozy tables surrounded by wine racks. The wine room was awesome, the staff was too. Our waiter was a little sarcastic but he was not offensive. We loved it here. We found it on YELP based on the number of reviews, we knew it had to be good.  Took an Uber and was really suspect of the area, but when we arrived, we were pleasantly surprised.", "pics": null}}, {"review": {"des": "Interesting dishes. The focaccia was amazing and filling. I had the seared octopus and it was cooked perfectly. The lime cream sauce was a nice touch.", "pics": null}}, {"review": {"des": "I truly enjoyed this.  The service was attentive and food very good for italian (american) food.  I would return", "pics": null}}, {"review": {"des": "We came here as a group to celebrate a friend's birthday, blog launch, and her plain awesomeness. I love going to restaurants as a large group, because then we can order so many dishes and try different things! Here is what we ordered, in no particular order:<br><br>Truffle Egg Toast with fontina and asparagus: wow, this is toast on crack. I love truffle, I love eggs, and I love toast! This is definitely something you should try, if you haven't already!<br><br>Escarole salad served with gala apple, pecorino dolce, celery and hazelnuts. I can't say this is the best salad I've ever had, but it was a great way to complement the rest of the meal, which was all protein, sauce, and savory-ness.<br><br>Board: Mascarpone polenta plus the ragu of the day, which was a ragu sauce made with sausage. For those of you who may not know, traditional ragu is a tomato based sauce and is the definition of slow cooking. It's usually a thick, hearty pasta sauce, made with at least one kind of meat, that's simmered for hours until the meat is tender and the sauce is rich and savory. I liked the sausage, but I'm a total bolognese girl. I hope I can come again when they have a bolognese type of ragu that day.<br><br>Pappardelle e cinghiale is a pasta made from hand cut pappardelle with braised boar, pistachio, sage, and pecorino crotonese. This is one of my favorite pasta dishes, and I can eat it all day!!~ Loved the quality of the noodles, I kept going back in for seconds and thirds and fourths.<br><br>Cacio e pepe is a very simple but delicious dish of spaghetti noodles with pecorino and black pepper. Simplicity at its best.<br><br>Polpo con rafono is seared octopus with warm fingerling potato salad, marcona almonds, finocchiona, and horseradish aioli. I only had a bite of this, but that bite was amazing! It's actually quite easy to share as long as you make bite-sized cuts.<br><br>Ossobuco di maiale: braised pork shank, cannellini beans, roasted mushroom and roasted scallion oil. Wow this is a savory, hearty dish. You only need to order one for the table, it's big!<br><br>Pizza della terra: wild mushroom, braised leeks, taleggio and truffle oil. This was my favorite pizza, you can really taste the truffle oil and the mushrooms were so savory and umami.<br><br>Pizza con prosciutto e rucola: prosciutto di parma, fresh mozzarella, fontina and arugula. You can never go wrong with a classic prosciutto and arugula pizza, they pair well together.<br><br>And finally, we had an order of the Brussels sprouts with pancetta, calabrian and saba...I love brussels sprouts and they make this dish so well here! Pancetta is like bacon, so everything is good with bacon right?<br><br>Also, here are some specials that they have (by day):<br><br>Monday | 30% off for Industry Employees<br>Tuesday | Davanti burger + Peroni ... $14 5pm-9pm<br>Wednesday | 25% off wines by the bottle (excludes house pours) 5pm-9pm<br>Friday | Our Whim! (dinner only)<br>Thursday | $10 Pizze!!!<br>Sunday| bruschette ... $5<br>Saturday & Sunday Brunch| bloody mary bar...$8 & brunch bellinis... $5<br><br>Stay hungry my friends!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ijvn9cmK7NWoRo6nDsYFJQ/348s.jpg", "caption": "Brussels sprouts"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/deQAZCcpHmnXALhvkEgZwQ/168s.jpg", "caption": "Mushroom pizza"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6QI9eYLEkJ9-nWocCfXHGg/168s.jpg", "caption": "Truffle toast"}]}}, {"review": {"des": "Read reviews and it was exactly like the descriptions and pictures. You want go wrong. Glad we made the journey.", "pics": null}}, {"review": {"des": "Overall had a nice dinner with friends despite being 1 of 2 parties dining there. Two things were memorable: The ricotta w honeycomb was great- they brought us more toast to eat this up. And the Blondie Bar dessert - WOW! I could go back and just order this and be happy.", "pics": null}}, {"review": {"des": "Although the ambience of this little restaurant engulfs you in a lively and rustic manner, the food was quite mediocre. <br><br>We ordered the Focaccia di Recco to share as a table; the warm and soft cheese melted with the sweet honey, creating an incredible combination of flavors that mixed very well together. However, the Della terra truffle pizza was too strong in truffle oil and overwhelmed the other flavors, which threw off the balance. <br><br>Overall, this place is nice for loud conversation, and I highly recommend the Focaccia di Recco!", "pics": null}}, {"review": {"des": "Amazing place. Excellent food and service. We felt very welcome the moment we walked in. Our server was extremely helpful explaining their slightly different approach -- recommended sharing portions. We're really glad we took their advice. Beautiful meal of arugula salad and two different pastas; then espresso and the brown butter blondie desert. Wow. Just a wonderful meal, start to finish. Thanks, folks.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QfRMmqJFhQuUSHJ9cPBEMQ/168s.jpg", "caption": "amazing, rich brown butter blondie"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fhZgv4b9_zb9hg6pHsE_Mg/168s.jpg", "caption": "the asparagus pasta."}]}}, {"review": {"des": "This place is awesome. Amazing Italian food with tons of variety, great service, fun, and great for big parties. Highly recommend!", "pics": null}}, {"review": {"des": "I have been here twice. The first time with my boyfriends family and we ordered a bunch of things and shares tapas style. I cannot say enough great things about the food, service and wine!   my boyfriend is a vegetarian and there were plenty of options for him as well as everyone else! Everyone was raving about how delicious the food was!<br><br>My girlfriend and I went for happy hour on a Wednesday...  50%off bottles of wine Wednesdays!!  Everything was fabulous and I think we tried every app on the happy hour!  <br><br>Love love love love love this place.  Check it out!", "pics": null}}, {"review": {"des": "We came here for the burger because we saw it on the Eater 25 best list. Honestly I thought all the food was average. Couldn't taste the cheese curds on the burger. The brussels sprouts were deep fried but ended up soggy, spicy, and gooey (because of the fried egg) all at the same time. On the positive side, the burrata was probably the best dish we had, and the ambience of the restaurant is really rustic and cozy and relaxing. Half off wine on Wednesday nights and the pizza looked good, but I don't think will come back - too many other good Italian restaurants to try.", "pics": null}}, {"review": {"des": "Food is amazing, especially the meatballs and polenta. Great decor and perfect for a medium sized group. We ordered a bunch of different dishes and shared them all. Be sure to ask for Ron to be your server, you won't regret it!", "pics": null}}, {"review": {"des": "My boyfriend and I went here on a Friday night. We were really excited to try it out so we made a reservation to avoid any wait. Unfortunately the reservation did not do us any good. We were seated and then waited 30 minutes just to get water. We were told our waiter would come but we waited another 10 minutes and they never came. We asked people around us if they were getting service and they had all said it was really slow. We did not get to try the food and due to the inconvenience, I do not picture us going back.", "pics": null}}, {"review": {"des": "A charm of a restaurant in little Italy- lovely little place with great wine selection, open air, and friendly staff. Meals made to share and served that way, we had the burrata, polenta, and fettuccini and it was all fresh and delicious! Can't wait to go back for happy hour!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FTyVgC3TQeCUuXLh8VyQMw/348s.jpg", "caption": "Polenta (small!)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kgPONfGJC5l4YeITUNhoGw/168s.jpg", "caption": "Happy hour and daily specials!"}]}}, {"review": {"des": "The restaurant accommodated a large group on little notice due to a miscommunication. The food was excellent, service outstanding and everyone there was very helpful. I especially recommend the orchiette pasta, pizza, and a fish special that I can't name! The rooftop patio has amazing ambience.", "pics": null}}, {"review": {"des": "Went to this place based on yelp reviews only. Got there a little bit after lunchtime. The environment was quiet, maybe another two tables occupied. The hostess and the waiter were absolutely on point. Except for the appetizers, we ordered based on menu. Grilled octopus was the special of the day and the grilled cauliflower steak was off the menu... OMG these two were  absolutely delicious and a must try!!!! I am a  Cacio e Pepe lover so I order that and my husband ordered the salmon that was on special... without offending the cooks and the restaurant, these two items I can make better at my home.  I truly enjoy the fact that they had Buckle Down beer on tap...it is a local beer I enjoy supporting! If you're in the neighborhood and looking for a really good treat, this is a joint to consider!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LTNvn93ui8NJipDJCyabWg/348s.jpg", "caption": "You be the judge... (lunch tab)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-BL1GM9XzxQrWMWyZ3K7Mw/168s.jpg", "caption": "Special of the day grilled octopus. Absolutely delicious"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Itn3YGdbxXOUz2aSzi0JDA/168s.jpg", "caption": "Grilled cauliflower steak... (on menu look at the ingredients... a must try)"}]}}, {"review": {"des": "Last weekend was my first trip to Chicago. I didn't have deep-dish, didn't pay $20 to experience vertigo, and didn't touch a hot dog. And I'm okay with all of that- I'm already dying to go back, but mostly because of Davanti. <br>We came for brunch at the recommendation of a local. I loved the Bloody Mary bar. The homemade ricotta came highly recommended and was fantastic. <br>For entrees, we ordered 5 items for 3 people and polished them all off!<br>The one item I keep drooling over is the Fontina Truffle Egg Toast!  I can't wait to return and eat that truffle egg toast for every meal!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XKwC7bEOszzDUptdPKNGGw/168s.jpg", "caption": "Homemade Ricotta Vasi did not disappoint! Served with honeycomb.  Also pictured: Bloody Mary from the Bloody Mary bar!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/41NYhK5OYqXa6NVp-lOxXw/168s.jpg", "caption": "Truffle Egg Toast with delicious fontina cheese, the perfect infusion of truffle oil, and a perfectly runny egg!"}]}}, {"review": {"des": "Lovely, rustic atmosphere. Friendly service.  Fantastic food and amazing wine list.  Honestly, you CAN NOT go wrong.", "pics": null}}, {"review": {"des": "Rude hostess. Sat the first three parties of the day right next to each other in a 20 table room?? If you're going to do brunch, keep the coffee coming. It's fine if apps come out one at a time, but main dishes need to come out together. Food was real good though. Service", "pics": null}}, {"review": {"des": "I so badly wanted to like this place but the service ruined it for me. We waited almost 1 hr for a pizza and burger and the food was not worth the wait- its subpar at best. Francescas across the street is much better, and they serve delicious free bread!", "pics": null}}, {"review": {"des": "This is my second time coming here and my experience was the same both times in terms of poor service. Each time the waitress (different waitstaff) was not attentive and messed up the order . The servers do not check back after the food is served to see if anything is lacking and each time I've had to hunt my server down to ask for missing items. <br><br>I will say after complaining about the service they comped us for the pancakes that came at the end of our meal which was appreciated. Even though the food and capwas great the poor service makes me think twice about going back.<br><br>So this is an update as we went here again for third time today and had a better service experience. As usual the food is great and it is what keeps us coming back. Although I had to flag down the waiter after 10 min of being first seated I would say everything from that point was great. The waiter told us to expect food to come out one at a time and not all at once as they have a small kitchen. I did appreciate the FYI. All in all my family and I left feeling happy with this dining experience! Hope it continues.", "pics": null}}, {"review": {"des": "I chose this highly reviewed restaurant for my twin's and my 40th birthday dinner and was quite disappointed.  The whole meal was very underwhelming.  All the portions were overpriced and undersized.    The portions were about half the size of what you get in a NORMAL restaurant. There was no complimentary bread served.  I ordered cacio e pepe.  It was so plain and uninteresting I felt like I should have stayed home where I could have made it much better.  I was expecting it to taste like the cacio e pepe at Animale restaurant, which is 10 times better.  I was so glad my 7 year old didn't finish his kid's spaghetti and meatball, which I hungrily finished!  Dessert was pretty good but again small.  (torta bacio, which is chocolate mousse with hazelnut crunch). Letdown.", "pics": null}}, {"review": {"des": "Love the Cacio e Pepe.. in fact so much so that I went back there to buy a full portion just for myself and finished it in one sitting. The Pizza Bianca was good.. loved the panna cotta with berry juice, and also the chocolate dessert.. can see how this place is a regular for some people..", "pics": null}}, {"review": {"des": "The food was VERY overpriced for being so mediocre. The steak ordered was extremely fatty and the burger, that they are allegedly KNOWN for, wasn't cooked as requested and served on a ballpark quality bun. I requested a bottle of Malbec ($42) and was told they only sold it by the glass (although I'm staring right at the bottle price) and received a VERY poor attempt to upsell a $75 bottle of Malbec along with the statement \"I'm not trying to price gouge you, but this is really good\". I then proceeded to indicate we were not looking to purchase a $75 bottle of wine and inquired on the other bottle originally ordered, that apparently was only sold by the glass and asked if it was out of stock. I was then told \"oh no, I mean we have it I just wanted to show you the other one.\" Really? It was unfortunately a pretty poor experience and we won't be back.", "pics": null}}, {"review": {"des": "They recommend that the table shares the dishes bc they are small... for 2 people, about 2 to 4 dishes. The recommendation was right on point. We got the bruschetta, polpo, linguini with crab and sea urchin, and polenta with ragu. Highly recommend the polenta with Ragu and the sea urchin and crab linguini. The polpo was unique as it had all types of ingredients on it but it was just a little salty for me.<br><br>This place would be great for date nights and birthdays!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NCFIJ_Bu-EU2UDvRkFJCzQ/348s.jpg", "caption": "Bruschetta"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Uq2zzVlivURqbKrW5e1hcQ/168s.jpg", "caption": "Polenta with Ragu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/S64eCiRk5lyJgRKTw2Ysgw/168s.jpg", "caption": "Polpo"}]}}, {"review": {"des": "Great food and service! Our server Dane was tentative and personable. The brunch menu is unique and everyone at the table loved their food- not to mention the delicious Bloody Mary Bar. Will definitely be back!", "pics": null}}, {"review": {"des": "Came here for brunch last Sunday for the first time. My friend and I shared the burrata, French toast, pork belly hash, & did the bottomless mimosas deal. Everything was amazing and our server Dane was great and very knowledgeable about the menu! This place is one of my new favorite spots in little Italy. I will definitely be back!", "pics": null}}]}