{"name": "dawali-mediterranean-kitchen-chicago-2", "reviews": [{"review": {"des": "Dawali is our regular stop when we want to eat something healthy and extremely tasty.<br><br>The hummus special which comes with homemade hummus and a grilled protein is a can't miss.  Get the garlic sauce with it.<br><br>Its also great for delivery and somehow, its better the next day.", "pics": null}}, {"review": {"des": "Simply some of the best Mediterranean food I have had. We had a group of 12 and ordered food family style.  It was pure bliss and a great way to handle a large group.  Let me say, read my reviews.  I am not easily impressed, but the babaganoush and meat platter is some of the best I have had.  The chicken skewers were seasoned well and were not dry.  The atmosphere is what you make. A simple place but great for a gathering.  Drinks are BYOB, which I think makes it even better.  The service was phenomenal.  Twelve tipsy patrons and a large group?  They were great.  I would definitely recommend it.<br><br>Oh!  Allergies?  You have them, they can accommodate them.  Plenty of GF options too!", "pics": null}}, {"review": {"des": "I had a spell-binding experience at Dawali the first time I went. M was entranced. I guess that's to be expected anytime we go to a BYOB with our wine guy, but Dawali seemed exceptional.<br><br>We got several dishes while we were there and then a few more to-go. M LOVED the Qudsiya which is a bed of hummus with beans in the middle. The beans are very similar to Mexican refried beans but Mediterranean. I was in love with the Chicken Shawerma Wrap. The pickles surprised and delighted me and the creamy garlic sauce took it to a whole new level.<br><br>The server was very friendly and had no end of patience with bringing us fresh glasses for our many bottles of wine and beer. We loved her. She felt like a chill cousin who was hosting us at her apartment. Cheers!<br><br>We ordered delivery from Dawali last night and it just wasn't as good as before. For one thing, it took an insanely long time for it to come - over an hour. Heck - I could walk there and back in that amount of time. For another thing, it just wasn't as delicious as when we were there in person with our wine guy.<br><br>We are going to absolutely keep Dawali in our rotation of easy and yummy food. We'll probably get take-out and go to the Mouse Trap (Off Color Brewery on Kingsbury). I recommend Dawali for sure.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/A7VBjtmJZnq6QDweuBztmg/348s.jpg", "caption": "Delivery all of the pita that arrived with our order"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ToK3g1b_jjQUhnsblZTvoQ/168s.jpg", "caption": "Delivery small Zesty Hummus"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zkomE9taa2enq1wNP27dyg/168s.jpg", "caption": "Delivery large Baba Ghanouj"}]}}, {"review": {"des": "Oh Dawali what the hell happened to you. This used to be our go to Mediterranean restaurant , but I can say I'm not sure I'll ever be back. We walked into the restaurant on a Thursday afternoon no one was in there , just one other person , the entire restaurant was empty.  Our server came to our table saw we had a bottle of wine I asked for a wine opener , uhm that never happened, after 15 min we finally got the dam bottle open. He took our food order and left , here's the best part , our orders where screwed up , nothing was right on the dish , mind you again There was only 1 other person in the restaurant, then he brought that persons drink to our table. The food used to be way better , prices up, quality down what's new?  Sad sad sad sad , this was one of the better byob's  in the city.", "pics": null}}, {"review": {"des": "Disclaimer: this is for delivery. I've eaten at the restaurant and it's good. The delivery was a let down. <br><br>We just placed an order for delivery and I have to say, I would not recommend it. We ordered two soups, a salad and an appetizer sampler to share for 2 people. The sampler said it feeds 2-4, and I've had it dining it before, it was huge. This one was so small. It was served in a small take out container with barely enough food for one person. <br><br>We spent close to $40 on delivery and I'm still hungry wanting more food, except I just spent $40 and that seems impractical to order a second dinner. Don't order delivery from here. Dine in or order elsewhere.", "pics": null}}, {"review": {"des": "For what it is, a casual sit down restaurant, I have to give this place a 5 star rating. The food was really off the charts, good portions, lots of options, and service with a smile.<br><br>We started with appetizers of hummus and a large plate of falafels. Both of these were really good, a nice olive oil on the hummus, and great texture with the falafels.<br><br>For entree, I got the Spicy Chicken Kebab plate, and I would highly recommend. I am usually a schwarma guy, but  but he waitress convinced me otherwise, and rightfully so. Super tender, great flavor, not overwhelmingly spicy, but a good kick. Comes with rice, salad, and pita.<br><br>We also got fries for the table, and these came with a great curry mayo sauce.<br><br>Will definitely be back", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dehBg5gQAQwDK67VnDlSpg/348s.jpg", "caption": "Fattoush Salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eIT8YcGdef7LfSUa2UwC0Q/168s.jpg", "caption": "Hummus"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IztQwBcc93qcilC5NLv0Bg/168s.jpg", "caption": "Spicy Chicken Kebab plate"}]}}, {"review": {"des": "This place is extremely stingy with portions. Food quality is average at best but does not warrant the price of which it is sold at", "pics": null}}, {"review": {"des": "Byob!<br>I really like this place. The food is good and reasonably priced.our server was friendly <br><br>The hummus with the chicken shwarma is delicious . Falafel is good as well . The stuffed grape leaves were just ok , not bad just not awesome . Ive also tried their salads which are good as well <br><br>This place is great to share stuff with others so you can try alot <br>I recommend!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nAa79gvsenrW62uHbcy55A/168s.jpg", "caption": "Grape leaves, jerusalem salad, pickled turnips and fattoush salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/itEa3kEgyFiyA0eFVQRcvg/168s.jpg", "caption": "Hummus with chicken shwarma - its a large dinner plate . Chicken was great"}]}}, {"review": {"des": "Dawali...every time I walk past this fine Mediterranean restaurant en route to my apartment I can only think of one thing.....Michael Scott singing to Kelly about the Indian holiday of Diwali. Though the two aren't related, I can't help but have that sing play through my head. <br><br>Michael Scott aside, Dawali serves up some pretty bomb Mediterranean food. Ever since my trip to Israel, I've always craved some good shawarma and baba ganoush. Dawali hits the spot every time - I typically order the chicken shawarma plate or wrap with an appetizer sampler. I really think the appetizer sampler is the way to go, you'll get a total Mediterranean tour. <br><br>This is a great place for those nights when you're trying to do whatever you can to justify why you shouldn't cook. Boom, I'll order Dawali. <br><br>Pro tip - the dining area isn't too crazy, I'd recommend pick up.", "pics": null}}, {"review": {"des": "It's a good Mediterranean restaurant which offers decent portions for a good price. We ordered Qudsiya- a appetizer with hummus and mix of some beans with pita bread, combination entree of chicken and lamb kebabs which comes with side salad, rice and tahini sauce and a baklava. <br>The lamb was little tough and dry, hummus was very smooth and light and baklava was crisp and sweet pastry, one of the best I have had!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SKufTOx8t6PKvcJXV2fUnw/168s.jpg", "caption": "Qudsiya"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/M1PECBFhgPyoqcKr1Ra1gQ/168s.jpg", "caption": "Lamb and chicken kebabs"}]}}, {"review": {"des": "Relative to Michigan, where I travel a lot for work, Chicago doesn't have too many Middle Eastern restaurants that are consistently good and serve close to authentic food.Of course I don't consider Roti, Naf Naf Grill, and I dream of Falafel as sit down restaurants. In addition, Pita Inn and Pita House in the burbs are certainly good but over the years, I personally have gotten bored with the same limited menu items and they feel very 'production line' like. Dawali is a pleasant change from all of the above and had a very broad menu, BYO, solid food, excellent service and located in convenient location in the city. <br><br>I have had their Fattoush salad, Chicken Shawarma and Kefta kebabs and enjoyed everything. Finally, Dawali offers great value for money.", "pics": null}}, {"review": {"des": "I miss the days I lived on the other side of the block from this place. Excellent Mediterranean food. The chicken shawarma here is among the best in the city- I usually get a wrap with red pepper sauce and it routinely blows my mind how good it is. Pair that with some hummus and some properly baked pitas and you got yourself a real winner. Have always loved the kebabs as well.", "pics": null}}, {"review": {"des": "Dawali has the most delicious Mediterranean food! The chicken shawarma was my favorite! You can tell all the food is homemade and quality! The decor is great and the wait staff is overly accommodating! We also liked the option of getting their catering when in town for meetings! Check this place out!", "pics": null}}, {"review": {"des": "Just walked in during the dinner rush on a friday night by accident and wow! Staff was very accomodating and helpful. The food was outstanding, considerably the best middle eastern food I've had in Chicago. Will be back very soon, cant wait to share with my friends!", "pics": null}}, {"review": {"des": "Stopped into to Dawali prior to a matinee show at the Royal George Theatre.  I'd like to remind you that a 3 star review means it was A-Ok. That is exactly how I will remember this meal. <br><br>Breakdown below: <br><br>Halloumi cheese pie: 4 stars - Nicely spiced and freshly cooked. <br>Pita Bread: 4.5 stars- Yes please! <br>Couscous Salad: 2.5 stars- hello lime!! A little limey overkill <br>Veggie Galaya: 3 stars - Reminded me of a spicy ratatouille - A-Ok<br>Ambiance: 3 stars - Probably better as a take out spot or for a quick lunch.  <br>Service: 3 stars- Again A-Ok but nothing bad, nothing out of the ordinary.", "pics": null}}, {"review": {"des": "Good food fresh made literally well cooked and fast  served. Friendly good wine try it with the food you won't regret it and I'm speaking of true event. But after all their  prices that always take me back.", "pics": null}}, {"review": {"des": "Not sure if this is an honest review based on the circumstances.  Just arrived after a long plane ride and we were pretty hungry.  At the time the food seemed good and nourishing.  On second thought, I've had much better at a better price point. <br><br>The restaurant is set up like a bistro or cafe so it's cramped.  The acoustics don't lend themselves to carrying a conversation.  The place got crowded and the noise level made it unenjoyable.", "pics": null}}, {"review": {"des": "Honestly the one star is for the service. I just took the time out of my life to make a yelp account to review Regis place man. I feel bad leaving a crappy review but Like WTF happened to this place? One of my friends recommended this place to me, I stopped in with my brother and mom in like mid or early June. Food was great, the waitress was awesome (blonde chick super cool and attentive). Dude this time i  came back two days ago with my gf and the waitress lady with the black hair literally went off on us for I do not know why. Not nice, very rude and mouthy. There was a woman sitting in the far back with a bald guy and I KNOW they heard her raise the voice at us yet did nothing. Terrible and a bit freaky man.  They looked like the managers or maybe owners I don't know but that's not acceptable. Sorry Dawali you guys really lowered your standards.", "pics": null}}, {"review": {"des": "Okay place. Stopped by to pick up dinner late before heading home. Got the combination platter with chicken kebab and shawarma. Subbed in \"grilled veggies\" instead of rice.<br><br>The positive bit was that their garlic sauce and pita bread are very good. Super garlicky yummy sauce and fluffy pita as it should be. The chicken shawarma was solid too<br><br>The bad: dry chicken kebabs, like pretty tough to eat. Also, if you see the picture below, I opened the container expecting to have a good amount of grilled veggies in one of the side sections. But where is it?!?? I nearly called the restaurant to complain when I dug under the chicken and saw that it was just a measly few pieces of soggy grilled veggies at the very bottom. <br><br>Was so disappointed in what I was hoping to be a filling and well balanced healthy dinner. I ate the shawarma with the veggies and ate something else at home. <br><br>Maybe the dine- in experience is better? Oh well...onto the next one...", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QSWE2TdGjdAmWYVSztw5sQ/348s.jpg", "caption": "Combo plate with shawarma, kebabs and... where's the grilled veggies??"}]}}, {"review": {"des": "Reasonably priced with quick friendly service. Love their falafel so perfectly crispy. Hummus is well flavored and perfectly smooth. Veggies so well seasoned. The white bean dish was the only fail. Wish we had known it was byob.  We'll definitely be back with wine in hand.", "pics": null}}, {"review": {"des": "Not sure why it took me so long to come here, but I finally did recently on a Friday evening. Boo and I were seated right away and the place was moderately busy. It seemed to be a nice casual atmosphere.<br><br>We ended up with chicken shawarma entree, half dozen falafel, grape leaves (5), baked spinach pie (2), and a small baba ghannouj. The grape leaves and baba were decent, as was the accompanied pita. The spinach pie had a nice spice to it but did not quite enjoy the texture. The chicken shawarma was fine, but not quite how I'm used to. The falafel was especially disappointing, as it was mealy and on the bland side. Overall, while the food wasn't bad, it wasn't great, as I've had much better elsewhere. Prices and portions were good, especially for the area.<br><br>Service was fine. We were serviced promptly and requests were taken care of when asked, but we certainly weren't ever asked first of how we were doing throughout the course of our meal.<br><br>Overall, very average all around.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3pOFwjvkmwskYA3juh2U3Q/348s.jpg", "caption": "Grape leaves, baba"}]}}, {"review": {"des": "So delicious!!! The chicken shawarma wrap is amazing and the dipping sauce is out of this world. The hummus is probably the best I have had. Great service, we can always get a table, and it's BYOB which is awesome. Highly recommended!", "pics": null}}, {"review": {"des": "By far the best shawarma wraps in the city and I've tried out a lot of places. Made a reservation last night just to be sure, got seated no problem. They're casual but intimate so it's perfect for shared plates and wine with a date or a quick bite with friends/family. Anyone who enjoys quick, friendly service, delicious food, and cozy byob spots that are somewhat hidden from the busy nightlife areas, Dawali is for you! Tons of vegan / vegetarian options too which made my sister, who hadn't tried the cuisine before, very happy!!", "pics": null}}, {"review": {"des": "Stopped by after seeing a play at the Steppenwolf theatre.  Had warm pita (doubt if it was home-made) and Hummus (small size).  Very good.  For meal I had the falafel sandwich with the fried eggplant and cauliflower.  Was so-so.  Didn't taste any garlic (which I use when I make it). Mostly smelled and tasted like the cauliflower.  Had a can of coke for $1.50.<br><br>Food was inexpensive and location was perfect for after theater diner.<br><br>I liked Dawali, and would go there again, but if you want REAL falafel head out to Bridgeview, IL and the \"little Palestine\" area around 79th-95th and Harlem. Try these guys:<br><br>The Best Shawerma Resturant<br>6934 W 79th St<br>Burbank, IL 60459 <br>b/t Newland Ave & New England Ave", "pics": null}}, {"review": {"des": "I came here on a shivering winter day, thanks to Spring Rewards' suggestion. Seriously - thank you Spring Rewards.<br><br>First off, BYOB, casual restaurant with amazing food!!!<br><br>The prices are around if not under $10, and up to this point, Old Jerusalem was my favorite middle eastern restaurant..but Dawali has since taken its place!<br><br>The food well-portioned and well spiced. My only complaint was that this place is a little heavy handed on the olive oil, but other than that...mm mmm DELICIOUS", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/f3Ht-DiLqA2LbA_MkMSbbw/348s.jpg", "caption": "Small babaganoush and lentil soup with lamb"}]}}, {"review": {"des": "A friend and I were going to see a show at The Royal George Theater and she had suggested this restaurant.  The restaurant is very easy to locate since it is so close the the theater, public transportation and to North Avenue.<br><br>I did not have a reservation, however, I was able to be be seated right away.  Within few minutes, my friend had arrived with a bottle of wine.  I was not aware this is a BYOB restaurant.     Without a beat, the server had brought couple of wine glasses then went over the menu.  We had opted to have the Appetizer Sampler.  Since I'm not very familiar with Middle Eastern spreads, this was a great way to begin me dinner.    I certainly enjoyed the two white spreads.  <br><br>I had opted to try the Chicken Shawerma and my friend had ordered the Check Kabob.  We were still enjoying the appetizer sampler.  The server would continue to check in with us.  About 10 minutes later, our meals were delivered to us.  Both meals were good size and very good.  Neither one of us had nothing to complain about.  So much food, we had to skip desserts.<br><br>If you are in the area, I would recommend this restaurant.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GLxL3CFQob9NF6ScGAJB2w/348s.jpg", "caption": "Dining area before the rush"}]}}, {"review": {"des": "Great, casual spot for a dinner. The menu is vast and very affordable. I went last night before a show and had the spicy hummus (get it!), falafel, tabouli salad, and lamb kabab sandwich. BYOB with no corkage fee, our bill was $26 for two people pre-tip. Not bad at all for a feast of delicious Med. food!<br><br>Tip: Ask for cut veggies to accompany the hummus!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QWZRVm743RjoKVq4wKH1Zw/168s.jpg", "caption": "Lamb kebab sandwich"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kP4aECppk2NTR-WlML2XHw/168s.jpg", "caption": "Spicy hummus (so good!)"}]}}, {"review": {"des": "Wow! The best Mediterranean food in Chicago, hands down. Amazing humus, perfect fresh falafel, everything on the menu is delicious!", "pics": null}}, {"review": {"des": "Chicken shwarma and kebab were mad delicious and perfectly cooked. Were moist and well seasoned. Portion size for combination entree is also solid. Rice was great. Falafel was decent but I'll be honest that I don't really know falafel that well.", "pics": null}}, {"review": {"des": "YUMMMM I loved it!! The place is BYOB which is kinda fun and economical. Had the falafel and zesty hummus for an appetizer. They were both so delicious. The sauce to dip the falafel in was light and had a great flavor. The hummus came with soft warm pita and was amazing and I had the chicken kabobs for my main course, and they were some of the best I have ever had, seasoned perfectly and really tender. My friend had the chicken schwarma which was a little dry, and the only small complaint about the meal. <br><br>Overall love this place and can't wait to return!", "pics": null}}, {"review": {"des": "Delicious appetizer, but our entry never came. They must've lost our order, never checked, so we waited for 40+ minutes and got nothing. Very disappointing.", "pics": null}}, {"review": {"des": "MEH. meh. meh.<br><br>This was a downer on virtually every level.<br><br>Let me start with a few positives:<br>Pita - very fresh, very good.<br>Tahini - good.<br>BYOB - although we didn't take advantage of this visit.<br><br>Now the downers..<br>Around 4pm on a weekday we walked into a nearly empty and cozy middle eastern inspired dining room playing middle eastern holiday music..(in the Spring, huh?).  Only a few diners inside. Hostess greets us, now seated we browse the menu..<br><br>Ask hostess (who also serves us) a few questions regarding menu.  She gives us mainly two word answers.  Seems sort of rushed and overall demeanor is impersonal, uninterested, unenthused.  The smile on her face was all we got.<br>I asked how long the kebabs take to cook and my answer was \"as soon as you place your order\".  Alrighty then.. Onto the food...<br><br>We ordered the baba ghannouj and small order of falafel to start.<br>Baba ghannouj is stated on menu to be a chunky and tangy puree of roasted eggplant.  Falafel is described as a chickpea fritter.  Description of falafel was spot on as this was definitely more of a fritter than a falafel.  Served piping hot. Very crisp shell, very soft bite.  Not at all dense.  No parsley. No flavor. Tasted like chickpea and only chickpea. I happen to like fritters, but with flavor..<br><br>Upon tasting the baba ghannouj we were confused and thought maybe she brought us something else.  We couldn't detect ANY eggplant.  There were no visible \"chunks\" as described.  Still perplexed, we asked our Server if in fact we did receive what we ordered, and she confirmed we did.  I'm not sure what this was, but it tasted nothing like baba ghannouj.<br>It was tangy, I'll give them that and that's all it was.  I eat this all the time and it was a poor excuse for baba.<br><br>We waited a good 25 min for our entrees to arrive.<br>I thought maybe the meat takes awhile to cook.<br>I envisioned big juicy pieces being that it took so long.<br>My Kebab combo plate of Spicy chicken and beef kefta arrives, along with friend's Classic Shawarma sandwich.  My hypothesis was wrong.  No big pieces here. This would have reasonably taken about 10 min. tops to cook.<br><br>While my plate was hot, my friend's Shawarma pita sandwich was not.  Logic tells me it was sitting while my plate was being prepared. Friend said shawarma was ok but dry. My Kefta was dry and scrawny.  Spicy chicken was tender chicken breast pieces, they give you three.<br>Nicely charred and cooked well, but had a forward spicy hot kick that lingered. It was all I tasted.  Wouldn't be surprised if they doused the chicken in bottled hot sauce and threw it on the grill.<br><br>My combo comes with rice, small salad and two sauces.  Tahini & a yogurt sauce? I couldn't tell.  Rice was really bland, dry and tasted as if it had been sitting for hours, no way was this fresh.  Salad portion was ridiculously tiny.  Could it be the small plates they use to cram everything on it just doesn't work here?  Yep.<br>Could it be that $15 for a combo sounds like a good deal only because your really getting half the amount you'd likely receive at other middle eastern joints? Yep.<br><br>Would I come back?  Nope.<br>What we did have did not taste authentic middle eastern, and if they claim it is, that's ok too - but I like flavor with my food.  Not only was it overpriced for the absence of taste & portion size, and the wait unjustified, but the dining experience itself was just unwelcoming...We couldn't wait to get our check and leave..<br><br>I'm surprised by all the high star reviews (reason we came here).  I can see Dawali's being a convenient choice as its across the street from the theatre and byob makes it all the more alluring.  But as convenient as it might be, I'd go to Reza's before I'd come here or Kebab House in the burbs and skip this place..", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nQAryP3SMaccYGOC1QL9pg/348s.jpg", "caption": "Spicy chicken & Kefta combo"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3FBz7Bh2AC9l4smhuRoOPA/168s.jpg", "caption": "Falafel..not."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HgxCaQ8l3DSbgLK1E2yOoQ/168s.jpg", "caption": "Great pita"}]}}, {"review": {"des": "the portions are just right and the food is not overly greasy with a good amount of veggies and tasty at the same time. the wraps are really good, loved the hummus they have in it! the grape leaves are great too, very refreshing. we also tried the lamb bread pie, they are just like empanadas but with amazing taste<br><br>we had baklava for dessert, it is very well made<br><br>the price is very decent too given its location", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wtxfDZ9v7qWeMHEL8Pi6dA/168s.jpg", "caption": "Baklava"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zFIhcGCR14z3g4e1RB8qpg/168s.jpg", "caption": "Grape leaves and lamb bread pie"}]}}, {"review": {"des": "Amazing food ! I got the chicken kabobs and rice and it was fabulous . Large portion of meat , amazing taste and the garlic sauce was delicious as well .", "pics": null}}, {"review": {"des": "My son is a big fan of steak kabobs. We thought we'd give this place a shot be because of the easy delivery option through yelp. After ordering it, it said it would 45-60 minutes for delivery. To our surprise our food was at the door in 25 minutes. <br><br>The food was hot and tasty and was a good portion size. We'll be keeping this place on our go-to delivery list!", "pics": null}}, {"review": {"des": "I eat Mediterranean a lot and I love this place. Chicken plate was awesome and their hummus is amazing. Something about it tastes better than regular hummus. Good price but I've never sat inside - mostly get it to go so can't comment on the ambience. Would highly recommend !", "pics": null}}, {"review": {"des": "Decent prices, but flavors match the low prices.  Wait staff was short, and charged us for not one but the \"additional\" items without letting us know it would add up to several dollars more than expected on the tab.  Seriously, charging for hot sauce?  I cannot remember the last restaurant that charges for hot sauce, when the food was bland without it.  The fries were good, but everything else was mediocre: lentil soup, shawarma, falafel and tahina.  Most Mediterranean is better than this.  But again, it's cheap, if they don't hassel you about getting the lunch special.", "pics": null}}, {"review": {"des": "Just stopped by for a quick lunch and frankly, went in because the place was conveniently located where we were and it was raining out. Went in without any expectations on the food. And came back AMAZED! Yummy yummy food ! Relatively cheap. Not pretentious and certainly not a hole on the wall. Will I come back? Yes! Am I excited about the leftovers I bagged? YES!<br><br>Pros:<br>- lots of vegetarian options<br>- helpful staff. They helped us choose dishes to order and stayed out of our way when we didn't need them<br>- great food. See below for details<br>- Qudsiya: 5 stars - get it! It's vegetarian, and its yummy<br>- chicken shawerma and chicken kabab combination: 5 stars - get it! You can order either of the two without the combination and save $1.05-$1.25, but I think the extra buck and change was worth it! If you really want to order just one, then I propose you go with the kabab. It was more succulent and marginally tastier to my non-sophisticated taste buds<br>- Arabic coffee: 3 stars. It was... Coffee... Get it if you want coffee.<br>- great prices!<br><br>Cons:<br>- probably isn't the fanciest of places, but for these prices, they are great. But just letting you know in case you want to bring a fancy first date here... Don't...<br>- parking is probably tough to find given the location. But it's only a marginal con, because in our sample size of one, we found parking just a block away<br>- The door to the restaurant was hard to open. What a strange thing to write in the review? Well, I am looking hard for cons for this place :)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/F4f4LEeBnTPKu0tO7MS2-g/348s.jpg", "caption": "Arabic coffee"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/N0J1yPpB4_PBos6J8u0OeA/168s.jpg", "caption": "Bread that came with the qydsia"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UG8YNX2EuwEIf6_EYG9EbQ/168s.jpg", "caption": "Qudsiya"}]}}, {"review": {"des": "Mmmmm. Yes.<br><br>Black Friday shopping had me all hangry and such. A quick Yelp & SpringRewards search later, and boom Dawali Mediterranean Kitchen it is! First thing is first... BYOB. No corkage fees or any of that business. A true BYOB joint. Secondly, food was surprisingly awesome! Not sure how traditional I would consider it, but if it tastes good and you end up eating it all, it had to be a pretty good meal overall. Am I right?<br><br>Started with a small order of baba ganoush and a bowl of their soup of the day, which was a vegetable soup of some sort with bits of braised lamb (sorry I don't recall the name). Both dishes were fresh and excellent, and only $4 a pop. Not bad! For main entrees, the falafel sandwich & shawarma wrap were our final choices after minutes of debate. The Classic Falafel Sandwich ~ essentially a unique Falafel Sandwich with the addition of fried eggplant, cauliflower, and potatoes served with tahini sauce. By potatoes, they mean french fries! Say wuuut. That was a nice surprise! The Shawerma Wrap ~ features choice of chicken or beef/lamb shawarma with pickles and tahini [beef] or garlic sauce [chicken] wrapped in a flat bread and toasted on the griddle. For this, we decided on beef/lamb with the garlic sauce, let just say \"Oooo wee\". That garlic sauce is a punch in the mouth and delicious at the same time. To be honest, it tasted more like a burrito with gyro fillings and a nice garlic sauce. Not complaining, but the flavors can be a bit rich once you get closer to finishing it off. Anyways, sandwiches were only $6-ish a pop. <br><br>In short, BYOB, delicious food, and affordable. Definitely will be back!<br><br>'Til next time, cheers!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/55qqQ-6_jr-bgFSSuc4mIQ/348s.jpg", "caption": "Soup of the Day & Baba Ganoush"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/i8TdOCEURGj4cPjhx9nXIA/168s.jpg", "caption": "Shawerma Wrap"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LCMl78h8mYN83EQy8f4-Wg/168s.jpg", "caption": "Classic Shawerma Sandwich"}]}}, {"review": {"des": "Why wouldn't you start and end dinner with candy-coated fennel seeds?  There's a small dish at the host stand filled with these, which look like sprinkles.  They actually have an anise flavor so if you like black licorice, try these crunchy candy coated seeds for yourself.<br><br>Our dinner group came here on a Friday evening, and the restaurant was about half full, but this was the night of a Cubs game.  I love that it is BYOB (no corkage fee), and a bottle of wine goes perfectly with Mediterranean fare.<br><br>We shared hummus and falafel as appetizers and, as expected, both brought store-bought versions to shame.  The pita was soft and pillowy, and the hummus was creamy and fresh.  The falafel were piping hot and nice and crunchy on the outside.<br><br>The biggest decision I had to make was what entree I wanted to order.  From wraps, pitas, kebabs, it all looked so good.  I had the lamb and beef shawarma on a pita with a side of feta.  First, the feta was served in giant cubes and it was the freshest, most tangy feta I've ever tasted.  The lamb and beef combo was good, but my friend's chicken was SO much better.  The lamb and beef were much more dry and had less seasoning.  Get the chicken!  I had entree envy for at least 24 hours after this dinner.<br><br>Dinner here was very affordable.  Our group of 6 split two appetizers (I think someone may have even ordered a third, but I don't remember), each had an entree, and spent around $17 which included tax and tip.", "pics": null}}, {"review": {"des": "Solid dinner choice from my GNO group. <br><br>Get the falafel. Even if it's not your favorite, you must try them here.  Nice crunchy exterior and then soft and puffy interior.  Flavorful.  Enjoyed it so much I ordered a small appetizer of falafel for my work snack that night. <br><br>Hummus was delicious, smooth and creamy. Everyone at the table enjoyed it, the plate was scraped clean with pita.  The pita was OK--I've had better at the place that shall not be named, because I'm courteous to my review like that. <br><br>My lamb and beef shawarma pita was good too.  Not as flavorful as I had hoped, but it was fresh and the veggies salad was a nice accompaniment. <br><br>BYOB with no corkage fee! Helps make the night more affordable and encourages folks to bring their favorites. <br><br>Our group can also agree that those candy coated fennel seeds were pretty refreshing too. Nice little tasty touch", "pics": null}}, {"review": {"des": "Big fan of dawali! I can see the hype as 4.5 star restaurants are a rarity on yelp. My gf and i were craving fresh and a kind of cuisine that wasn't short on vegetables so we decided to hit up Dawali before a show at IO theater. <br><br>There's a solid selection of food here and it's gooood given how packed it was on a Thursday night (though there was no wait). We ordered a cucumber salad, falafel, shwarma sandwich, and the veggie saniya. The cucumber salad is composed strictly of cubed cucumber slathered in yogurt and olive oil. It's a simple and refreshing dish. The falafel here is good, but nothing to write home about (sultan's market in wicker has some of the best). I would suggest skipping out on it favor of some other stuff like the shwarma. And damn good shwarma it is. Each piece of meat has a beautiful char on it and is spiced wonderfully/has some great acidity. Huge fan. <br><br>I'm not the biggest fan of vegetarian dishes in general --MEAT is king-- but the veggie saniya was excellent. It was an entree sized portion of medium spice tomato base with mainly eggplant and zuchini. It was light but super flavorful and the heat they added was a great touch. <br><br>Our server was great and patient with taking our orders. The design of the restaurant lends itself to easily coming in, grabbing a bite, and leaving. It's perfect for a night out in the area!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ayiXURNiSOAdAyUDe1KYkw/348s.jpg", "caption": "Veggie Saniya (eggplant and zuchini mix in a spicy tomato sauce)"}]}}, {"review": {"des": "Good local spot. Good food. But didn't realize it was a BYOB spot. Went with some friends after work. The only reason I didn't give it 4 stars was because parking was a nightmare and I had to settle for paying $12 to park in the garage across the street. So pricing at the restaurant is decent but then tack on the parking fee and it's not worth it. Maybe if i lived in the neighborhood and was walking to restaurant it may be more reasonable.", "pics": null}}, {"review": {"des": "Dawali Mediterranean Kitchen is a convenient and delicious restaurant with great prices near North/Clyborn.  We visited on a Friday night before a Steppenwolf Theatre Show and were happy with the selection and tastes.<br><br>Definitely start with appetizer sampler ($13.50, the priciest item of our meal) which includes hummus, baba ghannouj, masaka, ful mudammas and 3 falafel, artfully presented.  The hummus and baba ghannouji were perfect and the ful mudammas was so tasty.  Falafel were nicely portioned with a fantastic crisp and taste.  I ordered a falafel sandwich ($5.75!) which included all the standards (plus fried eggplant and fries) and was filling.  We also ordered the chicken shishkabab plate ($13.45) and were rewarded with a large plate with generous portions of juicy, grilled chicken breast, rice and salad.  Chicken was well cooked and charred, rice well seasoned and salad a good compliment.  Every aspect of the meal was delicious and definitely choose the garlic sauce over tahini if you like a bold, creamy dip.<br><br>BYOB so bring it on!  The atmosphere is casual and calm with mediterranean/Turkish flare.  You can't beat the quality and prices, check Dawali Mediterranean Kitchen out!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UtfGAo4q72rqqRFkjiCAFQ/168s.jpg", "caption": "chicken shishkebab with great portions and a fantastic garlic sauce"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/C9h8HJ9Czq4Wl169D8Cgaw/168s.jpg", "caption": "hearty falafel sandwich with tahini"}]}}, {"review": {"des": "Had Dawali at a Fooda stand. While the chicken kabobs were good the value was terrible. For $11 I had rice and 4 small chicken kabob pieces. Total rip off. Would avoid eating at their Fooda stands. They nickel and dime for everything.", "pics": null}}, {"review": {"des": "The wife and I went here before a play at the Steppenwolf theater.  The service was fast and friendly.  The food was delicious.  For a long time, we have not had a standby pre-Steppenwolf restaurant.  This place may now be that restaurant.  <br><br>We started with what was essentially a puréed fava bean dip.  It came with pita bread and was delicious.  <br><br>I had the chicken shawarma  sandwich and the wife had the chicken shawarma plate.  Both were good.  My sandwich came with what appeared to be a yogurt sauce of the type that Greek restaurants put on gyros.  <br><br>The server recommended getting appetizers next time because we told her how delicious the fava bean app. was.  We will certainly be back and will consider her advice.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kSLNk5l_Ye1BbG_7u-Nffw/348s.jpg", "caption": "Qidsya (sp?) app. (Hummus/fava beans)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QNt-6ar-EnNLiczb1M0ddg/168s.jpg", "caption": "Chicken shawarma plate"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GP-qYgKK6kpQwrd3JDM3sQ/168s.jpg", "caption": "Chicken shawarma sandwich"}]}}, {"review": {"des": "I come here almost every time I have to go to North ave. This place usually has people in it, whether dining or carrying out. I especially like the kufta, meal or sandwich, doesnt matter to me, its delicious. I usually order double helpings of meat every time I order as well. Another shout out to the curry sauce, I find it better than the garlic for sure. I also really like the desserts. I get my food really quickly here, I actually managed to make it in and out of the place in 20 mins, with bill paid and everything. The food has always been really fresh and it always seems prepared at the moment i order it, it comes hot from the kitchen and doesnt taste chewy. <br><br>The place is definitely a diner, but nicely done up, with nice decor. The wait staff is good too, dont bother you too much and help you make decisions.", "pics": null}}, {"review": {"des": "Came for dinner with a friend after we watched Spamilton at the Royal George Theater.  I ordered the lentil soup and spicy chicken kebab entree.  These were both awesome dishes.  The soup had great flavors and was very warming on a cold rainy day.  The chicken kebabs were tender, juicy, had the right amount of spices, and came with a very delicious garlic yogurt dip.  Great place for a meal.", "pics": null}}, {"review": {"des": "There are lots of baby stores round these parts, so we always end up finding ourselves cruising with a kid, semi-exhausted and scouring for lunch places. There's not too many things I like more than a good lentil soup, which is how we ended up at Dawali for lunch one day.<br><br>The Yelpers aren't wrong: Dawali makes a dang good lentil soup, amongst other things. We totally overindulged for lunch, also getting a very good hummus, a cucumber-yogurt dip (their proxy for tzatziki), in addition to a wrap apiece. You'll be happy to know baby really enjoyed the dips.<br><br>Their wraps are stellar, amongst the best I've had in Chicago. The generous top layer of vegetables surely helps, but the pita is soft and fluffy, and the meat well-seasoned and tasty. Dawali is a very solid lunch spot, and despite the proliferation of our order, very cost-conscious as well.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OqgraLV-G1fIU-92Q75pnQ/168s.jpg", "caption": "lentil soup, cucumber-yogurt dip, hummus"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KWSg1961THccEpzk_Rrk5A/168s.jpg", "caption": "beef/lamb shawerma wrap"}]}}, {"review": {"des": "I have only ordered takeout from here so I can't speak for the dine-in service, but the food here is incredible. It's hard to find great falafel and shawarma in the United States, but this food does not disappoint!", "pics": null}}, {"review": {"des": "Terrible experience!!! Some friends and I were in town for St Patrick's day when we decided to stop and eat here. I'm not one to write a review online and to be honest I created my yelp account just off this one experience here. There are many things that went wrong with this dining experience but the only thing I came to talk about was how rude the staff was. Both my boyfriend and I ordered the chicken shawarma, when the waitress asked us if we would like hummus on it or on the side and stated we would like it on the side and when we asked if we could make it spicy she said no but that she could bring us hot sauce. Once we got our bill we had been charged .75 cents for every sauce. Not a big deal, we asked the waitress about the extra charges but while we did that a kitchen staff was bussing our table and over head us asking, he proceeded to start talking in another language about how cheap we were and how they weren't McDonald's, you could easily understand what he was saying. He continued to talk about this and us for the remaining 20 minutes we were there, right in front of our faces. The kitchen area is open and we were sitting directly in front of it so I could very openly see him talking about us, he even pulled the whole kitchen into it. They were talking so loud and so long that the waitress was trying to shush them while at the register. You could hear her say \"Mustafa!!! Tony!!!\" Over and over. It was horribly unprofessional and I have never been that disrespected as a customer. It would be a wonderful place if they could keep their mouths shut. I was just asking a question about my bill. The only good thing I have to say about this place is that the French fries were by far the best thing on the menu.", "pics": null}}, {"review": {"des": "The food is ok and clean, nothing unique on the menus thou. However, the hostess/waitress with the brown hair is very disrespectful and had bad attitude. I stopped going there because of her. She treats you like a piece of shit. She is one of those idiots who think that they are so smart and know everything. The one star for the service ultimately.", "pics": null}}, {"review": {"des": "Very good food- a touch on the salty side.  This is a minor flaw.", "pics": null}}, {"review": {"des": "Dawali has great options to choose from. From the hummus, wraps or entrees you can't go wrong.  The service has been prompt and friendly every time I've come here as well.", "pics": null}}, {"review": {"des": "Casual food, perfect before the theater (if you're not fancy).  We ordered the falafel, the qudsiya, the soup, and the veggie galaya--which was my favorite part.", "pics": null}}, {"review": {"des": "An overdue update to four stars. The chicken shawarma wrap with garlic sauce is phenomenal. It seems so simple and is so juicy and flavorful and my new addiction. Dawali has a great casual atmosphere and whenever we go, even on off hours, there are people there eating. Although the entrees are tasty the wraps are otherworldly. Our servers are always pleasant and attentive and the restaurant always smells so good when we walk in. <br><br>Fangirl. Dawali is a go-to favorite spot of mine.", "pics": null}}, {"review": {"des": "I love the food! But... You can't sit starting 30 minutes before their 930 close time! We found this out the hard way. Also, their published close time on the front door is 10pm.", "pics": null}}, {"review": {"des": "Dawali has rapidly become our go-to choice for food before seeing a play at the Steppenwolf across the street. The food is simple but delicious, and Dawali works in multiple timeframes.  If you have time, sit down and enjoy a mezze platter and some delicious soup.  If you're running late, call ahead and ask for a grilled shawarma wrap to go, which is still delicious, but you can devour it as you walk the 150 feet from the restaurant to the theater.<br><br>Highly recommended for its niche.", "pics": null}}, {"review": {"des": "We stopped in before a show for a quick bite.. this place was fresh and favourful. Good portions and prices, and the fries were awesome", "pics": null}}, {"review": {"des": "Awesome falafel sandwiches, and delicious hummus. Ready super quick for takeout and hooked-up with spring rewards. Great location for a quick bite on the go.", "pics": null}}, {"review": {"des": "Six Words: Ordered delivery, Classic Shawerma was decent<br><br>This is a review from ordering delivery - I haven't actually been to the location so I can't comment on service.<br><br>I've been looking for a new go-to Mediterranean delivery place ever since I moved north from Hyde Park. And I've had a few misses but I am always optimistic when it comes to shwarma. I ordered delivery from GrubHub on a Saturday evening and it was delivered in about an hour, which was within their estimate. So props to them. <br><br>I ordered the Classic Shawerma Sandwich (with hummus +$2), an order of Feta Cheese Bread Pies, and a small Baba Ghannouj. The bread pies were good but not great. I love feta and I feel as if they could've used a bit more. One of the pies had more feta cheese and you could definitely taste the difference between the two.<br><br>The Baba Ghannouj was creamy and delicious. I got 2 pieces of pita to eat with htm and oh, boy, did I soak those pita in the Baba Ghannouj. I almost thought about saving some for the next day, but it was too good to not finish. My thoughts were: \"What if it doesn't taste as good the second day?\" It probably would've tasted amazing but shhhh ... I was trying to justify eating it all. <br><br>The Classic Shawerma Sandwich was ... okay. I maybe shouldn't have ordered the hummus in the sandwich because it made the pita a bit soggy and it was a little hard to eat. Like the whole sandwich was falling apart as I was eating it. The beef was okay, not amazing, but okay. Seasoning seemed to be there but they were cut up into tiny pieces so it was hard to tell. They were a bit heavy on the iceberg lettuce. Never a fan of iceberg lettuce in anything.<br><br>The Tahini sauce was a bit too thick for my taste. A little too heavy on the dairy and a little light on whatever else makes up the Tahini sauce. I would've liked to have recieved a spicy sauce to go along with the Tahini but there was nothing in my delivery bag. <br><br>Overall, it was a good eat. I'll probably order delivery from here again.", "pics": null}}, {"review": {"des": "I've been to this restaurant several times and have ordered delivery a couple of times. Each time I have had the same great service and delicious food. I pretty much stick with the Beef Shawarma rice plate. The food is always fresh and the portion size is decent.", "pics": null}}, {"review": {"des": "This was a horrible restaurant. Everything was overlooked and dried out. None of the sauces had any flavor. We were very disappointed. My daughter, who can usually find something nice to say about anywhere, said it was the worst Mediterranean food she had ever eaten.", "pics": null}}, {"review": {"des": "Wow, seriously impressed with this sneakily badass BYOB Mediterranean gem in Lincoln Park! This location has been a bit of revolving door over the past decade or so, so it's nice to see a place keep their footing in this upscale hood. <br><br>We called ahead due to the fact that we had nine people. We were running behind and showed up about twenty minutes late; no problem, said our friendly host and manager. I should note that the place was packed, so we weren't expecting this, but were pleasantly surprised. We brought a copious amount of beer and wine, which we immediately started consuming. <br><br>Despite being rather intoxicated and loud, the staff put up with us and were friendly throughout the meal. All of us got some variation of shawarma or kabob. The hummus and veggies are fresh, meat cooked perfectly, pitas hot, and rice tasty. The menu is surprisingly affordable, considering the location. <br><br>If you want Middle Eastern food in Lincoln Park, this is no doubt the place for you. We'll come back with more beer and wine soon!", "pics": null}}, {"review": {"des": "To start things off the decor of the place is very cozy the lighting gives the place a nice glow that's not too bright or dark. <br><br>We came with 3 people we each had a  lentil soup and shared the appetizer plate which contained hummus and falafel for all 3 of us. I ordered the 3 combination entree with spicy chicken kabon, lamb kabob (adds a 2 dollar charge), and chicken shawarma. To me the lamb and chicken shawarma taste very similar to most Mediterranean places, but what tasted delicious was the spicy chicken kabob, it contained a great spice with a nice kick for people who love spices.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2l1tsTwXAhjXzzV2AAJj3A/348s.jpg", "caption": "The dessert to finish"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/X0rT_zFZvdRk_zwwtPl27g/168s.jpg", "caption": "The main 3 combination meal"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gW2ivv62OGx_qQwZHuWGpw/168s.jpg", "caption": "Appetizer for group"}]}}, {"review": {"des": "Great vegetarian options - I had the sabich sandwich which was delicious and perfectly portioned.", "pics": null}}, {"review": {"des": "I have no idea where to start. <br><br>This was our first time in Lincoln Park and we drove 1hr 30 mins in order to eat at this restaurant. We were searching for a Mediterranean restaurant in Chicago and for some reason this restaurant came at one of the top recommended in Yelp.<br><br>Let's start with pros.<br><br>Pros: <br>Delicious food<br>Everything ordered was warm and freshly made<br>BYOB<br><br>Cons:<br>HOT as hell! We asked the waitress to please turn up the air and they said that's the most the AC can produce. I don't blame them for this issue but management needs to do something about this. I was so embarrassed because my family came in from another country and this was the restaurant I chose for us to meet. <br><br>Service was great at the beginning and then the waitress kept disappearing or talking to her coworkers as we sat there waiting for her to look our way. <br><br>Parking was a huge issue. We drove around for 20 minutes and finally found one spot and ONLY spot that remained in a parking garage 10 minutes away (walking) from the Dawali. <br><br>Cost of food is a little overpriced for the portions served. <br><br>...Overall good food and restaurant. Simple modifications need to be made before it becomes a great restaurant.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/afish7xKfrcgjhktclcdgw/348s.jpg", "caption": "Kunafa - a disappointment"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0zmD1LFM0_x_dDEOCD-ecw/168s.jpg", "caption": "Spicy chicken and chicken shwarma"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eQdTQJrp8SF0WqHpQwc9Gg/168s.jpg", "caption": "Combination platter: spicy chicken kabobs and beef shwarma"}]}}, {"review": {"des": "Oh man, I find myself wanting to go in here every Saturday late morning. Very affordable and delicious! The hummus, shawarma, and falafel are delicious, and this place is cheap. Solid Mediterranean food! It is BYOB but my favorite thing was the Arabic coffee, tastes like earth and is very unique the way it is made, havn't been able to find that anywhere else in the city besides Dawali so give it a try if you like trying unique forms of coffee. Awesome neighborhood restaurant : )", "pics": null}}, {"review": {"des": "the food is great, but don't go unless you've got a ton of time to kill. i used to frequently come here for lunch, but had to switch lunch spots because i don't have time to wait 35 minutes for a salad. maybe they're under new management or have a new cook. if so, they should seriously consider making some changes.<br><br>pizza capri is right down the street. their food is great and the service is amazing!", "pics": null}}, {"review": {"des": "Excellent Excellent Excellent!!!!!<br>The App Sampler, the shawerma, the chic kabobs, everything was more delicious than the next. <br><br>On top of it all, the service was fantastic! Thanks Felicia for making our date night grand. <br><br>Like the Terminator, we will be back!!!!", "pics": null}}, {"review": {"des": "Good if not a little pricey for what it is. The schwarma pita is better than the wrap, they offer fries which is nice, and the falafel are great and taste fresh even with delivery orders. Every single one of the sauces they send with the food are GREAT, too. Plus they they tend to show up faster than their delivery estimate, which is always a plus.", "pics": null}}, {"review": {"des": "I really love this place. The vibe is pretty casual but the food is really good. I really enjoy the spicy chicken kabobs. The restaurant is BYOB and the items that are gluten free are labled on the menu.", "pics": null}}, {"review": {"des": "We came here at an odd time at 4pm on a Thurs. it wasn't lunch or dinner so the place was empty. Service was fine but seems unneeded since we didn't order too much. <br><br>We just got 2 sandwiches which came with a little dish of tahini sauce: <br>-the classic falafel - this had a different take from other places because it had eggplant and cauliflower in the sandwich. wasn't too crazy about the bread itself otherwise it was good.<br>-the classic shawarma. - the meat was a bit skimpy. I expected the pita to be packed in more. <br><br>It's no Pita Inn, like the chain in the 'burbs that I love, but it's still a good option for this part of town when you want something different. From NYC perspective, this would get 2 stars for the pitas not being packed for the price or the taste... like it would be in east or west village. I still hope to come in and try other items.", "pics": null}}, {"review": {"des": "First time ordering delivery and we won't be again... we ordered a salad and the 3 entree combination platter (planning for 2 of us to share), but the meal was 6 pieces of meat!! Yep, 4oz of meat. That's it. That's less than you get from 1 kabob anywhere else in town... and the half cup of salad that came with looked like a joke! We had to order more food from elsewhere.<br>The actual salad we ordered was a pathetic looking pile of romain cores with too many tomatoes, but enough olives for a family of four.<br>Came with 2 cold Costco pitas.<br>Delivery was fast.<br>Overall the food TASTES good, but because of how ridiculous the portioning is we're only giving them 3 stars. We won't be ordering again.", "pics": null}}, {"review": {"des": "Such a blessing to live in the city and have so many little places and areas to enjoy great food. The Falafel was one of the best. Do ask for the Hot sauce to go along with it. It is a BYOB so we enjoyed a wonderful California Pinot Noir with our meal before heading to Steppenwolf. We will be back. Ethnic eats top our go to list! Reasonably priced entrees, too!", "pics": null}}, {"review": {"des": "Not bad. Stopped in for lunch. Thought the shawarma was flavorful. I liked the hummus. The restaurant is casual in a good way. Service was on point and prices were reasonable. I'd be back.", "pics": null}}, {"review": {"des": "Good food! <br>Liked the combination plate better than the sandwich we ordered. Loved the tahini sauce and the garlic sauce that came along with our order. <br>Will eat here again!", "pics": null}}, {"review": {"des": "Great food, but I gotta give a low review for the following reason: <br><br>One completely unacceptable thing is that they have a guest wifi network but apparently employees are no longer allowed by management to give out the password to anyone. <br><br>Came to get some work done for lunch and was told this. I used to be able to use their wifi on my iPad. Now I can't. What a backwards policy.", "pics": null}}, {"review": {"des": "If I could give 3.5 stars that's what I'd give this place. But hate to downgrade a place, like to give them the benefit of the doubt.<br><br>5 of us ate here on a Saturday night. The pluses are the service was great. Quick, friendly. The owner checked in on us a few times, nice touch. <br>The place is nicely decorated & clean. Prices are reasonable. <br><br>The slightly negative piece was the food. I had the beef/lamb Schwarma & the meat was dry. The rice was ok & the pitas were just ok as well. (Naf Naf has the best pitas) <br>They had good grape leaves. <br><br>The others with me felt similar about their food. <br><br>Be aware they don't serve alcohol but you can BYOB", "pics": null}}, {"review": {"des": "This is such a great place. We come here for dinner before going over to the Steppenwolf. <br><br>Love that is it BYOB. The food is so good and the service is always top notch. We look forward to our visits. <br><br>Great menu selections.", "pics": null}}, {"review": {"des": "Went to Dawali with a friend on a Friday night around 9-9:30. There were only a few tables occupied so we had our choice of sitting wherever. This place is BYOB, which is great! We brought a bottle of red wine to share. It's a pretty small restaurant, just north of the North/Clybourn red line stop and has a homey feel to it.<br><br>We started with the small humus (good for 2 people) and the grape leaves. For entrees I got the chicken schawarma and my friend got the beef kufta. Everything was pretty solid. They give pretty generous portions for relatively cheap prices. My friend is used to home-made Lebanese food and thought this was just okay but my tastebuds aren't that refined and was satisfied enough with the meal.<br><br>Overall, this is a nice, quiet place to grab some Mediterranean food in Lincoln Park/Old Town.", "pics": null}}, {"review": {"des": "Super small portion for the price. Might have been the most unauthentic Mediterranean food I have ever had flavor and decor wise, especially the portion.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2t_z4lIpXINdzvgtvDLzPQ/348s.jpg", "caption": "Not sure if I am happy about this portion for $15 dish."}]}}, {"review": {"des": "I found this place on yelp and thought it would only be appropriate to leave a review! <br>The food was great, especially considering the price. <br>I was a big fan of the hummus and falafel. <br>The portions are on the larger side. I went with a friend and we got the appetizer sampler and schwarma to share -- so it was more than enough for both of us.<br>The service was good, our waitress was very attentive and have some good recommendations about options on their menu. <br>Ambiance is nice too -- I will definitely be coming back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pAEf6pzOre0v2zFXlnx03w/348s.jpg", "caption": "Appetizer sampler: Hummus, babaghannouj, fulmudammas, masakas"}]}}, {"review": {"des": "This place was a disappointment to me. In general the entrees were typical and reasonably flavorful but the pita was stale and hard around edges. Mediterranean food is about the bread so I was very disappointed to be served stale bread that was reheated. But service was quick and good. Can grab a quick meal here before a show.", "pics": null}}, {"review": {"des": "What a great little restaurant!!  Lived my veggie wrap. The service was great and the food was fresh. I was pleasantly surprised with how good this food was. Oh yes and it's byob. Bring an appetite and bring your friends!", "pics": null}}, {"review": {"des": "Pros:<br>Very close to the North and Clybourn red line stop<br>BYOB - beer and wine only<br>Accepts credit cards and takes reservations<br>Delicious food<br><br>Cons:<br>None<br><br>My go to here is the house falafel. They add in a extra ingredients and it really takes an already tasty falafel to the next level. It also goes for only $6 which is a steal for both your wallet and your taste buds.", "pics": null}}, {"review": {"des": "FOOD IN A BLINK!<br><br>It was 9:30pm on a Thursday Night. My wife and I had just left the theater and our intentions were to pop in here for a free smell. We were greeted at the front door by the owner. We asked to see a menu for a future meal. As we were looking at the menu we both decided to grab a quick bite. We only had about 20 minutes and the owner told us he could have our food to us in 5 minutes. <br><br>Can I tell you how much I am in love with this place! First great customer service. The owner was getting ready to close for the night and he still was able to be friendly and nice to us. Plus he didn't turn us away when we went from just looking at the menu to ordering the food. <br><br>We grabbed a table near the kitchen. We wanted more of the free smells. Our lentil soup arrived almost immediately. We dived in and I will say it was delicious. It was nice and hearty. I hate watery lentil soup, which I've experienced elsewhere. They even had some toasted pita chips on top, which was a nice touch. <br><br>As we were still eating our soup, our chicken shawarma arrived. Yes everything was delivered in under 5 minutes as promised by the owner. The chicken shawarma was full of fresh veggies. I wish I had some hot sauce too but we were in a hurry. We had to get home for the babysitter. <br><br>We walked out the door in under 20 minutes. For the record, this is not a fast food restaurant, so to have an amazing dinner ordered and served fast is incredible.  But not only was the food fast it was delicious. And not only was it delicious it was really cheap. Could my bill be correct?  I really love this place! We will be back. In fact, I can hardly wait until we come back. I did spy my wife checking out there carry out menu yesterday. Oh boy!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Yz1R20RhLfu_rjvt4uuIDg/348s.jpg", "caption": "Toasted pita bread!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dvF899vZvigm2xzJv4GApQ/168s.jpg", "caption": "Yum yum chicken shawarma."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/P3mXGoufrliYwh7Q4CoEqg/168s.jpg", "caption": "The lentil soup is so good!  It's nice and thick and full of flavor."}]}}, {"review": {"des": "Holy hummus! They've got to be putting something illegal in that isht cause I can definitely see myself real Requiem For A Dream-y for another taste. I only had it in the Sabich sandwich, but you could tell it was one of the best things on their menu. <br><br>The Sabich itself was pretty crack pipe good with fresh eggplant hard boiled eggs and some silky smooth Greek yogurt on the side. At under $8 including tip it's got to be one of the best deals in pita bread that I've ever had. <br><br>Despite the sit down/BYOB atmosphere, my food came out lightening quick so it's an excellent place to grab either a quick bite or sit and sip some boxed Franzia. (keep it classy Chicago) <br><br>In summary, these reviews don't lie. Make it hapepn cap'n.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6rFo60CfJROQqXfRYFWAiA/348s.jpg", "caption": "Sabich"}]}}, {"review": {"des": "While the pita was a bit dry and not always served that warm, the food, prices, BYO policy, space and service bring it home in a big way.  Dawali is a favorite of a friend of mine so we brought a group of six for dinner last night; the Zesty Hummus was spicy, my Classic Falafel sandwich was good and these prices are ridiculous for a sitdown restaurant in this neighborhood (I mean, you really could spit in a high arc and hit Balena or Alinea, just a short distance away).<br><br>The six of us got six entrees, two orders of appetizer bread pies, and the hummus, and the total with tax and tip was $66.  WTF!!!!<br><br>If my pita bread that came with the hummus (and the falafel sammie, which also had just average bread) was even decent, this is an easy five-star review.  Since we hold preview series tickets at Steppenwolf across the street, we'll be back for sure!", "pics": null}}, {"review": {"des": "I went here with high expectations, and those expectations were not met. <br><br>The Qudsiya appetizer was absolutely delicious. However, my actual entree - spicy chicken kebab and chicken koubideh - was just mediocre. The meat was moist and had a nice texture to it, but it wasn't as flavorful as I had hoped it would be. Also, the rice really leaves something to be desired. Overall, this place is just ok. The food is fine, but the food is overpriced and not as filling as what you would expect for what your pay.", "pics": null}}, {"review": {"des": "Such good food. I've only gotten takeout here (about 3 or 4 times) but never dined in, so I can't speak to the service. Still, the staff is very nice and the food is excellent.", "pics": null}}, {"review": {"des": "Gristle in the beef shish ka bob entree made half of it unedible; wait staff would not swap entree side salad for a cup of soup. Other than that i liked it", "pics": null}}, {"review": {"des": "I've been to Dawali twice now and each time I wonder why I don't come back more often. Probably because it is the equivalent of 4,000 miles away in Chicago travel distance. A friend of mine turned me on to this spot after she moved nearby. I feel like it is a not-so-hidden gem of OT/LP! <br><br>The prices are super reasonable and the portions are generous, plus the food is absolutely AMAZING. It is the best Mediterranean food I've had anywhere in the city. The service is always fast and friendly, and I appreciate the fact that it's not super yuppie (especially for the area). Also....BYOB. You literally can't think of a better combination.<br><br>Things I have tried and would highly recommend:<br>Falafel (YUM SO CRISPY)<br>Chicken Shawerma pita (DAT GARLIC SAUCE THO)<br>Hummus <br>Lentil Soup<br>Veggie Galaya (so yum)<br><br>The only thing I was NOT so stoked on was the Spinach Bread Pie. Just a little bit...spinach-ey for me. <br><br>Though my nearby friend is moving to Lakeview and this probably won't be our meeting spot for early post-work dinners any longer, I would absolutely travel the 30ish minutes on the Red Line to eat here again once she goes. And that's saying a lot.", "pics": null}}, {"review": {"des": "Very good traditional Mediterranean food at a surprisingly low price considering the location.  He lentil soup was great. The falafel appetizer was fresh made.  <br><br>I will come back again for sure.", "pics": null}}, {"review": {"des": "The shawarma chicken and beef/Lamb are very flavorful. The falafels are also quite awesome.", "pics": null}}, {"review": {"des": "The good: Great tasting food and great service. The meats served were very tender and cooked perfectly. The salad, rice, and sides were good enough to hold the 5 star rating, but they could have been better. The service was fast and friendly. Pretty decent menu as well. Also, BYOB. Prices are solid.<br><br>The bad: The atmosphere is good, but you can see the kitchen and it's fairly loud. The lighting was off putting because of that reason as well.<br><br>Overall: Great tasting food for an average price. Good place for a casual dinner and a great lunch option as well I'm sure. Highly recommend.<br><br>Atmosphere: 8/10<br>Service: 10/10<br>Food: 9/10", "pics": null}}, {"review": {"des": "THIS PLACE IS RIDICULOUSLY GOOD! I came here for my birthday with my boyfriend and we had an amazing time! We ordered falafel, pick 3 combo (chicken, shrimp, and beef kufta), and the lamb/beef shawerma. I love Mediterranean food and this place definitely did a good job! Price was just right for the amount of food you get. We barely had to wait on a Friday night and it was 8pm when we got there. We parked like 3 blocks away where we found free residential parking.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bqoVd74KmMTdM6NOTdaLNQ/348s.jpg", "caption": "Shrimp, chicken, and beef kufta"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Je2pTXpCs6i52c7ydTiQlQ/168s.jpg", "caption": "Beef and lamb"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/L0CO1ozWDgSG_itzNUcufg/168s.jpg", "caption": "Falafel"}]}}, {"review": {"des": "I came here a few days ago on my birthday craving some Middle Eastern.  The falafel were delicious hummus tasted great but I believe they're a little skimpy on the portion.  I ordered a combination grill with spicy chicken kabob, lamb kabob, and beef shawarma I must say it wasn't up to par at all.  Actually the beef shawarma meat was bad and chicken was very salty but the lamb kabob was really good.  Sorry but I wouldn't recommend this place because spoiled meat is unacceptable especially when the person eating with you is your spouse and she is pregnant.  I probably won't come here again unless it's for falafel only.  The service was excellent but I am assuming this is more of a lunch spot more than anything.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/W1g7V1pcM0CK1A3p14Wq1Q/348s.jpg", "caption": "6 falafel and small hummus under 10$ now that's a deal!"}]}}, {"review": {"des": "Definitely worth a try for authentic middle eastern food. Im looking forward to trying more from the menu. Lots of good stuff at great prices.  I had the chicken shawarma sandwich and falafel. The sandwich was decent. I felt like the chicken could have used more flavor and some pieces were a bit burnt but overall pretty good. Make sure to get hummus in your sandwich. It's an extra charge but should come with it to begin with.  The falafel was very tasty I'd definitely get it again. The service was fast and friendly.", "pics": null}}, {"review": {"des": "Went there for lunch with family.  The ambiance was somewhat cold.  We started with the appetizer sampler which was fairly tasty.  We then ordered several sandwiches (kafta, shish taouk, and traditional shawerma).  The taste was OK but nothing to rave about, having tried several middle eastern restaurants in many states.  The chicken was apparently grilled on a gas grill, not charcoal. which made for an unauthentic taste.  We then finished it off with Kenafeh, which was so-so.  <br>Based on the reviews, Overall, the place is OK, but not exceptional.", "pics": null}}]}