{"name": "del-seoul-chicago", "reviews": [{"review": {"des": "Im still new to what Korean Tacos are or what the craze is behind them so I thought, why not? <br><br>I tried their steak taco and a shrimp. The portions are big as they load it up with cabbage and other toppings. As a Mexican Taco snob, the flavors to these were so new to what a taco tastes like until I got to the meat. They do it right because they get the meat right and honestly all the flavors compliment each other. I approve. <br><br>I also had to try their wings since they looked so good. I think these are the best wings in the area, sorry Crisp fans. They only have one sauce for wings and it's a thicker and sticky sauce but it coats their wings well so be prepared to go through napkins. I pair these wings with a side of fries that come with an aioli. The aioli is light and good but I still prefer the sticky sauce of the wings so I'll dip the fries into that. <br><br>Overall like any hot restaurant in the area there can be a wait on a weekend night since, but they're pretty good at accommodating and also have take out.", "pics": null}}, {"review": {"des": "This place certainly does have tasty food, but I'm extremely disappointed by the limited menu options here, especially for vegetarians.<br><br>Korean and Mexican are both cuisines that allow for a lot of variation and experimenting and can easily give produce vegetarian dishes. This place however, not so much. Barring sides, there were two things that I could order which did not have meat.<br><br>The blackened tofu tacos were absolutely delicious, and if I am around the place I might stop in to get them but else if you're looking for vegetarian options, go anywhere else. The fries were pretty solid too.<br><br>What was also disappointing was that they had Banh Mi sandwiches, which I love, and didn't have a blackened tofu one. That in my opinion would have been a banger.<br><br>If you eat meat, I've heard people are pretty satisfied with the food here.", "pics": null}}, {"review": {"des": "Sooooooooooooo disappointing. Like many, I saw the Triple D episode and wanted to try this place out. The place was clearly experiencing the Triple D bounce still as it was pretty busy around lunch but still managed to find a place to get seated (they will seat you after you order).<br><br>We got the kimchi fries, K-Town Chicken Wings, hot stone veggie bibimbap, miso soup (it was cold outside) and the kids BBQ plate with chicken.<br><br>Let me start with the \"Kid's\" BBQ plate. The only option for chicken is a spicy chicken - which is super weird. Our older kid can handle spicy but the younger one still has a little aversion to it. Fortunately it wasn't too spicy but why not offer a non-spicy chicken option for kids?<br><br>As for the rest of the food, let me start with the miso soup. It's a weird option to have at a Korean restaurant and for $1.95, I expected a little more than what seemed like instant miso soup with tiny tofu pieces. Yes we were cold and so it helped get us warm but we could've saved the $8 for 4 tofu soups.<br><br>The bibimbap was fine but nothing special for $12. The rice at the bottom did not crisp up as much as we like and the toppings were forgettable.<br><br>Next up was the chicken wings, the featured item on Triple D. WAY too much sauce. It felt like I was eating a candied apple. The sauce was a little too sweet and because the sauce was overwhelming, I could barely get a sense of the chicken itself. <br><br>Finally, the kimchi fries - the best item in our opinion. The kimchi had a good spicy and flavor. The pork belly added some nice flavor and didn't overpower the rest of the fries. Would have liked a little more crunch from the fries to hold up against all the cheese and sauce but overall a good item. Probably what saved this place from just being a plain bummer. I get that Korean may not be a big cuisine in Chicago, but coming from LA where you have an abundance of good, if not great Korean places, this place disappointed. <br><br>Unless you're a local who need a Korean food fix, you can skip this place.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZQrlRrDrHLo67ytj8uSYZw/348s.jpg", "caption": "Kimchi fries. Ask for light cheese."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5NjcPErPoah6mTnxpl9hfg/168s.jpg", "caption": "Veggie stone pot bibimbap. It was fine but not memorable"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Jb-lwFBrUaz1P3wexXSvSA/168s.jpg", "caption": "Kids bbq beef plate. Meat was okay but kids didn't love it"}]}}, {"review": {"des": "I LOVE LOVE LOVE the tacos and fries here! Sometimes the line can get long, the seating is a little cramped, and the menu items are pricey, but it is WORTH IT. Everything I've had is super delicious. My absolute favorite is the shrimp taco! I would also recommend trying the kimchi fries or poutine fries or even just the regular fries with the aioli sauce MHMMM", "pics": null}}, {"review": {"des": "We were in town and made a stop here at Del Seoul for some good Korean/Mexican fusion food! The one thing I love about Chicago is that it everything is literally right around the corner. Del Seoul was good and definitely worth trying.<br><br>I think Del Seoul is a cute little place, it's a good place to grab a quick (or slow) bite and the service was quick!<br><br>We came with a large appetite and we got the Hot Stone Bowl Bibimbap, Kimchi Fries, and Pan Fried Dumplings. It was definitely enough for 2/3 people to share. The portions were big and the food was good. I enjoyed the flavor of each dish. I think my favorite were the Kimchi Fries. The meat was sweet and the sauce drizzled over it was good. I also liked the green onion garnish and sesame on top. The meat in the Hot Stone Bowl Bibimbap was good as well, and the meat to rice ratio was nice. Instead of it all being rice, they had a good amount of meat in the bowl. I also thought the presentation of the food was nice. There were so other things on the menu I also wanted to try, like their kalbi tacos, Korean chicken wings, and poutine fries. But I guess this means I gotta come back in the future! <br><br>The price was a tad bit expensive in my opinion. Our three dishes came out to be around $46, but when in Chicago!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/o0sMDoZcX688W6VvH9cy-w/348s.jpg", "caption": "Hot Stone Bowl Bibimbap, Kimchi Fries, Pan Fried Dumplings"}]}}, {"review": {"des": "Overall, pretty solid fast casual place for Korean food. They have Korean/Mexican fusion options as well as some other interesting combinations like Korean poutine fries. On the menu they have BBQ meat tacos and various takes on the cheese fries. They have some traditional Korean options as well like hot stone tofu hotpot and bibimbop.  The options here are pretty solid and very filling, but definitely on the greasy spoon side of foods. Interior is clean but fairly bare bones, restaurant is self-service. You go up to the counter to order and pick up your own food. Everything comes out quickly. <br><br>The sundubu tofu tastes decent but is lacking in savory or depth, but definitely fills the spot if you are craving son. The poutine fries were interesting - cheesy and covered in korean flavored meat and very greasy. A huge starch and grease bomb, which really hits the drunchies. Came in a large shareable portion. Bibimbop as well was a large portion. Least favorite was the Seoul-Style Street Dumplings which tasted a bit stale and flavorless. <br><br>Overall, some solid Korean fast food combined, pretty convenient and affordable.", "pics": null}}, {"review": {"des": "Del Seoul is a wonderful Korean-Mexican fusion restaurant located in Lincoln Park. With its many options for tacos, this fast casual dining place is great if you're hanging out with friends or just want something quick to eat<br><br>FOOD: What Del Seoul is known for is its tacos. There are a ton of options and they combine the flavors of Asian food with Mexican ones. If you're going, you need to get the tacos. On the menu they tell you which ones are most popular. The K-Town chicken wings are also fantastic Korean fried chicken. Great for sharing! <br><br>SERVICE: Fast. Once you order they give you a number on a stick and you can sit anywhere you want. They'll bring the food out to you and it's very quick. Other than that, staff is courteous and drinks are self serve. <br><br>AMBIANCE: The seating is a little cramped as there's not too much room. The place is well lit is very clean. <br><br>OVERALL: Del Seoul is a fantastic place if you're looking for something fast-casual. The Korean-Mexican fusion definitely make for a unique dining experience", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FlvzIgdvlOdpyqILV8piuw/168s.jpg", "caption": "K - town Chicken Wings"}]}}, {"review": {"des": "My experience at Del Seoul was fine. I was not unhappy with anything, and I wasn't blown away either. The concept and allure of the menu were more exciting than what was delivered.<br>__<br>I came in on Saturday around 1:30pm, and was surprised to find this place packed! It is counter serve, and the line was to the door when I got there. It didn't take too long to get up to the front and place an order, and my party was able to be seated right away after ordering (you can't get a table until you order).<br><br>We ordered: <br>Seoul Style Street Dumplings<br>K-town Chicken Wings<br>Kalbi Poutine<br><br>The chicken wings came out first. They were a mostly sweet with a touch of spicy, swimming in a sticky soy-based sauce. I would have enjoyed more garlic and chili (which the menu lists in the sauce), as both of those flavors were muted. I was also expecting more crunch from the breading, considering they were advertised as K-Town wings. The Korean wings I'm used to are double fried and super crunchy, but these seemed to be a normal single fry with a softer skin texture. The menu advertises these as \"jumbo\" wings, but I would call them normal sized based on my chicken wing experience, which is embarrassingly extensive. All in all, they were a fairly middle of the road asian-flavored chicken wing.<br><br>Next came the dumplings. These are larger than average dumplings, about the size of a golf ball and packed full of filling (there was no loose wrapping / extra space). They arrive piping hot and slippery, so you have to wait a minute to easily pick them up and also not burn yourself. The texture was pleasing, hearty with a little chew. The stuffing had both meat and I believe rice noodles inside. My beef (pun absolutely intended) is that they ate a little bland. The meat was a bit under-seasoned, even after using the dipping sauce.<br><br>The poutine arrived last. Unfortunately as designed, it eats like a basic, loaded baked potato. There was just way too much \"crema\" which tasted like regular sour cream. The dousing with crema, coupled with the green onions, just planted the baked potato similarity firmly in my mind. We ended up scraping most of the crema to the sides in order to both find and taste the short rib, which was pretty solid by itself. The beef just gets completely masked if you eat it with the crema. If the crema was a thin drizzle across the top of the fries, with more of the gravy (poutine normally has more gravy) and cheese, these would have been more enjoyable.<br><br>I won't be jumping at the chance to return here, but if a friend really wanted to go I would give it another shot but order different items. They DO have checks next to their \"popular\" menu items, and two of the three items I ordered were not checked. I just felt that everything I ate could have been improved with a slight change to the preparation.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-Z6S5ohBNHjQrAKmwf5Mnw/348s.jpg", "caption": "Kalbi Poutine"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NGA7-bbgpKqNzZa_EJfyWQ/168s.jpg", "caption": "Seoul Style Street Dumplings"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qWwkoH568DyAcEImrvn8_A/168s.jpg", "caption": "K-town Chicken Wings"}]}}, {"review": {"des": "Love the Korean/Mexican fusion. The fish taco and sesame shrimp taco are amazing; not a fan of the pork belly but except that the Kimchi Fries taste pretty awesome too. Now I could say the K-Town chicken wings don't taste like General Tso chicken bit that'd be lying lol. <br><br>But anyway, Del Seoul has just become my fav place to eat in LP area. Should've ordered more tacos", "pics": null}}, {"review": {"des": "I have been to Del Seoul about half a dozen times in the last month and a half, and I can't recommend it enough. I've seen numerous restaurants get the Korean-Mexican concept disastrously wrong, but Del Seoul gets it so, so deliciously right! <br><br>You have to place an order at the counter first, and wait to be seated. The place is packed on both weeknights and the weekends, but service is fast, the staff is friendly, and I've never had to wait more than 10 minutes to be seated. Tables are small, and are either for 2 or 4 people, so I would not recommend coming in a large group. <br><br>If it is your first visit, i recommend getting tacos (I'm partial to the sesame chili shrimp and the sambal fish, but I've heard great things from my meat eating friends about the Kalbi and bbq pork too). I also love their spicy, cold, bibim noodles ( a solid vegetarian option that can be made vegan if you ask for it without the half boiled egg atop). I've also tried the kimchi (appears to be store bough, and you can buy a jar to take home), fries with some sort of aioli (do not recommend), and veggie hot stone bibimbap (substantial, but you have to mix it yourself). <br><br>The food portions are not too big, but the place is very affordable and dinner for two coats under &25 without alcohol.<br><br>The place isn't BYOB, and they serve alcohol. I've never partaken, but I think it's beer, ciders, and wine.", "pics": null}}, {"review": {"des": "I just have to eat here every time I come to Chicago. As far as the ambiance it's a really a fast food place where you order at the counter and it's brought to your table. That said it's a welcoming albeit busy place for a meal at times.<br>But the food..,it's a 5. The  chicken wings are the best I have ever eaten. They are coated in a sticky wonderful Korean barbecue sauce. The wings are crispy on the outside and moist on the inside. I could go on and on but  order them and you will thank me.<br>The Korean tacos are also out of this world. The shrimp are very good as are the short rib and pork tacos. All are just bursting in flavor and are really big. 2 of them with a shared wing platter is more than enough. So that also makes them cheaper than a burger at McDonalds. The bento boxes are Ali excellent as are the dumplings. <br>I love Korean food but I feel until I came here I never really experienced it at a high level", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/D6kLLuYPQe2SIJzeMmgugw/168s.jpg", "caption": "The best chicken wings I have ever had anywhere"}]}}, {"review": {"des": "If you're looking to grab a quick bite this is a good place to check out. It's an Asian / Mexican fusion restaurant.  <br><br>I've only tried the shrimp tacos and the kimchi fries so far. I would recommend both.", "pics": null}}, {"review": {"des": "Not a bad spot. We got the shrimp tacos, and I also got the hot stone bibimbap- my go to at korean restaurants. Though as this is more fusion style, I should have ordered differently. The bibimbap was decent, but not the best. I would have liked to have some kimchi with it, as it traditionally entails, but the fusion style gochujang sauce was fine. The shrimp tacos were tasty though, and I believe the tacos is the way to go when ordering here. Quick service and a nice fast casual pick for asian fusion food.", "pics": null}}, {"review": {"des": "So a friend of mine lives nearby and was raving about this place and we walked by and I just couldn't understand the excitement lol. Then I looked them up on yelp and was like how in the world do they have this many reviews!? Then I tried their food and it all made sense lol. Every time I come to Chicago this place amongst a few others are always on my list. <br><br>The door is weird...does anyone else mention that in their review ? Like I'm so uncoordinated getting into a restaurant shouldn't be that hard lol but anyways...<br><br>The people working the cashier are always super great to start things off, and the music ! Always jammin' in there. I love the vibes every time I'm like they must see me coming in and turn on a station personally dedicated to me and my happiness lol. We get the fries, tacos, bento boxes and one more thing I can't remember and everything is soooo good. The chicken bento box is my favorite. The sauce they put on the rice (insert heart eyes) go on ahead and order a side of that sauce at the cashier when you order, thank me later. But seriously good music, super casual place, super good food, and the employees are awesome it doesn't get better.", "pics": null}}, {"review": {"des": "Yummy!! I used to not be open to trying Asian Fusion food but have recently learned the great wonder that it is....<br>The service was very efficient, fast, and friendly. My brother and I ordered the Korean Wings and Kimchi fries and both were sooo delicious! We intended on having a light snack and assumed these two dishes wouldn't fill our stomachs, but we were wrong! My only complaint would be that the cleanliness was average and could be improved. Overall, we had a delightful time and would definitely come again if we were back in the city!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XCzc_NkXtXGIIKhu3TnIhQ/168s.jpg", "caption": "Korean Chicken wings"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/19oEMCnzpSirQMh9RWL85g/168s.jpg", "caption": "Kimchi fries!"}]}}, {"review": {"des": "Good flavor, terrible service, terrible quality. <br><br>One of the first things I saw walking in was the enormous help wanted sign on the window, so I knew that there was no way that the service would be great (generally isn't anywhere when understaffed). I was looking forward to the Korean food as I was totally craving it and I have to say, I was thoroughly disappointed.<br><br>The meat was practically inedible, with pieces of fat and overcooked bits all throughout! I got a chicken bowl and a taco and literally could not even get through either. Never will I ever be seen here again! It's literally a total waste of my money. <br><br>They are so popular and busy, but out of all honesty, I absolutely do not see why.", "pics": null}}, {"review": {"des": "Honest review: been here 4 times be warned its pricy they sell alcohol . this is a order n sit down and they bring you your food type of restaurant. you can choose between getting a taco or a ban mi which is a sandwich. There are also bipimbops which are rice bowls if u order this be careful its hot asf and if u want it to go ask them to do it for u its hot asf u will burn urself n u can get a bento box which is like grilled meat and rice. There are also soups and other sides just try things n theres usually a special. The ambiance is small and there are no reservations so i would recommend to come early have a friend sit at an empty table order food n boom ur good if the waits supper long go chill out at mollys cupcakes then come back. Service i hated it they are teenagers so not that friendly not really trained good really lazy there was one person here who had an attitude the whole time and another thing learn how to space out dishes like u guys are a restaurant not micky ds act professional. Food: its cheap and the portions are big. Are they the best tacos i ever had not even close best asian food not even close its good but its a cheap place to get good asian tacos. Wish it was open later. Plz make desserts everyone who eats here goes to mollys cupcakes for dessert bet if you made desserts youd take away their customers just a suggestion. also plz make your own tortillas takes two seconds. Change the tacos the pork and the chicken are exactly the same or like everything has the same beef in it so the bimp n bop n ban mi aren't necessary / and plz update menu change things add different things like Nakji-bokkeumi (korean octopus)/ dubakki/Jopchae. Best things: tofu taco/ tofu hot pot/ kalbi poutine/ shrimp taco/ fish taco/ beef bento box <br><br>4/5 Tofu hot pot: it is really good picture like  a mapo tofu had a baby with a seafood soup there was a lot of seafood  but its really overcooked. Theres a lot of really silky tofu and there was beef too and it comes with rice wish it came with noodles instead. if u like mapo tofu youll love this only complaint needs more seafood n need more salt n does have consistency issues<br><br>0/5 Yukaejang (beef soup): this was gross. It wasnt flavorful and had no depth was a basic bland beef soup that needed salt n there werent a lot of veggies honestly just after one bite was like ya imma take it home which means into the garbage it will go lol<br><br>6/5 Kalbi poutine $9:99 (ask for a side of sesame chili aioli) best fries i ever had like it was so good wanted to order another one. Theres alot of beef and its really flavorful the fries are crispy with a really tasty spice on them theres a delicious sauce then theres sour cream as a cooling effect then theres pickled onions to cut through the richness i ordered  aioli for this cause i love mayo with fries (technically on everything ) and it made it taste even better but the lady made a big deal how i had to pay 25 cents in my mind i was like really i ordered the whole menu but her attitude will be talked about later. One complaint is for the price its a tiny portion<br><br>3/5 K town chicken wings $10:50 these were good like they were crispy sauce was good and they were big they had sesame seeds on them but they were really sweet needed some heat or complexity to counteract the sweetness <br><br>0/5 Spicy calamari stir fry $12:50 i didnt like this for one thing not that much calamari. I didnt like the flavor it just tasted kinda like kimchi when i was expecting something else like it wasnt flavorful was disappointed wish it was Nakji-bokkeumi instead <br><br>0/5 Pork and chicken taco they get the same review because its the same thing with a different protein wasnt that flavorful and was tough and dry<br><br>2/5 Bulgogi taco this was ok again it was dry but was better then the pork and chicken taco<br><br>4/5 Fish taco was crispy and not greasy the slaw was so flavorful really was a great taco my issue was the fish needed seasoning<br><br>5/5 shrimp taco amazing supper flavorful crunchy just put more shrimp in<br><br>6/5Blackened tofu taco: this was the best dish of the night it was so flavorful. Alot of people are scared of veggies even more so of tofu but they really add alot of seasoning to the tofu to make it taste really flavorful theres a succotash for texture then a delicious salsa verde really wanted to order another one<br><br>Bento box $13: delish. Salad was amazing adding freshness the rice has a sweet sauce on it just add more beef was flavorful just was tuff so wish it was cut into tinier pieces.<br><br>Kimchi: dont think its homemade looks like its star bought cause i saw the container it is good though", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SyuiJzD7jUVTVeMjbP1Gsw/348s.jpg", "caption": "Bill"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kTuZmEaU6l1HA5u6DBgl8w/168s.jpg", "caption": "Inside"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aXpttPIuNWqZGxbzmZ1CAQ/168s.jpg", "caption": "Inside"}]}}, {"review": {"des": "I was doubtful when I walked in this place. I saw that this place has a lot of good reviews and was a little shocked that It looks like a fast food store. But, when I had the first bite of the shrimp taco, I literally thought I made the best decision for the day. The shrimp is super tasty and flavorful and the taco is quite big. <br>The chicken wing is super good and pretty authentic as well.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bm_LISJO88zzBwxPBkw7zg/168s.jpg", "caption": "K - town Chicken Wings"}]}}, {"review": {"des": "Come here now!!! This place is insanely good. I got 2 shrimp tacos and was mind blown. The shrimp is cooked to perfection, the slaw is nice and crunchy, and the sauce...omg the sauce! So so good. The tacos are small and the tortillas aren't homemade, but ya know what, I don't even care! One of the best taco I've ever put in my mouth. If I lived close by, I would probably eat here weekly if not every day. <br><br>The staff were also friendly and efficient. We went around 3:30 PM on a Sunday afternoon, and they were still pretty packed. Obviously this place is well loved and for good reason.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/imo2lbQU68cZIVGTffCjGA/348s.jpg", "caption": "Best shrimp taco ever!!!"}]}}, {"review": {"des": "Great place for a quick bite. My favorite dishes are the bulgogi beef bento box and the wings. They're amazing every time. The sauce for the wings is so delicious. It's a sweet bbq sauce that I want to pour on everything. I wish I could buy it. You order at the counter here and the wait staff brings it out. Good for lunch or a casual bite to eat.", "pics": null}}, {"review": {"des": "Okay this place is seriously the bomb. It is inexpensive and AMAZING! I rarely eat this kind of food but wow it was good. I highly recommend ordering the wings and the fries that are loaded with lots of fun ingredients. The ambiance isn't great but this is the perfect spot for a quick, casual lunch of take out. The food is absolutely delicious -- don't sleep on this place!!", "pics": null}}, {"review": {"des": "This was high on my list of must-eats in Chicago, and I'd say it met most of my expectations. <br><br>The tacos were certainly the star. The shrimp taco had my eyes popping out of my head. The fish taco was also fantastic. I didn't get to try the fries, which I'm sure are good.<br><br>Wife and I split a Bibimbop bowl and were a little underwhelmed; it was good, just not as good as others I've had in the city. I'll definitely be back for the tacos.", "pics": null}}, {"review": {"des": "After nearly dying of heatstroke after trekking far along the beach for a taco place that is only open seasonally, I was in desperate need of sustenance. This place was a perfect find - I ordered the bibimbap, fished some carrot sticks out to feed my son and added the spicy sauce, mixing it around to break up the egg. Go slow with it, just a bit added more than enough kick for me! I got an iced tea with it and appreciated the friendly prompt service - it was a weekday just after 1 so it wasn't packed or anything. They had a high chair for my son too!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uLxHYVoABCR7J-QFR2qCBQ/168s.jpg", "caption": "Artwork inside"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mnuDRJNAblcZMorIf1hhDQ/168s.jpg", "caption": "Inside"}]}}, {"review": {"des": "Um lets just say incredible<br> The flavors are on point the chili shrimp bahn mi and taco are to die for. The pregnant gorl behind the front counter is such a sweetie", "pics": null}}, {"review": {"des": "Pretty solid choice for a quick bite, and the Korean/Mexican fusion idea is definitely interesting. My friend and I came in on a Thursday night, and it was packed. My friend got some tacos, and I got the bibimbop. We also got gamja fries to share. We had to wait a while for our food, and my friend's food came out a lot earlier than mine. The fries were big in portion and tasted great. The bibimbop was pretty standard, with a good amount of veggies on top but a super small egg. I personally would've preferred if it was less dry and provided with more sauce on the side for more spice.", "pics": null}}, {"review": {"des": "I've been here five or six times now, over about a two month time span. I am not at all sure why I like this place. More often than not, the line is almost out the door. The tables are entirely too crowded and close. The noise level is usually at obnoxious level. <br><br>However, the service is reasonably quick, once the order is placed. The workers seem brighter than one would usually find in this level of dining experience. This is NOT a chain restaurant. Some people confuse it with a chain called Del Taco. Not even close!<br><br>And now, the food .... holy mother of God. These tacos are incredible. I've tried several types, and I'd have to say the fish taco and the shrimp taco are Out. Of. This. World! I'm reluctant to share a five-star rating of a place with such good food, because it may only add to the length of the line here. (Tip: the long line can usually be avoided if you go between 2:00 and 4:00pm. Any other time, resign yourself to a considerable wait.)", "pics": null}}, {"review": {"des": "Korean, Asian, Mexican delight!  Order at the counter, find a seat, then the servers will bring you your food when hot out of the kitchen.  Can get busy at prime times, so go early.  Went in with a group of four of us.  Sampled many tasty items... delish!  Pictures I added tell it all...", "pics": null}}, {"review": {"des": "Wings are savory. The taco was good next time I should order more. Eager to explore other menu items.", "pics": null}}, {"review": {"des": "What a little gem located in Park West! One of my good friends suggested it after moving to his new place. The line moved quickly and the food came out in under 10 minutes I believe. They seem to be efficient and have high skill when it comes to a busy time. <br><br>I had the gamja fries and they were so crispy. They were perfectly seasoned and had aioli to go with! I also had the shrimp tacos. I highly recommend those too! If you're hungry, I would suggest 2 or 3 tacos. But if you want a side, maybe opt for 1 and share the side.  <br><br>Also I thought the prices were more than decent especially in the City. So you won't break the bank with some good food!", "pics": null}}, {"review": {"des": "This place is amazing the fusion between tacos and Korean food is amazing. Any types of the tacos are super delicious and tender. Even the kimchi fries are super delicious. I think I even had the dumplings. They have a different type of Bento boxes with different rice dishes as well. Over the past years they went from a small little restaurant in expanded to twice her size. By purchasing their next store. Parking here can be really tough so try to get there early but otherwise it was totally worth the wait and walk if you need to park is probably better on the north side of. Of Clark. I think over the time they have been recently try to experiment new fusions as well. I trust them as a restaurant and would try anything that they would offer on their menu", "pics": null}}, {"review": {"des": "Went here for lunch with my 2 year old baby girl and my wife. Just as we sat down to start eating all of our eyes started to burn and my daughter started to cry. I looked around and many other people were having the same experience. It felt like there was a chemical attack and people people were very nervous. About 10 people left. <br><br>I asked the owner what was going on and she said the kitchen was prepping food and there was nothing they could do. She said it was onions, but it felt like hot pepper spray. Then I asked if they could open a window or prep somewhere else and told her how badly it was affecting the customers. She could obviously hear and see the three different tables with small children crying. <br><br>She looked at me like I was from Mars. Even though it was obvious her eyes were also watering and she was affected by whatever they were doing in the kitchen. She said they have to prep food and that was it. <br><br>Unbelievable disrespectful experience. I cannot believe this was her response. They did not care about the customers who had already paid for their food and probably were happy people left. There were people waiting to eat outside and if we left, they could have the open tables. <br><br>We left our food. Never again.", "pics": null}}, {"review": {"des": "I've dined at Del Seoul more times than I can count, and it's nothing short of perfect. A vast menu riddled with out-of-this-world options that will leave you begging for more and more. The tacos come out with the snap of a finger, the dumplings and K wings take longer but they are WORTH the wait. Please trust me on this and get your ass over to Del Seoul today!", "pics": null}}, {"review": {"des": "I've been here a few times and it's one of the best Asian Fusion places I have had. Del Seoul has very high reviews and it's well worth it. The place is small and can get crowded during dinner time on weekends. Del Seoul has a casual atmosphere and has an average noise level. They have a small selection of beer and wine. <br><br>I have only had their tacos because I LOVE tacos and their Kimchi Fries. Not going to lie, but their tacos are pretty small. However, they are packed with flavor! I'm a bigger guy so I need at least three tacos to fill me up. Last time I went, I ordered two tacos and an order of Kimchi Fries and I was full. The Kimchi Fries are best when split between two people. I haven't had their bento boxes, but I've seen a lot of people order them.<br><br>Prices are fair for Chicago. Tacos are $3, which is right in line and are some of the best tacos in Chicago. They rank up there with Velvet Taco, Antique Taco, and Big & LIttles. If you're looking to try something new or are craving Asian Fusion, then Del Seoul is for you.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/no76PqEAw8v4pUGkvBQFYQ/168s.jpg", "caption": "Kimchi Fries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/D4ZTtFWTOogKZ6o6Dl8cXg/168s.jpg", "caption": "Kalbi Beef Taco and Shrimp Taco"}]}}, {"review": {"des": "A lot of my friends have raved about this place so I decided its about time to check it out myself. I love tacos and I love Korean food so I was excited to start eating. I ordered the kimchi fries and sesame chili shrimp and kalbi tacos. The kimchi fries were delicious, I couldn't stop eating them. The shrimp tacos were just okay, and my friend agreed. I think there was too much batter on them and it was just lacking flavor. The kalbi taco was so good, I'd definitely order that again. My friend enjoyed the spicy bbq chicken and fish tacos. We both agreed that the tacos were fairly good but probably not something we'd come back for.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MevUaru5RQDe3ykoFQWmTw/348s.jpg", "caption": "Kimchi Fries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kCD3saQs3mnpY2HE97-Vlw/168s.jpg", "caption": "Sambal Fish, Sesame - Chili Shrimp, and Spicy BBQ Chicken tacos"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vARf-dON73IWQ3u5CPrTRA/168s.jpg", "caption": "Sesame - Chili Shrimp and Kalbi tacos"}]}}, {"review": {"des": "I came to this place with pretty high expectations but left disappointed. <br><br>I got a fish taco, a pork taco and the shrimp taco. When the order came out, I was already disappointed because the size of the tacos are small, especially for the price I paid. The pork and shrimp are $3 each and fish was $4. The pork and shrimp came with a corn tortilla which I didn't care for because they were dry. The shrimp was deep fried and so you don't really taste the freshness of the shrimp. The pork was dry and needed some sauce. I like the fish one the most because it came in a flour tortilla and it was double the size of the other two. And the fish taste decent. <br><br>Overall, maybe I'm spoiled by Seattle tacos, but was definitely disappointed here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gyDXDo6MtzvukeyXkWiFBg/348s.jpg", "caption": "Pork and shrimp tacos"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_WTX8JUhCfBJItxrjB7a1w/168s.jpg", "caption": "Trio of tacos"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Fcv0h4S8Emu0FRLaRX0xFQ/168s.jpg", "caption": "Fish taco"}]}}, {"review": {"des": "Delicious place! <br><br>I wanted to try everything but finally settled on a fish taco, a  short rib taco, and a side of fries. All three items were amazing though if pressed to choose a favorite I would pick the fish taco. Between the sizable chunk of haddock and the spicy sauce, it was food heaven. The fries were okay but elevated by the sesame garlic aioli they were served with. <br><br>I will definitely be back and will try some new items! I thought the prices were reasonable and there was zero wait time at 4 pm on a Tuesday.", "pics": null}}, {"review": {"des": "Definitely a place to check out if you have not yet<br>Excellent flavours loaded into every bite of the tacos<br>Loved the kalbi and BBQ pork tacos<br><br>Succulent flavours with a hint of sweetness and fresh green crisp<br>Every bite left me craving for more<br>Outstanding service and a friendly staff<br>Ultimately, some of the best taco's in the area<br>Looking forward to stopping in again soon", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/J7dEsGDLBA95wQqUgF_KZg/348s.jpg", "caption": "Kalbi Taco on the left, Spicy BBQ Pork Taco on the right"}]}}, {"review": {"des": "K-town wings: lightly breaded, double-fried and coated in a sweet sticky sauce. Super yummy lollipops!<br><br>Pan-fried dumplings: half pork and vermicelli mix? I wouldn't reorder.<br><br>Seoul dumplings: steamed. meh.", "pics": null}}, {"review": {"des": "I don't eat at Del Seoul too often because to be quite honest I'm not a huge fan of Asian fusion food, but when my friends visit from out of town this is usually a request that someone makes. <br><br>My go to order is usually 3 tacos and typically I'll get the shrimp or fish tacos. I think these options are both pretty light and fresh and even though the fish and shrimp are fried, they never seem greasy to me. The slaw and the aioli balance it out perfectly. I'm also a fan of the kimchi fries but I would pass on the kalbi poutine and the k-town chicken wings. I thought that the poutine tasted confused and last time I had the wings the sauce was caramelized to the point of being burnt and they were ridiculously sticky and hard to eat. <br><br>This place gets S U P E R busy so try to come during off hours or just not on weekends in general. Service is typically pretty quick though so even if there's a crowd you probably won't take too long to find someplace to sit. <br><br>If you're looking for a quick cheap eat and something that is a little bit different, I'd recommend Del Seoul.", "pics": null}}, {"review": {"des": "My sister and I were excited to try some korean fusion food because we had liked it before so we found this place! We shared the k-town chicken wings and the kimchi fries and it was pretty filling! The chicken wings were full of flavor and also super crispy! The kimchi fries were good but they would be a lot better if the fries were more crispier. I really like the concept of this restaurant but I think if they had some Kpop in the background or something it would make the experience better.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TH8uRZ7HtEzUJzu8Jkjj8Q/168s.jpg", "caption": "Kimchi Fries"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PpvSaIhwfvPGE-u3UCzqtA/168s.jpg", "caption": "K-town Chicken Wings"}]}}, {"review": {"des": "There is a permanent line outside this little food joint, so it's good to have your order ready as the line moves fast.  They basically have a fee food categories:  dumplings, tacos, wings, and hot pots.  They serve beer and wine as well.  We ordered: <br>- dumplings<br>- shrimp and chicken tacos <br>- Korean wings<br>It was more than enough food for 2 and everything was just delicious!  Highly recommend!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aRX3AqQdzUMZ2nHOq_Z4qA/168s.jpg", "caption": "Korean wings"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ovN-AeyPg0dfhs4g2LA_uw/168s.jpg", "caption": "Steamed dumplings"}]}}, {"review": {"des": "This place is amazing. Made a last second decision to come here with my family and we all left happy, which is very rare. We got the K-Town chicken wings, Kimchi Fries, bibimbap, and tacos. Reminded me of spots in K-Town in Los Angeles. Affordable and great, quick, food. Go here!", "pics": null}}, {"review": {"des": "My last meal in Chicago was here. I came in around 12ish so it was lunch time and there were already a few  people there. The place is super casual. You order and pay at the counter before finding a table. <br><br>I ordered one Sesame-Chili Shrimp Taco, Kalbi Taco, Kimchi fries, and Spicy Tofu Hotpot.<br><br>The shrimps were battered and fried perfectly! They were crunchy and delicious! It was not overly battered. The marinated slaw they had on top was fresh and added another crunch factor. The Kalbi was also good but I think the shrimp was much better. The only thing I didn't like was the actual taco shells itself. I think it was a corn tortillas and I'm more used to the flour tortillas. It was too thick for me and I didn't like the graininess of it. <br><br>The BEST thing on the table was the Kimchi Fries! It was the reason why I wanted to come here since it was the first time I've seen someone tried to put kimchi on fries. It was so flavorful and the kimchi went well with the fries. I also like that they added in the toasted sesame seeds and green onions for some freshness. It's a must get if you come here. <br><br>The Spicy Tofu Soup was alright, wasn't the best soup I had. It comes with a bowl of rice and kimchi.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-6kwCvxE8G1_Ts0Idzr3zA/168s.jpg", "caption": "Shrimp & kalbi tacos"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nFC58zLy-X79VrYIYy3fKA/168s.jpg", "caption": "Spicy tofu soup- it was okay"}]}}, {"review": {"des": "Great value Korean fusion place with a decently sized menu! Tacos, banh mi, fried rice, dumplings...all the classics.<br><br>I'm normally not a super big fan of tacos, but I think Del Seoul does a pretty good job with theirs. They give you a decent amount of meat filling and it's seasoned really well--the Spicy BBQ Pork tacos are my favorite! I love the cilantro-onion relish topped with sesame seeds over the meat. I order about 3 tacos and they hit the spot! For around $10, I would say that's pretty good value.<br><br>I do recommend ordering an appetizer with your main as they have a really good selection. The last few times I've been here I've ordered their Seoul Street Dumplings and this has become my go-to whenever I come here. The dumpling skin is really thin and tender, and the filling is jam packed in with vermicelli, meat and veggies--the ratio of filling to skin is like 9:1! I've also been dying to try the kimchi fries and the kimchi poutine, but wish this place was a little closer to where I lived!", "pics": null}}, {"review": {"des": "Delicious Bahn Mi sandwiches. We got the bulgogi and shrimp bahn mi sandwiches and both tasted great. Service was fast and easy. Liked that they had a good selection of beer and wine. Perfect for fast casual dining.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cu37NDQYwr9v9EyATsqQZQ/348s.jpg", "caption": "Bulgogi Bahn Mi"}]}}, {"review": {"des": "Clean casual dining. All the food looks awesome. Wish I got to try more. I had the Bibimop / Hot Stone Bowl Bibimbop in the hot stone. Wow!", "pics": null}}, {"review": {"des": "My sister and I came here late one night. It was still pretty busy, but we walked right up to the counter and ordered a few different tacos and some fries. We found a table in the front corner near the window and shortly after our food was delivered to our table. We ordered a kalbi taco, spicy BBQ pork taco, a sambai fish taco, and the spicy BBQ chicken taco. We also ordered the gamja fries to share. The tacos are each about $3, but they come with a ton of meat on them. My personal favorite was the fish taco. it had a delicious flavor and spice to it while the fish did not taste too fishy. The gamja fries were also really good and the sauce on the side worked perfectly with them.<br><br>I will definitely be back to try the other tacos and dishes on the menu, plus the environment is really cool and the workers are wonderful.", "pics": null}}, {"review": {"des": "What's to write that hasn't already been written?<br><br>If you've never had korean food or flavors, this is a good place to start. From soups to tacos, you're set!", "pics": null}}, {"review": {"des": "I constantly crave this place. I am in love with their steak tacos and my fiancé says they have the best shrimp tacos in town.  I don't recommend delivery, just come to this small restaurant and have a quick bite!", "pics": null}}, {"review": {"des": "Really great food! Luckily we came when it wasn't busy because apparently there's always a line. We ordered what we thought wouldn't be a lot of food but had some to take home!<br><br>Fish tacos are amazing and I don't really like fish<br>Spicy pork and kalbi rib tacos were okay. I wouldn't order those again.<br>Bolgogi banh mi was really good!<br>We also ordered a kids meal and it was a good size portion our baby didn't finish it and had plenty to take home with us.<br>I really liked the fries and my husband said the kimchi was ok. <br><br>Overall great food for a great price. We only spent $30 for everything we ordered!", "pics": null}}, {"review": {"des": "Del Seoul is a fantastic place if you're looking for some good Korean food at a good price. You get a lot for your money and the food comes quickly--what more could you ask for?<br><br>I've been here quite a number of times and in addition to the chicken wings and sesame-chili shrimp tacos that I always order, from now on, I'll also be adding the tofu hotpot to my always-order list. It is a surprisingly rich tasting seafood stew, and you should definitely try it if you like seafood!<br><br>If I had to give a complaint, it would be that there aren't enough tables to seat the number of people that want to eat there. However, the turnaround time is pretty fast so you never need to wait that long.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jSEYgIwxA8F6pc5z3ii65g/348s.jpg", "caption": "K - town Chicken Wings: some seriously amazing chicken wings, definitely get them if you come"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/z7FdoZ0SmyMO6UNe_y3wUg/168s.jpg", "caption": "Spicy Tofu Hotpot: my favorite dish of the trip! It was a super rich seafood stew with lots of tofu (and it also isn't as spicy as it looks"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sZVHwmh49e3fbCRLejissQ/168s.jpg", "caption": "Seoul Style Street Dumplings: an okay option; it contained pork, rice noodles (?), and some vegetables"}]}}, {"review": {"des": "Lived up to my expectations 110%. AMAZING korean-fusion food and extremely affordable. My husband and I were wondering around the neighborhood on the way to a Cubs game when we had the fortunate experience of Yelping to stop for a quick lunch. Not knowing the area at all, this was the perfect find! It was right on the main street, Clark, nestled among some shops. When we arrived we could tell it was popular by how packed it was, but the line to order moved quickly and the food came within a few minutes, unbelievable!! We ordered the hot wings to share which were perfectly crunchy and tangy. The wings were huge! My husband got the bibimbop with the crunchy rice (worth the extra $1), which he loved. I got two tacos, one was the spicy shrimp and the other was the fish. Both were extremely delicious. Out of everything, my favorite was the fish taco--it was perfectly fried and crispy with the perfect amount of sauces and cabbage on top.  I would recommend Del Seoul to anyone in Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/phg5-IBLeCFtcGPt6TEi8Q/168s.jpg", "caption": "Amazing"}]}}, {"review": {"des": "The best Korean food I've had since moving to the area. <br><br>As you walk in, you wait in line to order then are handed a number that coordinates with an assigned table.<br><br>None of the food was spicy, which I was surprised about. However, every item we ordered was extremely flavorful. The wings were coated in a sticky sauce and were very filling. I would recommend the Seoul-style dumplings as you get more in an order and they are cooked to perfection. The kimchi fries were also perfect.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ksnjhHHZ0aj2wUs7hDp_Rw/348s.jpg", "caption": "Seoul style dumplings (8), K-Town chicken wings and kimchi fries. Incredible!"}]}}, {"review": {"des": "Wow talk about tacos and trust me I am Mexican and I can NOT cook Mexican food for nothing although I try but to me making tacos is very hard work specially warming up the tortillas without burning your fingers too much work.   I did LOved the tacos here at Del Seoul specially the fish taco wow that was the Bomb it was very well executed flavorful and full of taste.   We tried all the tacos one of my other favorite was the vegetarian taco it was so delicious who needs meat when the veggie taco was so scrumptious and delicious.   My most favorite thing was the short rib  fries wow trust me I have had fancy and very expensive fries but nothing compared to the deliciousness of this short rib fries with the crema the scallions and the pickle purple onions hmmm goodness very delicious.   The spicy tofu hot top was good too.  The bibimbop. I took it to go and had for supper I added cilantro and a little bit of oregano and lime it was very delicious.  A lot of meat and eggs and just the right amount of chili  spicy.   The bbq pro tacos were ok and the bbq chicken tacos were ok too but the least thing that I did NOT care for was the famous chicken wings spicy and very very sweet not I just tasted one and it was a total thumbs down  for me.  It was a nice presentAtion but the flavor was too strong pungent and too sweet.  Nope not ordering this again. Monk-town chicken wings for me.   I was going to give them 4 (quatro) stars because the service sucks here.   I had so much food left over we end up using 2 tables because they brought all the dishes at one one time instead of pacing it out or spacing at out.   I became over whelmed with all the traffic and specially with all the food on a tiny table.  We end up taking all the food home because I loved the fries so I was well satisfied.  I ask to take my food to go and I was hand it all the containers to go so it was a fiasco me trying to pour out the food because the HOT POT were TOO hot to handle so I had to stand up blocked traffic up and trust me the staff so me struggle doing this that one of the bigger ladies approach and whisper<br>To my ear that the tray behind me was for me to put the empty dishes.   Wow what a bad service please I spend over 100 dollars  someone could have help me so I made a few trips to the counter for more plastics bags to go.   Over all the food is fantastic negative the wings but the service deserves 1 (0ne)  star", "pics": null}}, {"review": {"des": "\"K-Style is the best style\"<br><br>One of my favorite Korean-Fusion restaurants. Meals are quite cheap considering how much comes in each dish. Definitely order the kimchi fries as the combination is unexpectedly amazing.", "pics": null}}, {"review": {"des": "I love the Lincoln neighborhood. It has a great selection of cafe, food and bars! Del Seoul is definitely one of the restaurants that makes this neighborhood popping.<br><br>Tried the children bulgolgi meal and the tacos today as we were quite full and simply wanted a taster. They were great value, beautiful in presentation and YUMMY! <br><br>Will definitely be back to try out more stuff! Their Kimchi fries, dumplings and chicken wings looks absolutely delicious!", "pics": null}}, {"review": {"des": "I'm clearly late to the game but better late than never.  4.5 stars with 1,800+ reviews means that I will keep this short and sweet.  Korean fusion tacos should just be a thing everywhere!  High remarks for the fish tacos and the vegetarian taco.  Spicy shrimp tacos and kalbi tacos come running at a close second.  If you have a good appetite, I'd get them all.  K-Town Chicken Wings are highly recommended as well.", "pics": null}}, {"review": {"des": "Order Kalbi and the shrimp tacos. I wouldve thought I would like the kalbi better base on popular demand. But I honestly believe the shrimp tacos win by a landslide. I would go here again and again just for the shrimp tacos. They are seriously <a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a>.  <br>Kalbi was alright. They were too chewy and didnt have that much flavor on the meat. But honestly anyone coming here needs to try 1 shrimp taco.", "pics": null}}, {"review": {"des": "Came here on a weeknight around 7 and the place was probably 80% full. Waited in a short line to order and sat down. Everyone was very friendly and the place was clean. My food came out after about 20 minutes and was very hot. I ordered the Seoul style dumplings because I wasn't too hungry and they were very good! I'll probably go back and get one of the more real entrees soon so I can experience their meat.", "pics": null}}, {"review": {"des": "The lollipop style wings here are top notch. They are doused in only a soy ginger glaze choice only, but really Del Seoul really knows what they are doing - is there a real need for 50 choices in sauce?<br><br>Picked up my phone order in only ten minutes flat yet it was still delicious. I ordered a Korean taco to accompany but the wings outshone it easily. <br><br>Key advice get the wings!", "pics": null}}, {"review": {"des": "You know a place is good when you can't wait to go back and try more items off the menu. Del Seoul offers a fun, casual atmosphere where you can indulge in a satisfying meal without breaking the bank. It's fusion food at its finest. Food comes out incredibly fast, especially when you order the tacos, which are a must. Their sesame chili shrimp tacos are absolutely the best thing ever if that's what you're in the the mood for. It's saucy, crunchy, savory, fatty and fresh all at once- a flavor bomb in your mouth. <br><br>I also tried their kalbi poutine. The toppings are excellent- the meat is tender and the cheese combination is unique. However, I'm not crazy about the consistency of the fries- they're a bit too thin and crispy for my liking in a poutine but some may find it perfect. <br><br>I wanted to have a more classic Korean dish and went with the spicy tofu hotpot, which they also do really well here. It tasted like any tofu soup you would get at an authentic Korean restaurant. Lastly you must order the lollipopped chicken wings- they are so fun to eat and are packed with flavor, the perfect deep fried finger food.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tOPdfbiywqwPXZ55g6KNgw/348s.jpg", "caption": "Shrimp taco"}]}}, {"review": {"des": "Awesome tacos! Go with the fish and shrimp and don't forget to get kimchi fries. One of our favorite meals in Chicago.", "pics": null}}, {"review": {"des": "It certainly wasn't bad per se, it just wasn't very good.  As a person who really really loves tacos mexicanos and korean food, my experience here didn't really give me the joy of either.  <br>I've tried the shrimp, pork, and the fish tacos here, and while they give you a huge chunk of fried fish...it's just not infused with korean flavor (the fried fish it similar to the texture of the fish filet at McDonalds or a walmart frozen filet...which I've eaten a million times at home). The shrimp and pork tacos were decent but had way too much lettuce imo, and I've had better at both seoul taco and this place called spoon kitchen in Champaign, Urbana. <br><br>Bulgogi dinner set was pretty average - pork came almost in rough slabs, were chewy and not marinated very well. Presentation of the dinner set was nice, however, but not something really worth 11+ dollars for lunch.<br><br>Perhaps because I've eaten korean fusion many times before, so I have a comparison, plus the fact that I just like the authentic version better...is why I give this place only 2 stars. <br>Iron age (in ATL) spoiled me, boys.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/H9XqyIS5yZBxL526xc1aeg/348s.jpg", "caption": "The dinner set pork"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/d8HpYiRi5MDmyUoazEki7w/168s.jpg", "caption": "Gotta say though-the bulgogi fries are pretty ingenuous...except they're $9 eep"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vN1pCSmOqSSoetPvfkhhMA/168s.jpg", "caption": "All types of their tacos"}]}}, {"review": {"des": "My friend took me here when I was visiting, and it was such a refreshing change from all that heavy, American style food I had at the highly Yelp rated, yet overhyped restaurants with hour plus long waits.<br><br>I got the kimchi fries (good for sharing) and the bulgogi banh mi and both were excellent. The fries were flavorful yet still crispy after being covered in a huge layer of toppings. Even though they're not the healthiest on the menu, they weren't greasy tasting at all! The sandwich was full of meat and veggies and portions were generous.<br><br>Minus one star for a mixup when they charged me. I didn't take a look at the receipt until after I sat down but the cashier accidentally charged me for a higher menu item than the sandwich I ordered. The staff (multiple employees) said sorry but it took a while for them to refund the difference and I thought they could have been a little bit more polite about it. It just seemed like they weren't really sorry or that it was my fault. <br><br>Regardless, this was definitely one of the highlight meals for my short weekend trip!", "pics": null}}, {"review": {"des": "the food was very good, and I loved their kimchi fries. it's your good food low overhead kind of restaurant. the staff is very nice and super helpful. He gave us a quick instruction on how to eat our bibimbap. I already had bibimbap, however, I found his quick instruction very interesting and helpful.<br>Their kimchi was so good, that I wanted to get a jar to take home.<br>Kimchi fries were phenomenal, and I loved it so much that it made sad not being able to finish it.<br>Bibimbap ingredient was fresh and it was prepared to perfection.<br>I highly recommend this place, especially if you haven't had Korean food before.<br>We had fried wontons as well. as they are not my favorite I usually don't order them, however, theirs was so good that I even liked them.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IeyDbNgQg0NE0esZZmFNuw/348s.jpg", "caption": "I like my egg a little more runny, still very delicious though!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/25fr8T0cudiu3TNyLCKbXQ/168s.jpg", "caption": "Kimchi fries, sooooo gooood!"}]}}, {"review": {"des": "Shrimp and Kalbi Tacos still the best - had the fish taco above average. Had the spicy chicken,  good but not amazing. The salad that came was very tasty sweet and refreshing. The chicken was just good. Why five stars still cause of the Shrimp and Kalbi Tacos and the Seafood Hotpot. Those are simply the best.", "pics": null}}, {"review": {"des": "This is one of my favorite restaurants in Chicago! The Korean/Mexican combinations are thoughtful and tasty, the prices are fair, and the service is fast - what's not to like?<br><br>On our visit, we ordered the following - Sesame Chili Shrimp, Sambal Fish, and Kalbi BBQ Tacos along with a K-town chicken wings appetizer. Everything was about $22 after tax which was a great price for the amount of food. <br><br>Here's the process: you wait in line to order, you get assigned a table (if you're dining in), and they then bring the food right to you. When I arrived, there was a line almost out the door but I was able to order, pay, and get my food within 20 minutes.<br><br>The food was amazing! Of the tacos, the Shrimp was the standout. It was filled with crispy shrimp in a tangy, spicy sauce - it was an awesome combination. The kalbi was very good too with a great, smoky flavor (lots of meat). The fish was good, but a little more normal, as it tasted more like a normal fried fish taco (but with a huge portion of fish!). The tacos are not very big but are filled with meat/seafood and are a good value for $3/$4 each.<br><br>The reason for the 5 stars are the Chicken Wings. They. Were. So. Good! You get 8 wings for $10.50. They are actually all drumsticks and a decent size (but not huge like Crisp (if you're wondering, I like these wings better than Crisp)). They come on a plate and are absolutely soaked in this delicious soy garlic sauce. It's slightly spicy so be careful! I couldn't stop eating these things! They are moist and flavorful and the sauce had me licking my fingers.<br><br>Overall - the food here is very flavorful and comes at a good value. I would definitely check it out!", "pics": null}}, {"review": {"des": "Del Seoul, a Korean street food fusion restaurant, is absolutely worth the trip out to Lincoln Park. I highly recommend splitting the Kalbi poutine with friends. Fries with short rib, crema and cheese and pickled red onions made in house?? Yes please. Order a few tacos each, and you'll be set.<br><br>The spicy BBQ pork taco is particularly rewarding, but I've also heard great things about the shrimp and fish tacos as well. The K-town chicken wings are intricately prepared - 'lollipopped' and cooked in a soy sauce, chili and garlic glaze - but a bit pricey. The kimchi fries sound great in theory - fries topped with kimchi, pork belly, melted cheese and sour cream - but something was off about the overall balance of flavors, and we found ourselves not enjoying it as much as we thought we would.<br><br>Most of the tacos come with an ample amount of 'secret slaw', cilantro and onion relish and a sprinkle of sesame seeds. The next time I go back - there WILL be a next time - I'm excited to try a banh mi sandwich, to see how Del Seoul does Korean-Vietnamese fusion.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rOc3nPljSW3trNbCGP29LQ/348s.jpg", "caption": "Kalbi poutine"}]}}, {"review": {"des": "Affordable place. The dumplings were not very good in my opinion. The fried chicken was okay, would rather go to Crisp for fried chicken. And their shrimp tacos were fine. This place would be great after a night out but on a regular day, I wouldn't be all over it.", "pics": null}}, {"review": {"des": "My Lincoln Park Korean soul food. Any time I'm having a meh day, cold, hungry or who am I kidding, really in any mood, this is my spot. I love coming here to have the Kimchi fried rice. It's the perfect amount of spicy! Beware if you don't have a tolerance for it. It comes out fairly quickly and piping hot. I usually burn my tongue the entire time, but that's my thing. Piping hot food and I get along very well.<br>I have also had all of their tacos and recommend them all. I was surprised by how great their wings are as well. Any time I have ever had a visitor, I bring them here and they are never disappointed.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FnTHjE-qWhdN1859eF_0nA/168s.jpg", "caption": "Kimchi fried rice!"}]}}, {"review": {"des": "(Review from 5/24/2017)<br>Went to this fine establishment before a cubs game which we were already running late to, But this has got to be one of my favorite Asian Fusion places ever. The vibe here is very laid back and the workers are extremely nice, we started with the K-Town Chicken Wings which were super tasty and had lots of flavor and then moved on to the Kalbi Tacos which were to die for, everything here was really delicious even when eating it all super quick in order to get to the game on time, Can't wait to come back here when I visit Chicago again!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xWoHErA8Wyt0JTZjwPrh8g/348s.jpg", "caption": "Kalbi Tacos"}]}}, {"review": {"des": "This is a great Korean fusion place. Makes me proud :') <br><br>It's also a *great* value. You get to choose your mix of tacos, and they come out so fast! It's really rather impressive how fast it is, but even more so because it's good. <br><br>But I actually enjoyed the bento box more. Think Korean food in Japanese bento style. You get your share of carb, protein, and veggie with a box of rice, a box of meat, and a box of salad. The galbi flavor was authentic. The portion is also very generous. <br><br>I'll drop by every time I swing by the area!", "pics": null}}, {"review": {"des": "This place gets one star because they don't have a changing table in any of their bathrooms. This is unacceptable, and I encourage others to similarly rate them for this careless act. <br><br>I'll update this review if/when they get a changing table.", "pics": null}}, {"review": {"des": "The owner of this place should be very proud. The food was delicious and the food came very quickly.<br><br>We tried the Kalbi, BBQ pork, Sesame chili shrimp, and BBQ chicken tacos and we couldn't have enough of them!<br><br>They were well seasoned, and a good amount of meat. If you're visiting Chicago, don't skip this place!!!", "pics": null}}, {"review": {"des": "This place is EPIC. We tried almost every taco on the menu all of them were great. Kimchi fries were different than anything I have tried. K town Wings were amazing, and so were the dumplings.<br><br>If I were to go back I would stick to the tacos and the K town wings.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2K17a09GfNablKkmjgb6xw/348s.jpg", "caption": "K - town Chicken Wings"}]}}, {"review": {"des": "I probably won't come back to this restaurant.  I ordered the chicken wings, which the lady told me were pretty good.<br><br>The taste was ok but the sauce was crazy super sticky and thick. It was like eating a spoonful of molasses. Also, not sure what it was, but when I finished eating, not even 10 mins after... My stomach wasn't doing great. It was the only thing I ate that day and spent most hours of that day and the next in the rest room.", "pics": null}}, {"review": {"des": "I've been here a handful of times and today I decided to not go with the usual taco order although very good I wanted to try something different.  So I decided to get the kimchi fries which were very good!  They're pretty much loaded fries with bits of kimchi instead of the traditional chunks you normally see it in.  Only thing was there was a bit too much green onions.<br><br>I also got the Korean BBQ wings which were surprisingly really good too!  I'm surprised that there's not more hype on these wings.  <br><br>My boyfriend got the yokayjang which was good, but it ONLY had three small pieces of beef in a huge bowl of broth and noodles.<br><br>Overall very good, however, because I have been here before it expanded, they need to come up with a better service process.  They are making it to be more of a sit down place compared to when they first started it was pretty much order, eat and go.  Now you order and it's super busy for the most part, and the tables are so small, but they have larger dishes.  And yes you don't order at the table, but the clean up for the customers is a bit much considering how small the space is, the amount of people, and the trash and dirty dishes is on one small corner of the restaurant.", "pics": null}}, {"review": {"des": "Delicious. Affordable. Fast.<br><br>This place is a delight as a date spot or as a quick dinner out. The food is definitely comfort food and accessible to most people - if you don't know what something is, the staff is super helpful providing guidance.", "pics": null}}, {"review": {"des": "Del Seoul has some fantastic Korean & Korean-fusion food in Lakeview. Since Takos Koreanos closed, the wife & I have been looking for a replacement and with DS we have found it. The hot stone option for bibimbap is a great addition (and easily worth the +$1 from the regular) to the menu, and the fresh veggies & fried egg are always a top pick. Some of the best pan-fried dumplings you'll find, and the tacos are a great choice as well! <br><br>Would highly recommend for anyone looking to enjoy something unique, or a quick Korean fix.", "pics": null}}, {"review": {"des": "Final had the chance to check this establishment out. Service was great, but the business of asking for tips is kinda annoying as they bring the food out to your table while you clear your own table. Orders the streamed dumpling, stone rice, and three tacos. The flavors were quite authentic to korean food (whether tacos are not korean, the kalbi was very flavorful).  Streamed dumplings were great as well.  Finally, pricing is reasonable for korean fusion food. Definitely well revisit.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Dest2hCP8LJPJhuTWaGoBA/348s.jpg", "caption": "Streamed kimchi dumplings"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XJzObVVRRkwd6DPSETNufw/168s.jpg", "caption": "Flavorful bimbibop with the stone bowl for an extra dollar."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RJY3LDIFrY8KhU2yD_Tfqg/168s.jpg", "caption": "Fried fish, chili lime shrimp, and kalbi tacos. Good prices and delicious."}]}}, {"review": {"des": "It can be busy or not busy. Timing matters a lot here. When my friend and I arrived, there's barely any customers in store. When we sat down, a long line appeared out of nowhere like a flash mob​. <br>Kalbi taco tastes pretty good. Everything else? You can find better substitute​s somewhere else.", "pics": null}}, {"review": {"des": "Korean Asian Fusion for not expensive?! Love it. Love even more the order, pay, sit, have your food brought out to you. <br><br>I ordered the:<br>Shrimp taco ($2.99)<br>Kalbi Taco ($2.99)<br>Seasoned Fries ($2.25)<br><br>Everything was pretty much delicious. I inhaled those fries (definitely enough for just 1 person.. sharing it would have left me wanting more)<br><br>The only thing I didn't love was my taco came out literally like 2 minutes after I ordered it. That kinda just indicated to me that they had all the ingredients lying around and they slapped it on. Touching my Kalbi pieces, it was pretty much room temperature.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/h7gIkj8Xdv61E8YCVgCOag/348s.jpg", "caption": "Menu June 2017"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/R4l0oLiVD7UyMP3HLA8WPQ/168s.jpg", "caption": "Seasoned fries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fvKGgSxl6_P0uDcn-IW5-w/168s.jpg", "caption": "Shrimp and Kalbi taco"}]}}, {"review": {"des": "The best Korean tacos! <br><br>This is such a great place and has a really good selection of tacos. A decent size seating area but always is busy!  This is one of my favorite places for tacos in IL!<br><br>Staff is friendly and the place is clean. It gets busy so you may have to wait to get seating.", "pics": null}}, {"review": {"des": "My friend first took me to Del Seoul two months ago and I have now been there seven times. This place is seriously amazing.<br><br>I am a big fan of the tacos. In fact, they are all I have ever ordered there. I have tried the spicy pork, the spicy chicken, the fish and the shrimp. I am not sure I can pick a favorite, so I would recommend trying them all (not even kidding.) ALSO, get the Gamja Fries. Their fries are the thin crispy kind and I swear I cannot stop shoving them in my face until they're gone. For me, two tacos and an order of gamja fries are all i need for a solid meal. Or, split the fries with someone and get more tacos!<br><br>I know a lot of people like their wings and bento boxes. I've been wanting to try their bento boxes, but I can't resist the tacos!<br><br>The restaurant is usually pretty full so it can get pretty noisy but it's worth it for the food. The food rolls out pretty quickly so if you're starving, you'll get your food in a timely manner. <br><br>I don't know what else to say but I love this place. It is delicious and all I need in my life. Actually, I'm craving it right now.", "pics": null}}, {"review": {"des": "decent k food, good to meet a group. service is ok. average korean fast food with a twist.", "pics": null}}, {"review": {"des": "I love this place! Del Seoul serves delicious Korean street food with a Californian/southwestern twist. Whether you're looking for a very filling lunch or a quick taco as a snack, Del Seoul will not disappoint. There are a great variety of Korean tacos, Banh Mi sandwiches, appetites, dishes to share, entrees, etc. <br><br>I ordered the Hot Stone Bowl Bibimbop, which was the type of dish that stimulates all the senses -- first, you hear the dish sizzling as it's served to you and then you see the beautiful arrangement of the veggies, beef, and perfectly cooked egg on top. The smell of all the ingredients blended together was incredible, the texture of each of the ingredients complimented each other very well (chewy beef with crunchy veggies, fluffy rice, etc.), and, of course, it tasted amazing.<br><br>I very highly recommend you try this place!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/czU5Jzhen6MHxPswn4gF3A/348s.jpg", "caption": "Hot Stone Bowl Bibimbop"}]}}, {"review": {"des": "I'm from Korea and have been living in the US for almost 3 years now. Maybe, I haven't tried nice korean restaurants enough so far in the US, but many times, the food at the korean restaurants tasted a little different from the good restaurants in korea.<br>However today, I had Spicy Tofu Hotpot() in Del Seoul and it made me feel like eating at a nice traditional restaurant in Korea. <br>I really recommend this restaurant to any koreans who miss real good   or anybody who wants to taste nice fusion korean food. <br> My husband(American) ordered Bulgogi Bento and pan fried dumplings. He really loved the foods too. He normally doesn't like korean spicy soup that much , so if anybody who is not familiar with spicy soup with rice ,Galbi or Bulgogi meals would be great choice for starting to enjoy korean foods.", "pics": null}}, {"review": {"des": "How can you possibly go wrong with Del Seoul? My family and I have been coming here for years and it never occurred to me that I never got to write a review. Let me start by saying this: Del Seoul is and will continue to be one of Chicago's greatest restaurants.<br><br>Their food is just a god send. From the bulgogi poutine to the shrimp tacos (which are my two favorites here), they really can't be beat by any other fusion. Many have tried to hit that sweet spot in the harmony of fusion foods, but only Del Seoul is consistent in nailing it. It's incredible.<br><br>Try all their tacos: shrimp, fish, bulgogi are the best. Don't leave without their bulgogi poutine. Thier korean chicken wings are also pretty damn amazing. <br><br>It does, however, get very crowded during peak hours. Don't worry though! Tables move quick and are generally not as big of a hassle as it may seem.", "pics": null}}, {"review": {"des": "I LOVE tacos... it's up there next to sushi for me.  It was only a matter of time before I'd get to try this place and I love the asian fusion twist that was made on the tacos here.<br><br>I came here on a Wednesday at around 8pm with a date and we had to wait about 5-7 mins to make our order for dine in.  Tables were pretty full, but luckily a group had finished so we were able to snatch the table.<br><br>The guy at the register taking orders was welcoming and kind.  I ordered the kinchi fries (we shared this), sesame chili shrimp taco, kalbi taco, spicy bbq pork taco, and spicy bbq chicken taco.<br><br>The kimchi fries are french fries topped with sauteed kimchi, onions, pork belly, scallions, melted cheddar and jack cheese, and sour cream.  This was a very rich entree that is perfect for sharing with someone.  Surprisingly it wasn't overly greasy and I heavily recommend mixing it all together so the ingredients get on all the fries, not just the ones on top.  Helpful tip: use a fork... it can get messy.  Anyways, the mixture of flavors from the cheese to the rich fat of pork belly to the mild pickling flavor from kimchi made this decadent.<br><br>As for the tacos, I enjoyed all 4 of my flavors, but I enjoyed the kalbi taco and sesami chili shrimp taco the most.  Don't dilly dally eating your tacos by the way because the tacos shells will toughen up a little.  Honestly, with the tacos being so good, I can't imagine how it would last long enough for that to happen (it happened a bit to me because I was overly talkative this day).  <br><br>Kalbi is just such a go-to meat when you think of the korean culture and the flavoring of sweet and rich goes well in the taco.  <br><br>The shrimp was so good due to the sesami chili aioli and especially the panko breading on the shrimp... I loved the crispiness so much.<br><br>As much as I prefer authentic mexican tacos over all tacos, Del Seoul's asian twist on tacos is so delicious that I'll be back.  I also want to try the kalbi poutine next time I'm here.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MzIdCGYtZypoQKpiYybvlQ/168s.jpg", "caption": "Tacos: sesame-chili shrimp, kalbi, spicy BBQ pork, spicy BBQ chicken"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CjBtXivelWYWcpogBcHJvw/168s.jpg", "caption": "Kimchi fries"}]}}, {"review": {"des": "Delicious, unique, and super cheap! I live right in the area and this was my first time going after moving into the neighborhood... thank God!!! I am obsessed with their tacos! I asked the cashier what were the 3 most popular tacos they have and she recommended the shrimp, kalbi beef, and fish - I ordered all three of them. My boyfriend ordered the kalbi beef banh mi and gambja fries. Now let me tell you... all of it was amazing!! The shrimp and beef tacos were both garnished with the same toppings while the fish had a type of slaw. The shrimp was easily my favorite, so fresh 5/5. Second comes the beef which had the sweetness of kalbi that I love 5/5. Last was the fish which was great 4/5, but the shrimp and kalbi definitely overcame the fish taco in terms of flavors, textures, and all. Even better, they are generous with the servings and these tacos are big! Three is definitely the cap for me. <br><br>The kalbi banh mi 3/5 my boyfriend had was pretty good, although the taco is much more preferred for me. I'm not a huge fan of banh mis since they're often served on a hard bun, but my boyfriend liked it. The gambja fries are their spicy fries served with a type of mayo sauce, which was soooo good 4.5/5. The only thing is I wish they gave more mayo sauce since they give a lot of fries. Nonetheless, I would definitely recommend this place to a friend.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2P7PsmEokssPQzHewFzlRw/168s.jpg", "caption": "Gambja Seasoned Gamja Fries"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vI-TepQPKRsN6hDzYONbfQ/168s.jpg", "caption": "Kalbi banh mi. Shrimp, kalbi beef, fish tacos."}]}}, {"review": {"des": "While visiting the area for the weekend, I had to have lunch here twice! It is just this good and prices are fair. I just couldn't believe how much seafood i had in my sundubu stew: fresh oysters, clams, shrimp, squid, you name it. I love how it comes bubbly in a hot dolsot. The perfect meal even in a hot summer day, can't even just imagine having this in a winter night. Kalbi tacos were delicious as well. I even brought some kimchi back home to AZ.<br><br>Service was good and it was nice how they assign you a table even though you order at the counter. Whether you want some authentic Korean food or some fusion dishes, you have gotten it all at Del Seoul. Can't wait to come back to Chicago and for sure my first food stop will be here!", "pics": null}}, {"review": {"des": "Delicious. Try the Bulgogi banh mi and the Korean Street style dumplings, or the fish tacos. Not fancy, just tasty. Go there!", "pics": null}}, {"review": {"des": "I have to say, I was a little apprehensive of the idea of Korean BBQ fusion, especially in a neighborhood like Lincoln Park, but I was pleasantly surprised! <br><br>The ordering experience is kind of funky because they seat you and then when you're ready, you come back up to order. The menu is pretty small, but that really just gives them more time to hone in and focus on what they know (if you're a vegetarian, the options are even more limited, although, I didn't ask if they do any substitutions).<br><br>I ordered the fish taco and the blackened tofu taco, and the party I was with ordered the kimchi fries to share. The tacos came out within minutes of ordering, and I was impressed by the quality of the food for how fast it all was. The tofu taco had a tomato and corn succotash, edamame, and a subtle salsa that really blended all of the flavors well together. The haddock on the fish taco truly was as crispy as they advertised, and the pickled onions and slaw was a nice earthy and salty compliment to the fish. The portions were substantial enough, and as per usual, I was able to divide each taco into two smaller tacos with the two tortillas they provided.<br><br>The kimchi fries ordered were really something else. The seasoning really made the fries much more savory in addition to the sour cream, kimchi, and scallions. Even without tasting the fries, I could tell that they would be great from the aroma it exuded. <br><br>Del Seoul is a funky hip spot!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FdRYeWQvIAF7AmusIyIZRg/348s.jpg", "caption": "the Sambai Fish Taco!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dwZ0Z8wwdJXEd0KroInikA/168s.jpg", "caption": "Blackened Tofu Taco"}]}}, {"review": {"des": "Del Seoul is always busy, so when I saw there was no line, (5/8/17 a Monday at 3pm) I came in and ordered food for dine-in and take-away. The staff was friendly and kindly answered all of my questions regarding Korean street BBQ....and I had a lot. <br><br>The menu has notes for what's popular and also what takes the most time to make, which is great if the customer is not sure what to order or is on a time constraint. I was given the number '21' which I saw as a good sign because my Birthday is on the 21st, so I waited patiently for my goodies.<br><br>While waiting, I ate the Kimchi Fried Rice and was blown away: the spicy mixture of fried rice, spam, kimchi, crispy bacon, scallions, and a fried egg, was served in a hot stone pot and remained hot and crackling for over twenty-five minutes!! The rice was crispy, crunchy, seasoned perfectly, getting tastier with each passing bite. The portion size was Huge so I ended up taking over half of it home. <br><br>My to-go order consisted of the following:<br><br>One Sesame Chili Shrimp taco overflowing with hand-battered panko shrimp, sesame-chili aioli, 'secret slaw', cilantro/onion relish, and toasted sesame seeds. The shrimp were fresh, plump, and not at all greasy, allowing the zest of the chili to stand out and take over.<br><br>One Spicy BBQ Pork taco loaded with tangy grilled pork, 'secret slaw', cilantro/onion relish, and toasted sesame seeds. This taco was seasoned well, but the pork was cut into strips and kept falling out of the taco, so it was a hard for me to eat.<br><br>One Spicy BBQ Chicken taco filled with spicy grilled chicken, 'secret slaw', cilantro/onion relish, and toasted sesame seeds. The chicken was juicy, tender, and cut into little chunks making each bite equal to the previous one.<br><br>All tacos are wrapped in double soft corn tortilla shells which I appreciate because the seasoning and juices are so tasty, they overflow but don't break the shell and leave a mess on the plate (or your clothes).<br><br>The Kalbi Poutine pairs the Québec and Korean classics for a De-Lightful snack that I took with me on a walk after I returned home.  The crisp french fries were topped with amazingly simmered braised shredded short rib and topped with a beef demi gravy, cheese, crema, scallions and pickled red onions. This flavor combination has warmed my heart and this dish has gladly taken the place of nachos for me.<br><br>I haven't had wings in over three years, but I decided to try the K-Town chicken wings after seeing a few platters on nearby tables. These sizeable wings had a wonderful color and crunch due to the sweet soy, chili and garlic glaze; I ordered two portions because I knew my friend would finish an order by himself (which he did). I also loved how they were cut 'lollipop' style for a cleaner bite. <br><br>I'm always on the lookout for a fantastic dumpling, and I found some in the Seoul Style Street Dumplings. These steamed handmade dumplings were were large and in charge - the flavors in the *100 year-old recipe* meat are amazing and I didn't feel the need to use the Sake-Soy Dipping Sauce at all.<br><br>This was my first venture into Korean street food and I Loved It! I was so engrossed in what I was smelling and eating that I knew I had found a local favorite :)<br><br>---------<br>5/22/17<br><br>Two weeks after my first visit, I came in again....and again I was WOWED with the food and service with a smile. <br><br>I dined-in this time, ordering a few of my new-found favorites, including the *Kimchi Fried Rice*, Seoul Style Street Dumplings, and a Spicy BBQ Chicken taco, and was pleased to find the food was equally consistent in flavor and portion profiles to my last visit. <br><br>This review focuses on the new items I have been thinking about since lunch today...and boy, did I make the right choices!!<br><br>I started with the Bulgogi Bento Box consisting of flatiron steak w/ soy marinade, rice, and a salad with ginger dressing. I don't eat steak very often but this cut and marinade was tender and perfectly seasoned. The rice and side salad are evenly portioned as well.<br><br>Next up was the Spicy Chicken Bulgogi that came with the disclaimer to \"Please allow 15 minutes for preparation\". I didn't even realize the time gone by, and when the spicy grilled chicken dish arrived, I was ready to dive in! The Korean red pepper marinade is outstanding and I made sure to get a little chicken, wasabi-onion, spicy cucumber salad and steamed rice in every mouthful. It was sweet, spicy, and divine.<br><br>My favorite was the Spicy Tofu Hotpot with beef, seafood, and tofu in a spicy chili broth. The hotpot was brought out boiling and this dish was savory, spicy, and savory. Yes- two 'savories'. All the seafood was distinctly delicious (mussels, clams, shrimp & oysters), and the egg, onions, and zucchini mixed with the side of rice thickened up nicely. I know where I'm going for a hotpot in the dead of winter!  The kimchi is spectacular as well.<br><br>I have the next two days off from work and lots of yummy leftovers to keep me happy!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zQ0dAmNCdaQJH_mkXh9hkw/348s.jpg", "caption": "The Bulgogi Bahn Mi"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Qk9JX92yeuCQTOGNDAm26A/168s.jpg", "caption": "Favorite Kimchi fried rice (to-go)"}]}}, {"review": {"des": "And so it occurred that on a Sunday, after a crazy, liquor infused Saturday night, the taco lords whispered in my friends ear - \"feed her tacos. KOREAN tacos.\" So we went and immediately upon walking in to the medium sized establishment, I was greeted by old school tunes playing; everyone ranging from Stevie Wonder to The Dells. Who's Pandora playlist was that?!? Awesome!<br><br>For food we ordered shrimp, chicken and fish tacos with the kimchi fries to go along with it. I was in love. Every Taco had their \"secret slaw\" on it and I'm feeling like Plankton from Spongebob who goes nothing but risk his life for the krabby patty recipe. That stuff is DUHlicious!!!! The kimchi fries... cmon - kimchi + fries. Nuff said. I was so busy inhaling my food that I didn't even notice that I hadn't taken pics. EEK!!! Next time.", "pics": null}}, {"review": {"des": "Atmosphere: Fast casual. Gets busy fast<br>Food: 5/5<br>Service: order at the counter<br><br>I have had this place bookmarked for months and I'm so glad that I was finally able to go. Heads up for people that grab seats as soon as they walk in, these workers will kick you out! They get busy fast and so they assign you a table when working and they'll only seat full parties.<br><br>I was in a particularly feasting mood and so I ordered three tacos (shrimp, kalbi and spicy bbq pork) and split kimchi fries with a friend. The tacos were about $3-4 which sounds expensive but this is finer quality meat than your average run of the mill tacos. Plus they're seasoning is dynamite! I really liked the shrimp (had a sesame chili aioli with battered shrimp) and the kalbi wasn't bad. The spicy bbq pork really didn't leave much of an impression and it definitely wasn't spicy. The kimchi fries were sooo good! It actually had pieces of kimchi instead of \"kimchi seasoning\". The best part? Melted cheese on top.<br><br>Overall: This was a really good fast casual, fusion restaurant in the area (what a mouthful!). Seating might be a little frustrating but the food is super tasty. Also, we weren't sure if we had to clear our own plates or if they did? I think we were under the consensus we had to clear it... Would definitely come again if I'm in the area!", "pics": null}}, {"review": {"des": "Highly recommend the shrimp and fish tacos! Perfect crisp and batter to meat ratio. Their kalbi tacos are okay, too. <br><br>Their kimchi fries are the best I've ever had!", "pics": null}}, {"review": {"des": "Five stars for the tacos! The sesame-chili shrimp and kalbi tacos were two of the best things I ate when I was in Chicago for five weeks. They were both perfectly flavored and so juicy! My mouth is watering as I'm thinking about them. Yum! I highly recommend going here and getting these two tacos. I'd also love to try more of the different tacos!<br><br>I'd skip the kimchi fries. I thought that they were a bit too salty for my taste and nothing really spectacular. The cashier who took my order said that his favorite item on the menu is the chicken wings. I also saw that a lot of people were eating bibimbap. I'll give those a try next time!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nHhL-XMghQxh4_vfbMnxhg/168s.jpg", "caption": "Kalbi taco and shrimp taco"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DTsIb3XvX_KQta3R_HwwlA/168s.jpg", "caption": "Kimchi fries"}]}}, {"review": {"des": "I just went here for the second time just a few days ago, so I gotta give Del Seoul some praise! First of all, I'm amazed by how ~not~ pricey this place is, because you can get a very hearty meal here and not be afraid to look at your bank account afterward. Del Seoul also has a fantastic beer/cider selection, and if you get takeout, they'll package up your lil' drink for you as well -- ALCOHOL ON-THE-GO! Who doesn't want that? If you're a first-timer I'd suggest any of their tacos or a bibimbap bowl, because you'll be full and they do such a fantastic job cooking everything. Also, use the sauce that comes with the bibimbap bowl, you won't be disappointed, folks!", "pics": null}}, {"review": {"des": "Went here on a whim after moving to the neighborhood and it was good, but not great. I had heard rave reviews so I decided to finally give it a try. I ordered the kalbi poutine and the chicken taco. Taco was delish and loaded with meat! Also love that they serve it on corn tortillas. <br><br>The poutine, however, tasted nothing like what I expected. It looked amazing and parts of it were good but the meat was too sweet and the cheese did not go with the rest of the ingredients in my opinion - too much like sour cream, which I cannot stand. However I do think these are my tastes and it is probably objectively very good! I did enjoy the pieces of the poutine I could eat before the cheese got in the way.<br><br>Service was speedy and they were very nice considering I was on my phone when I ordered. Overall I would definitely come back, but skip the poutine.", "pics": null}}]}