{"name": "delilahs-chicago", "reviews": [{"review": {"des": "I have been to Delilah's twice now, once as a patron and once with a private party. As patrons, my wife and I, had a lovely time. The bartender paid the right amount of attention to us and gave us suggestions for what to drink. The bar itself looks great, and isn't slammed on weeknights, but Friday and Saturday night, it can get a little busy, however, that's to be expected. <br><br>When my wife  and I rented out the room upstairs for our wedding reception, the staff, Mary, Mike, Zack, and Christine, went above and beyond to accommodate both our guests, food, and anything else that popped up. <br><br>I can't recommend this  place enough, it is a perfect spot to chill and have a few drinks, listen to some good music, or have a party. I will be going back and promoting it as much as possible. <br><br>Thank you Delilah's for doing everything you did and making it an unforgettable experience.", "pics": null}}, {"review": {"des": "From the outside and even from glancing around once you enter Delilah's, this looks like a small dive bar.  However, go through to the back and you will see a shrine to the King (Elvis) himself with a small seating area.<br><br>They have 666 different whiskey offering, yes, 666 different ones.  I think it's safe to say that whiskey is king here.  They also carry more than 1000 beer and spirit options and host regular art openings, film screenings & beer tastings.<br><br>There is art from local artists as well as beer memorabilia covering the walls on the first floor, but the best part is the upstairs, from art deco walls and ceilings, a pool table and a second bar in the corner, <br><br>There is a different theme each month, so your experience could be different every time you come here.  You can hear punk rock, metal, roots and rockabilly, interpretive R&B or rock 'n' roll on a given weeknight.  <br><br>Is it a whiskey bar, an art gallery, a place for free cinema, a beer memorabilia collection or just a really cool looking bar to hang out in?  It's all of these and more!", "pics": null}}, {"review": {"des": "It's a dive bar, whiskey bar and a beer emporium infused with punk rock decor and music to spice the moment.<br><br>The world eclectic was made for places like this. The walls display \"art\" from local artists and old movies are often screened, but above all, this is a bar in a whole sense of the word, the type not often found any more, except, perhaps, in old period movies.<br><br>For the casual observer, Delilah's may appear to be just another neighborhood bar, with funky decor and a nice vibe, but if you are an adventurous person or a connoisseur of sorts, you will appreciate the heavily stocked bar; claiming to stock over 300 whiskeys and 1000 spirits in all, you will quickly found yourself trying something different, something new, something rare, or just trying to stump the bartender.<br><br>I attended a Makers Mark event, I arrived early, and was glad I did. It gave me the opportunity to observe the place without the big crowd of the event. <br> <br>The event, as the name implies, was about Makers Mark whiskey tasting, including one, that I happen to like the best, made specifically for Delilah.<br><br>This place may not be for everyone, but if you enjoy a particular whiskey, a special beer, or just want to try something different, I highly recommend it; there is a good chance they will have that rare spirit of your choice. Or that you will discover your new favorite one.", "pics": null}}, {"review": {"des": "One of the best bars in Chicago, continuously running for over 9000 days.. they said!  It's a whiskey bar with literally over 800 selections & over 200 beer selections & GENESEE Cream Ale on draft.  Super dark inside... I mean like you can't tell night from day once your saddled up to the bar!  Patrons range from Bikers to Bust-Outs and you won't find many hipsters here... or will you??  Many long time customers that are very loyal to the joint, they said.  Prices are very average and it's always busy.  Great music and great service. Don't fall down in the bathroom taking a selfie!  Talk later", "pics": null}}, {"review": {"des": "Came here on a Thursday night and got some cheap drinks<br><br>DRINKS:<br>Drinks were relatively cheap, for being a lincoln park bar.<br><br>SERVICE: <br>The bartendress was super sweet and knew all of the specials. She was also able to recite the specials and events they had going on for the whole week. <br><br>ATMOSHPERE:<br>The music was loud and everyone seemed to be in a pretty good mood. I was surprised by the robust crowd on a Thursday night.", "pics": null}}, {"review": {"des": "If you claim to be a whisky guy and you live in the Midwest Delilahs is a pilgrimage you must make.  Truly an epic selection of hard to find juice.   I had my first sip of Van Winkle Family Reserve Rye at Delilahs.   Unreal is all I can say!", "pics": null}}, {"review": {"des": "I don't give very many bad and low reviews but I'm writing this based on my first and so far only experience at this place. The service was ok (and I do love and appreciate their beer selection - especially one of my favorite beers Hoegaarden on draft) but their one bathroom for ladies and one bathroom for gentlemen seem desperately not enough for busy night such as Saturday night (yesterday). <br><br>Speaking of the bathroom - this is why I have to give such a low review. The bathroom itself isn't in very good condition to start with and it just isn't enjoyable to use unless you are drunk enough that you simply don't care at all which I wasn't ... in addition to the bathroom being in bad state as it's, yesterday it was also very dirty and nobody seemed to check on it over the course of two and half hours that we were there, which in my opinion should be done frequently, especially if you only have two bathrooms for the whole bar!", "pics": null}}, {"review": {"des": "This is my favorite whiskey bar. With a smart and knowledgeable staff with a laid back unassuming atmosphere, the worst thing about Delilah's is deciding which of the many whiskey to order next.", "pics": null}}, {"review": {"des": "Hey there Delilah, how's it down in Chi town city?<br>I'm a thousand miles away, but your bourbon list's so pretty.<br>Yes it's true. Your Eagle Rare barrel deserves its due,<br>this drams for you.<br><br>Oh, it's how you serve it neat,<br>Oh, how you serve it neat,<br>How you serve it neat...", "pics": null}}, {"review": {"des": "Friend planned a surprise party here last night. The people were incredibly helpful and were super aware of how to not spoil a surprise!  They were also jamming Elvis tunes all night, which is a bonus.", "pics": null}}, {"review": {"des": "Not a bad place, very convenient for drinks. I have a few friends who live near this bar who choose this as your go-to dive bar. I can see why from the expansive whiskey selection alone why one comes back here!", "pics": null}}, {"review": {"des": "You need to stop here, I mean this is easily a bucket-list stop.  Broad and unique selection of bourbon and ... people.  Nice dive bar vibe.", "pics": null}}, {"review": {"des": "I really like this place. The bartenders are knowledgeable... they have informed opinions... it's a cool joint. Lots of beers. Lots of scotches. You could spend a lot of money here if you wanted... or just drink cheap beers. It's all good. <br><br>Punk rock movie/classic movie nights... star wars pinball machine upstairs. If you want anything more from a bar, you don't deserve it.", "pics": null}}, {"review": {"des": "I don't think I can add anything with this review that other people haven't already said. The have one of the best selections of American Whiskey in chicago. It's a great place to start if you are new to whiskey or very well seasoned. The staff here is very well versed in their whiskey and won't hesitate to assist and guide you. Ill definitely be coming back for the whiskey.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/i-h36SYElHGvLU00ya708A/348s.jpg", "caption": "Single Barrel Willett. Great pour!"}]}}, {"review": {"des": "This place rules. I was in town on a Monday night for Skate Punk night. It was awesome, they had free pool, skate videos playing on the TV and of course punk rock music playing. The dj was actually spinning punk vinyl. Drinks were cheap and good. Even met a pal who bought me a Marlöt shot. Everyone seemed to be having a great time cool vibe for the fellow punx. I'll definitely return next time I'm in town.<br><br>Ask they have a HUGE selection of whiskey, which is amazing for a punk dive.", "pics": null}}, {"review": {"des": "It takes a hell of a lot to impress me anymore, but I will say that the whiskey selection of this otherwise dive is damn near unbelievable-- probably the best I have ever seen. And I've been to a lot of bars. Suitable for any taste and price range. Islay scotch? Japanese whiskey? Bourbon? They've got you.<br><br>It was described to me as \"a nice place, but slightly more punk rock.\" And we sure did encounter a combination of whiskey connoisseurs as well as some dudes with patches pinned to their jackets.<br><br>We settled on the special, two bottles of Chang for a few bucks each (I didn't even know a cheap beer could still be found in Chicago).", "pics": null}}, {"review": {"des": "This grungy-vibed, dimly lit, hometown favorite is sure to please those looking for a unique place to toss back a few cold ones with the gang. GREAT drink options and a fun interior to hang out in. There's a lot happening in this tiny place.  Weekends are quite crowded so, hustle over early or be ready to stand and mingle till you can pounce on an open table or spot at the bar. Put this one on your bar visit list! Don't have a list? Make one.", "pics": null}}, {"review": {"des": "Bartender with pink hair, told me I couldn't read good and kicked my dog.  Would drink again.", "pics": null}}, {"review": {"des": "Went here a few weeks ago for a date and it was lovely! I've always wanted to stop in because of the cool Disney sign outside, but once you're inside it's pretty darn unique as well. From the dark, punk-y vibe to the crushed mirrors in the bathrooms, Delilah's has the aesthetics down, and then their extensive alcohol menu really makes this place worth visiting! I truly enjoyed my evening here and the service was quick and everything was clean -- all you could ask for from a bar. I can't wait to visit again!", "pics": null}}, {"review": {"des": "I like this place so much I bought the t-shirt. <br><br>Very authentic punk bar, with an incredibly sophisticated and elaborate selection of whiskey. I like to try a new one each time I come here. They also play great films, the past few times I've been here they were playing El Topo and the original Mad Max. <br><br>Monday night is popping (they have their beer specials if you are one of the weirdos who comes here and doesn't have whiskey). I've met many interesting people (on a varying spectrum of levels of savory) upstairs while playing pool. Never a dull night here.", "pics": null}}, {"review": {"des": "Neat dive bar with a large beer selection. The staff was great, I'll definitely be back!", "pics": null}}, {"review": {"des": "Delilah's is my favorite non-brewery bar of all time. I don't think that it is too divey at all. It just always seemed perfect to me. Known for being a punk and rockabilly bar, it always felt authentic and the people tending bar have always been awesome. Sit near the velvet Elvis painting or go upstairs and play some pinball. Good tunes, cool atmosphere, and there is always a neat B-movie playing in the background. The beer selection is also perfection. Yes they do have some crappy beers but they are smart enough to have a wide variety of crafts. Never remodel, never change, and keep being you.", "pics": null}}, {"review": {"des": "First time visiting this bar didn't know what to expect.  Was there for a Maker's Mark event and ended up staying much longer than I thought.  The amount of whisky is insane and will keep any bourbon fan busy for a while just reading through the list.  If you're a fan of dive bars that don't suck, check this out.", "pics": null}}, {"review": {"des": "Such a great place.  This will be my one spot I visit each time I am in Chicago.  <br><br>Mike is such a nice guy.  He took time out to chat with me about whiskey, the beer he made (yes, he had his own beer), and why not to wear my Dolphins hat in there on Sundays!  <br>We got a good laugh about me being a Fins Fan and his bar being a Bills gathering spot.<br><br>Even though it was a busy night, he took his time with me and suggested some different whiskies before I settled on one to sip.  <br>  <br>Such a fun spot with good music that caters to an old whiskey soul.  I did the touristy thing by purchasing a shirt.  And I will get another.<br><br>I felt welcome here by the patrons and the staff, unlike many of the busy bars I had visited in the area.  I frickin love this place.", "pics": null}}, {"review": {"des": "The best whisky list you could imagine and the most helpful, professional bartenders. Plus badass music. It's worthwhile to ask the bartenders for advice, even if you don't have a super intense whisky background they will bring you something delicious and in the price range you desire. They are not intimidating at all. That said, no one gives you stink eye if you just get a quick beer or a shot. So in other words, the perfect bar!", "pics": null}}, {"review": {"des": "Love this bar, over 14 thousand liquors you can choose from like what!? Very cool music playing all of the time. It kind of reminds me of bars we have in San Antonio. Awesome paintings hanging of people hanging at the bar I loved that touch. Very cool spot", "pics": null}}, {"review": {"des": "Anyone going to Jacksonville this weekend that could give me a ride lol .. also great bar especially for bills fans. The best and so fun", "pics": null}}, {"review": {"des": "So I came into town for a bachelor party, and before I even left town the bachelor was raving about how we need to go to Delilah's. I actually thought by the name that is was a strip club. <br><br>Delilah's is what I would consider a dive and has that old bar smell to it. If I wasn't recommended this place I would have passed by it. The night we went they essentially had a tribute to David Bowie, i.e. all Bowie music, which was pretty cool.<br><br>The big reason why I loved this place was their selection of whiskey. Holy moly! I must have bought a shot of every recommended whiskey that Drew the bartender suggested and it was perhaps the best I'd ever had consecutively. That was a huge surprise, since most places I have gone with equal or sub selection require a dress code.<br><br>Decor and experience was average but I will say that what they have to offer in their library of whiskey is currently my favorite of any place I've ever been to.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cIQjRrgT3Ajk0vyVJuiY4w/348s.jpg", "caption": "Cool signage out front."}]}}, {"review": {"des": "Whiskey lovers unite! As you would imagine, the whiskey selection (600+!!!!!) is insane. Your whiskey fantasies will be realized here. Plus, their beer selection is pretty impressive too. <br><br>Apart from the whiskey, it's a dive bar at its finest: dingy, dark and very little seating. The 70/80s rock music wasn't really my style, but my boyfriend and I enjoyed 2 rounds of the featured whiskey of the night-- $3 a shot isn't too shabby! (And no, it wasn't the typical wells whiskey either.)", "pics": null}}, {"review": {"des": "Informative and great. If u want a really good drink in a chill bar, come here. Tried 2 new whiskeys and loved them<br><br>Rick was great!", "pics": null}}, {"review": {"des": "What an awesome bar!! Wish Iowa had a place like this. Drink specials every night and THEE best whiskey menu I have ever seen. <br>Make sure you check it out on Mondays. $1 crappy beer and $2 Beam shots.....can't beat that!! <br>Head upstairs to play some pool.", "pics": null}}, {"review": {"des": "If you like whiskey then you can't miss this bar.   If you like punk or metal then you also can't miss this bar. If you like both whiskey and punk/metal, then why haven't you visited already?! Not sure what cocktails to try? I suggest an Old Fashioned or Sazerac.", "pics": null}}, {"review": {"des": "This place made my husband so happy. He is super into bourbon and bourbon collecting. He's had this bucket list of whiskeys to try for a while now, and whenever he can find them on the menu, he goes for it. We were in Chicago for our honeymoon and he found this place online and asked if we could squeeze it in before dinner. It wasn't super packed which was nice. Their selection is every collector's dream. They do half pours if you ask- thank god because he tried more than a handful of very allocated bourbons. Kudos to them for keeping their binder of what whiskeys they offer updated and correct. The owner came over and \"talked bourbon\" with my husband which he absolutely loved. Very personable man, and I'm glad they could share the same appreciation for collecting and drinking. Whenever we go back to Chicago we'll have to stop in to check a few more off his bucket list.", "pics": null}}, {"review": {"des": "Prime time spot if the downstairs isn't crowded or the upstairs is open and not reserved for a party. Don't think anyone plans on spending 15 bucks on a great pour of whiskey while being bumped around by people trying to get service. Upstairs seems to be rented out all the time lately, not sure what that's all about, forget it if you want to play pool before 1130 on a weekend or at all on a weekday. Best beer  and whiskey specials on the north side if you're willing to deal with the crowds.", "pics": null}}, {"review": {"des": "Easily my favorite bar in all of Chicago. Here are my short and sweet reasons why:<br>*The music is always stellar. Sometimes a specific night will have a unique musical theme (Elvis music, rockabilly, Motown, etc) but no matter what night you visit, the tunes will be expertly curated.<br>*There is always an interesting movie/show/etc playing on the TV. Always. I have seen everything from \"Friday the 13th\" to \"Fast Times at Ridgemont High\" to obscure Vampire-Elvis films. <br>*The staff is friendly and personable and always willing to give TOP NOTCH drink recommendations. <br>*The drink options are plentiful and unique. I especially recommend the punch- it changes seasonally but is always a delicious and refreshing drink choice. <br>In short, if you are looking for a bar with genuine people, stellar atmosphere, and fantastic drinks, look no further than Delilah's.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/c05BCfkQtW0SqOacqtfYeg/348s.jpg", "caption": "Dope atmosphere."}]}}, {"review": {"des": "I looooooooved this place.  Great music, people, bartenders, and omg, that liquor list.  The selections were fascinating, even for a girl who doesn't know much about whiskey or bourbon.  The bartender was so attentive and educational.  I wish I lived in Chicago, so I could educate myself a bit on all of this.  Or, maybe I don't....", "pics": null}}, {"review": {"des": "Great bar with and awesome whiskey and beer selection as well as very knowledgeable staff, they often have tastings there as well which is always really fun and fairly affordable. I've rented the upstairs for a small party and that was great also, and really affordable as far as renting a private room in a Chicago bar goes!", "pics": null}}, {"review": {"des": "Love this place! It's a bit \"divey\" but in the best way! Amazing draught selection of beer and of course the whiskeys are fantastic. Casual vibes. Good for celebrating or just hanging with a couple friends! Some pinball machines and pool upstairs. Bars on both floors. Fun times to be had all in every square foot.", "pics": null}}, {"review": {"des": "I very rarely give out 5 stars. I feel like to earn five stars there has to be something that business is doing to earn it. Delilahs has many many reasons. Let's start out with the basics, there is no dress code. No cover. Yes it is a dive bar. There is no table service, no bulls**t mixologists making fancy mixed drinks. You either sit at the bar and order your drinks or grab a small table and sit.The crowd skews towards punk and other similar music followers. There was a guy playing records which was mainly punk,ska, and obsecure reggae towards the end of the night. The staff is very friendly even the door guy. I don't particularly fit the usual crowd that is there but they made me feel welcome anyways. On the surface it looks like any old bar, until you look at the bourbon and American whisky list and realize that the menu is literally 12pages long front and back. No joke the bourbon part was probably 4-5pages. I have never seen this much bourbon and American whisky in one place before. It runs the gamut from cheap pour of jack Daniels to a.h. Hirsch 16 year special reserve and everything in between. Much of what they carry is either hard to find, discontinued, or non existent. If you really want to get something good ask for mike Miller, the bars owner. His knowledge was mind blowing. We had a good talk about rare bourbon and i learned some stuff I didn't know about before. Besides bourbon and American whisky, they had a pretty good amount of scotch, and other international whiskeys. The prices are very reasonable and they sell everything on the menu in 1oz pours. I wish all bars would do this. I like to try new things when I'm at a bar,and there's nothing worse then getting 2oz of something you don't like. Here they do 1oz and if you like it get more. In closing, mike and his team are all cool, the bar isn't huge but it gets the job done, the bathroom has a lock on the door, soap and towels. This is a pet peeve of mine going to bars, clubs etc where the bathroom is really dirty and the doors don't lock or no soap. They have cool bar shirts for sale. And they sell everything including beers for a reasonable price. All bars should have this business model. Mike you rule!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6XnWHXEFN9kylrRB9NAHjA/348s.jpg", "caption": "Bourbon"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Awdgn1Fey2rFaXxPTKZoDw/168s.jpg", "caption": "Delilahs special editions"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Q8p-D5vu1RXMvQVPNsu8BA/168s.jpg", "caption": "Bourbon"}]}}, {"review": {"des": "Plethora of whiskeys. Got a punk vibe going. They have rotating specials of beer and whiskey each night. I'll return at some point but don't see myself becoming a regular.", "pics": null}}, {"review": {"des": "Divey, dark, a great beer selection and a great location. What more could you ask for?", "pics": null}}, {"review": {"des": "The best Bills backer bar !!! We walked in (visiting from Buffalo) on a Bills Sunday and were immediately greeted with shots. The owner, mike, is a Kenmore west alumni. He, and everyone, were just so friendly. My boyfriend even won a bills dry fit tee. <br>On Bills Sundays, you're able to buy the bar a round of shots for a buck a piece. It's really just a great atmosphere. <br>Not to mention they're also a punk rock bar!<br>Right up my alley!", "pics": null}}, {"review": {"des": "Great bar with an even greater brown liquor selection.   Dropped by for a bourbon sampling with my wife and her co-worker, who was well versed in the finest bourbons. I'm no slacker on that, but if there was a title for bourbon knowledge mastery, he'd wear the crown. Along with Mike, Delilah's owner, who we met that night. Those guys, as well as our bartender, talked all kinds of bourbon and I took it all in. As well as four fine ounces of some great bourbons. We started with a Weller 12, moved on to a Willett 21, Old Fitzgerald 12 and finally a Jefferson's Presidential Select 18 that just knocked the socks off. Best bourbon night ever. Finished off by sharing a bit of my wife's Old Fashioned for dessert. Awesome place, great vibe and a don't miss joint if you like bourbon and other brown liquors. Delilah's is on the \"many repeat visits\" list when I'm back in Chicago.", "pics": null}}, {"review": {"des": "How fun!<br><br>I went to see a friend who in on a record label spin some tunes a few weeks ago, what a unique space. <br><br>Highly recommended.", "pics": null}}, {"review": {"des": "Best liquor selection in Chicago. Mostly whiskey but I was also blown away with their absinthe offerings too.", "pics": null}}, {"review": {"des": "Delilah's came recommended by an old friend, It's a cool dive bar, with a punk sound track and 80's video on the screens.  Place is dark and on our first visit very crowded, staff was very busy and took a minute to get served, but understandable, checked out the upstairs as well, equally crowded smaller bar upstairs along with pool table.<br><br>Our second visit (Sunday) bar was less crowded but more relaxed, staff was friendly, but we were rushed because we had to get on the road.  I like the place, it reminds me of my favorite dive hangouts, past and present.  You should go see!", "pics": null}}, {"review": {"des": "$20 for drinks + 50 cents for peanuts = one hell<br>Of a start to the night...an awesome night <br>Great environment <br>Great bartenders <br>Cheap drinks <br>Yes yes yes", "pics": null}}, {"review": {"des": "800 whiskies. It is a large book. Lots of unique choices. They have heir own special editions. Bartenders are friendly.", "pics": null}}, {"review": {"des": "Greatest bar in Chicago!<br><br>Leopold Brothers on the menu!", "pics": null}}, {"review": {"des": "This bar was perfect for a night to get casual drinks and chat with friends. There is definitely a \"local\" kind of feel to the place and the bar tenders are super friendly. Also there are good deals on Mondays...I would recommend for a more casual night out.", "pics": null}}, {"review": {"des": "I live down the street from this iconic Chicago Dive bar. It is the epitome of a dive bar. Very dark and grungy inside, awesome pool table up stairs. Huge whiskey selection and I love that they always have specials. <br><br>Rumor on the street is Lady Gaga use to come here when she was dating that guy from Chicago fire. <br><br>Me and my friends come here during the week, it gets way to crowded on the weekend. We usually head upstairs for the free pool during the week.", "pics": null}}, {"review": {"des": "Absolutely love this place!! Its very divey/dark however their whiskey selection is not comparable to any other bar in the Chicagoland area! I like that you can actually try some of their whiskies before you actually order them. The music can get annoying after a while since its so loud and the speakers sound like they are busted but once you have a drink in hand that will be the last thing of your worries! Bartenders are friendly and can make good suggestions on a whisky to try based on the current whisky you know/like.<br><br>I will keep coming back to try different whiskies and encourage you to give it a try if you are really into whisky/scotch/bourbon!", "pics": null}}, {"review": {"des": "Huge selection of whisky/whiskey for novice and expert drinkers. Monday is Punk Night and you can never go wrong with that. Pool is available upstairs for $1. This place is a shit show on Saturday nights.", "pics": null}}, {"review": {"des": "Delilah's is a great place. Definitely a dive, but something for everyone. Especially if you like whiskey, which is funny because I don't. But if you know someone who does, then this is a place worth checking out. Is it a full scale bar regardless, so there's something for everyone. There's also an upstairs area with a pool table, but no whiskey options up there you can only get that downstairs. But there's some cool drawings on the wall upstairs like the acid-tripped my little pony.<br><br>Service is very helpful as I find everyone who works there can help with recommendations for any libation. Plus they also have various themed nights whether it's music, DJs, certain drinks, etc. The bathrooms are not pretty. Yes it can also smell funny there too sometimes. I prefer to go during the week when the crowd and smells are more low key.", "pics": null}}, {"review": {"des": "Awesome dive and a great first date!  Great selection and very knowledgeable about whiskeys.  Also, hollllly crap they do love the Buffalo Bills.  I do believe every, and I mean EVERY Buffalo Bills fan that exists goes here.  <br><br>All the Bills.", "pics": null}}, {"review": {"des": "Best bar in Chicago! Punk rock, great craft beer, and friendly staff!<br><br>What more could you want?", "pics": null}}, {"review": {"des": "Saw this place on Americas best bars! They said it was ranked one of the best whiskey bars in the country, and I believe it. They literally have a big binder full of whiskeys, scotches, rums you name it. The place is dark and kinda small but it has its own style. The bartenders know thier stuff! I like how they give u a glass of ice if you order on the rocks so you can decide how much ice to put. Wish it was a little classier and appealing but I think the dive rustic image is what it's going for.  This is not a place I would not l spend a whole night at or go with large groups but if you and a couple of buddies are big whiskey n bourbon drinkers this is a must stop!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-QruvsszSxR2psa0kR-cgQ/348s.jpg", "caption": "Binder of drinks!"}]}}, {"review": {"des": "Shady. <br><br>We were coming from work and were rather dressed up compared to the clientele.  It is a dive bar but part of a dive bar's appeal is that it appeals to all kinds of people.  Unfortunately, it gave off the aura of trying too hard to be a scene.  The staff was overly friendly but consistently under poured our drinks - tiny pours.  It was almost like saying f-you corporate bastards, I am going to under pour and charge you $50 for this round.  Job well done - we are not coming back.", "pics": null}}, {"review": {"des": "Steely dan playing and a whiskey selection 14 pages (filled from front to back) long not including the seasonal whiskeys on the front of the binder. Not a bad way to spend a couple hrs on friday waiting for a play to start.<br><br> I dont like rock and roll but the whiskey, beer and great service will bring me back.", "pics": null}}, {"review": {"des": "5 for selection, 3 for atmosphere, averaging out to a 4. You can get larger pours for less $$ at other places in town, however their selection is unbeatable. The staff was knowledgable and friendly. <br><br>We arrived during an alien terror movie... Not what we want while having a fancy drink, but it was clearly advertised on the website so we can't complain too much. It would just be nice to find the selection with an atmosphere that matches.", "pics": null}}, {"review": {"des": "Alternative bars in Lincoln Park are hard to come by.  Even Local Option hosts the local attorneys after work.  But Delilah's succeeds in giving you a break from the cookie-cutter and gives you something straight from the heyday of Logan Square.  That goes not just for the décor, but the patrons too.  (Most) people come here expecting something a little darker and rougher than they would generally get in LP.  And I mean that in a nice way.  Drinks are reasonably priced, I mean, you're not actually IN Logan Square, and the beer list is long and unique.  The upstairs is opened later in the evening.  Get hear rather early to get a spot at the bar, and enjoy!", "pics": null}}, {"review": {"des": "Bartender tried to hustle us, didn't even produce a drink breakdown, charging 100 for maybe 75 in drinks, won't ever come back here.", "pics": null}}, {"review": {"des": "I love this place for the mere fact that it's pretty much black inside with hints of green. Green is my favorite color, incase you didn't know. I liked the general vibe this place had, even though we went early in the day and it was pretty dead. <br><br>Stopped in to grab a drink, I tried their cocktail of the month which was the Swamp Thing Elixer which had apple vodka, green tea vodka, and soda. Pretty tasty. <br><br>I loved that they had nuts in a quarter candy vending machine. It was the best mix of tacky/cute/clever to me. They also had Gunslinger Beef jerky for sale by the bar! Cool little snacks if you ask me. <br><br>The Emerald Ice Jukebox looked pretty sweet. Might have to request some songs next time. <br><br>For sure wanna go back at night sometime.", "pics": null}}, {"review": {"des": "Great place to spent Saturday night with friends! Great whiskey and beer manus. I m not a big whiskey fan so I went by waitress recommendation. Good but super loud music. There's is nice second floor area where you can find booths to sit when the group is larger. Upper and lower bar is great when you don't feel like walking up and down the stairs just to grab beer. <br>Highly recommend.", "pics": null}}, {"review": {"des": "This dive bar has an extensive beer and whiskey selection. They also have some ciders including pure cider, which is delicious and hard to find on tap. Great spot to have a few drinks.", "pics": null}}, {"review": {"des": "Phenomenal whiskey selection. Pricey but worth it . Everyone in my party appreciates a good whiskey so we decided to give Delilah's a shot. It is small bar so snagging a seat might take some time. But there is always standing room at the bar. The whiskey list is one of the best I've seen and the bartenders are nice. A solid 4 stars!", "pics": null}}, {"review": {"des": "Delilahs is paradise for whisky and scotch and bourbon fans. It's just as magnificent as Jack Rose in DC, the staff are amazing and Mike, the owner, is a wonderful scotch fan to talk with. Best Bar in Chicago!!!!!!", "pics": null}}, {"review": {"des": "Love, love, love old school dive bars. Glad that it is still  around!!! Btw, Rick is the best bartendar in the north side of the Go Go.", "pics": null}}, {"review": {"des": "They have a pool table at the top which is a nice way to hang out . The bartender-Mary, was very helpful and talked to us. They also have peanuts for a dollar. This is a whisky lovers place and it surely lives up to its reputation. The place has a nice feel inside with interesting lighting. Would recommend if you like whisky and a good setting", "pics": null}}, {"review": {"des": "I was a bit skeptical when my brother-in-law and his fiancé said they wanted to check out Delilah's. \"It's a punk rock whisky bar,\" they'd said. I was expecting some terrible faux-divey hipster bar with jerky bartenders. So imagine my surprise when we walked into Delilah's and found an actual divey, teensy-bit hipster bar with a lovely bar staff!<br><br>The whisky list was impressive with 700+ selections (I asked)...the menu essentially looks like a karaoke song choice book. <br><br>Loved:<br>- the selection! while overwhelming, it was fun to go through and pick out new ones to try.<br>- everything we tried was served neat in what looked to be a tiny juice glass. <br>- the service! the bar staff was super friendly and sweet. they chatted us up about our selections and weren't at all judgmental or jerky.<br>- the specials! while i didn't partake, the list of daily specials were particularly affordable. <br><br>Atmosphere wise, the place wasn't too packed on a Friday night after 5PM and they were playing the original TMNT movie on the TVs. It was the perfect place to start the evening!", "pics": null}}, {"review": {"des": "It was a cute dive bar, though I have to say the TVs all over the place don't go with the alternative dive bar vibe. Overall, recommended.", "pics": null}}, {"review": {"des": "About as Wicker Park of a bar as you can possibly get in Lincoln Park. It's a sweet little slice of hipster heaven amidst the at times obnoxious scene that is Lincoln Ave. <br><br>There's tons of whiskey, great specials, and cool bartenders. The couches have some \"character\" (meaning they're shitty, but perfectly appropriate for a dive bar) lighting is extremely low, and the music is everything you won't find down the street at Gin Mill. <br><br>Cash only, but if you dig a different scene than the normal Michigan State ba...I mean Lincoln Park bar you'll enjoy Delilah's.", "pics": null}}, {"review": {"des": "Bourbon. Over 600 of them with good prices. What else do you need? Go drink.", "pics": null}}, {"review": {"des": "Easily one o my favorite bars in all of Chicago, IL. I had my 21st here, and have been coming back ever since. The over all feel is very rockabilly, and punk. The atmosphere is fantastic, and the bartenders are great (lots of knowledge of whiskey, and beers). They always have rad horror films on the tvs, and good deals. Definitely try their Wyder's dry raspberry hard cider, or their \"Delilah's whiskey\"!", "pics": null}}, {"review": {"des": "This is totally my kind of place. It's a little mysterious, a lot rock n roll, a little college(ish due to the neighborhood), and a lot of quality spirits from beer to whiskey. This is where I would want to drink, hang out, and make friends. It is just so unpretentious even though it could be. Spot on and so discrete all at the same time. Love it here!", "pics": null}}, {"review": {"des": "So nearly 400 reviews with a four star average have it right--Delilah's is pretty great. But I need to share a story from a recent visit to exemplifies WHY they are so awesome.<br><br>I stopped by with my husband, the scotch afficianado, recently before a dinner reservation in the area. I partook of the $3 Four Roses (I enjoy bourbon but the subtleties of the expensive stuff are lost on me) while he indulged in some rare whiskies and chatted with the bartender. Around 5, a large group rolls in shouting, chanting, singing, and just generally being disruptive. It was annoying, and not in the spirit of what the bar should be.<br><br>One of the group saddles up to the bar a while in and makes a joke about how annoying their group was. The bartender's response was literally so perfect I'm in awe: to paraphrase, he acknowledged their loudness and basically said, \"just so you know, you guys are pretty atypical for the crowd here at this time--we just opened for the day so most people here are just wanting to have a quiet drink and chill, so the chanting and everything is probably a little much.\" It was such a classy but honest way to let them know that they were at the wrong bar for what they were looking for...really impressive finesse that a lot of bartenders lack nowadays. Nice job Delilah's!", "pics": null}}, {"review": {"des": "Local punk bar.. Two floors.. Decent prices.. No food.. Turning out to be a bit more hipstery. Used to be more punk..", "pics": null}}, {"review": {"des": "This is the bar I was proud to bring my out-of-town guest to until the gigantic rat ran across the floor... UPSTAIRS.<br><br>I'll never hear the end of it from my work friends. So awesome. Add that to your Best Bourbon Bar accolades. It's a real hit with the ladies.", "pics": null}}, {"review": {"des": "A cool bar that has been here almost twenty years. Now, back when this place opened this was the edgy part of Lincoln Park.... think back a while. These days, this is perhaps the only cool bar in a half-mile where the density of North Face wearing boys and girls is perhaps 99%. <br><br>Great music playing. Super dark interior. I wish I had gone here back in the late 1990s. I think I might have, but don't remember it. Creepy art on the walls. Nice! <br><br>I would say this is the BEST bar in this area of Chicago where I would not choose to hang out.", "pics": null}}, {"review": {"des": "Punk rock. Whiskey. Pool & Pinball. It all leads to a great night. One of my favorite bars in the city, let alone the best dive bars. I think this is a place that is a good test of the friends you should keep and the people you should date. If they don't like this place then in my opinion you should re-evaluate your relationships. If you don't like it, then I'm not sure how good of friends we would be. <br><br>One of the best whiskey selections in the city, but even if you don't like whiskey, you can grab a beer and be happy to have found a down-to-earth place that isn't afraid to show their tattoos in Lincoln Park/Lakeview. Sometimes the music is loud and the room is hot, but the people are generally cool, the staff knowledgable and drinks reasonable.", "pics": null}}, {"review": {"des": "Super divey, inexpensive, great atmosphere, everything you'd want in a bar. The music here was superb and the staff was friendly and attentive. The bourbon menu was pretty overwhelming but I ended up trying the Filibuster Delilah Triple Cask. Slightly sweet with a wood smoke taste, it was pretty great.", "pics": null}}, {"review": {"des": "This was actually the first bar I ever visited when I moved to Chicago a year and a half ago, and it is definitely my favorite. It's got pin ball, pool tables, an amazing selection of whisky and the music is always fantastic. While I like whisky, I'm not by any means an aficionado and the bartender was very helpful. I also met some super nice regulars here and will definitely be going back. It's not in my neighborhood, but it's totally worth the trek!", "pics": null}}, {"review": {"des": "Whiskey Dive Bar<br><br>If you like whiskey and dive bars, look no further. The whiskey menu is quite extensive and the bar tenders are very knowledgeable of their spirits. Early in the evening the music is at a tolerable level so you can speak with your company, but as the night goes on the music volume is raised at exponential increments very quickly. Surprisingly for it's dive feel, it is not as hipster as you would first imagine. I will definitely be visiting this location again in the near future.", "pics": null}}, {"review": {"des": "My favorite bar in America.  Ask for a bourbon list and you get a 3-ring binder.  'Nuff said.", "pics": null}}, {"review": {"des": "Tipsy review! Five stars, wahoo!!!<br><br>Alright, new favorite bar? New favorite bar. I wish I fit in here better. Music = great. Bartenders and crowd = great. Movies = great. Drink selection = great. Me = awkward.<br><br>This bar has confirmed I am the most awkward person I know. Here are the facts: Whenever I have agreed to meet a friend at a bar, I've always arrived on time and have always had to end up waiting at least 15 minutes for said friend to show up (the friend doesn't matter--any I agree to meet is either chronically late or terrible with directions). This time I decided to show up 15 minutes late to cut out some of the awkward sitting alone looking around at the walls time. I was still 45 minutes early as it turns out...<br><br>But here is what happened. No one looked at me funny. No creepy old guys tried to hit on me. The bar tenders did not ignore me. I was still awkward. So now I know for sure it's me, because the people here are just too great for it to be them that causes any awkwardness I feel.<br><br>Also, I got 5 whiskey gingers for $20. F. I. V. E. Do you know how many cocktails $20 will get you at most places? About 1.8. Given, it's not the strongest pour of whiskey, but still I got five when I would normally get almost 2, so I see that as a huge plus. <br><br>I went on two occasions, when it was both empty and very crowded. There was no change in the friendly service or the crowd of generally great people. <br><br>Go! And take me with you!!!", "pics": null}}, {"review": {"des": "I've been here four times and I live on the South side. Love, Love, Love! Great whiskey selection, including bourbon. They make a great Manhattan. Ask for Eric or Mike, they are great and super knowledgeable, they will give you some great recommendations if your a whiskey drinker. Be warned it is super dicey, but if you like dicey, slow pace bars and love whiskey, it's a must try!", "pics": null}}, {"review": {"des": "So tight. So so so tight. Amazing whiskey selection. Mike behind the bar is the fucking balls. Try the Bushmills Madeira finished whiskey. Or the Mock preprohibition. Punk rock on the box and cold beers. Killer place. Keep it the fuck up.", "pics": null}}, {"review": {"des": "A couple hundred dollar bar tab later will tell you just how much I love this place. <br>By far the friendliest bartenders I have ever encountered followed by a totally friendly crowd. I kept wondering why people were so nice but hey, totally the kind of place. <br><br>We thought we'd go in for a drink, we ended up practically crying when it was bar close. Fell into bed around 5am, what a perfect night thanks to the awesome crowd, good music, tasty drinks and kick ass bartenders! MUST GO!!", "pics": null}}, {"review": {"des": "Best whiskey bar in Chicago. Come if you're a veteran or want to experience new whiskers. Some of my favorites came as suggestions from bartenders at Delilah's.", "pics": null}}, {"review": {"des": "Awesome bar with a local feel. Draft selection was not crazy but did not disappoint either. Dive bar feel without worrying about getting hepatitis. Service was great.", "pics": null}}, {"review": {"des": "Hipster style dive bar - comfortable and cozy, great whiskey selection and interesting specials written on chalk boards above the bar. (I tried the Spiteful Absinthe barrel aged klutzy buffoon with a side shot of absinthe special for $15) Service was slow, we went here on Saturday Dec 13. This was our first time, and we've heard from many locals that it's a great spot but that it's not as good as it used to be because a lot of the really good bartenders and management left.", "pics": null}}, {"review": {"des": "Delilah's is a wonderful blend of punk, pop culture, and ironic history. An example of this peculiar and endearing theme is the TVs. They play old movies silently while rock and punk music plays over them. The last time I visited, the infamous cult classic Reefer Madness was playing. Before that, Star Wars (A New Hope, of course). The drink specials here are varied and generous. The pool table upstairs is in great shape and high demand. The bartenders and owner are friendly. Everything here is laid back, relaxed, and different. Try Delilah's, especially if you like whiskey. At the very least, you'll get to be somewhere totally unlike any other bar.", "pics": null}}, {"review": {"des": "Cool bar, super friendly staff & crowd. Pool table upstairs too. If you like whiskey, this place is a must.  They make their own too.", "pics": null}}, {"review": {"des": "What a gem. The interior has a really intimate vibe, excellent movies being played in the background, and just a mix of music that's everything from reggae to 90s hiphop to alt. rock to chill. <br><br>I love whiskey, so this was just fantastic! They got a good variety and an excellent bartender. He knew his drinks and he was such a chill person to talk to.", "pics": null}}, {"review": {"des": "Michael Jackson (booze MJ, not moonwalk MJ) called this one of the three most important bars in America.  And I love me some bars in 'merica, so I made the trek to see about Delilah's.  After all, that name conjures up something mighty different in my home territory of Philadelphia.<br><br>I made my way in and heard the steady blare of punk and saw the hazy shade of red - until I spied the wall behind the bar.  And then my view went all tunnel-vision - I probably proceeded from there kind of bow-legged, like a scene from Fear & Loathing in Las Vegas, too.  Oh, the whiskey...it's like Dr. Seuss stocked the place with short ones, tall ones, light ones, dark ones, old ones, new ones, strong ones, brown ones, fair ones, and rare ones.  I could have frolicked through the whiskey selections like a cartoon bear in a Cottonelle commercial.  <br><br>The beers here are a robust and noteworthy lot, too, and some of my associates chose that path at the fork in the road, but I went with the knowledge that they stock over 400 whiskies here, and I wasn't about to swig anything but.  A friend and I knew what we were sitting on and went all in - we built up with some various strong selections, and then, when ready, each sampled what the bartender told us was the piece de resistance - a vintage find called Old Mock Whiskey that was eighteen summers old when bottled...and that bottling was many moons ago (1930's? - find a pic of this artifact in the photo section).  I sipped that for a long time, just in awe of its existence, history, and availability for sale.  It was like security at Le Louvre suddenly offered \"oui, monsieur, hop up and throw your arm around Winged Victory, and I will snap a couple photos for you, but ov coourze...\"  Unreal.<br><br>I liked the space, I enjoyed the vibe, and I had a great time the entire evening, but more than that, it's as if the Smithsonian of whiskey is hiding in plain view in Diversey.  This is an experience and a half; bucket-list worthy for brown spirit lovers.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BHitnzYRaF-ytk-rGVGqXA/348s.jpg", "caption": "Older'n dirt, rarer'n rare, it's Old Mock."}]}}, {"review": {"des": "A couple months ago I was having a cocktail with a lady in the back living room-esque area when a rat scurried across the floor and u-turned into the bar area, before disappearing into the booze. Normally this would be a turn off, but they dont have food, so whatever. Made me like the place even more<br><br>Also: Excellent whiskey bar. pool upstairs. not your typical Lincoln park bar. Way more punk rock than hipster", "pics": null}}, {"review": {"des": "One of the great dive bars in Chicago, hands down. Music was cool, decor is down, and great beer and whiskey selections. The upstairs section is cooler than the downstairs.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7M8Fwap6XPO9tfWZkOxPNg/348s.jpg", "caption": "Me in the downstairs section."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/96myvjjiQW8ZFp4LrE1gXQ/168s.jpg", "caption": "Whiskey and beer, nice combo!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/co7mSM1O5uwRuLZom-o-Dg/168s.jpg", "caption": "Upstairs section"}]}}, {"review": {"des": "I don't need a long review for this.<br><br>-The biggest whiskey selection you'll ever see<br>-Friendly bartenders<br>-Loud rock music<br>-Loud rock decor<br>-The occasional game of pool upstairs<br>-Mostly neighborhood crowd, some of them can tell amazing stories about the area.<br><br>It's iconic and a must-visit.", "pics": null}}, {"review": {"des": "Why have I not reviewed Delilah's?  I don't know.  They have an excellent selection of whiskey.  All of the whiskeys.  All of them.  The beer selection is not bad though not extremely extensive and the pricing is more than alright.  I also approve of any place where seating at 10:30 on a Saturday night is plentiful. The special cocktail we tried this past Saturday, \"the Intern\" was delicious which had white whiskey, ginger and orange liqueur I believe.  They take cards now, and most importantly, when we were in on Saturday, they were playing the Kiss movie.  Fabulously ridiculous.", "pics": null}}, {"review": {"des": "LOVE this bar! Juke box is a total throw back to the 90's and the tunes I would listen to in high school! Incredible whiskey collection. Mari and Martin are the BEST for service and story telling. The only complaint I had was the stupid collage crowd. Head to the second floor to escape that, and maybe avoid weekends...I've heard that it's a bit \"classier\" weeknights. The line up of shows I saw on the posters looks awesome. Most definitely going to visit next time I'm in town.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6eiYJXTiWS7UdLRRfn6CRw/348s.jpg", "caption": "Second floor bar"}]}}]}