{"name": "demera-ethiopian-restaurant-chicago-2", "reviews": [{"review": {"des": "Everything about Ethiopian food reminds me of Indian food, it makes my heart full. Injera reminds me of sour dosa famous in Southern India, lentil curry reminds me dal and the spinach with veggies too. Sambussas again remind me of Samosas, lamb curry of mutton korma back home. It's like Ethiopian cuisine is the long lost twin of Indian cuisine.<br><br>Anyway, we got spinach and beef sambussas which were pretty amazing. Crunchy on the outside, with rich filling. Since we were a party of 4, we got family style Messob with 4 veg curries and 4 non veg curries. I only remember Dolo wat that comes with hard boiled egg, SO good!!! My favorites were that of minced lamb with cheese and the Dolo wat one. Food was awesome, service was pretty great. Neat little place, a bit small but still good for large groups. <br><br>Highly recommend this gem of a place!<br><br>PS: the picture is from a different visit where we got the 3 veg curries and 3 non veg curries one.", "pics": null}}, {"review": {"des": "Ok, so I've had great Ethiopian food. This ain't it!<br><br>They messed everything up. I could have sworn that my wife ordered the chicken plate and I had ordered the beef. Instead they gave us 2 orders of grease and sludge. We paid 38 dollars for this crap! I'm no restauranteur, but if I were trying to save a few bucks and cut corners, this is something that I would do.<br><br>Of course that means you can eventually kiss your customers goodbye, as we certainly have seen the last of this place.<br><br>Edit: They did email me about this review and said that they'll be working on cutting down the grease and the presentation. I guess everyone makes mistakes, but I respect how they seem to be trying to correct them.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tyeMvFJGB88syf81Wmt0Zg/168s.jpg", "caption": "This looks like every dish that Gordon Ramsay curses out on \"Kitchen Nightmares\"."}]}}, {"review": {"des": "Went here for a date night a few weeks back and was really excited to try my first Ethiopian restaurant. I really wanted to like it here but came away very disappointed. <br><br>My girlfriend and I split a messob. The first thing we went for when it came to our table was the doro wot (chicken) and instantly spit it out. On the menu it was listed as bone-in, which was fine, but under a little chicken was a majority of bone too small to see when eating. <br><br>The rest of it was sub-par, our beef dish was very good but that was about it.", "pics": null}}, {"review": {"des": "First time eating Ethiopian food and it was a very cool experience.<br><br>Demera is located in Uptown, a bit far from where I'm usually at in the city but this experience was worth the trip up, plus the Green Mill is right across the street!<br><br>Started with the sambusa sampler, there were several difference varieties, all pretty good.<br><br>I had a glass of honey wine which I think is an Ethiopian thing or perhaps the brand was, but this was interesting, sweet but not overpoweringly sweet, I had never had anything like it.<br><br>We went with the messob for two and picked out all of our meats and veggies. Tried to get a little of everything and the giant shared plate was good for this. I remember the Doro Tibs, Lega Tibs, Shimbra Assa and actually the cheese (ayib, I think?) being especially good. Some of the herbs and spices resembled Indian food to me, but others were distinctly different. The concept of eating this kind of food with the pancake-looking bread was entirely new to us, but it really made for a great experience.<br><br>Service was good, our server was friendly and helpful as we tried to make so many decisions on what to include in our messob.<br><br>You get a ton of food for the price, we couldn't finish 100% of our messob so no issues with portion sizes.<br><br>First foray into Ethiopian food but certainly not my last.", "pics": null}}, {"review": {"des": "I always love trying new Ethiopian restaurants wherever I am and Demera certainly is a contender when it comes to quality and service here in Chicago.<br><br>When I was brushing through older reviews, I noticed that Demera struggled a bit in the early 2010s. They've seemed to turn around as recent reviewers have argued that they are the best in the city. A turnover like that means it's worth a try if you're feeling like eating with your hands for a day. However, I wouldn't necessarily say they are top tier based on what we tried.<br><br>My friend and I went for their Messob for two (Combo Platter) ($40) which is typical of many Ethiopian restaurants since you get to try the most dishes at once. Our plate consisted of the following:<br><br>Veggies<br>- Shimbra Assa - Grounded chickpea dough which was okay but lacking in the flavor department<br>- Gomen - Collared greens which I always enjoy at Ethiopian restaurants<br>- Yatkilt Wat - Blend of veggies and starches mixed together for those eager and indecisive like ourselves. Potatoes were undercooked.<br><br>Meats<br>- Kitfo - Grounded beef sprinkled with cheese. While it's no tartar, it was still pretty good but definitely the weakest of the bunch.<br>- Ye-Beg Alicha -  (Bone-in) Tender lamb that was absolutely the best of the bunch. I wish we had gotten two servings of this really!<br>- Asa Wot - Cubed fish fillets in their homemade barbecue sauce<br><br>So we had some amazing tastes and some misses along the way, but the experience was still great. Taking pieces of injera and sipping on honey wine means that this was a great meal regardless.<br><br>Prices here are higher than most Ethiopian restaurants I've seen potentially as they cater to a different audience (i.e. Michelin enthusiasts) Their sharing plates also seem to fluctuate in portion sizes slightly but I'll tell you it's that a lot of food. Don't be deceived and enjoy the tastes!", "pics": null}}, {"review": {"des": "I came here with my girlfriends for girls night out dinner. We split the messob combination platter with vegetarian and meat dishes. I loved all the vegetarian dishes especially the collard greens (I love collard greens), split yellow peas and lentils. The injera was delicious but very filling. The platter presentation was beautiful and impressive as most of our dishes were stew based. We all ordered the Demera shai, black tea leaves infused with cinnamon and cloves served hot. I also decided to try the traditional Ethiopian honey wine, which for me was too sweet and is more of a postprandial drink. However, I was more than happy with my tea. Service was very attentive and reservations were easy to make. Street parking is difficult in this area so we paid to park in a public parking lot.", "pics": null}}, {"review": {"des": "Stopped by for dinner with my brother and sister-in-law who were visiting from out of town. They requested Ethiopian and Demera  was the only place I could remember. We were seated quickly and ordered the family style messob, which comes with 1 beef, 1 chicken, 1 fish, 1 lamb, and 4 vegetarian dishes (lentils, collards, cabbage).  This was my first time eating injera, a sourdough flatbread made from teff flour.<br><br>The fish, chicken, and all of the vegetarian dishes were my favorites as they were the least spicy. The beef was spicy. Ethiopian food is extremely flavorful and full of spices. The messob for 3 was more than enough food. We also ordered a bottle of tej, a honey wine, which was tasty and had an alcohol content between 11-12%. It was not overly sweet and had a slight honey note. To finish off dinner we ordered Ethiopian coffee, which is a darker roast and can be slightly bitter. Sugar is traditionally provided, but not milk (I'm sure it could be provided if requested). <br><br>The service was fast and friendly. Our water glasses were never empty and the staff never rushed us. Our server was also kind enough to take our picture. I would definitely recommend to those interested and in the area.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VGh_g6B9MpNY0pUZmGp5HQ/348s.jpg", "caption": "Messob for 3, includes 8 dishes"}]}}, {"review": {"des": "When you walk in, it smells amazing and your mouth waters. The food is wonderful, the service is a little slow but the servers are extremely friendly and kind. Its a cute, large restaurant with a nice outdoor patio. We ordered the family shareable and it was perfect! Chef choice of 1 lamb, 1 chicken, 1 beef and 3 vegetables. Loved each order!", "pics": null}}, {"review": {"des": "Everything was delicious! The food; we had the family style Messob that comes with 4 sides and 4 meats. The honey wine was great; ordered a bottle for the table. Everyone enjoyed the desserts, I had some pretty awesome tiramisu and the rest of my party had cheesecake.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YmhgTCBocizizzrQfZ7AyQ/348s.jpg", "caption": "Honey Wine"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TuqC0GuEG66JXFG1b1s-Lw/168s.jpg", "caption": "Family Style Messob"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lEYk6AF7E_ZT_nmwjivtZA/168s.jpg", "caption": "Tiramisu"}]}}, {"review": {"des": "One of the better Ethiopian restaurants in town, with a wide variety of dishes designed to be served family style. I would recommend coming here with at least one other person to split a messob, though you really can't go wrong here regardless of what you order.<br><br>We started off with the sambusas, which came with a delicious sweet sauce with deep notes of spices that were unfamiliar to me. Both the chicken and beef sambusas were excellent, and they cut them up into pieces to make it easier to share.<br><br>For the messob, we got beef, lamb, and chicken stews, along with sauteed goat, beef, and lamb. We mixed up the spice levels, though I would have to say we didn't notice much of a difference. All the dishes were great, but the beef stew and and sauteed lamb were absolutely incredible! The chicken was a little overcooked, but the boiled egg that came with it was delicious. Overall - a great experience for newcomers and seasoned vets alike.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RNDx0JameRMR582xYmSvZw/168s.jpg", "caption": "Chicken stew"}]}}, {"review": {"des": "Food: 4<br>Service: 5<br>Cleanliness: 4<br><br>Made a reservation for 8 on a Friday night, during Restaurant Week. Luckily there was availability! We got seated right away and we were greeted with bright friendly staff.<br><br>We did not opt for any of the restaurant week options since we all wanted to share. We got 6 entrees, 3 Meat and 3 Veggies. That was plenty!! Especially with tons of sour bread they give, you'll be full in no time. Though I wouldn't recommend eating it by itself, it was too sour for me, but depends on your liking!<br><br>The favorites were the Yellow Lentils and Lamb. Some of the green veggies were too tart paired with the sourness of the bread while some of the dishes seemed a bit too oily and lukewarm. Though all in all it was good since we took our time to eat it.<br><br>Would I come back? Yes", "pics": null}}, {"review": {"des": "The honey wine was something unlike anything I have ever tasted. It was smooth, rich and sweet. For our main, we got the veggie and meat combo plate for 2 people, and it was fun selecting our choices together. The best part of the whole experience was eating with our hands and absorbing the unique flavors! I love the berbere spice, and it is used in many of the dishes. The drink menu is very nice and offers a lot of South African wines, which is a huge plus for someone who loves South African wines! The service is very professional and friendly.", "pics": null}}, {"review": {"des": "Ladies and gentlemen, I just discovered my favorite Ethiopian place to eat. By now, you guys must know how much I love easily accessible restaurants as well as places walking distance from home. Y'all, this place is it. It is right off the Lawrence red line and its right there on the corner of Lawrence and Broadway.  I honestly couldn't tell u why I haven't been to this restaurant yet.... well I lied, I know why its because I don't have friends that like Ethiopian food. That aint gonna be a problem any more becaz I found me one ... yay me! <br><br>Anyways, the service was amazing. The waitresses were just too cool for school (got one on snap chat) and the ambience was great. The food is very affordable compared to Ethiopian Diamond ... I just had to put that other there. They equally had a variety of options to choose from. Wait, did I mention how cheap it was? lol Caz prior to going here I always thought Ethiopian food was crazy expensive.... thanks to Ethopian Diamond. <br><br>We used a <a href=\"/redir?url=http%3A%2F%2Frestaurant.com&s=c5fe485af4df376130bee54f875814d79c4d7913e1258123b1206d2bdbf4873b\" target=\"_blank\" rel=\"nofollow\">restaurant.com</a> coupon and I cannot wait to return to use my friend's T-mobile Tuesday coupon. Perhaps we are gonna come up with an Ethopian Tuesday theme caz imam be back. You best believe that ;)", "pics": null}}, {"review": {"des": "We had a great time at the restaurant. It's a unique experience! You receive thin bread that you use to scoop up and eat from the shared plates- no silverware! Service was fast. We were met with some backlash wanting to choose our own dishes for the family style instead of the chefs selection, but it all worked out in the end, and the food was great! Lots of fun cocktails and seasonal drinks as well", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pXWAI43clq8EZxJDHCkWyg/348s.jpg", "caption": "Beets, chicken, collard greens, one of the lamb dishes, beef alicha, shrimp, more collard greens"}]}}, {"review": {"des": "Delicious is an understatement! My friend and I came here for dinner around 8:00 pm on a Tuesday. Surprisingly enough, it was packed! You don't expect a business to be that busy on a Tuesday but they were slammed. To be frank, I was really surprised that they only had two waitresses and a server working at that time but everyone around us seemed to be happy so I assumed that the waitresses were super quick and responsive. The place looked very clean inside and there was street parking available! In fact, I think they have parking to the side of the building for customers but I was dropped off, so I would double check. In addition, this place is a block away from the Lawrence red light stop (no excuse not to take advantage of the experience)!<br><br> <br><br> We sat down and within a matter of seconds, the server provided us with water and said our waitress will be with us shortly. The waitress arrived but since my friend had just walked in, we needed a couple of more minutes to decide what to order. When we were finally ready to order, our waitress was occupied but the host noticed we were looking for a waitress so he jumped in instead to take our orders. Let me just say, homeboy snapped! He took our order by memory- super rare attribute in today's food world. We ordered the Demera Messob for two. This platter allows you to choose your choice of three meat dishes and three vegetarian choices from the menu.  From the veggies choices, I know for a fact that we chose the shimbra assa (spicy), quosta and yatkiltwat as our veggie choices and I think we chose the doro alicha, siga tibs and lega tibs as our meat sides. I could barely pronounce the names of those dishes nevertheless remember the names by heart! Shoutout to the host! In addition, we ordered a sprite and a coke. The food came out almost immediately. Be prepared to be amazed! For starters, the six dishes are served on top of injera.  Injera is a sourdough risen flatbread with a light spongy texture. It is the Ethiopian stable bread- made out of either whole wheat flour or Ethiopian teff flour (this is the gluten free option). Also, although the food is served with silver wear- in the Ethiopian culture, injera is the equivalent of utensils. I know- mind blowing. Keep in mind, you're getting basically sampling size of the food- enough for two people to share but believe me, it's a lot of food!<br><br>The food was absolutely delicious. I don't really know what I was eating at any point because it wasn't labeled (not that it was expected to be) but the quality of the food was fresh, tasty and flavorful. The chicken dish was probably my favorite- also they get bonus points in my book because all their chicken is amish chicken. The beef was a little spicy for my taste (call me a chicken, ok?) but the lamb was amazing. I wouldn't recommend getting the bone in because it ruins the experience. The Quosta was good but I wished it was more flavorful. I could barely taste the tomatoes but the ginger was heavy. The shimbra assa completely through me off because it totally looked like beef with its Berberbe sauce but it wasn't! The shimbra is ground chickpea dough- I know, I know, I bet you didn't even know such a thing existed until reading the menu! Yes, it's ground chickpea dough stewed in a rich berbere sauce. Really delicious! As for the tikle gomen- not your average chopped cabbage and carrots but definitely very tasty.<br><br>We couldn't even finish our platter but we did have traditional coffee and it was delicious! I would highly recommend this place!", "pics": null}}, {"review": {"des": "If you come here with at least one other person, the Messob is an absolute must and one of the reasons why I love Ethiopian food much. Demera was the first time I had ever tried Ethiopian food and it's such a fun experience. Yes, it's not just food - it's an experience. With the Messob, you get a huge platter of various dishes over Injera, a spongy and slightly sour (always makes me feel like they use lemon) bread. Don't worry, you also get a basket of Injera on the side. It's a necessity because that's what you eat everything with! And yes, you eat everything with your hands. :D<br><br>With the Messob, you may or may not choose which dishes are a part of it depending on which one you order. I know that for most of them, even if they pick the dishes, you can request a dish or two to be included. To that end, I strongly recommend the Doro Wot chicken (note that it's a little spicy). All the Tibs dishes are also great.<br><br>I have to take a star off because the service is consistently slow.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bTE7XAXWUJG2_UHXjtta1Q/348s.jpg", "caption": "Doro Wot. One of my faves"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MecVARsN8qpYZS9H9A4EFA/168s.jpg", "caption": "Demera Messob"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bz2c-wxlOiU0tGSTpZ-hwg/168s.jpg", "caption": "messob with a variety of yummy goodies"}]}}, {"review": {"des": "Very accessible menu options, including chef's choice family style choices with vegetarian and meat options. Great choice for a group outing. The staff is very friendly although servers seem understaffed and constantly on the move. It does slow down drink service from the bar. Nice choice  for a change of routine for dinner.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zgNlKor-0T10m5c-UoRqmA/348s.jpg", "caption": "House made honey wine. Try it!"}]}}, {"review": {"des": "First time here, first time tasting Ethiopian food and I'm glad it didn't disappoint!! Food is excellent and the servers are quite well trained to explain the food, taste and quantity for first-timers! They serve complimentary tea-demara shai which is fantastic...you won't stop drinking it. For the beer lovers, definitely try their St. George beer. The service is a little slow and if you're going over the weekend, making prior reservation would be a good idea.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PFmi-dlKwsmngwJ6zh_i4w/348s.jpg", "caption": "Complimentary Demara Shai Tea...(reallllly good)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/55jq9rEgI_XuadoO0qnaug/168s.jpg", "caption": "St. George Beer"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XQJisJHcQRvF5m_0I5X-nQ/168s.jpg", "caption": "Vegetarian messob for two"}]}}, {"review": {"des": "Visited with a party of 5 on Sunday afternoon.  When we arrived it was very sunny outside and slightly breezy so we decided to take advantage of the great weather and eat outside.  About 15 minutes in, it got cloudy and pretty windy and cold so we moved indoors.  The servers had a good laugh as they were betting on how long it'll be before we moved back in. <br><br>For 5 people we shared the appetizer messob, a 2 person vegetarian messob (try 6 different vegetarian dishes) and a 2 person Demera Messob (try 3 vegetarian dishes and 3 meat dishes).  It was so interesting as we got to try all 9 vegetarian dishes on the menu as well as 3 different meat tibs dishes.  Loved all the dishes, they were flavorful and interesting.  We left feeling completely full.  It's a great place to come with a group.  There were at least 2 birthday celebrations with 6+ groups while we had our dinner so Demera seems like a popular birthday restaurant too.", "pics": null}}, {"review": {"des": "Let me start by saying that I love Ethiopian Diamond.  It has been a rock steady go to since I moved north.  This place has the advantage of being much cozier and the flavors are broader and more nuanced than the average joint. Hints of smoke in the lentils and savory sambusas tell me that someone in the kitchen is an artist.  I just added another favorite Ethiopian place", "pics": null}}, {"review": {"des": "My first experience with Ethiopian food. I wasn't a fan of the injera bread but I'm not a fan in general of sourness. And the injera was definitely tart/borderline sour.<br><br>The meats and empenada type appetizer were good though. Lots of flavor and spice. I think I'd enjoy it more with rice rather than injera. Does that make me super Asian?<br><br>Plan for a long lunch/dinner here since it definitely takes time to get your food/get your order in. But that might just be a cultural aspect of sitting and enjoying the time and company.", "pics": null}}, {"review": {"des": "Had dinner here last night, already can't wait to go back for more! <br>The restaurant is bright, spacious, host is friendly and we got seated within 5 minutes. I'd highly recommend the honey wine, it's made in house and is an amazingly fruity white wine yet not sickeningly sweet. You can also up it a notch by getting the sangria, which I probably will try next time. Foodwise, we got the Messob sampler appetizer, which comes with 5 different sambusas, basically stuffed fried dumplings (very similar to Indian samosas). They were crispy and hearty, and the sauce that comes with it is a must-try. For main, we went for the family style Messob entree for 4 people, which was more than enough food for us. It is a big platter of 8 dishes (4 veggies and 4 meat) served on injera bread. I'm a huge meat lover, but personally, my favorites were the collard green and cabbage. If you are new to Ethiopian food, this messob is a no brainer, it'll satisfy your taste buds and give you the full experience. Overall, lovely dinner, like I mentioned, I'm planning my next one!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GKEVBJDAPah5w50aeztf9g/348s.jpg", "caption": "Family Style Demera Messob"}]}}, {"review": {"des": "AMAZING! Can't wait to go back. This is the beyanetu which came with literally every vegan option on the menu. I didn't even have to pick because I got to try it all. Also totally fair for the price ($17.95) Great service too! I heard it gets packed on weekend nights so make sure to make reservations.", "pics": null}}, {"review": {"des": "I never thought that vegetarian food could pack such a punch of flavor. The dishes and entrees have plenty of bold flavors and the style of eating is unique if you are up for a different dining experience. I have been to a couple of different Ethiopian restaurants now (three in Washington, DC) and they all seem to have similar styles. <br><br>The sponge bread that they provide you is usually served cold (I feel that it would be better hot, but maybe that's not how it is culturally served?) and has a slightly sour hint to it. After a while, the bread got overwhelming for me so I would recommend portioning how much bread you eat with the entrees. <br><br>Actually, looking back at all the Ethiopian restaurants that I went to none of the food was served particularly hot. Once again, I'm not sure if this is a cultural way of serving food that I'm missing but my preference has always been to have hot food be served piping hot. All in all, the flavors were good and the dining style of using your hands is unique if you want to try something new.", "pics": null}}, {"review": {"des": "First time I had Ethiopian food and I am officially obsessed thanks to Demera! Had a lovely family dinner there and definitely plan on going back.<br><br>Lovely atmosphere and perfect for a group outing!", "pics": null}}, {"review": {"des": "I've had a a lot of ethnic/cultural/rural cuisines in my life. But I'm not exactly a fan of experiencing them in big cities, USA. This one wasn't bad though. I'm posting this almost half a year from going there, but I do remember that the platter that we had was pretty fun, especially with the thosai-like bread it was served on. They had their own homemade honey wine (which I almost spit out), but that's because I don't like honey, and I went to the bathroom, let my girlfriend order, and what do ya know, honey wine. So I can't fault them for that. Also, I have no idea what I was actually eating because, again, Morganne did the ordering and I kind of zoned out there. But we had lamb, and chicken, and vegetables, and potato-things, and other odd fixins and all around, it was a good experience. The waitress was 3 thumbs up, and it wasn't too crowded. To be completely honest, I don't think I'll ever offer to come back, but I won't turn down an invitation.", "pics": null}}, {"review": {"des": "This was the first time for me having Ethiopian food and it was fantastic. The restaurant is nice and cozy decorated with murals and artifacts on the walls, very laid back atmosphere. Now the food was soooo delicious, its flavored with different spices that just excite the taste buds! I love spicy food and it was seasoned just right, there is just a touch of heat but not enough that your mouth would burn off which is just not enjoyable to me. Overall highly recommended, I would suggest making reservations because the place does get crowded fast.", "pics": null}}, {"review": {"des": "Having lived in DC, I've had a lot of great Ethiopian, but lunch here was among the best experiences I've had. We split a sampler of eight different menu items (chef's choice), all appealingly spread out, pinwheel-style, on a big round sheet of injera.<br><br>Didn't know what menu item each dish corresponded to, so I'm not going to write much more than this, but if you're adventurous (and have a big appetite), get the sampler!", "pics": null}}, {"review": {"des": "Pretty good food.<br><br>First time trying Ethiopian food and this place did not disappoint. This place isn't for the weak because you don't use utensils to eat - you use bread. Most people are afraid to touch their food, if you are that kind of person then you won't have a good time BUT if you are open to new experiences and eating the food the way Ethiopians eat it then this will be a great experience.<br><br>I had no idea what to get but the waiter was gracious and answered any questions we had.<br><br>We went with the one of the platters and just picked one kind of chicken, beef and lamb. I'm not the biggest fan of lamb, but they made it pretty tender. I liked being able to pick anything off the platter and eat it. Each bite was a new experience! <br><br>They also have gluten free bread! It's harder to be vegan or vegetarian since the protein is mostly meat unless you just want chickpeas, but that totally limits the flavors you can try.<br><br>Dessert was the basil lime sorbet. First time I ever tried a sorbet that wasn't rainbow. haha It was a very good end to a delicious meal.<br><br>I went back a couple of times because I really liked the food. So if you are feeling adventurous, dig spice and want to try something new then this is one place to go!", "pics": null}}, {"review": {"des": "If you want amazing Ethiopian food you need to check out Demera.  Everything is amazing and fresh.  I have yet to have something I haven't enjoyed at this restaurant.  I always get the lovely and amazing Amsale as my bartender and waitress and she is ON POINT!!! She knows the menu and does a great job gauging what she might think you might enjoy.  She makes amazing drinks as well.  <br><br>I suggest if you are in the area to check out Demera then head across the street to the Green Mill for some great Jazz music!!!", "pics": null}}, {"review": {"des": "My first time trying Ethiopian food and I feel spoiled!! Went on a date and our server was fantastic. My date is vegetarian and I prefer meats so we were advised to try a combination plate and each pick 3 dishes to try. They were all phenomenal and seasoned to perfection. The ambiance was perfect for a Friday night out and is located across the street from a cool live music joint. I would definitely recommend this place to anyone who loves food!", "pics": null}}, {"review": {"des": "Very busy around 930 on a Saturday night was a good sign. We waited 10 min for a table to be neglected for another 10-15. Once we finally got some service the food came out quick. We got the sambusa sampler which we both enjoyed. Then we got the dinner for two with chicken tibs and some sort of lamb. It was my girlfriends first time trying Ethiopian and she really enjoyed it. All the vegetables are amazing as well. If I was a vegetarian in a different very sad life I would love this place as the vegetarian options are great. We couldn't finish the platter for two even though at first glance I didn't think there was enough protein. Great location.", "pics": null}}, {"review": {"des": "Delicious! We arrived and were told that we needed reservations but a spot opened up at the bar! Our bar tender/server   was great and the food was so good! We ordered the cheese appetizer and it was to die for. The bar tender whipped me up an \"Addis Ababa\" and it was great! Perfect fall drink I think.", "pics": null}}, {"review": {"des": "Descent food you will love it. Try to order family combination dish to taste their special ingredients food. The picture i have below costs you $60. <br>It is the delicious dish they have<br>I really highly recommended", "pics": null}}, {"review": {"des": "Came here two days ago for a small birthday dinner. So delicious! For a table of 5, we ordered the sambussa sampler and the family style platter sampler, and had so much food we were stuffed to the gills by the end. With shared plates, you can always tell what the best dishes are by what disappears fastest, and for us that was first the Ye-Asa Wot (tilapia), then the Kik Alicha (split yellow pea) and third was the Tikle Gomen (cabbage and carrots).<br><br>I love Ethiopian food and am typically an Ethiopian Diamond loyalist but I think I'll make this place one of my regular spots.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XJBm5beZ2hnuq8yfaBoI9A/348s.jpg", "caption": "Sampler platter for 5"}]}}, {"review": {"des": "I really enjoyed this restaurant, it was my first time having a legit Ethiopian meal and it didn't disappoint. Waitress was so sweet and attentive and I enjoyed the atmosphere. The staff doesn't rush you at all they're very accommodating. Definitely would come back and order their spicy chicken dish it has like a curry of some sort and it's soooo yummy great place", "pics": null}}, {"review": {"des": "What a sh*t-show.  It's decent Ethiopian food. But there's much better Ethiopian here on the north side.  I just spent two hours trying to order through Grubhub, and then through Yelp, and whatever crappy, disorganized arrangement they have with the web-food-delivery system, they cancelled my order, I re-ordered, then they called back to say they were delivering my order, and then Grubhub called to say they cancelled my order.  (We'll see if we got charged...)  DONE with this place. Ruined our evening.", "pics": null}}, {"review": {"des": "Demera was my first experience with Ethiopian food, and it did not disappoint!  Our group of 6 got the family platter (minus the seafood, as one of us had an allergy).  I tried the honey wine, which wasn't quite what I was expecting (it was more sour and bitter than sweet, not bad but not what I thought).  Then the table split the honey wine sangria which was amazing!<br><br>The family platter was plenty of food for the six of us, and all of it was delicious.  Some of the items were a bit too spicy for my taste, but I'm pretty much a wimp when it comes to spice so I'm sure for the normal palate it would be good.  The best part was the bread that had been sitting under all the meat and veggies and had soaked up all the juices-very flavorful.  I wish I hadn't been so full so I could've enjoyed more.<br><br>Service was a little on the slow side, especially towards the end of the meal.  We weren't in a huge rush so it wasn't awful, but it was noticeable.  It also can get a little pricey, but you get a ton of food (at least with the family platter) for what you pay for.  I will definitely be back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sdm4QuYyiDrylqFLo2b9Ag/348s.jpg", "caption": "Family Platter"}]}}, {"review": {"des": "Amazing amazing Ethiopian food. We got the platter for two (which was enough food for 4) with all vegetarian dishes. The injera is spongy and delicious and they provide you with more than enough to eat with your food so I really appreciated that. Everything was super flavorful and each dish had its own unique spice. I would eat here all the time if I lived in Chicago. And you get to eat with your hands which is super fun! Come share a meal with friends here if you wanna try something new!", "pics": null}}, {"review": {"des": "Good, not great. This is a totally acceptable ethiopian restaurant to visit if you want to try the cuisine or to enjoy regularly as a local dining option. The only exceptional item was the teff injera. <br><br>To be fair, I have very high expectations for ethiopian food since I've eaten it at over 50 restaurants. I had kitfo with teff injera and sides of gomen, chickpea patties in sauce, and shiro. The injera was perfect, deliciously sour, properly spongy,  and sufficient holes to soak up the stews. The kitfo was very good but I felt like it was missing a flavor in its spice profile.  The gomen was good, again nothing exceptional but it fit the bill for a side. The chickpea wasn't very good, I was excited to have it since it has been years since the last time I saw that dish on a menu. I ate the chickpeas part but avoided the sauce which was mediocre at best, spiced but not in a good way. As for the shiro,  again good, not great I think it could have been a bit thicker/ fluffier. This shiro was a bit bland. <br><br>All in all, not bad, but only 4 stars.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EpDV8VgFH4QxmNzgQnmrYQ/348s.jpg", "caption": "Kitfo and three veggie sides."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HRc3K4tFz43Y18Rp-nsjgw/168s.jpg", "caption": "Interior"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dd78y_GTjWInqrHW-kWs2g/168s.jpg", "caption": "Honey wine sangria"}]}}, {"review": {"des": "Excellent customer service. They are all friendly and accommodating. <br><br>Their food is amazing. This was my second time trying out Ethiopian food. I love the fact that we use our hands to eat their food. It's very liberating! I'm Filipino so it's always a pleasure to use my hands when eating food! <br><br>Must try their special hot tea! Definitely will warm up your body in those cold Chicago nights!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Zry7lbL0T65TXscPPz6GmQ/168s.jpg", "caption": "Delicious dessert!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gIS5zQGK9KLxVjvVuIAMIw/168s.jpg", "caption": "Time to feast!"}]}}, {"review": {"des": "Amazing Ethiopian food. Service is great. Food is amazing. The owner is a beautiful and friendliest person we have ever met. #1 in Chicago.", "pics": null}}, {"review": {"des": "This place was amazing! Come hungry! I have been wanting to go here forever and I'm so glad I could. We got the family platter and it was more than enough food. The lamb tibs were perfectly cooked, and everything was seasoned beautifully. Even my fiancé, the pickiest of eaters, loved everything. The staff were very friendly and helpful, and the food came out so fast! We were in and out in 30 min, but that's because we were so hungry we ate super quickly. 10/10", "pics": null}}, {"review": {"des": "Not sure how anyone could not love this place. The staff members were sweet, lovely, and very helpful with figuring out the perfect sharing platter. Most of us had tried Ethiopian food in the past, and this went beyond what I've had before. I'm all about stews of varying sorts, and this place knocked it out of the park. Their vegetable stews are also amazing. Right off the L, so easily accessible as well. I'll be back for sure. Thanks guys, for a great evening.", "pics": null}}, {"review": {"des": "This place is a lot of fun! You get to eat with your hands. I recommend one of the platters so you can try multiple things. <br><br>The beef sambusas were amazing! And the cheesecake dessert was also unexpectedly really great! <br><br>Messy but a great dining experience", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qOQsaT_dUXsjP-ALwV4xgA/348s.jpg", "caption": "Mesob platter with different meat and vegetables."}]}}, {"review": {"des": "Fun selection of imported beers to go with hearty and flavorful food. Service was good until it was time to get the check - then our server had to be chased down a bit.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/43azkAI9R_Y7BYv8puKbgA/348s.jpg", "caption": "Michetabish and doro alicha were standouts"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6281IHrJRD5VsUG4cFOaGw/168s.jpg", "caption": "Ambasha with ayib be mitmita - hearty and slow heat"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JoITjjI4ik3XtyPMVJHRPQ/168s.jpg", "caption": "Crisp and easy"}]}}, {"review": {"des": "The food and vibe is definitely very authentic. We ordered the platter, exactly how I remembered Ethiopian food is like from a Ethiopian home.", "pics": null}}, {"review": {"des": "Excellent Food, excellent service.<br><br>First time trying Ethiopian food.  Got the Demera Meat Messob for 2.  Got the Ye-Misir Wot, Kik Alicha, Yatkilt Wat, Ye-Siga Wot, Doro Wot, and one more beef dish I can't remember.  It was all very good, and I was surprised at how good the chicken was!<br><br>Next time, I'm replying one of the lentil dishes with spinach!", "pics": null}}, {"review": {"des": "Food: (7/10) Came here with the gf for dinner before a concert at the Aragon Ballroom (which is under a 2 minute walk from the restaurant btw!). We weren't super hungry so we split the Demera Messob for 1 (2 meats, 2 veges). Unfortunately they have a $5 \"sharing cost\" - which was a big bummer, especially since the platter cost almost $25 when all said and done, before the fee. Highly recommend the ye-beg wot (spicy lamb). I've only had Ethiopian food once before but this was easily the better injera (bread) - big portion.<br><br>Service: (4/10) We were running a bit late so we were pleased at how quickly we got seated, even on a busy Friday without a reservation. However, the whole time, our waitress was not particularly polite and almost looked annoyed at us being there. When we got the menu, we told her this was our first time trying Ethiopian and clearly asked for recommendations. She replied with a \"I'll be back\" and then left.. okkk. Maybe she was having a bad day but the rest of the meal she just seemed cold and had no interaction with us. Definitely one of my worse service experiences.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WMkpiPYCqy7lVuOguFmqLA/348s.jpg", "caption": "Messob platter with cabbage and carrots, mixed veges and potatoes in Demera sauce, pan fried beef, and bone-in lamb"}]}}, {"review": {"des": "First time here at an Ethiopian restaurant in Chicago. I like that there is plenty of seating and the decor is a nice nod to the Ethiopian culture. <br>I got the four meat special: Yebeg wot (lamb), Doro wot (chicken), zilwa ribs and the beef ribs. All spicy and good. I had enough injera too. Even though I usually like the real teff dark grey injera. I was full and the salad was good. It is more than enough for sure. I wish I had a little bit more sauce/wot in all of them. I liked the woven basket the injera was served in.<br>Especially the doro wot (chicken with boiled egg) The staff was friendly and I did not have to wait long for my food. I went around 7pm on a week day so it was not too crowded and I had ample seating. I liked the decor, and also that they were playing Ethiopian music which to me just adds to the true experience and culture.  <br>I wish they sold the berebere chili powder to you can buy it and take some home:) I have seen that sold at other restaurants.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XkzqnA6u322sAT57JuX5SA/348s.jpg", "caption": "Love the art work that covered the ceiling lights so it lit up! Have not seen that at any other Ethiopian restaurant!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YTtUXuQRcodM8OFU-3Pgjw/168s.jpg", "caption": "The staff are friendly and fast too! Did not have to wait long for my food."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/boFpAl068ptopOlEuDEx0g/168s.jpg", "caption": "Nice atmosphere"}]}}, {"review": {"des": "The best Ethiopian restaurant I have been to. Simply put, there was not one thing I didn't like. If you are unfamiliar with Ethiopian food, you can share multiple stews with a group, all eaten with injera (a type of sour flatbread). I came with a group of 5 (one was a vegetarian so ordered his own vegetarian dishes). The four of us split what seemed like 10 dishes, and it was all served pinwheel-style on a delicious big piece of injera. YUM! I don't even know what to recommend, it was all so good. Highlights were the Kik Alicha and their lamb dishes, but I do not  think you can go wrong here. Lots of vegetarian choices as well. Our server was super sweet and made our dining experience enjoyable.", "pics": null}}, {"review": {"des": "Came here for a date night and we were pleased. We heard the wait is long, but it was well worth the 20 minute wait for them to get our table ready. <br><br>We started with the sambusa. Crispy and flakey on the outside with a nice flavorful filling. Similar to an Indian samosa, which I love, so this hit the spot for me. <br><br>Our main course was the vegetarian platter. We tried a variety of the vegetarian dishes. It wasn't like other Ethiopian places where all of the dishes tasted the same. They all had their own distinctive taste. My only complaint was that I wish some of them were spicier, but that's just my personal preference. <br><br>Service was great and our waitress was very attentive. <br><br>Definitely recommend trying this restaurant!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xuZHcAbuJcLmAqfUVpM7cQ/348s.jpg", "caption": "Vegetarian Platter"}]}}, {"review": {"des": "This place is great! I love Ethiopian food and they never disappoint. I eat here about once every 2 weeks. Vegetarian messob very time. Portions are nice and taste is always consistent. I get delivery and it's always fast and still warm.", "pics": null}}, {"review": {"des": "I came here with my boyfriend and my family for dinner the other night and we had a great experience. We were quickly seated, our water cups stayed full, and the food came out in good time. We did the shared meal at $15 / person for the 5 of us. It came with plenty of bread (more than we needed!) and a variety of foods to pick up including peas, shrimp, chicken, beef, lamb, some type of greens, and beets. <br><br>I had never tried Ethiopian food before so I was looking forward to coming here. I personally did not like most of the dishes and was a little put off by the sour taste of the spongey bread (although the texture was fun!). I still give Demera 4 stars because although I did not personally like the food, my family did. That is just my taste preference. <br><br>You eat this food by ripping up pieces of the bread and using it to grab the protein dishes. Very hands on. My mom asked for a fork and they gave her a little flak which was pretty funny, but the server was not rude in any way. Just joking around.<br><br>The overall consensus at the table was that it was a great meal. If you are feeling adventurous, even if you do not end up liking it, Demera is a place to try!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sEDMa9opXcgvbu9tnB4ypQ/348s.jpg", "caption": "family style meal $15/person for 5 people"}]}}, {"review": {"des": "Beautiful atmosphere, art, food and nice staff. The food was exactly as described and worth the price! The table next to us was very difficult and the waitress handled it very well! We sat outside and they had a very nice patio and pretty lights. One of the best Ethiopian places in Chicago for sure!", "pics": null}}, {"review": {"des": "Over rated. Food is okay, but not amazing. Service is good. Servers are friendly and gorgeous. Food is okay but nothing to write home about. Honey wine is good but strange texture that I", "pics": null}}, {"review": {"des": "It was SO good! Sometimes its difficult finding places I can find vegan food that my husband also enjoys. This place fit the bill. <br><br>We had never had Ethiopian food before and our server was very helpful and patient. She suggested I get the vegetarian plater with a bit of every thing on it. It was the perfect choice for my first time. The Shai tea was the perfect accompaniment.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8KrTEoWHfuQdWfZ2zbQ7WQ/348s.jpg", "caption": "Vegan!"}]}}, {"review": {"des": "Amazing food! I would keep coming back here. Ras Dashen is our go to but it might have fallen to second on our list after eating at Demera.  The food was perfectly spiced. Everything we had was so good. We ordered the meesob for two which is three meat and three veggies of your choice. It was perfect for two.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6IntzGsw5mn2DwBiwIXPSA/348s.jpg", "caption": "Meesob for two"}]}}, {"review": {"des": "What an amazing restaurant. The service was great. The food was great. We had a full course meal as a special date. It did not disappoint. They had some gluten-free menu items. Make sure to let your server know if you need that. They had some vegan and vegetarian-friendly. The app was really good and the server was more than happy to inform us or recommend something to us. <br>It was a really great date night. I have photos I will upload in a little.", "pics": null}}, {"review": {"des": "Demera popped my cherry...for Ethiopian food.<br><br>STOP - who was hiding you from me???? Probably my complete lack of understanding of Ethiopian food.<br><br>I live two blocks away from Demera and it's so hard walking back from the Lawrence red line every day from work and resisting the temptation to order some take away for home. <br><br>The first time we dined here, it was a quiet night and our server took the time to explain to us the different selections, but of course we ended up with the Chef's Selection. <br><br>The tilapia??? And chicken?? I literally can't even. The food was amazing, the waitress amazing (she even gave us free tea and dessert).<br><br>Gosh darn it. I'm going back and there's nothing you can do about it.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gbVjQKcHPqkg7QmUvfxPGA/348s.jpg", "caption": "Chef's Selection"}]}}, {"review": {"des": "Loved Demera, it's a solid 4.5 stars. <br><br>Went in for lunch on a Monday afternoon. Place was pretty empty, we were seated immediately.  <br><br>We made it in time for the lunch specials. And boy, what a great deal!! Our final bill for two entrees was about $17. That's the least expensive Ethiopian meal I've had at a restaurant! <br><br>The restaurant has a cozy feel. They also have semi-private outdoor seating.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dhrAjNmXc6naqkXU2zGqTg/348s.jpg", "caption": "Interior"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NYHnMvmHsue8-ZzJEiiUUQ/168s.jpg", "caption": "Interior"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/apPpKHLoxaaMzT1rHuFF0w/168s.jpg", "caption": "Yummy Spaghetti with ground beef!"}]}}, {"review": {"des": "Great interiors, super nice waitress. Live music. <br>The food is so fulfilling that I can't finish half of it. The spicy oil that they put in all the cheese and stews? It's amazing!!", "pics": null}}, {"review": {"des": "Overall: Great way to experience Ethiopian food even all the way in Chi. Left full and happy.<br><br>The good: Plenty of injera to go around for spreading the awesome array of meats and veggies from our family platter. The potatoes, beef, lamb, lentils, etc. were all great in their own way. Sambussa were also crispy and tasty on the inside. Dessert was also fantastic.<br><br>The bad: Service was a little slow at times, and they only had 1 of the African beers available on the list. No seafood on the platter we got.<br><br>Atmosphere: 8/10<br>Service: 8/10<br>Food: 9/10", "pics": null}}, {"review": {"des": "Excellent. We like Ethiopian restaurants a lot and this is our favorite so far. We got a combo of lamb, beef, cabbage, and yellow peas. All very good. Nice place with good outdoor seating.", "pics": null}}, {"review": {"des": "We do always order to go and always pleased with taste. Friendly service and helpful stuff. Will planning to stop by soon.", "pics": null}}, {"review": {"des": "The food was outstanding, the staff was welcoming and helpful in explaining the different menu options, and they have a great variety of vegetarian friendly dishes.<br><br>I would recommend the house honey wine, sambussas, and any of the excellent spread of vegetarian entrees.<br><br>If you're looking for a unique dining option and high quality food, this is the place!", "pics": null}}, {"review": {"des": "This place really fills up! We got in for an early dinner without a reservation, but I would recommend reserving. <br><br>The food here is solid. Good variety, portions, and reasonable prices. You will be stuffed. I would say the quality is generally comparable to other Ethiopian restaurants I've tried (though I will readily admit this is according to my amateur tastebuds with regards to Ethiopian food). The staff is super friendly and fun although service can be a bit slow when it's crowded. I would probably stick to the meat and veggie dishes. The seafood was a little underwhelming/light on actual seafood.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9ps49Bn1NPTTPh-EGojW2A/168s.jpg", "caption": "The sauce was probably the best part. I would be hard pressed to ever forgo dessert, but probably wouldnt order this again. It was just ok."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/telRewwVD9D4BDkDF55I4Q/168s.jpg", "caption": "One of the sampler platters"}]}}, {"review": {"des": "$10 or less LUNCH SPECIALS are still excellent!  SpringRewards.  OpenTable.  The one and only romantic Ethiopian Restaurant in Chicago.<br><br>LUNCH COMBO serves one with 4 choices: 23 Kik Alicha, 25 Gomen, 38 Ye-Siga Wot, 40 Mitchetabish Alicha (mild).<br><br>ETHIOPIAN COFFEE POT is ridiculously authentic.  Serious caffeine.  *wink*  Demitasse.<br><br>SERVICE with Tigi is take-your-time.  Generous, Kind Lady.  For the first time, she poured coffee for us.  Hospitality.<br><br>VENUE is always clean, organized, white table cloth, red napkins, decent silverware.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EsMpV29Z-pzdl0eY9t7u9A/348s.jpg", "caption": "Honey Wine"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AYFntAd7ac30-lfvVTTGVw/168s.jpg", "caption": "Traditional Ethiopian Coffee"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aU8PTZRP_VIXdvjq63O2HA/168s.jpg", "caption": "Lunch Special Menu 2 (8.2016)"}]}}, {"review": {"des": "I absolutely love this place!!<br><br>I am vegan and gluten-free but have no trouble finding dozens of options here. I usually get the teff injera, because it is gluten free, and then the cabbage, spinach, collard greens, yellow split peas, and lentils. You get 4 choices if you get a solo veggie meal, which comes with a salad. <br><br>-The wine selection is great.<br>-The staff is so friendly and accommodating. <br>-Location is awesome, especially if you're gonna head over to the GreenMill for a show. <br><br>Go here!", "pics": null}}, {"review": {"des": "Excellent, friendly service.  Plenty of vegetarian options.  Be prepared to eat with your hands!", "pics": null}}, {"review": {"des": "I enjoy Demera, but have since found better Ethiopian food. It's very nostalgic, since this was where my boyfriend and I had our first date. Aside from the nostalgia, it's relatively good food for the adventurous spice lover. The prices are also very reasonable! I believe the messob plate is around $30. However, this place (as well as most of the Ethiopian restaurants!) are ALWAYS on Groupon, so you can save more money :) The groupon voucher, ~$40 for 2 people includes an appetizer or dessert, a combination messob platter, and a bottle of house wine, you can't beat that! Just remember to tip your waitress on the price of the original dinner. <br>My appetizer recommendation here are the lentil sambussas (although you only get 2 pieces and they're not very big). They come with this delicious, spicy, sweet sauce unlike anything I've ever tasted before. I googled the sauce and it's called \"awaze.\" If they sold packets of this sauce, I would totally buy it.  It's made with berbere seasoning, honey, and a small amount of liquor I believe. The spice and complexity builds and makes for a tantalizing experience unlike anything I've ever had before. <br><br>My picks for the messob: <br>ye beg wot (spicy) cubed, bone in lamb marinated with delicious spices<br>I also adore the beets (kayseer ena carrot tibs)<br>kik alicha (yellow lentils)<br>gomen (collard greens) <br>ye misir wot (spicy) red lentils<br><br>don't be afraid to eat the deliciously greasy injera that soaks up all the goodness of the sauces. In fact, we ate our injera \"plate\" until it was sparkling clean. No shame.", "pics": null}}, {"review": {"des": "I was actually very impressed by this place! Clean, bright, and very friendly! The drinks were very well mixed and they had a pretty impressive beer and wine list. <br><br>The food is the real star and the restaurant was very accommodating when it came to some shellfish allergies! Certainly the best Ethiopian food in the city! <br><br>Highly recommend it!", "pics": null}}, {"review": {"des": "The staff was very friend and attentive. The food was really good, and it seemed really fresh. We had the Family Style Messob, the food is served in one big plate on top of one big Ijnera, and we have to eat/share from it.<br>All the curries were really good, and tasty. My only issue was with Injera, it is served cold, really cold. I thought Injera is served alteast luke warm, if not directly from pan to plate. Apart from the cold Injera, everything else is really good.", "pics": null}}, {"review": {"des": "Came here last week with my girlfriend and absolutely loved it. I love that they explicitly state what options are vegan and have gluten free injera as well. Very reasonably priced. Everyone was so friendly and our waiter really polite and helpful. Only my second time trying Ethiopian food but I can assure you I'll be coming back as often as I'd like. Thank you for a great experience!", "pics": null}}, {"review": {"des": "Ate here with family after they helped me move into my new apartment, a couple of blocks from here. It had been many years since I had ate Ethiopian. Staff was very friendly, and our server had no problem explaining the menu to us a couple of times.<br><br>I ordered a mango flavored cocktail.  Fresh sliced mango, mint, and a good amount of liquor.  <br><br>The two people I was with are gluten free and they were happy to provide GF injera bread to eat with.  I ordered two veggie and two meat options, all four of which were delicious.  Fair warming, everything was *relatively* spicy.  The two things I ordered that were marked as spicy and as not were equally hot, even the salad was spicy somehow.", "pics": null}}, {"review": {"des": "I took a group of 13 students here the other day for lunch while on a field trip. Demera was so good about accommodating our group. They accounted for all food allergies, specialized for vegetarians in the group, and were flexible about the billing process. We are so grateful for Demera's hospitality.<br><br>As for the food, it was both mine and my students' first experience with Ethiopian food and we all thoroughly enjoyed it. As a vegetarian, I loved the lentils (both red and yellow) and the greens. My students, loved all of the meats (lamb, beef, chicken) and the red lentils. The appetizers (Sambussas Sampler) were a crowd pleaser- and the students were surprised to like the spinach and tuna ones so much. <br><br>I live nearby and will definitely be back to this restaurant!", "pics": null}}, {"review": {"des": "Demera made it possible for me to have a very pleasant experience in trying Ethiopian food for the first time. My friend and I made reservations for Restaurant Week on a Monday at 5:15pm. There were a few tables occupied already when we got there. We were greeted warmly and seated immediately. As first timers with this cuisine, the menu could be overwhelming specially with the terminologies. We decided not to order from the RW menu and get the deals from their regular menu instead. We asked our server for recommendations on what to get for the Meat Messob for 2 which was $38. She explained how each meat is cooked and what it comes with so this was very helpful and we decided on mild heat level to be on the safe side. We decided on lamb, chicken, ground beef, beef strips, shrimp and fish. Each protein was cooked in different sauces and various ways as well. My favorite is the lamb, it was very tasty. I wasn't a big fan of the ground beef but my friend liked it. The Injera, which comes with all Messob orders, is a \"sourdough crepe-like bread\" that you could dip, wrap a protein or vegetable with, or just eat it on his own. <br>Eating Ethiopian food requires eating with our hands although if you're uncomfortable with the idea, the servers will happily give utensils if you ask. My friend and I savored our dish and enjoyed eating with our hands as well...to feel the authenticity of what we were having.<br>Overall, it was a great Ethiopian cuisine-first-timer experience for me. I cannot say about how good the food is, compared to other Ethiopian restaurants because this is the only place I have tried this cuisine. The interior is simple and the place is clean and well- kept. Our server was very helpful, so happy to be of service, we did not wait long for our food to  come even if the place was filling up, our dish was very satisfying and experiencing Ethiopian cuisine at Demera is as authentic as it can get...in my opinion.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HD0WQeKlfy9U-PqDTVMl8Q/168s.jpg", "caption": "Meat Messob For Two up close(Lamb, ground beef, shrimp, fish, beef strips and chicken with veggies at the center)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9TaGW3w1MfGdetsS0awFQA/168s.jpg", "caption": "A basket of Injera(T) and #16b Meat Messob For Two $38"}]}}, {"review": {"des": "For my first try of Ethiopian cuisine, this place was exquisite. From the get go, the staff was pleasant and accommodating. Looking to escape the brisk weather, I asked if I could sit for 30 minutes before my reservation. The hostess asked for a few moments and had my table ready immediately. The warmth just continued from there as I ordered a delightful pot of chai. While the appetizers were quite lovely (lentil Sambussas, absolute perfection), the vegetarian platter intended for two stretched to three very hungry dinner patrons. With an extra order of ingeras (the fluffy, spongy sourdough flatbread), we were able to sample eight different Ethiopian dishes on a single \"plate\" (which was really just another ingera stretched out over a metal serving platter.) I have to give credit to restaurant which utilizes every single drop of flavor by creating an edible serving dish. <br><br>A bit pricey, but worth the dollar signs given that this restaurant is Michelin recommended. Be sure to make reservations! I made one a few days in advance at 7 with no problem at all. Even at 6 on a Thursday (while walking by), there seemed to not be too much of a rush.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nkEqygV846joX0LG32WLuw/348s.jpg", "caption": "Vegetarian platter. YUM!"}]}}, {"review": {"des": "Not so great! Service was horrendous if your service is bad that means everything.Food decent.", "pics": null}}, {"review": {"des": "It's simply the best Ethiopian food I've ever eaten. We've eaten at the restaurant a few times and service is good, and the staff is very pleasant. I've ordered for home delivery a few times and the food is just as good as when dining in the restaurant. If you like Ethiopian food, I highly recommend this place. If you've not had Ethiopian food, I highly recommend this place.", "pics": null}}, {"review": {"des": "Can't say that Ethiopian would normally be a craving for me. But I would not turn down a visit to Demera. We've entertained out-of-town guests here. Casual, dressy, decor with warm, friendly, helpful service by enthusiastic waitstaff. At the northeast corner of Lawrence and Broadway, it's within staggering distance of the Red Line but we've never had an issue finding a parking spot close by on the street (your experience may vary in this regard).<br><br>We like the family style method of eating, so the traditional presentation/dining is the only way that we've used here.<br><br>From omniverous to vegetarian, all can find many things to enjoy. One word of advice, the meal is served on a large flatbread: Don't leave the flatbread, it's soaked the flavors & spices of your meal and is usually the best part of the (or a later) meal.", "pics": null}}, {"review": {"des": "It was okay. Really pricey for that amount of food. It is more or less the same price, but longer wait time than another Ethiopian place.", "pics": null}}, {"review": {"des": "Yes! What a great date night! We arrived just after 5pm on Saturday night. The host asked if we had a reservation; we thought he was kidding when he said he'd try to squeeze us in to the practically empty super cute restaurant after we said we did not. Low & behold, by the time we were licking our dessert plate clean, the place was packed full & there was a line almost out the door! <br>No utensils! Get ready to feast & dive into a variety of unique dishes & don't forget to try the honey wine--Very complimenting!!! <br>I'd say, bring your appetite & make reservations!!!", "pics": null}}, {"review": {"des": "We came here on a Saturday night with a group of 16. We had made a reservation after looking online at what was close to the house we were renting. <br>A reservation was definitely the way to go! They were ready for us when we got there. No waiting necessary!<br>The ambiance lays somewhere between casual (inherent in Ethiopian dining + the lighting/decor) and fancy (cloth napkins and table cloths + wine + price).<br>I think our server might have been a bit overwhelmed by having such a large group, but did a good job staying on top of things.<br><br>We ordered a few bottles of their honey wine, a bottle of red, a few beers, and pitcher of the honey wine sangria. We also ordered a few sambusa samplers (5 sambusas each, one of each variety) and the family-style sampler for all but one of us ($15 per person over 8 people).<br>The food was simply delicious! And there was SO MUCH OF IT. The lentil sambusa was my favorite of the appetizers. I liked everything on the main dish sampler, but my favorites were the beef, the yellow lentils, and the cabbage & carrot stuff. The honey wine might not be to every person's taste, but I quite enjoyed it (I like sweet wines). They boxed up the leftovers for us, 5 boxes worth with plenty of extra injera. Overall, a great dining experience!<br><br>If you are in the area, and are adventurous enough to try Ethiopian food, this place is great!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pLF0NKDoOmzR3KhTlOrFmg/348s.jpg", "caption": "Family style for 13 people. One platter of 4!!"}]}}, {"review": {"des": "I was visiting Chicago and had a craving for Ethiopian. Stuck at our Air BnB babysitting so had to take out. Delivery was a great option through grub hub - affordable and fast. Quantities were generous and flavors were wonderful. The vegetarian options were bountiful. I've never had so many options where we are in San Diego. My son loved the spinach and the spinach sambusas, even though the latter were a little spicy for him - he still was able to eat the whole thing. Also tried the beets, yellow lentil alicha, red lentils (spicy, but not overwhelming) collard greens). I also loved the option for gluten free injera. I also loved that each portion came with the option for two other vegetarian sides dishes, so you could get a sampling of other flavors. I also liked that the flavors were not overwhelmed by too much heat, just great flavor. Wish I could try this place a few more times to try a couple more different combinations. If you're in town, give it a try! You won't be disappointed!", "pics": null}}, {"review": {"des": "Yum, yum, yum! The parental figures were raving about this place so \"Lets do this\"! First off it is a very charming restaurant. Nicely decorated and the tables are not crowded. Our server was super nice with an easy smile. Also - the bathroom was neat & tidy... that is a pet peeve of mine & makes me wonder what is going on in the kitchen if they can't keep basic hygiene in there. I did take a star off for one soap dispenser being empty. It should only be 1/4th but Yelp is 1 and done on the stars. <br><br>We ordered the safe choice with the family style Messob. It's a mix of 4 meats & 4 veggies. The parental figures mentioned how much they liked the spinach so please make sure that is one of the veggies. Our server was so sweet that she made sure to get them a generous helping of spinach. Which I agree was really good. <br><br>This was the first time I've ever had a spicy salad and I eat a ton of salad. If anything I am a chopped salad connoisseur lol. Note to self... need to start a Yelp list. Ok back to our delicious meal. My fav was the lamb, lamb is a very strong meat and they spiced it perfectly. 2nd was the beef then chicken. I was surprised that my 4th was the seafood. For the veggies I really liked the lentils both the Misir Wot (spicy red) and Kik Alicha. I don't remember what the 3rd was but it was pretty good. I didn't try the Tikle Gomen - for some reason it looked like Kim Chee to me and I was gonna be taking the Red Line home & that seemed like a gamble lol. <br><br>I also tried the tea & it is very Chia like and delicious.<br><br>All in all I would definitely recommend and go back. & now that I know what I like I'd probably just order those. They also have a very friendly menu with a glossary of terms to let people who are not familiar with Ethiopian food understand it better.", "pics": null}}, {"review": {"des": "I went during restaurant week and they had the best deal! We had plenty of food and a bottle of wine. Def wanna go again!", "pics": null}}, {"review": {"des": "Food was good, Definitely more on the expensive side. We ordered 2 Veg platters with 9 dishes each, Loved the Misir Wot & Salad.", "pics": null}}, {"review": {"des": "Irresponsible and rude manager(bald guy, don't know his name). I have never written any bad reviews till now!<br><br>My experience <br>We ordered chicken samosas & ordered other full corse meal and we always mention the waiter that we have NO BEEF & NO PORK.<br><br>We received our appetizers i.e \"chicken samosa\" <br>And when I had it, it was beef samosa, called up the waiter and asked her did we mention that we have no pork and beef she said, \"yes mam I know you ordered jus the chicken samosas\" then we showed her the samosas it was the sampler which includes spinach, lentils, chicken, tuna & beef. <br> <br>The manager came to the table and told us that this  happens all the time and blamed us that we should mention meat restriction while ordering. Forget about making effort to make up for the mistake, he sounded rude and asked us to leave. <br><br>A experience to remember. Thank you Demera for a great evening!", "pics": null}}, {"review": {"des": "This food is delicious! I get take out here so often that they know me... Don't let the lack of silverware scare you away! The cabbage and carrots and yellow split peas are my favorite. <br><br>Conveniently, it is very close to the Lawrence red line stop and the Green Mill.", "pics": null}}, {"review": {"des": "My wife & I came here with some friends who have visited quite frequently. Kudos to them. The food was delicious. An exotic taste. Interesting that the food comes out for everyone to eat on one dish. I'm sure you could order differently. But that's the route we went. Once you bite in, or shall I say once we bit in we were pleased. Our waitress was helpful, patient and friendly. So if you have a taste for some different food other than the usual. Stop and bring some friends. It's a pretty cool place to get together.", "pics": null}}, {"review": {"des": "Delicious Food, Very clean environment,conversation friendly, very good and friendly service. Our first experience with Ethiopian Food and we'll definitely be back.  Oh yeah, very reasonably priced. Lots of drink choices. Loved the coffee.", "pics": null}}, {"review": {"des": "This is one of the only Ethiopian restaurants I've tried and I keep coming back! <br>The servers are very laid back and they will take their time if you take your time on deciding what to order. <br>The best advice I could give us, tell them you want a Messob plater (you can select from all vegetarian, all meat or a combo). They'll select some options which I believe is what the chef recommends. <br><br>Our Messob plater had 8 items on it. All of which were of unique flavor, ranging from a sweet savory taste to a nice spice taste. <br><br>We also got their in home honey wine. Very mead like.", "pics": null}}, {"review": {"des": "This is my favorite Ethiopian restaurant in the city! The food is amazing and authentic, the restaurant is comfortable, and the service is good! Everything you could want in an Ethiopian meal!", "pics": null}}, {"review": {"des": "Love the food. Every time I walk away feeling like I've consumed a hearty and wholesome meal. It takes quite a while before a server will come to take your order, unfortunately. Min 10 minutes, even on an empty lunch hour (when you've only got an hour). If they could fix this one piece, I would easily recommend this place as a top 5 go to in the city.", "pics": null}}, {"review": {"des": "We came to this restaurant on Friday around 6:40 and about 10 min after we took our seats, the restaurant filled up, so definitely you should make a reservation if you go on Friday night. <br><br>We got the sambussa sampler, which is a samosa, a pie-like sheet with spinach, tuna, chicken, lentil and beef fillings. Everything was so tasty, it's a good way to try Ethiopian food. <br><br>Then we had no.18: demera messob (selection from all four options lists). This one comes with choice of 6 options with at least 3 vegetables. As for vegetables, we chose no. 21 ye-misir wot, no. 25 gomen, no.29 kayseer ena carrot tibs. The first 2 were good, but the third one was a little too sweet, so I didn't like it. Also we chose no. 31 legal tibs, no.52 ye- shrimp tibs, and one more with beef, but I forgot the name. Everything was really good, you won't really go wrong if you choose between beef, chicken, lamb and seafood. <br><br>Anyway, the reason why I put only 2 stars was that first of all, you have to eat with a crêpe-like thing if you choose this great combo plate but I became bored quickly with the taste of crêpe. Also it tastes somewhat sour so I didn't want to eat with it. Secondly, the waiter didn't show up soon after we arrived, so we had to wait for a long time (at least it felt long) to order drinks and food. Finally, we were asked to move to another table so they could seat 8 people, but I feel that they should have thought about it when they were seating us. So overall, the food was good but the service was not that good even though they politely apologized for the late service and having us move.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2ZPaigMpjchV79Y75tI5sQ/168s.jpg", "caption": "No.18: demera messob ( select from all four option lists.) You can choose 6 options but 3 of them should be vegetables."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9moQfWVKUJWlwYZaAnYKLg/168s.jpg", "caption": "Sambussa sampler. Everything was tasty, worth trying!"}]}}, {"review": {"des": "We had a number of friends in town for a week, and after a long talk, we landed on Demera Ethiopian because it met our insanely long list of needs. A short walk from our AirBnb, and we were greeted warmly by the owners (??) and led to our table. They were insanely accommodating and made a reservation for 11 people in just about an hour, which was much more than many other places were willing to do. The restaurant was busy. It was after 7:00 on a Thursday evening, and they had a very steady crowd all evening. <br><br>Service was a bit slow, but the food was delicious We had 3 platters served family style. I ended up with the vegetarians and vegans in our group, and I didn't miss the meat and fish at all. The red lentils were perfectly cooked and a bit spicy. The yellow lentils were fantastic, and the mixed veggies were really, really good. I didn't care for the collard greens, but that was the only portion of our platter that I did not like. <br><br>The staff was friendly and helpful and kept our drinks full all night. The restaurant is tastefully decorated, and the tables aren't piled one on top of the other. This is a great spot for groups or dates.", "pics": null}}, {"review": {"des": "Pros- good ambiance, polite staff, quick service, decent food.<br>What can improve- on the pricier side<br>Recommendation- try not to order more than 2 Wats. All the Wat base gravy tastes similar.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/x7qV3aGHN_doSX_hDHVn8A/348s.jpg", "caption": "Platter with different Wats"}]}}, {"review": {"des": "This place is top notch Ethiopian grinds. Sadly, here in the states you can generally only find Ethiopian food in big cities. When I travel, my first move is to scout the best Ethiopian joints wherever I go. Demera is in my top three. Each and every bit on our platter was on point. Wait staff was friendly and attentive. Can't wait till our next chicago trip to head straight back", "pics": null}}, {"review": {"des": "I grew up eating all kinds of food. Puerto Rican, soul food, Mexican, Chinese, Pakistani, Indian, Thai, and Ethiopian among many others. I eat many more as an adult. And yet it had been at least 12 years since I'd last had Ethiopian food. So when a friend mentioned Demera I was on board.<br><br>Now. It's hard for me to compare what I had so long ago with what I ate at Demera. I remember the doro wat being really spicy, but Demera's wasn't too bad. Injera was as I remembered. Mostly the food was really good. My favorites were the shrimp and the chicken, and the collard greens and lentils. The service was solid, though the waiter never asked if we were familiar with the food or communal eating. Maybe we seemed too self sufficient.<br><br>The menu is widely varied with many vegetarian and meat options, and a nice wine and beer list.<br><br>In any case, next time I've got the urge for Ethiopian food, I know where to go.", "pics": null}}]}