{"name": "dimos-pizza-chicago-2", "reviews": [{"review": {"des": "Best pizza by the slice i've ever had. Right on the mainnnn drag of <br><br>The ville. I got the buffalo chicken i do declare.", "pics": null}}, {"review": {"des": "I've ordered pizza from here a few times now and it has always been delicious. Today, however, was a different story entirely... <br><br>My husband and I ordered our pizzas at 6PM, and were given a confirmation that they would be here by 7:06PM. But, no... I was instead forced to call around 8PM to ask where our pizzas were. When I called, I was given an apology and told that they were short staffed and that our pizza was leaving the kitchen to be delivered. Okay, great, I guess... I'm starving. <br><br>But, then I had to call a 3rd time at 8:30PM to find out where our pizzas were... only to find out that they NEVER LEFT THE COUNTER! Ridiculous. A different guy kept apologizing and eventually offered a refund, with pizza still arriving... When the delivery guy arrived after 9PM, however, we were given a card for 2 free slices instead. To top it off, the pizzas were borderline cold, with burnt outer crust and an undercooked middle. What the hell... <br><br>Now, I feel like this place just stole $40... I'll take your 2 free slices, but you've lost customers for life. I'm insulted.<br><br>TL;DR<br>It took 3+ hours to get 2 pizzas, after being lied to twice of when they would be delivered. The final result was less than desirable pizza for $40.<br><br>The lesson? If you're really hungry for some pizza, go somewhere else.", "pics": null}}, {"review": {"des": "This is still a really good place for a quick bite of pizza, however, as another reviewer pointed out, it used to be better (noticeably less ingredients now than before, and usually somewhat overcooked).  Lastly, there doesn't seem to be as many selections as before.  I used to go out of my way to make it there, but it's really not worth it any more unless I happen to be in the neighborhood.  In the \"old days\", I would've given them 5 stars. <br>The pizza itself is still good, nonetheless, and there is still a decent selection.  <br>One other thing:  I wouldn't pay too much attention to the hours posted because it seems to me like they just open and close whenever they want to.  I've showed up a few times, and it's closed, even though it was during posted business hours.  <br>In conclusion, if you're in the area, and they happen to be open, I'd say go for it!", "pics": null}}, {"review": {"des": "I WILL STAND BY THE FACT THAT THIS IS THE BEST PIZZA BY THE SLICE I HAVE HAD IN THE CITY. Also, their mac n cheese pizza is the bomb diggity. When you are drunk, your body will seriously thank you (sober you will thank you too, but eating this stuff drunk is life changing lol).", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hdnpyMJMjgngXMjdeXqjIA/168s.jpg", "caption": "buffalo chicken pizza and mac n cheese pizza (with a side of their thick good ranch)"}]}}, {"review": {"des": "Loved this place! We were visiting from out of town for 3 nights and stayed just down the road by Wrigley Field. In those few days, we made a trip to this place twice. <br><br>The first time we went, we got slices of pepperoni and a slice of their chicken and waffles. All of it was great. The chicken and waffles pizza was obviously a little sweeter then we preferred so I recommend not getting more then one. Oh, and the slices are very large so typically one or two pieces will be sufficient. <br><br>The second night, admittedly, was in the early morning hours after being out for most of the day having drinks. The line was longer and this was at like 2:30am, but even with that, it moved relatively quickly and we were chowing down on pizza in no time. We will definitely be back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wPn9rrIfSbqalGrqGUYz4w/348s.jpg", "caption": "Pizza by the slice! Continuously changes."}]}}, {"review": {"des": "Stopped by after barhopping in Wrigleyville and it was packed! It's not a huge store so with the line and all the drunk people eating, a lot of space was taken. They have a good variety of toppings. They also have seasoned fries and truffle fries. I got a taste of the buffalo pizza, which was decent, but I was mainly there for the fries. The truffle fries were very potent, but a tad too crispy for me. Because of how busy it was in the back, there was no service on the floor. The tables were filled with used plates and old pizza, etc. With all that being said, I was also impressed with how patient the employees were. Not a bad attitude in sight and they worked efficiently.", "pics": null}}, {"review": {"des": "It was hard for me to believe any food coming out of Wrigleyville could be tasty...but Dimo's proved me wrong! I normally get my pie from Jimmy's Pizza Cafe, but they were already closed.<br><br>I ordered a 20\" pepperoni and mushroom ($24) for pick-up at 10pm via the website and it was ready in 20 minutes. The pizza was very similar to NYC style pizza: generous toppings, well salted, and foldable triangles. It is more greasy than I normally would like, but the crust was able to hold it all up. Quality of the ingredients are not as high as the ones Jimmy's uses, but if it's late and this is the only place open between 10pm and 3am ... This will be my new to go spot. It's a shame they don't deliver all the way to Andersonville though.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mmmG4MZK9kIrCPJifuEauA/348s.jpg", "caption": "Pepperoni Mushroom Pizza"}]}}, {"review": {"des": "Great little pizza place in the Wrigley area. <br><br>So far I have tried the Chicken n' Waffles pizza, the Buff Chick, the Pepperoni, and the Mac. Don't worry, not all at one time.<br><br>The Buff Chick was by far my favorite, as it was the most flavorful. The Mac was kind of bland, so recommend hot sauce or red chili flakes to spice it up. Chicken n' Waffles was the most surprising to me in pizza form, but it worked. The chicken was sometimes a little too hard though. Lastly, you can't go wrong with pepperoni.<br><br>Overall, I would come again and try more of the menu. Maybe the S'mores one. Anyone try that yet?", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/n9VUpgoG0eei9PjEWq8RKA/168s.jpg", "caption": "The Mac and Chicken n' Waffles"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/k-bvrnz-mKfuKee_TQ5CKA/168s.jpg", "caption": "Pepperoni and Buff Chick"}]}}, {"review": {"des": "I love Dimo's Pizza so much. I'm vegan and it's nice to have a solid late night option for pizza by the slice! I've been numerous times and typically I like to get a slice or two. The mac & cheese is usually available by the slice, and it's probably my favorite one.<br><br>On a recent visit there were no vegan slices remaining so we ordered a whole pie, half mac & cheese, half buffalo. The order came out super quick, probably within 15-20 minutes. I think the buffalo half had way too much sauce on it... not sure if this is typical. I love buffalo sauce but my mouth was on fire. The other half was delicious as usual. I'll give the buffalo pizza a pass because it was good, just oversauced... but in the future I might order it with less sauce just in case. <br><br>There is a decent amount of seating but if you are in here late night when people are leaving bars, it can get very busy. They also do delivery orders.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Lbxpfe4SigaCSsKyBFFslw/348s.jpg", "caption": "Way too much buffalo sauce but the mac & cheese pizza was SO GOOD."}]}}, {"review": {"des": "When you come here late after a cubs game, it gets hectic, but they're good at getting what you want in a line of drunks. The pizza was pretty good! Lol I would come back to try diff flavors!", "pics": null}}, {"review": {"des": "What ya see is what ya get! Creatively crafted pizzas, for a decent price, enjoyed by everyone from intoxicated Cubs fans to out-of-towners and everyone in between. <br><br>To be honest, I had never thought of putting chicken and waffles or mac n' cheese on top of my pizza, but it surprisingly turned out to be a treat. <br><br>This place is pretty bare bones, probably because they've gotten it down to a science and know who is walking in the door to buy their pizza. Dimo's is in the minor leagues compared to the classic deep dish giants, however, just like a night at a minor league game, you usually find something you like. <br><br>Overall, a neat change of pace when it comes to pizza, and hey, maybe you'll make friends with the drunk fellow that mistakenly sits at your table!", "pics": null}}, {"review": {"des": "I used to LOVE Dimo's and came here once a week when I lived around the corner. However, a couple years back something happened and the quality has never been the same since. I've come back occasionally to give them \"one last shot\" and it's always been disappointing. They never have interesting new selections, and the slices that are out look pathetic. Their Mac-and-cheese pizza used to be amazing but the last 4-5 times I've come by it's looked like there's barely any cheese and the macaroni is dry. The last time I came by I left without even ordering anything because nothing looked appetizing. I'm sure the drunk Wrigleyville crowd will keep them in business for a long time but it's sad how far the quality has fallen since the first couple years after it opened.", "pics": null}}, {"review": {"des": "I love their BBQ Chicken Ranch pizza. It's my go to slice and it never disappoints!! I've tried others but I always come back to this one. So good! Mummy husband had the pork belly glazed sliced and he said it wasn't as good as the BBQ chicken one.<br><br>The employee kept the tables cleaned and he was friendly and polite. I'd go back! It's a great place for a late night bite or whenever you feel like eating delicious pizza!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sj3xB-XM6MtZbksUn0p_OA/348s.jpg", "caption": "You get your own water over there. Practical!"}]}}, {"review": {"des": "I was looking forward to trying this place out after watching a video on social media on their chicken and waffle pizza. My boyfriend and I went here before the Backstreet Boys/Florida Georgia Line concert at Wrigley so we wanted to check out the pizza while we were in the area.<br><br>We went here on a Friday afternoon and it was crowded. There's limited seating so keep an eye out for a seat or take it to-go. There's like window seating, one giant table in the middle where you sit with other people and like two booths. Luckily, my boyfriend snagged us a booth otherwise we would've been sitting on the floor.<br><br>I ordered the Mac and Cheese and Chicken Parmesan Pizza (breaded chicken, penne, mozzarella, parmesan, asiago, and parsley). My boyfriend ordered the Breakfast of Champions (scrambled eggs, chorizo, green onions, and spicy mayo) and the Margherita. For $4.50 a slice, the pizza better be good. The Chicken Parmesan Pizza was the best one out of all the pizzas that we ordered but the overall the pizza just fell flat. Literally. The crust was so thin that the toppings fell off and it was messy. Overall, the pizza was average and way too overhyped. I wouldn't go out of my way to come here again when there's so many great pizza places in Chicago.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ndq1Ryv9OFa2vPxJnx37dQ/348s.jpg", "caption": "Chicken Parmesan, Mac and Cheese, Breakfast of Champions, and Margherita"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fJP37gY3WkO3Efe5ZeX9PQ/168s.jpg", "caption": "Chicken Parmesan"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sajH5kI4i3rorVzExKMghA/168s.jpg", "caption": "Mac and Cheese"}]}}, {"review": {"des": "Came here last night to get my pizza crave on while having a late night with the release of Destiny 2. I come here way too many times to count. Their pizza is exotic as there is a wide range of different pizzas. From a classic cheese pizza to a Chicken N Waffles pizza. This is not your normal pizza joint. <br><br>My go-to's are the Mac N Cheese, BBQ Chicken with ranch, Buffalo Chicken, Pepperoni, or any seasonal pizza that looks appetizing. They serve vegan zaa's, but I would skip the Vegan Mac N Cheese. It was weird...I like their crust, but sometimes you will get too much crust or worse, overburnt crust. <br><br>A slice will run you $4-4.50 and I usually get 2-3 slices depending on what they have. Pro tips: grab a punch card as the 11th slice is free. Ask if they have any pizzas not shown above if they don't look appetizing as those have probably been sitting out for a long time. <br><br>Dimo's is one or the best drunk food spots in Wrigleyville and is always open late. The line will be out the door at 2am and on weekends.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mkAT4Njjgva33FjbG5gByw/348s.jpg", "caption": "BBQ Chicken with ranch and a slice of Pepperoni. Needed the coke for Destiny 2"}]}}, {"review": {"des": "This is the worst and longest delivery experience I've ever had. I watched the ENTIRE film \"Hocus Pocus\" and my order still had not been delivered. <br><br>I placed my order online at 9:47PM, received a text at 10:14PM that they were preparing my order. Now, <a href=\"/redir?url=http%3A%2F%2Fdelivery.com&s=609b2d31420216f9eba23465871ae01c6c8912717f0ab28d274af73b53d57cc8\" target=\"_blank\" rel=\"nofollow\">delivery.com</a> said it would take 60-70 minutes. Well, I received my order at 11:37PM. So, 110 minutes later. <br>By the time I got my pizza slices, they were cold. <br><br>I will NEVER order from Dimo's again.<br><br>Pizza was good though (once I warmed it up - still doesn't beat it arriving warm though) so I MAY stop in. But never. ordering. again.", "pics": null}}, {"review": {"des": "DO NOT EVER ORDER DELIVERY!!!!! I ordered at 3:45 and received a confirmation that it would be delivered at 5:15. Ok no big deal.... 5:20 rolls around and I call to see where my cheese pizza was. The guy on the phone said that it was going to be delivered shortly once the delivery guy picks it up. Cool can't wait! 40 more minutes pass and still no pizza. I called in to check again and the pizza was still there! I cancelled my order and asked for a refund. Fingers crossed they can at least get a refund done in a timely manner.", "pics": null}}, {"review": {"des": "A pizza by the slice place in the midst of the Wrigleyville bars? That is my dream come true! I stopped in here for some much needed hydration and nourishment and loved it. The BBQ chicken pizza definitely hit the spot and my friend loved her mac n cheese pizza slice! Our service was fast and polite. It's pretty small with not a ton of seating, but it's perfect for a quick in and out experience. Next time I'm out in Wrigleyville, I will definitely return!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/F3iJNlDxhxhpSrcNMNSXSw/348s.jpg", "caption": "BBQ Chicken Pizza"}]}}, {"review": {"des": "I think I come here at least once a week. Their BBQ chicken pizza and vegan buffalo pizza are sooo good. Highly recommend if you're in the area and just want a quick slice of pizza", "pics": null}}, {"review": {"des": "So freaking good!!! Found this place after exploring wrigley field area. Got the Margherita and philly slice. My friend got chicken penne. We basically didn't speak because we were so busy eating. And it's BYOB!!!! Must try", "pics": null}}, {"review": {"des": "Environment: very crowded with intoxicated people always. not the cleanest spot either. Not much space to sit. Line goes quick though.<br>Food: the BEST of late night pizza. Huge slices bigger than my face, and all with the greatest ingredients. <br>Mac and cheese pizza: Carbs * 1000? Sign me up. Twas delicious. Try it- you know you want to.<br>Buffalo chicken pizza: Tastes just like it sounds and nothing bad about it. The buffalo sauce adds a nice kick to the hearty pizza. Honestly makes a good combo with the mac and cheese pizza (see above).<br><br>Mouth is watering from thinking about how great this pizza was. Stomach is hurting though thinking of how much pain I was in the next morning...worth it!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/t4IVgXrgKXKzPXBldJZa5w/168s.jpg", "caption": "mac and cheese, buffalo chicken"}]}}, {"review": {"des": "What sort of pizza restaurant doesn't always, from open to close, offer cheese and pepperoni slices?!? I've lived about 2 minutes from Dimo's for close to 7 years now and their quality has just fallen off of a cliff along with stiff price increases. It used to be $2.50 for regular (cheese or pepperoni) slices and more for the premium slices but now they just charge you full price regardless of toppings. $4 for a slice of pizza is steep... you're at $8 for a lunch without including a drink. Price aside the big 2 issues (that could easily be fixed are):<br><br>1. Stop burning your pizza. Something happened about 2 years ago where every piece you put out now has at least some blackened bits to the point of becoming crunchy and tasting burnt. I used to very much enjoy the cook but now it's just all crunchy / burnt all the time.<br><br>2. For ****'s sake just always keep cheese and pepperoni slices on your bar and don't charge the same prices that you charge for all the rest. It's a very basic slice of pizza without much cheese on it, the costs can't be high. It's really annoying to walk through ice and snow for a slice of pizza only to be told that the only options are some taco-seasoned nonsense and a bbq chicken pizza. Sometimes people just want normal pizza. <br><br>Also, the tiny new pepperonis don't taste better than the old ones that used to give your pizza proper meat coverage.", "pics": null}}, {"review": {"des": "Ordered through GrubBub. Order arrived incomplete AND one pizza arrived without cheese on it. GrubHub calls the restaurant. Dimo's wont own up to the flop and denies my refund. Mistakes happen, just be a responsible business and own up to it. Definitely won't order here again....", "pics": null}}, {"review": {"des": "Best late night pizza in Chicago but new red headed employee needs to be re-trained. She is clearly new but doesn't know how to work the orders when it was busy. She was also very rude to us and refused to give us a free pizza when we had enough punches on our card. We come here frequently and usually love the pizza and service but this is the first time a worker has completely ruined it for us. She tried to tell us there was no Mac and cheese was available when there was a full pizza of Mac and cheese sitting on the counter. Please see the picture for how she sliced my pizza. I understand if you have a busy night but don't be rude to regular customers. Still giving 4 stars because yeah the pizza is that good.", "pics": null}}, {"review": {"des": "Decided to come here randomly after a Cubs game, the atmosphere was  a small pizza joint but there's still room to sit.  There wasn't a line and the services was pretty quick, the workers weren't overly friendly or very friendly at all. I got the pineapple, jalapeno, bacon pizza and it was pretty good and a huge slice. I would maybe return for the pizza if I was with a group who wanted to go but wasn't overall that impressed but also wasn't disappointed. Basically it is what you can expect of a quick by the slice pizza joint.", "pics": null}}, {"review": {"des": "Stopped in for a slice before a game.  Several pies sitting on the counter, I asked if they had a sausage and the girl behind the counter kindly said no, but would be happy to make one.  IT took about 15 minutes and it was ready.  Got 3 slices to share with my son.<br><br>Let's start with the crust.  Very good dough, slight chew, good crunch, well cooked.<br><br>Sausage was a bit under seasoned, but still very good.<br><br>Sauce was nice, little tang not too sweet and not too much.<br><br>Overall solid effort and I wouldn't hesitate to come  back.", "pics": null}}, {"review": {"des": "Dimo's!!!  What the fudge happened???   This used to be my FAVORITE pizza joint, located so close to home.  Sadly, they've slid downhill...more like plummeted downhill.  Me and my buddy stopped by last night for a couple of slices.  We ordered, and waited...and waited...and waited...all the while watching many other people get their slices and go.  We asked for a refund and left without pizza.  The manager was only what I could describe as \"rude\" at best.  I used to love this place, and order at least once a week.  Dimo's, I think we need to see other pizza.  It's not me, it's YOU.", "pics": null}}, {"review": {"des": "Rip Dimo's off N. Clark and jam it in the ground in any BIG-college town and it would thrive just as it does in Wrigleyville.  Giant slices from giant pizzas for reasonable prices and THEY will come...sober... sometimes.....but mostly not... and feed. <br><br>The place could use a good hosing down, but then it would lose its charm...along with a few communicable what-nots. But hey all organisms gotta live!<br><br>Would we Funksters return? Is the beer gone? Tequila dry? Wine fineet-o? Then hell yea!", "pics": null}}, {"review": {"des": "I LOVE PIZZA and this place is great.  My 1st time in Chicago I asked a bartender where I should go for a slice after I left the bar and she recommended​ Dimos.  Side note always ask a local bartender for advice or recommendations​ if you want the best ones fyi they will always lead you the right way and give you some options.<br><br>Anyways this is a great pizza spot in Wiggyville after you leave the bar before​ you jump in an uber or on your way to the L. Stop by for some awesome​ pizza slices that will make you feel better in the morning you will thank me.", "pics": null}}, {"review": {"des": "So I'm currently here at Dimo's on 9/26 at 11:26 pm and there is a white female cashier employee (Dez) here in a grey cut off sweatshirt and Jean pants. I had ordered two slices of pizza and it totaled $9. That was well in good, no problem. And then right after me there was a young white female who complimented a random piece of the cashier's clothing and by context of the conversation you could tell they didn't really know each other. The \"Dez\" woman said thank you. But I could tell something was off so I was listening intently to their conversation as I was waiting for my food. They exchanged a couple words and then I heard her say that the girl's pizza was $7 for two slices. I had previously paid $9 (I knew this was going to happen). I had asked the cashier why mine was $9 and the other girls' was $7. She alleged it was because the girl was her \"friend\". I told her calmly that I don't believe that to be true. Then the girl buying the pizza said it was. It was definitely lies you could tell they had never met based off of conversation, so I thought it was very uncouth to discount a customer for no reason (we know the real reason) directly after another customer had just ordered the same thing and then on top of that to blatantly lie. I have money, but it's all based on principle. The \"Dez\" woman went to hide in the back for a while longer perhaps until<br>I left and the \"friend\" went to go sit in the corner on her phone exhanging no words with the cashier. Then she disappeared after a while. Some \"friend\". Don't lie to your customers or play around with people's money it's not cute. Shout out to Jimmy in the burgundy sweater who was very kind and rectified the situation professionally. I enjoy Dimo's food and how kind the staff typically is but this situation rubbed me the wrong way. Two stars for jimmy!", "pics": null}}, {"review": {"des": "This place is fulfills all my late night drunk food dreams. With killer pizza ready to go, a fast moving line, and good service, it's everything Wrigglyville needs. <br><br>The tables are not the easiest to get in and out of with their long benches against a the wall (especially after a few...) but it's a pretty quick in and out since it's just pizza. <br><br>The flavors available are inconsistent. So you have to go in with an open mind. Sometimes they have three vegan options and sometimes it's just one. Sometimes they have the famous Alfredo or taco pizza and sometimes they don't. It's just the way it goes.  <br><br>The one major downside to this place? It's cash only. :(", "pics": null}}, {"review": {"des": "Dimo's comes to my work with FOODA; the employees are always really nice, and they always have a rotating Vegan pizza option. Thank you so much for not only keeping us Vegans in mind but also making the Vegan option delicious every time!", "pics": null}}, {"review": {"des": "Yummy pizza by the slice in Chicago , open late, and has a giant table in the middle, what's not to like ? A three minute walk to the El train stop in Wrigleyville and close to where I was staying. Perfect after a night of drinking, with Mac n cheese pizza of course", "pics": null}}, {"review": {"des": "IM IN SHOCK. This Chicago INstituton has blown my mind. Stuffed pizzas, pizza puffs, absolutely equivalent to Lou M's BUT at 50% off! Everyday they give the leftover pasta from the pasta pizza to anyone who asks! It's CRAZY! I went in here to find a Pizza Hut look a like but I came out with a friend! Thanks Lou M's! <br>All the best,<br>B", "pics": null}}, {"review": {"des": "The pizza here is ok. But the slices are small, so you have to get at least two... and that costs you $9.00. I repeat $9.00 for two SMALL slices of pizza. <br><br>What else? The Hawaiian pizza is made with chicken... and apparently no spam at all, just maybe ham? It's just gross and wrong, and I'm having no part of it. <br><br>The chicken slices looked good and might have had enough meat on them to sort of be worth it, but they were also covered in waffle crap. Which I guess is a thing out here.  Not sure why I never heard of waffle chicken pizza in New York, Boston, Philadelphia, New Haven, or the like billion other places where you can get good pizza... oh wait I know, because it's a terrible stoner idea. Like maybe have that... but also have regular chicken pizza for people who aren't smoking weed to eat?", "pics": null}}, {"review": {"des": "I love dimos but this past time I went and told the cashier that there was a huge mosquito on my pizza slice baked in and I wasn't expecting anything but all she said was okay. It would have been nice to have an apology given but there was none. I will be back but it was very disappointing", "pics": null}}, {"review": {"des": "Awesome pizza if you're looking for a quick bite. They always have a lot of freshly made options, with nontraditional flavors like mac n' cheese, chicken BBQ, cubano, etc. Every time I go I try a new slice and they've all been good so far!<br><br>It gets pretty crowded when if you're there on a weekend night, but the staff is really great about moving the line down quickly, which is really impressive because half the people walking in are some level of drunk! Props to all the workers here!", "pics": null}}, {"review": {"des": "This place used to be under another name when I ate here years ago. I am happy that it's still around. I moved out of state a couple years ago and have been craving their pizza for a long time. I finally went back during the World Series games and was hanging out in Wrigleyville. I convinced a couple friends that they HAD to have their pizza. <br>I thought one slice would make me full but I definitely needed two. I had the mac and cheese pizza. I was sad that they didn't have the smores pizza at the time.<br>Remember before coming here that it's a small place and it might be hard to find a table or seat. If their is line...the wait is worth it!<br>Oh and also they have honey on the side to eat with the crust which sounds weird but tastes good.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VVQoE5YdhE1FrFriwKwVnA/348s.jpg", "caption": "Mac and cheese pizza and forgot the other one."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QCz58ta2t1xDIuiQNUOeyg/168s.jpg", "caption": "Mac and cheese pizza is really good!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IeroGXpyQv0mMOoslj8qZA/168s.jpg", "caption": "Pizza by the slice"}]}}, {"review": {"des": "I've reviewed the other Dimo's on Damen, but never this one. I enjoy this one just as much as the other. I feel like I don't ever come here unless I spend the night going out in Wrigley and need something to absorb some liquid. Just like the other Dimo's they sell pizza by the slice. The time that I come they don't usually have as big of a selection, but when showing up around 1am and standing in a long time it is kind of expected. I enjoy that they always reheat the pizza to make sure that it is hot and crispy. It reminds me of when I am in NY and order pizza. All in all, Dimo's isn't going to blow you away with the quality, but the flavors are always interesting and the pizza is good. You can never go wrong with late night pizza.", "pics": null}}, {"review": {"des": "Ok before you freak out over mac &a cheese on pizza and chicken & waffle pizza, just TRY IT. It's so good. SO GOOD. I usually only go for wood-fired, authentic/artisanal pizzas, but the mac & cheese one from Dimo's brought me to tears [of joy].  Seriously.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NEjEGpH5U4EYLW7j10IIOQ/348s.jpg", "caption": "The Mac aka deliciousness"}]}}, {"review": {"des": "Came here late night after visiting a few bars so eating greasy food was the objection.  There was three of us and we decided to get the large chicken n' waffles pizza. This pizza has fried chicken, melted butter, mozzarella, mini waffle bites, and a creme fraiche base topper with honey.<br><br>So, while I would never order this pizza at 12:00pm or 7pm... at 2am it was rather delicious.  Overall this place fine for late nite food; however, it is crowded with drunk people (nothing wrong with that, just loud), and the place could be a bit cleaner.", "pics": null}}, {"review": {"des": "Dimos is a great spot for a slice of pizza after going out to the bars in wrigleyville. They have so many interesting toppings. I really like the chicken and waffles pizza. They are super quick with everyone's order, even when there is a line out the door. If you show up as bars are closing expect it to be crowded, but most other times it's not too bad.", "pics": null}}, {"review": {"des": "Very disappointed by the low quality v.s. price asked.<br><br>We had a \"vegan Elotes\" which was a basic thin crust, topped with soft moist korn from a can obviously, and a couple of unidentified overcooked green stuff. No taste, lots of oil, really unpleasant to eat.<br><br>Then we tried a pep'shroom which was also a thin crust with pepperonis, and hardly any mushrooms. This was barely ok. Zero taste, lots of fats.<br><br>On top of that, delivery was 45 minutes late, without any notice or excuse.<br><br>Probably a good place to get a quick slice with a bud light before going to the game. If you want good pizza, I suggest to check other places in Wrigley.", "pics": null}}, {"review": {"des": "Stopped in for a slice after the Cubs game. La-Za-gna pizza of the day was delicious. Quick service, huge slice ($4-something). Would have been 4 stars, but staff earned the extra one for dealing with a particular episode of childishness I witnessed:<br><br>Cashier: (addressing drunk Milennial white bruh with his head down on the counter) Are you ok, sir?<br>Bruh: (looks up)....Is my pizza ready?<br>Cashier: Just a moment. That will be $4.50. <br>Bruh: 450 what?<br>Cashier: 4 dollars and 50 cents. <br>Bruh: ....<br>Cashier: ..... $4.50. You have to pay for your pizza. <br>Bruh: I don't have to do anything. <br>Cashier: You have to pay for your pizza or get out of my line. <br>Bruh: .....<br>(Cashier ignores bruh and turns and helps the next couple in line.)<br>Bruh: OH YEAH HELP HER BECAUSE SHE'S MORE IMPORTANT!<br><br>I kid you not. Straight white men in your 20's, stop being like this, entitlement is not a good look bro. Every table around me asked wtf that guy's problem was as he finally realized he wasn't going to get any attention or pizza and slinked out of the restaurant to a chorus of \"BYE DOUCHEBAG\" from other patrons. So, if you like your pizza hot with a side of no-f***s given, Dimo's is the spot.", "pics": null}}, {"review": {"des": "I recently tried to order delivery from dimos. After waiting an hour I decided to try and call and see what was going on. They told me that they were sorry but they were swamped and had glossed over our order so they could either refund us or we could wait an additional hour and a half to 2 hours. Clearly dimos isn't taking the time to actually make sure they have enough employees working at any given time to ensure the business works smoothly. There is no reason to ever be waiting 2 hours for regular old pizza delivery and there is no excuse for an order to simply be overlooked. A simple refund is not an acceptable remedy for this situation. Alas my hunt for a good pizza delivery place continues on and I have to cross dimos off my list without even trying a bite.", "pics": null}}, {"review": {"des": "Great place for pizza, especially if you're willing to be adventurous with your toppings. Its NY style pizza, thinner crust. They sell pizza by the slices and its a generous slice. They usually have your typical pepperoni, but theres also usually mac n cheese, buffalo chicken, chicken alfredo, and vegan pizza. The toppings usually change. This particular time they had potatoes, with bacon. Usually you can't go wrong with any of the toppings. My favorite thus far is a jambalaya creole pizza. This particular location can get crowded at night given its proximity to the wrigley bars. I'm a thin crispy crust fan so this is usually a good go to late night pizza place for me. They also serve beers here. The best is they have a pizza punch card! If you're inclined to come here more than once (because I am!) I'd suggest getting the pizza punch card.", "pics": null}}, {"review": {"des": "It's not Chicago deep dish, but the pizza here is damn good. Dimo's is one of my favorites for the variety of fun and obscure flavor combos. The buffalo chicken is my go-to, but everything I've had here from mac and cheese to chicken and waffles hits the spot. They always have specials and even have vegan options which is great. <br><br>The price is right at just $4.50 for a large slice, and the staff here is always really cool and friendly. The environment is young and hip and the staff is too! They're always friendly and smiling when taking your order, and last time around when the restaurant was a bit slow, we saw staff dancing around behind the counter while making the pizzas!<br><br>Highly recommend.", "pics": null}}, {"review": {"des": "The food is decent as far as pizza by the slice but on a night that wasn't busy my pizza was cold. Also, I stepped away to grab a napkin and when I sat back down there were 3-4 gnats flying around my food.<br><br>The slightly cold pizza can be forgiven but the gnats warrant a low review.", "pics": null}}, {"review": {"des": "So i really like their specialty pizzas... the Mac N Cheese is bomb, but i recently ordered just a pepperoni pizza and it was garbage. Actually I'd almost rather eat garbage. I think Dimo's excels in the specialty pizza, but falls way short when it comes to a plain old marina and cheese type pizza.", "pics": null}}, {"review": {"des": "We came here last night for a late night bite to eat, pizza was just okay, unique, but a bit over done. <br>we had the worst experience here & will not be back. they are incredibly disorganized and they don't know the first thing about customer service. <br>We walked in & waited a few minutes, when it was our turn to order, we get 2 slices & the girl behind the counter put them on top of each other?? so i got barbecue sauce on the slice of mac & cheese i ordered ?? gross. second we wanted fries. we ordered them through the girl taking our order, but she said she couldn't put an order in for fries, we had to order those when we paid, ok, strange. once we got to the counter we paid and our pizza was ready. but in the mean time. they had skipped over some guy & never put his order in at all, so he walked out all pissed off already. the people behind the counter didn't care, ok, whatever. <br>so they call out my pizza slice in which i saw her put in the oven for me & once i grabbed it, some girl told me she was promised that slice. we told the guy at the counter & he gave her a free one since they were friends or something!!! unfair but ok. <br>we went and finished our slices & STILL NEVER RECEIVED OUR FRIES. i went up to the counter and he said a minute, because they didn't put them in yet ??? WHAT. terrible. <br>once they called out the fries, they gave ours away to someone who was AFTER US. <br>i will never be back here as they don't know anything about customer service or any type of apology was given once it was brought to their attention. 'oh darn' is all we got. well OH DARN you will never get our business again.", "pics": null}}, {"review": {"des": "I like Dimo's pizza, especially to fulfill a late night craving for pizza. I like to get vegan pizza sometimes and I love that they have vegan options here.", "pics": null}}, {"review": {"des": "Dimo's is that divey pizza joint that you go to after a few drinks, but it's also worth checking out when sober! They serve thin crust pizza by the slice, but you can also order a whole pie. Pizza is close to NY style, but Dimo's is in the oven longer giving their pizza more of a crunch and toasty flavor.<br><br>The folks here are super nice and patient. I had a hard time figuring out what kind of pizza I wanted, and they said that they could make me something off the menu. How cool is that? How accommodating! I ordered a half pepperoni and sausage pie, and it came out in 15-20 minutes. Dimo's is located very conveniently close to Wrigley Field, and has street parking. It's a small joint, but the decor is pretty funny and somewhat grungy hipster.<br><br>It's definitely worth giving Dimo's a shot. I love the variety they offer on their menu. There's always something new to try!", "pics": null}}, {"review": {"des": "Stopped in and got a pepperoni slice. It was much better than my previous visit. I highly recommend going with the classics if they are fresh. Otherwise, order one of the crazy recipes without thinking of it as \"pizza\".", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uvYxqgY5bFH6LlRq7OOj3A/348s.jpg", "caption": "Pepperoni slice"}]}}, {"review": {"des": "First time customer feedback:  <br>I appreciate the vegan options but they really missed the mark on my delivery order: <br><br>1. Both the pizza and cheese bread were very chewy and rubbery. Probably because they sat and steamed in the box from 5:42p when they left their shop through 6:36p when they finally arrived at my place. <br><br>Smaller issue - ordered sparking water and received still.<br><br>Emailed their <a href=\"mailto:orders@dimospizza.com\">orders@dimospizza.com</a> a couple of times with zero response.<br><br>Should've just ordered chain pizza with veggies but without cheese. I would've received pizza with a crispy crust in 30 minutes. Not rubbery pizza in about 70 minutes.", "pics": null}}, {"review": {"des": "Kinda pricy for pizza.  But it's good quality and the staff always hooks me up with free side sauces.", "pics": null}}, {"review": {"des": "Better off going to Big G's up the street.. way better mac and cheese pizza plus they don't burn the crust!", "pics": null}}, {"review": {"des": "Pizza by the slice!!!!! Really cheap, really delicious. Opened late. What more do you want? Yeah you can get a whole pizza of a favorite (I like the bbq chicken soooo much), but why when you could get a couple different slices? I took off one star because sometimes, especially in the dead of winter when no one is around, the pizza sits there a little long, but you can look at the selections and choose which pizza you want, so just avoid that.", "pics": null}}, {"review": {"des": "This location is a bit rougher than the choice Wicker location, but Dimo's is always pretty decent across the board for a quick greasy slice type of pizza joint, and I've never had a huge problem here outside of the cramped location and often rowdy local clientele.", "pics": null}}, {"review": {"des": "Overpriced. Tastes like prego. Spend less money and get real pizza this place is a scam. I got three slices for $13... I could buy a frozen pizza for 1/3 the price and it would taste better. Duck this place, don't waste your time or money.", "pics": null}}, {"review": {"des": "Ordered the vegan buff chick pizza for delivery and it was amazing! Love all the vegan options!", "pics": null}}, {"review": {"des": "Price is the best thing about this joint other than location. <br><br>2 very large slices of pepperoni pizza and a Mexican coke for around 10 bucks. <br><br>Food quality lacking. <br><br>Beyond greasy, won't be coming back.  <br><br>To each their own.", "pics": null}}, {"review": {"des": "Awesome. Food is great service is always on point never had a complaint. Their different from other pizzerias", "pics": null}}, {"review": {"des": "A friend of a friend recommended this place and after a night of drinking and debauchery, we needed some fat and grease. It wasn't too shabby. It was crowded (a good indication, right?) and after about 20 minutes I was sitting down to a mac 'n cheese pizza. Pretty good for my first time trying something like that. <br><br>It's an unassuming place but I see why it's popular. I'd go back.", "pics": null}}, {"review": {"des": "Best thin crust pizza by the slice in Chicago! Love this place. Their BBQ chicken and classic margharita are a must try. Give it a try if you are in the neighborhood.", "pics": null}}, {"review": {"des": "If you are a fan of thin crust pizza then this is the place for you! It's not thin enough to be crispy but it's still good. I love The Philly with pineapples because yes, pineapple does belong on pizza! Their Vegan Cheesy Garlic Bread is also out of this world amazing. All in all it's a great price for a whole lot of pizza.", "pics": null}}, {"review": {"des": "Yum yum, great dank vegetarian brownies, and you cannot beat their prices for a 20-inch pizza with good taste!", "pics": null}}, {"review": {"des": "Probably the best pizza place I have ever been to. 13 minutes was all I needed. <br><br>Next time I go back to Chicago, I will return. <br><br>I had the mac and cheese slice as well as...I can't remember, but I am booking tickets out of EWR as we speak to refresh my memory. Check out the menu online and you'll see things like \"Pumpkin Pie\" slice and \"Chicken 'n Waffles\" slice.<br><br>The list goes on. Two slices were $8 and worth it. <br><br>The negative reviews seem to be in regards to the service, I guess I lucked out. It wasn't dead at all in here the Saturday night that I went, but not full.<br><br>They asked me for my order before I even walked in all the way.", "pics": null}}, {"review": {"des": "Barely three stars.  They need to work on their cleanliness, both behind the counter and in the rest of the restaurant.  The same person who handled pizza slices from the pizza trays to the oven bare-handed also rang us up, touching credit cards, cash and the register.  There isn't any ambience to this place either--no TV, the tables were dirty and the front door was wide open on a night with 40 degree weather.<br><br>The buffalo chicken pizza was the only thing worth eating.  The vegetarian pizza was limp and watery.  The chicken and waffle pizza was greasy and not flavorful.  Drinks are by the can.<br><br>I don't think even the 20 year-old me would've liked this place, but it is popular.  If you're desperate for pizza, try Dimo's.  It's relatively inexpensive, and the folks that work there seem friendly.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ToeDJy8kVtEYX_HsjAZqjQ/348s.jpg", "caption": "A friend of mine had this S'mores Pizza slice and proclaimed it the most disgusting pizza in Chicago."}]}}, {"review": {"des": "Really flavorful and unique pizzas!<br><br>We ordered the largest size with half and half The Buff Chick and the Chicky Chicky Parm Parm, then a 12in Al Pastor. All three were super filling but we could not stop at just one slice!<br><br>The Buff Chick was mainly a BBQ Chicken and had a nice kick to it and the chess sprinkled on top was super delish, the Chicky Parm had different cheeses and a different sauce so it was a nice flavor change from the Buff Chick. The Al Pastor was the winner in my heart, because it was just so savory, smoky, cheesy, and all around delicious.<br><br>Will for sure be ordering from here again!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JCuie_cbbydSJNh35VolSg/168s.jpg", "caption": "Top half: Chicky Parm Bottom half: The Buff Chick"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OZxuPR5MNFWkpIdn7sSPuw/168s.jpg", "caption": "Al Pastor"}]}}, {"review": {"des": "It's just an average place for a large slice. I went there at 6:30 on a Thursday and the pizza on display all looked pretty bad like it had been sitting out a long time. Asked for pepperoni, which was in the oven. Waited 10 mins which is fine to get fresh pizza. <br><br>Pizza was good, nothing remarkable, not heavy on topping coverage. There was a house fly buzzing around. Don't plan on going back, which is too bad since there aren't many good pizza by the slice places around. I'm sure I'd be a bigger fan if it were 2am on a Weekend", "pics": null}}, {"review": {"des": "Got the Jalapeño pineapple bacon pizza.  Tastes OK, but arrived less than warm.  Original email after ordering said an hour for delivery but was well over an hour-and-a-half... so take that for what it's worth.<br><br>Has jalapeños but no heat really at all.", "pics": null}}, {"review": {"des": "Used to be great, but now they have 3-4 options at night, which is a joke considering their whole schtick.", "pics": null}}, {"review": {"des": "Stopped in during tbox and I can't wait to return! The chicken and waffle pizza was amazing and they don't skimp you on the toppings. I loved their options and want to come back and try more options!", "pics": null}}, {"review": {"des": "I'm not sure if it's all the beer I've had before I go to this place but this pizza is seriously the bomb. The slices are pretty big so 2 pieces should do you well. What I love the most about Dimos is the insane pizza creations they come up with. The Mac N' Cheese pizza is probably my favorite but I've had pizza with BBQ chicken and bacon on it, French fries on another. I'm pretty sure I even had some form of a chicken and waffle pizza as well. I will say this place interior wise is nothing beautiful. But for the drunk, stoned and hungry patrons of Wrigleyville this place gets the job done and doesn't hurt your wallet. <br><br>Also don't forget your punch card! After so many visits/pizza slices you get a slice of pizza on the house! Which is of course awesome because who doesn't love free pizza?!?!?!", "pics": null}}, {"review": {"des": "I have never been to this location, to eat in.  Everything I have had from here has been ordered out.<br><br>I do love Dimo's.  Let's face it, Chicago is a great pizza town.  Probably the best in the country.  Suck it, New York.  Chicago has it all - deep dish (of course), thin crust, classic toppings, weird shit, gourmet, and everything in between.  Sure, I've had better thin crust in Santa Cruz, CA and my favorite deep dish is in Tucson, AZ.  But overall, Chicago is the pizza capital of the universe, and I'll fight anyone who says differently!<br><br>So that brings us to Dimo's.  Do you like Hawaiian?  You will die for theirs - pulled pork and fresh pineapple.  Amazing.  But they really shine with some of the more unique gourmet pizzas.  Seafood, duck, mac 'n cheese and a bunch of others.  Dino's has some great stuff.<br><br>Order early, as they run out of some stuff.  And that should tell you something.  Their pizzas are great and a lot of people order them.  They do deliver to a wide area of Lakeview and Wrigleyville.  And if they are longer than expected in delivering, they will give you a coupon for a free slice.  Not the 'screw you' attitude of some places.<br><br>Dino's has both deep dish and thin crust pizzas, classic and new.  The crust is delicious, chewy and well cooked.  The toppings are fresh and carried, and in a good quantity.  I'd like more cheese and more sauce on the pizzas, but both are well flavored.  In a city that has amazing pizzas, you could do a lot worse than Dimo's.", "pics": null}}, {"review": {"des": "A little bit of a dive but if you're in a bind for pizza at any waking hour of the day (and let's be real... who isn't?), look no further than Dimo's. The macaroni and cheese pizza will change your life. Yes, they made macaroni and cheese a pizza topping, and I am all about it. They have other great flavor options, but I am loyal to the M & C! This place is perfect after a night of Clark Street fun.", "pics": null}}, {"review": {"des": "Recently ate here on St. patty's day when the line was out the door. On top of the pizza being amazing (they provided solid vegan options) the service here was phenomenal. They were friendly, speedy, and remarkably patient with their drunk customer base. Anytime I'm in town from this day forward I will be making as much of an effort as possible to stop by Dimo's.", "pics": null}}, {"review": {"des": "Each slice is 4:50 with tax, and it's a decently big slice. Unique flavors and they have vegan options if you're into that. I got the buffalo chicken pizza, a little too much sauce but it was good", "pics": null}}, {"review": {"des": "Some of the best pizza I have ever had although it is more New York style than Chicago style.  It was very fresh tasting which I appreciated.  If you are in the area and love pizza, don't miss out.", "pics": null}}, {"review": {"des": "Great cheap food. I ordered three 20\" pizzas and they were ready in 40 min. The employees were very nice and even gave me a handful of paper plates to take back with me when I kindly asked for some. The pizzas are a good deal - the 20\" can feed about 4 pretty hungry people. My favorite pizza was the make-your-own with mushrooms and roasted red peppers. Can't really disappoint a large hungry crowd with this.", "pics": null}}, {"review": {"des": "I'd throw a zero star if one existed. Normally a great spot to go grab a slice of interesting pizza. We ordered some pies tonight through grub hub and after about 90 minutes of what should have been a 30-45 minute delivery we got a call from Dimos that the order was just then received and that they could get them here in about 45mins. They woman was quick talking and defensive when I sounded disappointed in the whole deal. She handed me off to their cook who went on to tell me that he was the manager there. I basically got bounced around their staff of people that couldn't offer a proper explanation or help take care of the matter. Sub par performance on all levels. He kept repeating \"it don't work like that\" whenever I asked if they could help discount the order so we could get the pizzas in the year 2018 and continue to be customers. On principal alone,  we won't be going back. I don't care about the cost. I care about the way I was just spoken to on the phone. The real management team needs to do themselves a favor and put someone at the shop who can take some onus and make decisions. Disappointed and still facking hungry.", "pics": null}}, {"review": {"des": "The best pizza literally I have ever had the vegan Mac and cheese is my favorite all time pizza and the cheesy breadsticks are a must have!!!!!! Absolutely Amazing. they put a good amount of roasted garlic on top too and it melts in your mouth. I've also had their other pizzas and everything is always made with so much love it's my go to when I think about getting pizza. Great ingredients and good tasting sauces. Definitely recommend this spot. I'm looking forward to trying their vegan brownie next time.", "pics": null}}, {"review": {"des": "Visiting from the bay and I gotta say!...this is a hella of a good pizza! I loved the Buffalo pizza and especially the mac and cheese pizza, that pizza was lit!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/I7wL1VSDRrHniLGnmK5D7A/348s.jpg", "caption": "Buffalo pizza and mac and cheese pizza"}]}}, {"review": {"des": "If you're looking for a New York Style pizza while you're in Chicago, you need to stop by here. Dimo's is a mom and pop shop that's been established for years and I really enjoyed eating here.<br><br>I'll be upfront. I wasn't impressed with any of the Deep Dish Pizza while I was in Chicago. After trying a few spots, I missed NYC pizza so I found this spot via Yelp and it didn't disappoint me!", "pics": null}}, {"review": {"des": "Love all the different pizzas at this spot! Best drunk food in Wrigleyville! It is a must after leaving the bar! Have had some great pizza and times at this spot! They have good ranch sauce to dip the pizza in too! Mac and cheese pizza is always fire! So many good combinations!! Please stay here forever!!", "pics": null}}, {"review": {"des": "Definitely a great place to go to after drinking! Chicken and Waffles is the best one!", "pics": null}}, {"review": {"des": "This place has good pizza, but is chronically lax about the accuracy of the product you'll receive. More often than not, the pizza received is either missing an ingredient, had an ingredient changed, or is just plain wrong. This happens way too often for me to fully recommend them. <br><br>Bottom line, you'll get a delicious product, but there's about a 50/50 chance that it won't be what you actually ordered.", "pics": null}}, {"review": {"des": "Amazing vegan options by the slice or the pie. Toppings from basic to crazy. Good looking salads, too. The only bummer is (as expected at a place offering so many slices) you can tell when a slice has been sitting out for a few hours. They warm your slices up but they can be s but dried out in the crust.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9eDn7jJRaUWkSW0uMJMXCQ/348s.jpg", "caption": "Vegan Mac and cheese pizza and I can't remember the name of the other, but curry, kimchi and fried onions were involved."}]}}, {"review": {"des": "I love that when you come here you never know what kind of exotic pizza they have made for you to pick from. I had the penne chicken pizza and it was amazing. I love that they put it back in the oven so the pizza has perfectly crispy crust! And they are open until 3 in the am!", "pics": null}}, {"review": {"des": "Well pizza was ok<br>Establishment was kinda rustic<br>But in a pleasant comfortable manner<br>Multiple pizzas ready made and huge variety<br>But they did not score high for me:<br>1 bathrooms out of service - not cool<br>2 no ice for sodas or water - I like ice<br>Pizza was good but not the best<br>This is just my thoughts<br>Based on my experience <br>Would I revisit ? Probably not.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sV09M00JDmaXwpIfZR1F4g/168s.jpg", "caption": "Love late night pizza in Chicago"}]}}, {"review": {"des": "If you like new york style pizza, chances are you'll like this place too. It's not 100% nyc style but i like the thinness of the crust and the variety of toppings they have. The interior is kind hipsterish. <br>Kind wish i had chosen a different pizza topping but would come back if i was in the neighborhood<br><br>Order: <br>Hamburger pizza(?)", "pics": null}}, {"review": {"des": "Thank god for late night pizza! 4 stars because they seem to have some weird issues with their online ordering/delivery and my last pizza was burned and had to be replaced, but overall I've had a positive experience. Their hours in Wrigleyville are perfect for late night food needs and I'll definitely keep supporting them!", "pics": null}}, {"review": {"des": "I work weekends and was super excited when I saw on their website that the location closest to me is open on the weekends and delivers from 11am to midnight. (Because nothing makes a sucky work weekend better than scrumptious pizza.) When I called right at 11am to place my order, they told me delivery doesn't start until 4pm. I was nice because it wasn't the employee's fault, but I do not appreciate the restaurant not bothering to keep their website up-to-date; it shows a lack of organization and customer appreciation. I am severely disappointed and don't know that I can bring myself to order from them again.", "pics": null}}, {"review": {"des": "Big joint with seating in the front/ kitchen in the back with ovens & huge pizza's behind the glasss...hipsters everywhere!  They usually have like 7 different pies available for slices, some of the basics and some of the specialty za's.  Extensive menu with all kinds of different specialty pizzas or you can create your own.. they're known for their Mac & Cheese Pizza!  I went with the BBQ Chicken 'Za and it was outstanding.. you can tell they are using high quality ingredients & homemade sauces, etc.  Prices are a bit above average but the slices are HUGE and like I said earlier.. high Q ingredients!  Definitely a great spot for a quick bite in Bucktown/ Wicker Park area.... get dat did", "pics": null}}, {"review": {"des": "Good pizza! Hipster twist on NYC slices. Friendly and very clean place to hang out and order pizza dining in or taking out. I think we paid $9.50 for a 12 inch pizza with half cheese and half pepperoni not a bad deal. I would like to go back and try their other pizzas in the near future.", "pics": null}}, {"review": {"des": "It's hard to judge this place, considering 99% of the time you come you're completely inebriated coming out of the bars in wrigley. It's pizza, of course it's amazing at 2am!!!<br><br>The pros: I will say that the wide variety of choices and creative concoctions give them an extra star. From tomato feta, to Bbq chicken, to Mac and frickin' cheese!  The line also moves pretty fast and there's a decent sized sitting area, opposed to many other pizza places.<br><br>The cons: the dough is thicker than I like, and the pizza itself isn't the best of the best. Like I said above, the topping options are what equals it out.  It also can get pretty wild at night because of all the drunk college kids leaving the bars. I saw a fight break out once, and a girl passed out at her table all in the same night...", "pics": null}}, {"review": {"des": "Okay guys- we were walking back to our car from a Cubs game and happened on this place. I don't know what magic they put in their BBQ Chicken pizza, but it was amazing. I will be back!<br><br>Details- $4.50ish for my slice. I got my slice really fast (1 person ahead of me). They had several different kinds of slices. They recommended the Mac and cheese or BBQ chicken as their most popular slices. The staff were great and fun to chat with! Nice low key environment.", "pics": null}}, {"review": {"des": "I ordered pizza for a gathering.  The wait was 40 minutes. At two hours they called and said 25 more minutes. 3 hours later it never showed. Screw these clowns.", "pics": null}}, {"review": {"des": "Gave it a 2 because the pizza was really good and I appreciate them having vegan options. However had several problems with my experience. While waiting for my pizza it became so smoky inside the restaurant that my eyes were burning and tearing up. We had also ordered a side of fries and realized when it never came that it wasn't added to our order. Originally I had ordered a 12\" pizza but our server recommended we get the 20\" to share. Then when we asked for a box for our leftovers he refused to give us a large box and told us to stack our half of a pizza and squeeze it into a smaller box. Overall not impressed but the pizza did taste good", "pics": null}}, {"review": {"des": "This is the best pizza I have had since I moved to Chicago in 2011. Is just like a traditional New York Style Pepperoni Pizza. The only thing is they are pricey! My 12 in. was $12 but I would pay it again for the great taste. East Coasters will love this place.", "pics": null}}]}