{"name": "ditkas-restaurant-chicago", "reviews": [{"review": {"des": "This place is great! The atmosphere and staff make you feel at home. Our server, Carlos was such a great guy and so on top of things. The food was outstanding I had the prime rib and baked potato. Soooo good. For desert I had the raspberry cheese cake and my husband had the banana cream pie, deeelish! <br><br>Can't wait to come back!", "pics": null}}, {"review": {"des": "Great bar. Oyster shooters wonderful; I could sit and drink all night with an oyster shooter every little while as my dinner. Shrimp cocktail was four enormous shrimp with a nice cocktail sauce, excellent to share. Bloody mary quite nice and included another shrimp.<br><br>Huge restaurant. Dining room upstairs was a bit more plain than I expected. Mementos on walls but the room was still a little austere. It was nice that the tables are spread out for privacy. <br><br>Salads, Ditkas and wedge, were ok. Slightly marred; the wedge had big chunks of bacon that had been cooked long ago and chilled, and the Ditkas boasted of candy pecans that didn't exist.<br><br>Prime rib and filet were good, fine and filling.", "pics": null}}, {"review": {"des": "We enjoyed a date night at Ditka's while in Chicago. We made reservations for 6:00 pm on a Friday night. We were asked if we would like to sit in the dining room or in the bar area. We chose the bar area as we like the lively atmosphere. We were seated right away. <br><br>Our waitress was very attentive and personable. She gave us her recommendations. I enjoyed a wedge salad, filet, and loaded sweet potatoes. All of it was amazing! The salad was light and fresh. The steak was cooked to perfection! The loaded sweet potatoes were amazing! I highly recommend them!", "pics": null}}, {"review": {"des": "I had a late lunch in the bar today at Ditka's. I ordered the steak burger with fries. The quality of the burger was really good, but the burger had way to many onions on it. <br>The bar is super cool and set up really nice. The atmosphere of the bar is also very comfortable. There are plenty of tv's if you need to keep your eye on a game or dining alone and need something to just watch while you eat.The bartender took really good care of me and I look forward to coming in again and next time for dinner.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-WmU0YRlgsGz9JYLQ5GC0g/348s.jpg", "caption": "Steak burger"}]}}, {"review": {"des": "Stopped by for a quick lunch. French onion soup was tasty but a little on the runny side. Needs to be more thicker as the broth was too soupy. The pot roast nachos was very delicious. They have a small & large order. The small order was enough for three to share.  Ordered the calamari that was tasteless and had no color. Looks like it needed to be fried more. I would not recommend this!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/X3lK2t_HLaz0Kf9S1lJ_3A/348s.jpg", "caption": "French Onion Soup"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RtHrkehGPJQjWKZoztJqmg/168s.jpg", "caption": "Pot Roast Nachos"}]}}, {"review": {"des": "I was a bit concerned when we came here for dinner Monday night and there was hardly anyone in the place. Of course it was Labor Day and a lot of people must have been grilling their Chicago dogs sans ketchup. Anyway, our server Kyle was very professional and efficient, seating us quickly and taking our drink orders. I had their crab bisque, which was a bit salty, but delicious! I actually added some water to it, which brought the salt level down and gave me more bisque! Keeping w/the crab theme, had the crab risotto as my entreé, so creamy and tasty. Shared a filet slider which was so so tender. Had a chance to sneak upstairs where there is lots of sports memorabilia photos and murals of many sport all-stars. Glad I made it to Ditka's on my last night of vacay.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Q8UNGHqNG6CTfLbul_RQig/348s.jpg", "caption": "Filet sliders oh so tender"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mgNXG7LAh5v3Y8rW_AfyyA/168s.jpg", "caption": "Crab bisque a bit salty but very flavorful"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-oA335AYGG-bQ_-E3U_weA/168s.jpg", "caption": "Crab risotto delush"}]}}, {"review": {"des": "Don't like to compare Chicago area athletic icons (or their restaurants) but have to here...we went to Michael Jordan's steakhouse a few weeks ago and dropped in at Ditka's this week...in head to head competition...Ditka's wins in a squeeker.  <br><br>We started with the Seafood Platter (4 stars good...just could have used a bit more of the goodies, but then it is only advertised for two - comes with pickled ginger, nice dips, and killer wasabi). For dinner we had the scallops (5 star stuff cooked perfectly), a single tail of lobster (5 star - our diner said it was her best ever), and the boneless dry-aged ribeye (4 star very nice and very comparable to Jordan's). We split sides of creamed spinach (4 star and better than Jordan's but still not quite as good as Lawry's benchmark) and mashed potatoes (4 stars - not Jordan's trio but nice down home Midwest mashed).<br><br>Nice ambiance to Ditka's restaurant, and you can see he is a down home boy. While there are football mementos all around...and some from other sports...there is no pretense here. If you want to be a bit romantic, go in the dining room for a softer vibe. If you don't mind a bit more noise, stay in the bar area and experience the TVs and the noisier crowd. Both rooms are neat and serve the customers wonderfully. The staff has this down and can take care of your needs. <br><br>For dessert we had the banana cream pie...much ballyhooed, it certainly lives up to its reputation. Give this a try and you won't be sorry...tastes much like bananas Foster in the middle...really good stuff...split it for two.The wine selections are very nice and they won't require your first-born son to finance them. Many offerings by the glass and a lot of reasonably priced bottles. <br><br>Over all this place barely gets to 5 stars...but it gets there. Service was on point, both the wait staff and the bus crew, We never had to ask for something, as they always knew what was coming up and were one step ahead of us. One things gets special mention...the piped-in music. Whoever put together the playlist deserves a kudo...nice background music, heavy on Motown but really perfect with the vibe of the place...loud enough but not too loud...cheers. We will be back to try some of the other offerings...recommended.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GYQNEgar08XOvoA_u7zGbQ/348s.jpg", "caption": "Nice romantic dining room"}]}}, {"review": {"des": "The fresh calamari was perfect. Fresh and perfectly battered. The African lobster was yummy too. Super size dessert. Nice atmosphere, especially for a group of businessmen", "pics": null}}, {"review": {"des": "This was a good meal. Good steakhouse, just nothing super special that would make me come back and pay the price!", "pics": null}}, {"review": {"des": "Came here for the \"Fridge Burger!\"<br><br>What is the \"Fridge Burger?\"<br>\"cheddar, mustard, mayonnaise, onions, pickles, lettuce, tomato\" on an enormous burger and a fresh, soft bun. The Burger is Colossal in size and like the player William \"The Fridgerator\" Perry it does NOT disappoint.<br><br>The Backstory of the \"Fridge Burger\"...<br>Chicago Bears player William \"The Fridge\" Perry was a superstar and instrumental in the 1985 Super Bowl win! He was a favorite among Bears fans who referred to him as \"The Refrigerator.\"  His teammates were known to call him \"Biscuit\" as they claimed Perry was \"1 biscuit shy of 350 pounds!\"<br>See:  <a href=\"/redir?url=https%3A%2F%2Fen.wikipedia.org%2Fwiki%2FWilliam_Perry_%28American_football%29&s=33d978f7d4f193943751203efff21b7a7c90b2f3130934a63c79402c7442464d\" target=\"_blank\" rel=\"nofollow\">en.wikipedia.org/wiki/Wi…</a><br><br>The Restaurant...<br>Has a huge bar and optimal seating.  Staff is professional although I would advise NOT sitting near the kitchen as it is loud and difficult to relax while enjoying your meal.<br><br>FYI-Coach Ditka has his own signature house made wine in several varieties of grapes. (See picture)<br><br>FOR FUN-<br><br>Music:<br>Check out the Super Bowl Shuffle (Vocal Version)<br><a href=\"/redir?url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D5VG4z2L93ik&s=51d4b2253cbe11fef7c1623dd75120addd7235a02f49127c98eb0ae879e5db78\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=5VG4…</a><br><br>William Perry - `The Refrigerator Man` music video<br><a href=\"/redir?url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D8BZGy1XfYPU%26list%3DPLWp2yZh7GCxlTEldSZ8kkW3uCu_jcO-ZR&s=e65ac40128c5b5810768be4f81cf1842c3d693cd3f795a4219bfdc98d505c4e0\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=8BZG…</a><br><br>Article:<br>11 Surprising Facts About The 1985 Bears' 'Super Bowl Shuffle'<br><a href=\"/redir?url=http%3A%2F%2Fchicagoist.com%2F2016%2F02%2F04%2F11_things_you_might_not_know_about.php&s=0cd0c642bae85261a0fbe2bd05a7d0804ef2752224ae5a4187fad867bf3a0b01\" target=\"_blank\" rel=\"nofollow\">chicagoist.com/2016/02/0…</a>", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-VHMVztPZVbAVkwyMFjVog/348s.jpg", "caption": "\"The Fridge\" Burger with Extra Trimmings-like the player-it does NOT disappoint=Touch Down!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vgzacOQmYjlJ6BX4PFWAwA/168s.jpg", "caption": "\"The Fridge Burger\""}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ExLKRSNniAut5GlwK3DtGw/168s.jpg", "caption": "\"The Fridge\" Burger extra trimmings..."}]}}, {"review": {"des": "Top Notch!  Came here tonight to celebrate my Dad's Birthday!  Staff, food, and service was impeccable!!!  This restaurant knows how to treat their guests.  Our table had pot roast nachos, the \"Fridge Burger\", and the pork chop.  Everyone loved every bite.  My kids were impressed w/ the Mac n cheese and chicken fingers as well.  Can't wait to come again!", "pics": null}}, {"review": {"des": "Go to Ditka's for:<br><br>--A great old-school steakhouse atmosphere<br>--Top of the line service<br>--The absolute best steaks in Chicago<br>--To-die-for seafood bisque<br>--A cool spot to catch-up with friends after work, or to meet some new ones while you're shopping/sightseeing<br><br>My friend and I loved our dinner!!", "pics": null}}, {"review": {"des": "I've yet to have dinner here, but I can recommend Ditka's a great spot for a weekend breakfast. The restaurant opens at 10 am on Saturday and Sunday, and it offers a fine menu of good food at a great price.  Service is consistently terrific, also. <br><br>Almost everything on the menu is between $9 and $14. The Quarterback Breakfast (two buttermilk pancakes, two eggs any style, sausage or bacon) may be the most delicious breakfast deal in downtown Chicago at $11.50.  My wife recommends their corned pot roast hash scramble. <br><br>This is a nice, quiet spot that's tucked in between Michigan Ave and Rush Street.", "pics": null}}, {"review": {"des": "This is the best even if you are not a Bears fan. Great atmosphere and fantastic food. My come to place every time I come to Chicago and have seen \"the coach\" several times. He is the best!  If you are a Bears fan and haven't been here, bucket list for sure. Bear Down!", "pics": null}}, {"review": {"des": "Great place to grab a sit down work lunch. Staff is on point and fast. The menu options are varied enough and won't break the bank. <br><br>Their bread is so fresh and warm if you order it. I had a steak salad with filet mignon cooked medium. Their salads are filling but the portion of the meat was small.<br><br>I'd look forward to returning for other work events and trying other options.", "pics": null}}, {"review": {"des": "I just swung in here for drinks, I will have to come back for food on my next trip to Chicago. My friend and I sat at the bar for hours catching up. I will say the crew working was awesome! Very attentive, but not pushy, great at mixing drinks, and quick with a joke! <br><br>Thanks for a great evening!", "pics": null}}, {"review": {"des": "Consistently delicious food and good service. You can sit in the bar for a livelier experience or in the dining room for a little quieter setting.  Great burgers, steaks, wings and solid brunch options. Chicken and waffles are a big hit, corned beef hash is good but not inventive. Bloody mary is on the spicier side but tasty. Their mule is refreshing and a delight.<br><br>Don't overlook this really good restaurant because you think it may be touristy. Service is really great and the food is tasty without being offensively expensive. If you're a football fan, it's loaded with great memorabilia.<br><br>They also offer a wonderful Thanksgiving dinner option if you ever feel like letting someone else do the cooking!", "pics": null}}, {"review": {"des": "Heard from a friend this place was great for Thanksgiving dinner so we're decided to try it.<br>Yea not so much....... Turkey was very generic and dry, short menu with limited choices, decided on the steak since their seafood menu is all mostly shellfish and unfortunately I'm allergic.<br>Steak was very cheewy and gummy plus generic, turkey was super average and no dark meat option might as well be out of a box. <br>To say the good with the bad , overall service was very good and professional and very apologetic for their average food choices!", "pics": null}}, {"review": {"des": "Here the servers are very pleasant. I came here with a group for work during a conference. Let's get the only bad thing I have to say about the restaurant out of the way: it took way to long for them to take our orders.<br><br>Phew, now onto the good. The appetizers were all delicious. We had the coconut shrimp, the poke tuna nachos, and some type of baked cheese Parmesan crackers. Delicious.<br><br>The entree I got was the 16 oz New York strip rare. There was some gristle and sinew in the steak which was a little disappointing, regardless it was a nicely cooked steak with a good outer crust and sear.<br><br>The deserts we tried were the flourless chocolate cake and the cheesecake.. nothing special here, but they were both very good.<br><br>I'm not a huge fan of steakhouses simply because with a cast iron skillet it's pretty easy to make something similar yourself for a quarter of the price. But Ditka's really shines in the service, and appetizers! Which you can't get at home. I would recommend this place to a friend :)", "pics": null}}, {"review": {"des": "Awesome slow roasted prime sandwich!!! The Fridge Burger is an amazing lunch!<br>Great service and ambiance.", "pics": null}}, {"review": {"des": "We decided to come here on the whim and it didn't disappoint. We had the calamari to start with which was pretty good. We then ordered the strip steak and a paddle steak along with a side of the risotto and fries. The steak was good and cooked to temperature. The risotto was good, however, it was a little bit too heavy and the fries were decent. <br><br>Overall, the meal was good and the service was great. When we do come back, we'll probably order different things because of how heavy our meals got.", "pics": null}}, {"review": {"des": "Staying at the Tremont and wanting some brunch... I ordered their fried chicken and waffles. BOMB! The chicken was moist and crispy! And the waffle was too (it didn't get soggy). The waffle had a sweet flavored bite to it ;) Highly recommend! <br><br>A little more spice to the chicken would have topped it off, but I should have asked or requested it. Other than that, I enjoyed my brunch in room and the staff was friendly.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/x9_IxDenJTagjsYRr9bN2w/348s.jpg", "caption": "Fried Chicken & Waffles"}]}}, {"review": {"des": "Really great clubby ambiance and one of the best burgers in Chicago are the highlights here. <br><br>The Fridge burger has every thing I like on a burger: lettuce tomato, mustard, mayo, pickles and cheddar cheese. The patty was huge and perfectly cooked, and the bun held together despite the incredibly juicy content.<br><br>The fries looked great, but were unremarkable, and not crisp enough. But you can get several other sides, including slaw or fruit.<br><br>The atmosphere is like a mini-steakhouse crossed with a sports theme. But unlike sports bars, the dining room is classic white tablecloths, with no TVs, just lots of sports memorabilia in cases. If you like more of a bar atmosphere, there is a separate space for that, and also a nice outside dining area.<br><br>Lunch pricing is extremely reasonable for the area.<br><br>Service was friendly and efficient.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tGpNuckdLsHoTtQjuqOOtA/348s.jpg", "caption": "The fridge burger"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Y6zHLoLxR8j9oEIrICgb2A/168s.jpg", "caption": "Mini burgers"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OEucFHpLj0b5ZNNPFole-Q/168s.jpg", "caption": "Exterior"}]}}, {"review": {"des": "We came for the nachos and ended up being wowed by the cheeseburger.  I have always wanted to eat here being a life long Bears fan.  Our mother son sports weekend where we caught 4 games seemed the perfect time.  I got the Pot Roast Nachos.  My son ordered the Fridge Burger.  I liked my nachos a lot but then I had a bite of my sons burger.  Omg.  One of the best burgers I have ever had.  Thick, juicy patty, seasoned perfectly, soft bun, melty cheese.  It was amazing.  Service was good.  We were one of only 2 parties on the patio the last day it was open for the season.  I think our server was spread a little thin having tables inside and out but she still did a good job.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UKz0ODMk-K7nF0szXxm7Og/348s.jpg", "caption": "Small Pot Roast Nachos"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TjAvi9KF_g5f46zLi-LSBg/168s.jpg", "caption": "Fridge Burger.  One of the best burgers I've had."}]}}, {"review": {"des": "We strolled in after exploring Chicago all day and sat in the bar area. We really enjoyed the old school vibe and cool decorations. Service was fast and everything was very good! We were dressed facially but if you sit in the dining room for dinner I'd definitely dress up a little", "pics": null}}, {"review": {"des": "Came in for lunch and sat at the bar area for quicker service. The waiter recommended an off menu speciality of the day that I had to try and the turkey sandwich was truly delicious. Flavorful with every bite and the sweet potato fries were perfect. This is our second time here and both visits delivered good service and good food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Zkk42J-lKSpK95bOy6TICw/348s.jpg", "caption": "Lunch time at the bar"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JzerkunmgJvA8bOsvyyeRA/168s.jpg", "caption": "Turkey special sandwich with gravy! Yummy"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mqCUD_TfOgFbl_4gp60eqw/168s.jpg", "caption": "Lounge"}]}}, {"review": {"des": "This restaurant wasn't the original we had planned to visit but boy was I impressed! <br><br>Had the fried chicken and their fridge burger, both amazingly delicious. The dishes that I believe to be true underdogs of a steak house but we're so good that when I return I will make sure to order them again! <br><br>The fried chicken was so flavorful and perfectly golden fried, the fridge burger had an original sauce that tasted a bit like McDonald's Big Mac sauce but was 10X's better! The beer party was perfectly cooked (medium well) and very well seasoned as well. <br><br>Service was good, the server was incredibly knowledgeable from the food menu to decor of the restaurant itself.", "pics": null}}, {"review": {"des": "Enjoy the food and service at Ditka's. The rissotto was unreal! The service was quick and attentive. Really enjoyed our meal!", "pics": null}}, {"review": {"des": "A few of my good friends and I decided to take an impromptu day trip to Chicago about a week ago, and one of them insisted we eat at Ditka's. I was a bit skeptical; you don't typically associate a restaurant with a sports-related name with high quality food, but boy is that stereotype not true here. I was incredibly impressed with Ditka's, and I really want to come back.<br><br>From the moment you step in, you can tell you're in a premium experience. I would recommend dressing at least a little classy. I was fine in a polo and khaki shorts, but I wouldn't suggest rolling in with sweatpants and a t-shirt. The interior is beautiful, with stunning wood themes. We were escorted to our table by the extremely helpful and kind staff. <br><br>Our waiter was great, and he joked around with us and made sure we had a great experience. We weren't here for a full steak meal, but I would LOVE to come back and try the steaks. I'd also love to try \"da pork chop\", another apparent favorite here. It sounded/looked amazing. We ordered a few dishes to share. We ordered the wings, the meatloaf, au grautin potatoes, and the pork nachos.<br><br>Oh man, let's talk about that meatloaf. The meatloaf is deceptively huge in person. For $20, I was expecting a good sized portion, but this thing is massive. We couldn't eat the entire thing. It's arranged in such a cool manner; the bottom layer is a jalapeno cornbread, topped with the meatloaf, and then mashed potatoes. On top lies a bed of onion straws. It was delicious! Cornbread is my weakness, and when I read that it was included, I knew I would love this dish. The meatloaf was tender and seasoned well.<br><br>The other dishes were great as well, but I mostly stuck to the meatloaf; it was that good. I also had the Pomegranate Rum Punch. This was certainly one of the more interesting drinks I've had. It looked stunning. It isn't something I'd be likely to order again, but that's simply because I discovered I wasn't a huge fan of the pomegranate and alcohol flavors mixed together; not the restaurant's fault. I'd love to try some of their other drinks.<br><br>Overall, this is somewhere I am so happy I tried. I will definitely return next time I'm in Chicago.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/slxCSNCMBl3Fng4hcW_OHQ/348s.jpg", "caption": "Bread and butter, a classic!"}]}}, {"review": {"des": "I was horribly underwhelmed.  This is a place that looked like it \"used to be\" outstanding but just didn't keep up. The food was \"okay\" but not what I expected from a place like this. The waitstaff didn't seem happy to be there either. All in all a huge disappointment and I am NOT that hard to please.", "pics": null}}, {"review": {"des": "We were able to get in on a busy Friday night before the marathon. Ordered the coconut shrimp which were the best we've ever had. They were very fresh, appeared freshly battered. I had the crap cake and it never fails to impress. Yum", "pics": null}}, {"review": {"des": "We had Thanksgiving dinner at Ditka's . The meal, service & atmosphere were wonderful. For an extremely busy day, the food was delicious & came to the table hot. Kudos to the chef & his staff. Would definitely come back.", "pics": null}}, {"review": {"des": "Went there for the first time with two guy's that just flew in from Holland. <br>Waiter said that their Pork Chops were the best in the city of Chicago. <br>I hate to cook, and I have cooked Pork Chops,  the shit that I was served was like shoe leather. <br>I think it's all bull shit!!!!!!<br>Way over priced for a shit dinner!!!!!", "pics": null}}, {"review": {"des": "My experience with \"Ditka's\" Easter brunch buffet was very positive.  I had always worked on Easter Sunday, yet not this time.  Perhaps I was overjoyed, I started \"shopping\" for a restaurant that featured brunch buffet for a fixed price.  <br><br>For around $50/person, \"Ditka's\" Easter brunch menu had a wide variety: morning pastries, yogurt parfait, carved meats, eggs benedict, mani mahi, mashed potatoes, scrambled eggs, pancakes, sausage/bacon, made-to-order omelets, RAW SEAFOOD BAR, chocolate fondue station, mini/bite-sized dessert.  I almost didn't notice the raw seafood bar since it was sort of tucked away behind the omelet station.  The oyster shooter was so addicting; I believe I had two (2) of them back-to-back.  <br><br>I also needed to mention their creme brûlée.  It definitely screamed quality!  The texture of caramelized sugar on the first bite was very captivating.  Of course yes, I had two (2) plates worth of dessert.  <br><br>Coffee and tea were included with the price.  They served Lavazza Coffee.  Hubby was quite digging their iced tea.  George, our main server, continued to bring out a new glass of iced tea every time he finished one.  <br><br>We were fifteen (15) minutes late to our 10am reservation.  After we called in and gave them a heads up, the hostess was understanding and very accommodating.  The dining room was filled up by 11:30am.  Hence, book the earliest time possible so that you would have less of jeopardy on losing your spot!  <br><br>Service was extremely coordinated between each one of the waiters.  They paid attention on the status of silverware and giving us a new set when necessary.  Water was re-filled in a timely manner; coffee was topped off when it was half-empty.  Overall, they were responsive for our needs and fulfilling them as quick as they could.  <br><br>Without a doubt, I will absolutely come back to Ditka's for their Easter brunch buffet.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/et-kfdX_yMLVSFXFJeLy1A/348s.jpg", "caption": "Plate #5"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pyrfgk8bG44DVvm9Sue0jA/168s.jpg", "caption": "Plate #4"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/s56fWdqbr8CFmkF-n3nqfg/168s.jpg", "caption": "Plate #3"}]}}, {"review": {"des": "Food is good. Servers are awesome. Moderately price. Worth trying. Ambiance and music is pretty cool. If I live close yes I'll come back. Parking is not free... of course it's downtown chicago. Nothing is free for parking.", "pics": null}}, {"review": {"des": "The Easter brunch was/is Fantastic. Lots of selection, the crowd was acceptable. We made Open Table reservations online and it went perfectly.<br><br>Best item was the Pot Roast hash. If you like meat Ditkas is it. Next up seafood, then a few vegetable selection and a premium Fondu table.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/w_iR6UJLH9PXyRlFXqZ7Yw/348s.jpg", "caption": "The guy in the middle and those other two."}]}}, {"review": {"des": "I liked the theme of this restaurant with the sports memorabilia. I'm always a sucker for free bread before the meal, the freshly baked bread was great. I ordered the daily special which was a roasted chicken, it was well seasoned and cooked to perfection.", "pics": null}}, {"review": {"des": "This is one of my favorite restaurants around. The cheeseburger is always cooked perfectly and it's nice and juicy. That's my go to here because sometimes I just order it to go. <br><br>I've never had a bad meal here. Their biscuits and gravy are also one of my favorites, but you have to like lots of pepper. <br><br>We also had our rehearsal dinner here. Talk about top notch service. They made my family feel like Kings and Queens. The surf and turf was amazing. Banana cream pie was the same. <br><br>I'm also a big Chicago sports fan so I always feel right at home here.", "pics": null}}, {"review": {"des": "Ok Ditka! I'll give it to you- pretty cool spot for any occasion really from the good O boys to the stroll in tourists the crowd is pretty diverse. We had the ribs and the crab cake platters. I didn't do full 5 star because the crab cakes had too much onion and the lobster Mac had like 2 small slices of lobster and not my favorite made. But the amount of TV's to catch the games we're cool. The service we had was great and the ambience over all was cool. The food was legit just not out of this world. The desserts however were <a href=\"/redir?url=http%3A%2F%2FBOMB.com&s=ac71b33d32e90570e9c0d70edf9b4cac5f20e98e10501794c62801370f5dd3f7\" target=\"_blank\" rel=\"nofollow\">BOMB.com</a>!", "pics": null}}, {"review": {"des": "I ordered the halfback filet mignon center cut, 8 oz, loaded twice-baked potato and the caramelized brussels sprouts. Everything I had that night was terrific. I wandered into this restaurant entirely by accident it was one of the best meals that I had in Chicago. <br><br>I love steak, and I have ordered them all over the United States, and the Steak served at Ditka's is now on the top of my must eat list. The steak was a little less done than I ordered but it was lovely and buttery in texture. I ate the steak without any sauce whatsoever. Although, I don't recall any being offered. The steaks are priced a la carte so you have to pay for each side you order. The sides are huge so If you are on a date order them to share. I took the remainder of my sides back to the hotel and ate them the next day. This is not a restaurant to come to on a budget. I ate alone and without out any drinks spent over $50 for dinner. I was on vacation, so I tend to splurge when I am out. The price of dinner was not off-putting to me. Two gentlemen next to me were having a work dinner with larger steaks and drinks, and they had a bill well over $200.", "pics": null}}, {"review": {"des": "Generally go here atleast once every time im in town. Great Chicago staple. If they have it, get the tomahawk steak. Its an off menu item so ask for it. You wont be let down.", "pics": null}}, {"review": {"des": "Happened to be staying at the hotel next door so grabbed a banana cream pie to go.   Can't comment on anything else but the banana pie was fabulous.  Not too sweet and a great mix of cream and bananas.   I'd def get it again.", "pics": null}}, {"review": {"des": "Stopped by for a quick lunch after checking into the Drake on a business trip. Didn't really know my way around and this was the first place that looked like it may have good burger. Not disappointed and the fries were amazing!  Service was quick and place was nice.  Definitely will go again next time I stay in that area.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YztDF1wOVTpTx4a0ETQKIw/348s.jpg", "caption": "The Fridge, add mushrooms. Good burger. Fries were great!"}]}}, {"review": {"des": "One of the best rib eyes I've ever had; cooked and seasoned perfectly. The atmosphere was lively and the service was great. I will be back", "pics": null}}, {"review": {"des": "I've been visiting Ditka's for years and the staff and food never disappoint. The Gold Coast Meatloaf is my go-to and is amazing. Whenever I have an out of town guest or something to celebrate, this is my place!", "pics": null}}, {"review": {"des": "Great Bloody Marys! The food was also amazing and the staff was very accommodating. The perch dinner was one of the best fish plates we've ever had.", "pics": null}}, {"review": {"des": "The taco salad was outstanding. Just hot enough to tingle. Loved the chicken and corn with the tortilla strips. Great service with the best looking waiter ever", "pics": null}}, {"review": {"des": "I only visited the lounge for drinks and snacks but the Bloody Mike (Bloody Mary) was amazing and warrants a 5-Star review.", "pics": null}}, {"review": {"des": "Excellent food and service! We made a reservation, but I think we would have been fine if we just walked in. Its a large restaurant. Our waiter went out of his way to make sure we had a good meal, he even brought us a dessert that wasn't on the menu. If you're in this area I would recommend stopping by!", "pics": null}}, {"review": {"des": "Absolutely an awesome place. The nostalgia all over the walls is great. But the energy and the steaks put this place over the top. A definite must visit if you're ever in town and know who Ditka's is or have ever heard of the Chicago Bears.", "pics": null}}, {"review": {"des": "Dined in with a large group a few weekends ago and had a great first experience at Ditka's! While we waited for our entire party to arrive, some of us sat in the bar area upstairs and the bartender was very polite, knowledgeable about the menu/drinks, and very attentive. <br><br>Once everyone arrived we sat down at our table and ordered a variety of appetizers that were all great. We had two orders of the pot roast nachos, an order of the maki roll, an order of the caprese, and I ordered a bowl of the crab bisque. I only tried the nachos/bisque personally, which were both amazing, but heard the other two appetizers were good as well. <br><br>For my entree, I ordered the filet. It was just okay, but I wasn't really in love with it, especially because it came undercooked from the temperature I asked for. I was going to ask our waiter to send it back to be cooked more, but he disappeared once our food was delivered. We tried the mashed potatoes and lobster mac and cheese, which were good, but I was more partial to the mashed potatoes than the mac and cheese. <br><br>The real hero of the meal was the dessert. I was stuffed but we ordered a few slices of banana cream pie to split amongst the group and I ended up eating almost a whole piece. It was delicious and is a must order!", "pics": null}}, {"review": {"des": "We celebrated a b-day there not on the cheap, bottle of wine, apps, steaks, desert. Here is what went wrong:<br>- We waited too long to get seated even though it was not busy (around 4pm)<br>- Server spilled wine when opening the bottle on the  table and did not apologize or clean it<br>- No bread arrived. We had to ask for one once our appetizer came<br>- The soup was not tasty at all and too salty<br>- Server did NOT ask how we wanted our steaks done<br>- The steaks have weird sides, seriously cherries and apple puree I felt like in a nursing home<br>- We asked for someone what is the best place for pics at the restaurant and were not given direction<br>- No one sang happy b-day to our party<br>Spent too much money . Not worth at all. Won't be back or recommend to anyone.", "pics": null}}, {"review": {"des": "While visiting some family in the city for the holiday I rushed to get a last-minute reservation for Christmas Eve. I called around and couldn't find anything although it was only a party of two.<br><br>I've been to Ditka's before but only for drinks and appetizers. As a diehard Bears fan, I needed to call and test my odds. Luckily enough, they were able to squeeze me in with no wait time at all.<br><br>My girlfriend and I split the fillet as well as the scallops with lobster risotto and the food was five stars. The service was five stars. The atmosphere was five stars. The overall experience was five out of five stars!!<br><br>This is a must go to place for anyone visiting or who live in the area!<br><br>BEAR DOWN!!!", "pics": null}}, {"review": {"des": "This is one of the worst meals I have ever been served. I have never sent food back to a chef before this experience. The soup was flavorless. The calamari smelled bad and was undercooked. The prime rib tasted as if it had been  sitting in a refrigerator for days and then was microwaved to order. I will be shocked if I or someone I went with doesn't get food poisoning. What a waste.", "pics": null}}, {"review": {"des": "Had a nice meal, watched the game and didn't break the bank! The ribs were great, pot roast nachos and wedge salad. All delicious.", "pics": null}}, {"review": {"des": "Went for Christmas Eve dinner.  Something for everyone and won't break the bank.  You can wear jeans too.  We sat upstairs in the front of the dining room which allowed us to see the tv's in the upstairs bar area.  Scallops and risotto were tasty.  Chocolate cake was huge!!", "pics": null}}, {"review": {"des": "Visiting from out of the area and joined a friend and her family for dinner (they've been previously). <br><br>Portions are HUGE!!!! Prices are on the higher end, but you definitely won't leave hungry. Service was quick, friendly, and never missed a beat (if a glass started to get low - it was filled without asking!).<br><br>Dessert and drink menus looked great, but no room for either. We ate upstairs which wasn't conducive to conversation due to the acoustics, but if your looking for a place with delicious food, and fast, friendly service - definitely a good option!<br><br>Baby Back Ribs were tender, falling off the bone, but the rub was a bit salty, and the sauce had a little kick, but they were delicious! The fries were perfect, and beware a \"side\" could serve the whole table! The cole slaw was on the drier side, but well-seasoned, great flavor, and complemented the ribs perfectly. Everyone else enjoyed their meals: Cornmeal Crusted Perch, Meatloaf, and Cheeseburger sliders.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2LB7WAwiqSvZGZovY2xp8w/348s.jpg", "caption": "Sliders"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gO1P5KqQBIi--JzSdgx0Bw/168s.jpg", "caption": "Meatloaf"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/K8ha_v2Z56c-I93X7SUjGw/168s.jpg", "caption": "Cornmeal Crusted Perch"}]}}, {"review": {"des": "I've eaten beee a bunch of times and was pleased with the appetizers and their tasty fried chicken.  Today I had the boneless ribeye.  It had very little taste when I compare it to other area steak places such as Gibson's and Erie Cafe.   It was very disappointing.   Service is great and I'll come back for other items but not the steaks.", "pics": null}}, {"review": {"des": "I came to Ditka's restaurant while traveling to Chicago on business. I started with the Caesar salad which was excellent and perfect portion for a starter salad. For the main course, I went with the steakhouse burger which was excellent and cooked to perfection. <br>The bartender working that night was also excellent and very knowledgeable on the menu and answered any questions that I had.", "pics": null}}, {"review": {"des": "I frequent this restaurant every time I go to Chicago. I love the filet and crab cake meal, but the best part is the singing by John Vincent. He has the most incredible talent, and is the real reason I make a special trip to Ditka's every time I travel to Chi-town. I've also always had excellent service and food. I highly recommend, but make a reservation and valet park your car.", "pics": null}}, {"review": {"des": "Seafood tower was good, our kids loved the nachos. The steaks and burgers were flavorful and cooked perfect the way we asked.  Solid place to go after shopping at the mall.", "pics": null}}, {"review": {"des": "Had dinner here with a group of nine people this week.  The pot roast nachos were fantastic.  Unfortunately my steak came out medium well to well done when I ordered it medium rare.  Our waiter didn't show back up for almost ten minutes, so I almost gave up and ate, as everyone else in my group was pretty far along with their meals. <br><br>When our waiter finally came by, he took one look and acknowledged the mistake.  He sent over a manager, who told me that it would be ten more minutes until a replacement would be ready.  I expressed my displeasure over the fact that my entire party would be finished before my steak arrived and told him not to bother.  To his credit he asked me to let him figure something out, and two minutes later brought me a steak that was originally intended for another table.  I thanked him and dug in, only to discover that the second one was overcooked as well.  <br><br>I appreciate the effort but two in a row?  And neither one was close to medium rare.  Disappointing.", "pics": null}}, {"review": {"des": "Always a solid delivery on service and food. Been here for lunches, dinners, and even a New Year's celebration complete with Ditka appearance. Sad they took the meatloaf off the menu but everything else is always served to order. The location makes for a great day of shopping pre or post Ditka's visit.", "pics": null}}, {"review": {"des": "Overpriced Tourist Trap.  Not worth the $$$.  I had a $50 steak here that had to be one of the toughest, fattiest steaks I've ever eaten.<br><br>The place was also very noisy.  A large family with unruly kids sat next to us.<br><br>For the $$$ I expect better service, better food and a better steak and a more intimate atmosphere.", "pics": null}}, {"review": {"des": "What a great place and a wonderful experience. We had an exceptional young lady they gave us the best service available. The food was solid and definitely above average. The nachos were ridiculously good. Burgers good the Manhattan was above average and overall just a great dining experience we really enjoyed ourselves. Very very recommended. BTW I didn't want to go to Ditka's in the first place cuz I thought it was too commercialized and I was wrong. Go enjoy it.", "pics": null}}, {"review": {"des": "Went here last night with visitors from out-of-town who wanted to dine there. We Hadn't been before so agreed to go. Made reservation and was seated right away In the upstairs dining room. The upstairs dining room had virtually no atmosphere - felt like a hotel side room. Service was spotty - obviously had too many tables. Food was good but nothing special. Scallops over lobster corn risotto was super sweet - too much sugar. The crowd was very touristy and suburban. Have no desire to go back.", "pics": null}}, {"review": {"des": "Overall: A classic Chicago stop, Ditka's doesn't disappoint. Be sure to come with an appetite (and a wallet).<br><br>The good: Great tasting food options, our party loved every bit. The lobster mac was creamy and chunky, the meatloaf was overwhemingly great, and the steaks were huge and juicy. Huge portion sizes and a decent menu selection. Service overall was friendly and attentive. Atmosphere is all about Ditka and sports, obviously. <br><br>The bad: Even w/ a reservation, we had to wait 15 minutes. Perch was a tad disappointing. Prices, while expectedly so, still seem a tad too high. <br><br>Atmosphere: 9/10<br>Service: 9/10<br>Food: 9/10", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/i_QpdEgZXJX3MFJ31TTcRQ/348s.jpg", "caption": "Perch"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WVxQnCLQQ6vqQR6i0cH0eQ/168s.jpg", "caption": "Meatloaf"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6hFCkBgLwxA7GIzPiLpDHg/168s.jpg", "caption": "Lobster mac and cheese"}]}}, {"review": {"des": "Nice place to watch any type of games! Good food, fair price and beautiful place, very detailed oriented!", "pics": null}}, {"review": {"des": "My husband and I were in Chicago for a short vacation and decided to visit here. He is a huge fan and we couldn't pass it up. We made reservations through open table for a 5:30 dinner. We got there about 20 minutes earlier than we thought but they were ready for us. We chose to sit in the dining room, and it was fairly quiet. Our orders were taken promptly and came out fairly average time wise. We ordered the fullback filet mignon and a New York strip, with the \"shareable sides\" loaded twice baked potato and French fries. They are not kidding when it says shareable! The potato was huge, filled to the top, and there was plenty of fries leftover. The steaks were phenomenal, I wouldn't order any entree but steak. Service was excellent as well. No complaints at all!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ofEFRvwirSb6Hdo_fSn0WQ/168s.jpg", "caption": "Fullback Filet Mignon and Twice-Baked Potato"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IoDm3nzVo6lZkUl_6XSgfA/168s.jpg", "caption": "New York 16 oz. Boneless New York Strip Steak"}]}}, {"review": {"des": "This is a great steakhouse. Not too expensive. Great quality. Love the casual vibe. Only thing that would make it better is an outdoor dining area!", "pics": null}}, {"review": {"des": "Such a great place. Our server was knowledgeable. The food was really good. Terrific filet. My drink was never empty. I'd definitely go back.", "pics": null}}, {"review": {"des": "This is a little fancy place. You think that it will be a sports bar but it's a little more fancier. <br><br>If you eat downstairs, then you get the typical fancy dinner. However, go upstairs and you get the sports bar feel with TV with the fancy food. Today, I chose the sports bar feel. <br><br>I was told to go upstairs to check it. They sat me at a high top which was your typical high top. It was against the railing for the stairs which also had a ledge to hold your jacket and for your date to hold her purse. It was close to other tables but never felt cramped. <br><br>I ordered the Oyster shooters. It tasted fresh with a strong dose of Tabasco. The Tuna Poke \"Nachos\" was also delicious and refreshing. The Sriracha Aioli and Wasabi cream had a nice balance. My date who is anti spicy foods even said it didn't make her mouth burn. The Crab cake was amazing. I make a well known Crab cake considering I was a fine dining chef for many years but I think we both agreed that this place had me beat. It was probably much more un-healthier but still very very delicious. <br><br>Now to the only bad part of the food. The Lobster Mac n Cheese. They used Rotini pasta (if I recall correctly) and those ridges would be nice if it had a nice thick sauce. Sadly, the sauce was very thin. It was lacking in flavor and body as well. The lobster tasted dry and old and rubbery. <br><br>The wait staff was very attentive and friendly. Everyone had a nice big smile which is rare these days. How often do you visit a place where wait staff actually enjoyed their job? Rarely... I know but it happened here. <br><br>Overall, I did enjoy this place and I must return back to eat their steaks. I kept seeing them walk by for the private party and it looked/smelt amazing. But sometimes you just want to eat appetizers and that is what occurred here.", "pics": null}}, {"review": {"des": "First time here but won't be the last. Popped in on a Saturday at lunch hour to eat and watch some football. They have a quiet dining area downstairs separate from a more boisterous bar. They also have an upstairs bar with a separate private dining area. I chose to dine upstairs where you can also watch the games and enjoy a little more subdued experience. The staff was very friendly and attentive from the coat check to the final bill. I started with the homemade chicken noodle soup which was very good. For my main, I had the petite filet mignon with mashed potatoes and asparagus. I ordered medium rare and it was cooked to perfection. Prices were very reasonable especially for Downtown Chicago. And , if you're a football fan, there is a lot of cool photos and memorabilia adorning the walls.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-TY8XcPWc-2VSMQgErQIyA/348s.jpg", "caption": "Petite Filet Mignon Duo. Awesome!"}]}}, {"review": {"des": "I visit Chicago regularly, and Ditka's remains my favorite steakhouse while in town.<br><br>The steaks are always juicy and tender, with great flavor.  I generally get the butterfly cut.<br><br>The baked potatoes are huge.<br><br>The decor is what you would expect from a steakhouse, dark wood paneling, nice dark leather booths, medium lighting, a couple of TV's showing sports, with some paintings of Ditka and a few other former football players on the walls.<br><br>The service is always excellent and efficient.<br><br>I visit Ditka's on a regular basis on my trips to Chicago, and highly recommend it to those seeking an excellent steakhouse.", "pics": null}}, {"review": {"des": "The chicken and waffles are amazing! huevos rancheros was delicious too, if your eating breakfast. . Fun atmosphere and what's not to love about Mike Ditka!", "pics": null}}, {"review": {"des": "Their entrees are no nonsense generously portioned, filling and down right delicious. In you come hungry, out you go stuffed to the top with doggie bags to go. Ditka's is suitable for all occasions with great food for everyone, especially for bro's night. The meat loaf is probably one of the most eye-catching dishes at Ditka's. Huge savory portion with a foundation of sweet cornbread, two thick meatloaf patties topped with mashed potatoes and fragrant onion strings. The best meal I've had this week that can last at least another 2-3 days. Do yourself a favor and get it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iNLXnOUNaFy7oTpEjHkkcQ/348s.jpg", "caption": "Blueberry cheesecake. Fresh blueberries, whipped cream, blueberry coulis."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DgKeJYJ0hHtCiO94kkRH3A/168s.jpg", "caption": "Blueberry cheesecake. Fresh blueberries, whipped cream, blueberry coulis."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5lU84dZ9_tDjpovNxFFMNQ/168s.jpg", "caption": "Diver sear scallops and lobster risotto."}]}}, {"review": {"des": "I REALLY loved the ambiance at Ditka's. Very comfortable and relaxed bar area on the main floor and upstairs. All of the Bears and Ditka memorabilia really makes the place pop, setting it apart from other nice bars.<br><br>I had the \"Fridge\" Burger. Pretty simple, but monster burger patty on a very tasty Turano bun (Chicago represent!) I keep hearing about the pot roast nachos, need to try those next time.<br><br>To top off the nice lunch, I got to meet the head chef. He's been there since the first year Ditka's opened. Great guy!", "pics": null}}, {"review": {"des": "I love Ditka and the '85 Bears so this was a must visit when we came to Chicago. I expected to be disappointed because I usually am with things I am looking forward to, but this meal was awesome. <br><br>We started with some nachos. I'm a Connecticut yankee and love my pot roast, but didn't believe the menu when it said pot roast nachos. There was, in fact, pot roast on a filling but perfectly apportioned plate. The nachos stayed crisp despite a perfect amount of toppings, and the roast made them the best nachos I have ever had. <br><br>My wife had sliders for an entree, and really enjoyed them. I had their lowest grade wet-aged paddle steak, which was recommended by the server because I like my meat well done. This was accompanied by mushrooms and some whipped potatoes. <br><br>My meal was so good that I would have French-kissed Ditka if he walked in the door, porn-stash and all, and I'm really committed to women (read wife here). <br><br>I am finicky about beer, and I also really enjoyed Ditka's own ale. Even though our server was covering the entire bar side of the establishment, every time I thought of needing something someone appeared. I'm lucky this place isn't closer to where I live because I would eat until my innards burst like the gluttony victim in the movie Seven.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/n_E-OGslU84v_YU8VQL6Ag/168s.jpg", "caption": "Partially eaten pot roast nachos."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/J1dEOf2jfU2powQHU0Ne5A/168s.jpg", "caption": "Partially eaten wet-aged paddle steak."}]}}, {"review": {"des": "I went to this restaurant with a coworker while visiting Chicago last week. At first I didn't know what to think. I thought it was going to be a hamburger joint with french fries, but when we entered the restaurant it was actually pretty classy. The menu had a great selection and various prices.<br>They even had a few specials where you got four piece meal for $35.00. We both ordered steaks and I'll tell you what, they were perfect!!! The service was on point. Our waitress was very professional and kept our table not needing a thing. Next time I go to Chicago I will definitely go back.", "pics": null}}, {"review": {"des": "Food was good had the tuna and wedge salad I will be back love the atmosphere and the service was great", "pics": null}}, {"review": {"des": "I have had drinks and oyster shooters at the bar many times, but I have not dined here till recently<br><br>I LOVE this place!!!<br><br>The BAR area either upstairs or downstairs is awesome. Great bartenders because they make great drinks and are personable<br><br>The upstairs bar has live music at times which makes it so much fun- especially when everyone starts to sing and dance<br><br>My standouts are:<br><br>*Dirty Stoli martini with blue cheese olives<br><br>*Oyster shooters w Stoli<br><br>*Blue point oysters- large, chilled, firm and briny<br><br>*Tomahawk rib eye with blue cheese sauce- huge, tender and tasty<br><br>The biggest bonus is that you can bring your own wine and they do NOT charge a corkage fee!!!<br><br>I will definetly be back to Ditkas", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/03Tx1F6tFSf2A_3_ZYMZvw/348s.jpg", "caption": "Huge blue cheese sauced Tomahawk rib eye-YUM"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pbiwD0LhxshMrB9OkommFg/168s.jpg", "caption": "Dirty blue cheese olive martini, oysters and shooters!!! Awesome"}]}}, {"review": {"des": "I love this place. Food is awesome, go up stairs for the fun. Great food and a great place to experience Chicagoat it's best. It's Ditka's!", "pics": null}}, {"review": {"des": "Excellent service, casual comfortable venue that's perfect for summertime Chi! Loved the Moscow Mule, super fresh. The grilled chicken avocado was so delicious I could've ordered another one. <br><br>Can't wait to go back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SRva_nHV__KzLBCk28Kksw/168s.jpg", "caption": "The Club and Grilled Chicken Avocado with Pecan Apple Salad w/goat cheese."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/G06tCClqIF6wbM8scC-IIA/168s.jpg", "caption": "Yummy Moscow Mules"}]}}, {"review": {"des": "If I could give more stars, I would. Excellent service. Excellent food. Had scallops over king crab risotto. One of the best meals I have ever had. We also ordered the crab cakes which were equally amazing. Can't wait to go back.", "pics": null}}, {"review": {"des": "Such great food and friendly service! We came in here just for the bloody Mary's they are amazing and a must if you're in the area!", "pics": null}}, {"review": {"des": "Stopped by here after leaving a Blackhawks game. Great atmosphere in the bar area. I didn't get to take in much of the memorabilia but what I did see was really cool. Our party of 4 all ordered burgers of different styles. I went with a black & bleu with bacon that was in the top 5 I've had for sure!!! Very generous size and cooked (Med Rare) perfect!!!!! 3 in our party were daring and went for dessert. W O W they were HUGE!!!!!!!!!!!!!! Definitely for 2, possibly even 3. Would definitely eat here again!!!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3aABuQ-SK5VwXE1p74C-Lw/348s.jpg", "caption": "Check In"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-6yKIG8l2XEJX77-MzvDvQ/168s.jpg", "caption": "Carrot Cake (Creme cheese icing was amazing!)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BLaZQyz31VlBf9F7IvnPkA/168s.jpg", "caption": "HUGE Chocolate Cake!!!!!! Definitely to be shared!!"}]}}, {"review": {"des": "Ditka's Restaurant is great! My colleague and I were recently in Chicago for a business trip and one of the dinners took place at Ditka's in one of their private rooms. The restaurant has amazing ambiance - it is decorated from head to toe with sports memorabilia and of course everything Ditka! Apparently, Ditka eats there at least once a week when he is in town. Sadly, he was not there the night we were there. As part of the menu for the dinner, we tried: starters (coconut shrimp, calamari), filet mignon, salmon, creme brulee, and key lime pie! Everything was delicious. The service was good. Will definitely be back the next time I'm in Chicago!", "pics": null}}, {"review": {"des": "It has been years since I've been here.  It was great back then.  Celebrating someones birthday brought us back.<br><br>Made reservations through Opentable and in the notes section, mentioned we were celebrating a birthday and wanted to make sure there would be a candle in the desert.  On the day of our reservation, someone from the restaurant called to confirm the reservation and said there would be a candle.<br><br>When we arrived, we were given the option of the casual bar area on the first floor or the more formal dinning area upstairs.  We went upstairs.  Our waiter, Kevin, was excellent and so was the food.  It happened to be restaurant week so we ordered from the restaurant week fixed menu (we had the option to order from the regular menu ).  She had the filet and I had the pork chop.  Both were great.  When desert came, there was a candle!!  Both deserts were great.  I had the banana cream pie.<br><br>I mentioned to the host I was interested in the Blackhawks game.  He said we could go to the bar area to watch and/or later he would turn it on the second floor (which was more formal).  I said I would wait.  He was nice and came by twice to update me on the score and a fight which occurred (and apparently the blackhawk player won!).<br><br>We will go back! The attention to customer service and excellent food are a couple reasons why.", "pics": null}}, {"review": {"des": "I've gotten take out here a few times, staff is very friendly and courteous. Food is always delicious....place is usually busy which is a good sign. Today I ordered the buffalo chicken salad... amazing!", "pics": null}}, {"review": {"des": "Amazing steak and vegetables here! Steak sauce is on point as well. It wasn't the greatest steak I've ever had, but it was a 9/10 for sure. Great service and location, I could see it being an awesome date night spot. If you're a fan of Ditka (or any Chicago sports for that matter), you will appreciate the decoration of the restaurant also. Bought a t-shirt and steak sauce on the way out", "pics": null}}, {"review": {"des": "We went in for a few drinks and to watch the football game that was on (4pm Sunday). We did not have any intention on eating but definitely wanted a drink or three. <br><br>Our waiter was not friendly at all and maybe because he knew we weren't going to spend big money since we were not eating.  <br><br>disappointed on the service.  He didn't smile much and looked bothered by us.", "pics": null}}, {"review": {"des": "My husband and I visited Ditka's restaurant this past Saturday night. Our server, whose name escapes me at the moment, was very attentive and prompt. I ordered the smoked ribs, and they were delicious, fall off the bone good (my husband and i shared a full rack). The fries and coleslaw were ok, but what I should have ordered was the lobster mac n cheese, it looked yummy! My husband had three drinks and thoroughly enjoyed them all, especially the bourbon cocktail created by the bartender. We will definitely return when we find ourselves in Chicago again!", "pics": null}}, {"review": {"des": "Came here strictly for the pot roast nachos on a Friday afternoon at 2pm. Sat outside with my wife on a nice summer day in Chicago. Service was slow and the host and servers took a good 5-10 minutes each to get to serve us (host was on the phone), not a big deal bc it was nice outside. I have heard a lot about the pot roast nachos but they were really not that good. We ordered the large between the two of us and the most disappointing thing was the actual pot roast meat. I thought for sure it would be nice quality pot roast meat, it unfortunately reminded me more of high school cafeteria meat. The cheese, jalapeno's, chips, and scallions were all good but how hard are they to mess up. It also came with no salsa or other dipping sauce. I do feel like most restaurants don't do nachos correctly and it really shouldn't be that hard to make a plate of nachos. I did go inside to the broom and seeing all the bears and Ditka decor makes for a nice setting. Servers were very nice and friendly! With all the different eateries in Chicago, Probably won't be coming back anytime soon. Da Yelp Review:)", "pics": null}}, {"review": {"des": "Excellent service. Pet friendly for outdoor seating <br>Really good shrimp<br>Cocktail. High quality steak and fish choices<br>Wine prices a bit high for what is offered<br>Delightful desserts<br>Overall excellent choice", "pics": null}}, {"review": {"des": "I searched and searched for a restaurant for my birthday trip to Chicago. We decided on Ditkas. The hostess was extremely nice and we were led to our table. Now begins the downside. We were sat at a table directly across from the drink station in the thoroughfare between the \"lounge\" and the restaurant. FYI--If they try to seat you at table 701, just leave. The lounge is basically a sports bar. The place was loud and gives the impression that it can't decide between being a sports bar or a fine dining place. <br>Our water glasses were filled by someone who didn't speak who later literally THREW a bread basket on the table. Like it actually slid across the table a few inches. We ordered the double cut pork chop, supposedly a specialty, and the scallops, along with a side of brussel sprouts. The pork chop was dry, tough, and tasteless. The scallops were actually quite good and well cooked, but the crab risotto it was served with was full of shell bits. The brussel sprouts were nothing spectacular (which I know sounds crazy, but I've had sprouts that have blown me away!) It was overall a substandard meal for, especially for the price, and I would not go back nor recommend it to anyone.", "pics": null}}, {"review": {"des": "My favorite restaurant for ribs. Excellent service. Reasonable prices. Right in my neighborhood. The outdoors could be nicer.", "pics": null}}, {"review": {"des": "Amazing!  I was in Chicago for my job and we went out for dinner and landed here at Ditka's.  They treated us like royalty!  The staff was EXTREMELY friendly and welcoming.  From the Hostess to the Server.  The wine was A+!  But the real treat was the blue cheese encrusted prime rib!  Cooked PERFECTLY and the mushrooms were a nice compliment.  If you are in town, I DEFINITELY recommend this restaurant.  Mr. Ditka must be very proud! By the way, the Key Lime pie was GREAT too!  Oh! And remember to buy a cigar!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CKu0FxQyadU7-q-oCp2Kog/348s.jpg", "caption": "Blue cheese encrusted prime rib with a side of mushrooms!  Amazing!"}]}}, {"review": {"des": "Born, raised and live in Chicago area, so usually avoid touristy places. Sorry coach!  However, my wife and I  met our son and his girl friend for dinner.  Food and service were better than good.  Price wise: I would say it's in the middle among the moderately-expensive city places. With a healthy tip it was about $75 a head. We had drinks, entrees with sides and shared 2 deserts. Steaks were good,  wife had king crab risotto, which I thought was okay (she said it was awesome). The ribeye was really good. Son had ribs, which I sampled, and they were good, his girlfriend had the small filet and she enjoyed it.  Before dinner I had a Maker's Mark Manhattan on the rocks and it was made perfectly. Love the large, clear, single ice cube.  Desert:  Banana Cream pie is best I've ever had.", "pics": null}}, {"review": {"des": "The food is awesome and the Bloody Mary is off the charts good... On our last trip to Chicago we stopped there a couple times for drinks, for dessert one evening and lunch before we headed to the airport. <br><br>The food and service is ALWAYS great and the building is really cool and located in the heart of all the action. Great spot and they may have the best chicken wings on planet earth.", "pics": null}}, {"review": {"des": "This is a must when in Chicago. The steak is delicious and desserts are even better! <br>The staff is great and Love eating here and the atmosphere is cool. The options of eating at the bar or table is both different experience. We Love both but it really doesn't matter where you sit, the food is delicious and just keeps getting better.", "pics": null}}]}