{"name": "dmk-burger-bar-chicago", "reviews": [{"review": {"des": "Very solid burger joint. <br>My fiancé and I actually came here for our very first date 3 years ago and have been coming back ever since. (After he watched me inhale a burger and stuck around I knew he was the one).<br>Our servers are always SO friendly. I just love coming here. <br>I always go back to the #2 on the menu. Which is topped with fried onion straws (they are uhhhmazing) creamy blue cheese and a spicy ketchup. I can't turn down a burger that has blue cheese on it so this will always be my favorite blue burger. We have tried the sea salt & black pepper fries and the parmesan fries. Holy delicious for both but especially the parmesan fries because they come with a truffle cream for dipping that I would eat off of a gym shoe. It's that good. And they always give you a heaping amount of fries... What's not to love?<br><br>The patties themselves are a little thin! So I always make mine a double for an additional cost.<br>But always save room for dessert because their shakes are to die for. I love love love the expresso shake! It's like having dessert and coffee after a great meal. There's so many places to eat in Chicago that I rarely go to the same place twice, but the burgers here are worth the trips!", "pics": null}}, {"review": {"des": "Tried DMK again (this time dining-in), and yeah, it still sucks. <br><br>Service wasn't just slow, it was poor. And the food left me both hungry and disappointed. My burger (wrapped in lettuce) was haphazardly thrown onto one of the smallest plates I've ever seen, and the lettuce was hanging over the sides touching the server's hand, the table, and who knows what else. When I dug the burger patty out of the heaping green mess, it was cold and pretty flavorless. The \"angry fries\" my friend and I ordered to share were the highlight of the meal, but there wasn't enough sauce and definitely not enough spice for an item that's supposed to have both chili powder and sriracha. Oh, and they were also dripping in a sickening amount of grease. <br><br>The lack of a hostess stand was also still weird, as was the super loud music. At one point my friend started talking about \"The Blackstone\" but I heard \"black snow\" and was thoroughly confused for about five minutes. Good luck carrying on a conversation here. Or, ya know, having a decent meal. <br><br>I won't be back.", "pics": null}}, {"review": {"des": "We went here for the first time yesterday, and let me tell you, I highly recommend this place!! First off, the staff cannot be friendlier. Our waitress was happy to give recommendations and even took the time to get to know us. She even brought us a plate of the onion straws because she insisted we try them. Talk about hospitality! <br>Second, the food was great. Each burger choice was unique and tastes fresh. One group member of ours also highly recommend the mac and cheese. On to the fries....the Wisconsin cheese fries are heaven, a suggestion from our waitress. If you like truffle fries, those are amazing as well. Their chocolate shake tastes homemade and was a nice start to our wonderful meal.<br><br>I have nothing but great things to say for this place and if you haven't been, you should definitely go next time you are craving that burger!", "pics": null}}, {"review": {"des": "Ambiance: casual<br>Food: 5/5 <br>Service: 5/5<br><br>My friends and I were really in the mood for burgers and I wanted the best burger in the Chicago area. After hours of searching, we decided to go to DMK Burger Bar. <br><br>While others might disagree, I really liked that their food menu was one page and primarily burgers. Additional items included fries, salads, and other standard sides. I ended up going with the Rambler because I can never say no to Garlic-Bacon Aioli. We also ended up ordering Parmesan and truffle cream fries for the table.<br><br>For someone who doesn't really like burgers, this burger was AMAZING! They do cook the burgers a little pink but it's just the way I like my burgers. Now the fries were PERFECTLY cooked. Crispy on the outside, chewy on the inside and actually tasted like truffle. I honestly felt like I died and went to burger heaven.<br><br>Overall: Everyone loved their burger. (Side note: you can add an egg to any burger for a dollar!) The only reason why I knocked down a star was because the burger is a little small for what they charge. So, if you like burgers and a wide selection of beer (they also have a full bar), I highly recommend this place. I also recommend a reservation because they were pretty busy for dinnertime.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2y6OGvrdQ62oxnPJGytVwA/168s.jpg", "caption": "Parmesan and truffle cream fries"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jsMp0f1JAV1fSPMmo0LiSg/168s.jpg", "caption": "Rambler"}]}}, {"review": {"des": "I visited this place once and had a good burger. I forget what the toppings were, but there are plenty of options. Its close and I would consider going back for sure. As long as I am a local to Lakeview/Lincoln Park, this is on my list.", "pics": null}}, {"review": {"des": "In terms of burgers, DMK is up there with some of the best I have had in the city.  I went in on a busy Saturday night and they went out of their way to make accommodations for the party that I was with, which was a great start to the night.  I knew going in, after a long look at the menu, that I was going here to get the #5 bison burger with caramelized onions, goat cheese, and blueberry BBQ sauce.  I couldn't resist it after one look at the menu, and it exceeded my expectations.  The meat itself was slightly underwhelming, but the accompaniments were just bomb.  I could eat the BBQ sauce that was on that burger with LITERALLY anything, and would if given the opportunity.  We also got 2 different orders of fries, the Wisconsin cheddar and the Parmesan Truffle.  Both were great fries!  My disappointment with DMK was with the drinks.  They were expensive, and not very high quality.  The group consensus was that we would not be returning if we were going for drinks, but would absolutely go back if we were simply going for food.  To me, the burger does not compete with the likes of Au Cheval, Mindy's Hot Chocolate, or Mott St, but it is definitely close.", "pics": null}}, {"review": {"des": "With a hankering for a lobster roll, I was on my way to Fish Bar, but decided that I should have a burger instead. So, I wound up at DMK Burger Bar.<br><br>I arrived early so that I could have a pick of seats without being crowded. After a scan of the menu, I had a cocktail that had mezcal in it. Compliments to the bartender. The burger with mushrooms, cheese, grilled onions, and housemade barbecue sauce was awesome. Some restaurants understand that a burger does not have to be 6 inches tall to be good and DMK certainly gets it correct. And there is nothing like a plate of fries topped with parmesan cheese and served with parmesan truffle dipping sauce: the best. With an espresso shake on the side, it was all good.<br><br>Gourmet burgers are all the rage in Chicago, and I suppose elsewhere. It may be that I didn't order a burger that the cooks heap high with toppings galore and that was fine because I could taste the flavour of the burger, not toppings and condiments. Big ups for making me a fan.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lSJTjIWOwhmS-W5brRVAsA/348s.jpg", "caption": "Fries with Parmesan and Parmesan Truffle Dipping Sauce"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QhRWCwJ-CtEbILIm3rXyRw/168s.jpg", "caption": "#1 - That's what it's called"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6kMcmWnlSFzLjmf3HEgG1w/168s.jpg", "caption": "Espresso Shake"}]}}, {"review": {"des": "If you've ever wondered what they do with recalled beef, you can stop wondering.<br><br>Sunday evening burgers turned into Monday morning vomitfest.<br><br>Do More Knowledgeable purchasing and food prep.<br><br>Thanks!", "pics": null}}, {"review": {"des": "3.5 stars. I ordered (to-go) the chorizo burger and sweet potato fries. At the end of the call, the woman on the call said it'll be ready in about 20-25 minutes. I live near by, so I waited 25 minutes before leaving my apartment. The walk is about 5 minutes, so my total wait time was 30 minutes, so far. When I got there, I expected to be able to get my food and leave, but instead wait an additional 10-15 minutes before I was able to go. Employees didn't talk to me much and for the most part I just felt like I wasn't there. <br><br>The sweet potato fries were delicious and would definitely get those again. The burger was decent. It had a slight kick to it. I wish the guac was more chunky, was a bit too smooth for my liking. Wasn't a huge fan of the bun though. Possibly would return out of convenience.", "pics": null}}, {"review": {"des": "Went here with my mom tonight and had a great experience. Awesome burger (try the #3 French Dip!) and great fries (classic salt and pepper). <br><br>Shout out to our server, Trisha, for being a total doll. She was so helpful when going over the menu and just the sweetest.", "pics": null}}, {"review": {"des": "On our cold trek to see Wrigley Field, my fiance' and I took an uber from our hotel to DMK. Very trendy and very nice interior. The hostess was friendly, and cheerful. And we got seated right away. <br><br>I got the number 2 burger which was the patty, cheddar cheese and crispy onion straws, I also got a side of parmesan truffle fries with the truffle cream dipping sauce. I won't lie, i definitely enjoyed the fries over the burger. I am not trying to downplay their impeccably yummy burgers. But you must get these fries. They are crispy, fresh and topped with parmesan cheese that melted on top of the fries. Then take a fry, dip it in the truffle cream sauce and devour that in yo mouth! I will legit come back to this place for their truffle cream fries. They are to die for.<br><br>The burger was delicious, simple and straight to the point. I don't like a lot of things in my burger, i simply want to taste the patty, and how well it is cooked. The burger was very juicy, and the crispy onion straws added an awesome contract of crunch and texture. <br><br>It was a great way to stuff ourselves on the 2 (i think?!) mile hike to Wrigley field :) So worth it!<br><br>We love the city of Chicago - and we will definitely be back at DMK Burger!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kjCIGmjXt0yuNiKlqutMqw/168s.jpg", "caption": "#1 - cheddar cheese, beef patty, bacon, bbq sauce and added an egg  TRUFFLE CREAM PARMESAN FRIES!!!!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cvBKul7iyLoiD8PIj0rDAA/168s.jpg", "caption": "#2 - cheddar cheese, beef patty, crispy onions and spicy ketchu"}]}}, {"review": {"des": "I can't think of a better happy hour deal. Great pre-party for Cubs games! The BBB happy hour deal includes a burger, a shot of bourbon and a Coors banquet beer for $10! Just do it! Also they offer half price tap beers and $6 loaded fries.<br><br>It's reasonably close to Wrigley Field, the staff is great and the food quality is top notch.<br><br>We'll be back.......and Cubs win!!!!!!!!!!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/H-u3nXju_Jrat2NiZS_Evg/168s.jpg", "caption": "Coors banquet beer and shot of bourbon - part of the happy hour special."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ibUZqSnDV9FWnAbH9lejcA/168s.jpg", "caption": "#8 happy hour burger special with blue cheese and loaded fries"}]}}, {"review": {"des": "My experience here was great. My mom and I went after a long morning of doctor appts. <br><br>It had just open so we had the restaurant pretty much to ourselves. It was one large party celebrating the holidays. We order immediately. I actually tried a news drink which I normal only drink water. It was amazing a homeMade basil soda yummers!  I also had salt and pepper fries, and the veggie burger with avocado. These are one of the best fries I have tasted. And the veggie burger was awesome. I haven't been in Awhile and they didn't disappoint.  <br><br>Brooks our waiter was on point he did a great job with suggestions and checking in on us periodically. When I'm in the area I will def go back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ffx8fisJSBPainol6zdkKA/348s.jpg", "caption": "But of course fries... salt and pepper fries with that ketchup"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QGsN-rKl-enGtNOxDqYV3Q/168s.jpg", "caption": "Veggie burger with quac..."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ckg24Z53Q77kESUPiT54kQ/168s.jpg", "caption": "Dranks"}]}}, {"review": {"des": "These burgers are phenomenal. Beyond that, their fries are also insanely good. If you're looking for a wide range of high quality burgers (including turkey, salmon, and bison) you're at the right place!<br><br>I've been here a couple of times and have never been disappointed by any of the burgers I've gotten. This time around I went for the roasted hatch green Chile burger and it was great! I'm a bit of a wimp when it goes to spice and this definitely has a kick to it the more you eat, but it's delicious if you can handle it! My friend also got the thanksgiving special burger with a stuffing patty, turkey burger, and mashed potatoes on it and it was unreal. I wish I could've had this burger that night as well, I was so impressed. <br><br>The Parmesan truffle fries and the sweet potato fries also can't be matched. They're mouth watering and you absolutely cannot come here and get not at least one of the two. You won't regret it. Overall awesome experience, great food, kind service (we only had to wait about 20 minutes to be sat) and a variety of drinks available as well. I'll definitely be back!", "pics": null}}, {"review": {"des": "I had a great burger here and found it was on par with other well known burger places in Chicago. The staff was friendly and the food was prepared well and served promptly. I would definitely return.", "pics": null}}, {"review": {"des": "DMK has some great things about it. It's convenient to public transit so you can avoid parking in that congested neighborhood. They have great salads besides the actual burgers which are also good. I like the patty melt too. They have a list on the wall of charity organizations that they are involved in so you see that some of the money you spend there goes towards local organizations.", "pics": null}}, {"review": {"des": "This place won me over. I got their biggest burger and at first bite I thought it was a great burger, but didn't blow me out of the water. However, I get tired of eating big burgers and don't finish unless they're really good. As I continued to eat this burger, it got better and better. By the end, I was force feeding myself because I was so full, but had to keep eating that burger. So when you get a burger, don't make first judgements based off the first bite.<br><br>The truffle fries are everything you could dream of. I also force fed myself those because they were so good. <br><br>Staff was appropriately available, not too clingy but not too absent either.<br><br>Great experience.", "pics": null}}, {"review": {"des": "Had the rambler burger! It was delicious and service on a Friday evening was super quick and friendly. The Parmesan fries were awesome too! Recommend getting an egg on it. Will definitely be back to try another burger.", "pics": null}}, {"review": {"des": "If you're craving a burger. Come here. I love their burgers because they have so many different choices! I love #5 the bison burger and how they always have a different burger of the month! Definitely beware of eating with your eyes... I've made the mistake of ordering a beer, milkshake, fries and a burger.. It was all yummy but be prepared for a well earned food coma! The Parmesan cheese fries are my favorite as well as when they had the dirt cup milkshake!", "pics": null}}, {"review": {"des": "We love DMK Burger Bar, here and at Navy Pier! The burgers are delicious. My salmon sandwich with slaw was very good, and the huge order of sweet potato fries with the dipping sauce we 3 shared was delish! And the Boulevard Ginger Lemon Radler was refreshing!<br><br>The problem with the location is it's extremely dark inside! We couldn't read our menus without our cell phone light, and it was still a problem.", "pics": null}}, {"review": {"des": "My favorite thing in the world is a plate of fries and this place has the BEST fries in Chicago! Having been born in Chicago and living here almost all my life, I don't know how I missed this place. But knowing fries are my favorite, my boyfriend (now fiance) brought me here before he proposed upstairs at Navy Pier Winter Wonderland with a tree of his own filled with pictures and memories of us over the years because he knew I'd be in happy mode if I had some fries lol And boy was he right! We got the sea salt and cracked black pepper fries as well as the truffle fries. The truffle fries were my favorite but the regular fries were good to get a base flavor in the midst of all the truffle. I loved them both! I'd go back again just for the fries anyday!<br><br>Note - don't get lost, this place is inside Navy Pier so don't get confused when you don't see it labeled outside!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/T64-jI4VRYYrP6rKznjsFQ/348s.jpg", "caption": "Sea Salt & Cracked Black Pepper Fries in the back, Truffle Fries in the front - drool worthy"}]}}, {"review": {"des": "I enjoyed the #5 with double the patty. One was Bison and the other was a regular patty. <br>I order the fries but they were over cooked and salty. <br>The bread was nice and soft. <br>Overall the burgers are the way to go here and customize your burger if you want the full benefit of the experience.", "pics": null}}, {"review": {"des": "Terrible picture, but you're just going to have to believe the review. IT WAS DELICIOUS! I had a boozy vanilla malted milkshake with bourbon and OMGEEEEEEEE! I opted for my burger to be served on a waffle and that was definitely the right choice. Make sure to dip your burger in the syrup, yes I said in the syrup. You won't be sorry!", "pics": null}}, {"review": {"des": "I was craving a burger like mad, and the one place I had heard of but not yet tried was DMK. It was pretty empty on a Sunday afternoon, but way more peaceful for us. We grabbed a table and ordered some egg nog boozy milkshakes, which was ideal for the holiday season. The shakes were super thick and probably not the best idea for spoiling our dinners, but I drank the whole thing and enjoyed every last sip.<br><br>I ordered the bison burger, because I love a bison burger, even though it came with some toppings that I would not normally want on my meat, like blueberry barbeque sauce. But I trusted the kitchen experts and bit into the sandwich with all the flavor. The blueberry sauce dripped down and looked like I just murdered somebody but that is because I was murdering my amazing burger. The goat cheese, the meat, and the sauce was just perfect and I was upset that I could not finish the last awesome bite, but the shake and the sweet potato fries I ordered as a side put me in blimp mode and I just could not. But I will be back. The menu is interesting and maybe a little weird in combinations for some, but trust it. It will treat you well, and so will the service and atmosphere, which was fun and cool.", "pics": null}}, {"review": {"des": "Have y'all tried this? These boys hot... <br>but fr this place bumps.<br>I had the plum forgot, the bison burger (which I think was the #5), and truffle fries. I had a very nice waitress who talked me into the truffle fries and I wouldn't change an MF thing. If you're reading this, waitress, you deserve a Nobel peace prize. Ugh... your mind! <br><br>Thanks DMK! We stan", "pics": null}}, {"review": {"des": "Surprisingly good burger joint. We stopped in because all the other places we tried to go to had super long waits.  It's a little dark and tight but the food was awesome! <br>Onion strings, Sweet Potato Fries and Parmesan/Truffle Fries were both delicious!<br>The buns on the burgers are really different than your average burger bun but super good. All the burgers I tried were phenomenal!<br>They also have homemade sodas which are great.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wERSJLkDBEvW5BevP-Q4Ig/348s.jpg", "caption": "The Number one with special sauce on the side. In the middle are the Parmesan/Truffle fries and the Sweet potato fries."}]}}, {"review": {"des": "This has been our go-to burger place for years, the drinks are great, beer menu fantastic, and burgers consistently delicious. <br><br>They took the bacon and blue cheese fries off the menu awhile back, but will totally still make them for you if you ask, and I highly recommend you ask for them!", "pics": null}}, {"review": {"des": "I typically stay away from burger joints given the fact that I don't eat meat.  However, I was in the Lakeview area and had a coupon for DMK Burger Bar.  I checked the menu for a vegetarian  burger and they had one that sounded like it wasn't going to be your typical generic frozen burger.  We went there around 9pm on a Saturday night and we were seated right away.  The service was good on all fronts from the host to the server.  The only thing about the atmosphere was that it was too dark in there.  It was hard to see the menu and we're both relatively young people who don't have issues seeing menus in dimly lit restaurants.  I think they could have had candles at the table or something so you can see the food and person you're talking to.  That's pretty much the only negative thing I have to say about DMK.<br><br>I really was impressed and happy with the food.  We split their mac n cheese, which I loved because it had the baked parmesan crust on top.  I am a sucker for mac n cheese that has a baked parmesan crust on top!  The aged cheddar also tasted very good.  It was a big portion but not a super heavy mac n cheese, which I appreciated.  We also split the house veggie grain burger that came with a slice of eggplant (really nice touch, and they know how to make eggplant which is rare), and a really delicious pesto aioli that was more pesto than the mayo part.  It came with aged cheddar but not being a big fan of cheddar we got it with the fontina, which was pretty decent.  I also liked the baked bun touch.  <br><br>Fries go well with any burger so we got the parmesan fries with the truffle cream sauce.  I am glad they served it on the side because there's a lot of it.  The parmesan fries were very well seasoned and came with freshly shaved parmesan that was kind of melted on there but not too much and even without the truffle cream sauce you could still taste the truffle.  The truffle cream sauce though was so good and quite a guilty pleasure.  It had more of a truffle flavor than a cream flavor which made me like it a lot.  We had plenty of food leftover and were very satisfied here.  I definitely value this place for being a burger place that still puts effort into their veggie burgers.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/V0vArb28Te5b64-tNrptFA/348s.jpg", "caption": "Mac n cheese"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rjcWwRhKegT_5sVxmu2sgw/168s.jpg", "caption": "Parmesan fries with a truffle cream sauce"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JE_dTSdrtdvrKFe_WrDAHg/168s.jpg", "caption": "Veggie burger"}]}}, {"review": {"des": "My husband and a friend came here for dinner a few days ago, and it was superb!  I'm trying a new paleo diet nowadays, and this restaurant is paleo-friendly.<br><br>There was a great cocktail menu, and we tried the Bourbon Smash, which had a delightful combination of bourbon, sugar, rosemary, and mint.  I then opted for The Paleo burger.  It was a savory grass-fed beef on portobello buns.  It was delicious and satisfying!  Other burgers can be made with lettuce or portobello buns too if you want.<br><br>The service was friendly, and there was not a long wait for food.  The pricing was reasonable.  Overall, I was very happy with my trip here, and I'm sure I'll be coming back!  I'd recommend it to anyone in the neighborhood to try.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IYEndTuxyucr-XER8mvAFg/168s.jpg", "caption": "The Bourbon Smash cocktail"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lmwhzxLQxDvV8PAOwL6qXg/168s.jpg", "caption": "The Paleo burger"}]}}, {"review": {"des": "In a landscape littered with great burgers across the city, DMK stands as a very good option. Plenty of different choices and interesting combinations. Fries were good and if you have room the milkshake was good too.", "pics": null}}, {"review": {"des": "New to the area so stopped by to try this out. Overall- I loved the burger and the fries, very delicious and reasonably priced. Knocked one star because it's SO loud and SO dark in there- none of my friends could be convinced to return except one who loves the burgers so much because it was so hard to hear/see. We used a flashlight to look at the menu. I think it has to do with the lighting and the frosted windows that don't let light in. <br><br>However, for an amazing burger and great customer service- definitely a go-to!", "pics": null}}, {"review": {"des": "Loved it! Great food kinda late even I like this place alot! Jjjjjjjjjjjjj'cc ccc ccc fv f f tbu offer 8g", "pics": null}}, {"review": {"des": "DMK burger <br><br>3.5 stars. Solid burger spot but a bit over-hyped. <br><br>My husband got the #7 (Big DMK) which is an upscale Big Mac. It was huge (apparently you can get it scaled down too, but we didn't know that). It was tasty but nothing special in my opinion. I preferred my Salmon burger. Seemed like the odd choice to get but the Thai curry aioli with the slaw was amazing! I've also never had anything really like it. The Wisconsin cheddar and scallion fries were yummy (and shareable). <br><br>Service was very basic and average. (And I probably expected a little more since it is part of the DMK group too). It also seemed a little slow. <br><br>While I would return if I was in the area, this isn't a \"destination\" in my book.", "pics": null}}, {"review": {"des": "#1 with waffle is Flame #7 good(says my girl) came here bday they show LOVE !! But seriously the #1 was F'n flame then again I'm a southsider ‍", "pics": null}}, {"review": {"des": "This place has a great selection of some very tasty burgers. I recommend their version of the Big Mac. It easily feeds two people. I also recommend the chocolate and peanut butter shake. Service is very friendly and helpful. There is also a bar you can sit at for drinks and if you go by yourself. I will definitely be coming back!", "pics": null}}, {"review": {"des": "Had dinner here with some friends recently. We ordered a ton of appetizers and a few burgers. <br><br>The truffle fries are amazing! I also love the aioli they serve with it. The cheddar friends and onion strings are also worth ordering. I'll be honest, we didn't even look at any of the other sides. <br><br>I ordered the #8 burger. It was pretty boring, nothing too special about it. The buns they use are quite different. I had loaded up on too many fries so I took the top of the bun off and ate it opened faced. The burger was cooked well but I felt the need to add ketchup to it. <br><br>Overall it was a good experience here. I liked that there was ample parking around, the service was quick and the staff was nice.", "pics": null}}, {"review": {"des": "All of the burgers I've had here are delicious! Try their burgers with a waffle instead of a patty, the server recommended it and I was pleasantly surprised. The shakes are very filling and the cheddar fries are so tasty. The servers Bailey and Maddie are the best!", "pics": null}}, {"review": {"des": "DMK is one of the great places to eat near my brother's place so it's always on our list of options before we head out for the night. We stopped in this week and had an awesome experience, as usual. We got there a little early but regardless, they were seating everybody quickly and the service was great the whole time we were there.<br>Since we sat at the bar, the bartender was our server. His name was John and he was wonderful. He was super attentive, always around when we needed him and he went above and beyond to make our dinner great. <br>We all ordered different things for dinner. My brother ordered the bison burger, which disappeared super quickly, and my sister ordered the green chili and Wisconsin cheddar fries (which John told her to turn into chili cheese fries - looked gross but truly a genius idea). I ordered a salad... which is not my usual choice at a burger bar.. but the Cobb was great anyways. <br>The only detail that I would change was that the food was on very little plates.. which seemed unusual and made it hard for someone who is such a mess (me) to eat. But the problem in that equation is most likely me. Overall our experience was close-to-perfect and we will most definitely be back again soon!", "pics": null}}, {"review": {"des": "DMK is one of my favorite go-tos for a burger and beer in Chicago.  <br><br>-It's on a beautiful neighborhoody stretch of Sheffield.<br>-Inviting dark tavern atmosphere that is always bustling with a lot of energy.<br>-Always good rotating beers on tap.  They also have fun seasonal milkshake specials and interesting homemade sodas--we just tried a vanilla ginger one that was delicious!<br>-Burger menu is packed with unusual combinations.  I like the bison burger with goat cheese and a blueberry sauce.  I also like a Mexican-influenced one that has chorizo.<br>-Fries are great--and I like you can get half orders so you can try different kinds.  The truffle fries with cheese on top are to die for!", "pics": null}}, {"review": {"des": "All of the food here is delicious. Whether you're looking for interesting, decadent, meaty, simple - all of it is great and really good quality too! I love that an upgrade to a bison burger doesn't cost anything extra. They always have an amazing cocktail wine and beer selection and the wait and bar staff is awesome!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZueNOeyadP4KdsYVYrVNcg/348s.jpg", "caption": "Even their simplest burger, the #1 is unique and amazing. I customized this beauty to be a bison burger at no extra charge! Perfect meal!"}]}}, {"review": {"des": "The burger here was very good!  Not to mention the fries were also above par- so good!  There are so many different burger options from chorizo to turkey to bison to salmon, even!  The variety definitely makes this place a top choice to go to for Burger lovers!<br><br>I personally had the bison burger and I thought it was truly great and cooked very well.<br><br>In terms of the atmosphere- this restaurant is extremely dark.<br><br>Also, the wait on a Friday around 6pm was approx 45minutes for 4 people.  We personally put our names down because they text you when your table is ready, then we to Replay the arcade bar (5min walk away) for 30 minutes then walked back.<br><br>I would like to say as much as I loved the burger- I still would not rate this my favorite burger restaurant in the city or of all time.<br><br>An added bonus is that the service was GREAT.", "pics": null}}, {"review": {"des": "My wife and I can eat here- no problem. For anyone with an auto-immune disorder you will know these words are gold. <br>I am a major burger snob, and the burgers are damn delicious.  The fries are made in healthy grass fed beef fat, not sunflower or peanut oil. <br>The bison is awesome but the beef is even better.<br>Servers couldn't be any more friendly, understanding and patient.  <br>We will be coming here as long as they are open and we live in Chicago.", "pics": null}}, {"review": {"des": "I had the number 8 while my boyfriend had the number 9 we also ordered fries and Cole slaw we enjoyed the food . However they are a little expensive. I also ordered a margarita on a scale of 1-10 it was a 7. Good for couple and groups of friends. I like that they are open late even on Sundays.", "pics": null}}, {"review": {"des": "DMK can be summed up nicely with a single word: underwhelming. <br><br>We were seated with no wait time at 6pm on a Saturday night. Service was fantastic; Taylor checked in frequently, offered suggestions on what to order, and always had our water glasses full. <br><br>Food, however, was a totally different story. I have such good memories visiting DMK in the past, and I was totally let down on this trip. I ordered the #3: crispy prosciutto, fontina cheese, marinated tomatoes and Truffle cream. Each of those four mentioned ingredients were provided in MINIMAL amounts; I'm talking one tomato slice, two pieces of prosciutto, and cheese on HALF of my burger!!! I was so disappointed. My boyfriend had the #15- special of the day, which happened to be a crispy Buffalo chicken sandwich (his favorite!). Again, very underwhelming. Plus, the bun to meat ratio is very off at DMK. <br><br>We shared a small sweet potato fry with aioli. The fries were alright, but the aioli was cloyingly sweet. We also shared the Crispy Onions, which were essentially like fried Funyuns. There was no sign of any actual onion, just onion flavor. Worst of all though, all of the pieces were just crumbs; we got about five strands that were actually long enough to dunk in the provided ketchup. Maybe ours were the leftovers? Blegh. <br><br>All in all, I feel so disappointed with my experience here, and likely won't return for a long, LONG time!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yrbfdT7Uk_nfTgdaSFAj2A/348s.jpg", "caption": "#3- Fontina, Marinated Tomatoes, Crispy Prosciutto, Truffle Cream."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Z5JtCs_XEv-zY05UfQckqw/168s.jpg", "caption": "Small Sweet Sweet Potato Fries with Lemon Tabasco Aioli"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WPx4jdBs9nNrV3OhFSxHfQ/168s.jpg", "caption": "Crispy Onions."}]}}, {"review": {"des": "One of the better burger places in town, but a little over hyped on yelp. <br><br>Came in on a Sunday night around 7pm and it was packed. We were lucky to find a table for two around this time. The first impression of this place is how much it resembles a night club environment. It was dark and loud and I felt like I was eating in Hakkasan in Vegas, minus the EDM. I don't know how people have a good appetite in this environment. <br><br>My friend and I ordered some burgers on their menu list and they're pretty typical gourmet burgers. We did not like how the patties were a little thin and there were no sides. We felt pressured to eat quickly because the waiter kept checking on us. Honestly we aren't able to examine our burgers thoroughly because it was so dark. See the photo I took and edited... <br><br>Overall the environment isn't ideal for culinary enjoyment. It's environment is darkish but the music isn't good. I honestly think it's overhyped, which is why there was no wait on a Sunday night during dinner rush hour. If they are not able to turn around quickly and make the necessary adjustments, they might see further reductions in their customer base.", "pics": null}}, {"review": {"des": "Decent meal, although I was expecting way better. Service was great, so I'll get that out of the way.<br><br>I saw this place on DDD, but I didn't want to necessarily try that same burger (the bison burger with blueberry bbq sauce) so I ordered the #4 instead, which is basically a burger with bacon, egg and cheese. However, I opted for the bison instead to give it a shot. And of course, I had to order the sweet potato fries.<br><br>The food came out really fast, which I was thrilled about. The sweet potato fries were decent. I've had way better, but I've also had way worse. The lemon aioli that they come with really save them- it's delicious. As far as the burger is concerned, as many other reviewers say, underwhelming is pretty accurate. That being said, the bacon is excellent. The bison was cooked well, however, so my burger was a bit dry. I take the blame for the lack of runny yolk, because the menu does say \"fried egg\"...I should have caught that. The bun is ridiculously soft, which is very pleasant, but it does overpower the smaller patty. Overall, the flavor was there, and it was a decent burger, but I came here looking to be blown away and certainly wasn't.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VVA9yYXnBvpYFG7SmCgJEw/348s.jpg", "caption": "Decent burger. Excellent sweet potato fries!"}]}}, {"review": {"des": "My boyfriend kept raving about this place so I gave it a try but I didn't like it. I do love the Fish Bar (same owners, around the corner) but the Burger Bar bugged me. First of all, it's too dark in there!! Why is it so dark? It put me to sleep. Second of all, the burger wasn't that great. I kept wanting to escape and run around the corner to the tasty grilled fish, to the island vibes, to THE LIGHT. Next time you'll know where I'll be.", "pics": null}}, {"review": {"des": "Pretty good burger place. <br><br>Stopped by for a late dinner on a Friday evening. The place is a mixture of a bar with tables for seating. They offer a pretty good selection of gourmet burgers, also all the meat is grass fed which is a huge plus in the taste of you ask me. Another thing worth noting is the bread is really fresh and soft. It tasted like they had just made it even at 10pm on a Friday. I tired the #1 and #5 both really good but the #5 was my favorite. It comes with bison which was perfectly cooked and topped with goat cheese and blueberry BBQ sasue, it was great. The first here are hand cut, we opted for just salt and black pepper that didn't disappoint. <br><br>Overall good place for a burger but could use a larger amount of meat for the size of the bun. I know it's grassfed but I like a big burger in general", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uXhjGE6WdrrrNYuFwB0IMA/348s.jpg", "caption": "#1 is the burger open , larger fries"}]}}, {"review": {"des": "First of all, this place rocks because it donates proceeds from a featured sandwich  to charities and community organizations in a rotating monthly basis.  What an amazing act of kindness.   It also has 2 awesome TVs at the bar where you can enjoy a game. <br><br>This place has a very pleasing industrial interior and welcoming staff - always a big plus.  Our bartender, Sam, was so pleasant. <br><br>The beer selection is excellent blending on tap, cans and bottles.  They offer a couple of ciders and signature cocktails, along with a rotating menu.  <br><br>They have some unique offerings so if you are a basic food type person, who might need to read through the sections a bit but they are there.  We chose the patty melt and fries.  It was very good a tad over cooked but enjoyable.  The fries come with salt and pepper A LOT OF PEPPER- too much pepper, so don't be afraid to ask them to not grind that mill so much.  They are fresh cut and too good not to enjoy.  <br><br>This is a good place but be very specific about your order and you will be happy.", "pics": null}}, {"review": {"des": "Very impressed by the food at DMK. The cheese fries with scallions work just simply exquisite. The double burger was tasty and well executed.  I got the big salad and it was very crunchy and fresh. I was very pleased with it all. Great friendly and fast service", "pics": null}}, {"review": {"des": "Do you like awesome burgers?<br>Do you crave incredible fries with tasty toppings and dipping sauces?<br>Do you also want to feel the bump of the bass like you're in a night club?<br><br>If you can say yes to all three, you've found your spot! My entire group loved the burgers and the varieties of fries, we just couldn't hear eachother nor see the menus.", "pics": null}}, {"review": {"des": "Great food.  Staff was pleasant. Prices reasonable.  <br>     First time here, but we will be back.", "pics": null}}, {"review": {"des": "I'll give them 4. They earned it. Not sure I've ever given a 5. Solid beer list. Bartender and severs were very knowledgeable and kind. Explained the menu very quickly and and paired our beers with food. Food came out incredibly fast and they were busy. Food was piping hot. On point and just as I expected. I heard about this place probably 5 times before I came here. It's a great spot for a date, to bring the fam, with friends, or just sneak off and enjoy a burger and dinner solo at the bar.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5EA_zPQVBDOUkjMA43Ybdg/168s.jpg", "caption": "Patty melt, fries sold separate. Lovely combo."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2WV42Y-_Ln2oTIPm0yKd-w/168s.jpg", "caption": "Patty melt"}]}}, {"review": {"des": "Woh, I actually like this place. I had a great burger experience; great music, family oriented and plenty of craft beers.<br><br>My chorizo burger was great. The whole fried egg takes it up a new level. I wasn't a fan of the blue cheese and bacon fries. I normally have a good experience with blue cheese and bacon. But this time, it just didn't mesh up.<br><br>They have 5-6 craft beers on tap and a lot more in cans and bottles. I'm a huge fan of the ones they have and I would come back just for the beer. Just hang out at the bar and drink my problems away. And next time, I'll try their shakes.", "pics": null}}, {"review": {"des": "My clients recommended this place as THE BEST BURGER in Chicago . They were right! Fried pickles, truffled fries and DMK burger was one of the best I've tried in my life ! This place is so packed on weekends so make sure to come earlier and grab your spot , so you can try the best burger ever ! Customer service 10/10, food 10/10 , location 10/10 . Just loved it", "pics": null}}, {"review": {"des": "This is one of my favorite burger spots in Chicago! I get the salmon burger and split some fries- either sweet potato or regular- with my friends and/or coworkers. They give a discount to Advocate associates! Decent service and prices.", "pics": null}}, {"review": {"des": "DMK has a fun vibe, the big football games were on TV. We put our name in and waited for about 15-20 minutes during dinner time on a Saturday night. We were at a shared high top. It took a little while for our server to come by our table, but once Molly took our order, the food came out fast. We were out of there in a hour which felt fast. I got the french dip burger without the cheese and it was great. Not the best burger ever but definitely flavorful and satisfying. The fries were all fantastic. I'm glad I ordered a variety so that I could try a bunch of flavors. The angry fries are spicy but not too overwhelming for me. The Parmesan fries were great and covered in shredded Parmesan. The sweet potato fries were good and didn't taste too much like sweet potatoes which is a plus for some people. I didn't get a beer but the list was really long and looked great! Next time I would get my burger with cheese, a beer and a milkshake. Thanks for a fun meal DMK!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bGFNLIbkOUunUGDj25NLzA/348s.jpg", "caption": "French dip burger no cheese"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Sqec4DDGs09TMO2QuTkWpQ/168s.jpg", "caption": "Parmesan fries, sweet potato fries, angry fries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LmSsscRC_8qg3gu1mOb5Bw/168s.jpg", "caption": "Chili - Rubbed Onion Strings with fried egg"}]}}, {"review": {"des": "Stop by for lunch and had a Paleo burger with the mushroom caps as the bun with hamburger meat and pesto, was great. My honey had a patty melt and said it was good. I had sea salt fries and the honey had the sweet potato fries. The beer selection is nice and since I visited during St. Paddy's week we shared a Shammy shake with lucky charms, yummy!", "pics": null}}, {"review": {"des": "Food is amazing! This is my go to lunch spot. I'm a bit obsessed with their sweet potato fries.", "pics": null}}, {"review": {"des": "My first time here, and it was a great experience! Loved both burgers we tried, and they had a nice list of draft beers for us. What made the meal a 5 though, was the fantastic service. Our server, Leo, was personable, made great menu suggestions and was readily available for anything we needed. We will definitely be back!", "pics": null}}, {"review": {"des": "The vibe of this place is awesome. It's very hip and friendly and so is the staff.<br>I had the #4 burger. I personally liked that they didn't ask how I wanted the burger done because they just made it however they believed would optimize the flavors the most. I generally have a taste for very heavily seasoned foods. I thought the burger satisfied that but I'm not sure it would make the cut for the best burger I've ever had. <br>My friend and I also shared the truffle fries. I have been dying to try a dish that highlights truffle and I heard about DMK's fries, but to be honest, the flavor was still too subtle for me. The fries were pretty average in my opinion. <br>This isn't the place for a very abstract gourmet burger but if you've got a burger craving or need something hearty, DMK burger will hit the spot.", "pics": null}}, {"review": {"des": "I really like this place and want to give it a five star but I cannot due to stomach upset after their food. <br>I had serious stomach pain after a bison Berger a few months ago and the manager was sorry for the experience and kind enough to send me a $25 gift card. <br>Since we loved the fries, the shake, the burger so we decided to use the gift card and give it another try last night. <br>Again, we really enjoyed the food but right after it, my husband started to feel extremely bloated and followed with serious diarrhea tonight. Again, I thought it was just him, but I am start to feeling stomach pain and having hard time sleeping the whole night. <br>DMK, your food is delicious but there is something wrong with either the meat or fries, I don't know. The food tastes great but doesn't worth 12 hours of stomach pain.<br>:-(", "pics": null}}, {"review": {"des": "We had a $50 gift card to DMK Burger Bar, so we decided to stop in for a date night on a Friday evening.<br><br>The atmosphere is lively and relaxed - Monte Python was playing on the TV screens while we ate dinner. We also saw a few tables with kids (we will definitely be coming back with our toddler at some point!).<br><br>We ordered the bison burger with blueberry BBQ sauce, cheddar fries, a cobb salad and a vanilla milkshake. Everything was delicious!<br><br>At the end of the meal, we had only spent $40, and apparently the gift card had to be used in one go, so our waitress suggested we get some mac and cheese to take home (which we gave to our son when we got home, and he loved it).<br><br>Overall, this is a solid neighborhood burger place. The food is good, the atmosphere is welcoming and the service is friendly. We will absolutely be coming back!", "pics": null}}, {"review": {"des": "Went with some friends on New Year's Eve. So so good! I got burger 6 which had chorizo and guacamole. It was delicious. The Parmesan truffle fries are amazing as well. Friendly staff and great cocktail options.", "pics": null}}, {"review": {"des": "So.... I was excited to have a friendly host immediately greet me upon arrival. My server was really nice but.... We'll get there.<br><br>The food... How did yelp reviews lead me here? The waiter asked if i was first time, and being that i was he provided the keyles knowledge that the meat was cooked leaving a  bit of pink; i was ok with this as many people commented that the burgers we dry.<br><br>Got my burger and it was still dry but the main problem was it was dressed as though i went to Mc.Donalds; all of my toppings were right on the middle of my burger and there were very little.<br><br>Now the waiter, nice and very attentive but he didn't make me feel as valued as he didn't tell me about the cubby special burger like he told the bigger table, nor did he take time to run over the burger, or provide his recommendations like he did for the other table.<br><br>Two stars for the drink. Yummy.", "pics": null}}, {"review": {"des": "The burger is definitely fresh. For my tastes, there is too much bun vs burger, but the bun is also very fresh. The fries are great, hand cut - we got the sea salt & pepper. Great beer selection and loved the vibe of the place.", "pics": null}}, {"review": {"des": "Hangover New Years Day brunch, a velvet robe purchased from the bartender, it was fake! It was really velour.  We love the people here.  The food is amazing! We also had many drinks, all of which were amazing. Oh and John and Aaron should be running the show. :P", "pics": null}}, {"review": {"des": "Friendly service, and a lively atmosphere. Very good burger and fries, with nice menu option. <br><br>The bread is exceptional.", "pics": null}}, {"review": {"des": "I'm still wondering what the deal was last night with this place. We were told it would be a 20 min wait (and it was) but I couldn't help looking at all the empty seats. Then there was a party of 3 that came in after us but was seated before we were. There's NO waiting area so standing around eating patrons is RUDE imo. On to the food! The two times I came before I had the salmon sandwich. This time I chose to try the veggie sandwich with the egg on top. It's texture is so gummy that I KNOW for a FACT I'll NEVER get it again. Had it not been for the egg, tomato and condiments I doubt that I would've been able to eat it. I also got the Parmesan truffle cream fries (I NEVER eat the truffle cream tho, thank goodness it's not directly on the fries but on the side). The presentation looks delicious tho.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zGuz-bqoptl3W9kwx7v7xg/348s.jpg", "caption": "Veggie sandwich with egg, Parmesan truffle fries"}]}}, {"review": {"des": "The Big DMK Burger, which I had for lunch, is a triple decker treat that makes this place worth revisiting though I'm not sure if it's worth the price. They have meat options with grass-fed beef. <br><br>Their customer service was instant. <br><br>There isn't enough natural light during the day, but it's a nice dinner/bar spot.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TbqLiy4FJmYoIiqYktiu4w/348s.jpg", "caption": "The DMK Burger"}]}}, {"review": {"des": "I've been here twice. The burgers are incredible and the beer is incredible. Also incredible is the fact that they sometimes donate proceeds to charity on some of their featured beers or burgers. Less incredible is the fact that it tends to get loud, so it's difficult to have a conversation over dinner.", "pics": null}}, {"review": {"des": "I couldn't see a damn thing. Turn the lights up yo.", "pics": null}}, {"review": {"des": "I thought it was just ok. The burger became dry and over done after a few bites. The buns they use are incredible and the garlic aoli is delicious. We had a toasted marshmallow shake that was pretty standout. BUT for a burger bar, I expected a bit more. Not awful but there's definitely better places.", "pics": null}}, {"review": {"des": "Mike was the best! Awesome service and so attentive. Wish all servers were like him! We were a party of 7 and had lots of questions and requests, and Mike was so patient and helpful. Great sense of humor too! Overall made our experience at DMK all the more enjoyable! Food and milkshakes are great as always!", "pics": null}}, {"review": {"des": "#1 Burger - Aged Cheddar, Smoked Bacon, Charred Balsamic<br>Red Onion, Rufus Teague's BBQ Sauce - 4/5<br><br>Parmesan Truffle Cream Fries - 4/5<br><br>Sweet Potato Fries with Lemon Tabasco Aioli - 4/5<br><br>Parking - 1/5<br><br>Area - 5/5<br><br>Environment - 4/5<br><br>Service - 4/5", "pics": null}}, {"review": {"des": "Crushed the DMK version of a Big Mac and hate to say Ronald you've been one upped. Huge, tasty and   Healthy (grass fed). Good value, great beer selection and Emily the Day bartender was a plus.", "pics": null}}, {"review": {"des": "This is a gourmet burger that really doesn't live up to the hype. The patty is very small and swallowed up by the lamest albeit i'm sure fresh-made buns. The bread really doesn't lend itself to the burger at all and felt really out of place. The burgers sound amazing but the Bison burger with Blueberry BBQ and goat cheese was very bland. My friend got the #4 which came with bacon, hatch green chile, and an egg, non of which really stuck out or worked together, it was just sort of soggy. We added hot sauce for flavor. <br><br>I can say the service here is A+ and the fries with truffle mayo held up well, but fries shouldn't be the focus at a burger bar.", "pics": null}}, {"review": {"des": "Delicious burger. Even better fries. Loved the blueberry ketchup. Can't wait to go back", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/puD4MefBu-fdzc9fqU6LFA/168s.jpg", "caption": "Bison burger and cheese fries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vIwZAVWD7T5xMyaqFN2myg/168s.jpg", "caption": "Cocktail menu"}]}}, {"review": {"des": "I LOVE THEIR BUNS. Idk what it is but I just think they melt in your mouth. A lot of people love the Kumar's burgers but I would say DMK wins it for me <br><br>So far I've had:<br>- 1: cheddar bacon <br>- 5: bison goat cheese <br>- 6: chorizo guacamole <br>- 14: salmon burger<br>- Parmesan truffle fries<br>- sweet potato fries<br><br>My favorite ones are #1, #6 and truffle fries! Must try items<br><br>They also have monthly specials, so if u have some wiggle room I would definitely try their special shakes!", "pics": null}}, {"review": {"des": "All options for burgers and fries are both delicious and solid. <br><br>But guess what? I don't care about how good the food is if the service is garbage and the hostess is rude. Turn up the lights, while you're at it, DMK; you're a burger joint, not a dive bar.<br><br>If you have to eat here, sit at the bar. The bartenders are always nice, helpful, and you'll get delicious food in a reasonable amount of time without attitude.", "pics": null}}, {"review": {"des": "I haven't been in Chicago long but finding great burgers has been my mission.  This place isn't the best burger I think in town but it is still very delicious!  I love all the fun toppings they have and then the angry fries are so good!  Also have good Mac and cheese that you can add bacon too.  Service has been good the two times I've come as well!", "pics": null}}, {"review": {"des": "I had the bison burger which was just ok, not much flavor. My wife had a waffle burger and we shared a cheddar fry. Both of those items are amazing. A large fry is more than enough to share for 2 people", "pics": null}}, {"review": {"des": "Disappointing <br>Not worth the $$<br>If I'm gonna spend almost $12 on a burger I would like to at least be able to taste the flavor of the meat. <br><br>First, we walked in n all we could smell is dirty wet rags.  At first I thought it was the runners on the floor (cuz it was raining outside) but as we sat at r  table we can smell it on the table as well as the menus.   Then I saw the busboy cleaning a table with what looked like the same type of cloth napkins that our  silverware was wrapped in.  He first wiped the seat of the chair n then wiped the table n put the menus on top of the table.  So basically someone's nasty ass was on the table n menu.  Gross!<br><br>The food...<br>We got the bison, lamb n bacon BBQ with sweet potato fries and onion strings.  I like my burgers a little on the plain side so I can taste the flavors of the meat (especially with new burger places)  However with the bison n lamb all we could taste was the salt n the toppings.  With all the different flavors from condiments we couldn't taste the meat at all.  Prob also because the meat is super thin!!  (May need to get double patty if u wanna taste the meat!)<br><br>Kids like the sweet potato fries n onion strings.  It was just a little too salty.<br><br>We were in the hood so we decided to try it.  Maybe we ordered the wrong things but most likely won't be back. <br><br>One star for my wheat beer n 1 star for the sweet potato fries.  But you can get that anywhere.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jPgyVdImhZyGD7F9QoDxCg/168s.jpg", "caption": "Wheat beer was pretty good."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EUiOEolzHTi6cuyIk8faqg/168s.jpg", "caption": "\"Where's the beef?\"  All bun n condiments."}]}}, {"review": {"des": "I've been to the Lombard DMK and finally made it to the Lakeview location which is much closer to home for me. However, it's not so much my speed - the food is the same and tasty but service leaves a lot to be desired here. When we walked in on a Friday night, we were quoted 45 minutes for a table and were sat in about 30 so that was a good start! <br><br>The front of the house was insanely crowded and loud and when we walked towards our table in the back I was thankful as I thought it'd be a bit less of each. I was wrong. Servers kept bumping into our table, we were next to the server station as they smashed dishes around (including on the ground), and music was still insanely loud in the main dining section. It was so loud, my voice was hurting by the end of our meal from constantly shouting at my man who was about a foot away.<br><br>Non-food things aside, I'll get to the nitty gritty. I started with the Dark & Stormy which wasn't as sweet as I'm used to with this cocktail. However, it was a nice drink that went down smooth and I guzzled it down.<br><br>I love that they have a Paleo burger option! I have cut carbs from my life so this burger was perfectly suited to my new lifestyle. One strange thing is they didn't ask me nor my partner how we wanted our burgers and both came out well done. Not ideal, but I get not everywhere cooks meat to a specific person's liking. <br><br>My guy ordered a burger with lettuce instead of buns and when the orders came to our table after an excruciatingly long wait, my Paleo burger had lettuce around it, no mushrooms and he received a normal burger with buns. Seems they mixed up our orders. They took them back and apologized but that meant us waiting an additional 10 minutes to re-prepare our corrected dishes after waiting nearly 30 minutes for them to come out in the first place.<br><br>All the waiting and mixups aside, I liked my burger just fine. It would have been better if it wasn't well done but the portobellos were done perfectly! We also ordered the truffle fries which were delish.<br><br>I honestly don't see myself coming back to DMK in Lakeview...service, ambiance and food all fell a bit short for me. Too many burger places in the city to revisit this experience again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/reWOp-u1tmF8ao7vOFJgMw/348s.jpg", "caption": "Dark & Stormy"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZUyNDHuQC40SpuvjeeeOMw/168s.jpg", "caption": "Truffle fries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MLdabtlu0r9TMluDQwz3hg/168s.jpg", "caption": "Dark & Stormy"}]}}, {"review": {"des": "A.     Mazing burgers. All around. Tasty buns no puns intended. Fries are super good. GREAT beer selection. Always good movies on the bar tvs and a solid mix playing. The staff is always extremely helpful and knowledgeable. A++", "pics": null}}, {"review": {"des": "Hello burger. Meet my mouth. Pleased to meet you. Nom nom nom.<br><br>Chicago is littered with burger bars across the city, but DMK should be at the top of your list. You'll certainly compare it to Kuma's and perhaps Au Cheval, but it's probably closer to the former in terms of price, offerings, and interior. It doesn't have the heavy metal vibe, but rather it's like the hipster version of Kuma's.<br><br>The nice thing about this place was it's relatively family friendly, and there are some great options for burger lovers of all ages. I had the Roasted Hatch Green Chile, Fried Farm Egg,<br>Sonoma Jack, Smoked Bacon burger with a side of parmesan, truffle cream fries and truffle mac & cheese. You can taste every bit of truffle in these sides. While you don't get the quantity like you would at Kuma's, the quality is there and perhaps better for your waistline.<br><br>DMK's burgers have a nice soft baked bun that holds in all those fresh ingredients, and I couldn't have been happier with my choice. This is a solid pick any day of the week, and they have dessert too! I ordered the monthly special - churro milkshake. Had it to go. Warning, it's thick. You'll likely use the spoon for most of it, but it was tasty down to the bottom.<br><br>I can't wait to come back and try some of the other burgers on the menu and see what new specials they have on the dessert menu.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/p49Y1h7NvMvGDyK4Ndjx0w/348s.jpg", "caption": "Roasted hatch green chile burger with a side of parmesan truffle fries and truffle mac and cheese FTW!"}]}}, {"review": {"des": "Really good burger place! I had the #9. It was really good, did not have a normal burger bun. My boyfriend had the 3 1/2. He said it wasn't as spicy as he thought it would be. Decent beer list as well. The Parmesan French fries were tasty. The service was great and we did not wait long for our food.", "pics": null}}, {"review": {"des": "I sometimes dream about DMKs Wisconsin Cheddar & Scallion fries. They are that good. One day in particular, I was slightly hungover and needed some greasy delicious food. DMK came to mind and I managed to walk the few blocks from my apartment to DMK. Their burgers are a nice twist on what you usually find in a pub/burger place. As opposed to large/thick patties, they are thin and perfectly seasoned, then you opt for the stye and toppings that you want to go with it. <br><br>If you're hungry go for the double patty and definitely order a side of the fries, obviously I recommend getting the Wisconsin Cheddar & Scallions.", "pics": null}}, {"review": {"des": "I didn't find this place that impressive. The wait was long, the burgers were fine, and the atmosphere was congested.<br><br>We had to wait quite awhile for a table and as a result we got a free sample of fries. It was a nice gesture to show they cared about the customers. But aside from that nothing else special happened all night. The burger I had seemed too expensive for the size of the patty, it didn't seem much bigger than something I could get at a fast food place. On top of that it doesn't come with any sides. If it came with fries it would feel more worthwhile but that wasn't the case.<br><br>I appreciated the service but was underwhelmed by the burger. For a place with \"burger bar\" in the title it was a little disappointing.", "pics": null}}, {"review": {"des": "The turkey burger was so good . Nice place to catch a quick bite and nice environment", "pics": null}}, {"review": {"des": "The turkey burger was excellent. I had avocado and a fried egg added to it. I sat at the bar, my server was excellent, great customer service. He really made me feel comfy, I was solo, when we did a shot together, cheers!! The hand cut fries were awesome as well.", "pics": null}}, {"review": {"des": "Good burger, their peanut butter shake was amazing! .truffle fries were good. Busy place with great service.", "pics": null}}, {"review": {"des": "Not sure where to start... music so loud you can't talk, lights so dark you can't read the menu and mediocre $15 burgers.<br><br>We had just left a concert at the Vic Theater and decided to grab a bite to eat. Found DMK right down the street and we're shocked how loud the music was. It was even louder than the concert we just went to where we were front row. I literally had to ask the waiter to repeat himself numerous times and also had to use the flashlight on my phone to see the menu. And the sad part? I wasn't the only one doing that. Despite everyone using flashlights and no one hearing what was being said, none of the staff bothered to do anything about it.<br><br>The food came and for $15 burgers they were okay at best. Mine had so much bbq that I could barely taste the meat. My wife's had way too much blue cheese and some type of sauce that over powered everything.<br><br>Overall I wish I would of just asked for my money back and went somewhere else that wasn't trying to hard to be so \"hip.\"", "pics": null}}, {"review": {"des": "Great burgers. Great fries. Good salads. This place is great for dine in or carry out. The restaurant does have a nice vibe to it. Parking can be a pain at times.", "pics": null}}, {"review": {"des": "Absolutely love this place. I've been here probably 6-7 times in the last few years and it has always been flawless, making it one of my top burger spots.<br><br>Anything you get here will be really good, the ingredients are fresh and everything is prepared masterfully. But I specifically recommend the bison burger, which comes with goat cheese and blueberry bbq sauce. It is a damn tasty sandwich, one of my favorites from any restaurant.<br><br>Great cheddar fries...they have Merkt's here so you know it's a Midwestern comfort zone. Any place that offers Merkt's knows a thing or two about bringing customers back.<br><br>And why not add a shake to your meal...those are delicious here too. Chocolate peanut butter is the one I've always liked.", "pics": null}}, {"review": {"des": "Juicy burgers, they never disappoint!!! My go to burgers are 3 1/2 and 11 on the menu. Super flavorful and it melts in your mouth with every single bite you take. Would definitely recommend", "pics": null}}, {"review": {"des": "Im giving dmk 5 stars because i really have nothing bad to say <br>Food wAs delicious . We tried the #7- so good! The salmon burger , very delicious cabbage on it . The sweet potato fries were crispy and delicious and i highly recommend the inion strings that come with a spicy ketchup <br>I feel the food is priced accordingly , came out in a good amount if time and there was nothing we didn't enjoy. <br>We were seated immediately and our server was very friendly <br>I would recommend dmk if your craving a burger. Good for groups too", "pics": null}}, {"review": {"des": "All I got to say their homemade ketchup was my favorite. I will never go back to regular ketchup. Burgers and fries were good. Also, our waitress was friendly. The lighting was a little dark for my liking, but decor was cool and trendy.", "pics": null}}, {"review": {"des": "Over the summer, my bf and I were walking around looking for a place to eat before meeting my friend up at the bar.  We walked by DMK, and it looked really good but the wait was like an hour so we decided to eat elsewhere.  Fast forward half year, and I remembered this place and decided to come here for a casual birthday dinner, since my birthday was in the middle of the week.  <br>So this place is similar to the famous Au Cheval, but much more bar like and less fancy and less pricey.  They have an extensive beer menu.  My boyfriend tried three beers he had never had before and I grabbed a glass of red wine.  <br><br>After looking over their menu, we order the Wisconsin cheddar and chive fries to share.  They were really good, and the cheese on it was awesome.  For the burger, I got the #8 with the special sauce on the side and my bf got the #2.  I really enjoyed my burger and thought it was well seasoned.  Much like Au Cheval, they use a thinner meat patty so if you are hungry I suggest getting a double.  My only complain about this place is that the plates they use are tiny, and I struggled to eat my burger from getting on the table. I should also mention that the bartender was really friendly too.", "pics": null}}, {"review": {"des": "Great place for burgers and shakes. It's a little loud because they are also a bar. If you can get passed the noise, it's a fun and enjoyable burger place to be.", "pics": null}}]}