{"name": "do-rite-donuts-and-chicken-chicago-4", "reviews": [{"review": {"des": "Good donut as looks cute/fancy.<br>For myself, just too much sugar and calories!<br>Went there on Tuesday morning 7:40, got my blueberry donut within 4 mins.<br>Cannot comment on their coffee as recently just focus on Earl Gray or Eng Breakfast.<br>For a donut place, it's pretty good enough. Trans fats are bad for health anyway. <br>One in couples of months for me should not be too bad.", "pics": null}}, {"review": {"des": "I blame Do-Rite for my cavities. I just...can't help myself. For the longest time, I came to Do-Rite and ordered all the wrong things. For some reason, I was resistant to ordering their classic glazed old fashion donut. Then one day, my life changed. I caved and decided to try one of their classics and have never looked back since. Sweet, crunchy, warm, soft -- there are not enough adjectives that can describe how great Do-Rite donuts are! To make things better, you can grab a Dark Matter coffee (small) for just an extra dollar with your donut! Unfortunately, this usually ends up making me eat a lot more donuts than I should...(which are, despite all their positives, quite heavy given how fried and greasy they are).<br><br>On the flip side of things, the chicken sandwiches here are solid. Crispy on the outside, juicy on the inside. Unfortunately, they're a bit heavy and greasy for my liking, so I hold back on getting these when I can help it. Overall, a nice spot and definitely a classic for anyone visiting Chicago!", "pics": null}}, {"review": {"des": "So I've been back a few times and gotten a chance to try a few more doughnuts and I have to raise the review score.<br><br>The Red Velvet Coconut and the Blueberry crumble are just....SO GOOD!! I've tried other doughnut flavors too but so far these two are the standout by far. Both of them have such a great texture and amazing flavor. If you see either of these and you like red velvet/ blueberry please try them out!", "pics": null}}, {"review": {"des": "Why do people love donuts so much? Because they are just so good and satisfying. I love donut too (if I don't count calorie, I can eat it all day)!<br>I had a chance to explore this donut place and tried the chicken sausage donut sandwich! It was a unique experience for me. The place was very small and crowded in the morning, and the staff was very busy and a little bit impatient. Just please be aware that there might be a line at around 9am in the morning. Except the waiting, everything else was very good. The donut was very good and tasty. Wish I could try several more!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/olNW_yilZRTBHJcEZz9RqQ/348s.jpg", "caption": "Chicken sausage on donut!"}]}}, {"review": {"des": "Pretty good dense donuts. I tried the vanilla bean glazed and it was so yummy! Also had the bacon croissant breakfast sandwich and the eggs were so buttery and<br>Croissant so soft.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vPejA7xRjoSTxVbRmh2Dmw/348s.jpg", "caption": "Awards"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7wEaM_f9t-1m_hyH28fU7Q/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/liPGjo3v6_WzkMfzP_Jlng/168s.jpg", "caption": "Glazed vanilla bean. So good!"}]}}, {"review": {"des": "Bookmarked this place for my visit while in Chicago. Sadly the info provided on Yelp about \" donuts made every hour throughout the day\"was incorrect and made my visit a complete fail. Went in around 4p looking for the famous artisan donuts the pistachio donut in particular, it was not available. I Was told they stop making fresh donuts around 1pm.  So I was left with a more basic options. Wanted to try something so I ended up trying the basic glaze donut. It was nothing special for $2.51 definitely not worth my time or money. <br>If possible please update you're yelp account with correct information. It was a bit misleading. T", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6lUMapHqsmFX528YgrASlA/348s.jpg", "caption": "Not correct, they stop making fresh donuts at 1pm"}]}}, {"review": {"des": "Great donut place with an array of donut flavors. They also have very good fried chicken that comes in the form of tenders or in a sandwich. <br><br>It's a very small shop, so I recommend going after the morning/afternoon rush or you'll be waiting in a line that's out the window.<br><br>The best donut on the menu is the maple bacon one, which is a great mixture of salty and sweet. I also am a fan of their blueberry and their valrhona chocolate donut. All the donuts are very fresh and fluffy. <br><br>The chicken has the perfect ratio of crispy skin to meat. The dipping sauces are awesome. I have yet to try a sandwich with a glazed donut as the bread, so that's next on the list!", "pics": null}}, {"review": {"des": "Great decision if you're in the mood for a chicken sandwich or a donut. Or both... at least if you're me :)<br>I got the regular chicken sandwich, which was perfect. But they have a couple varieties, including a spicy option! Unfortunately later in the day (around 5 pm) they only had 3 types of donuts left to choose from but I ended up being happy with my chocolate glazed nonetheless. If you don't see anything left you like, Stan's is a few doors down and I noticed when I walked by they still had many different kinds left. Two donut shops across from a hospital - what are the chances? <br>Do-Rite also had some outdoor seating which I enjoyed, and they have some indoor counter type seating too. Pretty great all around!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/r21xCjsUcEzSTk5fNvMiKw/348s.jpg", "caption": "Yasss"}]}}, {"review": {"des": "A long awaited for grand opening.  We desperately needed a donut restaurant after Glazed and Infused left us.  The stand is located near the stairwell on L2 near the escalators. There was already a line for the free donuts or breakfast sandwich but it moved quickly. All the employees were very welcoming and excited for their opening.  There are a few tables on the side for patrons to enjoy their food. I am looking forward to enjoying more of their food throughout the season.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HZcyD6yvR44IUDIryaBN3w/348s.jpg", "caption": "Pistachio Meyer Lemon"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/W0PLrIQwR7nsv9x79lP6cA/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Once again, so happy I listened to my Yelp fam and gave this place a try. And while I'm not one to typically have donuts for breakfast, when on vacation, do calories even count?<br><br>This location for Do-Rite happened to be in the same block where we stayed, across from Northwestern Memorial Hospital, only a short walk away from the Magnificent Mile. We showed up around 10 a.m., and there was a short line that went out into the front patio of the establishment. However, the line moved fairly quickly, and this gave us a chance to think about what we wanted, plus we caught some yummy smells from other people's orders as they walked passed us.<br><br>We ordered the Buttermilk Old Fashion and the Michigan Apple Fritter - which they had JUST finished making so they were super fresh and hot!. Oh my goodness, what a treat! Beware of how RICH these donuts are, but I can't imagine in any scenario how rich and complexity of flavor could ever be a bad thing. <br><br>We did get a coffee along with one of the donut orders, and I will say I wasn't too impressed. However, I did not mind much because I wasn't here for the coffee. The donuts TOTALLY delivered. Also, their customer service was on point. We really enjoyed being Do-Rite's customers that morning. <br><br>Can't recommend this enough. If you can get a donut that was just freshly made, I think you should get it! There's nothing like having freshly made, hot, delicious donuts!", "pics": null}}, {"review": {"des": "I love donuts, and Do-Rite Donuts & Chicken manages to hit a lot of my favorite buttons. Their popular outpost is ironically across the street from the Northwestern University Hospital in downtown Chicago. There is no parking in the area with everyone walking here. <br><br>My visit was shared with a few Chicago PD and nurses from the hospital. This means I was in the right place. I opted for two of my favorites - Michigan Apple Fritter and Valrhona Chocolate Old Fashioned. Both were very large and a bit expensive. <br><br>The apple fritter was rather light and airy compared to many that I've had. It was still very large and full of chopped apples and cinnamon. The old fashioned had a rich and thick chocolate glaze, but the base donut was not as crisp as I prefer my cake donuts. Choosing two was too much for my hungover belly, but it was great to sample both. <br><br>Gourmet donuts is almost an oxymoron, but Do-Rite Donuts & Chicken is doing right in Chicago. Hopefully you don't need a trip to the hospital afterwards!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UtOaF9TW5eCBaeY_s2xeqQ/348s.jpg", "caption": "Shop Exterior"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5M0vBtvNQexdB44-Go9YQQ/168s.jpg", "caption": "Shop Interior"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jpYmIFMf4So-d_mwFIOJEQ/168s.jpg", "caption": "Chocolate Old Fashioned"}]}}, {"review": {"des": "No frills, delicious doughnuts (many flavor options) with multiple locations in Chicago <br><br>Pro Tip: Order the Lemon Pistachio Cake Doughnut", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/E6rryzG01B3G89s3vR2CPQ/348s.jpg", "caption": "Ft. Lemon Pistachio Doughnut"}]}}, {"review": {"des": "Visited for lunch one day after a co-worker recommended it to me. Ordered the chicken tenders with ranch & fries. (They are fresh made to order, so they take some time). However don't worry in the meantime you can drool over all of the donuts in the display. Lots of options to choose from depending on the time of the day and they are made fresh throughout the day. The tenders when they were ready are lightly seasoned and have a light breading and are super fresh and messy. Since they are made to order they do fall apart and the breading comes off in the dipping sauce but the flavor is overall solid. Not the greatest chicken tenders I have ever had, but nice taste and freshness guaranteed. Seating inside is tight but also tables outside (covered). I will be back eventually, sadly didn't get a donut. Next time. Overall: 4.1/5.0", "pics": null}}, {"review": {"des": "If you are into cake donuts then stop everything and head over to Do-Rite Donuts! My sister and I originally came on recommendation from our brother to try the chicken sandwich but found that lackluster and overcooked (maybe we are spoiled from growing up in the southeast?). We also picked up a pistachio-meyer lemon donut to try and deeply regretted not getting more than one after we finally dug into it a couple of hours later. The donut has the perfect texture and density of a well done cake donut and the tang of the meyer lemon with the crunch of the pistachios left me wanting more. Save yourself the fight over the last bite and get 2 donuts!", "pics": null}}, {"review": {"des": "Move over Stans. This place is way better. <br><br>We had the candied bacon and old fashioned and a pbj for later. Sitting outside seemed a challenge tho cause apparently the birds know the donuts are amazing and wouldn't leave us to eat in peace. Very aggressive and wanting some of the cakey goodness. we lost the battle. I snapped a pic of the culprit but not sure if it posted. <br><br>Any who, folks are nice. Grub is good (we also had the mr piggy) donuts are even better and coffee is under 2 bucks. Can't go wrong with this stop.", "pics": null}}, {"review": {"des": "Do-Rite Donuts aims to do it all and they mostly get it right.  The donuts, there's no debate that they feature some of the best old-fashioned donuts in the city.  Top 3 easily.  <br><br>The Chicken Sandwich.  If i'd written this review when I first hit this place a year back I'd have probably given it 5 stars, but something has changed with this sandwich and I don't know what it is.  It lacks a bit of the crisp that you associate with a good fried chicken sandwich.  I don't know if it's something different in the batter, or how they prep it, but it's not quite perfect.  <br><br>Still if you have a hankering for a donut or/and a pretty good chicken sandwich then you still can't go wrong.", "pics": null}}, {"review": {"des": "Gourmet donuts, Yes please! This is not your regular glazed or chocolate with sprinkles. The donuts are fresh and soft. We ordered almost every flavor to sample. We liked most of them. The red velvet was not popular in our party. It was more coconut than chocolate. I personally liked the blueberry and meyer lemon pistachio donut. The filled ones were also very good. They also have chicken sandwiches here. The spicy chicken sandwich was good, tender and juicy. Staff was super friendly too! <br><br>Bar seating is tight inside but there are tables outside.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NrrAbsqMJEDjsl16gAqqUQ/348s.jpg", "caption": "Spicy chicken sandwich. Very good."}]}}, {"review": {"des": "Very tasty sandwich. I had the chicken sausage and egg which also came with cheese, tomato, and some type of mayo I think.<br><br>Staff was nice and courteous. Sandwich took about 5 minutes or so to prepare so I dug into the donut while waiting. <br><br>The coffee is pretty great. I believe they are supplied by a local shop called Dark Matter.<br><br>Will visit again the next time I'm in town.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2tWaJrwg71No9aX9N_11Bg/168s.jpg", "caption": "Original buttermilk donut and small coffee for $1 with donut purchase"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/U99ofboNies82Bv_WWFrqw/168s.jpg", "caption": "Chicken sausage and egg sandwich - $4.99"}]}}, {"review": {"des": "I'm a lifelong fan Do-Rite!! People say come to Chicago and eat the pizza? No way!! This is the place in Chicago you must visit!<br><br>The cinnamon crunch raised has swirls of cinnamon throughout the dough, and this beautiful crunchy cinnamon sugar crust. The blueberry crumb is impossibly moist, the pockets of jam injected into the soft cake donut are not too sweet and perfectly tangy with a softly sweet crumb speckling the exterior. The pistachio-meyer lemon is just crunchy and nutty enough without being overwhelming, with a beautiful zingy zest throughout the cake donut and a refreshing icing on top. The candied maple bacon is not overly sweet or overly mapley, with two perfectly salty and crunchy bacon strips decorating the top. The apple fritter has a good amount of apple spread throughout with swirls of cinnamon also incorporated into the dough, it was nice and plush with a good crisp crust.<br>These donuts are HEFTY. We brought six home and it made my arm sore carrying it around!<br><br>What kind of donut place has the right to not only make amazing donuts, but also amazing fried chicken sandwiches? Like it's a crime to be so good. I know it's probably so bad for my cholesterol but I had to come back and eat another chicken sandwich the next day.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/30bKczERkdp8yCqBNqWsQw/348s.jpg", "caption": "A perfect souvenir"}]}}, {"review": {"des": "I have literally been waiting for years to come here and taste all the sweet treatz and fried chicken. My dream came true the other day, and I'm happy to report, it was as good as I imagined. <br><br>I had a CBR on a donut, Nutella coffee drink, and sampled the old fashioned and sprinkle donuts (yes I am a huge glutton, get over it). The CBR was delicious!! I honestly was expecting the donut to be overpoweringly sweet, but it balanced really well with the fried chicken and bacon. The Nutella coffee drink was really yummy too, but definitely overkill after a donut sandwich- let alone the tastes of donuts I also had. <br><br>Ya so, definitely come and sample their donuts and chicken sandwiches. Just don't wait for years like I did.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MxkOaheDL-zhtyx8DRzhPw/168s.jpg", "caption": "The CBR on a donut"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AnzJbR6923nfGbXG9FyM5A/168s.jpg", "caption": "Half dozen plus Nutella coffee"}]}}, {"review": {"des": "We went to Do-Rite on a Saturday morning around 9:30 a.m. It was bustling but not overly crowded. Staff was friendly.<br><br>We got four donuts and a breakfast sandwich, which my husband said was hot and pretty good. Although he did say that the bread was so buttery that it was almost too much.<br><br>I think I am spoiled by donuts back on the east coast or maybe I just really do not prefer cake donuts but I tried the boston creme and the birthday cake and they were both ... fine. But truly not memorable at all to me. And I really fucking love donuts. The birthday cake one tasted like an Entenmann's donut. Dry. And the icing reminded me of what you see on a Tasty-Kake cupcake or something? Super artificial and stuck to the roof of my mouth. The Boston was fine but not enough creme. My husband tried the lemon pistachio which he said was good but probably would be better if it wasn't a cake donut.<br><br>So maybe if I tried the red velv coconut (which I wanted to but didn't see it until after I ordered), or if we tried the fried chicken, this would be higher than a three.", "pics": null}}, {"review": {"des": "I'm seriously glad I don't live in Chicago.  Otherwise I would be at do-rite doing wrong to my body on  a regular basis.   I thought no place could be better than a special place on the west side of Indy.  No matter where my travels took me out of 20+ states in the US and a few outside the US, I still was not impressed with donuts outside of Indy until now.  Yes I have a new donut love and our love will be a LDR (long distance relationship) one.  And that's OK!  <br><br>I was on a coffee run when I spotted do-rite on my digital map. I decided to wait the 13 minutes or so for do-rite to open to see what they offer.  The donuts looked like what I have seen before and I picked out 3 I knew my companion would like to share and 1 more I know would like.  <br><br>The young man at the counter was nice and even honored my request of putting one donut in its own bag for my companion.<br><br>Unfortunately although they have iPad registers, they don't take Apple Pay.   I paid for my goodies and got ghost back to my coffee run next door.  Once I got back to my accommodations for the weekend, I tried out the Pistachio Meyer Lemon and fell in a moist cake perfect crunch slightly salty nutty sweet love affair.  I had planned to eat 1/2 now and 1/2 later.  Yeah so much for that plan!  Carb coma here I come full speed.   Yep, I'm already sleepy but oh so satisfied with being done right by do-rite donuts!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6rAY59ZW94qTVjI8nPAHSA/348s.jpg", "caption": "Maple Bacon and Cheese Danish (yeast) donuts"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7YcC3tUAUtKc90vkQJuk0w/168s.jpg", "caption": "Birthday Cake (cake) donut"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rslRyWza_SvjTuxuLbloJw/168s.jpg", "caption": "This says it rite!  They do-rite by their good donuts."}]}}, {"review": {"des": "I was hoping this place would Do Rite by me, and they did. Bravo. Perhaps they're owned by Dudley Do Rite. Who knows.<br><br>They have some pretty spectacular donuts and they are definitely trying to allude to New York City in the style and taste. But when I tasted DB3 up in Evanston it's hard to give Do Rite a 5-star rating.<br><br>If they were an undiscovered little gem I would give them 5 but given how massively popular and even slightly overrated they are, I think four stars is more fair. Plus parking is absolutely terrible and the hotel across the street will give you a lot of crap if you leave your flashers on for no reason. Seriously bad attitude and not looking out for their neighbours. Not Do Rite's fault, but it makes it harder for me to come here.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ecO33j8iG_wZ36NFkdHnBQ/348s.jpg", "caption": "Hole-y donut."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OwZaPv08talmkgpBpsbyxg/168s.jpg", "caption": "But not glutton free"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8wV1v2JN8aQ7HqIXJCcZIA/168s.jpg", "caption": "Don't order the chicken if you're chicken"}]}}, {"review": {"des": "They are busy for a reason. When they run out, they close for the day. Safe to say these are very fresh. As busy as they are, you won't wait too long for your order. There is seating outside. No seating indoors. The chicken sandwich using a glazed donut as a bun was fun. Not necessarily a perfect pair, but the chicken was good and donut was also. Tried a lemon donut topped with ground pistachios. Very good. Do-Rite donuts done right!", "pics": null}}, {"review": {"des": "3 words. VERA.CRUZ.SANDWICH. <br><br>SO insanely delicious. I think it's the fresh, warm brioche bun that does it. It's the only sandwich I've tried but I'm in love and can't get myself to order another one if I'm there! <br><br>Their old fashioned donuts are definitely some of my favorites as well! I think the other donuts are great just not the best - but their old fashioned ones are on POINT! <br><br>The employees are fast and friendly. The space is tiny and always crowded so be prepared for that... but it's worth it!", "pics": null}}, {"review": {"des": "If you Do-Rite by your neighbor...then they'll Do-Rite by you. My 'neighbor' in this case is the one and only affable Alexxx A, whom I was visiting in Chicago and boy did he come thru for this girl. <br><br>On somewhat of a time crunch to catch my flight, we ordered the Avocado Breakfast Sandwich that comes on a toasted brioche bun with scrambled eggs, cheddar cheese, avocado- of course and mayo. Since I love meat, I had to add some bacon. The menu made no mention of it, but the sandwich also came with a juicy slice of tomato which really tied everything together. <br><br>The food was ordered on an app and was ready by the time we drove around the corner, lol. Pick up was a breeze, I just walked in and watched them finish wrapping the sandwich up...great knowing it wasn't sitting under a heat lamp. <br><br>Wow wow wow!!! I'm not a morning person, but I could be for one of these...luckily they serve them all day, bad thing is I live all the way in California so it will be a cool minute before I can get me another. I savored every calorie laden morsel. The eggs so fluffy, the bacon crisp, avocado ripe, the cheese melty and the bun so light. It was a meal in itself as I ate half of it on the way to the airport and the other half on my flight...I may have even licked the crumbs off of the wrapper. <br><br>Next time you're in the mood for some breakfast and your friends suggest a place like Denny's or IHOP...ditch them cause you don't need that kind of negativity in your life. Instead, get you an Alex (but not mine, he's spoken for JK) who loves you and who will Do-Rite by your tummy. <br><br>This is going to stay on my permanent bookmark list ;)", "pics": null}}, {"review": {"des": "The chicken and donut sandwich is amazing. Love going here for breakfast. They have great coffee too.", "pics": null}}, {"review": {"des": "Breakfast of champions right here! Fried chicken on a glazed donut with really decent coffee followed by a chocolate old fashioned. Set me up nicely for a touristy day in Chicago <br><br>Pleasant service even when the queue is pretty long. <br><br>They really are doing donuts and chicken right here!!", "pics": null}}, {"review": {"des": "Best gluten free donuts EVER, PERIOD. We don't need to argue, because there isn't a reason to argue. It's a fact. GF vanilla birthday cake donut is my go to donut. I've eaten it dozens of times. I can't stray. It's fluffy and cake like with a tiny crunch on the outside. It's incredibly addictive. <br>If I want to feel miserable and eat gluten, I'll eat the spicy chicken sandwich. Sometimes it's worth getting glutened over. Yeah, it's that good. <br>The space is small, but I sit outside 99% of the time, regardless of the weather and inhale my gf donut. <br>Do-Rite does it all right....except when they run out of donuts. Than it's wrong.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pfzQeMl5Xzs4ZngSAW2cEg/348s.jpg", "caption": "Gluten free vanilla sprinkles with a cold brew. My usual."}]}}, {"review": {"des": "Delicious donuts. Had their chocolate gluten free donut, it was really good.<br>Had their lemon pistachio donut for the first time, it was good.<br>But the red velvet is still my fav.", "pics": null}}, {"review": {"des": "I can't stop singing my praise for Do-Rite Donuts and Chicken. I swear by their donuts and their fried spicy chicken sandwich, and I also almost always complete my order with a Havana Iced Coffee.<br><br>Their fried chicken sandwiches are only available at the West Loop and Streeterville locations, and I am so lucky to have this within walking distance of my office. I have ordered their box of a dozen for numerous occasions, for my co-workers, birthdays, a box \"just because.\" Donuts make everything better.<br><br>I have a system of labelling the flavors on the box. If you flip open the box, take a permanent marker and create a grid (similar to tic-tac-toe) to imitate the donut grid on the bottom half. Then write the flavors in each square in the top inner lid to replicate the flavors, which is an aerial-view-copy of the flavors. This works for a half dozen or full dozen box. Hoping the description of this process makes sense... It's a legendary donut legend :)<br><br>Favorite Flavors:<br>Valrhona Chocolate Cake<br>Candied Maple Bacon<br>Buttermilk Old Fashioned - always a classic<br><br>Sometimes they have special flavors, listed in-shop and it changes based on availability and chef's preference. You never know which flavors can pop-up i.e. red velvet, key lime, etc. They even have daily gluten-free and vegan options which I've had, and you won't be able to tell the difference.<br><br>You can order mixed iced coffee drinks here, including the Nutella Iced Coffee or Havana Iced Coffee (my fave with lots of condensed milk). Or order it plain - it's Dark Matter and so good. Very strong and perfect with a donut. All of their items are fresh; their fried chicken sandwiches and fries are made to order. You will receive your sandwich piping hot, straight from the fryer.<br><br>If you want to fully commit, you can order the \"Sweet Heat\" which is a fried chicken sandwich served on a glazed donut. I haven't tried this yet because it's all of my favorite things combined and the food coma would only be compounded. I would approach the 'Sweet Heat' carefully and plan for that post-sandwich sugar nap accordingly.", "pics": null}}, {"review": {"des": "This was the first donut stop on my list when my boyfriend and I visited Chicago and Do-Rite's did not disappoint! We got there on a Friday afternoon and some donuts were already sold out. The shop itself is pretty small and can fit about 15-20 people comfortably.<br><br>My boyfriend and I got the Cinnamon Raised, Buttermilk Old Fashioned and a coffee for $1 since we purchased donuts! Both donuts were different in texture but both were absolutely delicious! The Cinnamon Raised was light and fluffy while the Buttermilk Old Fashioned was more dense (without being filling), flavorful and melted in your mouth.<br><br>My favorite was definitely the Old Fashioned and I can see why it's so popular! My boyfriend isn't much of a fan of doughnuts and even he liked it. If you're looking for quality donuts, definitely stop by Do Rite!", "pics": null}}, {"review": {"des": "Great donuts and fried chicken sandwiches. <br><br>Donuts are dangerous. Too many choices. Too many calories. But so worth it when they are good. And Do-Right does them right. My apple fritter was spectacular. <br><br>Their traditional chicken sandwich as also very good. It had a fast-food feel to it, but with the benefit of being made fresh to order. The wait was totally worth it. <br><br>I'm lucky that I don't live in Chicago, or I'd be here every day. Or perhaps I'm unlucky...", "pics": null}}, {"review": {"des": "I would describe Do-Rite as a high end donut shop. Don't get me wrong, the donuts taste great, but I'm a fan of mom and pop donut shops, where the donuts are bigger and cost less. <br><br>It seems that their specialty is chicken sandwiches served on donuts. It looks quite tasty and I would want to give it a try. Most of the donuts are cake donuts, that have filling in it. I got the oreo donut, which had a marshmallow filling, and the blueberry donut, which had a blueberry filling.<br><br>I also got a small cup of the nutella iced coffee. I was slightly disappointed with how the coffee came out. The cup was basically all ice and lacked nutella flavor.", "pics": null}}, {"review": {"des": "Average donut.  I was expecting a soft donut, but instead it was super crunchy and in my opinion over done.  I even got the donut at 8am.  The only redeeming thing was that the cost was less than $2. <br><br>What did I learn today?  I think they are better known for chicken not donuts.", "pics": null}}, {"review": {"des": "JUST GO!!<br>All types of amazing donuts... cinnamon crunch, milk chocolate, apple fritters, Boston creme, sour cream cake, moon pie, pistachio, meyer lemon, key lime, double chocolate, gluten free free donuts, red velvet, mocha coffee.", "pics": null}}, {"review": {"des": "WARNING: You might bite your fingers while munching on their amazing chicken sandwiches. <br><br>I ordered red velvet donut4/5, crumb cake donut 3/5 . They have different options for chicken sandwiches as well as donuts. If you are looking for a good breakfast before exploring Chicago. This is the place to go! <br><br>4 stars because the line was really long and they did not have enough space, you can always take a set outside, I was lucky to have great weather. <br><br>DEFINITE GO TO PLACE!", "pics": null}}, {"review": {"des": "Came here after having lunch at Nandos across the street and boy was I in for a treat. Couldn't decide between the red velvet coconut donut and the cinnamon old fashion so I asked if the red velvet coconut donut was more coconutty or red velvetty and she said it was more red velvetty so i went with the old fashion. It was so hard for me to choose since i'm a huge donut fanatic so my eyes kept wandering. My sister paid before i could add anything to the order. The employee joked saying that my sister had to cut me off before I ordered anything else.. She then reached for the red velvet and said \"Don't worry about it.\" It acts of kindness like this that really make an experience memorable for me. It people who read people and feed off of their energy to really go above and beyond customer service to make someone's day extra special. I want to give Sage a special shout out for this small act of kindness. The red velvet coconut was definitely so much more delicious because of you!! But really, both donuts were amazing, they were dense and moist packed with flavor. The cinnamon old fashion was really crunchy on the outside and soft on the inside, just the way i like it. It was covered in cinnamon so they didn't miss that mark at all. The red velvet coconut was way more coconutty than i imagined in the BEST way possible. I love coconut flavored anything so this donut was probably one of my favorite fusion of flavors, i never had red velvet coconut anything before. My sister also got the hazlenut iced coffee which was BOMB as well, perfect pairing with the sweets. Yes these donuts are heavy, but that's my favorite kind of donut. Overall, i can't be happier with my experience at Do-Rite and it's people like Sage that have us customers coming back.. and spreading the positive experience through word of mouth to friends and travelers all around. I can't wait to come back and try all of the other flavored donuts.. but of course, will still order the red velvet coconut donut each time.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vyJ-kBWahsgQPIFSk-dsMg/348s.jpg", "caption": "Red velvet coconut the best donut ever!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/P8zW_maOa0G3gBKhhDMfWA/168s.jpg", "caption": "Two amazazinggg pieces of heaven: red velvet coconut and Cinnamon Old Fashioned"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7jOR1OhHUMBBIogVS65Y1g/168s.jpg", "caption": "Inside"}]}}, {"review": {"des": "Gluten- free by association, Hubby has Celiac, I was excited to discover a donut shop offering gluten free donuts. I'm always excited yet skeptical, when I discover a place that offers GF because it usually disappoints but Do-Rite did not disappoint. <br><br>We purchased half a dozen, 2 chocolate, 2 birthday cake, and 2 cinnamon sugar. The chocolate was by far our favorite made with valhrona chocolate, perfect paired with black coffee. <br><br>Will be back soon!", "pics": null}}, {"review": {"des": "Great lunch spot for savory & sweet!<br><br>We ordered online for pickup to avoid any lines. Ready for us was a regular & spicy fried chicken sandwich with a lemon meyer pistachio donut as a treat. Good sandwich! Crispy and juicy with a nice brioche bun. Reminded me of Shake Shack! The boyfriend thought the spicy wasn't so spicy. And mmmm the donut hit the spot. Soft. <br><br>Minimal seating. <br><br>Will be back to try other flavored donuts :)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OJq54IbrCvXs8KK3Gb6H4w/168s.jpg", "caption": "Decisions, decisions, decisions."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dF5l_T6zwSyE4_Y_adT0AQ/168s.jpg", "caption": "Pistachio Meyer Lemon"}]}}, {"review": {"des": "Love their fried chicken sandwich! The donuts were fresh out of the fryer and the fried chicken was also very fresh.<br><br>Savory and sweet is a match made in heaven. Compared to donut burger, I would prefer the less messy fried chicken donut sandwich and would eat it everyday if I didn't have to watch my figure. <br><br>I'm glad that I usually stay at the Hyatt right next to it and it's convenient for me to get to!", "pics": null}}, {"review": {"des": "A couple people recommended this place to me as I was getting ready for a recent solo trip to Chicago, so I decided to swing by and check it out.<br><br>The chicken sandwich is pretty darn good! The best one I've had? Probably not, but it's up there. I would recommend getting it spicy.. it's not too spicy but definitely adds a nice kick to it. I would recommend skipping the fries though. I potentially just had a bad batch or it may be because I came pretty close to closing time, but my fries were not cooked all the way through and were still pretty hard in the middle. <br><br>As for the donuts, I only tried a couple, but they were all delicious. The pistachio and michigan fritter were good, but the red velvet stole the show between all 3 of them for me!", "pics": null}}, {"review": {"des": "Donuts and donut chicken sandwiches! Yum!<br><br>A variety of donuts available from classic glazed to specialty ones like red velvet. We tried the birthday cake donut and it tasted exactly like a slice of birthday cake. The donuts ranged from $2-$3, a little more than your average donut shop. What I was really excited to try were the chicken sandwiches!<br><br>Original chicken sandwich ($4.99): has special mayo, lettuce, dill pickle on a brioche bun. Presentation wise wasn't that pretty. Kinda messy looking like a burger from the drive thru. But nonetheless, taste wise was delicious. It was a simple but delicious chicken sandwich.<br><br>Sweet Heat chicken sandwich ($6.99): maple aioli on a glazed donut. It was a good balance of sweetness from the donut and aioli and spiciness from the chicken. I did enjoy it but it did seem a bit pricey.<br><br>Iced hazelnut coffee ($3.95): it's coffee made with Nutella. If you like Nutella then you'll like the drink. Definitely taste it. It is more on the sweeter side.<br><br>Overall, good donuts and sandwiches for a quick bite or something to please the sweet tooth!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0stvTm2916fUSixFaHmmyw/348s.jpg", "caption": "Sweet Heat $6.99"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IIOkRpMzkSCR7CCg1A2gIg/168s.jpg", "caption": "Nutella coffee $3.95"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Aw5n7lsSCzS_VTIL8gG8lg/168s.jpg", "caption": "Chicken sandwich and coffee menu"}]}}, {"review": {"des": "Another placeholder so my pictures link. I'll update with details later, but the 3 star rating holds true.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jvJo3_vAn1KugSiYAn4tlg/168s.jpg", "caption": "Spicy Chicken Tender Combo"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qES6s-26RZV16ZoAzXwJYg/168s.jpg", "caption": "Pistachio Donut w/ Meyer Lemon Glaze"}]}}, {"review": {"des": "AMAZING! Came here based on Yelp reviews to try something new - got the Original spicy chicken sandwich on a donut and a CBR (chicken bacon ranch) on regular bread.<br><br>I don't normally like to mix sweet and savory but this combination was genius! Counter staff were efficient and super friendly. There are bar stools along the windows if you want to sit down and eat or there were also larger tables outside in the patio/raised platform above the city sidewalks. Will definitely need to stop by for a sandwich next time I visit Chicago.", "pics": null}}, {"review": {"des": "We went late to a donut shop and I know that is a rookie move but that's when we could do it. It did not disappoint!! I got the old fashion butttermilk and it was awesome!  Kids got vanilla bean glaze and a cinnamon sugar and they were all delicious. I like that they bake them in small batches. You can tell. We would for sure go back. I like how small the place was too for some reason.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ciZJCMdjs7KjnYWDx9Bz9A/348s.jpg", "caption": "Old fashion buttermilk"}]}}, {"review": {"des": "Very good!!!<br><br>Find this place and eat there!<br><br>Got the spicy chicken and my wife got a glazed donut.<br><br>WORTH IT!", "pics": null}}, {"review": {"des": "A cool spot down in printers row next to Northwestern hospital tucked up in a hidden store front that's easy to miss. I care here for one thing only, chicken sandwich on a doughnut. This location has a clean crisp feel with white subway tile all around. I ordered the spicy chicken on doughnut. <br><br>The sandwich tastes good, unfortunately the sandwich was room temperature. The chicken tastes like it was sitting out for a while not fresh out the fryer. The doughnut buns also weren't warm. I was totally let down since I was under the assumption that I was purchasing a HOT sandwich not a warm sandwich. But I should've went back and requested a fresh one. No biggie I'll give them a try another time. <br><br>Overall worth the money. Tasty unique creation", "pics": null}}, {"review": {"des": "Holy expensive doughnuts.  We paid $17 for 4 doughnuts and an iced coffee.  Wow. <br>Had they been phenomenal doughnuts, I probably would never have commented about the price. <br>But,I use Dunkin' Donuts as my benchmark for all doughnuts and these were only slightly better. The standard glazed was meh and the birthday cake was also meh.  My husband's chocolate caked doughnuts were far better than mine. <br>The iced hazelnut coffee tasted so good.  Then, I looked at it a few minutes later and it looked like curdled milk on the cubes. Yuck.  <br>The service was really good.", "pics": null}}, {"review": {"des": "Definitely the BEST DONUT I've ever had. My favorite overall is the old fashioned donut, but the red velvet and the pistachio are soooo good as well! I wish I could have these donuts every morning, the dough just melts in your mouth and all of the are full of flavor. 10/10!!!", "pics": null}}, {"review": {"des": "Probably my second favorite donut place but my favorite breakfast sandwich place.  The donuts are delicious and there's a good variety.  My slight beef is that they're mega expensive.  On the other hand the breakfast sandwiches are huge and at $5, reasonably priced.  The best of the bunch is the bacon and egg.  The iced coffee is also fantastic and a skosh better than Starbucks.", "pics": null}}, {"review": {"des": "I dont have much of a sweet tooth and really never tasted much of a difference with donuts. These are delicious! Kid tested and they agreed, their favorite is red velvet and bacon.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/i-H4UaFG5DUq3jqOy--_xQ/348s.jpg", "caption": "Maple bacon, chocolarte cake, red velvet and birthday cake"}]}}, {"review": {"des": "BEST DONUTS ON THE PLANET! I had the red velvet coconut, birthday and cream cheese donuts and they were heavenly out of this world delicious! I ordered the CBR chicken sandwhich and it was just as insanely delicious. Please open a location in Dallas!", "pics": null}}, {"review": {"des": "OMG this place what amazing. The southern chicken sandwich (on a doughnut of course) was divine. I also got a half dozen doughnuts to take back to Jersey the cheese danish doughnut was just heaven in every bite. I would say the same for the vanilla glaze. Why isn't this place in New Jersey?!? If you are in Chicago even if you have to go out of your way get here for some of the best donuts you'll probably ever have.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SNjJ6goqKYxvO_03lIHANQ/168s.jpg", "caption": "This picture doesn't even do this chicken sandwich Justice. It is the Southern--chicken, bbq, and coleslaw on a glazed donut."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FFvUR2B8ZCnHWR6oitZw0Q/168s.jpg", "caption": "The level of amazing that these donuts were cannot be described in words."}]}}, {"review": {"des": "The donuts here are to die for. Like, I would literally defend this place's honor with my life. <br><br>The blueberry crumb tastes like a blueberry pie but isnt overwhelmingly sweet. The cinnamon has swirls of cinnamon baked in so it isn't just a powdered churro-type thing and almost has the bounce and heft of a bagel. The lemon zest has pockets of lemony goodness. The OG glazed is as melt-in-your mouth delicious as a Krispy Kreme one. <br><br>And holy shit the chicken donut sandwich. THE CHICKEN DONUT SANDWICH!!!! Get one. It sounds gimmicky but I promise you they actually cook delicious chicken here. And you already know the donut is bomb AF (as I've professed). <br><br>As a little bonus, the dude who makes the donuts is charming as all get out and chatted with my girlfriend and all each of the 3 times we went (in the span of 5 days).", "pics": null}}, {"review": {"des": "MY ABSOLUTE FAVORITE PLACE TO GET DOUGHNUTS EVER. every time I come here. I have to get the Valrohna doughnut. The chocolate is exquisite. The dough is raised perfectly; so rich, dense, and moist. <br><br>I recently got the blueberry crumb and it blew me away. Perfectly sweet and rich. <br><br>I moved out of state and sometimes I just day dream about do-rite.", "pics": null}}, {"review": {"des": "I visited around 3pm and the unique donuts had certainly been picked over, but that's my fault for visiting so late in the day. <br><br>I tried the vanilla bean glazed donut and the lemon cake pistachio donut and my total came to just over $5. Other specialty donut flavors included carrot cake, red velvet, candied maple bacon, chocolate cake with ganache, and Michigan apple fritter. Perhaps the most exciting thing about Do rite is their impressive menu of chicken sandwiches, which can be served between a sliced donut! <br><br>Their breakfast sandwiches are also served all day and I am regretting not coming back the following morning to try one. <br><br>The vanilla bean glazed donut was tasty, but I was really missing the vanilla bean influence. The lemon pistachio was fun, but very sweet and dense. However, it was definitely one of the better cake donuts I've had, as I usually don't care for them. <br><br>I really liked the old school charm of their shop and their cashier was extremely polite and friendly. Be sure to look for it tucked up on the patio because I almost walked right past them!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/v-A44JQ5s51YRqjRel28hg/348s.jpg", "caption": "Vanilla bean glazed and pistachio-meyer lemon cake donut"}]}}, {"review": {"des": "The bees knees of my Chicago visit from soup to nuts. However, no bees, no knees, no soup nor nuts were involved. Just a great quick food experience that requires special mention and is highly deserving of heaping amounts of praise.<br><br>The sweetest young gal taking my order was as bright as sunshine and conversed in such a way that could have kept me chatting it up for longer, what a doll.<br><br>The chicken sandwich body slammed Chic -Fila off the top of the best chicken sandwich mountain and now holds top billing position.<br>Add a side of cool come slaw that is made on the premises -- I'll remember this experience, I'll speak of this wonderful spot, it was dear to me.", "pics": null}}, {"review": {"des": "This is a great spot for the locals and if you want to save money. Located directly across from Northwestern Medical center this tiny donut shop serves a nice variety of donuts and fried chicken. Their specialty is putting your fried chicken between a donut!<br><br>My husband and I got there when it opened for best selection. Prices are slightly under $3.00 depending upon choice and if you order coffee your coffee will be slightly discounted if you pair it with a donut. Tough choices-Michigan apple fritters, red velvet covered with coconut and red topping, dark chocolate over chocolate.  Vegan donuts are also available. So I settled for the pistachio Myer lemon glaze and my husband had the maple bacon donut with real bacon on it. The coffee comes from dark matter coffee which is farm sourced from El Salvador. No you can't buy it by the pound.<br><br>When I ordered the coffee the lady put the cream and sugar in it but I preferred to do it myself. She obliged and gave me what I needed. I would advise you to request this otherwise your coffee may not be as you like it.<br><br>There is a small indoor counter or you can eat at the tables outside. When we sat down to eat these donuts were to die for! I really enjoyed my coffee too. The small was enough for me. Afterwards I went back to order some for the journey home. They sell only one size box which holds 6 of your choice for around $16.00. She was nice enough to wrap my box is plastic wrap to make sure the donuts don't dry out so my friends back home can enjoy them.<br><br>This is a great place for an inexpensive breakfast but I advise you get there when it opens for best selection. They sell out fast!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uiza_OzXymV1x-lcA5hkIA/348s.jpg", "caption": "This is their coffee"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/usIZ6VclfDYple20qxz4xQ/168s.jpg", "caption": "Pistachio Myer lemon glaze donut"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AFZjrUS27ahjjDG7ryMsDg/168s.jpg", "caption": "Maple bacon donut better pictute"}]}}, {"review": {"des": "Hmm....gluten free, hot out of the fryer, chocolate dipped donuts....no, definitely not freaking delicious! This was such a treat I went back twice. The cinnamon sugar donuts were ok but the chocolate dipped were just decadent, a definite must if you're nearby.", "pics": null}}, {"review": {"des": "The donuts are simply amazing, the old fashioned style is seriously the best! Blueberry crumble is one of the best donuts I've ever had, so good! Worth the wait!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/b22ZCbOP9YMa0pYnbMjviQ/348s.jpg", "caption": "Worth the wait on a Saturday morning!"}]}}, {"review": {"des": "Wow. The donuts here blow away anything you would find in a chain donut place such as dunkin donuts. The coffee is great too. But the best part is that they also have chicken sandwiches!  These babies put chick fil a to shame.", "pics": null}}, {"review": {"des": "Donuts AND chicken? Surely, not both are going to be good. Everything we had here was DELICIOUS. Service was fast and friendly even though there was a small queue.<br><br>My boyfriend and I each had a spicy chicken sandwich, a side of fries, a few too many donuts, and shared an iced coffee to wash it down. The chicken sandwich was crispy, crunchy, with a nice kick that didn't overwhelm with the perfect amount of mayo (not too much) and lettuce. The hazelnut iced coffee was surprisingly tasty. The beans come from a local well-known roaster so that makes sense. The donuts we got to try were PB&J, cinnamon old fashioned, and the vanilla bean glazed. The PB&J is a genius idea that all bakeries should steal. Such a natural idea but I've never seen it outside of here. A donut that really transported you back to the good old days (but damn you're actually just eating a donut in Chicago!)", "pics": null}}, {"review": {"des": "They have a variety of different flavors, and that was what actually enticed me to come here in the first place, besides the fact that they also serve fried chicken. <br><br>I'm sad to report that I didn't get to try the chicken, but I wasn't feeling the greasiness at the time of my visit. The donuts, however, were very good. They are on the denser side, since they emulate cake donuts. I actually prefer cake donuts, so they were right up my alley. <br><br>While they were good, not all the flavors I got were good to me, but that's probably due personal preferences on flavors. <br><br>Overall, I would definitely make a stop in here again.<br><br>Overall: 4/5<br>Food: 4/5<br>Service: 4/5<br>Atmosphere: 3/5", "pics": null}}, {"review": {"des": "Ok. This might be my new favorite donut shop. The price point is on par with their peers' (Stan's, Dazed & Confused, Doughnut Vault), but they come out ahead, in my opinion. Not only do they have a variety of flavors and types (yeast, cake, filled, vegan, gluten-free, etc.), but they have chicken! And, it's some pretty tasty chicken, at that! There is a decent rotation to the offerings, there are breakfast sandwiches (which you can get on a donut), and the staff is personable. I appreciate that this location has set hours, rather than just closing up shop whenever the donuts run out.<br><br>Also the apple fritter is pretty awesome!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/izZPm8XYfgXMOxwA53JGFA/348s.jpg", "caption": "Spicy Chicken Tenders"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Xfh9AEDGBl4DAd5Fkrq7FQ/168s.jpg", "caption": "Apple Fritter"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Sv0cD0fnZjTKG4FlFS8kmQ/168s.jpg", "caption": "Blueberry Crunch Donut"}]}}, {"review": {"des": "A spot that specializes in donuts AND fried chicken???! We HAD to check this out during our weekend trip in Chicago for Lollapolloza and it looks like it's a fairly new concept in Chitown. <br><br>I am not gonna lie I was expecting less than spectacular donuts and chicken considering most places that are great in one, specialize in only one (not both). I was definitely proven wrong! <br><br>This is a super small joint and is currently hidden due to construction on the building but there was wall seating inside and tables outside to eat. Once going inside they were pretty swift in moving people thru the line as you watch a constant stream of fresh donuts being placed on the shelves.<br><br>I knew I HAD to get both donuts and chicken so I went for their original chicken Sammie with crisp and flavorful chicken, pickle, mayo, lettuce, bread & butter pickles. While Zach went with the CBR Sammie with cheddar, bacon and ranch, the chicken could either come spicy or original and he went spicy to top off the flavor. We decided to each a donut and we would share both. We went for a scrumptious blueberry crumble donut and a birthday cake donut.<br><br>Let's just say it was the greatest pairing and I'm not wishing this was an establishment in Cincinnati because I'm dead of the savory, crispy chicken with the sweet, crumbly goodness of the donuts. The blueberry crumble was the by far winning if the two donuts and both Zach and I were insanely happy with our sandwich choices. Even Zach went as far as saying it was the best he ever had... WHAT. Needless to say next time you're in a Chicago put this on the top of your list.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DcK3pOaZIWFz3cfH64X0gQ/348s.jpg", "caption": "Classic chicken sammie"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9dPHBk6MuksjsFIjRFD2bg/168s.jpg", "caption": "CBR Sammie with aged cheddar, bacon and ranch mayo"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bY5jjHJ4d94GL4keNISBlQ/168s.jpg", "caption": "Blueberry crumb and birthday cake donut"}]}}, {"review": {"des": "Ordered a chicken sandwich on a whim through a delivery system. Had to meet the $15 min so added some tenders and donuts. Not at all disappointed! fried chicken was so light and crispy! The spicy tenders had a great heat that matched perfectly to the side of ranch. <br>Donuts were amaze balls!  They DO it RITE. Definitely go for the buttermilk old fashioned. You won't be sorry!", "pics": null}}, {"review": {"des": "I mean...donuts and chicken... you could never go wrong with this combination. I went on a Sunday evening...steady crowd but seating outside was available. The patio shade was wonderful with the summer heat. I had the CBD. Huge sandwich. If yo love bacon...come here. They do it right. Only negative, I asked for my sandwich spicy and I didn't taste any heat. Overall very cool and tasty place.", "pics": null}}, {"review": {"des": "My husband insisted that we try this place after I raved about Stan's. I was convinced nothing could be better than Stan's Donuts. I was wrong (I hate saying that haha). Do-Rite's donuts are like soft pillow-y clouds. Stan's is a bit more crispy/fried. I had a classic chocolate glazed and it was honestly the best donut I've ever had. My husband had the apple fritter and we also had to try the spicy chicken sandwich and it did NOT disappoint!", "pics": null}}, {"review": {"des": "Honestly my fav donut place in the area. I've probably tried every donut there and there has never been anything bad. My go-to is  the original buttermilk old fashioned. It has a perfect glaze on the outside and a deliciously soft interior. Super indulgent but not over the top. The pistachio is also a favorite of mine as well. <br><br>In addition to the donuts they also have delicious chicken sandwiches and chicken tenders! Come hungry!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OaRxL0pr5-hA9RWZx3QhLw/348s.jpg", "caption": "The spread"}]}}, {"review": {"des": "Excellent place to grab a quick bite! Their fried chicken sandwich with the maple aioli just works incredibly well. The chicken is juicy and well flavored, with a perfectly crispy crust. I recommend getting the spiced version, it just goes really well with the sweetness of the aioli.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/untgu_rzL2InNkNw7KXfuA/348s.jpg", "caption": "Fried Chicken Sandwich"}]}}, {"review": {"des": "Small shop with a little bit of seating inside & some covered outdoor seating, as well.<br><br>We stopped in about 9am on a Tuesday morning and it wasn't too busy, which was nice.<br><br>I do wish they had more donut options- but all 6 that we chose to try were fresh. Soft & flavorful. <br><br>My husband really appreciated how sturdy the to-go boxes were and that there were dividers inbetween the donuts- came in handy walking a few blocks to our hotel! <br><br>We'll definitely come back!", "pics": null}}, {"review": {"des": "my husband and i had visited do-rite donuts & chicken on july 5th.. our hotel was next door and we had planned in advance to come here to try their chicken sandwiches and donuts.. i was super excited coming here.. i've looked at so many pix, have studied the menu, and have dreamed about how the chicken sandwich would taste.. this is truly a small and cute place with plenty of outdoor seating.. seating indoors can be tight but it's doable.. it's a stand or sit down counter space only.. the entry way was interesting.. there's two doors you go through before getting inside.. not sure if it's due to construction or that's just how their entry way is but the first door was really sticky and it snaps and shuts back pretty fast.. don't let it scare you.. :) i'm sure it helps keep the inside cool as well.. <br><br>when we got inside, there were a few people in front of us.. when it was our turn, the lady who helped us made it seem as if she didn't want to be there.. my husband had ordered the spicy CBR sandwich and asked for a cup of water.. i had ordered a spicy fried chicken sandwich and asked if she can add cheddar cheese and bacon to it.. she then told me, so you want the CBR? i told her i wanted the spicy fried chicken sandwich with cheese & bacon added on to it.. once again, she said, so you want the CBR? i asked if the CBR also came with pickles, mayo & lettuce.. she said yes so then i said yes.. i had also ordered a valrhona donut.. at the end, she asked if i wanted anything to drink to which i had said no since my husband asked for a cup of water already.. she had rang us up while we waited.. <br><br>i had noticed we didn't get our cup almost immediately after paying but the cashiers were busy so we figured we'll ask when we receive our order.. everyone who came before us had their names called.. even though, at that time there were only a few people in front of us, there was already a good amount of people waiting for their food beforehand.. i told my husband, how is it that they're calling everyone's name but they never asked for our name? he said he didn't know.. i said maybe they took my name off the credit card? who knows.. <br><br>while waiting, i viewed and studied the entire place.. i noticed the many ipads/mobile devices for online orders and saw the owner (or so i believe) talking with his employees about coming into work (i felt that it could be talked about behind closed doors or quietly in the kitchen) and even saw the owner stocking more donuts up front.. each tray of donut was on top of another tray.. i don't know if they sit on top of the edge of the tray or if they're actually touching the donut.. i didn't know how i felt about that but i hoped for the best.. i also watched the people in the back making the food and bagging it to observing how some of the cashiers handled the customers as well as the menu.. i looked at as many pix on the wall as i could up to how there were a bunch of empty donut boxes next to me for i don't know what reason.. i would imagine the employees would box the donuts for you instead of the customer doing it themselves.. maybe someone can explain this to me as it's my first time here? <br><br>again, we're still waiting on our food.. we had saw the person who was before us inch closer and closer to the pickup area and so we knew our food was getting close to being done.. of course when our food was ready, they didn't call us by name.. *sigh* they called us by saying a special order chicken sandwich and a CBR.. i was annoyed but luckily we paid enough attention to know it was us and grabbed our food immediately.. my husband had asked for a cup for water at that time.. they do have a pop machine where you can get your drinks at.. <br><br>we decided to sit in and eat.. hoping that we actually got a spicy chicken sandwich (as it's not listed on the packaging), we ate to our hearts desire and were satisfied.. the chicken was juicy and tender and definitely not as spicy as how we'd like but still good.. the crunch from the lettuce and pickle were great as well as that slight tang from the pickle.. at first i thought there was too much lettuce only to find myself scooping all the lettuce that fell onto my wrapper and back into the sandwich.. i do wish they had tomatoes.. it would've added a nice touch and flavor to it.. <br><br>i did notice that my sandwich had ranch on it.. the reason why i asked for the spicy fried chicken sandwich was that it comes with mayo, lettuce, and pickles.. i WANTED the mayo.. not ranch.. there's a huge difference in taste.. hence why i ordered what i did but adding cheese & bacon instead of the CBR which comes with ranch.. and FYI, it needs more sauce.. <br><br>overall, i would definitely come back and try it again.. just hoping that someone would understand my order the next time around.. oh, by the way, the valrhona donut was really light.. i was really surprised! i would recommend this place to everyone..", "pics": null}}, {"review": {"des": "Still my favorite place to get donuts in Chicago. Went to the store that also served ice cream. Server was friendly and patient as we tried to decide which donuts to get. Anything valhrona chocolate is amazing. The cinnamon bun is like a hybrid of a cinnamon roll and glazed donut. Can't really go wrong and just happen that even though we came in the afternoon, they still had a good selection of donuts (at other locations when we came past 11p they were almost out of donuts", "pics": null}}, {"review": {"des": "I absolutely loved their glazed donut with spicy chicken. So delicious, it's a must have if your visiting a Do-Rite donut. This is my favorite location such friendly staff!!!", "pics": null}}, {"review": {"des": "Pros:<br>-Greats staff<br>-Cool space<br>-Covered outdoor seating<br><br>Their Boston Cream is the best I found in Chicago (2nd place Glazed and Infused, 3rd Stan's, 4th Firecakes Malted Milk Ball--if you can count that). Would definitely return!", "pics": null}}, {"review": {"des": "Do-Rite was recommended by a friend and we quickly passed by before our flight out of Chicago.  <br><br>We picked up birthday cake, red velvet and pistachio donuts. <br><br>I regret now not picking up every donut they had!   <br><br>AMAZING DONUTS!  Our favorite was the red velvet.  Full of flavor and still very moist. <br><br>Birthday Cake had a lot of sprinkles and the donut was just enough to top it off.  Not too sweet. <br><br>Pistachio Donut had a lot of Pistachio as topping which is great.  Not stingy at all on ingredients.  <br><br>We have to come back soon!", "pics": null}}, {"review": {"des": "Where do I begin? How about, OMFG!  This place was so good. As I scanned the menu, I had a hard tike trying to find the donut chicken sandwhich. I soon settled for the CBR (chicken, bacon, and ranch sandwhich). As I was about to pay I look under breakfast and BOOM! It's under breakfast items as an \"extra\".  Use a donut as your sandwhich option. For only $1.00.  I was sold. It didn't take long to get my food. Once I did, I was hesitant and I hoped it tasted as great as it looked. I took my first bite and I was in heaven. Like the articles in the donut shop that lined the wall say,  \"THE BEST!\" Seriously, so good.  I think everyone should try this is you love donuts and fried chicken.", "pics": null}}, {"review": {"des": "I only come for the chicken tenders or chicken sandwich With that being said, customer service matters. This location has all new cooking staff and it is obvious. Do Not Order the anything that comes with cole slaw it was dry cabbage today. When I asked Eddie the new cook if they had forgotten to add something to the Cole Slaw? He answered it depends on who made the slaw and walked away. Carlos I miss you, your cooking, and your overall customer service.", "pics": null}}, {"review": {"des": "Great coffee.  Good fast service.  Chicken sausage breakfast sandwich was amazing.  Fresh real eggs.  Bacon maple donut was surprisingly good.", "pics": null}}, {"review": {"des": "The white guy making coffee today is so rude. I just asked for creamer and he seemed not happy about it. If you are not happy with your low paying job then just stay at home! No matter how good the food is, EXCELLENT service is everything!", "pics": null}}, {"review": {"des": "First and Foremost--Get Here Early!!!!!<br><br>I strolled in around 3pm and, no joke, there wasn't much left :( <br><br>I came in to try the Sweet Heat, but they were out of the vanilla bean raised glazed donuts so I'll be back bright and early sometime.<br><br>I tried a Cinnamon-Sugar Old Fashioned and it was Amazingly sugary crisp on the outside and densely cinnamony on the inside. I couldn't get enough....which was good because it was a large donut!<br><br>Also on deck was the Michigan Apple Fritter with its glazed drizzle and rich chunks of apples. I'm usually not a fritter fan, but I'd freely finish this beauty fast. <br><br>I wanted the Sweet Heat. I will get the Sweet Heat. I must have. The Sweet. Heat.<br><br>plus the gf and vegan.<br><br>Mmmmm......donuts.<br><br>*there is an accessible ramp, bits way left of the entrance.", "pics": null}}, {"review": {"des": "Z'omg! I have had the donut, the breakfast sandwich and the fried chicken sandwich. The chicken is like crack. It is seriously crack. It really is the best chicken I have ever had. Please do give this place a shot. It is excellent food, fresh and cooked to perfection. It truly is a gem.", "pics": null}}, {"review": {"des": "Vegan donuts are moist and delicious!<br>When I went on a Sunday morning at 9am there was still plenty of selection- they had 3 flavors - crumb cake, birthday cake, and chai . The birthday cake donut was perfect. Moist, fluffy and the perfect sweetness! <br>A great vegan donut!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/F3ouKmTo_DTSyEyYYQ2i3g/348s.jpg", "caption": "Delicious vegan birthday cake donut"}]}}, {"review": {"des": "Loved my cream cheese danish, which was actually a donut but that was okay with me!<br><br>The breakfast sandwich I got was HUGE and filling.<br><br>Boyfriend and his brother got the sweet and spicy chicken sandwiches and literally talked about how good they were ALL weekend!<br><br>Check it out!", "pics": null}}, {"review": {"des": "Wow - so happy to have come across this gem. Got the BBQ chicken sandwich (tasty bun) & old fashioned glazed donut. This donut is a MUST! It's crunchy on the outside but the inside of the donut is sooo moist/soft like a pancake. #magical. First time having chicken with donuts and i donut regret it at all. Had to wait a bit for a seat, but was so worth it!", "pics": null}}, {"review": {"des": "This was conveniently located right at the bottom of the place I stayed at during my trip to Chicago. Decided to pick up a few donuts to share for breakfast before we got our day started. I had never seen a pistachio donut, so knew I had to get that one and we also ordered the vegan maple chai donut. Both were very delicious; not too sweet, cake like texture. Most vegan treats I've tried are more dense and dry, but the vegan maple chai was not dry. It was definitely more dense than the non vegan pistachio donut.", "pics": null}}, {"review": {"des": "I love Do-Rite Donuts. Eat them whenever I can, but don't have one close to anywhere I go normally. Those are always 5 Star. I had never had the chicken though.  I think I'm usually there in the am and in just a donut mood. This time though, I made it a \"brunch\" and got a chicken sandwich with my donuts. Outstanding. It looks pretty basic, but absolutely crushes your typical fast food chicken sandwich.  I would like to tell you I'll go there for just that at lunch. But honestly I'm never going in and out of a Do-Rite without buying a donut.", "pics": null}}, {"review": {"des": "Easy to miss, tiny place across from medical center in office bldg next to skin place. Glazed donut and avocado breakfast sandwich was 5 out of 5, but hubs chicken sandwich was not great and the old fashioned donut was heavy and nothing special. Even though this place is known for chicken and donuts, I would go back for the breakfast samich!", "pics": null}}, {"review": {"des": "At do-rite they do it just right! Right next door to Hyatt Centric on Eerie Street. Indoor counter and outdoor seating available.  <br><br>The donuts leave you wanting more! I ordered the glaze and old fashion butter milk. The texture was right on for both. The glaze was soft and fluffy with a slight chewiness to the donut. The old fashion butter milk was not too dense cake donut with a slight sugar shell on the outside. What I loved most about the donuts was that it was not too sweet. Just the right amount of sweetness. <br><br>I also ordered the original chicken sandwich. I would say it's better than chick-fila. The combination of the pickles, slaw, and sauce was a great blend of juiciness of chicken, slight tanginess from pickles and sauce, and a nice crunch from the slaw. <br><br>Everything was delicious! I highly recommend trying the chicken sandwich and donuts!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hXjovsafqmgwRzBYnG8gOg/348s.jpg", "caption": "Original chicken sandwich"}]}}, {"review": {"des": "Quite possibly the best breakfast I've ever had. Goodness all around. The Sweet Heat (spicy) is the way to go. The fried chicken is absolutely perfect and just spicy enough. The spicy maple aioli was so good! <br><br>Service was much friendly and happier as one would expect with it being New Years Day. Pretty busy with a small line, and be prepared to wait a little. Good local Chicago coffee is available. <br><br>We also had the Fried Chicken Sandwich and a few donuts for my little girl. Didn't try any sides or fries, but will next time. <br><br>$4 to $7 for a Sandwich and the donuts are $2-$3.50 each. <br><br>Will definitely be back and have added this to both my breakfast and fried chicken lists.", "pics": null}}, {"review": {"des": "Delicious donuts and sandwiches! My family got a full dozen of donuts since there was a deal on 10 donuts and get 2 free. Favorite donuts were the blueberry crumble, cinnamon, maple bacon and pistachio. They can get a bit pricey, an individual donut being about $2.50, but what a great treat! The avocado breakfast sandwich was well done and my friend absolutely devoured the sweet heat sandwich (fried chicken with aioli on the glazed donut). This is a smaller location, with bar like seating on stools and mostly outdoor tables. Hope to visit again when back in the area, and I'm glad that there are 3 locations!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3jrybCj7FfoRXN5TkDA0vA/348s.jpg", "caption": "Sweet heat"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iyFrt7mfB_3xI7emWnzC2A/168s.jpg", "caption": "Cinnamon raised"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ji4OVL0FRyphEhxWmlmb3w/168s.jpg", "caption": "Pistachio donut"}]}}, {"review": {"des": "One word: Amazing!  The best donuts and breakfast sandwiches in Chicago. We had the vanilla bean donut with sprinklers, chocolate glazed, Michigan apple fritter, and a chicken sausage breakfast sandwich with egg whites. WoW!", "pics": null}}, {"review": {"des": "Vegan donuts aren't super common in Chicago and I'm glad Do-Rite has vegan options in this location near downtown.<br><br>I got their last vegan chai spice donut ($2) and thought it was great: moist, fluffy and not overly sweet. The donut was really soft, though, and fell apart almost the second I picked it up.<br><br>Interestingly, the store sold out quickly of the vegan option, but was overstocked on everything else. Why not add more vegan options? Clearly there's demand.<br><br>Also, I'd love to see a vegan raised/yeast donut, instead of just cake donuts. All in all, this is a great little spot, though.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IQz3hPSSsydRd7vnVyjCJQ/168s.jpg", "caption": "Vegan chai spice donut ($2). Pretty good.. Moist and fresh. Falls apart, though."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AZsZcQsJx9IzfSD0pOvcBg/168s.jpg", "caption": "Rack of sold out vegan donuts up top. Why don't they make more? Clearly there's demand."}]}}, {"review": {"des": "AMAZING!! Best chicken sandwich w/ glazed donut buns I've had in my entire 37 years of life. It might also be the only one I've had, but still, this sets the bar pretty high for all future chicken donut sandwiches I will consume. The chicken was moist and crispy and the saltiness was complimented well by the sour pickles and sticky sweet donut bun. My only complaint is that there's no place to find this back home in Texas", "pics": null}}, {"review": {"des": "My doughnut buttermilk was good but the Original Chicken Sandwich changed my life. DO NOT MISS", "pics": null}}, {"review": {"des": "Only basing it on the donuts -<br><br>There's a wide selection of choices and probably the most affordable donuts that I have had yet! The size is ginormous, couldn't even finish one myself with such an affordable price. <br><br>Definitely hear a lot about do-rite's donuts, but I guess it didn't quite hit the spot for me. Donuts were a little dry and crispy on the ends, guess that's where they lost me.", "pics": null}}, {"review": {"des": "The chicken sandwich. I have a love/like relationship with it. I'm a huge southern fried chicken fan, having grown up on it. It was the meal my grandma fixed for us on Sunday so many times when we visited. It would be my \"last meal.\" I can tell you that I've been to Chick-fil-A three times in my life for the chicken sandwich and it sucked big time each time. McDonald's sucks, too, for that matter. Truth be told, I'm a fried Pork T guy, being from the Midwest, but that's another story. <br><br>So, as far as chicken sandwiches go, Do-Rite gets it pretty close to right. I enjoyed the sandwich. The chicken is supposedly brined and this one proved that out. Bun was soft brioche and held up well. Lettuce and aioli worked well, along with the sliced pickles.  Fries were standard they-should-be-good handcuff fries. Didn't need any catsup. Great counter service and food came out fast. Nice job, guys.<br><br>Oh, almost forgot. I had to try a donut, so I grabbed one for the next morning (yes, I only eat donuts in the morning). Got the Buttermilk Old Fashioned. Couldn't wait for the next morning, as I was having a bit of a sweet tooth after the sammie. Took a piece in and it was delicious. The best Old Fashioned I've ever had. Really good!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lkKEzlDVcWsyvK8XTXyx-g/348s.jpg", "caption": "Righteous Chicken Sammie"}]}}, {"review": {"des": "Best donut I ever had (birthday cake sprinkles gluten free donut fresh out of the fryer-and I am usually a gluten eater!). Be prepared for flocks of birds being aggressively attentive if you eat outside- they are either a source of entertainment or a nuisance depending on your perspective (I thought they were funny).", "pics": null}}, {"review": {"des": "I want to give a shoutout to the gentleman... I think his name started with an F? Last name started with a D? .. who was working online and phone orders on Sunday, 12/3/17.<br><br>I really like the feature of being able to place an online order the day before for pick up so you don't have to wait in the line.. which probably took about 20 of waiting... and gives you first dibs on the donuts they have. I placed my order at 8 PM Saturday night, paid for and all, for a 7:30 AM pick up. <br><br>My jet lagged self overslept and didn't wake up until 9AM. I called Do-Rite and \"FD\" cheerfully answered the phone, understood my situation, and took note that I wanted to add 1/2 a dozen donuts to my order.<br><br>Upon arrival (5 min walk from my hotel), I was able to go straight to the front, pick up/sign for my order, have my card charged.. and my sandwich remade (without me even asking) since it had been sitting there for over an hour... All in all took about 7 minutes. \"FD\" had no annoyances or issues with my requests and he multi-tasked like a pro.<br><br>Their donuts are rich, hearty, and surprisingly still good the next day. I'm a fan of the chocolate glazed old fashioned.<br><br>I DO LOVE their chicken sandwich though... so tasty for breakfast!", "pics": null}}]}