{"name": "do-rite-donuts-and-coffee-chicago-2", "reviews": [{"review": {"des": "I love sweets and have tried many donuts... from yeast to cake to old fashion - and let me just say these donuts made me wanna smack somebody's momma they were so good!<br><br>I'm literally writing this review right now after just finishing the carrot cake donut. OMG! That donut was the perfect amount of crispness on the outside and soft cake mixture on the inside. And the cream cheese! My god was that creamy, sweet, and good! So good I dipped my amazing apple fritter into the left-over cream cheese.<br><br>My boyfriend ordered a dozen donuts & I didn't get a chance to try them all....yet. But the two donuts I tried has me contemplating going back to get more before we leave Chicago tomorrow. <br><br>Also - this was probably my favorite carrot cake donut and apple fritter I've tried in my life. Go! Go! Go!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eF-J_nkGxBlrRFVprgwSeg/168s.jpg", "caption": "A Dozen Donuts"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yAScWb0C8x1rwOEZgIzjLg/168s.jpg", "caption": "Carrot Cake Donut"}]}}, {"review": {"des": "4 Stars<br><br>Duh...Rite!<br><br>Alright terrible intro but this place is really bomb.<br><br>Valrhorna Chocolate Cake<br>Buttermilk Old Fashioned<br><br>First time in CHI city so you know I had to try one of the local donut spots. Simple donuts but very good! Both were cake donuts but not overbearingly heavy. The outside was crispy and the inside was luscious. The chocolate frosting was rich in flavor and texture. The buttermilk had the right amount of sweetness. <br><br>Great place to get an energy charge when walking allover CHI and I'll definitely be sure to come back again to try out the other flavors.", "pics": null}}, {"review": {"des": "Out of the endless number of donut shops around the city, Do-Rite has got to be in the conversation when talking about the best places to get donuts. The variety of donuts that they offer sets them apart from many other donut shops and the quality and authenticity of each donut sticks out like a sore thumb. <br><br>Visually, these donuts are nothing to write home about, but if you're like the rest of us, you came here to eat the donuts and not to stare at them. I'll let you be the judge on just how great these taste but I can assure you that each donut is made with care and the freshness is always there. Thanks to everyone at Do-Rite, you guys rock!", "pics": null}}, {"review": {"des": "I so love the idea of this donut shop and their wide variety of flavors, including Gluten Free options! I really did enjoy my two donuts too, but unfortunately I think the idea of it all was better than the overall quality and taste of the donuts themselves.<br><br>I loved the donut sculpture and little red door at the entrance and how it led into a super tiny and totally adorable mini donut shop with full viewing of all donut flavors and options. Awesome set up! Customer service was on it, quick and kind answering questions, bagging and charging. I ordered the Gluten Free Valrhona Chocolate & Cinnamon Old Fashioned. Out of the 2 the old fashioned was less fried tasting and more enjoyable. The chocolate wasn't bad but it wasn't as indulgent as it look. If I could do it over again I'd try two different ones. <br><br>I took my order to go and actually ended up eating half one morning and half the next day morning. The second day was better than the first. It didn't taste as bad for me and the flavors were more present, if that makes sense. So ordering to-go and preserving for a day or so is how I'd recommend going about it. Not the best in Chicago but cute little shop and worth a try.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4bamOKhDljj-JN9f-JwlSg/168s.jpg", "caption": "Entrance"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OgpQmu8nC-SiH2Tu7PmDMQ/168s.jpg", "caption": "GF Gluten Free Valrhona Chocolate + Cinnamon Old Fashioned"}]}}, {"review": {"des": "Listen this place is winner! I absolutely love this spot! I had the Pork Tenderloin with a glazed donut and my goodness it was one of the best combinations I've had! It as perfectly fried and not too heavy either, the combination of the glazed donut  really made it tasty! I added some siracha to it and boom!! It was tasty! <br><br>I truly recommend this spot! I also had the old fashioned butter milk donut and man it was perfect!<br><br>This place lived up to expectations, i also tried the fried chicken with donut and it was just as tasty!", "pics": null}}, {"review": {"des": "Picked up a dozen assorted donuts for the office the other day (and an iced coffee for me). The donuts themselves are worthy of 5 stars, but the coffee was pretty awful. I also wasn't too impressed with the location - it's ridiculously small and awkward to maneuver when there's more than 2 people inside. On the plus side, I felt they still had a good selection left around 9 am, and was pleased with the flavors she chose for my box. <br>Once at the office, I ended up cutting a few donuts in half so I could try more flavors. My favorites ended up being the blueberry crumb and glazed old fashioned. The only one I would not get again is the cinnamon old fashioned. All around, my coworkers seemed to enjoy theirs as well!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QAE54UsnUuOh8DrFXiD0bA/348s.jpg", "caption": "Box of a dozen assorted donuts - favorites were the blueberry crumb and glazed old fashioned!"}]}}, {"review": {"des": "I walked a mile in the snow for a gluten free birthday cake doughnut and it was absolutely worth it. Gluten free doughnuts rarely have that rise that I associate with old school glazed yeast doughnuts, but somehow Do-Rite makes it happen with a variety of flavor options. My husband also appreciated the (gluten-y) Meyer lemon pistachio doughnut.", "pics": null}}, {"review": {"des": "The texture is just amazing on the old fashioned donuts. The outside is nice and crispy, and the inside is cakey and soft. Go for the chocolate one to get a nice amount of sweetness to complement the donut.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LOMZDAdGeZUXJodF8Cs1IA/168s.jpg", "caption": "Crispy and soft at the same time"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mnffh-LNSalWpKMbtvzZRw/168s.jpg", "caption": "Chocolate old fashioned"}]}}, {"review": {"des": "I can't stress enough the deliciousness that Do-Rite Donuts $ Coffee delivers!<br><br>The idea of Vegan options definitely prevents any excuse of NOT coming here.<br><br>They had a delicious and light red velvet coconut but,<br>You can NEVER go wrong with their old fashioned donuts!<br><br>Don't forget to stop by when you're in the city!<br>The views aren't half bad either.", "pics": null}}, {"review": {"des": "Dude what? This place is bananas. I can't think one one bad thing to say. <br><br>At first, I thought. Maybe I could give 4 Stars because it's a little shop. But no. That adds to its charm. Then I thought I could give 4 Stars because they don't have a massive, massive flavor selection. But no. I appreciate they specialize in fewer but make the best flipping donuts. <br><br>I stopped in on a Sunday before closing, only a few other people there. No wait. <br><br>Got the most popular donut, the Buttermilk Old fashion. Perfectly crispy outside and moist inside. And it was $2. Unreal. Love it. Couldn't even get a picture because I devoured it too fast.", "pics": null}}, {"review": {"des": "Pretty spectacular raised donuts that taste like a whole dessert than breakfast. Well made. Heavy though so not sure if I would have them unless a special occasion. Got the pistachio meyer lemon cream and blueberry crumb. Also gluten free chocolate. All great. My fave though was the pistachio.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CqMtxCQogbbAU8KjJ5sGxg/168s.jpg", "caption": "Blueberry crumb"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uyNdJCio1gCT8IsZc7aExg/168s.jpg", "caption": "Pistachio Meyer Lemon"}]}}, {"review": {"des": "I was really debating whether or not to have a donut during my trip in Chicago. I thought to myself, \"How great could a cake donut really be? They're all the same.\" But I kind of had a hankering for something sweet, so I caved. Boy was I wrong!! Their cinnamon old-fashioned cake donut was the best cake donut I've ever had!!! It was decadent, moist, with a medium crumb texture. The exterior of the donut was just a tiny bit crunchy, which I love, and the flavor was perfect! This will definitely be on my list of places to stop by if I ever visit Chicago again!", "pics": null}}, {"review": {"des": "Got a surprise delivery of 6 donuts from Do-Rite and that is the best way to wake up!! My favorites were the red velvet and the classic glaze.  Cant wait to visit the storefront soon!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gTA3ORzGycBD7mkeRhG38w/348s.jpg", "caption": "Do-Rite Donut delivery!"}]}}, {"review": {"des": "My college caters donuts through Chartwells from Do-Rite Donuts.  I tried the Maple Bacon Doughnut and Cinnamon Toast Crunch Old Fashion Cake Doughnut each costing $2.99.  It was a little pricey, but I was treating myself so it was worth it<br><br>My favorite of the two was the Maple Bacon Doughnut because it was light, airy and moist.  The maple was a bit sweet but the saltiness of the bacon cut through the sweetness and became a perfect pair.  The doughnut was also moist and not too airy.  I liked the chewy texture of each bite.<br><br>The old fashioned doughnut was filling.  It had the signature heavy texture with a nice coating of cinnamon on the outside.  I enjoyed it as well, but toward the end, it became a little dry.  I had to grab a glass of water.<br><br>Both doughnuts were a good afternoon snack that got me through the day.  I am interested in tasting fresher doughnuts from the actual bakery soon.", "pics": null}}, {"review": {"des": "Came here on an early Saturday morning with my friends and we expected it to be packed since this place seemed to be popular but it wasn't and we were glad. Its a cute little shop with seating on the outside. There wasn't much donuts to choose from but there were some vegan options! I ended up just getting a crumb and chocolate donut. The donuts were just alright for my friends and I. They tasted really cakey and bready if that makes sense but we've definitely had better. I probably didn't get the right donuts from here but maybe I'll give them another try if I visit Chicago again.", "pics": null}}, {"review": {"des": "Some of the best donuts I've ever had! The cake donuts are moist and super flavorful, the raised glazed and iced are light and fluffy and the old fashioneds are crispy on the outside just how I like them.<br><br>There are 3 locations in Chicago and you can't go wrong with either one. One of the locations closer in downtown does fried chicken sandwiches which I have yet to try but the donuts are amazing. I've tried many but my favorites are the Cinnamon Crunch Old Fashioned, Blueberry Crumb and Red Velvet Coconut.<br><br>The red velvet cake is super moist and melts in your mouth with a sweet coconut coating that hits home. The Cinnamon OF is crunchy on the outside and light in the middle with a crumb coating just like Cinnamon Toast Crunch. The blueberry crumb has real fresh blueberries in the batter and the crumb coating again... melts in your mouth. These donuts aren't overly sweet and the flavors are intense. Definitely make it a stop if you're a donut lover like me.", "pics": null}}, {"review": {"des": "If you ever find yourself in Chicago, make a stop to this donut shop located in the Loop. Their donuts are heavy and very sugary, as can be expected from a donut shop, but they're crafted with creativity and consideration for gluten-free donut seekers. <br><br>Covered in whole pistachios, the Meyer Lemon Pistachio Cake Donut is photo-worthy. The melts-in-your-mouth kind cakey batter is so filling that I had to finish it in two sittings. I wasn't hungry for 5 hours upon consuming it. <br><br>My favorite of their products, however, was not a donut. The Michigan Apple Fritter was large and, with chunks of apple inside that sweet cinnamon batter, extremely satisfying. It was like eating a healthier (because it is less doughy) and much tastier Cinnabon. The fritter, I ensured to finish in one sitting. <br><br>They run out of donuts in the afternoon, so make sure to stop by early in the morning. Their coffees are pricey and nothing spectacular; I recommend you go to the cafe next door for your morning caffeine fix.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rG0l_vX32xY_w3w1lJ9NEw/168s.jpg", "caption": "Michigan Apple Fritter"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zYrD_xVWzgOtwPD42ORU0w/168s.jpg", "caption": "Meyer lemon pistachio cake donut"}]}}, {"review": {"des": "BEST DONUTS IN CHICAGO<br><br>I've tried firecakes, glazed and infused, Stan's, donut vault, db3, Joe donuts.... none even come close to the quality and variety and sheer creativity<br><br>I love you so much", "pics": null}}, {"review": {"des": "Bottom Line:  Quaint donut shop with fresh baked goods and a friendly staff. <br><br>Donut pass up a place they had almost 1,000 reviews and 4.5 stars on Yelp because they are rare.  Do-Rite is located in the theater district and seems to be a popular spot for the local workforce for both donuts and coffee alike.  This donut shop has about 30 sq. ft. inside for its patrons so there isn't anywhere to sit or stand to enjoy your morning treat so plan to take it to go.  You can even place your order ahead of time. <br><br>I got a small coffee and a Birthday Cake donut.  The donut was weighty but not dense. All the colorful sprinkles were perfectly in tact and although I thought the donut would be sickly-sweet, it was not.  It paired nicely with the Dark Matter Coffee they brew.<br><br>The employees were friendly and the shop was clean and quaint.  It is located within a block or two of the nearest L station.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LyjoDfw4-7MRKc52YkKz5g/168s.jpg", "caption": "Birthday Cake Donut. They have a gluten free version too."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_3Gu2F0X0ZUutZtLPWJeQQ/168s.jpg", "caption": "Do-Rite on Randolph"}]}}, {"review": {"des": "My friend recommended the red velvet donut from here so I decided to check it out. I must say this is the best red velvet dessert I've ever had. I don't usually prefer cake-type or old-fashioned donuts but the red velvet cake donut here is definitely an exception! The red velvet is perfectly moist. The cream cheese frosting is mixed-in with the cake so the flavor is evenly distributed. I also tried the peanut butter and jelly donut which was really decadent as well! The staff at this location is extremely friendly.", "pics": null}}, {"review": {"des": "I love crumb cake donuts so this doesn't get any better than this.<br><br>Original Crumb Cake - Moist, not to sweet, crumbling goodness. Get 5!<br><br>Blueberry Crumb Cake - Same as the Original Crumb Cake but with little-hidden gems of blueberry jam.<br><br>Like crumb cakes? Go Here.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/a5sKtiZ9XU3gSLE4cDRzRA/348s.jpg", "caption": "Best Crumb Cake ever."}]}}, {"review": {"des": "This is a very tiny shop! Even if there is a line forming out the door, it moves quickly. Know what you want to order and have your payment ready so you can get in and out within minutes.<br><br>My favorite donut is one with bacon and peanut butter. So I was very excited to try Do-Rite's Candied Maple Bacon Donut and it did not disappoint. The donut was topped with a good amount of maple bacon, but the donut itself wasn't as fluffy as I hoped. <br><br>The donuts are on the heavy side, so it's a good idea to order a few different ones to share. I can't wait to try their other donuts when I visit Chicago again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eIUfRH_anfSaBmyJKzYdvQ/348s.jpg", "caption": "Candied Maple Bacon Donut"}]}}, {"review": {"des": "It's tiny. VERY tiny. As soon as you walk through the door, the entire customer area is maybe a 10x5 standing area and the counter. There were maybe 6 people in front of us in line and that was the entire capacity. We were waiting right outside the door to move in. But the service moved incredibly fast so the tiny interior was no major issue - just want to give fair warning for anyone expecting to be able to go in, stand around or sit inside. They do have some tables right outside though, so warmer days it would be perfect.<br><br>I had the peanut butter & jelly donut and the pistachio donut. My wife had the cream cheese and the red velvet donuts. And of course we split them all. They were all fantastic. I asked for almond milk with my coffee, but they only had soy which is perfectly fine - I'm not trying to sound pretentious. But I took what they had available and I enjoyed it nonetheless. <br><br>While I am not from Chicago, any time I am in town and want a quick donut, I'll unquestionably skip the countless Dunkin Donuts along the way and skip right to here.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/t4CakYFoLucpaJq10jAE-A/168s.jpg", "caption": "Peanut butter & jelly, and pistachio donuts."}]}}, {"review": {"des": "Old fashioneds are my favorite donuts and not many places make them. The buttermilk version was delicious. It was still a little warm, which isn't my preference, but it was still yummy. My husband got one coated in chocolate but they use a darker chocolate which he didn't like. Too bad they didn't have their cinnamon sugar version that day for us to try. The fritter was also good. The blueberry crumb was too thick and cakey for me. Coffee was good!", "pics": null}}, {"review": {"des": "Stop, do not pass by without getting a glazed old fashioned buttermilk donut (or two)! Seriously Do-Rite does donuts how they were always meant to be enjoyed... warm, doughy in the center & crispy on the outside, and glaze not overly sweet! Absolutely my favorite donut shop in the city bar-none:) a word of caution: these scrumptious treats could become habit forming if you let them! <br><br>Things to deal with: It's a very small counter in the loop, usually with a line in the mornings, and the dark matter coffee is a serious roast - a little biter for my liking. You do get a slight discount for the coffee + donut combo. <br><br>The only place to sit is outside if the weather is half decent and they do close daily as soon as they run out of doughnuts. I like that they are always made fresh (within the last hour or two) and kept warm. <br><br>There used to be really friendly staff who smiled at each customer, which truly helped me enjoy early mornings a bit more - recently however, the smiley staff has disappeared. Maybe they haven't had their coffee amped yet??! Sorry I had to dock a star for no-smiles! Otherwise a 5-star start to a workday IMO.", "pics": null}}, {"review": {"des": "My favorite donut spot in town! (and i've been to all of them, stan's, firecakes, donut vault, even longman and eagle's shop. Their old fashioned donut is literally the best (i'm a purist), and treat yourself with a fried chicken sandwich! Yays queen!", "pics": null}}, {"review": {"des": "We walked here after a dinner at girl and the goat. We were surprised that they served chicken here too. It smelled so good, it was a shame we just ate! The donuts we bought were the cheese Danish, Michigan apple fritter, Valrhona chocolate cake, pistachio lemon, chocolate glazed, vanilla bean, and cinnamon old fashioned. They were all great but my favourite was the pistachio lemon and Valrhona chocolate. They both melted in your mouth. <br><br>If you come here, make sure you leave room for their chicken!", "pics": null}}, {"review": {"des": "I came here over the weekend with my girls while we were staying at the renaissance as this is one of the closer locations to the hotel as we wanted to have donuts for breakfast, yep I'm definitely a cool mom. Well I had no idea that this is to go only as there was no where to sit which is kind of annoying especially if you're coming as a family. We ordered the chocolate old fashioned, the Valhrona cake donut, the apple donut and a sprinkle donut. <br><br>Honestly out of all 4 my favorite and the only one I liked was the Valhrona cake donut as it was moist and had the chocolate ganache on top which was very tasty. The double old fashioned was dry for me and a little on the crunchy side. My kids seemed to be okay with the sprinkle donut but wished there was more frosting on it. Maybe I'd give one of the other locations a different shot next time in the city but I guess we had a better overall experience at Stan's donut shop.", "pics": null}}, {"review": {"des": "What and wow! Amazing must go perfect donuts. Bacon and lemon one, but all good! They look as beautiful as the taste.", "pics": null}}, {"review": {"des": "Do-rite by yourself and have a donut...or two...or a dozen. They've got cake donuts, yeast donuts, yummy donuts, really yummy donuts. You get where I'm going with this... If you love donuts or just tolerate them, this place can turn the nay-sayers into believers. My favourite from here is the cheese danish donut, but all their flavours sound fantastic. I wish I had more days in Chicago just so I could try more of their donuts. It's so good, I'd wait in line for it again and again and again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2QImm-oSzvy5JcnTQCAuDA/168s.jpg", "caption": "Cheese danish donut. Sooo good"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6rjFetsc-rEBX9s-9EyesQ/168s.jpg", "caption": "Red velvet coconut cake donut, not my favourite but still very good"}]}}, {"review": {"des": "These donuts were fantastic.  It is a no-nonsense little shop right on Randolph, with room for about 5 customers in the store at a time.  The selection can be a little hard to scope out if you are not right at the counter, but you can still manage.<br><br>Service was good.  Staff were able to recommend donuts and explain what was special about them and why they liked them.  <br><br>The donuts themselves were some of the better donuts I've ever had.  By weight, they feel incredibly dense and heavy.  When you bite into them, however, they are nice and fluffy (in a cakey way, since these are not yeast donuts).  They fry them in a way that the donuts form a little crust which adds some fun texture into the mix like you'd expect from an old-fashioned donut.  <br><br>Selection of donuts was good.  I don't like a complicated donut, so I was pleased that there was only one donut with bacon or some other crazy (at least to me) ingredient on it, and even that donut was tastefully done.  <br><br>The coffee was also surprisingly tasty, also above average for donut shop coffee.", "pics": null}}, {"review": {"des": "We ordered the cinnamon raised donut and the chocolate donut. The cinnamon raised was fluffy, fresh, and had cinnamon sugar swirled within the donut - this one was our favorite and was recommended by the cashier. The chocolate donut was a little dense and the chocolate on top just tasted like Hershey's chocolate syrup instead of pure chocolate. We came at 11:30am and there were limited options but still lots of people in line and limited seating outside.", "pics": null}}, {"review": {"des": "My favorite donut shop by far!! Great donuts and amazing coffee. Jenny is always there treating you with a smile. Do-Rite is always on lists of best donuts shops and I can see why. I wish I lived closer to enjoy them on the weekends as well!!", "pics": null}}, {"review": {"des": "Probably the best donut shop we went to in Chicago. We came here on a weekday after the breakfast/work rush, so we weren't left with very many options. However, service was still great and we got to try some delicious old fashion and regular glazed!<br><br>Highly recommend their classics- I usually have a terrible aftertaste with vanilla glazed, but this was perfect and did not make me want to down a gallon of milk after. <br><br>**Best old fashioned ever**<br><br>Must try for sure!<br><br>FYI: cute outdoor bench seating, but this is more grab-n-go!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wIo2239ZpvuvAW7SUOjzJw/168s.jpg", "caption": "Vanilla bean glazed"}]}}, {"review": {"des": "Donut mission stop #4. This was the final destination on the donut mission and was excited because I heard a lot of people talking about this place. I got the cinnamon crunch raised donut and thought it was good. Almost like a cinnamon roll texture but with out the frosting. I also like the crunch you get. I really wish I could have tried the vegan donuts to see how it is, but overall, a solid donut. This place has a lot of stores located in Chicago and the place I went to was fairly small, but still bigger than some of the other donut places I been. They do have seating outside so thats nice for the summer.<br><br>This was ranked #2 on my donut mission", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DY9GtkDRPNQiX7GtQIF0vQ/348s.jpg", "caption": "Cinnamon crunch raised donut"}]}}, {"review": {"des": "Do-Rite, I do still really love your donuts! <br><br>The gluten free cinnamon sugar donuts here are one of my absolute favorite things. There's no weird gluten free after-taste, and they're the best celiac-friendly donuts I've found to date -- in Chicago or any other major U.S. city! And while the texture of these donuts is definitely more cake-like, they're still melt-in-your-mouth soft and fluffy like donuts should be.<br><br>My fiancé loves Do-Rite's regular donuts too! The chocolate old fashioned is his favorite, but all of the vanilla varieties are a hit. And when we're in the mood for donuts, there's no question of where to go. Do-Rite Donuts is the best there is!", "pics": null}}, {"review": {"des": "I don't really understand the high reviews, the doughnuts are ok/not-so-much (more to come) and the coffee is not great at all. Firstly, the coffee : my wife and I like ours black. Well, either the coffee is good or not - there's no masking bad coffee. Ours was at best just ok/borderline too old. <br><br>The actual doughnuts - maybe just ok...  actually I thought I cracked a tooth on mine.  So much so that I went back to our hotel to wash my mouth and check.  I guess there was a piece of a shell in mine still - a pistachio. Not great.  <br><br>This is a three star place, the two stars are basically for the worry I had that I cracked a tooth a day before my whole reason for being in Chicago, to give some lectures.", "pics": null}}, {"review": {"des": "On a recent visit to Chicago, my sister and I decided to try a few donut places in town during our walk. Do-Rite was one of our stops and we were glad we did. We decided to pick a few to try. Apple fritter was just okay, chocolate glazed was good but nothing special but when we got to the pistachio Meyer lemon donut... it was amazing! I wished I got more. Coffee + donut = a good way to start the morning!", "pics": null}}, {"review": {"des": "When we found this place on Yelp, I didn't even scroll through the reviews.  I thought to myself, \"Donuts?  Let's make it happen.\"  The storefront is basically just that, with no real room in it to window shop and eye the yummy selections but if you're on the go, definitely stop in.  They advertise the donuts as being very fresh, but ours weren't particularly fresh.  Definitely not stale though.  The feature specials of the day, and there was a maple bacon one as a daily offering that tempted me.<br><br>My companions weren't as happy with this place as I was, but at the end of the morning, everyone got a tasty donut.  I picked out a red velvet one with cream cheese icing on it and the donut was dense, cake-style one.  It was super sweet and AMAZING.  I had the sensation that I was eating a donut-shaped cupcake.<br><br>My friends picked the blueberry crumb cake donut, and also the apple cider one, both of them also in the cake style.  My friends complained that they weren't warm, but the flavors were excellent.  I would come back, just probably not on a weekend morning, as it was a little crowded.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0Cnecn8aUC2VuKiGNcPI-g/168s.jpg", "caption": "Very sweet and rich"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/s2r0a4ytkuHtRPihCfsVgw/168s.jpg", "caption": "Red velvet donut goodness"}]}}, {"review": {"des": "Fresh fluffy donuts. We came at 10:30a and the vanilla glazed raise was still warm! Crispy bite yet soft and airy inside. Incredible! The cinnamon crumb raised was by far the best. It's a cinnamon roll without the heaviness. You won't feel regret or guilt because it's so light! The old fashion was good and the chocolate is rich. They don't mess around. <br><br>Shop is small and no seating. Grab and go and be happy!", "pics": null}}, {"review": {"des": "Price: $2-3/donut.. a huge donut<br><br>Food:<br>I typically enjoy chocolate donuts, but their original and apple cinnamon were better than the chocolate! <br>Very crunchy on the outside but not as soft as I hoped for on the inside.<br><br>Service: Quick and friendly. <br><br>I'll try firecakes next time.", "pics": null}}, {"review": {"des": "Perhaps I went on a bad day but I personally didn't experience the hype of these donuts during my most recent trip to Chicago. As all other Yelpers have stated this store is really small and can be easily missed if you're not paying attention. My friend and I stopped by one early morning to grab a quick breakfast. I opted for the chocolate cake doughnut and Michigan apple fritter. <br><br>You can enjoy your sweets in front of Do-Rite as there are a couple of small tables available for it's patron. Although I will warn you that there are also a bunch of birds flying around in hopes of getting a small piece of your doughnut. Those birds fly really close to you so don't be alarmed. Out of the two selections I opted for, I personally preferred the chocolate cake doughnut. The doughnut wasn't very moist but it wasn't dry either; the chocolate itself was decadent and perhaps a bit more on the heavier side for my liking. The apple fritter was dry and nauseatingly sweet. As I ate these items for breakfast, I was only able to get a couple of bites into the apple fritter and threw the rest away. <br><br>Overall, these donuts were just average to me as I have had better doughnuts back at home in the DC area. With that being said, it's not a bad option if you're just looking to grab a quick bite for breakfast. On the plus side, the staff are able to get you in and out of the tight quarters quickly.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4AELMdsAoqsHZqlQuWQUQA/168s.jpg", "caption": "Chocolate cake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/V2H0pU85qR_CfKZaRwX5rQ/168s.jpg", "caption": "Michigan Apple Fritter"}]}}, {"review": {"des": "Glazed: the original, the marker for me to judge how good the other donuts would taste because this donut is basic. Usually, if the glazed donuts at a shop taste right, the other ones follow suit. This one was great! Yeasty, so it was nice and airy with perfect icing. <br><br>Carrot Cake Donut: one of my favorites. Perfect frosting to donut ratio. I was intrigued that the center is plugged with a carrot cake donut hole to hold the icing. Tastes just like a carrot cake, the flavors and spices were in perfect harmony. A dense cake donut!<br><br>Boston Creme: not a big fan of them, but this one was quite good! I wish the filling was more evenly distributed. <br><br>Red Velvet Donut: I had high expectations, but it just didn't taste like red velvet to me. I tasted a lot of coconut? Maybe my tastebuds were fooling me because of all the sweetness of every donut (that's right, I have no self control) <br><br>Apple Cider Donut: had a good spice flavor, but only had a hint of apple tones. The cinnamon sugar coating was a little too much in my opinion. Crumbly! <br><br>Cheese Danish Donut: it just tasted like a glazed donut with cream cheese frosting to me...<br><br>I apologize for the eaten donuts... I couldn't stop myself on the way home.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AtxGKDwu_5wDr8NscwBdNA/168s.jpg", "caption": "Carrot cake, Boston creme, red velvet, glazed, apple cider, cheese danish"}]}}, {"review": {"des": "Had a taste for a doughnut one day and my coworker told me about this place. Since it was a nice day we took a walk to this place. They had my old fashioned glazed doughnut which I was seeking. However, they also had a red velvet coconut doughnut which I was compelled to try. Both were AMAZING! They were rich and flavorful. I couldn't eat a whole one in one sitting. I ate them over the course of a few days but I loved every minute of it. I'm so glad this place is a nice walk from my job because I'd be there at least once a week :)", "pics": null}}, {"review": {"des": "PLEASE make more vegan donuts so that there are still some left by 12-1pm on weekdays! I've managed to get lucky a few times, but I'd so visit more often if there was more availability.<br><br>I haven't really tried their regular donuts, but I enjoy some of the vegan options, and for those that are looking for a slightly less sweet donut, the gluten free ones aren't that sweet (but they are a bit dry).", "pics": null}}, {"review": {"des": "In Chicago for business...every morning when I pass by this place there is a line out the door.  Today decided to give this place a try.  Being from NY and having tried a variety of gourmet donuts , my expectations weren't high.<br><br>When I walked in the first thing that hit me was the price...$3 dollars per donut....serious sticker shock..<br><br>I asked for a recommendation and bought two donuts .  When I got back to the room and tried them...I got a different shock.  These donuts  are amazing..<br><br>They do fill you up, although they don't feel heavy.  After the two donuts and a coffee you feel like you just ate a full meal.", "pics": null}}, {"review": {"des": "When we come to Chicago, we eat. So when we searched Yelp for donuts, we didn't want to Do-Wrong, so instead we went to Do-Rite (see what I did there?)! <br><br>So it's a small store, but I knew from the line that this place must be good. I immediately see the food porn that would soon be my reality. The smell, oh, that smell - chocolate, vanilla and cinnamon - fill your nose. <br><br>I was torn, so many options. The displays were filled with fresh donuts. We opted for the cheese danish, birthday cake, carrot, red devil and cinnamon. We couldn't wait to try our goodies, and luckily they have seating outside.<br><br>Birthday cake? It's not even my birthday but this bad boy tasted just like the Barbie birthday cake that I never got for my party (it's okay Mom, I forgive you). I also sampled the chocolate old fashioned. Wasn't my favorite, as the chocolate was too dark. The cinnamon yeast donut covered me in cinnamon and sugar (literally, it was like a cinnamon fairy sprinkled goodness all over me). <br><br>I can't wait to try the others, but I'm currently recovering from a sugar coma. I will be back to try others, and I hope you give this place a shot. You won't do-wrong!", "pics": null}}, {"review": {"des": "You get the best options when you preorder and have it delivered, from my experience. Every time I've gone to the shop, there are always limited options (early bird gets the worm def applies!).<br><br>Ones that I've tried and liked: <br><br>Pistachio-sweet white cream topped with pieces of pistachio for a nice balance of sweet and salty (although slightly more sweet than salty). <br><br>Cinnamon roll- sweet cream cheese like filling with a glazed outer coating. Probably one of my favs here!<br><br>Chocolate- perfectly sweet and a classic! You can NEVER go wrong with a chocolate coated donut (dough was not chocolate). Another fav!<br><br>Powdered one- cakey covered with a sweet coconut like powdered sugar.<br><br>I honestly don't think you can go wrong with anything here!", "pics": null}}, {"review": {"des": "I've had donuts from here a few times... and they're ok.... but the problem is that I think they are pretty full of themselves.<br><br>They are EXPENSIVE as hell and they only have like 4 or 5 donuts that you can select from..... and they are all WAYYYY over glazed and frosted.<br><br>I'll go if I'm walking by and I have a craving for a donut, but I'm not going out of my way.", "pics": null}}, {"review": {"des": "I rarely have been here, but try to come back here when I have free time. The Donuts are always good tastes. The staffs were nice. Last week, I came here around they almost close, so most of donuts ran out. Ok, I really want it, I tried to ordered different kind for 6, then they said \"on the house\". Good staffs, nice service, and great donuts in downtown.", "pics": null}}, {"review": {"des": "On my last morning in Chicago, I walked the 20 minutes from my hotel to grab some doughnuts before I left. It's a bit of a trek from the Hyatt, but it's definitely worth it. I brought them with me to Detroit to visit my BF and they were still delicious the next day. <br><br>I had the Chocolate Old Fashioned and the Lemon Old Fashioned. Both were really good, but I have to say I liked the chocolate more. It was moist, cakey, and just the right amount of sweet. <br><br>This location is legit just a tiny kiosk, so it can't really fit more than 5-7 people inside the shop at a time. Be prepared to wait outside if you come early in the morning.", "pics": null}}, {"review": {"des": "Donuts are good. Service is pretty meh. They close when they run out, so I don't get to this one often. It's conveniently located near all of the government offices and such, so it's always busy. Go for the apple fritter, the seasonal flavors, and the daily special variety. I like their  willingness to get creative with the flavors and the quality that is evident in each bite. Do-Rite does it right!", "pics": null}}, {"review": {"des": "First let me say, I love Do-Rite Donuts. They're delicious and I've never had a problem -- until now. <br>This morning at 9:37 I online ordered one dozen assorted and one dozen gluten-free donuts from the Randolph location. I ordered fairly early in order to increase my chances of getting some gluten-free donuts. <br>Alas, when I called at 11:10 to see if I could delay my pickup of the donuts the staff member had no record of my order. After checking several names and other Do-Rite locations he discovered my order saying it had just come in.... After describing when and how I placed my order that chapter of the story was cleared up. But they were out of the gluten-free donuts. He kindly offered to refund that portion of my order (how nice!).  <br>It's not that they were out of the donuts I wanted, I understand Do-Rite is very popular. It's that their online ordering provider,(ChowNow) is faulty or the staff, unfortunately, was having a rough morning.", "pics": null}}, {"review": {"des": "Oh, BABY! How have I not reviewed this place yet? I have been here close to a dozen times over the past year or two. Somehow I missed the review. Here ya go:<br><br>-Donuts. My favorite in Chicago. I used to be all Stan's Donuts, but Do-Rite has the slight edge. The blueberry cake donut is knock-your-socks-off good as is the standard chocolate glazed. <br><br>-Coffee. Dark Matter is my favorite roaster in the city. They serve DM and they don't f*** it up when brewing. Hot, black coffee or iced coffee is perfect here. <br><br>-Spicy chicken sandwich. Perfection on a bun. I hadn't tried this until last weekend, and I got it again today (prompting the review). Honestly, could become a very unhealthy addiction...<br><br>This is one of those places that if you're thinking of going, just go. Now.", "pics": null}}, {"review": {"des": "A tiny store front (maybe 100 sq ft) sandwiched between a steakhouse and a bakery serving hand-crafted gourmet donuts.<br><br>We almost missed this place it is so small even though we were standing right in front of it-your bedroom at your hotel is probably bigger than this little gem.<br><br>Hint:  look for the big brown donut statue (4feet tall) on the sidewalk.<br><br>Donuts here are pretty rich with one almost certain to satisfy the average customer (I got two and felt full for hours).  They are not cheap -$2.95 each or $14.95 for 6-and are packaged in a sturdy box.  There were a number of delightful flavors from classics like Boston creme, glazed and old fashioned cake to maple/bacon, blueberry crumble (my fav.) and cinnamon sugar.<br><br>They also sell coffe, milk and juice cartons).  Our 6 donuts, 1 coffee, 2 milk and 1 juice was $27 but as my wife pointed out if you went to a bagel shop and got 4 bagels with cream cheese it would be about the same-you just have to remember this ain't dunkin D.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CCZbqprvah3REjwz_y6raA/348s.jpg", "caption": "Lots of choices"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ASXF84m-4Pgwq8WzbGtQRA/168s.jpg", "caption": "6 donuts-$15"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/B8Opiv4ZV0L0-yLsyR4alw/168s.jpg", "caption": "A tiny little shop"}]}}, {"review": {"des": "Holy woah. It's a minuscule shop next to the courthouse but damn if these aren't some of the best so it's I've ever had. The shop, it's coffee, and donuts are the perfect distance between classic no-frills donut shop run by a 70 year old couple and an ultra-modern deconstructed bacon glaze parsnip turnover thing you have a hard time relating to a donut anymore. The yeast donuts were sizable, adequately topped, and despite being 11am, still warm and soft.", "pics": null}}, {"review": {"des": "I don't really get the donut craze but I sure love when the opportunity to eat the oddly shaped, gluten-free cinnamon sugar donuts from Do-Rite arises! Such a treat to have one with a cup of hot chocolate. Mmm<br><br>My family, the gluten eaters, have their favorites too...the old fashioned buttermilk and the maple bacon.<br><br>If you're going to be there late call and order in advance or place an online order.", "pics": null}}, {"review": {"des": "I'm so sad that I only bought one! I got the buttermilk old-fashioned, and holy hell! This is a fantastic doughnut. It's moist and cakey, perfectly crisp around the edges, and the glaze is just right. Wow. Just wow.", "pics": null}}, {"review": {"des": "Stopped by on my way to work. Picked up a buttermilk old fashioned and a cheese danish. Both were great, my favorite was the cheese danish. The cheese filling was generous but what made the donut was the yeast donut vessel it sat upon. On my next visit I think I'm going with the vanilla bean glazed so that I may enjoy the yeast donut by itself.<br>The buttermilk old fashioned was also great. It had a nice crumb, a moist inside, and the sweetness was just right. I did taste a slight film of grease/lard on my mouth after a few bites but I think that's normal.", "pics": null}}, {"review": {"des": "I've been here so many times, too busy chowing down to leave a review. I'll keep this short and sweet, if you like donuts-go here. And get there early, because once they're out of a certain kind-try again tomorrow!<br><br>I love the Vanilla Bean Glaze.", "pics": null}}, {"review": {"des": "Hands down, the best apple fritter I've ever tried. We tried a few donuts and the only other donut that I thought was really good was the PB&J donut. The other donuts were good, but nothing special. I'm assuming this place is usually crazy packed especially because its such a small shop but my party ended up coming in on a Monday morning and we were almost the only ones there. Get the apple fritter, you won't regret it.", "pics": null}}, {"review": {"des": "Some of the best donuts in Chicago. Got a half dozen for my dad for his birthday celebrations. He loved trying all the different flavors. They also have a few gluten-less options based on the day. I have tried the gluten-less birthday cake and cinnamon donut and they are great. They keep the gluten-less donuts separate from the others!", "pics": null}}, {"review": {"des": "Don't believe the hype....<br>Expensive, heavy, clunky donuts.<br>Tourist trap", "pics": null}}, {"review": {"des": "Oh my gosh! I came here on our vacation from Dallas Texas. I am willing to drive all the way back to Chicago just to have one of these donuts again! Try them all! Especially when they're fresh, the warm cake donuts are by far the best!<br><br>I don't know what it is about these donuts that makes them so scrumptious, but I can eat and eat and eat until my stomach hurts. I want another one just sitting here writing this review. My favorite is the cinnamon it is literally covered in cinnamon. If you want to try a basic one first go with the old-fashioned but then you'll just want to try the others that I have as well.<br><br>Pay close attention to the hours of operation and the address of the location because there are several in downtown Chicago but their hours vary. I frustrated myself by going to the wrong location looking at Yelp but paying attention to the address, you have been warned!", "pics": null}}, {"review": {"des": "Do right by yourself and get a do-rite donut, okay, so I'm not a marketing genius but these donuts are legit.<br><br>Last year a friend picked me up a delicious donut and I knew I had to have another (few) before I left chicago.<br><br>It's kind of a small spot so pay attention when you walk by it. The donut sign will catch your eye but the inside is super tiny. I felt like I took up the entire space inside. It's pretty much a counter and that's it, but that's all it really needs.<br><br>The bakery has about a dozen options including a gluten free option or two- to be honest I don't know how many because gluten free is not my jam, but if it's yours have at it!<br><br>I ordered an old-fashioned with chocolate and a blueberry crumb. The blueberry was out of this world good. I don't remember much about it because it was gone in 60 seconds (or less).<br><br>The old fashioned was great too- don't get me wrong, but I wasn't too keen on the chocolate. It was a little too sweet for me. I still inhaled it, but just a little slower than the other donut.<br><br>Two donuts and a milk ran me about $14 so it's not the cheapest meal you'll have, but ya definitely worth it. Kind of an institution in Chicago foodie spots if you ask me.<br><br>Next visit I'll try another donut or two, but there definitely will be a next visit.", "pics": null}}, {"review": {"des": "Ok......A little out of my way for a donut don't you think?<br> <br>Still basking in the afterglow, after having a serious personal conversation with a Michigan Apple Fritter and a Vanilla Glazed. Also included was an excellent Dark Matter Coffee.<br><br>Wow.wow.wow. There is an Epiphany going here. The reviews here are truly accurate! Thank you for guiding me into to the light.<br><br>Just think: I just got 'done' by Do-Rite....and in a good way too!", "pics": null}}, {"review": {"des": "These donuts are top notch, high quality, and flat out delicious.  I got the cheese danish doughnut and enjoyed every bit of it.  Treat yourself!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PH-pV-a9Cofc-XyONoNvrw/348s.jpg", "caption": "Cheese danish donut"}]}}, {"review": {"des": "This west loop location is great- doesn't sell out by noon, nice variety of flavours, relatively uncrowded.<br><br>I have a specific weakness for their pistachio-lemon donut and my husband can not resist the maple candied bacon donut. They're dense and almost cakey to the bite, but almost melt smoothly once in your mouth. <br><br>I don't know why it's so good, I just know that whenever I'm in the area I'm almost gravitationally attracted to getting a half dozen!", "pics": null}}, {"review": {"des": "Hands down best gluten free donut I have ever had. I travel often and this place is the best!  Also had the regular classic chocolate. This will be my go to place when visiting Chicago!!", "pics": null}}, {"review": {"des": "We went on a Friday morning. They had about four choices. They were good donuts. My wife's donut was a bit greasy. This location was very tiny and now that I see the map I'm kicking myself for not going to a closer location that served chick as well. Best donuts I've ever had? No. They were a bit heavy for that but they were good. Service was good. Tiny. Packed. Hectic.", "pics": null}}, {"review": {"des": "Such a fun place with yummy donuts! Great vibe too. Tends to be full especially in evenings and a great place to hang out with friends. Since it took a bit longer to fill my order they gave me a free coffee. Didn't have to do that but the gesture meant a lot.", "pics": null}}, {"review": {"des": "Stopped by to start off our Chicago adventure and it was amazing! Valrhona Chocolate Cake and the Pistachio-Meyer Lemon were excellent. The Valrhona was suuuper decadent and rich, highly recommend having milk on stand-by with this one. The Pistachio was a great counter balance to the chocolate as this one was light and fruity.<br><br>Would definitely come back here again! I want to try one of their breakfast sandwiches next!", "pics": null}}, {"review": {"des": "Yea, it's really good.  Go, you'll thank me.<br><br>Donuts are big, beautiful and flavorful.   I had 1 donut, and was literally jealous of the mother and teenage daughter next to me who got a whole dozen.<br><br>The chicken sandwich was simply delicious.<br><br>Definitely worth a visit if you're in the area.", "pics": null}}, {"review": {"des": "If you notice by my pictures and reviews, I rarely ever go to any donut shops! While in Chicago, my girlfriends and I decided to stop by for a quick snack before we went to breakfast.  Luckily the line wasn't long at all!  I did a quick scan and although there were some interesting flavors, I saw that this spot is known for their old fashioned's and seeing that they were almost out on the tray, I decided to order just that.  It must be that good for them to be almost out in comparison to the other donuts!  And it was!  Slight crunch on the outside but soft semi moist on the inside.  It wasn't too sweet or too rich but just perfect.  As plain as it sounds, it was really good and I would definitely recommend!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cWkelu6NiI6A1RaaZ8T75A/168s.jpg", "caption": "Lemon pistachio"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fdGcF-QNLAmbREUuzg-txQ/168s.jpg", "caption": "Old fashioned"}]}}, {"review": {"des": "These are by far THE BEST donuts in chicago. I have gone here at least 10 times and every time they are fresh and delicious, no exceptions. My husband likes the plain glazed, so good. Personally my favorites are the old fashioned's, whether the cinnamon, chocolate, plain, normally i get a box so we can sample a bunch, totally worth it!!", "pics": null}}, {"review": {"des": "Now I get the adages about hard to find. You must be looking for it, beside Corner Bakery - or you'll miss it.<br><br>Coffee very good. Selection, not bad, considering it was after 1:00 on a Wednesday. BTW - if you have a roller bag with a zip open front, their sturdy boxes are perfect as an airline donut carrier - winning !<br><br>Sampled from the cinnamon sugar, blueberry crumb, sour cream old fashioned*; wonderful, flaky and tremendously moist.  Ate a half at the airport; a bite that night; and shared the remaining 3 donuts with my brood the next morning.  Even at 24 hours past baking, these donuts shined.  Strongly recommended.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Y5LUMcXJ2XhPeaMPyGYW6w/348s.jpg", "caption": "Yeah, about hard to see"}]}}, {"review": {"des": "Are the donuts pretty and Instagram-worthy? Yes. <br><br>Are they the best donuts I've ever tasted? No. <br><br>I was super excited to check this place out on my recent trip to Chicago due to all of the positive Yelp reviews. We tried the carrot cake and the maple bacon donuts, and to be honest, we were pretty disappointed. <br><br>The carrot cake donut tasted similar to a Dunkin' Donuts donut (which hey, I'm not knocking, but for the more premium price tag at Do-Rite, I expect a little bit more). And in comparison to the version at Doughnut Plant in New York, this just didn't hit the mark. <br><br>The maple bacon donut was the more enjoyable of the two, but still not the best donut of my life (blueberry donut from m&m donuts in Anaheim, I'm looking at you ;)). <br><br>To be fair, we did only try two flavors out of the whole menu, so this isn't to say there aren't amazing donuts being sold here. That just wasn't the experience I had, unfortunately.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/n6OD25_TGZ3UZrh9yLXbrw/168s.jpg", "caption": "Instagram-worthy shot of the carrot cake donut"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CeKQoIvd72iG-YFOSCG-lw/168s.jpg", "caption": "Instagram-worthy shot of the maple bacon donut"}]}}, {"review": {"des": "I stopped in here around 8:30am on a Thursday.  The line was nearly out the door, but was steadily moving.<br><br>There's not much standing room inside this location, but no one dines in for doughnuts!<br><br>I asked for an assorted dozen (employee's pick) and was in and out within a couple minutes.  The employee at the register was very nice and polite.<br><br>As for the doughnuts... outstanding!  These are the best doughnuts I have ever had in my life and are well worth the price of nearly $30 for a dozen doughnuts.<br><br>You can see and taste the quality.  My favorite is the bacon and maple doughnut, but there wasn't a single one that I didn't enjoy.  Check out my picture to see which ones I got and how great these look!<br><br>I will definitely come again and these are a fan favorite at the office when people bring them in!<br><br>This place also gets a +1 for having super sturdy boxes!  Boo to flimsy doughnut boxes.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZZcW8JHocWNThlf2F-0MlQ/168s.jpg", "caption": "Box"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/E6uMO32hpmRt8SwIaw9seQ/168s.jpg", "caption": "Assorted dozen"}]}}, {"review": {"des": "Gluten-free donuts? Well color me intrigued.<br><br>One afternoon, I happened to be in the vicinity of the Erie location so I popped in. There weren't any gluten-free donuts remaining this late in the day and the staff recommended I either call to place an order the day before, or use their online tool. Done and done! Knowing that I'd be close to the Loop on an upcoming Saturday, I placed my online order for a half-dozen gf donuts. I'm not really a fan of chocolate, so I used the comment box to specify that I preferred \"gf birthday cake, cinnamon sugar, p. lemon.\" And what's \"p. lemon\"? Pistachio lemon... after combing through Yelp reviews, I read several accounts detailing a very delicious gluten-free lemon pistachio donut. Um yes, please!<br><br>I arrived and my donuts were waiting for me, beautifully packaged in a sturdy box. Of course, I couldn't wait to make it home and enjoyed one outside before moving on. My first pick? The frosted birthday cake donut covered in colorful sprinkles. It was quite good - better than I imagined a gluten-free donut could taste - just a little more dense than a regular donut. Still, it squashed my craving and I'll definitely be back again. They make excellent photo opps as you can see by my corresponding photo!<br><br>Just a note: if you're gluten free, be careful if you make requests via comment on the online form. Even though I chose the half-dozen gluten free box from the dropdown, I think the staff must have been confused by my comment \"gf birthday cake, cinnamon sugar, p. lemon\". The comment box doesn't allow for a lot of characters and I thought it would be understood that all of my donuts be gluten-free. However, the lemon pistachio were definitely NOT gluten-free. So that's two donuts of my six that went into the waste bin.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/n5HrWTNklqH7QzswJ-1sbg/348s.jpg", "caption": "Gluten-free and covered in sprinkles. So dreamy!"}]}}, {"review": {"des": "I come here every time I'm in Chicago.<br>Hands down best doughnuts I've ever had.<br><br>I brought 6 in a box on the flight home and everyone wanted to be friends with us. I got the carrot cake, blueberry. apple cider, old fashion, and chocolate. Surprisingly, chocolate was my least favorite but the 4 more than made up for it. <br><br>Highly recommend!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GKEeAMLGQ1w-mHLUl6eXFg/348s.jpg", "caption": "Carrot cake,  chocolate, old fashion, blueberry, Apple cider donuts."}]}}, {"review": {"des": "I popped into Do-Rite donuts for a pick-me-up on a cold January afternoon.  Most of the morning crowds were gone, so I was able to walk right up to the counter and order.  <br><br>At first, I was disappointed that most of the flavors had been picked over, and the only options left were blueberry crumble and chocolate glazed donuts.  I also a small coffee.  There was no seating to speak of, but I was able to hover over a small table in the vestibule.<br><br>All my concerns vanished when I took a bite of the softest, loveliest donuts I've ever had.  The chocolate glazed donuts was a pillow of delicious dough and decadent chocolate.  The blueberry crumble was just as fabulous, like a gourmet pastry with tons of blueberry flavor.<br><br>It was all so wonderful that a total stranger started taking pictures of my food.  It's awkward enough when I take pictures of my *own* food, but this was something else entirely.  Clearly, Do-Rite knows how to deliver for its food-porn-obsessed fan-base!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eAAlsyxh04cJt01JJwcSnA/348s.jpg", "caption": "coffee + coffee and blueberry crumble donuts"}]}}, {"review": {"des": "Very fresh donuts. Do-rite is what I imagined would happen when you marry a traditional donut shop with a classically trained pastry chef. The flavors are expected, you are offered some of the flavors you grew up with but the taste and flavors are much more elevated and professionally done. <br><br>I stopped by this location know they don't make the donuts on-site, but it was only a 5 minute walk from the condo I was staying at and I had a plane to catch. I ordered the apple fritter, blueberry crumble, the old fashion, and the pistachio lemon. And a cup of coffee with cream and sugar. <br><br>The coffee and donuts were all reasonably priced and I wished I had stopped by every morning during my over week stay in Chicago so I could have tasted every single flavor. <br><br>The apple fritter was my hubby's favorite so I only got a small taste before he devoured it. The blueberry crumble was my favorite of the 4. It was super moist while still maintaining its donut-ness, with chunks of blueberry that tasted super balanced with the crumble. I have never eaten a blueberry donut that delicious nor a baked good. The old fashion and pistachio were also tasty but did not taste as fresh. However all was forgiven because of the blueberry crumble. <br><br>As for the coffee it was reasonably priced and it tasted very similar to Dunkin Donuts. Which I love. Overall do-rite definitely does it right.", "pics": null}}, {"review": {"des": "Technically 4.5 stars but rounded up bc the second donut I tried was so much better than the first. <br>Maple bacon - super sweet and the bacon should be a bit crisper so it's easier to chew through the very generous pieces all over this colossal donut. <br>Vahlrona chocolate -  wayyyyy better than I expected and I would eat a whole box of these. The chocolate is perfect - generous and not too sweet. The donut is perfect - a non greasy super light cake donut - hard to do well! <br>Mmmmm. Thank goodness I don't live here or I would OD on these sweet treats!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CS9-l29nu22kgVqq6fQR_g/168s.jpg", "caption": "Maple bacon donut with tons of bacon!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pG1VaxXPLPKumuzaaSwQxg/168s.jpg", "caption": "Delicious vahlrona chocolate cake donut. So fresh the chocolate was dripping off it all over my fingers - yum!"}]}}, {"review": {"des": "This was the absolute spot in Chicago. I stopped here four of my five days in Chicago! Try the sandwiches, the donuts, or the coffee. You can't go wrong here!", "pics": null}}, {"review": {"des": "These donuts are crazy. My fave is the cinnamon raised, and I also recommend the cinnamon old-fashioned, plain old-fashioned, and red velvet varieties. I walk past Do-Rite every morning on my commute and now have a Pavlovian reaction just to the name \"Do-Rite.\" These are seriously so good. The old-fashioned have a wonderful crumbly texture and almost crunchy outside, while the raised just melt in your mouth (without being gooey). It's like, wow, donuts are awesome.", "pics": null}}, {"review": {"des": "Fabulousness!<br>I walked in a stopped to think for a second...it felt a bit familiar. Then I realized it was like the Soup Nazi on Seinfeld.   Quite the opposite however, staff was quick, friendly, outgoing/helpful and knowledgeable.", "pics": null}}, {"review": {"des": "First time here! I tried the Vanilla bean glazed donut. Pretty good. Costs about $2.50. Small shop and usually a line in the mornings but today there was no line. I will go back to try the other flavors!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_0xtiHYcFZibwkPz3RsXmQ/348s.jpg", "caption": "Vanilla bean glazed"}]}}, {"review": {"des": "Tucked into the store fronts, Do-Rite does two things well.  Donuts and service.  <br><br>While possibly overlooked by sensory-overloaded tourists (ok I walked by it a few times, but apparently missed the large donut outside signaling a donut shop), this place shouldn't be missed. <br><br>After reading the reviews about their gluten-free donuts going quickly, I called the shop before heading out to ensure it wasn't a fruitless trip. The very polite staff told me their varieties of GF goodies for the day, and when I said I wanted one of each, she offered to set some aside for me. <br><br>A small interior, this place is packed with freshly-made, small-batch pucks of doughy love. Their wares on the shelves saddened me that I couldn't have any of those.  (Note: the GF donuts are kept in a separate case on the front side)<br><br>I need not be sad. Their gluten-free donuts were absolutely amazing. I partook in the birthday cake, a cake donut with chocolate icing covering, and a cinnamon/sugar. I ate the first two with such fervor, I'm not entirely sure I wasn't possessed by something.  I chased down my doughy redemption with a delicious cup of Dark Matter coffee.<br><br>Do yourself a favor, Glutenites, Do-Rite.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BxmbAomwvaD1djb0T72MGw/348s.jpg", "caption": "Mmmmmm"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Bro27htca00lIypZxB2L0w/168s.jpg", "caption": "Chocolate glazed and coffee"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZGe1tRK1EMBhUfIMsRJlWw/168s.jpg", "caption": "Coffee and a companion"}]}}, {"review": {"des": "Love the donuts and coffee.   Been to their other locations but this one is the best.   They have wonderful staff especially Jenny.   Best donuts in Chicago!", "pics": null}}, {"review": {"des": "I feel like these donuts could help the UN's peacekeeping efforts. Just sayin'...<br><br>I've had a co-worker bring these donuts in to our office on a few different occasions and people go ape for them...myself included. I picked up some for another group of people who had never heard of Do-Rite and things went really well. The maple bacon donut is life-changing according to my meat-eating friends. The apple fritter donut is my favorite. None are disappointing. Not a crumb is ever leftover. <br><br>As for the service at this location, it's counter service as far as I can see. Conversation is kept really brief which is actually preferred as that allows me to get the donuts in my face faster. <br><br>Come hungry. Leave happy.", "pics": null}}, {"review": {"des": "Some of my favorite donuts in the city right up right alongside Beavers donuts! I love The old fashioneds, candied maple bacon, and Michigan apple fritters. They also serve dark matter coffee, which is another one of my favorites! The donuts are a tad expensive, but these are gourmet donuts and one donut will fill you up!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XytVdVVxJNJvuu5P2d67nA/168s.jpg", "caption": "Glazed, Chocolate Old Fashioneds, Chocolate Peppermint, Maple Old Fashioneds, Cinnamon Old Fashioneds, and Chocolate Glazed donuts."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/le4jJIXrjG3DQ3A4rrecMA/168s.jpg", "caption": "Maple Candied Bacon Donut!"}]}}, {"review": {"des": "Premium fancy city donuts. They have unique flavors and variety, the store is small and only to-go no seating. The service was pleasant and efficient. <br>We ordered one donut something with cinnamon toast crunch ground up in it. It was awesome and tasted like a cinnamon roll. It was definitely something to share.<br>The price was premium as you could have bought 3 chain donuts for close to the price. You pay for the quality and unique options.<br><br>Definitely check out if you're in the area.", "pics": null}}, {"review": {"des": "Both the donuts and the coffee were delicious! We were very happy to find this place on Yelp when visiting the area.", "pics": null}}, {"review": {"des": "Ordered a few choco-covered donuts, a blueberry muffin donut, and some original glazed - altogether 6. Honestly, they didn't exactly satisfy my donut craving like I thought, and thought the glazed donuts were a bit on the dry side? Weren't as moist on the inside or I'm not sure if that's how they normally come after they're fried since the blueberry muffin donut seemed to be the only redeemable factor when reviewing these treats. I wasn't too impressed by the quality of the donuts but I will say they were pretty decent in size for the price so I will give them that. I probably wouldn't go as far as to recommend this spot in the future as I feel like there's probably better.", "pics": null}}, {"review": {"des": "I didn't think I would find a doughnut shop that would be up to par or surpass Quinn's Coffee Shop's standards, but I've found one at last! I think it's better than The Doughnut Vault and Beavers Donuts.<br><br>There was a line when I arrived Saturday around 11:15am, but the line moved quickly.<br><br>I believe their specialty is old fashioned doughnuts, so I ordered a Chocolate Old Fashioned. Every bite was so delicious and left me wanting more. The one I ordered is priced at $3.29 after taxes, but you can get a dozen for just under $25. Yes, it seems like an exorbitant price compared to Dunkin' Donuts, but these are quality doughnuts with far superior ingredients.<br><br>If not my fear of getting diabetes, I would eat a whole dozen of these in a heartbeat! I'm definitely going to be a repeat customer.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CS5Uw3F8N7SrYGWaQyW5UA/348s.jpg", "caption": "Some of the doughnuts offered"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KT9FmEzAXAFPKqf7q_1DGQ/168s.jpg", "caption": "Today's specials"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/t2Ct4lUosVbUNIci3M-oGw/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "The old fashioned, classic chocolate was delicious, slightly crunchy in the best places and very filling. I was not as keen on the pistachio lemon glazed donut, which was heavy (a trend with their donuts, it seems) and kinda a quirky flavor. Otherwise, popular and delicious hole in the wall donut place.", "pics": null}}, {"review": {"des": "I ran in, got my donuts and ran out.  I got red velvet ehich is frankly the BEST cake donut I have ever had.  In fact I love cake donuts so much that if most places could actually make a decent one I would pick that over a yeast donut any day but alas, that is not reality.  It had a slight crunchy outside and a dense moist inside that was to die for.  The PB with Jelly filling yeasty was delicious.  The peanut but wasnt over powering at all and the jelly filling?  It clearly was scratch made.  No fake fruit flavors here.  The yeasty was soft and pillowy with a mild chew which I love so the same can be saod for the chocolate glazed.  When I drive back through the city on my way home Ive already bartered my soul with the devil aka my partner in order to get them to take me back for round two.", "pics": null}}, {"review": {"des": "Every time I am in the city I make a point of going to Do-Rite. The GLUTEN FREE DONUTS ARE AMAZING!!!!!!! I have tried so many in different cities and Do-Rite is still my favorite.", "pics": null}}, {"review": {"des": "Do rite does it for me. Old fashioned all the way. Gourmet so if you're a baller on a budget buying for your work team maybe stop and dunkin instead. As a non carb eating dietitian this is my guilty pleasure on the occasional Friday morning shhhh don't tell anyone. Service is abrupt but necessarily so because as I'm sure others have written about there is more space in the womb of a woman pregnant with triplets...and probably is comparably as hot. But that's ok, because you'll likely be standing in line outside for 10 min just to get in. <br><br>Coffee is decent. Did I say old fashioned ???", "pics": null}}, {"review": {"des": "Came here with 2 of my friends this morning and we each got a different donut and shared. Service is fast, so even though there was a line, it went fast. In order of best to worst, we got one old fashioned, one red velvet, and one Boston creme donut. The old fashioned had crispy edges and the red velvet is a cake donut so it was more soft and moist. The shop is so tiny and cramped that we had to take our treats to the streets and sit on a ledge somewhere. So I guess I wish there was more of a variety of donuts and a better sitting area. I'd go back for an old fashioned though!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VNtOmjGRXhfevcKeL_weaw/348s.jpg", "caption": "Red velvet cake donut"}]}}]}