{"name": "doc-bs-restaurant-bar-chicago-4", "reviews": [{"review": {"des": "Okay this food was insanely good, but many great things combined to make this a 5 star experience.<br>First, randomly they brought our table California-Style Kale & Artichoke Dip for free because the kitchen had made extra. It was really cheesy and not the best artichoke dip I have had but it was free.<br>For our entree, my friend and I split The Plate. We asked for all the dressing on the side and they easily accommodated with no questions asked. They brought 5 individual sauces and patiently told us which were supposed to be paired with what.<br>The stand out of the night was their broccoli. They cut it cross wise so its almost like a little broccoli steak. It was perfectly cooked, but also it was a really unique way to cut the broccoli. I am going to try and replicate at home.<br>The service was great, the beer choices were great, and they had a ton of TV's which made football watching a breeze. I am such a fan and definitely going to return when I am in a region that has a Doc B's.", "pics": null}}, {"review": {"des": "It's a refreshing take on fish burgers. The Cajun fish burger was really good. Along with that we ordered the fish of the day which was trout - Cajun seasoned and blackened with corn on the side. The fish was really fresh and soft. And the seasoning was just enough to make you remember the fish for a long time to come. <br>A shout out to our server for happily answering all our questions - and there were quite a few. <br>Overall it's a great place for everything fish.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ns6C11BWJ2LcsMPKEabo1w/348s.jpg", "caption": "Fish of the day with the corn side"}]}}, {"review": {"des": "I was at the other Chicago location about a year ago. I enjoyed both locations. I love the fact that they use fresh squeezed juices in their craft cocktails. It makes a difference. The candies bacon sitting on the bar for your enjoyment - a little indulgent bar snack is beyond temptation. I had the fried chicken this go around and it was tasty. <br><br>I like the vibe of Doc B's whether you're sitting at the bar or at a table. Great cocktails and good food.", "pics": null}}, {"review": {"des": "Doc B's is the place to go when craving a legit burger! I had the Turkey Burger with hand cut Sweet Potato Fries but they have many scrumptious options to choose from. The homemade ketchup and the honey mustard cannot be beat! The staff was very friendly, courteous and the bartender makes a great drink! The ambiance is very cozy and comfortable. I will definitely be returning to Doc B's the next time I get to return to Chicago.", "pics": null}}, {"review": {"des": "I was so happy with this place during a business trip last week that I came in twice! This is a great spot for a casual *delicious* bite to eat amidst the hustle and bustle of the city. They have a great mix of unique burgers, salads, and wok bowls and their service is fantastic. Prices aren't bad either for being in downtown Chicago!! During my two visits I had a Tofu Teriyaki Wok Bowl (pictured below) and a Tofu Cold Noodle Salad topped with crushed cashews (also pictured below). Both of these were amazing and I give two thumbs up purely for the fact that they have so many options for vegans. Wait to go, Doc B's! I wouldn't change a thing about this place and for what it is and the vibes that this place is going for I give it 5 stars and I will DEFINITELY be back again when I'm in town for work.", "pics": null}}, {"review": {"des": "Went here on a Saturday night around 7:30pm and there was enough room to get seated immediately. I tried the turkey burger and my roommate got the double burger. Overall it was good. There wasn't anything that really stood out but it was good for just a quick sandwich or burger.", "pics": null}}, {"review": {"des": "We had just finished an architectural boat tour and were needing a late lunch. My hubby saw this place and quickly looked them up and we decided to give them a try. <br><br>We were quickly greeted and looked over the menu.  We started by sharing a salad since we were hungry from our morning of exploring.  It was a large portion and they split it for us!  It was really fresh and tasty.  I really loved the marcona almonds in the salad ($14)<br><br>Next we ordered or main dishes I ordered the West Coast Steak Sandwich (filet mignon, parmigiano reggiano, kale slaw and pickled onions) with a side of elote.  I ordered medium rare and it came out more medium.  It was $19 but i'd order it again.  The elote was spicy and I loved it.<br><br>My husband ordered The Napa (swiss cheese, avocado, arugula and dijon honey, $15).  I wish I videoed him eating it as the cheese was so meaty and falling out as he ate it, it's a very good burger.  <br><br>It was a great lunch but way pricy.  ($48 before 10%tax and tip).  I may go back during happy hour when the prices are reduced.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0RMCTv-icRKFzYnHDaybAw/348s.jpg", "caption": "Filet sandwich and elote"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nuijk3hUws_xs6ywYYMMOQ/168s.jpg", "caption": "1/2 of the brussels sprouts kale salad, very refreshing"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vdxPc8D8xm9nNixFZh49EA/168s.jpg", "caption": "The Napa with quinoa salad"}]}}, {"review": {"des": "Doc B's is definitely one of my fav. Lunch spots when I'm working down town. You HAVE to order the guac and chips (they're sweet potato chips!) So delicious! Their knife and fork Cobb is my go to. It come with crispy chicken but it can be swapped out for blackened or girlies. Great honey mustard dressing and their version of ranch is the ish especially when you dip fries into it! They also have a pretty good happy hour. $10 guac and chips, $7 drafts, $8 glasses of select red and white wines. I've never had a bad experience- the staff is lovely and the restaurant has a great atmosphere. For lunch they are always able to get us in and out in under an hour which makes it a winner in my book!", "pics": null}}, {"review": {"des": "Must try! I ordered the HOT Chicken (not spicy) plate with coleslaw and tres leches dessert. The boneless chicken breast was delicious, tender and charred to perfection with the right amount of habanero honey glaze. The coleslaw had a unique light enjoyable peppery flavor that wasn't over saturated with sauce. The tres leches was bomb! Not going into details, jus' go try it, if you're in the area. This place won't disappoint you unless you're pessimistic person (sorry mom!).", "pics": null}}, {"review": {"des": "Great spot with comfort food favorites.  I started with a mixed salad that was huge and very tasty.  The dressing was really good and had a full mix of veggies and lettuce.  Next up was the burger, cooked to a perfect medium.  It was big and juicy with a ton of flavor.  This place can get busy, so be aware of wait times.", "pics": null}}, {"review": {"des": "Great Service, good food..<br>Came here for lunch and I had their chicken sandwich with sweet potato fries...Delish!", "pics": null}}, {"review": {"des": "Came here with my boyfriend on a random Thursday night. The restaurant was pretty busy and we had to wait about 20 minutes for a table. Not a big deal!<br><br>I ordered the Black Tiger Shrimp Salad ($17) and it was a delight! The avocado vinaigrette used as dressing was amazing! It gave the entire salad such a great taste that I couldn't help but eat the entire thing! The jicama gave it a crunchy feel and the feta was a good addition to the salad. Although the salad had red onion in it, I could hardly taste it. The shrimp was okay, nothing spectacular about it. It was also cold shrimp and I would have preferred it to be warm. I loved that they gave me quite a handful of shrimp and not just 3 or 4 like other shrimp salads I have had in the past.<br><br>My boyfriend ordered the Tennessee Hot Chicken ($25) and we were warned at ordering that it would take at least 15 minutes to prepare this meal. This particular dish is massive. Probably big enough for two people! The chicken came with a side of coleslaw. The chicken was very tasty and cooked to perfection. I thought this chicken would be spicy but it was a mix of spicy and sweet. I would have probably preferred it to be a bit spicier. The coleslaw was okay, a bit too creamy since I could taste the mayo. <br><br>Service was good and our waiter was quick and attentive. I would definitely come back especially since they have so many options to choose from!<br><br>I can not give this restaurant 5 stars because even though the food was good, the two dishes we ordered were not 5 star quality.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rn33_WuEoz4vQl0aIb4EbQ/168s.jpg", "caption": "Tennessee Hot Chicken $25"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jIOzxBSF59JU23mIYNmn_w/168s.jpg", "caption": "Black Tiger Shrimp Salad $17"}]}}, {"review": {"des": "Stopped in here to get a quick bite to eat with my family before doing some touristy things. It was pretty empty when we got here but quickly filled up so I recommend making reservations if you have a larger party.<br><br>My family is boring and we all got the The Number Six. It's a crispy spicy chicken sandwich with a spicy habanero sauce and fries. The sandwich was really good. The chicken was juicy and tender and crispy and spicy on the outside. The coldness of the bbq sauce and pickles went really well with the warm bun and hot chicken. The chicken was definitely cooked to order because it wasn't oily or hard. You can always tell when crispy chicken has been reheated because it gets chewy and really greasy, this was not the case here. <br><br>Overall we had a great experience. Will def be back to try something else.", "pics": null}}, {"review": {"des": "Came here after reading some positive reviews. The real shining star of this place is their customer service. We were instantly greeted and seated with no wait. They were able to find our reservation (we mistakenly went to the wrong location). <br><br>Once seated, the waitress politely explained the menu and offered up a few suggestions. We opted to try and the chips and artichoke dip. We don't usually get something like this but man it was good. While working on our drinks we ordered from the main menu. I decided on the filet and my dining partner ordered the Tennessee Hot Chicken. A lot of reviews mentioned the chicken was good. However, she was really disappointed. The chicken was soaked in some sort of honey glaze, which made it have a extremely sugary/candy like tasting. You couldn't really taste the Hot at all as it was overpowered. I'd recommend changing the name to Tennessee Honey Chicken over Hot. <br><br>Suffice to say it was the first time she has sent an item back to the kitchen. Thankfully our waitress was understanding and she ordered the fish of the day instead, which was very flavorful.<br><br>My steak was good, but not something to go crazy over, it was pretty thin to other steaks I have had in the city. <br><br>I had an gelato cookie sandwich for desert, which also was a disappointment. And here's why. I think they pre-made these and freeze them ahead of time and then thaw them out when someone orders them. Because the cookie I got was ROCK hard. When you are trying to eat this type of the desert, the cookie ABSOLUTELY needs to be soft. Otherwise you are just waiting for a cracked tooth. <br><br>If it wasn't for the outstanding customer service I would rated this place a lot less, but they really stepped it up. I wish I could rate 3.5 stars because I think they are just above A-Okay. If they make some small fixes they would be an easy 4-5 star place!", "pics": null}}, {"review": {"des": "We got into Chicago at 9pm and needed something quick after driving all afternoon. Doc B's was across the street from our hotel so it was just the quickest. <br>What a delicious surprise! My husband had the Cajun chicken club sandwich and he said it was great. I had a WOKOUT bowl with filet mignon, veggies, brown rice and cashews in a sweet & spicy thai sauce. It was delicious!! Our waitress, Tierenay, said it was her favorite and I can see why!! And she was a great server. I don't think my water glass got any lower than half full.", "pics": null}}, {"review": {"des": "After being disappointed 4 meals in a row, we decided to return to Doc Bs for our final evening in Chicago - and they delivered delish again! My steak burger was tender, cooked perfectly, and had good flavor. Shockingly, I liked my baked potato as much as my steak! (I'm also pregnant so a little biased in my taste buds!) the skin was crispy and had a light coating of sea salt, and all the basic fixins of a great baked potato. <br><br>Hubs got the night's special, an ahi tuna burger. A secret recipe teriyaki sauce had a blend of sweet and savory - and the mango salsa HIT you with a cool spicy sweet crunch. It was a deep dive of flavors, textures and experiences! Although it was a little too spicy for my delicate digestive system.<br><br>The service was great, the projected 25 minute wait only took 10, and the food delivery was speedy. Thanks Doc B's for making my Chicago a tasteful experience!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xNV1zeq5A244XdUFgPNAcg/168s.jpg", "caption": "Special: Ahi Tuna Burger with teriyaki and Cole slaw goodness, and garlic roasted broccoli. Yum!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QfyXZiVmdyysXBj85C-x7g/168s.jpg", "caption": "West Coast Steak Sandwich with Loaded Baked Potato."}]}}, {"review": {"des": "Stopped by on Memorial Day Monday and got seated very quickly our server was Jesse and he was amazing. He constantly returned to check up on us after we got our drinks and our entrées to make sure we were happy with them. <br><br>We ordered the Lo Mein salad with Steak and the Dragon Burger. Both tasted delicious and very filling. The lo mein salad was very refreshing, it was a great combination of avocado and mango with carrots and peas. The steak was tender and flavorful. The Dragon Burger was very tasty, sort of a southern burger with coleslaw and chipotle honey bbq sauce. We shared our entrees and were very full. <br> My Beet'le Juice Drink was very refreshing, extra good in a hot day like today. <br><br>I highly recommend this restaurant while visiting Chicago. We loved it!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gl-YyoHHBmzN90OZ5Lk_7g/348s.jpg", "caption": "The Dragon"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1cbm8kYKSWq0Xos2ZMxYlQ/168s.jpg", "caption": "Beer (forgot the name) and the Beet'le Juice cocktail"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1NolZjZYcqFEJXbz9jYmUw/168s.jpg", "caption": "Lo Mein Salad (added steak)"}]}}, {"review": {"des": "Great place for lunch! Always busy with the office crowd.<br><br>The Polenta Fries are great! The dipping sauces are to die for, especially the pesto. The guacamole isn't bad, could use more zest, but comes with these great homemade chips. <br><br>The Wedge Burger is also very flavorful and comes with a fried egg. What could be better?! <br><br>Their menu is pretty eclectic and ranges from Asian entrees to sandwiches and salads. Everyone will definitely find something of their liking here.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vM3XBKMWKJrMGBQjDjwIOw/168s.jpg", "caption": "Wedge Burger"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IhYvVih3_5jAQJp5XqFhwg/168s.jpg", "caption": "Polenta Fries"}]}}, {"review": {"des": "Stopped in because it was near the train station and we wanted anything good that didn't break the bank. <br><br>We came in around 12pm on a Friday and it was fairly empty so we were seated right away (came it at the right time though as only 15 minutes later the restaurant got really busy!). I ordered \"the number six\" which was a chicken sandwich and this bbq habanero sauce and pickles, with sweet potato fries on the side. The sandwich was incredible and incredibly spicy (just the way I love it.) the sweet potato fries were the best sweet potato fries I've had and as sprinkled with bigger salt crystals which was a nice touch. <br><br>Service was great and either the manager or owner (?) came up to me in the end to ask me how I enjoyed my meal. I was very satisfied with my experience here and was surprised at how attention to detail the service and food was despite how busy the place was!", "pics": null}}, {"review": {"des": "Came here on a Sunday evening. The place was busy but honestly the food came out fast. Our waitress was very nice as well. Tried the dragon burger and the corned beef sandwich. Both were very tasty. The dragon burger has a kick to it (beware of you can't handle spicy) and the pickled before have it such good flavor. Also the corned beef wasn't salty as I had imagined and I loved the pretzel bun. The fries were very delicious and crispy yet soft. I saw that they have happy hour 4-6 pm Fri-Sat. Not sure what's included in that but I would be interested to know. I thought the appetizers were way over priced (unless the portions are giant).", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XOduD61vN-k3w6QKOEBYfQ/168s.jpg", "caption": "Corned beef sandwich on pretzel bread"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LEYSnU2A5V0ZPYKCLAVqGg/168s.jpg", "caption": "Dragon burger and corned beef sandwich"}]}}, {"review": {"des": "I ate a dragon today...And I loved it!<br><br>If you haven't had the DRAGON burger with side quinoa salad at Doc B's on Grand Ave, you're missing a lot in life. My awesome amigos at NW have been bringing me here every Sunday. It's $5 per burger and the side!!!! It's called $5 Sunday burger. To my taste, it's one of the best juiciest most flavorful burgers I had. Staff, service, waitresses, atmosphere, bathrooms, seats all are amazing. It's so nice to have a good routine in life like a dragon burger with wonderful people. After eating one, I barely could control myself not to order another dragon..<br><br>Update, they canceled their Sunday's $5 burgers.", "pics": null}}, {"review": {"des": "Great service, and kid friendly. We went with our waitress' recommendation for the starter and tried the guac with sweet potato chips. Avocados were fresh but the dip needed salt. The sweet potato chips were a nice change from tortilla chips. I ordered the\"hot chicken\" entree, which was cooked very well, perfect level of crispiness. The \"honey habanero\" sauce that smothered the chicken was slightly too sweet for my liking. Still a very satisfying meal, with great menu options. I would recommend checking this place out.", "pics": null}}, {"review": {"des": "The reviews were so great for this place, I was bummed my Ahi Tuna Salad was so bland. The ingredients were good, the dressing just didn't do much for me and the ahi tuna wasn't seasoned at all. <br><br>The highlight was the sweet potato chips that came along with our gauc. We gobbled them up and asked for a second bowl! If you come here, do yourself a favor and at least order those!", "pics": null}}, {"review": {"des": "Enjoyed the atmosphere and our server-Jesse H. The Guacamole was excellent but the chips were a little soggy. The Mint Julep was very light on the mint. The chicken sandwich, the number 6, and west coast steak sandwich were good.", "pics": null}}, {"review": {"des": "I have been to Doc B's twice while visiting Chicago, and it has become my favorite lunch spot in the city! They have a few different locations, but this one is very convenient to a lot of the shopping Chicago has to offer. And it's super close to Eataly which is another one of my favorite spots to visit when I'm in town :) Doc B's is perfect for day or night, and has healthy options which is great to see. The portion sizes are huge, and I haven't tried a single dish I didn't like.<br>The salads are my personal favorite, and there is such a great variety. The tangled noodle salad with beef was amazing, had such great flavor (I love anything with peanut sauce) and was the perfect blend of meat, veggies, and carbs. We also ordered the sweet potato fries as a side because I feel like they are a staple here... the honey mustard dipping sauce the fries are served with is pretty life-changing. I almost poured it on my salad, it was that good. My lunchtime companion had the quinoa chicken salad which was also very hearty, had a good amount of protein, and had great textures and flavors.<br>My reason for giving 4 stars instead of 5 is the price. It's almost impossible to spend less than $20 per person, and while it is a nice dining experience, I think I would almost prefer if it was a quick service restaurant. The salads are good, but not large enough to share (in my opinion) and cost about $18. When you add tax and tip, you've got yourself a pretty pricey lunch. But if you're traveling to Chicago or looking for a yummy healthy option, I would definitely recommend Doc B's!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OPQvMtkzKNMYY-wBdaasvA/168s.jpg", "caption": "Tangled noodle salad with steak"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/X4NYcwmV3ew-Ewmpl8uW6A/168s.jpg", "caption": "Quinoa kitchen salad"}]}}, {"review": {"des": "This is a gem . Fresh fun and friendly. This place draws a crowd so go for lunch or late get anything on the menu all good<br>Drinks are just as amazing", "pics": null}}, {"review": {"des": "Great food and atmosphere. The sweet potatoes chips and guacamole are so delicious. The sweet potatoes fries are thick cut and sweet. The burgers come on delicious whole grain buns. The Wok bowl is the hottest plate I think. They are delicious and savory. The food comes quick. The service is great. And the food is very unique and tastes much healthier than most restaurants.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pZLCF_94L7lsZdSbe8Fybg/348s.jpg", "caption": "King Cob salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4Ts1EuGn7s6zE27cWXBv-Q/168s.jpg", "caption": "Sweet potato chips and guac"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/loMHTP0sjsxCNl8kLuXdBg/168s.jpg", "caption": "Mr. Walton sandwich"}]}}, {"review": {"des": "Great lunch: wedge burger with fried egg, bacon, bleu cheese (got mine w/o bun) and sweet potato fries. Nice Old Fashion. Friends raved about their dishes too.", "pics": null}}, {"review": {"des": "I'm visiting from Orange County.... I had to pull my phone out just to yelp this place. Phenomenal salad. I have the California salad and it's just all the right flavors. You must try it. I also got a started which was hoisemase guacamole !! Another must. You gotta come here and try it for yourself.", "pics": null}}, {"review": {"des": "Modern atmosphere. Fresh, quality ingredients, thoughtful preparation and execution.<br>Attentive, fast, pleasant service. Simply outstanding.<br><br>After several visits continues to keep up with superior execution in service and preparation of plates. Sandwiches and salads, no matter what we try - flavorful and pleasant. The service is prompt and attentive. Our first choice when in the area.", "pics": null}}, {"review": {"des": "Location was directly across from my hotel. We were greeted and seated right away. We went on a weekday, in the evening for dinner. The service was excellent and attentive!! <br><br>We ordered wings,  ribs, fried chicken dish, loaded baked potatoes and home-made tres leches cake. Everything we ordered was delicious. We also had our share of drinks. I like the concept of the restaurant and the way they prepare their food. It was my first time dining there and I was pleasantly surprised.<br><br>Great ambiance and cozy seating. Also good for dates. I would definitely recommend. I look forward to my next visit.", "pics": null}}, {"review": {"des": "Good eating is everywhere in Chicago, there are a few spots that only your taste buds will pull you back too. <br>Me and the fiance grabbed a bite here and we actually had a table with our reservation. It's packed but in a Tuesday which was great. <br><br>We started with some really good drinks (that had alot of alcohol in them), got the fresh guac and some wings. Delicious!<br><br>Food came.oit pretty quick but not to fast as we had plenty app to finish. <br><br>Overall the food was great, ambiance was great, and of course the service was crisp and on point. <br><br>I'll be back when brunch starts officially!", "pics": null}}, {"review": {"des": "I was craving some healthy food while traveling in Chicago and Doc B's popped up on my Yelp search! I really wanted a kale salad so the California Salad was perfect and really hit the spot! It has kale, avocado, pistachio, dried cranberries, wasabi peas, and roasted sweet potato. I asked for some shredded turkey to be added also, and the chef incorporated it nicely and evenly throughout the salad vs. just tossing it on top. My only complaint is they are really light on the avocado. I think it only had three pieces in the salad. I also ordered a side of quinoa because I was worried I would still be hungry, however it wasn't necessary, because the California Salad was huge!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4LQEL4wbBrbOPx-hxhgdKg/348s.jpg", "caption": "California salad! With quinoa side!"}]}}, {"review": {"des": "Doc B's is a bustling contemporary restaurant in the heart of River North. I'll admit I was a bit concerned with the restaurant's \"health-inspired fare.\" (I have nothing against eating healthy, but when I'm out for the weekend, I prioritize my taste buds over my arteries or waist.)  I didn't have to worry--the food here is great. <br><br>My wife raved about The Homage burger. She thought it was one of the best she'd had in a while. I enjoyed the Knife and Fork Cobb, and it was tasty and fresh. <br><br>The service was friendly and attentive. And prices are fair--the burgers, sandwiches and salads are in the $15 to $20 range, with entrees available for $20 to $30 apiece.)<br><br>This is a popular spot. Check out their website or Open Table to make a reservation.", "pics": null}}, {"review": {"des": "I have to say, every time I try this place I'm impressed. It's a great sort-of, kinda-nicer casual place, great service and the food always is a delight. Standouts for me have been the Bowls (tried a few combinations and they're all delicious) and my new favorite, the turkey burger. Great cocktails and generous pours on wine too!", "pics": null}}, {"review": {"des": "Excellent excellent excellent! Perfect for someone with a gluten sensitivity as well as those without. Top notch servers and the food is as fresh as fresh comes. We went around 2pm on a Friday and got right in. They had a soccer game on and the vibe was great.<br>All dressing is gluten free. Gluten free bun also available. Oil that is used to fry is soy. I couldn't have that so I got my Cobb salad with grilled chicken...phenomenal! Thought the portion seemed small but turned out it was right just. Left being a very happy customer and visitor from Oklahoma!", "pics": null}}, {"review": {"des": "Checked out this casual food spot today afternoon (Sunday afternoon) after reading reviews here on Yelp and I am so glad I did!! (I don't want to generalize but this Sunday afternoon around 1pm the restaurant was not busy and there was no wait to be seated.) <br><br>For appetizers I got the house gauc and it came with sweet potato chips. It was pretty good! The serving size is generous, so definitely shareable! As an entree I ended up getting the dragon burger! It's not your traditional burger. There was a kick of sweet/spicy flavor from the habanero-honey BBQ sauce. If you are a fan of sweet and spicy flavoring in your food I think you'll like this burger! I got the sweet potato fries with the burger and that was pretty good as well! The staff was also very friendly and attentive. <br><br>This is a great burger place! There are other things on the menu but I was craving burgers so I cannot comment regarding the other items on the menu. But the Dragon burger did not disappoint!", "pics": null}}, {"review": {"des": "Was hungry after running errands. <br>Cravings for good burger . <br>I loved the sweet potato fries. <br>But It was missing any condiments. <br>I asked for medium rare plus extra onions. <br>I got rare with no extra onions. <br>Service was meh- <br>Beer was flat.. actually first time leaving my drink more than half.. <br>Apathetic staff.", "pics": null}}, {"review": {"des": "GO HERE!!!  Vivian and Shamir are a dynamic duo behind the bar!  Engaging, entertaining friendly and funny!  The spicy chicken sandwiches are AMAZING.  We went during the last portion of happy hour on Friday.  Great specials. Highly recommend this place. The open air atmosphere is super neat.", "pics": null}}, {"review": {"des": "The backyard burger is really good, loved the huge onion ring on top with crispy batter. The Canadian bacon is a bit salty. The patty and the sesame buns are both good. Also really liked the quinoa side that came with it, very refreshing with lots of veggie in it, loved the radish and sun dried tomato in it.<br><br>The shrimp wok is great too! With a lot of tender shrimps! The sauce is also great.", "pics": null}}, {"review": {"des": "Loved the ambience and the people at Doc B's. They are a fun bunch, also good customers all around or maybe I was just lucky to have really interesting people (which includes a pop star) hanging with me there. The food was perfectly what I expected. This place should have a better overall rating.", "pics": null}}, {"review": {"des": "Stopped in for a quick lunch between meetings. Friendly staff and atmosphere. There are TVs around for dining alone. <br><br>Food - I ordered The Number Six sandwich. A spicy fired chicken with pickles and habanero honey. The chicken was juicy and crispy and the habanero honey left my dying for more. My side of quinoa salad was also delicious with bits of cucumber, chickpeas, and sun-dried tomatoes. It was a great portion size. <br><br>For dessert I ordered the maple glazed bacon. People obsess over bacon too much, but this was truly perfect. The bacon was cooked perfectly and the maple sweetness elevated it beyond what I thought possible. <br><br> If your contemplating stopping by, make sure that you do. The food is delicious and fresh. I will definitely be back!", "pics": null}}, {"review": {"des": "Ordered Doc B's for delivery through Postmates and had a really positive experience. Had The Dragon burger and it was a nice mix of heat, texture and the burger was awesome. Great seasoning, thick patty and perfectly cooked, even on delivery. I opted for the baked potato which was massive and covered with a bit too much salt. However, the cook was perfect and they packaged the sides in small containers which was awesome. Overall, a pleasant delivery experience and would reorder again in a heartbeat.", "pics": null}}, {"review": {"des": "Stopped by here this afternoon. Ordered the West Coast Steak Sandwich (filet mignon with Parmigiano Reggiano, kale slaw & pickled red onions) with a side of fries. Prepared perfectly to my liking. The kale slaw on the sandwich was delicious. Even the fries were good and just the right amount, not an over-abundance like some places. Service was great, too.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/F7gHZEIibnQHxOtMVLVEtA/348s.jpg", "caption": "West Coast Steak Sandwich"}]}}, {"review": {"des": "The food and the service was absolutely amazing! The wings were the best I've ever had hands down. Would definitely go again!", "pics": null}}, {"review": {"des": "This place. Wow! Sooooh guuud. Service is top notch. We were seated immediately and because we waited for 5 min before our waitress showed up they gave us a delicious chips and guacamole plate on the house! Our waitress Chanel was so friendly and on top of everything! The \"Not Your Mother's Tuna Sandwich\" was the best seared tuna sandwich I've had. Highly recommend!!", "pics": null}}, {"review": {"des": "After reading extensive reviews, this was the dinner of choice for my last weekend in Chicago for the summer. My mom and I were staying at The Gwen, and Doc B's was an easy two minute walk away. They were crowded but seated us right away and had plenty of openings on OpenTable for reservations.<br><br>The dinner started with an extremely charming waiter who welcomed us and then told us we were going to be served by another waitress. No worries though, he came back to visit, and our waitress was extremely friendly and accommodating too! The menu is extensive with a plethora of options to accommodate for a variety of preferences. My mom and I typically enjoy healthier meals and opted for a salad and entree. We ordered the California salad which was filled with unique flavors of pistachios, sweet potatoes, avocados, and more! A truly perfect blend that was the perfect serving when split between two people. We then shared the Wok bowl with salmon, spicy and sweet Thai sauce, and brown rice. The salmon was cooked to perfection, and although the wok bowl was not exceptional, it was still filling and enjoyable. We sat here for hours and received exceptional service!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BUbHW4SAIJVMyPHFxXX1LQ/168s.jpg", "caption": "Wok Bowl with brown rice and salmon"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ygwmDtf920IcNyoqGCf-9A/168s.jpg", "caption": "California salad"}]}}, {"review": {"des": "Awesomely delicious..if ur in this area ever stop in and try the burgers.i got the back yard burger wife got the wedge burger", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ImZB4_u_fZH51wqC9z5pww/348s.jpg", "caption": "Wedge burger and backyard burger. Delicious"}]}}, {"review": {"des": "I went here with my wife for a quick dinner as we were referred by a friend.  I can say with most certainty that the #6 chicken sandwich was the BEST chicken sandwich that I have ever had.  My wife ordered the burger, which was quite salty - but still very tasty. <br><br>Since the order was was take-out, I didn't get to experience the wait-staff/service.  That being said, I asked the bartender for a Sprite while I waited after 20 minutes of shooting the shit. I was not expecting her to charge me $4 for it, but hey.. those is the breaks.  <br><br>Open style seating with a very wide open and casual ambiance - great  date spot for american-style cuisine that is priced fairly. <br><br>I will be back, but no more $4 sprite for me, not in this economic climate!", "pics": null}}, {"review": {"des": "Went here with a friend and WOW! Absolutely loved everything about the place. The ambience was hip, upscale, and inviting. The beer was SO good (I got the watermelon wheat ale and it was the best beer I've ever had). And the food was wonderful. It is a bit more expensive than I would usually like, but the food is top notch and the portions are just right. <br><br>My friend and I both got Wok Out Bowls. I got shrimp teriyaki with brown rice, and my friend got the steak version. The shrimp were huge and the bowl came with at least 10 of them. For $17, I'd say that is a great deal, especially in Gold Coast! <br><br>I'll definitely be coming here again.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mvf5r_Z4y90u84xB_xCzWg/348s.jpg", "caption": "Brussel sprout and kale salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/y8_FFWoU2NVoteJ4rzbr-g/168s.jpg", "caption": "Crispy chicken sandwich"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/l16ceuIJ1dZskK_poI1bwQ/168s.jpg", "caption": "Shrimp teriyaki bowl"}]}}, {"review": {"des": "Our waitress Laura made it so special cause she was one of the nicest people ever. <br>The food was truly amazing we had tuna burger and number six sandwich <br>I'm coming back to it again", "pics": null}}, {"review": {"des": "Everyone restaurant should take note, because this is how you make an experience right:<br><br>A few weeks back, I had a bad takeout experience and posted a review saying so. Almost immediately after posting my review, I was contacted by a manager at Doc B's. She was extremely apologetic and assured me that they were working with the team to implement new standards and procedures in regards to their carryout and delivery. Not only that, but they treated my coworkers and I to a lunch. <br><br>The service was great (shoutout to Carmen) and so was the food. I will definitely order takeout in the future, as I am confident they have taken my review seriously.<br><br>Thank you, Doc B's, for rectifying our experience and putting action behind your words.", "pics": null}}, {"review": {"des": "My favorite thing about Doc Bs was a promotion they were running during the winter / off season where on Sunday evenings you could get any burger for $5 -- and insane deal that brought my husband and I back for multiple weeks until they limited the deal to one specific burger with no modifications (these sad vegetarian and gluten free eaters went elsewhere for dinner that night and haven't been back). BUT, during the time when we explored the burger selection, we truly enjoyed our visits. Gluten free buns were great, sweet potato fries top notch, the coleslaw is really quite good. My favorite burger was the Napa, though the Dragon and Homage were also enjoyable. My husband said the vegetarian burger is one of the best veggie burgers he has had. Good drink selection too.", "pics": null}}, {"review": {"des": "Really great burgers!  I had the backyard and my husband had the wedge.  They are huge so we had to cut them in half to eat!  Not sure what seasoning they used but it definitely enhanced the flavor.  I went with the Brussel sprouts as a side and was a bit apprehensive when I saw they were covered with rock sugar - not salt - but it was different and really good.  My son got the chicken parmigiana special, also a hot.  For dessert we had the key lime pie - berry tart - and the tres leches.  Both a hit!", "pics": null}}, {"review": {"des": "Ate at a Doc B's and made a reservation through opentable on 3.28.18. <br>Seated very promptly and quickly. Was excited to try it due to the fascinating rating. <br><br>Our service was not the greatest. The waiter we had did not ask us how everything was, and it took a few extra minutes longer than i would have liked for drink orders. <br><br>I had the turkey burger while my other colleagues tried the fish sandwiches and such. <br><br>Maybe it's my choice of the burger, but it was in all honesty nothing spectacular. THe fries were overly salted so i did not finish it. <br>THe guac on the burger was an added surprise and enhanced the burger. <br><br>While today could have been an off-day, coming from out of town, i would try other restaurants next time i come before i try this place again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RBGPRxW4VWyX88Utj2XluA/348s.jpg", "caption": "Turkey burger. Fries were really really salty"}]}}, {"review": {"des": "Many salads and vegetarian alternatives.  \"The Plate\" was phenomenal.  Great grilled<br>Broccoli and artichoke", "pics": null}}, {"review": {"des": "I stop here whenever I'm in Chicago. Everything we have had has been well executed.  Last night was no different, the Tennessee hot chicken is excellent, I have not found this dish anywhere else that compares.  My wife's filet was cooked to perfection and on par with a steakhouse.  Best of all the service is always friendly, well organized and brisk.  We were in an out in an hour and fifteen minutes during the dinner hour.", "pics": null}}, {"review": {"des": "Such a delicious and healthy option downtown! It was a lively atmosphere and fun place to catch up with friends. They are very welcoming for children, and accommodating for food allergies and aversions. The French fries are especially tasty, we ended up ordering extra for the table!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/033jXvYVpiZcpiA4QFY9Hw/168s.jpg", "caption": "Matzo Ball Soup"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-pkJ0suWq_yQudH-NLlh-A/168s.jpg", "caption": "Ahi Salad"}]}}, {"review": {"des": "Back in January, my cousin and I visited Chicago and one of the places we hit up was Doc B's. One of her friend's recommended it so we decided to go. When we got there, it turned out to be Happy Hour, which was a pleasant surprise. They had a bunch of great Happy Hour foods and we decided to try a few different dishes.<br><br>We shared the soup of the day which was a gumbo with a little bit of heat. We also got the guac and chips which came with sweet potato chips. Third thing we ordered was the oven roasted chicken wings (my favorite). We got a burger (least favorite) and the kale and brussels sprout salad. Everything was really, really good and it totally helped that most things were around $5-6 each and very good portion sizes. The guac was super fresh and the sweet potato chips worked really well with it. The roasted chicken wings were still pretty crispy and the herb mix they used on it was amazing. It had some garlic, oil and green herb mix. The burger was a regular burger and I thought it was mediocre, at least compared to the rest of the dishes. The kale and brussels sprouts salad was surprisingly really good. It was fresh and pretty light and definitely needed for some extra veggies with our meal.<br><br>The service was great and if you sit at the bar, they have candied bacon on the counter, kinda like how every bar has some bar nuts. I was sad I wasn't able to try the bacon but it's a very cool concept.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kf_1Lx4mIulZkq1f_NG3Rg/348s.jpg", "caption": "Oven roasted chicken wings!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kyp2YvS85TCq4Kk6NvKPcg/168s.jpg", "caption": "Brussels Sprouts salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Y8C8yJLwWKpIJNi1JqtZiA/168s.jpg", "caption": "Soup of the Day"}]}}, {"review": {"des": "Simply amazing! Food, drinks and service! We will definitely come back! Referral from a friend! I ordered \"The Plate\" with a side of potato fries. The other order was Cajun Fish Sandwich and coleslaw! Be sure to order a cocktail called The\"Beet\"Lejuice.", "pics": null}}, {"review": {"des": "Just happened upon this cute little place. Great customer service, so friendly and welcoming! I had a hard time deciding what to order, but ended up with the Cobb salad. OMG, best decision ever!! I didn't want the salad to end. It was so damn good!!", "pics": null}}, {"review": {"des": "We're frequent visitors to Chicago and have always gone to the same places. This year we decided to wander the River North area and pleasantly discovered Doc B's after walking the neighborhood a bit too long. The hostess was super friendly, the barkeep made us a perfect Old Fashioned and dinner was fresh and delicious. My husband ordered the Wok Bowl with noodles and salmon. Oh yum! I had the salad with Chicken Schnitzel. Oh yum except the salad was drenched in dressing. Too wet for my tastes but very tasty. Sweet potato fries were extra delicious ... steak fry cut, not overly fried and very fresh. You knew you were eating sweet potatoes. Tender and steaming hot. <br><br>The food was great but we also loved the art on the walls. Fun, colorful and happy. We still want to know who the artist of the Newspaper with Mr. Potatohead, Popeye and Underdog is! <br><br>We will definitely be back! Thanks Dic B'a for a great evening.", "pics": null}}, {"review": {"des": "Ducked in here for dinner during a rain shower and enjoyed everything we tried! The atmosphere was casual, laid back and comfortable. The service was engaging and super fun. The pricing was spot on. <br><br>We tried the lobster roll with fries. The seasoning was perfect, the dressing light and the butter grilled roll was loaded with tender fresh lobster meat. Our next dish was the BBQ burger with sweet potato fries. The burger was just ever so slightly over cooked for what we ordered, but the flavors were nice. It was well seasoned. I wish they were more generous with the toppings as I couldn't even taste the BBQ sauce in the bites I had. This left the burger, overall, just a tad dry. The sweet potato fries came with a really nice honey mustard dip. Our last dish was the tuna salad. The tuna steak was perfectly seared on a super hot grill giving it a nice crisp flavorful outer edge with a red raw center. The spicy mayo glaze over the top was a nice compliment. The salad was loaded with Asian flavors, fruits, veges and a carrot ginger vinaigrette that accompanied it beautifully. <br><br>We had a couple farmhouse beers that were on tap and enjoyed those as well. I'd definitely come back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EoJ0r4M41hE3ryM9aWwMwg/348s.jpg", "caption": "Tuna cooked to perfection, SO good!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-J-50Ohvq5pV0cRrxbCm2Q/168s.jpg", "caption": "Tuna salad. Delicious"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/r4QO32655m5eYIc_rVT98w/168s.jpg", "caption": "Lobster roll and fries. Delicious buttery grilled roll with tender lightly dressed lobster, perfect"}]}}, {"review": {"des": "Food was kind of meh<br>Great server made it less bleh<br>Overall, an \"eh\"<br><br>After seeing this highly rated restaurant on Yelp, which also happened to be close to our hotel, I was very excited to try it out. My group took a table which was half inside half outside (very cool). The restaurant has a great ambiance and is the perfect location if you want to people watch.<br><br>Our waiter was very accommodating to some dietary restrictions I had and helped me make my meal vegan. Unfortunately, the food here was very mediocre. I ordered \"The Plate\", which consisted of different salads and cooked veggies. While it wasn't bad, there was certainly nothing special about it and my friends did not like their food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dLypDK_q5ZsvfC0LQjpDBA/348s.jpg", "caption": "The Plate"}]}}, {"review": {"des": "If you haven't been here before, I'd say it's a MUST try. For someone like myself having a Gluten intolerance it can be difficult finding places that, for one, offers gluten free options but most importantly for a place to actually know how to work with gluten free bread, which actually tends to fall apart quite easily. Doc B's offers gluten free burger buns as an option and let me just say- it's Amazing! I ordered the Dragon Burger (medium well) with bacon, and Sweet potato fries as my side along with the house honey mustard to dip into. The Dragon burger has a giardiniera slaw that literally makes you go \"mmm..\". I promise you-you will not regret it!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uWiNCBGtmhN7xXe2P6LPTg/348s.jpg", "caption": "Dragon burger with sweet potato fries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Q35L9BX5JyFPsQtuTSIr9g/168s.jpg", "caption": "Crazy beautiful: Vodka,elderflower,spiced pear, sparkling"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0k9q7hU-G8LDzLTNXRACxA/168s.jpg", "caption": "House made guacamole and sweet potato chips"}]}}, {"review": {"des": "We went after the Women's March. My sandwich was legit. I cut it in half and took the rest home. Our server kind of sucked though. <br><br>We were indecisive and took a bit longer to order. He came twice to ask us, but we needed more time... then when we were ready he was nowhere to be found. <br><br>Then when we needed him after ordering he was blatantly ignoring us. <br><br>Then when we wanted the check he was like turning his back on us. I'm sorry we took too long to order? It shouldn't have been a crime!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bKHgHHPd4EG8v6wCLDTamw/348s.jpg", "caption": "Crispy chicken sandwich with sweet potato fries"}]}}, {"review": {"des": "Delicious wings, hot chicken and west coast steak sandwich.  Ribs were tender and very flavorful.  Would definitely come back when I'm back in town!", "pics": null}}, {"review": {"des": "If you're looking for a trendy spot that serves delicious burgers, Doc B's is the place for you. The restaurant has a ton of seating, and a bar if you want to grab a couple drinks. They always play great music and have quick and friendly service from what I've seen. Lately, I've  been ordering the food for delivery through third party services (Doordash, Postmates, etc) so the review will also be based off of that.<br><br>The Food:<br><br>The Dragon Burger 5/5: This is one of my first burgers that I've tried here, and it is by far my favorite. The toppings include fried crispy leeks (adds a great crunch), giardiniera slaw (nice pickled flavor), and a sweet habanero sauce that just tops the burger off. I always ask for lettuce and tomato to be added to give the burger more of a fresh flavor, but that's just my personal preference. The burger is definitely a mouthful, but you'll find yourself cramming every last bite down.<br><br>The Wedge Burger 3.5/5: This was the burger my girlfriend would get before she switched over to my burger. It's a pretty good burger with all the standard fixings (lettuce, tomato, Candied bacon, and a sunny side up egg). It comes with danish blue cheese, so if you don't like blue cheese like me just replace it with swiss or cheddar. The bacon does definetely  become masked with all the other flavors (I'm not a huge fan of egg on burgers despite it being a trend), but overall the burger is pretty good.<br><br>The Number Six 3.5/5: This sandwich was pretty good also, but wasn't anything amazing. It had crispy chicken with pickles and the same habanero sauce they use on the dragon burger. I only got this once and remember not really thinking to ever order it again.<br><br>Grilled Chicken Salad 5/5: This salad is definitely something I would get. It's pretty pricey but it's a huge portion that you can share between 4 people for an appetizer or provide a hearty meal for one. The salad itself is filled with a bunch of unusual but delicious toppings (Corn, cilantro & edamame with tortilla strips) which compliment each other oh so well. I personally don't know if I would add anything else to this salad if I could, it's just great.<br><br>Wok Out Bowl 3.5/5: Personally I thought it weird that they offered this in a burger place but it's not a bad dish. My girlfriend's dad got the chicken and tuna one (different times) and said the chicken one was better. The bowl is pretty hearty and has good flavors but I personally would stick with a burger here.<br><br>Sides:<br><br>French Fries 4.5/5: I love their fries! The are semi thick cut and seasoned well so every bite is delicious. Plus you can't go wrong with fries and a burger. One note is that they don't travel very well, so although they are really good they become stale pretty quickly. So if you order Togo or delivery the fries will probably just be alright.<br><br>Sweet Potato Fries 4/5: These are pretty good with a solid mustard dipping sauce. My girlfriend is in love with these so much I think she might leave me for them :( But seriously she says they are the best sweet potato fries she has ever eaten. <br><br>Desert:<br><br>Gelato Cookie Sandwiches 3/5: these are decent; ice cream between two cookies. I've tried only the mint chocolate chip one and can say it's pretty good. But for 5 dollars I would probably just make some myself at home.<br><br>Overall Doc B's Is my go to place if I'm craving a delicious, juicy burger. whether you order dine in or delivery definitely try this place!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QQB7cveS_HelbYMSEMMlgw/348s.jpg", "caption": "Inside view of dragon burger with tomato and lettuce"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4BvPPhGH7kwXmvQGaGYZBw/168s.jpg", "caption": "Dragon burger with tomato and lettuce"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1HYV03jfiagK1ldU9Y3OIA/168s.jpg", "caption": "Dragon burger (to go) with lettuce and tomato added. Also can't eat it without fries :)"}]}}, {"review": {"des": "The \"Not your Mom's tuna sandwich\" paired with the quinoa salad is a must have. The tuna was cooked perfectly at medium/med rare. The quinoa salad has a Mediterranean flair with chickpeas, sundried tomatoes, fresh mint, English cucumber and radishes.", "pics": null}}, {"review": {"des": "This place is one of my favorite burger places. I haven't dined in for a while, but I get delivery pretty much weekly! So let's get into it:<br><br>Wedge burger:  It's a decent, basic burger. This used to be my go-to, but I haven't ordered it in weeks and don't really see myself ordering it again. I always changed out the cheese, though. Eek! I don't like blue, stinky cheese. If you're a picky eater, or don't like too much going on, this is nice. The bacon does get lost for some reason. 3/5<br><br>Dragon burger: My absolute favorite. It comes with habanero bbq sauce, crispy fried leeks, and giardiniera slaw. I always add lettuce and tomato, and I always get extra giardiniera slaw. I think the slaw really makes the burger what it is. It's slightly sweet, and vinegar-flavored. 5/5<br><br>The burgers are always juicy, a pretty big side, and always makes me feel super full.<br><br>The regular fries are okay, but my boyfriend really enjoys them. <br>The sweet potato fries are my favoriiiiiite fries I've ever had. EVER. They're a nice thickness, always tender, salty, and come with a dipping sauce. I don't know what it is, but I love it. 5/5<br><br>I've also tried one of the chicken sandwiches. I think the number six. The only thing I remember about it is it was disappointing, and I wouldn't order again. I haven't and I won't. 2/5<br><br>The grilled chicken salad is soooo gooooood! From the dressing, to the edamame, to the tortilla strips.. Wooo! My boyfriend and I have split this as an appetizer once or twice, and it's definitely delicious. 5/5<br><br>My dad has gotten a chicken and tuna wok out bowl before. They're okay, decent flavor, but I wouldn't say that's what Doc B's is known for. You should just get a salad and burger. You won't be disappointed, though I will say my dad was super disappointed in the tuna and preferred the chicken one. 3/5<br><br>I'm obsessed with their dragon burger and sweet potato fries, and it's always delicious so 5/5. It's nice to eat there, but I like eating in front of my computer while I watch something! ;) And delivery has only ever been disappointing once when they forgot the bbq sauce...", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2ZvgEZs3Y-8d0kxV_qtm6g/348s.jpg", "caption": "Dragon burger delivery"}]}}, {"review": {"des": "My Uber driver recommended Doc B's, so decided to check it out.  I was bow to get a table quickly as it wasn't too busy for a Friday evening. Started with the Crazy Beautiful which was very good.  I should've known it would come in a champagne glass.  Nonetheless, the drink was very good.  I decided to have the Crispy Changed Chicken sandwich for dinner.  I opted for coleslaw on the side.  I enjoyed Doc B's and would like to try more items on the menu.", "pics": null}}, {"review": {"des": "This place is amazing, especially for a casual lunch! I will say that the price point is high for burgers and sandwiches, but what the heck, it's well worth it!<br><br>I got the dragon burger with a side of elote (corn off the cob - off the menu side) - the burger was juicy, flavorful, and tasty, but the elote was amazing (and I'm a Texan)!<br><br>My fiancé got the crispy chicken sandwich with a side of fries. The chicken sandwich had coleslaw and sliced pickles on top and was to die for!<br><br>Overall a great restaurant, and I think another reviewer said Doc B's is coming to Texas, which would make me ecstatic", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SoyoK44hxg-szz2aCVXN9w/348s.jpg", "caption": "Front: The Dragon Burger with a side of elote; Back: Crispy Chicken Sandwich with a side of fries"}]}}, {"review": {"des": "Great location with a open layout.  The restuarant is also open to the outside so you can enjoy the outdoor. Service and drinks were good. My gumbo soup was different but it was the best I had. The wok bowl had quinoa, chicken and spicy thai sauce. It would've been good if it wasn't overly sauced.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1NyEG0F9A0_L1Vd8oX1SNA/348s.jpg", "caption": "Ahi tuna salad with sauces on the side"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/G2zwdZW1ZUWNtnVw9WV9pw/168s.jpg", "caption": "Fish of the Day: Cajun trout with steam instead of saute brocolli"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-tXwW0HSByJ9cp4R9aK-ig/168s.jpg", "caption": "Soup of the day: Gumbo"}]}}, {"review": {"des": "Great atmosphere! The food was wonderful and the staff attentive. <br>We both had the spicy chicken sandwich- it was very good. <br>Windows all open - weather was great. <br><br>Cocktails on point ! Highly recommend this spot.", "pics": null}}, {"review": {"des": "It's quite easy to go above $20, $30, or even more for dinner in River North if you're going to a nice sit-in restaurant. Fortunately, Doc B's offers a good number of sandwich and burger options which aren't exactly cheap, but they provide a good value for portion size and flavor in this part of town.<br><br>I tried The Homage and Crispy Chicken Sandwich here with fries and sweet potato fries. The burger was cooked to perfection here with a lightly seasoned patty and surprisingly crispy exterior. The meat was so flavorful that the onions and cheddar hardly distracted from the strong beef taste. The crispy chicken sandwich was probably even better than the burger. The large piece of chicken was breaded and seasoned perfectly then cooked to perfection where the juices from the chicken were contained nicely. The cole slaw was light and delicious and added great texture contrast to the chicken which was served with a delicious honey mustard dressing.<br><br>The fries and sweet potato fries were alright... showcasing the quality of the ingredient with light seasoning, although both could've been a bit more crispy. But the quality of the burger and the chicken sandwich already stole the show and warrants a return visit to this restaurant to try their other culinary delights.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VTD1kKUr2LNASH-uO8MWjA/348s.jpg", "caption": "The homage"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/F4cwXyLFhiwk5t-AM5al6g/168s.jpg", "caption": "sweet potato fries"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KkXZW9WDT8vTkUkrSWeqGg/168s.jpg", "caption": "Crispy chicken sandwich with sweet potato fries"}]}}, {"review": {"des": "I come here often but I had an exceptionally great experience this time. The food was fabulous and it always is-- it's very consistent and well priced. If you want a crowd pleaser this is the place to go. The options are classic American but everything manages to be unique down to the very ketchup which is a secret recipe version of Heinz. My boyfriend is an incredibly picky eater and this is one of his go-to places when we have guests in town. Wes was our server and he honestly made the meal that much better. He was incredibly knowledgeable and personable. The service could not have been better. Thank you!", "pics": null}}, {"review": {"des": "Had a great time here along with some awesome company. The service was fast and friendly and the food was really good. The burgers are fantastic and the sides refreshing and unique. Give it a go.", "pics": null}}, {"review": {"des": "Great ambience and prices. Turkey Burger was delicious and sweet potato fries were a nice touch.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sRUIj8-1oRTDhcfpxP4jLw/348s.jpg", "caption": "Turkey Burger with sweet potato fries"}]}}, {"review": {"des": "I usually hate going to the same place twice, but I break that rule with Doc B's over and over again. Food is consistent, healthy and quality. It is my go-to spot for a casual weekday meal, catching up with friends. Been going there for years and it is consistent. I always get the wok-out bowl and it is chock full with veggies, peanuts and your choice of rice/sauce. I am a fan of the thai sauce. Guac is also memorable as it comes with sweet potato chips - sold. Been here more times than I would like to admit, but can't beat the location in River North/adjacent to Nordstrom. Only complaint is floor is SO slippery, always. I mean, happy it is clean, but I've nearly wiped out on numerous occasions. :)", "pics": null}}, {"review": {"des": "Finally fresh, real food in Chicago! This place hit the \"real food\" spot! I had \"The Plate\" with quinoa salad, kale, artichoke, cauliflower, and broccoli. It was nourishing and delicious. My kids had the chicken sandwich and said it was the best they've ever had. The slice of house-made key lime pie we all shared was exactly what key lime pie should taste like. Our server was incredibly friendly and very helpful with our questions about gluten-free options. We arrived around 4:30 on a Friday and got right in but by 5:15 it was filling up fast. We are so happy we found this restaurant and all agreed it was our favorite meal we've had while visiting Chicago.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yg_yn0cDV6PwzIzydNiOuw/348s.jpg", "caption": "\"The Plate\" with kale, quinoa salad, cauliflower, broccoli, grilled artichoke and tomatoes. Very delicious and filling too!"}]}}, {"review": {"des": "We had a great waiter...he explained everything well! We want to go back. There is so much to choose from and I don't think you could go wrong with whatever you order. Excellent food!", "pics": null}}, {"review": {"des": "Ok, so me and my daughter just flew into Chicago and checked into the hotel. Both starving and worn out, and didnt feel like changing clothes. We were told to try Doc B's.  It was amazing! JOURDAN, our waitress/food expert, guided us through the menu with great suggestions and her opinions. She knew the menu and the food and believed in it like she cooked it. Great atmosphere,  great food, and worth the price. You taste the freshness in food. Sweet potato chips and guacamole to start, west coast steak w/ Mexican street corn, and some pound cake dessert with fruit that was awesome. Would definitely check this out, and ask for Jourdan, with a U, to take you through it all!", "pics": null}}, {"review": {"des": "Today was our first time here and overall it was solid. The visit didn't start out that well though. We had a 1215 reservation and showed up at 1213. When we checked in the guy who looked like the manager said it would just be a few minutes before our table was ready (which was fine!). <br><br>Then another woman comes up. I tell her we are a table of 3 and she says it'll be 30min. I told her we had a reservation and she said \"well we had a lot of new reservations this morning so we don't have enough tables\". Huh??  So I said \"well the guy over there said it would just be a few more minutes\" and she mumbled something unintelligible. <br><br>Then sure enough the guy comes back and our table was ready. It was very bizarre to say the least. <br><br>It was all uphill from there though. Our waitress was very sweet and attentive. We got the polenta fries for a starter. Very good!  I got the lobster roll special which was delicious. My daughter got the ahi tuna sandwich which she loved. My friend ordered the turkey burger which she said was great. <br><br>The tres leches for dessert was solid. Overall other than the random interaction at the beginning it was a pretty good experience!", "pics": null}}, {"review": {"des": "Conveniently located, right next to all the neighborhood hotels. Great menu, with lots of interesting items. Loved my dish, now if I could just remember what it was :-) I think it involved short ribs, and brown rice and shanghai noodles. Oh that's right, it was one of their bowls.", "pics": null}}, {"review": {"des": "West Coast Steak Sandwich was amazing with quinoa salad. Husband's carnitas sandwich also great with the thickest cut sweet potato fries I've ever seen", "pics": null}}, {"review": {"des": "We came from out of town with another couple from out of town. We had a reservation so we got to our table right away.  <br><br>Drinks: YUMMY!  The Internal Affair was amazing and then I got the \"Beet\"lejuice as it was recommended to me by our server. I was a bit skeptical, but it was the perfect summer drink.<br><br>Starters:  We shared the homemade guac and sweet potato chips which were very good.  The guac could have used some chipotle seasoning and salt to give it some kick and enhance the flavor, but the avocados were fresh so it was creamy.<br><br>Entrees: Everyone at my table had the Tennessee Hot Chicken except me.  My hubby let me have some of his and it was amazing.  The perfect blend of sweet and spicy.  I will say this is NOT Tennessee Hot Chicken, so if you are expecting the chicken you get in Nashville, you might be disappointed. This was more like a honey BBQ chicken with a kick.  But it had a good depth of flavor and was super crispy.  I had the Steak Frites and was disappointed.  The steak had a lot of sinew  and was not tender.  The portion was very small and so my plate looked empty in comparison to the rest of my party. I asked for medium and was given medium rare at best, so the inside was cold and not at all enjoyable. The fries were not hot and the portion small.  The best thing on the plate was the chimichurri, which was very good, but not enough to have some with each bite of steak.  The ketchup tasted homemade had a little kick to it.  In all fairness, I didn't send my steak back since the rest of my party was eating and I didn't want to interrupt the flow of dinner.<br><br>The service was excellent and knowledgeable.  I would go back and next time I would get the Hot Chicken.", "pics": null}}, {"review": {"des": "All I can say is don't order the artichoke hearts. They were really tough and oily. But luckily our waitress saw we didn't like them (plate was completely unfinished) and we weren't charged for them. But she took awhile to ask us how we liked it and our warm towels sat at our table for a good ten minutes while we stared at the artichoke hearts. <br><br>Their guac and chips were so so good! Sweet potato chips! Also, my black tiger shrimp salad was great, and my friend's fried chicken was SO good. The dark chocolate cake was really moist too. <br><br>Overall would recommend if you know what to order!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nHBUA4eGh1UV8vcNALw-Dg/348s.jpg", "caption": "Fried chicken, elote, and fries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UkefgL4Sx_esuzTjbI74ZQ/168s.jpg", "caption": "Bomb diggity chocolate cake with cereal crunch on top and chocolate drizzle"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/p6PX2rimMGu7jeGKsv3ZcQ/168s.jpg", "caption": "Black tiger shrimp with dressing on the side. Didn't have a lot of avocado but plenty of shrimp!"}]}}, {"review": {"des": "Gauc & chips. Amazing Moscow mules. Attentive staff-ours were from Ireland  <br>Key lime pie to die for.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bbuFccJvi6Ft-oWmnWrgBw/348s.jpg", "caption": "Chips & guacamole"}]}}, {"review": {"des": "Have been here twice now when working in Chicago. It's a good spot, but nothing over the top.  Service was great this last time.  First time visiting I got the pulled pork and there was a chip of bone in it.  Also, I thought the sauce was a little heavy and the sauce didn't wow me. This last time I ordered the Mr. Walton, and I really enjoyed the quinoa salad on the side.  The sandwich was good, but nothing spectacular.  The restaurant itself is nice as you can sit by the front on the a nice day when they have it completely open.", "pics": null}}, {"review": {"des": "I have been here a few times and really enjoy the food, it's fresh and clean, however a little noisy, hard to have a conversation. They have several TVs with sports on it, so I guess would be good to catch a game.. I come here for the wok bowl with seared tuna .. yummy!!", "pics": null}}, {"review": {"des": "A friend recommended this place so I wasn't sure what to expect.  I ended up going with the cajun fish sandwich since Yelp highlighted that as a popular pick.  It was definitely a good choice.  The fish was perfectly seasoned and made for a great sandwich.  Very flavorful without being overspiced or anything.  The fish tasted pretty fresh and it went great with their sweet potato fries.  The beer selection is pretty good here too.  Was able to grab a local beer that wasn't Goose Island (but they had that too).  Very satisfying restaurant for a quick lunch.", "pics": null}}, {"review": {"des": "This is one of my favorite places I went to on my trip to Chicago. <br><br>Tennessee hot chicken: A MUST!! The best dish we ordered. Its more of a sweet barbecue (sorta) flavor. When it came out, it was crispy, hot and delicious!!! You won't regret it!<br><br>Barbecue ribs:  The bones came out so easily. If you are craving ribs, this will definitely satisfy your craving. <br><br>The two dishes, chicken and ribs, will not disappoint you!<br><br>We also got a salad to share- the #1 Tuna Salad. It comes with ahi tuna and I was doubting the tuna would be fresh, but IT WAS!!! The salad came with a nice dressing and everything too.<br><br>I definitely would recommend all the dishes!!  And it is near so many stores, you can definitely walk around after to digest. :)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RvoRcZ9XZdxu7ZkiCurIJQ/348s.jpg", "caption": "Tuna salad split into two. It's called the number 1 tuna salad."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1emzEPcR6T_poZY78gf_LQ/168s.jpg", "caption": "Ribs"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/w8VP3gp6RL_rRUMSArWBhQ/168s.jpg", "caption": "Tennessee hot chicken"}]}}, {"review": {"des": "Great healthy food option while in downtown. Abundant items in the menu with some gf alternatives. Big and filling  portions, good service and casual ambiance (wish the muaic were better though). Would recommend it! Now I can have a Chicago hotdog for dinner:)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/e_ki39vbDLHUQ1cxlKO7Wg/168s.jpg", "caption": "Shrimp salad was bomb! The sweet potatoe fries are top."}]}}, {"review": {"des": "Generally I don't like much on this menu. but the grilled cajun white fish sandwich is always DELICIOUS. The sweet potato fries here are also great and I love the remoulade they serve it with. I crave this specific meal often, but the pizzas, salads, and wok out bowl are nothing to write home about, especially given the high prices. Not sure why everything here is so expensive, maybe we pay for quality ingredients?", "pics": null}}, {"review": {"des": "Been here many times because the food is excellent. Today, I came and the waitress had a disinterested mood, delivered my order and never saw her again, water glass sat empty for 20 minutes while I ate. This was at 5:15pm when the restaurant was half empty. Never came back to ask if the food was OK or if I needed anything else. Terrible terrible service! Only reason I would consider coming back is because the food is always good.<br><br>Hey manager, what the heck is wrong with the attitude<br>of your waitresses! Waitress on my check is Amanda L but I have no idea if that is actually her because I had three different waitresses over the course of my meal. This experience is Service 101 how NOT to treat your customers.", "pics": null}}, {"review": {"des": "Great food! Great service! They was nothing that we did not enjoy from the guac and chips to the meal and even the wine and beer. All amazing.", "pics": null}}, {"review": {"des": "I'll make it short and simple. Came here at night to grab a salad before they closed. The inside had nice setup was seated right away. <br><br>Tried the shrimp salad and really enjoyed it. Person I came with had the grilled chicken salad and that also was good. The portions for the salads are a lot so after I was finished with it I was really full. Definitely recommend trying this place", "pics": null}}, {"review": {"des": "In Chicago for 2 days with a 1 year old and a 2 1/2 year old. My sister and her husband (Branden Philps) watched our kids for a couple of hours so we can get some dinner; (yes, that is a semicolon) my wife picked Doc B's Wow!!!!!!! 10 out of 10. <br>We ordered off the happy hour menu, (before 6 pm) it was amazing. <br>1 Tennessee Fried Chicken <br>2 1/2 Rack of Ribs<br>3 Wok Out Bowl<br>4 Coleslaw <br>5 Quinoa Salad<br><br>Best chicken I've ever eaten <br>Solid Fall off the bone Ribs<br>The noodles in the Wok Out Bowl were\"Holy Sh#t\"<br>Coleslaw was great<br>Quinoa Salad was the greatest cold appetizer I've.............. just Wow!!!!!!<br><br>Our server Faith was on her game. Super friendly and she knew that menu inside out and backwards. <br><br>I would totally recommend this place and would definitely come back. <br><br>Great Job Doc B's", "pics": null}}, {"review": {"des": "I got the chicken wok out bowl and a side of fries. Everything was very well done and the flavors were amazing! Definitely would recommend the spicy thai sauce! It was chock-full of veggies and everything stir fried well. The fries were also perfectly seasoned and went well with everything. Our party got the guac to share and it was by far one of the best guac and chips I've ever had, full of lime flavor. I would definitely stop by again if I am in the area!", "pics": null}}, {"review": {"des": "Stopped in for later dinner around 9PM on a Friday night. No wait for table. I had the wok out bowl. Quick and courteous service. The food was very good and fresh. Would repeat", "pics": null}}]}