{"name": "doc-bs-restaurant-bar-chicago-3", "reviews": [{"review": {"des": "We stumbled across Doc B's after doing some damage on Michigan Avenue. Needless to say we were pleasantly surprised! Doc B's has a wide variety of menu options ranging from salads, to burgers, and even stir fry bowls.<br><br>Our server was extremely attentive, offered great suggestions, and made for an overall positive experience. Since then, we've come back to grab drinks and snacks at the bar, and for dinner several times.<br><br>I'm a sucker for their \"Number Six\" sandwich -- which is their take on the Wendy's spicy chicken sandwich. It's topped with honey on a buttered, toasted bun. I mean what more is there to say?!<br><br>Never disappointed -- highly recommend!", "pics": null}}, {"review": {"des": "You must try the guacamole and sweet potato chips. I would eat here again just for drinks and this appetizer. This place stays busy which means they must do a good job. I sat at the bar and ordered the Cajun chicken sandwich on a pretzel bun for my entree. Anything on pretzel bread is delicious in my opinion.<br><br>Service was good despite the busy, hustle, and bustle. I would eat here again.", "pics": null}}, {"review": {"des": "Doc B's, tucked away in an unassuming spot just off Michigan Ave., really took me by surprise. I ordered \"The Homage\" burger. The beef was seasoned and cooked perfectly. A light slathering of \"1001 Island\" dressing complemented the meat and slice of cheddar cheese very well. It was a no frills burger, but it was impressively delicious. The fries were nothing groundbreaking, but they were served with what I'm assuming is their house ketchup, which had just a hint of sweetness and another flavor which I couldn't pinpoint. It was a nice change of pace from the standard bottle of Heinz.<br><br>I really liked the restaurant's simple, modern interior. The service was great and the menu had a lot more to offer. I can't wait to visit again and explore the menu further.", "pics": null}}, {"review": {"des": "Loves:<br><br>the free candied bacon by the bars.<br>our server was super charming.<br>smaller, but well thought out menu.<br><br>Not so much:<br>$10 for a pint of beer :'oP<br><br>I got the Power wok bowl with black tiger shrimp ($17) was very good and filling. You have a choice of teriyaki or spicy Thai sauce. Going with the Thai sauce, every noodle was coated evenly, but I just wished it had more of a kick. You can tell all the veggies in the bowl was fresh, and all of them were cooked perfectly al dente where it still had a crunch to each bite.<br><br>Not a bad place to grab a bite to eat, sure to satisfy all different tastes as it did with our large group. The prices are what they are, you are in the Loop after all, so not so bad considering.<br><br>Our server was super chill and she was very attentive. None of that pretentious city attitude here!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wYiW3v5RsMZRbFf4kuzcOg/168s.jpg", "caption": "Power wok with shrimp"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FQupEbbmZcM1tQUg21_uQg/168s.jpg", "caption": "Free candied bacon by the bar!"}]}}, {"review": {"des": "Happened to be in Chicago and on a bit of a time crunch, we picked this place because it was the first place we saw on the way to our meeting. <br><br>The place was packed, had a great atmosphere, and definitely loud and bustling. Since we had never been here, I asked the waitress what is their speciality and she suggested the Work Bowls. We ended up ordering the Shrimp Work bowl and Tennessee Hot Chicken. <br><br>The Shrimp Wok rice bowl had fresh ingredients and had a great flavor, but should have ordered white rice instead of brown rice. Just personal preference. The Tennessee Hot Chicken is essentially a couple of chicken breasts with skin, fried and tossed in habanero honey sauce. It was surprisingly good, but could have used a little more heat, and the coleslaw was solid. <br><br>The place operated like a well oiled machine and service was pretty good for the lunch rush.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/17x95pouSbtWERO8CUeBXg/168s.jpg", "caption": "Shrimp Wok Bowl"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UKeygQONvU7SG59t68TymA/168s.jpg", "caption": "Tennessee Hot Chicken"}]}}, {"review": {"des": "I would give this restaurant 3.5 stars if that was possible on this site. I visited Doc B's during a family vacation to Chicago and it was slight above mediocre. The dishes that were ordered were the Tuna Sandwich, two Wok Bowls, and Grilled Cheese off the kids menu. The Tuna Sandwich and Grilled Cheese were both pretty good. The best part of the meal was the fries which were addictive and hard to say no to. The Wok Bowls however were quite weak. The chicken was overdone and the taste was simply just not up to par. I'd consider going back to Doc B's to try some other sandwiches or burgers and obviously eat some more of those amazing fries but I'd stay away from the Wok Bowls. Also I should point out that the service was great and servers were very attentive.<br>*Visited Sept/18", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mctUl8hBUoqw1fY-15D39w/348s.jpg", "caption": "Half eaten tuna sandwich with a roasted beer salad."}]}}, {"review": {"des": "I came here on a Friday night for dinner with my girlfriends. It was very easy to make a reservation a couple days before for the 4 of us. We were greeted by a friendly hostess and seated immediately. The ambiance in the restaurant is amazing! For a Friday night at 8:00 pm, it wasn't too loud or too quiet which is exactly what we needed. Our server took our drink orders right away. I ordered the \"Beet\"lejuice cocktail. It was amazing! The food was absolutely delicious and came out so fast! I ordered the veggie burger with a side of quinoa. One of my girlfriends ordered one of the salads with a veggie burger on top. (Highly recommend) Another one of my girlfriends ordered chicken sandwich and she loved it. The sweet potato fries are a must-have also! Overall, it was so good, we came back on Sunday to the river north location! I ordered the wok out bowl and again it did not disappoint. Service and food is excellent here and I will be back again and again. I have already recommended it to many friends! Thanks Doc B!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SFq8-MThqaxgRaQKiiXquw/168s.jpg", "caption": "Wok out bowl with chicken, lo mein and the sesame teriyaki sauce"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TFFFKEQFm5QU3rvzWAlsqg/168s.jpg", "caption": "\"Beet\"lejuice house cocktail"}]}}, {"review": {"des": "I love this cozy consistently awesome place. Our server, Calloway was professional and personable. The food selection was innovative and delicious. My favs were the turkey burger and guacamole with sweet potato chips. Oh and the cauliflower and quinoa sides were yummy too.", "pics": null}}, {"review": {"des": "I was in the mood for something semi healthy with a cute and nice atmosphere after the gym so I found this place (thanks to Yelp). I was seated right away by the hostess next to the window which is a prime spot for people watching. I ended up ordering the plate because I was craving something a little more than a salad. <br><br>The vegetables on the plate were roasted so well and cooked to perfection. They had a ton of flavor and were charred well. The kale salad and quinoa paired perfectly with the roasted veggies. The plate came with some type of aioli sauce which was delicious as well. <br><br>The service was also outstanding. The hostess greeted me and seated me right away, the bartender was very attentive, and I was in and out within a great time since I was so tired and just wanted to get home.<br><br>All in all this place is delicious and I highly recommend trying it out!", "pics": null}}, {"review": {"des": "Doc B's!!! <br><br>I've heard so many fantastic things about Doc B's, because it has been my boyfriend and his sister's go-to dinner spot for years. So when I was invited to experience it with them recently, I was ecstatic. There was a gorgeous patio seating area, so we asked for a table out there. If you can sit outside, do it!<br><br>Our server's name was Royce, and he had a really great personality. He accidentally dropped his receipts from the night at one point, and was a great sport about it while we all rushed to help pick them up. He was funny and had great recommendations, and I can't say enough great things about him!<br><br>Among some of Royce's recommendations were the specials for the evening, which included an Ahi Tuna Burger. I ordered it but changed my mind at the last minute to a Wok Out bowl with #1 Tuna, Shanghai Lo Mein, and Teriyaki sauce. I really wanted to try the burger, but I'm a sucker for a good bowl. Everything about this bowl was fantastic, especially the presentation and the way the tuna was cooked. The amount of teriyaki was just right, too, because Doc B's always serves the sauce on the side for the customer.<br><br>We all ordered drinks as well: I got a glass of Cabernet Sauvignon, which was so great that I ordered two, my boyfriend's sister got a mimosa (it was late on a Sunday, but Royce was 100% supportive!), and my boyfriend got a Two Hearted Ale. <br><br>The service, space, and menu were all impressive at Doc B's. I can definitely see why this is a hot spot in both the Gold Coast and River North, and why people who visit once come back again and again.", "pics": null}}, {"review": {"des": "Healthy food in Chicago is hard to find. After 2 days of meat, fried cheese curds, more meat and fried walleye, it was nice to find a restaurant with lots of healthy options. I had the fork and knife Cobb salad $16 and tasted the quinoa side salad. Both were good. Really more of a 4.5/5 but for Chicago, its a 5/5 for healthy fare. I thought the plating of the Cobb salad could have been better but I would definitely eat here again. Check it out.<br><br>Listed in Drive Across America: <a href=\"https://www.yelp.com/collection/4_4-FCUBHEQBq43u7DXRig\">yelp.com/collection/4_4-…</a>", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HBTN1Ob97ufM6094vegdfA/348s.jpg", "caption": "Local Belgian Style Saison"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TrS1PD7w8GBe7ubCArChzA/168s.jpg", "caption": "Quinoa side salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vojuegpKCvUpTAj5fGAe5Q/168s.jpg", "caption": "Knife and fork Cobb salad $16"}]}}, {"review": {"des": "I asked Hubs how was your burger...he said it was good...I said good or great, \"it was good\", so yay...he's had better.  The Brussels Sprouts salad was good, light dressing (which I like, I don't like it heavy and wilting the greens) a little cheese on it for the salty flavor...it was good, and big....a little pricey but most everything in downtown Chicago is.  The Wok bowl had good flavor, I ordered it with Filet Mignon....yea...no...they didn't use Filet mignon it was tough and over cooked and...well connective tissue - there I said it...yuck.  No one ever wants that do they?  Anyway it's ok but the Fake Mignon needs some work.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XB_HyNsT-tkUbxF9UEoRXw/348s.jpg", "caption": "Wok bowl"}]}}, {"review": {"des": "Have been curious about this place finally tried it. Heard nothing but good things about it. Seems pretty trendy, I would've dined in but an hour lunch flys by. The staff was attentive and helpful.<br><br>I ordered a wok bowl to go. I chose the bowl with chicken, lo mein and spicy thai sauce. The food took longer than I expected. I think it was a peak time on my visit seemed pretty busy. The restaurant decore and layout was nice. Anyway back to the food. Since I got to go I didnt eat it until I got to the office. The food looked delicious. The food tasted horrible. The chicken had an overly charred flavor. The lo mein was super gummy like over cooked or maybe under cooked. The entire dish tasted burnt. It was also under dressed for $18 this was not worth my money.<br><br>Overall, I recommend trying this at least once. I am not in a rush to return. This place is severely overrated.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oyKr3aeDN2jIR0WV3CGM5w/348s.jpg", "caption": "Looks better than it tasted"}]}}, {"review": {"des": "Open table had available reservation times but when I called I was told that open table did not take into account for their walk-in customers and that it would be at least 2 hours before we could be seated. I'm not sure how you can run a business that uses an online app to book customers and it not work correctly.<br><br>We ended up walking to Fred's @ Barney's New York right down the street, were seated immediately and had a wonderful dinner!!!", "pics": null}}, {"review": {"des": "Let me preface this review by saying I do not care for burgers. Doc B's Ahi Tuna Burger proved me wrong. It was juicy and flavorful with a perfect ratio of burger to bun.<br><br>This chain has \"healthier\" options than most restaurants. Clean eating foods, like quinoa, kale, tuna, avocado, and arugula populate this menu. I ordered the Tofu Tangled Noodle Salad. Thick Shanghai lo mein noodles, crispy tofu, a few mango and avocado pieces, plenty of cashews, mixed with mint and a peanut vinaigrette--- SO GOOD. The portions here are huge. So, if you aren't that hungry, I'd suggest an appetizer. I've also heard the California Salad is a crowd pleaser -- Avocado, pistachio, dried cranberries, wasabi peas & roasted sweet potato with kale & roasted garlic dressing! <br><br>Trendy and casual atmosphere. The staff dress code is all black. Despite the subdued work environment, the energy was warm and welcoming.", "pics": null}}, {"review": {"des": "I've been to the Doc B's in River North several times. It's a decent lunch spot. But on my first visit to the Gold Coast location, I was really let down.<br><br>Our server was nice. The ambiance is nice.<br><br>But...<br><br>I ordered the Tennessee Hot Chicken ($25). First off, it takes a long time to get this. In my case, there were other people ahead of me who had ordered the same dish, so I had to wait a little longer. Fine, no big deal. The dish sounded awesome, so I was willing to chill.<br><br>But...<br><br>When I finally tasted it, I was horribly let down. $25 for this? It wasn't anything special. Where was the habanero-honey glaze? There was something on the outside, but it had no flavor. It was just like eating a flavorless grease slick.<br><br>I wish I would have taken my $25 and walked over to Chick-fil-A because that fried chicken is actually delicious and their sauces taste like something.<br><br>Just take this thing off the menu, Doc B's. It's a total disaster of a dish.", "pics": null}}, {"review": {"des": "My boyfriend and I stumbled upon this place for dinner and let's just say, Doc B's definitely did not disappoint. We visited on a Thursday night with no reservations and were seated right away at one of the booths. It was pretty packed and the ambiance was energetic!<br><br>Our waitress was very friendly and let us take our time deciding what we wanted to order. She gave a couple suggestions, her top one being the Tennessee Hot Chicken so I decided to go with that and my boyfriend ordered the Forester Farms' Pan Seared Chicken. <br><br>I'm usually not a fan of coleslaw and I don't usually order fried chicken but this was definitely one of the most delicious entrees I've ever had. The portions were huge! My chicken was perfectly crunchy on the outside but so moist on the inside, just how fried chicken should be! The habanero-honey glaze had just the right amount of kick to it. I ate the coleslaw with a bite of chicken and it balanced it out perfectly with the spice. My boyfriend tried mine and really loved it! Also, his chicken was absolutely delicious. He ended up finishing the entire plate.<br><br>For dessert, I ended up getting the chocolate cake. Usually, they're too rich and dense but it wasn't at all! This cake was fluffy and chocolaty and wasn't too filling which I enjoyed. It had a wafer topping that added a bit of a crunch which was nice. <br><br>Overall, this meal was one of the best meals I've had in awhile. If you're looking for a laid back dinner with fantastic food, I'd definitely recommend stopping by Doc B's!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pPJykLmyj9IhduFn-Xp0Tw/168s.jpg", "caption": "Rob's Double Decker Chocolate Cake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ws2RjV2NQhf91S9qz1wXZA/168s.jpg", "caption": "Tennessee Hot Chicken"}]}}, {"review": {"des": "Wow! We accidentally found this place while looking for a place to eat. Had the turkey burger with sweet potato fries. Seriously one of the best lunches I can recall having. The inside of this place is modern and clean, worth the $16!", "pics": null}}, {"review": {"des": "Obviously they do not need my review, just look at all the others! <br><br>I was in Chicago for business staying at the Four Seasons, it was cold and windy and I couldn't walk far. After walking a block, Doc B's Fresh Kitchen looked like it would fit the bill. <br><br>It was just me, so I sat at the bar. The staff was friendly and they made a great vodka tonic. I ordered the dragon burger.... maybe the best burger I've ever had. The fries were great as well. As was the cheese cake I had for Dessert. <br><br>I noticed when I was there the amount of people coming in and picking up carry out. Apparently they do have great food. <br><br>Only downside, it was kind of small, but had great decor. If you're looking for good food I would try this place. Wasn't the cheapest place, but downtown Chicago what is.", "pics": null}}, {"review": {"des": "Great hip spot in the heart of the miracle mile. Food was amzing and service was good, but the food spoke for itself. Vibes were nice and decor was a night life feel but with awsome food. Had seating both inside and outside on the sidewalk. Would definitely recommend this place, next time im in the Chicago area, i will definitely make a stop here for lunch or dinner.", "pics": null}}, {"review": {"des": "Great service.  Food served hot. Seated a lone diner.  Attentive service even with a lot of traffic.  Had the Wok Out with brown rice.   The fries were fresh cut.  I wish I could find a place like this back home.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/S_UAPewyGXTwIApJr7YQbA/348s.jpg", "caption": "Great spot for a delicious healthy meal"}]}}, {"review": {"des": "Grabbed dinner with my boyfriend and three other of his friends. We enjoyed some drinks and conversation for a few hours while ordering some delicious healthy food.<br><br>Started off with guac and sweet potato chips; surprisingly delicious. The table ordered chicken bowls with spicy Thai and quinoa/ lo mein. Those bowls are so good! Reminds me of flower child in Austin, TX. <br><br>Will be trying to recreate them for my lunches to work!", "pics": null}}, {"review": {"des": "Tuesday for lunch<br>Nice server, hip atmosphere<br>Artichoke app: 4 artichokes for you to rip apart and devour the flesh, quite tasty<br>Veggie sandwich: pretty bean-pasty, liked it<br>Corned beef sandwich: hard to eat as corned beef was ball in middle and it all sort of squeezed out when you bite into it, but tasted good<br>Cole slaw: quite tasty, the slaw was cabbage-y and the sauce was thick/not low-cal but tasted good<br>Overall we had a good experience and my wife gave the complement that the calories were worth it", "pics": null}}, {"review": {"des": "I'm a fan. A bit pricey, but what do you expect for Gold Coast? The food however is all high quality, unique, and very tasty so I don't mind splurging every now and then to get a fresh meal. This location always seems to be busy with in restaurant traffic and carry out orders. It's a lively atmosphere and a great crowd.<br><br>My favorites here are the knife and fork Cobb. The dressing is tangy and slightly sweet and the cornbread croutons are pretty perfect. Other standouts here include the kale and Marcona almond salad and the wok out bowl. I wouldn't hesitate to recommend this place to anyone in the neighborhood and looking to get some reliable and delicious food.", "pics": null}}, {"review": {"des": "Wow! This place is a gem. Just off Michigan Ave, Doc B's menu is loaded with healthy plates disguised in magnificent flavors and colors! I highly recommend The Plate and the California Salad. My son had the Backyard Burger (and the waiter convinced him to order the cauliflower as a side instead of fries), which he loved!!<br><br>Staff was really friendly, especially our waiter Toby, who was one of the best waiters we've had in years. If you're looking for a delicious, healthy option in downtown Chicago, Doc Bs is the spot.", "pics": null}}, {"review": {"des": "Where to eat after a day of intense Black-Friday shopping on the Mag Mile?  Doc B's Fresh Kitchen works for me!  <br><br>1/2 block off the Mag Mile, Doc B's came highly recommended, and didn't disappoint.  This Gold Coast restaurant was noisy and crowded, (in a good way).  We were all famished and lucky to get one of the last tables.  <br><br>My wife had the West Coast Steak Sandwich.  The kids each had burgers (Dragon and Homage).  I had a Wok Out Bowl.  Everything was delicious, but the star of the meal was the West Coast Steak Sandwich.  It was tender and had great flavor.  <br><br>Service was very good.  I typically don't review chain restaurants, but at this point they only have five locations, so I don't really consider it a chain.  If you happen to be in the area, you should give Doc B's a try.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/T7Z3vG2RjXtMpB8Q2mCxrw/348s.jpg", "caption": "Wok Out Bowl was delicious and semi healthy!"}]}}, {"review": {"des": "This was a surprisingly great meal, nice cocktail and dessert. Waiter was attentive but not overbearing. We didn't feel rushed", "pics": null}}, {"review": {"des": "Stopped in for lunch... really great! Great service, great food, great ambiance. Make sure you enter through the street, the 2nd entrance is like some weird hallway scene from the movie Hostel. They make a bar snack called \"bar bacon\". Sorry Birkenstock wearers it's loaded with carbs, not gluten free, not organic and happily not Vegan! Let me describe it as this, I would gladly appear on my 600lb life if I could get the recipe. Sorry table diners you have to sit at the bar if you want to be in the Bar Bacon Club... which coincidentally I started. We sat at the bar (obviously) and were taken care of by Allie, Alley, Ali... just guessing her name spelling, but she was great!", "pics": null}}, {"review": {"des": "If I could give this place 0 stars, I would. The only 1 Star it deserves is for its ambiance. <br><br>Basically if you're a person of color, do not come here. Our waitress ALEXANDRA neglected our table that was 2 feet away (and in between) both of the other tables she was serving. We sat patiently as we saw her constantly going to the tables next to us back and forth asking if they needed anything/were ok. I'm not exaggerating when I say that once our food came out, she made it a point to not come near us. <br><br>My friend and I are both Hispanic and we instantly felt discriminated by this waitress. Not only did she not come to our table to check on us but she would make eye contact, give us a look and move on to the tables next to us, who were Caucasian.<br><br>Eventually, the only reachable person near us was a manager who we flagged down and asked for a refill on our waters and the check, merely because we could not stand being there anymore. Another waiter came by with that request. I put my friend's card and my card down on the bill and our waitress Alexandra came again, didn't say anything, and snatched the bill from our table. Usually waiters tend to ask how you want the bill split or if we're all good to go. NOPE, not at this place! <br><br>Alexandra came back with our receipt, then proceeded to lift our plates from the table, WITH HALF OF OUR PIZZA LEFT ON IT, and said \"oh are you still working on this?\" What???!! I would've understood if she asked that before lifting our plate up but no, she didn't. <br><br>We came visiting from California and this was #1 the worst thing we experienced here. Definitely treated differently than the other customers inside who were Caucasian. So once again, if you're a person of color, DO NOT COME HERE. And make sure you do not get Alexandra, she is extremely rude.<br><br>If you're looking for a place to eat or catch a drink, I instead recommend going to Kings Sports Bar and Grill in Rosemont!! They actually have diversity there and everyone gets treated the same. Shout out to them and their kind waiters for saving the night!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3dr9xA-yc_VWt3jiDcXBhg/348s.jpg", "caption": "DONT COME HERE IF YOURE A PERSON OF COLOR AND EXPECT TO BE TREATED LIKE EVERYONE ELSE"}]}}, {"review": {"des": "Overall not a great experience. I ordered the chicken wok out bowl for delivery. I was initially turned off by how expensive the dish was - $18. But i figured if it is really good it could be worth it. I was sadly disappointed. I ordered the bowl with the lo Mein noodles and the sweet teriyaki sauce. The bowl had a very bland taste and needed either more sauce or generally more flavor. There were pretty few veggies and the chicken tasted charred. I would not recommend this item on their menu and it is definitely not worth the price.", "pics": null}}, {"review": {"des": "We visited Doc B's on November 17. We had reservations for an 11:45 lunch while shopping the Magnificent Mile. We were seated quickly and our server was helpful, speedy and polite. The Bloody Mary I ordered was very well made and the spices perfect. My wife ordered the Carnitas sandwich with sweet potato fries. The carnitas were cooked perfectly and the sweet potato fries were crisp on the outside and creamy on the inside. Topped with kosher salt, it was great. I had the Wok Bowl with chicken and sticky brown rice. The vegetables were cooked just right and the chicken was very delicious. I also had the cucumber salad with onions and radish which was phenomenal. The atmosphere is cozy and the staff were happy and talkative.", "pics": null}}, {"review": {"des": "Great food! Gluten free options. Matt was our server and he was amazing! I'm visiting from LA and this place is something we don't have in LA. <br><br>A new fave for me. <br><br>Kale salad was delish and my Cuz loved the Abi sandwich.", "pics": null}}, {"review": {"des": "Great place for happy hour! They had plenty of seating and a super spacious bar area with stool/table set-up & standing area. <br><br>The burger I had was tasty, the fries were addictive and the wings weren't bad as well. It's great that they have such a budget/friendly happy hour. Bill for a beer, burger,fries & wings was just under 20 smackers..noice", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EoBjvnA2sAmLMNTvflHNZA/348s.jpg", "caption": "Bill was a thing of beauty. I shed a single tear"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/U3Wnwe_gnpd5bNrHvR1VgQ/168s.jpg", "caption": "Oven Roasted Chicken Wings bc hey..they're chicken wings"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/45yf7Y4JEKM6ATbdalxshw/168s.jpg", "caption": "Happy Hour Homage Burger & French Fries Awww Yeah!!"}]}}, {"review": {"des": "Can't say enough good things about this place. From the food to the waiters, always a great experience. We've been coming here for years. Was there this last Saturday and my tuna salad was outstanding. The presentation was just really sweet. These are other great things on the menu like the chicken appetizer, California salad, Chicken Teriyaki with noodles is outstanding. I can keep going on and on but you'll have to go and see for yourself. Btw.... the waiters never ever look like they're having a bad day. So nice!!!", "pics": null}}, {"review": {"des": "We had friends come to Chicago for the first time from Michigan, and this was my best friends choice! Overall, this was a solid 3. We had a party of 5, with reservations, first we had to wait another 10-12 minutes outside of our 6:30 reservation to be seated. Once it came time to be seated, they tried to seat a 5 person party, into a 4 person booth, with one in our party being a big former football player. No go! With that being said we were told we were being moved to another table, where we had to wait for a party to finish their dinner, causing another 10 minute wait. With waiting to be seated, we had already been there for at least 40 minutes, and again this was with reservations. <br><br>The food was good, but it was not over the top. We had burgers, with two in our party having Thai noodle salad. Burgers were good, loved The Dragon burger was awesome! The Thai noodle salads were just ok..nothing to write home about.<br><br>The service. What a run around. The table seating was an ordeal! The host was scatterbrained to say the least, we had to ask about being seated numerous times, with him getting our party size confused from 5 to 6 people, but yet they insisted on sitting us at a 4 top. He truly became annoying to deal with. <br><br>Our server was pretty good. The app came in time, with the entrees following soon after. Waters and other drinks were attended to promptly. We ended the evening with a slice of Key Lime Pie, which was good, but not great.<br><br>The interior was a bit dark and small. Overall, this was a place we would not seek out again. It was a good introduction to dining in the Mag Mile area, but again, nothing to write home about.", "pics": null}}, {"review": {"des": "Doc B's is a great restaurant if your in the Gold Coast Area of Chicago looking for great food with nice portion sizes. I came here for brunch and loved it from the get. The restaurant is up a flight of stairs with a very modern look and feel to it. <br>The hostess staff is very friendly and got us seated within minutes. It was a bit noisy with the tables being very close to one another, but with the weather outside being hurricane like, I was glad to be indoors", "pics": null}}, {"review": {"des": "Normally I would give 5 stars for the California salad and slice of key lime pie. Unfortunately, the key lime pie was not on point this time around. Soo disappointing. I stopped in on my bday for a treat.", "pics": null}}, {"review": {"des": "Me likes this place so much I temporarily lose me ability to write properly. Despite me MSJ degree from Northwestern me tastebuds are messing me head up.  Yummy. Yummy. Yummy.", "pics": null}}, {"review": {"des": "Ahhhh-mazing! We were seated right as a few large groups came in and consequently were inadvertently forgotten about for about 7 minutes. When we located a server, Chanel, she was so apologetic and bent over backwards to make the rest of our dining experience exceptional. The Manager promptly brought out an order of Guacamole and Sweet Potato Chips on the house. The guacamole was fresh and delicious, the sweet potatoes were a little softer than I'd like, but were seasoned well.<br><br>We ordered the house salad, which had delicious freshly made cornbread croutons and lots of yummy crunchy veggies. The Wedge Blue Burger was soooo delicious, and the Not your mother's tuna sandwich is an experience not to be missed! Their sweet potato fries were the best I've ever had; thick, well seasoned, hot, and great dipping sauce to accompany.<br><br>Overall great atmosphere, delicious food, and exceptional service and management. Well done!", "pics": null}}, {"review": {"des": "Can bar food be farm fresh??  Heck yes, at least in this place.  Have to admit I didn't know Doc B's existed before we walked by, noticed the game on, and came in.  Drinks, apps, burgers were all amazing leaving us crazy full, which is unfortunate given the killer deserts we saw passing by us.  As fantastic as the meal was it was the service that stands out.  The staff here works like a well choreographed troop.  Never had to ask for anything.  Definitely recommend a visit here!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oXYGEDMEmFO6iXE1XamBvg/348s.jpg", "caption": "Backyard burger...mmmmmm"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/S2F8UjBnmPUf4-9dPMvTew/168s.jpg", "caption": "Internal Affairs: Spicy margarita"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/X1KdE_5VFA4JkBC8zz6bXQ/168s.jpg", "caption": "Wedge burger...so freaking good"}]}}, {"review": {"des": "Everything from the food to the service was great here. Although my friend did find the salmon entree to be rather small, I would go back in a heartbeat if I ever visit Chicago again. Their crispy chicken sandwich blew me out of the water. I wish I was starving when I went so I could have gotten two orders of it! Their coleslaw combination with it was delicious! We got our food pretty quickly and the employees were all very friendly.", "pics": null}}, {"review": {"des": "Recommended to have lunch here by my hair stylist at Mario tricoci which is right across the street at 900 n Michigan ave . She said it's fresh ,flavorful and healthy food that is amazing !<br><br>Boy was she right .. this place was busy but we were able to get a seat inside right by the huge open window (think a garage door that opens )... the staff was so friendly !  The food was super fresh and flavorful and anything can be made vegetarian ! (Yay) I had trouble choosing so I'll definitely be going back so I can work my way through the menu .<br><br>*Star sighting as well as Yaz from the show Empire was here with his entourage as well which made for an interesting experience *", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2S_2Uft9TFZ6fFf8Ac53Tg/168s.jpg", "caption": "the crazy beautiful ... elderflower ,pear,vodka and sparking soda"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fCNsJa7S65O42NOYBKcYGg/168s.jpg", "caption": "Homemade black bean/beet veggie burger with kale slaw"}]}}, {"review": {"des": "Yummy and convenient lunch in the gold coast area.<br><br>My friend and I split the wings appetizer with the chimichurri sauce and the quinoa kitchen salad. The wings were SO tasty - crunchy, a little spicy, super flavorful, and the chimichurri sauce was the perfect complement.  Quinoa salad was delicious as well, great balance of flavors and textures - with marcona almonds, chickpeas, feta cheese and radishes.  <br><br>Space was clean and inviting, and service was quick and good! Overall a nice spot to pop into for a quick and easy meal if you're in the area!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9YoTuB5_xKoytHmjnmBp5g/168s.jpg", "caption": "Delicious wings!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FHWBcwCbfC1xznPkUK_gmg/168s.jpg", "caption": "Quinoa salad"}]}}, {"review": {"des": "First time at Doc B's today! <br><br>Grabbed a quick bite for lunch -- surprised they weren't filled up at 12PM on a weekday, but who knows?! Doc B's is conveniently located in the Gold Coast neighborhood right by LSD and Michigan Ave. You won't miss it because the exterior of the restaurant was super cute! <br><br>The menu had just the right amount of options. I couldn't choose between The Number Six or the Black Tiger Shrimp Salad at first... but I ended up going light with the salad! The salad had a BOMB avocado vinaigrette, but I wish my salad had more than 3 cubes of avocado! :'( The peppadew is perfect if you're not a big fan of regular peppers -- and mixes well with the dressing! Overall, the salad came in a big portion and fills you up if you're looking for a quick and healthy lunch!<br><br>I'll definitely be back to try The Number Six next time!<br><br>----<br>Edit: I had The Number Six and I LOVED IT! Crispy, tender fried chicken served with pickles & a side of Dijon! My server Matthew was super attentive and hilarious - made me enjoy my time at Doc B's even more! DEFINITELY WILL BE MY GO TO LUNCH SPOT! YASS to Doc B's and YASSSS to The Number Six!!", "pics": null}}, {"review": {"des": "A nice place. Good location. Waiter Mark was very good. <br><br>Fries were too peppery. Also an odd taste in the ketchup. <br><br>But good selection and good quality.", "pics": null}}, {"review": {"des": "Gold Coast is, quite possibly, the worst location in the city to be starving and on a budget (BUDGET). Doc B's was our happy solution on this global warming non-summer night. <br><br>We ordered the veggie burger, shrimp salad, and guacamole and all were delicious (and filling) great options for vegetarians and pescatarians! <br><br>I will agree with previous reviewers on the overpriced menu (did I say BUDGET). But, they have to compete in their area and make rent so...I guess I can't be too upset. <br><br>Would come back - service was great!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IX64bAKNJ2t7iF8M4P4Olg/348s.jpg", "caption": "Guacamole and sweet potato chips"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SyljJf8d_Ia2ivLsmh0XEg/168s.jpg", "caption": "Black tiger shrimp salad"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/is8luB2Gl5MAgKuqNXd4Mg/168s.jpg", "caption": "Veggie burger and elote"}]}}, {"review": {"des": "We went here tonight for the first time.  The restaurant is small and I would imagine gets very busy at peak times.  We were fortunate enough to catch the last few min of happy hour.  Happy hour has some great specials.<br><br>I initially ordered a  drink on their menu that had \"beautiful\" in the name thinking from the description I would love it... I didn't ... at all.  The server noticed this and immediately asked if they could replace it with something else.  That type of attentive and proactive service will bring me back to a place again & again.<br><br>We order the Wok Out and crispy chicken sandwich.  The wok out had just the right amount of spice with a generous amount of chicken.  The sandwich was topped with some delicious slaw that oozed freshness. For the side, I got the quinoa salad that was fantastic.  All in all, we will return!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fZvZSqtmKRqlx0VeKn6SWQ/348s.jpg", "caption": "Crispy Chicken Sandwich with Quinoa salad"}]}}, {"review": {"des": "Wok out bowl was another level good! Please Believe the hype!! Best meal I ever had from uber eats ! I added shrimp & salmon with the spicy Thai sauce! Good AF!", "pics": null}}, {"review": {"des": "Menu good and ambiance sleek but warm.  Service nice but kitchen slow with order incorrect for me at dinner.  Easy spot though for meeting as overall noise not so bad for a warm summer night.  Would rather come back for bar and appetizers next time as bourbon line up here looks great.", "pics": null}}, {"review": {"des": "I'm glad we had dinner here tonight. This place is great . Love the food, good service and the food comes within 10 minutes, you don't have to wait for so long unlike any other restaurants. So what's not to like.<br><br>We had a great experienced and our server acknowledged that it is our first time dining in here. <br>We had organic chicken wings, California salad with salmon (my husband loves it and so do I), wok bowl shanghai lo mein with tiger shrimp and veggies and for dessert we had chocolate cake (it is moist and delicate) serve with a complimentary glass of milk. <br>Everything we had is so good . We are very please and satisfied with the food and the service as well.<br>I highly recommend this place.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kbeJFOifphMc61pf-YdTIw/348s.jpg", "caption": "Chocolate cake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mXXO5o0KzLtPbpA-dkLqew/168s.jpg", "caption": "Wok bowl with tiger shrimp"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VcVj4GxTGyVxPNrRpY_ZeA/168s.jpg", "caption": "California salad"}]}}, {"review": {"des": "This place can be incredibly slow. 30-40 minutes to receive your food is too long for a burgers and fries sort of place like this. Also, if there's a crowd, expect to be rushed by the staff. In fact, for only the second time in my life, I was asked by the maitre d', who came to my table, to get up and move out because they needed the table. And I'd only had my plate in front of me for about 20 minutes. Inexcusable behavior.", "pics": null}}, {"review": {"des": "I had the day off work so I decided to meet up with the fiancé for a quick lunch near his office. Being the good Yelper I am, I quickly hopped onto Yelp & OpenTable and got us a table at Doc Bs for our last minute lunch decision. <br><br>We both ordered salads. I got the #1 Tuna Salad, while Jordan stuck with the more classic, Knife & Fork Cobb. I'm always on the lookout for Tuna/raw fish at restaurants, but I was disappointed with this dish... especially since it's advertised as \"#1\"! The portion of tuna is decent, but it wasn't as fresh as I was expecting. The salad had good Asian flavors with its ginger dressing but it tasted like a side salad at a Japanese or Korean restaurant (the ones that come for free with the meal), but this one came with a hefty price tag! <br><br>If I had ordered the Cobb salad with Jordan, I think my review would have been 4 stars, so maybe it's my fault. I really liked this Cobb salad. The chicken was moist but crispy AND then the avocado, bacon and croutons were all on point. The croutons were lush, garlic-y thick pieces of deliciousness! I made a trade halfway through the meal and we were fighting over the dish until the very last crouton was devoured! <br><br>For the price, it seems underwhelming, but if I could do it over again, I would jump at the chance to get the Knife & Fork Cobb Salad!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/t8Nuo9lq_WdnkV9c_QALPQ/168s.jpg", "caption": "The Internal Affair"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fx2f9OkmFmAf0gN_F7KZoA/168s.jpg", "caption": "The #1 Tuna Salad"}]}}, {"review": {"des": "Amazing food. They even have gluten and dairy free buns and fries. <br>Would definitely go back.", "pics": null}}, {"review": {"des": "Had a great lunch here.  Menu has lots of healthy tasty options.  I had the soup of the day, which was butternut squash, and the California salad, which was basically a mountain o' kale.  Both were very good although I would have liked a little more avocado in my salad, I only found a few small chunks.  Service was friendly and quick.  Great place to grab lunch or dinner in the Gold Coast neighbourhood.", "pics": null}}, {"review": {"des": "Whenever I am in the Gold Coast, I worry about spending $50 on a nice dinner. That will not happen at Doc B's. This place is my favorite, any meal you get here will be decently priced and delicious. I love love love the 'Knife & Fork Cobb' (pictured). The dressing is so good and I clean the plate whenever I get it. Wok Out bowls also rock. OR the 'Number Six' is a great chicken sandwich. They also make decently strong drinks, which is important to me lol. Service is excellent.<br><br>Pro Tip: If you sit at the bar, you will get to die for 'candied bacon' as a free treat while you wait.", "pics": null}}, {"review": {"des": "Flew into Chicago in late afternoon on a business trip and was in that awkward period of time between lunch and dinner - but was starving. I walked a few blocks from the hotel and saw a ton of food delivery guys entering and exiting this location of Doc B's ... figuring this was a good sign, I stepped in.<br><br>The menu looked delish! It was hard to choose but I settled on the ahi tuna appetizer and a tofu rice bowl. They were quick and wrapped everything up nicely for takeout, which I carried happily back to my hotel room.<br><br>When I opened the bag and containers, all I can really say is WOW.<br><br>First, the portions were huge. The appetizer alone was a meal! Second, the food was AMAZING. Despite the portion sizes, I ate it all ... ALL. Every last morsel, and regretted none of it, it was that good! <br><br>All I can say is, when are you guys opening up a spot on the East Coast?! I'll be first in line!", "pics": null}}, {"review": {"des": "Believe the hype! This place was great! Checked in at the Drake and walked over. Creative menu, helpful staff, cool design, solid portions, excellent food, fair prices, strong cocktail program. Will be back next time we are in Chicago!", "pics": null}}, {"review": {"des": "The food and service are outstanding here! We loved it so much we came for lunch two days in a row. <br>Our server, Toby, was exceptionally helpful in deciphering the menu. Very accommodating as well. <br>The have a dish called The Plate. OMG, it sounds so boring but it is the most delicious veggie plate ever! Everything was well-seasoned and the portions were huge. Seriously good, and not just for vegetarians. <br>My husband had the Cobb and loved it. <br>Veggie burger is good, though not exceptional. <br>Quinoa salad is fantastic and could be a whole meal. <br>Only negative--and MANAGEMENT, I'm talking to you--it is fucking freezing in the restaurant. On these chilly autumn days, turn the air conditioning off!", "pics": null}}, {"review": {"des": "Wow!  This place was suggested by the hotel. The carnitas was incredible.  The right mix of BBQ goodness and wonderful coleslaw crunch. The o-ring really topped it off. <br>A little pricey, to be expected downtown. <br>Atmosphere and service was on point. <br>Definitely a place to bring a date or your SO.", "pics": null}}, {"review": {"des": "Doc B's was true to its name, every ingredient tasted fresh and was ultimately delicious. I had the gumbo to start followed by the Cobb salad. The gumbo was heavy on the gravy taste, and light on the authentic NOLA experience, it was still very tasty though so don't be deterred just don't order it because you \"love gumbo\". The Cobb salad was legitimately one of the best salads I ever had, the accompanying honey fried chicken was a great touch too and it actually tasted healthy! Much more deliciously lightly breaded than actually fried.<br>The honey vinaigrette was also amazing! It was a perfect portion as well. The service was prompt and very friendly. It's somewhat pricey but nothing rare for where it's located. Definitely recommend for the health conscious with a picky taste palette.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vYUtB7tR7wABCIKjLvSJ3w/348s.jpg", "caption": "This is my kind of salad!"}]}}, {"review": {"des": "I enjoy a fresh clean taste. I ordered the Wok Bowl with Tuna. One of my favorites. The staff is friendly and attentive. Not a big fan of some of their seating. I will definitely try something new next time. I hear their Veggie Burgers are pretty good..", "pics": null}}, {"review": {"des": "So glad we stopped by!!  The food, the ambience, our waiter, everything was perfect!!  If you're in the city definitely check them out you won't regret it!!  Michael L with the great service for the Win tho!!  I'll be back soon!!  Also the IPA was on point forgot the name of it but delicious!!", "pics": null}}, {"review": {"des": "Delicious food, good service, nice environment!<br><br>I highly recommend asking for the soup of the day, also order guacamole with sweet potato chips and artichokes for starters and as main dish any of the bowls or if you are being careful with calories anything with tuna is amazing!", "pics": null}}, {"review": {"des": "Simply OUTSTANDING!<br>Service, food, atmosphere all a pleasant surprise when me and Wife-e-pooh popped in for a quick lunch. Highly recommend if looking for a casual and yummy dining experience. <br><br>Thank you Jourdan for the the wonderful service and to manager Mark for listening to me GUSH about my experience. <br><br>Please come to Detroit/Ferndale!", "pics": null}}, {"review": {"des": "I adore this place! Tried it for the first time a few years ago, but I knew I would be back when coming to visit Chicago. <br><br>The service is stellar and the waiters are so friendly. The food is amazing! When you read the menu, you really don't know what to order because everything sounds delicious. The fried chicken sandwich is out of this world!!! The avocado pizza is a must and the butternut squash soup is the best you will ever have. <br><br>I continuously want to try to new things, but can't get enough of the above items. This is definitely a great lunch/dinner place and it's right in the middle of the city. You won't regret it!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gFpzHMw8K-pkl_9IkxDr2g/168s.jpg", "caption": "Avocado Pizza"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/T5jipDKHNbGCSnXCbMznTQ/168s.jpg", "caption": "Butternut Squash Soup"}]}}, {"review": {"des": "Okay so where do I begin.... BOMB happy hour. They have a spicy chicken fried sandwich that's perfect meaning not to much sauce and just enough fried. Like it's not over powering. I've tried both of their happy hour drinks... and can say the beetle juice is freaking awesome!!! Like next level. I'm faded not going to lie  oh, and the people are nice and welcoming. This woman just tapped me and told me I was beautiful. Like how nice!!! I'll be back everyday.", "pics": null}}, {"review": {"des": "Food variety choices was good. Food was good. Staff was good. Everything was good! I didn't see a change table in the washroom so not sure it's baby friendly. But there are TVs and loud music so it would mask toddler meltdowns. The house made guacamole was really good.", "pics": null}}, {"review": {"des": "Doc B's is a nice cozy off the beaten path place to eat lunch or dinner.  The food is fresh and reasonably priced. I had the soup of the day corn chowder and my husband and I shared a turkey and cheese sandwich.   Just plain old fashioned good food.  I highly recommend that you make a reservation; it gets pretty crowded; a popular place for locals.", "pics": null}}, {"review": {"des": "Very good food in a lively atmosphere. A happening lunch spot. The food was delicious and very fresh. I had a salad and it was crunchy, tasty and filling. I went with two other gals. One had beef, and the other had chicken. All were good to the last drop.", "pics": null}}, {"review": {"des": "I've never had a bad meal here and ALWAYS order the grilled artichoke - lNo matter what location I'm dining in. We popped in for a birthday dinner and enjoy burgers and wine. We were seated promptly, I had the wedge burger for the first time ( I usually order the turkey burger) and my friend had the Backyard burger. Every thing was outstanding including our service! Always a go to spot for me when running around this city. I describe the atmosphere as an upscale sports bar because they have TV's but it's a more classy joint .", "pics": null}}, {"review": {"des": "Dropped in for a quick lunch after checking into our hotel nearby. Great menu with lots of variety and options for everyone. I swapped chicken for the shrimp in their tiger shrimp salad and had basil vinaigrette - BEST SALAD I'VE EVER HAD. Mixed greens, feta, jicama, tomatoes, and diced onion complemented the chicken and the flavor was on point. The chicken was freshly grilled - none of that stuff sitting off to the side as an afterthought. I would fly back to Chicago for this salad. Yum. Also, props to Miguel our server for his enthusiasm and great, welcoming attitude. He clearly enjoys his job.", "pics": null}}, {"review": {"des": "I've heard a lot about Doc B's since it came to Florida, but never got the chance to visit until recently. I was told it was very fresh, and this is so true. Our starter was the guacamole and it tasted like they just picked the avocados; not to mention I was surprised to see it come with so many chips (believe they're squashed sweet potatoes, which were not greasy or soggy at all - these types of chips are usually super greasy). My friend told me to get one of the bowls, which I did, and it did not disappoint. They have two sauces, teriyaki or sweet & spicy, and you can pick from several different proteins. Mine was sweet & spicy and I chose chicken. It was delicious. They also had a really good watermelon beer, which was very refreshing.", "pics": null}}, {"review": {"des": "Matthew was an awesome waiter - prompt, friendly, and helpful. Hands down the best server that we had during our visit. Food was delicious and good sized portions. Everything was really clean and we were able to get in and out super quick.", "pics": null}}, {"review": {"des": "Food here is good, but for the price I would say it's a bit overpriced.  I've been here a few times and the food is fairly consistent.  I will usually have their wok bowl with ahi seared tuna, which comes out to $21.  With a drink, tip, and tax you're at around $40 a person.  They have a good selection of food.  This past time I went with a friend who is vegan and they were willing to accommodate and not use certain non-vegan ingredients.<br><br>The portions are a bit inconsistent at times.  Sometimes they give you larger portions, but tonight when I was there, it seems like they used less noodles in my dish, my friend received less fries.", "pics": null}}, {"review": {"des": "This was a very pleasant surprise that I really would not have considered going to without the reviews and ratings on yelp. Perfectly situated just off of Michigan Avenue, you ascend a few quick steps to this sharply decorated restaurant and with a small bar upfront and windows and tables that look out for people watching - with the windows open in nice weather. The candied bacon snacks served at the bar were delicious .... although I would suggest not eating too many. We just came for some snacks and the matzoh ball soup was perfect for a frigid early January appetizer. The bartender could not have been friendlier. I frequent this neighborhood a lot and I'm disappointed that I had not stopped into the fresh kitchen before.", "pics": null}}, {"review": {"des": "Absolutely loved this spot for lunch! We had the grilled artichokes (delicious!), butternut squash soup (had a nice spice 'kick') and homage burger (cooked a little bit more than requested but the flavor was delicious). I would definitely return and try other menu items. <br>By the way, we arrived when they opened at 11:00 and there were already a few tables sat. By 11:30, it was packed!", "pics": null}}, {"review": {"des": "Great place to eat for the whole family. The atmosphere is nice a quiet. The service exceptional and the food is really tasty and healthy. During the week they have great deals during happy hours. A lot of gluten free options. <br>Definitely we will come back. <br>The waiter Matt was great!<br><br>Ahora en español! <br>Les recomiendo mucho el lugar. Ideal para toda la familia. <br>El lugar es pequeño pero cómodo y agradable. <br>La comida muy rica. Tienen muchas opciones gluten free. El servicio muy bueno. Muy amables desde la entrada hasta el mesero. <br>A nosotros nos atendió Matt y fue muy amable. Nos recomendó opciones del menú y siempre estuvo atento a lo que necesitábamos. Tienen happy hour deals  <br>Vamos a regresar pronto.", "pics": null}}, {"review": {"des": "Ordered delivery from this location, first experience with this restaurant. First of all- half my order was missing. So, aside from that, the filet mignon sandwich was good, but hardly enough food for an adult. It was shockingly small- I don't think this would fill a 10 year old. It was the size of an appetizer, not an entree. Especially considering how expensive the prices are, the portions need to at least be satiating. The fries were ok, not great. Gelato cookies in chocolate and strawberry that arrived in second delivery (bad on this company for not throwing in an extra cookie for the mistake and time waiting), were not good. The gelato was creamy and silky but the cookies were god awful. The chocolate chip cookie was especially bad. <br><br>To be honest I'm really surprised they didn't offer a complimentary food item or discount for a future order. A delivery missing two items is really bad, and that's why I decided to go with 2 stars instead of 3. If you care about your customer you have to make up for your mistakes, otherwise you're saying you don't give a **** that their experience with you was unsatisfactory.<br><br>All in all I spent $42 and was still hungry.", "pics": null}}, {"review": {"des": "Great restaurant!  Amazing staff and service!! Try all the appetizers!!  Loved the killer Shrimp!!", "pics": null}}, {"review": {"des": "Food was very good, but service was quite poor. Took about 10 minutes from being seated before we even got water, and then the kitchen area seemed more concerned about talking to each other than preparing the orders. Restaurant wasn't busy so the long wait time was quite unreasonable.", "pics": null}}, {"review": {"des": "We loved this place, it's a heathy twist on traditional American food but without sacrificing any of the flavor. I got the #1 Tuna salad and my husband got the make your own Wok and both were delicious. Our waiter was super friendly and helpful.", "pics": null}}, {"review": {"des": "Cute, convenient spot across from Bloomingdales on Walton. We popped in for dinner at around 5:50 on a Sunday night and there was only space at the bar, so we snagged it. The waitress seemed friendly and commented that happy hour prices (half price wine) go from 4-6  and since we ordered our first glass of wine during happy hour it would be half price. Though when the bill came, she charged full price for all the drinks. Okay...annoying. So she had to adjust the bill. I had the brussel sprout salad and my friend had the cobb salad with carrots, tomato, croutons, and radish. My salad did not have protein which I regretted later because her chicken looked really good! I would return and have the cobb salad for sure. During happy hour.", "pics": null}}, {"review": {"des": "Awesome restaurant close to The Drake Hotel.  My favorite is the Wok Out Bowl.  I had it with chicken the first time and seared tuna the second.  On both visits I was pleasantly surprised by awesome service and delicious food.  My favorites are the Matzo Ball soup & Seared Ahi Tuna Wok Out Bowl.  This is hands down my new \"go to\" Chicago restaurant.  Consider me a foodie now:)", "pics": null}}, {"review": {"des": "Highly attentive service.  Great selection of wine and full bar.  There is outdoor seating but we were inside, which is decorated with nice contrasts of wood, leather and stone.<br>Pizzas are made in 700 degree oven and are quite popular since they are flying out of the kitchen.<br>We had the soup of the day, butternut purée and a Napa Burger.  Both are amazing, great flavor and perfectly prepared.<br>Looking for fresh and unique flavors, try Doc B!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OSYPGSzXR-uokeFe9W-o4A/168s.jpg", "caption": "Butternut squash soup"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7vmIbr82N7eiGpEAutq7GQ/168s.jpg", "caption": "Napa Burger"}]}}, {"review": {"des": "So.. I actually came here two days in a row because I was so obsessed with this place while in Chicago for the weekend! My boyfriend and I tried shrimp and arugula pizza, the #1 tuna salad, the brussels sprout salad, the number 6 sandwich - all of which were really good! I personally thought that the pizza was really really cheesy, but it was still pretty good. I love that all the dressings here are hand-made, and the tuna was seared perfectly.  Although a bit on the pricier side, I think it is well worth it.  The service is great- the staff is very attentive and they bring the food out pretty quickly.  Next time I'm back in Chicago, I am definitely coming back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HhdH2p9UG6Xy8bHpXUjHTg/348s.jpg", "caption": "#1 tuna salad, shrimp and arugula salad, Brussels sprout salad"}]}}, {"review": {"des": "This place is fantastic! Lots of different food and drink options. It's a little pricey but it's right on par for Chicago dinning. The service was fantastic. Would love to come back.", "pics": null}}, {"review": {"des": "Love!  Love this place!  The Tuna App comes with a kale salad that will make you rethink you opinion of kale.  <br><br>I have been eating healthier and so I tried the veggie plate and was not disappointed.<br><br>They do everything right!  Try this place", "pics": null}}, {"review": {"des": "Great dining experience. Guacamole & sweet potato chips were delicious. Wok bowls were also good and has vegan options. Portions were plentiful. Did not leave hungry or disappointed.", "pics": null}}, {"review": {"des": "Great service. Great selection and flavorful food. Our server recommended the Number Six and the California Salad with Salmon and both were excellent.", "pics": null}}, {"review": {"des": "I was visiting Chicago with some friends and we decided to stop by here. Not the best burger I've had, but definitely well  cooked. The fries were very delicious. The service was exceptional as we had to rush out to catch our flight back.", "pics": null}}, {"review": {"des": "Really good food and a great vegan modified dish called The Plate. Everything was healthy and tasty. Big portions and nice server.", "pics": null}}, {"review": {"des": "Yum! This place was great! It's very comfortable in here with a great staff. The food was delicious. I had the tri tip wok out bowl- so good", "pics": null}}, {"review": {"des": "Such a good lunch spot. Healthy, fast, and delicious. High quality fresh ingredients. More of a sit-down place, but you can get stuff to go.", "pics": null}}, {"review": {"des": "My work team & I have ordered delivery from here NUMEROUS times. I visited the a actual restaurant once. I've not once been disappointed by the food! Their wok out bowls are amazing. My go-to is the wok out with shrimp, spicy Thai, & quinoa. From what I remember, the service was always great - on the phone & in person. 10/10 would recommend to anyone looking for a healthy, delicious meal.", "pics": null}}, {"review": {"des": "Great lunch spot while shopping on Oak Street! Great ambiance, food and service! Highly recommend the steak sandwich and hot chicken sandwich. Fries are also great, and prices are fair for location.", "pics": null}}, {"review": {"des": "This place is legit. Great feel to it when you walk in. Once we ordered, EVERY dish that passed our table caused plate envy. We are a family of 4 and we all loved the food we devoured!  We will be returning!", "pics": null}}, {"review": {"des": "We went here for a dinner and was seated quickly by the window (rather chilly). The place was mostly full but there were still a few open tables for 4. Besides the temperature, we loved the ambience and the bustling dinner crowd vibe. <br><br>We ordered the Napa Burger, Backyard Burger, and the Cajun Chicken Club. My friend and I ordered the Napa burger to split, and they kindly plated it separately for us. The burger was very good (wish there was a bit more arugula), and everyone was very satisfied with their orders. <br><br>Regular fries can be exchanged for sweet potato ones for no additional cost. I passed by a table who ordered house guacamole, which is a very hearty serving on a large plate with what seemed to be sweet potato chips.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YyvOoMHUdrHIGI8Foz8wvQ/168s.jpg", "caption": "Backyard burger"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HvE4XeYAJxcPiyZhcb0lYw/168s.jpg", "caption": "Half of the Napa burger"}]}}, {"review": {"des": "I have never been inside to eat but my company I work for orders it in all the time and the Cobb Salad is THEE best Cobb salad I have ever had in my life. It comes with an amazing Greek goddess dressing for the salad and really good honey mustard for the chicken! Highly recommended! Also the parmesan wings are really good.", "pics": null}}, {"review": {"des": "This place is so good. The service is always great and so is the food. Any time the wife and I are in Chicago, we always make it a point to come here for the avocado pizza and crispy chicken sandwich.there is always at least a 45 min wait anytime we go, but that's with good reason.. their squash soup is amazing as well.<br><br>To be honest I have never ordered anything else bc I rarely get to come here, so when I do I always get the same thing! <br><br>Hope to be back soon!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-PHDLxcqvePZqW2fz-Dv6Q/348s.jpg", "caption": "Avocado pizza with a bean spread that is so good"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1uB5F8V8RAI2B2J-UL4nhg/168s.jpg", "caption": "Squash soup so good"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SVz48Z2xxXN_3Nh7T9Xxng/168s.jpg", "caption": "Crispy chicken sandwich split with the wife!"}]}}, {"review": {"des": "A must if in the Chicago area. Our server Mathew was great. The food here was delicious. Price is average for downtown area.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-UxQQthUPhvHTRsJSZJGhg/168s.jpg", "caption": "Burger"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wKrNckVBhEQ8iX-Rbm06ww/168s.jpg", "caption": "Old Fashioned"}]}}]}