{"name": "doves-luncheonette-chicago", "reviews": [{"review": {"des": "Love the atmosphere here - it's upbeat but not too loud and really cute. <br><br>I got the tofu toast, with avocado, tofu, butternut squash, apple, and greens. It sounds like a wild combination but it was absolutely delicious. I loved how the tofu was cooked and I loved the uniqueness of the combination - it was so nice to have something different to order for brunch. The coffee is also great and my friend really liked her parfait! <br><br>The prices were also really reasonable - I paid $11 for my toast and it was very filling.<br><br>Can't wait to come back!", "pics": null}}, {"review": {"des": "Brunch is where it's at. Although I'm sure they're good for their other meals too. My advice, go a little earlier if brunch is what you're seeking. The staff is super awesome. The place can get crowded. It's nice and quaint. They don't do reservations for brunch, so leave your name and go wonder Wicker Park for a bit.<br><br>The Food: <br>Masa-Ball Soup - roasted hen broth with masa dumplings and herbs - delicious and warms the heart and decently filling (nice spin off a matzo-ball soup)<br>Chicken Fried Chicken - buttermilk fried chicken smothered in chorizo verde gravy with sweet peas and pearl onions - so, so, so delcious, awesomely moist chicken, the peas are fantastic as are the pearl onion and yes to the gravy (big portion, so totally share-able or if you're totally hungry, just don't share)<br>Burnt Ends Hash - crispy potatoes, brisket burnt ends and poblanos, tossed with aioli and queso fresco, served with two fried eggs, scallions and Texas toast (yum, yum, yum - definitely delicious and larger portion, but so good).<br><br>Cocktail:<br>Cantarito - Lunazul Blanco, lime, orange & grapefruit juice, salt, topped with grapefruit soda & Tajin - delicious, like a breakfast margarita and served in an lovely ceramic mug (it's awesome)<br><br>TLDR: don't miss out. check them out for breakfast, lunch, brunch or dinner (even their happy hour deals and daily specials are pretty spot on.", "pics": null}}, {"review": {"des": "I came for weekend brunch here and let me tell you this is a super indulgent brunch spot. The food is rich, slathered in butter and deep fried but oh so delicious. Not to mention the decor is retro and cool. Beware of tight seating space and getting close to your neighbors, especially at their bar seating. Waiting time was about 20 minutes. <br><br>I tried their buttermilk pancake, burnt ends hash, and biscuits and gravy. All were scrumptious and I promptly fell into a mental food coma shortly after. The buttermilk pancake is a cross between a deep dish pie, a bread pudding, and a pancake. It is definitely a dish you don't want to consume all by yourself and lends itself more as a dessert- though not overwhelmingly sweet. <br><br>Biscuits and gravy was the special of the day and incredibly creamy and satisfying. A lot of our fellow diners were ordering the burnt ends hash- and we of course got it too- but this was probably the least impressive of the three dishes we got- not that it didn't taste good but it just felt fairly standard.", "pics": null}}, {"review": {"des": "Yum yum yum. So good. I love fried chicken and have been searching high and low for good fried chicken in Chicago. My search is finally over. <br><br>The chicken was juicy, perfectly seasoned and crispy. I can't believe how juicy it was boneless. I got the gravy on the side. It had great flavor with a bit of a kick. I don't like peas and ate most of the peas. Perfectly cooked.  <br><br>My daughter got the pancake.  We weren't sure what to expect from the description. It was a pan-cake in a skillet. Slightly puffy. Moist inside and crispy outside. My daughter completely polished it off. She enjoyed the apples in the center. <br><br>We will definitely be back. Everyone's food looked so good that we want to try other things on the menu. Although, it may be hard not to order the fried chicken every time...", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/x2glLrNB8gZJI0EXSqhcHw/168s.jpg", "caption": "Pancake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FMRgHaS3-qiVCc7X5uAa8w/168s.jpg", "caption": "Fried chicken"}]}}, {"review": {"des": "Dove's Luncheonette is always an easy yes for me.  They have a simple menu with every choice being delicious.  I also really enjoy the vintage decor, with so many little details.  There is always something for me to look at when I'm there.  The bloody marys are must too!", "pics": null}}, {"review": {"des": "I read about Dove's in every Chicago brunch article and had to check the hype! <br><br>The hype is real y'all. <br><br>Ambiance: Stools lines up at the windows, along the wall, and at the bar. Nice, kitschy feel. <br><br>Service: The bartender was great! Service was fast and he made sure our waters were filled even though the pitcher was right by us. He also explained the hot sauces that complement our orders. <br><br>Food: Sooo good. I ordered the Burnt Ends Hash. The brisket was tender, the toast was crisp, and the potatoes were out of this world. Mix it all together with the egg yolk and covered in their garlic sauce. Plus the mild chili paste. Mouthwatering. <br>K enjoyed the Coppa de Puerco. We split the Buttermilk Pancakes as well. The name sounds unassuming but it was more like a peach pie pancake rather than a stack of jacks. Not too sweet and very moist. <br><br>Would definitely come back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/M70jmbLie7KDu5VfTE41gA/168s.jpg", "caption": "Buttermilk Pancake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9sZ3PW75mrapOZfgItfSlQ/168s.jpg", "caption": "Burnt Ends Hash Lunch"}]}}, {"review": {"des": "I came here on a Sunday morning at 10:30AM at which time the place was packed. The wait was 20 minutes for a party of 3 which wasn't bad at all but a lot more people came in soon after so I'm sure their wait was longer. Dove's is located right next to the Damen and Milwaukee intersection. The place itself is somewhat small and most of the seating is diner style bar stools. The main negatives with this seating arrangement for me were that there was no place to keep my coat and also it's difficult to have a conversation if you're with a larger group. <br><br>We came here for brunch and all of us thought the food was unique and delicious. We ordered the burnt ends hash ($15), biscuits and gravy ($8), and the pancake ($13). We shared these among the three of us, which I highly recommend since all the dishes were a good portion size, heavy, and rich. The burnt ends comes with potatoes which are crispy and delicious. The burnt ends themselves are not all that flavorful but we added their chili paste on top which was a great addition. The biscuits and gravy were one of the specials of the day and also really good. I really liked the texture and flavor of the gravy. My favorite dish was the pancake! It was very different from any pancake I've had in the past - if anything the texture was more like bread pudding and I believe it had peaches at the bottom. It was incredibly soft, thick, and just the right amount of sweet. I really liked the addition of oats on top. <br><br>Overall great place for brunch with unique dishes. There's metered parking on Damen which wasn't that difficult to find at the time I went. There is also some free parking if you try the smaller streets.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zdbDclatt8t178k0dHqXDg/348s.jpg", "caption": "Pancake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vBkyecR5-itJezVrX6_30Q/168s.jpg", "caption": "Biscuits and gravy"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oMA3yhxc8gRWQ1dH84YznQ/168s.jpg", "caption": "Burnt Burnt Ends Hash Lunch"}]}}, {"review": {"des": "Came back for the chicken fried chicken and happy to report that it is still as good as the first time I had it almost a year ago. Got to try also the chuleta which was very hearty and the combination of the sweet potato and not bitter collard greens was awesome.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Z_wRIB0_SzZMR-Ak7he11g/348s.jpg", "caption": "Chicken Fried Chicken"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VhKYqty8JOZDvnrAThg-yw/168s.jpg", "caption": "Chuleta de Puerco"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XsqqG5xE9ASEbBRatwmrhA/168s.jpg", "caption": "Pozole Rojo"}]}}, {"review": {"des": "I met my friend for lunch at Dove's Luncheonette over 20 minutes late because I was naively optimistic about parking and traffic around this Wicker Park intersection... Dove's is located in a hopping area and there's plenty of people-watching-seating up by the windows. Perfect for waiting for a horribly late friend.<br><br>This luncheonette has a bright homey diner feel with a jukebox and record player playing tunes in the background. This eatery is ideal for smaller gatherings, but I've seen larger parties utilize the entire floor for a birthday party and I've had brunch here with a party of five before. <br><br>The staff was friendly and attentive throughout our meal.  Overall, I've personally experienced above-and-beyond customer service, i.e. I've had to borrow a charger before and the hostess was super helpful. I love the neighborhood feel of Dove's and hope to be back for more of their amazingly flavorful braised pork shoulder!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/g2PEL-lQrbCSYgJsBwndAw/348s.jpg", "caption": "Coppa de puerco"}]}}, {"review": {"des": "There are very few things in life I will wait in line for, but the chicken fried chicken at Dove's is one of them. Holy smokes. Fast the night before and wear your sweatpants because you're gonna wanna finish it. It's crispy and sweet and savory all at the same time with the sausage gravy, peas, pearl onions, and I'm pretty sure you can add an egg on top, because - why not. <br><br>It's a tiny place with a pretty constant wait since they pretty much only have counter seats. They make a very spicy michelada verde that is delish, but I couldn't hang so the nice bartender topped me off with some extra beer. I can't wait to go back and eat everything!", "pics": null}}, {"review": {"des": "Small seating options, but good food.  Mexican style brunch menu options as they are sister restaurant to Big Star.  Biscuits and gravy and pazole were great.  Must try the nitro coffee, smooth.", "pics": null}}, {"review": {"des": "I've had the same waiter there 3 times and I look forward to talking with him every time. He gives the BEST recommendations. I normally look at Yelp on what to get, but he helps me feel like an originial hipster trying out things BEFORE they are cool.<br><br>Had the empandas and the blood sausage.... my friend thought she was game for anythng, but then realized what it was was... bluuud, not funny. ..... hilarious.<br>I thought it was delicious and made me feel dangerous. I'd get it again, and again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RwLpZb8XgM8cra7JHeOs-w/168s.jpg", "caption": "Blood sausage, super dank"}]}}, {"review": {"des": "Conveniently located under the Damen blue line stop, this diner has great food which is well priced for the quality. It seems to be seeped in history, of which I'm unaware. <br>The burnt ends hash was a big, fatty plate so prepare yourself - I wasn't even able to finish it. The brisket itself was surprisingly bland, but the potatoes and queso fresco combo more than made up for it, so good. Texas toast was crunchy on the outside, fluffy on the inside, very good jam too.<br>Overall the meal was great but I will say the $10 bloody mary was expensive for the quality. Good service, Katie gave me the morning pep I needed. Check it out.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-UDIKWa7eeesPqtDSbbwBg/168s.jpg", "caption": "Burnt ends hash"}]}}, {"review": {"des": "I met a friend at Dove's and was terrified by the hour wait, especially because it was pouring rain outside and waiting inside was super cramped. BUT I was pleasantly surprised at how fast they turn customers around and we only had to wait fifteen minutes before snagging a seat at the bar. <br><br>The menu has an unexpected twist on a lot of classics. I ordered the country ham tamal, and it was not at all what I was expecting- in a good way. The tamal itself was great, and I loved all the veggies on top. I expected to walk away feeling stuffed from a heavy breakfast, but was perfectly content with what I got instead. <br><br>They have some awesome specials and plenty of other unique menu items to explore, so I'm sure I'll be back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bTrS4T8UgRWAGl8ibYBU0A/348s.jpg", "caption": "The country ham tamal"}]}}, {"review": {"des": "Okay, so first off, this should be de-listed as Tex-Mex. It just sets you up with unrealistic expectations. I went in expecting Tex-Mex and it wasn't and so then I wasn't very happy with what I'd ordered. I'm trying to keep that in mind as I write my review. <br><br>Decibel level: 50 dB, good for conversation<br><br>Service was good. Make sure to bring your ID if you want to drink, saw the girl next to me get turned down even though she didn't look a day under 30. Menu is somewhat limited and very pork heavy. Not a great place for vegetarians or anyone avoiding pork. I had the succotash enchiladas. The succotash was a bit undercooked, but tasty. The mole wasn't to my taste, but very typical of Oaxaca or New Mexican cuisine. They have Mexican cokes in a bottle, no fountain drinks. Cute atmosphere and as a friend mentioned, a great place to eat when the place next door fills up.", "pics": null}}, {"review": {"des": "Right off the Blue in Wicker Park, this place is amazing! Come before 1030 and there's no wait. We had bloody Maria's (spicy and awesome with a beer back), the Tamal, and the Coppa de Puerco and everything was amazing. Great service, solid people watching, out of the park food. Use the nutty chili sauce (paste?) on the table - is unique and fun.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/x-vaYhYjTsrO8zX-S5TfxQ/348s.jpg", "caption": "Tamal - so freaking good and one of the lighter/smaller options."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/J42QcpsgTvUlzlaSM-Dpkw/168s.jpg", "caption": "Bloody Maria comes with a beer back."}]}}, {"review": {"des": "Loved. This. Place. <br><br>Had the chicken fried chicken (like many reviewers) and it was INCREDIBLE!! The ambience, the service, the entire restaurantyness is the place was amazing. <br><br>Judging from how packed it was at 9am on a Sunday in Chicago, you won't be disappointed.", "pics": null}}, {"review": {"des": "Admittedly fond of One Off Hospitality after memorable meals at Avec, Blackbird, Nico and Publican, not to mention my Sister's wedding reception at Publican Quality Meats, it was only a nearly four year absence from Chicago that prevented visiting Dove's Luncheonette sooner, Paul Kahan's Wicker Park Diner remaining quite popular and still frequently generating a wait at all hours of the day.<br><br>Found beneath the tracks of the Blue Line on Damen and toqued by Chef de Cuisine Tom Carlin, the idea of counter-service Mexican fare in a hip setting plus plenty of Mezcal following Kahan's mega-successful Big Star, it was bellied up to the Bar that a sleepy-eyed Woman offered greetings, Coffee plus a menu, high heat and humidity welcoming only two of three with Ice Water quickly poured and a two-course order to follow.<br><br>Disappointed to be visiting Dove's alone, an expansive menu that changes slightly at noon offering no shortage of temptation, it was while 70s and 80s tunes played overhead that line cooks were watched firing plates at breakneck pace, everything prepared with great care, timing and cleanliness despite close quarters.<br><br>Trending mostly savory, Enchiladas and Hash both evidently popular, it was after a menu-described fifteen minutes that scalding cast iron was presented alongside fried Chicken soaked in thick Gravy, Peas and Onions, each ingredient equally prominent across the palate to form one of the most 'rib-sticking' dishes in recent memory while the Pancake was best along the edges where Maple Syrup had concentrated and caramelized, though the center was also pleasant thanks to bursting Berries and tangy Crema.<br><br>Not presenting a Dessert Menu at 9:00am, though Pie, Shakes and Ice Cream are available at all hours, it was with the young day's third slice of Pie that the check was served, a lightly sweetened Cinnamon Custard wedge from Hoosier Mama Pie Company one of those instances where outsourcing to an expert seems well advised as opposed to taking the easy route.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nOI0VwUYWsd90mdc1Hv_5g/348s.jpg", "caption": "07/05//18 Dove's Luncheonette"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-TpqjlYz0fbX7keponRBjA/168s.jpg", "caption": "07/05//18 Dove's Luncheonette"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/P1IHo7sb3v2q-fZcwk4XRQ/168s.jpg", "caption": "07/05//18 Dove's Luncheonette"}]}}, {"review": {"des": "I've lived in the neighborhood for a quite a while and this place has been on my list, but haven't been able to try it. I hear they have great happy hour specials, so that's what I was aiming for, but we passed by while looking for a restaurant that had something on the menu that was relatively whole30, and we decided to give it a try! <br><br>We waited about 20 minutes to be seated because there were a ton of people there, but we were able to leave and walk around and come back. Once we were seated, We both got the pozole and were very pleased! Our waiter was the bartender and he was very good. The pozole was super flavorful and exactly what we needed on the cold morning!<br><br>Will definitely go back, but it's probably not good for groups because of the size. Or try and make a reservation beforehand if you're more than two people.", "pics": null}}, {"review": {"des": "Everyone talks about Dove's, so since I was in the Wicker Park neighborhood earlier today, I figured that this was the best opportunity to see what all the fuss is about.<br><br>I always hear about how crazy packed it is up in this restaurant, but because this went down on a Monday afternoon, the place was comfortable yet lively. <br><br>Menu had a lot of interesting dishes, as well as refreshing beers and cocktails. None for me this time around, thanks. For food, I just had to try the Chicken Fried Chicken. Unfortunately, it was no different than any other fried chicken I've had elsewhere. The gravy was delicious, but there was very little of it. Overall, it was a filling meal, thus fairly satisfying. Was it worth the $16? Hell to the no!<br><br>My girl had a lovely ceviche dish that was especially refreshing on this hot summer day. Not too spicy and not too sweet, just some damn good seafood from what I tried.<br><br>Glad to have finally tried out this north side staple! Always nice to try out these wacky fusion joints these kids are coming out with these days.", "pics": null}}, {"review": {"des": "Amazing and worth a wait -- definitely on the heavy side but very tasty to justify that. The pork shoulder with hominy was incredible! I also got the crispy brisket pieces, though it turned out to be more fatty and less lean and crispy. Still delicious!", "pics": null}}, {"review": {"des": "I went here and had the posole and it was amazing and perfect and so good and the meat was incredible.<br><br>That is all. <br><br>I also tried all my friend's food including the braised pork and you should just eat that as well.", "pics": null}}, {"review": {"des": "Love the Dove! Hip stylish retro diner with interesting menu choices, nice liquor options and great brunch. I've not been for dinner but the dinner menu looks excellent too. Love the counter service and classic diner paraphernalia. They play LPs. (They are also called record albums kids). Friendly folks working there.", "pics": null}}, {"review": {"des": "Dove's was recommended to us by someone that worked in the area and had tried it.  It looks like an old style breakfast spot and the walls are lined with cool old pictures.  It is a stones throw from the blue line subway stop at Damon.<br><br>We were here around 11:30 am mid week and it wasn't crowded.  I suspect given the area that a weekend could get pretty busy here. <br> We ordered two Bloody Mary's which I honestly wasn't that impressed by flavor wise.  I had to chuckle that they automatically come with a beer chaser/shooter though.  <br><br>We ordered an egg pork shoulder dish over a creamed hominy with collard greens.  WoW!  Amazing flavor and was filling enough for two of us to split for a light brunch.  Great service, the atmosphere was cool and everything was clean.  Prices were moderate but the quality of the food seemed on par with what we paid.  If you are looking for something a little different food wise try Dove's.  We will definitely eat here again when we are back in the area.  I'm looking forward to seeing what other dishes taste like.", "pics": null}}, {"review": {"des": "Loved this place! Ambiance is great, service was awesome, and food was so bomb!! The fried chicken is their most well known dish and for a good reason. It was so perfect in every aspect - crispy, but tender on the inside. The gravy with peas was also such a good combo with the rest. If you add their lemon/vinegar sauce to it, it just enhances the juicy deliciousness. Seriously... the best fried chicken I have ever had in my life *drool*. <br><br>Everything else was mad good as well. The potatoes were crispy, the grits went really well with the avocados. The server accidentally added avocados as an extra side, but I'm so glad he did. If you eat them together, it's so good.<br><br>The enchiladas were my least favorite because the meat was pretty dry, but it was still good.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Knpl-lSAyzkVsrqRBsNZHg/348s.jpg", "caption": "Enchiladas"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TgJAWpwqlSSMyDDVWosu5w/168s.jpg", "caption": "Fried chicken"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/h3KbzGIQntBFddFs1GtqTg/168s.jpg", "caption": "Grits with avocados to the side"}]}}, {"review": {"des": "Dove's Dinner is extremely underwhelming .. not to be mistaken for their delicious breakfast/lunch .. It has been an hour since I finished my meal and I am still kicking myself for spending so much money on such a sad and disappointing meal. Tofu enchiladas are just not good - coming from a tofu lover .. poorly seasoned or treated, hardly edible. A mix-up with my boyfriends fish dinner led to a more expensive fish option that was just super underwhelming. <br><br>I am SO disappointed - I boast to everyone that I live so close to the best restaurant in Wicker and was let down. I ended up making a PB&J afterwards, which was more satisfying than anything I had there for dinner. <br><br>I will not be going to Dove's again for dinner, unless I am craving breakfast for dinner. :(", "pics": null}}, {"review": {"des": "Bold Flavours , Great Food.<br>Service was super friendly. <br>I would highly suggest this place. <br>I loved it, just hangout with great friends and having a bite. Five thumbs up", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ycbYutwjUj7_FhrtOUEOrQ/348s.jpg", "caption": "Good Friends, Eat, Drink n Be Marry!!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qgx7UAnWKL0q1EAtp0EEIA/168s.jpg", "caption": "Great favours"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xTenzzr5nj7aSn_xZ5GvKA/168s.jpg", "caption": "Yummy"}]}}, {"review": {"des": "What a great place. Good location by the blue line. I think everything I've ever had here is good. I'm picky about biscuits and gravy, and theirs is one I love (with chorizo)! Service is always good. It can get loud and busy, and the stools kind of suck (especially if you have a jacket and/or purse) but that's the downfall of a diner. This is a Chicago staple for me. (And if there's a wait to sit you can go get tacos next door from Big Star's takeout window!)", "pics": null}}, {"review": {"des": "a wonderful suggestion from a friend I just met- beautiful ambiance great customer service. timing was perfect from greeting to saying goodbye. Employees were understanding and patient meals were superb recommend the potato with the egg.. Man, I'll be back again thank you", "pics": null}}, {"review": {"des": "Tips:<br><br>Buttermilk pancake is not your average pancake. It is made in a skillet and triple the thickness/density and triple the deliciousness.<br><br>-----------------------------------------------------------------------------------------<br><br>This is such a cute little diner inspired restaurant. Seats are rather limited for big groups, most of the tables are community style tables and bar seating.<br><br>The buttermilk pancake is so rich and delicious. It is different from your normal pancake from a breakfast joint because they make it in a skillet. I definitely recommend for anyone who enjoys pancakes or a bread-y breakfast.<br><br>The Chicken Fried Chicken is a must get here at Dove's. The chicken is so crispy and so flavorful when eaten with the gravy.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/e7CDaIZ4SFqhctb6D55X1w/348s.jpg", "caption": "buttermilk pancake $13"}]}}, {"review": {"des": "We had such an amazing lunch here yesterday, I'm not even sure where to begin this review... Normally I go in chronological order, but this is too important. Get the BACK TO LIFE seafood cocktail: Dungeness crab, squid, shrimp, and avocado in a tomato and habanero pepper sauce. As promised, it will give you life. The squid was tender, sauce lovely with a little habanero heat, generous bites of shrimp, and the prettiest little mountain of crab on top.<br><br>I probably should not have ordered a Bloody Maria (was offered the choice of mezcal or tequila and tried the mezcal) because the pepper heat from both the drink and Back to Life Cocktail had my mouth on fire by the end of the meal. It was worth it! Delicious drink, and came with a sidecar of beer.<br><br>Husband had one of the best burgers we can remember. No ketchup or mustard--didn't need it. Pimento cheese, smoked pepper mayo, and zucchini pickles, and somehow not heavy or greasy at all.<br><br>The space is adorable. Bright airy diner feel with comfortable padded stools. The servers are friendly. There is a jukebox in the corner with a great music selection which set a fun vibe, but we could still hear each other across the communal table.<br><br>Dove's Luncheonette made us so happy. If we lived here, we would try to, like, live in the restaurant. Thanks for existing, Dove's!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mLtGoglGZ38IDfXogGbtDw/348s.jpg", "caption": "Love to Dove's!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GzQwf0UGLS3LZRCAFHpi0Q/168s.jpg", "caption": "Specials on the board"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aAo3WNAjWjtMrn7UNqxcDQ/168s.jpg", "caption": "Bloody Maria with mezcal"}]}}, {"review": {"des": "The food is good. The fried chicken is a good portion and I would get it again. The burnt ends hash was good but there weren't a lot in there. It was mostly just potatoes so would not get that again. The menu is small but I liked that. It's pretty small and had a line. Didn't wow me but it was good!", "pics": null}}, {"review": {"des": "A Caucasian Tex-mex fusion restaurant. Great service. Clean aesthetics. Food was average and could be on par with most indie brunch restaurants.", "pics": null}}, {"review": {"des": "Great food and mezcal. Cortland is a mezcal connoisseur. What a gem!<br>Great ceviche and cocktails too!<br>Well located near Damen blue line stop", "pics": null}}, {"review": {"des": "I have been wanting to try this place for a long time and it did not disappoint! This mezcal Mecca made my day. The food was delicious, but very pricey for such small portions. However, it was delish. Overall great experience with knowledgeable and very friendly staff.", "pics": null}}, {"review": {"des": "Such a treat to dine here.  Their offerings pair well with a hungover morning. Crossbreed between a diner and a tex mex joint.  Reasonable prices and great service.  Wait times are never as long as they tell you and there are several places to grab a coffee and a water while you wait for them to text you that your table is ready.", "pics": null}}, {"review": {"des": "Per our Airbnb hosts' recommendation, we decided to check this place out. We had the appetizer of seafood ceviche and it was so delicious and fresh! We had the unusual rose and shot of tequila special. It was okay tequila and very good rose. They did have a huge selection of tequilas so great place if you're a tequila fan. For entree we shared the pork chop special that I thought it was really good. It could've been a larger pork chop but it still captured my tastebuds with a variety of interesting flavors. My boyfriend really wanted the fried chicken but we didn't order it for fear of over-ordering and being wasteful and he's still regretting that decision! We saw the servers bringing it to other tables and boy did it look amazing!! The place is on the smaller side but I love the vibe and how they were playing vinyls and selecting some really good tunes! The retro diner decor was cool and the staff were great! I highly recommend and would definitely go back when I'm in Chicago again!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BZNVDOBsNBuCOanzu10TXw/348s.jpg", "caption": "Dove's menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2bKFcQDVVgOL2A5XQrCa_A/168s.jpg", "caption": "Seafood ceviche yumminess!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hlExJQkco5ptgWYc8BoOMg/168s.jpg", "caption": "Rose and tequila (?)"}]}}, {"review": {"des": "We went for brunch on Saturday around 2 pm, there was a 40min long wait, but we could see why. This place has a fresh take on diner food and diner atmosphere, we were delighted by the creativity! Each of their entree dishes have a nice soul food richness with a bright bits of flare. And the whole place has a nice retro, 70s style. The music is a curated record collection. <br><br>After reading reviews, we wanted the burnt end hash, but they ran out by the time we ordered. We ordered the fried chicken with an egg and the smoked chicken and mushroom enchiladas. <br><br>Oddly, the enchiladas were a bit one noted, but the fried chicken is something I will probably crave on a regular basis, each of the ingredients added a lot of dimension. I wondered if the egg would just add more of the flavor, but it complemented the dish really well! <br><br>We want to come back for some of the events they have. A Cuban night and try some of their mezcal flights.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GiKAqUQ8wiG3_IhpcnmTuA/168s.jpg", "caption": "I will come back for this."}]}}, {"review": {"des": "Dove's Luncheonette was our last stop before making our way back to the airport! I made reservations for two on a Tuesday morning, but it wasn't necessary as it was pretty empty at 9:30am. We were seated wherever we wanted to sit. The waitress was extremely friendly and explained to us the menu in detail along with always refilling my husband's coffee. So onto the food.<br><br>We ordered the fried chicken (duh, of course!) and the burnt ends with eggs. Both were amazingly delicious! We never had extremely heavy breakfast like this, but it was worth it even if it meant our stomachs were bloated for the rest of the day! The fried chicken came with peas, garlic cloves and gravy. It was crispy and flavorful! The burnt ends did have some fat in it, but overall, it was quite tasty. The husband enjoyed it way too much!<br><br>If we're ever in Chicago again, we will be back for sure, especially since it's next to our other favorite spot, Big Star.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DT44wj6fLyFd98Z3BmnRoA/168s.jpg", "caption": "Burnt ends hash"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XPx6-gaX7DBlUh5rrYdjoQ/168s.jpg", "caption": "Fried chicken"}]}}, {"review": {"des": "What a breathe of fresh air. To find a high quality dinner place in wicker park that you don't have to wait obnoxiously long to be seated at is unheard of these days, but Dove's was just that. My cousin and I came here on a Friday night around 7, were seated immediately in their diner esque seating area, and were promptly served. <br><br>The restaurant itself has really cute, welcoming hometown diner feel to it. There's only one semi large table with 8 barstools, and the rest of the seating is small tables or bar table seats. It's definitely best to come here with just one or two other people assuming the sole large table will most likely already be occupied. <br><br>Their menu is Mexican meets southern comfort food. Pretty small in size but might in offerings. Their portions are pretty large and definitely shareable. We had the pepper and potato hash, and the chicken fried chicken with the citrus draft beer. Everything was amazing. I was really impressed with the hash; the potatoes were well cooked, flavorful, and the pepper gave great flavor without making the dish spicy at all. The chicken was massive, and insanely delicious. We opted in for the fried egg on top, and would absolutely recommend doing the same if you're in to that kind of thing. <br><br>Great service, great food, what more can you ask for? Recommend!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/d2Rex4oVZlDDtaqYz29keQ/168s.jpg", "caption": "Chicken fried chicken with fried egg."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IQ9pBi7CmkC9wBPU8ma9dg/168s.jpg", "caption": "Pepper and potato hash"}]}}, {"review": {"des": "off the chain!! <br>the chicken fried chicken was amazing ! <br>the brisket burnt ends were delicious - but suuuuper heavy . <br>the small plate squash was one of the tastiest things i've ever eaten . <br>all of the staff were really friendly and the whole vibe of the place was great . would def come back", "pics": null}}, {"review": {"des": "Wanted to try this place out for the first time with my boyfriend. Walked in and waited in line to be seated, no one was at the hostess stand. Some more people came behind us, the host appeared and started to seat the people who came up behind us. We interrupted and said we've been standing here and this dude looked at us like we had two heads each and continued on his way helping the people who showed up after us so we walked out. Awesome service, guys. Really appreciate it.", "pics": null}}, {"review": {"des": "Avoid. Cool concept, but poor execution. Counter seats around restaurant stare directly at the wall (lovely!) and the dishes we had were just underwhelming. Had the brisket taco, which was impossible to eat because of the size and fragile nature. A dinner plate sized taco is simply a bad idea. Further, many elements of the taco were flavorful, but they completely overwhelmed other elements - like the cheese. Muenster is a delicate cheese, had no business getting lost in that taco. To be fair, the brisket in it was tasty. The chicken fried chicken was also very average. It was so one note (rich) with nothing to combat that, that it became a bit nauseating by the end of the meal. <br><br>The service was also average. We waited about 15 minutes for drinks and because you are seated facing a wall, there is very little way to get the server's attention to rectify such a situation. <br><br>Overall, it looks very cool at dove's, but if you like good food and service, this isn't the spot based on our experience.", "pics": null}}, {"review": {"des": "Doves is well worth the Sunday morning brunch wait! They serve up fresh hot food with creative twists. The gazpacho yogurt is sweet but also has peppers to add a little spice. I usually order the hash as the brisket is delicious and the toast is always so fluffy and perfectly crisp. Their bloody Mary's are some of the best in the city and are Smokey and spicy - they're flavorful and thick compared to a lot of lighter/watered down bloodies.", "pics": null}}, {"review": {"des": "So many wonderful flavors in each of their brunch dishes, wow!! The staff here are so friendly, the menu is narrow, but the quality is superb, the cocktails are deliciously strong and refreshing, and the interior is cozy!<br><br>We ordered the Tamal with Mole and Burnt Ends Hash for food, and as for cocktails we ordered the Napoleon and the Cantarito!<br><br>The Tamal with Mole was incredible! The Mole sauce was not overpowering at all, the pork pieces were tender and didn't even need a knife to cut through. The combination of savory flavors and juicy meat just made this dish irresistible!<br><br>The Burnt Ends Hash was equally as delicious! The brisket was perfectly cooked, the smokiness and crunch from the \"burnt ends\" made each bite heavenly!! The crispy potatoes were awesome! They absorbed all of the flavor, the runny egg was beautifully runny over every piece of potato and brisket chunk! Such a delicious brunch item, I highly recommend this!<br><br>The cocktails were super refreshing and nicely strong, the way we like it!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/A3MD8xPHVv0wGkOgWVD4Sg/348s.jpg", "caption": "Burnt Ends Hash"}]}}, {"review": {"des": "Food was just ok. Dove plate and salmon toast. The toast had way too many flavors going on to get any distinct taste. Weird combination. The eggs were nothing special. Kinda plain. Staff was friendly and atmosphere was cool.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lt2eAiHovqCB6-pukBHnqg/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "I am giving two stars because I love literally every spot owned by the One Off restaurant group. Otherwise (I can't believe I'm saying this), I would be giving it only one star. I don't know if I just didn't order right or what (let it be known, unlike Big Star, Dove's is not the most vegetarian friendly) but I was disappointed by almost all of this meal :( Let's start with the pros - the vibe and décor is on point and it's a great time sitting at the bar in the window and people watching along Damen. Food wise, my boyfriend and I split the ceviche - this was the only part of the meal I liked. Also, as always with One Off, the service was great. Now for the cons: my boyfriend ordered the burger (only served week days) and I got the squash enchiladas with mole sauce. I just plain didn't like my meal and my boyfriend was complaining the entire time about the fact that his burger was really just a \"mayonnaise sandwich\" - yuck! So, I guess I'm not crazy since he didn't like his food either. Lastly, this menu is significantly more expensive than Big Star (which is also One Off and right next door). Moral of the story: I think I'm just going stick with Big Star next time!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HvA-de1XXkJD22kyIAQSVw/348s.jpg", "caption": "Squash enchiladas in mole"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3jZ5hSJK5ojLJdg0XraQFg/168s.jpg", "caption": "Burger (only served weekdays) with the potatoes and shishitos"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GxdwYlYcopSWqJZmVQa0BA/168s.jpg", "caption": "Ceviche"}]}}, {"review": {"des": "This place had a great old school diner vibe. However, their menu was a bit limited to someone who doesn't eat pork. 80% of their menu had pork. So, I was a bit limited to what i could prefer. With that said, I ordered the pepper and potato hash with a fried egg and it and it was a great combo until a found a hair in my dish - which is why I am giving it a 3 star. I also had the grits - which I do recommend! Those were great - they had some hot sauce and scallions which made me finish it all!!", "pics": null}}, {"review": {"des": "Stopped in here one night after being told that Big Star next door ( who I had previously given 5 stars to and absolutely adore !) doesn't have high chairs (* insert angry face here*)Thankfully Doves did and it ended up working out because we had such a great experience here! <br><br>The place is super cute ,they have booths and diner high tables towards the front windows. Service was great , food was delicious and the drink was wow ! Don't remember what It was  but its in the attached photo . <br><br>For dinner I had the taco norteño. A  brisket taco that was very filling on a huge handmade tortilla . I would come back just for that and some drinks before a night on the town in Wicker Park.<br><br>I believe they are owned by the same company that owns Big Star but I could be wrong. Either way its the way to go with or without a baby in tow!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/37FlCp0RzgwC9P17AMKnPA/348s.jpg", "caption": "Taco Norteño .Brisket Taco."}]}}, {"review": {"des": "Not really sure how to place this restaurant.  It feels like a diner with a slight modern streak... and serves Mexican fusion.  Lots of counter space inside makes this an ideal place for singles and couples.  There are a few large tables in the middle for groups. <br><br>Potato and pepper hash- fantastic.  One of the best potato dishes ive ever eaten. <br><br>Pozole Rojo- pretty darn good.  Would've liked a few more chips. <br><br>Overall I had a great dinner here.  Would consider going back if I come back to the area.", "pics": null}}, {"review": {"des": "Breakfast/brunch gem in heart of Wicker Park. Cozy, intimate interior with a lively crowd inside. Our brunch choices were exceptional. <br><br>Come early or expect to wait a minute to be sat. Would recommend for a small group (2-4). Might be hard to accommodate larger parties.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ABP6FLhZf9QVQb-d5JydIA/168s.jpg", "caption": "Burnt Ends Hash"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zQpHI2hQCkMiOVaJ37_ssg/168s.jpg", "caption": "Pozole Rojo"}]}}, {"review": {"des": "The fried chicken was delicious! I've also ordered this place for delivery once and it came hot and just as tasty. Cute spot inside and a good fallback if Big Star's wait is unbearable.", "pics": null}}, {"review": {"des": "I've had this spot saved for a while on my Yelp now and have been dying to try this place after passing by it and some friends mentioning it. I was extremely excited!<br><br>I came here for lunch by myself to grab a quick bite before heading back out for errands. Combing through the reviews, I went for the Chicken Fried Chicken. Definitely, nothing to rave about. Big portion, but nothing special at all. The gravy was good but there was barely any of it. Not worth the $16 at all. <br><br>Additionally, one of the bartenders was extremely standoff-ish in serving me. Took over 10 minutes before I was even batted an eye or served water, then took a while to take my order. On top of that, he took the water he served for me and served another customer and left it over there and then went on to not replace the water for me. (they serve you the water and leave the bottle in front of you for you to refill.) No idea why this one was so weird, but another bartender who interacted with me was extremely welcoming and served me another bottle of water.<br><br>Rather disappointed.", "pics": null}}, {"review": {"des": "Why 5 Stars? Because my Burnt Ends Hash was simple perfection. I am always hesitant to order the heavier menu items because I don't want to feel like a complete fat boy the rest of the day, however I decided I had to go for it on this one. <br><br>Surprisingly, the meal was not too heavy and was the perfect amount of food. At first I felt like the portion was a bit small, but after I devoured the entire plate like a drunk girl scarfing down pizza at 2 am after a night of drinking and making out with several dudes then crying uncontrollably, I realized it was the perfect amount of food that didn't make me feel bloated. The potatoes were cooked to perfection, crispy but also soft. There was a light chipotle mayo on them, probably could have asked for a side of it, but then again I'm watching my figure. <br><br>The only negative was the coffee tasted like a carpet from a public middle school classroom. It's always shocking when the coffee is bad, especially since there's a really good la Colombe right across the street. The coffee was clearly burnt, but the hash was so good it didn't matter. <br><br>I would suggest hitting this gem up for brunch, then walking around and end up at Big Star for a beer/ some tacos. Also hit up RSVP and St Alfred's if you're trying to get straight fitted in some fresh street clothes. You'll thank me later, or maybe you won't.", "pics": null}}, {"review": {"des": "Cool, trendy little spot with a diner feel. Stopped in on the way to the airport (flight was delayed so we hopped off the blue line for a bite). <br><br>The food was ok. I got the whole fried fish which I didn't love, but I tried my friends' meals which were good. The ceviche (back to life cocktail) was delicious.", "pics": null}}, {"review": {"des": "Came on a Sunday around 11 AM.  We had to wait about 30 minutes to be seated, which was fine.<br><br>I had the tamal de hongos, and I think it was pretty mediocre.  For $14, I got one tamale...  And the mushrooms, peas, and squash, felt more decorative than anything.  <br><br>Flash Taco is across the street with $2 tamales?", "pics": null}}, {"review": {"des": "This place is really cute, with super vintage decor. Friends and I split a drink pitcher, good price and really good drinks. It was tequila, and juice, and spice, and pretty wonderful. We were also each brought a cute cup with ice and a straw. A win in my book. The breakfast items were pretty standard, and the portions were big. Server was quick and attentive.<br><br>My one star off is for the fact that the wall/bar style seating is kind of uncomfortable and that the menu is a little confusing. There's just so much stuff. It's also quite pricey for the food that you do receive, but I'll be back sometime.", "pics": null}}, {"review": {"des": "My girlfriends and I met up here while it's conveniently right off the blue line stop. I ordered the ceviche and some kind of taco. I also ordered a shot of tequila and then asked for ice. <br><br>The menu is very confusing to me. I felt like I was surprised each time the food came out. Like, I thought my drink was a drink... not a shot. I also thought my taco, was a taco. This was more like a wrap or like a big foldoved wrap. <br><br>Would I come back? Not unless I was super hungry when I get off the blue line.", "pics": null}}, {"review": {"des": "Awesome location, awesome chicken.  Nuff said?  <br><br>OK if I do have to say more.. the reason Doves gets 4 stars and not 5 is primarily the hit or miss menu.  Some items like the chicken are absolutely awesome but the hash is not the best I've had.  That being said, this chicken keeps me coming back every time.  Definitely worth trying out if you're into fried chicken at all.  Add in the fact that it's a few steps from the blue line and you've got yourself must try.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BbjoRiMMZ-iMAx-9iwLyTg/168s.jpg", "caption": "Fried Chicken on the right"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Mq4xM0gEOtioNvxba4tfmg/168s.jpg", "caption": "Hash with texas toast"}]}}, {"review": {"des": "Popped in for brunch after many people recommended this place and so glad we did!<br><br>There was a 40 min wait for two when we came on a Sunday at like 1:30. You put your name down and they text you when your table is ready so you can walk around the neighborhood. Super convenient and the time flies this way. <br><br>I had the los santos cocktail and the burnt ends dish with a side of avocado. My boyfriend had the chicken fried chicken, of course. Both were awesome but nothing was like the chicken fried chicken dish. No wonder it's so popular. Yes, it is THAT good. Well deserved popularity!! It's all dark meat so the flavor is really packed in there. It was so fantastic!<br><br>The burnt ends dish was great but I didn't get much brisket pieces in there, it was also a great move adding avocado because it needed something light. <br><br>The space is very cute, it's like a vintage, retro diner run by hipsters. The service was great!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/s5LOOm75gt2G9bYg1a1Pyg/348s.jpg", "caption": "Right outside of the Blue line Damen stop."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XI9YII2KvjnmPiUeAiQAZw/168s.jpg", "caption": "Los santos cocktail and a mimosa."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/INk2pnKrzxWOo-86YcNElg/168s.jpg", "caption": "Outside."}]}}, {"review": {"des": "First time here. I tried the fried chicken dish and the tamales dish. It's a casual dining place a good for small get togethers. The servers and hosts were very friendly and chill. <br><br>Fried chicken- AMAZING. Crunchy and juicy chicken with peas and the sauce they use was perfectly balanced gravy style but not too heavy. I can see why so many other yelp reviewers have posted this dish! I would highly recommend this to be one of the first dish to try. The onions on top were good and although I usually love onions, I think this dish would've been okay without it too. <br><br>Tamales- I love tamales in general. This was a unique dish because it was in the bowl and bathed in the soup/sauce. It was a chicken tamales and I'd say it was pretty good to try. I think I would love it more if they had served it with some tortilla chips with it? <br><br>Overall, I'd definitely go back! Great food, great service, & great experience!", "pics": null}}, {"review": {"des": "We came here for a Sunday Brunch! As busy as it was, we got seated almost immediately! Service was fast and efficient! Great atmosphere! The Chicken Fried Chicken was the best! Started off with the Beermosa - different but great! Hit the spot for me! All four of us tried different dishes and took tastes from each meal! All of which were awesome!", "pics": null}}, {"review": {"des": "Little gem tucked away in a corner in Wicker Park. One of the best diner experiences yet in the Windy City. Came here on a Sunday morning for breakfast and waited only a few minutes to be seated.<br><br>Ordered the egg white omelette and their oatmeal bowl with berries and it was all delicious. Also ordered their Bloody Mary and it was delicious and spicy. Great experience overall. Service was great and attentive. We were seated in the bar area and had a great view of the kitchen. Everything was great, from the food to the presentation. I definitely recommend this place!", "pics": null}}, {"review": {"des": "Overrated in my opinion.  The menu is very limited and seems to have mostly seafood and pork options.  I opted for the brisket taco Norton and they said they ran out of it by 8 PM on a Saturday night!  I ended up having bacon and eggs with overly sweet grits on a Saturday night for a birthday dinner.  Extremely disappointing and with all the options in the area I doubt I will go back or recommend.", "pics": null}}, {"review": {"des": "Yumm!! Try the ceviche and any food on the menu is amazing!! If you love mezcal drinks, you will love this place!! Food is consistently great and staff is always friendly!", "pics": null}}, {"review": {"des": "Perusing the menu at Dove's Luncheonette reminds me of that joke:  \"An African-American, a Mexican, and a Jew walk into a bar...\"  <br><br>Is that not what you'd think if you saw a menu that contained \"Chicken Fried Chicken\" (sic; $16), Pozole Rojo ($13), and Whitefish Dip?  <br><br>It's the ultimate rainbow coalition; it all gets along together quite marvelously.<br><br>Even though my server described the \"Back to Life Cocktail\" ($14) as having more than 8 ounces of seafood (crab, shrimp, and squid) I couldn't contain my enthusiasm for the menu.  I went big and ordered the Pozole Rojo too, heeding his warning, \"you'll definitely have leftovers...\".  <br><br>He knows me not at all.  <br><br>The \"Back to Life Cocktail\" was a thing of joy both in flavors and presentation.  Served in a large glass ice cream sundae cup, the habanero-spiced, avocado-topped seafood cocktail was fabulous enough that I considered ordering a second, for dessert.  If you like seafood, don't miss it.<br><br>A giant bowl of Pozole Rojo was the perfect spicy accompaniment and sated me in a way that the seafood cocktail alone could not have.  Leftovers?  None.  <br><br>I sampled the pea and gravy-topped Chicken Fried Chicken as well; not my thing but if it's yours you should be quite pleased.  <br><br>Dove's Luncheonette is essentially an old, well, luncheonette, something we don't have in California.  The decor has been kept intact but there's no mistaking that the place is very hip, very 2016.  I loved their food, the service, the vibe... everything.  The name sounds like some \"meat and three\" joint from the deep South but the space is anything but.  Great place.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kmDdZ5dpARWwknVOJVIKlQ/348s.jpg", "caption": "The \"Back to Life Cocktail\" ($14) holds more than 8 oz of seafood & will make you this happy.  Get it!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KK-LvrCRWbtspWd0Mv___Q/168s.jpg", "caption": "Pozole Rojo ($13), spicy and warm and filling."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kQNpt3b_BowhljxmQrCHuA/168s.jpg", "caption": "Chicken Fried Chicken ($16), very well executed."}]}}, {"review": {"des": "Three words: burnt ends hash. <br><br>Everything at Dove's is amazing from the avocado toast to the back to life ceviche. Highly recommend grabbing brunch here. Burnt ends hash is easily in my top 10 favorite meals. Seriously unreal. <br><br>Keep in mind there will be a wait on weekends, but it's totally worth it! Parking is the worst over here, so I recommend taking the blue line or parking via SpotHero (they have a spot right down the alley next to Dove's).", "pics": null}}, {"review": {"des": "Back again at Dove's today.  Crowded as usual Sunday brunch - almost turned around and left as there was a wait, but Cordina (hope I spelled your name right) was there up front offering me coffee, making sure I had cream & sugar, giving the warm, welcoming kind of greeting that charms.  So I stayed and had the delicious chicken fried chicken which I've had once before. Katie was my server (again, hope the spelling is close enough) and very good-quick, alert, responsive, pleasant.  In a small space that's packed with people, I'm sure it gets hard to come off relaxed and friendly all the time, but these two certainly did.  Add Curtis Mayfield music to all that and I left happy.", "pics": null}}, {"review": {"des": "Michelada! Michelada! Such a perfect mix of like juice to hot sauce to Pacifico ratio! Order one to paid with your Mexican fusion brunch and you're good to go. It's an interesting setup as many have noted and I wasn't expecting such great mexican cuisine at first (after having lived in San Diego and all) but I was pleasantly surprised. I got the Pozole Rojo and although they could've added more cabbage and another lime, it was absolutely delicious. It's not your grandmothers or mothers pozole but it's a fresh twist, that's for sure.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mjIC_tNXHACnQa0-IC7LzA/348s.jpg", "caption": "Pozole rojo with the fixins'"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KxgMB9ZVm6DvABsTzTf7og/168s.jpg", "caption": "Pozole rojo"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ksyiDUZ9HqD0nBMBSUipTg/168s.jpg", "caption": "Aerial of pozole rojo and the fixins'"}]}}, {"review": {"des": "Went there for lunch and was quite impressed. The Pozole Rojo tasted authentic and really rich. The portion was good. I only wish they either served it in a smaller bowl (the bowl was less than half full anyways), or gave me a bigger spoon. It was really hard to navigate that small spoon in that humongous bowl of soup.<br><br>Would definitely recommend.", "pics": null}}, {"review": {"des": "Going to Dove's feels like going to an old-time diner except that they serve fancy versions of food. Cheese dip transforms to pimento dip, toast is spread with avocados, and their super crispy fried chicken is amped up with peas and gravy.<br><br>We've gotten delivery from Dove's and really enjoyed their food in the comfort of home; however, I just had the full Dove's experience with Daniel C where we dined in. I recommend both!<br><br>Parking wasn't nearly as difficult as anticipated. I snagged free street parking about two blocks south on Damen whereas Daniel paid the meter for his spot north. Then, we were also surprised that it wasn't busy when we went for dinner during the week.<br><br>I think that all of the seats are counter - whether at the huge bar/kitchen area or along the walls and windows. We balanced on cushioned stools bolted to the floor and swiveled to face one another.<br><br>The bar tender and server was amazing. He was perfectly pleasant and helpful. At the end of our meal he surprised us with a spicy juice pallet cleanser.<br><br>In regards to the food and drinks, I assert that there are a few menu items for everybody. A number of things will appeal to you and others won't. For example, I loved my beet salad and blood sausage. The duck was a little salty and hard to eat and I preferred the fried chicken. However, it was clear that all of it was well constructed from quality ingredients.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Asec2-fKXOKiO6yH5FLzcw/168s.jpg", "caption": "Country Captain  (duck leg) $17"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UjIvVptisRtW_Xp5cVFTWQ/168s.jpg", "caption": "The Violet Spring cocktail  $10"}]}}, {"review": {"des": "Came here for a late night bite last week.  Maybe it's the are but $11 for a burger (and no fries!) seemed steep.  It was tasty but I don't know that I'd go out of my way to come back for late night food at least.", "pics": null}}, {"review": {"des": "Coppa de Puerco is my favorite and always great to sit at the window seats for good people-watching on Damen. Cozy and not for those who don't like sitting close to others.", "pics": null}}, {"review": {"des": "Such a cute, albeit almost aggressively hipster, little place. We had an awesome lunch -- the brisket burnt ends hash was deliciously smoky.  Coming from Texas, I'm a bit picky about how I like my hunks of carnivorous pleasure -- I was very surprised to have amazing BBQ that tasted like it had been cooking overnight.  On the healthier side of things, the butternut squash soup was a delightfully fresh treat with little bursts of lime in every bite.  The spicy arugula salad was simple but also great.  Would love to come back for brunch and drinks!", "pics": null}}, {"review": {"des": "Really excellent food and ambience. It's what you want a modern diner to look and feel like. It encapsulates the relaxed but earnest feel of Chicago well without trying too hard. <br><br>I had the pozole rojo. It was bursting with flavor, warmth and spiciness without leaning on salt and grease. I couldn't put down my spoon and forgot my surrounding when eating it. It is the best Tex Mex meal I've had (in comparison to the Tex Mex genre I experienced in Austin Texas).", "pics": null}}, {"review": {"des": "One of the cooler places that I have been to in a while and it even had a cool view from the bar. I would recommend going there in any chance you get as the food is excellent. I had some sort of burger melt and my companion tried the fried chicken. Both were very good. <br><br>The only downside to this place are the hipsters that are working the joint. There were a couple times that I got dirty looks trying to navigate the small restuarant but other than that everything was pretty cool and tasty. Try this joint out.", "pics": null}}, {"review": {"des": "Dove's is located in my favorite area of Chicago- Wicker Park. It's across the Metro Station and very centrally located.<br>They offer a nice American style breakfast, with great coffee.<br><br>The atmosphere and style of this place is also very cool. They have a mostly counter style seating and everything has an old school touch, but in a very positive and fresh way. Also, they played the music from LPs which really put the cherry on top.", "pics": null}}, {"review": {"des": "Such a great vibe to this place! The fried chicken with chorizo gravy is so delicious I can eat it everyday! Very good brunch place - come between 10 and 11am and you don't have to line up for long.", "pics": null}}, {"review": {"des": "This place is a cute small diner. It's busy during brunch hours on the weekends (no surprise) but they text you when your table is ready so we walked around the area and stopped in the farmers market. This place is best suitable for small groups. The enchiladas were good.  But they ran out of some of their biggest hits by 1pm. So go early if you want to get the hash or tofu toast", "pics": null}}, {"review": {"des": "I really truly loved the food.  I like to compliment the cooks the food was terrific.  I actually liked everything we order which basically was the entire menu.  The shrimp cocktail was mmm mmm good.  The pancake was fenominal.  The carnitas was ok very little meat it was a hint of carnitas.  The eggs with boold sausage superb.  The coffee was a little bitter for my palate and the potatoes was delicious.  I really wanted to give this tiny restaurant. A 5 star but the service was horrible our server was so rude.  He lack being what his job title calls for a server!  He had the Uthesity to say out LOUD you are ordering too much food.  Who cares he was not paying for it,   the server never cleared our table.  Actually there is only one table.  Which we the customers have to share with little bar stools that spin.  There is no elbow room plus you actually have to sit on top of your coats.  I was very uncorfortable.  The only thing they have and am assuming is hooks for the purses or short jackets underneath the table.<br>the server really ruin my meal.  I had to ask him over for a fork,for coffee and I never got a refill.  The person that did all his work was the bus boy which he had to do so many things.  At the end of my meal I realized that the server had forgotten to bring me the syrup for the pancake.  The cream for my coffee.  Plus he was rushing me to leave because two big guys wanted to <a href=\"/redir?url=http%3A%2F%2Fsit.at&s=7ca2aa74914020569df807b54efadf9ae26790d555026501e3aa12d2d017fe57\" target=\"_blank\" rel=\"nofollow\">sit.at</a> my space so The server was like here is your check and I told him to please bring me a container to go and he stared talking rudeness <a href=\"/redir?url=http%3A%2F%2Fabout.me&s=2ab59b5a342ac06654ba400625388a78242a2d44f674a048081ff8b103703020\" target=\"_blank\" rel=\"nofollow\">about.me</a> with the.  other staff and not even being discrete about it.  How lack of ettiquite.  I hope thw owner of this restaurant reads my review and his server get some lessons to serve patrons because is a shame to lose business for the lack of service thw food is delicious and hugh serving sizes.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hAvafgcaMjJ6btQcyeUKmw/348s.jpg", "caption": "The walls"}]}}, {"review": {"des": "Honest review: didnt really like the food theres better mexican restaurants frontera grill, mexique,liberad, topolobampo/best breakfast at jam Service: didnt like it. this restaurant takes the cake for the worst service i ever had n ive had shitty service before. First we had to asked him for everything new plates more coffee everything he didnt so we asked the bus boy. 2 he forgot to give us things that came with the meal like maple syrup. 3 he rushed us like we were still eating n he gave us bill n kept comin to see if we paid then he had the audacity to talk shit to his coworkers that we didnt leave yet like when i say tlak shit i mean outloud swearin right by us so we could hear everything was the rudest moment of my life like literly ordered the entire menu it takes a while to eat n spent the most money out of everyone there. Ambiance typical dinner really small so be warned like one communal table n bar seating thats it best things: burnt ends hash/ carnitas/ blood sausage plz get a coat rack very uncomfortable to sit on ur jacket<br><br>Bring me back to life cocktail 14$: didny like this the portion is really big theres calamari octopus n shrimp its all fresh jus wish it had oysters because thats more traditional n tastes better. The issue with the dish is the texture of the seafood is really mushy that means thats its prepared way in advance lime cooks seafood making it more rubbery or mushy the older it is. Another issue is the cocktail sauce is really bland its really watered down it needs more ketchup then there was no spice like really and seasoning wouldnt order again <br><br>Chicken fried chicken 16$: didnt like this. The chicken was really bland like there was nothing special about it. However, it was really tender thats a plus. The gravy was bland and nothing special n there wasnt alot of gravy. I liked the addition of the onions n peas for sweetness to cut through the richness but needs something acidic n spicy to give it pop n put more seasoning best fried chicken i ever had was at longman and eagle<br><br>carnitas 15$: i loved this dish. The rice and beans were so flavorful n cooked perfectly. Loved the addition of sweet poatoe to add sweetness to the dish the best part is the carnitas there like pork belly n their so crunchy and rich and decadent   They didnt give us tortillas had to ask tht was annoying needs tortillas carnitas should already have tortillas included<br><br>Burnt ends hash 13$ really good jus a lil salty. The patoes werent undercooked but jus wish they were really crispy. Loved the aioli really rich and decadent jus plz put more ask for some on the side. The brisket was so flavorful n rich n decadent only issue it was a lil salty loved the addition of tje eggs because it was rich but it was overcooked. Loved the addition of cheese jus put it on the poatoes not the eggs n more plz bread wasnt toasted jus had butter on it feel like it would taste better if they added the shisito peppers here n got rid of other crispy poatoe dish like combine the two n it would be more successful <br><br>Buttermilk Pancake 13$ : i loved that the pancake was really fluffy and thick i hate thin pancakes. The bottom n edges were crispy loved that their filled with blue berries only thing thiugh the taste was basic like they could have put some really cool ingredients.  Loved the crema with lemon to cut down the richness n the sweetness i liked the granola for crunch but again basic flavors our waiter forgot to give us maple syrup <br><br>Eggplant Enchiladas 14$ the eggplant is the best i ever had supper crunchy n didnt have a weird texture. The issue was the sauce is extremely bitter n really smokey so obviously they didnt take the seeds out n enchilads need a lot of cheese woudnt order this again<br><br>Blood sausage was one of the best bites of the night. For people who never had it does not taste like liver or like if u cut ur self its really rich and decadent n extremely healthy for u loved the onions that added sweetness n sourcream which added acidity my only complaint is make the sausage crispy plz<br><br>Pozole: ran out really ran out of what ur famous for<br><br>Desserts: they get pies from hoosier mama pies really u guys cant make ur own dessert", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Op_X20iXD7sLXNwhKFrlfw/348s.jpg", "caption": "Eggplant enchiladas 14$ loved the eggplant supper crunchy sauce to bitter n not enough cheese"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gk2O-bdjkVPp9yRVgrPVXA/168s.jpg", "caption": "Eggplant enchiladas 14 loved the eggplant supper crunchy sauce to bitter n not enough cheese"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4rES9U5tUD_4GT_UMgq_TA/168s.jpg", "caption": "Bill"}]}}, {"review": {"des": "Tasty little place. Went in for lunch on Tuesday. It was busy but not overwhelmingly so, I was able to get a seat at the counter right away. I ordered a nitro coffee, the tostada, and the heart of palm salad. Everything was great and came out quickly.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QyRJdJ7n9IL5MSpRso1o1A/168s.jpg", "caption": "Tostada"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-MjVfuUWPyd1G9d_zXNMQw/168s.jpg", "caption": "Heart of Palm salad"}]}}, {"review": {"des": "The mussels are out of this planet. They are cheap and even if sold as a small dish, it isn't that small.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eVrQOkD699OTwSvGj6hTmg/348s.jpg", "caption": "Mussels"}]}}, {"review": {"des": "Been dying to go since trying them at a food event. Came here for lunch and enjoyed the blood sausage, potato & pepper hash, gazpacho & avocado toast. The gazpacho was more like a yogurt topped with granola, perfectly refreshing for a 90 deg day. I liked the flavors and crispness of the pepper & potato hash but there were only 4 meager pieces of pepper in my fish. Sad. Likewise, thought the 3 pieces of blood sausage for $9 was overpriced. Avocado toast was nice as it came with Michigan strawberries. Will have to try the excellent looking ceviches next time!", "pics": null}}, {"review": {"des": "I really dig the 70s Mexican diner vibe of this place! The place itself is pretty small, filled with diner stools for seating, and has an open kitchen. <br><br>The food certainly sets this place apart! All of the harmonious flavors and textures in the fried chicken made my taste buds sing, and their cocktails are unique and pack a punch as well. 10/10 would recommend", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JcP8S0tmllQNzg1SFB90Ag/348s.jpg", "caption": "Looks like a pigsty but with flavors that would make pigs fly!!"}]}}, {"review": {"des": "Stopped in for a quick respite.  Had the Machaca Breakfast tacos.  I wish I could say they were the genuine thing, but I wouldn't know.  I do know that they were very tasty and very generous in proportion (almost a dish that could be shared if you weren't super hungry--sharing might be the way to go on this menu anyways).<br><br>My server was helpful and watchful to make sure things were going as they should.<br><br>I'm thinking of the burnt ends hash next go-round, requiring some planning of a companion.  Next time!<br><br>Oh, and the iced tea (Dove's blend) was notable for its tasty uniqueness.", "pics": null}}, {"review": {"des": "Dove's was 100% dreamy. The nicest server ever, a totally scrumptious menu with good variety of veggie/carb/protein options, and that adorable modern diner ambiance. So loveable.<br> <br>We originally went to Big Star next door, because their patio is so happening and that naturally induced some FOMO. But really, it's rowdy and it's just tacos. <br><br>We decided to be grown-up and eat at Dove's next door (same owners, after all). No regrets! Great people watching from the window seats, and a way more interesting menu than Big Star. The food is so beyond basic here, they really know how to pack a flavor punch. The potatoes & peppers are a must. The grilled romaine and cauliflower fritters, also great, but the potatoes were the stand-out. Put their homemade salsa on everything! It's amazing, more like a paste, made from sesame seeds and chipotle and other crazy stuff. <br><br>Love that they serve wine by the glass or carafe. Breakfast served til 3pm on weekends. A totally hip & memorable Chicago meal.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cE0HqmzYBzil6dokikKNsg/348s.jpg", "caption": "Diner vibes inside"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oT2IKF8N65-s7yACxIeXlg/168s.jpg", "caption": "Custom drink: sparkling water & grapefruit juice. They're super accommodating"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/amGMpYdHxnVUl31hk0NEug/168s.jpg", "caption": "Potato & pepper hash, heaven for potato lovers"}]}}, {"review": {"des": "This review is long overdue, but this place is AMAZING... It has a super-hipster vibe, communal seating and delicious food. We came here for a late brunch on a Saturday afternoon, waited about 20 minutes by the door - not too bad! So many different options and everything looked amazing.", "pics": null}}, {"review": {"des": "This place was exactly what I was looking for. Has character, top drawer service and a breakfast that did not disappoint. I went with the burnt ends hash with eggs cooked exactly as I ordered. It was truly the best breakfast I've had in Chicago. I will most def be back", "pics": null}}, {"review": {"des": "First and foremost; the Oyster Omelette was breathtaking! Please do not leave Dove's without trying it. <br><br>Now that I've got the formalities out of the way, Dove's is an awesome little luncheonette located in the Wicker Park neighborhood. I arrived on a late Saturday morning with 2 dining partners and the wait was approximately one hour. I'll tell you now; it was well worth the wait (and I'm an impatient person lol). The good part about Dove's location is that it's surrounded by greatness from specialty clothing, shoe, hat and lingerie boutiques as well as cafés, donut shops, surplus stores and of course Wicker Park. We had plenty to occupy our time until they called the cell phone to notify us that our table was ready. <br><br>We opted for seats at the bar which was a super cool view with a super cool server. The drinks were spot on from the coffee to mimosas & cocktails. We all tried something different and sampled a taste of heaven in every bite from each other's plate. I must say....my Oyster Omelette was a real crowd favorite.<br><br>On to décor (because well, décor is crucial to me). Think 60's nostalgia; juke box player, chrome detailing, window bar stools that swivel, linen napkins, heavy silverware, beautiful ceramic mugs, dimly lit well kept restroom & servers with style. Do not overlook Dove's as a dining option; I'll never forgive you.<br><br>~Christy", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XMNsrP1SgFNPtsYWKQIHyg/168s.jpg", "caption": "Facilities"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/F5QNr6otkwitIZbrnO1ckw/168s.jpg", "caption": "Libations"}]}}, {"review": {"des": "We had the red pozole and the calabazas enchiladas.  Fast, friendly service and some serious flavors are packed into each dish.  The mole was super authentic and the pozole had a great blend of flavors and fresh veggies to garnish.", "pics": null}}, {"review": {"des": "Doves is one of my favorite places in Chicago.<br><br>My fiancé and I have been to doves many times and the food and service is consistently great.  The dishes are always creative , unique and flavorful.<br>The staff is amazing and always takes time to explain the dishes and how they are prepared.<br>The cocktails are delicious and they have a huge verities of tequila and Mezcal.", "pics": null}}, {"review": {"des": "Hands down my favorite restaurant in Chicago. The menu always has interesting flavor combinations. Every time I've eaten here the food is cooked to perfection. Cozy/cool atmosphere with friendly but not in-your-face staff. And the prices are crazy affordable for the quality. You can't go wrong here!", "pics": null}}, {"review": {"des": "Dove's Luncheonette is a cute diner atmosphere in Chicago.  We came in during President's Day and had a few minute wait.  There is a diner bar that lines around the restaurant and a a few tables.  We all ordered a round of coffees.  I ordered the Arroz Con Carnitas and it was an interesting mix of flavors that worked well together.  The braised pork shoulder was a little dry but other than that I was very satisfied.  My boyfriend ordered burnt ends hash and his was absolutely delicious.  His only complaint was that he wanted more brisket in it.  Their cold brew coffee is also amazing - highly recommend!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YqjHDsNeJCN7DRqf7Mbcew/168s.jpg", "caption": "Arroz Con Carnitas"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2Sr2HaMnFae0MYO35VFjNg/168s.jpg", "caption": "Burnt Ends Hash"}]}}, {"review": {"des": "Sooooooooo damn good! Check it out if you're in the area   Barbacoa enchiladas are the motha fuckin bomb! Sandwiches bomb! Drinks bomb, just go...you won't be disappointed.", "pics": null}}, {"review": {"des": "Wow! I just love how cozy and convenient this restaurant is! Just diagonally across from Damen Blue Line. I love the blue plates more than anything. The tamal con conchinillos was more on the salty side than I'd like, but the large unshelled shrimps made up for it. The brisket taco was also exquisitely tender! <br><br>Round Two * May 11th, 2016 * I just had to come back to find out the manufacturer of these beautiful blue plates. The waiter was kind enough to bring out all the different sizes and shapes they had in inventory. Ordered the chicken fried chicken. It was an amazingly fried succulent filet with green peas for an added pop of color.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FhgVuaC_Y-ofDeTuWQWOHA/348s.jpg", "caption": "Chicken fried chicken."}]}}, {"review": {"des": "Great ambience. <br>Only ordered the halibut, which I loved the fish, but thought the dish overall was a little lacking. The potatoes were a little bland, same with the avocado sauce.<br>The drinks menu looked awesome! But I can't comment there.<br>3.5 would really be the perfect number.<br>The climate was a little hot/cold so I found I was talking on and off my jacket a lot.", "pics": null}}, {"review": {"des": "Dove's had been only list for quite some time. I visited on a Saturday afternoon at 2pm for brunch. Our waiter was very friendly and willing to give me recommendations based on my dairy restriction.<br><br>Atmosphere- Very nice atmosphere, definitely a spot I'd recommend for brunch. No private tables, more so communal so it's better to come with a smaller group or after 2:30 or so.<br><br>Service- We put our names down and then walked around Milwaukee until we got a text saying our table was ready (we waited 25 mins but the wait didn't feel long because Dove's is located in a good area for walking around).<br><br>Food- The food was okay. Perhaps I need to try something else next time. I ordered the veal based on my waiter's recommendation- while it had a unique taste (combo of spaghetti squash, seeds, veal, and mole) the dish wasn't very filling (I was still hungry after) and I personally didn't enjoy the texture of the food. Most of the veal had fat on it so I kept picking around trying to find meat. It tasted a bit \"gamey.\" My friend ordered the barbacoa enchiladas which I liked better than what I got. Next time I may try the pozole which looked pretty good as well as the ceviche. It all depends on personal tastes!", "pics": null}}, {"review": {"des": "We just happened by this place and I am glad it did.  This place was awesome; great space, great food, and great service.<br><br>This is an old school diner and they have kept the feel. <br> <br>The food is a Tex-Mex place.  All the food was perfectly portioned for the price.  The flavors were clean and bold.  The ceviche was good.  I loved the pepper and potato hash and get it with the egg.<br><br>Forget the place next door, this was sooo much better.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Na33FNdTyAj74nKJ6_YRug/168s.jpg", "caption": "Hash and Salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xWAsD4pwi2DeuyxVeyHQ2Q/168s.jpg", "caption": "Ceviche"}]}}, {"review": {"des": "Had the fried fish on Monday March 19th, 2018 and got food poisoning. It's Friday and I'm still feeling it. Never going to come back again. Went through cold chills, throwing up and went through probably the worst feeling I've ever gone through. Not recommended.", "pics": null}}]}