{"name": "dryhop-brewers-chicago", "reviews": [{"review": {"des": "DryHop is a fantastic neighborhood brewery. They have a vast selection of ever changing beers and a decent menu.<br><br>I have been there multiple times and each time the staff has been friendly and helpful. They have recommended beers which have always been good. I am yet to drink a disappointing beer here. The first time I went there, they suggested a beer with a banana flavoring and although I was skeptical, it turned out to be delicious.<br><br>The food here too is delicious. We ordered some sandwiches and they paired well with the food and were reasonably priced.<br><br>An amazing thing about the brewery is that on Saturdays they pick out a beer from their menu and will refill a growler for just $7. That's a steal.<br><br>The only down side to this place is that because it's so popular, I've never actually gotten a table. Truth be told, I really enjoyed dining and drinking at the bar as the bartenders were fun.", "pics": null}}, {"review": {"des": "I've passed by DryHop of few times while being in Chicago and finally decided to try it. As soon as I walked in I was greeted by the host who told me it would be a 45 minute wait which didn't make since since I saw a few tables that were opened. Regardless we still decided to put our names down. We left and just hung around. When we got the text about 35 minutes later we came back and the same tables were still empty. We were seated exactly at one of this empty tables. Which was a bit frustrating.<br><br>I couldn't decide on what to order. I was conflicted with the double burger or the chicken sandwich. So my boyfriend and I got both and spilt it. Asked the server if they would be able to cut both since we were sharing and they were kind enough to do so. The burger was really good and juicy.  I definitely liked the garlic aioli that came with the burger not so much the ketchup. The chicken sandwich wasn't as good as I thought it would be. Was a bit bland. The Mac and cheese was also good. Very cheesy and flavorful. As for the beers they are pretty good. Would definitely recommend trying them. Overall it was a great place besides the wait.", "pics": null}}, {"review": {"des": "DryHop was hopping on a Monday night before Thanksgiving. I expected a party of 10, they did not accept reservations and did not seat before half my party arrived. There weren't a ton of tables but I think that is par for the course in that neighborhood.<br>Appetizers were good but small. The side salad was bacony and sweet and completely delicious and could have been a whole meal. I'm told burgers were excellent. Southern fried chicken sandwich was meh.<br>Food came fast enough. Staff was very professional and the bill was not outrageous. <br>Some our party is headed back soon for another burger and salad. Oddly enough, the beer was probably the least great part of the meal.", "pics": null}}, {"review": {"des": "I liked this place so much that I missed my flight!  (OK, the fact that my Lyft driver was on his first week and didn't know how to cellphone may have also had something to do with it...)<br><br>Lots of innovative beers here, many of them hop-forward...which is exactly what I'm looking for!<br><br>Service is fast and friendly, despite this place being packed to the gills on a Sunday.  I sampled a bunch of beers before deciding and the bartender remained conversational and friendly.<br><br>You gotta try the Shark vs Hipster beer, just so you can say the ridiculous name to your friends.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IlPKVYDEDrIzmaGvWDrSgA/168s.jpg", "caption": "brewing setup"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Imwk1yrjit_Ph-svjW8LJA/168s.jpg", "caption": "interior"}]}}, {"review": {"des": "Man- giving Dryhop a three star review hurts my heart. I've gone to Dryhop probably 100 times in the last five years and before last week it was easily my favorite restaurant in Lakeview, and probably all of Chicago.<br><br>The old Dryhop was comfortable, approachable, and most of all delicious- all the things you want in a neighborhood spot. My husband and I got married two months ago, and our friend who married us literally referenced Dryhop in our marriage ceremony because we love it so dearly. So when they rebranded their menu and decor, we were nervous about the changes to an already perfect place.<br><br>The decor is bizarre; they took away the awesome aspects of a brewery (wood paneling and chalkboard menus) and added strange tile to the walls? The seats are also sharper and way less comfortable than they once were. But honestly, I could have lived with the decor- the upsetting part is tied to the menu! <br><br>Dryhop had an amazing menu that was diverse and YUMMY! It had things like muscles, cheese boards, trout, arugula salad- not to mention staples like their burger and veggie reuben. Why change it!!! Sure, I can still order the burger and reuben, but off the new menu- the chips and salsa are dry and bland, jicama is bizarre, salad is meh, and fries turn cold instantly on the plate. <br><br>Worth noting that Dryhop still knows how to make a great beer and the staff is awesome. We love hanging out with everyone everyone and they always make us feel welcomed- even with all the changes. <br><br>Dryhop has been consistently busy every night I've gone there in the last 5 years. I fully understand the need to experiment with new concepts, but don't get the need to dramatically change something that's clearly working. We miss the Old Dryhop.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TuZL0ima05ixQa9mKpiiQw/348s.jpg", "caption": "new menu"}]}}, {"review": {"des": "I met up with a friend here for drinks and really enjoyed this lively little brewery. There were about 7 beers on the menu. We both got flights which included six 5oz pours for $16. All of the beers were great but my favorites were the Choiowa (citrus & vanilla flavor, really smooth) and the Wheatless in Seattle (could definitely taste the hint of banana and coffee). They offer growlers to take home as well. For food, I had a couple starters: mussels and poutine. The poutine was good but the mussels were my favorite dish by far! They were served in a coconut milk and curry flavored broth - it was such a unique combination. They were served with 4 pieces of toasted bread perfect for soaking up that delicious broth. <br>I had a good time at DryHop and will definitely come back if I'm in the area.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iT6SvqTpywrzNHBWRZJRCg/348s.jpg", "caption": "Beer flight"}]}}, {"review": {"des": "Dryhop is Corridor's sister brewery...we definitely know how to pick them because we came from Corridor and asked about Dryhop and they told us that it's their sister brewery. We decided to make our way to Dryhop because sisters share the same DNA... so that means Dryhop must be good!<br><br>We tried their hazy IPA and it was delicious, but we agreed that both are really good...but slightly like Corridor better. I like that Dryhop had more options too. Their hazy IPA was juicy and well made. Would totally recommend stopping here!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jwDhygWxMIN8i18idvsehA/168s.jpg", "caption": "Inside"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZZ_s-OBv6AV_mJzOfhLwnA/168s.jpg", "caption": "Beer"}]}}, {"review": {"des": "We drank here before going to the Laugh Factory, which is next door.  Beer was good!  Ate the tacos there after the show and they were AMAZING.  Was I drunk?  Probably, but they still amazing nonetheless.", "pics": null}}, {"review": {"des": "I really liked this place a lot. It wasn't packed when my fiancé and I went during the day and we didn't need a reservation. At the time that we went, there was a burger deal going on that started in a half hour and the waiter let my fiancé get the deal even though it wasn't time yet, which was nice. He got a burger and I got the buttermilk fried chicken sandwich with a side of mac and cheese. He orders a burger basically everywhere we go that offers burgers and he said this one was pretty good (which means a lot). The chicken sandwich was okay... It had a strange sweet element that I had to balance out with hot sauce on the table. I don't think I would have liked the sandwich if not for the hot sauce. Also, the mac and cheese was pretty boring and definitely needed salt. It wasn't a bad meal, but it wasn't anything to rant and rave about either. However, I reaaaally enjoyed the beers here. I would still come back for drinks and to check out some more food on their menu.", "pics": null}}, {"review": {"des": "Great place for brunch or lunch. The deviled eggs and tilapia tacos I had were yummy. The tacos went well with a Las Muertes cocktail. However the absinthe in this drink was a little too overpowering for me.<br><br>The burger my husband ordered was really lean and tasty. Definitely some good quality beef. My daughter ordered the poutine and it was equally delicious. Their French fries are great too.<br><br>We appreciated the dog friendly patio and clean restrooms for use inside. I would like to return and try more brews. I had a sample of the Tombstone IPA and it was good.<br><br>There was plenty of metered street parking nearby around lunchtime on a Wednesday. Nice shades outdoor seating under the umbrellas. <br><br>Great service here too.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1HF3cuVWyagMnu-bzvmGow/348s.jpg", "caption": "Blackened tilapia tacos."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/M3plLP99gwMptjQaRxH7Yg/168s.jpg", "caption": "Las muertes with plenty of absinthe flavor and an environmentally friendly paper straw."}]}}, {"review": {"des": "Dry Hop used to be my go to neighborhood spot. They had solid beer list (Shark Meets Hipster being my favorite), good food, and a homey, laid-back atmosphere. Recently, they \"refreshed\" the space, but I must say, it's a real disappointment. <br><br>While the beer remains the same, they cut a few of my absolute favorite dishes, including the Charcuterie & Cheese Board and Green Curry Mussels. Thankfully they kept the Vegetable Reuben, but to do away with such great apps is a real shame. <br><br>It feels as though they changed their look and feel to \"keep up\" with more trendy restaurants. The thing is, they didn't need to. The place was always packed and I frequently saw other regulars there on my visits.<br><br>Dry Hop, if you're reading this, it's not too late. We can forgive you for wanting to stay current, but please bring back the things that made the neighborhood love you.", "pics": null}}, {"review": {"des": "Best micro brew (small batch) brewery in the city, in my humble opinion.  Great location, nice front patio area and inside is \"small\" but just the right size for the size of the brewery.  Awesome food.  Barman's banquet, HIGHLY recommended (burger, fries, beer and a shot) $15, on Tuesdays.  Can't go wrong with their staple, shark meets hipster, but always a recommend the flight.  Check it out!  It's worth the trip.<br><br>11/6/2018<br>After reviewing the recent reviews regarding the change it atmosphere- I 100% agree. It doesn't feel the same and in my opinion the olds dryhop was better.  Not the same feel.  A bit disappointed. It feels more pretentious for lack of a better word.", "pics": null}}, {"review": {"des": "Finally made it to DryHop! I had the shrimp tacos and they were flavorful with just the right amount of spice! The macaroni and cheese missed the mark it was soupy and bland. The service was efficient and friendly. I was very impressed with the servers knowledge of the vast beer selection. She also gave us a great overview of the food menu. Atmosphere here is fun, upbeat, with a very open floor plan. I have often walked by in the summer months and very much like that the floor to ceiling windows are open which makes for great people watching. I will definitely be back.", "pics": null}}, {"review": {"des": "I, for one, am blessed to live in a city with so many wonderful breweries. From big to small, from nationwide, to regional, to local, from north side to south side...all of these breweries have one obvious factor in common: BEER ON TOP OF BEER ON TOP OF BEEEEERRR! And the wonderful thing about all of these breweries is that each of them are as different and unique as you and I, so one night when I was in the Lakeview neighborhood near Belmont ave, I decided to stop by a spot that was on my radar for a while now. <br><br>While Dryhop is small in space, it's...well kind of small in beers as well. Not too many to try out on draft, but the few drinks they do have available provide a deliciously hoppy experience. Not too keen on these ridiculous names of the beers, however. Shark Meets Hipster? Really? At least it tasted good, though. Prices aren't bad neither, and you can have these drink in different sizes from 10oz to I believe 16oz glasses, as well as the flights, which is always an essential brewery item to purchase. <br><br>I don't know of too many breweries in this exact neighborhood, so this is a place I would recommend some big beer drinkers to check out. I believe they sell food here as well, along with other non-Dryhop branded beers/liquors. I saw a lot of trophies hanging around for what I assume was for some top beer awards, so good for them! America revolves around great alcohol so Dryhop, keep on rockin' in the free world and keep doin' what you're doin'!", "pics": null}}, {"review": {"des": "DryHop is without question a solid choice in Chicago. I'd go as far as to say it was my number one place to go to. Then this week they 'refreshed' it to mark 5 years of doing things right by, well... doing them wrong.<br><br>The beer choices remain great and first and foremost this is a brewery but the menu changes are all a backwards step.<br><br>They've introduced a second burger and we didn't need another burger choice when the first one was one of the best in the city.<br><br>The Mac n cheese has gone from iconic to, well...The same as every other place serving mac n cheese.<br><br>The refurb isn't that noticeable apart from the larger bar stools that make it too tight to actually sit at the bar.<br><br>The menu for food lacks inspiration and the staff even appears to know it. The word seemed to be that others had fed back to the negative.<br><br>Fun experiment dry hop but if it ain't broke, don't fix it!", "pics": null}}, {"review": {"des": "My first time at a brewery and I had a great time.<br><br>My bestie want to do beer tasting so we ordered a flight of beer  and we order some food. The ambience  was cool but it very loud.<br><br>I ordered chorizo and potatoes taco which was really good juice and filling. I also ordered fries which are smaller than normal fries.<br><br>My bestie ordered a pork bun sliders a little spicy but she enjoyed it. I loved the location of the place right in lake view East area.<br><br>My only downfall was there was nothing to dry my hands with in the ladies room. I informed staff of this information and I hope they got on it.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/38GzKmgxH_rw7HQYoRqVLA/348s.jpg", "caption": "Frites"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_8niNSCKkSHfSP6Ix9D6MQ/168s.jpg", "caption": "Chorizo and potato tacos"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6evRRtM-Iy80180AbS4VSQ/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Dryhop is such an awesome spot in Chicago and walking distance from my apartment, which is a huge plus :) <br><br>You can grab a seat at the bar, or at a table and browse through their extensive list of beers. My favorites are the IPA and the Saison. When in season- the Saison is INCREDIBLE. Nice and flavorful with a just a hint of peppercorn. <br><br>The burger is delicious- highly recommend with the beer. Make sure to get the garlic aioli if you're ordering fries. <br><br>I wouldn't get the kale salad again. Not sure why I ordered it in the first place at a brewery, and I was deeply envious of my friend who was enjoying his perfectly cooked and topped burger. Love the family and friendly vibe at Dryhop and can't wait to go back!", "pics": null}}, {"review": {"des": "For ipa lovers their shark to hipster is excellent- hoppy but balanced. And the chicken sandwich was both huge and delicious. It's a keeper at this relaxed spot with sufficient buzz to kick start the night", "pics": null}}, {"review": {"des": "Ahh where do I start. I have loved Dryhop ever since they opened their doors several years ago. What I loved the most was the cozy and welcoming atmosphere, the staff and of course the amazing beer and food offerings. Dryhop is our goto local restaurant and always was clutch whenever my wife and I were craving something unique like the mussels, cheese boards, carbonara, poutine or an awesome cocktail.  The menu in concert with the great range of beers really made each dining experience and unlike anything in the neighborhood. As soon as you walk into the restaurant you are greeted by a large beer list on a chalkboard with all these awesome handwritten drawings that simply added to the personality and unique atmosphere of the business.  So when I got wind they were changing their classic menu to something with more options and also renovating.... I said hey why not I'd gave it a chance it's Dryhop they can't mess this up.....<br><br>Fast forward to now. I have to say it pains me to say that they dropped the ball. Like really dropped the ball. The interior feels contrived and semi commercial (glad they didn't add TVs). The new menu is bland, flavorless and and pretty bizarre all around. I see that they are trying to \"appeal\" to a broader audience and be more \"trendy\" but this isn't the right move. More tacos and whiskey cocktail options are nice to have in theory... but shifting from a really unique menu and flavorful smaller tacos-- to two oversized, flavorless-flour tortillas and a bloated sandwich-focused menu, just boggles our minds. I feel like Dryhop is trying to appeal to the Cantina or Big-star crowds with the new taco options... but they are just not great. Flour is not the way to go and the seasonings and elements combined just fall flat.<br><br>The Original Burger (which I think is the best in Chicago) is basically the same but they have swapped out the applewood smoked bacon for the predictable everyday bacon that you can get at the local grocer. The Double burger is good but not great. Nothing against the new Chef, but the previous executive chef had it right. I'm all about giving new chefs a chance to make their mark, but don't change something that was working so  sooo well. I still can't for the life of me wrap my head around removing the Mussels. It's a fan favorite amongst our friends and family and nothing like anything i've had at any other restaurant in Chicago.<br><br>I really hope they take all the feedback to heart and rethink this new menu... If they want to introduce new things they should utilize \"Specials\" as a means to test out new items. <br><br>We used to come to Dryhop several times a month.. but now I feel like it will be just whenever we are craving a good craft beer or burger. I still am hopeful and think they can still turn this ship around.<br><br>Cordially,<br><br>Your concerned yet hopeful customers", "pics": null}}, {"review": {"des": "Dry Hop's beer list changes constantly. I have learned to see what is on draft before being seated. If there is no beer I like, I wait for next time. When there is a good beer, it can be great. <br><br>Too loud inside unless the windows are open. Even then, hard to hold a conversation. Sitting outside is different: great people watching, and you still hear the crowd but not as loud.<br><br>All the sandwiches are good. Specials can be hit or miss. The burgers are perfection.<br><br>Sit outside on a warm day when they have an interesting IPA on draft. Eat a burger. If all those things come together, life will be good here.", "pics": null}}, {"review": {"des": "Got the \"Betrayed By the Name\" beer which is a saison. So good, not too heavy but not super light either.<br><br>The buttermilk fried chicken sandwich is so freaking good. That pimento cheese will make you ooze. <br><br>The atmosphere is great. I try to go earlier because it gets super busy during rush times - a sign of how good this place is. Service is still great during rush times though.<br><br>The beer is mostly IPAs (Dry Hop) so it's a middle class millennial's dream.<br><br>Great all around", "pics": null}}, {"review": {"des": "I went in with tempered expectations and came out a huge fan. Thinking this was going to be no more than belly fill and only slightly better than the typical beer and slop barns that call what they serve food, I have to tip my hat to the whole operation for delivering an excellent meal and experience. <br><br>The host was friendly and got us seated right away at the bar. The bar guys, were sharp, friendly hard workingand efficient. Thoughtful menu with some interesting choices. The food was expertly prepared and presented in what appears to be a rather small kitchen. Food came quickly despite the place being packed. I watched other food plates go by and they looked well prepared and delicious as well. <br><br>The place was clean, organized and well managed. Didn't try the beer as I was in breakfast mode but will definitely return for that review.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_0BvA-djI45Eu5nrNuot8A/348s.jpg", "caption": "Breakfast bowl"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/U11bjiMkzOYJD4TzljnL1A/168s.jpg", "caption": "Great food"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FMCgLb6bf-S5fhme-x0mjQ/168s.jpg", "caption": "Great space"}]}}, {"review": {"des": "I came here the other night for dinner before my haircut appointment. I have been to Dryhop many times before as I used to live in the neighborhood. Overall, the beer is decent, but the food is where it's at. <br><br>I got the burger, which I've had a few times and it's also on some lists as one of the best burgers in Chicago. The Ancho-Chile Jam is very tasty to go along with the burger and arugula. You can also add bacon and an egg. The burger is up to bar and I highly recommend it. A good comparison is the Ella Elli Burger in the Southport Corridor. Other food items I'd recommend are their Mac and cheese, poutine, and brunch. Food 4.5 out of 5. <br><br>Dryhop's beer is only decent, but they have some good beers as well. Shark Meets Hipster is by far their most popular beer and it's above average for a fruity ale. I had the Milkstachio, which was pretty good and is their seasonals. My other recommendations are Dopesmoker, Heat Miser Meets Yuppie, Photobomb, Screaming Life, and Laser Headlights. Beer 3.5 out of 5. They also have quite a bit of whiskey so if you like whiskey then this is a solid option.  <br><br>Prices are average for Chicago. I really like the setup of the place how during the summer it is open air and they have a patio. The bar is nice and spacious. Service has been good everytime. Overall, I enjoy Dryhop. I wish their beer was a little better, but I am a Beer Advocate so that is why I am picky.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9cXTxU0zFkUMfH_W3KkYvA/168s.jpg", "caption": "Pipeworks Mocha Abduction 10.5% ABV"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VGDcb3iazitu9nyiufckLw/168s.jpg", "caption": "Burger and Mixed Greens"}]}}, {"review": {"des": "Came here on a Wednesday night, and it was a very lively scene. I came for both the beer and the burger, and both did not disappoint. For beer, I had the one with Cubs in the name. It was a nice smooth beer.<br><br>The burger was also really good. It had crisp thick bacon, caramelized onions, a tomato jam, and cheese on it. The bun was brioche which added to the flavor, and the meat itself was a really good blend and juicy. Fries were also an unexpected really good surprise with a nice aioli for dipping", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WsZr5sAL3vskVu3pAktMZg/348s.jpg", "caption": "Cubs beer"}]}}, {"review": {"des": "I give DryHop a solid 4 stars. Unfortunately, I went to this beer heaven of an establishment when I wasn't drinking, but their food was delishhhh. I got the pretzel and although small it was very tasty. My friend got the burger and was beyond pleased with her decision - the fries looked to die for.<br><br>The staff was attentive and friendly - splitting our check without even asking. We sat right inside; however, they do have outdoor seating. What steered us away from sitting outside were all of the bees (we saw someone get stung, ouch!). They have a few larger tables so I'd definitely recommend coming with a group. Also, bar space so coming with 1 or 2 is just as enjoyable. Overall, cool spot and as I said before, a solid 4 stars!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8vBg_VOLTAoXuuq3oXL6EQ/348s.jpg", "caption": "Indoor space"}]}}, {"review": {"des": "The food at the place is awesome. It's typical brewery food with some interesting twists that make it unique. I had a portobello reuben that was super good. I love the atmosphere of this place, but be warned, it's usually pretty busy - just don't expect to sit down right away. They don't take reservations. We stop in just about every time I'm in this part of Chicago!", "pics": null}}, {"review": {"des": "Great neighborhood joint. Brews are yummy, and the food options are diverse. I would definitely recommend coming on an off-night or well past the dinner rush. Long wait times are no fun and there also seem to be times when the local parents come in and crash?<br><br>Anyway, love the food, love the prices, love the brews, love the ambiance. Definitely at the top of my list!", "pics": null}}, {"review": {"des": "One of the best burgers I've had in a long time, even without the bun. This perfectly cooked juicy burger was topped off with cheddar cheese and thick crispy bacon served on a bed of greens. I opted for the side salad which could be it's own meal. Colorful greens, cranberry,  yellow beat and goat cheese tossed in a light dressing. Full house on a Monday night. No reservations taken.", "pics": null}}, {"review": {"des": "DryHop is down the street from my apartment and I pass by often. I've been a handful of times now and have never been disappointed. I met a friend there this week for dinner after work and sat along the bar. I love sitting here as you can check out the brew kettles and their impressive display of whiskeys and scotch. In the past I've been unimpressed with the 6 or so beers on offer. While unique, in the past they've been quite hoppy and I haven't found much on the light and refreshing side. That changed this week when I found two beers I really loved.<br><br>I first tried a pint of the \"Mr. Banana Grabber.\" Weird name but a delicious hefeweizen. It was smooth and had a nitro finish to it. I could drink this all day and the banana and vanilla flavors are great! <br><br>Next I tried the \"Wolves Loose in Koln\" and this was good too. A light and refreshing beer perfect for the summer. I followed it up with more banana because it was just that good.<br><br>As for food I opted for the Carbonara. I have had the burger and mac and cheese on a few occasions and felt like something different. For a brew pub the Carbonara looked very well put together. It looked like something you'd find at an Italian restaurant. The taste was great too however the chef was very liberal with the black pepper. I'd definitely have it again as it was just the right portion size and left plenty of room for another beer. <br><br>The service along the bar is always good. The bartenders/wait staff are attentive and are always quick to offer a taste if you want to sample a beer. My only complaint about sitting along the bar is that food is brought to you from behind given the location of the kitchen. I have nightmares of food spilling as it is lifted over my shoulder... But if that's my only complaint this place is pretty great. I'll be back. Great local spot.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zUcTYfH1peUxoOT0tetweg/168s.jpg", "caption": "The Carbonara. Pretty good but a little heavy handed on the pepper. Would have been great if the noodles were house made."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IeyEZerDJQuBR7-9dU8QMw/168s.jpg", "caption": "Mmm beer. A \"Mr. Banana Grabber.\" Delicious and smooth, almost like a nitro."}]}}, {"review": {"des": "This place is amazing. I have only written two other yelp reviews and both were so I could complain so you know I really mean it when I say this place is the sh*t. First of all, if you're not ordering the burger, you are really messing up bc the burger is LIFE. CHANGING. I took about 3 bites and felt a deep motivation to start a slow clap for the chef. It is a symphony. Of flavor. In your mouth. <br><br>Wash it down with the Shark meets Hipster brew. And don't forget the fries. THE FRIES. More like the sauce, because the lemon aioli and spicy sweet ketchup are what you never knew you were missing in your life. The brewpub has a great ambiance and the beers are solid. The burger deserves a trophy. Five. Stars.", "pics": null}}, {"review": {"des": "I came here for Sunday brunch (Kegs and Eggs is so clever) and had a good dining experience. The interior is industrial and open and gives off hipstery vibes. It was pretty noisy, but I never felt like I had to shout over the table to be heard so thumbs up for that!<br><br>I ordered the Skillet Scramble. The scrambled eggs and chorizo were absolutely delicious and flavored perfectly. To be honest, I was a bit bummed when it came out because it looked tiny! Although the portions do look pretty small, it was surprisingly filling. With that said, I do think it was overpriced for how much you're getting. <br><br>The food was pretty good, but I think the best part of the experience was definitely the service! Our waitress was really nice and patient, even though I took really long to order. Our drinks and food came out super fast, maybe within 5 minutes of ordering, so I'm super impressed with the service. Overall, solid gastropub options in a unique venue!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ClZstCRCmDn88kusx2Ri-g/348s.jpg", "caption": "Skillet Scramble for brunch"}]}}, {"review": {"des": "Ordered the Skillet Scramble which was a bed of crushed potatoes covered in chorizo & eggs with salsa verde, sour cream, cheese & Scallions. The portion was real small but the crushed potatoes were the best part. The Skillet was very bland & lacking in flavor, especially considering it had both chorizo & salsa verde, there should have at least been a HINT of some kind of spice. <br>The beer menu is great and the customer service wasn't bad but I definitely wouldn't return to try anything else on the food menu.", "pics": null}}, {"review": {"des": "Great atmosphere, we went on a Tuesday night and there was no wait. Personally,  I liked the Chorizo potato tacos at DryHop better than Big Star's chorizo (popular Chicago taco place).. they were very flavorful and not too salty like some other chorizo dishes. Next, we had the carbonara, the egg on top made the dish unforgettable. <br><br>This place is known the beer, but I wouldn't skip on the food. We had the, Northshore Pom Pomade, MapleWood Brownie Points, Hubbard's Cave, and The Victorian Flavour.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/q7ZXul41OU2TKTGMRt49mQ/168s.jpg", "caption": "Chorizo potato tacos"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Tkvm_uFQsrmnPBFQrQ7mzQ/168s.jpg", "caption": "carbonara"}]}}, {"review": {"des": "Quite a solid gastropub with plenty of tasty house brews to choose from in a beer flight, as well as a huge food menu of apps, sandwiches, salads, and entrees that are several steps above typical pub fare and could hold their own if this place was just a neighborhood dining venue without as much beer.<br><br>As for the beer itself, I enjoyed unique brews such as the Awww, Chit, Bro! broyhan, the Shark Meets Hipster American wheat ale, and the My Mirrors Are Black stout with Ethiopian Yirgacheffe coffee beans from Intelligentsia. As for the food, I stopped by at the tail end of weekend brunch and enjoyed the Hank's Plate, which came with eggs, a choice of meat, potatoes, plus biscuits and gravy. So much calorific, carbtastic goodness.<br><br>Service was friendly, helpful, and engaging, and the venue is lively yet casual. A nice find thanks to all you Yelpers out there!", "pics": null}}, {"review": {"des": "I wish this place was closer to me. It embodies what all neighborhood bars should. Food is elevated bar food, service is friendly, but not intrusive, and the atmosphere is welcoming. Burger is delicious as are all the appetizers. And it goes without saying, beer is delicious, too. There is not a ton of seating, but if you time it right, you can snag a seat at the bar. But, go early as people tend to post up there for awhile. Cheers!", "pics": null}}, {"review": {"des": "We went here to day drink on a sunny Thursday. It was not at all as packed as I see it get on the weekends! Overall experience was fun! We started with cocktails rather than beers and they were both very well made. I ended up with a beer shortly after and liked it as well. <br><br>Our burgers/sandwiches were tasty. The breakfast one did get messy however. I was a big fan of the art inside as well as the little blurb about the artist on the back of the menu. I want to go back when the windows are open. They weren't open the day we went. I'm sure it opens up the space!", "pics": null}}, {"review": {"des": "I can't speak for their beer as I haven't tried it but their burger is hella amazing! Definitely stands up to any restaurants that specializes in burgers", "pics": null}}, {"review": {"des": "I had so much fun at dryhop! I met up on a bumble bff date and we both really enjoyed the atmosphere. We were looking for a place we could grab a quick drink after work, and they more than met our expectations! Everyone was super friendly and nice. The food smelled so good we ended up staying for dinner! It is also in a great part of town so I felt really safe walking home afterwards!", "pics": null}}, {"review": {"des": "I've been here three times now and whatever I try next is great. Its usually crowded on the weekends but that's a good thing. The pulled pork chilaquiles are sooooo good. I always enjoy getting a bite here.", "pics": null}}, {"review": {"des": "My party of five came here for the Monday special during dinner time. We got seated immediately but definitely expect a wait if you come on Fridays/weekends. Their Monday special consists of the 3 B's: burgers, beer, and bourbon (shot) for only $15! What a steal. The burgers also comes with fries. I thoroughly enjoyed the burger and most of the beer here are IPAs so fair warning for those who do not enjoy IPAs. Great atmosphere and great service!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mCO5X4pbFUaOSJ9c0IsBJQ/168s.jpg", "caption": "Monday special $15 for the 3 B: burgers beers and bourbon"}]}}, {"review": {"des": "I've been here twice now and was overall pleased with both visits. It is a wonderful place to check out in the warmer months when the garage-style doors are open to the street (is this what those doors are called? can someone with real Chicago experience please advise)?<br><br>Things I've eaten:<br><br>Hanks Plate - the biscuit is great<br>French toast sticks - medium decision<br>Biscuits and gravy - again biscuits are a good choice here<br>Breakfast burrito - medium/good choice. it could use more salsa + meat<br><br>Their beers are super delicious. Honestly, I was more impressed with the beer over the food but the real winner is their bloody mary.<br><br>Also, side note on the service piece. My friend arrived here and asked for a table for 3 but was told she needed to wait for her friends to arrive. We got there 5 minutes later and were immediately seated. However, some dude walked in 10 minutes after we sat down and he was just handed a table and not forced to wait at the bar. His date showed up 20 minutes later but it was cool for him to hog a table for 20 min but it wasn't okay for us to have one for 5? 2018 is all about the year of the woman so I'm just going to throw this out there. The end.", "pics": null}}, {"review": {"des": "We went here for a quick date night meal and were not disappointed! We got the Soft Pretzel as an appetizer, which was the perfect little snack to tide us over until our entrees arrived. The pretzel was fresh out of the oven and looked like a little loaf. The beer cheese it came with was really good (wasn't a fan of the mustard, but I'm not a fan of mustards in general).<br><br>For the main course I got the Skillet Mac & Cheese, which was <a href=\"/redir?url=http%3A%2F%2Fthabomb.com&s=e6dde8f2b30943082f7d600346ccddcb132b30060438326708af7e187d669a1d\" target=\"_blank\" rel=\"nofollow\">thabomb.com</a>!  It came with a fried egg on top, which at first seemed weird, but it actually complimented the dish really well. Pro tip: add the applewood bacon to this - you won't regret it. The mac & cheese itself was super creamy and flavorful - the breadcrumb crust added a nice texture to the dish as well.  My date got the Buttermilk Fried Chicken Sandwich and really enjoyed it.<br><br>For dessert we split the Skillet Cookie with Bourbon Ice Cream, and it was so damn good. The bourbon flavor in the ice cream wasn't too strong, which I appreciated. The chocolate chip cookie was absolutely perfect and paired well with the ice cream.<br><br>We'll definitely be back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KY4SnfF2L8YAzmTWnAuNNg/348s.jpg", "caption": "Skillet Cookie with Bourbon Ice Cream (you need this in your mouth)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fzkPcO9YVA09Oto6CLSI4g/168s.jpg", "caption": "Soft Pretzel (the perfect small appetizer)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7aq-EssNBAX1qIADlM-a5w/168s.jpg", "caption": "Skillet Mac & Cheese (ridiculously good)"}]}}, {"review": {"des": "This is my favorite place in Chicago to grab a beer or 2, a bite to eat, and enjoy the company of everyone around.<br><br>The beers - These guys are consistently brewing up the next best limited time offered beers in Chicago with the rotating beers list. If I haven't stopped by in a while I enjoy ordering a flight to try all 6! You can't go wrong with the flagship Shark meets hipster, but the rotating ones always offer a great new unique taste.<br><br>The food - one of the best burgers in Chicago. My other go to's are also the fried chicken sandwich  and skillet Mac and cheese. If you don't feel like ordering any thing big, have an order of frites with your beers. It's the perfect snack.<br><br>The space - no TVs, great music, and local art. It ya a industry rustic vibe with a beautiful long wooden bar. When the weather is nice the whole front of the restaurant opens up to make it feel like you are sitting in a covered patio.<br><br>Hope this review helps! <br><br>Cheers!", "pics": null}}, {"review": {"des": "One of my favorite spots in Lakeview. Awesome drinks, delicious food (recommend the vegetable rueben), and great service! Such a fun atmosphere, especially in the summer when the windows and patio are open. Cheers!", "pics": null}}, {"review": {"des": "I'm not saying that restaurants should be required to have gluten free or vegan options on their menus (besides salad), but I am saying that this place nearly lost three customers last night because I almost couldn't find something to eat other than a boring old salad. No thank you. Am I right? <br><br>Ultimately the waitress suggested the veggie skillet without the cheese, and it was pretty darn delicious. It looked a bit sad with this brown sauce on top, but actually it tasted great. <br><br>The restaurant is a bit too noisy as well. You'll have to scream to talk to your friends or spouse, but sometimes that's nice if you have some built up aggression in life. <br><br>Overall a pleasant experience. I'd go back. I just wish they'd have more options for people with food allergies. We want to feel normal and included too!", "pics": null}}, {"review": {"des": "We absolutely love this place! You have to try the mussels!!! So delicious! <br>The staff is great. Beer selections are great too.  If you like spirits, the bartender will work with you to find the right recipe to please your palate .", "pics": null}}, {"review": {"des": "Love this neighborhood brewery spot- great for friends or a date!<br><br>My usual go to is the Shark meets Hipster and a burger! Always with extra garlic aioli. Always. <br><br>Staff is super friendly and attentive. Will always be coming back!", "pics": null}}, {"review": {"des": "I came here for brunch and the space is a pretty small, intimate one. While we waited for our table we got a beer from the list that was currently on tap. Unfortunately, I was disappointed that they were mostly still pale ales and IPAs in November. I was really hoping to enjoy a more winter-appropriate beer. <br><br>For food, I ordered the breakfast burrito, which was delicious and had just a touch of sweetness inside, which was a nice contrast. I would come back for this alone. <br><br>Overall, the atmosphere was nice and the staff was friendly. I hope next time I come I can order a beer that's a little darker and a little stronger.", "pics": null}}, {"review": {"des": "New American brewery and restaurant. We went after a workout and just shared the chorizo and potato tacos (three and street sized) and the vegetarian stir-fry (good but strong sodium taste and small portion for $11 and $7 to add shrimp). <br><br>Fairly busy on a Sunday night, doors and restaurant opened up to take advantage of the beautiful weather. Patio and bar seating as well as tables. Service was intermittent but good. A bit pricey in my opinion combing all factors of ambiance, actual food and service.", "pics": null}}, {"review": {"des": "Great food and beer! I highly recommend this place. Loved it so much that we went there before and after the comedy show nearby. Staff was super nice and accommodating to a large group of us. Prices were reasonable too.", "pics": null}}, {"review": {"des": "Cool place with better than average food. Beers were good too, I'm not an IPA fan and that is about all they offer 8-10 beers on tap. Food was good. Trout was nothing like you expect. Looks like salmon and is very garlicky. It's also a bit noisy but you can still have a conversation. Worth the trip, will check out other places in the neighborhood before returning.", "pics": null}}, {"review": {"des": "The beers here are good, but the food needs works. I went here with a couple of friends after work on a Thursday.  It was crowded and loud, but not excessively loud.  Don't expect an intimate date spot.  <br><br>The beer list is small, but good.  I wish the beer list were not so IPA heavy because I don't love those.  But I found beers that I liked, including what I think was called the cruel and glorious (sorry if I have this wrong).  <br><br>Service was okay, but the server was a little confused about the menu. She initially decided that the blackened catfish I ordered came with a side and then decided it did not.  Her confusion probably arose from the fact that the $14 entree is tiny and should come with a side or be sold as an app.  It was not an acceptable portion size for an adult.  It came served on what appeared to be grits that did not taste like anything.  The catfish itself was good, but the seasoning was uneven with parts bland and parts excessively salty.  <br><br>Next time I will probably just drink here and look elsewhere for food.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QxlvkLqU7O6RfnU7E5ZQ4A/348s.jpg", "caption": "Blackened catfish"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TbPh97p3y6l_MLg_m_QMqA/168s.jpg", "caption": "Crispy chicken sandwich"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/X8Om0YRSNKrkXvXA4MBE8g/168s.jpg", "caption": "Burger"}]}}, {"review": {"des": "A friend of us told us about this place and since we were free decided to go. First thing you notice when going in; the brewers, behind the bar, really cool.<br><br>The place is rather small, you will be close to the other people at the place, it's fine, doesn't bother me. We were told the burger was really good so we ordered it. It came really quick (not sure but I guess that was also because we ordered medium rare), it comes with fries (nothing special, just fries), alioli (average) and spicy ketchup (good). The burger itself was really good, it's a quality meat, the raw milk cheddar and the pickled sweet onions work really good together. I didn't order bacon but I think I'd be better with it. <br><br>Regarding the drinks we had beers, \"Shark meets hipster\" and \"Jaguar something\" (not sure); this is a matter of taste so I won't talk too much about the beers, just gonna say I liked the \"jaguar something\" better.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Jdig_wXbmxB1n8r9IxHQ2g/168s.jpg", "caption": "Really cool"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_ocxrcmGXOoyV_FzH5yMLw/168s.jpg", "caption": "The burger"}]}}, {"review": {"des": "Been to DryHop twice. First time with my son, second time with all four family members. Great beer! Three of us are beer snobs. :) Really good food. Between the two visits we had hamburgers, pulled pork, and trout. All very very good. Servers are friendly. Nice atmosphere. Happy to find a microbrewery we can get into without waiting too long.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/f0vgjukZGvsRTPK--y8ECg/348s.jpg", "caption": "Take home a crowler!"}]}}, {"review": {"des": "Really a hidden gem! Had a few of my fav draft beer here. Mr Banana Grabber and Simcoersion are perfect beer in my opinion. Super hazy look, very hoppy with great malt flavor. Love this place!", "pics": null}}, {"review": {"des": "Our first impression walking in was a foul smell that stuck around through almost the entirety of our time inside. This was never explained to us. We ordered the flights and I enjoyed 2 our of the 6 (the dark lager and the double ipa). I ordered the chicken sandwich and upgraded my fries to poutine. The fries themselves were thin and lacked flavor but the poutine toppings really salvaged the dish and made it quite enjoyable. I actually really enjoyed the chicken sandwich though, so that was a positive. I also tried a little of the skillet cookie, which was fine; probably something you can make yourself though, nothing special. Our waitress was nice and very helpful though.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IIev_bQ5R7cK6q9M1PG3gw/348s.jpg", "caption": "Beer flight"}]}}, {"review": {"des": "Great beer and service! Needed a place to charge my phone and the staff was super accommodating to find me a spot near a plug! Try the chicken sandwich, it's delicious!", "pics": null}}, {"review": {"des": "My wife and I brought our dog and sat on the patio last Saturday. The waitress and servers were very accommodating with the dog. We sampled four different beers and they were all excellent. I had the vegetable Ruben that was very yummy. I had a side of mac & cheese that was incredible and I Cannot wait to go back for the mac & cheese. I heard the cheeseburgers there are fantastic and I'll have that next. I can't wait to get back. If you're in the neighborhood check this place out", "pics": null}}, {"review": {"des": "I came here for dinner at about 7. The wait was about 20 min, and they do that nice thing where they send you a text when your table is ready. <br><br>Their beer was very good, but there wasn't much of a selection if you don't like IPAs. But the list changes often, so I guess I'll have to go back again and hope there is more variety next time.<br><br>We got the skillet cornbread, which was really good, and the burgers. which were pretty great. We didn't have any room left for dessert, so we'll have to try that next time. Service was very prompt and friendly. Overall a great experience and I'll definitely be back.", "pics": null}}, {"review": {"des": "Went here for their Monday special which includes a burger, fries, a beer, and a shot of bourbon all for just $15! The burger and fries were very good! And I'm usually not a beer person but they had a great selection of IPAs. We sat outside on the nice day while the inside part of the restaurant had all its doors open towards the outside. This gave it a great atmosphere of an outdoor restaurant inside. The service was great. Will definitely be back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AyA5hbc8mkIA7Y2gYNRLPQ/348s.jpg", "caption": "Burger and fries"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FElbJeMUlVZzpcl7tH-JAQ/168s.jpg", "caption": "Bourbon and beer!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hBgGIQbtgr6dA49nq_trVw/168s.jpg", "caption": "Outdoor seating"}]}}, {"review": {"des": "Great food best burgers around. Best draw back is that it is EXtremely loud and you can barely have a conversation. They should do something on ceiling etc to muffle the Thunder. It really is a big distraction. <br>See (hear) for yourself.", "pics": null}}, {"review": {"des": "I really enjoyed this place went to dryhop brewers after being at the laugh factory for a comedy show and wanted to have some good drinks. The bartender related Aylesbury Duck was a local vodka dryhop brewers had exclusively I've never heard of this this vodka it was so smooth and delicious that I had to google it to find out more about it and pick some up from binny's. I had Aylesbury Duck vodka in a Bloody Mary and it was perfect! I also had a craft draft beer called tropicana and that was really good if you love fruity beers with pineapple, mango & passion fruit! I will be back for the food since it was a little late for me to eat. The kitchen was open until midnight for those that eat late.", "pics": null}}, {"review": {"des": "Great place for a brew and a burger. Place was busy when we got there but we were seated immediately at a high top, which suited both me and my nephew fine. Ordered the Angry Samoan - a stout beer and it was outstanding. Kaitlyn was our server and she was right on timing wise and with checking in. <br><br>Burger was cooked perfectly and accompanied the beer quite well. This was the first stop on a trip that took us to a few brew pubs - the beer here was the best of any we had. I'd like to go into more detail, but the bottom line is that this place rocks!", "pics": null}}, {"review": {"des": "Just moved to Chicago and this is my first restaurant visit during \"patio season.\" Today was such a beautiful day so my roommate and I decided to sit outside and enjoy the sunshine and bustling Broadway. The staff was very friendly and was very knowledgeable about the menu items. They make their beers in-house; I had the \"Mr. Banana Grabber,\" which is a Hefeweizen, and it was so refreshing and tasty. I also had the Charcuterie & Cheese Board, which lets you choose from three out of six different cheeses and meats (the prosciutto and goat cheese were great!).", "pics": null}}, {"review": {"des": "One of the best burgers in lakeview without a doubt. Get it medium or medium well for good taste and fries are awesome as well. My celebration bar, and sometimes I come back with people or on my own.<br><br>My go-to Beer here is shark meets hipster, which is an incredible wheat IPA. Would for sure go back, one of my favorite neighborhood breweries.", "pics": null}}, {"review": {"des": "When you walk in to DryHop you may feel like you are at one of wicker parks ultra hip scenester placed but you'd be wrong. The staff is very friendly and helpful. No one has a holier than though attitude and the service is faster than you might expect from one of Chicago's cooler micro breweries. <br>The beer is craft. They do a great job. The rotations are good and it's fun to just start out with a flight of all they currently have on tap. <br>The food will also keep you coming back for more. The portions are friendly to your pant size so you can try several appetizers before digging in to something heartier. <br>I do wish they would offer a bigger menu but I really can't complain about a place with great food and beer that you can take a 32 oz can of beer home from.", "pics": null}}, {"review": {"des": "DryHop is a great spot if you wanna grab dinner out with friends during the week! It's a little smaller of a space so there are wait times for weekend nights or brunch.<br><br>I always get the burger because it is so good! Definitely one of the better burgers in the Lakeview East neighborhood. The fries that come with the burger are also perfect. If you have some room saved for dessert, order the Skillet Cookie with Bourbon Vanilla Ice Cream. It comes out warm with the ice cream slowly melting over it.<br><br>DryHop has a nice drink selection with beers being the highlight of the drink menu. The cocktails are really tasty too if you're not that into beer.<br><br>I just the vibe at DryHop, especially on a cold night. It's just so warm and cozy there. Definitely give it a try if you're in the area!", "pics": null}}, {"review": {"des": "Me and my husband were regulars at DryHops, we live just around the corner from there. Its always lively and we love the interesting rotating menu of craft beers. 1 day we had a server who seemed less than happy to serve us as soon as we mentioned we only wanted 1 beer each and no food. We shrugged this off as a one-time occurrence.<br>The next time we visit, the lady at the door asks unsmilingly if we want food too, or just drinks- I say, just drinks. She points us in the direction of the bar & says we can seat ourselves anywhere at the bar - this is fine with us, except the bar is packed.<br>I go back to her and tell her the bar is full, can we have a table please? (They had vacant tables).<br>She replies curtly, \"No, sorry, the tables are actually reserved for customers who are getting food too, and the dinner crowd will start soon.\" She then turned her attention to someone else.<br><br>We have been here plenty of times before for just drinks and we were never denied a table. What beer place reserves tables for 'dinner crowd' anyway?? We felt pretty insulted & sadly we will not be going back to DryHops.", "pics": null}}, {"review": {"des": "I made a return visit to this East Lakeview brewpub for the first time since 2013.  Busy at 1:00 on a Tuesday afternoon, surely a good sign. Not much has changed, though of course there has been an almost complete turnover in the drafts list.  I went with a six-item sampler, $15:<br><br>- Applebite.  A saison and apple cider blend, in collaboration with Empirical Brewing and the Eris Brewing and Cider Co.   7% ABV, 15 IBU.  Slightly hazy gold, light head.  Yeasty nose.  Saison dominates the taste; a bit of apple in the finish.<br><br>- Hazy IPA.  (Where did this unclarified IPA style suddenly come from?  It looks like hazy IPAs are destined to succeed sour beers as the craft beer fad of the year.) 6.4%, 35 IBU.  Very cloudy straw color, light head going to halo.  Hop-forward taste (seems far higher than the stated 35 IBU); Amarillo, Simcoe, Citra, and Mosaic hops, with something salty, and a hint of stone fruit (apricot?)  <br><br>- Hazy Shade of Hipster New England Wheat IPA.  6.5%, 50 IBU.  Cloudy dark gold, light head.  Great aroma hop nose.  Hop-forward taste (Citra and Galaxy), maybe overbalanced to bitterness.   Woody \"pencil shaving\" note, and a tart touch of unripe peach.  The menu copy claims a passion fruit note, which eluded me.<br><br>- Fantastic Damage American IPA.  6.4%, 50 IBU.  Clear brass, light head fading to halo.  Piney hop nose (Cascade and Centennial).  Taste is piney citrus, against a bread malt, some bitterness in the finish.  Hint of cantaloupe.<br><br>- Ursus Mapletimus.  A collaboration with Lincoln Park Zoo for polar bear and climate change awareness.  8%, 10 IBU.  Slightly cloudy bronze, light head.  Nose dominated by maple, from natural maple syrup.  Taste is sweet malt, smokiness, maple, a hint of (nonexistent) bacon.  Very tasty--though white ale seems an odd base for this!<br><br>- Rocket to Russia Russian Imperial Stout with Coffee.  A collaboration with Piece.   10%, 50 IBU.  Near-opaque dark brown with red highlights.  Halo head.  Mild chocolate and malt nose.  Deep, dark, complex taste:  roast malt, dark chocolate, piloncillo sugar, cafe au lait.  Little sour note at the finish.", "pics": null}}, {"review": {"des": "One of few Lakeview East spots that meets or exceeds expectations. Great service and  great food. Hamburger awesome, French fries awesome, craft beer really good. Thanks for making Lakeview East tolerable from a good standpoint", "pics": null}}, {"review": {"des": "THE BURGER, THE BUTTERMILK FRIED CHICKEN SANDWICH and THE BEER!! DryHop Brewers is making amazing food and brewing awesome beer!! This burger made the list for the top 16 burgers in all of Chicago from THRILLIST! Perfect patty to bun ratio. The fried chicken sandwich rivals the burger. Had the Shark Meets Hipster on draft and it was one of the best beers I have ever had! Get here now and get some! Subscribe to my You Tube channel here: <a href=\"/redir?url=http%3A%2F%2Fyoutube.com%2Fc%2FABikerDude&s=d849c07b3fa9c77321c2df68ae238c992307b644d20a4b06ad60c8afc6c924b8\" target=\"_blank\" rel=\"nofollow\">youtube.com/c/ABikerDude</a> Dryhop Brewers", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/exs1sJXywsCzNyk5b7zq7g/348s.jpg", "caption": "COOL CREW!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9fMSs9spjB1KhhcRCDyOig/168s.jpg", "caption": "Insane!"}]}}, {"review": {"des": "Very solid brewpub.  Great lineup of well-executed beers, tanks behind the bar is a great touch, and the music is at a suitable volume for conversation.  This place doesn't take itself too seriously, which is a huge plus for a craft beer place.", "pics": null}}, {"review": {"des": "DryHop is super fun. It's definitely a gem of Lakeview East. Fun for dinner or fun for just grabbing a drink. I wish I remembered which beer I ordered. It was a little citrus-y and I enjoyed it.<br><br>The salad I ordered was really good! I ordered the field greens and really enjoyed it. Why did I order a salad with a beer? I don't know. Should I have ordered something else off the menu? Yes. Will I be back to try more items off the menu? Of course!<br><br>No meal is complete without dessert. The cookie skillet that we ordered totally hit the spot. The bourbon ice cream paired unbelievably well with the chocolate cookie. OMG. This is a must-try.<br><br>The atmosphere is cool. I went at night and the restaurant was really dark. Lots of seating, but the tables do fill up! Even on a week night. I got the vibes that this place is probably better for smaller groups. When I say smaller groups, I mean six people or less.", "pics": null}}, {"review": {"des": "Perfect place for brunch - try the biscuits and gravy! Customer service is always great and we usually don't have to wait too long for a table.", "pics": null}}, {"review": {"des": "I love coming here! It's a very fun atmosphere. The stir fry for dinner is sooo good!! It's healthy and delicious. They have a ton of beers and usually a couple ciders. The beers are amazing!! They also have great burgers. And the cheese plate was amazing!", "pics": null}}, {"review": {"des": "Lovely interior and ambience, delicious and fairly priced beer that they have brewed themselves and a solid menu. <br><br>The burger is one of the better ones I've had in the city - I recommend it! Service is quick. Nice young professional vibe.", "pics": null}}, {"review": {"des": "Service was a little slow at times (we had to ask for my second glass of wine after about 15 minutes of not receiving it) but I'm really here just to tell you that THE CARBONARA IS INCREDIBLE. <br><br>As a brewery, I was expecting the food to be good, but not stellar. Typically I don't find myself thinking about a dish weeks after I ate it, but the Carbonara is one of those dishes that I seriously can't stop thinking about. Maybe I just haven't really had a whole lot of carbonara to measure it against, but I was seriously blown away by it! If you like pasta even a little bit, TRY THIS.", "pics": null}}, {"review": {"des": "Visited this place for brunch on a short Chi town trip with some friends and was pretty pleasantly surprised. For a Saturday, I was thrilled that we were seated immediately. <br><br>I'm not a fan of hoppy beers, but my buddy and I opted for the flights. Considering the name, I found most of the beers to be quite good. My friend was not so forgiving.<br><br>The food was tasty, but not quite tasty or unique enough to deserve a perfect score.<br><br>Food: 4/5 (Good, but not great)<br>Service: 5/5 (No complaints, friendly staff)<br>Price: 4/5 (Not cheap, but you're not overpaying)<br>Atmosphere: 5/5 (Cool place, especially the garage door style doors on a nice day)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8s4yBt6FE87-TEzUA08RrQ/348s.jpg", "caption": "The chilequiles were ok, but you could tell this isn't a Mexican place"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UdWxK3297HuJA-xVAdwZog/168s.jpg", "caption": "Hank's Plate - Potatoes were not as good as I thought, sausage gravy was great"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yW62YrDwcZ0nZqWP786T_A/168s.jpg", "caption": "If you're not a hops fan be sure to check the IBUs!"}]}}, {"review": {"des": "Great place on Broadway if you are in the Lakeview area.  I have been here twice since I moved to the nigehborhood and both times the food/service was great.  It can get a little busy on the weekends, so there might be a wait.  They seem to make smaller batches of beers, so they always have something new, but nothing I tried was bad.  As far as food goes, the pretzel was a great appatizer and the burger is surprisingly good (I am not usually a burger ordering guy).  I look forward to coming back to try more beer.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mj5HqOgYB6v1XgFsBomZ7Q/348s.jpg", "caption": "Soft pretzel"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gxbs8iyXAiiEqjKMKgTGzg/168s.jpg", "caption": "Burger w/side salad"}]}}, {"review": {"des": "DryHop is the place for craft beer and awesome snacks! The atmosphere is casual, which makes it a great place to try some of their signature beer- which is all brewed in-house. Most of the options tend to be a little on the hoppy side- but if you're not a fan of the hops, you can grab a STELLAR smoked old fashioned. <br><br>I highly recommend their fish tacos, and fried chicken sandwich. Both have unique tastes that make them interesting, and they combine perfectly with a cold drink.", "pics": null}}, {"review": {"des": "First came here in 2016 as we are part of a brewery in Texas. We talked to the bar staff for a long time and they were so kind and attentive and we remembered it as an awesome brewery. Went back this weekend and that whole vibe has changed. The guys behind the bar are kinda beer snobs and aren't interested in you and when we went to take a coaster we were told \"only two\" and my husband was like do you think I was going to pocket your entire stash? No. So we said don't worry about it and walked out. So much has changed since we first went.", "pics": null}}, {"review": {"des": "DryHop has excellent and unique beers, I love ordering a flight from here. As a huge craft beer fan, I appreciate that this place brews some creative  beers. I've honestly tasted beers here that were unlike any I've had anywhere else. For example, there was a pad thai beer I tried here a while back. They also have excellent classic IPA tastes as well. In terms of the food, this place has hands-down the best Mac and cheese I've ever eaten in my life. The cheese sauce is so creamy and the cracked egg on top is delicious. The location itself is nicely decorated and the patio is cute. I highly recommend checking this place out, especially in the warmer months when the windows are open!", "pics": null}}, {"review": {"des": "I was walking one area where I always find good food and passed this place again. I assumed that it was only beer. There was a menu on the wall with food. Well it was worth investigation. They do make their own beer and several varieties. I wish my doctor would let me try it as it looked pretty good. I sat and looked at the menu. It was not just bar food. There were some interesting things there. They had poutine ( not Canadian but an American version) that was not bad. I had the fried chicken breast sandwich and it was really good. I wish that I had room to eat a couple more things as the menu looked inviting in several directions. The service was Chicago style which it turns out means friendly, efficient and generous.", "pics": null}}, {"review": {"des": "Delicious! Got the burger with bacon and egg and fries and it was fantastic. The service was fast, our waitress was nice, and it was just an overall great experience. If you do get the burger BRING A BIB!", "pics": null}}, {"review": {"des": "The beer? Amazing. The food? Amazing. Our service? AMAZING. Ruby was our server in the middle of the Pride parade when it was utter chaos and she was cool-headed, professional, and super knowledgeable. Definitely a spot to come back to.", "pics": null}}, {"review": {"des": "Amazing Monday night special which includes their burger, a beer and a shot of whiskey. Burger is great and perfectly cooked, the cheese seals the deal. You can choose any of their house drafts which this time around were mostly IPAs.<br><br>You can't make a reservation so just go in and put your name on the list. They always say something outrageous in case it does take that long but the longest I've waited was 10 min when they said 30 min. No TVs at this place which makes it a decent date spot depending on the other person.", "pics": null}}, {"review": {"des": "Average brewery in Lake View just south of Belmont.  Decor was very nice and I liked the outdoor seating.  Service was good as well.  However, the beers were just average.  The best was the Mexican style brew.  I found the IPAs and APAs to lack bite and flavor.  Strength level was between 6% and 7%.", "pics": null}}, {"review": {"des": "Great burgers and beer! It's a good place for a date or to just grab a drink!", "pics": null}}, {"review": {"des": "Delicious food, great beer, nice environment. I would definitely come again. <br><br>I ordered the vegetable Reuben which was hearty, delicious and very colorful. I appreciate when restaurants don't skimp out on the veg options. The side salad also was beautiful. <br><br>My friend ordered The Burger (+ egg), which he said was phenomenal, and my other friends ordered the breakfast sandwich was great. They wished the side of potatoes came with some sort of side sauce (but in retrospect probably should have asked for Frank's). <br><br>Beers were delicious and summery. I absolutely love grapefruit beers and the Sharkler met my expectations. Our table also ordered the King Ghidorah, Sister Carolina and Weiss Wedding, all of which were great. The Weiss Wedding was really nice (especially the banana undertones). <br><br>I would definitely come again! Maybe if there was another veg sandwich that would be great!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AStZwingBg8_lt0eIpBVew/168s.jpg", "caption": "Vegetable Reuben with side salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3qgHo-Clv_I2aG-LhE4SHg/168s.jpg", "caption": "Breakfast sandwich (bacon on side)"}]}}, {"review": {"des": "I recognize that I am probably going to be saying something a bit controversial here: but I think Dryhop is a bit overrated. I've been here twice, and I haven't had anything memorable in terms of beer....maybe I just came during off times, but nothing stood out to me, and that was trying two different flights. <br><br>Food: I've tried the tacos...eh. Nothing special; I couldn't even tell you what I had on it. It was just meh, and very small tacos. The buttermilk fried chicken sandwich was a different story! VERY yummy! Super-tender chicken, very flavorful...the pimento cheese was a perfect touch, too! All in all, just a good, quality sandwich. <br><br>This place is perpetually crowded too, and fairly small, so if you're going for a date night or to have a lot of conversation, expect quite a bit of background noise while you eat! <br><br>Cute place, and great chicken sandwich, but not my cup of tea on the beer-front.", "pics": null}}, {"review": {"des": "Stopped by with some friends late Sunday night since they were the only place serving food. FYI..they are open til 2am on Sunday. I ordered the Buttermilk fried chicken sandwich which comes with two chicken breasts topped with white cheddar pimento cheese, sweet pickles and slaw. I upgraded ($2) to the poutine - frites with chopped Applewood smoked bacon, aged cheddar, scallions, and sausage gravy. <br><br>The chicken sandwich was fantastic! I especially enjoyed the sweet pickles and slaw. I would definitely order this sandwich again. Equally tasty was the poutine!! The fries were topped with just enough cheese and gravy - not too dry, and not drenched. Service was friendly and fast.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/c7aM-uaTa_02iyG53yzpuQ/348s.jpg", "caption": "Buttermilk fried chicken sandwich and poutine"}]}}, {"review": {"des": "Ate here with some friends for dinner on a Wednesday evening. Initially, the wait time was supposed to be a 30 minute wait for our party of 6. That unfortunately ended up being a 60 minute wait, but I will say the wait was worth it. Intelligentsia is just down the street so we killed an hour there and got coffee while we waited. <br><br>Waitstaff was super cool. Actually, this whole place is super cool. Really trendy vibe from the chalkboard walls to the house brewed beers to the modern twist on bar food and the dishes they serve it on. I ordered the veggie reuben and omg it was great! Red cabbage and mushrooms instead of the typical corned beef and sad looking kraut. I would definitely eat this again! The fries here are really thin and crispy and served with a lemon pepper mayo and a spicy ketchup/bbq type thing; both were really good!<br><br>Half the reason my friends wanted to eat here was for the beer. I can say that didn't disappoint either. I got the Shark Meets Hipster. Really nice light beer, super fruity, reminded me a lot of Wailua Wheat from Kona Brewing! <br><br>Overall, dinner was good. Good, friendly service. Portions were a little small, but the prices reflected that and were well within reason. If you plan on drinking more than 1 or 2 drinks, I could see it adding up pretty quickly. Still, if you're going to eat here you should try at least one beer! They also offer flights and you can take their beers to go in either cans or growlers. From what I remember the growlers were actually a pretty decent price.<br><br>The free wifi here was also a nice added bonus!<br><br>With all the other trendy restaurants in the area, I'm not sure when I'll be back to this one any time soon, but it was definitely some place worth trying!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DYeVQvg5ygBM9aEjPwkX6Q/348s.jpg", "caption": "Veggie Reuben"}]}}, {"review": {"des": "First time to Chicago, this place made me download yelp so i could write this. Absolutely impeccable. im a server from Delaware and my boyfriend is a brewer. We like to nitpick every place we enter because we're in the business. Service was hands down the best i've ever had (maybe even better than mine). Our server Venus was incredible she knew exactly what we needed when we needed it. Hats off to her thank you again! We had the charcuterie and frites and i had the chicken and rice soup of the day.. amazing. Just amazing. We tried every single beer on the menu, everything was absolutely spot on. i will be dreaming about that stout for a very long time. Thank you guys again for the most beautiful experience.. we will be back. And if any yelpers are reading this.. you could have been halfway there by now.", "pics": null}}, {"review": {"des": "Good food! Quick, attentive and speedy service. Great beer! Fuck yeah! I will be coming back for sure.", "pics": null}}, {"review": {"des": "I've been here twice. Once for dinner, and once to just grab some beers to go.<br><br>The food is awesome. I had the pork chops, and it was one of the best meals I've ever had in Chicago. Also tried the beer sampler, and every beer I tried was great.<br><br>The carryout beer option is also really nice. You can get 32oz cans or 64oz growlers. I've only done the cans, but they fill them up directly from the tap, and the beer is super fresh when you want it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PFkgIo0VDLfBhwA9wASg4Q/348s.jpg", "caption": "Mussels! The sauce is so good!"}]}}, {"review": {"des": "Great beer, great burger. Tilapia Tacos were also good, really hot tough. Will definitely come back!", "pics": null}}, {"review": {"des": "My brother and I love whiskey, and when he was in town and we were in the area, I thought we'd go for a nice drink.  They are one of the few bars that stocks Blanton's and I always keep mental notes of what places do.<br><br>For a Tuesday night after 10pm, it was busy, and this is where the review goes sour.  Service was SLOW.  One waitress for the entire bar is not okay for any establishment.  It took about 20+ minutes for us to get frites from ordering.<br><br>Not a good experience for just two whiskeys and an order of french fries.", "pics": null}}, {"review": {"des": "We ate here last night. It was an unexpected treat! There was a little wait (15 minutes-at 9:45pm) but there was space at the bar to sit and have a drink. Beers were delicious and my margarita was tasty too! The staff-from seating host to bartenders to server, couldn't have been nicer. I split a burger with my daughter-would have gotten a whole one, but it was late. The burger was delicious, fries were too. I would go here again in a hearbeat! (Prices very reasonable)", "pics": null}}, {"review": {"des": "Came here on the recommendation of the bartender at Beermiscious (great place I highly recommend) and it did not disappoint. <br><br>We were greeted warmly and welcome to put out seat (it was 4ish) so we got a great window spot. Our server was super nice and let us go at our own pace. We planned to only have a beer or two but their menu looked too good. <br><br>Beer: They offer a six beer flight of their house beers in 5 oz samples. Perfect to try a variety and learn what you like. They also offer samples if you want to try before committing to a full beer. Also, they have a few guest beers so ask about those. <br><br>Food: Green curry mussels! Delicious! Actually wished the bread wasn't buttered so there was no competition with the broth! That's good broth!<br><br>The space is awesome and jade a great vibe. Perfect for a date night or outing with friends!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/M8Z4FyLvcomgBjKv2kZ6FA/168s.jpg", "caption": "Always love places that offer flights! This was the six house beers sans the seasonal special which isn't included."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HTvaPIrW5Mnl-ZAMgPrbZQ/168s.jpg", "caption": "Green curry mussels! Delicious! Actually wished the bread wasn't buttered so there was no competition with the broth! So good!"}]}}, {"review": {"des": "This microbrewery/restaurant is simply amazing. They have a very fun and welcoming atmosphere and it's a great place to go for a drink, be on a date, or just hang with friends. Their beer selection is great and they brew their own beers! I had their IPA called Citransfixion and stuck with that all night. It had the right amount of hop and citrus to balance out the taste. As for food, I just had their burger and it was solid. Their fries are awesome too especially the garlic aioli sauce that came with it. I would say this place has one of the best burger and beer combination in the city!", "pics": null}}]}