{"name": "duck-duck-goat-chicago", "reviews": [{"review": {"des": "Duck Duck Goat is one of my favorite meals in Chicago. The food was incredible, the service is excellent, and the atmosphere is really fun.  I brought my parents here, and despite the fact they are not adventurous eaters, they tried and loved everything we ordered. I have not one single negative thing to say about my experience, and it pains me that there are negative reviews here that focus on how it's hard to get in here. It's busy because it's amazing!! Definitely make reservations well in advance of when you'd like to go. <br>__<br><br>Here's what I ordered: <br><br>1 - The Fox & The Goat Pale Ale <br>I do not normally make comments about drinks, but this beer is seriously great. It's their house beer, and it's a very flavorful pale ale... not one of those that has a generic hop zing and nothing else. I really wish I could pick this up at the liquor store. <br><br>2 - CHAR SIU BAO (Steamed barbecue pork buns)<br>These buns were perfect. Pillowy outside, super tender and flavorful pork inside. The meat to bun ratio was good, the bun was not too thick. We had a party of 4, and got one order of these which comes with 2. They were big enough that even half of one is 3 or 4 bites.<br><br>3 - JIAOZI (Beef short rib and bone marrow potstickers)<br>Again, perfect. I don't need to be verbose on these. Just imagine the potential of short rib and bone marrow potstickers, and that is what you will get when you order these. They have an excellent sear on one side to make the texture great as well.<br><br>4 - XIAO LONG BAO (Shrimp and goat soup dumplings)<br>These were really good soup dumplings, but if you are only getting one order of dumplings I would go for the Jiaozi. My ULTIMATE recommendation though would be to order both. You can never have too many dumplings...<br><br>5 - GOAT AND DUCK SPRINGROLL<br>These were very basic, but tasty. They are skinny roles, fried, with two dipping sauces. There's probably not much inside the rolls besides the goat and duck. <br><br>6 - XI'AN GOAT SLAP NOODLES<br>This was the showstopper, the dish I have dreamed about since my visit. My wife and I were practically stabbing each other with our chopsticks over the second helping of this dish. If you like sichuan flavors you MUST order this. It's not super numbing, but it is spicy. The meat was tender and perfect, and the cumin spice + sichuan peppercorn was heavenly. The noodles were slathered in all of that flavor and were cooked perfectly.<br><br>7 - TWICE COOKED PORK<br>I enjoyed eating this, but it won't be at the top of my list to reorder. The pork is very delicious... fatty with a nice char... but the portion wasn't huge. It was mostly a pile of veggies on top of a couple small pork pieces. It all worked really well together, there were just other things I would repeat over this. <br><br>8 - GREEN BEANS IN BLACK BEAN SAUCE<br>The waiter recommended we get these to supplement all of our meat dishes. Vegetables... what a radical idea. If you don't generally like green beans don't let that prevent you from getting these. They are fried up with some crispy shallots and nuts, and are thoroughly delicious. <br><br>9 - PEKAN CHICKEN<br>The portion on this guy was huge. It was a platter full of crispy chicken, just topped with a few green onions and peppers. A lot of times sweet and sour sauce can be too sweet for me, but this one walked the line well. This is a great dish to order if you're sharing, because everyone will like it regardless of how picky they are, and again you get a lot of chicken.<br><br>10 - DUCK FRIED RICE<br>Before you start judging the amount of food we got, we didn't technically order this. We kept it in the single digits people!! The kitchen made an extra by accident, and we ended up with this as a little bonus. I'm not mad about it. I finished it off even though we had PLENTY of food between the four of us between the first 9 things we ordered. I may have rolled out of there but I regret nothing.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/d805wM5C_W2YUsnC82fJ3g/348s.jpg", "caption": "Green Beans in black bean sauce"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/X0sbipKURf3NCupAjrmhRA/168s.jpg", "caption": "Duck fried rice"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tzORE8-URJjF9XxLYJFkGA/168s.jpg", "caption": "Twice cooked pork. Not a ton of pork, but delicious"}]}}, {"review": {"des": "I highly recommend making a dinner reservation the day before you come in, otherwise expect a long wait. A long wait that is worth the wait. And mind you that is w/ the crazy amount of seating they have. This place is decorated in a variety of ways, all of which reminded of being back in Asia all over again. When you step into this establishment if you're not in awe of it, check your pulse. <br><br>If you check out the menu online, it doesn't seem to reflect everything that they have in house. I say this as we ordered the duck hearts that were prepared perfectly. Hearts are like octopus, they can be messed up to be too chewy like rubber or the complete opposite. It's finding the happy place and boy did they find it. SO GOOD!<br><br>For our entrees, which mind you everything here is designed to be shared, we selected CHONGQING CHICKEN( Sichuan-style chicken with chilis) & XI'AN GOAT SLAP NOODLES (Cumin, sichuan peppercorn, finger hot chili, goat shoulder). <br><br>The chicken was like fried chicken, double fried, smothered in chilis. It was too crunchy for us. Although it was smothered in peppers they weren't too hot. Now the noodles and goat shoulder, OMG, flavor town as Guy would say. <br><br>Do yourself a favor and make a reservation here to give your tastebuds a pampering of flavors. I give this place a 4.5!", "pics": null}}, {"review": {"des": "I had been here once prior where we were seated in a quaint lounge area in the back but that was prior to my active Yelping life:) so while this review is about my recent dinning Experience in the main restaurant I will start off by saying I noticed off the bat a few things had changed. For one, they did away with the cute lounge. The waitress said it was to make more table space since they had become so popular and reduce wait times. Second, the DimSum menu was like half as many items and was told it's because they decided to revamp the entire menu a few months ago to only their top best selling dishes and added in some new things for guests to try. Our waitress has been there a while so she obviously knew the scoop, and she was excellent with prompt service and suggesting some items to try. It was evident she enjoyed her job and was passionate about the menu. You go girl!<br><br>The ambiance is fantastic and each adjoining room of the restaurant revealed a well thought out eclectic interior style. We were seated in the back right by the Kitchen window so it was cool watching everything pass by but if I had to pick, the red front room with the umbrella shades is everything and more! Seems Asia-Meets-French Bisto inspired. <br><br>The one thing I major disliked is how cramped the tables are to each other!! Getting in or out of a wall bench was a delicate act of not getting your rump in the next tables face and not causing a table to wobble. Most guests are adults so a few more inches would feel more practical - please and thank you.<br><br>Everything is intended for \"Family Style\" dinning which means you order several dishes and share them across the table. That works but know that it may take a number of orders (or double up) because I didn't feel the portions were all that generous - all very tasty and fresh but not enough to share with more than one or two others IMO.<br><br>Duck Duck Goat (DDG) lives in the rising upbeat Fulton Market neighborhood and is best known for their Beef Slap Noodles ($17) so regardless of what else you decide upon, definitely do order those up!! More on the savory side but the shishito garnish gives it a kick! <br><br>Tried the Xiao Long Bao soup dumplings ($12) which come in a DimSum steam basket 5 to an order but they were only meh honestly. They were cold and stuck to the bottom of the basket so a light tug and all the warm soupey goodness drained out of the won ton before I could get it to my mouth... sad face, they were really tasty though. <br><br>The pork buns ($12) came 2 to an order and were gigantic but they had far too much dough for my liking and not much meat inside. Also I had asked the food runner dude (our waitress was taking another table's order) for some hot mustard but he said they didn't have any which I thought was wierd because the adjacent table had some. Thankfully our waitress came by to refill water glasses and see if we neeeded anything else and promptly brought the hot mustard. <br><br>We ordered the Pork Fried Rice ($15) but I totally failed to take a picture. I thought it was a tad too salty for my enjoyment so I didn't have much of it. <br><br>Otherwise, to me the little things like cute little bowls for sauces, ECO-conscious wooden mini-spoons, the cute DDG cartoon on the To-Go boxes made for a unique experience... and a sweet end to it all was having the almond cookies (sans the fortune) instead of a typical fortune cookie. I'd say the pricing was in line with most other Asian places in the area but I'd say less authentic, more trendy but still worth a Foodies try! <br><br>Oh and don't worry if you happen to over-order because leftovers will make you happy you did!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9oaLzqPCWrdbozeZL8TwHg/348s.jpg", "caption": "Asian art adorned these walls..."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MewM78qA2z6xbH45gipbrg/168s.jpg", "caption": "Festive bar!!"}]}}, {"review": {"des": "So this amazing and famous chef creates her magic again with Asian mostly Chinese cuisine this time. Most things are great, some are regular and feel a little overpriced like the scallion pancakes. No complaints but no wow factor. Also tried the cocoquito chicken.. yum yum with that great kick of heat.", "pics": null}}, {"review": {"des": "Had a wonderful dinner for my husbands birthday here! Definitely make a reservation before going to be safe cause it's pretty popular. We preferred the appetizers over our shared entree, and I wasn't a huge fan of the dessert (my hubby was though and it was his day). The appetizers were so yummy though, I really wouldn't mind just having appetizers here every freaking day. Shrimp Toast, Jiaozi, and spring rolls? Let me at em. I do wish that we had tried the Peking duck, but just for the two of us when we were going to be walking around afterward, just didn't make sense. The waiter was very attentive, which helped make my husbands birthday extra special. Can't wait to try more from here!!", "pics": null}}, {"review": {"des": "My experience at Duck Duck Goat can be described in one word- SALTY! And not in the well seasoned kind of salty. More of the so much salt it rubs your tongue raw and pinches your lips.  <br><br>My husband and I decided to come here for dinner on a chilly but beautiful Wednesday around 6:30 without a reservation. The inside was packed but they had one of those heat lamps so naturally we opted to sit on their cute little sidewalk patio.  <br><br>To start we both agreed to the beef wonton soup,  it came in a large thick shareable pot.  The soup was much heavier than your traditional wonton broth, it was dense and well seasoned.  It reminded me more of a ramen broth.  Although the wontons were a bit sparse, they were beautifully made with the most tender filling.  Same for the gyoza!<br><br>We then decided to split the green beans, chicken fried rice, and chicken.  Although the fried rice had cherry tomatoes it in, it was over salted and even the acidity of the tomatoes wasn't enough to brighten it.  I did enjoy the texture though, some well cooked rice and some crunchy.  <br><br>We hoped that the green beans would add some freshness to our meal, but they were heavily seasoned and all we could taste was salt.  <br><br>The chongquing chicken was different from what we expected.  We thought it would be coated in a sauce but instead it was dusted with seasoning.  The sauces that came on the side were rather bland.<br><br>Over all, I thought the meal as a whole was one note and missing acidity and freshness.  It was plenty of food that we ended up boxing up.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RYuA3nWlZqfKyO3OtM2BRA/348s.jpg", "caption": "Beef Wonton"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BatpGEiz8hiTustxN41cjg/168s.jpg", "caption": "Potstickers beef"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9pNmn-Zfapg0dIumVhlZDQ/168s.jpg", "caption": "Chongqing Chicken"}]}}, {"review": {"des": "Went on a Wednesday night and it was a long wait for a table but we were able to snag two seats at the bar right away and just ate there.  The bar tender was nice and offered good suggestions. The tea I had was good. They do whole leaf or flower tea and brew it themselves.  We got the goat and shrimp soup buns which were really good and served at a good temperature so we didn't burn our mouth.  The spicy chicken has great flavor and was crispy on the outside but tender inside.  I felt there should've either been half as many peppers or twice as much chicken as the ratio seemed a little off.  I got about 5 pieces of chicken and ate 4 of each type of pepper and my husband did the same and there still a plate full of peppers.  The shrimp toast was my absolute favorite just so many flavors and great texture, but for those of you who don't like cilantro it does have cilantro.  We also got the green beans which we how I now think all green beans should be cooked. The black bean paste have a nice flavor to it and the cashews and crispy shallots rounded out the flavors and texture.  We tried the pot stickers too which weren't really my thing but bone marrow and short ribs aren't really foods I care for to begin with. My husband thought they were good, not amazing but good. <br>All 5 dishes and 2 drinks were just over $100 and we left completely full.", "pics": null}}, {"review": {"des": "Great place for a casual date night or dinner w friends. Yummy food and drinks. As far as drinks, I had the coconut culture, which had gin, coconut, lime and club soda. Not too sweet at all. I can't do sweet cocktails, they make me sick and I'm just not a fan but this was refreshing and slight sweetness from the coconut. All the food we tried was delicious. Some highlights were the jioazi, beef slap noodles, twice cooked pork and the mango cloud dessert.", "pics": null}}, {"review": {"des": "This place is fantastic. I was on a mission to get the Goat trifecta in one night and I had reservations at the Girl and the Goat and Little Goat, but couldnt get one at DDG. After eating at Little Goat, my cousins and I headed over to DDG jusssttt to see if they had anything and once we told the hostess about our quest, she was on a mission to help us make it happen!<br><br>We stood around a spot at the bar with 2 stools, 4 of us, and ordered shrimp wontons, scallion pancakes, and some other dumpling. It was fantastic. The bar also has hooks for your purse. The ambiance was so cool and the bathrooms were modern and clean. We ate and left quickly, but, I came back later to try their Sunday dim sum by myself, again at the bar, and that too was great.<br><br>I really enjoyed the cold chili noodles on Sunday and found their side take out area too. I obviously came back and you should too!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yK4iInr552DMXVnSga4RSA/348s.jpg", "caption": "Scallion Pancakes"}]}}, {"review": {"des": "Had brunch here during Halloween weekend 2019.<br><br>The good - the food is eclectic and the duck and goat spring rolls deserve particular attention. The beer list is also a lot of fun, with the mango beer being a lot different (and better) than I thought it would be when I ordered it. <br><br>The con - our hostess took about 5 minutes to seat us because she spent her time walking around the front pushing chairs under tables and straightening up even as we were queued at the front station. Our server (Dan) also took about 10 minutes to walk over to our table after we were seated so we spent about 15 minutes after walking in the front door before being able to order anything.<br><br>Horrible? No, I've had longer wait times but we went around 3PM so it wasn't very busy at all. I am big on service and I want as much attention placed on helping me out as went into the theme of this place. <br><br>Hopefully, it goes better next time.", "pics": null}}, {"review": {"des": "We were lucky to be in the right place at the right time and given a table at opening.<br><br>We could barely contain our excitement to dine here, and we were going to make it count as much as we could. There were only three of us, after all. Then the excitement faded.<br><br>We each submitted our dish preferences and voted. The results: Wood-fired Duck Hearts, Goat & Duck Springrolls, Beef Clap Noodles, Jiaozi (beef short rib and bone marrow potstickers), and Peking Duck.<br><br>Only the Wood-fired duck hearts stood out. They were tender and full of bold flavor! The other dishes fell short of expectations, unfortunately, although they all looked amazing. The dishes were mostly one note and lacked the \"pop\" and \"zip\" we expected. <br><br>The Jiaozi should have exploded with flavor, but had an odd pasty texture and were just \"ok.\" No odd textures in the other dishes, just lacking in flavor. <br><br>The Peking Duck requires a special preparation process, which is why I expect it costs $60, but it needed the sauces and garnishes to give it flavor, and they weren't enough to compensate for the plain Mandarin pancakes. <br><br>I had a much better experience during my visit to Girl & the Goat, and our service here was excellent, but I don't plan to return to this member of their restaurant group after this disappointing visit.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3hMEJLMsKmTTuO9TDWCkVg/348s.jpg", "caption": "Peking Duck"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZBRcqT2Q-HMsbwHq0n6Ldg/168s.jpg", "caption": "Beef Clap Noodles"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QqT6ew_t01Nij-fQDq4uLA/168s.jpg", "caption": "Beef & Bone Marrow Potstickers"}]}}, {"review": {"des": "Possibly my favorite Stephanie Izard restaurant! That is saying a lot as all her restaurants are amazing. What I love about Duck Duck Goat is the flavor explosion from her take on dim sum and Chinese. <br><br>I have been here a few times and each time I am not disappointed. I love so many of the dishes here but my favorites are beef slap stick noodles, bone marrow potstickers, the shrimp toast and duck fried rice. I tried the crab rangoons here and they're okay - probably the one thing I don't suggest from the menu. And if you are into boba, make sure you try the boozy boba teas!<br><br>I recommend coming here with a group of peeps as it's shared plates. I think minimum of four people is good.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zQ_Q22hepDnMHu2-7YrkPQ/348s.jpg", "caption": "Duck fried rice! IG: betweencupcakes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Z97zr1jOFXLTS8mDX0Zrbw/168s.jpg", "caption": "Crab rangoons."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SHNCofGwrC3GopKcCOlY1Q/168s.jpg", "caption": "Sesame donuts."}]}}, {"review": {"des": "Great place for a Sunday brunch. Fun kitch interior and solid food. This is more \"real\" Chinese and Han Americanized. Standouts were the noodles with goat and green beans. The soup dumpling was fine but preferred the other dishes. Still wish I were crunching some of the friend garlic...", "pics": null}}, {"review": {"des": "Wow I really thought this place was so good! I know it's not authentic Chinese food, but if you know that going in I think you can really enjoy it. Definitely make a reservation, otherwise you may not be eating here.<br>We tried the shrimp and goat xiao long Bao, the goat slap noodles and the duck fried rice. The XLB were really delicious and with a very unique flavor profile. The dumpling skin seemed much thinner than traditional Chinese restaurants and I was afraid of all the soup spilling out but somehow did manage to stay together. The goat slap noodles were also delicious! I loved the thick hand made noodles topped with generous portions of meat. The duck fried rice comes with a perfectly cooked half boiled egg that you break open and mix with the rice. Definitely a decadent take on fried rice! I loved the wood rated mushrooms in the rice as well. <br>My only complaint would be the service. We actually thought about ordering more food but then ended up not doing so due to not being able to find our waiter. Otherwise, this place is delicious and would definitely recommend it to others!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8mR9PeUtwXbqu9moPKRADw/348s.jpg", "caption": "Goat and shrimp xiao long bao"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9uq4CHs8wM_NBA0MWVBIGw/168s.jpg", "caption": "Goat slap noodles"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dxka9FY_V4hJGOHFzY2Kdw/168s.jpg", "caption": "Duck fried rice"}]}}, {"review": {"des": "I've been to all of the Goat restaurants, and this one might be my favorite. It's a fun, Asian inspired atmosphere. We walked in and sat at the bar within about 30 min of waiting. Among the three of us, we each ordered an appetizer and an entree. For the appetizers, we ordered scallion pancakes, octopus, and the beef short rib potstickers. Everything was mouthwatering and cooked/seasoned perfectly. For our entrees, we ordered the goat slap noodles, the pork fried rice, and the Sichuan style chicken. Everything was so tender and flavorful. My favorite was probably the chicken. It came with a little sauce and was so extremely delicious with a nice kick. I recommend coming with a few people and trying a lot of dishes!", "pics": null}}, {"review": {"des": "Famous chef owned dim-sum.<br><br>Attentive service.<br><br>Fun atmosphere.<br><br>The soup dumplings and crab Rangoon's were my favorite. There are plenty of options to choose from so everyone should be able to find something.<br><br>I do like that they sell sauces too.", "pics": null}}, {"review": {"des": "We were lucky to get a 6pm reservation and were seated right away. We started with 2 cocktails our server suggested the hopscotch and the other drink I can't remember the name but had gin and coconut. The hopscotch was our favorite!<br>For starters we ordered crab Rangoon, Spring rolls and jiazo. All were delicious but the Jiazo was our favorite!<br>For dinner we shared beef slap noodles and the seafood fried rice which were both delicious. Perfect amount of food for 3 of us to share.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/p8fRSwW4fN1lW6Gzzfgy5w/348s.jpg", "caption": "The hopscotch on the left and something with gin and coconut"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/O5sBn8QcBrzvl1Mdrn7Y0A/168s.jpg", "caption": "Beef Slap Noodles"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JdljhTijX2G7yIfLV6MvgQ/168s.jpg", "caption": "Jiazo"}]}}, {"review": {"des": "I teetered between 4 and 5 stars for a while on this one, as one item was OMG 5+ stars and another was just a meh 3 star. When we arrived at 5, we were lucky enough to get the last 2 spots at the bar. They advertise online that they keep tables open for walk-ins, but they said they couldn't seat us until after 10PM less than 30 minutes after opening so I am not sure how accurate that statement is. <br><br>Now onto the food! We ordered 3 dishes for 2 pretty hungry individuals, and it was the perfect amount. The first item was the crab rangoon, recommended by our waiter. I have had much better rangoons, as this one was very bland and the dipping sauce had 0 flavor...would not recommend. However, the beef slap noodles came out and blew me away. I would literally be happy with that dish for the rest of my life it was that good. For our entree we got the beef and broccoli, which was solid but not anywhere near the noodles.<br><br>Long story short: make reservations, get the beef slap noodles.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/boelvvGXLweRA7-NV3i0VQ/168s.jpg", "caption": "Crab Rangoon"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/g2Fh_MwXYxT-iZkeUdncpQ/168s.jpg", "caption": "Beef Slap Noodles"}]}}, {"review": {"des": "Duck Duck Goat has been on my list of a while and it is 100% worth trying.  The atmosphere, the food, and the kind service is something that should be experience if you live in Chicago.  My boyfriend and I split 3 items + side of rice and that was the perfect amount for us (no leftover, and not overly full, if you're really hungry - order another item).  We tried the goat and duck spring rolls, goat slap noodles (my boyfriends favorite), and the pork belly (my favorite).  Everything was seasoned perfectly if you love spice.  I'm not sure if it'll be a spot we come back to yet.  But thats because Chicago has so much to offer.  But so far, this \"Reasonably Authentic Chinese Food\" was very satisfying.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_yYgEIj2BrIWqUdIKypMBQ/348s.jpg", "caption": "Pork Belly! Sweet, salty, and juicy.  I had my portion (this is 1/2 of what comes out) over a side of rice"}]}}, {"review": {"des": "This place was amazing. We went for lunch. Definitely make a reservation, as it gets pretty busy. The service was incredibly quick, and the server was very helpful with recommendations as far as what to get and the amount of food. It's a place where you get several dishes and share. We got 3 things and it was the perfect amount. <br><br>For 3 people we got the crab rangoon, duck fried rice, and beef slap noodles. Everything was hot and delicious - especially the beef noodles. It was almost like beef stroganoff but much more flavorful (good for someone who's iffy about Chinese food). The duck fried rice was the best fried rice I've ever had - great portion and flavor, plus they give you a soft boiled duck egg to stir in. The crab Rangoon was pretty standard, but came with a pineapple something sauce that was way better than any sauce I've had with it before - a little sweet but not too much. I'd definitely come back and try other things here again!!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rSRcg7YGYf7C9nPrjubUvQ/168s.jpg", "caption": "This came with 5, but we started eating before I remembered to take a picture!"}]}}, {"review": {"des": "Not a fan. The seafood fried rice is really an okay dish and not some out-of-the-world delicacy as some reviews suggest. We also got the Chongqing chicken and it was good. We were seated outside and the service was slow. Overall, expensive and not sure about authenticity of dishes, there were only a couple of Asians", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rnI6oe9yJ06xV4cOJmYfIQ/348s.jpg", "caption": "Chongqing Chicken"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ox5eTD_J7N-tE3AJ8O2IfQ/168s.jpg", "caption": "Seafood Fried Rice"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-R5gswkbcdbZtLKKBVW9Tw/168s.jpg", "caption": "Seafood Fried Rice"}]}}, {"review": {"des": "Food (5/5): My friend and I ordered four dishes in total - the food here is meant to be shared. We ordered the xiao long bao, dan dan noodles, duck fried rice, and grilled beef and broccoli. All were delicious! By the end of the meal, the food did start to feel heavy and greasy, so we struggled to completely clear the plates, so it may have been smarter to have substituted one of our dishes for a vegetable dish to cut through the grease. The dessert menu looked interesting but we were too full to try.<br><br>Service (5/5): Good service, no complaints!<br><br>Ambience (5/5): Feels like a classic Asian fusion restaurant with lots of red and gold.<br><br>Overall, we had a positive experience and would definitely come back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OTFvq7qEJsExdXGrp_Q5Hw/348s.jpg", "caption": "Duck fried rice"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/U2ieZXWCPWW_ueIjv7h09Q/168s.jpg", "caption": "Dan Dan noodles"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vo3WIJ2jCJ8aADEwSnQUnA/168s.jpg", "caption": "Grilled beef and broccoli"}]}}, {"review": {"des": "I was super nervous about trying this place because all of the \"asian-inspired\" items at Little Goat are trash (IMHO), but I thought the majority of things that we had were borderline spectacular. There was one major exception to this, but let me get into it.<br><br>Duck fried rice: YUM. Oh my god. This was so balanced with mushrooms, corn and little duck bits. It was so delicious, so perfectly savory. I could eat this for days.<br><br>Char Siu Ribs:  good, standard. Not the most delicious version of this that I ever had, but they were cooked perfectly tender, yet textured.<br><br>Shrimp Toast: TRASH. If you like the traditional deep fried version, you probably will not like this. My husband thought it tasted like bruschetta. It's not fried, it's literally a piece of toast with shrimp on top with a ton of veggies and dressing. No. I think this should be re-marketed so people know what they are getting. They kindly took this off of our bill, do no harm done on my end.<br><br>Hongshao Rou: This was perfection. The sauce was so delicious I want to have this at least once/week for the rest of my life. you most definitely need white rice with this. <br><br>Goat slap noodles: ehh. Everyone at my table liked them. I wouldn't order if you do not like cumin. This was not quite my thing, but it was not bad. <br><br>Almond Tofu dessert: This was perfection. SO delicious, unlike anything I have eaten in the past. I was so impressed.", "pics": null}}, {"review": {"des": "Been meaning to hit this spot and can't say I'm leaving disappointed.<br><br>As a starter, the chiu chow fun gor is great. Sizzling when it arrived, the combo peanut and shrimp dumplings were flavorful and delicious. No need for any additional hot sauce. <br><br>Glass noodles were hearty and filling. We made a simple substitution, exchanging the mushrooms for shrimp.  The blueberries that came with the dish almost tasted like pork when eaten together with the noodles. I do wish, it was a tad less greasy but nonetheless my mouth was chopping it down.<br><br>The Pekan Cauliflower is another must get. Crispy, sweet n sour, pecans and cauliflower.  Name says it all and it delivers. Make sure you definitely way this hot as soon as it comes to your table.<br><br>We had a coconut flavored drink along with an old fashion. Neither was special. Do ask them to go easy on the syrups or sugars, as they were a tad more sweet than what I would prefer. <br><br>The dessert was my favorite dish. A mango gelato with a fruit yogurt with a mango-pineapple cake on top. Included dragon fruit and mango slices. Was so very light, flavorful, and not too sweet. Definitely get this. Put a smile on my face, diet be damned. <br><br>The environment was crowded and loud. But fun. Service was very good also.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_19LZn-6q1eR--RBOPXCZA/348s.jpg", "caption": "Shrimp and peanut dumplings"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tgV1VI8A2QqVYVmy2uJzxg/168s.jpg", "caption": "Glass noodles with shrimp substituted for mushrooms"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BX7C-GXGRU9qPn-GPewyZA/168s.jpg", "caption": "Coconut cocktail of some sort. I would pass on this."}]}}, {"review": {"des": "Since I started eating vegan, i felt the need to go back and review some places from that perspective. This is one of the places that has knocked it out of the park for vegans. Really, all the Goat restaurants do. Here, you get your own special menu, which includes a few things from the regular menu so you can order a bunch with a group and not feel left out. The green beans are very good. I wasn't that into the mapo dofu. Everything else i got from the vegan menu was outstanding. Great atmosphere as well, and service is top-notch.", "pics": null}}, {"review": {"des": "Really enjoyed this meal! Awesome food, great drinks, and our server was really helpful. Think it's a great place for family style because there are so many unique takes on dishes and they were well executed. <br><br>I LOVED the Open Sesame cocktail. <br><br>XIAO LONG BAO - Shrimp and goat soup dumplings: so good! If you're sensitive to hot foods like I am (temperature not spice) make sure you give it a minute to cool down. My table tried it first and told me I'd be fine and they were wrong. That said I still enjoyed it so I think that speaks to the strength of the dish. <br><br>Jiaozi - beef short rib and bone marrow pot stickers: short rib and bone marrow are buzzwords for me so if they're treat they stick out but if they're mediocre I am really disappointed. These passed the test and were among my favorite of the dishes. <br><br>BEEF SLAP NOODLES - Short rib ragu,  luobo radish: recommended by yelp and our waitress. Did not disappoint. <br><br>DUCK FRIED RICE - jasmine rice with soft-boiled duck egg: I really enjoyed this dish but wish I got more duck. It was the dish I was most excited about and fell a little short of those high expectations. <br><br>SICHUAN EGGPLANT - With bits of goat sausage: The goat sausage didn't stand out to be but overall I really liked the eggplant. <br><br>HONGSHAO ROU - 2 pieces of fatty, tasty, red braised pork belly: Everything you want out of braised pork belly. So yummy!<br><br>CHONGQING CHICKEN- Sichuan-style chicken with chilis: I felt like a lot of my bites were more breading than chicken, but I loved the flavor of the chili. <br><br>MANGO COCONUT CLOUD - Coconut sponge cake, mango, dragon fruit, kiwi: I typically go for rich decadant desserts but I loved this!", "pics": null}}, {"review": {"des": "I tried to like this place and specifically searched it out as a spot to get Peking duck. FYI they have to make the duck on reservations that go by the hour it seems <br><br>We ordered three dishes - <br><br>the beef wonton soup I had was strangely sweet, and the wontons were mushy with no texture. This dish needed more spice and some texture in the wontons. There were also bits of meat in the broth that tasted infinitely better than the flavorless short rib in the wontons, thankfully.<br><br>The chicken fried rice was too salty and they somehow fried the chicken in something way too oily. So the whole dish was ruined - I think this was the one fried rice order I have ever disliked except for a Thai resistant that used ketchup. <br><br>Lastly, the Peking duck. For 50.00, I expected the skin to be a lot crispier - oh and FYI they don't give you that fluffy traditional dough to wrap the meat in. Instead they give this moo shu pork type of wrap, which is okay, but not expected as the vehicle to transport the duck into my gullet. <br><br>All in all - a poor fusion experience. Don't think I'll be coming back unfortunately - the service was really good, too bad the food wasn't.", "pics": null}}, {"review": {"des": "Had a memorable dining experience here with friends - interesting menu, tasty food and great service. We had a reservation and were seated promptly, although we were at the first table after the entrance so didn't really get to experience the restaurant vibe. There are some side dining rooms and spaces around the bar that seem to have a lot of charm though. The food was quite good - we ordered 4 dishes for 3 gals and it was plenty of food. <br><br>Food Standouts: We all unanimously LOOOOVED the green beans (I probably wouldn't have ordered this on a regular day, BUT I had recently been to Girl and the Goat, the chef's other restaurant, and the green beans there were to die for) - order the green beans if you come here, trust me!! We also got the Dan Dan noodles (pretty good, but would probably try something else next time), and the chongqing chicken which was DELICIOUS (basically fried chicken with a bit of heat). We also got some spring rolls which were tasty. <br><br>Overall: definitely worth a visit to dine here. Solid, unique, tasty food and a good experience!", "pics": null}}, {"review": {"des": "I was incredibly impressed!  I read the reviews and knew the seating was tight but if that makes more seats available for people to enjoy this restaurant, then I'm all in!  Very friendly staff seated us early.  The waiter made many suggestions on how much to order and explained the menu well.   This is referenced as a Chinese restaurant but it's so much more. You won't find chop suey or orange chicken anywhere in the menu. We started with beef won ton soup. I had zero expectations of a starter soup. I could not have been more wrong. It was so flavorful and delicious. I could have made the entire meal on this alone. Everything is family style so we really experienced several wonderful dishes. I really can't wait to go back. Exceptional!", "pics": null}}, {"review": {"des": "Couldn't wait to try this place, but sad to say that I have had better Asian food at other places in China town. The decor was eclectic and the ambiance was great. The food was tasty...but in some cases the flavors seem to overpower the dishes. The seafood fried rice was not great...it smelled and tasted smokey. The seafood was overpowered by the soy sauce. It's so far from the fried rice I grew up eating. I was really looking forward to the Crab Rangoons...but the batch that I made at Chopping Block a few months ago was so much better! <br><br>At the end of the day, I was happy to spend some down time with my hubby at a place where we could just break bread.", "pics": null}}, {"review": {"des": "Went here with a group (definitely get a reservation) and tried a number of dishes and a few mixed drinks.  They had some good beer on tap as well if you're into craft beer styles.  As for food, we asked our server to bring us what's popular and what the chef recommends.  She didn't disappoint!  We got the duck hearts (we ordered a 2nd plate), some kind of goat dish (again fantastic), what i think she called beef and broccoli (the sauce was unlike any i'd had previously, so again, excellent), and soup dumplings (which were actually mt least favorite dish).<br><br>All in all the experience was great and I'd highly recommend this place.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Iu-WQY6KUyPXvzyGfD5Kng/348s.jpg", "caption": "Duck hearts.  Amazing!!!"}]}}, {"review": {"des": "Not sure about you but I never met an eggplant that I didn't like. <br>Always the eggplants dish wins. This place has been bookmarked for a while. So finally I got to try it with a friend from China, the Mainland.  It's an Americanized Chinese food what they serve here. We sat outside on the Chicago summer day, it was perfect. Service was excellent. The food was good overall. We enjoyed the experience.<br><br>Atmosphere: 4.4888888 Stars. <br>Cool seats outside overlooking W Fulton Market hip venues. <br>Service: 4.000008 Stars. <br>The ladies were alright. <br>Food: 3.8778999 Stars. <br>Beef dumplings were very good. <br>Eggplant stir fry dish was the star. <br>Crispy sesame chicken was overwhelmingly sweet. <br>House made goat sausage was interesting. <br><br>Overall, would definitely come back to try more of the menu items.", "pics": null}}, {"review": {"des": "LOST IN FLAVORS.<br><br>So much flavor. Way too much salt. If Cumin, soak it in cumin, etc. You get the idea.<br><br>For such a place they should have either a few small plates sitting on the table or they have to change your plates regularly. Given the sauciness of everything, sooner or later all flavors would end up being more confusing in that melange of je ne sais quoi.<br><br>5 dishes and one dessert. Nothing extraordinary. All a bit over ordinary. I still would like to go back to try their duck, fried rice with duck, and duck heart. In a few months. Not anytime soon.", "pics": null}}, {"review": {"des": "Duck Duck Goat is probably one of my least favorite restaurants in Chicago, and I've been to many. I've been to Little Goat Diner a bunch of times, so I'm familiar with Stephanie Izard's work, which is why I gave this place a chance. I also think the name is pretty cute. Besides their drinks, which are actually good and fun, and a waitress who was talented at advising me and my friend on what drinks we might like, that's where my praise for this place ends.<br><br>I get that this isn't trying to be authentic Chinese cuisine, and I think that's fine. What really disappoints me and makes me upset about this place is how mediocre the food is for how overpriced it is, in addition to incredibly Orientalist decor. We tried the goat xiao long bao, the shrimp toast, and one of the goat noodle dishes. I've had incredible xiao long bao, and was so sad by how meh this xiao long bao was. I love goat, so that's not really the problem. I even enjoy the dishes with an Asian/Chinese twist at Little Goat Diner, like This Little Piggy Went to China. But these all missed the mark for me - portion sizes were tiny, promise of good food was not delivered, and the waitstaff was a little condescending about whether we were familiar with family style. The whole air of the place felt like a restaurant/establishment that thinks they've elevated Chinese cuisine, but  has a very limited, Orientalist, and problematic view of what they're doing, and is also doing Chinese cuisine a disservice.", "pics": null}}, {"review": {"des": "We went back last night and had another fantastic experience.  I had a friend in from out town and they wanted a good restaurant in the West Loop.  I now live very close to Chinatown so I was a little hesitant to go back but it's it's own unique experience with an abundance of flavor.  I had the mapo Doufu vegetarian style and my friend had the Pekan chicken without pecans (she's allergic).  The first thing staff asks is if their are any dietary restrictions and are more than accommodating.  If you haven't gone yet and are looking for a good spot in the West Loop skip Girl and the Goat and come here instead!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DZ2GepMpni0zKaooQpl_SQ/348s.jpg", "caption": "Vegetarian Mapo Doufu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/J7pcbn8AXAsh-E0MjYfnkg/168s.jpg", "caption": "Pekan Chicken without pecans"}]}}, {"review": {"des": "Good but not great. Obviously you know what you are getting into when you come here, a take on American Chinese dishes. The menu is large and reflective of a Chinese restaurant menu - so many choices and styles. While taking the best of the best from the extensive American Chinese options -- there is still a lot to chose from. Trying to get a seat was a little bit of a put-off. There were several tables open outside as we walked up (early like 5pm) but they told us they were full. After some persuasion they seated us at a table. The inside wasn't nearly full yet either. I've worked in the restaurant industry and understand kitchen and server capacity -- but then have less tables etc. Don't turn people away.<br><br>For a side, get the green beans. We all loved them even our 16 month old. Stephanie should open a green-specific restaurant because she knows how to work with them! The Mapo Doufu was pretty good with lots of flavor. We forgot to ask for it spicy though. I thought the Lo Mein was missing some flavor. It's my go to American Chinese dish and I was sad I didn't like their version. <br><br>It was fun, but I am not making it a point to go back. It could probably be a lot of fun for groups or special occasions.", "pics": null}}, {"review": {"des": "Overall: Minus a few hiccups, Duck Duck Goat fully delivers on it's high expectations!<br><br>The good: Walking right in feels unlike other Boka Restaurants, the Asian atmosphere is well done and not cheesy in the slightest. Between the lighting, wallpaper and art, and overall style, it feels authentic and fresh. Food-wise, it's right up there with some classic dim-sum options. The shrimp toast was out of this world: a unique combination of chopped shrimp griddled inside of bread and was flavorful and filling. The scallion pancakes were also cooked to perfection and too crispy or soft, and were accompanied with a great slaw. Other than the last dish (see \"the not-so-good\"), the service was phenomenal as well.<br><br>The not-so-good: After 3 of our 4 dishes came out, they forgot the last one (which was the goat belly lo mein) so we were stuck waiting for 20+ minutes before having to ask for it. Once it finally did come out, there was practically no goat meat at all, which was par the course (we asked). For such a high-priced item, it was rather skimpy. Luckily, they comp'd us for the lateness. Also, the crab rangoons were quite a letdown (the hunt for the perfect CR continues)<br><br>Atmosphere: 9/10<br>Service: 8/10<br>Food: 8/10", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Drj9xM9Uyaf3SMghL2wodg/168s.jpg", "caption": "Goat lo mein"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/10RaQJSAjMNiPqjT2BMB3w/168s.jpg", "caption": "Crab rangoons"}]}}, {"review": {"des": "Had a business dinner here and was one of the best food experiences I've had in a while. Everything was  beyond delicious with a courteous and the right amount of attentiveness. Had the hot&sour soup which has ruined all other soup in my life...The moo shoo pork was made with Woodward mushrooms that tasted of of peat, oak, and salt (Delicious). Shishito peppers were blistered and smooth, but had the puffed rice to provide a crispiness. Absolute fantastic meal.", "pics": null}}, {"review": {"des": "It was our first time here and I guess we chose the right time and right day for brunch! I was able to take a picture of our appetizers and the rest because we are so hungry was eaten so fast that we have to order for seconds.<br>This is what we had for brunch:<br><br>char siu bao (not dense and I must say really tasty) <br>crab rangoons (this one looks like it is on a diet, I guess I got used to huge crab rangoons that are served here in our local Chinese restaurant)<br>Goat and duck spring roll (I was so eager to see, taste, smell and digest this food. I am not disappointed)<br>Taiwanese fried chicken (highly recommend!), Duck fried rice (same... highly recommended) <br>and our favorite of all, Jiaozi aka beef short rib and bone marrow potsickers (after finishing the first serving, we all decided we should get another one and that is because it is really good).<br><br>When we got there the place is not yet crowded but everything went busy the minute we got to our table. Our server Joslyn, looks tired already but she got all our orders correct and served really hot.<br>I am glad that we decided to celebrate father's day here, it may be an hour drive for use but it was worth it. Plus this is chef Izard's restaurant and I've been to her other 2 restaurant. Not only was it our first time to this restaurant but it was our first time in the area. We already made plans to visit the other restaurant in the area, weather and budget permitting of course!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wpHonGXCtjEGbuVJYTXkyw/348s.jpg", "caption": "Pot stickers and crab rangoon"}]}}, {"review": {"des": "In some ways a product of much that is unpleasant about Food today, reality Television launching her career and menus often accusable of cultural appropriation, Stephanie Izard has nonetheless managed to capture the attention of Chicagoans and traveling gourmands thanks to a unique ability to produce enormous flavors that remain enjoyable, her latest effort entitled Duck Duck Goat carrying on that tradition with tongue-in-cheek \"reasonably authentic\" Chinese Cuisine.<br><br>Located at 857 West Fulton Market, a hip area having grown tremendously since Chef Izard opened Girl & The Goat nearly eight years to the day prior, Duck Duck Goat resides across from the gussied up Kuma's Corner and down the way from Roister, a 4:30pm nightly opening joined by popular Dim Sum Brunch on Sundays though this particular visit saw the space mostly empty due to hot weather and a malfunctioning air conditioner.<br><br>Without doubt an attractive space, the foyer opening to lanterns, gates and padded stools with banquets lining several more-intimate rooms on the sides it was upon seating next to three self-professed \"foodies\" talking loudly about boys and work that the temperature issue was immediately noticed, a cold glass of Water drained quickly and the decision made to order plate-by-plate while gauging hunger proving wise as only the succulent Pig Face Buns were eaten before requesting a move outside.<br><br>Happy with the first bites of crisp-gives-way-to-fat and acknowledging the server had no control over temperatures, his understanding and willingness to split time between inside and out commendable even when a lack of cover on the patio necessitated further movement to avoid the sun, it was as people passed by that a second trio arrived featuring ground Goat inside fried Glutenous Rice, the texture more than \"reasonably\" authentic and filling delicious thanks to a complex blend of Spices. <br><br>Debating spicier options but finding it difficult to get excited about Szechuan anything at 90F and over 70% humidity it was based on a promise of \"they're my favorite dish\" that a small-ish Bowl of Noodles was presented slicked in Soy with tender cuts of Meat amidst Wok-fried Vegetables, the price no doubt more than a double portion would be in Chinatown but the bite-for-bite result worthwhile.<br><br>Ending the meal - and this trip to Chicago - on a high note, unsolicited advice from the server again spot-on, it was passing up Shaved Ice and Donuts that two Puddings were presented, the \"Almond Tofu\" essentially Panna Cotta with a savory slant and textural elements while its competition truly was cloud-like in its support for what is essentially Tres Leches Cake flanked by Tropical Fruit.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JQZEWKuBNpxtIZSAfmyH1Q/348s.jpg", "caption": "07/08/18 Duck Duck Goat"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AyYd0hUb3ytjDhjPGc-FvQ/168s.jpg", "caption": "07/08/18 Duck Duck Goat: Pig Face Buns - Spicy Mustard (interior)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YHuI1C6iWs4p6NidbF5nyQ/168s.jpg", "caption": "07/08/18 Duck Duck Goat: Pig Face Buns - Spicy Mustard"}]}}, {"review": {"des": "I love dim sum, and think this a great place to go for a change of pace from some of the Chinatown standbys such as Dolo, Cai, MingHin, etc. I like how each room at Duck Duck Goat has its own unique color scheme and decor. The service is also more friendly and professional than what you might sometimes experience in Chinatown. Lastly, you don't feel pressure to pay and leave as might happen on a Saturday or Sunday during prime dim sum hours in Chinatown. I think the quality of the product is also better here and don't mind paying more for dim sum every once in a while. <br><br>Some of my favorites after a few visits:<br>-Spicy Xi'an Goat Slap Noodles with goat shoulder, cumin, sichuan peppercorn, and finger hot chili. Favorite! I love the chewy, bouncy texture of the noodles. <br>-Jasmine Fried Rice with Duck and soft boiled egg<br>-Char Siu Bao steamed bbq pork bun<br>-Goat and Duck Spring Rolls with hot mustard and sweet and sour sauce<br>-Ham Sui Gok glutinous rice dumplings with goat<br>-Smashed Cucumbers with chili oil and herbs<br><br>I haven't been for dinner, but my friends say it's also fantastic. Recommend!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yPNORMxioAOMDJ5qzf4a7A/348s.jpg", "caption": "Silver needle noodles."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6LJ-xHCERVS88STdAUhr6g/168s.jpg", "caption": "Sesame donuts with sesame whip."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fjh07OJij_ZkhJ51okgd7Q/168s.jpg", "caption": "Coconut 'cloud' with mango."}]}}, {"review": {"des": "And yet another one of Stephanie Izard's awesome restaurants. Now, I've only one left to try. I'd heard very good things about Duck, Duck, Goat. I was excited to try it. There's never enough stomach room though when it's only two people. Darn.<br><br>I'm going to start with I LOVE the decor. Each room that you want into has a slightly different theme than the one before it. There's a bar kind of in the middle, right in front of the kitchen that kind of reminds you of an outdoor restaurant in Southeast Asia. We were in the red room with a great view (great for people watching) of the sidewalk outside. Not that you should ever need to people watch, but my friend and I were just a little out of it from our 4 hours of sleep the night before. <br><br>The service is great. The server we had, Sarah, was awesome. She had some great recommendations. We got there about 1/2 an hour before the end of brunch and were able to order a few items off that menu and then also order off their regular dinner menu. Yay! We were even more excited. Food came out fairly quick. We were told that that it would come out in waves and that our table would never be void of food, but it actually came out faster than anticipated and we had too much food, at times, on the table. Maybe we were eating slower than their usual guest...we were hoping it would actually be a little more casual/slower though.<br><br>The food:<br>Jiazo - beef short rib and bone marrow potstickers (5 per order). These were delicious. It really did melt in your melt as our server said it would. The meat inside had great flavor and they were well filled. The sauce was awesome that came with it. <br><br>Beef Slap Noodles - short rib ragu, luobo radish. We were told by some friends and our server that these were a must get....so we got them. They are delicious. The noodles are big and wide and totally taste like their homemade. The ragu mixed and melted well with the noodles. The only downside was that ours came out quite salty. Because of that, I'm not sure I would order them again before I tried something else first. <br><br>Green Beans in Black Bean Sauce - our server said this was one dish she didn't let her customer leave without getting so we had to try it. We were not disappointed. The beans aren't necessarily crunchy like you might think...or like you may have had at Girl and Goat, but OMG the flavor is soo good. You get a very healthy portion and the sauce is amazing. The cashews were awesome, as was the crunch of the fried garlic/onions on top. These were a tad salty also, but not so much as the Beef Slap Noodles.<br><br>Taiwanese Pineapple Cakes (brunch only) - these were a sweet and delcious sweet treat. The cake itself was a little dry (kind of corn muffin dry), but the pineapple on the inside definitely helps and it was delicious. A little frosty or sauce would've been perfect...maybe a little whipped cream.<br><br>Taiwanese Fried Chicken (brunch only) - with char siu sauce and garlic aioli. These didn't seem like anything super special honestly, but they were one of the items that were on the brunch menu only. It's strips of fried chicken. Great with the char siu sauce. A healthy portion...and the left overs served cold on a salad is great or just great to snack on... kind of like popcorn chicken, but bigger pieces. Not much flavor really otherwise.<br><br>I do intend to go back at least one more time. I want to try the fried rice with the tea soaked eggs and a couple of the other dishes.<br><br>TLDR: definitely worth checking out. GREAT decor. Good service and servers. MUST GET: green beans with black bean sauce.", "pics": null}}, {"review": {"des": "Visited this restaurant for the first time this week and very much enjoyed myself!<br><br>We had 6:15 reservations but unfortunately I ran late and bestie couldn't be seated until I arrived. I didn't get there til almost 7 but the host was still able to find us a table. Kudos for the customer service and patience! (And yes I apologized for the inconvenience)<br><br>Now on to the food. I thought it was simply delicious. For appetizers we ordered the pork bun bao. Soft and flavorful. Bestie also wanted me to try scallion pancakes for the first time. Phenomenal! They were seasoned well and came with this Asian slaw for texture. Banging! I could eat the slaw by itself. <br><br>For entrees I was torn between the Pekin Chicken and the Chongqing Chicken. I chose the Chongqing and boy did it have some kick! Bestie said it wasn't that spicy but she can eat Habaneros with a side of Jalapeños. So her opinion is moot! While spicy, I thought it was cooked well. Crispy and flavorful. Definitely a dish to order. <br><br>Lastly we ordered dessert. Sesame doughnut holes with a maple syrup whipped cream. OMG. Hmm. Hmm. Hmm. Good. <br><br>All I can say is that it was a great delicious experience and I would definitely recommend to others!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yqrhaYpJ4HHGpZ1GRdjsWA/348s.jpg", "caption": "Seafood Fried Rice"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UYZfvvoGrSGrc_-H3zTU3g/168s.jpg", "caption": "Scallion Pancakes"}]}}, {"review": {"des": "I like Chinese food but I'm not usually overly enthusiastic about it. It's more of a home-cooked style kind of fondness (even though I'm not Chinese). But the \"standard\" Chinese dishes at this restaurant blew me away. <br><br>- Beef and Broccoli: Don't be fooled by the nonchalant title. It's THE beef and broccoli. I've rarely tasted anything as smokey and savory as this.<br><br>- Duck Fried Rice: Simple in its best sense. The soft-boiled duck egg makes this dish stand out from other fried rice. <br><br>- Xiaolongbao: Sadly, this was very disappointing. As you can see from the photo, the dumplings were FLAT and had little soup in them. I first thought the chef made a mistake. <br><br>Despite Xiaolongbao, I'm willing to give 5 stars because I liked the other dishes so much.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/REgNgbeA1WPrCj8dRqgvWQ/348s.jpg", "caption": "Best duck fried rice out there"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5_qeCsR_VQl-DwL7VFGtNw/168s.jpg", "caption": "Mind-blowing beef and brocolli"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/u2f4BT7yUFiDemZpzIhfLg/168s.jpg", "caption": "Flat xialongbao: do not recommend."}]}}, {"review": {"des": "This place does not disappoint. <br><br>Order the duck and wine for sure. Dishes are meant to share and come out as they are ready. Appetizers are a little pricey starting around $12 and the seats are pretty close together so not much privacy.", "pics": null}}, {"review": {"des": "I truly wanted to love this place, but unfortunately did not. Not to say that I didn't enjoy my food or experience, however, I did come in with high expectations and left sadly underwhelmed. <br><br>The service was great. Our server was friendly, helpful, and engaged. He helped us navigate the menu and gave us excellent recommendations for various items. It's family style so be careful on the servers upsell technique because of that. He recommended that each person order at least 2 items. However, we ordered 6 items for the 4 of us and it was plenty!! <br><br>We ordered:<br>Steamed barbecue pork buns - The bun itself was pretty basic, but the bbq pork was really tasty and full of flavor. <br><br>Beef short rib and bone marrow potstickers - Very interesting texture inside. The short rib just melted in my mouth (in a good way), and I loved the accompaniment dipping sauce.<br><br>Rice dumplings with goat - Not a fan. I've tried goat before and liked it, but this dumpling was unmemorable and bland. It was my least favorite item we ordered. <br><br>Scallion Pancakes - I LOVED the scallion pancakes! Such a great flavor. Nice and small and easy to eat. The slaw that it came with so delicious! <br><br>Duck Fried Rice - Delicious fried rice, but there was nothing stand out about the dish. Pretty basic. <br><br>Moo Shu Pork - It was a great dish! Flavorful and fresh. <br><br>Duck Duck Goat is a good restaurant, but not great. It's a tad overrated and expensive for what I considered just okay Chinese food. I do have to point out that the decor and ambiance are amazing! Beautifully and thoughtfully put together that's for sure!", "pics": null}}, {"review": {"des": "It is probably the WORST Chinese food I have ever had...Extremely salty and greasy, weird usage of ingredients. Plus, the price is so high. You can get amazing Chinese food for 1/3 of their price. <br><br>Their marketing and service are good for sure. <br><br>I feel many non-Chinese people just don't know the good Chinese restaurants. I took my non-Chinese friends to places like Dolo, Minghin, Potsticker House, they all love it more than duck duck goat. <br><br>I almost never gave one star, but duck duck goat deserves one...", "pics": null}}, {"review": {"des": "This was one of our fancier group dinners while visiting Chicago. Make reservations in advance because this place is very popular. Walking in, I was intrigued by the decor...reminiscent of old-school Chinatowns. But what's up with the red circle stickers placed on random parts of picture frames? I liked the whimsical images of their namesake strewn throughout their menu and beer glasses. Btw, they sell the beer glasses and wrap it in paper adorned with the cute ducks and goat...thanks for my souvenir ;P<br><br>As for the food, we ordered: <br><br>Shrimp+goat xlb...huge xlb, goat tasted game-y<br>Beef short rib&bone marrow potstickers...pretty good<br>Hot&sour eggdrop soup...not what I expected. I've had/made better. It was neither spicy or sour<br>Beef slap noodles...needed some sort of sauce. It was alright<br>Duck fried rice...tasty. Enjoyed the soft-boiled egg<br>Grilled whole fish...my fav of the night. Ask for white rice to eat with the sichuan broth<br>Green beans in a black bean sauce...our group's favorite dish. Crisp, tender, full of flavor<br>Mango coconut cloud...didn't try, but pretty presentation <br>Fried sesame balls...not a fan of sesame, very overpowering, but the whipped cream was yum<br><br>For a party of six, we paid about $45 per person. I guess I liked half of the items that we ate. Now I can say I have eaten at a restaurant owned by a Top Chef winner, yay!", "pics": null}}, {"review": {"des": "it's near my apartment. We came here together on a nice Sunday night! Even though The whether is not so good as yesterday.we ate outside of the restaurant. I know he wants do sth please me and treats me a popular Chinese cuisine. For an original Chinese, this restaurant seems more US style instead of Chinese lol. Have to say so! But the eggplant is so good and authentic. <br>We both like the plate here, there is two ducks and one goat decorated on it! We find them out together and have a lot of fun!<br>It's a good place to have dinner with the one you like. Bring her here, even you fall in love with her in a minute! want to make her smile for a second!!", "pics": null}}, {"review": {"des": "We loved this restaurant. The food was amazing, full of flavor, and fun (haven't used \"fun\" as a food adjective before). Our sever, Sarah, made our dining experience even better with her quirky sense of humor and great food tips.<br><br>We stayed with the \"Chef's Delights\" part of the menu, starting with the decadent Shrimp Toast. We followed that with the Seafood Fried Rice, the Sichuan Eggplant (with bits of goat sausage), and the Green Beans with black bean sauce. All were full of flavor. Only problem was the fried rice was overly salty. We had some left over and especially noticed the high salt levels when we had it for dinner the following night in our hotel room.<br><br>For dessert we tried the Almond \"Tofu\" with candied almonds, black vinegar sauce. It really tasted more like a flan, or maybe a custard. Not overly sweet, and the candied almonds gave it a great texture while the vinegar counteracted the very sweet candied almonds. Excellent!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vTdpCSQxgwjB5lO65eDdCA/348s.jpg", "caption": "Chef's Delights portion of the menu."}]}}, {"review": {"des": "100% not a Chinese restaurant, but still super salty and greasy. Chef Izard made it more like a Chinese fusion place, but very bad fusion tho.. <br><br>Except for the duck fried rice (which is difficult to ruin a fried rice dish..), everything else is pretty bad, and the Jian Bing Thing (served in the takeout window - Baobing) got me almost throw up. The Jian Bing Thing is a mixture of ice cream, greasy chili oil, and corilander... This is just one example of how Chef takes on the dish, really weird and unpleasant combination. The art of making good food should be consistent everywhere, and the philosophy of using different flavor/texture together should not overwhelm the making of good tasty food that people would feel comfortable putting'em in their mouths. <br><br>Most of dishes that I order (Hong Shao Rou, Twice-cooked Pork, duck heart, beef wonton soup..) had really strong bloody/earthy smell and taste, probably they have not clean up (boil the meat with spice to get the blood and other dirty stuff out) before starting the dish (using raw meat for high-temperature cooking right away, which is going to have the meat sealed the earthy/bloody taste within the meat). <br><br>They definitely get credits for the decoration, thats all. And I love Chef Izard's other restaurants.", "pics": null}}, {"review": {"des": "Love this place! From the atmosphere to the food and friendly staff, I had a great time with coworkers here on a business trip. The staff was very attentive and friendly. <br><br>We started off with drinks and I had a cocktail called the Jade Gate with pistachio, green tea, aloe, and honey flavors with tequila. It my favorite drink, but s good twist to regular margaritas with the green tea salted rim. It's also a refreshing drink.<br><br>For appetizers we started with the dim sum pork buns, veggie and peanut crystal skin dumplings, and Sichuan sausage stuffed calamari. My favorite was the calamari with the chili flavors and sausage that made the flavors come together. The calamari is slightly charred and adds to the flavors. Pork buns were steamed perfectly and the dumplings were pillowy soft and not overstuffed so you could get an even bite without the stuffing falling out. <br><br>The dinner dishes were our favorite. We got the following dishes: Pecan Cauliflower, Mali Doufo (Sichuan spicy tofu and pork), grilled shrimp, and fried chicken fried rice. I have to say, I never thought cauliflower could taste so good! Everyone at our table loved it. The pecan flavors gave the dish a lovely glazed flavor that I actually think the vegetarian dish was my favorite. However, all the dishes were amazing. I especially liked the spicy tofu with rice since I love chili flavors, and the pork was well seasoned and moist. The proportions are also large even for family style eating and I wish I wasn't traveling for work so I could have taken home the leftovers!<br><br>This is one of my favorite places in the area and I am definitely going to be back. Not to mention, I love the duck duck goat sign!", "pics": null}}, {"review": {"des": "The decor is tasteful. That's a real risk in creating an American Chinese restaurant. The cute cartoons on all their stuff are adorable ducks and goats and thankfully not caricatures. They aren't using icky fonts. That's a great departure from many of the strip mall \"Chinese\" restaurants we grew up with. There is also a good amount of care in elevating the American Chinese food.<br><br>We visited on a Saturday for a dim sum-inspired menu.<br><br>First of all the drinks: the Facing West made with scotch, sherry, and spiced pear was a smokey all booze apple cider. It was phenomenal. The ginger sour made with egg whites was also delicious.<br><br>And the food: Jiaoza potstickers were delicate, slightly crispy, and fatty and were filled with tender meats. The full-bodied richness was offset with pickled chiles and salty fermented juice. Upon tasting the dipping juice my companion announced, \"I want to drink that!\" So we did. The bartender thought we were weird.<br><br>Xiao Long Bao soup dumplings were filled with silky broth and perfectly cooked shrimp and goat. The wrappers were a little sticky--you really need to follow the instructions to eat them without dousing yourself with soup.<br><br>Tawainese fried chicken had a crunchy exterior and juicy interior. It is the only good popcorn chicken and paired nicely with a molasses bbq sauce.<br><br>Other dishes included duck and goat spring rolls featuring an aioli-like mustard dipping sauce, rice vinegar pickled cucumbers, and delicious mini egg custards.<br><br>In addition to delicious flavors, Duck Duck Goat understands food texture. Every item has contrasting flavors and feels. I love this place on one visit and can't wait to come back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/o71jtMvvGhlIKv1gGN6SVg/348s.jpg", "caption": "The duck duck goats are on a quest. My quest ended with egg custard in my belly."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6DFzGh0tADdhsLg6W31-4A/168s.jpg", "caption": "Soup dumplings"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jmdp8WMSX0hw8-UsMwYXvw/168s.jpg", "caption": "Jioza dumplings over a cute plate."}]}}, {"review": {"des": "What can I say about Stephanie Izard that hasn't already been said?! The Top Chef winner, Iron Chef extraordinaire, and Chicago resident has been consistently impressive with her non-conventional takes on popular dishes. DDG is dim sum with a twist, on steroids! Be warned, the dishes are elevated, and so are the prices.<br><br>The decor is incredible and is a total #throwback to the Chinatown parlor of yesteryears. The staff is really friendly, describe the dishes in an accessible way, and give really good suggestions for dishes and portions. We went there for our anniversary and were pleasantly surprised to receive two complimentary flutes of champagne.<br><br>The menu is a blend of both authentic and wonderfully inauthentic Chinese food and is sure to please a wide variety of palettes. Almost everything we tried here was incredible. The Crab Rangoon and the shrimp and scallion potstickers were standouts. We also ordered the slap noodles (too heavy for my taste) and the Taiwanese fried chicken (a little dry).<br><br>The green tea and oolong based cocktails paid wonderfully with the food and were some of the best I've had in non cocktail bar setting.<br><br>We spent over $120 (including tip) for all of the above, which is definitely a little steep, but the portions were big enough so that almost half of the noodles and the chicken were left over. <br><br>If you want Chinese food that you'll crave even months after, you've GOAT to duck in here!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wbo3O981txScqk4Ff0fi-g/348s.jpg", "caption": "Slap noodles with goat sausage"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2h7VTOovoY19_TmEekwiSA/168s.jpg", "caption": "Taiwanese fried chicken"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8EHoStRFqPor_IeooTbr0g/168s.jpg", "caption": "Champagne flutes and my oolong tea cocktail"}]}}, {"review": {"des": "Honest review: i just like the actual noodles (like the girl who makes noodles deserves a raise) they were tasty and had a good chew to them the foods not authentic n some of it is extremely salty. foods not good tastes like your favorite chinese take out just way more expensive . mott street was so much better. service was weird i sat at the bar n like everyone was drinking like alot so because of that service was lacking. It gets really crowded so make reservations in advance the inside is very cute theres alot of seats but most of them will be taken or reserved there were a couple of issues with the food first some dishes were really salty like inedible <br>Secondly there was way to many garnishes n ingredients that didnt belong like there was thai basil in every dish that is such a strong herb that takes over other flavors thirdly dishes that were labeled spicy werent spicy at all lastly some dishes were not traditional at all its okay if its tasty but some dishes were just a terrible a misrepresentation that didnt have any flavor like a lot of dishes tasted like Italian food they really need to cut the menu down to 1 page maximum <br>Best things: rhubarb shaved ice/ shrimp slap noodles/ goat lomein <br><br>Dan dan noodles $15: not traditional at all the noodles were amaizin chewy n were tasty this tasted like a bolagnase with pork. The pork is supposed to be fried n crispy these were not it was really tasty though<br><br>Shrimp slap noodles 17: really tasty the shrimp was cooked well n the sausage was really good the flavors were really good but again this reminded me of an italian pasta reason being there was tomato in this <br><br>Chicken chow fun 16$: the only thing good about this dish is the noodles because they were crispy n flavorful the rest is terrible no flavor n the sauce had a really unusual sweetness to it that was off putting<br><br>Goat Lo mein $17 amaizing but was extremely salty the goat belly was so delicous and rich so much better then any bacon u ever had before the sauce is supper rich n the veggies cut through the richness was a lil salty <br><br>Chonqing chicken 18$ really tasty but was really greasy like really greasy comes with two sauces a mayo and like spicy sweet dipping sauce the spicy sweet dipping sauce is extremely salty so do not eat it by itself eat everything together for the perfect bite <br><br>Mapo doufu $17 worst dish of the nite it was inedible like so salty after one bite i had to send it back n i never send anything back ever mapo doufu is my favorite chinese dish n this was not traditional at all tasted like a chow fun <br><br>Blueberry rhubarb ice $ 10 amaizin one of the best desserts i ever had its not a shaved ice its a sorbet so dont be afriad of the the flavors were amaizin the rhubarb sorbet is supper refreshing n sour n then theres this blueberry spicy icecream that adds heat to cut through the sweetness then theres condensed milk to add sweetness the crunchy corn was to die for only problem plz put more after like one spoonful its all gone<br><br>Mango coconut cloud $10 didnt really care for this its just cake coconut milk n fruit that doesnt add anything they really need to revamp this n make it taste better its really basic", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cD-bVGghxyGQ1VAxIRU_MQ/348s.jpg", "caption": "Mango Coconut Cloud $10"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2FJV0Bw46arYN6O5gKQMdw/168s.jpg", "caption": "rhubarb Shaved ice $10 best thing here"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/83B-NCvjZYgONjCT82dmpg/168s.jpg", "caption": "Mapu dofu"}]}}, {"review": {"des": "Duck Duck Goat went above and beyond my expectations. There is a great atmosphere from the moment you walk in. The waitstaff was very friendly and knowledgeable. They were able to help us decide what dishes to get based on size and what pairs well together. <br><br>The drinks were really unique and delicious. We ordered a lot of small dishes to share and everything was amazing. I can't recommend Duck Duck Goat highly enough. It is a little pricey but you get what you pay for... high quality, interesting, delicious dishes.", "pics": null}}, {"review": {"des": "While Duck Duck Goat has been around for a little while it is new to me as recent visitor to Chicago. I've had heard many good things about it, so I thought I'd give it a try. I typically do not like to go to trendy Chinese places, but made an exception for this Stephanie Izard establishment.<br><br>First off, if you are traditionalist and are expecting something you would find in Chinatown, check that expectation at the door! Duck Duck Goat adds it's own interesting take on traditional dishes.<br><br>The ambiance was really cool, and was almost like a step back in time. It had a modern retro feel to it. I was seated at a small table for two as I was a single this evening. The server provided me with an overview of the menu and explained how everything was sharing sized. She gave me some suggestions as well as how much to order.<br><br>I decided on the short rib and bone marrow potstickers (jiaozi), goat meat soup dumplings (xiaolong bao), and green beans in black bean sauce (with a side of rice). All of it was amazing, especially the potstickers. I would likely not get the soup dumplings again as I am not sure how I felt about the use of goat in this traditional Shanghainese dish.<br><br>The service was excellent and attentive. I would definitely come back, but with friends. The sharing is a must to maximize trying of each delight!", "pics": null}}, {"review": {"des": "I'm a big fan of Stephanie Izard so I had really high expectations.  I once snuck in a picture of her while at a restaurant dining at a table next to her.  She's a true culinary legend in Chicago!<br><br>That said with Duck Duck Goat, I wasn't disappointed but certainly not impressed...  between the 4 of us we really gave her menu a genuine chance (see pictures).  Honestly, some dishes really failed at flavors, and were over powering with Szechuan Peppers.  <br><br>I did enjoy veg fried rice which certainly brings out the crunchy flavors!  I also enjoyed the eggplant and the shrimp dumplings.  It didn't compare to Little Goat, or Girl and Goat but definitely worth trying at least once to have your own opinion.", "pics": null}}, {"review": {"des": "I was charmed by each of the different rooms of this restaurant. We were seated in a space that resembled an apartment, covered in mismatched wallpaper and interesting family photos from the turn of the last century, give or take. It gave us a view of the kitchen where noodles were being made diligently. Next to us was the bar area with high-tops and a jewel-box of a room done in a bright pink pattern. It was so pretty.<br><br>My sister and I have different ordering styles. She usually asks the server for recommendations whereas I'll make quick decisions and am usually not wrong. She selected one of the dishes while I ordered the rest, all to share. Of course, I ordered several items from the top row of the dim sum menu because everything sounded fantastic, which prompted some teasing. Hey, my system works.<br><br>We enjoyed:<br><br>Char siu bao: barbecue pork in a soft steam bun, topped with sesame seeds. The baos were larger than what is served at Chinese restaurants so I only had half, not wanting to fill up with so many dishes to come. Additionally, the buns were not as soft and fluffy as what I am generally used to.<br><br>Ham sui gok: tasty goat meat in a glutinous wrapper, lightly fried. These were fantastic. And I could not believe how light they tasted, not seeming to absorb any oil.<br><br>Shrimp toasts: were amazing. I am still thinking about the buttery crust topped with a lush amount of shrimp and a yummy sauce. I could have had a few more helpings of this dish and still not grown tired of it.<br><br>Short rib with slap noodles: I did not care for this dish because of the texture of the noodles, nor the shredded beef mixed in. The noodles were larger and thicker than expected so they sat heavily in my tummy. <br><br>Spring rolls: thin cigar-sized rolls were packed with goat meat and duck skin. Served with hot mustard and sweet and sour sauces, I inhaled the hot and crispy rolls.<br><br>Mango coconut cloud: Chunks of mango, kiwi, and dragonfruit shared space with a light, chiffon-like, coconut cake, all in a fluffy cream. The dessert was delicious and creative - where else will you find dessert featuring dragonfruit?<br><br>From the start, service was average.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Wp4ErcVzE1wPSPkUJpnm_Q/348s.jpg", "caption": "Goat meat spring rolls with hot mustard and sweet and sour sauces. These were so very good."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9aY8CdE0rrOxwrRhvInXYg/168s.jpg", "caption": "Slap noodles were just okay."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BsUGLQbr3SH2239p81QzQA/168s.jpg", "caption": "An abundance of shrimp on crispy, buttery toast, topped with spicy sauce. So many incredible flavors."}]}}, {"review": {"des": "A home run.  Took friend's recommendation and was not disappointed.  Located near Google,  a 2.5 block walk from Morgan train stop.  The decor could be trying too hard, but the food delivered.  <br><br>I was wary about not being cool enough there and somewhat concerned food would not live up to hype.  But staff was welcoming and server Bo gave excellent recommendations.  We enjoyed the shrimp and goat soup dumplings, string beans with black bean sauce,  Sichuan-style chicken with chilis, and my favorite, Goat Slap Noodles.  These were thicker than chow fun noodles and provided a real substantial al dente bite with a lovely cumin kick.  <br><br>I also observed they had a mushroom free menu which shows they care about patrons' experience.  Bo also asked about allergies or dietary restrictions.  They are pros. <br><br>Good beer and wine selection.   My bride and I had a lovely dinner as food arrives straight from kitchen.  Very relaxing and we were pleased with the value.  A popular restaurant in a upwardly trending neighborhood was barely over $100 including tip.  Don't see that everyday....we have a new recommendation when friends visit Chicago.", "pics": null}}, {"review": {"des": "This review is for the walk up counter, Baobing. It just opened two days ago, and I love it already!<br>My husband and I split a fried chicken wrap-- it was stuffed with popcorn chicken, fresh pickled cucumbers and other crisp veggies, with a savory aioli sauce and fresh herbs (basil, mint, cilantro) all wrapped up in a scallion pancake, drool... so good! It was a unique and interesting dish with a ton of flavor. Every bite tasted subtly different but all of it was great! And the portion was huge for the $11 price. <br>For dessert, we got the mango cloud city ice cream sundae. I loved it! The \"cloud\" was like a whipped foam that had a great coconut flavor, which was topped with tangy mango shaved ice, fresh diced mango and kiwi, and vanilla soft serve. It was a beautiful sight to behold and so delicious!<br>The only con was the lack of seating and garbage cans. The walk up concept is great, until you get your food and have nowhere to eat it. Awkward.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iTkvbkJck1cI0wk3H0nNNg/348s.jpg", "caption": "Cute characters!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QXvCFWT2RPG0oJQVgbqg2w/168s.jpg", "caption": "Walk up window"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hVc9U6jnZX6I1vH4TT_Q4A/168s.jpg", "caption": "Walk up window menu"}]}}, {"review": {"des": "I travel a lot so i eat at a wide variety of restaurants. When i find restaurants that have unusual menus with very unique flavors they stand out. We ordered about a dozen items none of which i have had before except for shishito peppers. Everything we ordered had very different and enjoyable flavors. I like to experiment and try new things when i find restaurants with items i haven't tried. I was very hesitant to try the fire roasted duck hearts i was very pleasantly surprised. I will definitely order them every time i visit this restaurant. The flavor was exceptional. We had fried rice, Octopus, cucumber salad that was refreshing.", "pics": null}}, {"review": {"des": "Amazing food!  I do not eat a lot of meat and my boyfriend is gluten-free and there was plenty of delicious food for us to fill up on. My favorites: Pekan cauliflower, veggie fried rice, and the green beans. My bf loved the duck.  Great service as well- Reservation needed.", "pics": null}}, {"review": {"des": "Finallyyyyy got around to trying Duck Duck Goat and was not disappointed. This was one of those restaurants where I wanted to try almost everything on the menu, however, we finally decided on the hot and sour soup, scallion pancakes, and the pork and peanut dan dan noodles. The portions were pretty big but also pricier than most Chinese places. <br>The hot and sour soup was tasty with a bit of a kick. The scallion pancakes were to die for and definitely my favorite-loved the sweet dipping sauce that came it. The dan dan noodles were good but probably wouldn't order them again.<br>The inside had a very cool vibe with each room having its own theme and color scheme. <br>Can't wait to go back and try some of the other dishes!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/00rmElGCYvIeNqeZYxao2g/348s.jpg", "caption": "Birthday Orange Sherbert :)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iDHGgTxwPU_Jksh1yWCu3A/168s.jpg", "caption": "Dan Dan Noodles"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qfN6uOEh0bCOPwt3qgMwGg/168s.jpg", "caption": "Scallion Pancakes"}]}}, {"review": {"des": "Rude waiter. Bastardized Chinese food. If you think this food is good, then... perhaps travel more?", "pics": null}}, {"review": {"des": "Any time I'm in Chicago I always try to make it to at least one of Stephanie Izard's goat restaurants. Duck Duck Goat has been consistently easy to get a reservation at with superior food choices. I've come here twice for their weekend dim sum menu and have consistently left gleefully full. TLDR: Good food, good services- come here!!<br><br>The Service:<br>The hostess at the front as well as the waiters are always extremely nice and helpful. This past visit we had booked two tables of 8 and the hostess was able to seat our groups next to each other (thank you!). We even had to slide in one more chair to accommodate a last minute addition and the restaurant was incredibly accommodating this last minute change.  <br><br>The Food:<br>I don't think I've gotten a single thing on this menu where I was like \"meh\". All the food here is consistently delicious and oddly enough I find that the vegetable dishes are often even better tasting than the meat dishes. Stephaine's menu has a unique ability to bring out the most delicious flavors in a vegetable.<br>-  Green Beans: A signature dish. I know what you're thinking- 'ew green beans' but trust me these are delicious. Fried onions and cashews on top give this dish an added crunch for texture.<br>- Beef Slap Noodles: DROOL. Thick and juicy noodles surrounded by a short rib ragu.<br>- Xiao Long Bao: Classic Chinese soup dumplings with a goat filling. Make sure to eat these using your spoon and let them cool off a bit so you don't burn your tongue on the trapped steam! Add some of the vinegar to the soup dumpling for a nice bit of acidity to mellow out the rich goat flavors.<br>- Scallion Pancakes: This is always a guilty pleasure of mine whenever I go to an Asian restaurant. The difference with these is they are served with a side of cabbage coleslaw.<br>- Char Siu Bao - These are the big fluffy buns with a sweet pork filling. The order comes with 2 bunch which can easily be cut into fourths if you want everyone to just get a taste.<br>- Jiaozi - So I will admit this isn't my favorite thing on the menu as the short rib filling is extremely soft due to the presence of bone marrow (it's just a texture thing for me!). Everyone at the table loved these because of how rich the filling was. <br>- Duck Fried Rice - I think what makes this dish for me is the seasoned egg that comes on top which you get to break up into the rice. <br>- Mushrooms - This was one of the specials offered for the day which was a sauteed trio of mushrooms. I don't think I've ever eaten mushrooms this flavorful! Definitely a must try.<br><br>In terms of drinks definitely try one of their boozy milk teas. Extremely delicious and dangerous (you can barely taste the alcohol and they pack a punch!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-Q3_8QRZRFHWYrh_crLs4g/348s.jpg", "caption": "Boba"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/X0Iyucjmlt4XwqQKEDH1Uw/168s.jpg", "caption": "Sichuan Pork Boiled Dumplings"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cz-1Xc3lsxZYHkMUFtjSAA/168s.jpg", "caption": "Jiazo"}]}}, {"review": {"des": "Was super excited to try this place after loving Little Goat Diner and hearing they were related. My friend and I made reservations for 6pm on a Thursday and still had to wait a good 15 minutes before being seated. <br><br>We ordered the bone marrow gyoza, some little soup dumplings, duck fried rice, and beef slap noodles. I thought all of the dishes were cooked very well - egg perfectly poached and texture definitely there, especially with the gyoza. However, the food didn't taste very authentic and not as flavorful as the same dishes you'd find in Chinatown. (I was visiting Chicago from out of town, not sure if there's a Chinatown here actually).<br><br>Anyways, I loved the drink that I got - Jade Gate. Would highly recommend that.", "pics": null}}, {"review": {"des": "Had dinner with a few friends on a Tuesday night - the restaurant was crowded but we were seated promptly for our reservation at a nice table by the windows. Our server KC was incredible! Friendly, gave great recommendations without being pushy, and even brought out a champagne toast on the house as we were celebrating. Such a nice touch of service! Favorite dishes include the green beans, sechuan chicken, and Dan-Dan noodles. Can't wait to come back!", "pics": null}}, {"review": {"des": "What an amazing dining experience! I want to say that the hostess (I seriously wish I knew her name!) made our entire experience! From the moment we sat down, we didn't have to make a single decision and was surprised by entree after entree of the most delicious Asian food! <br><br>What stood out the most was the duck rice, soup dumplings, scallion pancakes, bone marrow dumplings, and the octopus salad. We also enjoyed a spicy drink that was made especially for us and the custard ice cream that we got in the end was purely amazing.<br><br>I can't wait to visit again!", "pics": null}}, {"review": {"des": "I loved everything we had including the potstickers, the soup dumplings, the pickled cucumbers and the goat slap noodles. I love what she's doing with the menus and the flavors. The only dish we didn't love was the eggplant with the goat sausage. There wasn't enough sausage and there were too many bean sprouts. The  flavors were still good though. The waiter was a good dude. He comped ya the eggplant dish since he hyped it and we didn't really enjoy it. There's so much more on the menu to try next time. The Baobing window around the corner is a nice touch too. The Rainbow Mountain was great. Shaved iced and soft serve.", "pics": null}}, {"review": {"des": "Purposely inauthentic Chinese food. Good, but not great. <br><br>Dishes are all Chinese-American takeaway staples--think fried rice, beef and broccoli, noodles, etc. <br><br>Weirdly, the green beans in black bean sauce is a stand-out side. We all enjoyed our entrees, but loved the green beans. Order those or whatever permutation is on the menu that day.<br><br>Cocktails have a fun, tiki vibe, with appropriate prices for the West Loop. <br><br>Steamed barbecue pork buns were also good--pillowy and salty and tangy--but I have had better at a lower price point. <br><br>Still, this place is worth it for the ambiance and service alone--think richly decorated, upscale and 1920's. Walls are covered in sumptuous fabrics and patterns with bright blasts of maroon and teal. The whole place exudes indulgence. Just be sure to book a table. It fills up fast.", "pics": null}}, {"review": {"des": "So I would consider this the most upscale and good quality Chinese-ish food you can have! Girl and the Goat is one of my favorite restaurants, so I knew I had to try this while in Chicago. I was able to make a reservation about a month in advance and they were attentive in confirming the reservation and asking for food allergies ahead of time.<br><br>Walking in, the decor certainly looks like early 1900s, Chinese inspired. Lots of red and oriental shapes. At the table the duck duck goat logo on the chopstick wrapper struck my eye, so cute and you will see this logo in some of their merch as well.<br><br>The menu feels nostalgic but inspired at the same time and for a party of 6, we were able to sample a bunch of awesome dishes:<br><br>- Egg drop soup: this is probably the most ingredients I have ever seen in an egg drop soup, which was welcome. The egg doesn't look as broken up flowery as the traditional one, but taste wise, it was great<br>- Ham sui gok: the goat dumpings. This was a pretty gamey dumping and it was an awesome surprise with the punch in flavor from the meat compared to the traditional ground pork<br>- Xiao long bao: again with the twist of goat, which made the broth within even more flavorful. Beware, the skin is thin, so unfortunately there were some breakage at our table<br>- Green beans: This is a favorite at any Chinese restaurant for me, but somehow Duck Duck Goat was able to elevate this dish where it doesn't taste quite as greasy, but still maintains some of the traditional and wonderful black bean sauce flavor<br>- Duck fried rice: So fun to break the duck egg over the rice! I will say that the consistency of the fried rice could have had a bit more of a bite, it was a bit one note in texture<br>- Beef slap noodles: I love the thick noodles that look hand pulled and short ribs over it was saucy and delicious<br>- Branzino special: This is a take of sorts on the ginger and scallions steamed fish. but with mushrooms, which made it earthy. The meat was moist and it was awesome to put that over the fried rice<br>- Jian dui donut holes: generally I am a sucker for jian dui and reading the menu where it said \"sesame whip\" I was even more excited, but really it was just little donut hole sized jian dui (sesame balls) that didn't have a filling, and really good whipped cream, but it was not sesame flavored. I was slightly disappointed in being mislead on this one<br>- Mango coconut cloud: The fruit and the cloud in this dish were a great combo and a nice acidic but sweet finish to our meal. I was most excited about the dragon fruit in this dish.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ctxyDIOVIkq0e7sVB8TYdA/348s.jpg", "caption": "Egg drop soup"}]}}, {"review": {"des": "Walking into this trendy restaurant is a fun experience!  Come here for a date or when entertaining some out of towner friends.  The decor is antique Chinese throw back to the 1800-1900s ambiance.  Think, \"old school movies\" from a 1920s Shanghai-type scene.<br><br>The environment is a little loud with music and conversation abound.  It's dark too but despite the large space, they have managed to still keep each table feeling fairly cozy and intimate...except in the open seating around the bar.<br><br>The menu is interesting taking its cues from classic Chinese dishes from all regions and giving it a modern, urban interpretation at times.  If you read Chinese, please ignore some of their translations / names of their dishes.  Some just don't make sense or do not describe the actual food as one would expect.  But don't be disappointed.  The food is still actually quite good.  Their interpretation is faithful enough to its Chinese roots while still giving a fresh and solid taste to the dishes.", "pics": null}}, {"review": {"des": "Was looking forward to this meal, but was disappointed.  We went on a Sunday at 5:15 pm, using an OpenTable reservation.  The service was bad.  We were starving, so the beef wonton soup was delicious.  We also got the pickled cucumbers and octopus/cucumber/peanut salad, which were both very good, but also very similar.  The seafood fried rice was nothing special.  And the Sichuan chicken was ok.  We did get the mango coconut cloud dessert, which was very good!  Cute decor.  Menus are look like an old, used chinese restaurant menu.  Oh, we did get the green beans, which were good!  We were visiting for the wknd and our other meals, included Sepia, Parachute, and Mott Street.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PivEHOG117ypzH4oieIaug/168s.jpg", "caption": "Mango coconut cloud dessert"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2ZziyLmmrdxDxpvSaSOmKw/168s.jpg", "caption": "Octopus, cucumber, peanut salad"}]}}, {"review": {"des": "Pretty good chinese restaurant that looks like a real fine dining chinese restaurant from Shanghai or Hong Kong from the 1920s-30's. Quite refined, so don't expect the regular chinese food, nor the prices, which are, quite high. As with many restaurants of this class some portions can be rather small - for the price that is. Went there with 2 other friends. Ordered 2 appetizers, the bone marrow potstickers - Jiazo, very, very good and the Xiao Long Bao, steamed baos but filled with a soup, think little bags of soup. A 1st for me, but very tasty. We also ordered as an appetizer the Dan Dan noodles. Think noodles with a peanut flavored bolognese. Rich and flavorful. The appetizers were over $11 dollars each with $15 for the noodles. For main dish we shared a Peking Duck, that at $59 looked expensive, but it ended up being a deboned, nicely presented bird and a fairly large. Flavor was on point. Not greasy as this dish regularly is with a very crispy skin. <br><br>Service was really good with very knowledgefull waiters who really knew the menus and could explain them really well<br><br>This place is an interesting dining option that is pretty singular, at least it was for me. Be ready for an over $100 dollar bill. Our meal was around $165 with tip. My only issue is that I think you can find relatively similar food in chinatown for more than half. If you can foot the bill try it. Chinatown will not be as nice for sure.", "pics": null}}, {"review": {"des": "Fulton Market District has been renovated and there are tons of newer options to try out. We decided to stop into Duck Duck Goat to grab some appetizers. If this was Monopoly, Stephanie Izard would be kicking all of our butts. Her other two restaurants, Girl and the Goat and Little Goat Diner, are within walking distance. Duck Duck Goat has just as tasty fare as the rest of them. <br><br>So the focus here is dim sum. I gotta say, though, this is pretty fancy dim sum. Also, the prices don't scream dim sum to me, either. The portions are decent and help soften the wallet blow, though. We sat in the bar area and ordered a few beers, the potstickers, and the pork buns. The pork buns came out huge and pillowy. The dough was tasty and the filling was pretty perfect, too. The potstickers were also delicious and had a bit of sauce already drizzled on them for extra flavor. <br><br>The bar was pretty busy, but you can sit and stare at all of the decor in the restaurant while you wait. It does feel like you are stepping into a Chinese village marketplace or something to get some quick bites. <br><br>The only thing is that the bartenders were moving a bit too quickly that night and I ended up having water poured into my beer. It would have been nice to have it replaced with no questions asked instead of asking me to let him know if it was ruined. It was still quite full. However, my beer took one for the team and I let it slide. Service was still friendly, nonetheless. <br><br>So yeah, Duck Duck Goat is pretty swanky for dim sum. The food is tasty. Prices are higher than your normal dim sum restaurant, but I still think it's worth it to check this place out at least once.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/A9vIInO7wjtqaBx_-uEolw/168s.jpg", "caption": "Potstickers"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BiPXn3ApbstLjgCIaOqyow/168s.jpg", "caption": "Pork buns"}]}}, {"review": {"des": "Last but not least! After having dined at girl & the goat and little goat diner, we finally got the chance to see what duck duck goat was all about. The ambiance here is definitely more upscale and trendy compared to a traditional Chinese restaurant.<br><br>As for the food, the way to do it here is family style. We started off with one of the dim sum items, jiaozi, which was the beef short rib and bone marrow pot stickers. Seemed to be one of the more popular item here but it actually ended up being our least favorite. The texture of it was very mushy so we were a bit worried what was next to come. However, the other three dishes that we ordered: octopus, cucumber, peanut salad, beef slap noodles, and the duck fried rice were all pretty good. I highly recommend ordering the octopus salad. It's very light, refreshing, and the flavors were well-balanced. The waiter originally suggested two dim sum items, a noodle or fried rice, and one of the larger main dishes but what we ordered was more than enough between the two of us and had left overs to take home.<br><br>All in all, Stephanie Izard didn't disappoint!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/re7qw9wviKn2tM1Wh5pmLA/348s.jpg", "caption": "Duck fried rice"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/h32_uvLp-fqcpkw8eOeq7g/168s.jpg", "caption": "Beef slap noodles"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aiLapF9OBNylYaobPQfcAQ/168s.jpg", "caption": "Octopus, cucumber, and peanut salad"}]}}, {"review": {"des": "I was so impressed by this place from the decor to the service, the whole experience was perfect.  I ate here with a couple friends the other night and immediately after stepping foot into the restaurant was so amazed by the ambiance, I almost forgot I was in Chicago.<br><br>For appetizers we got the Jiazo (beef short rib and bone marrow potstickers) and scallion pancakes both which were mouth watering.  We also got the green beans in black bean sauce which was a little on the salty side - the only thing on the menu I could've gone without that night.  <br><br>Otherwise everything else was 5 star worthy... for our main entrees we ordered the Duck Fried Rice that featured a soft boiled egg which blended perfectly into the rice... then we had the Hongshao Rou (the pork belly) which was cooked ever so perfectly it was so tender as you cut into it and melted right in your mouth. <br><br>For dessert we got the almond tofu and miso sundae.  The sundae was this tasty array of tapioca and sweet bean while the \"tofu\" had an ever so light taste of vanilla and almond which wasn't too sweet.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gQ0tD91lPPRXK3kq3ozEzA/348s.jpg", "caption": "Miso sundae"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/H8qOkkvAvV-_DCIPJXFwBg/168s.jpg", "caption": "Jiazo"}]}}, {"review": {"des": "Awesome experience! Servers are incredibly helpful and make sure to know of everyone's dietary restrictions to better guide their dining choices.<br><br>We had made reservations ahead of time, which could be a helpful decision in busier nights. All items are family style and are meant for sharing, we were a group of 6 with 9 dishes to share and we had leftovers remaining. <br><br>I would definitely recommend this place to eat!", "pics": null}}, {"review": {"des": "I've always loved Chinese food, but I often have trouble finding Chinese restaurants that I like. Duck Duck Goat did not disappoint, and I can see myself coming back here to try more items from their menu in the future.  The vintage wallpaper, unique light fixtures, and calming color scheme creates a memorable atmosphere.  This restaurant has a respectable amount of wines, beers, and cocktails to start your meal with.  I ordered the smoking ginger cocktail (Bourbon,  Whiskey, Ginger, Honey, Lemon, Egg White, 5 Spice and Angostura Bitters), and I loved how unique it tasted compared to other cocktails I've had with similar ingredients. <br><br>The appetizers and main entree's are meant for sharing, and this place would be a great place to check out with a large group of people.  My friend and I shared an order of the bao's, and those were pretty good.  I ordered the seafood fried rice, and I really liked this dish as well.  I sampled the beef slap noodles that my friend ordered, and I kind of liked this dish more than the dish that I ordered.  Every food item I tasted was well seasoned, but not overly heavy on salt.  The prices seemed to be in line with the high quality of the ingredients used in the food dishes.  Most of the main entree's were between $15-$20, so this place has prices that wont break the bank too much.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yY0sJdQQCJcwWDdV2ZVAhg/348s.jpg", "caption": "Smoking ginger"}]}}, {"review": {"des": "I didn't expect this place to have authentic authentic Chinese food, but the food was pleasantly good and better than I could have imagine. I give props to the chef. <br><br>When you first walk in, you see this blend of western and Chinese decor. I would not expect to see this in any traditional Chinese restaurant. Modern yet they were able to emphasize the importance of the color red and green in their culture.<br><br>This restaurant had the absolute best char siu bao (steamed bbq pork bun) I've had in my life. The dough was extremely light with just the right touch of sweetness to it. I also loved the duck fried rice. The egg on top was a nice touch. With the xiao long bao, the dumplings could have been less flat when we got them. They appeared to be deflated, and they really didn't taste very special compared to other places I've tried. The beef slap noodles were perfect in texture, but had an overpowering lemon after taste to it. <br><br>I thought the most clever part of the meal was the fortune cookie. Instead of the traditional fortune cookie, we got a round cookie and a pin that had a fortune on it. Genius. I still have my pin.", "pics": null}}, {"review": {"des": "I am visiting Chicago for a conference, and one my friends suggested us to eat for dinner last night. I was a little concerned because the menu did  not seem vegetarian friendly, but I was wrong! They have an exclusive vegetarian menu, and by was everything delicious. <br>We started of with their summer special which was zuchinni and squash which tasted like kimchi!<br>Even though I was on the only vegetarian in my party, everyone ordered vegetarian food so we were able to try multiple entrees. We started off with the scallion cakes which were very good and not very oily which I loved. We also ordered the glass noodles which was delicious with the right amount of spice. The green beans in black bean sauce was so good. I was so excited about this dish because not many chinese restaurants have black bean sauce which I love. They added crispy peanuts and wonton paper on top which gave it the perfect crunch. The mapo doufu was very good and not salty like other restaurants because they add mushrooms to absorb the salt. The only thing  i wish that it came with rice (you have to order it separately). <br>This was there perfect amount to share amongst the three of us. <br>I was thoroughly impressed, and so glad that I was able to come here!", "pics": null}}, {"review": {"des": "This place is so pretty, makes you feel like you are in Shanghai. Great for a romantic date. <br>The food is classic Chinese with a twist, great portions very easy to share. They have delicious cocktails as well. Overall very positive experience.", "pics": null}}, {"review": {"des": "I love the decor of this restaurant. It is traditional yet cozy! The menu seems traditional of a Chinese restaurant as well.<br><br>To start I had a vodka drink which has charcoal in it. It came out black but it was very refreshing and tasty.<br><br>For dinner I had the beef slap noodles, if you are not adventurous this is perfect for you! It's a simple yet delicious dish which consists of a shredded beef sauce and long thick noodles. It was very filling for one but all dishes are meant to be shared family style.<br><br>I also had the bbq bao, I was so full from my noodles I couldn't enjoy it as much but the breading was very soft and the meat was tender. Overall good flavor.<br><br>The portions are big. If you are sharing dishes, I would just order one dish per person to share.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HhyWo2Qti_qBrJjAKzF1DA/348s.jpg", "caption": "Vodka drink"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/apLN8WPCaL1yZHf7zilTnA/168s.jpg", "caption": "BBQ bao"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jlKEK2J9g8JG3VH0fsvs3g/168s.jpg", "caption": "Beef slap noodles"}]}}, {"review": {"des": "I am by no means an adventurous eater! I'm quite picky... however, on my recent visit here I tried the duck and goat spring rolls (crispy, meaty, and the dipping sauces are good) and the beef and bone marrow dumplings, both quite good. We also enjoyed the scallion pancakes, veggie fried rice (a little too greasy), and the chili fried chicken. I very much enjoyed my dinner here. <br><br>My favorite part of the meal was they drink called Jade Gate! It is a tequila based drink with flavors of green tea, apple, and pistachio. Delicious, please try it! I think I'll definitely be back next time I'm in Chicago!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RK_CBqPGH0za8NWuqhSJFQ/348s.jpg", "caption": "Jade Gate"}]}}, {"review": {"des": "Love love love this place! All of the dumplings are fantastic! The bone marrow ones are super but also super rich and creamy. Nice balance to some shrimp ones! Also - all the positive reviews on the duck fried rice are not wrong!", "pics": null}}, {"review": {"des": "Duck Duck Goat is part of Boka Group, which is home to arguably the best EVER collection of foodie spots in all of Chicago. Stephanie Izard can do no wrong.<br><br>We came here on a Tuesday night for dinner and were immediately taken with the vintage Shanghai atmosphere. The ambience is almost transformative, though it only takes looking at the crowd to remember you're still in Chicago. It's a big date night and post-work spot for those in the Loop.<br><br>Our server was super sweet; when we asked which of the two rosé options were drier, like we preferred it, to our surprise, she suggested that we order neither, and advised us to order a bottle from the glass-only options. This hidden third option ended up being the cheaper and honestly, most delicious. She kept the bottle chilled away from the table and was very mindful of ensuring our glasses were always full during the course of dinner.<br><br>We started with Char Siu Bao (steamed barbecue pork buns) which were plump, airy and brimming with delicious filling. They were a little dry and could benefit from some type of dipping sauce, but still a very yummy dish. We next tried the Scallion Pancakes off our server's recommendation, which were crisp and delicious. We also tried a side of the green beans in black bean sauce, which was one of the chef's specialties. There's a decent sense of umami there, with the crispy onions, garlic and beans, but it came off a little overly salty and oily.<br><br>We also split the duck fried rice which was rich and gorgeous and silky and oooooh, mama, so good. I love a runny yolk and the duck egg was sublime. And finally, the Hongshao Rou (2 pieces of fatty, tasty, red braised pork belly) was a show stopper. Melts in your mouth like a piece of savory cotton candy. Generally, we found the dishes to be the stars of the experience and the dim sum to be a little lackluster. Is it worth going back? Maybe; I knew I had to try it at least once, but we came out thinking we'd have just as satisfying a meal at our local takeout place for a fraction of the price. That being said, the service is excellent, the atmosphere one of a kind, and it's absolutely worth trying at least once.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PHH5kjrb6MgEZn7-kMtd_Q/348s.jpg", "caption": "Hongshao Rou"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/E0Zk43PFkIaFRxjTEmBfzw/168s.jpg", "caption": "Duck Fried Rice"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NNrGi962MniXxVt3vBX_qg/168s.jpg", "caption": "Scallion Pancakes"}]}}, {"review": {"des": "After trying Duck Duck Goat, I'm a believer that anything by Chef Izzard is a guaranteed great dining experience. My friends and I ordered some dishes to share: the Xiao long bao was a favorite of the table and I burnt my lip because I was too impatient to let the dumplings cool down, the pecan chicken dish was my least favorite and I left this mostly untouched which was fine by my friend who ate it up, the beef slab noodles were ordered by accident but they ended up being amazing, and the duck fried rice was packed full of flavor. I really liked the cookies that came out with the check in lieu of fortune cookies. I thought the dishes were great, but I've def had better versions of all these dishes elsewhere.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gYsUp6sJfvhJd4qQinQebw/348s.jpg", "caption": "Almond cookies"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JLGnA0JJznX7nA6k9K0Fuw/168s.jpg", "caption": "Duck Fried Rice"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/giik5OVtM-dTQ5FPVrvsOA/168s.jpg", "caption": "Pecan Chicken"}]}}, {"review": {"des": "If you're on the fence about going to this place based on the mixed reviews do yourself a favor and go somewhere else. This is the most ridiculous place to ever try and call itself fine dining. In short, reservations mean nothing here and the food is barely edible. Not worth the money, not even worth going for the experience.<br><br>We called over two hours in advance to reserve a table for two at 10:00pm on a Saturday night which was their earliest availability. We came in around 9 to see if they had any earlier tables or at least let them know we were in the area so we could be checked in. We went up the street to the arcade to wait for the reservation and went back at 9:45. At that point the hostess was telling us the people where we were supposed to be sat were done eating but were just sitting there. At that time another party of two walked in saying they had a reservation. They waited a while as well but chose to leave out of the place. Then another party of two came in with or without a reservation. Somehow both of these two parties were sat before us by another hostess that was clearly in contact with our hostess even though we were there and checked in first for 10:00pm. Keep in mind there is no way these people had a 9:30 or 9:45 reservation because when we called at 8:00 the only opening was for 10:00 and had the others had an earlier slot they would have arrived prior to 9:45 which they had not. I'm pretty sure reservations work by what tables are available not by, oh I want you to sit here so no matter what other tables we have open you have to sit at this one spot. So we were sat at a tabletop to keep us from waiting any longer which is right at the bar and I'm pretty sure it is bar seating until they put the reserved sign on it. If we wanted to sit at the tabletop we would have sat there when we came in at 9. So now we waited all this time for nothing. To add insult to injury the hostess then tries to sit someone at our tabletop as if it was not our reservation at this point. Furthermore, I saw several open tables where we could have been seated at.<br><br>The wait staff here is really nice, that's about the only positive thing I can say about this place. We ordered the beef and bone marrow wontons, chicken rice noodles, and duck fried rice. Everything was really overpriced for the portion and just overall quality of the food. Nothing was particularly hot, I would not be surprised if it was microwave food. It probably would have been better if we had gotten frozen Chinese from target, that's how bad and funky the food tasted. Nothing spectacular about any of the dishes, all of them had the same grease and smoke taste except some were sweet and some were salty. There was barely any duck in the fried rice and I'm not sure what kind of \"salted\" the egg was but there was no flavor to it besides grease and water. While I was eating the rice there was this huge chunk of some kind of minty seed in the food that was so hard and big that it hurt my mouth and I had to spit the entire bite of food out. That ruined any hope left for the dish. The only remotely interesting thing was that the rice noodles in the chicken had an good texture. The only worthwhile things we ordered were the drinks which came out of a can. While we were waiting for the waiter to come and pack our food and get the check the bartender took eaten food left at the bar and put it on our table as if she could not pick the plate up, wipe the counter, and put it back down. What part of fine dining is that?<br><br>If you just want to try a new place I suggest eating somewhere else and only come here for a small plate and drinks. Do not come here expecting anything fine dining besides the prices. This is honestly the most ghetto restaurant I have ever been to, you would be better off going to a chain.", "pics": null}}, {"review": {"des": "I love this place! This is the second time I've come here for brunch/dim sum with two friends.  Stephanie Izard was  here working in the kitchen this visit!  The cocktails are always delicious. I had the win some you dim sum- it was delicious.  Gin and grapefruit is a pairing I love.  My friends got the hibiscus drink which was also very good.  We ordered 5 dishes among the three of us, and it was the perfect amount.  We left very content - if we ordered a couple more, we would have been stuffed.  We had the glutinous rice dumplings with goat. They were so good!  Very hot, so be careful!  The green beans were very good! Similar to Girl and the Goat green beans.  We also ordered the soft shell crab special, that was very good In a garlic bean sauce.  The goat slap noodles were amazing.  They're a little spicy with a lot of cumin.  I love cumin, so it was great, but if you don't, this isn't for you.  We also had the scallion pancake which I had the last time, too.  It's quite delicious if I do say so myself.  The food and service here are always amazing.  There are few restaurants I go back to, because there are always so many new ones to try!  This one is definitely one I go back too :)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QcVSV1ZbFLuIc4-jkYvQAw/348s.jpg", "caption": "Chiu chow fun gor - shrimp and peanut dumplings."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4XZBNsQhwo_qQy5UmxHeGg/168s.jpg", "caption": "Short rib slap noodles.  Very good.  Love the chewy noodles."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HexGbg3G6Zt_U8OuuNlHEg/168s.jpg", "caption": "Jiazo- short rib and bond marrow pot stickers.  Delicious, very flavorful.  Highly recommend."}]}}, {"review": {"des": "Delish!  Omgoodness we came here for Mother's Day and left feeling fuller than most days because this place can serve up some scrumptious carbs!   First, I fell in love with the decor as it is different in every room - call it Chinatown vintage...?  Such a fun atmosphere, I immediately thought fun dim sum night with friends.  We had a lovely server who was attentive and friendly and all staff we encountered here were equally as sweet.<br><br>We ordered up 7 plates to share and left with plenty for two plus leftover meals.  They recommend 2 plates per person and there were three of us.  <br><br>Here's what we ate (this was off a dim sum brunch menu - so, limited)<br><br>Beef Wonton Soup - GET IT (the most delicate yet rich short rib/marrow stuffed wontons in a tasty beef broth with lots of ginger, little greens, plenty of chili oil added a kick and MAJOR flavor) served in a crock for 3-4<br><br>Xi'an Crispy Potatoes - think smashed baby potatoes, then crisped up - crazy tasty and drizzled in an aioli - enough for 4-5 ppl<br><br>Pig Face Buns - savory pig face (this is literally pig meat from the cheeks, don't be scared cause it's everythang!) in a flaky yet sturdy pocket (aka bun) the sauce is horseradish'y  - 3 pc.<br><br>Duck Fried Rice with soft boiled duck egg on top - whoa.  The richest, most delicious jasmine rice flavored perfectly with duck meat strewn throughout plus veggies and all that duck fat nom nom. 3 ppl easy<br><br>Scallion Pancakes - the pancake is like condensed layered filo dough with scallions which is amazing by itself, however, the slaw they serve with it can be mixed in with any other fork full of food on our plates and it was FOURTH OF JULY IN MY MOUTH so good.  omg. 2-3 ppl<br><br>Taiwanese Fried Chicken - good and tender dark meat, but honestly we could have skipped it.  I would have preferred a protein not fried on top of all the other dough we consumed - it was just too much for us at this point in the meal.  3-4 ppl big bowl full<br><br>String Beans w cashews - These were charred with what felt like crispy onions and cashews and they were yummy and added some greens where we needed them<br><br>I'd go back with a group.<br><br>Oh Drinks!  I had the Ping Pong which was a vodka libation with tumeric, carrot and something else plus tapioca balls - it was awesome (10.00)<br><br>Tab was 140.00 with three alcoholic dranks", "pics": null}}, {"review": {"des": "This place takes a modern and more fancy spin on the traditional Chinese take out. The decor of the place is awesome- looks like somewhere straight out of 1950s china very cool and coordinated for an integrated experience.<br><br>They warn you that the food is not authentic chinese and it definitely isn't but it is still quite good. The portions are smaller than would expect from a Chinese place or little goat diner but is more close in size to girl and the goat.<br>Octopus cucumber peanut salad: 5/5 best thing I've tried there. Very light and refreshing with well balanced flavors <br>Seafood fried rice: 3/5 was not that special <br>String beans: 5/5 super good string beans. I have had string beans in a lot of restaurants and while this one isn't authentic it is delicious topped with shallots to give it a great crunch! <br>Pecan chicken: 4/5 chicken and pecan was glazed thinly with a good crunch but was a little too sweet for my taste<br><br>Drink:<br>Jade gate 4/5<br>Lucky duck 4.5/5<br><br>They give you an almond cookie at the end of the meal which is nice. Would like to come back to this place and the dining experience is great but but the price is a little high for the portions and quality.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gkuIRvD_DDs0xsQKIEY2FQ/348s.jpg", "caption": "Jade gate and lucky duck"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EQTEItwN_Y_LfELjiVpIwA/168s.jpg", "caption": "Pecan chicken- nice and sweet"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bf51iDh8ZVU1eUTVSy79gw/168s.jpg", "caption": "Taco salad 10/10 would recommend !!"}]}}, {"review": {"des": "Was there for a coworker gathering lunch. The food was good but there some dishes I felt it's too spicy or oily. I love their dumpling and pancake. The interior design of the restaurant is very unique. There are pictures and art piece hung on the ceiling or evening place on the edge. There outdoor seating.", "pics": null}}, {"review": {"des": "I'm not a huge Chinese fan so I didn't even eat much but the VIBES in here are INCREDIBLE so unique I've never seen such a thriving and vibrant restaurant atmosphere. Definitely seems like a big foodie spot. The music was fun, and the restaurant was decorated in such a cool way. I had so much fun just being in there", "pics": null}}, {"review": {"des": "Such a fan of Stephanie Izard restaurants! Duck Duck Goat was literally the best Chinese I have ever had! Literally! I'm not so much a fan of goat but they way they prepare it here you couldn't even tell! Deff come early or make reservations cause this place gets full quick! <br><br>PS: If Aaron Sanchez is chowing down here then you know you're eating something good! He was such a pleasure to chat with!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/46GhAUdGqz4UFOzWw6YsIw/348s.jpg", "caption": "Deep fried duck tongue with shishito peppers."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CSlbWs6cHtgTaH8fM7Ocfg/168s.jpg", "caption": "Slap noodles!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/drC4VZlTXBiiQXhy2UztwQ/168s.jpg", "caption": "Duck fried rice with braised egg."}]}}, {"review": {"des": "Finally a restaurant of the goat franchise that didn't disappoint me.  The ambience is romantic with nice decor. The food is pretty good and the service is excellent. <br><br>You should definitely get reservation because the place was packed when we went. My friend and I got the beef soup, the pecan chicken, and beef noodles. We also got some of their emperor pu'erh tea. <br><br>The beef soup was TERRIBLE. Seriously, I get that the broth is supposed to bed salty, but ours was inedible. There's was 0 flavor and just tasted like they'd poured a bottle of soy sauce over some beef and veggies and dumplings and called it a day. Skip this one at all costs. <br><br>The chicken was delicious! It was crispy and coated in a delicious sauce. The pecans were a nice addition. <br><br>My personal favorite dish was the beef noodles. The sauce was so good and the beef was nice and tender. <br><br>The portions sizes are deceptively small. My friend and I got 3 dishes but we were full after eating the chicken and the beef noodles (we couldn't finish the disgusting soup). <br><br>The tea was also super delicious.<br><br>Btw, the take next to us got the whole duck which looked incredible, but wasn't practical for my friend and i to get because there was only 2 of us. I wish they would make a smaller portion available for small parties. Will have to go back and try that with a larger group.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/n4mcY7LoZfVoH-lPxgLhwA/168s.jpg", "caption": "Beef soup. Avoid at all costs. Just tastes like a bottle of soy sauce."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eM-GAWjLYECymzZb49kM5A/168s.jpg", "caption": "Chicken with pecan and beef noodles"}]}}, {"review": {"des": "Best Peking Duck I have ever had! Went there for my birthday dinner and was not disappointed, in fact I was downright impressed. <br>We ordered the shrimp toast, green beans,szechuan eggplant, shishito peppers, and Peking duck!<br>Everything was wonderful- the veggies perfect, the duck is the best Peking I have ever eaten!<br>I had the mango cloud for dessert- o.m.f.g. - is was totally the bomb!! <br>The service was good, unobtrusive, and casual , much like the place. <br>I totally recommend the experience- <br>Ambiance- Food-Service <br>One warning- It would be a crime to skip the mango cloud when dessert is offered.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/b9g52jQeZf6Y23H0UKFr-w/348s.jpg", "caption": "Green beans"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HBu0V0oY8W_OV-q0AUEoKA/168s.jpg", "caption": "Shrimp toast"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pCWAtc2NELvkvSgtiANLPg/168s.jpg", "caption": "Eggplant and goat sausage"}]}}, {"review": {"des": "This place is amazing. I went there for the second time and the food is outstanding and the flavors are amazing. This was my first time eating at the bar and the service was tremendous and sincere. At the end of my meal, the bartender brought us a whole other dish compliments of the house because there were extras! It put me over the edge with fullness, but every bite was well worth it. If you're looking for some unique dishes with amazing flavor, check it out", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WyZzDm872rf-N4lB55iMmA/348s.jpg", "caption": "Shrimp with wontons"}]}}, {"review": {"des": "Wait : 1 hour for Saturday night at bar<br>Environment : decor is legit, roomy <br>Service: friendly and helpful <br>Drink : cocktails are great, <br>Food : really delicious", "pics": null}}, {"review": {"des": "My girlfriend brought me here after she thoroughly enjoyed her meal last time she visited. Unfortunately, in an effort to branch out and order some different dishes, I ended up picking some options that weren't as good as we were hoping. Boys suck, don't they?<br><br>Anyway. We started off with the fermented veggies, which were just bad. They were really sour, and the vegetables they used were just so weird. Like pickled green beans and cauliflower? I was expecting a lighter, sweeter dish like the one at traditional Taiwanese/Chinese restaurants, but this was not it at all. The jiaozi, or beef short rib and bone marrow potstickers, were amazing. The outside wrapping was so crispy and the bone marrow helped make the filling so creamy and rich, and the soy sauce-like sauce was just the perfect dressing. The wood-fired char siu ribs were not my girlfriend's favorite, but I enjoyed them. There was a lot of bone, however, and not much meat. It's similar to the Wuxi ribs dish served at Chinese restaurants, but not as sweet. I enjoyed them, I just wish there wasn't such a huge hunk of bone!<br><br>We also ordered the veggie fried rice which was great. It was a bit oily and salty, but great nonetheless. The kicker, though, was the almonds!! Such an interesting texture with the chewy rice. Finally, we got the green beans in black bean sauce which was also excellent. This was probably the closest to a traditional dish, minus the crispy onion straws, which were actually a really good addition!<br><br>Overall, this place is NOT a Chinese restaurant. Unfortunately, I was unable to put aside my expectations for these dishes, so I was left longing for more. However, Duck Duck Goat has certainly managed to put its own twist on Chinese food and add a unique flavor. The food is excellent, and I'm willing to give it the benefit of the doubt and come back, with better options -- and letting my girlfriend order instead ;)", "pics": null}}]}