{"name": "duseks-board-and-beer-chicago-2", "reviews": [{"review": {"des": "Sometimes I chase Michelin stars.<br><br>Not having had any Michelin stars on the south side I zipped down to Dusek's down on Pilsen to check out the joint.  Seating for brunch was easy and not crowded, but it was a spacious venue with a deep beer and spirits menu including a well-curated selection of bourbons.<br><br>Checking the menu, I dived into half a dozen oysters served with a pickled juice and topped it off with some hot sauce.  Ordered a bacon Juicy Lucy to see how they'd handle this classic Midwestern dish and found an explosion of cheese in the middle along with a nice medium rare.  Fries were not that impressive, but did the trick.<br><br>The service was attentive and my water glass never went empty so overall it was a great meal.  Need to come back and try out the dinner menu!", "pics": null}}, {"review": {"des": "Dusek's has a Michelin star, so I went in with high expectations. Unfortunately, nothing about my experience here lived up to Michelin star quality. The food was just OK, maybe even below average, and the service was pretty poor even though I went outside of peak hours.<br>___<br><br>I came in to Dusek's at 6pm on a Friday. You might be thinking wait, wouldn't that be peak hours? I assumed it was going to be jam-packed, but it was maybe half full when we walked in. Based on how slow the restaurant was I am baffled at the service we received. After sitting down, it took a noticeable amount of time for our server to greet us. I don't need to be greeted right away, but I firmly believe that if enough time passes where you actively recognize you don't have a server, it's bad.<br><br>Once we got started with our server, we placed our beer order; the beer list is definitely good and I really appreciated that it described the flavor of the beer and had suggested pairings. The beer didn't make it to our table for probably 20 minutes though, during which we received a little amuse-bouche of cauliflower soup. The soup was meh. It tasted like clam chowder, without all the good parts of clam chowder. <br><br>Here's the food we ordered: <br><br>1 - Black Truffle and Foie Gras Fondue: The fondue was predictably rich and pretty good, but I did not taste much truffle. The bread was good but it was too awkward to eat... It was one of those little loafs where they cut it into slices but not all the way through, so you rip off each slice. The loaf was too small for this, and the bread had a ton of air holes in the interior, so you end up mainly using the crusty outside bits to sop up the fondue. We had to ask for a second loaf to finish all the dip. I guess the ingredients are what makes this a $16 dollar appetizer, but given there was no truffle flavor it was not worth that. <br><br>2 - Chicken Fried Rabbit. We were really excited about this one. Rabbit is one of my wife's favorite things, especially because you don't see it on menus often. The menu says it comes with a risotto, but what came to us was definitely not risotto. It was a dry rice pilaf. Risotto is supposed to spread out when you put it on a plate, and this little pile of rice was just that - a pile. Dry really was the theme of this dish, because the rabbit ate dry as well. If you take just one bite, it isn't too bad, but after 3 or 4 bites you need water.  It desperately needed a generous drizzle of sauce over it. For a $26 entree, this had a ton of issues. <br><br>3 - Curry braised lamb shank. This was a special on the night we went, which was $41 including the recommended beer pairing. The beer was good! The lamb was disappointing. Like my wife with the rabbit, braised meat shanks are one of my favorite things to order. It's extremely hard for me to pass up when I see it on a menu. When I read \"curry braised lamb shank\", I expect a punch of deep flavor. The lamb was tender but it just didn't have much other flavor, including salt. I had to really focus to taste the curry and there was nothing else happening with the flavor. This came with couscous and bruleed figs. The couscous was fine, and the figs were good on their own, but didn't seem to pair well with the rest of the dish. <br><br>Looking back, there was something off about every part of our meal. The amuse-bouche came long before our beer. The server was generally inattentive. None of the dishes delivered what you'd expect when reading the menu. My wife was hesitant to order a second beer based on how slow bar service was the first time around. We will probably not give this place another chance. There are 21 other Michelin star restaurants in Chicago, and there are cheaper pubs with better food.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fSAmDM4kxpnrPO0-ZUehMQ/348s.jpg", "caption": "Beer menu - it can change daily though"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/a6jXRKqkzrfpg51IT-8L8A/168s.jpg", "caption": "Beer menu - it can change daily though"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iodVqmnob6obCYzCkUFmfQ/168s.jpg", "caption": "Curry braised lamb shank. Very little flavor unfortunately"}]}}, {"review": {"des": "I had such a wonderful time at Dusek's. <br><br>The ambience is comforting, the drinks are fantastic (shout out to Frank for the scrumptious Old Fashioned), the serving staff so knowledgeable. They shared so much about our meal - everything from where the ingredients were sourced to the etymology of the Italian terms. <br><br>I was in heaven, y'all. <br><br>I ordered a vegetarian version of the Corn Orecchiette, the Shishito Hush Puppies, and the Strawberry Shortcake. <br><br>Pure perfection. :)", "pics": null}}, {"review": {"des": "5 words = Black truffle & foie gras fondue. It's all of the most decadent things you'd ever want to be in a bowl. Dip in some house-made bread, beef fat fries, or your cupped hands. What a great way to start the night at Dusek's.<br><br>Dusek's has a Michelin star, yet it's comfy and approachable inside and  is surrounded by other fun features (downstairs bar, Thalia Hall). It's the perfect warm vibe to come sink into your seat and feast. <br><br>In addition to their ridic' fondue, the hush puppies were incredible, and I'm not usually one to think hush puppies are incredible. The shishito peppers and buttermilk-lime aioli that came with these made them kookoo. The ricotta gnudi was so pillowy and comforting. I also munched on some fantastic scallops, oysters (East Coast ftw!), and desserts. Be sure to explore their drink menu too, for twists on classic cocktails and beer-inspired treats!", "pics": null}}, {"review": {"des": "While on a trip to Chicago I stopped in here as my airbnb was pretty close.  Am I glad I did...  Their food is very good (not sure it's Michelin star quality, but it is very good), the environment/space is well put together, and for me at that particular moment in time, their bourbon selection was amazing.  They had some very rare bourbon and was not charging an arm and a leg for 1-2oz pours.  Although I was only in Chicago for three days, I stopped in there at least once per day.  They have a music venue downstairs which I did not go into, but was surprised with some of the big names they were able to draw in for their schedule.  Worth stopping in.", "pics": null}}, {"review": {"des": "Food: The food in itself I would say is not that good. It is unique and seems to have a lot of German/polish influence. My dish which was the choucroute had way to much sauerkraut. However the meat was really good and the presentation was excellent. My friends juicy Lucy did not have cheese in it and he had to send it back. For me probably the dessert was the best part, as well as the drinks.<br><br>Atmosphere: Great homie atmosphere with dark lighting and open space. The staff are friendly but do not check up often with you. You might spend a good amount of time here just waiting for food and eating.<br><br>Price: for a Michelin star restaurant i would say the price of this place is amazing and can't be beat. I went for their 3 course menu with a fixed price of $29. You are able to get an appetizer, main dish, and dessert, and the portions are definitely enough to make you full. The price is the reason I am giving this place 4 stars rather than 3.<br><br>Overall: Definitely not the best food experience I had in Chicago, however the food was definitely worth it for its price and it was a good time. Come for the Tuesday night 3 course fixed price menu.", "pics": null}}, {"review": {"des": "Honest review: i love duseks but feel they need to up their game on service and desserts. I love duseks but i dont think i ever had good service here n i been here alot. Plz get better service. Desserts: i been here alot m only think the desserts were good once their not the best desserts. Menu changes often so its hard to recommend things but brunch here is my favorite like its my favorite place to eat breakfast in chicago. The juicy lucy is amazing/ the fondue is amazing/ the mussels are good too <br><br>banana pudding: (banana diplomat cream, honey-vanilla wafer, caramelized peanut, crème fraîche, smoked vanilla) $10 really unique banana pudding theres more complexity. Instead of just using plain whip cream they make it using creme fraiche which adds acidity to cut through the richness. There were salted nuts which is my favorite thing just put more because the salt really does make this disg great. The bananas and the carmel remind u of ur typical pudding really good dessert<br><br>bolo brigadeiro (chocolaate sponge cake, Brazilian fudge, candied coconut, cashew snap, tonka bean ice cream) $12 (its like a fancy german chocolate cake): what i liked is the chocolate wasnt bitter to many times when i reach chocolate on a menu im like crap its gonna be so bitter this wasnt the case. The cake was moist and was like a brownie cake then the tonka bean icecream was so unique and amazing. My only complaint is i wish they did something unique to the chocolate sauce like add pepper to make unique another issue  was the coconut wish something was done to it but still was a good dessert<br><br>tiramisu cruller (hamilton rum soaked vanilla orange cruller, whipped mascarpone cheese, espresso chicory gelato, caramel, passion fruit, hints of cocoa) $10 the donut texture was amazing was crunchy without being to dense and wasnt greasy. Its like a tiramisu but without being very heavy with chocolate this was my least favorite dessert", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7TajnHeyWQx1nJaD0U8LKQ/348s.jpg", "caption": "Bill"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fmXPhNWz_lpfxEuNEDnWYw/168s.jpg", "caption": "Bolo brigadeiro $12"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1lvwI4fC9zf_gSOgibWKoA/168s.jpg", "caption": "Banana pudding $10"}]}}, {"review": {"des": "I dunno.  This place seems to have a lot of good reviews, but I don't see why.  Kind of a neat atmospere and vibe, but the food was just okay.<br><br>We tried the Beignet, which, compared to a great beignet (a la Cafe Du Monde), this was a 3/5.<br><br>Tried the chicken and Waffles.  Meh.  I love Heaven on Seven Chicken and Waffles, and would give those a 5/5.  Dusek's gets a 3/5.  These were very rustic, with whole pieces of chicken ... bones and all.  Meh.<br><br>Also tried my first Michelada.  I can only describe it as a Bloody Mary made with beer rather than tequila.  Having never tried one before, I'll give them the benefit of the doubt and give it a 4/5.  Wasn't great, but that might be the drink itself.<br><br>Underwhelming at best.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/n6iQ168oZkjDyX-vonT7mA/348s.jpg", "caption": "Beignets"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vjYEaO8jPBwRe0DeKWwJUg/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yTyjIhm7KQhd5Igx-pE3NA/168s.jpg", "caption": "Michelada"}]}}, {"review": {"des": "Though far out in Pilsen, this restaurant was definitely worth the adventure. My boyfriend surprised me for a birthday dinner here, and I wasn't surprised that the restaurant had even received a michelin star rating. I loved the rustic gastropub decor and ambiance. The service was really slow for a slower Monday night though.<br><br>We started off with some draft beers, mussels, and bread. The mussels were deliciously cooked in a nice flavorful sauce. This was a huge dish to share for appetizer. For our entrees, we ordered the lamb sausage sandwich and the choucroute. The lamb sausage sandwich was nice and flavorful, and the choucroute was also delicious. I loved trying the different styles and preparations of the duck meat. The duck fell off the bone and was so tender. <br><br>Finally, we got a tiramisu for the complimentary birthday dessert- this was also very tasty and a nice topper to our already huge meal. Overall, we enjoyed our dinner experience here. I would highly recommend!", "pics": null}}, {"review": {"des": "What an awesome little dive in Pilsen. The beer options are endless and the food menu looked amazing, although we came on a Sunday afternoon smack dab in the middle of their \"kitchen break\". Bummer as it looked so unique!<br><br>Space is really cool and nice little patio. Would love to come back and try more beer and more food.<br>Hear they have concerts too!", "pics": null}}, {"review": {"des": "Service - Amazing, accommodating, courteous. <br><br>Roasted beets (bulgar wheat salad, horseradish cream, crispy onion, orange, pistachio) - Very few beets but pistachio was rich, crunchy, and excellent. <br><br>Truffle and foie gras fondue (gruyere mornay, baguette) - Cheesy, great appetizer to share. Fondue was very rich. Bread was crisp, warm, and light. <br><br>Iron roasted mussels (smoked pimenton, warm harissa butter) - Poached is definitely better than steamed. Smoky, light texture. <br><br>Juicy lucy (Slagel Farms beef, American cheese, red onion bacon, brioche bun, beef fat fries) - Super juicy, fatty, and fluffy texture.<br><br>Cocktails - <br><br>Singapore Schlinger (gin, cherry bheering, curacao, Jagermeister, lime, pineapple, bitters) - Did not like.<br><br>Brews n Bees (Ransom Old Tom, thyme and hop flower honey, lemon) - Much better, sweet but not sugary. <br><br>Pimms Cup (Banhez Mezcal, cucumber syrup, lime, ginger beer) - A more fresh and light Moscow mule. <br><br>Restrooms - Located outside of the restaurant. Women's bathroom has chalk that you can write all over the stalls and walls.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xRWXc6wHqTkioy6UeVmquQ/348s.jpg", "caption": "Juicy Lucy"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/It5r6rYDKt26a7ZNIwcdyQ/168s.jpg", "caption": "Poached mussels"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Dbww1dnaIop9JhiJOFUg5A/168s.jpg", "caption": "Truffle and foie gras fondue"}]}}, {"review": {"des": "Worth checking out, but probably not worth the price!<br><br>We came to this restaurant because it is Michelin Star rated and has good reviews.  Up front I'll say I don't really have anything negative to say.  The food was good and it has charm and good ambiance.  <br><br>When I go to restaurants, typically I don't have high expectations, so when it's good I'm really happy.  When a restaurant is Michelin rated with good reviews, I go in with high expectations.<br><br>The raspberry beignets were creative and tasty, and the sticky buns were good.  We got the chicken and waffle breakfast, and I wasn't impressed.  Not only was it $17 but I've had much better at other restaurants.  I wouldn't go out of my way to get their chicken waffles.  <br><br>The service wasn't bad, but there were a couple small things.", "pics": null}}, {"review": {"des": "We followed our 'a la card' promotion to Dusek's Board & Beer and are very glad that we did! <br><br>The big standouts for our dinner were the food, the extensive drink list, and the wonderful service!<br><br>We were looking for a quality beer and brew experience and we received just that at Dusek's! The 'Juicy Lucy' burger and beef fat fries were to-die-for! The cheese inside the burger burst out creating delightfully decadent deliciousness! And we walked away stuffed! Huzzah! However, the only reason I couldn't give Dusek's a 5 Star was for the prices. While I GREATLY appreciate select items being cheaper than others, I think the price overall was a bit high.<br><br>The next highlight was the extensive drink list! With so many specials and delicious regulars, it was hard to choose. But, in the end, I was very happy with my nitro ale! Yum! We can't wait to come back and explore other specials!<br><br>The third highlight was the excellent service. Our server was incredibly helpful and informative while also giving us space to enjoy our dinner! In fact, she was essential in helping me figure out which beer I wanted...and she definitely pointed me in the right direction! Thanks!<br><br>Dusek's was a great dining experience that we look forward to replicating in the future, on a different night, so that we can try one of their many fun specials!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZV3h3FOS0ezkzHjFFXj_1A/348s.jpg", "caption": "Juicy Lucy Burger with Beef Fat Fries 2"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/826h7rZrzN5Nh2F-qmTzEw/168s.jpg", "caption": "Juicy Lucy Burger with Beef Fat Fries 1"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pn0nUHhkAhv6r1egrB1qgg/168s.jpg", "caption": "Greene Abbot Ale (Nitro)"}]}}, {"review": {"des": "Sure, I've been downstairs for late night drinks but while in town, a couple weeks ago, I decided to check out the upstairs portion for brunch. So glad I tried it. Made a standard reservation for Sunday brunch. It wasn't super crowded but there were also enough patrons to reassure my choice. Got seated very quickly and immediately met a very kind and attentive server. So...gold star for service.<br><br>I got the Omelette that had sautéed spinach, roasted maitake mushrooms, gruyere, herbs and marinated beech mushrooms. You get the option of a mixed greens salad or breakfast potatoes as a pairing...I chose the salad. The whole plate was delicious...such a yummy medley. My friend sort of made a breakfast plate and ordered a Buttermilk Biscuit, the breakfast potatoes and bacon. She was most impressed with the size and flavor of the biscuit...just wasn't expecting it to be so large. The jam changes daily but I know she liked the flavor that day.<br><br>For drinks my friend tried the Brunch Punch and really liked it then we moved onto prosecco for the rest of our stay. Other than the prosecco being a little pricey, everything else was great. I'll be back on my next visit home!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZPFZYyPgJWQ6JqK-VDod7Q/348s.jpg", "caption": "Huge Buttermilk Biscuit"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BY6itExqYgUiYcn-_OCswQ/168s.jpg", "caption": "Toast that came with the omelette...couldn't tackle it all"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/T-XV7R71igIeqlWu2kdSqw/168s.jpg", "caption": "The Omelette"}]}}, {"review": {"des": "BEST GIN & TONIC EVER.<br><br>One of the best dinners I have had in awhile! We had the fondue, curry wurst, and salmon. Everything was great. The salmon entree was incredible. <br><br>The best part was the gin and tonic! A fellow patron at the table next door ordered the g&t and soon everyone in our section ordered the drink. It's made with a house brewed tonic which the server cracks open table side and pours over ice and cucumber. incredible. Easily the best gin & tonic I've ever had. <br><br>It was a lot of fun to eat at Duseks before a show at Thalia Hall. A perk is that after your meal you can just walk up the stairs instead of waiting in line (which was out the door). <br><br>The service was a little slow and the server didn't check in that much. It felt like the patio was being neglected. But the food was so good it gets 5 stars anyways!", "pics": null}}, {"review": {"des": "I love the spot.  The food is good and the drinks and the venues above and below are top notch.  However the hype on the food had me almost expecting more.  I'm going to switch it up next time (I'll definitely be back!)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kltfHu-CLxIlKuvgd8G5Ew/168s.jpg", "caption": "Werp greens"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wDMSNMxuJz6FpMgDDr0RKA/168s.jpg", "caption": "I forget the name of the special but the thick masa and the mole went perfect together"}]}}, {"review": {"des": "Came during restaurant week with a friend and one of us ordered restaurant week menu and then a few items on the regular menu to share. The RW menu is a great value! They did not downsize the portion, and at a much better price point<br><br>For the appetizer, we got the brown butter roasted salsify (from RW menu) and a truffle and foie gras fondue. The salsify dish is really good, probably the first time I had salsify that I had to look up what it is. The fondue plate is really good, with a very strong truffle taste.<br><br>For entrée, we got the confit duck leg (the RW menu) and a short rib. The duck leg is really good, tender and tasty. The short rib is also amazing.<br><br>The dessert is also very nice, really liked the pavlova. The wattle seed ice-cream that came on the side is also very creamy and tasty, and the passion fruit curd is very refreshing.<br><br>The ambiance is good and like the relative smaller serving size of each dish so you can try a variety.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xHw2UqHlSSoLik40dXqnGQ/348s.jpg", "caption": "Pavlova"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Qfvf7-NWeCJBWAxUzTgOAA/168s.jpg", "caption": "Short ribs"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HiE6dsNtO4irVin8cC27hg/168s.jpg", "caption": "Confirm duck leg"}]}}, {"review": {"des": "Really cute neighborhood gem! On a whim, we decided to dine here after reading some great reviews and we were very impressed! Laura was our waiter and she was good. <br>We arrived about 20 minutes before the end of happy hour so we were able to enjoy $1 oysters. Dusek's has a great menu, making it hard to choose what we wanted to eat. We so wanted the pretzel (next time), but instead we got the truffle fondue. For our main course, we had the honey chicken and choucroute...both absolutely amazing!!!! The rhubarb cheesecake was a mega hit. I can't even describe how pretty and delicious it was! <br>I will definitely be going back and I can't wait to try their brunch!", "pics": null}}, {"review": {"des": "We were in the area visiting family and they told us about this bar around the corner. We decided that we wanted to check it out and try some of their drinks.<br><br> It was a great idea!! The drinks here were small but tasty! And the presentation was wonderful. The price is decent in my opinion. A little pricey but worth it. They even offered us samples of their beers when we sat down. I cannot wait to visit this place again when I am nearby.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/C98swip0dSJV86Ygfxtucg/348s.jpg", "caption": "This was a drink listed that I can't remember. But it's a beer, a mini cocktail, and some candy."}]}}, {"review": {"des": "Unbeknownst to me, my closest friend and his family were in Chicago the same weekend as my family was, all the way from San Francisco, and he had a similar idea on a Sunday brunch with his family before he left for home. Alas, the plan did not turn out as he had expected and when I saw how mildly disappointed he was with the whole thing, I wished that I could have traded my pleasant weekend brunch  with him. I have many pleasant brunches, so I could stand to spare one, and what a lovely brunch place this would have been for him and his family!<br><br>My family and I lyfted here from the hotel which is also a Hyatt Place like my friend did with his family, albeit a different one.  It was large and airy, in an ethnically diverse neighborhood. The service was punctual and good. When the server forgot the French toast she apologized profusely  and then had the manager to comp the dish. My daughter was all very pleasant about it, she enjoyed the steak and eggs and my beef tartare. For a Michelin star, they certainly are not stingy about their portions. My appetizer beef tartare was huge. The side of scrambled eggs filled me up. The dutch babies, which is my friend's favorite dish if he had been here, was perfectly portioned and decadent as it ought to be. My 11 year old boy got an open face burger with a side of beef fat fries which he enjoyed more than he thought. We ate leisurely and without feeling rushed - the restaurant is perfect with many beers names written on the wall, I knew this would have been great if my friend were here as he's a big fan of local brewed beer. <br><br>The reservation was at 1 pm so I think the brunch crowd had died down but for us Californians this was a perfect time to dine. <br><br>For a Michelin, the bill was very normal. I had the whole thing planned out. I had wanted to get up early for a run, then go to my favorite Chicago museum AIC then brunch, but I was sick and the kids went to a different museum instead of AIC (they wouldn't go without me as I'd get jealous), and then we'd dine at this Michelin. Everything worked out despite my sickness. Everyone thanked me for this wonderful Sunday brunch arrangement, and said the meal was terrific and once again, I played a great host to my own family by showing them great eats in Chicago. I know it's neither here nor there, but I wish that I could somehow teleported to a different timeline and I'd planned the same outing for my friend and his family as his fair godmother would, for everyone deserves a beautiful Father's Day Brunch like this one.", "pics": null}}, {"review": {"des": "This past visit was probably the 3rd or 4th time going here. The 2nd time eating. I'm a fan and wish I was walking distance.<br><br>This is my second time going mid day and this time I opted for the Juicy Lucy, a beer, coffee and a sticky bun. They were all fantastic!<br><br>The space and the vibe during the day is also very dope. It was busy but didn't feel like I was sitting on the dude's lap next to me like you would at some other spots. Just a relaxed vibe to it all. Also caught myself just kinda checking the decor of the place out a couple times.<br><br>While the Pilsen neighborhood has always been dope, Dusek's was like a gateway of sorts for those who might have not gone here. There's so much to Pilsen it's legit one of my favorite neighborhoods to go to dine and have a good time. And Dusek's is partly a reason.", "pics": null}}, {"review": {"des": "The food: 4/5. I tried the crab salad, muscles and shishito tots, everything was very well executed but not amazing. The salad was probably my favorite thing. <br><br>The service: 4/5. First of all, if you're seeing a show at Thalia hall, you get a token that allows you to get in before the regular line, so you wouldn't have to wait as long. We had an issue with having to leave for the show and our dessert order taking almost 30 minutes to arrive, so we said we'll just leave. The waitress was very apologetic and told us to come back after the concert. We got the dessert and two glasses of bubbles on them. The service was overall prompt and friendly, but they seemed a little short staffed. <br><br>Overall: 4/5. I would go back to try other things on the menu.", "pics": null}}, {"review": {"des": "Its not so often I get to come to pilsen, so when a group of my friends wanted to do BRUNCH  I suggested this place. <br>     I liked the cocktails, the beer menu and the layout of Duseks. Unfortunately what fell short was the food (brunch). Everything seemed very mediocre. There was 5 of us, and between all of our dishes nothing really stood out, everything was very bland and ehhh.  We were disapointed in the food, especially since its a \"Michelin star\" spot. As far as brunch this place did not live up to the hype. <br>     I honestly feel  Duseks popularity comes from its location, and if it were located in downtown it would just be another gastro-pub-diner.  I will come back for dinner because I have heard way too many good things about this place, but for now there are alot of bettter options.", "pics": null}}, {"review": {"des": "Five of us came to this one-Michelin-star restaurant for dinner. They have an interesting selection of beers: my colleague ordered a 14% ABV dark beer and instantly got knocked out. The food itself was okay. The complementary soup was tiny and forgettable. The pretzel and cheese board that we shared were decent. My scallops were pretty tasty but nothing exceptional. As usual, the best part of the meal was at the end with my chocolate coconut cake.<br><br>I found the service to be impeccable (though sometimes slow), which I think compensates for the lack of a wow factor in food quality. The restaurant also has a nice and romantic atmosphere. Thus my overall rating is 4 stars.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VzMveYJVlugHgLoyrAR-tg/168s.jpg", "caption": "Scallops"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wLFGQdX6QrvpgogWP0DP8w/168s.jpg", "caption": "Warm pretzel"}]}}, {"review": {"des": "A fun and funky place in Pilsen. Dark and romantic vibe with almost a hipster feel with a giant beer list and unique menu. We both got the burger there as it was highly recommended to us, and it did not disappoint. Really great meat blend, high quality toppings, and delicious fries on the side. One fun part was that everyone got a shot of soup to warm us up on a cold day, compliments of the chef.<br><br>Definitely would recommend, especially if you are in the area.", "pics": null}}, {"review": {"des": "Such a pleasant surprise and beautiful space in the heart of Pilsen. You've probably heard that this is a one-star Michelin restaurant, and the hype is real. I came for a Saturday morning brunch at 10:00am and was seated right away. The restaurant began to fill up around 11:00, but there were still plenty of seats in the back room.<br><br>Dusek's is known for its craft beer menu, but the cocktails and beermosas sounded interesting. Our waitress was lovely and offered her recommendations. We started with coffee and the Board and Beer Bloody Mary ($8- delicious and the mix is made in-house!). I also ordered the Radler Beermosa ($8), but didn't jive with the Pilsner, grapefruit, hone, and mezcal. The bloody, though, is a must-have. <br><br>Couldn't decide between the Dutch Baby ($7) and Ricotta Beignets ($5) and got both pastries. The Dutch baby is divine. I will return just for that dish. You must start your brunch with it! The beignets (5 per order) were also warm and soft, served in a mini cast-iron skillet with blueberry jam and toasted almonds. Magnifique!<br><br>For entrees, we ordered the chicken and waffles ($16) and braised short rib hash ($18). The chicken and waffles came with a slab of herb butter and scoop of salty, yummy collared greens. The waffle was crispy around the edges, almost like a crunchy, syrupy pizza crust. It was excellent with the fried chicken. The collared greens has seeped into the waffle, and made for an interesting few bites. (If you order this, you might ask for the greens on the side.) The Short Rib Hash was light on the short rib, but had plenty of shishito peppers, roasted Brussels sprouts, and cippolini onion. The balance of short rib and veggies was off, but it was still tasty. The only disappointment was that the poached eggs were poached all the way through, rather than runny (see pic). Otherwise, this would have been a perfect brunch!<br><br>Dusek's has a cool vibe and can accommodate parties of all sizes. Come for brunch with your little ones or for a fancy dinner before a show at Thalia Hall. It's great!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EealIH1ZWEDP6EUBXa08XQ/348s.jpg", "caption": "Ricotta Beignets- $5"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NoieiERt7c2m6uwCw_olnA/168s.jpg", "caption": "Chicken and waffles- $16"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Hm6WVqDjsZS4fSKVHFx-4A/168s.jpg", "caption": "Board and BeerBloody ($8)- excellent!"}]}}, {"review": {"des": "I was working on my favorite hobby with my favorite* daughter--brunch!<br><br>Among many great traits, she is an expert scout on the brunch beat.  She had been to Dusek's before and thought I'd enjoy.  (Her personal challenge is that I'm hard to please).<br><br>Our visit met 'standards'.  Well, above standards actually.  Bloody Mary--nicely spiced.  I'm not a beer on the side sort, that was passed along to the scout.  We shared a Dutch baby--great idea, great execution, but from my standpoint--once is enough.<br><br>I had the omelet: sautéed spinach, roasted maitake mushrooms, gruyere, fines herbs, marinated beech mushrooms, and breakfast potatoes.  Even by description, a thoughtful dish.  Definitely a repeat.<br><br>The room is comfortable and stylish, fitting into the area perfectly.<br><br>After, the scout and I walked out, happy with our meal.  Walked through some falling snow to a nearby coffee stop and agreed on what we had--we liked the restaurant, definitely enjoyed--recommended.<br><br>*(I have one favorite daughter and one favorite son.  Fortunately, I have two kids).", "pics": null}}, {"review": {"des": "I chose to dine a Dusek's based on yelp and they 2017 Michelin Star. <br><br>I thought the food was interesting. I chose the prix fixed for the most opportunity. I ended up with pretzel, burger and fries and banana pudding. Not the best choice way too much food. <br><br>The pretzel was interesting <br><br>The beef fat fries were good but not great. Very salty<br><br>The burger was good but not the best I've had and again very salty. I couldn't finish. The server didn't seem to mind it ask why I didn't eat most of the food. <br><br>The desert was nice and a great taking on banana pudding. My only complaint was the vanilla was very difficult to eat and took away from the dish. <br><br>The service had traces of greatness but it was inconsistent and fell apart at the end. The desert came without flatware. I ended up having to take it from the table next to me. I ordered a black tea. A peppermint tea was brought out. <br><br>It was worth a try. I wouldn't come back. The is plenty of other food in Chicago I would rather spend my time and money on.", "pics": null}}, {"review": {"des": "To me, this is a special one star Michelin restaurant, which is more like a fabulous and historic pub/bar restaurant.  <br>High-end pub grub & specially beers  <br><br>I have to say that the price of  Dusek's is far cheaper comparing to other one star Michelin restaurant but with larger plate/amount. Since we are trying the restaurant week menu with entree Mussels, at first I thought I need to order something else to get full. Later turns out it is even harder for me to finish the large mussels entree. Also the sweet potato and shrimp soup with banana chips and yoghurt is really . It is my first time to try this combination soup and I love it. The desserts ricottabeignets with butterandjam is just so so. I won't recommend to order this for you!<br><br>The servers there are really kind and considerate. I really enjoyed the restaurant week lunch there. By the way, I think normal menu is not expensive as well. I will definitely check here again later! Love Love Love", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cA3OTbEKQkdfO7wjqV_kaA/168s.jpg", "caption": "Sweet potato soup"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MkYnMRb60w3S8uPkyGJaIg/168s.jpg", "caption": "A lot of mussels"}]}}, {"review": {"des": "My latest visit was for brunch. Boy was it a huge letdown. I ordered the chicken & waffles, the chicken was excellent, juicy with crispy skin. But the waffle! Man oh man, I've never seen a sadder, soggier waffle in my life. It was pretty much completely deflated and soft and rubbery. Can't imagine a Michelin one star restaurant can turn out something so abysmal. Very very disappointed.", "pics": null}}, {"review": {"des": "Beer-centric place in Pilsen for brunch! No wait on a Sunday which was what we needed since we were on a time crunch<br><br>The menu must change because the menu on Yelp was slightly different from our menu that day<br>---iron roasted mussels: tasty but really should share this as an appetizer with the table, odd that it doesn't come with a bread as a side<br>---waffle with chicken: the toppings to the waffle were like that of a Japanese omelet, kind of odd and on the sweeter side<br>---fries: the fries that came with the juicy juicy were delicious! Didn't get to try my friends burger though <br><br>Overall wouldn't make the trek here for brunch but maybe we didn't order the right dishes", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IDApdrPun5GyuCfb4545Dg/348s.jpg", "caption": "Mussels"}]}}, {"review": {"des": "3 stars may be too generous for the quality of the food I received.  My reservation was at 11:15 & my food didn't arrive until 12:20 & it wasn't even hot.... A long wait time & the food isn't hot? No bueno!!!! It might have tasted good if it was hot.....", "pics": null}}, {"review": {"des": "Introducing (at least to myself this past weekend) - larger PEI mussels.  Just as good as the ones they used to serve but larger and plumper. So plump I was stuffed! Could it have been the 7 beers? naw.....", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WCvl3PTnbRusCQyP_uglwQ/348s.jpg", "caption": "Yep - scrump·tious ˈskrəm(p)SHəs/ adjectiveinformal adjective: scrumptious     (of food) extremely appetizing or delicious.     synonyms..."}]}}, {"review": {"des": "Overall: Even in the heart of Pilsen amongst the plethora of Mexican cuisine, Dusek's stands out and gives you one of the best modern dining experiences in the area.<br><br>The good: When you walk in, you immediately notice the great atmosphere. Low lighting, antique-like decor, and a homey-industrial vibe. Service was friendly and helpful. With the prix fixe option, our group was able to try a lot of options. The juicy Lucy, hush puppies, and chocolate pecan tart were my favorites. The burger was perfectly cooked medium with the gooey cheese inside and the fries were amazingly crisp and flavorful. The hush puppies were light yet satisfying, and the desserts...let's just say they were awesome. For $29 we got a lot of food per person, I rolled out of there. Oh, and of course all the drink options!<br><br>The not-so-good: While the service was great overall, it dragged on towards the end and took awhile to wrap up. After we ordered dessert it seemed like 20 mins went by. The duck dish was off in some parts...the sauerkraut was too potent/vinegary, and the underlying sauce was overwhelming.<br><br>Atmosphere: 10/10<br>Service: 8.5/10<br>Food: 9/10", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5ptRFDODhk7j6i-S95Z9ag/348s.jpg", "caption": "Chocolate pecan tart"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eCrlokkVh-BJ_WplQbZt3A/168s.jpg", "caption": "Peaches and cream"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kjxf-Opl6enwu5XkPRD7cg/168s.jpg", "caption": "Dessert menu"}]}}, {"review": {"des": "Great place that is open late.<br>To preface, my boyfriend and I came here after spring awakening and made a reservation online at the venue. <br>We barely ate that day and were so hungry that we ordered the hush puppies (pretty standard -nothing really special), the black truffle foie gras (delicious and a large serving for two people), the steamed mussels (MUST ORDER BUT BEWARE - 1LB SERVING - which was way too much for two people haha) and lastly, the burger (decent but great fries). <br>Overall, the ambiance of this place is really romantic and great music selection. Our server was so kind and did a great job. <br>This place met my expectations and beyond.", "pics": null}}, {"review": {"des": "Great, friendly service. Excellent laid back atmosphere. Got the French toast and board and beer breakfast. The Miller high life pony is an additional $1. The breakfast is huge and is sure to please even the hungriest of people! It is served with jam and butter. <br>The French toast was incredible with crispy outer edges and a dense chewy center. Today's were topped with blueberries which I definitely recommend you get if you see it on the menu. <br>Will return.", "pics": null}}, {"review": {"des": "Wow. ..Dusek's has really stepped up their game! The reimagined dessert menu and new entree offerings are worth a special trip. I've seen mixed reviews for their brunch, but I'm willing to vouch for the new dinner menu. Use the pictures from my most recent experience as a guide. I wouldn't lead you astray. Lol.<br><br>Everything from the Duck Pâte to the Peaches and Cream dessert was phenomenal. The Choucroute is their signature dish. It's essentially duck prepared three ways. ..seared duck breast, duck sausage and a confit duck leg. If you're a fan of duck, you need to try this dish. Each preparation was perfectly executed. The beer pairings took the plates to a sublime level.<br><br>I'm reserving the elusive 5-star for future visits. I've had less than memorable dinners here in the past. I want to be sure Dusek's has finally turned the corner and consistently great. Judging from dinner, I'm confident they have. If you hadn't been recently, I strongly suggest giving them another chance.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CRKmiIK9NMfE5sgmdIK6Hg/348s.jpg", "caption": "Peaches & Cream - milk oolong poached peaches, peach elderflower agrodolce, oatmeal almond crisp, peach leaf ice cream"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Gz8iSvwp0BGMf6ZSJUQKAQ/168s.jpg", "caption": "Choucroute - seared duck breast, duck sausage, confit duck leg, 18-hour sauerkraut, caraway pickled apples, confit potatoes, duck jus"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yf3yhkKQgEL0b9_XczbBHw/168s.jpg", "caption": "Choucroute - seared duck breast, duck sausage, confit duck leg, 18-hour sauerkraut, caraway pickled apples, confit potatoes, duck jus"}]}}, {"review": {"des": "Went there on a Tuesday night and they had a good special. 3 course meal for only $30. It's a pretty good deal since one of the main courses can be $26 or around that cost. The service was awesome. They checked every once in a while. Parking: you can find free parking around the area but there is street parking. The dessert was great!!! \"The strawberry cheesecake\" was awesome!", "pics": null}}, {"review": {"des": "I came here with my partner before a show at Thalia Hall. With no reservation, we were able to be seated in about 10 mins. Our waitress greeted us and was very friendly and asked about food allergies. I told her I was vegan and she pointed to 2 salads on the menu that could be modified. Wanting something with more substance, we asked if she could check with the kitchen if there's anything they could do. She checked and the chef said the pasta could be made with olive oil, would be the same price as with meat because it's hand pressed, but they would give me extra pasta.<br><br>We ordered some beer and bread to start. They had one of my favorite beers and the bread was delicious. I was feeling optimistic that the pasta would also be delicious.<br><br>When it arrived it was a small portion, but by that time I was so stuffed on bread that it didn't bother me so much. I took a bite of the orcchiette and it was completely underdone. I tried another and it was al dente and perfect. Took another and it was overdone. The pasta was strangely inconsistent in texture. After focusing on the texture I noticed there was a weird funk to it, that tasted like butter and nothing like olive oil. I tried convincing myself that they wouldn't have done that but it really was off. Also, incredibly salty. The flavors continued to bother me and I stopped eating it after 5 bites.<br><br>Our waitress never returned to the table to ask how our food was. By the time she came back, our plates had already been bussed and we needed to leave for the show. We quickly paid and didn't have the chance to tell her about our experience.<br><br>After we left and throughout the evening I was not feeling well. Although I will never know for sure, I'm quite positive there was butter on my pasta.<br><br>With the lack of tasty accommodations for strict diets, I have no desire to give Dusek's a second chance.", "pics": null}}, {"review": {"des": "My boyfriend and I are back in Chicago and we've been wanting to try this place out since the last time we were in town. I bookmarked this place for quite some time for the popular Juicy Lucy burger and I'm so glad that we finally got a chance to come here today. We stopped in for a late lunch and were greeted by the nice bartender who seated us. Our waiter then came by to introduce himself and promptly took our food and drink order. Since I was in dire need of a caffeine boost, I ordered a cappuccino. By the way, their cappuccinos are fantastic! It was smooth and strong and it came with a cute little bottle of sugar cubes. My boyfriend and I both ordered the Juicy Lucy with fries. The food came out fast and piping hot. The Juicy Lucy was delicious with cheesy goodness and the fries were thick cut and crispy. The burgers were a bit on the messy side but we didn't care. Everything was made to our liking. In addition, our waiter was super friendly and always checked on us from time to time to refill my boyfriend's drink. <br><br>The food and service was incredible. Although this place is popular for their other brunch items, it is definitely more of a reason for us to come back and try the next time we're in town. We will be back for sure.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SH0owZ-g7-iE5RvqX6Zgpw/168s.jpg", "caption": "I loved the Cappuccino"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4ZTKtMo_5pUBVuYPVNIWcQ/168s.jpg", "caption": "The Juicy Lucy"}]}}, {"review": {"des": "I came here with a friend to catch up on life and we both thought the customer service, drinks and food were amazing. Thank you Dusek's Board & Beer for a phenomenal dining experience! I will definitely be back again and again....5 stars.<br><br>What we feasted on:<br><br>Drinks<br>The Craft Pop (blueberry, pineapple & rosemary) was delicious and I was really feeling the crazy purple color. 5 stars<br><br>Appetizers<br>Beef Fat Frites with Harissa Ketchup were crispy and  delicious. 4stars<br><br>Small Plates<br>Black Truffle & Foie Gras Fondue is a must try and I recommend dipping the frites in the fondue. 5 stars<br><br>Goat Cheese Raviolo was my least favorite dish, mainly because I'm not a corn fan, but it still gets a 3.5 stars<br><br>Entrees<br>Choucroute (duck) was so damn good and so filling! I would definitely get this again. 5 stars<br><br>Garlic Stuffed Crystal Valley Farms 1/2 Chicken was 15 steps beyond amazing. I was so thankful my friend let me try some of this dish because it literally made my lips, tongue and stomach extremely happy. Next time I dine here I'll be getting this dish for sure. 5 stars<br><br>Dessert<br>Peaches & Cream was very good and a decent size to share. 4 stars<br><br>Sweet Yogurt Sundae was so freaking good. That lemon curd knocked my socks off and I wasn't even wearing any. 5 stars", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-Dy2Zq9LPE2H0EwbAoOPoA/348s.jpg", "caption": "Black Truffle & Foie Gras Fondue"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LO4Ss8ilPUSdIaVtR752rA/168s.jpg", "caption": "Beef Fat Frites"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Nt6ftn2sUKLgRTC_k3Bgig/168s.jpg", "caption": "Goat Cheese Raviolo"}]}}, {"review": {"des": "Have only had limited exposure to their beer and food, but had a good experience here. They have a lot of nice weekly specials including the ever present 'Ordinary', which is different on their lunch and dinner menu. For Lunch it was $15 for an entree and house beer, which was a great price for a solid Thalia Pilsner and the best Juicy Lucy I've ever eaten(I know it's sacrilegious, but I thought it was better than the one's I've had in the twin cities). Add onto that a generally good beer selection, and friendly knowledgeable servers, means that it's easy to kill a few hours before or after a show here. Would really like to be back to explore more of their food, as they have different brunch, dinner, and late night menus, and especially on Tuesday to take advantage of their 3-course Prix Fixe.", "pics": null}}, {"review": {"des": "The food was pretty good, with really excellent service and decent ambiance. Be aware that it is a bar space so it's dim and on the louder side, but it's in a building connected with other things to do if you're looking for post-dinner activities on a weekend. The bread platter (with pimento cheddar spread and pickled veggies) was really good - bread was nicely toasted and that spread was just delicious. The cauliflower soup they gave as a sample was phenomenal as well. I'd say the duck three ways entree and the chicken fried rabbit - both spoken highly of - were underwhelming.", "pics": null}}, {"review": {"des": "Before I even get to the food ... the service was amazing! Our waitress was so nice and Professional. Our food was delayed and it too lil bit longer than usual ... they gave us free wine , champagne and salad. All they care is you experience. The food was really good , they put together flavors you can't even think will work. The only dish I didn't like much was the chicken rabbit. <br>It is very affordable place when you compere it to other Michelin star restaurants.", "pics": null}}, {"review": {"des": "First time in Pilsen and Dusek's.<br>I can't wait to come back and explore some more!<br><br>We were at Dusek's for a private party in basement. Super cute and cozy room. The wait staff was friendly and attentive. <br>Our menu was pre-selected for the event.  We chose steak with was perfection! The veggies and salad that accompanied the meat were delicious.<br>We ventured upstairs to a connecting piano bar. Super fun atmosphere.<br>Definitely dusek's!", "pics": null}}, {"review": {"des": "This is a nice place for a dinner, it's not the cheapest place but the environment is pretty ambient lit with candles. <br><br>Small plates: <br>Mussels- came with a pan of mussels served with butter. Good sizeable amount of mussels, more than we thought will come in, seems kind of over cooked though bc the mussels meat inside turned out to be very small but a good amount turned out well. Asked for a different dip maybe vinegar anything other than butter, waitress told us there were none. <br><br>Shishito hush puppies- love the shishito pepper, perfectly grilled and the hush puppies seems to be pretty dense but really good with the aioli <br><br>Entrees- <br>Truffle honey glazed chicken- great! Not dry at all, perfectly plated with green peas and potatoes <br><br>Choucroute- their specialty and also very good, the duck breast was very juicy and tender and perfect with the sauce", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4dnNxNU9n_T0gVN5iwQqHQ/348s.jpg", "caption": "Choucroute"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NwJA0CYqaQidkijz45w7wg/168s.jpg", "caption": "Glazed chicken"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ItRJzwdbtMawDvEPd4-NKg/168s.jpg", "caption": "Shishito peppers hush puppies"}]}}, {"review": {"des": "I came here with a large group of friends last night. Due to the size of the place, we had to split up into two groups. Not a problem. I was in the 7:30 group and there was a 8pm group. This becomes important later. <br><br>We are seated and order some drinks. The server goes away for nearly 20 minutes. We flag her down so that we can order the appetizers. We finally get the drinks at 8pm as the other table is now sitting down. We thought this was a bit long. <br><br>We decided to order a bunch of small plates and everybody got an entree. The reason why I gave this a 4 instead of lower was the food. <br><br>Pretzel: topped with Parmesan cheese, this was one of my favorites of the night. Nicely cooked and with some special mustard. <br><br>Hush Puppies: these were a hit at the table! Lots of puppies to share and the dipping sauce put this over the top! <br><br>Ham Board: this was another highlight. Three premium European hams. You can't go wrong with that! It was also huge! <br><br>Cheese Board: it was ok. By far the least favorite. The server didn't tell us the name, just where they were from. <br><br>For my entree, I got the Juicy Lucy. I was excited about this and it did not disappoint. Great taste, full of cheese, and came with a nice quality fries. I felt a little embarrassed getting a cheeseburger, but it seems to have been a good choice. <br><br>Others in my group got the short rib and the duck. The short rib looked good, but my friend told me it was a little dry. The duck seemed successful too, but they thought the sauerkraut was too overpowering.<br><br>What ruined the ending a little bit was that we found out from the 8pm crew that there was a food special that included a starter, entree, and dessert for $30. We were never told about this and spend nearly double. We skipped dessert, but we were full too. <br><br>In all, the food is excellent, but the service was pretty bad. I think they need more people in that restaurant working! Still, the food is worth a second trip.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/r78I75TKxa34FAP1t7rMVw/348s.jpg", "caption": "Dusek #10"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JhFFEHji2PCU_EnX9MY4Xw/168s.jpg", "caption": "Pretzel"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/F_38NYdCaE7MH840rRuMDg/168s.jpg", "caption": "Cheese Board"}]}}, {"review": {"des": "A solid 4 stars for Dusek's.<br><br>My husband and I had an enjoyable dinner here this past weekend. Per other reviews, the service was quite slow. Our two courses - appetizers and entree - took us about two and a half hours. It's fine if you have nothing planned for afterward, but I would not come here if you're on a schedule.<br><br>As for the food (the most important part) - we split the truffle and frois gras fondue as an appetizer. Great flavor! We did run out of bread when we were half-way through, and it took a while to get another mini baguette to finish it. I had the Juicy Lucy, and it is definitely an awesome burger! You can't beat a burger stuffed with cheese. The fries were incredible too! My husband got the corn orecchiette, and felt it was too salty. (I like salt, so I didn't find it salty.) A+ dessert and beer selection to top it off.<br><br>All-in-all, I would come back to Dusek's! I would like to try their brunch next.", "pics": null}}, {"review": {"des": "Delish!!!! Mussels were SO different and amazing! Hamburger was off the chain and be sure to start w the pretzel. Quality!!! Great staff and beer selection too", "pics": null}}, {"review": {"des": "Great atmosphere and decor. Frank the bartender was great! Friendly and walked me through the specialty beers as I am a novice. My wife loved place and we look forward to dining there shortly. Thank you for making the end of our date night a wonderful experience! <br>Would 100% recommend it. 5 stars !!", "pics": null}}, {"review": {"des": "Service was good but the food was vile. I was really looking forward to trying it. Literally lacked flavor and depth everything was just really salty our sour. <br><br>The country pate-is spam+giardinara. The salmon quinoa was vile, literally the grossest I've ever had. It was pretty but the mushrooms on it were old as hell. Salmon was all odor no taste. It arrived at the table smelly flavorless and white. The desert was like essentially overly-whipped cream but in 3 different shapes/colors.", "pics": null}}, {"review": {"des": "For a Michelin starred restaurant, I was a bit disappointed though everything was pretty good.  This is basically a bar serving elevated bar food.  It's dark and loud. There is, as expected, a great bar menu featuring cocktails, wine and a good selection of craft beers.<br><br>We started off with the hush puppies, filled with cheese and served with shishito peppers.  They were surprisingly light but I felt that there was something off in the the flavor.  The beef fat fries were good and the harissa ketchup was tasty.  We had the smoked mussels - they were juicy and tasty but very salty.<br><br>The beet salad was beautiful to behold, as pretty a presentation as I've seen, but a bit precious for a place like this.  Flavor-wise, it was properly earthy but but did not push the flavor envelope in any way.<br><br>The duck charcouterie plate was an impressive-looking selection of meat and stuff.  Duck 3-ways: smoked breast, confit leg and thigh, and house made sausage.  The sausage in particular was delicious.  The kraut was good but the confit apples and potatoes were very sour.  The dish on the whole was too sour for my taste.<br><br>The star of the evening was dessert.  We tried the tiramisu cruller - a churro-like fried donut steeped in rum and served with marscapone cream, espresso gelato, passionfruit jam and cocoa nibs.  Wow, that was interesting and delicious.<br><br>Service was great and our cocktails, wine and beer were tasty.<br><br>Overall, I expected a bit more from this place.", "pics": null}}, {"review": {"des": "This place is amazing from the cocktails to the food! They play a nice selection of hip hop and other genres and the ambient lighting sets it off ! My absolute favorite dish of all time is the Iron Skillet Mussels! Mmmmmm mmm mm! They also<br>Have $1 oysters on Monday evenings! Waka waka !", "pics": null}}, {"review": {"des": "I LOVE THIS PLACE. A little on the pricer side for Pilsen but overall great food and craft beer. Came in on Saturday night with my fiancé. (Side note) $20 for valet parking is RIDICULOUS! Especially when you have to wait 15+ min for your car. Any who. <br><br>Delicious apps- fondue is to die for! I ordered the Lamb special. Tender, juicy and very flavorful. The hub ordered the blue cheeseburger. All delish and great, attentive service. Will be returning!", "pics": null}}, {"review": {"des": "We came to Dusek's for last-minute brunch; Wildberry Pancakes had an 80min wait. We ordered:<br><br>* chicken & waffles<br>* ricotta beignets<br>* chef's special<br><br>Dusek's was a great brunch find; the chef's special tasted unique; the dishes were overall well-portioned and cleanly cooked. The soy latte was surprisingly tasty for a beer place, and the whole thing was reasonably priced ($$ is accurate).<br><br>Would definitely recommend for travelers / locals near Pilsner / South Loop!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Z4bDWFhSKSG5UgvwhqzpZw/348s.jpg", "caption": "chef's special"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wvyU-Qqk7yMU38afOAGyng/168s.jpg", "caption": "chicken & (savory) waffles!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/X-w2-YQoyfs5RXXaQ6XqzQ/168s.jpg", "caption": "ricotta beignet"}]}}, {"review": {"des": "Stage: grabbed a light bite to eat with an old friend on a Sunday night. <br><br>This place had a very intimate atmosphere, mainly due to the noise cancelling windows. As soon as you walk in you feel like you're transported to a different - quieter - part of the city. The food was great! I ordered the halibut & it tasted fresh and the side of cucumber pasta was the perfect accompaniment. Would definitely recommend if you are looking for a nice place for dinner with friends, especially if you will be trying to have a conversation. <br><br>Lastly, the portions are reasonable. Wouldn't recommend it if you're starving. At least based on the halibut I ordered.", "pics": null}}, {"review": {"des": "I used to go to Dusek's all the time in 2014-2015 before they got their Michelin star and I would have easily given it 5 stars at the time. The food was always just the right amount of inventive and unique without trying too hard and the service was super warm and chummy.<br><br>I recently moved back to the city and the couple times I've gone since the service has been hit or miss and some of the dishes have kinda jumped the shark. The pretzel for example used to be no frills served on a side plate with a cup of amazing mustard and it was perfect. Like the best pretzel you've had outside of Germany. Now it's served partially deconstructed on a piece of slate covered in like half a pound of shredded parmesan. Is it still super tasty and do I love parmesan? Yes of course. But now I feel kinda silly getting parmesan all over my fingers or, if I decide to use a fork and knife, all over the table as it tumbles off the pretzel and the piece of slate. It might sound petty but I miss the old Duseks where it felt like the focus was more on taste and service rather than presentation and reputation", "pics": null}}, {"review": {"des": "Dusek's was my first venture into a Michelin-star restaurant and it definitely won't be my last. Our waiter was attentive and quirky. The meal was great and Tt's definitely a must-try cost affordable Michelin-star place to eat at while visiting Chicago! <br><br>Beef fat fries (3/5 stars): lackluster. It tasted like any other fries<br><br>Black truffle & foie gras fondue (5/5 stars): my favorite dish of the night. Must try dish! We had leftover fondue and asked for extra bread because there was no way we were gonna let the fondue go to waste <br><br>Choucroute (4/5 stars): duck Breast and leg were tender. I wasn't too big of a fan of the sauerkraut but that's just me <br><br>Bolo Brigadeiro (5/5): a chocolate goodness. The Toni's bean ice cream was amazing and the chocolate sponge cake with fudge was warm, rich and moist", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qSbUymaPO24VmzU_m8rDUg/348s.jpg", "caption": "Bolo brigadeiro"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gh1JoAo_FFtr8alSQoE7mw/168s.jpg", "caption": "Choucroute"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TtCik_wEJjBz1LRcXrxr0g/168s.jpg", "caption": "Black truffle and foie gras fondue"}]}}, {"review": {"des": "Great ambiance, absolutely fantastic selections of beers - even the pickiest beer drinker will find something that will please them, no joke. And of course for those weirdos among us who don't enjoy delicious beers, there is a full fledge bar, too. <br><br>The customer service here is truly outstanding!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7qEHt8NRCY_1tRQyO2rlYQ/168s.jpg", "caption": "Amazing beer selection! If you like wheat beer, don't miss Feullien Grisette Blanche."}]}}, {"review": {"des": "We had been before for brunch but unexpected ended up here for dinner. We shared the fries and hush puppies (both mediocre), field salad (super weird tahini dressing), ricotta pillows (don't be fooled or talked into them, they are not good), burger, hanger steak, corn orchiette, and duck. The burger was good but not comparable to the other great burger options in Chicago. Corn orchiette was pretty flavorless and a let down. Duck was a huge portion but nothing special as was the hanger steak. Dessert we had the chocolate dessert (like a solid piece of fudge with weird accompaniments) and apple tres leches (this was the better of the 2 for sure). Much better offerings on 18th street and would recommend Haisous or SKY over Dusek's for the money. Not really sure how they got a Michelin star, makes me question how reliable of a measure that is.", "pics": null}}, {"review": {"des": "Brunch is nothing spectacular and the menu is pretty limited. Service is okay - for Sunday late brunch it wasn't busy but we kept having to flag our waitress. Decor is nice but the whole railing behind the booth was really dusty and that kind of set us off right away.<br><br>Drink:<br>-Board & Beer Bloody: the drink itself was good, could be stronger and the garnishes are pretty weak. I also saw some other people get a beer but I didn't, so maybe I didn't order the right bloody? There might be another one?<br><br>- Brunch Punch: super sweet and tasted like straight juice. Again, could definitely be stronger.<br><br>Food:<br>-Steak and Eggs: steak was cooked a perfect medium rare and over easy eggs were well cooked too. I really liked the small potatoes with the dish but there was only 4 or 5 of them. Overall this dish was good but for $19, I don't think it's worth the price because the portion is quite small even though other yelp pictures made it seem much larger. <br><br>-Mussels: cooked well, but beware because the rub is SUPER SALTY and there's no bread or side to eat it with. The extreme saltiness made it hard to eat. We asked our waitress for bread or fries or something. She came back with fries but those were also really salty, so was no help to our situation.<br><br>We left slightly disappointed with the meal in comparison to the price. Would maybe try dinner, but I don't recommend brunch.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/S5q0iH1un8EMZ313JWFmiQ/348s.jpg", "caption": "Steak and Eggs (eggs were on the side)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/adP-eLp6T6b6TZyJqPNuCA/168s.jpg", "caption": "Iron roasted Prince Edward Island mussels"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nDXg7APoPGVdNBfjTOhd7w/168s.jpg", "caption": "Board & Beer Bloody and Brunch Punch"}]}}, {"review": {"des": "I can see why this place has taken Michelin star. Great service and even better food! A must try! <br><br>This place is right by my house so I had to try it. When we first walked in, we were blown away by the decor. Its dimly light with lots of candles and books and antique knick knacks. Feels very sophisticated. The music selection is also excellent. <br><br>Our waitress was very good and accommodating. The service was smooth and professional. <br><br>The food is incredible. Its one of those places where you can tell they thought about the flavors. Each dish is so rich and scrumptious and packs a punch. <br><br>We started with the truffle and foie gras fondue with bread. AH-MAZING. I would have never thought to put foie gras in fondue but it elevated it and made it so rich with full umami flavor.<br>My fiancé is a picky eater and loved it as well. We also got the stuffed chicken with risotto. The chicken was stuffed with breadcrumbs and had an incredibly crispy and fatty skin. This was perfectly offset by the lemony and creamy risotto. <br><br>Our waitress said the juicy Lucy was a popular dish. Its essentially a burger with cheese in the middle with beef fat fries. This was also quiet delicious. <br><br>Overall, an amazing culinary experience!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vG_oEcLoDPPOXlnxNyxyQA/348s.jpg", "caption": "Stuffed chicken with asparagus and the juicy Lucy burger. Notice the crispy skin in the chicken. Delicious!"}]}}, {"review": {"des": "Solid 2.  <br><br>Came back after a while. some fine items, some meh. Services leaves a lot to be desired. We were a table of 7, with two of us still having food on our dishes and eating our meal...they started collecting dishes off the table (my pet peeve). Come on guys, what's the rush? kicking customers out after 45 minutes when there are still plenty of empty tables? (as I am writing this, i'm wondering if i should change my rating to a one!)<br><br>Everything well buttered up and heavy. Nothing memorable.<br><br>Less crowd than before. Certainly feels less popular than a few years ago.", "pics": null}}, {"review": {"des": "Great vibe, great food, great service, but bad hostess and seating process. Had reservations arrived 30 minutes early and happy to wait at the bar, but there were 3 tables opened when we arrived that sat empty, that became 4 tables, then became 5 tables and at no point did the hostess seat us. I had to wave her down after 30 minutes to ask her why we weren't being seated when there were so many empty unused tables. No one was waiting.This prompted her to seat us. Makes no sense and really pissed us off. Had that not happened it would've been blemish free.  Get a system and don't make HUNGRY people wait unnecessarily.<br><br>Great Bloody Mary's, great hash, yummy fried chicken, burger was very good with a nice char, and beignets were delicious! Bar tenders were very nice and wonderful.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lZnzmy63RBMJtXwTgzQz0Q/348s.jpg", "caption": "Punch"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ay4iihfOQ1BMyApjuIuePA/168s.jpg", "caption": "Hash"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mRdp52quy2mzjRRnoSLDwg/168s.jpg", "caption": "Ricotta beignets"}]}}, {"review": {"des": "Terrible meal, imagine licking a sidewalk, that's how oversalted it was.<br><br>This was the worst meal I've had in a long time. We started with Pilsen Board cocktail and that was very good. The meal went downhill from there.<br><br>We had the prix fixe and started with Hush Puppies and Pate. The hush puppies were good but the bread that comes with the Pate was quite hard, hard enough to cut my mouth. Next we had the fondue that was strangely bitter. It was not very appetising. <br><br>Finally we had the Choucroute and Fried Rabbit mains and they just piled on the kosher salt. Every bite was a salt bomb in your mouth. We scraped the salt off the duck in the Choucroute but could not do the same with the rabbit. The waitress offered to replace the Fried Rabbit. While the new one was less salty, it came out in a bath of hot sauce and was inedible all the same. <br><br>Overall, very disappointed with the meal.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jkC7QHPTlZjU0MYsaIEucg/348s.jpg", "caption": "Duck covered in kosher salt"}]}}, {"review": {"des": "Great ambiance and vibe in this place! I was looking forward to the burger and while solid, it didn't blow me me away. The juicy lucy was about a 6 out of 10 since it lacked a bit of salt and overall flavor. But the presentation, service, and price were great. I may need to sample some other items before making a sweeping judgement but will definitely need to come back and check out the place in the evening", "pics": null}}, {"review": {"des": "Took my girlfriend for dinner here on a Sunday night. Dusek's is definitely one of those new age restaurants in Pilsen, with lots of exposed brick and fancy light fixtures. The space is quite large so we had no trouble getting seated right away.<br><br>They have an exceptional beer list with a great combination of Chicago based craft beers and European brews. Foodwise I had read several accolades about their burger so my gf and I both opted for that. The cheese is melted inside the patty and deliciously spills out as you eat it. The onion-bacon marmalade also gives it that fresh, sauteed sort of taste. Hype well deserved, it's definitely one of the better burgers I've had in the city.<br><br>We also shared the chocolate, oatmeal and stout which is a plate of chocolates paired with stout flavored truffles and ice cream. It was a tad pricey but a unique and fun combination of flavors all beautifully presented together.<br><br>We thoroughly enjoyed Dusek's! The food and drink was excellent on top of it being just a really cool looking place. Don't forget to try a drink downstairs at the Punch House when you're finished!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aMRW9pxtvd3toObjYCe7jw/348s.jpg", "caption": "Chicken and waffles...mmm"}]}}, {"review": {"des": "We were here for Brunch on Saturday.  It is about 15 minutes by car away from downtown Chicago.  But it was very good.  Our table ordered the Sticky bun, Dutch Baby, and Beignets.  All three were delicious.  But the dutch baby we all thought was the best.  Such good grape flavor without being too sweet.  Then we ordered chicken and waffles and Board and Beer Breakfast.  SO much food.  The homemade sausage was the standout here.  Everything was done perfectly.  Of course we had cocktails as well and they were all very good.  The service was nice as well, timely, accurate and enthusiastic. We enjoyed the whole experience.", "pics": null}}, {"review": {"des": "Went here for dinner last night and had an amazing time!  Started with a cheese plate that pairs with the beer flight - the beers were truly well-selected and brought out unique aspects of each of the 3 cheeses.  We also got gifted a little amuse-bouche featuring marscapone and compressed (whatever that means) melon - so delicious!<br><br>Next, we had the roasted delicata squash and sprouts, which was one of the most beautiful presentations of veggies I have ever seen.  It was absolute perfection and so tasty.  Finally, we had the duck prepared 3 ways (braised, sausage, and a roasted breast.)  This was one of the better things I can recall eating in the past year.  We split everything and the waitress was amazing, serving us in little courses and not rushing us although they could easily fill up the tables with people eager to eat -- we made reservations  a few days in advance which seems necessary.<br><br>Afterward, we had a great evening at Punch House and Tack Room, which are attached to Dusek's.  Definitely a great place to check out!", "pics": null}}, {"review": {"des": "I had very high expectations for brunch at Duseks. I had been looking forward to this meal for some time. Unfortunately, the chicken and waffles were the worst I have ever eaten. Not only were the waffles soggy when they came out to the table, but the dishes flavors did not come together in harmony. The syrup was watery, the collards over salted and the chicken was skimpy. For this price point i was expecting quality. I also ordered a sticky bun that was so dry, we didnt even finish it. While I really enjoyed the Dutch baby and I have not been at this restaurant for dinner, this brunch left such a bad taste in my mouth that I have no desire to return and give it another shot.", "pics": null}}, {"review": {"des": "Amazing. Ordered the cider draft beer, very tart and raspberry flavored. The chicken was delicious with a sweet glaze to the top, and the chicken-rabbit had a great rissoto side, while the meat was simply wonderful. We got the pretzel and ham appetizer, as well as the cheesecake and chocolate cake. Unbelievably great quality! Great ambience, and very friendly and helpful people!", "pics": null}}, {"review": {"des": "Was a good evening catching up with a friend over drinks and beet salad . .., we sat by the bar bcos all seats were taken. A bit loud but didn't bother us. Enjoyed the house cocktails with cinnamon stick.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FLghN4JXzbArCzgIPiG-Vg/168s.jpg", "caption": "beetsalad with bulgar"}]}}, {"review": {"des": "Came here for the first time on a Friday night with two friends. The service was incredible and we absolutely loved our waitress, who gave us a detailed run down on the menu and used our personal tastes/preferences to give recommendations. The interior was really cozy and quaint. There is a bar downstairs and it is attached to Thalia Hall, making it a great place to start or end a night. <br><br>The menu is beer inspired, but we tried the seasonal cocktail \"the orchard\" and it was very tasty. We shared the cheese plate and the salsify, which were both great. The cheese plate came with three different cheese, a brown butter jam, and warm bread. The salsify was beautifully plated and very interesting, with multiple sauces that complimented the vegetable in different ways. My two friends shared the Choucroute (pictured), which was a large dish and they both enjoyed it. I had the sweet potato ravioli, and thought it was delicious- the addition of the mushrooms was a perfect compliment to the cinnamon-y, sweet ravioli and the curried pecans added texture to the dish. It comes with four raviolis. <br><br>We also shared two desserts- the tiramisu cruller and the chocolate sponge cake. Both were great, but the tiramisu cruller definitely won out. It is essentially tiramisu in donut form- a soft donut, mascarpone, espresso ice cream, chocolate, and more. <br><br>Would definitely come again!", "pics": null}}, {"review": {"des": "Cultural spot in Pilsen. Located at the historic Thalia hall building, the ambiance is simple but eclectic. The menu is diverse and the food is great!<br><br>The reason I gave it four stars is due to delay in service. Our friend had to wait for a long time for their meal which came cold.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/S0shuhB9GcERgFyduNE42g/168s.jpg", "caption": "Board and beer"}]}}, {"review": {"des": "The Juicy Lucy burger is so good and very worth the price! Thought the desserts I tried were just okay, but maybe I was full from the drinks and the burger. Service was very good considering how large my group was. I was pretty impressed that our water was always getting filled and they even gave us a mini free appetizer soup (potato soup with fish roe?) that was absolutely delicious.<br><br>Definitely get the Juicy Lucy burger though!", "pics": null}}, {"review": {"des": "This is my new neighborhood favorite! We decided on a whim to go to Dusek's on a Friday night after it was recommended by friends. What a great choice for a relaxed Friday evening with good food! We grabbed seats at the bar because we love dining at bar areas and ordered a few things to share. Everything was unique, well done with interesting flavors and combinations. <br><br>Sourdough epi pretzel - I love epi baguettes and was excited to have epi pretzels! These were warm, dense chewy goodness with a slight twist from the sourdough. It was also topped off with grated cheese and had a mustard dip. So yum with my glass of Riesling!<br><br>Mussels - huge platter with just a kick of spiciness. They were iron roasted so had a slightly smoky flavor to them. The sauce was awesome and we wished we had some bread to dip in it.<br><br>Juicy Lucy - so glad I read other yelp reviews and ordered this! Not a giant burger but in size but plenty big in flavor. Super juicy, cooked to medium perfection. Delicious with the tomato accompanying it. I think it rivals Au Cheval burger although my hubby thinks that's up for debate. And the fries ....I think amongst the best I've had in Chicago to date!<br><br>We literally wanted to try everything on the menu and intend to return to do so!", "pics": null}}, {"review": {"des": "I Came to Dusek's to celebrate a friend's birthday on a Saturday evening. We had a late dinner reservation at 9pm for a party of 6.<br><br>Everyone at the table got cocktails, and each one was fantastic! I had a cocktail with guava in it. I also had a craving for a Diet Coke which wasn't available, but they have RC Cola! <br><br>In terms of food, the table split 3 of the small plates and then everyone ordered an entrée to themselves. We all split the Black Truffle & Foie Gras Fondue, Caviar Three Ways, and the Venison Tartare. Omg the small plates were amazing! The portion sizes were enough for the 6 of us to all get a good try of each dish. I'd definitely recommend getting a small plate (or 3) if you come to Dusek's. For my entrée, I ordered the Juicy Lucy. It was really good, especially the red onion bacon marmalade that comes slathered on the challah bun. We all got different dishes so most of the entrée section was ordered. Everyone else enjoyed their entrée and all the plates were clean by the end of our meal. Our server brought out a dessert with a birthday candle to help us celebrate.<br><br>Service was pretty good. The bussers were great, and our server checked in on us periodically. She always made sure to ask if I wanted another refill on my RC Cola, which I appreciate since sometimes that gets overlooked when cocktails are on the table too. <br><br>Dusek's was a great time. We split the bill evenly, and each portion came out to around $60 per person. Not bad for a Michelin Star place.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/o-RnZR6aWF_7uZVOx4XC2w/168s.jpg", "caption": "Juicy Lucy with fries"}]}}, {"review": {"des": "Amazing place in Pilsen for brunch. Amazing bloody with insane, homemade pickled veggies. I got the juicy Lucy which was a-maz-ing, but the fries may have been even better.", "pics": null}}, {"review": {"des": "Love this place. Went for dinner a few weeks ago with a few friends and we shared everything. Delicious! Super fresh and different. Their bread is amazing, dont skip! Also tried their brunch, so good! The steak and eggs were super fancy and their juicy lucy burger/fries incredible! Highly recommend", "pics": null}}, {"review": {"des": "Dusek's was pretty life changing. <br><br>1) It made me appreciate beer. <br>2) It's a one-stop \"shop\" in Pilsen. <br><br>We ordered 4 entrees and two small dishes. I didn't find any of the dishes all that besides the black truffle and foie gras fondue with baguette. You can ask for more bread for free! The mussels were different. That charred outer layer was fun but i didn't dig it. I'm not usually a beer drinker, but they have 24 beers on draft, so i was inclined to try them. WOW am i glad I did. I was blown away. I sampled my friends' beers and they were all magnificent. You can really taste the  ingredients as they were distinct but blended together smoothly. <br><br>I ordered:<br>#11 the new Belgium love: felix - a sour sale with lychee, oak, and vinous. MY ABSOLUTE FAVORITE. I tried ordering a second, but they ran out. It was only 8:30pm. Proves it's a well-liked beer. What a clever idea of mixing lychee in there. <br>#8 Ayinger crau weisse - hefeweizen with clove, phenolic, the benchmark. I don't know what half of these ingredients are, but it was one helluva beer. <br><br>They were served in a craft glass which sets a classy tone. The place is really dim, which i sometimes find annoying, but I suppose that's hip these days. <br><br>Onto my second point. Dusek's is connected to 3 other places. That's why i call it a one-stop shop. You don't even need to step outside and get to check out 4 places. There's Thalia concert hall upstairs, which we didn't go to. We checked out Punch House - a lounge downstairs while waiting to be seated at Tack room. We had a bourbon punch bowl and enjoyed the hip hop, 90's music. Spent an hour there then headed to Tack. There was a live pianist playing and singing to modern, pop music. Craft cocktails were good but standard. <br><br>I rarely make it out to Pilsen, but have noticed more places like Dusek's popping up in the area in the past year. BTW, this is also a one-Michelin star establishment. I'm already craving their beers. Can't wait to go back and try more. <br><br>Warning: steep stairs heading to the bathroom. They got strong drinks, so becareful walking down, especially for ladies in heels and dresses.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5Y1deNq0ouCga75UdBOdQg/348s.jpg", "caption": "suckling pig"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/L16L2LKy-kS79AKwjMgPAg/168s.jpg", "caption": "#11 the new Belgium love: felix - a sour sale with lychee, oak, and vinous. MY ABSOLUTE FAVORITE."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/skyg7KeAi9FvKvaqjUiyHw/168s.jpg", "caption": "black truffle and foie gras fondue with baguette. Delicious!!"}]}}, {"review": {"des": "Met my son here for dinner. I saw quite a few reviews for three stars or less so I was skeptical. My son had been here before and said it was great. <br><br>Well he was right! It was a great evening. <br><br>I started with Pommes Chamonix. These are cheesy mashed potato balls deep fried and served with a spicy, garlic, aioli.  I really enjoyed them. My son said they were too cheesy for his taste. I loved it. <br><br>I also had a glass of their Grenache wine from Spain that was simply amazing. This alone made our night. <br><br>We split the Venison Tartare.  My son enjoyed it. I thought it was a little bland. I would pass on this next time. The only disappointing dish we had. <br><br>We then ordered the Choucroute, copying their menu: seared duck breast, duck sausage, confit duck leg, 18 hour sauerkraut, caraway pickled apples, confit potatoes, duck jus. It was soooo good. They nailed it. So juicy and flavorful. Duck can be overdone so easily and this was perfect. <br><br>We also had the \"THE ORDINARY\" which is a suckling pig house made sauerkraut, szechuan peppercorn-garlic sausage, rissole togarashi potatoes, tonkatsu broth. They don't bring the whole pig, rather the roast and loin. It was also amazing. <br><br>I'd sum it up:<br><br>5 stars for service. Everyone was super friendly, and really helpful. The waiter did a great job explaining everything. We never felt rushed and we really enjoyed the evening. <br><br>4.5 stars for their bourbon list. It is a good list with some great flavors. But they are missing some local (as in Chicago) brands.  Yes I'm picky :) but I would expect this place to have that. <br><br>4.5 stars on their wine list. It is a very limited wine list.  But damn - what they have is great.  I just wished they had flights and a bit more variety. <br><br>4 stars on food, due to hit and miss on the apps. But still very good. <br><br>I'd definitely come back.", "pics": null}}, {"review": {"des": "Probably my favorite gastropub in Chicago, terrific beer selection and awesome food , albeit a small menu.  Fries are the best you'll have cooked in beef fat, great beet salad, perfectly cooked burger and an amazing duck confit.  Really nifty old building in Pilsen and an eclectic music selection made this a great couples dinner", "pics": null}}, {"review": {"des": "And Dusek's is venue #1 for our gastropub restaurant crawl...it'll serve as first dinner. It's a quaint place. And it really does fill up quite fast. This had been on my list for a while and now I was getting to try it. We'd heard that the duck was a must try.<br><br>The foods: <br>Ginger Carrot Black Currant Coriander - amuse bouche<br>Roasted Salsify - execution was pretty good, the only thing that really threw it off was the sweetness in the sauce along the side (reminded me of birthday cake)<br>Sweet Potato Ravioli - you get four, I enjoyed this dish, mostly, there was cinnamon mixed in with the sweet potato (which is common, but personal preferance-wise, made the dish a bit too sweet for my taste)<br>Hamachi Crudo - I so wanted this to be so good. execution was not what I expected, the fish was sliced pretty think for a crudo and there was not enough citrus or salt (the olives were good, but didn't add to an overall even seasoning)<br>Diver Scallops - looked like they would be overcook, but they weren't exactly...maybe just over-seared, seasoned after the sea and you could see the salt flake on top of the scallops (some were too seasoned). the roasted cauliflower was a tad undercooked and not consistently roasted<br>Choucroute - duck three ways was amazing, must get dish of the night<br>Roasted Beet Salad - also, sooo good. great mixed of golden beets and red beets with delicious toppings (think deconstructed salad)<br>The \"Ordinary\" - Sausage Sandwich, pretty decent, a very, very mild sausage, brussel sprout slaw on top and a whole heap of fries (more than any one person should be finishing)<br><br>TLDR: It's worth checking out at least once. The must get dish is the choucroute aka duck done three ways (duck confit, roasted duck breasts (I think) and duck sausage)...and don't forget some of that mustard.", "pics": null}}, {"review": {"des": "We stopped for drinks. They have a great selection of beers on tap. They didn't have any tables and there was an hour wait so we got some drinks at the bar and sat in the waiting area by the door. I can't speak to the food, but what I saw coming up from the kitchen looked good.", "pics": null}}, {"review": {"des": "(Brunch review)<br>I had high expectations looking at past reviews but unfortunately I wasn't impressed.<br><br>For vegetarians options are limited and they ran out of pancakes at Brunch time.  It's not your typical Pilsen restaurant full of flavors..  We had smoked trout and omelette which didn't taste good at all.  Manager stopped by to apologize the chef who ran out pancakes and couldn't do potatoes without beef.   <br><br>Manager assured me there would be tons of veggies on my omelette but when I opened it was just artichokes inside (see img)....   <br><br>Not coming back!  And not to mention prices are pretty high for Pilsen!  $16 for a plate that's more like dinner than brunch!", "pics": null}}, {"review": {"des": "If I'm in Pilsen this is a great spot to grab a drink. I've never eaten here but food looks yummy. I got a chocolate churro Porter and a whiskey sour. Bar team is talented and good selection of craft beers on draft. They use the finest ingredients. Lemon juice, simple syrup. The drink looks and taste great. Neat building history as well.", "pics": null}}, {"review": {"des": "I came here with a big group of people for brunch - some of came ~30-45 min late, yet the staff was very friendly and accommodating<br>We got the mussels - they are AMAZING, they come with a slightly spicy sauce (harissa pepper) that was so good.<br>The oysters were also good (I honestly don't know how to tell good from bad oysters but I didn't get sick so they're good!).<br>Then we shared:<br>1) Short rib benedict - it was really good, slightly heavy, but flavorful, I just wish it has slightly less salt<br>2) lobster po' boy (came with beef fat fries) - this was soooo good, you could taste every ingredient in the sandwich and the mixture was just perfect<br>3)Chicken and waffles - Ok i was saving the best to last. This was my first time ever trying chicken & waffles, I was one of those people against this movement \"EW chicken and waffle with maple syrup?\" but I am converted now. But my standard for chicken & waffles is so up high now! <br>Ok now let's move on to drinks - BRUNCH PUNCH! It tastes soooo good that in no time you will go from completely sober to blacked out - drink with caution.<br>But seriously though, this place is a MUST TRY. <br>And then go downstairs to punch house and continue having an even greater day", "pics": null}}, {"review": {"des": "Solid food, good service and reasonable price. <br><br>Sourdough pretzel - fresh and chewy, love their caraway butter. <br><br>Iron roasted mussels - it is listed as a small plate but it is NOT! can be easily shared among 4-6 people. We were told it is cooked in a dry way without any sauce, but it turned out to be the most juicy mussels I ever had. Love it.<br><br>Lucy juicy - burger with fries. It has melted cheese inside the beef patty, when I cut the burger, it's like a surprise coming out. I really think it's more tasty this way. Beef fat fries is ok, didn't see any difference from other fries.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/--myAWlOGD1fBCi38qewsg/348s.jpg", "caption": "Pretzel"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VP5AR6xCH1RHjaM6Y62XSQ/168s.jpg", "caption": "Lucy juicy. It has melted cheese inside the beef patty."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NWB7qWNdjWDqIP2pImmpRQ/168s.jpg", "caption": "Complimentary salad"}]}}, {"review": {"des": "Visited Dusek's for dinner while staying in Pilsen, where it is apparently the go-to spot. We were able to be seated immediately without a reservation - after a short wait in the comfortable waiting area.<br><br>The interior of Dusek's is quite spacious and very beautiful, and we immediately felt that this would be a fantastic date spot or a a place to hang around for an extended amount of time. The drinks menu is quite expansive, especially the beer selection, but I felt that there would be little opportunity for ordering wrong.<br><br>We ordered the shishito hush-puppies, asparagus and crab salad, hamachi crudo, butcher's tenderloin, and the choucroute, all with the intention of sharing. I ordered a few different beers while my partner ordered from the lovely whiskey menu (a tip: their prices for Pappy Van Winkle and other rare whiskeys are very reasonable, if that is your thing).<br> <br>Our food arrived quickly and at a very appropriate pace. The hush-puppies were serviceable, but not particularly exciting. There were a few shishito peppers interspersed with what was otherwise a pretty simple dish. The crudo and the salad that arrived next were a step up, with the crudo in particular being very impressive. My partner was a little bit less enthused as it is very celery-forward, so bear that in mind. Still, a beautifully prepared and interesting dish. The asparagus and crab salad was very fresh and arrived in a generous portion. It was also fairly simple, but the quality was so good that it did not disappoint.<br><br>The choucroute (my entree choice) was wonderful. A generous plate with a variety of textures. The sauerkraut and duck sausage were the definite standouts. The tenderloin was unfortunately a major letdown. The plate had everything right - but the morels and carrots both arrived cold. Absolutely tragic as the flavour of both was fantastic, but cold tempura really does not stand up. <br><br>Dusek's is clearly a high-volume business, with several adjoining areas and a large number of staff attending to you. Unfortunately, this seemed to be negatively reflected in our experience. Not mentioned above is the fact that I received the wrong beer early in my order. Apparently the taps were changed as one keg ran out. The server was happy to resolve this and comped the beer. More crucially, the food that arrived cold seemed to suggest that food was being prepared in batches. From our table we saw large plates of food being brought out, set on a secondary bar and then divided to various tables. For the reputation, and the price, it wasn't quite what we would have hoped for.<br><br>Dusek's was overall quite enjoyable, and would be a great place to grab drinks. Unfortunately some of the hiccups in the food service mean I couldn't quite recommend it as a premier dinner option.", "pics": null}}, {"review": {"des": "We went to Dusek's for brunch on NYE. We had a reservation, but at 11 when we strolled through the front door, there were more open seats than occupied. I had high expectations because of their Michelin star and the rave Yelp reviews, and I have to admit I was VERY let down! <br><br>I ordered the Challah French Toast, which was good, but certainly not great. The edges of the bread were delicious because they had a nice crunch. The middle of the bread was filled with a ricotta mixture which made the entire thing mushy and feel undercooked. Even though the flavors were amazing, the texture turned me off. <br><br>My boyfriend ordered the Benedict, and again it was good, but not great. The pork belly was tasty, but there was nothing that took this to the next level or made it stand out from any other Benedict we've had. His potatoes were actually completely flavorless, and even worse, cold. The food came out quickly after we ordered it, so I'm really not sure why the potatoes would be cold; it's unacceptable. <br><br>We ordered the Bloody Mary to accompany our food, and we both could think of places where they serve much better Bloody Mary's. <br><br>For something I was looking very forward to, I'm kind of disappointed I chose this as our last brunch of 2016. It just wasn't something I would ever venture back to Pilsen for. <br><br>(Side Note: the table next to us also noted they were disappointed with the donut holes and chicken and waffles.)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2wYCQCApaadv18h2E9cyYw/348s.jpg", "caption": "Front entrance with lots of waiting space."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FDcBAlG6NITLgjwaHFDUwQ/168s.jpg", "caption": "Pork Belly Benedict."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ESml_RO-rDG9Z80QWTQwcQ/168s.jpg", "caption": "Challah French Toast."}]}}, {"review": {"des": "Great place. The food is incredible, great place for a date or dinner with friends.  Some dishes I have had are only just ok, but generally good to great.  Dollar oysters Monday is the tits.  Beer selection on point. Atmosphere is second to none.<br><br>Two stars because drink prices at the bar do not include tax. You are a bar. I have no interest in paying $7.81 for a 13 oz IPA.  Make drink prices include sales tax and you get four, maybe even five stars.  Cheers!", "pics": null}}, {"review": {"des": "Came here for a yearly get together with some friends, the server was extremely friendly and informed us that the mussels have been on the menu since day one and was her favorite thing on the menu. Definitely my favorite dish of the night. The mussels was a larger portion than I was expecting for the Midwest and it was delicious with the butter dip, pilmenton based rub and lemon. <br><br>For other small plates we got the Brown Butter Roasted Salsify, very pretty presentation and I think the vegetables were parsnips? The sauce was very delicious and just the right amount of a little bit sweet but also savory. We also got the Foie Gras Torchon, which I loved - the pineapple was sweet on top and helped balance the thick, heavy salty Foie Gras -  but no one else in my party seemed to like, stating it was \"too sweet\". We also got the Beef Fat Frites which were good and just salty enough ( I think their ketchup is also yummy). <br><br>As for larger plates we got the Red Wine Glazed Short Ribs, Diver Scallops and Choucroute. First the Choucroute I loved the idea, the duck sausage was very tender and flavorful, the duck breast was also tender and well cooked - in my opinion the dish overall was too overly salty though. The confit was a bit hard, and the sauerkraut and sauce on the side were overly salty even paired with the duck. The Diver Scallops were buttery and I enjoyed the brown butter cauliflower that came with it. They were tender and not rubbery and I enjoyed the crouton (? I'm just going to call it crouton) pieces that came with it. Finally the short ribs, not too special considering I unfortunately don't remember much about it besides that it was also really too salty for me. I think I remember the short ribs meat pulled apart really easily which I think was a plus, but I just remember it being unfortunately very salty. <br><br>For dessert we got both the baked apple and the tiramisu cruller. The baked apple was good considering it was cinnamon and apple - not a huge fan, but it was warm. I appreciated that both desserts were vegan as well (since I'm lactose intolerant), but I felt that the ice cream on the baked apple was a bit gritty (probably because it was oatmeal ice cream) but I felt the almond taste was a bit strong a bit bitter for the ice cream. I really enjoyed the tiramisu cruller, I'm a sucker for tiramisu, but the cruller was soft and airy while being crispy on the outside. And the espresso ice cream was the best coffee/espresso based ice cream I've ever had (and I'm an ex-barista!. It's just a bit bitter, but the coffee taste really shows through. I enjoyed myself and I would come back for brunch in the future.", "pics": null}}, {"review": {"des": "Great food-we got 3 shareable plates between two of us and it was more than enough food. Drinks- we had brews n bits and flor de ceniza and enjoyed both. Incredible service - staff very quick to help tables. Great vibe (dim candle lightening). All around great experience would recommend to all.", "pics": null}}, {"review": {"des": "Updating this review from 3 stars to 4 stars, JUST because I received an email less than 48  hours later after posting from the owner at Dusek's. Customer service is one of the fundamental pillars to a business, and they take the customer experience seriously here. We travel to Chicago about two to three times a year, and we are looking forward to coming back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/U2FVY68s60RGANSsOgQi4g/168s.jpg", "caption": "Juicy Lucy"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/otVJmVp8gxRMA-5EnpPzYQ/168s.jpg", "caption": "Pecan chocolate tart with blueberry ice cream"}]}}, {"review": {"des": "Super unique brunch place located in Pilsen. Their decoration is very unique and their beer and drink selection offers a variety. We started off with the beignets which were the perfect size and taste. My drink was delicious and my entree (Baked southern egg)was fresh and tasty. It was a poached egg over polenta! The service was nice and the waitress was super helpful!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/o8JZ84DcnKjBtRuoD-DGvw/348s.jpg", "caption": "Baked southern egg"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cUzYHYufHT77aUJyICQfJg/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CWETu8bWn9y_saYvY7ueUg/168s.jpg", "caption": "Lovely seats"}]}}, {"review": {"des": "Dusek's, and really any business in Thalia, delivers every time. Food is amazing. Drinks are some of the best in Chicago. The thing that stands out to me every time is how kind the staff are. Not sure where they find these good folks but their service is so personable, and on their game. I come here regularly, have for years, and recommend it to anyone that visits town.", "pics": null}}, {"review": {"des": "It was an odd experience. We called 20 minutes before we got there and the lady on the phone said there was no wait, we don't need to put our name down. We asked to put our name down just in case and she was like no, just walk right in. Well, we got there and we were third in line and kind of annoyed that she wouldn't allow us to put our name down when we had asked. they said a 10 minute wait, but I'd say it was more of 20-25. <br><br>Rule of thumb: always over-estimate the wait time, so customers are pleasantly surprised when they didn't have to wait as long. <br><br>On our way to walking to our seat, we get to the second dining room and this place is empty. Kind of annoying that we had to wait so long when there were open tables. Who doesn't have enough staff for a weekend brunch to fill all the tables...? <br><br>Food:<br>My fiancé got the black matter coffee - he loved it. I'm not a big coffee drinker, but I thought it was great and full of flavor, too.<br><br>The waiter said they were out of chicken and waffles, which was what I was going to get, so that was another annoying detail. What's more frustrating is that we saw that dish being served the whole meal, but we figured, oh, they ordered it right before we got here. However, as we walked out, an hour later from when we sat down,  I saw it being served to a table I knew was empty when we walked in. What's up with that?<br><br>I ended up getting the grilled cheese. Don't get me wrong, it was extremely delicious and full of flavor. The pieces of bread were one big piece and one small piece of sourdough, so I felt like I didn't really even get a decent sized portion of what the good flavor was. For $15, definitely not worth the price for the small amount that there is. I felt like I was eating just as much crunchy sourdough with no cheese or flavor than I was cheesy-goodness. There was also a side salad, but honestly, who gets filled up from just lettuce and a couple of radishes?<br><br>My fiancé got the short rib reuben benedict. He loved it. It's their take on a reuben turned into benedict style, so naturally it's served on rye bread instead of an english muffin. He really enjoyed it though, but also said he felt his portion was very small. He also had a side of potatoes, and those were good, too. His was also $15. His price makes more sense and I think he had significantly more food and a more filling dish than mine was.<br><br>All in all, I left hungry. What we ordered was good, but too small of portions and kept serving the dish they said they were out of right until we were walking out the door. Probably won't come back unless they begin to match up their prices to the amount of food they're serving!", "pics": null}}, {"review": {"des": "What happened this night? Food we ordered was very delayed (more than one hour) and came cold and completely overseasoned. Waitresses kept being changed during the time we were there.<br>They were nice to not charge us for some of the food even though we didn't complained, but still was a not great experience.", "pics": null}}, {"review": {"des": "Dusek's has been recommended to me by many people, but it was quite a disappointment for me.<br><br>Although I did like the foie gras, the oysters and duck confit dish were not very good.<br><br>Foie gras (5/5): ORDER THIS! I would say that this dish is definitely the highlight of the meal. After one order, I asked for another order of this because it was THAT good.<br><br>Duck confit (2/5): This dish definitely reminds me of something I would find in Germany. Pickled cabbages and sausages. I was not a fan of the flavor of this dish and how sour everything was. The sausages were good though, while everything else was ehh.<br><br>Oysters (3/5): I happened to come on a Monday while is their happy hour for oysters. So, I ordered half a dozen of oysters and they were tiny! While they weren't not fresh, I've had much better oysters...<br><br>Service (4/5): Service was polite and courteous, but not very attentive.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sRWY5EO6ghUEBncQWtWMgA/168s.jpg", "caption": "Duck confit entree"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZbfCbbuSehwTTDTZjd6wkw/168s.jpg", "caption": "Foie gras starter"}]}}, {"review": {"des": "This review is for 4.5 stars. <br><br>Dusek's is a great meal late night. With not much open on Sunday after 10, the restaurant was a perfect choice - late night good eats and high end beers. We tried the sweet potato pasta, the juicy Lucy, and the foie gras toast. The sweet potato pasta was too strong of a taste and seemed a little seasonal than a must order each time out. The juicy Lucy was a great rendition. They cook it medium which is nice, definitely not over cooked. Unfortunately they did not give me a fried egg as I had requested. The waiter said yes to the fried egg but the kitchen said no when they brought it out - oh well. The foie gras toast was tasty but I couldn't really get the taste of foie gras. It was just a nice, sweet opener to our meal. The pineapple was definitely a great addition to that dish. The beer list was fantastic. Lots of rare, strong, and barrel-aged options. Flights available as well. The beer list is 5 stars all the way. The food is a 4 and service a 4. Dusek's really is a great. Option when either venturing out only for food or before/after a concert in the area.", "pics": null}}]}