{"name": "eataly-chicago-3", "reviews": [{"review": {"des": "We've been here many times on our visits to Chicago. Tonight, we stopped for some pizza and beers. <br><br>The pizza selection in the center wine area is very limited. We had the Funghi (Mushroom) pizza and each had a Dogfish Head Namaste beer (wheaty). <br><br>The beer was good ($9 ea) and the Pizza was \"okay\" ($15). The pizza was sliced fresh mushrooms, smoked provolone and housemade mozzarella, finished with a sweet balsamic drizzle. The dough was a long chunk that was really thick - about an inch. <br><br>All in all, an \"okay\" $42 light dinner (including tax and tip). I'd try something else next time. Maybe a Meat and Cheese board.", "pics": null}}, {"review": {"des": "Shame on Eataly for how their security guards handled a potentially dangerous situation last night. At closing time, my friends and I asked for help regarding a man who had been watching and stalking us for hours in the upstairs dining area and who was then standing in the entrance staring at us, seemingly waiting for us to leave and be alone outside. Instead of helping us and making sure we safely made it into our Ubers (at 11pm at night, mind you), a female security guard repeatedly yelled at us to leave, telling us we'd make her miss her train, and forced us into the small, enclosed entrance space WITH the man who was stalking us and waiting for us to leave. We were able to get a male security guard to wait with us, but he did NOTHING when the last of us left the entrance for her car, only to have the man lunge out the door after her, attempting to kick off her heels and knock her down. (Oh, and he kicked her so hard he broke her skin. Fortunately she was still able to run to the car.) <br><br>I won't be coming back to Eataly, as they obviously don't care about the wellbeing of their customers. Management should be embarrassed. Eataly SERIOUSLY needs to address and train their security guards on how to handle potentially dangerous situations. Absolutely shameful.", "pics": null}}, {"review": {"des": "Ah Eataly Chicago. I'm writing this review over a year after the last time I grace this establishment with my Chicagofandom. It was the first Eataly I ever went to and it is by far my favorite over New York's and certainly over LAs disgustingly sardine can-like design that sucks up all the oxygen around you in no time. Nice 2 story with beer and wine upstairs, along with a little food court area with pizza, delis, and seafood offerings and wheels upon wheels of cheese.<br>Downstairs you might find some upstairs shi'. Look at pics, genius! Ohh! But you'll be looking for the bakers. You'll see the line for canolis and other delicious Italian desserts. Stand in the line.  <br>Come here if you're shopping for a date.<br>Come here if you're on a date. Order canolis, eat them on a walk, and make out with your lovely anywhere in beautiful downtown Chicago.", "pics": null}}, {"review": {"des": "I like this place a lot.  If I could afford to eat here frequently, I would go often.  My five stars are based on the type of place it is (food court, market and shops) and what it has to offer.  If I consider the price as make it or break it point then it would be a four stars place for me but I will not go that route.  I'll write like I feel it.  Eataly has a good many things to offer to its patrons.  It may feel like a touristy place but I would say it's not just a touristy place.  I like their restaurants and shops variety.  I have had good pasta, pizza and gelato here.  I have only been here twice so I have more to explore but from what I have had so far I would recommend checking this place out at least once.<br><br>They have imported varieties of Italian foods (cheese, pastas, sauces, wine and more).  They have good desserts (gelato, cannoli, etc.).  They also have a restaurant that offers Raclette sandwiches.  I wasn't aware of this place in my previous visit and in the recent visit, I had plans already to eat pasta/ pizza so I missed it.  Besides eating and drinking here, I have shopped for pasta and pasta sauce as well and both the items were good in taste when cooked at home.  The prices are expensive here.  A cannolo cost me almost $5 for a normal size piece which was not even filled completely with the filling of my choice.  Only the ends were filled with some of the filling.<br><br>I wouldn't go here often.  I can't afford too.  However, either for guest from out of town or for perhaps some special occasion, I would like to go here and indulge in the tasty stuff they have to offer.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/g7QgcnA2wJxN_hyIXf2g9Q/348s.jpg", "caption": "chocolate shell ricotta cannoli and pistachio cannoli"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4tn-jW7Uug_JbgVKahaqjA/168s.jpg", "caption": "Pistachio cannoli on the top and ricotta cannoli at the bottom."}]}}, {"review": {"des": "My all time favorite place to come for lunch, dinner every time I am in Chicago. <br><br>Alright - I've been here so many times and can't believe I have not given them a review...so here you go!<br><br>This is more like an italian 'grocery'/stop and eat place. 1st floor: italian grocery stuff + gelato (must have if you are here - I LOVE their coffee gelato since i'm a coffee lover) and upstairs on the 2nd floor is your variety of wine selection + 3 restaurants (divided by seafood, then there is a center bar and meat). I love the very end restaurant - la pizza la pasta ! Very yummy pasta!<br><br>When you come, they will give you some bread with olive oil (tip: make sure you aak for cheese in your olive oil) to dip it with the bread because it's soooo good! I learnt this once from the server who offered and since then, I've never had one without the cheese. Funny enough - tonight, the people sitting to my left and right copied what I did! The cheese sucks up all the olive oil and taste sooo good with the bread. Am not a bread person at all, but for this, am all over.<br><br>Check out the pictures I post and you will see what I had. I've had other pastas as well.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Aqgv7lr72FNRQNB1tocIPw/168s.jpg", "caption": "Very good red wine!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GWtbRn9AtRcCTCBZzn7mJg/168s.jpg", "caption": "LINGUINE con Pesto Trapanese String pasta, tomato, basil & almond pesto, extra virgin olive oil"}]}}, {"review": {"des": "It's Amore at first sight for me.  Very impressive sort-of upscale food court, all centered around Italian food and even the sales of Italian food products.  You can grab a panini to go or sit down to eat.  Two floors full of restaurants and vendors, including a cooking school and market.  It is easy to eat here 5 days in a row and have different varieties of Italian food.<br><br>My favorite is the Pizza and Pasta Restaurant on the 2nd floor.  Good bread, nice choices in wine, and an array of homemade pastas and pizzas coming out of a brick oven.   Ask for a seat near the window if you're on a romantic date.<br><br>My favorite pastas are the Fettuccini al Nero (recommended if you like black ink pastas with light sauces and squid).  The Lasagne is the BOMB.  You can't go wrong.  It tastes like a good bolognese in that lasagne.  And finally, a pasta that I truly enjoyed as my best pasta here is the Agnolotti del plin Formaffio di Capra (housemade goat cheese pasta with these beautiful tasting mushrooms with Parmesan... one of the best pastas I've eaten.  Complimentary bread and tap water is nice.  <br><br>NEWSFLASH- Fixed Price Lunch Specials for $18 and a glass of wine is only $6, available weekdays, 11a-3p...check out my photos.  Very excellent value and you'll be full.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tQa18j6uR8Ha0x7KabTf8g/348s.jpg", "caption": "Cesare at Pizza & Pasta Restaurant, 2nd Floor"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YvuKw6Ng2t8vxRL2Hv-BHQ/168s.jpg", "caption": "Delicious Agnolotti Pasta at Pizza & Pasta Restaurant, 2nd Floor. Absolutely Delicious!!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oGoddl0hL3fVrOKj007VaA/168s.jpg", "caption": "WHAT A VALUE!!!  Fixed Price Weekday Lunches 11a -3p - best value - Pizza and Pasta Restaurant on 2nd Floor"}]}}, {"review": {"des": "This is the single most amazing place I've ever been. Part grocery store, part restaurant, part most maxing place you've ever been - really. Italian food floor to ceiling in three floors. A coffee roasters,  alert, custom creperie, wine, wine profiler, produce, handmade cheese, imported pastas and sauces, butchery...it's overwhelming and the next time I come I'm bringing a suitcase just for groceries. No. Lie. <br><br>But that's not all!!! A ton of little restaurants dot each level, so you can have seafood or pizza or street style food or fresh made pasta or soup or sandwiches. Soooo good. We are here three times in two days. <br><br>Please please please come to Dallas!!!!!", "pics": null}}, {"review": {"des": "One of my friends recommended Eataly to grab a bite. From the name I presumed it was an Italian restaurant, nothing more. Yeah...about that...boy was I wrong! I'm not really sure what to call this place. Eataly is a hybrid between a Specialty Grocery Store and a set of communal restaurants. If you want something Italian, come here! Chances are Eataly will have it or will at least know how to get a hold of it. Such an interesting place...stacked to the brim with...what else Italian goods; from Wine to Cheese, Crackers & Breads to Sweets, Olives, Oils, Condiments etc...you get the picture...It's all Italian...and you can also EAT here. Nice Ambiance, clean, well lit and an immense selection. <br><br>I briefly looked up all the pics on Yelp before I came and saw some amazing food. However, when I got here I was a bit disappointed...mainly due to ignorance. I was confused and did not know where all the Pizza, Pasta, Oysters, Seafood, Sandwiches and Meats were coming from...I'll explain: As soon as you enter the store, there is a dining area to the immediate right along with a cafe and on the opposite side a Gelato and dessert station as well. I didn't see any Pizza down here and the menu was fairly limited...so I was a bit befuddled. I went to the dining area and ordered some food: <br><br>~ Daily Special - MALTAGLIATI al RAGU de MAIALE - 4/5<br>Poorly Handcut Pasta Squares braises catalpa grove lamb, peas Pecorano Romano dip. Doesn't look like a lot, but its pretty hearty and filling. Tasty, hearty and flavorful, but not amazing.  <br><br>~ Grand Gelato with 3 Flavors - 4/5<br>Some dessert to finish up a meal. Good stuff, not too sweet or creamy, but once again not astounding.<br><br>~ Canolis - 5/5<br>Now these were AMAZING! I got one of every flavor! To go...of course! Pretty much what I envision a perfect Canoli to be...Perfectly balanced Creamy, Sugary deliciousness without being overly sweet or too heavy.<br><br>After gorging on my early diner I decided to go upstairs...NOOO!!! Da Fuk?! Why did I not come up here earlier?! The rest of the foods are available upstairs! Sandwiches, Pizza, more pasta etc... It's true! It's all here!! Doh!!! Just means, now I have to come back and try everything all over this place!<br><br>Sooo...in summary, before you decide on something to eat, I suggest taking a walk and perusing through both floors of Eataly.<br><br>Bene! Molto bene, grazie.<br>Ciao!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jZukjwF93HS8-ZlmHC27zw/348s.jpg", "caption": "Canolis - 5/5"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zNVu9tCEMtKoedLAozhkPA/168s.jpg", "caption": "Grande - 3 flavors - 4/5"}]}}, {"review": {"des": "This review is just for the crepe place. We came back here everyday during our stay to get crepe. It was that good. We love our crepe with banana the most. Strawberries were a little sour at that time. <br><br>Unfortunately, I can't say anything about the food upstairs since I don't like how it works. We were looking for a place to eat but were told that just find a place to sit down and get food. It was just too crowded and too much for us to handle. I just don't like having to deal with crowds and rushing to finish my food so other people can sit down.", "pics": null}}, {"review": {"des": "Loved loved loved every part of this amazing shop! 2 floors of everything Italian you could possibly want. And the food was super delicious!  And the wine selection was fantastic!  I will be stopping back by before my trip is over", "pics": null}}, {"review": {"des": "In the neighborhood during late afternoon slump so I came to Lavazza for a cappuccino. They were out of oat milk but otherwise my cappuccino was excellent. My husband's double espresso was also good. That mid afternoon slump made me a little hungry; I ordered a vanilla yogurt parfait. It wasn't so sweet so I asked the guy at the counter if he remembered if he grabbed me a plain or vanilla, I'd have eaten either one, I was just curious if this was how the vanilla was supposed to taste. The manager was within earshot and said if it wasn't sweet it was probably the plain. I said, \"ok, I'll just eat the one I was given and be content.\" She absolutely INSISTED on replacing it with the right one. Just saying I appreciate that. <br><br>As for the rest of Eataly, it's big and overwhelming. A site to behold and experience with all your senses.", "pics": null}}, {"review": {"des": "This place was so cute! And a little bit overwhelming. If you want a quick trip to Italy (without the airfare or annoying TSA), this is your stop. <br><br>I found Eataly on my hunt for a place with dessert and wine/cocktails. I went in and couldn't believe my eyes. This place is like an Italian Wegmans. I'm not sure if Chicago has Wegmans but just think of a really big store with every product you can think of along with an eatery. That's what Eataly was to me. <br><br>Before realizing there was an upstairs, I walked around downstairs then found a gelato and rosé stand. These people must know my heart. I ordered a waffle cone (best waffle cone I've had. Maybe they bake them fresh everyday. So good) with a vanilla scoop and lemon scoop. Gelato secured so I move down the line where there's a rosé all day stand. Lawd. How can I select? By trying samples of course !<br> <br>I forgot what sample I tried but I liked it so I got a glass of it. Now to find somewhere to sit. Downstairs was packed so I headed upstairs. There's several of stations with pastrami, meats, breads, wines you name it. I sat down to devour my yummy gelato and wine before exploring more. <br><br>Ended up getting another glass of white wine that was divine and learned that they had wine classes.<br><br>Absolutely loved this place (minus it being overwhelming) and I'll hopefully return before I leave Chicago.", "pics": null}}, {"review": {"des": "I mean! A little late but why not! <br><br>Eataly Flatiron was my favorite since 2012!! I have to check out the others too. I like them all except the one in Rome. Because well! Better food outside! And it's right by the termini. Felt it was more for tourists!! <br><br>This one I like! We were going to Alinea for my birthday dinner. And all 6 of us girls wanted to eat light! Well 5 of us! Not me! And of course! Coming here = nothing light about it! And no regrets!! <br><br>It was my birthday week! So I just burst on its my birthday every time someone asks how I'm doing! :P it's my bdayyyy! My friends are getting used to it! And here! It was perfect! <br><br>Naturally I went for pasta!! All the fresh pasta!! Espresso! And rose!! My awesome server got me a birthday treat!! She got me my second drink! Wooo!! It was memorable and fun cause she was just as excited as I was! We had everything from their burrata bar to pizza, pasta and charcuterie! <br><br>And I had a blast! Even in the freezing cold weather!! It's on a smaller side! But plenty of room inside! And love that they have big tables by the kitchen counter!! Got to eat and watch! Fun x 10!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AkVpGUPZtuGX19CwNhlaeg/348s.jpg", "caption": "When you wanna look hot! But can't give up pastas!!!"}]}}, {"review": {"des": "We actually saw lots of ads about this place near our hotel and we had no idea what it was exactly. Coincidentally, we decided to meet up with my husband's former co-worker since she was nearby and she actually recommended this place.<br><br>It was cool that this place had an Italian marketplace on the first floor (along with a gelato AND cannoli bar) and multiple dining options on the second floor. We let our host decide since and had a wonderful meal (complete with gelato and cannoli afterwards, of course!) while hanging out with our newborn baby!", "pics": null}}, {"review": {"des": "When the same old action of dinner at a fancy place starts to get boring...Eatly is the move!<br><br>We came for my mothers birthday! We split a variety of pastas at the restaurant on the second floor dedicated to truffle...So automatically we knew it would be great. It was in the corner and a nice quiet place compared to the crazy scene of the market! <br><br>I studied abroad in Florence, Italy and I miss the markets the most out of all. Feels like a part of Italy is truly in the heart of Chicago-my two favorite cities in the world! <br><br>We left with hundreds of dollars of groceries and Christmas presents! So worth it!", "pics": null}}, {"review": {"des": "There are literaly thousands of reviews for Eataly, so I'm just going to highlight my favorite things that some people miss. The first floor is my go-to place for hostess gifts, birthday presents and holiday goodies... some things you won't find at many other stores. (This is the first place I found bottle stoppers designed specifically for champagne and sparkling wine that don't pop out in the frig.) Their regular prices are at the top end, but their sales on Italian coffee are not to be missed.<br><br>I have two friends who share the same birthday, and I always have a few friends over to celebrate. Last week, I bought them several housewares presents (including the cute pink thermoses on the top shelf)... and cans and cans of Lavazza Italian coffee for me because they were having a half-price sale. One advantage of buying presents here is that Eataly wraps them for free, while you wait, in the customer service area near housewares.<br><br>I agree with many of the comments that the waits can be too long, as this has become a tourist magnet. (I also refuse to wait 20 minutes for a cappuccino or a gelato or to check out.) I don't know why they don't hire more people at peak times, but they don't. So do what the locals do... arrive early and avoid weekends. That way you'll miss the crowds and maximize your enjoyment of this unique resource. Abbondanza!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3mPuMCSuo4pzD8xpaz0XLg/168s.jpg", "caption": "Free gift wrapping/bags."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7-TS3xrSzYyULzOvu8zPIA/168s.jpg", "caption": "Great selection of gifts."}]}}, {"review": {"des": "If you don't already love Eataly then your wrong. This place never disappoints and can serve any occasion with fun and class. Come with your mom, significant other, a friend, by yourself, with your boss, etc. <br><br>This was my millionth time at Eataly but I came specifically for the Italian alps themed restaurant \"Baita\". It tends to be a more rustic take on the Italian kitchen with hardy pizzas, baked cheeses, raclette, warming vinos, and even sipping chocolate!! <br><br>Highly recommend the speck and fontina pizza accompanied by the baked taleggio topped with honey and pine nuts. Fantastic pop-up, get in before it's gone!!!", "pics": null}}, {"review": {"des": "Just stopped in for a cannoli. I did notice that they redesigned the main floor. The tables and chairs are new and the organization of it them is much better. They also have a few booths. Many of the tables are family style which saves space and allows for more seating options. I also noticed that they got rid of the nutella bar, probably because the nutella bar opened up in Michigan Ave but I was still disappointed because the Michigan Ave one is kind of far. <br><br>Surprisingly, there was not line at the cannoli counter. I went for a chocolate covered cannoli with a pistachio filling. It cost around $6.5. It's the most expensive cannoli I've ever heard. It was pretty good but not that good. The filling was plenty and very creamy/sweet. It had large pieces of pistachio mixed in. The cannoli shell was crunchy and fresh.<br><br>Overall it was a good cannoli but I don't think it was worth the hefty price tag.", "pics": null}}, {"review": {"des": "Usually I don't go to places that are overly recommended because the expectations don't live up, but Eataly was well worth the hype! In fact, I visited twice in the few days I was in town because not only was it that good but there was that much to look at! <br><br>On my first visit I read every coffee, tea, and chocolate label on the first floor. Okay maybe not all, but there were so many with such cool ingredients and things I've never heard of, it was so intriguing! I ended up buying two boxes of organic fruity teas for around $4 something each with 30+ bags. I also got a double shot of espresso and a handful of Italian chocolates from the variety bar to the right downstairs, sampling frosé slushies on my way out. The espresso was magnificently decadent and I recommend it over any I had in town (except maybe Fairgrounds).<br><br>On my second visit I came for homemade raviolis but found out it was $14 for about 10 little squares so I went with a house made cookies and cream cannoli and limoncello style slushie instead. Honestly, best decision I've ever made. The drink was packed with fresh lemon flavors you can only find out of the country and the cannoli tasted of thick, flavorful ricotta that was far from too sweet and the perfect combination of filling and satisfying. I would eat one of those every day if I could and I'm not typically a huge cannoli person. <br><br>Downstairs left side is mainly coffees, teas, snacks, and kitchen goods. To the right there's a homemade ravioli bar, a coffee shop with a few fresh breakfast pastry options, a rosé inspired slushie, cannoli and gelato bar, and the chocolate and desserts cafe. Upstairs is a whole other story.. they have everything from cookware and party supplies to meat markets, restaurants, world imported fresh cheeses, an espresso bar, fruit stands, and more. <br><br>Low budget or high, I would definitely venture out to Eataly and explore all the things they have to offer. There's truly something for everyone, even if it's just samples and learning some new, fun Italian words. The culture is rich, the staff are plentiful, and the experience is one you won't forget. I look forward to trying the new one in LA soon!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/s7b2T8jEEBny31Ihl4o0TA/348s.jpg", "caption": "Cookies & Cream Cannoli + Lemon slushy"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IUgbihtn3ONZkr9mUQ_dlg/168s.jpg", "caption": "Leone mints"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7u45wfZBnAiJqXZRw4NxDw/168s.jpg", "caption": "Italian coffees"}]}}, {"review": {"des": "Eataly is basically two large floors of Italian goodness!   There's shops that sell meat, seafood, cheeses, gelato, wine, etc. I honestly was a little overwhelmed with how much there was and wish we had allotted more time to spend here.  <br><br>We ended up sitting down at one of counters and ordering some oysters and fried seafood. Oysters tasted fresh. The fried seafood breading was light with just the right amount of crispness. If I had one problem, it's that the restaurant area can be a little confusing. They have a cordoned off section with tables you can wait to sit down at, as well as random tables and counters strewn about throughout the second floor. They all seem to have the same menu though. So just find an open seat and a server will come around to help you. <br><br>The pasta and prosciutto we bought for later was also delicious. I would definitely come back here if I was in the Chicago area again!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8p6IETiFcExfUNIXIpKi-A/348s.jpg", "caption": "Sorbetto and gelato"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/C9Z9w0wHMq06BceNMa_dcQ/168s.jpg", "caption": "Fresh oysters"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QRPVVeYo3KK-weAb53ynRA/168s.jpg", "caption": "Fried shrimp and calamari."}]}}, {"review": {"des": "Came here when I visited Chicago for the first time outside a layover at the airport in early November. Apparently it's a chain but I've never heard of it until a classmate recommended it to me. If you're into Italian food and wine, then you'd think this place is heaven. They had a food court that served pasta / pizza / sandwiches on demand on the first and second floor. We explored the first floor and found a bunch of Italian sweets, snacks, pasta, sauces, and other goodies at reasonable prices (tons of items below $10). I went upstairs and saw a vast collection of cheese, meat, and wine as well. It looks like they make fresh mozzarella on-site before dinner time and you can even watch them make it. We tried the ragu pasta and a tangerine soda and both were excellent. The portions were smaller than I thought but given it was in downtown Chicago it makes sense - probably comparable to downtown NY, SF, and LA. Pasta wasn't too cheap - we paid about $15 and waited about 10 minutes. Overall still a great 5 star experience and I hope they open one in the Bay Area soon! I'd probably end up living there.", "pics": null}}, {"review": {"des": "Amazing place that I truly want to give five stars, however I came here Sunday with my brother and girlfriend visiting from out of town and the two hostess couldn't be more rude. We had to go up twice because they looked at us like we had three heads. They told us that we couldn't get a table if we only wanted wine and a cheese board. They told us that we had to sit at the bar for that? We ended up going back up to them and being like why can't we have a table? Just super unaccommodating. Our waitress was great, but hostesses need to be changed.<br><br>Also - the Salumi e Formaggi Misti (salami and cheese assortment board) came with 5 different salamis and 2 small portions of cheese. That's simply not an assortment.", "pics": null}}, {"review": {"des": "Tried the Italian Hot Chocolate with Whip Cream. Oh so good! This is a must have every visit I'm in Chicago. The chocolate is thick and decadent.", "pics": null}}, {"review": {"des": "An Italian grocery like no other.  Let's start with drinking wine while you're shopping.  They have everything you could possibly need and want and then some you haven't thought about. Things like truffle oil or caviar. <br><br>I can't begin to list the dinning options in all price ranges none of them ridiculously expensive. I do absolutely adore the sweet options on the first floor. They have gelato pastries crepes and of course a coffee bar with unique drinks to go with that.<br><br>I highly recommend a visit. You can easily spend a few hours here. The experience is best if you come hungry and pace your self.", "pics": null}}, {"review": {"des": "I started to go to Eataly in NYC when they first opened and I always enjoyed the Resturant's and food vendors.  So being in Chicago, I thought I would try to have the eating and browsing experience here.  I was not disappointed . It has 9 restaurants and 8 retail stores all catering to Italian products.  It has the same venue but smaller. <br><br>It's a fun place to eat, shop and visit if you like Italian food.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HDts-jLJCXjuUZPYEP1kxA/168s.jpg", "caption": "Olive oil"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gA-usSDZ8_cEDRHE9UqQNQ/168s.jpg", "caption": "La Focaccia"}]}}, {"review": {"des": "(English) <br><br>Love this Italian franchise. You have 2 or maybe 3 floors of pure Italian cuisine, gelato, wine, pasta, pizza, a market and even a grab n' go. On the first floor they have a more casual, serve yourself kind of place with an Italian goods store and upstairs they have many different restaurants with a seated area to enjoy. We stayed in the area below because we were more casual. <br><br>We ate at Ravioli & Co., which is a house made pasta place and wine bar. The food was delicious. If you order good wine and good food you will have a high-quality dinner. We ordered the Ravioli Al Prosciutto which was Prosciutto stuffed pasta, with a light butter sauce and topped with Parmigiano Reggiano, and also I was looking for a vegan option so the cook was very kind in offering the Tagliatelle all Bolognese without Bolognese, the pasta sauce was amazing!<br><br>I recommend this homemade pasta place that is very informal but that will leave you satisfied, or if you want to go with a big crowd go up the stairs because any way you can not go wrong with an option. <br><br>(Español)<br><br>Me encanta esta franquicia italiana. Tienes 2 o tal vez 3 pisos de pura cocina italiana, gelato, vino, pasta, pizza, un mercado e incluso para llevar. En el primer piso tienen un lugar más informal con una tienda de artículos italianos y arriba tienen muchos restaurantes diferentes con un área para disfrutar. Nos mantuvimos en el área de abajo porque estabamos más casuales.<br><br>Comimos en Ravioli & Co., que es un lugar de pasta hecha en casa y bar de vinos. La comida estaba deliciosa. Si pides un buen vino y buena comida tendrás una cena de alta calidad. Pedimos el Ravioli Al Prosciutto que era pasta rellena de Prosciutto, con una salsa ligera de mantequilla y cubierto con Parmigiano Reggiano, y también estaba buscando una opción vegana así que el cocinero fue muy amable en ofrecer los tallarines alla boloñeses sin boloñesa, la salsa de pasta roja estaba increíble!<br><br>Recomiendo este lugar de pasta casera muy informal pero que te dejara satisfecho, o si te apetece ir con una gran multitud sube las escaleras porque de todos modos no puedes equivocarte con ninguna opción.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7DSGg7RCqEqHoqrbeSnZPA/168s.jpg", "caption": "Ravioli Al Prosciutto-Prosciutto stuffed pasta, light butter sauce, Parmigiano Reggiano"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0bKcUu0c55kXPLyWOMPLZg/168s.jpg", "caption": "Tagliatelle all Bolognese- Housemade ribbon pasta, pork, beef and veal ragù, Parmigiano Reggiano."}]}}, {"review": {"des": "I came here on a visit to Chicago a very long time ago (2015 or 2016) and I ate at Eataly with a friend, Megan S. and her roommate. I believe I had been here once before too when I lived in Chicago. This place is huge so there is definitely a big selection of Italian cafes and restaurants to choose from. Seriously, you can probably come here for 2 weeks straight everyday for lunch and still not get through all menu items of each restaurant. I think I ordered Pasta that day and I remember been full and satisfied because I had a flight to catch back home.<br><br>Also, if you have a taste for dessert then you can buy some here. Also, you can do mini grocery shopping here as well.<br><br>We all know that Italians dress well but they also know how too cook and EAT WELL. Everything here is super fresh and of high quality. <br><br>If you can't travel to Italy anytime soon then you can at least just EAT ITALY = EATALY :) <br><br>****<br>This is my 143rd Yelp review overall. <br>97 reviews for 2018.<br>I am aiming for 100 reviews in 2018.<br>Reviewed on 31 October 2018.", "pics": null}}, {"review": {"des": "What can I say!?  I love this place and have my favorites!<br><br>Thanks Sean-at the Wine Counter for allowing me to wine taste and helping me pick out a great bottle of wine from Tuscany!<br><br>Also thanks to Tony T. for making the best Pizza EVER-I always ask for him when I go to the second floor for Napoli Style Pizza-he is at Rossopomodoro!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JrTa23__1pVX4ThcSRjeRA/348s.jpg", "caption": "Tony T makes the BEST PIZZA at Rossopomodoro!  Thanks!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Q4JrnCfz-HcTZaMmDluHWg/168s.jpg", "caption": "Rossopomodoro-Ask for Tony T-he makes the BEST pizza!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AL4T87saSq1WhEHhQZ1AIg/168s.jpg", "caption": "Rossopomodoro-Ask for Tony T to make you this!"}]}}, {"review": {"des": "Such a cool place and definitely worth checking out. It's basically a big area with a bunch of super cute authentic Italian food stands/ restaurants. It can be crowded, but you'll be able to push your way through:) Also, if you've ever been to the one in New York, it's much much bigger with more options and less crowded. It's best to come here on an empty stomach because there is so many different options. A great starter is the meat and cheese boards with their house made bread, everything is so. dang. fresh! Some of the best cheeses I've tasted are from here and you can clearly taste the difference.<br> <br> You can't come here without trying their house made pasta and pizza it's a perfect for any meal of the day but I recommend coming with a group of people so you can sample everything. They also have a cannoli bar, crepe bar, or one of the fancy petite desserts bars too. Unless you're really into sweets, I think it's best to skip dessert and fill up on the magnificent foods. <br><br>What's also pretty fantastic is almost every available to eat their is also available to buy the ingredients for and make yourself. Super authentic and fun place to stop on a trip or even if your from the city:)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gPuZvDB0RQD4veW_1DMxAg/348s.jpg", "caption": "Eatly's cheese, meats, perservatives, and freshly made bread platter"}]}}, {"review": {"des": "Eataly is a fun diversion in Chicago. Foods are fascinating and pricey; I could walk through this place all day. Favorite activity: trying samples (cheese, prosciutto, Barolo.) Second-favorite activity, watching mozzarella and burrata being made. Biggest disappointment: all the mozzarella was cow's milk, not buffalo milk.<br><br>My favorite spots are the cheese counter--sooo many to choose from (even some ripened buffalo milk cheeses) from so many different regions of Italy--and the pasta department. I saw shapes of pasta there that I'd never seen before, including half-inch diameter tubes a good three feet long. I have no idea how I would serve them but now I want to find out.<br><br>I'm not a shopaholic, but a visit to Eataly is a little excursion to Italy in the middle of North America. It's a great way to spend a couple of hours in the windy city.", "pics": null}}, {"review": {"des": "This place is great! It's a grocery store along with dining, offering different options such as pizza, pasta, sandwiches, gelato, and other desserts! I had the pleasure of being able to dine in and if you don't mind the noisy atmosphere, it is a nice dining experience! The restaurant area is split into two menus: seafood and traditional. Due to my dad's penchant for seafood we chose the former. I ordered the squid ink pasta and the calamari and both were good. I thought the pasta had a light flavor and could use slightly more depth however it was still good and allowed the seafood to stay as more of the spotlight. Our waiter was very nice and was able to be attentive due to it being very busy at the time. I recommend browsing around the aisles while you wait for your table because lots of the goods are imported and one of a kind!", "pics": null}}, {"review": {"des": "This review is for Sabbia in Eataly.<br><br>My sis and I visited Eataly on a Saturday night.  After walking around for a bit, we decided to eat at the counter at Sabbia where we could watch the pizza and bread being made.  There was no wait and we seated ourselves.<br><br>The menu consisted of Italian dishes and beverages (wines, beers, etc).<br><br>We opted for the Melanzane con Pomodoro and Siciliana Pizza Palla.  Our food arrived in a timely manner and was plated well.  The Melanzane was delicious but the pizza fell a little short.  <br><br>Service was friendly but a little slow and MIA at times.  <br><br>Overall, I felt Sabbia was worthy of a 4, rounding up from a 3.8.", "pics": null}}, {"review": {"des": "Always a joy coming to this place.  I can spend hours here browsing.  Full with all things Italian with new products all the time.<br>There's always ways on eating food. <br><br>It's pretty pricey though.", "pics": null}}, {"review": {"des": "Sensory overload much? This place can have that affect on people.<br><br>I visited for the first time last week, and when I walked in, my first thought was, \"this place is a lot smaller than I expected.\" The way some friends described it, I was thinking Nordstrom or IKEA-sized. Then I reached the second floor and realized, yeah, it's a big space, not Nordstrom or IKEA, but big enough.<br><br>First floor features a grocery section, wine bar, dessert bar, fresh pasta made to order, coffee, and build your own cannoli. Second floor features a fine dining restaurant, cold seafood bar, pizza and pasta restaurant, Focaccia counter (for lack of a better description), casual dining counter, \"Roman\" style pizza (thick crust, but not Chicago deep dish), wine section, deli, and produce section. I think I listed everything. Some of these places make up the seasonal restaurant, which is Sabbia, for the summer.<br><br> The takeaways are that you can drink wine while you shop, and you can buy and eat pretty much any Italian food item you want.<br><br>On my visit, my friends and I opted for the tagliatelle pasta with a delicious Bolognese (awesome!) and prosciutto stuffed ravioli from the made-to-order pasta bar, which offered a total of thee options that day. Then we went upstairs and sat in the \"common dining room\" and ordered a meat and cheese board, arancini (awesome!), and spiedini but it wasn't the spiedini we thought we were getting (we didn't read the description - enter sad face emoji here). Service was solid once we figured out we actually had a server. We ended our visit with a slice of focaccia topped with Heirloom tomatoes and fresh mozz. <br><br>Next time, I'll hit up the fine dining, pizza, and dessert. I tried to get dessert, but there was only one staff member and she was helping a group of 4 indecisive women, and I had a parking meter that expired in an hour, so....<br><br>Overall impression of my visit was good food, over-hyped, under-staffed in some areas, but I'll be back again and recommend others give it a visit. Bonus, they validate parking, which saved us 66.66667%!", "pics": null}}, {"review": {"des": "Where do you go when you have 4 people who are overly flexible (I don't care, I'll eat whatever)? Go to a restaurant with 5 options inside! This restaurant and retail store combined was good. Walked straight to a wine cart and bruised the food options while sipping wine. I think every restaurant should do that now! <br><br>This place has pasta at every restaurant - the difference was mood and focus (seafood, bakery, pizza, Quick sauce station, etc.). <br><br>We ordered bread and a charcuterie plate - very good start to the meal. Everyone was happy with their meals - nice sauces and al dente pasta. However no one raved, therefore the 4 stars. <br><br>We went on a Monday night - lines at almost every option. Would never go on the weekend.", "pics": null}}, {"review": {"des": "Got to go to get pizza at etaly! Have to say the atmosphere, the wait staff, and the quality of the food was very good. One of the best pies I have had and really would recommend anyone who hasn't gone to etaly should give it at try! You won't be disappointed and you can even Check the shopping stores below if you have to wait for your reservation! I highly recommend this!", "pics": null}}, {"review": {"des": "*Visited 08/22/18*<br><br>I love the eataly concept. We were pretty lucky that Eataly is pretty much under our hotel so when we arrived to Chicago late Wednesday night we beelined straight there. I knew kinda how the layout was (shopping/quick food downstairs, restaurants/sit down upstairs) so we took the escalator upstairs. Since it was already 9pm we could tell that a lot of shops were closing down. It was a little confusing navigating upstairs since you didn't really want to walk through. \"Restaurant\" but that was the only way to get to some of the other shops. We were able to get some focaccia bread which was delicious and huge for about $5 a piece. Since it wa slate we ended up buying the bread to take back to the hotel to heat up, a couple bottles of Bellini and some connollis. It was a little pricy, but for the quality of food, I would recommend stopping by. <br><br>My faves were the mushroom focaccia bread and the traditional cannoli. Also we had to try the gelato and the hazelnut was the best gelato I've had pretty much ever.<br><br>The only reason I'm rating it a 4 is that they took out their Nutella bar and it wasn't listed anywhere that they did, but the amazing Hazelnut gelato made up for it!", "pics": null}}, {"review": {"des": "Eataly is usually packed with people during much of the day, but it's still worth a visit. Lots of Italian imports, some truly exceptional olive oil, great cappuccino, and a Nutella dessert bar where you can get a crepe.<br><br>Don't forget that this place is a GREAT way to shop for a unique kitchen gift for yourself or someone else. Eataly has many different things that are unusual and hard to find, and very well designed. From a silicone laurel leaf that you can roast a turkey on, to an expanding trivet that won't take much space in your kitchen, to tiny one-serving cast iron cookware. The cheese and fresh pasta section can't be beat. Produce is great too, if a bit pricey.<br><br>An excellent place to get great Italian style espresso. I recommend going to the 2nd floor to watch your espresso come out of the most beautiful machine I have ever seen.", "pics": null}}, {"review": {"des": "I don't even know where to begin with Eataly. If you haven't been to an Eataly, you should come just to check out how awesome this place is. Everything in the store is Italian in some way, shape, or form. (For the most part) The store is laid out over two floors and there are areas to shop in from groceries to olive oil to wine to fresh meat and everything in between. <br><br>On the first floor, there are a lot of household items, a coffee bar, a gelato/sorbet bar, and a dessert section. There is quite the variety of flavors from the gelato/sorbet bar and can be quite busy on a hot Chicago day. <br><br>On the second floor, there is olive oil, more household items such as shaving cream, a meat deli, a grocery section, everything Italian wine laid out into different regions and explaining the different types of wine and where they come from. There is a focaccia bar and an Italian style restaurant. There is also a beer garden that is open on the weekends. They also have a section with wines by the glass to try.<br><br>We stopped in the beer garden for a beverage and some food. I ordered their in house brewed Ravenna Pale Ale. My significant other ordered a glass of red wine. We ordered a focaccia like pizza and an order of aranchetti. The food and drinks were great. <br><br>I always enjoy coming to Eataly and would recommend this place to anyone who wants to check out everything Italian. You can easily spend hours here.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/f61IBn_wfNuVDwdKstdhQg/348s.jpg", "caption": "Draft List"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/d3lrC-nDOxiCuP0e6yR4JA/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8TJA5wLThZWmnEOpLmgRmA/168s.jpg", "caption": "Pizza!"}]}}, {"review": {"des": "This is just an amazing collection, or cacophony, of sights, smells and tastes.. as well as people watching.. and experiences.. LOVE IT!<br>Yes, it's crowded, so be in the mood to be in an Italian Marketplace, because that's what's intended.  (Quiet tete-a-tetes and/or date nights might want to look elsewhere)<br><br>We had a cold, (NOT iced.. so not watery!), espresso downstairs at Lavazza forest.  We weren't feeling hungry, just wanted to look around.  But as it was a Wednesday evening, there was room upstairs for a light snack at the oyster bar, so why not???<br>We ordered a half dozen oysters, an order of arancini (3) and the charred octopus.  ($50). All delicious! Especially impressed that octopus was so tender and that the arancini were authentic.  (Read: NOT filled with greasy cheese and smothered in pasta sauce like most American-Italian chains present them!). You could cut the arancini in half and they held their shape while also presenting a slight risotto texture.  <br>NOTE: before even ordering, yo will be presented with a small, complimentary olive plate! Nice touch!<br><br>So we already were not hungry, ate all this and then could not push through a dessert!  Next time:  Nutella bar!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uzC85s8_6jVWh6QihHXUqg/348s.jpg", "caption": "Small olive plate is complimentary before ordering!  Half dozen oysters and charred octopus."}]}}, {"review": {"des": "This is my least favorite Eataly of all the Eatalys I've been to around the world. It's extremely crowded (even worse than the ones in NYC), the parking is outrageous ($32 for 30 minutes) and their grocery selection is tiny compared to other Eatalys I've been to. They had no Mariangela Prunotto products stocked. A shame. <br><br>Also the gelato counter was closed on a Sunday morning (every other restaurant/section in the store was open). Why? Are you trying to shame me into thinking I shouldn't be eating gelato for breakfast? Fuck you, Eataly Chicago!!!!!!!!!!!!!!!", "pics": null}}, {"review": {"des": "Very well known Italian grocery + food court near the Magnificent Mile. The store is 2 stories and is very bright due to the white walls. They have an interesting selection of grocery items, and there are quite a few food stalls and restaurants inside that serve Italian-style pizza, pasta and gelato. The place was pretty busy during lunch on a Saturday.  <br><br>We went upstairs to the pizza and pasta restaurant in the back corner. I got the prosciutto-stuffed quadratini and that was very tasty. The portion is not big and the price is not cheap, but the quality is very good. I also went downstairs and got a waffle-cone double scoop of the tiramisu gelato and apricot sobretto. The apricot sobretto stood out for me because the strong apricot flavor. It was delicious and a good dessert after the past. In addition to the food I paid for, there were also plenty of free samples to be had. I tried a number of beverages, cured meat, and even got a bag of popcorn.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AYyjIzsuVcsmI1XZh0EW8g/168s.jpg", "caption": "eating quadratini pasta in front of the pizza ovens."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xHvYe-ZZkQARHkzbN0WBAQ/168s.jpg", "caption": "waffle cone with apricot sobretto and tiramasu gelato"}]}}, {"review": {"des": "A must visit when you're in Chicago! It is a little pricey, but there is so much variety and quality in the place that I think it is worth it. The raspberry gelato was creamy and delicious, the portion size was great as well. The cream puff was to DIE for. It was a dessert I would ruin my diet over anyway. <br>The spinach mushroom pasta was mouth watering, and made me want to lick the plate. Every single bite I took from this place was scrumptious and I would definitely stop by again.", "pics": null}}, {"review": {"des": "I heard many good reviews about this place... so I had to check it out! This authentic​ Italien cuisine had a very clean and a nice vibe. There were so many different types of pasta​ and sauces that you can buy from! <br><br>Eataly had nice waiters and they explained the history and the different types of pasta. The menu was too overwhelming so I asked for the waiter for a recommendation... so that's why we got the original pasta al dente. I was not sure if it would be good but after trying it... it is officially my favorite kind of pasta. I got very full after eating it even though it seemed like the portions were normal. <br><br>There were wine options too! Therefore, I would say it is definitely​ worth the hype. I recommend this place.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kVTWJjDb4W4aRcHQuTdOhA/348s.jpg", "caption": "TIP: always ask for a recommendation!"}]}}, {"review": {"des": "Love coming here, but man can it get packed.<br><br>The last time I came here, I ended up arriving just before lunch on a Saturday. That seemed to be a much better time to arrive because it wasn't quite as busy yet, and we were able to get a seat at one of the restaurants immediately. <br><br>The food here is delicious. I always go for one of the meat and cheese trays, and I like knowing the mozz has been made in house and the meats cut to order. Throw in some pretty good wine, and you have yourself a nice dinner.<br><br>After you're done eating on the second floor, spend some time browsing around. I like to look at the dried pasta.. there are shapes and sizes I've never seen anywhere else. Same thing with Olive Oil.. who knew there were so many!?", "pics": null}}, {"review": {"des": "We just got to Chicago about 2 hours ago and we were looking for a place to get something quick. We looked at Shake Shack, California Pizza Kitchen, The Big Bowl and then Eataly. <br><br>WOW! <br><br>When you walk in on the first floor, it looks like an Italian grocery store but then there's a quick food section and what we later learned was a ravioli station. Luckily, there's a guest relations desk (whaaaat?! At a grocery store?! Yes!) to help us navigate. <br><br>The young lady looked at us and goes \"First time?\" and then she gave us a map (A MAP!!) for the store. She was so very helpful. I can't even begin to describe how phenomenal this place is. Everything you need to make your Italian dinner come true, can be found here: from olives to caprese to wine to entrees. I LOVE THIS PLACE!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vHHPFotDcj-blKakoR6EAg/168s.jpg", "caption": "A map. This. Place. Needs. A. Map!!!"}]}}, {"review": {"des": "Overwhelmingly awesome!!! A friend and I checked this place out spontaneously one evening and had so much fun. You could make an entire day out of seeing everything they have to offer. We started off by checking out all the unique merchandise and goodies the store on the first floor had to offer. From specialty chocolates to bath and body products to gifts and yummy food, Eataly has it all. Venturing up the escalator we were transported into a world of amazing food and wine. The cheese counter is HUGE. I had to stand there for a good ten minutes just to take it all in and look at the different types of cheeses they actually have. They have a fresh grocery section that is to die for. And of course all the incredible mini restaurants ranging from fresh Italian sandwiches to homemade pasta. We got a glass of wine from the wine bar and then continued on to explore. You get to drink while you shop... My kind of place. I also enjoyed that they had sample stands set up. I may have walked past the pizza one 3 or 4 times because the pizza was just so good. I can't wait to go back and bring people who have never been here before.", "pics": null}}, {"review": {"des": "Eataly is unique and awesome. Part supermarket, part food hall, part cafe, part culinary education experience, part wine shop, and totally modern Italian. The Chicago location is two floors of sensory overload. This time I ordered some buttered prosciutto ravioli from the downstairs pasta counter. On the Eataly spectrum, this was a lower priced option. Ate in the food court type dining area in front of the cannoli counter, and somehow resisted getting dessert. There's something for everyone at Eataly.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/55s-szBQqnIo0f_fpV04nQ/348s.jpg", "caption": "Ravioli filled with prosciutto"}]}}, {"review": {"des": "Came here for a girls lunch with my relatives when I was visiting Chicago. I really enjoy the concept of this place, being that it's a market and eatery all in one. We sat to eat on the second floor and we enjoyed the burrata and cacio e pepe. We also enjoyed some frose and cannolis too.  The service was good and the food was good too. <br>The customer service in the market place was OUTSTANDING! I wanted to buy a shirt for my husband and the CSR went out of her way to check the warehouse to get me the exact shirt I wanted, and returned with a smile on her face too. Great service team!", "pics": null}}, {"review": {"des": "This is an Italian market. They have everything here. If your in the mood for coffee there is an expresso bar. If you want chocolate there is a whole bunch of chocolates to choose from as well as Italian pastries. <br>Upstairs in a restaurant if your looking for lunch or dinner. <br>There is an Italian market with everything from cheese to cookies to pre packaged noodles. <br>Don't forget to stop off and get a bottle of wine on your way out. <br>It's a fun place too explore.", "pics": null}}, {"review": {"des": "Sooo much to look at - you could spend all day! From wine, pasta, and olives to kitchen utensils, cookies, and cannolis - everything remotely Italian has a space here!<br><br>We ventured around downstairs and upstairs. Downstairs is more of a fast-casual place, with places where you can order at a counter and lots of desserts. Upstairs has a sandwich counter, but also various other \"stations.\" We didn't realize for a while that it was table service. You find a seat and eventually a waiter will come serve you. This concept could be improved as it was a little confusing, and next time I would probably stick to the downstairs offerings. Once I did order, I went with a bruchette trio, which included some hot, fresh bread and three toppings - tomatoes, tuna, and pesto. All of them were tasty, but I'm partial to the traditional tomatoes. My husband liked the tuna. He also ordered a sandwich from the deli counter. The meat was plentiful and tasty, but the sandwich was rather dry and lacked condiments.<br><br>THE BEST PART. Cannolis. They fill them in front of you as you order. We opted for the pistachio cannoli. It was light, airy, perfectly crisp, and the ricotta filling was decadent. I will miss this station the most. Next time I'm getting cannolis first.<br><br>We also got a lemon granita from the cannoli bar, and it was perfectly refreshing. I felt like a legit Sicilian. <br><br>And there's SOOOOOO much more. Just go!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/N1FThS0yvYjCuwyyeqBqEA/348s.jpg", "caption": "Lemon Granita and Pistachio Cannoli"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TAJKyWpBQcJJWFLlCjRaHA/168s.jpg", "caption": "Lemon Granita"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/X9GAk4caD6yA1N5nR8_Pgw/168s.jpg", "caption": "Bruchette Trio"}]}}, {"review": {"des": "This review is specifically for the pasta station on the first floor!<br>I was pleasantly surprised to see that you can order a generous serving of Eataly's delicious, handmade pastas for $10-15! The counter is much faster and more affordable than its upstairs counterpart, the pizza and pasta restaurant. I'd highly recommend it for a casual yet filling and delicious lunch or dinner. Plus, you can get go across the way while you're waiting and order some beautiful desserts or gelato! <br>I had the fettuccine with ragu meat sauce. It was perfectly al dente and came with a piece of bread to dip in any leftover sauce. I'd definitely recommend that, or any of their other options-- you can't go wrong!", "pics": null}}, {"review": {"des": "Eataly's new seasonal pop up restaurant, BAITA features a menu inspired by the beautiful Italian Alps region. From the moment we arrived at the restaurant we were enticed by the clean and simple, yet cosy-cabin like atmosphere. <br><br>The menu consists of well prepared variations of formaggi, polenta, and gnocchi dishes. Some incorporates vegetarian ingredients vs. ragu. <br><br>We certainly noticed the absence of tomato based ingredients which speaks to the authenticity of the Alpine culinary experience.<br><br>Excellent service received.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fzLdkkFXdaU-lEUifDOzZg/348s.jpg", "caption": "Ambiance/ décor"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CbqN0wDYte1GfvRLakgjDg/168s.jpg", "caption": "Arancini Di Funghi E Tartufe"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RdTvSVVj2v4wF1MzJEpEAw/168s.jpg", "caption": "Gnocchi Di Patate Con Ragu Di Vitello"}]}}, {"review": {"des": "LOVE LOVE LOVE this Italian market. The number of choices of quality foods, restaurants, and wine well exceeded my expectations. This is the only place I know of that sells my favorite Loacker Vanilla Wafers as well. I wish this market was ubiquitous in the United States.", "pics": null}}, {"review": {"des": "Pros: Oh Eataly, my Eataly, where do I find the words to express my love for thee. This is possibly my favorite place in all of Chicago, they have GELATO, fresh pasta, fresh fish, a ridiculous array of beautiful desserts, all the wine my little heart can handle, chocolate, fruits, nuts, breads. I just can't get enough. I had the walnut pesto dish for dinner and it knocked my socks off! So delicious! Their desserts are everything you want them to be and more. <br><br>Cons: That I don't live right next door.", "pics": null}}, {"review": {"des": "Eataly is the best! I first went to the one in NY many years ago and was so excited when this one was built. I've been several times and always had a great experience. The ambiance, the food you can take home with you or eat there in the restaurants, the wine and beer bars, everything is great! I could spend all day there.", "pics": null}}, {"review": {"des": "It's a good thing and a bad thing that our hotel was around the corner. Good because this place is so good. Bad because this place is so good! Everything you want in the way of Italian food and drink can be found here. Get yourself a nice glass of wine to shop with but browse first because you'll want to sit down at one of the many restaurants here to stuffa yo face! <br>Pasta, cheese, wine, salami, antipasto, cooking tools, gift boxes, seasonal offerings. If you want it they got it and you should get it!<br>We are, we drank, we shopped and spent all of the monies here as you should. <br>Any time we are back in the area and have the time to hang out here it is definitely going to be on the top of my list for places to go. <br>When we decided to shop for wine we were also helped by super friendly and knowledgeable staff so don't be intimidated because they are going to guide you right in to what you need and hey, if it's not, it's still booze! Cheers", "pics": null}}, {"review": {"des": "Always a great time here. I feel like I'm here a lot but rarely do we sit down for dinner. My colleagues and I had dinner here last week, upstairs at the pizza and pasta section. The wait actually wasn't as long as advertised. Just put your name in and walk around or grab a glass of wine while youwait. <br><br>It's a bit crowded but the food is good and the service is ok. The mozzarella bar is interesting, not sure what we expected but it was fairly good. Cacio e pepe is always the right choice!!", "pics": null}}, {"review": {"des": "It would have been 5 if the crowds were smaller and. I could have seen more.  Interesting food <br>We got a couple appetizers to share.  The ham was so good on one we brought some home.  <br>What fun !", "pics": null}}, {"review": {"des": "I went to Eataly as a 4 pm \"snack\" with my mom and sister as we were approaching hangry status and it was AMAZING. We sat at a table on the second floor and ordered a burrata, marinated tomatoes, a margherita pizza, the \"gamberetti\" and some drinks! <br><br>The burrata was super creamy and a little salty (in a good way) and the gamberetti were grilled with tomatoes and squash and had some nice crispy marks. I ordered the peach Bellini and whichever the cheapest glass of wine was ($11) and both were amazing. <br><br>The food was fantastic, but I had to take a star off because the pizza was burnt on the bottom. The service was also not impressive. To be fair, it was a Saturday afternoon, but they totally forgot to bring out the marinated tomatoes and they brought out the burrata way before the bread basket, so we had a beautiful ball of burrata staring at us and nothing to eat it on. Definitely on the pricey side, and I felt the food was worth the price, but the service was not so much.", "pics": null}}, {"review": {"des": "It was my first time at one of these locations and I thought this place was really neat. I spent most of my time on the first floor where there was a grocery store, a booth to order coffee, one for gelato, fresh pasta, and another one for pastries. Next time I'd love to try the pasta, but I had an espresso macchiato and a traditional tiramisu. I also bought a glass of red wine from the vino stand. The staff at every booth were helpful and knowledgeable about their products. <br>The seating is plenty but it does get busy. The noise is average to loud- and there are gender neutral restrooms.<br>I also checked out upstairs which had more dining options and a bigger restaurant. <br>I think Eataly is a cool dining experience and a way to sample many tasty items.", "pics": null}}, {"review": {"des": "I've been 3-4 times and the biggest problem is the crowds make it almost impossible to get anything other than the quick service stuff like coffee, crepes, gelato, etc. The rotisserie meats are excellent and it is possible to get a quick sandwich but they stop serving those early in the evening.  As to anything else to eat on the second floor, good luck, I've never seen an open seat any of the times I've been there. <br><br>Bottom line, okay food (but really not great by Chicago standards) and terrible crowds unless you're there during non-peak hours (I'd say weekends are peak all day and night). Good for the tourists I suppose, but not much else. I've learned my lesson and won't bother going back again. As good as the prime rib sandwich is....", "pics": null}}, {"review": {"des": "Super cute date spot! If I lived here, there are so many options to bring your date too. Cute little decors everywhere!<br><br>We wanted something small and light, so we grabbed a passion fruit sorbet. OMG it was so yummy. Sour and sweet, yet so refreshing! And the pistachio canoli was a first and our last. It was nice to try something different, it was a nice hint of pistachio and very cheesy filling.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KxL3pVmzcmTB5mahRbQt-A/168s.jpg", "caption": "passionfruit sorbet & pistachio canoli."}]}}, {"review": {"des": "Italian food heaven!  <br><br>You can come here to get the perfect ingredients for the perfect Italian dinner, or have an espresso with friends before starting the day. They have great gelato and \"Frosé\"!!  Ask for a sample. You won't regret it. <br><br>There's fresh and cured meats, fresh pasta, breads, sauces, pizza and soooo much more. Have lunch here if you are having a hard time deciding when you're in the area. <br><br>I'm hoping they build more of these around the country!!  We need them!", "pics": null}}, {"review": {"des": "Go for the market and the almost museum-like beautiful tribute to Italian cuisine and wine! As a food spot, I was admittedly disappointed. We had a prime rib sandwich (too fatty for me but Brian liked it) and I got gnocchi pomodoro that I was super excited about... And the pasta was overcooked in a sort of generic, \"ok\" sauce. We had two yummy glasses of wine, took all our items to one of the cafeteria tables are ordering and waiting for them all separately. The meal cost $75. It just wasn't that level of an experience for the price.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3sNoXXZXfag7boGL69dxfw/348s.jpg", "caption": "Prime rib sandwich (a little fatty for me, but the olive oil drizzle on the bread was a great add) and white wine greens (good, not great)"}]}}, {"review": {"des": "My friends came here their last visit to Chicago and they were excited to come back and bring me here. We met up with another couple we knew. We sat at a long table and ordered lots of dishes to share. <br><br>To start with we had their tap water which had a very strong chlorine smell so we opted for bottled water. Than my friends had red wine and I chose a Proseco instead. The charcuterie board was delicious with a large variety of cheeses and meats. The fried calamari was very good as well. Now the freshly made potato chips and dip were the best as well as addicting. The pizza bread would have liked it better if it was thin crust. But than Chicago does not know pizza like NY. <br><br>An enjoyable evening made special by the company more so than the limited service. But no one starved nor went without a drink. Would definitely return on my next visit to Chicago.", "pics": null}}, {"review": {"des": "This place is awesome!<br><br>It's a 2-story mix of an Italian grocery store/cafeteria. The prices of the products can be a little pricey, and the price of the parking garage can be expensive (~$30), but this place is pretty cool for out-of-town visitors.<br><br>The \"frosé\" was pretty good, not too sweet and just the right amount of alcohol! Also, the cremespresso was delicious - smooth and packs a caffeine punch!<br><br>Please make one in Houston!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZSAOOUMaQSx9yUKm7OsZEg/348s.jpg", "caption": "Cremespresso!"}]}}, {"review": {"des": "Love the layout of this store. I have been there multiple times. Lunch was very good.<br>I have bought groceries. The meat and cheeses are fresh and delicious.<br>The staff are very knowledgeable about the products they are selling.<br>I highly recommend trying the tiramisu!", "pics": null}}, {"review": {"des": "Eataly is the best, come here now and stop reading this! I love this place, I wish they would bring one to Orlando. So far, I've gone to the NY and Chicago locations. This location is really nice and vertical. It initially didn't look very big, but keep going up! <br><br>The first thing we did was walk over to the cannoli station. We always order the pistachio filling. It did not disappoint. We ordered a set of them, not sure how many that was, but they were the best. These are the best canollis that I've ever had in my life.<br><br>There are several good dinner choices as well and also a gelato booth. You can grab some Italian groceries on your way out. The prices on the groceries seem a bit high, but it's a niche product. There is a chocolate station with various types of chocolate candies. That is worth a visit, there are several tasty options.<br><br>This is really a great place to visit, I'll go again here in Chicago, or any other city I visit that has one.", "pics": null}}, {"review": {"des": "I was staying near Eataly and decided to check it out after lunch one day. I have a big sweet tooth and this place was heaven for someone like me. There was so much variety of pastries, chocolates, truffles and gelato (to name a few), that it was a little overwhelming at first. So I decided to try out the gelato first, tried a few flavors and settled for the chocolate one. <br><br>I have never had gelato this good before. It was so smooth, creamy and the flavor was deep. My son who hates chocolate flavored ice cream, wanted to just try it at first and ended up ordering another one for himself, it was that good. <br><br>I later returned that evening (and the following day too, yes it was that good!) tried the flourless chocolate cake (so good!). It had an intense chocolate taste and was dense but not dry at all. The next day I had the chocolate caramel mousse. It was light as air and as smooth as silk but packed a powerful flavorful punch. The prices were a little on the higher side, but so worth it. <br><br>Wish I had more time to try a few more things. Definitely coming here again, on my next visit to Chicago. Wish we had an Eataly in DC!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rfVIrt9hckEIjtqPhd8kTw/348s.jpg", "caption": "Cold brew coffee from the Eataly"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qlqBeclAqgs1ZQmZtoGCeg/168s.jpg", "caption": "Flourless chocolate cake"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EJi4Q5xy8pc-VMvd9i7fRA/168s.jpg", "caption": "Dessert came in a cute little box"}]}}, {"review": {"des": "Now I had never been to this location or the one in NYC. I  was told the one in NYC is much bigger though.  We ended up coming here later in the evening when we were trying to burn some time before our dinner reservation.  Well I'll tell you what, time absolutely does fly when you are in here.  They have so many things to look at, you really don't want to leave!  <br><br>You start at the lower level where you will find tons of snacks, chocolates, utensils, and a random assortment of many of the other items they sell. My wife got stuck in the chocolate area for a while actually. The cool part is that a ton of their stuff is actually imported from Italy.  You then can make your way upstairs where you will find tons of mini restaurants, shops, and bars to boot!   There is also more random stuff to buy. I ended up walking out with a ton of chocolate, some bbq sauce, and even some avocado mayo...I know...I'm weird.  There are many other things you can pick up there though.  I recommend planning quite a few hours when you decide to come here.  That way you don't have to rush and can just enjoy the atmosphere.", "pics": null}}, {"review": {"des": "My husband and I went to Italy in September and I felt like a kid in an Italian candy shop when we went to check out Eataly. Celebrating was in order after a success inspection on a house we want to buy and splitting a carafe of Prosecco hit the spot. My lasagna al forno was alright but my husbands prosciutto ravioli was bombbbb. I couldn't think of a better \"welcome to Chicago\" than walking around and enjoying amazing food at Eataly!", "pics": null}}, {"review": {"des": "It's a bit smaller than other Eataly spaces i have been to but very nice looking food courts upstairs. It reminded me of Europe, nice little bar area where you can grab some wine and some appetizers. They put nice xmas decoration starting in November also. But the waitress/hosts are rude, and if you make a reservation for a group, they dont let you sit down unless the entire group is there, present.", "pics": null}}, {"review": {"des": "Well worth a visit. <br><br>They're open late (10pm) and there's no admission to see and eat from two levels worth of different, unique, and interesting foods imported and influenced from Italy. Perfect for those Italophiles. <br><br>Went with their classic margharita pizza ($15 from La Pizza & La Pasta). The mozz was creamy, the crust had a nice char with a nice bounce, the sauce of san marzanos had a pleasant acidic sweetness. Solid.   <br><br>Lots of cool people watching. Great for groups, great for people traveling solo. If you like the Ferry Building in SF and Chelsea Markey in NYC you'd probably like Eataly.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LacUOD8Cq2tkfsg5Ah8Tjw/348s.jpg", "caption": "Italian import"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/l3b4qrFRi_oO0j83e3Gifw/168s.jpg", "caption": "Tasty"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3312h9Eq_LHa_sBUdwe5wg/168s.jpg", "caption": "Life is too short to not drink well"}]}}, {"review": {"des": "I absolutely love this place!! I had two friends in town and we had THE best time exploring tho place together & then finishing up the evening at the restaurant upstairs, SABBIA.  <br>The fried rice balls, wine, and service were the highlights for dinner. The salad, olives and bread were so incredibly fresh.  <br><br>I can't wait to go back!!", "pics": null}}, {"review": {"des": "I haven't eaten here in while, but I had some time before a movie. I was going to get a glass of wine but on Friday at 4 they had samples! 3 areas of Italy had wine samples, and I went to each one! I am not a big prosecco fan but this one was pretty good. ( Filo Dora)<br><br>I also had some of the loose chocolates, very good! <br><br>I want to visit Italy next year so I will make certain to take several trips here in the next few months.", "pics": null}}, {"review": {"des": "Love this place! we had visited the NYC one so we had to visit this one too while visiting Chicago. It did not disappoint! All the food options are get we tried the dessert counter it was so very good and very fresh. The options for Italian groceries are so big lunch meats and cheese too. I also got a bottle of Limoncello! Wished we lived closer!!", "pics": null}}, {"review": {"des": "Omg the squid ink pasta was amazing! I felt like I was eating the ocean. Not too heavy, was perfect! I am definitely coming back for more. There pastries was divine... ugh I love it", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Cmv-JJ3dy-AvfujppqKs1A/348s.jpg", "caption": "Omg!! This pasta is to die for. You can really taste that seafood , ocean taste. It was just really good!"}]}}, {"review": {"des": "What a trip! This store is giant and has so many different sections: Cannoli bar, Gelato bar, pastries, chocolate, 2 cafes (one upstairs, one downstairs), wine bar, separate pasta and ravioli making bars, pizza, bread, separate meat and cured meat bar, cheese... Etc. There was so much to explore! The cappuccino is good, also the basil(!) Gelato was so good and of course hazelnut. I didn't think much of the mini pastries they had (4 for around $6). I came here after hours but I would love to come here when all the stations are in action. So much fun!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7en2d7tmn184FjcJTUan0w/348s.jpg", "caption": "Basil!! And hazelnut Gelato. The basil was actually shockingly good"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iQu5WTOi9VHJUzyd-jVjOw/168s.jpg", "caption": "Romanesco!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XJoZrfxRthvy7l6rBR1Vqg/168s.jpg", "caption": "Box of 4 minis for about $6"}]}}, {"review": {"des": "Eataly experience was just ok, but I gave it 4 starts for the gelato and the grocery sections. The layout was very overwhelming and most of the restaurants were closed at 130 pm on a Monday.<br><br>We ordered a mozzarella platter with basil pesto, artichoke, and roasted tomatoes. All were amazing, but I would expect to pay $12 for the amount of food- not $18.<br><br>We also got the 3 prosciutto platter. I wouldn't recommend it as the prosciuttos were all pretty bland. <br><br>The gelato was delicious! I recommend the dark chocolate with raspberries! Or the bergamot for a more unique flavor.", "pics": null}}, {"review": {"des": "Such an amazing experience.  It might be touristy, but there is seriously so much to do and see if you love Italian food.  There are 2 levels to explore and you can get anything from pizza, pasta, gelato, cake, and coffee, to snacks, kitchen ware, and dried goods.  One gripe I have is: they need more restrooms!  Haha", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/A2k865bu12j7H-p0QXsMDg/348s.jpg", "caption": "Shakerato from Lavazza"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/O61BoJIC0c8jKOagRH8IvA/168s.jpg", "caption": "Cremespresso from Lavazza"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/A6ajtcD8FouZ4kDpU5uA2w/168s.jpg", "caption": "Quadratini al Prosciutto from La Pizza & La Pasta"}]}}, {"review": {"des": "I love coming here. The atmosphere is infectious and I feel like a kid in a candy store. I love the gelato on first floor and find it hard to pass up every time I'm here. Second floor dining can be quite a wait on weekend evenings. I feel like there's definitely better pasta in the city for the price but it's a different kind of ambience dining in a specialty food store. Also, service here isn't the best, waiters tend to be forgetful.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8ysmBYEd_FpMCrnN_VCRaQ/168s.jpg", "caption": "Squid ink pasta"}]}}, {"review": {"des": "We came here for the gelato (really good by the way) and ate at the restaurant upstairs. Bf had the beef tagliatelle and i was very surprised with the amount of meat the dish had. I opted for a spinach ravioli, add spaghetti sauce on top. My ravioli was decent, it was too al dente for my liking but I would order the tagliatelle if we come back. Portion sizes were good, they offered some bread and our entrees filled us up.. unlike Quartino's the night before. <br><br>We didn't get a chance to try their coffee or anything else but I like how they have pastries and other goodies downstairs and upstairs are restaurants and pasta/ olive oil and other stuff that you can buy. Can't wait to come back!", "pics": null}}, {"review": {"des": "What dreams are made of. I didn't really know what Eataly was before coming here. I thought it was just a typical Italian restaurant but it's actually more of a market  for all things Italian. First of all it's gorgeous inside. Well lit, bright, and beautiful. They have a section for everything: crepes, coffee, pastries, gelato, charcuterie, pasta, pizza, paninis, wine, and a little veggie market area. I literally spent over an hour looking at everything and a good amount of time eating! <br>The charcuterie boards are amazing. I got one both days I came and they are beautifully presented and even better tasting. Each glass of wine I had was also perfect. <br><br>I wish I lived nearby so I could come all the time!", "pics": null}}, {"review": {"des": "Came by before a flight out and wanted some solid Italian that wouldn't break the bank and that my tween might like as well.  This place was perfect for a quick nosh -- above a fast-casual, but less than a full scale Italian. We ate at the Pizza and Pasta place and loved the tagliatelle with veal. <br><br>Add to that a great glass of wine (sangiovese) and even some simple bread and it was a great little meal.  And then there's the rest of things to get -- yum!", "pics": null}}, {"review": {"des": "One of my favorite spots in the city! Whether I'm craving gelato, a nutella crepe, or prosciutto - Eataly is my go to. Everything I've had here is delicious. <br><br>The location is great! I usually come here after shopping, or before/after a movie date. I haven't had a negative experience, and I love bringing my family/friends from out of town.", "pics": null}}, {"review": {"des": "Yum! A great stop for delicious Italian food at good prices. I wish I was staying at an airBnB with s kitchen so I could try some of the packaged sauces and pastas! I loved the dessert place with lots of vegan or gluten free treats (not many were both GF and vegan). I love tiny desserts so you can taste a variety. This would be 5 stars if they had more lunch selections, particularly GF. there are just so many great Italian places, and I much prefer the French Market for the food hall experience.", "pics": null}}, {"review": {"des": "Eataly in NYC is one of my favorite places, so when I noticed they had one in Chicago, I had to make that my post half marathon lunch. It's an overwhelming space, even when you know where to go. I love the pasta area and ordered a cheese ravioli with butter sauce. It was rich and delicious. I didn't have room to shop and bring anything back on the plane, but it's a great place to go.", "pics": null}}, {"review": {"des": "There is a lot of review here. I'll just touch on my favorites and dislikes. <br><br>Dislikes: <br>Breakfast: <br>- Been here a few times and attempted to get a breakfast sandwich. Waited in line for 10 mins and got to the front of the line 5 minutes before they stopped serving breakfast and was denied. <br>-Lavazza coffee is just okay. <br><br>Prime Rib sandwich- people rave about this sandwich, so I was excited to finally try it. Wasn't super impressed. It's just prime rib meat, bread and olive oil. Meat was good, bread was good, but I like a sandwich with a little bit more to it.<br><br>Pizza/Pasta- This part of the restaurant was great food and wine wise (service- not so great, but they were slammed, so I get it). <br><br>The Mozzarella bar is amazing. Definitely do this and pair it with the Prosciutto. <br><br>Agnolotti was better than Tagliatelle.", "pics": null}}, {"review": {"des": "Very interesting place to eat and shop for locals and tourists. Italian to the fullest, this place has 5 restaurants as well as a market and more. It's very bright and welcoming. We were greeted and given a map on the way in. We hit up some pizza and fresh mozzarella!<br><br>Worth an afternoon trip!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jbKRbPfang0osS_KROI-lQ/168s.jpg", "caption": "Olive and artichoke pizza."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BFnXP2W9W5DCqh5fyNmBKw/168s.jpg", "caption": "Enjoying some meats and mozzarella!"}]}}, {"review": {"des": "Eataly LA is way bigger and way better. Can't go wrong with the gelato though. Much more compact than LA, less restaurants, pizza bar is hidden and a bit tough to find. Wish I had more time to spend here so I can sit down and get a better feel for the vibe.", "pics": null}}, {"review": {"des": "CA Residents here.  This spot was just so overwhelmingly amazing.  You need a half a day to explore this amazing place.<br><br>It really is a central hub for all italian items.  So many authentic items that you cannot get locally.  Enjoy just walking around and seeing all the produce and items.  From wine to sweets to even coffee its all here.<br><br>The restaurants are another topic.  Theres a bit of everything for your taste buds, you really cant go wrong.  The food was just amazing and all so well cooked.  You know youre going to get quality dishes when ordering at any of the restaurants inside.<br><br>PROS: Quality food/items<br>CONS: PACKED almost all the time<br>OVERALL: would i go here again? You betcha!", "pics": null}}, {"review": {"des": "This is the cutest grocery store/food court I have been to. There are so many meal options with stalls downstairs and more traditional sit down places upstairs. I came here on a Friday night and boy was it crowded -- luckily there is a ton of seating space and we had no problem eventually finding a place to settle down. <br><br>For dinner, I had this amazing ravioli from the first pasta booth to the right when you enter. I can't remember the name of the restaurant and the pasta's name was written in Italian, but it was a ravioli with spinach and ricotta cheese topped with tomato sauce and parmesan and it came with two garlic/olive oil dipped bread slices. It sounds like a really simple, basic ravioli but it was so amazing. There was so much flavor in each ravioli and the serving was just right. The price was a little over $9 but I think it was worth it for freshly made pasta. I partnered my pasta with a rosé I had purchased from the little wine standing booth right by the front door. I noticed a glass of rosé at the booth was $7 compared to the  $11 glass that was being sold at the same stall as my pasta. <br><br>After my entree I had gone to the dessert corner and ordered two scoops of sorbet (lemon) /gelato (rasberry). It was the perfect refreshing finish to my meal! It cost $5.80 for the dessert in a cup and it was good enough to share with my sister. <br><br>Overall, I had a really pleasant experience at Eataly. It was walking distance from my hotel and everyone in there just seemed to be having a good time. Definitely highly recommend to all tourists and locals alike", "pics": null}}, {"review": {"des": "I will say, when this place first opened it was all the rage - super long lines at all the restaurants and you could barely browse the shelves without running into someone. After a couple years, interest waned and I never had trouble getting a table upstairs at one of the restaurants or even downstairs at the gelato/coffee place. I was a bit worried about the place to be honest (let's face it, restaurants in River North can close in the blink of an eye) but after visiting recently, was very impressed with their new restaurant Sabbia, which replaced the two restaurants upstairs, La Piazza and Il Pesce. <br><br>Perfect for a date night, Sabbia was a refreshing Italian restaurant with a seaside theme. Think froze, rose and a caprese bar. My fiance and I had a great time before heading across the street to AMC for a movie. We went on opening night (which was a Friday) and didn't have trouble making a reservation day of. <br><br>In terms of getting there, I would highly recommend Uber if you can. Driving + parking + Michigan Ave is probably your worst nightmare. To sum it up - check out this place if you can! By far my favorite restaurant in Eataly.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2muAoEZwjQghBfa2vqNqhQ/168s.jpg", "caption": "This cheese plate = flames"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BZ28EhVJeRSfJDAp2ZNblQ/168s.jpg", "caption": "Caprese bar was delicious"}]}}, {"review": {"des": "My wife and I have been to Eataly several time, with many great experiences.<br><br>Saturday November 10th was not one of them.  We chose to eat at the La Pizza & La Pasta.  The crowd was larger than usual, and we expected to wait.  We were told about an hour to get a table.  We agreed and explored the store, sat to rest our feet. Once the hour was over we made our way to the host stand.  We politely asked, where we were in line.  We were told, by one host, about 15 minutes.  That passed, asked again and told at least an hour.  I found the person who looked like they were making decisions on who sat next and asked.  I was told 15 minutes max.  That passed again and it became clear everyone around us were getting the same answer.  Another host saw my frustration and told us she would get us in.  Well, long story short, it was over two hours to get a table.  A manager did come and apologize and got us free drinks, then never check back with again.<br><br>If we were told 1 - 2 hours for a table we could have made the decision to stay or go elsewhere!!  <br><br>It will be some time before we head back.", "pics": null}}, {"review": {"des": "Finding this little gem behind our hotel was exciting. We have one close to us in Boston but I have never ventured out of the north end in Boston to travel to it. Glad I had the opportunity to try it and now won't be so hesitant to try the one closer to me at home. Tried a Bellini- a cannoli- a scoop of gelato- a ravioli dish and a Caprese salad all from different little spots in this cute open indoor marketplace. My only gripe is that I wished I had a full kitchen in my hotel because  I would've loved to have pieced together the perfect meal to cook up at home.", "pics": null}}, {"review": {"des": "This is one of the world's most famous \"supermarkets.\" It's a food emporium and the shelves are stocked with plentiful choices of produce from region and country. I'm talking pastas, cheese, deli meats, wine, cookware, anything you'd possibly want in your kitchen to create a romantic and dreamy Italian meal, this place has it! <br><br>Beyond the \"supermarket,\" you can also dine in on pizza, pasta, seafood, and gelato. There are two floors. The bottom floor serves gelato and some pastas, and upstairs serves flatbread pizzas and seafood. Upstairs has more of a formal dining sit down area, and that is where my bf and I ate at during our first night in Chicago! Osteria di Eataly. The menu isn't complicated to navigate but for the price, we opted to their dinner set special which allowed us to choose an appetizer, a pizza, and a pasta for $45. We chose to have the mozzarella appetizer, a margarita pizza, and the cavatelli, which was a tomato-braised pork with hand-pulled mozzarella and hand-rolled cavatelli pasta. Everything was so fresh and delicious, omg! I definitely enjoyed the cavatelli the most, compared to the pizza. The braised pork was sooo flavorful and the textures of everything was just right. The server was so kind and friendly too. Their ingredients were from local farms and they even quote it in the menu, and after tasting their food and seeing the workers make the pasta, I believe it. <br><br>After eating at Osteria di Eataly, my bf and I walked around and bought some wine and even walked over to the deli guy and had him pair some fresh prosciutto di Parma and cheese for us, and it was simply delicious! <br><br>I wish there was an Eataly closer to me, but they are currently in NYC, LA and Chicago. I feel like I was only able to taste a little of what they had to offer and I can't wait to come back! I have to try their gelato and their pop up stores and their raviolis... until next time!", "pics": null}}, {"review": {"des": "Finally tried Eataly on a recent visit to Chicago. It's a fun place to browse for Italian goodies and, in the many restaurants inside, you can find just about any kind of Italian dish you want to eat as well. <br><br>Our dinner was delish, as was the gelato and my cappuccino. <br><br>We will definitely visit again!", "pics": null}}, {"review": {"des": "Love this place. It's like visiting the true Italy! Their food is perfection. Would definitely recommend making reservations before heading to eat here because theres usually a long wait. Service is ok but understandable due to how busy they are. Everytime I go I get the black pepper Spaghetti...it's only $11. & its the best thing on the menu for me. Must try.", "pics": null}}, {"review": {"des": "When visiting Chi-town we always walk by here on the way to somewhere. Tonight in the rain we stopped. What an awesome place. It's everything Italian from the canned truffles and slicers to the many wines, pasta varieties, sauces, cheeses, meats.....Whoa!  Too much Italian goodness to mention. Enjoy the wine, coffee, gelato and cannolis, all at bars, so short wait times. Stop to eat in the huge food area, or grab something to go. A fun place to hangout by yourself and with a group.", "pics": null}}]}