{"name": "eddie-vs-prime-seafood-and-steaks-chicago", "reviews": [{"review": {"des": "I went to this restaurant for dinner on a recent business trip. <br>The atmosphere is awesome, there was a 3 piece band playing music for the evening entertainment. We snagged a booth with the help of our hotel concierge. <br>Dinner started off with appetizers: steak tartare prepared table side. It was rich and definitely the way to start a nice evening. <br>I opted for salmon, my colleague went with the sea bass. Both entrees were outstanding! To round out the meal we chose the signature lobster mashed potatoes as our side. Words don't do justice for these potatoes. Generous chunks of lobster tail and a creamy sauce on buttery whipped potato....simply delightful. <br>I definitely recommend this restaurant and plan to return when I'm in the area again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TkJwBAS59AcEwC3aSNSBhQ/348s.jpg", "caption": "Marinated salmon with veggies and corn succotash"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/h43TiN4KWt2jy4lCWeiXNw/168s.jpg", "caption": "Steak tartare"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BSvldqHQDgelfPRSr9VULQ/168s.jpg", "caption": "Chilean sea bass"}]}}, {"review": {"des": "This was my 3rd time coming here as I stay next door at the Gwen hotel often. Came with some work buddies. We started with the calamari, crab cake and ahi tuna. All very delicious. The calamari is more than enough to share with 4 people. The crab cake has a nice crispy crust with a generous amount of crab meat. <br><br>We shared main courses, I opted for the trio of indulgences with the stuffed shrimp, lobster tail and scallops. Hands down, the lobster tail was the best. Others had scallops, crab legs and a filet. Everything was good but the lobster was definitely the star. Steak was a little overcooked. We also got the lobster mashed potatoes and crab fried rice. Both out of this world great! For veggies we shared the wedge salad. <br><br>For dessert we got sorbet, bananas foster butter cake and creme brûlée. All very good tho we couldn't even come close to finishing.  Service was great. Will definitely return.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3yjM7iH6rntfCcalaDCxXg/168s.jpg", "caption": "Bananas foster butter cake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/l2GtgOCrij3QQNFPks5WYA/168s.jpg", "caption": "Crab cake, calamari and ahi tuna tartare"}]}}, {"review": {"des": "Went for a birthday party as a group of 11, we had a reservation, and were appropriately dressed (didn't realize there was a dress code expectation in advance so just lucked out).<br>Evening started fine but the wait staff seemed visibly annoyed when we declined to order cocktails (we ordered several bottles of wine) and service seemed to just decline throughout the meal from there.  The food was decent for the price, but be prepared for a la carte items so you'll need to order sides separately.<br><br>Overall, feel that there are better upscale places in Chicago, and this place is a bit too up tight in an attempt to be classy.", "pics": null}}, {"review": {"des": "Had a lovely dinner here the other night. Warm and comfortable, classic ambiance that reminded me of many wonderful times from decades ago -  candelight everywhere, and friendly, efficient service. We arrived very early at 4pm and found that the full menu is not available until 5. But we did quite well until then with the happy hour and other items that were available.<br><br>Fresh, plump oysters came with a choice of sauces. Hearty bread was hot from the oven; butter, nice and cold but not rock hard. The butter came served in a charming little rectangular dish but was kind of small for two of us; we asked for more, and it was readily provided. Caesar salad missed a beat in richness of the dressing but was still enjoyable. <br><br>Just before 5 pm, we ordered our dinner items. The crab-stuffed shrimp were excellent. Companion's crab-fried-rice was overly salty, but the tiny bits of crab sprinkled atop it were delicate and tasty. The dessert of mixed berries and whipped cream was exceptional - generous amounts of very high quality fruit with a pouf of lightly sweetened whipped fresh cream. Together with bites of my friend's sherbert dessert, and for each of us a delicious dessert wine, the meal end was more than pleasing. And the very professional and talented jazz trio playing classic tunes made the evening even more enjoyabe.", "pics": null}}, {"review": {"des": "I absolutely LOVE this restaurant! The food and service is impeccable! We walked in and were greeted and seated immediately. <br><br>I ordered the 8oz filet mignon and as always it was amazing! Cooked to perfection, tender and with such an amazing taste! Yum!<br><br>You MUST get the butter poached lobster mashed potatoes! They are great and a perfect addition to your entree! Love the texture of the lobster and the mashed potatoes.<br><br>We also ordered the corn as a side. The corn was pretty good, maybe a bit salty but great otherwise! The side portions are pretty large, and can easily be shared amongst people.<br><br>I wish I could come here every weekend! Definitely looking forward to returning!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vOXXGt5v_oJNfiphECg4_Q/348s.jpg", "caption": "Corn"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ByfKoP6R0Q11VXhPwQtR0w/168s.jpg", "caption": "Butter Poached Lobster Mashed Potatoes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iGibGaZ0vPZkDNSrOfK-gg/168s.jpg", "caption": "8oz filet mignon"}]}}, {"review": {"des": "I really wanted to give it 5 stars and there is no 4.5 so I am stuck with 4 stars. This is only my first time here, so I will come back again and check it out with the regular menu. I was invited to a group gathering and the appetizers were wonderful. They served us their version of popcorn shrimp but it was not just pieces of shrimp, but it was a medium sized shrimp with an unassuming sauce. Then the steak skewers came out, but I don't like my meat well done and there was no pinkness but it was tender although very dry. <br><br>I forgot the name of the beer the waiter served me, but it was similar to Blue Moon that I like so it was nice and citrusy. <br><br>We had a choice between Crab & Corn chowder soup, classic Caesar Salad and a Wedge Salad. My husband loved the soup and I chose the Wedge was perfect for me. It was 1/4 wedge with their own homemade blue cheese salad dressing, cherry tomatoes, 2 large slices of bacon crispy, and big chunks of blue cheese. I would opt for the dressing on the side, because they overwhelmed my plate with dressing. <br><br>There was a choice for Swordfish, Salmon, Chicken, Filet Mignon, or Miso Tofu and because I am not a fan of steak-like fish I went with the Filet Mignon. The waiter stated it would be served medium rare, but they must have left it on the plate too long because it was well done for me. The sides were so terrific though, I ate the asparagus, brussel sprouts and really really loved my truffled mac & cheese, but their fresh crabmeat fried rice had too much soy sauce to a true Asian. I do like that they had fresh crabmeat in the fried rice though. <br><br>I didn't have time for dessert, because it was already past 9pm by that time and I was too full, but the Banana Foster buttered cake and Dark Chocolate Smores sounded so good, I will return.", "pics": null}}, {"review": {"des": "This place is Amazing!  As soon as I walked in was hot with the sweet sounds of live music.  Can't get a better location, Rush street in Chicago.  A man a guitar, and a woman on a piano.  Me and a group of five, huddled up at the bar waiting for the rest of our group and had a cocktail. The Old fashioned was very nice. <br>  <br>Once we were seated, the best server in town came over.  He recommended The Shellfish Tower, enough for seven.  It consisted of Maine Lobster, Jumbo Shrimp, Oysters and Jumbo Lump Crab.  <br><br>I asked the amazing waiter his name.  He said, Nick unless you're writing a bad yelp review then it's Tim.  A chuckle from the whole table.  <br><br>Second Course & Entree<br><br>I ordered the Maine Lobster Bisque. Delicious, fresh Maine lobster, cream and cognac.  The chefs specials was African Lobster with thyme other spices cooked and served in a clay pot.  We had all the sides and passed them around enough to share. The lobster potatoes were very good.  I'll be circling back. Stay tuned!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fWUM564q4EhmXDWbCejn7w/348s.jpg", "caption": "Live Music"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SCNKGCauMW6UwQXICmc7Ug/168s.jpg", "caption": "Wine cellar"}]}}, {"review": {"des": "Wow, what a delicious meal! Came here on a Saturday night with a small group after making a same day reservation. The reviews were good so we thought we would give it a try. I am so glad that we did! The food was delicious and the atmosphere was cool and swanky without being pretentious and annoying. We started with drinks- try the 24 Karat if you like something sweet and fruity. The tuna tartare app was great and the crab cake was delicious! I had the swordfish entree which was extremely delicious. It had a citrus sauce that was unreal and was perfectly cooked. Another in our group had the sole which was also delicious and a great portion. A third had a scallop special that was very good. We ordered the sautéed spinach and potatoes au gratin on the side. The spinach was nice and garlicky with big Parmesan shavings and the potatoes were rich and decadent. The service was great and we all really enjoyed our experience! Give it a try if you're in the mood for delicious fish/seafood or a nice steak!", "pics": null}}, {"review": {"des": "I came here as a party of four on a Friday night.  We made reservations and I strongly suggest that you do too!  We walked in about 10 minutes before our reservation time and were promptly seated.  There was a nice live jazz band and singer playing in the lounge, and the music was pleasant but not over loud in the dining area.<br><br>There is a very nice selection of pre-dinner drink options.  And the wine selection is also quite impressive.  Plan to spend some money on wine, however, because their selections are not cheap.<br><br>Eddie V's is definitely heavier on the seafood options.  But there are good steak options, as well as other things.  Not the best place for vegetarians.  They also had some very nice specials.<br><br>The sides are served family style, so order for the table.  No worry, you'll find something good.  I hate brussel sprouts, but we ordered them anyway and they were amazing.  I mean really amazing.  Yep, Eddie V's the steakhouse, made me a fan of brussel sprouts.<br><br>The crab fried rice could have been crabbier, but it tasted amazing.  We also had the lobster tacos and the crab cake as appetizers.  Both were very good.  As expected, the steaks and seafood were cooked perfectly to temperature.  The deserts were also great.<br><br>You expect to pay when going to a steakhouse in downtown Chicago, and Eddie V's is no different.  But the service and food were on point in every way.", "pics": null}}, {"review": {"des": "Eddie V's has always been a great experience. I love going in on the weekend nights for the live jazz music. We went in during the week and the lounge was much quieter than a Fri/Sat. The service here is always great and Eddie V's has wonderful steaks. <br><br>I ordered a special, which was very good. It was 2 4oz. filets with lobster! We also ordered calamari, salads, tuna tartar, and oysters. All were wonderful.  <br><br>I can't wait to stop back the next time we're in Chicago!", "pics": null}}, {"review": {"des": "Eddie V's is a steakhouse specializing in seafood. It's known for being located close to the Mag Mile shopping district while still remaining something of a secret. It's well-regarded in the city and many visitors would have a hard time believing that it is a chain.<br><br>I've only been here twice. The first time was for a very special dinner three years ago. I remember being received respectfully when I arrived before the rest of my party and that being the gateway to a memorable night. Eddie V's should be a part of the same conversation as Shaw's and Joe's. If the restaurant was open for lunch it would be among my main choices when I dine with out-of-town visitors who are in the neighborhood.<br><br>The seafood menu here is extensive to the point that you're making a mistake if you order steak. It lacks depth and variety compared to the venerable steakhouses of Chicago, I've eaten the steak and it's very good, but when you see some of the fish come out you'll feel silly eating red meat.<br><br>This is a classy, sophisticated restaurant best saved for special occasions.", "pics": null}}, {"review": {"des": "I love love Eddie V's! This is now our favorite restaurant! Hubby and I went last night to celebrate our anniversary.  We were both blown away by the food, the wine pairings, the ambiance, and the service! <br><br>We were seated near the lounge - close enough to the music but far from chatter.  I love that they have a live band, very lively but not too loud. Our server Frank was awesome.  He is so attentive and knowledgeable. I followed all his recommendations and loved them all. <br><br>The food, oh the fooood, they were amaaazing. I got the fish special and hubby got the rib eye. I think it was sablefish that I ordered - it was divine! It was perfectly cooked and delicate with a seared crust. It's got avocado, crabmeat, and asparagus.  You think it's diet food but it didn't taste bland at all. It's possibly the best fish dish I've ever had! Will definitely get that again if they still have it. The ribeye was perfectly seasoned. How I've missed it and Eddie V's version is my favorite, more than RPM , Morton's, or Gibsons. The wine pairings were good too. I especially loved the albarino with my fish. <br><br>Not gonna lie, it is pricy. But it was SO worth it! Definitely will return!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fBCwnMD6hLh7xqP3GaQ1GA/348s.jpg", "caption": "Special of the night: butterfish with asparagus, avocado, and crabmeat"}]}}, {"review": {"des": "Like its counterpart in La Jolla, California, Eddie's excels on all fronts. Although they serve wonderful steak ... I had the bone-in filet surf and turf... the emphasis here is on seafood.  The shellfish tower is amazing and a bargain at $70. The Chilean sea bass and Dover sole are also delicious. <br><br>Unlike its 5-star west coast counterpart however, there is no view, it's somewhat too dark inside, the table acoustics aren't very good, especially with live music. It just did't work for us and we asked for the music volume to be lowered. For that, minus 1 star.", "pics": null}}, {"review": {"des": "Honestly, hands down my favorite restaurant in Chicago! I travel to Chicago once a month for work and the food in Chicago is friggin awesome.  Eddie V's was one I stumbled on while staying nearby. Everything is amazing! From the steaks to my favorite dish, the crab fried rice!!!! Oh man, soooooo gooood.  My fat girl definitely shows up to this restaurant because I want everything and I leave in a coma. The live music and excellence in service is truly an experience too. As a lonely traveler,  its a fun time to listen to music and have great conversations at the bar. Things to try: Maine Lobster Bisque", "pics": null}}, {"review": {"des": "I stopped in to Eddie V's for Happy Hour with a friend. As always, the atmosphere is top notch. Warm earth tones and soft lighting make the room inviting and comfortable.<br><br>The $8 HH wine selection was very good. We also tried a $12 specialty cocktail that was amazing. We shared the filet sliders and the fish tacos. There were 2 of each so it was perfect. We sampled the best Butterscotch Panna Cotta! Even at HH, the bring piping hot bread & butter.<br><br>Our server was quite nice and helpful. The busboy kept our water glasses full. The service was just as amazing as it is during regular dinner service.<br><br>Eddie V's is a great alternative to casual pub & bar bite Happy Hour options.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vNr3wcs-bMQUqhEhy0WBiA/348s.jpg", "caption": "Butterscotch Panna Cotta!"}]}}, {"review": {"des": "Well Eddie V's is 4 for 5 . We ate in SanDago would rate it a 90 out of 100 an we ate in Chicago , two of the 3 times were 100 of 100 but the last time we ate there it was 80 of 100 ! We had a new server an he ran out of gas in turn three!!! Just did finish well. I still say Eddie Is one of my top three in Chicago !!!", "pics": null}}, {"review": {"des": "The best thing about this restaurant is the wonderful bread and butter. The food is below average but pricing is very high for overdone shrimp and steak. Both times I dined here my food was subpar and the butter cake they rave about was so dry I left it on the plate.", "pics": null}}, {"review": {"des": "Simply amazing. The food was delicious- we started with the Iceberg BLT salad, chilled shrimp and bone-in ribeye with asparagus and au gratin potatoes. Beyond the food, the service was nothing but spectacular! And frankly if the food was even less than perfect, Eddie V's would still get 5 stars from me!  Thank you for helping me celebrate my husband's birthday! We will be back!!!", "pics": null}}, {"review": {"des": "The Chicago Restaurant Week 2018 menu was astounding. $33 at dinner, possibly the best value in the city! My Denver homie was in town so we stopped in about a half hour from closing on a snowy night, the last night of CRW18.<br><br>To start I had the deliciously spicy and sweet Crispy Salt and Pepper Shrimp which are battered and wok seared with a spicy sweet soy ginger sauce and vegetables.<br><br>We both got the 8oz filet, mine a sensible medium rare, my friend's *unmentionable!* Sorry, Benny's Chop House, but this trounced your filet medallions I had earlier with a Yelp pal for CRW18 lunch. Yep, this was a \"two filet...kind o' day!\" Ultra tender, cooked perfectly and seasoned just right, this 8oz round cut of filet was superlative!<br><br>Sides included the great texture and taste brussels sprouts with bacon and shallots and sinfully rich au gratin cheddar potatoes.<br><br>Dessert was interstellar, bananas foster lit up table side, OPA! Oops, wrong culture. It was the huge non-Restaurant Week portion because this being the last day of RW, they'd run out of the smaller portions. How nice. The gluttony of it!<br><br>Service was exemplary and the sauvignon blanc was sparkly and pear forward and priced right. The live music band with piano singer, double bass and drums was jazzy and cool.<br><br>Prices on the regular menu were on par with other good steakhouses around town and no doubt I'll be back to patronize 'em again and support their business at full price. Thank you!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lKq4e7TcZcIk5-Y9Zos2pw/348s.jpg", "caption": "Spicy shrimp app (Restaurant Week 2018)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yDC8aGx3lg5RYhoI8jhIzw/168s.jpg", "caption": "8oz filet mignon (Restaurant Week 2018). Perfect mid rare and oh so tender!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Zuj8V5t8L5H9CSk-tJdXyQ/168s.jpg", "caption": "Bananas Foster Butter Cake, sweet and gooey and rich and unreal! Still on fire!"}]}}, {"review": {"des": "Excellent service, ambiance and delicious food.  Our waitress, Ali, made the experience memorable.  Knowlegeable, friendly and bubbly.  A real gem.  Any restaurant would be lucky to have her.  <br><br>We were in Chicago (from Sacramento) for a few days before heading to Green Bay.  We shared all plates which was more than enough.  Started with Kung Pao Calamari, which was different but very good, a house salad, and the chef special...beef medallions with lobster claws.<br><br>I will definitely be back.", "pics": null}}, {"review": {"des": "Came here to celebrate my friends birthday. We got a seafood tower and split a steak with asparagus and truffle Mac&cheese. The food was beyond delicious and was presented perfectly. Portions are pretty big so I would definitely get few dishes to split. Also, the service was top notch as our server was very knowledgeable and attentive!!", "pics": null}}, {"review": {"des": "I love Eddie Vs! I came here and brought my mom for the awesome Mother's Day brunch. Service was great and the food was delicious. It's a very nice atmosphere. The brunch menu was just perfect. I had deviled eggs, steak and the dessert options were tasty too! They also bring you a warm cinnamon roll. I am looking forward to coming back here soon!", "pics": null}}, {"review": {"des": "Excellent surf and turf. It was a little fancy but we were seated in a private room, probably to avoid bothering other customers. <br><br>Food was excellent and drinks were very special.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/44zg5B5PkP6R5ouTeuHmKQ/348s.jpg", "caption": "Surf and Turf"}]}}, {"review": {"des": "Beyond the bar area, this River North steakhouse is sleek and modern. The rooms are tiered on three levels, and frankly the third room is a tad basement-y for me. I would opt for the middle dining room, which is well insulated from the bar area. <br><br>My big mistake of the evening was my choice of cocktail. I ordered the \"Tokyo Gimlet\" -- vodka, sake, fresh lime, asian yuzu fruit & cucumber. The cocktail was WAY too sweet. Dinner was better. The crab cake appetizer was a stack of chunky crab meat with a breaded topping, delicious. The filet was perfectly cooked, tender, tasty and well-seasoned. Others ordered surf and turf, salmon, and tofu and all were pleased.<br><br>Service was hit and miss. The waiter was great but it took way too long for the busboy to show up to remove our plates.<br><br>On the whole, I like this place.", "pics": null}}, {"review": {"des": "We were celebrating our anniversary last night<br>And this was wonderful. Restaurant looks very nice and food was ok a little on  expensive side. Service by Roy was amazing, best we ever had... He was super nice and professional,we definitely recommend this place to everyone.", "pics": null}}, {"review": {"des": "Excellent!  Great service and food. Fantastic and generous cocktails, great atmosphere and service. Hands down best crab cake I have ever eaten. Husband had strip steak and loved it. Fun, loud place, but dark and intimate also.", "pics": null}}, {"review": {"des": "I've been to Eddie V's a few times now, and I've never been disappointed.  The most recent visit was a group dinner with one of our work committees.  We were in the private room, which was nice and quiet but still had nice ambiance.  The service was friendly and attentive, we never felt rushed.  One of the server overheard my boss talking about how she loved the crab cakes here, so when she was cleaning up the appetizer plates she brought the lone leftover crab over to my boss for her to eat.  Little touches like that were nice.<br><br>I had the lobster bisque, which was creamy but not too filling, and had great flavor.  The Chilean sea bass was cooked very well, nice and flaky, and the soy broth that came with it was a great complement.  The Bananas Foster butter cake was to die for (and they flambe it, which is my absolute favorite!)<br><br>When I've dined in the main dining room I've had similar experiences, and every time I've been here everything has been delicious.  It is seafood, and it is high end, so it is pricey (I've been lucky that every time I've been here has been on my company's dime for events), but it is a great dining experience.  Plus they do live jazz here most nights, so you can sit in the lounge area and just get a cocktail or two and some crab cakes to enjoy with the music.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nPVlmEMsNpS_YsR1A24fng/348s.jpg", "caption": "Parmesean crusted sole"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rvGemp1K5FbbCmwTwQaqzg/168s.jpg", "caption": "Caramel apple strudel"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CxqU0CtwywHKFeOWSStk4w/168s.jpg", "caption": "Bananas Foster butter cake"}]}}, {"review": {"des": "If you're going to splurge, this is the place to do it! Everything was delicious making it almost impossible to pick a favorite. If I had to choose, I'd say the filet medallions were the best. They're debuting a new addition where the filet is wrapped in bacon! I couldn't get enough. Both steaks were cooked perfectly too (medium and medium rare) The wine list is a bit intimidating because of its size, but our server Adam helped find the perfect bottle based on our taste and price range.<br>Overall delicious and elegant restaurant and the live jazz music was wonderful to listen to all night. I only wish my stomach was bigger!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fl--rv09wi3YaEsiKpPLHg/348s.jpg", "caption": "Bananas Foster Butter Cake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hfjSEWS3YoPTqAy8F6KriA/168s.jpg", "caption": "Filet Medallions"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YpYq-fRxs_auo_n2jEaDkA/168s.jpg", "caption": "16oz USDA Prime New York Strip Au Poivre"}]}}, {"review": {"des": "Eddie V's was a nice surprise for a party of four with a couple of vegan requirements. I found the service excellent and the attention to detail of the dishes we selected to be fantastic. <br><br>We ordered the seafood tower, I highly recommend this and have attached the photo. All the seafood tasted fresh and with a nice variety of lobster, crab, shrimp, tuna, oysters and such. More than enough food to share for four or in our case a meal for two. <br><br>We also had the Chilean sea bass which was simply delightful yet light after the tower was consumed. <br><br>The vegetarian options of the miso tofu were done well and they even prepared selected veggies for my most sensitive eater. All in all a nice value for the money. I highly recommend and will come here again. I've eaten at Joe's stone crab just across the street and must say this was better.", "pics": null}}, {"review": {"des": "Love be the food and the intimate booths. Enjoy the live music and delicious desserts. However, lately the clientele has been very dicey, I mean it used to be upscale clientele and now there are huge groups of obnoxiously loud younger crowd. <br><br>It's not the same as it was before.", "pics": null}}, {"review": {"des": "It's completely amazing! You could definitely tell that it was higher end. The Maine Lobster tacos only made me half full and we're $20, but they tasted like heaven. What did make me full for the night was the Banana Foster dessert that the waitress lit on fire! Oh yeah, it was insanely delicious; the best dessert I had ever had. I'm definitely taking my girlfriend here for a date.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hQM9rrZeRHbkaU6vGKRGlQ/348s.jpg", "caption": "Bananas Foster Butter Cake. A waitress lit it up on fire!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hRnZ-ZokX6RvNsLMg41y-g/168s.jpg", "caption": "The interior"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-3oTX3fOrSgxSMInS4B8WA/168s.jpg", "caption": "Maine Lobster Tacos. Absolutely spectacular!"}]}}, {"review": {"des": "Omfg!!! Eric our brilliant server was the best server I think I have ever had. He described the items so eloquently and created such a magical mental vision that you wanted to order everything on the menu. He was so helpful and quite animated. He should go into theatre or acting.<br>If you ever come here request a table in his section seriously. <br>I will come back because of him. The food was phenomenal as well. <br>Keep up the amaze balls service, Eric!!!", "pics": null}}, {"review": {"des": "This is for the service alone at this location. The food we had was pretty good but the service was terrible and that alone would cause me to never come back here again.<br><br>I took my boyfriend here for his birthday dinner. We had an early reservation at around 5:15 pm Saturday night because we had to attend a show at The Chicago Theatre. When we got to the restaurant it took a while to get our table even though there was barely anyone eating there. This should've been a warning to what was going to happen later in the night.<br><br>We finally got seated and the waiter took forever to take our order. Normally me and my boyfriend don't mind waiting but again we had a show to get to after dinner and the restaurant wasn't even half full. <br><br>Fast forward into the night our dinner at this restaurant was the longest dinner we've ever ate because the waiter refused to pay attention to us and check up on us. My boyfriend would constantly see the waiter go into the kitchen and come out right after to go to the other side of the restaurant. In fact our waiter was so slow other tables that came after us left before us. I was so frustrated that at some point I was about to cry and walk out because we were already late for our show and our waiter was nowhere in sight. When we got to the show we were already 30 minutes late for David Blaine. <br><br>Overall, I should've chosen somewhere else more professional to have my boyfriend's birthday dinner. I spent the same amount of money here as I did at Gordon Ramsay's Hell's Kitchen in Las Vegas and I felt ripped off because service was terrible here. Hell's Kitchen had a full house and yet their restaurant went more smoothly than Eddie V's which was at half full capacity. At least there's always next year and hopefully I can make it up to my boyfriend.", "pics": null}}, {"review": {"des": "Dined in at Eddie Vs a couple weeks ago with someone special.  It was the perfect place because the food was also something special.  We started with drinks then moved on to the Calamari appetizer.  The calamari was some of the best I've had, it was prepared very nicely with many other accents.  Before the calamari came we were given warm bread which was perfect.  After the bread and calamari we were on the the main course.  We ordered a Mac and cheese side which we didn't really enjoy that much but I think it was because we didn't like the breadcrumbs.  For our main plate, we both ordered the Filet topped with lobster special, served on a bed of asparagus.  It was absolutely delicious. Very minimal to complain about. Service was great food was incredible. Easy five out of five<br><br>I would like to add that Drew is a great manager and he was very helpful when I came to him with a concern I had.", "pics": null}}, {"review": {"des": "I want to like this place more than I do! I waited until after my second visit to write a review. The staff is extremely friendly, the valet service is nice, the atmosphere is intimate and the live music is great! I don't hate it here, clearly...but I don't love it as much as I'd like to. <br><br>The food is okay. The waiter offered options for our 3-year-old without us having to ask. The staff was very accommodating during each visit. But the food is just okay. We ordered the fried rice during each visit. While neither time disappointed, they were very different. Both my husband and I noticed a difference. I ordered the filet each time. It was better during my second visit. I'd be willing to try this place again, but I'd like to see more consistency in the food preparations. <br><br>The bathrooms are worth mentioning. (I've got a thing for bathrooms:)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZjeJt2bPi-7F40_VgMoETw/348s.jpg", "caption": "Maine Lobster Bisque"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qpL8t9-I5COXli4dy6cNsA/168s.jpg", "caption": "Salt and Pepper Shrimp"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JlKf4MWAjYWBOwcofozaDw/168s.jpg", "caption": "8oz Center Cut Filet Mignon (butterflied)"}]}}, {"review": {"des": "I went here for a celebratory dinner and it was spectacular I got the surf and turf which was good but what really stood out was the wine pairings our server was really knowledgeable and paired a really good wine unfortunately I don't remember the name but this place is a hidden gem check it out", "pics": null}}, {"review": {"des": "Marvin was my server he was so laid back and practically knew exactly everything I was gonna order! We arrived for happy hour and had some strong cosmopolitans. The happy hour lamb chops lollipop was super small and unseasoned it for $8 can't complain too much. Now the crab fried rice was excellent!! And of course the crab  cakes were delicious! To end the night I got a banana foster cake for free!  excellent place to spend my  birthday!! The Chef came out and said happy birthday to me with some complementary lobster tacos. Yesssss best dinner ever!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rB0NlUdAMFdaD-hAOQhyug/348s.jpg", "caption": "Not bad at all! Plus a hefty tip"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2dQjYwLfLyjJMMpHEJzfVA/168s.jpg", "caption": "Bananas Foster Butter Cake yippee"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_5lF0XGISYtGaIT_SmXxoA/168s.jpg", "caption": "Crab Fried Rice and Butter Poached Lobster Mashed Potatoes"}]}}, {"review": {"des": "Wow!! I wasn't sure what to expect during restaurant week in Chicago but this place blew me away! I'm used to places offering small portions of over/ under cooked food and rushing you out. I made reservations but decided to sit in the bar area to enjoy the live music and they didn't disappoint. Service was efficient and quick. The food was hot and tasty. Steak cooked perfectly sauteed spinach and banana foster to die for!! You gotta try this!! I almost didn't and wanted seconds moments after I finished it. Don't wait on this gem. You will love it!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/G40OIicvwe6ps0D-VUsRSw/168s.jpg", "caption": "Lots of choices for everyone"}]}}, {"review": {"des": "It's not too often that I'm open to trying a seafood restaurant - especially being from the Northeast. Eddie V's is a phenomenal choice for those who are visiting Chicago. The food is second to none: my girlfriend and I split a lobster bisque appetizer, and we each had our own entree; she the swordfish, and me the ahi tuna. Eddie V's has a live jazz band that plays on weekend evenings, and it provides that extra touch of class that folks are looking to achieve. To top it all off, the service is second to none. Eleroy was the nicest server I had met during my visit to Chicago. I highly recommend this restaurant.", "pics": null}}, {"review": {"des": "Absolutely beautiful inside and out. The food was amazing!! Customer service was the best ever. It's was my husbands birthday, you would have thought we had reservations the way they decorated the table on the spot. Live music.  Couldn't have asked for more. Jessica was the best", "pics": null}}, {"review": {"des": "This place was amazing.  My girlfriend and I had our 2nd anniversary dinner here.  When making the reservation online, I left a note regarding the occasion.  When we arrived at our table, which was a booth, it was decorated with little hearts and a card congratulating us on our 2nd year together.  The small details like these are very memorable and made the night feel more special for the both of us.  Also, throughout the night all of the staff were very friendly and attentive.<br><br>For the appetizer, we got the Maine lobster tacos, which were delicious and probably something I could never replicate without professional training.  For the main courses, I ordered the Chilean sea bass and she got the 8 ounce filet mignon and a South African lobster tail.  We also ordered a couple of sides, which were the butter poached lobster mashed potatoes and sautéed spinach with garlic and parmesan.<br><br>I have never had Chilean sea bass before, but this was the best tasting fish I have ever had in my life.  It reminded of cod, which I love as well, but it was much more delicate and had a hint of sweetness to it.  Everything else was incredibly tasty, especially the butter poached lobster mashed potatoes.<br><br>This place and the whole experience was wonderful.  There was literally nothing negative about it.", "pics": null}}, {"review": {"des": "Worst service from a bar staff ever. We were underdressed but it was happy hour and treated lower than low. Husband was there the night before in business casual with no issue. Our money spends the same. Very unfortunate.", "pics": null}}, {"review": {"des": "My bday pick for this year ,really disappointed.<br>I honestly believe its a tourist trap ,or place throw money away.<br>I had been here previously so I was confident but let down as I finished my lack luster scallops and shrimp with crab.<br>For 70 .00 those two dishes I combined barely covered the plate. The scallops were tiny drenching in a citrus sauce the shrimp was a decent size but lacked any pizzazz nothing worth mentioning. I wanted to be Wowed I was highly disappointed. Then I was denied a request to move to a less noisy part of the restaurant. I couldn't hear my husband conversation. It was live music night in the lounge . Im not knocking the entertainment but I came for an intimate dinner not high octane and crowd participation. My hubby enjoyed his steak<br>Thankfully.<br>No need to go back 167.00 should cone with a more satisfying and accommodating experience", "pics": null}}, {"review": {"des": "This was hands down one of the best meals of my life! We had the crab cakes, Parmesan sole, side dish of the potatoes and a variety of cocktails. The service was wonderful they even hand delivered our leftovers back to our room! The atmosphere is nice. It's fancy but we can still feel comfortable is a nice pair of jeans and dress shirt. I wished I lived in Chicago so I come back more often. Thank you for a wonderful night!", "pics": null}}, {"review": {"des": "Outstanding meal, ambience, music and service. All sides are family style to split. We enjoyed the BLT (wedge) salad. Fresh, flavors with baby heirloom tomatoes, blue cheese and ranch dressing.  We enjoyed the crab fried rice. Outstanding flavor and ingredients. The George's Bay scallops were the best I have had. Cooked to perfection. 12 oz tender filet was enjoyed by my spouse. Cooked to perfection. Last but not least we enjoyed outstanding service by Geoffrey and crew. Geoffrey was very hospitable, kind and professional. We will be back.", "pics": null}}, {"review": {"des": "I came here for a birthday dinner w/friends. It was 10 of us. We had reservations, but were running very late and they still accommodated us w/smiles! They got 2 stars for that alone. Their bar area is very nice and laid back, my guests lounged there until the full party has arrived. <br><br>Our server was nice & pleasant. He offered and explained various items on the menu. I ordered the lamb chops w/a African lobster tail. DELICIOUS! DELICIOUS! DELICIOUS! Everything was cooked as requested. The crab fried rice!!!! The bomb... I didn't hear any complaints amongst the other 9 diners. I will definitely recommend the place & I will return! <br><br>They also gave me dessert & a bday card w/was a nice touch!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4IAGT-2NuYo0mwPMFIXidQ/348s.jpg", "caption": "Lamb chops & a African lobster tail."}]}}, {"review": {"des": "I eat out nearly every day believe it or not. The experience at this place was truly one of the best I have had in a very long time. From being greeted by the manager who was accommodating to everything to the wonderful suggestions from our waiter, this place was great. It was not very busy on this particular evening, so they made us feel like royalty. The bone in filet and sole were amazing although I'd skip the cognac sauce next time for the filet. The crab cake and fried oysters were amazing and the sides were all great. Don't skip out on the flambeaued dessert!", "pics": null}}, {"review": {"des": "Incredibly delicious food and impeccable service. We went with a small group of 6 people and were positively surprised. The food really was amazing.<br><br>Here is what we tried:<br><br>Appetizer:<br>- Blue Point Oysters: (5/5) delicious<br>- Maine Lobster Tacos: (4/5) good but simply not as great as the the other appetizers <br>- Hawaiian Yellowtail Sashimi: (5/5) delicious, probably my favorite <br><br>Entrees:<br>- Chilean Sea Bass: (5/5) MUST GET, literally the best sea bass I have ever had in my life. Very light dish and so so so delicious<br>- Others had the Prime New York Strip and loved it but I didn't try it myself<br><br>Sides:<br>- Crab Fried Rice: (5/5) So good, absolutely delicious<br>- Brussel sprouts: (5/5) yummy and a nice side dish to add some veggies", "pics": null}}, {"review": {"des": "When I want a great steak in Orlando, I go to Eddie V's. In Chicago's River North I've tried nearly every steakhouse, and yet, when I want a great steak in Chicago... I go to Eddie V's.<br><br>Even though it's a chain owned by Darden, Eddie V's is a cut above almost every big name steakhouse in town. And even though it specializes in seafood, it's really the steaks that are the standouts. In fact, it's ironic that Darden's steakhouse chain, Capital Grille, serves choice meat, but Eddie V's serves prime. <br><br>The service is also a cut above, with gracious, personal and professional waiters delivering a supper club type experience.<br><br>And the environment can't be beat, with a classy dining room, vibrant bar, and live jazz most nights. The Orlando location is high-ceilinged and a bit noisy, but the Chicago restaurant is perfect, with more intimate dining spaces and better sound levels.<br><br>The seafood is okay, but not really what I'm looking for. The yellowtail sashimi appetizer is excellent, and the shellfish tower is impressive. But much of the other fish is steamed or cooked in ways that aren't my favorite. So I stick with the excellent apps, salads and steaks.<br><br>In all, a great place for a great experience.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KUgC_IR0zZcq9fTWU-AvZA/168s.jpg", "caption": "Bar"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/srIdZ2INoMCDeLLCyV6FZA/168s.jpg", "caption": "Interior"}]}}, {"review": {"des": "Wow - what a great meal!<br><br>We met another couple for dinner last night. We arrived before they did, so we had a drink at the bar. Drinks were a bit on the high side of cost. <br><br>Our friends arrived and we were seated. Our waiter was great. The food was fabulous, if not $$$. <br><br>I had the Chilean Sea Bass, served Hong Kong style. Very good. My wife had the beef filet. Also very good. We both started with Lobster Bisque, very good. <br><br>There are SO many steak places within blocks of this area, we'd likely try another place next time. I'm sure they'll all be as expensive as Eddie Vs, I just hope they're as good.", "pics": null}}, {"review": {"des": "One of the best meals I've had was at Eddie V's. As a nationally recognized chain, Eddie V's is best known for their seafood.  My husband and I decided to have our 2 year anniversary dinner at this location a few weeks ago. As I reflect back on that night, I thought everything we ordered along with the service was outstanding.<br><br>Nicholas H. was our server for the evening and he did a stellar job taking care of us. He was welcoming and with regards to food and drink, he made excellent recommendations from start to finish. He was prompt and addressed any issues or concerns (which were very few) rather quickly. I could go into detail with the amazing food we had however the food speaks for itself. We had no complaints. Their wine list is extensive. They have at least 300 varieties to choose from. The libations are impressive. We ordered the Hope Diamond and the 24K cocktail. The Hope Diamond was our favorite of the two and it was a drink like none other we've had.<br><br>The clientele is over 40. The nightly jazz band set the tone for a rather classy and sophisticated evening. When available, you have the choice of sitting in the lounge or in one of several comfy booths or tables; complete with plush seating. We made our reservation weeks in advance and they asked if we were celebrating a special occasion. We mentioned it was our anniversary and they decorated our table with rose petals and a card upon arrival. They even decorated our Bananas Foster dessert with a Happy Anniversary greeting in chocolate! These simple yet thoughtful gestures were a lovely touch. The restaurant manager made the rounds and visited our table just to check in on us to make sure everything was satisfactory. This was much appreciated.  Dress code at the minimum is semi-formal conservative. It would be rude to show up in jeans, shorts, or sandals. Walk-ins are accepted however reservations are highly recommended.   <br><br>If you love surf and turf, then this restaurant fits the bill; A rather hefty bill at that considering that our dinner after taxes and tip ran well over $300.00. Parking can be difficult in Downtown Chicago so you may have to take a Lyft or spring an extra $30 for nearby parking in one of the public garages. Overall, we were pleased with the night's events. I'd highly recommend Eddie Vs for a special night out.", "pics": null}}, {"review": {"des": "First time to Eddie V's. Lobster and Steak was wonderful. A little hard to hear those next to you. For the kids meal shrimp was large in size.", "pics": null}}, {"review": {"des": "The steak medallions/filet mignon with garlic butter shrimp are to die for.  I will die for this meal.  One of the best I've had.  The bananas foster cake is one of my favorite desserts, ever. The ambiance is so romantic and elegant, and we adored the live jazz band playing while we were seated in the lounge.<br><br>Five star experience, through and through.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/S73baLJAgC6oyeLymZa4Pg/348s.jpg", "caption": "Chicago Restaurant week did not fail. This filet mignon with garlic butter rubbed shrimp and asparagus was mouthwatering"}]}}, {"review": {"des": "Best meal I've ever had in my life. Service was wonderful.<br><br>Had the tomahawk steak split between 2.5 and it was amazing", "pics": null}}, {"review": {"des": "My fav seafood restaurant in Chicago so far. I came here during restaurant week in winter. This is the only restaurant that serves the normal portion of food I encountered. I love the mashed potato with lobster especially although it's just a side.", "pics": null}}, {"review": {"des": "What a delightful experience; experience fine dining in Chicago at Eddie's<br><br>The hostess was very friendly greeted us in very respectful manner, and when necessary warned us to watch those steps to save some embarrassments.  We were seated and almost immediately got water and offer for drinks.  We had decanter our wine bottle at the bar so just took that with.  <br><br>The ambiance is very American, dark and white combinations with low lights.<br><br>Food absolutely amazing!!  I can't choose the right words, and nothing i say would do justice to their chef.  I order white fish which was so buttery it just melted in your mouth.  (some part towards the end were a bit chewy) no problem i understand it's hard to cook disproportionate fillet. My friends loved their stake; although it came pretty lonely, they had to order some sides.<br><br>If you're in the area this place is a must try!", "pics": null}}, {"review": {"des": "One of my new favorite restaurants in Chicago!<br><br>Service was super friendly from beginning to end. As our Hostess lead us to our table, she pointed out to watch our step where necessary. Our server was funny and professional and knowledgeable.<br><br>Asian crisp shrimp was crispy, light and delicious. The swordfish was simply prepared with olive oil salt and pepper but it was dry. it was a very thick cut but because of that, by the time the center reached a medium temperature, the outer areas were dry. I am not a dessert person but their bananas foster butter cake with homemade butter pecan ice cream has to one of the best desserts ever!<br><br>I can't wait to come back for their other seafood selections that are creatively prepared.", "pics": null}}, {"review": {"des": "Service was great & wine list awesome but food? Blah. Filet ordered medium was bloody rare. Fish tacos were boring. Salads were average. Much better options around to spend money on.", "pics": null}}, {"review": {"des": "Full disclosure, I did not eat any of the food here because I'm poor and all the food my friends ate was basically raw so we didn't share, but they do have good drinks!<br><br>The bar area is a little cramped and all the waitstaff had to squeeze by us. I'm sure this space was bigger when it was a different restaurant so I was surprised by the layout. It is also Hella steakhouse dark in there! People had to use their phone light to see the menu dark, but that is a classy steakhouse trend so I'll let it go.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QJJQmCyKCPHaERkKr7uA5w/168s.jpg", "caption": "Bar area."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FDkz4brLBMa6BsGfXV1dEQ/168s.jpg", "caption": "Live band!"}]}}, {"review": {"des": "Unfortunately it's taken me this long to post my review. I went for my birthday in September and it was lovely. The service was impeccable and the food was good. They also give you a complimentary dessert which was delicious. We had a great waiter although I can't remember his name. Their personal touch was a pleasant surprise and made me feel so special. Thank you!", "pics": null}}, {"review": {"des": "I'm a HUGE fan of this place. Their seafood is outstanding - a bad oyster here you'll never find! A small, measly, sorry-looking shrimp at Eddie V's? Nope, not possible. We're talking super fresh tasting seafood that makes you want seconds and maybe even thirds. I did not want my meal to stop, seriously. <br><br>I had cold jumbo shrimp and oysters on the half shell. I didn't order so I cannot tell you what region or what not. All I know was that they were plump (pretty big in size) and tasted amazing. Their seafood tastes like home (Miami) and worth every dollar - hands down, my favorite under-the-sea-like dining experience in Chi. <br><br>But what else is so great about Eddie? Try his effing 16 oz NY strip steak, medium rare, and you'll practically lick the plate. A friend asked for a bite and I almost stabbed her in the hand with my fork. That's how crazy good the steak is here! A close tie to Bavette's (and wayyyyy less crowded).<br><br>The crab fried rice is amazing too - though I could have used more crab.<br><br>The service was perfection. I had a great younger dude (don't remember his name but he told me he had lost a TON of weight). So if you know him, that's the dude that'll treat you right.<br><br>The fact I can get an OpenTable reservation for a Friday night here when it's only Wednesday is a huge plus for me. I had a last minute bachelorette in town who wanted to dine at a nice steak place. Every other steak house I called on that Wednesday: booked. Eddie Vs: accommodated us no prob. <br><br>Upon arrival, the hostess put rose petals all over the table for my girls and I and for the bachelorette, especially. This was a super cute touch. I loved it! <br><br>Only downside: prep your wallet. Other than that, GO!", "pics": null}}, {"review": {"des": "Absolutely one of my favorites! Service-5 stars!<br>My Daughter took me here and when she was about to order, the waiter said: Ms. Hayes, I see you don't care for onions. Would you like......? <br>I was extremely impressed that they keep notes on what their customers like and don't like!<br><br>Oh yeah! The food is GREAT too!", "pics": null}}, {"review": {"des": "This is a great go to for steaks and seafood. Soothing atmosphere with a Chicago vibe. Service is impeccable and the entertainment had a welcome back feel. Exactly what I needed my first night back in Chicago.", "pics": null}}, {"review": {"des": "I usually like to have a nice dinner on NYE, and this year we decided on Eddie V's. Steak is one of my favorite foods (apart from gumbo), and a great steak and seafood restaurant is always a good way to bring in a new year!<br><br>I am totally cool with old school steakhouses, and Eddie V's totally has that vibe. The restaurant is setup more like like a swanky lounge or piano bar. There are a few tables in the front for couples and a nice spacious bar you can sit at. They have a smaller, but tasty cocktail menu. The bartenders were attentive and my drink was made nicely. <br><br>Our service once we got to our table was great. Our waiter was very helpful and made sure we knew what was great on the menu. He also explained all of the different types of oysters, which was very helpful. I really appreciated that he told us we were getting too much food, hah! We made the decision to decrease the size of one of our sides, and we are glad we did. My husband and I tried three different types of oysters, the lobster bisque and corn chowder soups, and we had a strip steak, a side of shrimp, brussels sprouts, and lobster mashed potatoes. <br><br>The steak was cooked medium rare and was perfect. The shrimp were huge and both that and the oysters were very fresh. The sides were more than enough, serving wise, and they were delicious as well. If there was something that wasn't completely perfect, I would say the blackberry cobbler missed the mark for us. It was very sweet and soggy, and putting cold ice cream on top of such a warm dish just turned it into mainly a soupy, sugary mess. I would suggest ordering another dessert. <br><br>Prepare for a high bill, but of course that should be expected at a Chicago steakhouse. It's expensive, but I thought the food was worth it for the most part. We had a great time at Eddie V's. The service was great, and it was a nice relaxing evening with great food. I wouldn't be opposed to eating here if I was in the area on a special occasion.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GXr6Oex2OSeBPyx9kQyDvg/348s.jpg", "caption": "Strip, lobster mashed, Brussels sprouts. We also had a side of shrimp (not pictured)."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/W3NcctWEgZJa9VvhNWUMfQ/168s.jpg", "caption": "Our food."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/REH9UtImf4rW7PEj-rFMBw/168s.jpg", "caption": "Lobster bisque."}]}}, {"review": {"des": "Eddie V's is a little hidden gem of Chicago's downtown... Doesn't push all that advertising like some of the steakhouses do on ESPN... Just sits there a block off of the Mag Mile, serving great seafood in an incredible, quiet, romantic venue. Walked in and could hear the jazz ensemble playing in the next room. They have large banquettes that are very private and allow you to have a discrete conversation. <br><br>The menu is fairly straightforward, what one would want in seafood from a steakhouse, and varied enough to cover all bases. I had the sole and she had the filet. We were both satisfied with our selections, both large enough to take some home. <br><br>I have always been partial to the place kitty-corner, but Eddy V's is a great place with a little variety.", "pics": null}}, {"review": {"des": "Amazing! With a name like Eddie V's I expected an aging, possibly run-down bistro but boy was I surprised. I went with 3 other friends for restaurant week and am fighting the urge to go back again tonight. <br><br>I ordered the lobster bisque, Filet Mignon, and the bananas foster. Everything was beautifully balanced, and perfectly salted - if someone knows what kind of salt they use on the steak please let me know. It brought so much flavor  that I can honestly say it's the best steak I've had in over a year. <br><br>They had live music on a Wednesday night too! Why this place isn't busier I have no idea.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Dh5vvpZnE3pLk41rigOdTA/348s.jpg", "caption": "Bananas Foster"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/36W4YZ7g1H7gKHLrU48ssg/168s.jpg", "caption": "Salmon"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ygvSIs3sqxLPVBtB2BB6yg/168s.jpg", "caption": "Filet mignon, the best! delicious!!!!"}]}}, {"review": {"des": "My boyfriend made reservations for my birthday, complete surprise for me! I loved celebrating my birthday here. The food was DELICIOUS! Our waiter, Cody, was excellent and did a great job to make sure my birthday was amazing! We both ordered the featured menu item, the surf and turf, and it was absolutely delicious and so decadent. The filet mignon was cooked to perfection and the sauce topped on the lobster just melted in your mouth. We ordered the calamari which is pretty big, we weren't aware, but also super delicious.The crab cake appetizer that we also ordered was also so fantastic and by far one of our favorites. The seafood is so fresh, Cody said they have a 48-72 hour ocean to table window which is pretty amazing. For my birthday they brought an amazing dessert that they lit on fire! Completely made my night. Thank you so much Eddie V's staff, special thanks to Cody! I can't wait to come back for future special events. They truly do a great job in every aspect.", "pics": null}}, {"review": {"des": "What an experience! 2 thumbs up or may I say 5 star service. My wife and I celebrated our wedding anniversary and they treated us like a King and Queen. The food was superb. Our waitress was awesome. <br>I ordered the 8oz filet mignon with 3 stuff crab shrimp. Amazingly good. My wife had the special, the filet with lobster claws. <br>I totally will come back. I highly recommend Eddie V's. #SeñorFood", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jil3Rm_71Ni21zDxXBhk4A/348s.jpg", "caption": "Thank You Eddie V's for making our Wedding Anniversary a memorable one!"}]}}, {"review": {"des": "Eddie V's is a high end steak and seafood restaurant with great ambiance, live jazz, and one of the best desserts in Chicago.  Recommended dishes:  Maine Lobster tacos, Warm Goat Cheese Salad, Swordfish Steak, 8 or 12 oz Filet.  The Crab Fried Rice is the best you'll find anywhere and the Bananas Foster Butter Cake is both a conversation piece and perhaps the best dessert in Chicago.  Sitting at the bar?  Ask for Marcus or Matt. They're both outstanding bartenders and will take very good care of you.  I highly recommend one of Marcus's side cars.  One of the best anywhere.  For live jazz, Katie Ernst on Sunday nights (a timeless, silky smooth jazz voice) and Abigail Riccards on Tuesdays and Thursdays are both outstanding. You won't be disappointed!", "pics": null}}, {"review": {"des": "This is definitely the best place to have great service and great seafood, it's a hidden gem of Chicago <br><br>The service was very polite, professional and courteous <br><br>The bred and butter were perfect, what was great is that the butter was seasoned with spices and chives, just amazing.<br><br>For starter the appetizers were<br>1. lobster tacos: delicious lobster with herbs in a corn tortia shell.<br>2. Shrimp cocktails: big and delicious I wish there were unshelled but still I like them a lot. <br>3. Point oysters: amazing and delicious.<br><br>I ordered the sea bass was different than any other sea bass I had, served with ginger sheets and soy sauce,<br>And tried the grouper was amazing but the most delicious was the crab rice, rice with mushrooms and crab meat, just perfect for any meal.<br><br>I highly recommend this place.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cf624TajgW_WTZoCADqSDQ/348s.jpg", "caption": "Sea bass"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/N_oQlJ3CU4tDhT0w-6Ghkw/168s.jpg", "caption": "Grouper amazing"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/D5cdV6eBrHvvOBLJUvKe8A/168s.jpg", "caption": "Delicious crab rice"}]}}, {"review": {"des": "My favorite restaurant. I had a problem one time they quickly fixed it , and everything has been great every since , I really enjoy happy with my BFF and the wonderful drinks !! And the waiter octavious  it think that's how you spell his name lol he's wonderful", "pics": null}}, {"review": {"des": "I think I might have just caught them on a off night.  The service was slow. We waited over an hour and a half for our dinner.  When the food did come there were not enough sides so we got those after we ate our meats.<br>The food was good but nothing spectacular.  They definately were not on their best game when it came to timing and service.", "pics": null}}, {"review": {"des": "OMG....if I could give 100 stars I would in a split second. First off, the service is impeccable. The entire staff is warm, inviting, and extremely accommodating. Hands down, this is one of my most memorable dining experiences. The food...the food...is in a league of its own. The crab cakes were light and buttery. Absolutely no fillers or extra ingredients to take away from the crab. The bone-in ribeye was perfectly seasoned and cooked to perfection with just the right amount of char. The lobster pot is not to be missed! I died and went to heaven!!!!! First the aroma entices you and invited you in...then the butter and spices transport you to a place you never knew existed. Wonderful...is not enough to describe this meal. The lobster mashed potatoes and crab fried rice are the perfect accompaniments to an already perfect meal. My server, Bryan was the best!!!!! He was attentive, friendly, knowledgeable, and helpful. His recommendations were spot on! He is an invaluable asset to the staff and is one of the main reasons that Eddie V's is my new favorite restaurant!", "pics": null}}, {"review": {"des": "Late night lounge hidden in the pocket of a mall. Upon entering, you are slowly whisked away by the live soft jazz and clean cut waiters. The lighting is dim and has a romantic feel. <br><br>We ordered a dozen oysters. They came with red wine vinegar ice, cocktail sauce, and a lemon half with cheese cloth. They were beautiful presented. <br><br>Afterwards, they gave us a hot towel to refresh ourselves!  What a unique touch!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5e1OjVF42Sy31u5FzNcjQw/348s.jpg", "caption": "Savage Blonde Oysters were my favorite!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QFQD1oCAGuLvPdAAcWx6ew/168s.jpg", "caption": "Half a dozen oysters from the east and west coast."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bk8AXv5RI6YI6paeH2BBTA/168s.jpg", "caption": "We came for the oysters!!"}]}}, {"review": {"des": "Geoffrey is God Sent.. This place knows how to do it from start to finish. I made reservations on Friday Aug.12, 2016 for a party of 8 to end the night of my 7 days of events home in Chicago for my Birthday. <br><br>Some of the guest for my Bday week were staying out near O'Hare and 95% of my family and friends are home in Chicago and live all over. Just so happen there was a tornado like storm this evening close to dinner time however since I was staying on a suite downtown with my family I planned to cancel however a friend who was staying at a nearby hotel who traveled from VA called and said we should still go as I leave tomorrow and would like to experience this place.  I decided to go as my son was restless so my husband stayed behind and my teenager was out with friends. <br><br>Best DECISION EVER ( Besides marrying my husband, having beautiful children and being self employed) okay back to this place.<br><br>I entered and informed the host that 6 of the 8 cancelled and she was extremely understanding and accommodating and acknowledged my birthday from my notes. We were seated at a round spacious table in Geoffrey section. He was so friendly and helpful with our appetizer, cocktails age dinner selections as well as our dessert which he comped for my birthday.<br><br>We started with the lobster tacos and when I say we could've stopped there I MEAN IT. I was stuffed I mean these tacos are stuffed with meat and full of flavor. I opted for the seabass which was succulent and extremely tender YUM.. My friend and I shared the crab fried rice alongside of out entrees. She had the prawns which was AMAZING. Our server Geoffrey brought out Banana Foster cake with a candle that I blew out before he set it on fire with 151 to crisp the outside. The ice cream was house made and super yummy to compliment the cake. <br><br>I've been back since having dinner on another return visit home to Chicago on Friday Sept. 2 where I invited a friend who currently resides in Chicago still and hadn't been. I requested Geoffrey again and he was just as awesome and the hostesses as well as all the staff were just as welcoming and professional. <br><br>This is a must do in Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fVmpZXxaCU1bBo-yHfT8zw/348s.jpg", "caption": "Cocktails"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eFTwGcdXiVuKWVSFeG7KXw/168s.jpg", "caption": "My Birthday card signed by everyone"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MX4AHzTo8sOlAh4aXfHdlw/168s.jpg", "caption": "Shrimp entree"}]}}, {"review": {"des": "After a mishap from my first visit in Jan 2018, I received a call from the (then) manager, assuring me that my experience then was an unfortunate exception; he encouraged me to give them another chance. I finally returned tonight, and I'm so glad I did......my goodness, it was an excellent experience from beginning to end!!!! And our waiter, Elroy, was top notch!!!!! I will continue to be an Eddie V's patron!!!", "pics": null}}, {"review": {"des": "One of a kind dinning experience. This restaurant offers the best crab cake I have ever had. The drinks from the bar are very good and the service is five star for sure. You absolutely get what you pay for at this restaurant. The steak and lobster was on my top 3 ever. Great food, great service and an outstanding overall experience. The dessert is also amazing perfect for a nice night in Chicago.", "pics": null}}, {"review": {"des": "This was one of the best dining experiences I had in a while. I love a classic seafood and steakhouse restaurant. <br><br>Like other steakhouses, the Eddie V's brand is simply enriched with superior service and quality food. I didn't object to anything I ordered.<br><br>I started with the batter fried oysters as my appetizer. It was fried oyster bites with marinated cucumbers and a spicy curry sauce on a thin cracker. Delicious! It's a must try. <br><br>Then had a 8oz filet mignon with a side of crab fried rice and parmesan sautéed spinach. Of course, I ordered too much food but it was well worth it. My steak didn't come out as I requested (medium well), but the server apologized and ordered me a new one. He didn't have to go through all that trouble but I appreciated. The crab fried rice was buttery and filled with large crab meat.   <br><br>BUT my friend's lamb chops (who I had a few bites of) was the best prepared lamb I ever had. The lamb was tender and seasoned well. Have you ever been jealous of someone else's meal and wished you ordered it? Well I did. This is another must try.<br><br>We ended our meal with the classic banana foster. Not only was it delicious, but the presentation is what sells me ever time. <br><br>Our server Marcus did an exceptional job and recommended some great options.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Sl4Aub2pH3a1pC5y68H1cg/348s.jpg", "caption": "Crab and corn chowder"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/608f5LHhDe8UwKl8aSEuhQ/168s.jpg", "caption": "Lamb Chops (entree)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RtX4ntBzffT6HCWZwXw3SQ/168s.jpg", "caption": "Batter Fried Oysters"}]}}, {"review": {"des": "My friends and I took advantage Chicago Restaurant Week and this place did not disappoint! The customer service was good, steak was cooked perfectly and the banana foster dessert was perfection! I can't wait to go back!", "pics": null}}, {"review": {"des": "I went last night for my birthday. Not a single complaint. The service, the food, the romantic setting.. . Loved it. Next time, I'd like to sit in the lounge area and check out the live band. A special thanks to Robin.. You are the best!!!!", "pics": null}}, {"review": {"des": "I had a wonderful dinner with my friends here. Everything was so fresh and delicious ,starting with the appetizers, to desserts and drinks it was all very tasty. Can't wait to go again !!", "pics": null}}, {"review": {"des": "Eddie V's is an awesome seafood and steakhouse. The interior is warm and modern, the table service is beyond expectation and the food is very good. The only hitch to the entire evening was the hostess desk. Anytime guests are standing around waiting for someone to take them to their table, (after they have advised you that its ready) is not good. Eddie V's is one of those place that you feel out of place if you're not seated, whether at the bar or a table.<br><br>Once seated, our waiter Nick started into his performance. It sounded a bit scripted and sometimes verbose, but overall his passion was obvious. Besides focusing a bit too much of his attention on the person in our group whose name the reservation was under, we found the service almost flawless with only a few short gaps where we wanted some service and no one was around.<br><br>The shrimp cocktail was good but a little small and dry (as compared to giant-sized prawns that are usually presented in a shrimp cocktail at a tony steakhouse) The steak however was awesome! Once you get past the thin but heavy layer of salt, the flavors come together. <br><br>The table for four was very comfortable and the flow of waiters, runners, and front house and general managers to see how things were, was admirable. This gave us a good feeling that should something not be right, they would make it so.<br><br>Eddie V's is not an inexpensive place but the value, considering the service, is fair. If we could only get the hostess at the front to pay more attention to waiting guests rather than the telephone, it would have been a perfect evening.", "pics": null}}, {"review": {"des": "We were looking for seafood this evening and came across this restaurant. We were immediately seated and got lucky since there were 5 of us especially on a Saturday night. The place was full and there were other people waiting. Our server Eleroy explained and recommended dishes for us really well. We started with a dozen West Coast Oysters, Yum! Then shared a seafood Cobb salad. For our main, We all had seafood and all of us agreed that the food was great. Look at my pictures. To top off the evening we were surprised with a \"flaming dessert\". We all agreed that this is a place to come back to next time we are in town. Truly enjoyed everything.", "pics": null}}, {"review": {"des": "In Chicago you get used to certain restaurant standards so it takes something extra to be impressed. Eddie V does that and some!<br>Fantastic ambiance - tasteful combination of modern and old Chicago designs. Live jazz 7 nights a week (they take requests).<br>Great fish, we tried the parmesan crusted sole - highly recommend it. Great cocktail choices - classics and unique summer flavors.<br>Eleroy was awesome. Definitely coming back with more people!", "pics": null}}, {"review": {"des": "My fiancé and I spent the week in Chicago and we definitely saved the best for last with Eddie V's.<br><br>From the moment we sat down in a cozy booth, our server Octavian truly made the experience. He's one of those servers who is behind the mission of this restaurant, loves the food and is a server that goes above and beyond.<br><br>We started with strong, but excellent cocktails, oysters and pot stickers. While pot stickers isn't our typically appetizer, we chose these because of the shrimp filling and spiciness. Then we each had a steak - me a ribeye and my fiancé the peppercorn NY Strip with the crab fried rice and bacon Brussels sprouts. Phenomenal flavored steak and as for the sides, the crab was so fresh and flavorful atop the rice and the bacon was nice and crispy on the sprouts. Lastly, Octavian recommended the Banana Foster Butter Cake and we took his recommendation. He was so excited he gave it to us for free! We totally were not expecting this, but just a really nice touch and the dessert was the perfect mix of banana and caramel with a buttery finish.<br><br>We wanted to end our trip with a hearty steak dinner and I'm so happy we decided on Eddie V's, not only for the amazing food, but the excellent service from Octavian!!! Ask for him on your next trip there!", "pics": null}}, {"review": {"des": "I am very pleased with my experience here! My husband and I celebrated our anniversary here today and I was so impressed with everything! The decor and ambiance is beautiful, warm, and inviting....the staff was so friendly and our server, Hannah, provided excellent service to us! When we arrived to our table we had a cute little hand written card sitting there on top of the cutest heart sprinkles/confetti I've ever seen! It definitely made the occasion special! For an appetizer, we ordered the crab cakes which were AMAZING! For the entree, I had the Norwegian Salmon with vegetables and my husband had the special of the day...which was a surf and turf. He had steak and lobster with asparagus...for our sides we ordered the lobster mashed potatoes and truffle macaroni & cheese....it was divine!!!! After dinner, we were surprised with a complimentary Bananas Fosters Butter Cake that was flambé style right at the table...it was so nice!!!! I am so happy that my husband chose this place for us to celebrate our anniversary! I would love to bring my mom here for her birthday...we'll definitely be back. The service was TOP-NOTCH from start to finish! This has been one of the best dining experiences I've ever had!", "pics": null}}, {"review": {"des": "We were celebrating my cousin's 29th birthday. When we walked in, you can tell that this is an upscale restaurant.<br>The layout of the restaurant was lovely. The dim lights, the imitate corners, people seem to whisper as they spoke. When we got to the bar, we ordered a white Zinfindale it seemed to hit us hard immediately! I liked that. After about 15 minutes we were escorted to our table. This is where the review will began.<br><br>Pros<br><br>Our waiter Josh and his assistant waiter Adam was amazing! Yes they have assistant waiters! Josh was very kind, entertaining, and he knew the menu backwards and forwards. Adam was very accommodating; he continued to fill our drinks with whatever we had. Very nice gentlemen.<br><br>The Drinks were a hit! My cousin had some sort of Blue Diamond Drink where there is a blue ice cube that melts into a purple drink. That was very strong! <br><br>They brought a Birthday Banana Bread Cake with Ice Cream and whipped cream. Omg, I've never tasted anything so good in my life! The cake was sweet and warm paired with the coldness of the ice cream epic! Who ever made this needs a hug and a kiss!<br><br>Our appetizers were the fried calamari and the potstickers. Something about those Asian flavors, makes you want more!<br><br>Cons<br><br>I wish our food was a little better. Well, to be honest it's our fault. This is a Seafood and Steak Restaurant, we didn't order any real seafood or steak. We had the chicken breast which was cooked well, but it started to get dry once we got to the middle. We also had the clam chowder it wasn't all that. <br><br>Overall<br><br>This is a restaurant where you would see wedding proposals, celebrations of job promotions and people nervous about taking the next big step in their lives. Good service, great drinks, great laughter, lasting memories! Thanks Eddie V! Check out my photos and videos!", "pics": null}}, {"review": {"des": "Fantastic steak! 8oz dry aged grain fed filet minion cooked medium+. Server was very attention and upsold my sisters to the 12oz filet and it was perfectly cooked! Jacek took great care of us. The restaurant week menu is robust and has great variety with chicken, salmon, catch of the day (today was swordfish), and filet. <br><br>The fried shrimp appetizer was very good as well, I really enjoyed he sauce underneath. <br><br>The caramel panna cotta with pralines was also to die for. I would definitely come here again. Even Anna the manager came by to ensure we were enjoying ourselves. Five stars!!", "pics": null}}, {"review": {"des": "Visiting from out of town and decided to celebrate my anniversary at Eddie V's!! Hands down this was the best meal I've eaten in at least 2 years!!! <br>Not to mentioned Josh was a FANTASTIC waiter, very knowledgeable of the menu and was an absolutely delight.  <br>Please visit Eddie V's if you want an exceptional dining experience!", "pics": null}}, {"review": {"des": "Great food, what you would expect for a very expensive Chicago seafood and steak experience.  Went here for a business dinner with a CEO visiting from Europe.  Unfortunately, the waiter's presentation became a distraction from the evening.<br><br>The problem was the waiter had a script that was way too long and way too complex.  There is such a thing as trying to hard.  When the customers are clearly overpowered by the three minutes of specials and the 300 wines you have entered the realm of too much.", "pics": null}}, {"review": {"des": "I had a very nice experience while dining at Eddie V's. Only reason I didn't give 5stars is because I feel like they need more options on their menu. The drinks were delicious & stiff to say the least. Ambience was impeccable. Tonight there was a live jazz band playing and albeit the music you could still hear whomever you chose to dine with which was pretty cool in my opinion. The lobster bisque was tasty however the portion was very much so on the lighter side. The stuffed shrimp are great as well but again the portion is not enough to satisfy a grown ass man.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9X6YOuM96rhxyyYl0w05Kg/168s.jpg", "caption": "\"Fuji apple salad\" on top & \"Jumbo gulf shrimp\" on bottom"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RcpSWuxe9U5W23i-3mYh1w/168s.jpg", "caption": "Good not great Manhattans"}]}}, {"review": {"des": "My husband and I had a last minute free evening and I was able to find reservations for 2. It was a Friday during Lent, so we were looking for seafood, and Eddie B's had a good selection. The restaurant is on a busy corner,  but the valet was right there,  waiting.  We walked right in and were seated almost immediately,  despite the obviously busy night.  The waiter, Eddie (not the owner haha), was really nice.  We shared a bottle of wine and started out with the gulf shrimp appetizer,  the Maine lobster bisque, and the crab and corn chowder. It was all very good and the shrimp were huge.   They included a little container of horseradish for the cocktail sauce,  and most of it was mixed in...delicious!  I had the branzino and hubby had the butterfish. I thought the branzino had a better taste,  and since the butterfish was a bit thicker,  my husband thought a couple of bites in the center may have been undercooked.  It was not too much, and not enough to lower the 5 star rating. We had the crab fried rice as a side  We thought about having the  Broccoli and deeney as another side come on but the that may have been too much food for just the two of us.  Everything was so good and there was absolutely no room for dessert even though I really really wanted to try a couple of the selections that they had,  specifically the bananas Foster or fresh berries.   I'm hoping to be back with friends this coming Friday again. Can't wait!", "pics": null}}, {"review": {"des": "Came here on a Friday night with a party of 7 and was quite impressed.<br><br>I started off with a crispy shrimp appetizer, which had a sweet and spicy sauce that tasted like an asian sauce. For entree, I ordered the 6 oz filet mignon, which was done beautifully. I asked for medium rare, and it was medium rare JUST RIGHT. It was seasoned well, without overpowering the natural taste of the steak. As for the sides, I got the brussel sprouts. Brussel sprouts is a hard vegetable to do well. And Eddie V's got the flavor, sauce, and tender-ness just right.<br><br>Lastly, for dessert, I ordered the Banana Foster cake.... Do yourself a favor and order this. The waiter lights it in flames in front of you (which is cool) but boy did it taste amazing. The banana foster cake paired with the pecan ice cream is a match made in heaven.<br><br>Did I mention, order the banana foster dessert?", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Eu1EJA2N8Iwb3gzUjB6p0w/348s.jpg", "caption": "Banana foster dessert (get this!!!)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bjf1WnAmy4wCAYL9bbCMbg/168s.jpg", "caption": "Flames"}]}}, {"review": {"des": "Eddie V's has large, quality steaks. The staff is very attentive,  especially Hannah. The crab and corn soup is delicious. The filets we ordered were expertly cooked and very tender. Unfortunately my ribeye came out overcooked- it was ordered medium rare and it came out medium well. Despite this,  the ribeye was still tender and full of flavor. <br><br>We were there on moderately slow night and had to wait for a long time each time we ordered drinks.", "pics": null}}, {"review": {"des": "Was in town for a conference and was invited to a private VIP dinner at Eddie V's. We have one of these in Tampa but never checked out out. Food was amazing! Steak tasted great and I could've eaten the lobster mac and cheese for an entire meal. Will be going to the one in Tampa in the near future!", "pics": null}}, {"review": {"des": "Wow what a place. Not only was the food and atmosphere exactly what we were looking for but the friendly staff and smiling faces made the evening that much better. <br><br>Would like to especially thank Matt and Marcus behind the bar for going the extra mile to make us feel welcome and telling us all about the city.<br>Matt went above and beyond with friendliness and professionalism and we can't thank him enough for making our evening such a wonderful experience.<br><br>Keep up the great work guys", "pics": null}}, {"review": {"des": "So this was my first time at Eddie V's and I wouldn't mind eating there again next time I'm in Chicago in November. It was really classy, not a tshirt and shorts place, yet a nice shirt with nice jeans and boots was more than acceptable. The food was amazing and very filling. I had jumbo gulf shrimp in a white wine sauce and stuffed with jumbo lump crab along with a side of au gratin potatoes. There was a minimum 5 other items on the menu I'd love to try. We were a group of 16 so they did charge automatic 20% gratuity, but that's to be expected. The drinks menu is absolutely huge!  It's a must try when you're in Chicago!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RYlOwLyxy8XRJ2cqN6SyvA/168s.jpg", "caption": "Jumbo Gulf Shrimp"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tFFtE0ZQ8tFbHZLoxBRwDg/168s.jpg", "caption": "Au Gratin Potatoes"}]}}, {"review": {"des": "The customer service is phenomenal! <br><br>I modified the reservations, not once, but three times.  I know, pretty terrible, but planning a dinner for a large group can get messy.  The staff was so helpful though and they were able to get me two tables right next to each other (10 person table and a 6 person table) at 7:45 on a Saturday night. <br><br>Mostly everyone ordered off of the restaurant week menu.  I had the lobster bisque, filet and the bananas foster.  We ordered truffle mac n' cheese, broccolini and au gratin potatoes for the table.  The bisque was pretty good and had a generous amount of lobster meat but the filet was overcooked (I ordered medium and it was closer to well/well-done) which is completely unacceptable for a steakhouse.  The potatoes were forgettable but the mac n' cheese was good.  <br><br>Overall, it was a good meal but I won't be back.  It may be worth checking out during Restaurant Week or for their happy hour but I wouldn't recommend it otherwise.  <br><br>Tip-  Even though they put the tables next to each other they were still separate.  I wouldn't do it again and wouldn't recommend it unless you're okay splitting up your party.", "pics": null}}, {"review": {"des": "Eddie V's is superb for their seafood, I had the Norwegian Salmon, the taste was excellent and the salmon was cooked to perfection, recommend this dish. Went here for my anniversary and they decorated the table with rose petals and hearts, also gave us a congratulations card with all the employees signature, which I found very sweet! It has a more upscale atmosphere with live jazz music to accompany dinner in the lounge area. Something I thought was really nice was that they had a bar area where you can spend some time when waiting for your table to be ready. The service was an excellent balance between being attentive and not constantly checking in, enjoyed that! Highly recommend this place for a nice dinner", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/X8BbQAj0uIQQyRSsSf__SA/348s.jpg", "caption": "Banana Foster!"}]}}, {"review": {"des": "I came here for restaurant week not really expecting much.  I was so impressed with the food.  Everything was simple flavors but executed TO PERFECTION.  The service was amazing.  The wine they paired was spot on.  The bananas Foster is A MUST if you go here.  I'm not a dessert person,  but it knocked my socks off.  I have found my new go to date/birthday /need a night on the town spot.", "pics": null}}]}