{"name": "el-habanero-chicago", "reviews": [{"review": {"des": "Wow, what a great lil joint.  I've only been once so far, I had the asada Pambazo.  I've never had one before and I will say it was one of the most delicious mexi dishes I've ever had.  They dip the bread in some deliciousness and then griddle it somehow so it has a delicate crunchy exterior and soft interior.  It's ridiculous.  <br>People were great and salt of the earth.<br>Salsa was thick and separates itself from all others, it was spot on as well.<br><br>Small joint, no alcohol, no BYOB but that's ok, the food was awesome.", "pics": null}}, {"review": {"des": "Pambazos or as I call it the \"dipped italian beef\" of Mexico. Not going to be able to find a Pambazo near you unless you live in Pilsen (I assume). Wonderful mom and pop establishment with an Owner who cares. The Pambazo was delicious! Messy, but worth it. I actually really liked the red tomato pasty like salsa. <br><br>Will be back! <br><br>#RefereEats<br>\"I call it like I eat it.\"", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4BKzSFm1p7wvNdpzBxrU_w/168s.jpg", "caption": "Asada Pambazo"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/f9KxWx2RO1osFu8H0w4IjQ/168s.jpg", "caption": "Tomato pasty salsa"}]}}, {"review": {"des": "Tasty little family-run gem in Logan Square.<br><br>El Habanero isn't far from our house and on our way home from work. We probably dine hear monthly on average and the food does not disappoint. Manfriend's favorite is the Pambazo; mine is the enchiladas verdes - the sauce has a really nice zip to it, although I can't think of anything I didn't like here. We love the k <br><br>The only thing I'd change about thus place would be making it BYOB (but I totally get why they opt not to). That said, there are several other bars in the area to head for some after dinner drinks.<br><br>TIP: Cash only", "pics": null}}, {"review": {"des": "It was our go to brunch place. Great food and great service. But the last time we went (in the summer, this review is long overdue) we had the worst experience, after we ate and paid. We were a party of 9, so we had ordered quite a bit and left a hefty tip too. The lady ran after us and asked if we didn't like the food or service. We were surprised and said no, everything was great. She said, \"well, you didn't leave a tip!\" We were stunned to say the least and told her, no, we have left them a considerable tip. She kept saying no you haven't, and we were done after a few back and forths. We left with quite a bad taste in our mouths. Since the place is cash only, be careful if you are going with larger groups. I dont know who counts the money there. It is a family run business, as far as I know. And one of them cant count.", "pics": null}}, {"review": {"des": "My favorite Mexican takeout.  The place is no nonsense, which is perfect for takeout.  Chimmichangas are my favorite - huge and delicious. Love the horchata and tamarind juice.", "pics": null}}, {"review": {"des": "Authentic Mexican cuisine served up by a loving family. I'd glad I gave them another shot. The first time I tried to go I drove 45 mins in traffic. I arrived 30 minutes before close, but the same sweet owner ignored me at the door. I was pissed, but fortunately don't hold grudges.<br><br>I ordered a couple tacos and horchata. Very solid 3 star food, but nothing special from a culinary standpoint. I added an additional star because the owner was so friendly this time around. I'd go back if in the area and not up for the additional 5 min drive to L'Patron.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0N1i_dCD0ZflvscRkP3WzA/348s.jpg", "caption": "un aperitivo en la noche"}]}}, {"review": {"des": "Asada Pambaso was very tasty.  This is the first time I tasted them.  The owners are very friendly and make you feel at home.", "pics": null}}, {"review": {"des": "Hands down so fuc**** good!<br>I never write reviews cause I'm not a flaming poop shoot of a person, but this place deserves 10 Michelin stars! the employees and cooks need to be paraded around the city and givinen the damn key for makin' such fresh and tasty memories for the citizens of Chicago!", "pics": null}}, {"review": {"des": "This place is so so so so good! My friend and i have been here twice for lunch and have been blown away both times by their delicious torta dipped in whatever God sent sauce they have. Their steak is perfectly seasoned and tender. Be prepared to eat as the portions are large. The couple who owns this restaurant are so sweet and so attentive. Give this place a try. You won't be disappointed!", "pics": null}}, {"review": {"des": "My party of three ordered the Asada Pambazo & the steak dinner platter to share between us--Food came out freshly cooked and was nothing short of delicious. The Pambazo bread was coated in chili oil with just the right amount--didnt taste like drenched oily bread at all, which I was kind of worried about. They also packed so much good filling into the sandwich. The steak dinner platter had freshly made guacamole as a side, which was another highlight. Our thin piece of steak however was cooked not medium rare like we asked, but was overcooked and a little dry. It was still good though and I wouldn't judge this place entirely because of one non-ideal part of the meal. Regardless, eating here was a great experience. <br><br>The salsa (and chips) that are complimentary if you spend a certain amount, was very different from any other salsa I've had. It's puree-ed and there's a really interesting texture to it. Not really sure how to describe it, but I obviously liked it enough to eat all the chips.<br><br>There is nothing to complain about when the food is delicious & cheap and the restaurant is clean & comfortable. This home-owned place went above expectations with service as well and I'm so glad I stopped by here!", "pics": null}}, {"review": {"des": "I love El Habanero!!!! The food is delicious and the service is great! I ordered the vegetarian burrito and it was so good! The burrito was filled with rice, beans, lettuce, tomato, sour cream, and cheese. I opted out on the dairy. My sister order tacos and soup, she loved all of the dishes. I can't stop day dreaming about eating this burrito, but I live in NYC. When I visit Chicago, I will definitely be back. Chips, salsa and green sauce is complementary. The salsa was thicker than normal salsa, but it was so delicious and unique. <br>The service was so fantastic! The waiter was very accommodating and nice. The woman and I believe the owner kept checking up on my sister and I to make sure everything was alright.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Pk_tqT5sMMViKjHHPIetQQ/168s.jpg", "caption": "Vegetarian burrito"}]}}, {"review": {"des": "This place is so good!!!  First of all the service is amazing.  I felt more like I was at a good friends house for dinner rather than a restaurant because our waiter (Marco) was so friendly.  We had the chicken and Pastor tqco's, and a chicken and Pastor Huaraches.  Our favorite by far pozole soup It's a dry place so come for the food - you won't have any booze here.", "pics": null}}, {"review": {"des": "Delicious Food, Better Ownership <br><br>El Habanero serves the best Pambazo in the city period. Their quality of food, from the delicious Mexican Horchata to an amazing Tres-Leche Cake would normally be more than enough to earn my ringing endorsement. However, El Habanero is more than that. It's a pillar of the community, but most of all run by some of the kindest people in the world.<br><br>El Habanero is run by a family of Mexican immigrants, who have been a staple of Logan Square. More than just that, they care about the people around them. When I decided I wanted to eat some of El Habanero's food, I ended up driving to Logan's Square (where I actually used to live) in search of some of this Mexican delight.  To my ever disappointment though, I found out the restaurant was closed. <br><br>My story could have easily ended there. However, it didn't. The owner of the restaurant caught me at the door, and instead of letting me leave he refired up his kitchen and made me a sandwich. Joyfully, he explained to me how much he simply just enjoyed feeding people and how he'll often reopen his kitchen for just the one errant customer. While I eat I was lucky enough to hear his story, about his move from Mexico and desire to bring the Pambazo, a Mexico City staple street food, to Chicago. During this time I was lucky enough to be introduced to his lovely wife and learn more about this wonderful family run institution. Their son occasionally works as a waiter as well during his spare time. When they opened a few years ago, when Logan was slightly less gentrified, they quickly became a staple for the hispanic population in the area. <br><br>This restaurant represents the best of everything you can expect out of a local restaurant. El Habanero combines the attitude of a chef who find joy in feeding people, the weight of his heritage, and the communal feeling of a family run restaurant. The result, as you can imagine, is spectacular.", "pics": null}}, {"review": {"des": "This place is such a gem. I love their habaneros and their horchata, both are delicious and reasonably priced. But my favorite thing about this place is that it's family-run. I was able to talk to the owner the first time I was there and learn that it was a family-run business. He was very kind and I love supporting this place.", "pics": null}}, {"review": {"des": "We left with with full bellies and very satisfied with our meal. Glad we ventured out to El Haberno on a cold rainy December afternoon.  The green pozole was delicious and hit the spot. We also had the green chilaquiles and the pambazo--yummy! The owner went out of her way to check on us and she made us feel at home. We'll be back for sure!", "pics": null}}, {"review": {"des": "I will post more next week when I get back to CA, but this place has amazing food, great family-owned, nice service and has a comfy environment, plus parking is easy!!!", "pics": null}}, {"review": {"des": "I had the pambazo son chorizo, without realizing it was going to be mostly potato. I think the taste of it was rather bland.<br><br>My girlfriend had the chicken tacos, the servings are pretty good, and she was full after two event though she ordered three. <br><br>The nachos and salsa were different than any salsa I've had before, it's not chunky and all but smooth and spicy instead. <br><br>The service was great and the store owners were very nice, but I just was too happy with my pambazo and the chicken tacos weren't too amazing for my girlfriend. Also this place is cash only, and the meal total was $20 so it's very affordable", "pics": null}}, {"review": {"des": "The food is as good as the pics show! Took my friend Jenna here for lunch. Can't believe they aren't busier than they were. Get the pambazo!", "pics": null}}, {"review": {"des": "Do you like boiled milk steak? That's how  I imagine the carne asada was prepared. There was no char on the meat and each morsel tasted like something out of a stew rather than a grill. Of course half way through eating the burrito my plate was submerged by a layer of watery juices. Really disappointing<br><br>The saving Grace was the salsa that came with the order. The red salsa was amazingly flavorful. Good enough to make me give this place another shot? Maybe.", "pics": null}}, {"review": {"des": "Very friendly service. Seems family owned and run. The huaraches (carne asada, pastor, y chorizo) had good flavor. I would have liked more meat or the option to add extra meat (even if charged). If I return to the neighborhood I'd consider returning.", "pics": null}}, {"review": {"des": "Each time I've been here I've had excellent service and food. I usually get the pambazo de papas con chorizo and an horchata. My rating is usually highly impacted by the quality of the horchata. In my opinion, this one is one of the best in the city. The bread on the pambazo is soft with a crispy outer edge. The papas con chorizo are nicely seasoned and the rice and beans complement the dish perfectly.<br>Definitely recommend and will keep coming back. 5 stars!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VBwa9HMolKFFhnyv_g1VtA/168s.jpg", "caption": "Look at that soft and crispy bread!! Pambazo de papas con chorizo. Yes, please"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7KYiYjFaAw4rJuQCFLiSXg/168s.jpg", "caption": "Papas con chorizo pambazo dinner"}]}}, {"review": {"des": "The good:<br>Delicious hispanic cuisine. Authentic music and atmosphere. Colorful table cloths. Friendly, family-run local restaurant. Reasonably priced. <br><br>The bad:<br>Not much. Cash only.", "pics": null}}, {"review": {"des": "Staff was very friendly and presentation is very nice! Rice and beans were good but the steak is a bit bland. Maybe I'll try the chicken next time. Portions are pretty good.  I had to use a lot of the salsa to add more flavor. Cash only.", "pics": null}}, {"review": {"des": "A fantastic family owned Mexican restaurant. Loved the Pambazo Asada!<br><br>This place is small, cozy, and has some delicious mexican food! I've only had Pollo Pambazo, the Asada Pambazo, and the chicken Chilaquiles, but just based off of these I think this restaurant is delicious! The bread on the Pambazo is crisp and full of flavor, and it goes great with all of the fillings. I've always had to eat it with a knife and fork because it is really big!<br><br>I preferred the Asada Pambazo over the Pollo Pambazo, I thought the Pollo was a little salty, but it may have just been that day. <br><br>The portions are huge, and the prices are very reasonable! And to top it all off. BEST Horchata I've had in Chicago. It's so good, you must get a cup of it!<br><br>You do get a complimentary basket of chips and some sort of salsa chili mix, and it's really really good. Although any baskets you ask for after the first cost extra!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/P_5ld0dQXkbvbOfbH7NN7w/168s.jpg", "caption": "11/29 menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sMovApaqdiNrq8d_Ms7f6w/168s.jpg", "caption": "11/29 menu"}]}}, {"review": {"des": "This is the place I've been waiting for. Near work. Cash only. Order a Pambazzo. Excellent!!!", "pics": null}}, {"review": {"des": "Nice small neighborhood restaurant.  The service is slow because there's only 1 person waiting the tables and it did get busy for lunch time. <br><br>The Pozole Verde is very good. I seen at least 2 other tables order this plate during the time we were there. It's more soupy then the thicker stew like red pozole that I am used to. The flavor is nice and the portion is pretty large. I was skeptical of the pozole but took the recommendation of a friend that should know her pozole since she's Puerto Rican. I would definitely recommend trying it if you're in the neighborhood. <br><br>I also had the Pambazos. It's a Mexico City style torta. It's smothered in a sauce but remains crunchy and toasted. You can get different types of meat in it but I chose to stay safe and got the steak. It looked good and tasted good as well. <br><br>Definitely would be back since I am around that neighborhood often.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/A2fSRifpvrhRmM_i2xZJ0g/348s.jpg", "caption": "Pambazos"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1gV6t5nHO8FKadQsbsuplA/168s.jpg", "caption": "Pambazos Asada"}]}}, {"review": {"des": "They serve you complimentary tortilla chips and we only ordered one pambazo between us! I got the chorizo one, which is tasty and all, but I feel like I should have gotten the chicken or beef one since the chorizo is con potatoes, which made it super carby. A pambazo is basically a sandwich soaked in red salsa/chile mixture and then griddle, so if you can imagine the gloriousness... each sandwich is less than $10 so feel free to gorge. Too bad they don't stay open past 10pm because it'd be great for the drunchies!", "pics": null}}, {"review": {"des": "Food was amazing and the service exceptional! Food came out quick and fresh. Make sure to bring cash as it's cash only. Everything we ordered was delicious!", "pics": null}}, {"review": {"des": "really good taco!! really like the lengua one with very tender beef tongue.<br><br>service is fast too.", "pics": null}}, {"review": {"des": "Visiting from Nebraska,saw others photos of the food and decided to hop in. 1st of all the food looks exactly like it does in the photos which is rare. It's a tiny place with about 5,6 tables and what seemed like a family running the place. The service was great they were attentive,nice,and prompt,but why I gave this place 5 stars was all the food tasted great and came out nice and warm! Try the pastor gordita and the panbazo.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/n5nDwtAxgHHbgfbzzKEMqQ/348s.jpg", "caption": "Panbazo de papa con chorizo and gordita al pastor. The gordita was awesome!"}]}}, {"review": {"des": "My bff love Mexican food and wasn't sure where to go since we were in the area.  I searched yelp and after reading reviews and seeing the pics we decided to come here and was NOT disappointed. I didn't read enough of the reviews to know that it's a cash only restaurant but lucky for us we had enough cash. The food was delicious and flavorful, the service was outstanding. Very nice cozy and clean restaurant. They provide complimentary chips and hot and mild salsa. If I am in the area again I will definitely go back.", "pics": null}}, {"review": {"des": "Love this place!! I live right down the street and decided to stop in cause the reviews.  The salsa they serve has tons of fresh garlic so beware!  The pombazo and pazole are to die for!  I could literally eat it everyday!  I actually came back the next day to get the soup again and some tacos haha authentic family owned Mexican restaurant! Yum!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PjePBYXA8JANx3sDiCf0Xw/348s.jpg", "caption": "Pombazo and pazole soup! So good!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dK3Hw7xs9ipCNxxpLGtETA/168s.jpg", "caption": "Pork and pineapple and chicken tacos! Yum!!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pSoDh7xbtlzyVMrrLguaKg/168s.jpg", "caption": "Chicken and fish tacos!"}]}}, {"review": {"des": "Authentic Mexican food made with love but sold for the price of a fling.  Loved the gorditas made with fresh corn masa and the roasted tomato pico de Gallo.  I could eat off this menu for days.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/o2kXhtZLvvoOw3YXTKnIeA/168s.jpg", "caption": "1/2 menu 8-7-18"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_GtxAsTN3FMs_abA3RRmfw/168s.jpg", "caption": "2/2 menu 8-7-18"}]}}, {"review": {"des": "Great cafe ! I love Mexican food. Very clean tables, restroom, and nice personal. Highly recommend for Mexican food and tacoooos. Food was delicious . Thank you", "pics": null}}, {"review": {"des": "Amazing amazing! We got the pambazo with awards, enchiladas verdes, and taco al pastor. All amazing, all fresh, and all delicious. Very authentic. The pambazo is to die for. Great atmosphere also!!", "pics": null}}, {"review": {"des": "So, the other 340 reviews are not wrong here. I'm not even so much a fan of Mexican food but I will travel the distance to come back here again, just superb! I ordered a chicken burrito, no sour cream, add jalapeno and not only was it outstanding but I'll be snacking on it for the next 2 days. The quality of meat was outstanding.. Not like many others I've tried. Bar none, literally, but best Mexican outside of Mexico.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_pxZNQAccyQQ6V9dCaIcdw/348s.jpg", "caption": "Half eaten chicken burrito larger than my head. Add jalapenos!"}]}}, {"review": {"des": "My first time and I will return. wholesome cooking. Delicately served. I had a torta de picadillo.  The picadillo filling was freshly prepared topped with a touch of melted chihuahua cheese lettuce and tomato. nice and simple. not over powered by spices and sauce. For my taste, just right.<br><br>Its a small at home feel. decorated with art work from mexico and I love that they play a variety of music from mexico that is appropriate and creates a nice ambiance to have your meal in.  Family owned,  So polite and wonderful hosts.<br><br>Cash only, street parking on side street and meter parking on Fullerton", "pics": null}}, {"review": {"des": "Went for a late breakfast today and loved the chilaquiles. Breakfast is served all day which is a huge plus for me. They are cash only! We had to run into Walgreens to get some cash so come prepared. My friend ordered chicken nachos and was happy with her meal. My fiancé and I ordered the chilaquiles dinner which was a more than generous portion size. Horchata and cafe con leche were also both solid. We will definitely be back!", "pics": null}}, {"review": {"des": "El Habanero is great and I wish I could give it 5 stars, but I'll tell you why I didn't. The owner is actually the cutest, sweetest lady in the world - I've kind of adopted her as my third grandma in my mind. The family who runs this place is amazing and I have nothing but great things to say about the service they provide. Plus, I love supporting a ma & pa shop!<br><br>Onto the cons - their red salsa is loved by many, but truly makes your breath rank. I can't eat it and my bf kindly doesn't anymore either because it has such a bad effect on breath. Seriously, guys. Also, it's a bit too pureed for me. You have to try it to understand. Also, the chicken tacos are nothing to write home about. Another downfall is that it's cash only. Not the biggest deal, but I never carry cash so it's slightly inconvenient.<br><br>HOWEVER, their tortas, guac and nachos are phenomenal. I'm not kidding when I say that their nachos are LOADED. Often times I find that places put like two pieces of meat in the nachos, but that is not the case here. I recently had like an entire chicken on my nachos... seriously, they're legit.<br><br>Overall, definitely go here, but definitely opt out on the salsa. You'll thank me later.", "pics": null}}, {"review": {"des": "Great food. Great service. Brother and sister ran, and they definitely know how to cook. From their sauces, to the food; it's all so good and home cooked taste. Great atmosphere. Great family restaurant.", "pics": null}}, {"review": {"des": "This place has amazing food I had pambazo diner and it was the best think I ever had , the owner is super nice and the service is excellent. I can't wait to go back", "pics": null}}, {"review": {"des": "Pambazo!!! Greasy sandwich goodness. It's hard to find these done well! I like the carne asada one myself. Big greasy sandwich with generous side or rice and beans...so good. Owners are very sweet!", "pics": null}}, {"review": {"des": "Terrible experience, was once a customer but never would I return nor recommend this place.  Very poor customer service. I so wish I had taken a picture of that burnt sandwich.", "pics": null}}, {"review": {"des": "I don't know if it was just today or if they never offer credit card services. Whatever the case, I drove 39 miles to come eat here and when I arrived, there was a piece of paper on the door that said \"cash only\". I was completely disappointed. My husband and I always go to upscale restaurants for our Anniversary. This year, for a twist, I thought I'd take him to a good spot for Chile relleno. What a let down!", "pics": null}}, {"review": {"des": "Loved dinning here. It's very authentic and delicious. Good quality ingredients make any meal spectacular and this place  definitely has that. My hubby had the carne asada pambazo, which had a good feel when biting into the bread and I had a huarache de carne asada. The carne asada was beautiful grilled. <br>Great food. Great service. I'll definitely be back ;)", "pics": null}}, {"review": {"des": "I can't believe it took me so long to finally try this place out for the first time.  This restaurant has a few chairs and tables to sit at if you are eating in, but this place is also a great take out option.  Two important things to keep in mind about El Habanero is the fact that it is both BYOB and cash only.  <br><br>When I came to El Habanero, everyone on staff was super welcoming and friendly towards me.  That alone made for a positive experience before even trying the food.  I ordered the chilaquiles verde dinner w/chicken.  The chilaquiles dinner is HUGE! Before getting my meal, I had barely eaten anything all day.  The platter was so huge that I was only able to eat a little less than half of it, but it made for great left overs the next day.  The verde sauce was one of the best I've ever had from anywhere in Chicago, and almost everything about the dish was absolutely amazing.  I would rate the chilaquiles at El Habanero a 9.5/10.  The only reason I am taking a half point off is because the scrambled eggs could have been mixed a little better (there was some separation between the yellow and white in some areas of the scrambled eggs).  I have no other complaints though! I look forward to coming back to El Habanero again and trying more of their dishes.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2m6hc29m-dfR8AxR1K0ETw/348s.jpg", "caption": "Chilaquiles dinner. I literally had 3 separate meals from this one platter. Worth the $11 for sure."}]}}, {"review": {"des": "I love this place so much! FOOD IS BEYOND AMAZING!!! I would eat everything on the menu if I could! BEST AGUA DE HORCHATA IVE EVER HAD and that's saying a lot because I've been to Mexico and I've had some pretty good homemade agua de horchata but the one they sell here just takes that gold metal! Highly recommend it! Bring your wife, your new man, your mistress whoever!", "pics": null}}, {"review": {"des": "Really good food. I had a grilled tilapia and it was seasoned really well with the rice and beans on the side! Def order rice and beans. Great place to grab quick bite. It was busy on a Mon night after 6.", "pics": null}}, {"review": {"des": "Hidden gem alert!!!<br><br>Reason you come here is for the Pambazo. I call it a torta on crack!<br>The bread is really what makes it stand out. Also If you like hot stuff, make sure to ask for hot hot sauce.<br><br>Owner is suuuuper cool! His name is also Gabriel too so I'll never forget his name.<br>Each time i've been there i've been able to chat with him and service has been awesome.<br><br>He said he tried selling something really spicy on his menu but it didn't get too much interest so he took it down.  Everyone please request it so we can have a chance to try it!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QU6TDIgT72WtNdNyFMYxcw/348s.jpg", "caption": "Pambazo the best!!!"}]}}, {"review": {"des": "One of my fav go to spots for anything Mexican. Also I'm very picky about chilaquiles and they make some that you won't regret. Great service and welcoming atmosphere.", "pics": null}}, {"review": {"des": "Believe the hype. Super fresh , super friendly. Perhaps a bit toned down in spice compared to what you might get in Mexico, but wonderful nonetheless. So tasty.", "pics": null}}, {"review": {"des": "This is the best Mexican I've had in Chicago. The only reason this statement is a stretch is b/c I've only been once, an issue I plan on rectifying ASAP. We had 4 dishes. There were all terrific. As was the chips, salsa and guac. Service is warm and friendly. And very helpful.<br><br>The pambazo sandwich is the magic. Perhaps the most delicious sandwich in the city. That is not an exaggeration. <br><br>The owner was nice enough to bring out an al pastor taco to try. Delicious.<br><br>This place is a gem.", "pics": null}}, {"review": {"des": "My favorite Mexican restaurant in Chicago. Chilaquiles verdes are to die for. Best weekend brunch meal ever. Have them just do it. Pastor tacos are also really good. Great service. Food is made with love. Go nuts!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YvthGkFi_XoBYCBOZAv7BQ/348s.jpg", "caption": "Pastor taco dinner - so good I'm ashamed of all my previous meals"}]}}, {"review": {"des": "Even for 4.5 stars this is underrated to me. Always a warm loving reception and you can tell the food is made with all of there hearts. I never write reviews but the boss lady here always makes us feel invited and makes sure our meal was up to our standards not hers. This is my 5th trip here and they continue to earn my business with some true flavor.", "pics": null}}, {"review": {"des": "Al Pastor tacos were delicious and the prices were great. Very good authentic Mexican restaurant.", "pics": null}}, {"review": {"des": "The worst place in the hood. Stay away. Only came because El Patron was closed for some weird reason that day although it was not Tuesday. I eat veggies and fish. Stated it while ordering and ordered fish taco dinner. When it came, it smelled like meat, so I said I think it was cooked with meat. (I was with my husband who ordered steak tacos, so I thought it might have been cooked in/with animal fat). They went to the kitchen and came back saying it was cooked by itself. I said I want to send it back still because I will not eat it since it smelled repulsive. The man waiter was sort of okay, but then a lady came back yelling in my face and pointing with her finger very close to my face. I did not touch the food so in any case I should be able to send it back. I had to tell the lady to step back and stop yelling and having attitude. She was super pissed and they would not take it off the bill. Ridiculous!!!! It was $9.99. The place is SO BAD I just decided to pay it and NEVER COME BACK. I recommend you do the same!", "pics": null}}, {"review": {"des": "The food was amazing.  The pambazo we had tasted great and was very filling.  We also had the green pozole which was one of the best pozoles I've ever had.  <br>The service was good quick and friendly. <br>I only gave this place 4 stars for one reason:  When we went into the restaurant, there was only one couple eating.  As we were picking a seat I noticed a lot of food on the floor.  It was pretty messy.  I understand that they might have been busy before and hadn't had time to clean up but no one even attempted to do a quick sweep during the hour we were there although I did see the server standing behind the counter not doing much. <br><br>If I am in the area I will definitely go back and I suggest you go to!", "pics": null}}, {"review": {"des": "Are these owners on earth?<br><br>I call to order and note that I can't find their menu on line, and they were fully aware that there is no website and no menu on Yelp. \"Oh yea sorry\"<br><br>I had to call and order by pictures posted by other Yelp users. This is a very \"slippery slope\" and a \"slow fade\" for a restaurant owner.  <br><br>Food was outstanding and second to none.<br><br>Updated***<br><br>Then I get there and it's cash only. You think they could've mentioned that when I ordered \"pickup\"???", "pics": null}}, {"review": {"des": "This quant restaurant has delicious food. My husband and I stopped in and both ordered steak pambasos, horchata, and shared a tres leches desert. The staff was extremely friendly.", "pics": null}}, {"review": {"des": "It has one of the best horchatas I've had so far. The pastor tacos are also very tasty and delicious. Only downside is that they only take cash. Other than that I recommend this place for some good authentic food.", "pics": null}}, {"review": {"des": "It was the best/worst experience for us. The food was really good but our server was terrible. <br>Go eat at your own risk. Make sure not to ask any questions unless you want a hefty dose of attitude thrown your way.", "pics": null}}, {"review": {"des": "Simply the best! The family who owns El Habanero are such sweethearts and they really put lots of love into their food. I have not had a bad or even average meal here. Everything Is excellent! The el pastor is the best in the city, hands down! If you are in the area, this place is a must!", "pics": null}}, {"review": {"des": "This place is by far the spot to hit!  From the unique home made roasted tomatillo salsa verde to a perfect hand crafted pambazo sandwich they delivered!  I had a rocking chile rellano platter, a lingua taco-- perfecto!  Daughter had the papas y chorizo pambazo - wow!  Service, price and staff were all great. Owner, chef and manager all came by to check in on us. Sharing some food history  and trade secrets as well as just welcoming us for choosing them. You cant go wrong here!", "pics": null}}, {"review": {"des": "Personally, I wouldn't rate this place 4 stars. My first time there there was a water cup that had what looked like gum in it. They served us water and if my buddy didn't catch it I would have been drinking out of it. The tacos were okay nothing spectacular. Our waitress looked to be having an awful day and didn't seem friendly at all.<br><br>My buddy said he walked in twice no one said hi nor acknowledged him so that was sort of frustrating initially since I recommended the place. <br><br>I won't be visiting this place again", "pics": null}}, {"review": {"des": "This is my favorite Mexican place ever!!<br>The food is amazing. Authentic, homemade. And the owner and the young man are super sweet, service is great. This place makes you feel at home. I try to go every time that I'm in that area. The tres leches dessert is amazing but I never have room for it.", "pics": null}}, {"review": {"des": "Excellent food and exceptional service.  My friends and I went here when there was a two hour wait at another restaurant.  The staff accommodated 11 of us and were so friendly and helpful.  They even surprised our friend, who was celebrating her 40th birthday, with cake.  Turned out to be a wonderful dinner!", "pics": null}}, {"review": {"des": "I've been to 100's of Mexican restaurants from high brow to low brow.  This place has some of the best I have ever had.  No frills!  Just a good family owned joint with delicious, fresh, flavorful food.  Grab your BYOB and head over now.", "pics": null}}, {"review": {"des": "Finally made it to El Habanero. Worth the wait. The pambazo con chorizo is wonderful - flavorful and crunchy, a sandwich lover's dream. Heard it is rated one of the best sandwiches in the city, and I absolutely believe it. Beans and rice also solid. The red salsa/spread is deliciously garlicky. Friendly, detailed service and owners. Worth a visit, especially if you appreciate mom and pop restaurants.", "pics": null}}, {"review": {"des": "El Habanero is located at 3300 W Fullerton Ave.  when I walked in it was fairly empty.  I met my sister there for lunch.  The woman who was serving us is also the owner.  Her personality makes you feel very welcome.   The restaurant is fairly small maybe 20 seats, but the food is very good. She told us that she has been open about 18 months.  To get 177 reviews in such a short time says a lot about the restaurant, the owner and the food.  <br><br>She brought us chips and salsa.  The salsa had the consistency of a tomato paste.  It was very thick and loaded with garlic (I love garlic).  I ordered the enchilada verde with chorizo.  It was good, but the chorizo was salty.  My sister ordered the taco plate that comes with 3 tacos.  She got 1 chili rellanos, 1 lengua and 1 al pastor.  I liked her dish better then the one I ordered.  The horchata was very good and served as a palate cleanser between different food items.  <br><br>Overall the service was excellent and the food was very good", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tjLpZ57emCjdM8LYv8u0GA/348s.jpg", "caption": "Horchata"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bAnYn84a4EutmA0CotYxvg/168s.jpg", "caption": "Tacos, lengua, chili rellanos & al pastor"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eDgCzs3M7iwC_CoVqrjRnQ/168s.jpg", "caption": "Enchilada verde"}]}}, {"review": {"des": "I loved this neighborhood, family-owned restaurant! The food, the service, and the ambiance were on point... and I love to have this option within walking distance from my place. We'll definitely be back! <br><br>PS: It's BYOB and cash only.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LbQf7fjRLw3Ydc24HREu9w/348s.jpg", "caption": "Carne a la Tampiqueña (no rice for me)"}]}}, {"review": {"des": "Found this gem here on yelp after looking for a pambazo. Legit! Found parking right out front on Fullerton, and my pambazo came out before I even finished listening to my voicemails. It wasn't soggy, it was toasty yet still fully covered in red. Will for sure be back. Happy girl here! oh and the lady who served me was very nice.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mSCp2mubafHvlwcYvdV2Ew/348s.jpg", "caption": "I was craving this pambazo so bad. #teamasada"}]}}, {"review": {"des": "We ordered every taco on the menu.  They were plain with none of the dressings that fancy places use.  They were solid but the real winner is the Pambazo.  We ordered the chicken and it was fantastic.  One of the best sandwiches in the city.  We tried the chirizo Pambazo as well, and it was not as good as the chicken.  We heard he steak was good as well, but the steak tacos were just ok, so not sure if I would recommend.  Def try this place.  Chicken Pambazo was one of the best things I've eaten in chicago.  One note is they do not allow alcohol in the restaurant.  Not even BYOB.  Unsure why, but we had to drink outside.", "pics": null}}, {"review": {"des": "Hands down best chilaquiles! I order with chicken and eggs. The chicken is tender and flavorful. Wash it down with some delicious horchata. (Mmmm as I write this I am planning my next brunch.) I've never had trouble parking along Fullerton, and getting a seat is usually immediate or a short wait. The servers are friendly. I think the prices are reasonable for the portions. It's cash only!which seems to slip my mind, but there's an ATM and the Walgreens at the end of the block. I typically walk away with leftovers, a full stomach, and a smile knowing I'll enjoy it again the following day.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IpKfn1bhfxUV2tlhlHhEPg/348s.jpg", "caption": "Chilaquiles"}]}}, {"review": {"des": "Amazing Mexican food. I've lived in Chicago my whole life and this is by far the best Mexican food I have had.", "pics": null}}, {"review": {"des": "Best Mexican food in Chicago by far! And the service is even better! DELICIOUS!!!! Try the Cafe Con Leche and Chilaquiles. Can not wait to come back!!!!", "pics": null}}, {"review": {"des": "I don't like writing reviews. The moment I sat down and tried their sauce and guacamole I knew it was going to be a delicious lunch. Everything was beyond great and the service was outstanding. Be ready to feel like a big cow afterwards. Will be back !", "pics": null}}, {"review": {"des": "Nice family owned restaurant with a very homie vibe. The staff was very friendly and kind. Got here on a Saturday night  and got seated immediately. i already knew what i wanted so ordering was quick. the lady explained the menu and gave recommendations. overall the food was good and tasty. As always my favorite part was it was REASONABLY priced. can't beat that!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JhH70zCtuWhjF-8hZo3ghA/168s.jpg", "caption": "Pescado and carne tacos."}]}}, {"review": {"des": "Excellent! I've been eating at El Habanero for close to four years now.  Pozole' Verde is Excellent!  I now have a good part of my office hooked and we have Pozole' Friday at least twice a month.  Pambazo with chorizo y papas is another favorite.  Always a great experience, very clean and you get that home cooked meal feeling.  Love it!!", "pics": null}}, {"review": {"des": "Great pozole, full of flavor and chicken.  Nice, down to earth neighborhood place.  One of their salsas is amazingly garlicy and tasty, but will stay with you. <br><br>NOT BYOB,  alcohol is not allowed in this restaurant.", "pics": null}}, {"review": {"des": "I was in the area for an event with my brother and a friend, we quickly Yelped places to eat in the Logan Square area and El Habanero had unusually high ratings among a lot of other places nearby.<br><br>The place is really small and kind of hard to notice from the outside. The inside is similarly small with only a few tables, but is nicely decorated and really chill.<br><br>I did my Yelp homework by actually finding the place but I failed to read some of the reviews about the pambazo sandwich. I decided against ordering it after my other two group members both did; I opted for the taco dinner instead and I will admit I was a little jealous after trying it.<br><br>Chips were definitely homemade, the red salsa had a very smokey flavor to it and I liked it a lot. The green was good too. El Habanero's chips and salsa game is on point.<br><br>They let you mix and match taco meats, I got asada, pastor and chili relleno and paid the upcharge for avocado. Each of these were absolutely delicious. I thought the pastor was the best out the 3, really tender and flavorful. The chili relleno was very heavy, it was a deep fried chili pepper filled with cheese that was also really good, although slightly greasy. The asada was good but also a bit greasy. I feel like with this kind of food grease is to be expected. The beans that came with it were great, I love beans. The rice was good too but nothing stood out to me about it.<br><br>The pambazo was really what I should've gotten. I've never tasted anything like that before and have never heard of bread cooked in salsa before. Next time I will be sure to try one.<br><br>The price was right for what we had. My taco dinner was just over $10 and the pambazo sandwiches were right around $8.<br><br>Service was good, our server was quiet but we didn't really need him that much.<br><br>Like others have said, it is cash only and NOT BYOB.<br><br>Will definitely be back this is a unique place among a ridiculous amount of Mexican restaurants.", "pics": null}}, {"review": {"des": "Solid authentic  family run Mexican spot. It is small with only a handful of tables and a small bar area.  Note: It is Cash only.  It is also NOT byob. Service is overall pretty good. <br><br>I've tried the Pambazo Papa con Chorizo (sandwich with guajillo sauce). It was very tasty.  While the sandwich was good, I really enjoyed their fish and steak tacos.  The tilapia taco is not fried like most places but was nicely grilled and still moist. The tacos are generally on the larger side.   The pastor burrito is awesome.  So much flavor and they are using a nice quality pork.  Runs about $15/per person with a tip.", "pics": null}}, {"review": {"des": "Spectacular.  If you stick to the pambazo--the traditional sandwich served with potatoes and chorizo--you are going to leave here thinking this is the best Mexican joint in Chicago.<br><br>Now, if you are measuring this against other taco joints in the city, I would say El Habanero is good, but it's not my top dog.  We tried the pollo, asada, and al pastor tacos at lunch today...only the al pastor is a home run.  The rice and beans on the platter are above-average and you'll get a ton of food for under $10 with this platter, but you can always do better on that front.  (Special shout out to the corn tortillas today...they were fantastic.)<br><br>Not BYOB, but otherwise, a great experience for lunch.  Get the pambazo and thank all of us Yelpers later!", "pics": null}}, {"review": {"des": "I went to my sisters house and we decided to try this place out based on the good Yelp reviews. I ordered the chicken huarache since I haven't had one in a long time now that I live in the suburbs. My sister and her hubby each ordered chilaquiles with pollo and steak. First of all, you have to pay to park by here, second it's cash only which sucked, and third, they got our order wrong and the place wasn't even busy yet. The people here were nice and the atmosphere was quiet. Prices were average and so was the food. Brother in law wanted the chilaquiles rojos so they could be spicy and they gave him green. They both stated their dishes were just okay and rated them 6 out of 10. My huarache was tasteless and not much meat, beans or toppings on it besides cheese. It was also super thin which I was surprised to see. I think I could've made something tastier at home and I barely can cook good food so that says a lot. This is why they get 2 stars in my books. Wouldn't go back or recommend.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wx9eS5AevLGpqfTAvqERng/348s.jpg", "caption": "Tasteless huarache full of mostly cheese"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rMTbasf8usbWKIOr3J4R7g/168s.jpg", "caption": "Chicken huarache"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5b2bVxzftdIUlAHWeYPdsA/168s.jpg", "caption": "Chilaquiles verdes con pollo"}]}}, {"review": {"des": "I love this place!! It's great for a quick lunch break. Lots of great options & nice staff.", "pics": null}}, {"review": {"des": "Such sweet and thoughtful owners who came over to the table to introduce themselves and thank us for coming! The food was wonderful, highly recommend the chorizo!", "pics": null}}, {"review": {"des": "Cash only - this place has a great flavor to it. I have been there several times and love most of the items on the menu. Wish they would not be so generic with the beans and rice.", "pics": null}}, {"review": {"des": "Best Mexican restaurant in the city! I'm originally from Mexico City and I have to say this won my heart. I am visiting from Arizona, and this was the first restaurant I ate at. The ambience is beautiful, homey, and just perfect. I came back before my flight and the experience was just as amazing! It reminded me of the days my grandma would cook for me, so authentic with so much love. Muchísimas gracias, excelente!!", "pics": null}}, {"review": {"des": "Food was amazing me and my sister went there for launch the tacos were great the rice was good everything was fresh and hot guacamole was perfect", "pics": null}}, {"review": {"des": "Wonder place and beautiful people. Such a treat to bring Mexico City food to Chicago. Wish she brought it to ny!", "pics": null}}, {"review": {"des": "Wow. Pambazo is so delicious.its kind of salty buttery taste. I picked up. It takes max. 10 min. Enough sitting space.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AGrRX12TJx1oS6yw26gtyA/348s.jpg", "caption": "Chicken pambazo ! Delicious!"}]}}, {"review": {"des": "There was a highschool kid eating McDonald's when I first walked in.  That should have been my clue.  The asada burrito was meh and the horchata was bleh.  I threw the jumbo horchata out after a few sips.  They have such a high rating that I wonder if it was the time of day?  If that's the case, don't go there around 1:30-2pm.", "pics": null}}, {"review": {"des": "Awesome place with authentic Mexican food! Our entire table enjoyed everything they ordered! I had the chicken pambazo ..probably one of the best things I've ever tasted lol", "pics": null}}, {"review": {"des": "This place has the best Mexican food in Chicago. The horchata is creamy and has a good balance of flavors, the pembazos  are giant, yet airy (somehow they've managed to get the crust to have the texture of a croissant), and the rice and beans are also excellent. I had the pollo, and I would highly recommend. My only gripe with the place is that it is cash only, other than that it's perfect. FYI: this place is NOT BYOB as some previous reviews report.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qK_3vRzi4_z90dViG2wE9g/348s.jpg", "caption": "Pollo pambazo"}]}}, {"review": {"des": "This was our first time there and other than it being cash only, we were very impressed. Lorena, the owner, makes all the food from scratch- including the amazing complimentary salsa that arrives at the beginning of your meal.<br>The salsa is chunky and rich, not like the pale imitations from the chip aisle in the grocery store. This salsa has herbs and flavor- sure it gives you bad breath and it's WORTH IT!<br>My husband had chorizo and eggs which was plentiful and delicious. He chose a double side of retried beans and corn tortillas.<br>I was very happy with my cheese enchiladas with Rojas sauce, which is not spicy (my preference), along with very nice helpings of rice and refried beans.<br>We supplemented this with an order of very guacamole and extra chips.<br>I like that the Diet Coke comes in cans so that it's always delicious.<br>It would be nice to be offered small plates for our guacamole and chips, but we didn't ask for them either.<br>On the whole, we were very pleased with the service from the owners' children (wait staff) and Lorena (chef). She came out from the back now and then to make sure everyone was happy with there food and to keep a general eye on things. <br>Next time my husband will definitely try one of the variations of the homemade flans or the tres leches available as deserts. Portions were generous and it was brunch time, so...", "pics": null}}, {"review": {"des": "Just moved here from California about 8 months ago and I've been to a handful of Mexican restaurants in the city and almost to every taqueria in Nor Cal and LA. El Habanero hands down has been the best spot so far I've found in Chicago. Their pambazo was the best thing that's happened to me. It's basically the ultimate torta!! Even though it's a 40 min train/ bus ride from where I live. I would definitely come back. The woman who helped us was so nice and friendly. She welcomed me saying the restaurant is your home.", "pics": null}}, {"review": {"des": "Yay!  thanks Yelpers for pointing me here.  I'm not a huge Mexican food fan because it is usually too heavy and rich.  I tend to stick with tacos as they are on the lighter side.   For whatever reason, I opted for the steak burrito as it looked really fresh on Yelp without the rice and cheese overload. It was magnificent.  The tortilla was crispy on the outside without being greasy.  The inside was well balanced with the works. There was so much flavor because of the careful blend of ingredients. I only ate half but will polish off the 2nd half tomorrow lol.  The service also sets this place apart for other places in the area. The woman was one of the owners.  She was warm and friendly.  As I sat waiting for my burrito, two other guests at a table told her their meal was the best Mexican food they ever had.   She gave me my burrito and said \"see you again soon\".  Yes, yes, you will! Now I need to try that pambazo sandwich ;)", "pics": null}}, {"review": {"des": "I ate at El Habanero with my husband a few weeks ago and let me tell you - it was a wonderful experience.  The food was delicious and the service was excellent. We both had their signature sandwich - the Pambazo. It's a traditional Mexican sandwich in which the bread is dipped in a guahillo pepper based salsa, grilled to perfection and filled with your choice of meat. It is so flavorful and delicious.  The sauce makes your fingers red but it is so worth it!  The owner/chef and his wife were so nice and welcoming. It was like eating in their home.  The owner came out and talked to us about the sandwich and how much he enjoyed it growing up.  We love this place, can't wait to visit again!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BMV02CsegxQOrn6AUMXPJg/348s.jpg", "caption": "Pambazo - so delicious!"}]}}, {"review": {"des": "Fantastic! Wonderful different types of salsas, the Pambazo sandwiches were out of this world! Highly recommend. Great friendly service! Gracias!", "pics": null}}, {"review": {"des": "So this spot is near my job and I've only been here twice but both times have been a good experience. As a vegan it can be a challenge to order and some<br>Restaurants aren't as willing to accommodate but my server is more than happy to make recommendations for add ins that aren't necessarily on the menu. She suggested a pambazoo which she was able to make vegan and it was superb! Great flavors and great service. Will definitely be returning", "pics": null}}, {"review": {"des": "Great Mexican place! Perfect, small corner spot with reasonable prices and delicious food! Have been once and ordered a large to-go meal for four. Everything was nicely packed up and got a ton of salsa. The salsa is amazing by the way. Suuuuper garlic-y (or some other spice) so your breath will be bumpin for a while, but its worth it. <br>The food is really good. All the meat is tender and well seasoned, the tortillas are good and the guac is excellent as well. Really no complaints! <br><br>Its cash only so keep that in mind.<br><br>Exited to go back for another meal!", "pics": null}}]}