{"name": "el-ideas-chicago-2", "reviews": [{"review": {"des": "My, oh, my! This has been one of the best culinary experiences I have had in a long time. While I've eaten at two and three star restaurants, EL Ideas delivers just as well, if not better, on both taste and experience. <br><br>The setting of the restaurant is not exactly what you would expect from a \"fine-dining\" restaurant. EL Ideas exudes a fun, modern, industrial chic vibe. As we were celebrating my fiance's birthday, the staff placed a little card on our table for us prior to our arrival. It was a sweet touch, and while the staff were laid back, they were also attentive and polite. <br><br>Without ruining too much of the magic of having dinner there, all I can say is it is out of the box. The kitchen is open, so you can go in and see the chefs plate the food and interact with them before you sit down and taste the course. <br><br>Another plus is you can BYOB, with no corkage fees. While we're not big drinkers, it's nice to know that we have the option to bring however many bottles we'd like. The ticket system also makes dining enjoyable, because you don't feel like you've paid after you ate so the idea of a \"fun dinner party\" really sticks.", "pics": null}}, {"review": {"des": "This is definitely a unique michelin star restaurant! Right when you walk in, there is a very casual vibe. Everyone there is so friendly right from the second you walk in! We sat at the chef's table and had a chance to interact with Chef Foss a lot throughout the meal! It is nice even if you aren't at the chef's table though because everyone is allowed to come to the kitchen and mingle with the chef and the other guests! <br><br>Each dish is announced out loud to every and then every begins eating that dish at the same time. It is a community feel!<br><br>There are ice cream and fries on the menu, which was a highlight! Who doesn't like ice cream and fries?!", "pics": null}}, {"review": {"des": "I have absolutely nothing but love and admiration for this place.  I have been so lucky to visit on 3 occasions and I continue to dream about my next visit. <br>This was the first Michelin restaurant we visited in Chicago - just days after my wife and I were married.  Since then we have continued to rave about this place to colleagues (all of which have been equally impressed) and visited 2 more times.  I am convinced that with the fine dinning options in the city this place offers you the most for your money - certainly if you enjoy molecular or modernized fine dinning.  I suspect if the service was more white table cloth in style they would be knocking on the door for a 2nd star -- but this place ain't about white table cloth service and that's one of the reasons I love it so much.<br><br>They are extremely accommodating to dietary restrictions and are undyingly focused on making you feel at ease, comfortable and happy. Just don't get thrown off by the location, when we pulled up the first time we had some trepidation about getting out of the Uber (even the driver asked us if the address was correct).<br><br>They are purposefully playful, laid back and start meals by plating food without cutlery (time to lick your plates everyone).  The vibe is friendly and people are encouraged to socialize, spend time with the chefs in the kitchen and they are more than happy to discuss cooking techniques.  Go check out the spices in the back of the kitchen they are some playful jokes and surprises hidden back there.  It just feels like the experience is focused on having fun while eating a supremely delicious meal.  <br>The food is elevated, technical, the ingredients are often luscious and their signature play on \"fries in a Wendy frosty\" inspired by the chef's children encapsulates so perfectly their style of cooking.  Oh did I mention it's BYOB with NO corkage fee -- BOOYAH!!<br><br>I love you guys - I truly love you guys!!!", "pics": null}}, {"review": {"des": "This was phenomenal and so much fun. I've never had a tasting menu experience that was more fun or more memorable. I think my main advice is to BYOB (we did bubbles, white and red), and bring an open mind. This is also the first tasting menu I've ever had that was as substantial, as in, I didn't get college girl wasted on accident due to more booze than food. Yes, some of the dishes were admittedly pretty much a bite or two, but there were almost as many that were much heartier than you've come to expect. <br><br>I love that you don't get the menu until the end. Printed over a map of the EL, it's probably the most Chicago thing ever. Here are my highlights of this tasting menu from last weekend. <br><br>Salt cod fritter with watermelon and eggplant: I don't think I'll ever be able to eat regular fish and chips again! This was so good. <br><br>French fries and ice cream - a tribute to the chef's children, little girls who like to dip their french fries in ice cream. The ice cream was made with liquid nitrogen, and the fries at the bottom of the shake of were still hot. So good and so different and fun. <br><br>Squab is delicious. Who knew? The strip was great too. So many hits on this menu and not a single thing I didn't like. I don't consider myself to be the most adventurous eater, so don't let yourself miss out on an amazingly fun experience just because you don't want to eat something you don't love or don't know what it is. I promise you, these flavor combinations will make you love something you never thought you could.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/a4dSHS_oRqFBYyxIG0JvMA/348s.jpg", "caption": "Prosciutto/ cantaloupe/ kombu/ shoyu/ tosaka / furakakae"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1GfB_kTmnxKFVTAfyDQ3iA/168s.jpg", "caption": "Squab / huckleberry / barley / wheat berry / hay"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6Z03jVVPrmLtvi9u7w7anw/168s.jpg", "caption": "Salt cod fritter / crab / watermelon / tomato / eggplant / kochukaru"}]}}, {"review": {"des": "I came here on a surprise date with my fella.  From where the car dropped us off...I was really, really confused!  Once we were inside, it all made so much more sense.  The staff was so warm and welcoming, yay!  I soon found out what we were in store for; a 13 course meal!  WHAT?!  I was a little nervous (not a big seafood lover), but really enjoyed the entire experience.  <br><br>All of the plates were complex and far beyond anything I could make at home.  So fun!  Have any dietary issues?  They can work with it!  I can't do much dairy, so they created alternatives along the way that were so tasty.  <br><br>My favorite part of the whole experience?  The relaxed atmosphere!  It's BYOB.  There's no dress code.  The chefs are in t-shirts and they encourage you to walk around and chat with them between courses.  It's 5 star food, 5 star service, 5 star tableware quality, and the warmth of being in someone's 20-seat dining room.  Highly recommend as the menu is always evolving!  Instagrammers will have tons to photograph.", "pics": null}}, {"review": {"des": "Honest review: (like a 3-3.5 ) Ambiance: its hipsterish/ pretty like theres awesome graffiti art theirs nice paintings but its white table cloth. Service: service was good described things then changed plates attentive good personalities just their too laid back they need to be more professional like its a cool hangout but just swearing wasn't necessary. One issue with service was they gave a lady a purse hanger but didnt give us one? So we asked for one and when we were going up to see the kitchen ( u can walk up to the kitchen and interact with the chefs really cool and different) she took her purse because girls dont like their purse lying around n when we got back it was gone and im like wow they took it back that was rude like their really nice n good just be more professional. Food: everyone told me that el ideas was the best meal they ever had. To me honestly food was good not great i had better meals alot of dishes were basic and not flavorful Best things: shrimp/ salmon/ scallop/ french fries/ sirloin/ fries<br><br>Shrimp (no silverware given your going to have to lick the plate)  it's interesting theres a lot of texture and you could taste every ingriendent separately it was good but not the best amuse buche i ever had was expecting more flavor<br><br>Salmon (sorbet/ deli flavors): i loved this the salmon had a great saltiness to it there was masa chips for crunch tben the aquachile is in a sorbet so it adds a spicy cool flavor then the sauce was acidic and the avocado adds creamyness really good my only complaint could have used more heat<br><br>Pierogi: (sour cream / ramp/ trout roe / potato) I usually dont like pierogis because their basic but this was tasty. The pierogi was a basic pierogi wish it was fried for crispyness and theres alot of roe to add a seafood flavor. Felt they could have made it tastier cause its just a plain pierogi with roe<br><br>Scallop: i love raw scallops its the best vehicle for ceviche the raw veggies add freshness and the liver adds decadence and the bread stick ands crunch and richness my complaints are they should have used foie instead of chicken livers because the chicken overpowers the scallops and they should have used bread crumbs or croutons cause it was hard to eat <br><br>French fries and icecream: this was the best dish of the nite. The icecream had the best texture and theres little pieces of fried potatoes at the bottom my complaint is its to small would have loved a bigger portion<br><br>Sweetbreads: the sweetbreads were decadent would have loved a bigger portion for more richness the sauce is sweet and the phyllo adds crunch my issue was the beets its such a strong flavor and theres so much u cant taste anything else<br><br>Chawanmushi: unique take on escargot best one i ever had just why make this feel it was to basic n not unique enough to be served at this type restaurant would remove it from the menu<br><br>Secreto: worst dish of the nite way to acidic greens overly roasted burnt tasting n pork was overcooked inedible no one could cut through the meat was so tuff and everyone was  looking at each other awkwardly like can we have a steak knife plz<br><br>Sirloin: one of the best steak dishes i ever had. The steak was cooked perfectly. The bbq sauce was supper complex and delicous it was spicy and decadent. The pickled green straberries were amazing adding sweetness and acidity. Theres chicaron for crunch n there was a bbq seasoning on there. No complaints<br><br>Flan: amazing. Texturally it was Devine. Theres these candied chestnuts that add texture just put more and add a little salt. Then theres a blood orange sauce to add acidity. Just add salt and put more chestnuts really was a good dessert<br><br>Smores: really basic dessert idk why its on the menu. The chef will burn wood to give the place an aroma but honestly felt it was a waste of time would have loved if we ourselves did something cool with fire or there was a cool presentation. Its basically a deepfried marshmallow icecream coated with gram cracker crust with a chocolate sauce. The issue was u can really taste the grease from the frying it was so un appetizing it reminded me of micky ds when they never get rid of their fryer oil and u could smell that oil like a block away. The icecream was good texturally and tasty n there was a basic chocolate sauce like nothing was done to elevate the flavor of this dish was really disappointed <br><br>at the end u can pick between coffee or tea with a little kolaczki really basic should have done like an affogato or gave really tasty  MIGNARDISES just was expecting more", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FOoIO_dcRAbegZeej4CBmg/348s.jpg", "caption": "Bill for 2 people"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/z3qbTHCtLcEX8MxW84GVjw/168s.jpg", "caption": "Art"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/v9nPzRXEAANao8bra2qHFA/168s.jpg", "caption": "Front door"}]}}, {"review": {"des": "This was the best dinner experience I've ever had in my life. Exploring restaurants of all sorts is passion of mine. Fancy, divey, price-fixed, etc. EL Ideas was not only amazing food, it was like this out of the box event that detached us from normal life and threw us into some unique dinner party. <br><br>One note I'll make - I'm sure its still great with 2 people, but a group of 3-5 aligns well to this. You will have fun together. <br><br>I'll just have to walk through it all sequentially.<br><br>No idea where the Uber took us, someplace West, but no where I'd been. You walk in and they get you all seated in a small, but  very cozy room. Maybe 10 tables? You have your distance too. My sister had gum and within 5 seconds of her looking for a wrapper to put it in, they approach her with a pre-made gum disposal device (folder paper, but cmon that is impressive service!) <br><br>Being BYOB we had all sorts of wine and craft beer. We drink for about 10 minutes and then every table is seated. They start your meals together. And each course following comes out to all tables at once. The chef announces each course to the whole place every round. We make our way through the courses, drinking more, loving the food, and this music they have going just keeps vibing harder and harder. By 2 hours in I felt like every table was drunk and dancing in their chairs (in a formal, respectful way). <br><br>The whole atmosphere in there was beyond a dinner. And just so much fun with the music, drinks, and the personalities of the kitchen crew. But onto the food..<br><br>I won't call out each dish individually, but a couple. I've been to coursed meals where you get a bite, its great and all, but you have no clue what it was and it wouldn't impact your life never trying it again. This was different. The Wagyu beef dish? Nice portion, and amazing, I craved that for days after. Some potato-milkshake glass experiment? I was scraping my friend's leftover bit because it was so good. Seriously it was all so awesome. <br><br>I can write a whole bunch more but just go see for yourself. Bring some nice bottles, empty stomach, and take it all in.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FpHVc1fZxYLjHXy7A6Y1Dg/348s.jpg", "caption": "Exploring the open kitchen area"}]}}, {"review": {"des": "The chef's table was awesome! Fairly easy to get reservations by planning a few week's out. We went to El several years ago for the 90s night, and wanted to try the non-theme menu. Loved it!<br><br>The food is absolutely fabulous. From their concept of a Caesar salad bite, to lamb, pheasant, and creative dishes like a frosty with fries, every dish was out of its world. While the restaurant itself is casual and interactive, the plating is artistic and beautiful. <br><br>All customers are welcome to come back to the kitchen and watch the magic happen. The chef's are interactive and answer questions that arise. I highly recommend El for a unique and delicious night out.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/msEc4-kWam4OponbZw5fSA/348s.jpg", "caption": "Making of the frosty with fries"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gfnMpQ_qoK0RtwDlG4vNrg/168s.jpg", "caption": "Sea bass"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/osSkkrKne6K6neU2zW3DDQ/168s.jpg", "caption": "Lobster and apple"}]}}, {"review": {"des": "This is the best restaurant I've been to in all of Chicago. <br><br>Let me start by saying this fine-dining restaurant is a hole in the wall establishment, tucked in behind in a sketchy alley next to the train tracks. But that's because this place is a hidden jewel in the midst of the giant city of Chicago. <br><br>Chef Foss and his staff are not only talented in their culinary skills, but their personalities and friendliness are also extraordinary. Never have I seen a master Chef rap to the lyrics while making his infamous french fries & ice cream milk shake. Nor have I ever been able to freely walk around the restaurant and interact with the chefs as they prepare the food. Chef Foss removes the intense, perfectionist atmosphere associated with fine dining and instead, creates a fun, engaging, and interactive fine dining environment. This restaurant was awarded a Michelin star in the past, and EL Ideas' food is still worthy of the star. <br><br>There were 13 courses served throughout the 2 and a half hour night. My top 5 were the egg tart with caviar, the scallop with okra and sweet potato, the pierogi, the lamb, and finally the soda shop ice cream with dulcey. Everything was exquisite, and the ingredients used were all quality: you could taste it. <br><br>If you have a special day coming up, I recommend everyone to come stop by EL ideas at some point. It was the most memorable dinner experience I've encountered to date.", "pics": null}}, {"review": {"des": "My husband brought me here for our anniversary dinner.  When we first stepped out I was a little skeptical but the ambiance and layout of the place is actually really neat.  All of the dishes were delicious, amazing, creative, well thought out, and fun!  The chefs explain each tasting course prior to the whole restaurant eating it together and its a really fun, lively experience.  Its a Michelin star restaurant and definitely earned that star.  The restaurant does cater for vegetarians and every dish was fabulous!", "pics": null}}, {"review": {"des": "Recently went back to Chicago for a conference and my boyfriend decided to surprise me with a nice dinner reservation at one of the many Michelin star restaurants Chicago has to offer! So jealous Chicago has so many while in LA we have none! This meal was one of the best meals I've ever had, 12 courses, all delicious with such attention to detail and in such an Intimate setting! Loved the idea of an open kitchen, we're both foodies and loved being able to just walk up to the chefs while they were cooking and prepping the dishes. Such a fun experience! <br><br>Some of my favorites were the grilled scallop with the pickled okra, the French fries and ice cream of course is one of the best dishes I've ever had, the foie gras was very interesting because it wasn't your typical presentation, it was covered in white chocolate and blackberries, a sweet and savory transition to the dessert! Such a nice flow in the progression of the courses. Very thoughtful and planned out meal. <br><br>I do believe that the people that you end up dining with can really enhance your whole experience, unfortunately the night we ate here, people kept to themselves mostly, I did see some tables on the other side chatting and exchanging glasses of wine with each other! Wish our neighbors were more open to socializing, but that had nothing to do with the restaurant, all in all still had a wonderful meal! Bring at least 2 bottles of wine with you! That way you can share and enjoy!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lkM874kTWGY5RdfSri-e3Q/348s.jpg", "caption": "Watching the magic come together was amazing"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UjlQijDV8F3exQQ-h0zUHQ/168s.jpg", "caption": "Duck breast perfectly cooked!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/go4HDaqZk19vxroI42apKw/168s.jpg", "caption": "Foie gras. Delicious and very different"}]}}, {"review": {"des": "I( its about 200 dollars per person when u make reservation ask to sit at chefs table/ it's an open kitchen u can walk up to the kitchen talk to the chefs take pictures and really interact with the food) I was very skeptical when I got to the neighborhood of the location I did not believe it that this was the place.  I loved the decor of the restaurant simple chic.   I was so amazed of how awesome the team worked together on serving and accommodating everyone at the restaurant.   No wonder they have a Michelin star.  Everyone works so hard as a team including the chefs to serve and to clean after the meal was served.   I loved the service I was so delighted on how I was treated like a queen by everyone.   I had so much fun taking pictures of the dishes being prepared<br>and for talking to the chefs of their beautiful creations.  I was having a such enjoyable evening.  The food was good not the best I had.  The meats were cooked but too tuff to chew like the Secretowas so tuff and over cooked I was shocked I was like how does a restaurant of this caliber not know how to cook pork while I was watching the chef cook the pork In my head I  was like stop overcrowding the pan and stop cooking the pork it's done!  I did not care for the scallop dish the chicken liver was way to gamey and the bread stick made it difficult to eat. Chawanmushiwas really basic and bland The food is better at temporis.  The only thing here at El Ideas is the great service the new innovation and creativity in chemistry done to the food.  It is a lot of fun but not for the price for the food.  You can bring your own ViNO At no cork fee  which is good like people here were really getting wasted and having fun great hangout spot.   I really enjoy the fun and the service the food could have been betteR.<br><br>I was so surprise to see this restaurant was the dishes and utensils  right in front of you like they recycle them right on the spot so my OCD got the best of me creeping out about germs I know all the restaurants  do the same but I do t get to see them wash the dishes not drying the utensils right in front of the customers <br><br> warning EL IDEAS  will charge up front so when you get your email from your reservation confirmation make sure you read it all the way to the bottom.   El Ideas does charge you 20o/o service fee plus Chicago tax.  It is about $205.00 per person.   El Ideas is BYB cork free so that's is good for the Vino aficionados.   Over all is a good fun experience so you can also get to work as a server just for the fun when the shake is done.  I had a good time.  There is parking around there but I would Uber because it is not a good area to be around.", "pics": null}}, {"review": {"des": "This review is for the front row seats experience. <br><br>Highly recommend doing this option if it is available. Such a unique experience to be able to sit at the \"chefs table\" quite literally and watch the meal being prepared. We loved getting to interact with the chefs and ask questions as they cooked. Worthy of the 5 stars because of front row seats. <br><br>This is a no frills Michelin but the food is just as good as other 2 stars.  BYOB made for a fun self curated \"pairing\" with our meal. Highly recommend you bring a few different options for the meal. <br><br>Servings are 2-3 bites each. We could have eaten more but overall we were not disappointed. The cookies and coffee at the end are a nice touch as well. <br><br>Standout dish was the leek soup and vanilla ice cream. <br><br>The location is not great. There are not many bars around to kill time before or after. Also, beware of stopping at the Water Hole lounge down the street. We were early and decided to stop for a drink before dinner... almost ruined our evening. Let's just say you need to order cans or bottles only, something that you see them open.<br><br>If you're interested in a unique dining experience that is slightly interactive then you've found your spot.", "pics": null}}, {"review": {"des": "Had a great dinner at El Ideas. You pay when you make your reservation. It has a Michelin Star, yet it is BYO with no corkage. There are really only 2 courses for which red is the best pairing, so be sure to take some white or sparkling. The atmosphere is very fun and laid back. The food is very good and creative. Favorite courses included the milkshake, the steak and the desserts. Highly recommended!", "pics": null}}, {"review": {"des": "I had a great time here. We went there at 7pm where I immediately starting drinking my bottle of wine since it is BYOB without a corkage fee. The chefs prepare the food for everyone in the restaurant at the same time. Each time a dish was brought out a chef would come out and explain the dish and some would even go on and talk about how the dish came about. Everyone was friendly and the some of the dishes were very creative and wow worthy. It's worth trying at least once!", "pics": null}}, {"review": {"des": "So pretty. So real.  Surprises every time. Joy. Adventurous dining, yet comfort food.", "pics": null}}, {"review": {"des": "I can't believe I haven't written my review for EL ideas yet. Can I give it 10 stars? <br><br>My favorite dining experience...ever! <br><br>We booked the Front Row seats inside kitchen. Best. Decision. Ever. If you are a party of 2, this is an option I highly recommend you doing. It's worth the extra money. You get to witness the magic first hand and interact with the chefs. It really makes this dining experience. You will eat your entire meal inside the kitchen. The only course we ate outside of the kitchen was the first course. <br><br>I love that EL ideas takes the stuffiness out of fine dining. And also that it's BYOB. Each dish was craft by the chefs carefully and has a story behind it. The music selection is awesome and it's a no frills dining experience. <br><br>Some of my favorite dishes from the night:<br><br>uni - lettuce, egg, cuban oregano, Italian dressing. I have only had uni this good in one other place....Sushi Kashiba in Seattle. The uni melted in your mouth and the egg and oregano just add to the flavor explosion.<br><br>french fries & ice cream - potato, leek, vanilla. It involves dry ice. Think a Wendy's Frosty and french fries. Exactly. I rest my case.<br><br>fluffernutter - peanut, chocolate, brioche, banana. This dish probably took the cake for me that night. It involved ALL of my favorite things.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ndZ_aunPlSpYHy2E35Gv2w/348s.jpg", "caption": "Chef Price prepping a course"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kd2jZzjQm3CabEookIWpcA/168s.jpg", "caption": "not-frosted-flakes - chicken skin/foie/milk/pomegrante"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6RS0RbHkbAmbJ7e8SXOS_Q/168s.jpg", "caption": "french fries & ice cream - potato/leak/vanilla"}]}}, {"review": {"des": "Came to Chitown on vacation and wanted to take my girlfriend to our first michelin star experience. I did my research and we ended up at El Ideas and we couldn't have been happier.<br><br>The restaurant is located down a small (somewhat shady) road in what looks to be an abandoned building. If you couldn't see people inside you wouldnt go in. Yet we entered and were seated near the open kitcheb in the small open restaurant. No room for more than 25.<br><br>We were treated to 12 courses and you don't get the menu until you're finished. Each dish is accompanied by a short explanation/story of the dish by 1 of the 3 amazing chefs. The first dish they don't even allow you to use silverware or fingers!! The idea is to promote a fun night. You're encouraged to mingle and can walk right into the kitchen to hang with the chefs while they cook!<br><br>It has a very trendy vibe. No sign out front, some hip hop and other good music playing, and is byob which is also cool. You must have an experimental palette as each dish had a flavor combination I had never tried before (and no thats not just because in basic). We had everything from beef tongue and duck to lobster and scallops. <br><br>One of the most intriguing dishes was the transition between sweet and savory. It was a BlackBerry sorbet with a white chocolate covered foie gras. So rich it blew my mind.<br><br>Anyone looking for a special night out look no further. This is a dining experience to remember!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zQyv3cpXTTaapwSQ30ncfw/348s.jpg", "caption": "Cheesecake baklava (I think)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/81zyHidpiCL-igleP_tVUA/168s.jpg", "caption": "Blackberry sorbet with white chocolate covered foie gras"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Hs6wQ7Nr1JPpYDMovWT7VA/168s.jpg", "caption": "Dessert!"}]}}, {"review": {"des": "My SO did real good planning our 5 year anniversary trip to Chicago, but the highlight of it was surprising me with reservations at EL Ideas. Since he did all the planning, I was left in the dark about what EL Ideas was all about and I'm glad he kept that way because it is a fun and unique experience.<br><br>By experience, you don't just show up to eat a multi course meal. Instead, you're encouraged to mingle with everyone, and yes that includes the staff. I love that curiosity is encouraged within reason. Yes you may come hang out in the kitchen area but not right where someone might be frying or stirring something magical. <br><br>Before dinner begins, Chef Foss will start off with an intro about the restaurant and its concept. Before I knew it we were served our first course of the night: Wagyu beef, miso sea bean, curried tomato, uni & caviar. It was beautifully plated and I was thrown off at the next piece of instruction, \"do not use hands or utensils to eat\". It's a good thing I was wearing long lasting lipstick so I didn't have to worry about my lipstick getting all over the plate. I have to say, I am glad we were told to eat like this because you will want to savor every bit of this first course shamelessly!<br><br>The other fun course of the night was the sixth course. One of the couples dining that night volunteered to serve everyone a parfait, and told us to not touch it until after Chef Foss's instructions. He describe this parfait was inspired by dipping french fries into ice cream (a childhood favorite of mine!) and at the count of 3, to dive our spoons in. Once we all did that, a poof of fog spurts out of the parfait. So fun! I'm sure you can find a clip of this on IG, but you have to experience it in the moment. Anyways, this parfait consists of potato leek fries, liquid nitro, and vanilla ice cream soup. You still get the warm and slight crunch of fries yet the cold and creaminess of the ice cream. Very nicely done.<br><br>Fun, amazing food, great hip hop music, laid back ambiance, and BYOB with no corkage fee, EL Ideas is a great Michelin restaurant for any occasion. <br><br>**********<br>Also, if you are still curious what else I ate that night, here it is:<br><br>2. Chilled cucumber avocado soup, poached lobster, blossoms, coriander, lobster oil<br><br>3. Shrimp & corn ice cream with cojita cheese<br><br>4. Halibut with wasabi puree, ricotta, peas, powdered wasabi<br><br>5. Cold smoked scallop, camomille milk, porcini, lilies<br><br>7. Savory pancake, smoked mussels, pickled peppers, garlic scape<br><br>8. Cured pig head salad walnut pesto, black truffle crepe with truffle cream cheese mustard<br><br>9. Done in 3 ways: Seared and fried blossoms in saffron, lamb<br><br>10. Foie, peaches, gingerbread crumbs<br><br>11. Blueberry yuzu and compote <br><br>12. Cherries (Garcia), pistacio, balsamic vinegar", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1Dmvm4NJbAs1cNg4WUTGfw/348s.jpg", "caption": "BYOB. No corkage fee involved!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6qaCHVXKjEWe1Szjyb9-gQ/168s.jpg", "caption": "Courses 7-12"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dgfGjJpjC4ct9E9g24LaTQ/168s.jpg", "caption": "Courses 1-6"}]}}, {"review": {"des": "For about $200~ per person, I think this meal was more of a four star experience. Only because out of the 12 courses we had, the first three or four was noteworthy and the rest suffered from meh-ness.<br><br>The restaurant is really quite out of the way from everywhere else, so definitely take an Uber there. It's BYOB, and their website has some general recommendations. The interior is quite unpretentious, and they market it as a 'dinner party where you can walk around and mingle and explore' if you wish. <br><br>Because all seatings start at the same time, I beseech you to arrive on time if you do decide to come here because no one gets served until all parties are seated. We had a couple who was 20 minutes late. *grumbles*<br><br>Since all courses are served at the same time for every table, the chef pauses the music, announces the dish and explains a little bit behind its concept. Some dishes are interactive - you eat with your fingers, you lick off the plate, you dip your spoon for a surprising sizzle.<br><br>My favorite dishes were the scallop, French fries and ice cream (a molecular gastronomic-esque experience), the lobster and squash pierogi.<br><br>However, the partridge needed a steak knife, not a regular knife. The oxtail was wrapped in a chewy and doughy wrapper. The dessert courses were most lacking in my mind, being overly sweet and sugary.<br><br>Overall, it was a good meal, but I think I expected a little better execution throughout.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iYOIp1uqr4tV5qYgZMS1jA/348s.jpg", "caption": "The pre-dessert: foie gras enrobed in white chocolate in a blackberry sorbet and sorrel ice"}]}}, {"review": {"des": "Surrounded on three sides by train tracks, the EL in EL Ideas is named after the elevated Chicago trains. Ironically, the closest stop is about a 12 minute walk and the best way to arrive is by taxi.<br><br>It's a fun approach to a foodie adventure. The inventiveness of the dishes reminds me of Alinea but with the friendliness of Chef Stephanie Izard's ticketed suppers at the Little Goat. The out-of-the-way location is like Ada Street.<br><br>I really like how we could go back and interact with the chefs and how once they even had me help by bringing a few plates out. EL Ideas is best described as playful. Chef Phillip Foss set the tone by having us lick our plates with the first course. Later, guests would ask questions about the food that the chefs were plating and they coyly answered, \"You'll have to wait and see.\"<br><br>All three chefs made the playlist for the evening. It varied wildly from R&B to EDM to jams that blended into the background.<br><br>Their dishes were also varied. Chef and owner Phillip Foss was the most inventive and Chef Catherine Price wasn't too far behind (shout out to her amazing Banana dish). Chef David Goody had a lot of dishes that seemed to be inspired by other countries and I am in awe of his Earl Grey dish. If you like trying new flavor combinations, textures and approaches to food, then EL Ideas delivers. Some dishes were clear stand-outs for me but all of them were good enough to lick the plate.<br><br>Despite the diminutive size of the dishes, I started to get full around the seventh course. Thankfully, that's about when they gracefully transitioned to milder flavors and then sweet for dessert. They offered tea and coffee afterward which was a classy and unexpected touch.<br><br>Interacting with the chefs was my favorite, but I also loved chatting with some of the other guests when we met back in the kitchen. People who buy tickets to foodie events and restaurants are often friendly. I'm sure there's an occasional odd duck guest who stumbles to EL Ideas by accident and would prefer a traditional fine-dining experience. That's cool for them but EL Ideas isn't that.<br><br>For $411.06 (including tax and tip) for two people, EL Ideas is not the sort of place most people would stumble to by accident anyway. EL Ideas is an intentional destination - an experience. The EL takes you places.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-U2GOfrkCY4NKPCZXqdYcw/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tifeAd0dvMycduGhdH8zcQ/168s.jpg", "caption": "Chocolate. Maraschino / marshmallow / coconut / pecan."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hFwLHcQnmqlOBhq81rVCsA/168s.jpg", "caption": "Earl Grey. White chocolate / Japanese peach / almond / shiso."}]}}, {"review": {"des": "Unlike other fine dining restaurants, the goal of EL Ideas is to create an environment resembling a dinner party with friends. But instead of crowding strangers together at a communal table, EL Ideas provides conventional seating and achieves its goal through a casual approach that encourages guests to wander into the kitchen. This works really well, allowing the extroverts to gather by the prep table and converse, while the introverts and lovers can have a private experience at their own seats.<br><br>The meal gets off to an eclectic start from the first course, which was wagyu beef served with a sauce but no utensils, and the instruction not to use your fingers. Once you've licked your meal off your plate it's hard to be stuffy.<br><br>The environment is spacious and trendy, the music an eclectic mix that isn't too loud, and the chefs and servers are all welcoming and conversational. <br><br>The only aspect of EL Ideas I can't be wholly enthusiastic about is the food. We had twelve courses, and almost every single course contained at least one really wonderful ingredient. But almost every single course included many other ingredients that rarely seemed to combine to create a result greater than the individual parts. In this respect it reminded me of 42 Grams, where a tremendous amount of work had obviously gone into the dozens of exotic components and preparations, but didn't quite justify the end result.<br><br>The exception was \"French Fries and Ice Cream,\" a truly stunning course that I would rank with some of the greatest molecular gastronomy ever produced at Moto. An old-fashioned malt shop glass was filled with a frozen concoction resembling a vanilla shake, with a liquid nitrogen frozen cap. When we plunged our spoons into the top, a geyser of vapor erupted, caused by the hot potato soup in the bottom. The combination of hot and cold, soft and crunchy, sweet and salty was absolutely sublime. And yes, it tasted like a vanilla shake with french fries in it. This one course was worth the price of admission.<br><br>EL Ideas is BYOB, with individual ice buckets at each table. I suggest bringing a Blanc de Noir Champagne, which will match nearly all the food. If you want a second bottle, a lighter red would work best, such as a Burgundy.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Jgkox33rpa_i1KlwY6L1rw/348s.jpg", "caption": "Quail"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IBzdMqcpBvGJZbuObqnuCA/168s.jpg", "caption": "Rabbit ragu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/y1h8wcDrwDSmS4AyNtpexA/168s.jpg", "caption": "French fried frosty"}]}}, {"review": {"des": "The hubs and I were looking for a fun night out to celebrate our first wedding anniversary. After searching the scene and coming across the same old same, we decided to give El Ideas a shot and boy am I happy we did. The short of it: one of the most memorable meals I've had in a long time. <br><br>Now don't let the location of 14th and Western scare you...it only adds to the allure. It's like a not so secret hidden little gem. The place is tiny, seating approximately 20 people at a time. It's BYOB as mentioned, so you save big on drinks. Not to mention, the host told me they don't judge...so feel free to bring endless bottles of wine if that's your fancy! The whole experience from start to finish was just F.U.N. The staff encourages you to talk to your neighbor and meet some new friends, and even to get up and take a gander at the magic of what's going on behind the curtain (or lack there of). <br><br>It's 13 courses of endless creativity. Each dish is served simultaneously and the staff explains what you will be feasting on before it arrives at your table. The personal favorites would have to be the French fries and frosty combo...of course it was a bit more upscale than this. Anytime you pair salty and sweet mixed with a little liquid nitrogen, you are sure to please a crowd. Also at the top of my list was the king crab, and the fried green beans...oh and the white fish...and the duck...seriously I can't decide. Each plate was deliciously interesting and did not disappoint. <br><br>I will say however, after 13 courses and $400+ later...we did leave hungry. Now I wasn't expecting to eat a rib sticking meal as I knew the portions would be on the small seeing as it fine dining. But I guess the fact that we left and actually ordered tacos from Carbon should say more about us and our appetites, than El Ideas itself (sigh). <br><br>It's hard to describe the awe of this fun and funky little joint to someone but you just have to check it out and see for yourself. It puts stuffy fine dining to shame with the eclectic ambiance and killer music. Thank you so much El Ideas for making our first anniversary one for the books:)", "pics": null}}, {"review": {"des": "Come in with an open mind, and you'll far exceed the experience you could ever envision at El Ideas.  <br><br>Bringing layers of creativity and an imaginary sense of whimsical, Chef Phillip Foss and his creative partners, tests your senses on every level possible.  Guiding you in and out of childhood memories that are paired with visual and tasting ques, this dining whirlwind should never be labeled as anything below extraordinary.  <br><br>While the building's exterior foundation is solid brick, there is a subtle layer of softness that rests inside.  White linen tablecloths and napkins gently drape each table that that are each paired with an ice bucket for either wine or beer, (BYOB). The windows display toy train cars to mimic the experience of Chicago's \"L\" and to bring a sense of enlightenment and playfulness to the artfully crafted hands of the chefs.  <br><br>The open kitchen is like a theatrical performance, and it's seemingly difficult to carry on a conversation at your table, as your eyes gaze right and left watching the chefs in their true form - artists.  Masterfully using small tweezers to place small, delicate flowers on plates and drizzle varies sauces like squid ink, painting a plate appears flawless.  But the true appreciation of their hard work is more than welcomed by the colors of the plates, the  presentation and finally, the combination of flavors from each bite. <br><br>Just like taking the \"L\", you don't always go the same route and it seems like their menu has a similar concept - it's never the same. For June, Quail, cuddle fish, Mediterranean bass, soft shell crab and wagyu beef were all featured.  Pricing for two people falls just shy under $430.00, but the memories gained from being in this high energy space breathes new life into the world of fine dining.  <br><br>Experience El Ideas for yourself.", "pics": null}}, {"review": {"des": "Dinner at El Ideas was a wonderful experience all-around - the food, the people, and the atmosphere.<br><br>The price is set ($155 pp for a normal dinner, BYOB). This includes gratuity, tax, and food - you don't have to even open your wallet the day of the dinner, which takes the pressure off and lets you relax and enjoy the experience.<br><br>The restaurant itself holds about 20 people and the staff and meal format encourage you to get up, walk around, and get to know your neighbors. You can also walk up to the kitchen to chat with the chefs and watch them expertly put together what you'll see on your table in minutes. No pressure though - you are absolutely welcome to keep to yourself; you won't be uncomfortable.<br><br>Every single dish was very unique - both from the other dishes and from anything I've eaten before. The dishes were also playful - the amuse, for example, you sucked up white powder through a straw off a flat mirror plate a la classic celebrity downfall. You can really tell the chefs love their work and want to give you, the diner, the best overall experience possible.<br><br>I'd be remiss if I didn't mention how accommodating they are for dietary restrictions. My companion doesn't eat red meat or shellfish. The chefs didn't treat her as an afterthought but instead came up with exciting dish additions for her. She was thrilled with their attention to detail and creativity. <br><br>I wholeheartedly recommend El Ideas for any date, dinner group, or even solo outing - you'll truly have a great experience.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DmjbHL4R5fA2i3z3-jzrtA/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wZk5SWZUIWXoSHms_1nPfw/168s.jpg", "caption": "Chocolate"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/n1tAELFOTjCKf_QagQS2nA/168s.jpg", "caption": "Tart"}]}}, {"review": {"des": "Approachable, fun, memorable dining experience that will make you want to come back. May 2018 menu was fabulous. One of the most hospitable teams I have seen that work hard to ensure you have an amazing experience.<br>Thank you for an enjoyable evening!", "pics": null}}, {"review": {"des": "Awesome and totally worth the price of admission.   It's small, intimate and the staff really makes you feel special.  The food is creative and like nothing you've ever had before.  By comparison I've been to Alinea and there's no doubt, EL Ideas is a better experience.", "pics": null}}, {"review": {"des": "Came here for my birthday dinner. Really enjoyed the dinner party theme, that all guests get to talk to each other and chefs. It was so much fun wandering around the kitchen and asked many questions about the restaurant and the cuisine. We had 12 course tasting menu with each introduced by the chefs. Highly recommended for any occasions especially if you are looking for an interesting cuisine experience.", "pics": null}}, {"review": {"des": "I would have given 4 stars, but for their customer service. We went to El Ideas in June--my husband surprised me with dinner here to celebrate our anniversary while we were in Chicago for the weekend (we are from Chicago and plan to move back one day, but we currently live in DC). I enjoyed my meal, especially the ice cream/French fry dish. Ironically, my husband left his wedding ring in the bathroom when he took it off to wash his hands. We were so happy to hear that the ring was not lost when we got in touch with the host. Unfortunately, we had already flown back to DC so my husband asked that she send the ring FedEx/UPS or in the alternative, said his dad could swing by to pick it up and then send itback to us. For some reason, the host decided to send the ring to us USPS in a flimsy paper envelope and did not insure it at all!!! When I received the envelope it was not torn, but there was no ring inside. It had clearly contained a ring at some point bc there was the imprint of the ring on the envelope. We were at first so excited that the ring was found but so very disappointed that now it is officially lost as a result of her sending the ring to us in this manner. <br><br>I understand what you may be thinking--this is an isolated incident that has nothing to do with the quality of the food so why is she writing this review? Well, it is because the restaurant has offered us nothing since this happened--not even our money back for our meal. The wedding ring has sentimental value so it is impossible to ever fully be compensated, but there are other ways to try to rectify such a mistake.<br><br>Hopefully someone will read this and be concerned enough to call my husband back about it. It's really been an awful ordeal.", "pics": null}}, {"review": {"des": "If you're looking for a high class restaurant and a dinner EXPERIENCE, then come to El Ideas. It's the perfect set up for talking with friends about big ideas or just catching up on life. I came with 3 other business school friends and we had so much fun learning about all the different dishes and enjoying the ambience. The restaurant doesn't get too crowded so there's plenty of opportunity to carry on conversations.<br><br>The most innovative dish that I had was their take on a vanilla milkshake with fries. The vanilla ice cream was freeze dried and had an interesting melt in your mouth consistency, and on the very bottom there were little squares of salty French fries. It's a bit unconventional, but the taste was there. I also really enjoyed the wagyu beef which was perfectly cooked and also had a similar melt in your mouth consistency. <br><br>Great job team! Way to make a high dining experience tasty and not stuffy.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/n17f__DC7pW9yimows1_Zw/348s.jpg", "caption": "Half eaten milkshake with French fries...haha sorry I couldn't wait to dig in before taking a photo!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hRUfFR6z9KBW2TLcoqvfDg/168s.jpg", "caption": "Just a smell infusion of strawberries. To sniff, not eat."}]}}, {"review": {"des": "Our third time. <br>Loved the casual atmosphere, with combination of great food.  <br>We received a special note from the staff.  Each course built on the next.  Lovely.  Too hard to pick a favorite.  We also had a new dish- rabbit.  Loved it. From the three app's, the luscious proteins to the deserts, we were so seated at each serving.  <br><br>Making it even more fun was the engaging customers who were friendly, talkative and even served a course.  <br><br>Oh yeah, how can you not love the ice cream and French fries course.   <br><br>Thank you again chef and team including the back office staff to make this a special 34 anniversary meal.", "pics": null}}, {"review": {"des": "El Ideas was a fun, unique experience.  I came here with my fiancé for my birthday.  You have to buy tickets, and on the weekend there are two seatings.  We did the 9:30 seating.  Everyone sits down at the same time, and everyone is served at the same time.  The chefs explain each course to everyone at once.  It's a small restaurant with an open kitchen, so you can get up and watch the chefs plate everyone's next course, and the front of the house is a one man show.  You have to lick the the first course off of the plate which is fun.  My favorite courses were the scallop, pheasant, and their signature French fries and ice cream course.  The sauce with the scallop was so good, and the scallop was cooked perfectly.  The pheasant dish had a very flavorful jus, and who doesn't love truffle!  The French fries and ice cream uses nitrogen, so everyone got excited when this dish was being prepared.  I was a little skeptical, but the frozen potato leek soup paired with vanilla was balanced so well, and the texture was so velvety.  It just melted in your mouth. It was hot at the bottom, so there's a fun play on temperature, too.  It honestly didn't even need the fries.  After the last course, they set up coffee, tea, and biscotti for everyone!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GG53Bo8wJ1lA5PyqUzneRw/348s.jpg", "caption": "Root beer float and a sundae!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VX6qbgihnAQMV6A_ZVIuFg/168s.jpg", "caption": "Spice cake cranberry and miso chestnut"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DYpaeV8iHXCKvc1Run-76A/168s.jpg", "caption": "Lamb spinach and salsify"}]}}, {"review": {"des": "Worthy. 10-courses. Fun. BYOB (no corkage fee).  Expensive quality ingredients in casual gastronomy. <br><br>My FIRST lick the plate moment in fine dining.  Inspired by Bill.  An excellent icebreaker for first dates.  Chef's Table for 2 is the best, intimate seat in the house.<br><br>EL IDEAS represents the talented, innovative, affordable, approachable Chicago dining.  Collaborative.  In a world of chains, never seen celebrity chefs...You can chat, selfie with ALL talented staff, including Le Chef.  Bravo!  For all the GOOD that you do.  Xoxo <br><br>PRICING (as of 2.2017) that is pre-paid at time of reservation:<br>$155 [variable price] + 20% Service Charge + 10.5% Chicago Tax = $200+ pp.<br><br>You SAVE on Parking and Booze. ;-)<br><br>French pressed SPARROW COFFEE is surprisingly as neat as pour over. Tea by RARE TEA CELLARS.<br><br>Due to limited seating, 75% kitchen and 25% dining area, last minute cancellation and tardiness has consequences.<br><br>RULES:<br>- On occasion, we may need to resort to communal seating. Agreeing to sit communal increases the likelihood of getting your preferred date and time.<br>- Cancellations or date changes need to be done at least 7 days prior to you reservation.<br>- We do not have a dress code, but business casual is recommended.<br>- We do not package food to go for any reason.<br>- EL ideas tries to accommodate food allergies and restrictions. Please inform us of any restrictions you or a guest in your party may have upon making your reservation. Please keep in mind that we are a small operation with a small team and it is not feasible for us to accommodate all food preferences.<br>- Please be prompt. As all guests are served simultaneously, we recommend arriving 15 minutes prior to your reservation time in order to get settled, pour wine, etc. Those arriving late will receive the current dish in the menu's progression and will not be able to enjoy dishes served prior to their arrival.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RBDFJm_10J2C6HbgPabbDw/168s.jpg", "caption": "Menu (top to bottom) followed by corresponding left to right dishes."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wPzUALX8x18bEBzHrXRvkg/168s.jpg", "caption": "Outside"}]}}, {"review": {"des": "I hit two birds with one stone by dining at EL Ideas -- my first Michelin star restaurant and my first chef's table experience. I was in complete awe during the entire dining experience from start to finish.<br><br>The restaurant is about 20 minutes away from the city in the Douglas Park neighborhood. The directions on their website are very descriptive and made the restaurant easy to find.<br><br>When I think of a Michelin star restaurant (at least that ones that I've watched on the Chef's Table series on Netflix), I think stuffy, being dolled up, no photography allowed, and pretentiousness -- which I've experienced at non-Michelin star restaurants. However, EL Ideas is none of that, and that's what the head chef and owner Phillip Foss embraces. 90s, Y2K and maintsteam music (WITH explicit content) blasting, an interactive and casual environment, photography recommended (I was even cued to get my camera ready for one of the courses), and a fun dining experience all around. It's also BYOB (they only provide ice water, so bring your sodas and juices as well) with no corkage fee. Reservations are accepted through their online booking system and the charges (including tax and gratuity) are paid in full at the time of booking. <br><br>My fiance and I felt so welcome while sitting inside the kitchen at the chef's table.The chefs personally explained each course to us before announcing it to the dining area. Guests are welcome to come into the kitchen to see the process for each course. We enjoyed all of our 13 dishes and it was a really wonderful dinner for us.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4tWFkSoxYewSJxbvoEyH6g/168s.jpg", "caption": "Chef's table experience (with our cheap bottle of wine, hehe)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VWjE3R9UUs_Vy6UzKcjJqQ/168s.jpg", "caption": "9 out of our 13 courses"}]}}, {"review": {"des": "No other fine dining experience in Chicago allows you to BYOB, lick your plate, eat \"french fries in milkshake\" and listen to the Spice Girls in the background of your meal.  EL Ideas is a fantastic spot at the end of a \"No Output\" random abandoned road and you wouldn't look twice at the building if you didn't know this restaurant was there.  Chef Foss talks to the diners to introduce his dishes and his vision and encourages everyone to get up, walk around and talk to him and the chefs while they're cooking and truly means it! <br>It's important to note the restaurant only has ice water so if you want soda/iced tea, you should bring that for yourself too.  They don't charge a corkage fee though so bring as many bottles of wine as you want! <br><br>The restaurant is so fun and interactive- really a unique experience.  Highlights:<br>- \"Not frosted flakes\"- A take on childhood milk and cereal except with chicken skin as cereal flakes, frozen milk, and pomegranate seeds.  So creative!<br>- \"French fries and ice cream\"- I won't ruin the surprise but I've never felt quite as satisfied to dig a spoon into the bottom of a glass.  Liquid nitrogen magic!<br>- Quail- delightfully fried with great flavor housemade ranch<br>- Wagyu beef- The wonderful smell hits you before the plate does, thanks to the open kitchen.  The chef lightly seers the meat so the flavor of the meat really shines.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uqwiN96hSdQsFQ_1kpFF1A/348s.jpg", "caption": "Show filming"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YUzfmq_PqCiCAW9OQFmZ3A/168s.jpg", "caption": "Sign to go inside"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6oGlzJSjZ1Mf4kEX_qHalA/168s.jpg", "caption": "Hibiscus, fig, chocolate and blackberry"}]}}, {"review": {"des": "Probably the best dinner experience I've had.  I was with others who have done the Alinea tasting menu and said this was way better - the food, the concept, the space, the experience.<br><br>This is also BYOB, which is insane and we brought 3 bottles of wine to split amongst the 4 of us and the gentleman who sat us advised on us the order he would drink the wine in to best pair with the meal.  <br><br>The first course - the chawanmushi was the best wagyu I've had and it was a no utensils allowed dish.  Chef Foss even joked that if we used our hands, we'd have to leave so everyone was invited to pick up the plate and lick it off.  Very unpretentious and fun approach to dining.  Diners got to into the kitchen to watch them cook, plate and ask questions.<br><br>All of the 12 courses were delicious but several that stood out to me and were absolutely raved about at our table were:<br><br>- Sepia - cuttlefish and green strawberries<br>- chawanmushi - just really good wagyu<br>- French fries & ice cream - who knew potato, leek and vanilla could be so good??<br>- Quail - really good flavor<br>- lamb tongue - some people overthought it and were squeamish but just really well cooked<br><br>definitely a great dining experience - worth the money!  it is in a sketch area but will definitely return!", "pics": null}}, {"review": {"des": "A must go for anyone who likes to have amazing creative food and have fun while eating. EL hit all the marks. The service was right on. We had one of our group who was left handed and the server automatically started setting his silverware on his left. I have never seen a server take that step. Very impressive. The food was sooo good creative , so tasty. Can't wait go back", "pics": null}}, {"review": {"des": "Basis for my starred ratings (which skews heavily to the food or drink):<br>1 star:  Never again.<br>2 stars:  Poor food, poor experience, extraordinary measures in order for me to come back.<br>3 stars:  Average, nothing really special, nothing particularly bad.<br>4 stars:  Very good, would definitely return.<br>5 stars:  A favorite, one of the best.<br><br>This was one of those rare, nearly-flawless meals.  Where the dinner manages to surprise you and not a single bite sorely disappoints you in some way.  Their Michelin star is well-deserved and having dined at other high-end fine dining throughout the world, I still count this as one of my most memorable meals.<br><br>BYOB, so we brought a bottle of champagne since it goes with everything.  Everything is open, you can walk into the kitchen, chat with the cooks and chef.  About as unpretentious as you can get at a restaurant and still get an outstanding meal.<br><br>Our menu consisted of:<br>Fluke with avocado and lotus root - very good<br>Yuzu and top neck<br>Nantucket Bay shellfish with salsify<br>Turbot with fried chicken mushroom - excellent<br>Focaccia with caponata and anchovy<br>Goat with yogurt<br>Shiitake with kombu and black garlic - excellent<br>Venison<br>Quince - weakest course<br>\"Milk and cookies\"<br>Pecan pie<br><br>Like I said, not a single bite disappointed and the some of the dishes managed to surprise us in both execution and taste.  Dessert, so hard to master, were done very well.  Definitely would return.", "pics": null}}, {"review": {"des": "ELegance of the highest order.<br><br>Whether you're celebrating a special occasion or nothing at all, Chef Phillip Foss and his charming staff will ELevate your tastebuds to new levels of culinary grandeur.  But be warned: a rez for 2 at this avant-garde Douglas Park establishment will ELiminate most of your monthly food budget.<br><br>This Michelin-starred gem is carefully hidden on a dead end street that'll make first-timers think \"wait....are we in the right place?\"  Walk inside and you'll see a clever sign indicating you've arrived at your ELysian foodie destination.  The BYOB restaurant seats a max of 24 guests with an open kitchen, where diners are encouraged to mingle with the cooks as they prep the next dish.  Tables were set tastefully and the ambient music was...surprisingly metal!    \\m/  Kind of like a hard rock version of Alinea, but without all the ELitism.<br><br>As we began the nearly *3 hour* edible expedition (which consisted of ELeven unique courses, plus one amuse-bouche) I was positively brimming with excitement.  Each dish is explained below in more ELaborate detail:<br><br>:popcorn:<br>the leadoff was a simple yet effective hors d'oeuvre, consisting of a popped kernel resting on popcorn cream with Ossetra caviar.  It came on a clear glass plate with no utensils; we were instructed to lick the plate clean.  No need to stand on ceremony!<br><br>:orange:<br>the next offering was actually one of my favorites, as it focused on a color instead of a flavor matching.  Raw salmon was accentuated by crispy bottarga and fish roe.  Deftly-rolled carrot peels and a compressed carrot purée completed the outstanding presentation, topped off with an edible marigold blossom.  The black plating provided some excellent visual contrast.<br><br>:fish fry:<br>an upscale take on fried fish, served on a custom piece of slate.  A small fingerling potato (along with homemade coleslaw and tartar sauce) was paired with crispy fish skin and something resembling black peppercorn.  Chef Foss explained that the tiny black dots weren't pepper....they were the fish's eyes.  Woah.<br><br>:black cod:<br>the next fishy dishy centered around a piece of fresh cod.  Joining it were an ELongated strand of pickled yellow beet, avocado mousse, grapefruit wedges + gel, powdered pistachio, and sorrel.  A splendid masquerade of tastes and textures made this course a winner.<br><br>:foie:<br>plate #5 gets my runner-up vote for best dish of the evening.  The foie gras was carefully freeze-dried and accompanied by rhubarb, white asparagus, a rosé verjus, and masago arare (rice cracker beads).  Topped with a bright pink geranium, the foie was superbly rich without overshadowing the delicate sweetness of the rhubarb or the tenderness of the white asparagus.  Expertly executed.<br><br>:french fries & ice cream:<br>ever dipped a french fry in a Wendy's frosty?  This is the fine dining equivalent of that.  In a traditional milkshake glass from bottom to top was warm leek soup, ridged french fries, and vanilla ice cream doused in liquid nitrogen.  We were instructed to dip our spoons at the same time, thereby breaking the layer of N2 and causing everything to meld.  Hot + cold, sweet + salty, a marvelous ELixir of juxtaposing flavors was the clear winner of the night.<br><br>:octopus:<br>item number seven was a relatively straightforward dish of baby octopus, masterfully cooked with hearts of palm and black garlic, adorned with a splash of chicory and saffron.<br><br>:rib:<br>the 8th weapon in Phil's culinary arsenal was another entry you won't see ELsewhere--instead of typical beef ribs, he BBQ'd a rib from the massive Amazonian fish known as 'pacu' or tambaqui.  Plated with baked beans, baby bok choy, and a coffee/tamarind flourish.<br><br>:cannelloni:<br>a dainty tube pasta, filled with veal shank, covered with black truffle and sprinkled with parmesan.  A single-bite delight.<br><br>:wagyu:<br>the evening's final savory course (and 10th overall) came with a certificate of authenticity.  We were told the cow's parents' names and birthplace before devouring pieces of their prized Japanese calf.  Superbly seared, it was joined by a green strawberry and brussel sprout, covered with a fine dusting of maitake.<br><br>:apple:<br>a refreshing green apple sorbet served over julienned granny smith apples, on top of peanut brittle and accented by parsnip and thyme.  Pleasantly light.<br><br>:chocolate trio:<br>the 12th and final dish was a series of small sweet bites including nougat and banana, with crushed cashews and candied red chili.  Finished with an exquisite tri-color chocolate garnish.<br><br>Chef Foss would periodically address us diners and ELucidate on each course's origins, notable features, etc.  He's so much more than a gifted culinary artist, he's a genuinely cool guy and an ELoquent speaker.  I got to high five him!<br><br>Bread = 5+<br>Circuses = 5+<br><br>Phillip Foss and his EL Ideas team kick A$$.  The opulent food will ELectrify your senses, and the candidness of the kitchen staff may take some diners out of their ELement.<br><br>Me?<br>I was absolutely ELated (and still am!)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/isohvXDjb-mRZm0kcguh4g/348s.jpg", "caption": "The menu from 3/11/16. Twelve courses in all!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MKCSBqrVxhrFiIIhtjC16Q/168s.jpg", "caption": ":foie: Course #5 = freeze dried foie gras, rhubarb, white asparagus, rose verjus, masago arare and pink geranium"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ChfRff3nCpEdRco1d2TatA/168s.jpg", "caption": "The only signage to indicate EL Ideas, and it's inside the building."}]}}, {"review": {"des": "What a wonderful dinner and experience. <br><br>Remember, BYOB! Pre paid and pre set. It's in an newer area for us, northsiders - which made it feel like more of an adventure. Arrange an car to take and pick you up. No lack of creativity in this place from the location, decor, to food and experience. I think the dinner was around ten courses. Each one prepared in the open kitchen very accessible to anyone who wanted a closer look, at any time, or as you pass by to visit the restroom.<br><br>We arrived and were greeted warmly. I was clearly pregnant and my husband does not eat meat.  Immediately we went over the menu to discuss changes. They are very accommodating and I didn't feel like we missed out on anything. They bring each plate out first, then one of the chefs will gather you and explain what you are about to eat. They strongly encourage an open dining room, facilitating conversation with the other guests and lots of interaction. My favorite dish and one of their best and main stays is the potato / leek / vanilla french fries & ice cream - I cannot give it away, but this was so fun and yummy. <br><br>Go for the food and fun experience - go in with an open mind and really enjoy and take part to get the most from your visit.", "pics": null}}, {"review": {"des": "My fiancé and I dined at El Ideas for the first time recently and I'm already looking forward to the next visit.  The concept is fun and casual aided by the BYO policy, and the food was creative and as tasty as you'd expect. Our menu contained 11 dishes that ranged from good to excellent but all of them were creative.  The standouts for me were their famous ice cream and French fries, sturgeon, and wagyu beef. The meyer lemon tart was sublime as well.  If you're looking for a fun and unique dining experience, you won't regret coming here.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/94hqBD-krRHvg27y_c1O_w/348s.jpg", "caption": "Quail"}]}}, {"review": {"des": "This is an interesting place.  Went last Dec.  You book and pay for a large tasting menu in advance.  North of $400 including gratuity/tax for two.  Small space with an open kitchen.  Kinda no frills and industrial vibe/decor with a sort of small exposed brick 'cafe' feel for better or worse.  If you are all about the food only, creativity, and execution then this place delivers.  If you want the total package in terms of chic atmosphere, more personalized and relaxed pace, then you might be disappointed.  Also, all of the courses are very small.  Very.  If you were like my date who isn't really into caviar, roe, and raw stuff in general then it might not be for you.  There is no way to really tell beforehand by the way the combinations of ingredients/courses are listed online how much of those delicacies you may be eating.  Now for me it was great.  Many of the courses have amazing various roes, caviar, uni, etc., built into the dishes or just as toppings/garnishes.  The execution was outstanding.  Perfectly cooked venison and wagyu beef when they came out.  Now you get one piece of meat in your course the size of a silver dollar so that's a disappointment for sure but it was excellent quality and it is appreciated that they are using very quality and expensive items/ingredients.<br><br>The no corkage fee is huge.  You can bring as much booze as you want.  I think you can at least.  We brought one bottle of a baller pinot noir but the table next to us of 2 went through like three bottles of wine and two beers!  <br><br>So, as I mentioned above my date couldn't really do quite a few of the courses because of the caviar, tartares, and such.  So she donated it over to me.  Much obliged but I still left hungry however after like 2.5 hours spent there!   We ended up getting chummy with the boozer table next to us and all went to Dusek's after to eat more.  <br><br>In conclusion, I did like it but one should consider the scenario explained above in regards to my date.  If the execution wasn't just spot on in general then I would've given this a lower score considering I left hungry even after eating a few of her rations.", "pics": null}}, {"review": {"des": "one of my best fine dinning experience，nice vibe，you dont need to sit in a cocktail dress for this place，casual and intimate，byob，and most importantly，the food is superb. the portion is not very generous，but good enough. just simply perfect.", "pics": null}}, {"review": {"des": "Second update and all three reviews are 5 stars.  This is truly one of the best dining experiences you will find in Chicago or anywhere.  The food is unbelievably tasty and creative.  Strangely, after being here four times with tons of different people, we had our worst experience in 2016.  Four of us have gone together all four times and mutually agreed that something was off last year.  But we all agreed that 2017 was the best visit yet so whatever changed has worked!  Plating has always been on point and this time was no different.  The menu was a bit more meat centric or balanced than in the past where it has been more seafood dominated.  The ambiance continues to be wonderful.  I've been there with four people, ten people, eight people and now five and it is suitable for all of those group sizes.  I would think wine might be hard to pair with only two people but there are plenty of twosomes that visit as well.  We always get some sparkling, whites such as Chablis and/or Sauveniere, a lighter bodied red such as a Pinot and a medium to full bodied.  I wouldn't personally do a huge red.  This year, we finished with a Pride Merlot and it was perfect.  We usually bring some amaro for dessert as well (hence why a larger group is quite nice).  The pace is perfect; you don't feel rushed but don't wait a huge amount of time between courses.  The menu changes with the exception of two dishes but worth pointing out some of the standouts from this time and a picture is posted.<br><br>The french fries and ice cream continues to be a crowd pleaser.  However, this year's probably was the best.  The serving vessel was changed and much better, albeit larger as well!  It is perfect and they are well aware, which is why it never comes off of the menu.  The osetra is also always there and I enjoy that cauliflower flavor there.  Despite being a decent sized helping of caviar on top, for some reason I don't get too much of it on this dish.  But very good.  I was obsessed with the monkfish.  That was one of my favorite dishes of the night.  But I will say, whatever changes they made were much more noticeable in the meat dishes.  All five of us had been there multiple times and this was hands down the best meat ever.  The wagyu is A5 is I was the first person at my table to take a bite, as per usual.  My face said it all.  Everyone asked what happened and I said literally it is melting in my mouth.  My friend, who is probably the toughest restaurant critic I know, said it was her favorite dish of the night and is still talking about it.  However, three of us agreed the veal was the best of the night.  I love veal, make it at home and order it often and this was definitely the best I've ever had.  Veal is not easy to get tender and this was super juicy and tender and flavorful and just perfection.  I'm not a huge rabbit person but this was very good.  Then there was the venison.  The fifth person at our table was torn between this for his favorite dish although could not decide.  Strangely, everyone at the table said their second favorite dish (would I suppose would require everyone to have a first favorite, but I digress) was the foie baklava.  Yes, foie baklava.  The baklava itself was light and flaky and the foie and quince together was like mind blowing.  The a perfect wine pairing the dish was in perfect harmony.  Literally everything was amazing from start to finish and kudos to the staff here for continuing to impress a group that, quite honestly, is hard to impress!  I've been to 27 Michelin star spots and (check out my lost) this is #3 in the world in my opinion.", "pics": null}}, {"review": {"des": "I go to Chicago once or twice a year to visit friends and family and do the best I can to check out the city's best restaurants in my limited time there. To put it simply, El Ideas is the best dining experience I have ever had, whether it be in Chicago (and yes, like others who have reviewed, I have been to Alinea as well) or anywhere else in the world.<br><br>Chef Foss and his staff have done such an amazing job making fine dining fun, unpretentious and most important of all, amazingly delicious. The meal, from start to finish, was beautiful and exciting. The restaurant is small, and the staff makes it a point to have you walk to the focal point, the open kitchen, and ask as many questions as you want, get to know your dining neighbors by mingling and helping serve each other. By the end of the night, we were sharing wine (BYOB with no corkage fee!) with complete strangers. Oh, and the music playlist is awesome.<br><br>You guys in Chicago really have something great and special in El Ideas. I don't generally return to places I have gone since I am usually there 2-3 days at a time, but I will be going back as soon as I can.", "pics": null}}, {"review": {"des": "Best meal I've ever had in Chicago.  <br><br>I remember reading an article some time back that talked about why some restaurants were snubbed by Michelin.  And to be honest,  they made some good points when they said that restaurants that change their menu all the time are too difficult to judge on consistency.  <br><br>I've had that problem with most of the top restaurants in Chicago.  I didn't enjoy Alinea,  and to this day Grace is the worst meal I've ever  paid more than $100 for.  I've been to Next four times and had four different levels of enjoyment.  <br><br>The first time I went to EL Ideas (which,  btw isn't even a little bit Mexican!)  it was easily - EASILY the best meal I've ever had in Chicago.  It remains the best meal I've ever had in Chicago.  It was whimsical,  playful,  inventive,  and most of all... delicious.  Because it was such a transcendent experience,  I choose to review based on that experience.  <br><br>The second experience was an entirely different menu,  and it was still really great.  But it didn't reach the heights of the previous menu I had.  <br><br>I could give you more details about what I ate,  but it doesn't really matter,  because by the time you read this the menu will have completely changed again.  Just know that if you are in town to go after the best restaurants in Chicago,  you would be doing yourself a massive disservice to overlook EL Ideas.", "pics": null}}, {"review": {"des": "Not only is the presentation perfect but the food is to die for this place is worth every penny! So creative and tasty can't wait to be back!", "pics": null}}, {"review": {"des": "SO HUNGRY when we were done, as soon as i got home had a 1/3 of baguette, some mortadella, cheese and grapes!<br><br>AKIKO, the wife of the owner was real pleasant to deal with, helping me with my last minute reservation and speaking Japanese to me. So good that positively impacted my favorable rating here.<br><br>about $420 all inclusive. Not bad really but can not tell worth it when i compare it with real one michelin and 2 michelin star restaurants I have been to across the world at same price point but with much better food, service, location, etc.  <br><br>Certainly better than some of Chicago's one michelin restaurants (Naha, and lousy Takashi that's closed now). Not at all as good as my Chicago favorites, Elizabeth or Schwa.<br><br>Interesting idea and philosophy. Can not tell my favorite as in general i prefer a bit more personalized service.<br><br>Back to basics approach. Food introduction given by one of the chefs shouting the description briefly to all guests.  Server (amazingly fit champ) was pleasant but serving food was limited to just putting dished on the table.<br><br>Food.  There was not a single dish that stuck in my mind as innovative or more innovative than i have had elsewhere. The langoustine was delicious. The milkshake was cool.  Deserts, in particular the last one was nice.  Pork Belly was fine.  So was the foie gras.<br><br>Duck was awful. Overly done. Nowhere as good as the smoked duck at Antico.  Rest, i could take or leave.<br><br>Portions: inconsistent across the dishes. My duck portions were almost 1/3 less than my guest's. My foie gras, same....and one of the deserts coming with a candied orange peel (??), mine was around 20% of my friend's. Ridiculous.  Reminded me of sushi chefs who proudly demonstrate the numbers of \"rice-s\"\" in each of the nigiri they make as being about equal to one another..... why can they not do it with food where portions are so visible.<br><br>Water: I wish i knew BYOB means no bottled water.....wish at least they had filtered water...i tasted a bit of chlorine....<br><br>Soundtrack: I could careless.<br><br>Ambiance: more of a exposed brick cafe but overall nice and i respect their philosophy even though not my taste.<br><br>Impeccably clean place.<br>I saw two people at Chef's table. They were initially so close to the dishes on the counter and talking to one of the chefs loudly, i wondered if their saliva/spits may get on some of the food.<br><br>I wish them success, albeit i don't think i'd go out of my way to re-visit.", "pics": null}}, {"review": {"des": "The best way I can describe this restaurant is to compare it to the feeling I had after watching Terrence Malick's 'Tree of Life.' Something deeper was definitely at play in this film, unfortunately I didn't get it.  On the upside, I caught the matinee showing which was $7.50 per ticket.  Plus the candy and popcorn stand was operating at Six Sigma levels that day - Kaizen really.<br><br>While the creative, and profound were definitely on the guest list at El Ideas the night we dined - the delicious, delectable & appetizing somehow did not make the final cut. And at $232.00 per ticket, this is a snub that cannot be absolved.  Thus three stars it is.<br><br>On the upside, we did capture some beautiful pictures below...", "pics": null}}, {"review": {"des": "Since i was visiting Chicago for the first time, I had to make the best use of time visiting a city filled with so many michellin-starred restaurants. EL Ideas is your down-to-earth, unpretentious, but so still fun and delicious michellin restaurant. <br><br>As others have said, this place is located in a pretty sketchy part of town, on a dark, dim-lighted street. Take an uber or lyft. Don't bother driving. It didn't seem like there was street parking on that street, and you really don't want to walk in this area (as our uber driver warned us in the car). <br><br>But once inside, you completely forget all the sketchiness that's outside. The host/maitre d'/server greets you warmly. You can hang your coat on the self-serve coat rack. The kitchen is widely open, and the staff and chef warmly encourage you to walk back there to chat with them, even while they are cooking/plating! <br><br>The food is creative and fun. Our first dish was served without utensils, and we were suppose to just lick the entire thing with our tongue. At first it was awkward, but then you realize this is going to be a fun night! <br><br>My fave dish for the night was a modern take on the childhood classic of milkshake and french fries. Liquid nitrogen ice cream is scooped in tableside into a cup filled with warm potato soup and small bits of crispy potato. I could have eaten this dish all night long!! <br><br>At the end of the night, coffee and tea are self-serve in the kitchen. This is your opportunity to chat with the chefs and staff, and maybe even have a nightcap with them! <br><br>And remember to call uber/lyft for a ride home...and don't go outside until you know they are there.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-soe7M1oPrF1taJ3lgmVOg/168s.jpg", "caption": "My fave dish: french fries and milkshake!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/njKrEw8gDVGnnyqLWf2B0Q/168s.jpg", "caption": "First course with no utensils, had to lick food off the plate"}]}}, {"review": {"des": "My lovely husband surprised me with El Ideas and what a FUN night! Love the concept, and the foods are great. We had about 13 different dishes, and each of them is very unique and pretty mind blowing. The presentation is really great, and ambience of the place is super friendly and inviting. I love seeing how much these chefs care for our foods, and looking at them preparing and \"dressing\" them up. With 13 different dishes, we came out from El Ideas feeling satisfied and amazed. I tried things that I thought I would not ever tried before and they were yummy, like pig head and duck liver (who knew!?). Also, to top it off, this place is BYOB, and does not charge any cork fee, and service is just amazing. I will be back, El Ideas. Keep those ideas coming!!", "pics": null}}, {"review": {"des": "Talk about finding hidden gem...this is it.  12 course tasting menu, each made with unique creative mix.", "pics": null}}, {"review": {"des": "If you want to know what it's like to dine with the gods of Mt Olympus, this is it.  Without the pomposity or pretentiousness.  We went with dear friends, we were visiting from Los Angeles and all of us appreciated the theatrical presentation of the evening.The chef and staff is so generous with spirit and talent.  the space is cozy yet modern, we brought bottles of wine and enjoyed ourselves immensely.  My husband is the cheapest man on the planet, watches every penny.  for him to say it was well worth it is something else.  We can't wait to go back and lick our plates!", "pics": null}}, {"review": {"des": "El Ideas was a truly unique experience!!  I booked about month ago.  I couldn't wait for the date to arrive as I had heard many great things!!<br><br>The building is a bit hard to find.  Just walk up to the door and listen for old school hip hop!  There's only one reservation per night, 7:00pm.  When walking in, you immediately feel as though you're in someone's home with the open kitchen, friendly staff, and hand full of tables.  There were a couple of people dinning alone, a couple of groups, and a couple of two tops.  It's also BYOB with no fee, so pick you're best bottle.  Next time, I'm starting with a champagne, followed by a nice red, and finishing with a port.  My friend and I had a yummy Oregon Pino that went well with most dishes.<br><br>The chef calls everyone's attend in the beginning and introduces himself and the staff.  He encourages pictures of the prep line, kitchen, and food.  Many guest were hanging by the kitchen, chatting with the cooks in between courses.  <br><br>Everyone was served at the same time and once the last plate was down, the chef would describe the next course and where it's inspiration came from.  The stories along with the dish were fun!<br><br>I'm a pescatarian and the kitchen catered perfect to my needs!  <br><br>The experience last about three hours.  I honestly lost count of the courses, but I didn't feel too full at the end.  The courses started off lite and gradually became a bit larger and slightly heavier.  It was perfect!!!  <br><br>I can't wait to come back to see what's new on this creative menu!!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FfFWxEO29OBMgBEJUYkkLQ/348s.jpg", "caption": "Entrance"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-lEG1jmly_MAAy6VjQqa5A/168s.jpg", "caption": "A play on bananas foster but better!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rQgtO_PbXqDOVQee1V_1Mg/168s.jpg", "caption": "Red velvet cake"}]}}, {"review": {"des": "I really loved dinner at this very unique restaurant.  The team who works here has infused the place with so much fun and excitement that it makes for a special experience. Cast off your old, tired view of fine dining and go bask in the joy.<br><br>There is a very fun theatrical element to dinner at El Ideas - it is highly interactive.  The food is wonderful - imaginative, creative and delicious.  But what sets this place apart is the interactive experience.  We helped serve the food, bantered with the Chefs in the kitchen, hung out with other guests, hung out with the chefs and learned how the dishes are made, and took lot's of video with people we'd never met before.  It was just flat out fun.<br><br>A small dining room (perhaps 16 or 18 diners) is plunked right next to the open kitchen and the place is a constant whirlwind of activity.  As each dish comes out (and is energetically, if inexpertly) placed in front of each diner by one of the chefs or a guest, the music is shut off and one of the chefs announces what we are eating.  They rotate emcee duties so the lead chef (I guess?) for each dish talks about it.  <br><br>Each dish is unique and all were excellent.  Some were really amazing.  The night we were there the super amazing dishes we had were:<br><br>Caviar/heart of plam/popcorn/ghost pepper<br><br>Crawfish/chanterelles/white asparagus/nasturtium (dried and powdered!)<br><br>French fires & ice cream (this dish is genius)<br><br>Pierogi of wagyu/kohlrabi/beet/sour cream/dill<br><br>It is BYOB and we brought 4 bottles - 2 white and 2 red, which worked out just perfectly for the length and complexity of the meal.  The guy at the front of house was super good supporting our wine service needs - glasses and a cork screw.<br><br>The entire meal, from start to finish was delicious.  Rather than dwell on each dish I'll call out the uniqueness of the place and the event.  You can get many wonderful and delicious meals in Chicago.  You cannot get one with the energy, zest, and appeal of El Ideas.  I can't wait to come back.", "pics": null}}, {"review": {"des": "It was a fun, relax, and delicious experience. This is the first 1-star Michelin restaurant in Chicago that I would return so far. I am not going to review individual dishes because the chef said that the menu will likely be completely different in a month except the french fries and ice cream dish. <br>Our seats inside the kitchen (first-row seating) were fabulous. It was interesting to see how the cooks work. GREAT JOB!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jpL86GoNSeAf8CAASqmJeQ/348s.jpg", "caption": "wagyu"}]}}, {"review": {"des": "This is probably one of the best fine dining experiences I have had. The complexity of flavors is great and so creative. They seat the entire dining space at one time to give a dinner party atmosphere. The kitchen is open so you can watch them plate and prep. It's BYOB which is a huge bonus. This is definitely a must go if you are visiting or live in Chicago!", "pics": null}}, {"review": {"des": "There is a bit of irony as soon as walk through the door because the tables actually have \"white tablecloths\", but this place is as far from stuffy fine dining as you will ever get in a Michelin star restaurant. Did they make us lick food off our plates? Yup. Wanna come walk around the kitchen during service? No problem. Bring your own booze and save a few hundred dollars? You bet. Needless to say it turned out to be one of the best dining experiences I've ever had.<br><br>I was lucky enough to celebrate my bday there several weeks ago and at their \"front row seats\" (thanks to a surprise by the gf), which is literally a 2 top at the end of the pass in the middle of the kitchen. We were able to chat with the kitchen staff the entire meal and even got to help plate a course! Chef Foss was also kind enough to explain every course to us and added some additional personal touches that truly made the night. <br><br>The meal consisted of 12-14 courses and although I won't go through them all suffice it to say the typical luxury items were all present (truffles, foie gras, A5 wagyu) along with an interpretation of a Wendy's Frosty with French fries, which was a stroke of creative genius. <br><br>It would take a book to fully describe the entire experience, but rather than make anyone read through that, please just go experience the ludicrous magic that is El Ideas for yourself.", "pics": null}}, {"review": {"des": "El Ideas was a great team dinner experience with the chef engaging the entire room as one dinner party. It is El-themed, if you hadn't figured that out yet. Additionally, the restaurant is hidden in South-West corner of Chicago which is a strange place for a Michelin star restaurant. <br><br>My favorite dish was the dish inspired by the Chef's own kids - French Fries with Ice Cream (but it comes with a twist of some carbonated, popping ice cream). <br><br>Restaurant is BYOB which is great when our group brought 20 bottles of wine! They have you pour your own wine but provide ice buckets to keep your white wine/champagne nice and cold.<br><br>I thought this was overall a good tasting experience - I wasn't super full at the end, but maybe the wine made me more hungry than usual. Wish we could the option to order a larger tasting menu! I usually would say I have a smaller appetite so I was surprised.<br><br>Overall, creative dinner - could be more filling, and more memorable tastes but I enjoyed the dinner and would come back for the next tasting menu!", "pics": null}}, {"review": {"des": "Don't hesitate to go here.<br><br>Unique presentation with an open kitchen you can stand in and chef's doubling as servers.", "pics": null}}, {"review": {"des": "Dining at El Ideas is a fantastic experience and should be on your \"to do\" list if you are a foodie in the Windy City. Our 12-course meal was expertly prepared and served, and the highlights included the following: the sturgeon with winter radish, the wagyu beef with black garlic and turnip, and the sunchokes with truffles and snails.<br><br>The meal lasted almost 2 hours, so be prepared for a long adventure (which is definitely worth the time). I'd definitely return, and this great restaurant should not be missed.<br><br>Inside info....bring plenty of booze to last your meal, and champagne pairs with almost everything! You won't be disappointed as long as you don't skimp on your selections.", "pics": null}}, {"review": {"des": "Ok so I loved it! I have been to places that are stuffy like Next. But honestly this place I felt like I was invited to the cool kids place for dinner. I loved the food, the staff, and the atmosphere.  You were able to get up and check out the kitchen as they were cooking. A must check out place especially with that Michelin star", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/z0vuW5EZFYIgRkPh4Oe_Zg/168s.jpg", "caption": "Earl tea ice cream and a peach"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7ZtRGBZZhrVFTm59BSkxCw/168s.jpg", "caption": "Amazing Amazing Amazing!"}]}}, {"review": {"des": "Holy f*ck! #ElIdeas was amazing. I've never had a dining experience like this one. If you are in chicago, I highly recommend you visit this amazing restaurant. Plus, I got to help serve the dishes. Loved it. Check out the photos, you will fall in love and start to salivate.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0gSHK4gZHbvus2vzgnZ3Ow/168s.jpg", "caption": "Duck / forbidden rice / Thai flavors Octopus"}]}}, {"review": {"des": "KenScale: 9.0/10<br><br>EL Ideas is not a typical restaurant. I visited this place on a Halloween night and all the staffs were dressed in costumes, and even the dining area had spooky decorations everywhere. It is located in the middle of nowhere (it's basically not accessible without a car) outside downtown Chicago. Ironically, this restaurant has some of the most progressive ideas of New-American cuisine and was supposed to be the highlight of my culinary trip in Chicago. I couldn't wait to see what chef Phillip Foss would bring to the table at this BYOB restaurant (I love restaurants in Chicago because so many of them allow BYOB, i.e. saving a ton of money on insanely marked up wine). <br><br>The tasting menu is the only option at the restaurant (you have to purchase tickets in advance, as the restaurant has followed the footsteps of other pioneering tasting menu restaurants in the neighborhood like Alinea). All of the dishes came in small portions but I was very impressed with the creative energy that each displayed, especially with the way the kitchen uses seemingly incompatible ingredients to great effects. The first one, roe with pomegranate and crème fraiche that you have to lick (!) off the plate, was a nice start. Lobster with saffron, macadamia and cauliflower was also quite a nice scoop as well. I was in love with king salmon and eggplant as well, with such elegant flavor that I finished the dish in seconds. A little ball of grilled cheese with tomato soup inside was brilliant, and the triumph of the kitchen's creativity came in the form of French fries and ice cream. How does potato even fit inside vanilla ice cream?? But the more I ate this weird combination, but more I fell in love it. The staff keeps adding more vanilla ice cream to create a smoky effect to the dish, and I just couldn't stop thinking about this dish. Other dishes, such as quail that came with puree of pepper, manchego and crowder pea, veal shank with different layers of mini ravioli underneath, perfectly cooked wagyu with maitake and beet were all carefully thought-out and well-executed dishes. Before the dessert began, the kitchen did something unthinkable, combining foie gras with salsify, granola and yogurt for a combination of savory and sweet ingredients. It was such an interesting dish with unique flavor and texture that I keep wondering how the kitchen even came up with these ideas. Desserts were also excellent, from the tiny bite of yam, egg yolks and marshmallow to cheesecake with grapefruit and pumpkin ice cream. <br><br>As mentioned above, the restaurant is BYOB, so make sure to bring a bottle or two of fine wine. I didn't have much problem purchasing the tickets for a dinner of two about a month in advance, but I would plan ahead if you're serious about visiting this restaurant. The restaurant's décor is minimal and makes you feel like you're inside a industrial space of former factory, but I liked it that way as I enjoyed the contrast between the décor and the sophistication of the food. Yes, EL Ideas is a worthy destination if you're in Chicago on a trip or if you're looking for a special occasion dinner.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aV-o7aClI6bteJQ48dtqcw/348s.jpg", "caption": "Veal Shank with Kohlrabi, Pear, Anchovy, Parmesan"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_yhB8THNxiIaar9y1gyCug/168s.jpg", "caption": "Quail with Pepper, Manchego, Crowder Pea Puree"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nZM16UE9JOM1W85123433w/168s.jpg", "caption": "Bread"}]}}, {"review": {"des": "EL Ideas is located in an unassuming building in Pilsen, near train tracks lined with cargo containers. There is free street parking, and when you enter the building, EL Ideas (EI) is the first door to your left. Once you enter, you'll be greeted by a chef in the role of host. During my visit, Bill was our host and he introduced himself, asked our names, and shook our hands as one would do when meeting a new colleague or friend. With seating for just 20 diners, EI is  an open space where the diners can walk around the kitchen (with the exception of the line, where food is prepped and plated). One can pick any table at which to sit. <br><br>The meal itself is split into 13 courses: We started with a toast (EI is BYOB so bring your own libations if you prefer something other than iced water with your meal), then proceeded to the following courses: roe with cauliflower, curry, asian pear, and saffron; monkfish with seaweed, bok choy, pistachio, and mandarin orange brulee; torched king salmon with eggplant, sesame (tahini), and nasturtium; scallop with tomatillo sauce, bellota, caper, fregola; beef tartare with ghost pepper, hong vit, paprika, caviar, and mashed potatoes; broccoli cheddar soup inside a sourdough bowl; triple-fried french fries in nitrogen vanilla ice cream, potato leek soup; veal shank with kohlrabi, diced pear, anchovy, and grated Parmesan; wagyu beef with maitake, beet, cabbage, and lardo; pan-fried foie gras with salsify, granola, huckleberry, and yogurt; rooibos yam, caramelized egg yolk, marshmallow, thyme, and brioche for dipping; pumpkin ice cream with cheesecake, grapefruit; chocolate cake batter; and french-pressed coffee or crema earl gray tea.  <br><br>Each course is delivered and then one of the chefs announces the course. I liked how each course was synced among the tables, and everyone started and completed dinner together. The pace allowed people to eat, to talk with their dinnermates, to explore the kitchen and watch the chefs at work. This was my favorite aspect of the night because one rarely gets to see the magic in the kitchen, and here, it all happens before your eyes. The transition from savory to sweet, the contrast of the textures and the colors, the unison of spices and herbs to coax the protein or vegetable out of its shell. <br><br>After dinner, you're allowed to stay and mingle, and to walk through the kitchen. I marveled at the spice rack, from turmeric to \"cocaine\" to \"love\" to an empty canister of \"meaning of life.\" At EI, its truly all about the food, but its all about what you do with it and who you share it with, too.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/F0PrWAhhhbUU3e-blEz3MA/348s.jpg", "caption": "Pumpkin (cheesecake, grapefruit, coffee)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2Yv_n9BIj3ofFjTMD5t6cw/168s.jpg", "caption": "Rooibos (yam, yolk, brioche, marshmallow, thyme)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3OXsg2k-l3A-2pEPYDObvQ/168s.jpg", "caption": "Pan fried foie gras (salsify, granola, huckleberry, yogurt)"}]}}, {"review": {"des": "Hands down, this was the best dining experience that both my husband and I have ever experienced!!<br><br>From the moment that we arrived, we felt at home. Thanks to Bill, we were given what we believe to be the best table in the house. A perfect vantage point to bear witness to the wonderful experience that was in store for us. He even suggested a wine delivery service, as we failed to bring any with us (#wineangels)<br><br>Did I mention that El Ideas is BYOB with no corkage fee?! <br><br>Every one of the 12-13 courses was carefully explained as it was being delivered to our table. On top of that, the open concept kitchen and dinner party-themed approach made for such a laid-back and chill way to dine like royalty. The eclectic selection of music that accompanied the evening was also great: from classic rock to Top 40 and even hip-hop (I believe I recall hearing Ghostface and the RZA).<br><br>Chefs Foss, Goody and Price were the artisans that helped to craft some of the most interesting (and delicious!) items. <br><br>From the soft-shell crab to the wagyu (licked out plates clean!) to the liquid nitrogen-cooled ice cream with potato leek soup and French fry bits. What?!<br><br>El Ideas has set the new benchmark for us! We can't wait to return to Chicago and see Foss, Bill and team again! We wish them all the best.", "pics": null}}, {"review": {"des": "I was planning on bringing my rescheduled Valentine's Day date here, but I was turned down. I know my fellow Yelper, you are stunned that (1) someone would turn down a free meal at a hot spot like EL Ideas and (2) that someone would actually turn down all this chocolate goodness.  Well it happened. Thankfully, I have awesome friends and one of them surprised me with an early birthday gift to EL Ideas.<br><br>First, I need to say that the location of EL Ideas would make Mike Tyson a little nervous to venture into at night. However, once you step into EL Ideas you know you know you are in for an experience unlike one you have ever had before. There's limited seating, the stuffy atmosphere you experience at normal restaurants that do tasting menus will not be found here, the kitchen is in full view of the dining area and you can actually walk into the kitchen to talk with the chefs, it's BYOB, they have music playing that you would expect to hear at a frat party and you are encouraged to mingle with the other people dining there. **Note to reader - be sure to mingle with the other patrons dining there because you may get a bottle of wine from one of them like like I did. **<br><br>Second, I want to acknowledge the EXCEPTIONAL service that you will find at EL Ideas. Everything was first rate! It was pretty awesome to get to talk and take pictures with the chefs and Phillip Foss (owner/head chef). Having them explain, in their own colorful way, each dish was highly entertaining.<br><br>Third, the food was AMAZING. We were served 13 courses during the 3-hour tasting and of the 13 courses my friend and I went coco for cocoa puffs over 8 out of 13. I've listed the courses below in the categories that they fall into.<br><br>Amazeballs! So good I wouldn't share with the Pope or my mama<br>#2 Halibut - This dish beautifully presented, cooked perfectly and tasted so good.<br><br>#3 Cobia Collar - Which is a fish, was good and the flavors of curry, coconut and banana were like a firework of flavors to my sense of taste.<br><br>#4 French Fries & Ice Cream - When the dish was put in front of us, we were blown away by the drama of the presentation and we didn't believe it would taste like what we were told it would (a frosty from Wendy's with french fries dipped in it). However, as I brought my spoon to my mouth and took that first bite; I was thrilled that the taste matched the description spot on. <br><br>#5 Soft Shell Crab - Now seeing how I love seafood, I knew exactly what this dish was when it was placed in front of me. This was my favorite of the night no diggity no doubt. Everything about this dish was perfection.<br><br>#7 Foie Gras - It feels as if every fancy restaurant or tasting menu has foie gras on it. However, the chefs at EL Ideas stepped it up a notch with the huckleberry sauce that was poured atop of the foie gras. <br><br>#8 Venison - I've never seen Venison sausage until my bowl was placed in front of me. I thought the yogurt that came with the dish was a perfect compliment and really brought out the flavors in the sausage.<br><br>#10 Antelope - I had never had antelope until dining at El Ideas and I am now a fan for sure. The meat was so tender and while the slice was on the small size, a lot of flavor was packed into that bite size portion. <br><br>#13 Mudpie - The mudpie combined coffee, marshmallow an chocolate into a tasty dessert that concluded the tasting experience. The marshmallow was sticky like one you would find on a s'more and the mini block of chocolate was fudgy goodness that made my teeth happy, but I'm sure my dentist won't be.<br><br>Really good<br>#1 Roe <br><br>#9 Bellota <br><br>#12 Zucchini <br><br>Interesting (neither good or bad)<br>#6 Snail - Was presented in a shot glass and had an interesting texture/taste to it.<br><br>I would totally share with the Pope<br>#11 Spruce - This dish was original in that we weren't given any utensils to eat it with; we had to lick the cream like substance off the little plate it came on. The chef warned us that some people love the dish and some people don't. I can tell you two things about this dish, which are (1) I felt like I was eating a Spruce Tree so the name fits it perfectly and (2) this was the only dish I of all 13 courses that I wasn't a fan of.<br><br>Lastly, everyone who was celebrating a birthday, 3 of us, got a 14 course which was a confetti cake that had a chocolate cream like center. The cake was oh so good and a nice touch that just highlighted how awesome EL Ideas is.<br><br>I've been to a number of restaurants in Chicago that do tasting menus and EL Ideas is my favorite as of today because of the food, atmosphere, staff and service; which is why I am giving EL Ideas 5 stars.  I will definitely be going back to El Ideas in the near future!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zIJbkd-r5EmDp0LJpzmHag/348s.jpg", "caption": "Course #9 - Bellota (rapini, lardo, apricot, hot pepper)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZXm9qSBeveySnaTJyD-8fw/168s.jpg", "caption": "Course #8 - Venison (barley, yogurt, enoki)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2QlQsXwGWv6MIqgvG0Ai1w/168s.jpg", "caption": "Course #7 - Foie Gras (porcini, huckleberry, bergamot)"}]}}, {"review": {"des": "This is long overdue.<br><br>I originally found out about EL ideas in the simplest of ways: I was looking at an online map of the neighborhood near my workplace. This was a relatively long time ago, but it got the restaurant on my list.<br><br>How was it? Very good. At least half of the dishes would have been splendid meals if scaled up by 10X/20X/whatever. A tasting menu should deliver that sort of thing, right? Specific recommendations would be useless because the menu has changed since my visit.<br><br>I thought Mr. Foss and his staff were friendly and courteous. We were invited to watch the action in the kitchen. (This usually happens.)<br><br>A quick word on transportation if you're feeling cheap before/after: EL ideas has a CTA-friendly location. Western buses stop nearby (49 right there, X49 close enough to the south). The Pink Line Western station isn't too far away, either. At worst (were you for some reason to wander a couple blocks east from Western near the train station) you might find yourself in a \"sketchy\" (but not dangerous) neighborhood. You won't likely see any hoodlums within a couple hundred yards of the restaurant on Western.", "pics": null}}, {"review": {"des": "I was hesitant when I was invited to eat here as it is pricier than what I like to spend on a meal, however, I was shown a great time and ate great food that made the price worth it. <br><br>The atmosphere is so relaxed at El Ideas and I love it! As the owner said, they aim to get rid of the pretension that is typically paired with fine dining. Every group has their own tables, however we all eat the same (14 courses) at the same time! <br><br>The first dish came out with no silverware and we all had to lick the dish off the plate. This really got us laughing and comfortable and set the scene for a great night. <br><br>Every course was generously crafted and the owner stood before us and explained the inspiration for the course and what it was. Guests are invited to go back in the kitchen and watch as they prepare, as well as take pictures. <br><br>Dinner took about 3 hours total. Awesome experience!", "pics": null}}, {"review": {"des": "A night of perfection capped off with a successful Engagement to the woman I love! <br><br>Thank you to Phil, the soux chefs (who made it so fun and encouraged you to get involved), the atmosphere and music, the front of the house and everything El Ideas had to offer to make our night even more memorable.  <br><br>Thank you!", "pics": null}}, {"review": {"des": "This is a wonderful experience. A dinner party with strangers. The ambiance, the execution, the plating and the tastes all exceeded my expectations. <br><br>Being able to talk with the Chefs while they are preparing your next course is a great perk to this restaurant. I got some excellent tips on how to prepare gnocchi. <br><br>As an out-of-towner, the idea of a BYOB only place was a tad odd. Personally I like to do wine/drink pairings with my tasting menu, but as this one was 14 courses, that would have been a buttload (an actual unit of measurement BTW) of booze. So I am happy to have brought only some bubbles and a medium bodied red as suggested. <br><br>For some it may be pricey, and I don't disagree. But if you are looking for a unique way to celebrate something or to just treat yourself/significant other, then try EL Ideas. You will not be disappointed.", "pics": null}}, {"review": {"des": "I was visiting a friend in Chicago and he gave me a list of restaurants to choose from to make a reservation. El Ideas was one of them and I was quickly intruiged. He made a reservation 1.5 months in advance.<br><br>We took an Uber to the restaurant, we turned down a dark street. We walk inside an industrial building and are taken into a very open space. To the left are the 5 or 6 tables. To the right is the kitchen area. I was instantly into it.<br><br>You bring your own alcohol, they give you suggestions of pairing reds, whites, bubbles, rose, etc. We brought one bottle of red. We were given unlimited water (I am from CA where there is a drought, so I was super grateful for copious amount of free water).<br><br>As soon as everyone arrived, we began. There were 4 chefs, the head chef explained that they will be serving the food and once everyone is served, they will explain the course. The strongly incouraged interaction and licking plates. Instantly I knew this was the place for me. I love being encouraged to lick my plate!<br><br>And so it began. I was thrilled with most of the dishes. However, my poor stomach was full by course 9, like uncomfortably full, like I had to go outside to catch some air. I seemed to be the only one who had this problem, so clearly I need to learn to have this many courses.<br><br>I loved how much the chefs interacted with everyone and they encouraged us to ask questions and look around. This really was a wonderful dining experience. If you are hesitant, don't be, but do remember, you do not have to eat every single bite, especially if they are serving the amazing soup, if you are pushing yourself to finish, probably better not, you need to save room for the remaining courses.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IVNQNCbpdFtbfL5_EOo0JQ/348s.jpg", "caption": "Our table"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ho3a7f9S5uWx5KOkDIIvig/168s.jpg", "caption": "Beautiful"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LE4I7eIBv3l3SrDXNuy83Q/168s.jpg", "caption": "The awesome kitchen"}]}}, {"review": {"des": "We booked two months out for a Friday night reservation. Boy was it worth it.This was one of best dining experiences of my life. The creations, set up, playlist, service and the fact that you can BYOB was more than you could ever ask for. <br><br>We were served 12 courses, which included two desserts. I admittedly left satisfied, but not tipping over, ready to pop full. The offerings were a bit eclectic in that they were unique spins on some items and others you would never otherwise try or pair with other ingredients. I dined on everything from leeks to razor clams, to antelope to lard. The Uni was delivered with the lick your plate requirement. While it is one of the few times you can lick the plate in fine dining without being given the side eye, it still felt weird. But, admittedly, some of the other items were so good, I wanted to lick the remnants of the plates or bowls but I had to keep reminding myself the window of opportunity had past. <br><br>I loved the plates and everything about this place. It was well worth the $190 price tag. Can't wait to go back again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7b47Z3pkDnH_KGU5R_53Lg/168s.jpg", "caption": "Antelope"}]}}, {"review": {"des": "Presentation, service, taste, and value, El Ideas hit every check box. Will be back. Thank you!", "pics": null}}, {"review": {"des": "The concept is superb - Michelin rated food in a fun casual environment! I love a good paradox! The place is a little tough to find, tucked away at the end of a small dead-end street. It looks like an old house or warehouse building. The kitchen is small but so efficient. There are about 6 tables total - so 14-16 people dining together at any given time. The day we went, their AC broke. They were extremely apologetic but maybe could have offered a discount for the compromised experience? <br><br>The food was really good - delicate flavors weaved together! They were also very accommodating of any food allergies or preferences! It was a 14-course 3-hour dinner with a casual playlist of music. While I really enjoyed my experience, I did feel we overpaid for it, in comparison to other similar restaurant experiences in this bracket. Hence 4-stars, not 5.", "pics": null}}, {"review": {"des": "Creative fun dishes, ambiance is fun and not pretentious~ love the BYOB option with no corkage fee! Chef Phillip Foss def knows how to have fun and it comes through his food. I like the open layout of the room- can see all the chefs prepare and put so much details into every dish. The fun music (lots of 90's) and the end of the meal and coffee/tea offered in the kitchen is super fun!! My friend is also pregnant and we called ahead to see if there would be a lot of raw dishes~ they made sure to substitute any rAw components or cook it a little more and explained each dish to her as they came out~ we didn't have to change venues and she enjoyed every dish!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mXESbVAcg5sD0uQoQ8znSg/348s.jpg", "caption": "Grilled cheese with tomato soup inside! Pops right in your mouth!"}]}}, {"review": {"des": "Fantastic experience. We had a great time and enjoyed every single dish. We had our wine delivered and enjoyed all of their recommendations. We came here to celebrate our son's college graduation and it was a dining experience we will all remember!  Each dish was a unique experience and presentation and the anticipation grew with each course. The contrasts, textures and flavors were all unique and exciting. Can't wait for the next occasion to return!", "pics": null}}, {"review": {"des": "**FUNNEST DINNER WE'VE HAD IN CHICAGO**<br><br>Man, Chicago has some fantastic food choices.<br>We couldn't decide: TRU, Alinea, or maybe El Ideas?<br>All different, but after further thought, we were sold on the \"supper club\", BYOB, and no dress code concept.<br><br>We were charged $145 for each person (excluding tax and gratuity) seven days beforehand.<br><br>Taxi (via über) was around $20 one way.<br><br>GOOD FOR:<br>==========<br>- SOCIAL and gregarious (triple word score) people<br>- People who enjoy excellent food without the PRETENTIOUSNESS, formal jackets, and a fully staffed crew. <br>- RISKY and adventurous (you don't know what you're getting until you're there).<br>- Interaction with your fellow diners and chefs.<br>- PHOTOGRAPHERS, I mean those who like taking pictures of food: yes, that means all the Asians are welcomed.<br><br>NOT GOOD FOR:<br>=============<br>- If you are easily offended listening to N.W.A. or any 90's hip hop (It was played in the kitchen and I immensely enjoyed the experience).<br>- ROMANCE or a quiet first date. It's an interactive environment. So you might be somewhat disappointed if your date ends up talking to me the entire night.<br><br>I announced the dessert dish to the diners towards the end of the night with the executive chef. Fun, right?<br><br>El Ideas is not for everyone, but it was for us.<br><br>BRING YOUR OWN WINE PRO TIP:<br>Wine pairings are as follows: we recommend starting with a sparkling wine, whether it be a Champagne, dry Cava, or even a sparkling white. For a white option, stick with medium-bodied whites with a bit of acidity. For a red option, medium-bodied reds like a red burgundy, pinot noir, or even a red blend would work best.<br><br>HIGHLY RECOMMEND for those who want to have a fun and interactive dinner.", "pics": null}}, {"review": {"des": "HELLO fancy date night! My boyfriend and I agreed that this was one of the best dinner experiences we've ever had. Hefty price, but worth every penny.<br><br>Douglas Park is in the middle of nowhere, but the restaurant's website gave pretty good directions as to where it was (if not, I would have thought that we were in the middle of an Law & Order SVU episode). There was no signage, and walking in, it really felt like we were entering someone's house instead of going to a restaurant.<br><br>We got upgraded to the chef's table when we arrived, which is really the small table at the end of the prep station. This gave us the perfect viewpoint to watch as the chefs plated the first courses. As we popped open a bottle of prosecco (BYOB, no corkage!), we were asked to go to the front so that the chefs can introduce themselves. Almost immediately afterwards, Soulja Boy's \"Crank That\" started playing. That gave us a good idea of what was coming.<br><br>Suffice to say that the food was irreverent but delicious. The first course was a daub of heart of palm, popcorn and caviar, served on a clear plate with no utensils so you'd have to \"lick it sexily.\" My favorite was the French fry and ice cream, inspired by, er, happy snacking. The menu we walked through was almost all seafood except for the last course of waygu, which was sinfully rich.<br><br>But what really makes this experience was truly the fact that it felt like a dinner party. Being a true extrovert, I was so happy when Chef Foss encouraged us to \"walk around and meet each other.\" We ended up vacating our choice seats for 2 courses to talk to another table. I mean, what kind of meal ends with you doing bourbon shots with the chefs and fellow diners? <br><br>TL;DR: Come here. Bring wine. No excuses.", "pics": null}}, {"review": {"des": "I'm going to start gushing...that's what happens when I really get excited about something and can't stop talking about it.  My best friend and I dined here Friday night and we are still talking about the fantastic experience we had at EL Ideas.<br><br>I had secured reservations for the late seating about one month ago and the week of our dinner I was notified that the theme of our dinner was \"The 90's\" appropriately titled \"Tastes Like Teen Spirit\".  There was also a guest chef each night and Matthias Merges was the addition for our night. <br><br>Chef Foss and company aren't messing around.  Our 16 course dinner was creative and playful and the 90's inspiration was not lost in the delivery.  Courses were aptly named \"Soup Nazi\" \"Hannibal Lector\" \"Amish Paradise\" \"Gin and Juice\" etc, I'm old enough to remember the 90's well and my friend and I just loved the interpretation.  <br><br>The food was artfully presented and quite good.  We enjoyed every course and a few just blew us away. Now when dining, not only is taste important, but sight and smell plays a factor.  At EL Ideas, sound also helps with the dining experience. The playlist that was put together was on point and totally helped with the 90's ambience. <br><br>Each course is delivered to the table at the same time and preceded with the description of the meal.  It really gives it a communal feeling and we loved the intro's.  Makes it more personal than just reading it off a menu page. <br><br>The stand outs for me of the evening: <br>Ode to Bubba (shrimp served several unique and delicious ways) <br>No Soup for You (this amazing vanilla potato \"soup\" made with liquid nitrogen)<br>Hannibal Lector (liver, fava)<br>Amish Paradise (cordon bleu with parsnip and pepper)<br>Coronet (venison, egg yolks)<br><br>My descriptive words mean nothing at this point because it's just one of those things you need to experience.  But let me tell you, as my friend and I enjoyed the Soup Nazi course, \"Truly Madly Deeply\" played overhead and you're probably going to think I'm wackadoo but that song just paired so perfectly with that course!<br><br>As many said, it's BYOB which also makes this a truly personal experience.  We brought a bottle of Bubbly and a Red Blend and that was perfect.  They actually had an opening course of Zima for us.  Yes ZIMA!  you can't buy it anymore, but they did an awesome job recreating that 90's fad drink. <br><br>This is more than just a Michelin Star experience.  You mingle with 18-20 other guests (or not, up to you), You chat with the chefs and staff in the kitchen (or not, it's up to you).  It was like a dinner party with our own private chefs. But super talented chefs that take the time to talk and really show how much they enjoy what they do. Our greeter/maitre D was super fun. He even hinted at getting us a second dessert if we wanted...(this amazing chocolate cake with kierschwasser and cream)<br><br>We did bring a gift for the kitchen--some locally brewed beer from a small Chicago Brewery and it was graciously and genuinely received. I'll say it again, Chef Foss and company aren't messing around. Easily a fave and easily 5 stars.", "pics": null}}, {"review": {"des": "Overall, it was a great experience. The vibe is great - fine dining in an unpretentious setting, and a very friendly team. Like the other reviews - it's a 9-11 set course tasting menu (varies by the menu as it changes frequently), BYOB (check the website for what types of wine to bring but I would bring something light and bubbly to start off with as everyone's arriving and then whatever wine / beer is your preference). You're welcome to also walk around the kitchen to watch the chefs cooking. <br><br>The food was tasty, but there were some standout dishes that didn't mesh very well. Personally I'm a fan of sweet / savoury dishes, but some of the sweet / savoury mixes during that meal just didn't sit well. One was the potato leek soup that came in a milkshake glass with dry ice and crispy potatoes at the bottom. Positive: it was a really cool dish and an amazing experience to watch the dry ice smoke float around you as you crush it in the soup. Negative: I guess some people love fries and ice cream, but it didn't really sit well with any of us after the initial wow factor because it was some sweet, some warm, some cold, and then the crispy potatoes after. It was sort of like melted ice cream soup with some potato soup mixed into it, and topped with fries. <br><br>Another was the foie gras dish with the cotton candy - the foie gras flavour and texture was there, but the mix with the gelatinous soy sauce and the cotton candy was just an odd flavour combination that didn't really complement either of the flavours as well as we were hoping for.<br><br>Summary: very cool experience, but the food and flavour combinations could be more impressive (more quality rather than wow factor), especially for the $155 pp. BYOB is great though!", "pics": null}}, {"review": {"des": "Quite a wonderful dinner, we'd compare EL Ideas favorably with Everest, where we ate just two nights previous.  For us, BYOB is a real factor, since we really like to bring along our own choice, and it was also nice that there is NO CORKAGE FEE.  With such a long menu, all I can do is tell you what we ate, and how I scored each item.<br><br>Corn: caviar, ghost pepper (taken off of mine), cojita                       -   85/100<br>Olive: tomato, plum, snow pea, fig, almond                                     -   90/100<br>Cauliflower: anchovy, lemon, parsley, caper leaf                             -   95/100<br>Carabineros: jalapeño (omitted from mine) jicama, fennel, ramp    -  100/100<br>Squash: salt cod, chanterelle, chickpea, smoked paprika               -   95/100<br>French Fries & Ice Cream: potato, leek, vanilla                               -  100/100<br>Jamón ibérico: ricotta, crackers, basil, peach                                  -   95/100<br>Foie Gras: kumquat, mustard, radish, lettuce, saffron                     -   95/100<br>Sweetbread:  quail egg, salsify, sorrel, truffle                                   -  100/100<br>    These were veal, from thymus<br>Cherry: duck, quinoa, tosaka                                                            - 100/100<br>Profiterole: pluot, green tea, black sesame                                      -  90/100<br>Banana Split: dried fruits with banana pieces                                   -  90/100<br><br>The chefs who guided our tour through EL Ideas dinner experience were Phillip Foss, David Goody, Michael and Catherine.  My overall score for this wonderful meal is 94.6%  Great Job on a fine meal!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cEupUiHozKcZ7TTup7-8FA/348s.jpg", "caption": "Mitchell looking at the vast collection of menus"}]}}, {"review": {"des": "Wow, so after watching punk bands at Riot Fest and eating from food trucks the past few days I wanted a fine dining experience, and I definitely found it here at this restaurant. Amazing presentation, super cool vibe, spent about 150 bucks a person, but well worth the tasty dishes and cool open kitchen. Never experienced dining this way. Wish they had something like this in LA.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/opIRPaVobJuaUMQvl0JQqA/348s.jpg", "caption": "Amazing!"}]}}, {"review": {"des": "I had a pleasant dinner. Everything about it was fun and light--the ambience, the chefs' spiels about the food, the set-up.<br><br>The Rockefeller, the antelope and the foie gras baklava were the best. The pot pie and the mole were middling. The pumpkin caramelized white chocolate was the better dessert. Overall, while the food was very good, I could not say it was one of the best meals I've ever had. In my opinion, this was better than the tasting menu at Everest, but not in the league of Grace or Alinea.<br><br>I don't regret coming. But would I go back? Maybe, maybe not.", "pics": null}}, {"review": {"des": "Note: I dined here about a year or more ago on a business trip--not sure when, but there was snow on the ground so it could have easily been any day out of the year... just KIDDING Chicago! I am from LA, so I find it hilarious to joke about the snow.<br><br>Old lady humor aside, I loved EL Ideas! I only give the time-line disclaimer in case there were any changes in the kitchen/management staff, etc. Do not feel like doing the research myself, this is just Yelp after all, not the NYTimes. <br><br>One of the most phenomenal meals I have had outside of New York. Sorry LA, but you are not up to par yet! A friend of mine who lives in the South Loop recommended this place and I am so happy we were able to score last minute reservations. Thank you to whomever had the flu, or whatever, to grant us a table for two.<br><br>I went with said girl friend from earlier, we took a quick cab ride over from 16th street, and brought 4 bottles of wine between the two of us, FULLY intending to share half of each bottle with the staff. Etiquette, right? We forgot the processed snack food that chef friends of mine recommended bringing, but we brought a six pack of beer for the guys instead, in addition to our wine plan. So... we did share a lot, but managed to get quite tipsy regardless. Sorry to be a brat, but I only drank my share, Vanessa. Just in case the kitchen guys recognize my photo... I was the sober-ish one!<br><br>The staff was gracious (see drink notes above), the food was unspeakably amazing, and the atmosphere fun and party-like. I wish more places were like EL ideas. It feels like one of those underground NYC dinner parties that were super big 10 years ago, where everyone starts off strangers, in an inviting and casual environment, but three to four courses in everyone becomes friends, talking and wandering (respectfully) around the open kitchen, asking questions, sharing wine, and indulging in the intricate dishes.<br><br>Don't hesitate to go to EL Ideas if you are used to fun food in a hippyish/stoner kitchen environment. The technique is fine-dining, but the service and atmosphere are more relaxed. If you only want to go because of the hype, then maybe skip it, because you might be disappointed. And seriously, who gives a one star review based on the reservation process, not DINING experience? Write management a note and stop your public crying. Please! <br><br>Also, when we arrived, the restaurant seemed to be in an abandoned area. But by the time we left, the area was popping, with a jazz club on the corner and who knows what else because our Uber arrived before we could talk to the bouncers. Future explorations I guess.", "pics": null}}, {"review": {"des": "Had I known dinner for our 29th wedding anniversary was going to be this fantastic, I would have flown up to Chicago the last 28 years to celebrate! We were surprised to have the chefs table and were able to watch all of the action and interact with the chefs for each course. Clearly the star of the night was each of the 13 courses. However, what made the evening most fun was walking around the restaurant, seeing how the items were prepped, and talking  with the other guests. Yes, playing with the food was encouraged... as the first course you literally licked the plate clean since utensils were not allowed. Save up your pennies for a celebration; Bring your own great wine; And prep yourself for one of the most fun evenings you will have with your clothes on.", "pics": null}}, {"review": {"des": "I've dined at El Ideas about 3 or 4 times and I must say, they have really stepped up their game.  They have always been an innovative restaurant.  I have always been impressed with their creative combinations and their beautiful plating.  However, I was not too impressed with the taste of their food in the past.  Don't get me wrong-there were some very unique and delicious plates.  However, out of the 13 or so courses, there were only a handful or less of hits.  This has changed.  I went there last night and was really impressed!  I think there was only 1 or 2 average tasting plates and the rest were delicious.  Of course the plating was still beautiful and their ingredients were unique.  No wonder they received their Michelin star! I will happily return to see how their menu continues to evolve.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2HzNrtTZH9NSR3EBfToaKg/348s.jpg", "caption": "Peppermint- chocolate / honig bussel / pine"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_--BS4MyLIAfnlfldXrHYQ/168s.jpg", "caption": "Chartreuse : fennel / white chcocolate / cake / huckleberry"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eftGwNSelIgBmmPh5MtgRA/168s.jpg", "caption": "A5 wagyu beef: maitake / smoke"}]}}, {"review": {"des": "I was truly disappointed in the meal at El Ideas.  There were 6 courses and within them was not an appropriate amount of food for the $200 price tag after tax and gratuities.  It was somewhat disappointing to be served plates of somewhat imaginative food in such an extreme small quantity.  A 3/4\" square of fish and a 1\" square of steak are inappropriate amounts of food to serve in this type of setting.  For the price point in other similar styles of restaurants in the city you receive generally 8-10 courses.  The courses El Ideas served were somewhat creative but there were no times where any of us were truly wowed by them.  <br><br>I'm very disappointed in our experience.  We visited on January 21, 2017 and there was very little enthusiasm by any of the people in our party for the meal we were served.  This is very close to the bottom of the list for similar style restaurants that we've enjoyed in the past.  A very big price point for somewhat creative but the micro-portions served were inappropriate compared to the promised experience.", "pics": null}}, {"review": {"des": "Best dinner I've ever had in Chicago. Ever. Went here for our one year wedding anniversary back in October. The staff was fantastic. El Ideas has all the talent of a Michelin star without the pretentiousness found at some places. I would recommend bringing two bottles of wine - each seating takes a few hours and I wished we had a second. The food was amazing. From first course to final coffee, we were impressed with the presentation, flavor, and creativity of the chef and staff. Can't wait to return!", "pics": null}}, {"review": {"des": "After three years of being a season ticket holder at Next, we were looking for something new... And El delivered. Amazing food, great service and lots of fun. I can't say enough good things about the experience.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sI6m-XSWXfObkNXUFrZCHw/348s.jpg", "caption": "Salmon like I have never tasted before."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UdKh_wqJK8RiV8kYYHxnOQ/168s.jpg", "caption": "Yum"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EUoTQ10_97V53IXSccck1Q/168s.jpg", "caption": "A lot going on in this dish."}]}}, {"review": {"des": "Seldom do I go out of the way to recommend restaurants to my friends but I do so for EL Ideas. This was a wonderful experience for my wife and I's anniversary. This is fine dining done the way it should be, approachable, friendly, and with cuisine that surprises and delights. <br><br>I particularly liked how the intimate environment lets you observe the chefs while they prepare their dishes and you can go up and chat with them too. I like how they announce exactly what you are eating and what they have prepared for you. <br><br>All in all, the whole thing feels like a genuine experience, which highlights special occasions and is what I believe fine dining should be like.", "pics": null}}, {"review": {"des": "Simply A-mazing!! A feast for your taste buds and eyes. This place is a must try for any foodie!", "pics": null}}, {"review": {"des": "I really wanted to love El Ideas. I loved that we were forced to get our of the typical areas we frequent and the idea of an exquisite 5 star meal in a casual, interactive and industrial atmosphere. We love the uniqueness of being able to interact with the chef and line cooks. Watching them plate each meal and trying to coax secrets out of them was fun. I was only successful a couple of times!<br><br>However, myself and by date were completely disappointed in the food. The first couple of courses were extremely boring and glad. Unfortunately this set the tone for the rest of the meal. My date enjoyed the regular menu while I had the meats replaced with a similar shaped or looking vegetable. This is what they considered the vegetarian option. Some sort of explanation of this before we commit to $145.  I can say that through all 12 courses I did not have one vegetarian protein. Disappointing. Mushy, grilled zucchini and overly oily parsnip are examples. Ugh. <br><br>The only two dishes that I thought were well composed were the french fries & ice cream, and the chocolate dessert. However the fries were very, very salty and the sweetness of the ice cream did not tame this enough. One course I thought was a crime, was the fonduta course. It was a homemade crouton topped with truffles, crispy ham for the meat eaters and cheese sauce. What rubbed me the wrong way was covering up the ornate shaved truffles with a cheese sauce. The truffle was completely lost in it all. Such a shame. Another course I disliked was the peach second to last dessert. The composed components did NOT work. Adding liquid nitrogen to the dish caused the peach and granola to become horrible chewy and unpleasant. Yuck!  <br><br>My date was just as disappointed until the 4th dish out of the 12, mussels. There were only four he really enjoyed: fries & ice cream, raviolo with lobster, bison and chocolate dessert. His biggest compliant was that most of the dishes were bland. I could agree more. <br><br>Now the last comment I have is that we were both quite surprised to have Chef Philip Foss threatening to kick people out for using fingers to eat their first dish. His expectation was that you use your tonuge, lick the plate. I didnt touch the first dish. It pissed me off actually. Luckily for the Chef we were out for a special occasion and wouldn't let him ruin our night. <br><br>If your thinking about checking out El Ideas. Think twice!!! You can get much better food an just as fun interactions for the money you would spend in other places. I wish I had someone tell me this before we booked the rezy.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/H4gMaI18J0Cx4hbCOl068g/348s.jpg", "caption": "The only dessert I likes... Cherries and Chocolate!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Hplp0JYhqS7dxN3xa0tQnQ/168s.jpg", "caption": "The fondu dish where the truffles that were completely lost. So sad."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bmBZ71quhTbUokSlousRRA/168s.jpg", "caption": "French Fries & Ice Cream"}]}}, {"review": {"des": "We absolutely loved it!  We sat at the Chef's Table which was a unique and fun experience.  Every course was amazing and perfectly executed.  Some highlights were the Pacific NWdish, frosty, octopus taco, and quail.  But honestly they all were delicious.  The chefs were very personable, and their passion is undeniable.  The atmosphere was really fun and relaxed, and we loved the music.  Can't wait to go back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Oubi4SVW-GkD_iSWPUE5Pg/348s.jpg", "caption": "Quail"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nXttBMFpQDNwy812O0oO-g/168s.jpg", "caption": "Chef's Table"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MM5SONgBpbEmMpbsiFYS6w/168s.jpg", "caption": "Pacific NW"}]}}, {"review": {"des": "I really have no words for this place because every time I think about my experience, I am just overcome with such emotion. <br>I am very happy I got to share it with my bestie. :]<br>SO amazing!", "pics": null}}, {"review": {"des": "We had a fantastic time at El, reserved a date in advance and ultimately had to change that date and they were very accommodating.    back to the meal - holy crap, flavor explosion at every dish.<br><br>well worth it.  the staff was fantastic and very engaging.", "pics": null}}, {"review": {"des": "Unique dining experience. Inventive, artistic and tasty cuisine. Two seatings on the weekend 5:30 and 9:30. BYOB (no corkage) is great for those of us that can bring bottles we would never order off a wine list. Restaurant seats about 25 and everyone is served each course at the same time while it is explained by the chef. Patrons are invited to walk around, including into the kitchen and interact with not only other guests but the entire staff. Business casual dress further indicates the relaxed, friendly atmosphere that pervades the place. We dined as a group of 6 and had a wonderful time. Highly recommended!", "pics": null}}, {"review": {"des": "Been to some michelin star restaraunts and this one---- is my favorite. <br><br>First, the food is a great value for the money. When I go to michelin places, this is not important, but here I noticed immediately. Second, its BYOB with NO corkage fee! Third, theres plenty of free parking. Fourth, the place is a concept I really lliked. He went for a certain feel and has nailed it. It might NOT be for you if you enjoy private experiences with your date/guest.<br><br>More on that.<br>The owner/head chef  decided that he wanted to make his place feel like a large downstairs dining room---- like a group dinner party. <br><br>There are several little things done through the evening that do this. From the layout of some communal tables, to some thoughtful/nice social ice breakers that will get the more gregarious guests to meet and chat with one another; making dinner especially nice.<br><br>Also, the kitchen is kinda like a stage in the round; you become a part of the 'work' without doing it......guests are encouraged to walk on up.... and around..... and investigate stuff poke around (with the exception of the actual grills.....off limits). But you can literally be directly next/across from the staff as they put together the courses for this intimate 24 guest place. VERY clever, Phil Ross!<br><br>We had a 10-course tasting menu for valentine's day and we cound't have been happier.<br>The servers could try and time the plating a little crisper, but it was not worth dinging them a star here.<br><br>the dishes featured caviar, venison, pork, smoked and souveed fish, and all the purees and cool veggie and mushroom preparations that you'd hope for. They were all wonderful and the one that was especially interesting was a foi gras dish that just blew....me.....away. Huge flavor. Big punch. Wow.<br><br>This is without a doubt the best 1 star Michelin experience I've had so far nationwide.<br><br>Congrats!", "pics": null}}, {"review": {"des": "There are not enough words to describe El Ideas.  The courses were all equally amazing and creative. The atmosphere is one in which lets you enjoy fine dining, while listening to interesting modern music (sometimes metallica, sometimes RHCP, whatever).  The owner encourages the group dining experience, and getting up and socializing with other patrons or the kitchen staff is highly recommended.  Its expensive, yes.  However, worth every penny.", "pics": null}}, {"review": {"des": "Hmmm....perhaps this latest menu is still being tweaked. The music is great, the atmosphere is cool, the owner is fun....and...the food is just ok. It's plated beautifully but nothing tasted great. <br><br>It's possible this was just a glitch in the matrix so I'll say that overall I enjoyed the experience but I would only recommend it to a very narrow and specific group of people.", "pics": null}}]}