{"name": "el-nuevo-mexicano-chicago", "reviews": [{"review": {"des": "This place is Great! I went on a Wednesday afternoon with my cousins. It was empty except for one other table but I'm sure it gets busy on weekends because I loved everything about this place.<br><br>First of all the food. From the complimentary chips and salsa to my pork chimichangas with rice and beans to the plantains with ice cream, it was all delicious and flavorful and I could eat it all the time. My frozen pomegranate margarita was all well made and delicious.<br><br>We sat at a table by the window and were comfortable. The bathroom was clean and easy to get to. It's a small place so nice and cozy.<br><br>Service was excellent. David catered to us perfectly. He was friendly and came to the table at all the right times.<br><br>I definitely recommend this place if you want a great meal  and great service.<br><br>There really isn't anything that I did not like about this restaurant. And ask for David!", "pics": null}}, {"review": {"des": "Not sure what the problem with this place is. We'd been here before for lunch and loved the food, but when we came back for dinner last Thursday, our experience was terrible. The restaurant was only half full, so we were seated immediately, only to be completely ignored by all four (five?) members of the wait staff. The bus boy was very friendly, and brought us waters and a basket of tortilla chips. He came back fifteen minutes later to refill our water glasses... but no one else had approached us to so much as take our drink orders.<br><br>The place wasn't busy, and we arrived well over an hour before closing, so it's not like they were swamped or in the process of cleaning up. But once we realized that the servers were more interested in gabbing with each other than taking our orders, we walked out and went across the street to the Duke of Perth, where we enjoyed an excellent meal and friendly and attentive service. THAT establishment, we'll be returning to; this one, forget it.", "pics": null}}, {"review": {"des": "A group of three friends and I were going to Market Days in Boystown, and were looking for a place to make dinner reservations nearby for after a day of drinking and hanging in the sun. El Nuevo Mexicano had such great reviews and we easily were able to make a reservation via the Yelp app, and those two things equal a huge win in our books!<br><br>We underestimated how long it'd take us to walk there from Boystown, so we arrived for our reservation on a Saturday about 10 minutes early. The hostess was so sweet and still sat us immediately. We were surprised that along with the front room of seating, there's also an entire back room AND back patio with large amounts of tables, good for groups!<br><br>Our group of four ordered a margarita pitcher and chips and guac. Our waiter brought out salted glasses and a big ol' glass pitcher for a good ol' time. He also kept the water coming as well, which was very necessary after the long, fun, dehydrated day we were having! <br><br>For my main entree, I ordered Tostadas, which were absolutely glorious. I was so hungry that I didn't take photos, which is abnormal for me, so do what you will with that information! Basically, they were VERY great.<br><br>There are also two single person restrooms in here as well, if you'd like to know the potty sitch.<br><br>If you're looking for a Mexican restaurant that's great for groups, has fabulous food, and takes reservations in the Lakeview/Lincoln Park area, El Nuevo Mexicano is your spot!", "pics": null}}, {"review": {"des": "Highly highly recommend! We came here based off of previous Yelp reviews and were not disappointed. All staff are friendly and they brought out ice water and chips and salsa before I could even get my jacket off! While the menu is on the pricier side, the food is fresh and high quality. I shared a combination fajita platter and it was more than enough for 2 people and came out on a sizzling plate. I also sampled the carne asada which was served atop of homemade salsa which had a unique and tasty flavor. <br>Additionally, we shared a pitcher of margaritas freshly blended!", "pics": null}}, {"review": {"des": "Nice area, (pay) parking on the street, kinda small, but cozy table setup. I like the decor. The staff was EXTREMELY friendly and helpful with suggestions. For instance, I was initially going to get the Enchilada de Pollo en Mole Verde,  but after my date ordered it, I was scrambling for another choice. Our server made an excellent suggestion that was similar, yet different. So I ordered Enchiladas Crema De Chipotle. We also had guacomole.<br>THE FOOD: The guacamole was a bit of a disappointment. It seemed blender smooth, and didn't have a lot of flavor. <br>The Enchilladas de pollo en mole Verde was excellent. Really tasty, savory and well made. My Enchilladas crema de Chipotle was also very good. Rich flavor with a touch of heat. I really enjoyed it. <br>Overall, an excellent meal in a nice, cozy place with nice people.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZWK59_ba_fn4lnSi7kVmbQ/348s.jpg", "caption": "Enchilladas de pollo en cream chipotle"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/J7G2JaqFBrCzF6wNEIB3ag/168s.jpg", "caption": "Guacamole"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/omoEeJohKo0CgLkyxGhueg/168s.jpg", "caption": "Mojito"}]}}, {"review": {"des": "Delish!!!!!! If you want authentic Mexican in Lakeview this should be on your list. The decor, music and of course food is on point in every way. <br><br>Our server was very attentive and friendly and provided great recommendations. It's a smaller space, not a huge restaurant but the intimacy is nice. <br><br>We sat in the back booth to be away from the door and cold air. My girlfriends started with the ceviche which they liked. I had the tacos de carnitas, the meat was cooked well and I chose this over the burritos or tacos that come in 3 with your meat choices because these had guacamole in them. I am not a huge fan of beans and requested double Mexican rice instead - no problem, totally able to accommodate.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4xcofoGhgiyjr-BDxzJ2fA/168s.jpg", "caption": "Tacos de Carnitas"}]}}, {"review": {"des": "My husband and I ordered carry out here Saturday night via the Yelp app and we were pretty pleased with our order.  I had the Chile peppers stuffed with beef and my husband had fajitas.  We also shared the cheese app which was super rich and flavorful.  My only two qualms were that this enormous cheese dip/app came with no chips--what were we supposed to have with it or was it meant to be eaten with a spoon?  We also paid $2 extra for sour cream only to not receive it.  When I picked it up it smelled amazing inside so I'm hoping to give it another shot and dine in.", "pics": null}}, {"review": {"des": "Wow!  So delicious!  Got here right when they opened on a Saturday morning and there staff was extremely attentive and food was delicious!  We started with the guacamole which you could tell was very fresh!  Next, we shared the pork tacos with rice and beans.  Careful....the pork is on the spicy side!  Love our drinks, too...the Paloma and Michaelada. We'd love to come back next time we're in town!", "pics": null}}, {"review": {"des": "This place is so consistently excellent. The food is awesome and the entire staff rocks! Their menu is huge and there are plenty of vegetarian and vegan options. We usually split fajitas which is a good amount of food, but you really can't go wrong. One of our favorites in the Lakeview/Lincoln Park area!", "pics": null}}, {"review": {"des": "Best Mexican food in Lakeview hands down!! <br><br>My only complaints were the guacamole could have been a little more flavorful (I know... I'm nitpicking but it was 10 bucks and just ok) and the price was a wee bit expensive for the value.<br><br>Overall though the food is absolutely amazing. I got the chicken enchiladas and the ranchera sauce was perfectly spicy and creamy. I could not stop eating them. I almost always take home leftovers, this time I did not. HIGHLY RECOMMEND!<br><br>My boyfriend got steak, pork and beef tacos.. he said all were superb but his favorite was the steak.<br><br>Drinks: Their margaritas are on point. Not too sweet. Out of the multiple flavors I have tried the Golden Cadillac is my favorite. At $14 bucks a pop they are fairly expensive.<br><br>Ambiance: Trendy, upbeat, yet comfortable.<br><br>Overall I highly recommend!! I didn't have any expectations going in but was highly satisfied. It is a little expensive for its overall value.", "pics": null}}, {"review": {"des": "When I began my hunt for the best Mexican food in Lincoln Park/Lakeview, El Nuevo Mexicano came up my searches. It was good! But not great. <br><br>My fiancé is from Mexico, so he really loved the unique menu options you don't see at many other Mexican restaurants. He could hardly decide what to order! But me? Personally, I prefer either hole-in-the-wall Mexican food or the fancier Americanized version. El Nuevo Mexicano fell somewhere weirdly in between. White tablecloths at a Mexican restaurant was definitely a new thing for me. And the food was great quality and the service was really attentive, but I didn't love paying $15-20 per entree.<br><br>The food itself was a-okay, and my fiancé said his dish was better than the version his mom makes at home (but don't tell her!). But I wasn't crazy about the enchiladas. And overall? The price and concept just left a little something to be desired.", "pics": null}}, {"review": {"des": "Went in for Family/Birthday lunch after having read Yelp reviews and I'd say it was one memorable bet. <br><br>AMBIANCE-<br>Family owned restaurant alive with Mexican decor. Such a Jovial staff!! Our server-  Alfredo, was on top of his game, a very friendly and informative gentleman. <br><br>FOOD- <br>The mexican dish names might intimidate you but the description is crisp and to the point. A very creative menu- Plantains in enchiladas. hell yeah! <br>1. Started off with the usual complimentary nachos & salsa (which usually is too spicy for me but this one was Perfect!)<br>2. Guacamole- flavorful, good portion for 4. <br>3.Shrimp Chimichangas-  delicious, surplus shrimps, crispy covering, not at all oily, comes with beans, salad and rice which were decent. <br>4. Pollo Asado En Salsa Molcajete- Juicy chicken breast in a roasted tomatillo sauce. I might skip on this one in my next visit. <br>5. Chimichangas veganos- Very creative, my vegetarian friends loved it!! & the dipping sauce is amazingggg!! it has sweetness from mangoes but a smoky kick as well. <br><br>DRINKS- <br>1. Happy Hour $5 Margaritas..:P<br>2. I wish they had more options with traditional non alcoholic drinks such as Horchata or Jamaica- (Guys a polite suggestion to add on to your menu).<br><br>- Alfredo might hate me for sharing this but if you tell the staff they'll make your Birthday boy/girl wear a Sombrero and play maracas. Delightful ending to our Lunch. Embarrassing for the birthday boy. <br><br>- Do check in on yelp for a complimentary petit flan.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JpRg1YWEx8AjsxzKugVMow/168s.jpg", "caption": "Pollo Asado En Salsa Molcajete to the right corner"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GGsveB5M2RTagHIerBwBtw/168s.jpg", "caption": "Shrimp chimichangas"}]}}, {"review": {"des": "This is one of those reviews where I'm tempted to rate it higher, but may need to return to fully decide.  <br><br>Drinks:  So I went there for the Margaritas and if this review was based on that alone, we'd be talking 4-5 stars.  The margaritas were great.  Not too sweet, not too strong.  It was a perfect balance on a warm day.  My partner and I decided to get a pitcher.  They don't mess around.  The waiter showed up at my table with two full glasses and a very full almost overflowing pitcher.  I knew it was going to be a good afternoon.  Definitely more bang for your buck with the pitcher as we each got 3 additional glasses out of the pitcher after our initial glass.  <br><br>Food:  The chips and salsa were good and the quac tasted fresh although I thought it could have used a pinch of salt.  We ordered a plate of tacos to share since were were a tad hungry, but not starving.  On the plus side, the tacos were substantial in size.  There were no concerns about it being enough food.  We ordered the ground beef (not my usual go to) and it was just okay.  I couldn't really taste much flavor in the meet due to the overwhelming amount of cheese.  All in all it sort of felt like a mushy quesadilla.  I probably wouldn't order it again, and based on what I saw around me I suspected that perhaps I chose wrong.  I'll probably go back and try again.  The drink specials alone are worth the trip.  I anticipate there will be an update in a few weeks.", "pics": null}}, {"review": {"des": "I've only had their margarita's so far. They're delicious. Nice ambiance also. Their food looks authentic and delicious.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/K6ESEnmb364h7dFMyOQQmw/348s.jpg", "caption": "8/2018"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xJ85XM5pkzPd9BvZKRaTOQ/168s.jpg", "caption": "5-1-18"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KgCSo_-44mrRySB-02Me5Q/168s.jpg", "caption": "Menu as of 8-24-18"}]}}, {"review": {"des": "I love that place make amazing food n drinking I love going there to celebrate bday with my family", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aMiu5X86Yb3dTwL6ENlyHA/348s.jpg", "caption": "Food was so good"}]}}, {"review": {"des": "I was absolutely blown away by the food and drinks at El Nuevo Mexicano. I stumbled across El Nuevo Mexicano during one of my Yelper Takeover events. I previously lived in the area for two years and never came across the restaurant until the event. I wish I'd <br><br>The staff were so attentive and helpful from the moment we walked into the doors. They put us at a table near the front so we can be easily visible for the people that we were slanted to meet. Our waiter was full of great suggestions for which dishes or adult beverages that we should order.<br><br>Our waiter recommended the mango margarita and it seriously changed my life! It was so delicious. It's seriously the first mango margarita that ever tasted like a mango, it tasted like they took a fresh mango and blended it instead of using some type of pre-made mango mix. I would come back just for the mango margarita. <br><br>The food was equally delicious. I ordered the burrito and it was just as delicious as the mango margarita. The waiter gave us a complimentary dessert which was awesome. <br><br>I highly recommend visiting El Nuevo Mexicano because I didn't have expectations and they blew me out of the water.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/C_zSgb0pt72DIlbCZTqWCQ/348s.jpg", "caption": "Mango frozen margarita.. I'm speechless."}]}}, {"review": {"des": "Been here several times and food is consistently mediocre - nothing offensive, but you can find better quality at any random mom and pop hole in the wall Mexican restaurant in Chicago. One problem has always been how overpriced everything is, about $3-4 over what you would typically pay for superior dishes elsewhere, but even that has not stopped me from coming back because of how close this place is to where I work. What did it for me tonight was how 1 hr after me and 3 friends sat down we were told we needed to go, so they can seat other guests. We had had 3 appetizers ($11-12 each) and 3 beers, and there was no line of people waiting to be seated. I don't particularly care for their motivation, I just don't see any reason to come back. Clearly no reason to help this place any further.", "pics": null}}, {"review": {"des": "Service was great.  Nice atmosphere and food was good.  Not crowded at all about 5 PM Wednesday evening.  <br><br>They have a patio, which I'm looking forward to checking out in warmer weather.  They also have a bar with a TV.  Close to CTA buses (22, 36 and Diversy buses).", "pics": null}}, {"review": {"des": "After reading great Yelp reviews my friend and I ventured to El Nuevo Mexicano late on a Sunday. It wasn't overly busy but there was a weird vibe as several employees walked past us and finally we were seated after looking confused by the host stand...but onto all the good stuff.<br><br>The atmosphere and decor is kinda upscale Mexican restaurant IMO. I sat down and opened the menu and quickly realized I wouldn't be eating a $10 dinner. So I scoured the menu for something cheaper and filling since I was starving. I settled on the 3 asada tacos for $16. I am used to 3 asada tacos for $6 - super authentic and delicious....and I can say for $4/taco for the best asada tacos of my life was worth it. Whatever they marinade the meat in was absolutely delicious. I was blown away!! My friends tostadas were delicious as well!<br><br>The chips and salsa were excellent. Very spicy - just how I like it!<br><br>Service was ehhh. But I never expect over the top at Mexican places. Definitely give this place a shot - if you feel like paying $20+ a person for Mexican cuisine.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4fwhAfEd2JrihTJiAhhNOA/168s.jpg", "caption": "Tostadas"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/w6p5fsWTm0IKD9MThTU_LA/168s.jpg", "caption": "Steak tacos. Too die for."}]}}, {"review": {"des": "Wonderful food and service. Best margaritas in the city. Fun atmosphere. I have been going here for around 15 years. Never a bad meal. They have the more basic dishes such as tacos but I prefer their more upscale dishes. Everything on the menu is tasty. Queso fundito is highly recommended.", "pics": null}}, {"review": {"des": "We went here for the first time largely due to 4-stars and because the manager responds to posts (good or bad). That usually says something about a restaurant. We weren't disappointed. The simmered pork house special and fajitas were great! Excellent service from Moises. We'll return.", "pics": null}}, {"review": {"des": "Probably the best restaurant I've stumbled upon in the last year. The service here is wonderful, and the food is superb.<br><br>At face value, its appearance is rather unassuming, as it is somewhat small. On some nights, it remains relatively empty (which is a travesty). Part of this might be due to its rather unfortunate location right along a rather vacant stretch of Clark street, and if you aren't actively looking for it, you might miss it. However, don't don't let this understated appearance fool you. This place is absolutely top-notch.<br><br>A minute did not go by where my water remained empty, or the complimentary chips went unfilled. The wait staff is incredibly attentive and accommodating. You can tell that a lot of care goes into the operation here, and it goes a long way. The food is always so fresh and flavorful - anything you try here is going to be outstanding (I highly recommend starting any meal here with appetizers to make the most of it, particularly quesadillas and/or guac).<br><br>The combination of the great wait staff and the excellent food make this a go-to spot for the Lakeview area, especially for the reasonable price. El Nuevo Mexicano is well worth a visit.", "pics": null}}, {"review": {"des": "We have been going to El Nuevo Mexicano for many years and they continue to provide great service, amazing monthly specials, and are so accommodating and pleasant. Our favorites are the enchiladas and the salmon, along with the La Nueva margaritas. Their sauces are so great and you can ask them to tone down the flavor if you don't do spicy. You can't go wrong with the chimichangas for dessert either!", "pics": null}}, {"review": {"des": "Saw all the good reviews so decided to give it a try.  I was pretty underwhelmed by the experience.  It was a busy night at the restaurant so they put us in the back - a pro is they take reservations.<br><br>We ordered quest fundido which was good.  The complimentary chips and salsa were nothing special.  I prefer my chips on the thinner side and a bit warm, but they are free, so I can't complain.<br><br>We got two other dishes that were pretty mediocre, average at best.  It didn't help that they were so busy, the service was extremely slow, we waited a while for our food, and it came out slightly cold.  It was getting late so we didn't say anything.  We waited even longer for our check and were basically the last people to leave the restaurant.  Only good thing about the service was the hostess who was very friendly, cracked some jokes, and checked to see how we were doing.", "pics": null}}, {"review": {"des": "Went here on a Sunday night. The restaurant was more then half empty yet the host tried to seat us at the bar. I asked for a table and the host hesitated - there were tons of tables fpr 4 people open but he seemed to think that offering one was not an option. We left. Not coming back here.", "pics": null}}, {"review": {"des": "I was expecting a lot more. We arrived around 7:00 on a Sunday night and inside was empty with most people seated out back. The wait staff were very nice and super attentive. There was no music playing and as the dinning area filled up the ambiance was lacking. <br><br>We started off with noticeably stale chips, which could have just been a late Sunday thing after a long weekend, but solid chips are a required first impression in my book. While not a great start, we hoped for better based on other reviews. <br><br>We ordered beef tacos, chicken tacos and beef burritos and we were disappointed with all three. The flavoring was bland and again the taco shells were stale, then went soggy. One pet peeve I have is a soggy taco and these were dropping with oil. <br><br>We decided it wasn't hitting the spot and left early for some ice cream at Bob Tails. Not planning on coming back, but seems like maybe we just showed up on an off night.", "pics": null}}, {"review": {"des": "This is our go-to Mexican restaurant for the north side of Chicago. The space is cozy and comfortable. The staff is friendly. The food is a notch above the standard fare of most Mexican restaurants.", "pics": null}}, {"review": {"des": "It's too bad,  the service is decent, the place has a charm,  they make a decent margarita.. but alas, the food??  NO BUENO!   We stopped in ordered tacos, both fried and soft.  <br>No flavor, no spice, over cooked shells that were both super hard, not just crunchy.  The chicken one they used shredded chicken and it was again unflavorful and the texture was just weird.  Where was the Mexican cheese? Where was the cilantro?  And what? was that watered down iceberg lettuce and tomato \"salad\" thing supposed to be?  If you can't get basic tacos right?  Not going to come back to try other things.  Too pricey for such low quality.", "pics": null}}, {"review": {"des": "Went there for the first time yesterday (Sunday) for lunch to satisfy my Mexican food cravings. It was not busy at all, so we got table with no problem. Server was very helpful, professional and friendly. By his recommendation we started with Agave Nectar Margarita (yum). <br>For appetizer I ordered ceviche. From our server we found out that recipe and presentation for ceviche changed, so if you looking at older pictures on here, it's different. But it tasted good. <br>You can say that I'm taco kinda girl, but when I go to places like this I like to explore menu more. So for the main course I got Enchiladas Crema de Poblano and my half had Enchiladas Crema Chipotle. Both came with side of rice and beans plus salad. And we both were very happy with our choices. <br>For dessert I could not resist having one of my favorites - Flan! One word delicious!", "pics": null}}, {"review": {"des": "I was craving Mexican food, so my boyfriend and I walked here and it was way more packed than we were expecting! We were told it would be about a 20-25 minute wait, but we were seated more within 10 which was a plus! Free chips and salsa, which they continued to refill as we blew threw them. I got the enchiladas cremas chipotle, and he got chicken burritos. Both were absolutely amazing! My chipotle enchiladas were smoky, and flavorful, and his burritos were good even the next day for leftovers. If you check in you get a free flan, which was very sweet but typical. Overall we thoroughly enjoyed it here!", "pics": null}}, {"review": {"des": "Ok the reason you go here is 100% for the happy hour. They have a $14 bundle which includes an entree and a drink. I got the margarita and the vegan enchiladas. We also got guacamole, which was bomb. I recommend for a an early weeknight dinner!", "pics": null}}, {"review": {"des": "Just came back here again it's been a while but the service was great and the food was awesome I had 3 chicken tacos that were awesome the staff was very good and I had a great frozen strawberry margarita will be back here again hopefully with my family so I can share the experience but a picture is worth a thousand words", "pics": null}}, {"review": {"des": "Had a great Happy Hour at this chill little place that serves very authentic Mexican food. The food is delicious. Chips and guac were top notch, and the nachos were just about the best ever. Flan wasn't overly sweet and came with dashes of delicious mango and strawberry puree. Prices for happy hour are a dollar or two off regular prices, so the savings aren't huge -- but the flavors, quality of ingredients and portions are. The menu has lots of vegetarian options.<br><br>The small bar seats about six and was tended by the terrific bartender Jayson. He explained the different margaritas, offered tastes before pouring, took your food order and all the while kept the conversation interesting. <br><br>This is a great place to go after seeing your favorite films at the Landmark Cinema down the block. With food and service this great, I'm sure I'll be back soon. Just save me a seat at the bar, please.", "pics": null}}, {"review": {"des": "This place is pretty friggin' awesome! Lewis was our server he was super cool! Told us about the history of this family owned restaurant and how he was in school to become an architect! He made our drinks nice and strong! We ordered the quesadillas and fajitas the food was plenty and seasoned well! Try out their Happy Hour!! I will definitely be back!!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GYjsyA9dj7Sjbl5tzCJ7Zw/348s.jpg", "caption": "Free Flan De Caramel Con Salsa De Fresa Y Mango"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/L4E1ebKa5ZpVzhQg-qkXsA/168s.jpg", "caption": "Fajitas!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KKcah21tX7QXlFqOfDbkUg/168s.jpg", "caption": "Happy Hour! $5 Agave Nectar Margarita"}]}}, {"review": {"des": "What a wonderful restaurant!  The place is very quaint, and the food is wonderful!  I had a house margarita (perfectly prepared) and the vegan chimichanga (delicious!). What I enjoyed best was the service.  My server (Adelis?) was  exceptionally good!  Quick, kind, skilled, and attentive but not too much.  I will definitely come back here on my next visit to Chicago!  Be sure to check in on Yelp!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-74zlxpWKBfwKeolPN4uCQ/348s.jpg", "caption": "The vegan chimichanga was *excellent*!!!"}]}}, {"review": {"des": "Really good place for a mojito. The food is generally well presented, smaller portions than I am used to for a mexican restaurant but well prepared and tasty.", "pics": null}}, {"review": {"des": "Very good Mexican food.  Great service, delicious Margaritas.  I had the skirt steak fajitas and done very nicely, their tacos are good with a nice variety and we've also had their tortilla soup.  Good solid food with a nice atmosphere.  High recommend.", "pics": null}}, {"review": {"des": "Pros:<br>- They take reservations<br>- Quick service<br><br>Cons:<br>- Not many vegetarian options<br><br>Came here on a date night with my boyfriend.  No terrible experiences, but the food was pretty standard.  Nothing to write home about.  This may, in part, have to do with the very limited vegetarian options available.", "pics": null}}, {"review": {"des": "Only had the pleasure of dining here twice, but had amazing experiences both times! All of their ingredients are so fresh, as are their margaritas! The service is quick and friendly, and even if they're busy they make sure to take care of you. <br><br>I've tried their steak fajitas which were amazing, as well as the enchiladas which I think are my favorite. When we checked in on Yelp we received a free small dessert and loved it!", "pics": null}}, {"review": {"des": "Absolutely wonderful people serving. With that said the Agave Nectar Margarita pitcher was subpar. The food was beautifully presented but nothing spectacular. <br><br>The overall experience was good but I wanted to be blown away after all the reviews we read.", "pics": null}}, {"review": {"des": "Love love love!! This is a small place with more of an upscale authentic Mexican vibe to it than your run of the mill margarita joint. Speaking of margs, this place does it right. Your frozen strawberry margarita isn't coming out of some industrial sized slushy machine in the back - they blend each pitcher individually, and they are yummyyyy. The chips are great (not super oily like some other spots) and their entrees are outstanding. I'm vegan so it's a huuuge plus to me that they have a vegan section of the menu (vegan flautas pictures below). That means I'm not just restricted to a simple bean burrito - they actually use vegan meat alternatives and daiya dairy free cheese in their dishes. Soo good! Service is also stellar. Every time I've been there, their waitstaff has just been overwhelmingly polite and smiley & something about that just makes the experience better. ALSO - In the summer they have a quaint little patio in the back opened up - so if it's warm outside make sure you ask to be seated outside!! Keep doing your thing El Nuevo and I'll keep coming back!", "pics": null}}, {"review": {"des": "First time visitor today. We had a wonderful time in the back patio. Our server Enrique was very attentive but not in the way. We were greeted by Maria who did her best to make us comfortable. <br><br>We had the Cadillac margaritas which are served straight up in martini glasses. Very tasty on a comfortable summer afternoon. We were there in time for lunch specials. I had the tacos with soft flour tortillas. Excellent.<br><br>I want to return and try a fish entree or two. By the way, the dining area inside is tastefully decorated. <br><br>All in all a fun afternoon.", "pics": null}}, {"review": {"des": "This restaurant is excellent! It is very apparent that they put effort into every bit of the dining experience. Really good food, they have upscale Mexican (I had roasted salmon with yams! ) and the others had amazing fajitas!  The menu covers all the traditional favorites of burritos and tacos as well as vegetarian options!!! Loved it, will definitely go back!", "pics": null}}, {"review": {"des": "I have made it an annual tradition to go to El Nuevo Mexicano for my birthday, as well as for summer margaritas, and other special occasions. <br>The best thing about El Nuevo is that they have several vegan options- not just regular items minus dairy and meat, but instead they add Daiya cheese and Upton's seitan to enhance already delicious dishes! <br>They have great happy hour specials from 4-6pm. I got a vegan enchilada dinner and a margarita for just $14. <br>The back patio is super cute in the warmer months, and the inside is super cozy for colder ones. <br>The staff is very friendly and efficient. There are always plenty of servers, bartenders, and hosts working. I've never had a less than great experience here.", "pics": null}}, {"review": {"des": "Came here for a friend's birthday party of 10 people. Service was very attentive. Their mango margarita pitchers were good. Other than that I am super picky about mexican food. Perhaps i got the wrong thing. I was trying to avoid tortillas so I ordered the shrimp in a chipotle pineapple sauce but the pineapple masked a lot of the flavor that it was tad sweet for me. The hubby got the best dish in my opinion which was the carne asada steak cooked medium served on a skillet with sauce.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1mm92gWVU9hFxlCjhfipdQ/168s.jpg", "caption": "Carne asada -awesome"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zKwBXTQ0XyRhRe6DnTYW3A/168s.jpg", "caption": "Shrimp in pineapple Chipotle sauce - meh"}]}}, {"review": {"des": "Great local spot for tasty Mexican food & a nice atmosphere. They have a wide range of selections, and it's impossible to leave here hungry. While I've enjoyed several meals here, I think their brunch is their best. I'd recommend the breakfast burrito. They have a great mimosa and entree deal I would recommend checking out. <br><br>Also- if the weather is nice, their patio is a great place to gather with friends.", "pics": null}}, {"review": {"des": "We Funksters must be on the up side of life's score keeper, Karma. With a labor day weekend of baseball, beer and Chicago dog's in our future we headed back to the Second City (actually, pretty sure it's the Third City these days).<br><br>Heading north on Lakeshore Dr and NO traffic, unheard of on a early Friday evening!  Especially a Jazz Fest holiday weekend!  Cruise onto Addison and spy two...not one... but TWO curbside parking spots! Yeah but we have to unload a van full of crap first. Will even one of those spots be there when we return from 1060.<br><br>After 6 trips up and down four flights we're ready to hunt the elusive \"Spot\". Back east on Addison and just a little past Broadway Karma \"parks\" a big 'ol wet sloppy kiss square on our lips. We stack it and pack it for the long weekend with not a move to be made until Monday before 4p. Cha-Ching!<br><br>El Nuevo Mexicano was a lazy mile stroll away. Just far enough to work up a nice Mexican appetite. From yelper's suggestions, the bar was set high.  We were not disappointed.<br><br>All was first rate from the door onward.  Seated, chipped and salsa'd all in one smooth minute. As others have stated, a little upscale in decor and presentation. With a quick pitcher of Agave Nectar Margarita's (El Jimador Blanco, Agave Nectar, Cointreau and fresh lime juice - $38) we commenced to get our Funkster on!<br><br>From the plates around us it was clear portions were significant. We decided to mix it up and share and share alike. Chicken Empanada in tomatillo salsa with sour cream and queso anejo $7; Tamal De Puerco O Pollo in ranchera and tomatillo salsas with sour cream $7; and a plate of three Al Pastor Enchiladas in a spicy tomatillo with a mountain of rice and frijoles $17. In true Funkster fashion we dined easy and slow with fine conversation around an exceptional south of the border meal with service just shy of perfection!<br><br>In short, we all agreed this evening pushed the El Nuevo Mexicano bar up a notch or two.  Would we return? In a Mark Ronson/Bruno Mars Uptown Funk You Up minute!", "pics": null}}, {"review": {"des": "It's been many years since I visited El Nuevo Mexicano, back when I lived by Wrightwood and Clark and could walk only a few blocks to get delicious Mexican food. Vegan food wasn't a concern to me back then. But since I relocated and adopted a plant-based eating program, it never occurred to me to brave the parking issues and heavy traffic and make a special trip back. Thanks to you, my fellow Yelpers, who helped me rediscover an old gem.<br><br>There are several vegan options here, and, of course, the standard Mexican type menu for all the carnivores and even vegetarians (cheese and beans!) out there. I had the flautas and my friend Jean had the fajitas. We each got a small hot quinoa salad, which was good. Jean loved her fajitas, and let me have a sample, which I enjoyed, too. We were trying to figure out what kind of vegan chicken was used, but we didn't ask.<br><br>The one thing that was a little odd was the tortillas that came with the fajitas. They were really small, smaller than the smallest size you buy in groceries. I guess it's nice that you can't stuff your piehole as quickly, and you get more time to digest, but she had to ask for more. I don't know what that's about.<br><br>The flautas were delicious, and the entrée filled me comfortably. I was very happy with my choice.<br><br>We each ordered a margarita. Jean had the house margarita, and I had the next level up. Mine tasted good, but there didn't seem to be much alcohol in it. I have a low tolerance for alcohol; a little goes a long way with me. Jean was driving, so I thought, I'll pay a little more and enjoy a buzz. I didn't get any sort of buzz. That was a small disappointment.<br><br>I look forward to visiting El Nuevo Mexicano again and working my way through the vegan menu. I'm very grateful that the ownership decided to serve the vegan market, and I would encourage other restaurants to consider doing the same.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pO64G88JkHBjXI3clpdfHQ/168s.jpg", "caption": "Vegan flautas"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DItctIMGnk7XX81mkpNXtw/168s.jpg", "caption": "Margaritas"}]}}, {"review": {"des": "I would say the food here is solid Mexican without being overly fancy or tex mex-y. I came here with my book club group. Some of us have allergies and others didn't like spice but the waiter was patient with us and made notes when we asked him to. We got the pitcher of margs - non flavored and they taste really good. I got thr enchiladas of carne asada and they were extremely well made. The portions are huge as well <br><br>They have a large patio in the back which they open up in the summer. The tables are made of chicken wire type metal so some things slip through / get stuck in it, ask for a platter in the middle for cutlery. <br><br>Overall everything was delicious, including dessert- I didn't think the tres leches cake was very authentic but it was tasty. Total was about 40 each for 4 people.", "pics": null}}, {"review": {"des": "Delicious margaritas! Some of the best I've ever had. And my creamy chipotle chicken enchiladas were amazing. It was a fantastic girls' night out and the service was remarkable.<br><br>They made this displaced Californian very happy.", "pics": null}}, {"review": {"des": "Not terrible, but not great! Went here for there vegan/vegetarian options.  With a ton of fabulous reviews I too became a believer.  I've driven by this place several times on a weekend evening and have seen it packed!  Which to me indicates a delicious place!  No, nope, not!  Came in today around noonish.  Ordered the vegan tacos,  First I would say they were street size tacos which is fine but with only a teaspoon of the seitan/chorizo  and a the rest was a filling of potatoes.  Whoomp, whoomp.  Also the food came barely room temperature. Will not return!  I'm ashamed of you and your Mexican food reviews Chicago!  Step up your game! Boo!", "pics": null}}, {"review": {"des": "The steak tacos are heavenly , the margaritas are to die for and the staff are a on point.<br>Our drinks are never low, chips and salsa are always replenished and our food is always delicious !!<br>Easy parking , friendly neighborhood and great ambience. <br>Keep up the great work guys !! <br>Loyal customer for life !!", "pics": null}}, {"review": {"des": "Fantastic authentic Mexican restaurant! Great staff, friendly service, and excellent food. Super vegan friendly, and the vegan/veggie options are amazing! And the best part? Free chips and salsa!", "pics": null}}, {"review": {"des": "Love the food here. Top hits are carnitas chipotle , the pollo con mole, and the veggie fajitas.  We get the mango margaritas and ceviche every time they are so good. Great patio, great service, great food.", "pics": null}}, {"review": {"des": "Really delicious food.  Charming ambiance & friendly staff.  Great margaritas but I think $14 each is too much. I will definitely go back!", "pics": null}}, {"review": {"des": "Simply fantastic!!! I came here after being invited by my friend. It's a shame I've driven, ran and walked right past it, without ever even noticing it (one of those habits that are overdeveloped in Chicagoans).<br><br>The house started us out with their very tasty chips and salsa, and we quickly decided on their fresh Margaritas and ceviche. A great decision I might add, and when it came to order, I asked are server (I feel horrible I forgot his name, because he was great... Dark brown hair Justin Bieber would be jealous of and rocks a goatee. He was also working the lunch shift 03/19/2017) for his top five list, and the one I chose was the Enchiladas Crema de Chipotle, which you need to know any French word that means ridiculously good applies to this dish.<br><br>Ultimately, if you love latin, diverse, and complex flavor foods, you NEED to try this restaurant.<br><br>I will definitely be coming back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WHtFZnKuyf3mrEYg4bv1sg/348s.jpg", "caption": "Flan"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AxXWv1FIm3IkZAbXzmbXnA/168s.jpg", "caption": "Enchiladas Crema Chipotle."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/z_P2VCwnAiyDj0pud5DkOw/168s.jpg", "caption": "Ceviche; looks good, but now let's see how it tastes"}]}}, {"review": {"des": "Had Sunday Brunch here for the first time, as we go often for dinner and love this charming place. Great casual spot with amazing fresh delicious Mexican fare. I had the eggs with chorizo and hit the spot. Corn tortillas,  guacamole etc. Highly recommend this gem!", "pics": null}}, {"review": {"des": "Service was excellent. Food was really great. We will definitely be going back next time we visit! That Fundido Appetizer is my new Favorite.", "pics": null}}, {"review": {"des": "Beware this place will not present you with the lunch menu unless you ask for it because they want you to purchase something off the full price menu. I find this Behavior despicable and I observed it first-hand", "pics": null}}, {"review": {"des": "You'd think with all the Mexican places in this town, choosing one would be easy.  But every time we think we want Mexican food, we go through a litany of choices discarding one after another for this reason or that.<br><br>But that may have all changed the other night with our recent visit to El Nuevo Mexicano.<br><br>My friends took us, the uninitiated, to El Nuevo for dinner the other night.  And after a small glitch with our reservation (what happened to that darn thing anyway?) we were quickly seated. free chips and delicious homemade salsa were delivered to our table, and our friendly server was explaining the menu and making recommendations. <br><br>The space is nice, cozy but not crowded with a great table in the window, and plenty of tables that can be put together for any sized group.  I also hear there is a patio out back that will be calling to me during the warmer months.<br><br>Pitchers of margaritas are loaded with flavor (and alcohol) and they have a large menu of them from simple to flavored, frozen or on the rocks.  With premium tequila they will run you about $37 a pitcher but worth every penny!<br><br>The food was delicious!  We started with two quesa fundidos (did I say my friends love cheese?) one with peppers which was even better than the chorizo version!  And they came with plenty of warm, flour tortillas to wrap around all the cheesy goodness!<br><br>The menu has some typical Tex Mex offerings but what interested me were the more authentic dishes and specials.  They even have vegan offerings which my vegan friends say are some of the best offerings in the city!<br><br>I wanted to try a little of this and that so I got the combination plate with a taco, enchilada with mole sauce and a beef tostada.  A very large portion and excellent!  My friends had an array of other offerings like the coconut shrimp, the carne asada and the grilled chicken.  Each were delicious!<br><br>Hard to believe that with all that food we had room for dessert, but if you check in with your Yelp app, you get a free flan which started us off and then those with a sweet tooth in our group went for the tres leeches cake and the plantanos fritos (fried plantains) which was served with some coconut milk ice cream.  Hard to believe we could even get up from our seats at this point!<br><br>Tummies full, we commented as we left that the debate was over.  El Nuevo is now our new \"go to spot\" for Mexican food . . . . . now I wonder what we will spend our time debating???", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AuLy4Q7ICqOqX67tUg3RHw/348s.jpg", "caption": "Combo plate"}]}}, {"review": {"des": "This place was a surprise after a surprise.   From the street it looks small and not overly impressive; on the inside, it's inviting with a surprisingly large back room and back patio - who knew?!?!   And, the food was authentic and fresh and so good.   Good for groups, date night, families.   Definitely go here pre-movie at Landmark", "pics": null}}, {"review": {"des": "Holy mole is this food good. I came in here based on a coworkers recommendation and I can certainly still be friends with her after going here. This place has my new favorite margaritas of all time, and I drink alot of margaritas. I had the steak fajitas and the steak was super juicy and cooked perfectly. This little hide away is worth the trip.", "pics": null}}, {"review": {"des": "Really great food! They had extremely different entrees compared to other Mexican restaurants i think it's due to the fact that different regions in Mexico eat different food so it was nice to experience something out of the ordinary and what I'm usually used to from Mexican restaurants.", "pics": null}}, {"review": {"des": "This place never disappoints! I almost always order the fajitas to split with whoever I am dining with, and it's just the right amount of food for two people. The flavors are really good, especially in the combination platter. I like that it provides the \"hole in the wall\" feel with more upscale decor and environment. I used to live around the corner, and this place is worth the trip back to Lakeview.", "pics": null}}, {"review": {"des": "I love Mexican food and I am always on the search for authentic versus those spots where the \"Mexican\" rice is clearly defrosted from a bag and this place is it (authentic!). It's deceiving in its size, as El Nuevo has a back room and a huge back patio!!!   They have a large drink selection, and menu items.   It was hard to decide what to eat, but I had carne asada, friends had tilapia, fajita.  Everything was tasty!<br>I will be back soon to enjoy the patio!<br>Great friendly service too!", "pics": null}}, {"review": {"des": "I went in there with high expectations based of reviews on here. <br>Service here is terrible. <br>We did get our drinks and complimentary chips and salsa but by the time we had someone come and ask us what we want I wasn't even hungry anymore, people next to us got approached and got their order taken while we waited and waited and waited, till we got tired of waiting and just decided to get the tab after the drinks <br>Can't rate the food since they didn't get around to it in a timely manner oh well.", "pics": null}}, {"review": {"des": "Outstanding Mexican food, great service and the majito was the best. Had a taste for Mexican food and went with person who was not a fan. He changed his mind when we went to El Nuevo. He could not believe Mexican food could taste so good. Also recommended by Check Please. Highly recommend. Portions were just right.", "pics": null}}, {"review": {"des": "Delicious food, friendly staff. Plenty of good vegetarian and vegan options. Super delicious salsa!", "pics": null}}, {"review": {"des": "One of my and my wife's favorite Mexican places in the city. So good with a lot of vegan options!", "pics": null}}, {"review": {"des": "Came here with my wife for dinner recently, but we have eaten here a few times in the past and always been pleased. I got steak burritos this time and my wife got the steak tacos. She seemed to enjoy her food, but my burritos were average at best; a similar quality to that you'd find from a taco truck for 5 dollars...fairly poor quality steak and the burritos had no filling other than just meat, so were fairly bland.<br><br>The shock came when we got our bill. Since my wife is pregnant, she got a virgin Mojito which they charged full price ($12.50) for. Their menu online states that steak burritos are $15 (which quite frankly is a stretch given the quality). When we got our bill, we were charged $17...I asked about the discrepancy and they showed me a menu in store that listed the price as $16...Where did the extra dollar come from?<br><br>In the end, they quickly corrected the bill and took a few dollars off the virgin drink price, but it is completely disingenuous and unacceptable to charge prices other than advertised. <br><br>The service we received was very good, but given the blatant price gouging and mediocre food, we will certainly not be coming back.", "pics": null}}, {"review": {"des": "I went here on a date with this guy I had been seeing who said this was one of his favorite Mexican restaurant in all of Chicago. I just think he doesn't leave his neighborhood very much. He said he liked it because it was \"authentic.\" I can't really say if that is true or not, but you know everyone is entitled to their opinion. <br><br>Overall the food was fine, guac never a bad choice. We also order the Al Pastor tacos which were fine, to be fair I think Big Stars and Antique Tacos are better, (might be a little bias as I live in wicker and proximity plays a big part in my love for things). As well as we order the chicken, the Asado en Salsa Molcajete. It was very spicy. The waiter said it wasn't but it was, I am also a baby when it comes to spice FYI. <br><br>Once again horrid service. Idk if the waiter was trying to be polite because we were engaged in a conversation but I mean I was practically falling asleep at the end waiting for him to give us our check. <br><br>I don't venture to lakeview very often. I thought the food here was fine, I cant really compare it to other Mexican restaurants in the area.  The waiter appeared to be serving other people faster so maybe you will be lucky if you check this place out. However, I would not go out of my way to eat here again, nor would I eat here again if I was in the area.", "pics": null}}, {"review": {"des": "What a great dinner. The staff is great and super attentive. My water never got below half and I drink a lot of water so that was great. We got the burritos and the tacos. I love the burritos, my girlfriend loved the tacos. The salsa and chips were the best we had in Chicago. Then we received a free flan with hearts in it. What a great completion to an awesome dinner. Thanks", "pics": null}}, {"review": {"des": "This place is on the smaller side. So when they're busy, it's really easy to feel like it's too packed. <br><br>Being from Texas and of Mexican descent I like to pretend that I know all about Mexican or Latin food... El Nuevo Mexicano has been the closest sit down restaurant I have found so far. <br><br>Honestly thought the main reason I keep coming back is their piña colada!! They're as good as the one I had on the beach in Puerto Vallarta two weeks ago.", "pics": null}}, {"review": {"des": "We had a nice, laid back dinner at Nuevo Mexicano. Dim lit environment, mexican music in the background and lots of margarita pitchers to go around. There was 5 of us that night and the service was great!<br><br>I had the carnitas with mango and plantains. A different take on carnitas but the flavor was good. Other meals included enchiladas and carne asada. <br><br>The staff was very patient and like another yelper commented, they also let us linger around while we talked our little hearts out. <br><br>We all agreed that we'd go back and drink margaritas on the patio.", "pics": null}}, {"review": {"des": "This place is AWFUL. Truly one of the worst restaurants I've ever been to. First off, it's hot as heck inside the restaurant. Have you ever heard of AC people?? Second, the margaritas were gross. Pure margarita mix-no alcohol. We ordered a pitcher of margs and couldn't get past two sips of the first glass. We told the waiter they were undrinkable and ordered beers instead. Yet he still charged us for them, so you know, really great customer service. Third, the nachos had - count 'em - 7 chips. Yep, an order of nachos included only 7 chips. For $12. Pretty expensive chips! So yea, I'd say avoid this place like the plague.", "pics": null}}, {"review": {"des": "This place has a great vibe with lots of people coming in and out yet still quiet enough you can hold a normal conversation. They have awesome vegan options. We had guacamole, ceviche, and vegetable fajitas, which were all good. The frozen mango margarita was super mangoey in the best way! They even had vegan desert options that looked great but I didn't have time.", "pics": null}}, {"review": {"des": "Hands down, BEST Mexican food in the city, BEST service (even better than some of the 5-star restaurants I've been to), BEST margs (if you are a lightweight, proceed with caution)!!  I can't say enough great things!!  They always remember us and my little girl and they are more than accommodating!!!  They have seasonal dishes which keep me wanting more.  The salsa is fire!!  Did I say that I love this place?!?!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_Y0BWAk12wxTwy47oOfxKA/348s.jpg", "caption": "Margs!!"}]}}, {"review": {"des": "Food is pretty good and reasonably priced. Have been a few times with different guests and all have enjoyed their meal. Service is excellent and the atmosphere is casual.", "pics": null}}, {"review": {"des": "Love this place.  The service was great and the food was even better.  The steak enchiladas may be the best I ever had.....and the chicken epinada WAS D BOMB!!!!!!  The only drawbacks was that my wife's chicken entree was super bland", "pics": null}}, {"review": {"des": "After seeing so many positive reviews, and in need of an omni/vegan locale, I had a belated birthday dinner at El Nuevo Mexicano.<br>I had the Burrito Vegano. My companion had the Carne Asada dinner.<br>My meal was really good-especially loved the Upton's Chorizo and potatoes mix stuffed in the Burrito and a really lovely side salad with fresh mango. <br>Interestingly enough, the standout for me was the Mexican seasoned quinoa. So flavorful. I was sad at first because I love rice (it's not vegan there), but I could have eaten a bowl full of that replacement quinoa alone...<br>The cuisine was not heavy and they load things with so many veggies, spices and a nice variety of salsas. Every meal I saw pass by wasn't just drenched in crema or cheese.<br>The sabor is there in your face, not hidden under a bunch of fatty condiments.", "pics": null}}, {"review": {"des": "Terrible customer service!! The \"manager\" is the real problem! Terrible!! He makes up rules that I have never heard of!! The place was empty  (4 families in there total at 5 pm) and he came over to our table and told us we couldn't have our stroller. Mind you we have a 3 month old who can't sit in a high chair. We were seated already and he made a huge deal about having a stroller.<br><br>We walked there and he wanted us to go get our car seat!! We left and will not be back.  <br><br>The manager did ask us if we had a car seat instead. He made a huge scene after the hostess had already seated us. The family next to us even said something to the manager. We are regulars and have spent lots of money here. The manager is terrible.", "pics": null}}, {"review": {"des": "FOOD: Pretty standard Mexican fare. My table had the enchiladas (chicken and beef), veggie fajitas, and the salmon with peaches. The salmon was pretty good, and the peach sauce over it was delicious. All the food came with a reasonable amount of sides too. Nothing about the food was too special though, especially considering the prices. <br><br>SERVICE: Here is where I feel El Nuevo really fell short. We were seated at a little table in a corner, wedged behind another table (so the only way to access us was by crawling over our neighbors). The speakers were right by our table so it was extremely loud and hard to talk. Our servers took forever to take our order, bring our food, and then our check, and our waters were rarely refilled. Everyone was very polite, but I expect a basic level of attentiveness at a restaurant that wasn't met. <br><br>Overall, I don't know if I'd come back. The food wasn't anything special, and there are tons of very similar Mexican restaurants in the area. <br><br>BONUS - if you check in on Yelp, you get a free small flan dessert! The flan was delicious so kudos for that.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Dpr5g6CEC5TJl_OAye7F2A/348s.jpg", "caption": "Beef enchiladas with all the sides/toppings"}]}}, {"review": {"des": "My boyfriend and I came from California to visit my dear friend! And we decided to have lunch here! Best decision ever, the food was amazing. Josue was our server, very friendly and he makes the best micheladas!", "pics": null}}, {"review": {"des": "I'm never disappointed whenI order from here.  The only problem is that I've ordered a really yummy dish and can't try the others because this one dish I've tried tastes so good.  Burritos Veganos yummmm", "pics": null}}, {"review": {"des": "I was around the area and decided to stuff my face with some Mexican food and hydrate with margaritas but didn't know where to go since I am not familiar with the area. So WWYS. What would yelp suggest? It suggested El Nuevo Mexicano and it was just the cutest, most amazing little Mexican joint ever. The food was to die for. The guacamole, the complementary salsa, the pomegranate margarita, the vegan burrito with quinoa on the side, the chicken and steak burrito, the flan, everything was woooow. The service was on point too. The table was always cleared and the water was always filled. Will be back for sure!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7Y27ufz3kjyNoO0SCkzkHQ/168s.jpg", "caption": "Petit flan. Free with a yelp check in, just wish i knew that."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oYxc4JDf0hsH1ERvM35YkA/168s.jpg", "caption": "Guacamole"}]}}, {"review": {"des": "Went here on a Saturday night with the family.  Service was very good, friendly staff , nice atmosphere.   Chips and salsa were excellent, kept them filled and everyone in our party thought the food was delicious.   Very fresh .  Also enjoyed the margaritas!   I would definitely go there again !", "pics": null}}, {"review": {"des": "I've been to many, many Mexican restaurants in the US and Mexico.  El Nuevo Mexicano has just moved to the top of MY list.  Firstly, every employee is from Mexico, that's a good start, except for the one guy from El Salvador!  LOL, close enough!  Friendly, excellent bartender, waiters and servers.  Painstakingly prepared and beautifly presented food. I ordered Shrimp Diablo while my friend ordered a taco platter.  We shared a very good ceviche made with salmon, scallops and shrimp and a mini (free) flan for dessert.  I was very very VERY happy at the whole experience!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1atGaJu-9axWONItkiiIBg/348s.jpg", "caption": "Shrimp Diablo with mango/corn salad with carrot"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ffbabsyxoMGO5iuGUyG0YQ/168s.jpg", "caption": "Carta Blanca and Casa Nobles"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nNqz0kjGVxKx8uKSHgsf4w/168s.jpg", "caption": "Cevechie"}]}}, {"review": {"des": "My husband wanted Mexican food for his birthday dinner which is hard because you want something that's a little nicer than your normal taco stand for someone's birthday. This was perfect! The food was absolutely divine and the service is spectacular. Our water glasses were never less than half full we did not have to wait any length of time for service. The chips and salsa were on the table the moment we sat down and they were taking our drink orders right away.  I had steak tacos and my husband had chicken burritos and all of it was just delicious including the guacamole which I'm pretty picky about. For dessert we ordered the fried ice cream ball which was great and they also brought complementary tres leches cake with a candle in it. I was totally impressed and nobody should go here without getting the tres leches cake. We were completely full from dinner but still managed to finish dessert because it was so good. I would recommend this place to anyone and everyone!", "pics": null}}, {"review": {"des": "Terrific Mexican restaurant in east Lakeview neighborhood. Wait staff is friendly and they don't rush you.  My wife had the plantains with a flavorful mole sauce. I had the chicken enchiladas with a delicious homemade cream chipotle sauce with a nice kick. The salsa is also homemade and is well done. All portions are very generous. The outdoor patio in back is fabulous. The mariachi band serenading the diners is excellent especially a young vocalist with a spectacular voice. Margaritas are also great. The pitchers are small though - it is served in a water carafe rather than a pitcher - My only complaint and reason for downgrade to 4 stars. Overall, a great place and will be back", "pics": null}}, {"review": {"des": "I'm definitely now a fan of EL Nuevo Mexicano - so happy to find a great spot for Mexican in our neighborhood.  Some friends of ours took us here last weekend because they are regulars and it definitely did not disappoint.  The service was SPECTACULAR!  Seriously, the best service and could give 5 stars just for that.  The food was good, the guac was the best.  My shrimp quesadillas were good, but still the guac beat everything we ordered.  Also, I couldn't drink so will be back when I can partake in a couple of don Julio margaritas - my husband said they were delicious!  <br><br>We will definitely keep El Nuevo Mexicano in the regular rotation!", "pics": null}}, {"review": {"des": "A hidden gem in the Lakeview area. Great service and food", "pics": null}}, {"review": {"des": "The vegan enchiladas were delicious! The flavors were on point, vegan chorizo tasted great, and the Daiya cheese on top (which I usually don't care for) had a nice texture to it and went well with the entire dish. And for $15, The portion size was just right. I'm a fan! Can't wait to go back and try their other veg/vegan entrees! (Didn't eat the refried beans - forgot to ask for a substitution - and the rice wasn't outstanding, it was just good).", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2DF4DNvXYougLzANCvkkqA/348s.jpg", "caption": "Enchiladas with vegan chorizo, potatoes and carrots."}]}}, {"review": {"des": "Had dinner here on a busy Friday night.  Our waiter was charming and the food was excellent.  I thought i didnt like mole sauce but i tried my friend's chicken in mole and loved it.  I'm getting that next time! A bit noisy but it quieted down by 9 or so.  I look forward to going back.", "pics": null}}, {"review": {"des": "SOOOOO RUDE! Will not go here again! I used to love this place and have always dined in. I called in an order for pick up and I don't know the exact name of what I want. Some girl answers the phone and I explain that the dish I get which is carne asada but it's the only one that comes in a skillet. She is constantly talking to other people and I'm just sitting on the line waiting. She doesn't put me on hold or tell me to wait a minute. Finally she comes back and tells me it's Salsa Verde, I say no that doesn't sound right. She kinda laughs and says how doesn't that sound right? I said I'm a frequent guest there and I know that's not it. I asked her not to mock me and told her that she was extremely rude. I asked to speak to someone else who can take my order, she said she was the only person that could. That's never the case! I live like 5 minutes away from here and it was my favorite spot. NOT ANYMORE!", "pics": null}}, {"review": {"des": "This is definitely my new favorite Mexican restaurant! The service is great, everyone was very nice and friendly. The frozen lime margaritas were delicious. They have a great vegan/vegetarian menu too. I have tried cheese enchiladas at so many different Mexican places and these were my favorite that I have had. They filled it up with cheese which most places don't do. Would highly recommend!", "pics": null}}, {"review": {"des": "This place is off to great start in its pursuit of 5 stars. The serving team and great customer service makes this restaurant truly top notch! <br><br>- I would recommend serving warm tortilla chips with the salsa. <br>- The sangria is soooooo good and strong. Try it if that's your thing. <br>- Season the carne Asada a little more. I'm looking for that bang, pow when it comes to steak for tacos, enchiladas etc. <br>- please keep serving fresh refried beans! I usually don't eat retried beans and that day I ate them all. Such a difference than canned ones that usually come with a Mexican meal. <br><br>I look forward to coming back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8kT5ohaqgsig4VJ969VhhQ/168s.jpg", "caption": "Carne Asada Enchiladas"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QMZxmATvNw0bBpOyoL0Rpw/168s.jpg", "caption": "Chicken Enchiladas"}]}}, {"review": {"des": "This is my favorite Mexican place in Chicago! It's a bit small in size, but it will leave you full and thankful for high quality, delicious Mexican food.", "pics": null}}, {"review": {"des": "This restaurant convinced my girlfriend and I to write our first review for a restaurant, ever. The food does not taste as good as it looks. Initially while eating my entree I thought maybe i ordered the wrong meal, enrolladas de carnitas. After a sequence of appetizers, I realized this restaurant actually sucks and is a disgrace to even be comparable to traditional Mexican food. If you are Mexican, stay away from this place or you will be utterly disappointed. I did not taste any \"sabor de Mexico\". Service is decent though.", "pics": null}}, {"review": {"des": "I love Mexican food and am a vegan and trying to marry the two can sometimes be difficult so I was excited to see they had a vegan menu (small but at least its something). I came here on a Sunday afternoon with two others. We were seated immediately with chips and salsa brought over not a second after our butts touched the seats. I had a sangria that was tasty, my friend had a lime margarita that was not very good though<br><br>I ordered vegan flautas and I was not disappointed! The plates are all beautiful, probably not as much food as some places give but it was delicious. The service was great as well, water was overflowing from our glasses. Can't wait to come back to try something else", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gxqaXrI-ZxNT9H_OWGtKCw/348s.jpg", "caption": "Vegan flautas"}]}}, {"review": {"des": "Went to El Nuevo with a large group for a friend's birthday on a Monday night. The restaurant is bigger than it looks from outside and has front patio seating for the warmer months. Free chips and salsa on the table of which the salsa was really good!<br><br>We did a few margarita pitchers to split amongst the group. It was just okay. Definitely had better margaritas in Chicago. They also gave really small glasses which didn't help. The pitchers were also pretty expensive. El Nuevo in general was pretty expensive for a Mexican restaurant in the area. <br><br>I ordered the enchiladas with mole verde. The mole was really good! Added a lot of great flavor without over powering the other ingredients. Wasn't too spicy either. Good sized dish that came with rice and beans. Several people at the table ordered fajitas which looked quite good too. <br><br>Service was very friendly all night but a tad on the slow side. They did gave our friend a free piece of cake for his birthday which was really tasty! El Nuevo is a nice Mexican option in East Lakeview. Overall, a 4 star experience.", "pics": null}}]}