{"name": "eleven-city-diner-chicago", "reviews": [{"review": {"des": "GREAT spot! I stopped in for their half sandwich / side lunch box and it was great! I got a half stack (sandwich) of turkey pastrami on hallah bread-- SO good!<br><br>The box also came with a side (I chose fruit), a pickle spear, and a cookie. Highly recommend this place!", "pics": null}}, {"review": {"des": "Years before we moved to Chicago, Eleven was a favorite spot of my brother's, who's a dedicated foodie.  It's since become a choice spot for us to dine with visiting guests, who often want something over the top and indulgent.  Eleven successfully captures the atmosphere of a hard-working family diner that's brimming with personality everywhere you look, from booth seating to family photos to thoughtful quotes.  There's a lot to entertain the eyes, a lot of novel conversation starters.<br><br>Portions here tend to be large, and it's hard to order seconds.  The milkshakes and cake slices will certainly catch your attention, and are as good as they look, but keep in mind that they're large enough to be a meal on their own.  If you like mashed potatoes, then please try the mashed potatoes and roast beef.  I have to work hard to resist ordering this dish every time.  <br><br>There's usually a wait of 5-15 minutes, and about 15 people can wait indoors (restricted by physical space).  We've always found the place (incl. restrooms) to be clean.<br><br>On a previous occasion, a (regular) server asked us to make reservations for parties of 7+, but when we tried, Eleven advised that they don't take reservations.  If you have a large party, you'll be eating upstairs in the loft area, where your view of the enthusiastic decor is limited.<br><br>Here's a snapshot of our most recent visit:<br><br>Lead with the Wisconsin cheese fries, with melted cheese so brightly flavored that you could almost drink it from a bottle.  Our guests' skepticism has vanished, and they now believe the hype.<br><br>Patty Melt and Rubin's Reuben - Disappeared rather suddenly.<br><br>Grilled Cheese w/ Soup - Speechless.  Best to-date.<br><br>Black & Blue Burger x 2 - Dry and short on toppings, compared to previous B&B burgers.  Still tasty.<br><br>Impossible Burger (Vegetarian) - Two bites, then deemed a failed experiment, though I didn't learn why.", "pics": null}}, {"review": {"des": "I got the Rubin's Reuben with pastrami and extra cheese over the fries.  The pastrami was so juicy and to die for, sandwiched between two rye buns, sauerkraut, and sauce.  The cheese was creamy and paired well with the fries.  Every meat at this Jewish pub sounded delicious.  Next time I want to try their roast beef.<br><br>Great music, great ambiance and scenery.<br><br>Server was nice and served us quickly.  Take note, they only serve once your entire party arrives.  I've been here 2 times before, and it won't be my last.", "pics": null}}, {"review": {"des": "I finally made it here for brunch the other day to see what all the fuss was about. <br><br>I have to admit, I was a little bit annoyed as soon as I walked through the door. It was PACKED. I could barely move, and had to push and squeeze through people just to get to where my friends were standing, where was proceeded to stand like sardines for about 15 minutes until we could get a seat. <br><br>However, once we were seated (which they won't do unless your entire party is there, by the way) upstairs, we had some room to breathe. I ordered a vodka lemonade drink they had featured in the menu, and it was really tasty. The food was also delicious and I have no complaints there.<br><br>I also really liked the concept of the candy bar, but it was useless in practice because the place was so packed that you couldn't even get to it. <br><br>I probably won't come here for brunch again because I just despised how crowded it was and there were no drink specials, but if I had the opportunity to come again when it was more empty, I would.", "pics": null}}, {"review": {"des": "In for another visit, this time for some brunch.<br><br>As before, the food was excellent.  I tried the \"Corned Beef and Pastrami Hash\" over some over easy eggs and some home fries.   What led me to this meal was the home made Pastrami, which was a delicious addition to the hash.  I think next time we come here, I'll be trying their French Toast.  It looked incredible.<br><br>My wife had a 3 egg omelet, which is more like 5 or 6 eggs!<br><br>The service was perfect, from the manager greeting us to our server.<br><br>Will be back again for sure.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/W9p51LwYiwIfoZyvQp94bA/348s.jpg", "caption": "Hash and Eggs Over Easy"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GpHeS9x-xtSQ45PUfUZxog/168s.jpg", "caption": "Belgian Waffles Smothered in Fruit"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8CxTcNBuQ9eH2-FIuwd50w/168s.jpg", "caption": "Egg White Omelet With Many Veggies"}]}}, {"review": {"des": "Very good tuna sandwiches and deli sandwiches. Unfortunately the two times I've gone, the service was quite slow and that threw off the experience. Tends to get quite congested, especially on the weekends and around lunch, so plan accordingly. Their latkes were very good and not too greasy like some other places in the city.", "pics": null}}, {"review": {"des": "Came here for a late lunch today around 1:30 today and got a real roast turkey breast cold sandwich on marble rye bread for $12.99<br><br>It came with lettuce and tomato, a very large pickle spear, and coleslaw.  I was a bit surprised that the sandwich came dry, with no mayo, nothing.  I suppose that's actually a healthier sandwich?  I added some brown mustard that was sitting on the table, and that was good for me.  <br><br>Portions are large and it filled up my hungry tummy.  I was pleasantly surprised that the coleslaw was NOT swimming in mayo like some other places do.  <br><br>The menu is extensive, with pastrami and grilled cheese and matzo and breakfast all day, among other items.  All looked good...  and pricey...  but I'm sure the portions are all quite generous.<br><br>The diner has a cute atmosphere with an old-timer feel, and there are large cake stands on the counter with the most decadent-looking cakes inside.  Oo la la!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Sdug5JwRRGs2Nbz8OAEcKQ/348s.jpg", "caption": "Real Roast Turkey Breast cold sandwich on marbled rye"}]}}, {"review": {"des": "On a day that included stops at Eataly and Duck Duck Goat, this place stood out for me. <br><br>One of my friends suggested it, and the rest of us harassed him about going to a deli/diner with so many great restaurants to choose from. We obliged and we ate crow. <br><br>Every bite of every dish we ordered was delicious! I'm not a connoisseur of Jewish delis, so I only had a couple of placed to compare this to, but this was better than the others I visited. <br><br>We started with matzoh ball soup and the Eleven Knish, made with potato. In the past, the matzoh balls I've had were bland and the broth had to carry the soup. Not here. the matzoh ball wasn't bursting with flavor, but I don't think it's supposed to. However, it stood on its own and the broth added another layer of flavor. I've never had a knish before, but now I want more of them. I loved this version!<br><br>Our sandwiches were the stars, the Schwartzy (smoked beef brisket served on Challah) and the Zenith (pastrami and corned beef, with swiss and Thousand Island served on rye). The Schwartzy was quite small, but very big with flavor, thanks in part to the jus for dipping. The Zenith was piled high with meats and delicious.<br><br>Service was good, and the place looked \"vintage.\" The food was memorable and I hope to go back some day to try their breakfast and other sandwiches. Don't look past this place.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UugkXb7qlsJOlNFvj0b0LQ/348s.jpg", "caption": "The Eleven Knish - potato"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YKN07v09OzRCzBcMpvrVtQ/168s.jpg", "caption": "The Zenith - corned beef & pastrami"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Q8mjR3w_H2th9wsgd64_GA/168s.jpg", "caption": "The Schwartzy - smoked beef brisket"}]}}, {"review": {"des": "Absolutley a chicago experience great service a huge menu and a vireoey of different things to experience in this restuarant. First off we came there on a Sunday for brunch in the morning they had a deli where you could fresh sandwich meat and sides. They also had a candy bar with old school candy that could be purchased by the cashier's desk. Don't worry about the wait I would say it's probably 10 to about 30 minutes but if you are outside there is an intercom that will call you I'm sure it gets dicey in the winter", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5Cd2JJ7c_C1rHMuExfhDmw/168s.jpg", "caption": "Grey Goose Bloody Mary...nice and spicy !"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4jrDVrlcmwfLh7YKYv61tQ/168s.jpg", "caption": "Frozen vodka Lemonade"}]}}, {"review": {"des": "Came to try three things.  The basic jewish dishes. Matzo ball soup and the corned beef and pastrami.  All the right flavors and textures.  Wish i had room to try the lox and potato cakes too.<br>Hand craft sodas and a soda jerk bar. Old school candy area too.  Nice.", "pics": null}}, {"review": {"des": "I live nearby and it has taken me almost 2 years to finally stop by for a meal.  We had friends in town and thought it would be a good option for the kids and adults.  I'd like to go back, but need to remember to try when it's not a Sunday morning in the winter as it's PACKED.  Good sign though, right?  We didn't have to wait too long.  They said 30 minutes and that's what we waited.  Everyone could get something they liked - mimosas, milk, Pastrami, sandwiches, boozy lemonade, mac & cheese, etc.  It was nice upstairs.  We liked checking out all of the art on the walls from over the years.  Looking forward to going back and trying more from the menu!", "pics": null}}, {"review": {"des": "This place was hoppin' on a late Sunday morning! A friend of mine has been mentioning this diner as a personal favorite of his, so we made a point to stop by before a White Sox game so I could try the place out during my final full day in Chicago. <br><br>I should start by saying I am a big fan of breakfast foods... and I judge a diner-type location, or any restaurant really, by the quality of their omelettes. That said, Eleven City Diner doesn't just cater to the breakfast food-fiend... they have a menu with various hot and cold options as well, including classic diner options like corned beef or pastrami sandwiches, tuna or chicken salad sandwiches, and grilled cheese, various soups, and so on. Their menu is pretty extensive, but they churn out quality diner food as well... no scrimping. <br><br>Ultimately, I opted to make my own omelette... spinach, tomato, mushroom, swiss, and chicken sausage. Omelettes are made with THREE eggs and served with seasoned house potatoes and toast (I'm a sucker for rye toast with my breakfast). Since I've never had one before, my friend also recommended I order the Brooklyn egg cream. I was wary, but opted to try it... for what it's worth, the Brooklyn egg cream (as noted by Wikipedia) is \"a beverage consisting of milk, carbonated water, and flavored syrup. The drink contains neither eggs nor cream.\" It reminded me of a milkshake, but lighter and with a bit of fizz. <br><br>Anyway, my omelette arrives and it's a monster... a delicious looking, fresh from the flat top (and steaming) monster. Considering this omelette a personal challenge, I dove in... tasting the seasoned house potatoes (SO good) and the omelette in turns. Honestly? I can't tell you which part of the meal I enjoyed more... because those seasoned house potatoes were money. Eleven City Diner gets a big thumbs up of approval for their omelette quality though as well. <br><br>Ultimately, I didn't win the challenge again the monster of an omelette... making my way through about 4/5 of it before waving the metaphorical white flag. You DEFINITELY get your money's worth at this place... a full breakfast for my friend and I came to about $38, which I consider to be well worth it. <br><br>TL;DR  Now I get what my friend has been talking about for months now. The Eleven City Diner is not to be missed... and if there's a wait? It's worth it. Plus? Mmmm... seasoned house potatoes.", "pics": null}}, {"review": {"des": "Dinner at Eleven City! I had a half of pastrami with chicken noodle soup. The meats are cured here, and the pastrami was warm and tasty. The soup was hot but bland- I was hoping for thin noodles but they were thick, should have the matzo ball. next time.<br><br>My Niece(97 pounds), had a brisket sandwich she also had a mint chip shake, and a piece of chocolate cake.  I sampled the cake, it was good, but for the price of two pieces of chocolate cake from Portillo's, that wasn't worth the calories at least for me, but I just had a taste, it was good enough.  My wife had a salad and some Homer's Ice Cream for dessert, our other friend had a burger. Everyone loved their food. Excellent pickles!<br><br>It is a bit pricey, over 100 bucks for 4 with a tip.  Service was good, the food runner was a little sloppy as he dropped the food off at our table, spilling a drop of brisket gravy on me, it didn't seem to concern him, as I mentioned it. <br><br>I'll be back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fAdJSQOu09_TII0WFKcLnA/348s.jpg", "caption": "Eleven City Diner - Chicago"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Z4oI976C2L6IVNDOuKEA0g/168s.jpg", "caption": "1/2 a Pastrami"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vaZGtkMJNfmb2dcwTIEgCw/168s.jpg", "caption": "Mint Chip Shake!"}]}}, {"review": {"des": "Wow I cannot believe how incredibly rude the staff are here. I almost wondered if rudeness was part of the allure of this diner because it occurred with such frequency. You cannot be seated unless your entire party is present. I mistakenly thought my friends were seated and told the host I was going to meet with my party, he rudely replied \"if they are seated you can only say hi you cannot eat with them.\" Well alright. You cannot make substitutions to your order, you cannot split checks...you just cannot. The food was pretty average. Our server was pretty short with our group. I asked for lemon for my water and I literally got three slices of the lemon rind. I never thought I would be so upset to the point that I would complain about lemons...couldn't make lemonade even if I wanted to.", "pics": null}}, {"review": {"des": "I love diners, especially ones that have a welcoming and homelike feel. When I walked in, I was greeted with a smile and everyone was very nice. At the entrance, there is a candy counter with a lot of different types of sweets. You can order to go or you can dine in. At the counter where you would order, they have a lot of food on display and the menu is huge. <br><br>Jackie is a great waitress! She was friendly & attentive to me when I came in. I also noticed her helping the other servers bring out food, so if you come in you should ask for her. <br>I tried the frozen vodka lemonade and I did not expect it to be that strong! I drink a lot lol and one was enough for me that day. <br>I also ordered the Wisconsin cheddar cheese fries and turkey sliders. The cheese fries are a super big portion but definitely tasted like they use cheez whiz and not what they said. I still liked it but you have to eat it while it's hot or the texture gets a little weird.. Idk why. The sliders were very good and a big size to be sliders. <br>I ordered a side of thousand island to go with them, which is extra 50 cents. It's not a lot but I kinda hate when places nickel & dime especially when you're dining it. But other than that, the food is very good and I will come back again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eE83tRSUtqGu3_FcWQvnzA/348s.jpg", "caption": "Turkey sliders w/ side of thousand island"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UeWzd4tYWV9n9QqSO5dE0A/168s.jpg", "caption": "Frozen vodka lemonade, strong!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZgvqDGjuzzqR5C5WMHwO1g/168s.jpg", "caption": "Cheese fries- big portion!"}]}}, {"review": {"des": "If you like over paying for food and being treated poorly by staff and management this is definitely the place for you.", "pics": null}}, {"review": {"des": "I came here right before a Bears game, and what a pleasant surprise to find a place that feels like a real diner here in Chicago. Usually when I go to a place that calls itself a diner, I leave rather disappointed, but I loved this place right from the start - it reminded me of the diner's you find in NY and Jersey. <br><br>I ordered a Reuben sandwich, along with the Chardonnay from Israel. My friends had the turkey sandwich, along with a Mimosa and Frozen Vodka Lemonade. <br><br>The Reuben sandwich had a generous amount of meat and the fries were plentiful as well. Everything was seasoned well, especially the fries. A lot of times the fries are either too seasoned or hardly seasoned, but here they were perfect. The wine was nicely balanced and my friend enjoyed his Frozen Vodka - it had a punch to it. <br><br>The server was attentive but not invasive. I'll definitely come back!", "pics": null}}, {"review": {"des": "If you're coming here get ready to eat! Large portions of house smoked meats and fries will fill you up for days. <br><br>I love myself a good Rueben and this place does a great job at it which is not easy to find in Chicago. I think it has to do with all the meats being smoked in house. Mostly everything I have tasted here has been amazing. Even the cheese fries had an amazing cheese fondue sauce on them, the milkshakes are also fantastic! I ordered the turkey melt here and the turkey was a tad big dry but I think that's just the meat itself. Either way this is not a health food store so stay away from the salads here, and go for the Rueben or one of their all day breakfast items. If you stay with that you can't go wrong. <br><br>A heads up this place is very busy! For being more in the south loop area this place gets a ton of tourists! I don't mind waiting, but if you're in a rush this place might not be for you.", "pics": null}}, {"review": {"des": "Absolutely delicious and legit deli!  The prices can b intimidating, but don't let the $15 Ruben steer you away.  You will not be disappointed.  Corned Beef AND Patrami open faced Ruben on the most delicious rye.  Full bar, great atmosphere, and welcoming staff.  I'll be back for sure.", "pics": null}}, {"review": {"des": "What a cool place!    The atmosphere is diner style with a twist.    They have a full bar and old time candy selection.   The cocktails were good, not a cheap pour.   The burger and fries were delicious as well as the turkey club.   Looking forward to returning and trying their potato pancakes!!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/n8nRP6gzEYdWqeZRTxLYVA/168s.jpg", "caption": "Turkey Club"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mPjUR9l0AOXuRJttaMWZRg/168s.jpg", "caption": "Cheese burger and fries"}]}}, {"review": {"des": "Great fries with cheddar, great pancakes, great service. Overall a comfort food experience done right. I'd give it five stars if it weren't for the fact that this kind of food is never meant to be five stars. But read the review and know it is someplace highly recommended. Go.", "pics": null}}, {"review": {"des": "I was visiting Chicago this weekend and went to Eleven City Diner for the first time today, all I can say is WOW! It was great! The service was wonderful and my Turkey Club was excellent! My husband ordered the Tuna Melt and he loved it as well! We had our 4 month old with us  and they were very helpful by making extra room for our baby. I will definitely go back next time I'm in Chicago!", "pics": null}}, {"review": {"des": "The place has a cool atmosphere and some undeniably tasty food, but it's just way too overpriced for what they're serving. It's not complex stuff, it's enhanced diner food - thus the name - but still the price point remains high. The quality has also, in my opinion, slowly dropped over the last few years. I was a big fan of the place when they opened and went frequently, but my recent visits saw errors from the kitchen and less enjoyable experiences with the staff.<br><br>If you end up having to go, the corned beef sandwich is good, and so are the classic potato pancakes and the cheese fries if they're serving them. Or just aim for dessert - the desserts usually ended up pretty good.", "pics": null}}, {"review": {"des": "I'll start by saying that all the meat here is delicious. Since they have a deli in-house, getting any meat related dish is a win, regardless of your preference. For my boyfriend and I, the cheeseburger was cooked perfectly medium and the meat itself was juicy. The fries were crispy and well-seasoned. The corned beef sandwich was also delicious.<br><br>However, I'm giving the place 3 stars because the service was very subpar. We arrived at 5PM on a Wednesday. We were seated and it took the waitress 15 minutes to come over to take our order. After that, when we needed to find her for the bill, we couldn't find her and tried to call her more than a couple times to no avail. It seemed like the place was a bit busy, but still, I would like to hope that the service would be a little more accommodating then what we received.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xlhdn1f9AHnbeidEm635fw/168s.jpg", "caption": "Classic Cheeseburger with Fried Egg"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/b3RCU3KMQasm3U71TxJxew/168s.jpg", "caption": "Corned Beef"}]}}, {"review": {"des": "If you're hungry and want copious amounts of food, you have to try the sandwiches at Eleven City Diner.  The sandwiches here a monster portions and lives up to Jewish Delicatessen standard of DELIciousness. <br><br>I'll keep this short and sweet.  I ordered the Number 24 which was composed of Pastrami, Corned Beef, Chopped Liver and Swiss Cheese.  It was delicious.  The cuts of deli meats were seasoned well and tender.  And I am a a huge liver lover.  Weird to many, but there is an richness that liver provides that if done right is immaculate, and Eleven City Diner does it right. The liver was silky and rich and truly made this sandwich because it even out the seasoning and slat of the corned beef and pastrami.  The varying flavors worked immensely well with one another.  <br><br>Oh, and it could feed a family of 32.  Okay, maybe not 32, but after a 1/4 of the sandwich your satiated, 1/2 your're full, 3/4 you're in a food coma, and if you can manage to eat it all you a champion eater that won't need to eat till the next day.  <br><br>My only issue with my order was the side.  I ordered the coleslaw to help balance the richness of my sandwich in hopes in would provide some clean refreshing flavors that would palate cleanser.  The coleslaw was bland and really needed some acidity in my opinion.  It didn't offer the relief I needed from strong flavor out of my sandwich, which was unfortunate because it could of really enhanced the dining experience.<br><br>All in all though, I thoroughly enjoyed my sandwich at Eleven City Diner.  It served really fantastic food, and the portions were epic.  I look forward to my next visit there.", "pics": null}}, {"review": {"des": "Very nice diner. The service was really nice and the food was delicious, I will definitely return. The only con (and it's a small one) is the menu a bit limited. Overall it was a very pleasant experience", "pics": null}}, {"review": {"des": "This place is incredible! Came highly recommended from a friend. I literally walked from the Chicago Marathon finish line to here! Great Bloody Mary, Great food, sweet atmosphere! <br><br>I wish I was here longer to try more things on the menu. If you're in town, check this place out! The servers are also super friendly and are able to recommend the best of the best. <br><br>Salud!", "pics": null}}, {"review": {"des": "Came here before a concert to enjoy a burger and fries. The man at the front was incredibly rude to other staff, and it was such a turn off watching him berate others in front of me. I was disgusted by him, and made it obvious. I truly would've left if it weren't for being on a time crunch for a show. <br><br>The impossible burger: 3<br>Turkey Burger with the works: 3<br>Fries with garlic: 3.5<br><br>Service: 3<br>Front waitstaff/owner: 1 <br><br>Unlikely I'd return.", "pics": null}}, {"review": {"des": "I am very disappointed with my experience today. They have a policy that says you cannot be seated until your entire party is there -- understandable. However, today my girlfriend and I went in for breakfast and got seated at a booth. We had not even been brought waters after 5 minutes, but no big deal, we were happy to wait. A friend of mine called saying he was in the neighborhood so I said hey come on over to Eleven City and eat with us! When he arrived and sat with us, a manager approached us and told us that because of their policy, he was not able to sit with us because he was not with us when we were seated and there was another party waiting for their entire group who would be upset by this. How is this my problem? We even offered to get up and wait for another seat to become available for our entire party. He told us that he can not seat us together and that we must leave, unless and I quote \"he did not want to order anything\". I was appalled. They literally told us we had to leave because he was not with us when we were seated. Let me also point out, half of the restaurant was open. They were not even busy. I really like this place, but because of this experience I will not be going back.", "pics": null}}, {"review": {"des": "Fantastic Diner- Had the Valor. One of the best deli sandwiches I've ever had.  Also home made root beer with free refills could not be better.  <br>Menu has a lot of great options", "pics": null}}, {"review": {"des": "Went for breakfast this morning to Eleven Diner and first of all I felt like I was in a time warp. Brought back so many wonderful memories of the old deli's my family and I use to frequent.  One of which was the old Ashkenaz on Morse Ave.<br>If my mother were alive I would bring her to Eleven for the fried matzah. One of her fav jewish breakfast dish.<br>I had the Quinoe scramble. OMG! Delicious. Now being a fitness trainer and health coach I don't eat heavy duty meals.  But I may just have to treat myself to a corn beef on rye one day and do an extra lap on the treadmill.<br>Highly recommend!", "pics": null}}, {"review": {"des": "We were escorted to a lunch here by our son. He and his wife love this diner, and we can see why. First of all...it's fun!! The decor is classic diner and kitchy sayings abound. <br>The staff is friendly and professional. The menu ..well, it sure is Diner Heaven. My husband and son went for brisket and corned beef sandwiches. These come with fries or greens, and are enormous. Just enormous. I opted for the classic veggie burger on a pretzel bun. It came topped with sliced avocado and was delicious! We all loved the food. <br>Prices are on the high end but portions and quality were there. <br>We never got to dessert. A shame, but you can only eat so much, right? <br>A fun eatery. You should go, already.", "pics": null}}, {"review": {"des": "I returned here for my birthday breakfast and it was as good as I remembered. I had a lox and bagel plate which was fantastic. There was plenty of lox and cream cheese and it was amazing. My parents ordered pancakes and they were GIGANTIC! Each plate came with two truly enormous pancakes. Either plan to take leftovers home, or split for sure. I also ordered cold brew, which came in a can, but it was amazing and super caffeinated.", "pics": null}}, {"review": {"des": "Eleven City diner delivers. Potato pancakes as<br>good as mine... but loaded with lox. Eleven does a nice breakfast/brunch menu. It was clean.. prices were reasonable for Chicago. I would definitely return for lunch to try a Reuben. I saw one on my way out the door and had some buyers remorse.", "pics": null}}, {"review": {"des": "These people have the WORST customer service.  I should be aware of this considering I've been a customer of theirs for 10 years.  The food is good but the management is less than professional.  They don't care about customer concerns and they don't accommodate small requests from long time customers.  Something as simple as calling and asking for their wait time is not a request they can accommodate.  Even if you ask if there is even a wait they won't let you know.  That's terrible, especially if you have kids who don't do well in waiting areas for an hour.  These people need to get in touch with their neighborhood.  If you can establish family friendly policies then we will just take our business elsewhere.", "pics": null}}, {"review": {"des": "I love this place: Great music, atmosphere, and menu. SO good and the wait staff, kitchen folk, etc all seem to enjoy being there. I recommend the pickle appetizer (with sour tomato!) and stuffed tomato with tuna salad. Overall, it's unique for a diner and well worth going to, so, go.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sD614UBwNTgs2QLC2J_V3Q/348s.jpg", "caption": "I f@&$%! LOVE this place. Killer atmosphere, killer tunes, killer menu. Service is OUTSTANDING and the wait staff, etc, seem happy 2b there."}]}}, {"review": {"des": "I am shocked I have not been able to get a review posted about Eleven sooner! This is my one  MUST stop at when recommending brunch/lunch spots to friends staying in Chicago. <br><br>The wait - Yes on the weekends there is going to be a wait. You know what? Thats going to be ok because at the candy bar they serve delicious bloody mary's and frozen vodka lemonade that you can order and can be brought to you while sit casual in their outdoor waiting area. <br><br>The menu - if you are one of those people that has a very hard time making decisions, I would recommend looking at the menu in advance and also scoping out the pictures. There are A LOT of options and I promise more than several of them are delicious. Even when you think you have your mind made up, you might see somebody else's table and want to change your mind. <br><br>The service - I come every year during Lollapalooza and what can I say. These folks know how to handle crowds efficiently <br><br>Don't forget this is actually a deli too, so if you are not just in town for a visit, I might highly suggest picking up some grub to go! <br><br>Go, enjoy, feel like a whale when you are done and love every second of it.", "pics": null}}, {"review": {"des": "It loses on the sole \"no-joiner\" policy. You have reserved tables and yet you can't sit 5 minutes while waiting for your final party who is walking from hotel. Businesses who are so short sites to allow people to sit and order and start spending money while they wait 5 minutes have terrible business leaders running the company. <br>Also a no substitution policy. A no splitting checks policy. Lots of policies to try and eat breakfast. Overall...okay food. Okay service with a real dandy of an owner.", "pics": null}}, {"review": {"des": "This is the place to go if your hungry and your family is a little hangry and you just can't decide what to eat. <br>This menu is large and has many comfort food options.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Nes67rwCybxShfQWfxrLZQ/348s.jpg", "caption": "Chocolate shake"}]}}, {"review": {"des": "The point of this review is to speak to the ridiculous rule of having to wait to be seated if your full party is not there.  After waiting 10 minutes in an empty establishment a gentleman not the hostess offer us a seat at the bar until the rest of the party arrived.  A group of 4 people, to seat 2 of us would not have filled the restaurant I'm just saying.", "pics": null}}, {"review": {"des": "Came here for a late dinner and was super impressed by everything! First, we had fast service, there were lots of vegetarian options, and the atmosphere was great. <br><br>I got the veggiestar burger (one of 3 or 4 veggie burgers) and a side of house potatoes. I wasn't pleasantly surprised to find that the veggie burger was really flavorful unlike most and enjoyed every bite! I also loved their twist on the breakfast potatoes - they had lots of garlic/herbs and were way more interesting than most breakfast potatoes. <br><br>My friend also really liked her lox scramble even though it was different than she expected. <br><br>I'll definitely be back to try more! The desserts looked great for next time.", "pics": null}}, {"review": {"des": "An upscaled Jewish-style diner with a full bar, boisterous staff, huge menu, and wonderful pastrami and corned beef. Also the most impressive red velvet cake I've ever had. Crowd-pleasing choice in the South Loop!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ANBo7_BLwiOlzF00kOr6OQ/348s.jpg", "caption": "Joyful decor"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/K7HNWgSdE6Nw8LSeecW5Bw/168s.jpg", "caption": "Strong farro salad substitution with the Zenith sandwich"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RFI47J6ejnv1VBxtRSmvxw/168s.jpg", "caption": "Fantastic red velvet cake"}]}}, {"review": {"des": "We came here before the Coldplay concert and I'm glad we did! The diner is adorable, two stories and spacious, with glass jars of nostalgic, childhood candy/sweets up front. There was a wait, which was expected since this is one of the few options walking distance to soldier field. We all enjoyed our meals. The menu is HUGE and it took a while to decide what I wanted, but I settled with cheese fries for the table and chilaquiles for myself. The chilaquiles were good with a good kick! I would definitely try one of the sandwiches next time. <br><br>The service was mehhh. They were busy, yes. BUT, there were plenty of tables left empty by us when we sat down AND it's not their first concert, bears game, event at soldier field - so you would think they would be prepared for this. Our server was not friendly and was not on top of her game. Not impressed. <br><br>OH! And, I almost forgot the best part - THEY HAVE JUNIORS CHEESECAKES!!! So, naturally we all split one! While it was pretty frozen, it was still delicious. I just wish they had it thaw a bit more before serving it, BUT - it's junior's cheesecake. I'm not complaining :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_dExYgI0PzAC7Z5hn3e9Mg/348s.jpg", "caption": "Juniors Cheesecake!!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_NWxKB2N7maJueccTHw46w/168s.jpg", "caption": "Chilaquiles"}]}}, {"review": {"des": "Best pastrami in the east coast. A must if you appreciate food. And dont forget  the challah french toast for breakfast or dessert", "pics": null}}, {"review": {"des": "I love coming here when I'm craving Jewish style food. The selection on the menu is big and size of the plates are big. I've been here a few times already and everything I tried was really good.<br>Just keep in mind you need to wait in line but it is worth it!", "pics": null}}, {"review": {"des": "Are you hungry?  Not sure where your appetite is taking you?  Well if you are at Eleven City Diner, your options are many.  But... you better bring your appetite!<br>Visited here during brunch hours on a Friday.  The gf wanted soup and a sandwich but I wanted b-fast.  Neither of us were disappointed with our orders and had a tasty time sharing off each other's plates.<br>I ordered a make-your-own omelet with a pancake.  The gf ordered the matzo ball soup and slider rubens.  The omelet was well cooked, you could taste the veggies (mushroom, tomato and spinach) and the pancake was the fluffiest I have ever seen, tasted great as well.  If you have never eaten here and order the MB Soup, be prepared, it is exactly what it says it is - a Matzo Ball.  A single ball filled with goodness with broth to outline the ball that consumes the bowl.  The three sliders were fresh and the perfect side to go with the soup for her appetite.  <br>While were there, the tables next to us ordered.  The full stack of pancakes stacked... the full size ruben is an insane amount of sliced red meat slabbed on a bun.  Just crazy how big that sandwich was.  The women who ordered it just stared and finally said, \"How the hell do you expect me to eat this?\" while laughing with the waitress who - I'm sure - is not surprised by the comment.  And the guy who ordered the pancakes is a true breakfast person.  Buttered, sliced, cut to eat and careful with the syrup.  If you pour the syrup too quick, it's gonna disappear as it soaks in to the fluff.<br>Eleven City Diner's counter and restaurant bring you back to the days of the original diner dining experience.  For any of you older folks out there and remember the diner under the Brown Line at Western Ave., all the counter here is missing the small tableside juke box players.  A great experience for kids and adults alike.  Again, bring your appetite.", "pics": null}}, {"review": {"des": "Huge portions and delicious deli sandwiches! We shared turkey and corned beef sandwiches. The corned beef (on rye with mustard...only way to go) was great (asked for lean). The matzah ball soups are gigantic. We also ordered a side of onion rings which we loved. Sliced thin so easy to eat, really good. On the weekend, expect to wait a bit since it's usually pretty crowded (naturally, you can't keep great food a secret for so long). This location is near the corner of 11th and Wabash in the South Loop.", "pics": null}}, {"review": {"des": "I really love the diner vibe of this place!! I was full from a previous dinner and had a taste for dessert and decided to try this place out.  Let me tell you...the Apple cobbler is amazinggg!!  I would like to shake the hand of the person who made it and get the recipe at the same time lol.    Their Apple cobbler used fresh apples and not that canned stuff with a scoop of vanilla ice cream.  If you come here for the food only, do yourself a favor and try the dessert! <br><br>I also tried their milkshake which was massive and they give you the extra too...#winning", "pics": null}}, {"review": {"des": "I must say I am impressed.  The food was excellent and the atmosphere was great.  I like how the restaurant has that 80's feel. I reminds me of my childhood.  I ate the French toast with toasted coconut, strawberries and bananas.  I will most definitely go again.", "pics": null}}, {"review": {"des": "I went here for brunch with a large group of friends on St. Patrick's weekend. It was so freaking yummy! I got the eleven city french toast and my boyfriend got the blueberry cream cheese pancakes. Both entrees were delicious. Everyone was pleased with their meal. We also ordered Bloody Mary's and and Michealados, all decently sized and well made cocktails.", "pics": null}}, {"review": {"des": "Literally fresh off the plane to visit my sister for a few days and I was craving a Bloody Mary. Thank goodness for Yelp directing me to this diner because it was the only one opened at 9am on a Wednesday that serves blood Mary's! The Bloody Mary was very reasonably priced ($9.50) for the amount of flavor an quality you get. It was a nice touch to have cheese and salami added on top too along with the traditional green olives! Our waitress was very patient and sweet with us and understood we were just there for a Bloody Mary pit stop. Although we didn't order any food we did check out the menu which was extensive and the food that was coming out around us looked mouth watering and had generous portions. Highly recommend for breakfast or lunch....or a Bloody Mary!", "pics": null}}, {"review": {"des": "Bottom Line: positive experience overall, despite some hiccups in getting seated at our table. Would come here again for a special occasion, but would probably just order online to avoid the chaos and wait times if it isn't a special occasion. <br><br>Service/Atmosphere: our server was fast, polite, and quickly filled up my cup of coffee before I even had to ask her. So, thumbs up there. On the negative side, however, my friend put our names down on the list to be seated. We were told it would take about 45 minutes. It was a Sunday morning brunch, so it was understandably a madhouse. After about an hour of waiting, we asked the front desk whether we would be seated soon, and we were told that they had been calling my friend's name for quite a while to alert us that our table was ready many minutes ago. (For the record, my friend and I were waiting very nearby next to what appeared to be a takeout counter, and we never heard her name being called whatsoever). Being quite hangry at this point, my heart sank, and I was afraid the man at the desk would exclaim, \"no soup for you!\" and kick us out.  Alas, the man at the desk didn't shame us or anything, and he still seated us despite the hiccup. What I'd suggest is that this restaurant get a better system for alerting people that their tables are ready; since this is a deli/diner, there is a lot of noise and activity, so it makes it hard to hear if your table is ready, especially since they seemed to alternate between announcing names via microphone/speaker and just yelling out.   Confusing. <br><br>Food/Menu: I got the Black and White challah French toast. It was worth the hour long wait and trauma of thinking that we lost our table due to the seating hiccup described above. ;) What can I say... it tasted like a perfectly well-executed combination of challah French toast, whipped cream, and a classic Zabar's-style Black and White cookie on a plate. How could you go wrong?!", "pics": null}}, {"review": {"des": "Used to be a favorite spot for me and my uncle. We hadn't been here in a while so we decided to come back. The staff and servers are rude, and don't even attempt to complain to management they don't want to hear anything you have to say. You need to be careful because if you get loud with the servers they'll put their hands in your face. I literally had to catch myself before I beat the dog shit out of that server. I would never go again and they've honestly lost a loyal customer and all the people I've ever referred there from Chicago, Michigan, Indiana, and Ohio", "pics": null}}, {"review": {"des": "Maybe our server was Alecia.  Or Felicia.  Either way, super awesome lady and a great server!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mYMpRkMLEU4Dm3UkzKRAuQ/168s.jpg", "caption": "Old fashioned cash register near the real cash register"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-Dusrx2mQ7nheBdtEtOXhQ/168s.jpg", "caption": "Love the paper straws"}]}}, {"review": {"des": "I will never go back here. The food is good (generous portions). The owner, Bradley Rubin, is scum.<br><br>I've been here 20+ times and have returned ONLY for the food. Hopefully, you will not interact with Mr. Rubin.  He sets a poor example for his staff and should not be in any business that requires him to interact with humans.  I understand he is trying to be the Soup Nazi, but this is Chicago, not New York. Get over yourself.<br><br>On Father's Day, I asked Mr. Rubin for a cup of water for my dehydrated wife, while we waited outside in the summer heat.  With microphone in hand, he dismissed me and told me to buy a bottle of water. When I told him we are simply waiting to be seated at his restaurant, he told his staff to give me a thimble sized plastic cup -- like the ones you pour for toddlers at Sunday school filled with grape juice.  Thankfully, his staff member saw that his behavior was inappropriate, and she asked me how she could help.<br><br>Everyone has a bad day once in a while, but Mr. Rubin has been rude, condescending and dismissive on many occasions. I guess it's part of the experience. And any press is good press.<br><br>So here's your press.", "pics": null}}, {"review": {"des": "Officially a fan of this place for breakfast (sesame bagel with jalapeno/cilantro cream cheese), lunch (mac n cheese with jalapenos and bacon), and dinner (cajun chicken breast sandwich); takeout and dine-in. They can get busy for obvious reasons, but if that bothers you just avoid peak hours. ¯\\_(ツ)_/¯", "pics": null}}, {"review": {"des": "If I'm ever in the South Loop, I'm probably here. This place has always been stellar. <br><br>1. The service is always friendly. <br>2. BREAKFAST ALL DAY. <br>3. GOOD breakfast all day. <br>4. A huge assortment of other top quality goods. <br><br>Also, I dragged my boyfriend here after an event in Grant Park. He had the burger and said it was fantastic, reminded him of our favorite take out place. <br><br>And I love the retro diner vibes of this place!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CuUqDoeV6FcnrdkO_o0hbg/348s.jpg", "caption": "Got a breakfast combo that includes: eggs, bacon, sausage, hash browns, pancakes, and toast. Carbs are love."}]}}, {"review": {"des": "Food is good what's bad is customer service you order for pick up you have to wait 15 min to gets someone attention to get your food it's little bit better if you dine in but pick up is terrible", "pics": null}}, {"review": {"des": "This is my new favorite diner. We came on a busy Saturday morning. The wait was only 20 minutes. I got the Lox and latke. It was awesome! I ate the whole thing. The latke was very fluffy, the lox was super flavorful and just melted in my mouth and not at all too salty. Balances well with the sour cream, tomato and capers. Would come for this dish every weekend!", "pics": null}}, {"review": {"des": "Delicious! Fun vibe, mix of retro and modern decor. Wonderful waitress Jennifer gave us guidance. We scarfed a brisket sandwich, their monte cristo, great slaw, apple cobbler/crisp and our libations: frozen vodka lemonade & a dirty gin martini. Wish we had time to go again before we return home!", "pics": null}}, {"review": {"des": "This is our second visit to Eleven.. what a rare place.. absolutely delicious. Never had a Bloody Mary, there's is incredible", "pics": null}}, {"review": {"des": "Very cute kitschy diner style restaurant. I'm in Chicago on a girls trip for the week and this was our first taste. The dining room is bright and lively and very busy as lunch hour approached. We opted for breakfast and received huge portions. Everything we tried was delicious from the Belgian Waffles to the make your own omelette. I got the feeling that I'd want to come back for their lunch/dinner options if our stay wasn't so short. Great place for groups, business lunches, families, etc. One little tip, there seemed to be a policy for one bill per table and only 2 payment methods excepted. Not a huge problem, just something to note upfront.", "pics": null}}, {"review": {"des": "Food was a little pricey, but it was sooooo good. Service was alright, as my cup was out of water for a while, but it was worth it. Would recommend.", "pics": null}}, {"review": {"des": "This place has all the typical fixings of a cool diner. The food I had wasn't anything exceptional, but because this blows my mind, I must share. My friend and I ordered some food to share, including the Elodie's Melody salad, described as \"Melody of Seasonal Vegetables\" and costing $11.99. I was expecting something along the lines of squash, zucchini, roasted red peppers, etc. We asked our server what would be included in the salad and she said \"avocado, roasted red pepper...\" and that's all she listed. We literally got served a garden salad. A garden salad, folks! And charged $11.99 for a meatless, lettuce-full, salad with cucumber, tomato, and some tiny bits of red BELL pepper. My mind... it is blown...<br><br>Oh, we also ordered the turkey club which was fine but it wasn't anything to write home about. I also saw a huge BAG of fries on my way in which is a nice reminder we're just eating some frozen fries here. Meh.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LV14ti6-po-alk4PYb4VTg/348s.jpg", "caption": "Apparently the Eloise's Melody salad and the turkey club"}]}}, {"review": {"des": "We visited from Az and this place is a MUST! You have to get the Bloody Marry Mix, it's so good!!! We bought a bottle to go.", "pics": null}}, {"review": {"des": "Great spot, Great food, scratch made, like home cooked meals.  Very large sandwiches.  The CornedBeef, Brisket & Pastrami are THE ABSOLUTE BEST.  Open faced Turkey sandwich will make you happy happy for sure.  Fast service, very reasonable prices.  Great inhouse smoked salami, turkey pastrami too.  Id definately recommend Eleven City Diner to everyone & anyone.  Great Pre-Soilder Field spot.", "pics": null}}, {"review": {"des": "I tried the impossible burger here for the first time. I am not a vegetarian but wanted to see for myself what the hype is all about. To my pleasure it actually wasn't bad.. I can say that the more you dress it up, the more it tastes like an authentic burger. I also ordered their bottomless old fashion root beer and it definitely his the spot. The vibe is great for families with children.. if you want to stop in and order just a sandwich from the deli counter, you can do that Too. They also have quite the variety on the menu from burgers and sandwiches to Breakfast. Next time I go, I will definitely need to save room for a milkshake from their old fashioned milk shake diSpenser.", "pics": null}}, {"review": {"des": "My family and I love this cozy feel good diner.  There's usually a line out the door whenever we come here but we never seem to wait extremely long.   I wish that the inside waiting space was bigger because I always seem to be in the way and there are so many people packed inside waiting for tables.  One thing I appreciate is how friendly the hostesses are.  That hostess stand is alway super  busy but the hostesses stay composed and smiling.  The service is great as well...very personable! <br>Food:  My go to is usually a sweet and savory breakfast.  The pecan pancakes are fab and the omelettes are huge.  I take leftovers home every time.  My son prefers sweets like the the Challah French Toast.  I've been wanting to try the matzo ball soup for awhile but I never did until recently.  It was full of flavor ...I'd love to curl up with a bowl of that on the couch.  The beef brisket sandwich on the Challah bread was also yummy.  I added Swiss cheese to it.  I'd recommend the Pastrami sandwich too. I really don't think that you could go wrong with anything from here. Great place for families.", "pics": null}}, {"review": {"des": "I'm a native New Yorker and a bit of a diner expert. <br>This place is just about as close to the NY Jewish diner food experience you can get without a 17 hour  train ride to NYC. JENNIFER, our waitress could double as the quintessential NY-Diner waitress with a midwest accent- loved her energy and big personality. She made a great chocolate malt, too. <br><br>You don't have to be Jewish to appreciate the matzah ball soup- an enormous, fluffy matzah ball in a flavorful broth- simple and satisfying. <br><br>The corned beef was \"right\"- and sliced correctly-piled high on top of seeded rye bread that can stand up to the savory meat. Perfect!<br><br>The cheeseburger was juicy and cooked perfectly. <br>Pass on the cheese-fries- not crispy enough and s bit cold, but the rest of the meal made my daughter and I giddy. We took home enough leftovers and a mountainous slice of Red Velvet cake- enough to serve an entire family for another meal. OyeVeh. This place rocks!", "pics": null}}, {"review": {"des": "Every big city has one of these touristy, overpriced Jewish delis.  In Indianapolis, it is Shapiro's.  In NYC, it used to be Carnegie Deli and is now Katz's Delicatessen.  In Houston, it's Katz's.  All of these places charge a fortune selling what are essentially simple sandwiches with varying amounts of deli meat on two thin slices of rye bread.  I had the corned beef & pastrami hash.  Good, but worth nearly $16 with a soda and tax?<br><br>Four stars for the food but minus a hundred stars for the prices.  It's not worth it.  Nothing here is less than $9 without tax, and most of the sandwiches are $12-$16.  And that's JUST the sandwiches.  Add a soda, an extra side of something, and you'll be close to $20 or over. You're paying for the ambiance and kitsch of eating in a Jewish deli, but most of this is the same food you'd get from Jason's Deli for two-thirds the price.", "pics": null}}, {"review": {"des": "People love this place! (Well my friends at least) But I found it to be way over priced for what I was served. The portions are large but very bland. I'm surprised this passes for restaurant quality food. Okay, I know it's a diner but they're just a few steps away from the Bongo Room which doesn't have the charm and eclectic style of Eleven but their food is so much better. I'll only come back if my friends insist because they love it so much.. (why?) their taste buds must be dead from the their years of smoking cigarettes.", "pics": null}}, {"review": {"des": "We stayed in a hotel nearby and only went here based off yelp reviews. This place was awesome as far as diners go. We had dinner and dessert here one night, loved it so much we went back for breakfast another morning.<br><br>They have a great selection and variety. For dinner, my wife and I enjoyed the french dip and patty melt. The fries were also tasty. Dessert, I paired the mint chip homers ice cream with their chocolate cake. Portions are big enough to share. My wife enjoyed the apple pie with homers vanilla ice cream.<br><br>The breakfast was also delicious. My wife had pancakes with fresh strawberries. I had a chocolate chip Belgian Waffle. The only thing I didn't enjoy was the coffee, but different parts of the country enjoy different styles/blends of coffee.<br><br>Both times here the staff was amazing. If I ever find myself back in the South Loop, this place will be a must. I can only compare it to the Pantry in Los Angeles. However, minus the Pantry's grilled sourdough bread, Eleven City Dinner is much, much better.", "pics": null}}, {"review": {"des": "NEVER will I EVER step foot in @elevencitydiner again. A #cockroach crawled on my son's plate and on my aunts arm while sitting a the table. Three grown adults all saw it. The manager tried to catch it and then LIED about seeing it four minutes later. Definitely calling the @chipublichealth tomorrow. #gross #bugs #nasty #chicago #chicagofood #chicagoeats #chicagorestaurants #chicagofoodie #chicagodiners #southloop #southloopchicago #chicagosouthloop", "pics": null}}, {"review": {"des": "What an awesome place. Great atmosphere with lots of cool decor, including a candy shop. Be prepared to wait, but it's well worth it. Everyone at the table enjoyed heir meal. The waiter recommended their French toast as they were known for it, and he wasn't lying. Crispy French toast topped with bananas and strawberries and fried coconut strips, with loads of syrup. Perfection. Side of bacon gave you a savory and sweet completion. Friends had the Bad-ass breakfast sandwich with fried potatoes, just as delicious. Matzah ball soup was also good. Would of like to try some corned beef or pastrami. Won't be disappointed for brunch.", "pics": null}}, {"review": {"des": "Awesome atmosphere and great service. My cousin and I split the Tom Waits 2am breakfast and I had a Bloody Mary. Both of these hit the spot and I will be going back to buy the house made bloody mix they have. Highly recommend!", "pics": null}}, {"review": {"des": "Summary: Great bloody Mary's, disappointing food. Not worth price point. <br><br>Came here multiple times with friends and family. Usually a party of 4-5. They do their best to seat you quickly, but the service kinda ends there. The wait staff seem genuinely uninterested in their jobs, and the food is overpriced for the quality. I've had the grilled cheese and tomato soup, the omelette, and the French toast on different occasions. The omelette is average. Nothing really stands out. The grilled cheese was a disappointment. I added bacon and they gave me literally half a strip of the thinnest bacon you can buy. I understand it's a Jewish deli, but if you offer bacon I expect more than a sliver. The tomato soup is watery. It's like someone took jewel osco tomato soup and poured a gallon of water into it. Same can be said for the coffee. No real flavor. <br><br>It's not bad it's just not worth the extra price point for bland food and sub par service. The wait staff just doesn't seem to care. The waitress said she would remove the grilled cheese from the bill, but still tried to charge us for it. We had to have a manager remove it from the bill. <br><br>The French toast was good the first time. The second time it kind of lost its appeal. <br><br>The only redeeming part of this place is the bloody Mary's. My husband and his friend love the bloody Mary's and even buy the mix. If not for the bloody Mary's I'd avoid this place unless you wanna take an expensive risk on food you could probably prepare for cheaper and with more flavor.", "pics": null}}, {"review": {"des": "I've been here so many times, I can't even count. Almost all of it has been for breakfast. They have giant portions, fast service, quality food, and great coffee. I tend to gravitate towards the Mexican scramble or customize an omelet. It's never disappointing. It has a counter like all the old soda shops and diners used to have, so you can sit at the counter and enjoy your breakfast. Has such a city vibe. I think you'll enjoy this place.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/u4c5C04eEamcFvR7uEB20A/348s.jpg", "caption": "Mexican scramble with side of avacado"}]}}, {"review": {"des": "Phenomenal food and great service - Veronica was the best! I had the Rubin's Rueben and it was the best I've ever had. Kids had omelets. Portions are very generous. Only bummer is I didn't save room for a malt.", "pics": null}}, {"review": {"des": "The food was good but the service was terrible! The host who seemed to be an owner too was a total jerk!", "pics": null}}, {"review": {"des": "Enormous portions of delicious food. The protein scrambler was fantastic and the accompanied seasoned potatoes paired well. Great with a cup of coffee but the Blood Mary's being made in front of me at the bar might have been a better option. Definitely recommend!", "pics": null}}, {"review": {"des": "i like eleven city diner, and truly wish i could give it a 3.5 rating, but alas i am not allowed to (curse you yelp!). eleven city diner is a bit of a hidden gem in a well-known area. if it weren't for the large neon signs lighting up the outer window, you might even miss it. this restaurant is large and full of character. half the restaurant serves as a deli/candy shop, and the other a restaurant. the place is seemingly always packed with customers, which is surprising, considering the quality of their food. nonetheless, it may be as a result of their large portions.<br><br>when i was there, i ordered my own burger. on top i got bacon and avocado and a side of fries. my boyfriend got the eleven city diner's take on a monte cristo. my boyfriend is a monte cristo fanatic, and suffice to say he was disappointed. now i know that the jam isn't traditional, but it keeps the sandwich from being extremely dry, and was exactly what this is. it would have probably benefited from a dusting of powdered sugar, but hey, i can't really complain because they did make the traditional sandwich. it was just dry. as for my burger, well, that was extremely dry. i requested it to be medium but it was absolutely well-done. it was kind of bland as well. <br><br>i purchased their $9-all-you-can-drink frosted mug root beer. definitely not worth 9 dollars. if it was at a more reasonable price, then yeah, i would totally suggest it. there is also the option to switch to the blonde root beer, which is pretty good. i definitely suggest they lower their price considering that there is no way that it costs that much to produce. they also have a very strict no-sharing policy when it comes to their root beer, which i guess makes a lot of sense.<br><br>the service here, though, is fantastic. we had a wonderful, cheery server. she is definitely the ideal server! i wish i had gotten her name because she was lovely. she was very helpful with suggestions and provided us attentive service. she was quick to come to us when we sat down which is always nice.<br><br>overall, this place is a slightly-but-not-so-slightly hidden gem. its fun for a group of friends who are craving 24 hour breakfast food. their dessert, while i've never tried, looks fantastic. go at your own risk, but remember that this is a diner and does definitely have diner food!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/d90yLpSQ-p80Z2J-qYz_jg/348s.jpg", "caption": "atmosphere is pretty great in this restaurant."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RDsy7hMZABumVruQk_oD7Q/168s.jpg", "caption": "atmosphere is pretty great in this restaurant."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9s-ts4vOwcZo_9wsZ0rcXg/168s.jpg", "caption": "atmosphere is pretty great in this restaurant."}]}}, {"review": {"des": "Eleven City Diner is the classic old fashioned American diner. Their menu is so vast and portions are generous. Serving breakfast omelette, lox and bagel, melts, salad, sandwiches, burger, cakes and shakes - there is essentially something for everyone here. Our personal favorites are #43, Salami Valor and mint chocolate malt shake. These sandwiches are SOLID stacked with corned beef and salami, respectively. Love love love!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/R4dcfjsjCsThfBsfziV0UQ/348s.jpg", "caption": "Mint chocolate shake."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oKRRBAuShkqL35x8eom-fw/168s.jpg", "caption": "Lox and latke."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yuXn573uP9SfCf8rwNaaDw/168s.jpg", "caption": "The #43."}]}}, {"review": {"des": "I had the flu and wanted matzo ball soup and I heard theirs was tasty. I order 64 oz to go box of soup and to my surprise, it included one, yes that's 1, matzo ball. 64 oz of broth ($13) and one matzo ball?!  I was disappointed that no one even said anything when I ordered it. The soup was good but we definitely need more matzo balls when there's that much broth.", "pics": null}}, {"review": {"des": "Packed and trendy, Eleven City is a throwback to times gone by where candy cost a penny and fun music always played in the back. With a Jewish deli as you come in, the menu is NY-like. I had the BBQ Beef Brisket. It came with a dollop of slaw in top. It was a large, sloppy sandwich that was actually quite good. Served with a healthy portion of cheese fries, it was an artery clogging delight to put down.", "pics": null}}, {"review": {"des": "Eleven City Diner is such a cute place. I got a chance to visit Eleven City Diner with a friend. I absolutely love the inside decor and atmosphere! It's everything you imagined a diner would look like. It's jam packed with cute little posters and the cake on the counter will make you stop in your tracks.<br><br>The food is absolutely delicious! The portions are enormous and you're guaranteed take home a doggy bag. I ordered the mac-n-cheese because I cannot pass up ordering mac-n-cheese whenever I see it on the menu. The mac-n-cheese was delicious but the cake I ordered still makes my mouth water. <br><br>I ordered the double chocolate cake and it seriously was a full meal within itself. The cake was unbelievably moist. I would highly recommend visiting Eleven City Diner, even if it's just for the cake. I can't wait to visit again because I'll make sure I wear my stretchy pants!", "pics": null}}, {"review": {"des": "Delicious food, flavorful coffee and bloody marys, and awesome atmosphere and experience! Truly a great find...corned beef & pastrami hash topped with two eggs for me and the bad a$$ breakfast sandwich for my fella! Enjoyed every minute!", "pics": null}}, {"review": {"des": "Chicago really doesn't have enough classic delicatessens--and I'm so glad Eleven City is here! I had a great breakfast with an appealing deli spin!<br><br>-Even though it was crowded, I got seated right away at the counter.<br>-The space is large, airy and bright--with two story picture windows when you enter.<br>-My server was friendly and attentive.<br>-Scramble with pastrami and corned beef was delicious! And surprisingly not at all greasy! Breakfast potatoes were fantastic--I ordered them on the crispy side and they were perfect!<br>-I was able to get challah toast which was a nice treat.<br>-There are lots of fun touches you'll notice--liking Woody Allen stand up playing in the bathroom.<br>-They have a full bar as well which is an unexpected bonus!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/k2xxrkkiSA54CTLs6GOVsw/348s.jpg", "caption": "Challah toast!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/p_w8_-8Zx9Z_kv7AHdeFeg/168s.jpg", "caption": "Pastrami and corned beef scramble"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0Jj8J_4bH2Rg-rjt4_Rk6A/168s.jpg", "caption": "Inside"}]}}, {"review": {"des": "Amazing atmosphere, staff, and most importantly food! The magic mushroom burger is FANTASTIC for a vegan option.", "pics": null}}, {"review": {"des": "This rating is simply for their Mac and Cheese. It really didn't taste like anything :( However, the concept and location are great and the music was pleasant.", "pics": null}}, {"review": {"des": "Growing up in NY, eating Kosher deli, I have always been surprised that I could never find anything comparable in Chicago - despite many false leads. Craving matzo ball soup I searched the web, found Eleven City Diner, and tried the 1/2 sandwich + soup combo. The matzo ball soup hit the spot. Large, light and fluffy in a very nice broth. But it was the pastrami that blew me away. It was even better than my last trip to Katz's Deli. <br><br>This was a delivery order so I cannot comment on the atmosphere. And they unfortunately did not include the coleslaw and pickle which would have been nice.", "pics": null}}, {"review": {"des": "We arrived 30 minutes before closing time, and they were very cordial and prompt with us, just the same.  There's a lot for the eyes to see, visually.   I felt like I was transported in time....  Very cool.  Parking on Wabash or 11th was not too bad - street parking. <br><br>I ordered the tuna salad sandwich and it comes with a hard boiled egg.  You'll see from my photo that there is a LOT of it. I did take a bite out of it, though...  Couldn't resist.<br><br>I did, however, resist the desert section of the menu.  The cakes are very inviting and displayed ubuquitously, and let me not forget to mention that they have shakes....  Also very HUGE.  <br><br>There's something for everyone, here...", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/j8bVUPnD5R7wo-aQANP-ag/348s.jpg", "caption": "Tuna salad sandwich"}]}}, {"review": {"des": "I cannot believe I have not written a review for my beloved Eleven City Diner! <br><br>I LOVE THIS PLACE!!!! The only think I have missed about the suburbs were all the great jewish deli's.. well hello THIS IS THE BEST JEWISH DELI IN THE DOWNTOWN AREA ( and you have to listen to me because I'm jewish and know whats up). I love the service, the food, the drinks, the desserts everything is really good here! I've been here for breakfast, brunch, lunch and dinner ( and occasionally a delivery when I need my matzoh ball soup to come to me) . <br>My go-tos are:<br>Hopple Popple<br>Lox and Latke ( new school style with cream cheese) <br>Cobb Salad ( No bacon no cheese)<br>Caesar salad <br>Matzoh Ball soup <br><br>If I'm feeling lunch the salads are good and always fresh ( super big portions, i always usually get dressing on the side because I cannot finish the portion) and I typically pair it with grilled chicken ( always perfectly seasoned). <br><br>Lox and Latke are also my #1 choice of food when I go there ( unless I am not feeling breakfast). <br><br>LOVE LOVE LOVE THIS PLACE! I feel like home with all the diner and jewish memorabilia. And the rabbi over the bar is on point! love it!!", "pics": null}}, {"review": {"des": "Pastrami was solid! The only thing wrong with it is I wish there was a little more of it on my sandwich. The Knish was good but very different than what this New Yorker is used to. If I had room I would have loved to try the cakes they looked amazing.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2D5ElL-K7P8Ywe8uCVu0hg/348s.jpg", "caption": "I deserve this #evergeMCX #ModernCX #herohub"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DXZNaezF8lajQKbJGf1tuw/168s.jpg", "caption": "This is a diner! The end of the #ModernCX conference #evergeMCX Great week with @evergegroup"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0sNlczIV-B3eb5vBhL1HyA/168s.jpg", "caption": "#pastramitime end of the #ModernCX conference #evergeMCX Great week with @evergegroup"}]}}, {"review": {"des": "This is easily one of my favorite breakfast places. On the weekends there always seems to be a wait but it is well worth it.<br><br>I typically order an omelet but their Lox & Bagels is fantastic too. The portions are absolutely massive here but the food is delicious. If you have room for dessert try the Green River float or a slice of their carrot cake. <br><br>Their chicken soup with a matzo ball is also delicious and the best cure if you're not feeling well. <br><br>Love this place and will continue to come back.", "pics": null}}, {"review": {"des": "This place is great for breakfast! Came here with a party of 8 before a Bears game. The eggs are the lightest, fluffiest eggs I've ever had, and they were delicious. The portions are huge, so make sure you come hungry. Everyone had a large meal for about $12 per person. Nobody was disappointed!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Y7GZrxtmeL73elkVTw4A5w/348s.jpg", "caption": "Fluffiest eggs on the planet! A must try!"}]}}, {"review": {"des": "i personally have always had good experiences here from the wait staff to the food to the clientele (i've been about a dozen times). i think maybe the key is to go during less busy times, but i understand that that means it's pretty consistent. i really love the atmosphere and branding of it. i just enjoy the old candy bar counter and set up of the place. breakfast is good. love all of the options--from fun sodas to latkes to egg creams. love the impossible burger and pretty much any dessert, too. in my experience, they're family-friendly, too.", "pics": null}}, {"review": {"des": "Went to brunch. This place is pretty busy so expect it to be crowded. We were seated promptly and our food was delivered just as prompt. The challah (French toast to us regular folk) was excellent. The toasted coconut added a little something extra. I would recommend this place to anyone visiting Chicago. Expect it to be busy.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UxVNM8iAzSj34ETdRnmA2A/348s.jpg", "caption": "Basil scrambled and house potatoes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/04Vm9EhERilRS5GwMrfmFg/168s.jpg", "caption": "11 City French Toast Challah with bananas strawberries and toasted coconut"}]}}, {"review": {"des": "Came here on a Sunday. Some of the worst service I have ever experienced!! Clearly understaffed for the amount of patrons. Food was ok, it was the service that killed it! Look elsewhere for a good deli experience.", "pics": null}}, {"review": {"des": "We always end up at these cool restaurants when we planned as we go during our day! The brisket BBQ was amazing! And service is excellent!", "pics": null}}, {"review": {"des": "Huge shout out to Brad and his team for the outstanding lunches he provided for Team Gillispie 2018 today at the MS Walk. 50 sandwiches that were so large people couldn't finish them and cookies that were better then homemade all delivered at a price half of the other places we checked.", "pics": null}}]}