{"name": "en-hakkore-chicago-10", "reviews": [{"review": {"des": "Hidden gem, I accidentally wandered into this online and thought it looked interesting. <br><br>Those tacos are killer. I love paratha to begin with but in taco form it is surprisingly amazing. They put this spicy aioli on it that perfectly balances out the sweetness of the paratha. I had the tofu and the pork tacos and actually preferred the tofu one!", "pics": null}}, {"review": {"des": "Okay so I've heard amazing things and we were in the area and decided to stop by for dinner! We got a few pork and a few beef paratha tacos and overall thought it was very yummy! Definitely a must try if you live near by or if you're passing by the neighborhood.<br><br>The fact that these tacos aren't just on corn tortillas but rather delicious parathas makes a world of a difference. I preferred the beef one over the pork one as I'm not the biggest fan of ground pork and I felt like that taco was overly spicy to the point where you couldn't taste anything else. Don't get me wrong I love some kick in my food but this may have been just a tad too much! I don't know if I'd go out of my way from the burbs to just drive down for dinner but I would absolutely go again if I'm in the area.<br><br>If they opened one up in the burbs now that would be a different story and I would definitely come on by more often since prices are fair!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LBLgXN5w0ktEmlyR22aZ5A/348s.jpg", "caption": "Yummyyy"}]}}, {"review": {"des": "The best Bi Bim Bap I've had in the city so far. This place has fantastic Korean food and a fun casual atmosphere. Great for pickup.<br><br>The paratha tacos are amazing and HUGE, they definitely don't skimp on the meat. Fantastic sauces and friendly service.", "pics": null}}, {"review": {"des": "This was a refreshing twist in Korean food. Really fresh and delicious. Worth the trip and the wait.", "pics": null}}, {"review": {"des": "This is fusion done right! They make paratha tacos that are this smooth, silky, and buttery like taco that is also crispy. It has a soft crunch before it gives and the taco just melts in your mouth. <br><br>The spice level is great - it is hot, so beware of that! But it lets me enjoy my food really slowly and really take in the flavors of the pork. I also tried the beef and it is quite a competition for #1 between them. They are both so good. If and when I come back to Chicago, this will definitely be one of my first stops! Also for $4 a taco, this is such a great deal because it is so buttery and filling. I had a larger breakfast that day, and one taco was enough for me. As a meal by itself, two tacos would probably be best but I can see how one is adequate. The sauce and flavoring of the meat was to die for I really can't wait for the day I come back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pckCMPwEvcTA7zSujIF1lA/348s.jpg", "caption": "Spicy Pork Taco"}]}}, {"review": {"des": "This place is just amazing.  The paratha tacos are HUGE! Being of desi descent, I was expecting a caucasian version of paratha but these parathas are as good as you can find on Devon street.  And for such a low price, you get a lot of bang for your buck.  I've lived a few blocks down for a few years and always heard good things.  Finally decided to bite the bullet and try this over my standard small cheval run and man I'm glad I did.  <br><br>The bibimbap bowls were good too but I have to say the tacos are just better. Get. The. Tacos.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2xRdkCay2X_WTs8HzACHfQ/168s.jpg", "caption": "Bibimbap"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Wb2w70r_bFNPoeaxA0xpXg/168s.jpg", "caption": "Pork on top, beef on bottom"}]}}, {"review": {"des": "2 stars for fresh vegetables. That's about it. Sweet, bland food.  No Korean flavor.  The spicy pork was not spicy. The beef was pale and tasteless. The tacos taste like a dessert...so sugary. <br><br>Nice ambience in a gentrified neighborhood.", "pics": null}}, {"review": {"des": "This place is delicous! It's a little hidden gem that we were taken to by our family members who our local (would have never found this place without them). I ordered the Bibimbap and I was not disappointed, all the ingredients were super fresh and of course the meal looked so colorful so you know you're getting your nutrition worth :).<br><br>Only thing to note is seating inside is very limited so be prepared to wait a few minutes to sit or great for take out.", "pics": null}}, {"review": {"des": "I have lived in the city for over two years now and I sadly just am now getting around to try this place. I enjoy any type of fusion foods and they did not disappoint!<br><br>I started off with the pork dumplings and although tiny they packed an amazing taste and I couldn't stop munching on them! The bibimbap portion is freaking massive for an amazing price and the bulgolgi tastes amazing that was placed on top. I then proceeded to get two of the tacos on was beef and the other was pork, both were flavored amazingly and the aioli on top was delicious as well. They also have a cooler at the door that has some authentic korean beverages along with some other staples you're use to seeing. I will for sure start to make sure that I make my way over to this location more often.", "pics": null}}, {"review": {"des": "Yes! Yes yes yes yes yes!<br><br>The tacos - woooey! I like a good bibimbap and the bulgogi beef is to die for, so why not get it in a taco shell that is so fresh and lightly sweet with some heat of the spicy mayo on top. I want to say the 'tortilla' was my favorite part, but that's like choosing a favorite child... So you know what my favorite part is.<br><br>The dumplings were a perfect size for our  3 year old and we each got one, along with her sharing one with her little 1 year old brother who shared the bibimbap.<br><br>My wife said she thought the bibimbap is a salad, which I agree with. As much lettuce and greens and without the stone wear frying the rice, it very much is. But it is super great and fresh. We would both go for tacos next time though. Plan on a bit of heat from the spicy mayo - it was just right for me though.", "pics": null}}, {"review": {"des": "I love En Hakkore! I had had this place bookmarked for some time and finally decided to give it a try. First of all, love the cute interior! It's a small restaurant with limited seating. You order at the counter and pay then. The menu options are pretty limited. We got the beef and pork paratha tacos (each $4.25) and the pork bibimpap ($10.50) to share between 2 people. Those paratha tacos are AMAZING! I've never had paratha tacos, only tortilla ones. They do such a good job with the parathas - they're perfectly soft and warm and flaky, yum! The flavor of the meat and sauces is really good. These are not your typical small tacos. They're quite big and heavy and definitely worth the price. The bibimpap on the other hand is ok. Pretty much felt like I was eating a salad. There wasn't much meat in it and overall not all that flavorful. However despite the bibimpap being just ok, the paratha tacos made up for it which is why I'm still giving En Hakkore 5 stars. Definitely go here for the tacos!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2gn5441mWboPuvA7C9QRTA/168s.jpg", "caption": "Beef and pork paratha tacos"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KYulOzavB-huICanVn4qSw/168s.jpg", "caption": "Pork bibimbap"}]}}, {"review": {"des": "Great dine in experience. <br><br>- great customer service! I loved that as a new customer, the gentleman taking our order was very informative with the food & portions. He warned us on the taco portions along with the bowls. We had an apetite, so no food was wasted or taken home! lol<br>- I loved the decor! Very clean as well. <br>- They have available plastic utensils, a basket with napkins, a place to store dirty plates, & a water jar with ice & cups free. <br>- they have a cooler with healthier can drink options. <br>- the menu is small but all you really need.", "pics": null}}, {"review": {"des": "It looks cool, It feels cool, and It taste great. I had the spicy pork and beef taco. The pork is a touch too spicy but I'm not complaining others might and the full effect of the spice takes about 5 seconds to bloom. The Beef is great. Also their tortillas is unique it's, It's has more substance than your usual tortilla. Now I have previously stated Del Seoul has excellent tacos - they still do. What this place has is tons more atmosphere. Look at the pics Thanks to Nick G for leading to this place.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/A5b8ewnrUXOPoGEV_n7RRw/168s.jpg", "caption": "Pic is Pano shot"}]}}, {"review": {"des": "I love this place and dream of their sushi tacos often... It literally makes me happy.", "pics": null}}, {"review": {"des": "Tried spicy pork bibimbap and beef taco. Very delicious and big portion size. The taco wrap is so soft and delicious, sort of like a pastry sheet, which goes along very well together with the beef and sauce. The bibimbap was refreshing and delicious too! Just be careful with adding sauce to it since it could be a bit salty if you add too much. It was too much food for me and I could not finish it haha", "pics": null}}, {"review": {"des": "I was looking for a lunch spot in Bucktown, saw these great reviews, and decided to come. Really happy we did. We came here yesterday for lunch and were extremely pleased.<br>My boyfriend and I shared the beef tacos. Amazing. They are pretty big and the flavors were really good. 2 for $8- cant beat it. <br>We also had the beef rice bowls. Once we added that spicy red sauce, it was great. Not as spicy as I would have liked, but still yummy. A lot of times, when you mix these types of bowls, it all gets mushy and the flavors blend into one taste, but this bowl still held onto the individual flavors of the beef, picked onions, cabbage, and other ingredients. <br>It's pretty casual inside and it was busy even in 90 degree scorching weather. <br>The portions are huge, so come hungry, or share the tacos and one bowl, like we should have.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/b259xAzlkomQyQRHsGBcRw/168s.jpg", "caption": "Beef bowl"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/A-jFYT9odYkjl2qKCgDNhQ/168s.jpg", "caption": "Beef tacos"}]}}, {"review": {"des": "Weak weak bimimbap<br><br>Go to del Seoul On Clark street for something real <br><br>Light on pork and was a salad over rice", "pics": null}}, {"review": {"des": "I agree with most of the reviewers about this place.  The tacos are bomb!  I ordered the pork and veggie ones.  The pork definitely had a kick but so tasty.  One of my friends ordered the bibimap (sp?)  bowl, but wasn't crazy about it.  She said it was pretty bland except for the parts where she was able to mix the kimchi in.   <br><br>I also ordered the Yuzu tea - cold.  It was very good!  Citrusy and refreshing.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fxXYahxJGoNDqSXf5E3qrA/348s.jpg", "caption": "Pork (left) and Veggie (right) tacos"}]}}, {"review": {"des": "I love this place. Simple menu, great food and nice people. Everything on the menu is delicious.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fVMWuQS2FNyCAt8VeKi4RA/348s.jpg", "caption": "Sashimi Bap with black rice"}]}}, {"review": {"des": "Loved the vibes of this place. Ambience was very cool and hip with a modern decor mixed with a pastel afternoon tea kinda vibe. The place is a little small though and when I went on a Saturday there was a large group ahead so there were no seats. There is also a constant flow of ppl and line-- though seems like a lot of people were taking out. However, I think they make the food fairly quickly and the turn around is decently quick. <br><br>Jap Chae- 4.5/5 The portion was larger than expected for an appetizer and was seasoned flavorfully but not too salty. There was a good blend of beef, veggies with the noodles. <br>Korean KBBQ Bibimbap: 4.5/5 Had this with brown rice and though I would've liked a little more gojuchang in the bowl, it had more healthy and simple twist to the traditional bibimbap. Delicious! <br><br>Would definitely return to this place for a delicious, quick, and fairly priced meal.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XgljhjXoj1VjuHCAyzn0Rw/348s.jpg", "caption": "Korean BBQ bibimbap with chap chae!"}]}}, {"review": {"des": "Best Korean in Chicago, hands down! I get their sashimi bibimbap. Order at the counter, then sit. Good service and prices. Go by yourself or with a friend.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BYoDQmOy_mKGgzmbdcS8aA/348s.jpg", "caption": "Sashimi bibimbap"}]}}, {"review": {"des": "We visited En Hakkore for an early dinner recently. Blown away by the food and cordial staff. I rarely give 5*, but they really do what they do exceptionally well.<br><br>Started with dumplings. Who doesn't love a good dumpling? And these were delicious. Iced yuzu tea was a refreshing complement to all dishes.<br><br>Moved on to tacos. Out of this world! Portions were ample, as others have noted. Both the beef and the pork tacos were so tasty, with terrific crunchy/tender texture. Beef was mildly spicy, pork medium+ spicy. Meat was tender. Paratha \"tortillas\" have a marvelous texture and wonderful toasty flavor. I was craving the tacos for breakfast the next day.<br><br>This is a fast casual place, so no sense going on about service, décor and ambiance other than to say food came out quickly enough, staff was pleasant & helpful, and it's a bright, cheery space with pleasant Korean accents. We'll definitely be back!", "pics": null}}, {"review": {"des": "If you are looking for a filling meal that feels lighter in your stomach, this is the place to go. The tacos are amazing, I was really impressed. They are filled with lots of flavors. I will warn that they can be quite filling so if you plant on getting another dish, share the tacos with a friend! I also got the sashimi-bap which was refreshing and delicious. <br>Would completely recommend and would go here again.", "pics": null}}, {"review": {"des": "I used to love this place but the owner is rude and argumentative. Not worth it when there are other great Korean tacos and BiBimBop in Chicago.", "pics": null}}, {"review": {"des": "Almost a year ago, I had a friend tell me this is a really great neighborhood spot. I thought, it's Bucktown...there are many great places so for some reason, I didn't take his advice, WOW was that a mistake. This place is a gem. <br><br>I met a few friends here and we told the guy at the counter we had never been there before. He had a big smile on his face and then he helped guide us through their menu. As we waited for our food, we were really excited about the ambiance. It has a really cool hip French vibe. <br><br>The food arrived quickly. The japchae was flavorful and delicious. My friend actually called me out on the noises I was making celebrating the deliciousness.  The bibimbap was massive in size and taste (bonus, its pretty healthy) but the tacos...whoa, amazing. I can't wait to go back....", "pics": null}}, {"review": {"des": "Love love love this place! I always leave full as heck and that's when I know I got my money's worth. Portion wise is perfect. It's like they know the perfect amount of rice, veggie and protein to put into it. It's nice how they put everything in the bowl in sections and if it's something you don't want, you can easily remove it then mix. Unlike some dishes when they put too much onions you literally have to pick it out piece by piece but here, it's already in sections so you just take that lump out and bam you're good to go. <br><br>The protein portion in the taco is more than fair. They give you more than enough that is needed. Sometimes I take some of that protein and add it into my bowl too which is super awesome! The taco shell that they use is so good; chewy and soft. I can just eat the shell on it's own. It's freaking amazing. I really love this place and now I live so much closer to it omg!", "pics": null}}, {"review": {"des": "Really yummy, fresh, and fast place to grab lunch. The bibimbob is delicious and comes with 16 (!) different kinds of veggies. They have white rice, brown rice, and black rice - which was unique and delicious. It's a generous portion but because there are so many veggies, it doesn't leave you feeling over full or sluggish.<br><br>The tacos also looked delicious and large.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Qb2FTwUXnAz2eJFClRmLXg/348s.jpg", "caption": "Bimbimbop with BBQ beef"}]}}, {"review": {"des": "Where do I start.... my husband and I seen this resturant on Check Please. It's been 2 weeks and I am having dreams about how amazing the food is! We had just about everything off the menu bc I have to try it all when we go to a new place and seriously you can not go wrong with any food you order from here.", "pics": null}}, {"review": {"des": "Paratha tacos-amazing. I love this place- great service, simple menu and delicious. If you want to feel healthy go for the bibimbap- if you want deliciousness- the tacos are what you need to get. I prefer the beef as it is less greasy than the pork. The jap chae is also good, as are the dumplings. They're fast and the food is always on point.", "pics": null}}, {"review": {"des": "Tacos are HUGE. And hearty. And delicious. Especially the tortilla...I think it was made of rice cake flour...aka very chewy and soft and buttery.<br><br>Sashimi bap is yummy and fresh and of good size too. I loved the black rice option. <br><br>Awesome prices for a quick nice, tasty meal. Great quality too. Perfect for groups or just casually getting a bite yourself.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RZf_-edpsVspSKDHhYC1wQ/348s.jpg", "caption": "Sashimi bap"}]}}, {"review": {"des": "Great fresh tacos on amazing lightly buttered bread. They serve this kind of bread at Momofuku in New York. Come here for different type of taco that you won't find anywhere else.", "pics": null}}, {"review": {"des": "My goodness, this place does like 5 things. And they do them all exceptionally well.<br><br>Today I walked in on a whim and was blown away. The person at the counter ran through the menu with me and guided me in the right direction.<br><br>I had the Paratha tacos. One with bbq beef, and the other with spicy pork. These aren't your ordinary tacos. The parathas style flatbread holds up to the amount of piled high meat, kimchi, and more. The flat bread itself was light and flaky and added an amazing texture that traditional tortillas can't give.<br><br>They also have that prickly pear and orange San Pellegrino which is my favorite.<br><br>Also found its family run with truly passionate individuals. Bravo guys way to kill it in every way at En Hakkore.", "pics": null}}, {"review": {"des": "I NEED TO KNOW do Koreans enjoy the bibimbap here??? I thought it was ok and good for you, however I definitely did not expect a cold bibimbap and that's what I got. More so of a salad than a bibimbap. I definitely missed that fried egg with the runny yolk that runs into the warm rice and meat and the nice contrast of temperatures from the cold crunchy veggies. The hard boiled egg just got lost in the bibimbop SALAD which is what I think it should be called... generally speaking, the veggies were seasoned in a way that made it hard for them to stand out. This could likely be intentional. I did taste the kimchi but I needed more sesame oil taste in the other veggies and more of a pickle taste. <br><br>It's good, but definitely not what I expected. Sorry I feel like a hater. I have been spending all week looking for where I can get bibimbap since that one just left me craving the real deal.", "pics": null}}, {"review": {"des": "I came here when it was Tacofest in Lakeview. The reason? I wanted Asian food (I always want Asian) and the other party wanted tacos. Tacofest itself was rather busy so we started to explore other options and came across this amazing fusion -- Korean and Tacos.  It was perfect. I ordered the bibimbap - and it was absolutely delicious and fresh. The tacos we ordered were absolutely meals onto themselves and had such great flavoring to them.<br><br>Definitely a place to visit again when I feel like heading over to Bucktown.", "pics": null}}, {"review": {"des": "I absolutely love En Hakkore. I generally get the two tacos when I go -- Of them are good: tofu, veggie, pork, beef. I'm not a fan of corn tortillas and the tortillas here are flour which are a great fit for the Korean flavors. If it's been a while since I've been there I start to crave them. I know others who love the bibimbap. Staff is super friendly and on the whole the atmosphere is good. Sometimes the music can get a little bit loud. I wish they used compostable Takeaway containers.", "pics": null}}, {"review": {"des": "Fast casual korean or Korean inspired place. Order at the counter, grab a seat, wait for the food to arrive at your table. We only tries the bibimbop with beef. Filled with many kinds of vegetables...i wish the egg was fried not boiled. Overall it was okay....hubby said it was too healthy. He prefers the the 2nd location more. You can low carb it if you opt out of rice.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jeKJf0zzYlL-fYiNHvMt9w/348s.jpg", "caption": "Bibimbop with beef"}]}}, {"review": {"des": "I'm so late reviewing En Hakkore. The service is always great, food always fresh, and they're always smiling. I love the paratha beef tacos! The combination of sweetness and spice is perfection!<br>Brought my mom here for dinner on Thursday night and she raved abt the food. She also complimented the guys on their great attentiveness and service. See y'all soon!", "pics": null}}, {"review": {"des": "The Paratha Tacos are amazing and quite possibly what I would request as my last meal before I die. The Bibimbap bowl is equally good too.", "pics": null}}, {"review": {"des": "I came here to eat and halfway through my meal I remembered that I don't really like bibimbap. Knowing that, I will try to give an unbiased review! The tacos are definitely worth. We got the spicy pork. The taco shells are made out of roti-like flatbread, and they taste very good! The meat was also very good.<br><br>To be honest, bibimbap all tastes the same to me because it's a bunch of vegetables and I hate vegetables. This beef bibimbap did have a great variety of vegetables. I wish there could have been more meat and rice, but you can't have everything I guess!!! In an alternate universe where I am a bibimbap fan, I could see myself enjoying this dish.<br><br>The store was neat and clean. It wasn't too crowded when I went on a Thursday evening. The service was pretty fast, too. I think this is a relatively cheaper food option near Wicker Park.", "pics": null}}, {"review": {"des": "A nice small dining spot, we enjoyed the food, efficiency and decorating. Let's start with the amazing efficiency, it was a busy period on a Saturday night. The guy at the counter was taking orders, answering the phone and delivering meals without a hitch. With a smile on his face, the cook kept those wonderful meals flowing through the window. Oh, how I love a kitchen window that is in plain site. I usually struggle when ordering at a place like this, but with the short list of menu items and the wonderful help of the guy behind the counter, I felt I did pretty well. Our appetizer and meals arrived within minutes, very impressive service. The Man Doo \"steamed pork dumplings\" were very good, put some of the reddish sauce on these, nice starters. The Bibim-Bap Bowl was a wonder to look at as well as eat, I really enjoyed my Spicy Pork selection, this entree amounted to a whole lot to eat, great value. I sampled the Spicy Pork Taco, same wonderful Spicy Pork but the bread that is used instead of a taco shell demands a special note, something about this bread makes what would have already been a pretty decent taco all that much better. I've got to order one of the tacos on my next visit, actually you get two and they are quite large. Another refreshing discovery was the Yuzu Tea (Japanese Citrus), a very, very sweet hot drink, a real pleasure. Nice value, very good food, check this place out.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jwmKmIlYd-Q5plyxsjyyfg/348s.jpg", "caption": "En Hakkore, (two K's)."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PTJZsAesgqVyKaXeowBQEg/168s.jpg", "caption": "Spicy Pork Bibim-Bap!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BP67itgGNHlNee30h8n01w/168s.jpg", "caption": "Tacos."}]}}, {"review": {"des": "Korean style meat on paratha bread?!?!?! Heaven. I have dined in and carried out before and food is always great. <br><br>So far, I have tried the tacos and the bowls. Portions are generous.", "pics": null}}, {"review": {"des": "Wow! En Hakkore definitely has the best pork tacos I have every had! I know, very surprising because they are cheap and it's not a \"fine dining\" type of restaurant. A group of us stopped here for a snack before going to an escape game down the street. My fiance and I both ordered the pork tacos (we regret that one of us did not order the beef tacos), which was a mistake (in the most awesomeness way!). The tacos are huge!!! Seriously, they are a meal. We should have split the ordered, but my fiance was happy to down three tacos lol I love the soft taco they use and the service was great. The pork tacos are spicy, so expect that when you order them. I heard the beef tacos are not as spicy. When I go back to Chicago, we will definitely be visiting En Hakkore again!", "pics": null}}, {"review": {"des": "This is probably my favorite bibimbap/taco joint in town. Flavors are just perfect and not too overwhelming. Service was top notch when I visited despite being extremely busy.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5LMPIu2EyJThalqxPMS6CA/168s.jpg", "caption": "Paratha Tacos"}]}}, {"review": {"des": "I love the concept of this place...(Sushi Burrito) If you're a sushi lover then you can't wrong. Please note, parking is insane would strongly recommend a Uber. The music was swanky was feeling the \"Hip Hop\" vibe.", "pics": null}}, {"review": {"des": "Some of the best Korean tacos I've had in all of the U.S. each piece of ingredient they use is superb. The bread they use is amazing. It's Paratha. The sauce they use is amazing. They even have genuine Korean drinks that go well with the meal. The price is great as well. Very affordable. And theyr friendly! Def recommend people to come here for an amazing meal!", "pics": null}}, {"review": {"des": "En Hakkore is a cute little eatery that offers Korean and fusion dishes.  It is a place where you order up front and then you seat yourself and wait for your food to be brought to you.<br><br>Since it was our first time there, I decided to ask the guy at the counter for recommendations.  He laughed and said in a cocky tone, \"Everyone loves all of our dishes.  I mean, everyone orders everything.  The menu is pretty small.\"  Okay, that was no help.  After hovering around the counter looking at the menu for a bit, it seemed like he was getting impatient with my party even though there were no customers in line behind us.  He said loudly, \"Look, you gotta help me out here.  Do you like sweet?  Spicy?  Savory?\"  Okay, Asian guy, now we're getting somewhere.  After that, I ordered the Spicy Pork Bibimbap ($9.50), while my party ordered the B.B.Q. Bibimbap ($9.50), Man Doo ($5.00), and the Paratha Taco Combo ($7.50).<br><br>There are canned drinks to the left of the counter in a fridge in case you want to try out new Asian drinks.  You can even purchase bottled waters or just get free water from the water dispenser which is all self serve.<br><br>Let me just warn everyone that the bowls of the Bibimbap are humongous!  They are bigger than Pho bowls!  It is large enough to share with at least 2-4 people.  If you are not super hungry, order just one and share.  We were not aware of how large the bowls were until we saw them being delivered to the other customers inside the restaurant.  By that time, it was too late.<br><br>When our food started coming out, I noticed that all of the food looked amazing and delicious.  However, the older Asian lady who was bringing us the food had somewhat of an attitude.  She was handing the Spicy Pork Bibimbap to another person in my party when I was the one who had ordered it.  We thought she didn't hear us the first time so we repeated again that I had ordered that as in hint hint...  bring the bowl to me and not to the other person in my party who was all the way across the table and did not order the Spicy Pork Bibimbap.  She kind of huffed and puffed and I saw her give this annoying sigh like just take the damn bowl already!  I didn't appreciate the attitude, but then again maybe she doesn't understand English?!<br><br>Besides the iffy service, the food was super fresh and delicious!  Everyone seemed to enjoy what they ordered.<br><br>The Spicy Pork Bibimbap was really good.  The pork had a lot of favor and it wasn't too spicy so don't be afraid of ordering this dish.  I kind of wished I had more pork to match the huge portion of rice and veggies though.  The bowl comes with 6 kinds of vegetables and rice.<br><br>The Korean B.B.Q. Bibimbap was just as delicious.  I really liked the marinade that was used on the meat.  It reminded me of the marinade that I make at home.  This bowl came with 6 vegetables and rice as well.  If you're more of a sweet person then go with the Korean B.B.Q. bibimbap.<br><br>The Paratha taco deal comes with two tacos where you can either choose spicy pork or B.B.Q. Beef.  The tacos come with fillings such as kimchi, veggie mix, cilantro, lettuce, cabbage, En Hakkore sauce (spicy mayo).  These tacos were delicious and it kind of made me regret getting the bibimbap.  The tacos were flavorful, just the right amount, and very filling.<br><br>The Man doo (steamed pork dumpling) came with a seasoning sauce and it was okay.  I wasn't really impressed with them and they weren't bad.  They were just okay. <br><br>En Hakkore is located in a nice neighborhood, the eatery is decorated really cute, the food is good and affordable, but the service was not the greatest I've experienced.  If I come back, it would be due to the food.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qmKB2o3oT2xmTtp_b_CFMQ/348s.jpg", "caption": "The spicy pork bibimbap."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/18-os0a31Wd2YD7K0ZnD4w/168s.jpg", "caption": "Paratha tacos."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/euAHNZM4XCQrs-4goCV4dQ/168s.jpg", "caption": "Man doo (steamed dumplings)."}]}}, {"review": {"des": "Ordered delivery Friday evening and it delivered about ten minutes earlier than the given estimate, which is always a plus.<br><br>Unaware of the portion sizes, I got four orders of the pork/beef tacos and an order of the mandoo and jap chae. The jap chae was solid and the dumplings were enjoyable. I wouldn't necessarily call them mandoo as they were tiny with a thin noodle wrapper, more comparable to a wonton, but nonetheless, they were satisfying.<br><br>Each taco was very filling, in size and abundance of meat. Two per person definitely is satisfying enough...maybe three if I want to push it...and for $7.50 for a pair, what a great value. Needless to say, we had leftovers. For the taste, they were good. My boo especially loved it. I think I'm more of a traditional taco type of person, but these were made well and I enjoyed the use of the paratha as the shell. I enjoyed both the bbq beef and spicy pork about the same.<br><br>Overall, a very satisfying meal all around!", "pics": null}}, {"review": {"des": "Food was okay but the customer service was TERRIBLE. The worst I've ever experienced. I'm surprised that no one has reviewed this before. The guy at the counter was rude to everyone in our group of 5 people. We reluctantly asked to use the bathroom (the sign said please ask to use the restroom) and he told us to wait. We stood there for 3 minutes while he worked and he finally turned to us and said \"Bathroom is down the hall to the left.\" So why did I have to wait to hear that? What a weirdo. If I hadn't been with people who already ordered food I would have left.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lBoUPSRDc7XBfN0_TR5SEg/348s.jpg", "caption": "Veg bowl"}]}}, {"review": {"des": "Love this place! Great food, staff and most importantly kimchi. Large portions for a reasonable price and a sashimi option. DO IT!", "pics": null}}, {"review": {"des": "My neighbor told me about this place.  Taco with Korean bbq...OMG!  So good!!!", "pics": null}}, {"review": {"des": "Keep it mind, they literally only have a handful of items, so don't think it's some full blown Korean menued establishment.  With that said. We ordered the mandoo (dumplings), chop chae (yum), tofu bibimbap, and the tacos (1 pork and 1 beef).  First the chop chae tasted just like my mom's. Came out warm and delicious. I didn't try the dumpling for fear it had pork in it. I had the bibimbap, which was just ok. Not enough rice and too much veggies, wish they left the lettuce out (which is not traditionally added). I didn't like it and tasted like it was a filler ingredient.  The tacos were the highlight. I didn't try the pork, but the bf said that was much tastier than the beef. I tried the beef and they used bulgogi which is a Korean marinated beef, very tasty.  It had some type of almost spicy sauce on which gave it a nice kick.  The winning factor for me on the tacos was what they used.  It wasn't tortilla it was more of a grilled flat bread.  If you've ever been to flattop grill, you know what I mean.  It's the blue stick flat bread that comes with it and it's freaking delicious. This made the taco a but different than others I've had.  Also, they're big, comes with 2 of your choice of protein and it's more than enough food.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GL_geEsA9IuubDKF8_3dyQ/348s.jpg", "caption": "Spicy pork and beef taco"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vWSs4_IfD9TD9Id6IRxWfQ/168s.jpg", "caption": "Tofu bibimbap"}]}}, {"review": {"des": "I was in Chicago with friends (we flew in from San Francisco, LA & Sacramento) and found En Hakkore whiling exploring Bucktown. From the moment we walked into this cozy, quaint joint unassumingly located between residential area, we were full of !'s. The interior is somewhere between French country kitchen and English tea shop, their name is in Hebrew and they serve fusion Korean cuisine!  Even for a San Franciscan, that is impressively innovative.  <br><br>We ordered the tacos, beef and spicy pork, and they were super yummy and generous in portion. Beef tacos were deliciously sweet complimented by the spicy topping sauce. Spicy pork, whoa, has a kick (and I'm used to spicy) and will have your mouth on little fire but worth it!  We were peaking at Bibimbop but were too full to try...... but the presentation was fabulous and it was the most popular dish. <br><br>We spoke with the owner who created all the recipes and she said she asked her sons to help (who had their own culinary professions in San Diego) when the restaurant launched. I love such family business stories, older and new generations coming together to create something unique and special.  While I was there, a local TV crew came to spotlight En Hakkore. I so wish I can bring them to San Francisco to open in my neighborhood - so glad I had the experience and a must try", "pics": null}}, {"review": {"des": "When I first came here, I really didn't know what to expect. I guess those are the best restaurants, especially when the food is AMAZING! I had the beef tacos and shared a bowl with my friend and WOW. The portions are huge, which is great for sharing or for a second meal, the meat was really juicy, and the sauces add a unique flavor. <br>I can't wait to visit again. The only downside is the dining area is rather small so if you come here with a large group, it's not going to be comfortable. Also, make sure you check the menu beforehand, there are two locations that offer different things and they're pretty close to one another.", "pics": null}}, {"review": {"des": "My wife and I visited En Hakkore on a Thursday evening to have dinner with a couple and their four year old son. It was our first visit and we each ordered 2 Paratho tacos (kimchi, onion, mushroom, cilantro, lettuce, pickled radish, enhakkore sauce, spicy pork or korean b.b.q beef). For $7.50 you get two generous sized tacos, much larger than Del Seoul (which is another favorite of ours). <br><br>Between the beef and pork, the pork was our favorite and had a great spice to it even before adding the red pepper paste sauce. Our friends ordered the Bibimbap but this Yelper was fortunate to marry a lovely woman who can create some amazing Korean dishes including Bibimbap ($12) and Japchae noodles ($5 for a tiny, tiny, tiny bowl). Therefore, I can't bring myself to order/pay for traditional Korean dishes anymore. However from all the reviews and the first person witness of the dish, both the Bibimbap and Japcae looked authentic and was very large portions. <br><br>I don't give 5 stars often but I was really surprised how much I enjoyed the flavors at En Hakkore. I thought the tacos would come in a regular flour tortilla like it does at Del Seoul but instead it arrived in a DELICIOUS naan style bread which was really, really good.  After dinner we walked next door to Miko's Italian Shaved Ice which is becoming my favorite place for shaved ice. The Damen entrance to the 606 trail is seconds away from En Hakkore so if you want to do a nice stroll/run before or after dinner, you can't ask for a better location. <br><br>I will be back again but not on Sunday's because they are closed.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/b0mFsyYu6bzEBc32LnYO2Q/348s.jpg", "caption": "Back!!! Been too long. Yummy pork tacos."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_116leoB8bNgISjVZz316A/168s.jpg", "caption": "BBQ beef taco. Really good!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LAHTdlVWbX74sIznwc8XJA/168s.jpg", "caption": "Spicy pork taco. Delicious!!!"}]}}, {"review": {"des": "Excellent Korean tacos and nice service! <br>They have meat and tofu options. Looking forward to trying their bowls.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/v3ACCaJ5HR0EZjdAIE_mjA/168s.jpg", "caption": "Korean tacos"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rCqA96GUd6ODQWJUBmkaIw/168s.jpg", "caption": "Korean tacos"}]}}, {"review": {"des": "I could eat the tacos and dumplings every single day. The flavors were outstanding. And actually pretty big portions for the price. The sashimi bowl was good but didn't stand out compared to other two items. Ive lived in bucktown for 2+ years...not sure how I've never been until now. But I can't wait to come back!!!", "pics": null}}, {"review": {"des": "Had the beef and spicy pork paratha tacos & spicy pork bibimbap. So good! Will have to come back for the sashimi bibimbap.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GOWe7wFkXLtX9KcGvcVLFQ/348s.jpg", "caption": "Beef and spicy pork paratha tacos & spicy pork bibimbap."}]}}, {"review": {"des": "Great place with a new fresh contemporary Korean twist that everyone should try. Next to the 606 and a bunch of other places to see. One of the freshest and tastiest food I've had in a very long time. Bimbop Bow and tacos is a must have.", "pics": null}}, {"review": {"des": "If you live in Wicker Park/Bucktown and you haven't been here, then you are doing something wrong!  I get one beef taco and one pork taco.  If you're taking it to go, make sure you get all the sauces on the side because you'll want them.  The portion sizes are large, you won't leave hungry.  It's the perfect causal week night dinner spot!", "pics": null}}, {"review": {"des": "I LOVED everything about En Hakkore!!! <br><br>Great service! Great ambiance! And great food!!! My husband and I had been wanting to try En Hakkore for a long time...and the wait was sure worth it! :) <br><br>I love that the menu has a good amount of options, but isn't overwhelming! My husband and I ordered:<br><br>- man doo - steamed dumplings. These were really good! You can't really go wrong w/ these!<br><br>Jap Chae - this is a combination of noodles, veggies, and meat. This was VERY tasty!!!<br><br>Paratha tacos - WOW...definitely coming back for these!!! You get two in an order and can pick between beef, spicy pork, or tofu. I had a pork and a beef and both were sooooo tasty! The flavors are wonderful and definitely a taste that I would crave and return for!<br><br>The parathas are large and I couldn't finish my two tacos. I guess it's also because we ordered two appetizers! I think the items are priced well! The ambiance is awesome! Such a cute place with great things on the wall as conversation pieces! <br><br>Parking is difficult in this area, but be patient because this place is worth it! I can't wait to go back!!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AawEASky0V2Pi2J44q2nSQ/348s.jpg", "caption": "Spicy pork and beef paratha tacos!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ubtf3ZZdDoJ3ivIcO0CKNw/168s.jpg", "caption": "Jap chae"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CK0tD13mS3ffXoG_n324HA/168s.jpg", "caption": "Man doo"}]}}, {"review": {"des": "Oh my gosh how have I not been here before? After years of passing by it on my daily commute to work, I accompanied Hubby for a rare lunch date here. Apparently he discovered this place years before and just kept it a secret. Now I see why. The service was so fast and friendly. The guy behind the counter has a perpetual smile on his face. We split an order of the dumplings (8 pieces/serving)...so good! I opted for the Paratha Taco with Korean BBQ Beef (2/order) while Hubby got the Bibim-Bap Bowl.  I loved the crispiness of the paratha enveloping the tasty beef covered with just the right amount of spicy mayo. The tacos were super sized and two were more than enough as an entree. The bowl was a vibrant collection of 16 different veggies and could easily feed 2 people, or one Hubby. Also enjoyed the unsweetened Argo tea and the alternative rock from the early 2000s playing in the background.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-CP1GqykTyH6HJC9_VZ_pg/348s.jpg", "caption": "Interior Decor"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZWlfeMlMiiAcsXUPuHedTg/168s.jpg", "caption": "Bibim-Bap"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NztRzb0o-6lN9hZFCNtroA/168s.jpg", "caption": "Paratha Tacos with Korean BBQ Beef"}]}}, {"review": {"des": "finally got to check out this place after seeing them on check please.  it's sooo good.  gotta try the mandoo dumplings - incredibly delicious, as well as the beef and pork tacos.  must go back soon!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ivRsTbR0lD83mbBFR4fcUA/348s.jpg", "caption": "mandoo - soo good!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SIGIKtm1yGDg5JBrZmrVXg/168s.jpg", "caption": "beef and pork bibimbop"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GT8VMRuwmN52jIkJyIqJeA/168s.jpg", "caption": "beef and pork tacos"}]}}, {"review": {"des": "Great food and Customer service! If you haven't tried it here, you should! The guy at the register is amazing. I felt really welcome and taken care of!", "pics": null}}, {"review": {"des": "The food was excellent and I would definitely rate them higher, except the service was terrible.  We came in with a large party, so we ordered a good amount of food.  Each person/couple ordered and paid separately.  Every time the server brought food over, he would announce the name of the food and then get annoyed when we tried to figure out whose food it was.  <br><br>First off, if you have numbers on the order, with a large party, it makes sense to utilize the numbers. My husband said the number on his receipt and the man ignored him and announce the food item again. <br><br>It is a shame because we are from out of state and our cousins were excited to take us there.  The food is really good but the service was highly disappointing!", "pics": null}}, {"review": {"des": "Nice decor. Amazing service! Food was excellent. When they say spicy, they mean it. But lots of flavor. Can't wait to come back and try more stuff.", "pics": null}}, {"review": {"des": "A cute Korean restaurant in wicker that does a limited selection of dishes really well! The decor is really cute with a selection of pastel plates and antique / wood pieces. <br><br>I typically order the beef bimbim bap which is loaded with fresh veggies and comes in a huge bowl when you dine in. You can also opt to have the bowl come with purple rice (so special!). Two other favorites are the paratha tacos (2) and the jap chae noodles. The tacos have the best pancake wrap on the outside - reminds me of the Chinese onion pancakes. Best served hot! <br><br>I've come to this restaurant for dine in and take out several times the past few months and their food is always consistently delicious. <br><br>Note They are not open on Sunday's - I've walked by a couple times only to be disappointed it was not open!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LPMmc0WPnoa0eum2gyU5Rg/168s.jpg", "caption": "Bim bim bap"}]}}, {"review": {"des": "Really enjoyed our lunch here - the vibe is cool and staff was very polite and helpful! We had the bulgogi Bibimbap - super healthy with lots of fresh veggies! I even put my sauce on all pretty to take a picture but unconciously took a bite - presentation is very pretty! Vibrant colors and big portions! <br><br>You know it's good when a Korean restaurant is owned by a Korean - try it out! <br><br>I wish they would give the option of extra sea same oil and a fried egg instead of boiled but other than that - no complaints here :)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aud7f6LqOeHZPeSk7wmj6A/168s.jpg", "caption": "Sorry I should've taken a pic before mixing"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cLfydiqZbz-1-lox24KtiA/168s.jpg", "caption": "Pork taco"}]}}, {"review": {"des": "I finally had the opportunity to try this place at the end of the school year. I knew the food would be amazing just by looking at all of the pictures that other people have posted. I can now say that the food lived up to my expectations.<br><br>My friends and I shared the black rice (!!!) sashimi bibimbap and the tofu paratha taco (a seasonal special). The bibimbap was served in a beautiful black bowl that helped accentuate all of the vivid colors of the vegetables and sashimi, making for a wonderful photo. Adding the black rice cost a bit extra, but I think it is definitely worth it since it was so delicious. Also, black rice is a healthy alternative to the traditional white sushi rice. A normal order of bibimbap would leave me feeling bloated and weighed down, but the sashimi bibimbap was so fresh and it left me feeling fantastic.<br><br>In addition, the paratha tacos were amazing! The chewy, buttery paratha shells were by far the best part. I thought the tofu filling was actually pretty tasty. I tried some of my friend's pork taco, but it was too oily for my taste. The tofu was just perfect!<br><br>I'm so glad that I stopped by this place for dinner. I will most definitely be back soon to probably eat the amazing sashimi bibimbap and paratha tacos again. A word of caution: the store is actually pretty small and seating is limited, so keep that in mind so you aren't surprised when you drop in to have an awesome meal.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Lz9egO_ayNISXF4gs1Yvgw/168s.jpg", "caption": "Paratha tacos w/tofu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YduFoZ5rvmT_FrH82cZWVQ/168s.jpg", "caption": "Sashimi bibimbap with black rice"}]}}, {"review": {"des": "I really wanted to like this place but it was a huge let down. I am very accustomed to rich Korean flavors and seasonings thanks to my mom's homemade cooking. Their bibimbap is definitely suited for a non-korean palette. I am into healthy food, but this was just too bland and tasted boring. Also if you're going to put tofu in bibimbap, DO SOMETHING WITH IT. They literally just tossed chopped up tofu with no marinating/seasonings. Unfortunate. If you want good bibimbap go to an authentic korean restaurant.", "pics": null}}, {"review": {"des": "If a restaurant is over the moon delicious or below the gutter horrific, the review is totally easy to write. When it falls somewhere in the middle, things get a bit tricky. I procrastinate in writing the review because there isn't anything outstanding to write on either side of the spectrum. Oh hi, hello, En Hakkore.<br><br>What I like most about En Hakkore is it's the most casual Korean food spot I've ever been to. I wouldn't feel weird if I went alone or just dipped in casually to order some bibimbap or sashimibap. And in those solo situations, I could see myself coming again. All of the ingredients at En Hakkore are fresh, portions are small (compared to other K-spots), prices are competitive (maybe even a buck or two cheaper), great service and very chill atmosphere.<br><br>Edumacation time - Bi Bim Bap is a traditional dish that is always a conglomerate of ingredients, mostly veggies, over rice. Bi Bim means 'mixed' in Korean and Bap means 'rice'. You can get bi bim bap sans meat so it's a great option for vegetarians, but normally there is meat (usually beef) and egg in it. It's served in a beautiful display of all the ingredients neatly divided into colorful sections...but before eating it you mix it up into a hot mess of food elements and usually mix in a bit of hot sauce.<br><br>I've had the bulgoki bi bim bap at En Hakkore and liked the dish but sadly it wasn't near the best Bi Bim Bap I've had. And sadly, the bulgoki marinate wasn't mouth watering. Bulgoki is one of my favorite foods...I grew up eating it and am a strange gal that prefers it to kalbi. In my book, this bulgoki didn't knock it out of the park. I did enjoy their interesting take on mandoo (steamed dumplings). These were by no means the traditional version of mandoo but the En Hakkore way is unique and tasty, I'd definitely get them again.<br><br>En Hakkore is near my 'hood so I can definitely see myself popping in again when I need my Korean fix on the go!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4Z9wi468Ol6CA3VQpvkLmw/348s.jpg", "caption": "Purty chandaliers"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GECpfJl8B2cs5fd3jJehHQ/168s.jpg", "caption": "Loved their interesting take on mandoo"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SRN2pjeJ58fqrGUpIKOWVg/168s.jpg", "caption": "En Hakkore"}]}}, {"review": {"des": "The pork paratha taco is too spicy for me. The beef is great. The dumplings are good.", "pics": null}}, {"review": {"des": "This is definitely our go to for Korean Tacos and Bibimbap. Very cute and cozy atmosphere and super quick and friendly service. <br><br>Their Jap Chae, bibimbap and Korean tacos never disappoint. I definitely recommend this place to any Korean Food lover.", "pics": null}}, {"review": {"des": "Whoa! This fast casual Korean spot ROCKS! Really simple menu with Jap chae appetizer and either tacos/bibimbap for mains. The tacos are some of the most delicious and interesting I've had - think a hunk of meat covered in sweet and spicy sauce over some greens, wrapped in a scallion pancake! 10/10!", "pics": null}}, {"review": {"des": "It's pretty easy to order here. Just channel your inner Hanson. <br>Bibimbap  ba duba dop<br>Ba Bibimbop, ba duba dop<br>Ba Bibimbop ba duba dop<br>Ba du, yeah<br><br>Ok...so those aren't exactly the lyrics to the song, but MMMMMMbop could easily be the soundtrack to those rice bowls since both make people pretty happy. It's a huge, relatively healthy meal for super cheap. They come with rice, veggies, a hard boiled egg, and your choice of KBBQ, pork, or sashimi. All super fresh, filling, and flexible on your checking account. <br><br>Small place with limited seating, but super nice people working behind the counter. Definitely worth a stop in. And play Hanson on the way out.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/y9sggAYYR7y1tAcO-mmbuA/348s.jpg", "caption": "Spicy pork taco"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_fM_WLmYKzQwLI1lmt9fvw/168s.jpg", "caption": "Beef taco"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/svEDXARBjn3kKJdtkJ3z4A/168s.jpg", "caption": "Sauce"}]}}, {"review": {"des": "I went here with a set of friends. There was a problem in parking, it was limited. I personally had the bimbimbap and the pork dumplings. The bibimbap had a lot of veggies but a little bit of meat, but everything was fresh and well presented. Still recommended.", "pics": null}}, {"review": {"des": "Not much to say that hasn't already been said. The paratha tacos are amazing. Definitely get one of each. The sauce on both were a little too spicy for me, I'd probably get the sauce on the side next time. The tacos themselves were extremely hearty and packed with flavor. Incredible bang for your buck. The steamed dumplings were also incredible and delicious. Interior is clean and cute, loved the decor. I would definitely go back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5fwucOkbxwdU_qJj4wQi-g/348s.jpg", "caption": "Paratha tacos"}]}}, {"review": {"des": "I absolutely love Mexican tacos so whenever someone tries to make a change to the \"standard\" recipe I'm usually disappointed. Not here! The Korean tacos were wonderful. The home made tortillas were outstanding and the different flavors melding together with each of the tacos was perfect (with all 3 that I tried). I also loved the ginger beer (spicy!) that I had with lunch. I need to go back and try the other items on the menu.", "pics": null}}, {"review": {"des": "I pick up a Korean bbq beef bibimbap bowl after almost every yoga class because it's on the way home!  Best post-workout meal!  Everyone there is always so nice too.", "pics": null}}, {"review": {"des": "Delicious, healthy twists on traditional Korean bibimbaps! I got the Korean BBQ Beef bibimbap and loved the fresh and flavored vegetables, and the juicy, sweet bulbogi beef was a delight to eat. Expect more vegetables than rice, it felt like I was eating a salad-rice bowl. But for around 10 bucks, this large bowl is definitely enough to satisfy a hungry appetite. Their tacos are pretty large in size, and use paratha bread instead of cornmeal shell, which give them a rich, buttery flavor. I just tasted a little bit of my friends' tacos so I couldn't say much more, but my friends said they were delicious. The owner/guy working at the store front is so friendly and polite, even though we stayed for an hour after we finished our food. Would totally come back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ju4xfsHaCkQvVx_ULmjzkA/348s.jpg", "caption": "Korean BBQ Beef Bibimbap"}]}}, {"review": {"des": "En Hakkore is in a quiet spot on Damen right off the 606 Trail, and this may just be what you need after a nice run or bike ride. There's not much to the menu besides bibimbap, tacos, and some appetizers and a special or two, but what is available is done extremely well.<br><br>Presentation, taste, quantity, quality of ingredients, interior decor, price, etc. all come together in a very simple, straightforward Korean fusion restaurant that crosses Korean fare with Japanese, Mexican, and Indian. I'm not a big fan of fusion, but when it's done right with proper thought and attention is paid to taste, this can be a great crossing of paths.<br><br>I highly suggest trying the sashimi bibimbap. It's a nice cross between a traditional Korean bibimbap and a Japanese chirashi bowl. It still has rice, but instead of beef, you get freshly cut sashimi (NOT FISHY) as the \"meat.\" The veggies are also finely cut and adds a nice mix of texture across all the ingredients in the bowl. The rice wasn't quite as sticky and cooked to what I eat all the time in my household, but it's not a big deal. Just a little quibble on an otherwise fantastic dish.<br><br>You must absolutely try the paratha tacos. At first I thought these were like the tacos at Del Seoul, but there's a little twist in using paratha bread (i.e., Indian flatbread) to hold all the toppings. Cool beans! Both the pork and beef options are tasty and do well with the paratha bread. $7 is a tad high for two tacos, but again, just a minor quibble on what was a rather fantastic meal.<br><br>En Hakkore is a must for anyone that can appreciate Korean fusion, but don't go expecting an endless menu of items to pick from. They do a few things here, but they do it right.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-4N7CxoAwJ9RYBlIdaa8MQ/168s.jpg", "caption": "Sashimi bibimbap"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-Rt0hGh_ybpErl2k2J7VMg/168s.jpg", "caption": "Paratha tacos - pork and beef"}]}}, {"review": {"des": "This place is an awesome modern Korean fusion stop for a quick lunch or dinner. The menu is small and focuses on bap style bowls over rice and veggies plus some other fun options like paratha tacos, dumplings, etc. <br><br>I wouldn't call this super authentic Korean but it's definitely a nice blended vibe of Korean cuisine and a modern western influence. I went with the sashimi bap which was every bit as delicious as all the other yelpers have raved. A fresh sashimi medley on top of your choice of rice (I went with black rice) and tons of salad fresh veggies. My friend went with the bulgogi beef bap which was similar and also excellent. Both servings were huge and you will easily leave full or with leftovers (or both). They gave us a delicious kimchi base style spicy sauce to douse our bowls with. Service is quick and friendly. Prices are very good for the quality and quantity you're getting. Location is right in the heart of Bucktown along the Damen strip. I will be back many times until I've tried everything on the menu. <br><br>My only complaint is that they serve a hard boiled egg with the bibimbap bowls. Half the fun of bibimbap is the runny yolk that you get to break and soak your rice in. I assume the hard boiled egg helps them keep costs down and service quick (you can make them ahead of time and they will keep for a few days) but come on. Give a girl some runny yolk!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6ZlGg_0e8PGm_W0gAur8AQ/348s.jpg", "caption": "Sashimi bap - so good and huge bowl. Look how big the bowl is compared to the iPhone 6 next to it!"}]}}, {"review": {"des": "Amazing fresh food! I love the sashimi bibimbap with the black \"forbidden\" rice. The fish is fresh, and the dish looks as beautiful as it is tasty. Special shoutout for the pork dumplings! Great place for vegetarians or vegans!!", "pics": null}}, {"review": {"des": "Damn this place has good food.  With only three items (this may be a slight exaggeration) on the menu from which to choose you really can't go wrong.<br><br>Spicy pork tacos are incredible.  It's the flatbread taco shell that totally kicks ass and adds that unique taste to the taco.  Love. The tacos come with a completely unnecessary side of special sauce that I did not try as the taco served was delicious and flavorful in its own right.<br><br>Spicy pork bibim-bap with 16 vegetables (also affectionately known as the Korean Bowl of Goodness...at least in my mind that's how I refer to it!)  - absolutely incredible- packed full of flavor with an added kick!<br><br>Stolen (borrowed?)Pro-tip: As a bibim-bap virgin I wasn't quite sure where to start.  I then recalled reading a fellow yelper's insightful review that included a statement like this: no silly, you don't eat each vegetable separately, you mix the entire bowl all together.  So I did just that (but not before trying each vegetable individually- haha)!<br><br>Ss'good.  Go get you some.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UiiljXdoS8QdpW5022lStA/348s.jpg", "caption": "Spicy pork - before the mixing occurred ;)"}]}}, {"review": {"des": "I came in for my sashimi bap craving. Note, they don't sell kimchi separately any more, but you can ask for it to be added to your dish. As I was enjoying my meal, a homeless man came in to get something to drink, he looked very rough and somewhat disoriented. The staff was very polite to him. I came up to the register offering to pay for his meal, but they told not to worry, because they have it covered. This warms my heart. En Hakkore rocks!", "pics": null}}, {"review": {"des": "Wish we could have this in DC! The Paratha Taco (beef and pork) was so on point and original! The flavors with the sweet and the spice was perfect! Definitely a hip spot to grab a bite :) It's not oily and the shell is delicious!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bd2DTR3UcHhcWIl7FWY6LA/348s.jpg", "caption": "Hip spot to chill"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fiJy39HB-o8msZ8TM6LVgg/168s.jpg", "caption": "Pork Mandoo (steamed dumpling)"}]}}, {"review": {"des": "These guys are the best.<br><br>En Hakkore is SO fresh, so exquisitely crafted, and so amazingly priced--definitely one of the best quick-eat Korean spots in town. This location is strictly Bibimbap and tacos. The sushi burritos are at their 2.0 location. But to me, the original is still the best.<br><br>The Bibimbap bowls are HUGE--hefty portions with 16 different kinds of vegetables, all fresh and so delicately cut, marinated, and placed. The meats are wondrously marinated. The sashimi-bap is a bowl of fresh fish and vegetables that is priced at only $12!!!! I'm not sure how they are offering such amazing prices for such wonderful, fresh, and high-quality food!<br><br>This is also a family-run business, and I just love their story. A friend of mine recently asked in Korean what \"En Hakkore\" means, and we were told that it's a biblical location where Sampson was refreshed by a well-spring from the ground, and they wanted their restaurant to be a source of refreshment and strength for their customers!! LOVE LOVE LOVE these guys.", "pics": null}}, {"review": {"des": "For the 1st time I tried Korean food. Though it is very bland in taste, I really love the concept of bibimbap. All different veggies with protein is served in one bowl. I tried Sashimibap yesterday. The bowl looks very colorful and of course it's very very healthy. They serve you with sweet and hot sauce by the side. Apparently there is no wait time. And it's priced reasonably.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uNkc7orQm3Ujc49WQAKokg/348s.jpg", "caption": "Sashimibap"}]}}, {"review": {"des": "Amazing no other words needed. vegetarian friendly. My favorite in the bibimbop with tofu. The tacos are also very good on Malaysian parathas", "pics": null}}, {"review": {"des": "WOW! This place is amazing. Although I really liked the Sashimi Bowl and pork taco, my standout favorites were the steamed dumplings and the steak tacos!!!", "pics": null}}, {"review": {"des": "I'm an absolute En Hakkore fan boy.  The space inside is small, and you have to remember they're closed on Sundays, but I still come here like 3x a month.<br><br>FOOD<br>Their bibimbap is FRESH with tons of different blanched and pickled vegetables, and their meats are awesome.  It comes in this insanely wide, black bowl that really shows off the amount of fresh vegetables they pile on, and it's just a handful of rice.  It's really great when I feel bad about carbs.<br>The paratha tacos are consistently on point.  Super fluffy, flavorful taco shell encasing intensely savory meats.  <br><br>VALUE<br>Absolutely unbeatable.", "pics": null}}, {"review": {"des": "Came here based on a friend's friend's recommendation and was not disappointed!<br><br>Food:<br>- Korean BBQ Bimbimbap with black rice: This comes in a ginormous bowl with no shortage of meat, boiled egg, carrot, cabbage, bean sprouts, mushrooms, etc. The option for the black rice (the woman said it had antioxidants) was great for one more dollar. It was so yummy and the plethora of food for ~$10 was great. <br><br>They have tacos that looked really good, but I didn't get to try it. If I'm ever back in the area again, I will definitely try it out. <br><br>Decor:<br>-The place is really cutely decorated with a chic chandelier and other such decorations.<br><br>Service:<br>-The woman at the cash register who I think is the owner was so sweet and gives great recommendations as well as brings the food out to you. Be sure to bus your own table!<br>-Lunchtime gets pretty busy actually with take out orders as well as people dining in.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0a9hX7tD--JVJNhQ1szvkg/348s.jpg", "caption": "Big bowl of bbq bimbimbap"}]}}, {"review": {"des": "What a fabulous find! I tried the fiery tuna poke.  Wow!  I was blown away. It was so fresh,fabulous sauces and combinations. I got mine with mixed greens but they had options to add sushi rice or black rice. Just the right amount of heat. My nose was running but I couldn't quit eating it. Saw others get sushi tacos and they looked amazing as well.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Q-85pANDwe8iH7cudije5Q/348s.jpg", "caption": "Tuna Poke Bowl with mixed greens"}]}}, {"review": {"des": "If you want Korean fusion tacos, there is nowhere better.  I usually get a combo (one beef, one pork) and it really hits the spot.  Other highlights on the menu include the japchae and the sashimi bibimbop, but really the thing to get here is the tacos.  <br><br>The staff is friendly and nice.", "pics": null}}, {"review": {"des": "On vacation from Fl and this was our first stop for lunch. So glad we did. I highly recommend for a fresh and satisfying meal with a great laid back atmosphere.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vV_kNOzns15MoHzrtTbHNQ/348s.jpg", "caption": "Very fresh and very satisfying!"}]}}, {"review": {"des": "The tacos here are so, so good. I went to another Asian fusion restaurant the day after I came here and had tacos there, and they couldn't compare at all. My friend kept saying that the food was so good - even after we had left En Hakkore. The service here is also very friendly - and even better, comes across as genuinely kind. Would definitely come back again.", "pics": null}}, {"review": {"des": "Back in Chicago visiting family and my mom and I popped in here for lunch. I was impressed. Food was outstanding. Prices were great. Service excellent. I like the small menu. Decor/ambiance not exactly my style but really like the feel of it. Highly recommend!!", "pics": null}}, {"review": {"des": "First time trying En Hakkore, I had previously been to En Hakkore 2.0 for a sushi burrito and kimchi fries and those were both pretty good, but this experience was much better and I loved the paratha tacos and the sashimi bap that I had! Will be back for sure", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/idRS-F3aTYHQeBP0wFdt5A/348s.jpg", "caption": "Sashimi bap bowl"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/S4teKgm1iPMhV8a3cYd4ew/168s.jpg", "caption": "Spicy pork paratha taco"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UuaGQ1E5bu16sKFgD1zfsQ/168s.jpg", "caption": "Korean BBQ beef paratha taco"}]}}, {"review": {"des": "One of my favorite Asian fusion places in Chicago! I'm absolutely obsessed with their Paratha Tacos. Both the bulgolgi and spicy pork are delicious, but if you can handle spicy food, I would handsdown recommend to get the latter. The juicy meat, crunchy veggies, and all-around strong flavor combos hit the spot. The paratha (an indian flatbread) serves as a flaky, chewy tortilla and holds in the filling well without getting soggy. They come out fast, too! I don't think I've waited more than 10 minutes ever for my food.  One order is two tacos, but they're large enough to be very satisfactory as a meal. Each time I've been in, the special has been a tofu taco to make this place vegetarian-friendly as well! Some of my party has tried their other menu items (japchae, sashimi bowl) and I've heard no complaints so all around a solid worth-several-visits establishment.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nRXMyZstVbMbOy04qBrw0g/168s.jpg", "caption": "Beef Bulgogi Tacos"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/t7ERM80l65n-dq3RmrkZGQ/168s.jpg", "caption": "Spicy Pork Tacos"}]}}, {"review": {"des": "Haven't been here in three years and still tastes like the last time I came for a visit!!! Consistent, high-quality food? Almost unheard of for a place at this price point (which I find crazy as the neighborhood has been shifting more towards the hoity toity since I left). Please support these guys! They do great work!", "pics": null}}, {"review": {"des": "Lots of places seem to be trying Korean bibimbap.  These seem fairly easy to do because it's just a variety of prepared veggies on top of rice with a choice of protein.  This place isn't one that does it well.  Some of the ingredients, such as the lettuce, don't mix well and overall the food was just bland.  <br><br>Maybe the tacos are better but the bowls are just average and not much to write home about.<br><br>I understand the second location does the bibimbap in a burrito, which sounds interesting.  I'd be willing to give it a shot.", "pics": null}}]}