{"name": "en-hakkore-2-0-chicago-15", "reviews": [{"review": {"des": "En Hakkore 2.0 is one of my go to places for takeout in Wicker Park. They have a decent amount of seating, but it seems like the majority of people do takeout orders. <br><br>My typical order is the Crunch Sushi Burrito (no cream cheese) and an order of the Bulgogi Fries. My partner likes the Sushi Tacos. It doesn't seem like you can really go wrong with an order from here. <br><br>I haven't been the the original En Hakkore, but this location is fantastic.", "pics": null}}, {"review": {"des": "Great spot for poke and sushi burritos! Only a couple of vegetarian options on the menu, but all solid choices. <br><br>Ordered the vegetarian sushi burrito and poke bowls and both were quite filling and perfect to share. The poke bowl is definitely sweet, so I would get the teriyaki sauce on the side next time to calibrate to my own tastes.<br><br>Unfortunately no wifi, so not a great spot to study/work and eat.", "pics": null}}, {"review": {"des": "Please make the Bugolgi Sizzling Pan dish a permanent menu item! It is a meatier, more flavorful version of the classic Korean bugolgi bowls at other restaurants - complete with fried egg and yummy sauteed onions, zucchini, carrots and cabbage. Don't take it away!<br><br>Oh, and their permanent menu items are great too. The shrimp tempura in the Crunch and Fire bowls is best shrimp tempura I've ever had. And their Kimchi+Bugolgi fries is out of this world.", "pics": null}}, {"review": {"des": "Hesitant to try the spicy tuna bowl. Always had the beef bulgogi side bowl. But it's delicious and just the right amount of spice to make a sniffle a little lol. Love all the \"sides\" too - edamame, dried onions, cucumber, guacamole, pickled daikon, and then black rice to top it off. Definitely give it a try, it's delicious!", "pics": null}}, {"review": {"des": "I got the fire and it was fire!!! Omg. So spicy. Each of our sushi burritos cost about 12 bucks each. Mine was super spicy. It was pretty tasty but I have a preference that the fish isn't drenched in sauce. I'd prefer to taste the fresh taste of fish. The fire has salmon, avocado, sauce, etc. <br><br>The bulgolgi fries are sooo bomb!!! They're pretty expensive tho. I think it was 8-12 bucks. It was crispy and delicious! <br><br>My fiance had his cream cheese, tempura, and salmon(?) It was sooo delicious! I don't generally like cream cheese rolls but this was warm and the cream cheese melted with the sauce. Super delicious!", "pics": null}}, {"review": {"des": "The vegetarian burrito is a MUST. The kimchi fries were also a great veggie option! <br>Would 10/10 recommend. Not too pricey either!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sWSGEzjsfVfP57yEJunb0g/348s.jpg", "caption": "Vegetarian sushi burrito!"}]}}, {"review": {"des": "i was pretty impressed with this place. We ordered take out. It did not take long to arrive. The tacos were fantastic! I got sauce on the side, and i feel that is a must it really takes the taco a set further. I got a veggie taco and a beef taco. Both were great! the paratha has a sweet taste to it, but it compliments the taco well. I would def come back and explore more of the menu!", "pics": null}}, {"review": {"des": "I ordered the soft shell crab burrito and it was so crunchy, with plenty of soft shell crab. Had jalapeños and cucumber inside, wife seaweed wrap and crunchy tempura flakes on the outside. Most delicious sushi burrito I've ever had.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JDGJnAYB6W8tx2x6r_yUNA/348s.jpg", "caption": "Soft shell crab burrito."}]}}, {"review": {"des": "Book marked this spot for our trip to Chicago and made it a must to come eat before we left. You walk in, sit wherever you'd like and just order at the counter whenever you're ready.<br><br>We got the crunch & fire sushirito, soft shell crab sushirito, bugolgi/kim chi fries, salmon taco and unagi taco. EVERYTHING was delicious and everything i imagined. They don't put much rice in the sushiritos which is definitely plus but don't let it fool you, it's still filling! I seen other tables order the poke bowls and they looked huge! The tacos were probably my favorite though because the taco shell wasn't too thick and could taste the freshness of the fish more. And can't forget the B&K fries!!!! So much flavor in one dish.<br><br>There's also a counter with cups, water, sauces and to-go boxes when you're ready !", "pics": null}}, {"review": {"des": "Found my new love for this place. Dined here once before but didn't have their poke bowls. Last time I had their bulgogi and thought it was just an okay restaurant. This time I had their Lava poke bowl and it was DEE-li-cious! OH, I meant SPICY! with a Korean kick. <br><br>Not only was the presentation really pretty, but it had a variety of ingredients on the poke. My favorite was of course the main protein, but the sweet potato was a nice touch to the dish! Compared to the price, the portion is pretty small. <br><br>Also loved a combo bulgogi & kimchi fries. Bulgogi was interesting because it's more peppery than typical and kimchi was literally like kimchi out of a jar (not like pan fried kimchi at some other places). The fries itself were very crispy as it had a crispy batter. Yummy! Overall, I had a great meal!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VReTQMahweznSa7GfirCNg/348s.jpg", "caption": "Drink options July 2018"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1R2qA33jDj8fJqujjpUhaQ/168s.jpg", "caption": "Menu July 2018"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NjIjyHQRaOm2crh2eQgNOQ/168s.jpg", "caption": "Menu July 2018"}]}}, {"review": {"des": "Ok, had to update this review to a 5 star. Been here every week, sometimes multiple times a week. We are obsessed with it. The food is awesome! The salmon wafu poke bowl was delish. I licked my bowl clean! The poke bowl had a great mix of ingredients with spicy mayo on top. The tacos though! Wow, sooooooo good. It looked like it was actually made of a seaweed shell with tempura batter. Amazing! I have now tried 100% of the tacos and love ALL of them. The flavors are perfectly chosen and mixed. <br><br>Finally tried the kimchi and bulgolgi fries too which are spot on! Crispy and tasty!", "pics": null}}, {"review": {"des": "I ordered the savory poke bowl with veggies. I gave that a thumbs up. There have good portions of tuna/salmon and veggies in the bowl.<br><br>The korean horchata was amazing! I had no idea what to expect when I had this drink. It wasn't too sweet at all.<br><br>The best part was the bulgogi fries. These are to die for. I could eat these everyday. They are that amazing!<br><br>Service was great and I really enjoyed it here", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/60po8M70m4aPUOgaCSQYgA/348s.jpg", "caption": "Savory bowl with veggies!"}]}}, {"review": {"des": "My taste buds went on a rollercoaster food JOY RIDE with the sushi burritos. I ordered the Vegetarian Sushi Burrito (sweet potato, tofu, carrots, cucumber, pickled radish, lettuce, avocado, spinach, jalapeño, sauce). Each bite was fresh, savory, creamy, crunchy, gooey, chewy with a bit of a kick. The food was colorful, appealing, and smelled delicious. I thoroughly enjoyed this food experience, even if it was only delivery this time. Bravo!", "pics": null}}, {"review": {"des": "WOW, I was super impressed during my first visit here! I've heard a lot of good things and I'm shocked it took me so long to finally try it out.<br><br>I ordered the \"spider man\" sushi taco, bulgogi fries, and Korean horchata. <br>The spider man sushi taco had a full soft shell crab atop the taco - definitely picture worthy. But beside it looking cool, it tasted great! It was crunchy and had some type of sauce, and then the taco shell was fried seaweed with rice. A really cool innovative take on sushi. The bulgogi fries are a must! The fries were extremely crunchy, which is exactly how I like them. There honestly was not one soggy fry - amazing. And the bulgogi on top was so tender. The Korean horchata looked like a lemonade, but tasted like a creamy horchata, I would recommend trying this too.<br><br>I can not wait to come back and try their sushi burritos, I'm sure it's just as good as the other menu items.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pWzoYCbp2bvTp4ViZNvpFA/348s.jpg", "caption": "bulgogi fries and spider man taco!"}]}}, {"review": {"des": "Was in the mood for poke so I stopped by here, but I found the food to be pretty meh. I got the savory bowl with white rice on the bottom, and the portion size was pretty good. The salmon and tuna were yummy, but I really didn't like the included toppings. Guacamole, sweet potato, and carrots seemed weird with the poke, but maybe that's just my personal preferences. I think next time I'll choose a place where I can customize my toppings.<br><br>Ambience wise, I think they play their music a tad too loudly, and the restaurant was pretty dark/dimly lit even though it was lunchtime and bright and sunny outside.<br><br>Also, there's another En Hakkore down the street that offers completely different food, so make sure you're going to the right one!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/keKZUi7ORcG5-CvhcqgzgQ/348s.jpg", "caption": "Savory poke"}]}}, {"review": {"des": "Birthplace of my first sushirrito ever. Delicious fast casual stop in the Wicker Park neighborhood of Chi-town. My friends and I instantly fell in love with the place. <br><br>Food thoughts:<br><br>Tempura shrimp sushirrito 5/5: HUGE. If you're hungry, you can definitely finish it. There was a plenty of each ingredient in the wrap (wasn't all rice) and the sauce made everything bind together nicely.<br><br>Kimchi waffle fries 5/5: Must order. They are so crispy here and the sour cream on top pairs well with the kimchi.<br><br>Scallion pancake 4.5/5: Also must try. Generous portion for the price and super shareable. I would get this again hands down next time I stop by. I didn't give it a full 5 because I wish it was hotter when it came out, but flavors were there.<br><br>Come try En Hakkore for yourself!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-Sfi0E8p-6niX994sbw1yA/168s.jpg", "caption": "Kimchi waffle fries and tempura shrimp sushi burrito. Get both!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ThCjDF3fH6T65yeot9jtIg/168s.jpg", "caption": "Pancake. Order this!"}]}}, {"review": {"des": "Before going here I have never had a sushi burrito before but they always look so mesmerizing all over social media. Since Chicago is basically the place where all the big food trends hit first in the mid-west this is the place to try out my first sushi burrito. It was so satisfying. Sometimes you pay for a fancy sushi roll but after one roll it doesn't truly fill you up. Well this thing fills you up fast I couldn't even finish the whole thing. It was delicious. I got one with shrimp tempura and tuna inside and that combination was just so good. The fish tasted fresh and not that weird taste you get from some sushi places.... <br><br>The restaurant is pretty casual. You order at the front then you get a number, sit and wait for your food to be brought out to you. The location was wicker park which is a great location for foodies and travelers. <br><br>From time to time I crave this sushi burrito! Can't wait to try it again someday!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tOgC_rZGYO04GYBinffQdQ/348s.jpg", "caption": "sushi burrito with shrimp tempura, tuna, cream cheese, and avocado!! YUM"}]}}, {"review": {"des": "En Hakkore 2.0 is my favorite poke spot in Chicago! Coming from California, it's difficult for me to find poke bowls in Chicago that are up to par but this place is an exception. <br><br>I've been here quite a few times and tried different items:<br><br>Kimchi and Beef Fries: REALLY addicting! The fries are perfectly seasoned. It used to be waffle fries when I first tried them, but recently it's been the regular fries. You can choose to put either kimchi and/or beef on top of the fries. It also comes with spicy mayo and green onions as garnish. They give you quite a bit of food for the price too - a great appetizer to share!<br><br>Savory/Salmon Wafu Poke Bowl: These two both have the same sauce/toppings, the only difference is that the Savory bowl has both tuna and salmon. The fish is marinated in sweet/soy glaze, perfect for those who can't eat too spicy. Compared to other poke spots in the area, they give a generous amount. The toppings are colorful, unique, and refreshing: beets, cucumbers, carrots, mashed sweet potatoes, guac, edamame, fried onions, spring mix,etc. For the base, they give you rice, either white or black. I like the black rice because it has more of a chew to it. The flavors of the bowl blend well together and you feel healthy eating it. I prefer the poke bowls because you get more toppings and it's easier to eat, but if you feel like trying out something new, the sushi burritos essentially have the same basic fillings!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Pr0oYDU7LVU7zA-93odWmA/348s.jpg", "caption": "Savory Poke Bowl with Tuna and Salmon"}]}}, {"review": {"des": "I've been dying to go to this place...alas, I could've died and missed it.<br><br>We actually ate in.  <br>The fries are good but not enough to go out of my way for them.  It would be the ONLY thing worth coming back for.<br>The sushi burrito was bland.  The fish and the fixings were mediocre.  I didn't love this at all.<br>The bowl was the same thing...flavorless <br>Tried to order the wings, but they said they don't have them anymore.<br><br>Personally, I like butterfly sushi better than here.  It was all soooo boring except for the fries.", "pics": null}}, {"review": {"des": "A great trendy,casual dining place for Asian fusion food. If you like rice I would recommend the burritos as it had more rice than the tacos. Both types had yummy fillings. <br><br>Recommendations:<br>Kimchi fries<br>Bulgogi fries<br>Crunch +fire burrito<br>Spiderman taco", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3xwZ8gWtwV6XHlaPJ8oX3g/348s.jpg", "caption": "Taco"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/24NdYVevc5o4sMbbWb6b0Q/168s.jpg", "caption": "Kimchi fries....they use uncooked kimchi FYI"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RQYtLIWsenk8fIhC4Dl1iA/168s.jpg", "caption": "Bulgogi fries"}]}}, {"review": {"des": "This was our first experience with sushi burritos, and I'm glad we finally broken down and tried them...especially at En Hakkore 2.0.<br><br>We got the Crunch+Fire - Shrimp tempura, spicy tuna, cream cheese, jalapeno, mashed sweet potato, flakes, cucumber, guacamole, lettuce, avocado, soy glazed sauce, and spicy mayo sauce.  We also got the Fire burrito and Bulgogi Fries  - Seasoned Fries with bulgogi, green onions, chili mayo, and onion maple cream sauce.<br><br>We loved both burritos - and while part of it did fall apart and is a little hard to eat, they were really flavorful and tasty.  The amount of rice does get a bit much, so next time, we might split a roll and a bowl.<br><br>The fries were outstanding!  Absolutely delicious and will be ordered again....and again.", "pics": null}}, {"review": {"des": "Although I've never checked out their original spot, I'm gonna assume that the 2.0 version is like any other upgrade- polished with new features but with some bugs that may need some working.<br><br>In this case, the idea of making a more glamorous poke restaurant coupled with the idea of sushi burritos makes it both a hit and miss. Somehow though, En Hakkore gets it more right than wrong, and I was very happy with the food we ended up trying.<br><br>How to order? You go up to the counter and order/pay, and then sit down with a number to await your food to be done.<br><br>My friends and I all ended up ordering individual poke bowls and some bomb Bulgolgi Fries as a side. My pick was the Savory Bowl ($12) which was a mix of tuna and salmon tossed in various veggie-friendly ingredients over a bed of white rice. Alternate options include strictly greens or brown rice as your carb. I enjoyed the crunch and taste of my bowl very much and thought that the fish turned out to be very fresh. Definitely mix  your bowl a bit more before you begin eating so that all the flavors can blend together.<br><br>The staff here were very friendly and patient with us as we wrapped up our meal towards the end of the night. En Hakkore 2.0 has definitely proven to be a solid choice for poke bowls in Wicker Park, and I'm sure that I will be back again soon.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BpaTeHNFA7UlgCp-EX4xeA/168s.jpg", "caption": "Bulgolgi Fries"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/r-p6ZsTJeOgB2InYl2Mwtw/168s.jpg", "caption": "Savory Bowl"}]}}, {"review": {"des": "Order first before being seated. <br><br>There's complimentary miso soup, nothing special, and full of msg.<br><br>I tried their taco, the eel one and the salmon one and they were so good! The taco shell is fried seaweed, my mind was kind of blown. Crispy, salty, soft white rice, and tang from the spicy mayo. I would recommend getting the tacos over the sushi burrito and poke bowls. However, they're a bit pricy in comparison since they're smaller and $6 each. <br><br>Poke bowls are really large! You get a lot in each order, choosing white/brown rice, or spring mix salad. You can choose a combination of both, too. I had the salmon, and my cousin had a spicy tuna one. I'd recommend sharing a bowl if you're trying other things on the menu. <br><br>We tried the bulgogi fries. Crispy fries (that extra crispy kind, you know the kind, the battered and fried fries), topped with a spicy mayo, bulgogi, green onions, and sesame seeds. Kind of reminded me of a nacho salad on waffle fries when I was in high school, but Asian version. I would recommend trying this out! <br><br>Definitely would come back to try the sushi burrito next and get more tacos!", "pics": null}}, {"review": {"des": "Best soft shell crab taco (Spider-Man) I've had to date period. Also had the Unagi (eel) and salmon Excellent!! The tacos themselves were fried seaweed- don't be afraid try it - you only live once . The place is fusion at its best. Did I mention they have the best soft shell crab tacos ever. The free water station is always a plus.", "pics": null}}, {"review": {"des": "Big fan of this place. Been ordering here via GrubHub for the past year and finally got to enjoy a meal inside. Personal favorites include the kimchi fries and anything with Ahi-tuna in it.... Mmm.... Just thinking about it makes me want to head there this evening for dinner. The menu is simple but they get it all right the first time.", "pics": null}}, {"review": {"des": "Found this place while checking out the Wicker Park area and I'm so glad I did! My boyfriend got the crunch sushi burrito (shrimp tempura, eel, cream cheese, sweet potato, cucumber, avocado, mayo, and eel sauce). It was his first time trying a sushi burrito and he loved it. I got the salmon wafu tacos and they blew my mind! The taco shell was made out of seaweed that had been fried into a taco shape. The salmon was so fresh and the other ingredients (crab, cucumber, rice, volcano sauce) combined just made the perfect flavorful, savory combination. Not to mention the taco was packed with lots of salmon! It reminded me of one of my favorite sushi restaurants in Manhattan. The bulgogi fries were super crispy and tasty as well! Will definitely be coming back to try the other options and will be sure to try one of the poke bowls next time!", "pics": null}}, {"review": {"des": "I stopped in this place simply because it looked so cute on the inside. I ended up getting a savory bowl and a fire sushi burrito. I was a little hesitant to get the burrito because they can lack a lot of flavor compared to a bowl. This burrito was AMAZING. The flavors were balanced and delicious. And the fish itself melted in your mouth. <br><br>The savory bowl was better than the burrito in my opinion because of everything that came with it. Every bite was absolutely delicious. Definitely made some \"yummy noises\" as I devoured my plate. <br><br>The service was also great; The woman working helped my extremely indecisive-self choose what to order. I totally recommend En Hakkore 2.0 for all your raw fish cravings. So, so good!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uXUUqGcGi6-xpezK7x7DtA/348s.jpg", "caption": "Savory poke bowl"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/G5KxypzYivo8FiMB6T-2aw/168s.jpg", "caption": "Fire sushi burrito"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eSEs5jFm5X0PNHgDs7VPQg/168s.jpg", "caption": "Fire sushi burrito"}]}}, {"review": {"des": "Amazing poke bowl and tacos. I highly recco. I haven't had the burritos- will try next time!", "pics": null}}, {"review": {"des": "I love Burritos and i love Sushi, so why wouldnt i jump on the chance to try  a SUSHI Burrito?<br><br>Now when it comes to fusion and food, it can go horribly wrong or spectacularly well. The good news is that En Hakkore knows what they're doing. My friend ordered the Spicy Tuna Taco and i had the Bibimbap Burrito. Both were very good but the Taco is a class apart. Such a wide variety of flavors AND you actually did get the best of both worlds. You could totally taste a spicy tuna roll but somehow it really gave the vibe of a taco.<br><br>The Burrito is more filling than it seems. Its basically a giant piece of sushi and that much rice can take its toll.<br><br>The Bulgogi fries are a must try!<br><br>Would love to see some innovative beverages but other than that its fusion done right.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZdnEzwCrXAx8BJVxPa_2iw/168s.jpg", "caption": "Bulgogi Fries!!"}]}}, {"review": {"des": "The kimchi fries are sooooooooo good! And I had the Spiderman Taco, which was amazing. I recommend the tacos over the burritos because it had a more interesting texture. I would absolutely come here again. Also, food came fast, not too expensive, and the decor is really nice.", "pics": null}}, {"review": {"des": "Terrific food. The friendly Chef in the back came out to serve us our food,literally minutes after ordering! The only reason I have 3 stars instead of 5 was that the (host/Gentleman at the register)needs a lesson or two in customer service.", "pics": null}}, {"review": {"des": "We ordered this to go which can be a hit or miss when ordering raw fish but this place hit the spot! The spicy tuna poke bowl was delicious and all the ingredients were fresh. It had a good balance of a mixed green salad along with rice which was nice.<br><br>The heat intensity was up there which complimented the fresh veggies. <br><br>We also tried the bulgogi fries were okay nothing outstanding.<br><br>Will definitely be ordering more poke bowls though!", "pics": null}}, {"review": {"des": "Having been to the original location so many times, I'm surprised that I have put off visiting En Hakkore 2.0 for so long. I ordered the Salmon Wafu poke bowl and was pleasantly surprised. Poke bowls have greatly increased in popularity recently and it seems like more and more restaurants are serving them. I've eaten a lot of poke bowls and I will say that the ones served here are very solid for the portion size as well as taste. I really like how there was a dollop of sweet potato that was included. I would recommend getting half black rice and half greens as the base. Another must-order from En Hakkore 2.0 is the bulgogi fries. The fries were wonderfully crispy on the outside and seasoned very well. The bulgogi slices on top were excellent as well.<br><br>The prices here are extremely reasonable for the quality of food that you get. I definitely will be revisiting many times in the future.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ioGtT__du33RNlU55a6N2g/348s.jpg", "caption": "Salmon Wafu poke bowl"}]}}, {"review": {"des": "I love poke bowl and have tried a lot at different restaurant, this is one of the best I had in Chicago. They give you the right amount of all the ingredients. The most important is, they use the right amount of sauce and the sauce tasted good, not too salty, not too sour like a lot of other places. It was perfectly done. The fish and salmon were fresh, the rice was perfectly cooked, not too hard or too soft. I will definitely go back and try other items on the menu and I highly recommend this place. Please keep up the good work En Hakkore 2.0. I really enjoyed my Savory Poke Bowl!", "pics": null}}, {"review": {"des": "Yes, I came here for the sushi tacos and sushirritos. Did I order those? Nope. Ran through the scenario in my head where I could get sashimi all over my face trying to bite into the taco or burrito, and decided to play it safe with a poke bowl. But hey, I got to try some of what my friends ordered and everything was DELISH!<br><br>Think hipster Asian fusion restaurant with the name of the restaurant lit in bulbs on the wall, dimmed lighting, younger crowd, in the middle of Wicker Park. Perfect for a casual outing and for groups, since you order first at the register.<br><br>Salmon Wafu Poke Bowl<br>\"Salmon marinade with yuzu soy, edamame, guacamole, sweet potato, cucumber, pickled radish and beets, carrots, sesame seed, onion flakes, lime, soy glazed sauce.\"<br><br>So much yes. Even though some of these ingredients I was initially skeptical about, like the guacamole, sweet potato, and pickled beets. I was pleasantly surprised. They added color, flavor, and textures to poke that I have never experienced before at other locations where you create-your-own poke bowl. Portion size was huge, and I mean food coma huge for a typical poke bowl price of $12. You can choose a base of white rice, brown rice, or black rice, in order of relative \"healthiness\" according to the cashier. One of the great parts of usual poke-only places is that you can adjust the amount of sauce you like, but sometimes you just have to take a chance and let someone work their magic.<br><br>Bulgogi Fries<br>After trying these, there's no way I can go back to chili fries or animal fries (for all the In n Out lovers out there, sorry). The fries were well-fried and crispy, even with a layer of glaze and a decent heap of bulgogi beef on top. Whoever invented these is genius.<br><br>Craving some poke in your life? Happen to be near Wicker Park? Do yourself a favor and make this one of your destinations.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5rB3Wt1qzFTvI5ksUBwG7A/348s.jpg", "caption": "Salmon wafu poke bowl for $12."}]}}, {"review": {"des": "This place is honestly SO good. I can't believe I hadn't been there before. There weren't a lot of people when I went, but it was 3pm on an afternoon. The woman at the register was so nice and acommodating. All the seating is clean and there is self-serve water. The menu is very simply done, and the orders came out fast and hot. They were brought to the table. <br><br>I had the crunch sushirrito which was really good. The sweet potato is a nice surprising touch in it, and it's a really filling portion. Be careful as the rice is on the outside so it is messy. My friend had the Friend sushirrito which I tried a part of, and it was equally delicious. Two kinds of fresh fish, tamago, and really good but not overbearing sauce. We also got the Bulgogi fries, and these are some of the best Bulgogi fries I have had anywhere. Not soggy, hot, with a generous portion of meat and delicious sauce. I will definitely be back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eKZj5eT2-Sc6z42AuNSBog/348s.jpg", "caption": "Friend sushirrito"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7d_a4408Ire36-XASW0Ucw/168s.jpg", "caption": "Crunch sushirrito"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jAuACryoYAi361_RV8C-4A/168s.jpg", "caption": "Bulgogi fries"}]}}, {"review": {"des": "Fantastic poke!! I got the salmon wafu poke bowl, and was blown away by the taste. The salmon tasted very fresh. The yuzu soy marinade and all of the sauces were a great complement to the salmon. Usually, I prefer to create my own poke bowl, but the ingredients they chose for this were great. There was guacamole, edamame, sweet potato, onion flakes, and more. It was also definitely enough to be filling. <br><br>I also tried the bulgogi fries. They were really crispy, which was good. Definitely would recommend. The kimchi fries are also probably similarly good.<br><br>You also get a free miso soup with your order! And they have nice, faintly flavored water. I couldn't make out what the flavor was, but it tasted good.<br><br>Also, the tacos look really good, but are also pretty small for the price (they cost about half a poke bowl, but two tacos don't add up to the amount of food in one poke bowl).<br><br>Anyways, I am back from Los Angeles, and they have really good poke there. So, I am glad to say that this place definitely ranks among the top poke places I've tried in LA. I like this place even more than En Hakkore 1.0!!! Really good stuff!! Cozy  restaurant! Fast service! Oh boy oh boy! He! he! he!", "pics": null}}, {"review": {"des": "En Hakkore specializes in dishing out sushi burritos and poke bowls. And it doesn't mess around. I've only tried their sushi burritos, but I can imagine the poke bowls being just as good. These days they are also crafting up sushi tacos, which are popular amongst patrons. (One thing to note... The korean wings are no longer available, but still appear on the menu. My happiness turned to sorrow real quick.)<br><br>Anyways, let's get to it. So far, I've had the Friend (Ahi tuna + salmon) burrito, Unagi Lover burrito, and the kimchi fries.<br><br>Friend - A beautiful and tasty marriage of two fishes. Good amount of fish accompanied by a variety of veggies with light sauce. The supporting cast of ingredients work well together and do not take any attention from the fish. The fish is the star. As it should be.<br><br>Unagi Lover - This burrito has a similar build as the Friend, but uses the classic eel sauce and has a rice exterior with crunchy flakes sprinkled all over. It's a quality burrito, but I personally wish there was more eel in it.<br><br>Kimchi fries - Fries with a blanket of kimchi dressed with some sauce and chopped green onions. It's a pretty textbook set of kimchi fries. The fries were pretty crispy, which provided some good flavor and texture. The kimchi, however, was too tame for my liking. The dish isn't too interesting and can be skipped. <br><br>There's a lot to like at En Hakkore. Sushi burritos are done right here and are deserving of your time and stomach!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iAMxD-DtZuwHO0lKpLlmpw/168s.jpg", "caption": "Kimchi Fries"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OgeVXFiUt7vhK6hIDAtgZA/168s.jpg", "caption": "Unagi Lover Burrito."}]}}, {"review": {"des": "Great poké and sushi burrito options here in a fantastic location! Located in the heart of Wicker Park, this place stands strong against the other poké restaurants here! The staff is quick and efficient, they know their stuff regarding each food option on the menu. The food is served quickly, everything we tried was so fresh, delicious, and the portion size was good.<br><br>For around $13 including tax, this is the average price for poké. We ordered the Salmon Wafu Poké bowl with black rice and mixed greens, as well as the Savory Poké bowl with all mixed greens. Both generally have the same garnishes on top as well as the sauces used. The Savory bowl just has Salmon and Tuna included. The amount of fish cubes served was a great amount! The sauces included were not over powering and did not drown the rice and greens. Every bite was so delicious. The black rice was interesting and had such a great texture!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KWdufHDTjNoHVw_Uo05XSQ/348s.jpg", "caption": "Poke Bowls and Bulgolgi Fries!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5kwgDw_WDjcMqCalgb4vHg/168s.jpg", "caption": "Spider Man Taco!! Tastes as good as it looks"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CVMfrLPp-GL3nxLyxFufEA/168s.jpg", "caption": "Salmon Wafu with Black Rice and Mixed Rice"}]}}, {"review": {"des": "This was a fantastic Asian fusion restaurant that exceeded my expectations. I have a salmon pokey bowl, and it was absolutely fantastic. Nothing negative to comment about. I'll definitely come here again.", "pics": null}}, {"review": {"des": "Absolutely delicious! Everything that we tried was beyond my expectations. I have been to numerous Asian fusion places over the last couple years but none of them have packed as much flavor and deliciousness as En Hakkore. We started with the kimchi fries which were unreal. So addicting and unlike any style of fries that I had had before. Then we had to try a spicy tuna sushi taco but now I can't stop thinking about it because it was so dang good. These two dishes alone will keep me coming back. My boyfriend got the soft shell crab sushi burrito and I got the spicy tuna poke bowl. We were both so incredibly satisfied with our meal and would suggest either one of these dishes! I don't think we could have ordered a bad dish here. You must go!!! I absolutely can't wait to go back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uN9j_zMlvWqORqKB3m_irQ/168s.jpg", "caption": "Soft Shell Crab burrito"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LelCrjOoq6w704Z2bcsvQQ/168s.jpg", "caption": "Poke bowl"}]}}, {"review": {"des": "Their Superman soft shelled crab is the most delicious Asian fusion item that's graced the restaurant. The soft shell crab prepared crispy like a light cracker complemented with spicy mayo and sweet soy sauce, umami and delectable! I can eat it all day long.", "pics": null}}, {"review": {"des": "Excellent.  Love this place for lunch.  Love their Korean bowls. Heathy and fantastic.  Just go there.", "pics": null}}, {"review": {"des": "The place is great and the food is amazing. You should try every dish they serve. It is fun to go here with friend and even with a date. Everything is fresh there and with a lot of creativity.", "pics": null}}, {"review": {"des": "The sushi tacos were unreal. If you like sushi and poke - this is a five star dish - in the sense that I've never had anything like it before and the execution was flawless. I tried five of them and they were all great! They are kinda expensive - but I will be back for more! Just like I refer friends to the original En Hakkore for their parantha tacos - I will be referring people here for these!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6Y0Njsdi7fBzefQoMHAdTw/348s.jpg", "caption": "Soft shell crab and tuna taco- freaking amazing!"}]}}, {"review": {"des": "Walked here from our Airbnb to give it a try and it was delicious! We ordered tacos and they were really yummy, the hard shell is such a cool idea. We will definitely be back!", "pics": null}}, {"review": {"des": "If you like sushi and you like burritos, you'll love En Hakkore 2.0.<br><br>This place is unreal. Cute lil atmosphere, affordable and amazing food! I tried the crunchy + fire sushi burrito and it was amazing but extremely spicy (posted a photo, as well). Next time, I'll get the crunchy burrito without fire. En Hakkore 2.0 is going to be a staple for me when I'm in Wicker. Seriously, guys, try this place. You won't regret it!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/z8yfdFn069STDl05OVJaQQ/348s.jpg", "caption": "Crunchy + fire burrito"}]}}, {"review": {"des": "The Friend sushi burrito was amazing! Good layer of rice with great flavors.<br><br>The salmon poke bowl also had a lot of good flavors      A little light on the amount of salmon poke though for $12 IMO. <br><br>A great Korean fusion place that hits the flavors right on.<br><br>Will definitely be back again. A little on the pricy side though. At $8 an item it would be a solid daily go to place. At $10 an item it would be a weekend treat. At $12 an item it's more of a monthly place. Or there should be more poke in the poke bowls.", "pics": null}}, {"review": {"des": "Mmmm I do love the en hakkore spots. They do an awesome job at capturing authentic korean flavor in Americanized dishes. It's quick and casual too, and not a huge damper on the wallet!<br><br>I ordered the fire tuna poke bowl with black rice. It was delicious and very large for the price too! The kimchi fries were also a great complement to the meal. I highly recommend getting the kimchi fries if you're starving like I was. The fish is fresh, the sauce is tasty and light, and the portions are hefty.<br><br>Great quick and casual- but quality- meal. I love trying these new Asian fusion ideas!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/f1Nczf4ScKtBHHDVUBoKgA/168s.jpg", "caption": "Fire tuna poke bowl"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZaZZDtlzbplbcHRkKel1ow/168s.jpg", "caption": "Kimchi fries"}]}}, {"review": {"des": "Food is so fresh and tasty! Portion is big and not pricy considering the location. My friend and I shared a sushi buritto-fire and crunch and a poke bowl. We were so full afterwards. We will definitely come back again!", "pics": null}}, {"review": {"des": "RUN Here! The Sushi Burritos here are delicious. Only ordered delivery from here (via Caviar) since we don't live in the neighborhood but we have been repeat customers already several times. Burritos are always fresh and taste delicious. <br><br>Food: 5/5 my favorites here are the crunch, crunch+fire and bibimbop burritos<br>The mandu and kimbap are also on point. I can't wait to visit in person next time I'm in the neighborhood! I was already a big fan of the original establishment. This 2.0 location however is even better!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_jm-0zRo02pgB_r-XcC7_w/168s.jpg", "caption": "Crunch plus Fire"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OsDFmBlUHfombw4t82CGbg/168s.jpg", "caption": "Crunch Wrap"}]}}, {"review": {"des": "Came here on a weekday night at around 7:30 pm -- delighted that it wasn't packed. Very kind host with good and thoughtful recommendations. Came with a party of three and we got 2 poke bowls and 1 mini beef bowl, along with an order of kimchi fries.<br><br>Wow! great tasting food and sizable portions -- a powerful combination in my mind. I don't even really eat seafood much but I really enjoyed the salmon wafu that we shared. The mini beef bowl is quite filling. Kimchi fries were fried wonderfully and seasoned/topped with just the right amount of sauce and kimchi.", "pics": null}}, {"review": {"des": "I was skeptical of the concept of a sushi burrito, now I crave it 5/7 days a week. Highly recommend!", "pics": null}}, {"review": {"des": "Sushi tacos. Words because yelp needs my review to be a certain length. Somewhere Jiro is crying himself to sleep thinking of the massacre Americans are doing to his beloved fishies but I'm here for every deep fried seaweed shell of it. You keep doing you, En Hakkore.", "pics": null}}, {"review": {"des": "If you're tempted by the idea of a sushi burrito, look no further!<br><br>The service was quick and attentive. You order at the front counter, and the food is brought to your table. <br><br>The Honey Garlic Wings were even crispier and more flavorful than I could've imagined. We ordered the half and half, and even though I like spicy wings, the honey garlic ones blew the spicy gochujang wings out of the water. <br><br>The \"Fire\" spicy tuna sushi burrito had a nice balance of rice to fresh ingredients. There were large chunks of tuna, and crisp vegetables inside. At $10, this was a satisfying meal - I wish they would open another location in the loop!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_UMlF5cc3Qo1hLclbDCe1A/168s.jpg", "caption": "Fire spicy tuna sushi burrito"}]}}, {"review": {"des": "The lady that works there is so adorable and friendly! She just makes the service compliment the food so well~ I usually get the sushi burritos when I go there, which are also fantastic! My favorite is the Crunch+Fire paired with some Kimchi Fries. <br><br>Overall, I would recommend this place to anyone that asks for places to eat at in Wicker Park", "pics": null}}, {"review": {"des": "Delicious sushi burittos! Good size too. The kimchee fries were also delicious and well seasoned. Overall I would definitely come back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/48sYPS23bA-RGs3YkM870g/348s.jpg", "caption": "Salmon and tuna buritto with Kimchee fries"}]}}, {"review": {"des": "I absolutely have nothing bad to say about this place. Good food for reasonable price. If your looking for healthy food choice, get their poke bowl with only green mix and sauce on the side. I also like their fire burrito - perfect amount of spice and rice. Service was quick and the lady was very helpful. Our saturday lunch also came with free miso soup.", "pics": null}}, {"review": {"des": "Location: a 5 min walk from the Damen blue line stop so it's convenient if you are coming from O'Hare<br><br>Hours: they close at 9pm on Friday which is a little early in my opinion<br><br>Food: pretty good! I like that there's a variety of different types of food and different flavor options for each item.  I've been here twice.  The first time I went a year ago, I just got their sole poke bowl which was phenomenal.  They have since then expanded it to multiple flavors and added fried sushi tacos to the menu.  It was a nice add but the sushi tacos are a little small and somewhat pricey.  We went with the fried soft shell crab sushi taco.  The soft shell crab was crispy!  The honey garlic wings were a good add since the tacos were not filling.  My friends and I also shared the Fire burrito and the Savory poke bowl.  The poke bowl was not as good as I remembered.  They also left out the mashed sweet potatoes but brought a small cup out for us when I commented on the missing ingredient.  I kind of wished they had a dessert menu.  That would have topped things off. <br><br>Service: It's pretty casual. You order at the counter and they bring you the food. Water is self serve.  They were pretty patient with all our questions while we ordered.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hadeBkUgLlpqCzSglNeP5A/348s.jpg", "caption": "Savory poke bowl...they forgot the sweet potato"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Bxx-v6ADI-Vw78ChfBCQ3Q/168s.jpg", "caption": "Honey garlic wings and half of a fire sushi burrito"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SYJ2njCcb1Zyaph5qjlEzA/168s.jpg", "caption": "Soft shell crab taco"}]}}, {"review": {"des": "Arguably this has to be some of the best poke style tacos I've ever had. I ordered the salmon tacos, soft shell crab tacos and tuna tacos. The ingredients were fresh and balanced with soft and crunchy textures. The poke bowl is impressive and I wanted to eat 3 more! The atmosphere of the restaurant is cozy and trendy. If you get the opportunity to snag a window facing seat do it! Nothing better then good food and people watching!", "pics": null}}, {"review": {"des": "$12 for poke bowl... but a Korean-style poke bowl. There is guacamole, pickled radish, crispy onions, edamame... that surround your choice of marinated protein. We tried the shrimp, spicy tuna, and kimchi salmon, and all of them were delicious. I had never tried poke marinated with kimchi, so that was a first... a GOOD first for me. I'd definitely order that dish again. The bed of rice feels like it's bottomless. The Korean horchata is sweet like the horchata you've had before, but with a more refreshing flavor.<br><br>The shrimp poke bowl states that there are 20-25 jumbo shrimp, but it's actually only about 10. It's still very filling, but don't get your hopes up for a mountain of shrimp.<br><br>Can't wait to be back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9XpnfUFalZPScVofkS6y9Q/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Xm8YZg9xY0RO00NaslQGnA/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RTplOu02NuugavU7DsF5Ng/168s.jpg", "caption": "Horchata"}]}}, {"review": {"des": "Good stuff. The greatest thing that impressed me here was the huge proportion sizes! Way bigger than the tiny poke bowls offered at other places for similar prices. The salmon wafu sauces were also the right ratio of sweet and sour, and they gave big portions of salmon too. Happy customer!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/u9shPvIix4EXdWcthbZd3Q/348s.jpg", "caption": "salmon wafu poke"}]}}, {"review": {"des": "Sushi burritos, poke, and kimchi fries. What more can you ask for?! The food comes out fairly quick and I really enjoyed the fire crunch sushi burrito. Will most certainly be back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rDsGxqyVnSe17QCoFmMe3w/348s.jpg", "caption": "Crunch sushi burrito"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GQiPMoLTx0H6pH5Repi1zg/168s.jpg", "caption": "Kimchi fries + spicy tuna poke"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Q_EqfKyQobVLn7AADNe9FQ/168s.jpg", "caption": "Spicy tuna poke"}]}}, {"review": {"des": "Different location same great food! I used to visit their old joint on Damen when I lived in bucktown.  The first time I tried their menu I knew this business had legs. I was glad to see that they have a larger location with more foot traffic. <br><br>Very creative menu with ahi tacos and ahi burritos. Also poke bowls that are supper fresh.  <br><br>The owners pay attention to the details and ensure the place always looks spotless.  Also fun to grab a seat at the open air window and watch the cross walk of life that is wicker park pass in front of you.", "pics": null}}, {"review": {"des": "I had my first sushi burrito this week at another restaurant but somehow the sushi tacos and kimchi fries at En Hakkore still caught my eye. I ordered the Fire & Crunch taco (crab and fried shrimp). I'd definitely go with tacos from this place. The shell had a nice crunch to it and it's just easier to eat a taco than a burrito that falls apart. The kimchi fries were battered and tasty. A pretty good spot for casual fare.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BHJW3_ST6zz6scJ0UiqS2A/348s.jpg", "caption": "Kimchi fries and the fire & crunch taco. Pretty tasty!"}]}}, {"review": {"des": "If you love sushi burrito, this is your place.<br>If you don't know what sushi burrito is, try it out! It's like a sushi morphed into a large handroll.<br><br>Quality is super fresh. My favorite is the soft shell crab.<br>Poke salad is great too.<br>I brought a few people here and they all came back on their own.<br><br>I like how you order and then you can sit around as long as you like and chat.<br><br>Note this place doesn't serve alcohol and NOT BYOB.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Q0OMxUoEPx_3hv4VN--HLw/348s.jpg", "caption": "Poke salad"}]}}, {"review": {"des": "SO SO GOOD. highly recommend this place to anyone who finds themselves in wicker park. overall super nice atmosphere with dimmed lights and good music.<br><br>the bulgogis fries are a must-get -- very crispy fries with a delicious sauce. We also got a savory (with black rice and mixed greens) poke bowl and a fire tuna (with black rice) poke bowl both of which were delicious. portions were huge and we both ended up with a good amount of leftovers.<br><br>i recommend asking for the house hot sauce! adds some original flavor without being too spicy", "pics": null}}, {"review": {"des": "The food at this place is absolutely amazing! I've eaten at this place a few times now, and every time I'm more impressed. I've had the chance to eat the sushi burrito, poke bowl, chicken wings, and several rice plates. The portion sizes are huge and it tastes sooooo good. The poke bowl has so much tuna in there - it tastes so fresh and delicious. Another one of my favorites are the two different flavors of chicken wings. The wings are so crispy and fried to perfection! You must try both flavors. No matter what you get, I'm sure you will be more than satisfied. <br><br>Other than the food, the service here is awesome. It's pretty much self-service: you order, fill your own water, etc. The guy who works up front is extremely personable and friendly. His demeanor and personality gives the restaurant a fun environment. The food comes out really fast too. I think I waited about 10 minutes for the food. The prices are reasonable too - about ten dollars per plate. <br><br>Highly recommend! Amazing Asian fusion food!", "pics": null}}, {"review": {"des": "I love this place! My go to is their sushi tacos - savory (salmon/tuna) and shoyu ahi tuna. Fresh ingredients, lots of flavor, and appropriately priced. I haven't tried their bowls yet, but that's only because I can't find sushi tacos like this anywhere else, so I always order it when I am in the area (or go out of my way to get their food, because it's so good!)", "pics": null}}, {"review": {"des": "This place is super good! The sushirritos are GIANT, delicious, and reasonably priced. Also, while the burritos are pretty big, they don't put too many different ingredients in them so you're actually able to enjoy each bite as if it was a piece of sushi. The bulgogi fries are a great side if you're extra hungry or sharing with someone. I definitely recommend giving this place a try!", "pics": null}}, {"review": {"des": "Only had delivery - I had a busy Thursday evening so I placed my order right before I left the office for the day. They gave me eta of 35-40 minutes which was perfect since my train ride home would definitely give me enough time. I get home in about 25 minutes and just a minute later, my food was here! Delivery guy was super nice as well. Considering it was rush hour and raining and over in WP, this was a great experience. Everything was also packaged very nicely.<br><br>Unfortunately, we had plans and couldn't actually eat until a few hours later. However, food was still very good and fresh. We got a ceviche burrito, fire burrito, seafood pancake, and kimbap. Both burritos were very tasty, made well, and super fresh. All ingredients worked well together while being able to distinguish various ingredients. These were also much bigger than those at Sushi Burrito (albeit a bit more pricey). We even saved half of our burritos for later, as we were quite filled already (yay, leftovers!). Same goes for the kimbap and seafood pancake. I thoroughly enjoyed it all and everything was very reasonably priced.<br><br>Overall, I would definitely order from here again and would dine in when possible. Good portions, good prices, and very satisfying food that's not super unhealthy!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JlGSuTAA6s8GTYFUUltMMw/348s.jpg", "caption": "Fire"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6EJ4WZOZMOAnW9zGjRFlow/168s.jpg", "caption": "Ceviche"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wdpj8Pj81fwYAy9Uc4ZKEw/168s.jpg", "caption": "Kimbap"}]}}, {"review": {"des": "Simply delicious. Great casual/counter-service restaurant. <br><br>Food: Amazing, flavorful, and different! Fire burrito 5/5 - Yum! Perfect amount of spiciness and very flavorful, but I have to admit this was my first sushi burrito. Soft-shell crab taco 5/5 - Delicious and awesome presentation! The fried seaweed taco shell is such an amazing touch! Savory poke bowl 4/5 - Good poke, but nothing special. I want to say this was a mix of tuna and salmon? They initially forgot the sweet potato, but brought some out for us later! My friends also had the wings, which they said were delicious.<br><br>Service: Great! Very attentive and friendly.<br><br>Other: Very cute inside! Great decor and clean.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sDzY-qzXhj3bncgi3thwDw/348s.jpg", "caption": "Soft shell crab taco. Yum!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-suVyKLSCBbTtjW3ZL7GtA/168s.jpg", "caption": "Fire Tuna Burrito. Yum!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ju5oZd0HNYne9ZQO0FMUEw/168s.jpg", "caption": "Savory poke bowl. Yum!"}]}}, {"review": {"des": "Me and my cousin came here for lunch and it was very nice. The place was quiet so it's good for catching up with friends or family. Here is what I ordered:<br>The Unagi Taco - the shells are made out of deep fried seaweed and combine with the sauces. This was the best thing I had.<br>The Shoyu Ahi Tuna poke bowl - this was alright. The flavor was good. The portion was huge! One bowl could serve 2 people. <br>The Bulgogi fries - these babies are the type of fries that they fried twice which makes them crispy and crunching [my favorite kind of fries] but still meaty. <br><br>Overall, everything we had there was all delicious!<br>The staff was very friendly and very helpful too. <br><br>I had to give it a 4 stars because the tacos were $6 and up. Kinda expensive for 1 taco.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SrDG6MzggazHMOwK9vmxsQ/348s.jpg", "caption": "Bulgogi fries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TrNsthXBV2Al5FtXMgwJOA/168s.jpg", "caption": "Unagi Taco"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nx89hGJO6OW-5ptNOMRtuQ/168s.jpg", "caption": "Shoyu Ahi Tuna"}]}}, {"review": {"des": "This place has really killed it in the fusion market. Located in wicker park, the ambience is really great. <br>Seating arrangement is decent and one has the option of sitting near a bar top and enjoying a Korean Taco whilst watching the busy Milwaukee street. <br><br>I tried the Fire Sushi Taco which was insane. Sushi wrapped in a taco, what else do you want!? I also got a Bulgogi fries on the side which equally complemented the main course. The side drink (Iced Korean Horchata) was something I was ambiguous about at the start, but it perfectly complemented the rush Fire Taco deserved. <br>The only thing this place missed was a Kim Jong-un mannequin sporting a mustache and a Mexican Sombrero", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UtB8qz9BNrdmUybJSyQRFA/348s.jpg", "caption": "Iced Korean Horchata"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zjuvp1bOgjF-oR9OXWjNHg/168s.jpg", "caption": "Bulgogi Fries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dS2QWrGDz6inw31yhFpIaQ/168s.jpg", "caption": "Fire Sushi Taco"}]}}, {"review": {"des": "SUSHI TACOS! Please come here to try them out if you get a chance. It's so unique and so delicious. It's a fried, crunchy seaweed shell with the sushi fish inside. The shell held up really well! It didn't get soggy or anything. It's definitely a fun twist on sushi.<br><br>The poke bowls were huge! Well seasoned and came with lots of veggies. I'm pretty picky so I wish that I could be able to choose my own toppings, but we still enjoyed our bowl.", "pics": null}}, {"review": {"des": "The only downside of giving this place a 5 is that the amazing rating will cause it to become way crowded. This place could be a little cheaper (like $4 instead of $6 tacos), but the quality and creativity is on point. Also the cheapest decisions poke bowls I've found so far.", "pics": null}}, {"review": {"des": "I've had this place bookmarked for a while, so I was excited to finally try it out when I was in the Wicker Park area with a friend from out of town. We went around 5:00 pm on a Wednesday, and the place was a pretty empty. The interior of the restaurant is very nice  and trendy, and you place your order at the court yet after being seated.<br><br>I ended up ordering the Soft Shell Crab Sushi Burrito, which comes with a complementary side of Miso Soup. The burrito itself was delicious! The soft Shell Crab inside was crispy and perfect, and the burrito itself was decent sized. I've had sushi burritos once before from Sumo Sushi (on Sheffield Ave.), and of the two I'd definitely prefer En Hakkore. It was a little pricey ($10-15), and the burrito itself kind of fell apart while I was eating it. Overall, however, I loved this place and I'll definitely be back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/50YAkzxoBO2VL5--QzFh5A/168s.jpg", "caption": "Soft Shell Crab Sushi Burrito. Delicious!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lGctPJTfCgvB2DVY19uvXw/168s.jpg", "caption": "Complementary Miso Soup"}]}}, {"review": {"des": "Super Spicy Seafood Ramen.<br>Kimchi Fries & my first SushiRito! Freaking amazing. Equals about 4 rolls in one and everything is reasonably priced! I will def be back to try the array of sushiritos!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/b0L1b5u_bJ_HX9vbmwyEVg/348s.jpg", "caption": "En Hakkore 2.0 doing everything right!"}]}}, {"review": {"des": "The Pokebowl is GOOOOOOOD! <br><br>I came here for the Savory Poke Bowl, and the Fire Tuna and man was there a party in my mouth. They have a great sauce that compliments all the items they add to their bowl.", "pics": null}}, {"review": {"des": "I remember a couple years back some friends moved to California for work, and their first year back for Christmas, I remember all they would talk about was eating poke, poke, poke. I guess maybe the quinoa craze died out over there. Nonetheless, I was curious to find out what poke tasted like. And just my luck, last year all these poke places started popping up like ramen shops. Each having their own unique style or twist to it. <br><br>So, what makes this place different, I'm sure you are wondering because I was too when I walked in. Honestly I don't even think they started off as a poke place, so I was definitely skeptical. I believe they started off being known for their sushi burrito, which pretty much is a huge sushi roll to call your own. I mean it only made sense right? They already had all the ingredents to make poke, so how I see it is, you have a choice of eating raw fish with a fork or savage style. Take your pick. <br><br>On our visit, I ordered the tuna and salmon mix over black rice and mixed greens. You get a pretty even amount of everything. The bowl is colorful and inviting, from the rice to all the veggies. The sauce wasn't too salty as I have found some places to be, but maybe it is because they aren't as generous with the sauce as other places. As for the sushi burrito, my boyfriend had the friend burrito, which consist of ahi tuna and salmon. The ratio of rice was spot on. I thought it would be packed with rice, but it wasn't. There was just enough rice to every bite. The sushi burrito here definitely left more of an impresssion of us. <br><br>Bottomline - I would come back because if its refreshing twist to the poke bowl. Sushi burrito was spot on. Seems like they have experience and the ratio down to a science. Worth a shot if you are in the Wicker Park area and want a quick bite.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/q69h3xsm8uvoJLoB39P9EQ/348s.jpg", "caption": "Loving their poke bowl. Lots of flavor and that rice is unique."}]}}, {"review": {"des": "We came in here randomly for dinner one night and have now been back several times. <br><br>Tasty food at reasonable prices. I first tried the tuna burrito. It was excellent. I was impressed with the ratios and flavor. Looks are deceiving and this was very filling. I've since had the poke bowl and it has become my go-to option usually opting for the \"Savory\" one (tuna and salmon). I miss their Korean wings - they were excellent. While I seem to always go to the same options their menu is fairly large and varied. <br><br>Great casual spot in the neighborhood.", "pics": null}}, {"review": {"des": "Stopped by for a weekday lunch during work one day cause it's been on my bookmarked for a while. I'm glad I did! This was ordering at the register, pick your own seating, and eat. Love these types of places that don't require the middleman of a server. <br><br>Got to-go:<br>Crunch Sushiritto $11.05 after tax<br><br>The burrito itself was really flavorful and I enjoyed the combinations of ingredients together. The panko flakes around the wrap made for a nice crunch and the rice to ingredients were just right. <br><br>TBH $11.05 was a bit pricey for the burrito itself, considering size, but I suppose, considering quality, it was just right. Had it been maybe $9, I think that'd be a better value and would make me go more often than not. Fortunately for me, that $2 difference is a big enough deterrence for me to be a frequent flyer here. Considering I was still a little hungry after finishing the burrito, I'd eat it again with a side of kimchi fries or something.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZbpKQtBUgKdFVDPwoTx56w/348s.jpg", "caption": "Menu January 2017"}]}}, {"review": {"des": "Kimchi fries were good... being a vegetarian had limited options but it was hood and if you feel like having korean.. nice place to try!", "pics": null}}, {"review": {"des": "En Hakkore 2.0 has the best sushi burritos in my opinion.  They're very flavorful, hearty, and a great deal (a sushi burrito is basically two meals given how much they fill them up).  I had the Fire and Crunch burrito.  It could have been a bit crunchier but the shrimp tempura that was in there was delicious along with the ahi tuna.  I liked the jalapeños, avocado, and spice.  It could have been even spicier for me though.  I wasn't too into the cream cheese in there, it just didn't go with the rest of the flavors.  Overall, though the burrito was tasty.  The service was good as well.  The place is clean, has a pleasant ambience, and I like the outdoor patio.  I look forward to coming back here and trying more things!", "pics": null}}, {"review": {"des": "Very delicious poke bowls served here and the burritos are just as good.  Recommending you get anything that has the word fire because it definitely kicks your taste buds out of wicker park, and the drinks they have here are just as good including the Aussie based root beer.  All hail the new king of poke bowl of this neighborhood and if you want coffee, go across the street to wormhole.  Mention the word \"bhosrici\" and you get a free cup of coffee..", "pics": null}}, {"review": {"des": "Wow, really good food, fast service and friendly staff. Price point is a little high, but as to be expected for high quality seafood and it's definitely worth every penny. Can't wait to come back and try more of thier tacos. We tried the Friend Sushi Burrito, the Savory Poke Bowl and the Spiderman Taco, all 3 were delicious, but the sushi burrito was my favorite.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/duIDbJSbQPcbnoeLcAMLKA/168s.jpg", "caption": "Spiderman Taco"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/c3pQFF4oi-oBG6sPbTP_iQ/168s.jpg", "caption": "Savory Poke Bowl, Miso Soup and Friend Sushi Burrito"}]}}, {"review": {"des": "THEY HAVE SUSHI TACOS!!! okay, you can stop reading this now and go get some because IT IS LIT. I got so excited when I first heard about this place, and now I'm a regular 8) <br>I have tried a bite of the fire burrito (most popular)- it is decent but not my favorite<br>Salmon wafu poke bowl- it's pretty good but the Salmon wasn't super marinated<br>Unagi lover burrito- the taco is better <br>Unagi lover taco- I was super sad when I ordered this because I had just gotten rejected for something I really wanted BUT THE UNAGI LOVER TACO SAVED THE DAY!!! <br>Ahi tuna poke bowl- I was gonna rate this place 4 stars but then I took a bite out of the poke. Enough said <br>Soft shell crab taco- yes. My sister is in love with it <br>Crunch & Fire Burrito- AMAZING.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aZEzi0UMhMOfkVKhptlrBw/168s.jpg", "caption": "Unagi lover and wings"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vlejhGkDz2SGp6sTlQCung/168s.jpg", "caption": "Friends Burrito"}]}}, {"review": {"des": "Give. This. Place. A. Go. If you have not! Oh my mama.<br><br>We tried the crunch and fire roll. Wow. People are getting absolutely creative with food! Sushi in a burrito form- I enjoyed it! <br><br>The crunch roll has shrimp tempura, eel, cream cheese, sweet potato, flakes, cucumber, plumguac, lettuce, avocado, eel sauce, and mayo sauce.<br><br>The fire roll was practically the same, but a bit more spicy. It's got spicy tuna, sweet potato, flakes, plumguac, lettuce, cucumber, avocado, jalapeno, red pepper, and eel sauce.<br><br>We also tried the kimchi fries. I grew up loving kimche and would have never imagined to throw the Asian appetizer in a mixture of fries.<br><br>Great location and great food!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/v8j1_vaX1irWDjR1XuljVw/168s.jpg", "caption": "Kimchi Fries"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZpXP1zOwRS_mGKEyPFrBEA/168s.jpg", "caption": "Crunch Roll"}]}}, {"review": {"des": "Context: Ordered a Savory poke bowl with black rice & mixed greens for delivery in May 2018<br><br>Overall, the bowl was good and well-balanced between crispy, crunchy, and squishy toppings. The sweet potato was a unique but welcome addition and was a sweet complement that paired well with the similarly-textured avocado. Like most poke bowls, it traveled pretty well.", "pics": null}}, {"review": {"des": "I wished they had an En Hakkore in Oakland/SF I would go every day! Love the seaweed tempura taco shells. Fish was fresh. I forget the names of the different types of tacos but my husband had the salmon ones and I had the tuna ones... we both ordered two tacos and it was plenty. Try it! It's yummm!", "pics": null}}, {"review": {"des": "Coming from the west coast, I wasn't too excited about coming here at first, but once the food came out I was impressed.  I ordered the soft shelled crab taco...excellent, I think the shell was made of deep fried nori, and they gave you the whole crab, just the right amount of sauce and rice.  If they were on the west coast, I would frequent this place.  All my friends seemed happy with their food.  Only if we went here earlier, and not the day we left.  I can't wait until next time I'm in town...eating here for sure.", "pics": null}}, {"review": {"des": "Sushi burritos with Korean fillings...I'm in! What a great fusion! My husband and I have been going to the original En Hakkore for some time and decided it was time to try 2.0. It definitely is very different and has differing menus...which I love!<br><br>En Hakkore 2.0 has the sushirito! The seaweed and rice serve as the tortilla. The sushirito is large, my husband and I shared one and shared a side. I'm glad we shared because it would've been overkill had we not.<br><br>OK now to details on the food. We shared the bulgogi burrito which had bulgogi, tofu, pickled veggies, and crab meat wrapped inside the rice/seaweed. They give you a bottle of spicy sauce on the side. And this was soooo tasty! I would totally get it again. Although, I would like to try one of the other burritos next time. We also ordered the bulgogi fries which were unreal!!! SOOOOOO good. That will totally be had again. They were waffle fries topped with bulgogi and sauce...so good. The fries themselves were flavored well. <br><br>We will definitely be back to try more sushirito items and possibly poke bowls! :)", "pics": null}}, {"review": {"des": "wow i got the veggie poke bowl takeout. amazing taste! i should have taken the photo before digging in. Love the marinated tofu although it's a br on the sweet side.<br>crunchy onion adds a new flavor. definitely ordering this again.", "pics": null}}, {"review": {"des": "Wow! Amazing! Delicious and fresh. We got the \"burritos.\" I had the Bibimbop and my wife had the Friend and we got the fries with Bulgoki. So good!", "pics": null}}, {"review": {"des": "Wowowowowow<br><br>I really wish I didn't live so far from this place otherwise I'd go here probably every second of my life.<br><br>We went into the restaurant 20 minutes before closing and they were kind enough to get us seated and didn't seem bothered at all. They were super quick with making the food. <br><br>I was freakin impressed by the poke bowls. I got a kimchi salmon bowl and it was so freshly made and the bright colors made me a little bit happier inside. The kimchi tasted perfect with the salmon, it had a tinge of spiciness that worked well with the fish! There was also salad, rice, edamame, sweet potatoes, carrots, and even GUAC in this bowl. There are also a selection of other poke bowls, sushi tacos, and even sushi burritos!! I was amazed and kind of at a loss for words but I'm glad I'm able to write this review and rave about them forever. <br><br>The employees are so kind hearted and deserve all the tip in the world. I hope that this place continues to prosper and do well because it makes a lot of people happy.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/H8ENIy0bnDpVbiCeGrtvAg/348s.jpg", "caption": "The poke bowls are brilliantly made"}]}}, {"review": {"des": "Got the fire crunch burrito. Extremely flavorful and jam packed with ingredients. The tempura crunch on the outside of the burrito added an awesome texture while biting through, not very spicy but very tasty. Thought we were gonna get a miso soup for free but didn't end up getting offered one.", "pics": null}}, {"review": {"des": "What a great experience! My boyfriend and I met up here after work, and decided to try something different and we were surely not disappointed. I had the Vegetarian Sushi Burrito (tastes nothing like a burrito, but filled with sushi goodness!), the Kimchi Fries, and he had the Bibimbop Burrito.<br><br>We were both full, with happy tummies and smiles!!", "pics": null}}, {"review": {"des": "Dang this place is good. I got the lava taco, which was spicy tuna with a hard nori shell. My group got a sushi burrito, a poke bowl - all recommended. We also shared kimchi fries, which had much tastier fries than most places. Would go back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pfsUVm2JstdpQOOy-pdxEw/348s.jpg", "caption": "Poke bowl"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Y_3XcDk4mNJ5d5dGc0JlJg/168s.jpg", "caption": "Sushi burrito"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8GCM0Tl59GBw8OhpS7Eh8w/168s.jpg", "caption": "Lava taco"}]}}, {"review": {"des": "You may have eaten or heard of a ramen burger, a hamburger that's Asianfied with a bun made of ramen noodles.  En Hakkore does the Asianification (creative liberty--you can't stop me) of the burrito in their own magical kitchen.<br><br>I ordered the Crunch+Fire sushi burrito fully expecting it be a bunch of sushi ingredients dumped into a flour tortilla.  But boy was my mind blown when the nice lady brought me out this neatly wrapped package of sushi joy nuzzled into a blanket of rice.  The tortilla was constructed of rice.  Imagine that.<br><br>The location is great, service fast and excellent, and the sushi burrito was like a really tasty piece of sushi, only it's the size of an adolescent bridge troll.  Next time I stop by, I'm going try one of their highly regarded poke bowls.", "pics": null}}, {"review": {"des": "Being from LA, I've had my fair share of good Poke options/Korean fusion food, but En Hakkore is great and I'll come back any time to fulfill the poke craving.<br><br>Order before sitting and grab your own water/drinks after paying.<br><br>I got the Savory Poke Bowl, but I've had their Fire and Crunch Burritos before. All options I would recommend depending how you're feeling. They have such a great variety of ingredients, especially in the bowls. Well worth the money and perfectly hearty portions. <br><br>Love this place and will be here many more times I'm sure. Their other location has some great dishes as well.", "pics": null}}]}