{"name": "falafel-and-grill-chicago", "reviews": [{"review": {"des": "Favorite spot for falafel and chicken shawarma!  The food is excellent and is a superb value for the amount per serving - usually have leftovers that is enough for another entire meal.  Cannot say anything bad about the service either and restaurant is usually pretty clean.  <br><br>Oh yeah, and don't forget the garlic sauce!", "pics": null}}, {"review": {"des": "Tl;dr : Ordered the chicken shawarma entree which comes with salad and hummus. Hummus is AMAZING. Great flavors overall. Baba ganoush is great too. <br><br>Service : 5/5<br>Food: 5/5<br>Ambience: 5/5<br>Price point: 4/5<br><br>I think these guys have the best tasting hummus in the city, no joke. I have tried their lentil soup, baba ganoush, and chicken shawarma. <br><br>The portion size for chicken shawarma is fairly big (as expected) although the price is slightly higher than that at a comparable grab-n-go/simple sit-down Mediterranean spot. The chicken shawarma itself is very well cooked, that's mild flavored. It pairs well with their hot sauce and garlic sauce. The garlic sauce is perfect where it's creamy and garlicky but not overwhelmingly garlicky as you might find at other Mediterranean restaurants. The service was fairly quick, I got my order that was behind 3 people's in 10 mins. Baba ganoush was really good too, it had a very mild smoky flavor that worked great with the inherent eggplant and tahini flavors. The lentil soup was good although it felt like it could have used some more salt and spice. The salad that came with the entrée was fresh, expect barebones salad of lettuce and tomatoes with dressing. I don't like salad dressings, I would rather have my salad without any dressing but the dressing it came with was lightly flavored and delicious. <br><br>The place itself is well maintained and ventilated. They always have Mediterranean music playing in the background. Overall, my experiences with them have been positive and I definitely come back every month at least for their hummus if not for more.", "pics": null}}, {"review": {"des": "OVERALL: Falafel & Grill is a great Mediterranean restaurant if you want an authentic meal and the most bang for your buck. <br><br>------------------------------------------------<br><br>Falafel & Grill's shawarma plates are huge consisting of a salad, pita bread, hummus, and a large portion of your choice of meat with rice. Most of the time I can't finish all of the food and end up taking it home for another meal. My favorite personally is the gyro sandwich with a delicious tzatziki sauce along with a side of their fries (which are also amazing). The employees are friendly, the service is great and pretty quick usually, and the place is clean. I would also recommend getting to the restaurant earlier rather than later to get the freshest possible meat.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Snz-qALKfN1BI-VMQ5GDQQ/348s.jpg", "caption": "Chicken Kabob Plate"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aJsyNgIdD8ZLWcNoF--JHw/168s.jpg", "caption": "Beef shawarma plate"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/N2SUJvItx82JkBj-cIPZSA/168s.jpg", "caption": "Gyro sandwich with a side of Waffle Fries"}]}}, {"review": {"des": "Checked this place out recently and was really surprised how good it was. Apparently other people know this as well cause it was pretty busy. I had a chicken shawarma and it was probably the best one here in Chicago.", "pics": null}}, {"review": {"des": "Lebanese food is one of my favorite foods. This place is unique because they have such awesome selections and their food is so fresh and delicious. I got a falafel sandwich and I got a Shawarma sandwich and I was greatly impressed with my order. I highly recommend this place", "pics": null}}, {"review": {"des": "My bf raves about how great this place is, so I tried it out! The workers here let me try various things before buying, which was so helpful! I got a chicken shawarma platter and sandwich to go. I heated it in the oven when I got home and was so happy. The flavors are excellent.", "pics": null}}, {"review": {"des": "Chicago is full of great eats but this is definitely one of my all time favorites. <br><br>Service was quick and courteous. The cashier took us through the menu, told us their most popular dishes, and even let us try a sample before ordering.<br><br>This is a Middle Eastern restaurant and let me tell you, boy does it hit the spot. My wife and I ordered the combo platter which came with large heaping portions of chicken shawarma, chicken kebab, kafta kebab, and steak kebabs piled high on a mountain of rice, a plate of humus and pita on the side along with a side salad. The sides come in large portions as well. We are both huge foodies and love to eat but couldn't finish the amount of food. I had it the next day for lunch.<br><br>*This all came out to $14.99!*<br><br>I don't know another place in Chicago serving this much food at that price, let alone quality at that price. <br><br>They were open fairly late and had more traditional options like tabouleh and baba ghanoush. If you're in the area give this place a visit. Your growling stomach will thank you later.", "pics": null}}, {"review": {"des": "One of the best middle eastern food places in Chicago.<br>it opens late, have quick great sandwiches.<br>All kind of middle eastern food is available.<br>The staff is very friendly and helpful.<br>Location is amazing, especially after a night out in Wicker park.<br>Highly recommend this place", "pics": null}}, {"review": {"des": "So good. My favorite shawarma in Wicker Park. Fast, affordable and big portions. Oh, and everything is really fresh! I would advise against the falafel sandwich and go with the shawarma plate. You get salad, rice, pita and hummus and a TON of high quality chicken for a minimal price.", "pics": null}}, {"review": {"des": "This place is 5.freaking.stars!!!<br>Wow. I went at lunch time 12:30 in the afternoon. We found ourselves a seat right away. We ordered 2 meat combo plates, lentil soup and 2 soft drinks. Total came to $40.86. Well worth it. <br>It came with a super fresh salad with vinaigrette dressing, a plate of hummus, 6 pita breads and a huge plate of meat. <br>The service was quick, we waited about 5 min for our salads,hummus and bread and maybe another 5 minutes for our meat plates. It was hot and delicious, the beef kabob was cooked to perfection. The meat was great not tough - just perfect. The rice was great as well and even my 1 year old son had a large helping of the lentil soup (and he is picky). It was more than we could eat so we brought it home and I just finished it. The food is even tasty reheated! Go here! <br>Also, I did visit the bathroom that smelled great and was spotless. That's important.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kyodAgFDwzlm_NAJrstYPg/348s.jpg", "caption": "$40. Worth every penny. Yum"}]}}, {"review": {"des": "We had a falafel sandwich and a shawarma sandwich and they were so delicious. I liked the falafel sandwich more because of the added cucumber. We did get to try the chicken shawarma too and I appreciated that it wasn't dry like most Lebanese places. I would definitely give this place a short for their wonderful food and plentiful portions.", "pics": null}}, {"review": {"des": "Fantastic fast casual Mediterranean cuisine.  The food comes out quickly and in huge portions - you probably got your lunch for tomorrow covered with the inevitable leftovers if you order one of the platters.  All the meats are beautifully seasoned and the side hummus, salads and falafel are all top notch, ensuring you can have a complete and delicious meal each trip.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/A-L_UT9YsRO97-55cRz5lA/348s.jpg", "caption": "Meat combo plate - delicious and giant portions."}]}}, {"review": {"des": "Local favorite spot of mine for Mediterranean food. Chicken shwarma and gyro sandwiches are really good. Big fan of the hummus and veggie platters too.", "pics": null}}, {"review": {"des": "Phenomenal. <br><br>The first time I walked by this place, I thought the name was hilariously basic and uncreative, but this place is all about the food. Casual environment, no frills. I go here probably biweekly. The food is always fresh, delicious, and authentic. Arab bros behind the counter are friendly, and oh my god the falafel and hummus takes the crown. When I'm going for something light, the vegetarian platter is always amazing.", "pics": null}}, {"review": {"des": "Stopped by here randomly and so glad we did. Food was incredibly delicious, really cheap and they gave us a ton of food. Ordered the beef Schwarma and it came with the best hummus I've had in my life. Wish I could give it higher than 5/5", "pics": null}}, {"review": {"des": "An okay place to grab some shwarma or gyros if that's what you're feeling. The quality is fine, and you get large portions for the price. Their rice is actually pretty good and has a nice buttery flavor to it. The meat could use a little more texture and flavor.<br><br>The location itself has ample seating and street parking. It's worth trying out.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sKwhaJyyH1iQK7FyCcCdXw/348s.jpg", "caption": "Gyro Plate"}]}}, {"review": {"des": "Hands down the best Mediterranean Food that I've had in Chicago!  I travelled from the Northside to meet a friend here for dinner. I'd definitely come back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KKUrDmL9gfLqUGE2AO4UyQ/348s.jpg", "caption": "Chicken Kabob plate"}]}}, {"review": {"des": "These cats are Legit - some great Falafel - solid price - some great Beef and Chicken Shwarma - proper.", "pics": null}}, {"review": {"des": "Good but not impressive. <br><br>Went there for a lunch \"tasting menu\" - I got the beef combo platter to sample everything. <br><br>From the meats, the grilled chicken was excellent, the chicken shawarma was also good, the steak was decent but nothing to brag about, and the lamb wasn't good. The rice portion was HUGE - they could've easily cut it to half - I couldn't finish.<br><br>From the sides, the salad was generic and not impressive, but the hummus was decent (though I've had better) and went well with the warm pita.", "pics": null}}, {"review": {"des": "The chicken kabobs have been consistently very tender and delicious.  Enjoy the patio w our misbehaving mutts", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jkKYPAz2xcjg6k4vfSG98A/168s.jpg", "caption": "Yummy"}]}}, {"review": {"des": "Whoa. This place is good, and I mean great Godfrey Daniels good. I went in to get Lentil soup, and it turned into a meal fit for King Henry the 8th. I just had to have the grape leaves, tabouli, Falafel , hummus, and Jerusalem salad to go with it.  Now I'm rolling myself into the car. Everything here is really ,really ,really ,really good. Someone named Adnan said something about being named Adnan, too. I think I'm supposed to mention him. This is for you, Adnan.", "pics": null}}, {"review": {"des": "So tasty and the portions are ginormous! I was so pleasantly surprised when we first came here. Everything was cooked well and I had enough to eat for 3 days. Great food, great value.", "pics": null}}, {"review": {"des": "Ive ordered dozens of times to River North on GRUBHUB<br>Its amazing, simple, fresh, delicious, consistent, solid, addictive, healthy grilled bbq meats and salad!!<br>My favorite Middle East place in the city. Good job<br>Sad thing is Im not super close anymore so I don't order.", "pics": null}}, {"review": {"des": "A favorite whenever i'm down by Wicker Park. The combination plate is probably the best deal ever: steak kabob, chicken kabob, kafta, chicken shawarma, hummus, salad, and delicious rice ($13.99). Definitely enough food for two on any of their orders.<br><br>Their chicken shawarma and chicken kabobs are amongst the best i've ever had in Chicago. It's consistently moist, flavorful, and beautifully plated. If you're going to get something I definitely recommend either of those options.<br><br>Staff are friendly, parking is pretty easy, place is kept clean. Always come by for lunch!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JYpoJhPoF2ihGtWRUawluw/348s.jpg", "caption": "The combination platter"}]}}, {"review": {"des": "This place was the first restaurant I went to when I moved to the US. And 6 years later I still go here on a regular basis (actually, I am about to get take out right now as I type this review :)), because nothing compares to this place. I have tried many gyro and kabob places across the town, but there is nothing like Falafel & Grill. Gyro meat is always fresh and soft (it simply never gets the chance to go bad or hard, because this place is in high demand), their kabobs are fresh and perfectly cooked every time, portions are very generous. I love lentil soup and their mini deserts too. Staff is very friendly and the place itself is extremely neat and clean.", "pics": null}}, {"review": {"des": "Great place for a quick bite of Lebanese style middle eastern food. Beef shawarma was very delicious. I like that they grill the bread after wrapping. This place is on par with Taste of Lebanon in Andersonville. I still much prefer Libanais farther north near Skokie but this place is conveniently located.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Tq3bkWcm9Xo1FxBpUCFBSw/348s.jpg", "caption": "Beef shawarma"}]}}, {"review": {"des": "This place has rockin' falafel sandwiches. And I can't believe they're only $4! Their Jerusalem sauce (tahini, cucumbers, and tomatoes) is some kind of magic. The falafel isn't dry or too oily, but just right. I haven't tried anything else on the menu, but I always come (and brought another vegetarian friend) for the falafel sandwiches. It's one of my favorite places in the city!", "pics": null}}, {"review": {"des": "Yummy flavorful middle eastern food - we ordered delivery and had everything - beef and chicken kebabs were super tender and seriously best falafel I've had since Israel! This place does not disappoint!", "pics": null}}, {"review": {"des": "DO NOT ORDER ONLINE DELIVERY FROM THEIR SITE. Twice I ordered and both times nothing was delivered 1 1/2 hours later. Foolish me to think it would be different the second time.<br><br>Called to inquire where it was and they denied any responsibility.  I was told \"oh, our printer is broken so they didn't get the order\". Not sure how that makes an OUNCE OF SENSE given the web is digital and doesn't require a printer. Their response on the phone was also that \"online web ordering isn't available right now\". Hmmm then perhaps you update your site to state that and NOT accept orders? I understand mistakes happen but this is a pattern. They took zero responsibility, didn't apologize and have not refunded my credit card. Will have to get AMEX to resolve. <br><br>Overall - so not worth it.", "pics": null}}, {"review": {"des": "If it's after 11pm on a weeknight and you don't want pizza or grilled cheese in Wicker Park, Falafel and Grill will become your friend.  The new renovation definitely has left the place much more open and pleasant to sit in.  Customer service is good and fast.  Prices are cheap, portions are large, which is definitely why I go here.  But most of their food is just okay and I have had more exciting falafel pitas five minutes north on Milwaukee Avenue.  <br><br>I've had their lentil soup and it's perfect comfort food.  It could be more flavorful but it is decent for what it is.  The spinach pie is bland and doesn't really have much of a filling, it's pretty sparse.  The falafel is crispy but the pitas are very basic.  Other places have more vegetables you can add into the pita such as olives, potatoes, tomatoes, etc. But the falafel pitas here are pretty bare.  The hummus is good and I really like their baba ganouj.  Their baba ganouj was my favorite and I love a smoky eggplant flavor.  I don't know what their meat dishes are like but I have heard they are good as well.  I think this place has more potential but they're good for what they are.", "pics": null}}, {"review": {"des": "I've been to a couple falafel places in this area and always felt underwhelmed. This spot hands down has the best technique for making wraps - they put everything in a thin pita and toss it around on the grill until the outside has this lightly crunchy texture. That juxtaposed with the soft, warm falafel inside is perfection. No stale and bready wraps here! This is one of the few places that actually puts hummus in your wrap too, most places charge extra. This is going to be my new go to spot for sure.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ct_TMvXiMuL91fPounAumw/348s.jpg", "caption": "Falafel Sandwich $3.75"}]}}, {"review": {"des": "Great food great service. Has become one of my favorite spots to dine!! That's pretty much it. Yelp wants me to write more to make it into a review vs a tip. No tip keep doing what you're doing.", "pics": null}}, {"review": {"des": "I was in search for a great Mediterranean place with my husband; I'm from NY and didn't expect for places to be closed so early! But, thank the good Lord that this was the outlier because we had the best meal!!!! Their mixed platter plate was sooo gooodddd!!!! The waffle fries were crisp and just perfection. And the chicken shawarma sandwich was amazing!!!!! Omgosh and a piece of their Baklava to sweeten those taste buds just took me to heaven! This was exceptionally great!!!", "pics": null}}, {"review": {"des": "This is the best Mediterranean food in all of chicago. The chicken shawarma is the greatest chicken of all time. Everything is always fresh. I drive out of my way at least 3 times a week to grab the chicken shawarma meal or the Mediterranean salad with the chicken shawarma. Do yourself a favor and come here and treat yourself to the most delicious Mediterranean food chicago has to offer.", "pics": null}}, {"review": {"des": "Not going to lie that I was super doubtful and suspicious when I first walked up...the outside makes this place look a bit sketchy. But the food is really good. The salads are large and refreshing. Falafel is hearty. Spinach pie is sizable and flaky. I didn't love the grape leaves but I'm not much for grape leaves. Hard to beat $1 pita!!! Staff is friendly and I like that you can do pickup and delivery as well.", "pics": null}}, {"review": {"des": "Middle Eastern food is one of my favorite cuisines and I must say I was really impressed with this place. Really good food, both the chicken schwarma and chicken kabobs were on point. Will definitely be coming back!!", "pics": null}}, {"review": {"des": "YUM. So much food for a great price. Probably the best gyro meat I've had in Chicago!", "pics": null}}, {"review": {"des": "I drive 12 miles, 2-3 times a week just to eat here. <br><br>The food is amazing and so are the two tall brothers :)", "pics": null}}, {"review": {"des": "Great corner restaurant with a good gyro sandwich.<br>Quick service a great place for a quick lunch.", "pics": null}}, {"review": {"des": "This is our favorite Middle Eastern place since 4 years! My husband is from Dubai and his go to food is a good shawarma! The service here is quick and friendly, the food fresh and tasty! Don't forget to get garlic sauce on the side! Love this place so much thanks for being awesome!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XW2MB0NbprjUJ-1NHv1jvg/168s.jpg", "caption": "Lentil soup, hummus, babaganoush, salad and pita"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0e-Ph78jXawFQzcpOWNnSg/168s.jpg", "caption": "Combination Grill Platter"}]}}, {"review": {"des": "Has this place had a change of ownership? The chicken shwarma we got tonight was just awful - smelly, greasy and awful. And what happened to the loaded shwarma potato?<br><br>I'm a wee bit heart broken.", "pics": null}}, {"review": {"des": "First time I came here was late at night and I was in the middle of moving apartments and my kitchen was still unpacked but I was starving. Falafel and grill was nearby and my brother had previously told me this place has super cheap falafel sandwiches, and I'm into falafels and not paying lots of money so I made my trek in the dark rainy night.<br><br> Dramatic story aside, this place is delicious and affordable and you get so much food and quickly. I love the falafel as well as the chicken schwarma plate, that plate will feed you for two meals so if you want good food quickly and at late hours, go here!", "pics": null}}, {"review": {"des": "Oh Falafel & Grill, how I've missed you.  Was down in the neighborhood yesterday to see a show at the Den and decided to stop in here.  Had the falafel sandwich.  It was definitely the best falafel sandwich I've ever had and may well be in the top 10 best things I've ever eaten.  I don't know why it was so delicious but it was.  I loved the grilled pita and it's simply falafel, pickles, tomatoes, tahini, onion, parsley.  But it's that magical blend of spices that sends this dish skyrocketing.  I just love this place.  Not a fan of Wicker Park but it's worth the trek just for this place alone.", "pics": null}}, {"review": {"des": "I was looking for a place to eat and choose Greek. This is a nice place. There is so much food that it's almost too much. The gyro platter comes with so many sides, but it's all delicious and reasonably priced. I just wanted a gyro sandwich but somehow missed that on the menu that was a bit hard to follow. But it was all good and plentiful. If I make another record shopping tour of Chicago, I'll look for this place.", "pics": null}}, {"review": {"des": "This is no ordinary kabob place. Everything here is really delicious. <br><br>It's a great place to get yummy, well-cooked food fast and for cheap. The portions are big, so you won't be leaving hungry. The environment is nothing special but it's clean - which is important. I had the combo and gyro plates on separate occasions and they were really good. The chicken kabob in the combo plate was so joocy, my fav. <br><br>If you just want a snack - the hummus is to die for. Super creamy and fresh. This has become my new go to for good, fast, slow-cooked food.", "pics": null}}, {"review": {"des": "I ordered different falafel sandwiches for the entire group and got all the same. On top of that, falafel was cold. Rice was okay. I would never ever come here again. It was beyond disgusting.", "pics": null}}, {"review": {"des": "I used to love this place, but since their remodel they will not customize your sandwich or plate nor will they work with you to accommodate any food allergies. There are plenty of other places to get chicken shwarma in Wicker Park and this place never had the best falafel to start with. Take your business elsewhere; they definitely didn't want my $$!", "pics": null}}, {"review": {"des": "Wowwwwww!!!!!!!! <br><br>These guys only know two things:  <br>                   <br>                 GOOD & FLAVOR!!!!!  <br><br>I have been wanting to come here for over a year now. I have always been so busy coming from somewhere else. <br><br>Everything tastes so fresh , and so perfect. I would definitely be back. The staff is very friendly even though they are chill and laid back, they are welcoming once you start talking to them.<br><br>In addition, the main thing is that they care about making great food!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7_z-bzKiC9xYH4EntsYTpg/348s.jpg", "caption": "I will definitely be back!!!  I love the healthy options.   Their Tazaki is great!"}]}}, {"review": {"des": "Came here after a wedding with a few friends and we enjoyed our food. My friends got the meat platter and hummus and I got the sandwich. The hummus and the rice was delicious. Lots of flavor. The meat in the platter was a bit dry or a little undercooked. And the meat in the sandwich was a bit dry as well but the flavor in all of it was delicious and made it worth it. I would possibly come here again if I was ever in the area again.", "pics": null}}, {"review": {"des": "Addictive!<br><br>Chicken shwarma and lentil soup are excellent. I was previously going to a similar spot nearby but this has got 'em beat.<br><br>They used to have some sorta hot sauce out on the tables, I hope they bring it back...", "pics": null}}, {"review": {"des": "I love this place!  I come here at least once a week.  It's the best Mediterranean food in the neighborhood hands down.  I just ordered schwarma garden on division and it doesn't even come close.  Consistently good and a lot of food for the price.", "pics": null}}, {"review": {"des": "Quick and easy! Such great food, and best falafel I've had in a while!!<br><br>Friendly people and good vibe! Salad was nice and refreshing, huge portions! <br><br>Glad to have crossed this off my list, I will definitely be coming back!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4FeL9GaAKYkN-SPVYxAnSQ/168s.jpg", "caption": "Falafel sandwich! This is only half. Was so hungry I forgot to take a before pic! Sorry"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VUdyBM8ljqfsi3eHtDGyKQ/168s.jpg", "caption": "Veggie platter, so big I had to get a to go box!!"}]}}, {"review": {"des": "I had very high expectations from this place and quite honestly am a bit sad to write this review since I feel like I didn't get the write experience from the food.  I ordered the beef shawarma and quite frankly speaking, the shawarma has no taste and I double checked my palate and it wasn't me but the meat itself was extremely bland.  To top that, the sauce was bland and the bread was extremely chewy and old?  I was not at all satisfied with my sandwich, even after requesting garlic sauce (but I think they missed adding it since I didn't taste garlic but just some mild creamy sauce filled to the max).<br><br>Needless to say, this isn't a place I would come to for a sandwich.  <br><br>The falafels might be good but based on just the shawarma sandwich I would give this a 1 start place.", "pics": null}}, {"review": {"des": "So if you want gyros no pita, they say no they cannot do it. They will look at you like your crazy. I lot of people do no carbs!! So I had no choice but to get the pita. I wasn't asking for more meat, just no pita. Unprofessional!", "pics": null}}, {"review": {"des": "This is our go to place for quick, cheap, healthy, easy take out dinner. Love their falafel sandwich and chicken schwarma sandwich. The crew is always nice too.", "pics": null}}, {"review": {"des": "Not bad, not bad at all.<br>Got a late-night craving for falafel and decided to try this place out. The menu is pretty limited, but the prices are very reasonable.<br>Falafel: delicious, my favorite thing I tried! Crispy outside and well-seasoned inside, plus it was piping hot out of the fryer. The falafel comes with 2 dipping sauces, which I believe were a garlic sauce (it was a creamy white sauce) and a hot sauce (orange sauce that I did not try, so can't confirm).<br>Hummus and pita: just okay. The hummus left an interesting aftertaste that I didn't love, but it came with whole chickpeas on top which I thought was a nice touch.<br>Jerusalem salad: fresh and crisp with plenty of parsley, hit the spot. I wish it was a little less liquid-y though.", "pics": null}}, {"review": {"des": "On vacation, so why not try different spots where you typically don't see in the bay area ? I'm always down. <br><br>During our trip to Chicago, I noticed a lot of eateries with shawarma, almost in every corner or maybe it was just the area I was in had multiple spots that sold shawarma but I was diggin' it! <br><br>I ordered their chicken shawarma wrap with their curly fries. I wish we had this back in the bay area ! It was so so good and it's such a simple concept too. <br><br>Prices are inexpensive and the portions were pretty filling. CASH ONLY! Service was nice and food didn't take too long. <br><br>Definitely a spot to stop by if you're around the area, especially if you're going to Emporium !", "pics": null}}, {"review": {"des": "So yummy! <br>The chicken sandwich was tender juicy and hot to perfection. I ask for a side of hot sauce which totally compliments any dish.<br>The hummus are fresh, the salads are plentiful and the place is clean efficient and quick with orders. Staff is friendly and they know how to work the grill.<br>THANK YOU for this wonderful piece of heaven.<br><br>I look forward to coming here after a grueling hour and a half of Bikram yoga.  It's the perfect ending to a great workout (across the street).<br><br>Absolutely recommend this place to anyone wanting simply fresh and Delicious Lebanese fare.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FV85bt2uDbqdQlR89rQIvg/348s.jpg", "caption": "Chicken sandwich with a side of hot sauce!!!!"}]}}, {"review": {"des": "The shawarma, falafel sandwich, and the hummus are perfectly done. As well as everything else. I can't resist the temptation of the shawarma chicken sandwich. It has a great garlic sauce that doubles the pleasure of it :) and it is affordable!", "pics": null}}, {"review": {"des": "Every time I go to falafel and grill it always seems to be full of young, slim, and attractive looking people. Why not go back? It's niiiiice (Borat voice). Plus, the falafel sandwich is $4.14 with tax included", "pics": null}}, {"review": {"des": "Thought the food was going to be a 10+ according to the reviews people have made, but to my liking it wasn't that great. I had the 6 piece falafel which are ground chickpeas with parsley and onion served with tahini. My results after biting into one was that it was dry and not flavorful; the tahini sauce was just watered down with no flavor. Those were just awfully dry! Then I had the Chicken Shawarma sandwich which consists of thinly sliced chicken breads cooked on a slow rotisserie. Served with tomato, pickle and garlic sauce. Now I'm aware of the traditional one with the pita bread but this one was with a flour tortilla? (Not sure) but all I know is that it wasn't what I wasn't expecting, chicken needed more flavor, the pickles wished they had them cut into small pieces and less grease at the end of the flour tortilla. Just not my cup of tea!", "pics": null}}, {"review": {"des": "I work near here and this place is a staple for everyone at my job. Good price, good food. Some days its mindblowing, but I cant figure out who it is that's working when its mindblowingly delicious. (Aka its always good, but sometimes they get it so perfect that I feel like ive just dived over a waterfall into a pool of savory desiccance.)", "pics": null}}, {"review": {"des": "Happened upon this place by accident and I am so pleased! The kifta sandwich and gyro rice plate were on point! (And they were generous with the extra garlic sauce). For the price, this is quality you can't beat. The seating is nothing special, kid friendly with high chairs, and a full restaurant at 5:30... Generous portions, the taste you'd expect, and all at a great price! (I'm pumped they do delivery).", "pics": null}}, {"review": {"des": "If anyone is the person to judge authentic tasting Mediterranean/Middle Eastern style food, I'm your girl. Having used to work at an authentic restaurant in my college town, and traveled to a few Mediterranean countries, let's just say I'm a tad hard to please when it comes to my hummus, shawarma, and tabouleh. THANK GOODNESS this place exists, and I live so close, because my oh my is it DELICIOUS!!! I love how big the portions are and that I typically end up with enough food to eat for a second meal. In addition, how great that they don't close until midnight ON A WEEKDAY?! I mean, I feel bad for the employees, but lucky us! Just when the 10pm-12am craving hits... Falafel & Grill is here for you. Don't try anyone else near by because they don't compare!", "pics": null}}, {"review": {"des": "I'm all about good food at a reasonable price. No one in the city does it better. <br>Everything is totally fresh and they have amazing sauces. <br>I always over eat here... food is great and they give you a ton. <br>I don't live in the neighborhood and pass many similar type places on the way. Tried them all<br>F&J still the best", "pics": null}}, {"review": {"des": "The best chicken shawerma EVER!!! I crave this place at least once a week. The chicken shawerma plate is my go to which comes with a very large portion of chicken & rice, hummus, salad, and pita bread. If you are a garlic fanatic like me, order a couple sides of their garlic sauce. You will not be disappointed... I want to dive into a giant pool of the stuff!", "pics": null}}, {"review": {"des": "Here's the short review: Better than Sultan's, although more expensive. Vegan-Friendly and outdoor seating. <br><br>First timers:<br>- If you're not starving, go for the Chicken Shawarma sandwich<br><br>-If you're about to die of hunger, go for the Chicken Shawarma Plate with 3 pc Falafel on the side<br><br>I'm a regular and haven't ventured into the beef items or kababs, but those look extremely good too. <br><br>Cons:<br>-None. Enjoy!", "pics": null}}, {"review": {"des": "I have driven quite a distance, in rush hour traffic mind you, overcome with craving their food. Their menu is short and sweet, I haven't had a single thing I don't like, the chicken shawarma wrap is my go to and their hummus is incredible.", "pics": null}}, {"review": {"des": "Newly renovated space, Same Amazing food!! I love their homemade hummus and fresh Pita! The falafel is perfectly cooked every time, I love their falafel sandwich! Salads are crispy & full of fresh veggies. Can't go wrong with anything on the menu.", "pics": null}}, {"review": {"des": "Best middle eastern food on this side of town. One of my favorites in the entire city. I have never tasted hummus as good as Falafel & Grill, so much that I crave it multiple times in a week. The cost is on point and I would highly recommend anyone and everyone to eat here...at least once a week. <br><br>It is truly the best.", "pics": null}}, {"review": {"des": "If you've ever been in Wicker Park asking yourself 'I wonder where I can get the most delicious, greasiest, fulfilling middle eastern cuisine on a budget' the answer you seek is Falafel and Grill. <br><br>I've had a smattering of things here: gyro, gyro salad, gyro plate, lentil soup. It's all So Good. I don't know the technical distinctions, but they have both the shawarma style and the gyro style. I prefer the pressed gyro meat, but if you like the shaved shawarma options with more of the separated pieces of meat, they have that too. <br><br>This place is also open at some crazy hours, so it's perfect for all times of day. It's small, quaint, and no frills, and you can get some of the best food around here.", "pics": null}}, {"review": {"des": "Terrible service. Just awful. 35 minutes for the number one item on their menu. Given a half assed plate of bad food.  No sauce. Bad spoiled salad. Don't go here.", "pics": null}}, {"review": {"des": "This place is my go-to spot near my neighborhood for Middle Eastern cuisine. I recently stopped in and was surprised to see that they completely remodeled the interior. It looks great! I suggest their chicken shawarma, and love their tahini sauce. I've also had their hummus and pita, and my boyfriend likes their falafel. The service is quick, the staff is courteous, and I've never seen the inside empty.", "pics": null}}, {"review": {"des": "There is no better middle Eastern food in the city. Period. The owner is also the nicest human around. I feel lucky this place is in Wicker Park", "pics": null}}, {"review": {"des": "One of the best falafel spots in Wicker Park/Bucktown. I always get the 6 piece falafel and the falafel wrap. The place is always busy and food is always good.", "pics": null}}, {"review": {"des": "Holy smokes.  I got the veggie combination plate and it was soooooooo good.  The falafel were fluffy clouds of deliciousness encased in a satisfyingly thick, crunchy shell.  The pita was also fluffy, but more in a chewy way.  The tabbuleh was mostly parsley and FRESH.  The hummus was really smooth and tasted great.  The grape leaves were good but not mind-blowing like the other stuff, and the Jurusalem salad was fine, but at that point, I was so stuffed from the giant portion I didn't really care.  I would 100% come here again and tell my friends.", "pics": null}}, {"review": {"des": "I have been coming here for over a few years now. I came with my coworker for lunch to try it. It is one of my favorite places to go for Mediterranean. A local establishment. Very casual. Very inexpensive. They recently renovated the kitchen and dining area, providing more tables for eating. I typically get either the chicken or steak kabob plate, the plate comes with salad, rice, pita and hummus. A lot of food. I would definitely recommend this to anyone.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_7oEZZDVZRlONkAnpMnltQ/348s.jpg", "caption": "Side Salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/p7o_dZcsRP6cbSMwE9HdrQ/168s.jpg", "caption": "Hummus"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6XuKGl6_HPvk4PI7IH1dEg/168s.jpg", "caption": "Beef Kabob Platter"}]}}, {"review": {"des": "COST:<br>$6 (Gyro Sandwich)<br><br>Pretty standard gyro sandwich that was amazingly delicious and tasted fresh. My favorite part was probably the crisp onions. They gave huge servings and are very accommodating to your requests. THE perfect alcohol soaker so to speak after a night out.", "pics": null}}, {"review": {"des": "This has been a longstanding favorite for a falafel wrap...I literally have had at least 500? 1,000? 1,500?  I really can't estimate.  I crave them when I'm happy, when I'm sad, when I'm bored, when I'm cold, when I'm hot, when I'm alone, when I'm with friends.....Needless to say, I find them delicious, fresh, hot, nice and large and always fast.  Other high notes: the combination platter is very large and is either made for sharing or taking leftovers home and the shawarma chicken has never done me wrong.  Pretty much everything I've had over the many years I've been happy with but the wrap is the STAR.  O and they now have waffle fries. <br>:)<br><br>The key staff have been here since the place has been standing so I suspect its family owned.  They might not fall all over themselves for you but they are polite, friendly enough and always get your order right. On the plus side, the renovation last year really made eating in slightly more pleasant. <br><br>d&%* it! Now I'm hungry for a falafel wrap......", "pics": null}}, {"review": {"des": "A total taste explosion!  The food is seasoned perfectly and every dish I've had is amazing.  My favorite is the chicken kabob - in a platter or over a salad.  Speaking of salad - the tabouleh is awesome as is the fattoush.  Chicken shawarma is incredible. Everything is good here.", "pics": null}}, {"review": {"des": "Note to self: Do NOT over-order here.  The entree plates alone are overwhelming and fantastically portioned.  Yes, I'll want to order stuffed grape leaves and lentil soup along with it...DON'T.<br><br>This may be some of the best, cheapest, quickly served and flavorful Middle Eastern food in the Midwest.  Chicago's exploded with falafel restaurants: IDOF (good, but very corporate), Falafill (my former fave), Naf Naf (overpriced and limited menu).  If you want authentic, visit Falafel & Grill.  Everything is seasoned just right--the chicken, beef--and the hummus is the best in town.  Absolutely amazing portions.<br><br>This is a falafel stand, and space can get tight with only a handful of tables.  It's also void of charm--bright flourescent lights, hand-written \"No bathroom\" signs--but it's clean and just what this gritty intersection needs.", "pics": null}}, {"review": {"des": "This is what my dreams are made of. No joke.  I was wandering Wicker Park and stumbled upon Falafel & Grill and decided to give it a shot.  Whenever I think of this place I am saddened because there is nowhere you can get quality Middle Eastern food like you do here.  The chicken shawarma is quite possibly the best sandwich I have ever eaten in my life.  Ingredients are fresh and flavorful.  There's baklava as well, and maybe it's just me, but I find it to die for.  Last November when I was here, I purchased a variety box of it to go and a few squares to bring home.  I ate all of it on the train ride home.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fevajg_a3AXo_Jtym8LJrA/348s.jpg", "caption": "Chicken shawarma wrap and baklava"}]}}, {"review": {"des": "I LOVE this place. We get this delivered almost every weekend. The hummus is the best I have ever had. Also, the falafel and gyro are delicious. This place can't be missed. Yum.", "pics": null}}, {"review": {"des": "Honestly, who could possibly dislike Falafel & Grill?? This place has quick, cheap, and tasty food--always satisfying hands down like a feather coat.<br><br>I honestly think they have some of the best hummus in town. Honestly, their hummus is FLAVORFUL, fresh, and definitely packed with a zesty taste of garlic that I just CRAVE constantly. They also have some of the freshest and cleanest tasting tabouli on the west side. The veggie combo is just WONDERFUL--and at a legit unbeatable price. You get falafel, rice, hummus, tabouli, salad, and pita--all in one bang. <br><br>I am a HUGE fan of Falafel and Grill and am so excited to have this place down the street from. I anticipate getting to \"regular\" status here very soon.", "pics": null}}, {"review": {"des": "Consistently fresh, delicious food served fast and happy. Love the kabobs, lentil soup, salad etc. My young son craves the shwarma sandwich. Try it!", "pics": null}}, {"review": {"des": "This is my favorite middle eastern fast food restaurant. The meat is perfectly seasoned. The beef shawarma plate does not disappoint. They serve it on a bed of rice and red onions. Yum!!! The entree comes with pita, hummus and a side salad for only $11.99. Another visit I tried the combo plate, for $13.99 you get to try everything (chicken kabob, beef kabob, kifta kabob and chicken shawarma). Try their falafel and waffle fries too. I did not dislike anything I tried here. This is the real deal deliciousness. Ask for the hot sauce and tahini sauce to eat with your meal. (Mouth currently watering)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5WOu6AFFjqH8gXRMRKW95Q/168s.jpg", "caption": "Beef shawarma plate comes with everything except the waffle fries. Worth the price!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Uh2qjGcOxYVqd6lHZbuzYw/168s.jpg", "caption": "Combo plate! I substituted the chicken shawarma for the beef shawarma. Delicious!"}]}}, {"review": {"des": "Get the meat combo, and lentil soup. We love coming to this place for take outs. One of the best places for Mediterranean food. Reza's is my top", "pics": null}}, {"review": {"des": "The catering from Falafel and Grill is the bomb!  I ordered food for a group of 15 but probably could have feed double that amount with the portions as they were.  The price point was incredible and the food was on time and the perfect temperature.  Every single item was super fresh and so flavorful and my team went nuts when they ate it. This food is totally made with love.", "pics": null}}, {"review": {"des": "Ngl, looking at this place from the outside, I wasn't expecting much. We checked out the menu  and decided why not. So, we ordered a gyro sandwich. The wait wasn't too long, and it was about $6-7 for the sandwich. <br>The sandwich itself really was delicious, though. It was basically a gyro. The meat was so juicy and well-seasoned. It had what I assumed was the usual tzatziki sauce (or something similar) on it that really added some extra flavor. There was a lot piled on, so eating it was a bit messy, but it was worth every bite. <br>If you're just stopping in for a quick bite with a friend, I'd recommend getting one and splitting it! It's filling enough to be a light snack so that you could still eat a meal later. They had plenty of other options that I hope to come back and try, though, if you're looking for a casual dinner spot!", "pics": null}}, {"review": {"des": "This place is amazing. Very very good shawarma and falafel and at extremely low prices, especially for the area its in.", "pics": null}}, {"review": {"des": "Baklava yummmm! I tried their combination plate and wasn't disappointed. Great price, a lot of food! The hummus is mouth watering", "pics": null}}, {"review": {"des": "Best middle eastern food you will get in the city and maybe in all of Chicagoland. The falafel is crunchy and flavorful and the beef shawarma is amazing! I was expecting this place to suck but it was a pleasant surprise. I always stop by when I'm in the area.", "pics": null}}, {"review": {"des": "I think this is the best place that serves falafel sandwiches as you find it in Middle East.<br><br>The sandwich is rich in flavor and not dry which is really important to make it nice and juicy with tahini sauce.", "pics": null}}, {"review": {"des": "I LOVE this spot, one of my favorite in the city. The food is so good and you get your $ worth.", "pics": null}}, {"review": {"des": "Fresh food fast at reasonable prices. limited seating so not good for large groups. Street parking only and do not park in the Jewel parking lot they will tow", "pics": null}}, {"review": {"des": "You don't need to be drunk to appreciate good Mediterranean food, but it doesn't hurt. This place gets swamped by the bar hopping party crowd about two hours before close, great location for business. <br><br>The falafel, as their name implies, is by far their forte here. It's crisp outside, flavorful and soft inside, and an absolute delight at like $2/portion. The spinach pie was a little disappointing, and tasted like it was made with frozen spinach. Chicken shwarma wrap was stingy on the sauce, but good quality and a great portion for under $7.", "pics": null}}, {"review": {"des": "This place is pretty darn dope. I occasionally work in the area and this place has been my go to countless of times. Their wraps are delicious and they make a pretty bad ass gyro. Plus they are open late which totally works if you're checking out the nearby bars and want a bite to eat after. Super friendly staff. Although I have to admit that they are pricer than most places. Food is delish, so I can't complain. :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dFtJ9Fxx5RHTltZl2tPShw/348s.jpg", "caption": "Lifts wrap $6.91 plus tax"}]}}, {"review": {"des": "Walked by the place a million times and have stopped by twice. Located right across the street from the Jewel (though don't even think of parking in the Jewel lot and walking over unless you want to be towed), it's a pretty fast casual, unassuming gyro shop. First time I got a beef shwarma with just the wrap. Second time was the falafel wrap. Both were decent, inexpensive. Probably a little bit drier of a sandwich than I'm used to for each and not the biggest wraps on the planet, but for the price as certainly fair.", "pics": null}}, {"review": {"des": "I have been here twice. It's a solid choice. They are clean, reasonably priced and very fast in service. I recently had their loaded baked potato which I think is a new item/ seasonal for them. It was really HUGE and totally delicious. It had melted shredded cheese, sour creame, green chives and loads of chicken shawarma, it is enough to share and paired perfect with their lentil soup!", "pics": null}}, {"review": {"des": "What a sight for sore eyes! Read on knowing this is more reminiscence than review. <br><br>I came here the first time while on a long term interview (read: working for free/cheap) for a position I eventually won. I was working in the Loop and staying at the Palmer House. One colleague had the hotel do his laundry (at a paltry sum of $100 per pound!), and was reimbursed by the hosting company. I opted to hop on the blue line, escape to an actual neighborhood where people live and do my own laundry. So I did. I'd heard Wicker Park was a nice place. Well, at least a movie was named after the 'hood. That's something! <br><br>So after dragging my butt from the Division stop around the long way to Sudz at Milwaukee and Ashland, I tossed in my laundry and started walking around looking for nourishment. I found Falafel & Grill right away and my eyes lit up. I had not had decent falafel since my last visit to Mamoun's in NYC, where I used to find in line on a weekly basis back when I lived there. It had been too long. <br><br>I walked in to find unimpressive surroundings. The day was leaning towards chilly and gray, and the decor fit in with the weather. Still, I learned to not judge a restaurant by its looks a long time ago. I'm glad I kept an open mind. It's been a few years now, but I know I ordered the falafel sandwich, if not a platter. I was not disappointed. In fact, I remember smiling. I was in my own little world, doing laundry and now eating in a small dingy restaurant in an unfamiliar area in an unfamiliar town. Maybe it doesn't sound like fun to you, but I was loving the experience of being out of my comfort zone. Besides I was listening to tunes and eating one of my favorite foods done well. <br><br>I now live in Chicago but live on the other side of town. I haven't forgotten this place though. Every time I see that intersection on a map, I think back to that time and that somewhat depressing shopping plaza. With any luck, I'll be moving to the west side next month. Expect to see me here at a stool, staring out of the window watching the world pass by as I happily eat some fantastic falafel.", "pics": null}}]}