{"name": "farmhouse-chicago-chicago", "reviews": [{"review": {"des": "I visited Farmhouse years ago, but at the time I was a restaurant employee who responded to reviews on the Yelp for Business side. I wasn't sure if I was allowed to be leaving reviews, so at that time, I was never reviewing spots I was trying out! My point is that I knew I loved this place years ago and never documented it on here, so when I visited Farmhouse recently, I was excited to experience it again!<br><br>My boss made a reservation for a group of about 11 of us for a Tuesday night at 6:30pm. We were seated right away and greeted warmly by both the chill farmhouse feel of the space and by our waiter. <br><br>Every one of us ordered a drink, from non-alcoholic to the most alcoholic possible, and every single person was pleased with what they received. The drinks here are not only strong and beautiful, but they taste unique as well. During this time we also grabbed a bunch of appetizers for the group, like a few charcuterie boards. I highly recommend these for large groups... or even for two!<br><br>Then of course came everyone's favorite part of the meal: entree time. I'd eaten quite a few appetizers, so I wasn't looking for an overly heavy entree, and decided on the fall vegetable flatbread. It was a great pairing with my cider sangria, because it felt like a very autumn-y dinner setup. If you visit before the harsh winter hits yet again, these are my recommendations for a very fall-filled meal!<br><br>Thank you for the hospitality, Farmhouse! I'll be recommending you to all groups in the future.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mdeiJpU2-MTIlpkpflJ0fg/348s.jpg", "caption": "Cider Sangria, switched the vodka for rum"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lka2vnNNiGd3QFfseduQkw/168s.jpg", "caption": "Fall vegetable Flatbread as my main course"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qqwMKaHAGMwDnzC47tkvlw/168s.jpg", "caption": "Cider Sangria (switched the vodka for rum), and Fall vegetable flatbread as a main!"}]}}, {"review": {"des": "I visit Chicago a few times a year and have ate at Farmhouse about 1/2 dozen times over the years, mostly for brunch or lunch. I like restaurant variety when visiting Chicago, but Farmhouse has been a quick and easy meal that has been consistently good, until my most recent visit. I want to give them one star, but history and properly cooked steak bumps them up to two stars. <br><br>This past weekend, we visited for brunch. My husband isn't eating many carbs right now, so ordered the steak and eggs and asked for a veggie side instead of the potatoes. The server offered cooked spinach and he agreed to that suggestion. I ordered the frittata and a side of toast. I didn't think much of the $2 charge for the toast, as an upcharge for bread is common. <br><br>It took FOREVER for the food to arrive. We were increasing hungry and crabby as we waited for the food. Finally, when it arrived my husband's steak and eggs were cooked properly, but there were potatoes on the plate, no spinach. He waved down our server who gave us attitude when he asked about the spinach. Our conversation (paraphrased) - Can I get you something else? Yes, please bring the spinach.  Aren't you going to eat the potatoes? No - I would like a vegetable. Well, that is going to take time to cook. Can I get a salad then - that has to be quick? Ok. 5 mins later - and under-dressed, under-seasoned salad arrives. <br><br>I started eating - I could see the edge of my frittata was brown. Not the end of the world - could be crispy cheese. I bite into it and the entire bottom was overcooked. Nothing like the taste of overcooked eggs! To add - my salad had very little dressing on it and the $2 toast was super thin, small pieces. Realistically, probably all I would eat, but overpriced for what I got. Seasoning was off on everything, so asked for salt and the server acted irritated with this request. <br><br>The manager on duty checked with us and we only brought up the eggs, as it was not worth going over the list of issues. He offered to redo my eggs, but I was so hungry I didn't want to wait. <br><br>The server apologized (a little too little, a little too late) and we were offered free dessert, which we declined.  <br><br>Unfortunately, Farmhouse will no longer be on our list of quick. easy and good food.", "pics": null}}, {"review": {"des": "We started our brunch day here. Wanted something not the same as our usual spots.<br><br>First off the portions are pretty big here. If you really want to share you can, or if you want to split your food and steal food from others GO FOR IT!.<br><br>The front is a little drafty by the door so be warned. <br><br>Pro Tip: Try the Mead Mimosa its honey and bubbly, taste GREAT!<br><br>The Cinnamon  Pecan Monkey Bread with the caramel apple sauce was really good! However, while the portions are large this piece of bread was not as big as you would think. We had a group of 5 and some people got way less :)!<br><br>For main courses, our table went from Farmers Breakfast, Steak & Eggs, Vegetable Hash and the Frittata. My favorite was the farmer's breakfast. The veggie has had GREAT flavors! <br><br>This is not a real negative its just a negative to me, the person who only eats Hinez Ketchup they dont have real ketchup!", "pics": null}}, {"review": {"des": "Farmhouse serves up fresh, local, sustainable midwestern fare in a cozy environment.<br><br>I've been on a couple of occasions and love this spot! Most recently, I ordered the BBQ braised short rib, which comes served on a bed of creamy turnip mash. It's so good. The bbq sauce is the right amount of tangy which paired perfectly with the short rib and turnip mash. <br><br>I also tried their beer battered Wisconsin cheese curds (perfectly Wisco fabulous) and their warm Bavarian pretzel (with that Wisconsin cheese sauce...oh my!). <br><br>They also make killer cocktails. I ordered their brown dog old fashioned, which is an old fashioned made with both bourbon and oaked brandy. Being someone who typically likes her old fashioned strictly bourbon, I was pleasantly surprised by the addition of the brandy. It was fantastic.<br><br>Get to it!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TxJqOyzZQg7Jvzkoh3jOZg/348s.jpg", "caption": "Mac & cheese"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NcKfrHqyrIsLOg0JtaMxfA/168s.jpg", "caption": "Pretzel"}]}}, {"review": {"des": "I've been to Farmhouse a few times, and I still can't get over how big their big portions for reasonable prices, not to mention their commitment to local and sustainable ingredients. <br><br>Things to know: they source their ingredients from Midwestern farmers, have their own hard cider, and serve some ridiculously good cheese curds and steak (that you can cut with a dang spoon). I've tried/shared several cocktails, appetizers and entrees here and have never been disappointed. Of course, their menus change seasonally but they seem to usually have dinner staples showcasing fish, steak, pork, chicken, and pasta. <br><br>Again, come hungry and get the cheese curds!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oX4Nu5m87VQPEYs9RD-tPA/348s.jpg", "caption": "Sage Against the Machine"}]}}, {"review": {"des": "This was awesome find! The hubby and I ordered the cheese curds, sage against the machine, the catalpa pork chop, and chicken special. Let me start by saying the cheese curds were soooooo good! Two sage drinks had me a bit tipsy. Although I originally ordered the Cider Sangria the sage drink was so much better. The pork chop was enormous! I had plenty to take home in my doggie bag. The hubs had the chicken with chicken sausage on a bed of swiss chard. Minus the mustard seeds in the chicken dinner he rather enjoyed his dinner. Unfortunately we did not have any room for dessert but maybe next time.", "pics": null}}, {"review": {"des": "Cute brunch place in the River North area. The decoration seems like an artsy but welcoming vibe, kind of like an artsy farmhouse. There is both an upstairs and a downstairs area, both have bars, so the restaurant is a lot more spacious than at first glance. We came for Sunday brunch - it was really lively but not packed and there wasn't much of a wait. <br><br>The menu is fairly short compared to a lot of brunch places, and they have a farm to table vibe. The options are really friendly if you have dietary restrictions, including a ton of vegetarian friendly options on the menu. Service was really friendly and attentive, and very prompt. A lot of the menu was some updated takes on brunch favorites, like a sweet potato hash or a mushroom tarte. However, definitely missing brunch staples such as pancakes or omelettes. I think the options are more apt if you are looking for for interesting breakfast options, but not necessarily looking for a typical heavy brunch fare an selection. The portion sizes here are fairly reasonable - not overwhelming amount of food, but those that are used to the huge portions at other locations might be a bit disappointed. <br><br>I got the sweet potato hash which came with well sauteed pearl onions and vine tomatoes. Really solid and lighter option, although the egg was a little too well done with a firm yolk. Their hot sauce options as well are organic takes on the typical bottle of Tabasco. Other favorites were the farmer's breakfast which came in a very large portion, and the white mushroom flatbread. Most of the dishes were 13-15$ range. Overall the menu definitely leans savory (there was only the french toast if you like sweet options). <br><br>Really solid vibe and great food, overall Farmhouse is a pretty fun brunch option.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kmBS9ypNODEF9oDaytkrZg/348s.jpg", "caption": "veggie hash"}]}}, {"review": {"des": "Straightforward, no-nonsense \"farm-to-table\" style breakfast place.  We had the cinnamon pecan monkey bread, the farmer's breakfast and the open-faced breakfast sandwich.  The food was pretty good but nothing to call home about.  The portions are not massive like certain other brunch places but not tiny.<br><br>The main reason for docking a star from 4 is because the food took forever and a day to arrive.  Not sure what was going on.  We usually do not need to refill our parking meter when we get brunch (we usually put in about an hour) but this time we had about 10 minutes left on the meter when our food arrived.", "pics": null}}, {"review": {"des": "It's soooo cheesy...in the best way possible! If I get the chance to come back here, and I hope I do, I will be ordering all things cheese. To start, you can bet I'll be ordering the beer batter cheese curds. OMG so so good. They are greasy, but not too greasy and melt in your mouth with rich rich flavor. Served in the cutest little metal bucket, I started with just a few and then I kept dipping in and couldn't stop! I was out of control. And, if you need more cheese, which I will never turn away, there's the baked mac n' cheese. Holy heck the baked mac n' cheese was the best I've ever had. It was wonderfully crunchy on top, with ooey gooey goodness packed inside. I'm not sure how many different cheeses were melted together, but some were creamy and rich, and in the end I had to make myself stop. I could have kept going, but my pants were so tight and my stomach was swelling it was time to finish. <br><br>Good thing I also ordered the Amish chicken soup. It was full of veggie goodness and fresh white chunks of chicken. It had kale, celery, carrots, and crimini mushrooms. Not overly seasoned and fresh. That was my saving grace that night. <br><br>I also had the opportunity to try the soft buttery pretzel. It was the perfect meal for me. To be honest, the appetizers are big enough to make up an entire meal. Just get them all. You will thank me later.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LvKJQG9MWBpJNgQcEqXdCw/168s.jpg", "caption": "Baked mac'n'cheese"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/E_ri24Aa70kl5_EwR9Kbzg/168s.jpg", "caption": "Amish chicken soup"}]}}, {"review": {"des": "Great food and great service! I love the idea that they locally source their food. Fresh, locally sourced food makes all the difference. We came here with a large group for a birthday and they were very accommodating. Great place to take a large group. Ambiance and decor is very modern rustic. The staff were helpful friendly. <br><br>Drinks: Great selection of ciders and beer. Everyone in my group tried a different drink and we enjoyed them all. <br><br>Food: Cheese curds! Per the suggestion of my fellow yelpers I also tried the cheese curds. Let me say they still haven't done me wrong. Fluffy batter and a homemade catsup sauce. Even the people who usually don't like ketchup liked the ketchup. I would also recommend the Mac n Cheese. For dessert we had ice cream! All the flavors were delicious the walnut was the best and very unique. I would definitely recommend it to someone to try. The location is great and close to many other things to do afterwards.", "pics": null}}, {"review": {"des": "Yes to everything about Farmhouse Chicago.<br><br>You have to love local, farm-to-table spots like these, especially when the menu is so refined that you could close your eyes and point to something and know it's going to be good. If that's the way you pick your dinner, I hope your hand is guided to pick the Wisconsin fried cheese curds. Those were the instant star of the evening. <br><br>The atmosphere in here is on point with an urban, somewhat dimly lit, rustic New-American vibe. The drink menu was impressive, and the Tequila N'Hour (tequila, apple ginger shrub, agave honey, lemon) hit the spot; refreshing, balanced and not overly sweet.<br><br>For my entree, the grass-fed flat iron steak was on point. Medium rare over carrot purée and roasted carrots (ALL the carrots!) with some comically large trumpet mushrooms, this was the kind of entree I look for in the heartland. <br><br>Total win on our one visit here, but would absolutely come back next time I'm rolling through Chicago.", "pics": null}}, {"review": {"des": "We came here on Labor Day for lunch and sat at the bar. It is a pretty small space although they do have an upstairs (not sure how often it is open). <br><br>The menu may be small but everything seems to be farm to table / locally sourced. We tried the Pick 2 lunch special with the Amish chicken soup and the Midwestern chopped salad. The soup was clearly made with fresh whole vegetables and chicken breast. The salad was decent with blueberries and summer squash. We also tried the brunch special which was our favorite. This was served with eggs + veggies, potatoes, sausage, and an English muffin. The butter was out of this world- it was made with some sort of sweet cream- highly recommend getting some toast or a muffin just to try this butter!<br><br>Overall, high quality food with fresh healthy ingredients and super sweet staff.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/g6bqftX4nWqpvI71bpn-6Q/168s.jpg", "caption": "Brunch special"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dzq-yCreRX6moaqxowRqEw/168s.jpg", "caption": "Brunch special"}]}}, {"review": {"des": "I enjoyed this place!  We were looking for a brunch/lunch place on a weekday that was near our hotel and found this spot using Yelp.  We ordered the pretzel starter which I loved.  I also appreciated that it came with a non-dairy dipping sauce (a sweet mustard).  I also loved all the non-dairy options on the menu.  I ended up getting the 1/2 salad and soup combo.  The chicken kale soup was so hearty and filling, I probably could have just eaten the soup.  The salad was not as good as the soup in my opinion, a little too sour for the dressing and also too much dressing.  <br><br>My boyfriend got the grain and veggie bowl, he was not that big of a fan of it though.  From the bite that I tried, it could have used a little more flavor or something, it was kind of not memorable at all.<br><br>If I lived in the area, I would stop by again to try other things.", "pics": null}}, {"review": {"des": "Fantastic meal and great service! Came here on my last Chicago trip in June and everything we ordered was delicious (cocktails + food). I don't remember the drink that I ordered (friend ordered Old Fashioned) but both were tasty/no complaints and I loved that they used paper straws. <br><br>Food items: Potato/Cheese Pierogis (4/5 pretty filling but I didn't love it- would probably order something else if I came back), Baked Cheddar Mac & Cheese with a side of Tri-Tip Steak (5/5 the mac & cheese was perfection and the steak was cooked perfectly), and Pasture Raised Grass Fed Burger (4/5 very solid burger but pretty standard).<br><br>If you have time to come here I would highly recommend it. No frills American restaurant with plenty of seating.", "pics": null}}, {"review": {"des": "Nice little cozy lunch spot in the River North area. It's hard to find decent fish and chips in the Midwest but Farmhouse Chicago didn't disappoint. The fish was very fresh and wasn't all batter. My favorite was the fresh dill tartar sauce that came with it. I wish the fish portion was a little bigger but I'm not complaining because we left happy. The highlight of our lunch was the caramel apple bread pudding. Can't recommend this enough! Hoping to come back here to try their famous Wisconsin cheese curds.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/750FHsywdUUVsaV1k6K7ZQ/168s.jpg", "caption": "Carmel apple bread pudding. Must try in the Fall!"}]}}, {"review": {"des": "I love restaurants which make an effort to source locally and present the freshest food possible with local inspiration. This is why I was very excited to try Farmhouse Chicago after a series of great experiences with similar farm-to-fork restaurants in nearby states.<br><br>The restaurant itself isn't huge but fortunately wasn't too crowded on my last visit. I was pleased to see that the decor resonated the farm theme which was apparently in the art and the furniture. From the menu and server, I received plenty of education about the food I was about to consume and the origin of the food. The biggest issue for me came down to the service - since it took quite a while to be seated, then it took a while for a drink order, food took some time to be served, and there was hardly any followup service after food was delivered to the table. Fortunately, the quality of the food scores enough points to warrant additional visits, despite the disappointing service.<br><br>As many have noted, the beer-battered wisconsin cheese curds are a must order on the menu. The batter is super fluffy and light with cheese curds that have just the right texture to them, not squeaky but not too firm. This matches well with the housemade the catsup.<br><br>Their grassfed burger is delicious, with tender, flavorful grass fed beef. This matches well with a little bit of saltiness from the bacon, white cheddar to add some depth, fresh lettuce and tomato for some contrast, and a fluffy butter bun to hold it all together. The tavern fries were cut thin with a nice crisp to accompany the burger.<br><br>Overall, Farmhouse Chicago serves simple and delicious food that highlights the quality of their ingredients instead of depending on sauces or spices for flavoring. Hopefully this chain continues to grow and expands into the Northwest Suburbs of Chicago.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zt50qRFa0paMI2VGjX_2OA/348s.jpg", "caption": "Cider flight"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6hrr1tIbBY5qBMXuJpTw1Q/168s.jpg", "caption": "Beer-battered Wisconsin Cheese Curds"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eThegMgcSW2nPNJoRFyvSQ/168s.jpg", "caption": "Burger and Fries"}]}}, {"review": {"des": "Great place to go with your friends for dinner. Amazing specialty drinks; the cider sangria is highly recommended! A little bit on the pricier side with their entrees but it's a must if you're in Chicago.", "pics": null}}, {"review": {"des": "We came here for brunch awhile ago. We got there right when it opened but there were a few other people waiting outside with us. We were quickly seated and brought over water. My friend asked for sparkling water but they did not carry it which was a little disappointing. We ordered the monkey bread to share. It was good, nothing amazing but it tasted exactly how I thought it would. It was fairly small and very sweet, as expected. For a meal I got the White Breakfast Flatbread  which is similar to a breakfast pizza. It was really good. It was a pretty large portion so you could share it if you wanted too. My husband for the brown sugar french toast. He didn't really care of it. The french toast was dry and berried made it overly sweet. My friend got the veggie burger which she also didn't care for. The burger fell apart when she ate it. It crumbled and turning it a huge mess. <br><br>Overall the food was okay, nothing special.", "pics": null}}, {"review": {"des": "Menu isn't big but the food is good. Full bar and it seems hard to find a breakfast brunch place with adult beverages in this area. Overall a good experience", "pics": null}}, {"review": {"des": "Very impressed with Farmhouse. I met a friend for an early Sunday brunch around 10 am and was surprised to find it wasn't very busy yet. By the time we left around noon, it had picked up a lot. Note they do take reservations, which is always a plus! <br><br>Our waitress took no time to stop by to give us a very warm welcome and explain the concept of the restaurant, along with some of her favorite dishes. I ended up starting with a coffee and for food went with the open faced breakfast sandwich. Wow... just, wow. Composed of ham, bacon, gruyere, jam, and a sunny side up egg on top of French toast along with crispy smashed potatoes - it was a complete masterpiece. The coffee was also quite nice, and they were good about stopping by for warm-ups. Overall, service was great and food came out quickly. <br><br>I only wished the tables were a bit bigger and had a flat surface - ours happened to be a little wobbly too, which made for a somewhat precarious situation. Otherwise, I liked the style of the restaurant and the down to earth vibes.<br>4.5 rounded to 5 stars for a lovely morning meal at Farmhouse!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZD0hxgFSsYDA2IUQIuCS1w/348s.jpg", "caption": "Who knew an open faced breakfast sandwich could be SO GOOD?!?"}]}}, {"review": {"des": "This restaurant has a cool rustic and casual atmosphere. Before you even start looking at the food menu, I highly suggest ordering the cider sangria. I didn't expect much from it, but I ended up being blown away. You can tell that every ingredient inside of it is well planned out. The cocktail was evenly balanced and one I would order again without hesitation. <br><br>The restaurant prides itself on sourcing food ingredients from local farms. All of the ingredients in their dishes are super fresh. I've been to Farmhouse 3 times, and I've been pretty pleased with almost everything I've tried. My favorites have been their regular beef burger, veggie burger, and cheese curds. Both the beef burger and veggie burger are large, so you definitely won't leave hungry with those. During my most recent visit, I had the delicious homemade veggie burger and substituted the fries with the cheese curds (only $4 up charge for a large side of the curds). The cheese curds are a must. The sauce that comes with the cheese curds is a perfect pairing with the fluffy cheese curds. <br><br>During my recent visit, the staff helped me hide some flowers I was presenting as gifts to my friends in attendance that night. The staff is always very accommodating.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gaCNyWsRWdpe7vjr249nnw/348s.jpg", "caption": "Cider Sangria"}]}}, {"review": {"des": "Overall, I'm a huge fan of the decor and layout of the restaurant. It's very city farmhouse chic and cozy. I'm a huge sucker for different types of decor at restaurants and they definitely did a great job with this. <br><br>Personally when I go to restaurants I like to split as many things as possible so I can try a little bit of everything as I don't live in the city so I don't get to go back to many restaurants as often as I would like. Thankfully my friends were willing to share a few dishes with me :) <br><br>Potato and cheese pierogis: These were good. There were 3 of them for the appetizer. The pierogis themselves were on the average/smaller size but they put tons of stuff in the bowl with the pierogis (various vegetables and sauces). I'm a pure cheese and potato pierogi's girl, so I would have preferred a bigger pierogi and would have been disappointed if I had eaten this dish alone but my friends who value vegetables, really liked all the additions to this dish. So I guess it just depends what you want the focus to be on! If you like it all, then this is a great appetizer for you since you get a little bit of everything. <br><br>Short rib entree: The short rib meat was very enjoyable, it was perfectly cooked, super tender and flavorful. Again, I didn't care for the vegetables  on the side, but I'm not much of a vegetables person. They used a vegetable I had never heard of \"fried pickled ramps\" which to me tasted like green onions. It was an interesting dish that I can say I have never had before, but personally I would rather be served a carb with short rib than only various vegetables, even if they are fried lol. <br><br>Mashed potatoes: We ordered a side of mashed potatoes for one. You can easily eat alone or share with another. They were delicious!! Perfectly creamy with a slightly unique flavor! I'm picky when it comes to potatoes, so you can trust me on this one! <br><br>Macaroni and cheese: We ordered a side for one as well, again good for 1-2 people. I thought this dish was perfectly creamy and had a nice baked layer of cheese on top. I would order the Mac again! <br><br>Brown Sugar Banana & Walnut Bread Pudding: This was a good bread pudding. I hate when bread pudding is too dry and this was perfectly moist. The flavor wasn't overly powerful. This could easily be eaten by one person or shared by two. <br><br>Warm Blondie Sundae: I only had one bite of this but it was very tasty. This you would definitely want to split with another person as it was pretty big. Overall, my friends really seemed to enjoy it since they devoured it. <br><br>No Tiki, No Taco: Some name like that! This drink was very tropical tasting and very boozy. I thought it wasn't overly sweet, which I really appreciate. I don't know if I would order it again as it wasn't for me, but I don't think it was bad either. <br><br>Our waitress was friendly and helpful with suggestions. I would like to come back for brunch!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KKmludpwn6NDgw2O2WvHIw/348s.jpg", "caption": "Potato and cheese pierogis - ok"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sLZ1BKzxlJQ3bMGVF-yQZQ/168s.jpg", "caption": "Mashed potatoes and macaroni and cheese delicious"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aIy8Yzys5qHCyOVFPKcL8g/168s.jpg", "caption": "Short rib $24 ok"}]}}, {"review": {"des": "Came by for a weekday dinner with some friends without any reservations and were able to be seated right away. The restaurant has classy/hilarious/romantic farm-theme decor. It's very rustic. I love the concept of sustainability, local, farm-to-table. The whole menu looks amazing.<br><br>We had an enjoyable experience. Tried out the one of the ciders- I can't remember which one, but it was really good. Sweet and tart enough without being overly clawing. The burger was great! Fries were solid. I had a side of seasonal veggies... which I think was turnips or parsnips. I should've clarified what was the seasonal veggie, cos I would've tried something else since it felt too starchy having fries and another root vegetable. Other than that small quip of mine, was super happy about the meal. The rest of my table enjoyed their meals as well. When I visit Chicago again next, I'd definitely go out of my way to have a dinner down at Farmhouse. Absolutely recommend to check it out!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/I_ogcvRm-lxGDjv2FMX6Bw/348s.jpg", "caption": "squash salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SyRhgnjD3yT0_sI-GKKUqw/168s.jpg", "caption": "Seasonal veggies,  parsnips?"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-eeTWl6ZGc1tIW1UzI4XDA/168s.jpg", "caption": "Farmhouse burger"}]}}, {"review": {"des": "Farmhouse is great! Located in River North, there's many restaurants to choose from, and I get it. Farmhouse Chicago is one of those farm-to-table type restaurants, so if that is a thing for you, then Farmhouse is something to try out, and it definitely narrows the list of restaurants to choose from in River North.<br><br>We went during Restaurant Week 2018, but ended up with going with the main menu.<br><br>Appetizers<br>Pork belly -- nice and crispy sides, but the rest of it melted in your mouth. The dish came with some type of chili Squash Puree, Red Cabbage, and Pickled Mustard Seeds<br><br>Beer-Battered Wisconsin Cheese Curds -- really good. Came with two sauces: housemade catsup and some mayo-based sauce. I didn't care for the housemade catsup, but the other sauce was good<br><br>Main dish<br>Short rib Mac n cheese -- I'm usually \"meh\" with Mac n cheese, except if its from Kumas. But this mac n cheese is definitely worth checking out! The short rib was tender and actually complimented the Mac n cheese real well. My mouth is watering just writing about this. The only bad thing is that when I got my order, I guess the dish was sitting out too long, as part of the cheese was already congealing, and the oil was separating from the cheese, so there was a watery/oily layer at the bottom of the dish. <br><br>Bone-in pork chop -- came with creamy Sweet Potato Gratin, Brussel Sprouts & Bacon, Warm Bacon Vinaigrette. There cut of meat was enormous and came bone-in. I highly recommend it!<br><br>The restaurant itself isn't that big; the configuration between the bar seating and adjacent tables can cause a queue up of people, especially if people are sitting and/or servers are bringing out food orders. It reminded me of waiting for the beverage cart to go by so you can head to the bathroom. That's actually what happened, as you have to walk past the bar to get the bathroom. Speaking of which...<br><br>BATHROOM REVIEW: Bathrooms are located past the bar. There's two single-person bathrooms, coed. The nearest bathroom to the bar has a toilet. The one further away, has a toilet and urinal. Everything seemed fine, including the piggie portrait staring at cha while you pee. A jar of mints awaits you upon exiting the bathroom. Sit or squat? Sit!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/65J5Ec8FqFic-DesOGA70w/348s.jpg", "caption": "Short rib Mac n cheese"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qiHYAkCspgNw9_U8kJdM4A/168s.jpg", "caption": "Pork belly appetizer"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/opKiEGXn7V1alOG40lSASg/168s.jpg", "caption": "Mints after you pee"}]}}, {"review": {"des": "A past Saturday night, post Hasan Minhaj at the Chicago theater, we were searching out a dinner spot that could handle our size of ten... We stopped into a bunch of places around River North near \"the McDonald's\" (which is no longer rock'n roll) Many quoted 1-2 hour waits or asked if we could sit broken into different areas. We decided to walk northbound in search of other options. Whilst searching reviews and calling around, Farmhouse stated they could handle us. When we arrived they were mostly empty except for two couples having dinner.<br><br>I've done some good brunchin' at their Evanston location but never so impressed to return for dinner. I dig restaurants that can source local, cook fresh, yadda yadda but it should also taste great & beckon your taste buds to return no? Btw, their fried curds are always awesome. <br><br>Appetizers were unique, tasty and made us curious for dinner. Practically all were wiped clean. Sausage and veg stuffed pierogies, flatbread w/ corn and mayo (elotes kind), fries, spicy kale soup, fried cheese curds, all of them loved by all. <br>Then came dinner... <br>At the time of ordering we were told the menu of the night was the last of the season. Now I'm thinking.. I wish we could have seen the next seasons' menu!  I'll cut it short and say while table services were ample the preparations of our dinners were mediocre. Dinner plates are costly and when you get a nice piece of meat but with meh seasoning.. it leaves a disappointment in the gut. I got the lamb and it was done in a Mediterranean style.. I felt nausea after. One cuz got the prime rib and the texture was like thick mucus. Kinda like, when you have a bad cold and thick phlegm is inside your lungs and gets coughed up. That big chunk you feel the necessity to spit at the first chance. So, yeah, they didn't like it much.  <br>One word for dinner, disappointing. We bailed without considering dessert. A few of the group ended up on Devon for late night curry. The rest griped about dinner the following day. When you're spending $14 (burger) to $40 per plate and it's slightly acceptable that's a no-no. A few of the group left thinking \"no more foo foo food.\" <br>Looking at the many stellar reviews I'm at a loss wondering what was different. I'll chalk it up to this sentiment. For those seeking a clean meal with the lightest seasonings in the hopes of deriving flavors from the ingredients used.<br><br>One and done.", "pics": null}}, {"review": {"des": "EAT and ENJOY in moderation!  :-) I hope CHILDREN'S MENU is still available as it was an excellent portion and value.<br><br>My 3 item BRUNCH was an easy $30:. STEAK & EGGS had perfect temp, crunchy yet soft BREAKFAST POTATOES, so-so eggs as I wasn't asked.  Worthy $3 Bottomless SPARROW COFFEE was necessary when chatting.  Austin sold the smooth and boozy $9 HONEY MIMOSA (pretty color).<br><br>Chilax SERVICE from Austin.  Quick cleanup.  Charming super tall classy HOSTESS.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZST4uUYyhAyTpU5cYjguIw/348s.jpg", "caption": "Farmhouse: Honey Mimosa"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sJ51ZopMWOYwa27ID1jSeg/168s.jpg", "caption": "Farmhouse: Steak and Eggs"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AbPQOYSMUK8lvMwzWgD_3w/168s.jpg", "caption": "Farmhouse: Coffee Service"}]}}, {"review": {"des": "A friend and I came in for dinner last Friday. We were expecting to wait or sit at the bar, but we got a table right away. Our server was funny, helpful, and made the meal more enjoyable.<br><br>I'm not usually a cider person, but their menu boasts about theirs, so I ordered a Don't Tell William. It was strong and not too sweet, and if I meet William, I'll be sure to let him know.<br><br>We shared the flatbread to start. It was pretty big and tasty with mushrooms and a pesto sauce. <br>I had the veggie burger, which was also pretty big and tasty. Their homemade ketchup had a strange tangy flavor, and their fries were average, so maybe next time I'll go for the cheese curds instead.", "pics": null}}, {"review": {"des": "Delicious! I found Farmhouse on Yelp (yay!) and knew it would be a fun place to check out. I liked that it was busy and full on a Wednesday night. It's a pretty small space but cozy and not cramped. I got the midwestern fall salad with steak and the tavern fries. The fries were great and the garlic aioli was perfect. I liked the salad a lot. Next time I may get the chicken on it instead. Our waiter was friendly and relatively attentive. We shared the blondie brownie sundae for dessert. Very good but we both wished there had been more chocolate in the dessert. I definitely would go back again for dinner and this get share the salad and burger with someone.", "pics": null}}, {"review": {"des": "When eating at a restaurant I always take the vote of the table for the rating, Farmhouse  Chicago was voted to be a resounding 5 stars. While not a fancy restaurant the food was excellent. We had Tri Tip Steak. It was beautifully presented and the flavor factor was amazing. The meet was tender and cooked to perfection.   We also had the 1/2 chicken with green bamboo rice with a basil vinaigrette. Chicken was super moist and full of amazing flavors.", "pics": null}}, {"review": {"des": "While enjoying the architecture tour today, I started looking for a dinner spot. Thankfully i found this place!<br><br>Given the rating and number of raters it seemed like a certain WIN, and it absolutely was. <br><br>We enjoyed the cheese curds to start. Instead of an entree we (wife & I) shared 3 sides, and added a side.of tri tip steak.  We split the asparagus, Mac & cheese, and mushrooms. The only disappointment for the evening was the asparagus, it was too woody and shouldn't have been served. <br><br>The mushrooms were a great variety that most restaurants would not even aspire to, much less serve. The Mac & cheese was out of this world. Our only regret was probably that we didn't order a second side if steak!<br><br>Would absolutely come again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jZ1HRV75SxrBlEcXPBJsyg/348s.jpg", "caption": "Perfectly cooked tri tip"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/A8_XU-xzAo08eHctqg4kvQ/168s.jpg", "caption": "Woody asparagus"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6Hmu65uvgAY33OtQgxXIvA/168s.jpg", "caption": "Awesome Mac & cheese, single size wouldn't recommend for less than two hungry folks"}]}}, {"review": {"des": "Farmhouse is a perfect place for a hearty and clean breakfast if you are in the River North neighborhood. I had the Farms Egg Benedict and the dish paired well with the spicy breakfast potatoes. Sit upstairs if you can!", "pics": null}}, {"review": {"des": "I really love the food at this restaurant. It's great portion sizes although I do feel that it's a little overpriced...<br><br>The staff are always friendly here though and the cheese curds should not be missed! They're the best thing on the menu.<br><br>I've been a few times and on my last visit I really enjoyed the roasted squash, the pretzel and the schnitzel duck breast. The half chicken was ok but not as flavourful as some of the other dishes and the dips are sometimes a little too salty for me. But my husband seemed to enjoy it.<br><br>It's also right next to the L so it's super easy to get to!<br><br>Enjoy!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Am9XKBpr3zLnMvH9zVb5Cg/348s.jpg", "caption": "Pretzel with beer cheese fondue!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0VoGeOwgh8AZNDJEIyxrFw/168s.jpg", "caption": "Cheese curds!!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tNxIAh4jloe45LOy5vnMpQ/168s.jpg", "caption": "Half chicken with parsnips, mash and carrots."}]}}, {"review": {"des": "The flatbread was wonderful.  With leeks and squash and other veggies, I was surprised by how tasty it was, and really, that's why I'm keeping the four-star review.  The beef short rib mac and cheese also was pretty good  (and I guess cauliflower is in season because it showed up in the mac and cheese!), but it could've used more salt.<br><br>The burger was fine, though not as good as I remembered, and the ivory char was a let down.  It looked beautiful but tasted very meh.  Service was slightly below average too.  I'd come back but I am definitely less enthusiastic about Farmhouse.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6qmC8sfynsUJ4Bxbvv4jlw/348s.jpg", "caption": "Ivory char"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dbamzxLBqa8YLUQmN659Tg/168s.jpg", "caption": "Burger"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ynVxxFaRC85bc3II6guu3g/168s.jpg", "caption": "Beef short rib mac and cheese"}]}}, {"review": {"des": "Farmhouse remains one of my favorite places to dine in all of Chicago. From its excellent libations selection to each and every one of its hearty offerings, there is no wrong dish to order here.<br><br>The most recent time I dined here, we ordered a bottle of cab sauv for the table off of our server, Justin's, recommendation-- the Borra ($44), I believe. Full-bodied and delicious, and Justin was so helpful and knowledgeable about each option we considered.<br><br>As for food, we started with the Farm Green Salad ($7), which was light and refreshing; I had the Amish Chicken Soup ($6), the perfect answer to a craving for something hearty and warm on a gloomy and rainy Chicago day; my friend had the White Flatbread ($11) which looked absolutely divine; and finally, we split the herb-roasted mushrooms with leeks and charred spring onions ($12) as our Table Side. Let me just say -- wow.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LniwD9yle9Frh6PUYLyxGg/348s.jpg", "caption": "From top left: Herb Roasted Mushrooms with Leeks & Charred Spring Onions ($12); Amish Chicken Soup ($6); White Flatbread ($11)."}]}}, {"review": {"des": "I've been to Farmhouse twice now--once for brunch and another time for lunch. Their brunch menu is amazing. I got the eggs benedict and it was delicious. One of the best brunches I've had in Chicago so far! However, my lunch experience was subpar. My chicken sandwich came soggy and hard to chew. The macaroni and cheese, thankfully, was good. I recommend getting that to anyone who stops by for lunch. :) Otherwise, everyone else, you should take the time to have brunch here at least once!", "pics": null}}, {"review": {"des": "Really like this restaurant. Smaller seating and bar main floor but more seating upstairs.  <br><br>The food was delicious. Shared the Brioshe French toast (lemon curd rhubarb and salted cream on top) and eggs Benedict with my sister, plus a pink Mimosa. Great service for a party of 10. Enjoy the water glasses always full.  Friendly staff, I called a half an hour ahead to see if they could accommodate our group and they had a seated within five minutes. <br>If I lived in this area I would definitely go back.<br>The only reason I gave it 4 instead of 5 stars was that we couldn't use the lunch menu at lunch time. The brunch menu is the only thing for Saturday and Sunday, the lunch menu is for the other days of the week.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AFoFYxYUBPz1J4JnHeeZdg/348s.jpg", "caption": "Brioshe French toast"}]}}, {"review": {"des": "Nice find in a semi unusual location .  Menu was simple but had a good array of choices . Everything is sourced from Midwest farms.  Finally something that isn't made in China , lol <br><br>Had the chopped salad with steak and it was very good.  <br><br>But the highlight of the night was the bread pudding .  Delicious!!", "pics": null}}, {"review": {"des": "This was a great outdoor patio brunching area that I didn't think I would be coming to today! Tried to go to the Beatrix and it had a 45 minute wait so walked over here and I am sooo glad I did! I ordered the benedict without ham and subbed cod (you can sub chicken or a veggie patty too) and it was great! Love that their menu is not too long. It's simple and has everything for everyone. The Wisconsin Cheese  Curds are amazing!! Also got charged a $3 for \"open food\"....anyone know what that is?", "pics": null}}, {"review": {"des": "We came by for dinner and we craved burgers so we got that. Their menu was very limited and they didn't have any sweet potato fries which was kind of a bummer. The burger was super filling! Taste wise it was the bomb! Everything was so fresh and tasty!", "pics": null}}, {"review": {"des": "I had soup and salad. Loved the soup, but the salad was just ok. I feel these two small plates are overpriced. <br><br>I sat outside with my niece's dog (dog sitting) so not sure about the inside. I can't recall any music playing, so it was not pleasant, don't recommend sitting out there. The ground was gross.<br> <br>I could have been in a negative mood, though. The people in the area are pretty snobby.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3yo5uQGJj9rS0WO3m0cDkw/168s.jpg", "caption": "Outside with Louie the dog."}]}}, {"review": {"des": "Really great selection of beer, liquor, and food.<br>Very friendly staff, cute atmosphere, good prices. The cod was amazing, as was their 1/2 chicken. Definitely recommend trying this place out, especially if you like different and more modern.", "pics": null}}, {"review": {"des": "This is a super accessible restaurant with the Franklin L stop right across the street. The concept of farm to table is one that I love, and the inside of the restaurant had a rustic feel to it. I ordered the farmers breakfast, and it came out super fast! The peach jam that went along with the toast was the best part of the meal, and the potatoes were so good! Service was so attentive, and prices were overall reasonable (although looking at the drinks seemed to be a little pricy). <br>One thing I will not is that I tried to get coffee, but they only had whole milk as creamer. It would be appreciated if there was soy milk, or even almond milk available!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tz47Cpf1AFahcB4sQAb-QA/348s.jpg", "caption": "farmer's breakfast"}]}}, {"review": {"des": "Charcuterie was so on point. Chicken liver patte had hints of honey that I had never experienced before. Mac and cheese was bomb. <br><br>My one critique was that The burger came with fresh raw red onions which were overpowering the delicacy going on with the cheese and candied bacon. I'd recommend removing those before chowing down, especially if you plan on talking to anyone that night.", "pics": null}}, {"review": {"des": "Come hungry! I joined a couple of coworkers at Farmhouse for a Sunday night dinner earlier this winter and I think I'm still full. <br><br>The restaurant itself is cozy, servers were flannel-clad, and our server in particular was a sweetheart. She was genuinely jazzed about the menu and their farm-to-table approach.<br><br>We started with a round of cheese curds, and this Wisconsin girl approves. They're my preferred style of battered instead of breaded. Melty, chewy, delicious all around. <br><br>For my entree I chose the Roasted Half Chicken, in part because it comes with glazed Brussels sprouts, carrots, and parsnips on a bed of mashed potatoes. No problem eating all my veggies with that combo! The chicken was moist and tender and a large portion, even for a half chicken. I felt bad leaving so much on my plate, but there was just no way I was going to finish in one sitting. <br><br>Prices were a little high, but not ridiculous for the quality and quantity. The fare is similar to what my hometown excels at, so I don't know if Farmhouse would be at the top of my list on the next visit, but I also wouldn't be upset if someone suggested it.", "pics": null}}, {"review": {"des": "Recently, a friend and I decided to check out Farmhouse Chicago on a Saturday night.  We had no problem obtaining an early reservation.  <br><br>When I had arrived for a 5pm reservation, the restaurant was already half full with patrons.  I decided to belly up to the bar until my friend had arrived.  The bartender, who was friendly, started to greet me then my friend had arrived.  Then opted to be seated right away.  <br><br>Since there were just the two of us, we were seated at one of the higher tables with a banquette seating.  The decor is very light and bright.  Very cozy since the tables are close together, however, it was not very loud in the restaurant.  Right away, I had noticed, the table top was pressed tin.  <br><br>David W, server, had greeted us within a few minutes and went over the menu and the evening specials.  Then proceeded to take our drink order, couple glasses of wine (Melbec and Pinot Grigio).  <br><br>By the time David had returned, we were ready to order:  my friend had ordered the Farm Green Salad and the Nightly Special (I believe it was some kind of fish) while I had ordered the Amish Chicken and a side of mashed potatoes.     <br><br>Since we were out for a leisure dinner, I don't remember how long it was before our meals were brought to us.  David would continue to check in with us.  He was very friendly and polite.   I will say, both of the meals were excellent.  Enough though, the chicken was on the bone, it was very tender and juicy.  The skin was nice and crispy.  We did check out the dessert menu, however, nothing really appealed to us.   <br><br>I would highly recommend this restaurant and would return.", "pics": null}}, {"review": {"des": "Amazing restaurant and ambiance. I had a glass of the Tempranillo and it was incredible, strong scent of leather and tobacco, muscular, and chunky. The fried cheese curds were amazing. Stringy cheese, light crispy beer batter, and the homemade sauces pair perfectly. Shared the brussel sprouts and the short ribs for dinner. Cooked to perfection. The portions are quite large, so sharing was the perfect amount of food. It is a bit loud due to the small size of the restaurant, but it is a fun upbeat place. Our server was great!", "pics": null}}, {"review": {"des": "Brunch is one of the most important meals of any Sunday! We started our meal off with the Beer battered cheese curds and cinnamon pecan monkey bread. To be honest I would have ordered these again as my main entree, but there was so much more on the menu that looked delicious! I ordered the open faced breakfast sandwich as my main entree which was so tasty! The French toast that was so light and fluffy! The raspberry jam gave the salty ham and bacon a nice sweet finish!", "pics": null}}, {"review": {"des": "I've heard people say that the cheese curds are delicious here, so I decided to try them out. The price is hefty ($9) but they do come in a big portion! This is definitely something you want to share with at least 3-4 people. The cheese curds came in two sauces-- a marinara sauce, and a sort of tangy ranch sauce. They were crispy and chewy, but a bit salty, and the more I ate, the saltier my mouth felt. I got tired of eating them after a few bites.", "pics": null}}, {"review": {"des": "Best Bloody Mary I've ever had! The food was fresh and I was not disappointed at all. The bartender was also able to accommodate my picky preferences and one of the few places I could find CHEESE CURDS!!!", "pics": null}}, {"review": {"des": "Good, quick, and affordable, with friendly service. I had the grilled cheese and tomato soup. I was in and out in probably 15 minutes or maybe even less.", "pics": null}}, {"review": {"des": "Ancient grain veggie burger. One of my favorite veggie burgers! Good people and service. Enjoyed having a French press on our table.", "pics": null}}, {"review": {"des": "We like this place. It reminds us of our favorite Portland, OR restaurants. Try the ciders. The owner farms his own apples and honey!<br>The decor is cute, the service is perfect, and the food is fantastic.", "pics": null}}, {"review": {"des": "I had the curds, flatbread, veg board, duck schnitzel, cider flight, warm blondie sundae, walnut marjolaine cake.  Standouts were the flatbread and duck schnitzel with both deserts being good.  The schnitzel was actually much larger than I expected and comes with sweet potato wedges.  I usually don't like cheese curds but I guess everything is better when fried.  The space itself was smaller than I realized so can get noisy when busy.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oohrmYIybqlmadF0izzpyQ/348s.jpg", "caption": "space - smaller than I thought and can get noisy"}]}}, {"review": {"des": "It's Restaurant Week!! So a friend and I were browsing menus and decided to give Farmhouse Chicago a try. <br>We had made a reservation for 8pm on a Saturday and when we got there it was extremely busy/packed. The hostess told us our table wasn't ready yet so we grabbed a couple drinks at the bar. It ended up being about 10-15 min past our reservation time by the time we got seated. So if you're going during a busy time/day, definitely make reservations. I can't imagine what the wait would have been if we didn't have one! <br>The interior is super cute with (shocking) a farmhouse vibe with farm stuff all over. We were seated in the upper level. <br>The Restaurant Week menu choices all looked great but ended up picking the cheese curds to start, roasted half chicken, and the warm apple crisp for dessert. Let me just tell you, THE CHEESE CURDS ARE BOMB. I would go back just for those alone. The chicken was delicious and tender as well with mashed potatoes and brussel sprouts plus some other veggies. I was only planning on having a couple bites of the warm apple crisp because I was so full but ate the whole thing because it was so good...whoops!<br>Super delicious food! Was a little disappointed we still had to wait with reservations and our food did take a while to come out, but it was very busy in there plus our server was very helpful and friendly. <br>Will definitely be back for the cheese curds and to try out some other things!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DRaexc-q1Zkrz3_GxMwzPg/348s.jpg", "caption": "Roasted Half Chicken"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZwbyZvKTy9s3tk7Qdeue8g/168s.jpg", "caption": "Warm Apple Crisp"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5Ldw61qXnPRimY-mFWHy0Q/168s.jpg", "caption": "Beer Battered Wisconsin Cheese Curds"}]}}, {"review": {"des": "YUM YUM YUM YUM YUM YUM YUM! <br><br>Went here for a late brunch on a chilly Chicago weekend. It fit the bill when looking for a solid farmhouse breakfast. Traditional fare done right! <br><br>I sat at the bar and was promptly greeted by the bartender. He sold me on a rose mimosa. Where have you been all my life, precious? So good! I had the traditional breakfast... scrambled eggs, their house potatoes, sausage and sourdough. Hearty portions for Chicago .... being a midwestern boy, I appreciate that. <br><br>Check it out. I was a tad disappointed it wasn't more busy, but maybe that is a good thing. We will keep it our little secret.", "pics": null}}, {"review": {"des": "My husband and I were visiting Chicago and really wanted a good steak. We found Farmhouse on Yelp and decided to give it a try. We had reservations for later in the evening but made earlier and they were ok with that and promptly took us to a table. The environment and staff were great and our appetizer (flat bread) was really delicious. The big problem for us was the entrees. My husband ordered the lamb and I ordered the steak tips and both meals were extremely under seasoned. It was such a disappointment specially because we were looking forward to a good meal in Chicago. I gave 4 stars because it's really a great environment and the appetizer was very good. But I probably wouldn't go back for the main course.", "pics": null}}, {"review": {"des": "We had a two person reservation here on NYE. The restaurant is immediately off the brown line so finding it was very simple. Apart from the EXTREMELY heavy doors (suction from the wind = don't try to open these after you work out), the ambiance is pretty quiet and romantic. The restaurant was very sweet in providing us with party hats and sparkly necklaces-- they even gave a few extras for us to take home. <br><br>As far as food, the steak was delicious but their alcohol menu was way overpriced for what they were selling. We ended up ordering drinks at another bar.", "pics": null}}, {"review": {"des": "Bland, boring, tastless. To each it's own. Will never ever again. Wish there was more to this place. Shortest review ever. Nothing more to say.", "pics": null}}, {"review": {"des": "Honestly, when I first saw the food I was a little upset I spend I 24 dollars on the half roast chicken. But when I ate I was very satisfied. The waiters, decor, and atmosphere are all nice. I could spend the day drinking here and have a fun time, just kinda pricey", "pics": null}}, {"review": {"des": "I'm going to have to get his place 3 stars. Something was off as myself and a guest enter the building. They were adamant about telling us that we had 10 minutes to wait in order to get a salad. That's not the bad part the bad part is when we got the salad it was just a basic sell it to me. The taste was Bland the grilled chicken on it was overcooked. I thought the soup the chicken soup was good but that's it. Also had the cheese curds because I just want to give this place a chance after seeing all these great reviews. The cheese curds if that's your kind of thing was just okay for me. I must admit that I don't eat that kind of food all the time so I would not be a good judge of that. Overall. Don't think I'm going to visit this place again.", "pics": null}}, {"review": {"des": "Great farm to table style restaurant.  Cozy and warm, the food here is fantastic, cocktails are great, and their cider made from their own apples is unique and delicious.<br><br>The burger is the hot item, you'll see it passing by every 5 minutes, but the real winner for us was the duck schnitzel!  So flavorful and satisfying.<br><br>Service was quick even though the place was packed.  Will definitely return for another round.", "pics": null}}, {"review": {"des": "I hosted a 22-person private work dinner in their upstairs space and it was perfect for a private event! I worked with Amanda who designed the menus for us, answered all my crazy questions about menus and level of noise and put two of her best on the event. Our guests had the most wonderful time!", "pics": null}}, {"review": {"des": "I really enjoy farmhouse and think it is really underrated. Menu is seasonally and locally focused, and is their beer list. Had dinner last night and had their flatbread and dreamt about it.. pesto, mushrooms, leeks. SO good! Was too full to try dessert but looks like they expanded their dessert menu! Restaurant is pretty dim-lit inside and intimate. A perfect spot for a date, to grab a cocktail or dinner with a couple friends. Also, get the cheese curds and thank me later.", "pics": null}}, {"review": {"des": "Yum, yum, yum. I came here for dinner with some coworkers on a recent work trip. It was really good. I highly recommend the baked cheddar mac and cheese. It is soooo tasty. I actually liked everything I had and liked the food so much I was sneakily eating the food off of my coworkers plates. Don't try that unless you are an expert level ninja food eater. Anyway, really good here. Try it out!", "pics": null}}, {"review": {"des": "The pork chop is to die for. It's Smokey and amazing. There is a large selection of craft beers to drink and great classic cocktails. <br><br>We had a salad that was pretty good. It was nothing special. We also ordered the fries with garlic mayo and the duck schnitzel. Both were good. We also had the Brussel sprouts they were browned and quite nice. Overall everything else took a back seat to the pork chop. <br><br>It's work to note they were out of their pork and Mac and cheese dish which was a bit of a bummer. It seems like it may be the most popular dish.", "pics": null}}, {"review": {"des": "Mmmm this place is tasty. It has Denver vibes. The food was super fresh and it has that farm to table vibe. The food was really good! I recommend it! It can be a bit pricey so if you want to try it, I recommend coming for lunch. The lunch and dinner menu are different, but the food is good.", "pics": null}}, {"review": {"des": "A great lunch spot that immediately feels right as soon as you enter the place. Five stars because it pleases in so many areas: nice menu with pleasant surprises, great food, friendly service, cozy atmosphere, and fair prices.  My favorite item is probably the smoked brisket.", "pics": null}}, {"review": {"des": "Brunch is by far the most important meal of the day. Farmhouse's brunch menu was on point- very midwestern (which I loooove)! I got the open faced breakfast sandwich- it was soooo good. The atmosphere is very rustic and quaint. I love their decor. The only thing missing is bottomless brunch. I'm visiting a friend from DC sooooo bottomless brunch is what I'm used to :)", "pics": null}}, {"review": {"des": "Went here for Sunday brunch with a party of 5. Ordered the Brunch Tartine which is described as the savory version of your traditional French Toast. It was VERY savory and a bit on the salty side. The server neglected to ask if anyone had any food allergies and I think this dish had dairy in it FYI for anyone who is lactose-intolerant! The Bloody Mary was mediocre. Good place for a quick brunch near River North.", "pics": null}}, {"review": {"des": "Great fresh food, delicious and beautifully presented. Unpretentious and comfortable, supported by staff who are friendly and professional. Came for dinner and ended up eating way too much since there were so many great options. Expansive bar and great seasonal drinks.", "pics": null}}, {"review": {"des": "Absolutely love this place! The house chicken soup was such a treat, very fresh and healthy. The potato is very well done. Great brunch spot!", "pics": null}}, {"review": {"des": "Really cute bar with delicious food! I got the Mac and cheese and it was really good! Love the decor and ambiance too. The service is great and the bartenders were awesome.", "pics": null}}, {"review": {"des": "Came here for a work lunch with my coworkers. Cute place, great service. I just moved to the Chicago area, so I was keen to experience 'farm-to-table' in the Midwest. I figure...food would be way fresh here, since aren't there just cows roaming everywhere? <br><br>(no, at least not in Chicago proper...) <br><br>Anyway, I highly recommend getting the cheese curds. Freakin delicious is what they are. I ordered the spicy chicken sandwich. It was a bit overwhelmingly saucy....great bun though. I replaced the kettle chips with salad, because I'm trying to be slim. Regrets but then again, nothing tastes better than how skinny feels.", "pics": null}}, {"review": {"des": "This place is a hard review. I came in on a Saturday evening. Reservations available on open table and wanted to check this place out. It's a very cute lively atmosphere kind of place. Bright lighting, bright paint, I felt happy and calm just being inside. <br><br>Service was good. I got the old fashion to start off. It's my Go to drink anywhere I go so no complaints about the old fashion. Well made. Now onto what is most important, the food!<br><br>For appetizers I got the cheese curds. Did I tell you how much I love cheese? Cheese curds were great. The dipping sauces added a nice twist to the cheese curds. I'm not sure what the dipping sauces were but it won't hurt you to try both. I got the pork chop for my entree. I don't know why but I was really craving pork chop when I was trying to pick a restaurant to go too this evening and the Farmhouse looked to have a legit pork chop. The first few bites were amazing. Very soft/tender something you don't normally see from a pork chop or at least my homemade ones. But the more cuts and bites I had I did notice the flavor was getting stronger and the taste was getting grainier. Listen I'm not hating on this pork chop. It's a massive pork chop. I'm still giving this place a good review for my standards. But I would defintely pass on the pork chop next time and try something else. I don't know what it was. Maybe it was the sauce? Too much?<br> I'm not a master chef. I'm not a \"foodie.\" It's a good pork chop. It's like when you have a girlfriend and the first couple of months is the best time of your life. But the next couple of months it's absolute hell. That's what this pork chop reminded me of. I think for first timers you definitely need to try it but I doubt I'll order the porkchop next time and try something else on the menu. Pork can be only so good for so long.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6BC8-e9d4JHKoy5a1GlLZg/348s.jpg", "caption": "Old fashion"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7E2FpkrL6RpeQvtNsNqPtg/168s.jpg", "caption": "Cheese curds! Yummy!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OlXLwKI7_hsU-NHhPBshmA/168s.jpg", "caption": "Massive pork chop. It was a solid 4 out of 5 for me!"}]}}, {"review": {"des": "I went here last weekend for a family brunch. Unfortunately, I have to say the best thing it has going for it is a very low wait/low capacity during weekends. If you hate waiting in line, you may love it. <br><br>I got biscuits, which were nothing really to write home about. I was super hungry and it was very \"meh\" both visually and taste-wise. My parents had similar feelings about their omelettes - okay but not killer by any means.<br><br>Also, the service was a bit slow- we all wanted a second cup of coffee but were told \"your bill is ready now so I will drop it off so I'm not keeping you\" in a near-empty restaurant. I understand this would be perfectly reasonable in a crowded restaurant, or if we had been there for hours, but we were in and out in less than an hour! At least the option of another cup of coffee would have been great.", "pics": null}}, {"review": {"des": "Great food. Well meaning, patient and friendly wait staff.<br>Good vibe. A little on the noisy side, in a good way. Not for business dinners, obviously!", "pics": null}}, {"review": {"des": "The service was awesome and the pork was delicious! We got a nice bottle of wine for under $50. The pork skin app had too much fat, but the edible parts were tasty. I had the short rib Mac n cheese (heavy and delicious) and my date had the veggie burger. Which he said he enjoyed. The fries were tasty!! I can't say I will go back, or would recommend, but i wasn't disappointed.", "pics": null}}, {"review": {"des": "This place is haunted. A spooky ghost caused the kitchen staff to be unable to use the oven. We had to wait for them to light sage to ward off the evil spirits. Probably won't return. <br><br>Also their burger has no seasoning on it.", "pics": null}}, {"review": {"des": "Farmhouse is a great little place for brunch. Seating is scarce, but it's well worth the wait. I had cheese curds and eggs Benedict. Everything was great! My sister had the monkey bread and the farmers breakfast (not pictured). Overall, great experience!", "pics": null}}, {"review": {"des": "Although following a trend, Farmhouse actually delivered on the hype. Hipster haven, well yes. A good place to eat and drink, well very much yes. Had a fine lunch on the sidewalk patio, fried chicken sandwiches for my co-workers and steak frites for me. And those much lauded deep fried cheese curds. Fine service, but the patio is blasted by traffic noise if you are considering an intimate meal.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/o7CznoqpKO8H6VHdDYZcPg/348s.jpg", "caption": "Steak frites."}]}}, {"review": {"des": "Great brunching location! A small patio with limited indoor seating, so be sure to get a reservation.  Great ambience with a farm-style decor that would make Joanna Gaines proud.<br><br>We had fried cheese curbs as an appetizer, and they were delicious.  I ordered the Farmer's Breakfast, a typically basic dish at most restaurants on which they put an amazing twist and mixed great flavors.  Great drink selections, including mimosas, Bloody Marys, and a homemade apple cider.  Be sure to hit up the bathrooms - super nice!<br><br>Definitely would come here again if I lived here.", "pics": null}}, {"review": {"des": "This is one of my favorites restaurants of all time! First time visiting here and it did not disappoint! All of the entrees and appetizers that my friends and I shared had tasted extremely fresh. All of the ingredients are delivered from local farms--basically guaranteed fresh. Highly recommended! A+++", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qetmP4Qv3N1Oi0Bg7kW9WA/348s.jpg", "caption": "Beef shortrib mac & cheese!"}]}}, {"review": {"des": "Best cheese curds in Chicago!! I love this little hole in the wall. <br>The food is good the staff is fun the drinks are amazing. This is a good neighborhood lunch spot or dinner spot. <br>I hear the brunch is fun. I have to still try it out.", "pics": null}}, {"review": {"des": "I saw pictures of the food here and absolutely had to check it out! The macaroni and cheese looked out of this world and I needed to taste those cheese curds! Oh, and I sure did! The cheese curds were delicious - not the best I've ever had, but very good. And the dipping sauces that came with it were tasty too. I also got the veggie burger and macaroni and cheese. The veggie burger was just okay. It was a pretty mushy consistency, but the fries were good. The macaroni was very tasty! I took some home and didn't think it made for great leftovers, though. The ambience of this place is really cool and makes for a great date place. I'd come back again!", "pics": null}}, {"review": {"des": "Came for brunch on a Saturday. One thing we loved is that we could make a reservation. The atmosphere was really cute, and some exposed brick and wood inside that made you feel at home.<br><br>They have a rotating menu, but we got the Short Rib Biscuits and Gravy and Farmers Breakfast. The Biscuit dish was really solid. Good gravy and crispy biscuit. Could maybe use a potato side or salad or something. Farmers breakfast was  also good, particularly the bacon, and the eggs were very rich.", "pics": null}}, {"review": {"des": "I think this place is ranked higher because locals have a hangout affinity. Ok the food was 4 starish, great named plates great ideas -good food, but I didn't taste the chef.  The real problem was the service.  We sat down at 11:20am and ordered within 5 minutes, then waited till 12:25pm to receive the food.  No kidding.  Just make sure you have time", "pics": null}}, {"review": {"des": "Came here with three friends without a reservation on a Friday night, wasn't expecting to get seated very quickly, but only waited for about 15 mins to get seated at the bar. Ordered beers (decent draft list) and started with the cheese curds. Honestly, I'd come back just for those. I'm from the Midwest so I've had my share of curds, and these were definitely the best I've ever had. Order them if you come. I got a burger, my friend got the veggie burger, and both were excellent. Well cooked and extremely tasty. Definitely recommend coming here, I'd make a reservation next time though!", "pics": null}}, {"review": {"des": "Cool place. Hipster vibe but not over the top; very comfortable and welcoming. Absolutely wonderful staff. I ordered something I'd thought I'd like but didn't; they brought me out one of the best burgers and fries I've ever had. Cooked perfectly, on a fresh bun; everything is homemade and homegrown so it's local and fresh and delicious. The fries were also plentiful and tasty. I hate ketchup; their house-blend ketchup is the only way to eat fries! Delicious! I can't say enough nice things about this place. If you're in Chicago, definitely go over and eat up.", "pics": null}}, {"review": {"des": "Very delicious. The portion sizes were amazing for the price. I loved how they served the basics, executed perfectly. We loved this place. Will definitely be back!", "pics": null}}, {"review": {"des": "After not going to Farmhouse for about a year, I was happy to see how much the food had improved!!! My husband and I shared a flatbread and salad and both were flavorful, fresh, and well prepared!!! This was a big improvement from the last time we were there and I am excited to return and try additional menu items in the near future!!!", "pics": null}}, {"review": {"des": "Great place for dinner!<br><br>I love lamb, so when I saw their lamb belly, I had to get it.  It turned out to be some of the BEST I've ever had.  Whole mustard seeds, peas, mushrooms, potatoes - & this jus that was to die for, on top of it all.<br><br>That lamb belly was the star of the show for me, but everything else here was great too:<br><br>Fried Cheese Curds - a must!  Lightly crispy outside, chewy cheesy inside, yumm<br><br>Roasted Turnips - chunks, served with the greens, roasted til they were sweet, yumm<br><br>Jalapeño Cornbread - blazing hot & delicious, served in a cast iron ramekin<br><br>Burger & Fries - cheesy, big bacon slices, great bun, a lot of good fries<br><br>Brownie Ice Cream Sandwich - this was sadly just ok.  The ice cream was fine, but the brownie parts were so hard that you could hear our spoons hit plate when we dug in, & that is not a good thing.  When I read \"brownie\", I expect soft & fudgy!  It could've been awesome if they'd have just baked it for a way shorter length of time. <br><br>Honestly, my one criticism of the dessert doesn't change my desire to come back here again.  At all.<br><br>Service was friendly & spot on, atmosphere is lively, & the food is GREAT!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NXlV7It3fgLGQsfdW9CudQ/168s.jpg", "caption": "Brownie Ice Cream Sammich - meh"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/j5BIZYIknjoCgU7G0sJrUQ/168s.jpg", "caption": "Jalapeño Cornbread : )"}]}}, {"review": {"des": "This is farm to table at it's best! All fresh, locally sourced ingredients combined with masterful preparation. They also have a lengthy (again only local) beer selection. The staff was courteous and attentive. I got the grass fed burger with tavern fries. The burger was cooked to perfection at medium as ordered. The fries are unique--lightly fried and seemingly unsalted.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MPIv93cescFq24zDMrf13A/348s.jpg", "caption": "Burger is amazing!"}]}}, {"review": {"des": "This is an amazing spot in River North, especially for lunch. The Farmhouse Lunch (choosing 2 half-potions of soup/sandwich/salad) in particular is highly recommended. <br><br>I ordered short rib sandwich, and the beef was incredibly tender and flavorful. The Midwestern Spring Salad was very refreshing too. Would definitely go back to try out their cocktails for happy hour", "pics": null}}, {"review": {"des": "I've been here a few times, for dinner and lunch. All times, I was delightfully surprised by the menu and food.  The veggie burger is fantastic, as is the fried chicken sandwich.  Most recently, I tried the cheese curds and they were great. <br><br>I had the Slagel Farms Half Chicken with brussel sprouts for dinner and the plate was huge and greens were delicious, but the food was in a shallow pool of olive oil and made the dish feel greasy rather than fresh. A friend got the Lamb Belly and there were large chunks of horseradish which would have been better in small quantities. <br><br>The service was great, our server was very knowledgeable about the menu and provided recommendations. Overall, I would definitely go back but probably stick to the burgers.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NWqHKarI19xLlexV4i8Sjw/348s.jpg", "caption": "Half chicken with brussel sprouts"}]}}, {"review": {"des": "We had an excellent experience here - both food and service. We had beer, wine, and the pretzel to start. I had the chicken and my husband had the steak, and we had a nut cake for dessert. We both came away saying it was one of the best meals we've ever had!", "pics": null}}, {"review": {"des": "I love this place for the drinks. They have a lavender gin drink on the menu right now that I cannot stop thinking about. <br><br>I work nearby so we have company happy hours here as well as going away parties/celebrations and they always have something on the libations menu that is stellar. <br><br>Mix that with cheese curds that you just have to order and the other wonderful eats on the menu (beet hummus with pita? Say what?!? ) and this place is just a great place!", "pics": null}}, {"review": {"des": "Fantastic brunch, they get the details right. Cocktails are really good, my bloody had the perfect amount of spice. I'm not a cheese curd guy, but I tried some and they were the best I've had. My breakfast was awesome; I could eat a pound of their scrambled eggs, and the potatoes were great as well. Everything had a unique twist that you have to come in and try.", "pics": null}}, {"review": {"des": "This place is great.  We sat upstairs and it was very nice and quieter than downstairs.  I had the special that was rack of lamb served on pesto potatoes.   Excellent!!!! My husband had the pork chop that was Smokey and huge.  Very nice meal and we would go often but don't live in the neighborhood.  Very close to brown line give it a try.", "pics": null}}, {"review": {"des": "Food is sourced from local farms.<br><br>Upon arrival you get a chocolate loaf as an appetizer. <br><br>Staff are super friendly and quiet honest with what's good. They are quiet knowledgeable where everything comes from (since food is locally sourced).", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BvIZvvWax5IDxAF4_8pQlg/348s.jpg", "caption": "Eggs benny"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ez07wC1hkZ2BzvG2r7P9Ow/168s.jpg", "caption": "Interior"}]}}, {"review": {"des": "I live in Grand Rapids, Michigan and every time I get the opportunity to visit \"The Windy City\" I try my best to make it to Farmhouse. It could be for the amazing (authentic) fried cheese curds. It could be for the impeccable service from the knowledgeable bartenders. It could be for the quant ambiance. It could be for the awesome local spirits sitting atop the shelves. It could be the awesome location. It could be all the above! If you live in Chicago or Love to visit make time to check out this urban gem and you will not be disappointed.", "pics": null}}]}