{"name": "fat-willys-rib-shack-chicago", "reviews": [{"review": {"des": "I went for my birthday with my wife and son.<br>It was Thursday we got the special with 2 side perfect for 2 and a half people (my son is 1 ).<br>The Carolina BBQ sauce was so good I couldn't get enough of it. We also got some apps that I liked a lot the pull pork poutine and gumbo both really good. All around good and can wait to go back and try the rest of menu", "pics": null}}, {"review": {"des": "Food was good, decor was fun and quirky - but holy shit our server (Jack? Jake? Gah this is why you don't wait to write a review), was outstanding!<br><br>Not only did he give great food and beverage recommendations, including turning me on to lemonade and whiskey - which I'll absolutely be drinking for the rest of the summer, but he had such a friendly and warm personality, that I wish he could have pulled up a chair and joined us for dinner. <br><br>If management is reading these reviews, I highly-HIGHLY recommend giving him some much deserved praise. You have yourself a gem of a waiter!", "pics": null}}, {"review": {"des": "I was surprised it wasn't bustling on a Saturday afternoon. Service was fine and space was mostly clean. Restrooms were dim but usable. They have a nice enclosed patio for outdoor seating but it was dreadfully hot. Every item was delicious, down to the sweet tea. I recommend the gumbo and corn bread. Overall: worth checking out.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Qo38hK32unEC4g_qgW88sw/168s.jpg", "caption": "The gumbo"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vizytqSXaDzJ9DRYNd1nYA/168s.jpg", "caption": "Back side of the menu"}]}}, {"review": {"des": "Hands down, absolutely the best beef brisket I've had in Chicago. It's really amazing. They run out of brisket every night, so if you want some, it's best to get here for an early dinner. The sides are amazing too -- try the corn bread, baked beans and the coleslaw. Fat Willy's also has a decent selection of beer on tap, and is located right across the street from a movie theater with cheap parking -- park in the parking garage, have an amazing BBQ dinner at Willy's and then grab a movie. Even if you don't grab a movie you can walk inside the theater to validate parking before you leave. Definitely recommended.", "pics": null}}, {"review": {"des": "Man...I came here for the burger. A friend of mine told me it was legit and I trust his judgment. For a place renown for it's BBQ... They could seriously hang their hat on the cheeseburger. Now I'm not saying it was on a level of Au Cheval... I'm saying that it did not disappoint at all. I got the single patty and it was juicy, cooked properly and filling. I put their spicy BBQ sauce on my fries and almost went into food coma. The fries were \"meh\" but that burger and the sauce were legit. For what I paid (under $15) I'll be back.", "pics": null}}, {"review": {"des": "Solid BBQ. It's a small place so the main issue is really just getting seated. Baby back ribs are their best, if they aren't sold out of them (which only happened to me once out of a couple visits)", "pics": null}}, {"review": {"des": "The food was delicious! I got the beef brisket with mashed potatoes, cole slaw, and giardiniera.", "pics": null}}, {"review": {"des": "Haven't been here for years. Absolutely love it every time!!! Got the pulled chicken sandwich and side of mac and cheese with a PBR. I don't know what it is about bbq sauce, but i HAVE to have a PBR with it... I feel like its a perfect marriage of flavors. Will definitely be back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cNWnGeYj3CeCF4I1Cdh0tg/348s.jpg", "caption": "I wish this had Smell-o-vision so you as could enjoy the bbq sauce tang in the air!"}]}}, {"review": {"des": "Very disappointed with this place. I was hoping to get great bbq and wasted $40. I called an order in for pick up as soon as they opened thinking I'd get fresh bbq but instead ended up wasting $40. I ordered the rib tips which were huge btw (not very appetizing) and also cold. I feel like I got bbq from the day before. There was no other explanation for it to be cold. I got steak fries which I assume are frozen then fried and Texas toast with it. None of it tasted good at all. I didn't feel like going back so I'll leave this review instead and never go back.", "pics": null}}, {"review": {"des": "Went to grab dinner before a movie. The food was good and the service was nice. The portions were pretty large for the entrees and I always seem to have leftovers when I go. The decor is quirky and fun. They have a mini outside patio for seating when weather permits.", "pics": null}}, {"review": {"des": "I really liked the food I ate at Fat Willy's.  The pulled chicken sandwich was delicious and piled with tons of melted cheese.  The BBQ sauce and the jalapeno corn fritters were also very good.  A few of my friends ordered platters and had a small banquet amongst themselves - this is a great option if you want to try a little bit of everything.<br><br>We arrived shortly after opening on a Saturday, when it wasn't super busy, but by the time we left several more tables were occupied.  There's plenty of seating for everyone, indoors and out, and there's takeout service as well.<br><br>There wasn't much of an explanation why, shortly after opening on a Saturday, they were out of so many things!  The service was borderline rude, becoming impatient with our group when they asked about menu items to be informed they couldn't have it, so of course the server had to wait for them to pick something else.  We did have a larger group, but the restaurant wasn't very busy, and their lack of preparedness wasn't really our problem.", "pics": null}}, {"review": {"des": "Wonderful service, nice atmosphere. <br><br>I recommend the pulled chicken sandwich and fries. Lots of BBQ sauces to dip it all in. I wasn't a fan of the Mac and cheese and baked beans I got alongside it. <br><br>Tip: they have a lunch special that, for some meals, you can get two additional sides for about a dollar each.<br><br>I would definitely go back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KzmNJK_JG1NJcomoswPS0A/168s.jpg", "caption": "Flying pig decoration outside"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DoSsDPvsWLUovFL-AOZxHA/168s.jpg", "caption": "Pulled Chicken Sandwich, fries, Mac and cheese, and baked beans lunch special. ~$13"}]}}, {"review": {"des": "Solid BBQ. If you go on off-days like Tuesday and Wednesday, they have pretty good specials. You can get a sandwich and a side for $13 or a rib tip dinner with two sides for $15, which are usually $16 and $18 respectively.<br><br>If you're feeling really hungry, the dinners are your best bet. The pork and the brisket are delicious, and this is one of the few BBQ/fried chicken places in Chicago that doesn't disappoint me with their sides (looking at you, Honey Butter). The green onion cornbread with butter is so good. I also like the mac and cheese.<br><br>I came here on a really cold evening craving soup and ended up getting the chili. Add onions and get the cornbread!! It's SO GOOD, and I never order chili from a restaurant. A cup with cornbread is $7 and very filling.", "pics": null}}, {"review": {"des": "Good spot for a pre-movie dinner. It was packed on a Saturday night, and we didn't have enough time to wait for a table. We ordered two sandwiches to go, and sat outside. Unfortunately, our food took an awful long time for a to-go order, so we had to scarf our food down.<br><br>We ordered the pulled pork and catfish po boy. The pulled pork was really good! Nice serving of meat, and really tasty! Sweet potato tater tots were also good. The catfish left a lot too be desired...it was VERY fishy, and had an off-putting texture to it. We only ate half of that, and split the pulled pork. <br><br>Small dining room, but seems to be a consistently hopping spot. I'd go back for another try, but would not recommend the catfish.", "pics": null}}, {"review": {"des": "I'm not really one for ribs but this place was right by one of my apartments and I would pick up smoked wings from here. Good god were they tasty. I should have tried out way more things on the menu but my philosophy is to pretty much stick with what works successfully for me and the wings always did. They were normally charred black with still having plenty of tasteful flavors.", "pics": null}}, {"review": {"des": "I absolutely love the pulled pork with the vinegar slaw.  If you stick to that it's great.  My husband is not a bbq fan, so when it was my turn to select where to order in from I grabbed at my chance to get my fix.  Unfortunately, everything outside the pulled pork was beyond disappointing.  My husband wanted a quality cheeseburger.  The menu burger came with bacon, grilled onions and bbq sauce- so I ordered everything on the side except the cheese.  The burger came drowned in bbq sauce.  The bottom part of the bun was so soaked it couldn't be picked up.  And for some reason they put the slice of cheap looking cheese on top of the sauce instead of on the meat.  The unmelted cheese slid off in one piece on a river of gooey bbq sauce; it was inedible....<br><br>The side coleslaw is slightly creamy and bland; and is NOT the same as the vinegar slaw they put on the pulled pork sandwich.  When I requested a side of the vinegar slaw instead of the creamy side slaw, I was told they don't offer it as a side...(and they're customer service acts like the order being placed is a real inconvenience to them).  My husband also ordered the gumbo with extra cornbread.  The cornbread was dry.  I've had the cornbread before and it was really good.  This time it tasted like leftover from a day (or two) before.  <br><br>Lastly we indulged in what we envisioned to be a decadent piece of pricey Coconut Cream Pie.  Our hearts sank when we opened the container.  It was a lump of runny cream in a crumble of a crust.  It was the saddest piece of any kind of pie I've ever seen.  <br><br>Next time I need my pulled pork fix - I'll be looking for a new joint.  Fat Willy's lost us after this order.", "pics": null}}, {"review": {"des": "Omg I forgot how great this place is. I had a Caesar Salad and my partner had the slab of ribs, collard greens, and corn bread. I loved the Caesar, it had a deviled egg and was perfectly dressed. The ribs were juicy and tender. The sauce is very good. One of the best things aside from the food was the service. Jack was knowledgeable about the menu and not afraid to get you to try new things. It has outdoor seating and a great atmosphere. Go eat ribs and be merry!", "pics": null}}, {"review": {"des": "My friend and I came here for a late dinner on a Wednesday and it was completely empty...and we got skeptical but the food and service proved us wrong. We shared the brisket meal (only a few dollars more and came with 2 small sides and 2 toasts). The briskets were delicious and all the sauces I tried paired well with it. Love the mashed potatoes w/ gravy and cole slaw is js regular ol' cole slaw. Great service (but that was because we were the only customers) but the food did take a bit longer than expected to come out..", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ijGyPvtFoab_HtBLnSHpsw/168s.jpg", "caption": "Brisket meal"}]}}, {"review": {"des": "A friend and I went to fat Willy's before a movie thinking it would be a great place to grab quick food before hand. We could not have been more wrong. <br><br>We arrived at 9pm and the place was not crowded at all. We got a table right away - however it took 40+ minutes to get our food. Our waiter was a hipster prick who was incredibly rude to both of us. When we asked why our food was taking so long he snarled at us and said the kitchen had a major back up. Looking around all 5 other tables were already eating or had finished... we caught him many times talking to coworkers and eating fries not paying any attention to his tables. <br><br>When the food finally did come it was cold, and flavorless. The brisket I ordered had no taste and was very fatty. The waiter threw 3 types of bbq sauce on the table and didn't explain what they were. He basically ignored us for the rest of the time we were there even when we needed drink refills. Because dinner took so long we ended up missing part of our movie. I complained to management and I will never be going back and have told my friends to never go. There are much better places to eat in Chicago.", "pics": null}}, {"review": {"des": "I had high expectations of this place, given how much praise it has on yelp and how many BBQ options there are in Chicago, however, I was very disappointed. My friend got the pulled chicken, which looked dry and unappetizing. He confirmed that the pulled chicken was indeed bland. I had the rib tips, which were not as tender as they could have been. Overall, the food didn't seem very fresh and it also wasn't tasty. Even my sides, cornbread and baked beans, fell extremely short. Sadly, I won't be returning here.", "pics": null}}, {"review": {"des": "The food is DELICIOUS. I'm sad they don't have the tater tots anymore but maybe next time I can talk them into making me a special order . I always get the Caesar salad and the corn fritters as an App, everything that I've eaten there is great and they have a full bar , the seating and atmosphere are great so far I've been then for my birthday 3 years in a row.", "pics": null}}, {"review": {"des": "Love, Love, Love this place. Ive been coming here for YEARS. Everyone is so sweet. The staff really attends to your needs and the best part there food is A.M.A.Z.I.N.G. The meat on the ribs is soo juicy that it mealts right off the bone. There pulled pork has this tanky zest to it, I cant put the words to describe it but its delicious. They use to have shrimp but the last time I went (this past weekend) they didnt have it on the menu (so sad about that, it was what I always ordered) but plenty of other options to pick from. A must to try.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dJ5JLZjSTMFih_u-I4b75Q/348s.jpg", "caption": "Full Slab of ribs with fries, home made mac and cheese, and house salad with half a cob"}]}}, {"review": {"des": "What kind of self respecting BBQ joint doesn't have brisket as a dinner option?  Ended up having to settle for the rib tips, which were dry.  My guess they were cooked a while ago.  Sides were the only redeeming factor.  Food was also very slow for being one of two tables seated.", "pics": null}}, {"review": {"des": "Unfortunately in a city with so many BBQ choices Fat Willy's should not be considered. The ribs were meaty but bland and the pulled pork was dried out. In addition, the prices are quite high, more than Smoque which is my go to for BBQ.", "pics": null}}, {"review": {"des": "The Rib Tips are Back! and better than before. The service seemed better also. Thanks for listening and bringing back the good stuff!!<br>This is what Ribs, Brisket and all that is REAL Barbeque is all about!<br>The Hamburgers aint bad either! The sauce is awesome too!<br>The service is \"so so\" but it doesn't bother me when those Rib Tips or Full Slab come my way! I like to mix the Spicy and Mild Sauces but they are both good on their own! They Slow cook Brisket all day like you should! Get it after 5pm. For all the food you get the price is not half bad!<br>Go you will not be dissapointed!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ajb3MQZdgD5cTUyHjGC2ZA/348s.jpg", "caption": "Rib Tip Dinner Mac & Cheese, Baked Beans!"}]}}, {"review": {"des": "Some of the best ribs Chicago has to offer are hiding in this unassuming building on a random Chicago block. <br><br>Great service. Amazing ribs. Killer sides. Fun patio vibe. Only complaint might be that their spicy hot sauce could afford to turn up the heat a bit, but it was still incredibly flavorful.<br><br>Don't let sleep on this place.", "pics": null}}, {"review": {"des": "Yes, Yes, and more Yes! Fat Willys is so good! It's moderately comparable to the fare at Lucille's BBQ, if you're familiar. I tried their baby back ribs, collard greens, and mac. I LOVED the greens and ribs. The mac, despite it being an extra $1, was underwhelming. It was very milky/watery and the uneven. It needs work. Notwithstanding, I still felt like they deserved four stars. The collard greens and ribs more than made up for the dismal mac. I'll definitely be back to try some of their other dishes! <br><br>Also - they deliver! That's going to be a big plus for me. Prices were what you'd expect at a decent BBQ joint. Worth the cost though. Definitely. (except for the mac).", "pics": null}}, {"review": {"des": "Beef brisket is so good and the staff is attentive & friendly. Can't go wrong with $4 whiskey lemonades either", "pics": null}}, {"review": {"des": "Holy Cannoli! I mean Holy Ribs ( they are holy, trust me)! Fat Willy's has the best baby back ribs I've ever had. Also, the best BROWNIE skillet in Chicago, and it's humongous <br>P.S: try the links as well. Delicious!", "pics": null}}, {"review": {"des": "Spare ribs were amazing! Best ribs I had in Chicago and Northwest Indiana! I recommend the medium for two people! Jalapeño fritters are great as well!", "pics": null}}, {"review": {"des": "My son and I been wanting to try this restaurant for the longest and I just want to say it was worth it .Its not so much of big place but nice and cozy place the waiter was very helpful love their ribs they have different sauces oh the corn is sweet and tender live it I will come again!!!!", "pics": null}}, {"review": {"des": "Been here several times and the food is always good.  Be prepared for a lot of food. My only complaint is that the Mac and cheese is extremely small portion compared to the rest of sides and you have to also pay extra for it.  The Mac and cheese is really good so it's disappointing that as a side it only offers you a few bites.  Great BBQ", "pics": null}}, {"review": {"des": "Stopped by this place on a cold and snowy evening. I came here a couple of years ago and remembered the ambiance as warm and comfortable. It still is. I got the gumbo and poutine and both were excellent. I would have given it 5 stars except they don't take American Express. Service was very good and prices were reasonable but not outstanding. Will probably return soon!", "pics": null}}, {"review": {"des": "I've liked everything I've gotten here. Their mac and cheese, mashed potatoes, cole slaw, and I've become seriously obsessed with their veggie burger and the avocado mayo that comes on top! The cornbread was also great. They lose a star because they are definitely overcharging for food that many true bbq fans would not consider \"authentic\" homestyle bbq.", "pics": null}}, {"review": {"des": "BBQ! Need I say more? Of course, mmmm mmmm good!<br><br>Rib  tips were tender and flavorful. $14 good price, came with Texas toast and fat fries. For those who don't normally eat...there isn't a lot of meat, but I grew up eating and I like. Better meal for lunch, ribs would of been too much food.<br><br>Bbq sauce good, but the spicy was not spicy. Nice the have a spiced vinegar, it was good on the fries.<br><br>Burger with bacon- my niece loved. She asked for a side of avocado mayo and she that made it REALLy good. <br><br>Location is off the corner, a hidden gem.  This was great, make it dinner and a movie night, the movie theatre is right there!<br><br>I will come back, but I wished they served Coke....not a Pepsi fan. <br><br>Server was great and attentive, 5 stars!<br><br>Not sure about parking, but there is parking lot for movie theater.", "pics": null}}, {"review": {"des": "Honestly.. this is the first time I've ever taken the time to write a review because I was so disappointed. My girlfriend and I were in the mood for ribs and hadn't tried this place before so we were pretty excited. We each ordered a 20 dollar half slab of ribs.. they came out super fast and were luke warm... super dry and lacked flavor. The spicy and mild BBQ sauce lacked any flavor and the collard greens, steak fries and slaw were extremely bland. However, the sweet potato wasnt bad. <br><br>The ribs seemed as if they'd been sitting all day and got zapped in the microwave for a minute and were served to us. Bummer. Hopefully other people have better experiences but I won't be back.", "pics": null}}, {"review": {"des": "Ouch. Where do people get four stars? I hate vomplsing to the waiter.  Not there fault the food is bland. I liked the two sides!  Cukes and vinager and sweer potato tots. I won't be back for sides.<br><br>Waiter really nice guy very attentive. Bland flavotless brisket. The ssuces did not save it. Friend's ribs same deal. <br><br>Riski g sounding like a drunk, my Margerita was all ice. I mean two sips and its done.  I used the ice in my water which oddly had none and was like room temperature.<br><br>The bathroom really stank. I mean tbe hallway leading up to it stank. A lot.<br><br>The place always looked reslly jumping in the past. Maybe new owners, new chef, maybe I just missed it's  heyday? I can't magine going back.", "pics": null}}, {"review": {"des": "Solid first visit! The pulled pork sandwich was very good - tender, smoky, not greasy, and fresh bun. Collared greens and cole slaw also get thumbs up. Friendly and attentive service, and a sincere \"thank you for the business.\" There will be a second visit.", "pics": null}}, {"review": {"des": "This was not the special rib shack I expected (ribs, frys, drink and good sauce). It is a kind of expensive sit down dinner place ($25/person w/o alcohol).<br><br>But the food was good: wife enjoyed her north carolina pulled pork dinner (could have passed on the cornbread but enjoyed the decadent although small portion of mac & cheese). I liked the large and filling veggie burger (they even offered sweet potato tater tots).<br><br>Kyle was a great server too. My only concern was that I thought the cost was high but the yelp coupon lessened my sticker shock...<br><br>You've Been Informed... Enjoy", "pics": null}}, {"review": {"des": "I know BBQ and this place didn't disappoint!  Amazing ribs and the collard greens hit the spot.  Also ate some of my wife's pulled pork sandwich, equally delicious.  Wasn't all that hungry when I came in and ended up licking the plate clean.  Service was fast and friendly.", "pics": null}}, {"review": {"des": "Disgusting! The worst ribs I've ever had in my life. Raw, hard, chewy & impossible to take off the bone. <br>I called the restaurant and the girl who picked up the phone was literally screaming at me telling me that their ribs are smoked and refused to even to listen. Gross!", "pics": null}}, {"review": {"des": "OK place but they do not have a lot on the menu.  It seems like most of the good stuff has been removed. The pulled chicken (which is the only chicken option) seemed like canned chicken and nothing special. The sauces were meh. Ok for a quick stop but not worth going out of your way for.", "pics": null}}, {"review": {"des": "Amazing food! I thought the BBQ Chicken was a. It overtook, dry, but it wasn't. Breast meat is extremely hard to make sure it's cooked and at the right temp. The rub is nice, but the meat could of use a little more smoked, chopped and finished in the grill for me. The BBQ sauce is unique! The best part was the fritters and collard green! They have a vinegar sugar sauce that still having me drooling on day 2.<br><br>Likes: <br>-Collard Green<br>-Personal and friendly services", "pics": null}}, {"review": {"des": "We stopped in here after a great recommendation by one of the Movie theater (across the street) employee. He bragged about the Poblano chicken sandwich.<br><br>For $17.00 l have to say l would have gotten into my car and drive anywhere where the food would be much better.  I wanted to like it so bad.  But the fried chicken sandwich was dry. Had to soak in their bbq sauce to be able to swallow it...<br><br>Stick with the ribs or anything moist for that matter. But the fried chicken was just not up to par for a ridic $15. Sand. <br>Corn on the cob was also meh. <br>Jerrys on Division (l musy say l miss you)", "pics": null}}, {"review": {"des": "Fall off the bone goodness! Gotta have the sweet potato tater tots and the whiskey lemonade. Service was great.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SkG9WOusy5Z9v5KQT9ZcQQ/168s.jpg", "caption": "Whiskey lemonade."}]}}, {"review": {"des": "Sadly, meat was fairly dry. Restaurant was fairly empty, but service was painstakingly slow. We waited ~35 mins for our food. We ordered the hot links, chicken, and brisket.<br><br>The + is their amazing vinegar sauce (it's on the table). I added it to everything, and it added some moisture, but it can't make up for parched meat. I would buy the sauce if I could, but I would not go back for BBQ.", "pics": null}}, {"review": {"des": "Thank you Fat Willys. I had the hot link sandwich and half a brisket sandwich and it was excellent.  Really liked horseradish sauce and grilled onions. Not sure I would order mac and cheese as a side to go again. <br>Man, awesome bbq sauce. I had to work on a Saturday to get down there but yummy.", "pics": null}}, {"review": {"des": "Fat Willy's did it just right...and even better, my dad absolutely LOVED the spare ribs here, and he's a picky SOB when it comes to his rib selection.<br><br>Stopped by for lunch yesterday and got a round of pulled pork sammies, brisket sammies, fries, mac and cheese, collard greens, gumbo and a shredded chicken sandwich as well.  Everything we tasted was great, but without question, the big moment during our meal came when my dad--completely unprompted--said that the spare ribs were the best he had ever tasted.<br><br>Let's just say that my dad has had ribs a few times over the course of his 71-year existence!<br><br>The decor/space at Fat Willy's is more highbrow than most of the \"rib shacks\" I have hit over the years, and the prices match up with that...a bit more expensive than, say, Smoque or Rub's Backcountry Smokehouse, for sure, but tables and service that is a little more price-appropriate.<br><br>Hit this place on a Tuesday so that you can finish dinner and roll across the street to see a movie on the cheap at the Regal ($7 on Tuesdays).  A hidden-in-plain-sight treasure!", "pics": null}}, {"review": {"des": "Such a great BBQ spot. I had the pulled pork sandwich, and drenched it in the Carolina vinegar, and it was amazing! Service was attentive, but not overbearing. Great suggestions. Great prices. The ambience was great for kids which is important for me. A top 3 favorite for me, in Chicago for BBQ.", "pics": null}}, {"review": {"des": "Right by the movies so it's a great spot to grab some food before seeing a show. The rib tips were good for the most part and might be the closest bbq I've had in Chicago so far since moving from down South. The mac and cheese (portion size and flavor) isn't worth the price though. Everything else was good.", "pics": null}}, {"review": {"des": "Their baby back ribs are perfectly cooked - moist nearly falling off the bone. However I did not like any of their barbecue sauces which had a weird flavor. Green onion cornbread was good as were collard greens. Service was excellent.", "pics": null}}, {"review": {"des": "Just found this joint on Google,glad we went a little out of our way to try it out. It's a small place with eclectic decor and a friendly staff that gave us a heads up about parking,don't bother driving around looking for street parking just pay the 2 bucks to park in the movie theater parking lot directly across from them. Was super convenient. We ordered the beef brisket poutine as a starter,which was really good,hadn't had poutine before so pleasantly surprised at how good it was,especially slathered in their hot bbq,sweet bbq,and \"Carolina\" style vinegar sauce. For my meal I went with the rib tips dinner (great smoke flavor) with sides of collared greens,baked beans,Mac n cheese. It comes with Texas toast,which is way better than the regular white bread you usually get with bbq. DH had the brisket,wasn't super crazy about the way it was served with the au jus,but did say it was cooked really well,very tender. Kids had the corn dog meals and had fun coloring on the paper tablecloth. In and out no wait,will definitely be back.", "pics": null}}, {"review": {"des": "Best ribs I've had since I moved away from my home state of Texas. Need I say more?<br><br>The atmosphere here is pretty awesome too and I'm looking forward to their patio opening back up for summer.<br><br>Pro tip: stick to the Memphis style bbq sauce. The Carolina stuff- as usual for Carolina \"bbq\"- is just weird and way too liquid-y. The ribs come slathered in delicious thick sauce, however, so I didn't actually need to add sauce to my ribs, but taste-tested their sauces just out of curiosity.", "pics": null}}, {"review": {"des": "Not as good as I remembered it.  Disappointing that at 6pm they were out of the beef brisket, tasted by husbands beef brisket sandwich it was bland tasting. The sweet potato was cold and bland.  Time to be on the lookout for another bbq joint. The customer service was good, thanking god for that.", "pics": null}}, {"review": {"des": "We made such a big mistake ordering a dinner per person. We got the full slab dinner and the rib tips dinner. Everything tasted great. The sides (cornbread, fries, and coleslaw) were so good. The cornbread is a must here. We each ended up only eating a bit before we got full so we had a lot for left overs. <br>Our waiter did talk a bit too fast so we couldn't understand him at some part. It doesn't matter bc we thought we had a steal for the amount to food that we got.", "pics": null}}, {"review": {"des": "I've been going to Fat Willy's for years now, and I'm never disappointed. The staff is great. The menu has just enough variety to not make your head go nuts and the food is good. I'm a big fan of brisket sandwich. Try it with some of their home made BBQ sauce and you'll understand why they are one of the better places in the northwest side of the city. <br><br>The rich smokey flavor just permeates the meat in such a way that you can go with or without sauce. I love to look at the bark that's formed on the ribs. Its such a mouth watering experience. To add to such a great protein. Add their corn bread and some of their homemade lemonade and you are transported to a blissful world of smokey loving. <br><br>Check them out before checking out a movie. Its worth the stop.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ib5WsUV85-3BoVWcWmYxCw/348s.jpg", "caption": "Poutine!"}]}}, {"review": {"des": "I have been in search of the ultimate restaurant for Barbecue at a sit down restaurant and I realized that it must be difficult to recreate that home grown flavor.  Well I'm happy now,  Fat Willy's is very close.  I had the Collard Greens, Baby Back Ribs, Corn Bread and the Pigtini cocktail.  The greens were tasty, the ribs were nice and tender, the corn bread was pretty good (a smidge of jiffy mix, but I'll give it a pass).  The cocktail was mediocre, but that's pretty common in restaurant life now.  My partner in Crime had the same dish, but he added on the Mac n' Cheese and he said it was very good (me not like Mac n' Cheese).  The menu has a lot of goodies that I'm looking forward to trying soon.  From the service to the food everything was consistent and very pleasant.  I'm so happy I found a good restaurant for Barbecue...Big ups to Fat Willy's!!!", "pics": null}}, {"review": {"des": "Fantastic service and great food we definitely recommend this place and will be returning soon", "pics": null}}, {"review": {"des": "I'd give 4 stars but they took the one thing that drew us to Fat Willy's off the menu...the wings. Please bring back your wings. They were in my top 5.", "pics": null}}, {"review": {"des": "This place has decent (read: mediocre) BBQ.  That's fine and all, but GOOD LORD, prices should reflect that.  It was $60 for two of us to eat here.<br><br>Just, holy crap.  WAY overpriced fit what it is.  There's no good BBQ in Chicago (I'm from right around Lockhart, TX), so I'd prefer to spend less elsewhere fit the same quality.", "pics": null}}, {"review": {"des": "My bf brought me to this place approx. 7 years ago for my b-day, ever since I tried their baby backs and spare ribs... We no longer go anywhere else. If your looking for good  tender ribs with flavor.. this is the spot! Just bumbed they got rid of the tater tots   other than that.. everything is delicious! Try the Coconut crème pie, Its not to sweet, its perfect!! Jack is always great on providing excellent service makes us feel welcomed, never rushes us out. Thanks Jack your awesome!", "pics": null}}, {"review": {"des": "My favorite BBQ in Chicago. <br><br>I've had the baby back ribs before, but when I went this past Monday I got the pulled pork dinner. It's a huge serving, enough to share for sure. As the sides I got the corn bread (because you're missing out if you don't) and the mac and cheese (it was fine, I'm realizing I'm not huge into mac and cheese). <br><br>My friend got an identical plate but she got the sweet potato tots with parmesan dip, and it was tasty. Don't really need a lot of them to enjoy them but again, enough of a portion to share with your friends. <br><br>Our table of six ended up splitting the brownie, which comes in a little cast iron skillet and is topped with a mountain of whipped cream and a scoop of ice cream. It was fine to share after such a huge meal, but if you're just coming for dessert, I'd say split it between two people. It took a while to come out but I think that's unusual because the waiter seemed to realize it was taking a while.<br><br>Service is great, too. Our waiter was friendly, charming and patient with our table of jokesters that likely just annoyed him - but he did not flinch in the face of puns.", "pics": null}}, {"review": {"des": "Went here before a movie.  We had to wait a while to get a table and then had to rush to finish to get to the movie on time.  Food came out pretty quickly and was good.  As much as I like barbecue, my brisket was a little too smokey for my taste.", "pics": null}}, {"review": {"des": "Good lunch, great menu. Had the ribs and spare ribs along with pork poutine and was able to share with 6 people.", "pics": null}}, {"review": {"des": "How is it possible that I have never yelped about one of my favorite go to restaurants in Chicago?!?!?! Yes, Fat Wily's is one of our favorite BBQ joints in the entire world!  And the people that work there are the best.   Even Jack.  : )   We have been coming to Fat Wily's for 15 years and will continue even though the took our favorite appetizer off the menu (yes that garlic artichoke dip needs to return people!!", "pics": null}}, {"review": {"des": "I read the reviews about this place the ribs were NOT good,  tough could barely chew never went back", "pics": null}}, {"review": {"des": "Super disappointing experience. Terrible bbq and the greens tasted like they were from a can. Overpriced.", "pics": null}}, {"review": {"des": "I'll start off with the fact that I love bbq. I seem them out when I travel. <br><br>Overall, this was a strange bbq experience. <br><br>I realize the place has ribs in the title but I go for brisket. A good brisket is the staple of a bbq plane in my opinion. <br><br>I went for the brisket dinner at a very steep $19. I went for the Mac and cheese which was an extra dollar and the beans as my other side. Baked beans are another bbq joint staple that I use to judge a place. <br><br>I'll start with the good. The brisket:  meat was super tender and well prepared. I took a star away due to the grease that was floating under the meat on the plate. It wasn't appetizing. I also don't understand why the meat came with a pile of caramelized onions on top. It didn't need it. It also came with a side of juice and horseradish sauce. Again- not needed. If the meat and the sauce are good, no need for the juice or horseradish sauce. <br><br>The beans were too sweet and didn't have any interest. There weren't any chunks of meat and they tasted like they didn't have much seasoning. <br><br>I always look forward to a good Mac and cheese. Another star down for this. It cost an extra dollar but came in a tiny foil dish. Maybe 3-4 ounces at the most. I didn't finish it because it wasn't good. It's like the pasta needed salt or the rue needed some additional seasoning. It was bland. :(<br><br>Overall, it could be so much better. If I came again, I'd get the sandwich instead of the dinner and I'd try another 2 sides.", "pics": null}}, {"review": {"des": "If youre craving some good bbq, and good service, youve found it. Before you even walk in you can smell good cooking. The baby back ribs are phenomenal. I suggest their cornbread, and most of all their bloody mary. (The premium one!)<br>Me and my fam have made this one of our go to places. I even had my birthday there. Definitely worth a visit.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dSDZO44tA__zQNb24XqsqQ/348s.jpg", "caption": "Perfection"}]}}, {"review": {"des": "I've smelled amazing scent of this place from the Regal Webster Theater across the street for years. Yesterday I decided to go try them out before Batman vs Superman. No disappointment. One of the best poutines I've ever had. Great pulled pork sandwich. The mac & cheese was pretty good & the collard greens were good. No complaints & all praises", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/k2AB1wT6jCdKBZkfOJ8uHA/168s.jpg", "caption": "Spare Ribs, Collard Greens, Mac & Cheese, Hot Link, Pulled Pork Sandwich & Fries w/ Cole Slaw"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MPJ8hSxVb7b8f95HZsBsXA/168s.jpg", "caption": "Pulled Pork Poutine"}]}}, {"review": {"des": "It smells great, tastes fine. It's one of the only options for dinner next to the Regal North Stadium cinema so it's a decent option for that.", "pics": null}}, {"review": {"des": "Everytime I goto the cinema, I goto Fat Willy's.  Everytime I goto Fat Willy's, I'm disappointed.  Everytime I complain about my disappointment with Fat Willy's, my wife reminds me about how I'm always disappointed and maybe we should stop going there.<br><br>The service is always slow no matter the day or time.  The meat is usually alright, nothing amazing.  This time the pulled pork was dry, tough, and chewy.  Drenching it in sauce helped.  A solid \"Meh.\"", "pics": null}}, {"review": {"des": "I was taken away from the moment I walked in. My friend and I arrived five minutes, prior to closing. Instead of giving us looks of distraught and unhappiness, the manager and server greeted us with smiles and courtesy. Never were we rushed, regardless of the time being. Aside from that, both the ribs and Burger were juicy, delicious, and French. Can't forget the loaded fries, definitely not prefrozen. Great music, great vibes, great food, and most importantly great customer service. You definitely have a returning customer here!", "pics": null}}, {"review": {"des": "Oh my BBQ, this place is spectacular. It looks kind of like a sketchy dive down an alley on the outside, but inside is one incredible restaurant. We got Pulled Pork Poutine and a half rack of baby back ribs and it was a more than ample amount of incredible food for two people. We also got their Cherry Tree Cider and a house-made Strawberry Lemonade; both delicious. The service was also incredibly fast and attentive every step of the way: drinks, ordering, food, and checks. It was sooo delicious too and not overpriced for the quality. They had real fabric table cloths and silverware, but with paper on the tabletops and paper napkins for all that messy barbecue. ;) Really a great experience. Highly recommend!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Eq-4DKq2qnKfNTERcYXZYw/168s.jpg", "caption": "Half rack of Baby Back Ribs with included sides of pickles, mac and cheese, and Texas toast"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/n9mdoToiEjBnDt3xtSP0JA/168s.jpg", "caption": "Pulled Pork Poutine with bacon and cheese curds"}]}}, {"review": {"des": "Loved it! Some of the best BBQ in the city. Everything we tried was great - the poutine, corn dogs with fat Willy sauce, sweet potato tots, corn bread with honey butter! Great table sauces too! Loved the vinegar one. Will be back!", "pics": null}}, {"review": {"des": "We came here around 4 pm on a Friday evening. We were a bit worried that there would be a wait so we came here early with intent to beat the dinner rush. We were one of two customers there!<br><br>We knew we wanted ribs. So we went with a half order of the babyback ribs and a half order of the spare ribs. We didn't know the difference, so our waitress was nice enough to explain the different cuts. The babyback ribs are leaner with more meat and the spare ribs are fatter, a cut from the belly area. They also provide delicious bbq sauces to eat with your ribs. I personally liked the spicy bbq sauce. It wasn't super spicy, but it added a nice little kick to the ribs. I also really like the spare ribs more, probably because it's fattier, but it really was tastier and juicier. Overall, their ribs were delicious.<br><br>An order of ribs comes with 2 sides. Since we ordered 2 ribs, we got 4 sides. We went with the baked beans, sweet potato tots, corn bread, and cole slaw. They were all pretty good.<br><br>Prices were reasonable. Each half order was $17. The spare ribs came with 4 large ribs and the the baby back came with 5 smaller ones.<br><br>Service was great. Our waitress was very helpful and our food came out pretty fast.<br><br>I'll definitely be back next time for more spareribs. yummm.", "pics": null}}, {"review": {"des": "Best Ribs in town! hands down!!!!  The service is friendly plus good atmosphere. the mash potatoes  mmmmmmmmmmh' it goes in the list of one of the best. The lemonade is heaven. see you soon guys", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NWntoYF0BeGvxRmG5LX2iA/348s.jpg", "caption": "I am the pig! Nom nom"}]}}, {"review": {"des": "Soul food is all about food for the soul...and Fat Willie's will comfort your soul with good cookin'!<br><br>The gumbo is spicy, the shrimp truly JUMBO and BBQ sauce tangy!", "pics": null}}, {"review": {"des": "Everybody tries to do BBQ nowadays, but not everyone can get it right. With most places the BBQ sauce isn't great and/or the meat overcooked/ too tough. Fat Willy's is one of those in-between BBQ joints. I ordered the Baby Back dinner with a trio of BBQ sliders. The sides I chose were Texas toast and sweet potato tots. <br><br>Delivery was surprisingly fast, I ordered at a time when I thought they might be real busy, but they were at my door in about 20-25 minutes. Opening my treats was fun because everything was packed neatly and even the sauce wasn't spilling everywhere which was great. One thing I can say about the appearance of everything is that it looks fantastic, definitely some high-class BBQ here. They gave me some blue cheese sauce along with 4 small cups of their homemade BBQ sauce. The BBQ sauce has bits of meat mixed in for added taste. Taste testing the sauces beforehand they honestly weren't that good, especially the blue cheese sauce which had a chalky texture and taste to it. <br><br>Digging into my main course, the ribs was an experience. The ribs themselves were perfectly cooked and nearly fell off the bone! It was coated in enough sauce saw that it wasn't a mess eating them yet you could still taste it which is a plus. The meat you could tell wasn't marinated or anything, just cooked straight, but still came out great. The sliders were excellent as well and were a great way for me to try out all the different meats (they had loads on meat and cheese on them too) without paying a huge amount to try them all individually.<br><br>Overall this is a pretty good BBQ joint. Their house sauces definitely need some work, but the meat is good quality and cooked perfectly. The prices are a bit over the top considering they're not doing anything unique (the ribs were $17 and those 3 sliders were $9 + tax on everything.) I give it a 3.5/5 stars.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6HtnLBypuOWJEC-3YUZEeQ/348s.jpg", "caption": "Who doesn't love some baby back ribs?"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RogO1zyMWuyzfhCFNgsEfg/168s.jpg", "caption": "Mmm sliders"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pu0N61iUJfMy2auR1LbGWw/168s.jpg", "caption": "One good shot deserves another"}]}}, {"review": {"des": "One of the best freakin BBQ places in the city. I live 30 miles away and i'm happy travel into the city to enjoy this place. I highly recommend their rib tips.", "pics": null}}, {"review": {"des": "A birthday bash with a group of 11 and we somehow managed to get a table without a wait on a Saturday at 7:30pm! This sets the tone for an awesome dinner. <br><br>As a group, we shared a full slab of baby back ribs and a full slab of spare ribs. What's the difference? Baby back ribs are taken from the top of the rib cage whereas spare ribs are taken from the belly within the rib cage. Hence, spare ribs are longer and contain more fat. The full slabs arrive uncut, so be prepared to work out those arms because it takes a bit of effort and time to slice them up for sharing. The ribs were highly enjoyable but if we had to choose, our favorite of the two would be the spare ribs. We like that extra fat clinging to the bones. Our sides were collard greens, mac and cheese, green onion and cheddar corn bread, and Texas toast. The latter two (carbs) were very ideal for sauce sopping. <br><br>They ran out of beef brisket for the family dinners, but I had to have my share of beef brisket while I was there. So I ordered a full beef brisket sandwich and split it with a friend. For $8, it was a very generous portion and perfect for sharing. But, I'm not sure if I made the right choice. Perhaps, they use a different cut for sandwiches because the meat was extremely dry and tough. Dunking it in barbecue sauce helped the cause though.  <br><br>In addition, we also shared a pitcher of hogarita which is the house margarita. It came in a flowery, vase-looking pitcher with little jars on the side for drinking. The pitcher contained mostly of ice, making it difficult to pour from the pitcher and not quite enough for sharing until we waited for the ice to melt.<br><br>All in all, food was wonderful and didn't cause a lot of damage to our wallets. It was approximately $30 per person. Parking was also relatively easy if you don't mind the slight walk. We found free parking three blocks away. Do be careful of the residential parking restrictions though.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/f8EkXAdG0Yrs2KvKhGMMww/348s.jpg", "caption": "Hogarita"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DZK2m4IvU3lP3rHuEcZDaA/168s.jpg", "caption": "Half order of chicken"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3NsfN7FPWbZrB2lscXIvZw/168s.jpg", "caption": "Sliders"}]}}, {"review": {"des": "Man I miss this place - used to be right down the road from my house when I lived in Chicago.  Now i'm in LA and there is NOTHING that comes close to BBQ like you can get at Fat Willy's. <br><br>And, the name is the best!", "pics": null}}, {"review": {"des": "If you like Texas style barbecue brisket this is NOT the place. There was no smoke ring on my meat I think it was Cooked in a slow cooker the meet was gray. The ribs however were ok so maybe they should stick to that.", "pics": null}}, {"review": {"des": "I used to think that real smoked BBQ didn't exist in Chicago but I was wrong. Fat Willy's is the real deal. <br><br>After seeing them on TLC Best Food Ever, I had to try the ribs since they take two days to prepare. I thought it was blasphemous to brine the ribs but the flavor of these ribs were spectacular. There was the smoke ring, the meat pulled off the bone easily, and they were charred well. Normally, I'm a sauce kind of guy but these ribs didn't need any since they were great on their own. All the preparation paid off because the taste was unlike anything I've had before. The prices are steep at $26 for a full slab of ribs but when you are offering something this good, you can justify the price. <br><br>This place gets packed quick but there's an outdoor patio and ordering take out is swift. For the sides, you have to get the mac and cheese. It's everything you want - super cheesy and artery clogging with a crunchy topping. With poutine, chicken and waffles (Sundays only), and po boys on the menu, it's no wonder that you can easily become the fat kid at the table and order several items.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yohYAbgu9OkShc_7LFYUMA/168s.jpg", "caption": "To go: 1/2 slab, slaw, and Mac n cheese"}]}}, {"review": {"des": "I needed this place over the 4th and forgot the baby backs are fit for a king for all you barbecue lovers and giant hamburgers lovers this is the spot<br>Guaranteed to be the best", "pics": null}}, {"review": {"des": "Always good! Brisket is tasty and the Mac n cheese is phenomenal.  Tried the jalapeno corn fritters, for the first time and they were pretty good.  We also tried the pulled pork and that was good as well.  BBQ sauce is great, just perfect.   Delivery is fast and food comes nicely packaged, and they never forget anything.   Craving BBQ, then this will definitely deliver.", "pics": null}}, {"review": {"des": "I remember coming to this place on there grand opening.The food is very good. I use to eat here a few times a week. Its changed alot. Different staff, and the prices got too expensive. The prices are way too high for the amount of food you get.The owner is getting too greedy. You're scaring your customers away with these ridiculous high prices. Come down on your prices, otherwise you won't be around long.", "pics": null}}, {"review": {"des": "Ordered delivery. Small sized side portions. Meat is great! But the sides Fat Willy's, the size of them, could've been fatter.", "pics": null}}, {"review": {"des": "I have a bone to pick with Fat Willy's Rib Shack, a little while ago I was picking bones out of my throat, which I have to say is very unpleasant. I had the pulled chicken sandwich. It was quite tasty but a little dry. The bread and meat were really soft, but the friggin' bones in the pulled chicken were hard, you know, bones have a tendency to be that way, especially when they are sliding down your throat!<br><br>I recommend pulling the meat apart on the sandwich yourself to check for bones if you don't want to risk death.<br><br>I only get food from this place about once a year, two at the most, so even though the prices were high I just paid and complained. Well I'm NOT going to be doing THAT anymore. I'm done being robbed, though I suppose I can't truly say I was robbed because I knew the prices had gone up and I still placed an order like a fool.<br><br>$19 for 1 medium-sized piece of catfish, some sweet potato tots, mashed potatoes and some bread. About two years ago the price was $16, which was ridiculous for what you got, but now the $19 price makes it a shame. My mother laughed when she saw what I had, and said it wasn't worth even $5.<br><br>The catfish was super soggy on the bottom, like wet. I'm very unhappy. I'm going to go cough up some more bones now.", "pics": null}}, {"review": {"des": "Amazing food and drinks <br>I tried the beef brisket and ribs. Good atmosphere I really enjoyed this cozy restaurant. Only thing is the parking is a little tough", "pics": null}}, {"review": {"des": "This little shack packs a big punch! Their brisket sandwich is pretty darn good and their ribs darn right awesome. The parmesan sauce for the sweet potato tots was amazing - could eat it by itself!! Corn bread could've been warmer but the honey butter perfected it!!!! We will be back!", "pics": null}}, {"review": {"des": "Wow those ribs are delish!! I ordered take out- full slab of baby backs that came with 2 sides. I had the collards and steak fries. They also include grilled garlic Texas toast which was a nice addition. The collards were nice and tender and not too salty like they tend to be at other places.  The steak fries were amazing!! So fresh and soft on the inside.  Generous portion too! They also included 2 containers of extra BBQ with my order free of charge. This was much appreciated bc I like my ribs saucy! My eyes were bigger than my stomach however and I could only finish half of the slab because it was so hugggggge! I swear it was as long as my arm- they do not skimp! The other half slab made delicious leftovers too! They are a tad pricey ($30 for a full slab) but it is well worth it and comes with sides. They also had everything ready to go when I arrived and it was still warm when I got home. The order was correct too- an added bonus! I will definitely be back!", "pics": null}}, {"review": {"des": "Fantastic place for bbq. Favorite sauce around. Everything they make tastes amazing.<br><br>Try the brisket with their vinegar bbq sauce.", "pics": null}}, {"review": {"des": "Disappointing.  We were early for a movie and so walked across the street to grab a bite of real food rather than fill up on popcorn and candy.  First, the place was pretty much empty and we had to wait for the waiter to even acknowledge we existed.  Second, you can't deviate from how they have things on the menu.  I wanted half a sandwich with cornbread and coleslaw.  Was told it couldn't be done even for an extra charge.  SO I Just got the cornbread and the coleslaw.  My husband got the pulled pork sandwich with the sides it came with and he said the sandwich was very dry.  The cornbread was bland (Jiffy makes better) and the coleslaw was nothing special.  Maybe we are spoiled because we have a really good BBQ place close to the house (Smoque) but we will NEVER go to Fat Willy's again.  Too many other great options in town, not worth wasting the money or the meal on.", "pics": null}}, {"review": {"des": "Damn good barbecue for a place in the Midwest. Gumbo and pulled pork were darn good. Beef ribs were a bit chewy. Nice simple fun \"southern\" cocktails.", "pics": null}}, {"review": {"des": "***Here's a tip: park in the movie theatre parking lot, it's only $2, just run in the theatre and validate your ticket***<br><br>I wish I could give it more than 2 stars just seeing that it has such great reviews, but I can't. I'm a huge fan of ribs so I came here with high expectations after reading the reviews. I got the full slab of baby back ribs with mac n cheese and cole slaw as my sides. No joke everything failed me, the mac n cheese was in this tiny little aluminum cup and tasted horrible, cole slaw was okay but you got have a good slaw at a BBQ joint and definitely good mac n cheese if you're gonna put it on the menu. My friend had their beef brisket with the same sides as me, he said the same thing I did. The brisket was very dry and didn't have much flavor. The one good thing we had is the pulled pork poutine, now that was tasty.<br><br>This place in my opinion is over priced for what it is. The ribs we thought were lacking meat and it wasn't \"fall off the bone\" like they said. Service was great but the food isn't anything I would ever come back and spend that kind of money on.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fV8D0UqWF8j1yeRLt0qHUA/348s.jpg", "caption": "Pulled pork poutine"}]}}, {"review": {"des": "Great brisket. Friendly place. A little high priced but what isn't in liberal DF Chicago?", "pics": null}}, {"review": {"des": "The vegetable salad with homemade corn bread croutons is a standout. The ribs are good. Skip the pulled chicken- it was a huge bowl of shredded chicken with no sauce. How odd ( obviously I added bbq sauce to dr it up but huh?). Cute barebones bbq restaurant. Good and fast service once you snag a table.", "pics": null}}, {"review": {"des": "I've eaten here a few times over the years, and the BBQ has been disappointing overall. <br>The one good thing was the pulled pork sandwich. Brisket & ribs were overcooked and very small portions for the price. $20 for a dinky half slab of baby backs? Nope. You can get a lot more for your money elsewhere. <br><br>It smells great when passing by and going to Owen & Engine, but I doubt i'll be back any time soon.", "pics": null}}, {"review": {"des": "The ribs here are awesome. Unfortunately I did not order the ribs this time. I ordered the Jalapeño Corn Fritters as an appetizer and the Crusted Catfish with sides of coleslaw and greens. The Corn Fritters were really good. It did taste like they needed to change the oil to the fryer. If that's not how they prepare them, that's the flavor they had. Overall they were good. Slap some bbq sauce on and it was ok. The catfish had the same oil flavor, but they provided the best garlic sauce in life. Slap some garlic sauce on the catfish and you don't even taste the oil flavor. The greens was one of the better tasting greens I've had. The coleslaw... oh boy! I thought it tasted like a marker! (What a marker smells like people) I had my date try it. He said it tasted like an eraser, tried it again, and no, decided it tasted like what an entire pencil smells like. Overall the food was ok, I guess. Here's what bothered me. The waitress asked if I wanted my food to go but then proceeded to pick up utensils I was not using to eat and placed them on my plate of food. She was cleaning my table, using my plate. I wanted my food to go but decided against it after she did that.", "pics": null}}]}