{"name": "fat-rice-chicago", "reviews": [{"review": {"des": "My group and I made reservation for 5.45p on a Friday night, and when we showed up to the restaurant on the corner of Diversey and Sacramento, we were directed towards the Bakery! It was quite nice because they serve the exact same food, just means there's more seating. And we didn't mind being closed to some sweet treats...<br>Our waitress was super welcoming and informative. Only one of us has been to Fat Rice, so majority didn't know what to order, and their menu is short but overwhelming enough! So, per our server recs, we ordered the following: <br>+Curry vegetable samosas = love! so crispy and fresh. The tamarind sauce makes for a perfect tangy taste. <br>+Pork and ginger dumplings = come in 5 pieces in a bowl of sauce. You're supposed to put the entire dumpling in one go rather than bite into it to get the fullest flavor. I'm a fan of the woodear mushroom, just the right amount of chewiness and crunch. <br>+Lacassa = stirfry noods with shrimp/char siu pork/tofu! Absolutely delicious. <br>+\"Cereal\" spaghetti squash = so this looks like mush haha but it's a coconutty curry dish. Amazing. <br>+FAT Rice = of course we had to go big! this plate is a whopping $48, split between 5 tiny girls. We were soooo full. If you're a meat lover, you are in heaven! It takes on the idea of an Asian paella? I'm here for it! <br>So, needless to say, we were all super happy and satisfied at the end. Their cocktails are amazing as well. I was sipping on the Bright Young Thing all night, while my friends had the Old fashioned and a special cocktail that I couldn't recall now. Average price for each is $11-13. <br>Overall, I'm a big fan. I want to come back and try everything else on that menu, especially the Chilli Prawns. <br>*For those out there that want an entire night out, here was our agenda and it was perfect - 1) Fat rice 2) Lost Lake 3) Slippery Slope! BAM. All walking distance. You're welcome!", "pics": null}}, {"review": {"des": "CONCEPT: Love the combination of influences from Macau and Portugal (each dish says what region inspired the dish, or if it is a Fat Rice original). The diversity of flavors at this place is amazing...as my friend said you may think you know what you are getting when you order it but you will be surprised.<br><br>WAIT TIME: Came here last night with 2 friends and it was BUSY for a Tuesday night...even though we had a reservation, we still had to wait a few minutes, but nothing unreasonable.<br><br>AMBIANCE/SEATING: Not too big of a restaurant but most seating is at long wooden tables so you will be elbow to elbow with strangers. That said, it adds to the lively atmosphere...you get to check out what they are ordering (and maybe even let them influence your own ordering experience).<br><br>SERVICE: Both the hostess and the servers were friendly and professional. Our waitress was attentive but not overbearing, a perfect combination. Each time a dish was brought out (often by a different server), they describe the dish which just gets you excited to eat it!<br><br>FOOD: As I talked about in the CONCEPT section, the flavors here are so diverse and not stuff you will find anywhere else. The food is meant to share so we ordered a bunch of dishes. The menu did have \"November  2018\" at the top so it likely changes and you may not be able to find the below dishes in the future.<br><br>Fava Escabeche: Pickled fava beans which were a great pallate cleanser for the rest of the meal<br><br>Bacalhau de vovo: Salted cod spread over Portuguese bread...delicious! Reminded me of hummus.<br><br>Pork + Ginger Dumplings: Similar to dumplings you'll find elsewhere but with woodear mushrooms (yum!)<br><br>\"Cereal\" Spaghetti Squash: Spaghetti Squash in a coconut milk broth topped with corn flakes. This was so good this had me saying that I would eat corn flakes in coconut milk as a snack...and now I'm craving that.<br><br>Raba Raba: Perhaps my favorite dish...stir-fried mixed greens in an amazing sauce...I wish I could make greens like this at home.<br><br>Lacassa: Rice noodle stir fry which reminded me of really good street food I found in Southeast Asia. Add some of the Diablo sauce on top for an extra kick!<br><br>Kari Kapitan: Spicy Chili Chicken with Chinese Bacon. We ordered rice just to let it soak in this sauce.<br><br>VALUE: Definitely on the pricier side for the portion size but I am happy to pay for a great meal.<br><br>OVERALL: Loved my meal here and would definitely come back (I hear they have a good brunch too!)", "pics": null}}, {"review": {"des": "By far one of my new favorite restaurants in the city. Everything we ordered was delicious. They even did an amazing job in accommodating for my daughter's allergies. We ordered the piri piri chicken, dumplings, chili prawns, coconut rice, Portuguese bread, minchi, and char siu pork and freak of nature tea. All of it and I mean all of it was delicious! My favorite of those was the char siu pork. The restaurant itself was a bit crowded and loud but it brought ppl together. We had a short chat with the lovely ppl next to us. <br><br>Service was amazing. My reservation was at 1 pm on Saturday. But I got there about 15 min early and they were able to us. The waitress asked us about drinks and allergies right away. Everyone was asking if we needed anything and my water was always full.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zKTLuyBkpqKv9Y8_RSiS2A/348s.jpg", "caption": "Coconut Rice"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rIsNnN9AGj-fHfQSOYcCcA/168s.jpg", "caption": "Piri Piri Chicken"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9tqSlHJkTeRLiVg3iEpsTQ/168s.jpg", "caption": "Minchi"}]}}, {"review": {"des": "I've heard a lot of good things about Fat Rice and had to try this Portuguese/Chinese fusion food for myself. Strangely, after making reservations, we were actually told to walk down the block to their sister location, at the Bakery.<br><br>We were given a quick rundown of the menu, but the staff didn't appear very enthusiastic, or friendly. As we weren't very hungry, we pickled one appetizer and the signature arroz gordo to share between the three of us.<br>We started with the bacalhau da vovó ($12) (house cured salt cod spread, with olives, chili, mint, and papo seco) to start. The spread was quite good and not overly salty.<br><br>For the name implies, the arroz gordo \"The Fat Rice\" has pretty much a hodgepodge of different proteins mixed onto rice. This included tender curried chicken, char siu, linguica, wood-roasted beef, and chili prawns ($48, + $3 for additional prawn). The flavors were great and there were so many different types of meats involved. But, found the chili prawns too spicy to enjoy and after tax & tip, a bowl of hodgepodge fried rice at $20 per person is a bit too expensive for what should be comfort food at a not so comfort food price.<br><br>I like the concept of fat rice and the international flavors it tries to share, but here we have a place that takes a niche cuisine that has roots in comfort and homey dishes, scales up the price, and upsells it to people who aren't familiar with the flavors and calls it fusion cuisine.", "pics": null}}, {"review": {"des": "It's been such a long time since I last had Macanese food, and to eat it again at Fat Rice was such a pleasure. I love fusion cuisine that has been shaped by history and Macanese cuisine is a prime example of that. The menu at Fat Rice showcases a beautiful blend of Chinese (pork and ginger dumplings) to Southeast Asian (kari kapitan) to Indian (prawn balchao fried rice) to Portuguese (bacalhau da vovó) influences in their menu that celebrate the cultural melting pot of Macau. <br><br>Dinner reservations were a little hard to make for the weekend, so I ended up coming for lunch, and even then the restaurant was pretty crowded. Between my friend and I, we ordered three plates to share and we were barely able to finish everything. I would recommend coming with a group especially since everything on the menu looks so enticing. We ordered the pork and ginger dumplings ($13), sweet and sour tofu ($15), and mushroom omelette ($14). <br><br>The pork dumplings were pretty decent, with wood-ear mushrooms adding a refreshing, crunchy texture. The dumpling wrapper was substantial enough to hold the pork and ginger filling, but not overly thick enough to taste doughy or mushy (a major pet peeve of mine). However, what really elevated the dumplings was the accompanying XO sauce, which was packed full of spicy umami flavor. It was almost as good as my grandma's version-- a comparison I do not make lightly (especially since her secret recipe is a labor of love, but that's why Fat Rice is so great; there is so much love overflowing from the food). <br><br>The sweet and sour tofu was probably my favorite dish out of the three. The tofu is lightly fried and smothered with fermented black beans, fresh scallions, cucumbers, bell peppers and red onions, and fried enoki mushrooms. The whole dish is a symphony of contrasts from texture (soft tofu and crispy enoki) to temperature (cooked tofu and raw toppings) to taste (salty, pungent black beans to refreshing, warming ginger). The fried enoki mushrooms were definitely my favorite element of the dish. <br><br>The mushroom omelette was my friend's favorite pick. Sweet and savory, with chewy, mochi-like bits that reminded me of silver pin noodles, the dish was more dough that mushrooms. The few mushrooms I picked out were mainly shiitake and oyster. It was pretty good, though it paled in comparison to the dumplings and tofu. <br><br>Overall, my visit to Fat Rice far exceeded my expectations, which were set quite high already. I cannot wait to come back again for a second round. Furthermore, I came for a birthday, and my server was nice enough to present a birthday bun with a candle. The bun was scrumptious, with colorful sprinkles and a coconutty aroma. But then I saw she charged me for it, but it's cool Fat Rice. Everything was so good, I'll let it slide. In fact, I went next door to their bakery and bought another bun for the road.", "pics": null}}, {"review": {"des": "Maybe I expected too much from Fat Rice after all the great reviews from other Yelpers. Maybe I didn't pick the right items. <br><br>My husband and I shared their famous arroz gordo \"The Fat Rice\". It was plenty of food for the both of us! I liked that there was a variety of meat, each with their own flavors. My favorites were the shrimp and the beef. This dish overall was fairly dry. <br><br>Fat Rice, I have not given up on you! I will come back and try other dishes!", "pics": null}}, {"review": {"des": "I have been to Fat Rice 5 years ago while visiting and was so happy to return, this dinner did not disappoint! I was pleasantly surprised that they could now take reservations. I went there right at the opening and the place got packed not even 30 min after. <br><br>The food was delicious, my favorite dishes were the pork and ginger dumplings: the sweet corn dashi, garlic chili oil, woodear mushroom combination was great. My other favorite dish for the night was as well as the seared duck breast, accompanied by farm carrots, stonefruit and marigold. The duck was slightly crispy on the outside and very tender on the inside, loved it. I also got the prawn balchao fried rice (with spiced shrimp chutney, peas, egg, lemon achar and cilantro), it was actually a great combination with the duck. I think that I would have found that a bit plane if I was eating it alone. <br><br>Then to conclude, desert fest with what they call the bacon from heaven. It was  a custard cake of almond, honey, cinnamon. It would have been perfect with some tea on the side! I recommend sharing several dishes to get a taste of it. I love the space as well, the decoration is totally cute. <br><br>I enjoyed this yummy dinner and can't wait to go back!", "pics": null}}, {"review": {"des": "The atmosphere and service were great but the food was bland. I had high expectations from what I have heard, and maybe we ordered wrong, but all six dishes we got were bland and uninspired. I was really disappointed. I'll probably give it one more crack and order the signature \"Gordo Arroz/Fat Rice\" dish before giving up on this place", "pics": null}}, {"review": {"des": "Super cute decor and vibe! The owner definitely put alot of thought into the design of this restaurant. <br>My friend and I went for lunch and we sat at the bar. <br>Our server was very attentive and kindly went through the menu with us. I also appreciated that he asked about any allergies we had because my friend is GF! <br>Here's what we decided on:<br>Vegetable curry with a side of coconut rice<br>Piri Piri Chicken <br><br>The portions are pretty big and we could not finish everything! Fat rice is definitely a different twist to the typical Asian cuisine. I loved that limy/spicy twist to it!! I would definitely recommended this place to people that love waking up their taste buds! <br>The chicken is a must! The olives combined in the dish is just amazing. The curry was pretty average, it was good but nothing special! <br>Btw the vintage pictures of the old people on the bathroom door are actually pictures of the owner's parents.", "pics": null}}, {"review": {"des": "This was an interesting family style Portuguese restaurant.  We shared a Fat Rice between 3 people and had leftovers. They really need to serve it in a larger dish, and I wish the shrimp came peeled. The flavor was good. Street parking can be tricky so avoid crowded times.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BtTeNg2hloiqahtjafE6-g/348s.jpg", "caption": "Fat Rice"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4B-6Uq5nO1mPFRdOjFDyUQ/168s.jpg", "caption": "Pineapple bbq bao"}]}}, {"review": {"des": "Eh, it was all just ok. I was ok with everything we had, and one or two things was good, but nothing would really motivate me to come back. When we went, the place was crowded, but I don't really see why.<br><br>Starting with the good, the wait staff was all very very helpful and friendly. Excellent service with staff that would explain in good detail everything we wanted to know about each dish.<br><br>My biggest problem is that I barely remember anything I ate because it was all just so normal. Don't get me wrong, it was all not bad, but nothing stood out to me beyond a couple dishes that I'll point out now.<br><br>The beans were good. Had a nice taste to them for a low price. I was skeptical in trying them because they didn't look good, but they were tasty. In addition, one of the savory buns, the one with the poppy seeds was tasty. To top it off, their speciality fat rice dish was very tasty and had a ton of different meats with it. If you come here, you should definitely get it.<br><br>The prices weren't terrible, and the food was ok, but it was just not very memorable. Don't personally see the hype, but maybe it's just not my thing.", "pics": null}}, {"review": {"des": "Really loved this place. I came here with the ladies, then again with the 'rents. It's fancy Asian food, presented from a different perspective, with a bit of fusion flare. I thought it was delicious and would recommend it to people looking to try Macanese food, especially since the options for that in the area is limited. I think this is the only one, but if there are others, please let me know!<br><br>The restaurant is loud, and depending on where you sit, dark. If you're in the bakery, it's dark. If you're in the main room, it's not bad, and if you come early enough, the sunlight outside shines through the tall window walls. I prefer the main room to the bakery, because it was a hair too dark for me in there. Also, we came during the summer, and it didn't seem like there was AC in the bakery - only ceiling fans - which is tough with Chicago summers. I wasn't thrilled about it but considering I was dying to try this place, I did not complain. <br><br>The plates are meant to be shared. You should order a few different dishes - don't be shy. You'll walk away satisfied, comfortably full, and probably with some teeny bit leftover. It can be pricey for the portions, but it's worth it. This place does every dish well. <br><br>Dishes I've tried:<br><br>sardinhas furosos <br>pork + ginger dumplings<br>chilli prawns <br>kari kapitan<br>raba raba<br>cavala salgada<br>arroz gordo \"THE FAT RICE\"<br><br>EVERYTHING WAS DELICIOUS!<br><br>You should make reservations. There's usually a pretty long wait. There's a tiny bar, seating area outside if you need to wait. To get to the bakery, you have to walk around outside of the restaurant to get into a side door. Small bathrooms. Cute spot. Street parking is easy and also a short walk to the train. Enjoy!", "pics": null}}, {"review": {"des": "Made reservations for a Friday around 1pm with a large group of people. We ordered one of every large dish on their daytime menu and split them family-style. <br><br>The Sinagpore-style \"omelette\" was my favorite dish. The mushrooms and shiitake in it were very flavorful. The chicken in the piri piri chicken was incredibly tender--be careful to not get distracted by that and then swallow the pits in the olives that are also in the dish. The croutons in the minchi hash were very crunchy, but the dish was otherwise unremarkable. The arroz gordo \"fat rice\" was $48 and came in a dish slightly larger than a typical clay pot (enough to feed 2.5 people). Overall, while the dishes were decent and filled all 6 people who split them, they weren't exceptional and weren't worth the price, in my opinion.", "pics": null}}, {"review": {"des": "This was amazing. We went with a group of four (and incredibly were able to walk right in, despite being quoted an hour-and-a-half wait a few minutes earlier on the phone) and ordered a lot of food. We got olives + garlic almonds, the Chicago-style hot dog bun, curry vegetable samosas, chili prawns, pork + ginger dumplings, coconut rice, kari kapitan (ie spicy chili chicken), dry fried green beans, flat rice noodles, and finished with chocolate mousse and two pasteis de nata. <br><br>Everything was fantastic, but our consensus favorites were the chicken and rice noodles, both of which really blew us away. My wife and I also really loved the chili prawns, although, as is always the case with peel-and-eat shrimp, it always feels like so much work. (It does keep them super fresh, I just wish I was quicker at it.)<br><br>If there was any source of disagreement, it was the desserts. The mousse had some kind of tang to it, which the group wasn't crazy about, but I still love chocolate mousse almost no matter what. Our friends also really loved the pasteis, while my wife (who's been to Lisbon a bunch of times) said they weren't as good as the ones in Portugal. (For what it's worth, I thought these were outstanding -- how could they not be? -- although I do agree that I like the ones in Lisbon better, as they're a little crispier and you get some cinnamon powder on them.)<br><br>At some point, I'd love to come back and get the Fat Rice, but it's just so much food and I wouldn't want it to take away from all the other amazing dishes you can get here. Maybe someday...<br><br>Overall, an absolutely outstanding dinner. Can't recommend this place enough.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WV4NAqUy5hgMl-qB9wvKGQ/348s.jpg", "caption": "Kari kapitan"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qFGUOpc8PMVbu2F31v-vIA/168s.jpg", "caption": "Curry vegetable samosas"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IlDgptUGjYdBbVGYMAgCew/168s.jpg", "caption": "Chili prawns"}]}}, {"review": {"des": "I've been wanting to try this place for a while, and my boyfriend loves Chinese cuisine so it was fitting to try this spot with him. I learned Fat Rice is a fusion of Portugese and Macanese dishes though, and the flavors from the main Fat Rice dish was more spanish-like. The only table available on this Saturday night was in the Ladies Room- which I honestly enjoyed more because of the speakeasy ambiance. The decor was amazing with Chinese influence, and the lighting was pretty intimate. This is in contrast with the main dining room, which was louder and more casual. <br><br>We ordered the Fat Rice dish and were afraid it wouldn't be enough food, so we also ordered the sweet and sour tamarind tofu. However, for two people the Fat Rice dish is more than enough- we had leftovers that we gorged in hours later. Our seating situation was pretty complicated and not preferable, so the wait staff compensated us with a glass of champagne, the fava escabeche bites dish, and an interesting seaweed rice krisp dessert to go. We would've liked to just get a cocktail on the house or a better seat (our seat had half a table and half a booth...), but this was still a nice gesture by the restaurant. The service was also pretty good and quick regardless.<br><br>The Fat Rice dish was delicious and the best part- there were so many different meats and seafood to try, and all were tasty and interesting. The rice however was slightly flavorless, so the ghost pepper sauce and sauce from the tofu dish were a nice addition. The tofu dish was delicious and more Chinese-like in flavor, and we also ordered a side of the coconut rice to go with it. My cocktail from the Ladies Room was also a fruity but smoky mezcal that went along nicely with the food. <br><br>Overall, we spent a lot more than anticipated but were glad we tried this unique place. I loved it and would recommend to all my friends for a different dining experience.", "pics": null}}, {"review": {"des": "Way over priced and does not worth it. The dish was very small. The Octopus salad was in a tiny plate and probably should be $10 appetizer even in an upscale restaurant. A $20 main dish is sized like $10 small meal. The main dish fat rice cost $50, same price as a piece of top ribeye steak, what is there? A lot of sausage, chicken and rice and two prawn. I think should be $30 at most. <br>I do not understand why it got $$ sign at Yelp. Should be $$$$.  Food is OK but I think it is way over priced. The environment is old and dated also.", "pics": null}}, {"review": {"des": "We came here and sat outside in the back patio seating on a saturday night. This place has the unfortunate problem of having a menu that has too many interesting things on it. It made decisions very hard.<br><br>First off, don't sleep on the chili roasted peanuts. We kinda threw them onto our order last minute pretty randomly since it was 3 bucks. Super tasty mix of peanuts, cornuts, chili spice, and little anchovies. When you ate a mouth full you would actually get two different types of crunch between the peanuts and corn nuts. The anchovies added a nice seafood/umami type flavor, and the spice added a well....spice flavor. It all  melded together super well and was such an interesting blend of flavors and textures.<br><br>We had been told this place was pretty good at baked goods. What they had left was a Chicago-style dog bun and an everything knot. The Chicago-style bun was a very unique looking pastry. It was fine. The everything knot was a little less pretty, but it was easily better. All the seeds and spices combined with the filling made this the best everything bagel that wasn't a bagel I've ever had. <br><br>Pork and Ginger dumplings were very good. Get them.<br><br>Easily one of the best things was the dry fried green beans. I know what you're thinking. Green beans are bland, rubbery, and not even a meat! Somehow though, these were the best textured green beans I've ever eaten. Each one was succulent and juicy, no rubberyness or resistance. I challenge you to find a better green bean texture. If you do, then I'm glad my review has bettered your life considerably. <br><br>We also had the pork and peaches curry, seared duck, and obviously fat rice (with extra chili prawns). They were all delicious dishes. I won't go into detail here on them though because then this review would get too fat. <br><br>I have a tremendous sweet tooth. Surprised I still haven't lost my teeth to cavities or gotten type II diabetes yet. <br><br>So the only dessert we didn't order was the chocolate mousse since we have some self-control. All the desserts were pretty bomb. The rice crisp though, was like a nuke.<br><br>My tastebuds didn't really understand what was happening when I took the first bite. It was so pleasantly confusing. When they figured it out that this stuff was stupid delicious I was already on the second one. It is VERY savory, especially for a dessert. It works together so well. Pork, seaweed, and fish sauce aren't normal dessert ingredients but they seemed to belong on this rice krispie just as much as marshmallow.", "pics": null}}, {"review": {"des": "I'm willing to concede: maybe it's me.  I just can't understand why I don't like this place.  It's beloved by all, and I have the great luck of living 3 blocks away.  I want so badly, in my heart of hearts, to love this place.  But I've been THREE times now, and all three have been thoroughly disappointing.  I think I skipped Yelping the first two times because I wanted to believe that it was just an off night, and I'd go again and love it and Yelp about then.  But you guys, three strikes, you're out.  I can't remember what exactly we had the first two times, though I'm pretty sure we've had the two main entrees - the piri piri chicken and the Fat Rice.  Today we had the peanuts, the dumplings, and the special which was a noodle, char siu, shrimp and tofu dish.  The peanuts were almost inedible.  You could have a few, but they left such a bad taste in your mouth we eventually just gave up on them.  The dumplings are good, but only if you pay the $3 for the XO sauce, and even then they are super oily.  The noodle dish was just plain bland - I could have spent half as much at any local Thai joint and been much happier.  Seriously, I wish I liked this place.  Luckily the Bakery at Fat Rice is awesome, as is the Ladies Room so I can still take advantage of the establishment in general.", "pics": null}}, {"review": {"des": "Fat Rice must be quite the hot ticket after Abe Conlon took home a James Beard, but lucky for me my friend had booked a table pre-award for my visit since she wanted to try the menu beyond the signature paella-like dish from her last visit.<br><br>Fat Rice puts a lot on the plate flavor-wise, with everything from chive pancakes to linguica to samosas on the menu. These disparate dishes come together when viewed through the lens of Portuguese influence, with a particular focus on Macau, China. For an oversimplification of Macanese cuisine, think Cantonese crossed with Portuguese, with some tropical flair for good measure. In practice, Fat Rice takes broadly from the Lusosphere, with all kinds of Iberian Southeast Asian elements making appearances.<br><br>Though the ingredients list may be overwhelming, seafood, pork products, and spice are uniting forces. The smaller plates, with fishy dishes like salt cod spread or sardines, are more adventurous, while mains tend to be exotic spins on more familiar take out or fine dining fare (sweet and sour tofu, seared duck). Dishes have both allergens and country of origin listed, with a few designated as Fat Rice originals. Do note the menu is different than posted online (thanks Michelangelo V. for your pictures!).<br><br>The beverage list hews closer to the Old World, with solely French, Spanish, and of course Portuguese wines as well as an exciting fortified wine program. Cocktails are clever and to theme, ranging from port-spiked drinks to a highbrow red-wine-and-coke to a straightforward caipirinha. There's also craft beer, an obligatory Asian lager, and dry cider.<br><br>To kick off the meal, I had the O'Porto ($10), a cocktail with a tawny port and homemade ginjinha base topped with tonic and bitters. I have fond memories of bringing back a bottle of ginjinha, a sour cherry liqueur, from a trip to Lisbon and having trouble getting friends to finish the bottle with me despite my enthusiasm; I've also become a big port fan. Unfortunately, the drink just tasted muddled, like too many elements fighting for dominance, which ended up foreshadowing the meal.<br><br>The hot dates ($8) were a similarly inauspicious start, though they did live up to the \"hot\" part of their name. We were physically sweating from the amount of chili oil in this, and unable to finish it even with the help of the cooling yogurt swirled around the edge of the bowl. Putting aside the spice factor, the elements didn't come together. Sichuan bacon, dates, coconut yogurt (which tasted plain to us), and green onion should be delicious together, but you couldn't make a coherent bite with the way the ingredients were treated both size-wise and texturally.<br><br>Presunto and papaya ($18), though one of the priciest small plates, came together perfectly. It gives the Fat Rice treatment to the classic prosciutto and melon combination of fatty ham and light, refreshing fruit. Drizzled with olive oil and a sherry reduction, these were simple bites that encapsulated what this restaurant is at its best.<br><br>Pork and ginger dumplings ($14) were flavorful, with good textural elements, but not too challenging. A crowd pleaser but not necessary to understand what this place is about.<br><br>Kari kapitan ($30) was our favorite dish after the presunto. Lovely chicken with a bit of kick, solid potato and cashew situation, all perked up by fatty bits of Chinese bacon and exuberant seasoning. A fabulous main course.<br><br>Tchai de bonzo ($22) just didn't work. Though pretty and with appetizing elements like smoked shiitake, the whole thing tasted musty, like an overload of preserved plum. Couldn't finish this, and not only because we were stuffed at this point.<br><br>Overall, I found it to be a moderately successful meal. We overdid it at 5 plates; I would recommend doing 2 per person. With a drink each and after tax and tip, we had a tab of $70 per person; I think you could make slightly better choices and get out of here for $50 per person.<br><br>Service is good, pacing is good, atmosphere is good. It was buzzing without being unbearable, and people were engaged with their meal. It was a fun experience and I learned a lot about a new cuisine. I'm honestly rounding up to 4 from a 3.5 for the feel-good factor. The fact that two of the couple of dishes were blatantly not calibrated, with one flavor that overwhelmed the dish, is disappointing, as a James Beard award suggests to me a kitchen that is tried and true. That said, I very much like the concept here. I think there's no harm in trying it out if in Chicago-- just take the reputation with a grain of salt and be sure to reserve.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pYLBIUG5pWEH4asaBxwtWg/348s.jpg", "caption": "Kari kapitan"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Hl0G2gjnZIyDDmjgAbzbnQ/168s.jpg", "caption": "Tchai de bonzo"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9JCVt_yQm8QjIe4AVt7MMQ/168s.jpg", "caption": "Pork and ginger dumplings"}]}}, {"review": {"des": "The Singapore-style Omelette is AMAZING. If you like rice cakes and if you like eggs, then this dish is for you. If you're familiar with Southeast Asian food, I'd describe this dish as something in between char kway teow and oyster omelette with a slightly smoky sweet soy sauce taste reminiscent of mie goreng. Want to stress that this isn't a soft/limp dish; its slight crispness gives the rice flour/egg mixture some structural integrity. I'm not sure why the description includes sambal though because there wasn't any sambal in it, just a few chili slices.<br><br>Also tried the Curried Singapore Cabbage ('twas ok), Curry Vegetable Samosas ('twas quite good, especially with the ghost pepper sauce they have on the tables), and Sweet and Sour Tamarind Tofu ('twas pretty good - fried tofu had a crispy outer coating but the sauce wasn't anything special imo).<br><br>Besides the food, the decor is wonderful: colorful walls accompanied by Asian porcelain plates and figures. Service was good but could've been a little faster. Also note that this is definitely one of the more expensive casual Asian restaurants you'll go to, which is understandable since it's a pretty trendy restaurant. I went for lunch, where an entree (priced around $15) would be enough if you're only slightly hungry, but you may want to consider getting an app or two if you're really hungry. Sharing dishes is never a bad idea either (they actually suggest doing that).<br><br>Oh also you may want to make a reservation if you go at popular hours. We went at 11ish and they asked if we had a reservation. We were seated immediately under the condition that we finish within 1.5 hours.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/04hUokWRrCMj6_VDWBy0Rg/168s.jpg", "caption": "Sweet and Sour Tamarind Tofu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-rcReonWTDp-pgMXre_RSQ/168s.jpg", "caption": "Singapore-style Omelette"}]}}, {"review": {"des": "This place has a Michelin Bib award, rave yelp reviews and I had to book a month in advance to get seats just for 2!  So we had high expectations to say the least!!!<br><br>Unfortunately this one did not live up to the hype. We ordered 3 apps and 2 main dishes.  1 app (presunto + peaches) we just hated...didn't disliked...hated (at least they took it off our bill).  The other 4 dishes were good, a few unique and interesting twists but nothing that wowed us.<br><br>The service was good, and loved the ambiance. This meal was still very enjoyable overall, but not compared to expectations and especially the PRICE! Unfortunately, mark this one as over-hyped and overpriced.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VcOpQ5gRQhtBq1yMbE9E9A/168s.jpg", "caption": "kari kapitan"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lKaeAdglnolhabqY5exxzQ/168s.jpg", "caption": "pork + ginger dumplings"}]}}, {"review": {"des": "My friends did a dinner here for her husband birthday. Because there were a lot of us she did the prefixed menu for about $44 a person. The food was very unique. A lot of it was thinsg I've never heard of before or things I otherwise would never order. The amout of food was more than enough and they did a good job of bringing it out at a steady pace.<br><br>They really deserved the 5 stars because of the extra step they went to accommodate me. They made me special dishes because I don't eat pork and many of the item they have including the famous fat rice is made of pork. They went above and beyond to make sure I had just as many options as everyone else. Great service!", "pics": null}}, {"review": {"des": "Really loved this place! We made a late night reservation after my bf read great reviews. The environment is a very soho, hipster vibe. Great music and artwork!  We tried a salad with octopus but there wasn't much octopus in it. Interesting flavors but not the biggest fan. Must say the fat rice was the best. Every meat was tender and so flavorful. We had more than enough for just the two of us and took some leftovers home! Was recommended to put it in the oven. Overall very happy we tried this joint!", "pics": null}}, {"review": {"des": "Absolutely love this place! This place is known for its \"Fat Rice\" hence the name! The fat rice is $48 bucks but it is a large enough dish for about 2-3 people. The fat rice has chicken (amazing!), pork, sausage, beef, prawns (It comes with 2 prawns, so if you are sharing with 3 people you should order an additional prawn) and chorizo. The fat rice is delicious! It is definitely a must try at this restaurant.<br><br>They also have a ghost pepper sauce that is to die for! I couldn't leave this place without buying a sauce to take home. The sauce costs $10 bucks. The sauce is very spicy, so great for all the spicy lovers out there. <br><br>Also, each time we go to Fat Rice we have to order from the bakery they have. The egg tarts are very good! We also order the Mai Tai cocktail buns. The cocktail buns are okay. <br><br>The service is great! Also, make sure to have a reservation. If not, it would be best to show up after 2:30. We had a reservation at 2:30 and a lot of the tables were empty!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LqFqEAyv6jb99DWJhNkB1w/348s.jpg", "caption": "Ghost Pepper Sauce! Amazing and very spicy!"}]}}, {"review": {"des": "This a trendy and good spot. My boyfriend and I really enjoyed our visit. We ordered the following items, in order of what we liked best (note - the menu on their website is different than the menu we had in person. Some items below are are not on the online menu. <br><br>- Curry chicken (name started with a K). This is like a fusion of Indian and Thai favors. It has Indian spices but also has lemon grass which gives is a distinct Thai flavor. We loved this dish<br>- Pork + ginger dumplings: Loved these. They have a stronger ginger flavor, which was delicious <br>- Octopus with a green paste and nuts. This was good but not amazing. I enjoyed the crunch from the nuts and I am an octopus fan in general, so it was good but nothing unique.<br>- Curry samosas: these were just ok <br><br>One other note - all the items are pretty expensive, including the drinks. My boyfriend got a 12 year scotch for $21 and the waiter asked if he wanted a large ice cube. When he said yes, he was charged an additional 50 cents for the ice. I mean 50 cents is nothing, but charging for an ice cube seems absolutely ridiculous. Aside from this, the service was good and quick and we enjoyed sitting at the bar and watching the kitchen.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZiG8G_L5LBQ_Xy7XUXZz-Q/348s.jpg", "caption": "Chefs table"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/X2L2WHPr0L2XIcMNZQVaAg/168s.jpg", "caption": "Inside"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HUbxThQRx6T37-tymyyDqA/168s.jpg", "caption": "Chicken curry - really good"}]}}, {"review": {"des": "Had been meaning to hit up Fat Rice for a long time and it certainly lived up to the hype. The waitress was informative and helped guide us through our culinary journey. We started with the sardines and peanuts which was a good start, the sardines were served in an incredibly unique way and was tasty for what it was. We moved onto the dumplings and the Lacassa both of which were delicious and filled with flavor. The Fat Rice and Kari Chicken we're both superb entrees that was more than enough food for 3 of us in our group. I highly recommend and recommend to anyone who wants to go outside the box for a truly memorable food experience.", "pics": null}}, {"review": {"des": "I really enjoyed the vibe here. Good music. It was mostly hip hop. There were well known chefs eating there so u know it's gotta be good. I enjoyed every dish we had and we ordered a lot. I really like the wide variety they have. The menu is extensive but they don't over do it. I have no complaints at all. I found all of the food really good, but I couldn't say one dish jumped out at me. I was in Portugal and The Azores recently so it was refreshing to see some dishes on the menu. They even have Sao Jorge cheese from The Azores. The cocktails were solid as well.", "pics": null}}, {"review": {"des": "Before review, I would share that my wife and I had VERY HIGH expectations of Fat Rice. Therefore, please take this review with a grain of salt.  My wife and I had a friend in town and we had zero intention to go to Fat Rice, assuming that there was no chance we would get a table for 3, the night of at the restaurant.  In the past,  we had tried before and the only options were 5pm or 1030. We figured what the hell and tried. Luckily, we got a table for 730. Awesome.  Yes. I was stoked. <br><br>We got to Fat Rice and was greeted and the server was very friendly and knowledgeable about the menu.  One of our friends asked about specifics of a drink and she nailed it with a great description.  Overall the flavor was ok; way less than what we had expected for a restaurant with such hype. The menu was small plates with other \"large meals\" that would serve multiple people.  We ordered a bunch of food and detailed below.<br><br>Octopus-I don't care for octopus as it is usually gummy. This was different bc it was not.<br>Spaghetti squash-fine, like a rich pasta sauce but with spaghetti squash.  <br>Dumplings-May have been the best, good overall flavor profile. <br>Peanuts-overrated and not worth the expense. <br>Samosas-better then most, bit still just fried dough.<br>Beef Ambilla-pretty tasty<br>Fat Rice-good but needed more rice with all the proteins that were included. <br><br>Fat rice was good but was very very expensive. The meal was $100 per person (2 drinks per person) and I was fine spending that. But if I do, I want the experience to be awesome and leave me wanting more. Unfortunately that was not the case with Fat Rice.", "pics": null}}, {"review": {"des": "Breakdown<br>-----------------------------<br>Star #1 - Atmosphere/Decor:<br>The atmosphere was typical of just any regular restaurant. Nothing really stood out et nothing was unexpectedly horrible. Star earned.<br><br>Star #2 - Service:<br>Service was normal for any restaurant, however, I did like that they kept refilling our waters without us having to ask. Star earned.<br><br>Star #3/4 - Food:<br>This place is an overpriced and overhyped restaurant. We first saw this restaurant on various must-try websites and even on YouTube. Apparently, the chef won a very prestigious cooking award which made the restaurant famous. The food wasn't even good. We ordered the famous Fat Rice bowl and the salted fish rice. The fat rice bowl was underwhelming and for a hefty $48 it was waaayyy overpriced. The salted fish rice was a little better. But even though it is SALTED fish the rice was too salty. Like overly salty. Overall just okay, and it wasn't worth traveling 45 mins to come try this place from downtown Chicago. Just one star earned.<br><br>Star #5 - Cost/Value:<br>The price is not fair at all. Way to expensive for the fat rice and it isn't worth it at all. If you want to come here and try it out don't order the fat rice cause the portions are tiny and the price is large.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/McCEc05q6D78F7cplnYvhQ/348s.jpg", "caption": "Fat rice"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9Vf5Svn2CcieUhSB8pGFBw/168s.jpg", "caption": "Salted fish rice"}]}}, {"review": {"des": "I came here for brunch on a Sunday, and I was able to make a reservation the morning of. <br><br>I tried the dumplings, the minchi hash and the omelette (more than enough for two people). The dumplings were surprisingly really good! The sauce that came with it was very flavorful and had a little kick to it. We didn't try the \"xo\" sauce which was an extra $3, it wasn't needed. The minchi hash was good, but very oily. The omelette didn't have much flavor and the texture was like pad see yew noodles. Different, but it was still good. I guess their menu changes a lot, because I was looking forward to trying their French toast but they no longer were serving it. <br><br>Overall I'd come back to try their dinner options and I'd like to come back to try their bakery. By time we finished brunch, they ran out of most of their bakery items :(", "pics": null}}, {"review": {"des": "Fat Rice got my 5 star review even though in one of my visits, the duck was way overcooked and its flavor was really off. However, the Fat Rice (Arroz Gordo) alone makes me go back to Fat rice again and again. Yes, it's pricey. And yes, it's somewhat greasy and it would elevate my blood cholesterol to hell but whatever. One weird thing is I actually prefer bringing the leftover home and microwave it. I think the fat secreted from the proteins after microwave makes the rice tastier.<br><br>Most of other dishes I've tried were good, drinks were good but somewhat pricey for the amount, and service are very good.", "pics": null}}, {"review": {"des": "I upended whatever straight laced workout I had planned out for the week and chucked it out the window when I came here, because let's be honest, you aren't living life until you eat like a fat POS -- hence the name. <br><br>I've never tried Macanese (I guess this was fusion) cuisine before; this is nothing like the cross-river Dim Sum repertoire I've experienced. And boy, was it a hell of a symphony. Do Macanese casino overlords munch on Fat Rice's pork and ginger dumplings while playing craps? <br><br>The duck was probably my favorite part of the meal. Immersed in juice, the duck was swimming in a fine pond of savory and meaty but assari flavors. <br><br>So while you probably could have guessed that I thought the duck was the topping to this unique, epicurious adventure -- NO, it was the fat rice dish. Although fit for a kings' price point (let's be honest, I can't afford anything that I eat), I felt homey vibes coming from the shrimps, tangy rice, chicken, egg, mussels and so much more. Don't be afraid to utilize the ghost pepper sauce, although if you do use it too liberally, maybe you will die and become an actual ghost.", "pics": null}}, {"review": {"des": "My husband surprised me with a date night here! <br><br>We were greeted immediately and asked if they could take our coats! That was a really nice touch! <br><br>The place was a little loud with a large party celebrating a birthday. They were so loud that it disrupted our dinner, but that's no fault of Fat Rice, and I'm just old and grumpy. <br><br>We started off with the butternut squash! I absolutely loved this. It was spicy, but manageable. It was topped off with dried anchovies, chili peanuts, mint, and corn nuts. Every single bite was different based on what you grabbed! <br><br>Next up was the pork and ginger dumplings. My eyes rolled back so hard with my first bite! So flavorful and tender. Definitely the best dumplings I've ever had. <br><br>We of course ordered the arroz gordo! It's overwhelming with all of the toppings! Absolutely loved the sausage and pork. Never had anything like the sausage before, and I can't stop thinking about it! Definitely enough for 2 full portions or even 3! <br><br>Finished the night off with the coconut pudding. FRICK OFF FAT RICE!! It was so so so good! Highly recommended!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/leQ79RCbPWwMrET2axmCXw/348s.jpg", "caption": "Arroz Gordo"}]}}, {"review": {"des": "Fat Rice might be the best restaurant I've been to (trust me that's saying a lot).  The execution is perfect every time and the food is nothing short of phenomenal.  I've actually been on 2 vacations( Denver and LA) where I met strangers who have been to Fat Rice and we discussed how this is an essential Chicago spot.  <br><br>On a side note you can't go wrong with what you order.  Obviously the Fat Rice dish is perfect but everything on the menu is a game changer.", "pics": null}}, {"review": {"des": "Great meal! Fun atmosphere! Were quoted about a 45-minute wait for 2 seats at the counter, and wish we had known about Ladies Room- as we went to another nearby bar for a drink. Our wait did take 45-minutes, wish the counter wasn't part of their reservations \"program\"!<br><br>Enjoyed the Samosas immensely. The pub cheese appetizer was just okay. The duck breast entree was out of this world! Best thing we had all night. <br><br>I'm a craft beer lover, so enjoyed washing it all down with their Ill Peripheral (American Pilsner) collab with Marz Brewing. <br><br>This place is hip!", "pics": null}}, {"review": {"des": "DEFINITELY coming back! First off, amazing food at this little Logan Square spot. The flavors are bright, the ingredients are fresh, and the service is spot on. Secondly, I make it a point to post this in all of my reviews, but having a lot of food allergies (wheat, shellfish, seafood, and a few other things), I feel a bit limited when dining out at times. And eating at Asian restaurants is at times near impossible. At Fat Rice, the kitchen cares tremendously about the health and well-being of their patrons, and can make allergy accommodations with most of their dishes. Their soy sauce is House-made and gluten free, and they will eliminate fish sauce or seafood/shellfish (like oyster sauce) ingredients whenever possible so you can have a fantastic meal! <br><br>We tried several items during our dinner, and enjoyed the different flavors presented in each dish. Book your table well in advance, as this spot books up fast. Also be aware that they will only hold a reservation for up to 15 minutes, so prepare to arrive early or right on time to enjoy your meal. Parking can be an issue if you are driving in, but there are spots available a few blocks from the restaurant.", "pics": null}}, {"review": {"des": "Wow, this place was quick in getting my food out and the food was ...<br>esplêndido! The taste ... amazing, from the bites to the appetizers! Even the vegetables+fish section. To say the least I had a religious experience eating at Fat Rice...that is until I had something from the meat + poultry section. Maybe it was my food choice or maybe you reach your peak  once you reach meat+poultry. You're so content and don't think much of anything else and maybe they know that. I ordered beef ambilla and when it arrived it taste good. But it my opinion it was nothing worth raving about. I would've been just as content heading to my local Indian spot and ordering curry from their menu.", "pics": null}}, {"review": {"des": "Fat Rice serves amazing food with big bold flavors.  My suggestion is to bring a large group and share a variety of dishes.  I unfortunately was alone and the dumplings and prawns (4) would have been plenty of food.  (I however am from out of town so I ordered the sweet and sour tofu to try a third dish.)  Be sure to add the XO sauce to your dumplings.  While I was surprised that my tea was bagged instead of loose leaf, it was wonderful.  <br><br>My only criticism is that there were long pauses between dishes.", "pics": null}}, {"review": {"des": "I am so glad I went to Fat Rice and ate the, well, \"Fat Rice\"! <br><br>\"Fat Rice is a celebration of the unique cuisines of Portuguese speaking Luso-Asian provinces\" - these people know how to party! The menu was so intriguing and colorful. The staff was very accommodating, and since i have a (mild) peanut allergy, they marked up a special menu for me. We ordered a couple of fun and refreshing cocktails and started with the bacalhau da vovó - house cured salt cod spread with olive, chilli and mint. The dip was a lot more bright and clean than I expected, and not very fishy; we loved it!<br><br>And yup, we ordered the Fat Rice aka Arroz Gordo. The hot clay bowl contained jasmine rice laced with sofrito, chorizo & salted duck, topped with curried thighs, char siu pork, linguiça sausage, prawns, steamed clams, tea eggs, chicken-fat-fried croutons, olives & pickled chillies. Seriously, what else could you want? We just ate 7 different proteins and they were all in one bowl and it was carnivorous heaven. Every element was prepared expertly, from the flavorful prawns to the juicy chicken, to the crispy rice at the bottom. And their housemade mushroom sauce was an excellent addition too! We continued the top-notch night by grabbing drinks in their hidden Ladies Room bar, at the back of their bakery...", "pics": null}}, {"review": {"des": "Can't believe I waited this long. I've had this on my list since opening and sadly I just tried it. Anyway, the wait was still worth it after all these years. I went for the daytime menu. Got the piri piri chicken, a fried rice on their special, and samosas. Finished it off with one of their famous egg tarts.<br><br>The heat on the chicken was no joke but I love that - this ain't that fake hot. It's seriously spicy for my domesticated American folk. Flavor on it was dope and the potatoes were nice and crisp. The fried rice brought a great balance to the heat of that chicken as it had a little of sweetness to pair nicely with the chicken. The samosas were good too.<br><br>But that egg tart doe... I see why they have a stand alone bakery. I'm a sucker for pastries and you bet Imma try to hit up that bakery more often.<br><br>Definitely gotta come back here for dinner service. What a gem of a spot and staying power is still here 6 years after opening.", "pics": null}}, {"review": {"des": "Met up with some friends for a birthday brunch for my hubby this weekend. The staff were super friendly and the the place had a very laid back and open atmosphere. Our party ordered pretty much one of everything on the brunch menu except for the Fat Rice. The dishes were simple yet extremely flavorful. I was eyeing the Fat Rice that the next table was having which we definitely will be back to try. My favorite dishes by far were Peri Peri chicken and Singapore omelette.<br><br>We stopped by the bakery to score some Portuguese egg  tarts and assortments of sweet buns to take home and devour. This is my new favorite brunch place in the city and definitely see myself frequenting here with friends.", "pics": null}}, {"review": {"des": "Honest review:{like aucheval one of the most overrated places in chicago} (be warned the dishes are small and pricy) didnt like the food should have listened to all the other bad reviews food was bland more of a hangout then a food destination. Be warned they will not let u in till 5:20-5:30ish. It is very small so i would recommend to come as soon as they open cause after a few minutes it gets extremely crowded or make reservations ambiance: i actually love all the random cool pieces of art it is very hipsterish like it was popping good music cool vibe. Service: it was good just wish they would change plates and describe dishes. Food: honestly wasn't flavorful felt everything was bland and had one flavor that completely overwhelmed the entire dish feel like the menu is so big that they cant make everything taste good like I was so disappointed wanted to come here for years and update desserts their basic best thing: samosa <br><br>curry vegetables samosas $8: its not really a traditional samosa more like an eggroll. The filling was really good, and loved the curry sauce it was complex only issue it was on the acidic side and wish it had the traditional chutneys to give it more complexity cause its just a somosa and curry sauce like u can get a better somosa at the cheapest indian place was expecting depth of flavor <br><br>Curry squid stir fry $18: this was good not great. The squid could have been more tender the issue is the fresh element i love fresh flavors but the dish had to be supper flavorful or decadent or else it doesnt pair well because the fresh flavors are supposed to cut through the richness and the curry was really bland and soupy it should have been thick and complex <br><br>Grilled octopus $22: the octopus was so tender like melted in ur mouth. The sauces werent that flavorful. Dish needs texture<br><br>Duck $31 worst dish of the nite. The duck was overcooked and soggy. That wasnt even the worst part the nori was the worst part duck with a fishy taste was so off putting the nori overwhelmed everything didnt go with the dish at all. The mayo was very bland was expecting decadence. The sauce however was good though. <br><br>bife a portuguesa: took 30 minutes for them to make :/ the steak was tuff so it wasn't rested or wasn't the best cut of meat. There was a lot of fat and Sinu which was disappointing. Jamon was off putting it was so dry and tuff was worse then beef jerky texturely was off putting. The sauce was good but it was the only flavorful thing about this bland dish. The egg yolk was over cooked n the whites were raw this is why u take ur time with an egg", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1hOpchLGU90aJriqzpjpQg/348s.jpg", "caption": "$40 ribeye"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/m32Drq5kvHegGTh3EPFJDA/168s.jpg", "caption": "$40 ribeye"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MzrgncUMTLKhTJsPIXTQIQ/168s.jpg", "caption": "Iced milk tea$3"}]}}, {"review": {"des": "Hooooly smokes! We got to sit in the \"Lady's Room\" and let me tell ya.. I wish I had more restaurants like this back home!! I know this particular room had a different ambiance than the rest of the restaurant so I'm eager to come back to Chicago to see the main restaurant. <br><br>The cocktails are fantastic!! Definitely has some unique flavors, as well as the food. I got the \"one way ticket to Bangkok\" and it was sooo good. Some of the seasonings were a bit spicy for me for the food, but overall the food is fantastic!! One favorite of mine was the sardinhas furosos. We also got the lacassa and also got a sausage dish that I can't recall. <br><br>Definitely worth the wait!", "pics": null}}, {"review": {"des": "Wow, wow, wow! I was impressed with this Logan Square dining establishment. I have never dined in this part of town before so I thought I'd explore in this last visit to the Windy City. Fat Rice is tiny, and I would recommend getting a reservation (even for one person). For this visit, I sat at the bar.<br><br>Everything looked good on the menu. Since it was a cold winter's evening, I was in the mood for something a little on the heartier side. Similar to many other restaurant trends, the dishes here are sharing sized. I needed to make sure I did not over order as everything Iooked reall started off with a cocktail and a side of roasted peanuts. Next up were dumplings and then the main dish--a hot pot! (As I am a month late in writing the review, I forget the actual name of the dish). The taste was amazing, and there was a lot of food (definitely get a side of rice or two to sop up the sauce).<br><br>I definitely want to come back but with friends so as to try the famous fat rice!", "pics": null}}, {"review": {"des": "Tried the piri piri chicken (4.5/5) , Portuguese sausage (4/5), Singaporean omelette (2/5) and egg tart (4/5). <br><br>The piri piri chicken was very zesty, which was a pleasant surprise. This dish and the Portuguese sausage were kind of spicy. Egg tart: custard was creamy, crust was buttery and layered. Singaporean omelette was too oily for my taste. And there was a lot of rice flour in it, more than I expected. I think that made the dish kind of boring. <br><br>The decor of the place was really cute! The plates in the picture look just like the actual plates and bowls my grandma used in China until the early 2000s. An interesting touch!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lf_sQtg_OpNzSufw9WtlYw/168s.jpg", "caption": "Piri piri chicken"}]}}, {"review": {"des": "Honestly, I was here over the summer with my parents. It's been a while. <br><br>I forgot what appetizer we ordered, but we ordered the Arroz Gordo, \"fat rice,\" and it was LIFE-CHANGING. <br>-- You might see it in the small-ish bowl and think it's a small portion, but it really can fill up 2 or 3 people. And that's coming from a family who eats a lot! It was so flavorful and different than anything I've ever tried at other restaurants. It's their specialty for a reason. MUST TRY! <br><br>Also I love the comfortable kitchsy vibe of the place. The decoration is unique and the place is pretty intimate. It's a great neighborhood gem. <br><br>Knocked a star off though because the hostess was trying to have us sit in the other location (have to go through a different door but still in the same building?) while there was clearly open seats in a community table right in front of us. <br><br>I must come back and have friends try the Fat Rice!", "pics": null}}, {"review": {"des": "Is there anything I can say about Fat Rice that hasn't already been said? The praise exists for a reason. They are serving food that is both familiar and also so unlike anything you've ever had in the US. The space is effortlessly cool without having any airs of douchiness. Despite huge accolades, the owners remain down-to-earth and they aren't resting on their laurels. <br><br>So if I'm not clear enough, Fat Rice is my favorite casual restaurant in Chicago. The flavors here are so amped up and surprising. <br><br>I'll end my review with the most important thing you need to know about Fat Rice -- if the baked pork chop rice comes back, do anything in your power to get it.  Your mom's birthday brunch? Ditch it. Kid's soccer game? That's what therapy is for when they are adults. Having a heart attack? Tell the ambulance to swing by Fat Rice on the way to the hospital. Everyone will understand completely when you tell them there is a fuckin cookie-coated, deep-fried pork chop covered in curry and cheese with your name on it", "pics": null}}, {"review": {"des": "Very small place in Logan Square. Luckily they take reservations - do make one cuz they get busy, fast! Came here for brunch; we had a reservation at right when they open and there was already a line out the door.<br><br>I don't quite remember the small dishes we got, but the FAT RICE is one of a kind. It's like paella, but more aggressive. A heaping pot of curried chicken thigh + char siu pork + linguiça sausage + chilli prawns + clam. It's recommended to share between 3-4 people, but the two of us finished it... cuz it was that good!<br><br>Definitely not your regular waffle & benedict brunch spot; but so satisfying in Chicago winter. And will leave you full for the entire day ;)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zrAjnhXg9_Nk4EzwU6tW4g/168s.jpg", "caption": "Very accurate display"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/76Hv9Vz-4p8OgH1xDHig4w/168s.jpg", "caption": "Fat Rice at Fat Rice"}]}}, {"review": {"des": "Wow this is awesome fusion spot. The influences from Portugal and southeast Asia who would've thought the food was so phenomenal.  Reservations are highly recommended", "pics": null}}, {"review": {"des": "THIS IS SOME GOOD STUFF. Aside from obsessing over pictures of cute mixed Asian babies, I am never this excited about Asian Fusion. Fat Rice manages to elevate, instead of cover up, the nuanced and intricate flavors of various Asian cuisines. <br><br>:: chinese chive pancake :: the mushroom and dried shrimp made this dish so flavorful while the sambal sauce took it to the finish line.<br>:: chilled watermelon & king crab soup :: this was so incredibly light and refreshing. <br>:: chilli prawns :: simple but amazing. I don't know how they got the flavors through the shells but they did and it was beautiful. Great dish to test if a date is not afraid to get dirty.<br>:: nasi goreng :: beef fried rice with anchovy, peanut, and sambal. I would have loved the peanuts to be chopped up but delicious nonetheless.<br>:: chettinad curry :: eggplant, potato, cauliflower, okra, and other goodies, served with papadum, the Indian flatbread. Flavors were complex. So comforting.<br><br>It's a pretty small restaurant with an intimate and trendy atmosphere. My friend and I loved sitting at the bar and watching the chefs and bartenders work their magic. I will definitely be back, and so should you.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/i9JZ82UGNV9H9oVXjPMpBQ/348s.jpg", "caption": "watermelon and king crab"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rFDIiO0Qe5eOH94ROc-yUg/168s.jpg", "caption": "chinese chive pancakes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zoEM6VHcErg6VB5LQf9rtQ/168s.jpg", "caption": "chilli prawns"}]}}, {"review": {"des": "Very hip and unique restaurant that combines Portuguese and Macau-Chinese cuisines. Just do yourself a favor and make a reservation, this place is pretty popular and is usually packed. <br><br>The service was phenomenal. The servers were extremely well-versed in the dishes they brought out. <br><br>I started with the fava bean escabeche (not pictured) - it was jam-packed with flavorful and a nice tang. <br><br>The pork and ginger dumplings were next. Great texture, I also really liked the sauce they came in!<br><br>First main dish: tchai de bonzo - I actually didn't like this dish very much. Sometimes you order the wrong dish, but I hear people like it. It just wasn't what I expected it to be, so slightly disappointing. <br><br>However, the seared duck breast was delicious! <br>I'm a big fan of duck and this dish left me wanting more. Wonderful presentation too! <br><br>Toucinho do ceú (or bacon heaven) was unequivocally the best dessert I've had in a really long time. It's really, really good. This Portuguese almond custard pie will really take you to heaven! The winter-melon fig leaf jam is nothing like I've tried before, but I absolutely loved it. 10/10 <br><br>Great location for those with an adventurous palate!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HrO7_uJ6SMf_H7V3CP9MAw/348s.jpg", "caption": "Tchai de bonzo"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wul_ORKb7cH4nwb0G50uQA/168s.jpg", "caption": "Pork + ginger dumplings"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QoGlhDn0ij-Qi794F9uzKA/168s.jpg", "caption": "Toucinho do ceú (bacon from heaven)"}]}}, {"review": {"des": "Everything was delicious. We made a reservation pretty far in advance just in case, it is a small restaurant. They told us that we had to place our whole food order at once, which I thought was a little strange for a small plates restaurant. Everything was very expensive and for not a lot of food. We ordered only vegetarian dishes, which is pretty difficult at Fat Rice, but we made it worked. The curry samosas were very tasty, and there was one for each person in my party. The sao jorge cheese was very tasty, for $12 for a tiny tiny dish didn't seem worth it. <br>The sweet tofu was so delicious and I could have eaten three plates of it for myself. The asparagus was also very delicious and had a ton of flavor. The chickpea stew could be made vegetarian and we did that. Every dish had a lot of flavor. I wish there had been slightly more food for the amount of money we spent, but I would still go back and order everything I ordered this time and more!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xErMNnePKUflCF5CE5zMaQ/348s.jpg", "caption": "sao jorge cheese"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/48o-wxlEtG1yErM6Wh2TyA/168s.jpg", "caption": "curry samosas"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RL__weehEMMpjSq1Cx6VCQ/168s.jpg", "caption": "chickpea stew"}]}}, {"review": {"des": "If you're looking for a full blown culinary experience this is the place. We ordered \"tapas style\" for 3 people and shared 3 entres along with the Fat Rice. Highlights included the Sopa Seca and Ginger dumplings. Of course the Fat Rice was delicious but that was to be expected. <br><br>Not only was the food delicious but the service was wonderful. They take the time to explain every dish they bring out in detail. At the end of our meal they brought out three complimentary shots of their homemade herbal liquor. <br><br>Basically everything you hear is true, this really is one of the best restaurants in Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TjuMWOnSqc2ADGTFS8scJg/168s.jpg", "caption": "Sopa Seca"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_cLS0zPV7YyTSWJD8dNDGA/168s.jpg", "caption": "Fat Rice and Cauliflower Dish"}]}}, {"review": {"des": "I came here for lunch with a group of friends, and I think we were all pretty satisfied with our meal. We decided to share an order of samosas, the piri piri chicken, and of course, the Fat Rice. It doesn't seem like a lot of food, but we were all full before we finished everthing. The Fat Rice was definitely the star of the table, loaded with a variety of well seasoned and delicious meats over flavorful rice. The piri piri chicken was also really tasty and had a solid spice kick to it. We also ordered some desserts from the bakery, which were pretty ok. I definitely recommend the egg tart, though it is a little small and pricey. We let our curiosity get the best of us when we ordered the Macau rice crisp, which turned out to be a strange, somewhat unappetizing combination of sweet and savory.", "pics": null}}, {"review": {"des": "Came here with family to celebrate my birthday. Food was incredible and amazing! It was a perfect birthday dinner. We started off with the pork and ginger dumplings and chilli prawns. The ginger dumplings were so flavorful and the chili prawns were delicious. We also ordered bread and dipped it in the white wine and butter sauce of the prawns- definitely recommend! We also ate the grilled octopus which was really tender and not chewy at all. For our main course, we had the Lacassa and the cavala salgada. There was three of us for dinner and this was definitely enough food. We were so full but we couldn't stop eating! We also got a free dessert for my birthday. I can't recommend this place enough!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sH4lvd3PIa46GoC_Vb8TuA/348s.jpg", "caption": "sāo jorge cheese"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/r0-OA7tqoLYZ9vgYwahZ5A/168s.jpg", "caption": "Lacassa"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ASb5Z3rWrXTsgJU5hsnKDw/168s.jpg", "caption": "Chilli prawns"}]}}, {"review": {"des": "Came here with a friend for brunch - and I was impressed. They had Macau-Portugese-inspired dishes which were very unique for adventurous palates. Everything was well-seasoned, service was good and the bakery items were a huge plus! Piri piri chicken was delicious and the spicy dumplings were delish! Will come back to try other items on the menu.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ts0U99RFMDj0M1GSD9AeLQ/348s.jpg", "caption": "Minchi hash"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dJ8mUsFvNxR9qDAlv-usSQ/168s.jpg", "caption": "Piri Piri chicken"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VNjLqj_OGyQcMa7d28PxRQ/168s.jpg", "caption": "Dumpling"}]}}, {"review": {"des": "All around 5 Star experience!<br><br>We had reservations for two, but it turned out that at noon on a Thursday it wasn't necessary and we had our pick of seating. <br><br>Decor is awesome and entertaining, music was fun, the staff was very helpful, attentive, and cool - I could see myself hanging out with them. When they learned I was vegetarian (and I don't really like egg) they scoped out some extra off menu options for me. I landed on the eggless \"omelette\" - I was like uhhhh how do you make an omelette without eggs and they're just like trust us, it works and it's great and they were right. Omelette is a misleading name, even for the egg version. It's more like a stir fry. But I don't care what they call it cuz it was bomb. The rice noodles (the \"omelette\" part I guess) were more like irregular shaped balls and slightly chewy in the middle (not at all in a weird way) and crispy on the outside. I hadn't had anything like it before and it was my favorite part of the dish. The mushrooms were also awesome with bbq-like marinade. The other veggies and sauce provided lots of flavor and I devoured it all. <br><br>I also tried the garlicky greens - not overwhelmingly garlicky and a hint of lemon for some brightness. <br><br>Note: their hot sauce is HOT (hello ghost peppers) and sneaks up on you. Be warned :)<br><br>They have lots of tea options, some even with vintages which I haven't seen before. I enjoyed my Mallorca Melon, even though it was a deeper almost hibiscus flavor. <br><br>Having stuffed ourselves we took dessert to go. The morning bun was yummy but aside from the light purple color streaked inside not noticeably different from the standard variety. The snickerdoodle cookie had an interesting twist, as it was filled with a savory egg custard.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/j8KrsNs2mPtm-ubPoQ52bA/348s.jpg", "caption": "Eggless \"Omelette\" - Amazing!"}]}}, {"review": {"des": "This restaurant has been on my list for a long time and I was so happy that I finally had a chance to try this place! The food was awesome. My friend and I tried the most famous \"arroz gordo\" - fat rice, which is a dish full of different kind of meat and with rice. Sooooo good! I also had a taro crossiant, which is also tasty. Highly recommend ordering the arroz gordo!!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2GdpcVoGTA0tTUGxPGgTEw/168s.jpg", "caption": "Fat rice!!"}]}}, {"review": {"des": "Quite the popular spot, I had been planning on coming here sometime before I left Chicago and it was after some friends suggested it that I figured I move those plans up. The menu I'm sure has many different delicious options, but of course we came for their namesake dish. The waitress said that it was the size of maybe 2.5 standard entrees but we were already intimidated by the price tag so we ordered it alone and held onto a menu. After being seated(they put us in the Ladies Room since the main indoor dining area was full) it came out in short order. Our first impression was that it was...smaller than we expected it to be. Maybe it's enough to fill 2.5 smaller stomachs, but for 3 hungry guys we all that we could probably finish it on our own. After finishing the food I did give the portion size some credit though, I could probably come here with a date and share the dish with her and have both of us leave full(maybe if I ate 60% of it and she 40%).<br><br>So how'd it taste? Well as far as their flagship dish goes, I think it actually all tasted pretty good. Even down to the crisped rice, each detail was delicious and all the meats were cooked well. A quite liked the housemade sausage and the pork belly on the rice; chicken was decent in it; prawns were probably the most unremarkable thing. The ghost pepper hot sauce on the side was delicious, and helped to bridge any flavor discrepancies between the components of the Fat Rice.<br><br>Overall, I think the tastes were combined successfully, but was at a price point quite a ways higher than you'd expect for a dish which is mainly rice. From what I could see of the other dishes, those plates didn't seem too large either, so getting appetizers and sharing plates like the servers suggested does seem to be the modus operandi. I could see myself coming back in the future when I have a bit more expendable income, and the Ladies room is certainly a nice area to bring a date; Just make sure your date is worth the money you're going to be spending first.", "pics": null}}, {"review": {"des": "Wow!!! What an amazing dinner. <br><br>Third time's the charm, though... The past three times I've visited Chicago, I was SOL to get a reservation here. First time was 4th of July weekend so unfortunately it was closed. Second time, it was going to be a 4.5 hour wait (lol), but it was because we had 6 guests and this place is pretty small. And finally! This last trip in Chicago I was able to snag reservations on a Tuesday evening. Hooray!<br><br>I highly recommend coming with a group so you can order more dishes and try a variety. They are all SO good. I already want to come back and order the other dishes since it was so hard to decide what to get and everything sounded amazing. Do note that the dishes here are so dang spicy. I love spicy food, but some of the food made me teary eyed.<br><br>After long deliberation, we ended up with:<br>- Chili roasted peanuts: hot, hot, HOT! But so darn good. It reminds me of those peanuts you get at dim sum restaurants, but they're way spicier. We had a lot of leftovers of these are they made a nice snack the following day. Now I want to make my own!<br>- Lobster dumplings: nice twist to typically pork dumplings. It tasted and felt lighter, so great appetizer dish.<br>- Papo Seco (portuguese bread): I honestly didn't eat much of this because I wanted to save my appetite for the heartier stuff and knew I had a bunch of rice dishes waiting for me... but my friends thought the bread was amazing.<br>- Linguiça: solid, but not quite as memorable for me... just tasted salty. We probably could've skipped this one since it was in the arroz gordo<br>- nasi goreng: wow, A+. I love how limey-lemongrass-y this tasted. So refreshing.<br>- diabo curry: this was crazy good as well. the meat was soooo tender and flavorful. Drool. <br>- Arroz Gordo (fat rice): Highly recommend ordering this if you're just dining alone with 1 other person... it includes a lot of above items (char siu pork, prawns, linguica, etc.) the chicken in this dish was also super tender!! We had a ton of leftovers and tasted just as good the next day. Lasted me an additional 2 meals..<br><br>I was SO full before we got the fat rice... I was in pain, in a good way.. haha. We were curious what the seasonal fortune cookie dessert was and ordered it for fun. It came with a crude fortune written by cards against humanity. I personally thought the dessert was whatever and didn't eat much of it. My fiance thought it was the best fortune cookie he has ever had, but it tasted like any ol fortune cookie to me. <br><br>One major gripe is their reservation policy... it's so hard to get a larger group together and they charge you $20/person that is missing... i get that's business but I have so many flakey friends...<br><br>I was super bummed I didn't get to try the egg tarts, so I must come back for lunch instead!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZOORgXPbkSUm7RuV5hiM-A/348s.jpg", "caption": "4.5 hour wait haha"}]}}, {"review": {"des": "Hands down favorite meal in Chicago! Started with drinks at the Ladies Room (highly recommend...amazing cocktails), then dinner at Fat Rice. The server suggested 6 plates for three people, but if you go with the Fat Rice bowl (which you should), you can probably get away with 3-4 items. Also loved the octopus and the chicken wings.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zftONNkBX6AYphEMVedpDQ/348s.jpg", "caption": "Fat Rice bowl. Incredible and HUGE. Three of us couldn't finish it."}]}}, {"review": {"des": "Fat Rice is incredibly unique, but I have to admit that \"unique\" is a loaded word. With all the dishes I tried, the well-developed flavors of the Chinese side of Fat Rice's asian fusion equation fondly reminded me of my San Gabriel Valley/626 upbringing. However, it left me feeling like I just wanted good Chinese food. <br><br>Regardless, Fat Rice is worth a try! Fantastic concept & good execution, so it really just comes down to personal preference. It's all the way out in Logan Square so it's a little bit of a trek for out-of-towners but if you want something different, Fat Rice is a good call. <br><br>We had the: <br>*Fat Rice (arroz gordo - 'FAT RICE' our namesake, akin to paella curried chicken - char siu - linguiça - chilli prawns - clam): If you're going to order one thing, order this. It comes with a pretty steep price tag though, but it's a good portion. It actually reminds me of paella meets cantonese clay pot rice. Yum. <br><br>*macau baked pork chop rice (po-bolacho fried pork chop - parrano cheese - garlicky greens - coconut curry): I loved the flavors on this but the soggy fried pork chop was not a pleasant texture<br><br>*stir-fried rice cake (chewy rice noodle - egg - shrimp - spicy sambal) - the flavors on this one were particularly nostalgic/homey, but another texture issue. The rice cakes were overcooked so it was soggy.<br><br>*boiled pork & ginger dumplings (sichuan chili oil) - eh, skip it. It was just ok. I feel like you can make better homemade ones/other places have better dumplings. I was disappointed that the sichuan chili oil was real weak; it lacked the fragrance and heat.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LkCJwdiBw1RJtKjKGe_HOg/168s.jpg", "caption": "Stir fry & pork chop rice"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LvgfQJp8L8_lOWivRhRLuQ/168s.jpg", "caption": "Fat rice"}]}}, {"review": {"des": "I just don't know about this place. I visited a couple years prior and didn't have a terribly memorable experience and this time was the same. I appreciate the care and the presentation that goes into each of the dishes at fat rice, but in terms of flavor I just really find it all mediocre. <br><br>My second time dining here recently, I was accompanied by a friend. We were seated very promptly at the bar and ordered the boiled park and ginger dumplings to start. I will preface this by saying I am extremely picky with my dumplings, and these were pretty good. The filling was meaty, but the real winner was the sauce. Spicy and sweet made the dish shine just a little bit more. <br><br>For our main entree, we shared the namesake, Fat Rice. The prawns were like warm but pretty well seasoned. The steamed clams were a bit bland. The curried chicken was also not exceedingly memorable. The most memorable of the lot was the char siu, which was fatty Carmelita's goodness. That in itself deserves a separate entree. While there was a good quantity of meat in the dish, I still felt underwhelmed by the flavors of each component. And for the price, cannot see myself coming back again for it. <br><br>Overall, a decent meal, but not my favorite. Probably won't make my way back unless requested by a friend.", "pics": null}}, {"review": {"des": "Breakdown<br>-----------------------------<br>Star #1 - Atmosphere/Decor:<br>Nice date night spot; however, plays in to the Logan Square restaurant trend of blasting loud music and having a tight dining area. We were seated with reservation immediately, but at counter. No offer made for elsewhere. I preferred that seating over tight tables however my date stated he didn't like the fact that the seats had no back. So it will depend on your personal preference on requesting in reservation where you want to sit. Easy to find free street parking as it's not directly located in Logan but in an off shoot area.  Star earned.<br><br>Star #2 - Service:<br>Service met expectations and at times was almost overly attentive. Plates cleared immediately, water filled quickly - especially on a hot day like when we were there. Star earned.<br><br>Star #3/4 - Food:<br>I would agree with previous reviewers that this place is an overpriced and overhyped restaurant. We first saw this restaurant on various must-try websites.  The food was good, but nothing \"wow\" 'd  us. We ordered the famous Fat Rice bowl and a few small dishes. The fat rice bowl was underwhelming and for a hefty $48 it was waaayyy overpriced. For the prices, you think they would be able to pit olives for you.....even Olive Garden does that....but I digress.... Overall just okay and don't have a big inkling to return. I did enjoy trying a local brew (IPA and Pils) that I had never heard of (Pipefitters).   Just one star earned. <br><br>Star #5 - Cost/Value:<br>The price is not fair at all. Way to expensive for the fat rice and potentially other dishes and it isn't worth it at all. Save your money and try another restuarant. Unfortunately, the other trend in Logan  Square is small plates, large bill. This one follows suite.", "pics": null}}, {"review": {"des": "A tasty adventure in a hip spot with upbeat staff and a big open kitchen.  Really fun to see your food being made as you drink one of their unique nar concoctions.  Try things on the menu you have never had before you won't regret it.  Also make sure to pop in to their little sweet shop after for something to complete the experience.  A great place in Logan that you have to try.", "pics": null}}, {"review": {"des": "At a high level...nice new flavors but over priced...samosas were $14 for 3 but they were smaller than a typical samosa.  The signature fat rice dish was tasty but at $48 it was over priced for a paella of chicken, prawns, and sausage.  Glad I gave this place a try but don't think I will return.", "pics": null}}, {"review": {"des": "A bit overpriced in my opinion but the food is really good. Got the samosas which are TINY. They came with a dipping sauce but tasted better without it. Also got the pork and ginger dumplings which were awesome. <br>From the bakery we got the everything knot. Sooo good. Didn't get a chance to try the Chicago dog bun or the egg tarts (they were out of both by 8pm) but will do that next time. Honestly the bakery is very reasonably priced and probably just as good for a tapas-style breakfast/lunch.", "pics": null}}, {"review": {"des": "My partner Daniel and I came here for our anniversary dinner. We made reservations through open table and were easily able to get a Wednesday night spot. I had heard great things and was super excited to try!<br><br>Overall, the experience was positive. In terms of service, our server Clara was phenomenal- attentive, knowledgeable, and ready to go above and beyond. When we asked about heading to the Ladies Room for an after dinner cocktail, she made a huge effort to coordinate with the host, etc. to see if we could get a spot (we could not, but all the more reason to come back and try those cocktails, which look amazing!). <br><br>In terms of food, it was mostly hit, with a couple misses. The salted cod spread was fantastic- definitely my favorite part of the meal. We also got fava escabeche, the linguiça, octopus with olive spread, the kari kapitan dish, and a side of rice. The appetizers were all fantastic, but we were disappointed by the kari capitan. The chicken thighs were skin on, which is usually fine for me if the skin has been crisped up (through browning, etc) but it was soft and a little flabby. The dish as a whole seemed to rely less on flavor and more on richness, and I definitely could have done without it. <br><br>Also, this may be just the misfortune of having such an interesting looking cocktail list in the ladies' room, but I was disappointed with their dinner cocktail list. Clara recommended a mezcal drink (the only other thing i remember about it is that it also had sweet vermouth), and although I enjoyed it I wished I could have tried some of the more exciting cocktails from next door. <br><br>Decor was casual but still good date-spot vibes, and the place was full and cheery by mid-way through our meal. <br><br>Overall, I wish I could give 3.5 stars, but am leaning towards 4 because of the outstanding service and wonderful quality of our appetizers.", "pics": null}}, {"review": {"des": "Asian fusion is done a lot these days. These guys advertise Portuguese and Macanese, as witnessed by the sardine appetizer served in a sardine can, and the grilled octopus with greens. The chef here really likes to garnish with edible flowers, too. I know lots of Chicagoans love this place, but I found it cramped, noisy, overpriced and pushy with the service. While the food is certainly good, it is sometimes gimmicky like the edible flowers.", "pics": null}}, {"review": {"des": "I had to think about this review for a while. We had the dates and the fat rice. The dates were small for the cost and it was way too fragrant. I love fragrant but it literally numbed our tongues for the entire dinner. So it was hard to thoroughly enjoy the fat rice. However, the fat rice was good and even better when we heated it up the next day (when we were better able to taste the flavors). The fat rice is a good portion and a great way to get a taste of the menu. My only less favorable part of that was the chili shrimp. I was most excited for the shrimp and it was bland in taste, just spicy. The char sub was delicious though as were the sausage and the rice itself. I would certainly go back and hope to update the review in a favorable manner after trying more items.", "pics": null}}, {"review": {"des": "When I went there, the atmosphere was good! The price is a little pricy compared to other places that I have been to. We ordered around 6dishes and the dishes were awesome! The rabbit dish, cheese app, fat rice, fish, duck, and etc. The decoration and presentation of the dish was 4/5 for me. The dishes aren't salty at all. It's savory,  clean cut, and fresh. You should give it a try and it is Macau food as they said. We didn't get the Portuguese egg tarts because they ran out", "pics": null}}, {"review": {"des": "We came in last minute on a Saturday and luckily got a table outside without a wait! However, it was only because another party was 5 minutes late to their reservation, so I would definitely advise taking your reservation time seriously. <br><br>We had the:<br>- Curry Vegetable chamuca: 1/5 Highly recommended by our waitress but it tasted like a chinese vegetable spring roll, which I personally really dislike<br>- Chinese chive pancake: 4/5 Really crispy and flavorful<br>- Cauliflower: 3/5 It had decent flavor but I wasn't too impressed<br>- Pork and Ginger dumplings: 2/5 Tasted of too much ginger and I didn't like the numbness of the schezuan pepper<br>- Chili Prawns: 4/5 A little on the spicy side but I really liked these huge prawns and the broth<br>- Seared Sweet and Sour Duck: 4/5 Duck was cooked and seasoned perfectly<br>- Green beans: 3/5 Good green beans, but not worth the $10+<br>- Fat Rice: 4/5 I was super excited to try this. I liked everything in it, but the char shiu really stood out along with the moistness of the chicken. Good dish for a large group of people.<br><br>Overall, the service and food were both good, but I expected a more from some of the items especially for the prices that we paid. However, I do it's a good spot for larger parties and worth a try.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cJ9y4bnonEk47WuVpJ8eIQ/168s.jpg", "caption": "Pancake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FJ4utcL4p1qTKeyKKa--tQ/168s.jpg", "caption": "Cauliflower"}]}}, {"review": {"des": "I definitely am expanding my food horizons coming to Fat Rice as I have never really had Southeast Asia food before. I made a reservation for a Tuesday so it wasn't too crowded. The place was nice with it's own Asian vibe and there was communal seating, which I didn't mind. We ended up sitting outside on the shaded patio, which was nice to avoid the Midwest summer heat.  <br><br>Unfortunately I did not try the Arroz Gordo as I thought it would be too much for two people. I ordered a seasonal cocktail, which was amazing. It had cucumber gin, club soda, and a touch of Habanero pepper. It was great as it was very refreshing for summer! Our waiter gave us a few suggestions and we ordered the dumplings, seared duck breast, and curry lamb rice noodles. I thought the dumplings and rice noodles were very good! I thought the duck breast could have been a little bit more tender, but it had good flavor. <br><br>Fat Rice is known as one of the best restaurants in Chicago so I will have to go back to try the Arroz Gordo next time.", "pics": null}}, {"review": {"des": "not a very accurate depiction of \"authentic\" macanese food but seeing that it is one of the only in chicago, it deserves a visit! i ordered the fava escabeche and the sweet and sour tamarind tofu- both very good! fava beans were perfectly marinated and had a complex flavor profile. the tofu was absolutely incredible-tasting, but definitely tasted more \"fusion\" in \"asian fusion\". oh also the coconut rice is heavenly and aromatic! my dinner companions, tall boys with large appetites, split a $50 fat rice and were pleasantly full.", "pics": null}}, {"review": {"des": "Hand made dumplings do not disappoint. Flavors of all dishes were unique and reminded us of food back home in India (curried cabbage, chillin peanuts). Drinks were nothing to write home about and the shaved ice bowl for dessert although tastes good looked very unappetizing. Service is fast and wait staff is courteous.", "pics": null}}, {"review": {"des": "Kudos to Fat Rice for impressing my husband!  For the most part, he hates trendy places and despises tapas.  I was able to reserve an early table this past Saturday night - which was shocking given I did that with only two weeks notice!<br><br>The place is small - seating maybe 40-50 so reservations are a must!  If you don't have one, you'll be waiting in the cold outside for a table b/c there is no place to wait inside.<br><br>Our wait staff was very good throughout the night and several people were always there to fill our water or clear away our dishes.  I like places where the staff helps each other out like that.  All very friendly and accommodating.<br><br>Now the important stuff - the food.  We started with the butternut squash bite which is a peeled cold butternut squash with ginger, peanuts and fried anchovies.  I was taken aback by the anchovies that were on top, but the crispiness was a nice touch.  The dish was good and refreshing and definitely had a spice to it (which I love!).<br><br>We then had the pork and ginger dumplings with a chili oil and pork fat crumbles.  The crumbles on top and the chili oil spice were really good against the dumplings.  Again - a bit of a kick on the dish and we enjoyed it.<br><br>And finally, the Arroz Gordo - a huge conglomeration of meats and rice.  Chicken, Sausage, pork, prawns, clams, etc.  The list goes on and on.  It was very good, and I really enjoyed the mixture of different meats.  It's a portion to share, and I highly recommend you get the dish.  The best part was the burnt edges of rice in the bowl.  Don't miss that!<br><br>I then finished it off with an egg custard - famous in Portugal.  Mine was a little more burnt than I liked.  It was definitely better in Portugal!<br><br>Overall - a great meal and I would recommend Fat Rice to anyone!", "pics": null}}, {"review": {"des": "Hands down my favourite restaurant I went to on my Chicago trip. Although expensive, totally worth it. The food was very different from anything I've had and the service was amazing. The staff helped us with our order and we were beyond impressed with the taste and look of everything. I recommend this to everyone in the area.", "pics": null}}, {"review": {"des": "It's a great restaurant, though it can definitely be on the noisy side, and I don't really understand the ebbs and flows of its business--I'd definitely call ahead. <br><br>I recommend it to people visiting the city.", "pics": null}}, {"review": {"des": "I had an excellent dinner here!  We ordered the curry cabbage, sardinhas forosos (sardines), pork + ginger dumplings, sweet & sour tamarind tofu, dry fried green beans, and tchai de bonzo (flat rice noodles).  Each new dish was a pleasant surprise!  Everything was rich, unique, and had memorable flavor.  Our cocktails were strong and bright as well. <br>The only negative about the experience was that the music was so loud, it was hard to have a conversation.  This was at 7:45pm on a Tuesday night!  Regardless, the food was amazing, and I will definitely be back.", "pics": null}}, {"review": {"des": "Cute little corner restaurant. Yummy Asian,  Portuguese fusion food!  <br><br>We arrived straight from the airport during brunch- with reservations.   Arrived a bit earlier and they were able to seat us right away. They had a smaller menu but We got the pineapple bbq pork bun$4, Portuguese sausage $6 and the pilla pilla chicken thigh $14 dish.  Burst of flavor with a kick of spice; just the way i like it!  <br><br>We initially came to grab drinks at the ladies room,  but we failed to see that it didn't open till 5:30. Bummer.   However... they were nice enough to open up the beautiful room for our party of 4!  We were so thankful!   Drinks are strong but a bit on the sour side. <br><br>Staff are great,  food is delicious!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kxQhg_5B5XJBdQa-8k3Ybg/168s.jpg", "caption": "Ladies room"}]}}, {"review": {"des": "Been waiting to eat here but sadly will never happen.  Came tonight to have dinner and dropped my wife off while I parked the car to get a table.  The receptionist told my wife that they can set up a table for three right away.  She also told the group behind us that it would be an hour wait.  When my younger son and I came in to join my wife the receptionist looked at us then immediately went out to tell the group behind us that they would be seated now and then came in to tell us that it was not a 45 min wait.  The reason she gave was that where she was going to sit us was for only 21+ and up.  Just to let you know that the area she was going to sit us when we passed by as we were leaving had a kid my sons age sitting at the 21+ area.  <br>I guess we were profiled in either way unacceptable or not good enough or won't spend enough to dine at 830pm on a Wednesday night.  <br><br>it would have been nice to try but be aware to all you may not get in....sad state of treatment in 2018.", "pics": null}}, {"review": {"des": "One of my favorite meals in Chicago so far. Food is so spicy and flavorful, service is warm and attentive and cocktails were perfect. <br><br>Highly recommend visiting their attached speakeasy, Ladies Room, for a post dinner drink.<br><br>Highlights:<br>+ spicy peanuts with anchovy<br>+ salt cod spread<br>+ fried rice with chicken<br>+ chili prawns<br>* fat rice of course<br><br>Unfortunately enjoyed the meal so much I forgot to snap any photos. I'll be back though!", "pics": null}}, {"review": {"des": "We ate in the Red Ladies room which was nice because it was quieter than the main room upfront. We had a group of 7 for a birthday and were seated right away. The waitress recommended we order 14-15 dishes for our size and it ended up being the perfect amount. We loved \"the fat rice\" dish, worth going for. The rest of the food was good as well: dumplings, duck, cauliflower, and olives come to mind. But they lost a star for high prices and the fact that I had brought cupcakes to celebrate the birthday and they were going to charge us $25 to eat them. When we spent almost $500 for dinner the least you can do is wave the crazy fee for 7 cupcakes. I think this is a one time and no need to go back place.", "pics": null}}, {"review": {"des": "Takes me back to South East Asia! The food here are simply delightful, the food has authentic Asian flavors, bursting in taste, as well as creative fusion twists! <br><br>The ambience  of the restaurant has a wonderful Asian and modern vibe to it and the service were excellent.<br><br>Thank you for the food and the experience!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fqth7jEALYFo7mtToORNWQ/348s.jpg", "caption": "Favorite of the day! Arroz Gordo aka \"Fat Rice.\" (this is something like a paella)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ob0iUDJgJmI3GDIABBRJzw/168s.jpg", "caption": "Coconut Rice"}]}}, {"review": {"des": "I've been to the bakery that Fat Rice opened a couple years ago and was joyed with their selection of different baked goods such as their egg tarts. After watching their appearance on Vice's Munchies series Chef's Night Out, I decided to try out the restaurant portion of the business. Service was excellent! We were seated promptly on a Saturday afternoon and our waiter explained their menu and specials. After reading through the different dishes they offered, we decided on 3: Singapore Omelette, a tofu dish, and their special \"Arroz Gordo\". <br><br>The Singapore Omelette resembled more of a scrambled egg dish with chow fun noodles. <br><br>The tofu dish was tasty and I enjoyed the enoki mushrooms that were topped on. <br><br>Paid around $14/per dish for the two above. I say that you can find similar dishes in Chinatown or Argyle for much cheaper. <br><br>As for the Arroz Gordo ($48), it was a mix of different meats(homemade sausage, chicken thighs, beef slices, char siu pork), 2 prawns, an egg, croutons, and rice. It's almost like a paella but with an Asian twist. I suggest passing on this dish due to its price. Don't get me wrong, it looks good and the presentation of the dish is neat, but I'm expecting something more unique than just combining different food items together in a bowl. <br><br>Fat Rice has a great atmosphere and excellent staff but is just way too pricy for Asian food that can be had for much less in Chinatown or Argyle. Our total bill came out to be $85.09 and we just had water (party of 3). I understand that the inspiration of the food comes from Macau but the dishes just seem like overpriced Asian food. I won't be coming back to their restaurant portion of the business but their bakery is definitely worth the visit.", "pics": null}}, {"review": {"des": "A rainbow of taste experience--all good!<br><br>When we came in, the hostess tapped away at her pad and got us seated in nearly an instant--that appeared impossible to do, but not so--thank you! (Imagine being at an airport and they actually get you on the plane you want quickly.  It was like that).<br><br>Our rainbow for the evening consisted of: Olives & garlic almonds, dry fried cauliflower (who knew cauliflower had such personality?), tchai de bonzo (rice noodles - smoked shiitake - almond - goji)--layers of good taste (thank you server for the recommendation, thus staying away from something less interesting), seared duck breast (plum sauce - taro dumplings - smoked shiitake - spinach--I said rainbow right?).<br><br>My partner commented she felt like she had taken a trip, somewhere exotic and quite enjoyable.  Indeed!", "pics": null}}, {"review": {"des": "Came here for a casual dinner and it was a lot of fun. Beautiful and hip ambience, intimate feel. Food was awesome and a perfect amount - split two entrees with cabbage on the side. I had to make a reservation a couple months out, but glad I made it here!", "pics": null}}, {"review": {"des": "This place is ALWAYS incredibly packed. I took a chance today to just show up for the late brunch and scored a seat at the bar immediately. Otherwise, don't be like me, make reservations online!<br><br>Anyway, Fat Rice is appropriately hipster-ish in this neck of the woods. Take it as you like - pricey and moderate portions. If you're in search of flavor town, there's much to explore here. I went with the Baked Pork chop rice, a take on a very popular HK/canto dish mixed with european, indian, and thai flavors. I suppose the Portuguese influence were the black olives and hard cheese, Indian for the Finger chiles (very sweet and spicy) and Thai for the lemongrass and coconut curry. <br><br>There's so much flavor and also comfort about this dish. I've spoken with the owners and chefs before and I really enjoy their passion in making their food. A good complementary beverage of HK milk tea just everso mildly sweet and creamy to wash it all down with. Felt it to be a bit on the thinner side though.<br><br>The open kitchen and setup is also very cool and warm as well. Per usual, it's a small place, so feel free to stopby solo or bring no more than 3 friends.", "pics": null}}, {"review": {"des": "Recommendation: Fat Rice, Pork + ginger dumplings. <br><br>Strong, tasty, Asian-fusion flavors. Fat rice plate is unique this restaurant. Worth the $48, just right for 2 people. Entree was well-portioned. Appearance and taste similar to paella and oriental clay pot. Start with the clams then move on to the shrimp. Finally conquer the chicken thighs and sausage while devouring the jasmine rice. Dip in the mushroom soysauce for added explosion of flavor. <br><br>Pork + ginger dumplings are a staple and must. Perfect as an appetizer. Similar in taste to dumplings homemade by any Asian Mom. Had added tinge of Szechuan, numbing aftertaste. <br><br>Need to make reservations before. However if you're a small party of 2 like us then you can sign up or go next door to their bakery. You can often find a seat there because the staff is very accommodating and nice. Otherwise you can stand by the bar \"taverna style.\" <br><br>Staff are knowledge about food, give thoughtful Recs. Willing to serve and accommodate. <br><br>Ambience in the main area is small but filled with Asan inspired art/decor. Certainly \"hip.\" Chinese-style decor with dim lighting contributed to the quaint ambience. Perfect for a winter dinner in Chicago. My favorite place though was the bakery which hosted people at the bars and at the tables. <br><br>The Ladies Room (cocktails), The Bakery (small bites/full course), and the Fat Rice (full course) are all connected.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/06UBBznk4ShiIZQFrcP_4g/168s.jpg", "caption": "Pork + Ginger Dumplings"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_e1wS15aAgJmco9gDSW8gA/168s.jpg", "caption": "The Fat Rice"}]}}, {"review": {"des": "Loved the mix of exotic flavors! The arroz mariscos, a portugese inspired dish, was so flavorful and in a rich broth and packed with seafood - monkfish, scallop, prawns (my fave), and clams. Oh that was so good I licked my fingers after sucking the juice out of the decapitated head lol. Also the pickled curry cabbage was a nice side that could be described as a macau-nese (?) version of kimchi I guess. <br>I wish I could try more dishes (so many to choose from!) if only I had 1. lots of $$ 2. more stomachs 3. lived in Chicago.<br><br>Next time I'm in town...", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GdDYIC-8BSk4KkwzgL-9gQ/348s.jpg", "caption": "Get it!"}]}}, {"review": {"des": "I've been looking forward to coming here for a while. I finally was able to come for dinner with my partner for our anniversary. It was good. Not the best meal I've ever had, but good. There were some things I thought could be better, but I would come back for brunch or come back when the dinner menu changes.<br>None of the bites really interested me except the assorted buns from the bakery, but unfortunately they ran out. We ordered the chili prawns, pork+ginger dumplings, the shrimp+corn, and the duck breast. We also got a side of coconut rice for the shrimp.<br><br>Chili prawns- We ordered the 6 piece. They were huge and seasoned well. Really tasty but a bit awkward to eat if you're not comfortable eating shellfish with the shell on. I'm not afraid to get messy so it didn't bother me and personally I enjoyed the prawn heads. They give you a little bowl with warm water and towelettes to clean your hands though the mess wasn't a problem.<br><br>Pork + ginger dumplings- I was pretty excited about this and it unfortunately fell short. The sauce and the spinach that came with it were flavorful, but the dumplings themselves were bland inside and in need of seasoning.<br><br>Shrimp + corn + heirloom tomatoes in coconut sauce- Probably my favorite dish we ate from the dinner menu. Reminded me of like a tom khai gai/Thai coconut soup. The shrimp was tender and cooked perfectly. If I had to say one negative, I wish it came with more of the sauce. When you spoon everything over the rice, there was barely enough sauce to cover each bite of rice.<br><br>Duck breast with chive pancake+ octopus demi + nori- The duck itself was great. It was cooked perfectly and seasoned well. Neither my partner nor I enjoyed the chive pancake and nori with the octopus demi and kewpie mayo. It just seemed like a weird pairing for duck. The pancake was not like a crispy fried pancake I'd expect to get at somewhere like a Chinese restaurant or at dim sum. Maybe that's how it's supposed to be, but the texture was not very pleasant.<br><br>Dessert was fabulous. We ordered the batatada and an ube milk bar from the bakery. We ended up being so full that I just took the milk bar home in my purse lol. It made for a really lovely breakfast with my morning coffee. The batatada was heavenly. My partner took one bite of the white chocolate mousse and he said he felt transcended like the food critic in Ratatouille. I especially loved the combination of the white chocolate with the strawberry jam.<br><br>Cocktails were excellent.<br>Service was excellent. Marcellus (sp?) was really kind and attentive. He recommended the batatada for dessert so props to him. He also recommended the steak so maybe next time we'll try that.<br>Overall, I thought Fat Rice was good. Some dishes were really good, some were okay. I would definitely come back.", "pics": null}}, {"review": {"des": "For someone who is Chinese, I can't say that these flavors hit that close to home. They have components (soy sauce, dumplings, tea etc) that tries to integrate some Chinese culture but I'm not that impressed. We had the prix fixe voyager and for its extremely high premium, I was not really satisfied. <br><br>The highlights would have to be the prawns in the fat rice, cod spread and egg tarts. Their egg tarts were delicious!! <br><br>If you're looking for Asian inspired foods, I'm not sure this is the place for you. Oh and they highly encourage large parties to do prix fixe which we did so it constrained our options.", "pics": null}}, {"review": {"des": "Ordered the fat rice, it was very filling and all of the different meats were very nicely cooked. Good service and the restaurant was nice but loud, so be prepared for that.<br><br>Did not like the burnt rice on the edge of the pot", "pics": null}}, {"review": {"des": "I've been wanting to try this place for a while as I've heard nothing but good things! I came on a Sunday late afternoon, and while the main dining room was full, they were able to accommodate us at their bakery a few doors down. The lounge area was cozy and comfortable- I didn't mind at all! I ordered the baked pork chop rice and loved the flavors! It was definitely salty but so savory and the rice was cooked well. The pork was a bit fatty but otherwise tasted good. We had great service and stopped at the bakery on our way out. I was interested in trying the Chicago hot dog bun, but was sorely disappointed. Parts of it were good, but the relish had a funky flavor and it didn't work together. I think I'd be back to try some of the sweet pastries and other entrees!", "pics": null}}, {"review": {"des": "I was a little hesitant to try fat rice. We were visiting my best friend in Chicago and she recommended it. Let me say, it was a good recommendation. The menu is not something I would navigate towards normally, but we all loved it. Our server Josh was more than fantastic! So patient, so nice. Knew absolutely everything and explained it better than we could have asked for. He have great menu recommendations and we took his advice. We got a few appetizers and a few meals to share. The \"fat rice\" dish is huge and good to feed 2-3 people. The broth the Spanish mackerel was cooked in was delicious. I kept spooning it over rice because I loved it so much.  I would recommend fat rice and I hope to go there again next time I am visiting Chicago!", "pics": null}}, {"review": {"des": "Some of our friends had told us that the fat rice wasn't worth it--that it was too small and pretty standard, so we didn't order it.<br><br>We did order: pork dumplings, capela (a meatloaf; it was a winter special) and peri peri chicken. I would definitely recommend the pork dumplings with XO sauce; the sauce really made it for us. The meatloaf was good, not amazing, but it got cold kinda quickly. The peri peri chicken was pretty good, it had a spicy kick to it and the skin was very flavorful. It also came with rice with some seeds on it, and that was pretty good. <br><br>We also got the double duck (coffee + milk tea) and passion fruit jasmine tea, both of which were very good and I would also recommend. The tea was light and the double duck had a good blend of both flavors.<br><br>Staff was also very friendly.", "pics": null}}, {"review": {"des": "After a fairly long hiatus, my husband and I swung by Fat Rice last week and ordered their namesake. First off, the name \"fat rice\" is extremely appropriate for this dish. Do not order it if you're on a diet. In fact, it really should just be called \"Noah's arc\" because that's what it seemed like - a bunch of different animals all in one bowl! Second off, it's delicious.  Served perfectly cooked, with a light soy dipping sauce, it was easily enough for two people. We brought a third of it home. <br><br>My recommendation is to order this when you go with a larger group of people. There are too many other wonderful dishes on the Fat Rice menu to commit you and your dining partner to one item. And while amazing, the dish does get heavy after a bit. All in all another great Fat Rice visit and can't wait to go back!", "pics": null}}, {"review": {"des": "This is a great gem of a place!  We started with the fresh made daily iced tea (it's a different flavor each day) and the samosas.  The samosas were very tasty and a nice start to our meal.  Everything only got better from there.  The green curry mussels were amazing-- we practically licked the bowl clean. The sauce was delicious and the mussels nicely cooked and flavorful.  The bread that came with the mussels was nice and crusty on the outside but lovely and soft on the inside. Along with that, we had garlicky greens which were a lovely side dish.  Next we had the beautiful hash.   It was meaty and the eggs on top were perfectly cooked-- allowing the yolk to run beautifully when cut.  Finally we had the peri peri chicken.  The chicken has a great flavor but, a word of warning, it is very spicy.   Our server seemed kind of new.  He warned us about the mussels being spicy (they weren't), but didn't say a word about the spice level of the chicken.  Overall, this was a very enjoyable meal-- I will definitely be back.  <br><br>We skipped dessert because we went to the Fat Rice Bakery instead.  You can check out my review of that, if you are interested.", "pics": null}}, {"review": {"des": "Fat rice is a fun, cozy, and casual place to grab a nice lunch or dinner. The menu is fairly small but full of flavor and variety! We had the dumplings, stir-fried rice cake, and Macau baked pork chop rice.", "pics": null}}, {"review": {"des": "Visiting from Boston, we enjoyed this immensely. I want to give props to the outstanding hostess, who moved heaven and earth to honor our reservation. We had to wait a couple minutes because a table of four appeared be lingering too long, so we got the opportunity to see the chaos that the hostess deals with.<br><br>First, there was an older couple being very demanding, despite how busy the place was at 8:00 on a Saturday night. Apparently they had walked in and waited quite a while against the hostess' recommendation, and when there were finally some seats for them, they complained about being seated next to a window. In a beautiful act of midwestern passive aggressive revenge, the hostess sat them on two backless stools at the bar while thanking them for \"being so accommodating.\"<br><br>Then a guy walked in and before even greeting the hostess started barking his takeout order. Two words in, she stopped him and told him that they weren't doing takeout orders. Entitled and incredulous, he reacted like someone who had never been told \"no\" before. She swept him out the door like so much dust, yelling at him to close the door behind him.<br><br>Next, a couple came in with a bold lie: they were meeting their friend Maria, and she was already here, and they were just going to join her. Without batting an eyelash or looking at the ipad that keeps the reservations, the hostess sniffed this lie out and said \"there's no Maria here, please step outside while you call her and close the door behind you.\" The couple huddled in the entranceway before sulking off with their tail between their legs.<br><br>This all happened in the course of just a few minutes! We were seated fairly promptly. <br><br>There are 1000 other reviews here that talk about the food, so I'll just mention the tofu: this dish was incredible, with the mild silky tofu seared in a sweet/sour tamarind sauce and a perfect thin crispy crust on the outside, topped with a festival of thinly-sliced veggies. I'm still thinking about it.", "pics": null}}]}