{"name": "fatsos-last-stand-chicago-2", "reviews": [{"review": {"des": "Honestly, if I could physically eat here every day and not get heart disease, I would. Really light on the wallet, super delicious, actually NOT that greasy (I mean the burgers and dogs, sorry fries are self-explanatory), and they make everything on the grill for you in front of your eyes. There's no hullabaloo about this place - its nonpretentious, cozy-feeling, and the place smells like heaven - all with some good ol jazz sprinkled with the Beatles playing overhead (sorry, no junk they call hip hop these days). <br><br>Their burger with egg and bacon (add-ons, so just a little extra moolah) is probably THE best burger under $10 I've had...ever. Char dog is pretty average (you'll find better at flub a dub chubs or even Portillos), maxwell polish is where it's AT. Be warned, while it is usually a good thing, they give copious amounts of fries with everything - whether it be a huge whopper burger or a $4 hot dog (plus 2lbs of it is only $2 i think), so if you want to beat the bloat, well....I guess you can't unless you grab a to-go bag (if  you want to save them for later, like me), because the price doesn't really change with or without the fries. <br><br>The outdoor seating is a must in the warmer weathers, you sit right across from this beautiful ukrainian chapel! <br>Tip: apparently you can call them and order ahead, skip the potentially long line if you have to!", "pics": null}}, {"review": {"des": "Wait, veggie hotdogs? Are you kidding me? Score! I didn't know what to expect from it, since it was fried veggies shaped in a hotdog form. I've been itching for a veggie dog so I thought I might as well try it.<br><br>Haven't had a proper hot dog in four plus years since going pescatarian. The taste was so-so. I'll probably give it a whirl again next time but without relish. To he honest, I was all about them fries!!! Woowee what a portion. <br><br>Delicious indeed and if you're afraid of grease, stay away from them. I can see how this place becomes a riot after bars have closed on the weekends since they're open late. Lots of outdoor seating as opposed to indoor seating. They have speakers everywhere that played oldies, but goodies!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/twU0qucDolE5z4qlhj0ddw/348s.jpg", "caption": "A good amount of fries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qE0kuW1dFkLB4DgmccbUjQ/168s.jpg", "caption": "Veggie Hot Dog and fries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/L22yw-aS9TOuEOPUOxQ9Vw/168s.jpg", "caption": "Interior"}]}}, {"review": {"des": "I'm on a prowl to eat all that Chicago's got to offer on my short visit. That includes deep dish pizzas and Chicago dogs of course!<br><br>Fatso's was my first stop for the cities infamous Chicago dog. There is a parking lot out back, outside seating area, and limited seating inside. This joint's layout reminds me of a Foster Freeze from back home but the food is so much more. They hit a gong when you tip, so tip on folks!<br><br>Food:<br>1.  Chargrilled dog with cheese- 4 stars, I was very excited to begin my Chicago dog journey here. It came with onions, two green chili peppers, sliced tomato's, relish, mustard, NO KETCHUP (ob), and a quartered pickle. Although it was really good and I would definitely come back. The dog did not have that \"snap\" I was looking for when I bit into it. I was slightly disappointed, although it did come with yummy fries. <br><br>BUT let me tell you about the show stopper. The ooey gooey, clog your arteries and oh sooo good burger, my God!<br><br>2.  Ooey Gooey Burger with fried egg-  5+ stars!  My boyfriend got this, and I'm a bit jealous I didn't. Two beef patties, enveloping a hefty chunk of cheddar, pinched and sealed on the sides, and grilled to perfection.  He bit into it and cheese immediately melted and OOZED down the side, he took another bite and the egg yolk OOZED down the other side. I was so jealous!! But his delicious burger didn't come with fries, so I bargained some of mine for a few bites. It was heaven.<br><br>We also got two drinks, a jaritos and a bottle of half and half (half tea, half lemonade). Our total came out to about $23. Well worth the money.<br><br>Keep doing you Fatso's, bc you're doing it right. Until next time.  :)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rTXfhLDzmVQ8U0GgR8vkXQ/168s.jpg", "caption": "Bomb ass Ooey Gooey Burger with fried egg.  Picture taken before it exploded with cheese and egg yolk  delish! 5+ stars"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/crYUiwFVek1pz-yTU-ReIg/168s.jpg", "caption": "Cheese chargrilled dog, 4 stars  Missing that \"snap\" from the casing when you bite into it, but still g-o-o-d"}]}}, {"review": {"des": "I have now twice ordered delivery from here and both time delivered exactly what I had hoped for when you name a restaurant like this - greasy, satisfying and delicious fast food.  I don't mean greasy as in oily, coating you palate and making you feel ill - I mean greasy like burgers stuffed with cheese & an absolute star at this joint deep fried shrimps (shout out to Anthony Minne for turning me on to these).  <br><br>This is the fast food that every fast food restaurant dreams they can serve but will never be able to achieve.  I also feel the need to say that delivery service is prompt, courteous and professional - yea they will be getting more business from me no doubt.", "pics": null}}, {"review": {"des": "I was reluctant to enter this spot as I really did not want to make this weekend full of greasy fast food but I'm so glad my crew dragged me into the heavenly vortex my taste buds were about to twirl around in.<br><br>The ooey gooey burger was so damn perfect; exactly what you'd want out of the name.<br>Do the Doug and put some deep fried pickles on that thang!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4-8iiFE5pP2BIAp9yOdIRQ/348s.jpg", "caption": "Ooey Gooey"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/I9ISQBQU9hREaam3uslxeQ/168s.jpg", "caption": "Chicago dog n fries"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jOFhAUHSHO6tj2FOEaL6kw/168s.jpg", "caption": "Ooey Gooey"}]}}, {"review": {"des": "To be fair, I don't think I ordered the right thing.  When visiting a new city, my rule is to always order the restaurant's specialty, otherwise why bother?  However after four days of wookery at Electric Forest in Michigan, my gf and I had completely forgot about the rules that ourselves and polite society typically honor.  We had some time to kill before dropping our rental car and flying out of Chicago, so we decided that we just had to get a Chicago-style hot dog before departing.  After scouring Yelp we decided on Fatso's, however in hindsight it seems like the burgers for which this place is named were probably the main attraction that we missed out on.<br><br>My gf ordered a char-dog but after four days and nights of substituting vegetables for strange elixirs, in that moment I just felt like I needed to improve my health and ingest some greasy plants and consequently ordered for the Italian sausage.  We added a side of mac & cheese (btw did you know that \"mac\" is an acronym for Macaroni And Cheese, therefore saying mac & cheese is a little redundant on the dairy?) and I also got a Reese's shake.<br><br>The char-dog wasn't life-changing, not bad but not a must-have in our opinion.  The Italian sausage had a similar reaction, solid but not a game-changer.  However the mac & cheese was a warm moment of welcome-back-to-civilization.  The cheese sauce walked the fine line between being too rich/origination from a powder and had a thick consistency that paired well with the al dente noods.  My Reese's shake was great, perfect balance of PB and chocolate that was pleasantly lighter than the candy itself.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-Rmli3Xd_gld-UX1bEue9A/168s.jpg", "caption": "Italian Sausage"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KgvnmIwKzeu2FKmc0zIWmw/168s.jpg", "caption": "Mac & cheese"}]}}, {"review": {"des": "I love their shrimp po boys. The burgers are great. One of my favorite greasy spoons in the city. They have something for everyone.", "pics": null}}, {"review": {"des": "Cheap eatery with great food. Their menu offers burgers and hot dogs. Simple menu but it hits all the right spots. <br><br>I tried the chili cheese hot dog with fries. The chili was pretty flavorful. The fries were my favorite, they were just the right size with the right crunch and perfectly seasoned. <br><br>I also tried the charred hot dog, which is where they press it down on the grill for that slightly smoky flavor. This was pretty good, a typical Chicago hotdog with all the right condiments. <br><br>Also, for all you ketchup lovers out there (I.e. me) they have tons and tons of it!! Sorry not sorry for being a gal who loves ketchup on her hot dog.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZpfkzO2bCXB2nCLGPXbm1w/348s.jpg", "caption": "Chili Cheese Dog"}]}}, {"review": {"des": "Who are you, and where did you come from? I honestly cannot remember when I bookmarked this place, but I do remember it being on my cycling route while headed downtown via Chicago Ave. After visually seeing 'Fatso's Last Stand' due to its Captain Crunch look-a-like character being plastered on the building it was love at first sight, and only a matter of time before I made my initial in-store visit. <br><br>Don't judge me! Prior to my initial in-store visit I did cycle 13 miles, and did a ab burning workout because I knew what was in store for me, plus I knew damn well that there was the possibility of being put in a food coma due to certain flawless items on their menu, hehe.<br><br>As for my order, I ordered the Veggie Dog w/fries, then later ordered a Single Fatso Burger w/cheese to go because the Veggie Dog wasn't filling for me. As for the Single Fastso, it was by far the best burger that I have had in a while. And I absolutely cannot wait to have another, plus try a few other items on their menu, such as the Ooey Gooey, Char Dog, Adult Mac, and one of the Fatso Shakes due recommendation in a review by Monica E. <br><br>And lastly, parking is no issue at Fatso's because they have their own parking lot, plus neighborhood parking option if it gets too snug.<br><br>Thomas G", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mMNJK4PNQxh0yx40nykvyw/348s.jpg", "caption": "Double Char Dog w/ Fries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jxfoBybLa9Aqvvd8Q3ov3A/168s.jpg", "caption": "Double Char Dog w/ Fries"}]}}, {"review": {"des": "What we ordered: cheese dog with fries | Super Ooey Gooey<br><br>Taste: it was good, just didnt really taste the cheese. i enjoyed the burger which had lots of flavor<br><br>wait time was a little long for no one in the shop at the time.", "pics": null}}, {"review": {"des": "Like this place a lot. The burgers are wonderful but today we got dogs--char dogs & polish! Dogs are all beef! Yay! Get it with everything--perfect Chicago style! The fries are really good. They've got limited inside seats but a side patio that's got plenty of space. Open late. Good place.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wFE8Zdonc7RHD095Noisww/168s.jpg", "caption": "Good food and relatively cheap eats!"}]}}, {"review": {"des": "If you're coming to Fatso's, do yourself a favor and go with the double Fatso with cheese, please!  Be prepared for a greasy joint experience, but when you take a bite out of it and the cheese and juices start to ooze, you'll understand the hype.  <br><br>The execution is not as neat as Small Cheval although taste and quality of meat is up there and couple dollars less.  The fries are more like potato wedges so they don't do much for me, but if you like softer fries that have the skin, these are it.  Indoor seating is limited, but there additional benches outside.", "pics": null}}, {"review": {"des": "Fatso's is most definitely a prime 3am drunk food destination.<br><br>Between the fried pickles, cheesy tots, shrimp po'boy, double fatso (burger) with cheese, and fried jumbo shrimp - the BURGER and CHEESY TOTS were the BEST. The fatso sauce is pretty much a chipotle mayo type of concoction and obviously delicious with everything. The fried pickles were so disappointing because it was just too overly salted. It might've been my batch but it ruined the experience for me. The fries were also short and I could tell they were at the end of the batch (understandably since it was 3am) but made me peeved nevertheless.<br><br>Our 3am escapade to Fatso's was certainly worth the caloric splurge. I had everything my heart wanted and had the best sleep that night in many nights.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/u79CnMPwM5NMlcmLwRpBAw/348s.jpg", "caption": "The glorious spread: shrimp po boy, double char burger with cheese, tater tots (more like fried dough or hush puppies?), Fried pickles!"}]}}, {"review": {"des": "This is a really cool Chicago casual food spot with a ton of character and really great food. Before visiting Chicago, I knew that hot dogs were one of the foods the city was known for doing well. I'm really glad I picked Fatso's to get a hotdog while in Chicago. It was super good and I really liked how they dressed it with peppers. The fries were also really good and this place overall was very charming. Since the weather was nice, I was able to eat outside on their patio. The service was also very friendly.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MZaxRcCBdbkxjJcEercvqQ/348s.jpg", "caption": "Veggie Cheddar Dog with fries."}]}}, {"review": {"des": "This may be the easiest 5 star review I will ever write.  I live about 2 blocks from Fatso's and it's really hard for me not to eat there every day.  The burgers are great, and you can tell that they're fresh.  The fries are cooked perfectly and are to die for, but the real killer side are the friend pickles!  These tend to be one of my favorite sides anywhere, but Fatso's does them especially well.  I don't know what they do in this fryer, but it turns out some magical grub!  Lastly, I simply cannot leave this place without first getting one of their signature milkshakes.  I always get my favorite flavor combination, chocolate and banana, and it's one of the best that I have had.  This place is great at 11am for lunch, 6pm for dinner, or 2am after coming home from the bars.  The versatility is the thing that I love most, aside from the killer burger!  Fatso's is a must try!", "pics": null}}, {"review": {"des": "As good as a hot dog gets. Perfectly charred..good fries if you eat them right away. I don't suggest traveling with your order. Grab a seat and dine in. Service is fast and friendly. <br><br>Chicago has a surprising number of hot dog stands that also offer shrimp. Not a pairing I'd immediately think of, but Fatso's does it best. My Yelp friends know how much I love Red Hot Ranch for a short order burger. They too serve hot dogs, shrimp and burgers. Fatso's takes the crown with hot dogs and shrimp. ..even the Veggie Dog is delicious! The burgers are solid, but I prefer RHR's single with extra cheese.<br><br>Fatso's now accepts all major credit cards. This is refreshing because many of these stands are cash only. I highly recommend checking out the next time you're craving panko breaded Gulf shrimp and a char-dog. LOL.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KiNBKvWJOjtBmys-jMw8Ug/348s.jpg", "caption": "1/2 lb Shrimp - panko breading"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yxq3cOflxZVaLdoNbctkjg/168s.jpg", "caption": "Char-dog Chicago Style"}]}}, {"review": {"des": "If you're looking for quality fast food that's more traditional rather than creative, then Fatso's is a good place to go. For example, the hamburger options vary mainly in terms of size and cheese, not in terms of toppings and sauces. In spite of this, the menu is actually fairly large with all the types of foods that are offered here.<br><br>I enjoyed their fried shrimp cocktails which were crisp and still really hot even after sitting for several minutes. The regular cheeseburger was also good. The cheddar burger, however, was not what I was expecting. Rather than a slice of plain cheddar, it was mushy from being mixed with other things that I would guess to be milk, butter, and/or other cheeses.<br><br>I must mention that the prices are completely reasonable. For instance the mac n' cheese items may cost more than the burgers, but they will also fill you up more as well. In fact, the average person may find themselves having leftovers from a single order of mac n' cheese!", "pics": null}}, {"review": {"des": "I appreciate all the amazing reviews of fatso's and I visited the place for lunch today based on all that. I had checked the menu ahead of time as many burger joints aren't vegetarian friendly. They had a veggie burger on the menu, so I thought we'll give it a shot.<br><br>Actually, when I got there, I double-checked the menu online again, because from looking at the place it was almost a small shack, which made me double-take that they'd have options for me. I confirmed it and went in. So the shop is a small tiny place, but it looked like they have a big patio outside, which seemed cool...<br><br>So, the veggie burger was... OK. Pretty much ended being one of those frozen patties that they grilled up and served. That was probably the norm 10 years ago, but this is are really changing. There a TON of amazing veggie burger options out there now. Anyway, I'm giving this place a whole extra star for having at least something on the menu.<br><br>So you'd think the rest of the food was steller? The fries we got were... good. It seemed like we got fries scraps. What I mean by that is it was 80% those tiny fries you get at the bottom of the bag... The flavor wasn't bad, though. Nice and crispy. Also... The cheddar part of the fries was also meh... The cheese was served on the side, which is smart, but it was kind of a grainy texture instead of a smooth sauce. A bit disappointing.<br><br>Lastly, the shake was pretty good, as you'd expect. I mean, it tasted like mint chocolate chip ice cream blended into a shake. So yeah... It was fine.<br><br>Lastly, the patio didn't turn out to all that it seemed from a distance. I think it needs to be renovated, or cleaned up on a regular basis, at least. I mean, we still ended up sitting out there, because it was a beautiful day, but the place needs more upkeep.<br><br>Listen, every place isn't for everyone and I completely understand that. My review has a veggie bias, of course, and while I commend them for carrying an option, I would expect they could easily step up their game a bit. Overall, thanks for a decent first-time experience.", "pics": null}}, {"review": {"des": "This place was so wonderful!!!! I took my boyfriend here to try an authentic Chicago hot dog (which he loved) and was very pleased to find that not only do they have a veggie dog, but they have a HOMEMADE veggie dog - how cool is that? We were both very happy. My boyfriend also tried a shake and shrimp, which he thought were phenomenal.<br><br>More than the food, the people were fantastic. There were four wonderful, fun, funny, lovely people working that night and we joked and turned the place into a karaoke hall. They were absolutely fantastic and gave a wonderful Midwest welcome to my skeptical New York boyfriend.", "pics": null}}, {"review": {"des": "Simply put, this place is not for the faint of heart. To elaborate further, I had wanted to come by here for a bite to eat when I was in town last month. I specifically chose this place as they had veggie hot dogs. What I didn't realize was that these veggie hot dogs were basically little logs of deep fried vegetable matter, which honestly did not taste great. I'm imagining most people who come by here wouldn't come for their veggie hot dogs anyway, so take my review with a grain of salt. Portions are large, for what that's worth, and things are pretty cheap and divey. Can't really go too wrong here if you happen to have a hankering for Chicago style dogs, otherwise.", "pics": null}}, {"review": {"des": "My husband and I LOVE burgers. And we're pretty picky about the ones we eat. The ooey gooey and super ooey gooey burgers are by far one of our favorites. It's a must.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tVKvhvpVLbIiA9SqUaYxYw/168s.jpg", "caption": "Ooey Gooey"}]}}, {"review": {"des": "Fatso's has been on my list to check out for a while now. I love cheap hole in the wall type places. Let me just first say Fatso's isn't as cheap as you think. I spent over $10 for a burger and fries but whatever. <br><br>My favorite burger in the whole world is Au Cheval. Best burger in Chicago is Au Cheval. However, there has been zero clear runner for the #2 spot in Chicago for best burger. Until I finally got to check out Fatsos. Had a couple of drinks at California Clipper (by the way a really great awesome place) and realized Fatso's is near by. Got the double Char Burger with Cheddar and a side of fries. This review is soley based on the burger. I'll tell you right now, the fries were whatever. <br><br>Anyways, the burger was WOWOWWOWOWOW. I can only imagine Paradise Pup being just as good or better but the Charred burger at Fatso's was PHENOMENAL. Had that perfect charred off the grill flavor and the patties were juicy. I need to try this place again. It can't be that amazing can it? But my initial reaction to this place is wowowowowowowow. So surprised by how great this place was. I will definitely be back with no alcohol in my system but I'm sure it will be just as good sober.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/z3GFKB4hy1mPdfjU9y5k8A/348s.jpg", "caption": "Got this burger to go and wowowowowowow very good. Double charred cheddar burger. Fries whatever. But the burger was phenomenal"}]}}, {"review": {"des": "The hot dog was delicious and super reasonably priced. The fries were absolutely addictive. The fried pickle chips were average , but you get a huge amount for a small price. I was not a fan of the Mac and cheese. Overall, I'd say stick to the hot dogs because they are awesome.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZWeS2Ts8RFZCGrJn-KOcxg/168s.jpg", "caption": "Mac and Cheese"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iWq3Mbp9amnuH7eQ1FRaiQ/168s.jpg", "caption": "Char Dog w/ Fries"}]}}, {"review": {"des": "Pros:<br>Grilled onions nicely carmelized<br>Dogs had a thin crisp char<br>Great value<br>Plenty of outside seating<br>Fast service<br>Open late<br><br>Cons:<br>Soggy bun--hot dogs fell apart<br><br>Recs:<br>Chicago dog", "pics": null}}, {"review": {"des": "When ever I'm in the old neighborhood I make sure to stop by here. Best burgers in town lets talk about it. Big juicy greasy burgers just the way it's suppose to be done.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/19QZRc_Yfn0lr5v_h1fYlg/168s.jpg", "caption": "The inside of a Double Fatso."}]}}, {"review": {"des": "Let me start by saying that my three star review is <br>in no way a slam at Fatso's. I dig the place and <br>\"A-OK\" means it's pretty good. Remember<br>though, it's a hot dog stand. I have to chuckle at <br>those who complain about their vegetarian picks <br>or those who start their review by stating \"This is <br>not healthy food\". Really? I'm still alive and well.<br><br>Still, I'm torn. Good tasting charred dogs, but could<br>they be any smaller? With the Chicago garden that<br>is on the bun it can be difficult to truly appreciate<br>the flavor of that dog. Plus the price of that tiny dog.<br>Yesterday I spent $15.40 cents for two dogs and two<br>soft drinks. Granted, fries were included but it's still<br>a bit on the high side. Give me a larger dog and I'll<br>delete this complaint. I guess I'll have to order the<br>double dog to get the experience of the meat and <br>pony up the price.<br><br>Okay, the fries. People are really bitching about the<br>small fries by saying they must have gotten the bottom<br>of the bag? Sure I like the long fries but bring on those<br>crispy little buggers. Talk about finger food!<br><br>This is not some tiny hole in the wall where you grab<br>your food and your only option is to eat uncomfortably<br>in your car while juggling your order. Fatso has two square<br>tables in the front and a building length counter with stools.<br>You don't need to be uncomfortable and Fatso's appears<br>to be clean except for the sloppy Chicagoans that throw<br>their napkins and straw wrappers on the floor instead of<br>in the trash. In many places complaints can be attributed<br>to the customers and not just the business owners. Also,<br>go ahead and enjoy the patio in nice weather. Again. it's<br>clean, has sufficient seating and is pleasant on a nice<br>spring or autumn day.<br><br>*Edit*...I'd love to know what seasoning they use on the<br>\"garden\" besides the celery salt. It isn't simply black pepper<br>because it adds a little bite to the seasong. Tasted great on<br>the very thinly sliced tomatos. (Thanks for the very thin slices)", "pics": null}}, {"review": {"des": "Love LOVE love Fatsos!!! Food is consistently great, staff is friendly and helpful, it's always clean, it's as good as fast food gets! Thank you fatsos for always helping our hangovers", "pics": null}}, {"review": {"des": "If you're reading this I hope it's 3am and you're on your way back from a wild night out because fatsos sole reason for existing is to nurture you in your vulnerable state before you wake up so so hungover tomorrow. <br><br>What else is there to say? Everything is reliable, but I have to say their Mac And cheese with hamburger blew me away. Leftovers in the morning not so great, but wow in the moment that Mac was my everything.<br><br>Also treat yourself to a milkshake, you deserve it.", "pics": null}}, {"review": {"des": "Chicago dog with fries obviously good! This little shack on the corner is tiny! If you don't want to smell like a burgers and fries during work, or before a meeting order inside and walk outside right away. The grease smell/smoke was a little overwhelming. <br><br>Suggestions-restaurant should upgrade the exhaust fans <br><br>Moose out", "pics": null}}, {"review": {"des": "Fatso's is life giving nourishment that has brought me endless, end of the night joy. Burgers, great. Chardogs, great. Fried shrimp, great. When they added milkshakes my world stood still and it became clear that we are soulmates, Fatso.", "pics": null}}, {"review": {"des": "You probably wouldn't guess that a hot dog joint would have incredible mac and cheese, but then you would be wrong.  In addition to great hot dogs, burgers and fries, the mac and cheese at Fatso's is life altering.  Open until 4am, it's hard to find a better place to stuff yourself silly with tasty food after bar close.  Even sober, the food is fantastic- the hallmark of a truly great establishment.", "pics": null}}, {"review": {"des": "Try the veggie dog! So delicious - cool patio for dining in the warm months also", "pics": null}}, {"review": {"des": "Really good! The service was awesome, food came out hot and fast. I've heard really great things about his place. It definitely didn't disappoint.", "pics": null}}, {"review": {"des": "I had their char dog Chicago style and their Maxwell polish. They were both amazing. Most places serve just the basic steamed hot Dogs and a select few actually offered them charred. Charred is definitely the place to go. They both came with fries on top, the Chicago, with the usual mustard, onions, pickle, sport peppers and the polish with mustard and grilled onions. They both were perfectly done. <br><br>The workers inside were pretty cool. They looked like they were having a great ol' time singing and dancing all while making me those perfectly delicious hot Dogs. There's are plenty of options to choose from the menu. I can't wait and go back to try the rest of the items...especially the burgers.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RQA82anheUkDnxJI1Lvc1A/168s.jpg", "caption": "Maxwell polish"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UYhFD_qhNOoPVlXeRxd5Ng/168s.jpg", "caption": "Chicago char dog"}]}}, {"review": {"des": "Came in drunk, left sober! <br>I have declared fatso the best drunk people food in Chicago until further notice.<br>Me and the girls were at the bar across the street and decided to go to fatso while we waited for Uber.  I needed a greasy burger to soak up all the alcohol from like three drinks; yes only three drinks, I'm a lightweight. Saw Fatso's in the distance looking like a bright Northstar guiding all the drunktards, including myself. I ordered a single fatso with cheese and it was really delicious. They seasoned there burger so well. And I was thinking, \"is that what makes it taste so good, salt?\" So many restaurants don't season there burgers. My sister ordered an Uber which was 3 minutes away. I was done by the time we got the call that they were outside. Now that's a testament to good food.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1kiULY7xOmuxh2uaDavZZg/168s.jpg", "caption": "Yes, that's my drunk ass sobering up"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ODQu1zxfLKv52LO3BdlDrg/168s.jpg", "caption": "Greasy, yummy, yum fatso w cheese"}]}}, {"review": {"des": "One of the best places for late night food any day of the week especially during the weekend.<br><br>Not healthy, but for a cheat meal - it is great. Everything tends to come w/a lot of fries as well (w/exception of Shrimp).<br><br>Highly recommend:<br>Shrimp<br>Smashed Single/Double Fatso Burgers<br>Char Dogs", "pics": null}}, {"review": {"des": "Great spot to grab a hot dog. Service was great with a really nice community feel in the surrounding neighborhood. If I stayed longer in Chicago I would've came back for another round!", "pics": null}}, {"review": {"des": "Nestled between two classic churches in the Ukrainian Village neighborhood, Fatso's Last Stand has spent the last several years catering to diners looking to find salvation between a bun. Formerly known as Phil's Last Stand, Fatso's serves up run-of-the-mill Chicago fare like hot dogs, burgers, fries and shakes. Unlike the others, however, Fatso's has been showing up on numerous \"best of\" lists. Its burger even beat out Au Cheval to finish second in Chicagoist's 2017 Best Burger Award.<br><br>Sitting on a corner at the intersection of Chicago Avenue and North Oakley Boulevard, Fatso's looks unassuming, dare I say underwhelming. The Fatso mascot (a shrimp-riding cross between General Custer and Cap'n Crunch) is prominent throughout from the mural to the menu. On this visit, I'd walked about 30 minutes in 80 degree weather and was looking forward to sitting in an air-conditioned room to enjoy the menu item of my choosing. Upon walking in, I quickly realized that Fatso's is so no-frills that A.C. is not included. I would be parking myself on the patio underneath an umbrella for this meal, dear reader. <br><br>Fatso's offers never-frozen single and double burgers (top them with cheese, bacon, a fried egg, etc.), different varieties of hot dogs (they're char dogs, which is important apparently), shrimp (so the mascot is basically riding his smiling companion to the gas chamber) and sides (fries, tots, mac and cheese, fried pickles). I ordered a single Fatso with cheese and bacon along with a side of tots. The employee behind the counter asked if I wanted Fatso sauce, so I did that too. For those choosing to eat inside (maybe it's a cold day or you're just a big fan or sweat lodges), a long counter runs across the perimeter of the restaurant and a few tables are peppered throughout as well. From my research, Fatso's used to be cash only which would explain the presence of the ATM. I, however, had no problem using plastic.<br><br>The food arrived promptly in Fatso's standard wrapper. I loaded my food, water cup (free refills are available if you go the fountain drink option) and pre-filled ketchup cups onto my tray and headed outside to the patio. My first thought was how much food this was. For $12.00, I had definitely received my money's worth as far as quantity was concerned. The tots were fresh, hot and steamy. Circular and about half a size bigger than regular tots (edible ping pong ball basically), the crispy outside houses a cheesy, starchy inside. Think of it as hush puppy meets loaded backed potato. They're really delicious. The burger was also enjoyable even if the cooks went a little overboard with the Fatso sauce (kind of a mayo aioli hybrid). I noticed the presence of the burger and cheese, but more for their textures than their flavors. The bacon was a collection of thick, quality pieces that was a welcome addition. I would have liked the bun to be a bit thicker. As is often the case with burgers, by the last couple of bites you're futilely trying to keep the burger to bun ratio equal before resorting to bringing out the fork and eating it hamburger steak style. It's a small complaint, but the person who figures out how to solve this will rightly move up to the top of the list for the Nobel Prize.<br><br>I left Fatso's feeling extremely full. The optimistic part of my brain had hoped to save room for a peanut butter shake, but about three quarters of the way through the meal, I knew I'd have better luck convincing my mother to get a Post Malone lower back tattoo. As tasty as it was, I'm not sure I'll be back anytime soon. The heavy meal stayed with me for about the next eight hours, as it felt as if I'd ingested a deep-fried bowling ball. My recommendation for those with average appetites such as myself: just eat half the single, or split a double and fries with a dining partner.<br><br>Food: ***1/2<br>Atmosphere: **<br>Service: ***<br>Overall: ***1/2", "pics": null}}, {"review": {"des": "I lOVE Fatso's! I really do. The employees are kind,they are open late and the burgers and fries are Delicious! But....everything else is just OK. The Shrimp is Nasty,I'm not sure who is buying it,but it's really flavorless. The sauce is great,but I'm not paying those high prices for yummy cocktail sauce.<br><br>The Char dogs are ok,and the hot dog menu seems to be the only thing that's priced right...This is Chicago and there are great hot dog places everywhere,I do like the fact that they are charred.I HATE tasteless boiled/steamed hotdogs,yuck! <br><br>The burgers and fries are great,but I can't get with the outrageous prices. Today we ordered 2 burgers,( 1 single w cheese,1 double w cheese)1/4lb shrimp,and 2 milkshakes. We paid almost $40... I'm NOT kidding! We didn't even have fries!  The 2 Shakes alone were $11-12... for 10-14oz..WTH? Now. I didn't taste the shakes,but my guys said they WERE worth the price. I'm cheap,so I'm not paying $6 for 10-12 oz of anything without booze in it.<br><br>If you're on the fence,don't be- it's great(not the shrimp),but if you are a cheapskate like me you might feel as if you can find better deals(that include leftovers)for the same price.<br><br>And for my West Coast friends... It does remind me of in and out.The fries here are better,the burgers there are better and in and out is waaaaaay cheaper! But,this burger is very similar if you order it the right way.", "pics": null}}, {"review": {"des": "Went with my burger club and I was pleasantly surprised how good it was!  Got a smash burger with bacon and egg.  Yum!  The shakes and fried pickles are recommended as well.  Only downer was the fries were too salty and soggier than I prefer.", "pics": null}}, {"review": {"des": "Ordered the Double Char Dog with Fries. The hot dogs are small, so a double char dog is not too big. This was my first Chicago Hot Dog experience and was definitely interesting. The pickled peppers and mustard gave it a unique taste. I was told not to put ketchup and it had a generous portion of fries. <br><br>I haven't had too many Chicago Hot Dogs to compare to, other than Portillos, but it was pretty solid and would rate it better than average. I enjoy this local shops.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4lfU2Nm4J7UfgDMQhRowFA/348s.jpg", "caption": "Double Char Dog"}]}}, {"review": {"des": "Probably the best hot dog I've ever had...end of story.....................<br><br>Fuckin delicious", "pics": null}}, {"review": {"des": "Best spot for burgers....trying the dogs...sats its charred....well see..got hungry...its late....didnt want bad food this late.....its poppin....loud....good people late......just hungry...lol", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hsqEUO2ZOAZ3NTOeJRl9Vw/348s.jpg", "caption": "Waiting patiently..."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6I2XRuT0N2oyCrtfZ38Jww/168s.jpg", "caption": "That grill is smoking.....yeeeeeeees..."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0AtOaYAdfIAyKMaCoHtKpA/168s.jpg", "caption": "dbl.n fries"}]}}, {"review": {"des": "Not what I expected ordered single fatso with cheese and a kids mac and cheese with char dog on it.<br>Proce $15 way over priced for what seems smaller then a McDonalds cheese burger the sauce on the burger was good but the patty seemed like it was defrosted wile it was cooking just dry and no flavor from the actual patty only flavor I got was the sauce on the burger.<br>Now the mac and cheese tasted chalky and salty definitely not worth $15", "pics": null}}, {"review": {"des": "This is a must do in Chicago . The adult fatso mac n cheese and char dog were delicious . To make matters even better you get a ton of fries to enjoy as well.", "pics": null}}, {"review": {"des": "I understand the need for a customers only bathroom policy....however you'd think there would be some leeway, especially for a female customer to ask the female cashiers to use the bathroom explicitly to change a tampon - during a time when the restaurant is otherwise almost empty. Unbelievably and unnecessarily rude, and not good enough greasy food to justify that type of bad human.", "pics": null}}, {"review": {"des": "Burgers here are delicious.  They are open late which is a plus.  Staff is pretty goofy. Go here for awesomeness late night", "pics": null}}, {"review": {"des": "I ordered the shrimp sandwich that came with fries and it was fantastic! Some places are cheap with giving out alot of shrimp but this place gives you a good amount for what you pay for so if your in the Chicago area stop by you won't regret it!", "pics": null}}, {"review": {"des": "Double fatso with cheese me please but hold the onions and tomatoes! It's just something about this burger besides the greasiness that makes it good!  The man had the Samuel's Double Fatso Extreme which was everything with fried egg and bacon added! I think he is in love! The customer service is friendly and fast!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wzSWuikccmN3klQocNFPHA/348s.jpg", "caption": "Shrimp, Mac and Cheese, Shakes, and fries"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Pq7ut2FMYPKKi8QZLEXWQQ/168s.jpg", "caption": "Hamburgers Grilled or Char Burgers"}]}}, {"review": {"des": "OMG. Where has this been all of my life? This was amazing. We decided to go here after a night at a wedding and bar. Okay, maybe we were not sober when eating this but I can still remember it. The fries were awesome and not burnt. The hot dog was perfectly juicy dressed with onions, mustard, and peppers. This definitely had a kick to it. We ordered for takeout and the hot dog and fries were wrapped together. The bun was soggy, but I imagine it would be better eating there.<br><br>If you don't like spicy, then don't get this. But if you're feeling adventurous, get it.", "pics": null}}, {"review": {"des": "I would say this is a very average place that has pretty good (but not great) food. I would have rated higher but their prices are actually kind of high for what you get!<br><br>I got the double fatso and the char dog and the total was a little over $13. The burger does remind me of In N Out except greasier, less fresh, and about twice as expensive. It wasn't bad but I've had better in Chicago around the same price point. The hot dog was nicely charred but it was tiny! I can see why people are recommending the double char dog. What pushed this to 3 stars were the fries. I really liked them! They aren't crispy and are little bit soft and I couldn't stop eating them. They come with the hot dog so that was a nice addition.<br><br>Overall - not bad but definitely not as good as I was expecting based on the reviews.", "pics": null}}, {"review": {"des": "This is one of the best grease-ball burgers in town. It's incredible. The only thing coming close to their Fatso burger on the menu is the fried shrimp. Eat here and return often. Hangovers are cured by this place.", "pics": null}}, {"review": {"des": "Decent place to grab a bite late at night, and they definitely try to do things a little differently but the food doesn't really set them apart. I had an Ooey Gooey with a fried egg, hot dog, fries, and a strawberry shake. The burger was pretty good, hot dog & fries were fine, but the shake was lacking. Their menu says their shakes are thick and that's the only way a shake should be served. I agree with that, but the one I got was this and runny. I'd give them another shot if I was in the area, but probably avoid the shake next time, $5 is too much for a small runny drink.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bf0fMsMsdSGfhORt8b2hRg/348s.jpg", "caption": "Ooey Gooey"}]}}, {"review": {"des": "On my trip to Chicago, one of my goals on my foodie mission was to find a true, down to earth place to have a Chicago style hot dog. This is the place!<br><br>We came to Fatso's (now called Phil's?) at 11pm on a Friday when we were getting the late night munchies. Driving up, it seemed like this hole in the wall, mom and pop shop with this mural painted on one of their walls. The employees seemed like they were a rambunctious, fun group, which just further adds to the vibe of the place. <br><br>We got an order of the char dog with cheese and the maxwell street polish sausage. I loved the cheesiness that paired great with the char dog, and the little peppers that came with the polish sausage really made it have a bit of a sour/tangy flavor. The fries that come are that kind of soft, not crispy texture that still taste amazing (and they give you a generous portion!). The only thing was that I felt like there was not enough meat in proportion to buns, but I guess that's what the double meat options are for. We'll know for next time for sure!", "pics": null}}, {"review": {"des": "Came here for a late lunch yesterday and it was fantastic. The Taylor st Italian sausage is flavorful and was cooked to perfection (slightly charred on the outside and juicy on the inside). The burger was soooo good and the fries were amazing. <br>But most importantly: the cheese tots are OUT OF THIS WORLD. Do yourself a favor and get these. Probably one of the best things I've tasted - ever. <br>Also, their service is top notch. They're really friendly, quick, and there's an overall good vibe among the staff.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7dtqfIOzwlEd_jDR87yfqQ/348s.jpg", "caption": "Taylor st with fries!!!!!!"}]}}, {"review": {"des": "This place is right in my neighborhood so I love that it's a five minute walk. They have tables in there to eat,inside and out, but I prefer the to go route. The fried shrimp is some of the best I have ever had. Definitely that is a must. They have mild and spicy sauces which I both like. I love their char dogs with fries along with the mac and cheese . They also make this special sandwich which has a polish sausage , a hot dog and mac and cheese together. It's awesome and huge! This place is open late at night, but only accepts cash money.", "pics": null}}, {"review": {"des": "Hi, my name is Monica and I'm addicted to Fatso's. I began this New Year thinking that I was going to get fit and right but I started it off with going to Fatso's 4x already (and counting). <br><br>The quality of their food is really what gets me to keep coming back. I usually go with the single smash with everything on it. I definitely do prefer the smash over fatso even though I don't necessarily understand the difference yet but both delicious. <br><br>You also cannot leave without getting their shakes! Def a must have!", "pics": null}}, {"review": {"des": "Amazing, delicious and tasty burgers! <br>They made the fried egg on my burger to perfection. It's cheaper good food for the price", "pics": null}}, {"review": {"des": "This place is amazing! Read about it on a Bonapettit mag article and gave it a try. Probably the best hot dog I've ever had. Incredibly cheap and delicious. Get the fried pickled chips!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dDuxjWp6qjskuFwycUAFGw/348s.jpg", "caption": "Char dog with fries (fried pickled chips not pictured but fully devoured)."}]}}, {"review": {"des": "I was in the neighborhood, so I decided to stop at Fatso's, this is one of my favorite burger joints. The Fatso sauce is very nice, as usual I ordered the Fatso Cheeseburger with everything which includes this wonderful sauce. This is an excellent burger that is easily consumed without making a mess of yourself, nicely constructed. The French Fries, had they been a little warmer, could have been some of the best I've ever had. They reminded me of the wonderful French Fries at the now defunct Muskie's on Lincoln Avenue. $2.50 for a fountain drink, OUCH!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UKNM6WIJb4U-vo3NdaAXHA/348s.jpg", "caption": "Fatso Burger."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wnVSXoQ_Sp0-cN2qN90DaQ/168s.jpg", "caption": "Fatso Burger."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WKelgYeC4fmG7rWma8vUKw/168s.jpg", "caption": "French Fries."}]}}, {"review": {"des": "Maybe it was just their bad day but this place was nothing special. When you enter you are attacked by the smell of grease, i dont mind that smell but this place had too much of it. I would say this place is good for when you want to grab some food after you had too many drinks, otherwise i would only come back for the fried pickles. We had the mac n cheese with burger, Maxwell Polish sausage with fries and fried pickles. The mac n cheese was nothing special to write about. The Maxwell was ok but the sausage did not taste anything like a Polish sausage and the fries that came with it had wayyyy too much salt on them. It seemed like somone by mistake opened a container of salt on them and it went all over the fries. The fried pickles were pretty good and the sauce that it comes with was pretty good. But thats the only thing i would come back for if i was in the area. <br><br>They have outside area to sit at and some seats inside, but only 2 tables to sit at. They also have a parking lot that is right behind the place, so dont have to worry about paying for street parking.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pRZBz7uMa6QX-tWbksDuJw/168s.jpg", "caption": "Fried pickles"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JLU8CGh46XaqtYJr3F5fdw/168s.jpg", "caption": "Maxwell Polish sausage"}]}}, {"review": {"des": "Best greasy burger in the city! And those cheesy tots! The fries are good too.  Fatso's is always consistent in its awesome flavor. The service is good too!", "pics": null}}, {"review": {"des": "I don't know about this place. I came here because I was craving a burger and fries. I read that on yelp that this place dishes out some yummy food so I figured I would give them a try. I ordered fries and a fatso smash burger. My fries weren't fresh, and just warm which is a pet peeve of mine at fast food places. Fries should always be hot and fresh out the oil. These are the potato skin fries so when they aren't fresh they taste terrible. My burger was very underwhelming. As soon as I took a bite, it was loads of salt on the patty. I watched them season the burger by using a salt shaker and I'm sure the guy was heavy handed with it. Their special sauce was barely on the burger as well so I could tell you what it taste like. Overall speedy service but underwhelming food. There's too many dope burger spots in the city to give them another try. Pass!", "pics": null}}, {"review": {"des": "What a delicious burger!!! I could have eaten two....out of pure gluttony.  The fries were not that great.  They were greasy and soggy.  To be fair, I drove for 13 minutes before I ate them. <br> I'll skip them next time and order a shake instead.  I ordered through Grubhub and my order was ready at the estimated time.  I'll definitely stop by again.", "pics": null}}, {"review": {"des": "The Shrimp Po' Boy... that's the bizz right there. I've been here a few times already, ordered through GrubHub and ready in minutes. Staff is super friendly, there's parking for customers out back. What else do you need? <br><br>But let's get back to the food. Seriously the sweetest and biggest shrimp I've had in a long time. Coming from Los Angeles, shrimp never tasted right to me here in Chicago until Fatso's. $11 gets you a sandwich and fries. Even less if you get a burger. Make sure to have their fried pickles, if you have any room left. <br><br>Order up! You won't regret it.", "pics": null}}, {"review": {"des": "First and foremost lets be honest, their logo is a ripoff of Capn Crunch lol. Besides that Fatso's last stand is a great option for late night grub, its open till 4am! The place is Cash Only, and its pretty small. The outdoor seating is perfect for nice weather. The food is very indulgent, its greasy, fatty, charred, and full of flavor, perfect drunk food! I got the Double fatso smash, it was great. It did remind me a little of In n out, minus the animal sauce of course. Fries are delicious! I have to come back and try some more of the menu!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MfFuW2U2ulgne-X7VcnGPg/168s.jpg", "caption": "Fries!!!"}]}}, {"review": {"des": "My Goodness, I know it's called 'Fatso's Last Stand', but I did not think the contents of this meal would contain so much...fat. Not that it's a problem to me or anything, but damn, my burger and fries made me feel so disgusting on the inside that I could not bare to look at myself afterwards (exaggerating). The food was great though. Burger was medium rare, and the fries were fresh, so I could not ask for more. Wish I bought myself a shake but my heart was screaming mercy at that point.", "pics": null}}, {"review": {"des": "Such a great late night greasy spoon that hits all the spots! I needed a burger fix and have passed by numerous times but the name always made me feel like I was adding lbs without even eating there so never stopped but my cravings took over and I made my move! I had the double burger and fries, while the burger wasn't overly huge it was super juicy, messy and f'n deeelish! The fries were the perfect crispy and salty combo they were very similar to al's beef fries which are my fave.  I will definitely be back when the next craving strikes!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iyfoFHg5Mi0NAP0pYdbsvA/348s.jpg", "caption": "Double burgerliciousness with cheese!"}]}}, {"review": {"des": "A Absolute Hidden Gem In Chicagoland.A Supreme Contender For Best Hot Dog And Best Burger In Chicago.Shrimp Is Awesome Here Too.Great Staff And Cooks.Parking Was Non Issue With Lot Provided And The Burgers Are Grilled Not Fried On Flat Grill. I Will Definetly Be Back.", "pics": null}}, {"review": {"des": "YES, just yes! Chicago dogs at their finest. A charred hot dog on a seeded bun with mustard, relish, onions, tomatoes, sport peppers, and celery salt served with fries for only $4.75, what more could you ask for! The hotdog is charred on the grill, bringing out that extra savory flavor (not that gross watery steamed sausage flavor). So good! They also serve other types of hot dogs and sausages, burgers, fried shrimp, mac n' cheese, and a variety of fried side dishes. Definitely not a place to visit if you're on a diet (you could have probably guessed that based on the name of the place). Everything is pretty inexpensive and the portions are big, so you're not leaving here hungry!", "pics": null}}, {"review": {"des": "I had a nice buzz after leaving a Macallan tasting in West Loop and then a party @ Mr Brown's Lounge across the street from this joint. I was definitely craving a burger so this was perfect! <br>This place is basically a small greasy spoon that has an outdoor seating area which is good for those warm nights. I walked in and the grill was going as there were a few people inside. The smell was definitely singing to my nose as I ordered a single fatso burger with everything on it. I got it to go as I ready to head home so I enjoyed my delicious burger while walking to the blue line. Burger was cooked and seasoned to perfection...I will definitely come back here.", "pics": null}}, {"review": {"des": "Fatso's is still crushing it in all it's grillifying glory. The aroma of the chargrill hitting Chicago Ave will lead you here not un like the pide piper himself. The char dog is the best in all Chicago and the fries are right up there too.", "pics": null}}, {"review": {"des": "5 stars just for the cheese fries!! A must get! Cute little place with some good combo deals.", "pics": null}}, {"review": {"des": "Some of the best hotdogs and burgers in Chicago!  Not only is the beef good but their veggie dogs are amazing! To top it off they have great customer service! You won't be disappointed!", "pics": null}}, {"review": {"des": "It was my last day in Chicago & before I left I wanted a authentic Chicago dog. I got exactly that at Fatsos. Grilled and packed with flavor", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ugu4uAlV4N5KPDFQbmgdWg/348s.jpg", "caption": "It was my last day in Chicago & before I left I wanted a authentic Chicago dog. I got exactly that at Fatsos. Grilled and packed with flavor"}]}}, {"review": {"des": "Simple but effective. If you want a simple, greasy cheeseburger with some amazing sauce- this us your place! Cheap, fast, but packs the flavor of a gourmet burger. Also there's free parking in the city! Can't beat that. The fries are amazing too...definitely coming back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UeSRMO9IuLz3H2DBNTzBKA/348s.jpg", "caption": "I'll be dreaming of this. But good news is I can wake up, and drive here in the middle of the night since they're open till 4am"}]}}, {"review": {"des": "Goes we came here twice and both times we had a amazing time. Well our Bellies were so satisfied. <br><br>First time Jack and the crew helped us. We asked Jack what was good. Since it was our first time. He said the \"Char dog\" which he ordered for us. But I had to try the burger since the pictures looks so good. Both the char dog and burger was so so so good. And the fries I love how crispy it was. I love crispy fries. We also got the Mac & cheese hot dog. It was gold but we had so much food. I tell you all the food is delish here. Even when we went the second time and Jack wasn't there the other crew was awesome. Richard and Lily amazing friendly crew. They took care of us. They told us to try the cheesy tots. OMG I wish I didn't eat before going there.  It was still good cold. They also told us to try the Po'Boy with fries. Wow so different and so delish. I can't believe I'm thinking of it right now. How that cheesy tots. I want some now. <br><br>The staff was so friendly and amazing. Jack and his crew and Richard and Lily with their crew. And I love great service with my food. It makes it taste better. <br><br>So if you are in Chicago near Fatso burger stand make time to stop by. You will love it!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wb4J_yax4Dka6hPIJ1hm6A/348s.jpg", "caption": "Po'boy shrimp. Wow fries on top.. 8/23/2016"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KoCW2394dBSNAkHrx09QVQ/168s.jpg", "caption": "Po'boy shrimp. Wow fries on top.. 8/23/2016"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zwzlBoI1zcSIqiRoWmyMZg/168s.jpg", "caption": "Po'boy shrimp. Wow fries on top.. 8/23/2016"}]}}, {"review": {"des": "I used to really love this place...Tasty fresh fast food at a reasonable price.<br>HOWEVER, noticed on my last visit that they are now charging an additional .25 cents on take out orders. WTF? You'd think it would be less since I'm not eating in and making a mess or taking up space. And if they're looking to charge for the paper bag my to-go food comes in, wouldn't that just be 7 cents? This new additional take out charge just feels like a scam. They should just raise the overall prices if they need additional income. I will definitely look for another local place to cure my greasy cravings. Heads up!", "pics": null}}, {"review": {"des": "Fatsos Last Stand, in Chicago west of the Loop, is retro and haute cuisine at the same time. Conceived as a neighborhood hot dog stand, the original owner was committed to delivering the best of class food possible.<br><br>And he achieved it, with  tasty burgers, Chicago style hot dogs, and fried shrimp (another Chicago staple).<br><br>I went with the \"single Fatso with cheese\" and my friend had a Chicago style dog; both were cooked on a grill that imparted a nice char flavor and texture which will improve any food.<br><br>Fresh cut fries were the order of the day, only because I didn't notice that they had cheese tots on the menu. DARN!<br><br>A lot of people compare this burger to In N Out, but I personally feel Fatso's is a much better burger.  Shakes are also on offer.<br><br>Exceptional food all around, fun experience. Take the kids.<br><br>Fatso's is in an area of town called \"Ukrainian Village,\" so there is a plethora of Russia restaurants, groceries and cathedrals.  It makes for an interesting urban adventure, walking around, checking out the shops until your appetite (or the charcoal grill aroma) pulls you in to Fatsos. (Easily accessible by mass transit, Damen or Division stops on the CTA Blue Line).", "pics": null}}, {"review": {"des": "There is no better place to get a burger in the summer than Fatso's. Whether you are hungover, inebriated, or just trying to smash a single smash with everything on it, Fatso's will always be there. <br><br>In all seriousness, it's the closest thing you can get to In-N-Out west of California. Dare I say that it's better?", "pics": null}}, {"review": {"des": "Best burgers in town! I'm always searching for a good burger and gotta say this is the spot! I have not had Au Cheval yet but if Small Cheval is supposed to be the same it still is no match to these burgers. I saw that they were voted #1 on Time Out magazine so had to try it out. I wasn't disappointed! Will definitely keep coming back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2oHzgDuU1mRqBqoLH79fDA/168s.jpg", "caption": "Their extreme double. Best burger. You better come with an appetite."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/r7WsPTohgtjNWgIQRihNTA/168s.jpg", "caption": "Single smash burger"}]}}, {"review": {"des": "Nice place but employees so rude, they didn't let me park there, i try to explain what I'm the customer and going inside, but guy didn't speak English, and I have to leave.", "pics": null}}, {"review": {"des": "Instant favorite! We got char dogs and fries with homemade cheesy tater tots and it was a meal to remember. Fast service and the prices are more than fair. I ate here with my boyfriend on a whim during our Chicago trip a few months back and we've been raving about it ever since. You need their Chicago dogs in your life, trust me on this.", "pics": null}}, {"review": {"des": "We're from NY and what was once our favorite spot in Chicago quickly became the biggest nuisance ever. Over a half hour wait for a super ooey gooey and a char dog? C'mon! When we finally got our food, it was delicious; however, not worth the wait.", "pics": null}}, {"review": {"des": "Burgers and polish were good. Fries were burnt, old, and cold. They could do better. 2.5 stars is what I want to give. It has a parking lot. So, I'll give it three.  The fries were a negative one. So, two stars balances it out.", "pics": null}}, {"review": {"des": "We have now been here twice and would probably go all the time if we lived in the area. The first time we went, we had gone to a bar with overly pricey food and no, we didn't want to get oysters for more than what they were worth. Second time, we went out for pizza with friends. Friends that got full after 1-2 slices of pizza, so we of course had to come here later on in the night. The mac & cheese is a healthy portion, super generous for $8. Hotdog was excellent as well and fries are homemade fresh. Service is pretty quick and friendly. Tons of tables outside for outdoor dining. Definitely a casual place, but definitely a place to go while in the neighborhood.", "pics": null}}, {"review": {"des": "Oh my god what a fucking cluster fuck this place is they can't get an order right and they send you off with the wrong person's food and then Yell at you! Stay away", "pics": null}}, {"review": {"des": "How can a place called Fatso's Last Stand not get 5 stars?! Ha!<br><br>My husband, friends, and I came in fairly late on a Tuesday night and we were starving. The moment you walk in, you get a whiff of the greasy yumminess that is Fatso's! It was difficult to look at the menu and only pick a couple of items, we didn't want to consume a ridiculous amount of food so late at night! Haha! <br><br>Their burgers are served either the regular way or smashed. The smashed is pretty much the patty is smashed onto the grill and it served so the edges are crispy. The moment I heard that, that's what I wanted! I got the single with cheese. We also ordered a hot dog, fries, fried pickles, and the cheesy tots! <br><br>The people working were super nice and our food came out pretty quickly! Everything was delish. The burger was cooked well, flavored perfectly, and had the perfect proportion of toppings to meat to bun. Loved it! The fries were fresh cut fries...always love that! And the cheese tots were so yummy. It isn't what I was expecting, but super yummy! I was expecting cheese on my tots. These tots were infused with cheese and you could taste a mixture of herbs, tasty. They kind of tasted like a potato pancake to me! <br><br>The venue is small. There are only 2 tables and a handful of stools for window seating. They do have outdoor seating which is nice for the summer.<br><br>I wish this place was closer to me because they deliver...what?! That would be dangerous for my waistline! I can't wait to go back for another burger, to try their mac n cheese, and grab a shake!!! I can't wait!", "pics": null}}, {"review": {"des": "Burnt fries and horrible burger and the hotdog tasted like rubber. I probably could have gotten better at a gas station", "pics": null}}, {"review": {"des": "Keva has the best customer service in this place . I just came from LA and she agreed in what I want and comprehended in the chocolate milkshake. This is the best place to come after a bad or club hands down. Ask for keva she's the best", "pics": null}}, {"review": {"des": "Fatso's char dog & fries are my jam! <br>They're really friendly here, customer service on par! <br>Try the Po boy, shrimp is perfect!", "pics": null}}, {"review": {"des": "The cheeseburger I had from there actually ain't too bad.<br><br>However, The \"Tater Tots\" were far from edible.<br><br>These tasted like dough based treats which somehow is inconsistent with the usual standards.", "pics": null}}, {"review": {"des": "This place keeps it simple and good. Fresh is best and you can tell that is what they are targeting for. The place is very small and busy so be prepared to wait but it's worth it.", "pics": null}}, {"review": {"des": "FUEGOOOOOOOOOOOOOOOOOOOOOO!!!<br><br>Hot damn, is this place good. I came to Fatso's last night with the munchies and left blown away (see what I did there lol). I had the following items...<br><br>Double Fatso SMASH Burger w/ chedda - grilled onions / added poached egg and beacon: Holy shit! Somewhere an angel is losing their wings with every bite you take, it's that good. The Fatso sauce went well with the burger too. The burger was so good it required no other sauce. Served a little pink how I like it. Respect. 5/5<br><br>Pro Tip: Don't leave w/o trying the SMASH burger!!<br><br>Char Dog: The Char Dog was good but it's not for me. When I think of a Chicago dog all I care about is that lovely snap when you bite into a juicy Vienna beef dog. The Char dog has no snap and because it's char/cut in splits, the hot dog comes out dry. The ingredients were superb, the Char dog just isn't my style. 3/5<br><br>Fries: A grade mutha' fucking fries. I don't know how they season them or what but those fries are delicious. Clearly fresh cut. No ketchup needed. 4.25/5<br><br>I got all the food mentioned above for 15$. That's what I call a steal. This is gourmet fast food bby, at it's finest! Def. coming back to try those cheesy tots I missed out on. The setting is lovely as well with a big outside patio they have on the side of the restaurant. Nice little spot for those summer nights. Don't miss out!", "pics": null}}, {"review": {"des": "Great late night eating spot. Small joint but cozy and friendly. Staff is helpful and patient with the drunks on the weekend. Burgers, fries, sausages, and hot dogs are all grilled to perfection. Greasy goodness and comfort food all around. Even eating it sober is good", "pics": null}}, {"review": {"des": "This place has been one of my bookmarks for quite sometime. Me my husband and our son finally made it. The employees were very help and courteous. They were taking idea and making food in a timely manner. They played some of the best music that my husband and I listened to when we were growing up. The food was AWESOME it was definitely worth the wait. I will come back if we are in the neighborhood and I will DEFINITELY recommend this place.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mYgva7YvGpDFbM39d0OUjg/348s.jpg", "caption": "Char dog."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ERpdN0jQipGDbJPp-liNsw/168s.jpg", "caption": "Bacon cheese burger well dine. Awesome"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3jMOoNzPpyOTzB6aBSTR6A/168s.jpg", "caption": "Basket of hand cut fries. Very good"}]}}, {"review": {"des": "Awesome spot for a cheap yet delicious meal! I have only been once (after a blackhawks game) and got the fatso smash burger with cheddar and grilled onions...I LOVE the cheese they use here! This place is no frills and the food is greasy, so if you are in the mood for that GO! you wont be disappointed! I wanted to order a shake because the flavors looked good..but 5$ is a little steep to pay for a milkshake in my opinion. <br><br>pro tim: If you are at the United Center and can hold out on having food...come here after. its the move...superior food for 1/3 the price", "pics": null}}, {"review": {"des": "Came here before heading to the United Centre for the Bulls game on my trip to Chicago. Personally I wouldn't come back. I ordered the double char cheddar hot dog. It bascially came with two sausages under a generous serving of toppings (tomatoes, pickles, peppers, onions etc...) Fries were pretty soggy and the restaurant wasn't comfortable to sit in. It's a cheap eat so I wouldn't complain about that but it just isn't a \"must visit\" in Chicago for me. I don't think I'll be back next time I'm in town but it's worth a try if you're nearby locking for a cheap greasy eat.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5-5L8iAGUQb3l1Dxp-EmVA/348s.jpg", "caption": "Double char cheddar hot dog"}]}}, {"review": {"des": "Really really good smash burgers, mac n cheese was amazing and the tater tots were way better than I could have imagined they were fancy little deep fried potato balls with cheese and chives. The staff was friendly and fast and packaged the to go order nicely. Definitely will go back.", "pics": null}}, {"review": {"des": "TOURISTS: Downtown and Navy Pier have the best hotdogs and deep dish pizza- go there! Stay there! Stay far, far away. <br><br>CHICAGOANS: ...Are they gone? Good! Now you can enjoy one of the best food joints in Chitown. A modest and inviting shack with juicy burgers either charbroiled or smashed with fresh toppings and the infamous Fatso Sauce. Out of the two I prefer the charbroiled but was sneaking bites of my boyfriends smashed burger before it was gone!<br><br>GET THE TOTS. They are more like balls of mashed potato and cheese-delicious!!! Service is so friendly and classically down to earth Chicago. Great burger whether for dinner or a late night munchies mission.", "pics": null}}]}