{"name": "firecakes-donuts-chicago-4", "reviews": [{"review": {"des": "DONUT ICE CREAM SANDWICHES!!!! I have a major sweet tooth and walked 25 minutes in 30° weather just to get a taste. I was also holding in a major poo so you know this is worth it!!! The bf has less of a sweet tooth and thought the original was a bit too sweet but he handles me pretty well so I don't know what he's complaining about. Thank god I don't live in Chicago or else I'd be blowing $7 on this everyday. <br><br>Psst some extra stuff: the actual store is teeny and there is no seating inside. When we went, there was also only one person working so it tends to take quite a bit even if there are only a few people ahead!", "pics": null}}, {"review": {"des": "I have had Firecakes Donuts once before this recent visit and I was blown away by their variety.  They are one of those gourmet donut shops with fancy varieties to choose from.  This particular location is small and has a limited variety.  I went here late on a Sunday night I believe it was.  They had a decent variety but not like what I have had before.  Some of the stuff is seasonal as well.  I forget the various kinds they had available that night but I chose to buy their Apple Cider kind because that's what my wife wanted to try and my son had like an Apple Cider kind from elsewhere before.<br><br>They are on the pricey side just like the other shops such as Stan's and so on.  I don't frequent such donut shops but once in a while I'll crave the gourmet, fancy kind of donuts.  They are good and worth checking out.", "pics": null}}, {"review": {"des": "Let's talk about the old fashion donut!! I can't get enough of it!  It is a must! <br><br>Now that I'm dreaming of this donut let me also speak of the rest. This cute donut shop was definitely a highlight for me in Chicago. The people behind the counter were so friendly. I really enjoyed talking to them. <br><br>Now let me just say I loved all the donuts I tried. A must is of course he above mentioned old fashion. Also the churro ice cream sandwich was a really nice treat, regardless of the cold weather. Ohhhhh and the vanilla frosted donut was mind blowingly good!!! <br><br>Now they may not have a thousand different types of donuts, but what they do have is done right! I saw a pistachio old fashion that I will have to try next time I am out there.  <br><br>Their prices are reasonable and average for gourmet donuts. <br><br>Taking a box back to Miami was definitely a great call on my part. Next time I'm bringing back more!", "pics": null}}, {"review": {"des": "Firecakes is an amazing donut shop. When I visited Chicago I stopped by this place two days in a row. The donuts are massive so you could always share with someone. I tried the valrhona chocolate iced and the Tahitian vanilla iced. I'm usually a chocolate person but the vanilla donut is out of this world! The shop is tiny so only a few customers can fit at one time. The service was great. I wish the donuts were just a bit cheaper.", "pics": null}}, {"review": {"des": "I am a HUGE donut girl and the sheer variety that they have is wonderful. Their donuts are very delicious. The chocolate glazed cake donut is my fave. I even grabbed a dozen for a work meeting to be nice to my coworkers. They are swift, I was in and out. Honestly the longest part was trying to decide what kind of donut I wanted to buy.", "pics": null}}, {"review": {"des": "I came here to get a \"birthday donut\" for my boyfriend (regular cakes just aren't as fun right?) and it was extremely difficult to walk out of there without ordering an additional dozen or an ice cream sandwich.  The selection is incredible and the man behind the counter was a delight to talk to.  I ordered the birthday donut online and scheduled a pick up, it was so easy! and of course it tasted doughy and delicious. The blend of textures created an amazing dessert.  Next time I'll cave and buy more items for myself.  Who says you need a birthday to buy the birthday donut?!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ri5EqOOr6LJpVGwzTN1KfQ/348s.jpg", "caption": "how beautiful is this birthday donut?!"}]}}, {"review": {"des": "So Many delicious yummy options to choose.<br><br>The inside space is small but they have an outside patio for you to enjoy your treats. I was undecided of which flavor to pick so I went with the <br>Blueberry Lemon Cake. It was very soft and moist inside and the mixture of blueberry & lemon topped it off.<br><br>I will be coming back and trying the donut ice cream sandwich.", "pics": null}}, {"review": {"des": "Sadly was disappointed by this place.<br>Came by on a Sunday Afternoon and as a warning this shop is tiny!! Almost not enough room just for people standing in line to buy donuts. Definitely not a place you can hang out in.<br>We tried the espresso cream filled mini chocolate donut and the pistachio cake donut. The mini donut was a light doughy donut but the filling and topping were nothing remarkable. The pistachio cake donut was also rather flavorless. I had gone to do rite donuts just a few days prior and was blown away, so in comparison Firecakes didn't really meet the standard. In the future, don't think I'd come back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Zne51SBwgnExfdzFdpSZ8A/168s.jpg", "caption": "Pistachio donut"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3yaNCKxFCMtpC37Fk_m94A/168s.jpg", "caption": "Mini espresso cream filled chocolate iced donut"}]}}, {"review": {"des": "So it seems like donut places are pretty popular in Chicago so I had to try this place because it looked really good! So the shop itself is really small and they have a seating area on the outside. I came later on in the day so I think most of their popular donuts sold out already. I ended up getting their churro donut and their mini peanut butter cup donut. I really enjoyed both! They were really cakey and thick and I thought all their mini donuts were really cute. I'd definitely recommend this cute little donut shop if you're in the area! I walked here from 360 Chicago and it wasn't a far walk at all! So pass by and grab some donuts!", "pics": null}}, {"review": {"des": "We were trying to kill some time while waiting to head to the airport to catch a flight.  We wanted to pick up as much food as we could to take home with us back to Buffalo.  In Buffalo, we have this place called Paula's Donuts and they serve donuts that are literally the size of your head.  We were hoping to check out a specialty donut shop in Chicago.<br><br>Firecakes is a tiny storefront.  The line extended out the door, which was kinda crummy being that it is winter and all.  At 6:30 pm, they didn't have much of a selection left, but we were still able to try quite a few.  We grabbed a peanut butter chocolate, double chocolate, orange cranberry, and pumpkin pie.  We brought them home with us and ate them the next day - still fresh!  My husband loved the peanut butter chocolate and I couldn't stop raving about the orange cranberry.  It was so light and refreshing! <br><br>When we were in the shop, I ordered a matcha latte to go.  I was happy to see they had dairy free options and use real powdered matcha.  I was feeling pretty under the weather, but the drink definitely hit the spot. <br><br>I'm not sure how this place compares to other donut shops in the Chicago area, but I'd say it was pretty darn good!  If we're ever back for a special occasion, we'll be back for the giant cake donut.", "pics": null}}, {"review": {"des": "Donut get me wrong. I liked this spot.  Quite a bit, actually.  But it reminded me somewhat of a pimped out Dunkin'.  Not that there's anything wrong with that:<br><br>So yeah... Stopped here with hubby and kid since it was conveniently located near our hotel, and we were in need of the morning sustenance that only sweet fried dough could provide. We decided to share a few different minis v. regular sized Donuts.  Went with Peanut Butter Cup, Strawberry Mascarpone, Malted Milk Ball and Chocolate-Espresso.  The first two were especially lovely in terms of tasting really true to their flavors.  I was less into the last two, but they were still enjoyable.<br><br>This particular location is tiny, offering minimal sidewalk seating for nice weather days.  <br><br>Bottom line:  I was ultimately more enamored by Doughnut Vault, which has an old-fashioned charm to it that just spoke to me.  But I'd be quite happy to return here again.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sMAvGkWaaGhiCafTH27lzA/348s.jpg", "caption": "Mom, I'm not doing it.  And you can't Mocha me!"}]}}, {"review": {"des": "Not my favorite doughnut, but still very good. I really like their valrhona chocolate glaze they use. It's dark, rich and velvety. This time around I tried their donut sandwich. I chose the honey glazed (they were out of churro) with tahitian vanilla bean ice cream and dark chocolate shavings. The ice cream is more icy than creamy which made the whole sandwich, surprisingly, not as heavy as I expected it to be. <br><br>I like how they have late hours, so it's perfect to stop by for dessert when you are in River North.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cWFCrBqPiIDsuy5ad3vScg/348s.jpg", "caption": "Honey glazed donut sandwich with Tahitian vanilla ice cream and dark chocolate shavings"}]}}, {"review": {"des": "Ahhhh donuts how can you go wrong right?  Well I've seen plenty that are mediocre as heck.  This bakery is not one of those places though.  They are absolutely delicious. The first thing I have to point out is that they are open super late.  That alone makes me love them.  We went out to dinner and really wanted to have a sweets night cap.  We were bummed that it was probably too late, but the heroes at this bakery came to the rescue. <br><br>They have a rather large selection of delicious donuts you can pick from.  You got your somewhat standard honey glaze, but then you get super unique and delicious flavors like malted milk ball and creme brûlée!   They also have all kinds of chocolate style donuts and creme filled as well.  Rumor has it that you can even get your self a donut ice cream sandwich.  We were not bold enough to go down that road though.  I highly recommend coming here ASAP!", "pics": null}}, {"review": {"des": "We arrived around 11:00 am on a weekday. There was an abundance of donuts and for the most part and they offered two size options. A little bigger than a donut hole and about twice the size of a regular donut. The larger donut hole sizes mostly had a filling so if you wanted to try 2 different flavors of the larger donuts, you'd better be hungry. I had a small creme brûlée and a large vanilla icing. Both were good and the vanilla balls on the large one were like little bursts of sugar. Pretty cool at first but as this was my second donut, it became a little too overwhelming. I think my mind is getting another sugar rush writing about it. <br><br>Decent options. Donuts seemed a little less fresh than I expected. We walked about a third of a mile to get here as I always appreciate a local shop.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gmLvPO7mdbj8BkJEGHNSPw/168s.jpg", "caption": "Vanilla Iced"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pTmo6HRqD0kd1y9khjpiMA/168s.jpg", "caption": "The selections today"}]}}, {"review": {"des": "Wow! This place is awesome! Some of the donuts are huge and all delicious. Super friendly staff. Verty small inside and the pace can get busy with lines but worth it. <br><br>Had an Ice Cream Donut Sandwich - Cinnamon churro donut with tahitian vanilla and hot fudge....Are you kidding me? Delicious!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uv0vdFi-IEjRUFXVjKCzLw/168s.jpg", "caption": "Churro donut ice cream sandwich! Oh yeah...."}]}}, {"review": {"des": "I haven't returned to this location in so long that I was surprised when I saw I only gave it 3 stars. While, I stand by my last review I definitely had a better experience this time. I came with 3 friends and we all got different donuts! Between the 4 of us we got the old fashioned, vanilla iced, chili lime mango, creme brulee, and lemon blueberry. My friend who got the old fashioned said it is definitely one of the best she's ever had. The vanilla iced wasn't too special to me. The lemon blueberry was scrumptious. Creme brulee, always good as usual. This was my first time trying the chili lime mango. It leaned more on the lime mango side. The chili in the title is honestly just the tajin powder that is sprinkled on top. The lime mango icing is on point though! We went when there weren't as many people there so we had time to ask the employee about suggestions, favorites, and the different flavors!<br><br>The donuts here are more fluffy, so if you like dense donuts you might not enjoy it as much. While I still do wish that they had a bigger sitting area, they still have their patio seating out right now! Not sure if it's out all winter.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Kn-07bSv7Eic2ZTW8Lq27Q/348s.jpg", "caption": "Old fashioned, vanilla iced, chili lime mango, lemon blueberry, and creme brulee"}]}}, {"review": {"des": "Firecakes has the honor of being the fist donut place I have been to in the city. My boyfriend and I walked over on Sunday morning. <br><br>We got a half dozen and two coffees. I thoroughly enjoyed every single donut we got especially the  pistachio one was very good. Even the more regular donut on the menu was delicious.  <br><br>The regular drip coffee was sooo good for just regular coffee, not to hot, not too bitter, just a good cup of coffee.", "pics": null}}, {"review": {"des": "I think it is safe to say firecakes makes the absolute best donuts in Chicago...maybe in the country. I am blessed w a Firecakes Donut truck on my street every weekend. It's impossible to walk by without grabbing a sweet treat. I have tried the vanilla glazed, triple chocolate, and maple bacon donuts -- all of which were fantastic. The donuts are unbelievably soft and moist. They basically melt in your mouth. They have some fun, unique flavors and I bet anything you try you'll love!", "pics": null}}, {"review": {"des": "After trying probably close to all the donut shops in Chicago, this place takes the cake. I was more impressed with their donuts than any of the other ones I tried. This place is worth the trip. Check it out!", "pics": null}}, {"review": {"des": "I am here solely to tell you that you must try the apple jelly donut and peanut butter cup donuts. I'm sure they have other great ones but you won't have any regrets if you go just for these.", "pics": null}}, {"review": {"des": "Firecakes Donuts. You were fireee. Desserts are my weakness! The girl who helped me was super sweet, she recommended the two most popular donuts. The vanilla bean glazed donut and the pistachio cronut... and omg... they were both delicious. Definitely would come back to try all of their other sweets.<br>The ice cream sandwich was tasty as well. The ice cream was laid like a piece of thin brick, drizzled with chocolate to fit the rectangle shaped donut. Very compact and mobile for on the go!", "pics": null}}, {"review": {"des": "If you've seen the reviews then you know this is a super popular donut shop. And it certainly should be. Probably the best one in the city.<br><br>They have new flavors all the time as well classics always on hand. Quality is superb. No matter what you choose you're guaranteed a giant delicious donut.  <br><br>You must try the old fashioned donut. I don't care if you have your eyes on something else. Your first time here requires that you try their old fashioned donut. <br><br>I find it best to swing by Firecakes every now and then when I'm down in the city. They're constantly trying out new flavors so almost every time you're going to find something new and exciting.<br><br>Only reason I'm taking one star off is the lack of space. The shop is kinda like a hole in the wall type place. I'd say only about four people can fit inside at a time. Yeah, there are times where there's a line just to get in the door. And once you have your donut you then have to find a place to sit and enjoy it. Or eat while walking I suppose. <br><br>But if you're a donut fan then this place is highly highly recommended.", "pics": null}}, {"review": {"des": "Amazing donuts I'm just here visiting and walked out of the bar and got lost and found this place.  Don't go in drunk you'll want to have one of everything.  I'll be going back again.  The staff is great.   Thanks", "pics": null}}, {"review": {"des": "Honestly I was a bit disappointed. They didn't have vanilla ice-cream when we went and only had chocolate left. That's not the reason I give them 3 stars. The flavors in the donut were not amazing. It tasted like a very average donut and good ice-cream inside of it. It was more like bread and not soft donuts so that was my biggest disappointment especially after reading the reviews.<br><br>Overall, a decent donut place with a great concept. I will come back here if I'm craving ice-cream with donuts but for just a donut; I'll for sure go elsewhere.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PxiuzgAqcrwE2XTMKBdSgA/348s.jpg", "caption": "Chocolate Ice Cream Donut Sandwich with white Chocolate bits"}]}}, {"review": {"des": "Firecakes is probably the best donut shop I've been to, and I'm not even the hugest fan of donuts so that probably isn't saying too much, but it was also my boyfriend's favorite dessert/sweet item of our entire Chicago trip. It's a tiny little shop with a few tables outside so be prepared to grab and go, or sit outside if you're lucky. They even do ice cream sandwiches or cakes here! <br><br>The donut case is so pretty and you just want to order one (or two) of EVERYTHING! We limited ourselves to one donut each...matcha tea donut for me, creme brûlée donut for him. The matcha tea donut was really light and fluffy! Downside was most of the icing came off on the paper they use to grab the donut, which explains my lousy photo. The creme brûlée donut was probably my favorite of the two. It had a crunchy sweet outer sugar layer, and the cream inside was to die for. It was quite literally the donut version of creme brûlée...well executed!", "pics": null}}, {"review": {"des": "amazing to say the least.<br>the service was superb i wish i would have gotten the girls nae behind the counter so i could shout her out<br>this was a bookmarked spot for me while i was in Chicago and i'm so glad i made it<br>everything was super fresh and delicious!", "pics": null}}, {"review": {"des": "I must say I am very disappointed in our donut purchase here. After seeing all the reviews, we decided to check it out. We got the malted milk ball ($1), chocolate and expresso cream ($2.50), matcha iced ($3), and pistachio ($3). <br><br>Out of the 4 donuts we got, only the malted milk ball was good. The malted milk ball was creamy and milky with an ooze of custard. The chocolate espresso was alright...probably the second best. It tasted more like chocolate donut with some espresso bean bits on top. The matcha iced was so soft! It didn't even feel like it was thoroughly cooked. It also had a sour taste to it...kind of like a cheese flavor. And lastly, the pistachio...it was not what I expected. I was very confused with the taste. It just tasted like sugar with green food coloring and pistachio crumbs. I took one bite and tossed it. We actually tossed all of them away except the milk ball. <br><br>$10 for 3 whole donuts and 1 donut ball, it was definitely quite pricey. Not impressed.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ouC9mlA4RCMXbjahgfqMjQ/348s.jpg", "caption": "pistachio...was not good"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Hq2VZyS60_eh91vI4X2jzw/168s.jpg", "caption": "matcha iced...was not good"}]}}, {"review": {"des": "If you love Dunkin Donuts, then this is the place for you. These don't taste very good to me, perhaps they taste better to the people getting out of clubs. <br><br>The service was excellent. But after trying several donuts, we were left disappointed and sad that we are them.", "pics": null}}, {"review": {"des": "Saturday night and this shoppe stays open late to accommodate the masses. Small line that allowed us to browse the options before placing our order.<br><br>Between two people split the Jelly Filled Doughnut ($3) and Chocolate Iced ($2ish). The Jelly is your classic fare - sugary exterior, fluffy interior, and a sweet hit of jelly at the center. Wish there was more filling but I'm being gluttonous. The chocolate option had an okay frosting on top of the fluffy cake base. <br><br>Lots of stuff to try here, including ice cream sandwiches that I didn't have the stomach for.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/34Lkne6kW053N0Nvu9sivA/168s.jpg", "caption": "Some flavors"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/R3P4DYNyjy0X90VSE-TgLg/168s.jpg", "caption": "Jelly donut"}]}}, {"review": {"des": "During a visit to Chicago we decided to treat ourselves to some donuts.<br><br>Firecakes is a pretty small space, there is no inside seating but there are a few tables outside on the sidewalk. Luckily when we got there there was no line and plenty of tables available. <br><br>We were greeted by two employees and they were both extremely friendly! We asked for recommendations as it was our first time and they mentioned the vanilla donut was a customer favorite and had won several awards in Chicago, so of course we had to try it. We also got a cake donut that seemed to be a lemon & possibly blueberry donut. Without a doubt, the vanilla was the better of the two and I was surprised that it wasn't overwhelmingly sweet either! Usually anything vanilla flavored is a bit too sweet for me, but this was perfect. <br><br>We had a great visit to Firecakes and would definitely recommend.", "pics": null}}, {"review": {"des": "MEH! My fellow yelpers totally failed me on this one!<br><br>Before my Chicago trip I was looking for a donut shop close to my hotel so I can grab something sweet before starting my day. I came across Firecakes on Yelp and saw that the pictures and reviews look promising. So my first cold morning in Chitown, I walked to Firecakes and almost missed it because I didn't notice the sign and the shop is quite small. I was only planning to get 2 donuts max but they had smaller mini ones so I ended up ordering six, one of pistachio old fashion, pineapple bacon, lemon Meyers, espresso chocolate and peanut buttercup. Then I walked back to my hotel to eat the donuts and get ready for work.<br><br>Like usual, I took a bite of each donut to see which one I like more but EVERYTHING WAS UBER SWEET! But the old fashion pistachio was the worst. All I tasted was the sugary glaze and the donut itself was not light nor fluffy either. So I closed my box of barely eaten donuts and toss that in the trash can. What a waste of $15! <br><br>If super sweet dense donuts is your thing, then I recommend this place.", "pics": null}}, {"review": {"des": "Very delicious and inexpensive doughnuts. All of the ingredients are super fresh and the late night hours are perfect for an after dinner treat. We tried the eggnog and espresso chocolate mini doughnuts, and the raspberry jelly doughnut which was made with real fresh raspberries! Super tasty place! Will recommend!", "pics": null}}, {"review": {"des": "The donuts here look pretty amazing, and I'd wager that most of them are delicious, but I think I chose poorly and ended up with a mediocre one.<br><br>They all looked so good that I was having trouble making a choice, so at the cashier's recommendation, I ended up ordering one of their Pistachio Old Fashioned donuts.  Not sure why they called it a \"Pistachio\" Old Fashioned, as I couldn't taste any pistachio flavor whatsoever, and the donut itself was pretty dry and cakey.  I ended up eating only half of it before throwing it away, and I pretty much NEVER waste food, especially when it comes to dessert.<br><br>OVERALL: 3/5.  Despite my disappointing experience, I'd be willing to try them again.  I'm pretty sure I just chose the wrong donut, hence the 3/5 rating instead of 2/5.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ADOvXyR85UHplA4ec_HYxA/348s.jpg", "caption": "Pistachio old fashioned"}]}}, {"review": {"des": "Try the cranberry orange donut! An unexpected, delicious, sweet, and crunchy surprise! Would've tried the donut ice cream sandwich but it was way too cold. The service was great too and no line!", "pics": null}}, {"review": {"des": "Donuts aren't really my thing, but Firecakes was really, really delicious! I got two of the minis- the chocolate & espresso one and the peanut butter cup one. The chocolate was thick and rich, and the fillings were custard-like and creamy; definitely my ideal donut type! For $2 a piece, it's definitely a bit of a speciality shop, but I thought it was worth an occasional treat. It's close to our wedding venue so this might be my day of breakfast. :)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qC6MYubYLXTb-QhzY0sYOQ/168s.jpg", "caption": "Wide variety on the weekends"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oSDwDnl2FkEWYl2JZxJ9Jw/168s.jpg", "caption": "Mini Peanut Butter Cup, Mini Valrhona Chocolate & Espresso Cream & Old Fashioned Buttermilk"}]}}, {"review": {"des": "Came here late in the evening after a very filling dinner at Imperial Lamian nearby. There's always room for dessert hehe. Everybody on Yelp seemed to rage about the donut ice cream sandwiches, and so we had to give them a try. <br><br>- Donut ice cream sandwich: a glazed donut was the \"bread\" while we had a choice of vanilla or chocolate for the inside. The donut was fluffy, and though the ice cream was kind of run-of-the-mill, I think the unique part is the donut ice cream combination, because you don't see much of those floating around (in fact, it was my first time having one of these concoctions!). I liked the holder that the sandwich came in - it made it very easy to eat, and what was great about a donut ice cream sandwich (vs something like a real cookie ice cream sandwich) was that the ice cream remained in place and didn't squish out the bottom, owing to the nature of the dessert (softer donut vs harder cookie). <br><br>Anywho, I think the donut ice cream sandwich is an experience to have at least once - they were very pleasant and a nice sweet treat to end off the day.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tGHnQzvzQmUJ91KTGbdRIg/168s.jpg", "caption": "Donut ice cream sandwich"}]}}, {"review": {"des": "Tried the triple chocolate donut with vanilla ice cream and the honey glazed donut with chocolate ice cream. They didn't have the \"special flavor of the day\" ice cream. Also tried the espresso cream donut. I would say it's a good one time experience but neither the donut nor the ice cream were things you would write home to your nanny to. I also was expecting more ice cream to be honest. The guy working there was very nice and he was running the show alone so props to him! Wish they had a trash can inside or outside of this place because a lot of people had left their trash around.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dZZ-bZhgOEtNUN0tKAhZvw/348s.jpg", "caption": "Honey glazed donut with chocolate ice cream. Triple chocolate donut with vanilla ice cream. And a espresso cream donut"}]}}, {"review": {"des": "These donuts were fabulous, but there was no place to sit inside! The coffee was great too, but we had to bear the cold and walk back to the hotel to eat the donuts. I tried the double chocolate cake donuts, pistachio, butterscotch, Meyer lemon, and traditional buttermilk. The best was the double chocolate, pistachio and traditional buttermilk were close seconds, though! <br><br>Donuts good, wish there was a seating area, though!", "pics": null}}, {"review": {"des": "BEST doughnuts in Chicago! Cute little hole in the wall donut shop with a nice variety of dounuts. It's your birthday? Go get try their HUGE birthday donut. <br><br>What I got: I got the pistachio and creme brulee donuts. The pistachio had the perfect hint of pistachio without being overwhelming! <br><br>Ambiance: Beware that there is no place to sit or even really stand. Get your donut and go!", "pics": null}}, {"review": {"des": "Delicious donuts and it is open late. My friend and I were able to check it out midday. We lucked out and didn't have to wait in line. They're famous for the Vanilla Iced, so be sure to try it. We also tried Strawberry Mascarpone which is seasonal. Loved both. Will definitely go back here when I'm visiting Chicago.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YyMTSdl3_3LeHCsuBPGPfQ/168s.jpg", "caption": "Great selection of donuts"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NMdeLMI_zdCZcv91G4RMcg/168s.jpg", "caption": "Their Famous Vanilla Iced Donut"}]}}, {"review": {"des": "I actually stumbled across Firecakes while walking down W Hubbard Street. The smell of freshly made donuts quickly drew me in! For being a tiny little shop, they have a nice selection of fresh donuts to choose from. I always get a nice variety when I stop in because I can't choose just one! Their coffee complements their donuts quite well. They also have a donut ice cream sandwich, which seems to be pretty popular! <br><br>One of these times I will have to splurge for the gigantic birthday cake donut!<br><br>Firecakes is definitely a nice treat!", "pics": null}}, {"review": {"des": "I stumbled upon this cute shop on a Friday night and I'm glad I did! A donut shop open at night makes for perfect dessert after having a meal in the area.<br><br>It's a tiny shop, so there's nowhere to sit and eat the donuts, but that didn't really matter as we wanted to eat them later anyways. <br><br>The donuts are massive and delicious. If it had been warmer out, I definitely would've tried the donut ice cream sandwich, which sounds like heaven. <br><br>Prices are good for large, quality donuts, and they taste great- so all in all I was pleased!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GwbUICtuqEgkqkWcQOnNmw/348s.jpg", "caption": "Display"}]}}, {"review": {"des": "Found Firecakes on Yelp before our trip and luck would have it it was close to our hotel. We stopped mid day to pick up for breakfast the next morning. Pretty decent assortment. All of them were hit. Definitely worth a stop. Good flavors and nice consistency.", "pics": null}}, {"review": {"des": "Firecakes donuts are worth it! Wake up early on a Saturday and make someone's day by surprising them with artisan donuts, that's what we did!  <br><br>We picked up a dozen of mixed varieties, including some classics and special ones that caught our eyes. Their specialty donuts, I remember we got one that had coconut custard, one with espresso custard, and one with lemon curd. They were all loved and I wished we got more of them. Their flavors were spot on. The delicate fruit flavors were prominent and didn't taste artificial, while the chocolate flavors were rich and pure. Everything was sweet (obviously), but it was tastefully done and not overpowering. The donut base itself, it felt dense when I first bit into it but then it all just crumbled and melted in my mouth. It is definitely indulgent, a treat for sure.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eQ8pE1vZJvZdd59-FN5RZw/348s.jpg", "caption": "A dozen of their finest"}]}}, {"review": {"des": "So, I did end up getting the ice cream sandwich I wanted. It was just not as fire as I thought it'd be. Basically, it's just a large flat glazed donut ice cream sandwich stuffed with prepackaged ice cream and nothing more and totally not worth the $6 it costs. The squirt of chocolate syrup (which I skipped) is extra, too. It was extremely heavy and halfway through, I wanted to throw up because it was so damn overwhelming and I couldn't bear to think about all the sugar on top of one another and that I was just stuffing like it there's no tomorrow.<br><br>Maybe I'll try again when I'm much older and have completely let myself go by then. Seems like they have other ice cream flavors as well. I've had some friends order this before and I haven't heard any of them finishing the entire thing--not once. On the other had, I still do think their old-fashioned donuts are wonderful and something not to be missed if you're looking for some good donuts.", "pics": null}}, {"review": {"des": "Wonderful doughnuts and more in a small space to be sure.  Everything available is on display and the service is quick and friendly.  All of the usual doughnut suspects are there as well as some interesting things that you don't see everywhere else.   Well worth the time and money, so go, just do it!", "pics": null}}, {"review": {"des": "I was getting ready to go for a pretty long and grueling workout but had not had any breakfast. Was panicked because I was already feeling lightheaded so pulled up Yelp and located the closest donut shop. <br><br>I was DEFINITELY not disappointed. I got the old fashioned donut and the sprinkles. HOLY MOLY THE SPRINKLES DONUT WAS RIGHT OUT OF THE OVEN AND FABULOUS. The icing was creamy and the donut itself was everything I wanted. I wish I had gotten two of those. I was less crazy about the Old Fashioned and I typically love those the most. <br><br>If you like plain old donuts with sprinkles- check this place out. Super cute and had a HUGE variety. I want to go back and try more for sure! I will update once I have!", "pics": null}}, {"review": {"des": "Donuts here we're unique and extremely delicious. The creme brulee is a must try! The top was crusty like a creme brulee and the inside was filled with custard. We also ordered the regular honey glazed (a little sweet and I was hoping for sugar but very fluffy nonetheless) and we ordered the chocolate peanut butter. Everything here looks delicious and wonderful service.", "pics": null}}, {"review": {"des": "The old fashioned is the best donut hands down and is what keeps me coming back. I was disappointed that when we went on a Saturday evening around 8:00 they only had 2 choices of donuts left. They advertise being open until midnight so I expected there to be a few more options with 4 hours until they closed. That's the only reason for taking off a star. But if you go in the morning with a bunch of variety, you're sure to LOVE your donut!", "pics": null}}, {"review": {"des": "Firecakes introduced me to the beautiful concept of an ice cream doughnut sandwich and I'll never forget it. Their Classic Sandwich (Honey Glazed Doughnut with Tahitian Vanilla Ice Cream, Chocolate Sauce) is exactly what I wanted on a hot summer Friday after a long week of work. I highly recommend!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qT5IOZXa9fApolCktRHP8g/348s.jpg", "caption": "Ft. Classic Sandwich (Honey Glazed Doughnut, Tahitian Vanilla Ice Cream, Chocolate Sauce)"}]}}, {"review": {"des": "Sorry to say,  but I am not blown away.  I'm a donut lover and have been wanting to try Firecakes for a while now and finally had the opportunity to today.  Actually, I was here last night because their website advertised that they are open until midnight on Fridays.  Got here at 11pm and to my disappointment,  they were already closed.   I called the number and the message said they are open until midnight or until they run out of donuts.   Guess they ran out of donuts.  :'(<br><br>Now on to the donut review...<br><br>Pretty basic.  We got the sprinkled donut, chocolate,  pineapple and bacon, donut ice cream sandwich.  To be honest,  it seemed that the donuts were a little stale and left out too long.  It didn't have that soft, moist,  melt in your mouth taste like Do-Rite Donuts does.  Disappointing that it did not live up to the hype for me.  Maybe a bad batch? Who knows but I was pretty upset that we spent so much when we could have gone to Dunkin.  There I said it. <br><br>Sorry Firecakes. But it's on to the next one for me.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Y4PHlD78oFoBOrDPb1rQOg/348s.jpg", "caption": "Choices!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6EKuB7SmJQph-FGNwyBCDQ/168s.jpg", "caption": "Ice cream sandwich donut"}]}}, {"review": {"des": "I am on a mission to find the best donut in Chicago and this was my first stop. <br>The store itself is pretty small but very cute in decoration. There was a variety of creative flavors along with their famous gigantic birthday cake donut. I opted for something smaller and got the maple bacon with pineapple. The donut is fairly small, close to a donut holes size but with a hefty price tag of 2.50. The donut was good, the bacon and pineapple balanced the flavor out and the donut itself was pretty light. I only wish that  the pineapple was cut into small pieces similar to the bacon so that it evens out. Being the first place I visited for donut, it was standard.<br><br>After visiting the 4 famous donut shop, this was ranked #3. There was definitely other places that taste better and was able to justify the price.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/x5z_-dKNtAr-7eykc6LClw/348s.jpg", "caption": "Bacon with pineapple"}]}}, {"review": {"des": "If donuts make you go nuts like me, then you'll be thoroughly satisfied at Firecakes. We tried the dark chocolate donut and the pistachio donut. Sweet and salty is one of my favorite combos and the pistachio donuts was absolutely perfect. Not too sweet and didn't leave me feeling awful about myself. The dark chocolate was a bit decadent but that's expected. If you're going for one their famous ice cream sandwich donuts, they don't serve those until 11:00am, so plan accordingly. Love love loved this and I will never visit Chicago with going to Firecakes!", "pics": null}}, {"review": {"des": "Average donuts. I might be happier at Dunkin Donuts, especially since it's way cheaper. <br><br>For the price, the donuts are underwhelming, besides the carrot cake and coconut creme (these two are my favorites). Service can also be very slow if it's busy. I'll be waiting in line just to get one donut, and there's multiple people in front of me ordering boxes of donuts. I've waited 15+ mins to get one donut! I feel like they can be more efficient by having more than one person work at the register. It's very frustrating. <br><br>I've had Firecakes many times since I live/work right by it. I keep giving it a chance but I still think it's just \"meh.\"", "pics": null}}, {"review": {"des": "The donut shop is super small and cute. The girl who helped us was really nice and told us a little bit about a couple of flavors. Im more of a dense, cake donut fanatic and these donuts are more on the lighter side.. if a donut had a lighter side haha. The flavors are good but nothing crazy good. I just felt that because the donuts were lighter they werent oozing with flavor and sweetness. I got the Creme Brule donut which tasted like a Korean Bread with Custard inside so I didnt think it actually tasted like a creme brule. The Old Fashioned was really good dont get me wrong but I've had better old fashioned donuts for half the price. I don't want to pin point anything negative about this place in particular, but just from the couple of donuts i've tried.. it wouldnt be on my top list of places to revisit. The Lemon Blueberry was also yummy in flavor, but seemed a bit dry, mainly once again because of the lightness of the dough. I really like the decor and little seating area in the front but i just cant seem to grasp the sheer price of the donuts womps. Still had a great experience either way though.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1kJz1GISSsph1JkHATfsCQ/348s.jpg", "caption": "Donut Selections 10/9"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wnxmOxmJYhoUli3DcHSGkg/168s.jpg", "caption": "Donut Selections 10/9"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ysFqk1Tvhe376GBja27H-A/168s.jpg", "caption": "Store front"}]}}, {"review": {"des": "The jewel box of a store, where the retail area was really no bigger than the elevator in my hotel, had a small display of a large variety of flavors. While other shoppers placed their orders, I considered the choices in front of me, works of art in flour, sugar, and cream. I wanted one of everything but ended up with 3 different doughnut bites, to optimize the number of flavors I get to taste. <br><br>The maple glazed, grilled pineapple with bacon looked delicious. As a matter of fact, it was the one doughnut that I had to have. Unfortunately, the server either did not hear me or had forgotten to bag it but I had to go back for it. Equally unfortunately, the doughnut itself was dry and could not be saved by the topping.<br><br>I was surprised that the peanut butter-filled doughnut, Peanut Butter Cup, was also not that great. The creamy filling should have paired well with the chocolate topping - but it was not something that I enjoyed.<br><br>Luckily, the third one, Valrhona Chocolate and Espresso Cream, was tasty and flavorful. Despite the friendly warning of the potency of the espresso, everybody still selected this flavor combination.<br><br>Service was unremarkable.<br><br>Note there are a few seats outside this doughnut shop to gobble up your purchases, that is if you'd like to share with the neighborhood birds.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oAqOTrjvtZBsybbXsCYwNw/348s.jpg", "caption": "The Pineapple Bacon doughnut hole was unremarkable despite the distinctive ingredients."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gFpW9gMG6rFn-9iR1DP8ng/168s.jpg", "caption": "The Peanut Butter Cup was not to my taste."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AzmI6YEMfkkDZzJn0yzgkA/168s.jpg", "caption": "Valrhona Chocolate and Espresso Cream was yummy."}]}}, {"review": {"des": "Even though this place didn't wow me very much, I'm still giving them 3 stars because of....well, donuts. It's pretty hard to truly mess up a donut. I didn't care for their ice cream donut sandwich very much. Their honey glazed didn't have that much of a honey flavor. The texture of the donuts was almost there, a little too dense though. Friendly service, and it seems like there specialty flavors were out for the day but I would have definitely tried those. Probably would try other donut places before going back to this one.", "pics": null}}, {"review": {"des": "I was excited to try this place but was very disappointed when I did. I got the ice cream sandwich (with the honey dip donut and chocolate ice cream) and the Creme brûlée donut. The donuts were a bit too sweet and the ice cream was icy and had no flavour. The honey dip was reminiscent of a 7/11 donut. I'd pass on this place if you're craving donuts or just something sweet. If you want a good donut try Do-rite!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wHE4RyAZdIhPYudbxf4Adw/348s.jpg", "caption": "Donut selection July 2018"}]}}, {"review": {"des": "Overhyped, mediocre donuts. I tried the Valrhona chocolate glazed donut. The donut itself tasted more like bread than donut dough and the icing was not good at all. I normally love Valrhona dark chocolate, but this icing was a disappointment. Average donuts in a touristy location and not by any means artisan donuts. They don't even come close to Doughnut Vault.", "pics": null}}, {"review": {"des": "So I've had a lot of donuts from a lot of different stores in Chicago. Firecakes is my absolute favorite go-to. Their donuts are massive; I'd say the surface area of each pastry is as large as my face. Some donuts from other schools taste too fried to me, but never at this location! My three favorite flavors are their glazed, vanilla iced, and apple fritters. <br><br>Their staff is also always super kind. My favorite example was my first visit over a year ago: my friends and I made it obvious that it was my birthday so the guy working at the counter gave me a free extra larger-than-life donut.", "pics": null}}, {"review": {"des": "So my boyfriend and I are walking down the street, and I'm complaining to him how tired I am and whatever, so he looks up the closest donut shop and drags my tired feet to here. And that was hands-down the best decision he made that day, because the donuts here are AMAZING.<br><br>It's rare to find a donut place that makes the perfect slightly crumbly old-fashioned donut let alone the perfect donut ice cream sandwich by which the ice cream doesn't ooze out every possible angle. Their ice creams are in a thin SQUARE shape. Isn't that ingenious? Now I can eat my churro donut ice cream sandwich without spilling ice cream on myself, and for that I give 5 stars", "pics": null}}, {"review": {"des": "This was definitely a great find. On the way to main street with all the malls and happened to catch dessert in the corner of my eye. This shop has ice cream sandies and all sorts of tasty treats! Went with the vanilla iced donut however the old fashioned looked really good too. Will definitely have to get that the next time i stroll through downtown chitown.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OYR4-HyXwAMYb1P97BCo3g/348s.jpg", "caption": "vanilla iced donut"}]}}, {"review": {"des": "Late night donuts! A beacon to the donut needing, evening street wanderers, amidst a sea of artisanal donut shops that close way earlier in the day. Finally! Donuts can go in your mouth that are good and cake-y and sweet. Hurrah Firecakes! We went there both nights of our 2 night Chicago trip...just out of principle. The line moved quick. The donuts were great. There are gluten-free/vegan options for those in need. The choices were creative...and I can't imagine spending a future evening in downtown Chicago without going here. Yes. Please.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XmlZ4JsbvO1nYnVJQg4kKA/168s.jpg", "caption": "Firecakes Storefront"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dSWOTSL3tCKzBVFoteeOTA/168s.jpg", "caption": "Late Night Donuts on Display"}]}}, {"review": {"des": "This was the one place I wanted to come for my visit to Chicago. I was extremely excited and pretty much willing to pay whatever I needed to for what I wanted. <br><br>When we arrived, we were shocked to see how small it was. There was no place to sit, no public restroom, and extremely crowded (we came at 9:30, thinking the breakfast rush would be over with. Sadly mistaken). <br><br>I didn't know what I wanted was called (later found out it was the birthday cake donut, and it was beautiful). I just pointed and said, \"I want that!\" I also ordered a honey glazed donut. When he told me my total was $17 dollars for two donuts, I almost choked on the one I was already inhaling, but like I mentioned before, willing to pay for what I wanted. <br><br>It was literally the most heavenly donut I have ever had in my life and I am so sad that I live in Tennessee and have to go back to Dunkin'. Seriously. Both donuts were phenomenal and I cannot wait to go back to Chicago to try it again!", "pics": null}}, {"review": {"des": "I came here with my sister, her husband, and my husband after we had dinner one evening while visiting Chicago. <br><br>The donuts and everything were good. I'm not sure if they were worth the wait in line, though??<br><br>My husband ordered a hot chocolate, and we all gasped and said, \"Ew!\" as the boy behind the counter picked out marshmallows with his fingers, licked his sticky fingers, and then picked up the cups with his fingers.<br><br>No, thank you!<br><br>My husband got the \"ice cream sandwich\". It's basically a rectangle of vanilla ice cream sandwiched between a sliced glazed donut. Meh.<br><br>You can take a chance on this place; it has a cute vibe and the donuts are okay. They'll just have to review sanitary expectations with employees--stat!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/64duwB4I9-P2CppVnCLspQ/348s.jpg", "caption": "Night time dessert"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KgG0Pugmph1CPAHBFvcDXA/168s.jpg", "caption": "Go nuts for donuts!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/80eX1aonxfKb-rH7rmbxCQ/168s.jpg", "caption": "Even more donuts!"}]}}, {"review": {"des": "I was not impressed with Firecakes Donuts.  The staff said that their old fashioned donut was popular along with their vanilla iced donut which apparently won best donut in Chicago two months ago.  Four of us tried these donuts and we were not satisfied. Their donuts tasted like donuts that you buy from a grocery store. My fiancé also got an ice cream donut which was also just okay.  <br><br>Firecakes Donuts isn't gross but they're not delicious either. It seems their donuts are standard overpriced donuts.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LnQZmxATJiW6o0Myz5Hjgw/348s.jpg", "caption": "Ehhh... just okay..."}]}}, {"review": {"des": "Dropped in for a quick visit on a rainy afternoon and tried their honey glazed donut with Tahitian vanilla ice cream, hot fudge sauce and almond pralines. Super sweet and yummy (shared between two). It's definitely worth a try. <br><br>(note: the store is small, there's like a high table along one wall where you can stand and eat)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2pSQgG5RWePipmwlM-2jsQ/168s.jpg", "caption": "Selection of their donuts"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/02lqHiA-w9h3nQw0K1dUdQ/168s.jpg", "caption": "Glazed donut with Tahitian vanilla ice cream, hot fudge sauce and almond pralines"}]}}, {"review": {"des": "Nice spot for coffee&donut break in river north. The Pistachio old fashioned is wonderful. The Triple Valrhona Chocolate Cake is a must!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PqDQOr8Q_NmQhlCnBvTCag/348s.jpg", "caption": "Pistachio Old Fashioned"}]}}, {"review": {"des": "Really good donuts and really good donut ice cream sandwiches. If you want to have a good selection of donuts go early because they do run out. My favorite is the peanut butter one. It's a smaller donut filled with peanut butter and a chocolate glaze on top. It's the perfect size for you to eat while you're walking around. The ice cream sandwiches are also unlike something you've had before. They have a few different varieties or you can build your own. Def worth checking you!", "pics": null}}, {"review": {"des": "How to spot a hipster donut shop?<br>- It's a tiny hole-in-the-wall with no space<br>- There's at least one dessert that incorporates bacon<br>- They have a mobile food truck stand<br>- It's gimmicky, i.e. putting a donut in a coffee sleeve (which coincidentally looks fantastic on social media)<br><br>Firecakes has an amazing story, rooted in a secret family recipe from the owner's grandpa made \"firecakes\" to power coworkers through the day. The modern spin has created an abundance of novelties that reminds me of the fascinating flavors of donuts at Blue Star in Portland. <br><br>The space is small (difficult to take photos with the display case in the backdrop, unless you are the only customer there), service is friendly, and prices are reasonable given the craftiness.<br><br>The seasonal mini maple glazed pineapple and bacon blew me away in its melange of tangy dried pineapple with sweet and savory candied bacon pieces. I think the glazed frosting coating was a bit of excess sweetness since there was already so much going on in this bite-sized donut. <br><br>The coconut cream was amazing as well, with an indulgent dollop of custardy cream in the middle, large flakes of nutty toasted coconut on top, and a dense coating of thinly shaved coconut over the donut. It reminded me of my childhood favorite Chinese coconut cream buns, in donut form.<br><br>One night after boo and I went out to Three Dots and a Dash for (rather strong) drinks, we found ourselves with the drunchies but stumbled into Firecakes right down the street and it was open until midnight Thursday through Saturday. We ended the night on a satisfactory note, treating ourselves to some classic old fashioned glazed (next time we should get old fashioned donuts after old fashioned cocktails... Ha!)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5LhVJLwzBpqe7so0P_mO7Q/168s.jpg", "caption": "Bacon and pineapple (left), coconut cream custard (right)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/A7Ug_s1jFzEpviGMoX2R9A/168s.jpg", "caption": "Old fashioned glazed"}]}}, {"review": {"des": "One of my favorite donut places. It's got so many flavors that I always can't decide. I get at least 3 donuts each time. I usually go for the anything hazelnut, pistachio or old fashioned. I recently discovered their gluten-free vegan dark chocolate donut and it was pretty good! It had a very great chocolate flavor and the fact that it was gluten free or vegan didn't make it bland. If Firecakes can still bring strong flavor for anyone's dietary restrictions then they got some skills. <br><br>I also keep going back here because I love their Jasmine Silver Tip tea. It's got a nice jasmine and floral flavor. It's not an overwhelming floral flavor - just right. So you aren't drinking straight up flowers.<br><br>This location is a small shop so it's best to grab these donuts on the go.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LKcA_LHYAInqfALFDzy8yg/348s.jpg", "caption": "Jasmine silver tip tea and gluten free vegan dark chocolate donut"}]}}, {"review": {"des": "Does anyone get the impression that Firecakes is trying to replicate the Doughnut Vault? The big yeasty doughnuts, old fashion variety...only thing is, they have their birthday cake looking tower (not sure what the real name is).<br><br>Came here for my first stop in Chicago! We came before dinner (that's what happens when you adult), and got a regular chocolate (valrhona?!) glazed.<br><br>+1 Good service<br>+1 Everything looks delicious<br>-1 Doughnuts too dry<br>+1 chocolate glazed saved the day<br>+1 reasonable pricing<br><br>Cute outdoor seating! I would get Do-rite instead if you're a tourist.", "pics": null}}, {"review": {"des": "I was lured here with the promise of a churro donut ice cream sandwich. Unfortunately when I got there I found out they didn't have them at this location. Already off to a bad start. I consoled myself by getting several other donuts. Of the ones I tried the two worth mentioning were their Tahitian vanilla bean donut (the size of my face and very tasty might I add), and surprisingly, their pistachio cake donut which was also really good. <br><br>I would go back and get those two again, and to try some of their other flavors, but I don't know if I'd go out of my way to do so.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZDrPuE9Bj3koMFNyckaytw/348s.jpg", "caption": "Donuts but what's most important are the two in the middle - the massive one (Tahitian vanilla bean) and the green one (pistachio). Yummy!"}]}}, {"review": {"des": "Yummy<br><br>Who doesn't love a donut?!  Took us a minute to get here. GPS kept sending us the wrong way. Had we not seen the small sign, we would've never gotten there. <br>Hole in the wall joint, you could literally miss it. Not kidding, it's a small space. No seating, but there is a. Wall bar for you to set your drink and donut down if need be. It's better to grab and go. <br>Great selection of donuts, they all looked fantastic. Nice range of drinks as well. I had a cappuccino and a chocolate hazelnut long john. <br>The cappuccino wasn't my favorite. Added sugar and drank it anyway.<br>The long John, on the other hand, was delicious. Sweet, but really good. Good thing it was my cheat weekend lol. <br>My friend had the gluten free chocolate donut. It was really good as well<br><br>If I'm in the area again, I'd love to try an ice cream sandwich or another donut. Yum!", "pics": null}}, {"review": {"des": "I didn't plan on making a stop here. Then on my last day of wandering the city of Chicago, I found myself a block away and couldn't resist popping in. The shop is small so there is no escape of the sweet smell of fresh donuts and espresso. <br><br>Points for creativity, definitely. I thought I would just browse and maybe get an espresso for a bit of warmth and energy on a crisp October morning. Then I saw it. And it saw me creeping on it. Pistachio old fashioned. How could I say no? <br><br>The donut had crispy edges with a soft, cakey consistency. The pistachio topping was unique, nutty, and really complimented the classic old fashioned. It was, as expected, a sweeter donut, but totally worth it. <br><br>Super glad I had a chance to stop here and full of regret that I didn't bring home extra pistachio donuts.", "pics": null}}, {"review": {"des": "I wish I had a picture of the donuts I bought. I'm from out of town and I saw this place on Facebook. I'm a huge donut fan so I couldn't wait to try these! I came and instantly I got a good vibe. Cool place, friendly faces, however that was about it. The staff was less than friendly. I had a couple basic questions about the sizes and quantities of the donuts and they sounded annoyed to answer. I went through my donut order (a dozen donuts) and ordered a Firecakes sandwich. The lady who helped me looked like she was going to bite my head off when I asked for one.. overall, the staff was rude, the Firecakes sandwich with the glaze donut was AWESOME, but sadly the fancier donuts that I ordered were not as good. The fancier donuts were dry and tasteless. The sandwich with the glaze donut was amazing though so I would suggest going there and getting the glaze donuts. I'm upset since I had such high expectations.", "pics": null}}, {"review": {"des": "Chicago is a city with many doughnut purveyors, each with its own dedicated fanbase. You have Do-Rite, which is great when you're craving a spicy chicken sandwich nestled in a donut, Glazed and Infused when you're looking for crazy, creamy flavor concoctions, and then there's Firecakes.<br><br>Personally, I think Firecakes wins in terms of best actual donut quality. Sure they have lots of flavors and varieties, but when it comes to the basics, they win. <br><br>The old fashioned buttermilk donut is excellent. Crisp on the outside and soft and moist on the inside. It would be even better if they had a non-glazed version. I'm a firm believer that most donuts would be better if you cut their sugar 80%. Let the flavor come through.<br><br>Then there's the Valrhona double chocolate donut. A little on the drier side compared to the old fashioned, still crisp on the outside. Definitely toned down in the sugar department which lets the rich chocolate flavor come through. This was the favorite among half our party. The buttermilk was my wife's fave.<br><br>However, the kids and I gave first place to the apple fritter. It's one of my favorite donut varieties, but it's hard to find a well-executed version. Firecake's take on the apple fritter includes lots of tiny pieces of apple spread throughout a thinner, crisper fritter so you don't end up with large bites of what amounts to a basic glazed donut. Definitely my favorite apple fritter to date.<br><br>We did not try the ice cream donut sandwiches, which I'm not sure would appeal to me. Interestingly, I don't remember seeing them displayed or on the menu in the store.<br><br>Anyway, if you haven't checked it out, head here soon.<br><br>Now, I just need to try out Stan's and my donut survey will be complete.", "pics": null}}, {"review": {"des": "Their pistachio old fashion was not good but their espresso donut was good. I left disappointed because I got two of the pistachio donuts when I should have gotten two espresso ones. The pistachio was just a regular donut drenched in pistachio glaze. Too sweet and couldn't really taste pistachio", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qzSb2Y-OBUjoLjtX1pB9tw/348s.jpg", "caption": "Espresso cream"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SpLO3DmSJf4TfPSnM1XNUg/168s.jpg", "caption": "Old fashion pistachio"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ef1bBj9USgZ7mDGQngZkMw/168s.jpg", "caption": "Look for the blue sign"}]}}, {"review": {"des": "Pretty solid donuts! We came here after stuffing ourselves with deep dish, so I appreciate that Firecakes is open late. Unfortunately since it WAS so late, the donut selection was very slim, understandably.<br><br>We just got a chocolate cake donut and it was good--probably would have been even better if I bought donuts in the morning when I'm assuming they're made :)<br><br>This just means I'll have to come back to try their other offerings!", "pics": null}}, {"review": {"des": "Overrated, over sweetened. Not my style donut unfortunately. But Angel was a sweetheart!", "pics": null}}, {"review": {"des": "After hearing so much about firecakes donuts, I finally made time to venture out to this location and let me tell you, it lives up to the hype around it! I got a bunch of different donuts for me and my family, which we all enjoyed thoroughly. Unfortunately, they didn't have the pistachio donut available which I heard is a local favorite, so definitely coming back for that sometime soon. Overall, don't think you can go wrong with any of the donuts they have available. Everything has its own unique flavor and it wasn't too sweet like other donut shops I've been to.", "pics": null}}, {"review": {"des": "Saw something on Facebook about the ice cream donut sandwich before my trip to Chicago and I just had to go. We only got the sandwich, but all of the other donuts looked amazing. I really wish I'd gotten the pistachio donut, too! As far as the donut sandwich goes, I really don't feel like I made a bad choice!", "pics": null}}, {"review": {"des": "SWEET!  What a great little place.<br><br>You will almost miss it if you're walking too fast.  It is a very tiny shop at the corner of this building.  There is no internal seating.  Only enough room to walk in the door and stand to order your takeout.<br><br>Someone else walked in after me and stood inside, and it almost felt a little crowded.  This might be the biggest drawback to this place, and might turn some people away.<br><br>Well, if there's no line or you're not in a hurry, give it a shot.  Not sure if they actually make or sell cakes, but they have a decent assortment of doughnuts and pastries that were delicious.<br><br>The coffee was good too, but they don't really specialize in decaf, which is what I got.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UkNARFmXIF8S_pEfPl0T2g/348s.jpg", "caption": "Yes, I took a bite"}]}}, {"review": {"des": "Amazing doughnuts especially the buttermilk old fashion one! I really went for the red velvet but it was out of season. Excellent customer service and great background music. You can't really eat in because it's small but me and my girlfriend enjoyed our sweet treats in our hotel and they were still fresh in the morning with a cup of coffee. If I'm ever back in Chicago this is definitely a must stop place.", "pics": null}}, {"review": {"des": "The pistachio old-fashioned donut ... <br><br>There are a few Firecakes in the city, all quite small so oftentimes there is a line out the door...<br><br>I havent tried them yet, but the ice cream sandwiches look awesome.", "pics": null}}, {"review": {"des": "I donut know what I would do without chocolate in my life :)! My fiancé and I went to visit a friend in the hospital and we felt awkward getting a guy flowers so we decided to get him donuts. Firecakes literally looks like a hidden gem in a corner. Street parking is a witch- don't bother parking around here because chances are you won't find a place to park. Use SpotHero to find parking. <br><br>Once you walk in, donut galore! The kinda sorta downside to it is that it's not very big inside so you can't really sit down and indulge. I can't recall if there's even legit seating. Anyway, I walked in, keep in mind it's kinda small so when you have a small line form, it gets crowded. The donuts are huge and well worth their $$. I ordered three donuts in a box and then I ordered a separate one for myself. The individual working was so touched by my gesture to visit a friend in the hospital that they added an additional donut on the house. I genuinely appreciated that because I had only the intention of buying two donuts but then remembered his mom was at the hospital with him. Well, when I got there, his sister was there too so God bless Firecakes. When you're going through a hard time, comfort food is always appreciated and welcomed and it was my friends first time having firecakes and they loved it! The donuts are big but they sure delicious. I had the chocolate vrhanova- lord have mercy. The chocolate served over the donut is mine boggling good- so good that I wished the entire donut was covered in that chocolate goodness. The donut was fresh, soft and delicious! I would highly recommend this place to anyone!<br><br>My only regret is that I didn't know about the additional donut until I checked out and I didn't have a chance to tip the server but this is an incredible reason to go back again.", "pics": null}}, {"review": {"des": "Firecakes is definitely a cute and very small place (be prepared to wait in line outside) with super interesting flavors. We ordered the pistachio old fashion and orange poppy seed which I 10/10 recommend. We also got the peanut butter and jelly and vanilla iced which were both very sweet so I'm not sure how I feel about those two. Overall, if your craving donuts this is a great place to try:)))", "pics": null}}, {"review": {"des": "Tried to come here several times for the donut ice cream sandwich and was always sold out by the time I made it. They now have the ice cream pre-cut into a thin slice and ready to go. Wish it was a little more thick as it was way more donut than ice cream.<br>I also took a peaut butter and matcha iced to take home and have for breakfast. They were both so good. I really loved the matcha iced! The matcha taste was just right.<br>We came here on a Wednesday and there was only one kid working and the line was down the street into the next block. They really should staff better and get a larger location.", "pics": null}}, {"review": {"des": "I wanted more. But not the way one would think, but let me explain. Ive heard raves anout this location and of course i was excited about going finally. Unfortunately i wasn't impressed with the hard donuts. Maybe it was a fluke, maybe it was late in the day. But i got the ones that were hard and seriously was disappointed in not only the flavors but the sheer fact that the donuts lacked flavor. Is it me or was it just not s good day? I want to like them and will be returning, but on this particular day something was off. I did ask the employee on why the donuts were so hard, she stated that its later in the evening. Im not sure what that means but I wasn't asked if i would like a another donut. So i am just going to try them again at another time and just assume it was in fact a bad day. <br><br>Let me be clear, i am in no way saying they are bad, far from it. But I would like to be fair and try them again and try to change the stars.", "pics": null}}, {"review": {"des": "It's ok. A bit too yeasty and doughy. The donuts are giant though so if you're going for volume this is the place. They also have mini donuts which we tried. The icing to dough ratio is a little off. <br><br>Minis: We tried the pineapple maple bacon which tasted like Hawaiian pizza. The chocolate espresso was ok.  <br><br>Honey dipped (aka glazed) was fluffy but didn't taste as good as do-rite. The praline raised donut that has filling was gummy. A little too intrusive for the palate. Perhaps a cup of coffee with that one would balance things out. <br><br>Pricey which I wouldn't mind if it was tasty. Service was friendly. Teeny counter to stand and eat if you want but mostly a take out spot.", "pics": null}}, {"review": {"des": "8/21/2017 - Last day in Chicago required some tasty donuts from the famous Firecakes. And I say \"FAMOUS\" because every person we asked about donuts, they said \"FIRECAKES\". It is definitely a small shop. It is a choose your donut, pay and go kind of place. However, they do have outside seating. This was the day of the Eclipse so we took a moment to see it, eat donuts and chat with the locals.<br><br>I ordered the Pistachio Old Fashioned ($2.95) and Lindsay Y. ordered the Peanut Butter Cup ($2.24). They also offer hot and cold coffee, Tea, hot chocolate and fresh squeezed lemonade. We did see someone having a Donut Ice Cream Sandwich ($5.25) that looked delicious.<br><br>The pistachio donut was incredible!!!! I would definitely go back for a dozen.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PJC4punOsscnzXsO8MyPEQ/348s.jpg", "caption": "Peanut Butter Cup"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uGTSzl5APttsIneNYiSkCw/168s.jpg", "caption": "Pistachio"}]}}, {"review": {"des": "The more that I've had Firecakes. The more I think it's a little overrated. There's 1-2 really good donuts while everything else is kind of average. The donuts all look good though.", "pics": null}}, {"review": {"des": "I expected a wildly delicious donut but only received a very average (unfresh) donut.<br><br>I ordered the dark chocolate donut after reading rave reviews for it. I am a chocolate lover, especially dark chocolate, but I found that the chocolate flavor didn't come through in the donut because the donut to glaze ratio was off (big donut, not enough glaze.)<br><br>The donut was also a bit stale, as of they had been sitting there for quite some time. I think it's unacceptable for gourmet donut shops to churn out their donuts in large quantities and leave them to sit out all day.  Donuts should be fresh- no exceptions.  Go elsewhere.", "pics": null}}, {"review": {"des": "This place has some delicious donuts. It's still one of those donut places you got to try while you're in Chicago. They have classic donuts and some interesting ones too.<br><br>Their donut sizes run bigger than you're classic donut shop. The shop is fairly small. Almost can fit 8 customers in their order area. There aren't any tables in or out the shop to eat your donut so be aware of that. They also serve coffee and other mixtures.<br><br>They make choosing donuts even harder since they offer ice cream donut. This is basically a donut with ice cream between them. They have a small menu but pretty good number of selection.<br><br>The first time I was here, order the ice cream donut combo.  I was not disappointed. It was messy, but delicious. The second time I was here, I got the butterscotch praline, which I didn't know exactly what praline was. It was still awesome. Creamy inside and nice glaze on the outside!<br><br>I will definitely be visiting this place more before I leave Chicago!", "pics": null}}, {"review": {"des": "It's a little while in the wall donut shop. We asked the gentleman behind the counter which one he recommended and he stated the vanilla ice which by the way is pretty big and you can share it. He also recommend the old fashion donut as well.  They both were delicious! They were $2.95 each and decent size. I went late around 4pm and they tasted fresh.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/n7B29V-ZMj_Ou3y1lirkAQ/348s.jpg", "caption": "Vanilla ice & old fashion"}]}}, {"review": {"des": "The donuts here are a bit pricey, but they are good. I most recommend their malt ball mini donut and their donut ice cream (a combination on par with peanut butter and chocolate IMHO). However, their citrus flavored donuts (such as the key lime and the lemon donut) are the perfect balance of sweet and tart, and their creme brulee is not too bad either<br>The people on staff are always super nice and I do appreciate the decor and aesthetic.", "pics": null}}, {"review": {"des": "Oh my gosh! I would be in serious trouble if I lived closer! We saw someone on the street walking with a huge praline doughnut clutched in her freezing cold hand. It looked mouthwatering. It was just good luck we found our way to this heavenly shop. <br><br>We were dazzled by this gorgeous selection of doughnuts. We tried (someone had to see what this fuss is about) Meyer Lemon Chocolate with cappuccino filling, peanut butter and jelly and the enormous praline concoction. Oh my...It's a good thing we walked all day because we absolutely devoured our doughnuts. They are fantastic and they even have a vegan gluten free doughnut. Try the chocolate!! Try anything. If you're a doughnut fan, you wont be disappointed.<br><br>Highly recommend!!", "pics": null}}, {"review": {"des": "I've had this spot on my radar for years and I finally made my first trip to Chicago! Yay! We went in after dinner to pick up something for my friend to take Home to her family.  And my plan, get doughnuts for today's breakfast! Great plan right???<br><br>So even at 8pm, the case was beautifully stocked and the doughnuts were fresh. I got an old-fashioned- because let's be honest- this is the baseline ALL Doughnut shops should be judged on. It was moist without being greasy, and yes, I ate half of it last night.<br><br>This morning I am enjoying my coconut cream pie doughnut in bed with coffee. It is sublime. I tended cake doughnut covered in toasted coconut and topped with the fluffiest coconut cream frosting which is so light- it's more like a mousse. So delicious.", "pics": null}}, {"review": {"des": "What can I say.. sweets are my weakness! After a long wknd of eating and drinking, my girl Reixa and I were still fixated on getting some tasty doughnuts in our system before we left Chicago!<br><br>Word on the street was pointing us right to Firecakes so we had to try it! As soon as we walked in we were surrounded by the delicious aroma of baked goods. Firecakes had countless flavors to choose from so me being semi indecisive made it really difficult to just pick one.<br><br>Reixa's a woman who knows what she wants and had her heart set on pistachio. After much thought, I ended up choosing a chocolate filled peanut butter concoction! <br><br>We sat outside, took  turns watching the eclipse, fed small birds and talked with a with a man who lived near by. I decided to save my donut for the plane ride home because I wasn't too hungry.  <br><br>All in all -  we enjoyed our donuts and mine was even good after being smushed in my purse!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WzZrlHhU5CfaogDNsCb0gA/348s.jpg", "caption": "Eating my smashed donut on the plane ride home with some added pretzels for crunch lol"}]}}, {"review": {"des": "Great texture, fluffy, and soft. it's a donut cloud in your mouth. There are unique flavors, I got the matcha which has a mild matcha taste and more lemony flavor. The Old fashioned buttermilk was buttery and soft. <br><br>We took our donuts to go, there's limited room and the store is small. If there's more then 10 maybe even less, the place can get crowded so expect to wait outside. These were one of the best donuts I've ever had, and I can't wait to visit again!", "pics": null}}]}