{"name": "fish-bar-chicago", "reviews": [{"review": {"des": "Cute place that reminds you of New England upon arrival. <br><br>My friend and I tried the oysters, tuna tacos, lobster roll and the clam chowder. The clam chowder was delicious and filling. They have two options for the oysters: East Coast (Prince Edward Island) and West Coast (WA). Both were great and I enjoyed the habanero \"sauce\" that comes along with it. The lobster roll had the perfect amount of sauce and the lobster tasted fresh. It had coleslaw and vinegar chips as a side. I enjoyed them both, but the coleslaw was a bit spicy. The tuna tacos were divine and the avocado sauce they gave was a plus. <br><br>For drinks I had the \"All rummed up\" and the boy blue. I enjoyed the \"all rummed up\" more. The drinks were good, but not exceptional. They also have beer and wine. <br><br>Overall, the food was great, the drinks were good enough, the staff was nice and the interior had NE charm. When we arrived at 5ish, it was still empty, but it started to fill up quick after 6pm!", "pics": null}}, {"review": {"des": "Disclaimer: I won a meal here and was invited to dine and try the Hot Mess for free<br><br>When I entered the restaurant on a weeknight , I immediately was drawn to the cute nautical decorations but noticed the limited amount of seating (3 booths and remainder is all bar seats, some outdoor seating). <br><br>My husband ordered two beers which came in hipster mason jars. $6 each and one was $3 due to happy hour being before 6 am. We also decided to buy an appetizer so we got the Lindsay Special, which is $14 for fried lemon slices, pickled jalapeño, Parmesan, onion shoestring fries, and 1/4 lb (measly amount tbh I doubt it was even that) calamari. This is an interesting dish but way too aggressive and salty/sour! Worth trying once, but very expensive for the amount.<br><br>The part of our meal we \"won\" was the Hot Mess. Detailed at market price of $25 that night, it was 1/2 lb shrimp with 2 pieces of corn, a small piece of sausage (only one small piece for two?), and plenty of potatoes. The shrimp and sausage were over cooked, but we liked the flavor of the Cajun boiling spices and sauce. The potatoes were good too. The portion was not very large and way overpriced for $25. Yes, we did receive it for free and I'm glad to now know what to expect because I can tell my Yelpers that this dish is not worth getting. <br><br>Service was nice and friendly though. I just can't justify the prices and serving sizes.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/F_u9yijmmJaJkV149HO4QA/168s.jpg", "caption": "Lindsay special"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZpMqgjXsrM-MBJLMCnNDiw/168s.jpg", "caption": "Bill"}]}}, {"review": {"des": "The layout of Fish Bar is really unique: bar style seating for most of the restaurant, making it ideal for dining for two, with a few booths off to the side typically reserved for parties of three to four. Very intimate and rowdy atmosphere. Service is great; everyone is super friendly and eager to answer questions or give recommendations. <br><br>I only ever come here during oyster happy hour, $1.50 oysters Monday-Thursday, 8-10pm. Their selection of oysters, usually one east coast and one west coast although sometimes both east coast, changes daily. I've always found the oysters to be very fresh, albeit sometimes a bit clumsily shucked.<br><br>All of the cooked food I've tried here is delicious as well. I always order their clam chowder, which is rich, creamy, and slightly spicy. The menu changes seasonally I think, which is great, but it also unfortunately means that one of my favorite dishes here in the past--octopus a la plancha with chayote squash--is no longer served. I've enjoyed everything I've ordered here, but the portion size always seems very small relative to the prices. A dozen oysters, a cup of soup each, and a few dishes shared between me and a friend is just about enough for the both of us to feel satisfied, but by then the bill is ~$60 at least, before tax.<br><br>I really appreciate how fresh the seafood is and the commitment to constantly reinventing the menu. However, given the priciness (which only seems to be going up, given the change from $1 oysters on weekday nights to $1.50 oysters), I will probably be looking for other spots with oyster happy hour closer to where I live.", "pics": null}}, {"review": {"des": "Food and service were excellent. It's a little pricey given the small portion size, but the food is great. They seem to have some nice specials as well.", "pics": null}}, {"review": {"des": "Came with a girlfriend around 1:30 pm on a Thursday. We sat outside as it was a beautiful day out! The ambiance is very casual and relaxing here but like other reviews say it is not good for large groups at all. Even on the menu they tell you to go next door to DMK burger if you have a party of five or more! <br><br>The service was pretty slow- I believe there was only one server for the whole outside area which was about 10 tables. We waited about 20 minutes just for our drinks. They have a very limited bar, I wanted a Seabreeze but they don't even have grapefruit juice. We ended up going with the \"Things get better with Sage\" cocktail. It was OK- nothing to write home about. <br><br>We asked if they could do fried oysters but they said they could not. This was kind of a bummer as most seafood places in my previous experience would be happy to accommodate such request. <br><br>We decided to go with the calamari federal-hill style which had banana peppers in it and seasoned with parmesan cheese. They offer 1/4 lb and 1/2 lb portions. The 1/2 lb was $17 which is relatively expensive. It took a while for the calamari to come out- I would say another 20 minutes or so. It was definitely a small portion for $17, I couldn't even imagine what portion the 1/4 lb would look like! In terms of taste, it was really too salty. It does not come with any dipping sauce. <br><br>The whole experience was underwhelming but my review is solely based on the few items we ordered. Maybe I'll stop by again if I'm in the neighborhood to try the other items but I definitely won't go out of my way to come back again.", "pics": null}}, {"review": {"des": "Fish Market a la plancha is just SPECTACULAR,  best salmon I've ever had, highly recommended", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8rnjL_XMvqKmKeyfKfurWw/348s.jpg", "caption": "Market Fish a la plancha is SPECTACULAR  highly recommended, is seriously perfect in every way"}]}}, {"review": {"des": "This restaurant is SUPER small!  It is best visited as a single diner, couple, and at a maximum four people.  There are only 3 booths and then several stools along the counter.  It is loud inside, so groups of 3 or 4 won't want to sit at the counter.  Reservations are accepted for parties of 3 or 4.  We made a reservation for a party of 3 and even though we showed up early, we were doubtful that we'd be seated in time.  Miraculously, it happened!<br><br>The service was spectacular.  We were acknowledged when we walked in and allowed to wait on the bench and camp out for our table regardless of whether or not we ordered drinks while we waited.  We were seated in time for our reservation (which really seemed like it would be impossible), were accommodating with customizing menu items, gave great recommendations, and got our food and drinks out quickly.<br><br>Our trio shared:<br><br>Chicken tenders \"angry style.\"  Deep fried chicken fingers tossed in a semi-spicy sauce.  Really good.  Could've eaten a bucket of them.<br><br>Lemon rings.  Perplexed by what a lemon ring was, I insisted our group order this.  It sounds strange, but is truly delicious.  Deep fried lemon slices mixed with deep fried onion strings.  The saltiness mixed with the citrus flavor was so good!<br><br>Calamari \"angry style\" was deep fried calamari mixed with peppers.  Even the tentacle-like pieces were good.  Some of the best calamari I've had.  We ordered the 1/4 pound since we ordered so much more food, but my friend said \"we should have ordered the 1/2 pound!\"<br><br>The lobster roll, although I have nothing to compare it to, absolutely exceeded my expectations.  The bread held the sandwich together nicely, with chunks of lobster piled atop and wedged into every crevice, then doused in butter.  Traditionally, Fish Bar serves a cold lobster roll, which didn't appeal to me.  I inquired with our waitress who kindly checked with the kitchen to ensure they could make it hot.  I guess it depends on what's been prepped in the kitchen already.  This was SO GOOD and WELL WORTH MARKET PRICE.  MP that day happened to be $23.<br><br>The cocktail menu is thoughtfully put together, and the drinks are well made.  They're strong and worth the expected $10-11 each.<br><br>Fish Bar is awesome.  It wasn't as expensive of a night as I expected.  My entree, a cocktail, and three shared apps was about $40 before tax and tip.  The food and drinks are perfect for when you want something different.  Best when you want to eat and drink.  Not for socializing.", "pics": null}}, {"review": {"des": "Updating my review, but Fish Bar is still only deserving of 3 stars. Actually I'd give a them 3.5 if possible, but not good enough to round up to 4. I had an a la Card and had a craving for a fish sandwich. I totally understand fresh seafood is pricey. ..that being said, Fish Bar is still 20% overpriced.<br><br>Service was friendly and with the exception of the Crabby Patty, everything was pretty good. The crab cake was jammed packed with bread crumbs. I'd rather they halve the portion and ditch the breading all together.<br><br>From previous visits I've learned to pass on the overpriced drinks. I will say the chowder was o-fficial!! Very rich and seasoned perfectly. Decent amount of seafood too. I might revisit if in the area. Don't go outta your way to try.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wzemG3FM_-bUO5CDCED2WQ/348s.jpg", "caption": "crabby patty | old bay mayo, lettuce, tomato, onion"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2XJ9lHkpKYeIb-fB4oLhvg/168s.jpg", "caption": "codfish | tartar sauce, lettuce, tomato, American cheese"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CZFQ5pH_qqSRICzbdNIJRg/168s.jpg", "caption": "mixed greens salad | cucumber, tomato, radish, fresh herb ranch"}]}}, {"review": {"des": "Fish Bar is good. I probably give it more like 3.5 stars. It's just that it's expensive for what it is. We spent quite a bit for a casual/bar dinner, and I left a little hungry.  <br><br>We got the satchmo sandwich, the calamari, and the lobster sliders. The satchmo sandwich was the best dish of the three, and man was it good. The fried fish  combined with the spicy mayo and pickles is a dynamite combination. At around $13 you get about 4 oz of seafood with about 1/2 bag of chips on the side. It's a great sandwich, but on the expensive side. The calamari was good, but a small portion for the price. No better than most nicer places that serve calamari.  I did like the addition of banana peppers to add some heat and acid to the dish. The lobster sliders were probably my least favorite. It isn't that they were bad, but just unremarkable. Something about the addition of lobster makes you expect something really great, and they just didn't live up to that. <br><br>The service was great. We got a seat right away, and our waitress, Bailey, explained all the food/ drink options really passionately and generally did an awesome job. <br><br>Overall it's a good restaurant, but pricy. I know you can argue seafood is inherently expensive, especially inland, but there are plenty of other restaurants that offer seafood for much less, or at least offer larger portions for the price. I think maybe good fries instead of chips would go a long way to close the gap. Chips are good, but feel like a weak/cheap addition for a side.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DTpsAY813shtn0hkeaoqHg/348s.jpg", "caption": "Satchmo Po'boy Credit: shannoninthecity.com"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XFKu3-LaRi5_4ZJlyCZkZg/168s.jpg", "caption": "Calamari Credit: shannoninthecity.com"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mwWd6TXhgf1qDvt-g5Bpcw/168s.jpg", "caption": "Lobster sliders Credit: shannoninthecity.com"}]}}, {"review": {"des": "Absolutely love Fish Bar. It's such a cute little spot (perfect patio during the summer) and everything I've tried - calamari, lobster roll, satchmo po'boy (fried shrimp and crawfish with garlic aioli), shrimp tacos - has been delicious and fresh. Need to go back for the oysters once they're in season!<br><br>Drink wise, it may have been seasonal but I had what was essentially an Arnold Palmer with vodka and it was great as well!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Vo4pF1W0sXsEhnIpumsf9A/168s.jpg", "caption": "Shrimp and crawfish poboy. The b&b pickles are the perfect compliment to lighten up the sandwich and add a little tang."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KK4_U4hEE4i9eUKWkdBK2Q/168s.jpg", "caption": "Lobster Roll served with chips and coleslaw. They don't skimp on the lobster meat!"}]}}, {"review": {"des": "Still four stars! Had the whitefish sliders again. The tacos were ruby trout. Four stars!<br><br>This time we tried a few new items. The crabby patty was very crispy in the outside, so tasty. My only note is I think it would be better if it was a thinner patty. That's my preference though. <br><br>Also tried the clam chowder. I'm not a fan of clam chowder so I didn't care for it. It was pretty thick. My husband likes clam chowder and said he had had better. So take that as you will.<br><br>The tots were so crispy!!! Yummy!!!!!! Such good tots every single time we get them.<br><br>The server with the flower pants, Kayleigh, was so friendly with my two and a half year old. It was nice that she was welcome there. <br><br>If you have kids and want to eat at Fish bar, call ahead and ask for a booth or else you'll have to sit in bar chairs.", "pics": null}}, {"review": {"des": "This is one of the best seafood spots in Chicago! I go with coworkers for lunch or at night with friends. They have a good late happy hour. Awesome outdoor seating. Their menu also often changes, which is cool. For dessert, we made our own S'mores at the table!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ccJxPgB1eEgxcDJu-FSS2A/348s.jpg", "caption": "Make your own s'mores"}]}}, {"review": {"des": "Great spot for some incredible sea food and libations!  Manager Gabby is always wonderful along with the entire staff, from the kitchen to the servers.  So check then out...eat in, al fresco or carry out!  <br><br>Yummy!", "pics": null}}, {"review": {"des": "My boyfriend and I have been here a few times over the past year and we love it. It's a small cute spot with awesome oysters and fish. Monday-Thursday the oysters are $1.50 from 8-10pm. They always have a special fish, special taco, different kind of oyster, gives a nice variety each time you dine there. Kayleigh was our server last night and did a great job taking care of us. The picture is of the lemon rings, sound different but are super tasty if you're into foods with a kick. We had the bouillabaisse and garlic bread along with our oysters. The garlic bread was amazing! (Hard to have bad garlic bread but this is good) I recommend checking this place out.", "pics": null}}, {"review": {"des": "Very good fish, especially considering the distance this is from the ocean (which was posted on the wall but I don't remember what it was). The portions are small, but the prices are good so just get a side. Haha", "pics": null}}, {"review": {"des": "Typically very happy with this place, but the last time I was here it was underwhelming.  The oysters tasted fishy.  The lobster roll was good per usual.  The lobster bisque was underwhelming. Calamari was good.  My friends ordered the hot mess and were really pleased.  Drinks are amazing!  May have just been an off night as far as the oysters.", "pics": null}}, {"review": {"des": "Since when do you you serve key lime pie without whip cream and pay $7. I hate it when businesses slack on to go others. Not cool.<br><br>I called and they blamed it on their new key lime supplier for them not serving with whip cream anymore. I don't think a restaurant should ever blame their supplier for why they quit serving a certain item with or without a straight forward topping. What a cop out.", "pics": null}}, {"review": {"des": "Busy on the weekend. They had full service at the bar and the shrimp tacos were tasty. You can't beat homemade fries. Yum!", "pics": null}}, {"review": {"des": "Pretty fun and attentive staff. They were very nice and improvised a drink for us off the menu, which ended up being a little pricey in my opinion. BUT was still a great gesture.<br><br>The oysters on Sundays are $2 and let me tell you they run out fast-so get there early. We did both east and west coast and both were delicious. Their cocktail sauce was great, perfect heat with the horseradish. The mignonette was probably the best I've ever had.<br><br>I had the whitefish sliders which were cooked perfectly. The right portion size too after eating a bunch of oysters. The coleslaw they put on the sandwich is tasty. <br><br>Overall great spot for reasonably priced seafood!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3LPFEp9bQg7_YqQCMpZ5jA/348s.jpg", "caption": "Mmmmmm $2 oyster Sundays!"}]}}, {"review": {"des": "Absolutely delicious shrimp tacos with steamed mussels as a starter. The tacos we<br> paired with nachos and guacamole and I was not disappointed! The steamed mussels those are a must try, the sauce was just one of the amazing parts this dish but dont forget to take a dip with that baguette because you'll be in heaven!! As for the decor and music they're perfectly meshed together creating a beautiful airy atmosphere that'll haveou coming back again and again. Oh dont forget the $3 draft specials too!", "pics": null}}, {"review": {"des": "Locating a seafood joint in land-locked Chicago can be a frightening endeavor. Fears of frozen & deep fried halibut are nearly inescapable, haunting the hungry journeyman (or woman) at every turn. Luckily, there is a safe haven, a harbor of culinary delight, and it goes by the name \"Fish Bar.\" <br>The menu is both inventive and classy, with a generous range of aquatic dishes. The libations are simple and delightful. The staff seems genuinely happy to work there - I remember getting into a friendly conversation with a waitress when we first arrived in Chicago as she gave us the lay of the land. They are all excited by the food and happy to inform you of their top choices. <br>This is perhaps my favorite date night spot, especially during warm summer nights. Be prepared to spend a bit, as it is not a cheap restaurant. I have always found the pricing fair for a top-notch seafood in the midwest.", "pics": null}}, {"review": {"des": "Went there a couple of weeks ago. Had the heirloom tomato salad, which was very unimpressive - didn't like it, and the po'boy, which was quite delicious. Also the clam chowder was good. The service was excellent - the staff manager even took our feedback on the tomato salad.<br><br>Overall pretty good - would like to revisit and try the oysters.", "pics": null}}, {"review": {"des": "Fish bar is one of our favorite spots in Chicago.<br>I like the decor as is simple and gives a good vibe. The staff always friendly and accommodating.<br>The menu is also simple which makes it easier to order and every item we have tried has been a success. They have an amazing Po'Boy which I always order because I can't get enough of it! The poke bowls are all great but tuna is my favorite. We have tried all their tacos, I advise to order whichever taco they have under special as it has consistently been the best. <br>Excellent place for a quick bite if you are around the area and also to meet friends. The outdoor area during the summer is very pleasant as well.<br>And if you have room you can enjoy the s'mores! it might be a silly thing but I find the idea of it very fun :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/W2TgsvdiKmirtnKBy12Ipw/348s.jpg", "caption": "Blackened mahimahi sandwich"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LbU2e6EMsqxSqqAiJU6xsQ/168s.jpg", "caption": "Satchmo Po'boy"}]}}, {"review": {"des": "Fish Bar is a no frills kind of place and I can appreciate that when compared to the super expensive restaurants like Riva or Joe's Seafood. I can personally recommend the clam chowder (quite creamy and delicious). The oysters are fresh and plump... and the fish tastes as though it were plucked from the sea the very day you order it.<br><br>The ambiance is ok. They're going for a \"shanty\" type feel with the large chalkboard listing the specials hung over the kitchen service counter... but the space is a bit modern and a little awkward with horseshoe seating dominating the center of the place and overshadowing small booths along the side. The hosts will steer you toward the counter seats if you're in a smaller party, but even the bar stools themselves are uncomfortable. I would ask to be seated at a booth. <br><br>The coolest part as an oyster lover is the late night $1 oyster happy hour. They run it from about 8 - 10 pm which, as far as I know, makes it the only game in town to offer a buck per shuck after 7:00. How best to exploit this wonderful concept you ask? Well I'm devising a $1 oyster crawl that will have you slurping bivalves from after work til bed time. Thanks for making that a thing, Fish Bar!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/o5xS7DTJlDmEBao-CQVr_Q/348s.jpg", "caption": "$1 oysters all day Sundays that were quite plump & tasty!"}]}}, {"review": {"des": "I was visiting my friend in Chicago and she took me to this place for a casual lunch. We both love oysters so win win! We sat outside. We shared two dozen West Coast and east coast raw oysters and I also had the codfish sandwich. Everything was really good. The oysters were fresh, juicy, and tasted of the ocean, everything you want you in an oyster. <br><br>The service good- our waitress was very friendly. I would definitely come back next time I'm in Chicago.", "pics": null}}, {"review": {"des": "First impression was that I loved the building. The color, the sign, the outdoor seating, I loved it. Inside is way smaller than I expected and totally has that New England feel. There is an interesting bar design where 90% of the patrons will seat. There is a small section of normal tables maybe 3. If you are a larger group I would definitely not come here. It would be hard to even sit in a row at the bar together. 2-3 people is best. <br><br>The Pros: the oysters, the cod sandwich, the clam chowder. Loved it all. It was amazing. <br><br>The Cons: 100% the stools. They were so uncomfortable. I wanted to stand up and eat that's how bad they were. I couldn't get comfortable the ENTIRE time I was there. The person I was with too complained about them as well. I witness another patron get up and switch stools with an empty one hoping that one worked better for them as well. (all stools seem to be a little different). I would HIGHLY recommend they invest in better seating. <br><br>Overall: Food great/seating bad. <br><br>And that's all I have to say about that. <br><br>Jackee", "pics": null}}, {"review": {"des": "Fish Bar has been on my list for a while as a place to try.  I saw it on either Check Please or Chicago's best and I was intrigued.  So I stopped there after work this week and I thought it was worth the praise.  They have a large outside area - which would have been perfect on a nice day, but I opted to eat inside at the wraparound bar.  <br><br>I started with a watermelon, jalapeno cocktail and it was really good.  Hit the spot on a warm day.  I then had the satchmo po'boy - filled with shrimp & crawfish, roasted garlic aioli, and pickles.  I really didn't notice the crawfish, but the shrimp and garlic aioli were delicious.  I would get this again.  It comes with a side of salt and vinegar chips - nothing special, but I love salt and vinegar.  I also had to try the angry tots - tater tots with a srichacha glaze.  I would have loved a little more srichacha to kick it up even more, but the tots were perfectly crispy.<br><br>Fish Bar is right by the hospital and Wellington stop so it's a perfect place to go for lunch or dinner.  I will definitely be back.", "pics": null}}, {"review": {"des": "4 stars for the quality of the food, but 5 stars for the excellent services. My friends and I came during happy hours from 8-10 P.M. for one dollar oyster. The oysters were not the freshest or the tastiest, but then again, it's only a dollar. It got the job done! Asides from the one dollar oyster, they also have daily specials. For instance, the trio tacos on Tuesday and the burger sliders on Wednesday, etc. We came on a Tuesday and the place was about 80% packed when we arrived, so I am not sure how long the wait will be during the weekend. <br><br>Parking was a bit tough and all of the neighborhood parkings are permit parkings, so be careful for that. Did I mention the excellent services? Anyhow, the staffs were friendly and helpful. One of the staffs recommended the taco trio and it was delicious, especially that guacamole. As for the oysters, there were only two types of oysters (East and West). Overall, yummy food, fantastic services, great company.", "pics": null}}, {"review": {"des": "Fish Bar undoubtedly ranks among the top 3 restaurants to visit in Lakeview. The inside is small, so if you can try to grab a booth or a table outside as the bar stools aren't very comfortable. As far as drinks go, I suggest going with a beer or Bloody Mary. The special drinks are a bit overpriced for the amount you actually get.<br><br>Now when it comes to the food....you really can't go wrong. Start with the tots or the calamari--angry style. Both are tossed in a fairly mild sauce which I would buy bottled if it was available. For the main course I've had the Satchamo Poboy, Fish Tacos, and the Blackened Whitefish Sliders. All are great. The poboy and the sliders are must get items. Both come with chips (which are okay at best) but both sandwiches warrant a 5 star rating.<br><br>Staff is attentive, food is good, Modelo's are $5...truly an all around great neighborhood establishment.", "pics": null}}, {"review": {"des": "Fish Bar has just became my favorite place for oysters and seafood in the Chicagoland. Parking is a bit difficult around this area since a lot of neighborhood parking enforces permit parking around dinner time.<br><br>The restaurant is a bit small, bar seatings mostly with a handful of booth seating that seats 4. Thus, I would recommend keeping your party size small when you venture here.<br><br>I was interested in the fish tacos but the waitress recommended the blackened red fish and I was very pleased with the recommendations. The sauce and fish was cooked to perfection. My friend got the lobster roll and that was yummy, too. We also got to try the west coast and east coast features for their oysters. Oysters are normally $3 each but if you come during HH (Mon-Thurs 8-10 PM $1 oysters) or $1.50 oysters all day SUNDAY! they do take reservations for parties of 3 or more. <br><br>Service was amazing and drinks were delish, too!<br><br>They do take your number down and call you if you are interested in waiting for a table. I like that service because you can stroll around the neighborhood while you wait for a table.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3phXgWhhaAXdj0RIRw2q3w/348s.jpg", "caption": "Taco Tuesday ($10 for 3)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UGa6Xp3KlHkHPgLh553kaA/168s.jpg", "caption": "$1 oysters happy hour Monday thru Thursday 8-10 PM"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/a470cATyv6dgU67nho4Acg/168s.jpg", "caption": "Drankss"}]}}, {"review": {"des": "Located in the Lakeview neighborhood, this restaurant serves up some really fresh seafood! I came here on a weekday, there wasn't a wait, but I'm sure on the weekends during lunch or dinner there def could be a wait, mainly bc the restaurant is smaller and can't fit as many people. I ordered the satchmo po boy which is battered fried shrimp and crawfish on a delicious, buttery bread  and the clam chowder which is very good- I typically don't like clam chowder to be very thick, however, FB's clam chowder's consistency wasn't too thick, so I loved it. Def a place to try!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/E1uviRwgKRuDYF84xD-qJA/168s.jpg", "caption": "Clam chowda :)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EX1UyGnhEoaYO5zfQU7Ziw/168s.jpg", "caption": "Satchmo po boy, get it!!"}]}}, {"review": {"des": "Came in for lunch and was very surprised at the small size. There are three 2 person booths with the rest of the seating being individual bar stools. Parties larger than 4 people need not apply. Kristin was incredibly helpful, perky and friendly and answered any questions we had regarding our order. I got a lemonade the gumbo and poke bowl. The lemonade was crisp and delightful. The gumbo came out immediately and was a bit on the cool side (could have been a few degrees warmer). The Poke bowl was fine and the price was pretty standard for other places. When I go back I will definitely get something more traditional to their fare as opposed to the trendy poke. We also got a cup of white clam chowder that was also on the cook side and the shrimp po' boy. All in all a pretty good experience. Not on the cheap side. We easily went upwards of $60 for lunch for two. I'll definitely be back!", "pics": null}}, {"review": {"des": "This is a limited review as I only got the Blackened fish sliders for takeout. Overall, I would rate this 3.5 stars as the food is good but quite expensive. <br><br> To start - the service was fast and professional. I believe I got my order within 15 minutes. The sliders were pretty good! They had a nice kick from the blackened crust, and the buns themselves were nice and soft. The food seemed fresh and warm, like it just came out. The sliders also came with a small side of chips. <br><br>However, at $10, these were absolutely tiny. When I got the bag, I honestly thought there was nothing in it at first. The fish inside was a decent chunk but definitely not $10 worth.<br><br>I would 100% come back to try some of the other food here and see how that is. The po boy looks great! Overall, the flavors are good but the prices are a little high for what you get.", "pics": null}}, {"review": {"des": "Not a big fish type of person but this place is the right spot if you're feeling like a pioneer!", "pics": null}}, {"review": {"des": "Terrible and over priced. Paid 24$ for the lobster roll and you couldn't even chew it. Paid another 10$ for a glass of wine that was the size of a kids sippy cup. Fish was too fishy tasting and server seemed very intolerable.", "pics": null}}, {"review": {"des": "Super small place, but a huge patio! Great cocktails. $1 oyster happy hours during the week til 6. The homemade chips are amazing!", "pics": null}}, {"review": {"des": "Great food! Very cute inside. The food was super good. We got a lobster roll and some oysters, and everything was delicious! Will definitely be back", "pics": null}}, {"review": {"des": "Our last meal before we headed home from the pride parade. We were seated quickly and with a smile. Our waitress was awesome even with all the commotion going on in the restaurant and outside. There was a woman having a stroke in the restaurant and then a car accident outside. I know! There was a lot happening! Thank god everyone was okay. But food and drinks eventually came out and everything was awesome! Will be back again!", "pics": null}}, {"review": {"des": "Came back to try the Lobster roll and Salmon tacos which are season specials. Both were DELICIOUS - the lobster roll had legit portion of meat itself, while the salmon was very well seasoned and blended perfectly with the taco tortilla. The taco dish also has chips and guac on the side. Service was good most of the time but felt a little rushed.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mnWNQPu9q0NpWI5GEsd21A/348s.jpg", "caption": "Salmon tacos and Lobster roll"}]}}, {"review": {"des": "Fish bar has always been one of my favorite spots. I've ordered it as a pick up order a few times and had to go back due to the order not being correct. However, they did correct the mistake quickly and they gave away free drinks for waiting! <br><br>However, upon my most recent visit I was really disappointed to hear they got rid of the hush puppies! Not sure why they decided to do that as they are obviously a crowd favorite. I seriously hope they bring them back!", "pics": null}}, {"review": {"des": "My husband and I came here on a cold Sunday night after Christmas shopping. It wasn't very busy and we sat at the bar. The bartender was sweet and attentive and offered good recommendations. I started with the clam chowder soup and it was delicious. I just wish it had more clams. For my main course I had the mussels. They were also delicious and not too grainy. My husband had the shrimp po boy and it was really good. Overall good experience and we would definitely come back.", "pics": null}}, {"review": {"des": "At first it feels like a small authentic bar with some seafood, but it is actually part of a chain. You realize this once you get back the fifth time and all the staff members act awkwardly same and ask you if you are here for the first time. In any case - food is great and oysters are always fresh, beer and cocktail selection is nice, the atmosphere is also great. Patio is not that awesome, because of the proximity to the road.", "pics": null}}, {"review": {"des": "Awesome food, great drinks - had their draft cider rose which was outstanding! Kristen is great - knowledgeable, friendly and provides great Srvc. Had the cod fish sandwich, some oysters and the whitefish sliders - all fresh, well seasoned! Will come back.", "pics": null}}, {"review": {"des": "This is one of my fav hidden gems! The hot mess is so great! It's enough for two people. It comes with whatever fish is in stock (crab, shrimp) and then potatoes, corn and sausage. The sauce is amazing and has a spice to it. The drinks are handcrafted and absolutely unique and fabulous! Pretty strong too! The place is so cute, and you can sit at the bar which has a unique shape, or at a table. They also have an outdoor patio. It's a cute place with great food and drink! The servers are always so happy and polite!", "pics": null}}, {"review": {"des": "Hm. 2 out of 24 on my Oyster Trail<br><br>Ordered: White Stone (VA) oysters, <br><br>SERVICE: The server was very upbeat and sweet, but she couldn't make up for other disappointments with this establishment. <br><br>FOOD: The gumbo was lukewarm. Now, I work in food service, that's an easily rectifiable problem. Just pop it in the microwave. This really could have been avoided. <br><br>The oysters were Virginia oysters, and they were a little blander than other VA's I've had. Very characterless and very mild, very little brine, very little flavor. That said, the cocktail sauce/horseradish mix was some of the best I've had a a while. The mix gave the oysters a little more kick than they had. <br><br>DRINKS: We only ordered the Fish Bar Punch, which was very watery and practically nonalcoholic. Now, I probably should have known by the fact that it was only $6, as opposed to the $12 and $11 dollar counterparts. But if you will name a drink after the establishment, it should be more representative of the brand you wish to portray. <br><br>Maybe I'll give it another chance at some point, but for now, I'm good.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SlrGvzsJvSpUOo1bnOuJ3w/348s.jpg", "caption": "When we walked in. Very cute establishment in terms of appearance"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/S6XKiLtPC_q8j-PzDtog-g/168s.jpg", "caption": "The Happening Menu (happy hours, specials, etc)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8rxztn20PeiS8sSysLD4Zw/168s.jpg", "caption": "The Fish Bar Punch"}]}}, {"review": {"des": "Honestly, the only downside to this place is how small the space is. But it's hipster paradise: mason jar cocktails, anchors draped everywhere, and chalkboards e'erywhere. <br><br>I could live off their fried lemon rings. So sad it's a seasonal menu item. <br><br>Mondays-Thursdays after 8 PM are dollar oysters, btw.", "pics": null}}, {"review": {"des": "The seating in Fish Bar is like a bar that wraps around the entire restaurant, with some tables on the side. We were directed to seat where we would like and the waitress came up to us. There are oyster crackers, sauces, and utensils every few seats on the counter. They have a variety of seafood dishes such as lobster rolls, po' boys, tacos, and oysters. They also have fish of the day specials.<br><br>My friend and I came in on a Tuesday for lunch when they were not busy. We ordered the market fish tacos, which on that day were blackened cod. The portions were not indicative of the price. For ~$9, we received two very small tacos. It was served with peppers, salsa, guacamole, cilantro and jalapenos. The jalapenos made the tacos so extremely spicy that I had to remove them. The fish was fresh and well seasoned, but were hidden under the spice of the jalapenos. The guacamole tasted a little watered down.<br><br>Looking at the pictures from other Yelpers, the food looks very appetizing. If the prices were cheaper, I would come back and try other dishes.", "pics": null}}, {"review": {"des": "Everything was delicious and fresh!!<br><br>Try the spicy calamari and the clam chowder, you won't be disappointed.", "pics": null}}, {"review": {"des": "Longtime listener/eater/drinker: <br><br>My favorite part: Ideal for a date night. Yes, the mostly counter seating makes it small, but it thrives on that intimacy. With their Catch of the Day, rotating beers, etc this place is always reinventing itself, so you can't really outplay it. <br><br>On service: On our last visit we had Kristen. She was warm, conversational, let us know about industry night (mondays) & is the reason we felt compelled to finally leave a review. At one point, she even bought me an oyster simply because I had never tried one before, and now I'm a fan. <br><br>Our order: we always get the clam chowder soup & a large order of Angry-style calamari. <br>Last night we got the \"Hot Mess\"- appreciated the suggestion because it was a delight! Perfect to share. The shrimp was HUGE, generous portions of potato, sausage. <br>The s'mores dessert also adds to that date-night factor because they give you mini-grills and a cute spread. (We loved it so much, we even ordered a grill online so we could have one in our home!)<br><br>Location: Lakeview can be a headache sometimes but I've always found parking quickly. They are also connected to DMK next door, so if you can't find seating in fish bar,  that place is a prime backup because those burgers are phenomenal! It's a win if you end up at either place.", "pics": null}}, {"review": {"des": "Based purely on the oysters. Came in on a weekday around 8:45. Happy hour is Monday to Thursdays 8-10 and oysters are 1 dollar!! They have oysters from the east and west each night. The night I was there, they had Sweet Petites from PEI and Midnight Cove from WA. The Sweet Petites were more briny, while the midnight cove were more sweet and buttery. They give you two sauces, a cocktail sauce and a vinegary sauce. They also only gave us one lemon for 10 oysters, ask for more!! Overall, service was great and the oysters were fresh so I was satisfied and would definitely want to come back to try more!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Vs0nQA-83vDIbSNikpkS1w/348s.jpg", "caption": "Sweet Petites - PEI  (top) and Midnight Cove - WA (bottom)"}]}}, {"review": {"des": "Every single bite & sip was fantastic. This place absolutely knocks it out of the park. Our service was wonderful, the drinks are the delicious, and the specials are ridiculously good. Do not sleep on this spot!!!", "pics": null}}, {"review": {"des": "I'd give this place 3.5 stars if I could. The food was good but a little expensive for the portions and what you get. <br><br>I got the lobster tacos. The tacos are pretty small for $14. <br><br>We split the calamari appetizer. The calamari appetizer is tiny for $9. <br><br>My friend ordered the maki bowl which was so good. A little spicy but tasted very fresh.<br><br>Loved the drinks - You're my Boy Blue was super refreshing and had a good amount of gin.<br><br>The service was really nice and friendly. Everything came out pretty quickly. <br><br>Not the best bang for your buck or the most amazing food I've had in chicago but a decent experience.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-xHHO_ZNC2uuCmV3W40-xQ/168s.jpg", "caption": "You're my boy blue"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/q7GOU5c10MuYxPimytxuJw/168s.jpg", "caption": "Lobster tacos"}]}}, {"review": {"des": "Came here with 3 friends. Everything we had was delicious (fish tacos, poke bowl, crab and drinks). Very good service and good atmosphere", "pics": null}}, {"review": {"des": "We've been wanting to come to the big blue building for months. Finally walked by a popped in. Sat at the bar bc tables were reservation only. No backs on stools but they were kind enough to give me the one chair with a back!<br>Tacos were delicious but with that price could have used one more (you get 2). I'd definitely recommend this place. Cost is fine but not inexpensive. Server was flirty but also okay with it because more attention means better service (sometimes)!", "pics": null}}, {"review": {"des": "Fish Bar is on the new fancy-schmancy UberEats app and I've been wanting to try them for awhile. Use Code FISHBAR for $10 off your first order from Fish Bar through the app. Somewhere I've been wanting to dine plus a coupon? I'm on that stat!  <br><br>The cod fish sandwich at Fish Bar is pretty darn tasty. Of course it's deep fried, but it's done well - nice & crispy. The fish is then topped with cheese and their special tartar sauce packed with a punch. Loved this sandwich.<br><br>I also had the hushpuppies for 5 buckaroos. Great deal for a big ol' load of these round little guys. Deep fried with andouille sausage and jack cheese give these a spicy kick, as well. But they come with a garlic aioli sauce that balances it out quite well.<br><br>I enjoyed everything I had from Fish Bar and have big dreams of dining in to try more on their menu.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6_nyNV19_vxiJLLyWtnxfw/348s.jpg", "caption": "Cod Fish sandwich"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jNp_KqF2Nr4Ph5Bw3zCicA/168s.jpg", "caption": "Cod Fish sandwich"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BBXIJdoLVja5q_nOv-0AOA/168s.jpg", "caption": "Hushpuppies"}]}}, {"review": {"des": "Our experience wasn't the best, but this spot did everything to redeem themselves.<br><br>Basics on the food:<br>By the way. <br>oysters: fresh, juicy, nice taste. Sunday deal: 1.50 per oyster, rather than the regular $3. Thumbs up on that!<br>Lobster roll: One of the best lobster rolls I've ever had. Not your usual mayo, cold meat roll.  This was juicy. A split-half of a lobster tail. Juicy, kind of with a lime sort of dressing. Just fat meat all over the place, and even the roll was good; the bread was sweet like Hawaiian bread. No celery. Just bite after bite of lobster goodness.<br>Smores: Has to be enjoyed inside (not on the patio) because you get your own mini bonfire to cook your marshmallow. The chocolate is more of just a smear. The graham cracker is soft. perfect to share for two.<br><br>Our experience:<br>On a Sunday night, we experienced a 30 min. wait, whether we wanted to eat in or on the outdoor patio. The interior was pretty noisy.<br><br>They will either serve you as items are ready to go, or they can do the traditional, holding everything until your whole order is complete.  We opted to just keep-it-comin. We really had a lot of issues with timing, though. My girl friend ordered the clam chowder and a lobster roll. I opted for some oysters and a lobster roll.  She got the chowder, which she liked. She said it was pretty hearty, and the meat was pretty big on the clams.  I received a lobster roll first, but it took over 30 minutes before she received hers (and even after a couple of inquisitions with our waiter/waitresses.) <br><br> I got my oysters, and only received 4 out of 6.  I got 2 east coast, 2 west coast, and i wanted 3 of each.  After asking about the remainder of my order, I said \"hey. can I just get 4 more east coast, if the remainder 2 aren't already shucked.\" 15 minutes later, I was presented with a tray of 12. I hoped that this wasn't someone else's order... it seemed like whatever food ends up on the line, the waiter/waitresses just run it out to whichever table.  So I asked them to double check it was my order, and not someone else's.  I ended up getting the rest, and I was charged for only what I ordered, and got to keep the rest.  We also had a water escapade, where my friend got served a glass of water and I didn't.  10 minutes later, I asked for water, and my waiter said, \"Oh I was going to give you one, but I ran out of glasses.\"<br><br>Just a lot of miscommunication.  however, the manager came out to speak to us. She was very attentive, patient, and understanding.  We explained our waiter was very nice, and we loved the food.<br><br>She took care of us, encouraged us to come back and dine at other spots, and the smores we ordered became complimentary. We really weren't too upset, because the food was really good, only that service was kind of slow and splotchy.<br><br>Despite all this, we'd definitely be back! It's straightforward good food. Parking might be a little difficult, but the flavors and vibe were very on-point. I'd recommend no more than 4 in your group.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2XpChWIjvkJbZSmLUDauDw/168s.jpg", "caption": "Smores"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9ayP1qNLmVWNOMTI8XkBtA/168s.jpg", "caption": "Oysters"}]}}, {"review": {"des": "Came here with my roommate on Friday night around 7. Fish Bar is not very big so we had about a 45 minute wait for the two of us. Most of the restaurant is counter seating surrounding these two bar areas plus a couple booths on the far side. Atmosphere is pretty chill and would be a good place to take friends or a date.<br><br>Beer selection was just okay but their special on tap was 4 Hands Brewery's Absence of Light so I opted for that (beer tastes like Reese Puffs, no joke). For food I ordered the crabby patty sandwich and some angry tots (covered in Sriracha mayo). Both were outstanding! The crab cake was massive and greatly satisfied my hungry stomach. Tots were much spicier than I anticipated which was great!<br><br>Two thumbs up! Would definitely go again.", "pics": null}}, {"review": {"des": "First - I am a little skeptical of a shellfish restaurant that distributes food through Door Dash...<br><br>Second, I ordered oysters on Sunday (my fault) but they were the most appetizing items on the menu. They were questionable. <br><br>This place could be a burger bar (and the place next door is, by same proprietors), a salad bar, a Mexican place, a pizza place -- and it would still be the same place. No ambiance.<br><br>Last, don't look at me like I am crazy if I ask for drawn butter.", "pics": null}}, {"review": {"des": "My boyfriend and I used to live right around the corner from Fish Bar and we went here a lot for our date nights. It's definitely a pricey experience but if you want to do something fun and special, I highly recommend Fish Bar. An important caveat: If you're not into seafood, you can still get a few things here but maybe move along to DMK next door. <br><br>The drinks menu at Fish Bar is awesome from top to bottom. This is where you'll spend all your money. Foodwise, here's a tip: If you want to make sure you leave full, order the crawfish po'boy. It's tangy, crunchy and filling. I love the oysters selection here. The tacos may seem like the \"wrong\" thing to order given the other exciting options but I promise you, they're great. The waitresses are so friendly and maintain a cool, low key party vibe all day and all night. Awesome place for a date or for catching up with old friends. <br><br>The only critique I have of Fish Bar is a very theoretical complaint. Somehow, you always leave wanting more. I don't mean that you're still hungry (although that's a distinct a possibility if you don't order enough) but there are so many flavors and fun things here, the rotating menu can really leave you heartbroken. <br><br>Fun + yummy. Go here.", "pics": null}}, {"review": {"des": "I ordered the cod sandwich for my daughter, to go. The customer service was great and the ambiance in the place was incomparable. My daughter loved the sandwich.", "pics": null}}, {"review": {"des": "I have mixed feelings regarding \"Fish bar\". For one the prices are on the higher side for what appears to be a casual restaurant. Secondly the bacon on my lobster sliders was some of the driest & hardest bacon I have ever encountered. It could quite possibly be due to the fact that I got the food to go but I sure as hell won't let that be an excuse. I will say that the portion of lobster on the sliders is generous but other than that it sucked. I also feel like the overall portions of food are on the smaller side for what you pay for the food. The shrimp & oyster po boy \"satchmo\" was the highlight of my meal. It was pretty awesome & similar to the one at \"\"Nana\" but if eaten alone you'd still be hungry. The two entrees came with some chips that were decent, nice & crispy. Overall I'm sure I'd return because they're open late & I'd like to try the tacos but this isn't an establish I'd break my neck to return to.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2ZWrxOdMZkGAVRGFtGEVpw/168s.jpg", "caption": "Shrimp & oyster po boy \"satchmo\""}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/frEOoXtXCGq6OS1SB6Anrw/168s.jpg", "caption": "Lobster slider with the terrible bacon"}]}}, {"review": {"des": "Great neighborhood bar near my Air bnb. Nice cozy spot with super friendly staff. Delicious appetizers, like the rock shrimp, hh oysters and lobster roll. Even had poke available, but didn't try it this time. Drinks came in jar glasses. We will definitely visit again.", "pics": null}}, {"review": {"des": "Fish bar has a great vibe. I honestly wish I could give it 4 1/2 stars. I just can't bring myself to give it a five because it's overpriced for what it is. It goes for a fake hipster casual vibe which I'm into. But for the amount they charge my wine shouldn't come in a jam jar. The oysters are consistently great. The waitress fucked up so she gave us free oysters which I always appreciate. I'll forgive a mistake if they acknowledge it and throw some free food are way. The calamari was super great, but we got it federal hill style which means it came with a ton of sautéed peppers. The peppers gave the calamari a great flavor but for the price point there should have been more calamari and less peppers. The lobster roll was great. I also really appreciate that they do a hot butter lobster roll and a cold mayo one. At the end of the day this is a great place if you don't mind being slightly overcharged. It's hard to fulfill your cape cod desires in Chicago but this place does it.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XVVyWSRYHTQcbrZB8Y_JpQ/348s.jpg", "caption": "Federal hill style calamari"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/w4zdeJDa-u_cCtD4Vqf9wA/168s.jpg", "caption": "Hot buttered oyster roll"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tNeIqY6XZtLcSw13Wwlsuw/168s.jpg", "caption": "East and West coast oysters"}]}}, {"review": {"des": "We were craving fish and the oysters and salmon tacos were fantastic! When ordering a cider, our waiter came back saying they were out of that and brought us samples for the new cider they put in. By the end of the night, we realized on the check that we were charged for the sample, which is pretty strange since we didn't even ask for it. We also didn't ask for a birthday treat, but they brought out one anyway and then charged us for that too. Obviously not the best service, but great food so still worth it!", "pics": null}}, {"review": {"des": "Came by yesterday for lunch; cool space, and I love the three small booths just to the left of the entryway.  We had the slider platter, the tater tots, the hush puppies and a bowl of the clam chowder.  While the sliders were rich as hell and generally tasty, they weren't necessarily memorable.  Same for the tots.  But the hush puppies and the chowder were fantastic.<br><br>Prices are fair here if you come in knowing you are basically getting fish tapas.  Even with the slider platter (three for $12), I don't think I could have made that a meal on my own, although my wife guessed she could if she had a snack before walking in here for lunch.<br><br>Didn't try the cocktails, in part because after I get lunch in this part of town, I always chase the food down with a shake from DMK.  So, I did it again!<br><br>Also--a la card Chicago's deck for 2017 has Fish Bar as one of the options, so be sure to save your $10 here as well.", "pics": null}}, {"review": {"des": "Oyster Hour from 8-10pm weekdays! <br>However, the west and east oysters were just okay. The condiments are in ketchup paper holders and only one lemon wedge came with them. Presentation was also just okay. <br>We ordered the angry fries - yummy! <br>I ordered the drink \"love like a sunset\" which was pretty and tasty (more please!)", "pics": null}}, {"review": {"des": "If you're thinking the portions coincide with the prices here you're going to be spectacularly disappointed. Ordered the lobster roll and the blackened redfish dish. Roll was $23 was the size of a small taco and came with a handful of chips and cole slaw. Couldn't really taste the lobster and it was way too chewy which made a sub-par sandwich. <br><br>The fish was about the size of a 2 Oreos put side by side. It was ok and came with 2 spoonfuls of sauce along with 3 small potatoes for $9?<br><br>If you're looking to satisfy your hunger this isn't the place. I ended up making the roll better by taking out the lobster and adding in the fish with the slaw which made it delicious.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wq3u5CsxGKU2bXwW-1TQ9A/168s.jpg", "caption": "Lobster roll"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2xYgW6ctr9y_GFzllbb80A/168s.jpg", "caption": "Blackened Redfish BEFORE eating"}]}}, {"review": {"des": "Wow! I was pleasantly surprised by Fish Bar! It is located in Lincoln Park just off of the Wellington Brown Line Stop on Sheffield and Wellington. <br><br>The seating is set up in a 'W\" shape, mostly bar seating, and there's a good amount of space to sit and enjoy the food.<br><br>I came in last night for a small girls night, and we were elated to find out that after 9pm, Mon-Thurs they have $1 oysters. Score! Our server was incredibly friendly and knowledgable about everything on the menu. I am a New Orleans girl, so i LOVE seafood, and this place for sure hit the spot for me.<br><br>The oysters were divine, however I wish they were served over ice, didn't ruin it for me though. I had a dozen on my own, so fresh and tasty. I also ordered the Kentucky Mule to drink, DANG, it was hella strong and delish!<br><br>For my entree I ordered the Lobster tacos, they were cooked to perfection, the Lobster was soft, not chewy and seasoned perfectly, also the sauce ang veg over it were incredible and very complimentary to the lobster.<br><br>For dessert, we had freshly cooked Smores! Whhhhaaaaaaaattttt? They bring you a mini fire torch to your seat with marshmallows and graham crackers and you cook your own smores, so amazing, I only wish they had given us chocolate bars instead of the chocolate spread on the graham crackers, the second the hot marshmallow hit the cracker, there was chocolate dripping everywhere and it was soooo messy, but delicious.<br><br>This is my new favorite spot and I will for sure be back!!", "pics": null}}, {"review": {"des": "Fantastic happy hour oyster deal, beer selections and overall seafood menu! Apart of the DMK company, which is next door.", "pics": null}}, {"review": {"des": "Great place, great service, and amazing food. Oysters were very fresh! Loved the coco loco cocktail as well. Server was very knowledgeable about the menu and answered every question with charisma and character! Very personable and will definitely be coming back.", "pics": null}}, {"review": {"des": "Read about this place on <a href=\"/redir?url=http%3A%2F%2FChicago.Eater.com&s=d89de10b735c9b1e1f514ca2068304f2412be3cdf4cabcc4fa7bc5b6d3edaeb2\" target=\"_blank\" rel=\"nofollow\">Chicago.Eater.com</a> as one of the top lobster rolls in Chicago.  So, yes - expectations were high but even if they weren't this was very disappointing.  The lobster was rubbery and chewy and both my wife and I had a good amount of cartilage running through our servings.  The lobster was also nearly tasteless, severely overpowered by far too much dressing on the lobster bun - the dressing was all we could taste.  The staff is very friendly and warm, but a bit too chatty with guests to provide good service.  There also seems to be a LOT for servers to do and they seemed to be in a constant state of \"catching up\".  We each had a lobster roll, and 1 drink each - my second beer (that I ordered as our food arrived) did not arrive until after we were finished eating, so I no longer wanted it and they took it off the bill. I also had three oysters - all told, $81.00 before tip - a pricey mistake.", "pics": null}}, {"review": {"des": "Hooked by the decor, reeled in by the promising reviews, but my heart sank. <br><br>Fish bar was such a disappointment, I'm not sure what went wrong.  <br><br>The seating is just that - a bar, but the space is so small that you feel like you're eating on your neighbors. For some this is ok, for those of us who don't want to share intimate conversations with you, your friends, and the waitress, couple next to you and fry cook, you may want to pass. <br><br>I ordered the shrimp tacos which made me feel bad for the shrimp. There were about 3 per taco, less than the size of a quarter and drenched in so much sauce/lettuce that I could barely discern their presence. <br><br>Service here was also abysmally slow, which we couldn't wrap our head around because there were no more than 10 people in the restaurant. <br><br>I will cast my line again and look elsewhere.", "pics": null}}, {"review": {"des": "Love this place! The food is delicious and farm to table. Came here with my family and sat outside. The wait staff was very kind and helpful in deciding what to order. Would definitely come here again for the tacos and for the Krabby Patty!<br><br>Pricing was very reasonable and you can enjoy a flavorful, healthy, fresh, and unique meal at this cute restaurant off the wellington brown line.", "pics": null}}, {"review": {"des": "Just had a delicious lunch at this restaurant!  The lobster Bisque, Lobster Sliders,and Lobster Tacos were all delicious.  The \"Angry\" Tator Tots (covered in siracha mayo) were good as well. Inside and outside eating which was great for a beautiful Chicago day.", "pics": null}}, {"review": {"des": "CHICK-EN FRIES! You MUST order the chicken fries. If you're smart, you'll order two. They are delicious slivers of joy that you dip into probably my favorite tarter sauce on the planet (and I am NOT a fan of tarter sauce-but I am a fan of Fish Bar). Super sweet staff who are always friendly and give good recommendations on pairing your food and drink. I am not a shell fish eater so I mainly come for the Cod fish sandwich and the chicken fries. I have yet to have dessert but please note that if you order the s'mores (from the summer menu), you'll need to make them indoors. You cannot sit outside to make the s'mores (complete understandable with fire codes and such).It's a great place to grab some lunch with a friend and just catch up or have a simple date or dare I say... to eat alone. Company or lack there of, you should just go.", "pics": null}}, {"review": {"des": "First time at DMK fish bar. The ambiance is a relaxed casual cozy fish bar on the corner. I wouldnt suggest coming in with larger parties but if the occasion calls for small plates of East coast inspired seafood then this is your place. As far as the food goes, stick to the brothe plates as the flavors were wonderful. I wish the same could be said about the calamari. Nothing to ride home about, was lule warm and the batter had no crunch to it. Had at least 5 other options that fell into the \"just ok\" category. Ended off on a good note with the key lime pie it was great. Ps skip the fish tacos, nothing crazy. Server was cool though,", "pics": null}}, {"review": {"des": "Food was ok. THE SERVICE SUCKS. <br>Gaby the \"manager\" told me that 3 people were gonna sit by the bar.  So a booth open up...she gave the booth to the 3 people who were at the bar already,that she (gaby) originally said they were sitting at the bar. Gaby apologized to me,try to buy me with beer tickets,BUT NEVER GAVE ME MY BOOTH THAT I WAS WAITING FOR. <br>WOULD NEVER GO BACK THERE!!! <br>suuuucccckkkkssssss !!!' SHE'S THE MANAGER!!! <br>JOKE!!!!!! FUCKING JOKE", "pics": null}}, {"review": {"des": "I recently moved in within walking distance of Fish bar and finally got a chance to check it out.  I have already been to their burger bar next door as well as Henry's in River North, and like DMK's other place, Fish Bar did not disappoint.  They had a small patio outside but we sat inside at the bar and our server was very attentive.  I don't eat seafood so I had the crispy chicken and thought it was very good.  My boyfriend really enjoyed his redfish sliders but thought the clam chowder was way too salty.  Also, we got a chance to split the chocolate banana bread pudding for dessert and it was delicious! I ate every bite.", "pics": null}}, {"review": {"des": "Wife and I go here quite often.  Great neighborhood spot.  Laid back and patio seating during the summer is great.  They usually have a solid beer selection as well.  Pretty much all of the seafood is good. Calamari, and clam chowder are staples.  Get angry style if you like spicy.  Can't go wrong with the lobster roll.  It's expensive but very good.  Sliders and tacos are also pretty solid.  Seafood is much better than you would anticipate for the location.  But it is run by the owners of DMK so can't go wrong", "pics": null}}, {"review": {"des": "My friend had a strange and intense craving for oysters...so we searched around and found Fish Bar! $1 oysters 9pm - 11pm on mon- thurs, and $1.50 oysters all day on Sunday. Unfortunately, we got there at around 9pm on Sunday and they were sold out of oysters. Seeing how visibly disappointed my friend was, the manager actually sent us a ceviche appetizer on the house which was very nice of them! 5 stars for the service here. <br><br>For the food - my favorite was the calamari. They toss it in pickles and banana peppers so it's definitely something you cant find anywhere else. I also liked the lake trout fish tacos a lot.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mL-OCGJqYWG6qWkmTUL6BA/348s.jpg", "caption": "Calamari!"}]}}, {"review": {"des": "Rosa J.'s verdict on this trendy joint next to the gloomy hospital: 4.5 stars!  <br><br>Daddy wanted to try out different restaurants in town because he has been following me on Yelp.  I will be using him as my \"Yelp buddy\" for the time being so that I can clear as many ever-accumulating bookmarks as possible.  <br><br>Once getting from the CTA Wellington Brown/Purple Line station, we walked one (1) block west to Sheffield.  \"Fish Bar\" was the sky-blue building across the road from the Advocate Illinois Masonic Medical Center.  <br><br>The special menu items were quickly explained by a sunny-smile young man.  Daddy spotted the beer menu and immediately showed his interest in trying one (1) of the local and Midwestern-region specialties.  The young man suggested the \"Founder,\" brewed in Grand Rapid, MI.  His recommendation was right on the money.  The \"Founder\" had a very prominent barley aroma.  It had a \"bitter\" initial kick, yet the \"sweet\" after-note was soon released to complete the experience.  That probably was one my favorites I've ever tasted so far in my foodie life!  <br><br>We eventually made our decisions: gumbo, fluke sashimi, and six (6) east-coast (from Virginia) and west-coast (from Washington) kinds.  The gumbo came in first.  While it didn't skimp on seafood, the flavor wasn't as extraordinary as I anticipated.  I felt that was missing a wow factor and it wasn't that memorable.  <br><br>However, the sashimi was delightful and refreshing.  The touch of \"yuzu\" sauce with scallions was nice.  The portion was on a smaller side, but it served as a \"transitional\" dish to the protagonist: the raw oysters.  <br><br>Their oysters were very fresh (perhaps off the boat)!  I preferred the east-coast oysters, for they were larger in size and accompanied more harmoniously with the garlicky cocktail sauce that came with.  <br><br>Reiterating on the beer one (1) more time, the \"Founder\" was delicious!  Dad and I shared two (2) mason jars worth of beer and were very satisfied.  By the way, the total came to $64 and some change (pre-tip).  <br><br>Dad said he wanted to come back for lobster and other menu items next time, and I said I would certainly concur with him.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8MhcoIbc6cXqCXsddBUuNA/348s.jpg", "caption": "Oysters"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YzusXYPh8Si6DXvf67uqDA/168s.jpg", "caption": "Fluke sashimi"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZU7xXdiSYIsRWLqhbD9mbg/168s.jpg", "caption": "Gumbo"}]}}, {"review": {"des": "The food and service were great! The drinks were also so refreshing and the amount of alcohol in them was perfect lol. I would defintley recommend this restaurant if you're looking for fresh fish and good drinks!", "pics": null}}, {"review": {"des": "100% honest.  The only reason we came here was because our realtor gave us a Gift Card.   We had been to MK (6 yrs ago?   Lovely meal) and enjoyed DMK in Lombard a time or three, but never thought to seek their them out otherwise.  We enjoyed Ada but didn't realize they were part of the same group.  <br><br>Fish Bar has lively city patio, great service and yummy seafood for a very reasonable price . <br>We thoroughly enjoyed the Blackened Salmon Tacos and the Lobster Roll.   Our plates were cleaned!!   That usually never happens.   2 entrees plus 2 drinks... $50.00. Pretty amazing for the quality of seafood and experience we had.", "pics": null}}, {"review": {"des": "The seafood here is fresh and delicious. Yes, the portions are smaller, but the quality is excellent. I had the shrimp and crawfish po' boy with a side of hush puppies. The bread, the perfectly seasoned and crispy seafood, and the PICKLES on the po' boy was so tasty. They need to offer these pickles as a side dish. So good. Ask for extra. The hush puppies weren't my favorite. They were a bit too salty, and the flavor was just OK.  I'll be back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7goVLAOqxv_b-QJ427mKDQ/348s.jpg", "caption": "Satchmo Po' Boy  Shrimp and crawfish"}]}}, {"review": {"des": "Was so excited to try this place. Kinda disappointed <br><br>Our server was super friendly and all the food came out in a timely manor .<br>However , for the price, the food just didn't hold up . Small portions with mediocre flavor . Nothing special . Can't even list my favorite thing because they blend . All I can say is there are way better seafood places in the city to go to .", "pics": null}}, {"review": {"des": "Staff is lovely and the decor is fun: my problem is with the food.  I had the  Banh Mi, which was described as shrimp, IIRC.  What came to me was ground fish patty of indeterminate type quite literally swimming in 'sweet & spicy mayo'.  The sandwich was incredibly messy and difficult to eat without ending up with what had to be 3 heaping tablespoons of spicy mayo all over me.  The spice level was so high I could hardly taste the sandwich for all the heat.  Were it not for the mayo or the daikon/carrot slaw I would've questioned whether or not I got the right sandwich.  Really disappointing.", "pics": null}}, {"review": {"des": "Overall: Great tasting fish and a great casual atmosphere. Just not cheap and not incredibly hearty. <br><br>The good: The food is delicious and fresh. The service was very good, friendly and knowledgeable. They had a good selection of craft brews and even some wine.<br><br>The bad: The music was too loud inside. The prices are kind of expensive, especially for the portion sizes that you get. There's limited seating, especially if the outdoor area is closed. <br><br>Atmosphere: 8/10<br>Service: 10/10<br>Food: 8.5/10", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qURm6zSmpUSLqn7sYPGP4w/348s.jpg", "caption": "Grilled octopus with lentils and squash"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XE3-kJbHyXLJ_Xvr9ntQEQ/168s.jpg", "caption": "Fish sliders"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7ukBPz-EOzT6EjvtOiZ2ug/168s.jpg", "caption": "Red fish tacos"}]}}, {"review": {"des": "I wanted to like this place, considering it's right down the block. I ordered the 'Satcho Po Boy' which is literally the smallest po boy I have ever had - more of a roll than anything else. It's like ordering a sub sandwich and having your \"sub\" come out on a hotdog bun. The food is ok, but the prices are terrible. Not good at fish, not much of a bar either. The service never gets around to filling your drinks because they are too busy flirting with each other or texting. There are plenty of other options in the neighborhood that you should try.", "pics": null}}, {"review": {"des": "I'm a bit sad that I have to give one of my favorite restaurants a 3 star review. I've always had a great time at the Fish Bar. They typically have the best ceviche and po'boys. But on my most recent visit on a Tuesday afternoon, I was extremely disappointed. Not sure if there's a different cook for the weekday afternoon shift or what but the food definitely didn't live up to the greatness I've e experienced on many separate occasions. <br><br>We stopped by for a light meal and ordered our favorites the calamari and a clam chowder to start. The calamari came out soggy and not crispy due to the wet peppers. The clam chowder was like warm at best. It definitely didn't taste as fresh as normal. We stopped ordering after that since we didn't want to pay for anymore disappointment. <br><br>It is really sad to come back to chicago and eat at your favorite restaurant to have it be a let down. It's even harder because Fish Bar is what I recommend to all friends who come into town! I guess I can't anymore. Makes me sad <br><br>Overall it was a let down", "pics": null}}, {"review": {"des": "I used to love this place and rave about it, but coming in tonight has changed it... 5 stars = 100%... 3 stars = 60%. Last time I checked, 60% is a F.<br><br>The food is still at least slightly above average, but a few things were lacking -- the artichoke fritters literally had no identifiable artichoke in them, the variety was missing from the menu, the charred redfish tacos weren't great, and the soups were a bit thin for being bisque. <br><br>The old cocktails have been replaced with less creative new cocktails and prices have increased $3+ for each. <br><br>The crux of my problem is really the service. I have never seen so many staff standing around talking to each other rather than helping customers. <br><br>This is a generous 3-stars.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WFe8DV0KLWsfjfhCGWqgVA/168s.jpg", "caption": "3 of the 5 staff standing talking instead of taking orders.. It was 4 standing talking right before I took this pic"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ksqIQZ_LBZhoIBhoqUc18g/168s.jpg", "caption": "Valentine's Day 2014 menu presented on (2/13/2015)... Attention to detail much?"}]}}, {"review": {"des": "Excellent place for seafood lovers! The gumbo soup is sooo good!", "pics": null}}, {"review": {"des": "So so so so good. We tried a little bit of everything. The portions are a little small (small plate style) but you will get full. I had the lobster roll and it was probably the best one I've ever had but i will warn you it is pricy. It was seasoned so well and had a little touch of citrus which was great. We also tried the clam chowder based off the reviews and it was delicious. The shrimp was a little salty but overall great experience. It is a little pricy so you may want to save up a little and treat yo self *in toms voice from parks and rec* but the food is really good.<br><br>Be sure to try the two for one cocktail it's amazing!", "pics": null}}, {"review": {"des": "Fish Bar is down the street from my place which gives it a 5-star in my book for convenience alone.  Seriously though the seafood is amazing and the staff is always super chill and suggestive if you don't know exactly what you want: including drink choice.<br><br>I always get the fish sandwich, and it's always F*cking delicious.  Also, chug a couple of Tecate's while you're there!", "pics": null}}, {"review": {"des": "Surprisingly the calamari was just okay in my opinion. Nothing that we ordered entirely wowed me or my family besides the white fish that came with the couscous. That dish was so outstanding that I felt the rest of menu was mediocre. Service is superb and attentive. The decor of the restaurant is really cute; I would try to visit again with a friend and sit on the bar, since I have yet to taste the drinks!", "pics": null}}, {"review": {"des": "What a cool place! It literally is a bar that wraps around and has the servers close to everyone at the bar to offer quick and friendly service. Our server was helpful as it was our first time and very welcoming. The menu is a good mix of seafood bar items like tacos, poo'boys, sliders, and more. We ordered the taco of the day with scallops. Each taco had three small but juicy, buttery scallops with lots of toppings. This is where I dock one star because they only use one corn tortilla on their tacos. This results in all the fillings and toppings falling out as the tortilla breaks. The second tortilla is used to prevent just this issue. Tacos are meant to be eaten with one hand, so I would recommend they just spend the extra 2 cents on each taco and add another tortilla. We also ordered the satchmo poo' boy, which had shrimp and crawfish. It was very tasty, not too breaded, and very fresh tasting. It had plenty of seafood and could have used a slightly longer roll to hold it all in. The bread is thin enough not to ruin the ratio of bread to filling. Overall, the food was very fresh and tasty, which is a treasure when it comes to seafood in landlocked Chicago (Lake Michigan doesn't count, hehe).<br><br>They have outdoor seating in the summer, but the inside offers such a cool bar experience. The atmosphere is cool, with a boat, raw wood panels, and big paintings of fish catching your eye and setting the mood to get your seafood grub on!", "pics": null}}, {"review": {"des": "Not a bad spot. Randomly stopped in on a workday and it wasn't a lot people here. Me and my companion were in the mood for seafood so it seemed like a good place to try. The classic rock that they played was good.<br><br>I had the crabby patty and it was delicious. Its kind if hard to find a crab cake here that's not a miniature size. Theirs is the size of a burger and seasoned wonderfully with some Old Bay. My date had their shrimp po'boy and wasn't imoressed. She only liked the type of bread they served it on.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BN9aSDSLWOzd5_iJDjzy0g/348s.jpg", "caption": "Crabby Patty"}]}}, {"review": {"des": "Walked and got a seat right away, really friendly staff. Had no idea it was a dog fish and DMK restaurant.<br><br>Based on how much we loved:<br>Shrimp and crawfish po boy<br>Hush puppies<br>Lobster tacos - never had lobster in tacos so I thought texture was odd mix and I usually love lobster...<br>Ceviche<br>Cherry pie - I'm not a pie person so I'm biased<br><br>Drinks were great - loved the Kentucky mule.", "pics": null}}, {"review": {"des": "Came here twice, and both times were spot on. Sat at the counter (most space is at the counter) Friendly and helpful staff.  I have tried the calamari, which was very flavorful) oysters were so fresh, I had the shrimp po boy and it was very hearty. Menu specials change often and things run out towards the later evening.", "pics": null}}, {"review": {"des": "Curses and cranberries where do I begin? This place was a real mixed bag- staff was super friendly, but operationally they were a little lost. Drinks took 15-20 minutes, after being told they also couldn't make a martini (Really DMK?!?). Oysters, which were ordered first with drinks, arrived after we were finishing up our crabby patty n' calamari. There goes my once a month promise to the wife for oysters n martinis. I mean in my experience with oysters you eat them first as an appetizer. At least it was $2 buck shuck sunday. Crabby Patty was best thing we had by far- calamari wasn't crispy and half the basket was peppers. When the bill came we wondered how this quality food could have cost us so much. Eh, what can ya do?", "pics": null}}, {"review": {"des": "After a long day at work my girlfriend ordered me dinner from this place thinking it'll be a good treat giving the reviews just to end up with 2 oz of salmon 3/4 oz of cauliflower soaked in oil along the side with 3 small onions and few sprigs of arugula \"yes soaked in oil as swell\" we weighted them for fun after we were both shocked when we opened the bag.. Very brave of them to do such a thing and expect customers to be back!<br>Very disappointing!<br>Oh I'm a private chef and I will feel embarrassed to charge my clients $12 plus tax for such a \"meal\"", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/t6WaLXE7q7Dm2QYOkS_MLg/348s.jpg", "caption": "Teeny tiny portion"}]}}]}