{"name": "flo-chicago", "reviews": [{"review": {"des": "We came in on a saturday right after 11am, and it seemed like the line had just started. We opted to sit at the bar, which is full food service. The man who was behind the bar was very attentive and a pleasure! <br><br>I got the burrito, Christmas style (green and red sauce) and my boyfriend got the green enchiladas. We were both so impressed with the food. We liked the salsas that were in the bottles, especially the green one. <br><br>We also got one fruity pebble French toast (one piece, not the whole order) for $3.50 and it was the perfect amount. I was so pleasantly surprised with the French toast, especially since I normally don't like fruity pebbles or French toast. <br><br>We will definitely be back! Plenty of paid street parking.", "pics": null}}, {"review": {"des": "It's in the neighborhood, and we just discovered this place recently. They're only open for breakfast, lunch and brunch, and we stopped in during a bustling Sunday brunch. The place was very lively, and the tables were almost completely full. Luckily we didn't have to wait long and were seated at a table near the middle. The entire menu is Mexican breakfast favorites. We ordered the chicken chilaquiles (one of the specials for the day) and Bloody Mary's. I really enjoyed the traditional Bloody Mary, but the green salsa one was not my favorite. The chilaquiles came out super fast, and they were delicious. They tasted very fresh, and the salsa was very flavorful. We had to track out waiter down a time or two, but overall, it was a great experience, fun ambiance, and I'll be back!<br><br>Other observations:<br>- No chips and salsa! I'm a chips and salsa fanatic, so this was a little disappointing, but the portions are huge and you really don't NEED it...<br>- No reservations, but they turn tables around very quickly.<br>- There is metered parking in the neighborhood, but if you drive a block north, the street parking is free.", "pics": null}}, {"review": {"des": "Conclusion: Flo has a unique brunch menu that makes it a cool place to try for this meal. I highly recommend everyone to go! <br><br>I came here for brunch around 10:30 AM, and they were able to seat us within 15 minutes despite the rush. I ordered the Guadalajara Scramble which was absolutely delicious. It doesn't come with rice nor is it saucy so if that's something you're looking for, don't get this. It comes with a little bit of scrambled eggs, not as much as I had expected since there was much more steak, beans, and veggies than eggs. There are tiny tortilla chips inside of the dish adding a nice crunch to it all. Regardless, I was still happy with it. <br><br>I also ordered the Cocoa Pebbles French Toast which was soooo delicious. I'm not much of a sweet tooth, but I absolutely loved this. I definitely recommend it! <br><br>The two other people I was with ordered the Steak & Eggs Benedict. They had asked for their steaks to be prepared medium, but they were cooked much more than that. One of the dishes was still enjoyable, but the other steak was so overcooked that it was too chewy and they ended up just asking the server to take it away, so order this carefully! <br><br>Initially when they complained the server claimed that it was mostly all eaten, although there was still a lot left. The server was pretty exasperated from the beginning, although brunch is usually a hectic time. She was good at providing recommendations though, and the food came out quickly. <br><br>Parking: Street parking<br>Ambiance: Casual, booths available, outdoor seating available.", "pics": null}}, {"review": {"des": "First off if going for brunch I recommend putting yourself on the wait list while in route.  By the time we arrived we were 2nd in line for a table.  This place gets packed and it's smaller which means you could be waiting outside in the cold.  One pleasant surprise was the self service coffee station by the entrance so you can enjoy a cup or two of coffee while you wait.  It can get a bit crammed which isn't pleasant but I feel that this place is worth the slight discomfort.  Once we were seated it was fine.  Our food was outstanding!  I have the huevos verde and my husband had huevos rancheros.  I'd order that again without hesitation!  So happy to find another brunch soot in the city and the best part is the prices are reasonable and portions hearty!  Will be returning for lunch/dinner.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/J8as7SzCy-QSb01H3MG-4w/348s.jpg", "caption": "Flo interior"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3e7XGwkg-Mo_PaJ7TxJ5RQ/168s.jpg", "caption": "Huevos Rancheros"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aKj3BryOCAerZfE236f_9A/168s.jpg", "caption": "Self serve coffee"}]}}, {"review": {"des": "I came here with K and T and our nephews last Saturday for brunch. We went around 1:30pm and I was surprised there was no wait. When we walked in we were immediately greeted and seated. <br><br>Ambiance: A few booths and some tables. More seating in the back but not very spacious. Natural lighting but pretty dark in the back. Bathrooms were freezing. <br><br>Service: Great service! Our waitress came back a few times to ask how we were doing. She was nice to our nephews and happily took our Polaroid picture. <br><br>Food: K and T enjoyed their tacos. My nephews loved their fruity pebble French toast and chocolate bacon pancakes. This and the service is why I gave 4 stars. My food was a 3-star.<br>I ordered the enchiladas. It wasn't rolled up like usual, and there was less cheese than I'm used to. Since it wasn't rolled up, it was basically a tortilla and meat and sauce on top. Like a deconstructed taco. There was also a separate thicker wrap which confused me. The sauce was good though as were the potatoes and the egg was a nice touch. <br><br>I was thinking about getting the fruity pebble French toast to-go but it seemed too decadent. I had some of my nephew's and it seemed enough, but now I'm craving it! Haha. If I go back, I'm for sure getting that.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vVAi8--ZM1q-zOsygYZTdw/168s.jpg", "caption": "Fruity pebble French toast"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ckz277CMrOTJ3La462_TaQ/168s.jpg", "caption": "Huevos Verdes - enchiladas"}]}}, {"review": {"des": "IMPORTANT: you can order the fruity pebbles French toast in smaller sizes (1, 2, or 3 slices). I knew it would be too sweet for my entire breakfast but I still wanted to try it after seeing all the posted pics! So I was able to order 1 slice of the French toast and the chilaquiles for my main meal, which was very tasty and spicy.  My friend ordered the steak and eggs Benedict and it was also amazing.", "pics": null}}, {"review": {"des": "WOW. I was not expecting to love this place as much as I did! What a gem. Their menu is very creative and heavily Latin-inspired. I had the best Chilaquiles EVER when I went here! Seriously, so good. They also had interesting things like Pumpkin Pancakes and Chocolate Chip Bacon Pancakes (sweet AND savory, anyone?). Their bloody Mary's were delicious, too! Our server was excellent and she gave us some great menu recommendations. It's not a huge space inside, so try to get there earlier, rather than later for a seat. You can join the waitlist via Yelp, too!  I'm already planning my return here....", "pics": null}}, {"review": {"des": "Wow. Just, wow. <br><br>We can't seem to get past their brunch offerings, but I'm sure their breakfast and dinner staples are as amaze'balls as their boozy drinks and nap-inducing meals served on Sunday mornings. Go early, 'cause the line starts to pick up around 11:30am - if you arrive later, know their tiny little kitchen and impeccable service gets the folks in, and out, pronto. Your wait will be rewarded.<br><br>Start off with a Bloody Mary or another adult beverage from their bar, like one of the half-dozen or more flavored mimosas. The ever-wicked Chile Verde Bloody Mary ($8) requires the mandatory Miller Pony as a kickback to cool the burn. This concoction features a blend of smoky green chili and jalapeño, topped with an olive, lime wedge and a pepperoncini pepper - and you can mix yours with a very generous pour of either vodka, tequila or housemade bacon bourbon.<br><br>Flo's Red Chilaquiles ($10) feature homemade corn chips topped with your choice of egg styles (over easy for me, please) black beans, corn and pico de gallo, all brought together in a flavorful tomato salsa, melty cheddar cheese and a warm, handmade tortilla on the side. Go \"hog wild\" and add carnitas to this pile of awesomeness.<br><br>The amazing Portabella Quesadillas ($9) comes with perfectly seasoned and expertly roasted mushroom, smoky red pepper, fresh spinach, and jack cheese served with a guac-like salad and a spot of black beans.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oMgNHkrI85JrQ3StDGbqug/348s.jpg", "caption": "Red Chilaquiles, $10, feature homemade corn chips, your choice of egg, black beans, corn and pico de gallo, all topped in a flavorful sauce"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/w9Tynp8nmMCiyI5IgYKStA/168s.jpg", "caption": "The amazing Portabella Quesadillas, $9, comes with perfectly seasoned and roasted mushroom, red pepper, fresh spinach, and jack cheese."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IV67Ko1K45JyjZtqeiry7A/168s.jpg", "caption": "The ever-wicked Chile Verde Bloody Mary $8 requires the mandatory Miller Pony as a kickback!"}]}}, {"review": {"des": "I really like Flo! They have a huge brunch menu full of decadent dishes, as well as items with some Mexican flare. You can go with some friends or solo & sit at their bar. You can chill inside on a cold day or at one of their sidewalk seatings on a perfectly sunny summer day. Full of options even with their drinks - when I went this past weekend they had a $12 Rose flight! Yes please.<br><br>I went with their Chocolate Chip Bacon Pancakes (3 for $9)...they just called my name! I'm not usually big on sweets for breakfast but couldn't overlook that combo. I kept being drawn back to it on their menu! Well it didn't disappoint. A great sized portion (I ended up taking half home!) and just delicious. Plus coffee for $3 and friendly service. <br><br>I was really happy with everything at Flo, would definitely be back for brunch and I'm excited to try their dinner.", "pics": null}}, {"review": {"des": "Finally tried out Flo's. Didn't realize how close it is to the Marianos I shop at. Came here on a Saturday morning there was no wait. The staff was nice and attentive we were seated right away. It took us a while to figure out what we wanted.<br><br>I ordered the low rider and my boyfriend ordered the egg white omelette. The long rider is oven baked eggs with potatoes cheese and spinach with verde sauce and a side of black beans. I am not a fan of beans for breakfast so I opted out. The egg white omelette came with a side of potatoes with verde sauce. Then we ordered some regular French toast. Overall all the food wasn't bad. The french toast was over cooked and dry. Could have used more seasoning but it was okay. I recommend getting the verde sauce on the side if you order a dish that has it listed as an ingredient.<br><br>Overall, I recommend and I will try again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ugJeGOmhC-YYB8SaP-HobA/348s.jpg", "caption": "Egg white omelette"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4-83-nDXj9wUxu27kB7RmA/168s.jpg", "caption": "Low rider"}]}}, {"review": {"des": "I was drawn here by the beautiful pictures of fruity pebbly French toast but was more blown away by the special of the day, Habanero chilaquiles. Our server was awesome, the micheladas are on point, and the French toast met expectations (which were high!).<br>I can't wait for this weekend! I need more Flo Brunch!", "pics": null}}, {"review": {"des": "Spicy (even for this gal), flavorful brunch menu with solid bloodies to get your morning (or afternoon) going. We stopped in on Halloween for some libations and sustenance and walked out happy patrons. Our server was a little short with us (walking away before we finished talking, etc.) but was generally nice and accommodating. Good place to plop down for an hour or so on a weekday or weekend.", "pics": null}}, {"review": {"des": "I would give Flo 3.5 stars versus 3. I took my mom here at an off time during the afternoon. I had been meaning to try this place for awhile. Service was excellent! Our waitress was attendant and almost knew what we needed before be needed it. :)<br><br>We ordered the fruity pebble French toast to share and it did not disappoint. It was so good I didn't even use the syrup! <br><br>The disappointment came from my actual entree order. I've become a big fan of black bean burgers lately and decided to go with that. Wrong choice cause it was bland and way to mushy. I would definitely go back to try something else though cause that French toast won me over.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9BLeb2bx0lpEZ5c5PACM0A/348s.jpg", "caption": "Fruity Pebble French Toast"}]}}, {"review": {"des": "Came here for some brunch with a group of 5. It's pretty cramped in here so it's difficult for them to seat a larger group. They seated us on two tables but somehow expected 3 of us to sit on a booth seat meant for 2 but then gave the next group of 5 after us an extra chair? Not sure what this unfair treatment meant... <br><br>But in terms of the food, they are really well known for their french toast and I saw everyone else eating it. Unfortunately everyone was in the mood for a savory brunch, I had the steak and eggs benedict, the steak was a bit rough as it was skirt steak, but the seasoning was ok. Their potatoes are seasoned pretty well and are tasty. I think one of the better savory dishes is their chorizo scramble as it's a pretty large plate with some hash, some beans and it looked pretty filling and pretty unique to this place. Maybe will try the french toast again if I'm in the area again. It's one of the only brunch places in the surrounding area it seems so it's small and pretty hard to get seated.", "pics": null}}, {"review": {"des": "I was expecting this place to be an average brunch spot but with a fruity pebbles French toast option, I knew I had to at least try it once.  It's actually a solid brunch spot, everything we ordered was definitely above average.  Surprisingly, we didn't have to wait long (less than 10 mins).  We did call ahead and check what the wait time would be.  I had tried coming here last summer (without calling) and it was over a 2 hr wait at that time.  So definitely recommend calling ahead to check.<br><br>I've searched high and low for a good eggs Benedict in Chicago and this is the best one I've found so far.  We tend to order individual egg dishes and one sweet dish for the table, which is what we did with the fruity pebbles French toast.  It's the equivalent of red velvet French toast at yolk (without actually being red velvet).  A dish that's worth coming back for and hits the perfect sweet spot to end a brunch with flair.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/v3b-bn0JEk5MXoszsAOWJg/348s.jpg", "caption": "The infamous fruity pebbles French toast lived up to the hype"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/s_72gz-54H8_jV5fidJGYg/168s.jpg", "caption": "I ordered the eggs Benedict, one of the best I've had in chicago"}]}}, {"review": {"des": "We were seated outside and it was excellent. Vibe and food. <br>I had the pulled pork taco, and man after a rough night it hits the spot and especially with the fried egg on top.", "pics": null}}, {"review": {"des": "Flo--solid Latin American inspired brunch. Came with a group of 3 and we were seated in the front corner of the restaurant. We at first noted some questionable art work on the wall at a steep price point of $400 for a photo. <br><br>Anyway we ordered a couple bloody marys and a champagne flight. strong bloody mary -- just wish they had some cheese on the skewer. I ordered the smothered burrito without a tortilla. First thing i noted were the great portion sizes. Sadly the flavors didn't match up. The chorizo was tasty but lacking in the heat department. Potatoes are fried but there is no crispiness ive had at other restaurants. Maybe that was the intent but some texture contrast is always appreciated.<br><br>Overall fine food and good service although the bill was given to us halfway into our meal. Decent brunch outing but left a bit unsatisfied.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iIfe9UpFfzam6nJFr17Ajg/168s.jpg", "caption": "Frittata"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BJyUfJupFfckMy4dbZ9WTQ/168s.jpg", "caption": "Smothered burrito no tortilla"}]}}, {"review": {"des": "I've been meaning to try this place for a while, and I'm glad I did. A couple friends and I came in for a late lunch on a Saturday afternoon. It was pretty busy, but we had no problem getting a table in the back.<br><br>The funky abstract art, high ceilings, and dark wood booths make the inside cozy yet modern. Our waiter was friendly, but a little bit allusive. The menu is a decent size and mostly features breakfast/brunch dishes with a Latin flare. I had the turkey club which was toasty and delicious. The potatoes on the side were pretty bland, but they have a few different fun hot sauces to try. My friends both ordered the portobello tacos, which looked more like omelets, but they enjoyed them. I'm embarrassed to admit I didn't try one of their homemade margaritas or bloody Marys, so I will be back when I'm in the mood to day drink.", "pics": null}}, {"review": {"des": "Flo is a poppin brunch spot with unique flavors and a modern, rustic atmosphere.  I stumbled across this spot when looking for bunch and after seeing some instagram worthy photos, glowing reviews, and realizing it was walking distance from my AirBNB I was sold.  We were a party of six, which at such a popular spot meant we had to wait a bit for a table (30 minutes) on Saturday.  <br><br>We got a comfortable round table in the back which was quieter than up front.  I started with a Chile Verde Bloody Mary which comes with a little Miller High Life.  The bloody is a refreshing take on an old classic being that it is green but still a little spicy.  For brunch I split the smothered ranchero burrito with my boyfriend.  It ended up being plenty of food for the both of us.  The burrito had layers and layers of flavor.  Flo had such a wide variety it could please anyone's tastes and would be worth multiple visits to try different things.  Next trip to Chicago I'll be sure to come back for more bold creations.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4aAxogaGBsOHHYFfoyu6OQ/168s.jpg", "caption": "Smothered burrito"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1r9SwbQjEhqTrIqMVH4BMg/168s.jpg", "caption": "Verde Bloody Mary. So good!"}]}}, {"review": {"des": "The food was really good and they have some fun items on the menu like the popular fruity pebble toast.  You can order them individually for $3.50.  I didn't have trouble finding street parking on a Sunday afternoon.<br><br>Bloody Mary $7 - They offer 3 different types - cholula, chile rojo and chile verde.  I went with the classic cholula and it came garnished with a pepper and an olive and was very salty.<br><br>Huevos Rancheros $9 - Cheddar cheese enchiladas topped with chile sauce, 2 fried eggs and black beans.  The enchiladas were swimming in sauce, and I rather enjoyed it.  The sauce was very good and everything tasted fresh.<br><br>Fruity pebble french toast $3.50 - Delicious!  It not only looked pretty, but tasted great with the fruit on top.<br><br>....| \\      _  , , , - - , ,  _  ,      <br>.../  , ` . - ' ` '             . _   \\ -  ;  ;  ;  , _    <br>..| ,  a  -   )   ) _         . ; .  (   ` - ` -  ' - '   <br>'  - - - ' ' ( _ / . _ ) - ' ( _ \\ _ )", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ciP-4v-1lRBEU-yKMD_qRw/348s.jpg", "caption": "Steak Eggs Benedict"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NR2L1tgGEzdniFevFbY6Kg/168s.jpg", "caption": "Bloody Mary"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/s1Z1-JRUcV8xPDjubwgbqA/168s.jpg", "caption": "Bloody Mary"}]}}, {"review": {"des": "I loved this breakfast place! It was such a great way to start the day. They offer free unlimited coffee while you wait to get seated. There are plenty of tables. For a party of 4, we only had to wait about 15 minutes before being seated. <br><br>We ordered the..<br>Fruity Pebbles French Toast<br>Skirt Steak Eggs Benedict <br>Smothered Breakfast Burrito.<br><br>The french toast was surprisingly delicious, slightly on the sweet side but definitely not overly sweet. It was very unique and you probably won't find it anywhere else. My favorite goes to the skirt steal eggs benedict. The eggs were done to perfection!! The burrito was my least favorite, but it was still good.<br><br>Service was awesome as well! I would definitely come back if I am in town again.", "pics": null}}, {"review": {"des": "I had had Flo bookmarked for approximately seventy years, but there are so many good, crazy, fun brunch places in the city that it somehow kept getting pushed down the list. Until finally one day we were getting photos done at our amazing wedding photographer's new studio in west town, and WHAT WAS RIGHT ACROSS THE ATREET?! FLO! So as we waited for our photos to be edited, we popped on in to finally try it!<br><br>Now the menu here looks awesome and I'm sure everything is delicious, but I had read many moons ago that they do fruity pebble crusted French toast and I knew I wouldn't be able to get anything else - until they one upped my imagination and offered COCOA PEBBLE FRENCH TOAST (chocolate is superior to fruit, it's science, don't question it). The French toast was everything I ever wanted - crunchy, chocolaty, enormous, sweet, custardy, delicious brunch heaven. Remember how cocoa pebbles resulted in a bow full of chocolate milk? Well cocoa pebble French toast results in that chocolaty goodness weeping into the syrup, the batter, the whole shebang, becoming a messy, incredible amalgamation of gluttony. I got a side of the chicken apple sausage and loved that too. Husband got the huevos verdes and it too was amazing! Savory, cheesy, a little spicy, with a warm heavy enchilada-y texture and a ton of bold verde sauce flavor.  Brunch was cheap - 2 for 35 bucks with a nonalcoholic drink each? Okayyyy - and the service was awesome. We were in and out in under an hour and for such a tiny space, the tables in the back feel quite spacious. <br><br>One thing - the iced coffee was, I think, just brewed coffee that had been chilled. A little bitter (and I love bitter, but this was bitterrrrrr) and a little diluted. Oh well, guess this means I have to get a Bloody next time!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iM7FqEL82A3L6D37o5vwIw/168s.jpg", "caption": "Huevos verdes for the husband"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9EFMjuDUcKy7ovtE-7hHDw/168s.jpg", "caption": "Cocoa. Pebbles. French. Toast. GAH."}]}}, {"review": {"des": "I came here for dinner and thought it was very good, and then came back for brunch and was even more in love. <br><br>Do yourself a favor and get the smothered burrito for brunch!!!! While it is not the most Instagram-worthy meal Flo has, it was the yummiest out of the ones we got (which is way more important right?). I got it with both the red and green sauce and both were delicious in different ways. They also have sauces available on the table. <br><br>Tip: use the yelp waiting tool for weekends since they don't take reservations. This place is pretty busy but the line moves pretty quick because they being out the food fast.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hdKleX5G4P62WEZBUfIHNA/348s.jpg", "caption": "Flo combo"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/clXkl6zyouNFqpdueM1NUA/168s.jpg", "caption": "Steak Benedict - not as good as I had expected"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/H-dRVeAkK5euWC60RUtm0A/168s.jpg", "caption": "Smothered burrito"}]}}, {"review": {"des": "Had a great time for brunch at Flo, and loved the wait in line feature on yelp! By the time we arrived, we had only two parties ahead of us, and we waited about 5 minutes. And it was PACKED! We both ordered the flight of mimosas, which included the original, Bellini, and cranberry (I think). I also ordered the pulled pork frittata, and he ordered the famous fruity pebbles French toast. Our food was brought out surprisingly fast, however you could tell that they premade some stuff because my potatoes were cold. The pulled pork frittata was SO good, and the house made salsa on top gave it a good kick. I also had one of my boyfriends French toast, and it was good, but way too sweet for me. Service was great, and we loved the decor of the place! A nice hidden gem in the west town area!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JI4c6qyczhE2LlkPwe7Eqg/348s.jpg", "caption": "Fruity pebble French toast"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/whyGbIk28s02rxydd_yA7A/168s.jpg", "caption": "Pulled pork frittata"}]}}, {"review": {"des": "Overall pretty good and the price isn't bad. I really enjoyed the breakfast burrito, and would come back for brunch. Good service as well.", "pics": null}}, {"review": {"des": "My boyfriend and I thoroughly enjoyed Flo for Saturday's brunch! We both ordered the mimosa flights to start off with and they did NOT disappoint! We also ordered the chocolate bacon pancakes to share while he got the steak egg benedict and I got the smothered ranchero burrito. ALLLL of the food was SO good. We ate every last bite. I highly recommend this place. Surprisingly, the wait wasn't long either. We waited for more than 15 minutes and then we were seated. Our food came out pretty quickly too! Great service and even better food.", "pics": null}}, {"review": {"des": "Amazing food! Wish I would have know about the mimosa flight deal before ordering a single one. I was so impressed, also a bit scared about how quickly it came out but everything was delicious.", "pics": null}}, {"review": {"des": "Very eclectic menu. Mostly Mexican but some random non-Mexican items like the fried chicken special tonight and the mussels in white wine. Service was spotty - our server was basically uninterested in our party of five on an otherwise not very busy night.<br><br>The sangria is good - we tried both the red and the white. They're $20 a pitcher which is a decent deal. I preferred the red over the white, because the white was more watered down and had less flavor. My friends glass was badly cracked with a big chip off the lip. She brought it to the servers attention (it was bad enough that she could have easily sliced her lip) and no real apology or anything.<br><br>I had the short rib barbacoa tacos and they were just okay. They needed more flavor - without something extra hey we're just average tacos. The rice and beans were just basic and pretty flavorless.  All around it was fine but probably won't be back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gVcntqjzsu94UEYw8w81AQ/348s.jpg", "caption": "Barbacoa tacos"}]}}, {"review": {"des": "Flllloooo! I wanted to hang out with a buddy and he suggested Flo...hadn't heard of it since I live across the city, so would have gone even if I didn't know HOW FANTASTIC IT IS!<br><br>I ordered a mimosa flight and the smothered burrito, which were both very good. There were a few different types of hot sauce on the table, which was a nice touch. The server was friendly and conversation was great...at this point Flo had a solid 4 stars going for itself. <br><br>Then, I got the fruity pebbles french toast. I have a sweet tooth, so they were getting ordered no matter what, but DAMN! I had no idea that adding these little guys to some french toast with berries on it would set off a chain reaction of flavors and an orchestra in my mouth. Seriously...they're that good. Makes sense though, you have the berries already, but then each \"pebble\" has a different flavor, like cherry, lemon, grape, lime, but I mean WHOA! It was literally a flavor explosion (in a good way). You know how when there's something delicious and then you get to the point where it's almost too much? Yeah, this stops just before that point, so it's maximum awesomeness but without even straddling the line of too much. <br><br>On the way home, I bought 10 boxes of fruity pebbles and started adding them to ever recipe I make:  breakfast smoothie, carrot cake, mandarin orange salad, bacon-wrapped filet...kidding, but that was what was running through my head during the first bite of this stuff. It's like my alternate life flashed before my eyes all in the span of a few seconds.<br><br>In all seriousness, next time you're in the hood, check this spot out, and please, I beg you, don't skip the fruity pebbles french toast.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4soUb6XypV4zQwGSTv70vA/168s.jpg", "caption": "Fruity pebble French toast!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eLHvDeA0RvskVmggXtGOaw/168s.jpg", "caption": "Smothered burrito served with potatoes and blueberry mimosa"}]}}, {"review": {"des": "I had to try this place solely based on the fruity pebbles french toast and was not disappointed! So sugary and sinful. I loved it. A+ for ingenuity. I'll get the berry sauce in the side next time, only change I'd make. I had some sort of breakfast champagne cocktail and it was yummy, too. I liked the casual atmosphere and sweet service. A nice break from some of our pretentious Chicago brunch faves.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cTWzID6S4NB-73rJ9NUtFA/168s.jpg", "caption": "This is true innovation."}]}}, {"review": {"des": "While visiting Chicago, my friends brought me to Flo for a delicious brunch. Immediately when I walked in, I saw the Flo sign that had the New Mexico Zia Symbol, and I immediately felt at home (im from New Mexico). <br><br>You do have to wait a but to get in, but Yelps nifty feature allowing you to check in ahead of time helped significantly. <br><br>Food: We ordered the Fruity Pebble French Toast (holy moly, it was incredible), smothered burrito (it was large, and very flavorful), nd the green chile chicken chilaquiles (best dish of the bunch).  Each was plenty of food, and had great presentation. <br><br>Drinks: We tried 2 separate bloody marys. 1 was a green chile bloody (so so so good), and the other was a red chile bloody mary (significantly thicker, but was still very tasty). <br><br>Overall, this place was fantastic, and I cant wait to visit again when I am back in Chicago!", "pics": null}}, {"review": {"des": "Very tasty!!!! It was a short wait but there is free cider while you wait so it didn't seem long! We shared an order of the fruity pebbles French toast it was amazing!!!! I also had the Guadalajara scramble that was soo good too! The food didn't take long to come out. My friend had an veggie omelette and her potatoes were cold but she still ate half of them. It wasn't the best of service and I hated the paper straws. The waiter ran my card on someone else's check ‍  so I had to wait for him to void it out and rerun my card. I would definitely return for the food!!", "pics": null}}, {"review": {"des": "Wow this place was so legit for brunch. I wanted to try everything on the menu! I decided on this amazing dish with a side of Hatch green chiles. The eggs were perfectly poached and the corn masa soaked up every bit of flavor. The red chili added a nice kick. Can't wait to go back and try more!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WAT5jkrumX3gTDvKtdgZyg/348s.jpg", "caption": "Chorizo-Tamale Hash //Housemade chorizo, coarse corn masa, a touch of red chili with cheddar cheese and poached eggs"}]}}, {"review": {"des": "My husband and I were meeting with friends for a late brunch and they live less 10 mins away from here. The reviews here were great so we thought it would be a perfect pick. There is complementary coffee by the door, so help yourself. They won't seat you until your entire party is there, but it wasn't too packed so I wasn't concerned. <br><br>I ordered the Smothered Ranchero Burrito and my husband had the Steak and Eggs Benedict. My friend ordered a mimosa flight with her meal (forgot what it was) and her husband had the Chilaquiles special. Food came out pretty quick and was tasty. We felt rushed though since the busboy kept asking if we wanted boxes, and we were all still eating. <br><br>The waitress dropped off the check while we were eating and chatting. When the busboy asked the second time around to pack up our food, we gave in and had things wrapped up. The waitress came around to see if she could grab the bill, and no, we weren't ready to pay since she dropped it off not too long ago. Also fyi, they will not split the bill for you. They'll only charge two cards equally, which we thought was silly. <br><br>The waitress then swung by not too long afterwards and literally asked us to leave because they had people waiting to be sat. We were in the restaurant for less than an hour. We were all kind of taken aback by this. I get you want to make money on getting as many people in and out as quickly as possible, but probably not a great approach to kick out customers. <br><br>I guess if you're looking to swallow your food without chewing and then be rushed out the door, this place is for you.", "pics": null}}, {"review": {"des": "I have had Flo for brunch and dinner.  Not too big of a fan of their dinner.  I haven't had their meat options but the vegetarian options don't seem to be tasty.  I did go there for brunch this weekend and enjoyed it far more than their dinner.  First of all, they have a really nice, dog friendly patio, though it is small.  It is also very affordable when it comes to their bloodies and food prices, which is a real treat given how expensive brunch can be.  I absolutely loved their bloody mary options (and they were only $7!).  We had the verde and roja ones and the verde was my favorite.  The verde one was spicy and zesty, the roja was good but not as exciting as the verde.  <br><br>Then for brunch, we had huevos rancheros and their chilaquiles.  They have many vegetarian options on the menu, which I really appreciated.  Their huevos rancheros had an amazing enchilada roja sauce with corn tortillas that were perfectly prepared.  There was some cheese in between the tortilla slices.  The eggs were over easy but it could have been cooked a bit less.  The chilaquiles were delicious as well, though I liked the sauce for the huevos rancheros more.  The tortilla strips were crispy with some finely shredded cheddar on top and more of a salsa roja sauce.  The portions were generous as well.  Service was good and appropriate.  Definitely coming back here more for brunch!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QTZ4cg5SehFdm8ZZ_zz3TQ/168s.jpg", "caption": "Roja bloody mary"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WMIUVeDpO12aK4U_u3WTHg/168s.jpg", "caption": "Veggie chilaquiles and huevos rancheros!"}]}}, {"review": {"des": "Flo is my kinda brunch spot. A 15-20 minute wait at prime time weekend brunch hours. $7 mimosas (with ranging flavors: hibiscus, rose, peach, orange, strawberry, etc) and $7 bloody mary's. GREAT savory and sweet food options. I highly recommend the Cocoa Pebbles French Toast, and I know I'll be back for the Fruity Pebbles version very soon! Although not listed on the menu, the full portion is 3 pieces for $10, but you can also choose to get only 1 or 2 pieces for varying price values as well! <br><br>Service isn't friendly per say, but they also aren't rude or inattentive. They are just straight to the point and get the job done! Parking is super easy too. Pay to park in front, or plenty of free parking on neighboring side streets.<br><br>I'll be back :)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Hj7B7U0arMXX5Z3myOu79g/168s.jpg", "caption": "Cocoa pebbles French toast"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/muVVUh5fErlStsp_2lC1tQ/168s.jpg", "caption": "Guadalajara scramble."}]}}, {"review": {"des": "Nice cosy spot in west town. Great bloody Marys and the food is terrific. Got the Cholula bloody with a side car and chorizo scrambler. Food hit the spot and a good price/portion.", "pics": null}}, {"review": {"des": "A group of friends and I visited Flo on a Saturday for brunch. We had a wonderful waiter who gave us several recommendations on cocktails and brunch items. <br><br>I had the Triple Berry-Zabione French Toast with a side of bacon. The bacon was a little too crispy for my personal preference but it had great flavor (I definitely ate every last bite). The French Toast was prepared perfectly with raspberries, strawberries, and blueberries. I would definitely get this dish again.<br><br>One of the other girls at my table ordered the Chorizo Scramble in which I was thankful to snag a bite. WOW!! So many flavors combined together to give the perfect dish! <br><br>Overall I was very impressed with this hidden gem. I would definitely return again and recommend to my friends to visit.", "pics": null}}, {"review": {"des": "Great spot!! Love the option of some great Mexican breakfast dishes or sweet and savory plates.  Service was great. Cocktails, coffee, and juices are all amazing.  Sunday morning 9:15am, got in. 45 mins later, definite wait at the door. The early bird catches the worm!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KyVysqMU_xv8v3J1wRRRpQ/348s.jpg", "caption": "Green chili Green Chile Chicken Enchiladas"}]}}, {"review": {"des": "Different taste in every bite.  How: line up the house salsas and open all tops, use different salsas in every bite [Barb Streisand style in 1996's The Man Has Two Faces].  A to-do for First Dates...fun!<br><br>Since the salsas are balanced (kick/spiciness doesn't linger), the GUADALAJARA SCRAMBLE is under seasoned but never bland.  Dude portion.  My first to wholeheartedly consume and enjoy the peppers.  Excellent slicing, ingredients and balance.<br><br>BIG SHOULDERS coffee beans.<br><br>Cocktails are nicely priced at $10.<br><br>Excellent SERVICE from Jane.  I appreciate your thoughtfulness Missy.  Thank you!  I can look forward to dinner with cocktails.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Sz2UC1CaiLM4V13b1qLnwg/168s.jpg", "caption": "The Three Salsas"}]}}, {"review": {"des": "Nice Mexican inspired brunch spot in the neighborhood. The service is friendly, food options are yummy, drink menu is also good, and overall nice experience here!<br><br>We ordered the Strawberry Pancakes, Chorizo Scramble, and the Berry Smoothie.<br><br>The Strawberry Pancakes were fluffy and came as a stack of three big Pancakes! (You can also order just two for sharing if desired) There were enough Strawberry chunks in there in my option, the Pancakes were slightly sweet and made perfect with some syrup drizzle. <br><br>The Chorizo Scramble was very flavorful. The beans were well seasoned, the scramble itself was delicious, but the potatoes were so bland! The potatoes look like they'd be tasty, but really just lacked flavor! Overall, this was a good dish, but 1/3 of the plate were potatoes and I barely touched those.<br><br>The Berry Smoothie was yummy, but not freshly made. It was poured from a container, probably made the day before. It was sweet, but did not taste all that natural.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9Xe6W8gY-TgzMs2PHbYsbg/168s.jpg", "caption": "Strawberry Pancakes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6rPBnXomEXNnFfQyurDDag/168s.jpg", "caption": "Chorizo Scramble"}]}}, {"review": {"des": "A place deserves five-stars when you can conceivably find nothing wrong with it. Flo hits the mark on everything. Flawless, incredible experience every time I walk in. From brunch to dinner, everything on the menu is top notch. They're known for their brunch, specifically the Fruity Pebbles French Toast, which lives up to its' legend and is absolutely heavenly. I finally tried it here last weekend (on my third visit) and my dining companions were all snacking off my plate before I was even close to being done! That isn't to discount the incredible New Mexican offerings also found on both the brunch and dinner menu. Find me green hatch chile items elsewhere in Chicago! Tough to do. <br><br>Drinks are a sleeper hit here, as well. Especially during brunch. All three bloodies hit the spot, and are available with vodka, tequila, or bourbon. The unique green chile bloody is my fave. <br><br>Flo is a unique experience and one to be coveted, especially for brunch. Come for weekday dinner is you want to avoid the crowds, but even if you have to wait, it's worth it. Chicago Ave. between Western and the Kennedy has to be the best brunch stretch in all of Chicago!", "pics": null}}, {"review": {"des": "We came to visit from California and found this place! Food, atmosphere and customer service were great! We took the loop to get here and it was definitely worth the trip. It was a nice little hole in the wall. I tell everyone to come here when they're going to visit Chicago! Definitely will be back when I come to Chicago again!", "pics": null}}, {"review": {"des": "Flo is hands down my favorite brunch spot in all of Chicago. Everything on this menu is phenomenal.<br><br>Here are my personal favorites:<br>* Flo Style<br>* Steak & Eggs Benedict<br>* Huevos Rancheros<br>* Pulled Pork Tacos<br>* Vegetarian Burrito <br>(PS. I'm a carnivore and this burrito is absolutely glorious)<br><br>Last but not least:<br>* Flo usually has a Hash special on Saturday which is by far my favorite brunch dish in the world. Also, do yourself a favor and get the mimosa flight.<br><br>I've tried pretty much every plate on their brunch menu and every single time the food has been consistent, delicious and filling.", "pics": null}}, {"review": {"des": "Went here for the first time last week with my boyfriend and pup. We waited for an outdoor table because he had our pup and we were seated super quickly. Our server was nice and regularly came out to check on us, even though there were only a few outdoor tables. The food was great, I had the carnitas tacos and my boyfriend had eggs Benedict and we both loved our meals. Highly recommend.", "pics": null}}, {"review": {"des": "This was my second visit, but probably my last. Got the fruity pebbles french toast and smothered christmas burrito. We wanted the benedict, but it's only offered on weekends or only Sunday (I forget). Service was average or below average in the sense that I felt like the waitress was doing us a favor when she grabbed our orders, got us water, or cleaned up the coffee she spilt on the table. The food tasted fine, but nothing special. Fruity pebbles french toast was drenched in syrup so no need for extra unless you have a huge sweet tooth. It was fun and the texture was good (chewy, crunchy, and kind of fluffy). I recommend eating it first if you order a few dishes to share (hot french toast, yum). The burrito was also ok, but I'd prefer a chipotle burrito ANY day. I primarily remember the taste of egg and refried beans. Tipped basic 20% and left feeling full but a bit unsatisfied.", "pics": null}}, {"review": {"des": "Ok so a little background before I go in: I was really stoked on this place because Southwestern food is some of my favorite. I think that's why I was a bit let down about my food and experience here.<br><br>The wait was about 10-15 mins, we got free coffee, I wasn't even mad. We sit down and I had already read the menu and knew for a fact I was getting the red chilaquiles. I LOVE chilaquiles and while I was in Mexico over the summer it is all I had for breakfast almost the entirety of our week long trip there. Lol. So I know authentic chilaquiles and had hopes this one would be a fraction of that. I ordered a classic bloody mary and it was great. There was a nice kick to it and had a delicious seasoned salt rim on the glass that made it even better. When the food came, I was immediately disheartened. The tortilla chips were SO SOGGY they were a mushed mess all together, the sauce had no real substance to it and lacked so much flavor, and it just didn't have the kick that I love and wanted. My boyfriend got the carnitas hash special and it tasted like a country style pork roast dinner from the crockpot. He liked it but I was super confused...overall, I didn't mind the place but I didnt love it either. I would go back and try something different. The other friends we were with enjoyed their food but we all noticed a theme of lacking flavors that should be prevalent in southwestern food.", "pics": null}}, {"review": {"des": "Went with my family while they were in town on a Saturday morning, only had to wait about 25 minutes. I had this place bookmarked for so long because of the fruity pebbles french toast. It lived up to my expectation! It was very good, almost a little too sweet for me (hardly possible) but i loved it! My mom got the cocoa pebbles french toast and said the same :) be ready for sweet with those options! Had to order a side of bacon to balance it out ;)", "pics": null}}, {"review": {"des": "Friends and I went here for Saturday brunch during our visit in Chicago. The fruity pebbles French toast was a little too sweet but the fruit French toast was really good! The chicken enchiladas were decent. Customer service was sub par but they do give free coffee while you wait for a table.", "pics": null}}, {"review": {"des": "I didn't think this restaurant was anything special. I got the Flo egg white omelette and I wasn't even totally full after spending $9 on eggs and potatoes... the Asiago cheese was subtle and just noticeable enough without being too strong. The poblano sauce was bland though and the salsa verde on the table was barely enough to give the dish any flavor. The potatoes were also bland. The grapefruit juice was $4, which is a ridiculous amount to spend on juice imho. The fruity pebble trench toast didn't live up to my expectations either. I would have been happier eating a bowl of cereal. The service was friendly and quick, so no complaints there. I don't think I would come back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/R0rVgXE0zTd1dfZ4YQnHEw/348s.jpg", "caption": "Fruitty pebble French toast"}]}}, {"review": {"des": "Everything was amazing.  The food was delish and looked beautiful on the plate.  The atmosphere was warm and cozy.  Service was awesome.  You can really tell the owners are proud of their restaurant", "pics": null}}, {"review": {"des": "I used to be a regular at this place, When I lived around the corner I would come for dinner once a week. I've since moved out of the area and when someone asked me about the perfect place I would want my baby shower I immediately thought of FLO. So on Saturday I had a  mini baby shower here with 12 family and friends. The food as always was great! The service however was very awkward. The waitress almost seemed pissed and seemed a little short. It was even more awkward after the cake the bill came right out. The waitress exclaimed \"we need this table, are you guys done?!\" We arrived at 4:00 and promptly felt we were being told they needed one of the tables by 6:30... We quickly started to scramble and move and shift things to give the waitress the table. Then I overheard the same waitress tell one of my guest \"this tip is too short, my guest was confused (everyone paid cash and gave the waitress more than enough) however she felt one of the tables shorted her on a tip, when it might of been a misunderstanding. My guest apologized and gave her a $20 and waited for some change, of course that was the last we saw of the waitress at that point. It was all a little bizarre and frankly rude, I will think twice before coming back especially with a big group.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NJ5zp1-LZOV05hybI5f0VA/348s.jpg", "caption": "Fabulous Moscow mules..."}]}}, {"review": {"des": "This is a good brunch go-to! I went with my boyfriend and sat at the bar. I suggest getting your own meals and then sharing some pancakes for dessert ;)", "pics": null}}, {"review": {"des": "If you're in the city and looking for a great breakfast spot, look no further. Great drinks and food. They offer American and Mexican options. We will definitely be going back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9PoQHo_34G9YT4v54YbgGQ/168s.jpg", "caption": "Chorizo Scramble"}]}}, {"review": {"des": "AMAZING food & wait staff! Even the host was awesome (didn't get his name but he was very attentive & sweet). The food is awesome & the prices are even better considering how huge are plates are. We intended on going to a BYOB spot but came here instead & that was one of the best decisions ever. We ate here on a Sunday & the wait time was not that bad. Will definitely be back here for brunch when in the Windy City again !", "pics": null}}, {"review": {"des": "Came here for brunch on a Saturday and loved it! I haven't been to the noble square area much so wasn't sure what to expect but this place was filled with young people and had a great upbeat vibe. The wait was only 20 minutes. They have free coffee which you can sip on while waiting for your table. My friend and I ordered the smothered ranchero burrito ($11) and the cocoa pebble French toast ($10) based on the Yelp reviews. These two were perfect to share to get a bit of both savory and sweet. Both of these dishes were delicious! The burrito is filled with scrambled, eggs, chorizo, beans, etc and comes with a side of potatoes. The French toast was the perfect level of sweetness and I thought adding the cocoa pebbles was a great idea. Service was pretty fast. One thing that I really liked about flo was that it was very reasonably priced. And portions are huge! Also it was easy to find free street parking on a nearby side street. My friend and I loved our dining experience here. Will definitely be recommending to others!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/thGLTg_SeaPunsd8rdEIuQ/168s.jpg", "caption": "Cocoa pebbles French toast"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vTk_o9r09vvGTAIX3xznlg/168s.jpg", "caption": "Smothered ranchero burrito"}]}}, {"review": {"des": "I went here on a first date this past weekend after seeing Flo on a list of best places for brunch in Chicago. As soon as we were sat, our waitress immediately came over and asked for our drinks order, which she dropped off soon after. A few minutes later, she was back asking what we'd like to eat. We weren't ready (as we'd been chatting) and the server said she'd give us a few more minutes. I remember saying to my date, \"I'd better look at the menu before she comes back again\" and, lo and behold, a few minutes later she was back, asking if we were ready to order again. We were, with my date ordering the French toast and I the portabella tacos. The food arrived very quickly soon after. My tacos were adequate. Not bad, but nothing to write home about.<br><br>What bothered me about Flor is the service. Our server came over way too frequently. My date and I were having a conversation and she would interrupt us without waiting for a sentence to finish. Very rude.<br><br>This bothersome attention was because the server was rushing us through brunch so she could turn her tables over faster. We hadn't even finished our meals before the check was dropped off, which meant our waters and coffee were empty and our server completely disappeared until she came over to tell us it was time to leave as there was a line. We were barely in the restaurant an hour. Definitely not the relaxed brunch I was hoping for.<br><br>I'll be honest, I won't be returning to Flo and I plan to tell my friends to stay away. A server should never flat out ask me to leave but I guess because she'd already been given her tip, we weren't worth her time. Incredibly unprofessional.", "pics": null}}, {"review": {"des": "First time dining here  was the best but the second time just wasn't as best as the first only because my steak Benedict wasn't as amazing as the first one. The steak was really grey and tough the first one was a perfect dark outside slight pink center nice chewy. Fruity pebbles French toast was good. Ordered a mimosa flight for $12 glasses are small and 3/4 filled. Delicious though . Chilaquiles with mole sauce and chicken was yummy too", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TmqS9NIETCobK3rVFF5Exw/348s.jpg", "caption": "Fruity pebbles $8"}]}}, {"review": {"des": "I was here this Saturday morning and met my friend at 1145- there was a 5 min wait (which is nothing) to be seated, even before my friend showed up I was seated. They have my favorite beer, gumball head by 3 Floyd's and my friend and I also had the flight of mimosas too- all great. I got the burger with salsa Verde and my bff got the egg white flo omlet. We both enjoyed it! Fun atmosphere and good food, fairly priced. I'll come back for sure!", "pics": null}}, {"review": {"des": "So much has been said about this place so won't bore you with an extended review. A few things: Flo has great ambiance, the staff is friendly, and the food wasn't bad. <br><br>I got the skirt steak egg benedict. overall it was good, i thought it was oversauced. next time i'll suggest going easy on the sauce.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vwktbXvMIBXZlLqvsFhnwg/168s.jpg", "caption": "Steak Benedict"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YX0oMVu3hNxeRzoO_cX5xA/168s.jpg", "caption": "Egg Sandwich"}]}}, {"review": {"des": "Food was amazing. Excellent service. Very friendly. Went in a Sunday morning and got s table right away.", "pics": null}}, {"review": {"des": "Some of the best New Mexico style food I have ever had outside of New Mexico. Great service, great food, and they know to to serve food \"Christmas style.\" Loved Flo's. I will be back often!", "pics": null}}, {"review": {"des": "This is my second or third time here and I usually have a great experience. <br><br>However, I was here this past Saturday, 5/26 around noon and our waitress was extremely off putting and disrespectful. The table was super wobbly and no one came around to assist us when we first sat down. I proceeded to take a few business cards from the bar so that the table would remain stable. I agree, probably not the best approach, but  I was going to pass the small amount out later to friends. The waitress finally came over, saw what I did and exclaimed \"NOT COOL GUYS!!\" It was as if a parent had scolded us. She ruined the entire vibe of our meal. She was then super rude when I asked her about certain menu items. I asked her if I could change the mushrooms out for chicken instead and she said it would probably cost $3 or $4 more. Well, what is it? It sounded like she made it up on the fly and the menu does not outline substitutions. <br>I understand if I was using the business cards incorrectly, but it wasn't my intention to deface or misuse them at all. She could have handled this in a much different matter. Instead, she decided to to make it awkward for the entire meal. I left with the feeling of not ever coming back again. Too bad.", "pics": null}}, {"review": {"des": "I came here for the fruity pebbles French toast and it was worth the trip! It looked overwhelmingly diabetic-ally sweet but I promise it's not that bad. I don't like sweet sweets so if I can tolerate it, I'm more than sure most people can! I love the soft French toast with the crunchy cereal all drenched in a moderately sweet syrup. The other breakfast items are also very good.", "pics": null}}, {"review": {"des": "Great spot! Love the food here. Always have great specials in addition to the already great food. I would say they are probably most famous for the Fruity Pebble French Toast. <br><br>I always go for the Mimosa flight- 3 different flavors, typically the traditional, then a Bellini, and another special. I typically order the Pulled Pork Frittata with the Flo Potatoes. I really like the potatoes, and you can tell they are made in house. <br><br>It gets pretty crowded for brunch, so I would recommend getting there early so you don't have to wait!<br><br>Negative: no changing tables in the restroom!! PLEASE please PLEASE install changing tables! Pretty kid friendly place other that that- the lack of changing tables is definitely a big negative.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nnCjKmPoF-CNfOG6EGFcSw/348s.jpg", "caption": "Mimosa flight $12! This week it is blood orange, Bellini, classic"}]}}, {"review": {"des": "My bf and I came here for brunch during the week. I ordered the egg sandwich and ordered the smothered burrito with red sauce. Both dishes were decent, however we agreed we would not order the same thing again if we came back. Next time, I would like to try to breakfast drinks.", "pics": null}}, {"review": {"des": "So so good! My group of 3 went for brunch last weekend: arrived around 11:30am, 20 minute wait, coffee available to us while we waited, generous portions, delicious food (Chorizo-Tamale Hash, Huevos Rancheros, Flo's Burrito and the Fruity Pebbles French Toast), red AND green chile, polite and enjoyable people from start to finish.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cLD1fYqWNtFfHNyQQeritQ/168s.jpg", "caption": "Chorizo-Tamale Hash with red chile"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AS1KY-eSzDcETQwq2-YADg/168s.jpg", "caption": "Delicious Fruity Pebbles"}]}}, {"review": {"des": "Unfortunately I think I may have hyped this place for myself. The menu didn't really have a wide variety like i excepted. I ordered the bacon chocolate pancakes and they were drowned in chocolate with little to no bacon. I also ordered a mango banana smoothie that looked and tasted like the naked juice you can buy at target. My friend ordered the chorizo eggs with beans and potatoes. The potato cubes were huge with very little seasoning and it was only on one side of the potato. The chorizo tasted like it was prepackaged.", "pics": null}}, {"review": {"des": "On a bit of a roll of late hitting up Neighborhood places that have been in the area for ages but for some reason, haven't checked them out. <br><br>Flo is the latest installment and has me wondering what was I thinking waiting sooo long. I'd heard about it in over a decade's time, have seen the perpetual, crowding brunch lines on the w/e, and read the reviews so I knew I was in for a treat. <br><br>Total payoff and as good from food to service to atmosphere that I was expecting.<br><br>The three kids we were with ALL ordered the NY Strip Steak.lol and the adults in the room went with Carnitas Tacos and a New Mexico bowl with Shrimp, Chorizo, Shrimp and a ton of other NM flavors.<br><br>Steak was good not great, Tacos and NM Bowl outstanding...as was the service.", "pics": null}}, {"review": {"des": "I waa as really hungry when I got here so I was really happy when I got a seat right away, the service was excellent, the food came really fast and was delicious. Large portions too. <br><br>I had the homemade chorizo scramble with house potatoes and black beans, which was excellent.  Interesting menu choices so I'll need to go back more frequently.  Friendly service.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Hnp4tru2eKd6du9ee4kh4w/168s.jpg", "caption": "Pulled pork over tamale. Also very good."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rphxeDNxuPYU9aLaBKfrgQ/168s.jpg", "caption": "Homemade Chorizo scramble. Delicious."}]}}, {"review": {"des": "Must try! We arrived just before the rush and were seated right away around 9:30 am on Sunday. I usually go with something sweet and to my luck they had a category named \"Sweet Tooth\"  on their menu. I went with the regular French Toast. <br><br>It looked quite ordinary and bland, but let me say after a couple bites and adding syrup the taste/ flavor was there! 3 slices of brioche dipped in egg custard served with with powder sugar on top. Classic! So if you want something sweet but not to sweet go with this option. To add a salty aspect I ordered a side of thick cut bacon. Yum! <br><br>My boyfriend on the other hand is all savory! He ordered the FLO Style. Eggs, green sauce (poblano pepper sauce), pico, black bean, and a flour tortilla. After taking a quick pic of his dish he destroyed it by mixing it all together! I don't really eat eggs, but he was definitely impressed with how tasty it was without having any meat.<br><br>They have a great patio area!  I'll be back next time to sit on the patio. Hopefully the weather isn't questionable that day!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2q_x3CDnfpiSVdCB9gooww/348s.jpg", "caption": "Love window display!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YTyevkGvbPrwKKDmy4_90A/168s.jpg", "caption": "FLO with me in style! (FLO Style)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_OMN97x2zv0507hJc_WxzA/168s.jpg", "caption": "FLO Style! Tasty!"}]}}, {"review": {"des": "This is a nice neighborhood gem.  Food was pretty good and the alcohol was reasonable.  Service is pretty good, and helpful.  The fried chicken was very good. We also had chimmichurri mussels.", "pics": null}}, {"review": {"des": "My favorite, not only for brunch, but for dinner as well. Great wine list, and always delicious specials. Get the Mussels and Flochos.", "pics": null}}, {"review": {"des": "Go there and have fun with EVERYTHING! Decor is awesome, so unique and modern. <br>People who are working there are always attentive, nice, and will make your dining experience as smooth and pleasant as possible. <br>I ordered so many times there, every time my breakfast experience was great! You should try everything!<br>Tasty food with some modern Mexican flavors. My favorites are chorizo Mac and cheese, tomato basil soup, pulses pork tacos, and many more.<br>Wonderful place to have a hearty , inexpensive breakfast, big lunch, or a nice date.", "pics": null}}, {"review": {"des": "This place was very busy when entered. I order an orange juice and the Chorizo Hash that came with two poached eggs. The food came out very fast which was nice but upon my first bite I had a mouth full of egg shells. This ruined by morning brunch and opted to not even have the item remade. Eggs are easy and so is breakfast I was not impressed with this restaurant.", "pics": null}}, {"review": {"des": "Great place for brunch. I do suggest requesting your place in line when you're headed down there; so the wait time is a little less. The spaces are tight if you're a party of two, you won't have a huge table or a lot of arm space - but the food and waitstaff make up for it! The fruity pebbles French toast was great! As is their mimosas, and the Bloody Mary was great. We did have a little bit of some issues with space and then my order when I ordered it was wrong, the waitress repeated my order, but placed a different one. Other than that it was good. Would go back again.", "pics": null}}, {"review": {"des": "Jordan and I came here for a double-date-Sunday-brunch. With a group of 4, we got seated within 20 minutes around 12pm, which was definitely reasonable. <br><br>The place is long and extends behind the bar where we were seated in a small room in the back of the restaurant. Our server was really great! He was attentive, willing to offer suggestions and checked in an appropriate amount to be helpful (yet not overbearing). <br><br>Drinks:  I ordered the Chile Verde Bloody Mary, which was interesting... and not the kind of interesting I would order again. It was average in spiciness and felt overly chunky (an adjective I feel should never be used to describe a drink). <br><br>Sweets:  Our table ordered the Bacon-Chocolate Pancakes and while you could visualize bacon pieces, the chocolate was the main player in this dish. The pancakes were tasty and sweet, but I wished the bacon/saltiness was more prominent. <br><br>Brunch:  All of our portions were HUGE! Chorizo-Tamale Hash - extremely DENSE dish with a large layer of corn masa. The sauce over it was monotonous, but the eggs overtop helped add some extra flavor. Chilaquiles Special of the Day - served an with over easy egg and I definitely thought this was the best dish at the table! Tasted fresh and had lots of complexity! DELICIOUS<br><br>Altogether, every one had a good brunch. If I were to come back, I would probably order different drinks and stick with the chilaquiles.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/86m0bgn7LG9k94w0CKRZOw/348s.jpg", "caption": "Chorizo-Tamale Hash"}]}}, {"review": {"des": "Went here last friday with some classmates. Got there as they opened. The server helped half of our group. Got them water,took their order. Took about 50min- an hour for the server to finally acknowledge the other half of the groups presence and say \"ill be right with you\" Clearly not since it took an hour. Finally we just decided as a group to leave and eat elsewhere. Horrible service...", "pics": null}}, {"review": {"des": "I've only been here once for brunch but will be returning! If you like Mexican influences brunch you will like Flo. There are several options with carnitas and chorizo. I had the chorizo skillet that was delicious and my friend had one of the breakfast taco options. We are every bite! The atmosphere is cool and relaxed. Looks like they have a neat bar too! <br>I eat a lot of Chicago brunch and the prices here are great averaging around $9. For the quality or food, service, and atmosphere, the prices are pretty low.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-oTxHg8Cz6KzQ-Cr1hoOWQ/348s.jpg", "caption": "I actually had the carnitas skillet in the foreground and my friend had tacos (I think with chorizo)"}]}}, {"review": {"des": "Came here to show my gf what New Mexican food is like. Since I went to ABQ recently for work. <br><br>Ordered the carne adovada with a side of sopapillas and honey, and a Flimbimbop ( a New Mexican take on a bimbimbop) substituted in Duck for Chicken. <br><br>The carne advoada was good but I feel the pork could've been softer if stewed in the red chili sauce longer but overall it was good. The sopapillas were amazing with the honey definitely a recommendation. <br><br>The Flimbimbop was incredible. The cheese veggies suck and red chili sauce was made even more incredible with the egg in top. Definitely recommended. <br><br>The green chili is my favorite so I definitely asked for a side and spread it all over. Great spot and great New Mexican flavors.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/de7JdqhwU-i_S-MyAD3otg/348s.jpg", "caption": "Carne Ad on the left. Flimbimbop on the right."}]}}, {"review": {"des": "Great food and a homey weekend vibe with families, this place is great for the neighborhood. The food was delicious and sold at a very reasonable price and without usual brunch pretentiousness. Fruity pebbles with French toast and the steak Benedict were both delicious. The wait wasn't issue despite coming at prime time brunch hours but I would recommend placing a reservation if at all possible.", "pics": null}}, {"review": {"des": "Solid brunch spot.  Haven't tried it for other meals.  Great egg dishes, and the fruity pebbles french toast is fun and tasty.", "pics": null}}, {"review": {"des": "I'm going to start this off by saying that I'm a real New Mexican. And this is a New Mexican restaurant in Chicago. So my expectations (nay, hopes) were high! It was super hard to reach the restaurant, their reservation website didn't fully work, and this location didn't return my reservation phone call for over a week. When I finally got through, I was able to make a reservation for 4.<br><br>We went tonight for dinner. The neighborhood, atmosphere, and decor were all absolutely darling. We started off with a round of cocktails, which were decent, but not mind blowingly inventive. I ordered a round of nachos as appetizers, which took a pretty long time to arrive, but were super delicious. We decided to place our entree order when the appetizer came, based on how long it was taking. Most of us ordered the green chile enchiladas (classic!) but I got the veggie burrito with chicken and my husband got the green chile burger. All were tasty, but again, not authentic. The green chile tasted like a poblano sauce with cilantro- which was interesting, but should not be calling itself hatch green chile sauce. That's sort of sacrilege. Everything was MEGA seriously salty. A little too salty, sadly. <br><br>Plus was that our waitress knew what Christmas meant. (Half red, half green)<br><br>Minus- we asked for sopapillas with the meal. Not only did they not come with the meal, but I had to hunt our dear waitress down to get them. And when they came (*gasp*), they were pallid, round,  thin, and sad. And $4 each. Also sacrilege. Sopapillas should be thick, square or oddly shaped, deep golden brown, and not resemble tortillas in any way, shape, or form.<br><br>I wanted to love our waitress. She was cute and preggers and initially seemed cool. But damn, the service was slow. And we never got a water refill, even when all the other tables seemed to. And that shiz was salty. Le sigh.<br><br>So, overall, I'm super disappointed from a NM standpoint. Otherwise, if you're comparing this to regular Mexican food in the city, it's pretty good. I'm sad! I wanted this to be my new obsession! But I guess we will wait for the next NM joint to pop up in a few years.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uYDS_5y_rH53m7DNDYKZng/168s.jpg", "caption": "Vegetarian burrito with chicken, \"Christmas\""}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1PA6OE8YgaM6Ro8jCuCw8w/168s.jpg", "caption": "Green chile burger"}]}}, {"review": {"des": "I came across Flo through Instagram. I'm a French toast lover and when I saw pictures of their Fruity Pebbles French Toast, I just had to check it out. I came on a Saturday around 10 am and I think this was one of the best times to do so. I talked to one of the workers and he said weekends usually get packed after 12 pm. The place is small, so definitely come in early if you want to get seated quickly. <br>The fruity pebbles French toast was AMAZING! Probably the best I've had. I'm coming back for their Cocoa Pebbles French Toast.", "pics": null}}, {"review": {"des": "This place is great for brunch! Not only is it easy to find parking in the neighborhood on the weekend, but there is great tasting complimentary coffee while you wait for a table.  While the place was really crowded, the wait was only 15 minutes at noon on a Sunday.  The atmosphere is cozy and inviting and the staff is very nice.  We had a sweet and savory combo with the Red Chilaquiles and Flo's famous Fruity Pebbles french toast.  The chilaquiles were very flavorful with a good level of spice.  The french toast was nicely balanced and not overly sweet.  The Fruity Pebbles add a nice crunchy texture, which makes this french toast truly unique.  I would definitely recommend this restaurant!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9tEoPYg8MmqobHjRog3yVA/348s.jpg", "caption": "Fruity Pebbles French Toast Madness!"}]}}, {"review": {"des": "I was attracted to this place because of the fruity pebble French toast, so i stepped in to check it out. It's beautifully decorated, and the service is great. However, I have to admit that the food is just meh; it's average. During my visit, I split the fruity pebble French toast and the borracho cheeseburger. The French toast was okay, but nothing above average. The burger was also just okay, and it was accompanied with potatoes that lacked seasoning/flavor. I guess in conclusion - both dishes were underwhelming, and for the price, well, I don't really see a reason to come back. Perhaps I caught them on an off day; who knows? I do know that with Chicago having a plethora of good, cheap Mexican food options, I won't be coming back here if i don't have to.", "pics": null}}, {"review": {"des": "Awesome breakfast at Flo! I went for the fruity pebbles french toast which was delicious and topped with lots of fresh blueberries and strawberries. A side of crispy bacon and great coffee was just what I needed to start my Saturday. I was there at 9 and by the time I left it was packed!", "pics": null}}, {"review": {"des": "That burrito was AMAZE BALLS! Smothered burrito. Wife's breakfast was just a simple breakfast, but we enjoyed this little funky Mexican getaway for breakfast.", "pics": null}}, {"review": {"des": "Just ate here for the first time I am from out of town but in visiting for a little bit and a friend recommended it. I had the Chorizo scramble on their breakfast menu. It was great. I also love that they are pet friendly! I brought my cat in his backpack and no one seemed to mind at all. I would def go back.", "pics": null}}, {"review": {"des": "Check your credit card if you left a tip via credit card. I left cash tip, wrote CASH on the tip line on the receipt. Still was charged an extra $3 <br><br>Will never return. I contacted MasterCard for the fraudulent charge. <br><br>I would give 5 stars for the food and drinks tho. Too bad. Too many places to go that won't rip you off", "pics": null}}, {"review": {"des": "Loved the barbacoa tacos I ordered for lunch. Perfect portion and perfect price. The location is conveniently located and the place has a great vibe.", "pics": null}}, {"review": {"des": "We came here because of the awesome photos of the French toast with cereal we have seen online. We ended up getting a coffee and the steak Benedict. The steak was overcooked and the potatoes were not that good. The sauces they had at the bar were very good and complimented the food well. They had a Chipotle, habanero, and a vinegar sauce. Not sure how good the French toast is but I am looking forward to trying it next time!", "pics": null}}, {"review": {"des": "I came here with 7 of my friends for brunch on a Saturday. The wait wasn't too bad, I believe it might have been 15 minutes. They had coffee available for us to drink while we waited for seats to become available. They have a great selection of food and drinks. I got the Flo's egg white omelette and it was great! If you come here with a group be prepared to split the bill evenly no matter what you get. Unfortunately for me since I was paying for myself and my boyfriend I ended up paying around $20 more than I would have if they could've given us individual checks. Overall it was good but with the whole bill splitting situation I wouldn't go back.", "pics": null}}, {"review": {"des": "This place was SO accommodating - I showed up in kinda of a time crunch with 7 of my friends - we had to wait about 30 minutes total (with their free coffee they offer to all guests) but they were able to accommodate our large group for a relatively small restaurant. We got our order in right away and the food came fast, and hot! It was really good, I loved the Mexican flare that they have on all of their food making it super flavorful. The only issues we had was that they bring out the bill as one large bill - apparently, this is a very popular thing to do in Chicago so I won't hold it against them, it just was not what we were used to. I would go back if I was in the area again, yum!", "pics": null}}, {"review": {"des": "Tried the fruity pebbles French toast and it was good but not great. However, I tried some of my family members dishes (the real food in the menu) and they were so savory! I'd come back again.", "pics": null}}, {"review": {"des": "My review is more of a 3.5 stars. I'll divide up the review based on positives (+) and negatives (-) of my experience here. <br><br>(+)<br>-Service was awesome! Our waiter was friendly, very prompt, checked in with us appropriately, and was willing to snap a picture of us at the end of the meal, as well.<br>-The menu had lots of different options. Everything looked appealing to me and it was hard to decide on one thing to order. There was a really good mix of healthy and unhealthy options, with plenty of sweet and savory. <br>-Even though I didn't personally try it, my friend ordered the kale smoothie, which she thought was really good. The fact that green smoothies are even on the menu is a DEFINITE plus in my book. If I ever come back here, I'll definitely want to order one.<br>-Good price point. Everything felt fairly priced. My entree was only $10!<br><br>(-)<br>-You can't sit down until your entire party is there. I dislike this because this place definitely wasn't hopping with people. Luckily, the longest one of the party had to wait was 10 minutes because she had arrived early.<br>-The food itself was generally A-OK, if not a bit underwhelming. My friend wasn't too impressed with her egg white omelette and potatoes. I tried the potatoes and I have to say I can't blame her for leaving those virtually untouched. They were completely flavorless. <br>-My fruity pebble french toast was nothing special. It was much, much too sweet. There had been no indication in the menu that they would be completely drenched in sugary syrup in addition to the sugary cereal. But, then again, maybe that's what I get for ordering them! <br><br>Overall, it was a fine experience. I wouldn't go out of my way to come back here, but we definitely still enjoyed ourselves.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pS6-PI69rZlmqoTrXp-w7Q/348s.jpg", "caption": "Fruity pebble French toast"}]}}, {"review": {"des": "Arrived around noon on a Friday, there was no wait and we were seated immediately. We tried the fruity pebbles French toast (which was delicious), red chilaquiles (also, good with a small kick of spice!) and flo combo. Definitely enjoyed brunch here! The restaurant has art hung on the walls w a beautiful ceiling and well spaced tables, makes for a nice casual ambiance.", "pics": null}}, {"review": {"des": "We went here for breakfast on a whim and ordered a burrito, pancakes and an omelet. They came with potatoes and toasts. Really liked the place, it's a little gem. Waitress was nice too. Find this place a visit next time you're in the area.<br><br>Also, there have their own hot sauces that your should try, they're good.", "pics": null}}, {"review": {"des": "The line / waiting area is an absolute disaster. They really need to fix that. We waited amongst a large unorganized group of people and had to ask a server to find someone to put us on the list after being totally confused as to what was going on. We were not the only people confused by this.<br><br>That being said, they have an interesting choice / mix of bloody Mary's and Mimosas. I had the Jalapeño Bloody Mary which is literally puréed jalapeños instead of Tomatoes and it was delicious. They also make their own hot sauce which is amazing (I'm totally a spice connoisseur). They have a Habanero / Carrot / Honey hot sauce (orange), a Jalapeno / Garlic / Honey hot sauce (green), and a Chipotle / Mustard / Honey (red). I tried and loved them all but the red sauce was my favorite.<br><br>Onto the food... my wife had, and loved, the cocoa pebbles French toast. Three glorious slices of Texas Toast presented perfectly with strawberries and delicious. I've had a love affair with good Chilaquelles since first learning about them at a little Mexican diner down the street from me. Since finding the Cozy Corner Chilaquelles, I've been on a quest to find better ones and have always came up short, until today. Their chicken Chilaquelles are the best of any restaurant I've had (out of about 23) in Chicago. The server was also quite good, so I'll give the lack of a competent host/hostess a pass.<br><br>Overall excellent food and quality for the price.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ADQvTO91nwDAX0hLeVpsoA/348s.jpg", "caption": "Their house made hot sauce, Habanero (orange), jalapeno (green), and New Mexico red Chile (red). They were allquite tasty."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RllOw9qEisjPGUrx748Z-g/168s.jpg", "caption": "Cocoa Pebbles French toast!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zulr3qg1gxuz7nyeBbZa4A/168s.jpg", "caption": "Chilaquelles Verdes"}]}}, {"review": {"des": "First of all, if you like to drink then this is the place for your drunk ass.  They have tons of variations on mimosas and plenty of awesome cocktails. There is nothing better than starting your weekend off with five hibiscus mimosas and some amazing carnitas hash.  Food is great !!!  Music is great!!  Service is top notch !!!! <br>Go here and enjoy yoooooo self", "pics": null}}]}