{"name": "flub-a-dub-chubs-chicago", "reviews": [{"review": {"des": "Who doesn't love a Chicago dog with the works? My wife is a hot dog fanatic and she's vegan. We have our go-to hot dog place at home (Las Vegas), but no Chicago dogs there. We pass through Chicago often and needed to find \"that\" place in Chicago for a great Chicago dog. <br><br>My wife wasn't with me this trip, but we had identified this joint as having great yelping potential. To find out, I sacrificed myself for my wife and had a regular AND a vegan flubby with the works. As others noted, the bun isn't poppyseed, but since I don't like poppyseed, who cares? It's not a detractor.<br><br>Here's the thing: I ate the regular flubby with the works side-by-side with the vegan, so I could report back home. The regular was fantastic! But, surprisingly, the vegan was even better!!!! Let me say that again: the vegan was better! What? How did that happen? AND it was Flubtastic $4 Tuesday! Each dog with fries or tots was $4!!! I spent more on the \"L\" getting here!<br><br>So, looking for a good dog, Flub A Dubs is excellent. Want Vegan options? They got 'em... Including vegan chili to make that vegan dog a solid chili dog... but after two hot dogs, that'll have to wait until the next time I come to Chicago.", "pics": null}}, {"review": {"des": "Love this place. Their food, while simple, has some great touch. It's very hidden but has quite a good rep in the area.<br><br>Their portobello mushroom taste great. And their cheese sticks is the best out in the neighborhood. Everyone should give it a try. It's very different from the ones around. <br><br>While they have a hot dog for logo they have healthy options like lettuce bun. Very modern for a traditional themed restaurant.", "pics": null}}, {"review": {"des": "I walk by here all the time and decided to stop by here after work for dinner.  You have to walk down a set of stairs in order to enter the place. There was hardly anyone there when I came. Each night they have a diffetent special. Last night (Wednesday), they had a build your own sandwich with either fries, tator tots, or a salad for $10. You had the option to choose your meat, cheese, sauce, side, and 2 toppings.<br><br>I ordered The Roe burger, which is one of their specials and I was able to get the special $10 price. It had thick beef patty that was grilled with cheddar cheese, avocado,and  bacon on a pretzel bun with tator tots. Wow! This burger was huge and so good. Very flavorful. The avocado and bacon were nice touches. <br><br>People who love ketchup on their hot dog, beware of getting your picture taken and put on the wall of shame! <br><br>I'll definitely be back!", "pics": null}}, {"review": {"des": "I was told that I should get an Italian beef sandwich in Chicago and this place did not disappoint. Not only was the food delicious, but the people and service was amazing. It seemed to be run by an extremely nice family. The mother of the group stoped to talk to all the customers while<br>She brought out their food, and was so friendly that I would come back just to experience her hospitality. It fulfills the notion that sometimes the best restaurants are the one that look like a \"shady whole in the wall\"", "pics": null}}, {"review": {"des": "The Chubby with the salad (italian dressing) is as good as a Chicago-style classic dog gets. Generous salad portion plus a perfect grilled dog!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zjUzYkmvYCUCwd8xvQc0hg/348s.jpg", "caption": "Yummers"}]}}, {"review": {"des": "Came here on a whim randomly since I was nearby. I've always passed by it but never actually went in.<br><br>I got the two dog special and one was the coney and the other was the Chicago dog. I was able to upgrade based on the difference which is cool. The Chicago dog was normal, but the coney dog was unbelievable. The chili is house made and tastes so amazing! They even char the hotdogs so it tastes a bit more smokey. The tots were extra crispy which was also a plus.<br><br>The lady behind the counter was sweet, I think she was the owner and works during the day. She brings out the food for you and makes small talk. I'll be back for more coney dogs, it was probably one of the best hot dogs I've had.", "pics": null}}, {"review": {"des": "The Jimmy Chili Cheese Dog here is DELICIOUS! Ya ain't had a chili dog until you've had one from here! The touch on onions and mustard is a must! My husband gets the Chicago style dog and he loves loves it! In addition to their delicious dogs (so many to choose from!) they have great service! The same guy has checked us out the four times we've come, and I'll learn his name next time! He's friendly and helpful and generous! No doubt we will continue to come back here each time we're in the neighborhood and in the mood for some good grub!", "pics": null}}, {"review": {"des": "Really good super dog, burger with goat cheese and fresh fries. It ain't much to look at (though the coloring that covers the walls is nice) but great service and A-plus charm", "pics": null}}, {"review": {"des": "If this was an exam, they Flubbed it. Sorry.<br><br>Flub a dub - so friendly but expensive. Sounds kinky. Tastes manky.<br><br>Amazing decor and really lovely service from the gay guy who was really sweet to me - and I think he had a crush on me. (Tosses hair)<br><br>The dog was not on a poppy seed roll and was kind of dry and unimpressive. Like, badly so.<br><br>The tater tots were boring - but it's nice that they had them as an alternative option. Still, they tasted like they were straight from the freezer, lol. Yawn. <br><br>Agreeing to the tater tots instead of the fries made the wait time kind of long and I wish I ordered the french fries instead - although judging by the standard of the other items I wouldn't have liked them.<br><br>It deserves less than 3 stars because not only was it one of the less impressive Chicago dogs I've ever had (and worst 5 in Chicago, and I've tried 100 or so), but it was one of the most expensive too (like 1-3 dollars more than every other version I've had in town). However, the wonderful service means 3 stars it is.<br><br>And if you disagree with this review, I don't give a Flub. It blows, even worse than your last Blow Chub.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SijtXkpH4VVHxHMUcal-tw/348s.jpg", "caption": "This basement smells celery"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zrfk1PK_IXwtVqhtrNGKFA/168s.jpg", "caption": "I have the same rule about nobody under the age of 17 but it's more to do with mayonnaise than ketchup"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vsE33YMGbOtx1UxmsHHhcg/168s.jpg", "caption": "I couldn't find her on the menu unfortunately"}]}}, {"review": {"des": "This little dive is a great hideaway from the hustle and bustle of Chicago. Walk down the stairs to enter this eatery and you are immediately greeted with wonderful artwork owing tribute to hot dogs and Flub A Dub Chub's. <br><br>Obviously, this is a hot dog joint...so I ate a hot dog. I ordered the Chubby with fries and it was delicious. It came warm and loaded with dill pickle, peppers, tomatoes, onions, and TASTE!  The fries were perfectly crispy. <br><br>A nearby diner ordered one of their cheeseburgers and fries. I'm not sure which one, but it had a pretzel bun and loaded with lettuce, tomato, and other additions.  I was told it was fantastic. I could see the meat patty was thick and juicy. <br><br>All in all, it was a great diner with awesome atmosphere.  You won't be disappointed. Also, there's lots of parking out front. Look for the parking kiosk down the street.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yJ9fizN7V3-piDf49fMRkQ/168s.jpg", "caption": "The Chubby with Fries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gyYGzDK2KU3aqJQGXHUmnw/168s.jpg", "caption": "Pretzel bun Cheeseburger and Fries"}]}}, {"review": {"des": "AMAZING -NESS THIS HOLE IN THE WALL BASEMENT HOT DOG GOODNESS <br><br>+ The Flubby (aka the Chicago Dog $5.50) - Classic beef vienna dog with all the typical \"chicago\" style hot dog toppings. <br><br>+ The Monster ($9.50) spicy mike ditka polish sausage with mustard, grilled onions and sport peppers. - my dad had two of these dogs & was obsessed with the flavor of the sausage. <br><br>But what I-IRENE loves about Flub A Dub Chub's is that they have VEGAN options & that their salads are DELICIOUS. <br><br>100% satisfied.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5lGOA7AV199WlbVvCFu4cw/348s.jpg", "caption": "Onion Rings"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aMUP51zY_Kf-QYTpefwPrQ/168s.jpg", "caption": "Mr.Big"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5vD1Y6TTNxUnb5bxGG5wCg/168s.jpg", "caption": "Chicago Dog"}]}}, {"review": {"des": "Wow the one of the best parts of this place is being able to tell people \"oh we're going to Flub a Dub Chub,\" or \"you gotta try out this place called \"Flub a Dub Chub\"<br><br>This place is a small joint with limited seating but they serve all these great things there. We got the classic Chicago Dog with fries and a Chili Cheese dog.<br><br>Both were great and I wish I got to try everything on their menu. <br><br>Will definitely be back when I visit Chicago", "pics": null}}, {"review": {"des": "Flubs is definitely where the best hot dogs are in Lakeview. <br><br>Though slightly hidden, I can't get enough of their pull pork hot dog. Paired with the tatter tots, there's just no comparison. The staff is super friendly, the manger/owner always makes great conversation, and it's a pretty affordable meal for how much food you get. <br><br>You don't have to be in baseball season to eat ball park food. Flubs hits a home run year round with their food.", "pics": null}}, {"review": {"des": "Chub's is a tiny hot dog joint tucked away near Boys Town underneath a sex shop. They specialize in all sorts of unique hot dogs (of course) and other hot dog restaurant related items.<br><br>I came here with a group of friends while I was in town for the week, and I enjoyed it overall. The food was on par as far as Chicago dogs go, but nothing too mind blowing. I think their claim to fame was their pulled pork hot dog.<br><br>I particularly liked the art they featured from their customers which were all hot dog spin offs of pop culture references. Be sure to check in here on Yelp for a free soft drink with refills!", "pics": null}}, {"review": {"des": "Flub's is on the short list of places that make a distinguishable hotdog. Big Guys Sausage Stand & Fatso's also come to mind. I'm not sure what it is exactly, but Flub's knows what they're doing. They also have one of the best short order burgers in the area. Burgers are well seasoned, have a nice flame grill char and will satisfy the burger minimalist or the diner that prefers to load up on toppings. The staff is friendly and they usually throw in a free soda when I order. Definitely worth checking out if you're in the mood for a hotdog or an above average burger. Prices are very reasonable considering the quality.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/d_TDlvHfOI2-YvnXROTrNA/348s.jpg", "caption": "The Famous Roe Burger"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/x0hrcfkjJot4nt0PS_ufnw/168s.jpg", "caption": "The Roe - Cheddar, avocado, bacon, lettuce, tomato and onion on a pretzel bun."}]}}, {"review": {"des": "Great hotdogs! Fries and tots were okay. <br><br>If you order online, everything is $2 more. Really for no reason. I asked the guy there because I ordered take out, and when I went to get it I noticed the menu... he said to order through their own website next time. :/ Bummer. Hotdogs are already like $7, online they are $9 through any site not their own. They do come with a side. <br><br>Def hole in the wall Chicago vibe, good rep of iconic Chicago hotdogs, too.", "pics": null}}, {"review": {"des": "I ordered delivery a few weeks ago as I was craving a burger. I have had Flub A Dub Chub's a couple of times as I used to live at Briar and Lake Shore and they have solid burgers. Flub A Dub Chub's is a fast food joint that serves Chicago style food. The inside is pretty neat as they post artwork of the customers around the joint. The place can be easy to miss as it's below ground, but it's right below Monsignor Murphy's. <br><br>I ordered the Roe, which has avocado, bacon, and LTO, and a side salad. I would also recommend Grandma's K, Greg's Hangover, and the Bryan Burger. I haven't had a bad burger here. The salad was nothing special, but you shouldn't expect it to be anything special since this is a fast food spot known for hot dogs, burgers, fries, milk shakes, Italian beef, and other fried food. <br><br>The prices are fair as the quantity is pretty big. They offer some very solid food if you are craving a quick bite to eat at a low price.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Lj7Vwy1YDqU1o4MZ0i6sSQ/348s.jpg", "caption": "The Roe Burger with a side salad. Will admit that this picture doesn't do it's justice..."}]}}, {"review": {"des": "I called to verify hours on 4th of July and the incredibly rude person on the phone answered the phone screamed no delivery and then hung up. I've never been here nor ordered from here but you just lost 2 potential customers. Get some manners.", "pics": null}}, {"review": {"des": "Dry and well done. Unfortunately, I ordered my burger medium. Order a hot dog or go to McDonald's and save yourself $5.", "pics": null}}, {"review": {"des": "I have driven past this place and never even realized it existed. The name is a little random and I didn't know what to expect while walking down to a basement but I was surprised to see a brightly colored yellow room with hot dog artwork all around. It was a fun surprise. <br><br>They had a lot of funny and yummy sounding choices for hot dogs. They also offer tots as a side! I was even more surprised when they gave a few tots with the fries. This place is worth a try!", "pics": null}}, {"review": {"des": "Exactly right...this place was exactly what I was looking for.<br>I am visiting Chicago for a couple of weeks, staying at a friends place in Lakeview. Had a sudden overwhelming craving for a burger so did some extensive Yelp research and it did not steer me wrong. I walked over and ordered a cheeseburger, medium rare. I also asked if I could get a mix of tots and fries and they happily obliged. I don't eat food like this very often so when I do I want it to be the best of its kind. The burger was cooked to perfection and the fries/tots were fantastic. I read someone else's review of fries and they made the point that if you can eat them without ketchup (or anything else, for that matter) happily, then you have the perfect fry. Which these were. <br>The guy running the register was very sweet, I ordered it to go and was out in 10 minutes.<br>Perfect.", "pics": null}}, {"review": {"des": "Absolutely wonderful!!! <br><br>I got the two hot dog deal with vegetarian hot dogs with the works and fries for $8.95. This was my first Chicago dog and I am converted! Fries were great, buns were incredibly soft, the pickle was perfect, and I just loved the complex flavors in every bite! I did not put ketchup on my dogs, but the fries were perfect with it. Crisp, fresh, hot, flavorful, delicious. I got two because I'd seen that price in a review here and thought \"what a deal!\" - but I definitely only needed one dog for a full meal!<br><br>I am not a milkshake person at all, but after reading rave reviews on here, my friend and I decided to split one. Easily one of the best milkshakes I've had in my entire life! The owner was proud to tell us she made it herself and that the secret is great ice cream. I believe it!!! Every sip was like drinking chocolate cream! [heart eyes emoji!]<br><br>The owner deserves a special shout out. She was conversational in turn with letting my friend and I eat in peace, then checking in with us. It was so obvious this restaurant is a labor of love and she knew everyone who walked through the door (other than us, of course!).<br><br>We came at 12:30 on a Monday and had no trouble getting a table, but I can easily see the joint filling up quickly. The ambiance of underground, locals-eat-here, old style diner (complete with red and white checkered tablecloths and customer-drawn art on the walls!) was so appreciated. I loved this little hole-in-the-wall space with the personality to boot! I would EASILY become a regular if I didn't live across the country.<br><br>PROS: Awesome local ambiance. Real hotdog tasting, perfectly textured, delicious vegetarian hotdogs. The flavors were great. Plentiful portions. Tons of options. SUPER reasonable prices. AMAZING MILKSHAKE!!! Owner is a perfect host. And, honestly - the name. What's not to love?!<br><br>WISH I HAD: Next time, I'd definitely ask for more pickled peppers on top so every bite can have their delicious zing. Also, I wish the buns were poppyseed - although I might have just missed an option to request that! Oher than that... I just wish I had an order right now!!<br><br>CONS: Absolutely none. Go here now!!! Yum!!!", "pics": null}}, {"review": {"des": "This place was awesome.  It is not the easiest to spot, as it is underneath a nail salon (I think), but it is definitely worth the search.  The guy running the place could not have been more welcoming and kind to our large group, giving us \"welcome-to-chicago mozzarella sticks\" on the house and tiny condiment sized cups of chocolate shake for the kids.  <br><br>The hot dogs were amazing.  Admittedly, this was my first Chicago dog experience, but given that I am a die hard fan of both New York pizza and hot dogs, and I have raving reviews of these dogs, it means a lot. <br><br>The restaurant aesthetic is pretty cool with a hole-in-the-wall feel.  The crayon colored pictures that adorned the walls gave it a fun touch.<br><br>We will definitely go to Flub A Dub Chub's again if we are in Chicago.", "pics": null}}, {"review": {"des": "I really wanted to like this place, but I think it's more that I'm not a huge fan of the Chicago hot dog, which is why I wasn't thrilled by the food here. I know I'm going to get a lot of hate for that, but just the mixture of tomatoes, pickles, and peppers was so overwhelmingly sour that I had trouble enjoying my hot dog. Anyways, the owner was really nice about explaining the menu to us and the food was prepared and ready in less than 10 minutes.<br><br>I ordered the flubby with tater tots and cheese sauce- the beef sausage was delicious and I really liked it. I just wasn't a fan of the Chicago style, as it was overwhelmingly sour (just take my review with a grain of salt on that recommendation). Tater tots and cheese sauce were great and it made me reminisce on some good high school lunches.<br><br>Overall, I can see why so many people like this place. Service was good and the hot dogs were juicy and tasty. I just personally didn't like the Chicago style.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/H3ljXkBrwANv87WXpN2tHg/348s.jpg", "caption": "The flubby"}]}}, {"review": {"des": "You can't go wrong with this place. It's located in a basement style shop, down the stairs off the Main Street. It's tiny, it's divvy but it's absolutely delicious. If you're looking for a Chicago style dog, this is the place. Delicious, cheap and extremely satisfying. Fries are amazing too.", "pics": null}}, {"review": {"des": "I LOVE THIS PLACE! My fiancé usually gets the chubby (I think that's what it's called) and tots. So it's a Chicago dog. I usually get the coney and then cheese tots. I've had the chili cheese fries but I would say the tots are better. Their milkshakes are so yummy too! Cookies and cream, mmmmm. They have crayons and paper for you to color on while you wait. I've been here around 4 times or so now and I have never left disappointed.", "pics": null}}, {"review": {"des": "Awesome place great hot dogs and service!!! The man that took my order and who charged me was so kind. Will definitely come back!!", "pics": null}}, {"review": {"des": "I'm a huge Flub a Dub fan. Best Chicago-style dog in the city if you ask me. The combo meal with fries is incredibly cheap for as much as you get, it really can't be beat.", "pics": null}}, {"review": {"des": "Finally got here and it only took five visits to Chicago. <br><br>The menu is very clear cut, but you can ask for some customizations. I only like my onions grilled and they were able to make that happen for me. <br><br>I also used a yelp check-in, so I received a free fountain soda SCORE! <br><br>The staff were friendly and answered my questions about other items like, was their red onion marmalade the same as the onions that nyc hot dog stands used. It wasn't. <br><br>While I was waiting on my food, they looked up and printed the recipe to the onions I mentioned. We had funny convo about. They joked about putting it on their menu in my honor. Lol. <br><br>Also, I stopped in FADC after leaving the supermarket across the street and had purchases in my hand (yeah, I refuse to pay 7 cents for a bag) they were kind enough to give me a bag for free. <br><br>The hotdog I had was superb and the fries perfectly seasoned. <br><br>I plan to stop in again before I leave Chicago in a couple days. <br><br>I have my eye on the chili.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OHV2UgIZB6Cu1kBthrpncg/348s.jpg", "caption": "My Flubby dog with pickles, grilled onions and relish."}]}}, {"review": {"des": "This family run, hole-in-the-wall establishment actually serves some pretty bomb hot dogs + tater tots!<br><br>The Flubby and The Chubby are their most popular hot dogs, complete with a side of fries or tater tots. <br><br>We opted for the Flubby + the works \"Chicago Style\". <br>Each bite was glorious. <br>Refreshing yet savory.<br>Then onto the tots.<br>Perfectly deep fried.<br>I'll be back.<br><br>Yelp checkin gets you free fountain soda", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EfJCIsIw1SNzh38XuPcplA/348s.jpg", "caption": "Chicago style hot dog #1 on the menu - refreshing and perfectly cooked tots"}]}}, {"review": {"des": "I ordered hot wings and got a bunch of drumsticks in buffalo sauce. Only two flat pieces of the wing. Fries cold and the hot dog was okay for 9 bucks a rip off. Had to go downstairs to get my order. There were firemen at the elevator however the Freight elevator was working. Just okay and not sure why fries were so cold when the place is 5 minutes from me. Oh well you live and learn. 12 bucks for buffalo drumsticks with bland flavor. thanks", "pics": null}}, {"review": {"des": "This place is actually so good!! My boyfriend was begging me to try for a longtime since we live right down the street, I was Hesitant.<br><br>Last night was finally the night and it was coincidentally &10 burger night. The burger deal is great, create your own burger with lots of choices and toppings, plus fries (cheese too)! I also took advantage of the check-in deal for a free drink.<br><br>We got ours to go and that took around 10 minutes. The space is small but clean and just what you'd expect.<br><br>Fast forget to getting home and eating: so good! Quality burger, couldn't finish it! I love fries and these were seasoned right and with the cheese sauce .<br><br>Happy to have tried and will be back.", "pics": null}}, {"review": {"des": "Everything that a good chicago dog should be. I took my dad when he was in town visiting and he literally hasn't stopped talking about it. I think it was the highlight of his trip.<br>The husband and wife that run the place are so friendly and welcoming. Will definitely be going back and bringing out of town'ers that are craving a real deal dog.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Rhi-yCoKmc07HBNnTelEcg/348s.jpg", "caption": "Perfect dogs and crispy fries. YUMMM"}]}}, {"review": {"des": "First visit.   They have a veggie dog so I was compelled by my boyfriend to check it out.   It's a cute tucked away place with kids drawings for decor.  It's counter service hot dogs and they want prepayment for the tip which I'm not a fan of fine.   As for the tots they were delicious.   The hot dog though left a lot to be desired.   The outside sheathing of it was very difficult to chew though - and I've had plenty of Vienna beef dogs before and not experienced that.", "pics": null}}, {"review": {"des": "While most go here for their Hot Dogs I'm a huge burger fan at Flub's. The fries are always fresh and hot too. A true gem.", "pics": null}}, {"review": {"des": "Look at the pics below and there you'll see God's work in all its everlasting glory. Thank you father. I mean it. I have NEVER, EVER, had a better hot dog in all of my 30 something years! NOT EVER. God is too kind. <br><br>First, don't kid yourself - get in here! Your whole entire complete life will be made better and whole by it, I promise. <br><br>I've been here twice now (that's my new rule for a review - twice or more, excepting if something egregious happens during my visit, but I digress). Let me start by saying my meal was so much FUN to eat. Like, seriously, I had an AMAZINGLY FUN time eating this meal!!! <br><br>First, I ordered the chihuahua, which is a bacon wrapped dog topped with avocado slices and pico de gallo. It came with a side of my choice; I chose tater tots. Gawd. The devil out here taking L's for this one. <br><br>The hot dog was so PERFECT I almost cried when faced with the fact that it would soon be a thing of my past; Sad times. I ordered some chili on the side, which I had big plans for once I got the hotdog down. When I did, I poured the chili onto the tots, and BAM! - the second coming!!!!! All of it was perfection. <br><br>The atmosphere is a hot dog stand; not much to describe there. The place is run by an ADORABLE older couple and they are SO sweet and super personable. I loved them. They checked in to make sure everything was tasty, which it was. The husband even offered to change one of the TVs to whatever I wanted to watch. So sweet! <br><br>Everything you see came to $13 bucks; what a steal. THIS PLACE IS A GEM IF I'VE EVER SEEN ONE. Exemplary customer service, delicious and thoughtful food and a thoughtful menu. Cannot be beat. Cannot be beat!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sj-L5Wmyi2QMENMmzlpvlg/168s.jpg", "caption": "THE SECOND COMING."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ifYTRip-bUcqaOyi6j58Tw/168s.jpg", "caption": "Bacon avocado wrapped dog with tots and chili on the side."}]}}, {"review": {"des": "Literal definition of a dive hamburger joint.  I had been wanting to try Flubs for a while, and I can honestly say it did not disappoint.  I had 2 Chicago dogs with tots and it was awesome.  Everything on the hot dog tasted really fresh, and the tots were super crispy. <br><br>They have a pretty wide variety of hot dogs and hamburgers, and the guy working that night told me one of the burgers won best burger in Chicago a few years back.  They also have several vegetarian hot dog/hamburger options, so don't be afraid to take your non carnivorous friends.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pl6R9ztXIf7kWY4VPiQZxw/348s.jpg", "caption": "Chicago Dog!  Credit: Shannoninthecity.com"}]}}, {"review": {"des": "As a Chicago native, I've tried a lot of Chicago dogs. This has got to be one of the best I've tried. The balance of toppings is delicious, the ingredients taste fresh, and the fries were served piping hot. We came here just before they closed, and they still graciously served us. I don't live in the neighborhood which is probably a good thing, because I'm afraid I would be stopping by far too much. Get a hot dog. Drag it through the garden. Enjoy your visit to FADC.", "pics": null}}, {"review": {"des": "This place is a hidden gem. Great burgers and hot dogs. I wish you could get items without fries but that's not a huge deal. The owners are fantastic and really welcoming. I usually am here midday on the weekend and it's not too busy. If you're like me and dig a good hot dog/burger stand, definitely check it out.", "pics": null}}, {"review": {"des": "I adore this neighborhood gem. It's where you can get a quality Chicago hot dog with fries and a drink all for 6 bucks! And it's damn good! My food is always hot, fresh, and they have speedy service. I've eaten the clubby dog, chili cheese dog, and I've had their corn dog! All of them are excellent. Their fries are the best I've ever had because their the wide ones dusted in celery salt! If you check in, you get a free food fountain pop! Go get flubby folks!", "pics": null}}, {"review": {"des": "Fantastic!!<br>The hotdogs were plump and delicious!<br>For a delivery....cheese and chili and condiments were all on the side. Perfect! <br>Wrapped and separate. <br>Chicken tenders were crunchy and the food was Yummy!", "pics": null}}, {"review": {"des": "As a few tourists who had never been to the Windy City, my friends and I had to have a Chicago style hot dog before our trip came to an end.<br><br>The unassuming little shop is on the lower level of a brownstone, so watch your step going down the stairs especially when its icy out. The interior is extremely charming as its decorated with funny little illustrations about the shop and Chicago style dogs.<br><br>The Chicago style dog was great, and the tator tots were fried to perfection.<br><br>If you're searching for a classic, look no further!", "pics": null}}, {"review": {"des": "The absolute best.    As good as it gets for Chicago dogs.  The older couple and their son would seem to be the owners and they deserve a goddamn medal.   The food is always extremely fresh and served with excellent care.  No squashed hotdog buns, or limp pickles, or burnt fries.   Almost excellent food. The service is kind.   They have crayons and paper for the kids.  <br><br>Very few institutions of any kind are flawless.   Well, Flub's is flawless.", "pics": null}}, {"review": {"des": "This place has the best tots in town. Super crush and fresh. I love their chubby hotdog with da works which is always the go to. Their service is great and the guys there are always friendly. I got free chocolate chip cookies last time I got right when they opened but their kitchen needed more preparation. When I was there last weekend, my best friend was craving avocado smoothie, although they didn't have that item on their menu, they made one for us and it was great! If you're in town and looking to try Chicago style hotdogs, this is the place to go!", "pics": null}}, {"review": {"des": "The brothers that work here are the best. They are friendly and love to chat with you. the culture ofthe business if very family friendly, but for everyone. The food is amazing. I've been going here consistently for over a year, and im moving and am sad to depart from them.<br><br>The food is fire. They have a pulled pork dog, which is mouth watering. Every main item comes with fries or tots. Both are flavorful and crunchy and fresh. I love their tots. They have bomb chicken tenders, and their burgers arent for kids. They will not finish, hell I barely finish, so i stick to the dogs. I have yet to have anything bad here, and I don't expect to. Oh and their milkshakes are good too. If you want a cheap lil drink to quench your sweet tooth, you'll enjoy yourself here.", "pics": null}}, {"review": {"des": "Probably the best hot dog in Chicago. All the dogs and burgers come with a free side of tots or fries, and to be honest the tots are out of this world too, I love them.<br><br>Great quality for a good value. I would definitely recommend it.", "pics": null}}, {"review": {"des": "If i'm in the Lakeview area and have out of towners, Flub-A-Dub Chubs is the only hotdog shop that I take them to. There is a special feeling you get when you step down and into Flubs.  There's always drawings taped on the wall and a current game on the t.v.. You might find yourself surrounded by those with hangovers, but dubs maybe the perfect cure. I'm a simple Chicago style all the toppings kind of gal, but if you're vegan, like chili cheese, want a burger or whatever - you're set. Their hotdogs are a piece of art, and your choices are fries or tots!!", "pics": null}}, {"review": {"des": "Great local place, large menu, classic Chicago dogs, great chicken sandwich, on my favorite list.", "pics": null}}, {"review": {"des": "Just go, it's a great cheap place to eat and the food is always amazing. The workers are very nice and the place definitely has its own unique vibe. I recommend the pulled pork dog bc who doesn't love pulled pork!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nLr6yKRt3H5G-iYJ2_bjrA/348s.jpg", "caption": "Pulled Pork dog, this was great I will definitely go back and get this again instead of trying a new thing.  Bomb 10/10"}]}}, {"review": {"des": "Friendly staff and great food.  Had the burger.  It was really good.  Would go back if we lived in the area.", "pics": null}}, {"review": {"des": "I had a croissant at a near by place and wanted to wash it down with a quick dirty dog. It was quick but not dirty. The name Flub a dub comes from a kids show in the 50's, the Howdy Doodie Show. Mr. Flub A Dub was the puppet seal on the show. I am sure the dogs were not made pf puppet seals. It tasted like a good dog. I of course had a salad instead of tater tots. It is a cool place. It is down a narrow stairs  and looks like dog places looked in the early 70's. It has a TV and is just comfortable like a buddy's basement. They have burgers and make your own burgers but since I wanted a dirty dog, I cannot comment on them. A good place for half a dozen buds to watch sports and second guess the players.", "pics": null}}, {"review": {"des": "My girlfriend and I got vegan dogs with \"Da workz.\" It was both of our first times eating a Chicago style dog and it was great! Recommend this place. It's a hidden gem.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aofD-LiHe-of9EqApZQMaQ/348s.jpg", "caption": "Vegan dogs with \"Da workz\" and tots! This was a great meal!"}]}}, {"review": {"des": "I go for the great hot dogs and owners... and Greg. He's great to look at. <br><br>Food is phenomenal, great atmosphere, and never a long wait. <br><br>But also Greg. Not the burger. The man. But the burger is probably really good too.", "pics": null}}, {"review": {"des": "OK, I have had a horrible experience tonight with restaurants in my area and ordering delivery. Grubhub is AWFUL and I have to say... FLUB A DUB CHUB is ABSOLUTELY AMAZING! I spoke with Stefano who was incredibly patient, informative, personable, and just plain awesome. He made the process not only pain-less and easy, but also fun! He was sympathetic to my irritation with the Grubhub world and I could not be more grateful for the customer service I was shown tonight, and the way you have handled this. You really deserve an award and I want the world to know that you are AMAZING!", "pics": null}}, {"review": {"des": "The lady behind the counter was super friendly and the fries were incredibly crispy and fresh. Oh and vegan/vegetarian friendly!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bwL36Vzv8EE6viUp1Cmx_g/348s.jpg", "caption": "Vegan Chicago dog."}]}}, {"review": {"des": "Really disappointed in my experience with this place. I ordered delivery and none of the condiments I requested came with it. No napkins, ketchup, fork. I even made a special request with the hot dog I ordered to \"please add ketchup\". If your employees aren't going to read the orders thoroughly then you're going to lose a lot of business. Fries were also WAY too salty. I won't be ordering from here again.", "pics": null}}, {"review": {"des": "We order from here quite often for work and man it is delicious.  The people at this spot remember us when we call and are exactly what you expect when you think chicago dog house.  I get the Mr. Big sport peppers and all, sooooo good.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TMAZJ6xdUeWmnL2Z-NRfJg/348s.jpg", "caption": "Mr. big with tots"}]}}, {"review": {"des": "Killer Chicago Dog  n Fries !<br><br>1. Vienna Beef - Snap !<br>2. Steamed Bun - Poppy Seed ! <br>3. All very fresh veg <br>4. Proper lime colored relish<br>5. Bright yellow mustard - *NO KETCHUP<br>6. Kosher dill slice<br>7. Celery Seed ( a lot of Chicago dogs replicas miss this key ingredient... It adds an unmistakeable flavor n a little saltiness.<br>8. Sport Peppers ( 2 - perfect amount )<br><br>9. Fries - Hot n Crunchy ( like they were made just for me... cause they were.<br>10. Ketchup on Fries <br><br>These guys never disappoint.Spot On.<br>They are committed to Chicago's Great Food Scene. Fn kool. <br> Excellent Service-Location-Ambiance<br><br>It's in a basement under a tavern that used to be called The Fat Black PussyCat in the late 60's but that would be showing my age...say no more.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ypeHigJ-lLv5ND7hPTL6kQ/348s.jpg", "caption": "Every flavor comes thru... Even the celery seed"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7ujM1DRpCQVyCDIOllUalg/168s.jpg", "caption": "Very Good"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/exfVdHTOmJD56vwnNKHXeQ/168s.jpg", "caption": "Chicago Dog w Everything !"}]}}, {"review": {"des": "I simply love Flub's!  This is one of those classics - a hole in the wall dive that makes simply awesome food.  Flub's has about 5 tables inside, and maybe 4 more outside in the summer.  You might want to check before bringing a crowd.<br><br>But, the dogs are amazing.  They have a dozen and a half different varieties.  And not just hot dogs, but polish dogs as well.  With nearly every cool thing on them you can imagine.  And yes, they also have the classic Chicago dog.  And damn good ones.  Some of the best in the city, actually.<br><br>But they also have what look like amazing burgers and sandwiches.  I haven't gotten around to trying those, but you can bet I will.  Plus, you can get tatter tots!<br><br>I do wish they had a better drink selection.  And they don't serve alcohol.  But, they are located right next door to a sports bar, and you can get a beer there and have your hot dog delivered.  Gotta love some cooperation!<br><br>I'm all over Flub's and plan to try their entire menu.  I'll let you know how it goes...", "pics": null}}, {"review": {"des": "Yesterday I decided to check out one of the 18 burger places Yelp selected for burger week. (1 down 17 more to go). I decided to go to Flub A Dub Chubs.  This is located @ 3021 N Broadway for one of the $5.00 Featured Burgers.  The Roe Burger sounded good w/1/2 Black Angus Patty, cooked medium rare & served on a Toasted Pretzel Bun W/Mild Cheddar, Avocado, & Bacon.  It was cooked the way I ordered it, medium rare and lightly seasoned.  It was a pretty good burger, but wasn't anything that amazed me.  The burger also came with fries<br><br>Flub A Dub is a very small storefront with the actual restaurant down the stairs into a garden apt type setup.  Nice little Ma & Pa restaurant with friendly staff working there.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ibm9Xq8Emlc2aOrfAnMpoQ/348s.jpg", "caption": "Yummy burger w/fries for $5.00.  It's a great deal"}]}}, {"review": {"des": "The best hot dogs in town!  I frequent this place as much as I can. A great array of hot dog and burger options at ridiculously low prices.  The fries are the perfect mix of crispy and seasoned. Check out the vegan options too, they may be better than the regular options. No ketchup!", "pics": null}}, {"review": {"des": "My first Chicago-style hot dog experience! I got a Flubby Dog with da works topping (which will turn any order chicago style!) with tots. I wouldn't say it was phenomenal, but definitely really good! My bf and I were actually chilling at the bar above the hot dog place, so they gladly brought the food up, no extra delivery charge. We were quite happy with the service! Price is alright, average $6-8. We'll come back to try the burger as well.", "pics": null}}, {"review": {"des": "Moving away from East Lakeview was made harder because we had to leave Flub a Dub Chubs behind. They truly make you feel like family. I love their hot dogs, their Italian needs and their fries. <br>Every time I'm back in Lakeview I make sure to stop by for a dog.", "pics": null}}, {"review": {"des": "Yay! I finally got a chance to eat a real Chicago stye hot dog. I like that its a hole in the wall and with children art around the shop. My meal was good.", "pics": null}}, {"review": {"des": "I ordered the 8oz angus patty on a pretzel bun with pepper jack cheese, bacon, raw onion, extra pickles and mustard. Damn! That was 1 of THE BEST burgers I've had. Juicy, flavorful and DE-LISH!!!<br>I had fries with a side of jalepeño cheese sauce, which was sooooooooo good! And I'm pretty damn picky about cheese sauce when it comes to my fries!<br>I still think $15.29 for a cheeseburger, fries and a pop is quite expensive for a fast food joint, but if I am ever craving a burger again, I will definitely be going to back to Flub A Dub Chub's!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KLtzxXkve003hvha1tgB8g/168s.jpg", "caption": "$15.29 for cheeseburger, fries & a pop..."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/074IDAHLopeWdoHpkMXsUQ/168s.jpg", "caption": "Menu with actual prices!"}]}}, {"review": {"des": "Visited this establishment based on the Yelp reviews on a Sunday evening with my husband and a friend. My friend got the BLT dog and fries. My husband and I both got the pulled pork dog. <br><br>I really don't understand the hype about this place at all. I only gave it two stars because the food wasn't terrible, it was just average, and I wouldn't visit again. After tax and tip, it was $18 for my husband and I to each have a pulled pork hot dog with no side. This wouldn't be a terrible price if the food was good. However, while the hot dog was cooked well, and the bacon gave the exterior a nice flavor and crisp, the pulled pork it was topped with was most definitely not made in-house, and was really bland. It tasted like microwave pulled pork you can get at the grocery store, and had a near slimy consistency. We both ended up taking the pork off the top and eating the hot dog. <br><br>My friend got the BLT dog and french fries. The fries were extremely salty, and nothing spectacular, just your average frozen french fries. <br><br>My husband actually had leftovers, and wanted to wrap up his hot dog for later, however the cook and the person working behind the counter were nowhere to be found. Stood at the counter for five minutes waiting for a piece of foil or SOMETHING. The cook finally showed back up right as we were leaving the restaurant, however the person working the counter was still nowhere to be found. I understand that we went on a Sunday evening, however when you have several customers (there were other people eating, not just us), you probably shouldn't disappear for 20 minutes.<br><br>Expected so much more from the reviews. We will definitely not return. Overpriced food for what you get, and was nothing you can't get at any other hot dog place in the city, and done much better, in my opinion.", "pics": null}}, {"review": {"des": "I usually stop in this restaurant and then order then wait for my order. <br>During my last visit, I had noticed they offer on-line ordering so I made a note of that.<br><br>Tonight, I had registered and placed my first order.  The entire process was very painless.  By the time I had arrived (no more than 10 minutes) my order was ready.   Guess what... it was all correct.<br><br>This was the first time I had ordered \"Build-A-Sam\" with chicken.  As always, the chicken was very moist.    The system prompts you each step.  Very user friendly system.<br><br>Check out this neighborhood gem.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/a8xf5VCAbDu7QF_L26OWqA/348s.jpg", "caption": "Art work"}]}}, {"review": {"des": "Hot dogs were just okay but what I'm concerned about is the cleanliness not only did the cook handle the fries from using his hand directly from making the fries but also the cashier. Cleanliness 101 the cashier's handling the money and everything else and he handles the fries from the top into the bag not good", "pics": null}}, {"review": {"des": "Had the Roe and a side of French fries. The French fries are cooked perfectly, nice and crunchy but soft on the inside. That's goes a long way for a potato enthusiast such as me! The burger was standard but well cooked. Only negatives are the pretzel bun (not a fan) and it's not a cheap burger by any means. $14.50 for a burger and fries and 50 cents per topping. But since it's close to me, I will be frequenting more!<br><br>Full disclosure: I'm a generous rater, 3 1/2 stars would be more accurate.", "pics": null}}, {"review": {"des": "I love this place! I don't crave hot dogs often, but when I do, this is exactly where I want to go (and coming from Chicago, that's saying something!). The hot dog and burger menu is extensive, the prices are great, and the fries are super tasty! Enjoy the small patio out front in the summer and people watch on Broadway!", "pics": null}}, {"review": {"des": "Love this guys! All around the world, if you wonna great burger, grab a Hub! 10  from us!", "pics": null}}, {"review": {"des": "Lakeview's best kept secret. Walk down the stairs into a tight little space with just a handful of tables and you'll be wondering if you made the right decision. But the burgers are seriously good. Dogs too. And tater tots so crispy/fluffy.  Love love love this place.", "pics": null}}, {"review": {"des": "If you are looking for a greasy burger, hot dog, fries, mozz sticks, onion rings (you get the point), this is the spot for you!<br><br>Heaven on the plate and hell on your thighs.  <br><br>I had the Bryan Burger and it was delish.  Along with mozz sticks, onion rings and some fries.  Dont judge, I can EAT!  Oh and this was AFTER we went to Senza for the 5 course tasting and I ate it all...<br><br>Disgustingly delicious.  Orange, creamy, nacho cheese on everything I put in my mouth.  Lots of ranch and ketchup.  <br><br>Heartburn here I come...it was well worth it.  THANK YOU!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GcNW_MoNOH1mi_JcLJnLbg/348s.jpg", "caption": "Bryan Burger...amazing!"}]}}, {"review": {"des": "I just moved into the neighborhood and me my friend were craving hot dogs so we decided to check this place out and we were not disappointed! They have some fun stuff on the menu but they also have traditional hot dogs and burgers! Be sure to get their tater tots with a side of cheese! So yummy! Also, their burgers are so delicious and are very fresh with good quality tasting beeft! As I write this I am going to pick up a burger up right now. Be sure to check this place out if you are ever in the area!", "pics": null}}, {"review": {"des": "I enjoyed this place. Lovely staff and quality food. I only give it a 4 star simply because I don't like hotdogs in general. So my bias opinion took away that one star. With that being said, they do offer lots of other food. Writing this review makes me want their burger... I have not yet tried it but if it's good then I'll come back and add a star lol my friend is addicted to their hash browns lol which I also don't understand, like I mean it's tasty but potatoes just don't do much for me lolol", "pics": null}}, {"review": {"des": "Happened to stumble on this place driving down Broadway one day and so glad that we did. The burgers and fries are delicious! There is a good variety of food choices.I definitely recommend it.", "pics": null}}, {"review": {"des": "Omg their fried mushroom taste so gooooooo!!!! Yummmm xD<br><br>Love the staff here, always so nice xD food taste great! Real chicago treasure", "pics": null}}, {"review": {"des": "Had a great experience here, got a dog that had cheese sauce, and I subbed the chilli with there super tasty veggie chilli! Love love!", "pics": null}}, {"review": {"des": "My friends advised me to have a Chicago Dog while visiting there last week. My wife & I were going to a Chicago Cubs game and picked out a place near Wrigley Field with the best Yelp reviews & Flub A Dub Chub's it was. It was a tad difficult to locate given we didn't know the area & Google Maps was a little disoriented, but we found it off the street in the basement space. It's a tad small, so keep your eyes open.<br><br>We decided to order the Flubby & the Chubby. My wife wanted a beer, but they don't serve beer, but the guy taking the order suggested we go upstairs to the bar & he'd bring the dogs to us. How very accommodating.<br><br>We loved both selections. They were different than what we were used to with the tomato and the pickle, but they were excellent.<br><br>I recommend checking this place out.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Tb6SdkhtGM7gRjDk1Ul9IQ/348s.jpg", "caption": "It's a little below street level, but it's there."}]}}, {"review": {"des": "Plenty of people have raved about the hot dogs, so I am here to leave some love for their burgers. The burgers are amazing and I love the pretzel bun. The Bryan Burger is my personal favorite.", "pics": null}}, {"review": {"des": "I was a little skeptical about this whole \"Chicago Hot Dog'\" concept being that I am a ketchup lover and typically eat my hot dogs drenched in only ketchup. We got the Flubby with the works and it was amazing. From now on, I will only be eating my hot dogs Flub a Dub style with the following toppings:<br><br>-Thinly sliced cucumber<br>-Peperoccini peppers<br>-Fresh green relish<br>-Raw chopped onion<br>-Mustard<br>-Tomato slices<br>-Topped with a large pickle wedge<br>-Sprinkled with Celery Salt<br><br>My dog was amazing! Though next time I will just get the Chubby because it was hard to bite through the Flubby and the casing...it took me 3 bites to get all of the flavors in but again, this is a personal problem that nobody else in my group had an issue with.<br><br>The owner was super friendly and brought our food out to us on the patio. He gave great advice on other places that we needed to try before returning to DC.<br><br>This was the best $4 meal that my BF has ever spent on me :) My 'cousin' Becky who has lived there all her life, said this place was better than other hot dog establishments in the area too!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vOfacJ63pL9pmGcf83L3eA/348s.jpg", "caption": "Chubby with the works"}]}}, {"review": {"des": "BEST veggie dog in town. I go here at least 2x a month for my hot dog fix and it's spot on every single time. Friendly staff and all around great place. Check it out you will not be disappointed.", "pics": null}}, {"review": {"des": "Great hot dogs. Perfect snap which lets you know it's the real deal. Tots good, options for dog toppings are extensive and cheap! Great spot to get your your Chicago dog fix!", "pics": null}}, {"review": {"des": "Legit. We have Portillo's in California, so we wanted to try another spot.<br><br>Luckily we came on a Tuesday and got their special - 2 Chicago dogs with fries. We changed one of the sides to tater tots with cheese dip. (You know I love my nacho cheese!)<br><br>We did have to wait a bit, but only because they made sure the fries and tots were freshly fried and seasoned to perfection.<br><br>The hot dog was on point as well. Great quality ingredients and fresh tasting. Look no further, stop and eat here!", "pics": null}}, {"review": {"des": "My favorite Chicago hot dog! <br>I get the Chubby which has the skin on, which allows the juices to cook/marinate the meat and has the hot dog \"snap\" sound when you bit into it. My wife loves the vegetarian Chicago-style hot dog. The family that owns/runs the place is very nice and are always welcoming.<br>One of my favorite spots in Chicago.", "pics": null}}, {"review": {"des": "Great hot dogs.  Only issue with food was the bun was not the poppy seed bun but a regular roll.  Otherwise everything was great.  The floor was slippery and dirty and the tables hadn't been wiped down.  If the food hadn't been as good, this would have been marked down a lot for the gross dining room.  A lot of fun hot dog art around the walls to look at while waiting on food.  Parking is a nightmare but not restaurants fault.", "pics": null}}, {"review": {"des": "I am so glad we stopped in here for a couple of hot dogs while vacationing. They did not disappoint. Such good food with large portions for so little money. Also, they have sauerkraut for the New Yorkers. :)", "pics": null}}, {"review": {"des": "Favorite place in Lakeview East to grab an amazing burger or dog. The Roe is my recommendation! Fries are great. Music inside is upbeat yet relaxing and outdoor seating is clutch on those nice summer or fall days. The Flubtastic Tuesdays (chicago dog and fries for $4) or BYOB Wednesdays (build your own burger with sauces and premium toppings w/ fries for $10) are two days I usually will be there each week.", "pics": null}}, {"review": {"des": "Solid American bar food that I would have again. Guava BBQ sauce is great, as where the tots. Good fingers and corn dogs, average rings.", "pics": null}}, {"review": {"des": "Ive been to flub a dub chubs 3 times so far. I freaking love this place. I've ordered the Roe burger twice and two days ago I tried the Greg's Hangover burger.  Both are delicious! If you come here, you absolutley must order the seasoned fries. Definitley worth your money!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-wtmkJVwlV4VjvsBcgFkaQ/348s.jpg", "caption": "The \"Greg's Hangover Burger\", seasoned fries and beer battered mozzarella sticks. Certified dopeness!"}]}}, {"review": {"des": "Discovered this joint and have ordered it many times through Uber eats. The first two times it was outstanding. Unfortunately, it hasn't been made right the few times after. Recently, my husband ordered it at 515 pm and it didn't arrive until after 645pm or so! Uber eats made some sort of error and the restaurant cooked it at 515 so it sat there forever with no one picking it up until I made a call saying where is the order?! They fixed the delivery problem but the restaurant didn't remake the food! Omg they delivered my husband food that sat out for over an hour!! I can't believe it. How upsetting of the restaurant to serve food that could possibly make someone sick. <br><br>Fast forward to today. We tried it again. Why? Oh why are we so forgiving?! Well the fries were all messed up. They tasted like they sat out for a long time and had been way over seasoned. Not the perfect fries I had the first two times. And these $8 mozzarella sticks were served to me burnt and black! Omg. I don't understand how that is acceptable.  Upon calling, the man didn't seem very genuine after we've given his business maybe $150+ over the past few months. This place isn't very cheap. He tells me it'll be redelivered. Not true. Instead Uber eats is liable... And I have to wait 24 to 48 hours to know what the decision is on the order being inedible. So I lose money again and again from this business. RIP flub a dub chubs. Was fun while it lasted.", "pics": null}}, {"review": {"des": "DO NOT ASK FOR KETCHUP ON YOUR DOG YOU MANIAC!<br><br>Incredible hole in the wall for dogs.  Order anything and everything and you will be pleased.  Not much to say besides amazing food, fantastic prices, and great vibe.<br><br>Always a go-to for locals.", "pics": null}}, {"review": {"des": "It was alright. Nothing special. I've had way better burgers for less in the neighborhood. I was surprised to see 4.5 stars on Yelp. If prices were a bit more reasonable for the quality, I would've given it 4 stars at-best. Also, unfortunately, the place didn't feel clean.", "pics": null}}, {"review": {"des": "Perfect burger!!!! The staff is also so nice! I will definitely come back! It's a pretty simple place but is delicious!", "pics": null}}, {"review": {"des": "Haven't had a single bad thing ordered from here. I especially love their fried chicken - it's always crispy on the outside and perfectly moist on the inside. The spices used in the breading are really tasty. I usually order delivery and the delivery is pretty quick. They use bike messengers and once they came on the coldest night of the year and the food was still hot when it got to us - cheers to that. I love the make your own burger/sandwich option! <br><br>My only gripe is they always ignore what is written in the specifications section when ordering online. Ask for no tomatoes? There will be tomatoes. Ask for no toppings whatsoever on your sandwich? All the toppings. Not a huge issue for me personally but it could be a massive issue for someone who has food allergies. If someone were to be allergic to something on a burger (let's go with tomatoes), request it come without it but the burger arrives with tomatoes? Depending on the severity of their allergy simply picking off the tomatoes wouldn't be enough. At this point you have to call and reorder and blah blah blah. Please start reading the comments on online ordering!!", "pics": null}}, {"review": {"des": "What's not to love?! Great food, great owners, reasonable prices. Don't go anywhere else in the neighborhood for burgers or hot dogs.", "pics": null}}, {"review": {"des": "Wow.  Flub A Dub Chub's deserves six stars.<br><br>First, it smells so good in here.  It smells like good old fashioned, greasy, American food.<br><br>We had dinner here on New Years Eve before heading to a house party nearby.  Our original plan was to head elsewhere, but they were closed.  Flub's is not only open on NYE, but they keep their regular hours.<br><br>Flub's \"Grandma K\" burger is quite possibly the best burger I have ever had.  The Grandma K is a burger patty, cooked medium-well at my request, topped with goat cheese, bacon, and a sweet red onion relish, served on a soft pretzel bun.  It was smeared with tons of goat cheese, and the sweet red onion relish surprised me.  It wasn't onion-y at all, which I loved since I usually request anything without onions.<br><br>Burgers and hot dogs come with fries, but I subbed the mozzarella sticks.  You can taste the beer in their beer battered mozz sticks, which are surprisingly not super greasy.  The onion rings are also amazing.<br><br>My husband was very happy with his BLT hot dog and Polish sausage; he was sure to point out how well charred the sausage was.<br><br>The service is fantastic.  The guy who took our order chatted with us a little bit, offered to refill our drinks and package our leftovers.  There are several tables, and a bar with stools, or you can order to go.  You can also place orders online for pick-up!<br><br>Flub's is awesome.  I can only imagine how packed this place gets on New Years' Day - this is serious hangover food.", "pics": null}}, {"review": {"des": "This place is seriously a neighborhood gem. I moved down the block two months ago and have already made two stops into Flub's. Both times I went with a hot dog topped with mustard, onion, and celery salt with a side of fries dipped in their delicious spicy garlic mayo and both times I loved loved loved it.<br><br>While I haven't tried many of the specialty items that make this spot so popular there are a few things that really set it apart for me with the first being the service. Both times I have been in there the staff has been beyond friendly and welcoming. On my most recent trip I met the owner, Rosemary, a very cool lady who made me happy I chose to support a local, family owned business. <br><br>In addition to the great service I also think Flub's has a higher standard of quality and better prices than other hot dog stands. The fries were exceptional and the hot dogs a 1/4 pound of plump, juicy, Vienna Beef. <br><br>I'd highly recommend stopping in Flub A Dub Chub's or ordering on line from their web site. You really cannot go wrong with this spot.", "pics": null}}, {"review": {"des": "I was in Chicago...I needed a hot dog.<br><br>My bf found this place on Yelp and off we went. It's located in a downstairs area so be sure to look at eye level or you'll walk right by. <br><br>Small place but pretty decent hot dogs and inexpensive. There's a deal for 2 dogs with fries for $8.95.", "pics": null}}, {"review": {"des": "The owner's son was taking orders and he was very nice. My 11 and 9 year old were very happy with their Italian beef sandwich and cheeseburger. My husband left with a happy belly full of the combo. We'd recommend it to anyone.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Or5g0isJleOf7b3zc9hxdw/348s.jpg", "caption": "The Woody"}]}}]}