{"name": "fogo-de-ch%C3%A3o-brazilian-steakhouse-chicago-4", "reviews": [{"review": {"des": "Best place for meat lovers. I love that it is grilled on charcoals and not in gas. The meat is brought fast and the bring all the cuts. There are one that you need to ask for and that is a beef ribs. The mohitos are very good and the salad bar has many choices and all is fresh.<br>For desert lava cake with extra scoop of ice cream was just as good.<br>Love this place", "pics": null}}, {"review": {"des": "Do I judge people when they visit Chicago and choose Fogo de Chão as their steakhouse? Absolutely. Do I think less of people who live in Chicago and include Fogo in their list of top steakhouses? You bet.<br><br>This isn't necessarily a tourist trap. Chain restaurants serve a purpose, and when I ate here I wasn't dissatisfied. What most people will highlight is that the Churrasco experience, in which waiters with skewers of succulent meat walk around and slice an unlimited amount of it for you tableside, is a great bang for your buck. What might not be clear to the uninitiated is that this costs $56 and isn't anything special.<br><br>This environment (with the perceived \"deal\") attracts a random mix of people. Expect to see a lot of men with untucked shirts that flow like dresses. Weird family members that emerge from basements to celebrate high school milestones, etc. Kind of like how I would picture a Vegas buffet (e.g. people had to make *some* effort to get there but not a whole lot). The menu is extremely limited, with no appetizers really aside from an extensive salad bar called the market table (note: there appears to be a lobster & shrimp appetizer now, I don't remember this).<br><br>You have the big salad bar and, as you'd imagine, nobody uses it. Everyone wants to maximize their intake of red meat and lamb. So why does every other skewer contain chicken? Because, you fool, businesses need to make money.<br><br>You get some red meat and, by god, is it delicious. More skewers. More steak. The big knives. Slice by slice you're taking it down and you love life. You even eat a little chicken and that's good too. You're a king. A big Brazillian king.<br><br>Forty-five minutes in you realize that the average human stomach can only handle so much dense protein. It doesn't matter how big you are or how manly you think you are. The amount of training (and genetic fortune) that it would take to actually make a dent in Fogo de Chão's bottom line--to objectively get a \"deal\"--is out of reach for most people. Plus, along the way, you'll have to decline the chicken (and pork?) more than a dozen times, which starts to make things awkward.<br><br>This place is good, but, in Chicago, I find that their value proposition is quite mediocre and attracts a lot of people who don't know any better.", "pics": null}}, {"review": {"des": "This place has gone downhill in a spectacular fashion. The quality of the meat is absolutely terrible now.  If you enjoy a plate full of gristle and sinew, then this is the place for you.  There were times when I waited with a green card and an empty plate for 20 minutes for someone to come by, only to receive an inedible ball of beef fat.  <br><br>It seems like they don't bring you filet unless you specifically ask for it now.  The guy with the chicken must've come by 20 times before I asked if filet was still something they served. 10 minutes after that, someone finally showed up and begrudgingly dropped 2 slivers of filet on my table before running off to the kitchen again without visiting any other tables.<br><br>Save your $60 and go elsewhere. Chama Gaucha is a bit of a drive from the city, but it's currently several steps above this place and well worth the trip if you're craving the same experience.", "pics": null}}, {"review": {"des": "Seating was prompt (had a reservation), and the servers were always nearby and attentive.<br><br>Atmosphere was decent, felt a little crowded with tables all near to each other but not a show stopper.<br><br>I ordered a Brazilian Gentleman, which was a top notch cocktail (ordered 2, in fact), just be aware they are $12.<br><br>The salad bar was pretty good, not fantastic, but no real complaints. Wasn't much impressed with the sides either.<br><br>Now for the meats.  They were fantastic, with the exception of the dry chicken and the even drier ribs.  Just avoid those two and you'll be fine.  The meat selection was great, and there was frequent service (never had to wait).<br><br>The biggest negative is price, really.  I would come back more often if the price was a little more affordable.  I'll be back again in a few years given the current pricing.  4 stars..", "pics": null}}, {"review": {"des": "I was so disappointed in this place! I've been to three other Brazilian steakhouses and this one is definitely at the bottom. <br><br>Pros:<br>-beautiful inside decor<br>-tasty pao de queijo<br>-not too loud<br>-meat is tasty<br><br>Cons:<br>-too expensive (compared to other places I have been)<br>-salad bar isn't that great <br>-the rice and beans weren't all that great - the rice was very undercooked<br>-the plantains they served were mushy and sickly sweet (and I am a sweet tooth!)<br>-they try to trick you into buying a shrimp cocktail by having a waiter come around asking if you would like one. Fine and dandy except other waiters are coming around asking if you would like the meat included in the price<br>-meat options were limited (at least when we came) and it seemed like the likelihood of getting meat was highly dependent on where you sat (so often my husband would see something he wanted, but by the time it got near our table, there was no more of that specific meat. And then the waiter wouldn't come back with more)<br>-charge $3.50 for a mini glass bottle of soda<br><br>Overall: disappointed and wasn't worth the price. Brazilian steakhouses usually have lavish salad bars, variety of meat selections making their way to you, and authentic. I was turned off by the waiter trying to trick you into purchasing an expensive shrimp cocktail, charging $3.50 for not even a reasonable quantity of soda (with no refills), and the inconsistent availability of the meats.", "pics": null}}, {"review": {"des": "Came here for lunch today. Excellent service. They are making sure that my steaks is done perfectly to my liking. Very Attentive staff.", "pics": null}}, {"review": {"des": "My experience at this Fogo location was alright...I wasn't very impressed. I've been to 2 of the California locations and thoroughly enjoyed my experiences there. I thought that the Fogo in Chicago would be equally as impressive in food and service. Unfortunately, this location doesn't quite hit the mark for me.<br><br>A group of 4 of us came here for dinner after having made a reservation a few days prior. We all went for the full Churrasco experience. The quality of the salad bar was subpar - I saw flies landing on the pineapple and papaya sections. The mozzarella slices weren't fresh, though the proscuitto and smoked salmon were delicious!<br><br>My fave cut of meat is the House Special Picanha, which was seasoned well and cooked through. Our main gripe with the service is that some of the meats never made it to our table, such as the Top and Bottom Sirloin. I did enjoy the cuts we got, but I would have liked to see more meat options going around. Our table was a little isolated by the wall, so that might have been the reason why? We kept on asking for the other meats, but they sadly never came to our table.<br><br>My fave part of the meal was the cheese balls so addicting! I also loved the fried polenta and garlic mashed potatoes on our table.<br><br>After tax and tip, our meal was about $70. For that high price, I don't think my experience at this Fogo was worth it. I would rather go to a location in LA where I could get better options and service for around the same price.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LQk8SjKRv5bGMg-FP7xQmA/348s.jpg", "caption": "Salad Bar"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VlEnvjOXRyk0PXFyuMb4NQ/168s.jpg", "caption": "Nice Interior"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Qrv8pLEUogtGpMVjDXa4pA/168s.jpg", "caption": "Soup and Rice/Beans"}]}}, {"review": {"des": "I love the Brazilian steakhouse AYCE concept. Who does not like all you can eat? <br><br>What I did not like was I felt like it was a very limited variety being served. The same 5 cuts of meat were continually brought out to us which got boring after a while. We were there for an hour and a half and both the filet and ribeye only came by once. <br><br>I would come back more often if I didn't only get served parmesan chicken and flank steak continuously. Bring out the good stuff please!", "pics": null}}, {"review": {"des": "Fogo has always and continues to be one of my favorite steakhouses in the world. With locations all over the US, this makes for a nice introduction to the idea of AYCE Brazilian meats.<br><br>During lunch, they offer their buffet for $44 which is a great deal if you want to avoid paying more for dinner. Although it's a \"buffet,\" the atmosphere inside comes off quite upscale so this would make a great date spot. The restaurant functions with a salad/fruit/appetizers bar where you grab your first plate of sides to enjoy with your meat. You start here before indulging in any of the meats.<br><br>Once you've settled in and enjoyed some of the appetizers, flip over the small coaster-size button on your table. Once you give the green \"Go Ahead!\" men with meat will begin stopping by and offering different cuts of beef, pork, chicken, and lamb. Literally slabs of delicious meats hanging from skewers are sliced in front of you, and you can choose how red you like yours. For me, rare = heaven.<br><br>Warning- while extremely delicious, this could be very overwhelming! You'll likely end up biting off a bit more than you can chew but that's okay. Make sure you at least try their Filet Mignon and House Sirloin. Both were my absolute favorites and the two that I dream about the most.<br><br>While you are enjoying all the beautiful cuts of meat, don't forget to try the warm sides placed on your table. They offer plenty of grilled bananas (which were FIRE!), fried yucca, and the cheese bread. Each bite-sized dish helps to compliment the meat very well.<br><br>It's an experience that any meat lover should try at least once in their lifetime. This was my first time back in over five years and I plan to keep it that way for the next time.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/X7sQwStbBP0DBnMnQr_7IA/168s.jpg", "caption": "AMAZING Meats"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kBkfruMeBnlpq1va1Y8iSg/168s.jpg", "caption": "Salad Bar"}]}}, {"review": {"des": "Im not in love with this ...I've came here with my high end clientele had good times  but on this 11 time the ambience was different service was bad the meat selections tasty but they didn't come around as much. It was sunday after church around 330pm. It felt like a huge mangement change has taken place. I wish them well j alexader,gibsons in oakbrook were awesome both chessecake factory were awesome experiences.I wish fogo well i hope its me having a bad day.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cMsHRvgz7fgXdQwmz144GQ/168s.jpg", "caption": "My fogo de chao bill i was trying to impress but got embarrased with bad experience."}]}}, {"review": {"des": "I was so happy my company went here for dinner the other night. The meats they brought out were outstanding. My favorite was the garlic steak. The sirloin was outstanding, the bacon wrapped chicken was very very good, and the filet mignon melted in your mouth. The wine that we had paired with our meal was perfect! If you're in the area, and like Brazilian style steak houses,I highly recommend stopping in here for a visit. Oh! The mojitos are really good too!", "pics": null}}, {"review": {"des": "Everyone waxes poetic about this place but I honestly don't understand why. Yeah, it's a solid meal. But it's a fancy buffet, it's super expensive, and the cocktails are so not worth your money. <br><br>I came here for a friend's birthday because he loves meat. It seemed like a perfect fit. So we made a reservation for 8 at 7:15 on a Saturday without difficulties. <br><br>Once you're seated they explain the process. You get to go to the buffet as many times as you want. And the meat comes to you. Everyone who participates gets a card to flip over to the green side when they want more food. And when you don't want more food, you flip it to the red side.<br><br>One thing that should be obvious is that this place is not easy for vegetarians or pescatarians. You can opt out of the meat and just get the buffet. It's slightly cheaper. They do have a fish entree you can order - that's what my friend did who doesn't eat meat.<br><br>The reason I rate this low is that it just didn't feel like anything special. It was a fancy overpriced buffet. Servers rarely came around to refill water once we got started. And the cocktail I ordered was mostly fruit, like almost no liquid. Super disappointing. And because the meal is so expensive, I felt I had to keep eating. I was so stuffed when I was finished. Uncomfortably stuffed. But I felt like I had to get my moneys worth because with tax and tip this was a $90+ meal.<br><br>Will I come back? Probably not. Only reason I'd come back would be if a friend chose this place to celebrate something. There are better restaurants out there.", "pics": null}}, {"review": {"des": "Fogo is my go-to Brazilian steakhouse. Even my friends from Brazil love the place, that's when you know it's authentic. They boast a huge variety of meats and have a great far bar section as well. But don't come here if you're looking to eat salad, make sure you get your fill of meats.<br><br>They start you off with mashed potatoes, polenta, caramelized bananas and pao de queijo. I'd say pass on these. They're FILLING, but the pao de queijo is puffy cheesy bread. If you can control yourself, try one.<br><br>While you wait for the meats to come to your table, the food bar has a great assortment of veggies and cured meats. I really like their salami and pastrami. They also have a warm food section with pastas and rice. Save room for the meats though!<br><br>If you can, try at least one piece of everything (except maybe the lamb and beef ribs they were mediocre at best). Top steak cuts were picanha, fraldinha, filet mignon and beef ancho. The bacon wrapped chicken was amazing (I don't even like bacon) and they also have a great selection of sausages. Also try the chicken hearts and other meats that is uncommon elsewhere.<br><br>Come with a friend that loves meat as well. Don't let anyone hold you back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/g8k5yNMcnube0-NI2XowuQ/348s.jpg", "caption": "cuts of meat"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bRSma-HevnxsfHW_DWgYYA/168s.jpg", "caption": "garlic mash, caramelized bananas, polenta"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Rzu7nxNCBkcX2bYGFYjFyA/168s.jpg", "caption": "pao de queijo"}]}}, {"review": {"des": "This steakhouse does Brazil right. My thoughts about the bottom Sirloin cuts were tasty and tender as well. The first or outside cuts were tastier because of the searing and extra salt. <br><br>The lamb and filet mignon usually arrived over cooked but you can ask for some medium rare or rare. <br><br>The spears of beef roam around the restaurant feeding everyone that has their disk flipped to the green side.  When we arrived earlier in the evening around 7:00pm we had a brief wait at the bar for about 15-20 minutes. Then after being seated the place filled up like crazy. We had to carve through a crowd of more than 50 to leave around 9pm. The place is very popular. <br><br>The salad bar is also fantastic. Some of the items were seasoned heavier than you would usually expect. Everything was delicious and fresh. I'll return one day and see if they can push five stars. The only reason I didn't put this at five is just that... I have only tasted one night in Brazil.", "pics": null}}, {"review": {"des": "My family of four ended up at this famous steakhouse all due to my son's birthday request. <br><br>Atmosphere: A beautiful well-lit dining area with soft music and clean floors despite the amount of groups dining in.<br><br>Music: The volume was perfect for the room. Not too quiet or too loud, perfect for close and personal conversations.<br><br>Service: Friendly and fast staff. My family and I were impressed by how the waiter took every dish away with a quick swoop. Typical wait time length at restaurants like these. We would have appreciated more beverage refresher check ins.<br><br>Food: Huge steaks but small sides. The endless bread kept us full, though. <br><br>The only reason I'm not giving this place 5 stars is because I felt as though my family overdressed for the restaurant and occasion and nothing left a special impression on us for us to come back.", "pics": null}}, {"review": {"des": "Came here for thanksgiving and to celebrate my birthday - and must say was my best experience yet.  We had a reservation  for 530 and were seated only mins past our reservation time.  Food was great considering how busy they were and meat was consistently brought out cooked for our tastes. Ill give it a superb  5 stars but 1 issue -  1) our initial drink order (pineapple old fashions) were not brought out for 20 mins into our meal.  We actually had to request them again as they hadnt shown up.  Otherwise an amazing experience and an amazing holiday.  Would recommend it and spend holidays here again in the future .  Kudos for management running a well oiled machine", "pics": null}}, {"review": {"des": "The meat sweats are a horrible and amazing thing all at once. And my god does Fogo deliver on the meat sweats. <br><br>They have a salad bar that is great, there is a lot of options and the food is always fresh and tasty. I personally appreciate the large cheese selection. <br><br>The meat selection is just as good. Their filet mignon is my favorite. But the house special is worth a try as well.<br><br>Now that I raved about the food I have to say what makes this place stand out from others is the service. Every single time I've been here the service was above amazing across the board. They've mastered the perfect dose of nice and personable while still being professional. I definitely recommend them for your next special occasion dining experience.", "pics": null}}, {"review": {"des": "Overall, it was pretty good, but personally I wouldn't go back because I ate way too much but also still not enough to make it worth the money haha <br><br>The system with the cards faced up or faced down for whether or not you want meat is really useful for when you need a break. Some of the cheeses/dishes at the tables in the middle seemed like they were out for a while, but I understand why since you just grab it yourself and it would be a waste to constantly change stuff.<br><br>The meat was pretty good overall, but it's hard to get what you want depending where you sit. Thankfully, some of the staff were attentive and noticed we kept on passing on the meat even though our cars were up and asked us if we were specifically looking for any type of meat. A few waiters asked us before we actually got the meat we were asking for, so some of the earlier ones might've forgotten or something. We also had to wait a while to get our check when we asked for it and for our card after we had paid, but overall the service was pretty good.<br><br>We still had to wait even though we made a reservation, but it wasn't too bad (maybe 20ish minutes).", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/X45_vDA9vP4cNfYRaOZ5BQ/168s.jpg", "caption": "Fried polenta and fried Caramelized Bananas"}]}}, {"review": {"des": "I can say nothing about the meat at this place because I do not eat meat, but I have had their market table lunch several times, and for the amount of options you have, it's a great deal for anyone into veggies/salads. <br><br>For $15, you can get unlimited access to their market table (the salad bar and the space where they have the rice and beans). Considering some salad places in Chicago charge upwards of $10 for a single salad, this is a great option for anyone that wants variety. You can even get pieces of smoked salmon or chicken salad, too. <br><br>The only downside is that the quality of the veggies and salads can be a hit or miss sometimes, and the same applies for the pão de queijo and other sides they serve at every table. I also wish they offered more hot veggie options. I don't mind a cold lunch, but more hot options would make me visit this place more often.", "pics": null}}, {"review": {"des": "Made reservations for Sunday at 7 p.m. but arrived a few minutes later and it wasn't an issue at all.. we still got seated within about 3 minutes. When I initially called to make the reservation, I mentioned we'd be celebrating our 8 year anniversary and upon being taken to our seats, everyone from the hostess to the waiters wished us a happy anniversary which was an awesome detail for us! We started off by ordering a pitcher of red sangria and let me tell you, they kept our glasses full! The food was good as usual and we both agreed we definitely liked this location over the Rosemont one- much better service overall. They kept the meat coming for the few hours we were there. We had one waiter in particular- Alfredo. He was truly amazing the entire night! He even made a suggestion for the beef ribs which came out on a wooden board and it was a great recommendation, so juicy and tender! He took photos and videos of us and truly made us feel very comfortable and made our anniversary a wonderful experience!! Will now continue to come to this location for sure!", "pics": null}}, {"review": {"des": "This place was such a disappointment!!! Our reservation was at 7pm...when we arrived we were seated which was good BUT the meat was HORRIBLY DRY..mash potatoes were instant and too watery..black beans had no taste. I also put on my online reservation it was my birthday and there was no recognition. The service was super slow. We truly feel we were served the leftover meat from the night before cause after being there for awhile we started to notice the meat coming out looked alot juicier but we didnt try it we just paid our bill and left...BUT NEVER AGAIN", "pics": null}}, {"review": {"des": "Fogo de Chão has good steak , ambiance, waiters but some rude meat  servers.....<br><br>I was there for dinner. I called in for reservation at 7:30 pm, it was not hard to get reservation for two. Sharp 7:30 pm we went in and right away we got seated with no waiting which was good. In New York some times we had to wait for dinner reservation..<br><br>Right away the waiters came to the table and talk to us if we want any drinks and explain the salad bar.we started from the salad bar and keep going on from the market table meat service. We told the waiters that we don't want pork serve to the table, she told us ;she will talk to the chef and we will be fine....  <br><br>We start getting the delicious stake with rude servers. The place is noise level is high and the servers speaks low, it's almost impossible to hear them saying what kind of meat is that. We asked them to repeat and 3 of the servers goes like\"laaaaaaaaaammmbbb\" that was rude. I was so embarrassed in front of my guests. But we were in rush I did not even try to speak with the manager..  <br><br>After we leave the restaurant, I emailed them this is what happened. They did email back and tried to understand the satiation. They did very professional job to convince me that will not happen again. After one day the manager of the Chicago Fogo de Chão called me and apologize about what happened. Good customer service handled..", "pics": null}}, {"review": {"des": "This is definitely the place you want to go if you want to stuff yourself stupid on a smorgasbord of delicious grilled meats. Try everything at least once, they usually give you small enough slices when a meat server comes by, but sometimes you get quite a large hunk! The filet is definitely the best, it's seasoned so well and cooked to perfection. The buffet is a nice addition and it's tempting to fill up on the veggies and sides, but clearly if you're here, you're here for the meat. The only disappointing thing was trying to get a slice of the filet a second time, it never came back around and I asked 3 different servers for it but none of them delivered. That's the only reason I'm docking 1 star off the review.", "pics": null}}, {"review": {"des": "They are on the high end level of Brazilian barbecue that we've ever been to. This includes the price per person, but we were lucky enough to have Birthday Coupon! <br><br>Overall, the experience was great! The meat that were served are really high quality. I particularly love their lamb chops and sirloin cooked medium well.", "pics": null}}, {"review": {"des": "So the only reason I tried this place is because I got a gift card from my cousin for Mother's Day.  Took me a while but I finally went today.<br><br>I would not tell people not to come here but I won't be back. Here's why.<br><br>Atmosphere- so stuffy and boring and bland. I thought I was at a funeral. Play some music or something. It just wasn't somewhere I'd want to sit and relax and have a good meal and conversation.<br><br>Service- so the guys that bring the meat and sides around were great. Management also a plus. But our waitress was stupid. She brought coffee and pop once and we never saw her again. After about 15 minutes after being done eating I had to flag down management to get our bill. So again not warm and inviting.<br><br>Food- the saving grace. Lamb pork ribeye all great and flavorful....chicken was dry and ribs tasted like baked chicken. The cheeses and meats and salads were great and so was the bacon. I didn't care for the rice and beans, no flavor. And what really made me mad was there was no fruit and I was looking forward to it. There was some hard pineapple and some weird melon and that's it. The side were great, the mashed potatoes, fried polenta and caramelized banana. So food gets a 70/30 mostly good.<br><br>I won't be back here though. If you're really into a great deal for a lot of meat and don't care about the atmosphere or service then yeah.", "pics": null}}, {"review": {"des": "TERRIBLE, AWFUL service. Chaotic. Nobody knew who was doing what which meant we had to ask several times to get ordered items. Ugh, so frustrating considering how expensive it is. With al of the other fantastic local options, I would likely never return. Gross.", "pics": null}}, {"review": {"des": "Had Fogo for dinner with a friend tonight. Was excellent as always. The salad bar was particularly good tonight. Fresh mozzarella, olives, roasted red peppers, crispy fresh salad with tomatoes and dressing, yum! We split a delicious bottle of Moscato white wine, and I had my usual assortment of meats but also saved some room for dessert this time. I had the Strawberry Creme, which was delicious. Finished dinner with a cup of coffee and it was another lovely evening at Fogo. <br><br>If you haven't been, you need to check this place out! Lunch is the same menu but cheaper at $35 instead of the dinner time price of $50. Worth every penny in my<br>opinion!", "pics": null}}, {"review": {"des": "Service is quick and friendly with a tremendous selection of carved meats and salad selections. Dinner is worth the cost, however since there is very little difference in selection at lunch a consider it a very good value in lieu of the much lower price.", "pics": null}}, {"review": {"des": "Very disappointed with out last visit to Fogo de Chão. My family and I are visiting Chicago, taking in the sites downtown. After a fun day at the MSI, we headed in for our 6:00 reservation. We had a reservation for 8, arrived a few minutes early, and it still took them forever to seat us. While there were other parties waiting, the restaurant itself wasn't too busy. When I asked the hostess about the delay, she stated they were seating smaller parties first... We were shown to our table about 15 to 20 minutes late. <br><br>Now for the grisly disappointing part of the evening, I could forgive the wait. My mom has never been to a Brazilian steak house, so I really wanted this to be an awesome experience. The food that was served was absolute garbage. Everything was burnt, over cooked,  tough, or all of the above. I mean, it was just disappointing. The servers were also off their game. They'd stop at our table, offer up something, and leave before serving the whole party. Some people at the table were sitting with nothing on their plate. We made multiple request for lamb, my mom loves lamb, and we never received our lamb. Oh, we saw them walking around with it, but they never stopped at our table with it. Our wait staff did the best they could to make our meal enjoyable. They offered to send over whatever we wanted, but results varied. <br><br>Fogo de Chão has officially lost a customer. This isn't the first negative experience, but it will be the last. There are other Brazilian steak houses, we will spend our dollars at them from now on.", "pics": null}}, {"review": {"des": "Loved this place. I think you have to have the discipline to NOT try things you don't absolutely love,and to not finish things that great but aren't your faves. Everything is amazing so this is harder than it sounds. Overall I'd definitely return and so glad I tried it finally. I love lamp and I've never had lamp chops as tender and tasty as this place. Even the chicken was good. It's a steakhouse primarily so focus on that, but it's impossible to try a of them (I think). Also the salad bar and the sides (polenta Parmesan sticks and mashed potatoes) also scrumptious", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iQd99zpI_abEAK7nBnHVRQ/168s.jpg", "caption": "Menu selection"}]}}, {"review": {"des": "Kids under 6 years old eat FREE... what?!? We were exceptionally happy to find this out. Our daughter loves meat and had a great time eating here. Waitress was great explaining the system to her and even asked if there was a specific meat she would like to have brought over. Oh and the meat is just phenomenal. We will be back!", "pics": null}}, {"review": {"des": "#meat<br>#moremeat<br>#mostmeat<br><br>garbanzo beans goods...beets very good...lamb was even not bad...big Tony even bought my date a drink cuz my suit looked \"2 good\"<br><br>#sharpdressedman", "pics": null}}, {"review": {"des": "Favorite all you can eat place, and favorite Fogo establishment!<br><br>I visit Fogo monthly and visit different locations throughout the country when I am traveling. Chicago has the best location hands down. The meat has always tasted better and the waiters are definitely on top of their game. For example, we never have to ask for refills of anything we have finished on our tables when eating in Chicago. They are on it. In both Vegas and Los Angeles we have had to ask for these refills, which is fine, but it shows that the Chicago location stands out. <br><br>What I also enjoy about the Chicago location is that they offer two sauces which are personal to its establishment. I enjoy them both. The location is also biggest one that I have visited. <br><br>All in all, I have no complaints. Excited to go back!", "pics": null}}, {"review": {"des": "I came here with nearly 30 other coworkers for a group lunch/celebration.<br><br>The staff was very inviting and informational regarding the types of meats coming out and how to use the meat marker.  They were also very attentive to making sure our drinks were taken care of, our plates were replaced, table sides were replenished, and that certain meats that we liked were brought back more often.<br><br>The interior was very clean and well kept.  The meat was very good.  <br><br>You are able to ask for the doneness for certain meats and they always managed to find the exact doneness you wanted.  They were also very polite when I asked for a much larger cut of meat.  I really appreciated the servers taking time to pause so that I could take photos of the various meats coming by.<br><br>What made this experience even better was the fact that we happened to have 3 birthdays that we celebrated and we hadn't told the staff about this.  They went above and beyond and came out with HUGE slices of cheesecake for the birthday people.  This was absolutely unexpected and awesome.<br><br>Cheers to great service, great food, and a very nice atmosphere.<br><br>If you want to maximize your value here, just focus on the meat and skip the enticing food bar.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RxrgXoDimqfBcoPW28ajdg/348s.jpg", "caption": "Wine selection"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tu1MXd_Ny6coltisqkfgjw/168s.jpg", "caption": "They brought out cheese cake for people who had recent birthdays!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PNuDpHE0J0v-cnun-zBEOw/168s.jpg", "caption": "Dessert"}]}}, {"review": {"des": "Very disappointing. Took my daughters there for lunch and they offer Freijoada for lunch. $15 with salad. Well , what they had was black beans with rice. Real Brazilian Freijoada is full if various types of meat. It is a black bean STEW.  This was not. Also, should come with collards greens. They didn't have any and suggested we get Kale !?!?  From the salad bar. Nada ver.<br>Now I know why there were no Brazilians eating there. It is not real Brazilian food. Only what they can sell to people who don't know the difference.", "pics": null}}, {"review": {"des": "I'm so so disappointed in this location. Fogo de Chão is my absolute FAVORITE restaurant, but this location is a shame. Please make sure to try them at another location though because the food is amazing and the concept is great too! <br><br>We came to celebrate and were disappointed from the beginning. My husband ordered beer which never came and we had to tell Multiple servers until finally One of the waiters brought it after his 4th plate....... <br><br>I unfortunately only like my steak Well done, I was not able to eat steak because NO ONE had well done steak. I asked Numerous times and they continued to say \"we will bring you some\"...<br><br>Then finally the manager I'm assuming came to the table after seeing our sad faces. I told him twice on separate occasions I was still waiting for my steak to be well done because it is unfair to pay the big bill if I didn't even get what I came for. He agreed but never brought my steak.<br><br>I told the server 3 additional other times I was still waiting (and here we are 40 minutes later) S T I L L waiting for the well done piece. <br><br>The same gentleman came over to ask how every thing was and I told him directly l was disappointed because I personally asked him twice and the server 3 times for the well done piece and nothing was delivered. <br><br>It's a shame we will still pay the same amount knowing they never brought out the steak for me ‍<br><br>THIS IS NOT THE SERVICE they normally give at the other locations. PLEASE try a different one, you'll actually feel the difference! Chicago's Fogo de Chão was terrible service. Terrible.<br><br>Update: when we went to pay the manager was very nice and realized our service was not exceptional. Thus, he honored a discount for our dinner considering I did not eat the steak I wanted due to the poor service. Thank you Sergio.", "pics": null}}, {"review": {"des": "It wasn't until later that I realized just how perverted I sounded when saying, \"I need more sausages, please\" in the midst of all the meats being circled around the tables.  Hey - you couldn't blame me, though!  Some good red meat can be a little orgasmic, and the pork sausages are really something to seek out...but then again so is all the meat here at Fogo De Chao.<br><br>My fiance has been urging me to come here for a couple years now, but I finally made it as a part of an event that the restaurant was closed off for.  Because of this special treatment, I can't really assess the staff and service without being biased towards a favorable review.  The waiters did appear to take their jobs seriously which is a good thing...the waiters here appear much more professional than the typical waiters you'll find...that's a sign that you're in for a classy experience. <br><br>As I was here for a private event, the meats that would be passed around were pre-determined, but I still had the chance to try several including the pork sausages, Alcatra  (top sirloin), Beef Ancho  (rib eye), Pichana (prime part of top sirloin), and Frango  (chicken).  The Beef Ancho was probably my favorite out of all of them, but all were fantastic.  We were also served the polenta, garlic mashed potatoes, and caramelized bananas - I love my potatoes, in any form, and so you know I reached for those wonderfully starchy mashed potatoes more than I should have.  <br><br>Though I didn't have to pay for this meal, I know that typically it costs something like  $50 per head, and though that may seem expensive, you do get endless, well-cooked and cut Brazilian meat.  This is definitely an experience that you'd want to put on your bucket list!  And if you're worried about parking, they have valet but it's also fairly close to some CTA stops.  <br><br>Find some time to say \"Chao\" to your day-to-day activities so you can come chow down at Fogo De Chao!", "pics": null}}, {"review": {"des": "Our first time here for our 2 year wedding Anniversary. The service was amaizing, great atmosphere and the food amazing.<br>Definitely a do over for us. Thank you for the sweet gesture of giving us a complimentary Anniversary dessert.", "pics": null}}, {"review": {"des": "Came here with a large group of people for a work lunch. We had several waiters and they were all very attentive. The salad bar is enormous and the choices are almost too much to take in. It's great that there's so many options and things to try. There was a great selection of meat to try, all of which tasted great. Make sure you work up a big appetite before you come because this place is absolutely indulgent. The quality of food here is great and hopefully you can experience as much as you can. Definitely eat as much of the house special (picanha) as you can, it's really really really delicious!<br><br>The side dishes that you get at the table are also really good. They range from things like mashed potatoes, fried polenta, fried plantains, or cheesy bread. The whole experience of eating here is great and I'd definitely bring my friends here to get an extremely delicious and filling meal.", "pics": null}}, {"review": {"des": "ALL YOU CAN EAT MEAT. Came here on a Saturday night. I don't know why but I was craving meat, a lot of it, variety and flavorful. I've been here several times at this location as well but I might as write a review on it. Anyways when coming here on a Saturday night, made a reservation through Open Table the place was PACKED. I was SHOCKED. The crowd is super diverse but the fact that this chain restaurant was PACKED surprised the heck out of me. <br><br>Service per usual was pretty bad. I mean I get it, you're busy, there's tables with large parties, meat is scarce to come by to the tables with 2-3 people because the tables of 10-15 are getting all the good pieces of meat by the time you get there. Let's be honest, the key is where your seated and where the meat comes out. If you're stuck all the way against the wall, the chances of you getting good quality meat, fresh off the grill are slim. Ended up paying around $140 for 2 people with tax and tip. Don't come here if you're trying to impress a girl. Because it's loud, and very festive which is totally A-OK but you might have some smell burps and have to go to the bathroom afterwards. The quality of meat sometimes I question. Some pieces seem great, some pieces not so great and when I say not so great I mean chewy, chewy chewy and rough. Would I come here again? Of course. Can't really go wrong with Fogo.", "pics": null}}, {"review": {"des": "I'm a big fan of Brazillian Steakhouse restaurants and Fogo is my brand of choice. Consistently great food, great service and reasonable pricing (admittedly not inexpensive, but I'm all for the price point and unlimited steak) - my 'home Fogo' is in Indianapolis but I like to try Fogo in other cities when I travel.  There is a lot of great food in Chicago, but I still ventured out to try their Fogo option.<br><br>Fogo in Chicago has the usual - great salad/food bar with all sorts of goodies, several cuts of meat that come straight to your table, adequate wine list, and if you're in the mood some desserts that look good. IMHO, if you're eating dessert you did something wrong on the 'unlimited steak' part of the meal. . . what part of UNLIMITED did you not understand?<br><br>Meals, of course, are served with fried polenta, mashed potatoes, fried bananas and cheesy bread. All are great and a good addition to the meat.<br><br>This particular venue feels a bit smaller than others I've been to.  It's located in what I believe is River North near many different options for fine dining, so perhaps the idea is that they're one of many and can't keep a giant place filled.  It would be a great place to bring a business group or your staff for a nice dining experience.<br><br>Great place, great food, great service!", "pics": null}}, {"review": {"des": "I made a reservation for 7/5 (Thursday). A couple days later, I received a call from the restaurant saying that it would be closed on Thurs and Friday due to construction. As I had my family visiting that week I moved the reservation to Saturday. <br>We did the full churrasco for lunch. I expected lunch price would be the same all week ($35ish), but the Saturday lunch full churrasco was about $41 per person before tax. <br>The servers were quick to bring meats to the table when we had green side up. We loved the little warm bread that they served continuously when the basket was almost empty. <br>There were beef, pork, chicken, and lamb that were being brought to the table constantly. Personally my favorite was ribeye and filet. When I got the first meat slice from the block, it was a little too salty (because all the seasoning is on the outside of the meat). But overall, the quality of the meat was pretty good. <br>They were quick to take plates away whenever necessary and bring new plates promptly. Everyone was super kind. I also enjoyed fresh fruits and vegetables from the salad bar. I wish they had some desserts at the salad bar though!", "pics": null}}, {"review": {"des": "Food was great service was ok meat servers was very rude just called the restaurant to speak with the manager he told me he was gonna train them they are grown mean not kid friendly i don't believe they felt like i could afford my bill we felt uncomfortable the whole time the two waitress that served us was awesome we was looking for an handout we deserve great service and that wasn't it i was waiting on the manger to say hey next time you come in come see us we'll make sure this will never happen again to be a 5 star restaurant the meat servers wasn't also when we was looking for the rack of lamb the kept avoiding are area like they didn't wanna serve it to us if there is another place in Chicago that would be delighted to take my 900 i spent including tip let me<br>Know will get my service any day", "pics": null}}, {"review": {"des": "The food was great. All the cuts of meat were hot and juicy. Service was decent. The salad bar is no joke. The candied bacon is sooo good. Also had complimentary cheesecake because it was my birthday. Only issue is that we had a table reserved for 7:30 and weren't seated until 8:30. 1 hour! They kept saying a few minutes and then said 15 minutes so we decided to go to the bar. Bad idea. The bar area is pretty small and cramped. Only one person out of our group could actually make it to the bar and we had to pass along drinks like an assembly line. This is all on a Tuesday by the way. Overall great food but be ready to wait if need be.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oSSigVASf6pfns8oZkiXfA/348s.jpg", "caption": "Complimentary Birthday Cheesecake"}]}}, {"review": {"des": "I have been here several times, and it's great, I like the service style and the food is good but their attempt at 'Thanksgiving' fare was a bust! The salad bar is phenomenal, and the cuts of meat are seasoned nicely. The wine menu is good too. But us carb-cravers were a little disappointed with the wait for stuffing and sweet potatoes! I was able to find some with my second trip to the station, and was rewarded with crisp marshmallows on top of  sweet potatoes! <br>A couple of service hiccups: a waitress cleared dishes and placed a steak knife on top of a pile, and it fell onto the floor! That could have been ugly; also we had a gift card/certificate for dinner but a waitress claimed they didn't take them on holidays. The card did NOT state this but luckily a person working the register made it work.<br><br>Dessert is good there too. I liked the Strawberry cream and tres leches cake.<br>The price is now $55, up from $50 for years. Carnivores galore!", "pics": null}}, {"review": {"des": "I ate there on 10/21 in celebration of my birthday & OMG am I happy I chose this place for brunch!!<br><br>We sat down, we were greeted and off we went to the salad bar. We came back, flipped our cards to green and an hour later we all had a food coma.<br><br>The selection of meats were very good. I do not eat pork or lamb so unsure how those were but having tried all the beef options I can vouch for it's pure deliciousness. Also, Having gone to similar establishments Fogo is definitely the better of the bunch. <br><br>The service was amazing. Although we had about 4-5 servers they were all very attentive and refreshed our plates and kept the drinks coming. <br><br>I am not sure what else to say... Overall my experience was exceptional and it may have been one of the best dining experiences I have had this year.", "pics": null}}, {"review": {"des": "I come here very often, and every time the service is different. For the majority of the time the servers will be constantly bring over the meats, but sometimes it feels like they avoid your table. The food here is absolutely excellent between the meats and the salad bar. Be prepared to eat A LOT if your coming here.", "pics": null}}, {"review": {"des": "I'm raw vegan so the choices of what I can eat were not overwhelmingly abundant here but the plantains were delightful. 5/5 needs more desert and a larger table as the seats were too close to the table and it left an impression on my tummy for an hour after dinner.", "pics": null}}, {"review": {"des": "The picanha is always great and the service is always amazing BUT there were some major hiccups this time.   <br>The first impression killed it for me.   The ladies room was full of stomach wrenching issues.   There was one toilet that was covered in a garbage bag, one clogged and then one peed on.   I know the restaurant is not doing the peeing but when this is the first stop you make and it is unserviced to the point of turning your stomach before you dine, the whole meal is ruined.    When it takes 4 tries to get a working toilet....they aren't doing something right.   <br>There were some major meat issues this time (aside from the picanha).   The bacon wrapped filet was so dry you could barely chew, the sirloin was cut so thick you couldn't swallow without giving your jaw a 10 minute workout and the sausage was as dry as it gets.   <br>Not sure I would return with other Brazilian options in such close proximity", "pics": null}}, {"review": {"des": "Pretty solid food here. Overall I will say the meat here is better than what I remember when I last went to the Rosemont location and the prices are almost the same, $7.75 for a blue moon seems high considering they just pour it out of a bottle for you. One piece of sirloin I got was too salty to eat and a piece of filet mignon I asked medium was nearly raw on the inside, but the rest of the meat was exceptional. Their chicken salad is also some of the best I ever had and all their cheeses are fantastic. I will be back here.", "pics": null}}, {"review": {"des": "Have not been here in a few years, however needed my 'meatatarian' beef fix. Was seated promptly for lunch. Cuts of meat were 'very average' from what we used to get in the past. The Fogo chains went public on the NASDAQ exchange, so perhaps they are operating more as a corporation than a food sole proprietorship. I was able to try many different cuts, however, on many occasions I requested other cuts I did not have, Long story short, they never showed up after the Gaucho assured me he would be back with them. My assigned server also kept telling me that they will arrive shortly. Never came to the table.<br>Another annoyance was the gentleman that initially explained to us the lunch menu was pushing a pitching desert and coffee BEFORE I was even done with my lunch offerings. WTF, I did not ask to see any of these. Wait till I am done, then I will decide. Perhaps I may be back for Market Table only in the future. Meh!", "pics": null}}, {"review": {"des": "I dined in at Fogo the other night and had the pleasure of being served by Destiny. She was so delightful and had such a great attitude. She recommended I try the caipirinha and boy was she spot on. It was delicious. I really enjoyed my experience and found Destiny to be very hospitable. You can't forget about the meats as well. The bottom sirloin is so tender and flavorful. Can't wait to visit again.", "pics": null}}, {"review": {"des": "Always a great time here and only once out of several visits have I had a negative experience. I plan on coming back for years to come", "pics": null}}, {"review": {"des": "This restaurant declined big time since my last visit.  <br>On my recent visit the restaurant was half full on a Sunday evening.  We were seated, ordered drinks and waited.  10 min go by, 15min, 20min go by and nothing. We got up to get our salad.  Usually the waiter comes and explains the concept to those who haven't been there but  hah didn't happen. We got salads, and meat people started coming, another 10min went by and it drinks still weren't there. 30min went by, they finally brought our drinks. <br>We had 6 people in our party and we were served  a small plate of potatoes as they did for tables seating 2 people; and a total of 4 caramelized banana... for 6 people.  Meaning 2 people couldn't even try them. <br>I asked the waiter what type of meat they serve and the answer was \"we serve all different types\"... really??  There is no menu, so what can I expect?    I asked one of the people carrying around meat if I could get steak in medium well, and I have not gotten medium well meat all night.  <br>No desert menu was served, and they didn't have a sweets tables... so I take it that they don't even serve sweets.", "pics": null}}, {"review": {"des": "I'm a vegetarian, so what am I doing here? It's called the giant market table.  Easy to fill up on veggies, cheese and salads.  Also the cheese bread things and mashed potatoes.  So it's a cold meal, but it's pretty amazing and the carnivores are happy. If you are not into looking at meat, this is a no go, though.", "pics": null}}, {"review": {"des": "I've been to this place a few times over the years. My last venture which was about a month ago could have been better. We went over a Friday for a Full Churrasco Experience lunch. I've noticed that many of the meats were overly seasoned and the gaucho's don't do a very good job at circling around the dining area. Often, we'd have to flag someone down to come over. In some cases, the meat was overly done, I mean burnt. The kale salad that day was very salty, the banana side dish looked and tasted like it was on a boxing match. I complained about this to the Maitre'D and it improved the next serving of the banana side. I don't know what was happening that day but I'd hope that service and food quality would've been consistently high for the price you pay.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ErXUI8J4TzKAB337gyu5wQ/168s.jpg", "caption": "Strawberry Hibiscus Caipirinha ... sooo good!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5eA3JhicKfBD_VfcpqZofA/168s.jpg", "caption": "Chicken sliders from the Happy Hour bar selections"}]}}, {"review": {"des": "Basically a buffet where you go to the salad bar to get your non meat dishes cold salads tubes and then when you're sitting at the table service come if you flip over a certain coin to know if you want me or you don't want me you can upgrade the option that include to a better cut and Seafood over the years it seems like the quality of me has changed and it's not as good as it used once was but it is a very popular place more of a tourist attraction to me occasionally they offer two for one deals and if you get on their mailing list they will send you something out for your birthday or anniversaries the last time I was there the meat was a little greasy and cold by the time I got to eat it because I had so I don't know if it was because I had so much on my plate so definitely pace yourself and this is definitely for a special event red meat eater enjoy", "pics": null}}, {"review": {"des": "we celebrate my daugther bday 18th<br>fist time they ofert the chicago restaurat week special whit some restriccions <br>the fogo de chao experience but some restriccion too<br>we definally  have  the fogo de chao <br>salad bar is awesome fresh and delicious all staff friendly and atentive <br>i surprice see rice & beans jalapeños, imported beer like negra modelo ,coronas and more<br>they offer litle botles of coca cola  for kids my son drink 3 and my daugther 2<br> and they charge $3 something for each i try the caipinina not my favorite<br>but was good experience the  gauchos walking around whit the meats <br>kids under 12 is 1/2 off <br>thanks and see you next time to celebrate another special ocation", "pics": null}}, {"review": {"des": "Can't get enough of this place. I've been here so many times with my family and the hubby, I'd say that this place never changed based on my experienced. Impeccable service. If I can only give 10 stars I would. We would be coming back this week since one of the servers gave us a gift card a month ago letting him know how happy we were as customers with the service (If I can only remember his name..... ) We didn't expect anything from him, but he came back to let us know how much he appreciate us as customers. He became comfortable with us and shared that his been working there for 30 years.... that tells you something. <br><br>Oh well, you got a faithful customer here. I mean, there's a lot of good restaurants here in Chicago, and I would say Fogo is one of my favorites, esp. this location. Keep it up guys....", "pics": null}}, {"review": {"des": "Had lunch there yesterday and just had the Market Table. Great quality and very reasonable for lunch in River North. One of the best lunch values in River North!", "pics": null}}, {"review": {"des": "My favourite one is sirloin.. its tender and it melts on your mouth. Every 5 minutes you need to stop getting food from the server so you could finish what yu have on your plate..<br>The resturant wasn't fancy compare to the New York location..", "pics": null}}, {"review": {"des": "Have dined here since they opened in early 2000's.  <br><br>Overall the place seems to have declined.  The top notch service they were always known for is in serious need of rehab.   Bar service prior to seating and was very slow even though we were only one of three parties at the bar.  <br><br>Witnessed a drug deal go down in the men's room. <br><br>They've added warm items including soup (did not try) to the salad bar.  They appear to be offering an add-on to the menu in the form of a shrimp cocktail carried throughout the dining room.  Food was great, gauchos were as prompt and attentive as usual. <br><br>Missed the typical manager stop-by to ask how things were.", "pics": null}}, {"review": {"des": "The food and service are great! I'm in a meat coma right now.<br>Pro tip: Make sure you skip the rabbit food and take in all the protein you can at this place!", "pics": null}}, {"review": {"des": "This is the only Fogo de Chão I've been to and this place never disappoints. The servers are spot on, the food is beyond delicious and fresh and the atmosphere is sophisticated. <br><br>I went for lunch with my sister and brother in law after a long morning of shopping, yes...i know, the torture. We were greeted by a wonderful friendly host who offered to check our coats and my bags. We were seated and quickly asked what type of water we wanted. After ordering a delicious bottle of wine, we hit he salad bar. If i were vegetarian, this would be a very satisfying salad buffet. After eating our tasty charcuterie and veggie items, we were provided clean plates to start the meat show. Top sirloin, bottom sirloin, chicken thigh, bacon covered chicken breast, lamb chops, pork and beef ribs and lamb chops. If something didn't come out, we were able to request it. My favorite was the top sirloin, you can ask for the rareness you like. So tender, salted perfectly and delicious! We were also given cheesy puffs, fried yuca, plantains and garlic buttered mash potatoes. But we know what we're here for right? Meat! I don't know but i feel like i had my money's worth. <br><br>The room was dark, wooden and comfortable. I would go there for a special occasion or if you want to eat really really good food! Obrigada!", "pics": null}}, {"review": {"des": "This restaurant USED to be my all time favorite, over the years this place and went down. I went there yesterday and decided I wont be back. Upon making my reservation online, I requested well done beef, no pork. They kept bringing me cheap cuts of meat, like.. chicken legs, chicken breast, lamb, after we sort of filled up on the salad bar and sides they brought me  BEEF like sirloin, filet..e.t.c.. The service and décor and food have all went down. What a disappointment.", "pics": null}}, {"review": {"des": "Wow. I have so many things to say. This place is beautiful. <br><br>1. The feta watermelon salad made me want to cry. The sweet and salty mixed with the feta cheese was like a magic show in my mouth. <br><br>2. The seasoning on the meat was the bomb. The seasoning mixed with the chimichurri was so satisfying it made me forget about everything that's wrong with me and my life. <br><br>3. The tenderloin. Wow. What can I say. It was so soft and it melted in my mouth. I can't believe I'm saying this but it was better than an orgasm (I'm assuming cuz ya know, I never had one #sad). If the tenderloin was a guy I'd let him do whatever he wanted to me.", "pics": null}}, {"review": {"des": "Phenomenal experience knowledgeable staff server was completely friendly.<br><br>Meat was tender and juicy, great flavor.", "pics": null}}, {"review": {"des": "So let me first start by saying I am definitely a meat eater but not a super carnivore. The meat selection was plentiful and the meat was high quality. We came here for Father's Day after making a reservation. They serve the meat at your table as the severs come around with different choices of meat on skewers. They had a cold buffet table which I was not a fan of. Nothing but fruit, salad, cheese, and bread. They also served 2 large pots of soup. That was the only hot food other than the meat served that day. For my husband and myself to eat, the bill came out to about $120 with tip. Now like I said, the meat was good and high quality. But for that price, I would have liked a selection of other hot foods besides just having a mediocre cold salad bar. My husband loves it and is a big meat eater so he really got his fill but I was dissatisfied. Not my thing, but try it and decide for yourself.", "pics": null}}, {"review": {"des": "I've gone to this location of Fogo a few times and the food has always been consistently good. Make sure you come hungry because the food will keep on coming. The one thing I can criticize, however, is the service. We were given the drinks menu as we sat down but we didn't get our drinks after we were well into our meal. We also requested to get the sauces and it took us asking 3 different people and waiting over 30 minutes before we were given one. When we tried to order desert it took a total of 30 minutes of us trying to get some menus and then for someone to stop by again to get our orders. I honestly didn't mind the wait since I was with my siblings. However, it does seem a bit excessive and it's definitely something to keep in mind when going here.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hAR2m7M6S386Zdb4dDYa-A/348s.jpg", "caption": "Turtle Cheesecake"}]}}, {"review": {"des": "Regrettably, seems Fogo is of the philosophy that once they've got ya, who needs to keep ya? They're like that sociopathic hot guy you meet who treats you like a queen for the first month or so and then slowly, slowly begins neglecting you until he's full on ignoring you. <br><br>The first time we went here, it was phenomenal. And then the service slowly dwindled until the last time when after the first round of service, we were pretty much ignored. So I see how it goes. They try to gorge you early on so you'll get full and leave and then they can use your table again. But if you linger? Good luck getting any service. At 3 bills for a dinner, dam right I'm lingering.  But no worries, Fogo. I won't be lingering HERE anymore. Pity, cuz the food is great.", "pics": null}}, {"review": {"des": "We went last night for dinner really nice food and service.<br>I like that system for meet .<br>We will back", "pics": null}}, {"review": {"des": "I was recently here for the first time for Lunch; previously I have been here several times for dinner. <br><br>My friend and I were NOT at all disappointed in either the selection or the quality. In our humble opinions, Lunch is a great option!", "pics": null}}, {"review": {"des": "This is the place you want to go if you want to have the best meat you've ever tasted in your life. It is fresh, right off the fire, juicy meat that will not disappoint. The service is fast and they keep it coming! I loved the chicken wrapped in bacon. YUM! <br>I went to this restaurant right before I became a vegetarian. I wanted to taste all the meat and try all the things. I didn't want to ever wonder what a steakhouse was like prior to giving up meat. This was the best decision for me ever. I was able to try all the best meats all at once. It was like the last supper. And it was divine. <br>However, I messed up big time. I tried so many different items at the salad bar. So many different ones, that by the time the meats were coming around, I was already full! I wish someone told me not to fill up on salad. <br>I didn't like the price tag of this experience but I wasn't paying so I still gave this four stars. If I had to pay for this, I may have given it a three star review. 50+dollars for a plate is a lot. Especially when I filled up on salad. There should be an option just to buy a salad buffet bar pass.", "pics": null}}, {"review": {"des": "This is my second time having the lunch special on a Sunday with unlimited salad bar and meats. It includes free drinks and a dessert. It's AMAZING.  If you want to make the most of it, do not eat anything beforehand and PACE YOURSELF. It's tempting to get everything but it's okay to decline some meats. I suggest getting the bacon wrapped beef rib, any of the sirloins, and the beef rib. They save the best meat last until the very end of your meal. They do that on purpose so you can fill your stomach with other foods and have less room for the beef rib.  The beef rib is sooooooo good. It's served warm and it melts in your mouth like butter. You can savor it in your mouth. You can also ask for sauces to go with your meat. My favorite is the chimichurri sauce. They also have horseradish, mint jelly, A1 sauce, BBQ sauce. Don't use the sauces for the beef rib. If you do, it's like you committed a crime. The beef rib itself is all you need. <br><br>The waiters come in and out with meats on poles and they carve it in front of you and you pick up the slice with the mini tongs they give you. They also give you cards where it tells the waiter if you want more meat. Red means no and green means yes. <br><br>The salad bar is really good. Their papayas are so fresh and you need to try some. It's like you're eating them in Mexico. Their yogurt parfaits are alright. My friend said it's like McDonalds. <br><br>For drinks, you need to get the LIMEADE. SO GOOD and refreshing.  It's bottomless so they keep giving you another cup if you're finished. It's the best drink there. <br><br>They also give you side dishes like caramelized bananas, garlic mashed potatoes, fried potato sticks, and endless soft cheesy bread rolls. <br><br>Don't forget to ask for the dessert menu! I got the molten chocolate cake and it was a taste of heaven. Please do get it. I think it's the best dessert on their menu. You won't regret it. <br><br>By the end of the meal, you will probably gain 5 pounds but it's worth it. I don't know how much this deal is exactly because people treated me. BUT I heard it's a good deal especially if you're getting all this food!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9Rn24n27AIdeWWPw1-hj5A/348s.jpg", "caption": "Limeade"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pbqVSK9DmlsWzz2_lCuQrg/168s.jpg", "caption": "Molten chocolate cake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3YM0ay8-jQUewuitDof2OQ/168s.jpg", "caption": "Slicing the beef rib"}]}}, {"review": {"des": "Staff were all friendly, the food was great. All the staff work together to serve you so you're not stuck with one waiter/waitress that'll forget about you, so that was a plus! Our water was filled before it was even half way, there were so many selection of food that caters to the many needs from the meat eaters to the vegetarians to the occasional drinker! And with the simple flip of a coaster you can tell your server you're done for now or to keep it coming. My wife and I make this our go to spot for our date nights!", "pics": null}}, {"review": {"des": "I took my girlfriend to Fogo de Chao for her birthday. It was not a good experience. We made a reservation for 7pm, we showed up 10 minutes early and we were asked to wait for a table. Ok?<br><br>We waited almost 30 minutes to get seated. <br><br>The place was packed and disorganized. The front desk staff didn't seem at all interested in creating order. There were kids running everywhere as well as way too many people by the front entrance. I get that it gets busy but if I make a reservation I expect them to tell me if it's busy or if there's a chance that they cannot meet the reservation. <br><br>The food:<br>$140 spent for two people (no dessert). This is way too much money to spend of mediocre food. The steak was good just not $140 good. The salad bar was respectable. The steak runners kept asking if I wanted more meat even though my coasted was flipped to the red site. The bread was the best part. <br><br>Overall this was just a bad experience. I get that it gets busy because it's a unique restaurant but at least have the common decency to communicate with your guests. It was mostly the lack of organization that killed it for me. Having been asked to wait on a reservation and they couldn't even offer an apology. Birthday dinner ruined.", "pics": null}}, {"review": {"des": "You go here for the experience of it all. I liked the meats that they keep passing around but there is only so much of it you can eat before getting full. None of the stuff in the first course seemed to impress. The highlight was the cheesy buttery bread that they serve. If I had a choice I would order that instead of the first course. On the whole it was a unique experience. The cocktails and drinks menu is pretty good. And you will not be disappointed by your drink.", "pics": null}}, {"review": {"des": "Great Steak, great service.  By far my favorite Brazilian Chain and this one doesn't disappoint..", "pics": null}}, {"review": {"des": "Came here for a large group work lunch.  Our waiter was very attentive and made sure everything we wanted was delivered.  I've been to the rosemont location as well and to compare I think the rosemont salad bar is much bigger and has more options. Everything else about the experience was consistent l. Good service, lot of meat options, and we defiantly left super full!", "pics": null}}, {"review": {"des": "Management needs to be replaced at this restaurant.<br><br>We went there last night to celebrate a birthday and an anniversary.  Although the food portion of our meal was enjoyable, the rest of our dining experience was just awful.<br><br>Some of the things that were witnessed:  We were seated near a bussing station, where they drop off plates/glasses before they are moved back to the kitchen.  An employee ended up spilling an entire drink/ice on the floor, some of the liquid ended up splashing onto the pant leg of one of our party.  The employee kicked the ice into a pile and left.  It wasn't until another employee noticed the spill 15 minutes later that a \"Caution:Wet Floor\" yellow placard was placed over the spill.  It was never cleaned up during our meal, nor did anyone ever come over to our table to apologize for the spilled drink.<br><br>A table near us had two adults, one teen and three young children.  The children alternated between running around nearby tables and screaming at the top of their lungs.  It was distracting and obnoxious and made it difficult to hold a conversation.  The parents never lifted a finger to corral their children, and the staff turned a blind eye to the circus that went on for our entire meal.  <br><br>Another nearby table was being turned over next to ours.  The staff member performing the linen change proceeded to kick a straw wrapper around the table and then left it on the floor when they were done switching out the table cloths.  A bread basket was at our table before we were seated, I can only assume it was there from the previous diners.  When we were first seated, the server asked if we were going to order wine and seemed insulted when we asked to see the wine list rather than listen to his recommendations, after which he took the beer and cocktails lists and walked off.  When we mentioned that the two other people at our table weren't drinking wine and would like to see the other lists, he threw them at the table.<br><br>Had it been just one event, it could be chalked up to a bad day, but the attitude of the employees comes down from the top.  Service has severely fallen from the first couple of years that this restaurant opened.  We used to go to Fogo 3-4 times a year to celebrate special occasions, but now we'll likely never go back.  Our bill was almost $400 and the service simply doesn't justify the price.", "pics": null}}, {"review": {"des": "I had the worst experience at this place today, place wasnt busy and still everything was taking so long to come out, bananas were dry steaks werent that good, we ordered dessert and took over 30 min to get and the end we they got us a bill and never got the dessert, this ruined our new years eve we should have chose a different place to go", "pics": null}}, {"review": {"des": "Coming back again with my husband for the pre-Valentines, great as always!<br>My husband is not a meat lover but this is one of the two places that he would drive to enjoy good meat selection with me. <br>The manager is great. It was not quite busy yet as we went early but he always supported his staff. He visited all the table and that what I would expect as I am in restaurant business. My husband even said the same thing. We'll be back again soon.", "pics": null}}, {"review": {"des": "Our first time coming here!!!! Excellent place!!! The service was on top of the world and the food was so good it melted in your mouth!!! Definitely going to be back!!! Worth every penny! Must experience fine dining to the fullest here!!!", "pics": null}}, {"review": {"des": "My son chose this restaurant for his 24th birthday celebration. I knew  a little about this type of Brazilian steakhouse from commercials and from friends experiences with them. But until you actually dine at one you'll never really know how it is. The relentless onslaught of red meat and pork on huge meat skewers come to you by friendly servers we learned when you leave the red and green sided coaster that was given to you with the green side up as a signal that you are \"ready\" for the meat! They will keep coming until you flip your coaster to the red side that you need a break to digest your food. I am not a red meat or pork eater so I had their chicken choices which although very tasty, nothing out of the ordinary. But for the lunch buffet, the tremendous salad bar alone was worth the price of admission. <br><br>I recommend this type of restaurant for those who like red meat and pork and for those who are not red meat lovers, not to expect much in terms of non-red meat choices. It would be nice if at least some seafood choices were offered as an additional option.", "pics": null}}, {"review": {"des": "Me and my spouse really enjoyed the food as well as the scenery. The service was pleasant and we surely will be back.", "pics": null}}, {"review": {"des": "I'm a celiac and called (ahead of making a reservation for 9)to speak to a manager ahead and see if there's something I can eat on the menu. Instead I got a rude hostess who answered the phone, refused to put the manager on, and says there's only 1 dish that can be prepared for me. I still have many questions for the manager and she just won't let me talk to them so we are going to pick somewhere else to eat. Even the online menu says there's other things I can eat besides the one she listed. I feel insulted and if u have a serious allergy don't eat here, they don't take it serious and bad customer service.", "pics": null}}, {"review": {"des": "Went for dinner on Saturday! Amazing food, great experience, awesome service!!!! All team is very attentive - starting with host stand, servers, meat servers, managers, and ending with valet guys!<br>Salad bar was fresh and clean! And meats were cooked perfectly! For desserts i recomment having papaya cream ! <br>If you never had caipirinha- you have to try it!!! We had passion fruit and traditional- they were super delicious!", "pics": null}}, {"review": {"des": "Not crazy impressed. Salad bar wasn't as large and not nearly as many offerings as other Brazilian steakhouses I've visited in the past. I get it, I'm probably the only person ever who goes to a place like this for the salad bar.<br><br>The meat goucho/server people were great, but it seemed the rotations were a little off. Kept seeing the same 3 meats over and over again. We had to ask for a chicken and lamb selection, which they were happy to accommodate, but really? We needed to ask. That was dissapointing.<br><br>With that being said, the after dinner cocktail was the best thing ever. Amazing tequila selections, cordials etc. Loved it!<br><br>Also, clearly a tourist spot, which didn't surprise me, but annoying none the less.", "pics": null}}, {"review": {"des": "So final in night in Chicago with my man JewBoy. Conference was draining and we hadn't eaten all day and had been napping. Searched for buffets on Yelp and this was the first one that showed. All the reviews seemed bomb, and I was starving. So I'd recommend making reservations...it wasn't hard but as we could easily see, the wait could take some time if you didn't. Ambience was nice, welcome, dimly lit to stimulate that appetite. Service was quick and on point. Servers were constantly by. The salad/appetizer bar had a great selection. Great cheese and cold cut spread. I wish they had more soups, but I can let that go. The meat servers constantly made rounds and I had to keep turning my card to red otherwise I would've had a ridiculous pile of meat on my plate. Meat was always well cooked to a nice medium rare. Great char. They didn't go crazy with garlic coated or parmesan coated meats...kept it simple which I liked. I've been to a few Brazilian steak houses, and this one did not disappoint. I'd come back.", "pics": null}}, {"review": {"des": "Service 5/5<br>Atmosphere 5/5<br>Food 4/5 <br>Price 4/5<br><br>Service is amazing, each waiter knew that my meat is Mediumwell and my wife's well done. We didn't have to repeat it every time. The waitress informed us from the beginning of the items that are not on the menu.<br>This place is very well designed from the inside. Even though it was dinner time, I was able to speak to my wife and hear her clearly. <br>The meat is more balanced than Texas De Brazil (TDB) but some items are juicier and more tasty at TDB though the food can be a bit salty. <br>The rice (for rice lovers) is 100%better at TDB. <br>If you are a salad bar lover, Fogo De Chao isn't your place. <br>I felt I was ripped off when I paid $6+tax for 2 small diet cokes. It's about $50 pp to dine in", "pics": null}}, {"review": {"des": "They don't know how to handle a busy house here. Wanted this to be my last meal in Chicago, even though we have one back in Jersey I never been to one.. takes years for them to start bringing out the good stuff I.e rib eye and filet, even tho top sirloin and garlic beef was good. It's just the experience ruined it for me.. I asked for rib eye specifically and it took 15 mins for them to come back.. the food is good salad bar is great but again the experience made me want to get up and leave", "pics": null}}, {"review": {"des": "Couple weeks ago I visited Fogo de Chão. I was with my best friend for our birthday, he flew in from California. Although it was the weekend the service there was amazing. We were asked constantly if we needed anything. Our server was Edwin who was very friendly. Plus the food was amazing! Definitely will be going back to celebrate more special occasions.", "pics": null}}, {"review": {"des": "I've been to Fogo in Indianapolis & the experience was amazing! The one here was horrible. I left hungry. How is that even possible? We waited 45 minutes before we got our first piece of meat. (Mind you, we had to ask the manager why we havent seen any meat by our area). We really didnt even want to stay for the birthday dessert because we were so bummed with the service.", "pics": null}}, {"review": {"des": "Delicious food. Classy and professional staff.<br><br>The food is irresistible but doesn't try too hard. A large variety of dishes at the buffet bar...definitely a plate for even the pickiest eater. If you love salads, you gotta try the apple salad or the chicken salad as I'm sure you'll fall in love like I did. The steak is cooked and served just right...not too spicy or hot, but not lacking flavor. <br><br>What I really like about this restaurant is how welcoming the atmosphere is, despite being a large and somewhat eccentric steakhouse. Note that it can get very busy very quick, which, of course, is typical with any popular restaurant. <br><br>All in all, definitely worth a visit.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tQPi4oMIABiQHp_1Nct9qA/168s.jpg", "caption": "Cheese, kale, and chicken salad :)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0OkkcKskEg0hLCNji0-RIw/168s.jpg", "caption": "The delicious food from the buffet bar"}]}}, {"review": {"des": "I liked this place. Enjoyed that I could get veggies, breads, cheeses, etc. as well as meat. So you can get all the food groups and not be committed to like a plate of spaghetti, you know. For my part, I like my meats very well done, so I had to ask them to bring it back more cooked, and they were good with that. (But I never did see any shrimp). I do wish they had better signage on the food. I don't eat pork/ham, and I didn't realize until later that the black beans were cooked in pork. :( <br>We had the tres leches and the papaya cream thing for dessert. Let's just say the entrees were better. <br>Service was very nice and friendly. <br><br>OK. I think I just realized that the chicken I ate was also bacon wrapped. Oh man.", "pics": null}}, {"review": {"des": "Decided to give this Brazilian steakhouse a try instead of our other preferred downtown location. It's difficult to rate it because we didn't exactly have a \"bad\" experience but there were some fundamental things wrong with our dinner. <br><br>But first let me start with the positives: <br>The portions of meat each server gives is great; very generous, not at all stingy as you see with other buffet type restaurants. Secondly, the service was absolutely amazing! Everyone was really on top of their stuff clearing plates, getting refills, and checking in. Great job everyone! :) <br><br>Negatives were as follows:<br>1) I like my meat medium rare. More than half of the meat I received at \"medium rare\" was medium at very least if not as high as almost well done. It led to a lot of wasted food.<br>2) I was highly disappointed to learn, after we had just eaten desert, that there was seafood available. In our entire hour of eating not once did any come to our table or did I even see any in our area of the restaurant.  <br>3) The napkin in our bread basket was filthy and there was old dried food from the salad bar at the bottom. My dad had it replaced while I was in the bathroom so I don't know what was said between him and our server but our new bread basket was fine. <br><br>Overall, it was ok but, given the price and the problems we had, I wouldn't go out of my way to return.", "pics": null}}, {"review": {"des": "There are a ton of Brazilian steakhouses around Chicago and they're all pretty interchangeable, but that's generally a good thing.  The market table here is good with a decent, but not extraordinary selection.  You can build a nice salad here to have before diving into the meats.  <br><br>The meat selection was good, but again, nothing extraordinary. Our favorites are the lamb chops and beef ribs.  I will say that one that I noticed was that the meat wasn't over salted as it is at most other churrascarias.  The top sirloin was also quite good.  I got an end piece that had a great crust but also the piece itself was rare, like cool center rare.  I don't normal get my red meats done that way but that piece was very good.  <br><br>Service was good, kids (both ours under 7) ate free.  My wife and I both had cocktails, which were good.  With a $25 coupon, the bill was still over $150. So, not something to do every week, but for a special occasion, perfectly fine.", "pics": null}}, {"review": {"des": "Im not sure if I would go back to this location again. The food was awesome and the servers were great aswell. What ruined the night was the hostess and the reservation. My girl and I had a 7:30 reservation this past Friday on Opentable from their website, specifically requesting a table near a window for her birthday. They literally sat us in the back facing the waiters station and a wall of plates. For her birthday! The front was not full either when we arrived or when we left. I ordered a bottle of wine and a beer for myself. The food was fantastic and the waiters were cool but where they sat us ruined the night for me at least. Bill came out to about $200 I left a $40 tip after making sure that would only go to waiting staff. They shouldnt have to pay for the hostess inconsideration. The experience really made me miss Brazzaz.", "pics": null}}, {"review": {"des": "Came here to celebrate our anniversary. No special greetings even though I specified it our reservation. Only an email for a free dessert which we couldn't eat due to a diet restriction,  which was again specified on reservations. Seated next to a wall which had food splattered all over the wall and trim, and thick dust on wood trim of tv. Made it extremely unappetizing and disgusting to look at to enjoy an expensive dinner. Barely any well done cuts. Servers never returned with well done cuts upon requesting. Only good thing was the beverages- Brazilian beer and cocktail. Will NOT return.", "pics": null}}, {"review": {"des": "COST: <br>$52.95 (Full Churrascaria + Market Table)<br><br>Yes it's a chain, but it's a damn great chain. I've been to the one in LA and was recently at their Chicago location. I can definitely say you absolutely get what you pay for and the service is incredible.<br><br>The market table was full of cheeses, cold cuts, salads, breads and sides you can imagine. The ambiance and the place was really awesome as well. Come here on a near empty stomach. You will eat LOTS of food... or should anyway.<br><br>My best picks are the Fogo special steak and lamb obviously! The fried plantains/bananas are delicioso! I plan to come back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Q4E70L_pQP1HfuqNPBNxyQ/348s.jpg", "caption": "Lamb!"}]}}]}