{"name": "forastero-restaurant-chicago", "reviews": [{"review": {"des": "This is my go to Korean Taco place. The service is great and it's BYOB! Daniela is almost always there and she's the best. Tell her I sent you .<br><br>My credibility: I'm Korean, born and raised in NJ. There's a heavy Korean population there which means competitive Korean restaurants, and this place can definitely compete. The flavors are so accurate and the quality is always the best. It's the hidden Korean gem of Old Town.<br><br>My experience: Daniela is almost always there and she lives and breathes customer service. This place is BYOB! I've even ordered for my office, and the quality and service remained consistent.<br><br>My recommendation: Trust me, order the Korean pork taco, the kalbi taco, fish taco, and the kimchi fries.", "pics": null}}, {"review": {"des": "Came on a Sunday night for dinner. Ambience was cute. Top 40 hits were blasting and there was a TV playing Sunday night football.  There were a few occupied tables, but we were able to walk right in and order at the counter.<br><br>We ended up getting the cochinita pibil sandwich, which was a generous portion of flavorful pork on a big soft sub roll. We also got the fries and aioli. Fries were crisp but I thought needed a little salt. <br><br>Overall a great value meal with big flavors and friendly service! I'd definitely come back to try the tacos.", "pics": null}}, {"review": {"des": "we saw the good yelp review, ate there and enjoyed the food, met the owner who shared that rent was high, business was slow, that he only started a korean taco restaurant because he was advised to. feeling compassionate for him & his business, i ordered a large to-go amount of food for an event i threw a few weeks later. <br><br>ugh - they were so unorganized. the son was in charge and dropped the ball repeatedly. it took three calls to get him to respond to one, type of thing. <br><br>i had to keep calling him to pay (was using a company card i didn't own), food portions were smaller than expected, and they called 15 minutes after we picked up to say they didn't provide the entire order!<br><br>so we circled back to pick up the rest of the food & the woman at the counter actually tried to turn us away saying that we got all of it. finally a guy from the kitchen appeared with the remaining two trays. that was a frustrating experience.<br><br>i want to support independent business and the food here was really good (some flavors too sweet for my taste, tho), but compromising my job by providing poor customer service was frustrating, so i wouldn't order like that again from them.", "pics": null}}, {"review": {"des": "Forastero had been on my list of restaurants to try for a few months, and I finally decided to bit the bullet and go. We tried a couple of tacos: the Go Fish and the Forastero. We also ordered the Dak wings and kimchi fries to share. <br><br>I really enjoyed the tacos! I would love to go back and try the other ones. Kimchi fries were delicious as well! I think I would prefer it without the pork belly actually, it was still good regardless. I have mixed feelings about the wings. I think they were a little too sweet for my preference. The sauce was a pomegranate molasses with pepper, so it was a combination of sweet, sour and spicy. Not the biggest fan but I can see how some people would enjoy that flavor combination. <br><br>Nonetheless, I enjoyed my experience here and would definitely go back. There was a couple sitting next to us who ordered bibimbap bowls and they looked scrumptious so definitely trying that the next time.", "pics": null}}, {"review": {"des": "I came across Forastero Restaurant on one of my date nights with my fiance. We were celebrating a few great things that were happening in our life so we wanted to try out a cool trendy place. <br><br>Forastero was perfect was it was so cute, it has great reviews, and it's BYOB. Any place that has BYOB with no cork fee automatically becomes my favorite place! When we got to Forastero there was only one other person in the restaurant which meant our waiter was very attentive. He was very nice and informative when we had any questions. We quickly ordered our food and popped open our bottle of wine. <br><br>I ordered the Tinga de Pollo sandwich and my fiance ordered one of the BIBIMBOP Hot bowls. We took in the beautiful decor. The inside is spacious and setup to accommodate a variety of groups. I could easily see this place as a cool place for a first date or just hanging out with friends. Our food quickly came out! It was beautifully plated but that is the only positive thing I can say about the food. My sandwich was mostly lettuce and sour cream with a hint of chicken and chorizo. For a moment I thought I ordered a salad on bread. The sandwich in general was not impressive and disappointing. I ended up eating the ingredients that were inside like a salad and left the bread. <br><br>The one bright-side of the sandwich was that it was under $10. I cannot see myself coming back to Forastero because the menu in general did not impress me. The inside is cute but not worth the visit.", "pics": null}}, {"review": {"des": "I was here last night for the first time with two of my friends and we were all pleasantly surprised with how cute and cosy this place is. Great food, nice top 40 music and great prices which made it perfect for a low key Friday night in the hood. We ordered 5 different kind of tacos, the bibimbap bowl and the Ace Ventura hot seafood soup. Everything tasted delicious but the fish tacos were a fave for all of us, they were huge and full of flavor. We are definitely coming back. We saw groups of people in other tables with bottles of wine and we will remember to bring one next time.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GUzwywcjtryAkBAQMRxNyQ/348s.jpg", "caption": "Fish taco"}]}}, {"review": {"des": "I was torn about my rating here. I say maybe 3.5 stars if i could. The food was good but not great. The fries and wings were served piping hot and were good portions. I liked the wings the most. The tacos were just ok. They were kind of missing something . If i went back i would skip the tacos and try to bimbibop bowls as other reviewers seemed to like them<br>But the place is clean, easy, good prices and byob. <br>The owner (I'm assuming) or whoever was working there was so very nice which made me want to support them <br>If i was in the area i would probably try them again but not sure i would go out of my way since i don't like in the neighborhood", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4_yGS8r1Ljy-Or1MlNWJyA/348s.jpg", "caption": "Tacos.. chicken and fish . Fish was great! Chicken was pretty dry"}]}}, {"review": {"des": "Il be generous on the review because I appreciated this place. It was easy, nice people, BYOB, and decent food. I can note some of what I wasn't crazy about, but I left saying I'd likely return (especially living nearby).<br><br>It was Friday at peak dinner, and not many people were in there. Its a nice atmosphere, clean, trendy-ish. But small. Most people just were coming for takeout. Strangely being one of the only groups there, we got a whole bunch of food and tried it all. With some beers of course. <br><br>I had just ran about 15 miles, I was ready to crush. Got the chicken bowl. This was the best dish. Great flavor and the rice at the bottom was crispy and amazing. Don't skip this. The fries were good also, with a great dipping aioli sauce. I was in feast mode. The final winner were the shrimp tacos. Meaty, and the shrimp was a perfect light fried crunch.<br><br>Fish tacos were solid, flavor wasn't exactly on point but a large portion of fish made it worth it. The Wings were sort of a miss. They were large but the sauce tasted funky, and could have had more of a crisp. <br><br>The net-net here is that you try a bunch of items and see for yourself, bring some brews, and have a quick hitter meal.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EFpH-w3xDlVcTgzaazJz9g/348s.jpg", "caption": "Dark wings, chicken bowl, fish tacos"}]}}, {"review": {"des": "Loved the vegan flautas and vegetarian kimchi fries! It's so hard to find vegetarian Mexican or vegetarian Korean food, and I got both at the same time! Would definitely come back.", "pics": null}}, {"review": {"des": "I came to this place because of the reviews and it did not disappoint. I had the Kalbi Bibimbop which was delicious and served perfectly hot. The owners were very friendly. Definitely would return next time I come back, great place!", "pics": null}}, {"review": {"des": "Such an amazing idea to combine tacos and Korean. I don't do spicy but got the Go Fish and Korean BBQ Pork.  Both were soooo delicious.  Also got a side of French fries which were good. This was my first time in Chicago... I was going to Second City so Yelped places near there and decided on this.  Couldn't have been happier with my choice.  It's also BYOB which is nice!", "pics": null}}, {"review": {"des": "Loved this casual sit down spot. Would definitely come back here. Great options on the menu for good prices and nice people working there. Would skip the fried chicken. Bibimbop bowl with shrimp was awesome but could have used 1-2 more shrimp in it. It's byob too so can't go wrong there.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/c9zgNof0Xkqu_vzgcTSxyg/168s.jpg", "caption": "Bibimbop shrimp"}]}}, {"review": {"des": "One word: AMAZING! <br><br>We stopped in on a whim and got a couple recommendations from the owner.<br><br>The Esta Camaron taco has Korean Aioli and sesame seeds - and I'll for sure crave it for awhile. <br><br>Can't recommend this place enough!", "pics": null}}, {"review": {"des": "Loved this place!   After skipping over the food at Ginza fest we came for some real food here: fusion Korean and Mexican food.  The tacos with Korean meats were really tasty. Then there were the Kimchi Fries, which are 2 meals in itself, so make sure that you share it!  On top of that the BBB with bulgogi was really filling, the bowl was hot and crisped the rice, keeping it steamy for the whole meal.   Refillable drinks (RC) kept us hydrated on a summer day.    The service was nice and extra friendly.   A new city favorite!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3S77JT_oEid2ALiPH4GCeg/168s.jpg", "caption": "Dinner"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PN2kusw_Idkdhvcr0WhwqQ/168s.jpg", "caption": "Kimchi"}]}}, {"review": {"des": "Tasty!<br><br>Stopped by this one awhile back, but all in all I'd say I'm probably a fan of anything and everything Korean / Mexican inspired. The menu consists of sandwiches (tortas), tacos, bibimbap bowls, some assorted shareables, and a few items for the kids.<br><br>While here we grabbed a few tacos and an order of the dak wings. All of the tacos we ordered we're pretty great but the vegan al pastor stuck out to me as the most interesting. Never had such a taco, but I thought it was delicious. The dak wings were great as well with a nice blend of sweet and spicy and sticky goodness. <br><br>Anyways, it's a pretty casual spot to grab food and also to note they are open late on Fridays & Saturdays (2am) and they are BYOB!<br><br>That's all I got on this one. 'Til next time, cheers!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jaEYHhqQBHjD3RK_C9kQ0w/348s.jpg", "caption": "Outside"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/B5uyY0zPzd8EFa9TvSlVlw/168s.jpg", "caption": "Dak wings. Yum!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bsdsBqNgRzlG6sxZoQMNRA/168s.jpg", "caption": "More tacos!"}]}}, {"review": {"des": "Wasn't sure what to expect, but after a long morning of looking at open houses, swung by for a quick lunch.<br><br>Pricing not the cheapest, but relatively expecte for teh area. You're looking at ~$4 tacos, ~$9 sandwiches, and $11 wings.<br><br>I treid the Dak Wings which were delicious...and sticky. Not bad, though the $11 price tag is a little steep, considering most people order these to share/for the table. As for the tacos, the tinga de pollo was surprisingly explosion-in-your mouth good, the forastero was awesome (Korean fusion at its best), and the KBBQ Pork was as expected.<br><br>Not bad overall, but food did take forever to come out.", "pics": null}}, {"review": {"des": "Ordered the Sesame Kalbi taco and the Korean BBQ Pork taco. I wasn't a huge fan of the other tacos since I don't like sea food that much. The Kalbi was marinated short rib, the taco was filled with greens and onions. It's spicy, so keep that in mind if you can't eat spicy - there's no warning on the menu! The pork taco also had a lot of greens, but had a sesame sauce. The tacos were packed with so many greens that I couldn't even pick up the taco without spilling, so I had so eat part of it before I could pick it up and take bites out of it. I wasn't super hungry that day so I only ordered those two, but I would want to return and try the kimchi fries and the bulgogi sandwich!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uTCHkfklDNKg2kg6wyIG2A/168s.jpg", "caption": "Korean BBQ pork and Sesame Kalbi tacos"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KRv1eBecRFuyBNt0fb5-xw/168s.jpg", "caption": "Interior"}]}}, {"review": {"des": "Another great Korean-Mexican fusion spot. I noticed a lot of people order take out from here so there's no shortage of tables inside and no rush to finish your meal. <br><br>I tried a couple of items off their menu. Tacos are $3.50 each pre-tax and small in size but packed with meat and flavor. Everything came out fresh and piping hot. Their Dak wings are unique in that the pomegranate molasses lends a sweet and very potent sour flavor. The wings are very sticky and very messy to eat. I personally was not a huge fan of the sourness of the wings but thought it was cool to try a different take on this classic dish. <br><br>Staff here is excellent, an extremely considerate bunch.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RjiASmYhIFovzTsSCem6sA/168s.jpg", "caption": "Porky pig taco, Forastero taco"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nQysOArjjYCqbau0ZszwMg/168s.jpg", "caption": "Dak Wings"}]}}, {"review": {"des": "TACO TUESDAY--the best in town--unbelievable <br>frijoles y arroz incredible smoked beans--and BYOB", "pics": null}}, {"review": {"des": "Not really to impress with this place. I've been to a lot of fusion spot and like the others, there isn't too anything too unique about it. Not all of the flavorings match well with one another. We literally ordered a boat load of food items on the menu so I was able to try a bit of everything. <br>What I did appreciate is the nice portion of meat on the tacos. Now that was very generous! When you are eating the tacos and the meat is falling off, you know they hooked it up the the portions. My boyfriend enjoyed the soup but compared to the traditional chigae it was just ok. I wouldn't go out of my way to try it out because you probably get the similar concept better at del Seoul.", "pics": null}}, {"review": {"des": "I really liked it here and will go back to check out some other dishes. This place is on north ave west of Sedgwick station and I always pass by but never noticed it. It sort of blends in with the dry cleaner next door. A sidewalk sign would really help! There was probably 10 other people in there with us and it's a pretty small place but the food didn't take long.  My fish taco was huge but the others were more normal size but they still were overflowing with ingredients. We also got the dak wings which were good but interesting, almost like a blueberryish plum sauce. We spent about $20 for 3 tacos and 8 wings. Very reasonably priced and its also BYOB.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eUM7tMAK75CLZlDvsKF-oA/348s.jpg", "caption": "Wings"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Q73GJHeHfz0nNHFhapvrdQ/168s.jpg", "caption": "Go fish taco"}]}}, {"review": {"des": "Great affordable place for fusion tacos. I recommend the Go Fish taco and the Porky Pig taco. Service is quick and friendly!<br>Also, BYOB which makes it even better.", "pics": null}}, {"review": {"des": "Went again to Forastero tonight and am always impressed by how friendly the staff is and how unique the menu is!! I had the bibimbop and the dak wings. Takeout is also really easy and convenient", "pics": null}}, {"review": {"des": "Excited to check out this Korean/Mexican fusion store. I have checked out this location twice and I thought it was more Korean than mexican. <br><br>The first time was on a rainy day so I opted for the Ace Ventura Hotpot. It is a spicy soup that reminds me of a pho but without veggies. I was disappointed in this dish to say the least. On the menu, it says and I quote 'Korean style spicy beef broth with mussels, clams, shrimp, oysters, topped with an egg with a side of kimchi and steamed rice. The soup came with one mussel, one shrimp (they got that part right in the description), zero egg, clams and oysters. It however had a lot of tofu in it which was weird as it was not in the description. I was back in my office by the time I noticed this and I felt it is due to ordering it to go. I certainly wont be ordering it again because it is certainly not worth the $13.29. <br><br>I decided to give it a second try and dinned in with a friend. We ordered the <br><br>Kimchi Fries 5/5 (orgasmic) <br>Dak Wings  4/5  (decent but not sure it was worth the price) <br>2 Go Fish Tacos  3/5 (More time was needed to season bcaz the fish was cut thick) <br><br>Everything was delicious, price was decent, customer service was great and I look forward to exploring their menu.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SBHnre-cV6gnSB7wsbQEIQ/348s.jpg", "caption": "Yours truly"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oE-X_F9jyF7khoo6-2kmMw/168s.jpg", "caption": "Dak wings"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/r6OtFGKVferrPYjTP6jCsA/168s.jpg", "caption": "Go Fish Taco"}]}}, {"review": {"des": "The bulgogi bibimbop was very authentic and absolutely delicious. The owner explained it was a true traditional recipe. They nailed it!<br>The kimchi fries were a bit too heavy for our tastes, but I can imagine they are perfect for a late night craving:). The sesame kalbi tacos had a generous about of protein and I'd definite suggest them.  We thought the wings needed a bit more \"punch\" and salt. <br>They seem to do decent numbers in take out/delivery. We hope more foot traffic finds this gem on North Ave, we will be ordering from them real soon!", "pics": null}}, {"review": {"des": "Korean fusion food is always a welcome meal for me. Wed night is K-wings night with a side of fries. The garlic aioli was delicious, you can smoother that sauce on anything and I'd eat it.  The korean fried chicken wings wasn't quite my style. I usually prefer a crispy, candy coating, but the sauce was on the stranger unpleasant side of fruit leather mixed with their bbq sauce. <br><br>Tacos are hard to mess up, not bad, they're all pretty good. The fish taco was extraordinary \"meaty\". I do prefer a flakier fish taco, but if you're hungry, 2 will satisfy the stomach. Great service and cute shop, if you're in the area, it's a good fast food stop.", "pics": null}}, {"review": {"des": "I'll tell you what, finding Forastero is a top five event of the year 2018.  I've worked my way around the menu, but for the first timers I strongly suggest the tacos.  My go-to is the Korean BBQ Pork.  The restaurant is clean, and the service is always fast and friendly.  Best spot in the neighborhood", "pics": null}}, {"review": {"des": "The El Camaron (shrimp) tacos are not to miss! As well as basically everything else on the menu. The Asian fusion is done expertly. The place is cozy and everyone super friendly. I am always craving Forastero tacos now and could honestly come here every day! Nice to have BYOB option too! Keep up the good work and delicious recipes :)", "pics": null}}, {"review": {"des": "Alright I want to like kimchi, but I just don't. I got the vegan loaded fries, which were good, but the kimchi wasn't for me. The vegan tofu tacos were ok. I think I just don't care for this fusion cuisine.", "pics": null}}, {"review": {"des": "Very pleased to discover this Korean-Mexican fusion gem in Old Town. The name \"Forastero\" intended to mean a nomadic wanderer sure got me wanting to return and visit again. Run by a pop and son, they provided great service and were very attentive to their customer's feedback. Without the frills, this casual restaurant has sirarcha and soy sauce bottles on every wooden table, bench chairs, self serviced utensil and small plastic cups for water.<br><br>Affordable, authentic and tasty flavors. I highly recommend trying the tacos and kimchi fries! I am obsessed with the spicy sesame sauce in the Esta Camaron/shrimp and Sesame Kalbi/Korean marinated beef tacos! The Kimchi fries are well seasoned with a mixture of pork belly slices, melted cheddar cheese, and kimchi. Very delicious and comforting. My only critique is the Dak wings are too sour from the pomegranate sauce and not enough sweet or spicy to balance out the salivary gland clenching sourness. I'm really excited to try the rest of their tacos and bibimbap next time!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_JidmbhnD1cv97duPoaIyw/348s.jpg", "caption": "Bulgogi bibimbap, esta camaron, tinga de pollo, and kiss."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TY4rwp_Mg8GnOSz3KEFHiw/168s.jpg", "caption": "Kiss."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5hwfiKsr-S2zGbODTr8Rtw/168s.jpg", "caption": "Porky pig."}]}}, {"review": {"des": "My husband and I finally got around to trying this place.  The food was amazing (we had the bulgogi bibimbop, the Big Bird taco, and the Esta Camaron [shrimp] taco).<br><br>The people who work here are SO FRIENDLY and ACCOMMODATING.   <br><br>And, they're open late on Friday and Saturday.  <br><br>We just scored a new place!  Yay!!", "pics": null}}, {"review": {"des": "Food is delish!!! Wish they had a non-beef broth soup option but that is literally my only complaint for this fast casual eatery. Plenty of Veg/Vegan options along with carnivore options. Love the Vegan Kim Chi Fries!!", "pics": null}}, {"review": {"des": "I absolutely love Forastero. The owner Tony (and I believe his wife) are always on site interacting with customers and making sure you are enjoying your meal.<br><br>From what I gathered about Tony, he has poured his blood, sweat, and tears into this business idea. And the hard work is evident in the taste of the food. Honestly the tacos are from another planet they are so good. I always order the Go Fish taco - a perfectly breaded Haddock fish taco. Then I order any of his pork, beef, meat containing tacos as well. They are all amazing so truly it does not matter what other tacos you get.<br><br>The Kimchi Fries are also the frigging bomb! Pork belly, spicy kimchi, green onions, sour cream. Perfect to share with a buddy or date. And the best aspect of all - Forastero is BYOB. I always tell my friends, I have no idea why I would eat anywhere else than BYOB spots. They usually have the most delicious and ethnic foods, and then they keep it affordable for recent college grads by allowing you to bring booze onto the premises. It is WIN - WIN for all.<br><br>The location is on North Ave in Old Town, off the beaten path just a little bit away from Wells St, so do not be fooled if you do not see a ton of people in the dining room. The only reason why there are not a ton of people in the dining room is because they have not yet tried Tony's masterful creations. <br><br>Come on into Forastero one time, and I guarantee Tony will lock you into being a faithful customer for the rest of your time in the city!", "pics": null}}, {"review": {"des": "This is one of those super endearing restaurants run by hardworking people who make solid, fresh, and delicious food. They are very new, so there are things I could pick on and critique. But you get a lot of value out of your money here and I can definitely see them working out the kinks as the business matures.<br><br>Food wise, my friends and I got the shrimp taco, fish taco, beef tongue taco, kalbi taco, and the DAK wings. These tacos were yuuuuge. I loved loved loved the beef tongue taco. However, I wouldn't mind more sauce or seasoning. We didn't love the DAK wings though. The glaze / sauce was just too acidic from having too much mustard. Pomegranate is an innovative idea but I think it was completely muted. Maybe I will try the kung-fu wings next time.<br><br>Essentially Forastero is the Mexican sibling of Del Seoul, except with bigger portions. The street it's on doesn't attract a lot of traffic, so I certainly am writing this to give it a well deserved shout-out.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rmSjFr5PKjBT2RWAEL1xuQ/348s.jpg", "caption": "beef tongue and kalbi - sorry you can't really tell what's in them; but they are good"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tMoxYi03f7HE17ek3wST3A/168s.jpg", "caption": "shrimp and fish tacos"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hoKEpwVzFxfEP6hnbPlT1Q/168s.jpg", "caption": "DAK wings"}]}}, {"review": {"des": "I love this restaurant! The food is delicious. The staff are kind and courteous. The price is affordable; It's about $3.50 - 4.50 for a taco with a very generous serving of toppings. The concept is fairly unique and interesting. The restaurant is clean. The location is convenient.<br><br>Make sure you try the Bulgogi Bibimbap and Esta Camaron taco. The Bibimbap has a ton of ingredients like pickled radishes, bean sprouts, carrots, spinach, zucchini, sauted mushrooms, fried runny egg, and choice of several meats, served over white rice, which browns and crisps perfectly against the hot clay pot it's served in. The Esta Camaron has fried shrimp and shredded lettuce drenched in a delicious sweet and spicy chipotle sauce. <br><br>If you dig the fried shrimp in the Esta Camaron, the same shrimp are served in the Shrimp Bibimbap.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uYRqLoEbV0cQW1y634icUA/348s.jpg", "caption": "Bibimbop Bulgogi"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IYzRUqdVptJV9ZKxCE4Pqg/168s.jpg", "caption": "Go Fish"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rPtlPwZUNkBwA0ul35Q24Q/168s.jpg", "caption": "Esta Camaron"}]}}, {"review": {"des": "If you're in need for that good fusion mix without the frills, Forastero is the place to go. My friends and I came here on a Friday night with six pack in hand. As we sat down, someone came immediately to our table with a bucket of ice without even having to ask, which was a nice touch for being a BYOB restaurant.<br> <br>We started the night with a couple tacos each. The reigning favorite, by far, was the Go Fish taco; there was a hint of spiciness with the batter coating the fish that made it very delicious. Some of the other tacos we ordered, i.e. sesame kalbi and tinga de pollo, were also good, though we felt didn't have the the unique/prominent flavors that the Go Fish taco offered.<br><br>The latter half of the night we made a solid attempt to share and finish an order of kimichi fries, Dak wings, and Kung Fu wings. It is fair enough to say this is more than enough food, without the tacos, for 3 people. The most surprisingly part of the meal had to be the Dak wings. The pomegranate glaze on the wings give it such an interesting flavor that I've not really ever had elsewhere and would highly recommend it. In comparison, the Kung Fu wings were good but didn't pack the kick or flavor we would have hoped a habanero/apricot sauce would have had. Finally, the kimchi fries were delicious. There is definitely a good amount of kimchi for the amount of fries you get. The fries themselves were seasoned well with just the right amount of crisp. <br><br>Pricing on the tacos is a bit more than other places but worth it for the uniqueness of Korean/Fusion mix you are getting here. The service is prompt and great. We will definitely be back for some more Go Fish tacos and Dak wings and hope to try their bibimbop bowls as well.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MDzpIm40EM9L9qE30GtWEw/348s.jpg", "caption": "Seasame kalbi and Go Fish tacos!"}]}}, {"review": {"des": "Great tacos and good prices. it's a little out of the way, not in the bustling Old Town district, but definitely worth finding on North Ave. Authentic food, high quality, good prices- what's not to like?", "pics": null}}, {"review": {"des": "I loved this place. One of my friends who used to live in that area recommended the place. When we walked in one of the workers recognized her and said you haven't been here in awhile! I thought that was nice. I believe she said she was the daughter of the owner, this is a family owned business. When we realized it was byob and we didn't want to take an Uber to get alcohol she offered to get it for us and we showed her our id's. That was amazing. Then I bit into the tacos I ordered, one was shrimp the other fish. Amazing! I inhaled and had to have another shrimp one. Such an amazing burst of flavors! I will definitely be back!", "pics": null}}, {"review": {"des": "The food here was good. I like their little fusion that they have. Korean and Mexican its a matchmaker in heaven. The difference in the spices makes it all worth the try. The place is like a little hole on the wall. The service was fast and the people that go there are nice. Prices are pretty average and don't hurt your pocket. The servings were just right. I like their pork selection best. Definitely need a little bit more juice on their sauces.", "pics": null}}, {"review": {"des": "I love this place! Their fish tacos are my favorite. Not only are they huge, they also have just enough spice to keep things interesting. And their staff are so sweet!", "pics": null}}, {"review": {"des": "The Bulgogi Bibimbop and the Go Fish Tacos are my favorite. Awesome BYOB joint run by a nice, local, small family. <br><br>Could not recommend this place more! They have awesome daily specials and the kimchi fries are fantastic, great for sharing.", "pics": null}}, {"review": {"des": "Forastero means stranger but I won't be a stranger here. Family owned, pride and care in preparation and service, and flavorful food. <br><br>My number one recommendation is the Bibimbop because it is prepared in a stone bowl so that the rice gets crispy at the bottom. This is the authentic Korean way but hard to find in Chicago. <br><br>I also liked the tacos a lot. I had the chicken but plan to return every day to try new one. <br><br>The sandwich was tasty and I loved the pickled radish but had too much bread in my opinion. Tasted like a bahn mi sandwich. <br><br>Don't be a stranger to Forastero.", "pics": null}}, {"review": {"des": "I'll admit, I was kinda bummed when this place replaced the great sushi restaurant that was in this spot. BUT I am no longer disappointed! <br><br>I've only been here, during the day, for lunch. But I've walked past it at night, and the place looks pretty hopping! During the day though, it's pretty empty, and I am personally a fan of that. <br><br>First of all, get the fries. Their fries are the best ever. And the korean wings are amazing. These two things, alone, are so damn good that I've never been able to bring myself to order anything else. So, I can't really attest to anything else but the amazing fries and wings. But the price is right, I'll be back again and again and again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2r0hBRWrD-QW7jWODg_f9w/348s.jpg", "caption": "Dak Wings and Fries"}]}}, {"review": {"des": "Strolling down North Avenue and wondering what I was going to eat later. I happened to see the sign and crossed the street to check it out.<br><br>I saw that it was an Asian and Mexican fusion restaurant. Seemed to be more of a carry out place. While I was looking at the menu in the window, a gentleman stepped out and handed me one. <br><br>I decided to give it a try. I ordered the bulgogi sandwich without the jalapeño peppers. I'm not a fan of really spicy food. The price seemed a bit high for a take out sandwich without any sides. That being said the sandwich was delicious. The meet was perfectly cooked. The vegetables were nice and crispy. The bread was not overwhelming. I thoroughly enjoyed the sandwich. I will return. Maybe try a rice bowl?", "pics": null}}, {"review": {"des": "You must try this place! It can easily be missed because of the location, but it shouldn't be. It's only a few blocks from North Ave beach and old town.<br><br>We ordered a bunch of different things so that we could try everything. I had the shrimp taco, two different wings and a bibimbop. <br><br>The wings were delicious! If you can't stand any heat, you may want to stay away from these. I love spicy and I thought these had amazing flavors. I think one of them had a pomegranate molasses on it and the other one was habanero. I would go back just have order these two things. <br><br>The taco was great quality with lots of protein in there.<br><br>The bibimbop bowl was very unique. I had never had one before so I didn't know what to expect. It was sizzling when it came out and it had a fried egg on top, meat under that, then veggies and then rice on the bottom. My brother had tried it before so he mixed the whole bowl up to mix the flavors. Being middle eastern, I was obsessed with the crunchy rice on the bottom of the bowl! Everything about this bowl was perfection.<br><br>Will be back soon!", "pics": null}}, {"review": {"des": "Loved the forastero taco, the crunchy jicama complemented the taco really well, the pork is also very juicy<br><br>The dak wings are great! All drumsticks, and spicy sauce! It tastes a bit overcooked though<br><br>The bulgogi sandwich is awesome too! it's a bit like those Vietnamese buns, but with hot meat and more flavor<br><br>Great portion too!", "pics": null}}, {"review": {"des": "It's good I liked their fish tacos. Their wings were too spicy for me to truly enjoy it. It's family friendly and affordable eats. It's a cross between Korean and Mexican cuisine. I say try it it's worth it.", "pics": null}}, {"review": {"des": "Forastero is truly a hidden gem. Just a few blocks away from the heart of the Old Town bar and restaurant strip on Wells, Forastero is not to be missed. <br><br>I went with my family and I'm glad I went with a larger group, because we got to try a whole variety of menu items and we loved them all. Here's what we had:<br><br>Dak Wings<br>Kung-Fu Wings<br>Go Fish Taco<br>Esta Cameron Taco<br>Sesame Kalbi Taco<br>Bulgogi Sandwich<br>Bulgogi Bibimbop<br><br>I'm not lying, each one was equally delicious. The real standouts for me were the wings, hard to pick which one I liked best. The Dak wings are a sweet, sourish, tangy flavor unlike anything I've had on wings, but I was literally licking my fingers after, they were so good. On the flip side, the Kung-Fu wings had a good burn to them and a different flavor all together. Honestly, I almost feel like you need to get both and they balance each other out. <br><br>The Sesame Kalbi taco was definitely my favorite taco, quality meat, seasoned perfectly and topped with great flavorful garnish. I'm glad we got a rice bibimbop, it's a bowl filled with rice getting crispier by the minute, mushrooms, carrots, whatever meat you want and topped off with a fried egg. Yumminess in a bowl. <br><br>Overall, my entire family loved it and it's BYOB, so that's a giant plus too. Forastero is up there now with Big and Little's for me. Not to be missed!", "pics": null}}, {"review": {"des": "My cohorts and I were catching a show at the Park West and decided to give this place a go. Nourishment was needed before listening to the twilight tones of Sarah Cracknell and St. Etienne. <br><br>This was a great place for me (a carnivore) and my pescatarian pals. There is something on the menu for everyone... unless you don't like tacos or Korean food in which case... BYE. Forastero is BYOB. Perfect for getting your drink on a little before a show. <br><br>Our taco order consisted of fish, vegan al pastor, shrimp, kalbi and gochuchang pork. Obviously I had the kalbi and the pork...but also a fish taco. You know what? The fish taco was probably my favorite of the three I had. It was perfectly cooked, nice crispy batter and the slaw, onion and aioli were nice accompaniments. I could have just eaten fish tacos and been happy. Of the two meat options I had, I preferred the pork. The pescatarians were split with one liking the fish best and the other digging the vegan al pastor. <br><br>We also got two orders of fries, which was too much. What can I say? Our eyes were bigger than our bellies. We got an order of regular fries with garlic aioli (delicious) and the kimchi fries (OF COURSE). We requested the kimchi fries without pork belly and the dude at the counter had to inquire on whether this was possible b/c apparently the pork belly is mixed in with the kimchi? Luckily they were able to accommodate BUT unfortunately, they used a kimchi that was not house made. The kimchi wasn't bad but it wasn't very spicy so that was disappointing. I also wished the melted cheese was actually cheese SAUCE.  <br><br>The staff was very friendly and inquired how our meal was. I got the sense they were fairly new and were wanting feedback. They did apologize that the kimchi was not spicy and assured us that they were working on a non pork version to accommodate vegetarians. But if you are reading this Forastero peeps: CHEESE SAUCE. PLEASE! I say this with love because I enjoyed your offerings and would like to see you succeed. #koreanlove", "pics": null}}, {"review": {"des": "This place is amazing!! Their food is delicious. You definitely won't be disappointed. The owner is also the sweetest man ever. I went with a friend and we ordered the ship and let's just say it was the sh*t. I mean that in the greatest way possible. My taste buds have never been happier. And the wings were just as good.", "pics": null}}, {"review": {"des": "Ok, in an area of Old Town where not a lot of places are reasonably priced AND have great food Forastero is my saving grace. Right by my home, open late, cheap food and really quality, I love it. My hands down favorite is the bbq taco, its all I get and its boss. BYOB with no cork fee, plus over all just very accommodating with offering cups and bottle openers when you order. It's low key and laid back, its a weird cultural food mash up, but damn its good.", "pics": null}}, {"review": {"des": "Why does Del Seoul get all the love? Sure, the atmosphere may not be as hoppin, or the location as prime, but the tacos at Forastero are just as good--even thiccer. Lovely people, too. Quit wasting your time with the (mostly) mediocre restaurants on Wells. Go here instead.", "pics": null}}, {"review": {"des": "Casual counter serve spot that's also BYOB! The bibimbop is amazing here - great toppings and amazing crispy rice - we also tried the wings which were super crispy with a tasty spicy sweet marinade. Highly recommend for a casual date night out.", "pics": null}}, {"review": {"des": "Think the tacos were just okay... it's marketed as Korean fusion tacos. My husband and I were in the area and this place had amazing reviews. Although we were stuffed from dinner we wanted to stop in to try it out.<br><br>We got two tacos, one pork and one kalbi. I forgot the names of the tacos. I think if they were advertised as tacos they would be fine, but since I was expecting a Korean flair, it definitely did not meet expectations on that end. I think the tacos are on the small side too. This is just my opinion, but seems like a lot of other people love this place!", "pics": null}}, {"review": {"des": "We ordered all the tacos and did not like most of them. The wings were too salty. Very dry and overpriced, so we left a bit disappointed because this place is close to home.", "pics": null}}, {"review": {"des": "My wife and I, along with a friend from DC, stopped here for lunch today.  We had the Go Fish, shrimp, and pulled chicken tacos. The food was delicious and this is my new favorite taco place in Chicago. The owners and staff are tremendously nice and the restaurant brightens up one of the otherwise more desolate stretches of North.  It would be great to see them succeed here, so please stop by and give them a try.", "pics": null}}, {"review": {"des": "I stopped by here before a Second City show with a handful of friends. It's a wonderfully clean, modern space with average/decent food at a very reasonable price with lovely service.<br><br>I ordered green tea ($2) and the shrimp bibimbop bowl ($12:50). The owner, who was also there, was super lovely and sent over a side of fries which were crispy, hot & accompanied with the garlic aioli. The shrimp bibimbop was a generous portion with a lot of rice and a side of gochujang, but the amount of meat and vegetables were very small in comparison to the rice.<br><br>Decent place to stop by and grab dinner if you're in the area! It's also BYOB which is a great plus.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6DD39EQ4E7SQS6DjOFkiGA/168s.jpg", "caption": "French Fries and Garlic Aioli"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xJDrIbre80rHexWWCP4dRw/168s.jpg", "caption": "Shrimp Bibimbap"}]}}, {"review": {"des": "Overall: 3.5/5 so rounding up to a 4/5. This place is good but not amazing. Tacos meat was a litttleee bit dry. Tacos came out pretty fast and were very reasonably priced.", "pics": null}}, {"review": {"des": "Tried the Está Camarón taco and loved it! My boyfriend also ordered The Ship sandwich with shrimp and loved it too. The sauce used on the taco and sandwich was so good. You feel a small kick to it but not super spicy. <br><br>The place is BYOB and has friendly staff. It's a bit hidden off of North Ave. My boyfriend and I stopped by after walking by. We've had Seoul Taco before (another Korean/Mexican fusion restaurant in River North) so we were excited to give this a try and honestly loved the flavors and food options here more.<br><br>We've also had the kimchi fries there which were great. Good spot to stop by for a quick bite, eating with friends, or for take out. Definitely recommend!", "pics": null}}, {"review": {"des": "Our neighborhood favorite. My wife and I are Korean, and my wife has lived as a \"foodie\" for 30 plus years in Korea. We also love Mexican food and has been to Mexico multiple times. We love their Kimchi Fries first of all. It's got the right amount of spiciness and I have no idea how they get this perfectly fermented kimchi without the authentic fermented fish smell. Kimchi/bacon combination is like mac and cheese combo. It can never go wrong.<br><br>My wife absolutely loves Esta Camaron (shrimp, not Korean) and Forastero (spicy pork ?fusion) tacos and I also love Korean style kalbi (beef) and bbq pork tacos. Conchinita pibil was a bit dry but I thought it was also slightly dry in Yucatan. <br><br>Last but not the least, the owner couple is just so nice. So kind. <br><br>It's BYOB. Affordable. Definitely better than other so called Korean taco places.", "pics": null}}, {"review": {"des": "I love Korean Mexican fusion, and Forastero does it so well! <br><br>It's a super cute, family owned business with delicious food and reasonable prices.  My husband got the Go Fish and the Big Bird taco. The Go Fish fish portion is huge  and he really enjoyed it. I had the Sesame Kalbi and a the Big Bird taco.  We shared a side of French fries with garlic aioli. So good! <br><br>On top of the quality food, it's a nice family who runs the joint. Always a plus as I love supporting local business. Definitely will be back to try more, and would recommend you try it, too. :)", "pics": null}}, {"review": {"des": "Amazing!! Great byob spot- small and cozy with great food. I highly suggest the shrimp tacos and kimchi fries. Definitely my new favorite byob spot!", "pics": null}}, {"review": {"des": "Delicious. This place has amazing Korean Mexican fusion items at a very reasonable price. AND they are byob - what more do you want in a restaurant? I went with my friend on a Friday and got the tacos and bibimbap bowel and kimchi vegetarian fries and everything was delicious. Can't recommend enough.", "pics": null}}, {"review": {"des": "Visited Forastero last weekend with a few friends, we loved that it was a BYOB spot. We all ordered different tacos. I had the sesame kalbi, beef tongue (KISS), forastero, and tinga. I'm very particular about texture but I will say the tinga was quite good and I would order again. My only feedback is that I wish the tortillas were warmer, or fried/even homemade. By the time our food reached us theh were a little cold. It doesn't overshadow the quality and flavor of the meat though! This is a great spot to hang with friends and the servers/everyone was very friendly and welcoming.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_peXDO8tJTUIUMDruvOlBg/168s.jpg", "caption": "Forastero and Tinga"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iASrTGyYzqXouyW6DMvJGg/168s.jpg", "caption": "The new face of Forastero"}]}}, {"review": {"des": "I am visiting from San Francisco and I love this place. I don't write a lot of reviews but I felt this place happened to be momentarily less popping than the food deserves. The food is fantastic and the staff is friendly and helpful. Great place for casual eats. I wish this place were in my neighborhood in SF.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tORQE9zjDfVWZwl1VQ3fyA/348s.jpg", "caption": "That was tasty I ate it too fast before I took a picture lol"}]}}, {"review": {"des": "Awesome tacos!   The things that these guys do with pork!<br><br>We all had different tacos and they were all great. Kimchi fries are great as well", "pics": null}}, {"review": {"des": "I'm a sucker for mom and pop fast casual restaurants with great food. Forestero fits that mold. The Mexican Korean menu options are just enough from that you make your own taco meal or sandwiches or bibimbop rice platters. You can order with the cashier, grab a seat and then they bring the food out once prepared.<br><br>We tried the following:<br>- Dak wings - the 8 chicken wings were dressed with such a unique flavor of sweet/tart with pomegranate sauce savored up with ginger and other ingredients. It was not spicy but it was super finger licking good...i kept picking at the residual sauce that was in the basket.<br>- big fish taco - I would get this again. It was battered big piece of fish in a flour tortilla. It won us over more than the...<br>- sesame kalbi- short rib was fine but i was not blown away by it. Came with corn tortilla. <br>- the Ace Ventura is essentially a super spicy soup stew with seafood. We were warned when we ordered that it was spicy but we underestimated by a long shot. It was borderline uncomfortable to consume because it was piping hot and super sinus clearing spicy. I kept think how my stomach would feel in the morning. We did finish it as it got cooler. I wish they would just turn this into a soondubu which we would have enjoyed more. <br><br>All in all it was maybe $35ish for 2 people. It a small space with big heart. Looking forward to trying the sandwiched and the habernero wings next time.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/A3q2t7syMorXLCtkVf6-6g/348s.jpg", "caption": "Big fish was awesome taco"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xw6qN4bdGHRCt-krqIoyIw/168s.jpg", "caption": "Kabila tacos"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NPoCUyKApsOolKmGQM4SWw/168s.jpg", "caption": "Dak wings- finger licking good. Unique flavor"}]}}, {"review": {"des": "Obsessed with this restaurant! Incredibly kind and friendly staff. I love that it is family owned and on the smaller scale. Fish and shrimp tacos are to die for. Giant portion of fish with tasty breading. Shrimp tacos are perfectly crispy and have awesome flavor. Vegan Al Pastor Taco was giant and incredibly filling. Loved the Forastero Mix as well that we added our BYOB tequila to. Will be coming here often! Try them out!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tGPNqy-sxwsDCVC1F23n3w/348s.jpg", "caption": "Authentic Rice Pudding"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NgpxAdmal-FWvmqlM8TgUQ/168s.jpg", "caption": "Go Fish and Esta Camaron Tacos"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/azIBaAKSe36rZC7_QOAueg/168s.jpg", "caption": "VEGAN kimchi fries!"}]}}, {"review": {"des": "So, I've ordered delivery(Food is nicely packaged and received well) from this place about 3 times within the last 2 weeks and here is my take:<br><br>Kalbi taco- 3/5. Needs longer marination, seasoning or something to make the flavor have more of a punch.<br><br>Shrimp taco- 5/5. Fantastic. Panko breading is not too too thick. The shrimp are large. <br><br>Go Fish taco- 4.5/5. Great. Large piece of fish and the breading does not over power<br><br>Kung fu wings - 2.5/5 - They said crispy. Nothing about these were crispy. Maybe bc it was delivery? I dunno. I watched my uber eats driver(yes I stalk my food delivery yelling \"don't turn there! No! Here!\" Lol) and it didnt take that long for him to get to me, So I think there should have still been a little crunch. These were very drab with only the slightest apricot habanero flavor on the limp exterior. Needs some serious kick and crunch to improve.<br><br>Ship sandwich - 4/5 - this sandwich was almost perfect. Nice fresh veggies, Same great panko crusted shrimp and a delightful sauce. While the sourdough bread is tasty and soft, I don't love it's application here. There seems to be too much bread. It's a tad tough to rip through and the insides of the sandwich slip n slide out all over. I eventually just deconstructed it towards the end. Seems like this sandwich would thrive with more of a bao bun type of situation to house the innards. Yet and still, it's definitely a tasty sandwich. <br><br>This place seems to have a lot of potential. I know it's in the early stages, so i'll give it time to work the kinks out. Pretty sure i'll continue as a customer, though. You should definitely try for yourselves too!", "pics": null}}, {"review": {"des": "This place has bomb ass great tacos! Shrimp, fish, bulogi all on point and the rice and beans off the chain tasty! Do yourself a favor and go here! Owner or person working was really nice too.", "pics": null}}, {"review": {"des": "A friend invited me to this restaurant and I did not know what to expect. What a pleasant surprise!!! The restaurant looks awesome, the food is amazing, the prices are excellent and the service was over the top. Thank you for giving us a great experience! I will be back at your restaurant for sure.", "pics": null}}, {"review": {"des": "Food is delicious. Tacos were great portions and flavor was on point. highly recommend.", "pics": null}}, {"review": {"des": "Interesting enough concept in a decent location (right next to the Sedgwick brown line) with decent tasting food.<br><br>The service was pleasant and speedy. We ordered fries to start. They came with some interesting seasoning on top with some kind of aioli on the side. They were probably the highlight of the meal.<br><br>I order one of the vegan al pastor tacos and two of the fried cod tacos. First of all, the cod tacos are ENORMOUS. This was way too much food. Usually, I need 3 tacos to be full but I would say this was about as much food as you would get in 4-5 tacos. The cod tacos were definitely tasty though, albeit a little on the spicy side.<br><br>The vegan al pastor, on the other hand, was not good. It seems like it was made by someone who's never cooked tofu in their life. It was so soft and tasteless that I felt as though I were eating small bits of chopped rubber shoes with some red spicy sauce on top. I love the concept, however. Once you the tofu is cooked correctly it will definitely be amazing. I've been saying forever that someone needs to make a vegan al pastor taco.<br><br>All in all, decent food but there was nothing that I had that would bring me back:", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/48-nDRB4qYVr-vAYe3du8w/168s.jpg", "caption": "Cod tacos"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Q7TU4nUiax3vwlqp5ssiYg/168s.jpg", "caption": "Vegan al pastor taco"}]}}, {"review": {"des": "Cheap, delicious, and on Uber Eats! What more can I ask for??? My husband and I wanted to bundle up at home, but also had nothing (literally nothing) in the fridge, so we looked up restaurants with good Yelp reviews. And this came up! So glad it did! Tacos were great (especially the shrimp ones) and both the kimchi and regular fries with garlic aoli (which was only $4) were amazing. We will definitely be ordering this again!", "pics": null}}, {"review": {"des": "Resturat  <br>Owes happy to come and eat here but the owners make you feel welcome when you come back for more", "pics": null}}, {"review": {"des": "This is probably my favorite steakhouse in town. If you're going to splurge, this is the place to do it.<br><br>Yo this food is freaking amazing. Delicious is an understatement. Kimchi fries are my life now. I am become pork belly. God is glorious for putting this place around the corner from me.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dCdFKEoaYX0r1yMNzCP9xA/168s.jpg", "caption": "Kimchi fries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QkO9ANHmB1pwnK4AGIrG9g/168s.jpg", "caption": "Tacos"}]}}, {"review": {"des": "Very good fresh food! Great tacos and Rice bowls. Service was pleasant. My only complaint was that it was taco Tuesday and they ran out of rice and beans so I couldn't get the special that was advertised. So I got the tacos which was filling enough.", "pics": null}}, {"review": {"des": "Stopped by as a group of five Wednesday evening before going to a show at Zanies. The space was on the small side, but still had a good amount of seating. The place was pretty busy when we arrived. You order at the counter and then they bring out your food. Service was pretty good. Everyone was very nice.<br><br>I got the ace ventura hot pot and a big bird taco. The hot pot while satisfying enough was more on the average side, especially compared to the tacos. I tried some other tacos and all were very good. The meats were flavorful and had a great char flavor to them. The rest of the toppings made for well balanced flavors. Also, the portions were on the generous side. Each taco was pretty big and filled. They got our order on the fries wrong, so we ended up with garlic aioli fries instead of the kimchi ones, but no biggie. The fries were pretty good, but not the best. The garlic aioli was a bit lacking.<br><br>Overall, the tacos alone warrant a return, and I definitely will keep this place in mind, as these Korean fusion tacos are much more memorable to me than other places. I enjoyed the comfortable casual atmosphere, as we got to enjoy good food while catching up with each other.", "pics": null}}, {"review": {"des": "Just opened right by my office. The food is solid, made quickly, and friendly service. I look forward to eating here more in the future. I went during the week they opened twice. I ordered the tacos the first time and the bibimbop the second. I liked both very much!", "pics": null}}, {"review": {"des": "This. Place. Goes. Off. Do yourself a favor and get the tacos. I've had multiple things on the menu but after five different ones I know for certain it's the best way to go. Make sure to get the house taco. Awesome place. GIVE THEM YOUR MONEY!!!", "pics": null}}, {"review": {"des": "Mexican-Korean fusion. BYOB. interesting combo! I had the Ace Ventura hot pot. Delicious and spicy seafood broth with rice and kimchi. I overheard the owner telling a couple that he had recently moved here from Mexico City.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gZfKOLjXp2brJRh4cvQTQA/348s.jpg", "caption": "Ace Ventura seafood spicy dish"}]}}, {"review": {"des": "Was in the mood for Korean food , was in old town, and walked into Forastero and thank god I did. Food is incredible... this is some of the best Korean food I've ever had , bibimbap , tacos , wings and the most incredible bowl of soup called, ACE VENTURA hot pot !! I've eaten at some of the most authentic Korean restaurants in the city and this soup might be some of the best around. The food is cooked to order .. everything comes out incredibly fresh and hot !!!  Had a chance to meet the owner ... Tony , thank you, thank you , thank you !! When food is cooked from the soul .. it shows !! This place is a step above the rest !!  Of course it's byob as my journey continues to eat at every byob in the city !!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hfTJHu_-95up3HVz70t_Zw/168s.jpg", "caption": "Wings ... simply delicious"}]}}, {"review": {"des": "I'm half Korean and half Mexican, so I was very interested in trying this place out. We ordered the Dak wings, the Korean BBQ sandwich, a sesame kalbi taco and a big bird taco (see photos). The Dak wings were SOOO sweet (like, toothache sweet). We couldn't finish them. The meat in the tacos lacked flavor and were on the dry side. The only decent food item we had was the Korean BBQ sandwich (which could have used more cilantro or maybe some green onion). I'm not going to write the place off yet, but I'm also not in a hurry to go back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/n9UpAjZqeBlg9xgluuJXaQ/348s.jpg", "caption": "Dak Wings $11"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/e-C3BTAtuFICBjtf1UfAsA/168s.jpg", "caption": "Sesame Kalbi and Big Bird Taco $3.50 each"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3x1wltzcqW8E_csMDN202w/168s.jpg", "caption": "Korea BBQ Sandwich $8.25"}]}}, {"review": {"des": "BYOB with killer hot Jumbo Kung Fu wings<br>Apricot w/Habanero.  Hot rice pot w/fried egg. Taco Shrimp. My recommendations <br><br>Family style friendly and VERY reasonably priced for such fresh product. <br>Try it!!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/U2_Q0UO5WBJn_jbIOYqiZg/348s.jpg", "caption": "Multiple flavors with different sauces for each ingredient."}]}}, {"review": {"des": "I work right next door at the dental office, Chicago Smile Design. My co-workers and I have gone to Forastero a bunch of times and we love it! We continue to come back on our lunch breaks weekly. The food is fresh and made in a timely manner and a creative twist on korean food. I have had the Bibimbop, sandwhiches, and have tried almost all of the tacos and have not been disappointed. Definitely recommend this place to everyone in Chicago!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LQfRDQs1enfe6JCgwdO2qw/348s.jpg", "caption": "Bibimbop!! Yum"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dvCE6AGffmRvDGZy_P9JGw/168s.jpg", "caption": "Bibimbop with no rice and kalbi beef"}]}}, {"review": {"des": "This place is one of the best restaurants in the old town area. The food is mind boggling! Tastes that are out of this world. Having said that, they have only gotten my phone in orders correct 66% of the time. I even have them read back the order and give me a total. Tonight was the last straw. I walked in, pressed for time, and they had no record of my order. I even gave them 25 minutes for something that they said was going to take 15 minutes.<br>Guys, you blew it.<br>It was good while it lasted, but I'm just not interested in getting aggravated anymore.<br>Good luck in the future.", "pics": null}}, {"review": {"des": "What a great little unique find! If you're looking for flavorful options you should really try Forastero (Mexican-Korean).Their menu has many options for those who are scared of spice as well as those who love that extra kick. Vegans and vegetarians will enjoy knowing that the owner has you in mind too w/ vegan toppings like vegan sour cream to compliment those menu items. We enjoyed tacos, vegetarian kimchi fries, and bibimbop...all are flavors worth repeating! You'll feel good about supporting this family business but mostly will enjoy all they have to offer. BYOB is also a bonus!", "pics": null}}, {"review": {"des": "Came here for lunch, split everything between 3 people. All the following was $35 with tax. Incredible value for the quality and quantity of food. Small menu, but everything sounded good and tasted even better! All the pickled veggies were fresh, marinated meats were sweet and tender. I liked the balance of Mexican and Korean in every dish. Here is everything we ordered, ranked by tastiness. We devoured it all!<br><br>5 star- Bulgogi sandwich- made banh mi style. <br>5 star- Sesame Kalbi taco<br>5 star- Dak wings- sweet and sticky, smoky flavor but not spicy. Next time I'll try the habanero wings. <br>4.5 star- Kimchi fries- kimchi could be stronger. The sour cream topping is a perfect touch. <br>3 star- Korean BBQ pork taco- the pork was drier, but we also ate this last so it cooled off too much. <br><br>We will definitely be back, and I will get the bulgogi sandwich again and try more tacos. This appears to be a family business. The owner was around and chatted with us. <br><br>I really hope they add dessert to the menu. Dulce de leche bingsu would be amazing!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cti19WXFXdYdhttKJFr9cQ/348s.jpg", "caption": "The Ship Sandwich"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PFPptgBNzxx6u3YBbF7M3A/168s.jpg", "caption": "Bulgogi Sandwich"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8q0kzKOW_1us0V95BWAwyQ/168s.jpg", "caption": "Bulgogi Sandwich"}]}}, {"review": {"des": "Just tried it since I live in the neighborhood. Keep in mind I ordered on the phone and picked it up.<br><br>I ordered The Ship sandwich and the Fries w/ Garlic Aoli.<br><br>Pros:<br><br>The sandwich was very well made. The shrimp was crunchy on the outside, moist on the inside and perfectly spiced. The bread is excellent as well.<br><br>Cons:<br>The fries themselves were fine. Crispy and seasoned with a nice garlic-y spice. Nothing special but decent. Sometimes places like this do fries as an afterthought but these were solid. However, the garlic aioli was watery and flavorless. Didn't resemble aoli at all. I threw it out and grabbed the ketchup. <br><br>I was also very disappointed with the portion size of the fries. It was a perfect amount to have as a side with the sandwich but with them being in the \"Two Share\" section with the wings and Kimchi Fries, and being $4, I was expecting more of them.<br><br>TLDR: I would recommend people check this place out. They have a great variety of food I'm still curious to try their other options (Tacos, wings, kimchi fries).", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QU3qX4jYMdW7khlSaC_kWw/168s.jpg", "caption": "The Ship"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PTtbKussJ_sAkKaB0AVx5w/168s.jpg", "caption": "Fries w/ Garlic Aoli"}]}}, {"review": {"des": "Really great little neighborhood spot.  My boyfriend got tacos and I got the bibimbap.  We got takeout and everything travelled well.  Both were fantastic and really flavorful.  It's super comparable to Del Seoul and it's equally as good. I'm really excited to try the kimchi fries next time!!! <br><br>It's in a pretty random spot on North, so I hope they do well here, but I will be a regular! The people that are running this place were really nice too and you can't beat good customer service. Yay for a new good restaurant close to home!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/z_G3OLMDwZDPCkZiJ0ZmUg/348s.jpg", "caption": "Take out shrimp tacos so good!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/y9csTEoBVDcxdfa3r1aTDw/168s.jpg", "caption": "Kimchi fries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Tpns5-RpgSwaFi9H4sNUHQ/168s.jpg", "caption": "Shrimp taco"}]}}, {"review": {"des": "Fantastic local gem! The tacos are excellent - you can't go wrong with the fish, pork or shrimp.<br><br>Prices are excellent, and incredibly reasonable. Wonderful place!", "pics": null}}, {"review": {"des": "Great little restaurant! Small but full of fun and people coming and going. Lots of carry out and s<br>A tables for in house. Wonderful combination of tastes with Asian and Mexican fusion food. Had the soup with the works in it, shrimp, chicken, veggies, fried runny egg, etc. if you're In the area, you have to stop in and try it!", "pics": null}}, {"review": {"des": "BYOB. Korean food. Tacos! Great food, the staff really welcomed us as a group. I had a bulgogi bimibop and it was my first taste of Korean cuisine and the crispy rice on the bottom of the bowl is a game changer! My friend had the kimchi fries and they are worth the visit alone.", "pics": null}}, {"review": {"des": "Awesome place with great food, friendly service, it's BYOB, and they are open late on the weekend. What more could you want? <br><br>I had the vegetarian Al Pastor Tacos and the Kimchi Fries. Both were excellently seasoned, and the taco was a real stand out. The seasoning they way they cooked it make it stand up to any Al Pastor taco, even the meat based ones. <br><br>My friend had the fish and the shrimp tacos, and those were excellent too with generous portions of protein in both of them. <br><br>The owner, Antonio, is a great dude and takes time to talk to greet his guests and check on everyone. <br><br>TL;DR deffinitely check this place out!", "pics": null}}, {"review": {"des": "The owners of this place understand customer service & food was amazing!!", "pics": null}}, {"review": {"des": "This mom and pop restaurant is fantastic. We came in as party of 9 and a baby. Half of the party was vegetarian and half wasn't. While the menu does have  a good variety of  vegetarian options, the owners were very accommodating to modifying non-veg items into vegetarian. The food, spice and overall customer service was outstanding. Get the kimchi fries...just do it! The fish tacos are also something I highly recommend! The food in general is an excellent take on  Korean and Mexican fusion. Everything was outstanding. We will return for sure :)", "pics": null}}, {"review": {"des": "My husband and I ate dinner here tonight and we ordered the following: go Fish taco, Esta Cameron Taco, porky pig taco, and Forastero taco.  We liked everything but we both agreed that the Esta Cameron taco was amazing!!!!!! I am a light eater so next time I will just order two of those. My husband if he was eating by himself would order three of those. My husband is Korean and he said he puts his stamp of approval on this place.  Angel is really awesome and helped us figure out what to order. Hopefully he will be there when we come back.", "pics": null}}, {"review": {"des": "Great place to get a banh mi sandwich and bibimbap in the neighborhood. Fresh and spicy flavors. Good portions. Fast and friendly service. Better atmosphere than a typical fast casual restaurant. And BYOB. Will be back. Not enough places like this around Old Town.", "pics": null}}, {"review": {"des": "Our food was absolutely delish. The group tried tacos and bowls and literally all our food items were a big hit.  The fusion of Korean and Mexican results in super flavorful food and it's very fresh.  The owner was very personable and checked in with us at our table, and he was a delight.  We had a great time with our byob tequila and a tasty and reasonably priced meal.  We will be back.", "pics": null}}, {"review": {"des": "Amazing, clean, fresh, great portion size, inexpensive, HIGH QUALITY, authentic.  <br>Around the corner from Second City and Zanies.  BYOB.   <br><br>We came from out of town and my instinct KNEW this was the place to choose versus all other great choices here!  <br><br>You will not be disappointed!", "pics": null}}]}