{"name": "forbidden-root-chicago", "reviews": [{"review": {"des": "I absolutely love going to this place. I would call<br>myself a pretty big beer guy, I always love going to breweries. I am so happy this place is right in my neighborhood. <br><br>The botanical brewery idea is really cool and original. Prior to coming here for the first time I was skeptical about the combination, but it works really well. Their rotating tap aligns with seasonal trends, so you are always going to get a good beer experience here. <br><br>Not to mention that the brewery is in an old church, it creates for a cool feel.", "pics": null}}, {"review": {"des": "Forbidden Root is a worthwhile brew pub/restaurant to check out in the West Town area of Chicago.<br><br>They accept reservations on <a href=\"/redir?url=http%3A%2F%2FReserve.com&s=c6ab50314a9191da425d30983f2221b9c8457f30886c147add0736ad72dc97d8\" target=\"_blank\" rel=\"nofollow\">Reserve.com</a>.  The space has a rustic and relaxed feel to it.  It is the perfect spot for either date night or for bringing a large group of friends.<br><br>The two of us came on a Monday night and were pleasantly surprised to learn that they had a special going on.  Every Monday you can get a burger, side, any beer on tap, and a shot of bourbon for only $15.  Not a bad deal at all!<br><br>I loved the rose' beer that I had during the night that I was there. Totally smooth and fresh tasting.  Even though I rarely order cocktails at breweries, I couldn't resist trying one of their interesting sounding cocktails.  I tried a \"Fall\" inspired cocktail that used oak barrel Rhine Hall brandy, bourbon, and other ingredients. It was bolder than I expected, but very delicious. <br><br>I am already craving their hot wings again. Every little detail about the wings was perfect. The sauce that the wings were covered in had the right kick to them and I loved that they had rings of fresh peppers on top of them.  <br><br>The burger was cooked and seasoned well.  They top the burger with a homemade sauce that pairs well with the burger.  <br><br>I fully intend on making Forbidden Root part of my restaurant rotation.", "pics": null}}, {"review": {"des": "Went on a Saturday night by myself and sat at the bar and was immediately drawn in my the ambiance of the restaurant.  I couldn't decide what kind of beer to get, so I got a pre-determined flight off of the menu.  To be completely honest, there wasn't one beer that really stood out to me in terms of overall quality.  I thought that most of them were too fruity and light for me (I tend to enjoy heavy IPA's and Stouts.. nothing fruity) but they did have a Triple IPA that I enjoyed.  However, after finishing the flight I noticed that they had a Chai version of the Triple IPA that I liked, so I decided to give it a go.  WOW.  This is simply one of my favorite beers I've had.  The only sad part of this was that they only served it for a few more days, and it's seasonal so it won't be returning anytime soon... total bummer.<br><br>Now for the food.  I ordered the N'duja Sausage appetizer and while it was not quite was I was expecting, it was fabulous!  After finishing that I promptly looked at the menu and had too many tantalizing choices, so I decided to go with my gut and get the mussels that came in a tomato based broth and had halibut pieces scattered about in the bottom.  It was absolutely delectable!  I couldn't get enough of this broth, it was actually so good that I started scraping the bowl to make sure that I didn't leave any of the broth.  The mussels were also cooked perfectly, and the halibut in the broth was a great addition.  All in all, I left more satisfied that I ever could have thought coming in after eating the food.  <br><br>HOWEVER, there's still the point about the beer.  Because of my preference, I don't feel like I can give a 5/5 star.  For me, the food was an easy 5/5, but the beer was more like a 3.5/5.  Thus, a total of a 4.  For those who tend to like fruity beers that are a little bit lighter, this will be your spot.", "pics": null}}, {"review": {"des": "My friend asked to go to a brewery and this place looked promising from the reviews and pictures. <br>I made a reservation on their website. Although we were late, there wasn't too many people on a Friday afternoon so we were good. <br><br>Ambiance: Good looking space, huge bar. It was spacious and rustic. I was looking for the nice lights and botanic area and missed it right in the front! <br><br>Service: Our waitress (petite, blonde) was super helpful with picking beers. She told us her favorites and we basically picked out of those. Thanks for the suggestions! We also missed the lunch special for the beer flight. We asked her if she could put our 2 5oz beers onto a flight and get a third, and she happily accompanied our request. <br><br>Drinks: My friend and I shared two flights: #2, 5, 8, 11, and 12 (2 of #2)! Our favorites were #2 Raspberry/Peach, #5 Sparkling Rosé Ale, and #12. #8 was too woodsy of a flavor for us. <br>I also liked #11 but my friend didn't like it as much. <br><br>Food: We started with the N'duja Sausage. Unique dish and texture. I loved it! Wish the toast was bigger, but they did give us more. We also got the Chicken wings and Pork Schnitzel sandwich. The sandwich was really good! I liked that it was crispy and thin. The wings were too hot for us. We ended up eating two each and my friend took the rest home. <br><br>We planned to take a tour of the brewery but our parking meter ran out of time. Oh well! <br><br>Both of us enjoyed this beer experience!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KDkWo2n3_dnlunhlEEu73Q/348s.jpg", "caption": "Chicken wings- super spicy!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sjsNLD2PUs2dWmZUJb7tdg/168s.jpg", "caption": "Milk Brined Pork Schnitzel Sandwich"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/K2B69hDFnYh0iLj50-gjaQ/168s.jpg", "caption": "N'duja Sausage"}]}}, {"review": {"des": "Wowowow was I surprised by this place! As the exact opposite of a beer enthusiast, I was pleasantly surprised by the wide variety of beers offered. I like how they had 5 oz options, so we tried a few of those. Tastes ranged from a thick ice cream flavor to honey to rosé and more! What surprised me the most was how artisanal the food is! We had a rosemary honey manchego plate and the duck ricotta dumplings. The dumplings were perfectly chewy, had an incredible savory/umami flavor, and was sprinkled with tender bites of duck. I was thoroughly impressed and would recommend ordering that if you go!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5ox6BS_q65n__O8ajeUtKA/348s.jpg", "caption": "Rosemary honey manchego"}]}}, {"review": {"des": "Enjoyed the great big scoop beer that tasted like eating Mexican deep fried ice cream.  Nice menu selection. Burgers and schnitzel sandwiches were great.", "pics": null}}, {"review": {"des": "Forbidden Root is one of our long-standing favorites in the city of Chicago. <br><br>We frequent Forbidden Root on Monday nights due to its delicious burger, beer, and bourbon for $15 night! What a deal!!!<br><br>The burger and fries are absolutely delicious! Rich in flavor and perfect portion sizes, we keep coming back for more! The rest of the menu looks delicious, but we can't get enough of the burger and fries, so we really haven't tried anything else!<br><br>The bourbon changes around, but right now it is 'Cody Road' from Mississippi River Distilling. The shot comes in an adorable little beaker!<br><br>The best part of Forbidden Root is it's fine botanic beer! I've tried so many on the list! Some highlights include the Sublime Ginger, the Assembly Required sour series, the Strawberry Basil, among many others! If you like beer, you really need to come in and check out their selection!<br><br>Service can sometimes be a bit slow...but it is definitely worth the wait! If you haven't been, get yourself over to Forbidden Root!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RF-iADm9RYyGhBQdriDqaA/168s.jpg", "caption": "Industry Night: $15 Beer/Bourbon/Burger"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/a6EZ4Oc5uYoBDKJPtMr_eQ/168s.jpg", "caption": "Beer List"}]}}, {"review": {"des": "This is a great brewery. <br><br>Decor: Everything is wooden and feels relaxed and cool. There are screens where you can watch the game. It was not too noisy. It was clean and also spacious.<br><br>Service: The waitress knew a lot about the menu and also was kind enough to sub out the sour on our beer flight for a different beer. She checked in on us the right amount.<br><br>Beer: We got the haze flight and it was SO good. I loved all the IPAs. They all had distinct and unique flavors but were all tasty in their own way. Really A+ beer and a huge selection.<br><br>Food: Wow especially for brewery food. The duck and dumplings was deliciously buttery and I wanted to soak up all of the sauce with the delicious gnocchi. The duck was crispy and also tender. The burger was very delicious and the pickles added the right bite of saltiness and sourness to the burger. The fries were great and similar to McDonald's fries.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xCmwwhQYuuvBQLCo86Zauw/168s.jpg", "caption": "Duck and Duck and Dumplings"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7c5Jra285g4WPhmT1GsEkg/168s.jpg", "caption": "Burger"}]}}, {"review": {"des": "Forbidden Root is the restaurant version of McDonalds more hipster cousin. The burger is juicy and very \"agreeable\" made with a special sauce that is one part aioli, one part thousand island, one part mayo. If you love McDonalds French fries then you will love them at Forbidden Root. This former movie theater brews their own beers which similar to their food is quite agreeable.<br><br>Now they have more then burgers. If you are feeling Italian worth checking out the Gnocchi as an app or any other of their small plates. <br><br>I believe it's a true 3.5 out of 5, but 4 stars was just a bit high.", "pics": null}}, {"review": {"des": "Walking along W Chicago Ave on a pleasant Sunday afternoon, I stopped into Forbidden Root for Brunch. The space is great, the service was good as well. I enjoyed the Burger, and man was it good! It was cooked amazing, and the taste was out of this world! <br><br>My server, Scott, was very helpful in showing me the menu, since it was my first time there. Everything was top notch and I cannot wait to come back to enjoy their full dinner menu! <br><br>Thank you Forbidden Root for an enjoyable experience, we will be back in the near future!", "pics": null}}, {"review": {"des": "I had the opportunity to visit Forbidden Root Memorial Day weekend with my family. Overall, most of our food and drink was good - the service was prompt and helpful, the restaurant was clean, and they seated us on time for our reservation.<br><br>That said, there were a few things about our experience that I found odd. When we went to order a flight, we were given the impression that we couldn't customize it at all, which was a bummer, because we wanted to try the Strawberry Basil beer and a few others that didn't come on the predetermined flight list. Then, the folks next to us seemed to be able to do that (could have been a misunderstanding). <br><br>We then spent quite a bit of time looking over the menu, only to find that we weren't really working from the most up to date information when it came time to order (for example, we learned the duck was served with a cherry topping, not a honey as the menu said, and the ribs were lamb, not pork as the menu said). I understand that things change with a seasonal menu, but I guess I just assumed if the changes were that drastic it's something that would have been shared right when we sat down. <br><br>We went with an order of the dill pickle chips and sausage to start (chips were great, spreadable sausage was ok), and the duck confit and spring gnocchi for dinner. The duck confit with the cherry topping was very tender and delicious and came with some really well-seasoned grits - I would recommend it. Though the gnocchi itself was a little more crunchy than cushiony, it was very fresh tasting, and had a lovely lemon sauce that complemented the peas and asparagus.<br><br>The beers we tried were pretty good, and I think this place makes a lovely happy hour spot with some shared bites, but I would encourage you to seek clarity on what is being offered when you're visiting because it's subject to change.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/C8UEaGw5Liwbnt-Dz03rOg/348s.jpg", "caption": "Duck Confit"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hxqz5gpQVv5iNGVKgZcYxA/168s.jpg", "caption": "Spring veg gnocchi"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jh-J41GRiejZfRWh4Fu-RQ/168s.jpg", "caption": "Blonde Redhead"}]}}, {"review": {"des": "I am not a beer gal, and although I'm not that crazy about brews, I still can enjoy a nice cold one every now and then. Especially on a hot summer day. Not to mention, I love supporting local breweries. I had one of their IPAs, the Snoochie Boochie, and I enjoyed it! <br><br>I like that the front part of this brewpub is open air, as it allows you to get that patio feel without getting burned by the sun. Since we were dying of heat, we opted to sit further back and closer to the brewery. I really liked the layout of this place - there's a central bar with stools and plenty of tables and chairs surrounding it. Lots of dark wood and industrial accents. Very rustic chic. The super high ceilings and intricate details led me to believe that the building has a unique history and my guess is that it formerly housed an auditorium or a movie theater. Gotta fact-check that. All in all, pretty cool. I especially loved the bathroom!<br><br>Very group and family-friendly (yes, including kids!) and our server was super nice. My gf and I needed to charge our phones badly and she kindly charged them for us.", "pics": null}}, {"review": {"des": "Food and beer was great! We shared the fried Giardiniere, pork schnitzel sandwich, and malted lamb ribs. The schnitzel sandwich was really big and definitely shareable. Also try the strawberry basil beer!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YRA1HiJFKO1g_s_4oSu0hw/348s.jpg", "caption": "Malted lamb ribs"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BCAzuIT3xmUJYMkSmM0HAQ/168s.jpg", "caption": "Half schnitzel sandwich"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OLjkKXB_U51hbLKAEZLXBg/168s.jpg", "caption": "Schnitzel sandwich and malted lamb ribs"}]}}, {"review": {"des": "Forbidden Root lured me in with its windows, opened out onto the street, like it was some kind of fun, friendly beer joint. But I could sense things were about to take a turn for the worse when I was seated in the back, on a metal chair whose sole purpose was to torture my delicate, tender buttocks. I was left to the mercy of the air conditioner, blasting gusts, whipping my hair around, as I tried to focus on the menu in front of me. <br><br>I was hungry. My stomach was starting to eat itself. The menu was tiny. I realized with a growing sense of dread that the hippest breweries now pretend that people do not really need to eat food at all. They only need to sustain themselves on sour beer.<br><br>I ordered some appetizers and a burger. The appetizers turned out to be a sleeve of Ritz crackers, arranged carefully on a cutting board, with a little bit of mustard. The last time I experienced this delicacy was probably in pre-school. I never would have thought I'd have to pay $8 to eat this again but here we are, in 2018. Anything on a cutting board goes.<br><br>The burger was mediocre. I got halfway through it before pangs of plate envy hit me. My companion had ordered the schnitzel sandwich. He allowed me a bite, and it was delicious. I returned halfheartedly to my burger. Forbidden Root had defeated me in more ways than one.", "pics": null}}, {"review": {"des": "Yum! <br><br>We went to Forbidden Root yesterday afternoon with friends and 6 month old. Huge thank you to a family friendly brewery! They had a family bathroom, how awesome is that?! <br><br>Now to food and drinks. I ordered their flight as is and was not disappointed. Each one just enough different from the last. The sour to end was delicious!<br><br> For food we ate our weight. We had fried Giardiniere, popcorn with Nori and kimchi powder, cheese and crackers, N'duja sausage, Milk Brined Pork Schnitzel Sandwich, and burger. <br><br>Everything was delicious! The schnitzel was a table favorite and the beers on it were delicious. The burger was perfectly cooked and the Giardiniere Mayo was amazing! My favorite appetizer was the cheese and crackers. We finished the crackers so I spooned the remainder of cheese into my mouth! Couldn't let it go to waste! <br><br>Unfortunately we couldn't fit desert, but those looked just as delicious. We'll be back for those, sooner than later!", "pics": null}}, {"review": {"des": "Love the beer choices at Forbidden Root especially the Sparkling Rosé Ale! Although during my recent visit, they currently don't have the Sparkling Rosé on the menu, I believe the waitress said they are currently brewing and should only be temporarily. Fingers crossed because this drink is everything! Some other great beer flavors I've tried include the Strawberry Basil and Cherrytree Amaro which is also highly recommended. You'll notice their beers are more on the fruity and botanical side which is definitely more suited for me. I wasn't too fond of the entree food choices here but did try their fried giardiniere appetizer which was delicious and paired fairly well with the drinks. The servings though run a bit small. Overall a cool brewery spot in Chicago and I will be returning once my favorite drink comes back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HQDuoSwMi09MGad22hRkjQ/168s.jpg", "caption": "Decor"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lJGffWgVizc8xwcfQyhq0A/168s.jpg", "caption": "Fried Giardiniere"}]}}, {"review": {"des": "Great food and amazing beer! There's something for everyone but the fruity beers are truly unique and it's fun to taste the new brews they have every time I check this place out. Great place for a date or group dinner. <br><br>Hang out at the bar and sample a few brews while you wait for a table. The strawberry basil beer is a popular favorite. I like to order a cheese plate and a few apps to enjoy slowly with the beer menu.", "pics": null}}, {"review": {"des": "Okay, let's talk. Five stars through and through and I would give it more if I could. <br><br>This place is that guy in high school who was beautiful, untouchable, but also did charity work and knew your name. <br><br>It's a beautiful, large venue with original architecture. Inside you'll find many tables surrounding the bar, and in the back a brewery. The staff are friendly and courteous, and happen to be beautiful to look at. <br><br>We sat at a table and started with drinks. There are plentiful beers that we tried that are brewed in house, all of which I was pleasantly surprised by. Each was unique, flavorful, and creative.  My favorite was a rosé ale that tasted like a dry champagne... amongst many others that I would do an injustice in trying to describe. Eventually moved on to some hand crafted cocktails, all which were smooth, refreshing, and delicious. <br><br>Can we talk about the food? The new executive chef Daniel puts out a menu that is seasonal, fresh, elevated, and oh so pleasing. We started with a fall salad which was crisp, savory, sweet, and condensed all of the soul of autumn into a bowl. Made our way to the grilled carrots with pistachio hummus which absolutely blew my mind. The carrots were charred and so savory  that they could have been confused for octopus, complemented by the hummus and drizzled with coriander vinaigrette and crispy pistachios for a marriage I had never dreamt of. The cheese plate followed the theme of exceptional plating and pairing with apple butter and varied cheeses that I would imagine Bourdain would love. Moved on to the duck and dumplings and roasted halibut, each beautifully plated with surprising textures and depth. The duck and dumplings was as friendly as your grandmas chicken and dumplings but then dusted with fairy dust flavor that I still can't get over. The roasted halibut was placed over forbidden black rice in a green rich curry, different than any thai flavor I've encountered, spicy and delicious. <br><br>All in all this restaurant is exceptional, accessible, friendly, elevated, and you'll guaranteed leave with a bigger smile on your face than you arrived with. Do not pass go, do not collect $200, go to forbidden root and try the beers, cocktails, and delicious seasonal offerings that Daniel is really obviously putting his heart and soul into. Go!!! Now!!", "pics": null}}, {"review": {"des": "Such a cute vibe to it. Didn't get a chance to check out the food but the drinks are what we came for. It's a really chill spot to sit, chat, and have a beer or two. The bartender was very accommodating and was able to give us good suggestions to try out. You can even ask for a sample! <br>I'm not much of a beer person but was able to get a really good cocktail with cider along side with it.  Really good spot to start the night and with good vibes.", "pics": null}}, {"review": {"des": "Their beer is great! Good cocktails too. <br><br>But wow their food, I want to like it, but I can't. We had the N'duja Sausage, Fall Salad, Grilled Carrots, and Shisito peppers. <br><br>Sausage was like a dip and excessively salty. Salad was good but could use half of the dressing it was swimming in. No complaints on the carrots. And the shisito peppers were just covered, covered in miso butter... which sounds good but not ideal that that's all you can taste. <br><br>Overall the theme of their food was smothering it all in too much sauce or seasoning, and for the price, just not worth it.", "pics": null}}, {"review": {"des": "Visited Forbidden​  Root for dinner on a Friday; we made a reservation, so we got in right away, but I did see a lot of people waiting (so keep that in mind if you go on a weekend). <br><br>We tried the beer flight, and I enjoyed the strawberry, basil beer, and the ginger beer.  They were refreshing and made me think if summer.  Just beware, they are delicious on their own so make sure to take into account the food you'll be ordering because they changed the profile of the burger.  The beers are brewed in-house, and most have some herb in them.  ​<br><br>We tried-<br>Nduja Sausage ( with Pickled​ Mustard Seeds) on toast.  It as very good- the toast was grilled and had a sweet taste​ as well (reminded me of steak tartare).<br><br>Loved the fried Brussels Sprouts.  They had a delicious​ lemon taste and were nicely crisped.<br><br>My husband and I both had the burger (8 oz. Burger, Giardiniere Mayo, Aged Cheddar, Onions, B&B Pickle, Brioche Bun).  My husband loved it, I thought it was good, ​but a bit too greasy (because​ of the cheese) and I would have preferred​ the coleslaw​​ on the side. But that's just my preference.<br><br>* Plus*<br>As a benefit corporation, ​they give back 100% of the profits (from all non-consumable merchandise) to Green City Market.  Go forbidden root!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cDEOcQyZ76h2-9iDFW1z-w/348s.jpg", "caption": "Beer flight."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/E5S2h63bs4ytzYREk1zaIg/168s.jpg", "caption": "cocktail."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/q9WILzTq1C5rbtxrXF4PhA/168s.jpg", "caption": "Crispy brussels sprouts."}]}}, {"review": {"des": "Popcorn - delicious. Has a sweetness to it, but is definitely on the spicy side. It come in a little jar. I'm not sure if this is how it's always served, but it felt like we got the bottom of the batch with a lot of little pieces. <br><br>Brussel sprouts - deliciously fried. Full of flavor and I loved the hint of lemon they had to it<br><br>Burrata - SO good. Perfect amount of bread to accompany it. I loved the sweet and savory flavor of the burrate with the sweet pom seeds and marmalade. The marmalade wasn't my favorite, but it taste just as delicious when I had it with everything else. <br><br>Lamb - I would order 2 of these and have it as a main. SO good and very tender. Not a ton of meat, but it is great as a starter to have another meat dish aside from your main. From the tenderness of the meat to the crunchy outside to the sauce, this dish was phenomenal. It came with 5 pieces.<br><br>The burger - we came here a year or two ago and this burger made a lasting impression. It was very good, but a little on the saltier side. It didn't matter so much when you had a bite that had both burger and giardinere in eat due to the giardinere's creaminess. However, when it was a bite of just the burger and bun, it was way too salty for me. The fries were also pretty salty. <br>**When our burger was brought out, they had unexpectedly split the dish into 2 for my husband and I! It was such a nice touch! <br><br>Everything came at once, except for the burger, so that was a little overwhelming for our small table lol.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CL6bHU3C56M2qdIxpQRvIw/348s.jpg", "caption": "Our burger meal unexpectedly split in half for my husband and I! So sweet of them!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GbpuVkqWln7wr5RrmLt97Q/168s.jpg", "caption": "Our popcorn after eating a bit of the top layer. It seems like we got a lot of popcorn \"crumbs\" and not many fuller pieces"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_DFc_nycK-5EEKVDYxNjZA/168s.jpg", "caption": "Lamb ribs - amazing!"}]}}, {"review": {"des": "This place was pretty decent. I guess if I drank beer then the stars may have been more. It. Was pretty quite when I went so that made the service pretty fast. Our server sorta made me feel like she didn't want us there. Or it could've been just her personality. We both had there burger special which included a beer.  The burger was really good but a little to salty for my taste. I would go back just for that.  My friend enjoyed her beer.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3VlKXVy8T0Lesv4TbhOSFQ/348s.jpg", "caption": "Blonde Red Head and Bourbon Shot"}]}}, {"review": {"des": "I've been coming here semi-regularly (gotta mix it up sometimes, right?) for about a year, more so as of late having moved about a block away from it.  <br><br>I gotta say, Forbidden Root's truly weird beverages are what keep me coming back.  Sure, sometimes there will be things on the menu that literally make my hair curlier - looking at you, Beet Box (Beet Saison) - but there are equally as many, if not more home runs such as the Strawberry Hefeweizen or Snoochie Boochies (Imperial IPA) that, simply put, just work.<br><br>The food is also pretty good all around.  Maybe my taste is simple, but you can't go wrong with the Ritz cracker sleeve (literally what it sounds like) and cheese combo for a quick snack.  The burger is also a win.  Ironically considering the above beet-down, I loved the beet appetizer which I don't think they serve anymore.  <br><br>Go here, enjoy the open air, and have a couple beers. Or cider, spirits, or whatever your thing is.", "pics": null}}, {"review": {"des": "Came on a Friday night and got seated by the window, which was our preferred seating choice as it was very loud in the main dining room. Really enjoyed the various beers which are unlike what you can typically find at other places. Hubby got the pork schnitzel sandwich and I got the burger, both were huge and delicious. Will return for more!", "pics": null}}, {"review": {"des": "Three words.  Order the burger.  <br><br>Forbidden Root's burger was seriously one of the highlights of my trip to Chicago... and this was a trip where I was surrounded by many friends, spent many hours catching up with said friends, celebrated many victories and life events, and went to many wonderful restaurants and bars! <br><br>Four more words.  Order the beer flight.<br><br>I am not much of a beer drinker anymore, but when visiting Chicago and old friends... and your friends are ordering beer flights from a place as cool and casual as this place, how do you not do the same, right?  I really wish I had written down my beer selections because they were all outstanding!<br><br>And when you're here, do yourself a favor and just stop and look around.  Take it all in and enjoy the reclaimed barnwood, the oxidized iron touches, and the ceiling that is a remnant of the venue's days as a theatre!  Beautiful job on designing this space!  When I was there, I literally said that I wanted to live there in that space.<br><br>Forbidden Root is definitely a place I will recommend other visitors to stop in while they are in town.  An easy five star experience!<br><br>*****FIVE STARS*****", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZsdAw_Y8-ppPotoN8nkX0g/348s.jpg", "caption": "The burger and lunch flight!"}]}}, {"review": {"des": "This would be a five-star location if it weren't for our waitress.<br><br>There are a LOT of beer options on the menu. When she came up to the table, she didn't care to ask how we were doing, or if we wanted recommendations. I asked her if I could sample some before I ordered, she rolled her eyes, and answered \"yeah, if it's just a few.\" Hello, I'm not here to sample every flavor on the menu! I decided to only sample two, and settled on another beer.<br><br>We were only here to grab a few bites and drink beer, so we ordered a few small plates and beer. Again, negative attitude from her when we told her we were done ordering. Throughout the meal, there were only a couple tables seated around us but she didn't come by to ask about our meal, drinks, or anything. If it was busy, it would sort of make sense, but this place was pretty much half empty around 9PM on a Tuesday night.<br><br>Price:<br>-A small cheese plate is only $6, and I'd say it's a pretty nice portion for the price. The raw cow cheese was addicting, I almost got some to-go!<br>-Don't forget, Tuesdays are 6 for $6 wings (small wings - order double) and $3 oysters.<br><br>Taste: <br>-I liked the \"Dressed\" beer - spicy with great salty rim. Reminded me of a michelada but more... savory?<br>-There's also a radler with Dr. Brown's Cel-Ray. I'm a huge fan. Especially since the Cel-Ray soda is my current obsession.<br>-Get the cheese.<br>-Wings are delicious, but make sure to get a plate full of them.", "pics": null}}, {"review": {"des": "What a great brewery stop in Chicago! This building was previously an old movie theater called The Hub. When you enter in the door look down at your feet. There is white tile with red tiles that say The Hub. If you look to your left that is the old concession stand. And when you get half way in the bar area look up and behind you and you will see the old projection room. Crazy to think that was 105 years ago, Forbidden Root preserved/restored the 105 year old building so well. <br><br>We had planned to just stop in for a pint and then move one, but 4 hours later we were still there enjoying their delicious beers, great service, and delightful food. Must haves in my opinion are their Strawberry Basil Hefeweizen that would accompany a hot summer day perfectly. The food is so unique and irresistible. The musts on the menu is their take of potato chips, somehow they get theirs to taste exactly like a frozen cheese pizza. I could have ate two more bowls of those chips!!!!  You definitely can not eat just one. Their charcuterie board included strong cheese choices. I really enjoyed them. On top of the great beer and food all the servers and bar tenders stopped by to chat. They seem to be genuinely friendly which is a great find.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aOKS2J6OvZ_Z_GGEiH_6Zw/348s.jpg", "caption": "Forbidden Root entrance"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vwxT5_IMg7sqM0debX_7hA/168s.jpg", "caption": "All the tap handles"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jXysGCZDJybBdfRq3dUcZg/168s.jpg", "caption": "Charcuterie board"}]}}, {"review": {"des": "This is a really interesting place, the kind of beer they have is pretty \"peculiar\". They are a Botanic Brewery, they only use natural ingredients it's interesting, the place itself is pretty cool.<br><br>The beers are a matter of personal preference what I would say here is, go and try it. I feel that definitely is worth your time. But I want to add, the ginger sublima was good. The beer with \"strawberry\" on the name, I hated it.  But as I said, just go and try it...", "pics": null}}, {"review": {"des": "I booked marked this place last summer as I was having a drink in a place that no longer exists and this couple sitting next to me started telling me how awesome Forbidden Root is. I had never heard of it but they painted an awesome picture of the delicious food and great beer. <br><br>I came over on a snow flurry filled late morning/noon time. Grabbed a seat at the bar as I waiting on a friend to appear. As I sat down the cool guy behind the bar was telling me about the daily special which was a beer, burger and bourbon shot for $15...don't mind if I do! The burger comes on a brioche bun and includes onions, aged cheddar, b&b pickles and giardiniere mayo. Very good burger along with the fries! The homie behind the bar suggested the Radio Swann Rye IPA which is brewed with lactose by Forbidden Root...very good and great flavor. After my friend showed up, we decided to up the ante by switching over to cocktails from beer. I started with the old fashioned which was good and my friend had the Spicy Whiskey Highball. She let me taste it and from that point on I decided to continue drinking it. The SWH contains Slane irish whiskey, Pineau des Charentes,spiced syrup fresh lemon Juice, Boker's aromatic bitters and soda.<br><br>The service here was great from the recommendations all the way to the quickness of receiving what we ordered. Great big bar space and very wide open with tables all over the space. This is a great place to come and grab some food any time of day and drink some botanical beers as they're Chicago's first botanical brewery. Love this place!", "pics": null}}, {"review": {"des": "Went here in a party of 6 (with reservations) and got right in on a busy Saturday night. Between all of us I think we covered most of the 15 beers on the menu - the 5 oz pours are the perfect size for tasting - and we all had dinner. Menu is limited but the food was very good. Beers are mostly sours and  fruity beers with some IPAs and ales  and while I'm more of lager guy the beers were all very good. Overall highly recommend.", "pics": null}}, {"review": {"des": "Very cool and modern feeling brewery. The beer here is botanical-themed and the fruit flavor definitely come through well without it tasting like an Angry Orchard. The King Hell (cherry aroma) and Sparkling Rosé Ale were big winners in my book. A flight of 5 beers is only $13, and you get get to substitute one of them for any other beer on the menu - very good tasting deal.<br><br>Wings [8/10]: Nice spicy flavor but we got some really tiny ones.<br><br>Cheese Pizza Chips [6/10]: Thought they'd be more like nachos based on the description but literally just pizza flavored chips.<br><br>Mussels [7/10]: Pretty good mussels but didn't pair well with the salad at all. Would be better in a broth with bread or something.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cQimFzUthSjhu0SiBsAZSQ/348s.jpg", "caption": "Mussels"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cJHxRpPOylZ1z7kWUhBKFQ/168s.jpg", "caption": "Cheese pizza chips"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kwlqoKYINEJzQNXIxE75EQ/168s.jpg", "caption": "Beer flight"}]}}, {"review": {"des": "We visited a year later and still loved everything about this place! Our server was fantastic, we tried almost all of the beers, and pistachio gelato was still on point! I'm glad they didn't do any radical changes since our last visit!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GdMRRqrfLw6AKJMyHNjnIA/348s.jpg", "caption": "Love their pistachio gelato and the serving bowl is so cool!"}]}}, {"review": {"des": "Yay! I'm a fan.<br><br>Second time stopping here. The first visit, we were tired and kind of drunk and at that stage where nothing impresses you, you don't want another beer, and you don't want to talk to your tablemates. You want to go home and sleep. So, we will disregard that first visit, as it was my own fault :)<br><br>Now, last night, we grabbed a couple seats at the bar and tasted several of their beers. Yes, they have some of the most interesting beers in Chicago. But, most of them range from good to wonderful. Their strawberry banana NE style IPA was ridiculous. I love IPS's and usually hate when they add fruit or anything beyond more hops. This one is done extremely well, though. <br><br>We enjoyed the few hours we spent there and have plans to come back later this spring to try some of their beers that lend well to warmed weather.", "pics": null}}, {"review": {"des": "I've been to better breweries but I've also been to worse breweries. Our service was extremely slow, despite the fact that it was the middle of the day and there were maybe two other tables in there. The beer is pretty good; I got an apricot sour that was absolutely outstanding!<br><br>That said, the food is wildly overpriced. You pay $8 for a \"cheese platter,\" but then it shows up at your table and it's a small puddle of liquid cheese (seriously, barely enough for 2 people to split) plus a mini sleeve of Ritz crackers (literally, it still has the brown sleeve on it).<br><br>Overall, this place is decent but I think they've still got some stuff to figure out. Service could he significantly better, and they need to reevaluate their menu offerings if they're looking to charge that much. I don't mind paying $8, but give me something that's worth $8, ya know?", "pics": null}}, {"review": {"des": "Eh. That's basically what I can say to sum up Forbidden Root. Eh. Pretty hipster, and a little too chill for me. Everyone working there took their sweet time, which was really annoying. The hostess was just sitting playing on their phone the whole time. They need to do something to block the draft from coming in too, because when you're sitting at the bar in winter and the door keeps opening, you're instantly hit with chill and so we were sitting in our coats. The whiskey and gin drinks my friend and I got were also just meh and watery, nothing to write home about. We only ended up here because we were waiting for our dinner reservation at Yuzu across the street. Meh. Eh. I'd walk down the block to a different bar. Prices for the drinks weren't worth it either for their wateriness.", "pics": null}}, {"review": {"des": "Forbidden root basically ruined our 4th of July. I and my friends went around 1pm to get lunch and start our day drinking. Since it's a holiday they have a limited menu where they only served 4 large plates and a few items were already sold out by the time I began ordering. Me and my roommate both ordered the Schnitzel sandwiches which ultimately led to our suffering. The sandwich tasted maybe 6 out of 10 but after 1 hour we both got terribly ill. We had to cancel our plan in the afternoon and went home to lay in bed. It's a combination of nausea,dizziness  and overall exhaustion. Needless to say we can't anything at this point.<br><br>I don't know what ingredients were being used on the holiday but since we both got sick at the same time. Something has to be wrong. <br><br>The silver lining is that neither of us has to go to the ER.", "pics": null}}, {"review": {"des": "On my family trip to Chicago I was generally placed in charge of finding the booze. . . . or finding a nice brewery to go to that also serves food for lunch. Out of the many many options I finally choose Forbidden Root. It wasn't something that I could find on tap most likely ever in New York or the east coast, they had actual decent lunch specials for $5 food/$7 flights. The brewery is advertised as 'Chicago's first botanical brewery'. I don't know what the hell that means. Fresh herbs? According to google a botanic beer is a complex, bitter beverage created in the second half of the 19th century. Present botanical breweries now experiment with historically inspired recipes using botanical ingredients (herbs, roots, flowers, fruits, leaves or seeds). Utterly fascinating.<br><br>The decor inside is wide open and spacious with communal picnic tables, plants, cool sunburst lampshades on the ceiling. Food menu is a mixture of both German flare (we are in Ukrainian village) and American comfort food. I went with a traditional grilled cheese that was made with mostly just cheddar and provolone. It was a bit bland to be honest and could have used a kick (not necessarily of truffle oil that everyone these days uses) but maybe some kind of jam or ham, or even a tomato slice. Speaking of tomato, this would have gone great with tomato soup. My brother ordered the burger that looked decent. And my sister and father went with the pork schnitzel that was the clear winner and more expensive dish (not on the lunch specials). The schnitzel came with a great salad (option of fries) and some kind of purple beets and mayo spread that was really out of this world and accompanied everything fantastically.<br><br>Moving on to the most important part. . . . the beer. Was it truly a fantastic experience being at a botanical brewery for the first time? Honestly, yes. Everything I tasted was pretty mind blowing. Even their traditional ipa was solid. <br><br>WPA: Wildflower Pale Ale (5.6% abv) - Brewed with Mandarina Bavaria hops, Marigold, Elderflower, and Sweet Osmanthus flowers. You definitely get a floral taste here but in a really delicate way that doesn't overpower you with the hops.<br><br>Money on My Rind: Witbier (5% abv) - I'm usually not a huge fan of witbiers or anything that even remotely resembles Blue Moon. Not bad overall though. It has notes of juniper and grapefruit and has a kind of a peppery finish to it.<br><br>Strawberry Basil Hefeweizen: (5% abv) - Holy hell was this delicious. One of my favorites by far. Definitely not overpowering in fruitiness. It's subtle with the strawberry and a nice wham of basil. It's like a better form of Strawberry Abita. I wish this existed everywhere across the USA. <br><br>Me Drink Cookie: Brown Ale: (8.2% abv) - This was described as tasting like your Grandma's Oatmeal Cookies. My grandma never made me oatmeal raisin cookies but damn was this outstanding. It's not heavy like a milk stout but it's sweet enough like one and genuinely tastes like cookies. One of the best brown ales I've ever had and probably one of the highest proofed.<br><br>Snookums: Barleywine: (10% abv) - I don't know if I would go to the extents of describing this as a honey bundt cake. Barleywines are pretty tough to perfect. It can either taste like cough syrup or just be overly bitter. It was pretty well balanced for one though but it wasn't my favorite cup of tea. I still enjoyed it.<br><br>Get to The Winchester: Rye Beer (4% abv) - The description is again a stretch - Wafts of Coffee and Graham Crackers, tastes like eating a chocolate biscuit. More like . . . . it tastes like a slightly sweet rye beer. I enjoyed it, but it wasn't that remarkable. <br><br>All in all, the drafts and the food was above average and created a flavor palate with beers I've never seen done before. This brewery definitely has some magic going. Only regret is that I didn't try their Imperial Stout on the menu before leaving.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/B1bPbNiGwj-fLUhF11b87Q/348s.jpg", "caption": "Grilled cheese"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/b17XqAnAdbKq_jD5hcePIg/168s.jpg", "caption": "Burger"}]}}, {"review": {"des": "Really great place for craft and specialty beers. Honestly a super sweet spot, you can see the brewery out back through the glass wall. They have a huge selection of beers that you wouldn't find anywhere else. The kitchen closed early so we couldn't get food, so I can't comment on that. The beers change so you can get interesting brews every time you come.", "pics": null}}, {"review": {"des": "This is the sort of spot you are thrilled to have in the neighborhood. From the excellent beer selection to the vibe to the creative, solid food menu, this place is on point. It loses one point for service that can be very, very slow, but you can totally overlook it with the not-to-miss burger and the perfect-for-winter chicken and dumplings.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ey3X3EALRn6E16xY2X39UQ/168s.jpg", "caption": "Wake Up Call"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LQxaE9LMDksZ67h3c0N5MQ/168s.jpg", "caption": "Chicken and Dumplings"}]}}, {"review": {"des": "Really cool decor and vibe, Forbidden Root offers a wide variety of very fruity and aromatic beers.  If you like fruity IPAs you'll love Forbidden Root, but if you're more of a porter/stout guy you'll leave unsatisfied.  I didn't try the food but it looked really good and the portions were very generous.", "pics": null}}, {"review": {"des": "I went for a long lunch and tried the lunch beer flight for $7, which is a nice option. I got the meridian smoochie boochies which was delicious--so delicious I got it again. I also sampled the cucumber strawberry basil Hefeweizen which I did not like--it was sour/funky tasting and the moody tongue dunkelweizen which I also didn't finish--I think just because it didn't go well with the meridian. We had the lunch soup of the day which was corn Parmesan, which I liked. We also had the king salmon which was tasty, but too small a dish to justify the $19 price point. The salmon portion was fine--I know king salmon is pricy, but they could've included more on the side. It came with a paltry portion of rice and mushrooms. I'd go back for a Meridian but skip the food next time. The service was also pretty slow and the restaurant was half empty but perhaps they were short staffed.", "pics": null}}, {"review": {"des": "This was a cute little place. It had a great beer list and fun atmosphere. Our service was shit. The waitress was just super short and rude (we were 1 of 4 tables in the entire place). We ordered the wings as an appetizer. They were inedible. The spice on them was wayyyyy too much (and we are a group that loves spicy). There was also no warning from the waitress on the spice level (which after tasting them, there should have been a warning on the menu). The fries and burgers were good, but it's the city and you can get a good burger and fries anywhere.", "pics": null}}, {"review": {"des": "The food portions here are big! You will leave here with a satisfied and full stomach. From the brunch menu, I had the milk brined pork schnitzel sandwich. I had to cut it up because it was massive. The pickled beet mayo surprised me (a pinkish-purple color) that I did not expect to have in my sandwich! But it added a unique taste to it that I enjoyed eating. My friend ordered the savoury pancake which was like a super fancy version of the Korean pajeon. It had kimchi, baby kale, cheese curds, and a poached egg on top. It was a mouthful of good stuff. Lastly, we had the forbidden root float vanilla ice cream which was the most intense and fanciest root beer float I ever had. It came with brownie bits, honey, cacao sea salt rim, and a brandied cherry.  They also gave a little more root beer on the side so you can pour it in when you are running low. It was a great brunch meal overall and I couldn't eat another meal for awhile since I ate so much here!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4GHqLgx6lPHzCcOyHzYaEQ/348s.jpg", "caption": "Brunch is served. Massive portions."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Dimc1YWGoirgw1mX53OLFg/168s.jpg", "caption": "Forbidden root float vanilla ice cream"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MbzPYX0E3_ZDno2Bf9je8w/168s.jpg", "caption": "Savoury pancake with kimchi"}]}}, {"review": {"des": "Delicious beer, outstanding and interesting food, excellent and friendly service. Great for groups of all sizes.<br><br>The menu is set up with different sized plates and is awesome for sharing. The fried giardinara (sp?) is fantastic - a must have. Also delicious - their burrata, cheese and crackers, schnitzel sandwich and the burger. They had asparagus specials last time I went and the grilled asparagus was super tasty.<br><br>The beer flight was awesome. They also have a great, inventive cocktail menu.<br><br>I have been twice to this restaurant and happened to have the same server both times. He was wonderful - made great suggestions. <br><br>Tip - call for peak time reservations! You can use open table for off peak times. Do not attempt to go without a reservation.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8diJLrowKedmLz9psvom6w/348s.jpg", "caption": "Beer flight"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9ZhWL9y-KEHZTuhUmSR4UQ/168s.jpg", "caption": "Crisp, yummy salad and grilled asparagus"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cT5K7tXGT1PojptYBFDlNQ/168s.jpg", "caption": "Tasty burger"}]}}, {"review": {"des": "I absolutely LOVED Forbidden Root--and I don't drink!  <br><br>But I went there for dinner w/ friends (first time in Chicago)... and was happily surprised. <br><br>I had one of the best hamburgers ever (and I make a pretty darn good burger myself), fries and house made lemonade.  We also shared a fantastic cheese plate that featured a small beet salad and some sort of homemade applesauce.<br><br>I really wanted dessert but was too full by the end. <br><br>Our server was attentive but not hovering.  Maybe it's because we went there on a week night, but there was no rush to make us leave. <br><br>The restaurant is on a part of Chicago Avenue that is a bit sketchy, but has a few other cool places, including a pie shop and another restaurant called Beatnik, so, the street is evolving. <br><br>It's right on the 66 bus route, too.<br><br>So when you're in Chicago, just... GO.  : )", "pics": null}}, {"review": {"des": "I stopped by last night after trying to dine and a new place nearby that was dragging out our wait well past out reservation. <br>Anyway, forbidden Root had some new beers and we walked right in. Major Label Debut is a tasty little stout, bitter. Snookums is a English style barley wine. I typically don't like that style but this one is a winner. There's a little spice to it. <br>The upside to Forbidden Root is their food is legit. They know what they're doing. Arctic char last night, very good and reasonable priced. <br><br>Thanks Forbidden Root for saving my night.", "pics": null}}, {"review": {"des": "I don't drink a lot of beer, but I am a big fan of the strawberry basil hefeweizen. My friend and I came here for dinner, and we both ordered the fruity hef. The flavors took me back to just a couple of months ago when it wasn't 30 deg in Chi, so that was a nice summer throwback. <br><br>We shared the Fried Brussel Sprouts which were light and lemony. I got the burger which was one of the best burgers I've had in Chicago. The patty was cooked perfectly, and the homemade pickles were bomb. My friend got the Wild Mushroom Pot Pie which was also tasty and flavorful. <br><br>This is a great place to hangout with friends and large parties. Just make sure to book a table beforehand on their website!", "pics": null}}, {"review": {"des": "I was in between giving this place 3 or 4 stars. The place was big enough, looked really good and had good beer options. The only thing that I did not like which probably wasn't a big deal was that their flights are pre-selected and you cannot select your own. Otherwise, it was good beer. I ultimately decided to go with four stars because the beer options and taste outweighed not being able to make my own flight.", "pics": null}}, {"review": {"des": "Holy cow.  What a great venue.  Great service.  And really great food and beer.  I was so impressed.   The grilled asparagus and schnitzel sandwich are a must have.  And sparkling rose ale?   You had me at sparkling.", "pics": null}}, {"review": {"des": "This was my favorite meal out of a recent trip to Chicago and I'm slightly hesitant to review it, because I didn't get to try any of the beer, but the overall experience was so positive that I think they earned it. <br><br>We had made reservations for two for a Saturday evening, but really that likely wasn't needed. The restaurant area was busy, but not super packed, and we were quickly seated. My husband ordered the strawberry basil Hefeweizen and I asked the waiter if they had anything available that was pregnant-lady-friendly. What do you know, they actually had a house mocktail at the ready, which was DELIGHTFUL. It contained candied hibiscus. <br><br>We decided to split a number of small plates as that is my number one favorite way to eat and the menu here feels made for it. We started with some cheese and crackers and the Fried Giardiniere, which is now my new favorite pub food. Think fried pickles, but upgraded. The kale and spinach salad and burrata both followed. Out of the two, I fully expected to prefer the burrata (because cheese), but in fact the kale stole the show. Lastly we rounded things out with a rhubarb pie (for me) and a German Chocolate Stout (for him), both of which make good desserts, but if you're here for the beer than you know what to do. <br><br>Of particular note here was how kind and friendly everyone on staff was. While the atmosphere is low-key bordering on loud, the service felt like fine dining. I will 100% be back for more fried giardiniere and beers once I can have them.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_6qAMZlV6SRB2W7EWLMQEw/348s.jpg", "caption": "Small plates and bar snacks mostly."}]}}, {"review": {"des": "The beet beer is to be skipped, but I would go back for the big, homemade giardinera. YUM. Service was good. The place is quiet cavernous and is pretty. (It's an old theater.)", "pics": null}}, {"review": {"des": "I love that this place is a local spot for me. Forbidden Root not only has delicious beer, but the food is legit too. I am not the biggest beer drinker as I tend not to like IPAs and/or hoppy beer. Forbidden Root has beer for everyone. Not only is the beer made with many natural ingredients, they have fun names and taste delicious. My personal favorite is the Strawberry Basil beer as it's light and crisp. The Money on my Rind and the oatmeal stout were also quite delicious. If you are not sure what beer you want and do not want to commit to a full glass, they offer 5 oz pours and flights too. Do not be discouraged by the fixed flight on the menu. They are able to customize your flight, which was perfect in allowing me to taste at least 5 beers.<br><br>The food is quite delicious as well. We have not really had a bad experience with whatever we ordered. The burger has always been a staple for us.I won't say it's the most delicious burger in all of Chicago, but it sure is pretty decent. Also good are their bar snacks like the pizza chips ad popcorn. We got the steak jerky yesterday, and although it was ok, I don't know that it was worth the $9.<br><br>The best item on the small plates menu is probably the fried giardinara. It appeals to my Indian heritage that the veggies are battered and deep-fried. They have this surprising pop of acid with each bite, which helps it hold true to the giardinara feel. Also delicious on the small plates menu were the lamb ribs. They were not only tender and fell off the bone, but the sauce that it was covered in was super delicious. I hesitate reviewing this item as there a lot of rotation of menu items.<br><br>Either way, this is definitely a restaurant in our local rotation.", "pics": null}}, {"review": {"des": "A fun, giant bar/restaurant in Ukrainian Village. We stopped here after sushi at Yuzu and it felt so nice not to be as crammed in as we were before! It was a 45 min wait for a table but there is a SRO area in the back with high top tables that is first come, first serve so we chose that instead. Perused the drink menu and was excited to see craft cocktails! Especially gin cocktails! I got the Uva which was gin, pamplemousse rose, fernet-branca, lemon, and aged honey. The honey was so pronounced in flavor, but not in sweetness, and it was absolutely amazing! One cocktail was all I needed to feel a little buzzed (weak, I know), but I gladly would have gone back to try more. Friends got the Wake the Dead (similar, but more citrus-y than, the Uva) and the Miel Amargo (delish and smoky, but VERY boozy). We chatted, admired the cool space - there's a chest full of assorted empty bottles that was especially fun - and enjoyed our time. Bartenders were knowledgeable but not snooty, and it was an all around great time. The plates of food I spied looked amazing, and I will happily return to try the food!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/l9-hhHhPYew07F9muV9POQ/168s.jpg", "caption": "My fave"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/X3nSl3wId8Cg-oU1mbaXJA/168s.jpg", "caption": "Black salted rim. Yes."}]}}, {"review": {"des": "Came here for drinks on Thursday night around 8 PM. Place was packed! They had the windows open on the patio and place is set up to feel really open and breezy.<br><br>I sampled a few beers, which you can do if you are unsure of anything btw, but ended up with solemn oath ticklefight to maximize my drunkenness.<br><br>We ordered the chips and the cheese plate. The chips were okay, really heavily seasoned. I just can't wrap my head around ordering chips at a restaurant. The cheese plate came out an hour late which was why they took it off the bill, but all the cheeses were really yummy and they paired well with the bread and jam.<br><br>Place seems really awesome, I want to come for brunch!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tt_bcOL-78wURuBD4WJTaA/348s.jpg", "caption": "cheese plate"}]}}, {"review": {"des": "I love this place! The atmosphere, customer service, and even down to the toilet paper in the bathroom (you know it's a nice place if that good quality TP). <br><br>We didn't try any of the food but we had a couple cocktails and the bourbon pecan pie. There's few pecan pies I like better than mine but this one was a home run.<br><br>I also had a tequila cocktail I can't remember the name that was delicious. There was this bourbon cocktail called \"The Rake\" made with 100 proof bourbon and BEWARE it was so tasty that before you know it you're 3 in and falling asleep in your boyfriends lap in the uber home. <br>I'd call this place a win, and I can't wait to come back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jGMH5h4uiWk55D6588X97Q/348s.jpg", "caption": "Bourbon pecan pie"}]}}, {"review": {"des": "Finally I got to taste the forbidden fruit at Forbidden Root!<br><br>Love the space, amazing service, delicious food, so-so beer.<br><br>While at Forbidden Root, I tried their flight to try to get a good scope of their bubbly offerings. I'd like to go back to Forbidden Root to try more of their botanic brews but the ones in the flight just weren't doing it for me. They all sounded really unique and interesting but most lacked that extra oomph in flavor. This is a total matter of opinion as I know lighter things like lagers and pilsners appeal greatly to fellow beer drinkers. They just aren't really my thing.<br><br>So in the $13 Foridden Root Flight, you will get (from my least favorite to most favorite of the bunch) - Purple Pils 5.1% Pilsner, 5% Strawberry Basil Hefeweizen, 3.8% Sublime Ginger, Cola Brau a 6.2% Porter and a 9.2% RIP Currant porter. None were bad, they were just A-OK in my opinion. But as I mentioned, I tried less than half on the docket, so hope to go back and try more.<br><br>Now the brunch food at Forbidden Root was nearly as unique as their beers but tasted delicious!  I tried the Milk Brined Pork Schnitzel Sandwich topped with a Pickled Beet Mayo, Slaw on a Sesame Seed Bun for $14. It was huge and so tasty - loved it and the perfect Sunday fix for having a few too many vinos Saturday night. I also tried their burger which is on the brunch menu for $15 - topped with a ton of goodness, it was another very solid option.<br><br>Forbidden Root does brunch on Sundays from 11am-2pm and it's an awesome option with many delicious food choices. Plus the best hangover cure is more beer right?! That's what my brain tells my mouth no matter how hard my liver tries to fight it every Sunday morning. Though they haven't quite been my cup of tea just yet, Forbidden Root plays with some cool beer flavors and is a brewpub not to be missed!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VyMUokWsTTSwYj9nP7AR7w/168s.jpg", "caption": "Adorable ceiling"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MgUhmlTd1B_RAMGwZRVtCA/168s.jpg", "caption": "Adorable ceiling"}]}}, {"review": {"des": "Fun spot for dinner, but the beer is the best part!  They do beer flights if you want to try multiple ones.  We pick up 6-packs of the ginger-infused beer year-round.<br><br>We were disappointed by the brunch menu (where are the veggies?), so we ate elsewhere for that meal.", "pics": null}}, {"review": {"des": "I'm in town from Santa Monica on business and I am a homebrewer (aka seek great beer) and a foodie. The space is fine, but won't blow you away. The beer and food are some of the best I have ever had. Full disclosure, I only ate the green curry halibut - it was amazing. I eat plenty of thai food in LA and this had the best flavor I can remember. Also a slight heat by the time I finished the dish. I did drink plenty of beer (they offer 5 oz pours) and was blown away. We're talking 10% hazy IPA that tastes like straight crushable juice! An experience to remember for food and beer lovers. They also had cocktails that looked great but I didn't try. Bartender Max was also very cool and provided great service.", "pics": null}}, {"review": {"des": "Great first trip to Forbidden Root on a recent Saturday evening.   Open atmosphere and great taproom/restaurant amount of space.<br><br>Beer-wise, Snoochie Boochies is not only a nod to the great Kevin Smith's Clerks/Jay & Silent Bob franchise, but a tasty double IPA.   I was pleasantly surprised by the Ukie-vass, a Rye Ale with hints of rye bread and lemon.<br><br>I sampled appetizers/small plates and really enjoyed the Fried Giardiniere, a great take on the classic relish/sandwich mixture, and Burrata, which had candied walnuts and a perfect amount of heat involved.<br><br>Good service and located in an area that is accessible from anywhere in the city within a good 10 minutes makes this a good lead off spot for the evening or a place to end the night as well with the huge selection of fragrant brews and whiskeys.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vPpwkBfJDrm-ugoHlt-4pQ/348s.jpg", "caption": "Great Double IPA, which was available in a bomber size only during our visit."}]}}, {"review": {"des": "The ambiance is very cool and laid back for a downtown establishment. They have a good beer selection. Of interesting note is the Right Bee apple cider on tap. With an ABV of 5.7, it could be one to sneak up on you. The beers are tasty. The Night Moth IPA is a light and tasty offering that is palatable with a crisp finish. <br>They don't have a lot for kids and a limited \"family\" vibe. More suited for an after work hangout. The menu is somewhat limited but offers more than a standard \"pub fare\"   the burger is absolutely amazing. I would escape a Turkish prison to have it again.  Great combination of toppings and slaw with some tart and spice to bring it home. Service was good and accommodating for people with food allergies.  Parking stinks, but hey, that's Chicago.", "pics": null}}, {"review": {"des": "This beautiful space can be dressed up or down for whatever occasion you're looking for. The bar is beautiful and in the round so people watching/ flirting is optimal. My fiancé and I had the schnitzel and the burger. Order both as is, even if you don't like bread and butter pickles! One of the better, more creative meals I've had in Chicago. $$$ but worth it if you want a seriously yummy meal.<br><br>Update: now that I've been to forbidden root a few times I can confidently say that whatever soup they're serving, you should try it. I had asparagus the first time, then roasted onion with XO sauce, then creamy potato leek. I'm a soup soul. This place is Church!", "pics": null}}, {"review": {"des": "I don't really remember much about the food here, probably because I had so much good beer to drink, but the beer here was definitely memorable.<br><br>They have a wide variety of styles here from your common ones such as IPAs to not so common ones like old ales and smoked ales. I personally enjoyed all of the beers here, but definitely try Money on my Rind and Sublime Ginger if available. I could definitely have those beers again in a heart beat.<br><br>The service and atmosphere was certainly enjoyable and if I go back to Chicago soon, this would have to be one of my stops.", "pics": null}}, {"review": {"des": "Fantastic original botanical beers and solid signature mixed drinks,. My beef is with the service.<br><br>I sat at the bar waiting and waiting. There were 4 bartenders behind the bar. Two mixing drinks - one for the bar and the other for the tables. The other two were shooting the breeze and one one saw me waiting and she did NOTHING. I think she had short dirty blonde hair and wore glasses and and frown. <br><br>I really hate it when bartenders ignore you just so they can talk to each other instead of making money for the restaurant and themselves.", "pics": null}}, {"review": {"des": "Great food and beer! Makes for a fantastic, laid back spot for an evening with friends. <br>Besides the beer, def. try the burger and the popcorn! This is becoming my go to spot in West Town / Ukrainian Village", "pics": null}}, {"review": {"des": "Pretty hipster spot on the west side of Chicago. It was not busy around 9pm on a Friday night. My party of 3 was seated immediately. Service was good and attentive. <br><br>They have a really good beer selection. I got the Money On My Rind that had a hint white grapefruit juice. The hint of grapefruit is hardly there, but good nonetheless. Food was alright, I was not too hungry so I only opted for smaller items. The jerky and soup was good, nothing too crazy to rave.", "pics": null}}, {"review": {"des": "Botanical themed craft beer with an inspired gastropub menu, warm and modern interior design, and absolutely outstanding service. Highly recommended!<br><br>Forbidden Root was floated around by a few craft beer nerd friends as a potential stop during our Chicago beer tour. We were pleasantly surprised how well this place delivered.<br><br>Walking in, this looks like a brand new build-out with all wooden, trendy decor and your Edison type of hipster low-level, warm lighting. The craft beer list is expansive, covering at least 15 house beers of all sorts of styles. Each one had a novel twist to the recipe such as a strawberry basil hefeweizen and lavender pilsner.<br><br>I tried two different taster flights of 5 beers each for a total of 10. My favorite offerings were the Toy Boat Berliner Weisse (just a simple, well-crafted lemonade of beers Berliner) and the Double Tiger Palm, a tropical hop-focused Double IPA made with Thai palm sugar. This one was outstanding with a pure, bright citrus aroma and super fresh tasting, silky body. Zesty, floral - just a slam dunk of a Double IPA that would put most San Diego breweries to shame. <br><br>My least favorites were the Orange Bomb and Basque in the Sun. The Orange Bomb was a super medicinal, cough syrup of a beer that was much closer to a Bier de Miel than a Triple IPA. Way too much honey flavor. The Basque in the Sun seemed like a winner from the description: saison with cedar added. However, this one was buttery in the aroma and the flavor was very sweet, near syrupy with no cedar character. The alcohol level seemed higher than the labeled 6.7%. Simply, it was not a saison. <br><br>Wife got the dark hot chocolate with salted marshmallow and a shot of bourbon dumped in. She loved it.<br><br>Our service was spectacular throughout the evening. Unfortunately, we didn't have dinner here, but the food menu looked outstanding. I will definitely be back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JxFFiGaKCszyKlvG9BEOMg/168s.jpg", "caption": "Beer menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mKdo1owTGnMuKHVEG-hY_Q/168s.jpg", "caption": "Tap list and central bar"}]}}, {"review": {"des": "Looking for a low key NYE, my friend and I noticed Forbidden Root had open reservations with no catch (no extra charge just to get in the door or party gimmicks). Good food, good drinks, wear whatever - we were sold!<br><br>As soon as I walked in the host asked if he could take my coat and gave me a ticket. Why don't more restaurants do this?! Such a nice touch. Whoever designed the interior knew what they were doing - it was cozy and just lovely. I was actually shocked to find not many people were there but it actually worked to our favor to have a table in our own little corner and some very attentive service. <br><br>Unfortunately I was just getting over being sick, so I decided not to roll the dice with beer. Which, obviously, is what Forbidden Root is known for so a great excuse to come back ASAP. My friend had a flight and I tried the mule cocktail (good, but nothing to email home about). For food, I had the pork schnitzel sandwich with fries and it was pretty much everything I could've hoped for. For that matter, the whole experience was pretty much everything I could've hoped for. What an awesome brewpub!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VqF_PrDBbTQAOMPq8AjIMQ/168s.jpg", "caption": "Beer flight!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5hEFr_OE-Rw_furH6rl9zQ/168s.jpg", "caption": "Pork schnitzel sandwich - om nom nommmm"}]}}, {"review": {"des": "Wow, we were slayed by the delicious, creative food. Super fresh salads with interesting components, phenomenal soup, and perfectly crisped grilled cheese. Came here on a whim for lunch because we were in the neighborhood. Now we will seek it out for dinner. It's great to see Chicago Ave getting better restaurants.", "pics": null}}, {"review": {"des": "I've been here several times since I stay with friends who live around the corner from this place when I'm in Chicago. It's about time I write the review.<br><br>I've tried several of their beers and I find their IPAs to be solid. Others are hit and miss for me. The hits are full of flavor and have a great mouth feel. The misses taste empty-bodied or have an unfavorable after taste. I won't name the specific beers that I felt this way about because everybody has a different palate, and I also can't remember since I tried so many of them. I just remember that their IPAs stand out....Death by Snu Snu, Yayo, Snoochie boochies, <br><br>I haven't been here for brunch, but a few times for dinner. Their Monday burger special is great: You get their fantastic burger, a beer, and a small pour of bourbon.<br><br>Let's talk about their burger. Everything melds together well, from the giardiniere mayo to the B&B pickle. Burger was cooked properly and juicy. I need to talk about their pickles. They are brined in a way that you can still taste the cucumber with the vinegar brine. I feel like those pickles should go on every sandwich, burger, hotdog, whatever. They need to sell those pickles. <br><br>Another time I had the Pork Schnitzel sandwich. I was also happy with this choice. The pickled beet mayo was amazing. The one thing to note...when they say \"giardiniere mayo' and 'pickled beet mayo', it's not mayo consistency. There are actual chopped beets and giardiniere mixed in with the mayo. This makes a huge difference and it's delicious and purer tasting. I wish this sandwich came with those burger pickles. My friend who ordered the burger doesn't like pickles, so I took his and put the on the schnitzel sandwich and it was awesome. So if I order this again, I'm going to ask for a side of pickles.<br><br>I like that they have guest taps.<br><br>I have yet to try their mixed drinks. I'm a bourbon girl, so the Forbidden Old Fashioned is on my radar for next time.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KWS-e7i8AEy_w9aIzLOStg/168s.jpg", "caption": "Burger, Beer, Bourbon night"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/udNvfuw5mgwBnafOPFjBLw/168s.jpg", "caption": "Schnitzel sandwich"}]}}, {"review": {"des": "A friend and I came on a Friday night, and this place was fantastic for a chill night out! Although it was busy, we had 0 wait whatsoever for a group of 2. (A group of 3 had a 15 minute wait due to the tables available). <br><br>We started off with the flight, which was unexpectedly discounted to only $10. Our favorites were the Hoodie Weather and Winchester (the first and last). The ones in the middle were still drinkable, just a bit too refreshing for a rainy, coldish night. <br><br>My friend has a few dietary restrictions, and I felt that the waitstaff was really doing their best to be accomodating. She was able to get the vegan butternut soup and a side of fries. I got the burgers and fries, which were DELICIOUS. I could eat that burger as my next meal for the next week. SO GOOD. <br><br>Overall, the atmosphere is really perfect for a group of friends or a relaxed couple. It's not pretentious and you don't feel rushed to order/get out. Can't wait to come back!", "pics": null}}, {"review": {"des": "Forbidden Root, you make my heart happy. My husband and I live just a block away from this kickass brewery/restaurant and we don't let that go to waste - Forbidden Root is our go to. Not only are the beers delicious and unique, they also have fantastic cocktails and good food. <br><br>First things first - the beer. I have an unhealthy obsession with the sparking rosé ale (11.2% ABV!). I once got out of bed with the flu to buy a growler of the rosé ale before it sold out. The Dragon Zest is another of my current favs cause I love a good Belgium Tripel. Each beer is unique and there's something for everyone. Not into beer? No biggie, their cocktails are not to be missed! I had the Chili Maple Buck this weekend and it was this crazy journey of a sweet, smooth start followed by spice and a slight hint of bitter. I was really into it.<br><br>Now to the food: My husband and I always get the burger. It's big, juicy, and flavorful - definitely in my personal top 5 Chicago burger list. I could do without all the frisee in the optional side salad, but the fries are solid.<br><br>I'm also a big fan of the fried giardiniere (aka tempura pickled veggies), but it kills me every time that it costs $9 for 8 pieces! Seriously, 8 pieces?! That is the main reason that I am giving a 4 star review instead of 5 - it makes me unreasonably mad. Yet I still get them occasionally because they make my stomach so happy! Give me 12-14 pieces, or knock it to $5, and I'd get the giardiniere every time.  <br><br>This weekend I mixed things up and ordered the PEI mussels. I'd had them once a year or two ago and thought they were really delicious and surprisingly filling for a \"small plate\". The broth is really lovely and herbaceous, and I couldn't wait to soak it up with some buttery pieces of toast, like I remembered. However, yesterday, the mussels arrived at my table atop fries swimming in the broth! Two words: soggy fries. I was so disappointed that my husband was digging into this delicious burger and I was stuck with soggy fries. I finally asked for toast and pushed the fries to the side. Forbidden Root, get rid of the fries with the mussels. Sometimes classic is better. <br><br>As for dessert, I have yet to have the iconic Forbidden Root Float, but I did have their Hot Chocolate Pudding and Vanilla Gelato this weekend. That Hot Chocolate Pudding was to die for thanks to the whipped caramel on top. I'm not usually a caramel fiend, but damn that stuff was delicious. Pair it with the thick and addictive vanilla gelato, and you have yourself a perfect dessert.<br><br>Overall, Forbidden Root is one of my favorite spots in the city for a casual yet trendy drink or dinner. The restaurant can be loud, but it's got a nice vibe, and I love the high tops by the big open windows in the summer.", "pics": null}}, {"review": {"des": "I came to Forbidden Root with a friend for some beers and snacks on a weekday evening. The place is pretty big and loud, and even though it wasn't packed they sat us so close to another table that it was impossible to have separate convos. Luckily, they were cool and not total creeps! We tried the beer flights on special, and the ghost tropic double IPA was my favorite. We also ordered the Burrata which was so delicious we needed a second order. I will be back on a Tuesday for their wings and oysters special.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZidK2iPUEcxtUZS74lX-CA/348s.jpg", "caption": "Burrata"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9A_FtmnBV0F8Ob8OSumRWw/168s.jpg", "caption": "Beer flights"}]}}, {"review": {"des": "I'm giving this really a 4.5 as I don't want to ding our waitress to hard - you could just tell she wasn't in a great mood to start. We came for brunch to celebrate a friends birthday. I started with the sour beer (Space something, it's escaping me now but it was good). I finally decided on the burger for brunch and it did not disappoint. Giardinera mayo is something I didn't realize I was missing in my life but it really made this burger along with delicious salty fries. I would go back specifically for that. I tried a bit of the savory pancake from someone else and it was also amazing. I will definitely be coming back for brunch again.", "pics": null}}, {"review": {"des": "BEST BURGER IN CHICAGO. Don't pass this place up. I had a burger from here a few weeks ago and so when my friends and I decided to come here before a night at beauty bar, I convinced everyone to order the burger again. It did not disappoint, everyone cleaned their plates and was so satisfied. To top it off, the aesthetic is really cool and the beer is amazing too.", "pics": null}}, {"review": {"des": "If you love breweries you'll love this place. I'm not from Chicago but I love to explore breweries in new cities. Love the atmosphere and their beer is awesome.", "pics": null}}, {"review": {"des": "Burger & Beer Flight. Above all Else.<br>If you like beer and burgers head here.  One of the better burgers in the city, in my top 10, and there is hardly ever a wait. <br>The burger holds its shape and flavor through every bite - great burger integrity as I call it.  With a crispy bun and the perfect balance of ingredients are complimented with an out of the world patty.  The fries are McDonalds thin and crispy without that heat lamp staleness.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_urd42A4shgeaD3HS2ZFxQ/348s.jpg", "caption": "The Burger & Beer Flight"}]}}, {"review": {"des": "A great burger! Mayo giardinaira adds a nice level of spice and the cook was perfect. Spaetzle was also outstanding. Fries are fine but not as good as the rest. Beer selection is great and this a great place to bring kids.", "pics": null}}, {"review": {"des": "$10 lunch special = top notch!<br><br>A kale salad and half chicken salad on some kickass bread, what more might one need for $10!? Nothing!<br><br>Great service, excellent beers, chill vibe. I'll be back.", "pics": null}}, {"review": {"des": "Very nice decorating but music was too loud and tables too long to have easy conversation. Nice ambiance otherwise. Good food and drinks which were well priced. Just felt loud. Good for group of friends, not best for one on one conversion", "pics": null}}, {"review": {"des": "Forbidden Root is one of the two food/drink experiences on my recent trip to Chicago that would convince me to actually move to Chicago.<br><br>First of all, the location may look a little... umm... pre-gentrified, if you will, but once you step inside you are in a different world. This building used to be an old movie theater, and once you learn this fun fact you can instantly figure out where the projection room was, where the concessions were sold, and you can see the bones of the building all around you. For an architect/history junkie such as myself, this was a dream come true. We also got a little tour of the brewery in the back room (not sure if this is standard or because I knew someone) and it was very cool to see the works in progress.<br><br>Secondly, THE FOOD. Dude. Beer aside, this place is worth a visit just to eat the food. I was pleasantly surprised and not at all expecting food of this quality. <br>- Appetizers: Our group of 5 shared the gochugarou chili popcorn (and you will NEVER experience popcorn the same way again), the cheese pizza chips, and ... I could have sworn there were peanuts but I don't see them on the menu so maybe I was mistaken and they were something else. <br>- Entrees: I think three of us ordered the sea bass, and we all basically licked our plates clean. One person had the burger and gave it two thumbs up, and another had the roasted half chicken, which she shared with her boyfriend after he finished his sea bass. Deeelicious.<br>- Dessert: Just like with the apps, we shared our desserts. We had one piece of pecan pie and two Forbidden Root Floats (one virgin, one not so much). Both were good but the non-virgin Float was definitely better.<br><br>Last but certainly not least.... the beer. Now, I like beer. I am a fan. Really anything except hoppy stuff like IPAs. Forbidden Root knows its beer inside and out. I had a few pints of the Strawberry Basil Hefe and tried 3 or 4 of their other pours - all full of flavor and very unique. I was lucky enough to sample their Fernetic (collaboration with Fernet Branca) which is the only of its kind in the world. They also have pours of other breweries that align well with their beers and food, and work hard at giving back to their community and national charities supported by other breweries. <br><br>This place blew me away. Don't think of it as a brewery that also serves food. This is a unique restaurant with unbelievably talented staff and fantastic beer. I would be shocked if in a few years there isn't a Forbidden Root in every major city focusing on local botanical beers.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xXlR-g5c9eWPPh1WZgs1lg/348s.jpg", "caption": "Beer menu"}]}}, {"review": {"des": "I love a good brewery as much as the next gal but usually their restaurants are pretty no frills.  We picked up a Gilt City deal because I love their botanical beers but I wasn't expecting much from the restaurant.  As it turns out, Forbidden Root is...awesome.<br><br>From the moment we walked in, we were struck by the atmosphere.  I loved the high ceilings and the lighting.  It was so open and inviting.  <br><br>We started out with a couple of beers, the strawberry basil hefeweisen and the keine krumel.  They were both tasty and a great start to the evening.  Our deal was for dinner, a growler to take home, and a brewery tour but we found out early on that the tour was not possible.  Our server upgraded our growler instead, which did not make us sad at all.<br><br>For dinner, we had the N'duja sausage to start, followed by the mussels, sea bass and the chicken.  Everything was delicious.<br><br>I was pleasantly surprised by dinner at Forbidden Root.  I would not hesitate to go back, especially with a group.  The communal tables would be a perfect place to catch up with friends.", "pics": null}}, {"review": {"des": "Good:<br><br>- Beer selection is well done<br>- Service is friendly and on point<br>- Space is well laid out and inviting<br><br>Not so good:<br>The food. Tried 6-7 items with only the n'duja sausage and steakhouse jerky being acceptable. The rest were not tasty at all. Skip the fried giardiniere, the cheese/crackers, pizza chips, brussel sprouts, kale salad.<br><br>I want the place to do well but they have to rethink the food menu. In the meantime, stop by for a beer and save your appetite for somewhere else near by.", "pics": null}}, {"review": {"des": "The kale and spinach salad is to die for. The fried chickpeas really add texture and the dressing is super light and refreshing. It's $12 regularly but during lunch it's only $5. It's 99% vegan as they soak one of the toppings in milk overnight but I bet you could ask for it to come without whatever it is - I believe it was the fennel. Great selection of draft beer and the $6 lunch beer flight is a nice option.<br><br>I just met the chef and when he found out I was going vegan from vegetarian he brought me a cup of his vegan cauliflower soup - it was amazing! It's also on the lunch special menu for $5. What an amazing staff they have here, super informative and eager to please.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9S_p7pJ2bwZ4lx2wmYY4Og/348s.jpg", "caption": "Best dessert I've had in a while - chef brought me coconut panna cotta!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wOB84UlUCMTLD3XyHH36SA/168s.jpg", "caption": "Vegan Cauliflower soup $5 at lunch"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5mh1ugztO-zK1d6qme_8jg/168s.jpg", "caption": "Lunch - Kale and spinach salad $5 and $6 beer flight."}]}}, {"review": {"des": "We decided to have some dinner and drinks. It was a bit crowded and we had to wait about 35mins for a table but it was worth it.<br><br>They have very unique beers! We got a flight and I highly recommend trying as many as you can. They said that they change there beers on tap often so we can't wait to go back and try a whole new batch of unique beers. <br><br>The food was just alright but it was prepared well. I wouldn't come here just for the food however.", "pics": null}}, {"review": {"des": "I absolutely love this place. With so many choices in Chicago, it's hard to justify visiting the same restaurants.. but Forbidden Root... I have taken both locals and visitors here. <br><br>The beer, always bugs me when I see a beer with added flavours, but this place that won't do that to me, if they want to make a strawberry beer they'll add whole strawberries and botanicals into the brew resulting in this lovely effervescent beer that makes you feel like you juiced the whole dang fruit<br><br>The food, the burger should make those top burger lists in Chicago, the schnitzel sandwich also makes you happy, but one my favourite dish is the salmon dish, oh the lamb ribs made my friend drool... Their menu is seasonal and they *just* brought back a wild mushroom pot pie.. can't wait to try it<br><br>The service, the wait staff hasn't disappointed but the all star is Carlos, he gives such a fun and knowledgeable tour of both the brewery and the upstairs that just leaves you happier than before you stepped through the door.", "pics": null}}, {"review": {"des": "This place was decent. The beer was pretty good although I've had better from other breweries. The cheese and crackers plate was AMAZING. The cheese was so well done... and although they just use regular ole Ritz crackers, it got the job done. <br><br>All in all, a pretty good place. Have had better. Have had worse.", "pics": null}}, {"review": {"des": "Beer that I actually love to drink? Sign me up! I love love LOVE Forbidden Root. It's a West Town gem. The establishment is beautifully decorated. During the summer their nice big windows open up providing a fantastic breeze. Their beer is crafted using all natural ingredients and the taste is spectacular. Forbidden Root has a unique selection of rotating beers with various flavors. The beer flight gives you the opportunity to try their most popular beers. My favorite is the Sparking Rose Ale Biere Brut. They quite often sale out of it due to its popularity. The beer is tannic and dry like a rose. The hibiscus and Niagara grape juice causes this beer to have an elegant taste. The Food is amazing!!! I usually go to Forbidden Root for Industry night. Every Monday they serve a beer, burger and a shot of bourbon for only $15. The burger at Forbidden Root is one of the city's best. Will be back next week!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/H7D--RYYOYgbb63tR4336w/348s.jpg", "caption": "Beer Flight!"}]}}, {"review": {"des": "Wonderful assortment of beers and the hot chocolate pudding was to die for! Burger and brussal sprouts were both tasty.<br>I will be back to try more beers.", "pics": null}}, {"review": {"des": "The building and decor is amazing as they turned an old theater into a beautiful restaurant. <br><br>The food is unique and changes with the seasons. I tried the cream of mushroom soup and the wild mushroom pot pie. I may live mushrooms but both were amazing. The flakey crust on the pot pie was a delicious compliment to the insides. <br><br>Beers are amazing. The sparkling ale doesn't event taste like a beer. It's fruity and light. The me drink cookie is an amazing take on oatmeal raisin cookies. If you are lucky enough to be there while major label maple is tapped, you need this in your life.", "pics": null}}, {"review": {"des": "After first glance at the menu, I knew Forbidden Root would become my favorite Chicago brewery.  The \"botanical\" beers are all unique, and we had so much trouble deciding what to drink.  So we didn't decide.  They offer 4 oz. pours of beers, most of which are $2 each.  There were 11 botanic beers on tap, in addition to a few from guest breweries like Pipeworks.  Of the 11 beers, we tried 7.  Our 8th was a Pipeworks beer with passion fruit - excellent, but the guest brews are not needed here!<br><br>I loved 8/8 of the beers.  There's always a dud, but not at Forbidden Root.  And there's always a few in the flight that leave you going, \"what was that again?\" but NOT at Forbidden Root!  My husband liked 7/8 of the beers (his least favorite was the WPA, but he isn't a fan of IPAs anyway).  Here is what we tried:<br><br>* Sublime Ginger (a wheat ale with a lime and ginger flavor)<br>* WPA (Wildflower Pale Ale - IPA fans will love this one)<br>* Forbidden Root Extra (a TRUE root beer with bite!)<br>* Whole Lotta Love (a chocolate stout, delicious even on a hot summer day)<br>* Rye'z n Shine (a lemony saison)<br>* Purple Pils (a pilsner with lavender and violet - my FAVORITE of the bunch)<br>* Money on My Rind (a play on gin & juice and very tart!  I think this was my least favorite, if I had to choose one)<br><br>The interior of this brewery is stunning.  The dark leather tufted booths and rustic lighting surround a bar in the center of the establishment, and there are several tables along the windows which were open to the sidewalk during the nice weather.<br><br>Service was wonderful.  They were on top of filling water, clearing our dirty glasses, and it was pretty impressive that our waitress was able to memorize the 8 different pours we wanted.  It was actually easier to tell her what we DIDN'T want!<br><br>I could spend an entire day drinking here.  Good thing there's a food menu of snacks, small plates, and large plates.  We didn't try any of the food, but the beer stands out without it.<br><br>I almost forgot to add - they also have cocktails!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1RpD4ahXy3fixXUVDi9vGg/348s.jpg", "caption": "Menu 6/1/16"}]}}, {"review": {"des": "This review applies only to a visit to Forbidden Root for brunch. Overall, it was fine, but perhaps it's better to go for non-brunch meals.<br><br>First, I love the decor of this place. It's open, spacious and has great decor with some greenery thrown in. And on nice days (like the day I went), they open up the windows to let in the sun and air. Awesome. It opens at 11am and there was a crowd of people waiting to get in. We had a larger group so we were seated inside, but it was still really charming. <br><br>For food, the brunch menu is very limited. In that there are only about 4-5 brunch items on the menu, followed by a burger and perhaps one other non-brunch item. But sides are very brunch-friendly. I got the burger and it was great. Tasty, juicy and really nicely done. The coconut milk french toast w/pistachio gelato was also good, and the omelette looked tasty too. Most of us got coffee or a beer and those were fine as well. <br><br>The main issue w/my visit was service. It was slow, inattentive and just not good. Perhaps they were understaffed, but the woman who waited on us didn't come around much (unless to half refill coffee or drop food), and had troubles with the orders when we did put them in.<br><br>For groups of six (6) or more, there is 18% tip added (according to the menu) but when we got the bill, it was 21%. Our service barely warranted that, but okay. Then, we write out what to charge for each person and collected cards, and found out that the waitress rang up the amounts wrong (despite it written out), and that the credit card machine didn't automatically add the 21% tip, which we did the math on the totals to include. And then the waitress couldn't explain what the problem was, so the manager came over and cleared it up. <br><br>So, after all totals were refunded on the card for the original ring through, we had to adjust what to charge again, this time w/o tip. The manger was apologetic, which was genuine, but by then, we wanted to just leave. Food and drinks were good, loved the setting, but IDK if I would go back, at least for brunch. Hopefully it was an off day.", "pics": null}}, {"review": {"des": "Forbidden Root has one of the best burgers I have ever had. The flavors are amazing and the meat is excellent. Also, the gnocchi is delicious as well!", "pics": null}}, {"review": {"des": "This place was recommended by a friend of mine. I will give a review of the venue, food, and overall service.<br><br>Upon arriving to the venue I noticed that the windows slid open to give the feel of sitting outdoors on a patio if adjacent to the window. The day was beautiful and I loved the open feel. The venue offers a bar for seating, seating along the windows, and also open seating further in the building that reminds you of a modernized 1930's school cafeteria. Fairly sized venue! Ambience 8 out of 10. <br><br>The food dishes that I ate were the Malted Lamb Ribs, Burger, & Ora Salmon . I attempted to order the Duck Breast however they were out of the dish as well as the Beef Jerky. <br><br>The Malted Lamb Ribs were brought out first as an appetizer. The ribs were delicious but they weren't very hot, more like warm. Some of the portions were meaty and a few were more fatty. The glaze that was used was really good. The Ora Salmon, cooked medium, with rice was delicious. It was prepared a tad bit salty but I simply removed the skin and it was OK. I was interested in tasting the skin because it was prepared exactly how I like it, nice & crispy, but it's OK. Lol. Finally the Burger, cooked medium, was very delicious. Temperature was JUST right and the flavors were right. It was prepared on a bun similar to a pretzel bun. Overall food 8.1 out of 10. <br><br>For my beverages I had an IPA recommended by our second waitress, I will get to that, that was titled \"Death By Snu Snu\" a 7.6% knockout. This beer is sooooo tasty! Hints of Pineapple & Lemon. Definitely a great pairing with the burger! <br><br>The service initially was bad, bad, bad. We originally had a waitress, I did not get her name and apologize, that was nowhere to be found. I will be sure to write names when writing a review on subpar/great customer service. The place was not busy at all and we could not place orders and could not be told initially what exactly had been sold out. We also were not checked on like the tables were adjacent to us had been. Management must of saw this occurring and switched our waitresses. The second waitress was dead on. She was courteous, checked on us constantly, and actually recommended great beverages for me and the other diner. She saved the day and the review! Customer Service 8 out of 10.<br><br>Overall I would recommend Forbidden Root. However, I do wish the menu was a little more extensive, as you are limited; especially if they are out of anything that is on the menu. They also offer growlers to go, for any beer that they offer \"Death By Snu Snu\" (hint hint).", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eTqAIDJdn3A2GG3k63UEfw/348s.jpg", "caption": "Ora Salmon & Burger"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7IgqIXxs7NqPzb6vY8fgRg/168s.jpg", "caption": "Malted Lamb Ribs"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Oge1RTW6JDySpUIxBzVjnw/168s.jpg", "caption": "Death By Snu Snu! This 7.6% IPA knockout is a MUST try."}]}}, {"review": {"des": "The beer selection and quality was great. Food was ok. My main issue was the server. He was most of the time completely vacant and when he did come to the table he was rude and condescending and would walk off mid way we were talking! The manager stepped in to help with our table and he was fantastic. So kind and attentive and knowledgable but the other server had know clue. We waited over 20 mins for 2 drinks and when I asked him what the status was he said \"I suppose they will be over soon\". Also they would not split the check for us which I understand is policy in some places and that's cool. However he was super rude delivering that information to us and offered no help. We actually felt like we didn't want to leave a tip for him because he gave us an awful experience, instead we wanted to tip the manager as he saved the day !", "pics": null}}, {"review": {"des": "In a city full of exceptional upscale craft brewpubs, Forbidden Root is definitely my favorite. Every experience here has been fantastic. There's a varied beer selection and plenty of ordering options (5 oz glasses, full size, flights and everything else) to let you drink however you want. The food is top notch and noticeably more flavorful than most other brewpubs. Service is good and the bartenders are friendly even on crowded nights. For a upscale meal or just a lazy Sunday afternoon, Forbidden Root can't be beat.", "pics": null}}, {"review": {"des": "I don't like to write scathing reviews, I typically just sit back and watch the particular place go down on its own. However this particular place really has my blood boiling on numerous instances. <br><br>We came here on an early Sunday evening. I was able to make a reservation at the exact time I wanted which told me that this place would be empty. Upon arriving 10 minutes early I was correct, so we decided to sit at the bar which was almost completely empty. We did a quick eval of who was there and quickly determined the clientele was neighborhood (new residents obviously) who had brought their out of town parents. Every table was a young person or couple with their mom and Dad or one or the other. <br><br>We ordered a beer flight to share, popcorn and chips, that were \"sold out\" so ordered the lemon almonds instead. The presentation was embarrassing, I get better presentation from Diversey bowl. The popcorn looked like it was the end of the bag kernels that you would find at the grocery store. The almonds were a bowl no larger than the palm of my hand and literally just almonds soaked in lemon juice. The popcorn as well tasted just bland and undermined by the salt. <br><br>The bartendress took a little over five minutes to ask what we would like to drink. When we gave her our drink and \"snack\" order she took away the menus and gave us the flight. I then asked if we could place an entree order and she said sure. So we did, burger and snitzell*. They took over 15 minutes to come. When they did again the presentation was more, \"we don't have to bother because we were on Check Please!\", than, \"even if we were on Check Please we care about presentation\". *side note, they were literally playing that episode on repeat when we arrived*<br><br>The fries were the saving grace although scattered rather than presented appropriately. The burger was well down, and with its McDonald fish filet sauce just mediocre at best. The same with the schinitzell*, saving grace was the sauce. <br><br>The beer tastes like a ripoff of all the popular brands, blue moon, Stella, Chimay. A truly disappointing dinner to be had. <br><br>The end game was when we were about to leave. During the evening we watched as waitstaff scrambled and got mad at each other, at one point the Asian gentlemen waiter yelling over us to his friend about the beer. But the manager, as to be assumed in black button down and khakis, telling the bartendress verbatim, \"worry about your people and not so and so\".  Like dude, take her in the back, take her to the side. Owners/managers that have to get balls by demeaning people around customers don't belong in the service business. <br><br>Slap brewery on a sign outside and you think you're hot stuff. Get this place out of the neighborhood and over the Lincoln Park. It's the epitome of pretentiousness and doesn't even have good food or drinks to save it.", "pics": null}}, {"review": {"des": "Review for short Saturday afternoon stop in for a beer and a snack. I love this place's ambience, thoughtful and creative beers..I had a light tart refreshing gose and my husband had a NE style IPA. Both were solid. The cranberry bean 'hummus' was just ok....I think there's a reason why making hummus from cranberry beans isn't all the rage - it was thick, sticky and dry at the same time. The cumin dusting, evoo, lemon rind and currents help make it flavorful though. :-)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/a7K8--j9-CqBghqSJdDD7w/348s.jpg", "caption": "Cranberry bean hummus"}]}}, {"review": {"des": "I really enjoy Forbidden Root.<br><br>It's got a spacious interior, staff are friendly, food is pretty damn good, and the beers are actually decent. Certainly not the best beer out there, but still good on their own right. <br><br>This was my second time at Forbidden Root to catch up with a buddy of mine. It was midweek, and since we're both feeling old, decided on an early dinner for 6pm. <br><br>I'm thankful we did get there early because by 7pm, the place was packed!<br><br>I ended up getting their signature flight, which included the following beers: Sublime Ginger, Snooze Juice, Bayside High, Strawberry Basil, and Cola Brau.  I really liked Bayside High and Strawberry Basil. Cola Brau was pretty gross. My friend tried Impish, which was ok. <br><br>The food was pretty amazing though. We shared the Kale & Spinach salad, P.E.I Mussels, the hummus and the burrata. So good!<br><br>All in all, this is a great place for dinner in drinks. While I find their beers to be just okay, they're not bad. Go check it!", "pics": null}}, {"review": {"des": "My review is for the beer only but the food menu did look tasty. <br><br>Boyfriend and I were in the area and wanted to stop by for a beer flight. This place gets packed so we found an opening at the bar and stood there. Beer flight included the Cherrytree Amaro, Whole Lotta Love, Fig Dubbel, Sublime Ginger and Rye'z & Shine. The beers were good but none of them were memorable or blew me away.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jfRSq1792g56v7f-XJsD3Q/348s.jpg", "caption": "Beer Flight!"}]}}]}