{"name": "forno-rosso-pizzeria-napoletana-chicago", "reviews": [{"review": {"des": "If I could give this multiple 5-stars, I would! I have had some good gluten free pizza and some pretty awful gluten free pizza. And I'm a good snob. But this was HEAVENLY! <br><br>I have other celiac friends who get excited about gluten free pizza, and I was one of them, too. Basing the reviews upon the toppings and the fact the crust wasn't totally terrible. But they are all usually the pre-fabricated, flat, cutout 12\" crust. Forno is different. <br><br>It had the hand-tossed look, with the almost-sourdough flavor to it. Thin, doughy/chewy, crisp bottom crust, and full of flavor and CHEW just like a regular pan crust. I was blown away when it arrived to SEE the difference in it versus every other crust. It wasn't at all dense or dry. I went with simple toppings of fresh mozzarella, basil, and sopressata. <br><br>I don't think anyone can ever convince me that there is a better gluten free crust. A pizza is defined by its crust and this is better than even the regular crusts I recall from my pre-celiac diagnosis life. Delicioso!", "pics": null}}, {"review": {"des": "First I would like to thank Giorgio and his staff for the experience we missed so much from Italia. We spent seven years in Italia and found an oasis in Forna Rosso. There is no rush and the hospitality is amazing. The food is authentic to the Naples traditions. <br><br>The balance of  the perfectly fermented crust, wonderfully balanced sauce, mozzarella cheese so tasteful, topped off with an orange sparkling water and the family atmosphere and you have the  perfect storm for a great place to celebrate life.<br><br>Giorgio and his team at this location love what they do and it shows in in how they treat you coming in the door, the kindness and hospitality , great food for the stomach and soul. I am not sure how this place wasn't rated  higher but it is a-shame that people don't see the traditions and value this slice of Italian brings.<br><br>*We drove five hours for this and  and will be making the trip again*<br><br>If you want to experience Italia Forno Rosso is the place!!!<br><br>____Un posto per la famiglia!!!!!!____", "pics": null}}, {"review": {"des": "Food is amazing.  My second time this week. Bruschetta was the best I have had, so rich and flavorful. <br>We had pizza carbonara, amazingggg! The second is one from the white pizza list, hot but delicious, with roasted bell peppers. I loved every inch of it. <br>Tiramisu is fresh and creamy and fluffy. Lava cake is decadent soft and not too sweet which I liked very much. The gelato next to lava cake was so damn good, some kind of vanilla, but not cheap vanilla that you find in other places. This was tlreally good stuff, I ak not a big ice cream person, but that ice cream blown my mind.<br><br>As for service...during our 2nd visit...very very bad. Ocsana was our server..I am not 100% sure of her name..as one person got us water, second person got us appetizers and third person served us pizzas. She only brought a beer for my boyfriend. I asked for cappuccino, never got it. Also what crossed our mind is the table next to us..5of them, were seated 5min after us, but their girl got right away, taking orders, their food was way before ours. We got bruschetta and then 20min later we got pizzas. My cappuccino only appeared on the check of course. She didn't even check on us once. I had to ask another server to bring us the check. She was so nice. I wish I could leave her the tip. She revised the check..and quickly finish with us. Great girl. As for ours...I have no idea what happened there...<br><br>But the food is absolutely delicious. 5 stars!", "pics": null}}, {"review": {"des": "I've had this place on my radar for a while now with how high the ratings are. My husband and I stopped in on a Wednesday afternoon to try finally try their pizzas for lunch. We ordered a Locale pizza ($14) and a Capricciosa pizza ($16). I was expecting a nice crispy thin crust that was light and tasty. Unfortunately both pizzas were crispy on the edges and very soggy in the center. The waitress did say it would be soft in the center, but it was a soggy mess... We did not enjoy it, and it was definitely not worth the prices we paid. Sorry, but the pizza here just isn't for us and didn't live up to the hype. The waitress was friendly though, and the atmosphere is nice.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MxVLvaTJtq73z9RuCCWt3w/168s.jpg", "caption": "Capricciosa ($16)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WU13YY06Ir1epEpwvPbE8Q/168s.jpg", "caption": "Locale pizza ($14)"}]}}, {"review": {"des": "Went here for the first time and boy was I in for a surprise. The pizza is absolutely delicious, it is a must try. Calamari was outstanding. The service was on point. The ambience is a little loud so not good for elderly folks (our fault we went there at 9 PM) ... looking forward to returning!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JyQxVtOhmjKd0A5b34SOvw/348s.jpg", "caption": "Spicy pizza Yumi"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Lu78lly4WLHoSaUl-rB9rw/168s.jpg", "caption": "Sausage absolutely delicious"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jXzAjfvyI-nd7pyEktVmqw/168s.jpg", "caption": "Spinach and mushroom?"}]}}, {"review": {"des": "What an amazing place for pizza. I don't like pizza much but from Forno Rosso I love it. The neopalitan style pizza here is fantastic. The crust is thin and light. The red sauce is great. You can tell the quality of their ingredients is top notch. We come back almost every month.", "pics": null}}, {"review": {"des": "Super fan right here. Dough is perfection, so fresh and tasty. Love the extra flavor the wood-fire cooking gives.  The sauce is fresh...flavorful but not overly salty.  Toppings are authentic, fresh - real food not store/delivery type toppings!  Love the patio dining with cute lights.  Like the little neighbor it's in. Great parking options. Visiting from Orange County, CA., wish they had a place like this there.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KV63GF9Q7vnXG3qQBwzoRw/168s.jpg", "caption": "Veneto"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5KSmgdMVgJDUWi2YXCmQJw/168s.jpg", "caption": "Locals and Veneto"}]}}, {"review": {"des": "Ever the fan of crowdsourced knowledge to help me find amazing food, Forno Rosso is the well-deserved top rated pizza restaurant on Yelp for the Chicago area. Holy hell this pizza was good.<br><br>I started off with an order of the Spiendini, which was too much for me but portioned to share with two people. Presentation of this dish was wonderful. I don't remember the name of my pizza and apparently it's new enough to not be listed on their website, but I ordered a white pizza with mushrooms, black truffle sauce, and finely cut sausage. I had to beg my waitress to take it away from me to keep me from eating the whole thing because it was so good. The crust was napoletana perfection; chewy, well-flavored, and perfectly charred from the few seconds in the 900+ degree pizza oven. Between this find and the previous day's dinner at Bartucci's, Harlem Ave is where it's at for amazing Italian food.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/odUZuqAcT2R4x8RP2Ts1KA/168s.jpg", "caption": "White pizza with mushrooms, black truffle sauce, and finely cut sausage."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xG-0EZcTMOZ6C863Ub9L9A/168s.jpg", "caption": "Spiendini"}]}}, {"review": {"des": "Wow best pizza ever and i grew up in NY/NJ and now live in Chicago. I could eat this every day!! MUST try their truffle oil pizza it is hands down the best", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4MdZcfC818dPIxCD0wOi1A/348s.jpg", "caption": "Wow! better pizza than I had in Italy! The chef is a pizza maker from Naples Italy who is sharing his art here! So FRESH, crunchy, aromatic."}]}}, {"review": {"des": "I saw this place on Check Please and decided to give it a shot. Seemed like a good place for date night. Fortunately, The place lives up to the hype. The service was outstanding with attentive waitresses making great recommendations and the general manager Georgio stopping by to chat. From burrata to cannoli, everything was delicious. We wanted to try a red pizza and a white pizza. For red, we had the Tre Carne and for the white, we tried the special - the Pizza Bianca. Both were full of flavor. Cooked in a huge red wood burning oven, these Neapolitan pizzas are done in about 90 seconds. For dessert, we had the lava cake (pretty good) and the cannoli (excellent). I definitely recommend this place. Tucked away in the corner of a strip mall on Harlem Ave, this unassuming place is a diamond in the rough!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tQJ9Z2CUW3lnkIHwbbjyqQ/168s.jpg", "caption": "Cannolis"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vKKrbQwCV71F4360XfTIFQ/168s.jpg", "caption": "Tre Carne"}]}}, {"review": {"des": "I love this place! The fried calamari appetizer is fresh, crisp and NOT greasy. <br>The pizza is AMAZING!", "pics": null}}, {"review": {"des": "Love their pizza and arancini!<br>I would expect them to have fancy coffee and lattes but they don't. It's a cute place, their food is very good. They have an outdoor seating area too. Their deserts are delicious as well. They can accommodate large parties too. I come here a few times a year.", "pics": null}}, {"review": {"des": "Pizzas and salads are always delicious, love the specials and the wine list too. Great family atmosphere in an upscale modern designed space where the kids can see the pizzas made and going into the oven. Staff is always friendly and engaging. Save room for dessert and house made lemoncello!", "pics": null}}, {"review": {"des": "I came here with my fiancé for his birthday, since he loves pizza so much.  It's a casual, fairly noisy place.  The servers were nice and very quick.  For starters, we had the Arancini and burrata.  The Arancini were huge and very good, but they were slightly cold in the middle.  The burrata was also very good and was served with charred pizza crust.   I had the bufalina pizza.  It was very good.  The cheese was great, and the crust was perfectly chewy.  My fiancé had the tre carne.  That one was also very good.  If you drizzle the chili oil they have over your pizza, it gives it a great extra kick!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WAprKwGtxliOrfRfSefqsQ/348s.jpg", "caption": "Bufalina"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gFDS57CCIOIryfZMSveD-A/168s.jpg", "caption": "Tres carne"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WTu6n7L_OX0I-JTfAJIDEw/168s.jpg", "caption": "Burrata"}]}}, {"review": {"des": "My friend made reservations, so we didn't have to wait. The place was packed. Very nice. The staff was attentive and friendly. <br><br>Gave it 4 stars because the music was too loud and we had to almost yell at each other to be able to talk. <br><br>The food was good. Ordered a gnocchi as an appetizer. A red and white pizza. I liked the white better, but my friend liked the red one.", "pics": null}}, {"review": {"des": "I met my friend for lunch at Forno Rosso, which we had both been meaning to visit for ages.  We arrived shortly after they opened on a weekday and were seated immediately.  By the time we left, it still wasn't terribly busy.  The parking lot is small (it's in a strip mall), but that's not problematic during lunch time.  They also accept reservations on OpenTable, so points for me!<br><br>This was my newborn son's first Chicago outing, and I'm happy to report that this restaurant is family friendly.  It was a little tough getting through the door with the stroller though!  They happily seated us by a window where we could stow the stroller without being in anyone's way.  The bathroom also has a changing table.<br><br>We shared two pizzas, the Margherita and the Maiz.  The crust is wood-fired, so you know it's going to be good!  The ingredients were fresh and delicious.  It was hard to decide what to order, although many of the pizzas are similar variations of each other.  The Maiz piqued our interest since corn isn't usually thought of as a pizza topping, but it was so good!  I washed it all down with a Revolution pilsner.<br><br>There's a cocktail menu and a variety of beer and wine.  If pizza isn't on your mind, there are salads, sandwiches, and different appetizers.  But if you don't want pizza, why are you here?<br><br>At the end of our meal, we received a complimentary shot of homemade limoncello.  It packed a sweet, lemony punch.<br><br>I love Forno Rosso because it feels casual, yet classy, has a \"grown up\" menu and atmosphere but is still welcoming and family-friendly.", "pics": null}}, {"review": {"des": "My trip further west of Chicago area had me looking for 1) Italian food and 2) Polish food.  Check #1 off that list.  Sadly I dined alone but conversation would have been lost with may face buried in the pizza.<br><br>Parking was surprisingly easy in the little strip mall lot.  Sat down at the counter and ordered up a Revolution Eugene Porter...local craft brew, nice dark beer I never had before...good start.<br><br>Ordered a Rosso Diavola for the pizza.  My uncultured Indiana ass butchered \"Diavola\" at ordering but the Italian proprietor gently corrected me with a smile.  Great (thin) pie with a spicy bite and nice shot of fresh herbs.  So good and I probably could have had another.<br><br>Very likely won't be back this way for a long time but would certainly recommend if in the area.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/saxXuDF-uuUEIJqn5Fws4w/348s.jpg", "caption": "Rosso Diavola...bit spicier but really good."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uiOa7GDOJJN5h5XZgE-YDQ/168s.jpg", "caption": "Rosso Diavola...awesome"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZS6EebIX3TJQ7Khxo931bA/168s.jpg", "caption": "Eugene Porter"}]}}, {"review": {"des": "Thoroughly enjoyed my time here. It's interesting how the ambience of a place could totally make you forget how you're actually in a strip mall. Pizza was delicious. Grilled squid was great....but needed a tad more salt. Loved the pepper-infused olive oil. Tried to get the absolutely beautiful servers to reveal the ingredients...but to no avail. I will definitely be back!!", "pics": null}}, {"review": {"des": "When I hear my local neighborhood business owners talking about one of their favorite restaurants, I sit up and listen. Lucky for me FR has been on my list for a while--since it's write up on Check Please to be exact. <br><br>So me and pal Angela and her new beau (and by beau I mean cutie pie newborn) met for lunch.  <br><br>FR is set in a very cramped strip mall.  Since it was lunch, there were a few open parking spots, but driving by at night, sometimes that lot is superfull...but street parking is also available. <br><br>Everything on the menu looked fantastic--appetizers, pizza, salads, panzerotti and desserts.  There is a small wine and beer menu as well. <br><br>We split two pizza--The Margherita and the Maiz. Pizzas are cooked in their wood fired oven--set back in the corner, you can see the big red oven.   While I liked the flavors of the pizza and the ingredients were super fresh.  The pizzas just weren't served to us hot enough.  There weren't that many people dining and there was only one server, I never noticed if our pies were sitting out too long, but that was really my only gripe. <br><br>After our meal we were treated to a shot glass of their home made limoncello--which as really good, a little sweeter than what I've had before but still very good. <br><br>My affogato was also very good--a nice caffeinated pick me up. <br><br>Comfy seating, an open airy feel.  Can't wait to come back.", "pics": null}}, {"review": {"des": "Normally a deep dish or stuffed pizza guy here, but this place changed my pizza world.  First, the topping selections and combinations, including the specials, represent well thought, perfectly balanced flavors.  The pizzas take 90 seconds...yes, 90-freaking-seconds...to cook in their pizza oven.  Crispy crust on the outside and deliberately soft under the toppings.  Addictive.  On that subject, both the Nutella desert pizza and the Nutella topped fried dough are worth saving a little room for.  Yep, another place that will destroy my diet.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3fDcEmkPO0-qrODuUOZ1rw/168s.jpg", "caption": "Nutella deserts.  Save room!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xbaxEHNg2vD6JULKonbWJg/168s.jpg", "caption": "Perfect on every level"}]}}, {"review": {"des": "First time here and will be my last. We ordered an app, pizza, and gnocchi pasta. The app was the bruschetta and it was ok...the toast was burnt and that flavor carried through the whole bite. The gnocchi was cold and too soft. Not fully cooked. The pizza was soft in the middle as it should be, but it shouldn't be cold. Won't come back. Heard great reviews about this place. They're doing something right, but not for me.", "pics": null}}, {"review": {"des": "Best. Pizza. Ever<br>Their Neopolitan style pizza is simply amazing.  Their authentic style of pizza,  which developed in Naples Italy, even has the official blessing of Naples Italy. That's how good these guys are at their craft.  <br><br>Don't go expecting pizza that reminds you of regular Chicago style pizza pies.  They use a light dough that cooks in seconds in a super-hot specialty wood oven and they have amazing topping combos you won't find anywhere else.  <br><br>Couple that with the fantastic line of appetizers, desserts, cocktails and wines, all served up by extraordinarily helpful and attentive staff, and what is not too love?  <br><br>We had foodie friends from Europe visit - the sort who have traveled the world - and we trekked in from the far West suburbs.  They all declared it one of the best restaurants they'd ever been too, and we agree with them.  <br><br>And when you go, take a few minutes to stand and watch them work the oven.  It's right there in the main seating area and it's an open door oven.  Watching a pizza cook in less than 2 minutes is amazing.<br><br>No matter where you live in the greater Chicagoland area, it's worth the trip", "pics": null}}, {"review": {"des": "Great pizza. Salad and desserts are wonderful. Just doesn't need the pounding music   Light crust. But most beers on the menu were not available. Disappointing", "pics": null}}, {"review": {"des": "Stopped by for a low key dinner at the bar. Bartender was very attentive and made a great Cosmo. Shared a plate of bruschetta as well as a prosciutto and arugula pizza. Both were delicious. Great food, great drinks and great service. We will be back!", "pics": null}}, {"review": {"des": "The food is fantastic. Service was friendly and quickly. It' cute place. I love the pizza and burrata there.", "pics": null}}, {"review": {"des": "I've eaten a lot of pizza in my day and growing up in an Italian family, I'm very critical to pizza and the culture as a whole. <br>I have to say that they blew my expectations out of the water. Right from the start, from the service to the beautiful Forno Rosso where they cooked our pizzas. Giorgio the GM even came over to drop an extra dessert to our kids that made their day. <br>If you like pizza, you'd be a fool to miss this one!", "pics": null}}, {"review": {"des": "I've been enjoying the food and service at Forno Rosso for the past 2 years. This is a neighborhood place with a great Italian vibe. I love the authentic Neapolitan pizza, which isn't like traditional Chicago style pizza, as the crust is kind of chewy. I also love the salads and the appetizers. I love the calamari, it is always done perfectly. The only thing I've never tried have been the paninis or the panzerotti, but I saw them today at the table next to mine, and they looked fantastic! They really go the extra mile to be authentic. I've never ordered anything there that wasn't outstanding. This is pizza and Italian food the way it is meant to be eaten. Here's a tip: pace the meal by ordering your drinks and apps (or salad), then order the pizza right when you're ready to eat it, because their super-hot pizza oven cooks it really quickly! For an added treat, I highly recommend dessert and cappuccino: again, it's done right. I always feel like I'm at home at Forno Rosso. Try it, you'll like it, too!", "pics": null}}, {"review": {"des": "Wow very fast in about 5-10 minutes was ready, very delicious. thanks so much server Tatiana. recommend this place", "pics": null}}, {"review": {"des": "As usual Forno Rosso does not disappoint! Service was quick and efficient, and the food was FANTASTIC! I had a wonderful glass of Barbera and got a complimentary Limoncello!", "pics": null}}, {"review": {"des": "This is probably the best experience (at a not crazy expensive) Italian restaurant that I've had in the Chicago land area. The food is SO fresh, the owner was so pleasant and interacted with every single customer, and it was AUTHENTIC! It reminded me of when I was in Europe- not overly done, portions aren't too much to handle, fresh, delicious food and good people! I will definitely be back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tMp5WTNlI1bUpOFIFBiZ2A/348s.jpg", "caption": "YUM!!!!"}]}}, {"review": {"des": "If you are looking for the BEST gluten-free pizza, then head to Forno Rosso. We are SO happy we found this place --we three children with Celiac Disease, there are not many places that offer authentic Italian pizza that is truly gluten-free. Charming staff, attentive and kind. The regular pizza is awesome, too.", "pics": null}}, {"review": {"des": "Excellent hand crafted perfection! Had the Pizza Tartufo... ssg mushroom basil truffle oil white sauce. Add chili oil for some zing! Cool party trendy environment. Laid back and relaxing!", "pics": null}}, {"review": {"des": "Fantastic!! Tuscana salad with grilled chicken!! Yes and yes!!<br><br>Very good service. Outdoor area is small but easily seats 12-15 guests.<br><br>Can't wait to come back and try pizza and grilled octopus...yummy", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FL6pZvw_s8WD7wMX6gkcSg/348s.jpg", "caption": "Toscana Salad with grilled chicken."}]}}, {"review": {"des": "Pizza about as authentic as you can get, nice selection of Italian beers, friendly staff and free lemoncello shots to close the night <br><br>Took me awhile to go there after a few years of seeing it as my neighborhood has many random cafes, which i incorrectly thought this was. It's anything but that. Can't wait to go back.", "pics": null}}, {"review": {"des": "I haven't enjoyed pizza this authentic (and delicious!) since I was actually in Naples. Very fresh ingredients and a high-quality pie. <br><br>I have to say though: come for the pizza, stay for the limoncello gelato! That's the real winner. Incredibly bright and flavorful. Once again, I haven't enjoyed gelato that delicious since Italy. <br><br>The only reason I am giving this place 4 stars instead of 5 is because of its price point. For the portions, the prices are a bit steep. Add a bit more to the portion size (I'm looking at you, appetizers and desserts), and I'll be chomping at the bit to come back.", "pics": null}}, {"review": {"des": "Didn't try every singl pizza place in Chicago but Forno Rosso and few more places are for shure authentic. I used to live in Italy. Baked calzone or burrata you can not miss. Take out or dine in you can enjoy Napoletana pizza in two neighborhoods. Bricked oven pizzas as they should be. They also have patio during warm days. Pizzas prices can go from 15+.. but it is worth. You should eat pizza as they make it. And that is how it should be. Thin, crispy with good quality ingredients. In the end you have full taste. Bravo!", "pics": null}}, {"review": {"des": "We had the best experience at Forno Rosso. The food was delightful and the service was even better. We went around lunch time and it wasn't too busy. We had the olives, a salad, and the capriocciso (sp?) pizza shared between 2 people. They have a specific type of certification for the restaurant and it definitely shines through in their fresh ingredients. The espresso martini was delicious as well. We are just visiting but we will definitely be back next time around!", "pics": null}}, {"review": {"des": "Love this place. Great pizza. Dough has a great flavor. Owner always stops by to say hi. Toppings were wonderful on this burrata, tomato and rapini pizza. Looking forward to trying the Loop location.", "pics": null}}, {"review": {"des": "My 3rd time this week. To simply put it...this is the best pizza place around here...simply great, fresh ingredients, and that's pretty much it....people are nice and the owner is awesome.", "pics": null}}, {"review": {"des": "Excellent service with a great outdoor patio. We had an appetizer and pizza between the two of us. Lots of food...<br><br>Definitely worth the drive and sip of their cocktails after a long day...", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eSTyn0Yymb9TvPH-u6ZTig/168s.jpg", "caption": "Birthday Treat"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qggx-jMM0e9E1gJYthDILg/168s.jpg", "caption": "Appetizer"}]}}, {"review": {"des": "Ottimo posto for authentic italian pizza with ingredients from Italy. Place is clean with a lot of tiles on he floor and in the restrooms. Place is quiet and italian style. Food is amazing. Decent wine selection.", "pics": null}}, {"review": {"des": "We came here for dinner. The restaurant is in a small strip mall, consisting mostly of empty store fronts on Harlem and Waveland. It's located next to a convenience store. The good thing is the parking situation and they also have a small patio.<br>Three if us shared the margherita pizza and the ortolana pizza. We also had the toscana salad, which was delicious. The fourth person had the steak panini, which they liked. We preferred the ortolana pizza as the crust was done perfectly and the toppings were tasty. The margherita pizza was too soggy. [1 star deduction]<br>Also they'll tell you that pizzas are individual size, but we found that 2 pizzas were enough for 3 people. Especially if ordering a salad or appetizer. I had a glass of moscato, while the rest of my group got soft drinks.<br>Service was very fast and efficient; no unnecessary small talk. Food came out pretty quickly. The atmosphere was casual. Most of the patrons were European (Polish, Eastern European,Italian,etc). I wouldn't go out of my way, but if you are in the area check it out for lunch or dinner.", "pics": null}}, {"review": {"des": "Hands down the best pizza in the Chicagoland area. I don't say that flippantly; I've been all over this great land, had a ton of pizza & like to think I know pizza. (My mother was a Stromboli & my father was a Calzone.) It's brick oven pizza made with ingredients locally sourced or from Italy. They have a special degree from the Napoli Pizza Institute. (No joke) Honestly, it's the best pizza you are going to find outside NYC. (Don't start in on me with that Chi-town vs NYC pizza debate - born & raised Chicago - still, NYC wins hands down.) They make an excellent cocktail, as well. Finally, the service is top notch. The managers are friendly & will check to make sure you enjoyed everything. To be surprised if you receive a homemade lemoncello shot on the house. I can't recommend this place more.", "pics": null}}, {"review": {"des": "I come to this place with my boyfriend once in a while. Would come more often if we lived closer. Both of us enjoyed their capricciosa style pizza and the nutella one. I was intrigued when I heard of the nutella one since I love nutella on almost everything .Lol. It basically consists of nutella with slices of banana on top of their real European style pizza. Delicious! It's a big plus that they use the original hot oven. Service was quick and the waiter we had was knowledgeable and super nice. I will definitely be recommending this place to my friends.", "pics": null}}, {"review": {"des": "Delicious pizza. Italian style - thin and tasty. Different dippings. Enjoyed every bite. Come and enjoy", "pics": null}}, {"review": {"des": "Buonissima Forno Rosso! Bravi ragazzi and the ownership. Service was impeccable. I was very please on the happy and genuine  staff that waited on us. This place will make you feel like you have stepped out of Chicago into Italy.  All the details that go into the service and preparing the thin crust and sauce only a true Italian pizza lover knows.  Their West-loop location is as good, and a must!!! You'll find me there more because on the Randolph location.", "pics": null}}, {"review": {"des": "The porterhouse steaks a nice big potato any kind of vegetable to go with that and a side salad to go with them or you can have soup and their steaks are very very tender", "pics": null}}, {"review": {"des": "4.5 stars for my delightful Italian experience! Met up with a fun group of Yelpers to finally check out Forno Rosso. I'm not super familiar with this little pocket of Chicago/Suburbia, but I realized there is a good handful of Italian spots in this area! I can't speak for the other pizza joints, but Forno Rosso does a great job with their pizza.<br><br>Cute little spot in a strip mall. Parking lot is small, but I was easily able to snag a spot at 6:30 on a Monday. We had a reservation and our table for 10 was all set up on time. Our server was helpful and shared the specials. I wish he would have given us a heads up that he was placing orders on his iPhone, because I honestly just thought he was being rude! We'd tell him what we wanted and he didn't really respond or look up from his phone so that was confusing. Eventually he explained, but maybe a good idea to start with that next time :)<br><br>Moving on... food was delish! We started with grilled calamari and bruschetta. I really enjoyed the bruschetta, thought I thought it was a tad pricey for the amount you got. The calamari was really good too, but it was a little too charred for my liking. Not rubbering at all though! Really well done. <br><br>I absolutely loved my pizza. The crust was awesome - the perfect amount of crispy and doughy. I didn't mind the thin base because the outside was perfectly plump. I got the veneto which had asiago cheese, sausage, caramelized onions, and speck. Yum! $14.95 was a totally fair price for this delicious pie. I ate almost all of it, taking 2 slices home. To top this off I enjoyed some of the house red wine, which for $6 really hit the spot.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UWwD8kZ4-R8X452Pc7X1Rw/348s.jpg", "caption": "Grilled calamari"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1O1eXsZnPD0TIFR6uvAr8g/168s.jpg", "caption": "Bruschetta"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LK3Lxn7JDxVSqegDj89KZw/168s.jpg", "caption": "Veneto"}]}}, {"review": {"des": "I want here with my two girlfriends on a Saturday nights at 6:30 PM for dinner. We went here for dinner and when we arrived about half of the tables had people. Within the next 30 minutes the entire place was full and people are waiting to eat. I now know exactly why everyone was at this place. Our service was stellar! Our waitress was super attentive without being overbearing, very knowledgeable about the menu, and seem like a genuinely nice human being. We ordered the burrata, the grilled octopus, the Rengali pizza, and a salad with pear. Bottom line is the burrata and bread with arugula is out of this world!! I liked the octopus, but I didn't love it. I think it is more about me liking octopus than it was in terms of how it was prepared. I love the style of pizza here and didn't love the one we picked however I would definitely go back and get the pizza. The salad was beautifully presented and very tasty. It was my birthday and they brought out the most delicious cannoli-oh my goodness!! Don't leave without getting the cannoli-so good! I will most definitely be back!", "pics": null}}, {"review": {"des": "I am very particular when it come to pizza. This place by far is my favorite and the best! The calamari is also very delish if you like sea food.  Best bang for your buck. Highly recommend!!!", "pics": null}}, {"review": {"des": "Absolutely amazing. Simply put this is one of my go to's. I've been here 20 + times & never had a bad meal or experience.<br>One of these days I may need to visit the down town location.<br>Thank you Forno Rosso", "pics": null}}, {"review": {"des": "I love a place that gets great ingredients,prepares them simply and knows how to knock it outta the park! Forno Rosso is one of those places. Menu is not huge,but, pretty much has something for everyone.<br>We ordered the mixed grilled seafood appetizer. Grilled Calamari,baby Octopus and Shrimp,served over a bed of Arugula. Balsamic Vinaigrette and grilled bread on the side. No fancy sauce or condiments needed.We also ordered a Pistachio Pesto Pizza,half with Sausage,the other half without. The crust could have been a tad bit crispier,but,the flavor of this pizza was phenomenal.Not a lot of ingredients,but, they all played well off of each other.<br>Sorry it took me this long to go here,but, it will not be the last!", "pics": null}}, {"review": {"des": "I'm not a big fan of this style of pizza, but if you like brick oven, this is it.  My friend loves it, but I think its just what you like.  Atmosphere is nice!", "pics": null}}, {"review": {"des": "This the best pizzeria place,very tasty and nice service.thank you guys,you make people come back to you", "pics": null}}, {"review": {"des": "My first time here, and I really enjoyed it. They have a great location and everyone is very friendly. I was seated right away and my food was made quickly.<br>I got the arugula salad with grilled chicken breast. The dressing was amazing! I'll be back when I'm in the area again!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/J7g37ETp2ij-RrBQPit7QQ/348s.jpg", "caption": "Arugula salad with chicken breast."}]}}, {"review": {"des": "Excellent Neapolitan pizza, salads, and drinks. Pizza reminds me very much of what I had in Italy, with local fresh ingredients, nice char from the oven, and delicious sauce. I have found salads to be flavorful and well balanced. Calamari and seafood have excellent reviews from my family - makes me wish I was not allergic. The deserts look awesome but I have always been too full to try. <br>Service has been friendly and prompt every time I have been here; the owner has greeted us at least half of the times we were there.<br>Warning: This is not deep dish \"Chicago\" pizza. The crust is soft and chewy. Slices should be folded when picked up for eating - don't go there if you want a crust that cracks like a cracker.", "pics": null}}, {"review": {"des": "Wanted to try something different and glad that we did.  The imported ingredients makes it perfect.  It tastes so good and we will definitely come back again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/p6ISK4J2fDYzcOhgyD5wdA/348s.jpg", "caption": "Imported products from Italy.  Sooooo good brings me back to Italy"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iCXzWKNXJngNKydL6qM3Aw/168s.jpg", "caption": "Barese"}]}}, {"review": {"des": "Nice place. Great fresh ingredients in good rotating menu. Friendly staff and Also a decent bar selection.", "pics": null}}, {"review": {"des": "Very good pizzeria, my whole family love it. My favorite pizza is simple Margarita but so many places have it wrong. Only Forno Rosso has it best way))", "pics": null}}, {"review": {"des": "Back in Chicago visiting family for a few days, and we were looking for some pizza the night before my mom's surgery. Decided to check this out and we were not disappointed. This is not the Chicago pizza which I was originally seeking, but that's perfectly OK. There is a nice variety of options on the menu. I went for one with Kalamata olives and anchovies. The anchovies pretty much guarantee nobody was going to be sampling my pizza. That's their loss.<br><br>The pizza was great with a perfectly chewy crust and thin slices of mozzarella. Often there is too much mozzarella which takes over everything. Not this time. The Aperol and rum cocktail, which was reminiscent of the Aperol spritzers we found in northern Italy, rounded out the evening. All in all great food in a very welcoming environment.", "pics": null}}, {"review": {"des": "The calamari was not my favorite, but the pizza makes up for that.<br>We tried one red sauce pizza and one white sauce pizza. As well as the tiramisu. Everything was amazing and took us back to our vaca in Florence, Italy. This place is the real deal for pizza and we will definitely be going back.<br><br>Also, if you order pick up, they wait until you walk in the door to fire the pizza. It takes about 3 minutes to cook your pizza and ensures its fresh and hot.", "pics": null}}, {"review": {"des": "One of the best pizzas I've ever had. I love a true Neapolitan style pizza. We had the calamari, bruschetta , margherita pizza and tartuffo... amazing. Real Italian food should be fresh and simple and that's what every dish was. Also a really nice limoncello. Sip it and enjoy it. The owner or manager even came over and delivered the drinks and said hello, so welcoming. Will definitely be back!", "pics": null}}, {"review": {"des": "Forno Rosso is a Sicilian style, casual pizza restaurant, with a Chicago northwest side atmosphere.   This restaurant is famous for their hot oven, gourmet pizza recipes, and house made orangecello.<br><br>This is a difficult restaurant to review, because it combines two very different types of restaurant:  upscale Italian, with northwest side Chicago euro casual.   Dining at Forno Rosso definitely requires a reset of expectations.<br><br>Forno is famous for its very hot oven.   This hot oven in my opinion has advantages and disadvantages.   On the plus side, the outer crust of their pizza is absolutely out of this world.  But on the other hand, because the pizza is in the oven for such a short time, the inner crust at the center of the pizza is very floppy and in my opinion under-cooked.   It is almost impossible to eat the pizza here without a knife and fork, and if you try to pick it up, your toppings will fall right off.    In my opinion, this detracts from the experience a bit.<br><br>The proprietors take great pride in the sourcing of their ingredients and it shows.   The crust, the cheese, and the toppings are all good quality.    My party and I split three pizzas:  The Locale, the Capricciosa, and the Venetto.   All were good, though all suffered from the collapsing crust problem mentioned above.   I also felt that the pizzas were a tad too salty.<br><br>My favorite food item that we enjoyed was actually the salad.  The Fresca salad was the best use of arugula I've experienced in a long time.   This would make a fine meal in itself.<br><br>I also enjoyed the excellent Italian beer list.   If I lived in the area, I'd probably stop in regularly just for that.<br><br>Forno Rosso is a great neighborhood restaurant, and I enjoyed eating here.   Please don't confuse my 3 star rating with a bad review.   It's a nice place.   I just don't think the pizza measures up to the hype.   And ultimately the pizza is what I go by in rating a pizza restaurant.", "pics": null}}, {"review": {"des": "Good does not even describe this food. It's a masterpiece going into my stomache! Nothing could be better!", "pics": null}}, {"review": {"des": "Unbelievable salads and pizza - plus a complimentary tiramisu for our Anniversary-coupled with an attentive staff and a visit with the owner makes for a five star review.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WjkwWGXw5I6VMvkRGoONEQ/348s.jpg", "caption": "Unbelievable salads, and pizza coupled with an attentive staff and a visit with owner makes for a five-star review. Cheers!"}]}}, {"review": {"des": "Excellent pizza! Same as in Italy! Not cheap, but at least you're getting the real thing", "pics": null}}, {"review": {"des": "Rosa J. and hubby have been missing the wood-fired, Neapolitan-style pizza.  Our neighborhood pizzeria, unfortunately, failed to make it through the crucial first six (6)-month trial period for a newly-established local restaurant.  However, some time ago Rosa J. noticed \"Forno Rosso\" while riding the CTA #90 bus.  Of course she did her Yelp \"thang\" and had this place bookmarked.  <br><br>After work this evening, feeling \"famished\" accurately described Rosa J.'s state of being.  Driving to Forno Rosso shouldn't be too much of a struggle because free parking is available at the strip-mall lot.<br><br>Here are some useful measurements you may want to know: <br>1) each wood-fires pizza is a 12-inch size <br>2) a 12-inch size will be divided into six (6) slices<br>3) as a result, 12x12= 144 (square inches); 144/6= 24 (square inches for a slice).  <br>4) we need a dietician to calculate the calories for each slice. <br><br>Oh wait, before figuring out the calories for each slice so that you know how many hours you will be spending at the gym, I have to disclose the information on what kinds hubby and I had tonight.  <br>- prosciutto e arugula: the utilization of arugula should be a mandatory ingredient for any pizza.  The saltiness of prosciutto complements well with the naturally bitter taste from arugula.  <br>- capricciosa: artichoke+olives+mozzarella= absolute satisfactions.  Ok, I will stop with my nerdy equations from now on.  <br><br>To be honest, I will definitely order the prosciutto e arugula again.  Capricciosa was tasty, but I will opt for something else.  Two (2) pizza cost us $33 after tax.  We attempted to get a discount through the 5% off Yelp check-in offer, but George, the manager, respectfully explained to us that this was no longer valid.  <br><br>Manager George D'Anna did his rounds and stopped at our table briefly.  He chatted with hubby, gave his business card, and invited us to come back. <br><br>Other than the pizza menu, they have a wide selection of alcoholic beverages, wine, and after-dinner drinks.  Service was attentive and informative if you ever have any question on the menu.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/76Bedfqr3FRve8dIc3EyRQ/348s.jpg", "caption": "Prosciutto e arrugola"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0g87esviHl5z7dqW-U1A-g/168s.jpg", "caption": "Capricciosa"}]}}, {"review": {"des": "This is my favorite pizza in Chicago. Hands down. Should have come here before. <br>Ordered an arugula salad to start, really well executed. Not drenched in dressing, so you could actually taste the ingredients. <br>My wife had the gnocchi, as she does almost everywhere, and there were soft and delicious. I had a white pizza, and the balance of flavors was incredible. Cheese, sausage, olive and truffle oil in the right amounts so that no one ingredients would overtake the others. <br>To finish, we had espresso and tartuffo. Also, so delicious. <br>This is now my go-to for dining out pizza.", "pics": null}}, {"review": {"des": "Seriously.  If that's all I could leave as a review I would.  Most of you reading this are like what?  <br><br>Here is why I say Seriously:<br>Seriously amazing atmosphere <br>Seriously awesome service every time<br>Seriously the za is amazing<br>Seriously they make you feel like family<br><br>You get the drift.  Oh wait since we starting going here a year ago we seriously go there 2-3 times a month.", "pics": null}}, {"review": {"des": "I came in for lunch and we ordered the prosciutto pizza and the chicken panini and ordered my niece the Mickey mousey pizza ( which was the cutest thing ever) the food was amazing as always but for some reason my niece didn't like it. We asked the waitress if they had some kind of side pasta or something because she didn't like the pizza and there wasn't anything she would like. And we said it's okay never mind. The owner came to our table to give us the check and told us how he removed the kids pizza which was so nice because we wasn't even expecting that being that we didn't ask for it to be removed.. that's how u run a good business!! <br>Great place will be back:)", "pics": null}}, {"review": {"des": "I should've left my expectations at home for this one.  This place was rated 4.5 out of 5, I beg to differ because the 2 dishes I had were totally underwhelming.<br><br>Locale pizza:  kinda like a margherita pizza with sausage and mushrooms.  The server suggested that this is their most popular pizza... Why??? Although the server claimed use of local ingredients, this pizza was more on the bland side for me.  Perhaps more seasoning in their sauce and meat may be the answer but then I wasn't happy with the crust either.  It was soft and soggy in the middle making it impossible to pick up a piece... Ay Caramba!<br><br>My perpetual search for Italian pizza ends right here.  I realized it's mission impossible.  It's kinda like me going to Italy looking for the best Chicago style pizza.  I give up!<br><br>Caponata (appetizer):  it's like an eggplant and olive salad with sweet vinegar dressing.... the bread was so hard and literally hurt the top of my palate.  The eggplant mix is ok, nothing spectacular.  I wonder if it's better served warm.<br><br>I had 1 slice of pizza and 1 bread slice with the eggplant.  Needless to say, my appetite died along with my high expectations.<br><br>The service was great, the server was very knowledgeable and friendly, the price was way high, ambiance good, and variety of apps and pizzas were satisfactory.  I saw the beer and mixed drinks were priced at $12.  This place is way overpriced and way under-tasty.  Thank you for putting my search to rest Forno Rosso!<br><br>Prego!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WVzuNQXSAwqMjjczwG0sgw/348s.jpg", "caption": "Locale pizza $13.95"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KpR60bSHLu7Ob5p3ICGBkQ/168s.jpg", "caption": "Caponata $8.95"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Nacw7evPQHK-kvvmql2yRQ/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "I came for my birthday. Great food. Great service with complimentary delicious desert w/ a shot of lemon flavored vodka I believe.", "pics": null}}, {"review": {"des": "Great great great place. Frito misto was good, but my wife likes it fried just a bit longer. Ordered the Locale pizza without the mushrooms and it was delicious. My wife is picky when it comes to sausage on pizza but this, THIS SHE REALLY LIKED. Everything tasted delicious and fresh. Please take the servers suggestions about their Italian wine selection, very good. Would have have given them 5 stars before they went the extra mile after a mix up while boxing our leftovers. They made us a fresh pizza and a frito misto to go. Who does this that? AMAZING SERVICE! We heard about this place on Chicago Best, and live in the neighborhood, and don't know why we haven't been here sooner.  We will be back. Casual neighborhood spot with a wood fired pizza oven. Great Italian wines with exceptional service.", "pics": null}}, {"review": {"des": "Really awesome neapolitan style pizza. They got a pretty wide selection for you to choose from of either classic pizzas with tomato sauce or white pizza. They say their pizza only takes 90 seconds to cook in the oven, but that short time doesn't mean you'll be missing any flavor. Light eaters might be able to get away with sharing a pie, but most people should get their own and prepare to enjoy. They also had a dessert pizza I considered trying but I didn't pull the trigger; maybe next time.", "pics": null}}, {"review": {"des": "Clean and tidy interior in European style. All that we ordered was very tasty and fresh. I'll come back here again. Thank you!!!", "pics": null}}, {"review": {"des": "The pizza is consistently amazing and so is the service. We learned about this place last year. It's a 45 minute drive for us to get there and it's worth every second.<br><br>However, last night one of the TVs was set to a cable news station showing images of the school shooting in FL. We were there with our 2nd grader and one of his friends. Please, if you have the TVs on, let's all watch sports or cupcake wars. One of the kids wound up sobbing in his pizza he was so freaked out. We considered among the manager to change the channel, but we understand the older patrons at the bar may have been requesting the news.", "pics": null}}, {"review": {"des": "You talking to me? You, talking to me? You, you talking to me?<br><br>Yes, I am talking to you. Enjoyable meal that will knock your socks off... Ooooh! It's a meal you can't refuse. Leave the gun, take the pizza. (I'm out)<br><br>Again, a delicious pizza with ingredients and a chewy crust unique among local pizza places.", "pics": null}}, {"review": {"des": "If you want a gluten free pizza, you need to call 24 hours in advance according to the menu. I did not know this so was unable to try their pizza. The waitress said I would need at least 8 hour notice. I was disappointed, but really liked the salad I had. Also, the antipasti board was yummy!", "pics": null}}, {"review": {"des": "The appetizers, pizzas, cocktails and service are all fantastic!  Don't let it fool you because it is in a strip mall, this is a top notch destination.  Make reservations because they are usually busy.", "pics": null}}, {"review": {"des": "Favorite thin crust pizza in Chicago. Eating it with my wife almost every weekend. Neat interior, great staff even greater food.", "pics": null}}, {"review": {"des": "THE BEST traditional brick oven pizza I have ever had! I agree with another reviewer that the music was so loud we had to shout!", "pics": null}}, {"review": {"des": "Really good wood fired pizza. The crust is delicious and the toppings are fresh. Trendy low key spot. They have highchairs but they aren't family friendly per se: no crayons/color pages, only two kids meal options and they are just as expensive as the regular pizzas. The pizzas are more or less personal sized.", "pics": null}}, {"review": {"des": "I absolutely love this place.  I have been here 4 or 5 times.  The service is always great and the pizza is amazing!  We always get the margherita pizza and depending on the special we will order one of those as well.  The desserts are to die for.  It is a 35 minute drive from Glenview but it is well worth it!", "pics": null}}, {"review": {"des": "This is one of the best pizza I have had in a while. I think closest you can get to authentic Italian food. Service is also good.", "pics": null}}, {"review": {"des": "Started with a great glass of wine,then the grilled calamari appetizer which was just the right amount of lemon and tender as can be. Next was the gluten free pizza which was delicious. And the did the dessert pizza gf as well and it was chocolate banana heaven. Yum!  I will be back!  We had a great server as well. Don't miss their orangecello either!", "pics": null}}, {"review": {"des": "We just ate here today. Sooo good! 4 ppl, ordered 1 appetizer of bruschetta (4 pcs), and 4 pizzas (2 margherita pizzas, 1 locale pizza, 1 speck pizza). My margherita was great & everyone else said there's were really good too. Giorgio asked how our meal was and comp'd our table a Nutella-banana desert pizza which was also delicious. My brother just moved to the area so this will be a great spot for local pizza. I recommend!", "pics": null}}, {"review": {"des": "Pizza here is amazing! Once you have it, you'll probably crave it all the time. We also got the Nutella pizza and to my surprise, it was the most delicious thing I've ever tried and that's a big deal since I'm not big on sweets. I've recommended and brought so many out of town friends to this place and they all love it too.", "pics": null}}, {"review": {"des": "This was my first time at Forno Rosso. I read about it on Yelp and decided to give it a try. <br><br>As soon as I walked in I was greeted by a nice man, whom I assume was the manager based on his professionalism and guidance he gave to others. I told him I wanted to place an order for takeout. He showed me a seat at the bar and gave me a menu. The female bartender was very nice as she took my order. The manager asked if I would like something to drink while I wait. <br><br>Once I received my arancini and margherita pizza, the manager said good bye and wished me well. <br><br>Now for the food. The arancini were very good, except for the peas that I picked out because I've never learned to like them lol. They came with a marinara type sauce which was also very good. <br><br>The margherita pizza was very good. It's a little different than other margherita pizzas I've had, not better or worse, just different. Although it could have used just a touch more basil. All in all though, very very good. And that was after I drove home with the food in my car. I can't wait to eat there, food is always better when you eat there. It loses a little something during transport.", "pics": null}}, {"review": {"des": "Wow, I was really amazed...and still am.  I recently dined here with some of my lovely and delightful Yelp pals.  I think there were 9 of us in total on a Monday night.  Everyone enjoyed their meal.<br><br>The restaurant is in a little strip mall but we were lucky enough to find parking in the lot right by the door.  Score!  The place is on the smaller side, compared to some huge suburbs places, but it felt nice and cozy.<br><br>I had the grilled calamari appetizer which had a nice flavor and was not chewy.  Gotta love some good grilled calamari!  For dinner I went \"olives\" to the wall and got the special Rosso pizza.  The pizza had marinara, shrimp, mussels, calamari, and some other seafood that I forget the name of.  The pizza had no cheese but did have oregano.  Soooo good.  I am glad I tried something new.  The hubs had the Bianca special pizza.  It was a white sauce pizza with potatoes, prosciutto, rosemary, and some other stuff.  He like it too.  We were also happy to share a bottle of Montelpuciano (my fav).<br><br>Our server was very accommodating to our large group, including our huge paying debacle.  I forgot to bring cash (poop) and so did some others.  He let us split up the bill.  <br><br>Strange piece of information: the server used an iPhone to take our orders and show pics of food.  We live in a crazy world these days!<br><br>BTW, they can do gluten free crust with 24 hours notice and there is a 5% off discount with Yelp check-in.  Whoop whoop!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LRelohoaxyxS73TLJ6eefw/348s.jpg", "caption": "Gluten free with marinara, seppia, calamari, shrimp, garlic, mussels, oregano"}]}}, {"review": {"des": "So eight of us got together here tonight thanks to the UYE that Barbra put together (kudos and thanks, Barbra!). Had heard some great things about their pizza and this was a great opportunity to check it out.<br><br>They offer a variety of about 16 different pizzas, with options for further customizing if one feels the need to do so. Our group ordered the grilled calamari and the bruscetta. While I did not try the bruscetta, the calamari was pretty good, in both texture and flavor. Though at $11.95 for three good sized pieces, I did feel the order was a little stingy sizewise.  <br><br>Pizza time! I often order things that I'm familiar with when at a new place as a point of comparison. But the \"Affumicata\" was beckoning tonight - hot soppresata and bell peppers upon an imported smoked mozzarella cheese that was wafting with goodness. Priced at $14.95, this entree was a good value - six good sized pieces. Not really a fan of the wet, gooey part of the inner crust, but the outer crust was to die for.<br><br>Service was generally pretty good - I was one the fence about ordering a second beer, but since I was never asked, I didn't. It's nearby my place, so I plan to return. Probably closer to the 4.5 stars than four, but in the world of Yelp, there are no \"halfsies\".", "pics": null}}, {"review": {"des": "You don't expect this hidden gem by looking at their strip-mall location. Service was excellent and friendly. The pizzas came out very quickly from their 1000 degree pizza oven. They have local craft beer and craft beers from Italy. And best of all the pizzas were amazingly delicious with chewy crust topped with  local and imported ingredients such as the buttery creamy buratta cheese and the local sausage. Don't miss this place!", "pics": null}}, {"review": {"des": "It's a 3.5 stars type place for me. Good, delicious pizza but didn't find it to be great or wasn't wowed by it. Have had better. We had their Rosso Diavolo and Venetto pizzas. Both had unique taste and tasty flavor. The sauce on Rosso had the right taste in terms of salt, tang & sweet flavors. It was fresh however, I thought the pizza could've used a bit more sauce. The hot soppressata was cooked just right in the baking of the pizza and the crust had a good balance of crispy & chewy textures.<br><br>Am not usually a fan of Bianchi pizzas cause I love red sauce but their Venetto was pretty good w/ sausage, prosciutto, caramelized onions and Asiago cheese. It could've used red sauce if you ask me to make it even better. There was some lack of cheese on this pizza.<br><br>Overall, both the pizzas were delicious and not bad or anything. However, of what I have read and heard about this places pizza, I wasn't wowed or blown away by the taste. So for me it's good to try once but not a frequent visit place.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/c8wZrFrhj2EM5tkH-opnXA/348s.jpg", "caption": "Rosso Diavolo pizza"}]}}, {"review": {"des": "Beware, this place gets LOUD. Took my parents out to dinner and they were getting very annoyed having to yell across the (small) table. I don't know what it is about the way this restaurant is built that causes all the chatter to magnify and echo. I regretted bringing them here until the food came. The pizza is phenomenal. We also got dessert, which was delicious. My parents loved their tiramisu, which was served in a martini glass. I'd definitely be back, but maybe on a slow night. We enjoyed the food, but not the noise level.", "pics": null}}, {"review": {"des": "Words cannot truly express what a great dining experience!  The Rosso Strawberry Basil Martini was delicious. I had to have two!  Had the Arancini, Spiedini, Margherita pizza and Locale pizza. Everything was beyond delicious. Great wait staff too. We spent two hours eating, drinking and relaxing in a comfortable environment!  So glad to hear they just opened a location in the West Loop", "pics": null}}, {"review": {"des": "Excellent thin crust Napolitan pizza with a variety of topping choices. You don't like mushrooms ok no mushrooms. Place was packed on a Sunday night with good neighborhood crowd. Wine list is slim but well chosen. Good combination of local grown and real Italian ingredients like calico di cavallo. Va bene", "pics": null}}, {"review": {"des": "Last night we had a dinner here . It was amazing. We dine out very often and it's not that we are picky but always looking for a place with good food , moderate prices and warm service . That's exactly what this restaurant offers. I , personally judge Italian restaurant by quality of pizza and cannoli ( just not a fan of pasta ) and I am amazed  every time. Love the pizza. Love the cannoli . <br>Over all everything is great! And my personal advice Order your self a latte after meal.  Love it!", "pics": null}}, {"review": {"des": "We went to Forno Rosso couples of times during lunch. Their pizza are amazing and my Italian friend assured me that the  closest  you can get to a True Napoletana pizza in Chicago. The stuff is friendly, helpful and the service is fast. The prosciutto and arugula pizza is amazing! All the ingrididnts are fresh an you can feel it in the food. One of the best pizza places in Chicago!", "pics": null}}, {"review": {"des": "Was in town for a conference and found this place on Yelp. Each person in my group of 8 ordered a different pizza and all were fantastic. The dessert pizza was great too! Service was awesome and the GM stopped by our table to check in. I created this Yelp account specifically so I could recommend this place. Go here!", "pics": null}}, {"review": {"des": "Wow this is great. We called ahead and it was a misunderstanding with reservation but the owner made up for it. We had to wait but I still recommend this place the pizza is great service was good also.<br>He gave us a pizza con nutella", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/U24-hmxa3CwJWU0Wtp2w3w/348s.jpg", "caption": "Pizza con nutella   ....  So good"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZDkG_eGZOZ-Egy90_SEvIA/168s.jpg", "caption": "Tre carne"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/z4MtLN9_2Uvuppf4HQwGXQ/168s.jpg", "caption": "Bruschetta"}]}}, {"review": {"des": "By far one of my favorite pizzas in the city. I recommend the 4 cheese pizza. The spicy oil is good. Pizza is usually done fast. If ordering for take out, they may not make it until you arrive.", "pics": null}}]}