{"name": "friends-sushi-chicago", "reviews": [{"review": {"des": "The restaurant is VERY small and the tables are VERY close to each other. Be prepared to get to know your neighbors. <br><br>We arrived and were seated quickly without a reservation. Many people seemed to be picking up takeout while we were there. <br><br>The wait staff was tentative but the tables are rather small and they could have cleared the empty plates a bit better to make room. <br><br>They have the Shrimp Tempura appetizer and a Shrimp Tempura Roll, while I was ordering appetizers I asked for Shrimp Tempura but they brought me the roll. I guess I should have specified but I honestly didn't think about it. When I said something to the waitress she's apologized and said she should have asked, I was going to order them both anyhow so it wasn't that big of a deal. To be honest he Sushi was good but the Shrimp Tempura appetizer really didn't taste that great. I wouldn't order it here again. <br><br>Overall, t<br>he meal was good, nothing spectacular but I'd go again if I were in the area.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GKdqpwJVA6yLZxQqtnSy3g/348s.jpg", "caption": "Tempura Shrimp (Roll) and Salmon Sashimi"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xTiY7o04gSVl8MRG3HlBVA/168s.jpg", "caption": "PhillyRoll and Spicy Tuna"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sTt_8Ko3vaI2Wvt4kiBRGQ/168s.jpg", "caption": "Tempura Shrimp"}]}}, {"review": {"des": "Ordered delivery from this restaurant. <br>Wouldn't do it again. <br>Everything was packaged fine and the food was good but it wasn't anything special. I literally just got a Unagi Donburi that costed $26 and the bowl wasn't even full. The unagi itself was okay, again nothin g special but not terrible and it only came with some miso soup that was good. <br><br>From my experience: way overpriced. I've had really good sushi for cheaper than this.", "pics": null}}, {"review": {"des": "Walking in the restaurant, first impressions of the interior: it felt very avant garde with white tables and decor. <br><br>The Food: <br><br>So the day I went, I ordered the lunch special which included a miso soup, a sushi roll, teriyaki chicken, and rice. It was alright. I had the basic california roll which didn't seem like it was made on the spot since the nori was not as crispy as it could be. The miso soup was quite good. The teriyaki chicken was a bit underwhelming as the chicken was a bit dry and placed over some steamed veggies.<br><br>The service was good. Overall, it was an alright place, though perhaps the other rolls are a better option than the lunch combo?", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LthbYZQ6_TBCF8JIp0NYzA/348s.jpg", "caption": "Lunch Combo: teriyaki chicken and california roll"}]}}, {"review": {"des": "ordered calamari: just meh...<br>               vege tempura: good with nice selections of vegetable and good   <br>                                         portion for two people toshare<br>               delux sashimi: not impressive!<br>and both of us had stomachaches!!!<br>I won't visit again :(", "pics": null}}, {"review": {"des": "I came here on a Tuesday night, and it was wonderful! The ambiance is great, there is a plethora of rolls to choose from, and there are additional options if you don't like sushi. I got the \"can you handle it?\" roll, and it had just the right amount of spice. The miso soup was tasty, as well, and came with regular and spicy options. Overall, solid sushi spot!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/J2Tj1fvKwHLEEDimDrepWw/348s.jpg", "caption": "Can you handle it? Roll"}]}}, {"review": {"des": "After a long day of walking the Chicago streets, we were in the mood for sushi so we looked at some reviews and found this restaurant close by.  Upon entering, there's fairly loud music playing, dim lighting with a club like vibe.  After having a look at the menu, we couldn't decide what to get as there are so many options.  We asked the server and they suggested:<br>-scallop butteryaki<br>-salmon zen<br>-tuna lover <br>-sunrise<br>-rainbow.<br>While the food wasn't bad, it wasn't great either.  We expected much more.  <br>As for the service, it was relatively not existent.  They probably checked in on us once throughout the meal.  When paying, we asked for change but somehow that got lost in translation and when we asked for change again, the server said, \"we thought it was the tip, as it's the norm in American culture.\"  We were going to tip, just not that much but that left a bit of a sour taste in our k", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MDFi0KiObWAB072c_yAGPg/168s.jpg", "caption": "Scallops"}]}}, {"review": {"des": "Do not go! I don't understand why this place has 4+ stars. Such a small place with over 10 tables that the customers have no way to pass through. Noteworthy there are some DRAIN FLIES around the table/ on the wall. Does the owner know that there is evidence that drain flies can carry pathogenic bacteria???Won't the drain flies compromise the customers' health??? This is an extremely unsanitary place. Please be aware!", "pics": null}}, {"review": {"des": "Sushi was pretty good here. I thoroughly enjoyed the sashimi salad because it was very refreshing. They had quite a bit of sushi choices which I really liked. I wasn't a big fan though of how crowded the inside was. Another thing is, if you want a side of sauce they charge you $1. But otherwise, the place was nice and clean.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qiRGEsHDwjj_NUyeaxDtRw/168s.jpg", "caption": "Sashimi salad"}]}}, {"review": {"des": "Came for lunch, small atmosphere, great sushi! Started with dumplings which were okay, then got the devils roll and umi roll, both were absolutely delish! Finished with the Fujiyama roll, it hit the spot! Highly recommend this place!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Y1tW4It4C41ZiM57jAsvwg/348s.jpg", "caption": "Devil roll, umi roll"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IM2TM-JAetz8PyJgJYDEOQ/168s.jpg", "caption": "Fujiyama(sp?)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/A1rdifHE4uNDNj54T28C6A/168s.jpg", "caption": "Dumplings"}]}}, {"review": {"des": "Came here after a drunken night of Dave and Busters.<br><br>FOOD:<br>The Miso Soup was good. I mean, its pretty hard to screw up Miso Soup. The salmon yakisoba was poppin! the salmon was both moist and cripsy. I literally ate it all. including the little decorative leaf. <br><br>DRINKS:<br>The Sake was flowingggg because we had the company card. That said they had a great selection of Sake available. Both Hot and Cold<br><br>SERVICE: <br>I appreciated the waitress's patience with our larger group and drunken indecisiveness. They were able to seat all nine of us without a reservation on a Friday night. <br><br>ATMOSPHERE:<br>For what I consider to be a more intimate place in size, Friend's Sushi was very lively through our entire late-night visit.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vOFCFR-Bva7AL5RL6eeh1w/348s.jpg", "caption": "Salmon Yakisoba"}]}}, {"review": {"des": "Friends Sushi is definitely a top 3 sushi spot in Chicago - at first glance, it is easy to dismiss given the unassuming exterior on Rush Street, nestled between a few buildings. However, the interior is evocative of a few spots in SoHo NYC, cozy interior with a modern vibe. Service is quick and friendly as well, but reservations on a Saturday night are recommended (we saw a few groups walk away after realizing how busy the small spot was). <br><br>While the venue is busy, hip cozy, the food is naturally the true draw. For a group of 4, we ordered a few appetizers: the firecracker (really interesting mix), crab cake (real crab, not imitation and the aioli is so good), and the shumai (this was the most iffy in the group but I enjoyed it). <br><br>Then we ordered a mix of maki: the Can You Handle It (we could handle it and it was probably the best maki roll), the Umi (awesome but a safe cooked shrimp tempura), King California, Rainbow Maki, and Spicy Tuna. We ordered something like 7 maki rolls in total but given the taste, quality, and our collective hunger - we devoured the meal. <br><br>Happy I was able to introduce some fellow sushi lovers to Friends. Looking forward to my next visit already.", "pics": null}}, {"review": {"des": "I've been here twice, and if you love tuna (which I do) this is your spot.  They have a massive array of roll options --which I think is the main pull for many sushi-eaters-- and within that, a pretty substantial selection of tuna-only choices.  So lots of ways to have your tuna obsession.  <br><br>I had the tuna lover (duh), the Devil's tuna, the crunchy roll and the hot triangle.  A good amount of spice but nothing that totally overwhelmed your palate to the point of not being able to taste anything else for the rest of the meal.  Definitely had leftovers.  I don't live nearby anymore but absolutely worth a stop if you're in the Chicago area.  Absolutely on par with NYC sushi options and far better, I think, than anything else you'll get in the midwest.", "pics": null}}, {"review": {"des": "Came for dinner with colleagues on a Tue night. It was busy but no wait around 7pm. Dim lighting, modern decor, upbeat music, not very spacious but looks more cramped than it actually is.<br><br>Limited options for strict vegetarians and vegans. Soups have fish powder or fish broth, noodles have egg, etc. most things are pre-made so can't accommodate preferences. The edamame and vegetable Maki is about it.<br><br>Edamame came out warm, lightly salted and not soggy, which was great. I asked for an Avocado-Asparagus-Cucumber roll, which isn't on the menu but they made it. I had the Oshinko roll as well. Both were well made. I also had green tea, which was served hot like it should be, and they did a good job of keeping my cup filled up.<br><br>My colleagues had special rolls and both were pleased. They did comment that the fish was sliced much thinner than other places.<br><br>Overall, great food and great atmosphere. -1 star for not accommodating vegan and vegetarian preferences in menu items that aren't already vegan or vegetarian.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QSVbA9JoLKvZHcvtbbqObg/348s.jpg", "caption": "Drinks menu: wine selections (sparkling, red, Japanese plum); cold sake; warm sake; cocktails; beer"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rYi6bvUpRhGI-VPHGjfjEA/168s.jpg", "caption": "Menu: signature maki; raw maki; cooked maki; vegetable maki; hand rolls"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ap9GZYQs0mKJGnpcgBLKgg/168s.jpg", "caption": "Menu: starters; soups and salads; tempura selections; entrees; donburi; noodles; chefs selections; nigiri & sashimi; sides; extras"}]}}, {"review": {"des": "I try caterpillar roll at every new sushi restaurant I go to, and unfortunately the caterpillar maki at Friends Sushi did not impress me. <br><br>Unlike many of other caterpillar rolls I have tried, the blend of eel, cream cheese and sushi rice was meh. The crispy salmon skin was quite salty and stood on its own, the overall taste was not inviting enough for another bite, which is disappointing because I love caterpillar rolls! <br><br>The portion was generous and food was delivered quickly during lunch hours.", "pics": null}}, {"review": {"des": "A colleague recommended this place if I was in the mood for sushi while in town so I thought i would check it out! <br><br>The curb appeal is non-existent, very unassuming. Ambiance is intimate and trendy. It has a very \"lounge\" feel. Be aware that the actual space is quite small- I wouldn't suggest this place for a large group. <br><br>I ordered the Umi and the Sunrise rolls, both $16 each. The Umi was phenomenal. Would absolutely order again if I visit again and worth the price, in my opinion. The Sunrise was just okay and I didn't feel it was worth $16- more like $12. <br><br>The service was okay. It wasn't bad but it also wasn't great. I would definitely return if I was craving sushi in CHI.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7kPebbs3pe3xudpIxIyv9A/168s.jpg", "caption": "Umi Roll on the left, Sunrise Roll on the right"}]}}, {"review": {"des": "Very good service, fast, and clean restaurant. Good prices and cute restaurant. Great location and very tasty food. Next time we are in Chicago-coming back :)", "pics": null}}, {"review": {"des": "Sushi was very good. Appetizers were a little on the small size for what they charged.<br><br>My issue was the NOISE. Tables are crowded together and loud music the whole time. I left feeling tense and claustrophobic.", "pics": null}}, {"review": {"des": "Not bad for the sushi. <br><br>I got a California roll (because I'm basic and it's a good classic basic roll) and the Sweet and Spicy roll. I wouldn't say it's the freshest but it's also not entirely \"subpar\" in my opinion like other people say in these reviews.<br><br>I'd come back here for a \"quick fix\" but the thing that really gets to me is the price. the Sweet and Spicy roll was under their signature rolls but it's like two more pieces than the California roll (6 pieces for $7) and the same size but nothing....special about it. sure there were thin slices of avocado on top and some other stuff inside but for $15? no freakin' thanks. <br><br>Price-wise it sucks. Taste-wise it wasn't bad. Quality/freshness it was okay. I wouldn't mind coming back but I'll still try other places and be on the hunt for other sushi places to frequent.", "pics": null}}, {"review": {"des": "Came here for quick sushi takeout after work. I got a California roll and it was so good. I loved it and I would totally recommend it to anyone who is lookin for some good California roll. The service was fast and the girl at the front desk was very friendly ! Loved it.", "pics": null}}, {"review": {"des": "Sushi was fresh and delicious. The only complaint was that the restaurant is tiny and a little uncomfortable because of space.", "pics": null}}, {"review": {"des": "I was very impressed with the service at Friend Sushi, we ordered salmon carpaccio, scallop Butteryaki, salmon belly sashimi, Hmachi Belly Sashimi and Sweet & Spicy roll (substitute salmon with kajiki with a little up charge)<br><br>I think prices are not so reasonable with two drinks my total was $90.  Although I do understand for the area and location some up charge is expected...  <br><br>As far as the ambiance it's very cozy with table arrangements pretty close.  It's not your typical 6:30pm dinner rush kinda place, gets busy around 8 or 8:30!  <br><br>Over all it's worth a visit....", "pics": null}}, {"review": {"des": "I thought the sushi was decent. Here's the breakdown: <br><br>Devil's Tuna (5/5): Loved the white tuna cream cheese combo. This might have been my favorite one<br><br>Dragon (3/5): This is where I felt the quality was going down. Tasty but really mushy<br><br>Can You Handle It (4/5): Really bloody spicy. I guess that's expected when you have chili oil, spicy sauce, jalapenos, and whatever else they put in. Flavorful as expected but a bit of an overload. <br><br>Spicy Tuna (4/5): Good spicy tuna", "pics": null}}, {"review": {"des": "I came here with a good friend on a Sunday evening. We had a dinner reservation and good thing we did because it was busy! It sort of feels like you go back in time when you step in the restaurant. The dark mood lighting and the white leather seats feels very eighties but in a good way. The servers were attentive and friendly. You definitely sit very close to your neighbors.<br>I got the spicy tuna maki roll, which is my favorite roll of all time. I also decided to try something new and ordered the vegetable angel roll. It was a little spicy because of the jalapeños and had tofu inside and lots of veggies. It was different, delicious and a nice change of pace. The spicy tuna roll was one of the best I have ever had!! Would love to go back soon and order more rolls to share for the table. We also shared the edamame which was tasty.", "pics": null}}, {"review": {"des": "Great little place right off of Michigan Ave away from most foot traffic. I ate here around 5pm and they were able to seat me outside right away, which I was very happy about! I can't speak much for the inside, but the al fresco dining was exactly what I was looking for! Very friendly staff and prompt service. I'm a bit of a sushi snob, so that's why it's down one star, but it definitely hit the spot!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4OQ_J80fu0oxbl3pC0RalA/348s.jpg", "caption": "Black shrimp tempura maki and veggie tempura"}]}}, {"review": {"des": "The sushi or sashimi platters are a good way to try some different pieces of fish at once, although the deluxe sashimi platter that I had was simply average at best. The cuts weren't all that generous, and they were a bit warm too. <br><br>Rolls are a more dependable way to go. Then again, when you're serving a mostly gringo crowd, it's tough to get rolls wrong. Just fry 'em up or douse 'em with lots of goopy sweet sauce.<br><br>Service was reasonably warm and decent, and the space itself feels quite loungey. The average sushi and slightly elevated prices given the portions would warrant 3 stars in my book, but I would prefer that Friends pay a bit more attention to their overall cleanliness, whether dining surfaces or food preparation areas.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cx7vc38buJVlkOfRwLwaog/348s.jpg", "caption": "deluxe sashimi platter"}]}}, {"review": {"des": "Cozy, trendy sushi spot in river north one block west of bustling Michigan Avenue. Given the location, the prices do reflect the real estate but are certainly not over the top or unreasonable. Service is attentive and we were able to walk-in without a reservation on a Saturday night even though they were busy, which is a plus when you don't make reservations ahead of time in this foodie town. Sushi is fresh and they have some of the more common as well as specialty rolls. Not on the top of our list, but a neighborhood gem usually without a terrible wait.", "pics": null}}, {"review": {"des": "Pretty good sushi spot in the land of fancy hotels. It's small but cozy, good for couples or a solo seat at the bar but probably not for larger groups. There's a nice mix of raw and cooked rolls and tempura and other entree options as well. Service during my last visit was a bit scattered- I think I had 4 different servers. Crunch roll and dragon roll were both tasty- and I highly recommend the lychee martini!", "pics": null}}, {"review": {"des": "My favorite sushi in the city,hands down.Great quality for a good price,and the best for delivery when you're staying in.I have tried many different establishments,but i liked it the most.Like sushi,it's just here", "pics": null}}, {"review": {"des": "Although the food is good, I will not go here again. I used to go regularly and then I went two years ago and there were bugs all over the walls. I decided to give it a try again a few weeks ago and there were bugs on the wall again- so unappetizing. When I notified the waiter, they offered to move me to a table not near the table, not recognizing how unhygienic it was.", "pics": null}}, {"review": {"des": "This is not the best sushi in the city. The wasabi was a disappointment as well. It seemed like it was really old and had lost its spice.", "pics": null}}, {"review": {"des": "I was all set to bump them down to three stars based on my most recent dine and the one prior...but now down to two. Why? Read on! <br><br>The \"Tuna Lover\" \"specialty roll\" was quite small, ($16 no less) did not come with any sense of dijon balsamic (as advertised) and upon request, I was brought some type of liquid that added really no flavor to the roll. The fish itself was slightly dry and the wasabi was dry and crumbling...so that's hardly fit for a four star rating. As for wine selection, only one of several popular varietals ( i.e. only one Chardonnay, one Cab, offered) on the menu is hardly adequate.  I've also dined here a couple times since my prior review and was already leaning toward a lesser score and this most recent dine confirmed it. <br><br>The seaweed salad was the only thing that was actually wonderful.  <br><br>They slid further - from a three to a two star - when I looked at the app that I use to book my table they did not credit my dine - my reservation was no where to be found, even though I checked in at the hostess stand and my name was there on their screen. I find this sketchy - \"Friends\" uses a reservation platform and then didn't follow through and check me in. Seems they are not crediting the guest nor the app that brought them in. That's not so friendly now, is it? A shame too, I'm going to skip checking out their nearby second location.", "pics": null}}, {"review": {"des": "Delicious sushi! We stopped by this place on a Saturday night without a reservation and surprisingly the restaurant was pretty empty and we even scored a table outside. The staff was friendly, food was yummy, we didn't have to wait long to get seated or to get our food. I might be back in the future.", "pics": null}}, {"review": {"des": "This small little sushi place has some of the most amazing rolls I've ever eaten. I was recommenced this place when I traveled to Chicago and now I had to come back for a second visit.    Every roll is vey well crafted and all of the Maki rolls seemed like chef specials and our group devoured 10 of them. Highly recommend adding this place to your Sushi restaurant favorites.", "pics": null}}, {"review": {"des": "Great sushi spot, cool atmosphere.<br><br>Friends roll<br>Devils tuna<br>King crab<br>Unagi<br>Spicy tuna deep fried", "pics": null}}, {"review": {"des": "Food was decent, although sushi is expensive and small portions. 12$ for 5 pieces. They have lunch specials which are <br><br>There are tons of bugs on the walls...gross! <br><br>I had a beetle in my side salad...double gross! I told the waitress who was shocked and apologized. I ordered a side of edamame (2$) and they didn't charge me for that. <br><br>Ambience is very cool. But ultimately, I will not be coming back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/p-qT90YzsTWdtdi2o-W9XA/348s.jpg", "caption": "$12 shrimp tempura roll (5 pieces)"}]}}, {"review": {"des": "Hip little sushi spot! The decor here is very sleek and futuristic. Felt a bit crammed though. But I guess it kind of adds to the vibe. They have house music playing in the background as well. Glad we made reservations on OpenTable a few hours prior since it was pretty busy on a Saturday night. <br><br>We ordered the following items:<br>- Sweet & spicy signature maki<br>- Can you handle it? signature maki<br>- Fire wing signature maki<br>- Creamy spicy tuna raw maki<br>- Salmon nigiri<br><br>All of the rolls were pretty good, paired nicely with a Sapporo beer. They do have decent selection of makis to choose from. I would pass on the salmon nigiri next time though, felt like could have gotten better quality for the price elsewhere. My favorite roll out of the 4 was the can you handle it?, which had salmon, avocado, jalapeño, Japanese peppers, cucumbers, topped with unagi, mango, spicy mayo, and unagi sauce. Usually comes with cilantro too but I asked for it without. #thanksOR6A2gene<br><br>Anyways, the service here was fantastic. Our waiter was very attentive and friendly. Friends is a great place to come for a causal date night!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/m4bNXf5a-usFwETMzqg1yA/348s.jpg", "caption": "Salmon nigiri"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/E0r_nNfTDKGlqSwyUWErxg/168s.jpg", "caption": "Sweet & spicy, can you handle it?, fire wing, and creamy spicy tuna"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RarjWWcvGHQL4ylL3CkWDg/168s.jpg", "caption": "Sapporo"}]}}, {"review": {"des": "Called in an order late one night for a chirashi and a Devil's Tuna roll. The employee on the phone was polite and the order was ready pretty fast. I opted to pick up since ordering through Yelp actually goes through a 3rd party site that charges a fee. Picking up was easy and I really appreciated how compact & nicely packaged all the items were since I had to go home.<br><br>Devil's Tuna Roll: A wonderful combination of flavors. Their mix of spicy tuna wasn't too spicy but had just enough of a kick that let it work well with the creamy avocado and cream cheese. Everything about this roll was fantastic and I would get it again in a heartbeat. It's a bit pricy at $16 and unfortunately it isn't big enough for a meal (4.5/5)<br><br>Chirashi: I opted for the large chirashi that cost $29 which is pretty steep for a chirashi. However that'd be ok if the fish was good. Unfortunately the fish was relatively meh and the size was about what I expected. The selection was ok and included common and less common items including: salmon, tuna, ebi, hamachi, hirame, escolar, albacore, & ikura. The rice was also very bland. (2.5/5)<br><br>Overall Friends Sushi may be the place to go for rolls but I would definitely pass on the chirashi in the future.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/69vt5kDEEQSxTYTmN6WCTg/168s.jpg", "caption": "Chirashi"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UNy39NQCOfrxsYYegCh_8A/168s.jpg", "caption": "Devil's Tuna Roll"}]}}, {"review": {"des": "If you are a legit sushi cone sour .... not the place for you....<br>Take my word... the quality is not up to par... sushi bar sucks... I will not be back.<br>This is no negative for people and employees... everyone is nice and service is good... but bottom line for sushi gurus.... this ain't it...", "pics": null}}, {"review": {"des": "Clean food, great sushi with great selection of sake. What else you can ask for!!!! The place is cute and nice . The decor is really well thought. Their sushi is fresh. They have really great mixtures for sushi such as can you handle it roll. I could not lol , however it was so delicious. You can't go wrong with great spicy sushi and sake to go with it. Great service and friendly staff.", "pics": null}}, {"review": {"des": "What a cute little spot! Inside looks like a dark futurist lounge. <br><br>I would highly recommend making a reservation. There is a small sushi bar and about 6-7 tables with 4 of those being a 4 seater. Very small area.<br><br>They do however deliver and have take away if that's important to you.<br><br>Sushi was really good. I always do edamame but I did not enjoy it here. No flavor what-so-ever! <br><br>Also, tip for all sushi places, I wish there were pictures for each sushi roll. Would make it so much easy to order.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kbEXQoZrP3Arp17DrZUNVQ/168s.jpg", "caption": "Tiger eye on the left and dragon roll on the right"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NbTm_6hbMmTIdbWDzrQlGw/168s.jpg", "caption": "Umi roll"}]}}, {"review": {"des": "The sushi is sub par for its higher price tag and really even if it had more of an average price tag. Nothing to be wowed by. I also had tempura udon soup it tasted like it was in boiled water with afew shiitake mushrooms thrown in, really underwhelming. I just wanted a comforting bowl of udon on a rainy day and this one was just disappointing.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PCXGnsGqEncoOcF1gRg8xA/348s.jpg", "caption": "Underwhelming tempura Udon soup. Very bland...all of it."}]}}, {"review": {"des": "Very dissapointed. The rating on yelp was 4 so I thought why not try this place. Ordered the sashimi combo. Miso soup was good although it was a bit salty for me. I fee like some of the sashimi were not fresh since I could still taste those fishy taste, especially the tuna and the shrimp. <br><br>Also saw on the menu that you have to pay for extra wasabi. <br><br>Definitely won't be back.", "pics": null}}, {"review": {"des": "My husband and I absolutely love Friends. We stopped here after visiting a family member at northwestern years ago and make it a point to dine in as often as we can to enjoy their amazing Friends Roll. It is our go to sushi place in the city. Highly recommend.", "pics": null}}, {"review": {"des": "This place is so cute! I had the poke bowl and let me tell you.. they give you A LOT! I couldn't even eat my philly roll after that. I'm giving it a 4 star because their water didn't taste good and ordered a plum spritzer. The tables are very close together and I see the waiters and waitress we're having a hard time getting around. They could use different chairs for more space and they dimmed the lights dark enough to where we couldn't see our food.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CVgulByhw-nx174V94FCLw/348s.jpg", "caption": "Poke Bowl"}]}}, {"review": {"des": "Decent lunch spot.<br>The interior photos on Yelp are deceiving- place looks large and modern. I wouldn't agree to either.  Could use a bit of sprucing.  Maybe I was weirded out my the many gnats hanging out on the fabric walls. I don't think there should be fly bugs near sushi?<br><br>There weren't many people in here on a Monday at lunch, lucky for me because the service was relatively fast. <br><br>Really enjoyed the Devils Tuna. Don't usually like \"mushy sushi\" (ground fish with lots of mayo), but this mushy roll had great flavor!  Maybe it was the cilantro?<br><br>My tuna roll was just okay.  <br><br>House salad was also okay (ginger dressing was yummy - but they put waaaayy too much on).<br><br>I don't think I'd come back, nor did would I refer friends here. There are just too many other amazing food spots in this city!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/g7w01CWibTKe-RFq2E5M4w/348s.jpg", "caption": "Menu as of June 2017"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NpCz1FFWHrc3SBOCOSzNoA/168s.jpg", "caption": "Menu as of June 2017"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XZKWjln73jP5UsGMannMFg/168s.jpg", "caption": "Menu as of June 2017"}]}}, {"review": {"des": "Hands down the best sushi in downtown Chicago. You need to try the sashimi, it is the freshest you have ever had in you're life. Yes it is a little pricey, however you are in downtown Chicago.", "pics": null}}, {"review": {"des": "Is this place super fancy and bougie? No. Are there tons of places in chi that are? Sure. But this place's sushi is still 5 stars in my book. Excellent food. Clean. Not a whole lot of seating but the 2 times I've been here I didn't have to wait. <br>Large rolls that are filling, flavorful and unique. Service is great as well.<br>Ones we tried and loved (pictured):<br>Crazy winter <br>Can you handle it <br>Spicy Cali roll<br>Shrimp tempura roll <br>Creamy Tuna roll", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yS7bIxnvUgcfiB6mf10wkw/168s.jpg", "caption": "Crazy winter  Can you handle it  Spicy Cali roll Shrimp tempura roll  Creamy Tuna roll"}]}}, {"review": {"des": "Absolutely incredible restaurant! Amazing sushi and starters! The staff is very friendly and he management is top notch! Penny was a gracious host and make guests feel like they are family. If your in Chicago and craving sushi this is the place to go!!", "pics": null}}, {"review": {"des": "One night after shopping around the Magnificent Mile, my boyfriend and I weren't sure what to eat for dinner. We've come to Chicago to try new things and to get away from all the Asian food, but unfortunately it's a must for us so we ended up Yelping and Friends Sushi showed up nearby enough to where walking wasn't a big issue for us. <br><br>We came here around 7pm and the place itself was pretty empty minus 3-4 tables so we were able to snag a table right away. And here's where there is a missing star- because this restaurant seems like it is located inside a house so it is very narrow on the inside and not wide. They try to use up all the space available to them which makes for a very crowded room if this place was to be filled. Even just having a table sitting next to us caused some trouble trying to get out as we were seated next to the wall and had to utter some \"excuse me's\". <br><br>Now one thing that was good about them was the fact that their menu was relatively simple. We don't really like going to places that have an extensive menu as that could take a while to go through so we were happy when we were able to order things quite quickly around here. And food came out in ample time as well. I can't remember exactly what my boyfriend got other than their salmon belly nigiri and their hamachi nigiri, but I do remember us both being content with what we got so no complaints there.<br><br>And not completely sure how people feel about this next part but brace yourself- there is a TV in the bathroom. I will not lie, that is a nice change. And while I can't seem to imagine myself spending maybe more than 5 minutes in there, I do enjoy the fact that they thought of that because my boyfriend ended up staying in the bathroom for a good while just to watch TV. LOL. Loser. <br><br>Anyway, overall would probably come back if w were nearby again. Not sure yet as my boyfriend really do want us to break away from Asian food so we'll see.", "pics": null}}, {"review": {"des": "It's hard for me to rate this place because we could barely see what we were eating.  It was SO dark in there.  To take a pic of the food one of us had to use the flashlight on their ph while the other took the pic.  Everything tasted good.  But for me it lost some of the pleasure that I get when eating sushi, which is seeing its beauty.  Sorry Friends.", "pics": null}}, {"review": {"des": "If you're craving unique, flavorful sushi rolls, go to Friends! We came here on a Friday evening and got seated right away. The ambiance feels like a cool, modern bar. The waiting staff is very attentive. We ordered the Can You Handle It roll and a traditional Rainbow roll. The size of the Can you Handle It roll was huge! I recommend trying this if you like having a spicy kick to your sushi. Quick service, reasonable price. Will come back again!", "pics": null}}, {"review": {"des": "Solid food, just a very loud place. Not conducive to large groups but beyond that, really good sushi!", "pics": null}}, {"review": {"des": "June 2018<br>I am somehow disappointed today.<br>Return to the place and ordered warm sake, Delux Sashimi, ama ebi and finished with hot tea.<br>Given a bar seat was ok but the high chair was shaky. Usually sitting at the sushi bar has the best interaction with the chef but not at Friends Sushi. <br>Delux sashimi include a piece of ebi? That was the first. Two pieces of halibut was quite small. Disappointment here. No change on the shrimp head, still too much batter so you can taste the oil and now t crispy :-((<br><br>June 2017<br>Had 10 pieces of nigiri and warm sake for dinner which was just right. Cozy but tight place and waitress, Pam, was great with sweet smile on her face all the time. Only suggestion about the food:the portion of rice with Ama Ebi could be 20-30% less and maybe without the batter when frying the shrimp head. Overall, I enjoyed my dinner.<br>Improvement:<br>Make sure table is very clean;<br>Have all the necessary napkin and chopsticks ready before busy meal time; <br>Chef should watch out and not to throat sound or try to clean throat while preparing food ( one of the waitress and I both look at the chef when we hear that unpleasant sound).", "pics": null}}, {"review": {"des": "You know it's a great place with most of the staff speaks Japanese!. I ordered the octopus appetizer that was balls of stuffing with octopus. I also ordered some octopus sashimi and a couple of maki rolls. Everything was fresh and well seasoned. The service was great!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mhw12SL1YsiCR031yHh8WQ/348s.jpg", "caption": "street view - easy to walk by!"}]}}, {"review": {"des": "I just realized Chicago isn't even close to a body of water so the fish is probably not that fresh. 1 star. <br><br>Bonus 2 stars for my lack of geography knowledge, went here anyways, and only had a slight stomach ache after.<br><br>Not bad but never again will I get sushi in Chicago.", "pics": null}}, {"review": {"des": "This was my first sushi restaurant in Chicago, so it has sentimental value to me. But I feel the quality of sushi is currently only decent. Five years ago, I loved this place but now I'd only go back if I was in the area, for the fun decor and ambience combo.", "pics": null}}, {"review": {"des": "We've been looking for our 'sushi date spot' since moving here over a year ago. I think we finally found it at Friend's Sushi!!! Cut small modern restaurant. Super friendly service by both the hostess and our server. And yummy sushi loaded with tons of fish!!!!!! We enjoyed our night thoroughly and will definitely be back!! Of note, we ordered shumai (perfect!), seaweed salad and 3 rolls: You Can You Handle It, Fujiyama and Fire Wing. While they were all good, Fujiyama was by far our favorite, topped with tons of king crab. Can You Handle It had way too much cilantro that was a bit overpowering of the fish.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QK5PC-4FlNKUbEZ7adNvNQ/348s.jpg", "caption": "From top to bottom: Can you handle it, Fujiyama, Fire Wing."}]}}, {"review": {"des": "I've been on yelp for years now and have only written one review of praise before, but this service was so atrocious that I was compelled to write one. <br><br>My friend and I were thrilled to come here as it was the first result for BYOB sushi. Be warned, this place IS NOT BYOB. We spoke with our server and manager about the misconception and confusion and after spending a while talking she barely gave us a discount on the $20 corking fee. That's right, for most people going to a sushi dinner on a random Thursday the $20 corking fee is more than the bottle of wine. What's more is that the manager blamed it on us rather than being apologetic about the yelp confusion (which she had clearly experienced before).<br><br>Aside from that, the service was terrible. It took 2 hours for us to get 3 rolls. When asked for recommendations, the server told us their signature section was his recommendation (which is an entire page of sushi). Also, one of the servers never placed our order so we had to wait for another server to come by and ask what we wanted. Additionally, we didn't have soy sauce at our table so we had to get up to grab one from another table. When we got our own, we then had to ask for a second soy bowl because they only gave one.<br><br>Never experienced such horrible service. Will not be coming back which is a shame because their sushi is pretty good!", "pics": null}}, {"review": {"des": "I LOVE sushi but I don't get to have it very often...  I really enjoyed my meal here.  We came around 7:30 and had probably a 15 minute wait.  It was hopping there- only a few outside seats, so we were inside.  <br>There was a very helpful server who directed me in the direction of the sweet potato tempura roll and it was delightful.  I also had an asparagus roll- both of which were good sized.  My friend asked for their most popular dish- which was the Friend roll and she enjoyed it very much.  She had a Philly roll as well and we both had a very satisfying and tasty meal.  She ordered something called eel sauce (?) and said it was very good as well.  <br><br>I would go back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Jaa6nA28UfQm0uWbmq5a4A/348s.jpg", "caption": "Asparagus roll and sweet potato tempura roll- really good vegetarian selections"}]}}, {"review": {"des": "I've eaten here at least four times this summer because I'm a huge lover of salmon and sashimi so depending on my vicinity and cravings I would come in, sit down, get great service and pay their  higher prices.  You can get a much better value at other sushi places in Chicago but I'd still enjoy a maki or raw salmon dinner if pressed for time and this is a convenient location to go.  The portions here are small but the grade of sashimi is excellent.   I will not go out of my way to seek this place out because of the high prices but it is high grade sashimi and always fresh.", "pics": null}}, {"review": {"des": "Very cool little restaurant!  Super quick service and the sushi was great!  Little tight on space but that adds to the charm of the experience.  Order the fire dragon roll ...you won't be disappointed!", "pics": null}}, {"review": {"des": "Not overwhelmed. Prices are very reasonable - lunch specials are ample and between $15-20; service is average. Sushi is good, not great. I had the spicy tuna roll lunch special and the specialty Crunch & Cream ($10). <br><br>Ambience is bizarre - had the feel of a trendy coffee bar. Was a turn-off for me...better for friends (perhaps the name is appropriate) but I wouldn't bring clients here.", "pics": null}}, {"review": {"des": "TLDR;<br>Pros: Fantastic sushi options and taste, attentive and kind service<br>Cons: Tight seating so difficult for large parties (anything larger than 2 will be a struggle)<br><br>A great place for sushi but don't expect it to be super fast. The sushi options are vast with some that are specialties by certain chefs. The portion sizes for even one roll are pretty great, on average of 8 or so pieces per. Staff was constant in checking in on us and offering recommendations. <br>A great place with low lighting for dates and intimate get-togethers. Make a reservation for sure though!", "pics": null}}, {"review": {"des": "I was really craving sushi on vacation, so I found Friends Sushi on Yelp. We came for dinner. For appetizers we ordered agedashi tofu-I like this a lot because it was yummy and easy to eat because the outside didn't all come off when you tried to bite it-and the veggie gyoza (tasted like an average gyoza but I thought the veggie take was unique). I had the yakuza roll because I love tuna; it has soft shell crab, spicy white tuna (not too spicy to handle), avocado, and more tuna on top. It was delicious! They had many unique rolls-my mom got a beef teriyaki asparagus roll. It is a little pricey for appetizers and entrees, but I thought the food was awesome.<br><br>The service was quick-I also made a reservation on OpenTable. Also, inside, the seats are comfortable, but really close to each other. It's probably hard to get out of your seat when it gets crowded.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/P7K15mdo4wpZgLl09sJq0w/348s.jpg", "caption": "agedashi tofu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aHsax5ILy-6MrBWRgRMnpg/168s.jpg", "caption": "veggie gyoza"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BbY4FU1zndgli9c6_GmuYA/168s.jpg", "caption": "yakuza roll (spicy white tuna, soft shell crab, avocado, scallions on inside and more tuna on outside)"}]}}, {"review": {"des": "Came in for lunch based on the reviews. Service was terrible. Had the teriyaki chicken-it was like rubber. Won't be back.", "pics": null}}, {"review": {"des": "Seriously what did everyone order to rate them 5 stars??  We arrived around 5ish on Monday, the place was almost full (but that was because this place is so tiny). We sat there for 5 minutes before the server came to ask if we were ready to order. I'm sorry, our drinks weren't even taken and you asked me if we were ready to order?  I ordered A bottle of hot sake and asked for few more minutes on the entree. Few minutes after sake was dropped of, we ordered takoyaki for appetizer (3/5)- very small & nothing to write home about since it's all frozen food that needed to be heated up. For main entree we ordered spicy miso ramen (0/5), large chirachi (3/5) & king crab roll (0/5). Let me start of with spicy miso ramen. This had got to be the most confusing, worst tasting ramen I have ever tasted. The ramen got all kind of seafood (shrimp, squid, fish balls, imitation crab stick) and chicken. REALLY? The noodle was a cheap dehydrate egg noodle that you can get from local supermarket for $0.50/pack. The broth had no flavor whatsoever.  Judging by the way ramen was cooked, this place was not run by real Japanese people. Maybe the Thai restaurant downstairs had something to do with it) <br>Now come Alaskan Maki-$14(0/5). If you are going to charge premium then at least serve premium. The menu said king crab meat but was served imitation crab stick, not sure how anyone didn't know the difference. <br>This place is just a substitute to a Chinese buffet sushi if you are desperate. Otherwise go somewhere else.", "pics": null}}, {"review": {"des": "Friends is our go-to sushi spot, since we live a few short blocks away. <br>Pros: the menu has a decent variety, with lots of creative maki rolls. The sashimi is fresh, the plating is nice, and the service is friendly. The tempura udon is a delicious option too, especially on a cold winter's night.<br>My only complaints are about the ambiance. Our table of four was wedged in so tightly that we were less than a foot away from the next table. I could have easily sneezed on the food of the strangers next to me, or vice versa. It made for a awkward and uncomfortable dining experience. They need to expand or move to a bigger space.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WvF1iTs1kv1WrEL5y_AapQ/348s.jpg", "caption": "Sashimi deluxe below, with a variety of rolls above (rainbow, California, Friends, and avocado)"}]}}, {"review": {"des": "What an amazing sushi spot in Chicago! Details below:<br><br>+1 point for atmosphere and vibe. House music playing in the background makes it super hype and fun.<br>+1 point for the attention and service. Very attentive and nice waiters. Made reservation through Open table so waiting time was less than 2 mins.<br>+2 points for food - my favorite part. Ordered shumai (TWICE!), the Jazz, and Fire Wing sushi rolls. Both were FANTASTIC!!<br>+1 point for the sauces. Spicy mayo was off the chain!<br><br>Would totally come back before going back home.", "pics": null}}, {"review": {"des": "I visited Chicago and wander for great local restaurant. Come across, literally, to this restaurant while walking to find the Thai place next door. Immediately attracted to it by the great outside and atmosphere inside. <br><br>They said the wait could be 30' because the place is quite busy and packed with dine-in and take out customers<br><br>The food is great, and the waitress is attentive and gentle. They are a bit slow to come out with orders. But all forgiven due to the fact that she does comes check on us and reassure that the food is coming out soon. <br><br>The place seem to operate by a group of friends as they all look the same age, and are all hands on helping with the restaurant. <br><br>We enjoy the decor and the comfy chairs. It is a bit crowded and is a little dark. But your table it lit with real candlelight and fresh flowers. The price is affordable and reasonable for sushi. <br><br>I will definitely comes back to this restaurant next time visiting the city.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Bmmok1JC99MG4kdR0Z5PCA/348s.jpg", "caption": "Perfect count of sashimi with side rice"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Gmkk9CPVPQKWrVjaRRneOg/168s.jpg", "caption": "Octopus for days"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jSCfldU9tu6w0GiJUNHf8A/168s.jpg", "caption": "Great appetizer"}]}}, {"review": {"des": "Went here yesterday with a friend and it was ok. <br><br>I'll start with the decor. I really liked it. It was swanky and chic. However, if you came on a busy day it would be a mess because everyone one would be piled next to each other. Luckily we came during a not so busy time. <br><br>The food ....eh. Nothing impressive. I ordered the Spicy Miso Ramen. The broth was not flavorful because it was over powered by the jalapeños and spicy oil they put in it. Also, they used angel hair noodles I was not feeling that at all. <br><br>Then I ordered the Fire Dragon Roll which was again ok. Listen, I'm a sushi addict so I know good sushi when I taste it. This did nothing for me. <br><br>To wash everything down I had the Mango Martini. I enjoyed that the most. <br><br>Unfortunately I won't be in a rush to go back to Friend's Sushi. I came here based off the reviews and I should have gone to a location I'm familiar with. I know tons of cheaper and tastier places in the city.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/C7p-SVjv2At1N7l2IrlXWg/168s.jpg", "caption": "Spicy Miso Ramen"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DUbX1OFjdcxY161Q1U3X3w/168s.jpg", "caption": "Fire Dragon Roll"}]}}, {"review": {"des": "My favorite sushi place so far! <br>So good! <br>Great vibes, delicious food, beautiful hardworking staff, nice service!<br><br>It's a must while in Vancouver!", "pics": null}}, {"review": {"des": "Cool modern little restaurant. Good service, good food. We tried to friend roll which was interesting with the apply and the can you handle it which owns up to its name... SPICY!", "pics": null}}, {"review": {"des": "So good! Ordered take-out and didn't get to eat it for over an hour, but it kept up great. We got seaweed salad, spicy tuna maki, fire wing maki, big friends maki, jazz maki, and hot triangle maki. Would definitely come again and recommend to others. <br><br>Hey Friends - open up in Lakeview. We'll be there.", "pics": null}}, {"review": {"des": "I was pretty shocked when my boyfriend--who is NOT an adventurous eater by any sense of the word, and has only had sushi once, and it was mediocre at best--decided that for dinner on our last free night in Chicago, he wanted to go to Friends Sushi. <br><br>The wait was only like ten minutes, and then we were sat.  It's a fairly cramped space, low-lit, packed with kidney-shaped tables, and blasting EDM music--and I mean blasting.  We had to borderline yell to hear each other.  The service was decent, I suppose.  They were crazy busy so it always took awhile for the server to come by the table, but we were pretty chill without him.  The miso was standard, but my boyfriend got the spicy miso and it was out of this world.    NOT for the faint of heart, though; it even set my lips on fire and I grew up on spicy food.  We each got a specialty roll and they were both delicious.  We also polished off two bottles of sake between us, which my boyfriend was delighted with--he'd never had sake before.<br><br>All in all, it was a very good experience, and next time we're in Chicago, we may well go back.", "pics": null}}, {"review": {"des": "Visiting from out of town and found this place! Amazing amazing food! I highly recommend the devil roll and the umi roll. Great atmosphere, definitely a hidden gem", "pics": null}}, {"review": {"des": "My favorite item was the crispy river shrimp! Overall the food was tasty, nothing out of the ordinary. However this establishment get awesome marks for chill vibe and price.", "pics": null}}, {"review": {"des": "My husband and I came here with another couple as our first meal on a Chicago weekend getaway. It was 9:30pm and they were still pretty busy. The guys got an old fashioned and said they were amazing. All of the food was delicious and the atmosphere was wonderful. The wait staff was attentive, accommodating, and courteous. Per couple we got out of there around $75 before tip. A wonderful way to end the night. So glad we found this place!", "pics": null}}, {"review": {"des": "I was nearly crying while eating the \"Can You Handle It\" but it was worth every spice-induced hallucination that followed.", "pics": null}}, {"review": {"des": "I love this place!  Amazing music and food is just delicious ! Choices of non sushi items as well like ramen and teriyaki. I could hang here all day and work through the cocktail list.", "pics": null}}, {"review": {"des": "Friends sushi is a friend indeed. I especially loved that this sushi spot is in river north- those are hard to come by! Very loungey and slightly hidden, but still filled with people because of its popularity. Service was great and timely also.<br><br>I ordered the fire wing roll and the seaweed salad. Both excellent choices- so fresh and thick. My friends also enjoyed their rolls as well. Some Asian beer to wash it down was also nice on this Sunday evening.<br><br>I would highly recommend this spot before going out in river north if you want some fancy sushi! Otherwise it's also good for a casual meal.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6T9NOn3yScveC_A-2N-73Q/348s.jpg", "caption": "Fire wing roll, seaweed salad"}]}}, {"review": {"des": "The sushi was on point and affordable! By affordable, I don't mean $6 per roll. It's cheap for River-North at probably $14 per tool. Nevertheless, my friend and I had a great time.<br><br>We ordered edamame that was soft and came out in a timely fashion as did the rest of our food. Another food highlight for me was the salmon skin which can't be found just anywhere. All of our rolls tasted great!Overall, it was a decent experience.<br><br>However, the restaurant felt crowded due to a small space and high concentration of tables. A middle aged couple were seated next to us with their toddler and I felt like they were actually just at my table. We struck up a conversation but I'd imagine if you were trying to be intimate, it'd be weird.", "pics": null}}, {"review": {"des": "A cozy place and intimate atmosphere! That's my first impression of it. I loved the food that we ordered. I was impressed with the taste and the presentation. The fried veggies that came with my udon was fantastic. You could feel the crunch of the fried flour followed by the soft texture of the sweet potatoes, pumpkin, or broccoli. They just melted in your mouth. We ordered too much so we packed them up and had them again for breakfast. To my surprise, the sushi still tasted good.", "pics": null}}, {"review": {"des": "Sushi was OK and atmosphere was nice, but what ticked me off was the customer service. It all started when we were waiting for a table. After waiting maybe 20 minutes, a party of the same size got seated before us. We proceeded to inquire about our spot in the line, the staff discussed amongst themselves, and they seated us immediately, which to me indicated that they forgot about us. Upon getting seated, I wasn't given a real chair but an ottoman instead, so I requested a chair but they said they didn't have enough chairs. Safe to say the dinner wasn't off to a good start...", "pics": null}}, {"review": {"des": "Really good fresh sushi.  It is a more expensive meal but sushi always is.  The slices of sashimi are nice and thick, they definitely do not short you on the food.  There are a lot of good rolls as well my favorite is the summer role if you are looking for something light refreshing with a lot of flavor go for that one.  Also had the caterpillar role and several others that had the tempura flakes on top and all were delicious.  The miso soup and the wasabi pork shrimp appetizer were good as well.  They have a decent wine and beer selection.  We finished our meal with the hot sake.  The place is a little small so make reservations if going during a busy time", "pics": null}}, {"review": {"des": "YES! <br><br>Visiting Chicago, I wasn't sure what to expect when I saw a highly rated \"trendy\" sushi restaurant on Yelp. I am veeery picky with my sushi. But, Yelp came through!<br><br>Friends Sushi is so good! I highly recommend coming here to get your sushi fix.<br><br>Upon arrival, Friends looks dingy outside, but once you open the door, you're transported. The atmosphere is very intimate and chic. It's the perfect date spot.<br><br>We ordered a whole bunch of nigiri, house rolls, udon, miso, salmon plate and house sake. Everything was so fresh and beautifully plated. Vibrant in color and tasted great. Service was exceptional. Their house sake is one of the best I've had. It wasn't overpowered by a rubbing alcohol after taste, like most house sakes are. It gives a good buzz and warms you up from the cold. If ever I'm in Chicago again, without question I would go back to Friends.<br><br>Overall, incredible experience.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8VxH9NE4X0g-cWio1Wr1Uw/168s.jpg", "caption": "Salmon plate"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BzHpF7U-Sfaau-Mjv3RtZg/168s.jpg", "caption": "Miso"}]}}, {"review": {"des": "This was my first time at this restaurant. I highly recommend this place. We went there and ordered to go. The wait was about 15-20 minutes. We ordered the following rolls:<br><br>Can You Handle It?<br>Umi<br>Spicy Grilled Squid<br>Tiger Eye<br><br>All of them were good. They were fresh and very tasteful.<br><br>The only improvement I would suggest is making their website more user friendly. We tried to call and order in advance and go pick up but it was hard to read the menu online and much easier to get there and get a menu to review there.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WA1Hi4lJ1d8o7AaSQB6Tmg/348s.jpg", "caption": "Umi"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/T3P3Mt3zS-8erJY9aI1rag/168s.jpg", "caption": "Spicy Grilled Squid"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LTs7UXT3XPdK9tf0I3VtBg/168s.jpg", "caption": "Can You Handle It?"}]}}, {"review": {"des": "Visiting Chicago and had a craving for sushi. Not knowing the city, we checked the reviews. Spot on!  Pulling up I stopped and thought, hmm, doesn't look appetizing. But then you walk in...lights, music, decor!  I knew it would hit the spot.  And it did...  food was delicious, and fresh.  Server was at our every beck and call. And best of all, we were in and out of there...no waiting!", "pics": null}}, {"review": {"des": "Sushi and prices are pretty okay. I didn't really like the furniture it was uncomfortable. I def. prefer Coast Sushi over this.", "pics": null}}, {"review": {"des": "It was really tasty. They add gluten to the rice, our server told me, so be sure to ask for steamed rice if you have Celiac disease. <br><br>They have a pretty good drink menu (I recommend the sauv blanc), and the sushi tasted really fresh. <br><br>Neat decor. Prompt service.", "pics": null}}, {"review": {"des": "This is one of the better sushi places in the very touristy area of the near north side. live not to far away and it is our go to place when we want to walk somewhere and hop in a quick lyft for sushi. <br><br>I always joke that I feel like I am either walking into the future or just Japan when I come to Friends. <br><br>Everything is fresh. Nothing really to knock. One thing that is bizarre is that they don't have green tea ice cream on the menu. So weird!", "pics": null}}, {"review": {"des": "Visiting from California, I am fortunate to be able to get good sushi. <br>Sorry FRIENDS, this was not up to par! Pricing is high for such small rolls with skimpy cut of fish and minimal sprinkle of gold tobiko. I could understand the pricing because of the neighborhood, but taste was not good either. Sushi rice is seasoned, I didn't taste theirs at all. I eat without soy sauce and appreciate the flavors of it all. If you're someone who uses lot of soy, you may not mind so much. <br><br>Food:<br>King California roll- small size roll, hardly anything inside...not even cucumber. NOT enough gold tobiko to add flavor. (Sorry, I was too hungry to take pics). $13 not enough crab at this price. Not even enough fillers to compensate. <br><br>Unagi roll with avocado- small roll and for $9, the should give the cucumber it avo or cuke) since it was only a few thin thin slivers in the King roll. <br><br>Rainbow roll $15!? Tiny slivers 3 kinds of fish, not even the size of an average nigiri sushi elsewhere. <br><br>I won't return, people's rave reviews?, I was very disappointed. I will seek a better choice in the city. Save your $ and have a better meal at Rosebud next door.<br> <br>Chicken teriyaki came with rice, miso soup, good portion of edamame. $14 pricey, but expected for the area. For this price, you could eat a better plate of chicken at another restaurant. Chicken wasn't marinated, grilled, not moist, bit dry white meat. Sauce for to go meal was on the side, but it wasn't very good. Tasted more like soy sauce than teriyaki. <br><br>Miso was good, and good portion of edamame (steamed soy beans) could of used a sprinkle of salt.", "pics": null}}, {"review": {"des": "Creative, delicious sushi with a really cool vibe.  On the expensive side.", "pics": null}}, {"review": {"des": "Their sushi was very unique. It's a little on the expensive side but their service is great. I would definitely recommend the \"Can You Handle It\" roll if you like spicy food. The atmosphere was cool too. A little loud but fun for young people.", "pics": null}}, {"review": {"des": "This stylish sushi restaurant offers some very inventive rolls and attentive service.<br><br>We started with the salmon carpaccio: thin slices of salmon served over greens in a soy dressing. It was very good, although I thought the dressing could have used a touch more rice wine vinegar for sweetness.<br><br>Then we shared three rolls. Each was unique, and they went together well. <br><br>\"Sweet & Spicy\" combined eel, cucumber, and salmon, but the piquant kick of the dollop of red sauce was what made it interesting. <br><br>In the \"Jimmai\" the hamachi, cilantro and seabass were really complemented by the smokiness of the grilled asparagus. <br><br>Our favorite roll was the very unusual \"Ticky Tacky\" where the predominant flavors came not from the king crab or tender thin octopus topping, but rather the mint leaf and wasabi mayo. That one packed quite a delicious kick.<br><br>There are many additional specialty rolls on the menu that we'll need to check out next time.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aTwxwZfKpm06qIF5sxkTyg/348s.jpg", "caption": "Exterior"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6Pm9t7jmAJ4JmOIFY5WAfg/168s.jpg", "caption": "Interior"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/v9u25Q4iUrh3I8Mo_61NzA/168s.jpg", "caption": "Interior"}]}}, {"review": {"des": "I've been trying to find a sushi place close to my home and I think Friends Sushi does the trick. Very reasonably priced for this location and the sushi was yummy! We went for the crispy sushi and the catch me if you can roll. Both had decent size portions and great flavor. I love when you can actually taste the fish instead of their being too much sauce.<br><br>It was a beautiful night and we were lucky we were able to sit outdoors. Warning though they only have 4 small patio tables so not sure how easy it is to get a spot during the summer time.", "pics": null}}, {"review": {"des": "I stopped by recently with some co-workers and everyone loved what they ordered. My sushi was served at a perfect temp, and every piece of fish was perfectly prepared. Several of us tried the sake cucumber martini and we all sang it's praise. <br><br>Friends has a great big city atmosphere. The space is tight and packed with tables... not much room to move around but it offers you ample smells and visuals of your neighbors food choices. Funky dance music in the background is an odd but fun touch. <br><br>The fact that it is less than a block away from the Omni hotel, my home away from home when I am in Chicago, means I will be visiting this location often.", "pics": null}}, {"review": {"des": "We came here based on the great reviews and were glad we did. We mixed and matched rolls and chef's choice sushi. Service was great, zero complaints, we will be back. Thank you to the staff and owners for making this place great.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DlgQTR7sAKeV781YjldCeQ/348s.jpg", "caption": "#friendssushi ftw"}]}}, {"review": {"des": "Here is the real deal. If you come from a city that has fresh fish available daily, then you will be disappointed with friends sushi. I consider myself a sushi snob and frequent sushi places all over the US. I am not a huge fan of sushi that is covered with a bunch of extra stuff, particularly sauces. I thought the point of sushi was to taste the fish with a hint of something you like. Many sushi places cover or mix the sushi roll with ingredients that take away from the taste of the fish, Friends sushi is no different.<br><br>I recommend this place for people who like a light taste of fish and a lot of other ingredients. <br><br>I don't recommend this place for people who know what great sushi and great fresh fish tastes like.  Although it isn't horrible, it isn't great.", "pics": null}}, {"review": {"des": "I was so excited to try Friends Sushi, but I was pretty disappointed with the experience. I have two main issues with the restaurant - the space and the pricing for quality.<br><br>If you're ordering takeout, you may not mind the first part of this review. I came here with a few friends and it was really uncomfortable to sit in the restaurant the entirety of our meal. We actually wrapped things up and left more quickly than we were planning. The restaurant was jam packed, to the point that it was uncomfortable. It was also HOT. Like uncomfortably hot inside. The tight quarters and temperature made it difficult to enjoy the meal.<br><br>The food was average, for a neighborhood sushi spot it's what you would expect. The only issue is, it's expensive. For this quality, I will probably go to a different, more low key spot in the future and save myself the money and discomfort.", "pics": null}}, {"review": {"des": "Decided I wanted Sushi for Father's Day , chose to go to Friends. We called a head a few hours before our decision. My daughter, wife and myself enjoyed our meal very much. Ann was our waitress and she was very good. She refilled drinks and water without asking and was suggestive of what dishes may appeal to us. The only thing she missed was that I wanted a Japanese mayo sauce but it wasn't included in the bill- no harm. I would recommend Friends for solid sushi, comfy chairs , great vibe and the food was very solid.", "pics": null}}]}