{"name": "frontera-grill-chicago", "reviews": [{"review": {"des": "Frontera Grill is a staple restaurant in the Chicago scene which put it near the top of my list once I came back to town. I am happy to have finally made the trip.<br><br>My wife and I arrived at 11:45 for lunch and the place filled up with people in minutes. The service was very attentive and prompt despite the packed house. We started off with the Topolo margaritas which were super tasty and well balanced with their housemade lemonade. My wife ordered chicken enchiladas with spicy mole sauce that was top notch. I ordered a trio of tacos (chicken, steak, and duck) which were packed with savory smoke flavors. It was a great portion as well and didn't skimp on the guacamole. The bill was around $86 before tip.<br><br>Overall I think Frontera is a top notch Mexican eatery that deserves it's highly acclaimed reputation.", "pics": null}}, {"review": {"des": "Frontera, in the last 7 years you've never disappointed me.  Been here over a dozen times...and I live in NYC. I make it a point to swing by when in town...that's how much I enjoy it. <br><br>Delightful bar tenders, great drinks and food. <br><br>Next door at Xoco, the casual food is superior. You'd never expect tortilla soup to be exciting, yet it is. <br><br>To top it off, desserts are delish and worth a visit on their own.", "pics": null}}, {"review": {"des": "I won't be able to add much to the canon since this place has a couple thousand reviews, but for my sake, get the baja-style fish tacos again!  While the queso fundido was only good (but not amazing), the catfish for the tacos was cooked to perfection and the sides for the build-your-own paired very well, including those two sauces to pour all over my tacos!  The guac was also great but it was a smaller portion than I was expecting...this is probably a good thing for me since I have a tendency to, you know, eat all of the guac!<br><br>The space is a bit strange to me--it's like a bar, with a restaurant, but it's kinda in someone's house, but it's in the middle of River North?  I really love the space at Lena Brava (another Bayless spot), but here, it just feels off a bit.  <br><br>Service was also an incredibly mixed bag--we got seated right away, saw a server soon after I sat down...then it took nearly 15 minutes to order our food, but then the apps came out hella fast, then we wait half an hour...for the mole of the day, my tacos and the pork tacos.  Like, what?<br><br>But ultimately, I needed to check the box on my Bib Gourmand list and I did that.  I can see why people love this place and Bayless never disappoints, but this one is lower on my list than his other entries!", "pics": null}}, {"review": {"des": "It's easy to see why Frontera Grill is such a popular and classic Chicago restaurant! As a big fan of xoco (and the Frontera to go at O'Hare), I was excited to try Rick Bayless's flagship restaurant.<br>My husband and I split the classic ceviche to start. It was a generous heaping of ceviche already portioned on chips. The presentation was lovely, but I wish I had more chips to eat with the portion of fish. For my main, I went with the skirt steak tacos; he chose the duck enchiladas. Both dishes were really good. I liked that the tacos came with unlimited warm corn tortillas and guacamole. Unfortunately, my husband found a bone in his enchiladas, which is why I docked a star. But otherwise, the experience was great, and I'm glad we finally tried this place!", "pics": null}}, {"review": {"des": "Last time we had dinner at Frontera Grill was about 18 years ago.  I don't remember much about it, only that I loved the food and wished we could go back some time.  I am a big fan of Rick Bayless; I bought one of his cookbooks \"Mexican Kitchen\" 20 years ago, and it's still my reference for a great margarita.<br>So a few weeks ago, when we were back in Chicago, I made sure we had a reservation to Frontera.<br>Once again, everything was perfect; great atmosphere, delicious food and attentive service.<br>Frontera's vibe is unique, with walls the color of guacamole, and lots of Mexican Folk Art.<br>The food and the margaritas were perfect, as I remembered from my previous visit so long ago.<br>I hope we find an excuse to go back to Chicago soon and have dinner there again!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kESNoGo8e4cxV_ae7JvwpA/348s.jpg", "caption": "Dessert, both delicious and beautiful!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5YiIaug7t-e5O8oDkvWDfw/168s.jpg", "caption": "Cool and colorful art!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TkgK6qgPQz0Jm7NaxWqriQ/168s.jpg", "caption": "Great atmosphere!"}]}}, {"review": {"des": "We don't live in Chicago, but visit fairly often. We always make a point to visit Frontera. We have been at least 5 times now and have never had a less than stellar experience. This visit, we went for \"brunch\" but it was really more late lunch for us. I honestly despise when places have brunch menus (because who wants to eat pancakes at 1:30pm?), but Frontera does a good job of balancing breakfast and lunch items. <br><br>We ordered the topolo, blue agave, and mezcal marg. All delicious, but the topolo is always my favorite. We then ordered tortilla soup, guacamole, the chicken taquitos, and the carnitas to share. I love the tortilla soup and it's a must order any time we go. One time we ordered it at the bar for an app and then again at our table because it is THAT good. The broth is unreal. Eat it while it's hot. The guacamole was delicious, obviously just made and not sitting in the fridge all day. Always comes with salsas which are just as good. And the chips are fresh too and not m greasy. The taquitos were a perfect addition to our meal. Lastly, the carnitas were out of this world. I don't think we have ever ordered those before, but I'm sure it will be a staple from here on out. The meat was perfectly juicy and seriously just SO good.<br><br>Can't wait to come back! Oh and I forgot to mention we saw Rick Bayless too!", "pics": null}}, {"review": {"des": "Service: Good<br>Quantity: Good<br>Cleanliness: Good<br>Food: Frontera Guacamole/ Taco<br><br>I'm a big fan of Rick Bayless. I told my friend I have to eat at one of his restaurants when I visiting Chicago. Guacamole was usual however I was more impressed with the tomato salsa and serrano salsa.  I can't stop dipping the chips with it. Friendly service, warm and inviting decorations, I felt happy to be there. Reservation is a must otherwise good luck waiting.  I had build-your -own taco Al Carbon -Style. The picture doesn't justify the portions size; it was very filling. If you enjoy Mexican food, I highly recommended. I wish I can stay long enough to try all his restaurants.", "pics": null}}, {"review": {"des": "Amazing mezcal margaritas, carne asada and ceviche! The atmosphere is vibrant and definitely a must on your Chicago restaurant bucket list.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NEX82NUPK7PzjK0sxVDc5w/348s.jpg", "caption": "Tres Leches"}]}}, {"review": {"des": "Busy and packed for a weekday lunch. I would prefer topolobampo but for an inexpensive quick lunch, you can't beat this restaurant. <br>Our group was able to try several dishes and I would recommend the pork loin special mole, beef tacos and the surprisingly good mushroom vegetarian entree.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6znYl07f-1Pxp0lt2zuhbA/348s.jpg", "caption": "Nachos with guacamole"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/43S1Y2ExOZ5u8GMU-C3ugg/168s.jpg", "caption": "Carne Asada in Mole Negro"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bEQkPV8JcCK5F72IWKG2hw/168s.jpg", "caption": "Beef tacos"}]}}, {"review": {"des": "One of the best Mexican food places I have ever eaten! I enjoyed our meal from beginning to end. Next time we are in Chicago we will be eating here again! We began our brunch experience waiting in a long line out the door until they opened at 10:30 (luckily we had a reservation) but the line out the door was a good sign! <br><br>Our brunch started with complimentary spicy nuts and we ordered two tequila mimosas to begin. Our eyes were definitely larger than our stomachs and we ordered the chicken taquitos with guac, Mexican breakfast pastries basket, and chips and salsa! All were amazing. The guac was delicious and I'm so glad we ordered the taquitos because we were able to eat the leftover guac with chips from our chips and salsa! The two salsa were very different in flavor and a welcomed change from traditional salsa flavors we are used to. <br><br>When our food came out, we both ordered tacos, we only had room for about half of our entrees but if my stomach would have allowed I would have eaten the whole thing! This is a must eat place for Mexican food lovers visiting Chicago. The head chef is Rick Bayless who changed how the culinary world looks at Mexican food in a good way! We will definitely be back!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TOg2MeqgDU7VM0Bo-1s7Dg/348s.jpg", "caption": "Carnitas Tacos"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pBcTBjvBwcWfXqOwV7-McQ/168s.jpg", "caption": "Chicken Tacos"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dTAwKUXFoHHyx6sVs0mTCg/168s.jpg", "caption": "Chips and salsa (two types)"}]}}, {"review": {"des": "There's no reason to rate Frontera any less than a \"5\"!  Upon arrival, with no reservation, we expected a 45-1 hour wait, but found a place at the bar and had one of their delicious drinks to pass time.  Try their Tamarindo with the candy accessory or their margaritas...when in Rome or Mexico!  One hour & 15 mins. later (Friday, happy hour in Chi-town), we received a text for seating:<br><br>Decor: beautiful & authentic artwork throughout, tight seating, cool lighting<br>Service: genuine, diverse, and efficient...you won't find one employee that doesn't have the customer in mind<br>Food: Try one of their specials for any day of the week...Friday was their dark and complex sauce atop their slow roasted brisket with mashed potatoes and spring vegetables...yeh, they did that!<br><br>Great owner, service, decor, food and drinks...don't second guess, just go!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RLb5trH61mJt9AW6mKBwQg/348s.jpg", "caption": "Dark, complex, and worth trying!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BJR0aPJfLt-46rJI9HX2vw/168s.jpg", "caption": "Beautiful artwork!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/y-eSvuc_eVkLAe2Hb0NY9w/168s.jpg", "caption": "Tamarindo! Yes, the candy is delicious!"}]}}, {"review": {"des": "In town for a conference, a colleague told me about Rick Bayless and how phenomenal his restaurants are. Therefore, my husband and I decided to give Frontera Grill a try. Wow! What an outstanding experience. <br><br>We arrived around 7 on a Friday and were told it would be about an hour wait. We walked up to the bar and were thrilled to find two seats. I ordered the Topolo Margarita which was perfect - salt rimed glass garnished with lime, delicious mixture of tequila and citrus. <br><br>About an hour and fifteen minutes later, our table was ready. We were seated at a cozy two top behind the bar. We started with the guacamole and chips, which also came with salsa. The guacamole was a nice consistency and flavorful, the chips were fresh and crispy, and the salsa was tasty. For an entree, based on the server's recommendation, I ordered the chef's choice enchiladas, which were filled with mahi, potatoes, and greens and topped with roasted tomatillo sauce and cheese. The dish came with three enchiladas and a side of black beans. I savored every bite, until half-way through when I was stuffed, and happily requested the remaining portion to go. Which made me super excited to realize I have a super tasty lunch for tomorrow! <br><br>Along with the amazing food and drinks, I loved the authentic Mexican decor throughout the restaurant. Based on the food, service, and environment, Frontera Grill was a 5-star experience and I would definitely return here when visiting Chicago to fulfill my Mexican fix.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XaAlJjYLn6U6FOdH43XY_g/348s.jpg", "caption": "Chef's choice enchiladas"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5S7szCJCxP5_VUfjEFkkLA/168s.jpg", "caption": "Salsa served with guacamole"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dc4jkk0xYu9Vk9XJAvkDDg/168s.jpg", "caption": "Guacamole"}]}}, {"review": {"des": "When I found this place on Yelp, I was super excited  and couldn't wait to try it out. I was such a huge fan of the idea of making your own tacos. Since I didn't get to find availabilities through the booking website, I decided to get there at 5pm right when they opened. Gee did I make a smart decision. When I got there, there was a somewhat intimidated-ly long line waiting out of the restaurant. And the whole place was quickly packed 10 minutes into its opening. Now you get a general idea on how popular this place is. <br><br>For the starter, we shared that mushroom dish. I had to admit that I was not very familiar with the Mexican cuisine. And I was pretty surprised when I saw the dish presented, as it was kind of different from what I imagined it to be. Nevertheless, I really loved the taste of the dish. It truly opened the gate to a whole new world of tasty foods. <br><br>As for the entrees, my boyfriend ordered the special of the day, which was the 20-hour-smoked beef brisket. Can I tell you how amazing it was. Believe me when I say this... it was one of the best beef brisket I had ever tasted. It was super tender and literally would melt in your mouth. NOT CHEWY OR DRY AT ALL. It was like everything I could possibly ask for. <br><br>I had the duck entree. When I put my order, our server told us that it was one of his favorites. And boy could I understand the reason behind that. I could clearly taste the charred flavor on the outside. And the duck breast was cooked perfectly as medium rare. Since I was a huge fan for spices, I asked the server to bring me with some hot sauce. When you see that white salsa, WATCH OUT! You tongue would literally be lit on fire with just one drop of that salsa. With that being said, after the meal, I had become such a huge fan of that salsa. I only wish I could take some home lol. <br><br>We were so full after the meal that we were physically not able to try their dessert menu. I'll definitely put that on my list. Nice job done Frontera Grill!", "pics": null}}, {"review": {"des": "What a great spot for a meal in Chicago! We had a reservation and were seated right away even though our whole party hadn't arrived yet. We were brought waters and chips and two salsas right away as well as a spiced nut and seed mixture. Very nice touches. The chips were fresh and salty and the salsas were both totally different from each other and something for everyone. One was red and smoky and slightly spicy and one was green and refreshing and not spicy at all.<br><br>I ended up ordering a whole portion of the Verde ceviche since it was 90+ degrees outside, I just wanted something cold and light. It was shrimp and scallops with veggies and a sauce that had an avocado texture. Super fresh and tasty. It came with a good amount of chips and I felt satisfied but not stuffed which was nice since the plan after was to spend the day mostly outside walking around in the heat.<br><br>We finished the meal by sharing the chocolate pecan pie and the tres leches cake. The pie is a must. It was so delicious and not too sweet. I wanted more than my share so next time I'm ordering my own!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KrxVz_DXG2zaJg1CCC5W3A/348s.jpg", "caption": "Tres leches cake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/71Pd6rBkeYJRGryXOc7bFQ/168s.jpg", "caption": "Chocolate pecan pie"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NY-geQf-aGai8dZ6Hsfexg/168s.jpg", "caption": "Verde ceviche - scallops and shrimp"}]}}, {"review": {"des": "My wife and I have been waiting to go to this bucket list restaurant for years, and it was so worth the wait. We got there early and sat at the bar for a few drinks and an appetizer, and were immediately impressed. My wife ordered a cocktail, palmetto rose, which she loved and I went with a simple Pacifico. We also took the opportunity to try the smoked chicken taquitos that were so good that I would've ordered them again as an entree if I hadn't had my heart set on what I actually ordered. So I've been waiting to try the famous carne asada and it was fantastic. The Oaxacan carne asada is marinated meat at its finest and lived up to the hype. It was super flavorful and cooked perfectly, and really could be eaten as a steak or in the tortillas. We also got the charred shisito peppers which were a great compliment to the rest of our food. The homemade guacamole was perfect and fresh, and you could really taste the difference in the food that is all locally sourced and of top quality. This was just a superb dining experience on all ends and this is why Frontera has the reputation that it has.", "pics": null}}, {"review": {"des": "We had a pretty good experience at Frontera grill. The cocktails we tried were really good (Paloma, house margarita, mezcal margarita, and tamarind margarita).<br><br>The salsas were good but not great. <br><br>The guacamole was again, good but not great. <br><br>The sooecitos were really good they were crunchy, the sauce was delicious, and the meat tender and flavorful.<br><br>The shrimp tostadas were nice and were probably the most creative dish we had. Cauliflower, corn, avocado were nice compliments to the shrimp.<br><br>The carne asada, devoid of creativity, was delicious. Although it was perfectly cooked and well seasoned, the dish was the same as you could find anywhere. A piece of steak, two plantains, a scoop of black beans, and a scoop of guacamole. Though delicious, you could find it anywhere. <br><br>The duck was abysmal! Gamey, overcooked, and by far the worst dish of the night. Though the mole it was served on top of was delicious, the grey, tough duck was beyond bad.<br><br>The fish (cobia) was great. Although the \"roasted potatoes\" were not crispy (which would've made the dish a lot better), the fish was cooked well and the fish was overall successful.<br><br>The home made flour tortillas were also not what I'd expect from a Rick Bayless restaurant. <br><br>All in all I wanted to like the restaurant more than I did. Some dishes were great but others were bad.", "pics": null}}, {"review": {"des": "As a SoCal native, I've had many, many delicious meals of Mexican food. I'm happy to say that Frontera Grill was delicious, albeit a bit pricey. I've heard about the long waits at Frontera, so I made a reservation a few weeks in advance. Our party of 6 was seated immediately for dinner on a Thursday.<br><br>We all ordered different varieties of the Margaritas, which were deliciously strong. Out of the different ones I tried, my fave was the Blue Agave Margarita, which was shaken right by our table. Trust me when I say a drink here is super strong....<br><br>We ordered the Guac and Queso to share. Both portions were a little small for the high price you're paying ($10). I could definitely taste the freshness of the ingredients. For size reference, 3 of us had 1 portion of the guac, which seemed to be a good amount.<br><br>For my main entree, I ordered the famous Oaxacan Carne Asada, which came with red chile-marinated prime ribeye. black beans, sweet plantains, homemade crema, fresh cheese, guacamole, and tortillas. The ribeye was well-cooked, and I enjoyed the accompaniments. However, the price of $35 was too high, in my opinion.<br><br>I also tried my friend's Red Chile Seafood Stew, which came with Baja mussels from Rincón de Ballenas, dorado (mahi mahi), octopus,<br>Florida shrimp, bay scallops, guajillo-chipotle broth, potatoes, chayote, and cilantro. The stew was spicier than we thought but delicious! There was actually quite a lot of seafood in the stew, so it was a good price at $29. Next time, I would probably order this instead.<br><br>All of my friends seem satisfied with their entree selections, including the Tacos Arabes and Chile Relleno. While we all agreed that the food was delicious, we all thought that prices were too high.<br><br>We also shared a dessert - some kind of ice cream brownie sundae. It was a good end to our meal, but again, priced too high.<br><br>While I enjoyed my experience at Frontera Grill, I still think that prices are too high overall. But I'll still come back! And that's saying a lot as someone from SoCal!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/09KGq6W_gsLn3T0sBxCRcA/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/47hUdZNLz09PbeYwTazoyw/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MJyO3oE8LxCq154KVZeRlw/168s.jpg", "caption": "Blue Agave Margarita"}]}}, {"review": {"des": "I love the ambiance of Frontera. It's lively and fun. It is usually very busy, so bring your patience with you, if  you're not able to make a reservation. <br><br>Although they offer delicious meals, I am still raving over the Tortilla Sopa. It was absolutely mouthwatering.  I look forward to going again.", "pics": null}}, {"review": {"des": "What a delicious meal!<br><br>My margarita was yummy! I had the guacamole to start. I loved it! My mole chicken enchiladas were fantastic. Why wouldn't anyone come here??", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wuLFIi9l1MC6eOoFmkE-qA/168s.jpg", "caption": "Chicken Enchiladas with mole"}]}}, {"review": {"des": "The decor and vibe here was excellent. <br>Love how they paired art with food. <br>The 4 course meal was excellent and filling!<br>The special coffee with cinnamon and spices was amazing and highly recommend finishing your meal with a cup. <br>The food was excellent in flavor and presentation. <br>Overall I would say it's a great place to take a date and try some amazing dishes and food combinations with a Mexican flair.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dDxxBHcYVpEFPEzI-mehmQ/168s.jpg", "caption": "The course menu."}]}}, {"review": {"des": "Went here on a Wednesday around 8pm and the place was full! Good thing we had reservation. Found out from the waiter that the menu changes every 6 weeks so my experience might not be similar to yours.<br><br>We started with the trio ceviche. I liked the tuna the most while my wife like the shrimp the most. Shrimp was spicy while the tuna was fruity. It's served with chips.<br><br>For main dishes we went for the chicken enchiladas and the carne asada brava. I liked the enchiladas more because it had more flavor. Also the beans that came with it was great. The brava was good but nothing spacial, it came with a spicy salsa. As a side we went with the cauliflower which was just ok. Overall the food till this point was ok but nothing significant.<br><br>Finally for dessert we went with the chocolate pecan pie and the three chocolate cake. Both were insanely good! I don't know how to explain it except that the chocolate was light yet very satisfying. If you don't have room for dessert at least get the hot chocolate which was also light but satisfying.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XrFiZ9KDkukD5pwEHmiA4Q/348s.jpg", "caption": "Ceviche Trio"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Wz3eYJXa4DvKnfD7mmMucg/168s.jpg", "caption": "Chocolate cake (1,2,3)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FgtuZm-l0pgJKQVmQLhKKQ/168s.jpg", "caption": "Chocolate Pecan pie"}]}}, {"review": {"des": "Probably my favorite Mexican spot in the city. <br><br>The salsa they serve is superb (and I buy it at the grocery stores). <br>My favorite entree is the mole enchiladas. The mole sauce is excellent - rich, sweet, but not overly sweet. The chicken is also excellent. Fantastic meal.<br>I've also had the tacos and would recommend those as well.<br><br>My only complaint is that it's always quite loud. Obviously not a huge deal.<br><br>Always look forward to returning. Best advice is to go for lunch - you'll save some money and have an easier time getting a table.", "pics": null}}, {"review": {"des": "I've been a fan of Rick Bayless' products like the Frontera Lime Seasalt Tortilla Chips, so I was really interested in check out one of his restaurants. <br><br>I showed up for lunch on a busy afternoon. Was immediately seated and they brought me water and the unsweetened ice tea I requested.<br><br>I ordered the Al Carbon style chicken soft tacos. It came with wood-grilled sliced chicken breast, roasted poblano rajas, beans, and guacamole. The spicing on the chicken was perfect. A little heat and a lot of flavor. The chicken was cooked perfectly and juicy, with a little smoke from the wood grill. The poblano rajas added more flavor to the party. The beans were perfect with a nice smoky pork flavor and a good amount of cumin. The dish came with 4 handmade tortillas. <br><br>It was perfect lunch size and super tasty.<br><br>Service was excellent. Will be certain to make a return trip the next time I'm in town.", "pics": null}}, {"review": {"des": "Pretty disappointed by Frontera Grill. I've been trying to go for so long too. We sat at the bar, and the bartender was friendly and very fast. The drinks were just ok. We each had a margarita and a specialty cocktail. <br>We started with the guacamole appetizer and she loved it. I had the steak and it came with some type or cornbread and tortillas. The salsa was too overpowering, and the steak might not have even been seasoned. The cornbread things were really good. She ordered a cabbage appetizer as her dish and she didn't even finish it. She said it was difficult to eat (needed a steak knife) and boring. <br>We really liked XOCO, and still plan on going to Leña Brava and Topolobampo, but Frontera was a big letdown.", "pics": null}}, {"review": {"des": "The food was so good we ate there twice, and we were only in town 5 days!<br><br>Amazingly wonderful and helpful employees, legit drinks and some of the mostly amazingly flavorful food I've ever eaten! <br>No joke, you HAVE to check this place out...I promise you won't be sorry!!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GT_t46-xxfJk2tSNM4_y0Q/348s.jpg", "caption": "Oh the salsas...beware the white one, it's got one hell of a kick!"}]}}, {"review": {"des": "Having been to XOCO on a previous trip, I was really excited to upgrade to Frontera Grill on a recent work trip to Chicago. The food did not disappoint! Got the Oaxacan Carne Asada, which has a nice kick to it due to the red chilli rub and has some lovely (and filling!) accompaniments. <br><br>It's a pretty lively place, even during our relatively late dinner on a Thursday night. Nevertheless, I wasn't happy about having to wait 30 minutes given the reservation made at least a few weeks in advance. They placated us with excellent guacamole though, so that was nice!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FTVqoA6ufvJNeKihSYIB_g/348s.jpg", "caption": "Oaxacan Carne Asada"}]}}, {"review": {"des": "A friend told RJ about Rick Bayless' restaurant because we were going to Chicago. I've always been a fan of his, so I was excited to go. We visited on Oct 3. The restaurant itself is cute, casual, and colorful. We had reservations and were seated right away. Jose Was our server and he was friendly and fast. I already knew I wanted the drink named Kill the Messenger, which tasted like straight tequila. RJ had the Tamarindo which was tequila and tamarind. Wow, those drinks were strong! We started with queso fundido with chorizo. It was so good, very cheesy and the chorizo was spicy. I ordered the snapper with mole and red potatoes, and RJ ordered the suckling pig roasted in banana leaves. We saw guacamole on another table and asked for that as well. The guacamole was the best I've had, and the food was delectable, and hot! So hot Jose asked if I was ok, and did I need milk. Both dishes were cooked perfectly, and every bite was spicy and amazing. We ended with the dos, tres, cuatro cake. It was layers of homemade ice cream, tres leches cake, and candied nuts. Sweet, salty and delicious, and also helped to cool down my burning lips!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_e6kJfKZ_Q1z-7wEgRQaww/348s.jpg", "caption": "Dos tres cuatro cake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tvSjgjmXaM2-MyUlM8XTWw/168s.jpg", "caption": "Queso fundido"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/T-1pxoPYTQrooxcTB-8nFw/168s.jpg", "caption": "Super hot!!"}]}}, {"review": {"des": "I was very excited to come here on our anniversary trip. Well, we hit the jackpot with Jose Jr- this was in my opinion the best service we received in Chicago. Every morsel of food was delicious- nothing too salty-too spicy-too hot-Everything was perfect. From apps to dessert there wasn't the slightest criticism or complaint. Best carne Asada I've ever eaten. Jose found out it was our anniversary and brought us two complimentary glasses of champagne. He also got into a lengthy conversation about the coffee that is sourced just for the restaurant by chef Bayless. He gifted us a pound of the best coffee we have ever drank along with little icecream with a Happy Anniversary writing. Even if your full we felt the chocolate pecan pie was worth the extra waddle back to our hotel room.<br>Instead of dropping the check and leaving he stayed and talked to us. We were his last table and he  could've made a run for it at any moment. This server deserves some sort of recognition. Thank you again!", "pics": null}}, {"review": {"des": "Ok so in a nutshell yes this place is a unique great eatery. While on one hand you can call it Mexican food, it's really quite a few steps above.  Not only were all the dishes our group had super awesome, the crafted margaritas are simply off the charts as well. Prices were reasonable to boot. Had Ceviche apps, a guacamole/pumpkin seed concoction that was ridiculously good and then had the duck, which I would highly highly recommend. If you are lucky enough to get a seat in this joint, we'll then you are lucky enough.", "pics": null}}, {"review": {"des": "It's busy, it's trendy, and it's delicious! Rick Bayless continues to amaze with Frontera Grill--offering a menu that exudes his creativity and love of Mexican cuisine. All of the dishes are fresh and prepared with so much care. Every dish that comes to your table is like a little work of art. A masterpiece in every sense! Que bueno!<br>P.S. Don't you dare leave until you try the mole.", "pics": null}}, {"review": {"des": "I had an amazing night and dinner at Frontera Grill. Being Mexican, I consider myself a very tough grader, and I must say Frontera Grill has my Mexican stamp of approval. <br><br>First of all, I highly recommend having a reservation. This place gets packed on any given night. I was fortunate enough to have a reservation and Was able to get seated way before my reservation. They do have a $15 valet and a coat check in upon arrival. Everyone was very welcoming a profesional. It really felt like I was entering someone's home. <br><br>We started off with their Tortilla Soup and their Queso Fundido. The Queso fundido came with poblano peppers and a decent amount of chorizo. It tastes very good with their side of salsas and tortillas. The Tortilla soup was presented beautifully. They bring out the bowl with just their tortilla strips and they'll pour the broth over the strips. The tortilla soup came with chicken, avocado and jack cheese. It was also very tasty. <br><br>The highlight of the night was their Oaxacan Carne Asada. A perfectly cooked and juicy medium rare, red chile marinated ribeye. It came with a side of guacamole, black beans and sweet plantains. It was all delicious and I definitely took advantage of their fresh tortillas and basically made myself tacos using the beans and guac and salsas. <br><br>I can't wait to come back. I really do want to try everything they have to offer and will eventually accomplish that. Everyone was very professional, and delivered exceptional service through out the night.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Axdvxy5xk_IdKvtDWQe0zA/348s.jpg", "caption": "Oaxacan Carne Asada"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6lD-cAJuysBOWTb7LqU4yQ/168s.jpg", "caption": "Queso fundido with Cruz Blanca beer"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KFAAwGcEab6cRyfRb4Qm3A/168s.jpg", "caption": "Tortilla soup"}]}}, {"review": {"des": "In Chicago, consider Frontera Grill as the final frontier to be explored because Margaritas and Mexican food go together like chips and salsa. <br><br>Bookmark it now. <br>Thank me later.<br><br>As we entered Frontera, the mix of technicolor Mexican mystique and loud laughter lured us in immediately. Goodbye windy winter and hello margarita. <br><br>Rocks. Extra salt. Poured at the table.<br><br>The margaritas brought a Frontera fiesta to our spirits, but it was the food that escorted the festivities to our taste buds. <br><br> * Oaxacan Carne Asada steak bonanza<br> * Pork in Tomamole (tomatillo sauce & grilled pineapple)<br> * Pickled Jalapenos for some heat<br> * Fresh Tortillas to bring it all together<br> * Another Margarita for my mood<br> * Duo de Flanes for dessert <br><br>On your next adventure to the North Side, make it your mission to explore the magical marriage of marvelous margaritas and mouthwatering Mexican meals at popular Frontera Grill.", "pics": null}}, {"review": {"des": "Reservations are highly recommended. Without a reservation, according to the host, the wait could be 45 mins to 1.5 hrs. However, there is a bar area where you can wait. We had a reservation for 10pm and the place was definitely packed when we walked in. <br><br>It's a small-ish restaurant with lots of bold colors, artwork, and an open kitchen. They also have a complimentary coat check.<br><br>Our server was friendly, knowledgeable, but not particularly attentive.<br><br>They have beer, wine, cocktail, and margarita offerings, as well as some virgin drinks. Their house made limeade is outstanding. I opted for the margarita shaken table side and poured in a martini glass - and made with their limeade. So delicious and seriously dangerous! The champagne margarita was also good.<br><br>The menu had a good number of options. It's was difficult to settle on what to get. Here's what we opted for:<br><br>- oysters and ceviche<br>- chef's choice guacamole <br>- tamales<br>- duck breast<br>- striped bass (special)<br>- carne asada brava<br>- Mexican chocolate ice cream<br><br>The oysters had a unique twist with an onion and hot pepper vinegar minongette, smoky chipotle hot sauce, and limes. The classic ceviche was alright. Not a lot of flavor, but everything was very fresh. The tropical ceviche was fabulous with lots of fresh and citrus flavors.<br><br>The fiesta guacamole (chef's choice version) was unique and flavorful - though, very packed with toppings. Crunchy beets, pumpkins seeds, oranges, sprinkles, etc. It's a great twist on a classic.<br><br>The tamales were thicker than expected, but excellently made.<br><br>The entrees were all very solid choices. Everything was tender and flavorful. The carne asada was my favorite. And the mashed potatoes that accompanied the fish were also a favorite.<br><br>We were stuffed, but couldn't pass on dessert. We were all used to Mexican chocolate being dark and spicy, but this Mexican chocolate was actually a very light chocolate with cinnamon. Still tasty, but not what we were expecting. The chocolate sauce that was served with the ice cream was incredibly delicious.<br><br>All in all, a fabulous meal. Would've been 5 stars if not for the sporadic service.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/G-akLjASJgBGJM2Nazrxyw/348s.jpg", "caption": "Fiesta guacamole"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RN33V8YoUlJ3t86v-hDUFw/168s.jpg", "caption": "Fiesta guacamole"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qh1I-Cl5EvhtCmDYfBT-LA/168s.jpg", "caption": "Margarita"}]}}, {"review": {"des": "The service was so great here that I wish I could give this place a higher review. The food did not cut it for me though. It started and ended very well but the main entrees were not impressive. Granted this was one main of many offered, I was not impressed with my plate. <br><br>The margaritas here are absolutely delicious, just the right amount of sweetness! I also really enjoyed the guacamole and ceviche. The ceviche had a nice kick and had nice chunky pieces to scoop onto your tortilla chips. <br><br>My pork dish was a bit bland, I ended up trying to mix a few things into a tortilla but it wasn't super appetizing. I figured I'd save my appetite for dessert and was glad I did. Of the assorted dessert I enjoyed the plantain crepe creation. I also love plantains so I may be a bit bias here. It was covered in a rum sauce and the flavors mixed perfectly together. I would highly recommend the dessert! <br><br>Seems like a fun place to grab appetizers and drinks but not sure it lives up to the rest of the menu with their main dishes.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ovVi9XgHdBwkt7jGRf-K3w/348s.jpg", "caption": "Assorted dessert platter"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vUtUfpWZjEgpxHSDaCjw7g/168s.jpg", "caption": "Flan, plantain stuffed crepe with rum sauce, and chocolate pecan pie"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UEp7edKljNYT_l8WQ_xe0Q/168s.jpg", "caption": "The plantain stuffed crepe was delicious!"}]}}, {"review": {"des": "The most overpriced restaurant that Ive been, I spend 80 dlls....<br>So lets start for the place, its a very nice restaurant and a little bit loud for my preference. <br>When we got there we sat down at the bar area because we didn't want to wait for 30 mints to get a table. <br>We had a guacamole as started which wasn't bad, the portion was a little bit small and they give you chips and salsa. <br>So for my main course I had the steak and guacamole with beans, my husband had the enchiladas which was different taste from other Mexican places we've been. <br>We had the frontera margarita which was okay, i think the staff was a little bit rude because my husband asked if the enchiladas poblanas were spicy and he laughed and looked at him like \"what do you think\", which i understand the Mexican humor because I am as well Mexican but i didn't I think it was appropriate. <br>I do recommend this place to try for the first time to go but I dont think i will go back if i am in town again.", "pics": null}}, {"review": {"des": "Absolutely loved Frontera Grill!  We were able to make reservations the same day which was great.  Our reservation was at 9:15pm and it was still rocking.<br><br>We started with a margarita and a Mexican beer.  We then had the guacamole which took a bit to get but was heavenly once it arrived!  My boyfriend got one of the fish dishes and I got the main entree carne asasa with the ribeye.  The steak was grilled to perfection and the taste was spectacular!  It came with black beans and plantains which were so delicious!<br><br>For dessert he got coffee & I got a dessert drink which was amazing.  The flavors blended so well together.  <br><br>Mexican can always be a hit or miss for me but Frontera Grill totally got it right!  I can't wait to come back!", "pics": null}}, {"review": {"des": "Frontera is one of the restaurants I would recommend any of my friends to visit. I've been to other restaurants by Rick Bayless and they're all amazing! I wish Frontera would come to New York I miss their food so much! Their brunch and dinner are amazing and you cannot go wrong with either. Before coming here I would recommend getting a reservation. I've never came here without a reservation but every time I came in or passed by the restaurant it's always busy! <br><br>The only thing I wasn't fond of during brunch was that it wasn't unlimited drinks... But that's probably because I'm so use to doing unlimited brunch. Although, Frontera does not have unlimited drinks they do have amazing drinks and even better food! I ordered their Huevos Motuleños which comes with two fried eggs on a crispy tostada with roasted tomatoes, country ham, peas, sweet fried plantains, queso fresco, and black beans. I forgot what my boyfriend ordered but it was an egg dish as well. I loved both of what we ordered! I'm still thinking about that brunch. The margaritas they served were strong but really good. <br><br>I've come here for dinner as well and I really recommend coming here for both dinner and brunch because it won't disappoint. I always love ceviche so, we ordered the ceviche trio. I love when places offer trios because it's a nice way to sample everything and I ended up loving all the flavors. We also tried their carne asada. Their wood grilled meats are a must! Honestly, probably everything on the menu is delicious. I don't think you can go wrong with anything. I love Frontera and it's probably one of the best Mexican restaurants I've ever been to. Can't wait to be back here!", "pics": null}}, {"review": {"des": "We made reservations for 2 on a Friday night, and I'm glad we did because it was popular! <br><br>The service was excellent- our waiter was friendly and helpful, and brought our drinks and food quickly giving how busy it was! <br><br>My friend had the Fresh Grapefruit Paloma to drink, which she said was good (they do offer it with a spicy rim, so if you don't want the spice just ask for it without!). I had a gin and tonic, which I thought was overpriced ($12). <br><br>We shared the guacamole, and the server brought salsa with it. He told us we could request the spicier salsas if we wanted (after we told him we were originally from Texas!). The guac was good, and so were the salsas. <br><br>For dinner, we both got the Sopecitos Rancheros ($9), which were good but definitely best as an appetizer. However, the entrees are just too expensive, so I went with the cheaper appetizer. <br><br>This is definitely a fancier take on Mexican food. It's good, but expensive, so I probably wouldn't go back unless it's a special occasion.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5haxR7E4VMsI72L-5Z2bbA/168s.jpg", "caption": "Sopecitos Rancheros"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oDRjrpAgPANDFjwlyr8Xuw/168s.jpg", "caption": "Classic Frontera-Style Guacamole"}]}}, {"review": {"des": "YUM. This place is super popular/famous in Chicago and I can see why. Friendly service and event better food. My friend and I started off the meal with a Paloma ($12) and Root Down ($13). The Paloma was nice and refreshing and root down was fruity and sweet. Both drinks were on the stronger side. <br><br>Then we decided to split the ceviche trio ($24). The tropical tuna cocktail was my favorite due to the sweetness element from the pineapple. The ceviche also came with chips and a red and green salsa, which were slightly spicy but not too overpowering. <br><br>For our main entrees we opted for the duck breast with morita-mango sauce ($25) and the Friday special: Suadero Ahumado ($25) (20 hour smoked beef brisket in black mole and mashed potatoes). I had the beef brisket which was phenomenal; the meat was tender and flavorful and came in a large portion size. My friend really enjoyed her duck entree as well. <br><br>Last but not least, for dessert we ordered Cafe Playa ($9) (Americano w/ Kahlua) and Chocolate Mezcalero ($9) (hot chocolate with Mezcal). Both drinks were extremely strong but still delicious. We also got the Mexican Chocolate Ice Cream with goat milk caramel ($9). I'm a sucker for anything ice cream so naturally I enjoyed this dessert. The goat milk caramel was way creamier than normal caramel and complemented the ice cream well. <br><br>This place is super popular and may be difficult to get reservations for; the wait is usually over 2 hours for large groups. Since the place is super busy, the service was naturally on the slower side, but the servers were nonetheless friendly and helpful.<br><br>TLDR; amazing food & drinks, make ressies in advanced!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/o_prH_-dQ7dOAhLiIRDT3A/348s.jpg", "caption": "Cafe Playa"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/H5znfRVlCPdNR9JhFDv6Pw/168s.jpg", "caption": "Mexican chocolate ice cream"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wB2vm84L_bL9UlUleWscbQ/168s.jpg", "caption": "Ceviche Trio"}]}}, {"review": {"des": "Went here last night with the family.  Great experience.  Service was superb.  Food and drink excellent.<br><br>Their margaritas are killer (I had 2), and ceviche is great.  We ordered the Ceviche Trio which includes three different ceviches.  I ordered the Carne Asada Brava for my main.  It was delicious, however very spicy.  I like spicy and this was about as spicy as I can handle.  The beef is marinated in habanero pepper so very spicy.<br><br>My kids ordered the Quesadillas, which they loved.<br><br>Book way in advance to get a table, otherwise the wait can be quite long.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/08YlNM02sSTcpRAIng_cdg/168s.jpg", "caption": "Carne Asada Brava"}]}}, {"review": {"des": "Honest review for brunch: second time coming this time for brunch. food was good, but i had better brunch before. Think this place is better at dinner. Service idk why but frontera grill needs better service  One great tip is that u could order desserts off the dinner menu. N plz make it so u can order a bunch of chonchas Best things:mini hotcakes/ pastry basket/ gorditas/ carne asada/ mole/Fall extravaganza<br><br>CHUPACABRA 11$: 2/5 (mexican bloody marry) good interpretation, but i love bloody marries n didnt really care for it, it was to watered down. Add some horseradish would be the best drink ever<br><br> huitlacoche goat cheese tamal 8.50$: 2/5 good not great. Think rick makes the best tomales but The reason why i didnt really like this is because therere wasnt enough huitlacoche flavor n goatcheese.  Loved the squash blossom sauce it was so rich n goes perfectly with cheese. N the pee shoots added freshness <br><br>OUR FAMOUS TORTILLA SOUP $8: 3/5 good not great the broth was good but was lacking depth. It needed more cheese  n there was like 2 pieces of chicken <br><br>MINI HOTCAKES $5: 4/5 loved it but pancakes were cold.The pancakes were moist n flavorful not to sweet.  I loved the whipped goatcheese added an amaizing savory creamy component just put more after one bite ur done. Loved the walnuts for crunch just wish they were candied <br><br>Spicy bacon $5: 0/5 didnt like it. It was old and cold couldnt taste any heat just tasted a little burnt to be honest<br><br>Chips/ salsa $3: 4/5 really good my favorite salsas are the tomatillo, n the habenro salsa the red one i didnt care for it was to watered down<br><br>HOMEMADE MEXICAN PASTRY BASKET 8$ : 4/5 amaizin just they weren't warm which is unfortunate. the concha was amaizing it was so fluffy and buttery my only issue is the top was dry. Huachibola: this was amaizin the pastry was supper fluffy n the filling tasted amaizin adding a great savory note. Gordita de Piloncillo: i loved the spices but it was really dry like hard as a rock<br><br>GORDITAS DE CHICHARRÓN $14: 4/5 amaizin the gorditas were really crunchy and flavorful i hate gorditas that arent crunchy the scrambled eggs were so soft the carnitas were good but there was jus like one tiny piece of meat wish there was more meat added n if chicaron was added as a crumble on top. The salsa was good just the gordita needed more so having extra on the side would be good. The salad was really good but it wasnt really an arugula salad because there was only one piece of arugula was more of a green salad loved it though cause the freshness cut through the richness <br><br>Mushroom mixiote $15: 0/5 didnt like this. The dish needed salt really badly. The mushrooms were all overcooked n really rubbery n didnt care for the sauce wasnt that flavorful. I didnt like the dumplings they were really dry<br><br>OAXACAN-STYLE CARNE ASADA $34.50$: 5/5 amaizin this is one of my favorite steaks because the steak is high quality it's extremely tender n its really flavorful im not a steak purist so i like my steak to have lots of flavor. The guac is really acidic and cuts through the richness of the dish. The plantains add great sweetness and their not burnt loved the addition of eggs for added richness just wish there were beans to make it complete this comes with tortillas<br><br>MOLE POBLANO ENCHILADAS 4/5: $15 rick bayless makes the best mole so i would recommend always getting all the different kind of moles their so flavorful n their not sweet. The sauce was supper complex the filling was good just put more n loved the addition of black beans<br><br>Duo de flans $8:25: 3/5amaizin theres two flans a traditional one and a unique one. The traditional one was fine just wish rick would focus more on the unique one because it tastes better and add more components to compliment the flavors better. The cheese flan had a wonderful cheese flavor that added a savory component to cut through the sweetness the pinapple salsa was okay didnt really add anything. The flan at xoco has the bacon popcorn if that was added to this dish would really make it taste better <br><br>Sopa de frutas $9 : 2/5 this is really unique just its really soupy. The the soup needs to be thicker or needs substance its very soupy this dish needs a crunch factor really badly. the actual flavor of the soup was really had a wonderful corn flavor. Then theirs pieces of corn that adds a little texture wish the corn was used to make sweet hush puppies that would have been cool or like a corn cake i liked the rasberry icecream which added tartness to cut through the sweetness<br><br>Fall extravaganza $9: 5/5 best dessert from brunch. The almond icecream was amaizin adding a nutty savory flavor to counteract the sweetness then theres really good vanilla icecream that gives a sundae vibe the sesame cake was amaizin adding a great savory flavor the concord grapes added acidity to counteract the sweetness then the merangue added crunchy sweetness", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ienWmuqrUtWBmALe5EDHuA/348s.jpg", "caption": "Bill"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Zdg7ixSnp7K2wA_2AqPthw/168s.jpg", "caption": "Icecream to sour"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eXNQhLVS8j0KrgwuRIixaw/168s.jpg", "caption": "Extravaganza $9 amaizin"}]}}, {"review": {"des": "They don't open until 5PM for dinner, so that left me waiting a bit.  My bad for not checking ahead.  I got the Oaxacan carne asada, the meal featured on The Best Thing I Ever Ate.  The steak was good but no better than what I can make at home on my contact grill.  The sides were all good but in total the meal didn't justify the $35 price.<br><br>What was baffling was the service.  My water was kept full and my order didn't take long, but the waiter never once asked how I was doing.  After my table was cleared, he never brought the check... ever.  I saw him and he was not overly busy, he just seemed to decide to leave me sitting there indefinitely for no particular reason.  After over 15 minutes, I got up and went to the front to pay.  I've had equal or better Mexican food elsewhere for half the price, and didn't have my time wasted.  I will not go back.", "pics": null}}, {"review": {"des": "Service was great and food was really good.  Unfortunately, I didn't know of the chef before eating here, but will now look up some of his shows.  We had the fundido and tacos. They were really good.  Were they the best I have ever eaten?  No.  Will we return, maybe.  <br>Funny enough, I had unknowingly been to his sandwich shop at Ohare. That place, offered one of the best sandwiches I have ever eaten and by far the best airport food I have ever had.", "pics": null}}, {"review": {"des": "Delicious food as expected from any Rick Bayless establishment <br><br>Had the mango salsa with chips and zucchini entree!<br><br>I'd be happy to try something new next time especially if they had a vegetarian soup", "pics": null}}, {"review": {"des": "Let me start with saying I am not a big fan of Mexican food. I always felt the food is over cooked and dry. Not this place. I came here for my cousin's bachelorette party and everything was delicious. There was a line out the door before it was even opened and luckily we made reservations. One of our group came in late due to flight issues and the staff was very patient and understanding of our need to wait for the extra person. <br><br>I ordered the soft beef taco and the flavor is bold but not over powering. The beef is perfectly cooked and marinated. <br><br>I would definitely visit again when I come back to Chicago but I also know there are many places to eat :)", "pics": null}}, {"review": {"des": "I heard so much about this amazing restaurant and chef.  Took my niece to dinner there on 28th.  We arrived at 8:05pm and were seated promptly on patio.  Ordered a drink (beer for her and iced tea for me).  She ordered an appetizer and I ordered the Enchiladas all at the same time (I hadn't eaten since breakfast) as I was hungry.  Server even repeated my order referencing the mole sauce.  <br><br>Food arrived one hour later.  Server never checked back for 2nd drink or anything.  Shortly before food arrived, I inquired and was told it would be right out.<br>Upon arrival, I was served a fish entree and her the appetizer she ordered.  Two items took the server and kitchen one hour and 10 minutes.  At no point was there any proactive effort on the restaurants part to acknowledge this issue.  Upon delivery of the food, my plate looked odd but thought maybe it's a Chef plating special way...  I took one bite and called the waiter back.  I was served fish.  He basically attempted to make me feel like that's what I ordered.  We had two items and he got one wrong!   I ordered Enchiladas and he had confirmed it.  He attempted to remove my plate, but I held him back asking \"how long for the enchiladas\" for which he said another 15 minutes.  I told him I would eat the fish.  It gets better.<br><br>Upon 2nd note, found fish raw.  Totally undercooked.  Then asked for manager.  He could have cared less.  Lacked empathy, concern for how long we'd been there.  He is in the wrong career/position.  He too said he'd rush the correct entree and I changed to an appetizer of taquitos which  came in about 7 minutes.  They were tasty but far short of original order and my hunger.  Niece had another beer while I ate.<br><br>Manager never came back, never apologized, and again could care less.  A special dinner with family - in Chicago where 1,000 great eateries, and this joint with attitude and no delivery beyond poor.<br><br>Before leaving, found manager leaning in the corner.  Never did he check on a patio table nor us throughout.  No table maintenance beyond water from busboy.  If you're in Chicago, skip this one!!", "pics": null}}, {"review": {"des": "This place is amazing! Went there on a Saturday for lunch. The restaurant was full, but we had no wait time as there were two of us. The staff, from the hostess, to the waiters were super nice, efficient and accommodating. I had the chicken enchiladas and my niece had grilled meat, sorry I don't know the name as I was so into my enchiladas. The mole sauce was to die for as well as the beans on the side. As an appetizer we ordered tamales. Yum, brought me back to my childhood. <br><br>The energy there was tangible. And to top it off, Rick Bayless was there checking the food in the back! We asked his staff for a picture with him. He was super nice, despite being busy taking care of his restaurant, he stood with us all of us smiling. <br><br>I won't soon forget the experience and have to make the trek down from the suburbs to try this place again", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JRwEvJ8qkca1h2L8CmiMxA/348s.jpg", "caption": "My niece and I with Rick Bayless!"}]}}, {"review": {"des": "Truth to be told, food was delicious! Service is good even though the place was packed (make sure to call to reserve ahead). We shared the ceviche trio, and then I ordered the smoked chicken taquitos(super tasty!). My husband ordered the carne asada brava with the salsa on the side. The corn tamales with crema and queso fresco are delicious! And for dessert I had the Duo de Flanes and I really liked the vanilla one, a traditional and well done flan; on the other hand the Cafe de Olla one wasn't my favorite. And for my husband he had the Dos, Tres, Cuatro cake and it will be a must<br>For me To order on our next visit. <br>Very nice experience overall.", "pics": null}}, {"review": {"des": "Great place to dine in, I would like to give it a 4* rate, but there are too many great restaurants here.<br>The beef product are so good. We tried two different kinds. Both are well cooked and delicious. These two dishes are rated to be 5*.<br>However, the nacho dish provided less avocado and is not rich flavored. More important, the dish is not creative enough compared to the food at other places.", "pics": null}}, {"review": {"des": "So bummed. I have always loved Frontera Grill and admire Rick Bayless. But this visit was disappointing. No vegan dishes. Well okay, I often cheat with cheese. And this is one of those insufferable \"no substitutions\" places. But my only request was to take the shrimp off the \"vegetarian\" designated Summer Tostadas. Shrimp is not a vegetable! Our server was very nice, but \"sorry we can't make an exception. \" That little star is the Vegetarian symbol. Read the small print. <br>Boo.", "pics": null}}, {"review": {"des": "Great place! The art and design are very fresh...we loved the dragons!<br><br>The margaritas were unique and the cayenne salted rims really amplified the grapefruit. <br><br>The three salsa brought out to go with the guacamole were completely different from one another with the yellow one being super hot and flavorful.", "pics": null}}, {"review": {"des": "We were here last year at Topolobampo and decided to try this side this year!  Did not disappoint!  Amazing flavors!  My mouth and taste buds are dancing with joy!  Chef Rick Bayless and crew are kicking serious butt!!!", "pics": null}}, {"review": {"des": "So it was my first time here and I loved it ! <br>I fell in love with the scarlet wave drink !!! It was sooo delicious ! I ended up with enchiladas a la plaza' my boyfriend got the pozole ' and then we shared a green chicken tamale ' and he had coffeee to drink! , I would most def recommend going to place ! All the severs were nice ! And they were so fast and very nice guys :)", "pics": null}}, {"review": {"des": "Came here for brunch. Everything was solid. Would love to go back and try their dinner", "pics": null}}, {"review": {"des": "Awesome food. But the portions could be bigger. The ambiance is fun. The staff is very friendly. Did not have to wait long with reservations. Can't wait to come back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eoX-cSku4FHaA4p-fng3dw/168s.jpg", "caption": "Meeeee"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/l7FKzDC96KIYcRuD4Cl9Vw/168s.jpg", "caption": "Bin appetite"}]}}, {"review": {"des": "Frontera Grill was pretty disappointing, For all the great reviews and the raved about Rick Bayless high-end Mexican restaurant, the food was a little disappointing. The food is ok to great but lacked consistency. The service was mediocre.<br><br>We arrived an hour early, had a snack next door and arrived on time. <br>We were seated in a spacious booth seat. <br><br>We ordered the ceviche trio ($ 24), carne asada brava ($ 29) and enchiladas de cochinita pibil ($19). The ceviche trio was the best part of the meal. The tropical ceviche was mango tuna with red onions. This was refreshingly sweet and delicious. I also liked the Frontera ceviche with Hawaiian albacore, lime and tomatoes. <br><br>The enchiladas were ok. Unfortunately the \"slow-cooked suckling pig cochinita pibil\" was dry and lacked many of the flavors of cochinita pibil such as cinnamon, cumin and orange flavors. It just tasted like a slightly dry roasted pork. <br><br>The carne asada brava was flank steak, which was a perfect medium rare with grilled knob onions. The green onion part was wrapped into a knot. The flavors were ok but a little bland. This is something that could be made at home. The best part of this dish was the sweet corn tamales. They tasted of sweet fluffy corn cakes. <br><br>Unfortunately, the service was not great. One of servers tossed my plate in front of me like a frisbee instead of handing it to me or placing it down in front of me. Some of the servers were great- explaining a dish while placing it on the table. Our waiter was very nice. <br><br>All in all, there are much better Mexican restaurants that you can spend your money on. Brave your own path to better Mexican food.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DYopcX9vNG1B3v0rtVFZOg/168s.jpg", "caption": "Carne asada brava"}]}}, {"review": {"des": "The restaurant was really packed on a Saturday night. I had made the reservations a long time ago when I knew I would be in Chicago. The Ambiance was lively and cheerful. We ordered the chefside guacamole for appetizer and then for the entrees we ordered the Halibut, the carne asada Brava and the carne asada tacos. Everything was delicious but I really enjoyed the halibut and the guacamole the most. For dessert we ordered the flan, the tres leches cake and the Cajeta Sundae. The sundae was the best dessert out of the three.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OCIRbx_sNcy6sC9NH7S6Wg/348s.jpg", "caption": "Flan, chocolate tres leches cake, and Cajeta sundae"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JrgnjsqTRTkvR-ZN8XJwtw/168s.jpg", "caption": "Beef tacos"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SxRr-wCPvpsqX57HWpfyGw/168s.jpg", "caption": "Halibut"}]}}, {"review": {"des": "All of the food was pretty good, but nothing phenomenal. The attitude of the servers and the pace of the meal was totally unsatisfactory... to the point where I really didn't enjoy the overall experience AT ALL. They rushed us to order while we were eating our appetizers, then took 100 years to bring out our entrees and proceeded to try and clear plates filled with food almost immediately... it was bizarre. Obviously they were just trying to turn over our table. We always wanted to try this place, but wish we hadn't bothered. Maybe this place was the \"real deal\" a while back, but now I fear it's just drifting on it's celebrity chef namesake....", "pics": null}}, {"review": {"des": "Another awesome trip here. This time we got:<br><br>- Guacamole<br>- Salsas<br>- Tortilla soup<br>- Tacquitos banadas<br>- Ceviche trio<br>- Fish tacos<br>- Grilled chicken tacos<br><br>The tacquitos and tortilla soup were incredible (again), as were the ceviches, although I think next time I'd be fine just getting the yellowfin tuna ceviche, which was easily my favorite. The tacos (which you have to compile yourself, as they're build-your-own) were good, but not my favorite. One disappointment was that they didn't have the incredible Mexico City-style quesadillas on the lunch menu -- probably makes this worth a dinner trip just for those.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9fgANu-6vhaoRifIQdUApA/348s.jpg", "caption": "Tortillas"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hgT1Vq_LctGMJmQ_wrOWKA/168s.jpg", "caption": "Chicken taco infredients"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FV4rL6h6ioEjGPIzmO2cwg/168s.jpg", "caption": "Fish taco ingredients"}]}}, {"review": {"des": "If you are looking for a great margarita this is the spot!!! Enjoyed the fresh guacamole and chips. Main course was not the best. However I enjoyed the environment and friendly staff.", "pics": null}}, {"review": {"des": "Not sure why, but I was pleasantly surprised with how much I liked this place! <br><br>Two friends and I came here for brunch on a Saturday morning before heading off to the aquarium. My friend made reservations and this might have been the right move because there was a line before the restaurant even opened at 10:30. Crazy! <br><br>I started off with a frothy Mexican hot chocolate and ordered the hotcakes. My friend and I were craving plantains, so we split a side of those. <br><br>The hot chocolate was really good. So full of flavor. You could even taste the little spice that garnished the top. Such a good choice for breakfast. As soon as it was cool enough to (which is not cool at all), I basically chugged the entire thing. Delicious.<br><br>The hotcakes came were a lot. They came with two eggs and bacon. The bacon was a disappointment because I like my bacon chewy, not crunchy. This bacon is crunchy. It was almost toasted black, but I'm not too mad about it. The eggs were simple, but so deliciously made. Still a little bit runny, which I thoroughly enjoyed. The hotcakes themselves were made with a corn base, so if you like cornbread, it'll taste exactly like that. They're fragile and they don't really hold up well under maple syrup, perhaps even worse than usual pancakes do, haha. The whole dish was huge for me, and I felt really bad because I couldn't finish anything despite how hungry I was.<br><br>I want to take a special moment for the plantains though: they were served with cheese and sour cream. I'm not a fan of fruit and cheese, so I didn't try that, but I dipped the plantains in the sour cream, and it was amazing! Like when you dip french fries in ice cream! I absolutely loved it. I'm a big sour cream fan, and the sour cream quality was really amazing. <br><br>Also, something about the glasses the water was served in made it taste better. Might have just been me, who knows.", "pics": null}}, {"review": {"des": "I think it  was okay was disappointing.  We loved Lena Brava but thought this was not a restaurant for us to return to.  <br><br>The dining area is very loud. Or, too loud for us.  The bar area is a little less so.  Service very nice. <br><br>The shishito peppers were so intense.  It was as if someone made an error and used another type of pepper.  We order them elsewhere and use them at home. <br><br>The guacamole was too salty.  Very basic. <br><br>The fish ( cooked in an apple preparation) was good but a small portion for the $29 price. <br><br>The peppers came with tiny slices of lime. The fish came with  two tortillas for each of us - we had to ask for more. They could be more generous with these small  things.  <br><br>Comparing this to a restaurant to like Besito where <br>the portions are larger, the food quality and selection is great and guacamole is prepared tableside.... I think Frontera Grille is overrated. I know I am not in the majority here.  Maybe it is just what we ordered.", "pics": null}}, {"review": {"des": "I was a huge fan of Bayless way back on Top Chef Masters and I dreamed about the mole sauce that the judges raved about! When I first moved to Chicago, I was so excited to finally get the chance to eat here!<br><br>I was super lucky and able to get a table for 2 during Restaurant Week with a friend. I understand that this isn't the best time for waiters, so I am willing to give the waiter the benefit of the doubt for most things.<br><br>That said, the waiter for my table could not have been ruder. Our plates for entrees were dropped unceremoniously while we were halfway through the appetizer. The real straw though was the waiter came back twice to tell us we were eating the mole and tortilla wrong. We were already 5 minutes into eating our meal when he came by to say that we didn't appreciate how the dish should really be eaten. Fine - but you could have told us that at the beginning! The second time he came by, it was even ruder about how we didn't understand how to eat the meal. I have literally been treated better at Chipotle. I was super disappointed as this is not a place I would take anyone for a meal, let alone a splurge-y treat.", "pics": null}}, {"review": {"des": "We've had Lena Brava and the frontera in the Macy's food court, so we wanted to try the OG place.  Damn it did not disappoint one bit!  Rick is the man and everything that we had here was legit<br><br>The ceviche trio and guacamole were very delicious. Each ceviche was great in its own way (my fav was still the classic one). <br><br>I'm not a mole guy but my wife got the chicken mole enchiladas and loved it. I got the classic Oaxacan carne asade. Still dreaming of that thing. Perfectly cooked medium rare steak served with some guacamole, plantains, and black beans. For real the perfect combo.   I dipped half of my steak bites into their salsa.  Their green salsa tastes so fresh, and their red salsa has a nice sweetness to it. Neither are super spicy. <br><br>A must go to in Chicago!", "pics": null}}, {"review": {"des": "It's great.  We had reservations on a Wednesday night which were necessary.  The drinks were well made, the guacamole was worth getting.  I had thecslow cooked pork and it was so good, perfect.  Others had the tortilla soup and said it was the best ever.  I'm glad we went, it's trendy so I doubted it would be good.  It far surpassed my expectations.", "pics": null}}, {"review": {"des": "Being tired of the standard slop you find at Mexican restaraunts in 99% of the places in America, I was super excited to try this place out. My friend and I have talked about going here for years. There were some hits with our meal, but a lot of misses. <br>We started out with an order of the chips and salsa, shishito peppers, smoked chicken taquitos, and fresh sparkling lemonade. The chips and salsa were great. No complaints. Shishito peppers didn't wow me. But I wanted to see what all the hype was about these things. The smoked chicken taquitos had a very nice presentation, however, I detected no smokiness to the chicken. It just tasted like chicken that had been roasted in an oven and shredded. The guacamole the taquitos were sitting on was very good. The taquitos were good, but nothing that memorable overall. The fresh sparkling lemonade was very delicious. More of a lime taste than lemon, but very unique and refreshing. <br><br>For our main meals I had the Carne Asada. At $34 it was one of the most expensive things on the menu. The menu lists the meat as being prime ribeye. I'm sorry, but there was no way this was prime meat. Despite being cooked perfectly medium rare like i ordered, this cut of meat was tough. I've had more tender steaks at Longhorn. My dish came with fried plaintains, and they were incredibly good. It was honestly the best thing on my plate. <br><br>My friend ordered the chicken enchiladas. It was covered with a dark mole type sauce. Maybe we just aren't familiar with mole sauce, but it was a flavor neither of us really liked. If you're used to sauce you get at most Mexican restaurants or Tex-mex places, this sauce will really throw you off....although I'm sure it's more authentic. Overall I was pretty disappointed for as much as I had been building it up in my head.<br><br>Service was also very good. No faults on service. Never felt rushed at all.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0rUG1PbXU_NYQfYmcMTCDA/348s.jpg", "caption": "Chips and salsa"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QEyvw8OLzuc7J7NiXydT0Q/168s.jpg", "caption": "Fresh sparkling lemonade"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oQpuf_arBiZNkUTeGf5HDA/168s.jpg", "caption": "Shishito peppers"}]}}, {"review": {"des": "One of two best Mexican restaurants in the U.S. The other one is next door at Topolobampo. But for Frontera Grill, there are no equivalents and no alternatives. Rick Bayless is a master of his craft and a really great guy to boot. Frontera is the place I go whenever I can go. Great example: I moved from Chicago to NYC and on my first visit back to Chicago I made a reservation just to be there. I went twice -- once I found a friend to go with me and the other time I ate alone at 11 pm just because.<br><br>The menu often changes, but there are some classics and staples that never do -- and that's a good thing.<br><br>Queso fundido: My choice for a last meal. It's basically an iron skillet filled with melted cheese and chorizo. It's full of calories and despite eating healthy, I'll always indulge in this. It comes with hot, freshly-pressed tortillas and the signature Frontera salsas -- spicy red and fresh green verde. My tip that comes from experience and from the waiter: Eat it as soon as it comes out otherwise the cheese will harden.<br><br>Carne asada Oaxaqueno: There are two kinds on the menu -- the other is called Brava -- but this one is my favorite because it's spicier. It's phenomenal.<br><br>There are so many other dishes, but those two stand out every time. The cocktails here are stunning and fresh. The desserts are terrific.<br><br>Ask me anything about Frontera or Topolobampo and I'll happily give you an honest, enthusiastic answer.", "pics": null}}, {"review": {"des": "My family and I have been coming to Frontera Grill to celebrate for well over a decade, it's our go-to spot when my siblings and I are back in town to visit our folks, and it's a family affair. <br><br>I recommend starting with one of their famed margaritas - the Topolo Margarita is my personal favorite. <br><br>From there, you might order some chips and guac for the table, along with an order of queso fundido (spicy, cheesy heaven - get the one with chorizo and poblano peppers). <br><br>Make sure you leave room for the main course, because you will not be disappointed. Again, you can't go wrong here but my favorite dish is the Tacos Arabes, which includes pork, caramelized onion, and a variety of other noms.<br><br>There was a time when the wait for dinner would get absurd - I'm told it's not like that anymore, but IF you're concerned about getting in, arrive before 5PM and be prepared to go inside to put your name in when they re-open for dinner at that time.", "pics": null}}, {"review": {"des": "I've had this restaurant bookmarked on Yelp for as long as I can remember! Needless to say, I had high expectations that, unfortunately, were not met. We actually got sat right away on a Saturday night without reservation, but it was in the dungeon of a basement they have... not my favorite dining ambience.<br><br>Our table started off with the Queso Fundido (Classic Frontera style), which felt like a plate of melted cheese with some peppers & a spoonful of chorizo on top. I mean it was tasty, because cheese is ALWAYS tasty, but not as flavorful as I was expecting. <br><br>I ordered the Enchiladas (Chef's Choice), which at the time was duck carnitas. It was a large order that definitely filled me up. The whole dish was on the dry side. There were a lot of interesting flavors, but in terms of enchiladas, I could probably get just as enjoyable enchiladas for a fraction of the cost elsewhere. <br><br>It definitely won't be in the running for my favorite Mexican restaurant, but it is still a good meal. If you want to eat at a Bayless restaurant, I would 100% recommend heading over the Lena Brava (amazing - 5 stars!)", "pics": null}}, {"review": {"des": "Worth the wait. The staff will text you when your table is ready.<br>Best Mexican food in Chicago.<br>Great service. Patio seating. <br>I had enchiladas. I inhaled them.<br>The others in my party had meat heavy dishes. Delicious.<br>\"The Best\" Margerita really is the best.  <br>I can wait to go back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Mxtp19F7fDeu7d0wP1H6ew/348s.jpg", "caption": "Margarita and what's left of our dinners."}]}}, {"review": {"des": "Can get expensive but worth the unique tastes! I highly recommend starting with the cheese quesadillas/empanadas and ordering the smoked chicken dish, it's truly one of the best chicken dishes I've had. Hubs got carne asada ribeye but preferred my chicken. The Mexican got chocolate was a nice meal ender.", "pics": null}}, {"review": {"des": "Best Mexican in the US.  Never had anything bad here  too class from start to finish.  Unfortunately no reservations", "pics": null}}, {"review": {"des": "Mexican cuisine done right.  I highly recommend cafe de olla versus regular coffee, it amplifies the experience and it's the best cafe de olla I've ever had!  Menu changes seasonally and is vegetarian friendly.  I've been here multiple times and haven't been disappointed.   I once got undercooked sopes and our waiter and staff handled my complaint marvelously.  Great service, delicious food and reasonably priced.  Love this place!", "pics": null}}, {"review": {"des": "A very well deserved 5 stars. I was hesitant to come initially thinking this Rick Bayless staple was mostly for tourists, WOW was I wrong. Their is no skipping corners here. Came in for brunch, all the coffees were amazing, not overly sweet and with the right amount of spice. The eggs bajillo were one of the best spins on eggs Benedict I have ever had. The mole enchiladas were out of this world. Bring from Los Angeles and having gone to Mexico many tines I can honestly put Frontera up with the best I have ever had. Bravo!", "pics": null}}, {"review": {"des": "Trips to Chicago from St Louis always call for lunch or dinner at Ricks. Comida riquísima ! Y las margaritas- wow!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FEFtrjP6eCcMfSNy3MrPlA/168s.jpg", "caption": "Best margaritas!!"}]}}, {"review": {"des": "We showed up without a reservation on a Friday night and were added to the waitlist. 15 minutes later, they seated us at a table in the bar. I had high expectations, and the ceviche sampler exceeded those expectations, but that turned out to be the highlight. My other dish, grilled chicken mole, suffered from a off-texture. I think it was cooked sous vide and it lacked any signs of being placed on a grill. The mole was also bland, quite disappointing. Was full after the entree so we skipped dessert. <br><br>Service was excellent, as was the ambiance, but the food disappointed me. I was hoping for a transcendent Mexican meal from one of the US experts on Mexican cuisine and instead paid a decent sum of money for some sub par mole. Bummer.", "pics": null}}, {"review": {"des": "I'm a huge Bayless fan but this was def not my favorite restaurant out of them all. There was a lot positives but it was three star worthy for an overall experience.....<br><br>The staff seemed grumpy from hostess to multiple waiters that took our order, even if the were quick.  For the food, chef special guacamole was delish and definitely unique. The lengua was amazing and would come back just for that!  We asked the waiter for their hottest salsa and he came through. The habanero salsa is not just hot the flavor was amazing as well. <br><br>The Oaxaca carne asada was one of the servers fav dish was just ok for a $35 plate of food.  Definitely think it was just an upsell for the most expensive plate, so I'm not a fan of the wait staff even more now. If that's the best plate by Frontera I would not want to try their other entrees!", "pics": null}}, {"review": {"des": "Took 10 minutes for the waiter to see us. The place looks like a low end mexican cafeteria. You get peanuts instead of chips and salsa which was a bit different than the traditional American mexican restaurant. The prices are WAY TO HIGH for the experience and food you get. I got and order of steak tacos for $20 and the steak taste like charcoal (seriously burnt). They were nice to get it off our bill, but all in all this restaurant its not river north material and won't be coming here again.", "pics": null}}, {"review": {"des": "We landed in Chicago at 9:45 am and were in line for Frontera at 10:30, literally seconds before they called everyone in, with about 25 people ahead of us.  The restaurant is pretty big so we all got in and we quickly got down to business:<br><br>Chilaqiles with Guajillo: Loved the concept of the tortilla \"casserole\". They chopped up the tortilla and it almost felt like a flat pasta. The red guajillo chile sauce was delicious.  4/5<br><br>Mushroom Mixiote:  Can't go wrong with wild mushrooms. I wish the dish had more chochoyotes (the corn masa dumplings) since that was the best part of the dish.  There was a fair amount of spinach as well. I would consider this dish one of the more healthier brunch options. 3.5/5.<br><br>Tacos Al Carbon: We went with the Guanthorp duck.  I thought it was decent but didn't taste much red chili adobo which was supposedly the marinade for the duck. The other ingredients like the beans, peppers and salsa were tasty though. 3.5/5<br><br>This was a boozy brunch so I had two Chapacabras, a delicious cocktail with tequila, lime, cucumber and chipotle.  <br><br>Definitely recommend.<br><br>FOOD: 3.75<br>VALUE: 4<br>SERVICE: 5<br>DÉCOR: 4", "pics": null}}, {"review": {"des": "I'm from NYC and this was one of the most delicious restaurants I've ever been to! My girlfriend and I loved the meal so much, we even stopped for one more meal at the airport while we were going home. The waiters were very knowledgeable about the food and allergies.", "pics": null}}, {"review": {"des": "This place has amazing food. The flavors are very developed on each dish. <br><br>Ceviche Trio - 3 distinctive flavors. All delicious and a lot of food.  5/5<br><br>Tamale - No filling which was strange, but still very good. 3.5/5<br><br>Tortilla Soup - They have been making this for 31 years. Unreal flavor. Must try. 5/5<br><br>Shrimp w/ Mole - The mole tasted more like salsa but the shrimp has a nice wood fire flavor. 4/5<br><br>Oaxacan Steak -  Excellent ribeye and large portion. 4.5/5", "pics": null}}, {"review": {"des": "I was expecting too much I think. The service was prompt and friendly. But, the moment we had the guacamole, I knew this wasn't going to be an out of the world experience. We left after having a tiny glass of margarita and that bland guacamole. Overpriced and overrated.", "pics": null}}, {"review": {"des": "The habanero black angus flank steak was dry and had little flavor.  I would recommend a different dish.  The side of corn masa with a white cheese was interesting and good.  My wife and I enjoyed the ceviche trio.  The clear winners were the grilled roasted elote corn, along with the peanuts everyone gets.  The spice mixture on those two were awesome.<br><br>Service was above average.", "pics": null}}, {"review": {"des": "Is that Really your policy that working folks in UNIFORM may not sit in the airport restaurant to enjoy their purchase??? It's okay if a uniformed worker such as a police officer or flight crew PURCHASE something from you- they just can't EAT it there -am I clear? Or just I just witness one of your employees make up their own rules and ask folks to leave your establishment?? Wrong on all levels- shame!!!", "pics": null}}, {"review": {"des": "Food:  Amazing<br>Drinks:  Great<br>Service:  Solid<br><br>Reservations are a must; this place gets hopping (well done Mr. Bayliss).  Great Mexican ambiance with helpful and knowledgable staff.   We tried four apps, drinks and shared one entree.  All of the food was excellent.  Our waiter recommended a tequlia and helped this gringo understand why and how to drink it.<br><br>If you're in River North (or near there) visit Frontera.", "pics": null}}, {"review": {"des": "Frontera Grill came recommended to me by a friend. And I mean, he reeaallllyyy hyped it up. Boy, did it live up to the hype and then some. Super groovy ambiance and absolutely delicious food. Our table ordered the Oaxacan Carne Asada, the Flautas Picantes and the Ceviche Trio. NONE of us left disappointed. My carne asada was off-the-charts delicious and my wife loved the flautas appetizer that she ordered as her entree. The one thing I missed though, was the standard chips and salsa that you can usually snack on at most mexican joints. There were none! That was a bummer, but the delicious, high-quality food made up for it. I can't wait to come back.", "pics": null}}, {"review": {"des": "I went here for lunch during restaurant week.  I ordered the ceviche, tacos, and flan.<br><br>The ceviche was amazing and very fresh.  The pork tacos were very good.  They make their own corn tortillas which are very good.  The flan was a lighter flan than usual that was topped with mango and other fruit.<br><br>Overall, it was a very good lunch for the price I paid", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/w7h59TWo59ApYd6lusYfAg/168s.jpg", "caption": "Ceviche during restaurant week"}]}}, {"review": {"des": "I'm not a fan of real authentic Mexican (get me a Chipotle or Chevy's any day) just because I think chocolate moles are weird. But this place was much better than I expected and had some surprises. <br><br>For my cocktail I ordered a Mora Menta. It tasted like tequila and soda mixed in with fruit juice and chilis. Although different, it wasn't that bad. The guacamole is really good here. I couldn't get enough of it. <br><br>We also ordered a tuna salsa - although good, avoid that if you have to. It cost $16 and barely a few teaspoons of tuna buried at the bottom. <br><br>My main course was the Friday special which was a slow braised beef. It was very tender and came with a mole sauce of chilis and chocolate. I though it was going to be bitter and spicy, but the taste was actually quite mild.", "pics": null}}, {"review": {"des": "I enjoyed my dinner here.  My partner and I shared the classic ceviche, the classic guacamole, and my main was the pork in veracruz red mole sauce.<br><br>Of all the dishes, the ceviche was not that impressive.  The pieces of the tuna were small and the flavor not that great.   The guacamole was very good thought. I enjoyed the simplicity of the dish and the flavors of the avocado.<br><br>The pork in red mole was excellent.   The flavors of the red mole was very savory.   It help kick up the flavor of the pork in a good way. The pork was served tender and moist. This was a very good dish. <br><br>I found the service to be very attentive. The wait staff was always refilling our water and cleaning the tables after cleaning the plates.<br><br>I am happy to have visited and will visit again when I return back to Chicago.", "pics": null}}, {"review": {"des": "Wonderful options for vegetarians. And not fried beans. :)<br>Had the tastiest tacos I have ever eaten on corn tortillas here. My guy and I decided to get the portabella on corn tacos, with black beans and guac, with a side of asparagus in a chocolate mole sauce and squash and onions in a cream sauce. All of the veggies together in the tacos was an explosion of spicy, sweet and so flavorful, it kept me eating more and more tacos, more than planned. I struggle often with eating vegetarian and this place made me absolutely love eating Mexican. Well done Rick Bayless.", "pics": null}}, {"review": {"des": "Totally struggled with this review because I generally am a fan of Bayless and all things in his empire, but while lunch here was fine, this probably won't be on the list for a return trip... <br><br>Had the shredded beef enchiladas and seafood tostada... <br>Enchilada had good depth but some sweetness to it that I didn't really care for, and not enough sauce/cheese that my little Texas heart was craving <br>The tostada was more tart than flavorful, enough so that the third tostada wasn't touched... Although fresh enough that I would pick at it...<br><br>I thought dessert (tres leches) would be chocolate overload but was had less chocolatey flavor than expected...<br><br>Service was fine (friendly if a little inattentive) and the salsas were authentic....", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pNPlbSnCHbowRRMxkkZU1Q/348s.jpg", "caption": "Seafood tostada"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/B5HMgdlYwMRLhx9RqiTGNA/168s.jpg", "caption": "Beef enchiladas"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/joqW9LVEDd0wGL36Z5a4CQ/168s.jpg", "caption": "Chocolate tres leches"}]}}, {"review": {"des": "La Vista, above Frontera Grill, was the perfect setting for my daughter's intimate wedding last night.  The guacamole cart, ceviche, tacos made to order (with tacos being pressed real time), fresh churros and chocolate pecan bites were better than you can imagine.  And the Topolo Margaritas are the best you will ever have.  <br><br>The room was gorgeous and the music and ambience just right. <br><br>Thank you Dana and Raymond for planning and executing a perfect event for my family!", "pics": null}}, {"review": {"des": "My friends and I dined here earlier this evening. The food and wait staff were fantastic, but the reason for my rating was the rude behavior demonstrated by the woman working the valet desk. Her attitude was beyond repulsive and it was uncalled for. She accosted my friend by putting her finger in my friend's  face and she lied about what time the restaurant closed simply so she could leave early. Granted she doesn't work for Frontera Grill, but she is affiliated with them so therefore she does represent the restaurant and is doing them a terrible disservice.", "pics": null}}, {"review": {"des": "Food was amazing! Service impeccable. Very reasonably priced. We were pleasantly surprised! Would definitely eat again!!", "pics": null}}, {"review": {"des": "Yes, yes, holy hell yes! First night in Chicago my friend and I are walking the street to head to a bar and she spots Frontera. She tells me that it's famous and we should've planned ahead to eat there. I check online to see if there's any reservation available, and there's a spot in an hour! It couldn't have been more perfect. When we arrived we spent a long while determining which route to go for dinner and ended up with: <br><br>The Oyster/ Ceviche Half Platter: Do it. Absolutely do it. It's a good sized portion, with amazing flavors and super fresh seafood. <br><br>Smoked Chicken Queso: It's the chef's recommendation for a reason! Trust! It also comes with corn tortillas (so warm and delicious) as well as chips.", "pics": null}}, {"review": {"des": "I had to make reservation months in advance. There was 6 of us so I understand that is never easy when dining with a bigger group at a very popular restaurant. Sometimes it is crazy to me to think this place has been around for so long and still before opening this place has a line out the door. <br><br>This past Saturday my family and I went to Aladdin and then had reservations at 6PM for 6 people. We got out of the play early and thought maybe they could take us early. There was a line out the door before opening at 5PM. We decided to grab a drink at bottlefork which is just next door. At 5:40, we walked next door to Frontera and walked in to a packed Frontera lobby/bar area. I walked up to the host stand and was welcomed by polite staff and escorted to our table. <br><br>We sat in the basement which is a lot different than the upstairs. I prefer the downstairs, more quiet, not as chaotic, a little chillier but personal opinion a better experience than the craziness that is upstairs. Some people want that energy but I liked the subdued basement. Our waiter was pleasant and refilled water/soda glasses, and got our drinks promptly, as the rest of our food. Here is what we ordered:<br><br>Starter:<br>-Basic Guacamole- delightful comes with a handful of chips, bowl of guacamole, and two salsas. I could of ate the whole thing myself, but best served for about two people<br><br>Entrees:<br>-Cauliflower Steak- Take a cauliflower slice in half and roast it. Top with black beans. It was a lovely somewhat healthy dish<br>-Pork Tacos- good, basic <br>-Pork Enchiladas- good, basic<br>-Smoked Chicken with the skin with sweet corn sauce- chicken is sliced and served over a sweet corn heavenly sauce, mashed potatoes and green beans. Super good if you like chicken and cream sauces. <br>-Carne Asada Brava- really good, thinly sliced steak, and the tamales that come with it are amazing <br><br>Sides:<br>-Mash Potatoes-thick creamy heaven<br>-Fried Sweet Plantains- topped with crema which was subtle and amazing<br>-Traditional Black Beans- Frontera's black beans are my favorite black beans ever. Thick, served in a mini cast iron skillet. sooo good. <br><br>Dessert: <br>Mexican Chocolate Ice Cream with a side of Chocolate Sauce- good for one to two people. Chocolate creamy ice cream. With a silky side of chocolate<br>Mexican Vanilla Ice Cream- tasted more like sorbet than ice cream. Sweeter and light. It was good.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jROCWm8WQ3QNGIAArbOZlg/168s.jpg", "caption": "Vanilla ice cream"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LSvYUuMbbQ8X4bNq9CH6HQ/168s.jpg", "caption": "Cauliflower steak"}]}}, {"review": {"des": "Having been to Xoco last time we were in Chicago, this time we opted for Rick Bayless' James Beard awarded restaurant Frontera Grill. As I was in a soup mood, we shared their famous tortilla soup ($9) and the carnes al carbon para tacos ($20).<br><br>The soup was a dark broth with pasilla, grilled chicken, avocado, artisan Jack cheese, homemade crema, and crispy tortilla strips. It was hearty and delicious - the perfect soup for whether you're cold or just need a warm hug inside.<br><br>We opted for the skirt steak tacos, but our server made a mistake and brought us portobello mushrooms at first. He was nice enough to comp us for the mushrooms, and we ended up having both the steak and mushroom tacos for the price of one. The steak was marinated with garlic and a variety of spices, while the mushrooms were marinated with garlic, agave nectar, and spices. Both were delicious and packed with flavor. I wasn't even that hungry, but the tacos made me eager for more. <br><br>For less than $40, we had a very satisfying meal at Frontera Grill. We would absolutely come back here (or any of Rick Bayless' restaurants to be frank). There are a lot more options on the menu that we haven't tried, and we'll just have to come back to Chicago soon to get our Bayless Mexican fill.", "pics": null}}, {"review": {"des": "Holy crap! This is the best Mexican food I've ever had (and I've had real Mexican food in Mexico, as well as having a ton of great options here in Phoenix). I just can't say enough about the quality of the food here, all the way from the chips and salsa to the post-meal coffee.<br><br>I started with chips, salsa, and guacamole. Chips - super fresh, tasty, and crisp. Salsa - amazing flavor, and it was so well prepared, not watery like most restaurants. The guacamole was better than mine! Perfect mix of chunky and creamy; great heat; and the ingredients just like I like it. Best guac anywhere.<br><br>For the entree, I had the enchiladas. Now, I'm a vegetarian, so I asked for them with no meat. You get three enchiladas and black beans. Even the black beans were freaking gourmet awesomeness. The enchiladas -- just wow. I'm really picky about enchiladas. From the tortillas to the meltiness of the cheese, to all the flavors that go into it, I have massive expectations for a simple enchilada. And this place -- just wow.  Best, most flavorful combination of cheeses and incredible sauce. Can't say enough about it.<br><br>I finished with a cappuccino, no really expecting much. This cup of coffee tasted like I was sitting right in the middle of a rain forest. Holy cow.<br><br>If you're in Chicago, you gotta put this place on the agenda, no matter how long the wait is.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4KUxHH4gErJdO5GlRVf94g/348s.jpg", "caption": "\"Vegetarian\" enchiladas with black beans. Amazing."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Jq6auLJqjThCFHei-XYz1Q/168s.jpg", "caption": "Chips, guacamole and salsas. Wow!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NnA35bCv4jAhN5mLHc0WDA/168s.jpg", "caption": "Cappuccino"}]}}, {"review": {"des": "I'm obsessed with Rick Bayless, so this is a stop in Chicago every time I'm there.<br><br>I always order some kind of braised meat. They bring you out homemade corn tortillas and some sauces, and you can just make your own tacos, or eat some meat without a tortilla. It's a joy of a meal. The tequila drinks are always spot on.<br><br>If you go on the later side (maybe 30 minutes before closing), you can usually get a few seats at the bar. It's a perfect place.", "pics": null}}, {"review": {"des": "Simply put: this is the best Mexican food I've ever had, even better than I've had in Mexico. And this was just at brunch - I cant even imagine dinner here.<br><br>My wife and I each started with a Chupacabra, which was essentially a Mexican Bloody Mary and some guac. Both were awesome ways to kick off the meal. The guacamole also came with some roja and verde salsa, which also packed a lot of bold flavors. <br><br>For entrees we split the Mole Enchiladas and the Enifrijoladas, which knocked our socks off. The mole was uber rich and as authentic as could be. There were so many rich flavors, that the side of beans actually helped cut the intensity haha. The enifijoladas were equally as impressive, with intense flavor (and spice) from the chorizo, balanced by the crema, black bean sauce, and sweet plantains, which put the dish over the top.", "pics": null}}]}