{"name": "furious-spoon-wicker-park-chicago", "reviews": [{"review": {"des": "Furious spoon is a unique spot with fun twists on ramen. The dish I ordered was the Holy Cow ramen which has chili-infused noodles and spicy beef bone broth, neither of which I've seen before. The menu suggests adding egg and garlic on this one, and I complied. The dish was meaty, funky (in a good way), garlicy, and had a solid spice that builds as you go. I didn't think it was all that spicy upon first slurp but by the end I was a little dewy. <br><br>My wife ordered the Furious bowl, which is a spicy tonkotsu broth that ALSO HAS DUMPLINGS IN IT. I'm 100% on board anytime you can sneak a dumpling into a dish. Everything about this one was good as well... the pork belly was tender, and the marinated mushrooms were really good. <br><br>We also ordered the fried dumplings, which were classic and delicious. The wrappings were nice and crispy but not too heavy. Everything we ate was good, and the ramen was interesting, so we'll definitely put this on our list to repeat.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cFUO-jrxvux2vD3UaNM9jQ/348s.jpg", "caption": "Furious Bowl"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qWQ_Fp26f3xaQClmvkdryQ/168s.jpg", "caption": "Holy Cow Ramen"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cGI698QxEnpyMSMd0BwPMA/168s.jpg", "caption": "Fried Dumplings"}]}}, {"review": {"des": "I like ramen and I like 90s hip hop as much as the next guy. The problem here is that they play the music at ear-splitting volume. <br><br>I was meeting my brother for dinner, and we'd never tried this place. He was there already. I sat across from him. We started shouting at each other, because that's the only we were going to be able to communicate. After 30 seconds, it became clear it was going to be impossible to have a decent conversation. So we left for another ramen joint down the street.<br><br>So, if you prefer to have your conversation in shouting mode, or like loud music while eating alone, this is the place for you. I hear the food is good, although I never did find out.", "pics": null}}, {"review": {"des": "Wait: 5-10 minutes to order and pay for Saturday night around 6 pm. More than 1 hour to get the food<br>Ambience: music is loud and a bit tight. Japanese style tables and stools are cute though. <br>Service: pretty much self service except they deliver food. Have to ask for a spoon for the soup. Most likely they r overwhelmed and busy. <br>Food: I regret I ordered new chicken dumplings ramen. I love ramen and I do like pretty much almost all ramen but not this one. My sister had beef rice bowl and that was okay. <br>Price: not pricey for most item<br>Overall: I won't plan to come back. But please read other reviews as I didn't try other ramen types and my review might be bias", "pics": null}}, {"review": {"des": "Hip place with the hip hop jamzZz<br><br>We got the Furious Ramen and the Holy Cow. Both are on the saltier side, but if you're choosing between these two and want the less saltier one, choose Furious Ramen. I like my food mild so I asked for the spicy sauce on the side, and appreciated that the broth isn't super fatty. The garlic pork is not super tender but it's still good, and the winner is definitely the egg which is cooked perfectly.", "pics": null}}, {"review": {"des": "The ramen was good but not great. I can't have fish or seafood so the only option I had was their vegan ramen because all of the other ramen has tuna oil or seaweed flakes cooked in to the broth. I'm sure if I was able to have their signature ramen it would have been better. I got the vegan one and added chicken wontons. They were actually my favorite part! The broth just didn't have a lot of flavor or spice to it. It is rare that I feel like I need to add salt to anything and I felt like I did for this. I was surprised that it was loaded with noodles- I liked that cause ramen is usually super brothy.  It's a cool vibe on the inside with great people working. I probably wouldn't return but I'm glad I tried it!", "pics": null}}, {"review": {"des": "The Skinny: It was all right for a fusion take on ramen, but didn't stand out to me in any notable ways. Neither the worst nor the best I've had. Not a \"must-visit\" location in my opinion, but I also wouldn't tell anyone not to go.<br><br>The restaurant itself is cool.<br><br>The broth was very oily and I reckon was responsible for the time I spent on the toilet after dinner!", "pics": null}}, {"review": {"des": "The holy cow ramen is absolutely amazing! I ordered it 2 days in a row; it's just that good. Delicious broth, veggies, ground beef with chili noodles. They cook the eggs perfectly even for delivery, so be sure to add it as a topping!", "pics": null}}, {"review": {"des": "I go here often, you shouldn't. Then there's more room for me. I just found out this a Chicago chain, this one is just close to ma sista place!! You should ask try the OTHER locations. Thanks", "pics": null}}, {"review": {"des": "This place is pretty good, and I'll be back. I love ramen, and I tried the Furious Bowl here and it was very good! Cleared my sinuses for sure, but it's not deathly spicy (if you are a spicy food fanatic). <br><br>I came here with my friend Saturday evening around 9pm, and I didn't know how ordering worked. You walk through the doors, and you order your food at the register, they give you a number, and you sit anywhere you want. When your food is ready, the workers bring the food to you. The place has a menu that you order from, and then you can choose from an add on list of you want to add more for a few dollars extra per item.<br><br>When my friend and I received our food, we both commented on how much food was in the bowl. They do have big portions. At the tables, the place has napkins, reusable chopsticks, and ladles. However, I can barely use chopsticks, and the ladles weren't picking up the noodles, so we had to ask for forks. Our broth wasn't too oily, and both were creamy and delicious.<br><br>As for the atmosphere, the place is pretty small with wooden communal booths along the left wall. This place is known for how their ramen meets hip-hop, but quite honestly, the music was so fricken loud, I couldn't hear what my friend said during our whole dinner. It was very annoying. I understand that Wicker is known for their bars and nightlife, but when I eat dinner, I want to be able to have conversation...", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hzqX9IlFc9yYQx9_jvy1_w/348s.jpg", "caption": "Cool painting on the wall"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pUMM0wAB9EFB9804DxWw4g/168s.jpg", "caption": "Furious ramen (front) vegetarian ramen (back)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tExCrYDdDlnRWP08XoDAjw/168s.jpg", "caption": "Furious ramen!"}]}}, {"review": {"des": "I was in the mood for some ramen so we decided to wander around Wicker Park and go to the first ramen place we saw. Furious Spoon just happened to be the first! It was 5 pm on a Saturday, which is a little earlier than the usual dinner time. The plus of going early is that there weren't that many people there so no wait and we got the end of the table to ourselves. Plus it gave us some time to walk off dinner before getting dessert (Jeni's!)<br><br>You order your food at a counter when you first walk in. We told them it was our first time there and the guy at the counter was super helpful in explaining the menu. We both ended up getting the furious ramen with corn. <br><br>Breakdown of the ramen: <br><br>Noodles: The noodles were good. They weren't too chewy or doughy or under/overcooked. They are pretty thin so this probably isn't the place for you if you like thicker noodles. <br><br>Broth: The broth was also flavorful and not too heavy or oily. It wasn't super spicy to me but I do have a rather high spice tolerance- so take this with a grain of salt!<br><br>Toppings: <br>The egg was cooked beautifully- super runny yolk and egg whites basically dissolved into the broth as well. The bowl also came with two dumplings which is new to me- I've hardly ever had ramen that also came with dumplings! The marinated mushrooms surprised me as they were kinda sweet which is unexpected. I'm not quite sure I liked that and would much prefer a more savory marinade. I was disappointed by the corn- they were rather tough and hard and not like the sweet corn that I'm used to- would not recommend getting the corn! I was also somewhat disappointed with the meat. We got 2 thin cuts of chashu pork. I'm also used to chashu being super tender and a little fattier, but that was not the case here. <br><br>********************************<br><br>Overall I had a good experience here. They do play hiphop rather loudly, not the typical music of choice for a ramen shop and probably isn't everyone's cup of tea but I actually kind of liked it. Gave the place a nice hip vibe.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UM1O0qvG4tpFwHpeAum98g/348s.jpg", "caption": "Furious ramen"}]}}, {"review": {"des": "Went here on a chilly fall day and boy was it exactly what I needed. I got the furious ramen and it was delicious! Just the right amount of kick and the egg complemented it really well. If you don't like spicy food just ask them to go light on the spice I believe they do accommodate. Only complaint is that I had like 3 pieces of pork in my entire bowl. For 15$ I was expecting at least 4 lol. Friend got the holy cow and liked it but also said that the ground beef tasted odd. But then again that's ground beef for ya. <br><br>It's super cozy inside. Came at like 3:30 which is an odd time and it was packed. Got lucky and got two seats. Seating is pretty limited and it's not somewhere you can go to have private convo since the tables are cafeteria style. <br><br>Overall favorite ramen I've had so far in Chicago!", "pics": null}}, {"review": {"des": "Came in not really excited because I heard furious spoon wasn't authentic ramen! But man oh man was I told wrong! I was undecided about two kinds and the informative ladies helped me out by saying that one was going to be discontinued tomorrow, so I had to try that! I forget what it was but I have the picture attached! The music was bumpin and I had a daisy cutter on the side, plus good company!! You must come here for some dope hip hop music and even better ramen <br><br>I also love the wooden communal seating- stylish, lacked comfort due to the material- but that was a minor detail", "pics": null}}, {"review": {"des": "I didn't choose the ramen life, the ramen life chose me. Before furious spoon, I did not like ramen because I had never had any that was this good! One day I stumbled across this place with some friends and I couldn't stop going back for more. It was incredible! This is my go to when I'm craving some. Furious spoon was something I never knew I needed but I'm glad I found. They have a ton of amazing options including things that are spicy and things with no spice at all. They have a delicious veggie ramen but the chicken dumping is my favorite soup on the menu. These bowls are massive so you can even split it with two people. I used to go here all the time when I lived in the area. Just thinking about it makes me want to get in a car and go on a road trip for more", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xDcTMhNTeM7FTjmqhowPBQ/348s.jpg", "caption": "Chicken Dumpling Ramen"}]}}, {"review": {"des": "Second time here. Still as good as the first. Had the furious ramen, mushrooms, dumplings and pork belly. The broth is authentic and has the perfect amount of spice. I'm sure previous reviews hit on the rap music ambience... plus in my opinion.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6JBtCM2fYBMLlMYZ6ax3OA/348s.jpg", "caption": "Furious Ramen"}]}}, {"review": {"des": "This place is AMAZING. From the service, to the atmosphere (enjoying the hip hop and beats!), and especially the food. Please get the Ahi Tuna Poke Bowl AND a ramen bowl! I got the Pork Shoyu and my friends got the chicken dumpling shoyu, and my other friend the vegetarian. It was amazing. You can really taste everything in the broth. It's delicate but flavorful. The noodles are cooked perfectly and you can tell it's fresh. Every cut of pork, every nori, or vegetable - they play off of each other in an amazingly perfect symphony. It's so good. Love this GEM of a place, come in and enjoy a bowl<br>Of ramen !", "pics": null}}, {"review": {"des": "Furious Spoon was quite the let down. We were skeptical about dining here and probably should have trusted our gut instinct. En Hakore 2.0 was closed so we resorted to trying Furious Spoon. <br><br>During a Sunday late lunch it was packed. There was only one cook and he had to juggle in house orders as well as carry out all by himself. It felt like we waited a while for our food. The menu strictly serves ramen and rice bowls with sides and toppings. No appetizers or desserts. We settled on Veggie Ramen & Furious Ramen. <br><br>I had the Veggie Ramen and it was the worst broth I've ever had. It had a strange vinegar taste. The bowl was served at room temperature which made it difficult for the noodles to fully cook, leaving the noodles with a lot of bite. The majority of the \"veggies\" were bean sprouts and red & green cabbage with slivers of mushrooms. The strangest Veggie in the bowl was the full sized garlic cloves. I thought it was a mushroom and was taken aback in confusion. They were buttery but very potent and did not complement the broth or other vegetables. The Furious Ramen had better broth but the spice was a throat scratching spice vs a heat spice, not pleasant. Ingredients in this bowl made more sense but once again the soup cooled down very fast. Both of us were on the brink of asking for our bowls to be re heated but we decided the food wasn't worth finishing. <br><br>All in all the blaring hip hop music and cool decor couldn't make up for the poor quality of food. In my opinion Furious Spoon is the Chipotle grade of Ramen.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wshilTS3xbpDCPu6aK-KiQ/348s.jpg", "caption": "Vegetable Ramen"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/V2bwn68K21R16d2giStfKw/168s.jpg", "caption": "Furious Ramen"}]}}, {"review": {"des": "Not authentic at all. It's on par with Top Ramen, but ridiculously pricey. If you want a white person's idea of ramen, complete with loud angry rap music blasted at you, then this is the place for you I guess.", "pics": null}}, {"review": {"des": "Checked this place out when you're in town!<br>I had the vegan bowl with tofu added. Their broth is wonderful! I tried my son's meat based broth and compared it with my vegan broth and the vegan won out. Large portions, delicious add ons. I left stuffed.<br><br>The ambiance is super fun. Graffiti style art on the walls and industrial seating makes for a great time. Lots of old school rap playing.<br><br>Also, not for nothing, their rest room is clean and roomy.<br><br>Will definitely go back.", "pics": null}}, {"review": {"des": "Update- these guys still have not contacted me. Disregard the owner's response, he apparently just did that to look like he cares about harming customers. Avoid this business!", "pics": null}}, {"review": {"des": "I've visited a couple of times because of the convenient location but its not my favorite ramen shop in Wicker Park or Chicago for that matter.<br>The noodles are decent, but my biggest gripe about Furious is the saltiness of the broth. The broth is creamy and has a lot of flavor but probably 25% extra salt that it detracts from the flavor of the [meat] stock, all you can taste is just salt and chillies. Had the new \"Holy Cow\" beef ramen recently and like another reviewer below said, I would not recommend. It's a thick beef broth, with ground beef, so it was a bit like eating spicy spaghetti. On the plus side, the toppings are great, I am really impressed with the perfectly cooked eggs (just right).<br>Hip place, loud music, and they've added outdoor seating. Honestly there's so many ramen places up and down Milwaukee Avenue, you should judge yourself.", "pics": null}}, {"review": {"des": "Hm, I'm not impressed. I had a Holy Cow with recommend toppings. I did enjoy it since I was craving hot broth. But it's no ramen, more like a Chinese noodle bowl. I'm fine with it not being a ramen as long as it's justified, but for a hefty price of 17 bucks it was not good enough. I prefer Kizuki.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/edDheWGNEeeXgajOmaD4-g/348s.jpg", "caption": "Holy Cow. Good enough to cure hot broth craving but not good enough to justify its price point."}]}}, {"review": {"des": "So I'm not big on Ramen or soups in general. I dined here to conclude an evening of heavy drinking. Perfect place! I ordered the Ramen w/ fried green beans, wontons and other stuff I don't remember. The point is, it was lovely and I had enough for breakfast the following morning. I can't wait to go back!", "pics": null}}, {"review": {"des": "Came here for the ramen. I had the furious ramen and added Thai chiles. The mixture was pretty good but I wish the noodles were a bit bigger. They seems to be lumped together which was a bit odd.<br><br>The meat was weird, the pork was basically room temperature while the rest of the soup was hot. It was very weird that it was like that. I'm not sure if I would come back to pay $12-$15 for a ramen like this. It was filling and good but definitely over priced. Toppings were an extra 75 cents which is a bit ridiculous. They added four Thai chiles and it cost 75 cents. Beats me.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yB3M-l1ofwtwtSwbQqG4xg/348s.jpg", "caption": "Furious Ramen"}]}}, {"review": {"des": "It's pretty good when you are craving ramen and in the area.  I used to frequent this spot due to its late hours and quick casual environment. Service has always been great, and I like the quick serve style of the restaurant. <br><br>The ramen can be hit or miss... I've noticed on certain nights the broth can be a little overly oily, and it doesn't seem as though the flavor had time to develop from slowly cooking.  More often then not it is good enough to satisfy my ramen cravings especially during the colder months.<br><br>The location, price, service and hours definitely make this restaurant.", "pics": null}}, {"review": {"des": "We had the ahi tuna poke app and two ramen bowls.<br><br>FOOD (3/5): The food was OK. You can see that they take this wad of noodles and use what looks like a deep fryer (it's not actually a deep fryer) to put it in boiling water. The noodles were almost too al dente, the broth was okay, and both of us commented how it wasn't really like ramen. It didn't taste bad, though. It just tastes more like what you'd see at a Chinese noodle shop, which is just a different texture and flavor profile. Also, there are green beans and corn in the ramen, which definitely makes it not taste like ramen, but more like a soup that happens to have noodles in it.<br><br>ATMOSPHERE (3/5): There are speakers on top of every part of the table, while they blast loud music. It was Saturday at 2 PM, and we couldn't really hear each other without leaning forward and talking loudly. Not sure why places nowadays do this (I get that it makes it more \"lively\" but yo, your guests need to be able to hear).<br><br>PRO TIP: Order ahead of time! We had never had Furious Spoon before, and it seems like a lot of people had ordered before and were getting their orders before us despite rolling in later, but probably because they had ordered ahead. It will save you some time!", "pics": null}}, {"review": {"des": "On a cloudy rainy day, I was in need of something warm and delicious. Friends suggested Furious Spoon and it was everything I had hoped for. I had the Chicken Dumpling Shio. The ramen with the dumplings, green beans, and corn went really well together and was delicious! This was exactly what I needed for a day like today. I added a little chili to my bowl to give it a touch of spice and it was so good, I ate the entire bowl wishing I had more. Looking forward to going back to try their other dishes.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Yy0B9eQjzQQei1f4iqTVzA/348s.jpg", "caption": "Chicken Dumpling Shio Ramen"}]}}, {"review": {"des": "First time Here <br>I Had No Clue as to what to order!!!<br>The Beef Rice was Amazing!<br>The Shrip Mazamen was the Best!<br>Highly recommend", "pics": null}}, {"review": {"des": "AMAZING. i got the holy cow because i love spicy food and it was so good!! The portions are huge so for the price, i got 2 meals pretty much! So so delicious. I love the vibe inside too! All of the workers were very nice and helpful. I'm definitely going back!", "pics": null}}, {"review": {"des": "I don't really understand what the hype is all about or how Furious Spoon is able to open up so many locations in such a short amount of time.<br><br>I came here with three other friends, and I ordered the Furious Ramen. I wasn't at all impressed with it and was severely disappointed, as I've been seeing them all over my Instagram. The broth was lacking in flavor, and I couldn't tell what it was missing. <br><br>My husband has the citrus chicken ramen, and the flavors just didn't work well together! <br><br>There are SO many other ramen locations. You can do better.", "pics": null}}, {"review": {"des": "We were in Chicago for my bachelorette weekend. Obviously any hangover needs ramen and we were quick to ask our local friends where to go. They were quick to tell us furious spoon is what we needed, so away we went.<br>As soon as you walk in, you know your in the right place. In Cleveland we don't have any true ramen spots like this. You can literally build your own amazing creation or follow the pre made choices from the menu. Everyone in our party was loving their food. And quite honestly I think it cured all of us from raging hangovers from the night prior. The only bad thing about this spot is that they aren't back home in Cleveland!! <br><br>I would highly recommend this to anyone that claims to love ramen/noodles. The flavors are incredible, spices are spot on, and all the add ins are incredible. <br>It will be a must for every Chicago trip!!", "pics": null}}, {"review": {"des": "this was an average bowl of ramen. I got the furious ramen and the overall flavor profile was alright- I appreciated the garlic and the classic, strong broth but the noodles were underwhelming. the mushrooms were tasty and perfectly seasoned with a bit of sweetness to them but they were room temperature/borderline cold compared to the hot noodles and broth. also the two slices of pork included were pretty thin. it was ok but definitely didn't meet my expectations.", "pics": null}}, {"review": {"des": "I can see why they call it furious spoon. (Essentially they play very angry rap music while you eat your ramen and I guess that makes you eat furiously).<br><br>Overall: 3.8/5. Decent place, prices are fine, taste is ok. Won't go out of my way to come here but it was a good experience.<br><br>Value: 3.75/5. Around $12 a bowl which ain't bad but it ain't great either.<br>Speed: 4.8/5. SOOO FAST. I wonder how they did it.<br>Vibes: 4/5. Definitely and experience since they have the music on some rap station on the radio which has some good and some questionable tracks. Very chill, casual place to grab ramen.<br>Taste: 3.7/5. It was fine. Broth didn't blow my mind. Noodles were your average Chinese round noodles but also not mindblowing. Meat was a bit tough but fine tasting. Good mix of ingredients. Was not too salty.<br>Service: 4/5 Can't really comment much since it's in the style of order and pay up front then they bring it to you and you eat. Definitely very casual.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ToWFhdblpmoMRdUjwxY-gA/348s.jpg", "caption": "Shoyu"}]}}, {"review": {"des": "Great food. Not good for kids or religious people. They play unedited hip hop. But it's all good to me. Just wanted to give a heads up. So, the place is great the food is great. These are some of the best noodles I've ever had. Better than Boston. Shhh. You walk in, place your order , then find a seat. Great area. Look at my pics.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/R0_SahNChdvgwu3HQNKzIQ/168s.jpg", "caption": "Chicken and pork belly"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MOhQanckQ8iEa4z6kU8e6w/168s.jpg", "caption": "Outside"}]}}, {"review": {"des": "Never Ate In Such A Place Where They Sold Noodles. Trying Furious Spoon For The First Time Was An Amazing Experience. The Tables And Seating Where Different. Music Was Great And Lets Not Forget The Food...... Mouth Watering. I Tried The Furious Ramen And It Was Delicious. Perfect Combinations And Spice. Loveeee It. Definitely Coming Back To Eat Again. Great Customer Service.", "pics": null}}, {"review": {"des": "I went to the Logan Square location awhile back and wasn't very impressed, but I noticed that this location had a different menu so I was willing to give it another try. <br><br>The place itself is pretty lively and fast-paced. I went here on a Wednesday night for dinner and it was pretty busy, but seemed like everyone was basically in and out pretty quickly. <br><br>I was excited to see that they had tsukemen, or 'dipping ramen', on the menu. I've been trying to find more places that serve tsukemen so I was eager to try it out. I also ordered kimchi on the side. Note: it's not cabbage kimchi, it's radish. I have some food allergies and radish is fine but I just wanted to make sure. I asked one of the staff members to confirm, she responded, \"it's kimchi?\" Nonetheless, it was dry and didn't really have that much flavor. Didin't really care for it. <br><br>The tsukemen here was okay. It wasn't bad, but it wasn't good either. The noodles are served cold-- as it should be-- but the broth was room temperature (should be hot). Although the menu says that the noodles are 'chili-infused' and had chili in the noodles, this dish was not spicy at all. The other toppings didn't do much for flavor and the broth didn't have that much flavor either. Eh. Probably had my standards set a bit high since I had real tsukemen in the west coast and it was fantastic. This wasn't authentic (which I was kind of expecting) and this dish had no flavor whatsoever. Super disappointing. <br><br>It was super pricey and the food just wasn't very good. For both ramen experts and newbies, I'd definitely recommend going somewhere else.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/chDjOSSwNa0-TL43YovL4w/348s.jpg", "caption": "Tsukemen ramen - pretty, but not that great"}]}}, {"review": {"des": "Ramen and 90s hip hop! What more could you want?! <br><br>This place is excellent. The furious ramen is perfectly spicy and the noodles have that great texture where they aren't too soft and have a nice bite to them. Also that egg! Oh so drippy and gooey. The takoyaki is also a delicious appetizer (octopus balls) and would highly recommend. They have a few local beers (and Japanese ones) which of course are a great add to any meal. Come here, jam out, and slurp some ramen!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/X0rz3iP7lt3WkLCU__39AQ/348s.jpg", "caption": "Furious ramen"}]}}, {"review": {"des": "Furious Spoon has one of the best ramen places in Chicago! I went here around five on a Sunday and it was not very crowded, which is good because their seating is quite limited. You order the food at the counter and then they seat you on this one long wooden table, which gets quite awkward because you're sitting right next to strangers. Service is fast and your food comes out in less than ten minutes. <br><br>I really love ramen and I ordered the shoyu ramen, which comes with chashu pork belly, bean sprouts, bamboo and nori. I also added an egg for an extra buck or two. The broth was rich and flavorful and the noodles were the perfect texture. One downfall is that it looks cheap compared to other ramen places, but the toppings do add up. They're expanding to different locations and they're opening one in Evanston very soon. Overall, I would highly recommend since it is one of the best ramen places in Chicago!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/iOQAWMZlWHKHXD1VnI1HTQ/348s.jpg", "caption": "Shoyu ramen with added egg"}]}}, {"review": {"des": "Ramen so good. Got chicken but had bones. Definitely a minus. Ambience good except at 830 pm on a Mo day they were playing rap, with explicit lyrics: N word and \"bitches\" in the lyrics. Really? Two families eating at same time as me.<br><br>Woman greeted us saying: \"pick what you want and tell her.\" Cashier was nice. Food came quickly but food given to wrong people without any apology.<br><br>Probably will not come back because of all of the negatives.<br><br>And then after using the restroom, server with long hair flung open door to kitchen area right in front of me, and didnt even apologize. No one asked how our food was after bringing it incorrectly to our table.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xc8T9SiPkKAeysErktePjg/348s.jpg", "caption": "Bones in chicken ramen. :("}]}}, {"review": {"des": "Perfect way to end the night out in Logan square. Around 2am stroll on in to order some ramen and then rip a few more shots before your ramen comes out.  The furious ramen is the only thing I get, perfect combo of everything with a little spice. <br><br>I've never eaten it sober but I can say with 100% certainty there's no other place I'd rather get drunk food around this area.   The service is good and we never have to wait long for our food or a seat.", "pics": null}}, {"review": {"des": "I loved this place the first time that I had to come back with all my family. We arrived and always get greeted by the staff. We ordered our food and took a seat. I enjoy loud music but some older people may not but lol. My mother at first said the music is pretty loud. I'm like mom wait to you try the food you won't even hear it. Our god was brought by the server and it was amazing and so delicious my mother was blown away lol. She got the furious bowl. I appreciate the staff because my kids are picky eaters sometimes and they always go beyond and above to make them there ramen with only broth and ramen which is not on the menu, thank you guys. I highly recommend the holy cow my favorite and the furious bowl and the vegetable bowl is good to. Don't forget to order chicken dumplings they are great. Once again I give it five stars.", "pics": null}}, {"review": {"des": "What I miss most about LA is the abundance of poké shops with fresh fish (and it doesn't even compare to HI). The locations I've tried in Chicago have either been overpriced or not the same. Today, I found a bowl (for $6.50!!) that not only tasted fresh, but wasn't overpowered by crazy sauce either. If you like spicy, you should definitely try this dish at Furious Spoon.<br><br>The one I got is a side - you can also get an entree size which includes cabbage and few other ingredients.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/k4fh-ACQZVQn7jZi05vVAA/168s.jpg", "caption": "$6.50 for poke. Not overpowered by sauce, but has a zing to it! So good."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PKIMcEyw7VTe3gz0ptrK4g/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Furious Spoon is a good option for people looking for a quick, tasty dinner that won't put you to sleep. The menu isn't huge, and I can't say the food is super memorable, but it's by no means bad, and they serve you really quickly. The speed of service is important because the seating arrangements can get a little awkward with their wooden high top tables and tough to maneuver stools.<br><br>Foodwise- I've had the Shoyu and I think the Furious on my 1st visit, and both were decent. The noodles are the best part. I feel like other ramen places add more of each ingredient into their bowls and here it seemed like it was mostly noodles and only a few other things, but the dish was still good. I left still feeling hungry but the person I was there with was stuffed without even finishing their food, so my hunger level may have been an outlier.", "pics": null}}, {"review": {"des": "I had the chicken ramen tonight for dinner. The broth was a bit salty and oily for my preference. The noodles were just ok and the toppings which included fresh green beans, sweet corn, and green onions were the best part. The chicken dumplings was a nice addition to the bowl. The place is a bit small and you may want to order ahead of time to skip the wait. Overall the ramen was average, and I might try it again some time!", "pics": null}}, {"review": {"des": "Dope ramen and poke. I have had ramen and poke in Kauai and Maui, which other than heading to Asia, is supposed to have some of best restaurants for ramen and poke in the US. Furious Spoon is definatly a competitor. The poke was very light and fresh. I had the side for only $6. I could have used a little more seasoning on the poke marinade though. I also got the furious ramen and substituted the spicy noodle in. Broth was delicious, egg was cooked perfect and the pork had a lot of flavor. The habanero sauce on top was definatly spicy but made the dish. Chicken was just okay for my taste. Too big of pieces and semi dry. Didn't stop me from finishing the bowl though. Great little restaurant that you have to check out regardless if you have had ramen or not. Great flavors and food! They also serve beer here which is a plus.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rBZZiLhk0QQNPCzgKSiUgA/348s.jpg", "caption": "Side of poke and the furious ramen"}]}}, {"review": {"des": "Ramen was super flavorful. A great way to reminisce about my time in Japan. Loved the green tea option that is very popular in Japan. The broth was good, mushrooms were amazing, but definitely not traditional. Really liked the dumpling in the ramen, but it did get soggy so I would recommend getting a plate to put them on, or eat them immediately. I thought it was mildly overpriced.", "pics": null}}, {"review": {"des": "I came here excited and ready to chow and Furious Spoon did not disappoint. The employees were incredibly friendly and attentive. I absolutely loved the hip hop music being played. The atmosphere was exactly what I was looking for: fun, friendly, and new. <br><br>I ordered the Vegetable Ramen Bowl and I added a poached egg and fried tofu. The food was so tasty and delicious. The only critique I have is that I hope the tofu would have been more flavorful but it was perfectly fried regardless!<br><br>Overall, I had a wonderful experience and will definitely be coming back!", "pics": null}}, {"review": {"des": "Came here on a Friday night. The restaurant was half packed so we got seated right way. Our food came out about 10 minutes later (not too bad)<br><br>Overall, it was okay. For a quick and affordable meal in Wicker Park, I definitely recommend Furious Spoon. I am not sure about the other locations but the staff here is pretty dope and the music is amazing!<br><br>The three stars is all about the ramen. I've had some pretty good ramen and Furious Spoon is just okay. the broth is not as spiced and the meat is not as tender. It has a mass produced feel to it. <br><br>I still recommend this spot or the other ones.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QmiWOCFQh6zBCgEmPLY3hQ/168s.jpg", "caption": "Shoyu Ramen"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KPQGzX0StHLKbuVom_0lPw/168s.jpg", "caption": "Chicken Shio Ramen"}]}}, {"review": {"des": "Came here to have the beef and rice bowl after having it at the Logan Square location Friday night as it was fantastic and have to say, they came up short. Way short. Rice was flavorless and nushrooms uncooked all the way through. I felt the items were not cooked properly and just didn't measure up to what l had taste Friday night. Even the Margaritas were blah. <br>I love furious spoon (Logan Square location)<br>Skip this one here at Wicker Park 100 percent.<br>I left dissatisfied.  : (", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BYBHr_zDYg_cl9dTJRt3Zw/348s.jpg", "caption": "Margaritas.  Very mediocre ones..."}]}}, {"review": {"des": "3.5.... Its ramen. <br><br>So it can only be so great lol. There is probably one place in the world where I \"DIED\" over the ramen...this wasn't it tho lol. <br><br>I've been to furious spoon probably 4x now so a review is due. I'd probably give it a 3.5 but since that's not an option 4stars it is. <br><br>This is always a fun environment but limiting. I can't bring my mother or older family members here. They'd be offended by the music. The food is better than good but not amazing. Lol always needs \"SOMETHING\". Soy sauce, peppers just something. It's just not great on its own. I usually get the vegetable ramen with mushrooms and extra garlic added. It's yummy enough to be happy... <br><br>Service is always a 4 out 5. Nothing spectacular however nothing \"bad\". I had a horrible grub hub experience abd the staff member was less than thrilled to assist since it was grubhubs fault. So hey. It's fun for young crowds, good for a nice ramen, but def nothing to freak out over.", "pics": null}}, {"review": {"des": "Good ramen just a couple options but not worth almost $20 honestly. I was with my boyfriend and says there are a few other places down the street that are better. Play good music though, new hip hop hits", "pics": null}}, {"review": {"des": "Never had ramen from a restaurant before, wanted to give it a try. Would not recommend, food was okay. The restaurant itself was neat, cool atmosphere but food isn't worth it.", "pics": null}}, {"review": {"des": "This was my second time back here.  I really enjoyed it the first time, but this experience was terrible.  You have to serve your own water which was warm at the time.  The did have an open bucket of ice out. It was very off putting.  The ramen was just so so this time, and they didn't even serve everyone in the party at the same time.  They brought 3 of the 4 dishes out, and we had to wait another 15 minutes for the 4th person's meal, only after having to check on it ourselves.  I definitely won't be going back.  There are plenty of better ramen places right on the same street.", "pics": null}}, {"review": {"des": "Lackluster ramen, especially in Chicago. Furious ramen was a forgettable tonkotsu base with a little kick, with a predominating flavor of habanero. The chashu and chicken were both rubbery. Chicken was also pretty burnt and salty. Chashu not great flavorwise. Egg and mushroom toppings were good. The noodles were unforgivably soggy which pretty much ruined the whole bowl. Not really something I really put too much stock in but cashier was pretty rude.<br><br>There are so many ramen places, I would recommend looking elsewhere-even in Wicker Park you have many better options like Oiistar.", "pics": null}}, {"review": {"des": "I love everything about this place. The Furious Ramen is my favorite. I love ramen, and this is one of my favorites ever. Very good appetizers, as well. Overall- one of my favorite ramen places ever.", "pics": null}}, {"review": {"des": "Came here for some dinner on a weekday. Interesting hipster vibe immediately upon walking in. They were blasting some older hardcore hip-hop and gangsta rap throughout the establishment. I enjoy such music, but it seemed a out of place in a ramen bar. Typically I like to eat my ramen in peace and harmony, savoring each and every bite without any aural stimulation as the Japanese do, and I wasn't sure if I necessarily enjoyed the 2Pac or Wu Tang Clan clashing upon my ear drums in that setting.<br><br>Shoyu Ramen - Too salty. Great flavors - but too salty. The egg I ordered as an additional topping was poached with very good technique, but I definitely prefer a flavor infused soft-boiled egg on top of my ramen dishes as the Japanese do instead. The noodles themselves were of great quality and soaked up the salty soup quite well, making for some delicious and flavorful noodles. There were also bean sprouts included in this dish, which is not a usual ramen topping for me - I somehow don't think that I've ever had bean sprouts on ramen before, and thus wasn't sure how I felt about them. And the nori on top was shredded whereas I'm more used to the paper kind. These seemingly small deviations from what I consider the \"norm\" for a bowl of ramen contributed to the more hipster vibe I felt eating here. Although I personally didn't enjoy these differences - perhaps I'm a little too conservative when it comes to my ramen, I thought that they all could have worked well together if I had perhaps been in a more exciting and adventurous mood. Then maybe I'd have found their take on this dish more welcoming.<br><br>Tsukemen Ramen - My friend ordered this. The noodles had a much smaller caliber than I'm accustomed to with tsukemen, and they had a lot less broth than expected as well. They included some limes with their noodles, which is definitely not as the Japanese do. (My friend said they do give you limes at this one reputable tsukmen place in LA, but I've never seen the combination before). However, this dish was incredibly delicious! I LOVED the lime, and the \"Fresno\" chilis were an interesting and exciting addition to the dish as well. The broth was very flavorful, as is required for a proper tsukemen dish, and although it wasn't as much as I'm used to having with tsukemen, it was sufficient for my friend, who didn't need all of it to finish off all of the noodles.<br><br>A couple of other comments - the pork in both our ramens was good, not great or wild or anything, just good. My friend also got some of their fury sauce that we both sampled. We both liked it, but didn't really touch it after trying it for a couple of bites. The apple flavor was just a bit too strange for me, and I felt like it didn't really go well with my noodles. My friend also got some kimchi on the side, which turned out to be AMAZING! Really a random hit. I typically hate cabbage but each piece was dripping with so much flavor, I found myself regularly taking pieces of it, not as the Japanese do but probably as the Koreans do, from my friends stash during the entire meal - probably much more than I was entitled to (sorry my dear friend, if you're reading this, I know you thoroughly enjoyed that kimchi as well and were too polite to say anything to stop me from eating it all after you said I could try it).<br><br>Overall an extremely interesting place to eat some ramen. I was not expecting the typical bowl of ramen after reading a couple of reviews prior to coming here, but this place still intrigued the heck out of me. Almost all aspects of our meals were interesting to me, even if they didn't necessarily work out in the end. Ranging from slightly different alterations to classic dishes, to some truly creative culinary choices, I have to say I really enjoyed my experience here. I recommend coming here for a gangsta-fusioned-hipster version of your favorite Japanese noodle dish - just remember to leave all your expectations of a typical Japanese ramen house behind before entering!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xLEfD99IXZ5JT6N-cAC4sA/168s.jpg", "caption": "Tsukemen ramen - never had dish with lime and chilis before. SUPER delicious!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/70RxGixwAyd7wXnL6LmgOw/168s.jpg", "caption": "Shoyu ramen - broth too salty. Noodles good. Interesting take on dish."}]}}, {"review": {"des": "Some of the better ramen in Chicago. The Chicken Shio comes with a corn, tofu, kinchee and lots of chicken in a seasoned broth. It's good and you can add ten other ingredients. <br><br>It's communal seating which is fun and cozy. The music is Amazing!  New menu coming in February with addition of new bowls and liquor", "pics": null}}, {"review": {"des": "I don't have enough good things to say about furious spoon. I have eaten at all their locations and the ramen is always delicious. Tasty, spicy,<br>flavorful, each one distinctive. Not to mention the cool atmosphere with loud 90s rap and amazing cocktails. Service is always great too. Highly recommended.", "pics": null}}, {"review": {"des": "I was really excited to try this place when visiting Chicago. Being from LA, ramen is a staple food for me, and after reading that Shin Thompson was the executive chef here I knew I had to try it!<br><br>I visited on a Thursday night and thankfully it wasn't too busy because I hear it can get a little packed on on the weekends. I ordered the Chicken Shio Ramen and added an egg because duh! The restaurant is self-seating at these long wooden community tables which I'm a big fan because ramen is a communal food and should be enjoyed with others.<br><br>Only had to wait about 10 minutes for my ramen to be served. I give it a 7/10. The chicken was amazing--more flavorful than I'm used to being served with ramen. The broth was pretty solid but the noodles left something to be desired. Overall a good bowl, but not one I would come back for.<br><br>The vibe here is cool--they play a lot of old school hip-hop which is dope. Glad I visited but I'll stick to my LA ramen houses.", "pics": null}}, {"review": {"des": "I used to really love the Furious Ramen and would order it fairly frequently. The last couple times it seems they have replaced the actual piece of chicken with a chicken potsticker. I'm not sure why they would mess with their signature dish like this other than the obvious fact that a potsticker is less expensive to use than real meat. <br><br>Unfortunately, the Furious Ramen now just looks and tastes cheap but the price certainly hasn't gone down. I would go back if they brought back the real chicken meat but until then, I will find another ramen joint", "pics": null}}, {"review": {"des": "A friend who lives nearby took us here for a late dinner; Furious Spoon is conveniently open a little later than most restaurants, and also interestingly enough offers a limited selection of alcohol, mostly beer.<br><br>The inside is kind of small, but it's nicely decorated. There's colorful painting and murals all over the walls, nice heavy duty wooden bar-height tables and stools, as well as the most striking feature: loud hip hop music. These features combine to great a certainly unique quick-service restaurant. Our orders were brought out in five minutes or so after they were put in at the front counter and we sat down and waited for them.<br><br>The menu is pretty straightforward, there's a few different base ramens you can start with, and then add additional toppings at a per item cost. I started with the Chicken Shio and added corn, garlic, bean sprouts and maybe something else, I can't remember. This was a HUGE bowl of ramen, almost enough for two people. The flavors were a little exotic, but in a good way. I've only had authentic ramen a couple times and this time was better than the last for sure. The noodles are made in house and were fantastic. My ramen was a little on the spicy side, which I enjoyed. It was also a little on the salty side, but I find that most ramen and Asian foods more broadly are as well. The ingredients all tasted fresh, the chicken breast was flavorful and tender, I wish there was a little more chicken, but it was still a decent sized hunk. <br><br>I joined the mailing list for 25% off my bowl and it still came out to about $15 due to how many items I added. I was satisfied and definitely full afterwards.<br><br>Overall a good experience.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/udcI32rc48LvyJcz8d74yg/348s.jpg", "caption": "Chicken shio Ramen with a bunch of add ons"}]}}, {"review": {"des": "Standard ramen, quick service, cool atmosphere and interior, and great music.<br><br>We ordered the Furious Ramen and the Citrus Chicken Ramen. The seating arrangement is similar to log cabin style. Sometimes it can get difficult to slide to the middle of the table if here are other people sitting at the ends. The music was definitely loud and kind of making chatting difficult, but the songs playing were on point. <br><br>The Furious ramen was more rich and the bit of spicy paste it can with gave just the right amount of kick to the broth. The broth had a very deep pork flavor and was delicious. The noodles were nicely cooked. The pork slices were thin and a bit tough. <br><br>The Citrus Chicken ramen had a lighter broth and there was not much actual citrus taste to it except for the broth around the slice of orange and slice of lemon. The chicken in this dish were dark meat pieces, but one piece felt under cooked, because the texture was a bit rubbery. The noodles here were also nicely cooked. The carrot garnish was very generous and added a crunch to each bit.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Vv4Fg-MY8VxsZHGGHnVhuQ/348s.jpg", "caption": "Citrus Chicken Ramen"}]}}, {"review": {"des": "I am so surprised a place like this does not exist in California! Love the idea of hip hop music / ambiance alongside a bowl of ramen. <br><br>Furious Spoon is not a sit down, but rather an order-your-bowl, wait patiently, sit down and eat till your heart's content. Portion size is generous, I personally couldn't finish it. Chose the chicken ramen whereas my friends opted for the spicy ramen (the holy cow). I guess you can't take the spice out of the ramen as well as you can put it in because they were struggling to eat it, so be warned. Meanwhile, if you get the nonspicy ones like me, feel free to sprinkle chili generously. <br><br>I bumped it up to 4 stars because I really dug the ambiance and the prices were fair, but the chicken ramen is just /okay/. I blame this on myself because who the heck makes good chicken ramen, right? But I didn't want to order the beef ramen because it was ground beef instead of brisket/flank inside it. <br><br>I'd imagine this is a great place to nosh when you're a little too drunk to head back to the bars.", "pics": null}}, {"review": {"des": "\"Where ramen meets hip hop\" is Furious' tagline. Do I need to say more? Their signature Furious ramen accompanied by some old school Nas or newer school Migos, is an explosion of flavors and sensations which stays very true to traditional Japanese ramen culture (the food, that is). Definitely try one of their rice bowls as well if you're not feeling ramen but have withdrawals from not being surrounded by the vibes.", "pics": null}}, {"review": {"des": "I'm so confused...four stars and over 1,000 reviews. We must be spoiled back home with all the ramen spots, but we all agreed this place was lacking. The broth was salty and did not have much flavor and the noodles were way over done. The portion was quite large as I barely ate half of it. Good thing we did not have to wait in a long line. It was nice they had outdoor seating though so we could people watch in the Wicker Park neighborhood.", "pics": null}}, {"review": {"des": "All of their locations have a great atmosphere about them. But honestly, I have to say just slightly overpriced for what you get. Don't get me wrong, it is really great ramen, but there are other places in Wicker with on par or possibly better ramen for less. That doesn't stop me from coming in here, just not my go to ramen place.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UR1KpxtbH715qt0qISt5Iw/348s.jpg", "caption": "Ramen and hip hop. What more can one ask for?"}]}}, {"review": {"des": "I finally made it!!! Imagine this.....a cold, windy Friday night. Me and a couple of friends roll up  and walk in. There's a small line, though nothing terrible. We place our orders and spot 4 seats along the \"bar.\" Score! The dude at the register was super friendly and the blasting hip hop music was on point. I couldn't stop dancing from the time I walked in til I left.<br><br>I got the Furious Spoon ramen, which was loaded with yummy meats, incredible noodles and was deliciously spicy. My friends got a rice bowl, which I of course tried and found tasty. They also got another ramen that was red and had a bunch of peppers in it....and they were SURPRISED when it turned out to be fiery hot LOL. It was delicious though. <br><br>Can't wait to go back!", "pics": null}}, {"review": {"des": "I have been by here several times and liked some of the murals outside.  Tonight was the first time I tried their food.  Staff was terrific and quick service.  I'm not a big ramen fan but I liked this.  Broth was a little to salty for me but I cleaned my bowl.  <br><br>They have outdoor seating.  It cost a little more than I expected for the size but I would go back and try another dish.", "pics": null}}, {"review": {"des": "When it comes to ramen we have a plethora of locations within the city but honestly this place was pretty disappointing. I asked the employee which one he recommended and I went with the Furry Spoon. The wait to get the ramen was about 10-15 minutes which was not bad. The broth was honestly disappointing it was thicker than your average broth and had a gravy like consistency. The taste was pretty bland and had a hint of spices. The noodles didn't taste super fresh and were pretty tasteless. The egg was super soft and had a gooey yolk and I think that was the best part. The meat itself was nothing mind blowing but at least was chewy. As a quick pass by I was pretty disappointed in this place but I've had better ramen in the city of Chicago.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7lBSOFDQ_G1DrJ21EVRZ0g/348s.jpg", "caption": "The Furry Spoon Ramen"}]}}, {"review": {"des": "Best Ramen Ever!!<br>I kept hearing this name from different people and also popped on my social media feed often. One evening my husband and I went there for dinner. We ordered Furious ramen and it was the best I have ever had. Everything inside the ramen had amazing flavors and yet it blended beautifully. The atmosphere and the service is great.", "pics": null}}, {"review": {"des": "Hip hop and ramen? I'm, like, good with both. <br><br>I opted for furious ramen, because the number one mistake anybody can make when they go to a new restaurant is to not get the hype item, aka, the one with the restaurant's name in it. And then the tastiness of that item is a pretty on-point barometer as to how the rest of the menu will be. <br><br>Let's be honest, I was so ravenous that I would have scarfed down the lineup of the Kentucky Derby this year. But this meal blessed my (mostly fruitless) day.<br><br>The broth...it wasn't stunning (NYC has spoiled me rotten, like with mold), but the spice tickled my tongue in the way your head is massaged by one of those metal spider things. Strange, yet wildly pleasant. The noodles were bouncy, firm, and these people didn't skimp on the pork belly. Thank GOD -- that is my biggest pet peeve. I really liked how they decided to sprinkle on some hot sauce (maybe it was cholula, who knows) on the side -- how avant garde. It worked. Knowing me, though, I would have enjoyed more of a garlicy taste. Listen up, ramen joints -- please put spice toppings out. My tastebuds are probably broken from years of eating shin ramen, and I need more spice for my buck.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/U0M_jVXiKmACMrMpaLNuPw/348s.jpg", "caption": "Furiyes"}]}}, {"review": {"des": "I'm​ a big ramen-lover and fan of Furious Spoon. <br>Super reasonable prices and portions and they're open extremely late (1AM or 2AM) to satisfy your ramen-cravings.<br><br>Street parking is nearly impossible (in the downtown Wicker Park area in general) so take the Blue line to the Damen stop. <br><br>You cannot go wrong with the furious ramen. Also- I know they're called furious spoon- but eating with their giant spoons is a little awkward and a but of a mouthful, but that's just me. <br><br>I've tried a lot of their menu and overall, I think they have really deep, rich flavors. Only, I don't like their takoyaki which is oily and soggy.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2ckuGt4asoq6j9tO_3JlPw/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nsp0ucVfLDEOHksXW3-Rvg/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IzLpswDJv59w553XtvI6mg/168s.jpg", "caption": "Inside"}]}}, {"review": {"des": "The broth is bland for the most part. Only the broth with any real taste is the Furious Bowl. Noodles are always overdone. I'm not sure why this place always shows up on lists of Top Ramen spots. It's an example of a restaurant being popular, not always being the best.", "pics": null}}, {"review": {"des": "Operated by a group of non-Asians, I found Furious Spoon to be quite an interesting ramen shop with straight forward self service business model. Aside from choosing from 6 ramen bowls, you can order extra condiments and ingredients for a more customized meal. The decor of the hole in the wall radiates grungy vibes while playing underground and old hip hop jams the whole time. Quite an eclectic scenery attracting youthful ramen lovers. <br><br>The Furious Ramen comes in a thick tonkotsu soup base with moderate heat, pork belly and chicken. Mind the molten poached egg--its so runny and ooey. Love it. Very delicious.<br><br>The Holy Cow Ramen features a flatter wider noodle, spicy ground beef and a generous portion of bean sprouts. This sucker packs quite some spice with their fresno chilies. Crank up the air conditioner up in my mouth please.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QKd-sXkwKbZ1kKWiY4rNAQ/348s.jpg", "caption": "Holy Cow Ramen + marinated mushrooms and poached egg."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PW0_EgDOI8As41ESAwU-hQ/168s.jpg", "caption": "Furious spoon + kikurage mushrooms."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Dp_jEfUSe75pqX4pDPlicw/168s.jpg", "caption": "Furious Ramen with kurikage mushrooms."}]}}, {"review": {"des": "I want to love this place as it is a funky spot in my neighborhood with a great concept. However every time I have gone here I've had an upset stomach for days. Too bad.", "pics": null}}, {"review": {"des": "My go to Ramen spot when I'm in town.<br>Furious Ramen... Hip Hop and Cocktails! <br>The poke bowl also delicious and a great appetizer to share", "pics": null}}, {"review": {"des": "definitely one of the better ramen restaurants out there! i came on a wednesday night, the music was blasting and it wasn't too crowded! pretty much you order in the front, take a seat, and they bring it to you. i got the chicken shoyu and my friend got the vegetarian. PSA veggie was better than the chicken! it was definitely spicier, but the flavor was delicious as well. chicken tasted a little bland, might be bc of the lack of spices (at least to me). i also expected the chicken broth to be a lot more flavorful. the noodles were good though! it comes in good portions, we ended up taking some home! <br><br>the stools might be a little hard to get to if you're sitting by the wall, since they're long table tops with 6-8 stools/each table. <br><br>ps. although v loud, my friend complimented the taste in music about 10 times during the 2 hour time period we spent there.", "pics": null}}, {"review": {"des": "The ramen is great and service is great. Only thing is the music there is so loud on weekday nights. I'm not sure if this is just unique to it being in Wicker Park. I could hardly enjoy my meal fully without my auditory sense being assaulted by the loud music. I want to come back, but the music was just too much.", "pics": null}}, {"review": {"des": "I heard from my people that this is one of their favorite ramen spots in Chicago so I decided to give it a try. I got the signature one - the one with fury sauce in it.<br><br>The broth was too salty for my taste and the pork belly was not very flavorful. I love the ambiance here and the music in the background. After eating about half of this, I was very thirsty and it was just too salty that I could not finish it. I came here on a Saturday around 1:15pm and there was no wait at all (read reviews about some people waiting for an hour).", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9ElZrcELnX_4jSw-u57vRQ/348s.jpg", "caption": "The furious ramen (tonkatsu + fury sauce) ~$13"}]}}, {"review": {"des": "The first time I went here, I didn't enjoy the ramen that much. But since then they've vastly improved and now their ramen is tastier. Depending on the ramen you get, I find their broth can be a bit bland and inconsistent. <br>I like how you can customize your ramen and add ingredients depending on your tastes, that definitely the unique aspect of Furious Spoon. The place is also open late so you can satisfy your late night cravings here. <br>I wouldn't say this is the best ramen place in Chicago, but it's definitely worth a try and it has a fun and urban concept to it. <br>They also have rice bowls, appetizers like poke and tayoyaki, as well as alcohol!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gVVE5NHMwh7Sv3IxTKUHEA/348s.jpg", "caption": "Holy Cow ramen. (less spicy)"}]}}, {"review": {"des": "SUPER trendy ramen. You order up front, and take a number to a table that you choose. The restaurant is rectangular-shaped, and stretches far into the back. When we came (around 5:30 on a Friday) it wasn't too crowded, but I can imagine that it becomes much more difficult to get a seat in an hour or two. <br><br>Speed: came quickly - we got the citrus and shoyu ramen.<br><br>Taste: definitely fusion. This isn't where you would go for authentic Japanese ramen (which, if this is what you're looking for, go a block or two on Milwaukee to Kizuki Ramen). The broth is pretty heavy and concentrated in both (more so in the shoyu). I think the citrus ramen is an interesting take on a traditionally umami-heavy food. I personally liked the thin noodles but I have heard some people not being fans because they're not as chewy.<br><br>Portions: decent, it filled me up just enough so that I wasn't hungry anymore. I'm used to slightly bigger portions at other ramen establishments but clearly the concentrated broth is the focus at Furious Spoon.<br><br>Music: I don't usually talk about this because I'm not as much of an ambience person, but the music was LOUD when we were there. The bass was really heavy, and the playlist consisted entirely of hard core rap. Not my preference, but really wouldn't have been a problem if only the music wasn't SO loud.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0M1J3pSViYmFcGL1PgZy6w/168s.jpg", "caption": "Shoyu on top, citrus ramen on the bottom"}]}}, {"review": {"des": "I should probably preface this by saying I'm not a huge soup fan. For me, a bowl of broth and noodles/veggies/meat/insert-anything-else-that-can-go-in-soup is comforting in the winter when I'm sick. <br><br>So I'm already going in with mediocre expectations. And mediocre is what I got. I met my friend here for dinner last weekend and it was surprisingly not full considering how crazy Milwaukee Avenue was buzzin'. <br><br>I probably should have just ordered the signature Furious Ramen, but the Citrus Chicken Shio caught my eye. Kinda annoyed that any of the recommended toppings cost extra, but whatevs. I get it. I got the roasted garlic. <br><br>We sat down with our beers and the food came out rather quickly, within 10 minutes. All in all, the ramen was just okay. Nothing special really. Maybe it was this specific dish, and the fact that I didn't get the fury sauce...but the dish was rather bland. I will give them the noodles were cooked nicely.<br><br>The type of music was fine. For the Wicker Park crowd, I find it suiting, but it was probably a tad too loud. I'm just not a fan of yelling in conversation. Customer service was okay. Pretty minimal as you order and then they bring your food to you, then pick up your plates, so not much interaction. <br><br>I'm open to trying this place again and I'll try something different. But just not a place to say, \"OMG this is so good.\"", "pics": null}}, {"review": {"des": "Furious Spoon was actually better than I thought. I wasn't expecting much since I have heard of  many mixed reviews about this place. This place is always pretty crowded, especially when it gets later in the evening so I wouldn't recommend bringing a huge party with you. At Furious Spoon, you place your order first and then bring a number with you as you seat yourself in any of the available seats in the restaurant. The seating arrangements are communal so prepare to get close with strangers. I came with a group of around seven people and we had to split into two groups in order to all be seated.<br><br>I ordered the Shoyu Ramen and all of my friends ordered the Furious Ramen. I also added an egg and corn to my bowl (you have to pay for additional ingredients). I would say that the noodles really stood out to me--they were perfectly cooked and remained wonderfully chewy even after sitting in the broth for some time. The egg addition is a must since the explosion of yolk of the soft-boiled egg was a welcoming taste to the broth. If you are worried that the Furious Ramen will be too spicy, don't. I tried some of my friends' orders and the broth was not the least bit spicy. The broth for the Furious Ramen was more sour than the thick broth of the Shoyu Ramen and there seemed to be hints of citrus (?) in it.<br><br>Furious Spoon is ultimately a place to get ramen. Unlike other restaurants that offer other small side dishes and appetizers, Furious Spoon doesn't really have a large selection of anything else besides ramen. The ramen I ordered was tasty and the 25% discount I received by signing up for their mailing list made it even better. Overall, I was pleasantly surprised with this place and I'm glad I finally decided to try it out.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_VwQhevwOJRMq8DvifbquQ/348s.jpg", "caption": "Shoyu Ramen (with egg and corn added)"}]}}, {"review": {"des": "Delicious ramen place in Wicker that lives up to its reputation! The Ramen was filling, flavorful, spicy and fresh.  Got the Shoyu with an egg and spicy sauce added and it absolutely hit the spot.  You order at the counter and then find a seat with a number and they bring it out to you.  Not a huge space, but long and skinny with big communal tables.  Overall a solid spot to fulfill your ramen craving! Lots of options for variety and modifications.  Will be back for sure.", "pics": null}}, {"review": {"des": "I really enjoyed this joint. My friend and I wer looking for a late night spot to grab a bite to eat after a concert, and piece pizza was reserved for a private party and small cheval was closing in five minutes. I always wanted to try a ramen place but always felt like it would be silly to pay more than ten bucks for soup that usually costs .50 cents! Furious spoon was open late, close by, and serving warm food on a cold night so I was finally inside my first ramen joint. They recommended me to try the furious ramen and even though I don't really like spicy, I for some reason LOVED this ramen. The poached egg didn't drip into the bowl and it wasnt Instagram worthy, but I'm all about the taste. And the taste was amazing. It was not just amazing. It was amazeballs. Every single bite was an explosion of different flavors on your tongue. It was insane. My nose was running a bit but I didn't care. The spices were sweet and not overpowering. The chicken was so juicy and the beef was easy to eat in the soup. The mushrooms were delicious and the noodles were plentiful and yummy. I loved their furious rice bowl as well. However, get the ramen if you're wanting to see what the ramen scene is all about. You won't regret it!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QrPvgOEwXsS9OvSI2uEX8w/348s.jpg", "caption": "Furious ramen"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HYCi-_jH5oJ0q-A3nfUJig/168s.jpg", "caption": "Furious rice bowl."}]}}, {"review": {"des": "This location has a lazy ass person who's in charge, or at least I think shes the manager. Every time I come in shes just sitting down, and I over hear her being completely disrespectful towards the employees there. If only I asked for her name, but it looks to me shes on her late 20s or early 30s. Definitely wont be going back because of her. Food is really good though.", "pics": null}}, {"review": {"des": "Have an ugly/ annoying date, here's the place for you! <br><br>Their food comes out quickly. Drinks are good and strong. That's about it. The music is crazy loud so no awkward conversations. Good music though so you'll be entertained. <br><br>Give it a try if you've never had a reference for good ramen.", "pics": null}}, {"review": {"des": "Great little spot in Wicker Park for a killer bowl of ramen; the portions are generous and quality is excellent. We tried both the vegetable ramen with fried tofu and the chicken dumpling ramen with egg and fried garlic. Both were solid choices! Would not recommend taking kids here; loud hip hop/rap music blasts and every other lyric has the f word...", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_tJHQMvLRozIO5tsma0gag/348s.jpg", "caption": "Veggie ramen!"}]}}, {"review": {"des": "My favorite Chi town ramen, and I've tried a lot of ramen around these parts. Rich tonkatsu broth, slurpable noodles and perfectly roasted topping make for a great treat. If you have any spice tolerance at all, go for the \"furious\" bowl!<br><br>Also good to know: they have sake for there and barstool seating only.<br><br>Edit: On my most recent trip I took some gluten free friends who were stoked to try the poke bowl--but they were out of ahi less than two hours after opening! They replaced it with chicken but charged six bucks over the sushi price. Minus star. Ramen still boss tho.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xqkSkIN-zV7P1w_e3mi49A/348s.jpg", "caption": "\"Furious\" ramen bowl + kimchee. If you have any spice tolerance at all, get this..."}]}}, {"review": {"des": "The ramen broth here is so velvety and hardy that no other ramen is good enough anywhere in the country anymore. My go-to is shoyu ramen with a side of Furious sauce and pickled vegetables. Also, there's a good lurker spot at the window to do some solid people watching.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/a_PtRbYDHksq9G5eSDQoEg/348s.jpg", "caption": "View from the lurker seats"}]}}, {"review": {"des": "My husband and I used to come here every Sunday, we loved the furious bowl until they started putting dumplings instead of chicken you might think it's not a big deal but it really tastes different now. BRING THE CHICKEN BACK!!!!", "pics": null}}, {"review": {"des": "WORST Poke Bowl ever!  Don't order this unless you want a dry ass bowl of ubseasoned white rice with a tiny portion of Ahi tuna.   Wow, what a disappointment.   We asked if it's supposed to be served like this and they didn't know that sauce was supposed to be in it.   The host grabbed a soy sauce for us.  Are you kidding me?????  Wow!   As for the ramen here...They're pretty damn good.   My advice is to skip anything else here other than the ramen.   3 stars for an awful experience with the Poke Bowl<br><br>****Update to 4 stars for offering us a ramen on the house.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/u5iOgBY-K-UFVXEvTC17EQ/348s.jpg", "caption": "WORST Poke Bowl ever!"}]}}, {"review": {"des": "The lady at the register was very nice. I was quite upset that I drove from Waukegan,IL and the food change. They took off the chicken ramen dish and added these new dishes that are not as good. The chicken ramen is what made me come back. I ordered takeout and by the time I got home the food was not good to warm up did not taste same highly advise eating at the restaurant if driving long distances.", "pics": null}}, {"review": {"des": "Furious Ramen is fantastic. Definitely add the sweet corn and a little extra Fury sauce to kick up the spice level.  <br><br>Tuna Poke starter was tasty. Good amount of sauce to give the rice some flavor but still taste the fresh tuna. <br><br>The cucumber appetizer is very small for $2.25 price though.", "pics": null}}, {"review": {"des": "I love the ramen here! A solid 4 star!! 5 if you love spicy food  ! The saltiness of the broth is about perfect. And the ramen noodle is sooo chewy, elastic, and slippery in your mouth! Love it! But the beef rice bowl is not that impressive though... so definitely order and ramen and avoid the rice bowl... the rice bowl was way too spicy anyways. Just my personal opinion.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fg0DKz9anM8HlOsAUXYBmQ/348s.jpg", "caption": "Menu"}]}}, {"review": {"des": "So awkward. Anshul DID reach out to me and offered a refund, which was awesome considering I paid at least $5 extra for add-ins that just didn't happen. The refund never came and he stopped responding to me about two weeks ago. Whatever.", "pics": null}}, {"review": {"des": "I won't deny that I enjoyed my bowl of ramen here! If this was just a rating for the Furious Bowl, this place would definitely get 4 stars.<br><br>Unfortunately, I was a tad bit disappointed when I wanted to substitute the Chashu Pork Belly for their Salt and Pepper Chicken (which is cheaper btw) and they wouldn't let me. In addition the Holy Cow Ramen still needs some work! It is a really unique ramen bowl in that it's a beef ramen and usually ramen places only do pork or chicken. BUT the string beans weren't cooked well at all. My boyfriend who almost always finishes his food didn't finish his the string beans. My friend who came with us loved her Shoyu Ramen though.<br><br>I will admit that their noodles are sooo good and their tonkotsu broth is very rich. I just wish they'd allow substitutions and it's obvious they still need to tweak their Holy Cow Ramen a bit! Also beware, there's not that many seats!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bRTw540ZfHyQThtzKIi3Wg/168s.jpg", "caption": "Holy Cow Ramen"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Xax49cMIptevTPzlQvqfDw/168s.jpg", "caption": "Furious Ramen"}]}}, {"review": {"des": "LOVED the ramen (tied for best I've ever had), and music.  Cool atmosphere for dinner and drinks.", "pics": null}}, {"review": {"des": "This is one of my favorite spots in Chicago, and I take all of my friends here. Hip-hop and ramen are two of my favorite things, and it's a perfect combination. The seating is a little awkward, but the service is great, and the food is amazing! It always comes out in a reasonable amount of time, and the quality of the food is top-notch at a really affordable price. <br><br>I usually get the Shoyu ramen (I highly recommend this), but I got the Furious a couple of times and I really like it, except it's heavier. It's just the right amount of spice, I was afraid to try it at first.", "pics": null}}, {"review": {"des": "they lost me. I waited 30 min and the place was almost empty. I tried to be patient and then asked about my food. Turned out that the forgot about my order. No napkins, no chopsticks, nothing on the table either. Who the fuck is the manager tonight!?!?!? You slacking bro. Super annoying. Lost a client. I used to recommend this place. Noooo more", "pics": null}}, {"review": {"des": "This place was so great that since the second week that they were opened i made a point of visiting 2 times a month. This continued till i moved to dc when it became a place that i stopped religiously with every trip to home, thats 8x a year min. I dont eat pork so i loved the chicken shio, the wonderfully delicious broth and real chicken was the real champ. I came in today, to that amazing hip hop, and wonderful customer service that i always receive when i come to this awesome establishment. Only to find the chicken shio was replaced with chicken dumpling shio. Why, why would you add more starch to the noodle dish, and the dough that made the chicken dumpling,  didn't seem to be created using basic flour so it was pretty off putting, in essence the chicken breast thati didnt mind paying a hefty charge for was replaced with dumpling?? Dump_ling with pulverized chicken.  <br>How could you? I guess for the money and the time. Well i was offered other ramen, but i am not vegetarian and i dont eat pork, but furthermore why should we recieve less meaty goodness because we chose poultry? Im sorry and thanks for the offer of substitution, but i regret  to inform you that i wont be returning untill the chicken shio returns.", "pics": null}}]}