{"name": "garfield-park-conservatory-chicago", "reviews": [{"review": {"des": "This place is so lovely! Decent size, lots of good cacti and ferns, which I happen to love. Like all conservatories, it's a great place to go to feel tranquil. <br><br>A few things to note-<br>IT IS VERY WARM. If you go in the winter, wear a short-sleeved T-shirt if you are somebody who gets hot easily. <br><br>Their coat rack isn't monitored or anything, but I left my coat there and nothing happen. I can't imagine it would, so if you feel hesitant about that, I doubt anything will happen to it. Or, if you can swing it, just don't bring a coat. <br><br>Definitely recommend! Especially since it is a donations place. <br><br>Also- the neighborhood surrounding is also really pretty!", "pics": null}}, {"review": {"des": "FREE PARKING.<br><br>This place is such a wonderful oasis in Chicago. It was a cold, dreary day outside and I decided it would be a perfect day to explore. It's free entrance, so why not? It was so nice to go in all of the different rooms and one of the rooms is nice and tropical.. you can see Soursop and other tropical plants growing! They also have several benches you can sit down in and read a book or whatever you desire. I definitely look forward to returning here throughout the cold winter months. Make sure to bring the kids here, they even have a playground area inside!", "pics": null}}, {"review": {"des": "I haven't been to the Garfield Park Conservatory for many years but stopped in this weekend. Such a lovely spot. Not only is the conservatory lovely, but the nearby grounds and park are gorgeous, too!<br><br>The fern room is where people start and it's very pretty, with water, and some cute little spots to poke around. The desert room is nice and outside is so lovely with a nice mix of foliage and benches to sit and relax. <br><br>There is a children's area for our young friends and lots of spots to play hide and seek if you so desire. <br><br>Definitely worth a visit. Easy parking and a friendly staff really round out the spot. <br><br>If you're there in the summer, I suspect it's quite humid. And it even gets warm in the rooms in the fall, but visit room by room for different climates and you'll have a blast!", "pics": null}}, {"review": {"des": "Visited this little gem on my own and it was actually quite relaxing. I came on a Monday afternoon and it wasn't busy at all. I found parking right away and its free! It was a beautiful conservatory to explore and it was nice seeing all the greenery. I took lots of pictures and there were different rooms to explore. Every time I thought I was finished seeing everything, there was more. Outside was really pretty too! I'd recommend passing by because it doesn't hurt and plus its free. You can leave a donation by the door if you'd like. I'd definitely love to visit again with a friend!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1lptB7rKlCYqoG4MOZvsRA/168s.jpg", "caption": "Koi pond"}]}}, {"review": {"des": "This gorgeous conservatory is stunning, massive, beautifully tended and unbelievably free to the public! Weave your way from one room of plants from all around the globe to the next with pauses to escape to the gardens outside as you meander your way through. Some of it is rainforest, some desert and much of it is blooming. A large fern room was designed to replicate what modern day Chicago might have looked like during prehistoric times. There's also a room where kids can climb and let off some steam. <br><br>There was a wedding going on while we were there and the space is so big, nothing was even disrupted. There are many benches throughout to sit and really take in your surroundings and several koi and goldfish ponds to enjoy inside plus plenty of places to enjoy a lunch or snack in the surrounding gardens. I saw several people relaxing with a book throughout the Conservatory and grounds. <br><br>There is a lot of free parking available right outside. The surrounding area isn't the nicest but the Conservatory area feels very safe. It's a great way to spend an afternoon and a perfect getaway on a rainy or cold Chicago day.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xDvexyTuQqo-ETMZgpb1FA/348s.jpg", "caption": "Entrance"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aiDKbU8NtSstbZg8mEXzRA/168s.jpg", "caption": "Hibiscus"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-wsj91ZzKJel9T-6QvN9Fw/168s.jpg", "caption": "Koi Pond with glass Lily Pads"}]}}, {"review": {"des": "WOW definitely a spot worthy to show off to anyone visiting in town! Or even if you are local, good to see at least once a year! Garfield Conservatory is absolutely gorgeous. It is a massive space with several 6-8 different greenhouse rooms/areas, both indoor and outdoor to explore. <br><br>Entry is free but please give a suggested donation. Although Garfield Park is a bit out of the city (maybe 10 minutes from the Loop) worth your time to visit. Much much larger than the Lincoln Park Conservatory.", "pics": null}}, {"review": {"des": "This is an amazing conservatory in West Chicago. I spent a rainy day here and it was amazing! There are about 7 rooms, if I remember correctly, inside the building where there are different types of plants. There are amazing sculptures, designs and running waterfalls that sets each room apart. There are also outdoor sections, but I did not have the chance to see it, as it was raining.<br><br>This beautiful place is absolutely FREE! They do have a donation box instead of admission (there is no reason you shouldn't donate). Staff there is very helpful and friendly as well!<br><br>All in all, a wonderful and relaxing time on a rainy afternoon! Must go again when visiting!", "pics": null}}, {"review": {"des": "Garfield Park Conservatorory is easy to reach, it cost nothing and it has so much to offer.  You can get lost in greenery or you can admire a single creation.  I was fascinated by the cactus skeleton and I wondered how come I have never see one flower from South America in my life.  There are no hundreds of spectacular orchids but it does not matter. You get a walk and \"forest bath\" and you come out of it better then you were before. <br>Pictures tell more then the words in this case.", "pics": null}}, {"review": {"des": "Bottom:  Gorgeous, well cared for plants from all over the world in a historic glass conservatory. <br><br>A conservatory is basically a huge, elaborate greenhouse full of mesmerizing plants.  At least that is how I would describe it. I've visited a handful over the years and the Garfield Park Conservatory does not disappoint.<br><br>The Conservatory features what I would consider conservatory standards - a palm room, a fern room and a dessert room.  These spaces were all warm and enjoyable but the space that left my jaw on the ground is the gorgeous Show Room.<br><br>The Show Room changes several times a year but when I visited it was full of incredible hydrangeas among other flowers. The hydrangeas were so big, full and vibrant they looked fake.  <br><br>In addition to the conservatory there is also a Lily Pool out back and some outdoor gardens.  <br><br>The conservatory has its own parking lot and the L green line is just two blocks away.<br><br>Visiting the Garfield Park Conservatory is certainly worth the $5 suggested donation!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SjJS1mQobMzLfXoSznJ-7Q/168s.jpg", "caption": "I love this rocky topography with ferns and plants tucked into crevices. A photo doesn't do it justice."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/o3IVxwfaoBczTztuQ2yrLg/168s.jpg", "caption": "It was neat to see black pepper growing."}]}}, {"review": {"des": "Beautiful conservatory with lots of unique plants. The cactus room was unexpected and awesome. We walked through fairly quickly as it was a very humid and hot day, and it was naturally humid inside. One disappointing thing was that we saw a couple smoking in the outdoor garden and asking people for money. It would be nice if there was security or employees working within the conservatory, but can't complain for a free activity. <br><br>There was security in the parking lot.", "pics": null}}, {"review": {"des": "Garfield Park Conservatory is literally 3 minutes away from my house. It's such a beautiful place to get away and enjoy a peace of paradise. I attend a wedding here  a few years ago and it was absolutely amazing. <br><br>The Conservatory offers Free Admission with street parking or you can park in the lot for free. Feel free to make a donation with no pressure. <br>Rain, Sleet, Snow or Sunshine the conservatory is open 365 days a year.<br><br>Such a beautiful place to visit and enjoy with the family. The kids will enjoy playing in the Tree house with slides and other fun activities. <br><br>An enjoyable way to getaway for a few hours to come and basin in a day full of a beautiful surrounding of nature. Especially in the winter time.<br><br>Each room has it's own unique presence of flowers, trees, ponds and waterfalls. Very relaxing and smoothing. Great place to come and unwind and free your mind.<br><br>Be sure to sign up to receive emails on upcoming events.  <br><br>The staff is friendly and well informative.  <br><br>You can even come out for a Yoga Class on Saturday Mornings and enjoy a nice relax workout in one of rooms.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8WWFVXpchZ2ScBVM8kuC4Q/348s.jpg", "caption": "Beautiful Path"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sTe2pR_O_XrGvIf-b61NiA/168s.jpg", "caption": "Map Trail  Of Sweetness"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mbGrH0VupodP1wL3u44DPg/168s.jpg", "caption": "Poetry While You Wait"}]}}, {"review": {"des": "This is a pretty cool indoor garden.  There is a trains stop on the green line right by it so you don't have to worry about getting there.  There is also free parking nearby.  The best part is everything is FREE!  It should take about 30 minutes to check out all the indoor area and some outdoor area.  The place is pretty nice and everything was beautiful to see!", "pics": null}}, {"review": {"des": "This place is so beautiful! My friend who is super into botany took me, and I was very impressed at the sheer size of this place. Fern room was like stepping into Jurassic Park, and make a fun game out of seeing all the small figurines people have hidden. There are some really weird puppets hanging from the roof, and the Giverny garden was not in bloom, but a fun way to spend a couple of hours leisurely enjoying some beatiful blooms.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/X-tTaymp6oVkecC0jXxFZw/348s.jpg", "caption": "The fern room smells so earthy"}]}}, {"review": {"des": "An absolute must-see if you're in the area (or not). <br><br>We visited during the \"Fire & Ice\" exhibit. Seeing all of the poinsettias was unique, interesting and fun.<br><br>Other fun things to see were the cacti & succulents, fruit, gum, chocolate and vanilla trees, a greenhouse of ferns, waterfalls, koi fish/ponds and much, much more. There's even a play space for the kiddos.<br><br>Admission is free. Free parking lot adjacent to the conservatory. Gift shop could use revitalizing, but overall a great experience.<br><br>Would return.", "pics": null}}, {"review": {"des": "Such a beautifully-crafted landscape that fills you with wonder of how they even fit such a small space with an entire jungle! Well, at least that's what it felt like to me. The view was spectacular as you're met with a faint waterfall in the distance from the entrance way, but the entire way heading there is like a sweet serenade of diverse plants and hanging leaves with a scent of musky earthiness. <br><br>The one thing I underestimated was how humid it actually is in there. I wore leggings under jeans, a tank top with a thin black bomber and still felt like I was in a sauna! It was kind of disappointing that some parts were under construction or not really open at the time I came here but nonetheless it was still quite the sight to see and really makes you feel more appreciative of how detailed and withstanding each plant really is because of how hard the employees work to keep them in good standing.", "pics": null}}, {"review": {"des": "Great indoor gardens and a fantastic place to go when it is cold out.<br><br>About 7 or 8 different rooms with flowering plants, cacti, ferns, small trees etc. and plenty of signage with the species names.<br><br>The gift shop has very little in it so don't plan on finding an extensive assortment of memorabilia.<br><br>The location is just a half block away from the Garfield Park green line elevated station and there is a parking lot just to the south of the building. There's also a lot of street parking as well.<br><br>The best part of coming here is it that there is no admission fee.", "pics": null}}, {"review": {"des": "Came here during a weekday for a more serene sight, as opposed to the bustling city life that I'm usually immersed in whenever I come to Chicago. While parking, I already felt like this place evoked that sort of \"hidden gem\" aura to it. The parking lot was sparsely filled with only some mild traffic and the spritz of nearby sprinklers filling the air with ambient white noise, and luscious green hues were already escaping the main building by way of the greenery outside.<br><br>The inside is broken up into different sections all featuring a different family of botanicals including palms, ferns, desert plants, an \"aroid\" house, and a couple more. Each room has it's own distinct feel to it. While I went there were many young adults, who I assume were students of some kind, intently sketching out the plant right in front of them. I imagine most of them had been at it for hours, as the tranquility of each environment and setting was addictive. I myself became adrift in a couple aimless thoughts as I meandered slowly through each exhibit.<br><br>I especially liked the koi pond in the middle of the aroid house. I love watching koi in general, musing introspectively at their iridescent scales shimmering through the soft sounds of water splashing on their scales. However, in this conservatory, surrounded by such elegant and exquisite plants, and allowing my solitary thoughts to take over, I briefly forgot about the rest of the world and enjoyed a few precious moments alone, and just that.<br><br>Overall I'm really impressed by the collection of plants they have here at this conservatory! I am no botanist or botanophile, and I can't tell you the specific name of a single plant that I saw here. However, I can tell you that if you're looking for a place to let go of the rest of the world and just grant your mind freedom for any amount of time you desire, this is definitely the place to visit and just chill out for a bit! You could probably walk through everything in less than half an hour if all you cared about was quickly seeing every plant inside at least once, but I think this place offers so much more than just the odd and curious botanical specimen. Must see if you're ready for a way more toned down and placid activity while in Chicago!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Gd_ITC5VvqWBHPrQjuswaQ/348s.jpg", "caption": "Ferns everywhere!!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cF-cW-zGUMXfJGF2Q6Qgyw/168s.jpg", "caption": "Plants"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/B5u4pdV0PZXFml5VcbE16w/168s.jpg", "caption": "Beautiful green plants"}]}}, {"review": {"des": "Was in town for the week and decided to visit. Such a beautiful greenhouse that's also wonderful for photo-ops! Loved visiting every little section of the conservatory. A little bummed that I was not able to visit the outside portion of the place since it was pretty much a huge field that was asking for adventure. Definitely would love to stop by again when I'm in town again!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zjK9V4P_0iFukGuNI2TsmA/168s.jpg", "caption": "Felt like I was in a jungle"}]}}, {"review": {"des": "An oasis; a utopia in the middle of a not-so-great neighborhood. When you walk in to the conservatory, you instantly smell the breath of fresh air, literally. It is such a pleasure going to this place, especially in the dead middle of winter when all you're craving is a little sun and a little bloom of nature. <br><br>The flowers are stunning. I actually fell in love with one flower there that I had never seen before, wrote the name down, and will be using the unique flower in my wedding. <br><br>The trees, cacti, and cool exhibits make it so unique compared to other conservatory's I've visited. I will tell you, I've been to the Gardens By the Bay in Singapore and they had very similar-looking exhibits with the same flowers and tress as the Garfield Park. So that means, GPC is definitely doing something right. <br><br>I think this is an absolute must to visit! Add this to your list. Enjoy!", "pics": null}}, {"review": {"des": "Amazing breathtaking views and terrific place for pictures. A must see place to visit during your trip to Chicago. The admission here is FREE. Be sure to check in at the front counter when you go. They have bug spray which you may want to put on before you tour. I'm so happy I came here and it has been a highlight of my vacation.", "pics": null}}, {"review": {"des": "Wow, this is definitely a hidden treasure tucked away near Oak Park.  We wanted a something quick to visit before our tour of Frank Lloyd Wright Home and Studio.  This place opens at 9AM with plenty of parking in its private lot which is nice.  The admission is free with donate as you please at the entrance.  We walked around the whole indoor greenhouse in about 30 to 45 minutes.  It was nice that it was early and not too many people visiting.  There are different climates from desert to ferns to palms to aroid house.  Also, there is nice outdoor areas in front and behind the conservatory to enjoy wide open space with flowers and plants.  Overall, this place is not to be missed and it is a stop on the CTA metro Garfield station.", "pics": null}}, {"review": {"des": "Beautiful! Probably even more so when the weather is nicer. The palm room and fern room are amazing. It's been around for over a 100 years. The plants are amazing, their catalog and variety of plants, fruit, succulents, greenery is vast! <br><br>Great learning experience. And no admittance fee (but donations accepted).", "pics": null}}, {"review": {"des": "I've been coming here for years and it never gets old.<br><br>In those Winters months when the weather is gloomy and I feel the Blues, I can always count on this place to brighten up my spirit.<br>No matter the weather outside, a cold winter day or a hot summer drought, it is always green inside.<br><br>Not that you should stay away during the warmer months; summertime when the landscape comes alive this place is magical; with the Monett Garden toward the front and the City Garden with the Lily Pool in the back, it is almost like you walk into the pages of a fairy tale.<br><br>This is truly a hidden gem of Chicago, and it is in plain sight.", "pics": null}}, {"review": {"des": "An oasis of beauty and charm. Much bigger than the Oak Park conservatory. Love coming here! Great for photographers.", "pics": null}}, {"review": {"des": "During a cold winter day, this place is a great activity. <br><br>It is free admission and they do have a coat check. Definitely recommend this because it is pretty humid inside the conservatory. <br><br>You truly feel like you've escaped the city while inside because the main room has a large pond surrounded by large trees and plants. There are even turtles laying on rocks!", "pics": null}}, {"review": {"des": "It is a nice conservatory with different rooms that host various types of plants.  It is very educational.  I didn't know that vanilla is part of the orchid family after I read the info on the chalk board underneath the huge plant.<br><br>It is very convenient.  Take the Green line to Conservatory.<br><br>And it is free:-)<br><br>It is bigger than the conservatory in the Lincoln Park, so for sure it is a better venue for hosting a special event.  And if you are interested in desert plants, here is a better choice.<br><br>But if you are interested in exotic plants like orchids, Lincoln Park Conservatory is a much better choice.  In addition, many knowledgeable volunteers are available in Lincoln Park to share their knowledge.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sF979nm6GNzKXSwSFiX_-w/348s.jpg", "caption": "Fragrant ground orchid"}]}}, {"review": {"des": "This park is free to public. You just need the zip code that you from, and you get in for free. This conservatory. The time we have did not allow the outside garden visit. This review strictly for the inside visit. <br><br>Although this conservatory is free, there many area you can support them. You can become a member, volunteer, or donation. The inside of the conservatory divide into 7 area. I like the sugar from the sun house the most. They also have children garden house that can play. <br><br>Please make plans for about 2.5 hours for complete visit. The inside of conservatory is about 1.5 hours. The walk is easy. Since this is temperature regulated area, it is warm in that regard. Wear appropriate clothing. The desert house is nice to see many types of cactus. Don't forget the lily pool on outside if you visited at summer.", "pics": null}}, {"review": {"des": "Walking into Garfield Park is like walking into another world. <br><br>Lush foilage exotic plants and flowers.<br><br> It's a perfect place to spend an afternoon or day in a very enjoyable atmosphere. <br><br>Don't forget the outdoor section of Garfield Park. There are awesome walking paths, activities for children, and a really pretty pond.<br><br>There are nine sections to the Garfield Park Conservatory check out:<br> the Palm House<br>the fern room<br>sugar from the Sun<br>Elizabeth Morse genius Children's Garden<br>the desert house<br>the aroiid house which includes the Persian pool and features 16 yellow lily pads which were created by the world acclaimed glass artist Chihuly expressly for the aroid house <br>the show House<br>Horticultural Hall<br>the outdoor Gardens<br><br>Come spend the day with family and friends and enjoy a little taste of nature in the city<br><br>The Garfield Park Conservatory is truly an awesome place!  <br><br>Love to come here in the winter!  Summer is really colorful and beautiful too!<br><br>You feel like you have just stepped into the jungle.  <br><br>Always something different, lush plants, & flowing water make this a peaceful oasis in the city.<br><br>The best part is It's free!!!  Donations are gratefully accepted.", "pics": null}}, {"review": {"des": "One of my favorite places that we visited! It was the most beautiful conservatory I have ever been to. Every room surprised me and took my breath away. It looked small on the outside, but there are so many different exhibits.<br><br>I love the Hash Tag No Filter spring flower garden. I also loved the desert plants, reminds me of home in LA.<br><br>I can go on and on, but I truly loved every part of this conservatory. <br><br>It is free admission with a suggested donation of $5 for adults.", "pics": null}}, {"review": {"des": "Amazing!  Incredible!  Beautiful!  There are not enough words to describe how wonderful this place was.  There are several rooms each as fabulous as the other.  The place is very well kept which I wondered since it was free- sometimes with free/no admission places seem to be a little run down but not here.  We were so impressed by every aspect of the Conservatory.  They also have an outdoor community garden which was bountiful and apparently partners with a kitchen around the corner.  I took so many photos it is hard to choose the ones to post with the review.  Suffice it to say it is a must see for Chicago.  They suggest a donation upon entry which I hope everyone respects and donates the suggested amount if not more- this place does not look like this for free.  I was more than happy to support it.  Wonderful, amazing, incredible place!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/p2hdwMbnQFDcuBo4Fm01ew/168s.jpg", "caption": "Community garden"}]}}, {"review": {"des": "This place is a great find for a big city. It's \"kinda off the beatin' path\" but its worth the journey. <br>The conservatory offers multiple different areas, all with different types of plants and greenery. You'll find everything from palm trees, to cacti, to roses and lavender. This place is great, and its FREEEEEEEE. If you have a green thumb or you're in love with someone that does, then you must take them there! <br><br>JUST GO", "pics": null}}, {"review": {"des": "The most beautiful flowers and plants you will see in Chicago.  Very courteous staff. Definitely a place for photos during the winter months. I've taken tons of pics of weddings and cotillions during the winter months.  Plenty street parking.", "pics": null}}, {"review": {"des": "This place is a hidden gem of Chicago, it's a great escape from city life. Absolutely free and located conveniently next to a green line stop, you should make it out there at least once. They have 6 or 7 different themes, my favorite being the fern and aroid ones.<br><br>They also have a nice outside area with a cool grass labyrinth, cozy spot to read a book after you browse the gardens inside the conservatory.<br><br>Give yourself 2 hours to explore and amble around the building. Then go back and donate! This place is a haven, especially in the dead of winter with no life outside.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/CtTlIaZ79Y3oPm4YZwhLlg/348s.jpg", "caption": "Cool labyrinth"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WQFDSvlL8KgLdFQwaXP_jA/168s.jpg", "caption": "Plant-ception!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Lgj0qvjutkzoew5YbmJZTA/168s.jpg", "caption": "Chihuly glass"}]}}, {"review": {"des": "Very beautiful place nice<br>Place  go and have some me time. I go here with my grandchildren. And they love it.", "pics": null}}, {"review": {"des": "Garfield Park Conservatory is an Eden within the concrete jungle, hidden in plain sight. I can't believe it took me almost 10 years of living in Chicago before discovering this beautiful park! It's so accessible, having its own CTA stop off the green line, nearby dedicated bike lanes, and a free parking lot. The spaces are well-maintained and well organized. Lots of photo-opts abound. There's a children's area indoors and outdoors so plenty to keep the kids occupied. It looks like you can hold event here's either on the outdoor back patio or the indoor hall. When we were there last weekend, they had their first Goat Yoga event in one of the outdoor spaces. How cool is that? The preregistered class was already sold out, but we were able to observe them corralling the baby goats and distracting the mama goats with food. Everyone looked like they were having a great time, even the goats! <br><br>There's a suggested donation of $5 for adults and $2 for kids under 12 but it is definitely worth contributing to help maintain the beauty of the park.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2M7ZmewzSk93B-gutvjM4Q/348s.jpg", "caption": "Goat Yoga!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gLQ9ixQLW9xG1qM-Ng31XA/168s.jpg", "caption": "Memorial Day Decor"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/i4kgkblOzv1i0iHau9tYHQ/168s.jpg", "caption": "Desert plants"}]}}, {"review": {"des": "Such a beautiful environment to wander around .  It's a great way to take a day trip without spending any money.", "pics": null}}, {"review": {"des": "If you're looking to go on a romantic date and you're broke, Garfield Park Conservatory is the way to go! I don't know much about plants, but man it's so beautiful, and if you're a fan of cacti, they have a cactus room! Very relaxing and peaceful, this place is a must go if you live in Chicago.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3p111lUHz7I_06_LUUgIlA/348s.jpg", "caption": "Celebrating 6 months with my girlfriend today!"}]}}, {"review": {"des": "Love this place! I've been several times for volunteer events and on my most recent visit it was for a photo shoot to promote a fashion show I'm walking in. <br><br>Great for everyone! Beautiful greenery and plenty of free parking.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yhk-nmnQrbA0lkPRYowJNw/168s.jpg", "caption": "Big Table Dinner"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sgVNJ9NZ0vbikI5p-E2X7A/168s.jpg", "caption": "Derby Photo Shoot at Conservatory"}]}}, {"review": {"des": "This place is always open no matter the season. If you looking to take a break from everything , <br>Or just have a love for nature, this is a great place to come and free your mind. There are various room with different sort of plants from all over the world. The place is well maintained. Every time I come it's always clean.  <br>There's also an outdoor space , where you can take great pics by the pond. <br><br>Come visit this place , you won't be disappointed.<br><br>And it's FREE!", "pics": null}}, {"review": {"des": "WELCOME TO THE JUNGLE<br><br>It's a floral free-for-all at this mesmerizing garden paradise!<br><br>One of the largest of its kind in the USA, the Garfield Park Conservatory was completed in 1908 and is open 365 days a year.  It's on the National Register of Historic Places and is the *largest* publicly owned greenhouse in the world (I think).<br><br>What's more, visitors aren't charged a penny to enter although there are recommended donations of $5 for adults and $2 for kiddos.  Street parking can be found nearby for a small fee.....or just do what I did -- park and wing it for the low, low cost of $0.<br><br>I spent 1-2 hours here on a date with Dyanna K (awww!) and that's about all the time you'll need to enjoy this gorgeous plant museum.  Essentially landscape art under a glass roof, the conservatory occupies two acres of space indoors and another ten acres outside.<br><br>A true botanical treasure, there are 8 unique rooms inside comprised of different varieties of flora.  The first room you enter is the biggest: the palm house.  With a ceiling 65ft high, it can accommodate the 70+ kinds of palm trees on display, some reaching all the way to the glass roof!<br><br>Next up is the show house, a spectacular arrangement of flowers that's almost too pretty to believe.  When I visited, the 'exhibit du jour' was decorated in honor of the Chubbies winning their first World Series since the bronze age, complete with scoreboard, vine-covered outfield wall, foul poles, and iconic trophy suspended from the ceiling.  Breathtaking.....even for a grumpy Sox fan -_-<br><br>There's also a lush fern room (THIS is where the red fern grows, hehehe) with an indoor lagoon, as well as the aroid house which included a pond with sixteen bright yellow glass lily pads designed specifically with the conservatory in mind.<br><br>Perhaps my favorite zone was the desert house, containing the most diverse collection of cacti in the region.  Besides the standard saguaro cactus, there were some kinds with vibrant coloration and others with brilliant structural esthetics.  A couple plants were straight up NIGHTMARE FUEL and looked like a porcupine f*cked a sea urchin, and then had post-production work done by H.R. Giger.  Hauntingly beautiful.<br><br>The conservatory was easy to navigate and doors between areas kept the arid zones dry while keeping the humid zones damp.  Plenty of up/down pathways and everything was meticulously maintained, although I would've liked to see more benches for visitors.<br><br>Despite the lack of places to sit and no discernible concessions (at least that I saw), the Garfield Park Conservatory is still a great way to kill an hour or two.  When you factor in free admission and the astounding attention to detail, it's impossible for me to not give them the full 5*.<br><br>I'd like to close this one out with some suitably topical (tropical?) prose, courtesy of the late great Shel Silverstein:<br><br>\"We gave you a chance<br>To water the plants<br>We didn't mean THAT way<br>Now zip up your pants!!\"", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/73AHqDR3Le9HMHIqAuQGIQ/348s.jpg", "caption": "WHERE THE GREEN FERN GROWS - my 1,000th uploaded photo y'all!! Lush. Brilliant. Breathtaking. (with minimal filter) #anotherdayinparadise"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QEK-a0Af4fqBRiXkbQIElA/168s.jpg", "caption": "These breathtaking pink blossoms were worthy of a photo!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PqvONV0Zou6aOetwk3KLiQ/168s.jpg", "caption": "The exhibition room featured a floral tribute to the 2016 World Series champs, complete with scoreboard and foul poles!"}]}}, {"review": {"des": "An absolutely tranquil escape and a must-see for anyone visiting Chicago- especially in the winter. The fern room is my favorite spot in all of Chicago. Peaceful, warm, perfect.", "pics": null}}, {"review": {"des": "'Tis the season for this place. I get winter blues. Badly. The snow. The frigid temps. The crunch of snow underfoot. The sleet. The short days. The slow drivers. I never feel warm enough. I have a shorter fuse. I'm not as active. I watch a lot of Hawaii Life and House Hunters. I miss leaves on trees. It's depressing, winter. To me. <br>But the Garfield Park Conservatory always lifts me up. Greenery everywhere. Really warm employees once you get past the lobby. Nice enough simple snack and tchotchkes shop if you need a small pick me up for the lil one. An awesome Fern Room. Really interesting cacti, neat play area for the kids. A seasonal room that is incredible at Christmastime and beyond beautiful at spring. You can spend an hour there and simply forget the snow and sleet outside. Really, an oasis in the midst of the horrid weather that Chicago is known for this time of year.", "pics": null}}, {"review": {"des": "Highly recommended, with one caveat, which I will save for the end of my review. <br><br>The Conservatory provides a wonderful retreat into a lovely environment of tranquility and beauty.  I suppose you could hurry through the building in 30 minutes, but you will probably want to spend at least a couple of hours to slow down, see everything, and just breathe in the peacefulness.  Admission is free (with a suggested donation) and there is abundant free parking. <br><br>This is a great place for both kids and adults to get in touch with the tempo of trees and plants, which live at a much slower pace than we do.  It's not a theme park (so not a place for blowing off steam), but it's a great place for relaxing and learning in beautiful, lush surroundings -- such a nice contrast with the concrete jungle outside.<br><br>Which brings me to the caveat I mentioned:  This neighborhood is not the safest in Chicago, so use your street-smarts and exercise heightened caution before you go strolling around the neighborhood.  The Conservatory itself is perfectly safe, and is highly recommended.", "pics": null}}, {"review": {"des": "This is the must-visit place in Chicago if you are into plants/flowers. Since this place has no admission fee, I personally didnt expect that much. However, the conservatory is quite good. I loved the little water falls they made. I loved the scent of plants and nature vibe that I felt from here. This is definitely a hidden gem that i would recommend to anyone visiting Chicago. Most importantly, this place is free. So, you dont lose anything from visiting here. Rather, you would feel refreshed at the end :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YRsg_GsmGE0zpZXki0ut_A/348s.jpg", "caption": "Such a wonderful place to be in"}]}}, {"review": {"des": "Ok, this is a cheap Saturday afternoon date with your kid, but it's a good one.  There is something so great about visiting on a wintry grey February afternoon when the humidity of the conservatory just feels so right.  The talking birds, colorful koi and your child's expressions will make for some great photos.", "pics": null}}, {"review": {"des": "I went here to take photos for a company. In the past they had taken photos here without any issue. When I came, they were very strict on the photography policy - my mistake, I didn't do the correct research. Further, this wasn't for commercial use so I thought, hey, we should be fine. However, we were met with some issues. An employee let us know we were unable to take photos without a permit.<br><br>I will stop there and state the obvious: I still didn't have a permit, and I wasn't allowed to buy one at the point in time. I was told I had to apply for it. This is not anyone's fault but mine, I definitely acknowledge that. Anyways, fast forward. This company and I are walking to the back of the conservatory. I was given a stern warning that if I were to take photos, staff members would interrupt me and I'd be kicked out. Much to my pleasure, I noticed a LOT of people taking photos here and no one was stopping them. I did feel guilty and so on my way out I donated money and walked around the rest of the conservatory. <br><br>This conservatory is a beautiful! It's such a gem. I know that people might say it's in a bad part of the city, but it's really not bad at all. It's right off the green line's conservatory stop. You have to walk approximately one block. I made the mistake of coming here during the fall. While it's amazing, I can't wait to return back during the spring and see the lily pond. I also can't wait to return (sooner) and see their holiday set up called 'Fire and Ice'. From the little bit I saw of it, it was great.<br><br>There are many different areas you can walk in. I suggest you look at the map before wandering. The main areas are The Palm House, Fern Room, Sugar From the Sun, Dessert House, Aroid House, Show House, Horticulture Hall, and other outdoor areas. <br><br>Some good things to know:<br><br>1.) This place is kid friendly! They have different activity areas for the children. There is a place in particular that has a slide and some fun called the Children's Garden. Also, outside they have different activities in the summer, such as the butterfly garden and the play and grow area. The navigation of this place is great.<br>2.) The Desert House is (in my opinion) the most interesting - if you're into succulents and cacti, this place is for you. I loved this room because everything was thrown together randomly. Yes, it is probably the least furnished and put together, but that's what made it great. I really loved seeing and touching the various plants.<br>3.) The Aroid House is stunning. They have a beautiful water area with a lily pad sculpture in it. In the water there are Koi fish as big as my forearm. They actually come up from the water and greet you.<br>4.) All the rooms are unique in their own way. They've really set out to make each area of this place unique and I adore it. Each room has distinct layouts with little things that make them different. Each room will bring a new surprise.<br>5.) This place would be GREAT for weddings and events! I would seriously consider getting married here.<br><br>This place is sincerely worth the money; whether it's paying the fee for photos or getting a yearly/monthly membership, it's a great place. I highly suggest everyone go here! You will truly not regret it.", "pics": null}}, {"review": {"des": "Worth the train ride outside the city. Gorgeous, huge fern and palm rooms. Amazing dessert room, too. The outdoor gardens were just so so this week, but the fern room alone made it worth it. Plenty of benches and quiet spots to enjoy and reflect. Took about 2 hours to see it all at a meandering pace. Much prefer the expanse of this park over Lincoln Conservatory.", "pics": null}}, {"review": {"des": "I started my Birthday Week 4/16 (Sunday Funday) with a visit to here at the suggestion of a friend. I've lived in Chicago for 7 years and never knew about this Treasure!! I love spending time outdoors and admission to the GPC is free with much to explore!<br><br>Garfield Park Conservatory is a short trip <br>on the Green Line from downtown, and once I was there, I felt we were in another world. It helps that we were there early Easter Sunday, as we roamed around with very little interaction from others. The families started to show up around 2pm.<br><br>The Palm House has tall beautiful palms, vibrantly green and surprisingly wide! The room was very spacious with catwalks up high to help in the caring of the plants.<br><br>The entrance to the Fern Room was lined by two graceful marble statues (Idyl and Pastoral), and the personality of this room was welcoming, yet mysterious! I loved exploring the paths, walking through the creeks and next to the waterfalls. The Indoor lagoon was full of sleek koi fish.<br><br>Since this Conservatory opened in 1908, it was only fitting that they would share their story with the World Series Champions *Chicago Cubs* and the Show House exhibited these achievements creatively!<br>The flowers were colorful and fragrant (Easter Lilies are a favorite), live games were broadcast overhead bringing back the excitement for the \"W\"!!<br><br>The Horticulture Hall displays a hand made intricate mosaic fountain and the Jensen Room gave me a hearty laugh with its flash-to-the-past photographs. <br><br>The Aroid House is where I recognized the most plants, and the Persian Pool with the glass sculptures by Dale Chihuly is Stunning!!<br><br>The temperature change inside the Desert House was radically drastic and I felt transported to the deserts of the world.<br><br>The Children's Garden is a wonderful addition for children where they can ride down a slide and actually interact with some of the plants to understand the textures/fragility of them.<br><br>I found the Sugar From the Sun room to be very educational about where fruits, veggies, and spices are grown.<br><br>The gardens outside were nice as well, a family had a picnic at the Bluestone Terracee, couples sat on the benches in the Monet Garden and children were playing in the Labrynth next to the Sensory Garden.<br><br>Garfield Park Conservatory is an excellent alternative to CBG and I will be back to check out special events!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5ZHIuWzc9AEXome1u3fdwg/348s.jpg", "caption": "These signs were everywhere and led to little pathways"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_lxxRtbvMVYt33PSxFnyiQ/168s.jpg", "caption": "Vanilla bean trees - be kind, don't touch :)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xZipToof04mfJH9WrJ7sSQ/168s.jpg", "caption": "Vibrantly yellow Chihuly lily pads"}]}}, {"review": {"des": "Absolutely beautiful indoor space that gives you the fresh air of nature during the cold winters months of Chicago. Great date spot for walking around and making conversation. Also a great place to journal, sit alone and reflect, and people watch. <br><br>Free entry with a suggested donation. Gets really busy on weekends though so for more peaceful visit, I suggest non peak hours. I also recommend coming on a sunny day to enjoy the light from the glass ceilings. <br><br>My favorite place to sit is the Fern Room. Very peaceful.", "pics": null}}, {"review": {"des": "I learned it was constructed between 1906 and 1908.  \"Both Garfield Park and its conservatory are listed on the National Register of Historic Places\" per the Garfield Park Conservatory brochure.<br><br>I attended today primarily for their \"Creature of the Night' event where they had many animals people could get a closer look at.  Some examples where several owls, a possum, snakes, and more.  People manning the tables with the animals, were pleasant and informative.  Many children in attendance were dressed in various costumes.<br><br>It was very interesting to travel from room to room and see the different plants, flowers and trees.  They have a back yard but I didn't check it out today.  Many years ago I went to the back yard, partly because of another event they had with several statues.  With warmer weather I would come back and check the outdoor sections of the conservatory.<br><br>It is free, but you could make donations if you wish.  They also have a small shop where you could buy some beverages and mementos of your visit.  They a have a parking lot, some street parking and it's near the green Line \"EL\".  Not many restaurants within walking distance.<br>They also have classes, such as composting, you could register for online.", "pics": null}}, {"review": {"des": "Not really worth a visit for a tourist but it is a great free activity for local residents. Parking is also free as well. <br><br>The plants, trees and florals are not particularly unique but it is well maintained and is an idyllic way to spend a couple hours. There is also a small children's area with the main attraction being a tube slide.", "pics": null}}, {"review": {"des": "4.5 stars. Brought my second graders here for a visit and they loved it, especially the children's room. We were learning about South America and the rain forest, so they came in looking for different plants from South America. It was great that each plant had a sign next to it telling where it came from or where you could find it. The view of the Fern room from the stairs of the entrance of the room was so beautiful, and was probably my favorite room. There's a pond in the middle and if you get lucky you might see some creatures around! We didn't get the chance to go to every room, but I'd love to come back to explore more!", "pics": null}}, {"review": {"des": "This place is beautiful. Such a retreat from life - and free to boot!!!", "pics": null}}, {"review": {"des": "Phenomenal. I have been to conservatories in Atlanta, DC, etc. and this one is as good or better than all of the rest. And I think this is better than the very, very nice Lincoln Park Conservatory.<br><br>The size of the conservatory, the variety of the flora, the maintenance, etc. are all top notch. Look at the many photos I and others have taken here.<br><br>Two minor issues that are not close to deal-breakers but you should be aware:<br><br>1) We were there early in the morning and I think it's a place I need to GTFO before dark. That's fine - I have been to many neighborhoods like this before. Just don't be an idiot.<br><br>2) It's a few miles outside of downtown Chicago. We took an Uber and it was under $10 for four of us. Cheap.", "pics": null}}, {"review": {"des": "Admission is free, but there is a suggested donation box.<br><br>You can spend at least an hour here walking around their expansive greenhouse complex. They have everything from tropical to desert plants, and the selection is stunning. Just the desert room alone has hundreds of individual species, some extremely rare. All were in phenomenal shape showing the level of care this institution has for its plants.<br><br>Highly recommended especially on a wet or cold day.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/k3_WXfUfDeDbHs6DOnPyAw/348s.jpg", "caption": "Agave lophantha quadricolor"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jaHUpcarnADtZa2HWrEzjQ/168s.jpg", "caption": "Agave Kichijokan"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/17VB3YOWl_KTVAP7WH-ZPQ/168s.jpg", "caption": "Agave americana marginata"}]}}, {"review": {"des": "One of my favorite places in Chicago, the Garfield Park Conservatory is a gorgeous West Side gem. The plants are absolutely amazing! It's such a wonderful place for a stroll (especially in the biting Chicago winter). I could spend hours here!", "pics": null}}, {"review": {"des": "Finally checked this conservatory out after years of wanting to. It was beautiful! It's the dead of winter so I definitely want to make another trip over the summer when I'd assume their outdoor gardens are a bit greener. The place is free (donations accepted). Obviously, as conservatories go, it's very hot inside so dress accordingly. We spent about an hour and a half here wandering around, taking photos and learning about different plant life! <br><br>We took an Uber to get there because the directions I had made it seem like it was a bit of a walk from the el station and I'm not familiar with the neighborhood, but we felt silly once we arrived and realized that the el is literally right outside the doors to this place.", "pics": null}}, {"review": {"des": "Wow. Amazing. The amount of knowledge you gain is amazing. It's a must check out. Beautiful scenery. It's completely free! It's a must check!", "pics": null}}, {"review": {"des": "One of Chicago's hidden gems! Enjoy free admission for a world-class horticultural experience. The palm room is absolutely breathtaking and sets the scene for your whole time there. As you walk through hundreds of species of palm trees, flowers, bushes, and other flora, you can learn so much about the climates other than our own. <br><br>After the palm room, visit the fern room! With these ancient plants all around you, you'll feel like you've been transported to the Jurassic Era! A gorgeous pond and water feature designed by renowned Midwestern landscape architect Jens Jensen completes the scenery. <br><br>Also visit some of the outdoor gardens for a beautiful visual and olfactory explosion of sights and smells! I recommend the conservatory to anybody visiting Chicago.", "pics": null}}, {"review": {"des": "i went there today whit ny daugther <br>admision is free but leave a donation<br>our visit was great<br>spring break lot kids and families all over<br>i love the koy fish they huge<br>we take the cta the green line <br>i was looking for souveniers but the strore was pretty emty and the guy in charge on his phone<br>thank you see you next time", "pics": null}}, {"review": {"des": "It is incredibly hot in here so there's the warning!  But please do not let that deter you from coming here because everything inside is definitely something to see.  When I say that this place is a breath of fresh air, I mean that the air is literally so full and so fresh that I question myself how I am supposed to breathe the air outside after coming inside.  The air is a dense and a little thicker which is doing your lungs a favor.  I cannot fully properly describe it, but you honestly just have to experience it yourself and breathe in the air here.  The conservatory is aesthetically pleasing from the greenery to the waters.  I had a nice time here with a friend as we walked through the jungle.<br><br>Also, my friend and I took an uber here but seeing how we did not locate a parking lot, I am not sure about the parking situation here because we just got dropped off at the front.<br><br>Thank you, Garfield Park Conservatory!", "pics": null}}, {"review": {"des": "Lots to see here at Garfield Park Conservatory. Easy access from the Green line if you're coming from downtown & did I mention free admission (donations appreciated though) and open 365 days a year. With plenty of rooms and gardens to explore, you could easily spend over an hour here just wandering and taking pictures. I think my favorite was probably the Fern Room. Pretty magical looking when you first enter and feels like you're exploring a jungle. The desert house was also pretty cool with all the various cacti they have. Makes you feel like you're actually wondering a very dense desert. <br><br>Also must say that it's a great spot to bring the little ones as well with many hands on exhibits to engage their curiosity. Will definitely need to pay a visit again in the summer to explore their outdoor gardens. Other than that, not much else I got on this one except don't forget the camera!<br><br>'Til next time, cheers!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QacKnjxSmAgvGrZVkrvuDA/348s.jpg", "caption": "quit fern'ing around"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ogS1RkNm88NYGmDNztjfYw/168s.jpg", "caption": "desert room"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PgiUK8thYWiOrx4QaAEOMA/168s.jpg", "caption": "one of many koi ponds"}]}}, {"review": {"des": "Absolutely beautiful place to go relax and walk!!! Peaceful serene well kept and quiet!", "pics": null}}, {"review": {"des": "I love the GPC. During Chicago winters, this is the perfect place to retreat for a dose of green. Regardless of the season, it's always a pleasant escape. Avoid busy times for a better retreat. Free yoga once a month is serene in this setting. It's also big enough to do multiple laps in and get in some steps. Step outside during the warm months for lovely outdoor gardens and lily pond.", "pics": null}}, {"review": {"des": "This is an amazing conservatory to visit. I expected to stay here for a half an hour at most but ended up staying for a little over two hours. They're so many plants to view.  I defiantly plan on coming many more times.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wKn0rEjfueVKOiwGWcgrpw/348s.jpg", "caption": "Anyone could spend hours gazing at the various species of plants that are available for viewing."}]}}, {"review": {"des": "This place is an urban oasis. It's a hidden historical gem and I feel so fortunate to have visited. It's an urban greenhouse with a desert, a rainforest and an incredible koi pond! It even has the US's oldest palm and largest palm tree! <br><br>Likes:<br>-Free parking! (there is a huge free lot) <br>-Free entrance! Free attraction in Chicago? What? This surprised me as museums and attractions are usually costly in Chicago. <br>-The architecture and unique rooms. They had a kids area, a desert, a rainforest, a \"palm\" room, outside gardens and really cool architectual decor in the rooms. <br>-My favorite place of all was the koi pond with about 50 or so large koi fish. <br>-They even have a meeting room and a cute little gift shop!<br>-Make sure to check out the mosaic planter near the Monet Garden! <br><br>Dislikes:<br>-Bathrooms could be updated. The sink reminded me of something in a public park.", "pics": null}}, {"review": {"des": "The Husband and I decided to take the $15 (one way!) Lyft ride out to Garfield Park from North Loop on a Saturday morning to check out the conservatory. I love plants and with almost 400 reviews and 5 stars, how could we not?!<br><br>We arrived right after they opened at 9:00am and there were only a few other people walking around the whole place; it was so nice to finally be somewhere that wasn't packed! When we left about two hours later and traffic was still very light.<br><br>The plants inside were amazing! You can tell that they are all very well taken care of and there were plenty of them to look at! The first room has a lot of trees, but there is also a room filled with ferns, a room filled with edible (or as John H would say, eatible) plants, and a room that is slightly hotter filled with cacti and succulents! Other than the desert room the temperature inside wasn't too hot or too cold that early in the morning. I could see how it might be hot later in the day though.<br><br>We saw a bunch of plants here that we had never seen before, a bunch of plants that we have at home but aren't doing half as well, a bunch of plants that we have owned before that have died, and a bunch of plants that we saw on our trip to Hawaii and were happy to see again because we hadn't seen them since we came back home almost 4 years ago.<br><br>I would definitely come back again next time I'm in Chicago. They have restrooms, outdoor space for picnics, indoor space for events and weddings and a small gift shop and cafe. So peaceful!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/p0FIzGmFlqB-I9uppcrSqg/348s.jpg", "caption": "Shrimp Plant"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ryh0TcuXWbR0PeefOPW0kw/168s.jpg", "caption": "Dracena"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FW_cyhcBMj2-7putBRdp3w/168s.jpg", "caption": "More bromeliads"}]}}, {"review": {"des": "I didn't really have a love for plant life before visiting the Conservatory, but this definitely helped pull me in the direction of loving them.<br>They really are beautiful.<br>And kudos to the employees for keeping them alive.<br>I'd have killed them in 2 days. No doubt.<br><br>My absolute favorite plant now is the Pink Powder Puff.<br>It reminds me of the Truffula trees in the Lorax, and they are so incredibly soft to the touch.<br>I never knew something like this actually existed.<br><br>This just proves to me how beautiful our world really is.<br>There are so many varieties of ferns, and trees, vines, fruit trees and bushes, vegetables.<br>GUYS, There are PALM TREES IN THE MIDDLE OF CHICAGO!<br><br>I loved the art sculptures inside as well as the relaxing waterfalls and watching the koi swim around.<br>Squirrels kept sneaking up on me and scaring the daylights out of me... But their presence just added to my delight of being here.<br><br>The carnivorous plants outside were fun, tho we didn't actually find the venus fly trap that showed as being listed.<br><br>I don't think anyone should miss the unique and free opportunity they have to visit here.<br>This conservatory was quite the find in the city and I am so glad to say, I loved it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xVOFboCBdXiQ_yEHTbEUeQ/348s.jpg", "caption": "I made friends with a Monarch."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Utcu7MBVSoXTqpqtqrBggQ/168s.jpg", "caption": "The most beautiful art piece inside. It has the illusion of going on and on."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/R_VcM9plC415Eez1W64wJg/168s.jpg", "caption": "Out in the courtyard. Just beautiful."}]}}, {"review": {"des": "Loved. Will return in the summer for full enjoyment. Took my daughter here for and adventure and we were fascinated with how much we could explore even on a snowy day. Free parking. Free entry but donations are welcome", "pics": null}}, {"review": {"des": "Beautiful in all seasons, a great place to take the kids. In good weather they love the children's garden, in cold or rainy weather we love to watch the koi, go down the skid in the indoor children's area, and look at everything in the fern room.<br><br>I could do this most every weekend in the winter if we live closer.<br><br>Easy close parking, decent restrooms.", "pics": null}}, {"review": {"des": "I have been to many incredible destinations during my travels and the Garfield Park Conservatory is near the top of the list. Do not miss an opportunity to spend an afternoon getting lost on the pathways and gardens of this immaculately kept gem. Every turn leaves you inspired and breathing deeply feeling immense gratitude for all the work it takes to keep such an incredible place running and gorgeous. The fact that it's completely free blew me away.", "pics": null}}, {"review": {"des": "Wow! Loved this place. it's only a \"green line\" subway ride away and it drops you right in front of the Conservatory and it's Free (only a donation if you choose which after you see this place you will gladly give a donation). We visited on a Friday morning right when they opened at 9:00 a.m. We had the entire place to ourselves. Each room was special and educational on its own. I was amazed on how it was beautifully maintained. Most of the Conservatory is inside but don't forget all the gardens outside. <br><br>This is a hidden Gem, easy to get to and just fun to walk through. Only tip go early and you'll have the entire place to yourselves, when we were preparing to leave, there were quite a few school field trips arriving.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BJsxOdyf1vD-i2LFCWm2eg/348s.jpg", "caption": "Aroid House"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0Cj4wJxCfV65DgtRe3E1eA/168s.jpg", "caption": "Horticulture Hall"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AzvDCD74_6nir_nuBXFiZw/168s.jpg", "caption": "Garfield Park Conservatory front"}]}}, {"review": {"des": "Huge green area with little play areas for your kids. You can spend all day just walking their paths! Also has a nice place to grab some lunch. Perfect place to observe nature and a place your kids can run around and expend some energy. I went when the flowers have not bloomed yet but I am sure it is also beautiful.", "pics": null}}, {"review": {"des": "1 word: OBSESSED.<br><br>The place is not huge, took me about 45'-1h to complete all the houses (with ample time for photos!). But, it's got so much to offer. My favorite is the desert house because succulents define my life. Then there's a palm tree house, fern house, koi pond, children-designated house, and sugar from the sun aka fruit tree house! Free parking right outside, and free admission. If you live in Chicago and haven't been to this place, I tell you you're missing out big time! I can only imagine how amazingly beautiful it is in the winter, when everything else is pretty much lifeless outside. <br><br>I went with a friend who knows the city quite well and she said it's not in the best neighborhood. So, I guess it's the only minus.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fVzIc3u3yvKgtFqn35DTYA/168s.jpg", "caption": "Sugar from the sun"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3XA7I9SLKfRPtn3iS7TLIw/168s.jpg", "caption": "More desert house aka my fav"}]}}, {"review": {"des": "Ok, this place is GREEN and HUMID; lotsa fountains and koi fishies and natural sunlight -- it's a great place for pretending you're not in some godforsaken Chicago winter at allll!!!! There's no butterflies unfortunately, though I did hear some birds and hordes of fruit flies. Kinda makes you wonder if this is the sort of ecosystem humanoids once traversed  before urbanization kicked in. (Be prepared to sneeze if you've haven't seen grass and natural things in a while.) PS did I mention this place is FREE? Wow! Definitely not like that evil O'Hare air-selling dude from Horton Hears a Who.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kOnww0FW-Fs-Nz7NemJNYQ/348s.jpg", "caption": "Boop"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VPXQgyd6ZR1VKgk5NV1XbA/168s.jpg", "caption": "So dah fuzzy"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/byDHzYKFWogP5XcOxPsf-w/168s.jpg", "caption": "Lil somethin somethin fo MLK Jr day:)"}]}}, {"review": {"des": "Love Garfield Park Conservatory - definitely a city favorite. It's such a great spot, offering a welcome respite from the long, winter months when sunlight is a distant memory. But simply gorgeous anytime of year. I highly recommend to anyone visiting the area.", "pics": null}}, {"review": {"des": "I've been to this place 3 times in the past year and as a nature lover this is by far the best place to go when I am feeling stressed, and I am wanting to escape the city noise and chaos. This place is also very clean and has an amazing patio with a trail that has a European look to it. Also, the Palm Room is amazing!! They have a small shop but it's not always open.", "pics": null}}, {"review": {"des": "This is a Chicago staple and you must check it out. An amazing destination and a regular one for me in the winter. There are numerous climates in this huge conservatory that houses palms, aroids, a dessert, ferns and much more.", "pics": null}}, {"review": {"des": "Wonderful old glass conservatory. Free parking. Beautiful displays in the fern room. Always changing for special shows. Great place for a short visit.", "pics": null}}, {"review": {"des": "Such a beautiful conservatory that's open everyday. There are new exhibits every season so there's always a reason to visit. Check out their website for community activities (yoga, origami classes, etc.) which are mostly free or have suggested donations. Fyi, it's on the warmer side inside so skip the sweater or jacket.", "pics": null}}, {"review": {"des": "One of the greatest cultural institutions in Chicago. Room after room filled with plants that provide a quiet opportunity to relax and to explore. The Fern Room is the highlight. Imagine my surprise encountering it after walking through the other rooms and assuming I'd finished seeing everything. The Cactus Room is my second favorite. <br><br>It's free and literally right next to the Green Line stop.", "pics": null}}, {"review": {"des": "A great & free getaway close-by. Favorite room is the one with all the desert plants.<br><br>Good place for dates because you can always have a diversion by pointing out a particular plant.<br><br>Good place for breakups because even when the bad news hits, at least there are flowers around.<br><br>Good place to study (yes, actually) because your brain works better when there's a floral scent in the air #alternativefacts.<br><br>Good place to for weddings (you can rent out a section) because women are generally happier with plants around, and happy women means happy men.<br><br>Good place for funerals because plants could always use more fertilizer #greenthumb #deadthumb.", "pics": null}}, {"review": {"des": "This is one of the must-visit places in the city.  In addition, it does NOT cost a dime to enjoy God's botanical creations.  <br><br>On Wednesdays, Garfield Park Conservatory is open until 8pm.  For those who have the usual 9 to 5 work schedule, they can come in here, by car (free parking on Central Park Dr.) or by the El (CTA Green-Central Park/Conservatory Drive stop), to relax and unwind.  <br><br>Make sure that you dress in layers because some of the rooms are warmer and temperature-controlled for these lovely plants and flowers.  There's an unattended coat-check station available by men's restroom.  Use it with your own discretion since they wouldn't be responsible for your expensive Burberry peacoat if you have one.  <br><br>The \"palm tree\" room was the very first exhibit by the entrance.  \"Sippin' gin and juice...laying underneath the palm trees,\" but don't go \"undone\" like what Katy Perry likes to do for her \"California Gurls\" thang.  In fact, bring a light jacket or at least a scarf, because the \"flower room\" next door could be a bit chillier.  <br><br>The smell of freesia was heavenly.  Don't ever trust the artificial floral scent that you can purchase at a Ba#h & B*dy Wor*s location.  There was nothing alike between the two.  <br><br>Then hubby and I moved onto the \"aroid\" room.  By the way, this ain't that \"android\" phone that many of us have because we sort of dislike the i-phone 4, 5, or other integer.  In short, \"aroid\" is a nomenclature used for any plant belonging to the Family Araceae.  It tends to have small flowers.  Nevertheless, a large spathe can be seen surrounding the flower mass.  <br><br>Rosa J. actually did well on the \"botany\" portion of zoology 151 because the professor who taught the course was quite good-looking.  It has been seven (7) years since she graduated from college, so her knowledge of all things botanical remains at the artistic level.  <br><br>Some cool music was playing in the background inside the \"desert room.\"  Some of these plant dudes dressed better than some humans walking on the streets of Chicago.  I was very, very impressed by some of the color coordinations these guys came out with.  <br><br>I saw some children were having great fun at the kids' garden.  Perhaps it's about time to make some children of my own....Rosa J. isn't getting no younger...the \"Eagles\" has already said the same in their 1973 hit, \"Desperado.\"  <br><br>Ok, ok, I don't want to be named \"the queen of off-topic.\"  When hubby and I arrived at the last room of the visit, the \"fern\" garden, it certainly com\"fern\"ed that the scenery here is wedding-picture friendly.  <br><br>I wish I could stay here a bit longer, but my cellular phone needed some juice and I used up the spare power from my Yelp-patterned portable charger.  I do have to admit that the surrounding neighborhood can be sketchy, especially after sundown, even though the conservatory itself is well-maintained and safe.  <br><br>Free parking and steps away from the El should cast your anxiety away!  May the power of the botanical beauties be with you.", "pics": null}}, {"review": {"des": "Impressive. I've gone to Lincoln Park conservatory before but was first time here. So much more extensive. Has neat history from landscape planner Jens Jensen. Currently they have some Cubs stuff celebrating the World Series win. There is a fern room, flowers room, outdoor garden. Chicago truly holds surprising treats.", "pics": null}}, {"review": {"des": "In a word - Amazing. If I lived in Chicago I would come here every day in the winter to unwind and enjoy the warmth and life sprouting up everywhere in this conservatory. I had never thought to go to a botanical garden in the midwest, but my friend had it on her list of things to do in town, so we went. I am so glad we spent this chilly afternoon breathing in the sweet aroma of the flowers in the room with spring florals blooming, and enjoying all the greenery. I was enamored with every inch of this space. <br><br>I could see why so many families brought there kids here - the area set up for children was pretty neat - there were volunteers there doing science-y crafts with the kids and there was a soft spongy area for kids to run around in amongst the foliage. Besides that, the sheer amount of things to see, smell, and read here could entertain a person for weeks. Every time I thought that was the last room with things to see in it, there would be another one to explore. What an exciting place to visit for old and young alike!<br><br>It's hard to believe this place is open to the public for free (with donations recommended!) Do your part and contribute to this marvelous wonder to keep it open! The only negative thing was the restrooms only at the entrance. If you have a small bladder, make sure to go before you head into the park, and don't drink too much water along the way!", "pics": null}}, {"review": {"des": "Small but fun place, well kept up, relaxing and educational. Love coming here just to get away from the hustle and bustle. Don't miss the parrots in the tropical room! I also highly recommend contacting the Conservatory and booking a tour. For a small donation they'll take you through and tell you all about the plants and history of the Conservatory. Well worth your time and money.", "pics": null}}, {"review": {"des": "This was a pleasant surprise! Every room is very well done and it's extremely interesting to see all the different plants up close and personal. The desert room was our favorite. So many cacti and succulents and they are all in prime condition and obviously well taken care of. And \"admission\" is donation based! We gave $10 because we really felt they deserved it and are doing a really great thing here. Very cool!!!<br><br>Educational, kid friendly, well kept, free parking, unique fun", "pics": null}}, {"review": {"des": "What a gem! It has been years, maybe more like decades since I was last here!<br><br>I came for one of their benefit concerts, and wish we had been able to come earlier to enjoy more of the great plants and beautiful facility. 1-1/2 hours is just not enough! Many plants, a lot of good information, some fun (and stinky) plants, and a fantastically helpful staff!<br><br>The staff is what makes this garden in the city so special. The people, at all levels, make you feel welcome here. The front desk, the gift shop, even those tending to the plants all went out of their way to help us find our way, and make sure we had our questions answered.<br><br>Come to Garfield Park, and enjoy a day of new growth and fantastic foliage.", "pics": null}}, {"review": {"des": "This place is a hidden gem. Lots of wonderful plants and it is well maintained. Lovely for a photo shoot such as engagement or just a fun day out. We stumbled upon it on a rainy day and so glad we did.", "pics": null}}, {"review": {"des": "One of the most unbelievable indoor gardens I've ever seen. You could easily wander around for hours without getting bored. Lots of various types of gardens: succulents, tropical, etc.", "pics": null}}, {"review": {"des": "This has been here for over 100 years and it's as good as it's ever been.  My beautiful better half with the green thumb absolutely loved the fern room and every other room was great too.  We'd love to see them develop the out door areas more.  This is a great place to spend a couple hours in this horticultural paradise.  Parking can be a little tricky and the surrounding  neighborhood was clean and safe.", "pics": null}}, {"review": {"des": "After looking for something to do in Chicago where I could also enjoy the outdoors without being surrounded by too many people, I came to the Garfield Park Conservatory. I came around 2pm on a Sunday afternoon. There were other visitors but it wasn't crowded by any means and I felt that I was able to leisurely circle through all of the plant exhibits at my own pace. It was my first time being there and I found it to be educational, as well as beautiful and relaxing. It looks like a great place for kids as well as adults who are looking to have a tranquil, relaxing afternoon.  Will hopefully be going back soon.", "pics": null}}, {"review": {"des": "Garfield Park is impressively huge and extremely beautiful! I would highly recommend giving yourself an hour to explore and make sure you walk outside to the ponds!", "pics": null}}, {"review": {"des": "Garfield Park is great place to spend day with family, friends for many activities hiking, biking or simply just walking, the view is amazing at day and night!", "pics": null}}, {"review": {"des": "Went ere awhile ago, not much interesting stuff very hot and overall just a very poor experience", "pics": null}}, {"review": {"des": "Great place to visit or bring out of town guests. The exhibits are gorgeous and will definitely visit again", "pics": null}}, {"review": {"des": "You just have to bring your parents and your kids here. So beautiful! One of my favorite places in the city.", "pics": null}}, {"review": {"des": "Great spot to visit in Chicago. <br><br>If you're into nature like atmospheres, forest preserves, and Gardens this place is a must. It's great to check out just about anytime of the year. A great place for family photos, engagement pictures.. etc. admission is free. And it's never really crowded.", "pics": null}}, {"review": {"des": "This place is the perfect antidote to long Chicago winters.  Stay warm and walk the grounds in Tshirts while it snowing outside.  Weekend kids activities perfect for 5 year olds.", "pics": null}}, {"review": {"des": "Great spot to lay back explore or even read a book while taken in the fresh air. Free admission free parking what better. Prob one of the relaxing cheap date I've been on. So much to see and reflect on.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/L3mFinKQIjPf5HkaxLiqcA/348s.jpg", "caption": "Day date"}]}}]}