{"name": "gather-chicago", "reviews": [{"review": {"des": "This place is great!  The staff was so welcoming and friendly.  We were seated right away at a shared high top table.  However, the adjacent seats were empty so we were not right next to the other diners.<br><br>I started with the Sleepy Jean - tequila, lemon, mint and soda.  It was so refreshing and a nice combination of flavors - not too sweet.  The mint garnish makes the drink.<br><br>I also had the Arctic Char Salad.  I'm not a big fan of arctic char, but this was prepared so nicely, even I liked it.  I loved the sesame tuile, it added just the right amount of sweetness in the random bite. It was loaded with goodness - avocado, pistachios, eggs and croutons and the dressing was perfect.<br><br>I'd love to go back for dinner.  I highly recommend this place.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zprVtqkhvvFPHYPGA-CVgw/168s.jpg", "caption": "Arctic Char Salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PnVZfnTrJmOFwQIVaU318g/168s.jpg", "caption": "Sleepy Jean"}]}}, {"review": {"des": "As you can see I have been to both Gather and the adjacent Warbler in the past for dinners. Both places have the same owner. I like both places for different reasons. <br><br>My party of three recently returned to Gather two times, once for dinner and then again for brunch. Let me first describe our dinner experience. Gather is a shared plate dinner experience. We started with the kimchi pancake for $12 and the salmon for $13. Then we enjoyed the tartare for $13 and the brussel sprouts for $9. We ended with the uovo ravioli for $11. As you can see from my pics I enjoyed two overnight sensation cocktails for $10 each.  John took care of our table needs. Our total bill was $132 less gratuities.<br><br>Then we returned for my first time here for my party of three for our 11:00am brunch reservation. When we arrived we were seated at the high top table nearest to the front entrance behind the host. The place was packed with customers. <br><br>I started with my bloody mary for $8. I also enjoyed my eggs benedict for $13. My eggs benedict were a bit over cooked. I really prefer a very liquid egg yolk. A side order of bacon is $5. A single scrambled egg is $1.50.<br><br>I ended my brunch with my bellini for $9. A cup of coffee is $4. Our total bill was $92.07 less gratuities. Courtney accommodated our table needs. I will return here again for dinner, brunch or even lunch.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/caxZJE4uhJTRtGl58_UWJg/348s.jpg", "caption": "Brunch menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Yc3fTCd4D9OedNH7Q_PdWg/168s.jpg", "caption": "My eggs Benedict"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gXVEAtT6haZ15e5umWR4SQ/168s.jpg", "caption": "View from my table"}]}}, {"review": {"des": "Probably my fourth time ever going to Gather.  The food was quite good, as it usually is, this time, I was pretty annoyed at the overall service we received.  Reservation was for 8 pm - we showed up at 7:45 and grabbed a drink at the crowded bar.  Around 8:10 was told they were about to clear the table and we would be seated shortly.  Was again told the same thing around 8:20 - just a few more minutes.  Finally, at 8:35 we were seated, not once was I told, I'm sorry we seated you 35 minutes after your reservation.  A sorry would be the minimum I would expect, I feel at most places you would at least be comped a few appetizers or desserts, but nothing from the hostess or from our waitress when seated.<br><br>The restaurant is also a loud, but that's not ownership's fault.<br><br>For appetizers we got the cauliflower, steak tartar, apple salad and gnocchi, with the cauliflower being my favorite.  Main meals the pasta and braised pork, all delicious.  Finished the meal off with the donuts, which were also amazing.  <br><br>All in all, a very mixed experience, the evening never quite recovered from being seated 35 minutes late with no \"I'm sorry\" or a free app or two - that just rubbed me the wrong way.  <br><br>Probably won't be heading back there for a bit.", "pics": null}}, {"review": {"des": "Now that I have been to Gather for both brunch and dinner, I feel like I'm in a much better position to write a review.<br><br>Let's start with brunch. Hands down, this is one of my favorite brunch restaurants in Lincoln Square. The skillet with roasted pork shoulder and a fried egg mixed in a delicious guajillo broth and polenta was probably my favorite. Talk about a flavorful explosion! I highly recommend this dish, but do note it's on the heavy side. Also delicious was the biscuits and gravy. I was a bit skeptical because they use chicken sausage, but it did not compromise flavor at all. The chicken and waffle is also a solid option, as they truly nailed the sweet and savory.<br><br>Dinner was decent, but probably not as impressive as brunch. The shared plates and appetizers were probably the best part of the meal. I could not stop eating the steak tartare. They weren't kidding when they said it was the best in town. The uovo raviolo was just divine. The richness of the ricotta and egg yolk filling mixed with the truffle butter and pancetta was just heaven on a plate. <br><br>Where things fell flat for me were the entrees. I ordered a burger as it was presented as best in the city. Although it wasn't bad, it was a bit dry and flavorless. I truly feel that the patty should standalone in flavor without the condiments. I also tried the gnocchi, which was a bit odd in texture.<br><br>I will definitely return for brunch, and may give dinner a second chance for sure!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rettuEiIgsesAmJwgtc1ZQ/348s.jpg", "caption": "Uovo raviolo"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sHrEplUz3yoqXZn0w4GFxA/168s.jpg", "caption": "Steak tartare"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4F1LGo94yrD2iMlD9ypBXQ/168s.jpg", "caption": "Whipped ricotta"}]}}, {"review": {"des": "We had a great time at this really great little restaurant. It's in a cool neighborhood and they use the space very well. <br><br>We came with locals who recommended <br> the house made whipped ricotta for the appetizer and it did not disappoint. <br><br>I had the steak tartare for my entree on house made brioche toast and it was perfect. <br><br>We finished with the strawberry rhubarb and s'mores desserts and they were both incredibly. <br><br>HIGHLY RECOMMENDED!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/n-n8lO6paNDTJ6AUqvGhRg/348s.jpg", "caption": "A perfect steak tartare..."}]}}, {"review": {"des": "Gathering all my thoughts right now to this place... and there was only one word to describe it - GRATIFYING. We went there for dinner and the experience was impressive. The space was small but tables are strategically set up to allow good traffic. They have open kitchen with bar where you can sit and watch how the cooks are preparing food. <br>I personally loved their gather board ( cheese and salumi ) with a pairing of wine. Their tomato appetizer was also refreshing. I know its dinner but i was craving for burger that time and it was one of the best in the city. Fries were housemade too. Service is fantastic except for the runner/busser i guess, we were sorry but we had hard time to understand what he's saying, but he looks like a good worker. <br>We will come back and try BRUNCH.", "pics": null}}, {"review": {"des": "You have to order the Skillet!  Our local friends had been dying to try this spot for a while so we were glad to make it with them when we were in town! <br><br>Adorable atmosphere with a long indoor dining setup (some large tables for groups) and a fabulous, covered outdoor area. We sat outside and the service was fast and friendly. <br><br>The menu had some delicious looking options. I usually go for the eggs Benedict for a breakfast choice but something was pulling me to the skillet. My meal had puréed black beans, tortilla chips, a fried egg, and braised pork shoulder. Absolutely to die for. <br><br>Or table also ordered the lox bagel and the biscuits and gravy, I tried both of them and everything was delish! We will definitely be back next time we are in town!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GzhehO7hbMmPY7pkgVwXgg/168s.jpg", "caption": "The skillet.... to die for!!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_9Xau35oGsOJgqshlwxzxg/168s.jpg", "caption": "Bagel & lox"}]}}, {"review": {"des": "Been here for a wine night but came back to try there brunch. Mmmmmmmm.... it was so good! I've walked past by many Sundays and have seen this place always PACKED(!) and I see why. It was good. Their menu is limited but I found what I've loved- the skillet that isn't very traditional, and my dining mate loved the chicken & waffles. <br><br>The skillet- made with creamy polenta, blistered tomato salsa, jalapeño crema, and pepper jack cheese at the bottom topped with roasted pork shoulder, guajillo chili broth, and crispy tortilla; it was so darn good! Never had a skillet of this kind. And let's just say I finished all of it. Every single bite of it. <br><br>The chicken & waffles was interesting. It's my 2nd one I've tried in life so I don't have much to compare it with. It had a nice blend of waffles & berries and savory taste of fried chicken. It was quite tasty and might get it the next time. <br><br>The breakfast sausage & toast was pretty good. Breakfast sausage was a little on the sweet side thanks to maple syrup. I loved the whipped butter on the toast; I think I had raspberry jam and was too sour for my taste. The toast itself, mm perfect! <br><br>The fries- just do yourself a favor and don't get it. It was not crispy at all. It's a small potato that has been crushed down(?) and deep fried. To my disappointment, it was very soggy- waste of $3.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XYjtUg2TYrdzNynf_okrYw/348s.jpg", "caption": "Initial setup for brunch June 2018"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/o_vDiTw7EKn7cVKjUBnf7A/168s.jpg", "caption": "Menu June 2018"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OjS62ZASa4buh3_uspzt8A/168s.jpg", "caption": "Menu June 2018"}]}}, {"review": {"des": "Phenomenal experience from start to finish. This was our first time at Gather and we can't wait to go back. The service was impeccable. The food was exquisite. We shared the whipped ricotta, brussel sprouts, and gnocchi - all perfect blends of tastes and textures. Our favorite, however, was the raviolo. Divine!!! Every subsequent thing we had was better than the last. You must go!", "pics": null}}, {"review": {"des": "Came in on a Sunday with my friend. Ambience was gorgeous. Immediately sat at the bar and had the most pleasant dining experience with our \"alchemist\" Michael. Best service in Chicago, hands down. My drink (which he prepared upon hearing me whisper to my friend) was handed to me as soon as I asked for it! Great conversation. Great food. Not invasive but super friendly. Shoutout to Michael. Thanks for making my visit to Chicago and to Gather complete. Also, great suggestions on the plates and the most amazing hand crafted cocktails for me and my compatriot.<br>5 stars well earned and mainly because of our amazing bartender!<br><br>Ladies, we found out he's single and the best. .", "pics": null}}, {"review": {"des": "Grabbed a delicious brunch on a Saturday from this place! Everything in the menu looked really good, unfortunately most of the items contained pork so we couldn't order it ( I was going to order chicken waffle but had pork belly)<br><br>This place opens at 10am for brunch and by 10:20 the place was full so reservation is highly recommended. We went for the beef hash and the soft scramble with fruit on the side. Although both main dishes were good we liked the soft scramble more given it had more rich flavor. Maybe it's due to the grilled chicken or the buttery toast but my wife and I liked the soft scramble over the beef hash. The beef hash was also really good. The side fruit cake with a honey dipping sauce which was a neat idea.<br><br>Finally for dessert (off course) we went for the doughnut and the French toast. Both were good but the French toast had more thing going for it (maybe because it's a main dish and not a side) <br><br>Overall great restaurant. Would love to see a chocolate dessert in their menu whether a french toast, pancakes or waffles.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/moZVJIZiZoT0QkkBHQqyBg/348s.jpg", "caption": "Soft scramble"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/V0oImTaV_R2h_yueq6JIfA/168s.jpg", "caption": "Doughnut"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qRzGLNqu1SrJjUllEf6xfQ/168s.jpg", "caption": "Fruits"}]}}, {"review": {"des": "Gather is still my #1 favorite brunch spot in the city years later. <br><br>I absolutely love the feel of the restaurant. Between decoration, service and overall ambiance, it's so cozy and familial that you can't help but to sit back and relax. The owner is amazing, and really takes pride in running his restaurant and maintaining clientele. <br><br>The menu is constantly rotating, which keeps things fresh and exciting. French toast changes from blueberry to apple to raspberry, while chicken & waffles transitions from matcha to Parmesan to sesame. These subtle tweaks make the classics that much better than every other brunch spot. <br><br>I've also been for dinner and have loved, loved, LOVED their cocktails, as well as whatever their current burrata and Brussels sprouts dishes are. You really can't go wrong with anything here. <br><br>This place is my jam. I'll be back a million times more :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WrpA-YxbEjSegAjxFFHlXA/348s.jpg", "caption": "Corned beef hash with Brussels, potatoes, pea purée and fried eggs"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RTaM9Oaxhb-IPrqLw5zAgQ/168s.jpg", "caption": "Raspberry french toast... SO GOOD"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/psVDapN59_e9_C6vx5ft7g/168s.jpg", "caption": "Blood orange mimosa & house bloody"}]}}, {"review": {"des": "Great food and amazing service. The crispy Brussels sprouts were incredibly effective as cheese and pistachio delivery devices with just the right amount of cream, crunch and flavor. The bonito flakes and miso vinaigrette gave it some nice unami notes. After a slight mishap, my chicken dinner was also quite delicious. Again, a knack for textures and flavors. The only thing I can say is the mushrooms were quite scarce. <br><br>The chocolate custard was the grand finale. Wow this was an incredible desert plated thoughtfully and with so many thoughtful touches from the salty sugar glass to the whipped hazelnut cream. I will always have to save room for desert here! <br><br>Next time I will do the sea scallops and ravioli and the Brussels sprouts. am thrilled that Gather sources food locally when possible and that the staff here are so aware and invested in the experience that their guests are having. <br><br>I am even happier that I don't even have to leave my neighborhood to visit Gather.", "pics": null}}, {"review": {"des": "Our meal here Thursday was perfection. The outdoor seating was charming and comfortable, if a little loud, and the service was excellent.<br><br>We started with cocktails, the Count and the Overnight Sensation. The Count was light, refreshing, and delicious. The Overnight Sensation was good as well but a little sweeter than expected. It seems like more juice than alcohol.<br><br>Next came what would prove to be the highlight of the evening and something we both wanted to have again for dessert or order extra to take home: the cauliflower. It was perfectly cooked, delicately fried, and tossed with an amazing sauce. There was nothing about the dish that we did not love. We also had the brussel sprouts, which were excellent, and the whipped ricotta, which was very light and a nice contrast to the more savory vegetables. As an entree I had the tagliatelle, which was good but still not as good as a cauliflower. My dining companion had the steak tartare as an entree, which was also delicious. <br><br>Another win for gather!", "pics": null}}, {"review": {"des": "Came here on a Saturday during peak brunch hours around 11:30 am with my friend. We took a risk and didn't call ahead, but after we put our name on a list, we didn't have to wait longer than 10 minutes for a table -- even though it was very nice outside and such a busy time. Please know that I'm aware this is probably an anomaly, because this place is so awesome and in such a lovely neighborhood! Still, I was very happy with this because I had already begun looking at the menu and my mouth was watering. <br><br>Because I'm a sucker for a good Benedict, that's what I was interested in, and was thrilled to see their house Benny is already topped off with irish bacon AND bacon bits. My kind of place! My friend and I also split two pitchers of blood orange mimosas as well, because that was their flavor of the day. Listen, I ~already~ love mimosas, but I had never tasted anything blood orange in my life. My trip to Gather opened my eyes to the magic that is blood orange-flavored drinks, and this mimosa paired perfectly with my Benedict, both taste-wise and aesthetically... and who doesn't love an aesthetically-pleasing meal?! <br><br>The prices weren't bad either, especially since brunch can tend to run a little bit on the pricier side -- I think we both ended up paying ~30 + tip after splitting the mimosa pitcher prices. <br><br>I really enjoyed my brunch experience at Gather, and am eager to come back again, mostly because I have not seen a blood orange mimosa on a menu anywhere else, and because I have been thinking about other items on the menu that I didn't get a chance to try, like their biscuits and gravy or salmon. <br><br>Gather is a lovely brunch spot and I highly recommend it to anyone visiting the Lakeview area!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jfj-1hYOHB9JK7hyYOP8wA/348s.jpg", "caption": "Eggs Benedict + Blood orange mimosa. Droooool"}]}}, {"review": {"des": "Made reservations for fiance's 30th bday. Had a lovely dinner seated at their outdoor patio. Enjoyed everything except their burger ($14), which was a pass. Would recommend their uovo raviolo ($11) over their pasta ($17) if you're craving rich & creamy carbs. Friendly service from our waitress. We were full so didn't order dessert; waitress said when bringing the check that the dessert would've come out with a candle. We like trying new-to-us places so I'm glad that we finally checked out this neighborhood restaurant.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/y2lXjxZtQzanm712-5y-Mg/348s.jpg", "caption": "Delish"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Xu4WO4L0lirZG0Tx2xOv8A/168s.jpg", "caption": "Cocktails"}]}}, {"review": {"des": "I love this place. Me and my main man waited until the brunch crowd dispersed and arrives around 1pm. The host was so kind and welcoming. Server was great. I suggest you get the donut. It's amazing. The gravy for the biscuits and gravy was PERFECT (and I don't mean that figuratively). It. Is. Perfect. Dishes seem large enough for two and the leftovers hold up well. So, if you want to impress someone or give yourself the brunch you know you deserve, definitely go to Gather.", "pics": null}}, {"review": {"des": "YUM. This place was amazing! <br><br>We started with the whipped ricotta, which came with generous piecces of toasted bread. The ricotta itself came in a little jar with honey and balsamic over it; perfect bread texture with  smooth, sweet ricotta mixture. <br><br>We then got the brussel sprouts - I haven't had brussel sprouts in a while since I was getting kind of sick of them (felt like literally every single \"new  American\" restaurant has them, which they do), but I really liked these because of the bonito flakes on them as well as what tasted like kewpie mayo (not sure though - I might've just thought that because of the bonito flakes and my association of the bonito / kewpie combo with takoyaki!). <br><br>The uovo raviolo was incredible. It was one giant piece of incredible in a yellow white truffle sauce with pancetta, with egg yolk on it as well as cheese inside. If it sounds incredibly rich and heavy, this is because it is, but it was probably my favorite dish of the night - and one raviolo split between two people was the perfect amount for our meal. <br><br>Could've stopped there but we acutally had a fourth dish coming, which was the pork tenderloin. They split the dish in two for us, which was really nice; the sauces, flavors, vegetables, garnishes - all delicious. The pork was nice and tender, with the pork belly crunchy on the outside. <br><br>We had a great seat by the window. Overall, such a great dining experience!", "pics": null}}, {"review": {"des": "Brussel sprouts, raviolo, and hamburger  <br>Everything was so delicious. All the plates around us looked just as good. I don't think you can go wrong here, what really stands out is the service! I know this is a hot new place on the Chicago food scene... don't be the last to know.", "pics": null}}, {"review": {"des": "Great meal but VERY LOUD and dark. We were also sat in an area that was quite cramped for four larger tables. I brought my family for a post-thanksgiving Black Friday meal and people were upset at how dark and loud it was. I had homemade pasta that was delicious! But our charcuterie platter was odd. Weird meats. Overall the Food was good for dinner but brunch was MUCH better. Love the manager and staff. Prefer Warbler for dinner!", "pics": null}}, {"review": {"des": "I highly recommend Gather for a lovely meal. The service, vibe, and decor of this place is amazing. Everything feels very home-y and organized. I've had dinner here twice and each time was a fantastic experience. This is a great place for a nice family dinner or a romantic date spot!<br><br>This is a farm to table restaurant that makes everything to order so you know that everything here is made fresh. You make all of your menu selections at the beginning and the wait staff make careful measures to space out all of your dishes in the best order. All the dishes have such a unique taste and great fusion elements to it.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ue8ININ6Mc_zV-QSCuRRLw/348s.jpg", "caption": "Steak tartare ($13)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ahxSaEPoJTCO-79fFaAEwA/168s.jpg", "caption": "eggplant dish"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Lx_Uwisx3n8r0Od-5KbhnQ/168s.jpg", "caption": "Crispy Brussel Sprouts ($9)"}]}}, {"review": {"des": "For comparison or similarities, there is another review written on or around (10/5/2017) that is similar to mine. I figure she ate at the restaurant a few hours before my party got there. Surprising that we both experienced similar situations. <br>Surfing reviews, what was discussed at the table that night is confirmed. At the restaurant when placing an order, it is requested that all orders be made in one session. Starters, shared plates and final course. This, so that they can pace your meal. Plus you must account for & give consideration because their kitchen is minuscule. The pacing process can be  annoying.<br><br>IF I never had dinner here, I'd say Gather is worthy of 5 stars. I love their brunch game. I love their ability to entice and their smart, sexy space. I love that it invokes a feeling to gather with friends, a date, family, etc that you want to interact with. This is not the place to sit across your group and surf smart phones. Rather, order some plates, share them plates, talk & enjoy food and libations. <br><br>However..<br>Dinner service the other night sucked balls. It effing draaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa­aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa­aaaaagged and killed any hopes of it being a great night. Our waiter was fine. It was the food coming from the kitchen that took its own sweet time. As I downed my second Whiskey smash I wondered how much more water I could drink and whether or not they were actually using whiskey at all in these drinks. That and the wonder, how much longer they could drag our dinner. The drinks looked pretty. With a big, square ice cube and leaf of basil. First sip tasty although not a strong pour. <br><br>I don't like rushing a waiter but it wasn't until mentioning to him that I would certainly leave to Taco-in-a-Bag if dinner didn't arrive soon, that someone from management stopped by to apologize for the long wait. We were told our plates were being fired up in the kitchen. I suppose if I were with a different 3-some with lots to discuss while imbibing drinks the time would have been more bearable. But we're talking 20 minutes for starters and then an additional 45 for main course. Sure as shit we did not care to look at their desserts menu. Which pains me.. because I have had many, many great experiences having brunch here.<br><br>Since the above dinner, I have only returned for brunch. Their brunch-game is killer. But time is too precious to be forced a wait for that next plate. (Heavier pours could help..)", "pics": null}}, {"review": {"des": "Gather is so good. The food has unique flavor, the service is very attentive and the ambiance is great. What's just as good is the parking in Lincoln Square is still very affordable (unlike other parts of the city)!<br><br>I ordered the chicken (2 ways) with the polenta - so delish! We also had the ravioli -truffle came through, but might've needed a bit more flavor in addition to that. Overall great meal.", "pics": null}}, {"review": {"des": "A little bit out of the way from the hustle and bustle of the city... but a MUST visit if you are anywhere in the area (or even if you're an hour away....). <br><br>The staff here is superb, super professional, friendly and helpful. I brought my family here for a brunch after a run we had near Montrose harbor. It was nice out, so we decided to take a seat on the back patio. It is beautiful out there! The lights, the greenery, and the table set-ups, all make for an amazing, relaxed but refreshing ambiance. To start, we ordered the blackberry donut and sticky bun to share. Both were great, and freshly made. For my entrée, I ordered the Short Rib Hash. This dish was incredible, but unfortunately for me, not enough food. The serving was extremely small, and I was still hungry after I was finished. <br><br>Overall, I will plan on making another trip back up to Lincoln Square to try more items (maybe make a trip for dinner?). I recommend definitely stopping in and try some items for yourself!", "pics": null}}, {"review": {"des": "Glorious Sunday brunch at Gather. And they take reservations (strongly recommended)! We came after the Ravenswood 5k so this ended up being clutch since there was a big line before it even opened at 10.<br>Our experience was pretty seamless from the moment we walked in - we were seated immediately, service was friendly and attentive, food came out quickly, and of course everything was delicious. <br>My friend and I started with coffee, which was very good and much needed but it's worth noting they don't have espresso type coffee drinks (like lattes). They do have cocktails though, and it's on my agenda next time to try their mimosas! <br>For food, we decided to share the toast, which comes with jam that's made in-house. Then for the main course I ordered the skillet and my friend ordered the egg + farro. We both pretty much licked our plates clean. Simply delectable. I thought overall the portion size was well balanced with quality, and offered at reasonable prices. I just wish I lived nearby so I  could visit more often!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oviKheAwaQFYADvflk68Ng/348s.jpg", "caption": "They have a back room/area"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ra3osAowYM-v7MaWX7iDVw/168s.jpg", "caption": "Egg + Farro brunch dish"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/g4TjCGrNPzc7O7lTFanUTw/168s.jpg", "caption": "Skillet was perfection"}]}}, {"review": {"des": "Always consistently amazing food and great service, we dine here almost monthly, never a disappointment, I do hope they bring back chicken liver mousse though.", "pics": null}}, {"review": {"des": "Such a disappointing evening overall. I'm sad to write this review. <br><br>We were so excited to come here as my best friend has celiac. They told me via Facebook that they had lots of gluten free options. When we arrived we promptly got our drinks but then waited about 10 minutes for our server to come back. My friend got someone's attention-- I think she was a floor manager based on her attire compared to the server. She knew the menu inside and out and helped us order to accommodate my friends allergy. We were happy as we placed our order for appetizers and entrees. <br><br>Our appetizers came out at a reasonable pace, with  a little time in between. The unfortunate part was that we then waited over an hour for our entrees. We watched the tables next to us, including a party of five, pay their check and go. We saw a table who arrived after us get their entrees. My friend again got someone's attention and we were served our ice cold entrees at 9:45. We arrived at 7:30. Nobody said a word to us regarding the delay. If we hadn't asked about our entrees I kind of wonder if we would have ever gotten them?<br><br>I am in the service industry and understand that things happen especially on a busy Thursday night, but it's all about how you handle it. To leave us waiting that long is not what I'd expect from a restaurant like this. <br><br>When our server asked us if we wanted dessert, we said no. We were entirely done by this point. She rolled her eyes-- again, I get the feeling but you should probably make sure we can't see. I guess the nearly $300 we spent wasn't enough for her to like us? <br><br>I emailed the same Facebook account about my concerns as the whole experience left a bad taste in my mouth. There's no email address on their site so I thought maybe management used the Facebook but told that it wasn't run by managers. They were apologetic but nobody higher up has contacted me to apologize. <br><br>Everyone seems to love this place but I guess I'm in the minority. The food was decent but at the price point I would expect a better experience overall. It wasn't good enough to warrant nearly a three hour meal. And I'm very disappointed that nobody apologized for the fact that we were clearly forgotten about. Two stars for the knowledgeable floor manager and the nice wine list. Very unlikely we will return.", "pics": null}}, {"review": {"des": "I moved to the neighborhood Summer of 2017 and have become somewhat of a regular patron.  My favorite dish on the menu is, by far, the Brussels sprouts and just about every cocktail I've had has been good to outstanding.  <br><br>The service of hosts, wait staff, and bartenders is always top notch.  Reservations seem to fill up quickly at peak times, so plan ahead.", "pics": null}}, {"review": {"des": "4 and a half stars.<br>Really liked the place , staff was excellent. <br>Dish break down :<br>Whipped ricotta with baguette 10/10<br>Crispy cauliflower 9/10<br>Baby carrots 3/10 , too many things going on with this dish, lose the almond brittle please. <br>Spaghetti 9/10 , Wife loved this. <br><br>Will go back especially if menu rotates.", "pics": null}}, {"review": {"des": "I had their Sunday $26 family style service.   Service was good, had a nice table.   Food was plentiful but a little heavy on starch/carbs and light on the protein.  I thought the service was pretty good", "pics": null}}, {"review": {"des": "Holy guacamole they have really good biscuits and gravy. Came here hungover for brunch and that's a time in my life that I need some good nourishment and I got it! I ordered the chicken and waffles which were very very tasty with this creamy sauce of goodness drizzled on them. My friend got the aforementioned biscuits and gravy and wowza. Hardy food that will surely not disappoint you for brunch.", "pics": null}}, {"review": {"des": "I came here twice over the course of one month. After the first visit, I would have given 4 stars, easy. Cocktails were good, food was solid (especially dessert), the atmosphere was nice, and the service was fantastic (Rachel and Sarah rock!). The second visit started out feeling like 5 stars, until the burger arrived.<br><br>Their burger had been highly touted by everyone I encountered who works here. Apparently it is on a list for best burgers in the city as well (I'm leery when it comes to lists of this kind though). Anyway, the positives of the burger were that it was served piping hot, the bun was light and fluffy, the burger to bun ratio wasn't exceptional, but it wasn't bad either, the patty itself had the right kind of consistency, it wasn't over worked, and there was a nice meaty flavor going on. Where the burger fell off a cliff however was in how the roasted red pepper aioli was no where to be found/tasted, the caramelized onions made a very brief appearance, and worst of all, and I mean absolutely the worst of all, was that the burger was way over cooked and was super dry. I ordered it medium rare and I don't know how they managed to make the center of the burger look medium rare and once you got two millimeters past that it was a desert. While eating it, I needed to drink a ton of water to help it go down without scratching my throat. The very little bit of bacon that was on it was good too, but there was barely any of it. The fries were just ok.<br><br>It's rare after a meal that I feel it was a complete waste of money and stomach space. Sadly I felt this way after eating their burger and wished I'd gotten something else instead.<br><br>Will I return to Gather at some point? Possibly, but that burger left a mark and not a good one.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/S4Tsc84oPrPvbVxTJsY05A/348s.jpg", "caption": "Chocolate peanut butter brownie with roasted peanuts, peanut butter crumble, dark chocolate sauce, and roasted banana ice cream - Delicious!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BhKfiF18mocvF9L9rOTm9Q/168s.jpg", "caption": "Manhattan"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EatA2XYNRblc2h3bGZ4mCQ/168s.jpg", "caption": "Sad burger"}]}}, {"review": {"des": "I attended a small get together in their private back room this weekend and loved the ambiance/music.  They also have a nice back patio, but way too cold out for that!  The menu was rather small, but there was something for everyone.  My favorite was the sticky bun.  I also recommend the bloody mary- very spicy!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fY9-MjrUZGYNVMU8wkjd2g/348s.jpg", "caption": "Sticky bun!"}]}}, {"review": {"des": "Neighborhood gem. City treasure..so many other nouns that could be used to categorize this place. The Gather can make for an intimate dinner or a group dinner.<br><br>The food is solid. I don't think there is a dish on the dinner menu you could go wrong with. It the perfect portion and overall the flavors are balanced and rich. As far as desserts, i highly recommend you try the apple fritters. They are incredibly rich and the ultimate guilty pleasure. <br><br>The bartenders are fantastic. and they are up to the challenge on anything you want to drink. <br><br>Overall the service was great and the staff was very nice. DEFFFFINITELY coming back here. I heard there's a patio that popping during summer.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cNrcG0AN1an3hSu6wJAuHQ/348s.jpg", "caption": "Apple Fritters so good I added 2 second pic!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nSX0w0MOZovfhlwjZQtISQ/168s.jpg", "caption": "Apple Fritters."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oLzT3DpHSmwSHnD5j56-KQ/168s.jpg", "caption": "Chicken Spaghetti"}]}}, {"review": {"des": "This place is one of our favorite neighborhood restaurants. The food is fresh, seasonal, and delicious. Bring your friends or your fam for the Sunday dinner, served family-style with your choice of three entrees and plenty of sides and sticky buns which, let's be honest, could be a little stickier.<br><br>Weather permitting (who am I kidding, THIS. IS. CHICAGO.) sit out back on the patio! It's mostly enclosed by a vine-overgrown pergola in the summer and fall. On the off chance that it's the other 9 months of the year where you can't be outside for fear of frostbite, their indoor space is small but pretty with a charming bar and an open kitchen.<br><br>My only beefs are the underwhelming winter menu (or is it my lack of enthusiasm for root vegetables?) and the SPACE between the tables inside... like sorry to that couple whose side dish my booty probably brushed as I tried to scoot past into the booth!! More elbow room please, or pull out the table for the guest upon seating. :)<br><br>Next up... trying brunch here!", "pics": null}}, {"review": {"des": "3 visits to Gather have led me to believe this place is empirically excellent. The staff has been consistency kind, attentive and passionate about their food. For me the must eat dish is the Raviolo. Outstanding burger but be sure to split it with someone so you can enjoy the rotating menu. If the fried rice is \"in season\" I would not pass it up. P.S. Seems like they've put some time into the wine menu. If you're looking for red by the glass I think the Super Tuscan is the best value. Bold and smooth without too much acidity.", "pics": null}}, {"review": {"des": "What a great place! Great, attentive service and good food!i had the chicken pasta- flavorful chicken thigh chopped into house made<br>Pasta and mild chili sauce. The chocolate mousse with hazlenut brittle was amazing.", "pics": null}}, {"review": {"des": "One of my favorite brunch spots in Chicago. The food is so delicious and made with quality ingredients. Would recommend making a reservation on the weekends as it gets quite busy. Will definitely be back. <br><br>Oh, and do not forget to try the sticky buns!", "pics": null}}, {"review": {"des": "One of the most spectacular dinners we have had in a long time in an illustrious food city. The ambiance, the attentive but not intrusive wait staff and the absolutely phenomenal meal. Standouts include the rye gnocchi, crispy cauliflower, raviolo and pork shoulder. Most meals have a dish that gets lost in the wash but across 10 dishes we were having active debates about which was the best. Absolutely wonderful experience.", "pics": null}}, {"review": {"des": "We came for brunch on a Saturday. We booked a table in advance, which seemed necessary, as the place was packed. <br><br>Food was good, fresh ingredients, and cooked well. We had the Arctic Char Salad and the Soft Scramble. The fish was very delicious but the eggs were a little too heavy.", "pics": null}}, {"review": {"des": "Loved It!<br>Gather was on point!<br>Food was amazing! <br>Loved- Brussel sprouts, Salad, Ricotta, and everything we ordered!<br>Brussel sprouts coz we ate it as soon as it came! it smelled so good Service was awesome - friendly and really nice people<br>I accidentally left my wallet and the guy chase us down the street to give it back! I didn't get his name but he is such a sweetheart! Thank you so much!!!", "pics": null}}, {"review": {"des": "Amazing food, even better service and ambiance! The Brussel sprouts and scallops were perfect!", "pics": null}}, {"review": {"des": "I had heard Gather was an excellent restaurant and had really high expectations, but was overall disappointed. The drinks were quite small and food was just okay. We ordered Brussels sprouts and whipped ricotta to start. The sauce was the only thing going for the Brussels sprouts and was only on the top few, the rest were dry and nothing special. Ricotta was great but also very large and overly filling. For entrees we had hamburger, spaghetti and pork shoulder. Hamburger and spaghetti were good. Pork was just okay at best, the rutabaga underneath was charred to the point where it was unrecognizable--just burnt bits. Service was good, attentive server and good atmosphere, but overall experience was just okay.", "pics": null}}, {"review": {"des": "Deeeeeeeelicious! It's a neighborhood gem. We were looking for a place for brunch, the wait wasn't very long. Surprisingly tasty. My family and I sat in front of their open kitchen. We enjoyed watching the chefs in action. They took time to talk with us and share their recommendations. It was a bit tight for the 4 of us, but seeing their kitchen crew in action was worth the sacrifice of space. My husband said, \"It's like watching the foodnetwork live!\" <br><br>Drinks were delicious, alcoholic and non alcoholic beverages were on point. Dishes were tasty. Their portions were fair and filling. Staff was very attentive. Prices were fair as well. We had the chicken and waffles, eggs Benedict, steak and eggs, sticky bun, side of bacon, 2 strawberry lemonades and 2 bourbon cocktails (I forgot the name of it, it was at the top of their list) came up to about $115. Not bad for the food, service, ambiance and overall experience. <br><br>I'd go back, perhaps to try their dinner menu next time.", "pics": null}}, {"review": {"des": "I've been coming to Gather since they opened, but even more regularly since I moved to the neighborhood. I've been for both dinner and brunch many times, and I've never had a bad experience. The food and drinks are always on point, and the team at Gather is always appropriately attentive and pleasant, no matter how busy the place is.<br><br>I often take myself here for solo dates because sometimes a girl just wants to quietly relax and enjoy nice things without needing a reason. I recommend trying to get a seat at the bar or kitchen counter and simply watching how smoothly the staff work together. They are truly a well-oiled machine, particularly the chefs who create so many delicious things with such detail in a surprisingly small kitchen. They move around screaming hot pans and open flames in a enviable way and make their jobs look effortless. I've also chatted with several bartenders who have all been lovely - one of whom gave me a leftover sip of a bourbon cocktail left in the shaker. I typically hate anything remotely whiskey-ish, but I was wowed at how delicious and balanced it was. It really seems like everyone truly Ioves working there and wants every diner to have a great experience.<br><br>For brunch, the skillet and seasonal omelets are always great...but maybe make some room for the doughnut. It changes regularly, and it always perfectly tender and not over sweet. I've never been disappointed in any flavor, but I selfishly hope they might make the lemon-blueberry doughnut I had last summer a staple. *fingers crossed*<br><br>For dinner...I can't really pick a favorite dish, but their burger is the best I've found in Chicago. I recently had a craving for one and popped in because I knew nothing else would suffice. They were also really understanding that I can no longer eat potatoes (*sad face*) and offered to sub out crudités instead of fries. I actually prefer to eat veggie-heavy food most of the time, and they don't disappoint with the Brussels sprouts, seasonal salads, or other veggie offerings, either. (Side note: their sister restaurant Warbler tends to be more veg-focused, and I've never had a bad meal there, either.)<br><br>TL;DR - come to eat and drink, stay for the atmosphere, and don't miss the magic of watching the team seamlessly serve up the best food in Lincoln Square.", "pics": null}}, {"review": {"des": "Cute. Gather is cute AF. Its like better homes and gardens exploded all over Lincolin Square.<br>But seriously Ken Carter is a severely under rated chef. And for the amount of quality indulgence you get for the price tag its hard to beat. Go safe, get the burger and any old fare you tired a million times, or get wierd (but never too wierd) the food is never out there but you can see subtle hints and ques from the wider culinary trends here. Its nothing that Vettel will prattel on about, but thats because he is a fat old man who is out of touch with anything you or I care about when we just want to go grab some good food.<br>Get the salmon. Just do it. <br>Bottom line, Gather is a people pleaser. They got wine/ solid cocktails, they got somthing new, and they got your boring aunts May's chicken dish (actually get the chicken though its on point). Plus its cute AF. Cute AF!", "pics": null}}, {"review": {"des": "This is by far the finest restaurant in the Square. Innovative, but non prententious food, and incredibly knowledgeable servers. If you haven't stopped in yet you're missing an absolute gem on the north side!", "pics": null}}, {"review": {"des": "Perfect spot. Food was great!  Best meal we've had in Chicago. Special shout out to John and Wesley. They made dining at the bar far more enjoyable!!!!!  Get the ricotta, the Brussel sprouts, the meat and cheese boardt, and the chicken. So so good.", "pics": null}}, {"review": {"des": "I had such a good experience here. <br><br>The staff was wonderful. I'm not sure if they were on a rotation, but there were 3 people helping us today. Someone who wasn't our server even ordered us breakfast sausage because we forgot to order it before our food came. <br><br>Speaking of the food, it was awesome! It came out super fast, which is crazy because there were tons of people inside, and the kitchen is actually very small. <br><br>I came with my sister and her husband and between the three of us we had the salted caramel doughnut (which I wish I photographed before), the eggs Benedict, chicken and waffles, and the brioche French toast. <br><br>The Benedict smelled like truffle oil, but the taste was super well balanced. And the presentation was beautiful!!! <br><br>The chicken and waffles was cute because the chicken was in a ball shape. The onion purée was a brilliant idea, and it went very well with the chicken. <br><br>The brioche French toast was to die for. It was fluffy, which was a nice surprise because at some places it comes out very dense. This was the perfect balance. The granola and apples on top added some extra texture that was to die for. The Benedict and the French toast were my favorites!!<br><br>The staff is awesome, and they anticipated our every need, sometimes before we even noticed. Actually we had a shared plate and someone came by and switched out our utensils and shared plates so the flavors didn't mix. <br><br>They clearly care about their establishment and I'll definitely be back!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vd1chKokqgR4pRIXX9Wifw/348s.jpg", "caption": "Benedict"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3GyhRp-eOIZp5TCvF-drvw/168s.jpg", "caption": "Brioche French Toast"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2mLcMx7qOorczRdVArOBEg/168s.jpg", "caption": "Chicken + Waffle"}]}}, {"review": {"des": "This place is simply divine.  We came here for brunch and made a beeline to the bar where we were instantly greeted by the most phenomenal bartender, Michael.  Honestly, I've never had drinks so good.  His service and attentiveness (and cocktail suggestions) really took my experience at this restaurant to another level!   <br><br>Sn: the pancakes here are probably the best in Chicago, you'll certainly want to give them a try.", "pics": null}}, {"review": {"des": "We recently visited friends in Lincoln Square and tried dinner at Gather. The food - amazing. The Uni Raviolo (one per serving & I wish I had 3 they were so tasty), stake wing and burger were all phenomenal. The service - poor. Our server was uninterested when asked to explain the menu and once the food was served, didn't check in once until he brought around dessert menus. I actually think he mocked us at one point when we asked to explain a few of the dishes. Overall, the food made the experience but I wont be eager to come back due to the service.", "pics": null}}, {"review": {"des": "Made a reservation for 1p weekend brunch and wasn't seated until 1:25p, which was disappointing and cut into our meal time since we had a hard stop to end.<br><br>Good food & drink tho!", "pics": null}}, {"review": {"des": "We went here last Thursday for dinner with our friends. I cannot begin to express just how delicious the food here was. Wow! We got a little bit of everything, from the gnocci, to brussle sprouts (these things are like crack!!) to the scallops (very large, and amazing!) Also, the atmosphere on their back patio area was fantastic, especially with it being a bit of a cooler night, the overhead heat lamps were very much appreciated.  We will definitely be coming back here.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/neD8MS5oxF0Fd7zQHf3G2A/348s.jpg", "caption": "Ao delicious!!"}]}}, {"review": {"des": "This place is AHHHMAZING. I went for Sunday dinner with a couple of my friends who constantly rave about the food here. For roughly 26-27 dollars you get an allotted amount of food based on the number of people you come with, with your pick of 3 entrees and sticky buns for dessert. We got the roast beef, the pasta (to DIE FOR, soooo worth it), and an apple salad. I would highly recommend the roast beef (which has the best stuffing) and pasta. The salad was also very delicious, but I might try something else next time like the flatbread. <br><br>Service was impeccable, and the ambiance was super chic. Would highly recommend.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/m7igD08zv2LwnTSASdoRug/348s.jpg", "caption": "Sunday dinner. Pasta and roast beef!"}]}}, {"review": {"des": "I rarely give 5 stars to any place, but I really have no criticisms of Gather. I've been here for brunch a handful of times and it's sooo good. Their menu has so many items I enjoy it can be hard to make a decision (their menu isn't big, just very good)--my only difficulty I have there. Service is always good, it's an attractive and clean place with a beautiful outside area in the back, clean bathroom, tasty drinks, they take some reservations, and the prices are pretty reasonable. They really do a good job of checking off all the boxes. A rare find! <br><br>The only improvement I can think of is a waitlist you can get on without having to physically go there first. I think yelp even offers something like that.", "pics": null}}, {"review": {"des": "Surprised I didn't review this when I got home from dinner - probably because I was still gushing about it to everyone who would listen! Had dinner here back in November 2017 and I can still remember every succulent bite of the \"gathering\" (charcuterie) board, the ravioli, the halibut, the pumpkin cake with cinnamon ice cream and bourbon glazed pecans...my mouth is watering just thinking about it again. <br><br>Only reason it's not 5 stars is because we didn't appreciate the hostess at all - she wasn't at the entrance when we walked in and instead she continued talking to a patron when she saw us. She didn't even acknowledge us with a wave or any indication she'd be right over. The only reason I knew she saw us was that she made eye contact. We stood there for about 5-6 mins (unacceptable) and then our table wasn't even ready for at least another 15 mins. What is the point of making a reservation if I have to wait almost 30 mins anyway?! We were then forced to have drinks at the cramped bar while we waited (cramped is an understatement). This was a special night and our first impression was very poor - thankfully, the food made up for most of it.", "pics": null}}, {"review": {"des": "First time dining here last night.  I had been to this restaurant before in this neighborhood.  As a different restaurant then.  How they've redesigned the indoor and outdoor space is ahh-mazing.<br><br>The opportunity to dine al fresco in October in Chicago was nothing short of awesome.  It's an intimate space, beautiful low lighting, cozy atmosphere and beautiful colors on the walls.<br><br>The menu starts with dishes to share.  We had an opportunity to sample as a group the Whipped Ricotta with clover honey, balsamic served with a toasted baguette.  The presentation was uniquely served in a mason jar with the layers clearly visible.  This was delicious & creamy with such great flavor.<br><br>The other plates we shared with the crispy Brussel sprouts another one of my favorites.  With pistachios, Parmesan and miso vinaigrette.  They were crispy and the the mix of nuttiness with shaved parm was so good.<br><br>The last one was the crispy cauliflower with mango salsa, hazelnut butter, dukkah spices, roasted hazelnuts & micro cilantro.  It was wonderful.  Crispy with hint of sweetness.<br><br>The appetizer that's not to be missed is the Raviolo.  One single large ravioli with ricotta, white truffle oil & house cured pancetta.  Cut thru the middle and the explosion of the egg comes thru.  Delish!<br><br>For my main entree I had the sea scallops with seasonal honey crisp apples, apple cider & parsnips.  Also wonderful.  Other dishes were the half chicken & grilled sirloin which al had equally great reviews.<br><br>This place is hot and they do great food.  The wine menu had some great sections to chose from by the glass and bottle.  The sommelier was especially helpful to narrow down a Zin for us.  I highly recommend this place.", "pics": null}}, {"review": {"des": "Perfect brunch! They have a quaint patio in the back but the indoor space is bright and beautiful as well. Everything we ordered was done just right. Cinnamon bun was soft and melts in your mouth. We then got the skillet and Arctic char salad. Skillet was rich but not overly heavy, pork shoulder was tender, polenta creamy. Arctic char was cooked just right and was refreshing . A perfectly balanced brunch that left you feeling satisfied and healthy!", "pics": null}}, {"review": {"des": "New discovery after going to Café Selmarie almost exclusively every weekend for brunch, but after a long wait there we stumbled upon this place and have been coming the past three or four weekends. Haven't had a bad experience yet. Amazing brunch (the brioche french toast and pile of bacon is my go-to) and great service. Definitely recommended.", "pics": null}}, {"review": {"des": "Great experience, all around! It's a beautiful space and our food was wonderful. We sat at the kitchen counter for dinner, and shared all four things we ordered. Friendly and helpful service that wasn't rushed at all. Our servers knew the menu and what was presented to us very well. I nearly always forget what I had ordered, so having a detailed explanation of what was on each shared plate we got was so helpful! We had a bunch of delicious veggies...crispy cauliflower and crispy Brussels sprouts (wow, they were so amazing. Juicy, even. If you can imagine crispy Brussels sprouts being juicy, then that's what they were like). We also got the avocado salad and skate wing. We were still hungry and shared a chocolate mousse (? Maybe it wasn't mousse?) that was light and creamy and dark chocolatey without being too sweet. <br><br>A great dinner experience. Ambiance was warm and inviting. A great spot for a small-medium group, dinner with friends, or date.", "pics": null}}, {"review": {"des": "What a great venue with a great atmosphere. A friend and I had dinner there before heading to a music concert across street.  The waitress was spot on with the recommendations, the shared appetizers were very good and so were the drinks.  My top picks for the appetizers would be the cauliflower and the steak tartare.  If you're looking for a cozy place, with a great ambience and excellent service this is the place.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EB9sKQJG3GlaAYroyVyR_Q/348s.jpg", "caption": "Drinks"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/F3Q5WWdkW0YmOHVEiVsDGg/168s.jpg", "caption": "Steak tartare."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/z9fdde0_RucmwaNBL2FmQA/168s.jpg", "caption": "Pasta"}]}}, {"review": {"des": "Quite possibly the best meal I've ever had in Chicago. We went here for my fiance's birthday and got to sit outside even though it was a chilly night. Gather has an outdoor covered patio with heat lamps which is perfection. This just was the beginning to a great night. <br><br>We started with the crispy cauliflower and crispy brussels which were out of this world good. HIGHLY recommend getting both of these dishes. The jalapeño ravioli was also outstanding. The ricotta was a bit sweet for my taste, but was still delicious. We finished the meal with the scallops, which was the most underwhelming part of our meal, but nevertheless, still good. I also really enjoyed their Pinot Noir. <br><br>They even gave us a big bowl of ice cream with authentic melted caramel for the birthday celebration, which was super nice and delicious. Overall, likely my favorite restaurant in Chicago now. JUST GO!", "pics": null}}, {"review": {"des": "This review is for the restaurant but also for our bartender, RACHEL. <br><br>We came on a Friday night without a reservation (I had tried to make one around noon the same day but no luck) this place is BUSY on Friday night. The wait was around an hour for a table but the hostess was able to find seats for us at the bar (bless her she had a lot of demand to deal with). <br>As we sat down we were greeted by Rachel, our bartender. She noticed that we were all dressed up and not feeling super stellar about being seated at the bar. Little did we know Rachel's bar is the best seat in the house. She had an extra whipped ricotta appetizer platter that was made by mistake- she gifted this to us and it was AMAZING. Not something I would have ordered on my own and we were so grateful for the surprise. She made us a basil smash and a whiskey smash which were both excellent. Most bartenders make my drinks too sweet because I'm a 20 something female- not Rachel, she knows what's up. <br><br>We ordered the Uovo Raviolo, and Crispy Brussel Sprouts to share and wow, we were full after that, no entree needed. Both of these dishes were amazingly flavorful and perfect to share between the two of us. Gather definitely knows what they're doing. The interior of the restaurant is stylish and lit with taste- we felt classy and comfortable. <br><br>I would just like the owners of this restaurant to know that Rachel made our night! She went above and beyond to make our time at Gather memorable and enjoyable. We left feeling cared for and full of amazing food and drinks.", "pics": null}}, {"review": {"des": "Two words. Brussels sprouts.  Crazy good. 2 of us ordered and shared 4 items from the share/gather selections. Would definitely order the sprouts and ricotta again. kimchi pancake and gnocchi were good, but I'd try other options next time Nice cocktail menu. A little loud, but well worth it.", "pics": null}}, {"review": {"des": "This place is absolutely fantastic. I make a point to visit anytime I'm in Chicago. My favorite dish is the flapjacks. They're like a combination of a pancake and a shortbread cookie. Delicious!!!<br><br>I've also had the biscuits and gravy and hash...both are phenomenal. Coffee and cocktails are great too. Definitely a must visit!", "pics": null}}, {"review": {"des": "Had such a great experience at Gather tonight! As a vegan, their menu doesn't appear very vegan friendly but their patio is so amazing I had to give it a try. Well, I'm so glad I did because they were more accommodating that I could have imagined! They pointed me to the cauliflower appetizer that is vegan by default and delish and then told me the chef would make me something special. The waitress asked what I liked and disliked and the chef made something accordingly. It was delicious! The waitress also made a point to bring me some bread without butter. Can't say enough how positive the experience was and how accommodating the staff was. Highly recommend!", "pics": null}}, {"review": {"des": "My girlfriend and I went for brunch here one balmy Saturday and enjoyed our experience. It's a small space so be sure to make a reservation, but service is friendly, food is good and prices aren't bad.<br><br>I had their bacon which was $4 for a huge portion. It was seriously a lot - nice & crispy but nothing extraordinary about it. Black coffee also ran $4. My friend had their french toast specialty and enjoyed it more than she thought she would.<br><br>I had the Sunday Omelette for $11 which was done so well! Light and fluffy filled with fontina cheese and kale...a boatload of kale! Really good breakfast item!<br><br>We had a great meal at Gather (parking was hard to find though!) and they are on A La Card. I would love to go back and try their dinner!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xCJPFjvGzX5rYZ_NyOI91A/348s.jpg", "caption": "Omelette at brunch"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AVzriRoTYGO43uo1b8GSEQ/168s.jpg", "caption": "Bacon at brunch"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kQaRQmhJZQ-y2jUIMRMYqQ/168s.jpg", "caption": "Brunch French toast"}]}}, {"review": {"des": "Stopped by here on a warm summer night in Chicago. We were taking a much-needed break from a busy day, and the warm glow and intimacy of Gather drew us in. <br><br>I started off with a cocktail that was some seasonal creation, but I wasn't a huge fan of it. Maybe that's just my general intolerance of hard liquor. We ordered the Whipped Ricotta and Uovo Raviolo to start, and both were delicious. The honeyed ricotta on crispy baguette was so delicious, and it was HUGE. There was a pile of small baguettes, and we couldn't get through them all. The ravioli was this giant ravioli that tasted of truffles with every bite. <br><br>My friends had the spaghetti, which sounds basic, but was actually this interesting fusion of ramen and spaghetti. My half chicken was delicious, but then again, it's not that hard to go wrong with fried chicken. Even when I had the rest of it the next day, it was still juicy and flavorful. <br><br>The service was great, and our waiter always checked with us and gave us recommendations in the beginning to get us started.", "pics": null}}, {"review": {"des": "The best meal I've had in Chicago in over a decade!<br><br>We went early on a Thursday night which happened to be a special farm to table pri fixe meal for $55. Totally worth it. It included three appetizers: heirloom tomato salad, beet salad and eggplant. I wish I could do justice describing these dishes but they were incredible. Next we had scallops and steak (they swapped one of the steak's for chicken with no problem). Ended with beet chocolate mousse.  Each dish was phenomenal. The service was spectacular. We ate in the back outside and it was perfect. What an incredible place! We'll definitely be back.", "pics": null}}, {"review": {"des": "First off, the only reason I gave this place 5 stars is because I couldn't figure out how to give it 10 stars!  Gather was absolutely amazing - one of the better dinners I have had anywhere in the country in years.  We started with the crispy Brussels sprouts (delicious!) and the crispy cauliflower (different flavor profile, and also delicious).  Then, we had the whipped ricotta with honey and balsamic with wonderful house made bread - again, just a wonderful dish.  We paired it all with a couple glasses of a French Sauvignon Blanc that went perfectly.<br><br>The main dish was the chicken.  This thing was a true masterpiece - the thigh was battered and fried, while the breast was pan cooked.  Add in some sautéed mushrooms, creamy polenta, crispy onions, and au jus - it was a thing of beauty and with truly wonderful flavor.<br><br>Consider sitting at the counter - the four guys in the kitchen couldn't have been friendlier and it was great fun to chat about what they were cooking.  The server was super friendly and helpful.<br><br>For dessert (like I needed that), try the apple fritters - warm fritters, vanilla ice cream, and some really tasty carmel sauce.  So good!<br><br>I live 2,000 miles from Chicago, but I will come back to Gather any time I possibly can.  Gentlemen - thanks for a fantastic evening and meal.  Well done!", "pics": null}}, {"review": {"des": "We just had the best experience ever! We had the pleasure of sitting at \"the kitchen side\" and it was awesome! My husband works in the restaurant industry, and we were both impressed! To know what goes on \"behind the scenes\", is an honor to see. These guys are so focused and I have a newfound respect for chefs! Especially at this place! They plated every dish with \"care\" and when the craziness let up, they engaged with us. They really worked their asses off and it was much appreciated!!!! The food was perfection! I am telling everyone about this place and can't wait to come back!!!!", "pics": null}}, {"review": {"des": "Absolutely a great dinner, very friendly staff, truly a fantastic gathering place. They were very accommodating with our group. We truly enjoyed the sharing concept side of the menu. It was a great way to try something different as a appetizer, I really enjoyed my scallops they were cooked to perfection.", "pics": null}}, {"review": {"des": "gather was an unexpected treat. my significant other and i went here for our anniversary dinner and they did not disappoint. the whipped ricotta was my absolute favorite. it was sweet and creamy, and i constantly crave it now! they clove honey was a beautiful touch. <br><br>for our entrees i got the grilled steak with crispy pancetta. it was amazing! perfect portions and the steak was cooked to perfect medium. my boyfriend got the sea scallops; he said they were also amazing and cooked perfectly. <br><br>the outside atmosphere was nice. it has string lights. it felt very relaxed and felt like our needs were met adequately. overall it was a nice and pleasant experience worth the price we paid!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MLAcwVUfV63pNCRDmmdluQ/348s.jpg", "caption": "ran out of the whitefish so scallops with celery root pancake, roasted yam, baby beet, purple yam purée, fresh dill"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/31jB-373RTpHbR6becvDNQ/168s.jpg", "caption": "house‎ made ricotta, clover honey, balsamic, toasted baguette"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ElI0RCSCWchsfMllX15IaQ/168s.jpg", "caption": "house‎ made ricotta, clover honey, balsamic, toasted baguette"}]}}, {"review": {"des": "Another fabulous brunch at a great Chicago establishment.   The sticky bun was a great start, followed by the buttermilk biscuit and gravy.  Super start to the day.", "pics": null}}, {"review": {"des": "I love watching this place get better w age. What a lovely meal and staff. This weekend has been filled w great food and gather definitely gives a great brunch service", "pics": null}}, {"review": {"des": "I came here for dinner with my boyfriend. I'm so happy we found this place because we absolutely loved it! We are planning on coming here for brunch soon since all the pictures look so delicious. The dinner was wonderful! I want to come back to try all the appetizers. They have a great outdoor area for when the weather is nice and the whole vibe is very intimate. They also have an option to sit infront of the kitchen which seems like a cool idea. They also take reservations which you should do before coming here because it was very crowded when we arrived. <br><br>We ordered the crispy brussels sprouts, steak tartare, the uovo ravioli as appetizers. Every appetizer was better then the next. The brussel sprouts are a must! The brussel sprouts come with toasted pistachio, parmagiano, miso vinaigrette, and bonito flake. They were literally the best brussel sprouts I ever had. The steak tartare came on a HUGE wooden board. It can be easily split between two people. The steak tartare came with wagyu, egg emulsion, cucumber, caper, and homemade brioche. The brioche paired perfectly with the tartare. When I ordered the raviolo I knew it only came with one. I wasn't expecting a huge dish as it being just an appetizer but it was this big blob of ravioli that came with ricotta, sweet jalapeño, house-cured pancetta, and  white truffle butter. It was a really rich dish and I enjoyed it. <br><br>As for entrees I ordered the grilled sirloin and my boyfriend ordered the trout. My boyfriend and I weren't the biggest fans of our entrees and thought the appetizers and shared plates were so great that we thought the entrees would blow it out of the park. The sirloin came with hen of the wood mushroom, grilled sweet potato, cipollini onion, streusel, béarnaise, parmigiano, sweet potato purée,and rosemary. I thought the seasoning was a little over powering and had a dash of too much rosemary. The trout came with butternut squash gnocchi, charred cauliflower, roasted fennel, crispy butternut squash, horseradish and cauliflower purée, and sumac. He wasn't really blown away with his dish either. <br><br>For drinks we ordered their cocktails. We weren't really impressed with any of the cocktails we ordered. I ordered the basil smash and the paloma. The drinks seemed to have very very little alcohol and a lot of ice. My boyfriend ordered more liquor forwards drinks and he too felt the same way. <br><br>Gather is a great place with their appetizers and share plates. They however need to work on their entrees and cocktail recipes.", "pics": null}}, {"review": {"des": "I have to start with device first cause it was exceptional. Me and my friend sat at a bar and enjoyed chatting with both bartenders. They were funny, attentive and genuinely answered so many of our questions. Everyone else that approached was super sweet as well. As for the food we ordered eggs Benedict and the brioche French toast. French toast was delicious and not too sweet. I have expected a little more out of Eggs Benedict. Since I love truffle I felt like it didn't really shine through and the English muffins tasted kind of weird and were really hard to cut. I would definitely go back and try some of the other items and for the great atmosphere.", "pics": null}}, {"review": {"des": "2.5<br>My second trip to Gather was not nearly as good as my first. For starters, the restaurant was crowded and we ended up waiting nearly half an hour for a table despite our reservation.  The host was gracious enough, and bought us drinks, but it wasn't the best start to the evening.  And then, I have to say, everything we ordered tasted the same-- we started with the brussel sprouts (with toasted pistachio, parmagiano, miso vinaigrette, and bonito flakes) which we had ordered the time before. This time, the brussel sprouts just tasted salty and way, way too strongly of bonito. The grilled mushrooms with figs were delicious, but the spaghetti entree was a disaster.  The spaghetti with smoked chicken, sweet calabrian chili, roasted mushroom purée, mint salsa verde really tasted of nothing -- the dish relies on the mint salsa verde for flavor, but there's far too little to save the entree (I didn't taste a hint of  sweet chili and the smoked chicken was dry and flavorless). For dessert, we had the pumpkin cake with cinnamon ice cream-- this was an ENORMOUS piece of cake which tasted more like bread than cake and shared the same problem of monotony as the entrees.  Something smaller, and more subtle would have been far better.  I hope I caught Gather on an off night, because last night didn't impress me.", "pics": null}}, {"review": {"des": "Gather is amazing!! Their dinner is great. I recommend their burger, whipped ricotta, and steak tartare. For brunch, their biscuits and gravy is the best I've ever had. Their French toast is also next level. A MUST GO IN LINCOLN SQUARE!", "pics": null}}, {"review": {"des": "You should sit at the Chef's \"Counter\".  A set of 3 amazing chefs delighted us all night long.  Beautiful food from the short ribs to fish to cheese and dessert.<br><br>The wine program is amazing - focus on the wines by the glass rather than bottles - they've selected some amazing gems that they serve at great prices by the glass.", "pics": null}}, {"review": {"des": "Hands down the best brunch spot ever! This place straight up blew my socks and shoes off! My friend and I came here for a nice brunch time and picked the best spot to sit in the restaurant---the counter where we can watch the chefs prepare our food. We just had to order 3 dishes because we had our spandex on and we wanted to get our grub on. The short rib hash, biscuits and gravy and the apple streusel french toast was amazing!!! I say order all 3 and try them! You will not be disappointed since each dish is distinctively different and addictive. The portions are huge as well so prepare to be stuffed to the gills! Again, best brunch spot in the city thus far! They take the crown.", "pics": null}}, {"review": {"des": "The only complaint I have about this place is it's hard to just walk in and get a table. I think it's a testament to how good this place is but still annoying. Lol. Seriously this is a great place.  Food is delicious and service is very good.", "pics": null}}, {"review": {"des": "Yo yo.  This place is amazing!   Service of course but the food is also top notch.  Brussel sprouts are amazing.  Fried rice is uniquely done and new menu item to try out (it was amazing too).  Braised short rib and half chicken were to perfection.  Of course, cocktails is one of their things and they have a nice selection of beers for that crowd.  Cool place.  Def go!", "pics": null}}, {"review": {"des": "SPECTACULAR!<br>I recently moved to Lincoln Square, and had heard many rave reviews of this place, and of course, the many other yelp reviews set high expectations, and the real Gather experience did not disappoint! We sat outside on their cute back patio seating area, under the trees, in perfect, 70-degree summer evening weather. Normally I would have taken pictures to share, but I was so preoccupied with the deliciousness of this meal that nothing else mattered in the moment. If you go for dinner, you MUST get the Steak Tartare. The presentation of the wagyu with the most perfect egg emulsion, when combined with the crispy, perfectly-toasted homemade brioche, was absolutely out of this world. I do not say this lightly, this was quite simply the absolute best Steak Tartare I have ever had, and I have had many of them!<br>We also got the Cured Salmon, which was was ridiculously good - I mean, the cucumber creme fraiche was just unbelievable, I don't know how they got the perfect balance of the cucumber to the creme fraiche like that..I must know the secret! The salmon was just lightly cured and the sourdough was perfectly grill-toasted. The portion size of this dish was pretty large, but I am not complaining. Give me more of this cured salmon dish!<br>Finally, we also got the Avocado Salad and the Pork Tenderloin. Both were, as expected, simply delicious. The Salad was light, and the different flavor combinations worked perfectly. The sesame vinaigrette was fairly strong throughout, but really pulled the salad together. If you enjoy the flavor of sesame (like I do), I would definitely recommend this salad!<br>The Pork Tenderloin, as our last course of the meal was a perfect end to the evening. The crispy chick peas were surprising, and added a great texture variation to the dish. The pork tenderloin itself was cooked perfectly, and topped with the crispy pork belly. I mean, for me, if you put pork belly on anything, I am a happy woman, but this particular pork belly, when combined with the sugar snap peas, and the flavors of the parsley puree and the shallot vinaigrette, was absolutely perfect. <br>The portion sizes here are VERY generous, and for two people, the four dishes we got were honestly actually a little too much (Sarah did warn us, but we insisted on trying all of the things...to our own demise!).<br>In terms of cocktails, we tried the Overnight Sensation, and the Seasonal Harvest, both of which were very very very good. If you have a chance to try the current Seasonal Cocktail, I recommend getting one before it's gone, though, honestly, the particular cocktail they were serving last night had definite hints of orange (and maybe clove?) and really made me feel like autumn was just around the corner. I hope they keep serving this one all through the fall season - it's perfect for that time of year!<br>Everyone raves about the dessert, and honestly we were sad we did not get to try it last night. But we did not have ANY room left for even one more bite of food as we were leaving at the end of our meal. All in all, minus the dessert, it was pretty much the perfect evening. I guess we're just going to have to come back another time for dessert. Gather, you did NOT disappoint. See you next time!", "pics": null}}, {"review": {"des": "I took my husband here for a postponed birthday dinner. The issue was I tried to get reservations the week after his birthday and none were available! So it's a very popular place. I was able to book reservations online and they sent a text to confirm the reservation so very easy. We arrived right before it opened and watched the staff placing the candles on all the tables and dimming the lights. We got placed at a table for two right by the window (and heater!) so we were able to look outside. (I was secretly hoping for that table!) They took our coats for us. The place doesn't hold a ton of people, which is nice, but has enough space. The first thing was ordered was an appetizer, the whipped ricotta, and the ricotta is mixed with honey and balsamic vinegar. Yum! It came out with a huge stack of toasted baguettes. We ate the whole thing, although it was probably supposed to serve four people, when considering the size of it. We then both ordered the arctic char which is a cross between salmon and whitefish. It came with cucumber kimchi salad, cashews, rice and avocado crème (which was beyond delicious). The fish was cooked right and even though the dish looks small on the place (large plate), it was plenty. Then we ordered the apple fritters for dessert which was almost like a beignet but this one was covered with caramel and had vanilla ice cream. It was so tasty! The staff there were very friendly and not at all annoying. We both really enjoyed this place and highly recommend it!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Bq6ZBcSyT8lkBJVIZy8hjg/348s.jpg", "caption": "arctic char"}]}}, {"review": {"des": "We had a really wonderful time at gather. Everything was beautifully plated. I had the scallops which were excellent and the seared Skate? Wing? What's that you say? It's in the Ray family like sting ray. It was not too fishy and had wonderful accompaniments. The server was kind and seeet and attentive. We loved this visit and will definitely be back", "pics": null}}, {"review": {"des": "I had dinner here recently with my son, it was wonderful!  It was the best dinning experience that I have had in awhile.  We ate outside on their patio, which had s very warm ambience with lots of plants and lights draped across and candles on all the tables.  <br><br>As for the service, it was excellent!  Our waiter had given us a great overview of the menu, and how best to order, to get the most out of our experience.  He also made a solid wine recommendation that complimented our food.  <br><br>As for the Foid, delish!  A fine dinning experience, but without too much attitude.  We started with sharing the fried Brussels sprouts with shaved bonito and pistachios tossed in an garlic aoil, so yummy!  We also had the steak tartare, which was one of the best I have ever had, honest. It was served with an egg yolk emulsion and grilled spinach leaves drizzled with a little balsamic and homemade toasted brioche.  <br><br>As for our entrees, I had the seared day scallops with fresh seasonal corn and chanterelle mushrooms etc..  I can't remember all the ingredients, but it was awesome!  My son had the halibut, which he also really good.  Sorry, don't remember what all it was served with?  Trust me, everything was great, you can't go wrong here.  <br><br>I will be back soon, as its close to home and reasonably priced for a great casual fine dinning experience!", "pics": null}}, {"review": {"des": "Seriously this place is a gem, such a good place with awesome service and quality food. I am always amazed at how knowledgeable the staff is here. I always sit on the stools watching the kitchen staff cook and they are so talented. The prices here are great for food. I don't even like Brussels sprouts but I get them here every time.", "pics": null}}, {"review": {"des": "Came here for dinner on a Tuesday night and the place was busy but, they were able to seat us right away. Such a charming restaurant. <br><br>Everything we ordered was delicious. We got the whipped ricotta, the crispy cauliflower, and the ravioli (which was by far my favorite part of the meal). Then we got two entrees, the half chicken and the halibut, both were amazing. We got the apple fritters (their signature dessert), which came out warm and were very decadent, especially with the homemade caramel drizzled on top. <br><br>Ambiance is romantic and cozy. We didn't eat on the back patio but it looked so cute with all the lights. <br><br>Servers were so attentive and helpful in explaining the menu. such a great experience dining at gather, would recommend to anyone!", "pics": null}}, {"review": {"des": "Mmm yummy!  What they do well is combining textures (crispy, saucy, powdery) and flavors.  Service was excellent; host was professional and accommodating (they can text you when your table is ready), and our waiter/bartender was knowledgeable in both food & drinks and friendly.  Even the busboys carried smiles and friendliness.  You can tell all the employees are trained well.  The vibe is cozy and warm, played good music, aesthetically pleasing with the geometric wall designs, and the staff look put together with matching button-up gingham shirts. The designer must be a fan of geometry and patterns!<br><br>My fave dish of the night was the broccoli with pork belly.  If this wasn't a shared plates kind of place, I would've eaten it all myself.  It's got meat, veggies, texture, lots of flavor, and this sauce that ties everything together!  My friends loved the ricotta & honey toast.<br><br>The damage was about $50/pp after tip & tax, and it included plenty of food, a dessert, and an average of 1.5 drinks per person.", "pics": null}}, {"review": {"des": "Wow! Pleasantly surprised. We came here on a whim without reservations on a Thursday night while looking for places for dinner. Gratefully, the host said we were in luck and we were led to the beautifully lit back patio. Seemed to be the most opportune time as this was probably the last few summer nights before the impeding fall.   <br><br>The service was super descriptive and knowledgeable. She helped us make some awesome choices for dinner and drinks. Their seasonal cocktails was quite a hit. My pimm's cup was well made too. <br><br>The 3 girls shared everything. The highlights in the food were the brussel sprouts. Initially, it was slightly overwhelming with the fishy bonito flakes but it grew to be a great dish as it all came together with the wonderful pistachios. The grain risotto with pulled pork was ok...the portion was on small side but still tasty. The sirloin steak was cooked and sliced to perfection. however, I didn't care for the accompanying white beans or the fried green tomatoes (it's probably just a personal choice). The cauliflower plate was Asian inspired. we compared it to kung pow chicken but with cauliflower....such a unique preparation. <br><br>The place seems to mostly raved about for the brunch but we enjoyed our dinner thoroughly and won't mind coming back. <br><br> Parking is tough unless you pay and park in the lot near by.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BQrbZFTwwGgm__-n_YBmrQ/168s.jpg", "caption": "Brussel sprouts with Bonito flakes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/an5prC1PsCTCyNdRnXvkbQ/168s.jpg", "caption": "Risotto special with pulled pork"}]}}, {"review": {"des": "Special flavors on the menu make this place a great find. Try the Brussels Spouts. Best ever!", "pics": null}}, {"review": {"des": "The food was delicious. The atmosphere was delightful. The staff were lovely. We got the corner spot right next to the kitchen and the food runner showed us and explained dishes as he brought them out to tables. My family and I had a lovely time. Hopefully next time we will have room for dessert.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Tp53cMSNntlNwQE2BLRD3A/348s.jpg", "caption": "Chicken"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UYrcb4SvVGTes_VAhNL01g/168s.jpg", "caption": "Sea scallops"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hAtrydluQMtsH2eFhXVskQ/168s.jpg", "caption": "To die for burger and fries"}]}}, {"review": {"des": "omg this place was amazing. I came here on a Saturday evening around 6 with my boyfriend, and it was fairly busy. The staff was so nice and took our coats. Given how popular it was, we were given the choice to sit at the bar or at the open window next to the kitchen. We opted for the kitchen seating to see how everything was made, and it was such a show. The chefs are so clean and they constantly check for quality control.<br><br>My boyfriend and I had the steak tartare, spaghetti, and one dish off menu that consisted of root vegetables with a puree. We were given the off menu item as an apology for our wait, but honestly both of us didn't notice waiting at all.  The steak tartare was to die for. It had the perfect balance of acid, fat, and sweetness. The spaghetti was also good and delivered a variety of flavor. It's not the typical sauce you'd be expecting though; it has sweet, sour, and savory notes without the regular basil and tomato flavoring of other spaghetti. The off menu side was also a delight.<br><br> I'll definitely be coming back again to try more!", "pics": null}}, {"review": {"des": "Our group of four adults and two babies had brunch on a Sunday morning. Plenty of tables had representatives from the baby and toddler demographic and all were happy and well behaved. The adults too.<br>We had a reservation for 10am - right when they open. The covered outdoor patio is lovely when the weather cooperates.  We were thrilled to get to sit outside.  The waitstaff was friendly and attentive.  I ordered the pancakes because I had heard such great things about them.  They were fantastic, as were the scrambled eggs and bacon I ordered as side dishes.  Actually, the two orders of bacon we had for the table were too much food for us!  There was so much awesome bacon!  I intend to return!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Yc7KuWRyFNkdeiHV8xKa6A/348s.jpg", "caption": "Pancakes served with jam, syrup and butter."}]}}, {"review": {"des": "Believe the hype! This place was fantastic. <br><br>I came with a date on a Sunday evening. We started with the ravioli, which was sooo good. The sauce they used was perfect. Then, we got Brussels sprouts. I'm not a huge fan of this veggie in general, but these were tasty. They also came with fish flakes, but we got those on the side because I hate fish. Then, I had the half chicken. I have honestly never had better chicken in my entire life. The roasted portion melted in my mouth. Have you ever had chicken that actually melts in your mouth?? I certainly hadn't, and it was an incredible experience. The fried portion was perfectly crispy and juicy, and the polenta and gravy added the perfect touch. <br><br>My date had the burger which was tasty, but you're really missing out ordering a burger at this place. <br><br>Service was awesome, too. Our server was really accommodating of my silly food preferences, and was the perfect mix of funny and gracious. <br><br>Give this place a try! I'm so glad I live close to it now.<br><br>UPDATE: I've been to Gather 4 times now and each time has been incredible. The chicken is still my favorite, but everything I've tasted has been amazing. Go on a Sunday for family dinner!!", "pics": null}}, {"review": {"des": "We loved dining on the patio for dinner. Great pasta option. Order the sprouts without the seafood - if it's an option. Friendly service.", "pics": null}}, {"review": {"des": "Best Burger in Chicago... this is not up for skepticism or debate.  Just try it for yourself.", "pics": null}}, {"review": {"des": "Service - outstanding (it's not even that everything came out quickly, which was fair because the restaurant was super busy on a Saturday night, but, from the hostess/manager to the servers, everyone was oh so nice and friendly).<br><br>The toast!  Came with the steak tartare - best toast I've ever had, and I'm a toast girl.  Tartare was good too.<br><br>Salmon tartare - huge. Definitely feeds 4 (we had 2 people).  It was good/fine, but we wouldn't order it again.  Seemed fresh.<br><br>Mushroom dish - awesome textures, okay taste.<br><br>The space - cute, which fits the neighborhood.<br><br>Loved this place!  Perfect dinner spot before you crash a wedding.  Don't ask.", "pics": null}}, {"review": {"des": "Went for dinner with a friend and was blown away! The service was excellent and the food was even better. We shared the brussel sprouts, uovo raviolo, and seared scallops. The brussel sprouts were my favorite; I don't know what was in that sauce but it was delicious! It's a must-order. They were conscious of dietary restrictions and very accommodating (offering to put the pancetta on the side of the raviolo). I'll be back!", "pics": null}}]}