{"name": "gejas-cafe-chicago", "reviews": [{"review": {"des": "Great place. Very charming decor. Loved the outdoor fire pits and holiday decorations.  The inside was equally charming. If you are going for a romantic evening, make sure to request one of the enclosed and intimate alcoves. Delicious food. Great cut of beef, lovely scallops. Wonderfully tasty sauces for dipping the meats. Mild to super spicy. Solicitous staff. They took their time explaining everything. From the menu and exact ingredients in each fondue (cheese start and chocolate dessert) to the accompanying dipping sauces and type of oil. <br><br>One adjustment compared to other's comments in reviews. A lot of people have said that they give huge portions. I'm assuming that they mean overall. Because the main meat portion was not very large or filling. You don't end up full until you finish the dessert. So if you go kind of ala cart and don't get one of the more expensive experience meals with cheese fondue to start, main meat entreè and dessert fondue to end, you will be hungry if you have a regular or large appetite. I was stuffed by the end but my companion was not. They also do not offer to bring more veggies as some fondue restaurants do. Although we did not ask for more veggies. The nice assistant asked if we were finished with each course, as they swiftly set you up for each new course, so we did not think it was appropriate to ask for more either with this pace.<br><br>Overall though, I would highly recommend Geja's and we can't wait to come again.", "pics": null}}, {"review": {"des": "What a wonderfully, romantic experience. I came here with my boyfriend yesterday for our anniversary, and it was such an interesting experience. I've never been to a fondue restaurant, but he had been here once before like ten years ago and didn't remember too much about it.<br><br>When we got here, the nice valet workers opened my door for me, held an umbrella over my head, and walked me to the restaurant doors because it was raining. Very nice! Then, when we got into the restaurant, they sat us right away and we got an anniversary card with the workers' signatures on it. They also have coat check here, so you know it must be pretty classy! Remember, they have a dress code, at least business casual and no kids under 10 since you are surrounded by open flames during your whole meal.<br><br>Our waiter Mario was extremely nice, and the other guy helping him was also friendly and helpful. We both ordered a glass of Prosecco, and then I ordered the beef and lobster, while my boyfriend ordered the Prince Geja Combination. Before we got our main course, we got the cheese fondue and a salad. The salad was okay, but whatever dressing the used (either lemon or vinegar) made my teeth super sensitive. Still very good, but it was bitter tasting. The cheesy fondue was kind of gross at first because it wasn't too hot, but then as it started boiling, it was delicious. With the cheese fondue, we got grapes, bread, and apple slices.<br><br>Then, when we got our main courses, they put both of our orders on one plate with tons of veggies. Honestly, there were SO many veggies, and way less meat. Awesome enough though, they did give a lot of lobster, so it was so worth it. I never knew that at this place, they have you cook it yourself in the oil. It was a cool experience and pretty romantic because we kept feeding each other. Though, with the dim, red lighting in the restaurant, it was very hard to see if the food was fully cooked. I'm OCD, so I hated that because I hate undercooked food. When we got our main course, our waiter did tell us how many minutes everything takes, but of course, we weren't literally timing things with a clock, so we were winging it. Some things came out overcooked, which sucked. At least for undercooked food, I was able to put it back in the oil.<br><br>The amazing part of the whole dinner was the chocolate fondue and the coffee for dessert. Interesting enough, I normally hate dessert, but the fondue was delicious. We were able to make s'more like marshmallows, and there was also strawberries, pineapples, pound cake, and rice krispies.<br><br>Overall, this wasn't my all time favorite place, BUT it was definitely worth the visit and I hope to come back. The ambiance is romantic and perfect for date nights. The food was very good, but I did wake up with heartburn today because of all of the oil I cooked my food in. That, I was not a fan of.", "pics": null}}, {"review": {"des": "I wasn't a huge fan of this place. We used a Groupon deal to try it out because it's rated one of the best romantic date spots in Chicago. <br><br>Decor - It's definitely has a romantic vibe to it but I felt like everything looked really old and outdated. Maybe that's the look they are going for but I think they would benefit from some renovations.<br><br>Food - It was a fun experience to cook it with my husband. It was very interactive and engaging but that was about it. The food itself was okay as most.<br><br>Service - This was also just okay. I felt like the server was annoyed we didn't order more. We don't eat very much so we didn't order very much. I don't know if the server was disappointed because she'd be getting a smaller tip or just busy with the few other parties there. <br><br>Overall everything was just okay. Nothing was terrible but nothing was great either. We used a groupon so we weren't that upset that we didn't enjoy it as much as we had anticipated.", "pics": null}}, {"review": {"des": "A great spot for a romantic fondue date. <br><br>You pick a meal plan which comes with a salad, fondue appetizer, tray of meats and vegetables to cook, and chocolate fondue dessert.  I had the \"connoisseur\" meal as well as the robust cheese appetizer. If you've never had fondue before, only the appetizer is dipped in cheese. The entree you deep fry in a pot over a flame. <br><br>My meal was fantastic. I loved deep frying all of the vegetables and proteins. The \"connoisseur\" comes with shrimp, steak, and lobster. They were all delicious. My favorites were the lobster, the broccoli, and the onion.<br><br>I very much enjoyed the appetizers as well. The Gouda fondue that came with the meal was extremely creamy, with a very sharp and robust flavor. There were apples, grapes, bread and almonds to dip in the fondue. The \"robust cheese platter\" we ordered in addition to the fondue was also delicious - I loved all the cheeses they had. Very excellent quality. <br><br>The only negatives about this meal were the salad and the dessert. The salad had too much dressing - it was drenched. I would have preferred the salad either lighter on the sauce or with the dressing on the side. As for the dessert, our chocolate fondue, it was just not good. It had way too much brandy in it - to the point that the brandy completely overpowered the chocolate. It had great dipping options, but the alcohol killed it. <br><br>Our service was fantastic. Very friendly and helpful. The atmosphere was excellent. The dim, red lighting and books on the walls made the setting very intimate. <br><br>Overall, I highly recommend this place and encourage you to check it out. Take a date here.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZSG60v0eMSP_m6iMeibEvg/168s.jpg", "caption": "Cheese fondue appetizer and robust cheese platter"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OO9AzUiLmUEYs9UutCcoVg/168s.jpg", "caption": "Fondue entree"}]}}, {"review": {"des": "If you're someone who doesn't know much about cheeses and not open to experimenting with food, you're probably going to get disappointed here.<br><br>The classic cheese fondue comes with Gruyere swiss cheese mixed with white wine, sherry and garlic. Although it sounds interesting, the taste isn't! It really tasted bitter and dominated all other flavors. The house salad was also meh! I expect more than just greens in a salad, more cucumbers please! (Not just 2 pieces)<br><br>The belgium chocolate fondue is without a doubt, top notch! Comes with a brim of citrus substance with when lit with flames, serves a great way to roast those yummy marshmallows.<br><br>I am sure the 3 cheese fondue would be better and worth trying. Its next on my list.<br><br>The service is wonderful! The server was very friendly and made us laugh.<br>Ambience and live music adds to its glory.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3oOJgeuMdWhTetHOCtcDiw/168s.jpg", "caption": "Gejas house salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jwz-by08NvwdQNXtPn_naQ/168s.jpg", "caption": "Cheese fondue with gruyere cheese, sherry, white wine and garlic"}]}}, {"review": {"des": "Went here with a Groupon deal (they have them pretty often on there I think) and overall was OK. Space can be pretty cramped especially for the 2 person tables. We sat directly next to where the guitarist played. Very close corners, but guitarist was good!<br><br>Cheese fondue was good - would have liked other items to eat it with but not bad. Wish we could have kept the cheese for our entree portion though! Dessert was yummy, love the graham cracker crumble on it. <br><br>For the entree, I liked the variety of sauces they give for you to try and it was great that the waiter explain what paired best with each. My critique is that a lot of the veggies don't actually taste that great when in the oil - they just absorb it and get soggy. I patted mine down with a napkin each time. Put them in quick so they don't absorb as much - especially the mushrooms and peppers.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kdnkC6XjXdbihqx9GGHHwA/348s.jpg", "caption": "Dessert fondue with Flaming chocolate"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/im1BRIf7C4RiGIzBqlEgXg/168s.jpg", "caption": "Delux Seafood and Princes Gejas Combo"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pI7naRBpf5qiokAszqo-cQ/168s.jpg", "caption": "Geja's Salad"}]}}, {"review": {"des": "This was one of the most amazing restaurants that I've ever been to! I took my boyfriend there for his birthday, and the ambience of the place is very intimate and romantic. The food is to die for and the wine list is extensive! This is the perfect spot for a date in Chicago. The cheese fondue comes with bread, grapes, and apples for dipping. The main course is served with 8 different and unique dipping sauces, our favorite was the Sriracha Aioli and the Thai Chili! Dessert is chocolate fondue served with marshmallows, pound cake, pineapple, strawberry, and Rice Krispie treats. Our waitress was very knowledgeable about the food and wine, and created a great experience for us. We will be back soon!", "pics": null}}, {"review": {"des": "Hubby and I love coming to Geha's once in awhile for a date night. It is quite a bit of a hike for us as it typically takes us about an hour and 15 min to 30 min to get there with traffic. We almost always have a groupon and this time we brought our son. We all enjoyed the evening. Be prepared to spend a couple of hours here as this is a slow-paced dinner where you are cooking your own a bit.<br><br> The dinners are one price and are all inclusive, meaning they include the cheese fondue with dippers, a house salad, your choice of dinner entrée meats and the chocolate dessert fondue.  The cheese fondue is a cheddar cheese with bits of rye, pretzel and French bread with apples and grapes.  The meat is your choice and everything is cooked in a hot oil over a sterno.  There are a variety of sauces (bbq, dill, teriyaki, horseradish, seafood sauce, among others to dip in). With your chicken and sirloin, we also got green peppers, onions, mushrooms and potatoes.<br>  <br>Our dessert chocolate came with marshmallows, brownies, strawberries, banana, pineapple and rice crispie treats.  They heat up the top of the chocolate so you can toast your marshmallow and make a smores treat (they provide crushed graham cracker too).<br><br>The service was fantastic and he paced out the meal perfectly, refilling drinks in a timely manner.<br><br>The restaurant is somewhat dark and romantic, but the tables are rather close together. We have been lucky to always get a table or booth off to the side which affords one more privacy. If you want that option, book further ahead to get a good table. <br><br>There is paid valet parking out front, which is a good thing, because there only seems to be street parking available.", "pics": null}}, {"review": {"des": "Sweet, sweet Geja's. Designed to be a romantic experience, the tables are small, the lighting is dim, and everyone is dressed nicely. I absolutely adore their new fireplaces outside and heated lamp inside. <br><br>Pro-tip: they ALWAYS have a groupon running. <br><br>The best bang for your buck is to go with one of their classic meals, which comes with a starter salad (basic lettuce, cukes and Dijon dressing); cheese fondue (served with grapes, apples, and two types of bread); meats, seafood and veggies (paired with eight homemade dipping sauces); and chocolate fondue (served with an assortment of fruit, poundcake, Rice Krispies and toasted marshmallow). <br><br>On my last visit, we came during restaurant week. I did not like that they didn't offer RW prices unless you mentioned it. I, of course, asked the second we sat down because they passed out their regular menu with regular pricing. However, at the end, before our waiter brought out the bill, he leaned in real close and said \"you wanted RW prices, right?\" It shouldn't be a secret! Everyone should get the discount. <br><br>I also didn't like that we sat with our meat and veggie course on our table for 15+ minutes after we were done with it, and then waited another 20+ minutes for our chocolate fondue. It was a LONG time. <br><br>Overall, 3 stars for this visit, but I'm rounding up to 4 because my visits over the years have been far better. A trendy spot to take out of towners.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/grePT5CBcJG2EAK_cS0vVQ/348s.jpg", "caption": "Beautiful (and warm!) fireplace"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wuWeSr0lGuYoiHT67IiCGA/168s.jpg", "caption": "Served with the chocolate fondue"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8du9Eb80AB-MyTTiX-YQMQ/168s.jpg", "caption": "Roasting marshmallows over the chocolate fondue!"}]}}, {"review": {"des": "Really enjoyed my meal here for my birthday :)<br>We ordered the dinner with cheese fondue and salad, meats and veggies (scallops, beef, chicken, lobster), chocolate fondue, and then they brought a little birthday cake slice for me. The sangria was tasty too! The live guitar nicely added to the ambiance. I enjoyed how long the dinner took, we were there for about 3 hours. <br>Our fondue flames went out a few times, which slowed our meal down a bit. <br>Overall, really enjoyed the dinner- at times wished some of the meats or veggies were marinated or seasoned prior to frying. But their sauces are pretty good.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EkUBn0qFibdxC73CeDxV_w/168s.jpg", "caption": "Time for cheese and bread"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Usw_SOGPGNTHs8Cxb5d8jQ/168s.jpg", "caption": "Toasting marshmallows in the alcohol burning off the chocolate"}]}}, {"review": {"des": "Pros: staff is quick, friendly and helpful. Wonderful atmosphere. Large wine menu. Excellent date spot.<br><br>Cons: expensive. Small portions. Busy, make sure you have a reservation ahead of time.<br><br>Overview...it was nice checking out but I probably wouldnt return. Food was decent just wasnt impressed especially for price.", "pics": null}}, {"review": {"des": "The word \"overpriced\" comes to mind immediately. The atmosphere could be described as romantic but I'd say dark. If the servers need to use flashlights to show you the menu something's gone terribly wrong. Intimate, no I'd say cramped. And you don't want to be forced into close quarters when dealing with fire and boiling oil. <br><br>The servers and support staff are very nice. So props to them for polishing up a turd. But the host stand seemed uninterested and almost rude while being nice. <br><br>The cheese fondue is good. But the rest is unimpressive. And for goodness sake don't have lobster on the menu as a representation of fine dining only to be fried up in fondue oil! <br><br>It was our anniversary and this place is supposed to be good for special occasions. But there was nothing special about it. And nothing special done for us. <br><br>I don't mind when a restaurant makes mistakes or isn't amazing. But when a restaurant puts on an air of false high standards I get a little cranky. I won't have it. <br><br>Go somewhere else. Chicago has so many amazing restaurants. This one is mediocre wrapped in a fancy wrapper.", "pics": null}}, {"review": {"des": "Definitely come for the ambiance. Very warm and inviting but intimate as well. The food also exceeded my expectations, both in quantity and quality. The meal comes with a salad, cheese fondue, meat/veggie and chocolate fondue! With the Groupon, it was very fairly priced and definitely worth it for the food and experience <br><br>The only downside to this place is that you leave feeling covered in a film of oil :/", "pics": null}}, {"review": {"des": "Food was a 2.5-3 at best, service however gets a 4+.<br>Geja's has been heralded as the most romantic restaurant in Chicago by many websites and publications.  I don't see it at all, the floors are a very unsexy old tile, the ceiling and lighting look decrepit and falling apart.  I am genuinely interested in how the place looks without the dim red lighting, probably much worse.  It definitely has some kind of vintage charm to it but it badly needs renovation.<br><br>I really wanted to love this restaurant but right from the get go the cheese fondue was a huge let down.  The fondue was extremely grainy, almost as if the roux had not been cooked out long enough and not fully emulsified in the cheese, cream, and wine.  When you ate a bite, your whole mouth was coated in this grainy glop.  It improved slightly as it heated up but it was still not good at all.  I've had fondue in Switzerland and even Melting Pot and it's this delicious, unctuous, and smooth emulsification that constantly borders on breaking.  Geja's was an awful example of the same.  <br><br>The actual entree was solid, a bit pricy for the protein content but more than enough is provided especially with the vegetables to fill you up.  The amount of oil you ingest eating everything really makes you uncomfortably full.  I also smelled like a Popeyes employee (shout out to you all, those fries are the bomb) after cooking our meats and veggies.  I guess that's the outcome you accept when you're deep frying within a foot with no ventilation.  <br><br>The chocolate fondue ending was a misfire at our table.  When the sterno was lit it looked too intense and my girlfriend mentioned it to the waiter, he said it wasn't a problem.  Sure enough though, about a minute after the flambé died off the chocolate fondue started to burn and seize--we ended up capping off the sterno ourselves so we didn't have a burnt smoky mess.  <br><br>All in all this is a try once, mark it off the list, and move on kind of place.  For the money there are so many better and more romantic restaurants.  My girlfriend and I both agreed we had more consistent better tasting cheese and dessert fondues at Melting Pot.  There are so many better options at MP and they are executed without error.", "pics": null}}, {"review": {"des": "Excellent place to bring a date or the person you love ... aka the ball and chain<br><br>Great choice of food and the environment is excellent.", "pics": null}}, {"review": {"des": "The feel of this place is awesome. It's tight and the ceilings are really low, but the entire place is lit up by candles and dim lighting at night. Truly, romantic.<br><br>Best cheese and chocolate fondue! <br><br>We ordered the combination that came with an assortment of seafood and meats. We were noobs at the entire process (cooking your own food), but we got through it! <br><br>It was a fun experience overall!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1IkSssV3PBiCePygV-B66Q/168s.jpg", "caption": "Combo Platter"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NtF0utWZ2UDfxJOgBZBOYg/168s.jpg", "caption": "Mini birthday surprise"}]}}, {"review": {"des": "Yes, yes, yes, yes, yesssssssss.<br><br>Oh. My. God. <br><br>This is one of my favorite places in the city. The ambiance is intimate and sexy. The red and dim lighting fit perfectly for an intimate Valentine's Day meal. <br><br>The food...<br><br>The sticky, melty, sensual cheese fondue. I loved how it melted in my mouth. Unbelievable.<br><br>We splurged and opted for Prince Geja's Combination, the creme de la creme of combinations. It comes with scallops, lobster, beef, chicken, shrimp, and a variety of vegetables. The oil you cook the food in is the best I've ever had. It was savory but had a subtle and addicting sweetness to it.<br><br>Oddly enough my favorite thing I cooked in the oil was the broccoli. It became crispy yet juicy and I could not stop eating it.<br><br>Our waitress Shannon was perfect in every way. She was witty, helpful, but gave us our space. She was knowledgeable and walked us through the experience in a fun way.<br><br>Even with reservations we waited for half an hour to eat here.<br><br>I don't care though. This place was worth the wait.", "pics": null}}, {"review": {"des": "As soon as you sit down, you can definitely understand why this place claims to be the most romantic restaurant in Chicago. It felt kind of like being transported to another country, one more romantic than the US. <br><br>Honestly, the whole fondue process was so much fun for my boyfriend and I (it was our first time getting it). We had fun deciding what pieces we wanted to cook and then figuring out which combinations of dipping sauces were the best for the different items (my favorite sauces were the teriyaki, sriracha aioili, and the dill one). <br><br> I agree with another reviewer's advice on using your phone to keep time... otherwise it's easy to get lost in conversation and 2 minutes goes by fast! Another protip that was much appreciated is to reserve ahead of time and request a booth. I think the experience wouldn't have been as amazing if we hadn't gotten an intimate corner booth. The service was very professional. <br><br>Only reason for the 4 stars is jeez the place is pricey. Even after using a Groupon (which you absolutely should do), the bill was somewhere around $110 (without tip!!). But we were definitely stuffed - we were so full we couldn't even eat half the desserts with the chocolate fondue.", "pics": null}}, {"review": {"des": "I've always had a good experience here. Servers are always knowledgable and nice. <br><br>I honestly just love cheese fondue so thats my favorite part. There is always either a groupon or email deal so make sure you have one.<br><br>All of the food is pretty good. The salad dressing is amazing. The cheese fondue has great flavor and I like all the dipping options they give you. **BUT**I wish they would ask you if you'd like a refill on dipping options because we usually have cheese left and I feel bad asking. The meats they give you are good. They don't give you a ton of them, usually only like 2 pieces of beef, 2 pieces of lobster, and 2 shrimp so theres not a TON of that. They do give you lots of veggies and lots of dipping sauce.<br><br>I don't really love the chocolate fondue. I wish they gave you different chocolate options like dark chocolate. And I wish they gave you more fruit and less rice crispies since I don't like those at all. Last time, our fruit was a little old too.<br><br>Depending where you're sitting, some tables are darker that others. I would try to ask for one that has a light above it!", "pics": null}}, {"review": {"des": "I felt like a chicken in a cage cooking and eating.<br><br>Went there last night for the first time and very likely the last. I was not aware of the type restaurant it was as it was a surprise. It's fry everything yourself on a tiny table and pay premium price for raw meat (meats were not seasoned and very bland). As far as romantic dining goes, I highly object to this being it, you move your arms out and would hit the other guests as seats are extremely close together and I felt the flames' heat on my neck from the guests behind me. Server was not able explain the concept very well and very slow to get back to the table. There are many great restaurants in Chicago to dine at instead.", "pics": null}}, {"review": {"des": "The man and I came here the week before Valentine's for an early anniversary dinner and it was everything it was hyped up to be; a romantic and delicious dinner. We also used a Groupon, and pleasantly experienced no issues with that.<br><br>The entryway is below street level and really gorgeous. The brick fireplaces kept us toasty for a minute and were uncrowded at 8pm on a Thursday. Make reservations (it's nice to be expected) and ask for a booth. We sat with no wait and our server was attentive. Food is similar to what you'll receive at Fondue Stube or the Melting Pot, though the portions are smaller. Don't even think about getting cozy and closing those curtains; it's a fire hazard or fire code violation or something.<br><br>Loses a star for noOOoo street parking at all (just do the valet, it is 100000x worth it to pay an extra $15 or whatever and spend 30 minutes eating rather than driving around yelling about how much you hate Chicago and its crappy parking situation). And also because the Groupon could not be combined with the restaurant week menu - boo! I want deals on deals on deals~", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_YD78l7Yio0WJ457g3hgbg/348s.jpg", "caption": "February 2018. Festive!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DGkL02tI80wexA3kTbbLqA/168s.jpg", "caption": "Toasty gas fire! For when the romance isn't keeping you warm enough"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lpavnXt5VwX8qiUVGxvfKA/168s.jpg", "caption": "Entryway below street level."}]}}, {"review": {"des": "Simply the best Fondue !  <br>And they have a great award winning wine list and friendly, very helpful staff.  Great place to go on a double date.", "pics": null}}, {"review": {"des": "The boyfriend and I were trying to find somewhere different for date night awhile back, and opted for Geja's on a Saturday night. Being the procrastinator that he is, he waited until three days prior to make the reservation, but we still managed to be able to snag a table for 8pm.<br><br>Upon arrival, we opted for the $12 valet since I wasn't about to deal with January weather in heals, and the gentleman at the valet was very kind and did a wonderful job. <br><br>Once entering Geja's, we were greeted by the host who had quite the sense of humor! What a treat! We had to wait about 5 minutes for our table to be ready (no big deal), so we checked our coats in and waited until everything was ready.<br><br>We were then led to a VERY cramped and VERY dark - I mean, \"romantic ambiance\" space filled with about 9 tables; double booths, one sided booths, and \"family style\" tables included. We were then seated at a table the size of Barbie's Dream House dining room table, and I struggled the entire time to not set my boho sleeves on fire due to the cramped space. The gentleman behind me had more than plenty of room, but didn't seem to care that my table was grinding into my rib cage  every time he decided to scoot back a bit while he exclaimed how full his belly was. That being said, service was on point and our waiter took more than enough time explaining the menu to us and what our options were. He even brought out an extra pot of oil (seriously not even sure how we fit TWO pots of oil on our table along with everything else) so that I didn't have to share oil with the omnivore boyfriend (herbivore here). <br><br>I highly recommend hitting up Groupon before eating here (we didn't, and I regret it). All in all, our bill was about $150 before tip (one whatever beef selection the boyfriend chose - didn't really pay attention considering raw meat makes me gag - one veggie selection (which was not worth the $40 considering it consists of four cubes of tofu, two baby carrots and a few mushrooms, onions and peppers, and I didn't even touch the dessert platter with the exception of the strawberry. Yes. THE strawberry. As in ONE. and two glasses of champagne.) They bring out about 8 different sauces to share, but I honestly wasn't impressed with any of them. I could either make my own, or purchase better quality sauces at the grocery store. Cheese and bread app and dessert included in price, but again, just not really worth the price. <br><br>Fun experience, but not worth the $$ or the cramped space. I think I'll be purchasing my own fondue pots and keeping date night at home next time.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Oic2IlIIiGfMjwqOoFUQIA/168s.jpg", "caption": "Super cramped space, glad I didn't use too much hairspray!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4jTSe4bsCIQ2n785hFgSSw/168s.jpg", "caption": "Flames for the DIY s'mores with the dessert course."}]}}, {"review": {"des": "I have been coming here since 2005 and this place never, ever has let me down. I really dont get how anyone could give this place a negative review. To be truthful, they haven't changed their decor or approach much in the years I've been coming here, but it works for this place. <br><br>The ambiance is just adorable. The lighting is always dim, with faint classical music, and I'm assuming that's why it's rated \"the most romantic restaurant.\" The staff is pretty friendly; they do an excellent job of explaining the dishes and the process for cooking the food items. <br><br>There are several selections here that I find incredibly good. They do have gluten free options as well as the option to switch from an oil cooking base to a broth cooking base.  If you are a meat lover (like me) the Prince Geja's Combo is the item of choice. This includes lobster, scallops, chicken and beef tenderloin. If you're less of a carnivore, they have a vegetarian option with tofu, an assortment of veggies and potatoes. All their entrees coming with a cheese fondue and a dessert fondue before and after. The cheese fondue comes with fruits and breads, and the chocolate with fruits and marshmallows. <br><br>For parking, you can either find parking on the street (not always an easy feat in Lincoln Park) or utilize the valet service (my personal suggestion).Only downside to this place is it can get VERY crowded. The tables don't exactly have a lot of space in between them unless you book one of the smaller booths, so if you do book in advance and want a small intimate evening, I'd contact them and request that.", "pics": null}}, {"review": {"des": "I came here with a Groupon, and I don't think I'll ever be back. <br><br>I'd heard so much about Geja's for years -- it's \"the most romantic restaurant\" and \"the best fondue.\" Neither claim really seemed valid after coming here and seeing it for myself. The restaurant doesn't seem romantic, just dark and outdated. And the fondue was about on par with chain restaurant The Melting Pot. Both of these aspects were rather average, but the service is what really tipped our meal on the negative side of the scale. <br><br>From the hostess to the waiter, everyone was just really rude. Even with a reservation and coming at an off-peak hour, we were seated at this bizarre table that was one-sided. My boyfriend and I sat next to each other facing everybody else in the restaurant. I felt like I was on display! When I asked to move tables, we were denied. <br><br>Our waiter was practically absent the entire meal except for the few rushed seconds when he dropped food off at our table. He preferred to chat with coworkers behind the bar rather than answer my questions about the menu or refill our waters. The restaurant was literally over half empty. There was no excuse. I had also heard good things about Geja's and gluten free, but when I asked which sauces were gluten free he seemed annoyed. I never got a response as to which were safe. Then, he even refused to replace my skewer after I saw him drop it in a plate of bread. And I just asked super nicely if I could just have a new one!<br><br>In the end, we paid over $80 AFTER the Groupon, and I left feeling less than pleased. I'll get my fondue fix elsewhere, and would recommend others do the same.", "pics": null}}, {"review": {"des": "Clean and excellent service from the time entered the restaurant! First time here so I enjoyed cooking my own food. Portion size look small but fills you up. Booths have a more romantic atmosphere!", "pics": null}}, {"review": {"des": "Favorite date spot I've been to in Chicago yet. Really cute, cozy, and dark romantic feel. Very unique experience and great fondue sauces and ingredients.<br><br>I got the Prince Gejas Combination and my wife got the Steak and Lobster. With these combos, you start with a salad, then get cheese fondue with grapes, apples, and a variety of different breads. Then with the main course you get the meats you selected and a variety of veggies to cook in hot seasoned oil. It was such a fun experience. Finally, it ends with chocolate fondue with pound cake, fruit, and s'mores ingredients.<br><br>Special occasion place and will definitely be back!", "pics": null}}, {"review": {"des": "5 stars for atmosphere, guitar music, and service. 3 stars for value. Loved the atmosphere. We had a Groupon so it made sense. <br>FOOD: we had the package for @$55 pp. <br>first course- cheese fondue which had a good flavor but was gritty-not the smooth texture I was longing for. <br>The mixed platter Vegetables, Shrimp ( 2 ), lobster ( 2 bite size pieces), steak ( 2 bites), chicken. Most of the platter was chicken and peppers. Disappointing for the price. <br>Dessert: chocolate fondue: great rich flavor, but the consistency was a bit watery and did not cling to  the fruit. I recommend getting a coupon or just have an ala carte dessert fondue.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aXzpzXqQPJoPx3ZQqUyq_w/348s.jpg", "caption": "Outdoor fire pits. Really nice."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ecDrmGOSlpZ8T7aaW-lsuw/168s.jpg", "caption": "More sauces than meat. Wasteful."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EQlJfaYUXkHdWOmZdPlGAg/168s.jpg", "caption": "Spanish guitarist. Very relaxing."}]}}, {"review": {"des": "I have decided to rename this restaurant to \"undercarriage\" . <br>Let's start with the horrific smell that hits you as you walk down into the pits of darkness and stank. <br>Everything is red, red lights, red lanterns, red despair. It's so dark the wait staff use flashlights to \"try\" and explain the menus, and how this whole nightmare works. Now, I am allergic to shellfish, my bad, for not looking at the menus prior to going, because most of the food that you get to cook yourself in the hot little boiling oil pots on your table is shellfish. When I asked the wait staff if the oil was fresh and there could be no way that I would cross contaminated, he states \"I am pretty sure, almost 100%\" well that's great! Because \"almost 100%\" won't save my life. God forbid that I actually need medical assistance in this place. There is NO ROOM between tables to barely walk! You are sitting so close to the other tables. This place is a death trap! God forbid a fire happens here, which is very likely with all the hot oil, open flames and tight quarters. If you are at all Claustrophobic do not go! <br>I just can't imagine paying those prices to cook my own food. Also, who boils steak in hot oil? It's so dark you wouldn't be able to tell if it was fully cooked. That's scary when you are trying to make sure your chicken isn't raw. <br>It was like I was trying to dine inside of a uterus, tight and red,  and the smell was similar to what you would imagine an 800 lb vagina would smell like. Yes ... that bad. <br><br>Needless to say, if my  (a) boyfriend would ever propose to me in a skanky vag, I would say no. We were told this was the most romantic restaurant in Chicago. Looks like we will be headed out of state for romance if that was our option.<br><br>Bottom line, we left. <br>When we got in the Uber, the driver stated that we didn't stink like most people that came out of there. What?!  Gross. <br><br>It was bad.... just so bad.", "pics": null}}, {"review": {"des": "When the kid's sleeping over at your mom's and you get a free date night, why not try the place they call \"the most romantic restaurant in Chicago\" right?<br><br>It was pretty easy getting a reservation for Friday night dinner on only a few hours notice - so points for that. The room is definitely unique - very cramped but they manage to create privacy with lots of walls of wine bottles everywhere. The server and busser were both great - highly interactive and very knowledgeable.<br><br>The only things that keep me from making this a 5-star review are the fondue oil (come on - it's 2018 can we have some broth alternatives like the other fondue places have), and the selection of cheeses and proteins which were both very limited (only one cheese fondue recipe, and maybe 6 or 8 proteins). The food quality was high, but if you're experienced with fondue you're going to want more choices.", "pics": null}}, {"review": {"des": "My fiancé and I came here for our five year anniversary and loved every minute of it. He's actually not from Chicago, I am. So when he looked for a place for dinner reservations, he googled \"most romantic places in Chicago\" (lol) But, google was right! This is definitely the most romantic spot we've ever been to in Chicago. From the romantic lighting to the live guitarist, it sets the perfect ambiance.<br><br>Now neither of us are wine connoisseurs so we're not particularly picky. So if you're not either, I can tell you that getting a bottle is more worth getting a glass. Speaking of deals, there's often a Groupon promo, so check that out before you go!<br><br>For the entree we both chose the Prince Gejas  Combination. It comes with a little of everything - chicken, steak, lobster tail, scallops and shrimp. The first course is their cheese which comes with an assortment of breads, grapes, and apple slices. I really liked the combo of cheeses they put together - a very unique flavor! Then comes the tray with the proteins and vegetables. The waiter was very informative and explained what amount of time everything needed to be cooked. My favorite part is that it comes with so many sauces on the side! I LOVE sauces and these sauces were SO, SO good. The waiter even told us what sauces go best with which protein. You think that there isn't thatttt much meat or seafood on your plate initially, but trust me, you get full from what's on there! We barely had room for dessert which was strawberries, pound cake, rice krispies and then some with melted chocolate.  It was all delicious and made for a great anniversary night!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/S1JHG9hV4uvtPlkc2JfAhA/348s.jpg", "caption": "For dessert - melted chocolate served with strawberries, marshmallows, Rice Krispies; and pound cake"}]}}, {"review": {"des": "s0 romantic. But honestly you could do a girls night here it's adorable. I've never been to fondue before so I kind of floundered my way through this experience. <br><br>Decor is rustic and dimly lit - the booths look really adorable, I would try to get seated in one of those if you can.<br><br>We did the veggie delight meal which includes a salad, cheese fondue apps, veggies to cook in oil, and finally chocolate fondue for desert. <br><br>Salad: was okay, dressing was nice but nothing to write home about.<br><br>Cheese fondue: omg this was delicious. I think the waiter said it was gruyere cheese with a mix of other things. We wanted to take a bath in this it was so good. It tasted so good with grapes and apples. It also came with bread but I'd recommend asking the waiter to give you more fruits over bread.<br><br>Veggies in oil: this was also really good. They gave us an assortment of veggies like broccoli, mushrooms, carrots, bell peppers, potatoes, onions, and tofu. After frying them, you can dip them in 8 different dipping sauces. I forgot how good fried veggies are. I'd recommend asking them to give less tofu, bell peppers, and potatoes and get more onions, broccoli, and mushrooms. <br><br>Chocolate fondue: We were so full at this point but how could anyone say no to chocolate fondue. I ended up putting a buttload in my decaf coffee and making a ghetto hot chocolate. <br><br>The waiter also recommended a really good wine to go with the meal. Service was great.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Wqpv9yW5didN7SXQobSBdw/348s.jpg", "caption": "whipped cream, coffee, and stuff to dip in Flaming Chocolate Fondue"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vJ_ATDzU9qFkokiZ9IlAaA/168s.jpg", "caption": "Fruit and bread to dip in Cheese Fondue"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_WktqKKkEUUIbNLaJAVz6w/168s.jpg", "caption": "Veggies cooking in oil"}]}}, {"review": {"des": "I went on a Wednesday with a Groupon I had for the restaurant. This is a nice fondue restaurant on the north side that is a must try for fondue lovers in the area. The restaurant has an intimate setting and is a good spot for couples. We got a Geja's salad to start and it had a nice tasting vinaigrette on the salad. So good start. Next up was the cheese fondue with the bread and the fruit. Very good. Next up was the entree options. We got the prince geja's combo and the connoisseur. Both delicious options with the shrimp,vegetables and chicken. The final part of the meal was the chocolate fondue with the desserts. Everything turned out well with the meal. Our server was great and checked on us frequently and gave suggestions on different dishes. Pleasant experience all around. I will be back.", "pics": null}}, {"review": {"des": "I've been coming to Geja's Cafe since I was a kid. It has always been consistent. Consistently charming. Consistently friendly. Consistently decadent. Consistently fresh and delicious. <br><br>We ordered the connoisseur, which includes cheese fondue, salad (please stop serving the salad, it's a bit of a throw away), main course of beef, lobster, prawns, vegetables, sauces, and the chocolate fondue for dessert. <br><br>It's been a few years, probably about 8, and I've noticed some changes. One disappointing change was the drawn butter was changed to garlic butter. The butter was not fresh. It did not have a bright garlic flavor. Each bite I took with this butter was jarringly unpleasant. I wish I had asked about the drawn butter- no need to mess with a classic. I couldn't tell if it was the stale garlic butter or the lobster itself, which wasn't as flavorful as usual, that made the taste lackluster. <br><br>One successful change was the addition of the graham cracker crumbs to the dessert! Why hadn't they thought of this before?? Perfection. <br><br>Our server was very lively and fun. Overall it was a good experience but not consistent with the previous excellence.", "pics": null}}, {"review": {"des": "Came here for an anniversary dinner, and it was fantastic. The vegetarian option was an awesome assortment of veggies and tofu, we both ate way too much, and the atmosphere made us feel both fancy and festive. Will definitely be angling to go back for our next anniversary...or some random Tuesday, just because.", "pics": null}}, {"review": {"des": "It recently came to my attention that I never wrote about my experience at Geja's last year and world - this review needs to be written: <br><br>First it must be noted, this was my very first time dining in an actual fondue establishment. And thanks to my lack of knowledge of fondue, and to my naive ideas that fondue was simply melted cheese and chocolate, and that's it - I was a bit surprised that oh-no, you are making your entire meal consisting of plain raw meat and basic veggies, in a tiny pot. <br><br>However, before I cover that sad realization, let me first go over the actual layout of Geja's. When the restaurant mentions \"intimate space\", what they really mean is expect to be shoved in the back by the diner behind you every time they get up, or when they choose to exhale. Then be open to including the diners to your side into your conversation since they're pretty much seated with you. In other words, this place is cramped. But it should be said, this place is beautiful and definitely romantic. <br><br>Initially when we were seated, I thought we were rather lucky since they put us directly next to a empty chair perched on a box, so the only neighbors were to my right and behind. I foolishly placed my purse on this box. I would soon regret that decision, for the flamenco guitarist that I wasn't aware of at the time would not appreciate it. <br><br>After going over the menu and quickly placing our order (which I definitely let the BFF take care of due to her senior knowledge of fondue), the waiter brought out the anticipated cheese, grapes and stale, crusty bread. The cheese was pretty wine-y, but my enthusiasm for the experience overshadowed the taste. <br><br>The happiness stopped after that point.<br><br>Our server then brought out the raw chicken, onions and peppers that we were to prepare ourselves in a pot of oil. Holy shit, queue the disappointment. I'm aware this is not the fault of the restaurant, but for how much this meal costs, I cannot believe people actually pay to fry their own plain chicken and then dip it in very, VERY basic sauces. <br><br>While fishing for my food, a very disgruntled guitar player arrived at his perch and told me in a very rude manner to move my bag. Of course I obliged out of embarrassment, then awkwardly placed my purse on the floor, since placing it on my chair wasn't an option nor was the table. <br><br>While the guitarist started strumming his dramatic solo, my friend and I had to then raise our voices in order to continue our conversation. I'm not sure how much time had pass before he abruptly stopped playing and once again rudely told us to lower OUR voices. <br><br>Are you fucking kidding me. <br><br>We did not just pay $150+ dollars to cook our own basic chicken, be shoved in the back every few minutes, and then made to feel like assholes by a grouchy old man, because we had no other choice to raise our voices in order to hear one-another. <br><br>NOPE. Never again. I feel like the Melting Pot would be a better experience then this place. And if you really want to spend this kind of money, take it to a restaurant that caters to you, rather the other way around. No restaurant musician should ever make anyone feel the way we felt, or serve food that you can easily spend a total of $10 for from the grocery store and prepare at home in your own hot pot of oil.", "pics": null}}, {"review": {"des": "I love Geja's and always have. I'm a big fan of fondue. And this is a wonderfully romantic date spot. Or it can also be good for bringing your parents like I've done. Reservations are pretty much essential. It's on the small side, so it can be a tight fit. But it's still intimate and romantic. This is absolutely nothing like the Melting Pot.<br><br>The service is fantastic. The servers are friendly, knowledgeable, and they never rush you. I recommend going with a wine flight that's paired with your courses. You can do a full, typical meal of three courses - cheese, meat/seafood, and chocolate (it also comes with salad). Or you can choose just cheese and chocolate or some other combo.<br><br>The cheese fondue was really yum. For the main fondue, we opted for beef tenderloin, lobster, and shrimp. It also came with lots of veggies and, of course, 8 dipping sauces. My only two thoughts here: bernaise would've made a great dipping sauce and I would've like more beef. But neither are really complaints. And, of course, the chocolate fondue was delicious too. <br><br>Basically, I have no complaints. And I'll always want to dine here every time I'm in Chicago.", "pics": null}}, {"review": {"des": "I have never experienced a fondue restaurant and have always wanted to.  The atmosphere is calming, enjoyable and romantic.  The staff  as very helpful and explained everything for us newbies.  The prices on their own may seem pricey, but you are getting a full course meal. I could not finish all of my food. I would definitely come here again.", "pics": null}}, {"review": {"des": "Went her with my bf because we got a Groupon and a friend recommended. I'm definitely glad we went but I don't know if I would go again. It was a great Groupon deal. We opted to do just cheese and chocolate fondue, but they do have food that you can cook in a fondue pot. It's a very romantic place so definitely go here on a date. We split a bottle of red wine that was good and reasonably priced. The cheese fondue was good but the bread that came with it was just ok. The chocolate came with tons of stuff to dip which was fun. If you're a fondue fan or looking for a cozy date spot I would definitely recommend but it's not like the food is gonna blow you away. Good excuse to drink red wine and liquid cheese though.", "pics": null}}, {"review": {"des": "The dinner felt oddly impersonal, like they are just trying to get as many people in and out as possible. The dinners come with only one cheese fondue option, one chocolate option and one oil option for entrees. The proteins of the entrees are sparse (especially given the price)- the plate is loaded with vegetables. Our server was nice and dessert was very tasty but I've certainly been to better fondue spots", "pics": null}}, {"review": {"des": "My fiancé and i have been going here for years. When we've gone to celebrate a milestone, the staff is always friendly and goes out of their way to celebrate with us. The food is wonderful and the ambiance is amazing. We love eating here every chance we get. If you're interested in trying Gejas, join their mailing list because they always have coupons! We cannot recommend this place enough!", "pics": null}}, {"review": {"des": "While not as high end as I remember, it is still worth a visit. We had great food, excellent wine suggested by our server, and wonderful service. The ambiance makes for a cozy and inviting feel. We were pleasantly surprised by the wine prices being 50% off, so we were able to afford two bottles for the table. We went with our daughter and son-in-law who had never been before. We all had a wonderful time.  This is not an inexpensive meal, but a nice change from a more traditional restaurant setting. Valet parking is the way to go as street parking on the area is almost nonexistent.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Jiw_zL7Obi-I4ITSOXdOfA/348s.jpg", "caption": "Celebrating Matt and Elena"}]}}, {"review": {"des": "I tried this cheese fondue here twice. It is so good-u can taste the nutmeg. I finished it by myself and my boyfriend only had a couple bites. Love the romantic atmosphere. I just bought a groupon so I can come back here with a friend. Looking forward to it!", "pics": null}}, {"review": {"des": "Geja's is delicious. You seriously can't go wrong with fondue. The cheese fondue is a bit grainy and isn't my favorite but everything else is awesome. The bar was slow so we kept getting our drinks like 10 minutes after we ordered them. But the fondue process is slow so not a big deal. Getting to roast your marshmallows while the chocolate gets hot is my favorite part. <br><br>NOTE: They always have a groupon going so make sure you buy that! It'll save you a ton of money.", "pics": null}}, {"review": {"des": "This is the 2nd place most romantic place my boyfriend and I have been to. My boyfriend and I came here last night. We had a reservation for 8:30 and we called to tell them we were running a little late. 10 min later When we came in we were greeted and guided to complimentary coat check. Then walked us to our booth which we requested ahead of time. And our waitress explained the menu, and suggested her favorites and most popular food options. We used a groupon and they didn't have any food restrictions. We were the last ones to leave but never felt rushed. Customer service is excellent.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LtWjNbYitcrRFVNgcWS4Fg/168s.jpg", "caption": "Desert."}]}}, {"review": {"des": "Went here the other night with my boyfriend and it was an amazing and long dinner. Came in a little late & without a reservation but they made room for us.. the food and ambiance were both amazing. We loved the live music. Really a romantic experience, we will definitely be back.", "pics": null}}, {"review": {"des": "This place is amazing. One of the coolest atmospheres in a restaurant I've ever seen. Food was so good. I want to tell people about this place because you would miss it if you were walking by. Definitely go on a special occasion it's worth it. Little pricey but a ton of great food and great service. The house wine was great as well.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UVNZUa6r2BcHFQb-DaabPw/348s.jpg", "caption": "Great atmosphere. The temperature was great even with all the flames on the table."}]}}, {"review": {"des": "Even with a coupon, money better spent at FONDUE STUBE & IF YOU WANT TO SPEND 100+PER PERSON even with a coupon!!, GO TO GIBSONS, BAVETTES..been here many times, this time, last monday, bartender made short drinks, and made a mimosa with about 5% champagne when it should be 50%.  Portions are small service is good, drinks are small (they use oversized ice cubes) or made wrong, and the place needs an update as it is beat up....been here when it was good.  For good value and good fondue, go to Fondue Stube on peterson instead!", "pics": null}}, {"review": {"des": "A small but lovely restaurant! I came with a Groupon that was $25 for $65, and my mom and I were allowed to share one portion of the premiere dinners since they give you a lot of food. The cheese fondue comes with apples, bread and grapes. The Chocolate fondue came with marshmallows, Rice Krispies, cake, apples, pineapple, strawberries, a cherry and crushed graham crackers. The food was delicious and you cook the steak and lobster the way you like it. The staff were lovely as well. I definitely would come again!", "pics": null}}, {"review": {"des": "I have never been to Geja's cafe this was my first time. My husband took me for my birthday dinner and I absolutely loved it!!<br><br>At first when we pulled up I was kind of set back as to the location I'll be honest,but as you walked up closer it was really nice. <br><br>The waiter was very attentive asked if there were any allergies,and I am allergic to seafood so they made sure to separate my fondu from my husbands so we each had our own for the main course. <br><br>The starter with a platter of breads, grapes etc was decadent with the yummy melted cheese. <br><br>Our main course was beef for me, and my husband had beef and lobster. Along with the veggies,and potatoes. It was a fun and interactive date. We enjoyed some fresh mojitos during dinner   Those are a must !!<br><br>Dessert ... save some room bc your course comes with it!! We were stuffed but we sure made some room for chocolate with fruit,cake and lots of yummy treats. <br><br>The price was fair for a nice little romantic date night. I was very impressed that he finally picked a place without telling me to make reservations where ever I wanted to go. Lol", "pics": null}}, {"review": {"des": "Not impressed. Come for everything but the meat. Don't waste your money on any meat or fish. No flavor it's very bland. The dessert and cheese is the only part I found worth it. <br><br>Named most romantic spot in Chicago because it's so dark and each seating area feels like you're in your own world. Not bc of the food. I felt like I wasted money. <br><br>And that's all I have to say about that. <br><br>Jackée", "pics": null}}, {"review": {"des": "i liked the ambience but price is too high for a meal. definitely get a groupon. Indoors because of the oil and burner fumes, there isn't good ventilation. the whole time i was thinking about leaving and getting some fresh air. it's good for a special occasion. Mon - thursday is a great groupon deal day.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/th3h2wGh2JyCnKa1TXijfA/168s.jpg", "caption": "fondue"}]}}, {"review": {"des": "Cons <br><br>- The place was dark and smelly. <br>- Server didn't teach new customers how to fondue. <br>- The advertised classical guitarist was not there that night.<br><br>Pros<br>- Food did taste well enough <br>- Experience was okay for a first time", "pics": null}}, {"review": {"des": "Super romantical! :p<br><br>When I was younger, going to fondue restaurants was like THE date spot. Now the idea of dropping $150 is not super appealing when I know I can make the same feast at home or go somewhere amazing for the price. <br><br>Trying to put that aside, I saddled up for dinner at Geja's. They have valet or you can find street parking depending how late you are for your reservation (harhar). While waiting to go inside or be picked up, you'll find a warm bonfire outside to cozy up to.  <br><br>Once inside the restaurant, it's dark. Way darker than a sexy ambiance dark. It's I-can't-read-the-menu dark. Our service was decent throughout the meal but not what I would call very friendly or attentive - just kind of got the job done.  Tables for two are small and cramped with things barely fitting on the small surface. We were next to a mirror and it was kinda gross having the oil splatter all over the mirror. However it was fun sitting super close to an adorable couple, probably on their third date-ish and listening to things transpire. Ahhhh, the joys of eavesdropping.<br><br>All that aside, food was good. Meat and vegetables are just that and their sauces are pretty money. You'll leave completely stuffed to the brim and satisfied.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1Ei91JXBvzZy2sA--aQOww/348s.jpg", "caption": "Insanely dim lighting inside...menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/opbBUIweOtdsdg7WN7gafw/168s.jpg", "caption": "Cool firepits while you wait"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xfj_gYJpUlc3H4B2CzZTBQ/168s.jpg", "caption": "Outside signage"}]}}, {"review": {"des": "I came here for my bff's birthday celebration with a Groupon. The restaurant is very romantic, very quaint, extremely dim lighting, we used the light on our cell phones to see the food, just to make sure the meat was fully cooked. Thursday is half off sangria pitchers, not a bad deal. The cheese sauce had a very strong beer taste, I did not mind, I like beer and the taste of it, but the sauce was a little gritty tasting, it was not a good mouth feel. I had the seafood selection, lobster, shrimp and scallops, which is served with vegetables and several dipping options, garlic butter, teriyaki, horseradish and spicy habanero or jalapeno sauce and potatoes and you cook all of that in oil. Once the food comes out the grease, it has no flavor and you have to dip the bland food items in one of the aforementioned sauces. Not a huge fan of the bland meat and vegetables. Lastly, the dessert, the chocolate fondue, it comes to the table flaming, (they pour orange liqueur on top of the chocolate and light it on fire), so you can roast your marshmallows and make \"smores\", (you are served graham cracker crumbs, I was fine with the crumbs). I had just enough time to roast 2 marshmallows, then the flame went out, now the chocolate taste like burnt orange and you dip rice krispy treats, strawberries, grapes and pound cake in the burnt orange chocolate, not a huge fan of the chocolate either. Street parking was pretty easy to find, but they do offer valet parking. We had a reservation for 7:30 and did not leave until after 10, be prepared to stay a while.", "pics": null}}, {"review": {"des": "We were in Chicago for a short vacation and decided to head back to Geja's to reminisce over having been there over a 18 years ago. Not much has changed, which is great help in putting yourself in the same place many years earlier.  The menu is the same, ambiance is the same and the food is the same. Great place for a fun experience-style dinner done in a classy way. I would give it 4 stars, but i was really disappointed with the cheese fondue. It was grainy and was really quite forgettable. I've made cheese fondue at home and have had it other places and I'm not sure what happened here, but it just wasn't right. Too much corn starch?  Seemed like powdered cheese. Overall it was a fun evening, but I don't think I'd go back due to the cheese fondue.", "pics": null}}, {"review": {"des": "My wife and I dine at Geja's about 4 times a year. We find the food to be excellent and a good value. Be aware that Geja's is very active on Groupon and you can usually find a deal making the experience an even better value.<br><br>Do yourself a favor and order all of the courses---I suspect that many including us, believe the cheese is the single best part of an excellent meal. The cheese is consistently delicious accompanied by assorted fruit (grapes and apples) and bread. If you find you have extra cheese, you can ask for additional bread. <br><br>For us, dinner consists of scallops and chicken along with vegetables and the dipping sauces. The dipping sauces add a great touch to the protein of your choice and vegetables. The dill sauce is simply outstanding. The quality of all the sauces is excellent.<br><br>The dinner service ends with a chocolate fondue and an assortment of fruits (strawberries, pineapples, apples), marshmallows, rice krispie treats and pound cake.<br><br>A couple of recommendations---be sure to use your phone to time how long food is cooking. Don't just randomly put food in the oil or you'll run the risk of undercooking some food and overcooking others. Finally, be aware that you'll like leave with the smell of cooking oil so be aware that washing your clothes upon returning home is probably a good idea. <br><br>All in all, enjoy your visit to Geja's--the food is well worth the cost.", "pics": null}}, {"review": {"des": "Nice experience here. The restaurant was quaint with a nod to a very European style setting. I can see why it's rated the most romantic in Chicago. The variety of fondue was great, and I loved the aspect of cooking our own meats right at our table. It definitely set this restaurant apart. We got a couple of the 4 course meals (salad, cheese/bread fondue, beef and chicken with veggies, chocolate/fruit fondue for dessert) and it was fun combining all of the different foods. Awesome cocktails and wine here as well! <br><br>The only reason I knocked off a star was because it was almost pitch black inside. We couldn't read the menus or really see any of the food without the source of our phone's flashlight. I understand the romantic appeal that a candlelit dinner vibe brings, but being so dark that we can't see isn't fun.", "pics": null}}, {"review": {"des": "My spouse and I absolutely love this place! The manager always comes by and does a table touch, the food is always delicious and the ambiance is always PERFECT!!! Thank you Geja's for always presenting a great dinner.", "pics": null}}, {"review": {"des": "This is a place where you go on a special occasion, like an anniversary. It is SO romantic, with rustic decor and VERY dim lighting. It was definitely hard to read the menu by candlelight, so I needed to use the flashlight on my phone (showing my age haha). <br><br>We did the dinner menu, and started off with the cheese fondue. There was a variety of food, such as grapes, apples, and bread to dip into the cheese, all of which were great! Next we had a side salad, which was lettuce and little else. They put the dressing directly on the salad, and don't have an option to have it on the side which sucks. <br>Next, we did the meat fondue. He got beef and shrimp, and I got chicken and scallops. Since it was so dark, I was a worried about our food being cooked all the way through. There were 8 dipping sauces, all of which were amazing. The Sriracha sauce was the best one I think! <br>Finally, the chocolate fondue was the highlight of the dinner experience with strawberries, marshmallows, rice krispies, etc. <br>I would only come here for very special occasions, because $150 for two was a little intense.", "pics": null}}, {"review": {"des": "If you're reading this, you probably have a decent idea of what fondue is about. So here are some notable things about Geja's. It is very dimly lit inside, the service is great, and it's a little pricey. Id recommending checking out Geja's and other similarly priced fondue places if you're looking for an experience. The meal itself is pricey, but if you consider the entertainment factor, it's worth a try! We had so many yummy courses, the cheese fondue and the chocolate fondue were my favorites! There were a few courses and so much food. We had so much left over after each course! I wish they would have offered to box up some of the vegetables, bread, and fruits that you don't finish, rather than quickly clearing everything away for the next set up. Food waste is such a problem and perhaps I wouldn't have over ate if I knew I could bring home the broccoli, onions, and mushrooms to make a nice stir fry. Final tip- ask for a second marshmallow to toast over the chocolate flame! It's sooo yummy and such a good treat!", "pics": null}}, {"review": {"des": "Hands down awesome place. Autumn the hostess took super good care of us and wait staff was even more superb! Great people all around. Thank you!", "pics": null}}, {"review": {"des": "Not really impressed with Geja's. It is pretty though. <br>We went there with a Groupon, and I was excited to go after hearing and reading all positive reviews. The only negative ones I could find were that it was expensive. Well it was expensive, but only considering the quality of the food. <br>Maybe I'm just not a fan of fondue, but the food just wasn't really good. You have to cook it yourself, and watch the time (I guess with your internal clock?  Stopwatches aren't so romantic).  <br>We had the bread, grapes, apples etc in the cheese starter. It was different, and she liked it, but I didn't care for it. The main course of beef, chicken, and vegetation were all pretty boring. They bring you 8 dipping sauces, but rather than letting you choose, they just give you some that you might not want, and then you're trying to remember which one was which. The dessert was good, but what dessert isn't really, lol.<br>Oh, and don't go for drinks other than wine. My old fashioned might have been the bartenders first attempt at making one, even though it's on the menu. <br>I'm sorry for such a rough review.  I know many people really love this place. I'm just not sure if they've dined anywhere else in Chicago for comparison.", "pics": null}}, {"review": {"des": "Geja's is definitely on the more expensive end in terms of dinners, but it's one of my favorite places. First off, I highly recommend the groupon to save some money on a week-night. Make a reservation, I always have so I don't know what it's like if not. It makes for a fun evening dinner. Generally, I and other people take on the present meal because it's simple and cheaper than individual portions. Starting with the cheese fondue we love the fruit and bread to dip. I could definitely fill up on this, but the next two courses are still to come. The second course brings you your choice of protein and some veggies to cook in a hot vat of oil. The array of sauces are so fun to try and make plain meat so tasty. Finally, enjoy s'mores on the flaming chocolate fondue before indulging in the dipping dessert. I have always had an incredible experience here and highly recommend it for a fancy evening with friends or romantic celebratory dinner.  (On my birthday I got cake and anniversary (Lesbian-friendly experience, can't speak for other lgbtq) got a cute card. It's fun to dress up a little bit but don't stress too much about dress as long as you're put together since it's pretty dark in the restaurant which is the only downfall of the place.", "pics": null}}, {"review": {"des": "Hated it. Ambiance and service A+, hence more than 1*. Food was nothing worthwhile and portions were incredibly small. We must have paid for the liability insurance more than anything. If you like to eat food, don't go here.", "pics": null}}, {"review": {"des": "Very romantic place and can't go wrong with fondue. It lived up to the hype in my book.", "pics": null}}, {"review": {"des": "Was such a fun experience! Make sure to check out Groupon to save a few bucks. You can pick from just about any protein. We loved the scallops and lobster. You also can go and just order cheese and chocolate fondue for a faster experience. It's very romantic, but also very dark. The rum martini and mojito were also amazing. Takes about 2 hours to eat so don't plan on a quick bite.", "pics": null}}, {"review": {"des": "We came for our 15th anniversary. The atmosphere was great. But besides that, the food was not good.<br>The cheese fondue came as a starter and really felt like it was fake cheese powder out of a box. We have been to plenty of fondue places, and this is never how cheese fondue is presented. Other places always bring grated cheeses at the table and melted in front of the customer.<br>Also i notified our server of my pine nut, fish and shellfish allergy and he took it very lightly. He brought the cheese fondue made with nutmeg in it.<br>He also brought the platter of veggies with the sauces on it, one sauce being made with anchovies. <br>Finally, the chocolate fondue was not from good chocolate and choices of dipping items were limited.<br>We were disappointed with our choice to celebrate our special night.<br>They need to up the quality of their foods.", "pics": null}}, {"review": {"des": "We have never done anything like this so we were pretty pumped. I don't think I will do it again tho. We went here with some friends for dinner. It was so dark inside and so hot, it was at times hard to enjoy ourselves. The place is cute tho and the fire pit outside was pretty neat. Now on to the food. The cheese fondue was gross. The main meal was pretty good but NOT worth what we paid. $12 for a drink that had 1/4 cup worth of liquid. Ill pass. Yes, I saw the menu before we arrived but the portions were far less than my exceptions for that the price tag was. The wait staff was nice tho. I am glad we can say we tried it but this place wasn't for us.", "pics": null}}, {"review": {"des": "I always love going to Geja's. I love the decor, the live guitar performances, and the amazing cheese fondue! I already have recommended this restaurant to several people. <br><br>During our most recent visit, we ordered red sangria to drink (which were yummy) ,  vegetarian combo and the connoisseur. I love love and love the broccoli deep fried! The meal comes with several different sauces, my favorite is house made teriyaki sauce. <br><br>One \"not so good\" experience I had this time was that my husband accidentally spilled his glass of sangria and the waitress looked upset, when we apologized and thanked her for cleaning it up, she didn't say anything and didn't even look at us. Maybe she was having a bad day.<br><br>Tip: due to the restaurant's location (basement level),  the cell network does not work well so if you're using a Groupon, it'd be wise to print out the Groupon.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/H6pXudNNbxr6sg9tvaU7bQ/168s.jpg", "caption": "Chocolate fondue with marshmallow"}]}}, {"review": {"des": "Perfect place for a romantic dinner. If it wasn't so expensive I would come here more often. Groupon usually always has a deal so try that first.", "pics": null}}, {"review": {"des": "This place is so amazing and thanks to Groupon we were able to find this place during our short trip to Chicago. My girlfriend made a reservation for our anniversary at this restaurant and it was such an experience. This is a three course meal, which stars off with a cheese fondue as your appetizer. The cheese fondue included a variety of bread and fruit, which can be enhance with a quick dip to your melting cheese fondue. It was fantastic and the cheese has a hint of wine in it. So delicious! Second is your main course which you cook in a pot of oil. Such a great way to spend dinner with your significant others. Lastly, they end your three course meal with a chocolate fondue and a cup of coffee. Nonetheless, it was one of the most unique experience I've had in a restaurant. We spent almost 3 hours there. <br><br>This is great for an anniversary, birthday celebration or a significant event/celebratory event. It is a little pricey, but come through with a Groupon and have 45 dollars deducted to your final bill. Thank me later!", "pics": null}}, {"review": {"des": "My girlfriend treated me to this place as a birthday gift, and it was absolutely wonderful.  The food is amazing and the staff and server were very attentive and receptive to our needs.  My only reason for withholding a star was the wine service.  The list itself seems well thought out and provides an array of options but when I asked my server for pairings with my meal I was pretty disappointed with what she gave us.  She suggested a tasting flight of half glasses that my date and I could share and seemed to have intimate knowledge on the wine so I put my dining experience in her hands after explaining my likes and dislikes.  She gave me three types of Pinot Noir, two from the same vineyard, all American.  Of all the potential options on the wine menu she gave us the most basic to accompany an otherwise outstanding meal.  Would definitely return but I think next time I'll pick my own wine.", "pics": null}}, {"review": {"des": "I loved the whole experience here! It's very romantic!! & the food is delicious! I would definitely recommend this place for a birthday or anniversary.", "pics": null}}, {"review": {"des": "Geja's offers excellent fondue, and even better ambiance. If you're looking for an intimate, romantic place for a Tête à Tête, this is the spot. Be sure to ask for one of the booths, which are more like private little rooms.<br><br>The complete dinners here are pretty reasonably priced when you consider everything they include: a smokey cheese fondue appetizer, a French-style green salad, whatever entrée meats/chicken/fish/shellfish you select, and a generous chocolate fondue dessert.<br><br>Along the way your waiter will keep everything on fire and at the right temperature--at one point we had four flames going on the table at once, a record, I believe.<br><br>The wine list is really the only negative, as the choices are limited to fairly everyday wines at high markups.<br><br>Whether you're in the mood for fondue, or just a romantic evening, this is a good choice.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iVzq0DATDKjpxOxQsMnR-g/348s.jpg", "caption": "Geja's combinartion"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/B2FX4cnOUTdCPPiqYiyf4A/168s.jpg", "caption": "Interior"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qSc9rYfELsvAM_yQV_4lUQ/168s.jpg", "caption": "Exterior"}]}}, {"review": {"des": "Wonderful experience.<br>The cheese and chocolate fondue combo was perfect - it was so filling and delicious.<br>Very romantic environment. <br>Loved it there - will definitely come again.", "pics": null}}, {"review": {"des": "The ambiance is absolutely beautiful, it feels like you've walked straight into Europe. I knocked off a star because you can't share one fondue dish among multiple people, found that out on my birthday dinner with friends. I think that goes against the idea of fondue, but that's how they make so much money! It's worth going once, but go hungry and expect to spend money.", "pics": null}}, {"review": {"des": "My wife and I had a great experience at Geja's this evening. This was our second time there and we'll be back for a third soon. It's a little pricey but the ambiance, service and overall experience is worth the splurge every now and then. <br><br>I can't speak more highly of our waitress, Shannon. We had a groupon that wasn't able to be used due to the blackout dates (our fault for missing the fine print) but she handled it very professionally. We'd gladly pay full price to return back to Geja's due to the great experience we had this evening. <br><br>Thank you Shannon and the entire staff!", "pics": null}}, {"review": {"des": "Geja's is a really fun experience. Although the premier dinners seem pricey, you get a lot of food and you definitely leave satisfied. My fiancé and I went her for my birthday this year and it was so fun. I'd never done fondue before and our waitress was patient and explained everything we needed to know. <br><br>However, I wouldn't recommend this restaurant for large parties. Four people in the group is probably the maximum I would recommend. Also, make a reservation. Geja's gets busy and you want to ensure you get a table. <br><br>I really liked the scallops, I think they cook the best in the fondue. But I think the chicken tastes the best with all of the dipping sauces. The veggies in the fondue are tasty too!", "pics": null}}, {"review": {"des": "Boo took me here for birthday dinner. Super romantic place. Great for special occasions! You'll smell like oil/grease when you leave here though, but it's worth it!", "pics": null}}, {"review": {"des": "Need a romantic dinner with no kids around? This place is it. It's very dark inside, to a point you might question if they even clean the floors well haha. Get the Prince Geja's combo if you like seafood & meat. In my prior experience, my husband ordered Deluxe Seafood because he wanted seafood and I ordered Prince Geja's. The orders was the same amount of seafood except I had extra meat, which I ended up giving him because I felt bad I got more food. Dinner starts with bread, apples, and grapes with guyere cheese. Then you get your order with 4 fondue sticks, and 8 sauces. You can ask for more bread or sauces. You end with desserts (s'more to start, and I can't remember the rest because I was too full). The pitcher Sangria is ok, not the best Sangria I've had. I saw many tables with a bottle of mine; I'll try that next time.", "pics": null}}, {"review": {"des": "The food was lackluster, the service was slow and the wine menu was subpar. The experience was not worth the premium prices and the tables were tiny and incredibly close together. The setting was advertised as \"romantic\" but I beg to differ...also, due to the tight spaces, the fondue warming flame container was directly in front of my face, and my eyes were burning throughout the entire night...I will not be returning.", "pics": null}}, {"review": {"des": "Nice place and good experience. My overall thoughts were good. Dark romantic type place that you can enjoy with someone. The prices were on the high side. Don't get me wrong, the dishes they brought were a nice size but the quality sizing was small. It ranges from $45 and up for the fondues. <br><br>My wife ordered the seafood mix and I ordered the steak and scallops. Both plates together were about $100 but you got a huge plate of veggie and the steak had about 5 bite size pieces and 5 scallops. It was the same for the seafood. <br><br>It's a nice time and atmosphere was good with a guitarist playing in the back ground. Definitely a place we wanted to try and since we did, rather go elsewhere for the amount we paid.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LHgPgLNo7uICgYRNaFXsqg/348s.jpg", "caption": "Geja's cafe"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qjvawE5lu2-wylBl9hOOyA/168s.jpg", "caption": "Seafood mix and steak and scallops plates with veggies and sauces"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_oQaFrDbRvH_2kjZjtCO-Q/168s.jpg", "caption": "Chocolate marshmallows"}]}}, {"review": {"des": "I've been a fan for years . Can't believe how good it still is .   Service, food ambiance I'll be back again . Great job on the outside entrance seating area . I'll be back , Ben Hosek", "pics": null}}, {"review": {"des": "I've been wanting to try Geja's for years. My only other fondue experience has been at the Melting Pot, but I prefer to support local Mom and Pop type places when I can, especially when they've been around Chicago for years. After reading the great reviews I figured I was in for a solid meal. Although the food was alright, I feel we could have had a much better meal for a lot cheaper at another restaurant. <br><br>We had made a reservation days before but we were seated in the first table which is essentially behind the host podium and between two narrow aisles, so I spent the meal tucked as close to our table as possible trying not to get bumped. Being so cramped, you also had to speak loudly if you wanted to talk. The table next to us was so close that I didn't feel comfortable having any type of romantic or private conversation, it sort of felt like being at a work meeting before it had begun. Our server had a robotic personality and did very little to explain how everything worked, although we told him I had never been to Geja's and my date had never been to any sort of fondue restaurant. I suppose that added a certain exciting challenge to spice up the meal.<br><br>On to the food. You don't get a choice on the kind of cheese or chocolate fondue you get, which wasn't as fun. The cheese had a chalky consistency that I didn't mind so much but my date didn't like it at all. The bread dippers seemed a bit stale, my date said his lobster wasn't very good and my $38 vegetarian meal included baby carrots... something I wouldn't expect to see at a nice place (basically the reject carrots that get washed in bleach). I saw another review that complained about the vegetarian meal but I'm pretty easy to please and assumed they were just being a \"Yelp critic\".  Unfortunately, they were pretty spot on with their review. There was a nice selection of dipping sauces which we liked and the chocolate seemed good quality.<br><br>Really, the only part of our visit to Geja's we enjoyed was the guy who came to check on the fondue pots. He was able to answer the couple of questions we had after our waiter disappeared, and he was really friendly. I found every step of the experience to be lacking and uncomfortable.... I'm really not sure how so many people find this place romantic! Had we been seated at a booth it would have been more comfortable but I still would have been disappointed with the service and the meal.<br><br>We drank water and I got the cheapest meal and still spent enough to cringe when the bill came. All in all, a big disappointment. As we left, we gave each other a \"well, it was worth a shot\" look. Bummer... I was hoping to have a new spot for special occasions!", "pics": null}}, {"review": {"des": "I don't think it's worth it without a Groupon. I'm not saying that it's bad but it's not good enough to pay full price for. They skimp on the cheese fondue and chocolate fondue. Also, the baskets they give you don't have the best quality items but since it's pretty dim they can get away with it. Also, because the place is so small the smell of fried food sticks to you like crazy so we couldn't go anywhere else after which sucked. Your better off at the Melting Pot.", "pics": null}}, {"review": {"des": "I was taken here for a date and it was great!<br><br>The ambiance was beautiful- really dark, red lighting, sitting very close. <br><br>The food was great- seafood and meat selections were very fresh and the vegetables were very crisp.<br><br>The service was awesome too.<br><br>Would definitely go back for a special occasion!", "pics": null}}, {"review": {"des": "Very romantic. Geja's Cafe will undoubtedly impress your lady if you're taking someone out. It's dark and intimate inside, the wine selection is excellent and the food is very 'sexy'.<br><br>Typically you go for one the premier dinners which is served in 3 courses.<br><br>In the first course you're given a platter of bread and pot with a mixture of cheese cooking. You cook the cheese fondue yourself (don't worry you are guided through all the necessaries). The bread dipped in the cheese is heavenly! <br><br>Then the pot is replaced with a pot of oil and you are given a platter of meats and veggies based on your choice of dinner. The portions are not too generous and I felt I could have done with more pieces of beef and lobster and less mushrooms and potatoes. Still it must be said it was delicious! I will say however that it is so dark that you can't really see what you're cooking and you can easily lose your piece of meat in the pot.<br><br>The last course is a pot of chocolate fondue that you can dip different pieces of fruits in. Perfect way to end the meal. AGAIN, taste is amazing.<br><br>Apart from the lighting issue and the less than generous potions of the main course, some people say that there's this smell of oil that is always present. I didn't really feel anything of that sort.<br><br>All in all for about $50+ a person you get incredible food. Worth it? Be your own judge. Definitely warrants a try. Anniversary maybe?", "pics": null}}, {"review": {"des": "I always love this place was a little disappointed tonight.  I wrote a note in open table that it was my birthday and that we are also celebrating just getting married and they did nothing.  Beside that there was a 13 year old Birthday party there which is unusual but they were very noisy and load which the manager apologised twice but that was the extent of it.  When you go to a romantic restaurant and you pay a lot you expect quiet and kids.  The owner made everything right", "pics": null}}, {"review": {"des": "So many things to note about this place so let's start!<br>-This place is an EXPERIENCE. It's a 3 course meal and we were there for four hours. So, don't take someone who you don't want to be around for a good period of time.<br>-you cook the meats AT your table. Like...I'm still not sure how to feel about that. But they bring you out your meats and you cook them in the oil at your table. (If you're reading this Geja's, add some seasoning to your meats PLEASE)<br>-it's pretty pricey. This is like an anniversary or birthday dinner place, not just a random date night. <br>-the cheese fondue at the beginning is delicious, the chocolate fondue at the end is lowkey nasty. <br><br>In summary, would definitely go back but I'm wearing more comfortable shoes since I'll be in them for awhile.", "pics": null}}, {"review": {"des": "I took my boyfriend here for his 36th birthday and I am so glad I did. We had a great dining experience with exceptional service. Geja's lived up to it's reputation as Chicago's number 1 romantic restaurant.<br><br>I bought the Groupon to save $20 and made a reservation for Saturday night. We arrived a bit early so we sat at the bar and ordered drinks while we waited to be called. A must try is the cheese spread at the bar, absolutely delicious. The bar is relatively small and the bartender this evening was fabulous. We had requested a booth upon arriving as other reviews had recommended and the request was met. It was definitely worth it, especially for a more private and romantic dining experience.   <br><br>Our server was Mario, and he was exceptional from beginning to end. We ordered a bottle of sparkling wine to celebrate and Mario made sure our glasses were never empty. To start, I really enjoyed the cheese fondue, it was rich, creamy, and smooth. Geja's salad was also very good, I really liked the dressing. As our main course we both chose The Connoisseur, which included aged beef tenderloin, jumbo gulf shrimp, and succulent lobster tail. The meat and seafood were all very fresh, and delicious. As a sauce person, I couldn't have been happier with the selection of eight to choose from. After, my boyfriend received a birthday dessert and our server set up our chocolate fondue to roast our marshmallows. Pretty full by this point, so we just dipped a few items.<br><br>I have to say this was the ultimate fondue dining experience. We will definitely be back for another special occasion!", "pics": null}}, {"review": {"des": "My favorite restaurant in town. It's where me and my boyfriend celebrate special occasions! They have the best fondues and the red ambient is spectacular and very romantic!", "pics": null}}, {"review": {"des": "i've been here many times and i always enjoy it. Romantic place with a live instrumental music, good food and great customer service. Perfect place for a date . You better call before and make a reservation.", "pics": null}}, {"review": {"des": "I lived in Chicago for a couple of years, and this was one of my favorite restaurants in town. We usually went there for our anniversaries and other special occasions. <br><br>Treat yourself with the best cheese fondue you can find in town while sipping a delicious sangria in one of the most romantic restaurant in the north side of Chicago.", "pics": null}}, {"review": {"des": "Great fondue restaurant, my wife brought me here for my birthday...had a awesome time enjoyed the staff and atmosphere....", "pics": null}}, {"review": {"des": "I came here for an anniversary, which the hostess recognized right away, and even gave us a happy anniversary card. The atmosphere is very romantic with dark red-tinted light. <br><br>As for the food, the cheese fondue was delicious! Probably my favorite part of the whole meal. I then got steak and scallops. Both were very good, but I wished they had come seasoned. You are given 8 dipping sauces, which are good, but seasoning still would have made both the steak and scallops even better. Next, the chocolate fondue...also delicious! Very rich dark chocolate flavor. Overall, a fun place and the food was pretty good. I would recommend for a special occasions/romantic dinner!", "pics": null}}, {"review": {"des": "Treated like a VIP every time! I love you Geja's.", "pics": null}}, {"review": {"des": "My wife and I love Geja's. We always get there at least 2-3 times a year for special occasions including our most recent visit for my birthday. The food is fabulous and the experience is very enjoyable in a relaxing, romantic ambiance. Cheese is amazing - don't skip the cheese! Prices are very reasonable and they even send out email notifications when they are running specials. Wine and drink selection is great as well. The owner is very kind and pleasant and so is the staff. We always look forward to our visits and can't wait to go back!", "pics": null}}, {"review": {"des": "Thank you Groupon, you are bae!<br><br>So, we've been here twice, my partner and I. Luckily, because of groupon, otherwise I don't think we would ever be able to afford to step foot into this place. Seriously. It is extremely romantic and the upscale prices remind you that you better enjoy your time here. <br><br>The first time we went, we had a nice little trifecta of fondue: appetizer(cheese fondue, bread squares, grapes), meal(shrimp, beef, chicken, lobster, fish and a medley of vegetables to be fried in the oil), dinner(chocolate fondue, bread squares, marshmallows, strawberries, and crumb toppings). This entire process took a while, but it was extremely delicious, and surprisingly filling!<br><br>The ambiance is really smooth and romantic: dimly lit, with just a nice little candle lighting you and your partner. The tables are rather small, the booths are much spacier. The service can be good or bad, the first night we had a female and she was spectacular, but the second time we went we had a male, and he just wanted us gone quickly, which spoiled the experience and made us weary of going back.<br><br>Though we enjoyed it all, we really much preferred the appetizer and dessert as a standalone, which is why we skipped it the second time. I would say that this is a nice, romantic date idea for two. Good for an anniversary!", "pics": null}}, {"review": {"des": "Classic Fondue with Cozy Atmosphere!<br>I went to Geja's on a date last Friday, and it was terrific. The service was attentive, and each course was delicious. The cheese course was especially flavorful, and I loved the bread and apples that came with it. We went with a surf & turf-type combo for the main course, which was delicious. The chocolate was exactly what I would have expected except that it also included an open flame to toast marshmallows! Overall an adorable atmosphere, a setup that makes you think the classic days of the 1950s are back, and delicious food. What more could you want?!?", "pics": null}}]}