{"name": "giant-chicago-2", "reviews": [{"review": {"des": "Went to Chicago for Labor Day weekend last year and loved everything we ate at Giant. We had such a great experience. The service was great and the food was amazing. The night was fresh and being from Miami it was a nice change for my husband and I. It wasn't cold out, but probably in mid 60s. The inside of the restaurant was packed so we decided to eat outside. The patio outside was pretty and I loved that they had heaters and market lights strung above. I found it to be such a nice ambience and preferred it over the inside of the restaurant. Chicago has so many highly rated restaurants, but I'm glad we landed on Giant. It was my favorite food of experience of my long weekend in the city.<br><br>For dinner we shared the biscuits with jalapeño butter and the the garlic buttermilk potatoes. I had the saffron tagliatelle with king crab and chili butter while my husband had the lamb ragú gnocchi. I can't say anything other than the food was outstanding and we wanted to keep eating even after we were full. I'm a huge fan of gnocchi, but not of lamb, and my husband asked me to try some of his meal. I thought it was very tasty which surprised me. I went in for a second forkful. By the end of dinner we were stuffed, but of course we still made sure to make room for dessert! For dessert we had the vanilla cajeta ice cream and it was great. I'm a huge fan of fried ice cream and this one did not fall short. <br><br>If you're in the Chicago area and want to have a nice, delicious dinner, I recommend that you give Giant a try!", "pics": null}}, {"review": {"des": "I found it odd that such a causal-looking place would have such formal service and a wine/cocktail list a mile long. Asking questions about the menu was difficult since the music tends to be very loud. By 7pm the place was packed tight.<br><br>The zucchini salad was delicious and the right size for sharing. My sortillini was very flavorful but not big enough to share more than a bite. Skip the biscuit since you get bread with the pasta dishes. Desserts were odd mixtures of things and not really worth it. Rice pudding? Blah.", "pics": null}}, {"review": {"des": "I am coming out of my #weddingdiet Yelp hiatus to write this review. Make your reservation at Giant, for two months from now, ASAP. This place is doing it right. From the ambiance (fab music selection), to the service, to the unique dishes, they're doing upscale and inventive in an approachable way. Took the fiance here for a birthday celebration and couldn't have been happier with our choice.<br><br>Cocktail list is small, but with a full bar, you have plenty of flexibility. I loved my mezcal-based La Selena and later, we both enjoyed the beers we ordered. Now, onto the fooooood. We probably ordered more than the average couple, but the dishes honestly got better and better as the meal continued. What started as \"wow, can I have 100 more onion rings\" turned into \"what onion rings? This short rib is the best thing I've ever eaten.\" If you're reading this review, you've seen 100 pics of crab salad and waffle fries (I will not deny, this is incredibly delicious), but the best is yet to come as your meal progresses. We loved dishes like the green curry broccoli and ribs. Everything was coursed out perfectly, the timing was ideal. And then dessert. Chocolate babka for the win. As my Jewish mother says, \"nobody makes babka anymore!\" Even if they do, it's not like Giant.<br><br>Overall, excellent place to celebrate a special occasion. Fair warning, the space is cozy. By cozy I mean you're comparing dishes with the couple next to you and could easily reach onto their plate to snag a bite. Close quarters. But it's all part of the atmosphere. Make a reservation far in advance and go!", "pics": null}}, {"review": {"des": "I'm so glad that I finally got to Giant.  There were so many things that I enjoyed during my dinner there.  My first thought on walking in and sitting down was that space is a bit tight.  I'm pretty sure the diners next to us could recite our conversation because the tables are close together.  It didn't bother me though, I was still comfortable.  The noise level in the restaurant was average...I recall having to speak up but I was by no means yelling. All of the staff were pleasant and very friendly. Our waitress was so patient And helpful With suggestions. We were a party of three and it was recommended that we order six items off the menu to share and the amount of food that we received was perfect. We began with cocktails and Uni Shooters! I recommend the good hair day, it was quite enjoyable. I immediately wanted a second uni shooter after the first one...so good! The meal started with the Brussels Sprouts, Zucchini  and Eggplant. While I liked all of the vegetable dishes the eggplant was the star! The flavor combinations were fantastic and the naan breadbread that it came with was a welcome treat. I really could just return for the vegetable dishes. I also tried the Little Biscuit with Jalapeño Butter. I seriously could eat a whole pan of those.  Next came the happy scallops, potato ravioli, and the tagliatelle. My favorites were the scallops and the tagliatelle. I would order the Saffron tagliatelle(king crab, chili butter) every visit.  It had a nice balance of flavors with a touch of citrus coming through. My table location gave me a view of what was going on in the kitchen and it was nice to see the smiles...it seemed like everyone in the kitchen was having a good time.  Overall dinner experience was fab from start to finish.  Seeing the charge on our bill for health benefits for employees made me love this spot even more. <br>5  stars  for great food, service, enjoyable atmosphere, and for providing health benefits for employees.", "pics": null}}, {"review": {"des": "Yes!<br><br>We go order a bottle a wine and share every plate we order!<br><br>Giant is great. Also have been there enough times to know they have great employee retention.<br><br>What Ive tried:<br><br>Uni shooter! Yummy just one bite crunch outside liquid center.<br><br>Jonah Crab Salad: really fresh more  good love the fries...<br><br>Happy scallops: we actually don't share this one....we each get out own. I can drink the sauce.<br>Legit such a  dish.<br><br>Onion rings: good!<br><br>TAGLIATELLE: dude. Once I ate this twice in one sitting. I literally had to eat it again it was so good.<br><br>Ravioli: so good amazing sauce<br><br>Mahi mahi: literally so good I've also eaten it twice  so  <br><br>:::HOT TIP:::<br><br>RESERVATION NOT A MUST! I put my name in and walk over to scofflaw for a drink or two time passes just enough time to have a drink while you wait.<br><br>amazing customer service! i honestly love this place.<br><br>great place to bring a date.", "pics": null}}, {"review": {"des": "Made a res to celebrate our -1 Anniversary :D<br><br>Food:<br>-- Short Rib: 5/5 By far best dish of the night. The sticky rice was bomb. Flavor profile brought me back to Thailand. Meat was cooked perfectly. <br>-- Garlic buttermilk potatoes: 4.5/5 Great solid staple. <br>-- Tri tip steak: 3/5 Could've been more tender. Mushrooms were earthy and delicious.<br>-- Tagliatelle: 4/5 Skimped on the crab... I wasn't a fan of the tanginess of the sauce but my fiancé loved it. The pasta is also not tagliatelle... Fresh pasta would've made it 5/5. <br>-- Ravioli: 3.5/5 Pasta dough was a little too al dente for our liking. Filling was bomb though.<br><br>Service: Excellent.<br><br>Ambiance: Small restaurant. Seating was too close to my comfort much like at Publican. Be ready to hear your neighbor's dinner conversation.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DHuEmOE-DWMVdbVqSQhq-A/348s.jpg", "caption": "Tri Tip Steak"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VRuNtmW_G-PjEcwHwOLO4Q/168s.jpg", "caption": "Tagliatelle"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aKlvf3JWOLTPwuO4Hbd0IQ/168s.jpg", "caption": "Ravioli"}]}}, {"review": {"des": "The food here was fresh, flavorful and fun( i.e. the happy scallops). We were seated on the back patio; which was decorated beautifully with lights strung up, and it felt like we were in a family backyard, which I really liked! Since I was eating with 3 other people, we decided to order a bunch of things to share, and everything we ate we loved!<br><br>We ordered the pasta with lobster, the biscuits, the eggplant, the happy scallops, and the ribs! I think my favorite was a tie between the biscuits and the eggplant, but realistically, I'd eat it all again. Also, the food came very quickly, and the wait staff was very nice. It's a perfect place to go out to dinner with friends to catch-up", "pics": null}}, {"review": {"des": "We decided to try out Giant because it was on several lists for best new restaurants, top restaurants you must try, etc, etc. We got lucky and came across an open reservation just a few days before for a Friday evening even though ordinarily I'm pretty sure you have to book weeks in advance. You can easily walk by Giant and miss it since it's a bit small however don't let that fool you because the flavors here are huge! <br><br>Everything here is small plates. Between 2 people we got 2 small starters, 4 main dishes, and a dessert. After all this we were stuffed. We started off with the super uni shooter ($5 or $6) and the biscuit with jalapeño butter ($3). I have a shellfish allergy but my bf really liked the uni shooter. Loved the biscuit - it was the perfect texture and that jalapeño butter is amazing. For main plates we got the ribeye, eggplant, sortallini, and baby back ribs. The ribeye ($16) was an incredible mix of textures and flavors! Loved every bite of it! The eggplant ($14) was another huge hit (I would say my favorite dish of the night). It's sweet and sour and this dish also has such a complexity to its flavor. I've never had such delicious eggplant in my life. Great mix of ingredients! The sortallini ($16) was also really good and flavorful but I thought the dish was quite small for the price and also a bit salty. Lastly, we got the baby back ribs ($19) which is supposedly a popular dish here however it was my least favorite one. I couldn't help but compare it to the ribs at green street smoked meats. By comparison the meat here wasn't as good, nor did I appreciate the sauce as much. It also comes with a side of beans which I thought were pretty plain. In comparison to the other dishes, the baby back ribs wasn't as good.<br><br>For dessert we ordered the chocolate coffee ice cream with almond and brown butter ($10). They give you 2 big scoops and this is quite indulgent so definitely recommend sharing. <br><br>Overall I really liked Giant. The dishes here are reminiscent of Girl and the Goat with the complexity of flavors and unique dishes. I also thought it was remarkable that although it's labeled as an \"American\" restaurant, they actually serve dishes from several different cuisines including Italian, Asian, etc. Giant is expensive but worth it. Service is great. There is metered parking nearby for $2/hr but I was also able to find free street parking about 2 blocks away.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JlevPSwDTTb_nhfPLnNASw/348s.jpg", "caption": "Tomato Sortallini"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Q1n9HU4DV4Bm9PJzaYZilw/168s.jpg", "caption": "Super uni Fried Super Uni Shooter"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PPN9V5lzSicyzoyJbC66ww/168s.jpg", "caption": "Biscuit with jalapeño butter"}]}}, {"review": {"des": "10:38- my party of 6 and I had a reservation for 10:15...it is now 10:38 and we are still standing outside waiting. It's small inside and there's really no place to sit and comfortably wait. My experience started off pretty poorly.<br><br>10:46- we've now been seated and the waitress has collected our drink orders. She's really friendly and seems to be enjoying her job, I take this from her pleasant demeanor considering that the restaurant closes in 14 minutes.<br><br>10:49- different servers brought our drinks over (get the Bacchus Cabernet Sauvignon...heaven!!) and our waitress came back to collect our order. She asked whether anyone had allergies and actually took note of it! My friend has an apple allergy and she came back to inform her that her order had apples in the marinade. EXCELLENT customer service<br><br>11:10 - the apps arrive! The garlic Parmesan potatoes (creamy, decadent and delicious omg I could have eaten 5 orders of this!!), and a zucchini dish (light and fresh, very flavorful and tasty).<br><br>11:18- the main entree arrives- the tagliatelle. Chunks of Alaskan king crab on top and a delicious somewhat tangy sauce. My only complaint is that the pasta was a bit firm for my liking.<br><br>Overall I really enjoyed my experience minus a few small low points and would certainly come again!", "pics": null}}, {"review": {"des": "Always have a great meal here.. would highly recommend the chief table where you can see all the action in the kitchen. Great for date nights or just looking for some great food. We typically get 1/2 the menu and have leftovers for the next day.", "pics": null}}, {"review": {"des": "Wow.  What a phenomenal food experience last night in our own neighborhood.  Giant has been on our list forever, and all the stars seemed to align when we decided to do an impromptu date night and a 5:15 reservation was still available on a Friday night.  We snagged it immediately and headed over to Giant for our early bird dinner.<br><br>The restaurant is cozy and casual with a pretty cool vibe.  The tables are close together, as others have pointed out, but no closer than many other restaurants in Chicago (and almost every restaurant in NYC).  So this did not hinder the experience for us at all.    <br><br>Our waitress, Kristen, was very helpful in recommending how many items we should get for the two of us and answered our questions about drinks.  We started with a couple of cocktails, I got the Controlled Burn (which was basically like a bourbon lemonade but refreshing) and he got the last drink on the list which was some sort of excellent bourbon cocktail with sherry and other things (strong but quite smooth).<br><br>I appreciated that unlike most places, Kristin did not recommend a ridiculous amount of food and tell us we need 3-4 dishes per person like so many other small plate style restaurants.  She recommended the perfect amount of food for us - 4 dishes plus the uni shooter bites.  We cleaned each of our plates completely, but were too full at the end to even consider dessert, so to me that's the perfect amount of food.  Unless you really wanted dessert.  The food came extremely quickly, so for a 5:15 reservation, we were done with everything by 6:08.  I wouldn't have minded spacing it out just a tad bit more, since we sometimes would get the next dish while we were still finishing the previous.  But I imagine they have a pretty packed reservation list and try to turn tables over quickly.  Here was what we ordered:<br><br>Fried Uni Shooters - These were pretty delicious, and probably the only dish of the night that I thought was slightly overpriced.  But I also thought everything else was slightly underpriced so it evens out.  For $5 each, you get a tiny, fried sphere the diameter of maybe an inch.  It's a heavenly bite, don't get me wrong.  And it's accompanied with a couple bites of a delicious cucumber, soy, fish sauce concoction.<br><br>Sweet & Sour Eggplant - If we had to pick a favorite dish of the night, this would be it.  Absolutely phenomenal blend of flavors accompanied with some fluffy pancake thing and even a bit of spice to it.  So flavorful, and just a genius preparation.<br><br>Marinated Zucchini - Another excellent dish.  This was light but still flavorful and refreshing.  Highly recommend.<br><br>Tomato Sortallini - This one was a tad bit smaller than I was expecting, but still delicious and every bite was heaven (even though we each only got about 3 bites).  The tomatoes are quite possibly the freshest tomatoes I've ever had in the USA.  An excellent choice, but I'm excited to try the other pasta options next time we go as well.<br><br>Miso Halibut - This was amazing.  Perfectly prepared halibut, but not in a full miso glaze, which is what I was expecting (which I love, but this was a more subtle use of miso).  The accompanying medley was also delicious and comes with heavenly chunks of meaty artichoke hearts that were just a random but brilliant choice.<br><br>Overall, the meal was just perfect.  Everything was filling, but also light and fresh, so you don't feel weighed down or uncomfortably stuffed.  Ingredients were top quality and freshness, plating was excellent, and flavor was plentiful.  We can't wait to come here again as soon as the menu changes again...or we would be happy to come back and get all the same items again!  All in, a full meal, plus 2 cocktails came to just over $100 for 2 people, which was a steal for food of this caliber.  What an absolute gem to have in Logan Square.  And as a bonus, it's right next to Scofflaw and down the street from Best Intentions, so you have some great post dinner options!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/COd-jWTISQvmepy56e89xQ/348s.jpg", "caption": "Tomato Sortallini - very tasty and delicious! Just a tad smaller than expected."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qFgKjO3fcc6fmwkMFtR18g/168s.jpg", "caption": "Sweet And Sour Eggplant - heaven. Just complete heaven."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xbOdSdi9T8SqUQSlS6s3lg/168s.jpg", "caption": "Miso Halibut - excellent!"}]}}, {"review": {"des": "Recently my wife and I found out we could have a date night about 2 weeks.  Our first few choices had no reservations available and ended up going with a place we weren't all that excited about.  That was until I got a text to confirm a reservation for Giant that I forgot I made which happened to be for the night we were free!<br><br>Our first trip to Giant was in December.  At the time I left thinking that was one of the best meals I have had anywhere in 2017.  Much to my surprise we actually enjoyed our second visit even more than the first!  We ordered just about the same thing as the first time except we switched out 2 dishes that we thought originally were just good.  Turns out we liked the replacements even more!<br><br>We have come to load up on the pastas here.  Each pasta course had well cooked pasta and an amazing sauce to it.  They bring some bread for you to get ever last bit of it so you don't have to embarrass yourself by licking the plate.  <br><br>Portions are on the relatively small side but no dish we ordered was over $17.  We had 6 courses plus 2 uni shooters and 2 bottles of wine which set us back $250 including tax and tip.  For the quality and quantity of food we had felt like that was a bargain.<br><br>We have reservations again in 3 weeks and can't stop thinking about how awesome it is going to be!", "pics": null}}, {"review": {"des": "Definitely make an appointment ahead of time to save yourself the stress (and the long trip). I tried to reserve a week in advance and saw that there were no availabilities for the next month. So I decided to try my luck and walk in at 5 on a Friday. Luckily, there just happened to be one table available for one hour only before the next reservation started. So I thought that would be plenty of time. The service was incredibly slow and most of the time we spent there we were just waiting to get a menu/a waitress/the check etc. The food was amazing and 5/5 for sure but considering the price, I would've expected them to be bigger portions.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XyeZYYryjnsy9sIdd117eQ/348s.jpg", "caption": "One piece of bass"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-HtiY5TERNimUk0LM9YEHA/168s.jpg", "caption": "Pici"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yKVWQanrqAhYjMDf2ZltIA/168s.jpg", "caption": "Jonah Crab Salad with waffle fries"}]}}, {"review": {"des": "Okay giant, no wonder you have a 2 months at least reservation wait. You were terrific. One thing I wish is that you guys were a little bigger so that the tables weren't on top of one another, I mean no privacy whatsoever which is annoying if you're on a date or want to just have a private convo. <br><br>Here's what was amazing. The biscuit with jalapeño butter omg get that and then order at least 2 per person because it is so good. The one thing I'm sorry giant I didn't personally love is the crab with waffle fries. I mean it looks cute but the flavor profile compared to everything else is just too simple. I mean it's crab salad on top of French fries. I wouldn't get that again but everything else I loved. Stand outs were also the lobster pasta with saffron sauce I wish I didn't share that. We loved the steak entree as well as the eggplant. We were too full to try to short rib but I will save that for next time. <br><br>Our server was super friendly and suggested the ice cream balls and I would normally not get a dessert without chocolate but holy moly is this dessert amazing. I mean really amazing. I would always get that dessert here it is that good. <br><br>Overall a fantastic meal and dining experience. One of the more unique dining experiences our city has to offer and definitely a foodie destination.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NOi1o_pXg3bqWt2aZRZOFQ/348s.jpg", "caption": "Very tasty food"}]}}, {"review": {"des": "Tiny portions but grand flavors. I am a medium fan of Giant.<br><br>The difficulty of getting a reservation for normal-ish dinner time at this place rivals G&TG. And my friends and I were not disappointed. We heard the place is known for pastas, but we ended up loving everything but.<br><br>The good<br>- short rib w/ sticky rice: SO SO good. We all wanted to order a bowl just for ourselves. Must get.<br>- eggplant: Served with bread, this was pretty darn good, especially with the cashews providing some texture.<br>- sweet potatoes: Best sweet potatoes I have ever had. I thought the anchovy would be gross, but I was so wrong.<br>- miso halibut: I hate artichoke but I willingly ate everything on that plate. The fish was so sweet and flaky and perfect. Another must-get.<br>- tri-tip steak: Bold flavors and the steak was cooked very nicely to medium-rare on the pink side. Not a must-get per se but great for meat lovers.<br><br>The meh<br>- little biscuits: The jalapeno butter was fantastic, but the biscuits were, well, LITTLE. Also not super fluffy. Among these New American restaurants, Baptiste & Bottle still delivers the best biscuits imo.<br>- involtini (beef ragu pasta): I so highly anticipated this but was let down. Expected rigatoni pasta for maximum sauce retention, but it was rolled up pasta. So it was a lot of pasta and not enough sauce, which was too salty and not interesting.<br>- tagliatelle: It was just kind of whatever, not bad by any means.<br>- ravioli: Yummy but kind of just standard.<br><br>If they change up their menu regularly, I will definitely be back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MdUHqDA3zygFoI5ePoeiTg/348s.jpg", "caption": "little biscuits (two orders)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YmNg-BD6A6GWd8egnSbzbQ/168s.jpg", "caption": "short rib w/ sticky rice - must get"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Y0NzLPyow86CLW_QVwE7Og/168s.jpg", "caption": "sweet potatoes"}]}}, {"review": {"des": "Rare 5 star for me....but this spot right here was exceptional in their ambience and food was spot on.......host was interesting bit not enough to stop this rating......our server was awesome...quiet setting soft music....perfect evening", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TmQCdyH9mVk5evO6UsS6CQ/348s.jpg", "caption": "These garlic potatoes will make you WANNA slap the cook, his or her.momma and anyone else who made you eat all those carbs."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1-ozCzA_nEQ2Z17IEHBq1A/168s.jpg", "caption": "Tri-tip cooked perfectly"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ykZL6chiNw6v7LGkMHMCZQ/168s.jpg", "caption": "Tortellini with bacon bites"}]}}, {"review": {"des": "This was outstanding. We had wanted to come here for a long time, and it was every bit as excellent as we had built it up in our heads to be.<br><br>We went with a group of four and got the following (in order of when they were received):<br><br>- Uni shooters<br>- Biscuits<br>- Short rib<br>- Onion rings<br>- Eggplant<br>- Tagliatelle<br>- Sortallini<br>- Involtini<br>- Pici<br>- Hot mess<br>- Cajeta ice cream<br><br>Normally I'd order this by how much we liked each dish, but it was really hard -- just about everything was really amazing, so it's hard to come up with a real meaningful order. We really loved the pastas (which were perfectly al dente -- no small feat), and I thought the eggplant was absolutely outstanding as well. If there was anything we wouldn't order again, it might be the onion rings (which were very good onion rings, but there's probably an upper limit there) and the involtini (which was very good, but less unique than the other pastas). The hot mess also wasn't my thing, but the rest of the table loved it. (And I loved the cajeta ice cream.)<br><br>Overall, an amazing dinner, and this definitely goes pretty far up my list of Chicago restaurants.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CgKGdEoTU5YOOABuBM21pg/348s.jpg", "caption": "Involtini"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rXaVjB8CksiJthzMD_xTCQ/168s.jpg", "caption": "Tagliatelle"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zlxty97WR6oNdi_0iFcZQQ/168s.jpg", "caption": "Bread"}]}}, {"review": {"des": "I was really Glad that my friends recommended dinner at Giant this evening.<br><br>The food and experience were right on point. On the food side, the biscuit was great, but the jalapeno butter was out of this world and should be embraced more often. Green beans and bacon isn't a revolutionary idea, but Giant gives their take by adding feta and pork cheek to create the perfect starter. As the mains made their way out, the short rib and eggplant were both outstanding, but the tagliatelle with crab absolutely made the meal.<br><br>But food isn't everything. From the pleasantly scented restrooms to a Shel Silverstein poem on the wall, the decor was perfect. I always like restaurants where the staff works as a team, and everyone is working together to give you a great night. That's definitely the case here. I wouldn't change a thing about my night. Seriously, the only flaw I could see is that cell service is weak if you're looking to Uber home. <br><br>Admittedly, Giant has had a lot of 'press' in the past week. But don't be let down by what you might read. Once you've had Giant's eats, you just might 'cling' to this place.", "pics": null}}, {"review": {"des": "The food looked good yet the cuisine hype for taste did not meet its mark as expected. The onion rings looked and tasted left in the fryer longer than it should have or the oil was old.<br><br>Eggplant was interesting more sour than sweet and sour.  Scallops were over cooked and it's accented sauce was too salty. The pasta with crab was not cooked to al dente for the salty buttered sauce can be incorporated. The cook(s) must have had a off night tonight.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xUIedn-oReR2b_-WfG1QLA/348s.jpg", "caption": "Tagliatelle Pasta"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yVMzaHS1EO7VIyi-UZT6pg/168s.jpg", "caption": "Scallops"}]}}, {"review": {"des": "Wow! This place is definitely getting added to the favorite list. The food and service was amazing. We had the following items<br><br>Ribeye- *MUST HAVE*<br>Tagliatelle- *MUST HAVE*<br>Scallops<br>Pici<br>Biscuits<br><br>All of which were delicious. Definitely will be planning another stop here soon. the only downside to this place is getting a good reso!", "pics": null}}, {"review": {"des": "After spending three hours driving and more than an hour and a half in bumper to bumper traffic (to meet for dinner), I woke up reminiscing about a few dishes we enjoyed during our dining experience. All the reason to give Giant the full 5 stars. <br><br>The trendy small plate hot spot offers 6 unreserved spaces at the bar which is how I managed to get in on a Friday night with no reservations. If you should decide to do the same, I highly suggest arrive by 6pm for a shorter wait time. <br><br>In celebration of a dear friend's birthday, job change and relocation, I convinced her to choose a restaurant on her wish list even if it meant a several hour wait. Well, at 6pm, my friend walked in planning to place our name on the waitlist, and quickly learned seats for two at chef's counter were available. Only problem was, I was not. This hungry and traffic weary dining companion was 9 miles away with 35 minutes to go, resulting in us being placed on the waitlist for the next up instead. At 7:20p, we were living the dream in Giant chef counter heaven. <br><br>Fried Super Uni Shooter ($5) --- 3.5/5 stars; eat it in one go. Tasty but having tried it, I could easily skip it on my next visit. <br><br>Biscuits ($3 each) ---- 5/5 stars; served warm with jalapeño butter; would never dine here without getting at least one. <br><br>Broccoli ($10) ---- 3.5/ 5 stars<br><br>Happy Scallops ($19)  ----- 5/5 stars;my absolute favorite. Spicy, flavorful and the most memorable dish IMO. <br><br>Short Rib ------ 5/5 stars; I am generally not a fan of Short Rib but the sticky rice, jalapeño and other ingredients when all mixed together made this dish EXTRA special. Would definitely order the tender small slices of short rib, again and again. <br><br>Tagliatelle ($19) ---- 5/5 stars; what is there not to love about pasta and king crab?! A must try item. <br><br>Lemon Cake --- 3/5 stars; good stuff. I am not a dessert diehard. If you are, it's a great sweet and savory combo. <br> <br>Vanilla Ice Cream (Cajeta) --- 5/5 stars; it tastes like strawberry shortcake with caramel. We were informed we could order a single scoop instead of a full order. Another must try item.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wbgvsMVYRQiDwybnNm_tGg/348s.jpg", "caption": "Fried Super Uni Shooter"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iifWkcPXMayiugtVe_w-kQ/168s.jpg", "caption": "Menu (as of 3/9/18)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/d9pFvrgJnbbvp-XCgis0qA/168s.jpg", "caption": "Happy Scallops (my favorite)"}]}}, {"review": {"des": "Giant is indeed a small intimate place with big flavor but questionable service.<br><br>Heads up, make sure you make a reservation weeks in advance since this is one of the well attended hot spots in town.  <br>Also, in case you might find this a dealbreaker, there's only a tiny gap between each tables. <br><br>Moving on to the food:<br><br>*Onion Rings <br>Sprinkled with chili salt and shredded parmesan, these heavenly rings were out of this world! Right amount of spice and not too salty. This isn't your typical onion ring you'll get anywhere else. A must get!<br><br>*Short Rib <br>A unique Asian-inspired take on short rib. It was served with sticky rice, peanut, and chili. The ribs were tender, perfectly cooked, and spiceful. They definitely went pretty well with the sticky rice although we thought it was a tad too sweet and gooey for our liking. Nonetheless, it was still very enjoyable.<br><br>*Piri Piri Pork<br>Served with cauliflower, orange, and greek yogurt. Everything was well seasoned. Love the addition of orange that gave a slight bitterness to the savory dish. On a side note, the name of the dish wasn't quite reflected on the dish. When I read the word \"piri piri,\" I was expecting a spicy and picante dish. Turned out it wasn't but this wasn't an issue, just something to consider. A must get!<br><br>*Black and White Babka<br>My first time having Babka, and it was surely a memorable one! Served warm with banana ice cream, pear chips, figs, and raisin. What the babka!? They were so delectable!! Many rave about this dessert and I'm sure you'll join the babka train too if you give it a try! A must get! <br><br>Service from hostess and busser was amiable and attentive BUT... <br>There was one thing that bothered me. Our server was in charge of my table and a few others next to mine. Throughout our meal, we were NEVER once asked how the meal was yet the couple and other patrons sitting beside us were constantly asked that question. To make things worse, the server informed the couple that there were off-menu desserts he'd recommend yet we were NOT told so when we had ordered ours. To me, that was unprofessional. Was it because of our race? Perhaps, all other patrons were White and we were not, but I don't want to go to that direction. All I can say is that staffs need to be trained better to treat customers equally. <br><br>Had that not happened, it would be a 5 star dining experience. Regardless, the food was impeccable and it was one of the highlights of my Chicago trip.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2xjuoi5z1kmtroqgGZSZuA/348s.jpg", "caption": "Black and White Babka"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/reGmNXVe_0Noz1MX6o24cw/168s.jpg", "caption": "Short Ribs"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JHMZRXZARz-Krhac1ldePw/168s.jpg", "caption": "Piri Piri Pork"}]}}, {"review": {"des": "Wow! This food is ridiculously delicious! OMG! My biscuit to start with jalapeño butter was the bomb! The next course was the short rib...STUPID!!! It was cooked medium rare to perfection! I could not stop eating! Then our table neighbors shared their onion rings. Too good. <br>The plates are made fresh, which gives you time for wine and conversation. It was an absolutely perfect evening to sit on the patio and enjoy the night. <br>Make sure, if you want to sit inside, you make reservations. It's a small place and may not be able to accommodate if you show up on a whim (like us)!<br>Now...back to the food. Because they serve as the food is prepared, we had great anticipation for Phil's entree of Tri  Tip Steak and fresh tortellini pasta, and my garlic potatoes. They were kind enough to put the bacon on the side of the pasta, since I don't eat pork. Did I say Wow already? Wow - again! Tortellini is delicious with cherry tomatoes and fresh basil. Then they brought freshly-made sourdough bread. I'm gonna slap somebody in here!<br>Ok...the garlic buttermilk potatoes just blessed my life!<br>Drop the fork! <br>This has been a great dining experience!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EEPlZPNEux2PH4jBrz6KiA/348s.jpg", "caption": "Garlic Mashed Potatoes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OfUWPYHJN5OxQ-L1y4Pgog/168s.jpg", "caption": "Tri Tip Steak"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ekIG54GjUKq8_WuNucgHVw/168s.jpg", "caption": "Tortellini!"}]}}, {"review": {"des": "Wow I love the food.  I sure will be coming here for the excellent service.  I really liked every dish we ordered.  I fell in love with the sticky rice and the short ribs.  The stake was so tender it melted in my mouth.  The scallops were so delicious cook to perfection.  The coffee was so delicious.<br> The only problem with this tiny restaurant the tables are so close together once your are sitting good luck trying to get out from your place.   The restaurant setting was very nice modern decor but like I said too tiny or too many tables for such a small place. <br>I really loved all the different spices and the plate decorations on each dish.  Very creative and beautifully adorned dish.", "pics": null}}, {"review": {"des": "We stopped in for my birthday last week.  It's been on our list to try for a while, but haven't gotten around to it.  Sadly, my friends have a habit of cancelling at the last minute and given that you have to give your credit card in the reservation, I was always leery to go with others.<br><br>Unfortunately, the patio was closed on our night - due to the Chicago weather and threat of rain, but they placed us in a corner table...which I'm grateful for.  It gave us a little more space than other tables.  They definitely try to cram as many people into the main area as possible.  <br><br>We started with some Pinot Noir wine that we really enjoyed.  Not sure which one, but we ordered two glasses each!  Our server (Patrick) recommended it and he was great throughout the evening....wishing me a happy birthday...apologizing that we couldn't sit outside.   Definitely a great and friendly staff.<br><br>We shared the following:<br>A LITTLE BISCUIT w/ jalapeño butter<br>HAPPY SCALLOPS with nori butter<br>GARLIC BUTTERMILK POTATOES <br>SHORT RIB with sticky rice, peanut, and chili sauce<br>TAGLIATELLE w/ king crab and chili butter<br>BLUEBERRIES - lemon cake w/ sweet corn ice cream<br><br>All of the dishes were quite good, and I liked the Tagliatelle the best b/c of the sauce.  My husband liked the scallops the best.  We both wished the short rib was more spicy, but I'm sure others did not!  The little biscuit is quite small - you should get one each person.  <br><br>There was not a dish that we did not like nor felt was not good.  However, the tastes didn't shout out at me enough that I might make the trek over to Logan Square again.  We actually went to their sister restaurant (City Mouse) a few days after Giant and liked our meal there a little better.", "pics": null}}, {"review": {"des": "Oh. My. Gosh. This is maybe my favorite place in the city. If I could give more than 5 stars, I would. We had a reservation for 4 for about 2 months that we had to change once. And then, one of our 4 dropped out, so we went with only 3. We didn't realize this would be a problem, so we just went and didn't think about it. The hostess asked if it was okay that we wait for the 3 person table, and we said that was fine. They gave us each a glass of cava for our wait which was awesome. <br><br>When we were seated, our waiter was awesome too. Super knowledgeable about the menu and very friendly. We ended up ordering 5 dishes for the three of us and a couple cocktails. Everything we had was SO good. Especially the eggplant with the potato pancakes (which we didn't even order-- they threw it in for free!). The lobster pasta was to die for, but skip the lobster app. <br><br>We didn't get dessert, though I wish we had! Already ready for our next reservation :)", "pics": null}}, {"review": {"des": "Reservations a must. Excellent food. 2-tops are very close together which doesn't bother me depending on level of noise but Zelda did not like. Good mixologist and cocktails reasonably priced. In Logan Square area and not sure about parking. I had the uni shooter, scallops, and lobster tagliatelle....all excellent. Plates were sharable and she ordered the steak. Finished with two nice Amaro digestivo. Suggest the Antico Amaro. Kristin provided great service. Noticed there was a 2% charge for employee health insurance which should provide some staff stability plus the usual Chicago 10% take which provides nothing. All-in-all a great dinner and joins my return list.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wLh8cuq3-iqIR2v92f_5hQ/348s.jpg", "caption": "Scallops half gone"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Y8EcDFttFmGUPDqsLGVreg/168s.jpg", "caption": "Pasta with lobster"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/10aOB8juHiRWunBE073GgA/168s.jpg", "caption": "Steak. Perfect."}]}}, {"review": {"des": "This place is AWESOME! You have to make a reservation super far out, so make sure you get on it, and it's so worth it! Their cocktails are incredible....definitely get 1-2 of those. The staff is so friendly and knowledgeable and they create a great atmosphere. I recommend bringing 4 people so you can try as much as possible! My absolute favorite dishes were the biscuits (\"a little biscuit\") (BOY do they make amazing breads, any time bread was a part of the meal/dish, it was so incredible), the garlic buttermilk mashed potatoes, the eggplant dish (comes with nan and it's amazing), the sortallini pasta, & the potato ravioli (WOW this one was my absolute favorite). The crab salad with waffle fries was great & the onion rings were great. You gotta try the uni shooter, it's small and fun. When do you get to eat something like that?! Overall rave review! Can't wait to go back!", "pics": null}}, {"review": {"des": "I found Giant to be just a tad underwhelming. I think the problem was I liked it but I was expecting to love it. I was expecting to be blown away but they just didn't quite get there. Still, a good experience. <br><br>The restaurant itself is in a random spot, although that could just be my tourist's perception. It's apparently in a very \"up and coming\" area, at least that's what I was told by my Lyft driver. The space itself is very, very small. I was expecting it to be much larger. I'm glad I went super early (around 5pm) on a Tuesday, otherwise I suspect it would have been hard to get in. <br><br>I ordered all the things that Yelpers encouraged me to: the uni shooters, little biscuit and the crab tagliatelle. <br><br>The uni shooters just didn't do it for me. I didn't enjoy the taste, although, to be fair, this was my first time trying sea urchin. Perhaps it's just not my thing. However, the execution of the kitchen is to be commended. The shooter was perfectly fried and crispy on the outside; warm, gooey and runny on the inside. I think that's the intended presentation and so they hit the mark there. I just wish I enjoyed the filling!<br><br>The little biscuit was my favorite thing. Crisp on the outside, fluffy on the inside and the jalapeño butter that accompanied it was delightful. <br><br>The crab pasta was good but not great to me. Again, I don't think it was any lack of execution. I think I just had different expectations. I personally prefer my pasta a bit overdone. This dish was served al dente and so I found myself wishing the pasta was softer. I also was expecting and craving a creamier, richer and spicier sauce. It was light and a bit on the bland side. There was a hint of spicy but not much (in my opinion). I still enjoyed but like I originally mentioned, I wasn't blown away. <br><br>I sat at the bartop area where I could see all the chefs cooking. It was a wonderful experience. The service was great- I believe my waiter's name was Patrick. He was fantastic. Even though I didn't really love 2 out of the 3 of my dishes, and I don't think I'll ever go back, I still give this place 4 stars. I think everyone working there is doing a great job and if you like the types of foods they're making in the preparation they utilize, you're going to love it!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AeWyN0V1utpe8hEa9ExaFA/168s.jpg", "caption": "Crab tagliatelle"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zFRuQo_sHEsFebU1-ftfZQ/168s.jpg", "caption": "Uni shooter"}]}}, {"review": {"des": "New American? What's this even mean anymore?<br><br>Amazing, neat dishes, especially if you can scale with friends.<br><br>Personally, I loved the \"A Little Biscuit\" biscuit, we got it 2x.<br><br>Apparently, the Jonah Crab Salad is popular, we didn't get it. We went ahead with the bacon and maple sweet potatoes and luckily, it was easily one of my favorite orders. A really nice change to the pasta-heavy order of our table.<br><br>Pretty sure the menu changes pretty often, so I'll be sure to come back.", "pics": null}}, {"review": {"des": "Everything was delicious - crab salad, ribeye and stinky rice, amazing Brussels and ravioli could not have been more delicious. I've heard the scallops aren't that great, but every dish we ordered was scrumptious-no but left uneaten! If you don't mind being a little squished, try the chefs table so you can see the chefs do their thing. The wait staff were extremely hospitable, bringing a bottle of champagne we requested ahead of time for our newly engaged friend, and hiding the gift we got for her in the storage above our table for an added surprise. Make a rese if possible - this place is small and extremely popular. If you do have to wait, head next door to Scofflaw for a unique cocktail and cozy atmosphere.", "pics": null}}, {"review": {"des": "Made reservations about a month in advance for 2 at 5:30PM on a Thursday night. I am glad I did, because although it was empty when we arrived, a little after 6, the restaurant was completely full. <br><br>The first thing you notice is that this restaurant is tight. It works, but at the same time, it's not the same comfort you would feel when you've got a little more personal space for yourself. Definitely a place for 2. Maybe a max. party size of 4. The saying \"3's a crowd\" definitely applies here.<br>The moment you cross the curtain in the entrance the host is there to greet you and take your jacket- because literally, if you walk down the aisle in your big winter coat, you will probably brush people on both sides of the restaurant. You need to pull the tables out if you are going to be seated in the booths. This is fine when it's empty, but when the restaurant fills up and there's food on the tables, you feel a bit bad scooching between the tables and hoping your hair or booty doesn't brush against someone's food...<br><br>Let's talk about the food. The meal had some ups and downs. I think part of the downs were just because the flavors weren't quite to our preference. Otherwise, the quality was pretty good overall. Our waiter was superb. Very knowledgeable about the menu and described everything in such a detailed and appealing way. The dishes that he recommended for us ended up being our favorites! We asked our food to be brought out as it was made and here is the order in which we got them:<br><br>Uni Shooter: By the time I finished eating this, it left me wanting more. Not because I thought it was amazing, but because the flavors never really settled on my palate. Towards the end of the bite, once the sauce and the crispy fried exterior began to blend, I enjoyed it more. It's difficult to describe the flavor. I had high expectations, but personally, wasn't that impressed by it.<br><br>Happy Scallops: How can you eat something called HAPPY SCALLOPS and not be satisfied?!? This was superb. I would consider it the best scallop dish I've ever had. The scallop portions were more generous than I thought they would be. The soba noodles that accompanied them were also delicious. Some of the noodles had a crisp to them that was also really enjoyable. The flavors were great. <br><br>Tagliatelle: There's a citrus-y taste to the noodles. The flavors were not as savory as I anticipated. The crab didn't add much to the dish. It was pretty average, overall.<br><br>Tri-tip steak: Per our waiter's recommendation. Delicious. The sauces were fun and helped keep the dish dynamic. It was a simple steak but executed very well.<br><br>Lemon dessert: It's whimsical and looks creative but the flavors were very 1-dimensional. Despite being a lemon tart dessert, everything tasted sweet. I was craving more acidity. The marshmallow looked like the egg whites in a McDonald's breakfast sandwich...I wish the lemon tart at the bottom had been a lemon square instead. There was too much dough. The components all drooped and slid off of another once the sauce was poured over it. I tried to compose them all together for one bite but the flavors just weren't coherent. <br><br>I think the standard for this restaurant is that you are bound to have a good experience overall. I'm very glad I finally got to check this place off my bucket list. Depending on what you order and your own nuances while dining, it seems like you'll either have a good experience or a great one.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/97JSUGCeBySHm0p5KiBE0g/348s.jpg", "caption": "Happy Scallops"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QKLSiEX1ezrlIckurhVJNA/168s.jpg", "caption": "Uni Shooters"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rh4dp4tP2pro5Hb29kH11g/168s.jpg", "caption": "Inside"}]}}, {"review": {"des": "We've been wanting to check this place out for a while and was not disappointed. A nice variety of plates, so for two people, 4-5 dishes would be plenty. <br><br>We had the onion rings, and baby back ribs which was a generous portion. We also tried the sweet potatoes which had a nice contrast of flavor of sweet and tart with the sour cream and maple glaze. Don't leave without trying the cajeta ice cream. Amaaazing! <br><br>The service was attentive and super friendly, and be sure to come before the rush. They take reservations so put them in early. It's a tight but cozy space - so we definitely want to come back and check out other items on the menu!!", "pics": null}}, {"review": {"des": "After eating here and Gideon Sweet, I have to acknowledge there is a new restaurant format in town: New American Tapas restaurants. What I like about this restaurant type  is you can eat fancy for less than $100 per person (typically $50-$75).<br><br>Order 1-2 dishes per person. Trust me that's enough. We had a party of 3 and ordered 8 dishes. It was overkill. We should have stuck with 5.<br><br>Giant takes a lot of risks in its food. You think you know what you are getting. But you are pleasantly surprised with different flavor profiles and textures. I'll be the first to say I hate new and love to eat what I'm comfortable with. I was tempted to give a lower score but it wouldn't do this restaurant justice. Just like ramen, I need to develop my taste for this. <br><br>My group had the little biscuits, scallops, Jonah crab salad, onion rings, eggplant, tortellini, crab pasta, and sea bass. I suggest skipping the onion rings. Although probably the best onion rings I ever had. It didn't fit with our meal. I would also opt for another meat dish than sea bass which the group found salty.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BHgngRF4uJ2iLddpelCV9A/348s.jpg", "caption": "Scallops"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/s0U2a4uvzr2p1-kTnDqyPg/168s.jpg", "caption": "Little Biscuits"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HNlgYzpnB6lXI8PNpSd5Bg/168s.jpg", "caption": "J. Bird"}]}}, {"review": {"des": "The food exceeded my expectations based off the menu descriptions.<br><br>We had a reservation for 8:45 and were seated promptly upon arriving.  There is not a whole lot of room between the tables next to you, so be prepared to get comfortable with those sitting around you.<br><br>I ordered the slow burn for my cocktail, which was delicious.  I ended up ordering the same for my second cocktail.  <br><br>For food, my girlfriend and I ordered the following:<br>A LITTLE BISCUIT<br>ZUCCHINI<br>GARLIC BUTTERMILK POTATOES<br>SORTALLINI <br>TRI-TIP STEAK<br><br>The jalapeno butter that is served with the biscuits was incredible.  However, the best item of the night in my opinion was the sortallini.  This dish was phenomenal.  I would come back just so I can eat this again.  <br><br>Everything was priced very well also.", "pics": null}}, {"review": {"des": "Made a reservation for 10:15, but ended up walking in around 9:30 and were actually able to be seated right away! My brother and I had been eating all day so we weren't super hungry. We decided to just get two dishes, even though majority of the menu sounded appetizing.  Our waitress, I FORGOT HER NAME I WISH I COULD REMEMBER, was beyond patient and understanding and gave us some suggestions, including some of her personal favorites. She made sure we were comfortable and didn't push us to get anything too much. <br><br>We ordered the short rib, which came with sticky rice. This had a kick to it, but was still enjoyable for me, someone who really can't handle spicy. They were quite small (and so tender), but with the rice it was a blast of perfectly meshed flavor in a bite. We also ordered the Tuna, which came with chickpeas and some couscous. I'm not a fan of fish, but this was good! The texture of the fish paired well with the chickpeas. Both dishes were absolutely incredible and I can see why the restaurant has been applauded in so many articles. <br><br>Our waitress, Tess (the host), and Jason were all super kind and welcoming. If the food wasn't enough, the service is definitely a plus. Without a doubt, I will be returning, hopefully sooner than later!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YbXN07nYcVYu435uasQn2w/168s.jpg", "caption": "Tuna"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MGL4YMW55h0ORqG0u_tbeA/168s.jpg", "caption": "Short rib"}]}}, {"review": {"des": "Visited The Giant during our trip to Chicago. Really small restaurant and close seating (our only complaint), but the food was amazing. I highly recommend trying the lasagna and ribeye", "pics": null}}, {"review": {"des": "Continuing our tour of Bib Gourmand restaurants in 2018, Giant was very easily the hardest one to get into on the list.  We've been trying for months to find a date that worked, so we finally settled on getting a sitter for a Tuesday night dinner to make one fit, and even then, it took almost six weeks of heads-up to get on the list.<br><br>But damn, this meal was great.  Full disclosure--Giant is tiny, in terms of its space.  As such, the tables aren't close together, they are... closetogether.  You are going to have to embrace sitting basically right next to another party to eat here...maybe Blackbird's tables are closer together?  Giant might take the cake.<br><br>However, we got lucky--there are six seats in the back (kitchen), counter-style, where you are NOT sitting across from your diningmate and right next to another party.  I think this significantly improved my experience, and allowed for more banter with the staff...in the future, I will probably request those seats if that's an option.<br><br>Food was mostly a win:  we tried the biscuit, the onion rings, the broccoli, the stuffed rigatoni and the tri-tip steak.  Save for the onion rings--$10 for this seemed high, and the quality wasn't as strong as the rest of the dishes, although that sauce WAS money--I would get everything else again.  Special nods to the broccoli, rigatoni and the steak, which had a steakhouse-quality char in addition to excellent flavor.<br><br>The Bib Gourmand \"game\", if you will, is very doable at Giant--two plates and a glass of wine for $40/person.  We spent $86 (BEFORE tax/tip) because we got five plates instead of four, so that was easily avoidable, and we both left close to full.  I will say this--Giant's drink selection (at least, wines by the glass and cocktails) seem expensive for this 'hood.  At Scofflaw, Best Intentions and Parson's, you can do a lot better on prices with high-to-very-high quality.  But $13-$14 for cocktails at Giant?  Sorry, I'm not in River North.  And I'm fine with wine glass prices in the $10-$14 range...but for $14, I want a rose that is a heavier pour.<br><br>All of this was strange because a couple of the larger entrees are priced at $19/each and are fairly substantial (or pastas at $16 that are filling if you wait for them to expand in your stomach!).  To a certain degree, I'm glad that I had a bourbon tasting after this dinner because I only had one drink here...expect your bill to be exorbitant if you have a few drinks here.<br><br>Otherwise, great experience...of the Bibs we have hit this year (9 and counting), this was the best meal in terms of quality, although Dos Urban Cantina beat this out in terms of the quality-to-value proposition.  Give Giant a look!", "pics": null}}, {"review": {"des": "LOVED the food food, skip the before (drinks) and after (dessert) as both were pretty meh. Luckily we grabbed a pre dinner drink down the street at Best Intentions - good prices for good cocktails - cute spot with and loved the music they had playing. But I digress... back to Giant. <br><br>Made a bday dinner reso like 3 weeks in advance for a Wednesday and was only able to get a 5:30pm or a 9:30pm so 9:30 it was! Not a fan of eating so late because usually you're (A) starving and (B) feel too full and blob-like before bed. Good news everyone - you will leave happily satisfied without the food coma/ food baby side affects! Phew!<br><br>On to the main event, between 2 people we shared: <br>-Asparagus: best cold starter, loved that fancy cheese because how can you not? It's fancy people. Also the almond crunch situation is on point <br>-Zucchini: just fine IMO...good sauce flavors<br>-Garlic Buttermilk Potatoes: surprisingly v light and not wildly creamy for buttermilk. This girl loves her potatoes, especially in mashed form and boy these did not disappoint<br>-Short Rib: favorite! Loved the textures and flavors. Could eat like 4 of these bowls...ok maybe 3<br>-Pici: pasta itself was awesome but thought it was a little too salty <br>-Stuffed Rigatoni: big ass rigatoni and they are not kidding about giant beans, yum yum. <br>-Tri-Tip Steak: some good steak, very flavorful and juicy<br>Side notes: (1) they have bread for the pasta sauces. Do not, I repeat do not skip the bread. How else are you going to soak up all the saucy goodness left in your bowl (in a socially acceptable at nice dinner way)?? (2) sit in the back patio, string lights and more space. <br><br>Be back soon Giant. Xoxo.", "pics": null}}, {"review": {"des": "One of the best meals I have had in Chicago! The service was great. Our waitress was very attentive and helpful as we picked our items off the menu. The ambiance itself was interesting, very cozy, a little crowded but it didn't matter, because the food was just so good!<br><br>The pasta was cooked perfectly, and the Tagliatelle with the crab was full of flavor. We also ordered the biscuit, onion rings, ravioli and steak. The steak was an interesting fusion of South American and Asian spices, very unique and very delicious.<br><br>The banks dessert was a little underwhelming but the ice cream on the side was very good. Overall great meal.", "pics": null}}, {"review": {"des": "I just don't understand the hype. First off, the tables are jam packed in there. I mean you better not have to go to the restroom because they literally have to pull the table out so you can get into your seat. Your table is an inch away from your neighbors table. So much for a romantic dinner date. We ordered 4 items to share. Two were yummy and two were just not good. Skip the onion rings. You will thank me later. The lights also need to be turned down.. does anyone want to go to dinner with a spot light on them? Again, I just don't understand the hype.", "pics": null}}, {"review": {"des": "Ever sit at your desk at work on a Friday trying to figure out where to take your significant other to impress them with your subtlely sophisticated culinary palette? This was the perfect place. We started with the jonah crab salad, which is served with waffle fries. It's delicious, packed with flavor but our next dish, the green beans with pork, feta, and mint were even better! The next plates were bigger, a pasta one and the tri tip steak. The steak was amazing - my favorite dish of the venture. Mmm, I can't wait to come back!", "pics": null}}, {"review": {"des": "I'm visiting from Hotlanta, knew Giant coz it won the No.6 2017Top10 New Restaurants in the U.S. by Bon Appetite. Before I came, I just dinned at 2017 No.7 Spring, and 2016 No.1 Staple House in ATL. After dinning here, I think Giant really deserve this honor. <br><br>So I should say we're really lucky -- walk-in as a group of three around 5pm and got the last little corner table (otherwise, only kitchen countertop available, which should also be a fun experience, since the chefs just cook right in front of you).<br><br>Round One<br>To start, we had some booze (The country mouse I had, was really pinky, fruity, sweet and delightful) and four appetizers: <br>1.Crab Salad+Waffle Fries -- one of Giant's signature plate, and it is!<br>2.Thai Chili Sweet Corn -- creative combination, sour, savery & sweet, all mixed well together, tho they served it at last of our meal;<br>3.Onion Rings -- one of the best deep fired item I've ever had, they made these simple daily snacks in an upscale well, and lift-up \"the soul of the food\";<br>4.The Eggplant -- oh man, pro the best western cooking eggplant I've ever had (well, I had many impressive oriental ones)<br><br>Round Two: Pastas! To be honest, I'm not a typical \"italian noodle\" fan (so spoiled by my Asian Lamian, udon or ramen -- since it is part of my family biz)<br>But Giant's perfect execution really blew my mind: <br>1. Tagliatelle -- with saffron, king crab~~ just fancy it up!<br>2. Double Ravioli -- with ricotta and oyster mushrooms~~ creamy dreamy yuuuumy<br><br>Round Three: At this point, we are already soooooo full. I was so eager to try the pork, but my friends don't. So we end up with the Tri-Tip Steak<br>Again, we all loved this dish, it was perfectly seared (such thin crispy but jammed with tones of flavor), yet so pink and juicy inside, and it only cost $19 (I guess around $40-$50 in any steakhouse) I should call it a magic. The meat alone is so fantastic already, and it goes with some funky \"Red Sauce\" and \"Green Sauce\" quite side kicks.<br><br>Round Four: desssssserts!<br>WE are all so so so full, but willing to try what sweet surprises Giant gonna offer. <br>1. Cajeta Ice Cream -- creamy soft \"southern custard\" style with very strong cinnamon spices, and pecan scrambles. <br>2. Horchata Pudding -- Raspberries in Syrup. Man, I've never had any type of dessert in this format, it was a great combination of : sweetness, fruitiness, sourness, crunchiness and creaminess. I wish there are a bit more popping wild rice or the crispy cookies on the side, coz I love the \"crunchiness\" so much..... It is a very joyful and playful sweetness + happiness bowl, just like brings you back to your childhood, we were like young silly boys sitting in front of it when spooning the last portion of it.<br><br>Overall, the decor, the vibe and the service are all so well organized and mingled together and brought this eatery ALIVE. We had a really wonderful meal for 2hrs, and there're line waiting outside already, on a Tue evening; We wend next door Scofflaw for a few more booze to wash down our food. Passing by after 9pm, we found Giant was still jammed, I bet they got a 3 turnover rate per table -- solid prove, people know where to satisfy their stomach. <br><br>Can not wait to come back try more next time visiting. (or moving into Chicago?)", "pics": null}}, {"review": {"des": "To start off - the service here is absolutely outstanding and deserves its own 5 star review aside from the 5 stars that the food gets. <br><br>A couple weeks ago, we tried making reservations and the soonest we could get was in January. Crazy! It's a good sign if a place is that popular right? Last week, my husband checked again to see if there is anything sooner and we got in for 8:45 pm last Thursday. So, we get there and we didn't get seated until about 9:10. They were really nice to update us and were super apologetic. We get to our table and they bring us complementary biscuit and butter and marinated zucchinis and apologized for having us wait. Wow. That speaks highly for a place that is that caring about their customers and acknowledges something like this. <br><br>The food:<br>Biscuits - they were kind of dry, but I guess that's what biscuits are. The jalapeno butter was to die for though. <br><br>Zucchini - yum! I probably would not have gotten this if they hadn't brought it to us, but I'm so glad they did (I had my eyes set on the broccoli, but that will have to wait until the next visit). It was just so good. If you like zucchini, get it. If you don't, you should still get it because it's just that refreshing and good. <br><br>Short rib - this was the cutest little dish. The short rib was outstanding. It came in mini-steak form and was deliciously charred on the edges. Full of flavor and tender. It was on top of sticky rice with a spicy chili sauce. Read: spicy. If you're sensitive to spiciness like me, it might be a little bit too much heat for you. I can't tolerate much, so I had to stop eating this dish after a couple bites of rice.<br><br>Eggplant - If you love eggplant, get it. This is super unique and the flavors were outstanding. I have never tasted anything like it and don't even know how to describe it, but pure goodness. This was a tad spicy, but not nearly as spicy as the sticky rice. ALSO, the bread on the side - oh my goodness. That should be its own dish. it was absolutely amazing and I could have eaten about 10 more of those. <br><br>Double ravioli - if you've never had pasta that simply melted in your mouth, this is the dish to try. The pasta was amazing and the cheese and carrot filling pulled it all together. The cream sauce on top was perfect and didn't take away from any of the flavors. Highly recommend this dish. Don't skip it!<br><br>Raspberries in syrup - who can pass up dessert? We were so stuffed from all the dishes mentioned above, we wanted something light (but the babka is next on our list!). The raspberries were perfect and the horchata pudding was cool and creamy. I didn't care for the biscuits, but they had a nice crunch. <br><br>We're definitely keeping our reservation for January and I would love to come back a couple more times. The food is super unique and there's still so much more I'd like to try (and even try again!).", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/E-9jNmaH0QHVQRmYePPi7A/348s.jpg", "caption": "Raspberry dessert"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ygxx6uX0MF2ZSdgSwspYPQ/168s.jpg", "caption": "Incredible ravioli"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1Hzp9ppPWvO9rDHyqwNLXQ/168s.jpg", "caption": "Spicy short rib"}]}}, {"review": {"des": "Just WOW! Love the Shel Silverstein poem posted on the wall. Great cozy atmosphere. The staff is great, friendly, and attentive. We made a reservation 3 weeks in advance, it was hard to find an open reservation. They do take walk-ins, but the wait varies and depends on whether the patio is open. If you're going to try a walk-in I'd try when the patio is open. Otherwise Scofflaw is next door so you can always hang out there with a pre dinner cocktail. <br><br>One neat thing to note is that they add 2% to your bill. This goes towards healthcare for employees. The waiter explained that the owners pay 1/3, the employees pay 1/3, and the 2% on your bill makes up 1/3 of their heath insurance costs. I thought that was a pretty great idea. <br><br>Anyways to the main event the food. <br><br>Uni Shooters $5 per shooter: The texture of this was great. Crispy on the outside, and creamy on the inside. The Uni inside was sweet and creamy. The waitress told us the way to eat it is to put the whole thing in your mouth. So its a juicy explosion in your mouth. If anyone is worried about the uni, don't. It isn't over fishy or strong. The contrast between the shooter with the side of cucumber, that is tangy and fresh is well done. <br><br>Thai Chili Sweet corn $12: The waiter told us this was his top 3 favorite dishes, in addition it is seasonal. We obviously HAD to try this. I'd describe it as a more complex flavored elotes. The sauce is creamy with a little zing from the thai chilis, combined with the crispy topping made of a perfect bite. <br><br>Tagliatelle $19: homemade pasta with buttery sauce and crab. You were given bread to soak up the sauce, and we definitely soaked it all up. While this was our least favorite dish, it was because the others were outstanding. <br><br>Baby Back Ribs $19: We were full at this point, but I could still appreciate the complex flavor profile of the sauce. Sweet and a little spicy kick to it. The meat itself while tender, was still a bit chewy for my taste. <br><br>Cajetas $10: Dessert! To sum up how much we liked this better version of a strawberry shortcake ice cream bar...My boyfriend who usually doesn't care for dessert started to eat my half of the dessert. He's lucky he didn't lose a finger. The strawberry with the crunch of the pecans and ice cream was one of the best desserts I've had. <br><br>All in all I would definitely come back when the dishes change. Great casual restaurant with modern take on food. While the prices are a little bit pricey, the food is high quality. It's a \"once in a while\" special restaurant for us.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/W_CxXDcO_zFqMc4Q49MBlg/348s.jpg", "caption": "Vanilla Cajeta Ice Cream with strawberry $10"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XWrXt7S-N-_Qq5MGMS5sgw/168s.jpg", "caption": "Baby back ribs $19"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EiWkn-9uueaNTRppUyeG_w/168s.jpg", "caption": "Tagetelle $19 and Thai chili corn $12 in the background."}]}}, {"review": {"des": "Made reservations here for a Friday dinner, seven weeks in advance - we snagged a 9pm seating.<br><br>I was super excited because as you have seen, there is a lot of hype and buzz on the foodie streets about this place.<br><br>We were promptly seated at what I can only say reminds me of a Valentine's Day dinner table, where you're about four inches from the 2-tops on either side of you. I understand that they are booked solid for weeks, but perhaps removing one two top would allow for a little space so I'm not confused about who I'm at dinner with and which conversation or dish I should be a part of.<br><br>I was surprised at how many wines they were out of, and coincidentally all the ones that were on the lower end in price - four of them that I asked about were no longer available so we had no choice but to get a bottle from a higher price than we had planned. It was fine, just something to note.<br><br>Moving onto what everyone cares about - the food. We shared six plates and polished them all off:<br>1. Uni shooter - super creative, one bite, burst of flavor (looks like a croquette, not a shot of uni)<br>2. Biscuits with jalapeño butter - crumbly, warm<br>and comforting <br>3. Eggplant - people rave about this but having experienced a lot of eggplant in Indian home cooking, it was good but nothing compared to what I have at home<br>4. King crab tagliatelle - butter, crab, noodles, herbs - yum<br>5. Snapper - enjoyed this one over the green vegetables, tasted very fresh<br>6. Onion rings - decent, too much Parmesan, and I compare all onion rings to the ones at Pequod's<br><br>All in all tasty and I would come back to try different dishes in other seasons!", "pics": null}}, {"review": {"des": "GIANT!! I'm beaucoup obsessed. Man Logan Sq has so many gems...should I just move up here??? Just kidding as if I'll ever leave the Loop. <br><br>Anyway, food at Giant is damn good. Here's what we ordered: <br><br>1) super uni shooters - $5/ea. Just get them. <br><br>2) happy scallops - serve w/ soba noodles. i love these! <br><br>3) tagliattelle -  this was my LEAST favourite dish of the night. don't get it and pick another pasta. <br><br>4) short ribs - a million times yes yes yes YASS! <br><br>5) broccoli - decent but nothing to write home (a review) about. <br><br>6) babka - dessert. decadent and delicious. <br><br>7) cocktails - i ordered over half of their cocktail menu. but to be fair to me, they only had like 5 cocktails... <br><br>Next time my friends/fam from out of town want to go to Girl & the Goat for the 90th time again, I'll say nay! I take you to Giant!", "pics": null}}, {"review": {"des": "The food here is impeccable. The cocktail list is short but serviceable. The space is small and intimate, and sometimes that means you will end up waiting a few minutes after your reservation time for your table. But once your dishes start arriving, those few unpleasant moments will be wiped from your memory. Jason Vincent himself runs dishes to tables and I couldn't tell him thank you enough.<br><br>Fried super uni shooter - one bite, maybe two. Delicious, great texture.<br>A little biscuit - served warm, and the jalapeño butter has just the right amount of heat.<br>Jonah crab salad - not sure what technique they're using to achieve the amazing texture on the waffle fries but it's even better than Chick-Fil-A (lol). So crispy without being at all over cooked. Crab salad is cool, creamy, perfect complement.<br>Happy scallops - though this is listed early in the menu it was actually served to us last, which I didn't mind at all. What a bite to leave on! Nori butter and a super savory situation going on, so good.<br>Green beans with pork cheek and feta - favorite dish of the night. Who knew green beans could be so good? Not sure what was in the sauce but omg. The saltiness from the feta, the crisp chewiness from the pork cheek, bright herbaceous points from the mint - wow!<br>Short rib - definitely Thai flavors here, excellent combination of meatiness, herby goodness, sticky rice, crunch from the peanut, a bit of heat. Ugh. I wish I could make food this good.<br>Eggplant - this dish is my FAVORITE. I hate eggplant, or so I thought before having this. I also thought I didn't like curry powder but hey, this dish changed my mind. I think this is a must.<br>Pastas - these are all good but actually my favorite dishes end up being everything else I order. If I had to pick a favorite, I think it would be the pici, but you really can't go wrong.<br><br>It's dangerous to have this place down the street. It's everything they say it is and more.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4d-w8U14NqERryDHycHEeA/348s.jpg", "caption": "Short rib"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JemShylX_K9696l4R1-s5g/168s.jpg", "caption": "Green beans"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oy--evOM_LZXdEZovNBNAA/168s.jpg", "caption": "A little biscuit"}]}}, {"review": {"des": "SOOOOOO GOOD. I enjoyed every single bite of food I took while at this restaurant. I'm four months pregnant, so I've been pretty bummed that I can't have a cocktail with a nice meal. They have a non alcoholic cocktail, the N/A-Groni, which trickled my brain for the entire meal. Every single item we ordered was perfect, especially the pasta dishes. I highly recommend for anyone. <br><br>It's busy, loud, and fun but we still had a wonderful time.", "pics": null}}, {"review": {"des": "This place is amazing and deserves all the hype that it is getting. The food, staff, ambiance, and other customers make it a place not to be missed, especially for a date night dinner. <br><br>WE got here around 7pm without a reservation and were told the wait would be about 40min (aka anywhere from 20min to 1:30hr) Instead of waiting for an inside table, we happily accepted an outside table for immediate seating. They fired up the heaters and it would have been 100% comfortable if we were dressed for the weather. Since we fell a little short on sensible dressing, it was a little chilly, even for an August evening, but not bothersome. <br><br>We ordered a handful of things and each was unique and delicious unlike any of the other plates. First course: Little Biscuit with jalapeno butter, crab salad, and sweet corn. Each was filling and delicious. The little biscuit is just that, little and left us wanting more but each bite was marvelous. The crab salad was served cold which surprised me and, besides being obviously 100% fresh, it was plain BUT when paired with the waffle fries, it became something majestic. This compositional choice must not be overlooked but appreciated. Sweet corn was filling and sweet. <br><br>Second course: snapper and tri-tip. These meats were savory and delicious hence the high marks. Despite this, I wouldn't get the snapper again, it was good but nothing special and I failed to read it came with peas (100% my own fault). The Tri-Tip was a masterpiece to eat, sweet and savory, spicy and complex but then balanced with the mushrooms... I would go back to Chicago for this tri-tip. <br><br>I can't remember what cocktails we had but they were spunky and potent. :) <br><br>PROS: comfortable, love the tapas style, yummy/filling dishes <br>CONS: long wait, chilly outside <br><br>p.s. there is an awesome resident cat on the patio", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/j7kbDuwjc794hpzPEoslJw/168s.jpg", "caption": "Kitchen cat!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NXBx__84LCQYNz_LP1rbDw/168s.jpg", "caption": "Patio!"}]}}, {"review": {"des": "Prepare your wallets or prepare to leave hungry.<br><br>The hype about the food is well-earned, but I can't help but feel a bit of that self-inflicted pain after seeing the amount of $ for the amount of food I got. But yes, the food is incredible! We tried the tagliatelle, tri tip steak, and broccoli. The flavors in all the dishes were amazing together, and we scraped each plate clean!<br><br>To end the night, we asked our waiter what the best dessert was and he answered \"babka\" with zero hesitation. So glad we took his recommendation, because the babka was phenomenal!<br><br>Amazing food and amazing service!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1eyPIaJjGSw8dOc3jM9LTA/348s.jpg", "caption": "Tagliatelle - yum! Wish I had more than three bites"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZBKjToaFMbOSkP5uXPozow/168s.jpg", "caption": "Broccoli - wow! But such an itty bitty plate for so much $"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xIJnuc9c3KDWuHsheDem4A/168s.jpg", "caption": "Tri tip steak - very well seasoned, loved the mushrooms"}]}}, {"review": {"des": "Honest review: foods good be warned the host stand is rite behind the curtain u might bump into it/get here before 630 if you do not want to wait a really long time it is very small inside there are a total of 18 2 top tables in the dinning room and 8 seats I think at the bar so it gets crowded fast. The tables are extremely close together if you are claustrophobic this isn't the place for you. The portions are tiny so if you eat a lot or have a normal appetite order more then you normally would I'd say if your skinny 4-5 dishes if your bigger 7 will do.  the service was really good really attentive described dishes and was really nice n they gave new plates n cleaned the table. The foods really good one complaint is to get rid of all the pasta dishes there are so many Italian restaurants in chicago either make the pasta dishes unique like the scallop dish or make more creative dishes. Update desserts they were good but a 12 dollar dessert has to be the best dessert i ever hadBest things piri piri pork, eggplant, tri tip/scallop/babka, lemon <br><br>3.5/5 Happy scallop $19  i liked this. It was spicy and the scallops were cooked perfectly n the bread crumbs on top added crunch but was a little salty loved the addition of noodles <br><br>3/5 Tuna $14 this was tasty the tuna was cooked good loved the falafel for crunch but it didn't have much flavor to it loved the chickpeas n couscous my issue is I didn't taste any dates so put more the sweetness would be great<br><br>5/5 Piri piri pork $16 amazing second best dish of the nite. The pork belly was crispy and tender adding a wonderful salty flavor. Then there's Greek yogurt to tame down all the flavors the orange adds a sweet bitter note this dish was so flavorful so complex it's a flavor explosion the one thing though is try the dish first before you eat the orange because the bitter flavor could be off putting to some people <br><br>5/5 Eggplant $14 (ask for two more pieces of roti bread you will thank me later for this tip) this was the best dish I've had in a long time it was phenomenal. The first thing you notice is all the texture there's cashews then fried rice that add so much crunch and the eggplant is so flavorful and complex this dish is perfect for people who are afraid of Indian food it's a great way to convert them. The roti bread was to die for it's thick like a pancake couldn't stop eating it literally wanted to order this again<br><br>1/5 Short rib $15: worst dIsh of the nite. I think the short rib was cooked perfectly n loved the sticky rice it was so different it was like a really cheesy risotto. But the dish was bland honestly there were no big flavors like the other dishes <br><br>5/5 Tri tip  $19 amaizin. Ive had a lot of steak before and this was my favorite preparation. The steak was cooked perfectly melted in ur mouth and had the best crunch it was as if they fried it wanted to order a really big steak thats how good the preparation is. I loved the mushrooms they had a good sear on them n added an earthy flavor. I loved the sauces so flavorful my only complaint put more of the sauces<br><br>Babka $12 (gourmet Cinnabon) amazing the babka was really flavorful only issue it was really dry the ice cream was so good just put more. Then theres fruit that adds sweetness and texture. This dish needs moisture fix that n itll be the best dish ever<br><br>Lemon cake $12 ( looks like an eggs Benedict) i loved this because it wasnt to acidic. The sauce was amazin. Loved the lemon curd it cut through the sweetness. The marshmellow was really tasty i like the waffle for crunch my issue is that the cake was dry and something in the dish was bitter. Loved the nuts for crunch", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TPD-uOc7yWTZA6UrRQP-Tw/348s.jpg", "caption": "Bill"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DcxVRNB9hNW-1HaDEDVsVA/168s.jpg", "caption": "How uncomfortably close and tight the inside is like good look going to the bathroom"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zPHoP5GwXw4sawltChUM6Q/168s.jpg", "caption": "Inside"}]}}, {"review": {"des": "I had been waiting patiently - okay, quite impatiently actually - for my bestie to visit and for us to plan our bff date night here. The place did not disappoint! After a whole 3 days of foodie indulgences all over Chicago, we had saved Giant for the near-end of her trip so it had a high bar to meet. The flavors of each dish we tried were impressive and memorable. The variety was great. I am vegetarian and gluten-free - the former was not an issue but the latter was a bit of a struggle for the restaurant to accommodate in combination with the v. The place is so casual but the food is not! The service was really good too.", "pics": null}}, {"review": {"des": "Sat at the walk-ins table back by the kitchen. To me this is the perfect spot to really experience a restaurant. The food was amazing and the staff and chefs were great!", "pics": null}}, {"review": {"des": "The food: 4/5. We tried zucchini, pici, tagliatelle and red snapper, with the zucchini and red snapper being the highlights for me. The food is delicious, but also greasy. Every dish we tried had a pool of oil on the bottom, so it's definitely not for the health conscious. Additionally, I would've liked to see more vegetarian friendly options on the menu. <br><br>The service: 4/5. We showed up at 5.30 on a Saturday night and there was no wait. The patio is very nice and the service was prompt and friendly. However, they oversold us on the number of dishes and they have very limited choices of wine by the glass. <br><br>Overall: 4/5. A good addition to the area and worth checking out, but I probably won't return in a while.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_E62WCYxZzBcTY1qYgFS3Q/348s.jpg", "caption": "Lobster tagliatelle"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eX6PKkg9aFVE73rHi0uhJA/168s.jpg", "caption": "Red snapper"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/EqnIOr7ARzCd975Kbcf5QQ/168s.jpg", "caption": "Pici"}]}}, {"review": {"des": "This place is such a little gem! <br><br>Decor and ambiance is really great.  You feel very welcome the second you come in.<br><br>Service is very attentive.  All the staff is super helpful.<br><br>They make onion rings taste amazing. Should I say anything else?<br><br>The picci and the steak were my favorite dishes. <br><br>We got a couple of others, but from what we got there was not one bad dish served.<br><br>The cocktails were amazing and the wine list is also superb.<br><br>Highly recommend this place whether you are a local or a tourist.", "pics": null}}, {"review": {"des": "I just had one of the top three meals of my life here. <br><br>I don't understand how anyone is saying they aren't impressed. Food doesn't get better than this.<br><br>We came here in a large party (the staff from my Wisconsin dental office) and my boss had made these reservations a few months ago. (Yes MONTHS, and DO IT.) It was 100% worth it. He told them when he called that we had one member who doesn't eat pork, one that is vegetarian, and one that is vegan (me.) They provided us with ALL those accommodations and they absolutely blew us away.<br><br>Jason brought many of the plates out personally, including one vegan broccoli dish that he said they are adding to the menu TOMORROW and we got to try it first!<br><br>Every. Single. Dish. That I had was perfect, IMO. They aren't shy with the spices, and all the flavors were balanced and singing together. For my part, I think it shows expertise to not just eliminate the meat from a dish, but create one that really shines on its own - and every dish I had was an exciting \"stand alone.\" <br><br>Our sommelier was so helpful, and the cider I had was the best damn booze I've ever sampled. Well, it was.<br><br>Our server Patrick was laid back and removed any possibility of a stuffy atmosphere. <br><br>The chef, Jason, was absent on our departure, narrowly escaping a warm hug from me.<br><br>If you are vegan, call ahead, and you will be richly catered to. I was scared looking at the menu, and I need not have been. These are real  chefs making lavish flavors that will create a memory to last your lifetime. THANK YOU!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aEbNgIx2zgFYIVbyDi66Fg/348s.jpg", "caption": "Thank you, Jason of Giant on Armitage, for a vegan, vegetarian, no pork and omnivore feast that we will remember forever!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AYsljD2pl67CUdNoscIYXg/168s.jpg", "caption": "Vegan citrus sorbet and strawberry syrup. Cup of coffee. Perfect finish."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wJLHml9xed03D2GXYhNt6Q/168s.jpg", "caption": "Arial shot of the food at the END of the meal... this is only the last course!!"}]}}, {"review": {"des": "Nightwood was once a favorite, so I was enthused to hear Jason Vincent was behind Giant. The cuisine is still American, yet diverges from the classic preparations offered at Nightwood. There are subtle Asian, Italian and Mexican influences as well. Overall each dish was executed well. The biscuits with jalapeño butter embodied simple done right. .. perfectly light texture with buttery decadence.  The Tagliatelle and the Pici were both acidic in a good way and impeccably al dente. Crusty, well seasoned steak was another highlight.<br><br>The chefs overheard me calling out the spices in the Tri Tip and gave me kudos. For the duration of the meal, the chef tested my knowledge of each preparation. It was like a Top Chef challenge without the pressure of being demeaned by Gordan Ramsey!! That made the experience particularly memorable. They even offered me full recipes​ at the end of service. My cooking is far from chef quality, but I don't mind a little trial and error. Lol. I'll definitely give it a go soon.<br><br>We capped off dinner with the Cajeta Ice Cream. Wow!!!! Growing up I loved Strawberry Shortcake Good Humor bars. This took me back to being the kid that always wasted ice cream on his clothes. Freeze dried strawberries, pecans added texture. I normally hate goat cheese, but the caramel balanced the sweetness with tang. I'll be back to enjoy more items as they change the menu.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/U8nyOGB9vqP4walU_5MFqw/348s.jpg", "caption": "Vanilla CAJETA ICE CREAM - strawberry, pecan and goat cheese caramel"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/C4M1dn7BQoyujvowSqhXeA/168s.jpg", "caption": "TRI-TIP STEAK - green sauce, red sauce, sour cream and mushrooms"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zpLT3YnOMPTlJ7sCnjgAdg/168s.jpg", "caption": "PICI, with CHEW - jalapeño and bacon"}]}}, {"review": {"des": "Have been wanting to try this spot out for months and it did not disappoint!  The space was intimate and hip.  Our waitress was very welcoming, and did a wonderful job walking us through the menu.  And the food is deserving of all the hype it has received. <br><br>My girlfriend and I shared all of our plates, and enjoyed all of them.  Especially recommend the tri-tip steak and garlic buttermilk potatoes.  Will for sure be coming back and raving about it to everyone!  Phenomenal experience!", "pics": null}}, {"review": {"des": "Okay. Giant was on my list for an eternity. After hearing about it being called the best new restaurant in the country and raved about by countless people... we finally made a reservation a month in advance for my birthday. <br><br>First off - the restaurant is very befitting of the neighborhood. Despite its accolades and popularity, its unpretentious. The service was also friendly. The manager even made rounds and checked in with diners. Always a nice touch. <br><br>The format of Giant is small, shareable plates. The recommendation is 2-3 per person. We were feeling fancy, so we did 8. <br><br>-Little Biscuit $3: I mean, it was a good biscuit. And we really enjoyed the jalapeño butter. But the free biscuit we were served at BOKA was almost better. <br>- Onion Rings $10: Deeply fried and generously heaped with Parmesan. They were almost intimidating in size. They were pretty good, but not mindblowingly so <br>- Short Rib $15: Possibly my favorite pit of the bunch. The short rib was melt in your mouth tender and I love the spicy kick and Thai fusion this dish presented. <br>- Tagliatelle $19: This was highly recommended by the server and I must say it was a bit underwhelming. There was maybe one claw's worth of meat and the chili butter was a bit tart. <br>- Baby Back Ribs $19: My boyfriend thoroughly enjoyed this and loved the smoke on it. For a good sized slab of ribs, I think the pricing on this was very fair. <br>- Buttermilk Potatoes $8: Decent mashed potatoes. We did not finish. <br>- Cajeta Ice Cream $10: I loved this, but it kind of reminded of a fancier version of the Good Humor strawberry shortcake bars you got from ice cream trucks. <br><br>Overall, it was a good solid meal with pleasant service. I don't feel that any particular dish was particularly memorable where I would go out of my way to eat it again. It's also pretty pricey and difficult to get into.", "pics": null}}, {"review": {"des": "Great service. Fun room. But every dish felt like random ingredients sweepstakes. No balance. No nuance. Which is a shame because you know the kitchen could if it wanted to - they obviously really know what they're doing.", "pics": null}}, {"review": {"des": "I've been hearing rave reviews about Giant for quite a while and I finally made a reservation.<br><br>We ordered the Happy Scallops, Jalapeno and Bacon Pici, King Crab Tagliatelle, Short rib and sticky rice, and the Broccoli with tofu and pumpkin seeds.<br><br>The most surprising dish was probably the Broccoli.  We ordered it because we simply needed a vegetable but this dish had a great balance of flavor, texture, and uniqueness.  Fried chickpeas and pumpkin seeds added crunchiness while the green curry gave it a good spice profile.  The tofu helped in rounding out this dish so you're not even aware that you're eating vegetables.<br><br>The short rib was favorite of the night with a little bit of heat from the chili, texture from the sticky rice, and tenderness from the short-rib.<br><br>The pastas are full-flavored but my fiancee thought they were a little on the salty side.<br><br>One thing to note is that Giant has quite the following so I had to book a Saturday 6:00pm reservation about a month in advance. This is no fault of the restaurant but if you're looking to try it out, as with any high demand restaurant, look to off-peak hours for more availability.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zG9oVc6cRAdUcIMQU1c8Nw/348s.jpg", "caption": "King Crab Tagliatelle"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-tt0jCAJ_S0zFas1-gDX6w/168s.jpg", "caption": "Short rib and sticky rice"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UVxAovhjppZ7DbdRj1CWkg/168s.jpg", "caption": "Lemon cake"}]}}, {"review": {"des": "The name Giant would be correct if we are referring to my experience this past weekend. A GIANT disappointment. <br><br>My husband and I went here as a precursor to our anniversary celebration. We had been wanting to try this restaurant and the first time we went in it was without a reservation and we could not get a table. So we learned from our mistakes and made a reservation this time around.<br><br>First let's address the ambiance. This place is small and quaint yet its size does not cater to the enormous crowds of patrons who come to dine here. It is overly crammed with guests having to sit so close to each other that if you need to escape the confined quarters of your table you literally have to move the table to get in and out. It's absurd and uncomfortable. The noise level is too high, between the music and being able to hear the conversations of the other guests sitting up under you, it's pointless to go here and think you're going to be able to have a normal discussion without shouting and straining to listen. <br><br>As for the food, we ordered the crab salad, little biscuits, short rib, miso halibut, pici, tagliatelle, and garlic buttermilk mashed potatoes. Out of them all the top dishes for me were the little biscuits and the potatoes which were deliciously rich. All of the other dishes were just ok and were really tangy and/or sour. The overpowering sourness in majority of the dishes was off putting. I expected more of the tagliatelle and was looking forward to it the most. It was disappointing and would have been better in a cream sauce. The noodles in the pici were a bit too tough for me, the short rib was not memorable, and the miso halibut was decent but nothing to write home about. <br><br>The service was mediocre and not very welcoming. The waitress and hostesses seemed dry and unenthused. They could have done much better. <br><br>Our bill came to a little over $100 without drinks or dessert which I felt was reasonable. Nonetheless, this place is nothing special and did not live up to the hype that many of these reviews are claiming.", "pics": null}}, {"review": {"des": "After reading about Giant on the Eater Chicago Top 38 restaurants, I was really excited to take my family to Giant for dinner.<br><br>I'm always reluctant to write a bad review of a restaurant because I know it's the hardest business in the world with the smallest margins.<br><br>Nonetheless, Giant failed to impress. Our server was super helpful and spent a great deal of time explaining the dishes and beverages. Huge asset to the restaurant.<br><br>From there everything else was less than stellar. <br><br>Firstly, the tables are crammed into this dining room so tightly that you can consider this restaurant a \"Communal Table\". You will be included in your table mates conversation, whether you like it or not.<br><br>Second, the food just wasn't that great. Crab Salad was mediocre, Eggplant was muddy and too sweet, King Crab Tagliatelle was too small and short on actual crab, Halibut was very good with it's miso glaze, but the fennel slaw and sauce overpowered the delicate fish. The Sausage stuffed rigatoni was good but the portion was too small.<br><br>The strange​ part was that everything had this high acid flavor like too much lemon was squeezed on the dish before it was served. Almost like the chefs were trying to hide a flavor, like that of crab that was past it's prime.<br><br>The ambient noise in this restaurant is at 4 bombs level and despite the loud music and tight quarters you could barely hear your dinner mates speak across the table from you.<br><br>Summation: This restaurant just seems to be trying too hard to be unique and innovative with little value in the end product.", "pics": null}}, {"review": {"des": "It's really a tight restaurant and not appropriate for larger groups. <br>Tried 4-5 dishes from the menu and everything was flavorful. My recommendation is the tagliatelle. We skipped dessert and coffee as the place became too tight as the night progressed.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/k69tIh2E3XqYZ08YZ-QCrA/348s.jpg", "caption": "Jonah Crab Salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-9VKGgUo_-VS3nX1n3Xddg/168s.jpg", "caption": "Lasagna"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-Vmnr-P3cCu-HVKxMfvhYg/168s.jpg", "caption": "Tagliatelle with crab"}]}}, {"review": {"des": "Very good! The space itself is pretty tight - it holds maybe 50 patrons or so. And the tables are crammed together, so much so that the guy sitting next to our table kept bumping elbows with me lol. Since everyone is in such close quarters and there isn't a whole lot of space for the sound to travel, be prepared to talk a little louder and lean in a little closer than normal. It's definitely not the place to have an intimate personal conversation.<br><br>The food was good! I would compare the style to Girl and the Goat, with an emphasis on pasta. For drinks I got the berry gin and tonic which was nice, light, refreshing. I tried the biscuit, which was heavenly and with the jalapeno butter was even more heavenly. I tried the happy scallops, which I wholeheartedly recommend and were my favorite thing here. The scallops were cooked perfectly, the soba noodles were delicious, and I liked that there were some crispy noodles in there as well. The dish was bursting with flavor. I also tried the sweet and sour eggplant which was delicious, and even better with the naan-type bread it came with. Lastly I tried the tagliatelle with king crab, and unfortunately I do not recommend this dish. While the flavor was good and the noodles were cooked perfectly, there was too much oil at the bottom of the plate for comfort. I didn't feel sick after or anything, but the pool of orange oil wasn't nice to look at and made me feel guilty about eating the dish. Also the taste of the crab was just meh - it didn't taste all that fresh to me. But - I loved that they brought bread out for the table to eat with the pasta dishes. Outside of this one dish, everything was great. Our server was nice, no nonsense, and did what he needed to do with finesse. Overall a great experience and I would recommend!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/u4_9pILp3pNSbu21RaHo6w/348s.jpg", "caption": "Berry G&T"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aRggLqdo_cbg3aNDPnQOJg/168s.jpg", "caption": "Tagliatelle with king crab"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5j4-LxCKHPuo8ig8aPYjlQ/168s.jpg", "caption": "Happy scallops"}]}}, {"review": {"des": "Saddened by the disappointment in my taste buds.  After waiting for a reservation to work with my schedule I was very excited to eat at Giant.  Hearing all the hype of the food and the eclectic space I knew I was in for a treat.  I wasn't aware it would be a greasy one.<br><br>Every dish on the menu is fried or prepared in a significant amount of oil.  I mean what doesn't taste good going down that's made in tons of oil?!  It doesn't feel so good the next day!<br><br>We tried the super uni shooter, little biscuit with jalapeno butter, onion rings, tagliatelli, eggplant and churro.<br><br>The uni shooter was a delicious start that set the tone that there were good things to come.  The little biscuit was just that absolutely little.  May as well call it tiny bite for big price.  The onion rings were reviewed to be wonderfully crisp and great flavor.  The only flavor I got was oil.  The Tagliatelli was just unmemorable.  The eggplant didn't impress me but only because I'm indian and the flavors were just given some fancy name to lure you in.  And finally we ended the night with a greasy flavorless churro that I left mostly on the plate. I've never been known to pass a donut or fried dessert but this had no flavor at all.  Just fried dough.  The whole meal felt that it was rushed out of the kitchen and no thought was put into what was so well known around the Chicago food scene.  I don't think I would recommend a venture to Logan Square for Giant when there are better places to eat in the hood.", "pics": null}}, {"review": {"des": "One of the best dining experiences I have ever had! When ever I visit Chicago for work, I make sure I try some new places that have been on my radar.<br><br>I had heard of Giant through Eater and was looking forward to trying it. I thought the concept sounded cool and different but was weary of how the dishes would taste as I thought it was an ambitious concept.<br><br>I went there on a Wednesday and waited a while for the chef counter. It was WELL worth my wait. I felt like I was brought into a culinary experience that was captivating!<br><br>All the chefs introduced themselves to me and told me I can ask them any questions about what they are doing. I asked several questions and wound up building a rapor with the chefs. <br><br>Every dish I had was perfectly thought out, exploding with flavor, and had an incredible mix of textures. I couldn't be more happy with my experience at Giant. I will be coming back ASAP.", "pics": null}}, {"review": {"des": "Easily one of the best restaurant experiences I've ever had.<br><br>We had four dishes (Spicy Broccoli, Eggplant, Short Rib, and the Ravioli). Honestly probably the best tasting food I've had in Chicago. But the experience didn't stop there. Our server was very nice, super informative and her recommendations for drinks and food were on point. <br><br>While we were dining, we accidentally knocked a plate over and it landed on one of our shirts. Before the plate hit the floor, it felt like three employees were at our table asking if we were okay. They brought us a fresh plate of food and the manager even offered to pay for our dry cleaning. While this wasn't expected, it was greatly appreciated. I've never had an experience at a restaurant where I've felt more at home and cared for.<br><br>If you're in Chicago, I would recommend this restaurant. If you could, go every day! It's worth it. GIANT two thumbs up.", "pics": null}}, {"review": {"des": "Giant is an uber cozy, perpetually busy spot in Logan Square that I've been dying to try. Snagged what can only be described as a competitive Saturday night reservation at Giant last weekend with a foodie friend from New York -- the experience was divine. <br><br>We split a bottle of rosé, which our server kept chilled away from the table and dutifully visited us to refill, as to preserve precious table space for our dining experience. We had two of the Super Uni Shooters to start, which were tiny and bursting with umami, followed by the asparagus with fancy sheep's milk cheese and almond, which was delightfully complex in texture. The eggplant with cashews and pancetta was our next cold plate, followed by the tagliatelle with king crab and chili butter - so rich. Melted in my mouth. At this point, we were reaching our maximums point for consumption, but still we pressed on. Don't call us heroes. Our last plate was the miso halibut, which was thoughtful, buttery, sumptuous -- a seriously good end to our dining experience. We had to wave the white flag to dessert, although the offerings looked sublime, because we had all but stuffed our faces with the generous and filling portions of our dinner. <br><br>We will definitely be coming back if and when we can snipe a reservation. Lots of love to the Giant serving and cooking staff - you're doing holy work.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JkBBGKzsBwEGxbYrriveFg/348s.jpg", "caption": "Miso Halibut"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cC0kuCrmixeJvHGHkIsYDA/168s.jpg", "caption": "Tagliatelle"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qhCPUxoin7CTxWa14tpUKg/168s.jpg", "caption": "Asparagus"}]}}, {"review": {"des": "LOVED it.  Some dishes were just OK, but the dishes we loved, we REALLY loved.  Our faves were the Happy Scallops, Green Beans, and the Tagliatelle.  The flavor combinations were unique and perfect!  Although our server told us 4 to 5 dishes would be good for us to share, we went for 6, and we were extremely full.  Despite this, we went ahead and got the lemon cake with blueberries and sweet corn ice cream for dessert.  Ambitious, I know.  Also, we had a drink called La Serena (I think?) and we loved it so much we had another round.  Will definitely be back.", "pics": null}}, {"review": {"des": "I think that I had one of the best meals in Chicago at Giant. Everything about this place is perfection in my eyes. The service is wonderful, not pretentious at all and just the right amount of attention. The menu is creative and the food is absolutely fantastic. <br><br>I got the crab pasta and it is honestly a dish that I cannot stop thinking about even months later. It is truly that wonderful. Other highlights include the onion rings and steak. The steak was so incredibly flavorful!<br><br>The desserts here are also so fun and inventive! We got their version of the strawberry shortcake good humor bar and it was so delicious!<br><br>Main advice for this place is make your reservations ASAP or be prepared to wait!!", "pics": null}}, {"review": {"des": "4.5 Really delicious meal, maybe the best of the summer. We got the little biscuit, and I think a couple pastas and something else. I don't remember now but it was all good. I remember liking one of the pastas a fair bit more than the other. This place is small with very tight seating, meaning you're elbow to elbow with the people next too you, which I'm never a huge fan of. But unlike some such places (Avec, Mott Street) the food was well worth it.", "pics": null}}, {"review": {"des": "Tightest seating in the world. A 2 person table which btw is too small for 2 people and dishes, they have in the corner to seat THREE people. My knees were jamming into my husband's on the right of me and jammed into my friends on the left of me. We requested a bigger table which they had open and it seated 4 people and they refused. We left. Was super excited to come here, but I will never be back. Terrible service.", "pics": null}}, {"review": {"des": "THE FOOD!! If i could give more than 5 stars I would. Not only is the food great tasting, but it is at a reasonable price. Uni Shooters, were the best start to a meal. Thai Chili Sweet Corn was the best corn dish I've ever had. The flavors were spectacular I would love to get the recipe. The tagliatelle was the only dish I wasn't blown away from. If you love saffron then this is your dish, just wasn't mine. The baby back ribs were delicious with great smokiness. BUT please stay for dessert and get the Cajetas. Someone's review said it reminded them of the strawberry shortcake ice cream bar you'd get at the ice cream man. DEAD ON. So good!<br><br>The 3 week reservation wait was just fine with me after it lived up to the hype. However, we talked to the hostess who said that if you go during the week it's usually not a super long wait for patio seating. They hope to keep the patio open until mid October, weather permitting. Once the patio closes, walk-ins become more difficult because there are only 4 seats open for that. <br>We will definitely be back!", "pics": null}}, {"review": {"des": "Great variety.  All dishes are creative and interesting. Makes you want to come back until you go through the whole menu.", "pics": null}}, {"review": {"des": "Five people told me this place was amazeballs (that's not a word so they're barely people if we think of language as the defining feature of being a human but, whatever), we tried to walk-in once and they basically laughed at us, looked at getting reservations for a business meeting but couldn't (went to Momotaro instead which is, amazeballs, if anything is), and we finally snuck in early tonight on a Friday night. <br><br>First: our server. He was fine when it came to information about the menu other than hearing him read the same script to each crammed in table 2 inches to our left and our right. The odd thing was that he had a bunch of \"I'd like to murder you\" in his expressions. That's fine. I used to bartend and serve. It's awful. I don't blame him. <br><br>Second: the tables are 2 inches apart from each other. It is not a comfortable restaurant or a place where you actually enjoy being. <br><br>Third: the food. The food was supremely *ok* besides my wife's halibut which was just bad. My tri-tip steak was ok but dried sheep dung would be edible if you smothered it in sour cream. If I recall correctly, my wife liked the buttermilk potatoes. <br><br>Fourth: the drinks. I'm an alcoholic so they were all amazing. <br><br>Overall, it really wasn't what we thought it'd be and we won't be pining to go back. There are about 15 places within 3 miles I'd rather spend $250 than Giant.", "pics": null}}, {"review": {"des": "Come in knowing that you have to spend an extra couple hours at the gym tomorrow but that the pasta is worth it...<br><br>-super uni shooter- ball of fried Uni butter - the cucumber cuts the richness, one ball is all you need<br>- bay scallops- light creamy delicious<br>- buttermilk potatoes- sadly one of the few misses for me.. Aside from the gratin crust it was pretty much plain mash<br>-sweet and sour eggplant- surprisingly yum, the bread it came with is a must and made the dish<br>-pici - unique, spicy, and as everyone says, definitely worth a try<br>- orzo with crab- very good but a little heavy handed on the citrus although it was needed to cut the chili butter <br>-tagliatelle with merguez- one of my favorites, spicy, great texture and flavor, although the pasta seemed closer to a thick spaghetti <br>Chicken habanero- mixed reviews on this one, somehow didn't quite come together for me<br><br>Come for the pasta and definitely share!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2X2RnusATLmaDN-TokilVw/348s.jpg", "caption": "Chicken"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/X6ShFB6pBjVDQJNnO33e9g/168s.jpg", "caption": "Pici, with Chew"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LOpLLIICjgy7YC6SjJCPxg/168s.jpg", "caption": "Tagliatelle"}]}}, {"review": {"des": "Believe the hype. This is the best meal I've had in Chicago to-date.<br><br>We arrived with no reservations at 7:30pm on a Friday evening, but after a quick drink at neighboring cocktail bar Scofflaw, we were seated at the bar circa 8:15pm! I highly recommend the bar if you are a party of 2 - it's a great experience to watch the chefs in action.<br><br>The food:<br>+ Biscuit - for $3 I didn't have high expectations but wanted a bite of bread to curb my appetite. This biscuit (which really reminded me more of a gooey focaccia or corn bread) was a surprising favorite of the evening! The jalapeño butter accompaniment was a perfect pair.<br>+ Uni shooters - a perfect bite!<br>+ Short ribs with rice - best dish of the night. Sticky rice with tender beef and so much flavor - it's hard to do it justice in writing, you'll just have to try it<br><br>All in all, Giant was a memorable and delicious experience and I'm already planning my trip back.", "pics": null}}, {"review": {"des": "Love this new Logan square location. Right next to Scofflaw- it's nice to grab a drink there before or after dinner- <br><br>My boyfriend and I sat at the chefs table and the whole dinner experience was raised up a notch because it was nice to eat great food and have great conversation with the people making the amazing dishes- <br><br>First off- the Fried uni ball- don't let the other yelp pictures deceive the size of these- They are a size of a gumball so it's fun to pop them right in your mouth and finish it off with the cucumber garnish- not the typical \"oceany\" taste you would expect- more like sweet/cheesy fried ball <br><br>Their crab salad with tarter sauce and waffle fries is amazing- really good flavor all around- the waffle fries is fried well but potato itself was very soft as if they fried \"mash potatoes\" <br><br>Bacon jalepeño pasta (pic chew) is really tangy from the vinegar but has a nice kick to it- I would take a bite of this pasta and then the orzo king crab to balance out the two flavors <br><br>The orzo with king crab is very decadent and buttery- do share with others because you will get butter coma <br><br>Their baby back ribs- really reminded me of Chinese pork ribs- tender and meaty and the sauce was amazing- and the bonus was their baked beans! I was surprised at how the beans almost competed with the ribs- nice texture and flavor <br><br>Dessert- please order the smorgasboard- everything delicious in one bowl- marshmallow, brownie, cookies- and also their strawberry shortcake inspired dessert Cajeta Ice cream- brings  you back to your childhood <br><br>Great wine selection at an Affordable price- we tried the 2007 Cab Franc- to accompany our meal<br><br>Overall- need to comeback to try the rest of the menu-", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_US2e8R1qpUhfU_JewLwIg/348s.jpg", "caption": "Fried uni balls with cucumber garnish to finish it off"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LFLMc7wV56fRBp-aUX33Ww/168s.jpg", "caption": "Crab salad with waffle fries"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wFcg1pdeC8eChE1FMlmOzA/168s.jpg", "caption": "Orzo king crab- buttery deliciousness"}]}}, {"review": {"des": "I was so excited to try this place out due to the yelp reviews and comments I've heard from people.. and mind you, I never bother with reviews.. I think my expectations were a little too high to least to say.<br>In pictures, the portions seem a little more than in real life. The restaurant itself is super tight and it was so cold and uncomfortable it made it real hard to actually relax and enjoy.<br><br>We ordered the biscuit with jalapeño butter (we didn't know that it only comes with one) don't base things off their instagram that's for sure!<br>Crab salad with waffle fries- nothing special. It was very lemony.<br>Ribeye, I think that was that tastiest plate we ordered. <br>Tagliatelle- I waited so long to try it for it to be the saltiest pasta I've had hands down.<br>Pici- another salty pasta.. the pasta itself was chewy, which I loved but that's about it.<br><br>I was so disappointed with the food that I didn't even bother ordering desert.. if you haven't been, you're definitely not missing out!", "pics": null}}, {"review": {"des": "Absolutely incredible.<br><br>We came with a friend to celebrate my husband's birthday and arrived a few minutes ahead of our reservation. Because we were an odd three, they knew exactly which table to put us in a very busy restaurant...only thing was that the party sitting there from the reservation before was taking their sweet time leaving after the check had been paid and drinks were finished. Needless to say, they shifted tables to accommodate us in a different area, only fifteen minutes after our reservation time. It was completely not their fault, but they profusely apologized for the inconvenience. In addition to the profuse apologies, they brought out two appetizers AND dessert on the house. They were also constantly bringing out fresh plates and silverware between courses. Talk about amazing service.<br><br>On top of the great service, the food was out of this world incredible. By the end, we had eaten ten courses - super uni shooter, double the biscuits, happy scallops, broccoli, garlic buttermilk potatoes, short rib, eggplant, stuffed rigatoni, miso halibut, and cajeta ice cream. There were so many surprising highlights, but we all agreed that the big standouts were the short rib, eggplant, broccoli, and ice cream (OK, OK, they all stood out).<br><br>This was definitely one of the best meals I've had in the last few years. Can't wait to go back and eat/drink through the rest of the menu.", "pics": null}}, {"review": {"des": "I usually don't bother to review and critize restaurants but this one definetly left me  unimpressed and I thought I would warn others. <br>I am not sure what they are trying to be; the portions are a joke and the food quality leaves much to be desired. The prices are exorbitant, better places to go-to. Pasta had 5 pieces, not kidding.<br>Have not seen more overrated place than this.", "pics": null}}, {"review": {"des": "First visit to Giant as a gem. The room is electric and tightly packed without feeling entirely cramped. The bar at the end of the dining room faces the open kitchen while two vertical turntables spin more for decor than being functional. Our waiter came promptly after we sat and took our drink order. The N/Agroni was a perfect mocktail for my pregnant wife. Our first dishes hit the table less than 15 minutes after we were seated. The onion rings were unctuous yet crispy and included a delicious dipping sauce. The sweet corn had a definitive Asian flavor while the buttermilk potatoes had a magnificent texture with flavor to match. I can't say enough about the lobster tagliatelle. It was clearly the star dish of the night. The only questionable item was the ravioli. The pecorino cheese was a little too sharp and distracted my enjoyment of that item. Otherwise, the entire experience was terrific. We will be back.", "pics": null}}, {"review": {"des": "Low key don't think this place is that good. Went with my girlfriend on a Saturday night. Had to book our reservation 3 months out. The dining space should seat 20 comfortably and they try to squeeze 30-40 seats in the space. Had to pull out the table to get to the booth side, and God forbid if the person on has to go to the bathroom during. Literally on top of the two parties next to us so the dining experience was no longer a private affair. Service was nothing special.<br><br>I get it... #1 on Yelp so get while the getting is good. Cram in as many tables as possible, maximize table turns, get as many basic bitches to Instagram as many dishes as you can.<br><br>Final bill was reasonable for four dishes with no drinks... but I found the food quality so-so, against <br>other comparable spots in Chicago. Pasta and onion rings tasted like congealed salt. The potatoes and tri-tip steak dish were good.<br><br>Okay experience all in all, but left feeling dissatisfied. Don't believe the hype.", "pics": null}}, {"review": {"des": "This was probably one of my best meals in a long time. Short and great menu, food was outstanding. Staff was very courteous and able to accommodate us even when we were a couple min late for our reservation. The food is easily shareable. They plates look small but very filling. <br><br>We started with A Little Biscuit, which was real yumm with their jalapeño butter. Jonah crab salad was amazing. We also ordered Eggplant, Short rib and miso halibut. Every dish was fantastic. I wish I remembered to take pictures as we were super hungry and forgot to take pictures. We ended our dinner with Cajeta Ice Cream - 5 stars (and highly recommend).<br><br>The ambiance of restaurant is very pleasing as well. As opposed to the name \"Giant\", it's a cute little place, not very loud and very clean. Certainly recommend if you planning to try something amazing for your meal.", "pics": null}}, {"review": {"des": "I doubt it is possible to have a bad meal at Giant, the only question is whether it is good or excellent. I found deciding what to order difficult, because everything seemed somehow familiar. This isn't a place where you need to google ingredients or techniques, but the little things are done just right to bring an interesting twist to a dish you know you'll love. Be sure to save room for dessert! So with that, here's my advice on what was absolutely excellent, and what was \"merely\" really good.<br><br>EXCELLENT<br>- Saffron Tagliatelle with Merguez. Now, it helps that these are some of my favorite flavors in the world. But it was perfectly cooked, had interesting overtones (spicy sausage, flavorful noodles), and even beat some similar pasta dishes I've had in Italy. Don't pass it up. <br>- Cajeta Ice Cream. Delicious slightly tangy ice cream rolled in some sort of infectiously delicious strawberry and vanilla crumble with cookie morsels as the bed. I would eat this every day if I could.<br>- S'moregasboard. Oh my god. This contains fresh cake, mixed with fudge, baked with cookies, marshmallow, and Oreos. It's amazing.<br><br>Really Good<br>- Onion Rings. Okay, they're just cheesy onion rings, but they're perfectly done cheesy onion rings. They're not exactly a MUST get, but I'd probably order them again on my second visit. <br><br>Good<br>- Sortallini. After the flavor punch of the tagliatelle, this left me wanting more. Don't get me wrong, it's good. But it felt like a dish I could get elsewhere, while the other pasta dish didn't.<br>- Chicken Habanero. This chicken surprised me by being fried! That said, it was a juicy, well-executed fried chicken. My main complaint is that the mole sauce only had dim flavors. If a dish had \"habanero\" in the name, I expect it to have more than just a small back burn. <br><br>Overall, I hope to come back. We got our reservation something like 6 weeks in advance, so it won't be super soon. But there are still pastas we want to try, so we'll be back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/o8bzS9v_QOFAPuoZlKcPHA/348s.jpg", "caption": "S'moregasboard- don't pass it up"}]}}, {"review": {"des": "I really don't want to just dole out 5-star reviews, but Giant ABSOLUTELY earned it. To set the scene, we had a 5 PM rez on a weekday that we booked weeks in advance, so we were surly about that setup going in, but they turned that right around when we were met with a friendly greeting and were sat at the kitchen. The service was top notch--very attentive and helpful. The kitchen staff had exactly the right amount of sass to match the unbelievable food they were serving up and the decor was a perfect fit for the vibe.<br><br>The food. Oh, the food. Some highlights from a meal that would have any dish be the star in most establishments:<br>- Sweet corn - The depth of flavor in this was unbelievable. It was everything you want Mexican street corn to be, but elevated in only a way that cuisine unconstrained by ethnic restrictions allows.<br>- Tagliatelle - What? Just wow. No words. I can't. <br>- Raspberries in syrup - It had the tight amount of fruit, the right amount of crunch, the right amount of creaminess. <br><br>This was hands down one of the best meals I've ever had. I would like to commend the staff for working hard to remain authentic, creative, and diligent. I look forward to coming back and hope to be wowed anew.", "pics": null}}, {"review": {"des": "My favorite restaurant experience in 2017, so far. Simply incredible on so many levels. Exciting flavors, inventiveness, hospitality, value. Pretty much perfect across the board. <br><br>We arrived without a reservation for a Thursday dinner. With Scofflaw next door, the 45 minute wait, flew buy. <br><br>The decor has thoughtfully quirky touches like a fleet of floating record vertical turntables players by Gramovox, a local Chicago startup. <br><br>Our server was warm, accommodating and not shy from sharing an informed opinion when asked. This is a quality I particularly admire, in the hospitality industry. <br><br>Rating our selections:<br>Sweet and Sour Eggplant: 10/10<br>The best dish I've had all year. A cornucopia of flavors dance along your palate. Taking a moment trying to process the tamarind, cumin, palm sugar, roasted cashew flavors. Just tremendous. <br><br>Tomato Sortallini: 7.5/10 <br>The weakest dish of the night for the simple fact that the pasta was noticeably under cooked. The flavors however were bright and pleasant. <br><br>Saffron Tagliatelle with King Crab: 9.5/10 <br>This is their most popular pasta dish and for good reason. Sea-Butter comes to mind when reminiscing this dish. Got better with each bite. <br><br>Lasagna Del Posto: 9.7/10 <br>Like a warm embrace from Nonna. A 50 layer compressed lasagna that is exquisitely crafted. Comfort food elevated. <br><br>Snapper: 9/10 <br>Perfectly cooked, juicy, succulent Snapper with crispy skin. Served with a side of peas that are in equal parts rich and refreshing thanks to the addition of bacon and mint.<br><br>Black and White Babka: 9/10<br>Suited for sharing. There was a ton going on in this dish. The richness of the pastry and ice cream is cut seamlessly with the pleasantly tart blackberry and peach.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bEPn_lfBoIQkAGdBpOvHsQ/348s.jpg", "caption": "Babka."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2KYkgby2qfiJgRsOqDl7vQ/168s.jpg", "caption": "Agnolotti"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jLWlnVTccXpLAz8Lo1Jf2A/168s.jpg", "caption": "Sweet And Sour Eggplant. Absolutely Stunning."}]}}, {"review": {"des": "Went to Giant with super high expectations, and left feeling a bit underwhelmed and disappointed... I'd give it a 3.5 if I had the option. All around, it was a great experience and although the food was good, several of the dishes were WAY over-salted, one being almost inedible (the Pici pasta). The scallops and crab salad were also too salty and the tagliatelle was way too acidic. The dishes were so close to being absolutely delightful had they been refined a bit. But the short rib dish was our favorite and absolutely delicious.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lbZmj5AArUKQOeQqp-w5MQ/348s.jpg", "caption": "Tri tip steak"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5KPfg-t2vMr9OHoF0B7GBQ/168s.jpg", "caption": "Short rib"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OOpSLyKIAaUzwzLG1B0JEw/168s.jpg", "caption": "Scallops"}]}}, {"review": {"des": "Took a while to get a table for dinner, but that gave me plenty of time to anticipate and collect advice on what to order. Staff was top-notch: host was tucked into a corner of this single-room restaurant and had some magic space pocket to store our coats and bags behind her station. Server nimbly deposited drinks and dishes onto our table despite tight quarters. <br><br>Drinks - extensive wine list, but quite pricey, and few (if any?) by-the-glass options. Opted for the Point Special Lager to start easy and cleanse the palate post-uni shooter. Followed that with the Cocchi Spritz - more complexity, also refreshing. Coffee with dessert was excellent too.<br><br>Food - probably my fault for over-hyping myself, but I felt whatever about the uni shooter - it was at most two inches in diameter and filled with a hot buttery liquid that gestured toward uni without conveying the umami of the sea. Uni's magical taste and textural pleasure was diminished. I was disappointed.<br><br>We rallied with well-done onion rings. Our server warned us that these would be served at room temp, but they came out plenty warm, with crispy exteriors and fully cooked but not slimy onions, liberally sprinkled with cheese. Excellent.<br><br>Then the strongest dishes of the night - sortallini and the tagliatelle. The sortallini resembled small Cantonese wontons in structure, were fun to chew, and tossed in a silky savory sauce. Tagliatelle was also cooked and sauced to perfectly. Instant classic and comforting without enervating the taste buds.<br><br>Chicken habanero - flavorful chicken pounded into two cutlets, breaded, fried, good crust and still juicy, sitting on a deep brown pool of mole poblano with a slow-building heat. Very good and rich. Accompanying sides of slaw and chickpeas were unremarkable and unnecessary.<br><br>Finished our meal with crowd favorite cajeta ice cream - an upscale take on the Good Humor Strawberry Shortcake Dessert ice cream bar of your childhood; pretty good and goaty, but I reserve my adulation for the S'morgasbord, a piping hot assemblage of house-made spiced crackers, luscious dark chocolate cake, and hot baked marshmallow. That was deeply satisfying and delicious and I am salivating just writing about it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_V4Smsv8YM77pL_zXs-FfQ/348s.jpg", "caption": "Cajeta ice cream"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1Ai4et3RDuQLTRjKs5Z-HQ/168s.jpg", "caption": "Sortallini"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Do_X000prxY2QrT1n2V65A/168s.jpg", "caption": "S'morgasbord"}]}}, {"review": {"des": "Wow, this has to be one of my favorite restaurants.  The pasta options you can't go wrong with any.  They're cooked to perfection.  Service was great but it's so TIGHT there.  I was literally in the argument with the table next to us.  <br><br>GOSH I LOVE YOUR PICI", "pics": null}}, {"review": {"des": "Probably one of the best dining experiences I've had thus far. If you can get a seat at the chef's table (bar by the kitchen). <br><br>Ambiance: Modern hip vibe. Casual to smart casual dress (like jeans and a blazer)...but wear what you want obvi!<br><br>Food: Overall everything we had was bursting with flavor and had such diverse texture. Until this dining experience, I never realized how much of a difference texture can really make. I both loved and hated that the menu was smaller than most. Loved it because it's not overwhelming, but hated it because you want to try everything!! For wine I ordered a white, the Complement Terre \"Le Motier Gobin\" Muscadet, recommended by our waitress. It was perfect, not sweet and not too dry, almost resembled a viognier to me. Food we ordered the crab salad, #1 twice cooked pork, the eggplant, swordfish and smorgasbord. If you both have pretty large appetites, this will be more than enough. Otherwise I'd recommend two \"bigger\" mains and one smaller plate. <br><br>Eggplant: This was my favorite dish of our four mains. Perfect for sharing for two people. You get two pieces of the bread, similar to paratha or the bread you get at Flattop, seasoned deliciously. A variety of soft and crunch textures, with Asian flare (the sweet and sour). Highly recommend!<br><br>Swordfish: Second favorite dish also perfect to share for two. The fish was tender and flakey that it almost melts in your mouth. The lemongrass and coconut made it refreshing and the flavors weren't over powering. <br><br>#1 Twice-cooked pork: Tender and juicy and absolutely loved the shrimp chips to add to the diversity of texture. <br><br>Crab salad: It came recommended by the chefs and waitress. It was a good starter, light and refreshing. I would never think to eat fries with a crab salad either. The tenderness of the crab salad and the crisp crunch of the waffle fries made for a great pairing. Although if I come back I could make do without this dish. Definitely a good try, but was the least favorite of the four main dishes we had. <br><br>Smorgasbord: ALWAY need dessert. It was so hard to decide. The graham crackers aren't your typical Honey Maid ones we're accustomed to, I believe they said they were in house, so good! It was like a chocolate souffle/cake at the base with toasted marshmallow. I'm salivating....so good, highly recommend! <br><br>Service: Awesome! Sitting at the chef's table really made a difference. From getting to talk to the guys in the kitchen to seeing everything being made right in front of you was truly amazing. The efficiency and cooperation that the guys in the kitchen had was also really amazing, very fluid. <br><br>Highly recommend and will definitely be back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/917tPIuLwX83X-_y7bCqqw/168s.jpg", "caption": "Eggplant"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8FmX1Y4OMZCJKzMwDBj87g/168s.jpg", "caption": "Smoregasboard"}]}}, {"review": {"des": "I was a bit weary of this place since I had heard mixed reviews from friends.  Some people love it while others deeply dislike it.  But I am on the \"love this place\" team.  It has been awhile where I went somewhere and I was truly impressed with literally everything I ate and that happened here at Giant.  It's worth the wait and the prices.  I mean many restaurants in Logan Square cost this much and aren't nearly as good so it's important to compare prices to other restaurants in the area.  But don't go here if you're looking for a cheap meal that will fill you up.  <br><br>We went there on a Saturday night and were sat down after we waited an hour, which was fine because we just got a drink at Best Intentions next store and walked around.  The seating is a bit tight like in Europe so it can be a bit awkward on date night when you're squeezed in between two other couples and one of them is constantly professing their love to one another while you and your date are just obsessing over how delicious the food is.  The ambience is pretty and the bathroom was amazing, go to the bathroom!  It smelled great because of the candles they had, I really appreciate nice bathrooms in restaurants and bars.<br><br>Service was excellent between the hostess, server, bussers, and chefs bringing out the food in aprons.  The menu itself is not very vegetarian friendly - for some reason they add bacon/pancetta in a lot of dishes.  Since we eat seafood occasionally, we ate a lot of seafood last night, but they were very accommodating with us not eating meat.  I was nervous since higher-end restaurants that are trendy tend to not be very accommodating with making changes but they were.  I do think they should have more vegetarian options though.<br><br>We both had glasses of rose wine (mine was from Greece) and they went perfectly went well with the meal.  We started off with the fried uni shooters, which was basically an explosion of heavenly flavors in my mouth for thirty seconds.  I don't know what was all in there but there was something that had a creamy, goat cheese type of consistency and I loved it.  The cucumber soy salad a great accompaniment to the shooters.  Then we had the sweet and sour eggplant with cashews minus the pancetta.  It was absolutely mouth-watering.  It was a mixture of Indian/Chinese flavors and their \"pita\" bread was so garlicky and delicious.  It was chilled over the sweet and sour sauce and I couldn't get enough of it.  <br><br>After the two smaller plates, we had a lot of delicious pasta.  We had the Tomato Sortallini minus the guanciale.  When they first brought it out, they accidentally put meat in it but then were very apologetic about it, ended up comping that order and then gave us a free dessert so I can't really complain.  The sauce with the sortallini was amazing.  It came with unique, mini tomatoes and pine nuts.  They served it with some delicious sesame seed bread that absorbed and complimented the sauce perfectly.  The other pasta dish we had was the Saffron Tagliatelle with king crab and chili butter.  Wow!  The king crab was made perfectly, tasted fresh, and went so well with the chili butter.  I couldn't get enough of this either.  There was a bit of parmesan, but nothing too overwhelming since it was a very strong dish.  Even though they subtracted meat from some of the dishes, it didn't feel like they were missing anything.  They were perfectly satisfying.<br><br>I usually don't eat dessert, but the desserts looked so good so we ordered the S'morgasbord, which is basically their gourmet version of smores.  It was decadent, intense, and delicious!  Their graham crackers were the best I've ever had and it came with this cute, little oreo cookies over a chocolate souffle.  It was really wonderful but we couldn't finish it.  As mentioned earlier, they gave us a free dessert so they gave us the Vanilla Cajetta Ice Cream.  I am not a big fan of ice cream but I absolutely loved this.  It wasn't a heavy ice cream at all.  The ice cream was coated in this pecan strawberry crust and made into a ball.  I actually ended up liking this dessert way more than I expected.<br><br>All in all, I had a wonderful experience here and can't wait to go back.  I really enjoyed the environment and how the chefs came out, served the food, and described them thoroughly.  They also served the food beautifully.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sj3fXyBHHdhZiVv2lgmVIA/348s.jpg", "caption": "Cajeta ice cream to the left and S'morgasbord to the right."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZvH7iGdsJe4ic-PyNiLDew/168s.jpg", "caption": "Saffron Tagliatelle with king crab"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/235W2tq1Gy11DnJlrNomfg/168s.jpg", "caption": "Tomato Sortallini with basil and pinenuts."}]}}, {"review": {"des": "Had one of our favorite meals in Chicago at Giant. We ordered the uni shooters, biscuits, zucchini, sortallini, scallops, & short ribs. Can't even begin to describe the flavor explosions in every course. Our waiter was super helpful & everything was delicious!!", "pics": null}}, {"review": {"des": "One of the best meals I have ever had and one of the best restaurants in Chicago! Oh my goodness. The menu is all small plates, so you can taste a lot of different things on the menu without eating too much. The plates come out as they are ready, which I like. The ambiance is great, it is loud but still conversation friendly. It is a small space so the tables are pretty close together, but once you are seated it is fine.<br><br>We got the little biscuit, the brussel sprouts, the mashed potatoes, the sortallini, and the tri tip steak for our dinner. For dessert we had the babka. Everything was so flavorful and delicious. No complaints whatsoever! The biscuit comes with this amazing jalapeño butter that you could eat on its own. The brussel sprouts were bursting with flavor. The mashed potatoes come out in a little tray that must have gone in the oven, and it is crusted golden goodness on top. The sortallini was so flavorful and the individual pieces of pasta were so fresh and delish. They also bring you fresh and fluffy sourdough bread to soak up the sauce of the pasta. Can you say dream come true?! The tri tip steak was phenomenal. A little spicy and lots of flavor... I was blown away. The babka was so delicious for dessert. It comes out looking like a cinnamon roll and when you cut it open it has the layers of like classic babka. It came with a little scoop of banana ice cream and a fig and pear syrup concoction that is seasonal. <br><br>I cannot wait to plan my next trip to Giant. You need to make a reservation in advance and it is totally worth it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yzjnv6FA_AbLH5LM1H18eg/348s.jpg", "caption": "Two little biscuits with jalapeño butter"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aOICXzY9PvFwstXFbn8_5Q/168s.jpg", "caption": "Brussel sprouts"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/El8-HqOadi7V9UlSSAvhWw/168s.jpg", "caption": "Mashed potatoes"}]}}, {"review": {"des": "I was not particularly impressed with Giant.  It wasn't bad, but it certainly didn't blow me away especially considering the value for what you get.  <br><br>My bf chose this to celebrate his promotion, as he is \"in the industry\" and has heard nothing but great things. When I saw that they have a kitchen counter, which I've had great experiences with at other restaurants, I got really excited to try it. I made reservations for a Tuesday night and requested the counter. When we arrived, someone at the counter was finishing up so they said we should be able to sit there in about 10 mins. So we decided to wait. Here's where things went downhill. <br><br>Almost every review mentions how small this place is. But seriously think of how small you imagine it to be, and divide that in half and double the amount of tables. This space is clearly not meant for a restaurant. The dish pit is literally next to their oven! There is not really a bar...more like a bookshelf. But what is the worst is the claustrophobic entrance. It's some sort of weird box of a curtain right when you walk in, and once you figure out how to get through the curtain you are BAM! Right at the host stand and there are about 6 2 tops within a 3 foot radius. So yeah, there's nowhere to wait unless you want to your butt in someone's face. No problem in the summer- huge problem in the winter. They did say we could go next door to a bar and they'd text us when it was ready, but seeing as they told us it'd be a really short wait, we figured we wouldn't even have drinks before we got our table. Anyways, it ended up being another 20 mins after our reso before we were sat. The whole vibe of being cramped and dodging servers and people leaving was not a good start.<br><br>Anyways, the chefs cooking in the counter didn't seem to interact with anyone, and didn't particularly seem to get along all that well either. It was just awkward. Definitely my least favorite counter experience. <br><br>Then there was the food- it was decent, but I didn't think it was anything special for the price or size. We ordered 4 things between us- cornbread (very good), short rib (the rib was cooked really nicely, but the flavor didn't work for me with the peanuts and licorice flavor), the Sortalinni ($16, literally 6 thumb sized \"tortellini\", served with a decent sourdough that should have been warm but was instead served room temp), and the onion rings (star of the meal- best onion rings I've ever had!). We also tried the ice cream which was incredible. <br><br>Overall, the meal was really small for the price. We spent over $100, only 2 drinks, and there was maybe the equivalent of an entree apiece in how much food we got. <br><br>Service was fine, although there were constantly servers brushing past every single table because the space is so small. <br><br>I don't think I would come back (especially because I don't live in the area and it is pretty far from regular CTA service, but I'm glad I tried it- if only to confirm that when I read from 95% of reviews that a place is really REALLY small...I probably won't like it.", "pics": null}}, {"review": {"des": "We ordered 8 items almost every dish was outstanding. Our favorites were the Crab Salad and Waffle Fries, King Crab Pasta, the Tri Tip Steak, and their sorbet. The sorbet flavor of the day was coconut lime, neither flavor was overwhelming really rather perfect. Service was great but I took one star off because the heater was located right beneath our seat and it was very warm and parking wasn't great but we made do.", "pics": null}}, {"review": {"des": "Perhaps our expectations were high. It took over month to secure the much sought after reservations. Overall, it was underwhelming mostly due to the food. The service was very friendly, and knowledgeable. The food in general didn't keep up with expectation. <br><br>Our table of 4 tried 8 dishes and maybe we liked about 3. We sometimes liked parts of 1 dish and sometimes nothing of the other. There are subtle Asian, Italian and Mexican influences. You can tell from many dishes, that there was a good deal of thought that went into creating it but the flavors didn't mesh well for us. We ordered the following:<br>- steak - perfectly served medium rare. <br>- Pici - thicker noodle that was served al dente in a grainy cheese and jalapeño sauce. I liked the sauce<br>- Tagliatelle - portion was rather small and very al dente. Pasta looked more like thin spaghetti or lo mein. It had a tad surprise kick to it. We probably got 1 piece of king crab - not much to go around at all.  <br>- fish dish (I think it was snapper?) - the dish was mostly mild with bright fresh veggies. but nothing to rave about. <br>- eggplant - it had some interesting ingredients like fresh coriander maybe. but I didn't care of the sweet/sour flavor. we all loved the bread that came with it. <br>- crab salad - meh. didn't impress and it was a tiny portion. the waffles fries seemed random.<br>- mashed potatoes - it was just okay...could be more creamy. This came out 1st to the table and we all wished this had come out later with the larger courses. <br>- soft shell crab with pancake.- meh. the pancake was more like an omelet for us. crab didnt stand out. I'd pass on this. <br><br>We didn't order dessert since we were afraid to be disappointed again.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6TC8y3ZFWRTF8SEC5iOLOA/348s.jpg", "caption": "Crab salad and the mashed potatoes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oIoXGQ7kEX0-CtopHCxrGw/168s.jpg", "caption": "Eggplant"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rL8Lw3_AZQie3xFVnptYsg/168s.jpg", "caption": "Soft shell crab"}]}}, {"review": {"des": "Amazing dinner at Giant. The place is on a halfway-gentrified stretch in the western reaches of Logan Square. Inside, it's got that airy industrial-chic thing going on, which is fairly typical, but more notably, the place is tiny. Like many a restaurant in Manhattan, the tables are crowded together, making the whole thing feel very personal (but not uncomfortable). The kitchen is open, which I've always liked (they can't keep anything secret from you).<br><br>The food is stellar. Everything we tasted was delicious. The uni shooter is a ball of liquefied butter and parmesan-like umami. It's one of the most interesting bites-- both in flavor and texture-- I've ever had. The sweet corn is pleasantly tangy and spicy, with neat little crunchies (corn nuts, maybe?) and (I think) diced pear inside. The eggplant comes in an awesome sweet-and-sour Asian-ish sauce. It's served cold with hot fry bread. I'm not a huge fan of cold eggplant (it gets greasy), but this was still delicious.<br><br>The tagliatelle is probably the most delicious thing I've eaten this year. It arrives coated in a thick, buttery crab sauce (think: the most awesome lobster bisque ever on your pasta) with chunks of crab. The ribs, while certainly some of the best ribs I've ever eaten, were probably the least inspiring item on the menu: they come in pretty traditional barbeque sauce, with a side of kind-of-mushy baked beans and some nice pickled onions. <br><br>For dessert, get the s'moregasboard. If you are expecting something out of a TGI Fridays, based on the menu description, don't worry, and just order it. Half-baked chocolate cake with homemade marshmallows should be on more menus.<br><br>Service was amazingly friendly, never pretentious or anything of that sort. Our server was super helpful with the (not huge, but totally stacked) menu. The food comes out, generally, at a good pace.<br><br>Come here if you like trendy New American. Come here if you like Asian, or Southern, or seafood, or pasta. Come here if you are a real human with taste buds.", "pics": null}}]}