{"name": "gibsons-bar-and-steakhouse-chicago", "reviews": [{"review": {"des": "If you fear the Gibson's will break your wallet--you're wrong, especially at lunchtime. My friends love this place--their salads and soups are especially good. Today we all ordered the tuna salad w avocado, eggs and pickles. This is not, by the way, tuna from a can! The waiters bring scrumptious warm breads to the table--overflowing. Enjoy dining in or sitting on their street-side patio. Gibson's is a wonderful place to head for lunch but can get busy in the summer, so get there early.<br><br>I returned to Gibson's and had their amazing homemade soup. It is called Bookbinders--full of tomato and flavor and fish. They serve it with thee small loaves of bread. It's sooooo good in the cold month. For dessert, I asked for carrot cake. What did I get? OMG. I got not a slice but a quarter of the cake that must weigh 5 pounds. It was crazy.", "pics": null}}, {"review": {"des": "We had a mostly great experience dining in the bar side of the restaurant, but my wife's steak was undercooked so I had to take off a star. We came around 6:30 on a weeknight but the bar side is open seating and we found a table right away. Service was prompt and friendly, and she brought our bottle of wine rather quickly. For an appetizer, we split the wedge salad which was MASSIVE. Half was more than enough, and if I didn't have such a weakness for blue cheese I wouldn't have even finished it. I got a NY Strip steak and it was perfectly cooked medium rare, albeit with a very very salty crust. I love a good salted crust, but this was almost too much for me. My wife got the filet and asked for medium, but it came out medium rare. It wasn't a huge deal because she doesn't mind medium rare, but for a place of Gibson's caliber and price point, the steaks should come out of the kitchen exactly how you ordered them. My steak came with a salad/soup, and I had already had the wedge, but the only soup is split pea so I just picked at a second order of salad. <br><br>Overall a great meal, but in the future I'd expect a more consistently cooked steak from them.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/c90Tg_ODfm7rmGJ97pHjbA/348s.jpg", "caption": "HALF of the wedge salad for an appetizer. (Other salad in background)"}]}}, {"review": {"des": "Chicago has many great steakhouses, but Gibson's is always my favorite. <br><br>Great steaks, wonderful sides, and the ambience makes you feel like you are in an old school Chicago steak house. If you have a sweet tooth, their cake slides are as big as your head.", "pics": null}}, {"review": {"des": "The picture doesn't do the justice! Best steak sandwich I have ever had in my entire life! The rib eye literally just melt in your mouth!!! <br>And the crab cake Benedict is heaven!! You can taste the real crab in your mouth!! The running yolk soaks the crab cake below and the perf combo will blow your taste buds!!!<br>And they have the most attentive service I've ever had!! Will come back again!!! So good!!!!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/n5muLE7l0lNg4xXsDTAfTQ/168s.jpg", "caption": "Rib eye sandwich"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HfAuCT3Rq_PmgAhNEeuF3A/168s.jpg", "caption": "Crab Cake Benedict"}]}}, {"review": {"des": "Old fashioned steak house. Came to this place from a friend's recommendation. Wasn't even planning to have steak but glad we did. Nice ambiance with piano playing? The bar area and while restaurant were super full. <br><br>Got the Chicago cut, which is massive! 22 oz definitely needs to be shared. Ordered it medium rare and cut already. It was mouthwatering but could use a little more salt seasoning coming out. Even the sides are massive. The twice baked potato was to die for and half of it is basically a full potato already. Creamer spinach is also good.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/SQQ9xHuU1ClOt8wMTxfY5g/348s.jpg", "caption": "Chicago cut, medium rare"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5Jbk-PoMfl_-xQXkXX2i3w/168s.jpg", "caption": "Bread"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GkgwlLWruVvJLX-aRA3Gzw/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "This was my second time at Gibson's and once again they exceeded my expectations. I mean, what's not to like at a steakhouse right?!! They are everywhere and serve pretty much the same thing. Except when you come to Gibson's. They go that extra step. They take their time with each diner to make sure you get what you want. How you want it prepared and served hot and delicious. They keep your glasses filled and are always close but not overbearing in case you want something more. The house cut was the best I have had in Chicago. Aged 40 days. Asparagus and Brussels sprouts superb. They monstrous cake portions left us breathless and plenty to take home. When there are so many choices in the Windy City put this one at the top of your list.", "pics": null}}, {"review": {"des": "While deciding on a nice restaurant to go to for dinner our last night in Chicago, I stumbled upon Gibsons. The reviews and pictures of the tomahawk steak decided it for us. I've been to many prestige restaurants and Gibsons ranks near the top of my list. The food is definitely on par with what you'd expect from a restaurant of this caliber. The bleu cheese wedge salad is a favorite of mine and Gibsons does it just right. The New York strip we ordered was cooked perfectly and well seasoned. The ambiance and service make for a memorable experience. I highly recommend making reservations and enjoying this restaurant whenever possible.", "pics": null}}, {"review": {"des": "All I can say is WOW.<br>More expensive restaurant than the ones I recently visited in Chicago but being the last night we decided to splurge on dinner. <br>Before deciding what to order the waiter came over displaying the different cuts of meats they had and what comes with the meal. I went for the 13oz NY sirloin with cream of mushroom soup and my husband got the WR's Chicago cut with house salad. We also shared an ordered mashed potatoes and grilled cauliflower.<br>I could go into how delicious everything was but I won't and I will just say after every bite I said \"oh f**k\" because the food was just that good.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-Ik1-rLK6tJp-Z3enN0b9A/348s.jpg", "caption": "Garlic mashed potatoes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/skQ8eO0ZK9kILzPtwuKtYQ/168s.jpg", "caption": "WR's Chicago cut"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/akbe-crrzhU1VQMeKs2eQg/168s.jpg", "caption": "13 oz NY sirloin"}]}}, {"review": {"des": "This was my first time here. My party of 3 had a lunch reservation for 12 noon. When we arrived around 12 noon on a Saturday we were seated immediately at a nice window table overlooking the small park area on East Bellevue Street. <br><br>As you can see from my pics I enjoyed two \"She's A Peach\" cocktails for $14 each. I also enjoyed sharing the half dozen oysters for $3.25 each or $19.50 in total. The oysters were very clean tasting. I love my raw oysters and clams. We also shared the seared tuna appetizer for $19, which was also very fresh tasting. My sirloin strip steak was perfectly cooked medium rare and tasted great for $24. I especially enjoyed Gibson's seasoned salt, which I also use at home. <br><br>Our total bill less gratuities was $188.44. Rachel accommodated all of our table needs. I rate this in my top 10 restaurants in Chicago. I will return here.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KtEQ712767iOjXIUz2YKsg/348s.jpg", "caption": "I love the Gibson's seasoning salt"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5cDW9jsRTTmOOaVwf0JPZQ/168s.jpg", "caption": "My Seared Tuna appetizer for $19"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0CNbiKSb6afI8upqAdxk_A/168s.jpg", "caption": "My oysters for $19.50"}]}}, {"review": {"des": "Ok, this place rocks !<br><br>We came for a dinner party of 10, and enjoyed high quality steaks, both the New York and the Chicago cut. <br>Service was also superb and very professional, I liked the way they showed the meat before so we can tell which cuts to have.<br><br>The deserts were humongous ! Literally each could feed 6 mouths...on the same time they were really great, the chocolate mousse and the strawberry shortcakes.<br><br>Great place will meet again in my next Chicago visit for sure !", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0s352aeBik7g4uvHWy3yQg/348s.jpg", "caption": "New York Sirloin"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZV8xExD8IoNzQPQh6jVVdg/168s.jpg", "caption": "Just before..."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/e8k4k6EKCYc7ONv-W6WHbA/168s.jpg", "caption": "Broiled Faroe Island Salmon"}]}}, {"review": {"des": "I've been lucky to have come here a few times now, and every time it has been fab. The place, the service, the food. I've gotten to try several apps and steaks. Loved the risotto special, the salmon crudo. Filet and ny strip have also been delicious.<br><br>I've had Tony and Scott for service - both wonderful. <br><br>The views are fantastic. Definitely want to check out the rooftop bar in the summer and dine outside.<br><br>Go here for a special occasion, work dinner or just because you want to treat yourself!", "pics": null}}, {"review": {"des": "This restaurant is a bit of a meat market on more than a few levels, besides the prices looks like not much has changed in a few decades. Crowded tables, buss personnel taking breaks on dining room and shabby uniforms, poor upkeep of the space and furniture is evident. Our server was a true gentleman and had solid spiels and service. Meats were ok, presentation was hard to sit through as proteins were oxidized and smashed by the repeated trips to the tables. <br>The upside was food was ok, bread was very poor quality. <br>Drinks were large and not over priced but spoke to the 1980s stylistically. <br>Unless your taking friends to partake in a Retro Chicago experience I would not recommend. <br>Ownership needs to start re-investing.", "pics": null}}, {"review": {"des": "This place was awesome, well located and walking distance from great places... good ambiance and crowded...<br>We had to wait at the bar and they decanted the bottle I brought for the night, so it was fine to have arrived 1 hour early for our reservation.... highly recommend to reserve!<br>The bar area is crowded as well and the bar tender was not too polite, I don't mind as the bar is not my main area....<br>We were seated and had a table at the \"terrace\" next to the window which for me was quite pleasant..<br>We were greeted by Michael who took great care of us and was spot on on our desires for food.... my usual ribeye steak rare Pittsburgh style!! Oh boy... was my stake tasty.... very good and charred.... I also had a mixed greens salad that came with the meat... <br>we also had a great bottle of Napa Cab, thanks as they have a corkage fee.... very important for me!<br>Service was very good, ambiance was also very good and the place is clean... will come back!<br>Enjoy", "pics": null}}, {"review": {"des": "Quintessential Chicago Steak house right in the heart of Gold Coast. It's located in a great lively area surround by some of the best of what Chicago has to offer. Just steps away from the upscale shopping!<br><br>We came here on a Friday night as expected it was packed but we had reservations and we were seated right away. We sat outside which was lovely bc we got to enjoy the weather and of course people watch. The prices are what you would expect from a steak house with lots of different options to please everyone that comes.<br><br>I ordered the Filet Mignon which was packed with flavor and perfectly cooked I was very pleased with my steak. It came with a salad which was nothing to write home about basically just iceberg lettuce cut up with dressing. We order two sides for the table which were the fries and Brussel sprouts. The fries were very plain not the best I have had. I thought the Brussel sprouts were good except for the fact they are supposed to have bacon and it was very scarce. <br><br>On to the service it started out very good the girl was very nice. But half way through she was no where to be found. My husband went to use the bathroom and saw her lugging around coolers of ice instead of tending to tables. We waited and exceptionally long time to get our check and then when we finally did we had to ask another waitress to cash us out. Our waitress came back to give us the final copy and there was no apology for the long wait. <br><br>Overall the steak was very good everything else was just average.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/un1-CK0-omig71TWfkiWjA/348s.jpg", "caption": "USDA Gibsons Prime Angus Rib Eye"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/94G5w27kfx_3Ua0Xz-A62A/168s.jpg", "caption": "French Fries"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/faPtAN5EW31roph3GVC22A/168s.jpg", "caption": "Bourbon butter Brussel sprouts with bacon"}]}}, {"review": {"des": "Went for a graduation dinner and the experience was top quality from the start.  The staff was friendly and our waiter took the time to explain the cuts of meat in detail.   The food was amazing and the wine selection was excellent.  Atmosphere felt relaxed but upscale. <br><br>This restaurant has clearly mastered effortless class and is confident enough with its offerings to not try too hard.  If you're prepared to pay this kind of money for a special occasion, highly recommend Gibson's over other steak houses in the area.", "pics": null}}, {"review": {"des": "3.5 Stars. 5 star service, 3-4 star food, 3 star prices. $2.50 extra for rocks on a $15.50 glass of bourbon. The waiter took it off but really ? Big flag for me that the other prices me have been wrong too. I'll spend money but don't rip me off because you can get away with it (most of the time). <br><br>Our waiter was great. Food portions were huge but the steak didn't compare to Peter Lugers. Good not great steakhouse.", "pics": null}}, {"review": {"des": "I see why this place is well recommended. A beautiful entrance. This place is immaculate! <br>You can tell right when you walk in that it's a \"go to\" spot. The bar is packed, loud, and everyone smiling. <br>This is a busy place but a well run establishment. <br><br>We shared the WR Chicago Cut which was cooked medium. The 22oz steak was plenty for two people. They even slice it for you. We had the creamed of spinach and the brussel sprouts with bacon. This combo is a must! The sprouts complimented the steak well. <br><br>We ended the night with the 4lb carrot cake! OMG this cake was huge! It serves nine people according to the waiter. They have a special box for the cake for you to take home.<br><br>When in Chicago, please go to Gibson's Steak House!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/biP8PmSz1o_8wl8WbHlafw/348s.jpg", "caption": "Outside"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VJTmUjNiy2Iv7w80Id-UNg/168s.jpg", "caption": "Meat presentation"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Te4sheErBNOZR6y1t546sQ/168s.jpg", "caption": "Creamed Spinach"}]}}, {"review": {"des": "I am COMPLETELY blown away by Gibson's! I want to say \"how had I never been here before this past weekend?\" but the truth is, I'm barely fancy enough for restaurants above major fast food chains, so Gibson's was a real damn treat.<br><br>My boyfriend's family invited me to a birthday dinner for him, and they chose Gibson's because they love it. I personally had never ordered steak at a restaurant beyond a skirt steak taco, so I was ready for this adventure. We had a reservation for a group of eight at 6pm on a Friday, and we were seated right when we arrived. <br><br>First, the service. Incredible. We were lucky enough to be paired with Rich, who took our drink orders right away: I had a glass of Pinot Grigio, while others around the table had a variety of other drinks, like bourbon, piña coladas, and more wine. After this, Rich brought out a platter of meats, to demonstrate different cuts of steak. I love this, and I've never seen it anywhere else. This was especially helpful for me, who'd never eaten at a steakhouse!<br><br>I know eating a lot of meat makes me very tired, even though it also makes me full, so I ordered a strip steak, which came with potatoes, spinach, and either a salad or the soup of the day. Soup of the day was crab bisque, so how could I say no?! That ended up being a fabulous choice, because it was creamy and very crabby, with little strips of crab in it. AMAZING. <br><br>The steak was also cooked perfectly and just as Rich described it: slightly pink, but just ever-so-slightly pink. The potatoes were cooked pristinely, and there was so much spinach on my plate that I think it was about three store bought-bags worth, even though they definitely do not store-buy their spinach here! This meal was so filling, the atmosphere was absolutely welcoming, and Rich was a fabulous waiter. Thank you so much, Gibsons, for being a pure delight.", "pics": null}}, {"review": {"des": "Coming from New York and having been to many steak places, my family and I were not as impressed. <br><br>We ordered the tomahawk, bone In rib eye, cauliflower, crab legs, large lobster tail, shrimp cocktail, loaded wedge, caprese, mashed potato, sautéed spinach and ended with the macadamia turtle pie. <br><br>The main thing was we were not wowed by any of the dishes except for the macadamia turtle pie. <br><br>Everything was cooked fine and we really have no complaints other than we thought we were going to have an OMG experience given all the reviews as well as friend recommendations I received. <br><br>We also felt like the place was very crowded and small. We had a party of 5 but sat at a table that was more befitting for 4.", "pics": null}}, {"review": {"des": "The epitome of a Chicago steakhouse, the quintessential power lunch/dinner restaurant, the embodiment of all things beef. One of the most wonderful and fun places to gather, drink, dine and enjoy the good life. My favorite restaurant in Chicago, one of my top 5 in the world. <br><br>Here is where local A-listers, politicians, sports celebs gather. No wonder...it's first class all the way with a happy buzzing vibe that could never be replicated artificially.  <br><br>Prime aged ribeye is over the top. Portions are crazy big. Bring an appetite and a thick wallet, then let your hair down, let go, and go for it. This is an experience!", "pics": null}}, {"review": {"des": "When our server greeted us, he told us to prepare for the Gibsons' experience and man 'o man, he wasn't kidding. <br><br>My family loves to try the whole menu and this was no exception. My mother and husband tried the fish soup and though I am not a fan of fish soups, this was tasty and actually comforting on the cool Chicago night. <br><br>I was overwhelmed by the choices of the menu, I mean, you can get a garlic, Cajun, Oscar-style, peppercorn, and a few other style steaks. And the steaks, they are HUGE. It was enough to share but I thought I could be a champ and finish a Chicago-Cut steak by myself. I was fooled. My parents split a lobster and steak (pictured on the same plate)--they actually did it smartly.  Everything was cooked perfectly! I mean the medium steak I ordered was crisp and glazed  on the exterior and soft and perfect on the interior. My husband actually wished he ordered the medium too, instead of medium well. <br><br>Everything is big enough to share with a family of 4, honestly. Especially the desserts. I couldn't even scratch the surface of it but we tried. The turtle pie is mostly ice cream but its worth the trip! I will definitely be back in the future!", "pics": null}}, {"review": {"des": "We were not able to get reservations here, but we decided to try our luck and were shown right to a table at this classic steakhouse in a busy Chicago neighborhood. They are very busy, but you might get lucky if you can't get a reservation, so I recommend trying your luck!<br><br>We started out with the carpaccio, which was amazing. It's one of my favorite dishes and if I'm deciding between two different steakhouses, I'll go with the one serving carpaccio. While we were ordering, we noticed that the restaurant serves HUGE desserts. Like, hatbox sized slices of cake. It was pretty funny, as the whole restaurant will turn to look every time one of those bad boys is hoisted out. <br><br>We both got the prime rib for our entrees...and it was divine. Prime rib is usually good, but this truly melted in your mouth. We got a shareable side of gratin vegetables - we had mistakenly thought we were ordering potatoes, but veggies (albeit with lots of cheese) turned out to be a nice, less heavy accompaniment to the meat. I had a half bottle of a french red from the huge wine list and by the time we were finished with our meal, there was no chance of trying one of the 8 lb chunks of cake. I was sad I wasn't able to finish my prime rib. <br><br>The service here is as good as the food. I'd put it at the top of the list of places I want to return to the next time I'm ORD bound.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ix_tJiOcemC5KkjSV3Ay-A/348s.jpg", "caption": "The carpaccio is amazing!"}]}}, {"review": {"des": "Great service. Better steaks. We showed up on time for our dinner reservation. Promptly seated and greeted. Great martini. Our waitress was very friendly and attentive. She walked us through the steak options. <br><br>I went with the 40 day wet aged bone in Filet with a cup of chowder to start and Brussels sprouts. The GF went with the smaller filet with potatoes and broccoli. <br><br>The steaks were phenomenal. Their seasoning is perfectly balanced. They broiler develops a nice char on the exterior while leaving the interior a perfect medium rare. <br><br>The chowder was rich and creamy, but the seafood was either not present or very tiny chunks. As a Boston native this dish was lacking a bit. <br><br>The Brussels sprouts were seasoned well and cooked perfectly, but were too oily (there was 1/4-1/2\" of oil standing in the bottom of the bowl. <br><br>Overall this is a steakhouse worthy of their reputation. Well done.", "pics": null}}, {"review": {"des": "This is a well known establishment in Chicago. Depending on your situation, you would probably know it for being either a fantastic steakhouse, a place for an epic martini, place to meet to a sugar daddy, or place to meet a sugar baby (is this the label?) (No judgement either).<br><br>It's in a hot area of the city. This area for anyone not aware is referred to as the Viagra Triangle. I'll let your imagination take you there, but let's just say middle age men and very attractive young ladies all seem to gravitate so now you understand the vibe a little bit. Don't let that detour you. In fact, it's a draw for me. I enjoy the people watching and I fall into the martini category, if you're still following. <br><br>The food is good, but as far as steakhouses in the city go, I do feel more like the cattle when I dine anywhere other than the bar. It's a machine at getting people in, fed, and out. Food is great, but there are tons of steak houses in the city that can accommodate that need. The martinis are huge and strong and delicious. They are pricey, but a lot of my friends only need one. It's fun for a drink with a view or entertainment or potential financial assistance.", "pics": null}}, {"review": {"des": "Where do I start. Joe, you're the f*kin man. Made my experience 10x better and set a standard for all restaurants to never attain. <br>I could talk about how great joe is for 20 minutes , but you get the idea. <br>The steak and food was amazing. I would recommend this steak house to everyone, over any other steak house you can think of. I didn't even need any steak sauce. Joe you were right.", "pics": null}}, {"review": {"des": "We have numerous dinners here for years.  The service is top notched.  The entire vibe at Gibson's is great.  Recently however we were in town again for two days and we made sure to go to Gibsons. It was a Thursday late night dinner and we ordered the Tomahawk and shared it with a couple sides.  The bummer was the tomahawk wasn't tender.  It wasn't up to the quality we enjoy usually.   Not sure why it was a tough cut.  The next night we went to Maple and Ash and we had their specialty ribeye and it was so tender.  I'm sure we'll return to Gibson's but I'll order their delish fish instead.", "pics": null}}, {"review": {"des": "What's unique about Gibson's is the quality of the food and service without taking themselves so seriously like your traditional premium steakhouses  (Ruth's, Morton's, Capital Grille, Fleming's). The quality is equal or better with a more relaxed atmosphere.  Dare I say a more fun, celebratory, inviting atmosphere.   Relax and enjoy a fabulous meal!   We had bone-in filet, twice baked potatoes, creamed spinach, and mushrooms. All excellent. They do cook on the rare side, so order one level up.  The macadamia, caramel ice cream dessert is decadent and worth the entire trip (and check).  Simply amazing.", "pics": null}}, {"review": {"des": "Favorite restaurant in Chicago! Never a bad experience, always an amazing meal with the most outstanding service. <br><br>Finally made it in for lunch and sat at the bar with Dan, who made me my first gin martini and it was perfection! I had the French Dip sandwich with fries and it was delicious! Had my usual wedge salad to start which always perfectly fresh and crisp! <br><br>Highly recommend for a great steakhouse experience!", "pics": null}}, {"review": {"des": "Overrated, rude staff. <br><br>This place continues to provide a horrible experience upon arrival. The food used to justify this. My pork chop was over spiced and way too salty, so no reason to come again.<br><br>Recently, took my family including my 92 yr old mom for a family outing. They stuck us in a table next to two closets . We were interrupted at least 5 times by staff coming in looking for their uniforms. Because we were 10 minutes early, I did not initially ask for a change of table. Once food was being served, the interruptions began while there were multiple other 7 top tables available and the place was empty until we left about 1.<br><br>I have been a customer for many years, but the attitude of the hostesses and managers makes this place nowhere near what it is rated.<br><br>Much better steakhouses in Chicago without the attitude. Get over it Gibson's your viagra triangle customers are dying or leaving the city. So maybe you will finally lose the business you no longer deserve.", "pics": null}}, {"review": {"des": "During my visit to Chicago I was told that Gibson's is the best Steakhouse, and being from NYC I felt obligated to go.<br><br>We went on a Friday night and the place was packed. Bar area was filled to the brim with people ordering drinks and hovering around the \"first come first serve\" tables that you don't need a reservation for. We had a reservation and were seated 10 min after arriving.<br><br>The menu is fairly simple, just like a good steakhouse menu should be. Lots of different cuts and family style sides. I had the 14oz filet medium rare and it was cooked perfectly. Side of bernaise sauce was great also.<br><br>Prices are high as to be expected of a place like this, and the waitstaff is extremely helpful and attentive. All of the sides we got were solid, and all in all this was a great experience and definitely competes with some of the better classic locations in NYC. I would highly recommend to anyone who is either from or visiting Chicago that is looking to go to a staple restaurant of the city to come here.", "pics": null}}, {"review": {"des": "By far the best meal and steaks I've every had! <br><br>Move over Ruth Chris because there's a new restaurant serving even better steaks! With only 3 locations in the USA Gibson's offers amazing plates and steaks for a high price but it definitely worth every penny! <br><br>I visited Gibson in a very cold night while visiting Chicago. Our stay was great but the steaks we had here but the whole visit worth wild! <br><br>First of the service was phenomenal!!! If you visit the Chicago restaurants ask for \"Joe\". This man will make you feel like you're the owner of the place. <br><br>To start you can choose between a salad or soup (on the House) we had two cream of mushroom soups and it was very tasty. I had to try the oysters and I'm so happy I did because \"OMG\" pure gold! I'm still dreaming about those oysters. To drink my husband had an old fashion and I had a blackberry Collins and then a Moscow Mule. For dinner my husband had the porterhouse steak and I had the filet  with bone. Having his steak on medium was like eating butter. The best steak I've had... ever! As a side we had the baked potato which by the way was \"to die for\"!!! The cream spinach was delicious as well. We ended our night with some great coffee. In total the bill including our tip to joe was $260 dollars. Worth very penny.", "pics": null}}, {"review": {"des": "Have you ever went to a place and it was crowded and you thought to yourself I'm not ready for this?  Like you want to go but no way it's going to be a good time.  We came here to celebrate a impromptu trip.  I am a reservation maker- and now the SO is too.  We came in to crowded place went to the hostess and of course our table was not ready so we waited in the bar.  It could have been bad but the service at the bar was near perfection.  Just the right amount of glitzy uptown mixed with the friendly feel of your neighborhood dive.  Table took 2 drinks but we didn't mind. We ended up getting sat next to the swinging kitchen door.  UGH..... I never could figure out why they put tables there, until here. This place even managed to make the worst seat in the place the best.  Not one server had a frown, the whole thing looked like a dance.  It was actually great to watch.  <br>The service is in a class by itself. I have been to some elegant places. It's not fussy but I swear if I even thought about something they brought it to me. Did I mention it was a crowded Saturday night?  Somehow, they make you feel as if he came to work just to wait on your table.  <br>The steak was perfection.  We shared a porterhouse and they even sliced it for us!  Every side and appetizer was a treat.  The real stand out is that behemoth of a dessert!! They stick a massive steak knife in it and it still doesn't reach the bottom.  The density is of a brownie and just as rich.  We were eating that night the next night and the 2 more nights between the 2 of us!! Its big,  it's too much ... but you HAVE  to get it!!!<br>I tell everyone they should at least try Gibson's once.. I don't live in Chi-town and I make a regular appearance!", "pics": null}}, {"review": {"des": "While deciding which steakhouse to try out while we were in Chicago, we decided to go with Gibson's and it did not disappoint!<br><br>I liked that the waiter brings out different cuts of meats and seafood they offer so that you can compare the size of each. The colossal lobster tail he brought out was huge! It's supposed to be just the tail but it looked like the size of an actual lobster!<br><br>Chicago Cut 22oz ($59): the bf and I shared and it was more than enough for the both of us. Loved the char and crust on the outside of the steak while the inside was still very juicy and tender. So good!<br><br>For our sides we had the mashed potatoes with gravy ($8.75) and creamed spinach ($9.25). Both were delicious as well but nothing spectacular. It complemented the steak.<br><br>The dinner also came with a variety bread basket and butter and either soup or salad. We opted for the soup which was gumbo. The gumbo was only ok to me.<br><br>We were so full by the end of our meal that we couldn't order the slice of cake for dessert. The slice is so huge no way we could've finished even a quarter of it between us two. I tried asking our server if they have a smaller size which they don't. Kinda bummed I didn't get to try it but it would've been such a waste if we ordered it. Definitely would have to share it between multiple people.<br><br>Service was superb. Unfortunately I forgot our server's name but he was very helpful in explaining the menu and suggesting options for us. It's a very busy place for dinner so reservations are recommended!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XNEbpYb1ymX3l83Q_4zwcw/348s.jpg", "caption": "My split cut"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5sS2_sYC3hiLxa7KG1ETjQ/168s.jpg", "caption": "Sampling of their steaks and colossal Australian Lobster Tail!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/p81sdv3vJhpSiGIVoONLcA/168s.jpg", "caption": "Dinner menu"}]}}, {"review": {"des": "My favorite spot to eat and socialize Downtown.<br>Excellent service, friendly people, great food", "pics": null}}, {"review": {"des": "Amazing steak in  the heart of Chicago. I had read up on Gibson's and figured I would give it a try. Fortunately, I was by myself and so I was able to get a seat at the bar with no wait.  <br><br>Inside you're treated to live piano music in addition to quality steak and all the other plates and dishes you would expect to find at a high-end steakhouse. Beyond the amazing meal I had (22 oz Chicago cut), my experience there was made all the more incredible by the service I received from Mark at the bar.  I was pretty stressed out after a long day at a conference and he made sure that I took a step back and really enjoyed my time at Gibsons.", "pics": null}}, {"review": {"des": "Oh Gibson's, why can't there be more of you around the country?  I know that making restaurants into chains usually kills the quality and feel, but for you I would be willing to risk it. <br><br>I've probably been to Gibson's 20 times but for some reason have never formalized my love for this place. The service is always fantastic!  Last night we arrived around six with a couple of customers and a few colleagues. The table was ready as soon as we all arrived and the waiter came over quickly with the tray of meat selections.....such a nice touch. <br><br>I ordered the bone in filet which in my opinion is the only thing to order here. The bone really adds a lot of flavor. The mushrooms and garlic mashed were the perfect companions for this piece of glorious red meat!<br><br>I'm not usually a dessert person, but the table ordered the macadamia turtle ice cream dish. This thing was enormous and enough for everyone to have a mammoth piece. The flavor of this thing was magical. What a perfect ending to a fantastic culinary experience. <br><br>If you want the best steak in the Chi, don't go anywhere else!", "pics": null}}, {"review": {"des": "If I could give Gibson's more than 5 stars I would. Hands down the best filet I've ever had. Everything about Gibson's made for a wonderful evening. We sat right down with reservations we made on Open-table. When seated, we were immediately acknowledged and brought assorted bread. Our waiter brought by all the cuts of the night and described each of them and the aging process along with recommended preparation. We were easily sold on the peppercorn crusted 14oz Filet. Each entree was served with a house salad or soup. All dressings were made in house. I went with the blue cheese dressing which had blue cheese chunks in it, perfect for any blue cheese lover! Soon after came our filet and also the planked whitefish. The steak was cooked perfectly and had great flavor. It was served with a side of garlic butter, but it was not needed. The whitefish was so flakey and cooked/ seasoned to perfection. Had me fooled that it was halibut but our waiter informed us it was actually a fresh water whitefish caught in Lake Michigan. It was served with tomato slices, red onion, and mashed potatoes. <br><br>The sides are all family style so after seeing the mashed potatoes and asparagus at the table next to us, my boyfriend and I decided to not order any because it would have been too much for us. There was nothing left on our plates when we were done! Would definitely come back to Gibson's and highly recommend it for an unforgettable meal in Chicago.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ZkZPQVFmGKPeczSm7dwj6A/348s.jpg", "caption": "Planked white fish"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TFLZev7kB3oyYJLgOG9nHQ/168s.jpg", "caption": "14oz peppercorn crusted Filet, didn't even need the garlic butter!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yQCUuTTPnDBbFIsRgmzmwg/168s.jpg", "caption": "House salad with blue cheese dressing (left) and herb vinaigrette (right)"}]}}, {"review": {"des": "I was in Chicago for work and came here with three coworkers on a Tuesday night. We ordered a bottle of wine, 2 filets, a tomahawk, mashed potatoes and mushrooms. The food and service was amazing. And then came dessert. The chocolate mousse cake was HUGE! The cake had the oreo crumble crust that i haven't had since carvel cakes when i was 9 years old and i forgot how amazing it tasted. the bill for 4 of us was $360 including tip. I highly recommend this steakhouse and will come back next time im in Chicago", "pics": null}}, {"review": {"des": "My work colleagues and I were in Chicago for a conference and we simply had to come to Gibson's for one of our dinners. The service was on point, the food was very very good and the ambiance was great. My coworkers all ordered steaks while I ordered the chicken. I could only eat half of my chicken as the portion was quite big but everyone else finished their meals. For dessert we ordered the strawberry shortcake and it was much bigger than we were expecting but very delicious. I'll definitely be back when I come to Chicago again. Such a lovely restaurant!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/C4t5vXa-a5DgWZM1AVRgTA/168s.jpg", "caption": "Strawberry shortcake - very big portion"}]}}, {"review": {"des": "Got a reservation for 4 on a MONDAY night (8 PM) and boy was this place super crowded. Even with reservations, we still had to wait a good 20-30 minutes for our table to be ready. <br><br>They display their fine raw selections of meat for you to see before you order and I thought that was interesting/unique. My friend and I shared the Chicago cut (22 oz) with an order of mashed potatoes. We split it and there was still leftovers! I love the seasoning and flavoring fo the Chicago cut and would definitely recommend trying it. <br><br>Overall, service was good. They did mess up our orders and brought out only 6 oysters instead of the 8 that we ordered. OH! And they gave raisin bread..nomssss.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VWRVFDSvo_HDYMjs2aLllg/168s.jpg", "caption": "Chicago cut noms"}]}}, {"review": {"des": "This is a very nice and friendly steak house. Particularly, the steak here is the best I have ever eaten. The waiters and waitress are also very nice and they care their customers a lot. The design style in the bar is awesome, especially the candles inside the bar.", "pics": null}}, {"review": {"des": "The food was very good. The service was nice. We sat on the patio next to the WATERFALL which was amazing. Very cool laid back vibe, excellent parking, valet is available of course. I will definitely be back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hnwI_jVmjOF0oDHHBHDGUA/168s.jpg", "caption": "22 oz ribeye steak and garlic mash"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/W7j4QKlc7WXE9uvS8vk88A/168s.jpg", "caption": "Perfect lobster bisque"}]}}, {"review": {"des": "I have heard my boss raved about Gibson Steakhouse for years. Whenever we talked about Chicago, he talked about how he had the best steak of his life there. So a month before our work trip I made sure to make reservations to secure dinner at a decent time. The restaurant ambience was casual, totally not what I expected. But I actually like that it was casual and not your typical fancy steakhouse.<br><br>After looking at the menu, I've ordered the bone-in filet mignon (16oz) and share the baked sweet potato, creamed of spinach, grilled asparagus and macadamia turtle pie. Unfortunately my steak was overcooked, when I pointed it out to the waiter, he told me to cut down the middle of the meat and though it was a little bit more rare, it was still overcooked. If you looked at the pictures, you can see they over seared the filet. It pains me to go to a steakhouse and the steak is not properly cook per my request.  My boss ordered the Chicago cut and it was cooked perfectly medium rare so it was juicy. I should have listen to him but I wasn't that hungry to finish a 24oz. My other coworker order a medium rare T-bone which was also overcook. So I recommend getting the Chicago cut! Now about the sides, everything was good but my favorite was the cream of spinach! The macadamia turtle pie was massive! It was big as my head and I have a nice size head!<br><br>Overall, dinner was average in IMO. Steak was good but not mind blown good. However, the sides were fantasia! The tutle pie was primarily vanilla ice cream so it was ok too. Our server wasn't very friendly so service was also average. Overall, 3 solid stars for me.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sNBXor7ex4_DQVw1IKD0Mg/348s.jpg", "caption": "Chicago cut- get this!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/A6GJ2VRtnaG7lefh8_8gag/168s.jpg", "caption": "Macadamia Turtle Pie"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rJPsJb_SxJgUdbE8coFHJA/168s.jpg", "caption": "The sides: HUGE sweet potato, cream of spinach and asparagus. All good"}]}}, {"review": {"des": "I was a bit apprehensive about going to a steakhouse because I am not a fan of steak. I am so glad my colleagues convinced me to go because this was some of the best food I've ever had. <br><br>With a party of 10, we were able to try just about everything on the menu and ALL of it was delicious. I highly highly highly recommend dining here if you're in town.", "pics": null}}, {"review": {"des": "Excellent service as you would expect from a steak house.  I got the Chicago Cut, which is essentially a rib eye.  It tasted great.  It needed just a little salt.  In hind sight I should have asked for some fresh horseradish.  After finishing that giant chunk of meat, i commented that I haven't eaten that much red meat in a single serving since Jan 2009.  <br><br>As for the sides, they were simply average.  The brussel sprouts were undercooked.  The mash potatoes were just average.  We finished it off with apple pie.  The apple chunks were crunchy.  Not just a little crunch, but raw crunch.  All of the items other than the steak were not worth the calorie.  <br><br>What did I learn today?  It sure seems like restaurants with signed pictures of celebrities are stuck in the 80's and 90's.", "pics": null}}, {"review": {"des": "Their signature Chicago Cut (rib eye bone in) was delicious. Nicely charred and not too salty and cooked to perfection.<br><br>celebrated my birthday and had a slice of carrot cake, is huge is practically a 1/4 of a 9\" whole carrot cake.   <br><br>Services were fantastic, will visit again the next time I return to visit Chicago.", "pics": null}}, {"review": {"des": "JOE gave me a life long memory.  My BF & I took his parents (brownie points) to CHI for a weekend and Gibson's blew them away.  Upon arrival, Joe welcomed us and the second he starting talking to us- it's like we were life time friends. he is smart- and knows his food.  he did not rush us and gave us the most amazing memory.  thank you gibsons, and joe, for making our entire weekend.", "pics": null}}, {"review": {"des": "This classic steak house has been here for decades so we decided to give a try. Because we could only made a reservation in the early evening, we just walked here from the hotel. Every staff was friendly and smiled at you. The server brought out a large plate of several cuts of beef and cuts of lobster tail. It's very helpful. Our water glass was always topped of frequently and the manager would check on every table. We ordered beef barley soup, side of salad, sautéed mushroom, Chicago Cut steak and sliced strip steak with mashed potatoes and spinach. It was really delicious! The complimentary bread was great too with their homemade butter. <br>It probably was the best steak which I ever had. Everything was so harmonious when I put into my mouth. The portion was very generous so I didn't save the room for the dessert. <br><br>Love this place. Highly recommend it to anyone who visits.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qXlGjEpnOcMNw5ua0oD6AQ/348s.jpg", "caption": "Chicago Cut"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cx1jOXD1RVYGxJ84iBJs1w/168s.jpg", "caption": "Outside"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QRLHLzvnNaSwtqdKjfHwGQ/168s.jpg", "caption": "Strip steak with smashed potatoes and spinach and W.R Chicago Cut(22 oz)"}]}}, {"review": {"des": "Another great meal!<br><br>Strawberry Shortcake is outstanding!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4Yvw8Co6MQbM0hv39FkwdQ/348s.jpg", "caption": "Hash Browns"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/a-8uyqYbsrQY_raX5Qd0BA/168s.jpg", "caption": "7 oz Filet"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qB36emrqIxu3OMIS3MiWIw/168s.jpg", "caption": "WR Chicago Cut"}]}}, {"review": {"des": "Was in town for the weekend and definitely wanted to try Gibson's. For the most part it lived up to the hype. Walked in on a Saturday night and got a table for 2 in the reserved table bar area. I think we got lucky, I would definitely make reservations if you plan on coming on the weekend. The waitress was great (thanks for the reservations on nightlife in the city) the people at the front door were welcoming. It was packed so I think that says something about the service. I ordered a filet which was good I've had better, but would recommend it. Huge wine, beer, and champaign section on the menu which was nice. Cheapest champagne I think was $11/ glass. It's also in a great location, next time I'm in town I'll probably stop back!", "pics": null}}, {"review": {"des": "My favorite steakhouse in Chicago. Everything about it freaking rocks. The food. The service. The drinks. The dessert.<br><br>First, it's important to know I am a ribeye gal but here, I'll eat the filet cooked medium. So flavorful and cooked to perfection. You can't go wrong with it. <br><br>Second, skip the salad and go for the sides. We had mushrooms, asparagus, twice backed potato, and creamed spinach. The only reason I had steak to take home was because I filled up on sides. <br><br>Third, slow and steady wins the race. Save room for dessert and drinks. My recommendations are the chocolate mousse pie  and the key lime pie. Both hit the spot when it comes to sweets. If you prefer to drink your calories, go with a Moscow mule. <br><br>Finally, the service here is top notch. Money well spent for a great meal. Kudos to our event manager, Carlos, and his team of servers who made me laugh, smile, and relax.", "pics": null}}, {"review": {"des": "I finally made it to Gibsons recently. Talk about ambience. True steak house vibes. We received incredible service from our waiter and cocktail server. Our filet and porterhouse were on point! The double baked potato and side of mushrooms complemented our steaks well. <br><br>We arrived at 9 on a Saturday night. We enjoyed some cocktails while we waited to be seated (at 10:15). Because I didn't want to sit at a two top by a servers' station in a high traffic area, we waited a few more minutes to then be seated in between two sets of French doors that lead to the window tables. This was my fault since we didn't make reservations. It was nice to be close enough to the windows to see outside, but I would have rather waited again to get a 4 top and be comfortable. Several other couples had 4 tops, and it was 10:30 at that point, so it would have been appreciated. That is the only negative thing I'll say. Now I know what to ask for when making a reservation. <br><br>I loved this experience. Thank you, Gibsons.", "pics": null}}, {"review": {"des": "Service was great however the food was terrible. Kathy at the front was so nice. <br><br>Our party had the wrong steaks show up,2 of the steaks had to be sent back twice because they were cooked incorrectly. My wife steak was supposed to be medium well came out like a chunk of char. <br><br>Overall pretty disappointed with the food as I heard such great things about this place.", "pics": null}}, {"review": {"des": "This place is incredible. Never been to this location until tonight and wow have I been missing out having lived in this area of the city for a year and a half now! Carl is the server you MUST have. He's been there for 3/4's my life and knows his stuff. Very thorough, personable and gave us such an incredible dining experience. He works thursdays, fridays and Saturday's FYI. See you soon Carl!!", "pics": null}}, {"review": {"des": "Beautiful setting on the corner of Rush and Bellevue.  Summertime on the outdoor seating is great for people watching and the staff are attentive and professional.  Unfortunately, the food can best be described as average and of course, expensive.  Grab a drink enjoy the views but save your appetite for somewhere else.", "pics": null}}, {"review": {"des": "Ordered the WC Chicago's cut - ribeye bone in. The steak was a bit dry for my tasting. I liked how our waitress came to us with the meat cuts before they're cooked explaining each of the steaks that you're interested in. Also ordered two sides - mushrooms and brussel sprouts which were both okay. I've had much better sides at other steak restaurants", "pics": null}}, {"review": {"des": "We had a lovely time here.  The setting, service, and food were all excellent.  I like that the steak comes with a salad, which was also good.  I had a filet cooked perfectly and a spritz.  The spritz was perfect for the hot day.  Make your reservation in advance.  You won't regret it.", "pics": null}}, {"review": {"des": "Amazing steakhouse. Came here for my birthday in 2017.  The prime rib was delicious and the macadamia ice cream cake is the real deal. It's huge!!!  Service was great. Great neighborhood with lots of places to walk around after dinner. Service was great as well. My favorite steakhouse in the US. Wish we had Gibson's in So Cal!  Steakhouses in So Cal can't compete with this place.", "pics": null}}, {"review": {"des": "If your in a mood for a great Steak!.. and your in Chicago, Gibsons Bar & Steakhouse is the place.  Very busy restaurant so I highly recommend reservations.  <br>Our party was seated upstairs of the restaurant over looking the boulevard. Pianist gave it a very nice touch during our dining. Servers knew steak cuts giving advice with great personalities. My steak was tender and delicious. <br>Dessert was Awesome!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/v3uoKDMW2djf3usYtwLNkQ/348s.jpg", "caption": "26oz Porterhouse"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xq9Clwh63r8xoRCubBeUEg/168s.jpg", "caption": "Macadamia turtle pie"}]}}, {"review": {"des": "I'm rating my experience at the Gibson's Bar. What a great place to stop by anytime...but especially for a happy hour on a Friday afternoon. Great ascetics. Great vibe. Great service. And old school steakhouse feel, perfect for a city bar. The bartenders are awesome and will make you whatever today have a hankering for, whether it's on the drink menu or not. They have a few TVs on in the background if you want to catch a game. Love this place.", "pics": null}}, {"review": {"des": "Lucky me, I had dinner at Gibsons on both Sunday and Monday this week due to a conference. <br><br>On Sunday, steak was good. Service was...not great. We were told the steak came with soup or salad which we questioned because I was not aware of Gibsons doing that.  We were charged for the salads even after we confirmed they were included with the meal. Server moved stuff on the table telling us not to worry, she would move it back. She didn't. Is it normal to be elbowed in the face when getting your water filled? Apparently so. How about being cut off by servers as you try to move your way to the exit? Happened at least three times. At other Gibsons, they always step the side and let you proceed.<br><br>Oh, but Monday was more fun! A person I was with spilled her wine. The server acted like that had never ever happened before and seemed to be shaming her for spilling her wine. But he did provide new napkins and a menu. <br><br>I decided to get the scallop and shrimp mixed grill. What a mistake. While the scallops were delicious, the shrimp was so overcooked, I had trouble cutting it with a steak knife. When I told the server about the shrimp, I was asked how the scallops were and then given a bread plate to place the shrimp on to return them to the kitchen while it was kindly being pointed out that missed a shrimp. It was a farce because I could not stab them with a fork as they were beyond overcooked. I was told replacement shrimp would be right out. 15 minutes later, I received an apology for still not having replacement shrimp, a comped prosecco and told that they would comp my meal. I told them thank you and please don't bother bringing the shrimp as I was fine with the scallops and the comps. And, no thank you, I don't require or want anything else.<br><br>About 10-12 minutes later I hear \"you like fish\" and the server places a crab cake in front of me which I neither asked for or desired but they wanted to comp me that as well because they wanted me to be happy. I ended up not touching it and bringing it home. It was just a  weird experience, but I did like the waiter better the second day.<br><br>If going, get the steak or the crab cake (ate that tonight), but don't expect much. I would recommend Gibsons Rosemont over this location.", "pics": null}}, {"review": {"des": "The food: 5/5. I went there for dessert and great dessert I got. Not a fan of macadamia nuts, but their macadamia turtle pie was amazing. <br><br>The service: 5/5. I let the waiter pick the dessert for me because he knew best, clearly, and also we saw Jane Fonda walking out. <br><br>Overall: 4/5. Minus one star for the stuffy ambiance.", "pics": null}}, {"review": {"des": "I'm sure anything's that had to be said about Gibson's has been said.... but not this!<br>Here's how tonight went. Firstly, had 9pm res. Showed at 6. \"Of course we can seat u early\"... never happens anywhere. Second. The wife forgets her pony hair tie. THE HOSTESS OFFERS HERS!!! Elizabeth, you're fucking amazing!!! We order, my steak comes out perfectly along with the Cab I ordered... that NEVER happens... and the rest of the service is seamless thx to RACHEL the server who just floats among the tables and serves like this is just her having fun, not work... no stress in her body language... best EXPERIENCE ever at Gibson's!!!!", "pics": null}}, {"review": {"des": "The food is awful. We ordered steak and two of the fish, sea base and white fish. The streak was like made in China and the fish we could not even swallow. It tasted like coughing medicine.<br>Appetizers, we ordered house salad, tomato onion and carpaccio. These were were straight from Aldi..... not even washed or season. <br><br>I don't know why people go there and give high rating. If it's expensive doesn't mean it's good, unless you're so stupid and only eat at KFC.<br><br>It's a chain.....this is what you get..... no wonder.", "pics": null}}, {"review": {"des": "Gibsons is one of the best restaurants in Chicago. It's a place that everyone should go to at least once in their life. Their steaks and desserts are incredible. Some of the other things on their menu are delicious as well.", "pics": null}}, {"review": {"des": "Omfg so good. Best steak. Best food. Best service. Cant say enough good things. Its worth it.", "pics": null}}, {"review": {"des": "After four years, I've finally come here in my parents' last trip to Chicago. I'm glad we did! <br><br>Service & atmosphere: our waiter was very friendly and informative. The decor is old school and the so is the menu. Waiters wear the retro white coats and the wood paneling may be dated, but not wincingly so. <br><br>Food: we ordered the ribeyes (Chicago cut) rare, a rare prime rib, side salads with the house blue cheese dressing, brussel sprouts, double baked potato, and drinks all around for four. The blue cheese dressing, at the waiter promised, was tangy and creamy. Yelp recommendations didn't steer us wrong, the potato was delicious with crispy skin and cheese baked on top. The ribeye and prime rib were cooked perfectly to our requests. My ribeye was charred well with minimal seasoning which perfectly enhanced the natural savoriness. <br><br>As meat lovers, we've been frequently disappointed by steakhouses in Chicago (ahem Kinzie chophouse). Don't be dissuaded by its Viagra Triangle location or tourist trap vibes, it's as good a steakhouse option as any of the trendy, pretentious steakhouses that litter River North.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ubuyfe0irdTFKHAf91DNIQ/348s.jpg", "caption": "That's only a fourth of the double baked potato"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/t9mv41L6RojQiiqkXS-CCA/168s.jpg", "caption": "Brussel sprouts"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sT7JK16finR5ZcPgrTlMOw/168s.jpg", "caption": "Mouth-watering prime rib"}]}}, {"review": {"des": "I had very high expectations going into my Gibson's experience. And honestly the meal fell short of a good time. The food was just okay.. the service was not friendly. Celebrated an anniversary dinner here and we both agreed chipotle would've been a better meal. If I could take one positive out of the trip it would be ordering the carrot cake. We ordered it to go and it was the largest piece of cake I've ever seen. Probably could feed 10 people.", "pics": null}}, {"review": {"des": "This is going to be my longest review but this restaurant deserves it!<br><br>First time in Chicago celebrating my boyfriend's 30th birthday and I wanted to take him out to a nice dinner in town. I heard many recommendations for Gibson's and decided to go for it. I made a reservation online on the OpenTable app and there was a section that asked me if I was celebrating anything in particular so I selected the 'birthday' option, not thinking they would bring it up. Our reservation was for 9:30, we arrived around 9:15 and were asked to wait a few minutes as they prepared our table. The ambiance inside is very romantic and relaxing, there's a piano in the bar area and there was someone playing live music. After only 5 minutes we were sat before our reservation time (very convenient) in a very cozy area by the glass window facing the downtown street with a view of the Christmas decorations and lights outside. As we sat down, we were instantly brought bread and water along with menus. Only a few moments after that our waiter came and introduced himself and shook our hands, he mentioned he saw in our reservation that it was someone's birthday, and congratulated my boyfriend. I was so impressed that they actually pay attention to the details of online reservations. He came with a wooden plates of meats, he was so sweet and welcoming and explained each meat on the menu and showed us what to expect with each different option. The display and service of the restaurant is impecable! I was amazed with the presentation of just the display. We asked for recommendations and he was very knowledgeable. <br><br>We had a delicious meal, worth every penny. This was the best service and quality of food combined that I've ever experienced. After our dinner, our waiter brought us a complimentary dessert for my boyfriend's birthday and we sang happy birthday with a wonderful speech to follow (I'll include pictures and a video).<br><br>Our waiter's name was Joseph and he was by far he sweetest waiter I've ever had. Thank you, Gibson's Steakhouse for a wonderful night and dinner!", "pics": null}}, {"review": {"des": "This might seem like the touristy thing to do, but don't pass it up based on that.  The wine list was perfect!  Nice enough of a night so we were able to sit outside and enjoy ourselves.  i had the rib eye and the crush on it was perfect and cooked to my liking!  Side of mushrooms, baked potatoes and brussel sprouts to split were the perfect trio", "pics": null}}, {"review": {"des": "Oh my God, Gibsons is not kidding around with their own USDA beef designation. Maybe it was the marketing having a powerful placebo effect, but Gibsons beef had the most distinct and delicious flavor of all the old-school steakhouses that I've been to in this town (Chophouse, Morton's) and a very comfortable and nicely kept dining room. The popular twice-baked potato and banana cream pie were more about spectacle than flavor. Both were huge but bland. The sauteed rapini was very good and perfectly done though. Just go for the steak, which is worth the trip alone.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/04LU9bjQir2d7tE1OeYxGg/348s.jpg", "caption": "Banana cream pie"}]}}, {"review": {"des": "Oh Gibson's... <br><br>What a crowd. What a scene. Young, old, famous and those wishing we were. Every minute they are open, they are flocked to. <br><br>I live in the neighborhood and have had many meals and or cocktails here. Service is always top notch. Mo is my favorite server. He's fast on his feet, remembers every detail of your order without writing a thing down. The icing on the cake is his larger than life personality. Amazing!<br><br>Full dining late night is always handy. I like coming here after a game or evening at the theater. You can walk in at 11pm and it still feels like 8pm. <br><br>The dark wood and green checked tablecloths are classic steakhouse. The only twist is the fast paced action. If a supper club and a singles bar had a baby, Gibson's Gold Coast would be their prodigal child!<br><br>Valet parking and parking lots are available.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2cEh-cJLQRZuKUSsaq1icg/348s.jpg", "caption": "Lloyd our favorite piano man!"}]}}, {"review": {"des": "Still one of the best places in the city for steak! Highly recommend the Chicago cut! Desserts look fantastic and can feed up to 20 people, but they are a bit generic in taste. We were disappointed with the chocolate hazelnut cake, too much lemon taste in the hazelnut filling and underwhelming chocolate devil cake batter.", "pics": null}}, {"review": {"des": "Service is next to none! Moe was our server and he was great and very attentive. Sea bass and porterhouse steak were probably were one of the best entrees I've ever had. The sides of veggies and potatoes are large enough to split between 3-4 people, we had a ton left over! Good spot for a date night or birthday celebration. Bill for the two of us (we each got 1 drink) was about $160 without tip. Pricey but so worth it!", "pics": null}}, {"review": {"des": "Recently sat in the bar area on a Friday night to get a drink and split some apps. Great spot for the holidays- had a bunch of Christmas decorations up and live piano music. Split their burger (came with fries) and the seared ahi tuna appetizer which were both great.", "pics": null}}, {"review": {"des": "Gibson does it BIG. <br><br>We had to wait a while but the bar and piano guy kept us occupied. The atmosphere is lively and dim. The server is authentic. He cared about us, brought us bread, and showed us all the cuts before ordering.<br><br>Ordered the crab and avocado appetizer. This included chilled crab and creamy avocado with capers, celery, and other veggies. Went ahead and ordered a dozen oysters which were big, juicy, and not briny.<br><br>For entrees: I got the porterhouse done medium. It was red and juicy. The seasoning was simple. I felt like a peasant eating a king's meal. It's so large, you must share. <br>The fish was very good. It comes with peas and mushrooms that have a sour taste every time you bite. Everything else looked like it was cooked perfectly. <br><br>Side dishes/al a carte: asparagus with hollandaise sauce and the Brussels sprouts. I fancied the latter more but I couldn't turn down creamy, hollandaise sauce. <br><br>And the star of the show was the CAKE. Chocolate cake as tall as a book with a giant Gibson steak knife to keep it down.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Buunh3S5Adbz2vbu-hpQsg/348s.jpg", "caption": "Cake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ag14gK9MiPxLrbUFvLeHzA/168s.jpg", "caption": "Porterhouse Steak"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UId_ujEFmOSzWVEx037srw/168s.jpg", "caption": "Fish"}]}}, {"review": {"des": "I've tried nearly all the independent steakhouses in River North so that you don't have to. This is the one you're looking for.<br><br>Gibsons is a very old school steakhouse. The classic starters and sides are here, without any pretensions. And Gibson's is all about the meat. Their meat isn't just prime, it is their own designation of Gibsons USDA Prime, the only restaurant in the US to have one. So of course the meat is very flavorful and tender. As you would expect, the sirloins and the sirloin sides of the T-bone and Porterhouse have all the flavor, while the filet sides are very tender but comparatively bland. My steak was beautifully seasoned and seared, but cooked a bit beyond the requested medium rare. Of course, my server would have been delighted to replace it, but I can't stand to waste a perfectly good $52 steak. By the way, I had the T-bone, which is essentially a baby porterhouse.<br><br>But what about the other dishes? My favorite item was actually the crab and avocado appetizer. The very generous serving of delicious crab was lightly dressed and served with creamy avocado slices. Really nice.<br><br>I was going to order a half salad, but my waiter suggested I go with the complementary house salad that comes with all the steaks, and it was a great suggestion. Crisp lettuce and tomatoes were topped with an excellent creamy blue cheese dressing.<br><br>I did have a half order of creamed spinach with my steak. I liked the fact that it emphasized the spinach, with just enough cream to give it a smooth consistency, but allowing the focus to be on the flavor of the spinach.<br><br>Service was both friendly and professional, a delicate balance. Pricing is fairly reasonable considering the inclusion of a salad, and wine prices aren't unreasonable either.<br><br>The place is very, very popular and therefore packed at all hours, so be sure to make reservations. Ask to sit in the \"porch\", a side room with windows looking out on the park; it's much quieter than the main dining room or deafening bar.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CTk-1l_pc12bAJVS729Atw/348s.jpg", "caption": "Exterior"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PPu0u62TBRX9RWMWnzpSAw/168s.jpg", "caption": "Dining room"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tNwKq7h4KYkLXAHzU6zzcg/168s.jpg", "caption": "T-bone"}]}}, {"review": {"des": "I had an incredible dinner here last week while I was in Chicago for work. My coworkers and I were lucky to snag an open table in the front room. It was absolutely packed, definitely a popular spot for post-workday drinks. You'll probably want to make a reservation, but if you come here on a whim as we did, you might get lucky.<br><br>I chose the New York Sirloin, and it was a delicious steak. I don't consider myself too much of a steak connoisseur (don't get me wrong, I enjoy a good one--but I'm also not the pickiest), but I can confidently say this was the best steak I've had in my life. The sear and resulting crust on the outside was perfect and packed with flavor. This was in contrast to the tender, pink, juicy center. Every bite was delicious. <br><br>I had a baked potato on the side (a classic combination), as well as the house side salad. I found the salad to be a little boring, however nobody is going to a famous steakhouse like Gibson's for the side salad, so I'm giving it a pass. :-)<br><br>The vibe is pretty old school and classic, and it really feels like a true Chicago institution. I'm glad I got to experience Gibson's, and hope I'll get the chance to return.", "pics": null}}, {"review": {"des": "The restaurant deserves 5 stars but the parking situation valet is 1. I provided my ticket and when it started taking a long time I asked where my car was and he said (the manager) is this or that yours, I said no. So he gets on the radio and asks where it is and proclaims this and that about me that's untrue . Then I said that's not what I asked for, don't say that m, and he said, \" I don't give a fuck about your $20.\"<br><br>Clearly !", "pics": null}}, {"review": {"des": "I was here for a business dinner and the food was good.  The steak was delicious (filet) but I have had better at other comparable steakhouses.  <br><br>The service was phenomenal, drinks were good, and the atmosphere is great.  4 stars for the good food, excellent service and atmosphere.", "pics": null}}, {"review": {"des": "Good food, GREAT company, OUTSTANDING waiter named Elvis!<br>------------------<br>This was our second time here, this time, with friends. Last night's dinner was a blast and elevated it to a true 5-star experience!<br><br>You can read all the other reviews for the various food options (briefly, get the double baked potato, the WG cut, and wilted spinach, and save room for the chocolate mousse cake!)<br><br>This review is about our waiter Elvis (stage name?). He was a 5'1\" cross between Kobe Bryant and Don Cheadle. This guy was an absolute riot!!  He playfully poked fun at my friend (who easily gets riled up, but all in good fun). At one point, when my wife had to send a steak back for being over cooked (medium instead of medium rare), he said to my friend, \"I expected a complaint from this table, but I thought it would come from you!\" :)<br><br>Jokes were flying left and right, and at one point he left one dessert menu (party if 5), and without warning, took the menu away before we ordered. Without warning, he brought a HUGE ASS slice of chocolate mousse cake, exactly what we were planning on ordering!<br><br>Plus, he continually cracked jokes / ?flirted with my friend, at one point giving us a gift bottle of Gibson's house seasoning (and giving her two!) LOL!! <br><br>I'm glad I booked this place for dinner. As you know, I don't often give 5 stars anymore, but this was a rare gem of an experience! A++, WOULD DEFINITELY COME BACK!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gi986doBe78rJPh6bLV3ZQ/348s.jpg", "caption": "The bill"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/d_gjbutFFXYlEp4Vdu1wrA/168s.jpg", "caption": "Chocolate mousse cake - ONE SLICE!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nKyjMi6G_kGOZnDD76FJwg/168s.jpg", "caption": "\"Can you take a group photo\" ...and this is what we get, LOL!"}]}}, {"review": {"des": "I went to the men's room and a tall guy stepped up to the urinal next to me...it was Kobe Bryant, come on ...where else do you get to piss with Kobe?<br><br>This is very easy, in a city full of outstanding Steak house Gibson's is my favorite! Start with the Crab and Avocado appetizer...yum! Then split a wedge salad if you want to be able to eat your meaI,  highly recommend the ribeye...it can be cut with your fork. The  way they cook there steaks at extreme high temperature creates an outstanding sear with a juicy center...Boom!", "pics": null}}, {"review": {"des": "This was my first time dining at Gibson's. I went to this location for a birthday party and for starts the waiter was not what I expected. He did not tell us about any specials or chef's pick, let alone introduce himself to the table of 13. (FYI - we were squished in a corner with no elbow room to eat) I am guessing because our reservations were at 10PM, H could not remember who ordered what and had a very short attitude. <br><br>I am unaware of the experience that others are saying we should have received. Something about showing us the different meats? I never saw a platter of meats. I ordered crab legs, wine, mashed potatoes and a MEDIUM filet mignon. <br><br>I ended up sending my filet mignon back it was WELL DONE and completely overcooked. <br>The mashed potatoes were cold and 10 minutes after taking my first bite I had the WORST stomachache and could not finish my food. <br><br>The waiter gave me a ginger ale on the house. No manager, no apology. Just a bill. <br><br>I will NEVER come back to this place nor any other Gibson's by the way my stomach started to hurt. I would not recommend this place if it was the last resort. Try Dublin's across the street!", "pics": null}}, {"review": {"des": "I flew into Chicago late on a Thursday night and headed straight to Gibson's, it was the absolute best decision I made the entire trip. The group I was with sat to eat at around 10:00pm and the restaurant was still bustling with a live piano player and every was full. For a steakhouse the vibe was surprisingly not stuffy or fancy - it felt very comfortable and homey with character. As far as the food goes it was delicious. I got the filet mignon, and I HIGHLY recommend it. They will offer you different options for seasoning the filet and it doesn't need any of them - the plain cracked pepper let the steak speak for itself! My brother ordered the Chicago cut (their most popular) and it was good but I actually preferred my filet mignon. For the  sides you split them so we ordered a few for our table. We got the charred broccoli (a must), garlic mashed potatoes (very good), French fries ( not the best I've ever had but LOVE fries with my steak so I'd recommend) and the Brussels sprouts (good, but I'd probably try another side if I went back). <br><br>Gibson's was exactly the type of food/ atmosphere I wanted to welcome me to the Midwest - definitely recommend to anyone visiting Chicago.", "pics": null}}, {"review": {"des": "Not that you need my opinion, but we dined on Monday night and had a wonderful experience. The entire crew from host staff(starting with making our reservation over the phone the day before), to bartenders, to dining room team were perfect. Special shout out to Lance! Who could not have been more charming, knowledgeable, helpful and accommodating. <br>Gibson's remains my ideal of the classic steakhouse experience. Make a reservation, show up early, have a cocktail at the bar and enjoy the live piano; then get ready to have one of the best meals of your life!", "pics": null}}, {"review": {"des": "Really disappointed in my experience with Gibson's. My fiancé had his bachelor party dinner there in June and I filled out one of their \"tonight's on me\" forms to have champagne sent to the table when they arrived. I spoke with several people to ensure the drinks would be served right away. Not only were the drinks not served until the very end of the meal despite my request, when everyone was too full to finish them, but my fiancé and his friends were never informed the drinks were from me, which led them to believe the drinks were on the house (even though they were charged to my credit card.) What really got me, though, is multiple attempts to contact Gibson's via phone, email, social media etc have been completely ignored.", "pics": null}}, {"review": {"des": "Way overdone steak...even after they redid it.<br>Asparagus was delicious.<br>Bread serving nice.<br>I have had their burgers before and liked it...also the rib eye sandwich but this time I ordered filet mignon and was blah. <br><br>I will go back, though.", "pics": null}}, {"review": {"des": "Steak salad was awesome service was spectacular <br>Nice date place during the lunch time it was quite!", "pics": null}}, {"review": {"des": "This is probably the best steakhouse I've been to. If you are going to splurge this is the place to do it. Our waiter was was very informative and told us everything we needed to know about the meats and seafood of the day. The service was stupendous. The Cabernet we ordered paired perfectly with our food. I will warn that the dessert are gigantic. We ate about 1/4 of it and took the rest with us.", "pics": null}}, {"review": {"des": "You can never go wrong with this place. Tonight I was in the mood for a late night steak and earlier I was closer to Chicago Cut, but wanted Gibson's more but didn't think I had the time. So after a mishap with a rug at Chicago Cut they refused to serve me so I said no problem I will just go to Gibson's. I hopped in a cab and made it just at one. No issues on service they whipped me up a seared tuna appetizer and a steak. Quality was way better and I found out how much people value your business.", "pics": null}}, {"review": {"des": "A trip to Chicago had to include a good steak house, and thanks to some heavy research and a lot of recommendations we found a great one. We got there for a slightly early dinner and were greeted by a nice young lady who quickly checked our winter coats and lead us to another nice lady who showed us to our table. After our drink orders were placed our waiter came over with a huge platter of meat and seafood as he described the specials of the day. It wasn't long before we each knew exactly what we wanted. My buddies each chose a different cut of steak with just a side salad and I went for the large Porterhouse medium rare (My usual choice of rib-eye was just a little to rich for my taste) along with a side of the the crab and avocado salad. The salads arrived first and my crab and avocado salad looked perfect and tasted even better than it looked. Once the salads were cleared and our steaks hit the table all talking stopped as we soaked in the beautiful sites in front of us. Each steak was cooked exactly like we asked. My steak was exquisite, perfectly charred on the outside to make it just barely crispy but leaving the interior absolutely perfect. The aging process worked it's magic making every bite so filled with beefy flavor I thought my head was going to explode with joy. I can say without any doubt that this was the single greatest steak I have ever eaten, period. Prices were what you would think a high end steak house would be, service was exceptional and the food was absolutely amazing. I can't wait to come back to Chicago to get my fix of amazing beef.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Qc03O5jIzi0qe8kGAqTzJg/348s.jpg", "caption": "Check this off the bucket list"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oDBZ-HumZ422RajvLVCDOg/168s.jpg", "caption": "Avocado crab appetizer"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YG2RrF_AW36Gpn51kpHoVg/168s.jpg", "caption": "Amazing porterhouse"}]}}, {"review": {"des": "Had a couple lemon drops and a couple cocktails waiting for a table the night before St. Patrick's Day.   It was a packed packed Friday night so it was a rather long wait but worth every minute!   Steak was AMAZE!   The pie however.... omg HUGE and legit!", "pics": null}}, {"review": {"des": "It's your normal steakhouse but not normal in the sense of décor.  Instead of dimly lit seating area with dark wooding everywhere, this place was brightly lit and medium colored wood everywhere.<br><br>I forgot to take pictures of the food but remembered everything tasted so good.  And the waiter was awesome to everyone.<br><br>Yelp Challenge: #52/100.", "pics": null}}, {"review": {"des": "My husband and I were in the city for the Air and Water show and were famished by it's end.  We ambled over to former haunts on Rush Street but nothing appealed.<br><br>Until...we were walking past Gibson's Steakhouse and I spied both an outdoor table and items from the lunch menu.<br><br>We didn't want to drop the big bucks unless we were psyched and dressed.   The lunch menu had precisely what the hungry guy and the food snitch wanted:. Prime rib dip au jus.  <br><br>Our waiter (short reddish hair working his arse off) greeted us promptly and efficiently returned with our beer as he dropped the order into the kitchen.  <br><br>I only had a few minutes to sample the yummy bread before our food arrived.  The sandwich was plated separately than the au jus which was accompanied by some interesting marinated veggies and peppers.  <br><br>The bread was perfection crusty and gently toasted.  To-die for was the succulent prime rib which nearly gave me lustful thoughts.  Heaven was in front of me.   I savored each bite.  <br><br>Even the cole slaw was first rate.  <br><br>Having been to many notable pricey steakhouses, I now know Gibson's can't be beat.<br><br>I hope our charming red haired waiter is working on our next adventure.<br><br>Yes yes yes!", "pics": null}}, {"review": {"des": "Gibsons was recommended by one of my colleague's for a nice dinner out in downtown. We figured that we would dress up since Gibsons seemed to be similar to mccormick and schmick's. From what I remember, mccormick and shmick's has a dress code. When we did arrive to the restaurant on a rainy day on 10/15/17, there were a handful of people dressed up to dine out. We did feel a little out of place, but you know, when in doubt, overdress. We checked our coats and proceeded to the greeter. We were seated near the patio area. <br><br>We were served 3 different kinds of bread and water. Bread could have been a little warm, but they were tasty. Soon after, we ordered a bottle of Zinfandel, 2013 (delicious). Our server showed us all the cuts of meat and the lobster they had for the day. <br><br>He ordered W.R.'s Chicago Cut with a cup of gumbo and I ordered a side of Brussel sprout with Alaskan Red King Crab Claw. We asked everything to come out together except the gumbo. <br>Gumbo: very tasty with big pieces of meat<br>W.R.'s Chicago Cut: soft and tasty, asked for medium rare, but it was a bit overcooked inside. Charred outside as the waiter had mentioned<br>Brussel Sprouts: So Good. Hands down the best Brussel sprouts ever. I always get Brussel sprouts when I see it at a restaurants and Gibsons' is very tasty. <br>Alaskan Red King Crab Claw: Very sweet and meaty. This is a huge claw served cold. So sweet that you don't even need the sauce they provide. It's served with a horseradish sauce.<br><br>Everything we ate were tasty. <br>If I were to complain, we did feel a little rushed at the end once we had finished our meal. The waiter kept coming back and said 'thank you. Have a good night' like we need to hurry. Until that point, he was attentive and asked the question we had about the huge spoon for the soup.<br><br>The price is fair for its portion sizes and quality. I would recommend Gibsons and would go again.", "pics": null}}, {"review": {"des": "What a great meal! The pea soup is out of this world. Our 14 ounce filets were perfectly cooked at medium rare and very flavorful for a filet. Double baked potatoes and creamed spinach were excellent. Decent martinis, but they could have been colder. Service was classy and very attentive. We also love the fact that this place has energy, yet it's comfortable and not too loud to carry on conversation. Overall a really great experience. One the best, if not the best steakhouse in the City.", "pics": null}}, {"review": {"des": "*This review is based on the service of an event held at this restaurant*<br><br>I came here for an event and was completely WOWED at the service (from the bathroom attendant, to the servers, to the bartenders). It's not very normal to have the service of such kind people deep in the city. For a southerner, this restaurant is calling me back! The hospitality is top notch. <br>The food was incredible and I loved the cocktails as well. I can't wait to come back with a group of friends! This is definitely a restaurant I would recommend to out of towners as well as my friends who live in or near Chicago.", "pics": null}}, {"review": {"des": "The place reviews itself!<br>I could take an entire day to be positive about this restaurant, as a client and as a chef and kitchen professional.<br>The high point for me is when they bring different cuts of raw meat so you can choose which one you'd like them to cook.<br>It's always a incredible experience.", "pics": null}}, {"review": {"des": "Came here because this was the only available Steakhouse in the area on Superbowl Sunday. <br>I'm not a fan of old traditional Steakhouses but I figured I'd give it a try since I haven't not had their meat. <br>Server was knowledgeable and accommodating. <br>We ordered T-bone and the famous Chicago cut bone-in ribeye. <br>They were just ok nothing too impressive.<br>I was pretty disappointed with their sides - lack of options.<br>No wonder this was the only place with availability. <br>I would have given it a 2 star if it wasn't for the dessert and the server.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6kYGGL3LJRd7gsUZK4FoHA/168s.jpg", "caption": "T-bone steak. Nothing impressive."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qsZtCMc8IzefNspUgNx2cw/168s.jpg", "caption": "It's just your typical chicken noodle soup."}]}}, {"review": {"des": "Gibson's is one of my favorite steakhouses in Chicago, not only for the delectable food but impeccable service. I stopped in the other night for dinner and drinks and was blown away by the amazing, friendly, and welcoming staff. Upon arrival, we were greeted and treated like VIP as we were shown to our table. The ambiance is quite elegant and you immediately get sucked into the classy side of life as you hear the sound of light chatter and jazz piano while you sip on your martini.<br><br>Gibson's cooks their steak marvelously. The high temps they're cooked in leaves a mouthwatering sear that is unique to Gibson's and will leave you coming back for more. Caution: the portions are mighty generous so come with a big appetite and don't forget to leave room for their famous chocolate mousse cake--trust me--you want it. <br><br>A big thank you to our waitress, Daniela, for making our experience very memorable. She was knowledgeable, friendly, helpful, and funny! She kindly helped us navigate through the extensive wine list, and gave us plenty of amazing recommendations and suggestions on fun things to do in the neighborhood after dinner. Next time I come in, I'm going to request to have her wait on our table! <br><br>We don't often treat ourselves to expensive dinners but after our wonderful experience at Gibson's, I can confidently say it was worth every penny and can't wait to go back. I wish more restaurants put more care and understood the value of offering outstanding and friendly service. I can name dozens of competing expensive restaurants in Chicago that don't treat their guests half as nice as Gibson's does.", "pics": null}}]}