{"name": "gilt-bar-chicago", "reviews": [{"review": {"des": "Two words- Truffle. Pasta.<br><br>Oh my gosh. If I could come here every single day for their truffle pasta, I'd be living my best life. Out of all the places I've dined at, Gilt Bar is the home of my favorite pasta in Chicago. It's just perfect. The atmosphere is what caught my attention before coming here for the first time. It's so dimly lit and romantic but still lively and inviting for larger groups. They even have a section in the middle with couches and low tables for groups. But I've only ever come here with my fiancé and we can't get enough of this place. <br><br>I always, always, always order the truffle pasta, it's a no brainer. The homemade pasta is so delicate and tender covered in savory truffle sauce. It's truly orgasmic. This time we started out with the delice de bourgogne, which is a creamy spreadable cheese. Again, just out of this world. I've tried to find a cheese similar to this basically everywhere... And I can't. It's a creamy cheese lover's dream. <br><br>You definitely want to make a reservation especially on a weekend. And I would recommend making it a couple weeks in advance as well. I've been here 4 times and have had exceptional service each and every time, never any issues or complaints about that.<br><br>Also, be sure to take a trip downstairs! They have a cute photo booth and also have a \"secret\" bar/restaurant down there but I'm pretty sure you need reservations there as well.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lMph6vYd725eyxcUaVlbkg/168s.jpg", "caption": "Truffle pasta - AMAZING."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KoKEXWXhErzOKZzrR7qjTg/168s.jpg", "caption": "Delice de bourgogne appetizer."}]}}, {"review": {"des": "Amazing food and drinks at Gilt Bar. For a late Friday night reservation, we were greeted with a fully packed bar where we ordered house cocktails before being seated. The lighting was dim and romantic through the restaurant and the low seating made the dining area feel more elevated.<br><br>Ordered the roasted garlic for an app before sharing the grilled pork belly and steamed mussels. The pork belly was fatty and cooked to perfection, and the mussels in the lemon vermouth broth were delicious. We may have been feeling ravenous and couldn't be bothered to wait before digging in; whether the reason, careful not to burn yourself on the fresh-out-of-the-oven garlic app like we did.<br><br>Will be back for that truffle pasta I keep reading about.", "pics": null}}, {"review": {"des": "Not sure how I feel about this place! It is cute inside, very romantically lit, but with pretty loud music. The service was just okay. The waitress we had was very impatient with us while we asked questions about many of the dishes to accommodate our dietary needs. She was condescending in her tone and very short in her responses. <br><br>You can buy alcohol there, but if you choose to bring a bottle of wine you either have to pay $50 for the corkage fee or be willing to share your own with other tables. We brought a bottle of wine and some of our wine was given to another table, but we were not reciprocated in having wine given to us. <br><br>The food overall we did enjoy though! There is also supposed to be a speakeasy there, which is supposed to be a cool spot for a drink!", "pics": null}}, {"review": {"des": "The food was super flavorful and well-portioned, not to mention reasonably priced. I'd definitely go back again! <br><br>The steak tartare was well seasoned, tender and a delightful consistency, with an egg yolk on top to mix in. Some flaky salt for texture and extra flavor, and lots of herbs mixed in with the raw meat. To dip, we had 4 extra crusty triangles of thick white bread and some creamy tangy white sauce, as well as some gherkins!<br><br>I also loved the orecchiette - it was just the right meat to fat ratio. A tad bit greasy, lots of earthy spice in the sausage.<br><br>The truffle bucatini was wonderfully creamy and flavorful!", "pics": null}}, {"review": {"des": "This place is busy! I went for dinner on a Saturday night, and we were told it was full so we had to wait for a little bit since we didn't have a reservation. Very intimate ambiance. With soft light and candles on the tables. <br><br>They had a collection of Old Fashioneds which I appreciated cause it has become one of my favorites cocktails. I had the Oaxacan Old Fashioned which is made with Mezcal. It was very strong and delicious with the classic smokey aftertaste that only Mezcal has. I felt this drink was little overpriced (13 bucks) - although it is downtown Chitown, so it was expected.<br><br>Food was ok. I tried the shaved prime rib sandwich with a side of French fries, mayo, and other sauces. It got really soggy after a few minutes, and it was hard to eat.<br><br>I also tried the fried chicken which was very crispy and well seasoned. It was nicely served over mashed potatoes. <br><br>I must say the servers were accommodating and attentive all the time. Our food came very promptly even though the place was busy.<br><br>On our way out I made, a quick stop at the restroom located in the basement. It looked like a little maze LOL nicely decorated with customers pictures that they take right there.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/G0CWAkp3-_RPoPDsfSI8cw/168s.jpg", "caption": "Fried Chicken"}]}}, {"review": {"des": "When I first reached the doors of Gilt Bar, I thought that I might have made a mistake and come when the restaurant was closed. The interior was so dark that it took a few minutes for my eyes to adjust when I stepped inside. The ambience is very classic: old fashioned but elegant decor, dim lighting, cozy seating. My friend and I didn't have a reservation, but the hostesses, who originally told us that it would be a 45 minute wait, managed to squeeze us in after only 15 minutes. It seemed like most tables were empty but reserved, so I would recommend making a reservation ahead of time.<br><br>The menu lists many cocktails that sound amazing, but I went the more classic route with one of their several Manhattan options. I was very satisfied with my drink, and I also tried my friend's Bees Knees cocktaul which was really good. The food was equally delicious. I ordered the arugula salad, which I surprisingly loved despite typically not being a fan of sweet dressings. I also ordered the truffle pasta because I had heard good things, and it lived up to expectations. My only qualm about dinner was that the portion sizes were quite small. I didn't leave hungry, but I am a petite woman. Overall, the meal was satisfying, and I'd be happy coming back for a date night.", "pics": null}}, {"review": {"des": "Awesome place to come have dinner! My boyfriend had a reservation here, but the place had a lot of empty tables. I figure you could just walk in without a reservation. <br><br>We ordered two different entrees, my boyfriend ordered the Grilled Farm Kitchen and I ordered the Slow Roasted Pork Belly with a side of smashed potatoes. <br><br>The Grilled Farm Chicken was definitely an A+. The chicken was tender and savory. The lemon taste was very subtle and blended perfectly with the juices of the chicken. <br><br>For a drink I ordered the whiskey sour! The service was definitely a 4 out of 5. It wasn't spectacular, but she did suggest the Grilled Farm Chicken which we ended up getting and it was such a great dish. <br><br>Although, we sat on a table we did see a few couches that are available for use as well. These couches would be perfect if you just wanted to drop in and have a drink.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ocCqDVqO2Kd9j9thRWsY6A/348s.jpg", "caption": "Grilled Farm Chicken $21.95 Chicken is delicious!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cGAgHpV_5Uu2kgoLGlzDeQ/168s.jpg", "caption": "Slow Roasted Pork Belly $17 Amazing dish!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kiAAPVivnA5D7xMKB5cPyQ/168s.jpg", "caption": "Whiskey Sour $13 Awesome!"}]}}, {"review": {"des": "After some trusted friends raved about having the best (non-fried) chicken at Gilt Bar, I found myself eager to cross it off of my Chicago restaurant bucket list. I liked some things but generally thought that it's just another overrated New American restaurant.<br><br>We had the following:<br>- tenderloin steak tartare -- huge portion, good but salty<br>- truffle pasta -- flavorful, rich, and perfectly al dente pasta; loved it<br>- grilled farm chicken -- the chicken looked like a piece of steak, very tender, but the lemon jus was not all that impressive aside from benefiting from a ton of butter.<br><br>I just think that there are more interesting restaurants for you to try and drop money on. Aside from food, I gotta say the ambiance was fantastic and the drinks phenomenal, so I have heard. So if those are important to your dining experience, do give Gilt Bar a try.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2VgivqW8GyQbwGkKFvMViA/348s.jpg", "caption": "tenderloin steak tartare"}]}}, {"review": {"des": "I wish I could live here. <br><br>My boyfriend and I made reservations for Friday night at 6:45pm (I highly recommend making reservations). We got there right on time, the hostess checked us in and said it would be a few minutes. The place was packed so we got a drink at the bar and waited. A half hour went by, we asked how much longer and they 100% forgot about us but they sat us right away. <br><br>The server and the service were very fast. For a place on an hour and 15 minute wait the food service did not lack in the slightest. The food came out so quickly and it was spectacular! <br><br>The decor is so interesting and romantic and the hallway to the bathrooms is soooo cool. <br><br>Also, the chartreuse mule was everything!!!! I will go back just for that drink because, girl, they got that so right in every way.", "pics": null}}, {"review": {"des": "We have eaten at Gilt Bar before and enjoyed it, so we were a little disappointed in our experience last Thursday night. We showed up without a reservation, and were told there would be ~an hour wait, and we would receive a text when the table was ready. We agreed, and went to wait at another place in the area. <br><br>An hour later we received the text and figured everything was good to go, so made our way back over to Gilt Bar. Once we came back in, the hostess told us the table was being bussed and it should be ready in a couple of minutes; sounds great. We then proceed to stand waiting for an additional twenty five minutes, without being acknowledged/given an update/any eye contact. It wasn't until we asked if there was a problem that we were seated at a table that had been open since we arrived back in the restaurant. We weren't ever given an explanation or an apology.<br><br>The food itself was still tasty (although I would advise against the lobster roll, inconsistent seasoning and just bland). But it seemed as if we were being rushed out (despite the time being 9PM after our wait), as wait staff attempted to take unfinished drinks/food multiple times. <br><br>When we had finished our food, our waitress dropped a fork while clearing our plates that ended up shattering a water glass and sending shards everywhere. We still had full cocktails on our table in the line of fire that we could no longer safely drink. There was no offer of bringing another drink or water glass, we were just given the check. <br><br>Overall, a pretty uncomfortable and rushed experience. I don't think we'll be coming back, which is disappointing because the fried chicken and bone marrow were truly very good, and the beverages we were able to drink were nicely mixed.", "pics": null}}, {"review": {"des": "If you're dining on a Friday, make a reservation! We failed to do so and had to wait for about an hour and a half. I was adamant about dining at this spot because it looked so cool on yelp! Unfortunately we were seated right by the door at the smallest awkwardest and awkwardly placed circle table I've ever seen. Seriously, that table shouldn't exist. I was actually hit in the shoulder a few times by the busboy because of the inconvenient location. Also was cold from the draft from the front entrance. I didn't get to experience the decor and vibe of the place because of where we were seated but I'm guessing that's because we didn't have a reservation. <br><br>The cocktails we ordered were great. From a true and fresh New Orleanian the Sazerac was A-1. My martini was also great<br><br>We ordered some chicken dish that was ok and I ordered the pork belly and grits which was AWESOME seriously saved the night lol. The jalapeño cornbread is also fire. <br><br>I don't remember our waitstaff experience. It was normal and short. I don't think we'll be back but we may order the cornbread to-go lol.", "pics": null}}, {"review": {"des": "This is the ultimate date spot. Dark intimate setting with music that gives romantic vibes. <br><br>I had the Truffle Pasta which has an immense umami truffle taste - recommend big time. Also tried the Tenderloin Bolognese which was also wonderful.<br><br>This is one of the few places that takes time and effort to carefully and properly construct their cocktails. 5 stars all the way", "pics": null}}, {"review": {"des": "I liked this place a lot. We only did drinks here but waitservice was great, the atmosphere was dark and speakeasy-esque, and they seated us right away on a busy Saturday night, with a group of 6 or 7 people.<br><br>I had a Pimm's Cup which I haven't had since I visited England in 2009. Super tasty. We ordered bread for the table and that was good too albeit slightly burnt. We added people as they showed up (friends obviously ha) and the waitress was cool with it.<br><br>Originally we wanted to go to the Library (speakeasy in the basement) and a friend called to see if they take reservations and they said no... But they do, apparently. Also even if you don't have to use the restroom, go downstairs and see the other doors... It's very Alice in Wonderland esque which was funny.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DfqsjzDz9z1wBa2dSCHE5w/168s.jpg", "caption": "Interior"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UPRyTImg95sjeubSnhygBg/168s.jpg", "caption": "Interior"}]}}, {"review": {"des": "For over a year now, I have literally tried to guilt-trip my fiancé in coming to the Gilt Bar with me.  Finally, I was able to reel him into my trap and he caved in, agreeing to take me to this restaurant that I have had my eye on for so long.  I had really high expectations for this restaurant, and so even before walking in, I had hyped myself up.  I should have learned by now that I should not hype myself up to such a high point because then I almost always get let down.  This is what happened, and I legitimately felt guilty for not falling in love with the Gilt Bar like many of its other patrons obviously have.<br><br>Although we walked in and were greeted with friendly smiles and pretty good service, I didn't get that urge of excitement that I had expected.  We were told that we would have to wait for a while unless we wanted to sit at the table right by the door; being a hungry as we were, we decided to accept that seat.  I feel like if I had waited for a different seat, I would have been able to appreciate the atmosphere much more; as it was, I was constantly distracted by people coming in and out, and I kept getting hints of the cold weather.  As I looked around, though, I liked the way the restaurant was set up; my only complaint is that it was sooooo dark in there.  I appreciate ambience in restaurants, but it was a little too dark.  I almost had to become the old people that my fiancé and I scoff at who break out their phones to shining light on the menus.  <br><br>Despite how dark it was, we were able to make out the menu just enough to order some drinks.  I got the Bees Knees while my fiancé ordered the Rob Roy Manhattan - he loved his and though I like mine, I was a little less enamored with it.  Don't get me wrong - I did really like it, especially with the real honey that was infused into it; it just wasn't in the top 10 of favorite cocktails.  The orecchiette was a different story;  this is the one dish that I have seen in pictures and absolutely drooled over.  When I finally tasted it, my taste buds went crazy for it!  It was even better than it looked in thus pictures - it was an adequate amount, but for the price, I guess I was hoping for just a little more!  In addition to the orecchiette, we also got the brownie and ice cream dessert - it was good, but notbing exceptional.<br><br>I found everything to be more expensive than it had to be and though I absolutely loved my main dish, the drinks and dessert were a little less exciting.  I suppose that you are paying for some of the prime real estate that this place takes up...with that being said, it is conveniently located next to the brown line.  Overall, I would give this place a 3.5.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/W5P1SvZcJpLfjX_91kc7DQ/168s.jpg", "caption": "Brownies with vanilla ice cream"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rmMiGtN8q5KvkgfzIqIJng/168s.jpg", "caption": "The orchiette"}]}}, {"review": {"des": "You definitely need a reservation for this place. On a Friday night at 6:30, this place was packed. It's really dark and the music is loud, so don't have any important conversations here. It's River North, so food and drinks are on the pricier side. <br><br>I had the pan roasted white fish, which honestly could've passed for deep fried. I was in the mood for something healthier that night, so this wasn't my favorite. Also, it's literally a chunk of fish on a plate with no other flavors, so I got sick of it real fast.<br><br>My friend ordered the shaved prime rib sandwich, which came with fries! These were honestly the highlight of the dinner, and they went SO well with the sauce from my dish. I had a bite of the sandwich and that was easily more moist and flavorful than my fish. Portions were both on the smaller end for what we were paying.<br><br>Definitely a hip Chicago spot for \"New American\" food, but if you want something less pricey and more flavorful, there are other places in River North that will hit the spot.", "pics": null}}, {"review": {"des": "I came to Gilt Bar with my boyfriend for my birthday and it was the best birthday dinner experience. My boyfriend included that it was my birthday in the reservation. When we walked in and gave our name they immediately wished me a happy birthday, which I thought was very sweet. <br><br>We ordered the Roasted Garlic appetizer and a flatbread special. The flatbread had brussel sprouts, broccoli, parmesan, and lemon zest. It was one of my favorite things we ordered. It was so flavorful! <br><br>For dinner we ordered the Truffle Pasta and the Grilled Farm Chicken. The Chicken was my other favorite thing that we ordered. Not only was it very flavorful but it was the juiciest chicken I'd ever eaten! <br><br>For dessert I had a chocolate martini and the cookie skillet, which came to the table with a sparkler for my birthday! Both dessert items were decadent and delicious. <br><br>In addition to the food, the atmosphere was very enjoyable. It's a low lighting atmosphere with an old fashioned vibe. The service was also wonderful. Everyone was very accommodating and friendly! <br><br>Some other notable things, they had complimentary coat check which is very nice. They also have a fun photo booth downstairs by the bathroom. You can keep your strip or pin it on the wall amongst hundreds of other photo strips. <br><br>I would highly recommend gilt to anyone!!", "pics": null}}, {"review": {"des": "Gilt Bar is my friend Maddie's favorite restaurant in the city, and I can see why. She introduced a group of us to Gilt Bar and we had an amazing dinner here.<br><br>If you're looking for a romantic spot, this is the place. It's perfect for date night, group gatherings, or taking guests from out of town. Whatever the occasion, Gilt Bar is upscale, classy, and intimate. The ambiance has dim lighting and their service is attentive.<br><br>The restaurant is also conveniently located, right off the Merchandise Mart CTA. In the basement, \"The Library\" bar is an even more sleek place to grab drinks/cocktails. It's beautiful and feels like a speak-easy, a spot they purposefully make not crowded. (Side note: Get your reservations in for The Library ahead of time!)<br><br>I've ordered the bone marrow each time I've come here. It is SO delicious. You can ask your server for additional pieces of bread, because you'll want clean off your plate and soak in every last bite. I will continue to order this each time I come back.<br><br>Also order the steak tartare, the Brussels sprouts, the rib eye, their burger. You cannot go wrong with these items. Their meat and steaks are cooked to perfection. Their truffle pasta is dreamy.<br><br>I've attempted to order dessert several times but keep making the mistake of not leaving enough room. Their cake/pie slices are so tall, decorated, and generously portioned that they turn heads.<br><br>Literally, as a server walks by with a slice of carrot cake or lemon meringue you will follow it with your eyes until it's placed on someone else's table. So save room :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/J_-fphwnkRXJ9kIYtLoXPw/348s.jpg", "caption": "Let it glow"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fZwCTlZiAuy9f_hEy3_hHA/168s.jpg", "caption": "Truffle pasta and charred green beans"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IGGwOdGI2HC_4UL8w7dqXQ/168s.jpg", "caption": "Ricotta Gnocchi"}]}}, {"review": {"des": "If you're seeking out the perfect spot for date night, look no further than Gilt Bar. I had the lovely opportunity to visit this restaurant/bar on Valentine's Day. The restaurant ambiance is a magnificent blend of modern urban paired with old world Victorian décor. When both design elements are added to a dimly lit environment, it makes for an ideal prelude to a romantic evening.<br><br>The menu isn't extensive but the offerings are solid. For appetizers, we had the bone marrow on toast with red onion jam. The enormous portion was enough to satisfy 3 people. I never had bone marrow until then and post meal, I liked it a lot. I'm not a professional food critic but my unrefined description of bone marrow is similar to a meaty butter spread. The red onion jam adds a tartness and texture to this dish which is phenomenal. I've never had anything like it before and I'm glad I got a chance to try it.<br><br>The real star of the show was their smoked whitefish Caesar salad. It has the flavor you would expect from a Caesar salad with a few unexpected surprises. Instead of croutons, there is a crunch from the potato chips. Yes, you heard that right, I said potato chips. This crisp flavor profile is paired with an unusual protein (the smoked whitefish). The smoky flavor from the whitefish gives off a distinct taste making your traditional Caesar salad better on so many levels. I know it's just a salad, but it's a salad worth ordering.  <br><br>The Ribeye, as expected, was deliciously juicy, well-seasoned, and meaty. The garlic mashed potatoes were okay but it wasn't a standout. Overall, our main dish and side was enjoyable.  <br><br>It's best to make reservations so we made them in advance to guarantee a table. I've read in prior reviews that on some nights, this can be a challenge. We didn't want to take that risk. <br><br>From start to finish, husband and I savored each sip and bite. I highly recommend Gilt Bar for a night out in the city.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sJKpsZgdTs_gIKOdikotWA/348s.jpg", "caption": "Left: Sazerac. Right: Vodka Daisy."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mVxQQFngIQLqdQlJ6Nhhtw/168s.jpg", "caption": "Close up of Roasted Bone Marrow with Red Onion Jam over toast."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mPODHLNVO59G0cWhjGLGEw/168s.jpg", "caption": "My first bite of Roasted Bone Marrow over toast. Pretty good! Red onion jam goes well with it."}]}}, {"review": {"des": "My boyfriend and I were in the area and decided to come here on a Friday night. I definitely recommend making a reservation. We were in no rush, so we waited approximately 45 minutes for a table. In the meantime, we tried a few of their drinks. The bee's knees and dark and stormy mule were delicious. Really good cocktails overall.<br><br>Roasted bone marrow with red onion jam and parsley: The concept is similar to the bone marrow at Longman and Eagle. The difference is that the bone marrow portion is huge.<br><br>16 oz prime ribeye: A beautifully fatty, and ginormous cut of meat that was perfectly cooked and seasoned for an insanely reasonable price. It came with an herb-y salt on the side that you could add to the dish that was also really flavorful<br><br>Steamed Mussels with lemon vermouth broth and thyme: The mussels were well cleaned, and cooked perfectly. The sauce was the star of the dish. I was full by the time I was halfway done, but couldn't help but keep dipping the accompanying bread in that heavenly sauce to eat. Oddly enough, when we said we wanted to take the remainder to go- the waiter told us that he could not package it for us since it was a seafood dish. We ended up finishing the mussels but the frugal side of me wished that I could have kept that sauce.<br><br>I was a lot more impressed by Gilt bar than I thought I would be. The service here is very friendly. The food portions are unexpectedly large. The food is well seasoned and very hearty. The price is marginally more than an average meal, but definitely worth it. I only wish the interior was just a bit brighter.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/I0mBJyzCvVMNLxBs3ztPMw/168s.jpg", "caption": "Roasted Bone Marrow , Red Onion Jam"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uMIoaydJuB0mw86UDun4GQ/168s.jpg", "caption": "Bee 's Knees"}]}}, {"review": {"des": "For years I have heard that this is the place to hit up for a good drink and even some decent food. I have walked in a couple times over the years usually on a Thursday or Friday after work and the place was jam packed. <br><br>Recently a friend told me we should go over after work on a Wednesday. Was a good idea as we were the 3rd and 4th people to walk inside right @ 5pm. Very dim on the inside which is fine with me of course. We grabbed seats at the bar and another friend joined us. I got the Perfect Manhattan which was awesome and pretty strong...no complaints! I then went with the Spanish Old Fashioned which included Ritterhouse rye, coffee bitters and sherry...very good!<br><br>Great place to take a lovely date or drinks with friends...I definitely plan on returning here as I love the atmosphere as well as the drinks.", "pics": null}}, {"review": {"des": "When is a 'reservation' not a reservation?  This was like an extra rude version of the Seinfeld reservation episode.  They take reservations, but don't honor them when you arrive.  What in the he** are they taking reservations for?  Rude...unhelpful...a morally bankrupt business.  Don't bother. There are much better cocktail bars in the city, who actually like their customers.", "pics": null}}, {"review": {"des": "My first trip to Chicago and I felt to incredibly lucky to visit Gilt Bar the last night before its upcoming renovations! This bar is everything you could imagine for an intimate and vintage venue for downtown Chicago. <br><br>As it was a Saturday night, it was very busy, but we were lucky enough to find two seats at the bar! They had really fun drinks and the bartender was very nice. As busy as they were, you could tell everyone was hustling and we never had to wait long for drinks or food. It is loud and fun, and every brief encounter with either a customer or server was great.<br><br>We didn't order too much, which we completely regret now! We shared the truffle pasta because of all the many yelp reviews before - and oh my goodness... My husband and I were so impressed with the rich and delicious flavors in this pasta dish! Usually, my husband will gulp down all of his food. He definitely took the time to enjoy every bite of this dish. <br><br>We enjoyed it so much we wanted to visit again (2 day trip); however learned that they were closing temporarily for renovations (they mentioned 2 wks). Yes, we were saddened by the news but also so grateful for running into this place and getting to experience it! We will be back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zrQH4c2SGPSfXpC6yMgtrQ/348s.jpg", "caption": "Truffle Pasta, what everyone has said already - INCREDIBLE!!! We almost ordered seconds!"}]}}, {"review": {"des": "Definitely got that sexy, dimly lit date night spot ambiance to it. I've dined and just drank at the bar here several times. It's one of the first places that whipped up an egg white whiskey sour - a combination I had never forgotten when other places did it.<br><br>So yea, the bar never failed me. Always good. Admittedly, I haven't eaten there as often as I did drink but it is very solid food. I've eaten the steak there for sure and they executed it right. And I do really like the ambiance to it when dining.", "pics": null}}, {"review": {"des": "Came here for a get together with friends and had a great time. While this place seems to be worried about the electric bill, the lightbulbs probably were all 12 watts, the service, drinks and food were on point!<br>*Our server Tom was attentive and gave us great recommendations. - 5 stars<br>*Drinks: the Chartreuse Mule was so good and after two I was feeling REAL good! - 5 stars<br>*Slow Roasted Meatballs: big enough for two people to share and tasted delicious. - 4 stars<br>*BBQ Pork Ribs: holy hell there were amazing. Tasted so damn good. -5 star<br><br>I'll definitely be back to Gilt Bar!", "pics": null}}, {"review": {"des": "Amazing food and ambiance. Had the orrechiette with pork. Service was excellent. The real treat was after dinner going downstairs to the library. I would recommend having dinner down there. Very nice speakeasy with some amazing cocktails", "pics": null}}, {"review": {"des": "Can get pretty loud, but this is a good place for a date, happy hour, or hanging out with friends. <br><br>I got the burrata toast and burger, which came with fries. Both items were fairly priced and tasted just a bit better than your average burrata appetizer / burger. My friend ordered a simple salad and also enjoyed that. Wasn't super amazing so not sure why this place has a ton of stellar reviews, but it probably just means I need to come back and try the bone marrow.<br><br>The table wine is cheap at only $5 and we spent about 2-3 hours here, so definitely a good spot for catching up over dinner.", "pics": null}}, {"review": {"des": "We can in for some late night bites after a gala. Super happy an actual sit down place was open late and was still serving their full menu. Our server was prompt and the food was good but not particularly memorable. The one menu item I DEFINITELY remember is the poutine but I am a crazy person for poutine. <br><br>This was one of the best poutines I have ever had. Overall the ambiance of the place was pretty cool. My drinks were super good and the company I was with enjoyed it as well. <br><br>A great late night sit-down dinner place in the city. Check it out!", "pics": null}}, {"review": {"des": "Excellent spot to take your significant other or family & friend. Great ambiance and the food . The lighting is dimmed out which is a cool concept. We ordered Truffle pasta, Orecchiette, Bacon Cheeseburger and Grilled farm chicken for the 4 of us. The Truffle pasta is highly recommended, even if you are not a pasta person you would love it ( olive oil and Parmesan... yummy). The burger had great flavor and texture which was a favorite. The fries with garlic sauce on the side OMG..  The place was packed since it was a Saturday night so make sure you reserve in advance or expect a wait. After the meal our friends took us underground which had a photo booth with thousands of pictures pinned on to the wall which was super cool. A must to check out when you guys visit and they have a small cozy private event spot downstairs if you want to through a party or have a private dinner which I thought was a great addition. <br><br>Overall we had a great time and food made our experience even better. If in the neighborhood a spot to definitely check out.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/01tnFf_5wOtfb0agcQuxaA/348s.jpg", "caption": "Bacon  Cheeseburger"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ppSloAOxRfqCBUVdr5UF8w/168s.jpg", "caption": "Truffle pasta"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VuX2t35rl-hhqdx8fDlxKA/168s.jpg", "caption": "Grilled farm chicken"}]}}, {"review": {"des": "Another awesome restaurant from the ownership group that has several other amazing restaurants around town. I've been here twice and loved it each time. One of the best places in town, I'd go back right now as I write this if I could!<br><br>Their pasta is what I get, it's very high quality and is on par with the pasta I had in Italy. Lot of flavor, very fresh, and the pasta dishes come together nicely. The smashed potatoes with chicken jus is the best mashed potatoes I've ever had, truly addicting. They have other entrees for seafood and other meat, very nice menu here and you should love it!<br><br>Plan ahead for this one, it's not a easy table to get. When you try their food you will see why, make sure to check them out if you can. They will for sure leave a lasting impression on you.", "pics": null}}, {"review": {"des": "Wow!  Was this food great!  <br>Visiting from Tampa and my daughters had this restaurant on their bucket list. So happy we decided on going here. <br>It would be an amazing date night place with nice romantic lighting. <br>The roasted garlic on bread to start, delicious. <br>I shared the pork belly and grits with one of my daughters and she shared her truffle pasta. Both were outstanding!  So delicious. The vegetarian daughter had the Ricotta Gnocchi.  Also rave reviews!  <br>Basically it seems you can't go wrong here, 3 out of 3 people super happy with their meal. <br>It was a Monday evening. We were seated quickly with no reservation. Great waitress and food came quickly. <br>Also loved my French 75 cocktail. Refreshing with a little sour kick. Yum.", "pics": null}}, {"review": {"des": "I really enjoyed the truffle pasta, it was the best truffle dish I have ever had. Definitely didn't go lightly on the truffles, and not too overpowering. I had Brussels sprouts on the side and it was also very delicious . My husband ordered the gnocchi which was really nice in texture and flavorful. We enjoyed our experience and dishes and would definitely come back.", "pics": null}}, {"review": {"des": "Came here with my team for after work dinner. Food was lovely...truffled Pasta was our favorite. Yummy cocktails and wine. Only challenge was how dark it was. Love the concept of low lighting, but could use a smidge more light!", "pics": null}}, {"review": {"des": "A very nice bar. It's elegant so a l ot of people dress up, if you dress casual like I did and don't mind some occasional stares if you dress casual, then you'll be fine. The library are A is nice. Very upscale bar and good customer service! Try at least once to visit, very nice bar and quiet setting.", "pics": null}}, {"review": {"des": "We had a great dinner at Gilt Bar. I was surprised to see they have an individual vegetarian menu, which was an added plus (it includes all the vegetarian items from the regular menu). The ambiance is romantic, they have seating downstairs as well with another bar, and there's a photo boot in the hallway downstairs.<br><br>We started with the burrata, fresh tasting and ample size served with tomatoes, basil, olive oil, and bread. Our waitress said the burrata flown it from Italy weekly. We then had the truffle pasta which was great and definitely had hits of truffle taste in it. The cocktails were good as well with ample variety. <br><br>Overall a great meal, and definitely vegetarian friendly!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OxQmZg1fJIcCdhDEOmAq0g/348s.jpg", "caption": "Burrata"}]}}, {"review": {"des": "Giving a four star ONLY because I didn't try the food. I had eaten at Pink Taco before visiting here. I had come for the Library...but it won't be open until Thursday ....sigh.. no info regarding this on website.<br>Comprehensive selection of malt and rye liquors. Good selection of draft beers...not international selection but seems fairly local.<br>So.... to ambiance. Host staff are friendly. Bar staff are a bit mixed... prompt, attractive and \"of their time.\" Tats with H&M dresses, Clientele...relaxed.. successful millennials. On my next visit... The library!!!.... recently renovated....vituals and libations...next time", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RunkiwlwWWQC-xEHda8fWA/168s.jpg", "caption": "This is a popular beating place with high end touches but comfortable seating."}]}}, {"review": {"des": "We decided to head to Gilt just for drinks. The environment feels lime a casual night club. The dark lighting, candles, and black leather comfortable seats on the sides of the restaurant give the restaurant a mystical and spicy atmosphere. Our waitress was very kind and knowledgeable on numerous of drinks to help us choose what best fits our taste pallets. Drink were delicious! I'll definitely be coming back to try their food!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0xogGTvotOV49YE30BTGQQ/348s.jpg", "caption": "Pimm 's Cup"}]}}, {"review": {"des": "I bookmarked them from friends reviews and while down here I decided to hop in since they're open late. SOOOOOO GLAD I DID!!!!<br><br>Things started off rocky! We were seated promptly, but we didn't get a server for 20mins. How is this possible??? Side eye... There were waitresses everywhere and nobody came to assist us or ask did we need anything. Growing angry I went back to the hostess and asked what's up for service for this table? They apologized and said they'd get us served. We got a male server who was very apologetic that we hadn't been greeted and he said he saw us being seated so he knows we've been waiting. Ok cool thanks for the acknowledgement and not sweeping it under the rug!<br><br>On to the food.... we ordered the ribeye med, and also the pasta dish w/spicy pork no way on hell I can spell it Orecchiato or some crap lol. Also ordered drinks, I see they use gin in everything. I got the French 75. The drinks were sourly good. My steak was so damn good I want to go back TODAY!!!!!! I had almost given up on ribeyes due to them being fatty and not being edible. Not here! This steak was good the table next to me waited for me to dig in to see my reaction to the taste and dammit it was heaven on earth!!!! <br><br>The server brought me a slice of lemon meringue pie due yo their earlier screw up. Unfortunately, they didn't have mashed potatoes and were almost out of steaks. I will be back down here sooner than later!!!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zfxGufGVT-7Gh7ZxbW5XMQ/348s.jpg", "caption": "DELICIOUS ribeye!!!!!"}]}}, {"review": {"des": "I have only wonderful things to say about this bar. I've been here several times over the last 6 years and each time was perfect. <br><br>The servers are attentive and informative and kind. The drinks and food are delicious. I had the chance to meet the maître d this Saturday night and she was fabulous and a hero for squeezing in our group for a friends birthday. <br><br>This is a great spot for a date, birthday, anniversary etc.", "pics": null}}, {"review": {"des": "Was here earlier once for a birthday party but dint really notice anything.This time was with my Date as she was more inclined towards this spot and thought it was really a good place . We were here around 9.30pm after dinner and the place is Jam packed. <br><br>We had to wait 25mins to get a space in the Underground bar.Good thing is they take the names and text when space is available.This place is dark with few lights hence guess there is nothing to describe about ambience as no one seems to really care about it initially as it is packed full house but the way to underground bar passes through wall full of pictures clicked from Photo Booth ($3). The underground bar can accommodate like 20-30 people including bar counter.<br><br>Pros:<br>Quick Service<br>Clean restrooms<br>Ambience (According to lot of people)<br><br>Well I'm not a great fan of this place but I guess you guys still can give it a shot . Who knows you may like it.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pXGvOpE2Q7xOxmHJU6PNfA/348s.jpg", "caption": "Photo Booth. You can send it to your email. $3 for 2 strips but only 3 shots"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FRl0e1cKtKyJUsMfrZ9KjQ/168s.jpg", "caption": "Way to Underground bar"}]}}, {"review": {"des": "Holy mother of god. I came for a good drink and left with a beautiful girlfriend, a full stomach of insane flavors and a best friend/waiter Carl. He's a good dude. <br>I haven't had a better truffle noodle deliciousness than this. Hands down mind blown. <br>The shaved prime rib...forget about it. And that's almost a side dish to how incredible the fries are. So here's the breakdown. <br>I order a gin martini (hendicks of course)<br>Then I want more (duh)<br>Me: Carl is this old fashioned tequila or mezcal forward. <br>Carl: balanced<br>Me: can u unbalance and make it more Smokey<br>Carl: so all mezcal<br>Me: yes<br>Carl: hell yes <br>Me: fist pump<br>Carl: double fist pump<br>Me: did we just become best friends?<br>Carl: yes<br>Me: do you want to go do karate in the garage?<br>Carl: how'd you know. <br><br>....end of story. You better get here already.", "pics": null}}, {"review": {"des": "Gilt Bar was delicious from start to finish with great service. I had to make weekend reservations two weeks in advance to even get in at a decent time. This is definitely a hot spot! <br><br>The ambiance was absolutely perfect for date night, but it is VERY dark inside, so if it isn't date night you may not be feeling the low lighting. We got on the list for the speakeasy style portion of the restaurant in the basement when we checked in (quoted about an hour and a half wait - they do not take reservations for the Library ahead of time - it is a first come first served list when you arrive), so we were able to check out and have our dessert down there. It was very cool! Worth seeing for sure, but even more dimly lit than the main dining area (one woman was shining her phone flashlight to read the menu). <br><br>Food was really something special and arrived at the table quickly. Many handmade ingredients, au Cheval burger, and the menu has unique as well as traditional menu options. I recommend the warm brownies with salted caramel ice cream for dessert. My husband had a whisky mule, and said it was the best he's ever had. <br><br>Staff was friendly!", "pics": null}}, {"review": {"des": "One word; obsessed!! I really hesitate going to fancier/aesthetically pleasing places for dinner, because.. well, they usually suck. But this place! Here's what we got and loved. Just a disclaimer, the entrees deff took a little bit longer to come out compared to standard dinner high-time, but because it was delicious, so I won't deduct a star. <br><br>Here we go!<br><br>1. Cornbread with honey butter<br>2. Mashed potatoes with a garlic gravy <br>3. Beef tartar with a soft fried egg and toasted crusty bread<br>4. Arugula salad with parmesan and grapes<br>5. Gnocchi filled with ricotta and scattered grilled squash<br>6. 18 oz ribeye med-well <br>7. Truffle pasta<br>8. Grilled juicy farm chicken <br>9. Chocolate pie<br><br>Not a single item was less than a 10, per seasoning, flavor and display content!", "pics": null}}, {"review": {"des": "This is one of my favorite spots in River North! Far more chill than others in the area. Great food and cocktails. Beautiful decor. Expensive, it's River North. Decent service. Go with friends or a date!", "pics": null}}, {"review": {"des": "Stopped here before a show at the Goodman on a Friday night. Mixed crowd, 30ish I would say. Hot summer day, a Negroni hit the spot and the foie gras appetizer, so rich and creamy, got us through the show until we could have dinner after. They have a mix of outdoor seating, tables and couches inside. Nice place to relax and start the weekend.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DreVS1GsIhbl09CEo1CcfA/168s.jpg", "caption": "Negroni, perfect for a summer day"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9RIbp3OnZDMy-NHOOB13Xw/168s.jpg", "caption": "Foie Gras & Pork Liver Mousse"}]}}, {"review": {"des": "I followed my heart and it lead me to Gilt bar. A friend of mine decided to go out and celebrate my engagement. I absolutely fell in love with the portion of the restaurant called the library. I told my fiancé I was going to dinner with a friend but he didn't ask me what restaurant I was going to until I was parking my car to walk into Gilt. He tells me that his uncle, Charlie, was responsible for the remodeling and part construction of Gilt and to say hello to the owner (R) on his behalf and since I loved the design of Gilt to inquire about the other restaurants owned by this family. Isn't it crazy how small the world is? I had no idea. Anyways, my friend had gotten to Gilt before me and she had put our names down on the wait list and one of the hostesses told her that it would be anywhere from a half an hot wait to an hour and fifteen but just to keep an eye out on her phone when she gets the text confirmation that her table is ready. Anyways, when I walked in, I guess the hostess didn't realize that I was with my friend Alex and so I said to her is the owner here and she said no unfortunately R isn't here tonight and then she said I'll see if I can get a table for you earlier and again took our names down. We decided to get a drink (me Non-alcoholic and my friend a gin and honey) while we waited for our glorious text. Once we figured out the library was downstairs, we asked the hostess, Keira, if we could be seated in the library and she said, \"oh it's a four hour wait for the library, not tonight ladies\".... not gonna lie, I was sad to hear it. <br><br>We finally got our text and approached Keira and even before we told her we got a text, she says, \"oh I'm not ready for you\" and my friend pulled out her phone and said, \"that's okay, someone else is because we got a text\" - Keira or Kyra with the headband looked dumbfounded how we got seated so quickly after being on the wait list for about 25 minutes. To make matters worse for Keira, IMAGINE OUR SHOCK when a super nice hostess says to my friend and me, \"follow me downstairs ladies\" and my friend and I look at each other and were like wait, \"downstairs?\" And she says, \"the library\". I wanted to bust out my happy dance. This super nice server had no idea that we had inquired about seating in the library!! <br><br>What a fiasco with the hostesses. The usually tell you a much longer wait time than how long you'll actually wait. So don't be scared away by the wait. Despite all the issues with getting a seat, my friend and I were besides ourselves from joy. After we were seated, we ordered the Burrata. It was my first time having Burrata so I didn't know what to expect. The waiter told us its a combo mozzarella and cream cheese. If you ask me, it could have used some salt because it tasted a bit bland. However, paired with the fire roasted tomatoes- Lord have MERCY!! It was absolutely incredible! I could have eaten the tomatoes all night long. First of all, they had that freshly picked tomato smell that I rarely come across in the US. Secondly, they were sweet and marinated so they really complimented the Burrata along with the bread so well. Gilt won me over the moment I saw the very well toasted bread- thank you Gilt!! <br><br>As for our main dish, I ordered the roasted salmon and my friend had the ricotta gnocchi and we had a side of the mashed potatoes. The salmon itself was melt in your mouth goodness, it was juicy yet really well cooked. It was slightly crispy on the outside which I didn't complain about because I love that. I really didn't like the capers served with the fish because it was too sour and salty for my liking!! Thank goodness for the mashed potatoes because they really complimented the fish. The mashed potatoes had chicken jus, roasted garlic and chives. The chicken jus was usual to see but really tasty. I'm not a mashed potato type of girl but these mashed potatoes were divine. Let's talk about the gnocchi. Wow. The waiter told us it was house made and let me just tell you, homie was not lying!! If you've ever made any type of bread or pasta at home, then you know how the dough of that feels on your hand... soft on texture, light on your skin and plump in size. Well, the gnocchi tasted like that and some. The ricotta cheese inside was sort of fluffy but not really but smooth. Paired with the butternut squash, this was fine dining at its best! It was soooo smooth to eat- I've never tasted anything like it! I highly recommend it!<br><br>Overall, service was okay. The food took a while to come out and the waiter wasn't as attentive as I would have liked him to be but I understand, happens on Friday's! The place is super clean but also really dimly lit so that you could barely read the menu without turning on your iPhone flash.  This place has a certain ambiance that makes you feel like you stepped into the mobster scene back in the 1920's. I absolutely love the atmosphere. Good date night place as the warm environment paves the way for romance!", "pics": null}}, {"review": {"des": "Visiting Chicago for our 20th wedding anniversary. My husband loves craft cocktails so after searching Yelp I found this place because it boasted good cocktails and good food. IT DID NOT DISAPPOINT!  They welcomed us in and wished us a happy anniversary and took us down to the speakeasy...which is awesome!<br><br>We ordered the steak tartare, double-cut, coal-fired ribeye with smashed potatoes and lobster roll. Everything, including service was top-notch. Thanks for a special night!", "pics": null}}, {"review": {"des": "My boyfriend and I were visiting Chicago and planned our date night at Gilt Bar on Sunday evening. You enter through a revolving door and are greeted with a sensual interior with leather couches, dim lighting and a bar to your right. The hostess was extremely friendly. She asked what brought us to guilt bar and even remembered my name throughout the night. We made reservations for 7pm and were seated promptly. <br><br>The place was pretty packed for a Sunday night and the ambiance was excellent. A definite suggestion for a romantic date night or a special occasion.<br><br>The service was pretty good. Our waiter let us take our time and gave us some suggestions for dinner. To start, we ordered the Slow Roasted Meatball, Skillet Cornbread and for our entrees, my boyfriend ordered the Ribeye and I ordered the Orecciette.<br><br>The Meatball was definitely my favorite part of the meal. It came with three pieces of garlic bread and a giant meatball with tomato sauce. The meatball melted in your mouth and the garlic bread was an excellent edition to dip into the sauce.<br><br>My boyfriend really enjoyed his Ribeye and ate the entire thing (it was 19oz)! My Orecciette was okay as it was extremely salty. The cornbread was okay too, nothing too mind blowing. I did like how it came with jalapeño & honey button, a nice touch!<br><br>Neither of us had any room for dessert but decided to try and have a bit more! We shared a cookie skillet with vanilla ice cream and it was also okay. The cookie was very uncooked, almost like raw cookie dough. <br><br>Also, there's a photo booth downstairs on your way to the restrooms! Make sure to stop by, take a couple pictures and pin them to the wall (they take credit cards).<br><br>The food was a 3.5/5 but the service and ambiance was a 5/5! I'd definitely recommend visiting if you're in town or looking for a special night out. I heard the Truffle Pasta was excellent so I'll be trying that next time I'm in the area!", "pics": null}}, {"review": {"des": "The hostess was extremely accommodating; our reservation did not make it through the system but she made sure to find a spot for us and was extremely kind - beyond the call of duty! The food was delicious - the burata is worth trying as an appetizer for sure. We shared three dishes and a salad between four people and it was the perfect amount of food - no leftovers. There are less than ten outdoor tables and sitting outdoors is a different experience to the intimate ambiance of the inside. It is very dimly lit and romantic inside. A great dinner spot in river north!", "pics": null}}, {"review": {"des": "We made a reservation via open table for 8:15 on a Sunday. We decided we were too hungry to wait until then so we walked over around 7 to see if we could snag the table early. The place wasn't too packed on a Sunday night so we were able to score a cozy little corner booth! <br><br>Service was phenomenal. Our waiter was very attentive and on top of it all night. The little details like switching out all our utensils after the appetizer didn't go unnoticed! We started with the roasted garlic starter that came out with fresh bread. <br><br>I ordered the truffle pasta and my husband ordered the short rib stroganoff. Both dishes were excellent. His short rib was cooked very well and I caught myself sneaking a few bite of it! My truffle pasta was pretty good, I love anything truffle. I appreciated the portion sizes they served as any more and it would've been too much. The dish was extremely rich- all the butter and oil. I wish it would've had another component like a pancetta or prosciutto. To be honest, I wouldn't get this dish again (I'm glad I tried it). <br><br>I went between my truffle pasta dish and the ribeye steak. However the steak was 16oz that night and it seemed a little too big for my appetite that night. <br><br>The ambience was really nice! It was very dark in there (troubling to read the menu). But the music and vibes were amazing! We will definitely be back.", "pics": null}}, {"review": {"des": "Went on recommendation and it was spot on!  Classic Old Fashioned was made perfectly!  Menu was easy and had a hard time choosing.  Shaved Vegetable Salad was so unique and great flavors.  Meatball app was the size of a softball and served with the most incredible red sauce I've ever tasted. Garlic Bread was insane!!! Yum!", "pics": null}}, {"review": {"des": "Great traditional Italian food in River North. Meatball appetizer followed by bolognese were both great. Burgers are excellent as well.", "pics": null}}, {"review": {"des": "Terrific food, great service and awesome space. <br><br>Definitely one of the best new restaurants in the city. The brussel sprouts are killer, and plentiful. Smashed potatoes could not be finished by two people. <br><br>My steak and chicken each cooked to perfection. <br><br>Not a lot of hoopla, but Gilt nailed everything they served us many times over.", "pics": null}}, {"review": {"des": "I went here for drinks once and thought it was divine. Then I went for an anniversary dinner and all I could think was #weaksauce. <br><br>Upon arriving they were totally attentive and wishing us happy anniversary and all the wonderful things you want to hear as a well taken care of customer. However, since I forgot my night vision goggles (how could I?!) I wasn't able to clearly see my way to the table, or my food, or my boyfriend. It was like the monster's ball level of sufficient lighting. <br><br>At any rate the meatball appetizer was freaking AWESOME. And huge. However we got charged for two dishes we didn't order and an app we didn't order. Also shout out to the guy that dumped our fish, French fries, and Brussels sprouts leftovers into one to go box. ‍<br>Thrice stars.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/clt-MzznbZYkyxSXY2hy4Q/348s.jpg", "caption": "Meatball appetizer - so dark had to put two candles by it just to see it for the photo"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UQUqhmeP-5RjbS7FkFBTug/168s.jpg", "caption": "Brussels sprouts"}]}}, {"review": {"des": "Gilt Bar is a unique, vintage, yet classic restaurant with tasty cocktails and a menu of delicious contemporary American food. From the extravagant chandeliers, leather bound books to the hidden library in the basement, the cozy restaurant is perfect for date night or group nights out. While it was pretty loud, the ambiance, food and service greatly made up for it. We enjoyed some cocktails on a Friday night and ordered the orecchiette with spicy sausage. I could eat this dish for the rest of my life and I'd always be satisfied. We also took advantage of the photo booth in the basement. I can't wait to come back and experience Gilt Bar again and add it to my rotation of favorite Chicago restaurants.", "pics": null}}, {"review": {"des": "How this place only has 4 stars is beyond me! From the ambiance to the incredible food, we can't rave enough about it! Since discovering the restaurant 3 months ago, we've been back 4 times and recommend it to all of the out-of-towners looking for a \"cool\" Chicago spot. Recommend the burrata appetizer, the meatball appetizer, the white fish and the orecchiette entrees. SO good! Hands down, our favorite restaurant in the city - let's hope that doesn't change!", "pics": null}}, {"review": {"des": "Overall I really enjoy Gilt bar! (But my meal was not without any hiccups). For starters the women working up front at the host stand was amazing! She was super friendly, nice and her personality was one of a kind (in an amazing southern way)<br><br>Drinks (all were delicious) <br>Whiskey sour<br>Airmail<br>French 75<br><br>Food:<br>Burrata- amazing <br>Roasted salmon- one of my faves, second time ordering this dish<br>Beef fettuccine- our waiter told us this was the best dish and honestly I was not super impressed. I thought it was a bit too salty and preferred the truffle pasta that I had eaten previously <br>Fries- although they were delicious I really wanted mashed potatoes but our waiter said they were out (I seriously cried on the inside) <br><br>Overall the food was really good, I love atmosphere but our service was a bit slow. It felt like it took forever for us to order second drinks and weren't able to get them until after we were done with the food. But nonetheless I still love giltbar!", "pics": null}}, {"review": {"des": "Gilt Bar is cozy and dark, great for both a romantic date or big group dinner although it can get a bit loud here.  I love the truffle pasta, the bone marrow with toast, the mussels, all the sides...even their mashed potatoes are so gourmet tasting!   We love to bring visitors here because Gilt Bar just has something for everyone   People of all palates would be able to find something they like here.  My brother and husband also claim they make the best whiskey sours here. Just one request, please bring back the date cake with coffee ice cream dessert!!!", "pics": null}}, {"review": {"des": "This was my first time at Gilt Bar and it wont be my last!!!! I had dinner and cocktails with friends and lets just say the food and drinks did not disappoint. The lighting was fabulous and the service was surprisingly unpretentious and very cheery. The price was right on point for the area pretty expensive but worth it for sure.", "pics": null}}, {"review": {"des": "Great place for dinner and drinks! Ambiance is very sexy with very soft lighting providing a perfect spot for dinner. Make sure you make a reset prior so you are seated promptly. During dinner if you plan to experience the Library talk with with the host so he/she can put you on the list. Food is excellent overall well seasoned and perfectly cooked. Kitchen staff seemed to be very talented. Enjoy!", "pics": null}}, {"review": {"des": "Just wow! I cannot day enough about this place. Ambiance? Great service? Fair prices? Unbelievable kindness and personality from bar staff, wait staff and hostess?  I moved away from the city I love a year ago, and on this one night back with friends we decided to get dinner and drinks at Gilt Bar. We were not disappointed! The bar staff was phenomenal, the hostess (Kiera) was kindhearted and generous. Our waitress, Katie, was friendly, personable and kind. I will not soon forget all the wonderful conversations and connections we made, nor the unbelievable tasty food we were served. I have already recommended this place to all my local friends. Bravo! You've earned a fan in me. Don't stop doing what your doing.", "pics": null}}, {"review": {"des": "We had a large group (company holiday party) roll in around 5:30 p.m. on a Thursday evening. The place was PACKED. (We had a reservation, thankfully.) Super moody - in a good way - vibe with candles and brick walls and that ever-photographed chandelier in the center of the room.<br><br>The food was fantastic. The lobster roll was teeming chunks of lobster and my colleagues who got the steak said it was one of the best they'd had. Sides and starters were delish; the burrata with tomatoes was ooey gooey and my friend's bone marrow was... boney. Like, lots of bone. Everything we had was on point, including the cocktails.<br><br>Service was good despite a little snafu at the beginning of the night. <br><br>I'd hit this spot for a date night or intimate gathering; it was just romantic enough with a touch of loud that made it feel unpretentious yet swanky.", "pics": null}}, {"review": {"des": "Great spot. Came here for happy hour after work with colleagues. I tried the famous Old Fashioned; I'm not usually a whiskey/bourbon person, but the drink was excellent. We shared a variety of appetizers, including foie gras, bone marrow, steak tartare, and french fries. The garlic aioli served with the french fries was a great addition to our spread. Make a reservation if you are going right after work - the place gets packed!", "pics": null}}, {"review": {"des": "I loved this place. Was recommended by a friend. We can in from out of town and were meeting friends. We made a reservation ahead of time thankfully. <br>We had the meatball appetizer. It was so good. Also had some sort of sausage dish. Lol. Lots of drinks and talking so not even sure what it was called. <br>They have a photo booth downstairs by the restrooms so we all piled in and made some memories. <br>Service was great. Definitely would go again", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Q4RS69oOK_L_mXcnZuMGXQ/348s.jpg", "caption": "Meatball appetizer"}]}}, {"review": {"des": "I came here for a date, it was a good spot. They have a nice list of liquors and are able to make most classic cocktails. It was pretty chill in terms of vibe and it wasn't noisy. <br><br>I didn't like how we got there relatively early and they sat us super close to another couple when there were many open tables. I also felt like the waiter was annoyed that we weren't just throwing back our cocktails and ordering more. But overall the drinks were great and I liked the ambiance.", "pics": null}}, {"review": {"des": "Oh how I wish they still had brussel sprouts...<br><br>Gilt Bar was amazing, I had the Grilled Farm Chicken and I honestly forgot what my husband ordered because I was so stuck on this amazing chicken! Our sides were broccoli and bacon which I HIGHLY recommend. I also had a Paloma, which was strong and flavorful. <br><br>I highly recommend this place.", "pics": null}}, {"review": {"des": "I love, love, loved this place! My fiance brought me here for a bithday dinner and we had a great time! The lighting sets such a romantic ambiance to the place, it makes the perfect date night. Our waitress was also very friendly and had great customer service. For dinner, we had...<br><br>Truffle Pasta - definitely as good as it's hyped up to be! It's melt in your mouth, delicious pasta! Highly recommended<br><br>Steak - so tender, so good! We asked for it cooked medium and it was cooked to perfection. The seasoning on it was phenomenal! Also, highly recommended<br><br>Side of Fries - I love fries and these did not disappoint!<br><br>The drinks we both ordered were also really good! Very talented mixologists at the bar. All in all, a great place! Would definitely come back to try more of the menu", "pics": null}}, {"review": {"des": "Came in for dinner on Memorial Day, which was a slightly odd experience given we were only 2 out of about 6 people in the whole place. Nonetheless, the décor is awesome, it has that upscale refinement but without the white tablecloths. It was a different perspective to be some of the only ones inside, whereas when I would normally try to come on a Friday or Saturday night it would be packed.<br><br>I have been to the Library downstairs before and it was an amazing experience for drinks. I would say the upstairs is comparable for dining. The menu is straightforward, but the food is high quality and refined. It still places a very heavy emphasis on drinks and wine, hence Gilt BAR.<br><br>I ordered a glass of wine, specifically the nebbiolo from Piedmont region. It was very unique and a decent sized pour for ~$12.<br><br>My brother got the bacon burger while I got the chopped salad. It was a quick and simple dinner, but wow, even these two \"simple\" items were refined and absolutely delicious. My salad was super fresh and came with this likely homemade ranch that was unbelievably rich and creamy; probably the best ranch I have ever had, and one of the best chopped salads too. My brother really liked his burger as well, it was done perfect medium and super juicy. Although slightly expensive at ~$16, the thick cut bacon made it unique.<br><br>The only minor thing wrong with our dinner was that the fries were very salty. The fries themselves were clearly fresh cut, but I think somebody was a little heavy-handed with the salt.<br><br>Our server was good. We were literally her only table and even so she didn't hover around us too much. We didn't need much from her either, it was a very simple dinner.<br><br>Overall, super high quality and tasty food here. I would imagine the atmosphere is better when there are more people there, but it still made for a quaint but upscale dinner, that really wasn't too expensive considering my salad was ~$12.<br><br>Will definitely be back.", "pics": null}}, {"review": {"des": "Only stopped in for drinks while we waited for our reservation at bavs. Speaking of, it is very bavs like which is all good for me. While many places on Kinzie were slow, Gilt was packed at 9pm early in the week. We wanted to hit the library downstairs but it was closed for a private party. They serve the big cubes with your whiskey like everyone else is these days which is a nice touch. Coming back soon....", "pics": null}}, {"review": {"des": "One of the restaurants always in my rotation. Everything about Gilt is an experience. <br><br>Start off w/the ambiance as it is a perfect place for a date, but also a perfect place for an intimate group as well. The cocktails are fantastic as well - one of my favorite bee's knees in the city. Gilt does offer BYOB as well, but as part of Hogsalt's restaurant group there is no corkage fee and you're required to share a portion of your bottle with another patron.<br><br>Highly recommend doing family style and share everything. My favorites, which tend to be what I always get:<br><br>Steak Tartare<br>Roasted Garlic Tartare<br>Roasted Bone Marrow (fantastic)<br>Truffle Pasta (always)<br>Smashed Potatoes <br>Farm Chicken<br>Coal-Fired Ribeye<br>Carrot Cake<br>Chocolate Layer Cake<br><br>Enjoy this gem of a restaurant and make sure to make reservations. Also, check out the downstairs bar as well.", "pics": null}}, {"review": {"des": "This place screams romantic date night! Dim lighting, beautiful chandeliers, candles, and lets not forget the food. I ordered the chicken, and let's just say it puts all other restaurants in Chicago to shame. My only complaint was my cocktail. I ordered a Paloma, and it was horrible! Still not enough to keep me from coming back!", "pics": null}}, {"review": {"des": "Tried to stop in for dinner tonight, mainly because I had a great experience prior to this evening. It didn't get far because the host was so out of pocket with her customer service we left immediately. <a href=\"/redir?url=http%3A%2F%2FGet.new&s=40d55c527e29ee50a9f454b47081acc212efe084a63403ea92ee0cb1e06665a3\" target=\"_blank\" rel=\"nofollow\">Get.new</a>.hosts.", "pics": null}}, {"review": {"des": "Went on a Saturday night and everything was great. From the hosts and server to the food runners and bussers, everyone was so friendly and kind. <br><br>I went with just my boyfriend and we ordered 2 toast dishes and shared an entree and side. (The steak tartare is soo good!) Especially because the toast dishes have so much bread, it was way too much food. It might be better to come with more people and share a lot of things so you can try more dishes on the menu. Everything is pretty shareable. <br><br>Next time, I'll try to save room for dessert.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hVku5Nz9Fiy93_NkPkKI-g/348s.jpg", "caption": "Pretty Decor"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DX_Z7FT2xmODFSXFP_u4JQ/168s.jpg", "caption": "Steak tartare"}]}}, {"review": {"des": "So tried Gilt Bar again. Haven't been here since it opened in 2010 (used to go to that French place that was here before-Agrie Deaux??). Walked by it a million times as have lived down the street for many years and the bar wasn't crowded, so why not. 8 years ago was ok, new, crowded, food passible and gimmicky, but sort of fun, but also snobby (chef wouldn't make a bone marrow dish for my dog-said he doesn't cook for dogs-Ha). This time sat at the bar. Still snobby and very pretentious. Some of the most uptight bartenders I have ever seen, and almost bordering on rude. Tons of tats really doesn't always make for cool and interesting. Get over it. You are not special, and this place is not special. The Shamrock dive down the street is 100X more fun.", "pics": null}}, {"review": {"des": "Oh wow! Where can I start with this amazing place! I was very impressed with everything this restaurant had to offer. I we lounged in the basement of the place, and I highly recommend it, its very well put together and a darker environment which is quiet relaxing and nice. The hallways full of pictures is amazing! <br><br>We started off with the bone marrow, and got the side of mashed potatoes, and the roasted garlic toast. All were amazing! <br><br>Then we had to try the truffle pasta since it's most recommended on yelp. I highly recommend it. <br><br>Overall the staff was great, clean place and very well put together, this has definitely become one of my favorite dinning experience in Chicago. <br><br>This amazing restaurant has impressed so much and left me with a great smile on my face.", "pics": null}}, {"review": {"des": "After months of anticipation, my boyfriend and I finally made a reservation to try Gilt Bar. The ambiance was warm and inviting but extremely dark. Our server was friendly and attentive. For drinks we got the Old Fashioned and Moscow Mule. I've never had a Moscow Mule until this one, but it seemed very good. For appetizers we got the bone marrow and roasted garlic. I'd never tried bone marrow either, but it was a good experience and my boyfriend raved about it. For entrees he opted for the burger instead of the steak, since the cut of the day was not what he had been hoping for. I got the truffle pasta which I expected to love based on yelp reviews I'd read previously, but it was extremely oily which I wasn't expecting. Overall it was good, but not great, especially for the price and all of the hype. I'd probably try Gilt Bar again, but I'm in no great rush to go back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MMw0rQSDrwWeQ29E5EjgKw/348s.jpg", "caption": "Bone marrow"}]}}, {"review": {"des": "Like everyone else said, get the truffle pasta!!! One of the best pasta dishes I've had in my life. I ate it all but it's also not a super big portion so if you eat a lot I'd order more items or get 2 . <br>We came in on a Saturday night around 8:30 with reservations and had to wait at the bar for 10-15 min which we were fine with and got some drinks. We also got the gnocchi and bone marrow which were both excellent. Our server was awesome.<br>It is very dark so it's great for a date night or intimate night with friends.<br>I will most definitely be coming back, especially for that pasta!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xYTUdj8pG0S89G6UWdR-hQ/168s.jpg", "caption": "Bone marrow comes with delicious jam too."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/U8OUf2ltbLKxqHdvHwZZ-Q/168s.jpg", "caption": "Highly recommend the truffle pasta! You'll be glad you did!"}]}}, {"review": {"des": "Top five favorite restaurant in the city.  Two words:  BONE MARROW.  It's ridiculous, never met someone who didn't love it - or if I did I am not friends with them anymore.  Their pastas are also great - orichiette and truffle in particular.  Last but so not least, the chicken.  I never order chicken at restaurants but I do here- you won't regret it.  <br><br>Only criticism I have is it's a little too dark all the time but the food more than makes up for it.  Good date night spot.", "pics": null}}, {"review": {"des": "Long overdo review, as we plan our St.Pattys trip to Chi and already have reservations here again, noticed I had not shared my great experience @ Gilt.<br>LY, hubby and I went here on a Fri night w/ reservations. The place is beautiful and our service was excellent throughout the entire night. Certainly, impressed with our cocktails (old fashioned/whiskey sour) & dinner (Tenderloin Steak Tartare, 16oz USDA Prime Ribeye, brussel sprouts, cake!)<br><br>Hint hint: go to the lower level and pry...", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gAPEFDj4O6oHhSt9NY0RWw/348s.jpg", "caption": "Steak tartare - perfect kick & texture"}]}}, {"review": {"des": "Came here for valentines day - had a good time but definitely have areas to improve.<br><br>1) Service - our waiter was nice but rarely came over to check in on us, Making the wait time longer for when we needed something<br><br>2) Food - the truffle pasta was amazing, definitely the best thing on the menu (this place knows their truffle flavors). The brussel sprouts with the Dijon was very flavorful. The ricotta gnocchi was good but not amazing - would not get that dish again<br><br>Dessert was amazing with the moist chocolate cake - too big to eat on your own so definitely share!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vOG3R-ZZz2EyiBTinUWWwg/348s.jpg", "caption": "Ricotta gnocchi - good but not amazing"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zpd2AZkH5n-Z0UWEQl47KA/168s.jpg", "caption": "Brussel sprouts - must get app! The Dijon flavoring is awesome"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-miIG7bI8V1SKd5ryWMpOg/168s.jpg", "caption": "Chocolate cake - super moist and very rich. Definitely share! Too much for one person to handle"}]}}, {"review": {"des": "This place is good. I liked Bavette's a little more, and it's right next door, but sometimes they don't have seating and I rarely make reservations. I had the salmon and it was delicious. If Bavette's wait is too long, you would do well to check this place out rather than heading somewhere else. It's also less expensive than Bavette's too.", "pics": null}}, {"review": {"des": "I can't say enough amazing things about Gilt Bar. I was there last week after having traveled for work, and will be going there tonight. Steak Tartare and the Bone Marrow is AMAZING. Portion size is insanely huge - i had ordered a pasta entree and didn't even end up eating it because I was so full from the tartare and the bone marrow!<br><br>The service was great, and the food again - was amazing. Can't wait to go tonight!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4OnLY4KwJbpdzdVwrlriDQ/348s.jpg", "caption": "Steak Tartare and Bone Marrow - what dreams are made of."}]}}, {"review": {"des": "Really good food, unfortunately we filled up on the meatball appetizer so only had nibbles of our main courses but we doggie bagged them.<br><br>Negatives were our service was fairly slow for a Sunday evening, a while to be greeted a while for just two cocktails when the restaurant wasn't crowded. <br><br>Please note this is not a children friendly restaurant from the way the tables are set up to the food options. We almost had a family sit next to us with a toddler who climbed on my lap while I was eating. So yea leave the kids at home for this place.", "pics": null}}, {"review": {"des": "Visited here Friday night - showed up around 8 for a 915pm reservation (hoping something would come up earlier)<br><br>Checked in with the hostess and asked if the Library was open- she said there was a wait and she could put our name on waitlist which was more than fine with us. We went to the bar and had great speciality cocktails, and 15 min later the hostess comes back up and says theres a table at the library open for us!!!<br><br>4 stars for the food. 5 stars for the hospitality and atmosphere of both Gilt and the Library. <br><br>Had the Truffle pasta- as the other reviews state, its good not GREAT. Drinks are great, dessert was delicious (had the cookie with ice cream on top)<br><br>Photo booth is a super cool touch, we made sure to add to the collection.<br><br>Overall- super romantic and sultry environment- perfect for a Friday night date night. Will be back, maybe just for drinks and dessert though.", "pics": null}}, {"review": {"des": "This place has a lot of things going for it! First, location is so prime for happy hours after work if you're downtown/river north! The food is delicious and the menu has such unique flavors but still enough to serve most who don't want to venture out. They have a separate vegetarian menu which is always nice for those who prefer. <br>The truffle pasta is a must, along with their charred brussel sprouts! Happy hour has $5 house wine every day, which is a great perk if you aren't looking to spend a lot of money for an after work drink with your friends. The only thing that I could say some may not love is the lighting. It's pretty dark and lit only by candles and very dim lighting. It's definitely the vibe and I appreciate what they are going for but may not be for everyone. <br>I should add this wasn't my first visit, I've been there multiple times and the service/food is always phenomenal!", "pics": null}}, {"review": {"des": "Why in the world did I wait so long to try Gilt Bar?! Everything about my experience from the amazing service to the delicious food was above & beyond any expectations I had. Gilt Bar is perfect for date night but also great for any other occasion I can think of!<br><br>They have a pretty good beer selection and I was able to find a couple on draft I hadn't tried before. To start our meal, my friend and I had the Délice de Bourgogne Cheese for $16. I was surprised that something so simple could be so mind-blowing! The bread was just perfectly done, the cheese was a huge portion and I couldn't stop eating it! These items paired perfectly with the accompanying jam. I was just in love with this starter.<br><br>For our main dish, we split the Truffle Pasta ($14.50) which is a MUST GET from Gilt Bar. Seriously, do not skip this dish. It was loaded with truffle flavor, noodles done perfectly and just a perfect dish executed so well. The Truffle Pasta featured hand-cut noodles, pecorino cheese & truffled mushrooms. We also split the Bacon Cheeseburger for $16.50. Really the bacon was so thick it reminded me of pork belly and the burger was just delicious. It's the thick pub style and had a good amount of cheddar cheese and pickles in it. The dish came with fries and garlic aioli to dip them in which I loved.<br><br>I was so full from the starter, we ended up taking so much food from the main dishes home. The chef had our server check to make sure we liked everything because we didn't eat so much of our main dishes. I thought that was nice the chef was concerned and making sure that even little guys like us were leaving pleased. <br><br>And left pleased we did! Belly full, money well spent and really looking forward to going back to Gilt Bar.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YQOUspXvU0xsc-orifmAIw/348s.jpg", "caption": "Huge piece of brie and bread"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dEU0U3W_DZFwWmkNGiWB6Q/168s.jpg", "caption": "Pork belly burger"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kNKxVnF-qa4_8BDhwysJuA/168s.jpg", "caption": "Truffle pasta"}]}}, {"review": {"des": "Food first. The mussels were the best we've had in the city! The broth is delicious and we used every last crumb of that sourdough bread to soak it up. The orecchiette was really good too, loved it with the chorizo. The cauliflower gratin was just ok. The delice toast (spelling?) was a really good appetizer. It's basically a creamy Brie-like cheese, strawberry jam and parsley, and sourdough bread. The portion size was perfect for 3-4 people. <br><br>Very dark atmosphere, loud music, cozy tables. Really fun but sometimes felt like I had to yell across the table. Good service. We came later...9:30 no reservation and the two of us were seated no problem. Still busy though!", "pics": null}}, {"review": {"des": "Great date night spot! Dim lighting, nice music and excellent service. Photo booth downstairs for $3 which is pretty fun! We loved the gnocchi with subtle lemon flavoring and breadcrumbs. The short rib pasta had great flavor, as well. We ended the night with a super rich chocolate pie - they brought it out with sparklers for our anniversary! How cool!! They also specialize in delicious, well-made classic cocktails. Highly recommend for a romantic meal.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YsTPhrWpwOKs6bWNcuW6jw/168s.jpg", "caption": "Gnocchi"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/H8g9s8jp_qEvGCYerfS8Ng/168s.jpg", "caption": "Short rib pasta"}]}}, {"review": {"des": "My boyfriend and I had a great night at gilt bar. It's a younger crowd- late 20s-mid 30s. Crowded, vibrant, loud. Congruent with the atmosphere to be expected in river north. Ambiance was very romantic with the darker lighting and brick walls. Make a reservation. Place fills up fast, even on weeknights. Service was attentive and quick. According to us, must try's are the foie gras and the délice de Bourgogne (a creamy cheese served with a warm baguette). My boyfriend said he would order 4 helpings of the foie gras. Our favorite entree was the southern-style fried chicken. It was crispy on the outside, moist on the inside. The gravy was a perfect consistency and complimented the mashed potatoes and chicken impeccably well. We wrote in our reservation that it was my boyfriends birthday. Unfortunately, they don't bring out a complimentary birthday dessert, even though they made a note to know who's birthday it was when we arrived. Other than that, this place is an incredible experience and serves an impeccable menu. I would recommend this to any person in the area!", "pics": null}}, {"review": {"des": "Had reservations for a wednesday night. Ambiance is nice - really dark and nice furniture, room was pretty crowded. We were seated in a nice plush booth.<br><br>Drinks were good pretty strong. Server was attentive all night. Recommended some good drinks. <br><br>As a vegetarian I got the truffle pasta, the gnocchi made vegetarian, and the brussel sprouts. <br><br>Wow. The food was bomb. Probably the best gnocchi i ever had. The truffle pasta was good but tasted even better when we added the brussels to it. Would highly recommend the combo. <br><br>All in all, the options for vegetarians are limited but what they have is stellar.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/E7Nb8gUIzhXU0v7G25EXkQ/168s.jpg", "caption": "Charred Brussel Sprouts"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5qb9XcZT-TZq2LpEmazdmg/168s.jpg", "caption": "vegetarian Ricotta Gnocchi"}]}}, {"review": {"des": "A simply amazing experience.  From the food to the staff to the ambiance, Gilt Bar gets all high marks from me.  I took my fiance here for a nice dinner after my parents had visited for a week.<br><br>I had the foresight to call ahead and request that my reservation be made for \"The Library\", which is their downstairs speakeasy-style location.  This was the best choice I could have made.  The upstairs, while probably fine, seemed crowded and ordinary.  Just a bunch of hardwood floors, with regularly spaced plain tables, and everyone just sitting in cheap restraunt grade chairs.  Like an upscale diner crossed with Applebee's lighting.  Downstairs, it's a whole other world.  It's a bit cheesy, but if you let the ambiance take you away, you'll soon find yourself enjoying the quiet air and the hushed tones that bounce around.  The furniture is soft and plush velvet and leather.  The tables are all weirdly shaped with lounge chairs populating their sides.  Theres only a few tables in the middle with most of the seating in little alcoves on the sides.<br><br>So, how was the food?  Amazing.  The steak tartare was excellent.  Bright and flavorful gems of steak, decadently covered in a perfectly cooked (to a concealed jelly texture) egg and with crunchy homemade bread to eat it on.  It was amazing.<br><br>We decided to share an entree after the steak tartare, as we were getting pretty full from the richness of the meal.  We picked the orecchiette, a delicious pasta dinner with delicate cup-shaped noodles served in a rich meaty sauce with amazing spicy sausage.  It tasted like someone had condensed the flavor from a homemade pot roast and the flavor packet from a hamburger helper meal into the sauce.  It was so rich and so flavorful, we were literally taking breaks through tasting the food just to sit back and marvel at the thing.<br><br>After what seemed like an hour eating, we decided to get desert, because that's what you do.  We picked the homemade cookie and ice cream.  It was sweet and warm and delicious.  The crunch and the ooze from the cookie did overpower the light ice cream that was on top, but the temperature of both really meshed well, creating an enjoyable and simple treat.<br><br>TL;DR: Amazing, make sure you reserve your seat in the library, and get the steak tartare.", "pics": null}}, {"review": {"des": "Perfect place for a special date night out. Low lighting for that romantic ambiance and unique menu options to try with your S.O. Doesn't get much better than that. Despite 10PM being the only open reservation spot on a Saturday, there was a good crowd and service was incredibly quick! <br><br>The best thing that we ordered was the steak tare tare.... oh my goodness. I never had tare tare before, and Gilt Bar set the bar very high! We also enjoyed the truffle pasta - much garlic and the perfect amount of creaminess. Excellent! There was a lot of hype on here for the brussels sprouts, but I found them bitter and underwhelming.<br><br>Drinks were PRICEY (yet normal in the loop). For dessert we got the brownies a la mode. Brownies were warm and of course went well with the ice cream. We had more than enough food, as portion sizes were very fair. Although we spent more than usual on food, it's worth it on a special occasion.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zg1ZNyi5-FzC6f1Jr1q9eA/168s.jpg", "caption": "Truffle pasta, steak tare tare, Brussels sprouts"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-vt2qPeaU3duQOiriWsFug/168s.jpg", "caption": "The best steak tare tare"}]}}, {"review": {"des": "Dimly lit bar off the beaten track a little from hustling river north clusters with hearty Italian fare and good drinks. Traditional tables as well as sofa seating for drinks or evening meal, a place with staff that is on point and food good enough to be a destination even without the drinks. Nice wine and mixed drink selection along with beers on tap. Food is pricey but servings are generous (noticeably for the beet salad and burrata).  Pastas are a specialty.", "pics": null}}, {"review": {"des": "What a beautiful and fun bar! We made a reservation but wanted to check out the Library bar downstairs, so they were able to seat us right at the bar. It was so cool going underground into the dark hallway and then enter this gorgeous room. The drinks were creative and absolutely delicious. I just loved the lush and beautiful vibe of the whole place. I also had a blast taking pics in the photo booth and adding our strip to the covered hallway. What a fun idea! Definitely check this out.", "pics": null}}, {"review": {"des": "I've been here 8 times and the food never disappoints. Last night we had the bone marrow, burrata special and the new fried chicken.  The drinks were great as well.  Service on the other hand was a hot mess last night and it didn't seem as busy as other nights where service was clicking on all cylinders.<br><br>Hopefully service is back to normal the next time we try gilt bar,", "pics": null}}, {"review": {"des": "The cuisine here is nothing short of amazing. The dim lighting and intimate setting create a wonderful ambience for date night with your sweetie. Gilt bar has become one of my must goes when I come to Chicago. If you are looking for a cozy & romantic spot with amazing food; Gilt Bar is the place to go!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UImCHN4rc3C5_ldBXmlAEw/348s.jpg", "caption": "Intimate booth with a lovely view"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/L18876BnzYJlU2eAJqC2ng/168s.jpg", "caption": "Gorgeous chandelier in the center of the restaurant"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dhnw4__XJNWbeDEftp_A2g/168s.jpg", "caption": "Roasted Roasted Garlic appetizer, absolutely delicious."}]}}, {"review": {"des": "Let me start of by saying this place is great, and has the perfect ambiance to go a long with it is a solid plus. This restaurant lounge gives you a nice speakeasy feel along with amazing food and drinks to match. I called them early on in the week because my main goal was to go downstairs to their  hidden bar \"The Library\", but knew that it was always a long wait. The restaurant called me back right away and said they would be happy sit us downstairs in The Library and wanted to add to our experience. I thought that was beyond thoughtful. <br><br>The Library also gives off a nice speakeasy vibe, but is a more so close quiet setting.<br><br>Food was amazing, customer service was excellence, and atmosphere was superb. Couldn't rate this place any less than a 5.", "pics": null}}, {"review": {"des": "Been here a few times and haven't had a dish I don't like. If you visit, get a cocktail and no matter what you do get the roast chicken!! Best thing I've had there, but like I said, you can't go wrong.", "pics": null}}, {"review": {"des": "You had me at photo booth. An incredible night celebrating our anniversary, such incredible service from the hostess to the manager. We were seated in the speakeasy downstairs, a true gem, and the music, cocktails and delicious food made the night complete. We'd recommend the gem salad, bone marrow and truffle pasta. We'll come back in a heartbeat!", "pics": null}}, {"review": {"des": "One of my favorite restaurants in Chicago! I always make a point to come here when visiting Chicago.  Incredible food,decor and ambiance.  The downstairs library/ lounge is so cozy and beautiful.", "pics": null}}, {"review": {"des": "I would have to agree with the previous reviews. This place is pretty epic. Definitely has the chill out type vibe. The decor inside is pretty cool. Solid spot for a romantic date night. They also have that photo booth in the basement which is just a nice touch to the overall theme. <br><br>We had reservations through open table for Friday night. Naturally, Chicago traffic was terrible so we were running late. We were able to adjust our reservation time and gilt was very accommodating to making sure we still had a table. So the customer service aspect was wonderful. <br><br>After we were seated, we were handed the menus and greeted by our waitress. It was my first time here and I was unsure of what to get, what was good. Her inability to really recommend anything or suggest something to try was disappointing. But she was friendly and polite. And we were able to figure it out. <br><br>We ordered the garlic bread which was delicious. The short rib pot roast which was by far the best thing we ordered. The flavors were just incredible! The pasta dish was pretty good. But that short rib stole the show. <br><br>All in all, I would definitely go back if I'm in the area. We had a great time there. I would just like better drink pairing recommendations.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/h_Y54RP3XphU7zTKJ6sRiA/348s.jpg", "caption": "Chopped salad and balsamic garlic bread   Soooo good!"}]}}]}