{"name": "ginos-east-magnificent-mile-chicago", "reviews": [{"review": {"des": "We walked in and asked the hostess if there was outdoor seating, and she said no, but we could go up to the 3rd floor and ask them. I'm glad we did, because there were tons of available tables.<br><br>My wife and I sat outside on a perfect fall evening, having drinks, and the  AF pizza. While I'm not a fan of Chicago-style pizza, my wife is. I have to admit, this pizza was the bomb-diggity. The waitress was fun and we had a great time. We thought the food and drink costs were pretty inexpensive for downtown Chicago.", "pics": null}}, {"review": {"des": "I would give this place no stars if I could. I placed a carry out lunch order today for my mom and I.   She was having her second round of chemo at Northwestern Hospital and We wanted to treat ourselves to something other than cafeteria food.  <br><br>I ordered a lunch size pizza combo with side salad. My mom ordered the Gino's House Salad.   I picked it up about 20 minutes ago. I chose to look past the dirty pick up area and a waitress in the kitchen calling a customer \"a lazy MFer\" in front of me and other patrons.  Sitting in a hospital room now, neither of us can eat this food. It's all going in the trash.  Although I ordered lunch at 1:15, the mini pizza was dried out and lukewarm. It had clearly been sitting under a warmer for far too long to be served to anyone.  So I decided to eat the salad, where this meal gets even worse.<br>My mom starts picking up her lettuce and reminding me about the romaine recall.  She's pulling out several pieces of bad romaine, 4 or 5 pieces with small bugs on the underside of the leaves, dirt, grime and decaying edges and stems that are black.  I start looking at my salad....encounter the same.  I also found a few bugs on the undersides of leaves, some decaying and black, expiring lettuce that should not make it onto a plate.  The worst part of my salad was a red-brownish liquid that was either mud or some other mystery substance that I was not about to put in my body.  I did not have dressing, so need need for this liquid to be here. Clearly the lettuce had not been washed or cleaned, in the midst of a romaine recall! This is so disgusting and disappointing I will never be back to a Gino's again.<br>Instead of the manager at the front podium joking and flirting with the hostess, he should be overseeing the kitchen and making sure the food is properly cleaned and not a health violation. No e.coli in this girl's lunch menu today.  But I will shortly have a call in to corporate management. <br>How dare they? This close to a medical campus. Shameful.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IxuP03o8N9To9Rm7VQRJdg/168s.jpg", "caption": "More mud"}]}}, {"review": {"des": "FIRST. TIME. HAVING. DEEP. DISH. PIZZA.<br><br>And yes the 45 minute wait was worth it. My boyfriend said this place was awesome, and with it being his hometown I obviously agreed to eat here. I was VERY happy with the mozzarella sticks, salad and pizza. I could only eat one piece!!! The crust on the pizza was crisp and the sauce was just freaking awesome. The ambiance is pretty cool and we were seated by the bar, so double points. 10/10 would go again!!!", "pics": null}}, {"review": {"des": "By far the best deep dish pizza in Chicago!!! Hands down!! Crust is not too thin, not too thick. It's just right! Crisp, buttery and delicious. Sauce is slightly sweet and just the right amount on the pie. I'm not sure how to describe the greatness, you just have to try it for yourself! <br><br>Loved it so much that ordered a few pies to be sent to NYC.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JdJQ1LMM9d4J1uy8edSNyA/348s.jpg", "caption": "Meaty Meaty Legend with sausage"}]}}, {"review": {"des": "Went to the bar, and this was pretty damn good pizza. Heavy, garlicky, and hearty, this really hit the spot. I would say I prefer NY pizza, but I had to have Chicago Deep dish in chicago and this place hit the spot. It's way too heavy for me to have on a regular basis, however.", "pics": null}}, {"review": {"des": "This location has a cool vibe, with signatures covering every blank space on the walls and chairs and a rooftop bar. But on to the important stuff.....the food.<br>Since the pizza takes so long we ordered the spinach sticks for an appetizer. Think fried mozzarella sticks but with spinach inside too. They were delicious!<br>We got the supreme deep dish, medium. It was the perfect amount for 3 adults. We added the traditional sausage patty that the waitress recommended and it was great. The crust is a cornmeal crust that I thought was ok. I have come to realize that every Chicago pizza place is know for their crust and each one is different. My favorite is still Giordano's but this place was good and I would go back.", "pics": null}}, {"review": {"des": "The only reason this rating in not a one star is our server Chelsea was awesome. This place must rely on tourists because the food is inedible.<br>I was so embarrassed because I took my wife here to get her real Chicago deep dish pizza, total failure.", "pics": null}}, {"review": {"des": "We came for weekend lunch with friends and were able to get a table immediately. Service was good whenever we were able to find our server. <br>Between four people, we ordered two medium sized pizzas which was entirely too much. These pizzas are huge and very dense. The actual fillings were pretty good (Chicago Fire is delicious), but as far as the crust, we still prefer a different local pizzeria that will remain unnamed.", "pics": null}}, {"review": {"des": "BLUF: Chicago deep dish pizza with a great palate combination that reopened the door for my palate. <br><br>The last time that I had deep dish pizza was ten years ago, and I did not have a good experience. Among the numerous recommendations I received, I decided on Gino's to try to open up my palate once again to this type of pizza. This Gino's location at the end of the magnificent mile was unique with its decor and interior presentation with all of the signatures and marked up walls and benches. Our waitress was attentive despite the busy timing, which we appreciated. <br><br>We ordered a small Gino's Supreme with italian sausage deep dish pizza and it was a pleasant surprise! The cheese was deeply embedded within the pizza intertwined with the sausage, green peppers, mushrooms, and onions that made for the perfect combination underneath the tasty pizza sauce. We appreciated that the sauce, crust, and overall taste was not too salty. The cornmeal crust allowed the pizza to not be too greasy and provided a good foundation that was not too doughy. The small size was perfect for the two of us as these pizzas get pretty large stepping up to a medium size. Finally, I ordered one of the Gino's craft beers (La Salle Lager), which made a refreshing, crisp pairing with the pizza. <br><br>All in all, I had a great experience at Gino's reopening my palate to the cuisine of deep dish pizza. I'm interested to discover other deep dish pizza places in Chicago, but thanks to Gino's I'm willing to explore this type of pizza again!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Pgbtvp8yz1MW5DkqE3NjkA/348s.jpg", "caption": "Main course: Gino 's East Supreme Pizza with Italian Sausage"}]}}, {"review": {"des": "Gino's has a great ambiance, mostly because of the graffiti. It's everywhere. Well, not EVERYWHERE. The inside joke is that every surface at Gino's is covered in graffiti except the restroom,s which are spotless.<br><br>Oh, and they have pizza. Deep dish pizza. So deep that I can even print the word for how deep it is. But it is as deep as that. It's also pretty good. I admit I'm not a huge deep dish fan, but the crust here has cornmeal, which helps, and there is lots of good tasting filling. Be aware that it takes a good 45 minutes to cook your pizza.<br><br>Their thin crust pizza doesn't take quite that long. The crust isn't actually all that thin, though, just thinner.<br><br>The place is large and busy, so service isn't super attentive, but it's adequate. If you've always wanted to try deep dish pizza, I'd say this is your best bet.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7MFhatbHUDmMFljS4LWXVw/348s.jpg", "caption": "Meaty legend deep dish"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HK8HGc0rMtKSz2bRN2W4GA/168s.jpg", "caption": "Chicken thin crust"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/efprJuQq3aYsF4BCfslDlQ/168s.jpg", "caption": "Walls"}]}}, {"review": {"des": "We took our family, they live in North Carolina, to Gino's to enjoy Chicago pizza.<br>Assuming that Gino's east at this location will be a great choice.<br>The appetizers we ordered were okay, nothing really espectacular.<br>When the pizza arrived I was surprised that it wasn't as tasty as other occasions.<br>I ate this pizza before, and the taste was better<br>But this time, unfortunately, wasn't as tasty as before.", "pics": null}}, {"review": {"des": "Deep dish definitely beats New York style pizza and Gino's East is rightfully awarded one of the top pizza places in Chicago. The atmosphere was very avant-garde and fun - the server brought our table markers to add to the graffiti that is covering every surface in that place.<br>The filling of the Gino's East deep-dish classic was phenomenal - cheese gooey and melty with the perfect balance of meet and vegetables. But the crust was a bit too much cakey and buttery for my taste, which was the only downside of the place.", "pics": null}}, {"review": {"des": "BEST PIZZA PLACE IN CHICAGO PERIOD.<br><br>I don't even know where to begin, it is overall that amazing. The ambiance is SO FUN. You can write your name on the walls which is always fun to come back to, to see if it is still there. There are T.V.s in the bar area which includes a little seating area as well. The staff are extremely friendly and efficient. I would recommend going during off hours so your wait time isn't that long, because it gets busy very fast. <br><br>On to the food. NOTE: If you are going to order deep dish pizza, know that it is going to be at least 45 minutes before you get your food (this is standard). The waitstaff does inform you which is very nice. However, the time it takes for the pizza to come out allows a great opportunity to get an appetizer, a salad or drinks!<br><br>I would highly HIGHLY recommend getting the calamari. It is perfectly crispy and the sauce that it comes with is not too heavy or overpowering. For drinks, I have ordered various glasses of wines and loved all of them. They also have a good selection of beer as well. For a special occasion, we ordered a bottle of Prosecco and it was FANTASTIC and paired really well with the pizza. <br><br>On to the PIZZA. I am a die-hard cheese only type of person for Chicago-style pizza. The sauce to cheese ratio is ON POINT. I also love the option that you can get half and half (as my boyfriend normally gets sausage on his half) and the taste doesn't spill over to my half. <br><br>There are really no words to describe how amazing this place is and how amazing the pizza is. Much better than Giordanos, no question. The pizza is similar to Lou Malnati's but in my opinion, Ginos East will always have my heart.", "pics": null}}, {"review": {"des": "Stopped in for a business dinner at a local joint while in Chicago because it would be a sin to leave Chicago without deep dish. <br><br>To start off we ordered two large salads: one Caesar and the other was an Italian salad with provel and salamis, etc. They were both great but the Italian I liked best. For a group of 6 we got two large pizzas- one meat lovers and another house or deluxe type pizza. They came out relatively fast- 30 or 45 minutes. The pizza was phenomenal, I had one piece and it was more than enough, but the crust was out of this world.<br><br>Our waitress- don't know her name but blonde and darling- was an absolute doll. Fabulous service and very patient with a large group. The happy hour was going on so we all got a drink off of it. I had the house red which was about $5 and was great. <br><br>After dinner we had so much pizza leftover that we asked our waitress if she knew of any local homeless we could give it to. She pointed us in the right direction and we were able to find someone. I was so pleasantly surprised with our service, she was absolutely amazing, best service I have had in forever.<br><br>Food: 9/10<br>Service: 10/10", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SBIfDzVizbsuIbx_f1E1DQ/348s.jpg", "caption": "Meat lovers deep dish"}]}}, {"review": {"des": "Pizza is good, pizza is life.<br>The issue, too much tomato paste can ruin a great pizza. If I ever go back here, I will have to scrape off all of the tomato paste, just to enjoy the pizza.<br>I ordered mozzarella sticks, and let's just say there was no strong cheese pull with them. Drowning them in ranch helped me throw them back tho, so that's a plus.", "pics": null}}, {"review": {"des": "Food, new friends, and pizza!<br><br>Yelp wants me to write more so I'm writing more. Nice to meet new (to me) Yelpers.", "pics": null}}, {"review": {"des": "A great Chicago style deep dish pizza. I believe it was started in 1966 and I believe this might be the original location. Pretty cool spot, very open inside which seems like it's been renovated if it is original. All kinds of graffiti marker writing all over the walls. The pizza is good, but similar to Uno's with the dry crumbly crust. I kind of prefer Lou Malnati's for Chicago deep dish, but I'm nitpicking. But this place has definitely got character , lots of guests and celebrity photos cover the walls.", "pics": null}}, {"review": {"des": "BEST & MOST FAVORITE PIZZA EVER!.<br>Always have to make time to go into the city for this pizza.<br>It is unlike any other.", "pics": null}}, {"review": {"des": "I really wish yelp had half stars. This is definitely a 3.5<br><br>The interior of the restaurant is pretty cool with a ton of marker graffiti covering every inch of the walls. <br><br>You're going here for the deep dish. It takes about 40 minutes from ordering to getting it at the table. They are nice enough to let you order different toppings on each half if you like to try different things like I do. We split ours between the Meaty Legend and the Spinach Margherita.<br><br>We got a hummus appetizer to tide us over the 40 minute wait and it was okay. I love hummus and I figured a few veggies would be good to prepare our stomachs for the onslaught of cheese and meat. <br><br>The waiter brings the pizza out in a pan and it is sliced and served at the table. I did not like the watery puddle of sauce run-off the pan was left with when our pieces were served. Maybe the Margherita half had too many tomatoes? I'm not sure, but it didn't look good and made the base a little soggy. <br><br>The pizza itself is pretty good! I definitely preferred the Meaty Legend over the Margherita. The sauce is deliciously flavorful. The crust buttery and a little flaky. I was a huge fan of the flakiness vs the other more doughy deep dishes I've had in town. <br><br>Three of us got a Large pizza and left feeling super full and with 2 slices of leftovers to take home. <br>The leftovers were even better the next day. The sauce thickened a bit and reheating the pizza in the oven brought it back to life!<br><br>I wasn't a huge fan of the service. The waiter came back once during the hour plus we spent there and my friend sat there with an empty drink cup for nearly half an hour. He was however very particular in circling the tip and saying it was not included when he gave us the check. A little less pushy next time, maybe?", "pics": null}}, {"review": {"des": "This review is for takeout only:<br><br>We had such a nice experience here at Gino's! <br><br>Coming up to the front door there was a line out the door and around the block for walk-ins, so we decided to order ours to go. <br><br>The service at carry out was great! Our order was taken fast and was ready in under 45 minutes. I walked around to get a feel for the place and all employees were courteous said hello, even though the place was busy. <br><br>There was a long large red couch for us to relax on while we waited, and when our food was ready, it was packaged orderly and neatly, with plates, silverware, napkins, and extra packets of Parmesan cheese and <br>Crushed red pepper--the works! <br><br>The hummus had a nice tang to it and the veggies were packed separate: fresh tomatoes, carrots, cucumbers, and warm pita. <br><br>On a whim we tried the roasted Brussels sprouts with pancetta and I found them quite delicate and rich in flavor. Quite a suprise to find at a pizza place :)<br><br>As salads go, the Tuscan Harvest Salad was simple and refreshing, the bite from dried cranberries, blue cheese, and tart green apples combined well with the candies walnuts, mixed greens and grilled chicken. The fat-free raspberry vinaigrette drizzled on top was delightful. <br><br>The thin crust pepperoni XL was tasty and crisp, with lots of cheese and little sign of grease.<br><br>The XL Meaty Legend, packed with pepperoni, Italian sausage, bacon, and Canadian bacon, was very flavorful and also non-greasy. There were a few granules of fat from all the bacon(s) but held well in the thin crust and did not create any sogginess.<br><br>The food here is good and I'm happy to have tried it.<br><br>Also, they have an elevator to get to all three (yes, three) floors and an accessible door. :)", "pics": null}}, {"review": {"des": "Gino's is my favorite deep dish in Chicago because of the extra sauce and toppings proportionally to the cheese and crust.  I like the cornmeal crust much better than the other deep dish pizza places.  My nephew's had a fun time writing on the wall and making their mark on the restaurant.  Our daughter enjoyed taking photos on the stairway with all the neon.", "pics": null}}, {"review": {"des": "Good pizza, great atmosphere but the waiters are on commission, so anything they can sell you counts. However, food is good, atmosphere is good, we would come back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ii0yKuG0S3RjFtOitfvavA/168s.jpg", "caption": "Pizza Menue"}]}}, {"review": {"des": "This was my first experience eating an authentic deep dish pizza in Chicago and it did not disappoint. Granted,  I am a clean slate so I have nowhere or nothing to compare it to,  but still this place is good. There is a reason why it has been in business for many years, attracting attention from many celebrities. When you go upstairs, you can see a wall full of celebrities who love this place for their deep dish pizza! In fact, Katie Holmes ordered 200 frozen deep dish pizzas from here and had them flown out to wherever she was at the time. It has a very cool, grungy vibe to it, as every wall, the staircase and every piece of furniture are covered in customers' graffiti. Their moto is \"DEEP AF\" haha! <br> <br>After we sat down, our server told us it would be about a 45 min- 1hr wait on deep dish. I took that as a good sign that it would be worth the wait, so we ordered some beer and bread sticks to tie us over. By the time our pizza arrived, I was eager to taste it. We ordered a small deep dish that was half supreme with crumbled sausage and the other half was \"Chicago fire.\" Our server cut it for us into fourths and we ended up taking the other half back to our hotel for later. Holy moly is it good!   For my first deep dish experience, I have to day it met all my expectations. The service was great and all the flavors of their pizza were amazing!", "pics": null}}, {"review": {"des": "It was just meh. Not bad not great. Being from CA I anticipated some knock your socks off Chicago style deep dish pizza. Be advised that deep dish takes 45 mins. I didn't know the 1st time we sat down, so we left. But I came when I had time to kill. <br>I've had better pizza in Oakland and Berkeley.", "pics": null}}, {"review": {"des": "My first immersive trip into Chicago and this is where we have come for our first lunch. It was spectacular! True deep dish pizza is stellar and the crust is supreme. I had a slice of margarita and one of pepperoni. I'm not a huge fan of pepperoni, but you, Gino's East, have made me a fan! There's an actual meat to the pepperoni, definitely not from a grocery store package. The margarita was delicious and the mozzarella is the best I've had. <br><br>Thanks for having us Gino's!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lYWyOyOnWS7S2INjYbAVqQ/348s.jpg", "caption": "The margarita deep dish."}]}}, {"review": {"des": "Pro tip: Don't pay the $17 valet parking like a chump; for near the hospital a half block east you can find plenty of street parking at four dollars per hour. Wait time for the coveted deep dish pizza is around 45 minutes, so it's best to order a small appetizer to keep you afloat.<br><br>Unlike most gourmet deep dish pizza places like Pequods or what not, Geno's East uses authentic cornmeal based crust, rather than flour. Maybe that's why their prices are higher or inflation is getting really out of control as their deluxe medium pizza (sausage, peppers, mushrooms) is damn near thirty dollars. Just slightly under New York City prices.<br><br>Pizza was delicious, but I thought they could have added a little more sauce. That's why I'm such a huge fan of Edwardo's because they really know how to sauce it up to perfection.<br><br>Better than Lou Malnati's which unfortunately has focused on franchising rather than keeping up with quality throughout the years.<br><br>4/5", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Eqt0u6u7ZCPxOeNLnCO8hw/168s.jpg", "caption": "Medium famous deluxe 27 dollars in 2018"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HZUq6Lh_pJgTapBZgUfI-g/168s.jpg", "caption": "Slice of deluxe deep dish"}]}}, {"review": {"des": "The most delicious pizza I have ever had. Luis was a most excellent server. He recommended the spinach margarita pizza. OMG! These pizzas have the best sauce. We ordered a deep dish and a thin crust pepperoni. Both were good depending on what you like.  I'm visiting from Wichita and I don't think I've ever had a seriously  - what I would call \"competitive\" pizza. This was everything I had hoped for as a Kansan visiting Chicago.", "pics": null}}, {"review": {"des": "Just so so. We were in town and my pizza loving son insisted on trying Chicago pizza. We tried the location at Navy Pier and the wait was too long so we opted for this location. Definitely a cool ambiance. There was a wait here too but they have a to go or lunch special section. So we ordered from the lunch special. The food came up quickly which let me know parts of this pizza was prefabricated. In hindsight we probably shouldn't have ordered the QUICK lunch special. The pizza was just average and the crust was super crumbly. If you need quick do the lunch special. If you want an enjoyable Chicago pizza dining experience this isn't it.", "pics": null}}, {"review": {"des": "During a recent visit to Chicago (my first!) I had to try some traditional deep dish pizza. And Gino's East was a great option in a high-trafficked area where I was already doing some shopping and sightseeing. <br><br>I got a great booth table in the back room downstairs and had the best server ever! She really guided the experience and took care of the table. Since the deep dish pizzas take about 45 minutes to make, there was beer and some garlic breadstick appetizers to tide things over. Also, tradition at the restaurant has everyone \"sign the wall,\" which is a fun way to make the meal even more personal.<br><br>Once the deep dish pizza arrived, it was served as if it was a ceremony...and she was very patient and excited to help with some Instagrammable photos. I'm more a fan of thin crust New York style pizza, but it was fun to try something new. Eating pizza with a fork just seems \"wrong,\" but the sauce was delicious and it was extra cheesy with just the right amount of pepperoni. Of note, the sauce is underneath AND on top of the cheese. <br><br>Overall, the vacation dining experience was awesome, but I'll stick with my local Brooklyn pizzeria. :)", "pics": null}}, {"review": {"des": "Overview: good prices, amazing pizza, nice atmosphere, clean restaurant. <br><br>We got two appetizers and they came out quickly and hot.  The breadsticks and were a bit bland, but came with ranch and a yummy marinara sauce.  We also got mozzarella sticks which were not great but pretty good.  The cheese in the mozzarella sticks was not stringy/melty, but just a glob of somewhat solidified cheese inside breading. The real star was the deep dish pizza. We got the Gino's supreme and the meaty legend. Both were amazing. Tons of cheese, with delicious great quality toppings.  The cheese was perfect- stringy and gooey.  It takes about 45 min minutes to get a deep dish pizza so be prepared to wait but it's well worth it. The atmosphere is a fun bar feel. You are allowed to graffiti on the walls and the walls are filled with all kinds of art and names. The bathrooms are very clean.", "pics": null}}, {"review": {"des": "Definitely an acquired taste. We grew up on thin crust pizza but being out of town tourists decided to try the Deep Dish Pizza. <br><br>Meaty, cheesy, and thick sweet tomato sauce. Light on seasonings but good.  Cool place to try.", "pics": null}}, {"review": {"des": "What a disaster and disappointment! Our party of 3 was sat upstairs where we were greeted by our server. She took our drink orders and immediately warned us if we wanted a deep dish it would take at least an hour (not sure what the norm is but we appreciated the heads up) she brought our drinks back and we ordered breadsticks, calamari and the meat lovers deep dish. It was all down hill from here as our server never stopped in again til the pizza came. Drinks from the bar downstairs took forever and ended up being served warm and watered down to the point we went downstairs to get them ourselves. The bartender was clueless and had no idea what any of the beers were, including the beers brewed by Gino's. The appetizers were pretty good (thank goodness since the pizza was awful but I'll get to that) but the breadsticks came with ranch...how about marinara or Alfredo sauce? <br><br>The place was WAY under staffed, everyone was running around frantically and we even heard a manager yelling at two servers about keeping up with tables that were not sat in their section and to deal with it despite not having enough help but they kept seating people anyways. It took 25 minutes to get extra napkins and straws, not a priority but when you're eating greasy messy food napkins help.<br><br>Finally our server came out with a tray with 3 deep dish pizzas. She ran off to deliver one to a table while we sat there for a good while waiting for ours. She finally made her way to us and you know it's gonna be bad when serving the pizza she says just let me know when you want a manager to come over bc I know this isn't going to be good. The pizza was terrible it was burnt and over cooked but after almost 2 hours we were ready to get the heck out of there so we asked for our check--which included gratuity already-- and got the heck out of there as quick as we could! Is this the norm for Chicago? The booth behind us was equally disappointed in their pizza but they chose to wait for for the manager.<br><br>Overall it was very disappointing as all we wanted was a good deep dish Chicago style pizza and the service was terrible but we felt like there wasn't much our server could do to help. There was a line a decent way down the block of people waiting to be seated and it took everything in me not to tell them to go somewhere else.", "pics": null}}, {"review": {"des": "So we were on our way from STL to Minneapolis and took the long way around thru Chicago with some family who had never been. Of course, we decided to try the legendary Chicago deep dish and where else would we go than Gino's East. It did not disappoint. I am not normally a Chicago style pizza guy so I was ready to be let down but wow!!!!!!!                          This was a TOP 3 pizza in my pizza eating life! We went simple with a medium sausage and pepperoni. We were given the option of having the sausage as a layer instead of crumbled.... no brainer, we took the layer! There was absolutely nothing wrong with this pizza. My bro and I scarfed it down like it was our last meal. (Which, by the way, a slice of this would be on my last meal list!)<br>My wife and sister did not enjoy their thin pizza as much but they made their own choice to not go with the deep dish classic so I'm not knocking Gino's down for that! <br>Glad I don't live in Chicagoland or I'd be at Gino's once a week which would contribute to an early heart attack!<br>Service was great too!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MWC7CTH4dgCSy7PMktI6Dw/348s.jpg", "caption": "Medium Sausage & Pepperoni Deep Dish"}]}}, {"review": {"des": "It's not gonna be long cause there isn't much to say about a place you've been going to your whole life. <br><br>As a native Chicagoan, of course I love deep dish, but Gino's is the best. It is the first deep dish pizza I had. I even took my first steps in front of the restaurant. ICONIC. <br><br>Gino's compares to none other, the history is literally written on the wall. <br><br>Over the years, I've tried a couple of different styles, but spinach and cheese is my standard right now. It's fresh, filling, and fantastic (notice that alliteration???)!!!  <br><br>Anyway...GO!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Hqo7nNgZ_IqLZP3_NPAQiA/348s.jpg", "caption": "OG Gino's East entrance"}]}}, {"review": {"des": "My favorite deep dish pizza! I have been to this location a few times and I never leave disappointed! The inside is covered in past guests signatures. Leave your mark during your visit on the walls, chairs and tables! The deep dish pizza is delicious! The wait time is 45 minutes so I recommend putting that order in first! The legend pizza is perfect for meat lovers! The nachos with brisket is also to die for!! Mmm! You will not leave this place empty! The servers are friendly and very helpful in navigating through the menu! Sit out on their patio during a nice day or inside in the air conditioned restaurant!", "pics": null}}, {"review": {"des": "Amazing time in your locale with excellent service and food was super delicious.  I had not been here in over 25 years and I don't know why.  Your pizza was superb. We had to wait about 30 minutes for thick style pizza and we ordered the supreme one.  It had the works and all of the love a team in a kitchen could only achieve with everyone heart.  Thank you Michelle our server for being super attentive and boy you work hard for her money;)", "pics": null}}, {"review": {"des": "Define Deep Dish Pizza = Gino's East! I discovered this place while watching Man v Food and I decided that if ever I go to Chicago, this will be my top places eat. Well, we did and my girl & I enjoyed it a lot! What I can I say the ambiance looks like an urban band room with bunch of artsy graffitis on the wall. On the 2nd floor next the restroom, you would see a hall of celebrity pictures, including my boy Adam Richman. The place just looks awesome to chill with friends while getting food comma. The servers are really nice, especially the lady from Fresno; she recommended us what beverage to pair up with their pizzas. Anyway... deep dish here we go....<br><br>Just like any other pizza joint, deep dish pizza takes awhile to baked. So my girl and I ordered our beers.. Heles for me and an IPA for my lady. Both drinks are refreshing! We ordered their homemade mozzarella sticks for an appetizer. \"Damn, that is the best cheese sticks that I ever had\" coming from my girlfriend.The mozzarella sticks are battered to perfection; crunchy on the outside and gooey cheesy inside. Their marinara sauce is to die for.. wow if you dare me to chug that, mann I will without any hesitation. That's how awesome is their sauce; it has this chunky texture in to it with every dip. I agreed with my girl a 100%. The fun part is we were next to the bar and one of their TV is playing bunch of funny compilations (I don't remember the channel). Great idea to passed time while waiting our deep dish because it is hilarious. <br><br>After around 45 mins, our deep dish pizza arrived. We just ordered a small one; half meaty legend and half gino's supreme. I honestly cannot tell apart both pizza slices because it was both hearty. They have the similar marinara sauce they used in their dip, which you know it is goooood. Although the meaty legend part have a bacony taste because of the combination of a regular bacon and Canadian bacon with pepperoni and Italian sausage. This is hands down the meatiest pizza that I ever ate. The Gino's supreme slice have mushrooms, onions, and green pepper; you know we gotta mix some organic feeling on it in someway :P Overall, cannot wait to be back here again :)<br><br>PS: I suggest do a half and half for first timers so you can taste different deep dish flavor", "pics": null}}, {"review": {"des": "Deep Dish Pizza! Took about 45 min to cook the pizza. Got half Chicago Fire and half Gino's Supreme in small. A small can feed 2 people. The pizza had too much sauce, so it was very soupy, which I'm not used to, but the sauce was good. Mozzarella sticks were great.", "pics": null}}, {"review": {"des": "Came here for my birthday, suggested by a friend. We didn't have to wait to be seated or anything, considering it was the weekend, however one pizza took 50 minutes to make. I knew deep dish took longer but I didn't realize we would be waiting almost a whole hour before the pizza would get there. <br><br>So that made us order an app and some sangria. The sangria was delicious, but obviously expensive. The mozz sticks were good, but I feel as those are hard to mess up. <br><br>Our waiter was ok. Not friendly, not rude. Just there. We only really saw him when he needed to bring stuff to the table. <br><br>Bathrooms are upstairs. Graffiti and other messages all over booths and chairs. It's unique I suppose. <br><br>I'll never go back. There's many other better pizza options.", "pics": null}}, {"review": {"des": "First time here I had the blue cheese and jalapeno pizza, which was good..  Plus to them for showing some originality.  My wife loves the deep dish pizzas, which I could go my while life without, and that is what this place is about.  <br>My second time here and the service is good.  Our man Keith had my Daisy Cutter pale ale at the table in short order.<br><br>Trying the thin crust Chitalian Stallion pizza.  It is quite good.  Just a tiny bit spicy, and full of flavor.<br>We had the Sautéed Brussels sprouts for an appetizer on our second visit.  Its pretty good.  Not as good as i can make in the BBQ but worth it.<br><br>Word to the wise here.  Thick crust pizza is a 45 min wait, which is a trial to me, since i dont value it at all.  After all the waiting, we had a decent meal though, so it was a good experience", "pics": null}}, {"review": {"des": "Gino's never disappoints. The last time I was here I just got the cheese deep dish. This time I got the meaty legend and it def lived up to its name. So much meat, it was amazing. Be prepared to wait at least 45 mins to get your pizza but the wait is worth it!!!", "pics": null}}, {"review": {"des": "This was my first time coming to this place. I wanted Chicago deep dish, but I wanted to it right for the first time. This place was recommended by a few people. The place was not that crowded, so being seated was not a hassle. The waitress was attentive and friendly, told us the specials and served to our every need. The prices were fair, and the beer was nice and cold. I do enjoy the years of graffiti along the wall; my fiancé and I couldn't resist but to put out initials on the wall. <br>The pizza itself was a delicious event. The server came by, dish and all, cut up our pieces and showed us the cheesiness of it all. The sauce was sweet, the meat was nicely spiced, and the crust was nice and thick at the edges. The pizza was breath taking, and I probably had more slices than clinically necessary. I'm telling everyone about this place. #deepaf", "pics": null}}, {"review": {"des": "We came to Gino's East for lunch on a Friday afternoon with a group of six. The atmosphere is very fun/cool with white hand written graffiti all over the black walls throughout the restaurant. Gino's East Deep AF slogan adorns the walls as well as the back of the servers' shirts. One of my friends and myself arrived early while we waited for the rest of our party but we were seated immediately in a large booth upstairs. The server told us deep dish Chicago style pizzas take 45 minutes or more to cook and advised us that it might be better to order now while we waited for the rest of our group. We ordered a large Gino's supreme deep dish, with pepperoni, Italian sausage, green peppers, mushrooms, and onions. A large pizza was about $30 with about 8 pieces. Each person ate about two pieces so it was around $7.50 a piece, not a bad deal and deep dish Chicago style pizza is super filling so one to two pieces is all you need. We also ordered an appetizer of garlic pancetta brussel sprouts which were very tasty and another small pizza for our group and we had plenty of food left over. The pizza itself was very tasty, the crust, yellow, perhaps from a cornmeal ingredient, but was extremely crumbly and pie crust-like in consistency. The pizza was very saucy and not as cheesy as Giordano's. I was expecting a more significant cheese-pull. The pizza is very much a pie or pizza casserole dish, knife and fork worthy.<br>The service was spotty thoughout the entire visit. It took a considerable length of time before we initially were waited on. Once seated, we were seldomly checked on, and it took even longer to receive our checks. The food itself was tasty but service could definitely be improved upon, especially because most of the restaurant was empty and wasn't too busy.", "pics": null}}, {"review": {"des": "Such a great spot for really great pizza! They tell you upfront that the dee dish pizza can take any where from 45- 60 minutes to cook. Well worth the wait. Also, they brew some of their own beer which is delicious!", "pics": null}}, {"review": {"des": "Really really AVERAGE food. Came with my family and we ordered a large deep dish, family style caesar salad, sampler app platter, and chicken alfredo pasta. Note that we came at 6pm on a Saturday and they were out of wings :( The deep dish pizza takes over 40 minutes to bake so if you come hungry, ordering a starter is a must. The chicken alfredo pasta was the worst - sauce was not very flavorful, pasta was overcooked, portion was small for the price (you could get much better value and quality in comparable places in the area). I could make better at home with a jar of pre-made sauce. The sampler platter was a nice choice for a large group. All the items tasted fine and their mozzarella sticks with spinach was the most unique part of the platter. Caesar salad was solid and probably the best part of the meal, but again something I could replicate at home. The pizza came out nice and hot with lots of melty cheese. The crust a little crisp and fluffy but the sauce didn't come through much. No one part of the pizza flavor stood out and so overall it was just an average pizza. I expected more pizzazz out of a relatively well known Chicago deep dish chain place in Chicago. This is not a place where I would want to come back to spend my money with all the variety of restaurant and deep dish pizza joints in the city. Honestly, I'd probably go to Blaze a couple blocks away if I was craving pizza in this area or go to Pequods if I want quality deep dish.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/t3pKM_uaRZ8OtMkM_C5ndQ/348s.jpg", "caption": "Sampler platter"}]}}, {"review": {"des": "While the pizza has always consistently been good through the ages, it's their partnership with the delivery service at this location that is upsetting and lackluster. <br><br>We were celebrating my daughter's birthday in the city, staying at a hotel nearby, and decided to order in.  Our original order was a large pizza, SQUARE CUT, a 20oz Coke, and a 1.5L water.  The total came out to right around $40 (yea I know, steep for a cheese pizza, but it's the city).  The pizza arrived 1.5 hours later.  It was pie-cut, and there was no water.  Great.  I would have let it go if it was just the cut style issue.  But you forgot a component of the order.  So I called them (the delivery service) and explained the situation.  I said we can call it even if, when the driver comes back with the water, that they can throw in an order of spinach cheese sticks.  They agreed.  The driver showed up about 20 minutes later,  with the water, and just PLAIN cheese sticks.<br><br>This may make me sound like a diva...but here's my angle: if you offer your customers a choice, deliver what they ask.  It's just really not that hard.  Whether this was a Gino's issue or the delivery service, someone came up short.  And being in the city, charging the prices you do, there's really no excuse.", "pics": null}}, {"review": {"des": "Gino's east is the original deep dish pizza along with Uno's.<br>Gino's is the pizza in the beginning I grew up with but unfortunately none of the originals are around anymore and they were all copied duplicates of what was once authentic. <br>The graffiti on the walls the red booths the autographs and photos and the Vintage ambiance.<br>Owned originally by Italian men it is now owned by a corporation.<br>I came here to eat today and I don't remember the sauce on the pizza being SO sweet<br> I was really unhappy!<br>REALLY UNHAPPY!!<br>And disappointed.<br>When I ate at the big Gino's restaurant on Ontario about 5 years ago I don't remember the pizza sauce being sweet.<br>Maybe it was a bad batch maybe a bag of sugar fell in the pot of sauce <br>maybe they change the recipe but whatever it is if it continues to taste like this unfortunately I will never be back.<br>Giordano's Rocks but the dough is better at Gino's.", "pics": null}}, {"review": {"des": "Last night in Chicago, too tired from walking so we ordered this for delivery. It took them a good hour and half to get to our hotel. I ordered a mushroom deep dish pizza and an order of garlic bread sticks. Pizza came hot but I felt they were very skimpy on the mushrooms. Crust was dried and hard, i didn't really like the pizza. The garlic bread sticks were very tasty but had a dried texture to it.<br><br>Overall it was meh, and very expensive. $40ish plus tip for 2 items.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4WllwQ9ckBOtVVyABj4f_A/348s.jpg", "caption": "Garlic bread sticks"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bU5T7HXAEuBXAtzHmSC3Dg/168s.jpg", "caption": "Mushroom deep dish pizza"}]}}, {"review": {"des": "Not bad. Not quite as good as Giorando's, IMHO, but not bad.<br><br>1.  I ordered the \"Deep AF\" pizza, paid the upcharge, and was surprised to see that my pizza was no deeper than anyone else's.  Unless we were going deep af that night, I think they gave us normal pie. <br><br>2.  The flavors were mostly good, for me, but the sausage patty + the normal sauce resulted in a pizza that was quite a bit more salty than I expected.  And I usually love salt.  That night, however, I appreciated my friend's supreme pizza more because the flavors were balanced.  <br><br>3.  I do think I'd go back.  The cheese was good and the crust was fine (though not deep af). I appreciated the service.  I just won't order the sausage again :)", "pics": null}}, {"review": {"des": "This is my favorite deep dish pizza in America! The crust seems sweeter and thicker and tastier than any other. The pizza with all the meats is incredible - there are so many tastes but it's not too rich. After sharing a medium deep dish pizza with my friend, I did not feel too stuffed. Just beware deep dish takes 45min to get ready so you'll be sitting around for a while waiting. However it's totally worth it - especially if you sit outside on the street!", "pics": null}}, {"review": {"des": "I recently visited my hometown Chicago after a 40-year hiatus.  My college friends and I used to go to movies downtown and then head for Gino's to eat a deep dish Supreme pizza and share a pitcher of beer.  It was a ritual.<br><br>Back then in the late 1960s, Gino's was a much smaller basement restaurant with high backed booths.  The pizza was great; nice spices and really filling.  I knew there would be changes to one of my favorite places, but I didn't expect what I saw last week.<br><br>When my fellow travelers and I arrived, the revolving door tipped me off that the Gino's East I knew no longer existed.  No basement entrance, two floors, an elevator, noisy.  OK, I'm a lot older now; things change.<br><br>But $35 for that excuse for a deep dish pizza?  Get out!  Nothing like the old Supreme deep dish.  Not as dense, not nearly as tasty.  Yikes.<br><br>So if you like Gino's in its current state, go for it.  But when I return to Chicago, it won't be on my itinerary.  In my humble opinion, it's a far cry from the genuinely wonderful joint I knew and loved.", "pics": null}}, {"review": {"des": "Tried several of their craft beers which were very good.  We ordered 2 deep dish pizzas which was fairly priced and very filling for 4 adults.", "pics": null}}, {"review": {"des": "Been there twice. Once in 2014, and once last week. Well, actually only once to this location, but the food was exactly the same both times, so this being the most recent location, I'm reviewing this one. I'm from Washington state, and so when I'm in Chicago with friends, they always want to try it, and both times we were disappointed. First, the positive: the garlic breadsticks are the best things ever. If you get those and drinks, then it's worth it. Now the negative: the pizza just isn't good. Overpriced, and even if you like all that sauce, which is the style, I guess, the crust ruins it. Hard, crumbly, and flavorless. Do you want to keep your teeth? Skip the crust then. Second time was as gross and hard as I remembered it being the first time I tried it. It's shocking that people actually eat it, tbh, and you'll leave hating yourself for getting so uncomfortable full and sick feeling from just one slice, and leaving the rest of it despite the $$$. The waiters are nice, though, so there's that. Our hostesses were not nice, and really shouldn't have been working in the service industry. It was crowded (read, touristy) and the long wait wasn't worth it in a city with so many better options. You've been warned.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hFAW-myHm3_OY7FxVsqz9w/348s.jpg", "caption": "What a waste. One slice each was too much, and the crust is nasty."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bM6NbrXy6B1pqBscxxSVkg/168s.jpg", "caption": "Garlic breadsticks are the best thing here. They're delicious, soft and hot. Get them instead of the pizza."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/c6DDUrtLxx-VWYCNQiEcpQ/168s.jpg", "caption": "Raspberry basil lemonade from the bar was good (I can't recall what kind of alcohol it was)."}]}}, {"review": {"des": "NO thin crust pizza!  <br>We so went based on the Yelp pictures of a beautiful thin crust ... but nope!  They do not have thin pizza! When our Pizza  was  delivered it I reiterated that I ordered a thin crust pizza to no avail... <br> I expressed my concern and discontent to the waitress... Who didn't seem to care at all!  Will nit gi back!", "pics": null}}, {"review": {"des": "Overall: At this location, great pizza is marred by long waits for lines, service, preparation, and subpar atmosphere. <br><br>The good: The main attraction, which is the pizza, is actually very tasty. Right up there with the other big names, in a good way. The ratio of sauce, crust, and cheese is even and not overwhelming.They have a huge menu for those who don't want deep dish (but cmon). There is a ton of seating available, and the decor is fun. The waitresses themselves were nice.<br><br>The not-so-good: The place was freezing. We all had our jackets on, and we asked the waitress to turn down the AC and they did...for awhile. Then it came back on again. The appetizers took 40 minutes to come out (while we waited for our hour-long wait for pizza). The initial menu-order process was quite delayed before we finally put in our order. The calamari app. was pretty lackluster, cold and chewy.<br><br>Atmosphere: 7/10<br>Service: 7/10<br>Food: 8/10", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0Dz4CzbtwzvX3TYLe28W9w/348s.jpg", "caption": "Spinach slice"}]}}, {"review": {"des": "Visited Gino's for the 1st time on a Saturday nite! Probably not the smartest idea...lol. <br><br>The wait was about 20 minutes, OUTSIDE. Now I know how the non-VIPs feel waiting in line outside of the club. Literally, the only thing missing was the velvet rope and the suited goons at the door. <br><br>Once 15 minutes was up, we were moved inside to wait another 5 minutes. There were tons of people waiting inside. It was like magic...not sure how they knew who was next, but they did. <br><br>The decor was interesting, talk about the writing on the wall.<br><br>Once we were seated our very nice waiter immediately informed us that the wait for deep dish was 1 hour and 45 minutes for regular. We were able to put our pizza order in immediately. Then he returned and took the remainder of our order. <br><br>Pizza: we ordered Medium (6 slices) 1/2 Meaty Legend, and 1/2 veggie. Pizza arrived in less than an hour and was piping hot. The server set us up with our first pieces. The pizza was good. Not the best deep dish I have ever tasted but good none the less. It was cheesy, the crust was crispy and it definitely wasn't dry. Had a bit too much sauce for my taste.<br><br>Caeser salad: was good. Shared between 2 people. <br><br>They have a full bar. My friend raved about the Pineapple Imposter beer, and had a few glasses. I kept it simple with the Italian Pink Lemonade made with Titos instead if Belve. Lemonade was super sweet and I could taste no liquor.<br><br>*Would I return to Ginos? Absolutely! <br>*Would it be on a Saturday night? Nope.<br>*Will I be watching future games there on their many, many flat screens? YES!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hmF8yxWgWFEN-3QS1FwrRQ/168s.jpg", "caption": "Pineapple Imposter"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gvcFr91ohFk5beNdIBrs7w/168s.jpg", "caption": "Deep dish"}]}}, {"review": {"des": "PARKING - This is in downtown Chicago, so parking isn't always easy. If you can avoid, try to walk here. <br><br>SERVICE - We were seated immediately. Our server was friendly. As expected, we had to wait for our pizza. <br><br>FOOD - Being from Chicago, I've had a lot of deep dish pizza. While I usually avoid chains for deep dish, I'd break that rule for Gino's any day. It's one of my favorite places for deep dish (especially downtown). We ordered the Spinach Margherita and it was absolutely delicious. The crust was crispy, the sauce was flavorful, and there was just enough cheese. I'm happy I made a point to stop in here before I moved. <br><br>Overall, don't waste your time going to other famous deep dish chains. If you're downtown, head to Gino's. And if you love it that much, you can ship it yourself.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/r50zY5aWr9uRtzzZwl06HQ/348s.jpg", "caption": "spinach margherita"}]}}, {"review": {"des": "I ordered pizza at this establishment yesterday and was surprised at how bad it tasted. I love pizza and have eaten at many parlors throughout the city. This place was by far the most disappointing.", "pics": null}}, {"review": {"des": "I saw the waiter drop bread on the floor pick it up and put it back on the plate and serve it to a table... I must say our waiter was awesome his name was umberto... y", "pics": null}}, {"review": {"des": "I usually go to Giordano's, but I have to admit that Gino's East does a way better crust. We ordered the Chicago Fire pizza, and it was good but not spicy at all. The sausage layer was interesting (I'd prefer if it was crumbled), and there was plenty of cheese. When the pizza first came out, I was a bit weirded out because the top of the pizza looked so soupy and watery, but the juices settled into the pizza and the taste wasn't affected at all. Giordano's will always be my number one, but Gino's East is a safe second.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ATwb47tKYPw9ZTxNjPwCSA/168s.jpg", "caption": "Yes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sLAVuRK27_RQXamY52bRBA/168s.jpg", "caption": "Chicago Fire with jalapeno"}]}}, {"review": {"des": "I ordered take-out so my review is based on that. <br>Ordered the Gino's supreme, minus the peppers, and I gotta say it was delicious. The only downside of the the experience is the wait time... I get that the pizzas are made to order, and I love that! I just don't wanna wait... I ordered around 1-ish on a Monday and I had to wait 45 mins. It wasn't even THAT busy. I can imagine, if it was. Luckily there are a lot of shops around to kill some time. <br>I will say this the deep dish there is good and was still good 3 days later. Definitely worth a stop if you're in the Chicago area.", "pics": null}}, {"review": {"des": "I have been going to Gino's for several years.  The sausage deep dish is excellent.  I give Gino's the slight end over Giordano's for taste.  It caters to a massive tourist crowd, so be prepared to wait an hour for your pie.  That being said, hitting Gino's, Giordano's or Lou Malnati's is essential to a trip to Chicago for my family.", "pics": null}}, {"review": {"des": "Yesterday was the first time I visiting the Original Gino's East with my parents, but I have had Gino's East pizza many times since I am a local Chicagoan. Like most of the other locations, you can write on the walls and make your own marks. Since this was the original, there was not much space to write anything. No worries because I don't really care about making my mark and I came here for the pizza. <br><br>As always I ordered the Meaty Legend as it is a favorite for myself and my Dad! The pizza was hot and fresh and the toppings were solid as always. The sauce was a little bit more wet than I am used to and it made a mess as the pizza fell apart. I thought the sauce was a little bit more chunky at other places, which makes the pizza easier to eat. My Mom ordered the salad and mozzarella sticks. She loves(ed) their salad, but the mozzarella sticks were definitely sitting around for a while as they were cool and the \"cheese pull\" was non-existent. So overall, food was probably a 3.<br><br>Like I have said in other reviews out of the big three; IMO Lou Malnati's has the best pizza overall due to it's crust, sauce, and toppings. Gino's has the 2nd best crust, but third best sauce and toppings. I have seriously created a diagram of the Big 3 (Gino's, Lou's, and Giordano's) ranking their crust, sauce, and toppings. <br><br>Our service wasn't great. Our waitress rarely stopped by, forgot to place our 2nd beer orders, and it wasn't even busy for a Thursday night. The place was also pretty cold and I think the AC was still on and it's October in Chicago. Granted it has been a warm October, but still it was high 50's low 60s outside. Service was probably a 2. <br><br>Overall, this was my least favorite Gino's experience. It was average at best. I thought the pizza and service was a lot better at their River North (Brewpub) and Libertyville locations. I think I still prefer Gino's East over Giordano's just because of the Meaty Legend and I like their crust better. If you're a tourist, I would recommend going to Lou's, another location of Gino's, or Pequods/Art of Pizza.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hPVoZ0yaEwpq4Oaz0vXxqQ/348s.jpg", "caption": "The Meaty Legend"}]}}, {"review": {"des": "It is a big restaurant so there was no wait for us. I guess I was personally expecting a deeper dish type of pizza it was but it was tasty.", "pics": null}}, {"review": {"des": "A really nice place and really great service at the bar, the home brewed beers were nice. <br>We started with some wings and they were pretty good. However, we wanted to try the deep dish, indeed that was the reason for going.<br>It was my first deep dish experience and so can not compare, though overall I wouldn't say that I'd be craving to have it any time again soon. It was the meat feast option, and didn't really have much of a culinary impact on me. I was expecting something delicious without really having an idea of what it actually is, except a pizza-type tray with thicker crust and more layering of sauce. While the proportion of crust and sauce is different to your ordinary pizza, there was nothing flavor-wise to write home about. The rating is for my experience of this local 'classic' rather than the place per se, I understand Gino's is a popular haunt. <br>If I'm back maybe I'll try a pizza, they looked pretty good...", "pics": null}}, {"review": {"des": "Deep dish was worth the wait (we went with sausage patty and mushroom); definitely better eaten on-site (warming up leftovers could not replicate the flavors).  My kids want to go back for the hamburger and fries pizza; they saw a nearby table order.", "pics": null}}, {"review": {"des": "me and my wife ordered the medium size pan pizza. By far, this was very delicious.  I will be back and order that same pizza.", "pics": null}}, {"review": {"des": "The interior of this Gino's East is absolutely huge. The extra seating and spaces means that it's not bad for a wait usually - I haven't had to wait yet having come a few different times during the day. Interior is dark, and has a sports bar-y vibe, except for the graffiti decoration all over the place. Service is extremely attentive and friendly. <br><br>The deep dish takes 30-45 minutes to come out - my best bet has usually been to call ahead. Serving sizes are huge, so if the menu tells you it serves n I would take it to mean n-1 or even n-2. The small pizza we ordered probably serviced closer to 3-4 than 2-3. Pizzas come pretty deep, and loaded with whatever filling you ordered. Staff bring it to you and serve up the first slices for you. There's a huge layer of cheese, and the crust is buttery and not overwhelming.<br><br>The rest of the menu is typical American / bar type fare - mozzarella sticks, wings, and the cursory salad. Full beer menu as well, very reasonably priced.<br><br>Absolutely a must try.", "pics": null}}, {"review": {"des": "The deep dish at Gino's East is the stuff of dreams. My friend and I came here as part of our girl's weekend in Chicago and I highly recommend coming for dinner! The owner showed us to our table and was extremely personable. <br><br>It was exciting to learn from our sever that Gino's East helps fundraise for the local children's hospital, Ann & Robert H. Lurie Children's Hospital of Chicago. This made the pizza taste even better!<br><br>Expect to wait for a table and wait for your food, but be patient. Relax and enjoy the company at your table and before you know it, you'll have the most decadent pizza in front of you. <br><br>We tried the spinach deep dish and it was cooked perfectly. We even had leftovers that kept well in our hotel room refrigerator. Eating it the next day? It's amazing even when served cold.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KPpd-iVufKmvmH2juDX_Cw/348s.jpg", "caption": "The spinach deep dish pizza at Gino's East in Chicago."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/92W8BNpusr7nBorBmFJhbA/168s.jpg", "caption": "Up close and personal with a spinach deep dish pizza at Gino's East in Chicago."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/F2-FWWHCaV5fZnhOaAD85Q/168s.jpg", "caption": "Gino's East is the perfect place to kick-off a girl's weekend in Chicago!"}]}}, {"review": {"des": "It wasn't as intimidating and crowded as Giordano's. There's graffiti all over the walls and I'm not sure why. They did have a personal pizza with a side order and a drink for less than $10! The restrooms were pretty clean and the staff were really friendly. The wait was not long and they do have personal pizzas which you can order as a lunch special. I personally do not like the deep dish pizza. The crust is flaky and not in a good way. I really don't see the point of deep dish pizza so I'll stick to my thin crust pizza.", "pics": null}}, {"review": {"des": "The best pizza that I have ever had!  Ordered your pizza first!  Delicious and a must try while in Chicago!!", "pics": null}}, {"review": {"des": "The pizza sucks!  Plain and simple. The pizza is a terrible example of Chicago Pizza.  It doesn't hold a candle to Lou Malnati's, or the Original Uno or Duo's, Burts or Peqouds.  The cheese tastes cheap, the sauce is flavorless, and the crust is soggy.<br><br>You want a legit Chicago pizza, don't come here.  Chicagoans certainly don't come here anymore.  You want a touristy shit hole, come here, you will be pleased and you won't clog the lines at the other fine pizza establishments.  <br><br>Once upon a time Gino's was a good spot of pizza, but not anymore. <br>I truthfully don't even know how this place is still even open?", "pics": null}}, {"review": {"des": "We ordered a small pepperoni, onion & green pepper deep dish on our evening walk back from Navy Pier. Our pizza was ready in 20ish minutes.<br><br>This review is based on the pizza only since it was carry-out- but we really enjoyed it! The pizza didn't completely collapse once cut or bitten into and the flavor was on point.<br><br>We would definitely go back!", "pics": null}}, {"review": {"des": "After hanging out all day with family came here for dinner great service pizza and salad was good", "pics": null}}, {"review": {"des": "Visiting Chicago again for the first time in almost 20 years, I knew I wanted one thing:  DEEP DISH PIZZA. I asked my cousins to pick a place and they chose Gino's. I have to admit I was initially skeptical based on some of the reviews, but what a treat this was.  <br><br>Yes, you can expect a line but note that if you are ok with the rooftop patio (which we were), you may be able to skip the line (which we did).  It's a little chilly up there so be prepared with a light sweater or jacket.  The decor is very whimsical with graffiti all over the place, and the patio is a good size.  Between the 4 of us, we ordered the sweet & spicy rub chicken wings (awesome), the spicy kale salad (*beware of the chilis, they have a kick!), and the Eat Your Veggies deep dish pizza (because you have to have your veggies to balance out the deep dish pizza, right?).  This pizza was everything I wanted a deep dish pizza to be, cheesy, hearty, and worth the 45 minute wait (which was already expected and prepared for).  <br><br>Mariah, our server, was the best.  She was super attentive and takes great group photos, by the way.<br><br>Thanks, Gino's, for a delicious slice (and a half) of Chicago!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QanSWBgutaD0CSS6p-2cig/348s.jpg", "caption": "(Half a) You Gotta Eat Your Veggies. The servers cut them up as soon as it arrives at the table so make sure you get your cameras out quick!"}]}}, {"review": {"des": "Gino's was amazing! We came on a Thursday afternoon at about 2 with 10 people. We had a 2 minute wait while they put tables together. Some of our group got drinks and they said they were good! We ordered the breadsticks and Brussel sprouts as appetizers and both were delicious. We got three medium pizzas for the 10 of us to share and it was more than enough. The Italian Chi was great and had a sweet and spicy taste. The Meaty one was also just as delicious. Be prepared to wait for 45-60 minutes for this delicious deep dish pizza though!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ay5dn-0V2Aqybs8wyKEk5A/348s.jpg", "caption": "AMAZING!"}]}}, {"review": {"des": "When you're in Chicago, you have to eat some of what Chicago is famous for, and that's Deep Dish Pizza!  My daughter lives here full time, so I instructed her to take me to the best place in the city.  Gino's East, was her choice, and it disappoint!<br><br>We ordered a \"build your own pizza\" - sliced tomatoes, red onion and green pepper! <br><br>The pie was absolutely amazing! <br><br>But even more awesome was just the total atmosphere, from the customer graffitied walls, to the fun and attentive wait staff to the overall vibe!  I'd recommend Gino's East to anyone visiting the Windy City!  Simply fantastic!", "pics": null}}, {"review": {"des": "Let me start this review by saying that I have been a fan of Gino's East for over 30 years. However, with my last visit, while the pizza was still very good, it wasn't quite the same as I remember. The sausage still had the familiar taste and the cheese gooey as ever. However, the sauce had a sweeter taste than I remember and the crust wasn't as flavorful as in the past. As I mentioned, very good but not worth a special trip.", "pics": null}}, {"review": {"des": "This was our first time trying a Chicago style pizza and it was great! I could only eat one slice because the pizza is very filling. They also have a great selection of appetizers and drinks, which come in handy because it takes about 45 to get your pizza. Definitely a good place to go if visiting Chicago.", "pics": null}}, {"review": {"des": "Gino's East opened in '66.  I've probably been coming here since 86'.  Today my wife and I brought our daughter here for the first time.  Many times there is a line to get in, but not today.  There was a good crowd, but no wait, I'm guessing the restaurant was 80% full.<br><br>The place was exactly how I remembered it, the walls are lined with photos of famous people and there is graffiti everywhere.   We had a deep dish, cheese pizza.  The sauce is a little sweeter than I prefer, but overall, the pizza is pretty darn good.  <br><br>I give this place 4 stars, but 1 star might be for nostalgic reasons.", "pics": null}}, {"review": {"des": "to be perfectly honest. this place is very overrated.  and to wait for a mediocre at best pizza for an hour is not worth it.  i felt like we were eating a pizza cake.<br>not impressed.", "pics": null}}, {"review": {"des": "I've gone to Gino's East (on Superior) every time I visit Chicago, and I always leave full and happy. This weekend I brought a group of 8 people with me, sans reservations, and we waited less than 10 minutes for a table - I was very impressed with this since it was a busy Saturday night. Some of the best pizza I've ever had.", "pics": null}}, {"review": {"des": "Honestly, as good of a pizza as pizza can be. The cornmeal crust is out of this world. We had the deep dish. The sauce was rich tomato garlic herb whatever - fantastic. We were seated right away and waited patiently for that perfect pie. <br><br>I highly recommend this deep dish pizza.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rFPUubyK2T_MZeHAPJGYlg/348s.jpg", "caption": "Supreme plus bacon! Yum!"}]}}, {"review": {"des": "Tourists trap.  If you've never had pizza i guess you might think this was good.   Seriously bland, dough  subpar, sauce canned.", "pics": null}}, {"review": {"des": "This is my favorite pizza place in all of Chicago. <br><br>They do sometimes have long lines and longer waits, but the restaurant is huge (go upstairs!) and you can eat at the bar. They usually work through the crowd pretty quickly!<br><br>The staff are friendly and the menu has a lot of different items...but the pizza. Oh the pizza. <br><br>It takes about 45 minutes for them to make a deep dish pizza so make sure you order an appetizer and a drink and relax while your glorious pizza is being made by these pizza professionals. <br><br>That deep dish pizza is overwhelming. It is extremely good, hot, delicious, and filled with your choice of items, sauce, and cheese. I don't know how they do it, but the pizza is always outstanding...hot and fresh and juicy. The pizza is a meal onto itself. <br><br>The staff are super friendly. They really go out of their way to help you and make sure you have a good experience.<br><br>They have a full bar and have several good local beers on tap. <br><br>Try em. You will love it!", "pics": null}}, {"review": {"des": "We loved our pizzas at Gino's East. We got a thin crust supreme and added sausage and spinach. It was really really good. Loved the flavor of all the toppings, and the crust was perfect. We also got a deep dish meats pizza which had Canadian bacon, pepperoni, and sausage and probably more meats that I can't remember. The deep dish was actually great. I'm usually a thin crust fan, but this tasted awesome. And the crust reminded me more of a biscuit which was great. With as much meat as was on that pizza, the thick biscuit-like crust was definitely needed to balance it all out. The waiter was really helpful and nice as well. Overall, we had a nice dinner and would definitely come back!", "pics": null}}, {"review": {"des": "Oh if this isn't the best deep dish pizza I have ever had! I loved it and the ingredients tasted so fresh. The server was very pleasant and made sure we were taken care of the entire time!", "pics": null}}, {"review": {"des": "OK I'm a New Yorker and we can gripe with the best of them. <br><br>I grew up on that thin crust pizza that you could fold in two and eat out of hand, with the grease and cheese and tomato sauce dripping out the back, spicy with pepperoni when you had an extra dollar, sprinkled with a hit of red pepper flakes if you like the heat (and as a Goddess of Fire, I do, I do).<br><br>The Large Deep Crumbled Supreme had a deep shell of puffy crust, light, tasty - that was the best part (mushrooms, onions, green peppers with sausage [or pepperoni] - $32). It self destructed. I needed a fork and a knife and a bunch of napkins in my fight back. This \"pie\" had a kiddie pool of sauce in it - really liquidy, with no spice to speak of, and, if you were lucky, you found yourself a piece of flavorless sausage. <br><br>Maybe New Yorkers are cheapskates, too, but I didn't think it worth the price. Yeah, it was OK, but I expected better.<br><br>This is NOT the first \"Chicago\" style pizza in my life. But it might be the last.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IlK57_awgmQHt1m2V5gf3A/348s.jpg", "caption": "Goopy deep dish pizxa"}]}}, {"review": {"des": "Our waitress, Elizabeth, was truly amazing! She was so helpful and sweet! A great ending to our trip out here!!!<br><br>Our pizza was great! The bread itself tasted divine, I hate that I didnt have room to eat a lot.... ate too much of the great mozzarella sticks and buffalo wings.", "pics": null}}, {"review": {"des": "Wow! I don't care how long the wait is. This place is definitely worth it. We stood in line around the corner for over an hour and then waited another 45 minutes or so once we ordered but let me tell you, the pizza was delicious and I would wait that long again. Loved it!", "pics": null}}, {"review": {"des": "Before eating at this Gino's we used to visit the location in Rosemont. It was a nice spot to grab a sandwich, pasta or the pizza they are well known for. <br><br>On a wet rainy night we stumbled upon this location when taking our daughter to meet a college admissions counselor. Her favorite Gino's dish is their fettucine alfredo, so where we were going to have dinner was a no-brainer.<br><br>The atmosphere is nice, though when I went upstairs to use the restroom I decided that the upstairs is a bit cozier and not so overwhelming as the downstairs with it's more open space and all the writing on everything. It had more of an Italian eaterie feel to it.<br><br>So all three of us chose to get something besides their pizza and this may have been our first mistake since almost everyone around us had pizza. I got the chicken parmesan sandwich which came with fries. The fries were decent, but there wasn't anything spectacular about the sandwich...the sauce was boring and it wasn't very cheesy.<br><br>My husband got the spiralized veggie pasta and it had very good flavor, but there wasn't a lot of it. I think he was still hungry after eating.  Our daughter got their alfredo and it was not the same alfredo sauce she's had at the Gino's in Rosemont and Libertyville. It had a funny after taste too it. <br><br>The best thing that I had was the hard rootbeer that I had. Rowdy Rootbeer from Berghoff Brewery. <br><br>As I said, we probably should have stuck with the pizza, or maybe the wings...if they ever add a garlic parmesan variety to the menu. <br><br>Family time was nice and our waitress was sweet and professional!", "pics": null}}, {"review": {"des": "Waited almost an hour to get a $30 pizza (a Weds night that wasn't even busy) that was served only lukewarm at best. Waitress must've let it sit at least 25 minutes after it came out of the oven although she made a big display of how hot the pan was. 5 minutes after we eagerly ate our first piece (starving from the wait) and cut our own for a second round, the pan was not even slightly hot. We held it as we cut seconds. See the picture? She couldn't even cut it properly. Come on people. Do us all a favor and go work at a car wash.  Really disappointed.", "pics": null}}, {"review": {"des": "Fabulous customer service and even better pizza! We go a half and half medium deep dish of meaty pizza on one side and supreme on the other. <br><br>I love the walls, furniture and bars of signatures of past guests.", "pics": null}}, {"review": {"des": "I've been wanting to try the real deal Chicago Deep Dish Pizza for years. The stars finally aligned for me when visiting my mom in Wisconsin and one of my old Army buds running the Rock N Roll Half Marathon in Chicago.<br><br>We went right in at 11 am (there was already a line forming outside the door) but were seated quickly. We got the mozzarella sticks and crispy brussel sprouts as appetizers (almost required with an hour wait for deep dish pizza). The sprouts were OK but the sticks were absolutely fantastic. Crispy and delicious with marinara and ranch dipping sauces. Really really good. The star of the show finally came about 45 minutes later. I was not disappointed. The pizza was heavy with ingredients and the buttery cornmeal crust complimented by the tangy sauce. I might have to get these shipped to me in the future. Service was excellent. Our server was outgoing, funny and attentive. All the boxes were checked for me. <br><br>The only thing that sucks about Gino's is the closest one to me is in Phoenix, AZ. Everything else is highly recommended for me. Definitely a must visit if you're in Chicago. <br><br>TIP: I brought three pizzas home for my family (about a three hour drive). At the carryout counter ask for the pizza to be half baked and wrapped. It's about a 45 minute wait (since they have to cool before they get wrapped) but when you get the pizzas home, a good thirty minutes in the oven at a high temp and it's the closest you'll get to a fresh Gino's pizza.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dBlObDZAGLQ6ChsWjjKzUQ/348s.jpg", "caption": "Initial entrance at Gino's. Carryout in front with three floors worth of seating"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lXcrRnotnBJ0WGU-0N1jsA/168s.jpg", "caption": "Brought a large Meaty Legend home."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EYCxU_fxhp8beOwxMQO_gA/168s.jpg", "caption": "Legendary Deep Dish Pizza."}]}}, {"review": {"des": "This location, the original for the chain, was opened in 1966. It doesn't feel much like it, however--I was expecting something a little more timeless, but it looks like pretty much any newer, casual restaurant, with tall ceilings and a loud ambiance.  The volume is a bit much--with the floors, walls, and ceilings all being hard surfaces, sound really bounces around the place.  Even with the place half crowded, my wife and I had a hard time hearing each other across the table. <br><br>Of course, you don't really come to Gino's East for a quiet and romantic dinner.  From the loud environment to the graffiti-covered walls to the TVs showing sports, this is a place for a casual bite.  The food does not disappoint. Our deep dish pizza was delicious. The sauce is a little sweeter than some other Chicago pizzerias, we thought, and we liked it. The crust was perfect. <br><br>Service was a little dicey.  Our server wanderws around a bit aimlessly, and he seemed uncertain what to do.  We ordered drinks and waited quite a long time for them to be delivered, even though I could see them waiting on the bar.  And the bar ran out of tonic. (What bar runs out of a staple like tonic?!) <br><br>Being a block off the Magnificient Mile, this is a welcome come-as-you-are place without any pretensions and with good Chicago-style pizza. Expect a wait!", "pics": null}}, {"review": {"des": "I'd give it 6 stars but I can't eat another bite...<br><br>Had the small Gino's supreme deep dish, which is apparently Chicagoese for \"pizza soup in a bread bowl.\"  It's more than enough for one person, but manageable if you're super hungry by yourself.  Being a big fan of tomatoes, the sauce really did it for me.  The glorious layer of cheese underneath it gives you a reasonable amount of time to eat the slice before the sauce turns the crispy crust into a soggy puddle.<br><br>While you wait the requisite 45 minutes for your pizza, there's graffiti all over every wall, chair, banister, etc. and it's pretty neat to look at.  There's surprisingly few drawings of sausages or mushrooms, which is a good thing.  I don't think I saw any, actually.  I guess everyone prefers theirs Margherita style.<br><br>Anyway, I need to keep this review short because I need a nap now and I might pass out on the keyboard if I try to type any morrrrrrrrrrrrrrrrrrrrrrrrrrrrzzzzZzzZzZZZzzz", "pics": null}}, {"review": {"des": "Our waiter, Bert was SUPER awesome.  Great and personable service.  Food, beer and atmosphere were great!", "pics": null}}, {"review": {"des": "I had been here 20 years ago and had loved the graffiti and pizza and so was keen to come back. The graffiti was the same and the pizza was also really good but I have to say I prefer Lou Malnatis mainly for the crust. <br><br>The pizza was excellent, the marinara sauce delicious and the varieties of toppings you could get was great. <br><br>I didn't like the crust. It was like shortcrust pastry but with cornmeal in it and just far far too much of it. Also, it took an hour to come out when they didn't even have a line in front, while Malnatis had come out in the guaranteed 30 minutes. That was a big issue since we have a 4 and 7 year old who were hungry and kept asking where the pizza was.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UF3MuDOxaphfPEXa_BqcJQ/348s.jpg", "caption": "Bit of graffiti bonding between father and daughter :-)"}]}}, {"review": {"des": "This place has really slid downhill. My family and I used to go here all the time but we won't be coming back anymore. Our server was terrible to say the least. She only came to our table twice for the food and drink orders and never came back to check on us. While she was at the table, she was intentionally brief and seemed really impatient with us even though we all knew exactly what we wanted. I work in the service industry so I'm normally pretty forgiving of hasty service. I understand if a restaurant is busy it can get really stressful and effect performance.  This was a Wednesday at 2PM...the place was dead so there's no excuse to treat your guests in this manner. On top of the bad service our pizza came out cold, I have a suspicion that it was sitting in the kitchen for a while after it was done.", "pics": null}}, {"review": {"des": "The atmosphere here was great, especially upstairs. The pizza was really good but maybe not my favorite of the big local places.", "pics": null}}]}