{"name": "giordanos-chicago-30", "reviews": [{"review": {"des": "My friend took me here, before we went back to the train. Our server was very nice and made us feel welcomed. <br><br>I like this crust...it reminds me of the crust of a pizza shoppe that I used to work at.<br><br>Pepperoni and green olives for life! Loved this cheesy goodness.<br><br>I hear there is a bit of a rivalry between Giordano's and Gino's.. is this true?<br><br>I have now eaten at both and I enjoyed both immensely.", "pics": null}}, {"review": {"des": "Visiting Chicago, I definitely had to try it since everyone talks about it! Deep dish Pizza!!<br>It was actually good. Small portion was more than enough for me.(6 slides)(just ate half).<br>It was really goodo, cheese is amazing! Nice place to visit.", "pics": null}}, {"review": {"des": "Tiffany made my experience of Giordano's amazing! I had never had deep dish pizza before, she explained the menu to me and gave me fantastic recommendations. She then suggested an amazing seasonal beer. She really is an asset to this place. <br><br>The food was great! The pizza lived up to the expectation and the Wisconsin cheese curd was fantastic! I would highly recommend this establishment for genuine deep dish pizza in Chicago!", "pics": null}}, {"review": {"des": "It's not just a pizza restaurant, it's a destination. A must place to visit for anyone visiting Chicago. Cheesy, meaty, crunchy crust. Made to order, it takes at least 40 - 45 minutes to make.<br>Staff are friendly and attentive.", "pics": null}}, {"review": {"des": "Always a must when in Chicago. This is my favorite Chicago pizza place!  Was able to get in fairly quickly and get a seat. If you have never plan be prepared to wait as the deep dish pizza takes longer to cook than normal - but as always, so worth the wait!  Enjoy!", "pics": null}}, {"review": {"des": "I'm sure this is going to be a super unpopular opinion....but I did not enjoy Giordano's. This is probably partially my fault. I ordered the fresh spinach pizza which means the deep dish was filled with cheese and it had a bit of spinach in it. I really wanted more toppings but I wasn't by myself.<br><br>It was super busy so the pizza took a while to come to the table. When it came, the slice that was placed on my plate did the cool stringy-cheese thingy, but unfortunately, the cheese had already congealed after I'd only chewed through one bite. It also had a bit of a metallic flavor to it.<br><br>I got a second piece because I was hungry, but actually didn't enjoy it much at all. It was cold, the crust was hard, the cheese was just....no.<br><br>After all the hype I heard, I was pretty disappointed with my experience. I'd try again, though, making sure to get a pizza that has more toppings in it. <br><br>Or, I'll just stick with my New York style pizza :)", "pics": null}}, {"review": {"des": "I really enjoyed my food and my deep dish pizza from Giordano's.  However, I have never been to Lou Malnati's, so I cannot say which is better.  I just have a few tips about ordering deep dish in Chicago.<br><br>First, make sure you order a good amount ahead of time for a deep dish pizza.  I always forget it takes close to an hour for the pizza to be ready.  They have a great online ordering system for pickup at Giordano's. <br><br>Second, don't expect to finish your pizza.  I ordered the small pizza, but if they have individual sizes available, I would definitely recommend that.  I was only able to eat two slices of my pizza. <br><br>I've heard Giordano's is very cheese heavy compared to other deep dish places, and the crust is different.  Next time, I'll have to try other places, so I can compare!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OR5g8wsScV710h8Em_-grA/348s.jpg", "caption": "The special"}]}}, {"review": {"des": "Came here at the end of a lunch rush and was met by a very curt server at the bar. She told me that they'd have to make a fresh pie since they stopped making them a while ago, and when I asked how long that'd take (I don't eat deep dish every frickin day) she was quite sassy about it. I tried to change my order seconds after I made it and it was a huge deal, which I can understand, but I was quite ok with leaving it as is. At the end of the day, I got a pizza but it wasn't the one I wanted, it was one with separate toppings they had left over. I didn't have to wait 45 min for a personal pie but I won't go there again.", "pics": null}}, {"review": {"des": "Give yourself a good hour for the pizza to come out. First you put your name down then order pizza while waiting to be seated. It is all made to order and comes out approx 30 min after you've been seated. Don't let your hunger get to you by ordering apps!!! The pizza is SO filling and super DENSE. Ordered the small for 2 people and it could feed 4. Also ordered the wedge salad and calamari (both good but mistakes because there was too much food).<br><br>The pizza was decent. A bit too cheesy and not enough meat. The crust was like a cracker--very crispy and it did not get soggy, which I was impressed about. Overall, pretty decent. Just too long of a wait and a lot of cheese and grease.", "pics": null}}, {"review": {"des": "After going to the bean and the museum, it was our calling to get some deep dish pizza when in Chicago! We had a coupon if we spend a certain $$ amount, to get a few $$ off. Of course there were other recommendations for pizza, but we figured there were so many locations. Why not just try it because it must be that good. We were seated immediately and was told that the deep dish pizza would take 45 min to make after ordering. Surprisingly, I was okay to wait. We had a salad and cheese curds to start/ munch on. The pizza actually arrived 25 min later, which was great! It wasn't so busy when we came around lunch time (beat the crowd). <br><br>We got the mushroom deep dish. It was so huge and thick. A LOT of cheese. We each had one slice and that was more than enough for us. It did not taste greasy or heavy. I was surprised.<br><br>SIDE NOTE. took it to go. put it in the fridge over night. took it on a 3.5 hour plane ride back to SF. still ate it. IT WAS STILL JUST AS GREAT. that's quality. haha. dense and flavorful.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/t1RAA4UWod8s2PUzTiZ8sg/168s.jpg", "caption": "cheese curds"}]}}, {"review": {"des": "Yeah, this is not a chic restaurant and yeah, it's going to be full of tourists. However? For a chain restaurant, slinging doughy casserole pies, I was surprised at how much I enjoyed my meal here.<br><br>Came here for lunch with my mother about a month ago when we were in Chicago. I had had Lou Malnati's earlier this year, so I wanted to try another popular deep dish chain. We came right around when they had opened up for lunch and even though it had only been open for a few minutes, the restaurant very quickly filled up. They offer a lunch special during lunch hours, so if you're trying to pinch some pennies, this would be a good bet.<br><br>Both my mother and I got their $9.95 individual pie, drink, and side combos. I opted for a plain pie with a side salad, and my mother got a sausage pie and minestrone soup. The individual pies were perfectly portioned as it filled us up without making us feel horrible. The pies were also pretty good, with a good cheese to zesty sauce ratio, all encased in their chewy, crispy crust. My mother, who is otherwise a picky eater, enjoyed both her pie and soup a lot.<br><br>Also, even though it's a large chain restaurant, our server was super friendly and attentive. Would definitely consider coming back here during my next trip to Chi-town.", "pics": null}}, {"review": {"des": "Probably the most commercialized deep dish pizza place. The pizza here is a stuffed pizza pie and not so much a pan pizza. Crust is buttery and pie-like and there it's stuffed with a TON of cheese (and any other ingredients you want)! They are known for their cheese pull, which will not disappoint if you're a cheese lover. <br><br>Overall, the pizza tasted mild. The star of the show is definitely the cheese.", "pics": null}}, {"review": {"des": "Went here on a Friday night and was seated right away.  My friend and I ordered The Chicago style individual deep dish to share and the side salad with a lemon vinaigrette.  The salad was very good and the pizza was plenty for the two of us.  <br><br>Our pizza did take a while, which our waitress told us it would.  But it was definitely burnt when it came out. Still very good, just a little disappointed that it was over done.", "pics": null}}, {"review": {"des": "Always good pizza. Always filling, I always leave feeling guilty and wasteful dragging a half-eaten pizza back to the hotel knowing damn well that I would reheat it and eat it. Tip: stroll Riverwalk and give your pizza to the homeless. <br>Ordered the appetizer sampler and was kinda confused by the \"bruschetta\" which was \"meh\". <br>Everything else was good though", "pics": null}}, {"review": {"des": "Better than Lou Malnati's the other night in every way but the crust, still a crappy Chicago \"pizza\"<br><br>Friendly service <br><br>The end", "pics": null}}, {"review": {"des": "Everyone said I had to try some Chicago deep dish while in town. Half recommended Lou Malnati's and half recommended Giordano's. I chose this place because of its proximity to my hotel. I realize that ordering a larger pizza probably would have yielded an experience more in line with the masses, but I was alone and couldn't justify ordering anything other than an individual deep dish. The server said they had just come out of the oven and were very fresh. The pizza was hot when it arrived, but it didn't take too terribly long for the cheese to seize up a bit and nearly choke me, going down. The sausage was plentiful and well-seasoned, but I just found the experience to be a bit much. I don't feel a huge pull to try it again. Maybe with a little peer pressure and a larger group?<br><br>Anyway, just because it isn't my thing, doesn't mean anything. Obviously it is well-loved and has endured. The service was friendly enough and helpful and I'll try almost anything, once.", "pics": null}}, {"review": {"des": "Pizza here was amazing. We got right in even though the place was packed. We ordered beer and pizza right off the bat. We ordered the deep dish and our waiter told us the deep dish takes one hour but we were fine with that. Pizza arrived and it was amazing. Super filling and I would recommend a smaller size then what you would eat for a normal pizza since it's so filling", "pics": null}}, {"review": {"des": "Who has not heard of Giordano's in Chicago? I mean even if you have never heard of it, I am sure you will see signs and might even hear about it from locals. Giordano's is a famous pizza place that serves deep dish pizza. Yes the Chicago style pizza that is known in Chicago. I told my work catering service to get something that represents Chicago and she ordered pizza from Giordano's. Awesome. <br><br>I can't comment on the service but I know Giordano's delivers to offices. <br><br>I had their deep dish pizza with meat and lots of cheese at the bottom. It was very filling even though its just a tiny slice. The crust is thick and yes it is very cheesy. We also had salads and cookies to go along with it. <br><br>Pretty good cookies. Salad was ok. It was definitely not wow salad. <br>It is not easy to get Chicago style pizza in Vancouver. So this is definitely a treat.", "pics": null}}, {"review": {"des": "I get the hype!<br><br>It takes about an hour for them to make each pizza because I'm pretty sure they make each one fresh. It was so good! I only had one slice and I already felt decently full because the dough at the bottom of the pizza is so thick and soft. It's definitely a heavier pizza. We had the \"Meat, meat, and more meat\" pizza, which was pretty good. The medium size was a lot of food for just the three of us. <br><br>We found their business model kind of strange because you order well in advance and you're given a receipt to give to your server once you're seated (which takes awhile too). Then you pay at the end of your meal. Our server was also so friendly and she offered us a lot of recommendations since we were new to the area. This is a must-see in Chicago!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2SwvTzLidXsBdcmV-Z8uAw/348s.jpg", "caption": "Meat, meat, & more meat"}]}}, {"review": {"des": "First time visiting Chicago, asked around and was told to go to Giordanos. I was hungry and didnt do as much research as I should have. I honestly think Sbarros has better deep dish unfortunately...In addition, it takes 40 mins to prepare your pizza here. They are upfront about it though, which is great. <br><br>In summary, I wouldnt spend 15 minutes walking through the rain, wind, and cold for the pizza here again.", "pics": null}}, {"review": {"des": "Yes! I have heard so much about this place from the locals. Finally was able to make it and it did not disappoint.<br><br>So we waited about 45 minutes but we were also able to pre-order our deep dish, which helps because they put it in the oven ahead of time! <br><br>Once we got in, about 15 mins later we had our pizza in front of us. This was very tasty pizza - very cheesy with a very solid crust. The sauce and meat inside was pretty good too. <br><br>Overall, my lady and I enjoyed Giordano's and would return next time we come back to downtown Chicago.", "pics": null}}, {"review": {"des": "WHAT TO TRY?!<br><br>If you're here, mind as well try their deep dish pizza! <br><br>That's what they're known for in Chicago and what people will wait for over an hour for. That's right, it's so popular here that sometimes the wait for a deep dish pizza is an hour long!!! So be prepared to wait. <br><br>The best part is it's made fresh to order and it is very cheesy. There's a lot of different topping choices to choose from and you can even split the pizza with two sides of different topping choices. <br><br>I thought the crust was too thick though. Near the end, we had a lot of crust left over because it was hard and not that crunchy to eat. The pizza filling was good but it wasn't anything special though. <br><br>LAST TIP?!<br><br>A small pizza has six slices and each slice has the thickness of a piece of lasagna so think wisely how many slices each person should eat. My friend and I had the small size but we barely finished because two slices of the deep dish pizza is more than enough for us! Also, if you want to save some money, go during lunch and have a smaller version of the deep dish with a side of salad for $9.99 USD. Better deal! But be prepared to wait for an hour for a deep dish pizza if they're busy!!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/dZGwb0OCpafCJ4FFZEsIIw/348s.jpg", "caption": "Small deep dish pizza (6 slices). Half was Chicago classic and the other half was bbq chicken. Bbq chicken is on the sweet size. Very cheesy"}]}}, {"review": {"des": "I don't eat pizza very often, but when you are in a city known for deep dish pizza, you try one of the most recommended places, right?  Well this is one time I wish we didn't listen.  Expecting amazing pizza and overall experience was a complete disappointment.  <br><br>Here's what's good...location, location, location.  Yep super convenient and pretty much across from Millennium Park.  Portions are big and if you order deep dish, a small pizza is more than enough for 2 people.<br><br>Ok, sadly the not so good and why I won't be returning. <br><br>1) When you walk up to put your name on a wait-list and you ask for first available but they can't do that because there are 2 separate lists even though they don't inform you one list is outside and the other you have to go inside for.  Hello 1st timer I assume you have both lists and just mark what I prefer.  Now 30 mins later...at least they apologized for not being clear.<br><br>2) Once you put your name on the wait-list you go inside to order your pizza since it can take 45 mins to 1 1/2 hours to be ready.  Once again communication was horrible and after waiting in line to do so, we were told to go into the bar and order with the waiter there.  When we tired to they sent us right back to the line we were in.  Yep, 30 mins wasted again.<br><br>3) With all this craziness, we ended up going online and ordering our pizza and with the receipt they were able to connect it to our table.  Ok pizza ordered.  Wait time, 45 mins for it to be ready.<br><br>4) 1 hr 15 mins after ordering our pizza we checked with the waiter on it's status.  Guess what, our pizza was given to another table who happened to order the same thing in a different size.  Really???  How does that happen?  About 15 mins later we get the other party's small pizza when we ordered a medium.<br><br>Almost 3 hours later we left the restaurant very unhappy.  The pizza was not worth the time.  At the end about 1/2 our bill was comped after asking several times for them to take care of it.  Our time is worth so much more.  Not sure how they run a business this way.  When you waiter keeps saying sorry but we are really busy, it's not acceptable.  Overall the waiter did a good job but there is some serious flaws in the way things are run there.", "pics": null}}, {"review": {"des": "When visiting Chicago, you must eat the famous Chicago Deep Dish Pizza, correct? So I decided to come here because this is what Spoon University as well as my Uber driver recommended. It conveniently is also located close to my hotel and close to Millennium Park. First of all, shout out to my fellow Yelpers for warning me beforehand about the wait time for a Deep Dish Pizza. They said it'll take about an hour to make so its better to call before hand. Thank god that I did because it actually did take an hour. I actually never had a deep dish pizza before in my life so I actually didn't know what to expect. The pizza was extremely cheesy. Like it was literally 80% cheese. The pizza comes in small, medium, and larges. I was alone so I ordered a small. 2 slices already destroyed me. It was so filling. A small definitely can serve 2-3 people. <br>The service was 3/5. The hostesses at the front were ehh and nobody came to me after I was seated. However after calling a waiter over, the waiter was super friendly and provided great service. I have to say, pretty great first official meal in Chicago. I'm a huge cheese lover, so this definitely was perfect for my cheese cravings.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/n2bF98Org9UaWv07am9iYQ/348s.jpg", "caption": "Deep Dish Pizza"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZKUT6sOjrQfMq_l1FHOmKw/168s.jpg", "caption": "Deep Dish Pizza"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yraJjMTSgLORqRQuh4nJmA/168s.jpg", "caption": "Lemonade with alcohol (not sure exactly what's in it)"}]}}, {"review": {"des": "One of the best tasting pizza's I've ever had. It's thick, warm, and delicious. We set by the widow and watched pizza being skillfully prepped in front of our eyes. Nothing special about decor, but the rooms always full and this place seems to be very popular. <br>It takes fairly long time to get the pizza - about 45 minutes, but we were told that in advance and it worth every bite.<br>Next time I go back to Chicago, I will crave this Pizza again!", "pics": null}}, {"review": {"des": "This was one of our first meals when we visited Chicago awhile back - it was really close to our hotel and it's one of the two highly rated deep dish joints so we just had to give it a try! We walked in knowing the wait would be bad but we got super lucky and took one of the last tables outside with our 3-month old baby.<br><br>It took awhile to order as the whole restaurant was packed, but eventually we got our food and we were very impressed! I loved how they showed off their super long cheese strip when cutting the pizza slices and the pizza itself was super delicious. We had Lou Malnati's a few days later based on our friend's recommendation and we honestly could not tell which is better!", "pics": null}}, {"review": {"des": "Hostess was uninviting and unfriendly. No smile, no hello, no welcome, just \"how many?!\" She also seemed overwhelmed by 2 very large parties that just arrived. She did not smile 1 time. I saw her seating people several times throughout my dining experience. Nope, she never cracked a smile. <br><br>Ordered the lunch special and chose small thin crust sausage pizza plus house salad.<br>Salad was good. Looooved the fresh cheese and tangy house dressing. <br>Pizza was just ok. I've had frozen pizza that tasted just as good. <br><br>Service was just ok. Server took my order, brought my food, checked on me once and later brought the check. Ok, I guess she did her job.<br><br>Bartender was a bit frenzied as he had to serve the entire bar AND make drinks. Better him than me!<br><br>For this to be a prime area, I expected much better customer service. There's obviously staffing issues here, which affects providing great customer service to guests.", "pics": null}}, {"review": {"des": "Ordered a stuffed pizza here and was slightly underwhelmed. I've heard that there is a great following behind Giordano's in Chicago so I was expecting to be amazed. The pizza kinda just tasted like a moist pizza filled with a bunch of ingredients - I couldn't really tell the difference between what I was eating.<br><br>I also ordered the appetizer sampler here and it was decent. The presentation was so so. There was cheesy garlic bread, mozzarella triangles, bruschetta & boneless chicken bites. The garlic bread was burnt in a lot of areas and the boneless chicken bites were extra dry. The mozzarella triangles were good!<br><br>I'm not sure if I was just unlucky with my experience, but since I hear so many good things about this place, I'd be willing to give it another try next time I'm in Chicago!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hAh8yuC9OW8XgSZ1uqyxCg/348s.jpg", "caption": "Appetizer Sampler"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QkmOQKB2Gs7pqCFF3lrvzQ/168s.jpg", "caption": "Stuffed Pizza"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1ZOY8Cw28Rp9pCh8Za3NFg/168s.jpg", "caption": "Stuffed Pizza"}]}}, {"review": {"des": "It was my first time visiting downtown Chicago, and I just had to have some Chicago style deep dish pizza. Giordano's seems to be one of the biggest names for deep dish pizza in Chicago. Went with two friends on a Friday night and this place was busy as expected. We only waited about 10 minutes for a table though, but the deep dish pizza took about another hour. They do take 45 minutes to 1 hour to bake, so if you are looking for a quick bite deep dish pizza is probably not the way to go. <br><br>While we were waiting for our pizza, we had some of their cheesy garlic bread and that was delicious. Very nice cheese and garlic flavors on a soft flatbread. It held us over until our veggie deep dish pizza arrived. The three of us go a medium, and could only eat 7 out of the 8 slices. True to the name deep dish, this was a thick pizza with a lot of cheese, and a nice buttery crust. I normally want some meat with pizza, but in this case ordering the veggie pizza was a good choice, because the vegetables help balance off all of the cheese and pizza sauce. It was a good meal. Definitely something to try when in Ch-town.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/84KyWNyAA2caoSppcA3E2g/168s.jpg", "caption": "medium veggie deep dish pizza"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0xqveW-gm202_rAYmerdFQ/168s.jpg", "caption": "cheesy garlic bread"}]}}, {"review": {"des": "First time visiting Chicago and I knew I wanted some deep dish.  At 4 pm there was a wait for both inside and patio seating (two different wait lists at two different stations).  We opted for patio since the weather was amazing and were informed that pizzas take about an hour to bake and can be preordered while waiting to be seated to minimize your wait at the table.  <br><br>We were still perusing the menu when our table was ready, but settled on a small pepperoni deep dish and a small thin crust cheese pizza.  The small house salad was delicious and made me feel better about all of the calories I would be inhaling later.  The mozzarella triangles were hot, the cheese was stringy, and the sauce was perfect.<br><br>When our pizzas arrived, we were surprised at how big the small thin crust was.  The deep dish slices are so filling that I really only needed one slice but it was so tasty that I had a second slice.  <br><br>Giordano's totally lived up to my expectations for Chicago deep dish.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/G8OrofuCxxXreDEf3_RNTg/348s.jpg", "caption": "The small thin crust was actually pretty big"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/a4r2v2P4TlS3n8jBph8jlw/168s.jpg", "caption": "Deep dish with pepperoni"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YZP58HL96pclvSH7AZiNtQ/168s.jpg", "caption": "Mozzarella triangles"}]}}, {"review": {"des": "Pretty much not a fan of Chicago style pizza, but when you're in Chicago - whadda ya gonna do??<br><br>- Fried Cheese<br>- Deep Dish<br><br>Don't come if you're in a hurry - nobody hurries a Chicago Pie - these things take time.  <br><br>Fried Cheese comes in squares - you really get some oozy chewy breaded goop to go with your marinara.<br><br>Deep Dish - we go simple - really taste that fat crust, sauce and cheese.  You think you can handle a large?  You can't handle no large.  Each of these pieces will fill you up more than you think it will.  Gluten hater?  This pizza is not the one you're looking for.", "pics": null}}, {"review": {"des": "The pizza takes a while. So a good tip is to call ahead and tell them when you'll be in! You can pre-order and then sit and get that yummy delicious cheesy pizza.<br>We were starved and we got a medium for four of us and we finished the whole thing (left very full)<br>Good pizza, not too expensive, service is busy but nice.<br>The cheese curds are good too if you want double the cheesy goodness!", "pics": null}}, {"review": {"des": "Ordered to go in person. We only had two minutes to order before closing, so we opted for the Chicago Classic.<br><br>We were quoted 45 minutes for our deep dish pizza, it was ready in 40 minutes.<br><br>This location was very convenient as it was directly across the street from our place.<br><br>The sauce is more rich than a local competitor and for this, it wasn't my favorite. Obviously this is personal preference!<br><br>The employees working were somewhat unprofessional, I understand it was late and they were closing, but I'm sure still \"on the clock\".<br><br>Overall, when friends and family are in Chicago I would recommend, but I won't be returning if I'm in the area.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6XbcndB5aN-RTFWFn7bBcw/168s.jpg", "caption": "Size Small - Chicago Classic"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ndoMzi_ikb_FO8EKOkR__A/168s.jpg", "caption": "Deep Dish - CHICAGO CLASSIC"}]}}, {"review": {"des": "I feel like this place is a must when visiting Chicago for the first time, we got the plain cheese one which was very rich! We also got the appetizer platter which was okay it had bruschetta, mozzarella dippers and garlic bread we switched the wings for extra mozzarella was not bad!", "pics": null}}, {"review": {"des": "Their deep dish pizza is pretty good. But I think everyone knows that in Chicago (you're either a Giordano's or Lou Malnati's fan). However, the special thing about Giordano's is their meatballs. They're entirely beef and extremely well-seasoned. When you add them to your pizza, it really spices up the flavors to create more complexity. I also enjoy the more cracker-style exterior on their crusts. Would I go back again though? Some of you are going to kill me for saying this, but you can get a similar experience eating the Red Baron Deep Dish Microwavable Singles (personal size pizzas) that come in the frozen section of your grocery store. #TruthHurts", "pics": null}}, {"review": {"des": "Before I left Cali, I asked all those who visited Chicago what the \"must-visit\" pizza spot was, and they all said Giordano's. But when I arrived in the windy city, the locals were telling me otherwise. \"Go to Art of Pizza,\" \"Go to Gino's,\" etc. It was confusing, and a tough decision on choosing which restaurant to spend my one dinner at. And with regret, I chose Giordano's.<br><br>Now, the pizza wasn't bad. But it wasn't amazing. I ordered the 6\" deep dish pizza with spinach and mushroom ($12ish) and it was gooey, really thick, but too dry for my liking. The crust was dry as a cracker and there was not nearly enough marinara sauce as I expected. But it was decent enough to finish and even though it was only 4 mini slices, it did leave me super full afterward. <br><br>Another thing is that the restaurant is super busy. I waited 1 hour and 5 minutes (I was counting because I was staaarrvingg) for my pizza to come out. Also, the servers were not the most attentive - they're at least nice but I had to wave my hand 4 times to get the attention of one.    <br><br>The location of this particular spot is great because it's a 5 minute walk to the Cloud Gate, 1 minute walk to Garrett's popcorn and a 2 minute one to the Nutella Cafe. So check them all out.. if you decide to go there.<br><br>For my Chicago Pizza experience, I was let down this time. I'll return to this city one day, and next time, I'll listen to the locals.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AzvThMkUvQJqnYe74s8ifw/348s.jpg", "caption": "6\" personal pan pizza"}]}}, {"review": {"des": "What can I say even if I'm a New Yorker I still love deep dish pizza. I'm not going to go into which one is better because I think they are both delicious in their own way. <br>I was sightseeing and decide to stop here for lunch. We went with the medium size pizza and wings. Both were so amazingly good and plenty for the two of us. <br>The service was great and even after I burn my hand (my own fault) the waitress was super nice and brought me some ice and cold tomatoes. Yes cold tomatoes to help my aching hand. <br>I can't wait to come back to Chicago and come back here.", "pics": null}}, {"review": {"des": "My family and I were passing through the area and needed to try the ever-famous Chicago style pizza to verify if it truly was as magnificent as everyone says. Therefore, we did and it was! <br><br>Giordano's was delicious. Although we did not go to the restaurant, we did order delivery from their through their website. The delivery was very prompt, courteous, and the pizza was still hot. I have not tried any other Chicago style pizza, however, this will be the one I continue to give my money to anytime I pass through the area.", "pics": null}}, {"review": {"des": "Giordano's is really good at advertising, which is is why many people will come here first instead of other deep dish joints that are typically favored by locals (I did as well the first time I visited Chicago).<br><br>The pizza definitely isn't bad, but this isn't the best place to go for classic, authentic Chicago deep dish. If this is the first deep dish place you try, you won't be disappointed though. The great thing about this place is that the pizza is VERY deep with lots of flavors and ingredients. But once you try better places (Lou Malnati's, Uno's, Due's), it puts into perspective how average the pizza at Giordano's is.<br><br>If you're only able to come to Chicago once and for a short time, I would strongly recommend going to one of the places I listed above to get deep dish. If you're in Chicago frequently, however, then it doesn't hurt to try Giordano's as well.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0ZRIl6SUxid3i8T1P1TUtg/348s.jpg", "caption": "The \"Chicago Classic\""}]}}, {"review": {"des": "This was my first stop in Chicago because a security guard at the airport told me it's the most popular deep dish chain, although some locals told me there are other spots that are better. It looked like there was a wait but I was seated right away because there were only 2 of us. <br><br>We ordered the small sized deep dish (6 slices) to be shared between the two of us and chose to do half super veggie and half classic Chicago classic. I was told this would take about an hour to make so we each ordered a salad as an appetizer. The Caesar salad was basic but the Giordano's House salad was good. I liked the large shaved Asiago cheese shavings on top. Once the pizza came out it was piping hot and crispy. This was my first real deep dish and they ain't playing here, you'll need to eat with a knife and fork because it was thick! About 2 slices filled me up. This is the spot to go if it's your first time in the Chi because it won't disappoint.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/C8r-GDSvR9JDotTITTbrOQ/348s.jpg", "caption": "House salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/T2PDgDQiC3SjE9_fQCf7-Q/168s.jpg", "caption": "Caesar salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UsymL_vuE6qWxd1Ab4P-7A/168s.jpg", "caption": "Size small deep dish (6 slices) half super veggie and half Chicago classic"}]}}, {"review": {"des": "I've been to Giordano's many times... it's always a Chicago classic, the perfect place to take visitors. <br><br>I wouldn't say it's the best thing in the world, but it's something worth trying once. <br><br>Notes: <br>-Don't get too ambitious. The more you put in the pizza, the less cheese there will be, the fuller you will feel with each bite, and the less enjoyable it will be. Keep it simple. <br>-Be wary of putting vegetables in the pizza as it makes it more watery. I still like a little bit of spinach in mine though! <br>-Be ready to wait; it'll take at least 40 minutes for your pizza to be ready. <br>-Ambiance: It's a lively and chaotic place with very casual vibes. It's great for kids as they have mats for them to draw on. <br>-My favorite appetizers: Calamari, garlic fries (amazing!) I'm not a huge fan of the bruschetta-- tasted too tarte. <br><br>Honestly, just stick with a classic cheese, maybe one addition, and you'll enjoy it!", "pics": null}}, {"review": {"des": "So we just had to try the famous Chicago deep dish pizza. A friend recommended this place so we gave it a try since it was near our hotel. We got there and were asked if we wanted to be seated outside or inside (inside had a faster waiting time). We put down our name for inside seating and were asked to place our pizza order than since it was going to take about 40 minutes to make. We ordered a small Chicago classic pizza which had pepperoni, mushroom, green peppers, and onions. <br><br>We waited around 20 minutes and were seated. My bf ordered a beer on tap and I got the lemonade/iced tea with vodka (basically a long island). We got the Giordanos Sampler which had wings, garlic bread, mozzarella sticks, and French bread with caprese toppings. The platter was great! It wasn't anything special though. <br><br>After 30 minutes, our pizza finally came out! The pizza was definitely different than a regular pizza. The crust was like pie crust...very flaky and hard. The sauce was on top and below the sauce was a thick layer of cheese. Then below the cheese was all the toppings. I couldn't even pick out the green peppers because it was stuck underneath. <br><br>I did not enjoy the pizza very much. Definitely not what I was expecting. I don't think it's the restaurant, it's more of a personal taste that the pizza was not to my liking. But it was a good experience!", "pics": null}}, {"review": {"des": "Pizza doesn't get any better than this; you can make it different, but it won't be any better. If you've never had deep dish, this is the place to go to because they're everywhere and consistent. No need to go out of your way to experience quality deep dish.<br><br>The only mistake you can make here is eating too much and going into a food coma. If it's your first time here, you can't go wrong with their sausage (The Special) or pepperoni (Chicago Classic) deep dish. The small is not actually \"small.\" In my opinion it can probably feed 3 or 4 people comfortably without stuffing them. Two people will be stuffed to the brim by ordering and consuming the \"small.\" <br><br>If you are here on a date, just order a small deep dish and a drink. That will leave you with the option for dessert later. Do not be tempted by the appetizers. They're good but it's not worth being incapacitated by them.", "pics": null}}, {"review": {"des": "Glad I tried it once.   Can never imagine eating this again. It was good, but one and done. The table wait was about 25 minutes on a Saturday afternoon.  However, another 45 minutes on top of that for the pre ordered pie.  <br>Server and hostess were super friendly.  The preorder gal could learn some tips from them as she was unnecessarily curt.  <br>We had the meat on meat pie. We ordered a small and still had 2 slices leftover between the two of us.", "pics": null}}, {"review": {"des": "TLDR: If you're a New Yorker, deep dish is lasagna. Come if you want lasagna.<br><br>Came here on a Saturday evening and only had to wait about 20 minutes to dine in. The nice thing is that when you come here you can order ahead when the hostess puts your name down so you don't have to wait hours for your order. Unfortunately my sister and I didn't do that the first time and ended up waiting nearly 1.5 hours for our deep dish. But we've learned since then.<br><br>We ordered the cheese deep dish with chicken sausage. The first time we came we made the mistake of getting the classic cheese deep dish. STAY AWAY FROM THE CLASSIC CHEESE DEEP DISH. It's honestly too overwhelming with cheese and nothing else, which makes it way too hard to eat. I was happy that this time we got the chicken sausage to break up the enormous amounts of cheese in this dish. Even with three people, you won't be able to finish it all. <br><br>If you like cheese, this is definitely the place for you. Is this the best pizza I've ever had? Absolutely not. I'm from New York.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Nzk-DNoHPuODkLMacJWgsA/348s.jpg", "caption": "Chicken sausage deep dish pizza"}]}}, {"review": {"des": "Second time at Giordano's and never disappointed. I went in the afternoon on a weekday -- right after it opened. I assumed there wouldn't be a wait but I was wrong! Already packed to capacity. I found a seat in the bar area which was also packed. Don't come starving unless you intend to order a bunch of appetizers. Each pizza takes about an hour to make! It is well worth it though. Once your pizza arrives, you'll finally understand what all the hype around Chicago Deep Dish Pizza is about! Favorite part about visiting Chicago!", "pics": null}}, {"review": {"des": "First time having Deep Dish pizza. Only thing is it takes about an hour for the food to be ready but at the same time it is not your regular thin pizza that takes about 20 mins to fully cooks. The break part was soft and mix with the cheese perfectly and the sauce was the perfect amount. When it got to us it was so hot so you knew that it came out as soon as it got out of the oven", "pics": null}}, {"review": {"des": "I've never had a bad slice of pie at Giordano's...and this trip was no exception. It was crazy busy on a late Saturday afternoon, however they know how to manage the crowds, with tons of seating, and pre-ordering at the counter. This reduces the wait time while your pie cooks once you are seated.<br><br>They gave us a 20-30 minute wait estimate but sat us in 5. It did make for a longer wait for our pizza yet we had sodas and salads to tide us over. When our small deep dish arrived, it was perfect. Loaded with mozzarella, tomatoes and marinara, it's what deep dish in Chicago is all about. <br><br>I've eaten at many Giordano's Chicago locations over the years and am always 100% satisfied.", "pics": null}}, {"review": {"des": "Out for some pizza to my favorite spot for deep dish Chicago style pizza.  If in Chicago, it's my goal to get here at least once.<br><br>Tonight was the individual deep dish \"Sausage\" for me and a thin crust \"Sausage\" for my daughter.  Awesome!  Perfect as always.  They have the best sausage around.<br><br>The service was spot on; our server Alexis was super friendly and couldn't have been more smiley.  I hope your managers appreciate you, because you are a great employee.  Anyone that orders a deep dish knows that they take long to bake (45 mins generally) and I still appreciate when they verbalize it too, Alexis did.<br><br>Will be back many more times!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/F_ZndvIF8Yd-4QT-ruQQhg/168s.jpg", "caption": "Individual Sausage Deep Dish"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dcy2EyOLb97E1izj7ip69A/168s.jpg", "caption": "Sausage thin crust"}]}}, {"review": {"des": "This was my first time trying deep dish pizza and wasn't super blown away by the taste or quality. I think the pizza was a tad bit thick and not as cheesy (ooey-gooey) as I had imagined. If that's how it's supposed to taste then cool. I'm just not used to it. I watch too much Anthony Bourdain, No Reservations so my expectations were quite high. <br><br>Anyways, the chicken salad was actually a favorite of mine. I loved the triangular mozzarella sticks as well. The calamari and pasta were too bland though.", "pics": null}}, {"review": {"des": "This was my first stop during my first visit to Chicago. I had to try a Chicago pie and Giordano's did not disappoint! The service was fantastic and the pizza was amazing. It takes about hour to make the pizza so don't go starving.", "pics": null}}, {"review": {"des": "My friend warned me beforehand that I will have to wait 45 minutes for a deep dish pizza at Chicago... I have to say it's worth the wait!<br><br>This 6 inch deep dish pizza is nothing like the one I tried a long time ago at a local pizza place in MA. Once in a while, I'd have a craving for pizza and instantly regret it after eating it. BUT the deep dish pizza at  Giordano proved me wrong. The cheese was rich yet not too heavy. Coupled with tomato and artichoke, it couldn't taste any better! Best thing is I don't feel anything stuck in my stomach afterwards. No post-pizza guilt, NONE AT ALL! : )<br><br>To those who typically prefer a light meal, if you know your pizza toppings, you are gonna love it!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/os-51etY4vd1J2ceyIT2BA/348s.jpg", "caption": "Individual size (6 inch) deep dish w/ artichoke, tomato, mushroom, pesto chicken and anchovies."}]}}, {"review": {"des": "One of the best deep-dish pizzas in Chicago! Expect to wait for a table, but if you have a small group, find room in the bar. The pizza will take 40-60 minutes depending on the size. The personal size is great for one person! The small is good for two people. A must have in Chicago!", "pics": null}}, {"review": {"des": "We came back and I didn't nearly die. They did sit us in the near death section though. We ordered pretty much the exact same thing as before. <br><br>The waiter this time had a personality and actually engaged us in conversation. The wait was only about 30 minutes which was pretty good considering there was a blues festival across the street.", "pics": null}}, {"review": {"des": "Great service at a very busy place. Everything was like it was ordered. Deep dish cheese, a ton of cheese and sweet sauce. Perfect with a Great Lakes 312. We ordered small for two of us - leaving with a to-go box.", "pics": null}}, {"review": {"des": "First time to Chicago, first time deep dish pizza. Was not disappointed!<br><br>LOCATION: right near the Big Bean!<br>DECOR: pretty big place, lots of seating but a bit cramped feeling.<br>FOOD: ordered a medium size, classic cheese and sauce, deep dish pizza. I had never had deep dish pizza b4, I'm a true NYer who thinks our pizza is best. While I do still think that (hehe), I have to admit this form of pizza was super delicious. I loved how the crust underneath was crispy and had a bite to it even with all of the soggy heavy cheese/sauce on top of it. The flavoring was good and pizza was a perfect temperature. Id say it was a hit and I would definitely return for some more.<br>SERVICE: no wait on an April Tuesday at 630pm but place was pretty packed still. Waitress warned us beforehand that the deep dish pizzas take anywhere from 35-60 min to come out, which we appreciated the heads up.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dq7x6Iv_4Vbiw-X7egoITA/168s.jpg", "caption": "Classic sauce and cheese deep dish - really good"}]}}, {"review": {"des": "Food was underwhelming but service was friendly. \"I know you can be underwhelmed, and you can be overwhelmed, but can you just be like.. whelmed?\"", "pics": null}}, {"review": {"des": "So this place has two types of pizza. Their signature deep dish and their think crust pizza. They also have an extra thin crust, but my husband got the regular thin crust. <br><br>I got a personal size deep dish with pepperoni, sausage, and pineapple! I loved it! I didn't like how I waited an hour, but I guess we can't rush perfection! The crust was crispy and each bite had a nice crunch that I love! I don't like soggy pizza and this was far from that!! <br><br>The thin pizza came. My husband got it with garlic broccoli and chicken. He was so disappointed because he said the crust taste like cardboard. I didn't believe him because I got a terrific tasting pizza! He offered me a slice and boy was he right! It was so far from the deep dish. The garlic broccoli tasted like regular broccoli. -1 Star.<br><br>The tables were so close together. My husband and I sat facing each other and our chairs were being bumped by the people sitting behind us on both sides. -1 Star. This place was big enough. I suggest they do some rearranging. It got annoying after a while.", "pics": null}}, {"review": {"des": "Stretchhhhhhh<br><br>What did I get<br>Well obviously when in Chicago I have to try the deep dish pizza! This was my first time trying the deep dish pizza. Once you order the pizza it took about 45 mins to make, order appetizers! My imagination of the pizza was going to be a hot mess but thankfully there are utensils! Everything is eatable! I got the small deep dish pizza and this was about 6 slices. I am not a fan of pizza but the crust was tasty! If the pizza stayed hot it would have been better, I liked the first slice but the second slice was already cold and I didn't like it. I also got the Chopped salad which was good, lots of chicken cubes in it. Also the chicken wings were good, not dry, still had the juiciness to it.<br><br>Environment<br>There is outdoor and indoor seating and I sat inside. There was a window where you could see the staff making the pizza. Nice environment, on a good day, you could sit outside and enjoy the weather. The bathrooms though were NOT as clean as I would like... More time needs to be spent on the bathroom please!<br><br>Niceness of the staff<br>My waitresses were swapped halfway through and I am not sure why. Overall they were nice! It was my first time so she did the first slice for me while I took photos! Thanks!<br><br>Dollar<br>Not overly expensive if you have 3-4 people sharing the pizza. The pizza was 24$ and the wings were 12$ and a single single was $7.<br><br>Yes?<br>Its a chain, it can't go wrong right? I am interested to try other items on the menu or a different style of deep dish.<br><br>#WendyWanders #WendyandChiTown", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kfhAX6nj4piRAwspkslw5g/348s.jpg", "caption": "May 2018 - prices"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/03N84kLstt0mxzipodwnVw/168s.jpg", "caption": "May 2018 - small pizza"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/klf8CSLOStBkdvGIU2eV1g/168s.jpg", "caption": "May 2018 - stretchhhhhhhhhhh"}]}}, {"review": {"des": "Over hyped!<br><br>Pizza was good, but not worth the hour wait. We should have gotten then hint when we asked our hostess if the pizza was worth the wait and she had to think about it before giving us a response. I'd recommend looking for a place that isn't a chain.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Eec2wdBf9afNdeNO9Agm5Q/348s.jpg", "caption": "Pep & Bacon deep dish"}]}}, {"review": {"des": "We went here for our little family get away to<br>Chicago!!! Awesome pizza .. waited for a table .. but not long !!!!! Sooooo good !!!!!", "pics": null}}, {"review": {"des": "I truly enjoyed my experience at this location from beginning to end. we came here after going to lollapalooza and knew that their pizza would take some time to cook but the service was spot on with the food. our server let us know ahead of time how long the pizza would take 45-1 hour so we knew what to expect and the pasta I ordered was amazing. its hard to obviously find pizza like this in San Diego but I'm extremely happy we stopped here before we went back. we ordered the works mixed in with the meat special both are amazing.", "pics": null}}, {"review": {"des": "Their bruschetta is to DIE for!!!! And they're deep dish leaves you stuffed! Definitely check it out!", "pics": null}}, {"review": {"des": "All I can say is customer service goes a long way. After my bad experience Giordano's I was contacted by the GM Nerius who was concerned about my awful visit. <br>He apologized and stated he would send 2 small pizzas to my home, since I live in South Florida. I was surprised and pleased with the generosity. <br><br>I was pretty bummed that I could not try the famous Chicago deep dish pizza when I was in town, but the fact that Nerius went above and beyond made me feel like I was an important customer completely reversed my mindset of Giordano's. <br><br>By the way I never order food to be shipped from out of state, but I must say the packaging and clear directions on how to heat this pizza was great!! <br><br>I would definitely order from Giordano's in the future, the pizza tasted amazing!!!!! <br><br>Thank you Nerius!!!", "pics": null}}, {"review": {"des": "Giordano's! Deep dish pizza!<br><br>So the previous times I had been in the Elk Grove area and did not have a chance to hit a deep dish pizza place other than Lou Malnati's. Made my way into Chicago and went to Giordano's!<br><br>So what they didn't mention was, 45 minutes for your pizza to be made (deep dish, of course). Or at least, they didn't mention it to me lol. So get an appetizer or just prepare to wait for a while lol. Or maybe order online? hehe.<br><br>Went with a simple chopped salad (because greens, why not), containing lettuce, bruschetta tomatoes, chicken breast, bacon, scallions, red cabbage, pasta, peas and blue cheese tossed in our honey mustard dressing. This was actually better than I expected. (or maybe because I hadn't had salad in a while).<br><br>We also went with a starter, getting calamari and other goodies: Fried mix of tender calamari, green beans, lemon rings, banana peppers and shaved fennel served with our house-made marinara sauce. For me, having battered lemon rings was not my cup of tea.... Everything else was just decent for me. Probably wouldn't get it again.<br><br>For our deep dish pizza, we went for the Chicago deep dish. Pepperoni, mushrooms, green peppers & onions. And a LOT of cheese. They have the cheese pull and I totally failed with that. Flop went the pizza. So hard to get to your plate. But this has so much more flavor. Loved eating it. The bread/crust was a little bit bland and tasted more like a holder rather than a pizza crust. (With all that cheese, who can blame it?) But definitely the marinara sauce and the cheese was a much better experience for me. Worth 45 minutes? Maybe, maybe not.<br><br>Also my coworker and I couldn't finish. So filling.", "pics": null}}, {"review": {"des": "first time in chicago, so had to get deep dish. my friend and i split the chicken sausage deluxe and it was pretty bomb, but the pizza wasn't hot/steaming     <br><br>a tip: you can split flavors on the deep dish! we weren't aware and we realized a hot second after we walked away from ordering at the podium and the lady upfront said she couldn't change our order, even though it was only 2 minutes .... so the service upfront wasn't friendly. <br><br>otherwise, our server at the table was so friendly and great! she came to check on us and make sure we were doing great", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/e-IU6rymfAsX6FaTY5u8mQ/348s.jpg", "caption": "chicken sausage deluxe!"}]}}, {"review": {"des": "Great pizza! Surprised they were out of a good draft beer that we wanted but switched to Blue Moon. Had the large meat eaters pizza that was worth the wait.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tw-l7WwXAaJR4jrQNkXABw/168s.jpg", "caption": "Blue Moon"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Z8AbhvT3stmmB-t6RgbBdg/168s.jpg", "caption": "Gyro pizza"}]}}, {"review": {"des": "Maybe it's because I'm a New Yorker and we like our pizza thin. Giordano's just didn't work for me. There was too much sauce, the crust was too thick and hard, and I had to eat it all with a fork and a knife. Honestly, the leftover slice that my sister brought back to the hotel from Lou Malnati's was better than the fresh pizza I had at Giordano's. <br><br>I am giving a shout out to our waitress for being very nice and helpful. I'm also giving a shout out to the free appetizer I got by signing up for their mailing list online. Pro tip: If you're getting a pizza, get the bruschetta because it's really light and very fresh.", "pics": null}}, {"review": {"des": "First time in Chicago and this place came highly recommended, especially from many of our Uber drivers in the city. The wait was well worth it! So so delicious. Chicago deep dish is in a league of its own. Will definitely go back to Giordano's next time I visit Chicago.", "pics": null}}, {"review": {"des": "First time I came here from a recommendation of a friend who visited Chicago a month ago. The rest. seemed crowded but not full at the time I was there. It was around 3 pm.  There are separate areas where customers can order to go or dine in. <br>It is well lit, clean, organized.  The host, servers and table cleaning personnels were nice, helpful and friendly. <br>Our table was attended by Andrew. <br>He was great. <br>I ordered Meat on meat, small deep dished pizza. Basically like Meat Lovers on other pizza chains. <br>It was good. Lots of cheese. Layers of cheese. <br>Love the cheese stringing as you take the slice off. <br>Not a lot of meats, as I would have expected. <br>Meat Lovers on Papa John has more meats. <br>The deep dish almost like \" lasagna on a thin crust pizza \". I couldn't finish a small size. After eating 2 pieces, I was full. The have a layer of tomatoes sauce on top. A little bit too much tomatoes to my taste. <br>Overall, if you haven't tried Chicago Deep Dished pizza, a great place and food to have.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TBdf0XAupAUAfHYau95-2w/168s.jpg", "caption": "Meat on meat, small deep dished."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eZfqWhVl2HEQb-qBgTD-ug/168s.jpg", "caption": "Minestrone in a bowl."}]}}, {"review": {"des": "My 91 year old great uncle wanted to try some pizza during our trip. Well, our first choice was Giordano's because there was a Frank Giordano who was a World War II POW, and my great uncle served over in Europe during the 40s in France, Italy, Germany, Not sure if they're related but thought it would be a nice gesture.<br><br>Well, we started out with a good salad, as we waited for their signature deep dish pizza, and it was worth the wait too. He had never seen so much cheese, and that's all he talked about throughout the evening. <br><br>Thank you so much for making him smile!", "pics": null}}, {"review": {"des": "On our last night, my girlfriend and I wanted to keep our Deep Dish Pizza experience going. Our last stop was Giordano's. Again, because cooking the made to order deep dish, it takes them 45 minutes, so it forces us to get a salad.<br><br>The salad was good. I'm not sure if Giordano's offers other salads, but we got the Caesar and it was good. The sliced cheese was very tasty. I wonder if it's the same cheese that's in the pizza.<br><br>Now for the Pizza, I find it hard to review. Did I like it as much as Lou Malnati's? Not exactly. Was it good nonetheless? Yes. I did feel like this is more of a commercialized deep dish pizza rather than that \"hole in the wall\" experience. The pizza definitely deserves 4 stars, but I'm on the fence to give it a 5. If I didn't go to Lou Malnati's a few days earlier, it would have definitely been a 5. <br><br>The pizza is good regardless and should not be ignored here if you're passing by Chicago. My pizza experience here was definitely memorable and I would suggest it to anyone.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2G7BmDeJcAqYW7v0XSCn0A/348s.jpg", "caption": "THE SPECIAL"}]}}, {"review": {"des": "To be honest, my opinion is biased since I'm from N.J./NY, where the best pizza ACTUALLY is. I wasn't a fan of the sloppy, thick, overly cheesy deep dish pizza. One slice makes you feel bloated and heavy. Wouldn't recommend.", "pics": null}}, {"review": {"des": "It's one of those quintessential Chicago things that a visitor must try. Seriously though for a proper Chicago-style deep dish pizza you can't go wrong with this famous establishment of Chi-town. Giordano's has been serving the thick, stuffed pizza since the 1970s and there is no doubt that they have perfected the process.  Granted, as a New Yorker (hehe and Joysey resident) myself, my first love will always be a proper New York-style slice.  However, I'm not so obtuse to deny the delicious quality that a deep-dish has. Be warned though that it will take close to an hour for the pie to arrive, but the wait is worth it.  The restaurant can get crowded and loud but it's not unbearable.  The décor is straightforward and so it the menu which has a decent selection for those that may not want a deep-dish, but as the saying goes \"When it Rome...\" right?<br><br>Anyways, Giordano's is an establishment that can't be missed.  It's near Millennium Park and all the attractions, so there's no excuse why a stop is not warranted.  Just remember it is quite a wait for the main event, but it's certainly one worth waiting for.", "pics": null}}, {"review": {"des": "Excellent deep dish pizza.  I felt it was a wee bit better than Lou Malnati's as well.  Quite a meal - heavy and filling.  <br><br>The wait time to be seated on a weekday at 1:30 was about 10 minutes.  The food took a good 50 minutes to receive after ordered.  I guess the idea is that you socialize while waiting then everyone munches once the pizza arrives! Plan for some time at this place but the food is made to order and delicious!<br><br>Very good Chicago deep dish and the wedge salad was good as well.", "pics": null}}, {"review": {"des": "I experienced VIP treatment without warrant by the Giordano's hostess \"Indra\" and was quickly followed up by a hospitable greeting from our server \"Kayla.\" Our appetizer was brought out within 10 minutes and the main course (a fat deep dish cheese stuffed crust) was served within 30 minutes of seating. <br><br>The Giordano's staff has a huge demand to fill, and the staff certainly does an upright job on delivering. Being a tourist location, I was surprised at the amount of synergy among the staff. They were working together and collaborating on delivering an all around A+ customer experience. <br><br>The outdoor seating was limited, which is why it didn't get the full 5 star review; however- in their defense.. it is mid-March (an extremely cold season for the Windy City) moreover, Giordano's gets an all hands raised 4.5 based on my personal experience. <br><br>Cheers to the staff and management that's holding this amazing tourist attraction together!  Pizza cheers!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vQHg16sKjV4yzVCBCq2yaw/168s.jpg", "caption": "Infamous Giordano's \"cheese pull\""}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/a7H4GEyHf-EnWG7VHPfMzQ/168s.jpg", "caption": "Giordano's cheese bread"}]}}, {"review": {"des": "Poor customer service no follow up Giordanos used to be my favorite now I wouldn't eat that shit if they paid me millions. I don't continue to go to places that treat their customers like shit. Should post the pictures of the first answering me and then ignoring me for 2 months!!! NEVER AGAIN!!!", "pics": null}}, {"review": {"des": "Good pizza, lively atmosphere, nice way to start off this trip to Chicago. Opted to get the thin crust as opposed to the the deep dish, was good but not great. Felt like there could have been much more to the sauce and felt like the cheese was short of what I wanted, overall good but not great", "pics": null}}, {"review": {"des": "We brought some out of town first time visitors to get Chicago style deep dish pizza.  We got some calamari appetizers and the meat special deep dish pizza.  I really wasn't too impressed by the deep dish.  Even though we had ordered the meat lovers, there wasn't a whole lot of meat, and I think the cheese overpowered everything (first time I ever complained about too much cheese!).  Of the deep dish pizza places, I would actually recommend Lou Malnati more so.<br><br>FYI:  make sure you budget enough time for the deep dish to cook!  The few times I come here, I always forget that it takes minimum 45 min - 1 hr for the pizza to cook!  Or you can order ahead of time before arriving.", "pics": null}}, {"review": {"des": "The moment I ate that gorgeous personal pan pepperoni pie was also the moment I became a pizza fan. All it took was one bit, and then it was forever. Disclaimer: I'm a Michigan transplant with a five year residence in Wisconsin. Chicago pizza is fairly new to me, hence the drama. <br><br>I'd like to return to this chain, and have another #pizzamoment. Yum!!", "pics": null}}, {"review": {"des": "This was our first time here and it was absolutely awesome. Despite being very busy, we only waited about 30 minutes for a table. I do wish we had been told that wer could have preordered our pizza during our wait. There is a 45 minute wait for pizza after you are seated. The appetizer sampler was so good, especially the bruschetta.", "pics": null}}, {"review": {"des": "Love this location!  Service was great. Even when it's crowded you don't get forgotten. Server was so friendly and always made sure we were doing ok. Pizza was delicious as always. You have to be prepared to wait but good things take time! Ordered some garlic bread for kids to eat while waiting.  Patio is great!   The views keep you entertained while you wait. <br>Will definitely be back", "pics": null}}, {"review": {"des": "The Chicago deep dish is the way to go. I mean you don't come to Chicago for any other reason. The wait for it is pretty f** insane. One hour and 30 minutes to be exact! And thats even if you pre-order it ahead of time but let me tell you.... its worth it! Its literally a pie in a form of a pizza, the crust is so delicious! <br><br>The girls in the front are so rude, they must hate their job. You would think they would be nicer to out of towners but maybe thats just a Chicago thing. The waiters were very lovely and helpful.", "pics": null}}, {"review": {"des": "My husband and I both enjoyed our food, but the overall experience could have been better. The people at the hostess station are like robots. They try to get you to pre-order your pizza while you're waiting for a table because \"pizza's take an hour to make\". They really push it on you, but I think it's just a ploy to make the tables turn more quickly. My husband ordered a deep dish pizza when we got to the table and it only took about 30 minutes, which is not an unreasonable amount of time to wait for your meal to come out. They have one vegan option on the menu, spaghetti with marinara sauce. I had that and asked them to add black olives, artichokes, and onions to it. It was very tasty! Would be great if their pizza crust was vegan because then I could get a pizza minus the cheese.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/j-74aU-xBXdQxUBHsmyraQ/348s.jpg", "caption": "Pasta with marinara (added black olives, artichokes, and onions)"}]}}, {"review": {"des": "Excellent deep dish pizza, good service but do an expect a wait as everyone else knows it's \"worlds famous\". Had the chicken Cobb salad and the barbecue pizza . <br>The medium fed myself and two other adults with 3 left over to take home.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0eGcGGEUdZhZdtlIP2fdXA/168s.jpg", "caption": "The bbq bacon and chicken deep dish"}]}}, {"review": {"des": "Very very absolutely very bad experience, this place was recommended, but was sooooo badddd<br>I was there this weekend with all my family I came from houston just for nothing, the we try to drink and the bartender was rude and racist so racist just because we are Mexican he din't sell us a drink, and we buy like 5 pizza and we will order for more because we are a big family but with that experience we din't so don't go this place they'r racist", "pics": null}}, {"review": {"des": "I absolutely can NOT express how much I love this place. Wonderful see every time I come in! Extremely friendly/family oriented location. Every time my family from out of town comes in they always want to come here!!! Not only is the food PHENOMENAL but the employees are amazing from Syed the owner to his son Solman to the rest of his family and crew working there!!! 100000% recommend this place as I always do and always will!!!!", "pics": null}}, {"review": {"des": "Great pizza!  Love it!!!  Make sure not to go on busy times unless you have an hour to wait.  It is worth it though!  Also, make sure to get a Caesar Salad!", "pics": null}}, {"review": {"des": "My favorite deep dish place in Chicago. It takes 45 minutes for your pizza to bake in the oven as they make it fresh to order. The staff is always friendly and the wait to be seated has never exceeded 30 minutes from my experience. They also have ready -to-go frozen deep dishes packed to travel when you're headed to the airport and want to take some with you! <br><br>I always dine in and add extra garlic on whatever pizza I get and grab a few for the plane.", "pics": null}}, {"review": {"des": "The food here is undoubtedly delicious, but the service was bad when we went. The waitress forgot to put our order in, so we waited an hour and a half for food. Hopefully this was a one off situation, but it was frustrating to sit for so long.", "pics": null}}, {"review": {"des": "I mean, when in Chicago have pizza right? <br><br>But what about on National Pizza day?<br>Go hard or go home! So we stopped by what we heard was the best place for pizza in town! ( told by some fellow chicagoians we met in the airport) <br><br>Never had a deep dish, so what better day and place to try it then national pizza day in Chicago! <br><br>The waitress told us it was about a 45 minute wait for the deep dish pizza's but we were game, since we were in Chicago, and it was on our list of things to try.<br><br>The waitress was pretty exact when it came to timing, the pizza came out about 40 or so minutes after we ordered. Dough, cheese, topped with sausage and tomato sauce it was extra gooey and super delicious! <br><br>So happy we came here to try our first deep dish pizza. <br><br>As for me, I'm not CRAZY about deep dish, only because I don't eat THAT much cheese but it was good.", "pics": null}}, {"review": {"des": "Update! The manager reached out and invited us to try again. We went in and the second experience was MUCH better. Service was great and the food was cooked perfectly. I'll chalk the first time up as a fluke/bad night. <br><br>Food was fine. Our pizza came out under cooked so it was soggy and we didn't eat much of it. The atmosphere was fun just really loud and hard to hear each other. I'll try again but for now it was just okay to me", "pics": null}}, {"review": {"des": "Giordano's was our first stop for classic Chicago eats during our trip and it didn't disappoint. It's a long wait for deep dish, so don't be surprised! Either be patient, or order ahead for take out! We decided on the bacon bbq chicken deep dish. We ordered a small but it was definitely enough for three! We ended up taking two pieces to go, but if my stomach was big enough I could have happily enjoyed another slice. The onions were a nice touch to balance out that sweet bbq sauce. There was just a tad too much sauce but nothing I couldn't scrape off myself. I wish we could've tried another type of pizza, so it would be nice if you could order by the slice! I am glad I could at least finally say I've had Chicago deep dish IN Chicago!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TqaBmVTQP44tneCcmmeAoA/168s.jpg", "caption": "Bacon bbq cheese pizza"}]}}, {"review": {"des": "Oh-My-God- BECKY!!!! This was everything I expected and more!  It was like heaven with very bite!  My advice order your pizza before you are even sat as it take 45 minutes to an hour to make.", "pics": null}}, {"review": {"des": "I ordered delivery from here just because I was too lazy and exhausted to leave my hotel room for dinner. They have an online ordering system which makes things really easy and gives you the option to fully customize your meal! I ordered a full-sized salad and a personal deep dish pizza. The personal deep dish was MUCH smaller in diameter than I was expecting, but boy did that thing fill me up. I had the salad and only half of the pizza because it was so hearty and chock full of ingredients.  Definitely a great foray into the world of Chicago's deep dish pizzas!<br><br>I thought delivery was a bit spotty. I was quoted 45-60 minutes but 75 minutes later my pizza still had not arrived. When I called the restaurant they said that their delivery person was out with the pizza and it should arrive soon. Which it did...but by then the pizza was pretty cold. I think I will make the trek myself to the restaurant next time, even if it is cold out, just so I can have freshly melted, stringy cheese on my pizza.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OAB2OWHcMTCEThu3AV-Dyw/168s.jpg", "caption": "IG: @sherry.jubilee"}]}}, {"review": {"des": "While my boyfriend and I were in Chicago, we wanted to try a really good Chicago deep dish pizza. We heard wonderful things about Giordano's and decided to try it. Giordano's truly exceeded our expectations and had phenomenal food, friendly staff, and a wonderful environment. <br><br>The pizza really met the true definition of Chicago deep dish pizza. We ordered the Giordano's Deep Dish Pizza with black olives and pepperoni. The crust was delicious and toasted to perfection, and the pizza was filled with tons of warm, melted cheese - My favorite! The pizza is very filling, and you'll have plenty for leftovers if there are only a few people eating it.<br><br>Giordano's gets very busy around dinner time, so be prepared for a wait. It took us about 45 minutes to get our food after being seated. They gave us a heads up that it would take a bit, so we ordered a salad to enjoy while we were waiting. The House Salad is a great choice. We ordered this and loved it! It was the perfect size for the two of us to share and came with a yummy piece of garlic bread as well. <br><br>Overall, we really loved Giordano's and will absolutely be going back on our next trip to Chicago. We received great service and delicious food. If you're ever in Chicago looking for some of the best pizza, I would definitely recommend trying Giordano's!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5wlRQRQp9K8dsgZiGYWEdw/348s.jpg", "caption": "Giordano's House Salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MifbyWJjGSrzc2c5tMalQg/168s.jpg", "caption": "Giordano's Deep Dish Pizza is an absolute must-have when in Chicago!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/s_dKICd4J7Rv65WikdE4NQ/168s.jpg", "caption": "Super cheesy Chicago Deep Dish Pizza at Giordano's!"}]}}, {"review": {"des": "You can't come to Chicago without getting deep dish! This is a great choice. You can call ahead or come in and sit and wait. The deep dishes take 45 min to an hour to cook so give yourself time to eat. Highly recommended! I got a chicken and mushroom pizza and we finished every bit of<br>It.", "pics": null}}, {"review": {"des": "Gooey deep dish pizza and sold in frozen form for take out (kind of like birthday cakes)!  I believe that this spot is almost comparable to Lou Malnati's.  There are multiple locations scattered throughout the city for easy access. <br><br>I personally think that the crust is too thick which disturbs the proportionality of the cheese, sauce, and other toppings.", "pics": null}}, {"review": {"des": "When in Chicago, I had to try the deep dish! Walked in Giordano's and was greeted by two hostesses. They had me preorder because the pizza takes up to 45min - 1hour  to come out, which is fine. Got seated within 15-20 minutes. The lady butchered my name, even though I spelled it out for her, but seems as though she butchered everyone's name LOL. <br><br>Sat down, took about 10-15min to see our waitress. Once we saw her, we ordered our drinks and garlic parmesan fries. The fries were luke warm, and some of the fries looked to be refried which was a bummer. The deep dish did come out within an hour and tbh, I'm not a fan. The crust was not the greatest (it was a little too hard) we ended up eating the toppings and leaving the crust. <br><br>Deep dish isn't for me, I'm going to stick to normal pizza :).", "pics": null}}, {"review": {"des": "This place was highly recommended from friends of mine who love this place, and from every Uber driver in town.  However, it wasn't recommended from my friends who are Chicagoans, which I thought was funny. <br><br>We came here on our last day in town before we headed back to San Diego 6/28/18.<br>We grabbed a table outside in the shade, cool setting near a waterfall in the building plaza.  We had to order a deep dish pizza, which takes 45 minutes.  The waitress informed us and we had no problem with that at all, but the wait isn't worth it.  The flavors were tasty with lots of cheese, pepperoni and sausage.  However, the pizza crust was burnt and too hard for our liking.  We each had a couple salads to satisfy the warmer weather before our pizza.  Sadly, it took over 10 minutes to receive my beer after I ordered it, especially because it was a warm day.  <br><br>Service was pretty mediocre, the waitress was just unpleasant and didn't really showcase a desire to be working there. Kind of rude and just not not nice.  Go get a desk job!<br><br>Overall:<br>I'd check it out if you're in need of a tourist trap, the pizza is really not worth it in our opinions.  Don't go hungry, it takes a long while to receive your food, even appetizers. I'd sit in the bar next time for sure!", "pics": null}}]}