{"name": "giordanos-chicago-9", "reviews": [{"review": {"des": "Appetizers are awesome. The cheese bread and the garlic Parmesan fries are tasty! The pizza is fantastic whether it's deep dish or thin crust. Giordano's is the place for Chicago Style.<br><br>Moved up to a 5. Giordano's doesn't disappoint!!", "pics": null}}, {"review": {"des": "My favorite deep dish in the city by far. The flavor and cheesiness of the pizza is close to perfect. It does take a while to cook, so don't go if you're in a rush. The only problems we've ever had was the pizza taking too long. We had to take our pizza to go one time because we were late to a play. <br><br>Other than the wait, the quality of the pizza is worth the trip.", "pics": null}}, {"review": {"des": "Chicago Classic : pepperoni, green pepper, onion, mushroom<br>7.7 (Brett)<br>7.1 (Brady)<br>$24 (Small = 6 slices)<br>Stop #1 on our Chicago Deep Dish Tour and we decided to go with the undisputed heavy weight champion. Giordano's was once synonymous with Chicago Deep Dish and has found even more fame by going commercial and expanding throughout the country. \"They\" say it's Chicago's best but we still don't know who \"they\" are and as dedicated pizza reviewers we decided to find out for ourselves. <br>We went with the Chicago Classic Deep Dish. Weighing in around 10lbs, this thing was STACKED with cheese. We think they pride themselves in their <br>#cheesepulls and go out of their way to make theirs the cheesiest. So while it looks great in photos, it tends to dominate the whole pizza. To make the dough to cheese ratio more favorable they make this really \"doughy\" with no type of crunch. And then the veggies were a little undercooked and not chopped up small enough in our opinion. <br>For the best known deep dish spot, our expectations were higher especially after @stoolpresidente gave this his highest Chicago Deep Dish rating of 8.4. Did Giordano's sell out and go too commercial? COMMENT BELOW and let us know what you think. Still worth a try but we believe the best is yet to come.<br><br>Check our our Instagram for more Chicago pizza reviews- all.about.the.sauce", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eEDOFQTVJAVFYnVrtRE_Bw/348s.jpg", "caption": "Chicago Classic"}]}}, {"review": {"des": "We surveyed friends who are Chicago natives to find the most recommended restaurant for deep dish Chicago style pizza. Everyone said Giordano's. So that's where we headed post-marathon. Of course it takes a while for the pizza to cook. Plan on 45 min-1 hour. Just drink a beer and eat a small salad. No big deal. We ordered the smallest pizza available and it was still enough food for two people to have for two meals each. Our hotel room had a fridge so that wasn't a problem at all. <br><br>The pizza was very much worth it and we'll definitely go back on a future visit!", "pics": null}}, {"review": {"des": "It is an oldie but a goodie for a reason. Giordano's serves quality deep dish pizza and the tradition continues to live on. <br><br>I have been very loyal over the years to the other unnamed deep dish pizza restaurant that is renowned in Chicago. However, this last time I happened to be in the area, it was very cold, and I was not dressed appropriately for the weather, so Giordano's it is. My group of 8 arrived on Saturday night without a reservation and the estimated time was 30 minutes. That was not a big deal since we were hungry and the enclosed waiting area made it bearable. It was convenient to be able to order our pizza while we waited so it would arrive soon after we were seated, which is exactly what happened.<br><br>The quality of the pizza was top-notch and the service was even better. Our server never failed to refill our water glasses and was friendly throughout the service without being annoying. We ordered a medium Chicago classic deep dish pizza and a small fresh spinach deep dish pizza for our vegetarian friend. The pizzas arrived quickly with fresh steam leaving a trail behind the server. The balance of ingredients was perfect and we all indulged in very large slices. I was surprised how much I enjoyed the fresh spinach pizza. Do not underestimate how good this one is! <br><br>Yeah I probably would not eat this every day because I would be ridiculously fat and die young, but I would be so happy if I could.", "pics": null}}, {"review": {"des": "Visiting from Toronto, my girlfriend and I were very excited to try the world famous deep dish pizza. Upon arriving to the restaurant, we noticed there was no wait and we were attended to right away. <br><br>As we were seated, our waitress asked what we would like to drink - which is always a good sign. She was very hospitable and polite. <br><br>My girlfriend and I ordered the medium deep dish Chicago classic pizza and we were very excited. The waitress warned us that it would take about 40-50 minutes to cook which made us decide to get an appetizer as well. We ended up getting the boneless chicken bites with a mix of both sauces (bbq and buffalo). There were alright, the standard chicken nugget style appetizer drenched in sauce. <br><br>When the pizza came out 40 minutes later, it was very appealing to the eye. If you are from out of town, and are wondering what size to get, if you are only 2 people, just get a small lol. My girlfriend only ended up eating 1 slice and I ate 2 because of the huge portions. Lets just say, we had a good sized snack for the long ride home. <br><br>The pizza in its entirety was average. It was greasy and the crust was a tad bland. Half way through we requested for dipping sauce to counteract the taste. The filling was good and it was loaded with cheese - i just wish it had more taste. <br><br>All in all, it was a nice experience but I think we will try another deep dish place the next time were in the city. It was nice to give this place a try- but it didn't live up to its hype. The service was great and the restaurant was clean and had a comfy /home feeling to it. Just wish the food had that \"home\" taste to it too- but what can you expect from a chain restaurant now-a-days?", "pics": null}}, {"review": {"des": "I loved the deep dish here! I tried Lou Malnati's and actually prefer this one to my surprise . It's more cheesy and the crust is perfect!! The crust is buttery, soft, but crunchy at the same time, and so good that I didn't even mind eating it by itself, which is rare for me. Our server was hilarious and a such a strange sense of humor that we appreciated. He served us our first slices and we loved etched the cheese string away. There are big screen TV's showcasing sporting events if your into that!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/L7ChQnZ7R2dvfOB_XP8FWw/348s.jpg", "caption": "String cheese anyone??"}]}}, {"review": {"des": "Let me preface this with I'm a tourist and if there was ONE thing I wanted to leave Chicago having tried it was a deep dish pizza from Giordano's. Overall it was good. I didn't know it was such a large chain and we got a free appetizer for signing up for their specials/newsletters. We offered small three meat deep dish pizza and it was good. I'm glad I went and checked this off my bucket list. I would go back for sure!", "pics": null}}, {"review": {"des": "In town for work and of course we had to get dee dish pizza! Had never tried this place before and I was very intrigued to get some good pizza!  We were immediately seated and the waiter was very pleasant. Seeing the pizzas on nearby tables only enhanced my anticipation for said meal. <br>The menu clearly stated that the pizzas take 34-45 mins which was a plus as we all ordered side salads as appetizers to hold us over as we were starving. I ordered the personal 6\" pizza and man does it fill you up! For one person, even with a healthy appetite, this size is more than enough. Definitely sticks to the ribs. I would definitely return in the future and the pizza was perfectly cooked.", "pics": null}}, {"review": {"des": "Was my first time in Chicago and heard that GIORDANOS was the place to try. WELL, I can happily say I'm glad that I did. It was so well worth the wait. My friends and I were very pleased with the entire experience. From getting a text letting you know of the 30 min wait to get a table to their food starters, service, decor and of course deep dish pizza - everything was phenomenal. <br><br>Our server was Cameron. Amazing guy. He knew we were from Michigan and he told us about him originally being from Michigan. His service is even better! He kept refilling our waters ... we were never in need of a glass that wasn't refilled. He also has an amazing personality and was quick to give us food (even with 40 min wait). His service is superb and made us enjoy our visit that much more. Always checked up on us and took care of us. <br><br>We started with their food starters which had a mixture of a variety of foods and then we had the Chicago deep dish veggie (half) and the other half was the BBQ chicken. <br>The prices are on the high side but I mean you have to try it at least once.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7IgQtd7DIeO7LvJkrEzf9w/348s.jpg", "caption": "Food Starters"}]}}, {"review": {"des": "I was visiting Chicago and knew I had to have deep dish pizza during my stay.  I tried one of the other Chicago institutions the last time I was in Chicago, so this time it was time to try Giordanos!  It definitely lived up to expectations, and I will have to try it again the next time I'm in town.<br> <br>I started with the tomato basil soup, which was great with the cold weather outside.  The soup had a deep, rich tomato flavor, and it didn't have the sour tomato taste that some tomato based soups can have.  It had a creamy consistency, and the basil added a nice depth of flavor to enhance the soup.  We next ordered the appetizer sampler, which comes with bruschetta, boneless wings, garlic bread, and mozzarella triangles.  The appetizers were okay, but they were nothing to write home about (and not the reason you go to Giordanos).  Now on to the star deep dish!  We ordered the Chicago Classic and the \"meat and more meat.\"  Both had a ton of toppings and oodles of cheese - just like a great deep dish is supposed to have!  Get out your fork and knife and be ready to dig into all the ingredients.  The ratio of pizza sauce is also spot on, and the quality of the cheese they use is awesome.  Look for that cheese pull!  I think I liked the Chicago classic better than the meat and more meat, but both were delicious.  The slices are huge, so don't expect to polish off more than 2 slices a person. <br> <br>You have to wait about an hour for the pizza to cook, so keep that in mind when ordering.  The served asked us to order first, and that's exactly what we did.  If you know what you want, I recommend ordering the pizza right when you're seated.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wmG13e8LescVIXFy2TNeZA/348s.jpg", "caption": "Deep Dish  -- this is the \"meat and more meat\""}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JXyMOK3pSXPwoYjk4WQs2w/168s.jpg", "caption": "Let the cheeeeese action begin!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cHRL3FggxCyHzcTprYFd8w/168s.jpg", "caption": "Cheeeeeesy deliciousness!"}]}}, {"review": {"des": "So...apparently there is this big debate about who has the best pizza in Chicago. Giordano's vs. Lou Malnati's. While here in Chicago, I will attempt to try both to compare. First stop was Giordano's. We stopped at the location on Rush St because it was very close to our hotel. We walked in at about 4:30pm and the first level was full and the second level was pretty empty. There are a lot of booths downstairs but nothing but tables upstairs so if you request a booth, you may be waiting a while. Giordano's is very modern and upbeat. What really impressed me was the sinks in the bathroom! It's a faucet and a hand dryer all in one! I need one for my apartment! They have sports playing on big screen TVs and the music was Top 40 as well as new releases. Mariah Carey's new album just dropped today and they were playing songs from it. I was shocked! We ordered \"The Special\" deep dish stuffed pizza. They told us it would be about 40 minutes to prepare so we ordered boneless wings as an appetizer. The wings were good. Nothing to write a book about. The pizza....the best pizza I've ever had. In Detroit, we have a place called Pizza Papalis that serves Chicago style pizza but it is ZERO compared to the real thing. Cooked to perfection and packed with cheese...be sure to get footage of your cheese pull and stop the waitress from playing your slices. If I could critique one thing...I would say the thickness of the crust. Its really thick to the point it can be hard to cut through with a butter knife. <br><br>Hopefully, I will be able to test out the competition by as of right now...Giordanos wins by a LONG SHOT! Absolutely amazing pizza!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZnDvdMBIKZEvlshdMv_cxQ/168s.jpg", "caption": "The Special"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QnQaF4VNBxsN6hAIEqRKjw/168s.jpg", "caption": "A slice of The Special.  AMAZING!"}]}}, {"review": {"des": "I want to preface this review by saying I'm not a fan of deep dish pizza.  I'm a Buffalo native and prefer a pizza that's thicker than NYC but thinner than Chicago. <br><br>We recently went to Chicago for a quick weekend trip to visit friends.  We flew in on a Friday night and were staying around the Magnificent Mile area.  It was pretty close to 9 pm so our friends recommended Giordano's.  They said it was their favorite pizza place they've found since moving to Chicago from Wisconsin and Buffalo. <br><br>We were seated immediately (table of four).  Zero wait - nice!  The server was extremely attentive and brought our drinks right away.  He let us know that a typical deep dish pizza takes ~ 45 minutes to prepare.  We decided to order some fried cheese curds while we waited. <br><br>The fried cheese curds come with ranch and marinara dipping sauces.  Oh my god.. yum!  I could eat these all day long!  They were the perfect consistency and packed so much flavor!  <br><br>The server brought out our large cheese and pep. pizza and cut the slices for us.  I've never seen a pizza with so much cheese!  It tasted really good, but again, I don't think I will ever be a true deep dish fan.<br><br>What really impressed me about this place was the attention to detail and the service.  My husband's pop (soda) glass was NEVER empty.  The server was pleasant and it made for a really nice visit to the restaurant.  We'll be back if we're ever in the Chicago area again!", "pics": null}}, {"review": {"des": "Apparently it's Giordano's versus Lou Malnati's in Chicago. I told to go to LM's over this place and I did the first night. However, on the second night I was in town, I went to Giordano's and liked the pizza better. It still wasn't amazing, but it was better. It was less expensive for a way bigger pizza and the pizza was stuffed. I'm still not a fan of deep dish over my east coast thin crust, but I did like G's over LM's.", "pics": null}}, {"review": {"des": "Giordano's was our first stop after landing in Chicago. This place came highly recommended to my boyfriend and I who were visiting Chicago. The staff was really nice and the prices are fair. The atmosphere upstairs was fun and it's a great place to watch sports. My boyfriend loved his beer but wasn't a fan of their wings. If you are going to try \"the other\" famous deep dish pizza, start here because it'll only get better later.<br><br>Giordano's was not mind-blowing amazing, but it will fill a hungry tummy and make you want to eat pizza every day for every meal because you'll have so much pizza leftover! Haha calories don't count when you're on vacay", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Bq_wldiAG4-5nndD481S1A/168s.jpg", "caption": "So cheeesy"}]}}, {"review": {"des": "Whenever I'm anywhere near Chicago, it's a must that I visit Giordano's. My buddy and I went because we wanted Chicago's famous deep dish pizza. The pizza is so good, I just wonder how places like Pizza Hut & Domino's stay in business over there. What makes it so good. It's all the layers of cheese and sauce and meat (we order pepperoni). <br><br>The only downside about this pizza is that it's not cheap. It is pretty expensive but hey, you get what you pay for. It's delicious. And it is a lot of food! Me and my buddy were pretty hungry so between the two of us, we finished the entire thing (crust included). I don't know how many calories a large is (and I don't want to know lol) but if you are in the area, treat yourself to some really good pizza!", "pics": null}}, {"review": {"des": "I visited Chicago from Des Moines, and on the recommendation of my partner, went to Giordano's. Our waitress was very friendly, and we were thankfully able to split our toppings on the pizza. The pizza was pretty good. I think it's legendary status built it up a little too much in my mind, so I came out slightly disappointed. The actual ambiance was different than I expected too. There were big screen TVs playing all the games which I thought were distracting. Overall, it seemed like an oversized sports bar with better than sports bar food. <br><br>I'm still giving it 4 stars because the staff was amazing and the food was pretty good.", "pics": null}}, {"review": {"des": "I stopped in and waited at the bar for my food \"to go\" which consisted of a deep dish pizza.  The crowd appeared to be mostly tourist and part possibly local people who wandered in from Michigan Avenue.<br><br>The Deep Dish was just OK.  As always-it takes a long time to cook-so if you are in a hurry-don't expect to get in-and-out quickly.", "pics": null}}, {"review": {"des": "Ambiance<br>Giordano's in Chicago has a nice industrial look and feel inside.  Definitely a real nice place to eat.  It's a cool place to kick back and drink a beer and have some pizza.<br><br>Food<br>Getting Chicago style pizza is one of the main reasons to eat in the foodie scenes in Chicago.  Order ahead instead of waiting 45 minutes in the restaurant.  The crust tastes like a pie crust to help with the deep dish taste.<br><br>We ordered a half and half pizza.    <br>Half Chicago Classic<br>    -Classic Chicago style pizza.  Super meaty and tasty.  <br>Half Bacon BBQ Chicken<br>    -This is topped with a ton of BBQ sauce. The bacon tasty and blends well with the pizza. <br><br>Service<br>The customer service is good.  It is way more about making sure to order ahead.  We sat there for a long time because we did not order ahead of time.  The pizza came out very quickly once it was ready.", "pics": null}}, {"review": {"des": "BEST.  PIZZA.  EVER!<br><br>If you are in the Chicago area, coming to this place is a must!   Delicious sauce and Buttery crust.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qPQdvlX5NOSO3gFqv6VMCw/348s.jpg", "caption": "Slice of meat & more pizza."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/h_Y2CNYCmnJrAkAK-HpThg/168s.jpg", "caption": "Pizza fries!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1qC0tkZo-1qiUZEz5VCwdw/168s.jpg", "caption": "The meat & more pizza with pepperoni, Canadian bacon, and sausage."}]}}, {"review": {"des": "When in town, go to Gio!<br>Their pizza never disappoint. I love Chicago deep dish!", "pics": null}}, {"review": {"des": "RJ and I stopped here for a drink Oct 4. I have had their pizza before in Orlando, we just wanted dessert. We sat at the bar, and ordered the salted caramel cookie with vanilla ice and caramel sauce. It's not like it was homemade, but it was good enough, yum!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_zWbLd_HvaPjzaIX3aK4_A/348s.jpg", "caption": "Salted caramel cookie with vanilla ice cream and caramel sauce"}]}}, {"review": {"des": "Quite a line outside when we checked-in.  We should have heeded the hostesses' recommendation to pre-order the pizza, but the kids didn't want to spend time with the menu.  Our text notification of the ready table came fairly quickly.  We were seated upstairs in the middle of a crowded room.  They warn you of the 45 minute wait for a pizza, and it felt even longer!  Our server was ok, but quite busy with other tables that were ordering more alcohol.  Pizza was awesome, but not worth the wait if you are with hungry kids or didn't pre-order.", "pics": null}}, {"review": {"des": "I went here a few years ago because everyone needs to go here when they visit Chicago, but my wife and I were not impressed at all. In face, we told everyone traveling here to go somewhere else for their deep dish fix. <br><br>I returned to Chicago last week for a work event and had no desire to go back here. Once night my group ended up ordering pizza into the hotel to work on a project and the food changed my mind. <br><br>The pizza was fresh and delicious. I enjoyed both the deep dish and the thin crust. It was delivered fresh. <br><br>I would now recommend this place to anyone - or at least recommend the delivery. It's not the bar for deep dish pizza (that is Zachary's in Berkeley, CA, in my opinion) but it was definitely solid.", "pics": null}}, {"review": {"des": "Has the best deep dish pizza I've ever had. Gooey cheese with toppings makes for a warm meal. The atmosphere of the restaurant was nice and cozy. Space was large. The location is a plus too.", "pics": null}}, {"review": {"des": "This is my second time here and they surely did not disappoint. This is everything you would hope deep dish would taste like! The last time I went we waited for them to open and were one of the first in that morning. It did take a while for the server to come to our table but we just assumed it was because they were still setting everything up. <br><br>We ordered a pepperoni and sausage deep dish pizza. It.was.everything! I'm talking perfect amount of cheese oozing out of it with a savory sauce all packed in the a golden crust. We ordered the smallest one and barely even made it half way. Only order an appetizer if you are really hungry and need something as you wait or if you want to take home leftover pizza.  warning: It does take a while to cook however they do let you know as soon as you order.", "pics": null}}, {"review": {"des": "Great deep dish pizza and not a long wait on a very busy night. Great atmosphere with lots of tvs for sports. Waiter was awesome and very efficient and attentive. Large pizza was more than enough for five adults.", "pics": null}}, {"review": {"des": "I hadn't had deep dish since probably 20 years ago at a new chain restaurant in western NY, so given i was in Chicago I HAD to try some local pizza. This place was nearby my hotel.  First after walking in they told me the wait was 15-20 minutes, but conveniently texted me in about 5 minutes that a table was ready.  The cool part is they ring you up for your pizza if you want to \"pre order\", and then you just give your ticket to your server when they show up.  I did just that, had the \"Chicago Special\", and at first when he said 40-45 minutes until the pizza arrived i was a bit disappointed, but to my surprise it showed up after about 15.  Now to the pizza.... it was freaking amazing and everything i imagined. Its still not NY pizza (half joking), but man i could eat that any night of the week. Worth the hype.", "pics": null}}, {"review": {"des": "I'm from Bay area visiting Chicago for a weekend. I was told by friends that I gotta try deep dish pizza. I saw so many reviews here and it's right next to the hotel we stayed so gave it a shot.<br>We came here around 5, not crowded but right after we ordered ,it bacame packed!!! So long line. Really glad we came earlier. Also deep dish pizza takes 45mins to make.pre order is highly recommended.<br>About the food. I'm Asian in my 30s. It's too gleasy for me. Maybe good for younger people. I felt a little sick after this but enjoyed iconic Chicago food as once in a lifetime experience.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JteRU9f0PSErT1k6puexpA/348s.jpg", "caption": "The special"}]}}, {"review": {"des": "Our bachelorette party weekend was kicked off with real Chicago deep dish pizza delivered right to our Airbnb. Made with pepperoni and extra cheese it was without a doubt the thickest pizza I've ever seen. We ordered the sampler appetizer platter, calamari and three meatballs as sides. All were really good except the calamari which was only so so. That's probably mostly due to the fact it had a chance to get soggy on its way to us. All in all, it was all a good first meal in Chicago.", "pics": null}}, {"review": {"des": "Came here because everyone said of course I had to try the deep dish Chicago style pizza!<br><br>Both myself and my date started off with Caesar salads. Delicious with amazing dressing! My date did the deep dish individual veggie pizza and I did the spica here artichoke feta thin crust small pizza. Well everyone is right about deep dish being the specialty! My dates pizza was delicious while mine was so so. Seemed a little to heavy on the salt and garlic for both of our preferences. Staff was really nice and made sure to explain to us everything and then even suggested some places to check out before we left since we aren't from the area. <br><br>Definitely check out and make sure you go deep dish style!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/XsYOgwyIF2EzYP5Cck1cog/348s.jpg", "caption": "Spinach feta artichoke thin crust"}]}}, {"review": {"des": "While in Chicago pizza and lot of Italian food is a must.  We started the trip with a walk over to Giordanos.  We had a group of 7 and put our name in and headed to the bar.  We ordered our deep dish pizzas since we were hungry and knew it would take around 45 minutes.  We started with Goose Island's green line, it was good not great.  After about 20 minutes we were seated, there is a huge 2nd floor and it was baby friendly.<br><br>We started with calamari and garlic cheese bread.  The calamari was good, but wasn't worth the space with all the other great food we ordered.  The cheesy bread was good, a bit salty but I liked it.  We also got an Italiano salad.  The dressing on the salad was awesome and a highlight in my opinion.  The pizza came out right as the apps came out, but we were hungry so no biggie.  The pizza was awesome, just as I remembered it.  We ordered way too much food and I was barely able to finish my second piece of pizza.<br><br>In Chicago this is a must.  We have ordered the deep dish pizza to California and it is always a treat and makes for a good night to pretend like we are in the Windy City, we highly recommend it.", "pics": null}}, {"review": {"des": "Cant go wrong here!!  Stopped by for lunch while on a day trip from Michigan.....love the space...great renovation!  Our waitress, LaLa was such a doll!!  Very welcoming....quickly took our orders ....took great care of us!  Pizza is great....as always.", "pics": null}}, {"review": {"des": "Finally have tried Chicago style pizza in Chicago!!!!<br><br>I wasn't disappointed by all the hype I heard about the deep dish pizza in Chicago. I have to say the rating is purely on the food itself, I'm not rating the service which was below average.<br><br>We ordered the house salad and an individual deep dish pizza. Wanted to try the pizza without getting completely full because had a dinner reservation in \"Next\" 5 hours after placing our order. The pizza was small but was perfect for our purposes. We included in it garlic, broccoli, mushrooms and black olives. Everything thing was super tasty specially the cheese and the dough. <br><br>It took our tiny pizza 40 min to be ready. Not sure if this is the usual time to wait for a deep dish pizza or if they had a very slow service. Even though we went around 3:30pm and the restaurant was half empty. <br><br>I highly recommend trying this pizza if in Chicago. They also had very yummy desserts but maybe will get to try them next time!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sMw9aPJCVclgtenSBmslfg/168s.jpg", "caption": "House salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7OttL4KBAxCLvm9a3pc27A/168s.jpg", "caption": "Individual pizza"}]}}, {"review": {"des": "I love deep dish and Chicago is typically the only place I will eat it. This establishment has a very lively and fun atmosphere and this is by far one of my favorite stops for deep dish pizza.  <br>I typically prefer the cheese pizza, there is no shortage of cheese, the sauce is layered on top and the crust is the ideal texture, one recommendation would be to add extra sauce.  This pizza doesn't feel to dry while your eating like other deep dish pizzas I have had.  The next time I am in Chicago this will be a stop to make.", "pics": null}}, {"review": {"des": "This was like no other pizza I've ever had before. I can't eat dairy, but I make exceptions for very few things And I'm glad I did it for this. However, this was the cheesiest, possibly two cheesy, pizza I've had in my entire life. The crust is absolutely delicious, thick, crispy on the outside, soft and doughy on the inside. Tons of sauce, a thick layer of cheese, and then more sauce and vegetables on top. This pizza has so much flavor that the vegetables were completely irrelevant. Next time I come, I'll be getting a plain pizza. Word of advice, appetizers are not necessary if you are sharing a pizza for two people. The pizza is so heavy that you won't want to consume anything else. It also takes about 40 minutes for your pizza to come out. They did not warn me about this and we were almost late to a show we already had tickets to. Be aware of this.", "pics": null}}, {"review": {"des": "So... this was my first time in Chicago with my boyfriend & we've been hearing about this \"to die for\" Chicago deep dish pizza. Oooooh man.... yes we almost died...... this pizza was terrible.. no words.... I felt like I was eating greasy tomato soup with a size of old hard bread. Yuck! I do not recommend at all.", "pics": null}}, {"review": {"des": "The atmosphere is fun and lively.  Nice service upon arrival <br><br>Ordered two different draft beers - both flat.  Guessing because they aren't rinsing their glasses correctly (I used to work at a bar and the way the bubbles just went away with no head makes me think that)<br><br>Once sat, the waitress was nice and friendly   She brought out the sampler platter which was terrible.  I've attached a picture of the bruschetta which was a Chunk if mozzarella on a dry piece of bread   Bizarre. The garlic bread was dry also. The mozzarella triangles were fine   The boneless bites had sauce on the side which was just not good <br><br>We ordered a small cheese ($18) and small pepperoni ($21). Both had dry crust that was super bland. Their sauce doesn't have a fan in me but if people like a pepper taste maybe they will like it? <br><br>Lots of people in line here so not sure if we just got a bad batch?  But I cannot recommend people Come here", "pics": null}}, {"review": {"des": "Couldn't visit Chicago and not have their deep dish pizza. This was highly recommended and it was good. It was not amazing. Service was a bit slow and it was not too busy but maybe understaffed? Took long to get our food, although I know it takes 45 minutes, it took longer than that. Overall good experience. Pizza was a little dry and over cooked but still cheesy and topping were great.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DWjAv8YZEDmJMD7mRnzMJA/348s.jpg", "caption": "Appetizer cheese bread. Pretty yummy"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mXkhDfB_F-m759t4-4svWg/168s.jpg", "caption": "Individual pizza. A little dry but overall tasty and very cheese."}]}}, {"review": {"des": "Hands down, no comparison to Lou Malnati's... BUT since some people insist it is, I decided to give it a try. My first impression was that it seemed to be extremely franchised, not at the atmosphere of the last Lou Malnati's that I tried. <br><br>We sat at the bar and order a few drinks. They had a nice variety and of beers on tap and a reasonably priced line of house wines. But since you're only wondering about the pizza, here it goes. Way too much sauce! The bacon was burnt and there was hardly chicken on the BBQ, chicken and bacon deep dish medium pizza. I appreciated the fact that the bartender warned us that it was a big portion. This we knew but had planned on eating leftovers as our pizza. That didn't happen. <br><br>Final mentions... it took forever for our pizza to arrive. I noticed at least two other surrounding tables, who arrived after us, receive their deep dish pizza way before us. When we finally received it, it was not as hot as one would expect. It had obviously sat before it was served to us. Oh, and a dollar charge for a side of ranch?!?!! And she took it away, so I didn't even get any of it to go.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/195Waur1L5AMnqmAA7vIUg/348s.jpg", "caption": "BBQ Chicken deep dish... not recommendable"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1T0iuVQ-zTE9YiuW1n8ZTA/168s.jpg", "caption": "Everyone at the bar on their cell phones"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WJPcrBYXIbTOGs3ouy4O7A/168s.jpg", "caption": "BBQ Chicken deep dish... not recommendable"}]}}, {"review": {"des": "Was pleasantly surprised by the price and food value. Lunch specials until 3. Worth the $10 for an entree plus soup or salad. Being on vacation (and a fat man lover of food), I over ordered! Chicken parm sandwich was awesome. The ciabatta bread it came on was soft and delicious. The chicken was good and not the nasty injected chicken patty we far too often find across America. Tomato basil soup was wonderful. Parmesan fries were very good. Pizza was the tastiest of all the big chains I have had in the Chicago area. The sauce, I think, made the difference. It's a bit sweeter than the other guys.... blue cheese wedge salad for $5 was great. Fresh blue cheese crumbles- who would have thunk?!?!?! Had a sampler appetizer platter. Everything good on that as well. This will be my new \"go to\" for pizza while visiting Chicago!", "pics": null}}, {"review": {"des": "Always consistent service, always fantastic food<br><br>The 730 N Rush Store is totally remodeled since my last visit.<br><br>FANTASTIC PLACE TO WATCH SPORTS!", "pics": null}}, {"review": {"des": "First, I will say, when in Chicago you have to try this pizza to see if it's for you. Unfortunately, it was too much for me. We got the pizza delivered to our hotel room, which was a plus. The pizza is super rich and cheesy, which hurt my stomach. I could barely get thru a slice. The sauce was good, however. I wish I liked it more, however it is a Chicago staple.", "pics": null}}, {"review": {"des": "Terrible Pizza, Terrible Service, What happened to this location?<br><br>We stopped by on 8/25 and knew on Saturday night ordering deep dish, things we gonna take a while but, we had no idea what was in store for us.<br><br>So, Seven of us put our name in for a table and preorder 2 pizzas (1 thin/1 thick) and head to the bar. The place was packed but, the bartenders were quick to get us drinks. After 20 minutes we were surprised that our table was ready. Up the stairs we went with drinks in hand and were seated shortly. The waiter greets us and we give him our preorder pizza ticket and he says we have another 30 minutes or so. We order salads and apps. Those came out fairly quick and another round of drinks is ordered - Then time stops!<br><br>Waiter disappears for a good twenty five minutes after he drops off the apps. We are now 10-15 minutes pass our pizza time. No biggie but, waiter stops by to pick up plates and bring set ups for the pizza. He's gone again now for 20 minutes and I decide to find a manager since we are way past our pizza time and have absolutely no drinks or no service really at all. <br><br>Noticing that I'm speaking to a manager the waiter returns to our table and is questioned about our pizza, he says \"deep dish takes time\" but, we explain that the pizza was preordered, he says \"oh, let me check\" and promptly leaves again without taking a single drink order. Meanwhile, tables around us have all turned over and some are even getting there pizzas before us!<br><br>Once manager is involved pizza is hastily delivered and doled out quickly. Until they realize we are missing a plate and silverware. Manager rolls his eyes and runs to get some, as does the waiter. The waiter returns with a plate and napkins and the manager never returns to check on us. He actually only served half of our table slices and left one piece of deep dish on its side - ridiculous!<br><br>Deep dish pizza was okay, may be a little cool from sitting too long. Thin crust was a joke, burnt cheese and hard crust but, doughy & under cooked as well - really bad. May be they forgot order and rushed it thru? Not sure but, it was so bad I couldn't even choke down 2 pieces and I hadn't eaten since breakfast.<br><br>I get second manager involved to explain the problems. Oh, and still no drinks, no waiter, no refills of water. Crazy!<br><br>Second manager, takes care of us, takes both pizzas off the bill and offers a round of drinks but, after almost 2 hours we just want to go and get some real food. He was nice but, unfortunately way too late.<br><br>I'm gonna be honest, growing up in Chicago this was not my number one deep dish but, they always did a good job and served quality food. This location used to be much smaller - may be instead of how many people you can seat, they should make sure that everyone is trained up the the high standards Giordanos has had for decades. Too big, too fast, $$$.<br><br>A sad example of a classic Chicago staple.", "pics": null}}, {"review": {"des": "This restaurant is definitely a must visit in Chicago, IL if you have more than two hours to spare...While the food is delicious, the restaurant is crawling with tourists and has a long wait time to be seated and to be served. <br><br>We dined with beer and pizza which is the perfect match. The deep dish pizza was excellent and left us full AND we even had left overs to spare.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5LDo3exojTEesRM1w7oKgA/348s.jpg", "caption": "Pizza Pizza!"}]}}, {"review": {"des": "Came here on a Saturday during lunch hour and the wit wasn't bad 20 minutes to get our table. The food however was 1 hour and 15 minutes. We ordered our pizza as soon as we got there because we were told it takes 45 minutes to make. It still took too long and our waitress took 20 minutes before she brought our drinks. The pizza was good, but not the greatest. This place used too be better. The quality has gone down. Normally I wouldn't mind the wait if the food was great. But in this case not really worth it.", "pics": null}}, {"review": {"des": "The most delicious deep dish pizza True Chicago Style Pizza.   Fresh ingredients and attentive service.  All we expected from this classic place.  Can't have enough, so we returned for a second time.<br>I had a deep dish with chicken breast, ground beef and Canadian bacon in tomato sauce.<br>My wife had a deep dish in white Alfredo sauce with  onions, mushrooms and tomatoes.<br>Location is well ambient with TV screens and attentive service.<br>Soda (Pepsi), sorry coke fans, is refill-free.<br>Giordano's sampler was a good call !<br><br>Other comments:  <br>Clean restrooms (+)<br>Rounded/Square convertible tables not too comfy and safe on the edges (-).", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VElmMTS6fzq3PQABlna6pA/168s.jpg", "caption": "Veggies pizza"}]}}, {"review": {"des": "My first Chicago deep dish pizza was impressive!!! We ordered delivery and were not disappointed - delivery time was accurate and the delivery came directly to our hotel. The layers of the pizza were perfect and the density was spot on. Fantastic cheese!", "pics": null}}, {"review": {"des": "I mean cmon! How can you not like cheese and meat pizza?  Just get the meat and more meat and fall in love!  This review won't be long because it's not necessary. <br>There are tons of restrooms upstairs so don't wait in line for the single shot downstairs. <br>The pizza is great, the location is spot on!<br>We came on a Saturday for lunch and were seated right away. No wait before noon. The cheese pull is fabulous! Don't get appetizers because the pizza is thick and will fill you up!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2agJQj_N0CwKuKfq7zsEMQ/348s.jpg", "caption": "Worth the wait!"}]}}, {"review": {"des": "Not a fan of deep dish pizza.<br><br>I want to start off by saying that I am not a Chicago or Chicago deep dish fan.  I would much prefer a New York style thin crust pizza.  If you ever get to New York, every pizza place is amazing.  Any random spot is the best pizza you have ever eaten in your life.  <br><br>So... this pizza is probably good for what it is and those that are into deep dish pizzas most likely love this place.  My wife had me try this because she absolutely loved Chicago and all the food that came with it.  This was one of her favorite places, so it probabally is great in some folks eyes, but this was not for me.<br><br>Sometimes more does not mean better.  The pizza here is ridiculously big, but what do you really get out of it?  A lot more bread and a bit more sauce and cheese....", "pics": null}}, {"review": {"des": "Clinging by it's fingernails on an icey ledge of two star assignment, I freakin' new I was ripe for the taking in this storied trap.<br><br>Post bellying up to the bar and ordering, this younger middle-aged buffoon who arrived just a moment after, didn't seem to have any public manners. See 'How Not to be a Jerk While Eating Out' on my blog. He was a multiple offender and nobody gave him a few words or the proverbial Heeve Hoo. Clearly he had been throwing a few back prior.<br><br>I went personal & traditional in size and ingredients, ya know -- to REALLY show how much of a clueless tourist I can be with my order. (Sausage, green pepper, onion & mushroom) To be fair, the ingredients did not seem to be taken from a lower level of Grade B supplier.<br><br>Reading about Mama Giordanos story from the menus rear, it evoked nothing as everyone has a Mama Somebodys Italian eatery somewhere near. And just using the term Mama in a restaurants name  just smacks of trouble to me, confirmed again.<br><br>Digging hard for a single saving grace from a food perspective, sadly I can't give more than the one -- I really wanted to though. Having no scrumptious Chicago deep dish tale upon my unvictorious return home, to tell my hyper affectionate pizza loving buddies about is quite unfortunate.<br><br>A saving grace from an employee level? <br>Two affirmative & one negative.<br><br>Affirmative: The female bartender who was a dear and brought true professionalism to this tourist only eatery.<br><br>Affirmative: The manager on duty who listened intently to my mention of the bar buffoons behavior.<br><br>Negative: The upper middle aged large desk ape, who, while clad in rapidly fading black duds just hung to the podium and glared saying nothing, just glaring at me from top to bottom as I was communicating with above said manager. Keepin' it classy bro.<br><br>No golf channel? Seriously?", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Cw1sNd0XvBC49BnAqLjZ5g/348s.jpg", "caption": "Traditional Chicago Deep Dish personal size --- oh, yea -- and cheap beer."}]}}, {"review": {"des": "Atmosphere is very nice. I love that it feels like a more upper scale pizzeria. The music is nice and not too loud or low. The TV screens play what's happening so, right now, it's the Winter Olympics. <br><br>Wait staff collected plates and filled water throughout. They were very prompt on delivering drinks as well. The place is well put together and clean. Our pizza was catered so it was not hot. Not sure if it was just made in advance or what.<br><br>The view is nice from the second floor and I enjoy that the the location is tucked off and not on the Main Street. <br><br>Food: I had such high expectations. I had deep dish pepperoni and a side of salad. Side salad dressing tasted like mostly vinegar and wasn't pleasant. If I could have chosen, I'd have changed the dressing but, again, the event was catered. If I asked, they may have obliged. The pizza is huge and ultimately feels like a lasagna. It's very weird, I think. Everyone seemed to really enjoy it so instead of the 3 stars, I'll give it 4 and the customer service was superb.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IYQaOT1o2K-GaVzq_STRRg/348s.jpg", "caption": "I love the exposed brick look"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CD8LOr0PN4O3967cg-eTDQ/168s.jpg", "caption": "Stairs leading up are cool"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oS7a8yh_3oIojNf0O3I6-A/168s.jpg", "caption": "Upstairs dining area"}]}}, {"review": {"des": "Deep dish pizza was okay but i've had better in past. Seemed the bread was under baked maybe not sure but it didnt taste the same. The appetizer sampler was great, so was the italiano salad !", "pics": null}}, {"review": {"des": "no wonder they have huge lines during meal times. <br><br>this place has street parking and no private parking. I am not sure how hard it is to find parking around here because we walked over so make sure to look out for the parking situation in the area. <br><br>we had a bit of a wait to get a table but it was not super bad as our party was just 2 people. we went to the bar to get a drink while we waited and the table was ready so quick that we didn't even finish our drinks and the table was ready for us. <br><br>also another ice thing they do is that they take your order while you are on the wait list so they can start cooking your pizza as soon as you have your table. <br><br>we were quick to order to make sure we didn't have to wait too long. <br><br>MOJITO- I got a mojito, it was nothing impressive, it was a normal run of the mill mojito but none the less good. <br><br>CALAMARI - I was pretty impressed with their calamari, it has a nice consistency and not the rubbery traditional calamari consistency, the one weird thing is that they also fry some lemons and it does make the calamari better tasting but it also makes the amount of the serving a little larger than it actually is, but for 2 ppl it is a pretty good size serving.<br><br>DEEP DISH ORIGINAL- we got the original deep dish Chicago pizza, we were such tourists lol. the pizza was pretty filling and good. the medium one can feed at least 4 people and so we had a lot of left overs lol<br><br>we had a great time here and the pizza was pretty great. they do make justice to their name for sure. when going to Chicago to get some pizza make sure to come here and do not go around looking for a cheap option you will not get such quality that is for sure, I have the experience to be able o say it.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/t35qgxehs521JB4IymgQQA/168s.jpg", "caption": "mojito, not impressive but does the job"}]}}, {"review": {"des": "Not sure what else I can add to the already incredible reviews it has. I got a personal size deep dish and it was incredible. Just a heads up it takes about 45 min for it to be ready so order as soon as you get there but its worth the wait. <br><br>I did carryout but they have a fair amount of seating and pretty large bar", "pics": null}}, {"review": {"des": "Wish we'd skipped, we were looking for authentic Chicago flair and instead we consumed chain Chicago pizza. Plain Jane, nothing spectacular but the service was good.", "pics": null}}, {"review": {"des": "Upon arriving in Chicago, we had our heart and stomach set on trying Giordano's. <br><br>Being a California native, we were excited to finally try deep dish pizza from Chicago ! <br><br>Our experience here : ... mediocre service, mediocre food and drinks. <br><br>We literally went out of our way to eat here. <br>We were seated immediately ( it was Super Bowl Sunday, so the place was fairly empty). <br><br>Our server came by and took our orders. <br>We had our heart set on ordering deep dish pizza, but he kept insisting we get something else because \"it's going to take an hour to make\". We were fine with the wait. But for some reason he kept pushing other items our way... not exactly sure why. <br><br>We had also order the lasagna, and it looked beautiful. But it was very bland. The tomatoes /meat sauce lacked flavors. <br>Our pizzas, both were...one word : SALTY. <br>It wouldn't have been too bad if we had water, but our server never brought us water and we asked for iced water. But he simply forgot or was too focused on watching the super bowl game that he didn't care. <br><br>Would I come back ? Nah. There's sooo many good places in Chicago. Checked this off my list and probably won't ever come again.", "pics": null}}, {"review": {"des": "Amazing pizza! I love the deep dish myself. Definitely make a point of going there every time I am in Chicago!", "pics": null}}, {"review": {"des": "Ordered a pizza Togo through their online ordering system, which was simple. I ordered the deep dish meats pizza. The estimated wait time was listed as 45 minutes due to the nature of how the pizza is made. I arrived at the Togo counter promptly at the 45 minute mark. I was greeted immediately and was informed my pizza is being boxed now. Once I got home, I opened the box and the pizza was piping hot! The cheese even looked like the pizza commercials where the pizza strings off! Definitely an amazing pie in Chicago. Give it a shot while in town, you won't regret!<br><br>Also, I got the small pizza and it was enough for 2 adults to be completely stuffed. It was HUGE!!!!", "pics": null}}, {"review": {"des": "AH-MAZING!! So, during the conference in Chicago (June of 2018) I was on a mission to try every kind of food I could!  Since Chicago is known for pizza, I just had to try Giordano's.  <br><br>They had really good reviews and I agree, they earned them.  <br><br>I didn't like the waiting area set up though.  Everyone was stuffed in the small entryway waiting to be called and there was not any beeper system or anything you literally had to listen out for your name to be called which was hard from the bar area since we were trying to get out of the door traffic.  <br><br>I feel like we waited a long time for our pizza but by deep dish pizza was good. I love how the waitress didn't mind hold up my slice so I could get the perfect picture! <br><br>Check them out, so worth it! Bon appetit!!", "pics": null}}, {"review": {"des": "We arrived at 8:50pm and were seated within 5 minutes. We ordered our pizza when we first arrived and were told it'd be ready by 9:38pm. Pizza didn't arrive until 9:55pm. Pizza was very good despite being super late. Our server was not very attentive unfortunately so getting his attention was hard. Thankfully the pizza holds up to the wait!", "pics": null}}, {"review": {"des": "This place was absolutely awesome! The ambience was nice and our server was spectacular, even with a semi-busy crowd. Though, I will say in the beginning a lot of people walked past our table without uttering a word to me or my boyfriend. That was only the first 7 minutes of being seated, so I won't hold it against them. Like I said, when the server arrived she was nice, attentive, and fast. What more could I ask for?<br><br>As far as the most important part -- the food -- I was not in the slightest bit disappointed. This was our first meal of the day @ 2pm-ish, so we were already starving! Along with it being a pretty chilly day, we knew we were going to spend time eating for at least a couple hours. <br><br>For the starters we got the Garlic Parmesan Fries that had ranch as the dipping sauce. I wasn't mesmerized by the dish, but it was really delicious and got me in the right mood! The fries were fresh from the fryer and had parmesan and small chopped cilantro (?) flakes in there that enhanced the flavor. Really crispy fries and worth it!<br><br>We ordered The Special deep dish pizza that has sausage, mushrooms, green peppers, and onions in it. Deep dish pizza usually take 45 min to make, so schedule accordingly! The pizza was fantastic, and dare I say better than Lou Malnati's? It was fresh, hot out the oven, and had a fantastic crust that wasn't soggy at all. The flavor profile will definitely enhance your taste buds like never before, especially with everything paired together. Well worth the price.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/efOL4vt0vcKNm_pa_ig2cQ/168s.jpg", "caption": "Garlic Parmesan fries!"}]}}, {"review": {"des": "Ye Lie Hostess ! And that was the essence of the almost criminal like bad service at Giordano's , a family of 6 kept in dark for a long long time about the status of their order. The mystery of the burnt Gluten free pizza and the curious case of disappearing orders. I wish big chains did not have the option of hiding bad service behind busy nights.", "pics": null}}, {"review": {"des": "Looove Giordanos Pizzeria!! If you're a out of towner visiting Chicago and want to experience Chicago Deep dish I recommend Giordanos. You'll have to wait a good 40 minutes or more for the pizza but it's worth the wait.<br><br>Appetizer- While we waited for the pizza we ordered the Calamari.  I figured how good can Calamari be at a pizza place?... Very good! The Calamari were big and delicous.  Kept us satisfied while the pizza was cooking. <br><br>Pizza- Amazing! Very cheesy with a deep dish butter crust. Whatever topping you get there will be plenty of that topping don't you worry.  We ordered a medium which came out to 6 slices for 2 of us and still was able to take a slice home. I usually don't eat like this so it was definetly a cheat treat. After eating almost 4 slices I couldn't move.  Glad I walked all over the city afterwards.  Pizza is pricey but it's a tourist favorite and very filing in downtown Chicago so you could expect it.  Chicago tradition every time I'm in town.", "pics": null}}, {"review": {"des": "I am a Chicago tourist so obviously had to check out the popular deep dish spots. <br><br>Giordano's is a cool place - I liked the brick/industrial vibe. Service was good too and the pizza came when expected. (Expect about 45 minutes if you're ordering deep dish) <br><br>Honestly I just didn't think their pizza was that good. I'm a big fan of mozzarella cheese, but this thing was loaded with thick, not fresh mozz so it was just a bit of a turn off for me. If you don't mind an overload of cheese, this place is for you!", "pics": null}}, {"review": {"des": "We had a bit of a wait, but you can pre-order while waiting. Not sure the benefit as it still took a while to get our zas. <br><br>Wife and I each got individual pizzas. I got chicken sausage, spinach n mushrooms and the wifey got sausage, green pepper and mushroom. Seasoning was a little bit lacking. Crust was pretty bland. I was expecting a knockout punch of flavor but it was just a baby jab. Still a cool place to see how they make the deep dish. Overall it was decent. <br><br>Eating here has confirmed that NY pizza is far superior to Chicago deep dish. <br><br>3.5 stars.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qiVBFaNBXCeiMcbApwnwdg/168s.jpg", "caption": "A little bland."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/V-5ZbOJC_mox_X4SpnfPEQ/168s.jpg", "caption": "Deep dish Za"}]}}, {"review": {"des": "With each bite I wanted more!  Ok. Hate the wait. Hate the system. But I would rather be texted than hold some bulky flash and vibrate device.  So being texted was positive. <br><br>Ordered the Chicago style pizza. I think letting the pizza rest for five or 10 minutes before digging in is the smart thing to do. I say this because as I got into another price everything seemed to meld into a great bite. The crust alone is not amazing but the entire bite is!  The establishment was clean. Staff was friendly but no one smiled. <br><br>Enjoyed it!", "pics": null}}, {"review": {"des": "I've been critical of the Chicago Style Deep Dish pizza until finally trying this popular chain. This place is really really good. We tried their Famous Stuffed Deep Dish Pizza; well done and stuffed with vegetables and meatballs. Worth the typical 45 min to 1 hour wait and more. The restaurant space was notably spotless and the service was surprisingly over-attentive. Five stars for Giordano's.", "pics": null}}, {"review": {"des": "Below average service is an understatement, completely.<br><br>First time in Chicago ofcourse you have to get deep dish. Decided to go to Giordonos! 10 minuets walking distance got there at 11pm. Decided to do take out because I didn't want to burden coming before they closed at 12am.<br><br>Got to the to go counter and grabbed a menu. Finally decided on a personal pizza. Estefania (who I will be referring to) is the rudest person I've ever encountered in service. Simply asked her if her the small prices were listed and she replies \"whatever is on the menu is listed.\" Strike 1.<br><br>2. She told everyone else after me that there was a 20 minuets to an hour wait. If she would of told me this I probably would of left and came back but I didn't hear this until 45 minuets into ordering. Also told them there were slices available if they didn't want to wait! That would of been perfect! But nooooo.<br><br>3. She called everyone that ordered after me and then asked what did you order. And I asked her how long and then said everyone got there pizza before me. She said Idk what time you ordered and I don't care and walked away. Came back and said oh 5 more minuets.<br><br>Btw she's eating behind the counter, which I'm pretty sure you can't do in service and continued to treat me different from everyone. <br><br>I will be calling there corporate office and the general manager of that location due to the service and also due to the fact I waited 55 minuets for a pizza without a single apology. Thank you Estefania for the horrible service I really hope you don't have a job anymore.<br><br>****update pizza was amazing***", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/afAnwfM9YXMYfJEVxHjSCg/348s.jpg", "caption": "The girl oh so happy with another customer."}]}}, {"review": {"des": "On our first night in Chicago, we went to Giordano's for some deep dish pizza experience. Honestly, I was disappointed when I saw the outside, reminded me of a typical chain restaurant. Which made me think I was fooled into a marketing scheme.<br><br>Upon entering, it was a very crowded Thursday night crowd, we were checking-in and it would be 20-30 minutes wait to be seated, but around an hour to get the pizza. They had a system, where you can pre-order the pie, while waiting for your seats! <br><br>Finally seated, we ordered drinks and the bruschetta....it was amazing! I don't have photos but it was a great balance of taste and texture. Well expected! Shortly after, we got our pizza and we were very pleased going deep for the first time! We ordered the Chicago classic (pepperoni, mushroom, green pepper, onions and tons of cheese).<br><br>We would recommend it, just be careful not to order too much, our small pie would have fed 3-4 people, especially with an appetizer. <br><br>Service was fast and friendly, very efficient! The place inside was legit, there was a window where you can see them making the pizza. Very crowded, but not cramped.<br><br>Must-visit if you've never been!", "pics": null}}, {"review": {"des": "Tried this place out while we stopped in Chicago it was average pizza. All the reviews said it was the best in town I would disagree. <br><br>The appie sampler we ordered came cold and incomplete missing items. It was really nothing special at all. We were very disappointed in this item. <br><br>The deep dish pizza was tasty but not the best pizza I've ever had by far. Maybe it was an off night but I really don't think so.", "pics": null}}, {"review": {"des": "Upon landing in Chicago, we were famished and in need of a meal near our hotel. Since Giordano's seems to be the dominant force in terms of Chicago deep dish pizza, my friends and I ventured to the closest franchise.<br><br>We pretty much came within 30 minutes of opening and the restaurant seemed relatively empty. I say relatively because even though there were a handful of groups, the restaurant is two floors with generous space, giving the appearance that it was empty. There was a fair amount of staff on hand, probably to prepare for the lunchtime rush.<br><br>We were sat promptly on the second floor at a square table near the windows. We ordered a medium with half being Bacon BBQ Chicken and the other half as Meat and More Meat pizza. The waitress let us know that it would take 45 minutes to make, which is reasonable as it is indeed a very thick pizza. <br><br>Moving on the food, I would say if you never had deep dish, this may be a  standard to compare other deep dishes to. I haven't had all the deep dish pizzas in the world, but I would imagine this to be quite average. The crust filled deep dish contained much cheese, but because the amount of bread that this pizza contains, it didn't make me feel that the cheese was overwhelming. This is good as I'm not the biggest fan of cheese. Also, the cheese seemed to be more dense compared to the stringiness of NYC pizza. <br><br>The sauces used were pretty standard also. Nothing blared out at me as being a \"must try\". I would recommend the Meat and More Meat pizza over the Bacon BBQ Chicken however because I felt that the BBQ sauce did not pair well with the traditional tomato sauce.<br><br>As expected, the service was prompt and the water was always refilled. I liked that our waitress drew some designs on our checks and thanked us for coming. It was almost as she knew we were tourists. Overall, it is a place that is most likely very consistent and a place if you don't want to gamble on getting some decent deep dish!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3Z6r_OaPPRwiLn7SMSTisw/348s.jpg", "caption": "Chicago Deep Dish!"}]}}, {"review": {"des": "This pizza is soooooooooo good. Try and have more than 2 slices of this stuffed pizza! I wish I could eat more. Thank you Chicago!", "pics": null}}, {"review": {"des": "The pizza was good. The ingredients tasted fresh (individual pizza with artichoke, onion and spinach) but the service was so ssssssssssssssssssssssssssssssssssssssssssssssssss­sssssssssssssssssssssssssssssssssssssssssssssssslo­w. And we went in to eat at 4p but it took an hour to get hour food. So I think the pizza was good but at that point I was so hungry it could have tasted like chain delivery pizza! See pic. I was so hungry I ate a slice before I remembered to take a pic!", "pics": null}}, {"review": {"des": "There's simply no comparison - this is the BEST Chicago deep dish pizza on planet earth! No comparison. The taste, the crust, the \"stuffed\" filling...it deserves 11-stars. <br><br>Of all Giordano's locations, this is my favorite. Great waiters, great service and the wait wasn't bad.", "pics": null}}, {"review": {"des": "1 hr wait and pizza was ice cold<br>Service very bad only refilled drinks once with a 2 hr stay <br>Only a couple pics of sausage in a large deep pizza", "pics": null}}, {"review": {"des": "Very classy pizza. A lot of people tell me I'm too classy for pizza but I disagree when it come to Giordanos. I like how it tastes big time. I can't get a pie like this when I'm in my very expensive penthouse on Laguna Beach even though I'm very wealthy and successful from a classy family. -Leandre Latroit", "pics": null}}, {"review": {"des": "The service was not very good. The salad was alright and the spaghetti was pretty below average. The pizza was fun and it tasted alright if you're a fan of mozzarella... a LOT of mozzarella. If I could give them a 3.5/5 I would but our server was a little forward and rude.<br><br>Really it's just a fun novelty place with a cool deep pizza, definitely somewhere to hit in Chicago at least once, just to say you've done it :)", "pics": null}}, {"review": {"des": "Well considering I was visiting Chicago for the weekend I knew I couldn't leave without trying their famous \"deep dish\" pizza.  I chose Giordano's based off the reviews and I was definitely not disappointed. The service was very attentive, the restaurant was huge with plenty of seating. We ordered the sampler appetizer which was about 14 bucks and that was delicious. We also ordered the medium deep dish pizza with pepperoni and it was incredible! Super cheesy and  super filling! They told us the wait will be 45 min and it came out by 30 min.", "pics": null}}, {"review": {"des": "We had the Chicago Style Deep Dish. Talk about stuffed!! Great flavor and even better music! If there is a wait, you can still place your order and your food will arrive quickly once seated. Glad I got to have some great deep dish before I left!", "pics": null}}, {"review": {"des": "The pizza here is just okay, in my opinion. I have tried all the deep dish places in the city and I can't say they are the best on the block. The ambiance however is cool. Very open feeling but I do prefer the interior before the remodel. They do offer individual deep-dish pies and it's roughly 45 minutes from order to table and you can get anything under the sun as a topping. There is a takeout store right next to the restaurant which I thought was cool. If you are on the north side of the city it's a good place to stop in from the cold or humidity and relax with some friends.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/D-JuNxgzsj95MuhwtJA20A/348s.jpg", "caption": "Personal deep dish."}]}}, {"review": {"des": "This place is obviously known for its pizza!! They do offer other things like wings and sandwiches. We all ordered off of the lunch menu. My sister got the chicken parmigiana sandwich and she loves it! Everyone else got the 6\" deep dish pizzas. Everyone is happy with their meals and they came out quickly due to it being on the lunch menu. <br><br>The only reason I didn't give a 5 star review was that you can't choose a \"supreme\" option for lunch.", "pics": null}}, {"review": {"des": "Chicago deep dish pizza!! I finally ate it!! My husband and I were visiting Chicago for one day.  And we had to have Chicago pizza! We were so excited! Pizza in Texas isn't as exciting as Chicago pizza! We went for Wednesday dinner and the place was packed. Even on a Wednesday! Wow! <br><br>Our waitress was so nice and friendly. She knew we weren't from Chicago and helped us order. We ordered calamari & more as an appetizer and ordered a 6\"size pizza. I was not as hungry since I ate all day long. So we opt for the smallest pizza. The wait time on pizza was 45 minutes to an hour! It's worth the wait! The calamari is the best I have ever taste. Perfectly cooked! The marinara sauce was soo good. They also had fried green beans and even fried lemon slices! How different! My husband absolutely loved it. <br><br>Here comes the deep dish pizza! It was small and so cute! It was a perfect size for us. We had pepperoni and black olives. The pizza crust was so flaky like a flaky biscuit! The first bite oh my its soo HOT!! Be careful!! It was soo cheesy! There was pepperoni inside the pizza! I'm drooling as I write this review.  Pizza is amazing!! I would love to come back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/m-pW0BLgR_ILm5mlp-6m6A/348s.jpg", "caption": "Sign"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6TGDphFn3XJ5OGlWGEGksg/168s.jpg", "caption": "The front"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nf6jNl8YBlG3BOgh3I2TXA/168s.jpg", "caption": "6\" Pepperoni & Black Olives deep dish pizza"}]}}, {"review": {"des": "My family took the Giordano's vs Lou Malnati's Chicago Pizza challenge and Giordano's won for the whole family.<br><br>We ordered delivery of a small pepperoni deep dish Chicago pizza from both places. <br><br>Cheese: Both places have the same crust. Giordano's has way more cheese, we love cheese. <br><br>Sauce: Lou had chunks of tomatoes in the sauce. Lou's sauce has more depth and spice. Giordano's sauce was sweeter. I liked Lou's sauce, but my hubby and daughter liked Giordano's sauce better.<br><br>Pepperoni was the same for both places.<br><br>Big PLUS for Giordano's was the cheese curds. So yummy! If in Chicago try the challenge for yourself.", "pics": null}}, {"review": {"des": "This pizza place was recommended by a hotel concierge. Included via photo are the fried cheese curds, which were awesome. This seems to be a large deep dish chain in the area. I was really surprised by how often I saw \"Giordano's\" around the city. The pizza is pretty good, but in essence, I ate my way through the city and found many places with better crust. I ordered the \"super veggie deep dish\", wish was defiantly \"stuffed\".", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wzExbmsRF1uB5YCot2RcCQ/348s.jpg", "caption": "Supper veggie deep dish"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/yme2x55fGkGzWm9jZKGh7w/168s.jpg", "caption": "Bloody Mary"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bmmp-3xqLvhG0Hu1mFldVA/168s.jpg", "caption": "Fried cheese curds"}]}}, {"review": {"des": "A friend and I had pizza here the other night. When we arrived, we were told there'd be a 45 minute wait, but given menus and told we were welcome to order ahead if we wanted. We did, and were probably seated after only about 20 minutes of waiting. The server took our drink orders and our ticket, and the food came out quickly. <br><br>The pizza itself was delicious. Everything you'd want from Chicago deep dish pizza. I've been craving it since, and will definitely return.", "pics": null}}, {"review": {"des": "Great pizza, but their thin crust is still kind of thick for me. I'm told that's the Chicago way! We always share the sausage and pepperoni thin crust pizza. The pizza is cut into easy-to-eat pieces and it's covered with a delicious layer of cheese and toppings. I like to add mushrooms to my side of the pizza. ;-) You should definitely try Giordano's when you're in Chicago.", "pics": null}}, {"review": {"des": "This is \"THE\" Deep dish pizza place that has been talked about either online or by locals. We came here on the weekday and glad to find out there was no line to wait. So the tip is if your schedule is flexible, come here between lunch and dinner rush and you can avoid the line big time. Here I have to be honest, even with half empty seats in the restaurant, it took our waiter over 15 minutes just to get to us to get the drink order. I'm gonna assume that is just one waiter and not the entire staff. But truth to be told, there was some lack of attention through several of their staffs. <br><br>Ok, service aside, the food is on point. Everything is fresh and well seasoned. The deep dish pizza is cheesy, delicious and filling! The appetizer sampler was adequate as well. <br><br>Will I come back for more? Not necessarily. But if you never tired it? It is worth the try at least.", "pics": null}}, {"review": {"des": "First place I went to after landing in Chicago and it was a start to mixed reviews for deep dish pizza. <br><br>If you love the seeing the iconic cheese pull, this is the place to go. I will say, the Chicago Classic was delicious, but it was way too cheesy for me and I love cheese. The cheese got overwhelming after a while and I couldn't eat more than a slice and a half. Our server did suggest that we order a salad as well and we did. We ordered the House Salad; it was light and citrusy. It really helped help balance out the heaviness of the pizza.<br><br>Also, the pizza takes about 45 mins to come out, so I do suggest starting with a salad or appetizer", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NO7GPC21B5qJBJ7b2BcuJA/168s.jpg", "caption": "House Salad Entree"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HH87cjwCqKtkrfYim-ExXg/168s.jpg", "caption": "Chicago Class Deep Dish Pizza"}]}}, {"review": {"des": "Good food, OK service - nothing special here but not bad, either. <br><br>Giordano's  definitely has more of a touristy vibe than other deep dish pizza places in town. It feels very shiny and new compared to the others nearby. There was a 30 min. wait on a week night around 8:30 for a party of two, so we opted to sit at the bar. We ordered bruschetta and a deep dish pizza. Both were good but nothing to write home about. The sauce and cheese on the pizza were a little on the bland side.<br><br>Overall, a fine enough deep dish pizza place which less of a wait than nearby places. Even better if you don't mind eating at the bar!", "pics": null}}, {"review": {"des": "Food C+ <br>Service C- <br>Ambiance C <br>Everything about this place is just mediocre. I was expecting the best pizza because of how often people say they love it. I asked for a knife to cut a wedge salad and I get a butter knife. Lmao!!! On top of that it was placed on a tiny plate where my food was falling off.", "pics": null}}, {"review": {"des": "My all time favorite restaurant since childhood. You can never go wrong with deep dish Chicago style & tradition. I always get my spinach or just cheese. If you visit you most definitely gotta try or come here, great customer service & clean. I always recommend and will always continue to come here.", "pics": null}}, {"review": {"des": "So we ate here our first<br>Night in Chicago. Our nephew loves this deep dish pizza over any pIzza<br>Place<br>In Chicago. We ordered a small meat eater deep dish. It was huge for two people. There were 6 slices. So I only ate a little crust but polished off<br>All<br>3<br>Slices. Also had the ceasar salad<br>And we were<br>Good to go. The piZza was<br>Delicious!!  The cheese was ooZing out of it!  Love the tomato sauce too!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-H7rHb1I9MTocKs9O-QwEg/168s.jpg", "caption": "See the cheese?  Delicious!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JAcJHenr7tfZ6KYqTX46Dg/168s.jpg", "caption": "Ceasar salad."}]}}, {"review": {"des": "If I could give this location 0/5 stars based on my family's experience here, I would. A few friends highly recommended that I try Giordano's deep dish pizza while visiting Chicago, so my mom, sister, and I decided to go to the one closest to our hotel in Magnificent Mile. <br><br>Despite the first floor of the restaurant having some diners but not being even close to full, the hostess took us up to the second floor where we were literally the only people on the floor. As the only black family at the restaurant, we immediately knew what was going on and asked the hostess why we had to sit upstairs when there are tables available on the main floor? She claimed the restaurant was only seating for the second floor at the time we walked in (which was only 19 minutes after it opened), but when we asked another waitress, she said that wasn't true and we could sit anywhere we liked. When we went back downstairs and told the hostess she could not have been more obvious with her discrimination, the hostess laughed at us. So, we took our money and went to Labriola Chicago instead, where we had a wonderful experience. <br><br>Needless to say, I would never recommend Giordano's to anyone looking for a place to eat deep dish pizza in Chicago, and I would 100% recommend Labriola instead.", "pics": null}}, {"review": {"des": "The wait is over.  Lunch special in and out. 9.99 deep dish and a side. Way to go. Very filling not like NY pizza.  The famous Giordano's cheese pull.. <br>first time in Chicago so it came down to Giordano's or Big Lou's.  Game time decision, time running out, went with \"G\" money.  Giordano's!   No regrets. No regrets", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TJfS3M92rlMLSxv13RckEg/348s.jpg", "caption": "The famous cheese pull"}]}}, {"review": {"des": "First stop in Chicago! We had the $9.95 lunch special with the deep dish pizza and it did not disappoint! It is much better than we expected. We will be sampling more deep dish as we mozy through Chi-town, but for being the touristy chain, the food was quality. The flavors were rich, especially the cheese and the side minestrone soup hit the spot for a cold day.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uxXn6O1idXfLHpnuRc--8w/348s.jpg", "caption": "Sausage cheese pizza"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dmTKgj-KDlTRoRWbvnocVw/168s.jpg", "caption": "Pepperoni cheese pizza"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/M-bD8p8A-w5XwtIbezFWIQ/168s.jpg", "caption": "$9.95 lunch combo"}]}}, {"review": {"des": "Great deep dish spot. The location is huge, no seating problems. They had a ton of beer selection and the pizza was delicious!<br><br>We sat upstairs and had prompt service almost the whole time. They have a ton of locations too.", "pics": null}}, {"review": {"des": "Not a fan of franchises but Giordano's wasn't bad, it just wasn't memorable. <br><br>I had the sampler and a Cheese Deep Dish Pizza. It wasn't bad but you can tell the cheese was one of those bulk order commercial cheese's. <br><br>We heard about this place from our Uber driver and while it's low budget I would have rather ate at a mom and pop place instead. <br><br>I'd say it's worth a try, definitely if you're in a budget.", "pics": null}}, {"review": {"des": "Came here at 5pm on a Saturday, was told it would be a 20 min wait, but we got seated in 10 min! However, expect a 45 min- 1hr wait from the time you put in your order for a deep dish.<br><br>Definitely not an expert on deep dish, but I thought The Special (Sausage, peppers, onions) was really tasty. The only thing that made it less great than Lou Malnatti's was that it didn't taste as freshly made; it was less hot and had a less flaky crust. <br><br>We also got the Bruschetta, which was just okay; I thought the balsamic glaze was too sweet and the fresh mozzarella was rubbery.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zlc0OZZLozUaF8eRAdgMew/168s.jpg", "caption": "The special small deep dish"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oXM-90WOajPyTlZ2Cdf7vQ/168s.jpg", "caption": "Bruschetta and house salad starter"}]}}, {"review": {"des": "We were a party of two, we got seated very quickly for how busy the place was! Maybe about 10 minutes after arrival. Our appetizer came out less than 10 minutes after being seated.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ALsFQwy7EuxKuWFJrJmXGw/348s.jpg", "caption": "Small deep dish"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8BYCFNtCz0CtfG318bfHjw/168s.jpg", "caption": "Small deep dish"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9T1zwcc9Xkz_pg-znVqQew/168s.jpg", "caption": "Margarita"}]}}]}