{"name": "glenns-diner-chicago", "reviews": [{"review": {"des": "Had brunch here with some friends last Sunday.  Don't let the word diner fool you, the food is more fine cuisine than diner delights.   <br><br>I had the steak and eggs and I have to say, it was perhaps the best steak and eggs I've ever had.  Usually, you get a cut of steak that is of questionable quality.  Not here.  They gave me a nice 6 oz piece of New York Strip steak and it was cooked exactly the way I like it Medium-rare (I know that it is uncouth and steak technically only comes in rare, medium and well done but medium-rare is mainstream enough to use).<br><br>They also have a signature potato pancake.  This is not the greasy version Babcia made, my Slavic cousins.  This is zesty tasting delight, though it still has enough grease to help with any hangovers. <br><br>I will note that although the price point would put Glenns at $$$, you do get a decent amount of food for the cost.  I just wish this place existed when I lived in that neighborhood back in the day.", "pics": null}}, {"review": {"des": "Came here finally after hearing all the rave reviews; staff is very accommodating and polite, spot is very casual. <br><br>Clam chowder- delicious; incredibly rich, stuffed with clams, and a great start to or addition to the meal.<br><br>Crab cake sandwich- The crab cake was flavorful despite being slightly burnt. <br><br>Seafood salad- I was SO excited to try this as pictures have looked amazing. Unfortunately it is served with a negligible amount of cleverly crumbled lobster as opposed to actual pieces, along with a handful of shrimp and a few pieces of smoked trout at the bottom of the salad. I wonder if ordered unmixed with dressing on the side if you'd get a healthier amount of seafood for the $20 price tag? Tasty vinaigrette and lots of greenery to fill you up for sure.", "pics": null}}, {"review": {"des": "all I can say is yum yum yum and yum! <br><br>Joshua was our server,  he gave us great service and explained the weekend menu plus offered suggestions. I was delighted with all of the menu items. I sat outside, I was able to enjoy the sounds of the Air Show. The food was Excellent as well as very very fresh..  <br><br>See photos. I will come again. YUM!", "pics": null}}, {"review": {"des": "I love this place so much I came back again for my favorite lunch portion of cioppino for $15.95. I love their spice of the cioppino's fish broth. This was the first time we enjoyed lunch outside on the sidewalk. My only complaint is in the summer when a vehicle parks their car on the adjacent curb with the engine running you can feel the heat from the vehicle's engine. <br><br>The two swordfish sandwiches were $41.90 for my two family members. They were all great as usual. My party of three also enjoyed one round of Champagne, Blood Orange, Mimosa's for $35.97 followed by two of us including myself enjoying one more round for $23.98. My total bill less gratuities for my party of three was $136.<br><br>I will continue to return here for lunch. I love my cioppino..", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/c9_hXQjpbISRki_17heHPA/348s.jpg", "caption": "My lunch cioppino"}]}}, {"review": {"des": "My family and I had dinner at Glenns Diner tonight and all I can say is this is the first time in a long time that I finished everything on my plate. We had the sea scallops and the yellow fin tuna and my son had an omelet. The food was fantastic and the service even better. We will definitely be back. Thanks for a great night out. If you have a chance order the shrimp kargot, it will melt in your mouth and make you smile.", "pics": null}}, {"review": {"des": "Came here for Valentine's Day dinner. It was spur of the moment. We don't celebrate. Anyway, the place was pretty empty the whole time we were there... maybe only 5 tables were occupied.... and they almost turned us away because we didn't have reservations. Interesting right? Either they don't have the right process down, or they thought maybe we would be a waste of a table. <br><br>Anyway, they have a large extensive menu. I thought the food I ordered last time was just ok, but this time... we only ordered pasta dishes and they were delicious! Omg the spaghetti and meatballs were actually impressive. It tasted like meat, not just a bunch of flour. I will most definitely come back, but probably only with reservations, haha. <br><br>I also noticed their cleanliness, attention to detail, and timely manner of services between the water, meal, and small requests. It was seamless.", "pics": null}}, {"review": {"des": "Glenn's Diner is the Chicago seafood lover's best kept secret on the Northside. Fresh fish, and quality ingredients play a supporting role to the stellar preparation techniques of the chefs in the kitchen. I didn't put much thought into why this spot would proclaim itself to be a diner. Maybe just a preference or a way to stand out. The answer dawned on me during my most recent birthday dinner, held at this cozy spot under the el tracks along Montrose. I'm not suggesting I wouldn't order a split tailed lobster or oysters on the half shell as I have at so many other seafood restaurants. Glenn's, however, seems to have mastery over the preparation of top notch cuisine.<br><br>My lobster linguini was perfection. Creamy, succulent and al dente... all in the right places. What I tasted of other dishes was on point as well. The prices are reasonable for quality seafood, and are superior to neighborhood competitors such as Fahlstrom (where simply served crustaceans seem to be a more popular menu item). <br><br>Come to Glenn's for a glass (or bottle) of wine, and settle in for a cozy night of delicious  seafood.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/W80ax8yLFvQb1qXiPBiULg/348s.jpg", "caption": "Delectable Lobster Linguini"}]}}, {"review": {"des": "Went here for the first time for dinner with a friend and I loved it. They have quite a selection of seafood entrees. I ordered the brazini and my friend had the mai mai. Both were great, very fresh. The gorgonzola appetizer was good as well.  We had a few glasses of wine with dinner and it was all good. Definitely want to come back and try some other dishes.", "pics": null}}, {"review": {"des": "Glenn's Diner was my selection after a detailed Yelp search. I wanted a place where we could all get something we were excited to eat. This is not a small feat with varying appetites​. The menu was varied with breakfast served all day. You cannot go wrong with that! Upon arrival, I noticed the blackboard with umpteen selections. I was happy. I quickly settled on the Ruby Red Trout served with rice and asparagus. The fish was pure delight! The asparagus was pretty good while the plain rice was dry. After adding fresh lemon juice to my fish, I added it to the rice and that helped. Overall, my dish was enjoyable.  The best part was that Mom wanted to visit a place that Guy Fieri visited on Diners, Dives, and Drive-Ins and this was one of those places! The television periodically showed us the episode of Guy's visit. Mom was happy, I was happy, and our tummies were pleased, all for a great price!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iHLAFX-xCV6WA98FklsqBg/348s.jpg", "caption": "Ruby Red Trout"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6oXzvMLJGcruVUylWCzblA/168s.jpg", "caption": "Cereals available"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZxH9tpKrtweHMP9gqSJuBA/168s.jpg", "caption": "Part of menu"}]}}, {"review": {"des": "Picked a place close to the CTA that was easy to drive in to and easy for our daughter to meet us coming up the CTA Brown Line.<br><br>Known for their fresh fish and also the breakfasts, it was a no-brainer to splurge and order the \"Jumbo Lump Blue Crab Eggs Benedict\" today.  The crab cakes were incredible, at least 2\" thick.  The eggs were done perfectly for me, poached on the medium well side.  The hollandaise was outstanding, it had a heat to it, definitely some nice cayenne pepper in it.  Served with a delicious potato pancake that would make my Grandma envious (she was a pro at them).<br><br>The service was perfect, friendly and quick.  We got there right when they opened and snagged one of the tables outside overlooking the street.  The weather was outstanding, it was so nice to be outside.<br><br>The place is super cool. The back wall is adorned with 30+ boxes of various cereals to choose from, many I haven't thought about since I was a kid.  The walls have chalkboards listing the specials and the highlights of the menu.<br><br>I love this place, will definitely get back here when we are in town again.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HiNbYCMOmbaV8I6CIyeORg/348s.jpg", "caption": "Jumbo Lump Blue Crab Eggs Benedict"}]}}, {"review": {"des": "Great neighborhood place to grab fast service and awesome tasting food!<br>Service friendly and knowledgeable of the big menu!", "pics": null}}, {"review": {"des": "Glenn's dinner came highly recommended during my short stay in Chicago. I was told it was one of the best seafood restaurants in the city. However I was only able to make it for breakfast/brunch time. It is a casual environment that is pretty busy on the weekend. I ordered French toast with fruit and my friend ordered corned beef and hash. The portion sizes were generous so be prepared to share. The French toast was great and the fruit was fresh. Overall I enjoyed my experience there and if I ever find myself back in the city I hope to try some of there seafood dishes.", "pics": null}}, {"review": {"des": "This place has ruined many a Funday Sunday for me by knocking me on my ass after eating there.  There are so many great options on the brunch menu so it is difficult for me to just get one entree and I blame Glenn's.  I am hooked on their Brown Sugar Maple Pecan pancakes, which I need if I am going to order breakfast/brunch.  But I don't consider pancakes as an entree...it is a side.  And therein lies the problem, I always get those damn pancakes and something else AND I eat it all, washing it down with champagne.  Then I need to get in bed and rub my belly until I fall asleep...buh bye Funday Sunday.<br><br>The food is amazing and the portions are a little on the large size.  I have not ever had a bad meal here.  Preparation has been consistent all the time.  Not much on the menu I wouldn't eat except the cereal.  No idea why anyone would go to a restaurant to eat cereal, but they must do so.  I personally can't see paying almost $7 for cereal, but to each his own.  I know some folks freak out about paying for the cereal and the milk separate, but no one is forcing you to buy it.  <br><br>Most of my orders from here are take out because I prefer to eat on my balcony and have my own drinks as the dining space is small and somewhat tight, which would knock this review down to 4 stars.  But because they take reservations, that moves them back up to 5 stars.<br><br>My recommendations for breakfast/brunch would be:  Brown Sugar Maple Pecan/Fresh Blueberry pancakes, Rushing Waters Smoked Trout Hash and Eggs, Corned Beef Yukon Gold Potato Hash and Eggs, Grilled Salmon Salmon and the Steak/Eggs.<br><br>For dinner: Spaghetti & Meatballs, Lobster Fettuccine Alfredo, the Three Napkin Meatloaf sandwich, Catfish Po'Boy, the Salmon spread appetizer and the grilled calamari.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7nnrbXPx6-75Q2rDheKqeA/348s.jpg", "caption": "Sirloin steak and eggs with raisin toast"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cP211AEbxkTI6MmeYbe0bw/168s.jpg", "caption": "Corn beef hash.  Beef is sliced rather than diced"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/R_rPw0CAYPiY2o9FhbXJAA/168s.jpg", "caption": "The Brown Sugar Maple Pecan pancakes that have won me over"}]}}, {"review": {"des": "First time here and the food was ok. I came in for breakfast and wasn't what I expected. I would probably come back to try some of the other items on their menu.", "pics": null}}, {"review": {"des": "Just had a GREAT lunch here. Everyones food looked amazing and the place wasn't packed like it sounds like it can be during breakfast/brunch. Right next to Montrose brown line it looks like a little casual spot, but inside it's really nice and the food is high quality.<br><br>The seafood and breakfast food seems to be where it's at and we all thoroughly enjoyed our meals. I had the lunch portion of the cioppino which was a perfect portion and chocked full with a variety of fish, shrimp and mussels, with a yummy side of garlic Texas toast. <br><br>The lunch portion is the way to eat here I think as it was $15.95 versus for dinner it's $25.95 and I was told a huge portion (no way I could eat any more!).... all the seafood is mainly for dinner (available after 3pm) and is more on the pricey side, so if you're on a budget stick to lunch and you can still get delicious seafood at more affordable prices.<br><br>I'm always impressed by places in Chicago that have great fresh seafood, it's hard to do in the Mid West!", "pics": null}}, {"review": {"des": "Long overdue review.... love , love , love Glenn's. One word to describe this restaurant, \" FRESH \" Glenn's offers and unbelievable selection of fresh fish , truly it's amazing.  The sandwiches are killer , and let's not forget the sides. Clam chowder soup , some of the best around ! Solid beer selection , and service is great.  Glenn's is filled with neighborhood charm. Breakfast , lunch and dinner , head on out to Glenn's for a great meal !", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VVvxYKZjqpeHuv_ZnXmgRA/168s.jpg", "caption": "The holy grail of seafood pot pie !"}]}}, {"review": {"des": "The $65 all you can eat crab legs were too rich for my blood, but my cousin enjoyed them! They didn't have the tools that crack open the shells so she struggled with them. They need to consider investing in those.<br><br>I got the shrimp cargo, seafood pie and cereal for dessert. It was SO good, kind of more tomatoes and mushrooms than shrimp/scallops but still very good. I hope the invest in non-dairy milk for cereal, and expand the BYOB to include Tuesdays.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CITSUlZTbemCQXBZH03QJw/168s.jpg", "caption": "Wall of cereal!!"}]}}, {"review": {"des": "Just OK. Pricey. Cutsie ambiance. Attentive waitstaff. Close parking available. Good portion sizes. But food just OK.", "pics": null}}, {"review": {"des": "Selection of seafood : 5 stars<br>Service : 4 stars<br>Food : 4 stars. Some dishes are executed better than others. <br><br>Overall, it is low key, good for meeting friends, and close to Margie's candies ice cream shop for dessert.<br><br>We came here with reservation of 12 people with high chairs, but then we dropped to a party of 10. They accommodated us well. Service was knowledgeable. We ordered some calamari and garlic bread with parm. The best app was their mussels appetizer with the garlic bread which was rather abundant in portion and flavor. We asked for more garlic bread to soak up the yummy broth. The app order of bread with parmesan cheese was not great and not enough in portion. <br><br>I tried the sturgeon with the mushroom sauce. It was slightly burnt in some parts. The waiter never asked what what sides I wanted. Had I known I would have opted for the potato pancake or the garlic spinach vs the bland fingerling potatoes. I gladly got to try my husband's grouper which was more flavorful with the better sides.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WZi72KxyDCwoiSjZyT_nMA/348s.jpg", "caption": "Sturgeon"}]}}, {"review": {"des": "This place is so good!! I have had breakfast/lunch here but never dinner. All the dinner items are on the blackboard. Everyone loved their food. I had the whitefish with dill sauce and I asked for the bacon mushroom cream sherry sauce on the side. So good!  My friend , Kris, had the swordfish- she said it was amazing!!!  Another friend,Rick, had the soft shell crab special. He said it was the best he ever had and he gets them everywhere. My husband got the scallops and loved them. He said he would get the rice instead of the potatoes next time. Each entree came with asparagus and potatoes/rice. We brought our own wine. Corkage fee was 8 dollars but now they actually have a drink menu.  We had to sit at the bar to get the byob thing. We shared the bananas foster which was also so good. Not low calorie.  Love this place. Come here you will not be disappointed!!!!!", "pics": null}}, {"review": {"des": "I never would have expected to find fresh seafood in the midwest but Glenns Diner has proved me wrong. This place is AWESOME when it comes to seafood. They have so much seafood here they have 5-6 blackboards full of seafood dishes IN ADDITION to their regular diner menu. Impressive!!<br><br>We ordered the mussel dish as an appetizer to share. So many mussels at a great price! The flavors were also so delicious. Garlicky goodness with garlic bread. My mouth is watering just thinking about it again.<br><br>I ordered the sturgeon fish. I've never had it before but it was perfectly seared on the outside and nice and flaky on the inside. The sauce was also very good.<br><br>Service here is top notch. They were very quick and attentive. The place is small so seating is snug but it adds to the dining experience in a positive way. I can't wait to come back here again!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-NzQH6Z8jw4QqdZksQVpVQ/168s.jpg", "caption": "mussels"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1zmp-iy16ukrTqZh0K7ulw/168s.jpg", "caption": "sturgeon with mushroom sauce"}]}}, {"review": {"des": "Had a wonderful brunch here. The patio is a nice space and we enjoyed it with nice fall weather. The staff was prompt and friendly with myself and my dining partner.  The food was delicious!  I got a FANTASTIC Bloody Mary and the lump crab Benedict with the potato pancake as a side.  The food was wonderful and I will definitely make a return trip.", "pics": null}}, {"review": {"des": "Stopped in for dinner during the week.  Not crowded or empty.  Was politely seated right away.  Food was as advertised!  Excellent Arctic char dish!  Can't wait to go back.", "pics": null}}, {"review": {"des": "Way overpriced and quality lacking, paid so much for that lobster roll all you can taste is red onion<br>Also no raw sear food", "pics": null}}, {"review": {"des": "I decided to give this place one more try, because I live in the neighborhood. Haven't been there for 2 years. We ordered the mussels as our appetizer. One third of them were unopen, which means they were dead when steamed. Danger! The server told us that his manager said it was because they were undercooked. Uh, nope. We left, and had dinner elsewhere. Never again!", "pics": null}}, {"review": {"des": "If you're craving seafood, check out Glenns Diner. Located in Ravenswood, a stone throw's away from the Montrose Brown Line stop, Glenns Diner has a decent little sidewalk outdoor patio consisting of several tables. Inside, the dining area is rather spacious and open.<br><br>I got the Seafood Cioppino, which had a delicious broth, and consisted of sturgeon, walleye, strip Bass, and shrimp. Served with several pieces of delicious texas toast-style garlic bread, the lunch portion of this bad boy filled me out quite well. <br><br>The service was great, the waiter was very attentive and informative. Overall, a great experience and meal. I feel, anecdotally, its hard to find good decent seafood regularly in Chicago, especially in local neighborhoods like Ravenswood. Definitely check out Glenns Diner if you're craving some good, fresh seafood, at a decent price.", "pics": null}}, {"review": {"des": "I had a great time with a friend of mine here and the service was amazing Jason our server was very attentive and even have a great drink recommendation with your lemonade. I would come back any night of the week even if it wasn't Tuesday.", "pics": null}}, {"review": {"des": "A little pricey but worth every penny in my opinion. Get the mussels, they are amazing. I've tried at least four different entrees here and every single seafood options is fresh, seasoned to perfect and generously plated. There is sometimes a wait on weekends but you can always just go over to Margie's across the street and eat dessert while you wait on your dinner!", "pics": null}}, {"review": {"des": "I have only ever been here for brunch and enjoyed it both times. It is BYOB which is AMAZING. It was nearing the end of brunch so we were able to get seated immediately which was great. I had the softshell crab breakfast sandwich. It was good, but kinda pricey. The hashbrown patty on the side was great though! My friend got chicken and waffles and raved about them. The server was so friendly and attentive which made the experience that much better. This is definitely a place I suggest to friends looking for a brunch spot. Cant wait to go back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BBj7pOcSKFGn6-U4CQh9nA/348s.jpg", "caption": "Softshell crab breakfast sandwich"}]}}, {"review": {"des": "This is a cute and unique restaurant with excellent food and service. Don't let the \"diner\" part of the name fool you. It's a small place. There are specials and things on a giant chalkboard. There's tons of options on the menu. And there's a daily special each day of the week, including all-you-can-eat Alaskan king crab on Tuesdays. They have many wonderful seafood dishes. They're also a great place for brunch. The service is absolutely wonderful. Attentive, knowledgeable, and friendly. And the seafood is legit fresh!", "pics": null}}, {"review": {"des": "Great seafood in a casual atmosphere. I've only had good meals at Glenn's. My daughter had the calamari and it was delicious. A good fry to quality squid cut in thick pieces. I had the New England Clam Chowder and it was thick and loaded with clams. I probably could have ordered the bowl instead of the cup as it was so tasty. We had delicious entrees too. Lobster Linguini Carbonara was creamy with lots of lobster and enough for 2 meals. The rainbow trout in brown sugar and candied pecans was also very good. The beer offering is loaded with excellent options too. Service was solid and I'd go back tomorrow for dinner again.", "pics": null}}, {"review": {"des": "Don't even get me started on this place...the atmosphere, the small neighborhood feel, the killer fish, and excellent service - I would eat here daily if I could afford to. Jambalaya is off the chain!", "pics": null}}, {"review": {"des": "Cereal or seafood?  Cereal or seafood?  Seafood it is...now what type of seafood does my little heart desire?  Surely, I could eat anything on the menu, but narrowing down the options was truly the difficult task.  I'm indecisive - that's no doubt - but this was probably one of the worst cases of indecision I've faced.  Of course, there were front-runners such as the shrimp and grits or the lobster fettuccine, but all entrees sounded delicious!  <br><br>Having gone to Glenn's Diner at 11:30 am on a Saturday I wasn't able to indulge in the lobster fettuccine which would have been my choice; it turns out that many of the fish dinners and specialty entrees are not served until after 3 pm.  Some of the dishes such as the shrimp and grits were served before 3 pm, but only in lunch portions...I did indeed get the shrimp and grits but this \"lunch\" portion was so goddamn big that I can't imagine what a dinner portion looks like.  I do believe that the cost was a tad bit cheaper for the lunch portion, but it was no significant difference - beware of that and the pure fact that you may not be able to order what you want when going earlier in the day.<br><br>Despite this slight upset, I was perfectly satisfied with my shrimp and grits which were phenomenal.  I have nothing to compare them to since this was my first experience with shrimp and grits of any kind, but I can just guess that these are up there with some of the best.  There's a decent amount of shrimp along with plenty of ham and bacon scattered throughout the grits.  Boy was this dish good, but so incredibly filling - I couldn't even force myself to finish it.  It didn't help that the dish came with a side of eggs and Texas French Toast (my favorite!) and I'd already loaded up on the clam chowder soup beforehand...another menu item that's delicious beyond words.  My partner ordered the crabby burger and she absolutely loved it.  Soooo...everything is delicious, basically.<br><br>And drum roll please: they have Three Floyds beer!<br><br>Glenn's Diner has more than just amazing food and good taste in beer - they also have an eclectic taste in atmosphere as evidenced by their all-day cereal offerings.  I'm not sure how this idea to combine cereal and fish came to be, but how glad am I to see that it did. It makes for a unique experience, but what makes for a good experience is the service here at Glenn's Diner.  Our waiter was super attentive and suggestive which again helped with my indecision.<br><br>Other things to address real quickly: the space inside of Glenn's Diner is not real big and therefore it would be best to go during the day (unless you want something not offered before 3) and going with a group is not advisable.  There was a group of about 10 people when I went and legitimately half the restaurant was filled up.  Also, there's some seating outside which makes obtaining a seat a little easier.  Speaking of outside space (parking spots to be exact) there's only paid parking right in front, but if you go to Ravenswood avenue you'll find PLENTY of free parking!  <br><br>I plan on coming back to Glenn's Diner after work someday so that I can get my hands on this infamous lobster fettuccine!  Working so close to this restaurant I know I will be back, but it can't be too often otherwise I might be a little broke. Yes, it's not cheap here but the food is fresh and preared like no other seafood I've had.  Glenn and I are going to become real good friends, I already know.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VODB5pXY5lJDo3miwWHdBA/348s.jpg", "caption": "Side of eggs, Texas French Toast and potato pancake as sided to the shrimp and grits"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SoOKS82vGFTReOdv16q2Ow/168s.jpg", "caption": "Shrimp and grits!  Wowza"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YSDT6f7xcDkw7nuHO54pkA/168s.jpg", "caption": "Gumballbead!!!!"}]}}, {"review": {"des": "I love this little place on Montrose near the Brown Line. It's quaint, all of the staff seems quite friendly and the food is great. I've only been here for dinner on a couple of occasions. The menu has a good selection to choose from, especially the seafood choices. The only thing that strikes me is that it seems slightly pricey for what it is. While I think the food is very good and I do like all aspects of the place, the bill always seems a little high. Maybe I just have expensive tastes. Recommended, go check it out!", "pics": null}}, {"review": {"des": "I've heard about the all you can eat shrimp on Thursday's and all you can eat Crab on Tuesdays from a friend.  The shrimp was very tasty! We sat outside and dined.  The staff was very attentive and friendly.  I'll definitely be going back! It was a great dinner!!", "pics": null}}, {"review": {"des": "Revisited this diner last week.  It was hard to choose among the selections of fish.  The fried catfish with Hollandaise Sauce and shrimp stuffing was a safe choice.<br><br>The fish was flaky and fried just right.  An unexpected combo, but the sauce was just right with a slight spiciness.<br><br>While the shrimp was meaty and not over cooked, the stuffing was too simple and needed some more flavor.  I'd order it again.  <br><br>The coconut shrimp was the appetizer of choice.  These were definitely fresh ingredients, right down to the sauce.  The shrimp, however, lacked depth to the flavor.  I'm just not gonna salt the dish.  I'd pass on this.  <br><br>I always like this spot!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/02iT0nzme1hVQfb7oXNXQg/168s.jpg", "caption": "Coconut shrimp."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cj91swtOb9p_bVxbmys7iA/168s.jpg", "caption": "Fried catfish with Hollandaise Sauce and shrimp stuffing."}]}}, {"review": {"des": "It's been a grip since I've been to Glenn's, but we stopped in the other day and it was just as good as I remembered! If you've never been, Glenn's is a very eclectic (one might say disjointed) casual joint that does seafood as well as any white table cloth place around (note: their prices reflect that as well, which is a good thing for seafood; take my word on it;) <br><br>We stopped in right around lunch time, got rockstar parking *and* practically got to sit wherever we wanted. Unheard of! Our server was great. But let's get back to what we reeeally care about. The FOOD! We ordered: a cup o' chowdah, the seafood salad, and the pan seared rainbow trout with pecans & garlic butter on the side. <br><br>Their chowder is fan-friggin-tastic. Perfectly seasoned, not skimpy on clams, and not too inundated with veggies. Just perfect. I want some now just typing about it. Both entrees were *huge* (totally sufficient for splitsies if you're dining on the cheap or not a fan of leftover fish). All of the seafood was excellent and the produce was fresh. <br><br>My only complaints would be 1.) their bathroom could use some serious upgrades re: a toilet that flushes properly and 2.) their potato pancake (a signature side they serve in lieu of french fries) is not very tasty. And man, I LOVE a potato pancake in all varieties. But this one, despite the great texture, was overwhelmed by onion *and* scallion and made me sad:'( <br><br>All in all though, there are many more positives than negatives here and I give them two thumbs way up. Cheers!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UVxFGUDzjSR2yOuVr1_IaQ/348s.jpg", "caption": "Pan-seared rainbow trout (8oz.) w/ pecans & garlic butter on side. Hiding: sautéed asparagus & bummer potato pancake."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Hj-NG2TUhPh3UNPfjBcNxA/168s.jpg", "caption": "Seafood Salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/F4aEaxG8BmpFwuHWoWYm3w/168s.jpg", "caption": "Kitchy decor"}]}}, {"review": {"des": "I stopped here for the first time, after the Nutcracker afternoon showing, returning home on the Brown Line.<br><br>I had the Glenn's Cheeseburger, very good.  Come with a potato pancake, which was delicious - best I ever had.<br><br>A convenience hint: Right across the street from the Brown Line Montrose stop.  Get off the train, have dinner, get back on the train for only the cost of a transfer!", "pics": null}}, {"review": {"des": "Great place in Lincoln Square. I first love that they have so many seafood options. I had their catfish with cornbread stuffing. They are generous with their portions. My husband had their all you can eat perch special. It was kind of sad that they do not offer any fries at the restaurant, but hey whatever floats their boat. Our waiter was attentive to us as well. They have a nice patio area where you can eat there during the summer. I definitely want to go there again. A true gem in Lincoln Square.", "pics": null}}, {"review": {"des": "Glenn's is a solid choice for any meal of the day. Be sure to get a cool waiter or they'll charge you a corkage for each bottle of champagne you open during brunch... stupid. Really really good food though, so I keep coming back for more.", "pics": null}}, {"review": {"des": "I hate even giving them 1 star but there is no option for zero stars.  Went in today around 4  after picking up my son from school.   I tried to order the corned beef potato hash and eggs was told they didn't have it.  Becuz it was only part of the weekend menu.   The server then recommended me to get the choizo and eggs so taking his advice i agreed.  After he put the order in he then came back to tell me they were out of it.   Really you recommend something and then tell me that your out of it?  So then I  ordered three eggs with ham amd when my order came  the server substituted a potato pancake for my ham without asking me and no ham was ever brought out until I asked for it.  <br><br>My son ordered a 5 dollar. Bowl of cereal that didnt have enough milk. When I asked for more milk for my son it came in a little dixie cup less than 12 oz and i was charged an additional 2.95 for the milk<br>So the bowl of cereal essentially cost me  7.95.<br><br>Their prices are  ridiculous!!!<br><br>The server then told me he was leaving that a new guy would be taking over insinuating he wanted his tip then and there!!   But the original server never left he was hanging out by the counter and the new guy was lost bringing us the another tables order  ( hot tea )even tho we never ordered a tea.  <br><br>At the end of my meal i ordered a cup of coffee that came with no cream amd no sugar!!! <br><br>I was thinking should i just use my sons milk lol<br><br>Either way stay clear of glenns diner unless you want overpriced bad service food!! <br><br>Never again!! As you can see from photo doesnt even look appetizing", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vwsSlODZJ6lqKNCLX8CJIg/348s.jpg", "caption": "Egg with potato pancake. That i never ordered"}]}}, {"review": {"des": "I finally made it here! I first heard about Glenn's Diner from triple D and what got my attention was the variety of fresh seafood they have in a small space that is independently owned (not an LEYE or other large restaurant group).<br><br>I sat at the bar and the bartender was super-cool, friendly and knowledgeable. I don't remember his name but he had a big salt 'n' pepper beard. They have two large black boards with all of their fresh seafood from local to international. It was very hard to decide but I used to live in Australia so I got the barramundi.<br><br>The fish was very fresh but really lacked  seasoning as did the side of steamed broccoli and potatoes. <br><br>I would go back and request that the chef let the seasoning flow!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RSfYssxGb9lAHOZhpkyocA/348s.jpg", "caption": "Finally made it here!"}]}}, {"review": {"des": "Came here on a double date for Sunday brunch and glad we did!<br><br>We were seated relatively quickly considering how packed it was in the restaurant. Yeah, we were seated in the corner right next to the front entrance, but at least we didn't have to wait too long to eat unlike other popular brunch spots. Whoever designed the layout of the restaurant's interior was probably thinking, \"Okay. How can I cram as many tables and chairs in this restaurant without violating the safety code? Hmm.....\" As I got stuck with the cramped corner seat and took off my coat, I managed to knock the silverware off the table with my coat from the lack of space. Yikes.<br><br>The decor is pretty random and interesting. I mean, you have a rotating headless, half mannequin sporting a T-Shirt up high on the wall for goodness' sake. There are different wall art paintings, a long chalkboard surrounding the restaurant with menu items written, a giant wall display of cereal boxes, and other miscellaneous items that don't necessarily follow a theme. It does feel like a hole-in-the-wall restaurant except on a bigger scale.<br><br>We ordered the Jumbo Lump Blue Crab (x2), Corned Beef Yukon Gold Potato Hash and Eggs with a side of Blueberry Pancakes, and Ham, Shrimp, Bacon and Grits. Everyone thoroughly enjoyed their dish! I had the Jumbo Lump Blue Crab, which is essentially a crab cake eggs Benedict. The crab cake actually had chunks of crab meat and was scrumptious! I do wish they added some sort of green vegetable to the dish, like spinach or something. One of us ordered the Bloody Mary, which looked incredible and like a meal in itself. It came with three big shrimp on a skewer on top of the drink, a celery stick, a carrot stick, and a slice of honey dew melon a.k.a breakfast in a cup! The blueberry pancake that I sampled was good but a little too sweet.<br><br>I would definitely come back to try the other menu items!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pl6Mcs4R6a1DH5J6ojEeMw/348s.jpg", "caption": "Side of blueberry pancakes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UiDNRzeDfatV9Rs_IUJvtw/168s.jpg", "caption": "Corned beef Yukon gold potato hash and eggs"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/objs87wQ3lGCjDlIEQL6PA/168s.jpg", "caption": "Bloody Mary"}]}}, {"review": {"des": "Such a quality diner and unique dining experience in Ravenswood, Chicago. Been here for breakfast, lunch and dinner. They have a traditional diner menu that has the quality of a top restaurant and a seafood menu that you wouldn't expect if you looked at this place from the outside. Seating is a tad tight so expect a small wait.<br><br>Had John as a server both times we've been (my wife and I) the last couple months and his attention to detail is fantastic. Great service and great food!", "pics": null}}, {"review": {"des": "I wondered why the hash was $16 - until it came out. It was ENORMOUS. And delicious! White fish with potatoes, scrambled eggs, red and green peppers. Tasteful seasoning and Texas toast. BAM. Down the hatch.<br><br>The mimosas are fun; triple sec and a pour-your-own ratio with a tiny bottle of Korbel. The bloody came with four shrimp, but I'm not sure it was worth its buck.<br><br>Service was pretty attentive, the coffee was delicious, I really wanted cereal, and, yeah. Check it out.", "pics": null}}, {"review": {"des": "Good food! But as a black woman making my second visit, I am still experiencing shitty service. I don't know if the feel as thought I'm another black person who won't tip, but this is just horrible. Service was trash... but the seafood pasta I good so.... yup", "pics": null}}, {"review": {"des": "Celebrating my daughter bday<br>We had <br>Crabcake apetizer<br>Gonzo blody mary<br>Lobster fetching<br>And cream bule<br>Great atmosphere", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Lhw8lMt6O2oo2H4y1sDmvQ/348s.jpg", "caption": "Crabcake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zndQmNYEWcrkkXAe2DEjUw/168s.jpg", "caption": "Cereal ?"}]}}, {"review": {"des": "Have always sat outside, which is just off a busy stretch of Montrose. Also, have only exclusively ordered seafood: apps/entrees. Appetizers lately have lacked in portions (mussels, crab cakes, tuna tartar) unsure if this is new or par for the course. The tuna tartar can be a bit \"oniony\". If you bring a friend and are planning on sharing, be mindful. For entrees, the lobster alfredo is tasty, worth a try, as well as the red snapper. Nothing extraordinary, but good. Nice summer spot", "pics": null}}, {"review": {"des": "Great wide assortment of fresh fish in funky setting. Can have breakfast all day too. Outside seating too.  Very popular. Make a reservation.", "pics": null}}, {"review": {"des": "I went on a Tuesday for the all you can eat crab. I know sharing the all you can eat special is not allowed but you can feel them staring at you. It made me uncomfortable. My husband does not eat crab so there was no reason to stare us down the way they did. They did it to all tables that ordered all you can eat crab. My husband ordered the burger and a shrimp salad. He said it was the best burger he's ever eaten. I on the other hand got sick from the crab and was unable to go to work the next morning. I am no allergic nor did I over indulged. I had 2 rounds and the second round was only one leg.", "pics": null}}, {"review": {"des": "Great food, awesome service.  Went in for lunch and was blown away by the quality of the food.  Crab cake and catfish Po'boy are delicious.  Our waiter was helpful and friendly.", "pics": null}}, {"review": {"des": "We made a reservation for eleven people for Sunday brunch. We arrived a few minutes early, happy to discover that our table was ready. With that many people there's usually someone who is unhappy for some reason. That was not our experience. We all ordered different entrees and everybody was happy. Service, including coffee and water, was great. The price was reasonable. We all agreed that we would be happy to return, especially because the location was convenient for people coming from different parts of the city. We drove from Buffalo Grove but were happy to find free street parking!", "pics": null}}, {"review": {"des": "Despite good flavor, the Jambalaya I ordered is one of the oddest I have tried. The menu did say shrimp & crawfish served over corn bread, but I somehow still assumed it would come as a rice oriented item served with cornbread. There is no rice, it is a soupy mix over 2 large portions of sweet cake-like cornbread. The shrimps are tender, crawfish is tiny, sausage and mixed with green peppers, all you can eat celery, and about 3 strip of onions. Not what I expected; not bad, but didn't quite meet my Jambalaya cravings. Also somewhat pricy at $25 for the dish. My eyes did wander to a few other dishes of nearby guests of giant crab legs, so I may be back.", "pics": null}}, {"review": {"des": "Have always been a fan but dinner last night was a big, expensive disappointment. Crab cake appy was $10 for only one small, mushy crab cake. Really? Halibut special sounded great but was bland. Fish wasn't spiced at all, almost tasteless, asparagus was cold as were the fingerling potatoes. Another member of our party had a soup that was so over-spiced it made her eyes water. I could go on and on but won't spend anymore time on this. After many visits since they opened years ago, sad to say I won't go back. Spent $$$$ on lousy food.", "pics": null}}, {"review": {"des": "Well overdue update. Ever since they changed management the place is as it always should have been. Hospitable, professional staff with a nice neighborhood vibe.", "pics": null}}, {"review": {"des": "My husband and I shared the crab cake appetizer, which was pretty good. Then I had the Lake Superior Whitefish with cucumber dill sauce, served with broccoli and some potatoes. It was fine, but lacked seasoning and the sides were average. My husband had the pretzel encrusted walleye pike, served with the same sides. He was of the same opinion...average, lacked seasoning. My husband cooks fish all the time at home, and his is just as good as the fish served at the restaurant. I think I would try the place for brunch, as that menu looked good, but I would not return for dinner.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GacswDqe2VRso1IZdHk7sQ/168s.jpg", "caption": "Whitefish"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Rx0x8GxEoaG9RRUvMuDR2w/168s.jpg", "caption": "Walleye Pike"}]}}, {"review": {"des": "Came here for brunch. May need to check out their Tuesday AYCE King crab legs' night in the future.<br><br>Omelette w/cheddar, sausage, ham ($9.99, comes with potato pancake, upgraded from toast to short stack pancakes for $1.50) - 4 stars omelette & short stack, pass on potato pancake.<br><br>Biscuits & gravy w/eggs ($8.99) - bf disappointed by this<br><br>Side of fruit - bf v disappointed by the tiny serving", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/c55U0jxtFDvUgVZxAUejag/348s.jpg", "caption": "Stack of pancakes ($1.50 upgrade substituting from toast). Delish"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/h0S2i2Nzg4o3m_fT7HdbzQ/168s.jpg", "caption": "Omelette w/cheddar, sausage, ham ($9.99, comes with potato pancake, upgraded from toast to short stack pancakes for $1.50)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zu_B49e73_5fnFrrJF4HXw/168s.jpg", "caption": "Biscuits & gravy"}]}}, {"review": {"des": "This is an amazing restaurant. There are so many fine choices. And they are all great. I got the clam chowder and grilled salmon. I could eat here often and never get bored.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pUfuz97sS6RFRGk6rVEAAg/168s.jpg", "caption": "The specials."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3BYVq-wgR03DHJ1jMH0g6w/168s.jpg", "caption": "Grilled Scottish Salmon"}]}}, {"review": {"des": "I'm still thinking about the jambalaya I got last night at Glenn's. It may be the best jambalaya I've had, and I've had a lot of jambalaya. My wife got a crab cake burger which was also excellent! The selections are pretty good. We may come back for brunch even though we live in the burbs now.", "pics": null}}, {"review": {"des": "I've eaten at Glenn's several times. I went for the fresh seafood, though I'm sure it's nice for breakfast / brunch too.<br><br>I thought the seafood was very good. Nothing exotic, but honestly prepared, quality seafood with savory flavors. The portions are good sized, and the seafood came with some nice fingerling potatoes and some tender asparagus the night I went recently. The presentation was attractive but not pretentious.  I suggest a reservation, but often you can get a table without one. A selection of beer and wine that should suit most, as well as some good soft drinks. I went with friends and we lingered, talking and having coffee after the meal. It was very comfortable.<br><br>The key is:  GOOD SEAFOOD AT MODEST PRICES.  You don't find many good seafood places on the north side here, and this could well become your go-to place for fish.<br><br>They also have some tasty looking meat dishes, but the standout is the FISH.  MMMMM  FISH.", "pics": null}}, {"review": {"des": "Glenn's is a nice,  cozy diner that also doubles as a great seafood option in the evening.  I tend to go here for brunch on the weekends. They have a wall full of cereal you can try, and vey fluffy eggs. Their jambalaya is phenomenal and they make a mean burger as well. I wanted to emphasize in my review that they have a little something for everybody. They are right off the Montrose brown line and have a nice patio in the summer.", "pics": null}}, {"review": {"des": "Crazy good fish  I also saw breakfast the Sear on the fish was wonderful . chargrilled & super fresh", "pics": null}}, {"review": {"des": "When I think of diners, what comes to mind are burgers, fries, and milk shakes. And then you go to a neighbourhood like Ravenswood and find that the local diner is a seafood restaurant. You smile. Well, I smiled.<br><br>Let me start by saying that I had an aggressive appetite. CrossFit and kickboxing early in the morning had already worn me out, but in a good way. However, such intense workouts crank my appetite and I obey.<br><br>Love the waffles. Loved the scramble eggs with cheddar cheese. Waited about 20 minutes, got my second wind, and then had the halibut with potatoes and asparagus. Talk about flaky fish and everything being seasoned without being overdone. The jambalaya with cornbread was out of this world, although it didn't come with rice. It was closer to the jambalaya that I've had in New Orleans than the attempts I've had at other New Orleans style restaurants in Chicago.<br><br>There is a constant flow of patrons coming and going. During midday the crowd was light. Given the breakfast was good, I imagine the morning crowd fills the restaurant. The food is certain worthy, so I can understand if the restaurant stays crowded. I'll be a part of the constant crowd from now on.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7QtVBTPgl2q8Qww6m5rgKg/348s.jpg", "caption": "Chocolate Chip Waffle"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/68kVgnRv86EnG2yLHUh10w/168s.jpg", "caption": "Jambalaya"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aewZ-4w0zHW8709xJkxi8Q/168s.jpg", "caption": "Hard Cider"}]}}, {"review": {"des": "Glenn's food is to die for, but service could be better. I think they know you'll keep coming back 'cause it's so delish, so the servers are a little haughty and have no problem being sassy. Whatev! <br><br>Brunch at Glenn's is amazing (their Bloody Mary comes with shrimp--need I say more?) and if you feel like splurging, dinner is even better. I highly recommend their seafood alfredo or cioppino. Also, be sure to come by on a Thursday night for the $19.99 all-you-can-eat shrimp deal. They also have a cereal wall if you're into that, though I don't know why you would be once you've tried anything else they have to offer!", "pics": null}}, {"review": {"des": "Choose this place because we heard that they have good seafood, which is true. Clam chowder was delicious. Got a platter of king crab, also yummy. It was a little expensive. The staff is friendly. The place is small with a chalkboard board menu on the wall.", "pics": null}}, {"review": {"des": "My sister and I went there on a Pride parade Sunday around 3ish. The restaurant was pretty quiet. The atmosphere was good. Our server was okay. The food came out relatively on a slower side considering it wasn't a busy hour. We only ordered 2 dishes, calamari and mussels. My sister loves the calamari. The cut it differently than the other places. Big juicy piece. Yumm. I love the mussels dish. The smell of garlic & cheese were hard to resist. It's absolutely one of the best mussels I ever had. Very fresh mussels & load of garlic. The dishes were large enough to filled the two of us. Strongly recommend mussels. I'll definitely go back when I'm in town.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/m0-6QDWtYcyWhcJZnot8ZA/168s.jpg", "caption": "Drakes Calamari"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2rwixzyyoWb1Uol_GWgWeA/168s.jpg", "caption": "Glenn's Dinner Mussels"}]}}, {"review": {"des": "We had takeout here and it was really good.  This is a review for the last time we sat down and ate at the restaurant.  <br><br>My husband and I were out and about walking with our son and walked by Glenns and were able to get a table outside for a couple apps, a glass of wine, a beer and dinner for our son.  We were seated promptly and then the waiting game began.  First we waited for our server to come and see us.  When he finally did, we put in our son's order and our drink order.  He came back about 20 minutes later and brought out our son's meal and took our food order.  We asked about our drinks he said, what drinks?  I explained what drinks we ordered from him and that we did this at the beginning of the meal and had actually reminded him about them 10 minutes before.  He acted like he doubted us... (we just came from a festival that for some reason closed down at 5 pm, so believe me, after my son's food order was placed, the next line of business was getting that drink order placed).  So he said he would put the order in right away.  Our food came out and then finally our drinks.  The Mussels were great.  My glass of wine was good and my husband enjoyed his beer.  And to be honest, we were outside, so if the above was all that happened, I would have left it at that... But then the busser came to clear off our plates.  He picked up the bowl of mussels and dumped the liquid that was left in the bowl on my brand new jeans and shoes.  I was so bummed!!! I loved both so much!!  My husband explained what happened to the server and after 20 more minutes he sent over his manager.  I was really digging in my brain trying to think if she ever said sorry and I am 100% confident she didn't.  She said, ya these things happen with patio tables....  I would have been completely satisfied to just hear, I am so sorry.  And actually feel that she was apologetic... but nothing.  And she said, well I can comp you another drink if you have one.  I said no we're good.  And she walked away.  We did get our mussels taken off of our bill, but that doesn't get me a new pair of shoes or pants.  And let's be honest, it's not like I thought I was going to get my clothing replaced, I just thought maybe a dry cleaning bill would have been covered.  OR, maybe, just maybe, someone at the restaurant would have apologized and actually felt bad.  There are enough seafood spots in the city and because of service at Glenn's we'll be heading to a new spot next time.", "pics": null}}, {"review": {"des": "I have wanted to really like this place, but always seem to struggle getting good consistent food and service.  I just recently visited again for brunch, which was a first, but came out with mixed feelings.  <br><br>My girl ordered the soft shell crab and egg sandwich, which was excellent.  The waiter confirmed the crabs were flown in fresh (live).  The crab was lightly dusted with flour and pan fried, so good.  <br><br>I ordered the lobster roll, on the waiters suggestion.  Wow, big disappointment!   I even asked him a second time if he really liked the lobster roll, he insisted it was great.  Sorry dude, but this probably the worst lobster roll I have ever had.  Btw, the first hint should be that I only ate a couple bits of a $20 sandwich.  Oh yah, next time you might ask what I thought, since you suggested it strongly.  It was served on a very basis French roll that looked like it got in a fight with a panini press.  Yes, that bad!  No butter on the bread, just dry.  The lobster filling was a joke, all celery with some cucumbers (I think), and lots of mayo.  It was so bland and very little lobster, just a little claw meat and knuckle meat; don't hold your breathe for tail meat, it isn't happening.  <br><br>I had a nice Bloody Mary with some good quality shrimp.  The Bloody Mary was so-so, the shrimp made the drink.  <br><br>Probably won't rush back, as we are still only liking about half of our experiences with Glen's.  Sorry guys...", "pics": null}}, {"review": {"des": "As a resident of Lakeview, I was looking for a seafood restaurant in the northern neighborhoods and came across Glenns Diner on Yelp. What a great surprise! It's small yet intimate, but not trendy or pretentious.<br><br>My wife and I started out with the \"Coconut Me Shrimpeez\" which was lightly fried with a sweet marmalade dipping sauce. I actually preferred skipping the dipping sauce (bc it was too sweet) and instead shower the coconut shrimp in Louisiana hot sauce - but that's just me. Next I ordered the Blackened Barramundi which came with sauteed potatoes and steamed broccoli. It was my first experience eating Barramundi fish and I wasn't disappointed, it was light and flaky. I highly recommend this Australian fish. My wife had the Cioppino, a light soupy and spicy broth with a nice assortment of fish. It was a very large dish, which we took home - Lunch! <br><br>Overall the service was good, mostly knowledgeable with the chalkboard menu and not too pushy if you wish to hangout and socialize well past your meal. If you are in the area and desire seafood, Glenns Diner is a must.  <br><br>They are also BYOB. There is a liquor store next door that sells wine, liquor, and beer. They do charge a $4 corking fee per bottle.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eQxC2PMk2lMbSVy7E5CRUQ/348s.jpg", "caption": "The \"coconut me shrimpeez\" appetizer."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-U6ltC8rxMwCbtGaWlptFg/168s.jpg", "caption": "The famous menu. Changes based on availability."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hr4TVOIPvZzWkwLmOImojQ/168s.jpg", "caption": "Actual cereal if you are not in the mood for seafood."}]}}, {"review": {"des": "Delicious and great customer service! I got the Jambalaya and it was spicy just the way I like it. We got there about 2pm on a Sunday and I was looking for more seafood dishes but they were pushing brunch per their menu leaving me a little disappointed. Next time I'll definitely go for dinner hours. The mac and cheese was a little disappointing but their use of Cavatappi pasta rounded out the texture of the side. In addition the Mac and cheese counter balanced the spicy level of the Jambalaya. The cornbread in the center was sublime!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NUnKegKjlJ9bvHG9e-mIsg/348s.jpg", "caption": "Amazingly decadent! It was like closing my eyes and being in the French Quarter of New Orleans but in Chicago instead!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/skjENI6ql7ZWBvk9luG-Sg/168s.jpg", "caption": "So So"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JZxIur4OtTSSTT6iUIlkyg/168s.jpg", "caption": "Great spot!"}]}}, {"review": {"des": "Wow. What a disaster. Second time there and last. Service was ok but food was, to put it nicely, mediocre at best. While our friend liked her Jambalaya, and I tasted it, the seasoning was good, my mussels were inedible. Yes, the waiter said there was a lot of garlic on them but what he didn't tell me was that it's raw garlic thrown on top in heaps and tossed. Still tasting it now and its not pretty. That's not cooking. That's assembling.<br>Salad was a clear after thought.<br>We did not order dessert. I wanted to get out of there as fast as I could. <br>The whole place feels rundown and pased its prime. The decade old video looping all night from their stint on \"Diners Drive ins and Dives\" is kind of sad. Makes you remember when it really was a happening place with good food and fun service. <br>Utter waste of money.<br>P.S. I wrote the owner but never got a response. <br>Is what it is I guess.", "pics": null}}, {"review": {"des": "So this happens to be one of the best places to eat in Chicago. I assure you, you can't go wrong no matter what u order. We used to be regulars here, until the service became horrible. <br><br>The last time we were here they spilled cioppino all over me. They of course apologized. However it was bit insulting when all they offered us was to take the appetizer off the bill. For those that have been to Glenn's you know it's an expensive place. We were a party of four that spent over $250 so it wasn't about the money it was the insincere gesture. When this happened we swore off Glenn's. My wife was furious. <br><br>I've been asking to come back, since we really do enjoy their food my wife has been saying no. I managed to convince her to give it another try. Once again the food was great just as remembered the service sucked, again. Our food got to the table before we even got our water. Not happy seeing that it was a warm day out and I certainly didn't think a 25 minute wait for water was acceptable. Not sure if I'll be able to convince her to come back", "pics": null}}, {"review": {"des": "Food is great. Service can be great but if you have an issue good luck. <br><br>I ordered take out and bacon was missing from my grilled cheese. Even though I know he had it down bc he read it back to me. When I called he informed me I was charged for it. Ok? So not only did I not get what I wanted your business forget to even charge for what was forgotten? He offered me to come back in to get a new one. But not before he blamed the kitchen and then blamed the person who rung me up. Haha it's always someone else's problem. <br><br>I'll never understand when businesses mess up and just replace with what was meant to be right in the first place. I'm now still having to go out of my way just to get what I should have received in the first place. I told him I live 30 min away and couldn't come. He just paused. Didn't offer a replacement in the future or anything just silent dumbfounded on the phone. <br><br>Here's an idea...get it right the first time. <br><br>And that's all I have to say about that. <br>Jackée", "pics": null}}, {"review": {"des": "AYCA crab legs Tuesdays- big, hot, tender. <br><br>They have a gynormous selection of fish.<br>You order off of a chalkboard<br>AYCE shrimp on Thursdays.<br><br>Well worth the price.<br>Small venue. They do take reservations so make sure you make some or else you are going to be standing next to someone's table waiting for something to open up. Staff all extremely helpful and aim to please.<br><br>It looks like they will have patio seating for the summer.<br><br>I will definitely be back. YUM.", "pics": null}}, {"review": {"des": "How have I missed out on Glenn's for so long!! First, the menu, how do you decide? <br><br>We started with the Parmesan & chives scrambled eggs. Eggs were cooked perfectly and the chives and Parmesan made them perfect! So perfect, I will never eat plain scrambled eggs again! Not to mention we went to the grocery after our meal and bought eggs, Parmesan and chives to recreate them tomorrow morning! <br><br>I had the BLT with my bacon crispy. Bacon was cooked just right and there was lots of it! Lettuce, tomato and bread were fresh. Overall, the BLT was amazing!! After eating it I wished I could immediately do it all over again. I chose the potato pancake on the side. Super flavorful, don't put ketchup or hot sauce on it, just don't. It is so tasty on its own! <br><br>Phil had the shrimp po'boy, yum yum yum! The roll it was on tasted like it was baked fresh that day, the shrimp were lightly battered and the spices were on point. Lots of shrimp, they do not skimp on the fillings of their sandwiches. The sandwich was all balanced with the tartar sauce, made in house! <br><br>Last but not least, the mimosa... OJ was sweet and fresh tasting. Not like some places when you feel like your drinking orange water. They add orange liquor which is a nice touch and makes a mimosa worth your while. <br><br>We love Glenn's! Already planning our return for dinner!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vuprhREfLKLxciSWSTYMpg/348s.jpg", "caption": "Bloody and blackberry lemonade"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oZFeNc-esXBFrhG9JIjLbQ/168s.jpg", "caption": "Mimosa on the patio"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_jqmm0tPH3Rip1gDXgbeUQ/168s.jpg", "caption": "BLT and potato pancake"}]}}, {"review": {"des": "I decided to give Glen's another try 5 years later.  Under new ownership, this place is great!  Hospitality was fantastic!  Bill was our server and he as very fast and checked up on us several times!  The quality of the food, huge selection and taste of the food was great!  Service was fast and no waiting, even with two kids on a Saturday evening!  We were able to find a spot on the street as there is no valet service here.<br><br>We had calamari for an appetizer, and I had a cup of delicious clam chowder and very tasty Columbian Sturgeon that came with asparagus and small potatoes.  I don't know what sauce was on the Sturgeon but it was incredible!  I only wished that I had some bread to dip it in!  I topped it off with a La Fin Dumonde beer for my pleasure!  My wife had one of the specials that featured salmon and asparagus, which was very good.  I would recommend getting a reservation if planning on coming here on Saturday evening as it gets pretty busy!<br><br>This place does serve beer and wine but for a small corking fee you can BYOB! <br><br>My kids had the typical spaghetti/meatball and grilled cheese sandwich with a pickle.  No fries at this joint though, but no complaints from the kiddies.<br><br>There were so many dishes to pick from, I really had a hard time choosing.  I wanted to try a lobsta roll, lobster with fettucine, scallops, seafood bisque, etc.  There were several desserts to choose from also, but since it was my daughters birthday and we had already planned on heading over to Margie's Candies across the street, we passed.<br><br>I would definitely recommend this place, 5 years later my tune has changed!", "pics": null}}, {"review": {"des": "Fresh, delicious seafood everytime. A quaint, welcoming environment. My friends & family always enjoy all you can eat Alaskan King Crab leg Tuesday's.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CcKf_gK99u_tq0z6HBkXDw/348s.jpg", "caption": "Liv's 10th Alaskan King Crab Leg"}]}}, {"review": {"des": "We came last night on a Tuesday for all you can eat crab legs and I absolutely loved the experience. <br><br>The hostess was so nice, it was packed and if we didn't want to wait we could sit outside. Silly me, I didn't bring a jacket and it was pretty cold outside. The hostess went above and beyond and offered me her jacket. So nice of her!!<br><br>Our server was awesome as well, the food came out quick, and it was delish. Also gotta mention the giant ass Bloody Mary, amazingggg.<br><br>We'll be back", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/de7qOpgc_-mZHp7GSpsfsg/348s.jpg", "caption": "20 oz bloody"}]}}, {"review": {"des": "I took my mother there for Mother's Day after a show. It was obviously busy that sunday. So we were able to get a table. My mom got the Shrimp Po Boy and I got The Lobster Roll That Ate Montrose Ave. The Lobster Roll was good and I tried a little of her Po Boy and it was good. For desert we got the Glen's Key Lime Pie which was a delicious, refreshing ending to the meal.<br><br>The waitstaff was really nice and they give me my a small box of candy from Margies as a mother's day gift. It was also cool seeing the cereal boxes!;-) I overheard a guy behind me ordering just cereal. Sometimes you just have to have some cereal! I'll definitely come back maybe for breakfast.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nNUQAbiFER5cORmpuU48PQ/348s.jpg", "caption": "The Lobster Roll That Ate Montrose Ave.  Well I devoured it and it was good!"}]}}, {"review": {"des": "I forgot how good this place really is. It's been over a year since I have been here and I can't remember why I stopped. The food is amazing and the weekend brunch is even better. The atmosphere has a very neighborhoody... (if that's a word) feel mixed with array of specials on the chalkboards on the walls... mainly seafood. I should also mention that I do don't eat seafood but when I am entertaining guests who do like seafood this is the place I think off.<br><br>And today I am shocked and amazed that I do not frequent this place as often as I should.<br><br>Weather it's a bowl of your favor cereal at the counter or fresh from the sea seafood.<br><br>This is the place for you!!!<br><br>Please consider this place for entertaining friends or family on weekend mornings!", "pics": null}}, {"review": {"des": "I got food poisoning from this restaurant and the way they handled the issue was unsatisfactory which was to do nothing. Just because everything came in fresh doesn't mean there wasn't accidental contamination. Before taking to social media, I call a restaurant to let them know if something was not okay and in the past, it was handled with seriousness. The person I spoke to did not seem to actually care except to say \"Sorry, I don't see anything here that was unfresh.\" This restaurant is so expensive and I vomited up my entire $50 meal and was violently ill for hours after.  Perhaps you won't get sick after eating here, but if you do expect zero accountability.", "pics": null}}, {"review": {"des": "I've lived in the neighborhood for quite some time and admittedly I've never been to Glenn's. I've been to Fahlstrom's though which is basically the same thing, just on a smaller scale. My homie and I decided to take in some lunch. Arctic char with shrimp and a \"spicy\" diablo sauce for her. Cioppino for me with a side of garlic toast. We both enjoyed our meals. But we felt the spice level was not as advertised. My seafood stew was supposed to be swimming in a spicy broth. I found that was not the case though. Glenn's doesn't skimp on the portions. I could barely finish half of my order and it was chock full of shrimp, mussels and attic char. Plenty of seafood options here if thats your thing. If not, there is a wall full of cereal options for the inner child in you.", "pics": null}}, {"review": {"des": "One of the best meals I've had. Sturgeon with bacon and mushrooms. Even the broccoli was outstanding.  I'm from Kansas City and next time I'm in Chicago I will be back. Nice selection of bottled beers although I prefer drafts. Overall big thumbs up here.", "pics": null}}, {"review": {"des": "server was john, best service I had in my . 4day trip to the city.  great service,  food was exceptional as well.  shrimp po boy and wife had pecan salad.  both excellent.  this was in our neighborhood where we were staying and glad we stumbled upon it.  will gladly go back for the service alone.  attentive but not bothersome and immediate refill of water extra napkins etc.  great experience!", "pics": null}}, {"review": {"des": "Great food. Good beer selection. Prices are a little on the high side but you pay for quality fresh fish. Wish they would stay open a little later than 10 p.m.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tQdLlDqElVMawfg4wYvifA/348s.jpg", "caption": "Lobster Fettuccine Alfredo with garlic bread."}]}}, {"review": {"des": "A small neighborhood gem with an extensive sedafood selection.  Well prepared and good service.  What's not to love.", "pics": null}}, {"review": {"des": "Run, don't walk, to this place for breakfast and dinner. Amazing food and fun ambience.", "pics": null}}, {"review": {"des": "Came here with a girl friend on Tuesday night.  Ooops...didn't know it was AYCE Crab legs night.  IT was PACKED!  $59 a person for all you can eat isn't bad, but I didn't feel like I had room to put away $59 worth of crabs.  So we opted for the menu on the wall by way of sharing small plates.  Yes yes, I have a small plate disease when it comes to dining.  I like to try a little of everything!    Needless to say, we ate more than a little bit and I almost had to be rolled out of there. <br><br>We started with some mussels, had the garlic bread with gorgonzola, coconut shrimp, oysters rockefeller and tuna tartare.  <br><br>I'd probably pass next time on the coconut shrimp and tuna tartare.  It was average fare at best and not worth my time.  <br><br>The beers were good and we really enjoyed dessert.  The bartender who was taking care of us was good, but he mixed up our orders twice.  I felt like if you aren't going to write things down, then at least get them correct so that we don't have the wrong orders come out. <br><br>Needless to say, I wanted to try the clam chowder but knew we weren't going to have enough room.  None the less, we enjoyed our meal and will definitely have to try it out again.", "pics": null}}, {"review": {"des": "I was a bit bummed when I went at lunch to discover the chalk board seafood items were only served at dinner... but the lobster roll I got was still fantastic.<br>Definitely go for dinner, because the fish is amazing!", "pics": null}}, {"review": {"des": "Guy Fieri's not wrong about this one. Awesome fish selection prepared by people who are good at what they do. Always fun to try fish you've not had before, and never disappointed. Staff is excellent - lots of fun!", "pics": null}}, {"review": {"des": "This is one of my favorite places in the city. Service is always great, everything I've tried has been wonderful, and I love the sauv blanc on the menu. They've also been really awesome about making gluten free grilled calamari for me instead of the breaded stuff, which a lot of places won't do. so points for that. Super casual, but extra tasty, and I'm a fan of the sidewalk seating when the weather's nice. Love it.", "pics": null}}, {"review": {"des": "A go to for a fresh, delicious, brunch or seafood dinner. I fully recommend the New Orleans scramble for brunch; scrambled eggs, shrimp, sausage, peppers onions, potato pancake, rice and toast. Outstanding. We come here as often as possible and the consistency is unrivaled.", "pics": null}}, {"review": {"des": "Glenn's diner was a great dining experience.  I enjoyed eating in a neighborhood establishment with a flair for gourmet food.  I enjoyed my Scottish salmon and appreciated the Spectre of watching someone enjoy one of the many varieties of breakfast cereals pulled off the larger than life wall display of cereals in the restaurant which add to the unique atmosphere.", "pics": null}}, {"review": {"des": "The experience was soooo good last year I decided to repeat it again this year!  Except this time my waiter (Roy) knew more about the menu, especially the better selection of fish offerings, in this case he (highly) recommended either the sturgeon, halibut or sea bass.  I chose the sturgeon, a meaty moist flavorful piece of fish, accompanied by this humungous and fresh tasting chunk of broccoli along with tiny fingerling potatoes.  Yeah baby!  If you've never had sturgeon before (I don't remember ever seeing it offered anyplace else) order it, you won't be sorry.<br><br>Once again, I ordered their delicious Bloody Mary (w/ plump shrimp/cantaloupe/carrot & celery stalk)... once again too much ice!  You've got to be kidding me! The difference though, was this year I protested.  Let's just say, I eventually got my way.  After that, the entire staff danced (or more like avoided!) around me throughout the entire meal and it made for quite an interesting afternoon!  So what..<br><br>My lunch ended on a high note though with Roy suggesting their delicious key lime pie, which I ordered over the bananas foster ice cream, but when it arrived I was stuffed to the gills already and was unable to finish it... but it was delish.<br><br>TIP:  Leave your TIP in cash, even when using your credit card, I guarantee your waiter will love you for it, plus he'll even forget you made a big f'n deal over all that unnecessary ice in your BM. Haha!", "pics": null}}, {"review": {"des": "Wow. I had no idea what to expect from a pretty non-descript place by the El. But this place blew me away. Swordfish was decadent, sides were great, and staff was so helpful. Only down side is the limited bar (bad vodka choices and no tequila) but not docking the rating because of it. Loved it - we will be back!", "pics": null}}, {"review": {"des": "Yaaaasss Glenn's!<br>I'm in town visiting a friend and she suggests we go to this neighborhood spot for the Thursday night all you can eat shrimp. We get in there and abandon that plan because a million other things are calling our names. We decide to split and order of the crab cake burger and the honey mustard salmon with potatoes and asparagus...we're geniuses! It was all sooo good, large portions and friendly waitstaff, we were stuffed and so happy it hurt. I'll be back before I leave!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gKS-cTOT6dpeI5wwVpXusQ/348s.jpg", "caption": "Honey mustard salmon.. Oh ma gawd!"}]}}, {"review": {"des": "Just a quick update. I've been coming here for the last five years and I think year after year it gets even better.  My most recent visit, I had Artic Char which was pan seared to perfection in a spicy diablo shrimp sauce.  The sauce didn't keep the flavor of the Char from coming through, it was moist and tender.  Unbelievable!<br><br>Every time I come here I try something different on the menu. I have not been disappointed yet. So this year I added a star for total consistency!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4mQCPplxR-vCX_EH0M2rpw/348s.jpg", "caption": "Artic Char!"}]}}, {"review": {"des": "Oh man! My lobster roll was terrible. Soggy bread, minced lobster, celery and carrots. Barely any lobster on there. And I was really wanting a lobster roll.....", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cwRClKGUBEJW7j883mX8LQ/168s.jpg", "caption": "Lobster roll, more like celery soggy roll ! Disappointing"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KUWIiL-H7fiE9md3kZxh1w/168s.jpg", "caption": "Soft shell crab Po Boy"}]}}, {"review": {"des": "This place is a gem. I am a breakfast loving pescatarian, so when I found it I thought it was too good to be true. Honestly, I could live in here.<br>Deciding what to eat was very difficult. I got the crustacean pot pie and it was huge, flaky & seafood-licious. Service was friendly.<br><br>I can't wait to go back and try all of the things!", "pics": null}}, {"review": {"des": "Overrated! Also a major turn off that the staff couldn't even crack a smile when you're trying to talk with them and keep things loose.", "pics": null}}]}