{"name": "goddess-and-the-baker-chicago", "reviews": [{"review": {"des": "There are plenty of lunch options around the loop area and I am on a mission to try each and every one of them. I came across Goddess and The Baker and was delighted by their display of desserts and baked goods. <br><br>The place is fairly small and has limited seating, so I decided to grab an order to go. I was trying to keep it on the healthy side, so I opted for the Grilled Salmon Kale Caesar salad. Lunch hours everywhere are pretty chaotic, but this place can get crowded to a whole new level. When I walked in I wasn't sure where the order line starts and I stood behind someone for about 5 minutes before I realized that they were just waiting on their order and people were going up at random to place their orders. <br><br>Either way, it took about 10 minutes to get my salad and that's understandable. After all the salad does say it comes with a 6 minute egg and it is a lunch rush, so I wasn't that upset about the wait. I took a look around the place while I was waiting, and they have a large variety of baked goods. From muffins to macarons to cookies to brownies, they literally have it all. They also sell alcohol, which I guess can come in handy during one of those work days!<br><br>After getting my salad and heading back to the office, it was finally time to dig in. The presentation for a take out order looked extremely appetizing, however, they overfilled the plate and kale was falling around all over my desk and floor. The salmon was extremely dry and had a terrible aftertaste. I just put that to the side and ate the rest of the salad. I was pretty disappointed because it cost about 15$ for the salmon and I couldn't bare to finish it. Everything else however tasted really good and the salad was extremely filling. <br><br>This place is definitely worth another chance. I'll be sticking to the bakery items though!", "pics": null}}, {"review": {"des": "My friend and I enjoyed the coffees and breakfast items at Goddess And The Baker, but I have to give 4 stars because of the chaotic seating arrangement. <br>It's very disorganized and crowded, at least in the morning. You have to find your own seats and it's basically survival of the fittest to see if you can run to an empty seat before someone else snags it.<br>As for the food and drink - my friend and I shared the Gold Glitter Latte, Mayan Mocha (espresso, dark chocolate, cinnamon, cayenne), acai bowl, and caprese omelette. The Gold Glitter Latte was nothing special - literally edible glitter sprinkled on a latte - but it definitely makes a great photo. The Mayan Mocha was a bit too spicy for me but an interesting experience. However, I really enjoyed the caprese omelette and the refreshing taste of the acai bowl!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lb0TkZgSZa_QxsJ2tI41BA/348s.jpg", "caption": "Acai bowl"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PkKtsutu1yKLaP14QYjQbA/168s.jpg", "caption": "Mayan mocha"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Kr-mxPmN32GaVObx1YN6OQ/168s.jpg", "caption": "Gold glitter latte"}]}}, {"review": {"des": "This place is so cute! I love to stare at the various desserts they have at the window closest to the entrance. They're too pretty to eat. <br>I came here on a not too busy Sunday afternoon and there were plenty of tables and seats available. It was so hard to choose what to order since they have lots of items to choose from. I ended up ordering a chai tea latte, but they forgot to make my drink and it was a long wait. Good thing is, it was worth the wait! So good!<br>I can't wait to come back and try some of their other food items, like sandwiches and salads. It's the perfect place to kill time and prices were reasonable as well.", "pics": null}}, {"review": {"des": "Only giving this 4 instead of 5 because it gets crowded so fast and you can't figure out who is in line and who isn't.<br><br>Love the Eat Now Caffeine signs but because it's small and the seating is in front of it, you can't get a great pic of it because people are in the way. I've tried and it's so busy that I can't.<br><br>I do like all the selection of drinks they have. I haven't seen or tried a few drinks outside of an Asian supermarket or restaurant. For instance, the Japanese Kyoto honey. I've had that sweet stuff since I was a kid so I was pleasantly surprised they added it to honey.<br><br>I wanted to treat myself so I got a glitter gold latte. I've been dying to find places that make it and I'm glad I checked the menu to Goddess because I was satisfied! <br><br>They even have Sugarfina candies and bars - a bunch of Mickeys and a Hello Kitty bar.", "pics": null}}, {"review": {"des": "I been to many cities and visited many cafes and I'm happy to say THIS spot has \"Golden Milk\" which is my favorite tea everrrrrr!<br>I also ordered the breakfast sandwich without the bacon and it was very good. Small spot which can get packed quick so we arrived right at opening (8am).<br>Big plus on having the water machine in the corner dispensing sparkling water, and cold or room temp water. <br>Cool vibe music. <br>Minus one star for that huge palate in the middle of the order line which caused an elderly lady to fall and possibly suffer broken nose or lose a tooth. She'll be back for that check believe that.", "pics": null}}, {"review": {"des": "Glad we found this place, it was right across from our hotel, so we came here every morning for our morning coffee and breakfast sandwich. Well... me the sandwich and him the coffee. <br><br>My BF is very picky with coffee...and he loves this place. He's gotten everything from regular coffee, cold brew, to the double con panna.<br><br>The breakfast sandwich was delicious. Big piece of freshly cooked eggs and another protein (bacon or ham). We got it every day and split it to start our journey through Chicago tourism. It kept us satisfy while allowing us to get deep dish for lunches.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NvBlKRQ70R4Y9t4OY7TTdw/348s.jpg", "caption": "Baked goods"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/E6i3QbwDXXG_Sck3EPxaFw/168s.jpg", "caption": "Counter"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bIJZm7p-Ttc7yfsQ-XpfDg/168s.jpg", "caption": "Inside"}]}}, {"review": {"des": "My favorite go to place in Chicago!!! If you are in town during the fall / winter they have a one of a kind Pumpkin cake with cinnamon dulce frosting !! I love dessert so when I saw the Tiramisu infused cold brew topped with a biscotti I knew I had to try!!!", "pics": null}}, {"review": {"des": "Large variety of drinks, sandwiches, pastries, and some very colorful cookies. Prices are a bit high - this is somewhere I might go for a special treat or to catch up with friends, but definitely not regularly.<br><br>Seating is a rare commodity and people are constantly moving in and out. Deco inside is pretty, but it can be a little messy with so many customers. Since Grant Park is so close by, you can easily bring your food over and eat in the park. <br><br>+ Apple butter oat latte: made with Oatly oat milk; this was a nice hot drink to start off the day with, with the perfect amount of apple-y taste. The oat milk makes it a bit lighter than a latte made with regular milk, so I felt satiated but not overly full<br><br>+ Almond croissant: lovely almond fragrance, crispy exterior and buttery interior, no complaints here. Prices for bakery items are either hard to see or not listed, which is a little annoying. They also seem a little disorganized; they forgot my croissant and I had to go up and ask for it and wait more, but at least I got it in the end!<br><br>Also, I really love their coffee cups! Beautiful shade of blue. I brought one back home for Bonnie S.'s coffee cup collection.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FWkIvMXThh66UDD-ez61hw/348s.jpg", "caption": "Almond croissant"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/55bbwLODHX6jFQFPc9Ry1A/168s.jpg", "caption": "Apple butter oat latte"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jWCvewAiM_KU7epkfTDCsw/168s.jpg", "caption": "Love their coffee cups!"}]}}, {"review": {"des": "I enjoyed my snack/coffee that I had here. <br>Met a friend for afternoon coffee. It was a little small with only a long table that was open for people to sit at.<br>I had the pumpkin maple latte (seasonal) because i'm basic and let me say it was really good! i'm not even a big lover of coffee but this was pretty tasty. Also had some nice heart art in the foam that was insta-worthy. <br>Since it's holiday season, i'm trying to limit my sweet intake so I only opted for the banana bread. It was moist nutty and served with granola and dried coconut flakes which gave it an interesting twist. If i hadn't had wildberry pancakes like 2 hours before I definitely would have gone for one of the layer cakes which looked beautiful (red velvet or carrot). It was a little on the pricey side at about 11$ for these two things. <br>Overall it was a nice place for an afternoon pick me up!", "pics": null}}, {"review": {"des": "They deserve a 10 Star for flavor, amazingness, creativity, and excellent designs. It's been a while since I felt like a kid again and, seeing those dreamy looking cakes, pushed my mouth into a Pavlovian mouth drench. <br><br>Seriously, it felt like it was a dream come true and it become a perfect cheat day to my diet.<br><br>However.... I've got to be honest. It kinda freaked me out that they had loads of fruit gnats all over the food. Those gnats comings and goings seemed oddly sinister.<br><br>I'd beware of places that have gnats, but, in this case, realize that fruits and ingredients sometimes have them as well.", "pics": null}}, {"review": {"des": "Delicious! Had the honey latte and the morning sandwich on sourdough. Not cheap but well worth it. The coffee was phenomenal and the sandwich was fresh, tasty, and filling. Can't wait to stop back before I leave!", "pics": null}}, {"review": {"des": "5 stars for the horchata latte that was amazing but where Goddess And The Baker falls off is the service. The person who rang me up seemed in a bad mood as well as the barista. It doesn't seem that good service or friendly service is part of their plan but at least the drinks tasted good. Came in the afternoon while the cafe was pretty busy so not that many seats and the ones that were available were super filthy. I wiped down my table and the chairs so my party could sit and enjoy our beverages. Will be back to try other drinks.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9LEZWa2EKC9TzczsG6hwgA/348s.jpg", "caption": "Baked goods selection 11/2018"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TC20psb3Kg9vOBOXJmulzg/168s.jpg", "caption": "Goddess Horchata with espresso"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Gy1YCLTwUtV49ARWDONJKg/168s.jpg", "caption": "November 2018 menu"}]}}, {"review": {"des": "While walking around Chicago our first day of visiting, we stoped in here for a quick bite to eat. The atmosphere was fun and inviting and we were served pretty quickly. We ordered our sandwiches and coffee at the counter and then tried to find a place to sit. Sitting was limited so we had to settle on sitting in the corner of the community tables. <br><br>My coffee came out first and once I doctored it up to my liking at the coffee station, it was delicious. I loved the presentation. My wrap was super fresh and the goddess dressing with the hummus tasted amazing. My husband got the Santa Monica turkey sand which and said it was pretty good. Their chips were small kettle cooked and came in 3 varieties, we got bbq and salt and vinegar. When we left we checked out their pasties and wanted to try one so bad but we were too full! Overall this was a great place for a healthy fresh quick lunch. Next time we are in the area we will have to go back to try one of their sweeter options!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/x9ECbn66tRC6T8RVlsCsBw/348s.jpg", "caption": "Sweeter items for sale!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kxNizM3--LcyHG9K_k_QbQ/168s.jpg", "caption": "Large sign on back wall!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dz3GJNLPePeE1gpfu2sRMw/168s.jpg", "caption": "Bulletproof Coffee"}]}}, {"review": {"des": "Very cute atmosphere! It was hard to choose what pastry since they all looked so beautiful! I had a cold brew coffee (very good) with oat milk. They have a great selection of milks to put in your coffee! I had the almond croissant (highly recommend). The almond sauce inside the croissant was so yummy and made me eat every single bite. My friend has the coffee cake muffin, also very yummy and moist, but fell apart. We also had an everything bagel to have more substance, and it was good but nothing special. Solid place to get a coffee and pastry. I would try a sandwich or lunch food next time I go!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fhsi5lb_kAVqeUbMgRfv7A/348s.jpg", "caption": "Coffee cake muffin"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cTzIXO4IJRWZOTQ9-d92fA/168s.jpg", "caption": "Cold brew"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3UTEMlPwHUA1ZxrJGCh4rA/168s.jpg", "caption": "Almond croissant"}]}}, {"review": {"des": "Goddess and the Baker has a lot to offer: food, cafe drinks, alcoholic drinks, and a chill place to hang out (indoors and outdoors). I've only been to this location once and I probably won't return.<br><br>The first thing I noticed is that it's really busy. It has people rushing to work, college students and tourists. The line never seemed to disappear.<br><br>The menu is spread out on the wall behind the counter and the bakery items aren't listed. The register is at the far end and the entire menu (and bakery items) aren't visible while ordering. I ran back and forth along the counter to point to the bakery items I wanted and also to refresh my memory on my drink order. The employee (presumably a manager) was patient but unfriendly.<br><br>The Goddess and the Baker location on LaSalle has the same logistical issues with the menu and baked goods, but it's friendlier and has more seating.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OJR907_SM7SYbaTs1qLXoQ/348s.jpg", "caption": "Black honey almond Matcha latte"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9I4JzdftsWCvCXzEo1UY6w/168s.jpg", "caption": "Almond Croissant"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8tQuqUF-moqnULKn8xjETw/168s.jpg", "caption": "Key Lime truffle"}]}}, {"review": {"des": "Solid stop in the morning for a quick breakfast/snack.<br>Needed something for the hotel room this morning and possibly later on the train... <br>breakfast:  blueberry chia rice pudding, VEGAN!, with coconut and almond milk, chia seeds and basmati rice. (Very filling, split it in half with coffee)<br>Anytime snack:  detox nut/date ball. (They have different names for the different flavors but they're basically peanut butter or date based energy balls in individual cups to go)<br>The two things together = $12.12 with 10% tip. Not cheap but all we needed and high quality/taste.<br><br>Went back an hour later with a family member for sit-down and WOW! Great experience!!!!  <br>Iron man egg white omelette with veg, green salsa and amazing bread! And<br>Goddess Gringo Horchata!!! (Horchata and espresso blended!)<br>Loved that so much, including the glass it came in that we bought a set of four of those glasses on the way out!<br>Service here is very pleasant and efficient as well!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pWBEFHbG5GwKmZGI8NHEFw/168s.jpg", "caption": "Goddess gringo horchata, Iron man egg white/veg omelette and a Caprese sandwich"}]}}, {"review": {"des": "(English)<br>After seeing all the colorful pastries and fun drinks they have on Instagram I was intrigued to try this place. <br>I got the liquid gold glitter latte it was exactly as described in the menu glittery, fancy and tasty. The blueberry muffins were really hard I would not recommend them, but the lemon bars were delicious soft on the inside and crisp on the outside. <br><br>The decor of this place is amazing, probably one of the coolest coffee shops I've ever been, with its big sign \"Eat Now, caffeinate\" on the wall (they have it in every coffee shop) you can take cool photos and feel the vibrant energy that this place offers. The service is really nice and friendly. <br><br> I will recommend this place to come and relax maybe work with tasty coffee and pastries. <br><br>(Español)<br>Después de ver todos los coloridos pasteles y divertidas bebidas que tenían en Instagram, estaba intrigada de probar este lugar.<br><br>Ordene el café con leche dorada líquido (liquid gold glitter latte), estaba exactamente como lo describían en el menu, brillante, sofisticado y sabroso. Los muffins de arándanos estaban realmente duros, no los recomendaría, pero las barras de limón estaban deliciosas, suaves por dentro y crujientes por fuera.<br><br>La decoración de este lugar es increíble, probablemente una de las cafeterías más geniales que he visto, con su gran diseño \"Eat Now, Caffeinate\" en la pared (lo tienen en cada cafetería) puedes tomar fotos y sentir el energía vibrante que tiene este lugar. El servicio es realmente agradable y amigable. Recomendaria este lugar para venir a descansar y tal vez trabajar con deliciosos cafés y pasteles.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eZivCgMGhxx-M3mD6MvBqA/348s.jpg", "caption": "Cool, huge sign on every coffee shop"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2V-_cJ9RD8t5pwyZJYJd0Q/168s.jpg", "caption": "Liquid Gold Glitter Latte"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3Wi4f_lf83aq3n6rpOpoKA/168s.jpg", "caption": "Blueberry muffin even though you can't see it!"}]}}, {"review": {"des": "If you want to work at a coffee shop with great pastries, this is the place to go. I ordered a chocolate tart with a latte and pulled a chair for an hour or two to read an online article I had saved. I walked here so I can't speak for parking or the trains to this location. <br><br>The atmosphere inside is very friendly and true city coffee shop, with lots of seating, music in the background, and a constant buzz of patrons. The restaurants true origin is posted on one of the walls. <br><br>The chocolate tart had flaky crust (probably from all the butter) and rich,  and divine filling. The latte was the perfect pairing with a sweet treat. Service is satisfactory. After ordering, the food/coffee came fast so prompt service on serving.   <br><br>Fun bakery that I'd revisit when I am in Chicago.", "pics": null}}, {"review": {"des": "Wonderful selection of unique coffees and treats! They have everything from a gold glittery drink, gooden coffee, strawberry matcha, and a Mayan Mocha. I tried out the Mayan Mocha which did not dissapoint. It is full of dark chocolate and has a kick of spice! I also tried a red velvet cupcake which was pretty moist but I wish the frosting was a bit thicker. My only disappointment is that its very small and loud making it jot the best place to work. The music is quite loud along with the crowd.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hTiIdHtOa0C_wrhl3vzhUw/168s.jpg", "caption": "Mayan mocha"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YUPtsyR8Pjm-IFz3WZJiYg/168s.jpg", "caption": "Red velvet cupcake"}]}}, {"review": {"des": "You get a free drip coffee when you check in -- and it is good! It comes in a really cool container that keeps your coffee hot before you pour it. I asked the barista whether he recommended the dark or the light drip and he said to go with light... I definitely agree! It was refreshing and aromatic (I had it black), but wasn't overly acidic. Went great with my pepper and egg sandwich.<br><br>For kicks I tried their iced americano and give it two thumbs up! I would seriously come back just for the americano! It was great  <br><br>One note on the Pepper and Egg sandwich -- Grab hot sauce inside first. Be better than I was.<br><br>I will write more whenever I come down from this caffeine high after having so much coffee!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4y3y8GhZ_u2pGH1QMW1gtg/348s.jpg", "caption": "Drip coffee -- pretty fancy schmancy for free check in coffee"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QpgGqxtwGFxb_PVQ7OtlEw/168s.jpg", "caption": "I would seriously come back just for the americano!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aZDypWI607D7VmoEwXl4XA/168s.jpg", "caption": "Pepper and egg sandwich. Grab hot sauce inside first. Be better than I was."}]}}, {"review": {"des": "Pretty decent coffee and lunch place. Been there a few times for their hot chocolate, which is really good. Tried their food for the first time today. The avocado toast was delicious, but the Vietnamese salad was unimpressive - it was mostly a big bowl of cabbage and noodles. <br><br>Want to try more of their stuff.", "pics": null}}, {"review": {"des": "Goddess and the Baker is one of those places that I think of as more than just a coffee shop. You get the typical options of any coffee you want to be made any way you'd like, but you also get the options of drinks (actual alcoholic beverages and regular soft drinks, juices, etc...), sandwiches, pastries, etc... It's pretty much a free for all in terms of options! The place is LITERALLY beautiful, and when I say 'place' I actually mean places because they have many locations all over the city!<br><br>In terms of prices, it is a tad expensive but if it's something you want to experience, the price one time won't break the bank. The coffee I had, a cappuccino, was probably one of the biggest cups of cappuccino I've had aside from being one of the strongest and prettiest ones lol thumbs up for latte art ALWAYS!", "pics": null}}, {"review": {"des": "Super cute bakery. The rainbow cake was tasty, and not dry, and made for fabulous ig picture. It is a tiny bit too sweet, but tastes good washing it down with drip coffee. <br><br>I like that the place is self cleanup, and there is a self serve station for your coffee.", "pics": null}}, {"review": {"des": "I've been wanting to eat here for some time, but for some reason everytime I tried they were close already, very unfortunate.<br><br>Today, I made it there before closing. We had the goddess gringo horchata which is espresso mixed with rice milked topped with cinnamon and the strawberry matcha latte. The drinks were amazing. The matcha latte was made with real matcha, you can actually see the film of matcha in the froth, the strawberry balanced out the bitterness of the matcha without overpowering it. It was a nice mixture.<br><br>We also got the baker's chopped salad and the Vietnamese salad. Each so perfectly seasoned with the right amount of dressing. The ingredients were fresh and well balanced. I recommend both salad.<br><br>We unfortunately didn't get to try the desserts because we were stuffed, but would go back to try their carrot cake.", "pics": null}}, {"review": {"des": "tl;dr - I would classify this as bakery/cafe as \"Every item is a photoshoot. Also, the food is decent\" type of place. Go go go if you want pretty drinks + pastries to take photos of!<br><br>This cafe specializes in more obscure types of drinks - my friends and I enjoyed an apple oat milk latte, a golden glitter latte, and an iced strawberry matcha latte. All were enjoyable, if a tad sweet. <br><br>Plenty of seating as well. A little pricey (a specialty drink will run you about ~$6) but right in line with other hipster type cafes. <br><br>Some standouts:<br>- the golden glitter latte: surprisingly good, and no grittiness or plasticky taste, which is good considering you're basically eating glitter.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VLZH3QdLyDr0s0F1F9FrRQ/348s.jpg", "caption": "Strawberry matcha latte"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9ndBSrqhNyoAP42JlTqQZA/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HXbBkqEnqISz9BTQX0-rZA/168s.jpg", "caption": "Glitter latte 4.5/5"}]}}, {"review": {"des": "Adorable little Coffee Shop/Breakfast spot/ Bakery.  <br>Stopped in on a Sunday morning before we left to catch a flight and it seemed pretty crowded! Seemed to me like locals come mainly for coffee.  We ordered an egg sandwich and the huervos rancheros and both were really good!  I got the nutella pastry which seemed super stale and blah. The coffee and tea that we both ordered were delish!", "pics": null}}, {"review": {"des": "Goddess and the Baker is a unique, health-conscious, artisan bakery, juicery café and coffee shop with gluten-free an vegan pastry options.<br><br>I got a morning glory muffins which tasted good. I'd like to pause from my muffin assessment to point out that there is an entire menu section called \"liquid chocolate\". I don't really have anything else to say about the muffin.<br><br>There were several different coffees on their coffee board including drips, and pour-overs. I had the Jumpstart Chicago Brothers after asking for the boldest tasting thing. It was OK. Definitely a little acidic for my tastes and not as strong as I would've liked.<br><br>My wife had a Ginger Pineapple Tonic from the juice menu which tasted a whole lot of pineapple without having without much of the other juices that were supposed to come with it coming through (including cucumber orange coconut water and ginger.) The juice presentation was really kind of extraordinary with all kinds of leaves, stalks and flowers shooting out of the top. It's almost worth getting a juice, even if it didn't taste great, just to see one.<br><br>They were out of oatmeal (which my wife wanted) so they offered anything else on the menu as a replacement (which was awfully nice). My wife got the granola which she thought was tasty and satisfying.<br><br>She also got green jasmine tea from there somewhat extensive tea menu, which she thought was floral and tasty. There were lots of things on the menu which would have suited our separate vegetarian and gluten free diets, like breakfast sandwiches, toasts salads, other sandwiches, and many other baked goods and types of drinks we didn't get to try. We definitely would come back and try a lot more from this menu with particular attention in the future paid to the liquid chocolate menu.<br><br>I wish our server, or the person who took our order was a little bit more about what was going on, she had trouble making a coffee recommendation...she said she didn't drink coffee and got confused when I asked if I could have my coffee in a mug (as opposed to in a paper cup). She also took the touchpad away before I could select the type of receipt I wanted and she made a selection for me.<br><br>They also serve alcohol, and three different types of water on tap... Room temperature distilled call distilled and bubbly distill. So in the end it wasn't a perfect experience...but it was an intriguing enough place with many many options that would definitely have us give it another shot. (haha, shot...espresso...get it?)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hUuL9pBRCSXi9gbrJhmDOA/348s.jpg", "caption": "Morning Glory Muffin"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/thU9Ygr6NkzF6B_7OgsB5w/168s.jpg", "caption": "Granola"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XLRq1E-G9PNMBC1LtaKiug/168s.jpg", "caption": "Ginger Pineapple Tonic"}]}}, {"review": {"des": "This is a cute place to get coffee and bakery items.<br>Coffee was very good.<br>However it took over 15 minutes to get our order.<br>Plenty of staff but very disorganized.<br>They forgot or lost my order.<br>Had to go ask for it twice before receiving.<br>Will give it another chance.", "pics": null}}, {"review": {"des": "tldr; cute, trendy cafe where you can actually get work done maybe<br><br>I was first drawn to this cafe because I saw an Instagram photo of their rainbow cake. Then I immediately came here so I can also Instagram a picture of their rainbow cake :P<br><br>I expected the cake to simply look good but not taste amazing, but it was surprisingly tasty! The sweet matcha latte was a bit too sweet in my opinion, but still pretty solid.<br><br>I also loved the decor and ambience of the cafe. It's a great place to socialize and catch up with friends, but they also have ample seating inside, so you can also get some work done as well.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zRUnsVvVYBvS0D4tMBblLA/348s.jpg", "caption": "Rainbow cake & sweet matcha latte - $14.21 total"}]}}, {"review": {"des": "More like a 3.5 stars.<br><br>The place is cute, staff is all friendly but one girl who helped me wasn't the most competent or knowledgeable. She couldn't answer what baked goods contains nuts without constantly asking another guy behind the bar. <br><br>The menu didn't seem to reflect everything they had of the day. For example, there was no espresso brownie though it's listed.<br><br>I got the honey latte and rainbow cake. Call me basic but I had been eyeing on the pretty colorful latte art for awhile and which was one of the reasons why I stopped by. I was told that they no longer make it... <br><br>Honey latte was yummy but very sweet (with the whole layer of honey on the bottom) but definitely very honey-y. Rainbow cake was yummy and pretty but also very sweet.<br><br>The rest of the big box of baked goodies I got was good overall, slightly too sweet for my taste or it of my family.", "pics": null}}, {"review": {"des": "I was very disappointed with this store. <br>A pro was that the decor was beautiful. When I arrived there around noon, the pastry and cake choices were minimum . Everything seemed over priced sigh. I ended up only getting the ginger pineapple tonic. It was ok, loaded with tons of ice so very watered down.<br>The service here was also subpar.", "pics": null}}, {"review": {"des": "Foods were fresh and tasty in appearance; services were adequate, efficient, warm, and able to meet customer needs<br>; the facilities and services were pleasant.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5B39qSek2rOZFhgxFTzaWA/348s.jpg", "caption": "smoked salmon plate: cream cheese, fresh dill, capers, cucumber, tomato, and sesame semolina"}]}}, {"review": {"des": "My company's Chicago office is nearby and I came here for breakfast the other day.  The breakfast sandwich was decent.  Very fresh and I liked the bread. Used the yelp check in for a great cup of coffee.   Staff are super friendly.  I'd love to come back sometime to try some of the baked goods.", "pics": null}}, {"review": {"des": "This is a cute little cafe that was on my \"Chicago bucket list.\" I loved their rainbow cake! It was not too overwhelmingly sweet, just enough to satisfy my sweet tooth and give me more energy to walk around the city. I liked the atmosphere of the cafe, very cute and hip, however it was really difficult to find a spot to sit and enjoy my food. All the tables were taken up by people working on their laptops and the communal table in the middle were also pretty full. <br>Overall it's a great cafe to stop by, rest your feet and reenergize, and the location is also great. If I lived here I'd come every week!", "pics": null}}, {"review": {"des": "Awful service for mediocre overpriced food. <br><br>I bought a pop tart for almost $5 at the wabash location, which im willing to do for a good product and experience, on occasion, sat there waiting while the guy behind the counter fussed with signage, moved around boxes, after 5 minutes of him doing this with no interested in my order, i had to pop my head back there and yell \"um hi pop-tart please\" and even then he acted like he was trying to win a ballet award for most slow and fluttery employee. Did not care about me and the other woman waiting, didn't ask if i wanted it warmed (which i did) and I was late for work. For a $5 pop tart...  I tried to message someone about my experience, and TWO WEEKS LATER not a word. Clearly the people who think this place is great don't actually live here in the city and don't know any better which is why Goddess and Baker will continue to be able to get away with their crappy business.", "pics": null}}, {"review": {"des": "Cute coffee shop in the city near Jeweler's row.  Goddess and the Baker offers a mix of coffee, mixed drinks, and a variety of bottled drinks as well as baked goods and lunchtime items like salads and sandwiches.  Upon arrival, we were immediately greeted by the baking staff despite the long cashier line.  The staff was very helpful in making suggestions.  We tried a matcha latte as well as a glitter latte.  Glitter in your latte. How cool is that?  Every girl's dream.  We will be back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/R8oL3hi7LOZU2AD3brFrug/348s.jpg", "caption": "Glitter latte!"}]}}, {"review": {"des": "This little gem in downtown Chicago was worth every minute and penny.<br><br>We stopped in for a late breakfast, and it didn't disappoint. I had one of the breakfast sandwiches, a solid ham, egg, and cheese sandwich on sourdough toast with some delicious aioli. I had a cup of the chili, which was excellent. Unfortunately I finished it before I thought to take a picture of my meal.<br><br>The breakfast was finished off by one of the best cups of hot chocolate I've ever tasted.<br><br>There was a fairly short and quick line to order, and food came out fairly quickly. The communal seating was a bit awkward, but I was at least able to fire up my laptop and get some work done while I waited for my food.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6V6gaG_6_tRirHKt6Jqhrw/348s.jpg", "caption": "Breakfast sandwich with chili and hot chocolate"}]}}, {"review": {"des": "Five stars is not a high enough rating for this awesome little café. It's everything I want in a coffee shop + more; homemade baked goods, large selection of coffee drinks, breakfast sandwiches, relaxing atmosphere, friendly staff. <br><br>I only had the chance to eat here for breakfast (we were only visiting Chicago, I do not live there), but it was the most pleasant morning. I had their Mayan Mocha which is spicy, sweet and rich, accompanied by one of their amazing Sunrise Burrito (anything with avocado; sign me up). The staff was super helpful and nice, considering this was our first time there, and helped recommend some items. By the time we left, we had baggies full of baked goods to snack on later. <br><br>It's a beautiful little shop, very quaint (so not a lot of seating). If I lived near here, I would be at this shop every week. Highly recommend and can't wait to visit again!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1_a__GuIpN3Oq2b4_6eV-w/168s.jpg", "caption": "Mayan Mocha"}]}}, {"review": {"des": "The Apple butter oat milk latte is SO GOOD. <br><br>Good place to go if you are visiting the city as it is a bit expensive, but there are lots of unique desserts and drinks to try. (A couple of gluten free options for dessert)", "pics": null}}, {"review": {"des": "Found a fly cooked with my omelet<br>The thing is the waitress and store manager never apologize but kept denying the fly is from their kitchen while clearly it was cooked into the omelet. After ignoring me for quite a while, they just offered to make me a new omelet, when I already finished eating my omelet but only discovered at last minute there was a fly", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/G85b5q0MpZkBn4rlqKfskw/348s.jpg", "caption": "A fly in my omelet"}]}}, {"review": {"des": "Great, HUGE, bountiful, and delicious salads. It's everything that a salad should be, according to a salad lover with high standards. :) You can add a protein to any salad for a small upcharge. This place doesn't skimp on quality ingredients either - I ordered the super seed avocado salad and it came with half an avocado!! Who does that anymore?? Most places are stingy with avocado anything so to see such a large portion of green goodness in my bowl was a pleasant surprise. You'll be challenged to finish the entire portion - I was.<br><br>Which sadly, is why I had zero room left for anything else so wasn't able to try out other menu items. If you're in the mood for a quality salad, head here. I wasn't disappointed.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pgEJRejFkXFSAlikj4XomQ/348s.jpg", "caption": "Southwest salad + chicken"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DoyaNe3Nm8afMhe3lk3SrQ/168s.jpg", "caption": "Super seed avocado salad + chicken"}]}}, {"review": {"des": "A wonderful place for a cup of coffee or tea, however, the cakes are too sweet: we had carrot cake which was ok and a rainbow cake - not impressed. They use a regular vanilla frosting, whereas it's much more flavorful if stuffed with mascarpone cream .", "pics": null}}, {"review": {"des": "I literally just left this Bakery, I can't believe what I just witnessed... <br><br>My office is downtown in the loop.  I was in the mood for something sweet so I decided to walk up and down Wabash to see if I could find something. <br><br>I came across this place, I saw all types of desserts displayed through the window. I decided to go in to observe the baked goods they had on display. <br><br>One of the ladies asked if I needed help, I explained to her that I never been there before and I needed some recommendations. She begin to explain each dessert, and as she was talking, I couldn't help but notice that there were tons of big ass ants all over the food!!! <br><br>The crazy thing about it, the employee appeared to be so used to it that she didn't even miss a beat as she was pointing to each individual item. <br><br>Oh my God!!! <br><br>I had to play it off, I had to  act like I was contemplating on what I was about to order then I walked out when she turned her back. <br><br>Absolutely disgusting! <br><br>I feel like I have insects crawling all over me right now. <br><br>I will definitely be calling Health Department.", "pics": null}}, {"review": {"des": "Wish there was one of these here in Miami! <br>In just 3 days we visited this bakery 3 times! Always left satisfied. Had coffee, hot chocolate, golden milk and a breakfast meal. Gets pretty busy, and seating is kind of crowded but we were able to see past that. Can't wait to visit again!", "pics": null}}, {"review": {"des": "The best spiced mocha ever.just the right amount of heat. I apparently need to put cayenne in my coffee!", "pics": null}}, {"review": {"des": "Goddess and the Baker is a cute coffee and desserts spot. I came in just for some iced coffee. I chose the \"Gringo Goddess\" (I think that's what it was called) which had an horchata flavor, mmmmmm! Very yummy! They have a wide variety of desserts which looked delicious, but I already bought some else where. Darn haha. Good \"pick me up\" spot!", "pics": null}}, {"review": {"des": "Highlights: Hip vibe, beautiful and tasty arrangement of pastries, and unique and delicious drinks! <br><br>Friends I've taken here all love the atmosphere of Goddess and the Baker and it's a great place to grab a snack, or a coffee for that 3pm slump, or to meet a friend over some coffee/tea!", "pics": null}}, {"review": {"des": "Seemingly an overnight sensation to those outside Chicago, the fact that Debbie Sharpe's Goddess and Grocer has been serving citizens globally-influenced Sandwiches since 2004 unknown despite many visits between 2008 and 2013, it was based on strong reviews that a mid-day break was taken at Goddess and the Baker on South Wabash Avenue, a second location further north noticed one day later but the first visit enough to satisfy curiosity about the concept.<br><br>Originally opened in 2015 and quick to gather followers in the age of Instagram, Rainbow Cakes and decorative Cookies matched to flourishes of interior design making for great photos, it was during the lunch rush that doors were entered at the far end of Goddess' counter, slow progress from left to right allowing plenty of time for decision making though the lack of overhead signage may see those placing large orders forget items along the way.<br><br>Doing Panera-plus volume and thus reliant on scalable recipes, prices for myriad Coffees, Teas and Frappes high but not deterring those heeding advice to \"Eat Now Caffeinate,\" it was after paying nearly $20 inclusive of tax and tip that a number was taken to communal seating, nearly ten minutes required to slice and plate two pieces of Cake after another pair of items were bagged.<br><br>Expectedly popular with students from nearby Art Institute of Chicago as well as tourists, proximity to shopping and Millennium Park generating plenty of foot traffic, it was beginning with Goddess' multi-layered wedge that soft sponge was found divided by ribbons of Buttercream, the sweet-on-sweet mostly what one might expect to find at a Wedding while the Carrot Cake was similarly layered but bright with spice and Cream Cheese Icing plus Nuts and Raisins added for texture, though the Caramel Sauce was entirely unnecessary.<br><br>Opting to take the bag elsewhere as Goddess' overly-loud stream of Pop will quickly grate on the nerves of most born prior to the year 2000 it was after just one bite of a dry Snickerdoodle that the rest was set aside, one look at the interior of a Cinnamon Roll that looks more like Bread with Frosting enough to lower expectations but the actual taste even failing to meet those.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/W-EqovSdlRu-wmFkpgk0Rg/348s.jpg", "caption": "07/05/18 Goddess and the Baker: Cinnamon Roll"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/uFKnWkk5Oyw66TLPRPP5JA/168s.jpg", "caption": "07/05/18 Goddess and the Baker: Cinnamon Roll (interior)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dtIikcNl0k2ap_sexOQRPQ/168s.jpg", "caption": "07/05/18 Goddess and the Baker: Cinnamon Roll"}]}}, {"review": {"des": "What a great impromptu decision to walk into this coffee shop while exploring Chicago. The drip coffee was fantastic and full of flavor (thanks to the Yelp check in offer for the win on free coffee!). The barista recommended the vegan banana muffin, and I must say it was one of the tastiest muffins I've had in a while.<br><br>They offer a variety of milk options for you to tailor your drink, and this place has you covered with their self serve water station if you prefer your water sparkling, cold or room temp. <br><br>I really enjoyed the atmosphere and energy of this place and was sad that I had to leave before being able to check out their happy hour. I'm putting this on my go to list for the next time I'm in the city.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2aFqHG3weBEGwwbPbPlNuQ/168s.jpg", "caption": "Vegan banana nut muffin"}]}}, {"review": {"des": "Cute cafe space and decor. On staff recommedation, ordered the cinnamon roll, Nutella pop tart and 2 macarons  (salted caramel & rose). With a check-in, obtained a free drip coffee. Coffee was great!<br><br>Rose macaron and nutella pop tart, not so great. Could not taste any specific flavor in this macaron. The poptart dough was too thick, dry and overly flaky/crumbly, thin chocolate icing fell off in large pieces, and nutella filling was barely present. Salted caramel macaron was nice, but I wouldn't order macarons here again. Cinnamon roll was delish. <br><br>Wasn't in the mood to try their rainbow cake ($7 a slice!) but they do offer a wide variety of pastries and other brunch-like, savory dishes. I would come again for their coffee and, like others have mentioned, the ambiance.", "pics": null}}, {"review": {"des": "Liquid chocolate w buzz: like drinking 3 Hershey bars - in Spain would've been 1/3 the size, though when shared with 4 ppl for churro dipping it would be this big <br>Brownie: rich, dark, fudgy, but nice. <br>Carrot cake: big, not super sweet, good", "pics": null}}, {"review": {"des": "Great place for a quick bite. Breakfast, lunch, snack, anything this is a good spot. I ordered a chicken club and it was amazing. Simple but the bread was so fresh, mind you I ordered this around 5pm. I wanted to get the rainbow cake but they were sort out. They have many many many other sorts of pastries. FYI, if you check in you get a free cup of hot coffee.", "pics": null}}, {"review": {"des": "I loved the decor of this place. Probably one of the coolest places that I visited in Chicago. I used their current check in offer on yelp and I got a free drip coffee out of it. Gotta love it. My wife got their strawberry bread which was very good. It had a legit strawberry flavor not a fake one. I ordered the cinnamon roll which was good but very very sweet. Was only able to finish half of it because it was too sweet. This is a really cool place to come in and relax with a cup of coffee and some pastries.", "pics": null}}, {"review": {"des": "TL;DR- Get the cake. Any cake.<br><br>I got a slice of the rainbow cake (specifically for IG, dont hate!) and I was surprised by HOW GOOD IT WAS. Legit. The cake was moist and the frosting was such a perfect compliment! <br><br>They also have sparkling water on tap. YES THATS RIGHT.", "pics": null}}, {"review": {"des": "Iron man omelet - yum!<br>Apple butter oat latte - double yum!<br>Sparkling water tap -amazing!!!<br><br>This is a fantastic little breakfast/brunch spot. Even though it was busy, the order line moved quickly and food was brought out surprisingly quick also. There are some patio tables outside and inside a mix of smaller and communal tables, all seating is based on how lucky/patient you are. ;)<br><br>It's actually been nearly two months since I ate at this cafe (just was visiting the city for a conference), but I've thought about it a few times since, wishing it had a twin where I live now. Definitely try it out!", "pics": null}}, {"review": {"des": "Deliciousness!!! Nice variety of drinks and bakery items. I got the Apple Butter Latte with oat milk, yummy!! And the Chocolate Pecan Pie, so so good.", "pics": null}}, {"review": {"des": "My favorite coffee spot in Chicago. Delicious baked goods and yummy coffee. Great vibe too! Just love it!", "pics": null}}, {"review": {"des": "My daughter and I stopped in yesterday afternoon for a cup of coffee.<br>She ordered the honey wildflower latte which she enjoyed. I ordered the mayan mocha. My daughter warned me that it has a lot of cinnamon in it, as she had tried it on an earlier visit. <br>I have had hot chocolates with cayenne before so I was excited to try it and  I love cinnamon. Unfortunately she was incorrect- the cayenne not the cinnamon accounted for all the spice.<br>There was cinnamon in it but the cayenne just totally overpowered everything else in the drink. If you have a headcold then this is the drink for you; otherwise, I do not recommend it.  I ended up adding a lot of half and half to it and then I could drink it. The place itself is nice and you can order your drinks for there or to go. The food looked good so I may stop there for lunch one of these days and perhaps try another of their drinks as they had some interesting ones.", "pics": null}}, {"review": {"des": "Delicious and cute shop but they change things up too much! :(<br><br>I've been going to this location for several years now as I work right by it. Typically I just order things to go as it is pretty hectic to order and wait in line during lunch time. Most of the time things go smoothly and the food is tasty, but the reason for me deducting 2 stars is from them changing up their menu, not always for the best. <br><br>I originally fell in love with Goddess over the kale and toasted barley salad. I started ordering it 3-4 years ago and would often get it once per week. I LOVED the big box of salad that came with the multi-seed crisps, yum! One day I ordered it though and they changed things up -- the salad started coming in a shallower container (noticeably less food), and they started chopping it/preparing it differently. I tried it for a while but it just wasn't as tasty and they also stopped giving the seedy crisps with it. This lead me to stop ordering it all together. Bummer! :(<br><br>Now on to the avocado toast.... oh man... this has also been one of my favorites on the menu. I've been ordering it for years, and just went today to find out they switched this up too!! :( :( It used to come topped with a delicious herbed ricotta. I just opened my box up today to find it sprinkled with cotija cheese instead. Because I frequently order this online ahead of time, I don't read the description each time, I just trust that I am ordering the same delicious avocado toast. I looked back and can see they updated the description, but I wish they would have renamed the item to warn that it is different -- I don't think I would have ordered it if I knew it now came with cotija cheese. Not sure if this is just a temporary change, but I would advocate to bring back the ricotta -- it just goes so well!<br><br>Finally, I haven't ever left a review for Goddess before, but my only other comment would just be about consistency from order to order. I've ordered the avocado toast probably a hundred times, and sometimes the accompanying arugula salad is completely drenched in dressing and is soggy, other times it is completely dry as if a handful of dry greens was tossed on top. I love the days when it comes out just right -- nicely dressed but not soggy. I would hope there would be a way to make this more consistent from time to time. <br><br>Hopefully this change isn't forever, but I'll probably be taking a break for a while because of this.", "pics": null}}, {"review": {"des": "My boyfriend found out about this shop before our last trip to Chicago and I'm so glad we came, I can't wait to go back next time we go to Chicago so we can go here again!!<br>I'm so disappointed I didn't buy all of the food I wanted here-- they have so many baked goods and pastries and they looked so perfect!! I only had a cinnamon roll to split with my boyfriend. It was kind of crumbly and starchy for being pretty early in the day, so I don't know how old it was but it was still pretty good!! But what we were really there for were the boozy coffee drinks. I got the chrysanthemum honey liqueur latte and he got the Jamaican coffee (rum, kahlua and coffee!) both were perfect.", "pics": null}}, {"review": {"des": "I think I've found my favorite cafe here in Chicago! This girl have been searching for a cafe that can serve a good cup of matcha latte since the last time I was in Chicago and I'm so thankful to find it here. I needed a place to chill while I waited for my friend to clock out of work and found this place that was close by. The decor of this place was super adorable and cozy at the same time. I went to the other branch they have on LaSalle, but it didn't have the same feel as this one.<br><br>I ordered the matcha latte and also the dripped coffee. First sip of the matcha and I was in love and decided that this cafe will be my spot from now on. The dripped coffee was also strong and woke my butt up! <br><br>I wanted to tried other drinks they have on the menu beside the matcha latte so I tried their detox tea. I forgot which one I had, but I remember it has lemongrass in it. I like it and recommend to add a bit of honey to it because it's on the bitter side. <br><br>Another drink that I like is the Honey Wildflower Latte. The perfect amount sweetness to the espresso. Make sure to stir it up since the honey is at the bottom.", "pics": null}}, {"review": {"des": "We stumbled upon this cute little cafe while walking down the street and I'm so glad that we found it! Photo advertising in the window does work, people! The matcha series caught our eye and pulled us inside. There were so many specialty drinks that I wanted to try but we picked the iced matcha strawberry latte and hot rainbow cake latte. His matcha strawberry latte was really good, with just the right amount of sweet strawberry. It was comparable, if not better, than the version at Boba Guys! My rainbow cake latte tasted good but wasn't as sweet as I expected...at least it was pretty! I wish I had ordered some of their delicious pastries in the case, or even the matcha smoothie bowl, but I wanted to have room for other food stops. Definitely one of the better coffee shops I've been to, and it's nice that it's so close to everything in the Loop.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UDf8LMOddC8Vt0Xy30_lbQ/348s.jpg", "caption": "Pastry case"}]}}, {"review": {"des": "The three stars for this excellent eatery is because of the lack of service.<br><br>Not being a millennial I know that I expect too much however we had to ask for our coffee three times and each time we were told it was coming. After it became evident it was NOT coming I went to the counter and was told I had been asking the wrong person and and to order it again. It finally did come out (served by the same person I had been asking).<br><br>The food was excellent. I had the Breakfast Burrito and she had the Avocado Toast. Both of these dishes were filling and shareable. We certainly did not have to order two items to become full.<br><br>The Goddess and the Baker is a busy place and they do a great volume. For us the food was excellent if not a bit pricey but then that is expected in this part of town.", "pics": null}}, {"review": {"des": "Just love this store's branding in general, but the other location has the cutest decor-", "pics": null}}, {"review": {"des": "Goddess and The Baker is an adorable coffee shop and bakery known for their famous slices of rainbow cake. This location on Wabash is a quick hop, skip, and jump away from all the shopping on Michigan and State St. <br><br>I came here for something to eat after a little shopping endeavor. Walking in, I was impressed by how nicely decorated the shop was. This is any instagrammer's dream: nice bright signs, adorable decorations, and pretty pastries. There's also plenty of seating. A huge community table is in the middle of the bakery and a few side tables line the walls too. However, there aren't too many outlets here. So, if you want to get some work done here, I would highly suggest making sure all your electronics are charged before spending a few hours here.<br><br>Aside from the adorable decorations, they also have an expansive menu filled with lattes, tea, alcoholic drinks, sandwiches, salads, cakes and more! All of these items range from classics to specialty items. I decided to go with the honey wildflower latte and the Santa Monica turkey sandwich w/ a side of chips. Both items came out to me very quickly and were equally delicious. I especially enjoyed the honey wildflower latte as it had a hint of sweetness from the honey but mostly carried that great coffee taste we all know and love. <br><br>Overall, I think Goddess and the Baker is a great place to hang out with friends while getting coffee and other good eats. While they do offer a good amount of seating, it is often crowded. So, be prepared to wait for seating or take some items to go!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HybHIfTIuvJneb8Gx0Cwuw/348s.jpg", "caption": "Honey Wildflower Latte"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7V_HEW7_Wz6fqQ-SaR1olg/168s.jpg", "caption": "Santa Monica Turkey"}]}}, {"review": {"des": "Pretty decent spot! I love their coffee! Fun menu with avo toast and other such \" trendy \" items. Cute for Instagram shots (plans, neon lights...). Worth a try if you're in the area for a switch up from Starbucks!<br><br>Conserving this is a bakery I was hoping for some less industrial baked goods. Definitely was a long shot from a Panera or Corner Bakery, but still left a bit to be desired. One thing that sets them apart are the fun bakery items like rainbow cake and unique frosted cookies. <br><br>Would not recommend this place for large groups. There is one big long table and many 2 seater tables. Note, cash is not accepted, which I found a bit odd...but hey!", "pics": null}}, {"review": {"des": "Walking by on Wabash this place looks very appealing and while they offer some tasty treats they also offer bad service and rude employees, DON'T waste your time or money! I watched them frustrate countless customers while we waited forever for our order to go!", "pics": null}}, {"review": {"des": "This is a great spot to get some coffee and sweet treats. It also offers a small offering of lunch items that will keep you wanting to linger longer.<br><br>Goddess and the Baker has some really friendly staff and reasonably fast service. There is some nice seating inside, but it's limited so you might need to take your coffee to go.<br><br>I love coming in to check out the dessert as they seem to rotate their baked goods seasonally. If you're in the loop, you should definitely visit!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nA88ctjs69MeRMF9i-SujA/348s.jpg", "caption": "Made in house daily (with Love I presume!)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pXWZyYuyyJHNd8UFrZeHdw/168s.jpg", "caption": "Yummy desserts!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FFb8MPs-TiU882KTK6j2KQ/168s.jpg", "caption": "Go Cubbies!"}]}}, {"review": {"des": "Goddess and the Baker is a really trendy spot to get coffee/ tea and a snack in Chicago. There are plenty of options both on their drink menu and on their food menu, but you'll find that many of the items on the food menu are on the sweet side. It looks like they have many pastries and drinks that rotate out seasonally and there's something for every set of tastebuds here. <br><br>One of the big draws of Goddess and the Baker is the giant \"Eat Now Caffinate\" sign located inside the restaurant. You'll notice that it seems to have a magnetic effect on tourists looking for a cute spot to get a drink, snack, and Instagram post all in one. The staff is very nice and helpful when it comes to making suggestions for drinks from their vast menu. The one major downside of Goddess and the Baker is that due to its popularity, it can be hard to get a seat inside the restaurant. You'll often find that people are actively hunting for seats big enough to accommodate their groups, but generally everyone is civil about it.", "pics": null}}, {"review": {"des": "I was in Downtown Chicago looking for French bakery ,and end up whatever yelp showed me . After I order few items and come to register , they said they won't accept cash  I didn't have my credit card  and I had to run to get my husbands. Anyways they should have sign on the door  or here in yelp , saying no cash accepted. Or workers should warned me before I ordered . Because my husband and my little baby  was waiting in the car  it was too much wasting time . I didn't feel the customer service professional either . I got home and had my 2 different kind of gluten free cupcakes, it wasn't fresh or tasty either . At least I didn't disappointed from Rainbow  cake . It was fresh and delicious  I could've give 5 star  here , because of customer service , 2 old muffins and no cash  deals disappointed me . I think Downtown areas should be number one  I'm not coming back because there is so many other bakeries has so much to offer in the area .", "pics": null}}, {"review": {"des": "Well, I just love it. <br><br>However can only give the high three because of the cramped quarters here. One long communal table, three two tops, and a couple comfy chairs in the front window. The counter space seating is a bust. People waiting in line brushing up against your food or staring at your goodies. (Not those goodies! Though....)<br><br>Anyway, rainbow cake is my thing here. I've had their specialty coffee drinks and found them unmemorable otherwise, I'd mention. Lavender something or other maybe it was. <br><br>The counter display of sweets is beautiful and the staff is friendly enough. I'm appreciative they have complimentary sparkling water. I like the decor/the vibe. I'm talking myself into four stars. They really are nice here...and a Halloween e-mail...OK round up...4 stars!<br><br>If this were a rainbow cake only review - five stars. Though I thought about getting an appetizer last visit, I skipped it due to it being so people-packed and with limited seating. The perils of being popular, I suppose!", "pics": null}}, {"review": {"des": "I could have the Apple Butter Oat Latte and Matcha and Chocolate loaf everyday, if I lived here.", "pics": null}}, {"review": {"des": "Super cute coffee shop near millennium park. We went at about 3 on a Saturday afternoon and it was packed, be prepared to take it to go or sit outside! I got the gold latte and it was the perfect amount of sweetness and rich espresso, the glitter was also a fun addition! I don't know if I just had gotten a piece of cake that was older, or if all the cake tastes like that but to me it tasted stale and like it had been sitting in the refrigerator for awhile. Lengthy specialty drink menu that I would come back for again to try different drinks!", "pics": null}}, {"review": {"des": "Cakes: 3.5/5<br>Service: 3.5/5<br>Ambiance: 4/5<br>Overall:  took a couple slices to go and It was pretty good.  A lot of selection here so I was only able to get two of them!  <br><br>The extended review...<br><br>Cake:<br><br>Raspberry lemon cake - the cake was very moist and pretty good flavor was pretty good.  The raspberry jam definitely was more prevalent in this particular cake.<br><br>Cookies and cream - the chocolate cake layers were very moist.  Good frosting flavor though it seemed to be not as creamy as it was stiff.  <br><br>Service: the waitstaff was ok.  Perhaps it was because it was closer to closing tim that they were not quite as attentive and they were focused more on cleaning and getting out of there.<br><br>Ambiance: a cute place to chit chat and have a sweet treat.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OYewO622Wb2UgYHMxZiIlg/168s.jpg", "caption": "Cookies and cream cake -moist chocolate layers but butter cream could be a little less stiff"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JENPtJ7I27Ah1Rz2mSBrbA/168s.jpg", "caption": "Raspberry lemon cake - more raspberry than lemon but good."}]}}, {"review": {"des": "Rainbow cake was amazing! Açaí bowl was overpriced for the amount (like a small hospital side size bowl) and was warm; which was sooo unexpected and gross. Macaroon were old; very stale and not even stored in a refrigerator or cooler of sorts. The person working recommended some sort of apple oat coffee; WORST thing I have ever tasted! Two stars for the friendly staff and the amazing rainbow cake.<br><br>Also, nothing is labeled so it can be tricky to order without running back and forth between counter and register.", "pics": null}}, {"review": {"des": "I didn't enjoy my visit to this location. The tables and seats were dirty, with crumbs and used cups lying around. One table was broken and tilting. I ordered an earl grey tea that tasted like soap and was undrinkable. The available wi-fi was private and login information was posted nowhere. And the in-:store music was loud and made it impossible to think. I don't know how people manage to get any work done in there. I won't be trying again.", "pics": null}}, {"review": {"des": "Came back a second time with some friends last month. Knowing that you had to go up and order rather than them asking made it easier. My friend was confused at first, just as I was the first time I went, because there's no sign that says \"order here\" and no employee tells you either. <br><br>The weather was perfect so we sat out on the patio. <br>Cake slices were big and delicious as usual. My friend was concerned that he spent about $14 on a cake slice and latte, but I reassured him it was worth it. He loved the carrot cake and was impressed at the size of the slice given to him! <br><br>Still knocked a star off because of the service. Our table in the patio was the most enclosed in the fenced area. Aka it was hard to get out between the 5 of us and two other tables filled with people. When the waiter brought us our cake, we asked for forks and he said it's inside. We looked at each other for a split second and he left. So..he can tell it's hard for us to get out and yet doesn't offer to get us forks. He came back again a second time and we subtly hinted again if he could maybe get us forks but he did not.<br>I get that maybe it's not in their job description because it's located in a self-serve area, but a few forks would be nice! <br><br>*TLDR; cakes are a must, order at the cashier, grab water, forks, and napkins before sitting down.*", "pics": null}}, {"review": {"des": "This is a cute bakery/cafe and they have a wide variety of items to choose from. Their baked goods have adorable designs/decorations. There's plenty of seating and seems like an ideal place to work on your laptop or to catch-up with friends. However, beware of their prices -- they charge a lot for their items, but I'm not too sure if the quality is consistent with the prices.<br>I wanted to try out the S'mores Frappe, but the cashier said they no longer had the S'mores Frappe. I browsed over the menu again and saw they have a different Frappe item and the cashier said they they no longer do ANY Frappe drinks. I wish she had told me that in the first place.", "pics": null}}, {"review": {"des": "This bakery is so so gorgeous. All of the treats are eye candy and the ambiance is very cool. I walked by with a friend during my first visit to Chicago and knew I had to stop in.<br><br>When you check-in on Yelp, you get a free coffee which was perfect. Since we just had eaten lunch, I opted for a smaller treat. I got the Rose macaron which, I'm sorry to say, was a disappointment. The shell was crunchy and the entire thing just tasted like sugar. I took one bite and had to throw it away. I'll assume I just ordered the one thing on the menu that wasn't fresh because everything else looked amazing and my friend had no complaint about her order. I didn't have a great experience but I'd give them another chance with a different item.", "pics": null}}, {"review": {"des": "Cute cafe with a communal table. It was very busy. They have baked goods, salads, sandwiches, and juices.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4RmhZrCdbrjYvKL0OaOCwQ/168s.jpg", "caption": "For Valentines"}]}}, {"review": {"des": "We ate breakfast here twice! I love it. They have amazing croissants and super yummy coffee!<br><br>The shop is small, but we were able to find seats for all three of us both mornings. <br><br>I think this was the best Americano I have had!<br><br>Their pour over coffees are quite yummy!<br><br>Service was fast and the servers were great.<br><br>Oddly it's credit card only and they do not accept cash!", "pics": null}}, {"review": {"des": "Absolutely love this hip little coffee shop! I've been here three or four times in the six months I've lived in the city. I love the presentation of the brew coffee - the small size is $2.79 and it's GOOD coffee, not bitter at all like the brew coffees at Starbucks. I've ordered the avocado toast and the breakfast sandwich. Both were excellent and very reasonably priced. They have an array of pastries and sweets. Also an amazing looking coffee drink menu that I have yet to order from. Goddess and the Baker is a must try when you visit the city!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8f-Ms0D_f3RSkDfqfmspcg/168s.jpg", "caption": "Brew coffee and strawberry lemon poppyseed scone"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vEEa4m3u3o8lm1v1JwDKgQ/168s.jpg", "caption": "Avocado toast"}]}}, {"review": {"des": "This was a cool, funky cafe. I got a couple slices of cake and tried the last spinach and feta croissant. I liked the designs and atmosphere (and the adorable containers of saké)... The cakes were great textures, but I thought the carrot was much better than the chocolate (the icing overpowered the cake part). All best fresh!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BendpWZG_zerAXA-8G0fyA/348s.jpg", "caption": "Cake slices to go."}]}}, {"review": {"des": "Awesome ambiance, fast service, and a line out the door. Actual coffee was a bit acidic for my taste, but the cherry pie totally made up for it.", "pics": null}}, {"review": {"des": "Such a cute café with amazingly delicious healthy food!! And some beautiful sweets too. Located right across from the Silversmith Hotel where I stayed, Goddess and the Baker was packed when I arrived on Sunday during brunch time. There are not a lot of seating inside so you might have to wait for a chair. The middle table is like a picnic table. Then there's two people tables on the side and some high top chairs. There's also a very cute lounge chair area by the window for two people and a small table outside. The menu includes fruit, yogurt, sandwiches, salads and a bunch of pastries in the window display. Everything I ordered was great! <br><br>Avocado toast: the sourdough was nicely toasted. The herbed ricotta plus smashed avocado was such a creamy savory blend. They really complimented each other. <br><br>Super seed avocado: the mixed greens was really good with clementines. And it was my first time having avocado with chia, flax and sunflower seeds and wow!!! It was so good. Crunchy and squishy, savory and peppery. <br><br>Açai bowl: the açai tasted very good, lots of banana flavor. It was topped with granola, coconut flakes, chia and flax seeds. The to go  size of the bowl was more like a cup. I think the dine in size is a bit bigger. Small issue in the bigger picture though.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mFv4nFtrolDL7t6H8xaZ8A/348s.jpg", "caption": "Super seed salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6AZH5Wa1ncPvMDAELC7iyg/168s.jpg", "caption": "Avocado Toast"}]}}, {"review": {"des": "Love this location. The friendly staff and of course my Honey Wild Flower Latte.<br><br>If you're looking for a meeting place or just a go-to spot to chill, get some work or reading done, I recommend G&B. But don't linger forever. Seating is limited and other people may want to have a seat and enjoy the ambiance. (And sweet treats.)", "pics": null}}, {"review": {"des": "Delicious treats that will delight your senses. The meticulousness with which the baked goods are decorated and presented is impressive. Get ready to spend about 5 bucks on a scone. Good thing is the space has a large table accommodates a large party if needed.", "pics": null}}, {"review": {"des": "Read so many positive reviews about this joint and how it can serve \"gluten-free\" patrons and people with food allergens.<br><br>However my experience here was lack luster as the cashier had no idea what gluten was and had to ask the chef. They did have gluten free bread however which made up for it, the lady was also slow as a snail and I asked her about gluten free cookies, treats, and she said hold on like I was a burden and then I said never mind because she had to go \"ask\" again. I'm glad she asked and didn't lie but literally train your employees on food allergies. When we type \"gluten-free\" on yelp search and you pop up we want to know you actually are gluten free. <br><br>Also the rainbow cake, make it gluten free. CMON! However excellent interior, beautiful smells and scents. The train passing by is awesome.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MW09wVPnZ_aH-irPbHx44A/348s.jpg", "caption": "forgot what drink but excellent elixir"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gkpwPfqrLW-W9voFLaE4gA/168s.jpg", "caption": "gluten free bread sandwich (messy, but not bad)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AYouoQxBvQ1CxAx1g6E3kw/168s.jpg", "caption": "Looking out"}]}}, {"review": {"des": "Loved the matcha latte. Avocado toast was also yummy. The chicken bahn mi is ok, not bad flavor wise but a bit on the smaller side, chicken was kind of dry.", "pics": null}}, {"review": {"des": "Omg I love this spot! You can't miss it and should stop by this place. First I went in for tea in the morning and then juice later on that evening. I absolutely love the decor of this place and location. I'm defiantly coming back to this place whenever I'm in Chicago again. Thanks Goddess!", "pics": null}}, {"review": {"des": "Stopped by for lunch and did not realize then how many different savory options they had! I decided to choose a delicious Vietnamese salad bowl full of glass noodles and a whole bunch of fresh vegetables. I had a freshly squeezed drink called Morning Glow and mostly contained carrot juice, my favorite! Just one thing I would like to add, I am allergic to pineapple but it was garnished on the side of the glass without it being listed on the menu. I questioned it and the server kindly told me it was just a fun garnish. I'm glad they offered me to make a new one just to be safe. Overall, I enjoyed my experience there, it was a very relaxing, healthy lunch!", "pics": null}}, {"review": {"des": "Modern American style bakery and cafe! Love their drip coffee a lot! Service is good too! To be honest, I love their savory food better than desert... cup cake is a little bit disappointing because frosting is too sweet and cake is too dry", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GKVAVvvPZIeaM6YItywWTg/348s.jpg", "caption": "Cupcake coffee and iron man egg omelette"}]}}, {"review": {"des": "Eat now caffeinate is their motto (which hangs as a huge theater marquee lighted sign on the back wall). <br><br>I was a bit skeptical about Goddess and the Baker, because they're doing a LOT of things. Coffee, tea, juices, beer, wine, boozy drinks, baked goods, breakfast, toasts, salads, sandwiches, soups, and snacks. I'm often wary of places that try to juggle too many menu items at once, as they often fail to do anything of them right. <br><br>When I first came into Goddess and the Baker, I was parched and needed a drink. I opted for their ginger pineapple tonic, which had pineapple, ginger, cucumber, lime, orange, and coconut water. The juices are juiced fresh in-house, but they are pricey. I did enjoy my ginger pineapple tonic though, and I liked my BF's kale apple cooler (kale, Fuji apple, cucumber, lemon) too. <br><br>The next morning, I came back here for their matcha lemonade. I'm a matcha fiend and it was difficult to decide between all the matcha offerings here (latte, lemonade, or tea), but I ultimately decided to go with the lemonade. I'm very glad I did, because it was really good and I finished it very quickly. I also ordered a sunrise burrito, which has eggs, cheddar, black beans, avocado, and pico de gallo. The sunrise burrito was decent, although I've had much better breakfast burritos from California so my expectations are high for any kind of breakfast burrito. <br><br>I would definitely come back to try more of their drinks (e.g. Goddess gringo horchata, Mayan mocha, honey wildflower latter, butterscotch latte, matcha latte, s'more frappe), toasts, etc. The space isn't too big, but there are a number of tables (outdoors too) and the interior is modern and hip. I'd definitely come back for drinks!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VdNvxlt-wII0y_rJG6wVPQ/168s.jpg", "caption": "Arnold Palmer and Sweet Matcha Lemonade"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IlIUylU9td_VAjAONBj9rg/168s.jpg", "caption": "Ginger pineapple tonic and kale apple cooler"}]}}, {"review": {"des": "We had breakfast here on a Saturday morning in August. It was very busy and loud. Seating is mainly long tables that you will share with  other guests, though there are  some individual tables as well. <br><br>We ordered a breakfast burrito and breakfast sandwich with avocado, as well as an early grey lavender tea and a hot mocha for drinks. The food was just 'Ok'. My sandwich didn't taste like much, and it seemed more like a sandwich made with toast,than a toasted sandwich. The bread was just hard and crumbly, and the rest of the ingredients seemed oddly set apart from the bread, not a cohesive meal really. <br><br>Overall I found it disappointing for the price point, a $35 price tag on two drinks, two breakfast items and a fruit cup. I wouldn't specifically seek out Goddess and the Baker again for breakfast, but I might return to check out some of the baked goods.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gt8MESnBsgR0OSzC-Aj2fg/348s.jpg", "caption": "Breakfast sandwich with Avocado"}]}}, {"review": {"des": "I so wanted to like this place very much.   When you walk in it's so cute and there is a great variety of coffees, teas, pastries, and food to choose from. <br><br>Actually, we liked the coffee quite a bit.   I got the goddess gringo horchata and my bf got a mocha frappe.  Both were quite delicious.<br><br>My problem lies in the service.   I'm a food service worker myself and I give a lot of allowances and mostly never complain.  However, when I'm unhappy with the service it usually leaves a very bad taste in my mouth. <br><br>First there didn't seem to be any sense of urgency.   Not that I like to be rushed, it wasn't that.  The kids at the register just didn't seem like they wanted to be there. <br><br>I finally get to order and am asked if I want the mocha frappe large or small.  I say large and the barista pops over and says it only comes in one size.   I reply this is ok and the girl at the register tells me I can only have the smores or the almond joy frappe.  Well I don't want either, I want a plain mocha frappe (which is clearly on the menu.)  Then the barista gets annoyed looks at me like I'm an idiot and says you can have a mocha frappe but you can only have it in one size.   Listen if I was being irate I can maybe tolerate this answer but I wasn't.   I actually didn't say a word because I was thinking about which my bf would rather drink.   Don't be mad at me because the girl at the register has no idea what she is doing.<br><br>Then I had to wait a very long time for 2 drinks.  It was a good 5 minutes.  There were 2 people who ordered behind me (one at the other register and one behind me) and they both got their items before I did.<br><br>I also ordered a muffin which I know she heard me say because I had to tell her twice what I wanted.   I didn't get a receipt (technology) but as I'm waiting to get my drinks I realize I have no muffin.   I go back to the girl and she CAN'T EVEN REMEMBER SERVING ME!   I was standing there in front of them for over 7 minutes.   You don't remember me?  I do the math in my head and realize she never rung me up for it and then she tells me oh I can ring you up for it. What?  No thanks, I do not want it any more.  <br><br>We decided to sit instead of taking it away and no joke the 2 people at the registers were just standing there talking and laughing.   Seriously do some side work.   Maybe clean the dirty tables or greet the customers as they walk in. <br><br>Luckily the coffee was very delicious and I'm sure that muffin would have been as well.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qLWdhS5TCWjtWd1BaGrmAA/348s.jpg", "caption": "Very very good but terrible terrible service"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ue_MSwFf3RMvs5NioGmpQQ/168s.jpg", "caption": "Super cute"}]}}, {"review": {"des": "Stopped here for a quick coffee- they don't take cash, which is fine. Their menu was long, but not really that extensive? I got a cold brew with oat milk and it wasn't bad. It tasted fruity to me, but was still good. It's a cute place and had pastries, cookies, cupcakes, etc. and was PACKED inside. Service was quick and staff was friendly despite being so busy.", "pics": null}}, {"review": {"des": "The location and overall feel of this place is fantastic. Everything you look at is adorable, from the neon signs on the wall to tiers or rainbow cake. All this paired with fantastic and inventive coffee and great, high quality dishes make for a great experience.That being said, the prices, for the food especially; are slightly outrageous. I payed nearly ten dollars for a tiny açaí bowl, and even with high quality ingredients, I'd could not have been worth that much. It's definitely a good place to come to for a special occasion or a treat yourself kind of day. Come for an experience, a good instagram picture, and some good coffee but don't expect to leave with your wallet unscathed.", "pics": null}}, {"review": {"des": "It was my first time visiting Chicago and by a friend's recommendation, we chose to stop by for an afternoon snack. Interior decor is really visually-pleasing with big arm chairs window-side and bright. It felt like I was at some cool hipster cafe in LA or NYC. The array of pastries at the front counter of the store is featured behind glass and is plentiful but on the pricey side. We decided on getting a snickerdoodle cookie ($3), matcha chocolate chip muffin ($4), and a strawberry matcha latte to share ($5). <br><br>The drinks menu was pretty unique and hard to choose from! They offer a good selection of trendy drinks and although the person who took my order seemed new/confused about the featured ingredients in the strawberry matcha latte, it was very rich in matcha and delicious! The cookie was fairly large and on the thick side and I liked how the cinnamon flavor came through. The muffin was warmed which made the chocolate drizzle on the top all gooey and tasty, but the only qualms I had with this muffin was that it did not remotely taste like matcha. In fact, when I cut it down the middle with a knife I saw large green specks throughout the muffin, indicating that food coloring was used. It honestly just tasted like a green chocolate chip muffin more than anything. <br><br>But the cafe is a cool place to check out, very close to touristy areas like the Bean and Millennium Park!", "pics": null}}, {"review": {"des": "I had a avocado salad. The cabbage and lettuce was brown on the edges!  Plus the person didn't know how to cut it and I got a lot of of the thick stems of the cabbage. Gross! The only edible thing was the avocado and the mandarin orange pieces. . .but there was a pieced of the peel in my salad too! <br><br>Poor poor, quality control here.<br><br>Plus the cafe looks like its going downhill. They use the shelves up the wall for storage and it looks unsightly to see the cardboard boxes stored up on them.  They should be in the back.<br><br>The pictures online doesn't look like the inside.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/b-opGYPyWH6v0F79_LD0CA/348s.jpg", "caption": "Avocado salad - if It was prepared without brown cabbage it would've been much better"}]}}, {"review": {"des": "This cafe is different from your neighborhood coffee shop that just serves coffee and scones. Their variety of sweets is extensive .They had green tea cupcakes, cakes , lemon tarts and macaroons and even sugarfina candies.  I got the matcha green tea and you can see they use real tea leaves. The macaron was delicious.This place is a splurge and crowded since it's on Wabash.  I wouldn't recommend this place for studying since it noisy but great if you want try a cafe with a with a lot of interesting treats.", "pics": null}}]}