{"name": "goosefoot-chicago", "reviews": [{"review": {"des": "So, before I dive into any type of review regarding the experience at Goosefoot, let me just say there is a reason Michelin Star rated restaurants are rated.  And Goosefoot... Bravo!!<br><br>Nestled along the north side of Lawrence Avenue between Western and California, Goosefoot sits on an unassuming corner and if you sneeze, you will pass it up.  Make that u-turn quick because you are going to be treated with a dinner experience you do not want to miss.<br><br>We arrived for our reservation and were greeted by staff.  Once we sat down, one of the owners (Nina) came to the table to just talk and explain the ambiance of the original Woodstock theme (music and videos were an incredible journey back).  Comfy tables, small - quaint seating, perfect for an intimate couple's dinner or for two couples to catch up.<br><br>The menu, oh the menu.  From taste to presentation, they hit it on the head!  The scallop melted in your mouth, the pumpkin soup was to die for and the angus beef was simply delicious.<br><br>If you have a special occasion you are planning, something for that significant other, maybe want to intrigue someone into becoming your significant other... grab your favorite bottle(s) of wine and make a reservation at Goosefoot for an incredibly decadent evening of tasteful experiences. <br><br>Thank you Nina and Chef Chris, I will be back!", "pics": null}}, {"review": {"des": "Honest review: (u can bring ur own wine its byob n u have to pour ur own wine) didnt like it foods not that flavorful n dont feel like u get a lot for what u paid for like the only extravagant thing was truffles they didnt even use like A5 steak for there steak course like felt like the bill should have been $100 tops n thats a stretch ambiance: its really cute  n modern inside. Service: was attentive nice described menu items gave new silverware. Love how they make origami for u n are really nice They dont answer their phone though Food: this was probably like the worst michelin star place in terms of food nothing was really that complex or flavorful idk how they have a Star to be honest everything was very one note n im jus like ok is it gonna get better later on then never did then desserts came n im like thats it? Like thats some shit i can do at my house food really needs to be stepped up theres no cool techniques rare ingredients or any showmanship n a lot of dishes needed texture. best things: steak/goose foot<br><br>Lobster: lobster was cooked perfectly but it was very one dimensional like its just lobster in a cream sauce with lemon <br><br>Pumpkin soup: this tastes like a jambalaya but in soup form. The issue is it didn't have any complexity n needed salt literally just tasted like sausage crab n soup n I'm like ok? Where's the flavor but it was really filling though just don't think this dish should be on the menu wish there was something for texture <br><br>tortellini: this was good not great. The pasta was cooked well picture like a gourmet Mac n cheese. I loved the addition of truffle but wish there was more of a truffle flavor. It's just a pasta in a butter cream sauce wish there was more cheese cause the cheese is what gave it the flavor wish there was something for texture <br><br> steak: this was the best dish of the night but there was issues. For one the steak was raw like I never complain ever but wanted to send it back. Another issue wish it was a more high quality steak like either wagu or Kobe beef. However it was really flavorful all the components really worked together just make the clear sauce thicker cause its hard to eat cause its so soupy <br><br>Pallet cleanser: this was really basic honestly tasted like a smoothy was like hmmmm this really wasn't necessary at all cool presentation but wasn't flavorful <br><br>Goosefoot: this was good like it was the most complex thing just there needed to be a bigger portion cause it wasn't balanced idk if it was the matcha or the pink peppercorns but something was extremely bitter and overwhelmed all the other flavors. <br><br>elder flower/meyer lemon/coffee/fennel: its a mouse and a macaroon. The mouse was nothing special just had whip cream n then the mouse: the macaroon was tasty but again nothing special to be like omg I have to come here again<br><br>Coffee: the coffee was bitter liked the different sugar but there wasn't a lot of coffee in the cup though <br><br>Chocolate bar: this was good but nothing different then u can get at the store it's just chocolate with salt and like a floral note really wasn't like that mind blowing<br><br>Wine: they don't have that big of a wine selection but u can bring ur own wine instead which I recommend because u can drink what u like instead of ordering something u may not like", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LVtMgNtGAIz-Ey_TYG0AJA/348s.jpg", "caption": "Inside"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iz5zZ-YFvN6pipLPhwCotw/168s.jpg", "caption": "big easy pumpkin soup/smoked paprika/pheasant/crab/espelette"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QwiiPqn1OMpi2SxMOvIUbQ/168s.jpg", "caption": "big easy pumpkin soup/smoked paprika/pheasant/crab/espelette"}]}}, {"review": {"des": "I have wanted to try Goosefoot for the longest time and finally had the chance to go last weekend. The theme this time around was Woodstock '69 and the restaurant was fully committed to this theme in the form of a cool installment in the middle of the room complete with accompanying music. The pace of dinner was on the slower side (my dining experience lasted for approximately three hours), so be ready to take it easy and enjoy the food.<br><br>Usually with tasting menus, there are at least a couple dishes that I consider \"misses\"; however, I thought that all of the courses at Goosefoot were delicious and exciting in their own way. Here are some of my favorites of the night:<br>-Diver Scallop: the opener course was absolutely delicious! The bisque-like sauce was the best part. It was strongly flavored without being overwhelming.<br>-Nina's Pasta: I loved the texture of the pasta. It was perfectly cooked and you could taste how fresh the pasta was with each bite.<br>-Elder Flower/Meyer Lemon/Coffee dessert: the presentation of this dessert was super cute and it was also tasty. Lemon and coffee do not seem like they would go together very well, but in this particular dish, the flavors were harmonious. The hints of lemon provided nice breaks in the strong coffee flavor of the mousse.<br><br>I have to praise the creative presentation and plating of each dish. I enjoyed how the atmosphere of the restaurant was casual and not in any way stuffy. You could easily enjoy casual conversation without feeling intrusive. Goosefoot easily provided one of the best meals I have had in Chicago at this price point. I am looking forward to coming back sometime in the future!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/22d-WZN7BXTX-Ql0e6bUsQ/168s.jpg", "caption": "Nina's Pasta"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qfYm9zIiicPJw1AEB-mv7Q/168s.jpg", "caption": "Diver Scallop"}]}}, {"review": {"des": "Amazing food, beautiful ambience and very friendly service. We made reservations to celebrate our anniversary and we couldn't have been happier with our choice.<br> <br>The food was exquisite and the presentation was beyond beautiful.<br><br>The owners, Nina (service) and Chris (chef), gave a personal touch to our experience by both signing a little note with wishes for our occasion. Nina asked us our names when we first sat down and remembered then throughout the night, which was very thoughtful.<br><br>You can BYOB (no corkage fee) or purchase a bottle from their collection. <br>We were there 3 hours for 8 courses ($145 per person before tax and tip)<br><br>A very nice touch is the little to-go gift at the end: chocolate bars they make and some seeds you can plant! <br>The offer really great coffee or tea too, at no extra charge.<br><br>There is plenty of parking. We went on a Saturday night and we found spots right across the street.<br><br>Goosefoot restored our faith in Michelin star restaurants, after a recent disappointment we had at another similar restaurant. <br><br>We will definitely be coming back. Highly recomend.", "pics": null}}, {"review": {"des": "Tl:dr A Michelin One Star restaurant that has just two staff members who are also the owners. They are the couple who do everything from the cooking, waiting, serving, & all in one, or should I just say two! <br><br>Fifteen guests were at dinner in the entire restaurant that seats just sixteen (yes, there's a restaurant with the same name!). <br><br>It rightly felt we were in Chris, & Nina's home - because, Nina even introduced the space as their home. <br><br>Nina folded the already well-used napkin of a guest exactly like they were first freshly folded. Just a thought: touching all the food particles on it brought to my attention on how that would feel. Not fun!<br><br>A lot of birthdays being celebrated, including Chris', the chef, & co-owner with his wife, Nina as you recall. John Lennon's birthday was just a few days ago, & because of that Goosefoot was completely adorned with John Lennon themes!<br><br>The food, the service, & the gifts they give you afterwards fills you up good & proper with fun, wit, charm, & much more! <br><br>Overheard a guest telling a couple over yonder: you know the Beatles from Liverpool?<br><br>Well, you know I just ate some liver. Ahem. I'm thinking to myself speaking of Liverpool! Beatles need no introduction or anything. Oh yes, I recall listening to Heartpool, & Brainpool in my teenager days. Aha. ;)<br><br>The food will completely blow your mind, heart, & soul as the couple take such great care to make you feel fabulous. You can even joke around with them concurrently as Chris, especially, is such a jokester, & just a great man.<br><br>Everything from the stewed roasted pumpkin course to the soup to the dessert was hearty, & unlike the small portions of many fine restaurants with tasting menus.<br><br>4/2018", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DWvyzNU4rnSEFqETziTrwQ/348s.jpg", "caption": "Autumn beef (details given when asked: Angus beef filet, fennel sauce, artichoke sauce, dehydrated olive oil."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FieJoYz-T2n8lPIs6H-oOQ/168s.jpg", "caption": "Maitake mushroom tortellini/mint/truffle (upon asking her what kind - it's a Burgundy truffle)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FH4zNvloSyQQ10S2Eqibmw/168s.jpg", "caption": "Parsnip soup/French green lentils/ginger/cumin"}]}}, {"review": {"des": "If you assume that fine dining is an inherently serious business you need to check out Goosefoot. Chris and Nina welcome you into their \"home\" and cast aside the pretensions and stuffiness, providing a fun experience of discovery and camaraderie.<br><br>The multi-course tasting menu features twelve dishes of stunning beauty and complexity, each served in a unique and playful way. It's remarkable that two people (and an unnamed helper in the kitchen) can provide this level of culinary and service perfection.<br><br>Each dish is accompanied by a story, delivered individually, often by Chef Chris, who interacts with guests table by table and course by course more than I've ever encountered. How he finds time to cook and arrange each delicate offering is beyond me.<br><br>The restaurant seats no more than twenty people, in a single, synchronized seating.<br><br>On the service side, it would be easy to assume that with only one person--Nina--providing all the service for the restaurant, details such as place settings and napkins replacement, ice bucket refreshing and so on would be impossible. You'd be wrong. Service was consistently at Michelin level.<br><br>You might also assume that a BYOB restaurant would have minimal glassware, but again you'd be wrong. A full set of Riedel sizes was available and provided, matched to each wine guests brought.<br><br>in the end, the two things I will remember most about Goosefoot are the beauty of the food, and the ebullience of our hosts.<br><br>Goosefoot is one of the best fine dining values in Chicago, and it's certainly the most lighthearted one.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lz43yOnxtpLwGLF_A4MDOA/348s.jpg", "caption": "Yuzu, cherry and peach tonic"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wYZAql3m4ysKj-gF3ofEtA/168s.jpg", "caption": "Macaroon"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/c_eToRdtyW2ND-Zbk3f6rA/168s.jpg", "caption": "Beef"}]}}, {"review": {"des": "The hubby and I accidentally booked a reservation here during restaurant week, shocked that we were able to get in on the upcoming Saturday night (we'd been trying for months, but no openings). Turned out they were not part of restaurant week (oops), and we were the only people there not celebrating a special occasion -- just, you know... Saturday night. We took great advantage of the attached wine shop, and were impressed with each course from start to finish -- even the menu was a keepsake to take home to plant in soil to grow edible wild flowers!! Seriously! And the husband-wife team, plus the excellent staff, made this such a great experience. It's worth every penny!", "pics": null}}, {"review": {"des": "LOVELY to the max people. Nina and Chris are perfect hosts, from the first phone call making the reservation on a short notice, to welcoming us to the restaurant, their attentive service, and opening the door for us on the way out.  They tried hard to make it a special evening for us, and for all their customers.  We can not thank them enough. I certainly look forward to going back, and have no hesitations in recommending Goosefoot.<br><br>Food:  all beautifully presented. the first dish (in egg shell) with preserved garlic was excellent and loudly said they do not joke with flavors; not shy about it. Built the expectation that failed with the meat dish which felt short on flavor after a series of flavorful dishes.<br><br>The second dish, a combination of three small appetizers, gorgeously presented but a tad bit sweet.<br><br>Squash dish was delicious but real heavy and filling. One dish for two would have been enough. Half way through we felt totally full for the evening.<br><br>Soup: so creamy and heavy, with too much of one particular flavor (not cumin). one or two oz of it would have been more than enough.<br><br>No bird. No fish. Meat dish on a ceramic plate, generating noise at the touch of fork and knife.<br>If the last couple of dishes were cut in half or a quarter, they could have replaced them with one other dish, ideally bird or fish.<br><br>Seems like i am missing one other dish...do not remember.<br><br>Cheese plate. beautiful but not to write home about.<br><br>Juice or some smoothy looking thing. OK presentation but i did not die for it and in fact did not drink it all.<br><br>Last desert with pumpkin and obligatory but still fun smoke/vapor for entertainment was nice but not overly impressive.<br><br>Water service, fabulous.<br><br>Alcohol. We selected a sparkling, a white and a red from their shop next door. Nina was kind enough to email me a list. I wrote back that we leave it to them and price did not matter (as all was fair and reasonable...in particular after 3 glasses of wine i had in Alessio, Italy two months ago at 69 euro each -- i should have never left it to the chef to decide for me!!).  To my own surprise i liked the champagne. (as a humble iranian born champ, i'm not a champagne guy).  I did not die for the white one. The red was OK.  The wines were just around $100. Fair.<br><br>Chocolate gift. Gorgeous. I wish it were a dark chocolate but still nice and we appreciate it.<br><br>4 hours at the restaurant. Totally fine. I read some complaints about the slow service but i found it at right pace. Frankly i feel screwed when i spend over 500 on a meal and get kicked out after two hours (i.e. Grace was such a waste of time and money). I suggest they let people know at the time of reservation that there is only one sitting and it takes over 3 or 3.5 hours, to set the expectations. Anyways, i was all fine and thank Nina and Chris for it.<br><br>Cleanliness: perfect. Did not even observe any dust. How can the chef work so hard and look so clean cut, clean shaven, with no sign of sweat or sticky hands?<br><br>Value. comparatively fine for a restaurant in America. I think in France or Italy, and certainly in Japan you get a lot more for your money. For Chicago fine and fair.<br><br>So, why a 3 star rating with so many pluses. More of a reflection of my expectations for a restaurant at the level and ticket Goosefoot tries to be.  I have rated a few other restaurants at the same (or higher) levels same, and on future visits got to appreciate them more.<br><br>Yes, those who have nothing better to read than my reviews notice i am being terribly cautious -- because Nina and Chris are such great hosts and i do not want to appear unappreciative.", "pics": null}}, {"review": {"des": "Goosefoot provides guests with a wonderful experience that blends food with art in a warm space with personal service. <br><br>The space is small but not crowded and warmly lit, highlighted with bursts of color in the center of the dining area via flower arrangements. This was due to a particular theme which I won't spoil, but it seems that the owners/chefs put lots of thought and effort into the environment where you dine and I imagine these change and evolve over time.<br><br>The food was excellent, and for a tasting menu you'll get quite generous portions so don't worry about leaving hungry. The dishes flowed well from starters to mains and to dessert, and were all presented wonderfully. The service is incredibly attentive and the co-Chef Nina is warmly engaging with diners throughout. The place has a small 'family' feel and combining the food, ambiance, and service Goosefoot is a 5 Star dining experience for sure.", "pics": null}}, {"review": {"des": "The place is cozy, Chef Chris and his wife Nina Nugent received us to celebrate my American citizenship. The dinner was perfect and I won a customized dessert and an autographed menu.<br>Totally recommend!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZuUqILeBoFK183hWBaFGuA/348s.jpg", "caption": "Is too much love involved... Thanks Goosefoot Chicago, Chef Chris and Nina Nugent for the amazing night and dinner!"}]}}, {"review": {"des": "Eating here is a wonderful experience. Chris and Nina are wonderful hosts, and their restaurant is truly special. <br><br>The food is breathtakingly delicious. Every course is delicious, well designed from a plating perspective, and memorable! The first course was a sort of egg soufflé inside the actual eggshell, with pea sprouts. Another course was a palate cleaner inside a copper wire cage, another course was a soup and palate cleanser sitting on a \"plate\" with a glass display of moss and fairy lights under it, another was tender beef with powdered olive oil (incredible), and another was the most delicious soup I have ever had (I never knew soup could be so flavorful!), another was a crab and guacamole mix with crabapple accenting, and the dessert was an incredible berry concoction with dry ice fog around it. There were more courses than what I listed, but those were some favorites!<br><br>Dining here is a magical experience. You will not regret it.<br><br>Just FYI, it is byob, but they also have a wine selection/shop you can purchase and have ready for your meal. We chose to bring in several half bottles of wine. I really appreciated that Nina chilled our wine, even though we did not buy it from them! We also appreciated the wide spread of wine glasses!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/271zaE3SIUlG3_FPhV3wtQ/168s.jpg", "caption": "What a lovely menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PQaDzD7v7YAPDhDYDtBTaA/168s.jpg", "caption": "Amazing"}]}}, {"review": {"des": "One of the best dining experiences my wife and I have ever had. We accidentally showed up an hour early as their was some miscommunication with the time change, but the staff was very welcoming and sat us immediately.  The course flow was on point, and the prairie soup and Nina's pasta with truffles was amazing.  Did I mention there was no forking fee?  Every course exceeded expectations. The proverbial icing on the cake was birthday wishes on an autographed menu.  There are many spots to visit in Chicago, but this is a must stop.  Look forward to coming back again. Keep up the great work!", "pics": null}}, {"review": {"des": "Had the pleasure of having yet another fantastic meal at Goosefoot!<br><br>There isn't much to add about the food.  Chef Chris brings big bold flavors with every dish.  Out of the 40 some dishes had here, there has only been 1 course that I wasn't much a fan of.<br><br>Over the past few years they have changed the format some.  They now do only 16 seats a night with one seating (6:30).  The meal will take 4-5 hours.  Pacing is good, keep in mind that the first 30 minutes they are getting all the table situated with their wines (BYOB).  When they food starts it comes at a good pace.<br><br>This is one of the 3 favorite restaurants in Chicago with 42 Grams and Oriole.", "pics": null}}, {"review": {"des": "Food was outstanding and although our wait staff was great, the kitchen was incredibly slow! We were there for 4 hours for a 10 course meal. We basically ran out of things to talk about while waiting for our food in the 4 hour window.", "pics": null}}, {"review": {"des": "This place is such a gem. Chef Chris Nugent and his wife, Nina are two of the friendliest, genuine and most welcoming people I've ever met. You truly feel like a family member or friend that lucked out and gets to eat the most delicious dinner at their house. Nina herself brings out every course, gives detailed explanations, and helps with water, clearing plates, prep work, etc. Chris stopped by our table many times to explain the dishes and chat. He was so enthusiastic and excited when talking about cooking, it was so adorable!<br><br>All of the courses were packed full of flavor and fresh ingredients. Chris grows a lot of the greens in his garden himself. Sometimes I feel like \"higher-end\" restaurants try too hard to be innovative with their flavors and molecular gastronomy, but this wasn't the case here. For instance, we loved our experience at Alinea but there were very few dishes that I left dreaming about and wishing I could eat again. Goosefoot was full of memorable, delicious bites that I would definitely go back for.  My favorite dishes were the caviar/Uni/citrus, the foie gras truffle, the scallop, and the angus beef. I wasn't expecting much for presentation but the plates were all visually stunning as well. Portions were pretty generous, I left feeling stuffed and didn't finish every course(although I wanted to!).<br><br>The cherry on top is that Goosefoot is BYOB, making it an affordable experience. You can bring your own wine, or buy some at their wine shop next door. Nina emailed me 2-3 days before our dinner with their wine shop list, which had a wide variety of wines available for purchase. Most of the wines were reasonably priced under $50. We ended up selecting a 1/2 bottle of Chablis and bottle of Pinot Noir, that Nina had ready for us at the restaurant.<br><br>I think the only negative I would add is that the pacing of the meal could be improved. The entire meal took approximately 4 hours and the first course took some time to come out. The entire restaurant from prepping, cooking, service is run by Chris, Nina, and his sister, so it's definitely understandable though. I'm used to going to bed at 10 pm(yes, my friends make fun of me for being old) so eating until midnight was a major struggle for me even with all the delicious food and good company. I think this could be improved by hiring an additional staff member to clear and set plates and pour water.", "pics": null}}, {"review": {"des": "About a month ago, my partner and I went to Goosefoot to celebrate our eighth anniversary together.  I had heard good word-of-mouth about the place, quickly reviewed the web site, and decided it would be a great place to celebrate our event. I did not, however, know or expect how personalized and intimate the experience would be until we arrived. <br><br>I started by making reservations for our anniversary through their reservation system a couple months in advance of the date.  A few weeks before our reservation, Nina Nugent (Chef Chris' wife) reached out to me by e-mail to make various wine suggestions.  I promptly forgot to follow-up, but she sent me another reminder with suggested pairings a week in advance; Goosefoot is BYOB and many of the dishes scream for wine pairings.  The prices were reasonable, and in retrospect, our selections matched the course very well.<br><br>The day of our reservation, we ended up being far ahead of schedule and arrived around 6:00pm for our 6:30pm seating.  I did not know it at the time, but the restaurant only seats 14-16 people, and there is only one seating per night.  Ms. Nugent unlocked the door, and let us in early.  She immediately made my partner and I feel very much at home, despite the fact that they were clearly in the early stages of preparation for the groups that were to arrive.  She made both of us feel welcome and comfortable almost immediately. <br><br>The various courses were all wonderful. There were several appetizers, soup and seafood courses, a protein course and several desserts. In particular, the lobster with tapioca pearls with edible flowers was pretty amazing, as was the cracked egg with preserved garlic, rosemary and pea tendrils.  Throughout the evening, the preparation was top-notch and attention was given to every table. Chef Chris came out several times, and his quirky and friendly demeanor was a lot of fun.  Explanations for each course were not rushed and very informative.  Nina had picked some wonderful themes for the evening as well, the presentations were creative and the music selections were spot on.  <br> <br>Chef Chris and Nina kept repeating they tried to make the experience personal, friendly and treat the guests like family.  Because they also do all preparation, food service, and presentation, I found the dining experience to be quite unique for a higher-end pre-fixe menu.  Everything tasted wonderful, a lot of complex texturing, temperature differences, and taste contrasts made it an exciting and extremely delicious event.  <br><br>Bottom line, everything from the service, to the presentation, to the taste of the actual food itself is top notch.  I cannot recommend this place enough for a special evening. One of the best dining experiences I've had to date and I will have to go back again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2q0SViiV9gsg_KtsOhdXzw/348s.jpg", "caption": "Some shooters."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/L5TiL26UEXnZp4N6kg2gug/168s.jpg", "caption": "One of the desserts."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Odo6R8WbHSlCwNBJxsnahg/168s.jpg", "caption": "Egg with pea tendril."}]}}, {"review": {"des": "Dinner at Goosefoot was one of the most enjoyable meals we have had in a long time. The hosts are fabulous, the food presentation exquisite and the flavors and textures first rate. I think the most intense flavors were from the soups particularly the tomato soup. What I think separates this restaurant from others besides the BYOB is the personal engagement of the owners. While you must be ready to dedicate your evening to the meal when you leave you will have an intense connection to both the food and the values of the owners. This was very special .", "pics": null}}, {"review": {"des": "I have dined in many Michelin Star restaurants all over the world, and I must say this is the first review I have ever written for a restaurant where I have not dined in. Let me tell you the story. My partner and I booked Goosefoot last October 18 to celebrate a special occasion. A week before the reservation, Nina of Goosefoot called me in Toronto to apologize profusely that they had to cancel the date  because of a family emergency. Perfectly understandable. But what happened next was above and beyond what we expected. Since we could not make it to any other rescheduled date, Nina offered to help us book a reservation with Schwa, which is a restaurant reputed for its notoriously difficult dinner reservation. You would have thought the service ended with this reservation. But Nina went the extra mile and sent a bottle of champagne, a wonderful Sancerre, and a great Bordeaux to Schwa just for me and my partner. Now THAT is service beyond comparison. I don't think any restaurant in Canada, or in the USA for that matter, would have done a service  like this for clients they have not laid their eyes on.<br><br>This is a shout out to all Michelin restaurants out there: that sometimes what makes a restaurant astounding is not just it's exceptional food or laser sharp technique or singular creativity, but it is that often overlooked magic ingredient --- the ability to foster a sincere human connection. And I can truly say Goosefoot, in this regard, just hit the spot. Thank you Nina and  Chris Nugent for making our celebration special. We are grateful. We will go back to Chicago just to dine in your restaurant, and maybe this time, the gift is on us! Cheers!!", "pics": null}}, {"review": {"des": "Marvelous dining experience.  <br><br>It's BYOB.  Which is frustrating for non-locals, typically I would have our cab stop at a liquor store and then hightail it to the restaurant.  Luckily, GF has recently opened their GF wine shop right next door!  If you shop there, GF will waive the corkage fee.  Mainly full bottles, but there is a limited selection of half bottles.  We purchased two French selections for under $100 including tip and tax.  <br><br>The dining room is warm and humble.  Same goes for the staff, all extremely friendly and makes any diner feel at ease.  If you're celebrating something special, the chef writes a well stated long message on your menu, the server will ask you for the correct spelling of your name.  How personalized and sweet.  <br><br>Menus are printed on planting seed paper.  Very interesting and unique.  <br><br>Food has touches of gastronomy, but not overly so.  Food was savory, satiating, balanced and seasoned perfectly.  The progression of the meal was very clear.  The standouts were: truffled potato soup, scallop, tuna, venison, angus beef and roquefort.  There is really no need to go through all the details, as no course would leave a diner disappointed.  I was so impressed at the quality of the meal and the well thought out details. <br><br>If I lived in Chicago, this would be on my regular rotation, it is great approachable food, but not something anyone can make at home.  Make the effort and venture out to one of the finest tasting meals in town!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jIYJNs10iPgn5P_shhUA3Q/348s.jpg", "caption": "'Brazil'"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/589oipe7f7E8eSkYvBW-3g/168s.jpg", "caption": "Roquefort, quince, goji berry, hazelnut, mulled wine"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4Fku-K1LM8vaUAcCi9QvjQ/168s.jpg", "caption": "Angus beef, pine, Szechuan peppercorn"}]}}, {"review": {"des": "If I had more stars to give, I would! This is a dining experience you must do. It's a husband and wife team that will melt your heart. Beautiful restaurant with amazing food. Chris makes each dish tasty but also so artistic. His wife is your server and explains each dish and even pairs it to music. I have a food allergy and they made it so easy (most tasting menu restaurants do not accommodate so easily). Grab your reservation now. So amazing. You even leave with a gift. Thank you for a great night. We will be back for sure! You're love of food and entertaining is so obvious. Thanks for sharing your passion!", "pics": null}}, {"review": {"des": "I was very excited to go to Goosefoot given the high quality of food as well as BYO aspect.  For those that have been there a while back, they have redone their space and it is more intimate now.  They only seat two groups of ten per night.  The decor is warm and inviting, although the ceiling is a bit strange.  Nina greeted us at the door and knew who we were.  She immediately took our wine in back to be opened and chilled.  We brought one bottle of sparkling to which she said 'I assume you want to begin and then with dessert as well?'  It's like she was reading our minds.  We also brought a half of white and red, which was the perfect amount for the 3 hour dinner.  She even came out mid way through and rechilled our wine.  Chef came out several times to chat with us.  Both of them are either extremely good actors or really genuine people.  I enjoyed talking with them quite a bit throughout the meal.  The only time that wasn't spectacular was when the second seating started to arrive.  They were pretty swamped trying to finish the first seating and start the second seating.  It's almost like they need staff to assist but I don't think that is part of their plan.  The menu was amazing.  <br><br>The first dish with the foie and caviar was a very fresh bite and a good way to start the meal.  The foie was somewhat heavy but the bite size was perfect.  I won't go into every single dish but I will say the scallop was one of my favorites.  It was a perfectly done scallop with this lobster bisque in the bottom of the bowl that I could eat everyday.  All of the garnishes are from their garden and purposely chosen.  The plating was superb but my favorite plate was the beef.  The cheese course was also amazing plating.  My favorite dish of the night was the rabbit and egg and potato dish.  I didn't think I would like it since I'm not a huge fan of rabbit but this was so amazing.  My husband's favorite was the gnocchi.  The way the menu is written, it's not easy to distinguish how much of each element will be present on the plate, which is kind of fun.  The pasta dish looks like a soup but it's a rich, silky plate of awesome.  The corn soup was also a winner if you pair it with some bubbles.  The acidity of the wine with the sweetness of the corn and earthiness of the truffle make for the perfect pairing and an amazing bite.  The food was extremely good and well-balanced and presented beautifully.  I will definitely be back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oEE0eK32LjndKTMu0-H_9g/348s.jpg", "caption": "chocolate"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iIwkntcRURO7K05UaqWgtw/168s.jpg", "caption": "coffee"}]}}, {"review": {"des": "I have dreams about Goosefoot. It's at the very top of our price range, but it's so worth it. It nice that it's BYOB, that's the only way we could ever make it work, but when every thing lines up in life, we go to Goosefoot. It's such a terrific experience. The food is so great, the atmosphere is warm and welcoming. Dreams are made at Goosefoot. I cannot wait to go back.", "pics": null}}, {"review": {"des": "It was a culinary experience of perfection with respect to presentation, it was relatively good regarding taste, but the the fact that it was a 4hr meal and was not communicated as such in advance left me feeling trapped. Service as very nice. Lighting was so so and ambiance so so as well. I'd gladly pay twice as much to eat at Grace, and would likely not come back here.", "pics": null}}, {"review": {"des": "I can't say enough positive things about our experience at Goosefoot. Nina and Chris are both so charming and the whole experience is a delight, not to mention the incredible food and pastries. 5 stars...10 stars if we could!", "pics": null}}, {"review": {"des": "Very beautifully prepared dishes and for 9 plates at their price, it is a steal. <br><br>Memorable:  all the gelees topped with flowers, especially the mini orchid, egg custard topped with shrimp bisque, tender angus steak, macaroon topped with Roquefort cream<br><br>It's more a personal preference but I would have preferred my venison and scallop rarer.  <br><br>Wine selection next door was great and the lady at the shop was very helpful in giving us the perfect choices.  Hostess, wife of chef was so hospitable.", "pics": null}}, {"review": {"des": "Hands down... Goosefoot is the by far the best dining experience I have ever had... I cannot say enough good things but I will give it a shot.<br><br>To be honest, I was a bit apprehensive given the number of courses.  Beyond suffering from EOG (Early Onset Grumpiness) I also have a terrible case of \"Antzinpants\" Syndrome.  This combination can be challenging when you are considering a 12 course meal that runs over 3 hours.  However, I really blew her birthday last year so I made the reservation knowing I would have to put all my issues to the side for the evening.  I am so glad I did...<br><br>First off, the place is small but does not feel small.  When we walked in, we were greeted by the Chef Chris Nugent who, as it turns out, is one of the nicest people you will ever meet.  We were immediately seated and were handed the 12-course menu which, now this is pretty cool, contains seeds and can be planted.  Soon after, Chris's wife, Nina came around to greet us.  She too is another of the nicest people you will ever meet. <br><br>I do not have time to go through the entire menu but I can say each item was amazing.  My favorites were the scallop/nasturtium/lobster/lemongrass and the potato gnocchi/perigord truffle/sorrel.  The chestnut soup/alba mushroom/truffle essence was perhaps the most wonderful thing I have ever tasted!<br><br>Now, our meal lasted 3+ hours but to be completely honest it did not feel like it.  The flow was perfect and Chris and/or Nina went into an amazing level of detail concerning each course...  In the end, although the per person cost was perhaps the most we have paid for a meal, I do hope to go back as soon as I can. <br><br>Tips:<br>Despite the cost, the dress is somewhat casual.  I was happy I skipped the tie and went with the jeans and sport coat.  I suggest dressing for comfort.<br><br>It's BYOB but they do have a wine shop next door.  Just make sure you check out BYOB etiquette before you go. <br><br>When you second guess yourself concerning the cost/time just stop.  It is worth both.  <br><br>We did not feel comfortable taking may photos...  If you do leave the flash and fake \"click\" off and you should do just fine.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/u_T6jFgxkDyXVwc9nQ3pPg/348s.jpg", "caption": "Menu with a nice note to the birthday girl..."}]}}, {"review": {"des": "I really enjoyed my meal here and was most appreciative of their ability to accommodate a gluten allergy.<br><br>As with any restaurant of its caliber, reservations are a requirement and require a pretty significant amount of advance planning with the use of Open Table. <br><br>As for the meal, it was very good and we were allowed to take our time without feeling rushed on a Saturday night. Given the growing list of Michelin rated restaurants and the pricing, it is unlikely I would plan a return visit anytime soon, but I definitely enjoyed it and agree it deserves its proper accolades and rank among top eateries of its type.", "pics": null}}, {"review": {"des": "I've lived in Chicago for 15 years and this was the best dining experience I have ever had in the city. Owners Chris and Nina Nugent are a great team with him making the fabulous food (other than one superb dish that Nina makes) and her entertaining the guests and running the food. The plates from the first to the tenth(!) were all memorable and gave the tastebuds something new to experience with each bite. Never have four hours seemed to fly by so quickly, but when you're in food nirvana you don't want the time to end. This amazing restaurant is well worth the investment, both in time and cost. Do yourself a favor and add this Lincoln Square hidden gem to your list of \"must visit\" restaurants. You won't be disappointed.", "pics": null}}, {"review": {"des": "Absolutely amazing experience! Chef Chris & Nina were such gracious hosts and their attention to detail is second to none. They were so kind! And of course, the dishes were all out of this world!", "pics": null}}, {"review": {"des": "My husband and I used to live in Philly and since moving to Chicago we miss having BYOB places surrounded by us on every block! Goosefoot was an amazing dining experience. The food was spectacular and the service was perfect. Meeting the owner and chef at the end of the night made the experience even more enjoyable!", "pics": null}}, {"review": {"des": "Goosefoot is AMAZING!  We did a girls dinner there last night and it lived up to every expectation we had, actually exceeded them.  The BYOB policy is the best & and if you buy wine from them (Less than $30), they completely waive the corkage fee.<br><br>The owner, Nina, is SO personable and walks around to every table and engages great conversation.<br><br>The current menu is unreal, lots of seafood and tons of flavor.  I am literally dreaming of the truffle gnocchi right now.  Will be back for sure!!!  Thanks for an amazing experience :)", "pics": null}}, {"review": {"des": "Absolutely incredible, unquestionably 5-star quality food and service, and candidate for best meal of my life.  There is incredible care taken in the preparation of the food, the presentation, and intimacy of the room.  <br><br>Romantic - yes!  This place is proposal-worthy.<br><br>BYOB - what an amazing idea.  Why isn't this everywhere?  What better to complement amazing food than a wine of your own choosing, and here that is not only possible, but greatly encouraged with FREE corkage!  I brought a Kosta Browne Pinot Noir and an icewine for dessert, and both paired amazingly.  Chicago is cutting-edge when it comes to BYOB, and it's a trend I hope to see replicated elsewhere, because I have a lot of wines that are occasion-worthy that I'd like to break out for a meal like this.<br><br>Nina was the nicest hostess imaginable.  I was concerned about making it to a convention event at 9:30, and she reassured me that despite what you may read in some reviews here, a 3-hour tour is completely normal (and indeed I was in and out in very close to 3 hours).  If pacing or other commitments are an issue for you, by all means mention it and it should not be a problem.  <br><br>As noted by others, a description of the food itself may not be helpful because it changes so frequently, but I'll post my menu and some short notes.<br><br>AMUSE: the truffle beignet on a bed of wheat grass was \"an amazeball\".  A great start to an amazing adventure in dining.<br><br>SCALLOP: just perfect in texture and presentation.  Perhaps the best I've ever had.<br><br>CORN SOUP: I had a corn soup once in Zurich that was so good it completely redefined my expectations of what a soup could be.  Goosefoot confirmed that.  Crazy good, with an amazing sunflower foam.<br><br>SALMON: a beautiful and perfectly-prepared piece of one of my fave fishes.<br><br>DUCK: see the picture for the 1000 words - just a perfect cut of deliciousness.<br><br>BEEF: the tenderloin was, again, one of the best examples of beef I've eaten.<br><br>CHEESE: the creme provincial was so good I inquired about it.  It's a triple-creme cow-milk cheese rolled in herbs de Provence.  Drool.  The candied artichoke stuck to my teeth and I gave it up early, but it was about the only thing I didn't completely devour all night.<br><br>PEAR: so perfect - light, flavorful.  Even on a full stomach by this point, it was amazing.<br><br>PINEAPPLE: served as a parfait with coconut foam, another fantastic dessert.<br><br>Very hard to get a reservation at, but completely worth it, and less than half the price of Alinea (not including the bonus free corkage).  If you are planning a trip to Chicago, book it before you buy your airline ticket (it's that good).", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lCDxz4kvgTsweztCw0OfFg/348s.jpg", "caption": "To end: hot chocolate."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TynZNQe0gvnjIPlkBWO7sA/168s.jpg", "caption": "10/15 pineapple dessert (2 of 2)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/E-uFrAyKfcP4LlE2fiH0uw/168s.jpg", "caption": "10/14: beautiful pear (dessert #1)"}]}}, {"review": {"des": "Best value and amazing intimacy at a five star level. You feel like you're dining in Chris and Nina's house - they serve all the dishes themselves. The food not only looks great but tastes amazing too. Nina says Chris likes to fill people up and that's true - you'll leave very satiated. I've been to Alinea and Tru and in my opinion this surpasses both. BYOB makes it a little more affordable and they can recommend what to bring to suit the menu.", "pics": null}}, {"review": {"des": "Ate at Goosefoot celebrating 3 birthdays last night and had one of the best meals ever!  We've travelled extensively and always look for unique and high quality dining experiences and certainly found one at Goosefoot. The fixed price 13 course dinner was excellent, deserving of its Michelin rating. Every course was delicious. Be prepared for a full evening experience as you dine at a leisurely pace with the dinner lasting 4.5 hours. Would definitely come back next time we are in Chicago.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SMPmRUTjWNBmuHAJH4Dvmw/348s.jpg", "caption": "Beautiful presentation of dessert before dry ice (in the white porcelain) was activated."}]}}, {"review": {"des": "Spent our anniversary @ Goosefoot and had an amazing time!  At the risk of sounding entitled, but to provide context, Goosefoot is right up there with the dining experiences I have been fortunate enough to be a part of at NEXT, iNG, Moto, etc.  Chris and Nina are world class individuals when it comes to hospitality and culinary artistry. Don't even get me started about the soups...simply amazing. Be prepared for a slow paced 4ish hour meal. Sometimes it felt a little long (as noted by some others) but not a huge drawback. Well worth the $$$ for a dining experience that you will receive @ Goosefoot. Chris and Nina, keep up the great work!!", "pics": null}}, {"review": {"des": "The food was AMAZING!! Reasonably priced, however dinner lasted FIVE hours!!! Tooo longgg!! We got there at 6 pm and left at midnight <br>We won't go back. It's just to long to sit and eat.", "pics": null}}, {"review": {"des": "Like many have said the meal takes over three hours. There was too much cream and soup/sauce dishes throughout...I kept on wishing for something more toothy or crispy. The flavors were really very good in general but lacked contrast. I was a little disappointed that he used flavored gelees in more than one dish. <br><br>I've had better Michelin meals in this price range. Somehow I feel there is a lack of creativity and inspiration- judging from yelp pictures it looks to me there isn't much change to the menu from years past.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kLRASfXf9K_RXZ33uoeIPA/168s.jpg", "caption": "Truffle gnocchi"}]}}, {"review": {"des": "Pros:  Stupendous food with lovingly sourced ingredients that are expertly prepared and creatively combined and presented.  Super enthusiastic Chef who presents each dish to each table explaining his masterpieces.  He and his personable wife run the whole show.  And it is a show.<br><br>Cons:  4 hour meal.", "pics": null}}, {"review": {"des": "Went for the first time this past weekend. Food was fantastic- literally everything we ate was wonderful. Probably a better meal than Alinea and Moto and Next, if you can believe it. Here the focus is on flavor, #1, and then presentation. That's what I prefer! If it doesn't taste great, who cares how it looks? But everything here was plated beautifully. Interesting gelees and flowers. <br><br>Service was mostly good- when we walked in, there was nobody up front and we stood around for a few minutes, unsure of what to do. That was a little weird. Also during the meal I requested a drink which never came. 45 minutes later I asked someone else for it and it came (but I did get an apology from the first server who forgot).<br><br>My one complaint, truly, is that it takes FOREVER. I was there 3.5 hours. I do not understand the need for such a long wait in between courses. Honestly. You're literally just sitting there and waiting for more food. 3.5 hours! I was falling asleep by the last few courses.<br>I loved the food, and I'd want to go back, but another all-evening-long meal just doesn't seem that appealing.", "pics": null}}, {"review": {"des": "Goosefoot is an event so if you are going there, plan for that. You will be there for a few hours and you shouldn't plan anything for afterward. <br><br>I love everything about this place. Nina (chef's wife) greets you and sets a tone for the experience. She is a warm person and instantly makes you feel welcome. <br><br>Unlike many fine dining places, it's BYO which allows you to make your own wine list. The chef takes normal things and makes them extraordinary. The chestnut soup is possibly the best thing that I have ever eaten. In addition, the dining room is beautiful and they space the table seatings so the service is always perfect.", "pics": null}}, {"review": {"des": "I loved this restaurant and I had a wonderful experience. I am not an overly adventurous diner so it was fun for me to try the unique dishes. The presentation of the dishes was beautiful. The staff was warm and made us feel welcome, especially the owner (Neena?).  I enjoyed the pace of the meal. To me, it was relaxing and a breath of fresh air compared to many loud, rushed feeling restaurants. <br><br>This was one of the top five dinners of my life. Kudos  to the owners and the staff for a great experience. Very classy and top notch in all respects.", "pics": null}}, {"review": {"des": "Heard too many good words of Goosefoot and it totally worths. We visited the store 1 week after we officially moved to Chicago. <br>For the food, we do enjoyed the dinner and everything above our expectation. Chef Chris do know the best combination for everything to generate the most tasty food! Each of the dish has quite creative plating too! Meanwhile, Chef Chris told us they grow all the plants themselves in the next room. <br>For the service, The chef Chris and his wife Nina are the most friendliest people. They answered every questions we have, and used chocolate wrote \"Welcome to Chicago\" with the last dessert dish. We had a tour to the kitchen and chef Chris even sent us to the door himself afterwards. <br>We will definitely come to visit again.", "pics": null}}, {"review": {"des": "My apologies to creative, artistic , and talented  Chef Chris Nugent and amazing Nina Nugent for such a delayed review.<br>I never write a review right away. I like to give it some time , to see if I want to come back, it I remember the flavors.<br>Most of my reviews are to compliment and support the places I enjoyed.<br>Anyway, better later than never.<br><br>It is been a while since our outstanding unforgettable dinner at Goosefoot.<br><br>Going back to variety of dinners, lunches, breakfasts in many countries on different continents, that dinner is still melting in my mouth. We've been there in late fall and had the joy to hit Chanterelle season .<br>I know menus are seasonal , and my review goes way back in time , but I still remember that dinner.<br><br>I just need to go back, hopefully it is as flawless as I remember .", "pics": null}}, {"review": {"des": "Goosefoot is pretty darn good. This Midwest girl loves a good menu with great choices. They also have excellent service which is important for me too, so why the 4 stars? The long wait after we made a reservation :(  <br><br>Highlights: The caviar, potato gnocchi, and tuna won me over right away. I am a big seafood fan and try to order it always. They were also nice about accommodating to my dates gluten sensitivity. We didn't feel rushed and service was unobtrusive.<br><br>Very good all around but work on the wait! Thank you I'll be back :)", "pics": null}}, {"review": {"des": "I usually only yelp when I have a bad experience, this is the opposite that. It was such a great experience! Everything was so beautifully plated and the food was deliciously prepared. The service was also top notch. Goosefoot was recommended to me by a coworker and they delivered. It is somewhat difficult to find this place, but there is plenty parking. It was astonishing to find a place like this in that area; nothing else in the area even compares.", "pics": null}}, {"review": {"des": "Goosefoot is a special experience. Incredible attention to detail. Dishes were whimsical in their presentation. Unlike our experiences at some other high-end restaurants in Chicago, the servers are warm and welcoming. The first 3 courses were our favorite - the scallop, egg, and chestnut soup - in part because they were so creative. <br><br>Their food and wine store  has a good selection of wine in a wide range of prices, starting at about $14.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/POs6rC4A6v4k0uEF0pUH1g/348s.jpg", "caption": "First course: Scallop"}]}}, {"review": {"des": "Chef Chris Nugent is a visionary, and he and his lovely wife Nina create an unforgettable experience for their guests. From start to finish, each dish explodes with flavor and creativity. The food, presentation, and service at goosefoot are all exceptional, and we will definitely be back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3Af7kMG2vJORJTPFoTZtPw/348s.jpg", "caption": "Goosefoot, December 2016"}]}}, {"review": {"des": "Well, I'm not sure a review of Goosefoot can even do it justice.  This is one restaurant that definitely does not disappoint and it lives up to it's justified high marks.<br><br>I finally scored a reservation on a Thursday evening about two months in advance.  I am sure it was a random cancellation as I have been attempting to dine here for about two years!  However, I wasn't complaining and I was going to do whatever it took to have my dinner!<br><br>First of all, they call about a week and a half in advance to confirm.  I suspect this is a smart thing considering they want to keep the restaurant full and allow others to make reservations if people are canceling...However, I don't know who would possibly cancel a reservation here...unless they were immobile.<br><br>Anyway, I of course confirmed and asked about my byo options and was directed to their website.  I checked out the website and just gawked at all of the delicious looking food for a few minutes before I found the right page...and while helpful, the suggestions definitely allow for you to bring whatever you like to go with your meal.<br><br>I stopped in to Lush Roscoe Village and asked the person working if they had dined at Goosefoot before...and yes, he had!  So, we talked through some options.  I typically like Sauvignon Blanc, but admit it doesn't always pair well with food, so, I wanted something food friendly.  I selected a Portugese sparkling (total winner, dry and nicely yeasty) and a french Loire Valley wine (perfect for food pairing - sort of a cross between a Chardonnay and Riesling...hard to describe, but wonderful!).  My red was something I had been storing for a while - it was a CA merlot - which also turned out to be a great pairing.<br><br>So, we arrived at the restaurant and we were warmly greeted by the chef's wife.  She seated us and asked if it was a special occasion (it wasn't but it would be a great spot for one!).  Our wines were whisked away and chilled and glasses brought for the sparkling.<br><br>I'm not going to go into every menu item as I know the menu changes relatively frequently.  However, I will say that everything was absolutely divine and beautifully presented.  Fresh was an understatement - it was like the vegetables and greens were taken from the garden 5 seconds before serving.  Fish and meats were perfectly cooked and seasoned.  I have to also say that the edible flowers were so lovely!  They made each dish look like a present and while I would say they were too pretty to eat, I definitely got over that issue quickly!  <br><br>The only item that I think wasn't over the top amazing was the steak.  I was still wonderful, but just not as inventive as the rest of the dishes.<br><br>All in all, I was thrilled with dinner and was so glad to have finally dined here.  I was also glad that we weren't looked at oddly when we didn't finish all of our wines and took the remainder home.  Service was perfect and not overly formal.  While the space was beautiful, it was also very homey and relaxing - not stressful as some fine dining spots are.  It was also very bright - perfect to see the food!<br><br>Expensive, but I thought not extravagently so.  Obviously this isn't a spot that most people would dine at regularly, but for a once in while thing or a special occasion, it was perfect.  The plantable menus - also a really nice touch!", "pics": null}}, {"review": {"des": "Truly wonderful dinner and experience. Chris and Nina made us feel right at home. Beautifully prepared food; so much soul and care into the dishes. Thank you for such a wonderful dinner! We will be back!", "pics": null}}, {"review": {"des": "Outstanding fine dining with outstanding hosts! Nina and Chris are the owners, and they make you feel at home all the while serving beautifully plated, imaginative dishes. Each course is presented as art with unique, handcrafted dishes and plates. This is truly a destination for a special celebration dinner. When I called about our reservation, Nina knew when we had been there last, and that we had celebrated our anniversary. She made us feel like \"regulars\" even though we'd only been twice!", "pics": null}}, {"review": {"des": "It was my 2nd time returning to Goosefoot Chicago, and I cannot stress how necessary it is to splurge on yourself once in a while ! Chef Chris' creations were divine and flavorful ! Owners Nina and Chris both create a memorable and personable experience for each guest! No wonder they've had a Michelin Star 4 years in a row! If you haven't been, you MUST go! Definitely fine dining at its best! Would give 100 stars if I could!", "pics": null}}, {"review": {"des": "Beautifully presented - Delicious Flavors- Fantastic Service- Wonderful Atmosphere.<br>The reason I am not rating 5 star is:<br>~I think each course was kinda heavy (aka lots of cream & butter)<br>~The Corkage Fee Is way too much-$10 a person! For this upscale of a restaurant and price point. $135/pp (especially considering staff can't even serve the wine, because of the byob law.) I understand there should be a cost for glasses and recycling bottles, but per person- come-on. <br>~The coffee and tea offered should be included (or at least told it is not included in price. )<br>we just assumed, so i guess we should have asked. <br>Still, Overall a lovely experience, not sure I will be rushing back, but maybe for a very special occasion.", "pics": null}}, {"review": {"des": "If you're reading this and thinking of going to Goosefoot, just make the reservation and do no more research. Stop the review-reading and photo-browsing now. It's wonderful and I'm so glad I went in last night utterly unprepared--let yourself be surprised!", "pics": null}}, {"review": {"des": "A TRULY unique experience - our party of six spent a solid 5 hours (a bit on the long side for me and I took off one star because nobody warned me of the time needed).<br>The 9 course menu had two or three surprise additions so we had 11 - 12 courses in all. For the birthday girl in our party they even put a candle in one of the dessert courses. Nice touch. This \"meal\" was much more of an event, it's not just a dinner in a restaurant. And I would even say that calling it a restaurant is not a good description - you are going to ingest a big edible show.<br><br>Overall, it was a bit like climbing a mountain - I'm glad that I can say I did it, but I can't imagine doing it twice.... but never say never ;)", "pics": null}}, {"review": {"des": "Dinner here was phenomenal! We truly enjoyed ourselves, and found each course to be more delicious than the last. Nina and Chris are exceptional hosts (and chefs!) and we were so impressed by how they remembered our names throughout the evening. They also did a wonderful job explaining each course; we loved hearing about their passion for gardening and about how their garden was used in each course. We cannot wait to plant our pea shoots - Nina and Chris, thank you again for a wonderful evening!", "pics": null}}, {"review": {"des": "Really great experience.   Food is delicious.   Atmosphere is great, service / prices are what you would expect at a restaurant in this category.   Need to make reservations well in advance, but definitely worth it. BYO which has its pluses and minuses at a place like this.", "pics": null}}, {"review": {"des": "Overall, it was great. We actually went there a few months back, but I was too busy to write this review. The flavor was subtle. For me, it was lacking the punch line and some complexity. One of our waitress was new (probably not so new now), but she tried hard. The host and the chef wrote us a little note since we told them that we came for our anniversary.<br>(to be continued...)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/W30ItZ1ZbtOX-2GTnwxB2Q/348s.jpg", "caption": "begonia/preserved garlic/shrimp"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fYc1sqKR7WRcIvxiKlfy6A/168s.jpg", "caption": "amuse bouche: truffle cream puff"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/urpTbk37VtiVrvZR604BCg/168s.jpg", "caption": "pineapple/sorrel/coconut/passion fruit"}]}}, {"review": {"des": "Fantastic and creative food, amazing service, etc. EVERYTHING you'd want in a restaurant for a special occasion. <br><br>We stopped by the bottle shop downstairs and were recommended a lovely rose which went very well with the meal.<br><br>Hands-down a must-try if you're in Chicago :)", "pics": null}}, {"review": {"des": "I have waited a long time to dine here and was very put off by the process of getting in. Now, I understand. This is such a intimate dining experience, and worth waiting for. We were greeted by the chef's wife upon arrival and the wait staff.<br>It was a four hour journey, that appealed to all senses. In total, we had eleven courses and enjoyed almost all of them. Each server explained the food  and we chatted about the previous course. It was like a personal chef was cooking for you.<br>At the end of the meal, the owner came by to thank us for coming and offered to call us a cab. I will never forget my night at Goosefoot.", "pics": null}}, {"review": {"des": "Absolutely unbelievable. The most exquisite and intimidate fine dining experience that you will not leave hungry nor forget for years to come!! You will leave feeling like a king and/or queen - highly highly recommend this experience.", "pics": null}}, {"review": {"des": "Dishes experienced<br>Beet/Cucumber Mignonette/Goat Cheese<br><br>Lobster/Scallop/Licorice Root/Curry (Butter Poached, Parmesan, Sugar Snap Pea, Carrot Puree, Marigold Petals, House Grown Microgreens)<br><br>Shrimp/Preserved Garlic/Rosemary (Garlic Parmesan Custard, Shrimp/Rosemary/Tomato Ragu, Parsnip Crisp)<br><br>Chestnut Soup/Alba Mushroom/Potato/Truffle Essence (Truffle Froth, Spring Vegetables, Smoked Mushrooms, Celery Root Puree, Parmesan Gouger)<br><br>Loup de Mer/Leek/Yuzu/Tapioca (Sunchoke Puree, Sea Bean Salad, Confit Leek/Yuzu/Tapioca Emulsion, Fennel Puree, Fennel Bulb)<br><br>Duck Breast/Spiced Beluga Lentils/Ginger/Compressed Apple (Apple Frisee Salad, Juniper oil, Parsnip Puree, Whole Grain Mustard Seed Oil, Soy/Rosemary Duck, Ginger/Apple Gelee, Marigold Petals)<br><br>Angus Beef/Heirloom Carrots/Goosefoot/Cumin/Shallot Jus (Cumin Carrot Mousse, Mosaic Heirloom Carrots - Carrot Gelee stuffed with carrot mousse, Spinach and Wild Mushrooms, Powdered Truffle Oil, Bordeaux/Shallot/Vermouth sauce)<br><br>Roquefort/Goji Berry/Hazelnut/Pear/Port (Diced Red Pear Compote, Chinese Five Spice Port Wine Reduction, Matcha Leaf, Chopped Hazelnut, Goji Berry Sugar Glaze Candy)<br><br>Beet/Pomegranate/Yuzu Tonic with Citrus Olive Oil<br><br>Blood Orange/Cassia/Kaffir Lime/Citrus (Cylinder, Vanilla Cremeaux, Cinnamon Crisp, Lime Gel Trail, Citrus Espuma with Crystalized Ginger, Apricot Sauce)<br><br>Chocolate/Passion Fruit/Coconut/Ice Wine (Orange Blossom Chocolate Mousse, Coconut Foam with cocoa nibs, praline powder, Rootbeer Coconut Gelee, <br>Passionfruit Truffle, ice wine reduction)<br><br>Gooseberry/Chocolate/Nougat<br><br>My first and only encounter with Chris Nugent prior to the evening of March 23rd, 2013 was on his last day of service at Les Nomades - the first of what turned out to be two tasting menus that evening - and although the stuffy service was not my cup of tea, Nugent's food was superlative; more than enough to assure my patronage at his new restaurant, Goosefoot, the next time I visited Chicago...assuming I could get a reservation.  Small in space and somewhat obscure in policy I was fortunate to have assistance in securing a two-top on short notice for a Saturday evening and arriving even before the restaurant opened my friend and I were seated promptly at 5:30, he with a bottle in toe given the restaurant's BYOB policy, and within moments were greeted by the Chef's wife and our server, Molly, who would guide us through the night's nine course menu<br><br>Small, narrow, and minimally adorned with walls light, tables black, and chairs sleek wood opposite gold banquets much of the experience at Goosefoot harkens fine dining with a touch of whimsy, a sensibility matching the food on the table, while severs are polite, personal, and professional with light background music at times noticeable and at others entirely forgettable completing the picture; a nice room, if not particularly memorable<br><br>With a crowd ranging from the mid-twenties to a quartet of septuagenarians I was intrigued to see that much of the cuisine emerging from Nugent's kitchen was at once beautiful and technique driven and yet at the same time quite 'safe' - the theme of every plate a deft degree of balance and none more apparent than the first and the third; both present since the restaurant's December 2011 debut and both rich, aromatic, and very carefully spiced - the curry acting to highlight the lobster's natural sweetness and the soup a chestnut tinged mushroom veloute punctuated with notes of truffle, vegetable, and briny little gougeres<br><br>Moving from lighter dishes to heavier proteins by way of a flaky and delicate piece of loup de mer paired with a rich and bright citrus sauce balanced by aromatic leeks and fennel the most impressive course of the evening for myself would be the duck; a flawless piece of rosy red breast with crisp skin and melting fat lightly spiced with ginger and juniper allowing the bird's characteristic flavor to show not only in the flesh, but as a basenote to the lentils beneath<br><br>Transitioning from savory to sweet through a cheese course that took Roquefort in directions I'd have never guessed - by far the most aggressively flavored dish of the evening - followed by an aromatic beet elixir I personally found the citrus dessert far more interesting than the chocolate, a rarity for me, largely because as interesting as it may have read, the chocolate largely tasted like a dense ganache with too much sweetness, the rest of the ingredients getting lost in a flood of passionfruit and cocoa<br><br>Exiting the restaurant and receiving a signed copy of the menu, plus one to plant - yes, the menu is organic with embedded perennial seeds-it should go without saying that at $115/pp with a BYOB policy Goosefoot presents a truly affordable fine dining experience and although perhaps not as unique or interesting as Alinea, Grace, Schwa, or EL Ideas it is every bit as \"chef driven\" as the others and without a doubt a space that should be on everyone's culinary map, local or visitor alike", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WRTEe6jGZ7sQZTzjyrR9FA/348s.jpg", "caption": "Loup de Mer/Leek/Yuzu/Tapioca"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/snwo4RasQMecIB2CLlBG2w/168s.jpg", "caption": "Loup de Mer/Leek/Yuzu/Tapioca"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iTlNUhQ-FsG18_WPso55bQ/168s.jpg", "caption": "Chestnut Soup/Alba Mushroom/Potato/Truffle Essence"}]}}, {"review": {"des": "goosefoot food & wine for your next byob adventure, gift basket, or to stock your pantry. Artisan chocolates...mmmmm<br><br>Phil Vettel wrote a nice piece in the Chicago Tribune. Yelpers comments who posted before me, I agree with the five stars.<br><br>Macaroons were devoured on the way home. No time  to pair with Nina's Blend, coffee crafted by Sparrow Coffee Roastery.<br><br>I was spoiled by Chicago Coffee Con 2014. So I wasn't sure what to expect with the roast. Roasted in April 2015. The package was well sealed. Finally opened in October! I'm not a coffee connoisseur but sure enjoyed the dark aroma. No precise measurements. This blend worked in my French press. Tried it black. Used typical Chicago tap filtered and boiled in an electric kettle. Used blade grinder, medium coarse blend. Minimal bloom. Nina's Blend is Superior to the coffee chains, fast food places, hotel rooms, Keurig made or any other mass produced coffee found in supermarkets. Yes, fine dining restaurant quality. Sparrow knows coffee. Nina, too! Smooth. Satisfying. Also tried a cup with a touch of Oberweis heavy whipping cream no sweetener, it was a delight to my senses. Must restrain from drinking more. So away the rest of the whole beans go in an air tight can for the next personal home brew.<br><br>Btw, if my memory serves me right, gf&w will grind your coffee.<br><br>The kids enjoyed the French brie during snack time. \"Mom, is there anymore 'goosefoot cheese?' Can you buy more? It has to be goosefoot.\" <br><br>Pleasant staff.<br><br>Street and rear building parking available. Sorry, no public washroom.<br><br>Will head back and hope to take home some of Chef's signature soups and then some.", "pics": null}}, {"review": {"des": "Wonderful experience, definitely lives up to the buzz generated from foodie fans.  Nina was just delightful and made us feel at home while Chris created delicious flavors,  a truly divine meal. <br> Definitely will go back.", "pics": null}}, {"review": {"des": "It's so hard to put into words how deeply moving my food experience at Goosefoot was. The chef and his wife encourage you to feel as though you have come to their home for a meal, and they bring amazing flavors in every course--BAR NONE-- with the added gift of a loving delivery. They go to great lengths to dazzle, but they never stray from a point of departure deeply rooted in sublime flavors. I left feeling like that had reached my soul with their food and their gastronomic/artistic intentions. It's almost indefinable, a kind of food and emotion alchemy. I have reached a passionate level of love for this place. It's very special. I suggest approaching it with reverence and humility.", "pics": null}}, {"review": {"des": "Perhaps the best food experience of my life. <br><br>Was it long? Yes - but I expected that.<br>Was every dish phenomenal? No (tho all were far above average)<br>Best dish for me? The beef blew my mind. Blew. My. Mind. <br><br>The service was just right. Attentive and genuine.<br><br>Oh, and since I couldn't find it in other reviews, the dress code is dressy jeans.", "pics": null}}, {"review": {"des": "i would give 10 stars if i could，very nice food，amazing presentation，excellent service，and the best：bring your own wine！", "pics": null}}, {"review": {"des": "My husband and I ate at Goosefoot Friday night, and it was as amazing as last time. We stopped into their store to buy wine, and settled on Nina's recommendations of a South African pinot noir and a dry French pinot grigio which was delicious with all of the seafood dishes. The total for both bottles was only $54. Both were outstanding! The meal was really unique, as it was the chef's table format. It felt really casual and elegant, like eating dinner in their home. Chris and Nina were the hosts, the chefs, and the servers. They were really proud and excited about the dinner, and made us feel like special guests. Four hours seemed to just fly right by, and we were in food heaven by the time it was over. Chef Chris hugged us hello and then hugged us goodbye. I can't wait to go back, it's just such an amazing experience over all. I want to take all of my friends there!!", "pics": null}}, {"review": {"des": "Easily a five star experience! My husband and I ate at Goosefoot last night and we highly recommended it. Chris and Nina run the whole show from greeting you at the front door to bringing out the courses. As Nina said, they consider us guests in their home. Each course is beautifully prepared and comes with an explanation from Nina or Chris. The food was phenomenal! At 13 courses, you won't go home hungry! The restaurant is limited to 16 seats, so you never feel like you are \"one of the masses.\" They were so sweet to us! Definitely make a reservation.", "pics": null}}, {"review": {"des": "Goosefoot, you have amazed me by exceeding every expectation in terms of food, service, and atmosphere.<br><br>We arrived promptly for our 5:30 reservation with a bottle of red and white wine in tow to partake in their BYOB policy. Since we were the first to arrive, the hostess let us pick which table we wanted. Upon being seated the hostess revealed herself as the Chef's wife and told us that the menu outlined nine courses but there would be two additional samplings, making it an overall eleven courses.<br><br>The first dish that came out was one of the off menu samplings from the kitchen. There was a morsel of  a beet nestled on top of a smear of goat cheese and drizzled in a citrus oil. The beet soaked up the citrus oil, and it was bursting with flavor that was mellowed out with the goat cheese which was very enjoyable.<br><br>After the plates were cleared away, we were able to dive into the actual menu, which was as follows:<br><br>1) lobster/scallop/licorice root/curry: What a fantastic start to the meal both in terms of taste and presentation. One perfectly seared (and non-gritty) scallop was nestled in an orange puree of lobster infused with a subtle curry flavor. Off to the side were a few colorful greens that you could incorporate as you liked to add texture to the dish. The licorice root added a nice hint of flavor and substance to the sauce. Outstanding.<br><br>2) shrimp/preserved garlic/rosemary: Wow. There really isn't an easy way to put into words how outstanding this was in terms of presentation and flavor. The dish was served in a hollowed out eggshell that was filled with pureed shrimp, garlic, and rosemary. Well done, Goosefoot, well done.<br><br>3) sunchoke soup/potato/truffle essence: When this dish came out it was overpoweringly aromatic with truffles due to the frothy foam on top that permeated the soup. The truffle luckily was balanced out with the small bits of potato that sunk to the bottom. I have never had sunchokes before and they didn't seem to have a strong flavor in the soup, which I can't decided was good or bad. Overall, this was probably my least favorite of the night.<br><br>4) arctic char/maltake/english pea/espelette: Delicious! The arctic char was enhanced by the spicy red espelette pepper and mellowed out with the english pea that it was perched on top of. This was a small dish, but the flavors were fantastic.<br><br>After this dish we were served one of the \"off menu\" courses which was a pomegranate and beet shooter that was laced with olive oil. This was tart at the beginning and then mellowed out with the pomegranate flavor at the end. It had a unique texture due to the olive oil addition, but it was a great palate cleanser and set us up for the next \"phase\" of the menu.<br><br>5) duck breast/spiced beluge lentils/ginger/compressed apple: Without a doubt, the duck was one of my favorites of the evening. The duck was properly cooked at a medium rare temperature and we received a fair portion with this dish. The spiced beluge lentils were perfectly cooked and added a nice flavor and bite with the duck. Off to the side of the duck were small gelatin squares of ginger along with two compressed green apple globes which was an amazing flavor.<br><br>6) angus beef/cauliflower/goosefoot/trumpet roylae/shallot jus: After thinking I had experienced the best of the meal with the duck, the angus beef gave the duck breast a run for its money. The angus beef was perfectly cooked to a nice medium and the simple seasoning was spot on, making it a truly fantastic piece of meat. The presentation on this was superb--the beef was circled by a pristine circle of shallot jus and nestled in a cauliflower puree and garnished with goosefoot. Each bite was heavenly and it was obviously a favorite as I savored every bite and it was gone within seconds by my boyfriend. <br><br>7) crispy goats milk cheese/lemon balm/red pepper/balsamic: And the awesomeness continued. The phyllo dough added a great crunch to the cheese and the richness was balanced out with the tartness of the lemon balm and the sweetness of the red peppers and balsamic. This was another favorite of the evening without a doubt.<br><br>8) cinderella pumpkin/turkish coffee/cassla/citrus: I'm a sucker for pumpkin, so I LOVED this dessert. The pumpkin was moist mousse like texture that was encased in white chocolate and topped with a chocolate covered espresso bean. This was a beautiful presentation and went wonderfully with the incredibly potent citrus mousse on the side. <br><br>9) hazelnut/chocolate/caramel corn/coconut: Delicious. This again had a mousse like texture that was incredibly rich. The chocolate and the hazelnut flavors were superb, and I loved the texture profile of this dessert. The caramel corn provided a nice crunch and the coconut marshmallow was light and airy. Fantastic.<br><br>We ended the meal with another surprise from the kitchen which was a gooseberry dipped in dark chocolate-this was simple but scrumptious. <br><br>I can't wait to celebrate another special occasion here, thank you Goosefoot!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rfkXNkTLja6am2y3RP4GTA/168s.jpg", "caption": "11/15/2012 Dinner Menu. As you can see, you can take this menu home, plant it, and it will grow wildflowers. Crazy!!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IkniXdANyThDO1dmsVEUqg/168s.jpg", "caption": "Final course of the evening: dessert #2 which was hazelnut/chocolate/caramel corn/coconut."}]}}, {"review": {"des": "I have dined at the restaurant and am a nearby resident. The shop is walkable from my home and I was pleased to find a fair selection of reasonably priced wine for everday drinking (a few I noticed recently around $12 to $20, in addition to a high end selection). Nice selection of beer as well. The selection of dry goods is great, including a nicely curated selection of coffee beans. You can choose among amazing handpainted chocolates and soups by Goosefoot and Chef Chris Nugent. Staff is great and friendly; I've often seen the chef or his wife at the shop.", "pics": null}}, {"review": {"des": "There's nothing to say that hasn't already been said, so I'll keep it brief.  Goosefoot is a must try, although you'll have to try heartily, since it's super hard to get in.  The staff is supremely friendly, though, so when I called explaining that I had a gift certificate that desperately needed using, they did allow me to bypass the midnight-90-days-in-advance-opentable dance.  But it was 90 days out nonetheless.<br><br>As for the dining experience, delightful.  Not nearly as stuffy as some of the other high end pre-fix places in town, and the staff is great.  The only reason for four stars is my need to compare everything to the late Bonsoiree (RIP), which was the best pre-fix place ever.  But really, it's very very good, and I highly recommend it.", "pics": null}}, {"review": {"des": "Awesome Dinner!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fOlIqo-1O3tNIEfLKGYGeQ/348s.jpg", "caption": "Crispy Goats Milk Cheese/Lemon Balm/Red Pepper/Balsamic"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5hwNb791A_ENfAXxt3pozQ/168s.jpg", "caption": "Lobster/Scallop/Licorice Root/Curry"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sj-SvPe8MCE09yNJ_aJAmw/168s.jpg", "caption": "Arctic Char/Maltake/English Pea/Espelette"}]}}, {"review": {"des": "Have done many tasting menus. I'm a big fan. Issue here was the cadence.  I should have left in between courses to get an oil change and haircut. <br><br>They started off fine. Present dish, let guest enjoy, bus table, wait approximately 10 minutes, and repeat. After 2 hours, during the bulkier part of the meal, the wait time increased.  Between one course our wait was a bit over 35 minutes. And about the same for the next course.<br><br>Humans aren't meant to graze. After one stops eating for an extended period of time the stomach shuts off the valve and begins digestion. The body doesn't like another round of food after 35 minutes of cease eating. <br><br>We did not enjoy the second half of our experience. At all. It was a bit painful. <br><br>Its a shame G-foot. Your food and plating was very good. However the \"tasting\" part of the \"tasting menu\" needs to be properly timed. I'm usually more forgiving. However for the price a high level of precision is to be expected.", "pics": null}}, {"review": {"des": "Delicious! For the experience, 4.5 stars! Minor imperfections though... so.. ehh why not. FIVE STARS!<br><br>By some miracle, I snatched up a reservation out of what looks like maybe 2 or 3 that suddenly opened up 3 days before the date on Open Table. After around 3 months of checking periodically it happened! So don't give up if you have trouble getting in! Though I suppose your dates would have to be flexible.<br><br>Walking in I immediately noticed how laid back the place felt, due to both the decor and and the way people were casually chatting, eating, having a nice time. The place is pretty loud. It made us feel very at ease. But dim. I wish it weren't so dim, but that's okay. Nina greeted us with a smile both at the beginning and end and made us feel really welcomed. It was a little weird that we chose not to B our own B, and I think that does take away from the experience a little because during some potentially long waiting time between courses, we could really use something to sip on.<br><br>As for the food, I liked the first half of the menu more than the second. The warmth and richness of the chestnut soup really made me wanna food coma, go home, and take a nap and dream more about the soup. Plus that's when the long waits between the courses began. Looking back, the duck and beef were cooked beautifully (bf reallllly loved the beef and kept talking about it) but in my sleepy state they were unable to shock me out of it with explosive flavors. Oh how I wish I could go back and just reexperience those 2 dishes to truly appreciate them :( I was able to appreciate how amazing dessert was though. It made me really sad that the meal was over. Usually I'm not a huge dessert person since it's always too sweet and rich, but I could've had a lot more of both courses. <br><br>Aside from the long wait time between a few of the courses in the second half, our dining experience was top notch. Everyone was nice, everything done promptly. If their menu changes at some point I'll definitely want to be back.", "pics": null}}, {"review": {"des": "Went to Goosefoot last night with my wife and a couple of friends.  Absolutely fantastic.  I am not sure why those who complain on here about the length of the dinner use that as a reason to give a not-so-great review.  If you are going to drop the money on a dinner like this: (1) you know its 9 courses and so they most likely will not be firing them out of the kitchen, and (2) you should already have known this going in b/c its pretty much written about in 50+% of the reviews on the internet.  Yes dinner may take 3-4 hours, but its an experience and each table in that restaurant is only meant for one party each night (they dont turn the tables over at all).<br><br>Anyway, we were warmly greeted and shown to our table at which point the head chef's wife came over and talked with us to explain the menu, the process, as well as a couple of other conversational points.  I think we had in total 11 or 12 courses (including the off-menu items sent out by the kitchen).  I would say of the 12, 11 were absolutely wonderful.  The 12th I didnt really care only because it was pear-based and I dont like pears.  My top faves were the scallop, the corn soup, the duck and the filet.  And the best part is that its BYOB which saves some major coin at a place like this.  Can't wait to go back.", "pics": null}}, {"review": {"des": "I will tell you a (quick) funny story...and then I will elaborate as much as posisble on the exceptional meal we enjoyed at Goosefoot this past Friday night. <br><br>I secured a Friday night 9pm reservation at Goosefoot 2 months ago in anticipation of our arrival back in Chicago on the good recommendations of some trusted eaters. We were going to be back in our cherished fair city, in our new home...let's celebrate! <br><br>Two days before the reservation, Mrs. Nugent (hostess with the mostess!) called to confirm our reservation and asked me if we were celebrating anything special. Well, of course we were celebrating the above...but had also been discussing wedding plans, etc. There was no formal engagement, but I told her \"yes! we're engaged.\" Because, we basically were...so...ok! Not to fret, I did disclose this to my boyfriend so that he wouldn't be taken off guard and I look like a freak. <br><br>Well, the stars aligned and he actually proposed before that dinner (and it had been planned all along, unbeknownst to me)...so in actuality, we REALLY were celebrating our first dinner as engaged people at Goosefoot. Funny how things work out, right? <br><br>Ok, pardon my setup to the real story here: the experience at Goosefoot! From the moment we entered, we were treated as treasured guests. Our coats checked, shown to a corner table, wine glasses presented (it is BYOB, bring something nice!), waters filled, menus explained. We settled in and enjoyed the fan fare of the 8-course celebration before us. <br><br>It's a small (but extremely well appointed and classically decorated) restaurant just west of Western on Lawrence. Unassuming location and decor. But obviously, the treat to be had is really in the presentation, experience of the chef, passion in the staff, and overall experience of a team working thoughtfully together to make their diners feel like the most important thing to them. This really struck a chord with me. Such legitimate and genuine thought is put into everything at Goosefoot right down to the smallest detail. It's really quite rare.<br><br>OK THE FOOD THE FOOD! Here's the thing, despite eating out ALL THE TIME, I'm not a typical \"foodie.\" I'm not anti-foodie, I'm just not really one. I like the whole experience of dining, and that includes not having a camera, and not really paying attention to each and every ingredient in my food. However, for Goosefoot I can make an exception because they did such a fine job of explaining each course, using locally sourced items and being so gosh darned awesome. <br><br>However, I did not take any photos. I'm sorry, I am not able to do this. However the girl next to me did take 7 photos of each course, so perhaps she will write a review? hehe. You'll find my comments aren't going to be super scientific on each dish, but suffice it to say: it rocked my socks off. <br><br>We were lucky enough to snag the winter-turning-to-spring menu: <br><br>amuse-bouche (lovely, rotates nightly) <br>lobster/scallop/hubbard squash/licorice root/curry (heaven) <br>sunchoke soup/potato/shrimp/truffle essence (brilliant) <br>loup de mer/meyer lemon/leek/tapioca pearls<br>roasted quail/spiced beluga lentils/ginger/compressed apple (the cutest dish)<br>angus beef/heirloom carrots/goosefoot/cumin/shallot jus (my favorite!)<br>pleasant ridge reserve/celery-truffle caponata/almond<br>passion fruit/coconut/lime/vanilla cremeux (light and fluffy and fruity) <br>chocolate/sea beans/orange/mulled wine (I died, find me in heaven) <br><br>*word to the wise, if you do NOT like mushrooms/truffle, do tell them and they will accommodate. It's in many dishes, and while I love it...you may not, and they will do their best to exclude it. Obviously though it impacts the overall flavor, but it is a strong one. They do the same for food allergies, etc as well. <br><br>It was a fabulous meal, capped off by a visit from Chef Nugent himself...who is quite possibly the most down to earth chef I've ever met. This includes ones that aren't very good or aren't particularly esteemed/reputable. Chris is genuine and thoughtful, and it permeates each and every nook, cranny and dish at Goosefoot. <br><br>$90/pp for the 8-course tasting menu. <br>No corkage fee. <br><br>Can't get into Next? Skip the ultra-headache and super scene and dine here instead. It was right up my alley, and might tickle your fancy more than you expect...even if you ARE a foodie ;) Wait, especially if you are a foodie. Whatever, just go!", "pics": null}}, {"review": {"des": "This place's flavor profile is very similar to les nomades for the most obvious reason. But for $90 per person plus BYOB, it's worth every penny!  <br><br>I won't write about every course, my two favorites were the sunchoke soup and angus beef. The soup was probably the best soup I've had.  Creamy, flavorful, with some veggies on the plate to add texture. The angus beef, omg. I am not a steak person, and I tried to make eating out to steakhouses as least often as possible to counter my husband's obsession with steaks. But we still went to some of the good steakhouses in Chicago (Gibsons, David Burke's, Joe's, Morton's steakhouse etc.) So trust me when I say this because I have a very good sample size to compare to--this piece of angus beef is probably THE best steak you will ever have. And it's not some fancy schmancy dry aged or wet aged steak, nor does it have any sauce on it. It's pure, flavorful, perfectly cooked, and melts in your mouth.<br><br>When we were done with dinner, we went outside to catch a cab. Nina came outside with us and tried to help us catch a cab. Other than Next/Alinea/Aviary, this is the only normal restaurant we've been to that actually went over and beyond to help us catch a cab. It might not mean that much to other people, but I am a sucker for that. And it speaks to their service level. I will definitely be back.", "pics": null}}, {"review": {"des": "Goosefoot is a solid tasting menu with big portion sizes, but if you're looking to be wowed, there are lots of better choices in Chicago.  Come for the family atmosphere and byob if you're looking for a tasting menu.<br><br>Upon arriving I was impressed with the staff's memory as they easily recognized my dining companions who had been before. Good strategy to keep the books filled in the future by being friendly and providing on the spot future reservations, making it impossible to get in unless you get in grandfathered in.  The ambiance was inviting but stale. I loved the flower arrangements. The music was bipolar, elevator music putting me to sleep for a while, the 70's then contemporary?  <br><br>The meal started quickly with a nice golden beet amuse, however we didn't get our first course until 27 minutes after arriving.  The pace of the meal continued to be an issue the rest of the night. It was a 4 hour meal. That's way too long for only 9 courses and 2 amuse.  I don't mind eating for 4 hours but I better have 25 courses.  <br><br>Portion sizes were huge, biggest portions of a tasting menu I've had.  Specifically the soup and steak can fill you up on their own.  Despite the sizes I walked away hungry after the length of the meal. Our server was new, she was adequate, but I didn't feel super loved or get in depth food explanations. I hate just a quick listing of ingredients.  <br><br>Others have already listed a complete list of the meal, I'll highlight the salmon, soup and strawberry dessert as favorites. The best bite of the night was the compressed apple. Every dish was solid, no misses, this is hard to accomplish. But in a week I won't remember anything I ate, nothing wowed me.  No clear standout signature dishes and this the ultimate failing. There are so many places I can go for a solid meal.  When I want world class tasting menu, Michelin star rated no less, I need more. I need a wow dish, a change in my perception of what can be done or in flavor profile.  <br><br>The flavors are well balanced and subtle finishes of flowers abound, but it leaves you wanting to be punched in the face with something bold every once in a while.  The foie gras powder is a perfect example.  It sounds titillating but your left trying to find the flavor, instead of air. <br><br>Another issue I have is Chef's Nugent use of jellies and micro flowers.  They all tasted great, but then they were seemingly on every day its just contrived.  Additionally, they were so small you couldn't use them to compliment the main dish. <br><br>Fun time with friends, but I can't see myself coming back.", "pics": null}}, {"review": {"des": "I'm not going to give a run-down of each course (plenty of people have done that already) but I will give a warning:  the meal can get VERY long.<br><br>I'm not a \"rushy\" eater.  I enjoy savoring each delicious bite, and the company I keep at dinner, usually my beautiful wife.  But when we went to Goosefoot I couldn't believe how long it was taking.  It's a tasting menu, and we often had 45 minutes in between courses.  45 minutes!!!  It doesn't need to be McDonald's, but if you're doing a tasting menu it has to be quicker than 45 minutes.  We were starving the entire meal and left starving as well.<br><br>A number of people have complained about this, so I don't know if anything will be done or not.  I'm writing my review as a warning:  yes, the food is great, but I'm not sure it's worth sitting around over 4 hours for.<br><br>99/365", "pics": null}}, {"review": {"des": "The bulk of the selection in this store is wine, no doubt with the Goosefoot restaurant next door in mind, as it is BYOB.  I can't speak to that because I'm not much of a wine drinker, but one side effect of this is that the shop is open later, at least for now, which makes it convenient to visit after dealing with one's other errands for the evening.  They also have a selection of good beer kept chilled to drinking temperature.<br><br>Also the cooler are soups from the restaurant ready to be reheated, interesting cheeses and salamis, etc.  And of course the lovely Goosefoot-made chocolates, which are beautiful to look at (clearly a lot of skilled hand work with colored cocoa butters) and tasty to eat.<br><br>Most of the other items include high-end pantry items like dried pastas, gourmet jarred pasta sauce, granola, various interesting mixes and condiments like goat's milk caramel ice cream topping, fancy crackers, and baking mixes in cute glass jars.  Generally looks to be a well-curated selection.  If you are looking for an elegant food-related hostess gift, you could definitely find something here.<br><br>One unexpected offering is beer-making supplies in the back corner.  I'm a casual home-brewer, so that was very good to see.", "pics": null}}, {"review": {"des": "Everything people said about this place is true and lives up to the hype. Wasn't disappointed at all. Very impressed, nice place and staff.  You definitely need to book ahead of time.", "pics": null}}, {"review": {"des": "Truly a special experience. It is a very intimate environment but somewhat casual so you can feel free to take out your phones and capture the amazing dishes coming to your table. It is BYOB which is a HUGE plus and saves you money which is important at $220 per person all in. They also have a wine store next door should you not plan ahead and need a bottle. The front of house/server Nena and her husband Chef Chris were simply delightful sharing little snip-its from their lives as they presented each course. Every single bite was amazing and beautifully presented. The creativity and attention to detail is truly something else! The dishes, ingredients and flavors were very cohesive. It was hard to pick a favorite dish! They even give you one of their homemade chocolates to take home which we will be saving for a special night with a good bottle of wine. Such a nice treat to take away from the experience. I have never had a fine dining experience that was so personal and where you got to interact with the chef so much. We could not have asked for a better meal or night! I highly recommend this place. It is not cheap but it is worth every penny. Seatings are only at 630pm and last for about 3-3.5 hours. We were very lucky to get in the night before after some cancellations came through. I can die a happy lady after this meal!", "pics": null}}, {"review": {"des": "I really enjoyed my experience here. Unlike it's counterparts (Schwa, Bonsoiree, EL Ideas...) it's actually quite easy to make a reservation. Chef Chris Nugent personally suggested that if in the future we have any trouble with OpenTable, to call the restaurant and they'll be able to fit us in.  Now that's love.<br><br>That's kind of the feeling you get from the restaurant.  Kinda like you're eating in a friend's very nicely decorated living room. Except that your friend is an amazing chef.  Each course was plated meticulously and seasoned perfectly. <br><br>While I can appreciate when a chef is conscious about how to make a course flow to the next, my one complaint is that by end of the meal, my palette was a little tired of the repeating flavors.<br><br>Sometimes with these types of meals, I find that dessert can be disappointing. Fortunately dessert was fantastic. I love cheese but for whatever reason I always feel cheese courses are a ripoff.  I loved the cheese course here. I also loved the chocolate/hazelnut/orange dessert.  It was wonderfully smooth and had this delightful layer of crispy on the bottom. I want to eat that over and over again.<br><br>Will definitely be back with the next season!", "pics": null}}, {"review": {"des": "Goosefoot for our 10th anniversary (12/27/13) was an extravagance, a once-per-decade expenditure as a treat for ourselves. Was it worth it? Stay tuned for the answer. For now, the menu:<br><br>1st course: Scallop - perfectly prepared, which is always a trick with scallops. Good flavor.<br><br>2nd course: Shrimp - served in a brown eggshell, a custardy, garlicky delight. Adorable presentation. One of the highlights of the night.<br><br>3rd course: Chestnut soup - rich and creamy with a truffley foam on top. Deceptively large bowl, but I could've eaten 3 bowls of the stuff.<br><br>4th course: Toothfish - aka Chilean sea bass, apparently. So the server informed us. This one didn't do it for me. The texture was mealy and odd. I admit ignorance here - maybe sea bass is just that way. Flavor was pretty one-note, but it was edible.<br><br>5th course: Duck breast - total autumnal flavors in this one. I enjoyed it, but my wife didn't dig the pumpkin pie-like, heavily sweet-spiced taste.<br><br>6th course: Angus beef - beautifully prepared, and a good conclusion to the \"main course\" portion of the menu. Excellent quality.<br><br>7th course: Roquefort cheese - can't go wrong with a nice stinky cheese. I don't remember much about this course, to be honest.<br><br>8th course: Cinderella pumpkin - a couple of bottles into the night, and 8 courses in, I hope you'll forgive me for not really recalling the dessert courses.<br><br>9th course: Chocolate - a good grand finale. I do remember this one, which is a good thing. Can't forget a high-quality chocolate. Passion fruit and coconut added contrast.<br><br>This is what I, a poor person, imagine rich people eat every day. Alfred would be cooking this stuff for Bruce Wayne, if he wasn't out fighting crime. Not to imply that the food or the space are pretentious. They're actually pretty laid back and down to earth, which I like. BYOB always earns points from me too. Although they recently raised prices to keep it BYOB, which sorta negates the benefit.<br><br>I feel like a fancy restaurant - a really fancy one - should redefine what food can be. Like a car can be more than a mere tool for transportation, food can be more than calories for my food-hole. Oh wait, I don't really believe a luxury car is better than a cheap one. Then again, nor do I think it's ok to settle for a heap with no heat and no A/C. But there's a happy medium somewhere. While man cannot live on McDonald's alone, nor can he live on Goosefoot alone, unless he's one of the 1%.<br><br>I've never flown 1st class. I feel like if I did, it would ruin air travel for me forever. I'd never be able to take a step back to economy class again. And since I can't afford to fly 1st class, that would be horribly depressing. Goosefoot should have changed my life. It should have ruined food for me forever. I know that's a tall order, and an awful thing to want, but for a $345 dinner (tax and tip, etc.), that's what I demand. Probably best that didn't happen.<br><br>When I drive by Goosefoot in my taupe '99 Toyota Camry with the tape over the window that won't quite roll all the way up, I don't feel wistful. I don't sigh and dream of truffle-chestnut soup and preserved garlic custard in an eggshell. Would I eat that kind of haute cuisine every day if I could? Perhaps, but I've gone back to eating simpler fare without missing a beat. Excellent as it was, it wasn't life-changing. Chef Chris Nugent does great work, and I'm not implying the place is a ripoff. The food is top-notch, but I still felt some sticker shock, and later, buyer's remorse, but that's just cuz I'm a poor person. Highly recommended for those with disposable income. Don't think I'd go back - can't afford it.", "pics": null}}, {"review": {"des": "We went here Friday night for my husbands birthday dinner. I made reservations at the end of January for mid- April and got one of the last available tables. Plan ahead. It's worth it. We had an 8:30 reso. I will say the only downfall of this place is the location. Totally in the sketch and having a nice car we were worried about it still being there when we got done but it was and the food made us forget all our worries. <br><br>We were greeted by Chef Nugent's wife Nina, who showed us to our table. I know others have gone into detail about the courses so I won't but I will say that everything, from amuse to dessert, everything was flawless. Every dish was inspired, perfectly executed and amazing. Highlights for us were the scallop, sunchoke soup with baby shrimp, and the angus beef filet. Melted in your mouth. The food is more classic and less about innovation than Next, but just focuses on great flavors. <br><br>The Chef came out and talked to our table for at least 10 minutes. He really wants to meet his patrons, get feedback, and you could tell he genuinely cares. It was honestly one of the highlights for us. He's a brilliant chef and I'm happy to support his latest venture. Go here. It's amazing and for the price it's even better. You can't find this quality byob tasting often.", "pics": null}}, {"review": {"des": "I must have been good this year because Christmas just came early.  No, I didn't get a shiny new bike or a Red Rider BB Gun.  I got a Goosefoot.  What, pray tell, is a Goosefoot?  Aside from being a species of herbaceous flowering plants (thank you wikipedia), Goosefoot is a new gem of a restaurant in Lincoln Square and quite possibly my new favorite resto in the city.  <br><br>Simply put, the food is phenomenal.  I've always been a fan of seasonally focused cooking, and Goosefoot executes that to a T.  As the servers described the list of ingredients in each course I found myself wondering just how all these elements and techniques would come together, but they do on every level.  While I could easily give a mini-rave on each course, I'll just hit you with the highlights:<br><br>* The delicate sweetness of the hubbard squash agnolotti, richness of the butter poached lobster, and hint of curry spice made for an excellent first course<br>* A soup course that featured the subtle sweetness and nuttiness of chestnuts perfectly married with earthy mushrooms and a truffle foam <br>* A nicely seared sea bass atop a velvety smooth sunchoke puree and savory melted leeks, along with a small pool of fennel puree to add yet another layer of flavor to each bite<br>* A flavorful, butter-knife tender beef fillet sauced with a savory jus, and sweet heirloom carrots prepared with various techniques<br>* Two fantastic desserts, including an amazing chocolate course garnished with chocolate covered sea beans (sounds strange but totally works) and paired with a vanilla orange espuma<br><br>Being their first Friday of full service, there were a few minor delays between some courses, but the good company of my wife and a modern, yet comfortable and relaxed atmosphere barely made that noticeable.  We were served by various individuals during the night and each member of the staff was friendly and knowledgeable about the menu.  I'm sure any timing issues will get smoothed out as time progresses, but pretty solid for only their sixth day in business.  For now, Goosefoot is offering an 8-course menu, but a 12-course menu is in the works.  They're also BYOB (no corkage fee!) and check out their website for some suggested pairings.  Parking, both street and their rear lot, is ample.<br><br>By the close of our meal we had a chance to chat with Chef Nugent and his wife, Nina.  They're simply two of the nicest, warmest people one could meet.  I admire and applaud their effort to bring a fine dining restaurant to this quiet stretch of Lawrence Ave.  I've been lucky to dine at some very nice restaurants and the quality of food and service at Goosefoot would easily merit Michelin star or James Beard recognition if given the chance.  I wish Goosefoot nothing but continued success so they can receive the recognition they deserve.  Welcome to the neighborhood Goosefoot and merry Christmas to me!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lNdtGQd1qnzCLDJQ5HgPLA/348s.jpg", "caption": "Chocolate - Valentine's Day Edition"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/erRCn4IAkHE4h4IIF7ZCeA/168s.jpg", "caption": "Chocolate"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1Mm7VALXDuTT2Wks34jPRw/168s.jpg", "caption": "Angus Beef"}]}}, {"review": {"des": "Macs are absolutely 5 stars! Maybe on the more expensive side for Chicago macs ($15 for 6), but completely worth it considering you'll need to get to nyc or paris for a comparable cookie. Nothing in this city comes close imo. <br><br>Wine selection looks nice, but I drink whiskey, so I don't know. Service is fine, but I just buy cookies and leave, so not much for them to screw up there.", "pics": null}}, {"review": {"des": "Really excited to have this new edition to the neighborhood! <br><br>A great selection of speciality foods (especially chocolate and cheese), as well as wine and beer!", "pics": null}}, {"review": {"des": "I have been eagerly anticipating the opening of Goosefoot since I had read about Chris Nugent's decision to leave Les Nomades and open his own venue.  Tonight my wife and I had the privilege of being the first patrons at the official opening night. <br><br>Goosefoot is an upscale restaurant featuring tasting menus utilizing the finest seasonal ingredients from small farms. The food is contemporary American with French influence. For now there is an eight course menu offered for $90 per/person and in the coming weeks a twelve course menu will be available as well. Goosefoot does not have a bar, but welcomes you to bring your own wine and beer and make recommendations on their website for what pairs with their current menu. <br><br>Goosefoot is located in Lincoln Square and brings a fine dining option to the neighborhood. There is a small parking lot behind the restaurant, plenty of street parking and the brown line will drop you off within walking distance. Goosefoot is an intimate setting; there are just 28 seats and the decor is warm and comfortable. We were enthusiastically greeted by Nina, Chris Nugent's wife as we entered and this set the tone for what turned out to be an evening of exemplary service by the entire staff. Even Chris himself came to our table and spent a few minutes chatting with us. While this was opening night, everything appeared to already be running without a hitch. <br><br>Each of the eight courses were outstanding and elegantly and artistically presented. The quality of the ingredients really popped. Each dish had interesting accompaniments that interacted perfectly with the featured ingredient. There was just the right amount of seasoning and sauces; enough to enhance the flavoring but not overpower the excellent meats and seafood. The first dish featured lobster and also included Hubbard squash, licorice root and curry. After just one bite I knew that I was in for a real treat; this dish was so amazing and yet every dish that followed remained at this high level. It was like the culinary version of a movie where you are on the edge of your seat the entire time with excitement and anticipation. <br><br>The second dish, a chestnut soup with smoke, white Alba mushrooms and truffle essence was easily the best soup I have tasted. The Angus beef dish was likewise one of the best beef dishes I have enjoyed and the cheese course and desserts were home runs as well. The sign of a truly great chef is one that creates food so good that dishes one usually does not care for taste so good you crave more. I have never been drawn to chocolate desserts, but the chocolate finale to the eight course dinner was so delicious I had to fend off my wife from stealing my portion after she devoured hers! By the end of the night my taste buds felt like they were in heaven. My wife and agreed this was easily one of our top meals ever. <br><br>Chris Nugent was somehow overlooked by Michelin during his tenure at Les Nomades, but I think a new star has been born in Goosefoot. I would be shocked if this venue does not rapidly ascend into one of Chicago's hottest restaurants. I highly encourage people to come here quick as with the seating being so limited, I imagine reservations will be hard to score in the very near future. This is the perfect place to celebrate a special occasion or to just enjoy an all around sensational meal. Chicago is home to some of the greatest restaurants in the country and Goosefoot is right up there with the best of them.  We definitely plan to return soon to partake in the twelve course menu when it is unveiled. I want to thank Goosefoot for such an amazing dinner and wish Goosefoot much success.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fREiDU6JFx15AIOuLf0Vmw/348s.jpg", "caption": "Quail"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WRRNCof0FAdBYZL0EH5p3Q/168s.jpg", "caption": "Scallop and Lobster"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/I_TU4JrVdW8B54RjeC73mw/168s.jpg", "caption": "Homemade Chocolates"}]}}, {"review": {"des": "KenScale: 9.5/10<br><br>Wow, a truly amazing restaurant in Chicago! Goosefoot, a New American restaurant featuring locally sourced foods and French technique from Chris Nugent, was the highlight of my restaurant tour in Chicago. While I am more biased toward truly inventive cuisine that I can't eat elsewhere, I've never been to a place where the foods look simple enough yet the execution is simply flawless. I'm surprised that this place has only one Michelin star so far.<br><br>Goosefoot offers single tasting menu at an absolute steal of $115 per person. Among all the tasting menu experiences I've had so far, I don't think I've had a time where each dish was so flavorful and is a class on its own. Some particularly memorable dishes were: cauliflower soup, farm egg and asparagus, angus beef (sometimes, venison is featured instead, but I'm glad I had the beef, which was ridiculously tender), and both desserts (apricot and chocolate/passion fruit). <br><br>The restaurant is BYOB only, so if you're planning on drinking there, make sure to bring your own wine (the staff will graciously open the bottle and serve it on their glasses for you). Getting a reservation in this restaurant is ridiculously hard, and I feel truly blessed to have been able to get a last-minute reservation shortly before my visit to Chicago. If you want to visit this restaurant on a regular basis, it's probably smart to befriend Nina Nugent (chef's wife at the restaurant) and make reservations for the next dinner after your meal is over.", "pics": null}}, {"review": {"des": "Tonight's Dinner ran from 6:30 to 10:00 pm; courses were evenly spaced and we enjoyed every minute and just about every bite.  It helps that the clientele in general seems to be laid back and enjoying the exceptional experience.<br>Chris and Nina remind me of Roland and Beth Liccione from the days of Le Francais (after Jean Banchet); Nina's front  room skills add a very postive element to the dining experience as does every member of the staff.<br>We waited a little over a year for the menu to turn over in a manner we were happy with; the current menu is similar (but different enough) to past menus: the soup course, a lovely tomato, mild onion and israeli cous cous with goat cheese froth,  was,again, the largest course by volume.  The beef course was again superlative; every course had a unique presentation, similar to a Japanes Kasekei dinner, with many edible flowers included and unique and lovely presentations - not my usual concern but very well executed here.<br>The amuse bouche was a lovely mushroom soup with truffles; subsequent courses featured broths and custards; the complaint about this feature  is to some extent well taken but since each course (but one) was exceptional I can't find significat fault here,  The custard course featured a shrimp and mild garlic mix; the shrimp was pretty much AWOL both in texture and flavor; that was the only unexceptional course.  The Tuna course had great flavor (with Miso), but could have been larger.  Otherwise we were extremely satisfied with our dinner.<br>We purchased (from the Goosefoot store next door) a chilled bottle of Chablis and a Williamette Valley Pinot for a total of  $58; they were very nice and there are many choices in a moderate price range at the store.  Interesting pastas too!<br>I hope to visit again this winter.", "pics": null}}, {"review": {"des": "I was so pumped to get in here before the hype.  <br><br>Its up north so we drove...there is tons of free street parking on the random side streets or metered right on Lawrence.<br><br>Walked in and the restaurant is very small...kind of like a bonsoiree style.  We were prompted greeted by someone who took our coats and escorted us to our other guests.<br><br>So this place is small and BYOB...bonus for sure.  I have to say that the service was a little slow in the beginning and they did not keep up with the BYOB service.  Which is kind of a no-no to me.  Also, the amuse bouche came out as we were getting our first glass poured so again, not the biggest fan because I would have liked to have a couple of sips of the bubbly before we actually started, but the timing was a little off...it definitely got better as the courses went on.<br><br>The meal...it was pretty good.  Nothing really WOWed me, however, all of it was solid.  There were a couple of dishes that I would have liked more direction on how to eat them...ie dip this in that, taste this with that, etc.  Somethings that stick out:<br>lobster with scallop-I thought was really good and a great starter to the dinner<br>chestnut soup-creamy and rich, yet still light and savory and had a heartiness to it from the mushrooms<br>beef-everyone at the table seemed to get different temperatures...one was slightly overdone, one was slightly underdone, two were perfect<br>desserts-pumpkin mousse...FABULOUS!  I love me some good pumpkin and this dessert was great.  I also liked the chocolate at the end.  It had a great crunch on the outside and creamy in the middle.  <br><br>At the end, Chris came out and talked to our table...which truly was a treat at the end of the meal.  You can really tell that he loves what he does and wants to hear what you think.  Although super shy and slightly awkward at the beginning, he warmed up to us after about a minute or two.  He was a real personable guy.  No ego here.  Plus, he had no problem praising other restaurants...instead of bashing them.<br><br>Overall, I thought Goosefoot was a great experience and for $90 a pop...I spent less on the whole table here than one person at Alinea so I definitely think its worth the price.  <br>Yes, its a smaller scale<br>Yes, you have to BYOB it...however, on the website, they give you several affordable options to pair with the food<br>No, you arent going to get a WOW factor, but definitely good and solid<br>Yes, you should check it out", "pics": null}}, {"review": {"des": "Always fantastic. Chris and Nina are the best as well as a fabulous wait staff. Do not be intimidated by the \"chef's table\" approach.  It is NOT communal and is great for small groups, single diners and special occasions.  The food is always awesome!", "pics": null}}, {"review": {"des": "Goosefoot is truly a must try for any foodie in Chicago. The price at $135 is very reasonable for the quality and size of the tasting menu, and their BYOB policy almost makes it a steal for a Michelin Star restaurant. The menu featured very unique flavor combinations, and the presentations were amongst the best I have seen anywhere. As others have mentioned, the only fault of the meal was the pace. It ended up being almost a 3.5 hour meal. I feel they could easily cut at least 45-60 min off the total meal time without having anyone feel rushed through the 8-10 courses. The couple next to us actually left prior to receiving their last two courses because they were tired of waiting. Don't get me wrong, the food is absolutely worth waiting a few extra minutes for, but having been there once I'm honestly not sure I'd rush back if the pace of the meal was not altered.", "pics": null}}, {"review": {"des": "This was my first visit to Goosefoot, and I was impressed with the food and pleased with the service. Since the menu changes frequently, there's no point I describing individual courses. However each of the 11 courses was top-notch in flavors, balance, textures and presentation.<br><br>My companion and I agreed that this was among the two top fine dining experiences we've had. I'm looking forward to returning (after my credit card gets out of rehab).", "pics": null}}, {"review": {"des": "I'm so happy to have finally dined at Goosefoot, though I am simultaneously sad that I did not go years ago because I would have been back countless times since.<br><br>Goosefoot lived up to the hype, at least for everyone in my party.<br><br>We loved the friendly service and the intimate atmosphere. The pacing of our meal sounds better than what many other folks have reported. Our meal probably took around 3.5 hours.  A pace of 3 may have perfect, but this was fine - we obviously weren't in a rush.<br><br>The food was incredible - there was not a single dish that disappointed. This also seems like a relatively safe place for people who aren't incredibly adventurous. The dishes all featured more common proteins or veggies with really beautiful flavors (scallop, salmon, beef, duck breast etc). No offal, etc.<br><br>Before leaving I made a couple reservations for 2015 and I am so very much looking forward to them!<br><br>Their long awaited shop selling wine, cheese, chocolates, soups, etc will open next door on 10/14!", "pics": null}}, {"review": {"des": "I don't really understand how come people are going crazy for this place.  The food is good, but not outstanding.  Alinea, Next, Avenues, Moto...all have more interesting dishes.  <br><br>When we went there, the lights flickered the whole time, the meal lasted 3.5 hrs, and everyone in the place had the same look of, \"how much longer is this going to take?\"  It is expensive cuisine that just takes too long and is not worth the time or the money.", "pics": null}}, {"review": {"des": "Enjoyable dinner with friends on a Thursday at Goosefoot.  Dinner was very good with most of the courses coming in with very high levels of execution and very well thought out combinations of ingredients plus great texture mixes.  Really enjoyed this dinner.  Staff was attentive and friendly.  Chef came out to talk after we wrapped up.  Decor was solid and noise level was good with a bit of background music that you had to stop and listen for.  Overall excellent experience.<br><br>One suggestion to the owners.  Being a BYOB with this quality of food is excellent and rare.  I would like to have the option of decanting my wine that I bring.  Really expensive decanters are not necessary as it doesn't have to be crystal and snobby.  I would love just a wide bottomed glass decanter you can pick up for $20 to decant my wine as I'm guessing many guests like myself are anticipating this fantastic dinner and bring some big wines to drink.  Decanting would be a great benefit to those bringing older or really big wines that could use some air.  Other than that... fantastic!<br><br>Would recommend this place for special occasions or just a great food night out.  Rezy's are hard to come by as they book up way in advance.  I'm always a fan of Thursdays for great dinning nights out and Goosefoot delivered.", "pics": null}}, {"review": {"des": "Wow.  I had many pre fix meals in my tenure as a foodie.  Goosefoot is second to none of them!  I would go as far as it rivals French Laundry (gasp!).  I had been waiting to come here for over a year.  It is difficult - next to impossible to get reservations here.  Goosefoot has a lot of repeat patrons and Nina knows all of their names! Exceptional service and such friendly staff.  <br>The following is our 3 hour dinner:<br>Hamachi/crab/lemongrass<br>shrimp/preserved garlic/rosemary<br>corn soup/potato/sunflower truffle essence<br>scottish salmon/espelette/crawfish/coriander<br>farm egg/asparagus/parmigiano-reggiano<br>angus beef/spiced beluga lentils/cumin/compressed apple<br>roquefort cheese/goji berry / hazelnut/ pear/port<br>apricot/cassia/kaffir lime/citrus<br>chocolate/passion fruit/coconut/ice wine<br><br>Chef Chris Nugent is a magician.  Nina, his wife, is the hostess.  <br>Food comes from local farms and is super seasonal! I would definitely recommend and would go back myself!  (You can plant their menus they are made of wild flowers!)", "pics": null}}, {"review": {"des": "Came here for our tenth anniversary.  Was a night to remember.   Service was outstanding.  We were greeted by the owner who knew it was our anniversary.   They called in advance for food allergies.   Food is spectacular.    Every dish is art.  Tastes as good as it looks.     Can't miss and we are coming back for sure.    It's expensive but when you look at the service and the presentation and the wonderful taste it's very fair and great for a special occasion.", "pics": null}}]}