{"name": "grand-lux-cafe-chicago", "reviews": [{"review": {"des": "I can't believe I've never written a review on this place. I've been coming here for (if my memory serves me correctly) about 13 years. Overall I like the food (the baked to order cookies are to die for) most times I get the shrimp (it comes with chicken but I never get it like that) jambalaya (with spaghettini noodles and extra sauce). I like almost all of the pasta dishes (I always get shrimp instead of whatever meat that's listed). I ALWAYS take an order of cookies to go. Usually whomever I'm with orders the buffalo chicken rolls and they always love em. This last time I ordered the shrimp (I can't remember the name but I'll post a pic), as far as I'm concerned they can take them off the menu because they're simply not worth it. Also this time bc my jambalaya came out with chicken I decided to change my order all together and get a different shrimp pasta (again I can't remember the name but I'll post the pic). Instead of the cookies I opted for the butter cake and it was YUMMY! <br><br>Well this is an updated review, we were here last night and all I have to say is something is going all the way wrong with the cookies. I live 10 mins from the restaurant and they were HARD as bricks by the time I made it home. I tossed them on the counter ad never looked back. As I was about to trash them I decided Yalp NEEDED to know about this before some unsuspecting cookie lover orders a batch. See vid!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MsGlpZSj6W1cKH2uNseDoA/348s.jpg", "caption": "Shrimp appetizer"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VRef66cNaC6R9LTJBMJctg/168s.jpg", "caption": "Shrimp pasta dish"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SZg0H9wiCgvGcb5w5gxogA/168s.jpg", "caption": "Butter cake"}]}}, {"review": {"des": "I had the ribeye and it was just as good as many $50 plus steaks I've had in the past. It was perfectly medium rare and very juicy with very little fat. Mmmm!<br><br>I wasn't very impressed with the French fries, though. <br><br>We had an amazing server (Roxanne) who was so friendly and fun!  Made our experience dining there all the better.", "pics": null}}, {"review": {"des": "It's been few years since my last visit. Missed their chicken lettuce wrap, so we decided to stop by after the chores on the Magnificent Miles.<br>It was busy as it used to be!!<br>And the chicken filling was as tasty as we remembered but the lettuce wraps were not as nicely shaped like before and made it more challenging not making a mess eating.<br>The service was attentive and efficient!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6KULAWbxe4ALxgWyvMEEYQ/168s.jpg", "caption": "Complimentary bread, yum!!!!"}]}}, {"review": {"des": "My second time here, only come here cause my cousins who live in rural Illinois like it. I'm a local, and think there are better places to go, that being said, Grand Lux, for lunch is great.<br><br>They have a sign when you walk in for drink specials later, and for lunch, there is a lunch menu. Plenty of menu choices.  I had a short rib sandwich, it was grilled on rye, Swiss cheese, arugula, and some odd grilled pink onions...it was tasty, nothing special, came with a tasteless horseradish creamy dip on the side. I choose a side salad, boring, could have had fries,I also had a cup, which was actually a bowl of clam chowder,which was excellent.<br><br>My cousin had a turkey burger, she had to send it back, it was undercooked.  The waitress we had was a delightful young aspiring actress, did a great job. Service was slow though, not her fault.<br><br>Desserts looked fabulous, just not on my diet at the moment. I'd go back.", "pics": null}}, {"review": {"des": "Delicious dinner the other night at Grand Lux! I was told these cafes are by the same owner as the Cheesecake Factory and after seeing this place that must be true. It looks almost identical to Cheesecake Factory. Super huge seating area but I'm sure it also gets packed on weekends. I had the Chicken Royale which was delicious! Portions are huge and could be shared. I wish i had room for dessert but I did not. I would definitely go back.", "pics": null}}, {"review": {"des": "I've gotta say I'm pleasantly surprised. I imagined this would be a fancy Cheesecake Factory like restaurant (which I'm not a fan of) but I must admit I enjoyed the whole experience. My brother invited us here to celebrate a successful month. He had been here a couple of times before and always told us about it. We were seated in the beautiful dome shaped room overlooking Michigan Ave. <br><br>The food: great flavor, good portions, large selections which can be good for some, bad for others. I personally just got to the section I'm feeling and choose from there. I was craving pasta so I got the short rib ravioli. Yum! Yum! Yum! We also tried the calamari to start and some egg roll type of appetizer. <br><br>The service: It wasn't bad but it wasn't great. She took a while to bring out our food and drinks. Granted, they were busy but when you're hungry waiting isn't fun. However, while sipping on my martini I realized the glass on the rim was chipped. When I mentioned it I imagined she would just pour it into a new glass given I had drank a decent amount, but she brought me a whole fresh one! That was nice.<br><br>The ambience: Busy! and loud. Its actually a HUGE restaurant but honestly I won't complain about that because when I go to a restaurant that large, I don't expect it to be silent lol", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pwAiW7cd86o_6IGlG5Kyiw/348s.jpg", "caption": "The drink list"}]}}, {"review": {"des": "I came here last week with my mom while she was in town visiting.  We sat in one of the rooms with a view of Michigan Avenue which was lovely.  Food was great, service was great.  I'll definitely be back.", "pics": null}}, {"review": {"des": "We stopped her for brunch on a Saturday. They are pretty busy and noisy in general. But they are very organized. <br><br>We checked in downstairs where they told us it would be 15 to 20 minutes to get a table. They gave us one of those devices that buzz and flash when they are ready to seat us. We chose to go upstairs and wait there. <br><br>It was very crowded, but they were pretty good about seating everyone. We were seated in less than 10 minutes. <br><br>Our waiter was attentive but he did make us feel like he was always late and needed to run somewhere, talking very fast etc. But he was helpful. <br><br>We ordered omelets. My wife had the mushroom, cheese and spinach omelet off the lunch menu and I had the crab and asparagus omelet off the brunch menu, <br><br>Both are made well and fresh with fresh ingredients. The omelet was folded rather than wrapped like a burrito, which is the way I like it. <br><br>The hash browns could have been browned more. They almost tasted like I made them from a frozen bag at home. Not great.  <br><br>All in all enjoyable, but a bit noisy and busy for my taste.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_ug7DfFFqtu6nBX3UolFGA/348s.jpg", "caption": "Crab and asparagus omelette."}]}}, {"review": {"des": "You can't go wrong at Grand Lux, they literally have something to appease any appetite. This is owned by the same group that owns Cheesecake Factory so be ready for a menu that is as big as a Stephen King novel. Grand Lux does a great job providing elevated pub food like Asian Nachos, Volcano Shrimp, Short Rib Tacos, alongside plenty of salads, burgers, steak and seafood options. The food is always good and not typical of items you'd make at home. The price is reasonable and the Chicago location is right in the middle of all the action taking place on the Magnificent Mile. The dinning room is very impressive, the service is hit or miss. Great place to visit for a casual meal of elevated pub food!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/y3zXkIZzs67n_oLAoHxEwg/348s.jpg", "caption": "Me and Lumpley hanging at Grand Lux!"}]}}, {"review": {"des": "I think this place is beautiful. I went there with my husband, we had to wait 10 minutes for a table ..... No big deal. The food was great and the drinks were more than enough.", "pics": null}}, {"review": {"des": "The Grand Lux Cafe is a wonderful restaurant to go to if you want the experience of a downtown restaurant while not really paying those downtown Chicago prices.  Perfect place to take out of town visitors. <br><br>You can find all sorts of things on the menu to satisfy anyone's pallet. From steak, pasta, chicken dishes, to sandwiches and salads, they have it all.  Anything that I've ever tried here was always very good and tasty.  <br><br>The layout inside is very pretty.  I love the marble floors and the high booths, along with the long escalator ride from the restaurant's lobby to the actual restaurant.  If you're lucky,  you just might get the booth located right next to the window overlooking the Magnificent Mile (Michigan Ave for you tourists).<br><br>I am always happy with the service that I get whenever I dine here.  The servers all know the menu well, in case you have questions.  They always make sure your glasses are filled with whatever beverage that you are enjoying.  Make sure you try the cucumber lemonade.  Its very crisp and refreshing!<br><br>I am always very full and happy when I dine here.  Keep in mind that their portions are huge.    Always tons of leftovers to take back home and enjoy.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aHyeMgqspUAujniurpOsTw/168s.jpg", "caption": "3 salmons"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/t3q1VjbY5FZC-ZqAzqe-EA/168s.jpg", "caption": "Cucumber lemonade"}]}}, {"review": {"des": "This was our first time at Grand  Lux. We've heard such good things about this location. For any first timers Grand Lux is under the same umbrella as Cheesecake Factory. So the atmosphere is about the same. Very dim lit. Romantic setting. I ordered the filet, and it was cooked to perfection. We really wanted a shrimp cocktail appetizer but they only had fried shrimp. Overall the food and the service was good we stayed downtown so it was only a $5 Lyft ride away and in walking distance of other Chicago attractions. We will be back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pPI0I2L1Hr8F1htRbk9_RA/168s.jpg", "caption": "Filet minon Cooked medium, Mac and cheese and onion rings."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RdxoregHaeSnVy10wzb9mQ/168s.jpg", "caption": "Fresh hot bread before our meal."}]}}, {"review": {"des": "Came here for a weekday lunch. It's quite large so getting seated wasn't an issue. Although service was friendly, it was lacking and rather slow. It took several asks to get water refills. I ordered a honey latte that took about 20 minutes to find its way to my table. It came out with my meal. Soup of the day that I ordered ended up being not available. The Asian salad I ordered was large and quite delicious. The turkey club wasn't actually a club but just a regular sandwich. It looked fine and there were no complaints other than it wasn't a classic club. We were given the dessert menu right when we received our entrees which I found a bit aggressive but no big deal. I imagine the weekends are busy so proceed with caution. All in all, ok place for a bite.", "pics": null}}, {"review": {"des": "My first visit to the Grand Lux cafe and it did not disappoint. The wait was very short. About 10 minutes from when we got there.  We all ended up getting the crab cakes as and appetizer and it was okay. Me personally I am not a seafood fan but everyone else loved it. The waiter that we had was extremely nice and worked with us. My father in law wanted a sweet tea and they didn't offer it. So the waiter made him one from behind the bar which we all thought was extremely nice. <br><br>When we first ordered our drinks they instantly came out with warm bread and butter which was fantastic.  Once we ordered the food came out pretty fast. We ordered the bourbon chicken and avocado burger. Both were delicious.  The ambiance of great for all settings. And the customer service was great.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1HpJfJflRedBdJ_o2BJ8yA/168s.jpg", "caption": "Bourbon street chicken."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/U2fdgo27dvmws1LBy0lnhQ/168s.jpg", "caption": "Avocado burger"}]}}, {"review": {"des": "My sister and I treated my mom to the Grand Lux for her birthday.  She'd been gushing over how much she enjoyed the place the previous times she visited. My sister and I were first time patrons.<br><br>The decor is attractive and the staff was friendly, the food was mediocre at best. Nothing grand or lux about it. I felt  like I was eating at a regular Applebees type spot, maybe my expectation of the place was misplaced. <br><br>I would encourage those that are interested to at least go there once.  But I'd wager they'd share my sentiments and wouldn't feel the need to be a repeat customer.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Po2uNtkGoCeq9A7FmJPRHA/168s.jpg", "caption": "Chicken alfredo"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/p6ONej-yG7z_NLnhfjx4LQ/168s.jpg", "caption": "Salmon. Again ok tasting, on the bland side.  Green beans tasted like they were cooked in the microwave"}]}}, {"review": {"des": "We went on a 9-8-18 Saturday early afternoon 11:30am. It was 3 of use and knew we wanted Dessert but Food wise had to look at the large Menu. Of course we started with Drinks that make 4 drinks for 3 people.  Pineapple Smash, Tahitian Pineapple,  Mai Tai, Pineapple Margarita. We like Pineapple hahaha almost forgot Great time to go no waiting and our Service was Wonderful.  Now food to start 1, Thai shrimp &chicken Spring Rolls 2, Grand Fried Calamari &Shrimp with veggies 3, Tempura Green Beans, 4, Mini Crab Cakes 5, Warm Goat cheese Salad.  I think am missing 1 or 2 more!! After eating all of that we were to full for our Meal but not for Dessert  now 1st Box of Warm chocolate chips Pecan Cookies 2nd 2 Key lime pie,  Warm Brownies Sundae.  After that  2 cups of tea and coffee drink with Whipped cream topping. Almost forgot All the side sauces were Great.", "pics": null}}, {"review": {"des": "Seating was plenty as we went at 4pm. The waiter was decent nothing to write home about. Was friendlier once he received his tip by then our interaction was over. The bread they give you was super hard. I like crunchy bread but that was like eating a rock. It wasn't enjoyable to eat but I ate it because I was hungry lol. I order a full order of the southwest chicken salad. The portion size was good however it was all greens. Very little meat and beans and corn. On top of that the chicken was served cold and wasn't well seasoned , like it was prepackaged.Didn't care for that. Will not order that again and may likely not return!", "pics": null}}, {"review": {"des": "We were in Chicago on a Thursday night, and decided to have dinner at the Grand Lux Cafe. Parking is always a hassle downtown, so we opted for the valet ($16). Once inside we rode the escalator up to the dining room floor. It was 9pm, and there was no wait for a table of four. <br><br>Their menu is HUGE; so many options to choose from. I ended up ordering the Santa Barbara Chicken Sandwich (grilled chicken breast with bacon, avocado, and melted cheese on a grilled bun). Unfortunately I didn't get any pictures; the restaurant has VERY dim lighting, it was hard to see. But the sandwich came with fries, and it was very good. We also split a piece of cheesecake to celebrate my cousin's birthday. Yum! <br><br>Our total came out to about $22 a person, very affordable. Our server was really helpful and friendly. He consistently made sure our drinks were filled and asked if we needed anything. I would definitely like to come back during the day, and maybe try their brunch menu.", "pics": null}}, {"review": {"des": "It seems like I always just come across Grand Lux Cafe just about when I get hungry while spending a day in Chicago. The location is very convenient. The cheesecakes are phenomenal, of course. Their cocktails are very good too! My favorite food item so far has been the Asian nachos; that was a pleasant surprise! But the service can be a little slow sometimes.", "pics": null}}, {"review": {"des": "I've been here multiple times in my life but this last visit was my first time as a Yelper! Grand luxe is of the same company as Cheesecake Factory but the menu is wayyyy less extensive. We were a party of 14 on a Tuesday night. It was not busy at all. I arrived early and staff kept asking me if I had been helped and I said yes as it was true. They sat us when a little over half arrived. <br><br>Service: Our server was Mindy. She was nice but seemed a bit distracted even though it was really not busy. We kept waiting longer than needed to order things or ask questions. She was nice but I think a bit overwhelmed that night and it showed. Regardless, she did bring out a nice crisp treat for the lady of the Hour of our party which was very nice. For some reason she didn't automatically add the tip to our large group of 14 on the check. <br><br>The food: we had lettuce wraps, calamari, beignets and multiple other dishes. The ceviche was terrible and had no fish. The salads were decent. My sister didn't seem to love her fries cuz she left them alone but ate most of her burger. <br><br>Ambiance: great. Romantic and lovely. <br><br>Overall, I would say 3-3.5 stars but I rounded up because overall we all had a good time. <br><br>I don't plan on coming back but only because I think I hit my cap for this place. Definitely give them one chance!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZRdfSpmmW0AEUuzSdJ-09w/348s.jpg", "caption": "M"}]}}, {"review": {"des": "Being a chain, I wasn't expecting much from grand lux. I was gladly dead wrong.  Some friends were visiting from out of town and were tempted to try this place as it was so close to their hotel.  With 7 girls with very different tastes, there was something for all of us - very hard to do.  I had the Indochine chicken and shrimp and it was kinda sorta really good.  Something I would expect from an Asian fusion place in wicker. <br><br>Like others have said, portion sizes are large so if you're a big eater or are just famished like I was this place is perfect.  It's great for groups not just because of the varied menu but also because of layout/table sizes.<br><br>For those of you with a crew, this place seems like it would work with the kiddos as well.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3-bjS5rruVoge0nKU4Hqhw/348s.jpg", "caption": "Their salad portions are big enough for dinner #winning"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fhttKj4rkEgwA7SltJnQUw/168s.jpg", "caption": "Indochine chicken and shrimp, stellar"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/59Wk5SODF8FvGjFn4OMkwQ/168s.jpg", "caption": "Fettuccine alfredo, not bad"}]}}, {"review": {"des": "Like the name, this is a grand experience.  I was a little leery at first, knowing this was related to the Cheesecake Factory (and I try not to eat at places that I can eat at home), but was impressed with the restaurant.  While the design is similar to the Cheesecake Factory (which I have always thought was well-done), this is a different enough experience that will make it worth your time.  In addition to having a view of Michigan Avenue, the service was wonderful, and the food even better.  Please be sure to save room for dessert, as you will not be disappointed.", "pics": null}}, {"review": {"des": "The garlic shrimp pasta I ordered was the best pasta I had so far! I love it! Not to creamy to me, and the garlic flavor was perfect! <br>The starter we ordered was also great! <br>Great restaurant!", "pics": null}}, {"review": {"des": "I just love this place. Pleasantly surprised because this is a chain restaurant. Food presentation is always excellent and everything I have tried has been great. You get a more \"fine dining\" feel considering it's a chain place. This location is Chicago is huge. A few items I've had are fish n chips, stir fry and a Mexican type salad. I would recommend this place. It's even kid friendly despite the regal decor and dim lighting. They have a kids menu and bring out crayons. They have a bakery full of treats too. Reminds me of Cheesecake Factory. I had the best French toast, made withbrioche bread. A must try!", "pics": null}}, {"review": {"des": "Grand Lux is one of my fav places to come and eat. The whole ambiance of this place is amazing. The staff has always been so attentive and professional. No matter what I have ordered the food has been delicious. The plate sizes will not disappoint you. <br>The  view from the window gives you a overlook of Michigan Avenue. <br>Depending on the day and time. It can get quite busy and the wait can take longer to get a table. But it is well worth the wait<br><br>Grand Lux is an amazing place to eat with great service, nice size portion of food, drinks are tasty and the environment is always welcoming and warm.<br><br>The prices to dine here is comfortable for your wallet depending on what you desire.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jZ7kkMdd3XUe80wdbR72RQ/168s.jpg", "caption": "Carmelized Chicken & White Rice"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/E06QKNAkMhEeM10-lsy9tw/168s.jpg", "caption": "The View From The Window"}]}}, {"review": {"des": "Okay, the food I ordered was Pasta pomodoro which was okay. My partner ordered a lemonade and molten chocolate cake as he wasnt hungry. The lemonade was forgotten about and the waiter apologized. The cake was partly burnt. Now, I am a vegetarian or vegan, so food being bad doesnt really flip me. But they also managed to mess up the bill. We were charged for a cheesecake worth 10$ we had never ordered nor eaten. So I think it was a bad experience was us.", "pics": null}}, {"review": {"des": "Took 15 minutes to place our order, 15 minutes for a tequila on the rocks (mind you we're even sitting at the bar) and another 35 minutes from time of ordering for food to come. If you have 50 minutes to wait for food to arrive then this is the place for you. And if you like cold food.", "pics": null}}, {"review": {"des": "The hostess staff was amazing and incredibly welcoming. My waitress was nice enough but my pasta made me and my cousin sick. We both order the garlic shrimp pasta. I asked for no Parmesan and my cousin has hers with but our meals looked different. My shrimp was breaded. My dish was incredibly oily and flavorless. The oil made me nauseous. I barely touched my dish but server simply offered me seltzer. How about you offer to take this sickening dish away. My cousins pasta dish made her nauseous too! I just think it was too oily. I wanted pasta because I was running a half marathon the next day but instead I ended up feeling awful before and during my race. The calamari appetizer was decent.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/80EwZqemLixyWDmCNIMzyA/348s.jpg", "caption": "Do you see all that oil! Ugh!"}]}}, {"review": {"des": "For as long as I could remember, I wanted to come to Grand Lux Cafe. Just walking down Michigan Avenue and seeing people eating through the windows on the second floor made me envious. I wanted to eat in the restaurant that had the view. Yet, I never stopped in. Finally, after 8 years of living in Chicago, the opportunity presented itself to finally grab dinner here with some friends. <br><br>It's gorgeous inside but it has serious Cheesecake Factory vibes, especially the moment you get seated with by a waitress. We hadn't even chosen our seats but the waitress was encouraging us to order their \"baked to order desserts.\" <br><br>The menu is huge which is almost a letdown - I dislike restaurants that have huge menus because I feel like I end up regretting my choice since there were so many options that sound equally okay. Nothing jumped out at me which means everything was an option. <br><br>I ended up ordering the Mendocino Salad -  grilled chicken, avocado tomatoes, corn, dates, goat cheese, and croutons with lettuce. It was disappointing. They definitely forgot the avocado, they might have forgotten the dates too. I would've complained except the waitress never really came back. Except to peddle the baked to order desserts - my table declined. They also were out of a ton of the pasta options my friends were planning to order - which is incredibly disappointing when you're there at 6:30pm.<br><br>Then once we asked for the check, it took her forever to produce it - like maybe 15 to 20 minutes. <br><br>Honestly, I wouldn't plan on coming here again and I can't recommend it to anyone. It's overpriced, you'll wait too long for a seat, and everything is mediocre. I did enjoy the blood orange soda I ordered with my meal - but for $4.50 I wouldn't get it again.", "pics": null}}, {"review": {"des": "Grand Lux Cafe seemed like a somewhat generic classic upscale-ish cafe, and being the chain-skeptical millennial I am, I was not particularly impressed by the plain-sounding name and the fact that there are multiple locations. But the boo was interested for its French toast, so we decided to check it out. (Besides, it's hard to imagine anything going too wrong with a posh brunch)<br><br>We arrived around 9:30 on a Sunday morning, and all the window seats were already taken. Even though it's a large place, it looked like a bit of a wait when we left around 11. As implied in the name, the setting is quite grand with tall ceilings and ornate details, reminiscent of the ambiance from places in Vegas.<br><br>When the boo ordered his much-anticipated French toast, the server talked about how it was a favorite, with a layer of custard between the thick brioche. Unfortunately for all the hype, the manager walked up to our table after awhile and apologetically announced that there was no French toast whatsoever--apparently the batch was just all falling apart and there was no way they could serve it. What was equally saddening was that some other tables had managed to get their orders in prior to the disaster, so we watched the few precious last plates of French toast brought out.<br><br>The French toast fiasco was a disappointment, especially since it was the main reason we came. However our server did do a good job handling the situation, not only offering a consolation prize of anything we wanted on the house, but also ensuring that it was served to us promptly. <br><br>Boo chose to get the fried chicken and waffles, which was good but nothing mind-blowing. The chicken strips were remarkably crunchy, the addition of pecans was nice, and I liked the fluffiness of the waffle, but it fell mostly in the above average range in the chicken and waffles I've tried in my lifetime.<br><br>I was satisfied with my egg white omelette, which came with a choice of 4 toppings (I chose mushrooms, asparagus, goat cheese, artichokes). It came with toast and hash browns, which was a delicious crisp sheet of shredded potatoes fried to a perfect golden-brown. <br><br>Most entrees are $14, which is reasonable considering that portion size is decent and the setting is classy. I would recommend coming early to snag an extra swanky seat on the sofa chairs next to the tall glass windows (and to hopefully get the French toast before anything goes wrong).", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IeH_0hSaDakqwWP0zODX6g/168s.jpg", "caption": "Chicken and waffles"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/af0OE0H2V9JOKPTnetUzFQ/168s.jpg", "caption": "Egg white omelette"}]}}, {"review": {"des": "The look, feel and menu of this place all resemble that of a Cheesecake Factory restaurant. The staff was welcoming and I was able to get seated right away on a Wednesday night but I heard there are usual long lines. The AC was cranked up to an uncomfortable level which made you want to leave soon. Our waiter came and asked us what we wanted to drink and I asked for water with no ice and yet he brought ice filled water. The food was standard American and it was okay but nothing amazing. I got the 3 different styles of Salmon which came with the mashed potatoes and green beans and my friend got the shrimp appetizer which was also okay. I also ordered a latte at the end and it was way too sweet and I asked for more espresso which just made it worse and it was just a mess of burnt coffee and lots of syrup.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4s7zu4ukPBrQYOi8rjV3PA/348s.jpg", "caption": "3 way salmon and shrimp appetizer"}]}}, {"review": {"des": "Get's busy on the weekends; however still one of my favs!<br><br>Large restaurants enough space for large parties. Service and staff are stellar. And the food is always good. I have never had a bad experience here.<br><br>One thing that can drive you crazy is all the amazing options on the menu. Come prepared to eat (or drink). And be ready to order more than you actually  can eat!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/a7WNgdZMfEaSJkwAg-eKzA/348s.jpg", "caption": "Ahi Ceviche"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/owsQIniGemWx9lTTuCtD_A/168s.jpg", "caption": "\"Hot Toddy\" for 15 degree day!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/U6XnRL9Etrv11K3DD_GRLw/168s.jpg", "caption": "View of Michigan Ave from table..."}]}}, {"review": {"des": "This is a must stop for us everytime we're in Chicago! Service, good presentation and quality of food always impresses!", "pics": null}}, {"review": {"des": "7/1/18 Spicy Mule to die for. Calypso Mojito very good, as well. Incredible style and upbeat vibe. Asian nachos are outstanding. Crab cakes just okay.  Waiter was very attentive.", "pics": null}}, {"review": {"des": "So, I was in Chicago looking out over the skyline from my 36th floor room and saw a rounded building with the name Grand Lux Cafe lit up.  I googled it, looked at the menu and said, \"what the hell, the place looks as interesting as any place I'll try!\"  <br><br>I stopped in for lunch and it was so damn amazing, I went back the same night for supper!!!! Now that's crazy, but I did exactly that!<br><br>For lunch I had the Pasta Pomodoro - <br>Spaghettini Tossed with Sauteed Tomatoes, Fresh Basil, Tomato Sauce and Parmesan Cheese.  Just look at the attached picture and lean into your computer and inhale as hard as you can...I'm sure you can smell how amazing this dish was!! <br><br>Now, to be honest, I rarely have desert, and never had it for lunch, but I went all in and had the Warm Rustic Apple Pie. <br><br>Baked when you order it! Flaky Sugared Crust Filled with Fresh Apples and Topped with Vanilla Ice Cream and Caramel!  Holy hell!!!!! It was off the hook.  I can't believe I did not have the restraint to take a pic of it.  I just jumped right in.  <br><br>I loved this place so much, I brought my daughter there for supper later in the day.  My daughter had the dinner portion of the Pasta Pomodoro I had for lunch and she raved about it.  <br><br>I had the \"Nashville Hot\" Chicken<br>Crispy Fried Chicken Breast with Their Very Spicy Nashville Hot Sauce. Served with Mashed Potatoes and Green Beans<br><br>Again, look at the pic and smell its magnificence!! <br><br>A great restaurant, with an incredibly beautiful eccentric atmosphere and fantastic wait staff!  It's a chain that started in Vegas and continues to grow across the country, so find one and try it!! Tell them Nick sent you!!", "pics": null}}, {"review": {"des": "Beautiful restaurant great atmosphere but we had a terrible waiter. He brought my family and I the wrong food on purpose and told us to fix it however you like, our waiter was rude and very unprofessional. My first time at this restaurant was terrible but I will say they have great French fries and good spicy ketchup. Oh the manager was very nice my family and I didn't eat our food but everything was free and the manager gave me a four layer red velvet cake on the house", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AuMredNnvUK4qFqhiq7TNQ/348s.jpg", "caption": "Four layer Red velvet cake"}]}}, {"review": {"des": "my husband and i dined here for lunch on a saturday afternoon. it wasn't very busy, and we were seated right away. this place is huge and part of it overlooks the busy michigan ave shopping scene.<br><br>we both ordered sangria and it was great! if you order it i recommend eating the fruit out of the drink because it will give you a nice buzz! it comes in a tall skinny glass and was perfect for a hot 85 degree day. for lunch i ordered the club sandwich, which was nice and fresh and not too heavy. their fries that come with it are very good and were served piping hot. my husband got the buffalo chicken sandwich and thought that was pretty good as well. the only thing we didn't care for was their ranch, it was very buttery and appeared to be a pepper corn ranch? it wasn't bad, just not what we are used to. service was pretty slow considering it wasn't busy, but i'd come back because the menu here is huge. they also serve brunch on the weekends!", "pics": null}}, {"review": {"des": "Made a trip over to Grand Lux Cafe knowing they were owned by the Cheesecake Factory. The Cheesecake Factory is my ultimate favorite restaurant. I love the massive servings and menu they offer (Thank god I don't live by one or I'd be 3 times my size). I was hoping that Grand Lux Cafe would be the same.  <br><br>When walking in I was told the wait would be about 30 mins. We ended up only waiting for about 10 mins so that was a pleasant surprise. The menus were huge like the Cheesecake Factory I was happy to find. To drink I ordered the Pineapple Basil Mojito which was so incredibly good. So pleased with that choice. To eat I had the Fuji Apple Salad with chicken and I was disappointed. It was very apparent that the salad sat out for a long time before being served to me. The chicken on the salad was no longer warm at all and the rest lacked flavor. I don't recommend this salad at all.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0cnsXpoy9CRmxfVa5jkLRg/168s.jpg", "caption": "Pineapple Basil Mojito"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/hy0klBwhVLM_7R0-dB9d2A/168s.jpg", "caption": "Fuji Apple Salad with chicken"}]}}, {"review": {"des": "This place has really gone down in quality. It used to be a decent place for an acceptable downtown dinner. Over hyped food with everything over salted, overcooked, and burnt.", "pics": null}}, {"review": {"des": "Everything was delicious! We had the shrimp scampi (which came with extra sauce) and also the short rib ravioli! Everything came out hot and correct. The short rib could have had a lil bit more meat but over it was very good. I would definitely recommend", "pics": null}}, {"review": {"des": "I saw Grand Lux before and always expected it to be expensive, but was pleasantly surprised to find out it's more like a Cheesecake Factory with a good view.<br><br>I saw others reviews about the service and I think it varies by server. We happened to get Mimi who was great! We asked for both food and drink recommendations and everything we got was delicious. Definitely try the Pineapple Basil Mojito - it sounds like a weird mix, but the Basil really complements the pineapple. We also tried the Moscow Mule which was pretty gingery but also good. We both agreed the Mojito was better.<br><br>They start by bringing out fresh bread. I usually don't eat very much because I don't want to fill up on it, but their bread was so good I had two pieces! It was fresh and soft on the inside, but crispy on the outside. Yum!<br><br>Food wise I went with the Asian Chicken salad after asking Mimi for a recommendation between that and the avocado chicken salad. I wasn't disappointed! The salad was the biggest one I've ever been served. The dressing was evenly distributed throughout the salad. It was crispy from the Sugar Snap Peas and the Crisp Wontons. The chicken had great flavor and the dressing tied everything together.<br><br>We also ordered the Sunday Night Pasta - the portion was once again impressive. The meat was tender, juicy, and flavorful. Everything in the dish worked together well and we thought it was delicious!<br><br>To end the meal, we tried the Molten Chocolate Cake. Make sure you order 30 minutes in advance! This cake was the perfect portion for two people and was rich; the ice cream helped to balance it out. <br><br>All of our food came out fresh. Mimi was great with not only her recommendations, but she was always floating around close by when we needed her. Definitely ask for her when you visit :)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/msbfO6FwYNyU4XKwlt7b1w/348s.jpg", "caption": "Molten Chocolate Cake"}]}}, {"review": {"des": "I love the Grand Luxe and was happy to have had my first meal in Chicago in some time here. It's right down the street from my hotel on Michigan Ave here on the Maginificent Mile.<br><br>I wanted to order one of everything here, but since that's impossible, I went with the Luxe grand burger with fries.  My server was awesome and I wish I could remember her name.  Regardless, the food was good!<br><br>Even though I was eating lunch at a random time, the place was rockin busy.  I was seated right away, but my poor server was working a lot of tables. She was super professional, and got me everything I needed.  After I placed my order I was given a basket of bread with butter to snack on. The only down side was that the butter was super cold and it wouldn't spread.  blah!<br><br>Also, the interior is super cool, and I secretly wanted to eat on the circular area, but all the seats were taken.  Menu was loaded with good stuff, and I really did have a hard time deciding. Overall a really good meal, and I'm glad I came to eat here!", "pics": null}}, {"review": {"des": "Originally went to baptiste and bottle but told they were not serving dinner and had limited menu<br> The server/hostess recommended grand luxe cafe <br> Upon walking in noticed it looked like Cheesecake Factory, so already had doubts<br> Our server was very nice but the food was like chain restaurant, made in huge portions, not made to order<br> My husband ordered Salisbury steak<br> It was so salty, he couldn't eat it<br> Our server kindly removed from check<br> The calamari was served with cocktail sauce<br> I had eggplant fritters which later upset my stomach <br>I was hoping for nice upscale dinner so I was very disappointed<br>Our server said a manager would be over <br>We received the bill and paid but still not see the manager <br> We waited a long time for everything", "pics": null}}, {"review": {"des": "Very gorgeous place.  The design and decor of this place is just beautiful.   They have a huge menu of lots of items to choose from.  Food was pretty good.  Very fast service.  This restaurant is on a second floor.  I would think they would have an elevator if you need one but I did not see one.  Also they had an escalator in case you can not make it up steps.", "pics": null}}, {"review": {"des": "A wonderful restaurant to go to if you want the experience of a downtown restaurant while not really paying those downtown Chicago prices.  Perfect place to take guests and family; kid friendly!<br><br>The menu has something for everyone! From steak, pasta, chicken dishes, to sandwiches and salads. Huge portions, by the way! Its always very good and tasty.  <br><br>It is very pretty inside with marble floors and the high booths. My favorite booth located right next to the window overlooking the Magnificent Mile.<br>I am always happy with the service that I get and they have fantastic servers.  My kids love their cucumber lemonade!", "pics": null}}, {"review": {"des": "I can't wait to come back! Prior to last weekend, the last time I was here I was a young girl. But my Mom and I had brought my nephews downtown to see the museum and figured they'd enjoy having dinner overlooking Michigan avenue... overlooking all the lights, and cars, people. We had a WONDERFUL time. <br><br>It was a Friday evening, and so we expected we'd have to wait a bit. They said about 30-45 minutes, and so we accepted. Luckily it didn't take even 30 minutes, so that was great. <br><br>We got a fabulous spot in the round room overlooking Michicgan/ontario(?) in a nice big comfy booth. <br><br>The menu is quite large. there is soooo much to choose from. I was happy with my selection. The absolutely best part of our meal was dessert! it was TO.DIE.FOR. I got the \"warm butter cake\" and I've been dreaming about it ever since. <br><br>Pro's:<br>- AMAZING waitress (wish I remembered her name!!)<br>- fabulous spot / comfy booth<br>- Huge menu, something for everyone<br>- wait was tolerable<br>- food was delicious<br>- dessert was amazing<br>- ambiance is fun<br>- didn't feel rushed<br><br>Con's:<br>- There was something uber slippery all over the floor literally from the upstairs bar all the way to bathrooms. It felt like baby oil on the floor<br>- Cost: it was pretty expensive for the 4 of us. Granted we all got dessert, too. but still it's *not* cheap!<br><br>Overall we had a really nice time here. We were able to just sit and enjoy each other's company in a fun ambiance and not feel rushed. I can't wait to come back. <br><br>I highly recommended. Definitely a little touristy, so if you're looking for something a little quieter/tame, this is NOT your place. <br><br>Thanks for the nice time Grand Lux Cafe!!", "pics": null}}, {"review": {"des": "Phenomenal. Food, decor, menu options, and service were all great. The waitress was what made our experience so good, she was knowledgeable, helpful with the menu, and her explanation for the restaurant was so great, it made us keep room for dessert! I wish I knew her name because she deserves recognition!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZH6EeF3yXGdrl0lNIkhtyw/348s.jpg", "caption": "Butter Cake"}]}}, {"review": {"des": "I'm a old veteran of this restaurant, Sweet memories I was reminded of when I recently visited.  There isn't a picky eater out there who won't find something to eat here. There is soooo much to pick from.  <br><br>Typical tourist spot but local favorite as well.", "pics": null}}, {"review": {"des": "I ordered an Asian Chicken Salad for delivery. They delivered it with NO chicken. How is a lettuce salad worth $15? Would not recommend delivery from this place.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pRATXwskrygI5TzYGeoylQ/348s.jpg", "caption": "Asian \"chicken\" salad; except they delivered it without any chicken? Would not recommend."}]}}, {"review": {"des": "After a lot of over hearing conversations about this place, I decided to check this place out. We had a few hours to do whatever before a Cubs game. Sadly we might of been a little under dressed with Cubs T-shirt and a jersey but whatever. They did sit us at a bar so maybe that had something to do with it? All joking aside....<br><br>The server was very friendly and asked if it was our first time. We said yes and he took the time to explain the menu and how everything could be alters due to allergies and what not. Also, the desserts take about 25 minutes so we should look at it now so the wait after dinner won't take forever. Besides, by seeing the Cubs clothes and the time, I think he knew we were going to the game in a few hours. I did like our server. I think his name was JR?<br><br>I decided to order the Beef Wellington. It came with roasted carrots and fried brussel sprouts. I do not like Brussels Sprouts but they were delicious and I think besides the Beef, it was the only thing I finished. The Carrots were nicely roasted and it came with 3 scoops of mashed potatoes. The Beef Wellington came out with 4 medallions, duxelles (mushrooms) and topped with a puff pastry. No wonder the it came out fairly quickly. The meat and the food was nicely seasoned and it was delicious. <br><br>My girlfriend has the Short Rib grilled cheese and added a salad instead of fries. She seemed to enjoy her meal and ate almost all of it. The drinks were amazing. I ordered a pina colada and this place has maybe the top 3 best I've ever had. <br><br>Overall, I can see the hype about this location. It hit all the right notes with great and friendly servers, a nice location and very nice view. Great food and great drinks. I am sure I will be back very soon.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/udtOSVXjmCRlMmQjOYvUvQ/168s.jpg", "caption": "Beef Wellington. Brussel sprouts, mashed potatoes and roasted carrots"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WVtQbyIHB-z3gpW1ZWl62Q/168s.jpg", "caption": "Short rib grilled cheese with a salad"}]}}, {"review": {"des": "At Grand Lux Cafe on a Sunday night, we arrived here at 7pm, still dont have food and its 8:46pm. lots of empty tables, dont come here!  Plus the menu is typical family food nothing to brag about.", "pics": null}}, {"review": {"des": "This review is just for the dessert menu. <br><br>Having heard my friend tirelessly boast about the MOLTEN LAVA CAKE here and how it would change my life, I finally tried it...twice!<br><br>Exceptional! it is seriously as good as a molten lava could ever be. Sweet but not too overpowering, wonderful texture with crispy covering and gooey good quality chocolate center. Comes with vanilla ice cream.. perfectly complimenting the hot magma core..couple berries to cut off the richness in between. <br><br>Creme brulee was delightful as well. Had the snap of the bruleed sugar crust and not too thick of a custard base..just right!<br><br>Neat presentation..consistent quality, took a while to get to the table which shows it was freshly baked. Note each dessert is good enough for 2 people (be willing to sacrifice the last bite for your lady)<br><br>Both times the service has been great, Shout out to Shanon! Pleasant, attentive and courteous gentleman. <br><br>The interiors are mesmerizing, like a fantasy get away.. high ceilings, delux marble decor, moody chandeliers.<br><br>Yet to try the dinner menu, not sure if too hyped about it but will def return for some dessert indulgence!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7d8KZ8vdMjSDx7wwl-sfbw/348s.jpg", "caption": "Molten lava cake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IY_zsIQVCelFAGUA5yxYYw/168s.jpg", "caption": "Creme brûlée"}]}}, {"review": {"des": "Went this evening and waited with lots of other people only to get a salad with bad lettuce I stopped eating and should have spit out the bite because I'm now up sick.<br><br>Kids pasta was a giant bowl of spaghetti so big in a glass plate it's like they've never served kids and her ice cream sandwich looked like they microwaved it with the ice cream on the cookie and was everywhere.", "pics": null}}, {"review": {"des": "If you get a seat near the window you're in luck, the view of Michigan Avenue is great from above. <br><br>They have a smaller more manageable menu than Cheesecake Factory, their affiliate. I got salad with pears and strawberries, very good. You can fill up on the appetizers too, or just get those. Not a fan of sourdough bread so I skipped that.<br><br>If you have time and order early get the doughnuts and sauce! I liked the carrot cake too.<br><br>Service is fast and friendly.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qn3-0nWMGzXssZHJbfLUqA/348s.jpg", "caption": "Kinda dark but decorative"}]}}, {"review": {"des": "My daughter birthday today<br>I wish we hadn't come here<br>Today there was not wait<br>That was the only highlight we got a nice table <br>Michigan ave view<br>Our buffalo chicken appetizer was cool when it arrives<br>Strike one<br>My hubby steak has zero taste and was very served in a very large dish for the illusion I guess<br>My daughter has Asian fusion dish with white rice sauce one the same and it still was not good too many twists and turns on one plate<br>My food I always get the same thing bbq salmon cedar plank overcooked ugh<br>I give up<br>Our drink Sangria and margarita Grand Lux edition , nothing but ice <br>I feel robbed and I didn't foot the tab my hubby did<br>The Birthday free treat was only whip creme and wafer <br>Thankful we order beignets,  undercooked the waiter said that how they are server<br>Undercooked ok please excuse me I didn't know that<br>He removed it off the bill<br>Thankfully I took my daughter to Cali last week for precelebration cause this was not a good choice", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EWAs00Wza1Gt3LanRgYAKg/348s.jpg", "caption": "Bbq plank salmon"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1Tv2T6VO8eYoFDeJtYpR0A/168s.jpg", "caption": "Food fusion Indian meets Chinese"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hxfU2fUzv9GjG0j_W6nJXA/168s.jpg", "caption": "Flank steak"}]}}, {"review": {"des": "The grand lux is a beautiful restaurant with plenty of space. I love that we arrived on a Friday night and were seated right away. I had the avocado chipotle cheeseburger, and it was delicious. My friend has the chicken wings and said that they were okay, but the molten chocolate cake was divine. The bread was okay, but the portion was a bit large.", "pics": null}}, {"review": {"des": "I really can't say enough great things about Grand Lux Cafe.<br><br>I bring groups here at least once per year and for the past 2 years I've worked with Michelle when it comes to using their banquet facilities. I appreciate that I get to work with the same people year after year. It makes the experience that much better. They remember you.<br><br>Food and service are top notch every time we visit. Jeremy, the banquet captain, is outstanding. He's the real deal when it comes to customer service in the restaurant business. At times I've had demanding guests with me and he handles them so well, without getting disgruntled or put off. <br><br>Large menu to choose from with packages set at a variety of price points. We always visit for lunch.<br><br>I highly recommend Grand Lux for your private party needs.", "pics": null}}, {"review": {"des": "Delicious !!!!! Went for dinner on New Years Day and got the chicken piccata. Went back the next day for happy hour and got the buffalo chicken egg rolls with a Long Island. So good !!! I can't believe this place wasn't over flowing with people. Happy hour is between 4 and 6 during the week and they have great deals. The long islands and the chicken egg rolls were $5 each... you can't beat that especially considering the quality ! I wish we had one in Indy!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qOgAJ6LP2-5lA6By_iuh4g/348s.jpg", "caption": "Happy hour Long Island"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-P4s8EopmHhQ9ea_81ksjg/168s.jpg", "caption": "Buffalo chicken egg rolls .. so good !"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XjohWzRPQjnFu8FfrPh4CQ/168s.jpg", "caption": "Buffalo chicken egg rolls ... so good !"}]}}, {"review": {"des": "Great dining atmosphere. I ate at the bar since dining alone while on a business trip. I did have a little wait based on arriving at prime dinner time. Staff is friendly and food was good. They have an excellent menu with a wide variety of choices. There was also a wait for regular dining. It appeared to be a good place for celebratory dining. I really enjoyed my Asian flair salad and crab cakes. They have good bread and butter. They also had Moscato. The only restaurant I've been able to find it since arriving to Chicago", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sfeZ7LLqq2yt4BU1QMNYRA/348s.jpg", "caption": "Yummy and very filling salad!"}]}}, {"review": {"des": "We were told the wait is about 10 mins, but we actually waited for about 15 minutes <br>It reminds me of cheese cake factory in LA, same type of service and the waiting, and the design of the restaurant.<br>The service is just alright, nothing great, nothing memorable. It's missing love and hospitality, we encountered few staff, none of them showed warm and welcoming environment. They need to work on their people skills.<br>But the good thing is the location, right on Michigan Avenue, and they do have a nice view it you are sitting by window overlooking the street of Michigan Avenue.<br>Great food, I say it's worth the wait and it's big portions. <br>The bread is good too. So if you're planning for a dessert you may wanna save room.<br>Unfortunately my husband and I are full after we ate the entree, there's no room for the dessert <br>I'm happy we came here, somebody recommended this place to us.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-W7uFSctTvt9dnRBhY2myA/348s.jpg", "caption": "Salmon"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8E09oiH08K3xOi90fEYwEw/168s.jpg", "caption": "Southwestern salad"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/C3p9jG0Uz0UjcC_Z1GbZoQ/168s.jpg", "caption": "Fried pickles"}]}}, {"review": {"des": "I have eaten at Grand Lux Café many times, but I will certainly not return. I went for dinner with twelve friends on a Tuesday evening almost two weeks ago. Our server was excellent and the food was good. The next day I looked at my bank app, and I saw that I was overcharged by $14. My friend had left the entire tip for the two of us on her bill, but they put the tip on my bill. I called and spoke to a manager, who told me that Rosa, the business manager, would call me the next day. I waited, but she never called. <br><br>When I called late the following day, the manager, John, told me that Rosa was gone for the day, but that the other manager should have never told me that she would call. He also said that they would have to take the money from our server. I told him that would be inexcusable, since he was very attentive. He then said that it was their error and it would be taken care of. <br><br>When I still didn't receive the credit a week and a half later, I called again. I spoke to a manager named Tony, who was very nice, but he told me that I would have to speak to a higher manager. I had already wasted an inordinate amount of time on this matter, which should have been rectified immediately. The next manager was Robert, and he was beyond rude. He told me that he thought that they handed it over to the corporate office, and he didn't know if I would get the refund. He absolutely could have cared less.<br><br>I will certainly not return to this restaurant, and I hope other people will think twice about spending money at a place that where some of the management don't know procedure, and another is downright rude.", "pics": null}}, {"review": {"des": "Sorry, massive portions can't compensate for mediocre quality.<br><br>On both of our mid-week visits we were immediately seated in the main lounge, along the wall nearest the kitchen entrance. Our waiter was super-attentive, but not hovering - he ripped through the daily specials, reminding us -over and over and over- about the \"massive portions, just like our sister restaurant The Cheesecake Factory..\". (Well, that explains everything!)<br><br>The restaurant itself is huge, featuring high ceilings and deep, rich red décor -  despite two walls of floor-to-ceiling windows, the place is amazingly dark, even at mid-day. And pack a sweater - even during the summer, the place swings from being chilly to downright cold. <br><br>The $16 Chicken Pot Pie came to the table in a massive yet shallow bowl, covered in a thin, browned hubcap of tough, overworked pastry dough. The white meat chicken itself was plentiful, shredded into long strips, but glued together in a flavorless béchamel sauce, occasionally dotted with green peas and undercooked cubes of white potato. The crème brûlée-like lid had to be lifted off the flour-y concoction hidden underneath since a fork and knife only sent the ceramic bowl sliding across the super-slick marble-topped table like a hockey puck on ice. <br><br>The \"deconstructed\" Bento box of steak au poivre ($16) came on four square plates that took up more than a quarter of the acreage on the table - the mixed green salad was wilted and watery (and was left, untouched), the parmesan dusted frites were crisp, the creamed cauliflower soup was super rich and flavorful, as were the peppery steak bites, despite being cooked past the medium-rare my wife ordered. Again, the plates seemed to hover across the slick tabletop every time she tried to cut her steak bites, so she opted to place her napkin down to dampen the movement.<br><br>We ordered a $8 slice of Red Velvet Cake to go and truly enjoyed that while people watching at the park in nearby Streeterville.<br><br>All total, a whopping $50.00 (with tip) for an O'Charley's-like supper club offering.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/f_NV3cLG8tQmYwN7Ih3D2A/168s.jpg", "caption": "The $16 Chicken Pot Pie in a flavorless béchamel sauce under a browned hubcap of chewy pastry dough."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2xRw6nGbytnqpxKnC9ltGg/168s.jpg", "caption": "Four plates of “deconstructed” Bento box ($16) that skidded across the table like curling stones"}]}}, {"review": {"des": "With a dining area that can only be described as Cheesecake Factory-esque, including warm tones, plush seating, and expansive seating areas, the romantic rotunda seating overlooking Michigan Ave is prime real estate. This place came highly recommended for having an Americanized worldly menu. We spotted the rotunda from below, requested a table there, and surprisingly got a center table right away on a Thursday night.<br><br>There really is something for every tastebud here. I loved my salad - so much so that I dared vote to come back for dinner the next day. I was outvoted but I will be back. I only wish I knew about this place years ago since we must've passed it countless times. The prices, right and the portions, big.<br><br>5 of us split the beignets for dessert. Amazing! Three different sauces and they were made to order!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OWRXrPn_yOrWFG5OmlY1yQ/348s.jpg", "caption": "Chicken and Avocado Grand Salad"}]}}, {"review": {"des": "We were visiting from Canada. The Grand Lux came recommended. I am glad we followed up. We went twice for lunch. Affordable, good food, and really great service.", "pics": null}}, {"review": {"des": "That was my first time at Grand Lux Cafe, after so many times at The cheesecake Factory.<br>It was a great experience!<br>We had Double Stuffed Potato Spring Rolls as an appetizer. O-M-G!!!! That is a must!<br>My entree was the Cafe Beef Wellington. Cooked to perfection! I ordered mac n'cheese as one of my sides but it was forgotten by the kitchen, immediately the manager brought me what was missing, super apologetic! One of the best mac n' cheese EVER!<br>My friend had Shrimp Scampi and it was also amazingly flavorful! <br>Drinks are a must there (if you are over 21)! I had Passion in Paradise and my friend had Mai Tai. Difficult to tell which was better!<br>Dessert? No room left for it, unfortunately!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TsJqu0MDm37NzUizTO3V-g/348s.jpg", "caption": "Cafe Beef Wellington + Shrimp Scampi"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KOSEvFQ25wt42JJnyRam4g/168s.jpg", "caption": "Shrimp Scampi"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/S_QeSd2B7w9neMu5xB7apQ/168s.jpg", "caption": "Cafe Beef Wellington"}]}}, {"review": {"des": "The worst restaurant experience I've ever had. After waiting patiently for our table, the waitress picked up two menus and started walking to a table. We followed her and then she asked my Date where I was. I was behind her the entire time and she said \"I was looking for you.\"  Totally bizarre. Then when I asked the waiter what vegetarian options he recommended, he proceeded to list the top 5 meat based options. Again, bizarre. We both ordered the veggie burger which was hands down the most disgusting veggie burger I've ever had. The patty was dry, flavorless, and left us feeling nauseous. The French fries were cold/rubbery and you could tell they've been left under a heating lamp for a long period of time. Don't come here if you're looking for a decent meal in downtown Chicago.", "pics": null}}, {"review": {"des": "This is a good, basic restaurant. It looks and feels like Cheesecake Factory... not that that's a bad thing...just trying to give you a perspective on what to expect.<br><br>Reasonably good quality food, very ample portions, at fairly inexpensive prices.<br><br>Very large, cavernous dining rooms, and thus very noisy.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lOKsBDaTOn5o2sp4Kdn5MQ/348s.jpg", "caption": "House salad."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/74yhgAQCQ43_cF5qxPXK8w/168s.jpg", "caption": "Dessert case"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gcaCbJSAAkw5WkJBpAZ3Sg/168s.jpg", "caption": "Kitchen staff"}]}}, {"review": {"des": "What can I say about Grand Lux that hasn't already been said? This restaurant is incredible. Owned by the same company as Cheesecake Factory. However I prefer Grand Lux Cafe. The menu is extensive and everything is delicious. <br><br>This is a large restaurant and it overlooks Michigan Avenue. If you're lucky enough they will sit  you in the best area/seat in the house - the circular bay area overlooking Michigan Avenue. I have been fortunate enough twice to sit here!<br><br>The staff is very friendly and accommodating. The restaurant is a really good size,  and they have a great bar area. The menu offers several different types of cuisines. They have a limited dessert menu but you still can't go wrong. They still have an incredible dessert selection.<br><br>During normal dinner hours this place will have a very long wait. You walk in and the hostess stand/waiting area is there, then you have to go upstairs to the restaurant and be seated.<br><br>This is one of my favorite restaurants in Chicago. I try to come here every time I visit Chicago! Can't wait to come back and try something new!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NFeJBdknSl1zL9nBIcZ76A/348s.jpg", "caption": "Spinach & cheese app, kalamari bites"}]}}, {"review": {"des": "Grand Lux Cafe always impresses me. We used to go here in high school for special occasions back in the day and I figured it'd be a good place to bring my boyfriend's parents while they were in the city. It always offers a great view of Michigan Avenue below, especially if you have a window table. Everything is reasonably priced and there are SO many food options - so many that it took me way too long to choose what I was ordering. <br>Our waitress, Tommesha, was great! She was always there when we needed something and she was refilling my diet coke before I even realized it was empty. Amazing.  Can't wait for my next stop in at Grand Lux so I can explore another corner of the gigantic restaurant.", "pics": null}}, {"review": {"des": "What's there not to like about this place? Its one of the only restaurants that gets a visit every time we are in Chicago!<br><br>The menu is very large and pretty much caters to any picky eater... even one as picky as I am... lol<br><br>The nachos and Asian salad are favorites here finishing the meal with their amazing creme Brule!!!", "pics": null}}, {"review": {"des": "Decent food. Has options for vegetarians, gluten free (not 100%). Good place for late night, different diets, and a wider variety of options. A bit on the pricier side. I wasn't very hungry but got a side of sautéed mushrooms for $6.95. <br><br>The ambience is nice. I liked our seat and our view. We're visiting Chicago so it's nice to enjoy the view of the area. We sat upstairs near the window where it looks out onto the streets. <br><br>I think the top 3 things I enjoyed the most tonight was the view, our server, and my hot lemon water. Simple but it made it perfect. Our servers name was Johnny I believe. Great service. Offered us things we wouldn't have thought to ask for (I.e a to-go cup for our hot water) and honored every specific request we had this evening. Great attitude as well.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/twNI3yFWxDkMq_RltBDcxQ/348s.jpg", "caption": "My dining view"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UWZlzPZ7Bv5yjD9ksQxrfw/168s.jpg", "caption": "Korean chicken burrito sub chicken for avocado and sub sweet potato fries for $1 extra."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/J_8-5b_HRAE_K8b729u8vw/168s.jpg", "caption": "Street view of where we sat"}]}}, {"review": {"des": "Grand Lux is one of my favorite places to eat when in the Chicago loop (when I'm not working in the loop 9-5 every day!).  It isn't the easiest place to find parking, but it is well worth the trouble finding a spot.  And well worth the wait, if there is one when you go (it has been either busy or not so busy when I've gone, so it's hit or miss).  <br><br>The ambiance is classy.  Reminds me of Cheesecake Factory with it's color scheme and exotic embellishments.  You have to take an escalator up to the actual restaurant - if you can get a window seat - go for it!  Watch all those tired shoppers while you relax and eat a delicious meal.  <br><br>I have been here so many times, I'm not sure exactly what to review first.  Here goes:<br><br>French Toast:  Brioche bread was soft and delicious, and drenched in butter and syrup. The photo I posted is from a few years ago, so I'm not sure they have this one anymore.  it was like a bananas foster type of French toast, with a caramel sauce and nuts and bananas.  If all they have now is regular brioche French toast, I'm sure it's great.<br><br>Beignets:  Wow, delicious!  So soft and warm and sweet, with a few different dipping sauces - you can't go wrong ordering these as a dessert.<br><br>Grand Lux Burger Melt:  One of the best burgers I've had!  I think I've ordered this every time I've been to Grand Lux for either lunch or dinner.  I just can't think of trying something new! <br><br>Fresh baked-to-order chocolate chip cookies:  Great for a long train ride home.  Warm, gooey and delicious.  <br><br>Highly recommend if you're shopping the Mag Mile and want some great comfort food.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gMSViHwan2ETmteTaobsbA/348s.jpg", "caption": "Brioche French toast.  Delicious!"}]}}, {"review": {"des": "Very nice restaurant to go to in Chicago. Right in downtown so it is definitely walking distance if you're staying downtown. So many selections on the menu and the portions are big so make sure you go hungry!", "pics": null}}, {"review": {"des": "I would definitely recommend the pasta pomodoro. It was sooo good. I also got the Caesar salad and it was delicious", "pics": null}}, {"review": {"des": "Basically just another Cheesecake Factory which makes sense since it's the same founders. My big question is...what's the difference in terms of food and decoration? Everything was just so similar to Cheesecake Factory. If I wanted Cheesecake Factory food I would just go there and not Grand Lux Cafe...but it's a different restaurant name for a reason right? I just don't know what that reason could be. <br>That being said...I like Cheesecake Factory food...and since this place is basically The Cheesecake Factory I give it 4 stars. Minus 1 star for lack of creativity in being different.", "pics": null}}, {"review": {"des": "I love my meal.  My meal was very tender pot roast. The strawberry lemonade was to die for on this hot sunny afternoon.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zJfhQdiXfZzfSwXUtHerVA/348s.jpg", "caption": "Pot roast"}]}}, {"review": {"des": "Got in fast and got our food fast. I ordered the miso salmon and it was some of the best salmon I've ever had! The waiter was amazing; Grand Lux definitely has to be among the best Michigan Avenue has to offer.", "pics": null}}, {"review": {"des": "The atmosphere was wonderful all of the food everybody from our party got was great. The menu was huge and can't wait to go back and try more.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eS_n3Kq-icFICduWrSPdmA/348s.jpg", "caption": "The best grilled cheese I've ever had!!!!"}]}}, {"review": {"des": "Went here for my friend's birthday a few weeks ago. The venue was beautiful and overlooked Michigan Avenue. Their serving size was pretty big- we couldn't finish. We ordered volcano shrimp and two bowls of pasta. All their food was extremely delicious, especially their molten lava cake. It was expensive, but that is expected for a grand restaurant on Michigan Avenue. Perfect for birthdays, date nights, or just going for dinner with family or friends. Will definitely go there again!!", "pics": null}}, {"review": {"des": "For the most, I really enjoy the food here.  When you can't think of anywhere to go, this is basically a no fail choice.  The dessert quality is not on the top of my list, but if you choose carefully, you may be surprised.  The service is always excellent.", "pics": null}}, {"review": {"des": "I came in here today for dinner and it was amazing as usual! I had a peach Bellini, steak sandwich and for dessert I had the carrot cake ! Everything was great. The carrot cake is absolutely amazing! Can't wait to come back ! Check out the photos.", "pics": null}}, {"review": {"des": "Highly recommend Grand Lux they have best food. Great atmosphere for kids. Very roomy. Great portions.", "pics": null}}, {"review": {"des": "We went for a late lunch around 2:30 on a Monday. We waited 15 minutes for someone to even take our drink order. Then 10-15 minutes later he came back with our drinks and took our food order. The short rib grilled cheese lacked much flavor. It just wasn't cohesive. Very underwhelming. The Asian nachos had potential, but the wonton chips were over-cooked. The side of Brussels we're almost burnt they were so crispy, but we actually enjoyed them the most. For the time wasted on this meal, I'd have gotten better food and service at Chick-fil-a.", "pics": null}}, {"review": {"des": "This place was amazing!! My boyfriend and I went here for dinner during our weekend stay. Great atmosphere. Best shrimp scampi I've had. I would definitely recommend!", "pics": null}}, {"review": {"des": "Biscuits and gravy are amazing. Get a window seat and people watch while enjoying great food and drinks", "pics": null}}, {"review": {"des": "It was ok. Fried American food that's a step up from a place like Applebees. There's not many family friendly locations in Chicago. This is a good choice to bring a young family. My wife said her burger was great and we both loved the chips with guacamole and cheese appetizer!", "pics": null}}, {"review": {"des": "I have a massive knock on chain restaurants, and let's be honest Cheesecake Factory (and as a result Grand Lux) is the epitome of a chain restaurant. I then had two young girls with the youngest having a mild peanut allergy, so chains are now actually a reliable place to eat with children who have special dietary requirements. Grand Lux has turned into our go to birthday meal celebration. Great place!", "pics": null}}, {"review": {"des": "What can be said that hasn't been said before . We stopped in to catch up with some new and old friends  in the city and this place was the spot. A well rounded menu made sure everyone got something they liked. I have to recommend the apple pie if you have the time.  Made fresh it comes to you straight from the oven and it is tasty. Pair it with a perfect coffee and your set.", "pics": null}}, {"review": {"des": "Stopped in after a busy day at conference and ate at the bar. I went with the Patty Melt and a fruity drink. It was awesome! Super funny bartender! If you are looking for an upscale comfort food dining experience give this place a try!", "pics": null}}, {"review": {"des": "The Asian taco appetizer is incredible. Cream of chicken soup best I've ever had. Great variety on menu. In town for a weekend as a tourist? Make this a must stop for atmosphere and great meals and drinks!also try the caramel chicken-incredible! A taste treat.<br>Just stopped in again on Saturday the 5th. Had the caramel chicken. An excellent dish with brown rice.", "pics": null}}, {"review": {"des": "One million stars for the Asian Nachos. <br><br>I only come here for the Asian Nachos, but believe me they're worth it. <br><br>When I'm not eating them, I'm talking about them. When I'm not talking about them, I'm dreaming about them. <br><br>I am not exaggerating when I say you haven't lived until you've eaten the Asian Nachos from Grand Lux. <br><br>So just do it! And then send me your endless amounts of gratitude after. <br><br>Honorable mention: Chicken fettuccine Alfredo", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/N7qh2rFT-Ao8eFxMlp7nEQ/348s.jpg", "caption": "Asian nachos. Also known as manna from heaven."}]}}, {"review": {"des": "Came for desserts. Beignets and bread pudding. Heavenly. Great atmosphere  overlooking Michigan Ave.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WMSA2dQoD0ihzvRHtC0f4g/168s.jpg", "caption": "Bread pudding"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LjK2e0UeBf6taHzCr08U2g/168s.jpg", "caption": "Beignets"}]}}, {"review": {"des": "This is one of my favorite restaurants in Downtown Chicago. One of the main reasons why are the Buffalo Chicken Egg Rolls. Them, the chocolate chip walnut cookies, and the salmon 3 ways are my absolute favorites. I was conducting some business across the street and it had been awhile since I had visited this location. I happened to have arrived 5 minutes before Happy Hour was over. The best part was the the young lady and gentleman at the bar were nice enough to let me hurry up and put my orders in before happy hour was over. I was so grateful because that was the best Mojito I've ever had and being that the Buffalo Chicken Egg Rolls were also half price. I love them so much I got 2 orders. The fact that the gentleman behind the bar understood my love for Blue Cheese and the fact that I needed more and he gave me a huge extra side of it...was a huge plus in my book. If you've never been here, please partake in the Buffalo Chicken Egg Rolls, the desserts, the ambiance, the view, and the drinks. You will not be disappointed.", "pics": null}}, {"review": {"des": "Interesting find on Michigan Avenue. The service was amazing. eLimited offerings but you can't beat the location and the food is interesting and above average. Probably more like a 3 1/2 but that is not an option.", "pics": null}}, {"review": {"des": "Came in tonight with my boyfriend and we both had never dined here before. <br><br>Service: Our server Emma was amazing!! Would come back just for her to wait on us!<br><br>Food: We shared the crab cakes and they were the perfect size for an appetizer (one for each person). My bf ordered the shrimp scampi. The shrimps are a generous size and he loved it! I had the lemon chicken picca which was delicious! The portions are big..but I'm excited for my leftovers. <br>Lastly we had the lava cake which was to.die.for!!!<br><br>Drinks: I'm a fruity gal and ordered the calypso mojito.... and ordered another one after <br>Can't wait to come back!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_mz05SGzw6tNExkgmqcfPQ/168s.jpg", "caption": "Molten lava cake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gp14CSwbHbhGP6u1Giw89g/168s.jpg", "caption": "Calypso mojito & Jack n coke"}]}}, {"review": {"des": "Nice service and food.  We ordered BBQ chicken pizza, was so delicious!! Very pleasant atmosphere, and fancy interior. I will coming back for sure!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VaK9R-gqvBvD5U-Xvod6vA/348s.jpg", "caption": "turkey burger with sweet potato fries, and bbq chicken pizza"}]}}, {"review": {"des": "Great upbeat place to eat with friends and family. Great food and atmosphere. The Benign's are the best on this side of Louisiana", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xCkEbObSysfLWWk19ypKgg/348s.jpg", "caption": "The marble Floor artsy"}]}}, {"review": {"des": "Solid restaurant in the heart of the mag mile that has a little bit of everything in terms of food. It's not cheap, but more affordable than a lot of the places in the area. Also you get your money's worth. I got the lunch special omelette, you pick 4 ingredients and I just made a denver, but it was big and good. My friend had the southwestern salad and that also was decent sized. I also had their coffee and it was really good, has a bar and also dessert menu. Very big in size, actually reminds me a lot of cheesecake factory in terms of menu and decor (also they're 2 blocks apart)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MPKozkQ4BHxDmzj-fN1wyA/168s.jpg", "caption": "Grilled chicken avocado salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/L9ew70PfMNgK4-cisNgZLQ/168s.jpg", "caption": "Omelette with fries"}]}}, {"review": {"des": "Korean beef tacos, ahi tuna tacos and ceviche. The tacos were phenomenal. Service was great and we had a nice view of the Mag Mile.", "pics": null}}, {"review": {"des": "Stopped in last minute for 10:30a breakfast. It was good; not great but just good. Coffee was not good though. Weird aftertaste. <br>Everything is made from scratch the waitress said, which appears to be code for \"it's going to take longer than you think.\" It did.<br>It looks to be a nice spot for a group if you have one- the place is pretty big. <br>Large menu for lunch and dinner and decent selection for breakfast. I would come back to try lunch.", "pics": null}}]}