{"name": "green-street-smoked-meats-chicago", "reviews": [{"review": {"des": "What's not to love about some good meat, beautiful atmosphere, and bumpin tunes? I absolutely love coming to Green Street Smoked Meats. Their menu is simple and easy to understand. You order up at the front and pay for food. If you just want a drink, you can head straight to the bar. <br><br>I got the half pound of pulled pork. It comes with two pieces of white bread, which was a nice addition. For sides, we got the elotes style corn and macaroni salad.<br><br>I could've eaten all of this and more. The meat was PERFECT. It was almost falling apart but still meaty enough to give you a good bite. I absolutely love their barbecue sauce, as well. The elotes style corn was like no one elotes I've had. There's a ton of mayo and cheese- of those aren't your favorite parts about elotes, you may not love. I loved it. I wanted more after I ate my side! The macaroni salad was just like your mom makes it (if she makes it so well you want more than the heaping serving they give).<br><br>Things to look out for- there are tons of big tables. Many people share tables and sit by one another, cafeteria style. After work hours 6-7:30pm, it tends to be very busy too!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qM1SaxKmkFhqqoud8DOj2w/348s.jpg", "caption": "Pulled pork, macaroni salad, elotes style corn"}]}}, {"review": {"des": "I've been here a couple of times now, and each time, the food was great!  The restaurant has a warehouse vibe with mostly picnic table seating.  You go to the counter to order where they cut the meat to order and then choose your sides.<br><br>So you've got plenty of options!  You can choose to order meat by the 1/2 lb (brisket, pulled pork, ribs, pork belly), or you can go for a sandwich or other meals.  I chose the pulled pork sandwich and opted to have pickles on it.  My husband got the chopped brisket sandwich.  We then ordered baked beans and potato salad on the side.  The sandwiches were delicious and plentiful, and the sides were generously plated.  Between the two of us, we could barely even finish one side, but both were yummy.  The potato salad was some of the best I've had in a while.<br><br>The pricing wasn't bad, considering the quality and quantity of the food.  The sandwiches go for about $12, and the meats go for about the same per 1/2 lb.  Each side is $5, but it's enough to share!  If you like barbeque, then this is a definitely place to try, and I'd recommend it.", "pics": null}}, {"review": {"des": "Every single food item we tried here was amazing. If you want amazing brisket, pulled pork, corn bread, macaroni salad, and coleslaw - this is the place to go. Each item we ordered blew me away. I had a couple Sweet Tea Drinks (with Bourbon) that were fabulous. <br>On another note, I wish they would turn their music down. It was way too loud and I could not understand what my friends across the table were saying. Another drawback is the line. It took us about 30-40 minutes to order our food, and the line continued to grow throughout the night. This place is definitely popular, so make sure to get there early! <br>Overall, I will be back!", "pics": null}}, {"review": {"des": "Growing up in a city that is known for barbecue, I can appreciate a place that does barbecue well and Green Street does it very well! The only thing is finding it! Surprisingly, despite its location away from the street and behind Parlor Pizza, Green Street is actually not a well kept secret. When we walked in on a Saturday night, the place was crowded. We joined the well-formed line and waited to order.<br><br>When we got near the counter, an employee saw us looking a little lost and confused and offered to make suggestions about what to order. We went with his recommendations for a meat sampler (see the mouth-watering photo) and ordered:<br><br>Sliced brisket - so moist with just the right amount of fat. It effortlessly fell apart. This is a must get.<br>Pulled pork - overly sauced and too salty<br>Pastrami - the silent winner. I never order pastrami but I was so glad that I got to try this version.<br>Pork rib - meat was tender<br>Pork belly - very well seasoned <br>Hot link with jalapeño cheddar - there was nothing special about this andouille sausage<br><br>Our sides included: broccoli salad, cornbread with honey butter, pickled vegetables, baked beans, and elote. None of these were very good and most of them lacked flavor. This place is known for their meat and they have \"meat\" in the name of the restaurant so the sides are not their area of expertise and that was obvious. I must admit that I was also disappointed by their sauces. It would've been nice to have had a sweeter sauce and more variety.<br><br>This is a great casual place for barbecue. If you're willing to stand in line, hawk seats, and enjoy a pork and beef extravaganza, this is your place. Seating is first come first serve, there's a full bar, a ramen joint is located downstairs, and they have soft serve ice cream sundaes for dessert. My recommendation is to stick with the meat.", "pics": null}}, {"review": {"des": "While I was in Chicago I met up with a friend who loves barbecue, and she took me to Green Street as it's one of her favorite spots.  I'm glad I went with my friend because there's no way I would have found it by myself.  You go through an alley past another restaurant and then there's a big door to enter. <br><br>My friend said there are four signs of a good barbecue restaurant:<br><br>1) Smell it before you see it<br>2) Paper towel rolls on the table<br>3) Uniformed officers eating there<br>4) Sauce self serve station<br><br>I love that!  If I remember right, we only had 3 of the 4...no officers were there at that time.<br><br>When you walk in, there's a big menu above the kitchen and you order the meat you want first, then you order your sides. You get your food on a metal tray...makes you feel like your getting lunch in elementary school.  Note, the sides are around $5 and pretty good size.  You're better off starting with one side and then getting another later.  I made that mistake as my eyes were bigger than my stomach.  The baked beans and potato salad were so tempting that I had to get both.  I got a pork sandwich which was good.  The meat was tender and juicy, and you could add your own barbecue sauce. The sandwich was a little on the small size, but its big flavor made up for it.<br><br>Once you get your food there was a big ice bucket with cans of soda, or self-serve water.  There's also a full bar with plenty of craft beer.  I found myself an IPA from a local brewery that pleased my pallet. <br>It's a huge space, with a cool vibe as it's dimly lighted with small light bulbs across the ceiling.  It makes you feel like your sitting outside at night under the stars. The seating is mostly picnic tables, which is nice if you bring a bigger group of people with you.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ze-nlrOf9QFadnE7uR2Xfg/168s.jpg", "caption": "Pulled pork sandwich with baked beans, and potato salad"}]}}, {"review": {"des": "Short Version: Probably the best brisket I've had so far (and pork belly). The corn elote is also a must-try here! Though, this place is super super <br>pricy. Great casual spot to hang out if you have the cash.<br><br>So I don't know why I don't like brisket. Even when people say \"this is the most tender brisket\", I find it having needing a significant amount of chew and lacking flavor. It's like they're taking the cheapest cut of meat and trying to make magic with it using 24 hours of smoking and low heat. For the first time, Green Street Smoked Meats does a really amazing job with the brisket - and you should definitely add this to your plate.<br><br>The 2nd thing you should add is the pork belly. For some, it's too fatty. But we're here for the best, and flavor sometimes needs fat. Plus, you don't need to get a whole order of anything here - just ask for 2 slices and you can balance between divinity and not feeling terrible about yourself. For me, I don't usually eat fat but this fat is easy to eat - there's no chew at all and the flavor is bursting (and rich).<br><br>As for the corn elote, it's a small cup of corn and cheese goodness. There's no real words for it, but you should definitely at least get one for yourself (or the table, if everyone just wants one spoonful haha).<br><br>Everything else I tried was alright. The pulled pork is good, but not worth the premium price (or stomach space) at all. The pastrami seemed okay, the smoked chicken leg was well-cooked - but if you got this and not the pork belly, then you're doing it wrong. The ribs were probably the \"worst\" one of them all, especially considering that you're paying the same price per pound of meat when this is easily 80% bone.<br><br>As stated earlier, the price is super expensive. If you're a person that doesn't normally eat massive amounts of meat, you should get full here pretty quickly because ... well, it's all meat and can be a dense meal. However, if your stomach is even remotely a black hole, I honestly would budget $20-50 here just for food. So the meat is good, but I'm not sure if it's $50 good. That being said, getting a sandwich might be a better option (something I'll try next time), or eating something else beforehand so you don't cry when you get to the register.<br><br>On that note, this place doesn't have a set menu and table service. You walk in, stand in line, then wait for your turn to order how many ounces/slices of each meat. We were told the minimum size was 4oz, but they tend to give you more than you ask for (sorry to make this post a lot about money, but I know some people can get super sticker shock especially since you don't actually know how much it costs until you are about to pay). After the meats, you order the sides, ask for unlimited white bread (maybe get at least 1 to cleanse your palate and make each bite more enjoyable), and then pay for your food. You find a table, load up with 3 kinds of sauce, and chow down.<br><br>Overall, Great Street has awesome ambiance and amazing meat. Great place to hang out, get buzzed, and taste probably the best BBQ in town.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SaUUS1rIESjpAIG5aMbJwQ/348s.jpg", "caption": "- Pulled pork (upper left) - Corn Elote (top middle) - White Bread - Pork ribs (lower left) - Pork Belly (lower middle) - Brisket (lower rt)"}]}}, {"review": {"des": "If you're looking for really good barbecue you need to eat here! The chopped brisket sandwich with spicy pickles hit the spot. And the elote style corn - I couldn't stop eating this. Officially addicted. The prices are reasonable, too. Brisket sandwich was $12.50 and the sides were like $4. They also serve soft serve here, which was tempting, but I was so full after my meal I didn't get a chance to get some. <br><br>Although Green Street Smoked Meats gets crowded, the place is huge so you can find seating pretty easily (I went on a Thursday night after work). The bar is separate with drafts and cocktails to order. Great service and my beer was like $7. I love how they decorated the inside! All the lights hanging up look amazing. Definitely coming back here for all my BBQ cravings", "pics": null}}, {"review": {"des": "The long line here can be a little intimating. Good news as it does go fast! The menu has so many delicious options might even take you some time to figure out what you actually want to get. Definitely try to make it before standard busy times as certain items can run out.  We wanted the elote and it was out when we got there but by the end of our meal it was back up.<br><br>The counter style set up works to their favor as people are really cycled through and you get a chance to see others food choices before ordering your own. The atmosphere isn't your typical bbq restaurant which makes me want to hang out there even longer.<br><br>I went for the pulled pork sandwich with mac salad and we also got the sliced brisket, pork belly and broccoli salad. TONS OF FOOD! The sides are such a gracious portion, on top of the amount of meat you get it's so much food I was beyond stuffed. Love the bbq sauce as it has so much flavor without being overpowering. <br><br>The first visit I came they were out of the elote corn as a side. I heard good reviews and was sad I didn't get to try it but was still happy with the mac salad. The second time I came they had the corn so I got it - OMG it was amazing!! I will forever choose this as my side!", "pics": null}}, {"review": {"des": "Who knew you could get such good barbecue in Chicago?! <br><br>I came on a Thursday night around 8pm and there was a looong line, but it moved relatively quickly. The space is so cute! It's a large open room with long picnic tables and string lights everywhere. There's also a bar in the middle so you can enjoy a beer or cocktail with your bbq. <br><br>We tried both the pork belly and the brisket. Omg....if you order just one thing, make it this! It is so fatty, delicious, and melt-in-your-mouth with a perfect crust of pepper and herbs. The fattiness does become a bit overwhelming though, so I recommend sharing! The brisket was also really tasty, although definitely not as good as the brisket I had in Austin. <br><br>For sides, we had the elote corn and broccoli salad, and I would recommend getting both! Portions are pretty good and they pair perfectly with the meats.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VvlRJ_4iBGJYPW_zM8IyAg/168s.jpg", "caption": "Cute space!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PN79EaMfnIfmtmwlOfmM6Q/168s.jpg", "caption": "Brisket, pork belly, elote, and broccoli salad"}]}}, {"review": {"des": "We had dinner reservations and needed to kill time and why not get a littel appetizer also. <br><br>OMG, one of best BBQ we had. We unfortunately had to just get a little food to wet but not ruin our appetite.<br><br>The venue is awesome, hip picnic tables, lots of space both inside and outside. The venue is also combined with a hip coffee shop.<br><br>We could only get the pork belly and the brisket: perhaps the BESTpork belly and brisket i've had at any BBQ joint. Enough said.", "pics": null}}, {"review": {"des": "Came to this place for the first time with family who live here and was so impressed with the place. Might I say, the best BBQ I've ever had?! First of all, the decor and feel of the place just emanates real BBQ. It also doesn't hurt that when you walk in, it smells heavenly. What I loved the most was the interaction with the super patient and informative guy behind the counter cutting the meat for you. They do it right in front of you, actually answer your questions, and show you the pieces, so you know what you're getting. It's by weight, so just be mindful of that. They also have sides like baked beans, pasta salad, elote corn salad (which I definitely have to try next time).<br><br>So they serve everything on a metal tray and your eyes just feast on the food you're about to eat. Had the pork belly, brisket, and the beef rib. Right now I'm trying to think of which I liked the most, but they were all so good. Melt in your mouth, cut with a plastic knife if needed kind of good, and tasted like real BBQ. If I had to pick, I would say that the pork belly and beef rib were the stars. They guy behind the counter (sorry I didn't get his name) had recommended the beef rib and I've never had such a meaty, well cooked beef rib like that before..must get. That pork belly though, wow just melts in your mouth.<br><br>Ok, so only downsides to this place is that the music is loud (but I'm nitpicking here because who cares about talking when you're stuffing your face right?!). Also, it can be pricey, especially since I wasn't really paying attention to the poundage while being dumbstruck by all that meat in front of me. So worth it though, definitely try this place.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Br0N5Bw7uLsnMb0vqr43YQ/348s.jpg", "caption": "Decor inside"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KLYt__UkgSUVhwq9oc2CnQ/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wIYmKBvC6OhLWuEnvzKaLQ/168s.jpg", "caption": "Outside patio area"}]}}, {"review": {"des": "We were just in the neighborhood and had to stop by and check out this place because it was highly rated one of the best BBQ places in Chicago. We ordered their pork belly, hot links and jalapeno cheddar link to go. The staff behind the counter were very friendly. Upon checking out I noticed they had some old fashion donuts and got the triple chocolate to go as well. <br><br>We got home and sampled our goodies, oh my their pork belly, if you like fatty foods like me, this pork belly was so juicy and melts in your mouth and leaves behind a smokey sweet BBQ goodness in your mouth! Their hot links and jalapeno cheddar sausages were both delicious as well, very meaty, smoky, juicy and got some heat to it. And that triple chocolate old-fashioned donut did not disappoint as well. IMO I liked it better than the donuts down the street on Randolph. <br><br>I would definitely come back and dine in at Green Street Smoked Meats to have a full experience and try more of their meats. We forgot to grab some sauces to go and we heard it was also good.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3uuSTQARVqnLkBcifOcjKw/348s.jpg", "caption": "Very surprised by this great tasty triple chocolate old fashion donut."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uvr69N5oNTmDC6h9lrXp0g/168s.jpg", "caption": "Look at that fatty goodness."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5jqhk_e-SmJ09Um3VqoBQQ/168s.jpg", "caption": "Jalapeno cheddar (L) and hot links (R). Yum!"}]}}, {"review": {"des": "Hands down the best BBQ place in Chicago. You cannot beat the quality of food, the no-nonsense convenience of the cafeteria style service, the laid-back atmosphere.  I've been here a few times at this point and every time it meets my high expectations and more. I recommend always getting the brisket (best brisket ever) and the broccoli salad. Pork belly is also delicious and goes well with their spicy BBQ sauce. I personally find the pulled pork to be on a weak side compared to their other amazing options, but it's still good!<br><br>In addition to the awesome food their beer selection is great and perfectly complements the food experience. Hence the well earned 5 stars, bravo!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8N4pDUQzsSgB1nxeEUdPZQ/168s.jpg", "caption": "From left: sliced brisket, pork belly, pulled pork, and broccoli salad"}]}}, {"review": {"des": "Not sure I got the whole experience, but came here for a late night nosh after having 2 cocktails for dinner, instead of dinner.<br><br>We shared the corn bread (I think it had a kick of heat to it, but again, my memory post 2 cocktails is a little foggy), and the salmon. Kind of a strange late night treat, but it was still pretty great.<br><br>I think it was around $30, but I didn't pay. Still, a solid experience. Good food. Easy counter ordering.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/E-HjZ6MU22em2RhP7lvnZA/168s.jpg", "caption": "Smoked salmon"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wIbSMYVbGhWbCSwd2yniVw/168s.jpg", "caption": "Salmon and spicy corn bread"}]}}, {"review": {"des": "Nearly everything is great about this place aside from the super creepy paper mache shirtless hanging mannequin thing (if you go, you'll know what I'm talking about). Otherwise the meat is killer, brisket is out of this world, the rub on it is so flavorful and the meat is so juicy. Additionally, we love the ribs, links, macaroni salad, and broccoli salad. The potato salad is fairly dry and the coleslaw is vinegar and not creamy, so may be good to others, but not my style. The one item I've had I wasn't impressed with was the elotes. The corn was either mushy from being made too far in advance or it was frozen. The flavor was good but the corn texture was not.", "pics": null}}, {"review": {"des": "One of my favorite meals in Chicago! My friend and I came around 2:30pm on a weekday and there was no line at all, woohoo! (Good thing because we were starving after having kayaked on the river for a few hours.)<br><br>We split everything (came out to about $19/person) and fully enjoyed everything that we got:<br><br>+ Sliced brisket (1/2 lb): one slice was super fatty and melt-in-your-mouth, the other was less fatty but still good. <br>+ Pork ribs (1/2 lb): fall-off-the-bone tender! So flavorful<br>+ Elote-style corn: YUM, I highly recommend this!<br>+ Broccoli salad: also very good! Came with plenty of other stuff on it like sunflower seeds, raisins, carrots, etc. and it all worked so well together<br>+ Complimentary sliced white bread - just let them know how many slices you want<br><br>It's interesting how they share the dining space with Sawada Coffee. We chose to sit outside for better lighting & fresh air, but the twinkling lights strewn all over the ceiling inside were quite pretty, and there were quite a few people working on their laptops inside.<br><br>Definitely will recommend this place to anyone I know who's planning a visit to Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/n-14YsMD2d7PXzivpGby1g/348s.jpg", "caption": "Sawada Coffee in the front, Green Street in the back"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/i3RvNVN0KWzqQuk7VMFFSg/168s.jpg", "caption": "Elote-style corn, 1/2 lb pork ribs, 1/2 lb sliced brisket, broccoli salad, bbq & spicy sauce, and white bread"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aDm0AXhMAoexoSqUEQGrJg/168s.jpg", "caption": "Sliced brisket up close. So fatty and delicious"}]}}, {"review": {"des": "I was prepared to hate this place. I grew up in Oklahoma on a cattle ranch and lived in Texas. There was no way that some city slicker Northern barbecue place was going to impress me. Boy was I wrong.<br><br>SIDES: First let's talk about the sides because I love sides. Their street corn wasn't up to Texas standards but it was the best I've had outside of the state. It was amazingly delicious and I'm so excited to go back and have more. I don't even like potato salad but I ate it and it was awesome. What really gets me is the honey butter corn bread. Also mac & cheese. So I know if you're a vegetarian it's not great to have to just eat the sides but in this case eating the sides may be the best option ever.<br><br>MEATS: if I have to tell you to meet stick at please order the pulled pork and the pastrami. The brisket was good but it wasn't different than anything else I've had before where is the pastrami was some of the best I've ever eaten.<br><br>AMBIANCE: you order up at the counter and they put your food on the large metal tray similar to what you got in elementary school. It's definitely an experience. Then you order your drinks from the bar. While there's not server is going around to the tables I really like the style at felt authentic to the way all the good Texas barbecue joints I've been to are set up.", "pics": null}}, {"review": {"des": "Sooo good. You'll want everything. Awesome and relaxed spot for hanging out and stuffing your face with BBQ. Grabbed the brisket, pulled pork and the pork belly. Got potato salad, baked beans and coleslaw for sides. Wow. So full of flavor and just kept wanting to eat until it induced a food coma. Will definitely be back on my next visit.", "pics": null}}, {"review": {"des": "Pork ribs and sliced brisket. So good. <br><br>When you come (because you should), try all the sauces. Spicy isn't that spicy, but has great flavor.<br><br>We also got a side, the Mac salad. It was fine, I'd try another one next time or, more realistically, get more meat. <br><br>Atmosphere as others have stated is really nice. Sat on the patio - string lights and picnic tables, what more does your Instagram picture need? <br><br>Well worth a visit!", "pics": null}}, {"review": {"des": "This review is for the brisket.That's all I need to know about a BBQ place. If the brisket isn't great, chances are I won't return. It was so good at Green Street. Also I don't usually put sauce on the brisket...but that spicy bbq sauce of theirs. I took some home! Their bartenders spin music on the turntable that's in the middle of the bar. I like that. She played front and back of the LP so you don't just hear greatest hits played ad infinitum. During shift change, I noticed the next bartender had a different set of LPs. If you don't like the music, look up the games are on.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ES4c3pEU1t4vMjQhOCwAnQ/348s.jpg", "caption": "Bartenders spin discs"}]}}, {"review": {"des": "I had a taste for a really good sandwich with a unique dining experience.  Another Yelp Elite member recommended this place so I knew it was going to be good. When I first walked in I was greated by the Meat Man and explain the process of ordering. Place your meat order and then choose your sides, easy and simple. <br><br>My mouth started to water for a pulled pork sandwich. It came on a toasted bun and topped with crispy cool coleslaw. I also ordered a side of Macaroni salad. Now, the overall sandwich was very good but slightly disappointed in the Macaroni Salad. I should have selected a different side but I was happy with Coleslaw that came on top of the sandwich. <br><br>I didn't order any drinks, but I did get some of their vanilla bean soft serve ice cream which was spectacular! I 've never had soft serve ice cream with so much natural flavor. I think I could go back I would order that first...LOL! I didn't expect that from a smokehouse, but I was pleasantly surprised.  <br><br>I will def be coming back here to try their other smoked meats!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3Ajvrun4NXgglsohrqoLIg/348s.jpg", "caption": "Sidd entrance"}]}}, {"review": {"des": "Created a yelp account just to five star this place for exemplary food and service. <br><br>First off the Chicken is delicious and comes in at about half the price of the other meats, so if you're ballin on a budget this is for you - it's moist as the morning dew. <br><br>I recently had some work on my mouth done and have a fake tooth I need to remove before I eat.... anyways i ended up throwing this little puppy out in a massive trash bin. The staff was super cool about it, initially offering me some gloves, a flashlight, and a safe space to look. When i eventually gave up the search this dude who works at the bar by the name of Jake wanted to look for himself.... the two of us looked for about 30 minutes, sifting through trash cans full of (still tasty looking) burnt ends and pulled pork res. Unfortunately we did not find the tooth, but dang, it was a pretty good time looking and an unreal move of character by Jake and the rest of the staff to be beyond cool about the situation. <br><br>Also shout out to the manager for being so sweet about the situation, that was big! <br><br>5 stars for food, service, and for everyone there being so darn human. Thanks guys. <br><br>-Jack", "pics": null}}, {"review": {"des": "I brought some other friends and we got the pork ribs, elotes, smoked chicken, and the ice cream. The pork ribs were so good! They were well seasoned and flavorful, without the sauce being too  sweet or the meat being too dry. The ice cream was also super good! They cover it in a chocolate shell, and even with the 3 of us we could barely finish it. It's definitely an amazing way to end a meal at green streets, and I would highly recommend it. The soft serve isn't advertised on the menu but on a sign behind the cashier. It's creamy and not too sweet, and I love it.", "pics": null}}, {"review": {"des": "Worth the stop for sure! Wanted to try the Little Goat but due to the wait ended up here instead and I'm not upset about it :)<br><br>Parking: street or lot, usually metered, it's easier to Uber in this area <br><br>Food: smoked salmon seems to be the thing to get but it was out. We go the brisket (standard for bbq joint) and pork belly, which was amazing!!! Have never had pork belly that was so well crusted with herbs and pepper and crispy and burnt on the outside and super soft, rich and delicious for the rest of it. Elote was good but definitely expect a very cheesy version. Corn bread has peppers in it so if you don't like spice beware.<br><br>There are long tables and open seating so no reservations available or needed- you order at the counter and find your own seat.", "pics": null}}, {"review": {"des": "Who knew that some of the country's best BBQ is coming out of Chicago?! Not Austin, Texas, not Nashville, but Chicago. <br><br>Green Street Smoked Meats is a large BBQ restaurant in the West Loop. It may be hard to miss because you enter it from an alley, but once inside, you're standing in a very large restaurant with plenty of indoor and outdoor seating. It even has a full bar inside and a coffee shop open in the mornings. Here's what I recommend ordering:<br><br>1) Pulled pork sandwich: It's really tasty. A healthy portion of pulled pork comes on a bun with coleslaw that seals the deal. <br><br>2) Elote: Every time I see elote on the menu, I order it and this is the best I've ever had. It comes off the cob and so good! <br><br>3) Frito pie: It's a little odd because it comes with the Frito bag on the bottom, but it's essentially loaded nachos but instead of nachos, it's fritos.<br><br>If you want good BBQ and a fun environment, run to Green Street Smoked Meats.", "pics": null}}, {"review": {"des": "This is my favorite place in Chicago! Both the food and the atmosphere are wonderful.<br>This place is a win for meat lovers! I tried almost all meats they have and all of them were so delicious. I especially recommend the smoked salmon, it is so juicy and tender. The best I have ever eaten!<br>They have not only a wide choice of meat but also a nice drink list. I am not a big fan of beer, but my friends tried their draft beer and liked it a lot. The last time I was there, the bartender made me a custom cocktail of my choice. I was nicely surprised :)<br>I will leave a few words about style as well. It is looks like an old factory building and it saturated with all history and mystery of the town. Rock music plus true loft style this is how the real Chicago is! It would be an excellent choice for tourists. The prices bite a bit, but believe me, it's worth the money. Extremely recommended!", "pics": null}}, {"review": {"des": "Pork belly is my favorite here, with the beef brisket a close second. Sides are excellent as well. <br><br>Lines can be pretty long on weekend nights but the beer selection is good and shots of whisky are very fairly priced. Fun spot.", "pics": null}}, {"review": {"des": "Such a fun place! <br><br>Inside is super poppin', loud, a lil dim, cool music, picnic tables aesthetic, string lights, and super spacious.<br><br>Ordered the chicken, ribs, brisket, side of mac salad, and elote styled corn. Got the spicy sauce and ate it with the chicken which was A+<br><br>Pretty pricey but worth it.<br><br>Awesome workers.", "pics": null}}, {"review": {"des": "Greeeeeeeeeen Streeeeeet! *I only stopped in for drinks*<br>This place is so cool. I am sad I only got a drink because I would have loved to try the meats! The macaroni salad looked amazing too. I got three glasses of wine for $15 and that my friends, is a deal for a bar/rest in Chicago, IL. The vibes are incredibly cool and the staff is super friendly and helpful.", "pics": null}}, {"review": {"des": "Extremely popular place in the West Loop. Located behind Sawada Coffee (which is excellent btw). Waited 25 minutes in line on a Thursday during lunch time. We ordered 1/2 pound brisket ($13), 1/2 pound pork belly ($13), brisket sandwich ($13), macaroni salad ($5), cornbread ($5), elote corn ($5), and watermelon salad ($5). The total was around $65 with tax. The pork belly was extremely tender and flavorful, but very greasy. The brisket was a bit drier but still tender. All of the sides were fantastic, especially the cornbread which came with honey butter. The watermelon salad was refreshing, but not worth $5. <br><br>The food here is definitely good, but the prices are pretty steep. $13 for a half pound of meat is not cheap, so a lunch consisting of 1/2 lb meat and one side could cost around $20. Also don't come during prime lunch hours to avoid long lines!", "pics": null}}, {"review": {"des": "Atmosphere: Laid-back and trendy<br>Staff: Friendly<br>Quality/taste: Good, nothing special<br>Price/value: Way too high for average BBQ <br>Order: Pulled pork sandwich, short ribs, frito pie, corn bread, two cans pop ($68 including tip)", "pics": null}}, {"review": {"des": "Super cute bbq joint. I love the ceiling lights and the rustic feel of this place. The bbq is to die for. So tender and juicy. My friend and I got the pork belly, sliced brisket, the oyler sandwich, potato salad, and the elote corn and they were all really good. The food was more than enough for the two of us. We came here at 6:30 on a Sunday night and it didn't get crowded at all until around 7ish. The line goes by quick. There's also seating outdoors. You order at the counter and they give you your platter. Simple concept. Definitely coming back here sooner than later.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Y_0H8BM8tLQEhsVZ3B2p1w/348s.jpg", "caption": "Sliced brisket, pork belly, potato salad, elote corn, oyler sandwich. Sooo good."}]}}, {"review": {"des": "Creekstone beef! The brisket sandwich (comes w/spicy pickles) was delicious and perfect. Costs $12.50. I got the spicy BBQ sauce which made it even better. I could have ate two of them. How it works: walk in, wait in line, order your main dish at the first counter on the right, then order your side at the next counter aligned with the register, then you pay. There is a separate area that has sauces, napkins, water (all self-serve). Then you seat yourself wherever you can find a spot, you will have no choice but to share a picnic table with other parties. They do have a large table in the back corner that can probably seat 15-20. Their corn is delicious but serving size is small, the corn bread was just okay and def not worth $4.50. <br><br>Inside is dark and very loud. I saw all types of group here, a surprise birthday party, group of suits, people studying (?), people just hanging out.", "pics": null}}, {"review": {"des": "First time visitor.  Stopped in for lunch.  You place your order at counter and sit at one of the long tables.  To my surprise, the rib is charged by the pound.  I decided to try both so I ordered 4 ribs and a brisket sandwich with a side of slaw along with an iced tea.  Initially, I thought my $37.16 tab was a mistake.  The receipt is clear.  My 4 pork ribs weighed 0.64 lbs @ $19.90 per pound. Had I known, I would have solely ordered the brisket sandwich which seemed reasonably priced at $12.50.  The side of slaw cost $4.95.<br><br>The ribs were tasty and pretty much fell off the bone.  The brisket was great as well...I especially liked the generous serving.  The slaw was ok at best (depends on the slaw you prefer).  <br><br>I prefer to dine at a bbq establishment which offers multiple bbq options, at least two.  There aren't any bbq bottles at the tables so you have to serve yourself in a cup as if you were at a fast food restaurant.  <br><br>I don't believe I'll dine here again since I prefer pork ribs as my main entrée when craving bbq.  At the price of $12.74 for 4 ribs, I'd rather pay $20 - $25 for a full slab at other bbq establishments.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8Q9GhW_MfH3Hq0yIhwVbVA/348s.jpg", "caption": "4 rib and brisket sandwich meal with a side of slaw.  All for $37.16 which included the iced tea."}]}}, {"review": {"des": "This is among my favorite BBQ joints in the city. The only problem is that if you eat as much as I do, the premium prices really start to hurt. BBQ has a certain label attached because it's seen as a casual, cheap, thing that families indulge in at picnics. Here, though, bringing your family will result in sticker shock and a lot of people still probably going hungry.<br><br>There are some budget-friendly options here--I admit that--but the good stuff is expensive. While this restaurant maintains a friendly, picnic-table-seating vibe that is also a useful staging area for people waiting to eat at High Five, it's also a dead-serious place for BBQ enthusiasts.", "pics": null}}, {"review": {"des": "Super cool spot in Fulton Market/River West foodie district. Right next to Parlor and across the street from The Allis in between two buildings. There was a scary looking line when we arrived but my date assured me it goes quickly; took about 15 minutes and we got a drink from the bar while we waited. <br><br>The cut the meat and serve the sides on your tray right in front of you while you are ordering. Meats are served by the 1/2 pound and vary by price and with slices of white bread. Sides are $5 each. <br><br>Sliced brisket was amazing and the pork ribs were to die for. Also had the cornbread which had small pieces of jalapeño and the macaroni salad. Plentyyyyy of food for two people, we had leftovers to make into another meal.", "pics": null}}, {"review": {"des": "The thing I love the most about green street smoked meats is the ambiance. Love the pretty lighting when you walk into this beautiful cabin like space with communal seating. If you need convincing just go on their website to see pictures (or just visit the restaurant haha). <br><br>I came here on a really cold winter day and was surrounded by warmth as I walked into this cozy space. It was crowded but we were able to get seats right away. For meat, we ordered sliced brisket ($12.95 for half pound) and pork ribs ($9.95 for half pound). Both of these were delicious! I liked the pork ribs more so make sure to get that!!<br><br>What I didn't like at green smoked meats are the sides. We got the potato salad, frito pie, and elote style corn. The corn is delicious but the other two were terrible. There was nothing special about the potatoes and I ended up just eating a few bites and throwing the rest away. I didn't like their concept behind the Frito pie or the taste - literally a bag of Fritos topped with cheese, beans, etc. <br><br>In terms of cost, it adds up with all the sides which are priced at almost $5 each. The sides are definitely overpriced and not worth it except the corn.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jUCzcoBGe8VvEcB_MIYG0g/348s.jpg", "caption": "Sliced brisket on top left, pork ribs bottom left, potatoes bottom right, elotes corn above that, and Frito pie top right"}]}}, {"review": {"des": "Amazing BBQ, I would highly recommend this place! <br><br>The lines are long but it's worth it. It sort of like a self service ikea type line for food. You pick what you want and pay at the end. <br><br>You can't go wrong with anything on the menu. The ribs are to die for, the brisket is amazing, the pulled pork sandwich is great. For sides, I recommend the baked beans and the broccoli salad. <br><br>Enjoy!", "pics": null}}, {"review": {"des": "When it comes to BBQ, things should be pretty straight forward. How was the texture and prep of the meat? Executed pretty on point. How was the juicyness of the meat? Slightly above average, some cuts tasted a little dry. The frito pie was a mess but it was fun. The sauces were thick and flavorful. Overall a tasty experience that has lots of meats to choose from, highly recommend the cheddar hot-link.<br><br>All the staff is super hipster, acting like super hipster, talking about their super hipster problems. Is this a issue? Nah, it was just funny and predictable. Many families with kids were here, the restaurant is inviting to all kinds of people with lots of seating. Can't go wrong with that!", "pics": null}}, {"review": {"des": "Ordered the Beef Brisket and pickles. <br><br>Brisket was excellently cooked but was destroyed by way too much salt and I had to use sauce to finish it. Bummer. <br><br>I've had the pull pork sandwich here before which was delicious. <br><br>The staff here as you can see in my photos are happy and cheerful as can be.", "pics": null}}, {"review": {"des": "Had been wanting to go here for awhile and it really delivered!! A friend and I went for a late dinner on a Tuesday night. Easily found a place to sit, it's very large but I can see how it gets super packed on a busy night. <br><br>The guys at the order bar were incredibly helpful, encouraging, and friendly. We wanted to sample pretty much everything and also not spend like 100 dollars. <br><br>We settled on two hot links, a quarter pound of chopped brisket, a quarter pound of ribs (two), the salmon, for sides we got baked beans, a sample scoop (I told you they were so nice) of the macaroni salad, the cornbread, and the elote.<br><br>The meats were spectacular. The hot links were definitely our favorite. They're H U G E and delicious and perfectly spiced. Like that on a bun with some spicy mustard would be heavenly. I'd go back for the hotlinks alone. <br><br> The salmon was delicious, definitely wild caught, it was cooked perfectly and comes with crackers which I appreciated. They bring it to the table as opposed to everything else that you grab at the order bar. <br><br>The chopped brisket was flavorful rich with just the right amount of fatty bits.  It's super tender and melts in your mouth it's really so so good. <br><br>The ribs were not as good as my Moms but very meaty and flavorful. Not dry but not super juicy (like my Moms lol) but delicious! I would've loved some additional sauce on the side. <br><br>The sides were equally tasty!! I was really impressed with the baked beans! They have a smoky kick to them that I really liked and the rough cut meat Mixed in is so tender. I reallly really loved them. The macaroni salad was tasty but not for me, I like the lime zest or flavor that they put in it which keeps it from being too heavy. The elote was almost spot on but i think the corn is from a can. I'd love to see it roasted and chopped off the cob. The topping are great though. <br><br>The corn bread was moist and flavorful and not too sweet. Honestly everything was so delicious we couldn't believe the price we paid. Super reasonable especially for the area! (Hello soho house is across the street!) <br><br>The only negative we had about the food was nothing was like fresh off the grill hot. Which we know it isn't fresh off the grill obviously but we just wished that the food temp was a little hotter? It also Could've been the order in which we ate things which is why we didn't take off a star. <br><br>We also had some drinks. I had a Paloma whose price i winced at but it's pretty large, and my friend had a few beers. Both were great cold and the bar tenders were very nice. <br><br>I love the bar set up. The whole place has spectacular decor that is like country saloon meets Texas chainsaw massacred & barbecued. A little eerie if it's too quiet but it's lively so no biggie! But there's a ice tank with beers including 40s of Colt 45 LOL Incase you're ready to take it back to backyard bbq vibes.<br><br>Overall, we had a great time, great food, wonderful service and music that you will surely dance to while licking your fingers. <br><br>Check. It. Out.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/h9lekmEHDlCberLc4dperA/348s.jpg", "caption": "Spread"}]}}, {"review": {"des": "Love the atmosphere, very cool setting. There was a long line but it went hy fast and ther is plenty of seating. Pork belly was the best!!! Tried the corn, make sure you mix it up good before you eat it, it was delicious!<br>Brisket is cut a bit too thick and it could have been warmer.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Gz1Ze9j6nt7lixlNl1-2uw/348s.jpg", "caption": "Corn, pork belly and brisket"}]}}, {"review": {"des": "I​ can't believe that I never wrote a tremendous review of​ this place since I was there twice in 3 months. <br>Amazing, amazing place!!! <br>We tried the sandwich the first time and then we ordered meat as it is. Always have sides like sweet vegetables​ or spicy pickles. Anyway, it's beyond-words here for meat-lovers.", "pics": null}}, {"review": {"des": "True confession: I can be a huge grump about BBQ. It's great and all, but is it worth waiting in line for a half hour? Sometimes, it' just a lot of sauce and hype over subpar meat...<br><br>I was walking by with a friend and found the \"secret\"ish looking entrance. Wow - it is a cool venue filled with all types of people. It is the kind of place where you could have a chill family birthday, casual first date, or a creative brainstorming session.<br><br>After waiting for the food, we ordered the ribs along with the spiced pickles and frito pie. The ribs were phenomenal. I actually woke up the next day THINKING about those ribs, hoping i had some left to eat! I also loved the frito pie - it was a surprisingly balanced side!<br><br>Overall, I wouldn't hesitate to go back.", "pics": null}}, {"review": {"des": "Let's be clear, i love bbq. When in Chicago, i come here as if i'm a large mouthed bass with a hook in my jaw. Today's visit, first up, the salmon. lightly seasoned, and smoked to perfection. Next, a couple of dry rubbed ribs, a couple of slices of pork belly and some broccoli slaw.<br><br>The wait staff will talk you through the ordering process, helping to not order too much food, nor need to take a loan out to pay (or do dishes) because you ordered too much and come up short on $.<br><br>I'm a repeat visitor from the land of vinegar based & tomato based bbq (NC). Yes, the state is split and i live dead center, i like both. The staff broke me off a little something, and i'm forever greatful.<br><br>As expected, the pork belly was oh so tender... the peppercorn crust and a splash of vinegar sauce made it come alive. The ribs needed nothing, althoguh i dipped them in the spicy bbq sauce.The broccoli slaw, had a good combo of raisins, carrots and sunflower seeds, not too wet nor too dry. The salmon, INCREDIBLE!! I still don't know which i like better, the pork belly or the salmon, i suggest getting both. nothing like a gently smoked hunk/slice of meat. a little pricey, but It's worth it here, plain & simple.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jQ4svgsF14Qwa5laKjX_VA/348s.jpg", "caption": "The salmon"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1t6kuSweBcvDmDdM14lO5g/168s.jpg", "caption": "Salmon top left, broccoli slaw bottom right, pork belly center bottom, dry rubbed ribs bottom left"}]}}, {"review": {"des": "I stopped by Green Street Smoked Meats while I was in Chicago. I'm giving this place 4 stars. I'm a southern girl and while this isn't the best BBQ I've eaten, it was a little better than what I expected. I tried the pulled pork ($9.25), hot link ($6), Frito Pie ($6), and the Elote Style Corn ($4.95) during this visit. The corn was amazing! It's like a Mexican street corn. The hot link was tasty as well and that was no surprise since Chicago has a strong sausage game (that sorta sounded inappropriate lol). <br><br>The pulled pork was just okay. Nothing special. The BBQ sauce wasn't my cup of tea so that may have had something to do with it too. The Frito Pie was presented in a cool way. The Frito bag was a part of the presentation. It was okay, but I wouldn't get it again. <br><br>The restaurant has a really casual, cool vibe. It's set up cafeteria-style so you'll be sharing a table with others. This is definitely a great spot for groups. The bar was large and jumping. You're responsible for getting your own water, utensils, and condiments. You're also responsible for putting away your food. No servers. They give you a lot of meat. I came with a group of four and we definitely could have shared the meat -probably not the sides though. <br><br>This was a cool experience. I'd come back just for the corn for sure!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KtTaWRK7ztRzWMRJZYk_uw/348s.jpg", "caption": "Served on cafeteria trays"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xth04yNPeEAFT8tzX9qk_A/168s.jpg", "caption": "Entrance"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BuxEkCeWZtSf_bRXd5OGnA/168s.jpg", "caption": "Interior"}]}}, {"review": {"des": "Not easy to find, but worth the search. Great brisket and tasty pulled pork. Cornbread was moist and tasted great. Broccoli salad was good as was frito pie. Would recommend real cheese for frito pie rather than cheese sauce. Price was very reasonable.", "pics": null}}, {"review": {"des": "Slab of ribs this is really good barbecue. Okay maybe I need a better adjective to describe the taste and quality of the food. I think superb and scrumptious may work. Anyways I had the smoked salmon, brisket, elotes, beef short rib and cornbread. So much food, we couldn't eat it all. The service at counter was excellent. The location is one of the best food experiences. I found my new bbq superstar.", "pics": null}}, {"review": {"des": "Went for a late Friday lunch and it wasn't too busy, in line less than 10 minutes. Nice indoor and outdoor relaxed space. By this time on a Friday in summer, the place was about half full with people who seemed to take a half day off work to drink. (Yup, full bar).<br>Meats are sold by the 1/2lb or each. They also have sandwiches and of course several sides.<br>We got brisket, pork belly, and a hot link. For sides we got macaroni salad, pickled vegetables, and watermelon salad (a seasonal offering). The brisket was a mixed bag- half was tender, juicy, and excellent; half was more tough and dry. Strange. The pork belly had a great flavor and crust but was very fatty (yes, duh, but more than I expected). The hot link was good. Macaroni salad was the star, honestly! Would get it again no question. The pickled vegetables were not exciting and too spicy for me personally. The watermelon salad was simple and refreshing, with jicama and tajin.<br>My friend (a Chicago resident) I dined with said this is his favorite bbq place in town hes been to so far. I haven't tried any others so I wouldn't know on that account. The smoky flavors were good and the atmosphere was fun, but seems there are some inconsistencies. Overall a good meal.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zmfio0mYl9devGjZgrMeSQ/168s.jpg", "caption": "Watermelon salad, macaroni salad, pickled vegetables, pork belly, brisket, and hot link."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/iApFTOMRa9Et5vLIGUcGvg/168s.jpg", "caption": "Inside"}]}}, {"review": {"des": "I'm a paleo meat & veggies gal. So, for dinner, I always start with salad & vegetables no matter where I'm eating - that sets the tone. No disappointments here! Loved the Broccoli Salad, Pickled Vegetables & Coleslaw (which was NOT swimming in mayo). Then the meat...PORK BELLY!!! Incredible melt in your mouth delicious completely satisfying. Don't need to eat a lot of it to feel satisfied - and they give you more than enough!", "pics": null}}, {"review": {"des": "Well although this is no southside bbq. It has been the best bbq restaurant north of the south side. We had the beef brisket, smoked salmon, short ribs, cornbread, and elotes. All was delish! The rub on the short rib was peppery and full of flavor. The brisket was super moist and a good balance of fat and lean. The salmon was also moist and flakey. Overall very good.  My only critic would be the lack of sides. I wish they had more to offer. Maybe a mac and cheese, fries, etc.  But overall I was indeed happy! :)", "pics": null}}, {"review": {"des": "Walking into this location you can see the nice wooden decor of the place. It's was dinner time so it was very packed together. The seating was cafeteria style where you'll seat yourself at any open spot. Also with the format it can cause it to be a bit loud in the area. But with what I ordered was sliced brisket, pork belly, and smoked chicken leg. As for sides we got the elote & macaroni salad. <br><br>I gotta start with the highlights of the side were great but that couldn't of happen with the amazing flavors added to my palette from the smoked meats. The same apart so easily and it was all so juicy and well seasoned. <br><br>Overall a good place in Chicago to go get smoked meats. But don't take my word go ahead and give it a try yourself if you get a chance", "pics": null}}, {"review": {"des": "So far my favorite bbq place in the city!<br>Food: everything tasted sooooo good!! Highly recommend the sliced brisket: different from the pulled brisket which has a rich flavor of the sweet and sour bbq sauce and only has the red meat part, sliced brisket has a thick fat side which reminds of pork belly. <br>Jalapeño cheese sausage was an ok. Kinda too salty and too cheesy which covered the original flavor of the meat. <br>Pork rib taste good too, but its kinda too lean which made it taste dry.<br><br>Bar: a variety selection of drinks! Loved it.<br><br>Service: its purchased at the counter and find your own seat. So everything is fast. Servers are super happy and friendly which i like. <br><br>Will come back to try other items.", "pics": null}}, {"review": {"des": "Still so good.<br><br>Slab of ribs- 5<br>Pastrami sandwich: 5<br>Cole slaw: 4.5<br>Hot links: 5<br>pickles: 4<br>1/2lb Brisket: 5<br><br>Arnold Palmer and Sawada charcoal lattes for drinks. Ample indoor and outdoor seating. <br><br>Excellent atmosphere, still.", "pics": null}}, {"review": {"des": "We have been going to Green Street for years and it never disappoints! Some of the best BBQ in Chicago and one of the most unique locations and decors in the city.<br><br>A great spot for a unique night out with out of towners or a quick break from the hustle and bustle of the city for lunch.<br><br>Highly recommended! :)", "pics": null}}, {"review": {"des": "The food here is delicious. Meat is great and cooked to perfection. Their salads are also awesome. <br>I didn't put 5 stars because I found the servers not too nice and the Elote Style Corn (the reason why I came here initially) not available. <br>Otherwise it is definitely a place that I recommend.", "pics": null}}, {"review": {"des": "Great bbq, cool decor, plenty of seating.  Moist fatty brisket, tender ribs.  Loved the Pastrami rub.  Pickled vegetable and broccoli slaw sides were huge.  Rolls of paper towels and well napkins at each table so no need to worry about sticky fingers.  BBQ, spicy, and vinegar sauces available as well.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PmLxQdrKvTfUpyUFMHptQw/168s.jpg", "caption": "Pickled vegetable"}]}}, {"review": {"des": "Texas style bbq in Chicago? This place is as good as it gets. Solid BBQ and nice outdoor seating. Grab a beer while you're waiting (there is almost always a long line during lunch and dinner hours so plan accordingly). The brisket was tasty, especially the thick cut with the thin cuts a bit dry and not as fatty as I prefer. Sausage links - juicy and flavorful. Potato salad compliments the meats perfectly with its creamy and cool flavor. Pricy, but will hit the spot.", "pics": null}}, {"review": {"des": "Came here with a group of 8 friends on a Saturday night at 7pm - this place was packed as it is very popular but we luckily were able to get seats. The atmosphere is great with dim light and hanging lights and picnic table style seating. Expect long lines but it is worth it. I got the pork ribs which were tender and the cheddar hot links which were very juicy. While my friends mostly got the brisket which they loved. The short ribs were sold out otherwise they would have gotten it instead. As for the sides I would highly recommend ordering the elote corn which was possibly my favourite part of the meal. Overall I highly recommend this place and would come back. For those coming expect long lines especially on weekend nights.", "pics": null}}, {"review": {"des": "Wow, this place did not dissapoint! I haven't had good BBQ since I was in Dallas, Texas but this really hit the spot. I had been wanting to try this place for  while and finally had the chance. <br> I absolutely loved the interior industrial design which is consistent with the history of the neighborhood. The string lights are beautiful and I like the long communal wooden tables. Theres a nice huge bar in the center as well. <br>The service was good, but not the most friendly people. The food distracts from the brief experience though.<br>I started off with the mouthwateringly delicious pulled pork sandwich and added a side of the HANDS DOWN best elote I have ever had. I got the coleslaw on the side (I'm usually not a fan of it but I was pleased with this light side) Considered making the long drive just to get more elote for dinner!! <br><br>I like the whole seat yourself concept and the ambiance of the place is really warm. I can't wait to go back!", "pics": null}}, {"review": {"des": "Loved the chopped brisket sandwich and the pastrami  We tried the Alote corn which was AMAZING!!! I really liked the macaroni salad it had a little hint of lemon which I loved. We also had the corn bread which was just ok. Next time I would try the broccoli salad because that looked yummy.<br>Overall everything was really good and we will definitely go back!!", "pics": null}}, {"review": {"des": "Updating my review & adding a star. ..<br><br>The service has improved dramatically my last several visits. Prices are still steep even for a high end BBQ joint. Franklin's, La Barbeque and Mabel's are still better, and cheaper, but this is as good as you'll find anywhere else. The links have been more consistent & spicy. As far as sides, the Elotes, Potato Salad and Baked Beans are your best options.<br><br>If you're a BBQ addict like myself, I suggest splurging and trying a bit of all the meats. The prices are listed by 1/2 lb, but you can ask for a single slice of brisket or even one rib. (Shout out to Chris Rock in \"I'm Gonna Git You Sucka\") <br><br>Tonight they had smoked Prime Rib. They're considering making it a weekly addition to the menu. I hope they do because it's delicious. The pastrami was a little dry, but very flavorful.<br><br>GSSM is apart of the same acclaimed restaurant group as The Doughnut Vault. Grab a delicious Old Fashioned to round out your meal.<br><br>My original review is posted below. ..<br><br>Great BBQ, but there is no way to justify $60 ($20/lb) for a slab of pork ribs. Smoque charges $21 for a slab and they've firmly positioned themselves on the Mount Rushmore of BBQ joints in Chicago. <br><br>The service can be curt at times. I understand keeping the customer flow steady, especially because of the long lines, but the \"security guards\" take their jobs a little too serious. The sides are disappointing, but I'd still rate Green Street 4-stars overall if the prices weren't so ridiculous. The hot links were amazing, but they switched to a kielbasa which is run of the mill.<br><br>Green Street is worth checking out if you don't mind splurging. Both sauces are pretty blah, but the rubs are awesome so no sauce needed. Skip the ice cream too. It's overpriced and has zero flavor. Cans of pop are $2.60", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NCnIzdnK3fA4Tiam-Ugpag/348s.jpg", "caption": "Pork Ribs"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wiPMXeyvtsGOkA82ZizCFA/168s.jpg", "caption": "Smoked Pastrami"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ltwwExrLuKHQtF711Gvm9w/168s.jpg", "caption": "Vernors & an Old Fashioned"}]}}, {"review": {"des": "GET IN MY BELLY, GREEN STREET SMOKED MEATS!<br><br>Ahem. Sorry 'bout that. <br><br>But seriously, this place is outstanding! First and foremost, the vibe inside is terrific--it reminds me of if a 1920s warehouse turned into a speakeasy turned into a smoked meat joint!<br><br>Though the sign above where you order says \"meats by the half pound,\" you CAN get other weights, like a quarter pound. So that you can try more types of the deliciousness!<br><br>The brisket is OUTSTANDING! We got a couple pieces of the burnt ends with our meal, and I don't know that I've ever put anything so delicious into my mouth! The pulled pork was also delightful! The pastrami was terrific, too.<br><br>The only thing that could make this place 1000 percent perfect would be a small dessert cup of banana pudding with Nilla wafers!<br><br>Parking is a bit of a trial, but don't let that deter you!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ny4WE5HQsuw3rf-AWWxxYg/348s.jpg", "caption": "Sliced brisket and burnt ends: AMAZING."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/IOqwUOL8-SOo-qi_yFyXpA/168s.jpg", "caption": "Pulled pork! Delish!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7FI_CE0TAcMMYfpaoo3czA/168s.jpg", "caption": "Pastrami! Yum!"}]}}, {"review": {"des": "Green Street Smoked Meats has been on my bucket list for a long time now as I love BBQ and I heard this place was pretty good. I came here on a Saturday afternoon around 4pm for dinner before DMB at Northerly Island. There was barely a line, but it was pretty crowded inside as most of the communal seats were occupied. Plus the heat index was about 105 degrees so that didn't help, but it was comfortable inside. <br><br>There is a bunch of outdoor seating when you walk towards the entrance and then you see a door. You can smell the BBQ through the door and then you enter a pretty big warehouse. There is a big bar in the middle and it's all communal seating. Green Street Smoked Meats is fast casual as you walk up to the right and place your order. The staff will cut the meats right in front of you and then give you your food a huge tray (cafeteria style). <br><br>Since I love BBQ (my Dad and I smoke BBQ together), I usually have to order a 2-3 meat combo to try it all at a new BBQ joint. I ordered a pulled pork sandwich, 1/2 lb sliced brisket, macaroni salad, and Bulleit Bourbon. The pulled pork sandwich was average. I thought it lacked flavor and was a little dry so I had to soak it with BBQ sauce. But the brisket definitely made up for it. It was hot, juicy, tender, smoky, and had a nice smoke ring and bark. My cut had a little too much fat for my liking, but don't get me wrong it was still very good. The macaroni salad was delicious as it was creamy and they give you a huge amount for $5. My buddy is such a good friend and was nice enough to let me try the sausage. The sausage was the best meat that I had at Green Street Smoked Meats. It was sweet, crispy, and had a hint of spice. It was so good! I will have to order the sausage next time, try the ribs, and some other sides. I also heard you can order burnt ends, which are not on the menu. <br><br>The two sauces I tried were the BBQ and Spicy. They were both pretty smoky and had similar flavors, but the only difference was one was spicier. I thought prices were very fair for BBQ. In general, BBQ is not cheap and I thought the prices were fair especially for the West Loop. I paid about $30 for my food and $8 for my bourbon. Service was adequate and they did offer to add white bread to supplement the brisket. I just really needed all of the extra carbs...<br><br>Overall, Green Street Smoked Meats was a very good BBQ place in Chicago. I knock a star off due to the average pulled pork, lack of diverse BBQ sauces, and no Mac N Cheese or dessert. BBQ joints NEED a Mac N Cheese side as BBQ is comfort food. With the amount of choices for sides, I was shocked not to see Mac N Cheese. Also, adding some sweets like a peach cobbler or bread pudding would be nice after having a savory meal. Those are just my recommendations. I've definitely had better BBQ around the U.S., but Chicago is not known for their BBQ. They are definitely a clear second behind Smoque in Chicago, which is very good since Smoque is nationally acclaimed. I highly recommend Green Street Smoked Meats and I will have to come back and try it again!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hSW3iR8VKEx0BvS53ZaXjw/348s.jpg", "caption": "Pulled Pork Sandwich, Sliced Brisket, and Macaroni Salad."}]}}, {"review": {"des": "Been here a couple times. I definitely try to stop by here everytime I visit Chicago. Great location, ample seating, and smells of meat heaven. Went here for a second lunch with a couple friends because I figured they must try it out. We shared a plate of brisket, ribs, hot links, and two sides of mac and cheese and cole slaw. The beef brisket is tender, fatty, with a crispy burnt outer layer. Loved it. Ribs were also banging and smokey. Hot link = delicious. The sides were also very good. This place is just as great as I had remembered it. Will be back again to chow down more on the meats. One of my favorite barbecue joints. <br>Great service, great location, ample seating, great atmosphere, and great food AND beers. <br>Will be back again.", "pics": null}}, {"review": {"des": "I liked Green Street Meats for what it is--a concept of what Texas BBQ would be.<br><br>I don't mind eating at concepts.  It's like enjoying DisneyWorld while understanding that Cinderella's castle isn't really real.  Well, that castle is  real enough especially if you want to pay to meet Cinderella (actually, that amount of money is unreal, trust me) just like the BBQ and feigned hipster ambiance at Green Street is real, but Green Street is what a Texas BBQ joint would like if the Disney creatives got a hold of it--just maybe without Mickey Mouse trays.  <br><br>Green Street Meats creator and head of Hogsalt Restaurant Group, Brendan Sodikoff, when asked what's in his fridge right now during an interview, said, \"I usually have champagne but I drank it all so right now I only have fruit and water. That's it.\"<br><br>That doesn't sound like what anyone I know who eats actual, real BBQ has in their fridge.  That's what somebody who creates concept restaurants has in their fridge.  So Green Street Meats is a concept restaurant and I get that.  By the time I watched the real dude behind the counter carving up the very real brisket with a very real, dark scrumptious bark and watched them fix up my tray, it really didn't matter.<br><br>Hell, I loaded up.  Pulled pork that was juicy and tangy, an oozing, spicy Frito Pie, a container of rough hewn cole slaw.  Two cutesy pie pieces of bread to sop up my mess with.  Drank a few beers.  Told a few jokes.  Right did enjoy myself.<br><br>And that's the whole concept, right there.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ILDSUvAnQaotDvIpK4oUZw/168s.jpg", "caption": "Butcher dude."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DyANAMknzDwd4hQGMB0MFg/168s.jpg", "caption": "Pulled pork and frito pie!"}]}}, {"review": {"des": "We had Pastrami, pulled pork, broccoli salad and macaroni salad. Best Barbecue ever, hands down. Cut to order, smoker inside. Very very good", "pics": null}}, {"review": {"des": "Green Street is a hidden GEM in the West Loop. If BBQ is your thing, this will not disappoint! The restaurant has the feel of a rustic saloon complete with exposed brick walls, ceiling pipes, concrete floors and sink tubs full of nostalgic soft drinks and adult bevvies. When you come hungry, expect your appetite to be immediately cured since there's zero waiting because they load up your tray as you pass through the line. Counter staff is incredibly friendly and will even offer up samples if you happen to be overwhelmed or undecided.<br><br>Note: Everything is a la carte. It's a carnivorous dream with meats by the 1/2 pound, sides and seconds by the each (unit). Music is high energy and the vibe is ultra casual. Seems to be a popular gathering spot of the after-work-crowds. Tables are cafeteria style oversized picnic benches, so be prepared to share a table and possibly make new friends. <br><br>I ordered 1 full pound of fall off the bone good pork ribs, a side of slaw and a large dill pickle. My only complaint is how quickly it all disappeared into my happy belly (kidding - kind of) * the photo below represents the evidence lol<br><br>My friends split an assortment of sides, the same pork ribs I did, pulled pork and pork belly, and some hot links (picture below)<br><br>We all left satisfied and overstuffed, soon to return!", "pics": null}}, {"review": {"des": "Best. Bbq. Ever. and I've had Texan bbq! <br><br>Ok, first off - I don't eat pork and they serve creekstone beef - which is halal - so if you tell them , they will Change ether boards and knives for your order! So considerate of them! <br><br>I ordered the sliced brisket which comes with a sauce.  It was cooked perfectly. I dipped it in spicy bbq sauce and I was in heaven. Order brisket. Chopped. Sliced. Just order it. <br><br>Order the corn! Don't share - order your own. It's delicious. <br><br>We also ordered the smoked salmon - it cake with tartar sauce and lemon. It had the obvious Smokey flavor and was really good. However, I was all about the brisket. But my husband doesn't eat red meat ( so weird, I know!) so, he ordered that and chicken. The chicken had great flavor as well. He ate 4 pieces and the salmon!  I personally liked the brisket over the chicken. I didn't care for the chicken as much. I even liked the salmon over the chicken. <br><br>We also ordered the potato salad and macaroni salad. They were good too - very rich and filling. But if you had to choose one side, it should be the corn. <br><br>The people who work there are extremely nice as well!!", "pics": null}}, {"review": {"des": "Always consider going to other BBQ joints. Look at their menus, read their reviews. Look at the bars that are nearby and see which friends would like to come. <br><br>Then, I remember that nothing in Chicago comes close to GSSM, come back, spend $60 on meat just for myself and gorge on brisket, ribs, pastrami and short rib. Heaven. <br><br>Broccoli salad and sweet pickles string choice for the sides. <br><br>Great craft selection too (like everywhere really...)", "pics": null}}, {"review": {"des": "Oh yea! This great bbq joint tucked in the West Loop has fantastic food in a comfy, cool atmosphere.  A great menu, brisket cut to order right under your nose, tasty sides and friendly service make this a repeat for lunch.  The Mac salad, pickled veggies, and coleslaw were um world class too.  We split a hot link and sliced brisket.  Smoked to perfection and served in a metal tray with paper lining was mowed down on outside on a clean picnic bench with handy paper towels.  A barrel full of ice and drinks (yes take two if you need) was both fun and refreshing.  Lemonade and iced tea was available too.", "pics": null}}, {"review": {"des": "I made it back! Most of my previous review still applies, so I'll make this update quick.<br><br>- The brisket I got was on the end. As a result, one of the two slices was pretty dry and tough. I understand that it sucks to not serve perfectly good food, but if you want repeat business, you need a consistently high-quality product. Serving one of every five or ten people subpar meat is not acceptable.<br>- The elote corn is delicious!<br>- I would buy several bottles of sauce if I could ;)<br><br>Knocking off a star for the dry meat, but only one because I know the rest of the slab was fantastic.", "pics": null}}, {"review": {"des": "Whether you're looking for a drink, or a meal, this is a great place to stop by in West Loop.<br><br>My go to would be the beef brisket. It's the perfect meat to fat ratio. They have regular bbq or spicy bbq squeeze bottles you can choose from (I like the spicy). I've had a side of elote - it's not very authentic, but good enough to satisfy your craving. There's also a bar in the middle of the space - they have beer and also cocktails. <br><br>Overall I love the ambiance here! The dim lights and many string lights give this place a cool vibe. There is also a ping pong table and sitting areas to just hang out at the back. I've been here for Sunday lunch and it wasn't packed, and I've also been here for the bar scene on a Friday where is was packed. Great place to try out!", "pics": null}}, {"review": {"des": "I came here for lunch on a Sunday with a large group of friends (~10 people) and we found open seating at a large table right away. <br><br>Everything is pretty much self-service but there's nothing wrong with that. All the sauces and pitchers of water are by the check-out line. I also like that there are sinks in the middle of the restaurant so that you can easily wash your hands after eating.<br><br>The worker recommended that each person order 1/2 pound of meat. Hubby and I shared a 1/2 pound of beef brisket, 1/2 pound of pork belly, elote, and corn bread. The pork belly was to die for...it was so tender and fatty. I probably wouldn't get the beef brisket next time as it tasted kind of dry. The corn bread was just okay and I didn't touch the elote (hubby loved it). My friends were raving about the ribs which we will definitely try next time!", "pics": null}}, {"review": {"des": "This is without question the best bbq I've ever had.. I would eat here every day if I could.. Texas style bbq at its finest.. brisket, hot links, and ribs all fantastic. You are doing yourself a disservice if you don't get a side of elotes.. it is unreal.. the meat here requires no sauce but if you have to have sauce the spicy bbq is great", "pics": null}}, {"review": {"des": "Having just moved from Austin to Chicago via CA I did not think I could find some great BBQ until my Yelp Community recommended this establishment. I've been to some of the best BBQ joints in Austin ie Franklin's, Styles Switch, and Freedmens. This place is on par with those greats.<br><br>They have a very similar setup as most BBQ joints i've been to. Walk up the meat carver and pick your poison. Sliced or chopped Brisket, Beef Short-rib, Pulled Pork, Pork Ribs, and Pork Belly sold by the 1/2 lb. Sandwiches and a Texas favorite \"Frito Pie\" which is basically corn chips smothered in Chili and topped with whatever meat. We ordered the Beef Short rib and Brisket and can I say amazing. Moist brisket and fall off the bone Beef Short-rib. The short rib was by far the best i've had. <br><br>Franklin's BBQ is known for their meats but their sides are just average. Green Street sides where full of flavor and looked homemade. We had the coleslaw, broccoli and potato salad. They have more sides options which i'm sure are great but i'm biased because \"The Meats.\"<br><br>If you enjoy great Texas BBQ you will not be disappointed. The service staff is very friendly. Full Bar, brewed tea, and sodas. They feature indoor and outdoor seating but when times are too hot they close off the building for some good A/C. Just a nice friendly atmosphere, great food, and good music.", "pics": null}}, {"review": {"des": "Delicious! Elote & macaroni salad are the best sides ..... Great vibe! Only thing I have to say is ask for your receipt..on two occasions I have been over charged. Pay attention to your receipt. I'm hoping it was an accident but after hearing about this from someone else as well  I'm doubting it. <br><br>Anyway, the food is exceptional but being charged over 13.00 dollars on each visit is outrageous. Check your receipt!!", "pics": null}}, {"review": {"des": "I love that Green Street is one of those hidden restaurants you find in the alley way. Once you step in, you realize that there is another dimension to what it looks like from the outside!<br><br>I had a pretty upsetting stomach, so I couldn't eat much for dinner. If I had to sum up Green Street, it would be: rich, salty, dark. <br><br>Rich: flavors are pretty deep, both in the meats and sides. <br>Salty: sodium overload for me!<br>Dark: the ambiance is really dark, with the twinkling lights hanging above the tables. <br><br>Ordering process:<br>1) Get in line<br>2) Order first with the \"meat guy\": all meats are weighed by pound OR by item (ie: one beef rib)<br>3) Order sides with the \"sides lady\": white bread is for free!<br>4) Get some sauce at the sauce rack and find a seat<br><br>Tips/Observations:<br>-There is only 1 meat guy who cuts all the meat....that's why the lines are so long.<br>-Come early! And I mean, before the 5 pm dinner rush. Or else, be prepared to wait for a good 30-45 minutes if you aren't too far back in the line.<br>-Another tip is to come late, but you risk running out of beef ribs and pork ribs.<br>-Sit outside if you want better lighting and a quieter ambiance.<br><br>We ordered:<br>1) 1 lb of Pork ribs // Meaty, and pretty juicy! <br>2) 1 lb of Chopped brisket // A bit too much fat, but a good portion size! We also got the super fresh one.<br>3) 1 order of Hot link // too salty...pass.<br>4) 1 side of Macaroni salad // I like! I mixed it with the brisket, huehue which made it even better.<br>5) 1 side of Broccoli salad // Ehhh. Everyone likes this, but I was okay with it. I just needed to fit some greens in!<br>6) *free* 4 slices of white bread // Standard. You can't go wrong with wonder bread!<br><br>Would I come here again? Probably. How long would I wait for? Max 30 minutes.<br><br>PS: Gets pricey, but the portion size justifies. Definitely share with people!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/h31rQ_iydC3Jo-yI0lHStg/348s.jpg", "caption": "Pork ribs"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xKPBMgaDMkP2IMZnsCZUEg/168s.jpg", "caption": "Dinner"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/92IqPFf1jvmiuhlv2u0K5w/168s.jpg", "caption": "Sides"}]}}, {"review": {"des": "It's so refreshing to go to a barbecue spot where it's obvious that they take the time to actually smoke their meats.  None of that boiled garbage here.  The smoked brisket was fall apart tender and flavorful and the ribs had a deep smokey flavor and LOTS of bark.  My favorite ribs are the ones my husband and I make in our smoker at home, but the ribs from Green Street were the closest I've found to our standards. <br>We also tried the pastrami sandwich at the recommendation of a close friend and it too did not disappoint.  The pastrami was tender and flavorful and perfectly complimented with the buttery brioche bun upon which it was served. <br>Green Street is definitely a bit more expensive than your average barbecue joint but the meat quality makes it worth it.  I will say I drew the line a couple places......I wanted some cole slaw to eat with my bakes beans, but I just refused to pay $4.25 for some cole slaw.<br>The interior of the restaurant is like a modern warehouse meets saloon.  There are long tables with bench seating so if you're there during peak hours you may be sharing a table with another group (I didn't mind this at all, but worth mentioning).  The tables are long enough that even if you're sharing with another group there can still be significant room between the two parties.  There's an outdoor seating area near the entrance.  Keep in mind that the restaurant remains completely open to the outdoor seating area so if you go on a chilly day the air from outside will be coming into the restaurant.  If I'd known that before going I definitely would've altered my clothing selection.  <br>All in all, great food, fun atmosphere and I will definitely be back soon.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EpbP9rhvcq5vRL1A5lKQSw/348s.jpg", "caption": "Pastrami sandwich (left) and brisket sandwich (right)"}]}}, {"review": {"des": "Very busy night. Food was delicious as always. Can't recommend this place enough for team dinners or informal night out with friends. I'm from Texas and I'll say the BBQ is on par with what I would expect.", "pics": null}}, {"review": {"des": "This place is absolutely amazing.  The decor and environment is \"cool\", there's no other word to describe it.  You will feel cool just being in there.  <br><br>Now, the food.  We chose the chopped brisket and pulled pork.  Both were well smoked and had amazing texture.  It was not at all dry.  My only knock would be the thickness of the bbq sauce because it seem a little thick to really soak into the met.  However, the taste was delicious.  The pastrami was good.  <br><br>The sides are little dishes of flavor-all different flavors.  My favorite is the elotes  corn salad. It was served warm and the balance of flavors just made you want more.   The cornbread was unlike any corn bread that I've ever tasted.  Very moist and a great balance of texture and sweetness.  Plus, they serve it with honey butter.    The potato salad and macaroni salad was fresh tasting. <br><br>It is a relaxed atmosphere of communal tables with plenty of napkins on a roll.  So sit down, relax and savor the flavor and atmosphere.", "pics": null}}, {"review": {"des": "Yes, just yes. Green Street Smoked Meats literally does everything right. I'm talking instant salivation upon entrance. While I came earlier in the day for Sawada coffee's military latte, the smells of GSSM drew me in. <br><br>Grungy and cozy atmosphere with strings of Edison bulbs traipsing on the rafters just makes you feel at home. Full bar in the center of the warehouse for any and all your libation needs and several mess hall style tables and benches leaves enough space to find a seat. <br><br>So I had a difficulty time choosing what to order, all of it looked heavenly. I ended up going with the pulled-pork sandwich with sides of cole slaw and the elote style corn. All I can say is WOW flavor explosion. The pulled pork was perfectly melt-in-your-mouth mixed with the right amount of smoke. I added the spicy BBQ sauce to part of it and let me tell you, the sauce had a perfect consistency and the right amount of spice. The real star of the show though was the elote style corn. The flavor profile of the corn was a blend of creamy, cheesy, and never wanting it to end. I recommend anyone to order the elote style corn, you will not be disappointed. I still have dreams about my flavor experience at GSSM, it was that amazing. I will for sure be back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Acrrn2WfduQ_56dlosSNlA/168s.jpg", "caption": "Pulled pork sandwich with coleslaw and a side of elote corn...amazing"}]}}, {"review": {"des": "I'm from Texas, so although I can't say that green street is great bbq, it's still very solid. We came around 9pm on a Tuesday night so they had run out of several options, but we were able to try a half pound of the chopped brisket ($12.95) and a half pound of the pork belly ($12.50). Also got two sides, the potato salad and the macaroni salad (for $4.95 each). <br><br>They share a space with sawada coffee. And it's a really cool space with lights strung from the ceiling.", "pics": null}}, {"review": {"des": "While visiting Chicago, we got the hankering for some good barbecue on the Sunday of our departure. After a thorough Yelp search, we settled upon Green Street and we don't regret that decision one bit!   Apparently, we lucked up by catching them at a point where only one other person was in line.  The ordering process is a model similar to those you typically see at Texas barbecue restaurants but much faster with the meats being cut to order and the sides being on a cafeteria-style line. We had our food at the table in less than two minutes which was great for our tummies! All of the sauces, utensils, beer, and water are self-serve and the seating is open.<br><br>Now on to the food:  Having our own competition team, my husband and I consider ourselves BBQ snobs / connoisseurs and we're not easily impressed; however, the food at Green Street surpassed our expectations! We ordered brisket, pork belly, hot link sausage, and ribs for our meats along with potato salad and elote as our sides.  Hubby asked for brisket cuts from the point which provided melt-in-your mouth slices from heaven.  The belly was tender without tasting too fatty and the ribs were just as tender without being overcooked. The sausage was tasty as well and seemed to have a pretty good snap. The meats all stood alone without the need for sauce which is always a great sign.  Nonetheless, we tried both the basic and spicy sauces.  I preferred the spicy as the basic sauce seemed overpowered by chili powder.  The elote outshined the potato salad but it was still some good tatersalad!  <br><br>The neighborhood of the restaurant is quite trendy with us wishing we had discovered it sooner.  There are many other highly rated restaurants and bars along with same strip but Green Street is tucked away in a very unassuming building.  We now have a new staple when visiting Chicago and hopefully the popularity and growth of the area won't compromise the food before our next visit!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JILGhR981WZl844JzXExmQ/168s.jpg", "caption": "Clockwise from top: sliced brisket, pork belly, ribs, hot link sausage, potato salad, and elote... split across two adults with leftovers."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ofwAX-MDNLGdSeadEuygng/168s.jpg", "caption": "Very cool interior with self-serve condiments, drinks, and utensils."}]}}, {"review": {"des": "I've stopped by this place so many times for High Five Ramen and Sawada Coffee and I finally got to try this place! The interior is one of my favorite parts with all the strings lights and wood paneling! <br><br>I ordered the pork ribs and elote, and they were both really great! The pork ribs were super tasteful but were a bit on the drier side. And the elote was AMAZING holy crap. It was super creamy and had the perfect level of spice and I would definitely come back just for that. There was a bit of a wait since we came at a peak house but it was worth. Great experience overall!", "pics": null}}, {"review": {"des": "When i walked in this place it looks amazing on the inside. Then you order amazing brisket, outstanding ribs, juicy chicken. This place is my favorite stop in the city. I've brought 4 different groups of people when they visit and this place never lets me down. New fans with every trip.", "pics": null}}, {"review": {"des": "Atmosphere-although it was a cafeteria style get your food and shared table place the facility including the rest room was always clean. <br><br>Food - my favorite was the pork ribs and the elote. The rest was good but could pass. <br><br>Price - it was a little on the higher side. <br><br>Wait - came during lunch time on Saturday the line went by the bar that was in the same facility/warehouse but I moved pretty fast the wait was less than 20 mins you could also order a drink while you are in line. <br><br>I would revisit this place if it was for a friends birthday but I wouldn't go out of my way.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TuzxEJPkxMKbdfNR1LHn2w/348s.jpg", "caption": "Elote and pork ribs were my favorite!"}]}}, {"review": {"des": "Being a transplant from Texas, i haven't found a BBQ place in Chicago i love yet until today. I always have to request plain white bread at other bbq places as it's weird to me to have a hamburger bun for bbq. <br><br>This very Texas style. Communal seating, order by the weight of the meat, take your food on a tray, bus your table. <br><br>The sound in there was perfect too. They figured out that perfect ratio of music to people to where you don't have to yell at the person across from you, but you also don't have to hear the person sitting next to you. <br><br>If you're missing Texas style BBQ or wanting to try something pretty authentic -- i highly recommend this place. <br><br>If you don't understand how much meat to order, 1/2 pound is plenty for two people to make a few fold overs each (take some meat and some sauce in one slice of bread and fold it into a sort of meat taco) my boyfriend and i got 1/2 pound of brisket and 1/4 pound of pulled pork and we ended up taking a little home. The elote cup is spot on. The coleslaw was amazing. I don't think you can go wrong at this place. We will totally be back", "pics": null}}, {"review": {"des": "Though not quite the BBQ fare of Texas, Green Street Smoked Meats is one of the best BBQ places I've tried in Chicago. The people working behind the counter are very friendly and knowledgeable.<br><br>Sliced Brisket, Pulled Pork, and Pork ribs were all amazing. My favorite was probably the pork ribs. I love the crust and flavor on the outside and the meat was very tender. The brisket was also super soft and you could literally cut the slice with your fork. Pulled pork was average, not bad though.<br><br>Sides: we ordered the broccoli salad, cole slaw, and elote style corn. Among the 3 of us, we all loved the elote style corn--so cheesy and creamy! I also loved the broccoli salad, fresh and sweet. I was not a huge fan of the coleslaw but my friends liked it.<br><br>Ambiance: very hipster and I love both the indoor and outdoor seating. Inside can get quite loud, so conversations might be hard, but I still love this place!<br><br>Definitely check this place out if you haven't!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/J-jrWev4XLq9_DXzYO2--Q/168s.jpg", "caption": "Ambiance"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vBpbvXHPKeGH4Jna5jQuOg/168s.jpg", "caption": "Brisket, pulled pork, pork ribs, and 3 sides"}]}}, {"review": {"des": "Delicious food in a fun atmosphere. A little pricey but I think that is expected in the middle of Chicago. <br><br>Loved that food is served cafeteria style for quick and efficient ordering. In warmer weather there are many options for seating outdoors as well as inside. For the volume of people there on a Sunday, it would have been very packed if outdoor seating wasn't an option. The restaurant appears to also share the space with a coffee shop.<br><br>My favorite item I ordered was the elote corn. Very flavorful and creamy. I also had the Thunderbird sandwich. I liked it because it had a nice kick to it. Left that burn sensation in my mouth, even started to sweat a bit. Feels so good! Bun was thick and wasn't a thin bread slice like lots of other BBQ places. <br><br>They had a few BBQ sauces - a sweet and a spicy that I didn't get to try since my sandwich was tasty enough on its own. <br><br>I'll echo another reviewers comment that the bar staff seemed very annoyed that we ordered drinks. How dare we pay them for something they offer!! Lose the attitude - it takes away from the relaxed vibe.", "pics": null}}, {"review": {"des": "One of my co-workers recommended green street meats to me and decided to try it out.<br>The place is very nice, love the outdoor space with lights everywhere. The staff was nice and gave a sample of the macaroni salad. We went with the baked beans, pastrami sandwich, sliced brisket, macaroni salad, and a link. The baked beans were really good, loved he sweetness. The pastrami sandwich was a bit too dry for my liking but the slices brisket was also good. The sausage link was the best on my platter. The spicy bbq sauce was really good. <br>Overall, green street smoked meats is a nice place with friendly people and good food. I would like to come back and try their pulled pork.", "pics": null}}, {"review": {"des": "Hog salt (the restaurant group behind this restaurant, au cheval and other great establishments) knows what's up. We got a pound of ribs, half a pound of pulled pork, brisket, and pork belly with a ton of sides for only $92. 4 big guys couldn't even finish it. It was great, but the ribs and brisket, which are usually my favorite were a little dry this time. They also gave us free doughnuts from their other restaurant doughnut vault and they were absolutely superb.", "pics": null}}, {"review": {"des": "I lived in Kansas city for years and this is the only BBQ that is comparable to KC. It's a little expensive but definitely worth it. Maybe its expensive because I always order so much food cuz it's so delicious. The corn elote has the perfect amount of spice to it. The brisket is super juicy. It's a seat yourself place and sometimes it is difficult to find a place to sit, but people are nice and will let you crowd their tables.", "pics": null}}, {"review": {"des": "Two words: jalapeno cornbread. It's worth the visit alone. Everything else is just extra deliciousness.", "pics": null}}, {"review": {"des": "I usually stop in Green Street for drinks, mostly because they run out of meats by the time I get there!! <br><br>So here I am, continual celebration of bday month, and boy was it a treat! Plenty of meats left on Sunday @10p. Lonnie, our 'butcher' was awesome and really made our experience one of a kind; just when I thought I knew what amazing service was, Lonnie tops it off with just #AMAZE. Our cashier, Devin, was great as well!! <br>Ugh everyone was so good to me, it hurts... can I move in here, please? I'll clean for free! :P <br><br>The vibe of the place is like a speakeasy-romantic-Lumineers-music-video barn. drive slow, or else you'll miss the sign! <br><br>Onto foods! <br>PORK RIBS $9.95/.5lb: RECOMMEND these were one of the best ribs I've ever had in chicago!!!! Usually restaurants slather ribs with sauce, but no ma'm, these were perfect! I'm dreaming about it right now... <br><br>PORK BELLY $12.5/.5lb: RECOMMEND yes!! Blissful mouth-orgasm crack-addict state, check! If you don't like fat, stay away from this one, it's basically 70% fat. The pepper on the charred side of the belly really gives a nice texture on each bite... like candy. <br><br>PULLED PORK SANDWICH $11.5: recommend - I don't like pulled pork due to abundance of sauce, so I can't say much but my friend loves pulled pork and said these were '5 stars'. <br><br>CHOPPED BRISKET $12.95/.5lb: Chopped brisket is shredded and cooked in sauce like pulled pork. Due to this, I can't review without bias. <br><br>POTATO SALAD $4.95: recommend <br>MACARONI SALAD $4.95: recommend <br>These sides complimented our meats so well - not too overpowering in taste and texture was great. These are served cold by the way. <br><br>DONUT: donuts taste so good. It's chocolate with sprinkles. I had leftover and refrigerated it, the next morning donuts we're still very moist and velvety! <br><br>They only have 1 kind of white wine available - Pinot Grigio (unknown brand), but it's $5/glass so who caressssssssss :)<br><br>There's street parking available, free meters on sundays.<br><br>They ran out of sliced brisket *super sad face*, so hoping to try on my next visit!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/O3n4lQ7fJEOf-nOBflMpnA/348s.jpg", "caption": "10.15.17 donuts!!! YUM"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cLWqMV1_pGyp_Q8jKlGUHA/168s.jpg", "caption": "10.15.17 menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4ulILDRJmn6MkZ9YWPAmAg/168s.jpg", "caption": "10.15.17 pork belly $12.50 per 1/2 lb"}]}}, {"review": {"des": "This was probably one of my favorite meals while I was in Chicago in July. The outside of the restaurant was very magical. As we walked in, it had a very rustic vibe which I loved. Really liked how the lights paved the way in the restaurant.<br><br>I love the process of ordering at this place. It's a cafeteria style in a sense. First you wait in line and grab your tray. You can see the butchers chopping up your meat and it's glorious. You go up and choose what meats and sides you want. You get your food as you pay and then you choose your seat and grab your drink.<br><br>I forgot which type of meats I got, but I do remember that it was delicious. We got a side of white bread and got the sauces on the side. <br><br>Every time I come back to Chicago, I will definitely hit up this place.", "pics": null}}, {"review": {"des": "Fantastic fun atmosphere.<br><br>Food was so delicious. Elotes were such a party in my mouth, with so many contrasting flavors.<br><br>The meats were as positives- well seasoned, super smoky and tender. I will be dreaming about the short ribs and brisket for a few months until I go back.", "pics": null}}, {"review": {"des": "I came here on a Saturday night and it was packed! There was a long line for food but luckily there's a bar in the middle so you can drink while you wait. I came to Chicago by myself but these two gentlemen in front of me were kind enough to strike up conversation and invited me to eat with them! <br><br>I ordered the pork ribs, brisket and potato salad. Everything was so tasty! Probably one of the best briskets I've ever had. There was too much food, even the guys I were with couldn't finish. With that said, its worth the wait if you want amazing bbq in Chicago.", "pics": null}}, {"review": {"des": "This place may be the best BBQ I've ever had. If it's not it's tied. I've eaten BBQ all over this fine country including Texas with staples like Franklin BBQ. This rivals anything I've had anywhere. <br><br>I encourage you to order all together with your party so you can try as much as possible. Always order your brisket moist too. <br><br>They have sauce, but you probably won't even think to put it on as you shovel the meat in your mouth. <br><br>The ribs are a must have. Must. Have. <br><br>The sides are not the best I've had but I was too full of meat to really dive into them. The have street corn which was good. I like my beans a little sweeter.<br><br>Also an awesome space. I could hang out here all day and I probably will next time I'm in Chicago.", "pics": null}}, {"review": {"des": "The service here was fantastic, so kudos to the wait staff and the guys behind the counter because everyone was friendly and welcoming. You go up to order at the front and seat yourself; we sat at the bar and the bartender let me try the cider before deciding with a generous 2 oz pour so that was cool. We shared the pork belly and the pork ribs, both of us liked the belly more. Sides were really good, get the broccoli salad it's not heavy on the mayo. Busy but lots of space at 430 on a Friday.", "pics": null}}]}