{"name": "greek-islands-restaurant-chicago", "reviews": [{"review": {"des": "Each year for many years running, we meet family at Greek Islands in December.  My wife's aunt (Corky) has been coming here for decades and knows most of the long-term staff.<br><br>Tonight, Pete took good care of our small party of four.  We had some traditional Greek appetizers, the Saganaki being my favorite!<br><br>For dinner, two of us ordered Lamb Chops (so good!), one ordered Gyros Plate (also great) and the fourth ordered Pork Chops in Mushroom Sauce.  I also had a side of Pastichio.<br><br>For dessert, we shared Baklava and a Greek Delight (I think it was called).  <br><br>The entire evening was great.  Thank you Pete and Greek Islands!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AfLoilNXXPsrr2rbaA_hHg/348s.jpg", "caption": "Potatoes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GVoE2g3_J5-JQvXOemAZCQ/168s.jpg", "caption": "Pastichio"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OMq2O9fnn5Q4-MpzcgO66w/168s.jpg", "caption": "Lamb Chops"}]}}, {"review": {"des": "My family and I grew up eating at Costas/Plaka, and would go there for all of our major celebrations, so even though we're not Greek, we're familiar with the popular foods and dishes. I hadn't gone to a Greek restaurant or Greek town since my parents left Chicago 20 years ago. They returned this weekend to celebrate your Dad's 75th so I decided I wanted to throw him a surprise birthday lunch. I chose Greek Islands because Plaka no longer exists, I read the reviews, and thought, sounds good enough! <br><br>Even though I had called the restaurant to discuss  and reserve a space, I decided to go there with my husband to actually check the space out, try to food, and confirm the preselected menu.<br><br>We went on a Sunday evening and as soon as we walked in my husband noticed a burnt, off putting odor. I also did but it didn't bother me as much.<br><br>I was quite disappointed with the quality of the food. The fish spread was always one of my favorites at Plaka, a light pink and full of flavor. But this one was dark pink...like way too much dye, and hardly any flavor. The moussaka also lacked flavor and wasn't what I remembered and my husband said the gyros was dry and baklava was not fresh.<br><br>Since the invitations had already gone out, we stuck with it, but I was so expecting to be underwhelmed with disappointed parents, the day of the party.<br><br>So fast forward to the day of the surprise party. I called the day before to review everything. But the day of the party, I had to review the menu again with them.<br><br>Anyway, now for the positive part of the review...<br>The staff did a wonderful job with getting seating arrangements and everyone ready for the big surprise. My family and I walked in and the waiters were great with making sure the surprise moment was successful.<br><br>There were several waiters attending to us and all were attentive and helpful. It did feel a bit rushed at times, but to be fair, it wasn't a private party room.<br>But the best part was the food! It was so much better than a few weeks ago and everyone raves about the flavor! <br><br>So, in all, it turned out to be a pleasant experience! I would just say that if you plan to have a large group event here, you will need to confirm, review, confirm, review. But it was fun! It was worth it!", "pics": null}}, {"review": {"des": "Three of us ate there on a Sunday night. Very busy. Seated as soon as we arrived. Waiter came right over with menus and asked for any drink choices. Huge menu,  took us a few minutes to decide, but waiter returned as soon as we put the menus down.<br><br>One of our party was from Greece so that helped in deciding what to choose. She conversed with the waiter in Greek to further help in the choices. We ordered a lamb shank, pasticcio to share and the flaming cheese and the zucchini with skordalia as an appetizer. All were beyond good. Very large portions. Very fast service.<br><br>Will return and recommend.", "pics": null}}, {"review": {"des": "DELICIOUS! My fiancé and I are in Chicago visiting his sister and we're too tired from our early morning travels to go out to lunch when we arrived at her gorgeous apartment. I found Greek islands on yelp and chose to order because the pictures and reviews were phenomenal- It was a fantastic choice. <br>The grilled octopus appetizer was perfectly cooked and flavorful- i didn't know what to expect since we were having it delivered by door dash- but it really was so delicious. The horiatiki salad was fresh and the dressing was perfect. The taziki sauce was out of this world. Highly recommend!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/t3j_Tdv7Hv3vzZ4VQSh2qg/168s.jpg", "caption": "Grilled octopus appetizer"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qvvmbM4pVZgUtC-z_obxBg/168s.jpg", "caption": "Horiatiki salad"}]}}, {"review": {"des": "LOVE this restaurant! Reasonable prices for terrific service and food! I was worried about a wait since they wouldn't take reservations for a party of 4 on a Saturday night, but I ended up not having to wait at all. I'm not sure if that was luck, or if it's frequently that easy to get a seat. Our server was funny and kind. He quickly took our orders and our food came out promptly. We ordered appetizers, drinks, and main courses. When we split the bill, it was a little less than 30 per person. I had the moussaka and loved it! It was sooooo filling, so I had a lot of food to take home. Everything was delicious and we were all very content and satisfied. I highly suggest coming here!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5tjwgd3_tgwoac2MCpCWXQ/348s.jpg", "caption": "Moussaka!"}]}}, {"review": {"des": "Definitely one of the better Greek restaurants I have been to. Everything was fresh and traditional. I started off with the olives and the horiatiki salad. Olives were terrific. The salad was exactly what I would expect from a Greek restaurant. Just so fresh and the feta was not overly salty or watery, it was just exactly what I was looking for. <br><br>For my main course I got the arni fournou which is a slow baked lamb with brown potatoes. Let me tell you something. My grandmother makes the best baked lamb I have ever had, and this was a very close second. The meat just fell off the bone, the spices and flavor was perfect, it wasn't dry, and I can go on and on. I would go back and get that every single time I could. <br><br>Highly recommend if you are in Chicago and want some good, traditional Greek food.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9GChdBmX9TTY1nnh6gPuBA/348s.jpg", "caption": "Arni Fournou"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RPK6lPVIHRzWhrdGDun5IQ/168s.jpg", "caption": "Baklava"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/y6crd4Ev5YCP062HK8l3mg/168s.jpg", "caption": "Olives"}]}}, {"review": {"des": "This place has been in business since the 1970's for good reason- it just gets the customer experience right.  From the free valet parking out front to the gracious service once seated, we felt comfortable and well looked after on both visits thusfar.  The menu is somewhat overwhelming, but we've enjoyed just about everything there.  Grilled octopus, any of their appetizers, and anything with lamb were particular highlights.<br><br>The atmosphere can seem somewhat circus-like at times, and there were sometimes long periods where we couldn't track down the server, but overall this is the place we'll come back to in Greektown.", "pics": null}}, {"review": {"des": "Near the end of our Chicago stay, our friends introduced us to this renowned Greek restaurant, where we partook in a feast derived from the restaurant's extensive menu.<br><br>First up was tasty Calamari Fritti--both rings and tentacles--and flaming Saganaki Cheese, which not only was a spectacle to look at, but also a very satisfying salty starter in the shape of a square.  To my surprise I also liked pink-colored Taramosalata, basically Greek caviar to spread on complimentary bread.  And, an Athenian Traditional Greek Salad with Feta Cheese was big enough to serve two.<br><br>Diane enjoyed fillets of grilled Mediterranean Seabass cut off from the fish's head, while I was well filled by a Stuffed Tomato and a Stuffed Pepper filled with ground beef, herbs, cheese, Pine Nuts, and rice that were both covered with Tomato Sauce.  No room remained for dessert.<br><br>Service was first-rate, and our table on the lower level of tiered seating  before the open kitchen afforded a great view of chefs at work.  Greek artifacts and decor added to the feel of a classical Greek restaurant.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ukTxniQd8kNcuh3GBEAXBw/348s.jpg", "caption": "Flaming Saganaki Cheese"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vWjasoMQi28H7DYiQNgnCg/168s.jpg", "caption": "Athenian Traditional Greek Salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iktMh63Se9fSrqBpkqJPkQ/168s.jpg", "caption": "Taramosalata"}]}}, {"review": {"des": "This is it: the best of the best in Greektown, the cream of the crop, the head honcho that is, Greek Islands. Everyone and their mama's have been or talked about this place until its roof has blown up, and now, after having eaten here for the first time, can see why...this food is incredible! Greek dining at its finest can be found in this landlocked, four-walled island, with specialty food from the gorgeous European country made with love for their hungry and loyal customers. <br><br>The moment I sat down, I already knew what I wanted for an appetizer: the always talked about, Saganaki. The order was placed, and a few minutes later, my server came with the skillet of Saganaki in one hand, and a lighter in the other. My guy lit that bad boy up, and WHAM! The dish was ready to be served. My date and I took our first bite of the cheese, and we both absolutely loved it, oh my God. I, for one, am still thinking about it to this day. Seriously, some mind-blowing cheese, these Greeks have hidden from the rest of the world. Wonderful way to start off a meal.<br><br>For the main course, I looked over and over at the large menu, and figured that I want a little bit of everything, so I got the combination plate, which included these delicious leaved grape bites called Dolmades, some potatoes and rice, eggplant, and a few strips of lamb. Everything was out of this world, with a special shout out to the lamb and Dolmades. Outstanding.<br><br>The service was friendly, and the owner who was at the front desk was everything; just the nicest guy in the world. A fairly busy Sunday night, and he was going by every table just to see how everyone was enjoying their meal. A picture perfect owner, this guy was. <br><br>Everyone raves about Greek Islands, from the tourists to the locals, and now I finally get it. Their cuisine is one of a kind, with unique meals and ingredients to their foods, coupled by a comforting environment. Did I mention that this is a perfect place to bring a date? Because it most certainly is! You'll probably be able to woo any girl (or guy) over with a nice quiet dinner date at Greek Islands. This neighborhood in general is a wonderful place to be at, so if you've never had Greek food or you are a fan but have just had the basics, you gotta check out one of Chicago's best in this area.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fX6XkfybvbLjxZJ68law6w/348s.jpg", "caption": "Saganaki mmmm"}]}}, {"review": {"des": "Best gyros I've ever had hands down! You have to understand I'm super picky with meat the meat on these Euros is slow-roasted and finally shaved no filler looking weird stuff in it. It is good! We ordered the Gyros. But first I had questions because it said lamb and ground beef. I don't do hamburger or ground meat of any kind is a texture issue. So I questioned it and he took me back and showed me the slow roasting meat and how the guys shaved it off. I don't know why it says ground on the menu but it is not ground. Maybe a language barrier issue.<br><br>But these are authentic Greek people... Which I love being from a little town in Ohio it's nice to see this  authenticity. The people working there were warm and friendly great service great atmosphere great food. I got a glass of the Merlot... Didn't love it is very tart.<br><br>When you order the Euro they bring you one pita bread a plate full of meat couple tomatoes some sliced onion and a little dollop of the cucumber sauce stuff. It was enough meat for two or three people... Needed more Pita breads and more sauce. The sauce is awesome since I had lots of meat left over dipped it in the sauce I made it plain. Which isn't like me since I'm not somebody that really likes me a lot. Was literally a vegetarian for 10 years. So when I say this meat is good you need to go try it I'm not kidding. It was so good and we were so hungry I didn't even take pictures which so isn't like me. But if you ask for extra sauce and extra pitas you definitely could split it with somebody and it still be plenty", "pics": null}}, {"review": {"des": "As I was looking for a place to explore in Greektown, I came across this restaurant which had great reviews online and claimed to be America's most popular Greek Restaurant.<br><br>We were seated quickly, right when we entered.  There was a lot to order from the menu.  I personally was confused on what to order and was only suggested the most expensive dishes which were the specials.  I wanted them.  I ended up ordering the flaming saganaki cheese, combination plate, and baklava.<br><br>The $7 saganaki cheese was a little overplayed.  I thought the staff was going to let us know when they were going to light the cheese, but they did it without us even noticing.  It was rushed.  I personally love cheese, but my friends said it was a bit much.  We all agreed it was a bit salty but the bread helped.  The olive oil was amazing and paired well with the bread.  I wish it was warm bread.  It came out in a nice basket but was precut into some huge pieces.<br><br>The $20 Combination plate came with a roast leg of lamb (pretty dry), mousaka (really soft and mushy), dolmades (my first time having it, tasted pretty good), meatball (regular like any other), and vegetables and potatoes (majority of the plate, but well seasoned).  If you are more of a meat eater, I'd suggest ordering something else.  Meat quantities were lacking and were just filled with more vegetable fillers on the plate.<br><br>The $5 Baklava was cold and not very flaky.  Stale phyllo dough and such a small portion was disappointing.  I expected more from an authentic greek restaurant.<br><br>Service was great.  They cleared our plates and always filled up our water.  Food was pretty lacking and not worth the $40 I paid for food, tax, and tip.  Greek atmosphere and friendly staff did make it more enjoyable though.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kEAAdEHXZMQLYn0Ypvs1VQ/168s.jpg", "caption": "Baklava"}]}}, {"review": {"des": "My apartment is just near the Greek town. so I heard the restaurant so many times. After graduating,My classmate has to go back to China.we came here with a lawyer. The food here is so good. It tastes like Chinese cuisine! So yummy! I want to order the lamb which is my favorite meat. But I order the sea food instead! Lol!always!<br>I will try lamb next time!<br>P.s the waiter here is so nice!", "pics": null}}, {"review": {"des": "I enjoyed the dinner here. I came with two Greek friends and they took care of what to order which was awesome. <br><br>We shared some appetizers. My friends strongly recommended fried zucchini and it was very good: nothing special but comforting and tasty. We also had Saganaki (the flambeed cheese that everyone orders). It was interesting. A fun side note: my friends told me that the exclamation \"Opa!!!\" as the server kindles the cheese is actually obsolete in Greece but that it's still here because the restaurant owners immigrated to the states back from that time. Bekri meze (a pork dish) was also enjoyable.<br><br>I ended up ordering salmon for entree. Again, it wasn't anything special but what I wanted, so no complaints. Overall, I appreciated the experience: almost felt like I was in Greece for a moment.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/j8p_e4Ejbw3Me_fco4RhNw/348s.jpg", "caption": "Salmon"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/K2tt5JdpTxlbfMG-j5RJgA/168s.jpg", "caption": "Fried zucchini recommended"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FS8IwrBuQwXSwEuGerX7ug/168s.jpg", "caption": "After the flame"}]}}, {"review": {"des": "Good greek food. <br><br>I went here with a large group and we got a bunch of appetizers, which came out fresh and hot. We each got an entree, which were good portion sizes, hot, and tasty. The prices were modest. <br><br>I recommend the restaurant, and I also recommend it for big groups. It was a really fun vibe and great place to go.", "pics": null}}, {"review": {"des": "Our experience dining at Greek Islands was topnotch.  I am from Tarpon Springs Florida which has the largest greek population in the US and therefore amazing greek food options everywhere.  I had been researching places to try in Chicago (once the saganaki craving hits, you can't fight it) and decided this place had everything I was looking for.  The food was fantastic! The saganaki, the wine, the octopus entree, kebabs, grilled veggies, and fish were all recommended by our server and did not disappoint.  The best part was the prices! Everything was reasonable. And huge portions! It definitely reminded me of home and I can't wait to go back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sriDev7Tdj6JFxB6CHYunA/168s.jpg", "caption": "Grilled whole seabass. Great deal!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FerJNbBK-6EDotcDydHydQ/168s.jpg", "caption": "Grilled octopus - tender and lemony"}]}}, {"review": {"des": "My favorite place to get Greek food in the city of Chicago. Conveniently located in Greek town it is a perfect place to get dinner before an event or game at the United center. They are good about getting you in and out because the restaurant itself is ginormous! <br><br>I like to start with a cup of their lemon rice soup (avgolemono) which is light and very tasty. Next you can't go wrong with some flaming cheese (saganaki) and a gyros plate. Everything is fresh and delicious every time. The waitstaff is always great, and the establishment is very clean. <br><br>If you like fresh Mediterranean food you have to check this place out. <br><br>Only con: the grilled octopus is awful and very chewy so do NOT order this dish. Everything has been so good for over 10 years I couldn't take away a star for this, but please take it off the menu or cook it right!", "pics": null}}, {"review": {"des": "Recently I experienced Greek Islands for the first time, and after walking through the doors and realizing that it's quite a spectacle, I'm surprised I hadn't visited sooner. My boyfriend and I dined in on a Sunday evening while Taste of Greektown was going down. It was pretty busy on the surrounding streets, but when we arrived around 8:30 or so, we still were seated quickly.<br><br>It is very large in here, with quite a few large tables and small tables as well, for dates or one-on-one gatherings. We were seated in the main dining area, and were immediately brought water and bread. I noticed right away how the waiters were all very professional and dress tidily. <br><br>To drink, we each ordered Heinekens, because we have class! ;) We also ordered Greek salad, Tzatziki, and Saganaki to eat with our bread. I'd never had Saganaki before this particular evening, and was amazed when the waiter brought it out, set this giant-ass block of cheese on fire, and put the griddle on the table. I will now only eat cheese if it is set on fire and plated beautifully in front of me. Greek Islands has set the standard.<br><br>I knew I was already filling up on bread and cheese, but was there room for an entree? Of COURSE. After careful deliberation, my choice ended up being the Bekri Meze, because I'm a big fan of pork. The Bekri Meze is sautéed with red wine, onions, peppers, tomato, with extra virgin olive oil, and served with rice and a potato block. There's probably a more eloquent name than \"potato block,\" but that's what it was! And it was a mighty delicious potato block. The pork was easy and delicious to eat, and just the right amount of chewy, and I really loved tasting it with the green peppers and tomato! <br><br>I was blown away by my experience here. Not only is it extremely pretty inside and made me feel like I was on vacation, but the food was exceptional, and the service glorious. I loved the little table scraper that our waiter used to scoop up all of the bread crumbs at the end of our meal, because it made me feel like I wasn't the only one who always makes a bread crumb mess. They already had a bread crumb cleaner-upper on hand!<br><br>Thanks again, Greek Islands, I'll be sure to return!", "pics": null}}, {"review": {"des": "Extremely bustling and busy, we came on a Wednesday for dinner and had an hour wait for a party of four. The staff were fairly nice but don't let you begin waiting unless your entire party is there (ie one person can't come in and put their name down first) which is pretty annoying. The restaurant is HUGE - the ambiance is very loud with so many people chatting and ordering saganaki it's a really fun atmosphere. <br><br>The menu is extremely large and a little overwhelming. They have quite a few options as well as daily specials that take up a separate menu. Not all of the staff speak English extremely fluently, which was a bit trouble since we had some dietary restrictions, but they were extremely nice and tried as best they can to accommodate. <br><br>The portions here are MASSIVE. I think three person could reasonably split one entree if you weren't too hungry. Even the dolma were huge - almost 3x the size of a normal dolma and stuffed more with meat like a meatball than the usual rice and veggie stuffing. The saganaki seems extremely popular given just how many people ordered it - probably some cheese getting lit on fire once every five minutes when we were there. They do a good show of a huge flame, but a very half-hearted opa. The cheese itself was way too salty it was almost inedible. The grilled octopus was alright but drenched in too much oil. <br><br>I think Greek Island is a sold place to take a large family. With how big the portions are, it'd be a great place for family style sharing. I found the food itself to be just okay, with a really fun bustling ambiance.", "pics": null}}, {"review": {"des": "We were in town for the weekend and we had the opportunity to have a large family dinner here. <br><br>We all ordered the family-style dinner ($24.95/person), and there was lots of food! The family dinner included bread + butter, appetizers, 4 entrees, sides, and dessert.<br><br>Service was average, but we did have a large party and the entire restaurant was crowded. <br><br>One suggestion I have is to include more English descriptions of the menu items. It's nice that the vast menu includes more than your average gyro and moussaka, but this suggestion might be helpful to others not familiar with the culture.<br><br>Greektown was a pretty cool experience, and we wouldn't mind coming back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/H0ThI71uhzsT-K_w7pkBow/348s.jpg", "caption": "Moist and delicious chicken!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/V4UZHMT9v4BEV2tJgSUAZg/168s.jpg", "caption": "Keftedes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vRfengrZHlog4fjH05v-Tg/168s.jpg", "caption": "Moussaka"}]}}, {"review": {"des": "Amazing restaurant with great food. This restaurant makes me feel like I am in Greece with their design. We ordered different appetizers and all entrees seafood. <br>They have a very nice whole grilled fish, recommend to try. Also, grilled cheese they make like a small show with a fire.", "pics": null}}, {"review": {"des": "Went to Greek Islands Restaurant on a recent trip to Chicago and it was pretty good.  They make a fried cheese and it was amazing!  Went in on a busy Friday night and was seated pretty quick. I was with a few friends who really like to drink and we had a bottle of wine, a few shots, and a lot more food and alcohol. I have to say the wait staff at this place did amazing!  They took great care of us even though the alcohol kicked in pretty quick!  <br><br>We had a few appetizers like the cheese that was set on fire and the smelt. I did not like the smelt but everything else was amazing!  Again I would go back to this place because the service was so darn good!  I highly recommend this place!", "pics": null}}, {"review": {"des": "We came here Sunday night at peak dining hours, and were able to get a table within 15 minutes (they had told us that it was about a 25 minute wait). Not bad! We had just ordered our drinks at the bar and were enjoying the people watching when the pager buzzed.<br><br>We got seated in a part of the dining room that resembles the side of a Greek island (Santorini to be exact). There are various dining \"terraces\" on this island. It seems a little theme park-ish, but I guess it adds to the atmosphere and charm.<br><br>Well, it was only 7:00 pm, and they were already out of many of the specials (all our first choices!). We got the grilled octopus to start (it was sooo good!). For my entree, I ended up getting the pastitsio, which is always a good standby. My partner got the grilled lamb with rice and potatoes. Everything looked and tasted good. We shared a bugatsa (basically warm filo with custard filling and cinnamon and sugar).<br><br>Service was good overall. Also, what I like about Greek Islands--and all of the other Greek restaurants--is that they offer free valet parking!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XhJb3kz7l9wyyt5x_XoBdw/348s.jpg", "caption": "Peas"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ot2XeBg2FXQuy508-namgA/168s.jpg", "caption": "Pastitsio"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FlKgrz-mwnG6u2HbJF0qXg/168s.jpg", "caption": "Dessert"}]}}, {"review": {"des": "I've been here a handful of times over the years, and would say it's the place we usually end up when we go to Greektown.<br>Free Valet Parking is the first thing you'll notice here, which is available across the street as Santorini as well.<br>Today, we started with the flaming cheese appetizer. It's a staple in this restaurant, and is delicious. Salty, crusty, and gooey, you must try if you haven't before. I got a gyro salad which comes with freshly cut gyro meat on top of iceburg lettuce with olives, onions, tomato, cucumber and a nice side of tzatziki. Also seen at the table today was dolmades filled with meat and rice, mousakka, and a \"Greek islands special dessert\" which was a bit like a baklava covered with custard and whipped cream.<br>The service is good and fast, and you'll always get refills of water and iced tea pronto. The menu is giant, and you'll find something for everyone.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/36F-lHW_mFLJg7sgEtleKA/168s.jpg", "caption": "Gyro salad"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VDG9KKB72r1OZLhXxFT_zg/168s.jpg", "caption": "Moussaka and dolmades"}]}}, {"review": {"des": "Ok food was fantastic!!! Ambiance was wonderful and service was beyond outstanding. Our server, Angelo, was beyond exceptional!!!! I have food allergies, am picky, and have super high expectations. The trifecta right? Angelo was perfect!!!! He knew what we needed before we knew it, his service was prompt, he had amazing food knowledge on their expansive menu, was so kind and helpful. Please ask for him if you go there. I cannot commend what an awesome server he is and how he made the whole evening enjoyable.<br><br>Keep up the outstanding work Angelo!!!!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7mcFoa9SkatDI-6UiGNnUA/348s.jpg", "caption": "The table that is waiting for you at your next visit the Greek Islands in Chicago's fabulous Greektown."}]}}, {"review": {"des": "Talking about having a nice cute romantic rustic dinner with a date this is the place to go.  The restaurant is made just like if you were in the Greek Islands.   The food is very delicious and plentiful.  I loved the gyros it was so delicious but end up taking most of it home.  I order my plate of gyros with grilled onions it was to die for.   The saganaki flaming cheese was very good.  The grilled octopus was very tender and juicy.  The fried calamari were a little bit too well done but the taste was still delicious.  The lamb shank with rice and tomato sauce was extremely tender and yummy. <br>The service was so nice and I loved the fact that I asked the to warm my sesame bread and they did wow thank you it was so warm and crunch delicious<br><br>And was is not to love the Greek island restaurant complementary valet parking.  I love valet parking specially when it is complementary.  No hassle looking for parking or getting ticketed or towed in Chicago.  Free valet parking.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5noZYNOi6NLRQexCJrURww/348s.jpg", "caption": "Lamb shank I loved the rice"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qe9OB0aGIce3m9HUqFFdJQ/168s.jpg", "caption": "Octopus grilled yum"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/frdyljgnNBESufPXpMmsPg/168s.jpg", "caption": "Calamari"}]}}, {"review": {"des": "Honest review:  food wasn't good n everything was luke warm. Like I said in previous reviews such as my taxim review Chicago does not have good Greek restaurants we have good Mediterranean ones but not just Greek we do have good Turkish ones though which is similar to Greek called cafe orchid but maybe Michael Simon or someone else will open a place here if anyone knows a good greek restaurant let me know the service was ok the bus boys in my opinion were better then the servers. Its a big restaurant n the inside looks like greec thing was the saganaki <br><br>Saganaki: this was actually good sometimes it can be salty or not even cooked well but it was perfect nice n hot n flavorful n melty u know sometimes it's not even melted<br><br>Combination: the lamb in this was terrible luke warm, the dolmada was ok was luke warm n the sauce wasn't flavorful neither was the filling. The meatball was seasoned good but it was lukewarm n really dry. The mouseaka was good but lukewarm and really mushy<br><br>Calamari: it was really over cooked n didn't have seasoning n the cocktail sauce was really old So it tasted weird<br><br>grilled octopus: it was lukewarm over charred so bitter n didn't like the balsamic vinegar sauce<br><br>Fish gumbo: this was really bad it had a really fishy smell because they used canned tuna :( n it didn't have any salt who wants to eat canned tuna soup don't think even a cat would<br><br>Lamb shank: tender but flavorless n the sauce was to sweet a Greek pilaf rice sauce should not be sweet or should be straight up tomatoes <br><br>spanakopita: this was really gross the phill was flaky but it was so bland n the frozen spinach made it so mushy<br><br>Gyro: tender n pita was toasted good but thats the only good part never had a bland gyro before", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bnhNUjhvzzPChzexl7-EWg/348s.jpg", "caption": "Bill"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RQfjCZJtYMpGq66fP4U9_w/168s.jpg", "caption": "Spanakopita"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/F_NACAMhwkamd4mIV_pRjg/168s.jpg", "caption": "Spanakopita"}]}}, {"review": {"des": "Nice place for a date. <br><br>Though that's not why I came. I actually ate here with a friend. <br><br>The cheapskate inside me wants to say it's not worth the price, but she needs to just shut up, ok? The food here is really delicious. It's not going to be the cheapest dinner you'll find, but damn it's going to be tasty! <br><br>The environment was nice. Bright and festive and nice enough for an interesting date. Not exactly intimate, but interesting, for sure. <br><br>It was a little bit busy, and although the staff was friendly, they weren't as attentive as I would hope. There are a lot of options on the menu and if you come hungry and indecisive you might have a tough time figuring out what you want to eat.<br><br>I ended up just ordering some appetizers as my meal. (3 appetizers and a tip cost me about $30...a little more than I would normally want to pay for my own dinner.)<br><br>Started with and split the saginaki with my friend - OPA! Feta(?) cheese soaked in brandy and set aflame right in front of you; melty, buttery, tangy, delicious! Paired with their soft, slightly crusty awesome bread, just give me like 3 orders and roll me out!<br><br>I then had the Kontosouvli - pork on the spit, served with onions, pita and horseradish yogurt sauce. Damn this sauce was way better than any tzatziki I've ever had. The pork was flavorful and delicious, and honestly the appetizer portion would have been enough for an entree in my opinion. <br><br>I also had the Shrimp Tourkolimano - shrimp baked in a tomato-garlic sauce and a blanket of crumbled feta. Boy it was good! I loved sopping up the sauce with the bread. The pita was good too, but not as good as the bread they bring to the table.<br><br>Between the 1/2 saginaki and those two appetizers, I was stuffed and had a little bit leftover for lunch the next day and it was even tastier!<br><br>Just writing about this makes me want to go back and get it again!", "pics": null}}, {"review": {"des": "Greek Islands is delicious! I came here the other night for dinner and everything was scrumptious.The dolmades and spanakopita are great choices. Great service and very nice atmosphere. Looking forward to coming back soon!", "pics": null}}, {"review": {"des": "My boss swears by this place as being one of the most authentic, long-lasting Greek restaurants in Chicago. Personally, I thought it was good and the cheese they lit on fire was extremely enjoyable. <br><br>Now, it's debatable when I say it compares to some of my other 4 stars, but, when it comes to Greek, this is one of the better places I've tasted. <br><br>The service was on-point, food came out quick, and I was completely satisfied with the flavor. If you want Greek and in the area, then do it. I don't know a better place for Greek.", "pics": null}}, {"review": {"des": "I've been here twice in my life, probably 5 years apart from each other and few things have changed. That's a compliment to the food, and a suggestion to the decor. <br><br>The food is still incredible. Great quality Greek food, lamb is still cooked to perfection. <br><br>The decor, could use some updating. Not the place for a swanky date, but definitely the place for a great dinner and even better service.", "pics": null}}, {"review": {"des": "It's sooo good!<br><br>This was my first time trying Greek food and I am seriously impressed!<br><br>Upon walking in, you are greeted by an interior that resembles, I'm assuming, the atmosphere of Greece. I've only seen it in pictures and movies but it's so pretty! Then there is a case of some seafood to show just how fresh it is in here!<br><br>The food was so yummy! We only had appetizers- which I recommend if you are looking to experience a lot of flavors. We had the grilled squid and a shrimp dish. They were both so yummy. You also get complimentary fresh baked bread. The whole wheat pita we got was also good.<br><br>Will be back!", "pics": null}}, {"review": {"des": "This is my favorite place. Come here with my family all the time. Love it !!!!  service is great food and pricing. Can't beat it.", "pics": null}}, {"review": {"des": "Another Greek Restaurant that is on the top of my list when I go to Chicago. I like it for the cool setup throughout the whole restaurant is themed like you are in Greece with the walls to paints etc. It all flows very nicely. I enjoy a lot of appetizers and love Saganaki so that is my favorite appetizer. <br><br>I usually get the chicken dinner with the rice/ red gravy sauce on it. It is my favorite thing to get there because the chicken is cooked perfectly. I always save room for dessert and depending on my mood it can vary from rice pudding to chocolate cake. I really have no complaints on this restaurant because they have improved since the start of going there so it is a restaurant that really values the opinions of the customers feedback.", "pics": null}}, {"review": {"des": "You may want to update your hours in Yelp. You were recommended as a late night spot to grab a bite. We arrived at 11:10PM and your doors were locked and no one inside. We walked to the Walgreens down the street and had to get subs instead. Very disappointed as we were set for some great Greek food", "pics": null}}, {"review": {"des": "The place was so packed on a Saturday night, that it was an hour wait for a table of 8. But luckily, the wait was worth it! We were seated in the heart of the restaurant. The entire place was set up to depict the city of Greece. There were different levels with white washed walls and tables. The waiters were bustling around serving flaming food. It was crazy!<br><br>The extensive menu offered a variety of dishes with all sort of meats.<br>We ordered a few appetizers:<br>Flaming Cheese: served on a skillet with flames rising from it. Deliciously sinful!<br>Trio Cold Dip: 3 different dips served with fresh pita bread<br>Grilled Octopus: Beautifully grilled and charred, that it tasted almost like chicken!<br><br>I ordered the Chicken Kaboobs: 2 large portions of skewered chicken & grilled bell peppers, accompanied with a side of rice & potato. It was very flavorful and filling. Portions were massive. <br><br>Minus 1 star for the slightly impatient waiter who would answer my questions with a scoff. <br><br>Definitely a great place to try when visiting Chicago, right in the center of GreekTown.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AAyMyEjTbp3qs8ucc9VbnA/168s.jpg", "caption": "Side of rice & potato"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-Fuk0UJ2dWk_eSllW8KUyg/168s.jpg", "caption": "Chicken kebabs"}]}}, {"review": {"des": "Excellent seafood and appetizers! The husband loves the lamb shank and a side of okra. This is a wonderful place for large and small groups. Free valet! <br>Service is very reliable and teamwork is very apparent.<br>I highly recommend Greek Islands!", "pics": null}}, {"review": {"des": "Came to Greek Islands for the first time last night for a Board dinner. <br><br>Location: I work in the west loop so this was a great hop and skip from my office. I walked despite the Chicago cold which for how much I ate was probably a good idea. I can't speak to parking in the area but pretty much once you get on to Halsted it isn't so bad. I got an uber quickly on my way home. <br><br>Ambiance: Really cute place and HUGE. We were seated in a party room in the back which would be nice for a small gathering (baby shower, bridal shower, private birthday party). <br><br>Wine: drank ALL of the house table wine. really good!<br><br>Food: Let me start with- I think I would have liked it better if I could have ordered my own food off the menu. We had preordered family style food. The first thing they put down I think was eggplant? I thought it was hummos but it was really salty- wasn't a huge fan (wish I knew what it was called). Then came the saganaki (photo)- which I can't believe I've never had. Game changer. I ate ALL the saganaki wrapped in bread. We then had greek salad with a giant block of feta on top- yum. Main course was chicken (nice and soft), lamb (I don't eat lamb), some kind of pork dish (also don't eat) and spanakopita (not a huge fan). Sides were rice (meh) and potatoes (yummy!). I wouldn't do family style again but others loved the food. Finally- the baklava. simply heaven.<br><br>Service: 5+ stars for the service. The manager came over and personally asked each of us how everything was. My glass was never empty (no wonder I have a headache today!) and a dirty plate never sat in front of me long. <br><br>Thanks for making our dinner an enjoyable experience!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/W6z_KxB_U3lZYvIVbjZcQw/348s.jpg", "caption": "Saganaki 12/7/2017"}]}}, {"review": {"des": "Temperate climate.  Beautiful people.  Few tourists.  My trip to the Greek Islands was fantastic.<br><br>I'm currently avoiding tomatoes since nightshades are poisonous.  Also, MSG causes cancer.  Luckily, I was able to eat none of that and had a delicious octopus instead.<br><br>Five stars.  <br><br>My Name is Ledio.  <br><br>Go Balkans!", "pics": null}}, {"review": {"des": "Totally awesome Greek food.  Great service and great servers.  Free valet parking.  All around awesome.  <br><br>We started with Saganaki, olives & feta & grilled octopus.  All were superb.  Also 1 in our party had the chicken lemon soup.  Superb as well.  <br><br>Entree's were lamb shank in tomato, lamb shank in lemon cream sauce with potatoes, carrots & artichokes, spanakopita & shrimp in red sauce with feta.   Just wow.  All were amazing. <br><br>Mmmmm good!!!", "pics": null}}, {"review": {"des": "Coming from Houston, TX, we happened to be in Chicago for a family gathering and we wanted to try a restaurant in Greek town. A family friend recommended Greek Islands Restaurant, so we made a reservation for 21 people. The restaurant happily accepted the reservation and we were scheduled for 5pm dinner, giving us enough time to still walk around Chicago after. Once we arrive, the restaurant was packed, yet as promised, our table was ready for all us within 5 minutes of us arriving.<br><br>Looking through the menu was quite overwhelming. It is huge! They even have a separate daily specials menu which gets updated everyday, and a separate drink menu. While everything sounded delicious, I was a bit disappointed because the menu could use better descriptions of what everything is. I'm quite familiar with Greek food, yet there were still a lot of traditional Greek items that the average person would have no idea what it is based on the name alone. The menu could also be improved if they provided pictures as well. Due to our large party though, we opted into doing the family style dinner.<br><br>The family style dinner is $24.95/person, but includes 1 appetizer, choice of soup or salad, choice of 4 different entrees, choice of either rice/potatoes or mixed grilled vegetables, dessert platter, and coffee/tea is included. The choice of 1 appetizer and 4 entrees does come off of a smaller pre set menu to choose from.<br><br>For our appetizer, we chose this Greek garlic/potato spread, but they made a mistake and brought us this Greek cod roe/potato spread instead. We were disappointed in that they messed up our order, but we let it slide and didn't say anything to change it. Fresh bread is also served as well to all the tables with olive oil straight from Greece. Our table also opted for the Greek salad instead of the soup, the salad was your average Greek salad. For our 4 entrees we chose the roasted leg of lamb, mousaka, keftedes, and the chicken souvlaki. All of these were pretty good, but not great. Out of the 4 entrees, the chicken was the best. We also chose the mixed grilled vegetables over the rice/potatoes, these were well seasoned. Lastly for dessert, the dessert platter had an assortment of baklava, and 2 other desserts I didn't know the name of. All 3 of the desserts were tasty, yet a little too much on the sweet side. They tend to have a heavy hand with the honey and rosewater. Dessert was served with our choice of coffee/tea as well.<br><br>Service throughout the dinner was average. I think the wait for our entrees was a little long, but in their defense we did have a big party while the restaurant was completely packed as well. Overall the restaurant deserves the 4 star rating. I'd recommend this place to others, but would hope that they adjust their menu a bit in the future and work on their service a bit more. The food was good, just not great.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8M8UvlePngXS_A1igT5OCg/348s.jpg", "caption": "Mousaka"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GN3KUNPK1WVEE5gGZr0VAA/168s.jpg", "caption": "Greek chicken dish"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fXXk7jI6CjZ3LFVpult2Yw/168s.jpg", "caption": "Roasted leg of lamb"}]}}, {"review": {"des": "Complimentary valet is always a good way to start! Walked in and the ambiance was amazing. We were walked up a small flight of steps to our seat. (It gave it a very Greek Island look). I ordered a white wine for a drink( delish). <br>Appetizer: Flaming cheese. Very tasty but salty. The presentation was worth it though and I got to say opa! <br>Main course: leg of lamb with rice and potato. The lamb was so succulent, tender, and juicy and the potato was nicely seasoned and also very tasty. The rice and sauce was also a nice compliment. The service was good and it was nice staring at pork and lamb being roasted in the kitchen! Will definitely return!", "pics": null}}, {"review": {"des": "Had to knock off a star because our charming waiter seemed a bit distracted and kinda forgot about us a couple of times, but otherwise LOVED IT.  Food was just to die for. Great atmosphere. Good value. I wish we had a Greek Islands in Seattle.", "pics": null}}, {"review": {"des": "The food is always great and they know it.<br>The reason why I didn't put 5 stars is cause the employees are quite serious, not rude but serious(not so friendly) cause they don't care. The restaurant is always full of people. However, me and my partner we had nice time and we definitely come back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/9ND0FQjMnVmdQvOQZAAJLg/348s.jpg", "caption": "Wine menu"}]}}, {"review": {"des": "I've asked a few reliable friends what the go-to spot for Greek food in Chicago is, and without pause the answer is always Greek Islands. Having not made my way here in 3 years of Chicago though, I thought it time to finally make a visit, and I can say I thoroughly agree with the endorsement.<br><br>Walking in your struck by the size of the location. It's a massive space with something like 5 different rooms, each with very open seating and rustic grecian finishes that very much make you feel as if you're transported out of Chicago. Everybody is very friendly to start despite the apparent hustle-and-bustle of the establishment(it can get very full), and the use of elevation in the floor design is beautiful. They have a room that you can reserve for special occasions, which is a perfect fit for this restaurant, but even without it the place is probably still turning over ~1,000 or so meals a day.<br><br>We started off with the Saganaki, and then each chose to do a pick 2: make your own combo set. I chose the Mousaka and the Lamb Loin, while she got the chicken riganati(dark meat) and the pasticcio. What I think this place does well is providing authentic, honest Greek food. They focus isn't trendiness, it's hospitality, and they do so by using straightforward, non-offensive seasonings that emphasize fresh ingredients and don't overpower the base proteins of the dish. My favorite thing that I ate was the Mousaka, which was an delicious amalgam of eggplant, ground meat, and sauce that would I imagine be similar to what you'd have at someone's home.  Pasticcio was essentially the pasta variant of this, and the lamb loin was quite meaty and wholesome(though the menu did confuse me a little...I would have expected the loin to be sliced and the leg to be on-the-bone instead of vice-versa). And of course, a combination of flaming cheese, lemon juice, and fresh bread can never disappoint, and it's obvious why essentially half the tables would order it.<br><br>Service is impeccable but not overbearing, which is a difficult line to tread. Water was always full, food was brought out quickly, and even crumbs on the table and finished plates were wiped off and taken immediately. All done with barely a word, so that we could enjoy our meal and not feel pressured to say, vocalize our enjoyment or get a dessert. Aside from rotating daily specials, I would imagine the place really excels when you come in a large group and get a family style dinner, where you pay a flat price per person and get to choose from an array of different appetizers and entrees, paired with salad and desserts.", "pics": null}}, {"review": {"des": "We came here for dinner and was surprised to be seated right away. Parking in this area can be very difficult so their complimentary valet parking is very convenient. <br><br>Their service was also very great. Very friendly and welcoming and very prompt. We started off with their flaming saganaki. It's was delicious. Nothing out of this world or different than what I've had at other Greek restaurants. <br><br>I ordered their combination plate, which came with a roast leg of lamb, it was very tasty. Mousaka which is pretty much a Greek lasagna. The major difference is that the Mousaka has Mediterranean flavors. Dolmades, meatballs, veggies and Greek potatoes. I was impressed with every item with this plate. <br><br>Overall I was very satisfied with Greek Islands. From their service to their good. I'd definitely come back. My wife and kids also enjoyed this plays as well.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aNd9mupzhykM0bgrOyIMmA/168s.jpg", "caption": "Combination plate"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/m8IbLYikop6ZD9WRHJeSZg/168s.jpg", "caption": "Flaming saganaki"}]}}, {"review": {"des": "AWESOME! I am a huge meat lover and I was so so satisfied after trying this one. See how much meat my friends and I ate! And they were very juicy, tasty, and of high quality. I will definitely recommend it to everyone who come to Chicago looking for a meat treat! You shall never forget!", "pics": null}}, {"review": {"des": "I have bigger expectations coming here. I felt like the service was \"old hat\" and worn out. The waiter going through motions and just looking to move people. The saganaki, for instance, had an unenthusiastic presentation followed by half melted cheese. <br><br>I went with the gyro. I found it dry and uninspired. A friend had the stuffed lamb which was much better than my dish. I did also have the lemon rice soup which was good.", "pics": null}}, {"review": {"des": "Our favorite Greek restaurant :) <br>This is our go to restaurant to celebrate any special occasion or just where we go for a nice evening out.<br>We are never disappointed and always leave satisfied<br>great food and great service..<br>highly recommend ..", "pics": null}}, {"review": {"des": "Loved to be able to get a home cooked.meal late in the evening. Some restaurants huff when you come in late....not this place....veru warn and friendly. Food was awesome even at closing......excellent", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QQHdg9gwwvlf3nLn7pJDEQ/168s.jpg", "caption": "Chicken n rice and vegetables"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Z2bjv_nrkjINT2VgFWEnkQ/168s.jpg", "caption": "Leg of lamb... Rice n potato... Mmmmmm"}]}}, {"review": {"des": "I don't get over to Greektown very much which is a shame, but I promised myself I would do better this year since I live not too far from it.<br><br>I had some friends in town and they were in the mood for Greek cuisine. This place had the best reviews on Yelp so we went with it. Called to make a reservation around 6:45 pm and they told me there was no need and to just come in. Once inside I really saw how large the place was. They had squid and other things on display which I thought was cool and put me in the mood for some grilled octo. <br><br>Once seated we started with glasses of rose' since we were already sipping some on the riverwalk before we made it over here.the menu was very extensive and filled with goodies but I opted to go with the specials menu. We started out with hummus and bread. The hummus was good but heavy on the garlic. For the entree, I went with the Lamb in Tomato Sauce along with greek spinach from the specials menu. That meat slid right off of the bone and that sauce was amazing! Spinach was delightful and so good that my friend kept digging her fork in my plate. <br><br>Loved my meal here and the service was stellar all the way from the hostess to the server. Will definitely pay more visits here!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3WPgfxCZgDwu8AtEGJzArg/348s.jpg", "caption": "Lamb in tomato sauce along with spinach...very good!"}]}}, {"review": {"des": "To sum it all up... Mediocre service with okay food!<br><br>The wait wasn't very long to be seated. Once we got to our table, our server asked what we wanted to drink. We just ordered water and he asks if we're ready to order. We said \"no\" and he just walked away. When he comes back, we ordered and he was gone again. We got our food and part of our order was wrong but the waiter was long gone before I could tell him. The waiter comes back and starts collecting our plates without asking if we were done. I was dipping bread into some sauce and he grabs my plate and walks away!! The waiter starts clearing off the bread crumbs off of our table (also... it wasn't even that busy. There were three empty tables by us) and then he takes the bread basket which I was still eating from away. He didn't even talk to us or ask if we wanted dessert. He just brought the check and left (notice a pattern here)? He takes our payment and finally says something to us, which was \"thank you\" and then leaves again. WOW. <br><br>We ordered the broiled octopus and seafood kabob. The broiled octopus was a little burnt and drenched in oil and a ton of balsamic vinegar. The seafood kabob was not worth the price - you get one kabob. My favorite was the bread, so there's that. I would've ordered dessert if the waiter asked me, but I just felt rushed.<br><br>My experience was horrible compared to the other reviews. I was definitely not satisfied at all!", "pics": null}}, {"review": {"des": "My fabulous friend recommended this restaurant for a very belated birthday dinner.  There is free valet when you walk in which was greatly appreciated. When you walk in, there are many dining rooms and the host was very nice.  You are greeted by a generous display of Octopus and other seafood in a large cart.  We were seated in the main dining room that has a fireplace.  <br><br>The menu is overwhelming but I'm glad as there was options for the pickiest eater - me!  I opted for a glass of pinot grigio, while my husband had beer.  A generous portion of bread with sesame seeds was brought to the table while my friends feasted on hummus, wheat pita and Saganaki - great choice btw.  The Saganaki is brought out and lit on fire which is more for entertaining, I'm assuming, but tasted amazing. It was like eating warm melted mozzarella.  I ordered Mediterranean chicken which was very tender and rice on the side. I wasn't too fond of the rice as it was on the greasier side but still enjoyed it.  My husband opted for the fish dinner which included soup, salad, fish, dessert and coffee. <br><br>The waiter was extremely nice and patient. He strolled by our table at the right times.  The atmosphere was vibrant, loud and intimate at the same time. This is a great place to show off to your friends or enjoy a nice night out with your significant other or family.", "pics": null}}, {"review": {"des": "Real deal Greek food prepared and served by a great and friendly staff. <br><br>Very large menu with traditional American style foods and an extensive list of beef, lamb, chicken and seafood appetizers, dinners and combinations.  <br><br>Fried cheese is a must as a starter. <br><br>Not sure what to order? Just tell your waiter what you like and don't like and he will order for you you.  A great place.  <br><br>Wine list very limited. Some inexpensive california and Spanish reds and a bunch of Greek whites and reds - but you would have to be quite adventurous to try those.", "pics": null}}, {"review": {"des": "I brought my son to Greek Island in Lombard for his birthday. We ordered two Gyros and a large Greek Salad. 48.00 bucks. The Gyros were so dry and thinly cut. No flavor.  We got a plate full of onions and one tomato slice and it was a small one. I had mine to my son.. Now I didn't realize there was 2 sizes. Because the  waiter never informed me of this.  But that is besides the point. If these Gyros were even good I have mind paying 15.00 for one.  Next time I will just go to a real Greek take out. So much better and cheaper.", "pics": null}}, {"review": {"des": "We went to Greek Islands on a Saturday night at 8ish pm. It was a 30-45 minute wait, we were given a buzzer. We only waited maybe just under 20 minutes before it buzzed. The place was packed and loud. Seating and tables are pretty close to each other, not an intimate, romantic spot. <br><br>It seems very family, big-group oriented. Large bar area behind the hostess stand to the left after you walk in and we were sat in the large dining room with two levels. The hummus served with pita was good. I had a Greek salad with grilled chicken per the servers recommendation as to the most popular salad. I would come back to indulge in a not so healthy dish.<br><br>Service was good, attentive enough but he (as with the rest of staff) seemed very busy.", "pics": null}}, {"review": {"des": "Super busy!  Definitely make a reservation,  the Flaming cheese is the best.  It's a nice show and it tastes great.  I had the lemon rice soup, grilled squid too, no complaints. I ordered dolmas but was so full when they came I didn't eat them.  Others enjoyed them.  I'd definitely go back for ambience and good food.", "pics": null}}, {"review": {"des": "Guys I love this place. I come here for all special occasions and finally was able to bring my parents here tonight. <br><br>Tonight was a disappointment. I don't know why the service was so bad. We felt so rushed through our meal. My girlfriend was mid bite with her salad and the busser took her plate away. \"I can take this away? Bec your food is ready.\" Is what he said. <br><br>I work in a restaurant and this would be unacceptable. <br><br>The family style is usually the best deal, but the spread didn't come with pita this time.  We only get one meatball now. We were 4 and only got one saganaki. This does not make sense, it should be 2 saganaki for 4 people. <br><br>My waitress would come in and place the food on the table and before I could request a new knife. <br><br>I sat on the left side of the restaurant in the corner tonight. <br><br>This has to be under new management. This was one of my favorite places in Chicago. I'll give it one more shot. But wow, from such amazing service to feeling like we were getting rushed out of the restaurant. I'm still surprised about this experience.", "pics": null}}, {"review": {"des": "Ohhh, yaaa, you will Love  this place:. Just wonderful  ambience to experience another amazing dining before heading up to Broadway musical in Chicago! <br>Yep, service was awesome presented by Angelo, who was very attentive to our needs, questions, and was very nice to surprise us by another very authentic Greek small appetizer that wasn't in charge but rather symbolized his friendly  reception to our table. <br>Food.. ohh, so delicious and you will never stop to hurt your stomach .. healthy and light,  despite of the  quantity you picked .. enjoy.<br>Highly recommend", "pics": null}}, {"review": {"des": "I've been here twice now during a weekend brunch. The first time was on a Sunday at 1 pm, where reservations were made. Myself and two friends both had the gyro platter, which was large and quite tasty for $14.95. I have a humongous appetite and even I didn't finish some of the gyros. The service the first time was very nice, but we got checked on so often it almost felt they were rushing us.<br><br>The second time we went was yesterday during Greek Fest on Saturday around 2 pm. We were getting a tad tired of the noise and crowds so we opted to find a sit-in restaurant . We started off with coffee, the large tzatziki dip, and the complimentary bread and butter. My friend and I split a combo meal- she got the chicken with white meat and I got the roast pork, it was about $8 per entree and you had to pick two to get this deal. The dish was a good portion for the price and had a Greek baked potato next to it. Service was again impeccable and this time we didn't feel rushed. I love the outdoor seating and the free valet.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/j24SnOs839DayVKr2Uo-oQ/348s.jpg", "caption": "Combo pork and chicken white meat $8 each"}]}}, {"review": {"des": "Free valet, traditional Greek decor, large portions, well dressed restaurant goers, great service, and excellent food. <br><br>Every few minutes there is a saganaki cheese on fire 'oopa!' (a bit too salty for me but ok to combine with bread), waiters hustle and bustle, ambiance is comfortable, informal but classy, busy restaurant but not too loud, I'd definitely come back.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fVPsAtlKfa9hHVmn4MrRpw/348s.jpg", "caption": "Lamb in tomato sauce and vegetables"}]}}, {"review": {"des": "I came here again with a very large group and was able to try a few different things. The saganaki is always good. I also liked the thinly sliced and lightly fried zucchini and the super garlicky sauce it came with. I tried the cold spread sampler, too, but I stayed away from the bright pink fish spread.. sorry it just didn't look appetizing. I had the grilled whole bass with the mixed vegetables as my side. They give you the option for the fish it be filleted, but I kept mine whole so it would be more fresh and juicy. I'm pretty good at filleting fish, so if you don't know how to do it, you probably should have them do it for you because there are a lot of bones. The veggies were a little too mushy and oily for my liking. I chose the kataifi (honey and nut bird's nest) pastry for dessert and it was really good. Tastes like baklava, but even more crunchy!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Zkirp3_BMhPqlwmFK8zqeQ/168s.jpg", "caption": "Kataifi with ice cream"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qXnsbF1KY3h84txw3Pm5Lw/168s.jpg", "caption": "Whole grilled bass with mixed vegetables"}]}}, {"review": {"des": "Got the special - Mediterranean Sea bass. Extremely fresh and the olive oil flavor was amazing", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/K1C0z6rTTPxAGlGJZAeF3g/348s.jpg", "caption": "Mediterranean Sea bass"}]}}, {"review": {"des": "Wow! I've eaten Greek food from coast to coast, D.C., down to Tarpon Springs, FL (Greek enclave) and the entire West Coast, and this restaurant is fantastic!<br><br>Ended up getting the multi-course dinner for $23.99 a person. I was so stuffed I couldn't breathe. It came with:<br><br>-Psomi: assorted bread<br>-Skordalia: potato-garlic spread<br>-Saganaki: flaming cheese dish<br>-Moussaka (no potatoes): eggplant, beef and bechamel casserole.<br>-Pastitsio: pasta, beef and bechamel casserole<br>-Keftedes: beef and lamb meatballs<br>-Briami: assorted baked root vegetables<br>-Kontosouvli: pork (but sliced like gyro meat.)<br>-Baklava: walnuts and phyllo pastry<br>-Galaktoboureko: Milk & semolina custard in phyllo pastry.<br>-*Karidopita: walnut cake. Never received, guess they were out.<br>-Ellinikos Kafes: Greek coffee that comes in an espresso-sized cup.<br><br>Service was great. Most servers speak Greek (one didn't when I was ordering our coffee so I switched to English) and they all obviously speak English. <br><br>I would definitely recommend!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AsftzW9uKcy1CcBeQC3gwA/348s.jpg", "caption": "Psomi me skordalia 7/15/17"}]}}, {"review": {"des": "As I sat by the window, I latched onto the hope that somehow the graffiti-coated walls and high-rises would transform into the mountains and cliffs that you would actually find on one of the Greek Islands, but my wish did not come true.  Despite this, I found hope in the fact that if the food on Santorini or Mykonos was as good as it was here then I would undoubtedly enjoy myself in Greece.  I'm sure that anything you'd have in the country of Greece would be amazing, but the food here at Greek Islands at least gives you a glimpse into the type of cultural experience you'd be getting overseas.  <br><br>Part of the reason that I absolutely love Greek food is because of how fresh it all is - even when it is rich, it is still fresh.  I felt that to be even more true here at Greek Island Restaurant.  Everything looked vibrant, smelled amazing and had a light texture to it...because of this I was able to eat more (and hence, experience more that the restaurant had to offer) without feeling like I had consumed double the amount.  Because my fiancé and I did want to get a more holistic taste of their offerings, we opted for several appetizers/small plates including: the saganaki (Opa!!!), kefta meatballs, melitzanosalata (eggplant-based spread), shrimp tourkolimano, the gyro appetizer and the rice pudding!  When everything was brought out to our table, it looked like we were holding a feast to feed 10 people, not 2 people.  <br><br>I didn't have the biggest appetite on the day that I came to Greek Islands Restaurant, but I committed myself to eating every last bite possible.  I probably ate more than I should have, but wasting any of this food would have been a pure tragedy.  Everything mentioned above was delicious - I couldn't possibly choose a favorite...besides that, mixing all the food and sauces together makes something that is good into something that is great.  Order the eggplant-based spread with the gyros and you'll be delighted with the result of eating them together; it's scrumptious!  But then again, everything was scrumptious...and fairly priced as well.  We got all of that plus an ice tea and a beer for something like $50 - it may have even been less than that.  That's a fantastic deal for how much food you're getting!<br><br>The service was also great - as soon as we vacuumed up all the food on our plates the server was there to take the plate away.  As soon as my ice tea dipped below half a glass, the server was there to fill it back up.  It was very attentive, modest and polite service.  I definitely entered and left Greek Islands Restaurant feeling well-taken care of.  I also felt super comfortable in the restaurant - it had a clean, refreshing atmosphere with wonderful decorations lining the walls.  You may not realize it from the street, but this place is spacious!  It definitely can accommodate a lot of people at any given time, which is good because there were plenty of people here even during the middle of a week day.  <br><br>It can be hard to choose which place to go to on this row of Greek restaurants; all the restaurants are flaunting their wonderful Greek pride, but I would say that the safest bet (and best bet) would be to come to Greek Islands Restaurant.  I've never been to a place quite like it, and seeing as how I'll be somewhat in the vicinity for school I can see myself coming back here when in the mood for some good Greek tapas.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FA3egDdAbVhDsP66euEDUg/348s.jpg", "caption": "Gyro appetizer"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5Fx4WbA88wuoTqOJDos6kQ/168s.jpg", "caption": "Rice pudding"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VblAg-96CG3D-wTdKmIJQQ/168s.jpg", "caption": "Can't remember the name, but it's the shrimp appetizer...very good"}]}}, {"review": {"des": "Great experience! I love being able to make a combo platter and try a lot of things. Obviously the flaming cheese is a must but the stuffed tomatoes are probably my fav!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OhD2jQZM8wpYyOzA1AkPMw/348s.jpg", "caption": "Spinach pie qnd eggplant pie"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ebKjMzNhQhV1CRWnDG5Llw/168s.jpg", "caption": "Gyro"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LhHf1cCDWoJ3RpHeiqb_ZA/168s.jpg", "caption": "Dolmades and lamb"}]}}, {"review": {"des": "This place has become our go-to after theater in the loop. <br><br>Food is delicious and service is prompt. We particularly like the family-style option for a lot of variety. <br><br>Don't be deterred if there is a crowd of people waiting. It always seems that way but we are shown to a table immediately.", "pics": null}}, {"review": {"des": "I'm a regular at Greek Islands. I love everything about this place, the food, the service, the set up. <br><br>Highly recommend the avgolemono soup on a cold winters day or if you're sick. It's the best!", "pics": null}}, {"review": {"des": "I am not a traditionalist by any real stretch of the imagination but there are a few principles that hold true. When you find a place with Riganati, Hummus, Rack of Lamb & Greek Salad with Anchovies that is TDF, you should def keep it in heavy rotation. And being given free valet parking makes a drive over that much more convenient. <br><br>The portions are generous, the menu is extensive, wait service is great and the kitchen is open until 11p on most days including Sunday. <br><br>For all the reasons stated above, I am a proud patron.", "pics": null}}, {"review": {"des": "I live in Kitsap County, WA and getting good Greek Food is non-existent. Neo Cafe doesn't come anywhere near what Greek food is supposed to be. So when I am back home in Chicago, it's a MUST that I get some Greek before I head home.  What better place to go than the Greektown neighborhood itself.  Positioned in the midst of many other greek restaurants on Halsted, this was the only one that I was able to sample.  That being said, I was in heaven.  Saganaki was a generous portion and I shamefully ate a whole one in front of the people I was supposed to share with.  I'm not losing sleep over it if they aren't.<br><br>Got the leg of lamb and Keftede meatball combo.  The melding of flavors was exquisite and the meatballs played very well with the tomato au jus that it was wading in.  The lamb wasn't false advertising it's visual tenderness when I took my first bite.  Melt. In. Your. Mouth. Good.<br><br>Long story short, I ate my way through the table.  I'm glad that we walked the entire way around the loop when we were done.  I definitely needed it with as much food as I packed away.  <br><br>Spot on, Greek Islands!  Don't ever change and I will see you next year when me craving hits it's peak again!", "pics": null}}, {"review": {"des": "They don't have a chicken gyro, but the waiter was kind enough to suggest the chicken shish kebab and he added a pita and the yummy yogurt sauce. The chicken was excellent and the wait staff very pleasant.", "pics": null}}, {"review": {"des": "A gem in Chicago's Greek culture! I have been to this restaurant multiple times and recently visited it again. <br><br>From the moment you enter, you are treated with utmost respect and welcomed with a lot of enthusiasm! The ambience of the place is amazing and you feel like you are in Greece. When you enter the place, you see a fresh display of Octopus and fish and other seafood items kept and decorated nicely. <br><br>My favorite item on the menu is the Lamb Shank which comes with a thick red sauce. I have tried their lunch menu as well which is delicious too. They have a great Salmon entree that comes with potatoes or grilled veggies! They have a lot of lamb entrees and they are all delicious. We have also tried the Saganaki because that is such an adventure. The fried cheese tastes ok and nothing exceptional,but, hey, all the show is in the firework and that makes a great deal. <br><br>Please be aware the two times I have visited in the evening, it has been exceptionally crowded. It can take a good 30-45 Mins if not longer to get a table. I am not sure if they take reservations but always good to call ahead and ask!", "pics": null}}, {"review": {"des": "Staff is very friendly and starts helping move silverware and chairs around for you to make the table roomy. Very well mannered/trained staff that will meet your needs, and accompany your party.<br><br>Bread is served at the table, which is helpful but DONT fill up on the bread before the meal.<br><br>VEGETARIAN friendly, can make a meal with the sides or appetizers and be full on. Next time, will save room for desserts.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/z4YMon1omkNPbXjXN0IQOA/168s.jpg", "caption": "Vegetable side dish-large. Potatoes, carrots, green beans cooked in the oven. Delish!"}]}}, {"review": {"des": "I absolutely love this place. We live in the neighborhood and have had about 80% of the menu. Everytime we go it's just as great! With all the competition in the west loop, this place definitely keeps up! No matter you order don't forget the saganaki & tzaziki !", "pics": null}}, {"review": {"des": "I've come here several times with friends and family and we always have a great time. The food is pretty great and I love the decor in this restaurant. The portion sizes are nice and I feel like my wife and I always have leftovers after a date night. <br><br>The customer service is usually stellar but the last time we went, it took 30 minutes to get water. I'll still dine here again in the future.", "pics": null}}, {"review": {"des": "The portions here are generous.  When you sit down, they give you enough bread to feed a small village.  We started with 2 saganaki and it was yummy.  We were going to originally order individual entrees, but we saw that the table next to us ordered appetizer sized dishes - and the portions were huge.  <br>So we changed our minds and ordered the gyro entree and the donators salad for 2 people (please keep in mind there were 3 of us).  The donate salad (tomato, red onion, cucumber and black olives) was fresh and delish.  The gyro entree was big enough for the 3 of us to leave the restaurant full.  My only criticism of the gyro was I found it to be a tad dry. <br>Service in the dining area, while not necessarily friendly, was VERY prompt and attentive.  Service in the bar area was very unfriendly and lackadaisical.  So if you end up in the bar while waiting, don't be surprised if you are treated like dirt.", "pics": null}}, {"review": {"des": "We came here on a whim hankering for some greek food. The atmosphere is nice, but the service was brisk.<br><br>The Saganaki  (flaming cheese) here is ah-maze-zing. One of the best. <br><br>However everything else we had was just, ...good. The Dolmades was a little firm.  The roast lamb was tender, but a little livery. The moussaka was actually quite good, no complaint. And the desert custard was slightly overcooked and firm.<br><br>We'll come back and see if we can upgrade the three stars to four.", "pics": null}}, {"review": {"des": "Great food and everything was very fresh. There is a lot of seating and a patio for when the weather is finally nice!<br><br>Now for starters it's not a meal at a Greek restaurant you don't kick it off with Saganaki. The cheese was absolutely perfect. I do wish they lit the cheese in front of us strictly for experience purposes but maybe they didn't do it because we were sitting outside. It still tasted the same and, as previously stated, it was absolutely perfect.<br><br>I ordered a 1/4 chicken with vegetables. I'm not sure what the actual dish was called but it was just a simple dish flavored with herbs and oils then baked. There were no frills to this entree but I still loved it and would totally get it again. Sometimes less is more, and this was one of those times.<br><br>The service was a little too slow for my liking and it definitely crossed the fine line between \"this is a dining experience\" and \"the service is way too slow for a Saturday at 1:30pm.\" I know chicken takes a while to prepare but even the cheese took a while to make it to the table. Although the service caused me to dock a star from my review, I would still totally come back to this restaurant and recommend it to anyone who wants an awesome Greek Town meal!", "pics": null}}, {"review": {"des": "I want to give this place 3 1/2 stars but since I can't do half I'm going to just keep it at three. I loved the lively atmosphere and the very personalized handshake as we were walked to our table. Our waiter was a bit gruff At first but seemed to warm up to us over the course of the meal. We had several dips as starters and we were given very little pita to accompany the three dips we ordered, they promptly brought us more when it was requested. I had the chicken and my husband had the Gyro platter which was just a giant plate of meat. The chicken had good flavor but was a bit dry but the single Greek potato provided was delicious! It was an enjoyable dining experience but I've had better Greek food. Based on the many great yelp reviews I'll definitely give this place another shot and order one of the specials.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/i8h4skYBmnHU5TlIcvF3zg/168s.jpg", "caption": "Chicken very flavorful"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hUcpESYkpwjnnqd1r1gK_Q/168s.jpg", "caption": "We were seated right away into a very busy bustling restaurant! So far looks great!"}]}}, {"review": {"des": "This is a good restaurant, even at the end of their day. We stopped in after working late and decided we wanted a good meal. We got it! Leg of lamb and chicken rig...??? Wonderful! Nikos was an excellent server and soooo friendly! The atmosphere was...well it was quiet 'cause we wee some of the last customers in the place! Will def be back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LGpoCWNCW30w0cm2AfJ8GA/168s.jpg", "caption": "So much to choose!"}]}}, {"review": {"des": "So I actually just returned from a 2 week holiday in Greece and when someone suggested Greek Islands I eagerly jumped at the chance to have even more Hellenic cuisine. This place is my favorite Greek restaurant in America and one of my favorite restaurants in Chicago. The interior is authentic and charming; it reminds me of the cavernous interiors of cliffside villas and tavernas in Santorini. The food is so good and so flavorful I thought I was still in Greece. Quick shoutout to the calamari and saganaki; OPAAAA!!! Anyway if you like Greek food you need to go here and if you don't like Greek food then god help you. One of my favorite spots. Delicious! Efxaristo!!!", "pics": null}}, {"review": {"des": "Excellent food excellent service recommended to everyone. Will come back.our server Andy was great.", "pics": null}}, {"review": {"des": "Best of greektown, the food is always fresh and consistent. Authentic Greek flavors, not a menu for the carb conscious lol and I can't say no to pastitsio (Greek lasagna)!  We love to have our family dinners here too! Always a hit!", "pics": null}}, {"review": {"des": "The food and ambiance here is great. Loved everything we ate here. We opted to order a bunch of appetizers and small plates to get a good taste of the restaurant. <br><br>Also very good to know... FREE VALET! Winning! <br><br>I had a deduct one star. Maybe two. Once we were seated, it took 15 minutes until we were served bread. I was soooooo hungry and I was staring at that butter... ready to eat it on its own. I. Was. So. Pissed. Off. Don't ever do that to a hangry person!!!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HxVR90GKHaKLXvhz4_NFyg/348s.jpg", "caption": "Ground beef and rice in egg plants,\"dalmades(sp?)\" and really good"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/W4C3kLlAcsx8FuQmicr3fg/168s.jpg", "caption": "Their famous fried cheese --salty"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/NjNJHkAQuwYC_i0dcZH2xg/168s.jpg", "caption": "Overcooked octopus"}]}}, {"review": {"des": "Complimentary valet is what initially brought me here but the delicious food and excellent customer service is what keeps bringing me back! This restaurant is large enough that I've never had to wait for a table even coming on a weekend. Despite being a large restaurant, they operate very efficiently and you will feel very attended to. They have a very large menu that can appease appetites of all types. I've done a bit of ordering from the general menu including their set dinners as well as ordering their specials. Everything here is tasty. I've never had a dish here that I wouldn't come back and order. If you're coming with a group of 2 or more want to try a variety of items, go for the set dinners priced at $24/person. While it may be a bit pricier than a typical menu item, you get so much food for your money. I think all together, it was a 8 course meal with 2 apps, salad, 4 entrees, rice/potatoes, dessert, and coffee. Most importantly, you get to try some traditional Greek foods!<br>Highlights you should try: <br>- Taramosalata (don't let the pink hue turn you off - it's delicious!)<br>- Mousaka (eggplant and ground meat casserole - it's heavenly...)<br>- Kontosouvli (pork on the spit - there's a really nice smoky char flavor on the meat but still juicy and tender)<br>- Saganaki (flaming cheese) and baklava are always solid choices too!<br><br>Happy Greek eating!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sinopTEIbyjUeWZR0p9LRg/348s.jpg", "caption": "Assortment of desserts for 3 from the family style dinner"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aTGoDeMVMlPA61K6810Yeg/168s.jpg", "caption": "Top- mousaka, potato, rice, dolmades (stuffed grape leaves),  Bottom left- kontosouvli (pork on the spit), sliced leg of lamb"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NI0MpjCyzxqzRuVVoa0xEA/168s.jpg", "caption": "Athenian salad"}]}}, {"review": {"des": "What a fun place. I've been here many times for framily dinners. (Dinners with my friends family)<br><br>Great wine selection, you won't find these picks from Greece elsewhere. Try the red Laconicos. Also available in white. I haven't had the white yet but intend to next visit! <br>Love the saganaki Opa!<br>Can't go wrong starting off with the Athenian salad. The feta is to die for. <br>Hummus and dolmades (with meat) are other favorite starters. <br>Sometimes I make my own combo with chicken riganati and spinach cheese pie, other times I've enjoyed the chicken spaghetti, pastitsio or mousaka. Garides (shrimp in tomato feta sauce) is a real treat. For sides, I love the artichokes, briami, and spanacorizo. <br>Bougatsa was a desert special on Easter and I am still drooling over it!! Custard in fillo mmmmmm!! <br>The service is always good, fun atmosphere, and it's always busy!<br>I'm curious about the other dining rooms. I've only sat in the back room! It's themed just like being in Greece, white and blue everywhere. Traditional and elegant. <br><br>Heads up, on holidays, the line for the women's room can be inconvenient. Not a great area to stand in to wait, it can be very busy! A minor inconvenience.<br><br>Valet parking available, which most people use.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GRka9zrQN5PpEp_bMtYCRQ/348s.jpg", "caption": "Bougatsa mmmmm"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KvQUKTXijUVvI6t5DqvX-Q/168s.jpg", "caption": "Laconicos (red, also available in white)"}]}}, {"review": {"des": "I'm not sure what all the hype is here.  The food is mediocre.  On my most recent visit, I noticed some filth stuck to the inside of my water glass.  Unfortunately, I was half way through my glass of water when I noticed it.  The water guy noticed me looking at my glass and came right to my attention.  He took my glass off somewhere which I thought was odd since glasses and water were stored right next to my table.  Anyway, he returned with a glass full of ice and water.   I proceeded to drink from it only to discover that all the ice was hiding the same exact piece of filth.  Shady.", "pics": null}}, {"review": {"des": "Grilled octopus and flaming saganaki are a must! The place is huge but very crowded, so don't forget to book.", "pics": null}}, {"review": {"des": "Classic Greek restaurant which has been around for at least 40 years.  Huge restaurant that looks like a Greek villa from one of the islands.  Service very attentive and quick.  You will usually wait only about 10 minutes at most for your entree to arrive. Saganaki is very good - and is accompanied with the celebratory Opah!  Flavors are very good.  The gyros are home made and are not as salty as those from fast food gyro establishments.  The moussaka is absolutely delicious.  The bechamel sauce and ground beef are wonderfully baked.  The ambiance is very pleasant and warm.  With complimentary valet parking, this is one of my top go to Greek restaurants in the city.", "pics": null}}, {"review": {"des": "I've been coming here for years! Excellent food and service every time! I love the lemon soup and mousaka. The cold plate is a great appetizer. They have a great wine list and full bar in the restaurant. There is also valet parking. The restaurant is very big and I've never had to wait even with a large group of people. This is my favorite restaurant in Greektown!", "pics": null}}, {"review": {"des": "Never ever fails to impress me. From the guys who park the cars, the men who greet you upfront, the waiters, and food...just a GREAT experience overall.", "pics": null}}, {"review": {"des": "I'm seriously considering quitting my job, packing up my belongings and moving to Chicago just so I can be closer to this restaurant!<br><br>This was some of the best Greek food I have ever had! The restaurant was busy for 6:30p on a Wednesday, but I was told that it's always busy. That makes complete sense to me! There is a lot of space so I didn't have an issue getting a table.<br><br>My server, Paraskevas, was awesome! He was very friendly and gave me great descriptions of many items. I ended up ordering the following:<br>- Grilled Octopus: grilled to perfection! Tender and crispy at the same time with just the right about of marinade. So simple and delicious. <br>- Lamb Leg (sliced): very tender, lean and flavorful! I did a combo plate with this as one of my options. Perfect portion!<br>- Mousaka: if you love eggplant like me, you get this! Very tasty and hard to stop eating. <br>- Melitzanosalata: eggplant, garlic, potato spread. Also delicious! I ended up eating this with bread and along with my lamb.<br>- Greek Island Special dessert: perfect end to a perfect meal! A unique dessert with lemon custard, walnuts and creamy topping. <br><br>I loved everything and can't wait to come back. I will be thinking about this delicious meal for a long time!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cctbsyL8ITvIk0OkPUdbuQ/348s.jpg", "caption": "Greek Island Special"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/k-TCacmlQzecWf-BMjcNIA/168s.jpg", "caption": "Lamb and Mousaka!"}]}}, {"review": {"des": "Great quality food and open late. I tried the meatballs, Greek salad, fried eggplant,  pastitsio, chicken, and vegetables. All were very good. The hostess was very nice. Service could be a bit friendlier but overall solid meal and fairly priced.", "pics": null}}, {"review": {"des": "First time eating in Greektown and this place was packed on a Thursday night!   We waited maybe 15 minutes for a table. The one thing I could not get over when walking in was the smell. It was a combination of restroom/seafood and it was awful- we almost walked out but since so crowded we stuck around. <br><br>Service was slow/ had to flag him down to order food after waiting 20 minutes but he was cheery. We got the flaming cheese which was good, the keftedes which were a bit dry but good flavor. I got a lamb leg with artichokes in a lemon cream sauce and it was really good. Falling off the bone. <br><br>I'd give 4 stars for the food honestly. But due to the odor and wait service I have to bring it down.", "pics": null}}, {"review": {"des": "Pretty friendly staff and the service is fine. This is a large resturant so it usually is not to difficult to find a table. The saganaki is always a favorite for me.  This is a good place for vegetarians!  They have a large menu and there is something for everyone. I have found some of their meals to be a bit dry or lacking flavor.", "pics": null}}, {"review": {"des": "Every time I order take out from this place, they always forget something ( missing salad dressing, pita, appetizer, etc). Today, I was missing pita bread which I paid extra for and an appetizer. I called and they admitted they must've forgot it but never did they apologize for it. They simply said to come back to pick up the missing food. They don't seem to care that this is very inconvenient EVERY TIME when they keep making the mistakes. The customer service is below average, customer service is probably better at a fast food place. I really enjoy their food and am very disappointed. Greek island lost a frequent flyer because of their nasty rude service.", "pics": null}}, {"review": {"des": "The other reviewers have said it but I will echo: \"free valet\"! Don't make the same mistake as us and park in a metered spot across the street.<br><br>Me and a group of about 10 coworkers had an outing here on a Sunday night; it is a big restaurant but it does get busy and we ended up waiting about 25 minutes for a table.<br><br>The service was great. I loved getting their family style dinner (which is a fixed price of about $25) but includes appetizers, salad, 4 entree types with tons of food for the whole table, and a dessert platter for sharing. We had plenty to go around and even got to take some home!", "pics": null}}, {"review": {"des": "This restaurant has a really wonderful ambience. The staff is friendly, and we were greeted warmly upon arriving and leaving. Our waiter was very sweet and made several suggestions. In the end I had The fried calamari which was good, but a little chewy for my taste. I also had the artichoke as a side which was very good. Others in my party had the Greek salad (or variations of the Greek salad); all very good. Great place to talk, as it's not too loud and they don't rush you out. Oh, and free valet parking!", "pics": null}}, {"review": {"des": "old school, everything on the menu is good.  the place feels like old chicago.  places like this are disappearing fast.  if you haven't been here for a while, or never, i suggest you should.  it's so fun-especially for families.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8v_XtH-AuqZGaF7Xl-bn2A/348s.jpg", "caption": "Delicious fried eggplant"}]}}, {"review": {"des": "The food was decent but we were a party of 18 and asked the waiter when seated to divide us so we won't have a problem with the check (hate dealing with the check when you are a large party) and he said \"Don't worry\"<br><br>When the check arrived the manager came with it and said they can only take 4 credit cards - I never been to a restaurant that only take 4 credit cards per large party AND NEVER AGAIN!!", "pics": null}}, {"review": {"des": "I had dinner with coworkers at Greek Islands and we had a fine meal.<br><br>As with most restaurants in Greek town you really have to work hard to find something that sets them all apart. Honestly, they are all very similar. Which is both good and bad. But this place covers all the bases: it has décor to make it feel like you're in Greece, the menu has the standard fare, and the ambiance is very relaxing. The staff is friendly and quick to serve, which is nice, and the food was tasty (but not out of this world).<br><br>Our meal did start out a bit oddly though... I inquired, \"Which bourbons do you have?\" To which the waiter responded, \"What's your favorite?\" \"Blanton's\" \"No, we don't have that...\" -silence- Eventually he got the hint and went to check, only to return with the list: Jim Beam. That's it. One. ONE. So what was the point of asking me which one I prefer?? Anyway, the rest of the meal was fine and, as I said, the food was fine. I had the chicken kabob and it was pretty tasty.<br><br>Overall our meal was about what we were expecting and I'd return again in the future (but only if someone was specifically requesting Greek food - otherwise it's Mr. Greek for a late-night gyro for me!)", "pics": null}}]}