{"name": "gt-fish-and-oyster-chicago", "reviews": [{"review": {"des": "First off, I want to talk about the oysters here.  They were the smoothest and cleanest oysters I have ever had.  I imagined that they went to a spa, had a good massage and a scrub down and then got plated for my enjoyment.<br><br>Secondly, the service here was incredible.  The wait staff was attentive, but not overbearing.  I dropped a fork and as soon as I tried to reach down to pick it up, someone came by to swoop it up and hand me a new fork.  My water glass was always filled.<br><br>The scallops we ordered were perfectly cooked, meaty and not mushy.  The seafood here definitely outshine the veggies and other stuff that accompanied them on the plate.<br><br>We ordered key lime pie for dessert and I thought it was a nice touch that they used powdered chocolate to spell out \"Happy Anniversary\" on the plate.<br><br>PRICES<br>Oysters about $3-$3.75 each<br>Tuna Poke $15<br>Thai Coconut Soup $12<br>Clam Chowder $13<br>Scallops $24<br>Grilled Prawn $19<br>Key Lime Pie $10<br>Cocktails $13-$14<br><br>We used Spot Hero to find parking at a nearby lot.<br><br>....| \\      _  , , , - - , ,  _  ,      <br>.../  , ` . - ' ` '             . _   \\ -  ;  ;  ;  , _    <br>..| ,  a  -   )   ) _         . ; .  (   ` - ` -  ' - '   <br>'  - - - ' ' ( _ / . _ ) - ' ( _ \\ _ )   2018", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AD9xkmOGKFG4VEIE2fmR6A/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LGX_Oq0ea7nx2ckRQOa_bw/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-CZAjQcEkID3RDb9wV76qg/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "It's good. Really good. Top notch and fresh ingredients with nice creativity. Presentation is also important to them as evidenced in how each plate came out. <br><br>Went with a friend and we just ordered a few things to share family style. Hamachi Crudo. Check. Shrimp Bruschetta. Yep. Tuna Poke. Uh huh. Fish tacos. Opa! (No, not Greek). Stone crab claws. Git sum. Scallops. Bring mo please. And the desserts. Decadent and rich as H E double hockey sticks. <br><br>I've had bruschetta and poke and fish tacos and scallops but not put together like GT does. Each dish has a different taste profile and I think complimented each other well. And we just ordered randomly. My fave has to be the scallops. I love scallops. These were perfectly seared and topped with a pretty fantastic corn purée and garnished with sliced and lightly pan fried zucchini. Don't know what the sauce was but it was just plain mouthwatering. And a nice balance of textures with the above ingredients and the cherry tomatoes and some greens. <br><br>Next fave was the hamachi crudo. They managed to make some yellowtail sashimi on top of cut up radish a flavor explosion. <br><br>All the other dishes we had were fantastic as well. Not disappointed with any of them. And the beauty is that I felt we ate a good amount but didn't walk out feeling like I dropped a bomb on my gut.<br><br>Hip and cool atmosphere too. I was the old and uncool guy in the dining room. Worth the visit.", "pics": null}}, {"review": {"des": "GT F O (heh, did you see it too?) is really great.  Very fresh seafood and tasty upscale options that fit really well in the area.  It is upscale, but approachable / affordable dining.<br><br>The oysters - fantastic<br>The service - impeccable<br>The drinks - delicious<br>The mains - prepared perfectly<br><br>That leaves with a great experience.  You certainly won't go wrong with a meal at GT F O.<br><br>One thing I must say - I couldn't find a *wow* factor here.  Everything was simply great execution, but maybe a little sterile and down to business.  It can be difficult with seafood but I think this missing \"wow\" showed in the food a bit.  A beautiful presentation of hamachi crudo on a pretty bed of jicama... that seems to suck the flavor of the really wonderful fish out of your mouth.  The tuna poke had super delicious tuna on a bed of cucumber and a bit of flavor from the sesame seed, but some other pickled veggies, red onion, or small bits of pepper on the side would have been nice to pep it up.  The grilled prawn were really well presented but could've used something to make them pop.  I guess one bonus here is that the main part of the dish really shines, but I'd like the things around it to amuse my palate a little more.<br><br>The thai coconut soup is surprisingly (like wow) good (though the bread with it might've been a bit over-grilled).  I liked the clam chowder, but the size difference from the thai coconut soup is kind of strange (even though it makes a little sense due to the soup base).  The scallops were great and each of the oysters we had were fantastic.<br><br>When I made the reservation I made a note about our anniversary, and there was a nice, spice-embossed note on the plate for the key lime pie that we ordered.  In regards to the pie - it was good, but the mouse, ice cream, and other acountraments on it were the real stars.<br><br>I did notice a parking validation code on my receipt which is appreciated.  We used spot hero in the area since we couldn't find any info about the validation, but it may be worth looking into if you need to drive over.<br><br>Overall if you're hunting out a $100+ per person meal I'd be near dropping to 4 stars based on \"wow factor\", but for simple good food and impeccable class and service GT Fish and Oyster is a great stop!<br><br>We'll be back for sure to focus on those oysters even better.", "pics": null}}, {"review": {"des": "GT Fish & Oyster is totally amazing!<br><br>Don't let the name fool you. There's much much more to this establishment than just Fish and Oysters!<br><br>The Brunch was simply awesome! A definite 10/10. <br>They have some of the best French Toast that I've ever had the pleasure of tempting my tastebuds with. <br><br>I understand that you can pretty much  get French Toast anywhere that serves breakfast, but it won't taste like GT's. <br><br>All of our food was well prepared and taste great, the service was excellent and we definitely enjoyed every moment of our experience at GT Fish & Oyster. <br><br>As always, don't take my word for it, go see for yourself. <br><br>Stay Yelping My Friends!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wokzOAwOL1eNOZNqjcJFhQ/168s.jpg", "caption": "Fresh Oyters"}]}}, {"review": {"des": "Came here for a business dinner.  I had heard so much about it once I told colleagues where I was headed with a customer that my expectations were high upon arrival.  I have to say, this place exceeded my expectations!  I was seated promptly even though I was early (always appreciate not having to dilly dally at the bar while my table is ready and available).  The menu is great and so are the portions.  The prices are high but you actually reasonable (i.e. you can get smaller portions at lower prices and they are still quite substantial).  I was impressed with their options from appetizers to mid course to mains.  Service was excellent.  <br><br>Tip: it was very loud and I had asked for a quite section due to business dinner.  By the bar seemed to be the quietest section believe it or not. This place is happening and therefore you cannot escape the loud atmosphere.", "pics": null}}, {"review": {"des": "Yummy! Most definitely my type of a restaurant, I loved everything from the beginning to the end. Except for somewhat small portions, everything was so good I wanted more. The drinks were delicious, the place is very cozy, service was top notch and my oysters were the best I ever had! I really enjoyed every second of my dinner. I will most definitely be back.", "pics": null}}, {"review": {"des": "GT knows how to make a girl (or guy) feel special. There are many Chicago restaurants that charge fine dining prices without giving you real fine dining service- this is not one of them. You feel taken care of by the wait staff from start to finish here. That couples with a great comfortable ambiance.<br><br>The food is pricey but innovative. I thought the green soba noodles were really interesting. <br><br>But what really blew me away were the drinks! One of the cocktails (I can't remember the name now unfortunately) was one of the best cocktails I've had on the city in recent memory. I will be back for more happy hours.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xxqPmxn1aFVRX09FOHIbmg/168s.jpg", "caption": "Green tea noodles"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gQU7Oxc-hXcXNnL78ps6vQ/168s.jpg", "caption": "This was the amazing cocktail"}]}}, {"review": {"des": "BLUF: An oyster bar and seafood restaurant that takes you on an amazing food journey to find your pearl. <br><br>Wow. This restaurant left me almost speechless. When first entering, the overall decor is modern and chic, adorned with an awesome chalk drawing in the back of the restaurant. The overall ambience sets a romantic mood with the candles and dimly lit lights. And the staff and our waiter, Alex, was extremely attentive and compassionate throughout our dining experience. <br><br>There is a separate oyster menu from the main menu from which we ordered 6 oysters from a variety of places (New Zealand, Washington, Massachusetts). All I could say is well done. Every single oyster we had tasted like it came fresh out of the sea - they truly have been some of the best oysters I've had in a long time. <br><br>For our main course, we ordered the lobster roll and GT linguine with clams paired with Sauvignon Blanc (they also have an extensive wine list). The lobster roll had a buttery, fluffy texture with tender lobster paired with some fried onions and pickled vegetables. But the winner of this meal was the linguine! Each noodle seemed to not only have a bite, but just had a texture that absorbed all the sauce and stuck to your tongue. It. Was. Amazing. The clams made an excellent compliment, and I will say some scallops would have made this dish an even better one! <br><br>Overall, this restaurant took us on an unexpected culinary journey on our first time in Chicago. We definitely found a pearl in this sea of amazing restaurants!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LM96ZQgQQoB_7IMsWkNh-w/348s.jpg", "caption": "6 Oysters"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VHZ7MbxIlzJypG6eHg5uaQ/168s.jpg", "caption": "GT Linguine & Clams"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GyXkcNXICStIsY1TmPRf8A/168s.jpg", "caption": "Maine Lobster Roll"}]}}, {"review": {"des": "The restaurant is located on the corner. This was my first time here. My party of three had a 11:30am brunch reservation in the main dining room. They were here once before and enjoyed their brunch here. When we entered I noticed the bar has a surf board as part of the bar area. We were seated immediately at the main dining room corner table.  <br><br>I enjoyed my two hot blooded cocktails (see pic). The fried pickles for $4 were very tasty. I truly enjoyed my lobster eggs benedict for $25. My lobster was very tender. Eric served our table well. My total bill was $120 less gratuities. We were all happy with our meals. We decided we will return again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8SbuAJKwoRXDZgXUyi99ew/348s.jpg", "caption": "My Hot Blooded cocktail"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jVnOjJqhw6XIXWWr2wcrww/168s.jpg", "caption": "My lobster eggs Benedict was tasty"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pIEG6QrxRAYTWW92HPyX5w/168s.jpg", "caption": "Hot sauces"}]}}, {"review": {"des": "This is the original restaurant. They opened GT Prime after.<br><br>Four us ordered the seafood tower and half the menu.<br><br>The oyster poboys and lobster rolls were highights of the hot menu. The strawberry key lime and panna cotta were an amazing end. Solid drinks menu.<br><br>Service was wonderful. We were the last to leave the restaurant and they didn't rush us at all.", "pics": null}}, {"review": {"des": "Very enjoyable dinner spot in Chicago. Trendy but not pretentious. Great bar area. Good appetizer choices - kind of small plates for sharing. Clam chowder starter was the best I have had in years and served in a cool pickling jar. I had the halibut main course and it was very good. Decent wine list. Nice place for an evening out without getting the food factory treatment.", "pics": null}}, {"review": {"des": "Came here again as I traveled back to Chicago. I was saddened that my meal was much smaller then what I have had there before. I ordered 6 of one kind of oysters but they brought me one of each of the six offerings.  The scallops that are on the menu were terribly small for a place that is suppose to be high end seafood. The previous pastry chef that created their creme brûlée was the main reason I came back to satisfy my cravings for a great dessert. They of course changed hands with pastry chefs and their dessert selection and presentation noticeably fell short.", "pics": null}}, {"review": {"des": "Honestly don't even know where to begin. One of the beat oyster bars I've been to by far. <br><br>The ambiance is sexy and dim but casual. <br>We stopped in right before dinner began at 4pm, and sat at the bar for some oysters. <br><br>Jared was our server behind the bar, super attentive always make sure our glasses were full as well as our belly's. <br><br>We started with 8 oysters then ordered another 8! I had a glass of rose and my boyfriend had the ballast point  ' bonito' beer. Followed by 3 dish tacos ( shared). By far the BEST fish tacos I've ever had! I will include the menu in my pictures so you can see the ingredients. <br>I topped my oysters and fish tacos with GT 'Smoulder' hot sauce! Which is available for purchase and is definitely coming back home with me!<br><br>We also shared a NY strip steak ( the only steak on the menu, as this is a seafood restaurant) it was delicious! <br><br>The service was amazing, the food amazing, the drinks were amazing! I can't wait to recommend this place to any of my friend visiting Chi-town!<br><br>*Sorry not sorry for all the grammatical errors, I was like 3 glasses of Rosé in!", "pics": null}}, {"review": {"des": "I only came here for a quick afternoon drink, but the atmosphere was great and clean. I would definitely love to try the food out. Our service was great at the bar, and I enjoyed my tequila cocktail. I would recommend a try just based on the ambiance.", "pics": null}}, {"review": {"des": "I can't get enough of GT.<br><br>While I haven't dined here in a couple of years, this was something I was craving!  They did not disappoint. <br><br>My girlfriends and I selected some (delicious) cocktails and settled in.  I was drawn to the Thai coconut soup and it was insanely good.  Mussels, shrimp and loads of fresh herbs.  I also devoured the hamachi crudo.  My friend noted how \"instagram-able\" the dish was.  Beautiful presentation.<br><br>Looking forward to returning soon!", "pics": null}}, {"review": {"des": "Great selection of oysters! My husband and I really enjoyed the lobster roll. Prices are as expected for oysters/seafood and so are the portions which are on the smaller side. Overall, we enjoyed the food, wine and happy hour.", "pics": null}}, {"review": {"des": "Brunch Baby!!! Where Everything's a winner. Perfect for a Sunday brunch; as they have downswing delicious for every eater. Those of you who enjoy that infamous Chicken & Waffle dish will race over GT's...at least my sister does. They've also got seafood, hashes, vegetarian concoctions. Everything pairs perfectly with bubbly and the service was amazingly pleasant. It's obvious the proprietor takes pride in detail. Wait staff was well trained, attentive & always on time to top-off drinks, clear plates & replace linen. <br><br>Beautiful open space. Dope restroom. Full bar. Grwat for date night, happy hour or as stated above, Sunday Brunch with family. <br><br>Popular spot so it fills up quickly, I suggest reservations.<br>~Christy", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/x8T_MiBstSthLqHdtKsDQQ/348s.jpg", "caption": "Chicken & Waffle"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WUhHZBboqFtgNBv3R8nBxw/168s.jpg", "caption": "Eco"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wudhF_R7pMUeJNynEuOlUg/168s.jpg", "caption": "Signage"}]}}, {"review": {"des": "This place... is no joke. I came with a girlfriend of mine for a nice dinner.. and we tried about EVERYTHING. <br><br>I have no regrets. Some of the items we ordered included oysters, GT 'deviled eggs', tuna poke, scallops with butternut squash, brussels sprouts & pecans, warm buttery lobster roll, chocolate caramel cake, and PB & J Panna Cotta. Yes, two women finished all of that food, plus 4 glasses of wine. You can say it was a great night.<br><br>Every dish that came out, I exclaimed that, THIS is the best one yet. But they just kept coming! I would definitely recommend the Maine Lobster Roll, and the Scallops. The deviled egg is not a typical deviled egg you'd expect (almost a salmon mousse-esk), but it was also so delicious. Both of the desserts were excellent, but I think the Panna Cotta really stole the show. <br><br>Overall, the ambiance of this place is classy yet laid back, and I can't wait to enjoy another meal here (maybe brunch?):)", "pics": null}}, {"review": {"des": "Came here as a recommendation from a friend and loved everything. Would highly recommend coming here and getting the lobster roll. Bit on the higher end in terms of price and is definitely a little more upscale atmosphere. <br><br>I ordered:<br>- GT \"Deviled Egg\": $5 is a little pricey, but tried smoked salmon on a deviled egg for the first time and thought it was well made!~<br>- Tuna Poke: $15, as you can see things are a little pricey here, but still. Super fresh seafood esp given Chicago is not near an ocean<br>- Lobster Roll: Market Price $34, I ordered this despite feeling that $34 was waaaaay overpriced for a little lobster roll, but one bite in I totally changed my mind. The BEST lobster roll I have ever had (compared to only 2-3 other times I've ever had lobster roll lol)", "pics": null}}, {"review": {"des": "When I went to GT Fish & Oyster a few years ago, it appeared they were trying a micro menu and their offerings were not as good as expected. Thinking things may have changed since, I took a chance on a return.<br><br>There was a noticeable change, starting with more seafood on the menu. The core product should never be limited and it was nice to feel like I had returned to a seafood restaurant.<br><br>The clam chowder was good, albeit not New England clam chowder with it having bacon in the recipe. The pasta with clam sauce was a hit. And my friend liked the crab cake as well as the fish and chips.<br><br>One thing I noticed differently from the visit in the past and walking by the restaurant a few years ago was that the bar was empty compared to the huge crowd it used to draw. At any rate, I will eventually return and try a few other items. It may have been bad timing when I went prior to this most recent visit. They'll get an encore visit.", "pics": null}}, {"review": {"des": "I've been to GT more than a handful of times and I can always count on a 5-star experience. ALWAYS.<br><br>And it's the kind of establishment that not only pleases every palate, but is appropriate for anyone... discerning foodie types, the parents, chatty gal pals, cramming-it-all-in-over-one weekend visitors, the new boyfriend, you name it! Heck, I even have friends who aren't into seafood who love GT (the lamb shank with eggplant and Moroccan flat bread is out of control).<br><br>What you should order: the seafood tower if it's at all financially feasible (#worthit), the seared tuna salad (seriously, it's the best interpretation of a niçoise in Chicago), the crab salad, the octopus, and the fish tacos (we always end up ordering another plate). <br><br>The cocktail program is really strong. Have you ever tried a drink with roasted squash syrup? Then you have to try the mezcal-based 'Campfire Songs'. My personal favorite is 'The Waitlist', with its crisp flavors of elderflower, grapefruit, and lime fusing with vodka.<br><br>Service doesn't take a backseat to the fantastic food, and the servers just seem to know when you're in the midst of telling a great story or are otherwise engaged. Too often overbearing service poses challenges to the flow of your experience, but they nail it at GT. There when you want them and not when you don't.<br><br>See you again and again and again.", "pics": null}}, {"review": {"des": "I was in Chicago for a conference and the best meal I had in 3 days was lunch at GT Fish & Oyster!<br><br>The service was excellent!  The restaurant was bright and beautiful - on a rainy, nasty day in June!  The food was beautifully presented and delicious.  We started with 3 different types of oysters and then had the tuna tartare - delicious!  I had the chowder and my dining partner has the tacos - very tasty!<br><br>Everything we tried was fresh and bright with excellent flavor and presentation.  Next time I'm in Chicago I will definitely go back for dinner.", "pics": null}}, {"review": {"des": "We chose GT because it was recommended by locals. We ordered oysters on the half shell...half from New Brunswick and half from Washington State. I love oysters, but the variety from New Brunswick were sour and unpleasant. Those from Washington were excellent, but the sauces provided would have overwhelmed their flavor (which we needed to power through the other oysters). We also ordered the grilled prawns, which came with a unique assortment of grilled veggies and a stuffed pasta in lobster sauce. The pasta was weirdly sweet, and the prawns were overcooked. For the prices, I would expect higher quality. The service was prompt and excellent, but the food overshadowed it. So the lesson, I guess, is avoid seafood restaurants in landlocked cities.", "pics": null}}, {"review": {"des": "The oysters here are pretty good, a lot of varieties are very fresh, it is a bit on the pricier side at $3.5 a piece, but they have happy hour half off oyster after 9pm<br><br>The dishes here are all small plates for sharing. The crab cake we order is really mediocre, a bit bland and more fillings than expected given the price point ($18 for a very small piece)<br><br>The Swordfish dish is the only dish we really liked. The jambalaya has lobsters, bay scallops and mussels in it and tastes very good. The piece of swordfish on top is really good too<br><br>Grilled broccoli salad is good, the trout roe's salty taste compliments the sweet onion well", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VZeeGCd7UHlesc9cM8HOyA/348s.jpg", "caption": "Grilled cauliflower"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bCFI4MCKKbAl_nmQwLDNgA/168s.jpg", "caption": "Swordfish"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/71tausD6QMY5KyP13LwO3A/168s.jpg", "caption": "Crab cake"}]}}, {"review": {"des": "Wow....how things have changed!<br><br>Stopped in on a Tuesday night and was pleasantly surprised by the service and quality of food!  It's been a LONG time and we didn't kick off with the best first impression, but damn, it was delicious last night!!<br><br>First, it's a cute space.  Totally RN upscale fish joint.  It's still pretty cool after all these years...who knew?!<br><br>Second, service.  Our server was EXCELLENT.  I loved him.  He gave amazing suggestions from the menu and let us go at our own pace.<br><br>Third, the food!  *uck, it was good!  <br>Oysters-YUM!  We did a shit ton and all were perfectly fresh and delicious<br>Fish tacos-I think they changed the tortillas!  Although still corn, they are lighter than I remember.  Also, the sauce was plentiful and cabbage gave it the perfect crunch<br>Oyster sliders-yep, still little fried messes that were amazing!  Probably could have ate 10 of these<br>Hamachi crudo-good, but I felt was a little overwhelmed by the fennel...my least fav dish of the night<br>GT deviled egg-not an egg at all but I loved the pea base, rich cream, salmon and trout roe.  And the presentation is on point!<br>Fish & chips-I didn't have any...but it looked good<br>Monkfish-star of the night!!!  A delicious paella with all kinds of seafood, sausage, rice and let's not forget the buttery spices.  It was amazing!<br>Lobster roll-yum!!!!!  It was delicious and packed to the gills with lobster.  Fresh dill and creamy just how we like it.  The lemon just made it perfect!<br><br>It's pricey but delicious!  Glad I tried this place out again!", "pics": null}}, {"review": {"des": "Was in Chicago at the end of August for work. Wanted a lobster roll & this was close to my hotel. Best lobster roll I've ever had. Fresh, generous chunks on a perfectly toasted roll. Liked it so much, I went back a few nights later when a girlfriend met me for the weekend. We both got lobster rolls & shared the lobster Mac n cheese. Will definitely be back on my next trip in January! Great good, great staff, great ambiance.", "pics": null}}, {"review": {"des": "One of my favorite places to go. The tuna poke is so yummy and I love tasting all the different oysters. They have east and west coast oysters. It's a great place to grab brunch with a friend too. I've never had anything I didn't like here.  Also back to that tuna poke...sometimes I sit at home dreaming about the next time I can eat it. The mango is so good with it and I really, really wish I knew the recipe since currently live out of state now. FeelsBadMan. Back to dreaming about tuna poke...<br>Edit: I forgot to mention that the lobster Mac is also superb.", "pics": null}}, {"review": {"des": "Adding two stars and will give GT F and O another chance. After I wrote the below the management found me and were genuinely interested in my experience and promised that they had heard me . They implored me to try them again which I plan on doing. Everyone has  a bad night and maybe this was theirs. Certainly have only had 5 star experiences at  other BOKA restaurants<br>10/18/2018<br>Somewhat disappointing . Pricey and good not great food. Seems casually run. Arrived on time , checked in and told the receptionist that I would be at bar waiting for my guest. We enjoyed a drink on her arrival and when we went to get seated were told our table was gone and we would have to wait. Does anyone remember the days when the host would come get you before they gave away your table? I would expect that at the IHOP but not at a downtown high end restaurant.<br><br>1 person voted for this review<br><br>  <br><br>.", "pics": null}}, {"review": {"des": "The only reason GT didn't receive a five star review is because of lack of consistency. While the chicken & waffles, which is probably the best in the city, contained its original greatness the \"shrimp & grits, which was also probably the best in the city, took a nosedive. It had a thick gravy like texture & it wasn't what I remembered from years past. The Bellini was amazing, perfect balance of wine versus purée. The lobster roll lacked flavor in my humble opinion however the \"brioche satine\" was to die for. Another reviewer,  Michelangelo V, spoke of the entrees being on the smaller side & I agree however on this Mother's Day the dishes were served \"family style & there was plenty of food. To be honest this is one of the better options for brunch in Chicago & again the chicken & waffles is the best in the city. I've never been here for dinner nor lunch but that'll change soon", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/h8cgzluPVfxFsvPV4Xzzsw/348s.jpg", "caption": "Paris brest"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8vd4j5AWZUWF9kgFooS5Kw/168s.jpg", "caption": "Brioche satine"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-VK5LxbshTkI5ZtH-IuoeQ/168s.jpg", "caption": "Fried Chicken and Waffles"}]}}, {"review": {"des": "Kudos to the BOKA group. We really liked it. <br><br>The ambiance felt intimate with the low lights and tasteful décor. It felt trendy yet laid back. The hubby and I came in for an occasion which I noted on the Opentable reservation. The host and staff were gracious and took notice.    <br><br>The service was knowledgeable from recommending the wine, to the oysters and dishes even suggesting quantity and size of dishes. <br><br>We tried probably 1 too many dishes which the waiter warned but we stuffed ourselves anyway with great food. We tried:<br>- 6 oysters: we enjoyed the 2 varieties of Massachusetts oysters over the east coast <br>- Hamachi crudo - light refreshing, the dressing was scrumptious that I was spooning extra <br>- Scallops - this dish came with roasted brussel sprouts and butternut squash puree and other ingredients which probably shined better than the scallops themselves.  <br>- Monkfish - the fish is served over a delectable seafood and sausage paella. They should just label is as Paella and not just monkfish...thought the monkfish was really good too. the dish also comes with large shrimp...which won us over easily. Best dish of the night<br>- Mussels - mussels were sizable, tender and fresh. However, the marinara base was just not as delectable. Some extra garlic or tangy notes would have drawn me in. This was probably the 1 extra dish I would pass on next time. <br>- Pannacotta- this is probably the best panna cotta I have had. It had a coconut buttermilk base with pineapple and tapioca and other stuff. The staff was nice to mark the plate with \"Happy Anniversary\" using coco powder. They even provided some bubby on the house which was a nice gesture. <br><br>The prices can seem bit high but the plates are executed well. Each dish has a featured item but the accompanying ingredients shine as well.  The hot sauces on the tables seem a bit out of place....none of the dishes we ordered need hot sauce. We still tried each by it self cuz why not.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mq6653b23NSPZTkqYOY2NQ/348s.jpg", "caption": "Panna cotta was amazing"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bjsTzDlcU-mfsxQsIspVxw/168s.jpg", "caption": "Monk fish on paella...awesome dish"}]}}, {"review": {"des": "\"Meh. I've experienced better.\" pretty much sums it up. It's not awful, not great either, it's just okay. <br><br>The clam chowder would have been the best thing ordered with lots of clam, bits of pork belly, potatoes, celery, etc. The flavor was good, though extremely salty. The consistency was a bit thin and watery. Good, not great. <br><br>The mac and cheese was piled high with big pieces of of lobster, though the mac and cheese itself was pretty lackluster. Shells in a sort of cheese rue that tasted bland, almost chalky. <br><br>Fish tacos are small, tortillas are limp, pretty innocuous, also pretty flavorless. <br><br>Oyster poboy sliders - interesting idea with the Korean fusion. I was looking forward to the kimchee and fried oysters. The bun was basically a Hawaiian roll that you can get at the grocery store, the sweetness and the starchiness sort of overpowers anything else except for the garlic in the kimchee. Without all that, the oysters are breaded rather heavily and overcooked. <br><br>It's not awful, but certainly not what I expected from a place that is held in such high regard by so many.", "pics": null}}, {"review": {"des": "Nice plates, well constructed, very tasteful . Oyster selection was not huge but still very good. <br>The decor is simple, modern and friendly. Quite loud but not excessively. <br>Tuna poke is great", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fekbUklrV65IaZ1DST3YtQ/348s.jpg", "caption": "Flan Tart"}]}}, {"review": {"des": "Scallops were fantastic. I usually hate scallops but I loved them here. It's amazing with the corn puree. Oysters were good too. Fish & chips were fine but not mind blowing.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zkjTDx6sOhuhE20u0H2h8w/168s.jpg", "caption": "Fish & Chips, scallops"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eUVxIn_TQUITSnudOvrQwA/168s.jpg", "caption": "Oysters"}]}}, {"review": {"des": "So happy a table opened up to enjoy our anniversary here. The hostess and bartenders were so great! Hostess asked if we wanted a cute table since we put it was our anniversary on the reservation. The bartender even offered to walk us through the menu. The crab cakes, crab legs and Mac & cheese were all amazing!!! We will be back for sure!", "pics": null}}, {"review": {"des": "One of Chicago's best.  From the hostess who helped me secure two spots at the bar on a very busy Saturday night when the Cubs game ran long preventing us from making our reservation (we NEVER leave a Cubs game early ...), to our bartender/server Chloe who made us feel like family, to the delicious food - GT is a Force!<br><br>We started w/ the king crab, shrimp bruschetta and oyster sliders.  King crab was perfect, firm meat and not watery.  The bruschetta was ideal - crisp bread, well seasoned, avocado mousse and the secret ingredient - grapefruit - it worked perfectly.  The sliders were unreal - oysters fried perfectly, kimchi and chopped peanuts served on a perfect brioche roll.  For our entrees, we had the duck confit (my \"turf..\"), lobster roll, and halibut (Chloe's new favorite).  All were fantastic, perfectly cooked, unique preparations. My son didn't share his lobster roll but he said it was \"fantastic!\"", "pics": null}}, {"review": {"des": "Stopped by for some seafood and it was a delight!<br><br>The Tuna Poke was vibrant and full of flavor- the mango on top was juicy and cucumber slices underneath were delicate and brought out the tuna flavors. <br><br>The Fresh Oysters were very meaty, simple, clean, and delicious.<br><br>I tried the Fish Tacos because I'm not too big on them, and these were quite yummy: I loved the creaminess of the garlic marinade and chipotle aioli, while the crispy pork chicharrones on top added a subtle crunch. <br><br>The Oystet Po' Boy Sliders were po' sitively savory and I loved the kimchi and peanuts.<br>I usually don't like fried oysters, but the texture of them in slider form was great.<br><br>On the hunt for the perfect Lobster Roll, I tried this one and was blown away by the portion size-- easily my favorite item! The lobster chunks were large and firm, the roll toasty and buttery, and the side of fried onions and pickled vegetables were suitable for such a rich sandwich. :)<br><br>I will be back to try the Fish & Chips", "pics": null}}, {"review": {"des": "I went to GT Fish & Oyster for the first time for a birthday celebration. It was nice and cozy - I loved the atmosphere.<br><br>Service: Our server was always around to take our plates and bring out new ones. No complaints here.<br><br>Food: 1st Course - The Clam Chowder was really good! It was creamy and I could taste the bacon - it gave it a nice smoky, meaty flavor. Everything was really fresh tasting and it came out hot. I would definitely order again!<br><br>2nd Course - The Scallops: Yum!!! This was my favorite part of the dish. The scallops were cooked to perfection! The brussels sprouts were well seasoned and cooked just the way I like them. The butternut squash was a nice compliment and tied the whole dish together; the creamy and sweet flavor added another layer to the whole dish. We scraped the plate clean :).<br><br>3rd Course - The Maine Lobster Roll: This was the only part of the meal I was a little disappointed with. The lobster was chewy - like it had been frozen a little too long. The fried onions that came with it and the roll itself was nice. The roll was buttery and then cooked until crisp on the outside.<br><br>We were too full for dessert, so we decided to just grab the check. Since we were there for a birthday and didn't get dessert, they gave us a gift card to come back. I love that the restaurant helped him celebrate too!<br><br>I'd like to come back and try more of the menu and sample the drinks!", "pics": null}}, {"review": {"des": "Trivia: GT means Guiseppe Tentori's. <br><br>Handsome modern decor and black wood accents. They have the most delicious lobster roll and clam chowder in downtown! While the lobster roll is much pricier than its contenders, I would recommend you trying it once as its an absolute wonder. I couldn't stop nibbling up their plethora bed of fried onions. Very aromatic and addicting.", "pics": null}}, {"review": {"des": "I came here for the oyster shucking class and definitely had a fantastic time. At the class I got to learn a little bit about oyster farming and the difference between east and west coast oysters. It was a smaller, more intimate affair, with great drink service and the opportunity to shuck and eat a dozen oysters. It also came with two glasses of wine to pair with the oysters. <br><br>For the shucking portion itself, I wish the wine had come out a little quicker or had been spaced better. Wine came out when we started to shuck and then the second glass came out at the end... when I had already finished my dozen. I definitely feel they didn't need to have us order cocktails at the start. The result was me drinking a cocktail and two glasses of wine in about an hour which... for me... is a lot. But, as I said, the event was fun.<br><br>The event also came with a bottle of the sauce used by GT, and 20% off a meal. Obviously, after class, I had dinner. The food was absolutely fantastic. Each item outdid the next. And my only regret at the end of the night was that I didn't have enough room for dessert.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RAWjFhTmqAXSOOv_ClVaJQ/348s.jpg", "caption": "Duck confit"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RF6OwiRsgYoz1uuPU9_AVg/168s.jpg", "caption": "Octopus"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QzSMNkuC1B0z5UrdDGfl5Q/168s.jpg", "caption": "Oyster po'boys"}]}}, {"review": {"des": "I went here back to back essentially, so I will combine my experiences.  The first time, I tired the duck, linguine and clams, and scallops.  All dishes were cooked perfectly and tasted great.  The items that the scallops come paired with were a bit strange and in my opinion, unnecessary/ could be better.  The scallops were cooked perfectly, so it wasn't really a problem.  I tried the chocolate cake, key lime pie and panna cotta.  All were incredible, good enough to scrape the plates.  I personally had the panna cotta so I will describe that with the most detail.  It had some strange ingredients, pineapple,  carrot cake,  pineapple tapioca, pecan crunch, toasted coconut sorbet, and pink peppercorn, but the flavors combined beautifully and lead to a perfectly balanced dish.  The server, Scott did a great job and was very attentive.  The bus boy was amazing at filling up my water, as I was very thirsty and drained my water a few times.", "pics": null}}, {"review": {"des": "I stopped in here for brunch with my husband and a friend because we wanted to take advantage of their restaurant week menu and we had never been there before. Turned out that this was a really great stop. Upon entering, you will see that the place is really modern and open while maintaining a casual vibe...not something you expect from a seafood restaurant. The restrooms are also really spacious and well decorated (oh, and clean...always a plus). <br>I am glad we made reservations because it was really packed at 11am on a Sunday. We were seated at a table against the wall that had bench seating on one side and chair seating on the other. The good news is that the bench was high enough to be comfortable at the table. The bad news is that the tables are so close that the table sitting next to us got my butt hovering over their food as I slide between the two tables that were really close (this is one of my pet peeves).<br>We started off with good coffee (they serve la colombe). I really wish they had some sort of milk alternative but they only have whole milk or cream. The monkey bread came out next. The waitress must have had some issues with people being upset about not being served an entire serving of monkey bread per person as she gave us some talk about even know there is only one order it was meant to be shared. However, we had 3 people so they would be bringing out 2 full orders. The restaurant was trying to not be wasteful. This was fine for me, half an order was PLENTY. But, if they are getting pushback perhaps they should just change the order size??? The monkey bread itself was really good. It was moist and it was sweet but it wasn't over the top.<br>The next course was Cesar salad and clam chowder. This Cesar was really taken to the next level. It had peeled tomatoes, deep fried sardines and was topped with a beautiful parmesan crisp. The clam chowder also didn't disappoint. It was served in a really beautiful mason jar and my friend told me it was delicious.<br>Last we all moved on to Fried Chicken and Waffles served with Burton's Maple Syrup (Mmmmm). Their Smoulder sauce tastes really great on this! It was as a really large piece of moist and tender boneless fried chicken that had a little kick in it. The Belgian waffle was ok. It seemed to have pretty good flavor but I really like a crusty waffle and this was more on the soft and soggy side. <br>Overall, I really enjoyed this place and will be back.<br><br>Pro-tip: Ask to sit next to a window as this is a good view of the city.", "pics": null}}, {"review": {"des": "While in Chicago, had an opportunity to relish the key lime pie. So, today decided to stop in for dinner.  Hostess was very courteous and gave us the table we wanted.<br><br>Ryan, our server, was excellent. Made great suggestions. We had Thai Coconut Soup, Mussels - with roasted tomatoes, basil and toast - and a side order of egg plant - with plum hoisin and cashews.<br><br>Now, every time I go to my favorite sea food place (since early 1990's) in Atlanta - Atlanta Fish Market - I will be reminded of GT Fish and Oyster in Chicago. Thanks.", "pics": null}}, {"review": {"des": "This place was fabulous. Went with my sister for a night on the town. Started with an oyster shooter. When it came the oyster was on the side, which was not what I expected. But still good. <br><br>We sampled many of the small dishes, chased down with a bottle of wine. Great service. Would definitely come back again.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qpRPN-f2PRQE_Eiy_OMnTg/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mteJEnTtdfsJ4pva6EkpjA/168s.jpg", "caption": "Oyster shooter"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PC7JdxQwKREWyuGUa-pbIg/168s.jpg", "caption": "Oysters!"}]}}, {"review": {"des": "Food: I was very impressed by the lobster mac & cheese. The serving size was so large, it provided me with two meals. Topped with bread crumbs to spice up the texture, but I wish the cheese was creamier--the sauce was a little dry. However, there was a surprising abundance of lump lobster meat, which is a huge plus!<br><br>Drink: They have a sommelier on site, who created the wine menu and answered our questions in great detail.<br><br>Service: A+<br><br>Vibe: This place brought the feel of Newport, RI to the city! If you're looking for a nautical, high-end place to dine with a small group of friends or family--this place is it.", "pics": null}}, {"review": {"des": "I've been here for dinner, happy hour, and now brunch. Yummy every time!<br><br>Service & atmosphere: The decor is upscale but not stiff, with a nautical theme. The service has always been fantastic; I was even given a birthday gift card which was so sweet!<br><br>Food: I ordered the crab benedict. The crab tasted fresh, I loved the uni hollandaise, and the swiss chard was an interesting, but not unpleasant, addition. My partner ordered the breakfast sandwich with country potatoes and thanks to his small stomach, I ate half of his meal. The potatoes were crispy and salty and the sausage and papaya relish added a sweet dimension.<br><br>Though everything  tasted great, I will say I would prefer coming back for dinner or happy hour- who would say no to half off oysters!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KhA63M2tko20XjV94XF9tA/348s.jpg", "caption": "Crab Benedict and breakfast sandwich."}]}}, {"review": {"des": "The Flavors, the ambiance, the vibe---on point!  Really enjoyed our meal and will definitely return. <br><br>However when told by hostess there are seats at the end of the boomerang and go fetch---sets a bad tone. Initially ignored until I went back to \"Ms. Thang\" and asked for menus and then she wants to accompany me to my seat and deliver menus. Add to that my simple request for sparkling water with a splash of bitters...the first person said he'd have to ask my server if they could make that happen, second person bought over tap water, third person took the order again and eventually our waiter emerged and I got what I wanted.   In this day and age there is no reason for food to come out and for anyone to go Table to Table trying to determine who it belongs to...our waiter, Joe was a delight but the rest of the team needs to go back to training to assure the overall experience aligns to the amazing food. <br><br>No issue dropping 200 bucks for 2 but the total experience needs to be stellar!", "pics": null}}, {"review": {"des": "We went here as part of GT's surf and turf deal. It was amazing from start to finish. We got there and something had gone wrong with our reservation. They immediately found a table for us and profusely apologized. We started with the oysters which were fantastic and they comped them as part of the surf and turf deal. We opted for the wine pairing which I would highly suggest. Every drink we got was exceptional and they had a heavy poor. The first item on the tasting menu was a deviled egg but it was not your grandma's deviled eggs. They had whipped the egg so it was so creamy and it was atop a spicy puree. All of it was also still in the egg shell which was a great presentation. Next was a shrimp avocado toast  with some grapefruit. All the flavors paired well but it was definitely the least stand out dish. Next was the tuna poke which was AMAZING. The flavor of the tuna was just simply incredible. The most perfect seasame infused tuna. Next we had an oyster po boy. It came with kimchi which I was initially skeptical of but it was actually the perfect pairing. Lastly we had a declicous clam chowder. Would highly recommend GT oyster. Everything from the food to the service was perfect. Would be curious if it's this good on a normal night but for a special event they really went above and beyond", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/38NMj0R49hdtUwbldbepyg/348s.jpg", "caption": "Surf and turf tasting menu!"}]}}, {"review": {"des": "Food was amazing and the service was amazing! We really enjoyed ourselves! I had the Chicken and Waffles! Chicken was seasoned nicely and the waffles were nice, fluffy and sweet!", "pics": null}}, {"review": {"des": "Oyster and seafood lovers-this is a great Chicago option! My husband and cousin really enjoyed the variety of oysters and was impressed with the flavors. Each oyster is about $3, I'm not sure if that's expensive for oysters or not, but seems hefty to me! <br><br>The other food was pretty good. The scallops were ridiculously good! The swordfish paella was decent. The linguini and clams was just alright. <br><br>I was disappointed because we made a reservation and yet they put us at this awkward dinky table right by the entrance. The table was a community table and awkwardly arranged.", "pics": null}}, {"review": {"des": "I can't believe I'd never been here before and I'm daydreaming about the day I'll be able to return. I had the immense pleasure of being invited for a Birthday Party in the Whale Room and it was definitely a night to remember!<br><br>We arrived and were led to the basement and into a back room. It seemed pretty sketchy, but the trek down under is well worth it when you walk into the Whale Room and you're greeted by a great cocktail list. We started with wine and then ordered some stronger drinks. We had time to mingle and then we were seated for a million-course dinner that I won't soon forget.<br><br>SEAFOOD TOWER<br>You can't really go wrong with anything with tower in the name. I wasn't big on the clams, but the oysters, muscles, shrimp, lobster and crab were all so good. My Husband said it's the first time he's felt crab was worth the effort to eat.<br><br>TUNA POKE and SHRIMP BRUSCHETTA<br>Both relatively light bites when shared but a nice seafood segue into the heavier items that followed. I liked the addition of the cucumber and mango to the plating of the Tuna Poke and the Bruschetta bread was toasted to perfection.<br><br>GT \"DEVILED EGG,\" OYSTER PO' BOY SLIDER and FISH TACO<br>The GT \"Deviled Egg\" was also pretty small and I would say light but it packs a lot of salmon mousse flavor. It's really a one and done type dish. The Oyster Po' Boy Slider, on the other hand, needs to be sold in a Crave Case. It's hefty with the bread and breading but small, obviously, since it's a slider. One is not enough. And the Fish Taco was something I was very excited about but the plating put me off a bit. It's beautifully constructed but seemed to be more filling than fish. However, I was pleasantly surprised to find that what fish there was had enough flavor to satisfy and I would recommend it.<br><br>DUCK CONFIT, LOBSTER ROLL and BLACK ANGUS STRIP LOIN<br>This part of the meal was a bit more like surf 'n' turf. The Duck Confit was fabulous and the Black Angus Strip Loin was tasty but the seafood is where it's at. The Lobster Roll was a fast favorite.<br><br>GT \"MAC & CHEESE\"<br>I wasn't immediately in love with it but I came around. I found myself unable to stop eating it and I've been thinking about it a lot since. I saw they offer a GT Lobster \"Mac & Cheese\" options, too. I'd definitely be down to coming back to give that a try.<br><br>KEY LIME PIE and CARROT CAKE<br>I was much more a fan of the Carrot Cake than the Key Lime Pie, but that's more of a pie-style preference. The Key Lime Pie is very good but simply not my style. That doesn't make it bad, you just have to like that kind. It was much more like a cheesecake than custard consistency and pretty tart. Give it a try! It might be just right for you.<br><br>COCKTAILS!!!<br>If you come for nothing else, come for the cocktails. There are so many well crafted cocktails from which to choose. I tried The Waitlist, Otono, Secret Handshake, Cinn City and Let's Make A \"Dill.\" I will admit that I was not into Let's Make A \"Dill,\" but it's again something I can say is an acquired taste. The Waitlist was my second favorite, but Cinn City was hands down the crowd favorite of the night.<br><br>Sorry for this whale of a tale of a review. It's large, but so is my newfound love for GT.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fHWyK0WkAbtqI-D0FdFwnw/348s.jpg", "caption": "HBD JC @ GT"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nhEkWOe1jHwOpVcS__zDww/168s.jpg", "caption": "Whale Room party"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kuKap3J8m-L_1WvkTdAOxw/168s.jpg", "caption": "Whale Room party"}]}}, {"review": {"des": "I cannot believe that this is a one star review.  My reviews for other Boka Restaurant Group restaurants have all been 4stars or higher, yet somehow I am still grasping at straws trying to wrap my head around why I was so let down by GTF&O for my first (probably only) visit.<br><br>Because of my sincere love for BRG, id like to preface this review by saying I do not for a second think that the overall tastiness and/or quality of the food here can be narrowed down to my review solely. Afterall, there are hundreds of other 4 and 5 star reviews here praising the restaurant. <br><br>I just think (hope) my visit was at a very unfortunate hour on a very unfortuante day. We visited on a Sunday afternoon, unbeknownst an hour from closing, during restaurant week. By the time we left, we were the only diners left in the restaurant. <br><br>Location: GT Fish & Oyster is located in the heart of River North; surrounded by Chicago's signature Irish pubs and other such bar-restaurants. It is definitely touristy, so be prepared to wait. Even if you made a reservation in advance (as I did).<br><br>Decor:  Upon arrival, diners are greeted by an extremely loud dining room. Wood paneling and ceiling makes the noise two times louder than necessary. Plus loud music (good choice in playlist though, Mariah Carey's Fantasy played as soon as I walked in. She is my queen!) Very tall ceilings and windows to pair, invite in tons of natural light. The decor gives a trendy marina aesthetic. Lots of whites and natural colors keep the beachy feel throughout. Unfortunately this applies only to the top level. Me and my friends were escorted to the basement level, all the way to the back and around to an empty room where there was no good lighting or design aesthetic. The tables were communal, the seats were basic. It was awkward, and so was my experience from that point forward.<br><br>Service: It took 15 minutes for our waiter (who didn't even know we were seated) to come and get our drink orders. Because we had all been waiting for our table and then our waiter to finally get to us, we gave all our orders at the same time. About 30 minutes later the food came. The waiter didn't remember who ordered what, so I just told him to set it all in front of me so I could snap photos for the review anyway and then disperse accordingly. That was the last time we saw him. The busser was the one who followed up with us from that point. Interesting.<br><br>Food: I can't recall being so excited to eat prior to visiting a restaurant, having such high standards and hopes for a delicious meal, to be let down in a mighty way. <br><br>Monkey Bread: Tasty. Yet it arrived cold. Would have been splendid had it arrived at least warm. <br><br>Lobster Mac & Cheese: Also arrived cold. Lobster did not at all taste fresh. Because it was cold, the cheese had hardened somewhat. If I'm being honest, this Mac & Cheese tasted very similar to Steuffers. My friend was too hungry to send it back for reheating so she dealt with it.<br><br>Breakfast Sandwich: Again. Cold. My other friend said he has had better breakfast sandwiches at McDonald's. Ouch. <br><br>Crabcake Benedict: Probably the most disappointing item I had during restaurant week. C. O. L. D. I'm sorry but cold raw egg yolk just does not do it for me. And neither does cold hollandaise. I understand the egg can only get so warm before it starts to scramble in front of my eyes, but if the hollandaise had already solidified before I even bite into it, that is a problem. The crab had no flavor and neither did the hollandaise. <br><br>Chicken and Waffle: Portion size was laughable. The waffle was cold also. Tasted identical to Eggo.<br><br>Shrimp & Grits: the only warm dish to hit our table! Grits were good! Shrimp was okay. No other noteworthy components of the dish.<br><br>Chocolate Hazlenut Pastry: The bite that I had was quite tasty. And moist. It is a good option. <br><br>1 star across the board because of the wait, the lack of service, and the cold, tasteless food.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qVnCdsmqOLaMYa8QCEQkhA/168s.jpg", "caption": "Chicken and waffle"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0r3AfYyVbwbiP3cn86k8uA/168s.jpg", "caption": "Shrimp and grits"}]}}, {"review": {"des": "2nd Stop on the Brunch Bites Tour!!! The Oyster Po' Boy was to die for! I will definitely be back!!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XYfeGjKabRq5GbNVyFehUA/348s.jpg", "caption": "2nd Stop...... Brunch Bites"}]}}, {"review": {"des": "This place makes you wish you had tape worm so you could eat everything! The lobster roll was thee best! Literally! Fresh, succulent, juicy pieces of lobster on a buttery Texas toast! Doesn't get any better than that. Not over powered by mayonnaise and not overly dressed. Just big chunks of lobsters on a buttery toast. I couldn't even finish it. You must come here! And then head across the st to bottle and blonde. Best bar in town.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oFQ68vR_H4SNMF0i3ABbgA/348s.jpg", "caption": "3 different types of yummy oysters."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TY8YfL3gfGDytFLUFtGVVA/168s.jpg", "caption": "Cesar salad with fried oysters and anchovies!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pPQJa3xLzkcf1pHvioS-_w/168s.jpg", "caption": "Clam chowder, so good!"}]}}, {"review": {"des": "We had an incredible meal at GT fish.<br><br>We started out with an assortment of raw oysters that were delicious and incredibly fresh. They ranged from super briny to very mild and buttery.<br><br>The tuna poke was delicious. Perfect balance. The fish was complemented by each ingredient without being overpowered. <br><br>The hamachi crudo was also excellent. Served with edamame and chile oil, I was concerned the fish would be overwhelmed. However the balance was perfect. The chile oil was an awesome accompaniment. <br><br>The deviled eggs were excellent! Such a unique interpretation! The texture of the \"mousse\" was so pleasing and flavorful. The dish was so good my buddy ordered a second one for dessert.<br><br>The mussels were outstanding! They were fresh and perfectly cooked. The tomato sauce was perfect! There was tons of garlic, the right amount of basil, and perfect acidity. The bread served with the mussels was perfect. With a great toast and buttery flavor, sopping up the tomato sauce was necessary and very enjoyable!!<br><br>The lobster roll was also fantastic! Super simple with a buttery toasted roll and tons of lobster, this dish made me forget about the mayo style perpetration. I was just exceptional. <br><br>The halibut was also incredible! It was perfectly cooked and served with beautiful mushrooms and mustard seeds. I was very impressed!<br><br>Since we had ordered a lot of food and cocktails, the kitchen sent out some desserts for us to try. The key lime pie with gin and tonic sorbet was average. The PBJ dessert was excellent! With crunchy sorrel leaves, fruit, and peanut flavor I really did feel like I was eating a peanut butter and jelly. <br><br>I would certainly recommend this restaurant without hesitation!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5DXg36BRvHSpXFRTMFuVxw/348s.jpg", "caption": "Deviled egg"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eOY77cnggjmAsUfc8UEpxQ/168s.jpg", "caption": "The most incredible mussels!!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Axtm_k6LvGubbSMONmESyw/168s.jpg", "caption": "Tuna poke"}]}}, {"review": {"des": "Nice ambiance! Decent food, I ordered cesar salad (the tomatos that came in it-not good) scallops (yum!) and black bass (fresh). Server was better than most. She was charming and provided great service. Valet uses an app to pay and delivers car during check. Very convenient and tech forward. 3.75 stars.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/esUvm4CmwcGZaggeSm3R2w/348s.jpg", "caption": "black bass"}]}}, {"review": {"des": "Worst service I've EVER had in Chicago! Wow unreal. Four of us girls were in the bar waiting for our reservation. We were seated late on a Tuesday evening when there was hardly anyone in the restaurant. Anyway the lady in their was awful out bus boy also agreed at how horrible she was as a waitress. We then moved outside and the service was even worse. After 15 minutes of waiting we got up and moved to the restaurant next door. (A table sat down behind us after and 25 min has gone by and nobody has assisted them either.) The server finally came out to us after we had already moved to the new restaurant and didn't care to get a manager or anything. I can't get over the reviews for this place. If only I got to try the food.", "pics": null}}, {"review": {"des": "My first oyster experience!!<br>My husband and I decided to go for brunch here. To make our Sunday adventurous we thought of trying oysters. We ordered two of different kinds(east coast & west coast). It was presented properly ( I could pick them up and eat it raw :D ) and totally loved it.<br>Later we ordered Duck confit & Lobster Benedict. Both tasted very good. We loved our meal and experience there.", "pics": null}}, {"review": {"des": "The service at GT was excellent and the food was amazing!  Scott was our server and he was very attentive to our needs and requests. He thoroughly went through the menu and described choices that would be suited for each of the guests.   The server assistants were very prompt to refold napkins and reset the table between courses and ensure that everyone had what they needed to enjoy their meal. The food was absolutely amazing! A must go to if you're in the neighborhood. I recommend the clam chowder and the linguini and clams was to die for!", "pics": null}}, {"review": {"des": "Private seating area is to die for, hidden in a charming way, setting a great ambiance for food! Considering I was here for Restaurant Week brunch, I had to pass on the oysters to make sure I had room for a three course delight! (I know sad...but the brunch was worth it!)<br><br>Service was attentive and thorough, and swiftly a sweet and nutty crepe tart kicked off the meal (amazing with coffee). The tart was not heavy and left me ready for more. The breakfast sandwich was a breakfast felt like an ode to Vietnamese Banh Mi with the flavor profile, but again was flavorful without being overly heavy. If you enjoy the refreshing taste of cilantro and slight tang common of Vietnamese fare you'll love that sandwich. Finally ended the meal with shrimp and grits that were as thick and creamy as a true Southern dish should be. <br><br>Can't wait to come back for the oysters and try other delightful treats!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/D_0us8ZaC_jzcQJzvchCew/348s.jpg", "caption": "Restaurant Week: SHRIMP & GRITS--lobster creole sauce, tasso ham, corn"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Pdd7yYr3xcgSkGrV0eoyRw/168s.jpg", "caption": "Restaurant Week:  GT BREAKFAST SANDWICH sausage, egg, green papaya relish"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fFrqUBWPc6lNrYphCamWBg/168s.jpg", "caption": "Restaurant Week: Sweet crepe tart--pastry cream, chocolate glaze, hazelnut"}]}}, {"review": {"des": "Spoke to Operations Manager re suspected skimming of my credit card. He looked into it and reviewed the store cameras and reported that our server was in full view and didn't skim my card. I'm baffled but can't prove my claim. S happens. He was sympathetic, respectful and looked into it immediately.", "pics": null}}, {"review": {"des": "What a wonderful find. Someone really knows what they're doing here. Fresh, delicious fish, prepared with a great deal of thought and skill. The staff is friendly and courteous, and I mean everyone. <br>We had the halibut and poke salad and the hamachi crudo. And the desserts are great too. <br>You will enjoy it all.", "pics": null}}, {"review": {"des": "I only had oysters, clam chowder, and beer so that's all my review entails.<br><br>Great selection of oysters. Very freshly but you are definitely paying for the freshness. It won't be a cheap lunch at all. One really good thing about this place is that they some good hot sauces that provide good flavoring to the oyster selection. <br><br>The clam chowder was great and tasted like each little bowl was cooked especially for you. Lastly and believe it or not the little crackers were so good! They are nothing like the packaged ones and your life will be changed forever.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/a7C5peTy5yw9VEc7pfQZQQ/348s.jpg", "caption": "Clam chowder and amazing oyster crackers"}]}}, {"review": {"des": "Good seafood! Pretty fancy spot so I like sitting at the bar to make it more casual. Great drinks. Nice spot for a date. Expensive but so is everything in this area. Good service!", "pics": null}}, {"review": {"des": "[Read my FULL REVIEW here: <a href=\"/redir?url=https%3A%2F%2Fhangrynat.wordpress.com%2F2016%2F05%2F16%2Fweekend-indulgence-at-gt-fish-oyster%2F%255D&s=54fbe70eca7984793a4bcb0b3be1d0c0df07d8037313b1abe087aa479682dc6f\" target=\"_blank\" rel=\"nofollow\">hangrynat.wordpress.com/…</a> <br><br>I did not enjoy oysters one bit, until I came here. Not exaggerating when I say the oysters here are life-changing because they did permanently change my attitude towards oysters! They were fresh and sweet, with barely any of the odor that I had always despised in fresh oysters. <br><br>Probably the best meal I have splurged on in Chicago so far. Giving this place a 5 stars because GT is all-rounded in every aspect - beautiful restaurant, amazing ambiance that suits any dining occasion, delicious and well-executed dishes and impeccable service. <br><br>From the oysters to the appetizers to the dessert, there was barely any room for critique. My friend and I actually came here for Chef's Week menu, but ended up caving in and ordered everything else. My recommendations are: raw oysters (of course), tuna poke, grilled prawns with saffron rice and their desserts. Trust me.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZVpJKS3Otdt8uQS3dZzXrg/348s.jpg", "caption": "Grilled Prawn with saffron rice"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/i65ckRaChQNMUFXU424wHw/168s.jpg", "caption": "Fish Taco"}]}}, {"review": {"des": "Loved this place! Great food, great service, and they also played some of my favorite 80's songs :) <br><br>Dishes that I've tried here: <br><br>Clam chowder - 4/5 The chowder here is on the thinner side (just the way that I like it). Loved the brininess and silkiness of the chowder, yet the clams in the chowder were still soft and tender. Not chewy at all. Loved it! <br><br>Oyster Po Boy 3/5 - This tasted good. However, I couldn't really taste the oyster as the kimchi overpowered the oyster. <br><br>Lobster Roll 4/5 - I am from Boston and I'm a HUGE lobster fiend. The lobster roll here was better than a lot of the other lobster rolls that I've had in my life in Boston and in Maine :). Get this! <br><br>Lobster Mac & Cheese - 4/5 - Yummms! There was something seriously addicting about their Mac & Cheese. I could NOT stop myself from wanting to eat some more after each bite - I think they added poison.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2F8nXKXns3YMBbwQ9jTb6g/348s.jpg", "caption": "Lobster roll - better than many of the ones I've had in Boston and Maine :)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/y-oApMymcHhqaxqicmNVkQ/168s.jpg", "caption": "Lobster Mac & Cheese. This was addicting! Tastes much better than it looks :)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/GszvqmIVTmuWh1LPyGta0g/168s.jpg", "caption": "Loved their clam chowder! It was briny, silky, yet the clams were still nicely soft and tender. Yumsss!"}]}}, {"review": {"des": "It still baffles me how the lunch bill for 2 came to $97 before taxes and tip.  I think this is a place that you just can't order a la carte. Lunch combo or prix fixe is the way to go. The menu online was not the menu we were presented, the one we got didn't have lunch combo or prix fixe listed. I wish the waitress pointed out the better deal.<br><br>As to food, the flavor was good but the quantity was maddening. I love small plates but the entree and the desert I had were so disproportionate, I felt I had a bad lunch. I ordered a wedge salad only because it listed jumbo lump crab as one of the ingredients, but there were just a few small pieces of crab meat with a small wedge of iceberg lettuce (I wish they were more creative and replaced the zero-nutrition iceberg lettuce by other leafy greens). This dish was not filling so I ordered panna cotta for desert thinking it would be the same small portion relative to the wedge salad ($19) or the clam chowder ($12 for 8ozs.) or the crab cake ($18 for a rectangular piece about 1X1X4), boy was I wrong! Panna cotta came in a cereal bowl and way too much as a desert. The texture of the panna cotta was off (too much gelatin?) and the flavor just so-so. Did they have the entree and desert size reversed?<br><br>Add one Bloody Mary ($13), 3 clams ($3.50 each), one Kurosawa Nigori ($9), tax and tip, the lunch bill came to $126. I don't remember ever having paid this much for lunch and not having much to eat other than the desert. This was my 2nd time at this restaurant, I plan to give it one more try with smarter ordering and see if it will stay on my list of dining options.", "pics": null}}, {"review": {"des": "Disclaimer: <br>So, I know that this is a Michelin rated restaurant. And while I have been to a few here in Chicago and NY, this one seems... pretentious. I don't use that word lightly -- I have been to the Metropolitan Opera House, Lincoln Center, CSO, Lyric Opera, Joffrey Ballet... galas... fundraisers... even at the New York City Ballet (featuring Ethan Steifel and Gillian Murphy, world class ballet dancers), the Lyric opera (performing on stage that night was Renee Flemming, world class opera star) and the CSO (co-run by the one, and only, YoYo Ma) -- those were chiller experiences than eating DINNER at GT Fish and Oyster. <br><br>My main message to you - diners and servers and managers - is to chill out. Longman and Eagle, Michele rated restaurant, mind you, serves guests on PIC-NICK BENCHES.  Have you ever eaten steak tartar on a pic-nick bench while the sun gently sets behind a city skyline that is at once a reminder of the chaos of city life and yet frozen in time, the world becoming just a reflection on a mason jar filled with the best old fashioned you've ever tasted?? <br><br>When I worked at Buddakan, which serves the upper crust of Manhattan (lawyers, Wall Streeters, famous chefs, and famous people including Leo DiCaprio, and the head chefs of which have gone on to become celebrities in their own right) my managers always reminded us, \"it's only dinner.\"<br><br>With that said, my review.<br><br>Food:<br>who cares, it's only dinner.<br><br>Service:<br>whatever, it's only dinner.<br><br>Drinks:<br>pretty good.<br><br>Dessert:<br>Just dessert, not event dinner. If it were dinner, who cares, it's just dinner.<br><br>Vibe:<br>Pretentious. Chill out.<br><br>Overall:<br>Would I go back? When you chill out. It's only DINNER.<br><br>Thank you.<br><br>(the clam chowder was pretty great, honestly. And the lamb was nice, too. And I actually really loved the tuna crudo.)", "pics": null}}, {"review": {"des": "So far good!  We planned this night 2 months in advance but still got seats by the door in bar dining not the main floor....   but it's too early to complain it's NYE!  <br><br>I'll update this review shortly after my true experience", "pics": null}}, {"review": {"des": "We sat next to a woman at the bar who told us she comes to GT 2-3 times a week. I can see why...GT has that perfect blend of being laid back, friendly, yet lively. <br><br>I'm a fan of any place where I can get oysters and bubbly at the bar. The oyster selection was a good mix of east and west coast. We had 2 of each for a tasting and the descriptions of each type of oyster was spot on! They had some unique varieties that were different from the typical ones we see on the menu.<br><br>I had expected a more traditional seafood place with a menu of many different trig cooked fish but this was more of a tapas style menu with small and large plates. We tried a few items from the menu, some great some ok.<br>-deviled eggs - they really pushed for this and I'm glad they did! Not a traditional deviled egg this is more of a salmon egg mousse put back into a half egg shell. The texture was fantastic and super delicious!<br>-Crab salad - not a huge fan of this...it was like a cold crab cake /ceviche. I had expected larger chunks of crab and the cucumber diluted the taste of the crab<br>-Grilled broccoli- this was unexpectedly yummy! Also their own take on it which included fried onions and roe <br>-Fish taco - ok as well. Couldn't really taste the fish amidst all the cabbage and fixings on top and the taco itself had a strong flavor that I did not love<br>-Carrot cake- A++ dessert! Small but just enough square of dense rich carrot cake surrounded by orange infused cream cheese and topped off with coconut ice cream. I would not have thought to order fan but hubby chose it and it was the best choice!<br><br>If I lived nearby it would be my go to neighborhood spot as well!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HqP_NHyCDJChl5n-jff66w/348s.jpg", "caption": "Carrot Cake - fantastic interesting take on Carrot Cake"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/97MV9rJqpfKi9EYEARMrKA/168s.jpg", "caption": "Fish Tacos - couldn't taste the fish...just the fixings and taco shell"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2JpUf_3ubUdAfa9D3MLzEw/168s.jpg", "caption": "Crab Salad - this was ok too much cucumber"}]}}, {"review": {"des": "Disappointing. The tuna poke looked good but the quality the tuna wasn't great. The clam chowder soup, duck confit are extremely salty.", "pics": null}}, {"review": {"des": "My husband and I had this restaurant on our list of places to dine in Chicago. We heard good reviews about this place and chose this eatery to celebrate our 9yr wedding anniversary.<br><br>This was the best decision we made!!! For starters we shared the bruschetta shrimp/avocado, clam chowder soup and a garden of fresh/charred broccoli. For dinner we had crabcake, fish tacos and the lobster roll. For dessert we shared the pb & jelly panna cotta and the carrot cake.<br><br>The fish tacos were ok but everything else was divine, delicious, scrumptious...i never had a meal where every dish raise the bar!!!<br><br>You've to eat here..even if you live out of state, buy a ticket and just fly into Chicago to only eat @ this restaurant.<br><br>As for the service, our waiter was warm, friendly and he made our dining experience even more special..<br><br>I will be back..", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3fNh4-uLqi6grYldqRvOWA/348s.jpg", "caption": "The desserts was delicious  (on & jelly panna cotta and the carrot cake)"}]}}, {"review": {"des": "Had disgusting oyster that smelled like feces. Very surprised they do not smell them before plating. Food is OK. lots of better places in Chicago. Waiter asked how can he rectify the bad oyster. Dah. Take it off the bill!!!  <br>Ultimately Manager came over and was very gracious. She took the Eyster of the bill. I had Alaskan King crab legs which was plenty to eat. The ice was that I did have were very tasty and did taste fresh. Good wine list. Service was very quick. I forgot my waiters name but he was outstanding and suggesting what you eat. I had Linguine and clams which was very good. They make their own fresh pasta and add a little milk to it which gives it a lighter softer flavor. I would suggest this for an entrée for sure", "pics": null}}, {"review": {"des": "My husband and I still talk about the meal we had here. By far the best clam chowder we've ever had. The scallops were delicious and the service was exceptional. I could go on and on but do yourself a favor and eat here if you're in Chicago. We can't wait to come back!", "pics": null}}, {"review": {"des": "Hands down my favorite seafood place in Chicago. It is on the pricier side, so know that going in. Most of the plates are meant for you to share, which they will go over with you at the beginning of the meal if it's your first time there. <br><br>Get oysters as a starter, they always have a great selection. You can't miss out on their deviled eggs either - it's really salmon mousse inside an egg shell - I could eat that every day. The clam chowder, smoker crudo, and monkfish are musts. Overall, never tried anything bad here.", "pics": null}}, {"review": {"des": "We had a great experience at GT!! The staff was very welcoming, enjoyable, and professional. The food was fresh, gourmet, and delicious! I highly recommend this for a date night!<br><br>I had the fish and chips and it was really good!!", "pics": null}}, {"review": {"des": "Came here for Valentine's Day and it was super busy but otherwise the food was delicious. We didn't realize before arriving that it was a seafood TAPAS restaurant. No big deal, we just ordered a bunch of little plates. We ordered the shrimp (only comes w/ 2 gulf shrimp), a tray of oysters (east coast variety), 1/2 lb king crab legs, fish and chips, scallops, and the gin&tonic dessert. <br><br>The seafood here was exceptional, really fresh and flavorful. I wish there were more shrimp for the \"shrimp cocktail\" but they were nicely dredged in a dill, lemon sauce. <br><br>The gin&tonic dessert wasn't my favorite, I felt the gin sorbet overwhelmed the dish. <br><br>Would recommend this place for a romantic evening out just request a table against the wall or a booth.  Bc the tables and chairs in the center of the room are placed close together.", "pics": null}}, {"review": {"des": "Cute little spot! My wife and I visited the location while experiencing the \"brunch bite\". We had the Po Boy sliders with peanuts and kimchi and it was actually pretty good. We didn't get a chance to enjoy the full menu but we will definitely come back and give it a try. I almost forgot the Bellini; that too was nice and refreshing", "pics": null}}, {"review": {"des": "Awesome experience from start to finish. Had a reservation but arrived with incomplete party so hostess suggested we wait at the bar until our party was complete, which we were fine with since we weren't in a rush. Bartender was friendly and served us drinks and salad quickly. Once our party was complete, hostess said she would inform us when a table opened up. She came right over to us at the bar about 10 minutes later and seated us. She was extremely accommodating even though it was our fault for not having a complete party. Our server was also very friendly and attentive the entire time. Food was amazing: we got mussels, scallops and fish and chips along with some oysters and shrimp. Busboys were also great and constantly filling our waters and clearing dishes quickly. Would highly recommend!", "pics": null}}, {"review": {"des": "4.5 stars! Very good, but pricey. Whenever your server recommends picking four to five dishes to share, you know your meal's gonna add up. Add a few drinks along with that.. but hey, anything goes when you're on vacation. <br><br>We followed her advice and ordered:<br>+ Tai Snapper Crudo ($16) - Shawn C.'s favorite, our server recommended this one over the Hamachi Crudo<br><br>+ Shrimp Bruschetta ($11) - loved the pistachios on this<br><br>+ Clam Chowder ($11) - served in a cute little jar! House-made oyster crackers were very good <br><br>+ Lobster Roll (Market Price - $33 for us) - hot and buttery, super scrumptious. Mmm, it was delicioussssss!<br><br>The super nice service was the cherry on top to an amazing meal. Shawn C. got a complimentary beer from the bartender because it was a new keg and the beer was slow to come out or something..? What? Also, I forgot my purse and our server ran out to give it to me, heh. <br><br>Didn't order any oysters since we wanted to come back for half-off oysters during happy hour (M-F 3-6pm) but ended up not having a chance to. Seems like a sweet deal though!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TLndiY7S8An1HPaYLbbE1w/348s.jpg", "caption": "Maine Lobster Roll (M.P - $33) - with fried onions and pickled vegetables"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ty0--rIiYAvJRssHZxfwmQ/168s.jpg", "caption": "Clam chowder ($11)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/P3_oOZRsmBsxDfBsIBblLg/168s.jpg", "caption": "Shrimp bruschetta ($11) - avocado, toaster pistachio, grapefruit, cilantro"}]}}, {"review": {"des": "Green tea soba noodles  it was refreshing and a great choice on a hot day. The oysters were excellent, I prefer a dab of lemon on mine without any salt or sauce. I ordered the Eggplant and the dish was amazing, I'm not sure how the chef pieced it together but all the flavors were stupendous! I will be back to visit again soon. PS Cat Pajamas drink is refreshing!", "pics": null}}, {"review": {"des": "Came during Restaurant Week with a great fellow food adventurer. The oysters, at that price level, had better be good, and indeed they were passable. The right amount of brininess. <br><br>But the clam chowder was a waste of money and an insult to the concept of clam chowder (it was generous of the chef to throw in an occasional clam to gesture towards the possibility that clams could be fun in the chowder). Don't waste your time with the duck confit either. The portion was tiny and the overwhelming taste was potatoes, not duck.", "pics": null}}, {"review": {"des": "Here for Restaurant Show and made reservations for GT.  Oysters were fresh and a wide selection.  We were a group of ten and ordered shareable items all night. Food was exceptional as was the service.  What a great night and start to our weekend.", "pics": null}}, {"review": {"des": "This spot was surprisingly not packed on a Saturday for brunch/lunch. Really liked the lobster roll and the variety of oysters. Good choice for oysters and a drink.", "pics": null}}, {"review": {"des": "Restaurant week is way too simple, we order a bottle of wine and some oysters, but could make you full after three course, the salad I got from lunch menu the head is dry up.", "pics": null}}, {"review": {"des": "GT Fish is a great place to come for any occasion! I came here on a Friday night and was impressed with their food! <br><br>I first started out with a cocktail! I had the Waitlist!  This is more of a refreshing drink that pairs nicely with oysters. <br><br>As for food this is what I tired: <br>1. Oysters- they were good but nothing special! Just good old oysters <br><br>2. GT \" Deviled Egg\"- This is a MUST! This appetizer is ambrosial! You won't be disappointed<br><br>3. Ceviche- amazing! Wish their portions were bigger for this appetizer <br><br>4. Branzino- highly recommend! Different types of flavors going on here!<br><br>5. Lastly.. tried their gnocchi! I think this might have been a special they had! Glad I was able to get it! One of my favorite dishes next to the deviled egg!<br><br>Great place, cool ambiance!", "pics": null}}, {"review": {"des": "A great seafood culinary experience in Chicago.  Fresh seafood tapas style with some fusion twists.<br><br>The restaurant is very modern and upbeat environment.   We arrived 30 minutes before our reservation in order to grab a drink and some oyster appetizers before dinner.   The service staff at the bar area is surprisingly attentive.  When I went to the bartender for a drink she told me she would bring waters to our high top and take our drink order there.  Within minutes a separate staff member asked if we would like to order drinks. Well done managing the bar area.<br><br>Waitress at our table was very familiar with the menu and was able to provide good recommendations.  It's great the dishes are smaller portion tapas style as it allowed us to try more.  Started with oysters, very fresh and carried good flavor.  There is a good mix of East and west coast options.  Next we got the coconut ceviche.  Initially was surprised there was the traditional ceviche sour taste, but the coconut and spicy pepper slices grow on you.  Star of the meal may have been the clam chowder.  The restaurant split the portion between us - and it was the perfect amount.  Bursting with flavor, not too salty, and tons of clam -- oh and it comes with a bonus of home made oyster crackers.  Highly recommend this dish.  Next we moved on the the clam linguine with the homemade noodles.  It was very very good and not too large - you could tell the noodles were homemade.  We also ordered the grilled octopus with the Korean BBQ sauce.  This was a very good fusion spin on the traditional grilled octopus - the sauce goes surprisingly well with the octopus.  Wish there was more of the crispy tentacles, but it was still very good.  Ended the meal with the mussels with the tomato sauce- this is one of the best mussels I have had.  Large plump and fresh - and the tomato sauce is just right.  The crispy bread in top was perfect for dipping in the sauce.  Definitely my favorite dish here.  It was a seafood feast.<br><br>Recommend this restaurant for anyone in chitown looking for a good seafood joint.  The seafood is fresh, dishes are cooked well, and environment is nice.  Will definitely be back in the future.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9MqF_tT0xRw99AeamFGtnw/348s.jpg", "caption": "Cool boomerang table at the bar entrance"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7df4XkvaulcMnqTwW9KsmA/168s.jpg", "caption": "Mussels with tomato sauce.  Favorite dish here."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TWas8ShUjOLsTuPX5KJr8A/168s.jpg", "caption": "Grilled octopus with Korean BBQ sauce.  Surprisingly good combination."}]}}, {"review": {"des": "Tried for brunch. The bright, glass walled dining room is a good venue for brunch.<br><br>Duck chilaquiles were a tasty twist on this Mexican standard. The tortilla strips were appropriately al dente rather than being soggy or too crisp. A perfectly cooked sunny side up egg added some creaminess.<br><br>Bagles and lox was very good. Nice, smoky lox, and a healthy layer of chived cream cheese. Pro tip: order a side of bacon and add it for a special treat.<br><br>There is a limited cocktail menu and some nice wines by the glass.<br><br>Service was friendly and efficient.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BFgJjLzcHyRuNWii24Nxfg/348s.jpg", "caption": "Chilequiles"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WDqV5j7bhuMBkxYIKgdyfA/168s.jpg", "caption": "Bagels and lox"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Y9-fJxAOfdXWQ6E8IVYFKQ/168s.jpg", "caption": "Entrance"}]}}, {"review": {"des": "Southern inspired modern American brunch (shrimp and grits, chicken and waffles, oyster pizza boy). It wasn't the most memorable meal, but I'd eat the fried chicken and waffles again. My sister loves oysters and thought these ones were great. Ambiance is elegant and posh. Nice place for upscale brunch.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lFEw0n2yOBV6x1BPDMPtqg/348s.jpg", "caption": "Chilaquiles. Husband loved"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DSauxYQEdjYsSjqIlIE0Ug/168s.jpg", "caption": "Chicken and waffles"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/J0XrLX9Won3VqkXJ7vwPhQ/168s.jpg", "caption": "Soft shell crab sandwich"}]}}, {"review": {"des": "-Sophisticated nautical-chic atmosphere.<br>-Hostess gave a little bit of a smug attitude at first, but turned out to be very nice.<br>-Bartender was very efficient and friendly--she was happy to give me some tastes of wine and some recommendations on the menu.<br>-Our waitress was pleasant and competent, but honestly a little overly formal.  It sometimes felt more like we were talking to a machine instead of a person.<br>-Their riff on deviled eggs was interesting--not quite deviled eggs, but fun--served in the eggshells with a smoked salmon mousse and salmon roe on top.  They were beautiful and very tasty.<br>-Oysters were fresh and delicious.  They did a great job of describing their profiles.  We got an east and west coast grouping.  They were very different, but both nice and tender with the right ocean brininess.  They were served with a great homemade mignonette sauce and the GT proprietary hot sauces.<br>-The smoked fish platter wasn't exactly what I was expecting--I was thinking it would be more like fish salads.  But it was actually more sophisticated--with small portions of smoked trout, smoked salmon and a really unusual and surprisingly enjoyable eel terrine.  They were served with fantastic herb crime fraiche, avocado mustard and thin crisp crostini.<br>-Lobster roll was excellent--warm buttery roll, generous amounts of lobster meat, not too much mayo--exactly what we wanted.  The fried onions it came with were addictive.<br>-Carrot cake dessert was decent--but the real star was the coconut ice cream that came with it.<br>-Pricing was honestly high for what we got.  A glass of Sancerre $15, New Zealand Sauv Blanc $14, \"MP\" on the lobster roll which is always kind of annoying--wholesale lobster isn't that expensive anymore, they should be able to give you a fixed price.  But we were willing to pay it, and we were satisfied with our meal.", "pics": null}}, {"review": {"des": "First time here. We had reservations but it was crowded so we sat at the bar and started ordering.  It is a very popular place. We ordered the deviled eggs. Unique and tasty. Poke was plain but amazing. A hint of sesame oil and Mango. When we were seated we had the best crab cake ever. And Ouster sliders complimentary. OUR waiters Jerrod was smart and personable. Told us about the chief and other fun facts. The homemade pasta and claims and the scallops were the best we have ever had. 5 stars.", "pics": null}}, {"review": {"des": "My favorite spot for awesome seasonal oysters when I'm downtown visiting.  The servers are great and attentive.  Menu selection and quality of the food keeps me coming back.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OHiEQJcCVPCbI8-tFQAvGw/168s.jpg", "caption": "Hamachi Crudo and Tuna Poke, nice combo to enjoy."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0FF6u8Uxu63MlA4okTw_uQ/168s.jpg", "caption": "Tuna Poke... They even have chopsticks if you ask."}]}}, {"review": {"des": "I ordered Washington state oysters and clams from Virginia. The oysters were so good, fresh and cold. The clams were not as fresh, they weren't bad, but you could tell it had been probably a week or more since they were harvested. I also had the snapper ceviche and it lacked flavor. It was mostly radish?? (Some crunchy fruit or veggie) and avocado and very little fish, very little flavor. I'm surprised it was so expensive for what they had, but then again...a seafood restaurant in Chicago. Lol", "pics": null}}, {"review": {"des": "The fish and seafood stuff are decent (fish and chips are passable). Very expensive and high end. I had a soda which was okay, forget what was in it. Extremely overpriced- sage syrup, lime and ginger beer. Skip it!<br><br>The one really odd thing about this place was how well thought-out and good the desserts are - seriously, just go here and order the dessert and share it. I had the PB & J panna cotta, which was filled with a lot of inventive flavors - grape jelly sorbet, sour grape slices, almost caramel-y peanut butter frosting, and two layers of panna cotta, one plainer, one peanut butter. And some peanut butter cookies. Balances really well. Also there was a passion fruit creme brulee, but the fruit parts were really too strong.<br><br>Ambience is very fancy and Rich.", "pics": null}}, {"review": {"des": "We enjoy the food and the chicken waffles dish is so big that we are full stomach. Good service!And they also provide paper and crayons for kids!", "pics": null}}, {"review": {"des": "Fresh and innovative. From the fresh ouster selection to a PB & J panda cotta dessert that Instill dream about, GT Fish & Oyster is at the top of my list. Enjoy!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xkIHHMclIxRTjBMnf1fRWA/168s.jpg", "caption": "So much goodness - the PB&J was the winner!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aw9FOOnb2SEBkdly7rdAoA/168s.jpg", "caption": "GT \"Deviled Egg\""}]}}, {"review": {"des": "Chicago is not exactly known for their seafood options but this is one of the few that I would recommend.  Been here twice and really enjoyed each time.<br><br>The 2nd best chowder I remember having was here with Pike's Place Chowder being the only place better.  The smokiness of the bacon is really the biggest difference.  Add some of their hot sauce to it and you have a delicious, smokey, creamy, spicy concoction.  Really hits the spot in winter!<br><br>Lobster roll is good, not great.  They do the NE style split roll which is essential to a good lobster roll IMO.  Oyster po'boy sliders are fantastic!<br><br>This place is a little pricey which is part of the reason I wouldn't put it at 5 stars.  Otherwise not too much to complain about.", "pics": null}}, {"review": {"des": "I've been here twice and each time left with a happy belly.  The food is great and is best shared family style.", "pics": null}}, {"review": {"des": "excellent. I'm honestly shocked that this place was under my nose this whole time, yet it took me this long to finally try it! We had all of the servers suggestions, which included the little oyster sliders. Um, wow. I could've eaten 20 of those alone. Also had the lobster rolls, SO delicious. The bun on the lobster roll was insanity. Love this place!", "pics": null}}, {"review": {"des": "Went to GTFO for the first time yesterday to celebrate a birthday. <br><br>The two of us feasted on fresh and meaty crab cakes, jumbo shrimp cocktail (sauce was amazing!), soft and flavorful tuna poke, chilled fire-roasted broccoli, a massive caesar salad, perfectly cooked scallops, a few cocktails, and a rich slice of carrot cake. <br><br>The service was great. The atmosphere is what you would expect of something upscale but not overly exclusive or formal. <br><br>They even sent out a $20 gift card as a thank you for celebrating with them. Amazing!<br><br>The bill for drinks, many apps, entrees, and a shared dessert was under $140! Try matching this at any other Chicago seafood restaurant. <br><br>Also -- 1/2 off oysters after 9pm!", "pics": null}}, {"review": {"des": "Yum! I went here during restaurant week for brunch. At first when I saw the restaurant week menu I thought it was going to be way to much food, but they cut the portion sizes down, so it was perfect. I started off with the Streusel monkey bread. I actually have to say I've had better, but for some reason I think the portion size did have something to do with it not being as tasty. I think if it was bigger it may have been more moist versus crispy, but that's just my opinion.  Next we had the breakfast sandwich, which was tasty. For the third entrée I chose the Chicken and waffles. Man that chicken was seasoned good and the waffles were sweet and fluffy. I would definitely head back to try the rest of the menu. Also, note it was a cute atmosphere too! Great place for brunch!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TcnrH_y4rmQKdS7V-LOF3g/168s.jpg", "caption": "Oyster Tasting Menu $15/Person"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fVs8gzoeUCGPR5OzS8sk0w/168s.jpg", "caption": "Chicken & Waffles"}]}}]}