{"name": "gyu-kaku-japanese-bbq-chicago", "reviews": [{"review": {"des": "First time going and it really made my exhausting Monday memorable! Richard and Nathan took awesome care of us, we were so pleased! <br><br>As soon as we walked in, we were seated by Richard within 5 minutes (though they estimated 10). Nathan went through the menu for us and was very patient and kind. Richard also gave us a special deal (woot woot)!! <br><br>My favorites were the galbi chuck rib and the bistro hanger steak miso! They were very well marinated and melted in my mouthhh mmm... umami I also like some fresh veggies with my meat so we got the gyu kaku half salad and spicy addicting cucumber (not too spicy! But I'm biased bc I'm Korean) and it was just perfect. Personally loved the cucumber bc it was refreshing and tasty. But my friend devoured the salad. ‍ OH AND GET THE UMAMI SCALLION RICE if you are thinking about getting rice anyways! Might be too much flavors for some people but a glass of asahi balanced it well for me. <br><br>We topped off our tasty dinner with some s'mores and lady M matcha crepe w matcha icecream. UGH. So good............ I'll have to go again...<br><br>Shout out to Richard and Nathan once again!!! Thanks for EVERYTHING!!!", "pics": null}}, {"review": {"des": "Every year in Chicago I love to try new places, and this is an all time new favorite! I love Korean-Japanese BBQ! Being able to grill my own meat to<br>My perfection is the best. <br><br>Let's not forget this is an ALL YOU CAN EAT type BBQ in Chicago. You get what you pay for! <br><br>I had multiple types of meats from Sirloin, Stomach, Pork, Beef, ect. Each was perfectly proportioned and their house steak was amazing! Ages to perfection. <br><br>The only negative side was we were there for almost 2 hours due to the slow service, but it gave us enough time to truly enjoy the food and try other items. Then ending our meal with their Green Tea Ice Cream was awesome! <br><br>If you're in the Chicago area, I highly recommend trying this experience!", "pics": null}}, {"review": {"des": "Came here with a bunch of people for a birthday celebration.<br><br>(+) Neat upstairs bar where you can overlook diners while sipping a Sapporo.<br><br>(-) Kinda pricey unless you arrive famished and do the all you can eat option.<br><br>(-) The meat all ends up kind of tasting the same, like generic Asian marinated stuff.<br><br>(+) The seaweed salad was tasty, I guess?<br><br>(-) I don't love the concept. I had never done this sort of thing before, so I was open-minded about it, but I really don't get a lot of enjoyment from cooking the food myself. It ended up feeling like a gimmick and I don't trust myself to cook the stuff properly all the time anyway.", "pics": null}}, {"review": {"des": "tl;dr: Really good selection of meats but as with all AYCE restaurants, everything starts tasting about the same.<br><br>Gyu-Kaku is a fun place to eat, there's no denying that. However, if you are unexperienced at cooking meat (such as myself), you will probably end up eating lots of undercooked meat. While the servers try to give you tips on how to cook the meat, getting told 7 different cooking times for 7 different meats all at the same time is pretty confusing. It also doesn't help that their tabletop grill isn't consistent in how hot it stays (sometimes it feels like it's barely on, other times flames are shooting out from it). <br><br>The selection of food from the Ultimate All You Can Eat menu was also fantastic. My favorite appetizer was the Shio Negi Tofu, my favorite meat was the Beef Tongue, and my favorite dessert was the Frosty Tropical Sorbet. It was nice that they could replace the white rice in the Chashu bowl with brown rice, but apparently it comes with an undisclosed $1 surcharge. <br><br>Overall I had a wonderful experience. If I were ever to come back again, there would be no way I would order from the AYCE menu again. I found that the charm of Gyu-Kaku was cooking the food yourself, not the unlimited supply of meat.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/y41qJJLpli20JXSvfVyXFQ/348s.jpg", "caption": "Chashu Bowl with brown rice and white rice"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zyVe3DmzdB5fg8WbYeomeA/168s.jpg", "caption": "Frosty tropical sorbet: a great (and dairy-free) way to end the night"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/g4wC3Hq8QZOtPm-WcoueiQ/168s.jpg", "caption": "All of the various meats we ordered"}]}}, {"review": {"des": "Saying wow would be the biggest understatement of the year when it comes to describing the delicious food, amazing service, and perfect ambience of this restaurant.  I have been to many different types of BBQ before.  Whether it is Korean, Chinese, or Japanese BBQ there is always a unique element or flavor that sets them apart.  <br><br>It was very difficult not to get too carried away when eating here. From their delicious beef options to that fantastic chicken appetizer, everything was amazing.  The soup wasn't a big winner for us,  but the perfectly cooked dumplings made up for that by a mile.  At the very end it will be a toss up when it comes to your dessert.  The ice cream is so delicious that it ranks top notch for me.  However, it is so fun cooking s'mores that you really don't want to miss out on that either.  <br><br>All in all, next time your in Chicago, make sure you come here stat!", "pics": null}}, {"review": {"des": "I come here every year when visit Chicago.  I usually get there for late night happy hour at 9.  I'll get 6-7 meats that are on special.  The ones without marination are good. The ones with are great.  The chili chicken wings are also fantastic. Egg soup doesn't have much flavor.  I actually almost ate all of that.  It's a solid place and consistent.", "pics": null}}, {"review": {"des": "Came out for lunch with a group of diverse co-workers. I chose this place for the interactive cooking and varied food profiles.<br><br>Everyone loved it. The meat is insanely flavorful. We kept ordering to the point where 4 of us spent $300. But it was worth it. Kobe beef is a must.", "pics": null}}, {"review": {"des": "It took 40 minutes to get seated even though we had a reservation. But the staff was friendly and there was enough seating downstairs and upstairs in the bar. So prepare to grab a good strong drink while you wait. Don't worry the good service even though it's busy they will find you anywhere and even text you when the table is ready. We tried the Gyu-Kaku $70 which was plenty for 3 people. Plus garlic rice. Everything was soooo good and it is so fun when you can cook it yourself. We also got a Small saki (which is not small! It comes in 2 small bottles!) and Sapporo for some fun saki bombs to commemorate the experience ha. We had a great time. The food was good and filling and the check in edamame was awesome too! Plus it came with s'mores!!!! We got to cook ourselves! Ha Definitely plan to return!", "pics": null}}, {"review": {"des": "Delicious food and quick service. The waitress is very knowledgeable, she recommended a better meal for 2 people and I'm glad she did ! I was gonna get the ACYE thinking I can eat it because I was so hungry. However, the 70$ deal for 2 people was more than enough and got both of us so full and happy.<br>My only suggestion is to call to reserve a table before you come. I'm glad I did because it was so crowded when we arrive, luckily we got seated right away, but people who just do walk in didnt have to that much luck.", "pics": null}}, {"review": {"des": "What a fun experience!!! I went with a girlfriend who I had not seen in awhile and we had an absolute blast. We made a reservation in advance (which I totally suggest and sat about 10 min. after we arrived). We went upstairs to grab a drink before dinner and the hostess came upstairs when our table was ready.  <br><br>After we had sat, the waitress explained how everything worked and made her suggestions. Instead of doing the \"package,\" we opted to select a couple meats. We thought this was a better bang for our buck. We had no interested in salads, appetizers or soups. We just wanted the veggies/meats to cook! <br><br>The food was great, the service was great and between the two of us, we only spent $80! It was a great experience and I'd love to go back.", "pics": null}}, {"review": {"des": "Came here with my roommates because we were craving meat one day. Of course we opted for the Premium AYCE for $39 plus tax (Thursday Night)! The price jumps to $44 Friday to Sunday.<br><br>We started off with miso soup and seaweed salad.  Their seaweed salad was amazing - probably one of our favorites! For the meat, we tried pretty much all of them and our favorite was the kalbi and new york steak.  The veggies were also great - zucchini and corn. <br><br>Lastly we got s'mores! It was a perfect end to the meal.<br><br>The only thing I'll complain about is the grill becoming burnt and the fire migrating to one side.   However our server was mindful and replaced the grills for us often.  <br><br>Overall, great quality food. Great service. Great ambiance. Great experience!", "pics": null}}, {"review": {"des": "This is an amazing place for meat lovers. I go here every time I am trying to impress someone because the food is delicious and the atmosphere and service are always great. I have been on all three floors and the top floor is my favorite because of the leveled seating: you sit down on the \"floor\" and have space beyond the floor which is just wild for me! My favorite dishes there are the salad(!!!) and the bacon honorable mention: the miso soup. I am not a fan, but this miso soup is not only bearable but kind of... good? Also, if you have an angsty teen with you who only eats fast food, they have popcorn chicken! If you are interested to see what the food looks like check out my YouTube sneak peek of the place <a href=\"/redir?url=https%3A%2F%2Fyoutu.be%2FjmyFeJQ4WpM&s=b56fe2419a32f5d110322fd9f5b1ba961193e76b9218cf098d96edc3d906a0bd\" target=\"_blank\" rel=\"nofollow\">youtu.be/jmyFeJQ4WpM</a> .<br>These photos are from 3 different times I've been there. Always excellent!", "pics": null}}, {"review": {"des": "That was a fun experience, even if I did it alone while on a work trip. <br><br>Don't get me wrong...I love traveling with colleagues and using group consensus to pick where you eat and drink. Today, I finagled a lone dinner and knew exactly what I was going to do. <br><br>Japanese barbecue. <br><br>I am a huge fan of Japanese culture, so I follow a bunch of Japanese-related you tubers including Simon and Martina of Eat Your Kimchi/Eat Your Sushi fame. Eating is a good bit of what the do and yakiniku, or Japanese bbq, is on their list. I must save up and make the trek to Japan soon. But...since I can't, I have to find the opportunity when I can. <br><br>On a recent trip to Chicago, I scoured the area close to my hotel and found Gyu-Kaku. It's a pretty large space, two stories and maybe even more judging by the size of the place. <br><br>When I walked in, I was greeted with the 'just one' comment...yep, just me. No reservation. Don't know why not having a reservation mattered except maybe to check names off a list. Anyway,  the place had a light crowd and it was a Monday night, so I wasn't expecting it to be overwhelmingly busy. I was correct. While there was a decent crowd, there were plenty of tables. So lesson learned, don't worry about a reservation early in the week. <br><br>For drinks I picked sake. For dinner, I ordered the mixed veggies, garlic shrimp, prime kalbi short rib and Yaki kalbi beef. To be honest, the yaki kalbi beef had the best flavor and it was the cheapest. I also liked the veggies but it was weird that it came with corn. It should have been on the cob at least. Don't get that at all except I know corn is in a fair amount of Japanese cuisine <br><br>This gets four stars for the experience. The server was good but he got my drink order wrong. I want to go back sometime and try some additions; options. Good interactive dining experience...food was good, not great.", "pics": null}}, {"review": {"des": "This is a really fun place to go on a date or with a group of friend. We've been here for a few date nights. The way it works is that you order a variety of meats/seafood and veggies from the menu. They bring you the items raw and you cook them on the grill. They give you instructions on how long to cook what and where best to put it on the grill. It's very easy. They have to many items so it's unlikely you can't find something you like. They also have pregrouped options so you don't have to pick you're meats/veggies one by one. They have them grouped together by number of people and by price. I think this is the best value and option, especially if you're a first timer. <br><br>They also have items that you don't have to cook on the grill. My absolute favorite item here is the Sukiyaki Bibimbap. It's seasoned rice, veggies and steak cooked in a stone bowl. They bring it out and ask you how spicy you'd like it or if you want kimchi in it. Then they mix it up and flatten it against the bowl. Because the bowl is still hot the rice touching the bowl gets crispy. It's AMAZING!<br><br>Definitely recommend checking out! Just fyi - they have a great happy hour and a rewards system that gets you $10 off your first purchase of $30 or more.", "pics": null}}, {"review": {"des": "Love this place! COME HUNGRY!<br><br>My boyfriend and I stumbled across this place on a Tuesday evening! We did not have a reservation but we were seated immediately. <br><br>We ordered the \"Geisha\" it is a meal recommended for two people. The price is $60 but it was a great deal and well worth it! You get 3 appetizers (including 2 rice), 6 different meats, and your choice of dessert. All of the appetizers were great but my favorite was the salad. The dressing on the salad was amazing! Also, I ordered an additional bowl of rice because I anticipated a small bowl, boy was I wrong. They are very generous with their rice! I had to take the extra rice home!<br><br>Little by little our meats start coming out. Each meat was flavored to perfection. The table has 3 sauces to choose from just in case you want to give your meats a bit more flavor. My favorite sauce was the \"Spicy\".<br><br>With the \"Geisha\" package you also get a dessert. We chose the green tea and vanilla ice cream. The ice cream was ok, nothing special! However, I like the fact that they actually give you a large bowl of ice cream and not just a spoonful. Although, by the time you get to the ice cream you will probably be full. <br><br>In addition, we ordered the \"Spicy Tuna Volcano\" as an appetizer because we did not know what to expect as far as portion sizes. The Spicy Tuna was okay we probably would not order it ever again though just because the Geisha package has the perfect amount of food! We even had leftovers to take home and pack a lunch!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/McAO7y6t9BYvAQWz4yJS9Q/348s.jpg", "caption": "Fried Shrimp Dumplings  Appetizer with the Geisha Deal"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mG_CaLBiLVHydouECx6_QQ/168s.jpg", "caption": "Awesome appetizer salad from the Geisha deal"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/d59eGkgMGgn1f5xZcFDiTA/168s.jpg", "caption": "Meat #6 from the Geisha deal"}]}}, {"review": {"des": "First I want to warn you to please make reservations! If you don't you might be left out in the cold ( trust me that is not good during wintertime Chi lol). That being said, it is worth the wait. I went here for a date and we got one of the package meals that had a few courses. We basically got to try a lot. Chicken, beef, steak, veggies...we had it all. I really like that you are making your own food at the table. Very similar to fondue concept but obviously very different in execution lol. We also ordered drinks. The drinks were good and very pretty but were not as strong as I like. I had 2 and didn't feel a tiny but \"relaxed.\" Go for the food skip the drinks.", "pics": null}}, {"review": {"des": "My friends and I usually come here during the week to get the all you can eat special. There are three different price points for the all you can eat deals: Supreme ($59/person), Ultimate ($49/person), and Premium ($39/person). We get the Premium deal because you can still choose from about 14 different meats and a few other sides and desserts. If we want something like a bibimbap (not on the Premium menu) one of us will usually have enough points on the Gyu Kaku app to redeem an item. I recommend downloading the app because it'll enable you to collect points via your receipt and get free dishes for the future!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/DCW9dKf7auTBJBsBarAZvA/168s.jpg", "caption": "S'mores"}]}}, {"review": {"des": "I went to this restaurant on my trip to Chicago and searched for some hibachi style restaurants without luck. This one popped up on my search.<br><br>We had Gyu-Kaku bbq course. I have to say, all the meat is very soft and taste awesome. No smoke in the house. All are done in perfect note. Customer service is awesome as well.<br><br>Note that you may want to call for reservation if it's on Friday to Sunday; otherwise, you may have to wait for 2 hrs.", "pics": null}}, {"review": {"des": "Yum yum yum! Make sure to come hungry because there is a lot of food and it's all so tasty! The gyu-kaku is a great refreshing start to your meal. I love the dressing and it's included in most of the pre fixe meals. I also love as appetizers the volcano tuna and the hot oil salmon. The volcano is spicy tuna on top a fried battered glob of rice. It's so good! The salmon is sashimi style. <br><br>The bibimbop is excellent but can be filling and I would not recommend it if it's your first time because you really want to save room for the bbq! For beef, some of the tastiest to me (flavorful but not salty) are the premium beef toro, the premium kalbi, the regular beef toro and the garlic rib eye. For the other meats, definitely do the pork belly and the duck. For seafood, it's all actually very good. <br><br>Dessert is good but nothing special. I would fill up on the meats!", "pics": null}}, {"review": {"des": "Typical hot spot in a busy city... <br><br>Waited for 45-60 minutes for our table but was able to hand out at the bar for some drinks and light eats. Bar tab $60 plus tips. <br><br>We follow the young lady to be seated, and proceeded to go through the usual steps. 10-15 minutes later our first round of food came. Every we tried was very good, very fresh, but that's not saying much as pretty much all these types of BBQ places are pretty much on par as far as quality of their meats and sides go. In other words, to be successful and stick around in this niche market, you gotta know what you're doing and offer not just quality food but quality service. This place of course nails both, easily. <br><br>When all is said and done, it was a $400ish bill for 4 people (not including bar tab). But we felt it was worth every penny and even more worth it if you're a big eater as we got the all you can eat deal. <br><br>Will return if I'm ever in the area as I also feel it's a great place to take friends and/or family as it's really hard to go wrong here unless one of you don't eat meat.", "pics": null}}, {"review": {"des": "I have to update this review because of an incident that's happened both times I've gone here. <br>I went again here with some friends and had a reservation . I wasn't seated until 30-40 minutes after my reservation which is crazy. This happened last time to me as well when I had to wait 10-15 minutes after my reservation time. That wasn't as bad because I know they're busy, but almost 40 minutes is ridiculous.<br><br>I got there at the reservation time, by one of my friends wasn't there yet so the host told me to let him know when everyone arrives. No problem. 5 minutes later, I let him know and he told me it would be 10-15 minutes, which is annoying but no big deal. <br><br>Finally I went up after waiting almost 25 minutes and he said he was waiting for some table to leave. Why have a reservation then? Did he give my table to someone else? <br>After waiting another 10 minutes I finally got aggressive and told him it had been almost 40 minutes. The host seemed surprised and seated me right away. So I'm not sure what was going on. <br><br>I noticed the young man that they have hosting all the time isn't very efficient.<br>It's almost like he forgets what people are waiting and when you go up to him and remind him, he seats you right away. That happened to me the first time with the exact same host the first time I went too.<br><br>They need to train that host better, or replace him. It honestly ruins your experience to wait that long with a reservation. He's also super rude.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/MsZWD7mWUIHy-97TITNH6Q/348s.jpg", "caption": "Strawberry and green tea mochi"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jOzMjQPL5qXN3odtYNl2hA/168s.jpg", "caption": "Beef bibimpap"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AjAwsRxAurSSMkSxdAE4xg/168s.jpg", "caption": "Beef cuts"}]}}, {"review": {"des": "Childhood memories were met tonight. Growing up in Japan, my family and I would always go to gyu Kaku for yakiniku. <br><br>The meat, as always, was tender. The sides are super yummy. We went with the Samurai option, which feeds 2 people a huge serving of food. I left satisfied. <br><br>Also the service was great. Highly recommend making reservations if you're looking to eat here!", "pics": null}}, {"review": {"des": "Place is solid. I eat Korean BBQ a good amount in NYC. I can't tell you the different really between Japanese and Korean bbq but it was similar to me. We got some meat combination I forget the name but it was some wonderful things. Waitress was super nice and the place was lively<br>Reservation is a must if you want to go on a weekend and probably wouldn't be a bad idea on a weekday", "pics": null}}, {"review": {"des": "How cool! The grill is in the middle of your table and in between rounds they'll swing by and switch your grate for a clean one if there are a lot of food particles burned on. <br><br>Also, definitely check in here so you can the free plate of edamame! <br><br>Definitely recommend doing the full meal, set price per person. They bring you an app, salad, and ~6 meats to grill. We did the Geisha ($30/person). The filet mignon was so tender and everything was flavored well so it barely needed one of their three sauces available (spicy, soy, and a teriyaki-tasting one). The dumplings were terrific for our app. That plus the edamame and miso soup made for a great start to the meal. The reason we went with the Geisha menu (least expensive) is because the next level up had chicken and shrimp in its meat selection. The Geisha had 6 tender red meats. About half were marinated, one seasoned, and the other two plain. We got one that was like prosciutto (deliciously marbled) and it was soooooo good.<br><br>Everything about this place was great. My only complaint is my drink seemed to disappear quicker than i would have liked.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dtxdeXqzvCAv9EOqN_oxVA/168s.jpg", "caption": "Yakiniku has the Magic to make people happy"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0YB5_MWEP-5BHBpGTuJqyA/168s.jpg", "caption": "About half of the spread for the Geisha. 3 other meats came out as we finished a plate."}]}}, {"review": {"des": "The place is small, but there isn't a lot of waiting if your whole party is there. We took the $45 eat-all-you-want option. Honestly, it was a bit much much for us, but my friends badly wanted to eat the Wagyu beef, which is only included in the $45 option. Anyway, I am not a beef-connoisseur so I couldn't really tell the nuanced difference, sure it was a bit different but I can't explain how. The egg drop soup, fried calamari were pretty good. In the meat section, I like the Filet mignon, bone-in kalbi short rib, yaki shobu beef and spicy pork. Don't forget to order sweet onions and spinach garlic in vegetables.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3rdErdhn58NMsj4npOqHUQ/348s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Food: 4<br>Service: 5<br>Cleanliness: 3.5<br><br>Make a reservation ahead of time if you plan to dine over the weekend, especially if you have a large party.<br><br>If you've never been, I would recommend trying their lunch special deal first to see if Japanese BBQ is your thing. They've got great lunch special and happy hour deals. <br><br>Definitely get the Hirami Skirt Steak and Spicy Tuna Volcano, the best! Hirami steak is tender, sweet, and got that BBQ flare and the spicy tuna is perfectly crisp with a hint of spice. All in all, one could say they all taste the same in the end no matter the marinade... But you cook to your liking so you can customize with the sides of dipping sauces they offer.<br><br>Only one iffy thing is their BBQ top (for some tables I've sat at), does not get heated evenly so one side may cook much faster then the other so keep an eye out! The service is great and attentive so it all works out and they'll replace the grills whenever you need to.<br><br>Worth it: Yes, go during lunch or Happy out and beat the crowds.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qOnaNs6_hZHwKggmNGwOGQ/348s.jpg", "caption": "Miso in Love (3 meat set): $23.50 save .50"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/O6SLFy-iWjDfftkibJNo6Q/168s.jpg", "caption": "Chicken Garlic Noodles now in stone pot: 5/5"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pvSiMZ67PJuKOV8aglBkag/168s.jpg", "caption": "Volcano: 5/5"}]}}, {"review": {"des": "WOWWWWWW!!!<br><br>I have never had Korean bbq in my life and wanted this to be my first place. I can't begin to tell you how amazing everything was seasoned. You cool everything yourself so tenderness and such is all up to you, but seasoning makes everything whole. <br><br>The staff was super nice and explained everything you needed to do to achieve success at your table. My friends and I had an amazing dinner. <br><br>We ordered based on their menu recommendations and it was MORE than enough.<br><br>Two thumbs up, three if I had three.", "pics": null}}, {"review": {"des": "I've been to the NYC (Times Square location) twice and this Chicago location did not disappoint.  The house sake is delicious and such a good value.  All of the meats, vegetables and sides are fresh and flavorful without being greasy or filling.   I love this concept and think that this chain executes it very well.", "pics": null}}, {"review": {"des": "Came here many times and enjoyed all my experiences here. The most recent one was enhanced by the services of Richard and Nathan!!! They went through the menu with me and my friend. So far, Ohio location has been my favorite.", "pics": null}}, {"review": {"des": "Overpriced with subpar hospitality. I'll start by saying that my waitress was great, and I'm not referring to her. I made a reservation a couple of days in advance because I hear it gets crazy here. When I get to the restaurant, the host tells me that the system canceled my reservation and that there's nothing he could do about it. What's the point of me making a reservation at that point? <br><br>The subsequent wait takes about 30 minutes where I'm surprised to see how expensive all the meats are. Definitely more expensive than it is in California. I order my go-to item of Toro Beef, which is honestly the best thing there. It's like bacon, but beef, which makes it better to me, and it's quite inexpensive. <br><br>Our water comes first, and unfortunately, there's a fairly large stain on my cup due to insufficient dishwashing I presume. After that our toro beef arrives, which was good as always, but instead of plating our five order nicely, they just dump a heap of meat on a place.<br><br>It's ok, but it's also overpriced, so unfortunately, I have to say that gyukaku is not worth it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/y6qRC2GWqqmD4id22s89Lw/348s.jpg", "caption": "5 orders of Toro Beef"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/m9Dwpj679hLlc0T11gAwHA/168s.jpg", "caption": "Sizzle sizzle"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YXKgrtGQhImBSfcmrCV_wA/168s.jpg", "caption": "Stain on my cup :("}]}}, {"review": {"des": "I was a big fan of Gyu-Kaku when I lived in Boston and was happy to find a location a few blocks from me in Chicago as well! <br><br>We got the Japanese fried chicken which was on their \"must-try\" list and it did not disappoint. We got 6 different beefs to grill (prime kalbi short rib, prime garlic shout steak, kalbi chuck rib, angus beef ribs, yaki-shabu beef, and the love style toro beef), the mushroom medley and zucchini. They were all very good! I usually only get beef because you really cannot go wrong with that. I don't have a favorite as they were all delicious but my least favorite was angus beef ribs- they were a little tough to chew. <br><br>I always get the Lady M Green Tea cake when I'm here as there are not that many Lady M locations. I usually ask for vanilla ice cream instead of the green tea ice cream that they normally serve with the cake (I'm not a big fan of their green tea ice cream- it's surprisingly bitter to me). <br><br>I always have a great experience at Gyu-Kaku and will very obviously be back!", "pics": null}}, {"review": {"des": "I've been to this place twice now and I always seem to forget to rate it...<br><br>The service the first time was rather slow but we did have a larger group of people, as compared to the second time it was just two of us and it went much smoother.<br><br>The meat is always delicious and perfectly marinated and reasonably priced! I haven't tried the all you can eat here but I am sure it's worth the bang for the buck if you eat that much! I will say though that the alcoholic beverages although they are not pricy they are also not that strong, but I can't ding a star for that.<br><br>I also will say the lady M crepe cake was amazing and that's something that I haven't had outside of New York or L.A! <br><br>If you're looking for some amazing bbq food I suggest this place hands down!", "pics": null}}, {"review": {"des": "I forgot how great this place is. For the price, you get some delicious meat. Came here on a Tuesday with reservations for 7. Got seated and ordered the meat lovers (for 6) plus some extra salad and soup for our extra person. The others ordered drinks, and they had a solid list of Japanese whisky, sake cocktails, sake, and beers. The salad was great (good dressing), miso soup watery but ok, but the star of the show was the meat. I don't even remember all the meats we got, but I can remember that the beef ones were particularly great. Shrimp was pretty good, but chicken was just ok. Pork was pretty good too. Basically, the fatty juicy pieces were seasoned and marinated perfectly and melted on our tabletop grill to perfection. Yum! We were basically all super full after that and aret our s'mores happily. What a fun group dinner! Would highly recommend this place for a fun night out or even a bonding night with coworkers.<br><br>Service is slow because the servers are overworked, what with the millions of dishes, switching grill grates, drinks, etc. so I don't blame them for forgetting things here and there. Definitely a place you'll spend at least two hours at n", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JRkXIj45brJ8lf0bLh_L6g/168s.jpg", "caption": "S'mores"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ffm4VchbFHN5shBPfKGFSA/168s.jpg", "caption": "Grilling"}]}}, {"review": {"des": "Love this place. Very packed and lines are long. Lots of choices. Love the fact they have some Korean/Japanese fusion side dishes. Meat quality for an AYCE is fairly good. There is a time limit to how long you can eat so try not to eat too slowly. If I can't find a Korean bbq restaurant this is def my 2nd choice.", "pics": null}}, {"review": {"des": "My brother and I found this place wandering around downtown. We happened to come in during happy hour. <br><br>We started off ordering the blue fish bowl to drink. That was really tasty and pretty strong. When you check in, you get an edamame. The edamame was good and salted with sea salt. <br><br>For happy hour, a good portion of the menu is discounted and the price is designated in red. We ordered the tuna poke, the filet mignon, garlic shrimp, mushroom medley, and the beef bibim bap. The tuna poke came on a small bed of seaweed salad, which was really good, but it also came with a ton of raw onions which were not pleasant to eat at all. The tuna itself was really fresh and tasted great. The bibim bap is mixed for you by the person that brings the foos out since the bowl is extremely hot. They ask you how spicy you would like your bowl and they add the sauce in for you as well. You can request that they leave you extra sauce in a side bowl if you want more. The bibim bap was really good. It had different veggies and thinly sliced beef in it. I would definitely order this again. <br><br>We cooked the filet, shrimp, and mushrooms ourselves on the grilled at the table. They obviously were cooked the way we wanted it. They have 3 different bottles of sauces at the table that you can use for dipping. They have a ponzu, sweet soy, and an orange colored suace. The orange colored sauce was phenomenal. I put it on everything. <br><br>The one thing I have to complain about, and I hardly ever comment on the actual restaurants itself, is the bathroom. I went it to the bathroom and one stall was grossly( to the point of almost overflowing) clogged and the other was out of toilet paper so I went to let someone know. After dinner, I had to use the bathroom again and nothing had been fixed. That is disgusting. I don't care how busy your restaurant is, this should be handled promptly.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pBvHZMDeQT_kfV_L-XiBLg/348s.jpg", "caption": "Comes with your bill to clean your hands"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/a4VXf6XACpF79XD_t4OLWQ/168s.jpg", "caption": "After being mixed for us"}]}}, {"review": {"des": "What a fantastic place. Went with a group of 5 and we had a great meal. We ordered the Shogun special (which feeds 6). Comes with a large array of different meats, vegetables, miso soup, and salads. You cook all the food yourself on a small grill in the middle of the table. This was my second time here and have always had a great time. Highly recommended!!", "pics": null}}, {"review": {"des": "We love it here. It's an easy choice as I'm familiar with their other locations in California. Cool vibes. Delicious KBBQ. More \"Americanized\" flavors in my opinion with the perfect element to introduce Korean flavors. Fantastic Fusion of Flavors. My go-to's are the stone pot rice dishes (sweeter one is the bulgogi version) and any of the marinated beef varieties. Amazing cocktails, too. Can't go wrong with their savory Korean BBQ. Dining with friends and family make it an ideal social setting to cook and converse.", "pics": null}}, {"review": {"des": "This place was a good one time experience but even with happy hour it wasn't a very good deal. The portions of the meat and even vegetable are very small so even after spending over $25 per person with no drinks (which would get you AYCE at other places) you may still be hungry. Also the place was kinda dirty. There were dust bunnies and/or spider webs floating off the walls. They seem to be offering discounts through their apps for returning customers so maybe it's worth it if you do that. They're definitely not lacking business even on a week night (there was a slight wait). Gotta say that everyone working there was courteous and nice.", "pics": null}}, {"review": {"des": "Food was great.  Came from out of town for the weekend for a Bears game and stumbled upon Gyu-Kaku.  Enjoyed a happy hour and sampled the bibimbap, garlic noodles, tuna poke nachos, and chili shrimp shumai.  All were great.  Only negative was the hostess, who was not helpful at all.  Such a shame.", "pics": null}}, {"review": {"des": "This was my first time eating at a Japanese bbq place, and the biggest difference between this and kbbq is that the meat is not marinaded and you instead have dipping sauces. Personally, I like kbbq better, since you get all the accompanying banchan which makes for a well rounded meal. <br><br>My favorite part of my experience at Gyu-Kaku were the chili shrimp dumplings we got at the bar while waiting to be seated! Those were bomb.<br><br>The actual dinner was good too, but very expensive. You're paying more for the quality of the meat I suppose, but I left thinking that I'm glad I tried Gyu Kaku, but I do think there are better alternatives in the area.", "pics": null}}, {"review": {"des": "I am not usually a fan of this type of restaurant but I really enjoyed my time here.  <br><br>We were seated pretty quickly, even with a last minute addition to our party, on the third floor.  I personally liked that we had to take off our shoes so that we can sit in a sort of \"submerged\" table.  <br><br>The food was great too.  Lots of different options, for both meat and seafood lovers, as well as some great side dishes.  It is rather easy to burn the meat, since its so thin, so make sure you keep an eye on it!  We also ordered some mochi for dessert and they were delicious!<br><br>Overall, the service was great and so was the food.  I would definitely come back again!", "pics": null}}, {"review": {"des": "I wish I was eating at gyu-kaku right now <br>If you're craving for bbq, tell you, this is the place to go! Every meat is so savory and tasty. Service is always top notch! OMG. This is just the best place. I wouldn't go anywhere else. Hands down.", "pics": null}}, {"review": {"des": "First time trying a Japanese bbq joint and would say our experience was amazing. We got the Happy Hour for 2 course.<br><br>The place was clean, friendly staffs, delicious food, yummy drinks. Definitely worth the money and time.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/A9meM5Y6wU-FKVgj1pdE5g/348s.jpg", "caption": "Starters"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cL6VxLt-ASwwYQuk0zCVUw/168s.jpg", "caption": "Goma Negi Shio Ramen"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jTPNowii6xyCnq9uCKbhTw/168s.jpg", "caption": "BBQ items"}]}}, {"review": {"des": "Gyu-Kaku is a busy and popular place! Being a chain of Japanese yakiniku BBQ, it is an experience similar to Korean BBQ where you will be served various meats and vegetables and have a tableside grill that you will use to cook your meats. While there are a few differences, the key is that the meats at Gyu-kaku are not marinated in advance and instead various dipping sauces are provided to you at the end. <br><br>While the place is definitely a unique one and the variety and quality of meats is good, I must say that I feel that the service could be improved. While we made a reservation and showed up on time, we were still made to wait a good 15-20 minutes before we were seated upstairs. <br><br>Additionally, when my colleague and I ordered a hot tea, it was served to us in a typical glass tumbler you would expect for cold water. The result is that the glass heats up and makes it pretty uncomfortable to drink. <br><br>While the rest of the experience was fine, small things like this make it a good establishment, but not a great one. Basically I rate it as 3 stars because I would go back, but it would not be a place I would recommend to anyone. <br><br>Bottom line, go for an experience if you're in the area and want something a bit unique. However, for a great restaurant experience for this price, Chicago has lots else to offer.", "pics": null}}, {"review": {"des": "I was visiting from out of town and stumbled into this gem! We had the happy hour BBQ and loved everything the assortment of meat and sides. The price was unbeatable! $50 for two and left very happy. The meat was marinated just right and the sides were delicious. I'm definitely going back the next time I'm in town", "pics": null}}, {"review": {"des": "The wife and I were visiting Chicago and a friend recommended this place and he wasn't wrong.  We really enjoyed the place, the staff is friendly and helpful.  <br><br>Yes I know you are paying to cook your food but that is the fun when out with friends or on a date.  The reality is you can ordered from their cooked menu as well.  We had a Garlic Rice that was outstanding.  Cooked some meat, salmon and finished off with some shrimp.<br><br>Great place you should check it out.", "pics": null}}, {"review": {"des": "I've dined here several times when I'm Chicago for business.  Came back most recently for lunch since it was so close to my hotel.<br><br>The lunch special is a pretty great deal - for $15, you can order 3 cuts of meat, with rice, miso soup and salad.  You can also add sides or upgrade cuts or the rice which I did.  <br><br>I left stuffed and satisfied, and appreciate the quick service and yummy lunch specials!", "pics": null}}, {"review": {"des": "The service that I got while I was here was beyond amazing. My boyfriend came during the in-between time where there wouldn't be a Happy Hour, so we decided to make a reservation with the hostess and come a little bit later to save more money. She had no problem doing that for us. When our table was finally ready, we received a text notification and walked right on over there. It was one of the last incredibly nice days in Chicago, so we didn't mind one bit.<br><br>When we finally got there, we were seated immediately, and upon arrival greeted with two waiters. Though, I want to assume one of them were a manager since, at the end of the meal, you'll receive a survey at the end asking if a manager ever came to the table. If that was the case, one of them never introduced themselves as such. Which was fine since they were both attentive and very helpful!<br><br>To move on, we chose the Geisha meal during Happy Hour. It was a good price for what you got, especially when comparing it to a Korean BBQ, where you don't even get dessert added to your meal in the end. I need people to know this is indeed JAPANESE bbq and not at ALL Korean BBQ. There's a slight difference and you should know if you ever dine in Korean BBQ restaurants on a regular basis.<br><br>Food wise -- this is where they lost one star from me. Some of the meats tasted very sweet ?? I guess you could say. I'm not a sweet with my meats type of girl. I like my food to be very savory, especially when it's barbecue style like this. Also, one of the meats tasted just straight up like blood or soap to me. I don't know how to describe it, but I'd definitely order another combo next time if I ever do return. Maybe The Samurai will treat us better.<br><br>My boyfriend and I also tried their calamari as an appetizer and surprisingly, it was one of the best ones we ever had! When we received our salad at the beginning of the meal, my boyfriend who is an avid vegetable hater, said that this was the best salad he's ever had and actually wanted more.<br><br>As far as the rice goes, we chose not to get the two bowls of white rice, but the Bimbimbap instead. Like I said before, it's not like a typical Korean place. I say this because Bimbimbap's usually have a sunny side up egg on top which makes the bowl of rice even more delicious. They didn't, which is fine because it's their style of food.<br><br>The service has gotten a 5/5 from me and I would definitely return just for them. As for as the food goes, it was good just not the BEST I ever had. Better places to go in Chicago.", "pics": null}}, {"review": {"des": "My cousin wanted to celebrate her birthday at Gyu-Kaku and wanted to eat boatloads of beef for dinner on a Thursday night. Our party all did the $45/person Ultimate AYCE deal (its $50 on the weekends). There is a 2 hour limit to the AYCE and also there is a limit to the quantity of high-end beef (see menu in this review). As for my other photos of raw meat, I can't remember which was which.<br><br>The great: We maxed out our high-end beef orders and they were fantastic - especially the tongue! I wish there was no limit to beef tongue. My second favorite is the fatty beef and third was kalbi. I can eat these three things the entire night away. The seaweed soup, s'mores, fried spicy tuna nigari, shrimp, chicken and cucumber salad are highly recommended as well.<br><br>The not-so-great: any meat that was a super thick cut or cubed meats because they were difficult to cook on the grill and were a bit tough to chew (filet, lamb chops, etc.). The pork belly had a strange barnyard smell to it and I didn't like the marinate either. The green tea ice cream was flat - lacked dairy and matcha flavor. <br><br>Service was very attentive! The servers checked with us frequently on what additional items we want to order, changed the grill plates several times, and alerted us of time limit nicely. They also stored the birthday cake for us and brought it out with knife, plates, utensils, and lighter.<br>I will be back for happy hours and AYCE when I feel like gorging myself again!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mdAf6WEv2bUQMczVTMIviw/168s.jpg", "caption": "Shrimp and more beef"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/CMnwYyyK4EJwfKEacJ4lDA/168s.jpg", "caption": "Lamb chop"}]}}, {"review": {"des": "Very good food but be prepared to eat a huge meal!  Most of the menu is designed around the in-table grills, similar to Korean BBQ which this is based on.  Our meal was meant for two but easily could have fed a third.  Wontons, salad, fried rice, sushi, assorted cuts of beef, marinated chicken, shrimp, fresh veggies...oh and some mochi ice cream for dessert.<br><br>Gyu-kaku is actually a pretty popular chain in Japan, and I've actually been to one in Osaka before.  The menus and atmosphere are pretty different even if the concept remains the same. Obviously this location featured more USDA Prime cuts, but in addition to the portions the flavors were also Americanized.  For example: the heavy marinades on many of the meats and the dipping sauce squirt bottles on the tables. The heavily fried rice that bordered on bibimbap was good but could have been a meal on its own. I'm sure this will make it more popular in the US but I missed the simpler, less artificial taste of the original.", "pics": null}}, {"review": {"des": "My friend has severe food allergies (to the point where her body starts to flare up due to her rare autoimmune disorder).  Long story short: food was incorrectly prepared and my friend started getting a reaction like she normally does.. it was my firsthand experience seeing a friend who's dealt with this condition for a very long time.  I mean, my friend (who's a girl), can't even eat chocolate without even getting a severe reaction; how horrible is that?!  Anyways, the manager that evening, RICHARD, was phenomenal.  He took care of us that evening.  What could have ended in a disaster, did not due to his amazing customer service skills and training in food allergies.  A big thank you, Richard. I will definitely be coming back again.", "pics": null}}, {"review": {"des": "I think I'll just start off by saying I love this place. This was my first time here but everything about it was pretty amazing.  <br><br>First, I got the all you can eat premium option. It was two hours of all you could eat meat, sides, and vegetables. The servers were fantastic about coming and checking on the table and making sure we really got the full value out of what we had ordered. They were great about constant refilling waters, replacing the grill, and providing tips and suggestions on cook time.<br><br>Second, I think places you cook for yourself are fun, adds a different element to eating, and really adds to the social aspect of food which we don't have as often in the daily rush to be productive. Because you are forced to cook your food at the table you're also forced to have more interactions with who you're with and be forced to be present to make sure you don't over cook your food. This makes eating an experience and gives you a pause from life outside of the restaurant doors.<br><br>Third, the atmosphere was great! It was definitely crowded but it never felt elbow to elbow. The smell of all the cooking food was just a constant presence in the air, which I loved. And everyone there generally just seemed happy - from the customers down to the bussers.", "pics": null}}, {"review": {"des": "Our first time dining here and it was a group of 5. Our server Beth was fantastic. We did the premium buffet $50/pp and also ordered a plate of the Wagyu beef to share. That was delicious. Highly recommend the Wagyu beef which is not part of the buffet and it's a premium price $50 a plate for about 8 slices but worth it in my mind. You live once right? Overall the meat was all delicious. We have a few in our party on the KETO diet and Beth recommended just salt and pepper on the meats and it was still so delicious bbq'd. The garlic rice is a must and get the garlic shrimp and garlic spinach. So good. We loved it so much we downloaded the app and expect to come back in May and we will have a party of 8. I can't wait to go back and dine here. It's perfect for a big group. So much fun too! Oh they also give you ice cream when it's your birthday!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZL8XcvPSnRryp5Fg1mrmhA/348s.jpg", "caption": "Birthday dessert"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ssvTTAELjTFCUUQGPu-Z9A/168s.jpg", "caption": "Japanese Wagyu beef"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/n0PYr76fWMTBET9jPu2iDA/168s.jpg", "caption": "Garlic rice, grilled zucchini and spicy tuna volcano"}]}}, {"review": {"des": "Amazing. As always. <br><br>They accommodated our big group in record time, albeit with some prodding and creative thinking on my part haha. But the food was amazing and the service was great. Our second time here and we'll certainly be going back", "pics": null}}, {"review": {"des": "This is a chain Japanese bbq restaurant so I thought it would just be okay. I was pleasantly surprised at how tasty the food was.<br><br>My friends and I came here for happy hour on a Monday night. It was a decent deal for large parties! You can order sets of meat to cook at the table. We had a party of 7 and got three 2 person sets. <br><br>The meats were pre marinated so you don't even need the sauces that much. I thought the meats were tasty, with the exception of the chicken. Nobody gets chicken at Asian bbq places! It's usually the least tasty and it cooks too slowly. As far as the other meats we had pork belly, beef, pork.... they went well with the rice. They also gave us some vegetables on the side to cook.<br><br>The edamame is decent as is the sukiyaki bibimbap.<br><br>The drinks on the happy hour menu aren't so happy hour - they're basically full price.", "pics": null}}, {"review": {"des": "I come here every couple of months when I am in town for work. The food is outstanding. If you're coming for lunch, the 3 meat lunch special will really fill you up. More importantly, it's delicious. For dinner the unlimited menu is a must. The dipping sauces are all great, the meat is tender, the garlic rice and the bi-bim-bap are on point. The service is usually pretty good and the sides are okay but I usually don't waste my time with them. Meat, rice, mouth, meat, rice, mouth, repeat until you can't breathe. You're welcome.", "pics": null}}, {"review": {"des": "Pros:<br>- Closest ok Asian BBQ to anyone who lives near River North / Streeterville<br><br>Cons:<br>- Really not classic style Asian BBQ in taste<br>- Really small portions. Each portion has like 4-6 slices. TINY<br>- And really expensive for the portion <br>- Nothing I've ever ordered here has been notable. It's all been meh to average<br>- To top it off, usually a long wait", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PAaotFbJLSazuZrjYOUjxA/348s.jpg", "caption": "Spicy Cold Tofu. SKIP! bland kimchi"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kM3j3qN3-vQkVM-msvsQRQ/168s.jpg", "caption": "Garlic Fried Rice. meh. skip"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aYGJu1Gh0Rb0rr24LS4HVQ/168s.jpg", "caption": "tongue. note the extremely small portions"}]}}, {"review": {"des": "Fun spot! We order the meat lovers package for two and that was WAY more than enough food between us. You can tell the meat is high quality and the side sauces paired very nice. For the price it was worth it. I can see there being a problem though if you don't want everything or want to swap things in the package to make it more customizable. I feel like it could get expensive if you individually bought thing a la carte. I would recommend staying with the packages.", "pics": null}}, {"review": {"des": "HOW have I never written a review for this place? It's been a favorite of mine since I moved into the neighborhood 8 years ago. <br><br>I very much enjoyed the Japanese BBQ, but I also enjoy the light bites at the second-floor bar. Hell, who am I kidding. I'm up there eating pounds of food from their happy hour menu, because it's all delicious. Friend of mine in the restaurant industry turned me on to it, and It's still a favorite.<br><br>Service can be pretty average, but with food is delectable as this, I don't even care. Just keep the beer flowing and keep my table full of meat and noodles.", "pics": null}}, {"review": {"des": "I definitely recommend coming here hungry because they give you so much food that it would be a waste to not eat all of it. I usually go with one other person and we do the Samurai that is recommended for two people for $70. It comes with miso soup, salad &4 bbq items with vegetables & also you have a choice to choose from the beef bibimbap (rice). Honestly it's my favorite part of the meal it is so good and you have an option to choose how spicy you prefer it to be. I usually do medium. They bring the rice out in a stone bowl which keeps it warm usually the duration you are seated. I always say I want to order more because it's so good but by the time I'm finished with my food I'm full.  The server brings out the dishes one by one which gives you time to enjoy each one and also get yourself ready to prepare for the meat. They also tell you how long each bbq item should be cooked on the grill to ensure it's cooked properly. It's pretty self explanatory and really easy once you get the hang of it. If you don't like to cook at home/grill make sure your partner does because your head in charge of cooking your meat lol. You also get a dessert as well. Depends on which package you chose from. I'm not a fan of their ice cream but you can't go wrong with the s'mores :). <br><br>It's usually pretty busy here so i recommend making a reservation in advance if not usually the wait is about 20-30 min which isn't too bad. There isn't free parking but usually you can find parking on Ohio right in front.", "pics": null}}, {"review": {"des": "Went during Happy Hour! (Mon-Sun: 11:30AM - 5:45PM<br>Mon-Thu: 9:30PM-10:30PM) I remember reading somewhere on FourSquare that Gyu-Kaku had the best HH in Chicago so I had to check it out! I tried going before, but since I didn't have a reservation the waiting time was over 2 hours. Lucky this time I was able to get in since it was a weekday before the dinner rush.<br><br>I was a bit disappointed w/ the happy hour(HH) menu. I thought it would be having you save a bunch of money, but they compare the standard prices w/ the HH and for the most part you're saving only a dollar per a la carte order. So my brother and I decided on the HH BBQ course ($50). It comes w/ 4 starters: miso soup, a salad, white rice, and edamame. The BBQ items include: hanger steak marinated in miso, yaki-shabu beef miso, toro beef tare in sweet soy, garlic shoyu ribeye, pork belly, chicken breast, and assorted vegetables. When it comes to these types of BBQ places beef is always where the flavor is at and it definitely was that at Gyu-kaku. At the table they offer 3 types of sauces: sweet soy, spicy, and ponzu. Ponzu added the most flavor in my opinion. A bit of tangy citrus flavor complemented some of the meet. The spicy didn't pack much heat at all, and the sweet soy was almost unnoticeable. Apparently our grill was working 80% of what it was supposed to and our meat was taking longer than the expected time to cook, they said about 4 mins (2 mins on each side). So I believe the manager came over and noticed it and quickly amended it. He apologized for the inconvenience and gave us an order of the yaki-shabu beef on the house! To be honest we wouldn't have even noticed it. We really appreciated it.<br> <br>Tasty food, very welcoming service, and a grill that'll reduce the risk of your clothes smelling like BBQ. If you're a big fan of cooking food for yourself at your table like Korean BBQ, hot pot, or shabu shabu, then you'll probably like this especially if you really enjoy Japanese flavors. When you are being escorted to your table the whole restaurant staff greets you and as you leave the building they all say thank you and goodbye, talk about hospitality.<br><br>I may come back again in the future to give their all you can eat options a try. Cheers", "pics": null}}, {"review": {"des": "Okay - so this is a hopping joint where the local folks have deemed very good -and you will see this when you go.  Everywhere you look, it is filled to the brim with Japanese folks waiting to get in. That was my first clue this was a great place to go.  <br><br>I was brought there by some experienced friends who knew what to order. I was in their hands.  They picked out a melee of proteins to eat and grill in the center of the table.  Everything was DELICIOUS.  I am not a red meat eater.  On this occasion, I certainly was.  Everything (and I mean everything) was better than the next item that they brought out to grill.  <br><br>The wait staff could be a little more attentive. We had to ask for things that we didn't think we needed to have - sauces, new grill plates and such.  We also didn't understand why we had to take off our shoes to sit at our tables.  I get the custom - but we didn't need to.  Do not wear expensive shoes that might be stolen.  :)  <br><br>Overall, I would happily return to eat here.  Yum!", "pics": null}}, {"review": {"des": "my girlfriend and I got the geisha. I'm a pretty big eater, and I was only full with adding another bowl of rice. great service all around. the meat was delicious and tender. would definitely try the samurai next time!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cVT6PrVbGIcN_LMMBBAMfg/348s.jpg", "caption": "cute seating"}]}}, {"review": {"des": "My favourite chain restaurant. Just love all the Gyu-Kaku, especially the Lady M cake!", "pics": null}}, {"review": {"des": "Had a great experience at Gyu-Kaku for a late lunch. For an Asian bbq they do a great job of offering menu options for a single diner as these venues are typically geared for group dining and ordering and sharing many items. The lunch menu is a great way to still try 2-3 items in single size servings at a very reasonable cost. <br><br>There's an excellent variety of both meats (strip steak, hangar steak, chicken, short ribs, kalbi beef, shrimp, etc) with an equally excellent variety of marinades. They have paired their marinades well with the meat and everything was delicious. Plus, who doesn't love grilling their own meat at the table? <br><br>The restaurant is clean and the exhaust fans are amazing. You don't leave the place smelling like a bbq pit. Service was extremely friendly and prompt. The off peak time is the time to go to take advantage of happy hour pricing and no wait (and less smoke). Can't wait to return!", "pics": null}}, {"review": {"des": "Three locations in Chicago but always a line at any Gyu-kaku. Love all the meat options on the menu, and I love the green tea mille crepe so much (otherwise you'll need to drive down to Alrington Height's for the lady M cake)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QfzBUBj4GjO8Efl87y3DBQ/348s.jpg", "caption": "yum yum"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kegxckaseKUJuJ0IowkAcQ/168s.jpg", "caption": "green tea ice cream with lady M's mille crepe"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7yNqixq5QaMsInwRFZisRw/168s.jpg", "caption": "vegetable salad"}]}}, {"review": {"des": "Came here for Thanksgiving and was amazing!  So much food for the price. The service was great and Brock our waiter was the best. Awesome and will come back again for sure.", "pics": null}}, {"review": {"des": "Came for lunch and it is a steal. They have set menus all for less than $15.00.<br>The bibimpop was good but had limited beef strips. The Ramen was also ok but there are other places in town that serve with better flavor.<br>Note: they do take reservations in open table but if you run late by 15 minutes - they put you as a no show and cancel your existing reservation.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/FmGfguiiv7TsQr9D1VOHnQ/168s.jpg", "caption": "Fried Gyoza Dumpling and salad with lunch special"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vIJq1u2H7R7cv1DuH5baiQ/168s.jpg", "caption": "Free edamame with yelp check in"}]}}, {"review": {"des": "Every time that I have come to Gyu-Kaku has been a fun and delicious experience. I originally found out about this place as I was searching high and low for an AYCE KBBQ joint. After much disappointment in the lack of KBBQ places, I finally found this place. Funny enough I never got the AYCE here (I realized that buying individual meats during happy hour is a lot cheaper). However, I would have to say this is a great place to go if you enjoy an Asian BBQ grilling experience. <br><br>The restaurant is on several floors where you sit at a table with built in grills to cook your own meats. It's an amazingly fun experience to do with a group or even just with a friend/girlfriend. The place is always pretty packed so I would recommend making reservations so you can just jump right into eating. The service is generally prompt, and the servers are amazing in answering any questions you may have on the meats/cooking times.<br><br>Now onto the food: I would recommend trying to make it during happy hour (Every Day: 11:30AM-5:45PM and Mon-Thu: 9:30PM-10:30PM). You get a decent amount off of different meats and dishes, which can cut your bill down by a good portion.<br><br>Appetizers 2.5/5: So I have tried about four of their appetizers and will just say don't get them. None that I have tried were amazing and why fill up on some app when you can have freshly grilled delicious meat instead? The one app I would recommend is the edamame. It's your basic edamame dish that comes with some sprinkled salt on top. It's a nice mix of freshness which is nice when you're eating a very meat heavy meal. Also you get it for FREE with a check in on yelp (heck yeah).<br><br>Sukiyaki Bibimbap 4.5/5: So this is a great dish to have on the side with your meats. I always like having a side of rice to eat, but have realized by getting this instead you get a loaded rice bowl for about the same price during happy hour (the portion size is about 2x steamed rice). It comes sizzling hot with cooked beef and a variety of veggies. Overall a great dish to have as a side with the meats, or just eat by itself.<br><br>Veggies:<br><br>Garlic Button Mushrooms 3/5: So I was expecting these to be a little better, but they were a little disappointing. They didn't have a strong garlic flavor and come in foil which seemed as if they were boiling in the foil instead of getting a good sear. They aren't horrible but I prefer the shiitake mushrooms much more.<br><br>Shiitake Mushrooms 4/5: So these are cut into pieces and put directly onto the grill. They are seasoned well and when grilled have a delicious almost meaty texture that is amazing. I would highly recommend trying this if you are vegetarian or just like to have some veggies with your meal (you can justify that you're eating healthy).<br><br>Meats:<br><br>Prime Garlic Shoyu Steak 4.5/5: This is one of my favorite meats because of the delicious marinade and thickness of the meat. They give the cuts in thick strips which allows for you to cook it a medium, keeping it juicy and oh so good. The price on this is a couple dollars less than the Harami Miso Skirt Steak, however it's quality is just as good. Would highly recommend.<br><br>Yaki-Shabu Beef 4/5: This is my staple if I just want a thin cut beef that I can dip in sauce and fill myself up on. It's probably the most similar to a brisket at a KBBQ place (not as good but definitely similar). It's pretty cheap and decent quality, so get yourself some of these if you just want some good ol meat.<br><br>Kalbi Short Rib 4/5: This meat is similar to the  Prime Garlic Shoyu, however it's in thinner slices instead of thick cuts. The flavor on this meat is really good, but it is a little pricier than the other meats. Personally, I rather stick with the Prime garlic Shoyu.<br><br>Harami Miso Skirt Steak 4/5: This also is a delicious piece of meat (aren't they all) but the kick from the miso flavor really hits you hard. I did really enjoy it though, but not enough to pick this over the Prime Garlic Shoyu (as you can tell I really like the Prime Garlic Shoyu).<br><br>Toro Beef 3/5: My girlfriend loves this but I'm not a huge fan of it. It's like thinly sliced bacon, so it has a larger fat content than the other meats I eat. The best way to describe it is that it's like a more fatty Yaki-Shabu Beef. If you like fattier meats, give this a try.<br><br>Overall the place is a fun experience to do as a group and you can get some pretty good deals during happy hour. Once again I would recommend making a reservation so you aren't stuck waiting. If you love grilled meats, this is a must come to place.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lIrb0nn-IbYi_QN0gVytYQ/348s.jpg", "caption": "Yaki shabu beef on grill"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TiBy28M2cvqy9I01toxcUQ/168s.jpg", "caption": "Prime garlic shoyu cooked"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5Pgl0_AKq0nLmOGm9dPVZw/168s.jpg", "caption": "Prone garlic shoyu on grill"}]}}, {"review": {"des": "I've been coming to this location for the past two years, and it seems to be getting better every time!<br>I love that they have a bar area upstairs to make the wait easier and where you can enjoy some appetizers. The drinks are amazing, I recommend the Geisha, Lychee-Tini and the Fish bowls. <br>This is the perfect place for first dates; where I had mines. It's a fun way to interact with friends and family without anyone being glued to their phones the whole time. Also, you have to try the Sweet and Smoky BBQ flank! 5***** + will come again!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VqZdxMf64FiB-UR_q8ihQw/168s.jpg", "caption": "Geisha"}]}}, {"review": {"des": "I've been to Gyu-Kaku a number of times and it's consistently a fun atmosphere to eat.  I return again and again mainly to get the green tea Lady M cake, which I order every time I'm here. The food isn't spectacular and I've never been blown away by the barbecue but it can be quite a fun experience to grill your own meats. I find the portions to be small and the quality of their meats is so-so. Don't expect the beef here to melt in your mouth. This particular store has an upstairs and a downstairs. Downstairs you can grill your own meat and upstairs has a bar and you can only order non-grill items.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0fPNkjnitnTmkyOeJ_mmlw/168s.jpg", "caption": "Lady M green tea cake"}]}}, {"review": {"des": "Good food and fun thing to do when socializing but if you come really hungry it can get a little tedious to keep cooking food while eating and can get a bit expensive. But overall a fun atmosphere and there is plenty of parking is available.", "pics": null}}, {"review": {"des": "First time we visited in the states. They are so friendly and foods was soooo gd.if I living in Chicago l,I would say I'll go every weekend!<br>We had so much gd time!thank u guys!", "pics": null}}, {"review": {"des": "Love their wide variety of meats. Don't have to worry of it's taste coz they're all marinated to perfection. For its price it's not really bad. You have a lot of choices for your side orders. Love love their rice! And most especially their S'mores! They also have a very nice and friendly staffs. It's worth your money, time and weight gain", "pics": null}}, {"review": {"des": "Shared the Kobe dinner for 2 and the Wagu steak with a buddy this past Monday at the Ohio Street location in downtown Chicago. Service was good, but did was great! The Kobe and Wagu beef (six different cuts in all) plus all the veggies, and started were all very good. We were so full that we didn't have room for the desert that accompanied the dinner. Would highly recommend.", "pics": null}}, {"review": {"des": "Nice concept, nice ambiance, worth trying once. But the for is mediocre at best. Will not go there again.", "pics": null}}, {"review": {"des": "Such a popular BBQ restaurant in downtown and always a long line there. But the bar in the 2nd floor was available, and didn't need to wait. So we had some desserts and wine in the bar at night. The ladyM green tea cake was so famous, and after I had a bite I knew why! Amazing taste and perfect for a green tea lover. My friend had chocolate lava, which was cute and yummy. We had coco-mo and peach cocktail for drink, both of which were great. Love this place!", "pics": null}}, {"review": {"des": "We had the all you can eat supreme course meal which had the best meats.  We tried all the different meats and they were all really good.  The meat quality was superb.  Also had their spicy tofu soup which was really good.  We ordered some rice, edamame and volcano tuna; all really good.  The staff is really friendly and helpful.  There was very little wait even though they were busy.", "pics": null}}, {"review": {"des": "Been to this location 3 times and have enjoyed all my experiences so far. This place is usually pretty busy so make sure to reserve if you are going during dinner time or weekends! Would highly recommend going for their happy hours- great prices at an otherwise slightly pricey bbq place. If you like their fb page, you also get a free edamame side dish! <br><br>Ambience: You have your own grill at the table but the ventilation is quite good so no worries about spreading your dinner fumes to everyone within 5 miles. First floor is pretty modern while upstairs has some traditional japanese seating (no shoes allowed) <br><br>Service: Very courteous, mostly prompt. Had had no major problems so far but occasionally they'll forget a dish or two<br><br>Food:  <br>- portions are small fyi (much smaller than korean bbq) but all the meats I've tried are very high quality. I would say like 2-3 plates of meats + veggies at least per person if you dont want to get other sides<br>- Try their garlic noodles! It's delicious -- flavored just right without being overly oily<br>- You can't go wrong with any of the meat choices really. I've had the shrimp, chicken, and various types of beef and beef tongue-- all delicious. A lot of the plates are discounted by a few dollars during happy hour so it's great time to try the different meats! <br><br>The reason I only gave this place a 4 star is because of always having to wait despite having a reservation and the smaller than expected portions here.", "pics": null}}, {"review": {"des": "For those who have read my profile or reviews you know I love KBBQ, and since leaving LA, this is the closest I've come to finding something similar. We had a 45 minute wait at the most random time but worth it. We all enjoyed everything we ordered. They have a fun drink menu (both alcoholic and non-alcoholic). They have pretty good happy hour deals on food and drinks every day. One of the must tries is the hot stone bibimbap (regular or spicy), you wont regret it. The have a dish similar to popcorn chicken that has a dipping sauce that is amazing. They have a lot of different cuts of meat marinated in various sauces, and of the ones we tried we liked them all. It can cost a pretty penny because each order of meat is small so it takes some time to get full, especially if you're eating family style. They also have ramen and other food choices (those we didn't try but they looked good).", "pics": null}}, {"review": {"des": "Took the bar seat during happy hours. Awesome appetizers and drinks. Great prices!<br>Would love to come back.", "pics": null}}, {"review": {"des": "Came here for the lunch special on a Saturday with a reservation at 12:30pm. Overheard some people that the walk-in wait was about 45 minutes when we got there. I think it's really important to get a reservation if you plan on grilling meat. I live near, and there seems to always be a wait during the main lunch and dinner times.<br><br>This is a Japanese-style BBQ chain restaurant. A bit like Korean BBQ, but with different flavors. Overall, I think this is a pretty good BBQ place, I just didn't think it was that spectacular, and I'm not dying to go back anytime soon. <br>I went for the lunch special which allows you to select either 2 ($11.95) or 3($14.95) meats to grill with miso, rice, and salad. I got the galbi short rib sweet soy and prime garlic shoyu steak, and added an order of zucchini to grill as well. The galbi has a surcharge of $3 and the veggies had a surcharge of $2, making my total bill 16.95 before tax and tip. <br>Overall, everything tasted pretty good. I would say that the prime garlic shoyu steak was my favorite, but I don't think this is exceptional, and the portion size is not that great. You get a lot of rice, but not that much meat.<br>Also, the grilling surface is pretty small. We only had 3 people grilling their food, but it felt a bit tight. And the ventilation is decent, but you're definitely going to leave smelling like smoke. <br><br>Food was good, but don't think I'm going to be clamoring to get back here anytime soon.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cq7hF8YAZZDs-g-knLc5Ag/348s.jpg", "caption": "Grilling the meat at the table"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/K21uXLNDP_RGr-f287P3Iw/168s.jpg", "caption": "Salad"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7YtJSLHB4llIeMInx07Lvg/168s.jpg", "caption": "Miso soup"}]}}, {"review": {"des": "That first taste of meat in your mouth is freaking bliss. Just melt in your mouth meat with the sauces oozing on a chopstick full of rice. <br><br>I can not say enough things about the quality of the meat or the way how it was flavored.  Really top notch.  Because they have ayce until end of May, I have come 3 times to Chicago just to eat the delicious spread offered. Def the skirt steak, beef tongue, toro beef and omg pork belly is just top notch!!! Food makes me so happy and this  is def. in food heaven when I eat there!!  All 3 times service has been good and I can not wait to make the 2+ hour trip to eat again!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/k2yj9gCpZIeUX8Oyf4z8NA/168s.jpg", "caption": "Don't think twice just go eat!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1NiLZ-nzlZ3R0X0JIKLBVQ/168s.jpg", "caption": "Ayce spreadfor 90 min"}]}}, {"review": {"des": "So we came here 3 years ago on my birthday but I remembered very little of this dinner... my friends still rave of this place and I knew I had to go back. We finally returned this weekend. My husband and I ordered the premium lunch special which we though was a great deal. $35 for 5 different types of meat, soup, salad, rice AND s'mores for dessert (What?!). Do yourself a favor and upgrade to the garlic fried rice. This was probably the best meal of my life, I'll go ahead and say it. There's no pics because we were too busy enjoying this amazing meal!", "pics": null}}, {"review": {"des": "This is a great little Korean bbq. It has the grills in the table so they bring food to you for you to cook. It's great for groups or dates and the quality of meat is good. I ordered the samurai platter which include shrimp, chicken, beef and a few starters. <br><br>The beef is relatively high quality and they offer very good authentic wagyu. The kimchi is also very good.", "pics": null}}, {"review": {"des": "I have heard about this place for a while so I finnaly gave it a try.  I made an appointmentat 7:45 pm but had to wait till 8 to be seated.  The asmosphere was friendly and the table was roomy. <br><br>We got the ultimate AYCE for 50,  there were many selections.  The beef bibimbap was good.  The meat was great but nothing special. <br><br>There were no side dishes as traditional korean place so i was disappointed.  <br><br>Would not return", "pics": null}}, {"review": {"des": "Nice restaurant; excellent service.  But you need to make a reservation. If not, you will need to wait for a long time.  Small plates but very yummy.", "pics": null}}, {"review": {"des": "Came here on a Sunday, last day in Chicago! There was a pretty long wait for seating, but we were seated at the bar to munch on apps(we bought) and wait. Seating upstairs (shoes off Japanese) was so much cuter than the downstairs seating (more of a kbbq vibe). There were a bunch of deals our waiter told us about and I definitely appreciated saving money through their phone app. I've never had Japanese bbq before so I'm a newbie. The meat was SOOO good. The portions are smaller, but the quality is so much better than kbbq places. The way the mushrooms were cooked was in a grill like way. It was a good experience. Definitely try this place out because it seemed pretty popular!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vZvvGczI493bkCmJwqaIpA/168s.jpg", "caption": "Meats"}]}}, {"review": {"des": "Decided to grab lunch here, before our flight back home! It was a hella smart decision! Lunch specials and early happy hour prices on a lot of the items on the menu!!! Our lunch combo order was plenty and it was satisfying! 3 meats, soup, salad, and rice for $15?! Sign me up!!!!! The servings was enough to leave your stock both happy and upset! Happy because it's full of delicious food and upset, because there's no more room! Beer and cocktail specials were on point too! If we didn't have to catch a flight, I would have gotten plastered! ‍", "pics": null}}, {"review": {"des": "Best Japanese BBQ I've ever had. No wonder they have become a chain. The cuts of meat are superb. Do the beef (harami, Kobe) for a sensational experience. Just unbelievable and filling. Shogun for 4-5 people is perfect amount of food.", "pics": null}}, {"review": {"des": "There was a small wait, but not terribly bad. Service was great and I got my FREE edamame by checking in thru Facebook. You can also do by checking in thru Yelp, but I will save that for next time. <br><br>The place sure could use a RENOVATION and upgrade. (just saying) this place from what I wS told and from what we saw is ALWAYS busy and they do host groups of big parties. I do like the fact that they change the grill for each time you order meat to prevent cross contamination. Food was tasty but then again any sauces that they have add such good flavor to any meat. The downside of this is that there is TOO much sodium in their sauces because I came out bloated like a balloon. <br><br>I did not like the restroom because it was way too dark and it was hard to see. Who knows what the maintenance is and so that totally freaked me out. <br><br>Would we be back? Hmmmm probably not.", "pics": null}}, {"review": {"des": "Phenomenal. Every order of meat and fish was juicy and decadent. Very happy with the meal. We got the Premium all you can eat. Sauces are phenomenal. Recommend the addicting cucumber and all of the beef! Shrimp was scrumptious also. The tuna volcano was perfect. The garlic rice was tasty beyond words. We ate every last drop. Service speed on the appetizers could be improved but the high quality of the foods made up for it. Can't wait to go back!", "pics": null}}, {"review": {"des": "Solid first experience here. The wait for a table to grill meat was 1 hour so we just went up to the bar and ordered, which had tables around and was first come first serve. Non grill menu items is a nice selection of ramen, bibimbap, appetizers (poke), etc. The taste of the food was good. The ramen noodles were quite nice and chewy. The meat to rice ratio in the sukiyaki bibimbap was a little sad but the flavoring with the egg and the soy sauce made up for it. I do wish that the bibimbap had some more ingredients in there--throw in some vegetables and more meat! <br><br>Also pro tip: if you sit at the bar it's an all day happy hour discount which makes it pretty easy on your wallet. And plus you can just walk in without a reservation and eat without a long wait.", "pics": null}}, {"review": {"des": "Gyu Kaku is about food and the experience of cooking it yourself. We got the unlimited menu for two- lots of beef, veggies, salmon, shrimp, calamari, sukiyaki bibimbap. In drinks we got a fishbowl and shared it, which was more than enough for two. The food was delicious but we definitely got too much of it. We got green tea ice cream for dessert, perhaps my favorite part of the meal. The staff was friendly, efficient and wonderful.", "pics": null}}, {"review": {"des": "Delicious food. Our server Josh was really helpful and and friendly in answering our questions and also giving us tips of what to do while visiting on our vacation. Would visit again next time I'm in Chicago.", "pics": null}}, {"review": {"des": "I was roaming the area, actually looking for pizza (which was available next door) but I could not resist the bright allure of Japanese BBQ. Alas, the wait for a table was too long so I went upstairs to the bar - where one can only order off the appetizer and bibimbap menu. So no BBQ after all. Everyone I encountered on the staff was really friendly and seemed to be enjoying themselves. They do encourage you to indulge in food, drinks, dessert but not pressured. I tried the tuna poke and it was fine. I also had the steamed chili shrimp dumplings and they were absolutely terrific! I was rather tempted to order a second serving but the cupcake from Magnolia Bakery that was waiting for me helped me to resist. Not sure I made the right choice there. Unfortunately I'm leaving town tomorrow or I would go back for more dumplings. But if you are lucky enough to get a table for the full BBQ, start with the fantastic steamed shrimp dumplings.", "pics": null}}, {"review": {"des": "Do you like asian flavored meat? Do you like meat in general? GO HERE NOW. Cook it yourself on the table top, the servers are helpful and know everything about their product. If you're into veggies, they have some of those too. And don't even get me started on their apps/bar snacks. (Plus the drinks are cheap!) <br>Pricing is a little high for the meat, but it's worth it to get a set that has several different kinds in it. Or just go at happy hour. Discounted meat. Yum. <br><br>Go. Go now. You won't regret it.", "pics": null}}, {"review": {"des": "AYCE High Quality Meat for $35 Mon - Thurs or $40 Friday - Sunday this summer! What a steal. The appetizers are all so delicious. Def try out the Spicy Tuna Volcano. <br>Came here for dinner with my boyfriend and his sister and we ordered 8+ apps and 10+ meat entrees. At the end, we ordered 2 ice cream - one vanilla and one green tea and 2 orders of s'mores. They're included in the AYCE ;). <br>A little disappointed that a fountain drink is $2.84 WITHOUT refills (they changed their policy) and the glass was half ice half soda. <br>I like this location a bit more than the one on Harrison since you're limited to ordering only 3 meat entrees at a time but as many times as you want within 90 minutes. The Ohio St location allows you to order anything you want and whenever as many times as you want within 90 minutes! <br>The service was about a 4/5. They would forget what we ask for sometimes, however, they were pretty fast to attend to our needs. <br>I'm def coming back! :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1NJ1UcwwzOZqxWkUtgTOFQ/348s.jpg", "caption": "Spicy Tuna Volcano"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_vE8BH_akTB0fpeZWpGBqw/168s.jpg", "caption": "Takoyaki"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yLgJ4C3Yxalaxqwb9XiuOg/168s.jpg", "caption": "Fried Calamari"}]}}, {"review": {"des": "I brought my parents here to treat them for their birthdays, and the overall experience was just super fun! We did the Shogun meal, which an awesome variety of meats, along with some awesome appetizers, and our waiter was really attentive, the service was excellent. We had the fried cheesecake and also ordered the lava cake for dessert, and they were both excellent! The atmosphere here is great, although the music was a bit too loud for good conversation, only downside.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8H_6L_1xOZ-oYIwNnhGF-g/348s.jpg", "caption": "New York Strip Steak, Bistro Hanger Steak, and others"}]}}, {"review": {"des": "I absolutely loved this place. Service was great, food was delicious and the price was right! I had the Angus steak, pork belly and Chicken. It came with rice, miso soup and salad. And i also got the steamed shrimp pot stickers! I highly recommend!", "pics": null}}]}