{"name": "handlebar-chicago", "reviews": [{"review": {"des": "I went to the restaurant with my daughter who is a vegetarian. I was a little hesitant as I do eat meat and was scared that I would miss it. However, I was pleasantly impressed with the menu. There was a nice variety and I'm sure this place caters to the palate of everyone.  I wanted an omelette  with spinach and jalapeños which wasn't in the menu however the waiter made it happen for me.  My daughter had the nachos which I also tasted and it did not disappoint. In fact I will be ordering that in my next trip.  Excellent customer service.  <br>The space was a bit cramped but the food and atmosphere was so great I did not mind.  The walls are covered with all types of interesting art which were pleasant to see.  <br><br>I would most definitely return to this place.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/v1QjKuh54nUIwV8TabO5SA/348s.jpg", "caption": "Bar."}]}}, {"review": {"des": "I stopped here for a quick bite before heading to the airport. It's a small restaurant that's primarily vegetarian/vegan with gf options. We sat at a high top for three and got waters before looking over the menu. The drink menu had dried food one it which was a bit gross but otherwise the table and sliver ware were clean. <br><br>I ordered the tortas appetizer with cashew cheese, and my friends got the Bloody Mary and sloppy joe. The Bloody Mary was tarter than I like, almost too much pickle or lime juice. It did come with a fried pickle though! The tortas were thick and handmade with a solid amount of black beans and cheese on the side. The salsa verde was spicy and I was not prepared for it but the overall flavor was good. I really liked the sloppy joe. It was sweeter than ones I've made but it was done with jackfruit and the string fried weren't super oily. We actually dipped the fries in the cashew cheese for an added flavor combo. <br><br>Overall it was a good spot to eat at. I'd want to come back and try a few more items as the flavors seem a bit on the extreme but it's a good veggie/vegan spot.", "pics": null}}, {"review": {"des": "We brought here with and under the recommendation of a good friend. After a long night of drinking and walking in the city, we needed a hearty brunch to replenish our bellies and souls! We were halfway there and my friend mentioned that this was a vegan/vegetarian restaurant. Typically I wouldn't mind that as I've appreciated those types of establishments before plenty of time. However, I can't say I wasn't a bit disappointed that I wasn't going to get all the bacon I'd been dreaming of. <br>This place made me forget all about the bacon! We started off with one of the best bloody Mary's that I've had, garnished with a fried pickle, it was just what I needed while I waited for my order. They even had the Highlife pony's to serve with! I got the breakfast chimichanga which was huge, delicious, and you didn't even notice there wasn't any meat! Much too much to finish but we took the leftovers. My husband got the shrimp and grits which was actually my favorite thing. The grits were cheesy, the shrimp were cooked perfect, and the spinach was so fresh and good. Great flavors all around! Our friends come here every Saturday and I am sure we will be back to try more! <br><br>Thanks for a great meal and awesome atmosphere! Loved the old school hip hop playing as well!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UeGK6_vSfNmXOB2Oei6KHg/168s.jpg", "caption": "Best Bloody Mary!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/F5bcyRhIjKavLPYare1neA/168s.jpg", "caption": "Breakfast Chimichanga"}]}}, {"review": {"des": "Verdict: excellent vegetarian breakfast with gluten free options<br><br>Atmosphere / decor - 4<br>Service - 3.5<br>Food - 4<br>Location - 4<br>Value - 4<br><br>Overall 4<br><br>The drinks are cheap, the diablo eggs (something along those lines) are amazing (although I'm not a fan of the corn cake). I've had a black bean and potato special that tasted way better than my description. The chili cheese fries are pretty good, made with a vegan cashew cheese (if you choose vegan). The dinner menu looks delicious but I've only had the breakfast for now.", "pics": null}}, {"review": {"des": "Omg feed me all the foodz. I stopped here on my trip to Chicago and was not disappointed. They have a nice selection of alcoholic drinks as well as the usuals for non-drinkers, but what really stood out were the vegan dishes they had available. I chose the Nashville hot fried \"chicken\" and was blown away. This sandwich really had me asking how it could be vegan. The breading on the mushroom patty was thick and crispy and the hot sauce really kicked it up. If you don't like spicy food, this may not be for you. I didn't find it to be terribly spicy, but those sensitive to heat may not like it. Basically, if you really do put Franks on everything, you need this sandwich in your face right now. I had the queso fries as a side, which they offered vegan queso!  How nice!  It's not an exact match for the usual non-vegan queso, so if you're looking for that, you may be disappointed, but I thought it was great anyway. I miss nacho cheese sauce something fierce and was able to almost completely satisfy that craving here. Check it out if you're in town. It's worth the trip for that crunchy sandwich.", "pics": null}}, {"review": {"des": "LOVE! this place. Their chimichanga is perfect the morning after a night out drinking soul enriching plate. I love their shrimp and grits as well. If you're up for something lighter then breakfast burrito is delish. <br><br>Their special bloody is only a $1 up charge.  It is super strong and served with the best fried pickle I've been able to find anywhere. Not a whimpy slice but a whole spear that's fried to perfection. <br><br>Service is fast and attentive. Can't say enough good things about this place.", "pics": null}}, {"review": {"des": "This place was so good! It has a pescatarian-friendly menu and all the options are super yummy, flavorful, and filling. <br>I got the black bean tostadas and even as an appetizer they were really filling. I loved that the tostadas were chewy instead of crispy, with a similar consistency to an arepa. There is an option to choose monterey jack cheese or vegan cashew queso. The vegan queso was really indulgent and  perfect compliment to the food, I would recommend to get it on the side because you don't need very much of it because of its strong flavor. Their margaritas are also very strong and a bang for your buck. They have an outside seating area which is perfect for a warm summer night as you enjoy your food! Would recommend!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3s3mU0kcCdBVaEadA0YtUg/348s.jpg", "caption": "Black bean tostadas"}]}}, {"review": {"des": "SO GOOD. Worth the trek from my hotel across town for tasty vegan vittles.<br><br>had an amazing queso burger & fries, snickerdoodle cake for dessert.<br><br>kinda divey. dark. LOUD music. Friendly service. <br><br>sadly did not imbibe, but the cocktail menu looked v fun", "pics": null}}, {"review": {"des": "Although I am not vegetarian or vegan, after dining here I can see the most certainly see appeal! I've always been a fan of tofu and tempeh but if that's not your thing they do offer a few seafood options too, so everyone wins. <br><br>There is indoor and outdoor seating. We opted for the patio since it was a nice day out. I got the buffalo \"chicken\" wrap (which is actually fried seitan) with a side of their gouda mac and cheese. The food was solid. No complaints. Definitely a fun little spot to come for booze and food.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IrTP-6amubw1LOZRTknnZQ/348s.jpg", "caption": "Buffalo \"chicken\" wrap w/ smoked gouda mac & cheese"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gO9B6jnbKdO4qABVKntzkQ/168s.jpg", "caption": "Buffalo \"chicken\" wrap w/ fries"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/e3AyBjdoLoyNXJpPIGXzOA/168s.jpg", "caption": "Fried avocado grilled cheese w/ sesame broccoli"}]}}, {"review": {"des": "This hipster hub has high energy, loud ambiance, and swarming crowds. You are going to have to leave fido at home for this pitstop, unless a service pet. With no AC, this small restaurant managed to cram a small kitchen and small patio into the location. But, don't worry, you won't be cut short of the Handlebar experience.<br><br>CALLING ALL VEGANS, VEGETARIANS, gluten free, lacto ovo-ians... WHATEVER your dietary preference is, this place is meat free. Here, you no longer have to lie to your server that you have a gluten allergy; when in reality, you are just particular. It's crazy just how close meat substitutions have come to tasting like meat. Food has come a far ways since 2000s (aka since restaurants had no choice but to put GF, V, VEG symbols on their menus). My husband eats a ton of meat and thought it was better than he expected. <br><br>My first reaction was to rate this place a two star (sssshhhh... I know, I know). Service was slow and my food was mediocre. I took a few months to put this restaurant under the Yelp microscope. Handlebar is a mediocre restaurant to me. Here's why?<br><br>Service is VERY slow. But that's only because of the customer loyalty, and retention surges. \"Handlebar is a cool spot, check it out!\", is a common phrase I heard moving into Chicago. Groups larger than six may be split up. People swarm to this collaboration because the company branding is spot on and everyone wants to go to the talk of the town. That being said, it took five minutes for someone to even acknowledge us at the host stand, and another ten minutes to get a water from the time we were seated. Our server seemed preoccupied, and we had to flag down other servers for water refills. The restaurant mission is successful with middle of the road service, but is the food really that great?<br><br>For Brunch, I ordered the Vegan Breakfast Burrito because I LOVE seitan. (Just to set the confusion aside- Tofu is condensed soy milk. Seitan is protein from wheat dough. Tempeh is fermented soybeans.) The Vegan Breakfast Burrito ($10.25) comes with seitan, peppers, onions, potato, avocado, spinach, salsa verde, black beans. SADLY, the vegan burrito is underwhelming- size, flavor, dryness. My husband offered me a bit of his French Toast, and my eyes lit up. I contest that it is the Wisconsin Maple Syrup that did the trick... former five year Milwaukee resident right here. <br><br>This place is so popular. I am just not on board with the Handlebar fan club, yet. I am going straight for the dinner menu next time-- Sambal Tofu, Ground Nut Stew, or Buffalo 'Chicken' Wrap. See you soon, Handlebar!", "pics": null}}, {"review": {"des": "Holaaay! This place is the shizznit! Got the vegan French toast cuz how could I not? They also are a Pie, Pie My Darling wholesaler which makes them ultra cool. <br>Got an extra piece of vegan French toast for our son and my husband got a vegan burrito (sorry I don't remember what). It was all so good and the service was impeccable. <br>The atmosphere was great and the food was absolutely amazing. We can't wait to make it back to Chicago to return. Nom. Nom. NOM.", "pics": null}}, {"review": {"des": "Handlebar is really a great gem in Wicker Park! It has great vegetarian/vegan options that are well priced and so delicious. The loaded Mac and tostados are among my favorites. And let's not forget the fried pies!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cBmXX0qZcjKPS6A1U3j38A/348s.jpg", "caption": "Grilled avocado cheese sandwich & chili.   Nashville hot burger and cheese fries."}]}}, {"review": {"des": "This place does have amazing vegan food but if you can stomach the sobby waitstaff, and non air conditioned venue, and loudness then go for it. <br><br>We recently visited this place again, and all i can say is come on it's freaking 95 degree outside,  turn on the a/c man!<br><br>I was so sweaty that I couldn't even enjoy my beer and grilled cheese sandwich. When I asked the waiter what kind of beer they had, he said all snippy, \"it's listed on the beer list\" and rolled his eyes. <br><br>Okay jerk we know it sucks to have 3 roomies at the age of 32 yrs old and still be a waiter/actor. jerk!", "pics": null}}, {"review": {"des": "Always solid dishes, I have been several times. In addition to having great vegetarian and vegan food, I appreciate that it has seafood options as well. It makes it it easier to bring those friends that are not about vegetarian food. <br><br>The menu is HUGE. My most recent visit I had the vegan country fried portobello, YUM! It was a huge fried mushroom covered in gravy on top of collard greens and mashed potatoes. A friend ordered the vegan chimichanga which was also delicious. <br><br>Another stand out is the oatmeal pie desert, for sure leave room for this! Bon appetit!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ufr9S8PPtglak1loWAaVPA/348s.jpg", "caption": "Country Fried Portobello"}]}}, {"review": {"des": "Handlebar is a local restaurant serving up American/Mexican fusion classic dishes for vegetarians and vegans seeking breakfast lunch or dinner. I'm partial to their breakfast, but everything is good from Chimichangas to fried pie-style empanadas encasing lingonberries. <br><br>Chimichangas are top on my list of various vegan foods I've eaten anywhere. The shell remains crispy like it just came out of the fryer, but the whole burrito-looking beast of a breakfast is covered in vegan cheese. You won't miss the beef at all because there is a perfectly-simulated ground meat made of seitan. <br><br>On my dinner visit, I started with chips and guacamole, then attacked a buffalo chicken wrap with fries, and washed it all down with Lagunitas Little Sumpin' Sumpin' on tap. The guacamole Handlebar makes caters to picky palates for sure. You really need to dump half a bottle of hot sauce into the avocado mixture in order to punch the flavor when at least a chopped jalapeño would have sufficed, sparing all the sodium coming from a salty sauce.<br><br>I can't stress enough how much I'm not missing the meat here at Handlebar. The chunks of faux chicken on the buffalo wrap are fried to achieve a crispy outer layer, but remains chewy on the inside. I love the buffalo sauce as it is on the spicier side, along with the fresh vegetables that seem to cool down all the heat!<br><br>The atmosphere inside will make you feel welcome with all of the statement art fighting for wall real estate. I don't think there is one spot of blank wall. Look anywhere and your eyes will rest on a sign, stopping to contemplate the art itself or the message it projects. I particularly enjoyed the selection of music on my evening visit as Standing On A Beach - The Singles by The Cure was playing. It paired well with the eclectic distribution of art on the walls.<br><br>I skipped on dessert, but I cannot wait to return for the fried pie. All the desserts here are vegan except for the chocolate cake. Handlebar has offered heaping servings of meatless pub classics since 2003. I'm pretty sure I'll have the time to come back and sample the rest of the menu.", "pics": null}}, {"review": {"des": "I'd like to share some actual quotes from eating at handlebar. I had the special fried \"chicken\" sandwich which is made with fried hen of the woods mushrooms. <br>\"I want to marry this sandwich\"<br>\"No one will ever make me as happy as I am eating this sandwich\" <br>\"I've never eaten anything so fast in my life\" <br>\"I will not put it down, no\" <br>\"What is this? Homemade vegan ranch? You think I can get a cup to just drink it?\" <br>\"Serious about drinking this ranch though\" <br>\"I can't believe I ate it all, I never finish things\" <br>\"I'm drunk on this sandwich\" <br><br>Fries were great too. Ate a ton of delicious vegan food in Chicago but this was by far my favorite. Marry me, handlebar sandwich? I'll be faithful.", "pics": null}}, {"review": {"des": "Handlebar is one of my favorite casual dinner spots in the city. Because I'm vegan, it's so nice to be able to order virtually everything on the menu. They do offer fish and dairy options if you're going out with someone that is hesitant to try vegan food. Every time I bring along a friend who is new to Handlerbar, they not only enjoy their meal but suggest coming back! <br><br>A staple for me are the nachos - I get with the cashew cheese. It's massive, so I typically get help from my friends to finish. Other favs worth mentioning are the fried pickles, black bean tostadas and sloppy joe. <br><br>They turn delivery off frequently when the restaurant gets busy, but you can still order ahead and pick up.", "pics": null}}, {"review": {"des": "Went to Handlebar for dinner yesterday, a Tuesday evening. <br><br>To start, we ordered the nachos with vegan queso for a shared appetizer. This could also probably be a meal for a single person if you're really into nachos. They were truly loaded with toppings, which was great, since I've had other nachos with the wrong chip-to-topping ratio (that is, too many chips). The queso was delicious and I also enjoyed the hefty portion of guacamole atop the pile of chips. I have actually been thinking about these nachos all day today, and I cannot wait to go back and order them again.<br><br>Based on other Yelp reviews I'd read, I decided to try the pesto tofu sandwich for my entree, and I had the plantains as my side dish. This was a truly unique sandwich! Lots of complex flavors going on and the tofu itself was perfectly cooked. I also enjoyed the plantains.<br><br>Service was very quick; the appetizer came out within 10 minutes of ordering, and the meals arrived shortly thereafter. The server was also very attentive.", "pics": null}}, {"review": {"des": "The service was horrible at this place. My boyfriend and I stopped in for drinks and ordered at the bar. The bartender did not ask for our IDs but instead he simply put out his hand and didn't say anything. My boyfriend hands the bartender his credit card assuming he was asking us to pay. The bartender rudely responds with \"that's not your ID.\" Not even with the slightest hint at a joke or anything. If he would have asked for my boyfriend's ID I'm sure he would have gladly handed it to the bartender, there was no need for a snide remark. <br><br>We receive our drinks and decide to sit outside on the porch. There were no signs indicating the porch area was for smoking but there were several smokers (who I believe to be employees there). I was surprised since there were people eating their meals several feet away. We are not smokers so we move to an open table since it's not too busy. A waiter comes up to us and asks if we're ordering, we say we just want to finish our drinks away from the smoking area. All he said is \"this table is only for larger parties so you can't sit here.\" This is understandable but he does not offer to find us another table or offer an alternative. So we ended up having to sit next to the smokers.<br><br>The hostess was the only person who knows how to do her job, apparently. She saw us and offered to seat us at a table but by that time we were already at the end of our drinks.<br><br>I was honestly thinking of going back to try the food but after this experience I don't want anything to do with the place. The waitor and the bartender we're extremely rude, I wish we didn't tip him. The beers were good. This is my first one star review and it sucks because I don't think I'll be giving this place another chance due to the medicore service", "pics": null}}, {"review": {"des": "Superb. Pepito scramble & Vegan Diablos. We are healthy large portions for very reasonable price. Coffee was great. It was warm and they squeeze in a lot of tables for the space. The decor is cool. Our server, Joe, was quiet spoken but his softness was warm. After we ate, I asked for more coffee and my boyfriend was done with his beer. But so not to feel left<br>Out, he brought him a baby glass of beer. See photo..... wonderful!", "pics": null}}, {"review": {"des": "If you are looking for delicious vegetarian options so good you'll forget you're missing meat- this is the place! I'm a meat eater and I love so many vegetarian things on this menu! The chili cheese fries are fantastic. <br><br>Lots of vegan options too!", "pics": null}}, {"review": {"des": "Been going to this joint since it first opened and it's still, as good as ever!<br><br>This round consisted of: A 1/2 order of the most \"thanksgiving inspired\" Vegetarian Biscuits & Gravy. (Made me think of mushroom, vegetarian gravy on T-day)<br><br>Next up, The Chili Mac Attack!  Kinda like Mac N Cheese + Veggie Chili + + + +. So much YUM in one bowl, you might have to loosen your belt... ;)<br><br>Perks: Chill Vibe, Outside Patio, TONS of Vegetarian/Vegan Options<br><br>Eating Out With A Girl #EOWAG #EatingOutWithAGirl dot com", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Vmdf83JldYVQ3Hm7Rm_8_A/348s.jpg", "caption": "Eating Out With A Girl + Chili Mac Attack"}]}}, {"review": {"des": "Delicious!!! I had the avocado grilled cheese with vegan quest fries, and honestly it could not have been any better. Definitely recommend this place to everyone, vegan or not!", "pics": null}}, {"review": {"des": "If the Hell's Angels, the Seattle Grunge Music Society and  the local Herbivore Society opened a cafe out might look something like Handlebar.<br><br>That said, Handlebar is true and authentic to itself, whatever that is and whatever its target demographic may be, which clearly isn't me. That said, I do like the place the food is creative bar/pub. They have strong drinks, the nicest people working there and a small but decent menu of vegan, vegetarian and pesceatarian creatively prepared, tasty and at reasonable prices. Nice brunch selection.<br><br>Somehow though the combination of a bean sprouts, avocados, seitan breakfast while listening to Blood Circus or Hammerbox with the volume turned up to \"11\" doesn't work for me, but like I said I'm not their target customer. That said, I do like the place, the food and people and will certainly go back anytime. <br><br>Congrats for being authentic and original. Keep up the good work.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gAT6WOjY3mBT26cYMiovFA/168s.jpg", "caption": "Shrimp and Grits"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jiC6h0Le7FI_SVIFLqgFbw/168s.jpg", "caption": "The joint"}]}}, {"review": {"des": "This place has a cool vibe. The patio is beautiful especially in the summertime. The lighting, outside bar, tables are gorgeous. When we arrived; the place was packed and looking forward to dinning in the patio area. Outside on the right there's a waiting area. It's very spacious. The ambience is beautiful. The wait was worth it.  We waited for 10 minutes. The staffs were nice.  Laidback,personable and knowledgeable of the menu. Gave good suggestions. <br><br>The food looked delicious.  Appetizers: fried pickles, etc tasted good. The entrees look delicious but not so fresh. Told my server about it and they so gracious to please..re done, allowed choose a different dish. Still the food wasn't a 5star.  My assumption is that it was off night or the chef wasn't haven't a good night", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/i7VsUtwhpytyCVBwG_OeOg/348s.jpg", "caption": "Chicago style tofu sandwich"}]}}, {"review": {"des": "I am in love with this place. Every time I dine in or order out, there has never been a problem. Everything I have ever eaten here is delicious. I thought the Nashville Hot Chicken Sandwich was too hot, so the next time I ordered it, I got it without hot sauce which was not a problem. I love that they are open late because I eat dinner at 10pm when most vegan places are closed. The atmosphere inside is dark and slightly cramped, but I don't care because the service is always good. I am honestly salivating thinking about the food right now.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wOzQgeALnfQSJQ7BIc1yxg/168s.jpg", "caption": "Vegan nachos mmm. I'm always full after sharing these with my boyfriend."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/my1MMYLV_1z2VWC90NCUyg/168s.jpg", "caption": "Buffalo cauliflower wings! Please bring these back!"}]}}, {"review": {"des": "Love the vegan/vegetarian options. Typical fare...toast, eggs, sammies and wraps. Different food and drink specials depending on the day. The bloody mary on Sunday is $6, different than their other bloody mary not on special-- this one was alright, the accoutrement were good, the bloody itself was meh, didn't even finish it, and I love bloody mary's so, this was not up to snuff. The food was good though, but can't really eff up toast or potatoes. <br><br>It was a bit busy, but we were seated pretty quickly.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JqtCqoRCXi_ukOahAHoF3Q/348s.jpg", "caption": "chorizo toast and the buffalo wrap"}]}}, {"review": {"des": "This food was great! For those nights when you want to eat unhealthy but still want to be vegan. Came with a couple of friends and had some amazing vegan food. Loaded tater tots with cashew queso sauce and jalapenos. We also had some great fried pickles, a black bean queso burger (yes....more queso lol) and  black bean maduros (get this with the avocado...wow). The drinks were tasty and service was great. I wish I could eat here all the time :)", "pics": null}}, {"review": {"des": "When my niece recommended this restaurant, I thought it was a gay bar--a gay bar for brunch, no way. Well, I was wrong with mixed emotion. What a cute, eclectic, trendy little establishment. As this was my first meal in Chicago, on this trip, I was super-excited to see that they had vegan Biscuits and Gravy. What a wonderful surprise...and was it good? Yes, it was good. I devoured my meal. Everyone else with me enjoyed their meal as well. <br><br>I would certainly go back to Handlebar.", "pics": null}}, {"review": {"des": "Never fails. Blackened Catfish, mac n cheese, broccoli (although I wasn't super crazy about the Asian flare)...bring back the sautéed green beans please!", "pics": null}}, {"review": {"des": "Amazing veg comfort food. Great patio for those days you wanna sit outside and drink and eat.", "pics": null}}, {"review": {"des": "I have also come here for brunch and wanted to add that I am a big fan of their brunch too.  Their Bloody Mary is generous and has so many wonderful toppings like a fried pickle, olives, and a pickled pepper.  I love a loaded Bloody Mary so I was very happy to have this.  It is large though, so you might want to split it with a friend!<br><br>Their vegetarian biscuits and gravy is heavenly.  It's a huge portion, the biscuits are flaky, the gravy tastes like it is mushroom based and melts in your mouth.  We ordered it with tofu and their tofu is crispy, firm, and well-seasoned.  <br><br>We also had the brunch special, which was the Huarache.  It was a masa cake with a refried black bean paste, edamame, red onion, corn, queso fresco and my favorite, radishes.  This dish was a little underwhelming.  I thought it could have been more flavorful and spicier, it was a bit too mild for my tastes but it had potential.  The radishes and edamame were a nice touch.<br><br> I'll continue to go with the dishes that I know here.  They know how to do American really well.", "pics": null}}, {"review": {"des": "I've been here quite a few times, and let me first start off by saying Handlebar is extremely consistent, which is something I always appreciate. <br><br>If you're a vegan or a vegitarian, I would certainly recommend this place. My mom is a gluten-free vegetarian, which basically means when she visits me in Chicago, her only option is a side salad. She's a very picky eater, but she loved the Black Bean Maduro.<br><br>When I'm looking to get a meal here, I really like to start off with the nachos. Aside from the appetizers, I've also ordered the Buffalo \"Chicken\" Wrap, Fried Avocado Grilled Cheese, and the Grilled Fish Tacos. <br><br>Handlebar also has a great drink menu. To be honest, I forgot the drinks I've ordered here, and there isn't a list on the online menu.  <br><br>One thing to mention is that the restaurant's very noisy. That's not something I mind considering my ears have been destroyed by years of going to loud music venues, but I wouldn't recommend it for a first date. People have been downrating the place because they're saying the service is rude. I honestly think that they just can't hear you sometimes - so keep that in mind if you have any questions about the menu (but don't like, shout at the staff).", "pics": null}}, {"review": {"des": "Loved the nachos. Not so crazy about the buffalo chicken wrap. The nachos filled the two of us up and did not even need the wrap. Cool little bar in great neighborhood.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wOc7CRWMLTsxOQVPEuJmuw/348s.jpg", "caption": "Buffalo chicken wrap and vegan"}]}}, {"review": {"des": "We loved this place!  I got the fried avocado tacos and my dining partner got black bean maduro with vegan cheese.  He loved his, although I wasn't a huge fan of that one, I LOVED my tacos!  I also got a delicious drink that was basically a bloody mary, and it came with a fried pickle - YUM.  They had drink and food specials, and we can't wait to go back and try more items.  We had a really tough time picking just one thing each off the menu, because there were so many delicious-sounding items.  We also can't wait to go back for brunch!  Service was the right amount of attentive.  Only negative is that the outdoor tables are mesh, so we spilled on ourselves a couple times - would be awesome if there were placemats or trays under the plates.<br><br>Also, they have bike parking at the back!  We'll definitely be biking there in the future.", "pics": null}}, {"review": {"des": "For my first time, I would give this a 3.5 stars, but rounding up since I will be back to try the other dishes.  We started off with the vegan mozzarella sticks.  Outside crunch was good, solid taste, but the cheese...just didn't do much for me.  Maybe it's because I like the taste of real cheese, but for those that are vegan guess it'll work.  Wanted to originally get the nachos, but it seemed like a huge portion for 2 people.  I seriously cant remember the main dishes we got, one was a black bean with plantains and some other goodness and that was actually really good.  The bf got that.  I got the tofu dish, taste and flavor was good, but it looked they just scooped in a lot of chili paste sauce and it was just too saucy.  I like spicy food, but I don't like my rice literally \"drowning\" in it.  I had to ask for another bowl of rice to mix in with it to make it edible.  We ordered the mac and cheese and that was good.  It had gouda and had a nice smokey flavor, definitely rich and not for those looking for just cheddar/american mac and cheese.   We'll definitely be back.  I'm more of a vegetarian so it suits my needs more, but the bf is excited to try the other dishes they have on the menu.  I kept looking over onto other people's dishes and they literally all looked soo good.  Also, the portions we were received were pretty big we both took our food home and ate it the next day and it actually tasted better.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aQRZ6XQpwIzu63vJC3yArQ/168s.jpg", "caption": "Tofu dish on brown rice w kale"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Qp7svRqF6ilUDBf8h-osqw/168s.jpg", "caption": "Vegan mozzarella sticks"}]}}, {"review": {"des": "I love handlebar.  It's a great spot for brunch on the patio and the vibes are loud.  For Milwaukee folks it's very similar to Fuel Cafe with a more vegetarian/ vegan focus (although they have fish).", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VfpY489fqFOxHjc4mIHaoQ/348s.jpg", "caption": "Wilted Kale with tuna"}]}}, {"review": {"des": "So I been vegan for about 12 days now and wanted to try a vegan restaurant. Came to handlebar and got the Vegan Nachos with Vegan cheese and also got a fried avocado grilled cheese sandwich. <br><br>Let's start with the sandwich it tasted so good it actually felt like a real grilled cheese sandwich and the fried avocado tasted amazing. <br><br>Now the nachos holy cow they were one of the best nachos I've ever had in my life. The fact that they were vegan I was mind blown. I actually questioned if it actually was really vegan that's how good it was. It Had so much flavor. It was so good we went back the very next day and got the nachos again and also the fried avocado tacos which also tasted so good. I definitely loved this place and can't wait to go back and try the nachos. <br><br>I know some people say it's too dark inside. Bu I actually really enjoyed that. It's perfect spot to bring a date. Make sure to get the nachos !", "pics": null}}, {"review": {"des": "This is my kind of place. It's basically the restaurant version of a dive bar, serving great vegan and vegetarian food (as well as some seafood). Believe the server when she says the Sambal Tofu is hot (I like heat and it was just a hair too much for me). I've honestly liked everything I've had, though. If you're lucky enough to be there when they have Pie Pie My Darling's cake in stock, order it! The slice is huge, and it's 100% worth it! It's vegan, so the cake is denser than what you may be accustomed to, but it's moist and delicious! (The reviewer who complained that her cake must have been sitting around in their cooler for a week apparently doesn't realize the cake usually sells out in a couple of days, so there's no way that was the case.)", "pics": null}}, {"review": {"des": "Fried avocado tacos - worth the Uber across town for this vegan food in Wicker Park area in Chicago!!", "pics": null}}, {"review": {"des": "Second time here. Cute place with trendy staff who are proficient but don't necessarily go the extra mile. Food is nice. Love the slant towards vegan in a way that seems tasty and pretty to look at. Enjoyed the outdoor patio space. <br><br>Mean Green sandwich with fries.", "pics": null}}, {"review": {"des": "OMG... if you're vegan or vegetarian in Chicago you NEED to check this place out. It's over in bucktown on the west side of Chicago, so it's a little more removed but definitely worth the lyft/Uber to get over there. It's pretty small on the inside and very hipster but the back patio is my favorite. So ask for a seat outside!! My friend and I started with iced coffee was served as Hellion bottled cold brew poured over ice. It was delicious (see pic below)! We were staarving so we decided to order some vegan nachos with cashew queso. I'm telling you these were some of the most BOMB vegan nachos I've ever had. 10/10 would recommend. They didn't slack on anything either; that plate was loaded up with guac, vegan chorizo, and cashew queso. By the time we were finished we were stuffed.... and then our actual meals came out and holyyyyy sh*t; the monstrosity that is the vegan chimichanga blew me away. It's HUGE! See the pics for evidence! I could barely eat half of this thing and it was amazing. I had to ask for TWO take-away boxes to fit my leftovers just from the chimichanga! Handlebar knows how to do vegan food. I would ABSOLUTELY recommend checking this place out for brunch or lunch on a weekend!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nFVuXP_0pFCQQObaTVvqYA/348s.jpg", "caption": "Vegan Chimichanga"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4-ukm4Lz_fNdPPyk4TWoXQ/168s.jpg", "caption": "Vegan Nachos w/ cashew queso"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vpPTXodYGgBzcHJJLJUOJA/168s.jpg", "caption": "Hellion Cold Brew over ice w/ almond milk"}]}}, {"review": {"des": "I come here specifically for a drink called the Trifecta, it should be renamed the GAME CHANGER though. Guinness, fresh chilled espresso and Jam-o, all in one glass. Smooth and dangerous as hell.<br><br>Been here twice. First, was for Sunday brunch and it was wall to wall, we waited for 2 seats at the bar and just grabbed a cocktail and a piece of Reese's peanut butter cake, damn it was good. And vegan, I think even the dessert was Vegan. Second, was for Tuesday breakfast and we were the only people in the building for the majority of our sit. <br><br>Trippy music plays here, the kind that makes you feel like you're traveling through time and space. I would go here for many different occasions, including just a solid spot to sit on my computer and do some creative work. <br><br>We ordered the Sloppy Joe, Smoked Gouda Mac and Biscuits and Gravy with 2 fried eggs on top. We enjoyed it all and would come back to try more. Large menu with breakfast, lunch and dinner choices. And I believe they even serve some fish items like Shrimp and Grits. Everyone wins.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/H077J8KFAkMa0fJg4poXoQ/168s.jpg", "caption": "Sloppy Joseph!"}]}}, {"review": {"des": "The food and service here was great. Order the grilled cheese (with Munster) and fries. Yum! The portions are pretty large. We decided to dine outdoors on the restaurant's cute patio. Handlebar has specials that run Sun-Tues which is a bummer because the Tuesday burger's description was heavenly. I'll have to go back to try it! <br><br>Would recommend if you're in Wicker Park looking for healthy/vegetarian options.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/30uQ6finj-CmLjl_YJ-Y2w/348s.jpg", "caption": "Grilled Cheese with Munster + fries. Yum!"}]}}, {"review": {"des": "The Loaded Nachos were amazing and I could have eaten a whole second order by myself. The flavors were absolutely there and the vegan queso didn't taste \"fake\" or processed. Unfortunately I wasn't as stoked about the Breakfast Burrito. It was constructed well but i didn't think there was anything special too it. After the nachos it was a bit of a let down.", "pics": null}}, {"review": {"des": "Excellent Fried Pickles and Nachos!!!!! Service was attentive but not overly chatty! I'll be back, especially to enjoy the back patio", "pics": null}}, {"review": {"des": "Handlebar is a grungy little Wicker Park bar that also doubles as a great vegan restaurant. I first visited a few times over 10 years ago and thanks to Pie Pie My Darling bakery wholesaling here I visited again this weekend. The food is just as good as I remember it. I love the comfort foods like biscuits and gravy paired with their unique creations like the blackened tofu (deep fried tofu cubes tossed in wicked hot blackening seasoning.) <br><br>It is a bar, so be prepared for loud music. The service is kind of laid back, which I prefer over the kind of service that leaves you feeling like they want to turn over your table over as fast as possible. Our server did stop by occasionally to check on us, but when it had been a while and we needed something he was happy to be stopped by someone at our table.", "pics": null}}, {"review": {"des": "We really love this restaurant. We've been coming here pretty regularly on weekends for a year now. It's out standard post long run meal. Of all the veg-friendly restaurants, this ranks among our favorites. The food is great with both healthy and non healthy options. More than half the menu is vegan or veganizable.<br><br>We want to give this place 5 stars but recently, the ambiance has gotten almost intolerable. The music is so freaking loud I can barely summon enough brainpower to pick the item off the menu. The staff is cool about lowering it but it is extremely unpleasant to have to walk in to the absolute racket. I have no problem with the choice of music, just the decibel. <br><br>We will literally have to stop coming here if the volume doesn't resume normal levels which is incredibly sad.", "pics": null}}, {"review": {"des": "We love trying vegetarian restaurants. When we moved to wicker, we were super excited to try this place right away. Let's just say this place is eclectic-- definitely a different crowd but really a cool place. They have brunch and a good beer and drink list. We went for a late lunch so had the lunch menu to choose from. <br><br>Everyone was satisfied with their food, but not in love with any of it. The sandwiches have a LOT of bread and not too much substance really. We'll probably go again down the road and try some new options. Hopefully for dinner!", "pics": null}}, {"review": {"des": "Oh my god, their vegan nachos are perfect! You will most likely have to wait for a table, but it's worth it! Everything was delicious. I love that so many things are or can be made vegan. I've been here twice. The first time, I got the nachos for dinner, and the second time, I got the vegan chimichanga for brunch and split it with a friend. It was definitely enough food for the both of us. Their coffee is good, too. The servers and hosts have always been friendly too. I'll be back next time I'm in chicago!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4msKHIpU9YdTsR0YJEm9kA/168s.jpg", "caption": "Vegan nachos the way they should be - piled high! I hate when restaurants skimp on the toppings. Handlebar does it right!!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Yld6NqBc-QE-jNWsjLWGmg/168s.jpg", "caption": "Vegan chimichanga for brunch. Definitely large enough to split! It was so delicious."}]}}, {"review": {"des": "First things first, I'm such a sucker for a good omelette. The roasted mushrooms were perfectly roasted and paired with the scallions in the omelette, it was a fragrant blend of delicious. And you can never go wrong with that Wisconsin cheese (insert Wisco pride here!) The breakfast potatoes are really unassuming in appearance but actually were some of the best that I've had since I've been in Chicago. They were crispy and just the right amount of salty, and cut in the perfect size!<br><br>I was getting really good vibes from the space, and based on the fact that we had to wait 30 minutes for a table meant that others felt similarly. I think that the music was a little loud at times and made it hard to have conversation, but it was a minor detail. I loved all of the artwork and posters from events past, it really shows their dedication to local pride. The service was fast, the atmosphere was upbeat, i definitely want to return in the future for their night scene!", "pics": null}}, {"review": {"des": "So, I'm vegan for the week and I was looking for a fast food option and happened upon this place here. Honestly, I've been looking for a particular dish and apparently it's not in season. Any hoo, I'm still trying to live the vegan life, so we're here. All I can say is,I'm happy as all get out. I would post pictures, but we demolished our food. We had the nachos and the fried avocado grilled cheese sandwich with a side of smoked Gouda Mac and cheese(not a vegan dish, oops). Everything was good and gone. We've passed this place enough to be back.", "pics": null}}, {"review": {"des": "The last time I was in town we tried to eat here but the wait was too long and I had a plane to catch.  I finally had a chance to visit over the weekend and was not disappointed.  It's not that easy to find good vegan fried pickles and I had been dreaming about them for weeks.  I must say they lived up to the hype.  I shared a vegan grilled cheese with a friend and it was fine but I tasted a bite of my friend's Nashville Hot Fried \"Chicken\" sandwich and wish I had ordered that instead.  The flavors were phenomenal!   The fourth friend in our party ordered avocado tacos and was very pleased.  We finished with a slice of Snickerdoodle cake from Pie, Pie My Darling.  I can't wait to visit again for some more pickels and a Nashville Hot Fried \"Chicken\" sandwich of my very own.", "pics": null}}, {"review": {"des": "Customer service needs to be reconsidered.  The overly self- important hipster serving as hostess would not even consider to seat 2 of us in an empty 4-top table, though we were the only ones waiting--there were no parties of 3 or 4 who could have made more use of the table. So....<br>the table sat empty and we stood waiting...", "pics": null}}, {"review": {"des": "I love Handlebar - it is easily in my top 3 Chicago veggie joints. I've been frequenting this restaurant for over 5 years now and it never disappoints. Even after moving out of state, I still make it a point to visit when I am back in town! <br><br>My recommendations:<br>- apps: fried pickles, nachos (my fave vegan nachos, ever)<br>- salad: everything green!<br>- sandwich: chicago style tofu<br>- entrees: sambal tofu, ground nut stew<br>- brunch: vegan bfast burrito, chimichanga, biscuits & gravy<br><br>Another plus - they not serve Pie Pie My Darling cake slices! It just keeps getting better :)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/2xs_alEvqbb0S9f9I8J43g/348s.jpg", "caption": "Soy latte, Pie Pie My Darling cake, bloody mary, Chicago style tofu sandwich with side of collard greens"}]}}, {"review": {"des": "I love the ambience, the food, the service! In the summer there is a patio in the back that is a secluded serene place to eat and visit with friends. What more could a Chicagoan ask for, particularly a Chicagoan who follows a pescatarian diet, with vegan and vegetarian options?<br>No meats to be found at Handlebar! <br>Tuna and a catfish fillet, maybe.<br>The vegetarian chili is wonderful and very flavorful. The huevos diablos come in two options. They are wonderful. My favorite breakfast is the roasted mushroom omelet with cheddar cheese, substituting black beans for the potatoes and a house made biscuit for the toast.<br>The coffee is Intelligentsia and espresso is available! Breakfast is available until 3 PM! A terrific location for all breakfast lovers and late risers. Brunch specials are offered on weekends.<br>There are dinner specials Monday thru Thursday. The guacamole, nachos, Chili Mac, and sandwiches are soooo tasty! Really I've never been done disappointed by anything I've ordered at Handlebar! <br>I highly recommend Handlebar and do try the chocolate cake!!!", "pics": null}}, {"review": {"des": "This is a pretty small hip bar / restaurant. The menu had a good variety of options including plenty of vegan options! We came here for the Bloodys and they sure did not disappoint, so good! That fried pickle they too it off with, yes! And we stayed for dinner. We stopped in here on a weeknight just in time (maybe 5ish?) before the rush. This please filled up fast and was awkwardly packed! The (vegan) fried avocado tacos, another yes! And the (vegan) nachos were alright, too. And the Guajillo Michelada was pretty darn good too! Great little spot, I definitely recommend it!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Myj6Nt3b9eBQG7LxeCqQig/348s.jpg", "caption": "Their Bloody Marys, yes, so good, topped with a fried pickle!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2hY6zgAES3kQjP-rc8QkkA/168s.jpg", "caption": "Good drinks!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JZpMlUXDkteNzUmJXojaMw/168s.jpg", "caption": "Vegan Fried Avocado Tacos"}]}}, {"review": {"des": "This place is the most ridiculously pretentious place when it comes to their seating policies. Don't go here with a group of more than 2 because they will seat everyone else before you. I came with a group of 6 and they refused to seat us in the open tables because they \"couldn't push the tables together\" I asked if we could sit with them separated they said no \"those tables are for parties of 2 only, the wait for your group is 25 minutes.\" They continued to seat other people before us.<br><br>UPDATE: after making us wait, they promptly did what they told us they couldn't do and sat a group in the tables that \"weren't allowed to be pushed together.\" WTF", "pics": null}}, {"review": {"des": "Cute little spot. <br><br>Nachos were good. Usually can't go wrong with nachos. <br><br>Country fried Portobello dish I got was okay. I personally wasn't feeling it. Strong pepper taste. Perfect if you like that kind of dish. A bit dry.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/L6H8XPYlDXt2iY4aEi9dvA/168s.jpg", "caption": "Country fried portobello"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/umEgwIPKty5UdQRzTQPzeA/168s.jpg", "caption": "Nachos"}]}}, {"review": {"des": "Friday night.  Waited at bar for 20 or so minutes to be seated. We received the table that's the first one upon entering the front door, next to the hostess stand and foot traffic. Usually having the worst table is ok, but the night was cold and every time the door was opened a cold draft hit my back. <br><br>We had appetizers already and I tried to shrug off the cold for a bit but it was uncomfortable. I asked the hostess for a new table. The hostess was a blonde in her 20s with very curly hair and typical hipster clothing. She said that she would have to put me at the very end of the waiting list for a new table. <br><br>I said \"really?\" And she said yes and laughed at me. I said \"please don't laugh at me.\" And she went off and yelled \"are you serious?!\" She refused to get the manager the first time. I did see her complain about me to other staff and it wasn't until I asked again for the manager did someone come. <br><br>The manager came and to his credit fixed the situation. He did not make us wait at the end of the line, but moved us when a table became available. <br><br>The food was just ok. My partner's meal had what tasted like canned sauce. My dish lacked flavor. <br><br>I had enjoyed this place in the past but will no longer visit.", "pics": null}}, {"review": {"des": "For vegitarian actually pescitarian, or I really want to be a vegetarian but I like burgers and chicken wings, and Chicago Dinner ripped a hole in my insides but I'm trying to be a better person- this is probably your new spot. Also a good amount of vegan options! The seared tuna sandwhich is the best fish dinner in the city, and its 15 bucks. They have neat beer and fried pickels, oh and they have the chocolate cake from Matilda. It will be good for you. Your farts will destroy whats left of your joyless relationship. <br>The service is kinda slow but hey dont be a dick and enjoy the people your with instead of placing micro aggressions on strangers!", "pics": null}}, {"review": {"des": "Sam and I are walking down the street, hungry as ever on a beautiful Sunday morning, and on our way to a well researched brunch place when ALL of a sudden, we see a group of some punk rock kids huddled around a door. We laugh about it, and walk past, then pause. <br><br>Why the fuck is there a crowd at 10am?? Is this a brunch place thats been missed on our Yelp radar?? We play Rock Paper Scissors on whether or not to be spontaneous - and Handlebar wins.<br><br>The place is COOL. The aesthetic is COOL. And guess what??? ITS VEGETARIAN, BITCHES!<br><br>Sam's a meat eater. He would never step foot into a veggie-only place. However, this motherfucker is trapped. We already waited the wait and we're SEATED before he finds out. <br><br>He panics until we look at the menu. Holy fuck. What's happening?? We're disheveled! Everything is blowing our minds!! What do we get??<br><br>I get the chimichanga. Goddamn. That was a meal that I had to sit my knife and fork down and say, \"This is the best goddamn breakfast I've had in a long time.\"<br><br>Sam gets a sausage and egg sandwich. He's never had fake meat, but the man is in love. It's seasoned perfectly and he can't tell he difference.<br><br>I love this place, now. And I'm coming back with tattoos and a patched, jean jacket. Maybe pink hair.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cYezkvUpYjGMFqwX3RRbCw/348s.jpg", "caption": "We're rock hard for this place. Punk rock hard for this place. So punk rock that Sam needs to keep his sunglasses on to fit in."}]}}, {"review": {"des": "I've visited at least 4 times and have enjoyed the food and service each time. I'm vegan and I've been accompanied by vegetarians and an omnivore. <br><br>I've tried a different entree each visit. Can't go wrong on Sundays - go for brunch and/or the evening taco & tequila special: two fried avocado tacos, a shot of tequila, and a Tecate!<br><br>Dined inside - small, tight seating, loud (due to music & conversation) but not obnoxious. <br>Dined outside - great space for the warm months. <br><br>Always a pleasant experience.", "pics": null}}, {"review": {"des": "Love this place:  their menu, patio, decor, except their super super super loud heavy metal music. I don't mind that you are setting a mood but so distracting to the point of desperation. I have to mentally prepare for it every time I come.  <br><br>I would come back more often but your volumen of music is way too high for my own sanity. <br><br>My recommendation is bring earplugs or ask for patio sitting which surprisedly is serene and quiet.", "pics": null}}, {"review": {"des": "Solid vegetarian cuisine with cocktails. There's a very nice patio here as well. <br>There's a daily drink special and all of the yummy things you'd want on a menu, vegetarian or not. <br><br>I love their vegan cheese sauce. It's as satisfying as eating real nacho cheese, minus the stomach ache.", "pics": null}}, {"review": {"des": "While the chilaquiles were well-prepared, and the serving size was hearty, the entree was still entirely over seasoned. No need to spice up an objectively perfect dish, and not even list spice in your menu description! Really strange.<br><br>Personally wasn't crazy about the grudge background music. Set a slightly funny mood for casual brunch.", "pics": null}}, {"review": {"des": "Dude! Handlebar is our go to restaurant when in Chicago late at night, and other times. Tons of vegan food and it's all outstanding. Great atmosphere, always busy but there's always a table available when we go. There's an outdoor area in the back too. I highly recommend the nachos and the fried pickles.", "pics": null}}, {"review": {"des": "As a flexitaraian (which is millennial for vegan sounds cool but I have the self control of a two year old starved for a day when confronted with a piece of meat) I look out for good vegan and vegetarian options. I was excited to find handlebar and ordered for delivery. I got the wilted kale salad and fried \"chicken\". The fried \"chicken\" was not what I was used to and didnt resemble  chicken at all, it was more like a tiny miniature falafel (how cute!), so take that how you will. I also got wilted kale salad, it was good but bland. I Added my own spice and flava! <br><br>Bottom line: good vegan/vegetarian options but lacks flavor.", "pics": null}}, {"review": {"des": "First thought walking in.. this place smells  like sour musty smell. Couldn't handle this odor . Stinky.", "pics": null}}, {"review": {"des": "It's hard living in this neighborhood and being surrounded by soooo much good food. Get the buffalo chicken wrap, the mac and cheese, and the broccoli. That is our go to order. It will never leave you upset. But definitely leave you full of deliciousness. Our next mission is to go here on a Monday night because of their chili mac night. Super excited to try it for the first time. They've got some of the best mac in this city.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cFXFc4dU8IgYYXiDDfEKPg/348s.jpg", "caption": "She looks beautiful here"}]}}, {"review": {"des": "I accidentally ordered the wrong food item but still ended up loving this place. There was evena short line before the place even opened which goes without saying that other people love this place, too. <br><br>Next time I'm there, I'm going to try the vegan breakfast burrito with seitan chorizo! Exciting! Also, take advantage of the outdoor seating in back!", "pics": null}}, {"review": {"des": "Came her for the past 11 years. Always used to slide in the back since I cycle and grab a table for a coffee. Hadn't been in for a while so I thought this was acceptable and there were about 10-12 tables available so it didn't seem like there was a wait. Got scolded by a server after she dragged us up to the host counter so that we could say \"table for two, patio\" and be sent back out to the patio. Just wanted a coffee. Since it took so long to get through this we ordered food...food is still good. Just don't like being scolded for a pretty honest mistake...People don't go out to spend the little money they make to be mistreated by waitstaff...This place was an old favorite.", "pics": null}}, {"review": {"des": "Still awesome! Although with my age..... the night time at this place is well a bit dark and hard to read the menu.  Ha! This time we got the fried avocado tacos, and the black bean tostadas app along with the fried plantains and collard greens. Yum, Yum, and more yum!", "pics": null}}, {"review": {"des": "This was a fantastic breakfast for my vegetarian family. <br><br>We enjoyed great service on a rustic and beautiful back patio with constant refills of our water and coffee. My husband had a delicious bloody mary with a fried pickle! <br><br>All of our food was made from scratch and the re and time was obvious from my son's HUGE egg and seitan sausage sandwich on yummy bread to the sides of the most scrumptious breakfast potatoes I've had. <br><br>I had the pepitas and it was phenomenal with delicious peppers and fried onions. Husband he a huge and savory breakfast burrito and another son had the half order of biscuits & gravy. All the food was unique, with huge portions. <br><br>So happy we discovered this place!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nWXKoCJsetSfnfSh3cEYQQ/168s.jpg", "caption": "Half order of biscuits and gravy."}]}}, {"review": {"des": "I can ride my bike straight to handlebar. To handlebar. To handlebar.<br><br>The good: Sandwiches, especially ones with avocado. Also two of the sides we got, the gouda mac and even the black beans, were also very good. The gouda mac was well-balanced with a very mellow cheese profile that was flavorful without being so decadent that you didn't have to stop and wait after each bite. <br><br>The meh: The chili wasn't particularly notable. In fact, I enjoyed the much simpler black beans moreso than the chili. Also while the buffalo 'chicken' wrap was good in composition and texture(the seitan strips were still crispy), it had a bit too much buffalo sauce that it overwhelmed the wrap and actually made it a slight touch sour, due to the vinegar in the sauce. Cutting back on that by about half or so would have been an improvement<br><br>All said, we were thoroughly impressed by their vegan food, and even wished that their breakfast and entrée menu were available, because some of their options(fried avocado tacos, sambal tofu, chimichanga, diablos) also looked fantastic. Same goes for the nachos. But that's a tale for another visit", "pics": null}}, {"review": {"des": "I've only had one experience here, and that on a Friday morning, but that experience was great so I'm on board. <br><br>Whenever I go to Chicago, I usually wind up in Wicker Park, and after a night out nothing sounded quite so good as some delicious breakfast. I'd read up about Handlebar being veg-friendly, so my partner and I headed over to check it out. Casual bar/restaurant, spacious, easy to get to. The menu had a good variety of options, but breakfast and otherwise, and the food that came out was delicious. I had the vegan pepitas scramble with spuds and toast, and it was exactly the kind of quality content I was looking for. <br><br>Thank you, Handlebar! I'll be back again.", "pics": null}}, {"review": {"des": "Good vegan food and huge quantity! This was the first time I had to ask for a togo box for vegan food.. their gravy is amazing .. so any item in the menu with \"gravy\" in it would be my suggestion!", "pics": null}}, {"review": {"des": "Went to this place with three friends on Thursday evening.  The thing that lured me to this restaurant was the extensive vegetarian/vegan menu. So many mouth-watering options.<br><br>Our order: Friend pickles, Chilli Mac Attack, Sloppy Joe, Fried Avocado Tacos, and a salad (can't remember the name!). All were delicious. <br><br>I definitely want to visit again and try other items on their menu!", "pics": null}}, {"review": {"des": "A great place for vegan and vegetarian cuisine. I wouldn't go as far as to say that the food here is healthy (a common misconception of the sans-meat lifestyle), but it sure is good! If you're coming during normal feeding hours, you'll most likely have to wait for a table because this place is hopping. I got the fried avocado grilled cheese with a side of black beans, and it was delicious. I actually had a hard time deciding what to order because everything on their menu looked divine. As with a lot of vegetarian menus, there was a heavy presence of mexican-inspired items. I wasn't too impressed with their draft beer selection, but if I drank cocktails, there were quite a few interesting choices.", "pics": null}}, {"review": {"des": "Incredible food! The vegan diablos and huevos diablos were absolutely killer! My boyfriend and I ordered the same dish--but mine was the vegan version. If I lived in Chicago and had access to places like this all the time I'd probably be fat and broke. The local music inspired vibes along with amazeball food and friendly service made this an unforgettable experience. I can't wait to visit again soon!!", "pics": null}}, {"review": {"des": "This was some of the best food I've ever had, not just vegan, overall. First off, there were so many appetizing options I was overwhelmed. It was so hard to choose! I settled on the vegan chimichanga. It was seriously amazing. It was ginormous, I only ate half then and the other half for dinner later. The taste, the texture, it was so tasty. The vegan queso was so good as well as the vegan chorizo. I hope I can go back and try more delicious looking items at this spot!", "pics": null}}, {"review": {"des": "the vegetarian entrees here are amazing! loved the full flavour they have in the dish, especially the black bean maduro one is awesome, the sweet plantain mixes really well with the black bean and the diced tomato. the sambal tofu entree is amazing too, a bit on the salty side, but the sour and spicy flavour is amazing<br><br>the ambience is very hipster and the wait can be long during peak hours", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/m82AVJOJlJXqIR87TS2T7Q/168s.jpg", "caption": "Sambal tofu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wcs1aJ2_dJRZoOYg1lp5XQ/168s.jpg", "caption": "Black bean maduros"}]}}, {"review": {"des": "Casual vegetarian restaurant and bar with a quaint patio in the back. <br><br>Most of their options are vegetarian, but there are a handful of fish or vegan options too. And believe me they have avocados.. fried, fresh, mashed, mushed, you name it! <br><br>I had the Black Bean Tostados with real cheese (pass on vegan \"cheese\", thank you). They were really tasty, crispy, bean-y and of course.. avocado-y. It was easily split between 3-4 of us for an appetizer (it comes with 3 tostadas).<br><br>I ordered the Green Meanie for myself, which is avocado (surprise, surprise), goat cheese, spinach, tomato, sprouts all on a very grainy multi-grain bread. I enjoyed the avocado & cheese obviously, but was slightly distracted by the mound of sprouts. I would probably venture out and get something different next time. <br><br>Wednesday night is $3 draft beer night, which was an added bonus! Looks like I've found a new Wednesday night spot!", "pics": null}}, {"review": {"des": "Been eating here since they opened. Seriously great people work here and the menu has something for any mood.", "pics": null}}, {"review": {"des": "This place is amazing. Love the variety of great options to try here. The Chili Mac is where it's at for sure. You can fill up and feel light on your feet for sure. They have some amazing deals during three week to.", "pics": null}}, {"review": {"des": "Have been here around a dozen times and the food is always great. Had to write a review this time bc I got carryout and after eating noticed all the containers are reclcleable. After a quick rinse I stacked all the boxes and plastic containers in my recycling bin (the boexs all had the appropriate recycling #s), this alleviates a bit of anxiety I have every time I toss a bunch of take out containers. I really appreciate echo friendly businesses!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EpVHbkmitLfX-J5HDC9Vdw/348s.jpg", "caption": "My carryout rinsed and in the recycling. @handlebar thanks for being echo friendly... I hate throwing out carryout containers"}]}}, {"review": {"des": "Super cool place. Nice bar area. Delicious food. Awesome people. Definitely recommend to get the buffalo \"chicken\" (vegan) wrap or the samba tofu.", "pics": null}}, {"review": {"des": "The food is good. Basic, but good.<br><br>But let me start by saying that I wish I knew the atmosphere beforehand. It has a dive-bar feel, lots of posters, super dark, and loud music. Not deal-breakers, but I had my Mom and Aunt with me after seeing a musical, and they felt totally out of place and uncomfortable.<br><br>We came because they had vegan and non-vegan options - great for late night eating. Again - the food is good for a place that's so small and crowded. But the menu items are pretty basic. {No photos because it was too dark} But again - my Mom and Aunt felt a little intimidated by the eclectic hipster/rock 'n roll crowd. I'm guessing that the locals probably love this place. <br><br>But I will also add, that at the end, we were really turned off. When we saw the hostess bus our table next to us, she poured the water glasses back into the water carafe, take the carafe to behind the bar, and then find it's way back to the next set of guests. Ewwwww. After that - no one drank their water, and my brain than began to question the cleanliness of the kitchen. *This* was the deal-breaker. I was glad I only ordered cheese fries.", "pics": null}}, {"review": {"des": "Love this place! The food options were great especially for my family members who are vegan and vegetarian. The food was delish and the quality of produce is amazing. I personally had the grilled cheese with avocado and spinach. I also ordered the cheese fries, which hit the spot. If you visit try their patio out back. Great place to go to.", "pics": null}}, {"review": {"des": "Let me start this review by saying I am not a vegan or a vegetarian and neither is my boyfriend. But I lovedddd this place. I don't mind eating vegan but occasionally the texture can be off and I don't love that. Not here! We started with the fried pickles and they were delicious. Would definitely get them again! For my meal, I had the sloppy joe. The texture was perfect and even my meat lover boyfriend thought it was really good. I had a side of cheese fries and they were perfect. I really had nothing bad to say about my meal. My boyfriend got the fried avocado grilled cheese, I liked it but he thought it was just okay. For a side he got the Mac and cheese, don't skip this! If you like smoked Gouda you need to try it. It was soooo creamy and the perfect consistency. Honestly better than some Mac and cheese I've spent $$$ on. Also the side portions are huge!  <br><br>Loved it and can't wait to go again and try more.", "pics": null}}, {"review": {"des": "One of my favorite bars in Chicago. Excellent selection of craft beers and interesting cocktails, as well as a full menu of everything from salads to sandwiches to late night snacks and desserts. Almost anything on the menu can be made vegan, and their kitchen is open late. An ideal spot for late night food in Wicker Park. <br><br>I appreciate that their full menu is available even after midnight on a Saturday. Most people associate bar food with fried greasy unhealthy options (which are totally available here as well), but it was refreshing to be able to eat a proper meal after starving all day at a music festival. I had the Chicago Style tofu sandwich, which was fantastic. Flavorful basil pesto tofu with fresh veggies on a delicious ciabatta bread. My friends ordered various vegan entrees which all looked delicious. Service is very fast and friendly.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uwqOygxMoo3dbGgerQNfwQ/348s.jpg", "caption": "Chicago style tofu sandwich with greens"}]}}, {"review": {"des": "Ive went here a few times now - always happy with the food here and have left feeling awesome!<br><br>Specials: the sunday night avacado tacos w tecate+tequilas are amazing. Tacos are flavorful and the tequila is a good combo along with a tecate chaser. There used to be a fish n chips special which was my fav but it is no longer offered :(<br><br>Cocktails: i havent been disappointed so far, the crabbiea primm cup is awesome.<br><br>Water service: they give you two filled cups and a carafe full of water-you dont run out and Im a camel<br><br>Chili mac attack - great savory cheese taste with some crunch of tortilla chips and spiciness from jalapeños. This is one dish that generates random cravings during the day to come back to the restaurant<br><br>Grits - so-so grits, they come out warm and are just alright<br><br>Green meanie - one of the best vegan sandwiches - the avacado and whatever sauce they put in is awesome", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/asx0N9ALqmzWdbGwdNw9WQ/168s.jpg", "caption": "Chili mac attack"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sqw8ZUoxdjJgLtOw2dmV-A/168s.jpg", "caption": "Tequila with tecate on Sunday Night specials"}]}}, {"review": {"des": "This place was funky. We are vegan, and I appreciated that they had a large assortment of vegan options. We ordered the nachos as an appetizer, but it was big enough to be a meal. We got breakfast burritos. The plus side is that the portions are GIGANTIC. The nachos are out of this world good. The burritos were just halfway good. Both of us tried the nachos and were regretting that we didn't order the nachos for ourselves rather than the burritos.<br><br>I almost feel like the 4 stars is a little too generous though. The food is certainly worthy of four stars, and the service was good too. So I stand by the 4 star rating.<br><br>However. And this is a big however, the ambiance of the place is...well, it's not what we were looking for and I doubt most vegans will like the ambiance. It feels more like a bar, complete with loud music and an actual bar. Not exactly the typical vegan breakfast, and the ambiance really detracts from the experience. I kept expecting a bar fight, and even though there weren't any drunk folks acting badly, it just seemed like they are a bar that suddenly decided to do the vegan thing. And not a sports bar either, like a rowdy \"Cheers\" style bar, only with really cramped spaces.", "pics": null}}, {"review": {"des": "If clean eating and a cool environment is what you're looking for, this is the place for you! I enjoyed their house margarita and their shrimp and grits was a new approach of the traditional dish. I went with my friend who has a dairy and egg allergy and since their menu truly caters to vegan diet, she was able to truly enjoy herself and that made me happy!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/t5y8nK4v6_lFbEvBjmn0Iw/348s.jpg", "caption": "Blacken catfish was good too. A little spicy for my low tolerance of heat but my fiancé seemed to ty like it!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LS-8Q2a9S71ZYDAJaSqyLA/168s.jpg", "caption": "House margarita... with a little of tajin on the border"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zsabngsHIDAFUJTFPQNkIQ/168s.jpg", "caption": "Shrimp and grits were really good! I wish it had 2 more pieces of shrimp."}]}}, {"review": {"des": "Dark atmosphere, good creative food. Got the green meanie and it was a delicious sandwich - avocado and sprouts and some good sauce - highly recommend if you like sandwiches!<br><br>This place will make you forget that it's vegan- nothing lacking or missing at all. But don't think vegan means healthy, some dishes are definitely not!<br><br>My husband got the chili mac attack and the pasta was soft and chewy. Delicious.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3ThhBwxQ8Y85nJIydjMTdw/348s.jpg", "caption": "Green meanie with fries. Sandwich is excellent, fries are just okay- would not recommend the fries"}]}}, {"review": {"des": "The food is nothing extraordinary, it's good if ur drunk or high tbh don't go here if you're looking for good comfort food, try Chicago diner instead.... I tried the Nashville chicken, super plain and the piece of \"chicken\" was super burn and just a sad little piece of fake chicken (which I've tried wayyyy better). Don't recommend.", "pics": null}}, {"review": {"des": "Looked it up, looked good. <br>Went to try and yup it was good! So many vegan options! Comfort food loveeeee <br>Had the chimichanga, and my partner had fried avocado sandwich. Ohh the fries are to die for!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EdvdkViEobcQxlTxObcvmw/168s.jpg", "caption": "Fried avocado sandwich, amazing fries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fFq_DBEDe7hmLiIlW4yDTg/168s.jpg", "caption": "Chimichanga (vegan)"}]}}, {"review": {"des": "Food is good...BUT...it's a hole in the wall which means their seating rule sucks! The more ppl you have in your party, the quicker you get seated. So, if you're a couple waiting to be seated, you will not get seated regardless of how long you've been waiting. They seat bigger parties first. See the pic attached of how we waited for at least 35 mins while a visible table was clean and waiting for a party of 3!!", "pics": null}}, {"review": {"des": "Amazing!!! Delicious meatless meals!! Fresh food, large portions, inexpensive, attentive and knowledgable staff, quick service, small casual restaurant, bar area, outdoor patio, and parking right out front. I will be returning!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Z-YntRhhcmaHV2-An3ydJg/348s.jpg", "caption": "Buffalo 'chicken' wrap with greens & he got the sloppy joe with fries; both were amazing!!"}]}}, {"review": {"des": "The food is awesome, but the service was so terrible that I would have a hard time going back. The waiter forget to bring my friend's drink after being reminded 3 times and having to re-confirm our order 5 minutes after taking it because he said he couldn't read his own handwriting. When we finally got the bill he comped the beer (which was nice!), but then had added other entree items we hadn't ordered. <br><br>We asked how he wanted us to indicate how we wanted the bill divided since there were 4 of us, but when we followed his instructions he came back and yelled at me for making his job harder, threw the bill on the table and told me to do it again, only for us to also discover that he had put someone else's CC with ours. When he came back to pick up the bill he apologized for getting angry at me (ok, thanks, but it's a little late for that), but then took 20 minutes to run the check. When another waitress brought it back to us he had charged my friend with the forgotten beer an extra $9. Meanwhile, at the table next to us a woman was returned her bill with the wrong CC *twice*. We finally ended up giving up and my friend just signed his receipt because we couldn't get anyone's attention and by then we'd been there for 2.5 hrs. <br><br>Look, I've worked in service: bad days happen. But if you are returning multiple CCs to the wrong tables, yelling at customers, and then overcharging them after a verbal discussion of the bill, it's a little much.", "pics": null}}]}