{"name": "hendrickx-belgian-bread-crafter-chicago", "reviews": [{"review": {"des": "Solid croissants!<br><br>My sister and I visited this bakery on a Sunday at around 1pm.  There were a few people eating outside at the tables but it was empty when we walked in.  <br>Since we took the bus here, I'm not sure what the parking situation was like.<br><br>The shop interior was decently sized with a few tables and chairs.  <br><br>We came here specifically for the croissants.  My sister had done online reconnaissance beforehand and wanted the Pistachio Chocolate croissant and the Almond Chocolate croissant.  She had read that you have to get there early for the pistachio one because they often sell out.  Lucky for her, despite getting there late, they still had both of them.<br><br>The pistachio croissant was very good.  It was different, not exactly what she expected.  She thought bread was chewy but still thoroughly enjoyed. She saved the almond croissant for tomorrow but I know if I don't post this review now, I'll forget.<br><br>Aside from the croissants I eyed several other tempting goodies, both refrigerated and room temperature. <br><br>Service was very friendly , personable, and helpful.<br><br>Rounding up from a 4.7, this little bakery rates a 5.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/E1U6IZJ7qGaQWFfsYXQJMA/348s.jpg", "caption": "Pistachio chocolate croissant"}]}}, {"review": {"des": "Its a nice little pastry shop with wide variey of things they could offer.  I got their chocolate croissant and it was good. It was well worth the price. One of the main attraction to this place is that they have junior master chef's walking around the place who are very talented, professional and can make you anything. I will i had space to try everything on their menu. <br><br>I am knocking off one star is because they have a weird way of getting to the sit down area through the kitchen.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/U8DbJfUpS8NbQIMhM1PGcg/348s.jpg", "caption": "More menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yuXMHgKuQLH0FwJe0BPhpQ/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BBCO-CLG8O3VVT4SuPSoUA/168s.jpg", "caption": "Front entrance"}]}}, {"review": {"des": "I don't know how many times I've walked by this bakery without actually noticing it! I only found it today on Yelp when searching for cafes, despite living in the neighborhood for over a year.<br><br>I got a salami and french butter sandwich and zuchini soup. The bread was very dense and thick. The sandwich reminded me of ones I ate in Paris - simple, but delicious. Soup portion was huge - I could not finish it! My fiance got a plain Belgian croissant; it was good, but he was a bit disappointed because they only offer waffles and crepes on the weekends.<br><br>Overall, I feel that prices could be lowered slightly to be more competitive with other cafes in the area. Our total was ~$20 for the sandwich, a croissant, and soup. For now, 4/5 stars; more great visits may warrant at 5 star review! :D", "pics": null}}, {"review": {"des": "What a lovely bakery! So glad we stopped by here. Like others have mentioned a bit hard to find. It's on a raised patio behind columns. Look for the orange door!<br>We had lunch here. The lady working here was lovely. Upon finding out it was our first time there she took the time to explain their goods and even kept the tab open since we wanted to take baked goodies to go. Tried the egg salad and curry chicken salad sandwiches. They were both yummy and the bread was so soft. We were surprised at the size of the sandwich. Definitely filling! I then got the pistachio croissant, almond chocolate croissant, gruyere croissant and the apple turnover to go. Devoured all on the plane ride back. They were very flaky and soft, and the fillings weren't overwhelming which I liked. The sweets were not too sweet either. Loved this place. I would be in trouble if this was close to my place of residence.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uyES-b2VU8n3Yy4istZIYg/348s.jpg", "caption": "Updated menu- specials and beverages"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MSxW2FTvE-KQhmtcPGVOoA/168s.jpg", "caption": "Updates menu- baked goods"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OFc2EdEY0qmRT9cup9necA/168s.jpg", "caption": "Updated menu--salad, sandwich, soup"}]}}, {"review": {"des": "one of the best bakery in Chicago. They are known for their buttery flaky croissant with a variety of flavors. My favorite is pistachio but that one always sold out in the morning. They recently started selling chocolate croizang (zang zang bao--a online craze started in China, the croissant is covered with chocolate and coco powerder, and filled with cream and chocolate) kinda pricy but is worth trying. <br>I was pleasantly surprised by their croutons--they seem to be made of croissants. Loved them!<br>Will come back to try their sandwiches and soup!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/o27inTrKhMEzoLpCwHxp9A/348s.jpg", "caption": "Croutons"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TXZ-RLc4zDefs677F8ddPw/168s.jpg", "caption": "Zang zang bao"}]}}, {"review": {"des": "I fell in love with this place years ago when I lived in the gold coast. <br>So glad to see they ate still around!<br>They have incredible baked goods.<br>No complaints...everything flavorful and fresh.<br>One of my faves Is the goat cheese, honey and pistachio sandwich. Ofcourse on their homemade bread. <br>Outstanding!<br>Love, love, love this place! It's a taste of Europe in Chicago.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HyT7YGsFzUFdXgM7oigBUA/348s.jpg", "caption": "Goat cheese, pistachio, honey sandwich"}]}}, {"review": {"des": "Delicious croissants! The ham and cheese are wonderful bc they cut open a plan croissant and melt the ham and cheese in the middle fresh every time.", "pics": null}}, {"review": {"des": "A nice little bakery with lots of seating! We tried the almond chocolate croissant, which was perfectly flaky and delicious. We also had the salted caramel dark chocolate macaron, which was very large for a macaron, but wasn't anything spectacular in flavor. They had other flavors that might be worth a try, like lavender, pistachio and rose water. They have a little sign up and if there is a check mark next to the flavor, they have it in stock.<br><br>I wanted to try the decaf Belgian drip coffee but they ran out and didn't tell me until after I had already paid. They offered me a decaf americano instead, which is cheaper than what I paid, but fine. It wasn't very good though. It was quite bitter. Also they only fill the small to-go cup halfway so it didn't feel like very good value. Another customer before me ordered americanos and was not pleased with the amount she received either. <br><br>Overall, this is a nice bakery to pick up a quick dessert to eat, or you can sit at one of the two tables inside or one of the many tables outside and people watch! On weekends they have Belgian waffles and crepes too- both sweet and savory.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/q7ZUEBK-C4LNCv8eP-yzOg/168s.jpg", "caption": "Salted caramel dark chocolate macaron"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1wOW3MlsfE9dsB9izS2E_A/168s.jpg", "caption": "Chocolate almond croissant"}]}}, {"review": {"des": "Came here two years ago and today I'm back.  This place stayed the same from two years ago. Really good pastries.   My favorite would be the hazelnut one.  Cappuccino is very good as well. I'd be back when I visit Chicago. Very close to John Hancock!", "pics": null}}, {"review": {"des": "In love with Hendrickx!!!<br><br>The service was so warm and cordial... felt like a shop straight out of Belgium. <br><br>They had their traditional Belgian loaf left by the time I got there... and so I took a half loaf home. Breads remain fresh for up to four days. <br><br>Belgian traditional bread (crusty on the outside, buttery soft on the inside): 5<br>Chocolate Almond Croissant: 4.5<br>Rosewater Macaroon (large and thick): 5<br>Hot Chocolate (dark Belgian chocolate): 5<br>Belgian Filter Coffee (Belgian beans used): 4<br>Lavazza coffee served for all other coffee drinks!<br><br>Service: 5+<br>Look forward to coming one early morning for their croissants.", "pics": null}}, {"review": {"des": "I can't speak for anything else but the coffee. I was excited to try this place after reading all the raving reviews on Yelp. <br>When my friend and I got there, all we saw was the menu for the drinks and not for the food behind the counter. The girl working the counter was glaring at us waiting for us to order so we felt rushed and didn't really get a chance to look around and decide. I saw that they had Belgian coffee and asked if it was sweet, the warm and welcoming owner stepped out from the back and explained that it's not sweet but she could add caramel to it to make it sweeter. We ended up ordering two cups of those with the caramel sweetener. It came out to be $7 for two small cups of coffee which is too overpriced. <br>The coffee was nothing special. It tasted like a plain cup of coffee you would get at your local 7-11 gas station. Very disappointing. I added some sugar to it to make it more flavorful. I was really expecting more out of this place. I hope to return and try their pastries and hopefully have a better experience.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/e1Qxx-F9m40W8hmxnDtDgg/348s.jpg", "caption": "Belgian coffee; tasted very basic and plain"}]}}, {"review": {"des": "A huge fan of this place for their bread and pastries. I got a Belgian dark chocolate muffin and some coffee to have in-store (first the Belgian filter and then just what was on drip) the coffee tasted fine, not the best I've ever tasted, to be honest I couldn't really tell the difference between the Belgian filtered one than not unfortunately (I drink a lot of coffee so usually I can tell if there's a huge difference) it was marginal, but probably not worth the extra buck to me? <br><br>I did however fall in love with the Belgian dark chocolate muffin, BUTTER. BUTTER. AND MORE BUTTER. The pastry was so sweet and delicious and the dark chocolate was a great addition to it. I was confused at first because it's buttery in color and barely looks any different from the white chocolate muffin, but oh god. That butter. I bet it would taste even better heated up, I wonder if they do that. But would come back for this delicious muffin and all the enticing other pastries and sweets in the fridge. <br><br>I also left with a loaf of Breughel (pronounced brew-gall, kinda? for anyone who doesn't want to seem confused like me when they ask for it). This bread is so delicious, it's super fragrant with the wheat, rye and oats. And probably extremely healthy too. The bread itself is very savory and delicious. I wouldn't say it's soft, but also not hard like the outside of french bread. It's the perfect mixture of dense and substantial (there's no English word for it but the Chinese for it is 結實)", "pics": null}}, {"review": {"des": "I got a pistachio croissant, they were able to heat it for me as the oven was on, and it was the most buttery, fragrant croissant ever. The pistachio definitely was on the almond-y side versus a pure pistachio flavor. They also had chocolate almond and hazelnut croissants, which looked great as well.", "pics": null}}, {"review": {"des": "As I explored the beautiful city of Chicago, I knew my food experience would be a major factor in my lasting impression of the City.<br><br>I was scouting out food places to hit up on the morning of my day-long expedition and decided upon Hendrickx based on the reviews. As I traversed the windy streets, I walked in the wrong direction repeatedly, passing by Hendrickx twice before realizing it was right in front of me the whole time.<br><br>I opened the door to a wonderful aroma of freshly baked breads and brewing coffee. \"Hell yes\" was all I could think.  Wanting to keep room for other foods throughout my mission, I ordered a simple Belgian Chocolate Croissant, which came at a discount because it wasn't \"fresh\" (I came in around 2pm and was definitely willing to pay full price, but less is good too -- just speaks to the bakery's great customer service).<br><br>The croissant itself was hella delicious. It melted in my mouth, along with any stress I had at the time. I would've stayed back to eat more, but I wanted to hit the streets again to get other food!<br><br>I definitely recommend coming here, even if it's for a simple croissant. You'll love it.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/P-ErxkhOqQ3dAiUUzUaEUA/348s.jpg", "caption": "Belgian Chocolate Croissant. Yummy yummy in my tummy."}]}}, {"review": {"des": "What a really random location to have a small bakery. I've been here a couple times over the years and just fell in love with this place. I was actually introduced go this bakery because I was told they sell giant french macarons for a reasonable price. They offer a variety of flavors every day and they never fail to impress me. I've since fallen in love with their Belgian Croissants. <br><br>My favorites are the almond Croissant( 3.95), almond with chocolate (4.10),  pistachio (3.95), and the pistachio with chocolate( 4.10). They open their doors at 8:00 AM sharp. Getting the 1st croissant of the day is heavenly. The buttery flakey crust, pillowy layers, and gooey chocolate with almond paste in the middle is delicious. When you take a bite into it, it is still warm and kind of steamy. My goodness, it is definitely a phenomenal experience.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/I1e4Q5kzK1PMdm2vrvNKKQ/168s.jpg", "caption": "4 giant croissants"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IGMv7OwOmR02H-dNjx--9w/168s.jpg", "caption": "Giant macarons the size of my palm."}]}}, {"review": {"des": "I have been here during both of my visits to Chicago. I would go out of my way to visit anytime I'm in the city because the baked goods here are fabulous! I've had multiple types of their croissants including the plain Belgian croissant. I highly recommend any of them! I also love their canelés as well as their crepes! This is a perfect breakfast, lunch, or snack stop. If you're in the area, make it a point to stop by. It is easy to miss as it is kind of hidden behind the columns of the building where it is located. Look for the orange door.", "pics": null}}, {"review": {"des": "Cute small bakery that's tucked beneath a high-rise apartment building.  You can find it by spotting an orange door which surprisingly, you don't need to open with any forth, it just flies open.  The croissants are delicious, fluffy and flavorful.  There are additional seatings outside and also tucked behind their counter, next to the kitchen.  Haven't tried their pastries, but random note, their Americanos are not so shabby!", "pics": null}}, {"review": {"des": "I can only review the croissants and coffee, but WOW this is good! I got takeout one morning; a mix of croissants: plain, chocolate and gruyere. The pastries were flaky, buttery and delicious. This is a place I will come to every time I'm in the area. Make sure to check it out!", "pics": null}}, {"review": {"des": "BELGIAN IN CHICAGO<br><br>\"Get it all!\"<br><br>Yes, those three words ultimately are where my mind goes when coming in to pick up \"a treat or two...\"<br><br>I so enjoy visiting this shop. Dominique and Chef Renaud made me feel welcome from the very first visit many years ago. Dominique perfectly reminds me of my friend from Brussels...and sometimes when I'm missing aforementioned friend (Maryse), just popping in to Hendrickx satisfies not only my sweet/sometimes savory tooth, but also fills a space in my heart. (Pause for reader's groans!?) I know, a little sentimental here, but that's what delightful and wonderful shops do - bring you more than just that which to fill your pretty face; they uplift your pretty little heart! <br><br>So hey, you have no friend from Brussels and you just want authentic breads, croissants,  (Oh! she gave me the slivered almond croissant for an \"off to the airport Easter treat\" and it was decadent; and unexpectedly had a dash of a creamy hazelnut filling), Belgian coffee and sweets and in a cute, cozy shop - this is your place. Even take a peek into the open kitchen...all delights are baked on site! Skip in for a quick to go bite (they offer sandwiches/salads too) or stay a free wi-fi while. Look for the orange awning outside and enjoy the deep orange walls inside while you figure out your course of action (\"get it all!\") <br><br>My absolute favorite that they do not regularly make anymore is the \"péché mignon\" - a sensational caramel/chocolate wonder that I'm reminding myself right here to ask about next visit. If these are available and you see one...grab it. from website: (Péché Mignon - $8.50  - cocoa salted streusel, dark chocolate & caramel ganaches, Belgian dark chocolate cover, 24 carat gold leaf.) <a href=\"https://www.yelp.com/biz_photos/hendrickx-belgian-bread-crafter-chicago?select=aWAq7dmcKAp3BILai-c6Uw\">yelp.com/biz_photos/hend…</a><br><br>Last visit, I ventured into the realm of \"lemon custard\" - something I seldom do when unaccompanied by my husband and I expected to bring him some to share - but I'll admit this much...I was thankful for his absence when I devoured the whole delightful tart. I had wandered into the shadows of the Hancock building on Oak Street Beach (mere blocks from the shop) and found myself completely surrendering to this lemony-smooth goodness. It's tart but still fairly sweet and I surprised myself that I fully succumbed to its buttery-lemony allure.<br><br>I always leave with at least one mignon (usually several choices are offered: from website: (Dark Chocolate - Pistachio - Moka- Belgian Speculoos or Raspberry - génoise with buttercream) and DO NOT MISS: the cannelé! - a small rum-soaked pastry with a hint of vanilla and a soft/tender custard center and a thick carmelized crust. <br><br>I hope you enjoy as much as I! <br><br>PS - just a smidgen of back-story: they ran a Belgian bakery in the Bahamas before coming to Chicago :) I always marvel and am thankful for their choice to make the Windy City theirs.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7YkRMCyfieCZtJtQbyFW1g/348s.jpg", "caption": "Perfection!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/BWjXYRwheS8Z_oS0a8P-Eg/168s.jpg", "caption": "Easter 2017 case"}]}}, {"review": {"des": "These are some of the best croissants I've had. They are perfectly flaky on the outside and soft on the inside. I tried the almond croissant and pistachio chocolate croissant on my past visit. I really loved the almond one, just wished there was a little bit more filling throughout the croissant. Their sweets aren't overly sweet as well. <br><br>The shop is small but definitely a great place to grab and go. They have a great variety of pastries that all look so delicious. Plus the staff is very friendly and helpful.", "pics": null}}, {"review": {"des": "Quaint little European style cafe located off the Mag Mile. Pretty small location, not a whole lot of space, not too crazy of a menu, but I did get to try Belgian Iced Coffee, which I'd never heard of before, it's sweeter than normal iced coffee. Their hot coffee was good too. They also have pastries and croissants and bread made in their bakery. Honestly it's a bit over priced but that is the area for you. The lady who worked there, and I think she owns it as well, was friendly.", "pics": null}}, {"review": {"des": "This is the most amazing little bakery I've ever seen. They have gluten-free muffins gluten-free granola, gluten-free bread and gluten-free desserts that are just decadent. You won't believe it until you see it! don't forget the almond cappuccino. my friend ordered chicken curry sandwich all over fabulous service and outstanding food. Our time was amazing and the place had such a lovely European charm.", "pics": null}}, {"review": {"des": "I've lived near Navy Pier for years (not too far from here), but I've never been in until now. I had the chocolate croissant - which was flaky and wonderful. The French Roast coffee is also good. Come here for the croissants and to feel like you're in a small European cafe- the selection is great, the smell of the bakery is fantastic! They have more seating in the back, and it's a quiet little nook when not crowded.<br><br>I didn't love the quiche of the day, which was a tomato, spinach, cheese(?). It was too salty for my taste and dense. Maybe it's because I'm generally not a fan of the personal-sized quiche pies because they never taste as \"fluffy\" as when the bakery makes a large pie and serves you up a slice. <br><br>Overall, their quiche style might not be for me, but I will come back to try the almond, cheese, and other croissants, as well as the other pastries (macaroons)! Fantastic to have this gem in the Gold Coast.", "pics": null}}, {"review": {"des": "This is a cute, hidden cafe full of baked goods, soups, salads and sandwiches.<br><br>My favorite thing to order is the bean salad and macaroons. The bean salad is arugula topped with beans, diced tomatoes and vinaigrette. It also comes with a couple of large pieces of their delicious bread.", "pics": null}}, {"review": {"des": "Almost immediately when you step inside you can sense you are somewhere different, perhaps Western Europe. The location of the bakery is also hidden like most European shops can be. And like some European shops this place is tiny...not the kind of place you bring your laptop to and stay for a while. However, on a cool, summer day in Chicago the outdoor seating is perfect. <br><br>When I go I usually get a Belgian chocolate iced coffee and a chocolate croissant which are both good. At one time they offered cooking classes which I thought was a great way to engage the community. The people who work there generally seem to be in a happy mood and tend to the customers attentively.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uGdKsLiBX0VoMoBouKjXZw/348s.jpg", "caption": "Belgian Chocolate Iced Coffee"}]}}, {"review": {"des": "I got a half a loaf of bread for $20 and thought it was reasonably good. Definitely an authentic Belgian bakery! They also have outdoor seating which is nice.", "pics": null}}, {"review": {"des": "Excellent croissant! Wow! Great little place just near the main streets of the north side of town!<br>You'll love it for an early morning cup and a pastry!", "pics": null}}, {"review": {"des": "Loved coming to Hendrickx while I was visiting. I was there in February so when I first walked into the store- I was greeted with warmth and the overwhelming smell of baked goods. I definitely welcomed both! The store is small but the pastries were big and made with love! I ordered an Americano with my croissant and both were perfect. Nicely roasted espresso and perfectly baked pastry. The shell was crispy and a lovely golden brown (So happy that the bottom wasn't burnt), while the inside was buttery and flaky. It was so good I came back again a couple days later! This time I sat inside to enjoy my coffee and food. My friend and I split a quiche and it was also great! I wouldn't say it was phenomenal but it was still quite good! I would absolutely reccommend that you try this place if you're nearby!", "pics": null}}, {"review": {"des": "This is truly a hidden gem. Located right off of Michigan avenue, this little Belgian bakery is the stuff of dreams! It's hard to miss if you don't know where it is, so make sure you google maps-it so you don't miss out.<br>When you enter, it feels like you're transported to a little coffee shop or bakery in Europe. There are a variety of fresh baked pastries (baked every morning, according to the staff) to choose from.<br>I was lucky enough to try the chocolate croissant today, and it was phenomenal. Layers upon layers of flaky, buttery goodness, with a rich and sweet (by not too sweet!) Belgian chocolate core. My husband ordered the hazelnut croissant and similarly raved about it. Hendrickx, you have officially ruined Sam's Club croissants for me!<br>And the staff were incredibly nice and friendly, despite the crowd of customers. It really felt like a small business.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ySpdnszGLIuJZUAX5v3Rjg/348s.jpg", "caption": "Look at those layers! While the chocolate part looks small, it is rich, sweet, and packed with tons of flavor!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fmt5FeAvgez7-7pOR4LdGQ/168s.jpg", "caption": "Hazelnut croissant (takeout)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JOet0CTfhBa6R0DFDSqfxw/168s.jpg", "caption": "Chocolate croissant (takeout)"}]}}, {"review": {"des": "I was early to an appointment and needed a cup of coffee. Little did I know that my whole day was going to be brightened! <br><br>I stepped inside and was surrounded by the luscious smell of cakes and shortbread. My mouth began to water and my order of \"a cup of coffee\" was expanded. My eyes began to feast on the cakes displayed in the cooling cake rack. Then, my eyes feasted on the Macarons in a rainbow of colors. Green or Pistachio, Yellow or Lemon, Orange or Caramel, Purple or Lavender.  They also have some of these flavors in GIANT, ENORMOUS sized cookies!<br><br>They offer beautifully frosted cakes too! My sugar addiction went into overdrive and my greediness kicked in. Did I mention that I felt like I was in heaven here on earth?<br><br>I sat out front and slowly enjoyed my coffee and a supersized macron. A tourist inquired about their coffee. I told him he had to try their cookies. He grabbed some coffee and a cookie and we both sat outside, together, on a quiet morning, and talked of our worldwide travels. <br><br>I made it back from my doctors visit and bought my horde! I picked up three mini frosted cakes (pistachio, chocolate, and raspberry) for my father's birthday, a host of Macrons, and am planning my next trip!<br><br>I must try the croissants, the travel bread, and a host of other items!", "pics": null}}, {"review": {"des": "The best croissants! This place is easy to miss, we walked right by it the first time. I'm glad we found it. Small and cozy, with a view of the busy bakers in the back. We had already had breakfast, so we just wanted a snack, but they do have crepes, waffles, and sandwiches. My chocolate almond croissant was decadent, and my husband loved his Gruyere croissant. They were perfectly flaky and large. The woman working the counter was cheerful and friendly.", "pics": null}}, {"review": {"des": "This is a quaint restaurant with huge taste.  If in the area, make sure to stop in. <br><br>They have Awesome pastries and breads , with their specialty being croissants. They are flaky with the perfect amount of moistness. Choose from plain, chocolate and cheese croissants. <br><br>The Belgian waffles are light and airy, unlike any Belgian waffle I've had but still very good. They also have a daily, personal quiche, fresh hard crusted bread, desserts and a wide selection of macarons. <br><br>A great selection of coffee and teas including cappuccinos, Belgian cafe ah lait, and Fresh pressed coffee. <br><br>Owner and staff are welcoming and accommodating. An awesome find and I've that I'll be back to when in town.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TYyK3AAV0Utg-PX5SlmXzQ/168s.jpg", "caption": "Belgian waffle"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YZV7f0DZt9WBEgUPxb_SHQ/168s.jpg", "caption": "Gouda croissant"}]}}, {"review": {"des": "The first time I came here was years ago on the Chicago Chocolate tour. I have been back many times since because their pastries are amazing. Hands down my favorite place in Chicago for croissants! Their sandwiches are also impeccable.", "pics": null}}, {"review": {"des": "This place is so awesome.<br>It's in the loop, so on Sunday before the holiday there was no one on the road as everyone was inside Hendrickx!<br><br>This is a mom and pop shop that has the most amazing, helpful, knowledgeable folks working there. <br><br>I can get over the young teen or almost teen gentleman that described each bread loaf and croissant in detail.  He literally sold the bread without trying to sell just by knowing the product inside and out. <br><br>Excellent and delicious brioche bread loaf that was not too sweet- it was just right.  Croissants were a hit with the family as well!", "pics": null}}, {"review": {"des": "I took fellow yelpers advice and walked to this bakery during a quick trip to Chicago. This is a hidden jewel. If your not paying attention you will walk by it. I ordered a Belgium iced coffee that has a splash of cream and homemade caramel. It was suggested by the woman behind the counter. I arrived at 4:30pm so they were already out of the croissants. However, the selection of other pastries, baked goods and desserts was plentiful and looked amazing. I ordered a salted butter caramel macaroon. It was very fresh and the salted butter caramel filling melts in your mouth. Highly recommend coming here.", "pics": null}}, {"review": {"des": "Updates once a time for a bit how about I am gettingjjiiuhh it though Ll John hthe old", "pics": null}}, {"review": {"des": "Pistachio croissants are hard to come by - sold out last time I came here. Saw the apple turnover and will have to try that next time. The miss behind the counter was nice enough to heat up the croissant for me. Makes a world of a difference - in terms of croissant and service. Will come back again!", "pics": null}}, {"review": {"des": "I visited Hendrickx exclusively for the croissants! I tried the chocolate and the almond ones--they had just come out of the oven so they were perfectly warm and smelled heavenly. I am always on the lookout for baked goods and Hendrickx definitely satisfied my craving. The croissants were perfectly flaky on the outside and were almost...bouncy on the inside. I love baked goods that have a bouncy texture since that means that they are not dry. If I am ever in the vicinity of North Michigan Ave., Hendrickx will be on my mind.<br><br>There is no restroom that you can use while in the store. This can be a little problematic since your fingers can get oily/sticky from eating the croissants. Bring hand sanitizer or just head across the street to use the restroom in the mall.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bQ6ZR2cnSiR6NpmLm60acQ/348s.jpg", "caption": "Chocolate croissant and almond croissant"}]}}, {"review": {"des": "Best cherry chocolate croissant ever! Soft and flaky and full of flavor depth. I came in the afternoon originally wanting just a chocolate croissant but they had sold out. I guess you have to get there early to get some of the popular specialties. Hands down coming here again just for that cherry chocolate croissant", "pics": null}}, {"review": {"des": "Went this Sunday morning for a Croissant and a coffee, I loved the genuine Belgian taste of their pastries. It's a small business but they offer a wide array of pastries and breads. The only place I could find an evenly spread multigrain bread.", "pics": null}}, {"review": {"des": "This is by far the best place in the city to get croissants. Each of the croissants are perfectly baked while also being very lightly moist on the inside. Also, they have over a dozen different flavors. I called the day before to order 12 croissants and picked them up straight from the oven the next day.", "pics": null}}, {"review": {"des": "One of the best croissants I've had in Chicago--large & flaky with a multitude of flavor options!! I got the speculoos, and the middle bites really oozed out that cookie butter. So. Good. I only wish that they had more seating!! Only one table & chairs inside :(", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Wsh2pAF0al4AbZ0dIPhKtA/348s.jpg", "caption": "Speculoos croissant on a table outside!"}]}}, {"review": {"des": "Their almond croissants are amazing!!! Actually, everything I've eaten here has been amazing. Also, wonderful owners, who obviously never compromise on quality. I definitely have to go back Saturday morning for fresh crepes. Also I recommend going earlier in the day as the croissants and other speciality goods tend to sell out quickly and taste best fresh. Also don't forget to get a giant macaroon and some fresh country bread. Yum!", "pics": null}}, {"review": {"des": "I was pretty excited about this place. It smells wonderful inside and has a nice rustic bakery feel. <br><br>However, the cake we ordered was very dry. It was strawberry with white chocolate shavings, and was one of the most disappointing pasties I have ever tasted.  Maybe it was because we came by around 5 PM, but very disappointed. Don't think I'll return.", "pics": null}}, {"review": {"des": "Solid Belgian coffee, I like the bacon / cheese croissant too. Try the madeleines as well, it's a tasty treat.", "pics": null}}, {"review": {"des": "Came in on a Wednesday afternoon in hopes that the canales were not sold out and there were still a few left. They were located in a display fridge to the side, along with other fine desserts and pastries, but made me wonder about their freshness as other breads and croissants were out of the case resting on room air. They were tasty, however, and had their signature caramelized crust.", "pics": null}}, {"review": {"des": "Love this spongy inside and hard crust outside country bread! I my self hand make too, but never achieved this texture and spongy! I would have it every morning if possible!! And the chocolate croizang was a present: cashier gave it to me because I'm new to the store! Wt? That's amazing delicious! Not too sweet, a bit bitter of chocolate hovering around my mouth after my bite, the moist chocolate inside catches my mind for the rest of night!! God, they literally takes me to heaven", "pics": null}}, {"review": {"des": "Sometimes you walk past a place a hundred times and never realize it's there. I did that with this bakery and I have been kicking myself since I actually went inside. <br>The croissants are sooooo good here. Once I found this place I went back two more times in the same week just to try another flavor. They have all been delicious. From plan to chocolate to hazelnut to gruyere every croissant is a buttery delight. <br>Great for grab and go in the morning or to go and sit and enjoy in their cute shop.", "pics": null}}, {"review": {"des": "Thus far, my favorite bakery in Chicago. As a Parisophile, I have to concur that these are the best croissants outside of Paris: yeasty, flaky, and thinner-than-gift-tissue-paper crisp crust. Amazing. And something I've never seen in Paris are the cherry croissants made with whole cherries baked in! Clever twist on the classic croissant. <br><br>I believe the proprietor is Belgian - I know she speaks French; she's very friendly & welcoming (as are the young red-headed gentleman - cute! - and the lovely soft-voiced blonde young woman). The person who is not so friendly and definitely not welcoming is the dark-haired, tightly bunned young woman. She comes across as patronizing, as if she's doing you a favor allowing you to order. Heaven forbid you have a question about a menu item. Alors!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/paRjpSWVTrtFQIPZwTp3wg/168s.jpg", "caption": "Humorous sign!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/85urQh7FgiZ_TDNRKzpoVA/168s.jpg", "caption": "Cherry croissant"}]}}, {"review": {"des": "If you live in or visit Chicago, don't miss this place. The croissants are dreamy, the coffee is delish, and the staff is delightful. It's tiny and tucked away--but don't be discouraged. Keep looking! The bakery's entrance is off an open corridor a few steps up from the street. The bright orange door means you've arrived.", "pics": null}}, {"review": {"des": "What I love most about this place is the European vibe you get while there. LOVE! The owner was speaking French and I loved hearing her talk while eating. The staff was so nice and helpful. The service alone is why I will be back again and again. <br><br>The place is very small and you actually walk through the kitchen to get from one sitting area to another. Kinda cool to see where everything is made! Also it does not go without notice that is very clean. <br><br>The go to here is the croissants! I had the chocolate and tried the cheese. Loved both! I could eat them all day and be in heaven. Also had the veggie quiche and loved it. Perfect size too. The coffee is hand-crafted and delicious. I love macaroons, and they sell them by the bag. YUMMY! <br><br>I found this more of a breakfast and brunch place. Perfect for something light before a big dinner plan. If you are staying at The Waldorf, perfect walking distance for a treat!", "pics": null}}, {"review": {"des": "I got a gluten free almond muffin here since they were out of the almond croissants. I actually walked here from Lincoln park just site seeing hoping I would stumble across a good bakery. Which I did. The mini cakes in the fridge and the cookies and breads looked to die for. I really enjoyed my muffin and wished they did have the almond croissant in stock. Highly recommend!! Was a delicious little bite to eat", "pics": null}}, {"review": {"des": "I bookmarked this bakery a loonnng time ago. Finally stopped in today and the croissant was better than some that I had in Paris. Coffee-freaking perfect.<br><br>GO. YOU WONT BE DISAPPOINTED", "pics": null}}, {"review": {"des": "Wow! The country bread is dense and moist with a crisp crust. If this is Belgian bread, I need to move to Belgium.<br><br>The pastry case showed off large, colorful macarons, and other tempting desserts. Next time!", "pics": null}}, {"review": {"des": "Best croissant I've had outside of Paris!!!! Hey the gruyere croissant you won't be disappointed. Only downside is no public restrooms", "pics": null}}, {"review": {"des": "This has to be one of the best bakeries in Chicago, and probably makes the best croissant in North America outside of Montréal. The breads are delicious too, though the real treasure here are the croissants.<br><br>The croissants are made in small batches, so if you go at the end of the day, they might run out of some flavors. However, they are more than happy to set some aside for you if you call in advance even to reserve just one or two.<br><br>My favorites are probably the chocolate pistachio, hazelnut, and cherry. All the flavors are so delicious, though, so if they run out of one, you can't go wrong. Or don't choose and just get a box of them :)", "pics": null}}, {"review": {"des": "My wife and I simply loved this place! The macaroons are amazing, as are the croissants. It's a very small place and was busy, but the staff is nice and it's worth any wait you may encounter.<br><br>We will visit again when we come back to Chicago!", "pics": null}}, {"review": {"des": "This place is known for their croissants and for good reason. I had an early Grey loose leaf tea and a pink-red tea ( I forgot the name) and they were so good. <br><br>The quiche here is amazing. It's not too hard, and they warm it up for you. The eggs are fluffy and delicious <br><br>The almond crossiant is to die for. If you're on a tight budget, get a crossiant and ditch the quiche. They don't warm it up, but it is served perfect temperature. The inside is chewy and the outside is flaky. It's perfection.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/epdW6oA0XZ_ElJp1NZoL-g/348s.jpg", "caption": "Quiche"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xgp-c9pm8N5zUMajRtQohQ/168s.jpg", "caption": "Delicious crossiant"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gPmtr7tnIdIzIODH92AtJA/168s.jpg", "caption": "Vanilla macaroon"}]}}, {"review": {"des": "Anytime my husband and I are in Chicago we always stop Hendrickx! The almond croissant is my favorite, but everything we have tried there is delicious!", "pics": null}}, {"review": {"des": "A very tasty ham and cheese croissant which really does remind me of the various jamon sandwiches one might get in france (or belgium!). Also, shoutout to the young man behind the counter. What he lacks in height, he makes up for in professionalism.", "pics": null}}, {"review": {"des": "I stopped by this place because it reminded me a lot of the bakeries in Paris and I was craving a pain au chocolat. I got the chocolate croissant but was pretty disappointed - the croissant was buttery but not very flaky and tasted a little stale. Additionally, there was only a minimal amount of chocolate :(", "pics": null}}, {"review": {"des": "Cute little place that sells wonderful croissant. I definitely recommend the bacon and gruyere!", "pics": null}}, {"review": {"des": "Mediocre at best. Disappointing chocolate almond croissant. Was not flaky at all. The mignons were disappointing as well. I'm puzzled by some of the good reviews. Do people not know good pastry? Bennisons in Evanston and Cafe Fleurette in Winnetka have much better croissants. I didn't have the food so I can't comment on that. But I think people hear French accent and get fooled into thinking they are eating something authentic. If this bakery was in Belgium, based on its mignons and croissants it wouldn't last a week. The coffee was good and strong.", "pics": null}}, {"review": {"des": "Finally! I thought I'd never find croissants in Chicago that can compare to Neighbor Bakehouse and Arsicault in San Francisco. Not only does Hendrickx have fresh delicious light flaky croissants, but there's quite a selection to choose from! Of course, I wanted to try all but decided on pistachio with a small latte. I was in heaven!", "pics": null}}, {"review": {"des": "Amazing selection of fresh Belgian goodies as well as made to order crepes and waffles.", "pics": null}}, {"review": {"des": "Absolutely love this little bakery. I literally RUN on my day off during the week to make it before 10:30 so I can get a free cup of coffee before 10:30 with a $5.00 purchase...just a little perk because the regular coffee is strong and and great with those chocolate croissants.  The soup is also super, the bread is to die for, and if I can restrain myself I save one slice to take home and make for toast later because it is even better toasted.  The Belgian salad with lentils reminds me of the year I lived in France when I was in college.  Dominique is charming, tireless, and super patient and kind.  Get there early if you want croissants to be left. I have never known anyone to be anything but lovely as a server there.", "pics": null}}, {"review": {"des": "Good croissants. However the service was a little weird to me. The baker in the vack was very nice and welcoming but the women at the front desk and another in back were giving me weird looks and didn't say thank you. Just handed me my card and not a smile or anything. Made me a little mad.", "pics": null}}, {"review": {"des": "Hazelnut croissant, worth a trip. Friendly service. Good cappuccino. In winter, front door is closed and you enter through the kitchen.", "pics": null}}, {"review": {"des": "Great bakery. I love the location. Fresh and amazing food. Lots of croissants in many different flavors. Cakes and cookies. My favorite is the the soft boiled egg breakfast. It's amazing and simple. This place stays busy in the morning but it's not impossible to get in and out. Just a small bakery. There is seating. From what I have observed the seating is always open. Most grab their order after standing in line and leave. I'm glad I came across this bakery. Fabulous food.", "pics": null}}, {"review": {"des": "Best kept secret of the Magnificent Mile. Low key bakery with great coffee - try the Belgian Iced Coffee, which has the barest hint of caramel (I don't like sweet drinks, but this is just a tiny hint). I also love the sea salt dusted sables (cookies). Their pastries are too much for me, but I like to meet folks here for an easy place for conversation and something different than Starbucks.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pHu5aU1d-JjHsF2tBmtBIA/348s.jpg", "caption": "Belgian iced coffee and sea salt sable cookies"}]}}, {"review": {"des": "I saw this place on Yelp when trying to find potential places to get some breakfast. It was a bit far from my hotel (in Schaumburg) but we were heading into the city that day anyway. I was hoping the hour long commute to the place would be worth it.<br><br>First off, it's not too obvious. I was following my GPS like the tourist I was and saw how I was walking past it... and I couldn't see it. Then I saw the sticker decals spelling out the word \"croissant\". Then I looked past that. Then I saw people sitting at little tables outside and what looked like a potential cafe/bakery beyond that. And so I walked further down, found some steps and went up. There's a small hallway type walkway where there are small tables and chairs set up for a maximum of 2 per table. Inside was small as well with even less seating. What really caught my eyes was the wall of baked pastries and breads beyond the cashier. <br><br>I admit I was slightly overwhelmed. I only have one stomach so I could only get two things at the most - one for me, and one for my husband to share. Well, I could get more, but I am one of those 'blessed' ones whose body type gains weight even when I drink water (and don't tell me it's just water weight). We stood there for a bit and was offered one of their paper menus, but I still stood towards the front; their menu is purely text and I wanted a visual representation as well. <br><br>We finally decided upon the Almond Croissant (I have an intense love for marzipan so almond anything in desserts is a must) as well as the Pistachio Croissant (mainly because I never encountered the pistachio in a croissant... and I do love pistachios). To enjoy them with, hubby got his usual black coffee and I got a Belgian-style iced coffee. We found a seat outside (thank goodness that Chicago had cool mornings) and got settled after we got our croissants off to the side after we ordered. Our drinks were delivered to us later.<br><br>I thought it was funny how the croissants were different sizes (the pistachio was a bit larger), but they were both delicious. Flaky pastries (I shudder to think how much butter I was consuming) with a decent amount of filling inside. I only wish I had more! In hindsight, it wouldn't have hurt to try a third croissant, would it?? Once we finished them, lingering crumbs and all, I caught sight of the macarons. They were quite large (slightly smaller than the palm of my hand)... and I wanted something more to finish my coffee with. Speaking of which, the coffee had some milk (or was it cream?) and was lightly sweetened, but perfectly so that I didn't need water to go with. <br><br>I ended up getting a lavender macaron. Like I said, it was large, which was perfect for sharing, though I wish we could have gotten 2. Perfectly chewy under the crust and with the size, you could see more of the action as you took a bite into it. The buttercream filling was on the thick side in the middle, but still good. Flavors definitely there and it wasn't too sweet... I wish I tried another flavor as well!<br><br>Pros: awesome food (sweets and pastries, at least) and good drinks, friendly staff (it seems to be family-run?) though the girl needs to smile more because I don't think she smiled the entire time I was there, steady stream of customers which can only be a good thing, in a good location by a number of hotels and in walking distance to the Water Tower<br>Cons: small place with limited seating when busy, their door doesn't swing shut automatically (which seems to REALLY bother the girl who works there when customers don't close the door behind them)<br>Verdict: good thing I don't live here or it'll put a dent in my wallet and I would need to buy a whole new wardrobe for my ever-increasing body size", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Dprdt1PqgbnDMxTP1jZiRA/168s.jpg", "caption": "Lavender Macaron only slightly smaller than the palm of my hand!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uBpXgddnggmHTvwvuE7npg/168s.jpg", "caption": "(L to R) Almond Croissant, Pistachio Croissant, and a Belgian-style Iced Coffee."}]}}, {"review": {"des": "Croissants were pretty good. But one of them that we ordered was horrible...extremely bitter.  They acknowledged the issue and replaced it. But still... was a bit disappointed. Especially that we felt that they didn't care as much as we did.", "pics": null}}, {"review": {"des": "The crepe with lemon juice was ok, croissant was good but the hot chocolate was a little bit too sweet for me. The price is a bit high compared to the amount of food.", "pics": null}}, {"review": {"des": "I would have never notice this place on my own. I let my friend pick where we were having lunch at and we ended up here. There weren't too many entrees to choose from, so being the carnivore that I am I chose the Italian Sub. It looks sort of plan and boring when you get it, but that sandwich was good! The olive oil it was drenched in was delicious and the bread was ammmazzzzing! I was so full off of the sandwich, but I had to get one of the Mignon desserts. They looked delicious and there were many options to choose from. I went with the Mocha cake covered in hazelnuts and topped with Buttercream frosting. It was delicious and definitely made for sharing. Although if I didn't have the sandwich I may have been able to finish on my own. <br><br>As much as I walk by I don't think this spot stands out much. The outdoor seating is sort of tucked away a little higher than street level. They only have a few tables on the inside, so when the summer is over you'll probably just want to take your food to go. I will be back to try more of the menu.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MfTFzJ7geOJwBdttBicF2w/168s.jpg", "caption": "Italian Sub Sandwich"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/U7StSIvMPANSXnTjXMYldw/168s.jpg", "caption": "Mignon - hazelnut"}]}}, {"review": {"des": "Having lived in Belgium and the Netherlands, I was very excited about getting a real Belgian croissant here in Chicago. Unfortunately, this places offers the same dry, stale, generic croissants as Starbucks and other coffee shops.  <br>The young ladies working the counter were not only unhelpful but didn't seem to have any sense of good customer service. I asked a question about if it was possible to mix the mini French macarons in a gift bag, and instead of politely saying no, they got defensive and shamed me for even asking. They were very rude and condescending for the rest of our interaction.<br>When I left, I tried my macarons and they were hollow (a bad sign!) and dry and tasted stale--definitely something that was not baked today. <br><br>I applaud their effort, but this place just seems to fall flat. What a shame.", "pics": null}}, {"review": {"des": "I had the goat cheese sandwich and split the mocha hazelnut mignon with a friend. I loved the bread and the unique ingredient pairing of the sandwich (pistachio, honey, goat cheese) but wish they put some greens in it. <br><br>The cake was good, but not as good as their raspberry one that I've had before in takeout. Too sweet.<br><br>I haven't been to Europe but coming through the bright orange doors into this intimate little space, where a customer converses in a mix of French and English makes me feel like I've been transplanted across the ocean and transported through time. <br><br>Complimentary water would be nice, it's a great space for casual vibes and conversation. <br><br>Overall, definitely beats the hipster coffee shops that people post on Instagram, i think.<br><br>Will be back to try their croissants.", "pics": null}}, {"review": {"des": "Cute little shop with pastries and cakes.", "pics": null}}, {"review": {"des": "This is a lovely bakery. I am a macaron connoisseur, and I must admit they are delicious. Their drip coffee is a cool idea, although I don't like waiting for my coffee. Their other baked goods (almond croissant, Madeleines, and bread) are beautiful and tasty. My only complaint is their staff who are rather snobby. I came in one day to look at their baked good selections, and they treated me as if I were a teenager looking to steal from them. Once I placed an order, their attitudes totally changed and they began to treat me like the full grown adult I am.", "pics": null}}, {"review": {"des": "I enjoyed a carefully crafted cafe au lait paired with a canele on a frigid morning in Chi-town. Just delicious. You can eat in a room right behind the kitchen. You can see the bread being prepared and packaged. This place is authentic and spectacular. <br><br>There really isn't a better place in the area for coffee. It is a true oasis in a sea of Starbucks outlets and other chain coffee shops!", "pics": null}}, {"review": {"des": "Their bread and baked good are fresh and delicious. However, if you enjoy a good lunch at a good value then this is not the place. I've been several times and each time I try to like it. But, the portions are tiny and I leave having spending $12 on a salad with kale and 4-5 pieces of dry chicken on top. Again, I left disappointed and hungry. Three strikes...", "pics": null}}, {"review": {"des": "The staff were very friendly and courteous here and the atmosphere was pretty quaint. It seemed to me like there were many happy customers and it made sense since their pastries were pretty tasty and interesting. But, for me, the value just wasn't there. What we ordered was good, but it was a little pricey.", "pics": null}}, {"review": {"des": "Excellent, fast friendly service.<br>This place is tucked away a few steps off Michigan Ave next to condominium building.<br>The chocolate almond croissant is very good; light flaky and made to perfection.<br>The Americano coffee is one of the best I've had and far better than Starbucks.<br>For those not looking for a bold coffee the French roast is also very good.<br>Highly recommend this place.", "pics": null}}, {"review": {"des": "Love, love, love! From the tiny store front with a European vibe to of course all the pastries. I've had their croissants and quiche, both so incredibly delicious! I'm sure they're great for on the go but I love to sit and really let the carbs soak in.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-2KYBVrI0EhSFrmdka93Ww/348s.jpg", "caption": "Perfect way to start the day!"}]}}, {"review": {"des": "Cute little walk-in place. A few bright orange tables are outside for your seating enjoyment.  I gluttonously ordered the dark chocolate muffin to go. When I reached in the bag, I pulled out what looked to be more like a piece of cornbread. I thought I had been given the wrong item...until I bit into it...and there was the most gorgeous piece of dark chocolate in the middle of it.  The cake is a super delicious vanilla that is incredible. And that piece of chocolate, divine. What a sweet treat. I bought a small brioche loaf as well.  Delicious.  This place is a winner.", "pics": null}}, {"review": {"des": "I try not to miss coming here whenever I visit Chicago. The croissants are made every morning, fresh. The place closes once they sell out. Try the coffee - filtered per cup. I swear it's a cup of coffee you won't forget.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-WpHqU2zENUveNLu9eUQzw/168s.jpg", "caption": "Chocolate Cherry Croissant"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aEhKgN3SiAZFnBLbk82FXw/168s.jpg", "caption": "Pistachio Croissant"}]}}, {"review": {"des": "Located right off Michigan Ave, this no frills gem entices you from the moment you walk in the door and breathe in the delicious aroma of all the fresh pastries. It was hard to decide which flavored croissant I wanted but I knew my waistline should only have one so I styled on the pistachio chocolate. Perfect choice!  I washed it down with the homemade lemonade served with simple syrup on the side so you can adjust your flavor accordingly. <br><br>The seating is limited and nothing fancy but it didn't matter because the food was so delicious and the price was right!", "pics": null}}, {"review": {"des": "Gruyere and Belgian croissant was dense. <br><br>The Gruyere had flavor versus the Belgian which tasted like bread. <br><br>Very disappointed.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/83CiR2Y4zGAeL6CAmYUkGg/348s.jpg", "caption": "Gruyere croissant. Dense and not impressed."}]}}, {"review": {"des": "This place is delicious, with nice service. On our way to the Museum of Contemporary Art, we stopped over for brunch. We had the savory crepes of the day: smoked salmon, cream, dill. RIDICULOUS. Also a side salad (arugula and kale, so yummy), the tuna salad plate, and a cannelé to share. The cannelé was perfect. So dense and eggy and sweet. We sat outside - there's lots of seating inside and some outside. I should have tried a croissant but I thought all that we had ordered was just fine. <br><br>It's inside an orange front door! Really cute.", "pics": null}}, {"review": {"des": "I used to live in the same building as this bakery and it was dangerous because everything is so good! The lentils are some of the best I have ever had. Other favorited include the egg salad sandwich (bread is incredible), salted caramel macaroon and any of the croissants. Pro tip: if you are wanting the best croissant in your life try to go right in the morning when they open so you got them hot and fresh out of the oven. You won't regret it!", "pics": null}}, {"review": {"des": "Had a chocolate pistachio croissant that was fantastic, and later brought a single slice of bread to enjoy with coffee... Definitely some of the best bread I've ever had! If you're visiting in the winter, dress warm!", "pics": null}}, {"review": {"des": "If your close to this bakery, do yourself a favor and grab a croissant. We tried the Cherry Chocolate the first time, then went back for the Almond chocolate the next day with iced Belgian coffees. Delightful!", "pics": null}}, {"review": {"des": "We went to Hendrickx for breakfast and it is a quaint little bakery right by Michigan Avenue and the 900 Shops area. As you step into the bakery, you will see two tables and then all the baked goods lined up behind the register. Fresh baked bread, croissants, muffins and all kinds of Belgian baked delicacies lined the counter. If you look to the left, you can see the bakers busy making the bread and other goodies in the open kitchen. The chef baker was wearing his tall white hat and greeted the guests. There is also a room around the corner from the kitchen with a few more tables where you can sit. We took a seat and ordered breakfast and tea. I ordered an Early Grey tea and it came out in a plastic tea pot where you wait a few minutes. You then put the plastic tea pot on the paper cup and it pours right into the cup. I want to buy one of these tea pots now after this experience!<br>I had a boiled egg with fresh bread and butter. We also split a chocolate croissant and it was one of the best I have had. Everything reminded me of Europe and I would come here for bread and dessert when in the area. The prices are a little high yet you are getting authentic handmade breads and pastries. I also noticed pictures of the baker and owner on the wall so it appears they have been around a while. Many locals were getting coffees and treats to go. Next time I am back, I want to try the Liege waffle.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/XsASTNPalem9DGh0DP0okw/348s.jpg", "caption": "Searing area on the back"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KkN_Tjeft39kjBbl4wtg8A/168s.jpg", "caption": "Chocolate croissant"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ozSDqO0RPZJNvw6nPZNoAg/168s.jpg", "caption": "Croissant"}]}}, {"review": {"des": "A bit small on the inside, but not a big deal for people like me who get their food to go.  Tremendous pistachio croissant that reminded me of being in France. When in the area this is the place I go to get a quick morning meal.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/P2Aviz-UQMssdyXqnLpC6Q/348s.jpg", "caption": "Pistachio croissant"}]}}, {"review": {"des": "Probably the best bakery in Chicago I came across by chance while shopping. I had the chocolate muffin and almond muffin which were more like buttery pound cakes, simple and lovely. If in the area you should pass on the cupcakes down the street and stop in here.", "pics": null}}, {"review": {"des": "Quaint, little cafe almost hidden away in downtown. It's hard to notice it unless you know what you're looking for. I'm in this area a lot and have probably walked passed it a dozen times on my way to Sprinkles but never realized it was here. <br><br>I was standing in line at Starbucks when I checked Yelp for other breakfast options in the area and found this place. The cheapest Starbucks croissant is $2.25, why not swing by here and for just a few cents more get something baked fresh. <br><br>The pastries are laid out behind the front counter in an almost taunting manner. They look so good you'll want to buy one of each.<br><br>I settled on the Liege waffle & chocolate almond croissant and asked to have them heated up. I was offered free coffee since I spent over $5 but declined.<br><br>The seating area by the main entrance is small but there is another room around the corner with a few more tables. As you turn the corner, you'll  get a view of the kitchen where you'll see bakers prepping for their next batch of pastries.<br><br>The Liege waffle is covered in cinnamon and sugar then drizzled with glaze. It seems small but it is very filling. Warmed up is the way to go on this one as the flavors will melt in your mouth more.<br><br>The chocolate almond croissant was very nicely done. It was perfectly crispy and flaky and the filling was great.<br><br>Here's a tip if you get a croissant with filling like mine, smush on the center so you can spread the filling throughout the croissant. If not you'll get through half the croissant before you find the filling.  <br><br>I took away one star because I feel this place could use some improvements. <br><br>I'm not a fan of food places that do not have bathrooms. I don't need to eat the germs from the elevator buttons I pushed today or the door handles I grabbed. I'd like to be able to wash my hands before I scarf something down. <br><br>I also think this place is in need of some light music in the background to distract from all the noise staff makes. Between pots clanking in the kitchen, staff speaking French to one another, and what I can only assume to be a very loud AC system this place can become the opposite of relaxing if you stay here too long.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hCThWkVqVT0Z_xrVY5l-yg/348s.jpg", "caption": "Almond chocolate croissant"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oKdV7YkfyGmIeKpNoO9rag/168s.jpg", "caption": "Liege waffle"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZfGTbqcKuBJvFUAJOl7-XA/168s.jpg", "caption": "Lots to choose from"}]}}, {"review": {"des": "I don't understand why anyone complains about the \"density\" of the croissants here. Maybe they're used to the pedestrian, featherweight variety found at Jewel or popped out of a Pillsbury can. Granted, Hendrickx's croissants are rich with butter, but that makes them the satisfying little crescents they were meant to be, which explode with yeastiness and send bronzed shrapnel of pastry flying everywhere. <br><br>Aside from stellar croissants, Hendrickx offers gorgeous, decadent pastries, exemplary country breads, hearty soups, and simple but enormous and delicious sandwiches (get the curried chicken salad).", "pics": null}}, {"review": {"des": "Loved the place! Little off the road and hidden but so delicious! Very good coffee and baked goods! Definitely a place to stop by while shopping in the area.", "pics": null}}, {"review": {"des": "The treats we had tasted manufactured and fake. We've definitely had better pastries in Chicago.", "pics": null}}, {"review": {"des": "Free wifi.<br>Tiny storefront plus additional tiny hidden room for indoor seating as well as a bit of seating outdoors in clement weather.<br>Order at the counter and pay. Take purchases to your table to eat. Help is available to carry things. Excellent strong shopping bags and boxes available for carry out. Large variety of baked goods, croissants with a variety of fillings, individual tarts and cakes, as well as quiche, salad and sandwich choices. All are on a first come first served basis with a limited number of each variety available at any given time.<br>Large variety of coffee drinks. Many choices of teas.<br>I consumed a scrumptious chocolate cherry croissant, and a lovely lemon tart on premises with delicious French Roast coffee (no refills included).<br>I took apple tarts and croissants home to share.<br>I loved this little oasis and highly recommend that you try it.<br>The staff is very friendly, knowledgeable and helpful!", "pics": null}}, {"review": {"des": "Best croissants, macaroons, bakery in the city! I've been coming here since they opened and I've never been disappointed. Pretty sure I've tried everything on the menu that's vegetarian possible. <br>The unique seasonal additions sell out early so get there before it happens or you'll be mad at yourself!<br>Croissant flavors, endless perfected flavors. The plain, pistachio, almond, cherry, (all) are my favorite. <br>Macaroons the standard and seasonal flavors are perfectly light & chewy and melt in your mouth!<br>Sandwiches are huge and packed with flavor! The goat cheese, pistachio, honey & thyme is my favorite!<br>Country white breads, wow. Get the simple yet complex, tartine w butter & homemade jam, can't go wrong. <br>Soups are perfect in the winter. The split pea is unreal, if they have any Gruyere croissants, grab and dunk in your soup. Yum!<br>Coffee, tea & apple cider in the fall! <br><br>Ok, I've made myself hungry, it's time to pay them a visit, good thing it's 2 blocks from my house", "pics": null}}]}