{"name": "high-five-ramen-chicago-4", "reviews": [{"review": {"des": "100% worth the wait. I loved the intimate setting. Our server made us truly feel like he was happy we were there! The ramen itself is delicious and surpasses most of the ramen I have tried in the city. <br><br>Even if the wait is long- hop over to the BBQ place upstairs for a couple drinks and enjoy your time. This isnt meant for people who are in a rush but more for people who want to really be in the moment for a great experience. <br><br>Plus who doesnt love sake in a juice box!!!!", "pics": null}}, {"review": {"des": "I love, love the ambience here! It's a random spot and somewhat difficult to find. Just look for Green Street Meats and off to the side alley, you'll see the side entrance with a door leading downstairs to High Five. It's a small intimate spot with seating for 15. They take names and you just download the \"No Wait\" app to see where you are in line. Don't worry if it shows over an hour wait because depending on when you go, you do get lucky and everyone else drops off and you only need to wait 15 minutes. <br><br>Once inside, it's a small dark space and all counter style seating. There's multiple bowls of ramen flavors to choose from. The first time I went, I had the signature bowl with half-spice and it was way to spicy for me. When I went back, I did the normal spice and it was so much better! The broth is thick and flavorful. The pork is tender and has a good fat layer around the meat. Definitely recommend this place!", "pics": null}}, {"review": {"des": "This is going to be a depressing review so if you're a tl;dr kind of person I'll just sum up and say this place is a MAJOR DISAPPOINTMENT do not waste your time.<br><br>The important facts (the ramen itself):<br>- low quality, undercooked noodles<br>- sad, sad broth absent of umami flavor<br>- dull, flavorless pork belly buried under the chunks of noodle<br>- swarms of unnecessary large, pepper flakes<br>- unsettling, briefly lingering 麻辣 flavor on your tongue (often found in many low-tier instant ramen) <br>- extremely underwhelming presentation and aroma<br>- nothing to say about the raw bean sprouts and green onions  <br><br>The decor and atmosphere:<br>- don't bring your date here. <br>- you get the sense that they're trying too hard with random small objects as decorations with no interlocking theme nor any particularly admirable pieces that attract your attention <br>- disposable wooden chopsticks. Maybe this means something to you; it does to me<br><br>The service:<br>- expect to wait 2 hours on a weekday night (no reservations)<br>- expect to wait another half hour for them to prepare your order <br><br>I'm not mad, just appalled and confused. My review is not so much reflecting an unfulfilled hyped expectation but of the genuinely poor quality ramen. Can I have the empty space in my stomach back? <br><br>2.2/10 (half spice ramen)", "pics": null}}, {"review": {"des": "Ooh, the hype here is so real. With a small 16-seater restaurant that is \"reminiscent\" of tiny shops in Tokyo and a consumer base that is convinced this is the best ramen of their life, you'd expect this to be the best in all of Chicago.<br><br>I must digress and say that I was fairly unimpressed with my experience at High Five. It was definitely a tasty experience but nowhere near where the hype lends itself.<br><br>The concept of the space is that it's a fairly tiny restaurant located on the bottom floor of Green Street Smoked Meats, which is about 20x larger than the ramen shop. This works in Japan because there are hundreds of other similarly good ramen shops in the same area with the same size. For this spot to be small for the sake of being small (and generating a long wait of sometimes over an hour), I wasn't feeling it.<br><br>Nonetheless, my friend and I finally sat down for a bowl of their ramen after trying five times to come here and turning away because we hated the wait. We sat at the bar and was given a menu with 5-6 ramen options. We opted for their High Five Special ($14) with a warning that it's spicy levels are more extreme than we'd think. The special is their take on the hearty tonkotsu ramen so we heeded their warning and went for the half-spice.<br><br>Overall, our ramen was good and definitely spicy, but it was nowhere near the fabled amazing tastes that many people make this place out to be. The noodles were cooked well and had great texture and the spice unfortunately masked a lot of the tonkotsu flavor. The thinly sliced pork belly was nothing to write home about although I fell in love with their eff. This was the best part of the ramen's makeup honestly.<br><br>I did appreciate the post-meal oshibori which would typically be served prior to eating. High Five Ramen is good if you want to try a spicy bowl of ramen but nowhere worth the wait. When the clientele is predominantly Westerners, you may want to consider another ramen shop.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CAJWahyxzCtbFD0NaZ1tRQ/348s.jpg", "caption": "High Five Special ($14)"}]}}, {"review": {"des": "The ramen was good and the service was great, but I don't know if I'd be going here again. I've had better ramens in my life and I don't think it's worth the hour wait in line to get on a waitlist with another hour-long wait. <br><br>I really enjoyed the ramen noodles and the service was fast and friendly. However, we got the full spice ramen and I wasn't a big fan of the broth and the pork was extremely fatty that I couldn't even eat it. We also added the marinated shiitake mushrooms to our ramen. I'm usually a huge mushroom fan, but I felt like these were overly soaked in soy sauce and too salty to eat. We also got the yuzu vodka drink. It was a lot smaller than I expected, pretty good, but nothing special. <br><br>Overall, the ramen was average, the service was great, but it just wasn't worth the wait.", "pics": null}}, {"review": {"des": "Summary: 6 out of 5, fantastic ramen. If you're so into ramen that you watch ramen documentaries on airplanes, you will enjoy this. Don't come here looking for broth that isn't as rich as Scrooge McDuck (I'm already sorry for that reference)!<br>__<br>My wife and I moved to Chicago recently. One of the first foods we started researching here was ramen, because we're obsessed. High Five seemed to be the pretty unanimous recommendation across multiple sources, so we put it right at the top of our list and went as soon as we could. <br><br>As soon as we could was our very first evening in town, on a Monday. We went looking for the restaurant and we were just a little lost/confused at first, because High Five is underneath the inside part of Green Street Smoked Meats. You need to walk down the alley past the first few outside tables at Green Street, and then there is a door on the left with a hand print marking the entrance for High Five. You immediately turn left and go down the stairs to get to High Five.<br>  <br>So on this Monday, we arrived at 5:25pm, and were told it was going to be a 2 hour+ wait already, even though they open at 5pm. Psyche! So.... take two! We go back the next day, Tuesday, and get there at 4:40pm. There was a small line already, about 12-14 people ahead of us. We ended up being the last party in the first round of seating, because there are only about 16 seats in the restaurant. If you choose to wait, you can sit in the bar area of Green Street upstairs, get drinks, and wait for your name to be called. <br><br>We ordered almost immediately upon being seated. I went with the Full Spice Signature Bowl and my wife ordered the Half Spice. We waited about 30-40 minutes for the food and then the deliciousness arrived. <br><br>I was in love after one bite/slurp. The broth is rich and cloudy. It's entirely opaque but for the little bubbles of fat. The pork was tender and perfect; it had a little bit of roast/char/smoke flavor and fell apart in the chopsticks. Eating this ramen felt like how I imagine McDuck felt when he swam in his money (I'm sorry again... relapsed while reimagining the ramen). <br><br>The spice was exactly right for both of our preferences. The half spice is still pretty spicy, so if you're not into spicy food, I wouldn't recommend even the half spice. The full spice really builds up in intensity as you go. For me it was approaching the enjoyableness frontier by the end, so I would never consider getting the Kanabo spice. The menu says with the full spice, there may be sweating followed by pure euphoria, and, I can confirm this is a true statement. There was sweating, and there was extreme enjoyment. The portion was very large. I can eat a lot and I left very full, and the bowl only cost $14. Best value in America??<br><br>This was the best ramen I have had that was not in Japan and, yes, I know how obnoxious I am for making that statement. I mean this as a major compliment though, because it transported me right back to some of the best ramen I had in Tokyo, and it might be in my top 5 best bowls of ramen ever. It's just hard to find such a rich, cloudy, spicy broth combination over here. For what it's worth, I have a friend here in Chicago who regularly entertains business clients from Japan, and they always request High Five ramen if they can fit it into their schedules because it's the only place in the city that meets his clients' standards.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IzmOtYgM6nwS1ijqjgfMBg/348s.jpg", "caption": "Half spice"}]}}, {"review": {"des": "Here's the deal with High Five: Everyone who's anyone who loves Ramen has heard about it. So of course, you get hyped up and expect it to be the most amazing bowl of ramen ever. My friend and I got there 10 minutes before they opened on a Friday and still had a 45 minute wait ahead of us so there's your warning. The really nice thing is that they take down your phone number and tell you they'll text you when the table is ready. Green Street Meats is right upstairs, providing the perfect waiting area. We drank a couple of pitchers before finally being seated. <br><br>We were seated at the bar and the server came over to explain the menu options including the different spice levels. I typically enjoy a little bit of spice with my ramen so I went with the Signature Half-Spice. When it finally came out, it was too dark to really see what it looked like and after taking a flash photo (yeah I'm that person) I saw a plethora of chili flakes on there. When I took a bite it was SO SPICY. I'm talking about spice levels that didn't even allow me to taste anything else. It was hard to distinguish the flavor of the broth which is one of the most important parts of ramen tasting in my opinion. The noodles were OK but my honest opinion is that this place is definitely not worth the time spent waiting. <br><br>Everyone's flavor palate is different, so if this is on your MUST TRY list, go for it! The staff is friendly and there's nothing wrong with getting a good buzz in upstairs while you wait. However, if you're looking for a seriously delicious tasting bowl of ramen, don't bother.", "pics": null}}, {"review": {"des": "High Five Ramen was absolutely delicious. I ordered the vegetarian ramen that has mushroom broth and MAN was it good. Now you may ask why I am giving this place a 4 star review. Was it flavorful? Yes. Was it spicy? Yes. Was it worth standing in line at 4:30 and then putting our names down and waiting an hour? Not sure about that. It was very tasty, but not the BEST ramen I've ever had. Would I stand in line again? Perhaps, but not on a weekly basis like others who rave about this place. It is great ramen, but just prepare to wait for a while, since they only have 12 seats in the place.", "pics": null}}, {"review": {"des": "Crazy overhyped. Ramen was just....okay. Dare I say below average. I've only been once and don't plan on going back. I'm really not sure how this place has a 4star rating.", "pics": null}}, {"review": {"des": "what a cool setting...<br><br>But hey thats where the magic ends.  Beyond the dramatic walk down to the dark and secretive style basement bar setting...there is much left to be desired.  And boy was it hard to find too lol.  <br><br>Anyways, the ramen flavor / taste just lacked a signature punch to the palette.  It had a simple yet deep savory flavor to it, if that makes sense.  Not my style but to each his/her own.  The ramen texture is al dente just how I like it but again, it just didn't hit the spot.  The spicy ramen wasn't spicy and the soup broth wasn't as flavorful as I was expecting.  All in all, a safe pick but a regrettable one imho.  <br><br>*shrug*....On to the next...", "pics": null}}, {"review": {"des": "Mark another Asian restaurant near my neighborhood !<br>                                   it's fantastic!<br>You may think it's small, so people have to keep a long line to wait a table. Of course! But! But! People do like how it tastes and how it works.<br>Small dark underground restaurant! Two line bar tables. Serving food one by one. No complaints, but compliments!<br>I ordered the half spicy noodle and the special coconut drink(it's alcohol, not beverage! Good to know!)I like its cup. So interesting and creative! It seems like You drink from a skull. In addition to eat red spicy noodle in the dark atmosphere! Imagining whatever you can!<br>Tips: Don't forget to bring your ID even when you have no idea you will drink a fruit flavor alcohol. it's my third time! I am always 18 younger than I should be.lol", "pics": null}}, {"review": {"des": "This is a bowl of ramen that I will always crave. I've been to a good amount of ramen spots in the city, and this has to be my new favorite. After reading the reviews, I knew ahead of time there would be a wait. So our plan was to put our name in, and bar hop around West Loop until we get called (in this case texted).<br><br>On a Friday night, we put in our name for a party of two at around 9pm. We were quoted 2-2.5 hours, but we got seated less than an hour and a half. They will text you when you are next in line, which is about another 10-15 minutes until you are actually seated. While we waited, we went on over to Haymarket Brewery (just a short walk) for some beer flights.<br><br>I ordered the high five signature bowl (tonkatsu broth) with no spice. At first slurp, I thought the broth was a little salty, but combine with noddles, and the pork - it was just perfect. The pork belly is UNREAL, it just melts in your mouth but is so flavorful. Not sure if it is an option, but I would definitely order extra pork next time. If you are prepared to wait, then I think it's worth it, but I don't think it would be go to each time I crave ramen. <br><br>The place is tiny, just bar seating, and stays open pretty late. They play awesome funky beats to make the dim ambiance cool. I understand that they have a wait, and want quick turn around, but that's no reason to have poor service. You can tell by our server's attitude that she just wanted us to finish and leave asap. It's not a big deal - the service won't change the delicious food, but just something to note.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lvZsF0A6zQHhxnB3_zrsVQ/348s.jpg", "caption": "high five signature ramen!"}]}}, {"review": {"des": "I'm not really sure what the hype is all about. <br><br> 3 hour wait<br> tiny place<br> so dark you can't read the menu<br>‍ the RAMEN... ehh<br><br>I have had much better ramen than this and all I eat is ramen. There's no need for this wait or hype. You can get better ramen at most places. I wouldn't waste your time thinking this will be the best ramen you've ever had.", "pics": null}}, {"review": {"des": "This was high on my Chicago to-eat list and I am glad I finally tried it coz now I won't have those \"I wonder\" thoughts. It was not all that amazing in my opinion. Advised by friends' suggestion and fellow yelpers' reviews, I went in *without* expecting authentic ramen. I was expecting tasty noodles with interesting flavors. I got the signature bowl, no spice. My friend got the half spice bowl with a bunch of additionals (extra meat, egg, etc.). The no spice one had flat flavors - salty and smoky. The broth was incredibly rich and thick, almost too much.The noodles on the other hand were fantastically cooked. The pork belly was one of the best I have ever had. The half spice one tasted *exactly* like spicy Chinese hot pot, lol. <br><br>You do have to wait a little, but you can text them to get updates. We got a drink at Green Street so time flew by. Our waitperson was a little cold and off-putting, but since we were eating at a tiny ramen shop, we didn't mind it too much. She did ask if we wanted to take the broth to go, but I was like nah, I could just go to the supermarket to get hot pot soup base. No, I didn't actually say that, but you get the idea.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/bzps4GOLxq9hvRnERQjyFQ/348s.jpg", "caption": "half spice signature bowl with extra egg and pork"}]}}, {"review": {"des": "A lot of my ramen nerd friends love High Five Ramen, and frankly, I don't really get it. Sorry. <br><br>The first time I came here, I ordered the shoyu ramen. While it was good, it didn't taste like a shoyu ramen to me. It's confusing. It was more heavy on the nori flavor, which made it taste good, but not what I was expecting at all. <br><br>The second time I came here, I ordered the maitake miso ramen. It is very heavy on the mushroom flavor, which was expected, but it was so light on the miso flavor that I was confused. Didn't I order their miso ramen? Perhaps they should have called this their maitake burnt miso ramen. The smokiness was there alright. <br><br>I ordered a second bowl at this visit on the account that Kenny would finish what I couldn't. My second bowl was the shio ramen, and this was the only bowl that met my expectations for what a shio ramen would taste like. It's light, but the menu mentioned chicken flavor, and well, I didn't really taste that either. <br><br>Kenny always orders their signature tonkotsu miso ramen, but he always orders it full spice. This is unfortunate because after one bite of it, I'm reaching for water, so I can't comment on this. I'll have to order the non-spicy version to try next time. <br><br>Overall, I'd give High Five Ramen a 3/5 for their food. It just didn't impress me that much. I like they cook their noodles well, but ramen is about more than just the noodles. I typically judge ramen based on first the noodles, then the broth, then everything else. The toppings were great in all of the bowls I've tried-- the chashu is fine, the egg is fine, the bamboo shoots are tasty and doesn't have that weird canned taste that a lot of places do, and the mushrooms are delicious as well. I just hate that the broth never actually meets my expectations for what the bowl should taste like. I do like that they've never been too salty for me, as that's been my experience with a lot of ramen shops in the states.<br><br>Kenny tells me that I need to give their signature bowl (at no or half spice) a try. Perhaps I will one day, but I'm not crazy about the long line and wait to try it.", "pics": null}}, {"review": {"des": "AMAZING ramen! I have never been and I regret it, I have heard such good thinks about this place, but I also heard about the crazy long lines--which are absolutely worth it. <br>We went one evening and waited in line for it to open, we were in line at the top of the stairs and when we put our name on the list at 5pm there was about an hour wait already. <br>The good part is, that it is right below Green Street Smoked Meats and there is lots of space upstairs to grab a drink and hang out while you wait. <br>We got lucky, we had a party of 4 and we got seated at the corner end so we could actually talk to each other and see each other. <br><br>The spice levels: Always get MILD- you can always make it hotter but if it is too spicy  you can't really go the other way. <br>The pork belly is the best! Even if it's not on the bowl you get- ADD IT! <br>The mushroom bowl is AMAZING! I personally love mushrooms and it was the best thing in the world- good amount of mushroom flavor but not too much (I added the pork belly to this bowl). <br><br>Defiantly going to go back there this holiday season! Nothing like a good bowl or ramen on a cold winter day!", "pics": null}}, {"review": {"des": "Never would I ever think a new favorite place of mine would be a Ramen restaurant. Sure I like Ramen, but it is probably one of the last things I would think about when choosing somewhere to go...until now. I am still thinking about just how good this ramen was and how flavorful the broth was. I'm already ready to plan another visit. <br><br>Let me start by saying, this place is not easy to find. Even though I knew it was in the basement of Green Street Smoked Meats, I still spent a few minutes wandering around aimlessly looking for the entrance. Once downstairs we were told it was about a 1 hour 45min wait- I had heard about the wait here and was thankfully prepared. We grabbed some drinks upstairs at Green Street and got our text about an hour and 15 min later. We made our descent into the tiny dark bunker basement and were greeted by our server immediately after being seated. <br><br>I had the no spice signature bowl(I'm a wuss when it comes to spicy and I have heard that even the half spice is super spicy). It was fantastic. From the thick, smoky broth to the chewy noodles, to the perfectly soft boiled egg it was a fantastic bowl of ramen. The portion was quite large and had to get some of it to take home. <br><br>I will be back and probably get the exact same thing. You don't mess with perfection!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rgEnqaiUIl1ULC2aKKAH5g/348s.jpg", "caption": "No spice - so flavorful!"}]}}, {"review": {"des": "Never been to a ramen shop quite like High Five. It was an interesting (and tasty) experience! First off, it's pretty difficult to find as there's no clear sign outside, but trust me - it's worth looking for. It's located in the basement of Green St Meats. Super dark, small space that plays grungy rap music. Definitely attracts more of a younger crowd. <br><br>Got there 30 minutes before they opened on a Sunday night and there was already a long line forming by the staircase leading down to High Five. At 5pm they let the first group of eager diners into the restaurant. As for everyone else - you sign up on the waitlist and leave your number for the hostess. They text you when your table is almost ready and you have 10 minutes to return downstairs. Even with arriving half an hour before they opened, we still had an additional hour and a half wait after getting downstairs to put our name on the list. However, it's worth the wait and lives up to the hype. Plus you can grab drinks from Green St Meats while you wait. <br><br>Now let's talk about the ramen. Those noodles were springy and chewy, just the way I like them! I got the Signature Full Spice bowl which was the perfect spice level for me - hot, but enjoyable. If you have a lower spice tolerance, I'd recommend going with No Spice or Half Spice. The broth was rich and satisfying, the egg was cooked perfectly, and the pork slices were melt in your mouth delicious. I slurped up every last noodle and left that dark basement with a very happy belly.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BkpmOXwHzKtIAOnkaxj8nw/348s.jpg", "caption": "Signature Full Spice"}]}}, {"review": {"des": "One of my friends that lived here recommended this spot because she was told how good it was. However she never came in to actually taste test it prior to us coming in. Now just as a heads up, the wait is going to be 2-2.5 hours typically. The reason why is because of the limited seating, which reminded me of the traditional ramen places in Japan. However their waits were never more than 30-45 minutes. <br><br>I didn't have a good jumping off point as I didn't know where this place was. There's just a hand print on a door, no name. Cool, but not when you're trying to find a place and are looking for a name. Then when I found the door, it was locked. The hours are published on the door that say they are open at 5pm. However due to the holiday I thought maybe it was closed because of this. I called the establishment and the girl who spoke to me on the phone said they open at 5pm. I said that's great, it's 530pm and the door is locked. She helped guide me through another establishment to get to a door that says EXIT, but also has the same logo as the hand print. VERY CONFUSING for this first timer. I finally got into High Five and walked down the stairs to see this dark dingy place of about 16 seats. The hostess notified me it would be a 2.5 hour wait. The good thing is they text you when you're table is ready. You can also text them back to see how many people are ahead of you so you can start making your way back. They allow 10 minutes to get back to High Five before your table is given away. Upon returning there was another party that was returning as well and the hostess said I texted you 12 minutes ago so if another party comes in before you that I texted I have to give them your seat. WOW! The woman was furious and said I've been waiting here for 2 minutes! <br><br>High Five offers 5 different types of ramen. Their signature bowl is described as a rich, creamy tonkotsu miso broth served w/ pork belly, alkaline noodles, seasoned egg, black garlic oil, bean sprouts and scallions. This is ramen we all selected. Of the 3 of us, none of us were fans. Pretty disappointing to wait so long to have below sub par ramen. The broth did not taste creamy, nor rich. The only positive about the ramen is that it came in a much larger bowl than most ramen places. <br><br>The positives of this place is that they offer sake in a juice box and they were playing some good old school hip hop jams. They unfortunately don't offer the traditional Sapporo, only black, but they do have Asahi. They do offer 3 different types of spice levels which is always good for those that are unsure of how 'hot' is hot.<br><br>There are much better ramen places in Chicago than this place w/ the wait time cut drastically. This place is just a lot of hype in my opinion. Same your money and time for a better tasting experience.", "pics": null}}, {"review": {"des": "It is a very different restaurant.  The restaurant is in a basement that is easily missed.  The set-up is very simple with a bar table plus a long table facing the wall.  <br><br>The menu is simple with limited choices.  I ordered the signature High Five bowl.  The bowl is huge.  The Raman is chewing and tasty.  The egg is cooked right with almost well-cooked yolk.  I wish the soup is less salty and more veggies.", "pics": null}}, {"review": {"des": "We saw a line thinking it was for the bathroom in Sawada Coffee, but it was to put your name down for this place. Seats about 11 people and really dark in there. <br><br>What I ordered: High Five Signature Bowl no spice ($14)<br><br>Taste: it was okay. but didn't think the price was worth the actual bowl.", "pics": null}}, {"review": {"des": "I can't rave enough about how delicious the vegetarian ramen is here. The noodles are also vegan and chewy and springy and wonderful, which is difficult to find. The broth of the maitake ramen is very earthy and mushroomy. It's unique and less creamy than I usually enjoy, but I think I liked this more than other creamier ramens I've had. I've gotten the maitake ramen twice now, once with half spice and once with no spice but with chili flakes on the side. The half spice was surprisingly spicy--I normally love spicy food, but even this was a little much, and I can't imagine what the full spice might be like. From now on I'll likely get the no spice, but add some chili flakes (just ask the server) and chili oil to my liking.<br><br>I also got the matcha lemonade cocktail, and it was amazing! It was kind of like tart matcha ice cream with a strong matcha flavor. I highly recommend this drink.<br><br>I must also mention that this place is small and popular, so if you don't want to end up waiting for 1-2 hours, I'd recommend waiting in line before it opens. At least 10-15 minutes early on weeknights, and even earlier on weekends. As an individual, I arrived 10 minutes early on a Saturday evening and ended up having to wait around 1.5 hours.<br><br>Overall, I felt that this place lived up to the hype.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/nafbBWZqWn_eRwg-z6tDxw/168s.jpg", "caption": "Matcha lemonade"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_tviTHxd0WHniJa6_m4Uog/168s.jpg", "caption": "Maitake ramen"}]}}, {"review": {"des": "Wait : well the longest wait ever, I've been waited to try this ramen since I moved to Chicago about a year ago! Lol finally! First come first serve visit. Make sure you put down your name way before you get hungry! It was 2.5 hr wait for two ppl on Sunday 5:30 pm<br>Service: friendly and causal <br>Environment : very small place, underground, max 26 ppl, not crowded and not that noisy w interesting decor <br>Food : tried their signature very hot ramen. It's a spicy side for me, well I think I can handle spicy pretty well.Recommend to order medium one! <br>Their broth is one of the kind, think, tasty and flavorful. I'm a ramen hunter and I've tried many places in New York and Chicago so far. This is worth the wait. <br>Drink : don't try the coconut and matcha ones, <br>Overall: will definitely refer to my friends and don't mind going there again if the wait is not that long", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/A39MDnO_BL_AR7SANgy79A/168s.jpg", "caption": "Coconut Painkiller and macha lemonade"}]}}, {"review": {"des": "If you can take the heat and need to warm up on a cold day...  Order the Full Spice Ramen. I love the smokiness of the broth! There's always a long wait time, but it's always worth the wait. One of my favorite ramen restaurants in Chicago.<br><br>I always tend to go middle of the week and the later in the evening the better. The restaurant is very small, and wait times can be several hours. Just leave your name with the host, and have a few drinks at some of the other restaurants nearby.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_KjLYCOyiAAeV06JdmELnw/348s.jpg", "caption": "Full Spice Ramen //"}]}}, {"review": {"des": "Honestly was very disappointed with food. I think it was mainly how salty the soup base was. <br><br>The venue is dope. <br>The service was quick once we sat down (2 hr wait otherwise). <br>Food quantity was decent but you did pay 15 for ramen. <br><br>It's a cool spot to check out, but with all that Chicago had to offer on this trip, this was my least favorite meal.", "pics": null}}, {"review": {"des": "I have heard nothing but RAVE REVIEWS on High Five Ramen. \"You have to try it\". \"Its soooo good\". Okay, so I made serious plans to try this spot. I mean, I had to. It's voted one of the best ramen spots in Chicago whenever I'm researching. However, everyone says the wait is stupid crazy long. Hmmm, I don't like that. I love ramen so of course I want to try the noted best places, right!?!?!?<br><br>I went after work with a friend one night. I made the mistake of looking at some site and it said they opened at 6. So I raced there and got there at 5:25. I waited in my car because it was cold and snowing. After 10 min, I checked google for some reason and it said they opened at 5! So I raced out the car and get there and the wait was already 45 min. Please note, this place isn't easy to fine. You have to enter through Green Street Meats and go downstairs. But back to the wait...45 min...Not too bad. We went to Green Street and got a drink. The drink was great, but that's for another review. <br><br>Anyway, the waiter/bartender, Armand was great. So sweet and talkative. One thing I didn't like, you do feel rushed while you're there. They want you to order, eat and drink, and get out. No time to linger, which makes sense considering their wait times and there are only like 16 seats (insert side eye). However, I don't like feeling rushed. Armand let us sample their slushees, they were just okay so I stuck with a beer. The matcha lemonade had a very strong matcha taste. Now I love matcha lemonade but this was strong earthy tasting. The coconut painkiller was a little better but nothing I'd want a whole glass of. Mixing the 2 is also recommended and that did taste pretty good, but again, I wouldn't have wanted a whole glass of that. So beer it was. <br><br>Armand did a great job of breaking down all the ramen options. He knew his stuff. I ordered the High Five Signature, no spice. It didn't take long and I watched them make it. It's so small in there, you can't help but to watch. The broth was way darker than I'd seen before but hey, this is High Five Ramen. I tasted it...it was okay. It tasted burnt to me it Armand said they go for a smokey taste. It was different from any tonkotsu broth I'd had before. Hmmm, I wasn't feeling it. The noodles were good and cooked perfectly. The sprouts were fresh and the pork belly was pretty good. <br><br>Overall, I can't say I LOVED High Five like everyone raves. I'm happy I got to try it so I can say I did but I don't get the hype. Especially when people wait 2 hours and such. I would never. I would say definitely try it if you love ramen like me and my friends, but would it be an often go to of mine...nah.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tKvuGApi-womfyv6-1vdog/348s.jpg", "caption": "I wanted to put the spoon up a bit so you can see how dark their broth is."}]}}, {"review": {"des": "Pro-tip: Come before High-Five Ramen opens on any of the weekdays except Friday. <br><br>They use the No-Wait app, so you can walk around or grab a drink while waiting. You have 10 minutes to make it back when they tell you it's your turn, otherwise you lose your spot in line. The place has 16 seats and boy are these seats uncomfortable. My friend joked that it's so we'll eat and hurry and leave. <br><br>I got the Signature Bowl with Half Spice and it was so GOOD. But I do wish I had gotten no spice. One of my friends got the Matcha Lemonade slushee and it was super yummy, but has a strong lemonade taste first AND a strong matcha taste afterwards so be ready for both.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Q7U02YqVorsyS_GeRY1XJw/348s.jpg", "caption": "Signature Bowl w/ Half Spice (my friend helped me get this pic with her phone flashlight)"}]}}, {"review": {"des": "High Five lived up to the hype (and the long wait).<br><br>It opens at 5, and by 4:30, there was already a line out the door. There are 16 seats in the restaurant, so if you want any hope of eating without a 3 hour wait, I'd get there early. We only had to wait 45 minutes and had a great time getting drinks at Green Street Meats upstairs. <br><br>For only $14, you get some really amazing ramen. And a huge bowl of it. I opted for extra noodles, which was perfect for leftovers. Unfortunately, the leftovers were nowhere near as tasty as the first round. I tried not to cry about it. <br><br>I'm really glad we stopped by to say we tried it. It was by far the best ramen I've had in Chicago, it just takes some planning and strategizing to eat there.", "pics": null}}, {"review": {"des": "If you love Ramen and have asked anyone for a recommendation you no doubt have been told, try High Five. The tales of the wait I am sure also linger in your mind. Well, I am not here to dimmish the wait times because they are true. We went on a Tuesday night at 5:30 pm (30 minutes after they open) and our wait was a solid 1 hour.<br><br>I got the Signature Bowl which features a rich creamy tonkotsu miso broth, with the half spice. First the spice, the half spice feels like a comfortable level to get to know the ramen, open your nasal cavities but keep eating. However, the overall flavor of the ramen wasn't one that I felt was what I expected from a tonkotsu Ramen. The flavors were bold however not as great as I expected. Maybe its worth trying something else but the tonkotsu was more smoky than I expected.<br><br>I think you should try this place once to see what the hype is but dont go out of your way.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zVCq2F1BnrxiCnFrmWJcDg/348s.jpg", "caption": "Signature Bowl"}]}}, {"review": {"des": "Hands down the best ramen place in Chicago, or midwest even. This place is always so dang busy, so plan around with it because I even waited 2.5 hours on a Monday night to get a seat. Actually I've waited 2.5 hours every time I've come, and end up taking a trip to Whole Foods or a nearby bar. <br><br>I get the signature bowl half spicy - which definitely packs a ton of heat and flavor. The noodles are my favorite part of the entree as it just tastes so fresh. The pork is so moist and tender. The broth is super rich as well. But be careful slurping it all up, I've walked out with a bloated stomach and food coma every time.", "pics": null}}, {"review": {"des": "Best ramen I've ever had, good golly Miss Molly. <br>Eat it all, u can't go wrong unless u zip your dong.", "pics": null}}, {"review": {"des": "Eating at High Five Ramen is more than just a meal, it's an experience. Your whole night builds around it, all leading up to the moment when you finally get to plant your butt down in one of their 16 seats. By then, you probably have had a few drinks, as there's nothing around Hi Five Ramen but more amazing restaurants and bars. You wonder to yourself, do people like High Five Ramen so much because they are mostly drunk when they had it? And mad hungry after waiting for 2 hours? <br><br>WRONGish, their ramen really is that amazing. Their broths are so deeply flavored, whether you choose the lighter smokey shoyu or their rich and creamy tonkatsu. Then if you are up to the challenge, their famous house spice will elevate your ramen to the next level. It's a flavor you will find familiar if you've had Szechuan food before, that tantalizing, tongue numbing, \"mala\" spiciness. Together with their tonkatsu broth, it is the ying and yang of flavor combination. The spiciness cuts through the overwhelmingly rich broth while its creaminess soothes your flaming taste buds. <br><br>Overall, i think every food lover should bear the wait at least once to give their ramen a try, it's pretty amazing.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RtEr4p5hjcHvdXlV0qPVnA/348s.jpg", "caption": "Shoyu ramen, no spice."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Cj4qe3f2qZG9q5MXcJmyRA/168s.jpg", "caption": "Matcha gin lemonade slushee"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/e2OloIZw-1D3oFTLMo3aQQ/168s.jpg", "caption": "Total Japanese izakaya feel with the small cramped space."}]}}, {"review": {"des": "The signature half spice is SO GOOD I actually have dreams about it.  <br><br>The broth is thick, the meat is cooked to perfection, and the egg is to DIE for.<br><br>I went by myself on a random Tuesday night after working late and got seated right away, however I have heard that it's hard to get in during regular dinner hours especially with more than 1 person. The place is small and seats maybe 16 people total.", "pics": null}}, {"review": {"des": "ITADAKIMASU! <br><br>Time to eat! I honestly couldn't find this place and instead went to Green Street Meats, but as I left Green St. I noticed a peculiar door with a symbol on it hidden in the wall and went in. Did I discover the secret lair of some Teenage Mutant Ninja Turtles? Was it a underground government lab where untold horrors take place? Unfortunately, no and no...it's just High Five Ramen.<br><br>As I ventured into the dark depths, I realized it was 10 minutes before closing time. It was really dark inside, like a shady hashish room where you meet an informant in, but no smoking is allowed here. In front of me was just a couple, they were playing on their phones while they waited. After about 5 minutes someone left and they seated the couple. A few more minutes past and the host came over to me and said it might not happen tonight seeing how there's 5 minutes left and a full house. He said I could wait a few minutes to see if someone else left...noone did. I turned around a broken man, humiliated, defeated and left...tears swelling up in my eyes as the door closed behind me.<br><br>As I walked down the street, I took a minute to check my phone. The sound of a door opening catches my attention and the host rushes to my side, \"I was looking for you\" he said anxiously. \"I didn't want you to leave and found a spot for you\" he added.<br><br>We scurry down to the dungeon again and I get seated at the bar. I order a half spice Maitake ramen with pork belly. After a few minutes it came and looked DELICIOUS! From the seasoned egg, black garlic, to the pork belly everything was cooked beautifully. The spice was a bit much though and threw off the natural flavor. At the end of everything I was given a hot wet towel, ginger to freshen my breath and some Japanese candies.<br><br>Overall I would give this place 4 stars because of the extremely small, cramped space with no lighting, but because of the accomodating host it pushes it to 5.<br><br>5 out of 5 stars.", "pics": null}}, {"review": {"des": "I only have Ramen in the winter, but High Five might have changed that for me. <br>High Five is kinda like a speakeasy. Its attached to Green St Meats, you take the stairs down to this basement with around 16 chairs. Its dark, secluded and looks more like a place where you can get sazerac then a nice bowl of soup.  The wait can be long, but its deff worth it. <br>I have had Ramen at a couple places and this is no doubt the best! The flavors are insane, you will want to lick the bowl clean. I seriously think the bowl of Tonkotsu cured my sinus infection!! I got half spice which was had a kick but not too spicy, perfect. I will be coming back many times in the near future!!", "pics": null}}, {"review": {"des": "Best ramen ever! Come early and put your name down on the waiting list. Then grab drinks upstairs or at another bar close by. It's worth the wait. The signature bowl was delicious. I can handle spicy food and half spice was more than enough for me. My wife got the maitake ramen which is vegetarian and it tasted just as good as mine which was surprising. Definitely will be coming back here again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TI-1ejMCziKBVf4EZattKQ/168s.jpg", "caption": "Signature bowl. Half spice"}]}}, {"review": {"des": "4 hours wait/ $85 spending<br>I cannot believe we waited for 4 hours for this.<br><br>+: unique, cool music, cool concept, good pork belly<br><br>-:  wait TOO long. soup is lack of body, very salty, the ramen is is more like instant noodle than well prepared ramen, not cheap, they use Chinese spicy sauce( lao gan ma) instead of Japanese spice. <br><br>Conclusion: it's for white people who don't know what real ramen or price for ramen. I would still eat there if there is no wait. It's not terrible. <br><br>Tip: you will want to drink a lot of water when you get home", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wyUq0l2-JXEhEay8LoIvlg/348s.jpg", "caption": "Signature half spice"}]}}, {"review": {"des": "Imma hit you with the bottom line up top: if the wait is more than 30 minutes don't bother. If it's less, it might be worth a try because upon reading reviews it seems the ramen itself is hit or miss based on taste preference.<br><br>Unfortunately for me, I waited 1.5 hours to find I didn't like the ramen or the experience. I knew going in it's a very small, dark, basement-like room with about 15 bar stools and (I assume) because of this, only a few people working. I thought this would be kinda cool but it was just kinda depressing instead :( The best part of the night was actually grabbing a beer at Green Street and meeting new people while waiting. <br><br>But I digress. For food and drink I ended up ordering the high five bowl at half spice and a coconut painkiller. Everything came out pretty quickly but without social seatmates, I was strangely left to stare at myself in the mirror whilst eating. And usually I love that nose-running spiciness that burns but you keep eating anyway cuz its so good, however this kind of spiciness just made my stomach turn. The broth tasted tomatoey to me, and didn't have the complexity that I love so much. I did like the egg. And the prices weren't bad either (especially for west loop). Sadly, High Five just wasn't for me.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Abg4fSn6scSRS6Fn4i5ggw/348s.jpg", "caption": "Outside entrance"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Pkc7htCXj_KV3kivW7VJcQ/168s.jpg", "caption": "Half spice bowl - not my jam"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tKqFrgHbHjJ17YGn52YjgA/168s.jpg", "caption": "Coconut painkiller - just ok"}]}}, {"review": {"des": "Ridiculously delicious.<br><br>My biggest tip: don't randomly come here on a Friday or Saturday night because most likely you'll be waiting two hours for a seat. What I do is come here half an hour before they open, get a drink at the bar upstairs (Green Street Meats), and wait in line. Boom. <br><br>The scene: dark, good music, and bar stools that only seat 16 people. <br><br>The food: delicious. I always order the half spice ramen. It's the perfect amount of spice and tastes smokey (in a good way). The noodles are perfectly cooked. <br><br>The drinks: love the little alcoholic smoothies they offer, it helps cool off the spice. <br><br>I just cannot get over this place, it's so dang scrumptious!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lizgQAwfoD6RR-rsziCgBA/348s.jpg", "caption": "Alcoholic slush!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5rTpoJDdU82wJo2QmB6tZA/168s.jpg", "caption": "The mini alcoholic slushis come in tiki-style cups"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/n9TZSzz_yih8B5udaLty4Q/168s.jpg", "caption": "The girls and I enjoying our high spice ramen"}]}}, {"review": {"des": "My overall opinion is that the portions are good, and the toppings are good. The flavors were fusion and very intense. If you like your foods heavily seasoned and very umami, this does the trick. Realistically, I'm at about a 3.5 but I rounded my review up to 4 stars. While it's good, I wasn't wowed. I wasn't totally obsessed with it, nor do I crave it, and I definitely wouldn't wait in the long line just to try it. Does it live up to the hype? Sorta. The flavors definitely create their own profile among Chicago's ramen joints. It's not my favorite but I'm glad I tried it for the experience.<br><br>My boyfriend and I came here about 30 minutes before the doors opened and snagged the 7th+ 8th places in line or so. Score. We're glad we went early. We would have rather waited a bit before the restaurant than after it opened when the line became ridiculously long. If you go before the restaurant opens, you need to enter through Green street meats, and you'll find it through an obscure, unlabeled door, that leads to the basement.<br><br>We tried the high Five Signature Bowl with half spice, Shoyu Ramen, and mixed flavors of the Cocktail Slushie. <br><br>The spice in the ramen reminds me of Sichuan/Szechuan in Chinese cooking. I'm glad we went for the half spice. We both have good spice tolerance, but the full spice may have been too intense to enjoy. The porkbelly was delicious and had a rich smokiness to it that really enhanced the flavors. <br><br>This didn't affect my rating, but I wasn't a big fan of the ambience. It feels like you're in someone's basement, although we were literally in a basement. It's dark, and compact - just enough room for comfortable elbow space but also tight enough to hear your neighbors and the servers' conversations. I personally like my natural lighting, and open patios, but even if that is also your style, don't let it deter you from giving this place a chance.", "pics": null}}, {"review": {"des": "After reading all the reviews of High Five Ramen on Yelp, I wanted to try it out to see what all the hype was about. I admit that the concept of this restaurant is very interesting. The place is located in the basement of the building that's split between a coffee shop and another restaurant/bar. Mysterious right? When I first looked down the stairs at the door to this ramen shop, it kinda looked like a dungeon. It definitely gave off an eerie vibe that, of course, attracted people even more. <br><br>Realizing that the restaurant could only seat around 16 people at one time, my friends and I lined up at the restaurant almost an hour in advance. When we came to the front of the basement's door, we found four people already in line. I thought \"wow, this better be good if I'm waiting over an hour for ramen\" and \"I thought we were crazy for coming so early but there are already people standing in line.\"<br><br>Anyways, once we got inside, I realized how dark it was. It was like a haunted house but with ramen. Interesting. I ordered the High Five Ramen with a side of spice because I was afraid that the spice would be too much for me to handle. My boyfriend got the Kanabo Spice ramen which is apparently the spiciest ramen (you'll see warning signs about this ramen). My boyfriend said that the spice was not incorporated into the broth, rather, it was dumped on top of the dish. I'm glad that I got the spice on the side so I could adjust the spice level as I eat. The spice was good but too much could make the dish overwhelming. The broth here was commendable- very savory, flavorful, and hearty. The noodles were also the right consistency and texture (chewy and soft). <br><br>Overall, it was a unique experience. Would I wait for more than an hour for this? Probably not.", "pics": null}}, {"review": {"des": "It's underground hidden in another store. Very cool place to go. It's very small and dark with only bar tables. Normally there is a long line. <br><br>I ordered signature ramen with full spice. It's soooo good. The soup is a little salty but not greasy at all. The chashiu in it is super tender delicious. Noodles are very chewy. The egg combined with the soup is heavenly! Highly recommend!", "pics": null}}, {"review": {"des": "My favorite ramen shop of all-time. Every time I go to Chicago, I go here if I can. The food here is amazing and I just love the uniqueness of this noodle. I try to wait for this place which, I agree, is ridiculous but it's the only place that I would wait 1-2 hours for. Any other place, I would and could not do. Love this place.", "pics": null}}, {"review": {"des": "Visited here bc I was craving for ramen while visiting Chicago.<br>Overall, the ramen was great but the broth was a bit salty for me. If there was more water added in soup, it would have been perfect. I got signature ramen with half spice.<br>The level of spiciness was good for me. The broth wasn't greasy at all, which was another plus. <br>I did have a difficult time finding the entrance to this place. Make sure to look at the door carefully. Multiple places are in the same building so you may get confused if you dont pay attention.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MFjNCBQdwYIrH7I_6GboIw/348s.jpg", "caption": "Half-spice"}]}}, {"review": {"des": "Amazing!   The Signature Bowl is the way to go.  Be careful on the spice level.  Full spice is only for daredevils.  <br><br>The pork belly is he best I ever had.", "pics": null}}, {"review": {"des": "I'm not a Chicago native so I don't know the ramen scene, but in the pantheon of ramen places this was very average. I got the signature no spice. The broth was overly rich with muddled flavors without the clear silky flavor of the pork broth and the noodles did not have any of the texture or bite to complement the broth. I did think the pork was well-cooked. <br><br>Factor in whatever the wait is (I waited half an hour before opening; if I had to wait longer I probably would have been very annoyed) and I would not find this a worthwhile experience. I would not come back. <br><br>FINAL RATING: 2.75", "pics": null}}, {"review": {"des": "I came here exclusively because thrillist listed the kanabo spice bowl as one of the spiciest dishes in Chicago. I was reluctant because, though a friend of mine runs a pretty good ramen joint in my hometown, I'm not crazy about ramen. But I love spicy.<br><br>The kanabo bowl is heralded as \"so spicy the staff tells you not to order it.\" They got me hook, line, and sinker.  As a person who likes to kick up the heat, the kanabo bowl was not nearly as spicy as I expected, and a little less spicy than I'd hoped for.  I'm in it for the sweat and tears, and I had minimal expression of either.<br><br>Nonetheless, the bowl was pretty spicy, induced an excellent numbing sensation augmented by the sips of water I had, and was overall a pretty tasty concoction.<br><br>The overall presentation of the bowl as far as ramen goes was average - the ajitama was delicious, the pork belly was wonderful (as should be expected from a place attached to a smokehouse), the sprouts were fine, but mushrooms and bok choy were paid for add-ons. In my limited experience a bowl of ramen requires more green and vegetable matter.  Nonetheless, it was a delicious bowl.<br><br>Also, I ordered the \"Coconut Painkiller\" cocktail slushie.  It was delicious, but perhaps not worth the $9 pricetag, as the serving size was about 3-4 ounces. <br><br>Overall, a good experience, lacking a star only for making a joke of spiciness and not coming close to delivering on the advertised spice levels (maybe midwesterners can't stand the heat). The door to the restaurant wasn't easy to find.  Also, this restaurant and the entire neighborhood is way too hip for its own good, but hell, if that's what's selling, that's what you sell.", "pics": null}}, {"review": {"des": "We had heard the hype about this being the best ramen in Chicago. We got there right before it opened at around 5:30 and there were already people lined up. We grabbed a beer at Green Street Meats while we waited, but we were able to get right in on their first seating. It's a very small, dark space - it only seats 16 people. The hibiscus slushy was delicious and pretty reasonable at $8.<br><br>I had the classic ramen bowl no spice and my boyfriend had the half spice. The spice is interesting - it's Thai spicy rather than Mexican spicy, so even though I don't like spice, it wasn't too spicy for me. The ramen was definitely good, but it wasn't mind blowing. The broth was missing the layer of flavor that makes ramen so delicious. The noodles were good and the egg was perfectly cooked, but l don't think its worth the hype and I probably won't be back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YpgKXhvDrS5P4fhUPBeQEw/168s.jpg", "caption": "Classic ramen bowl no spice"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fTmlAfgcRNUroxG9c8wOMg/168s.jpg", "caption": "Hibiscus slushy"}]}}, {"review": {"des": "Ramen was phenomenal. The wait was in classic west loop fashion.  We put our names in at 6:15 and were seated around 8:45.  As long as you plan to spend your wait time at another bar, it's not too painful! Very worth the wait too.<br><br>The restaurant itself is tiny, in the basement of green street smoked meats.  There are just over a dozen seats in the whole restaurant, which explains the wait.  There's one big bar that wraps around the corner, and then an adjacent smaller bar that faces the back wall.<br><br>The ramen itself has a bit of a Thai twist to it, it's a rich and spicy broth, with all the usual fixings - tender pork belly, soft boiled egg, etc. I had the medium spicy which was a pretty perfect amount of heat if you want to sweat a little.  Overall just a delicious bowl of ramen, and a fun overall atmosphere/experience.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dp8vk0puhbYYX7ebq6k4_g/168s.jpg", "caption": "Did not photograph well in the low light, but trust me, it's phenomenal"}]}}, {"review": {"des": "The five in High Five Ramen is for the five sh*ts in a row you will take in the 12 hours following the meal. <br><br>Good pork belly!", "pics": null}}, {"review": {"des": "Pros: 1) great vibe. It's underground and dark and has a very intimate feel in the restaurant. 2) the staff was sweet and helpful. <br>Cons: 1) took me five minutes to find the door to this place. 2) the ramen itself...was okay. I've had better ramen. I ordered full spice which was a mistake, because it was way too hot. I might need to come here again and get the half spice to give a better opinion of the food.", "pics": null}}, {"review": {"des": "This is such a hidden gem (but not so hidden since it's well known). It's the tiniest ramen place I've ever been too. The seating is legitimately the bar area and a couple other tables but like most hole-in-the-wall places, it's definitely worth it. I arrived just went it was about to open and there was already a line forming up so get here in advanced or be prepared to wait. <br>The place is pretty dark since it's kinda in a basement but it's cozy and the server at the bar was very friendly. I got the tonkatsu ramen and it was so delicious. The broth was so rich and flavorful and imparted a great flavor on the noodles which were perfectly cooked and chewy. Amazing to slurp up! You can add some of their house spice to take your ramen to a whole new flavor profile but it's a little on the spicy side so beware if you're not a big spice fan!<br>If you can, check it out!", "pics": null}}, {"review": {"des": "To summarize in one sentence - the food is amazing and worth all the hassle.<br><br>You have to get here early, even before the restaurant opens, as a line forms out the door to get your name on the list. Once the doors open, if you're towards the back of the line, the wait can be up to 1 hour since the restaurant itself is so small. You can put your number down and they call you when the table is ready. Except, they called us very early and we had to wait another 15 minutes before the table was actually ready. It didn't help that the hostess was exceptionally rude. This whole hassle of a tiny restaurant, exclusive seating, rude hostess was what knocks this down 1 star.<br><br>The food - we got the Shoyu Ramen and the half spice signature bowl. I really like spice and wanted to test the waters at first. If you can handle spice, it's not bad AT ALL. I'm sure you can handle the full spice without issue. It's a great flavor and has all the usual ingredients of a ramen bowl. I think the standout for me was the pork belly. A lot of times, ramen shops have flavorless pork and they give very little. Not the case here - we had 3 slices in each bowl and they were flavorful, juicy, and not too fatty. <br>The Shoyu bowl was great as well, especially if you come with someone that doesn't like spice. It had a very light flavor and tons of crunchy vegetables.<br><br>To reiterate - the food makes it worth coming here despite all the hassle.<br> <br>My message to the restaurant - train your hostesses to be less rude! Her entire demeanor soured our experience. Also, don't call people until their tables are actually ready! We shouldn't have to wait another 15 minutes after we get a message that the table is ready to go. Otherwise, great food!", "pics": null}}, {"review": {"des": "Ok, here are my thoughts. I don't think this place lived up to the hype, but it is still good ramen. I got the shoyu with extra pork, marinated mushrooms with spice on the side (which was just red pepper flakes I think) so you gotta use the chili oil that's on the counters. It had the right spice level and the pork meat was very very good. Def go for the extra pork because I still ran out with a lot of broth left. In my opinion, I still liked ramen takeya better and you don't have to wait 3 hours for a table. My husband on the other hand, has the signature bowl which he absolutely loved. Broth was very different and unique and while I thought the flavor of it was decent I couldn't have a whole bowl of it. Broth and over all flavor better at ramen takeya but meat def better here. Staff very friendly.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6HRVJtWpHDP_j6YjCdpLPg/348s.jpg", "caption": "Shoyu Ramen"}]}}, {"review": {"des": "A-mazimg. Since visiting , I have not found Raman that's been close to that experience - till now. I will be back.", "pics": null}}, {"review": {"des": "Overrated and overpriced. Do yourself a favor and go somewhere else. I will say the pork was delicious  but that the broth and noodles were not worth the two hour wait.", "pics": null}}, {"review": {"des": "Very flavorful ramen, definitely top 5 in Chicago. The first time I went, I sweat my balls off. The meal was fire literally and figuratively.  The spice tore my mouth up, but surprisingly my stomach was fine afterwards.   When I went back it wasn't that spicy but it still packed a good punch and pretty salty.  I've gotten the half spice each time. <br><br>The space is super small, which means the wait can be really long... at least an hour.  It's also very dark downstairs with some good music.  They black out your sight and hearing so that your body can absorb all the spice. While you wait you can grab a drink upstairs at the bbq place!  Worth a try if the wait isn't super long.", "pics": null}}, {"review": {"des": "I'm a sucker for hidden gems and this ramen spot passes every check on my list of defining super cool & different. <br><br>What's so different about it? The restaurant shares a space with two other joints (a coffee shop and a bar/restaurant) and the main entrance is from inside Green Street Market. The only way we found out about this place was due to the long line at 5:30 PM while we were having our drinks at Green Market. <br>With no real sign, you follow the line down the basement to put your name on the list unless you are one of the lucky 16 to get a spot in the first round. <br><br>With only 16 spots in the basement, the wait can run anywhere from 30 minutes - 2 hours depending on what time you go. On a Saturday, we put our name down around 5:30 and had to wait about a hour and a half. So plan accordingly. The music fits the restaurant's dimly lit dungeon vibe and I think the menu fits perfectly for such a small place as well. They know what they specialize in and how to serve it up best.<br><br>The food: Okay here's where I take off a star. Coming from an inexperienced ramen connoisseur, i absolutely loved the signature ramen bowl with medium spice. I originally got the Shoyu but switched with my boyfriend because I wasn't used to the taste of it, and he said that's more of an original style ramen. We both loved the noodles and egg in the dish, but again, I think the restaurant is meant to serve a different take on ramen vs. authentic ramen. <br><br>Either way, I would definitely line up again and wait an hour for the delicious food at this super cool spot.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-lT3xU6ddTGQIaPKFd83DA/168s.jpg", "caption": "Bar area"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Xmpjg4qTHhyx7_wzKuRSvQ/168s.jpg", "caption": "Stairs down to the dungeon"}]}}, {"review": {"des": "The place is really hard to find. I mean really really hard to find! There is an obscurely painted door with the name that you cannot see unless you already know about it. They do not take reservations but you can put your name down and give an estimate of the wait. Ours was 90 plus another 45 mins.  They text and wait for 10 mins for you to respond. All this to creat a sense of exclusivity??! Kind of a turn off for me if you ask. Went there with a bunch of friends who absolutely wanted to try this place. All this said and done I have to mention that the host was kind enough to pass us over and call us next when one from our group want able to find parking, instead of cancelling our group all together, which would have been a bummer after a 90 minute wait by the rest of us.<br>The place is small, sits may be 15 people at a time. Very dark, not in a romantic candle light dinner way! <br>The food was really good after all this. I loved my ramen, the high five signature, full spice. It was one of the best ramen I have had. Will give it a \"high five\" stars. All of us did like our ramen but decided it was not out of the world. <br>The sake, it's nothing much and are expensive. Don't waste your money. <br>So even though it was good ramen, we won't be going there again any time soon because I can find good ramen with much less hassel elsewhere with a little more options on the menu.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gKijmGCVRr_8ojqZozrYHA/348s.jpg", "caption": "Shiyo ramen"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hSjodyfI_AIVlxAswHipGg/168s.jpg", "caption": "High five Signature ramen"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Y68LWBnLyOZgXp1Pe-jwFg/168s.jpg", "caption": "Sake and the slushie"}]}}, {"review": {"des": "This is a top 2 ramen place in Chicago. In my opinion it is tied with Ramen Wasabi. <br><br>We went on a Wednesday at 11pm. There was no wait and we were seated immediately. The atmosphere is dark, intimate, loud, and trendy. Well decorated walls. Waiters and waitresses are all very hipster. <br><br>We ordered the Signature bowl with no spice - to really taste the soup base of the ramen. It came quickly, under 10 minutes from the time we ordered. The soup tasted very thick and full of flavors. It urges you to continue onto the next sip, with each sip offering you a different feel. The pork chatsu is amazing as well, very easy to cut and tastes absolutely palatable. The whole egg is very very well prepared, up to authentic Japanese standards. The yolk was still runny and I love it. <br><br>It's $14 for a signature bowl and I'd definitely recommend this. It is honestly a push between this bowl of ramen and the bowl at Ramen Wasabi. Cannot wait to come back to try the ramen with more spice levels!", "pics": null}}, {"review": {"des": "I want to start off this review by stating that I absolutely love Hogsalt Hospitality (the restaurant group). Other highly acclaimed restaurants under this umbrella include Sawada Coffee, Small Cheval, 3 Greens Market, etc. WIth that being said, this is the first time that I was left.. unsatisfied :(<br><br>The location is definitely my vibe. If you enter through Sawada Coffee and go down the mini stairs, there's a white hand painted on a door; this is the entrance! Going down the stairs, you'll see a small basement level restaurant with 16 seats. Either come alone, or start waiting in line about an hour before opening.<br><br>I ordered the full spice tonkatsu ramen. I understand that this is not Japanese ramen, but an interpretation of it; however, it just wasn't as satisfying. There is a definite dosage of szechuan peppers to give that numby feeling people like to mention, and the pork belly slice was very flavorful. However, ramen is all about the broth, and it felt rather thin, not full-bodied and having that unctuous oily quality (real ramen is meant to be fatty!) Would I have this again? Maybe. But the price point is also a little much for the ramen quality ($14). Definitely a cool night out, but I was left with desiring something more rather than walking out feeling happy. <br><br>At this point the only dependable ramen place for me in Chicago is Misoya out in Mount Prospect (not in River North).", "pics": null}}, {"review": {"des": "Ramen here is great, comparable to the best ramen shops in Chicago. The service was great as well.<br><br>But the wait can be ridiculously long. I chose to start waiting around 4:40PM, and there were already 7-8 people waiting in front of me. Even after one gets seated, it can take a long time before food is served. I was lucky, but the party that got seated after me had to wait 20+ minutes more before they got their food. <br><br>The interior decor is probably divisive among the customers as well. It is extremely dark in there, and the place is full of things that reminds one of Halloween, such as skulls. <br><br>My personal experience here was great, but I am aware that the circumstances were perfect that time.", "pics": null}}, {"review": {"des": "As previous reviews note, this place is a bit tricky to get into effectively. On most days, the doors open at 5pm central, and the line begins to form INSIDE green street meats (towards the Coffee shop there is a black door with a white handprint). At 5pm, the doors open and you file down a staircase where they will seat the first ~26 or so people, before everyone ~26 and back will join a waitlist +1hour. Good news, if you're not part of the opening group, they can text when your table is ready, so you can hang out at the green street meats bar or coffee shop and enjoy the beautiful scenery and people watch. <br><br>Dining ambience: the ambience is fun, albeit a bit loud with new/nostalgic rap. It is very dimly lit, so I'd suggest eyeballing the menu while you wait for your table. <br><br>Food: the ramen is worth it.... they have three spice 'options'. No spice, medium, and heavy. my wife ordered their signature ramen with no spice, and was in love with the flavor of the broth and the texture of the pork belly. You can tell they are affiliated with a renown bbq establishment, as the meat was absolutely perfect... I ordered the signature with medium spice, as I am a fan of spicy food, but wanted to start slow--- and am happy I did. The medium spice dish was perfect for me, and flavorful, but may burn the face off of someone else. <br><br>Highly recommend this for a fun night out for a couple, but not for a first date, couple with kids, or for a large group.", "pics": null}}, {"review": {"des": "I'm not sure what happened, but the quality seems to decline with each visit. The horror!<br><br>What I liked best about this restaurant was the noodles. However, the noodles were unimpressive during the most recent visit. They were thinner and tasted more package-like.<br><br>I previously mentioned that showing up at 5:30pm is sufficient to get in the first round. That was not the case this time despite getting there at 5:30pm. We would have gotten in the first round had we shown up at 5:15pm - 5:20pm, so make sure to get there earlier. I'm thinking the reason could be that it's the summer. Summer = ramen I guess.<br><br>Onward to find my next favorite ramen restaurant!", "pics": null}}, {"review": {"des": "So my partner had been talking about this place for more than a year and we finally went. He told me it would be a 3 hour wait probably, but for good ramen I was totally down. We got there about 8:30 I'd say, and they said to be a two and a half hour wait. The place is itty bitty, no tables just bar style seating. We got on the list and the good thing was, you can go up stairs to the bar at the meat market and hang out. We finally got sat around 10:15 or so and were sat at the bar. I got the house special at half spice and holy bageezus it was still spicy. I think I did drink a whole pitcher of water by myself. The Broth was delicious and the meat came from the smokehouse upstairs. I loved the marinated soft boiled egg and the noodles. We were served very quick, I will come back, however I will try another bowl. If your gonna go, check in with the hostess at open so you don't have to wait that long.", "pics": null}}, {"review": {"des": "I have a running list of the top 5 Ramen places in Chicago this is a place that most of my friends Ramen had been talking about.<br><br>Ambiance this place is small and very few seats 16. It is dimly lit and has the feel of being underground because it's actually in the basement. I liked there wasn't that much signage and it was just a place you can sit down appreciate the food. <br><br>Staff: They were present and good to talk to. They gave you enough time to enjoy the Ramen & didn't ask too many questions.<br><br>Food  I came for the Ramen and I was not I was definitely impressed. The depth of the flavor the broth the noodles all of them melded together perfectly. It definitely is my top 2 Ramen places in Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/elXTxIxhXvUFD_nFhCkcIA/168s.jpg", "caption": "Signature Ramen Half Spice with double the meat"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/b2cNiibbv_738ibfTUe1fA/168s.jpg", "caption": "Menu High 5 Ramen"}]}}, {"review": {"des": "High Five was a great experience. I ordered the Signature and a friend ordered the the Shio. Both ramen dishes had great broths. The Shio's broth was a bit thinner, but it didn't compromise on the flavor. We ordered the half spice and felt it was a good level of spice where it was flavorful and not painful. The noodles were slightly different. Shio's noodles were a bit thinner whereas the Signature were a bit thicker and wavy. The pork belly was spot on and the extra $3 for extra is worth it especially if you're sharing. Overall, I definitely enjoyed my experience at High 5. Would I want to wait in line for 1-2 hours... probably not. But if you plan ahead, you can come early and put your name down.", "pics": null}}, {"review": {"des": "THE HYPE IS REAL! <br><br>I heard about this place from a few friends and all I was told was that this place has really great ramen, but it's has a speakeasy type of vibe and it's impossible to get in without having waiting a few hours. <br><br>I was with a group of 4 and stopped by on a Tuesday night. We arrived around 8:30pm and was told it would be a 1.5 hour wait- which I was impressed by considering how many reviews I read about how the wait can be up to 3+ hours. We hung out upstairs at Green Street Meats to kill some time. Exactly an hour and a half later, we received a text that we were ready to be seated.<br><br>The place is VERY small, so no wonder why the wait is usually so long. Our server was awesome. She walked us through the menu, provided recommendations and answered all the questions we had. I ordered the Maitake Ramen, which is the vegetarian ramen. Supposedly this started off as a seasonal item, but with the high response, they decided to keep it on the menu. I could handle spice pretty well so I went with the full spice. <br><br>Easily one of the best bowls of ramen I've ever had- and to be honest, I'm a bit of a ramen snob. The broth was so savory, the noodles were cooked to perfection, and the toppings worked so well together. The wait is SO worth it. Looking forward to my next visit, ASAP!", "pics": null}}, {"review": {"des": "High Five Ramen had a cute atmosphere, but overall I was unimpressed.<br><br>The Wait: We put our name down at 6:06pm on a Tuesday and our table wasn't ready until 8pm.<br><br>The Atmosphere: Small! Once we got in I understood why the wait was so long. It is cute and unique inside, but I wish it was a little bigger. Having more tables inside would've been nice rather than mostly bar seating.<br><br>The Food: I've eaten at multiple ramen places in Chicago and to me the ramen here was meh. The broth was forgettable. The noodles were the best part, but they did have a little bit of an \"out of the package\" feel.<br><br>I want to come back and try the drinks, but I won't be back for the ramen.", "pics": null}}, {"review": {"des": "The vegetarian ramen is the best I've found, this is a tiny perfect place to have a solo meal.", "pics": null}}, {"review": {"des": "We just visited from out of town and had been recommended High Five Ramen. Absolutely amazing ramen experience. The flavors and complexity of the Tonkatsu broth will take you on a voyage to unimaginable depths of taste and joy. Our server was fantastic and really made the effort to ensure all of our ramen needs were met. Worth the wait and the hype. High Five Ramen was not established to fill your stomach, but to fill your soul. (Sluuuurpp)", "pics": null}}, {"review": {"des": "I'm a Ramen fan first of all - total comfort food! I will drive an hour if I need to for a good bowl of Ramen and in my opinion, this is the best in the city and I've pretty much had them all. I happen to be a fan of their thick, rich and salty pork broth these guys are rocking out - it's amazing. For my flavor pallet, it's just right. If you're into a light broth, go get Pho'. The noodles have a nice chew and that molten egg is cooked just right where it explodes in your mouth when you bite into it. The pork belly that comes with it is good but nothing that jumps out at you and gives you a hug. It's all about that broth. I usually go with a 1/2 spice which is a nice blend and is pretty spicy but just enough so you can still taste everything else. For like $15, you get a good sized bowl and walk out full. I always wash it down with an ice cold Sapporo. Service is always quick and friendly and sometimes I even take one to go. Cool downstairs kind of speak easy spot (no sign outside) with limited seating. I highly recommend for foodies like myself who have no problem waiting a few hours to taste greatness. Cheers!", "pics": null}}, {"review": {"des": "Terrible experience...They put us on the list and never called us back. \"Austin\" was a terrible hostess and I would never recommend the place. The place was almost empty and he didn't let us in because the way we looked. We weren't white enough for this place...", "pics": null}}, {"review": {"des": "I'm a ramen fiend. Hands down best ramen I've ever had. Well worth the wait. You won't be disappointed", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qhJ-A6EP-MCWhJxobsbFsw/348s.jpg", "caption": "Signature extra pork belly. Will NEVER disappoint"}]}}, {"review": {"des": "I can safely say that High Five Ramen is the best restaurant I have ever been to. As a chef,  I have tasted my fair share of food, but the UMAMI of the broth and the pork belly is what keeps me coming back at least once a month.  <br><br>The staff is also great!", "pics": null}}, {"review": {"des": "This is a solid ramen joint. The atmosphere is super cool, albeit tiny as others have noted. <br><br>The menu is so simple which is wonderful! The signature full spice ramen is indeed spicy. The broth is rich, egg perfect, and the pork belly amazing. Nothing to complain about here!<br><br>Is it worth the 2.5 hour wait. Nope! But, given its size, this is why you have a wait like this. While I'd eat here again as it's great food, I'd seek other ramen spots first.", "pics": null}}, {"review": {"des": "YUMM! <br>As other reviewers have mentioned, be prepared to wait. We got there 5 minutes before it opened and had to wait an hour and a half. Bummer. <br>Food is totally worth it though. Noodles are thick and chewy and the spice level is just right. Really small area (seats about 15 people) but cozy atmosphere. <br>Another plus, they text/call you which makes it possible to run to the allis to have a drink or order some pre-meal dessert at BombO bar (: <br>Enjoy!", "pics": null}}, {"review": {"des": "The TL;DR<br><br>I had heard a lot of positive things from other ramen snobs in the city that High Five has some pretty good ramen. It's not necessarily as good as other places such as Wasabi on Milwaukee, but good nonetheless. It's also a spot that seems to cater more toward the late night crowd of the area, so if you're in the mood for ramen late night, it's a great choice. <br><br>The positives<br>The service was great. Within 30 second of walking in (10:30pm) I was seated and had food and drink ordered 2-3 minutes later. The staff was very welcoming and attentive. I had either a server or prep cook checking in on me to see how my meal was pretty regularly during the hour that I was there. While the menus is slim, is well thought out and sticks to the essential. The presentation of the Tonk I ordered was pretty good and I had no problem getting heat as a side instead of mixed in so I could spice to taste. While the noodles could have been a bit firmer, they weren't out of the ordinary for most ramen places I've visited (what is with America's obsession with soggy noodles anyway... firm or stiff is basically the standard in every other country). Most notable about the noodles though is that they're wavy, which makes for a far better experience as it pulls a lot more broth as you slurp as opposed to straight noodles. Finally, tue Matcha lemonade was interesting. I would let it sit and melt slightly before drinking it if you give it a try because right out of the machine it's a bit bitter from the matcha, but as it melts a bit, it sweetens up and you get a nice creamy matcha latte-ish flavor with a note of lemon on the end.<br><br>The negatives<br>Tue pork belly was decent, but not particularly something to right home about.  While I waited for my food and also while I ate, I had noticed that the meat came out of a warming overnight pre-cut, which I think was part of the problem as it was a bit dry, but it also may have been a poor cut.<br><br>Overall I'd visit again if I was out at about the same time, but if it were earlier, I'd probably make my first choice of Wasabi.", "pics": null}}, {"review": {"des": "I love all and any type of noodles so I've eaten a few bowls of ramen in my lifetime. That being said, this might have one of the best noodle consistency out of all the ramen places in Chicago. The noodles are not over cooked and are chewy and what I expect ramen noodles to be like. I got the High Five Signature bowl at half spice and the spice is the perfect level! I think I could've gone up a level but the half spice was enjoyable for me. <br><br>We got there at 5 on a Wednesday and we were in the first batch of people to sit down when they opened at 6. Time went pretty fast granted we did have 2 beers from Green Street Smoked Meats!", "pics": null}}, {"review": {"des": "Totally worth the three trips it took to actually get in! Hogsalt, you did it again! I got the Shiyo full spice wih extra pork bellly & extra noodles. It's like eating 2 meals. But I was hungry & it was AMAZING! I'm ruined now. All the ramen in Chicago & I can only go 2 places. Can't wait to come back", "pics": null}}, {"review": {"des": "Why wait 3 hours for ramen when you can get a similar bowl elsewhere? I came here on a Sunday and waited 1 hour for a table, and even that was too long for an average bowl of ramen. I have heard many good things about the place so came with very high hopes. The menu is simple and I decided to go with the Signature bowl with no spice. Unfortunately, I given the wrong order of Shoyu ramen but because I hate food going to waste, I ate it anyways because I thought it would still be a solid choice. The shoyu broth was pretty one-dimensional, and I had to put in a bunch of chili oil to make it more flavorful. I also didn't understand why the bok choy had to be served raw in the soup. Despite this, the pork belly and egg were very good. I tried my friend's Signature ramen w/ half spice, and it was definitely more spicy than the 50% spicy I expected. I would absolutely come back to try the non-spicy Signature bowl again but no way Jose am I waiting more than 10 minutes.", "pics": null}}, {"review": {"des": "Is High Five Ramen worth the typical 2+ hour wait? Honestly, no. However, is it one of the best bowls of ramen in Chicago? Absolutely! And if you do what my girlfriend and I did, which was put our names down and go get a few little bites and sips from some of the other great restaurants in the area, the wait isn't so bad.<br><br>I was 100% into the dank little basement bar vibe and the lo-fi hip hop blasting non-stop.<br><br>The tonkotsu miso broth was incredibly rich, the noodles had a nice springiness and chew that I haven't experienced anywhere else in the city, and the egg was just barely cooked through so that the yolk was perfectly runny.<br><br>My one complaint has to do with the spicy versions. It seems like the only thing that makes them spicy is the addition of togarashi, and they add a LOT of it, to the point where the broth gets a little gritty, for lack of a better word. The flavor was great, but I couldn't get on board with that texture. Surely, they could've used less togarashi and more chili oil or pieces of chili pepper or something.<br><br>Considering the wait time, I would sooner go to Strings, but if you are able to make a night of it like I did (or find a time when the wait isn't so crazy long, if that exists) and get the regular miso tonkotsu ramen, then you're in for a good time.", "pics": null}}, {"review": {"des": "One of the best Ramen places I've had! <br>I've tried to eat here twice before but the wait was simply too long for me -- yesterday I got home from work a little early so was able to get there and wait for when it opened. Must say I was really pleasantly surprised by the quality and heartyness of the ramen. It carries so many different flavors. I got the half-spice, and my friend had the no spice. Both were amazing broths -- again very hearty, smoky, and with great lasting flavor. The noodles themselves were cooked wonderfully -- not too hard, not too soft -- but I understand everyone likes their noodles a different way; it was just right for me.<br><br>I ordered an extra egg because I wasn't aware that they actually give you a whole freaking egg! At almost all other ramen places I've gone to (in New York and here in Chicago), it's always half an egg, and you pay extra for another half to make 1 total egg. NOT HERE!<br><br>Unfortunately they only you to purchase take-out (and just 1 order per person) if you sit down and eat there -- you can get it at the end of your meal.<br><br>Do I love it? Yes.<br>Is it authentic? Depends -- if you are looking for classic Japanese ramen then no. If you are looking for good flavored ramen with an intriguing twist, then yes.", "pics": null}}, {"review": {"des": "So I came back to try the kanabo and it's basically a bunch of chili powder dumped into their signature ramen. Did not find it \"tear jerking or face numbing\". Instead, I thought the excess chili just ruined the flavor of the broth but the egg and the texture of the noodles were spot on. Glad to see consistency from my previous visit. I wouldn't order it again but hey, at least I can say that I've tried it and conquered! From my experience, it can be confirmed that they really do mean it when they say don't order the kanabo. I recommend sticking with their half or full spice (even for you spicy lovers). You'll be a lot more satisfied unless you enjoying eating spoonfuls of chili powder then go for it.<br><br>As for the wait this time, we came an hour before they opened on a Sunday with a group of 5. Got a few drinks from Green Street while we waited in line so it made waiting in a stairwell a little more tolerable. Ended up being the second party in line and made the first round of seating so yay for that! Like everyone has already mentioned, be prepared to wait since there's only 16 seats so either come early or super late. Wouldn't recommend coming with a large group as well unless you're fine with splitting up. We were probably pushing it with 5 but fortunately it ended up working out for us.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_KMBMePf_RbULp34njFoNA/348s.jpg", "caption": "Full spice"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/U4_6PW2uKGQ8SjN6efY95Q/168s.jpg", "caption": "Kanabo spice"}]}}, {"review": {"des": "Really enjoyed this little gem. Definitely be prepared to wait if you don't get there right when they open. We got there at about 6pm and had about a 2 hour wait. The place has about spots for 20 people to sit roughly, so be patient. Very simple menu just some delicious ramen selections and a few drinks to chose from. <br><br>I decided on the signature high five ramen at 1/2 the spice level. For it being a tonkotsu broth it wasn't so overly rich as the one that you get at Furious Spoon. The heat level was just where I like it, enjoy to enjoy but not overpower the pallet. My husband went for the full heat and it did clear the sinus. Definitely worth the wait. The pork in the bowl was so good, I wouldn't be surprised if it's prepared upstairs at Green Street Smoked Meats.", "pics": null}}, {"review": {"des": "Nice small cozy little spot....Drinks,Food and staff was all amazing....will be back soon..", "pics": null}}, {"review": {"des": "I have come here twice to be sure I like it as much as I do.  Ramen, like Poke, is easy to make and almost impossible to make great.  There are so many mediocre places and High Five Ramen is not one of them.<br><br>It's small, dark and buried.  The hostess sometimes yoga stretches late at night.  Okay, I only saw this happen once, but I'm okay with a place with flexibility.<br><br>The first time I came here it was busy and near closing but they took my name and told me I could sit at the bar in the barbecue place upstairs.  \"Come back in half an hour.\"  Before that half hour was up someone I didn't know fetched me, I'm guessing by description, because I wasn't the only person alone at the bar.<br><br>I ordered half spice the first time and full spice the second time and had no regrets either way.  The broth had the right kind of thickness and the heat/spice builds to a nice intensity.  It all seems bearable except you realize you're sweating intensely and the next day you pay for it dearly.<br><br>It is possible to inure the terminal end of your large intestine to such torture but I hear it takes 2 weeks of flogging it with chili peppers from the inside.  <br><br>Regardless of the after effects, you can taste and feel the difference between local popular chains and this place in your mouth, and for me that's what counts.", "pics": null}}, {"review": {"des": "Third time at High Five and the ramen once again did not disappoint. Arrived shortly after 10:30pm on a Wed night and didn't have to wait. (Ironically as I was leaving 45 minutes later the line was 6 deep)<br><br>After getting the Kanobo spice the last 2 visits, I decided to try something new and got the Shoyu bowl with full spice. The full spice is definitely not as spicy, but may be too spicy for the average person.<br><br>From overall ambiance to the quality and taste of their ramen, High Five is easily the best ramen spot in the city. Would HIGHLY recommend High Five to any ramen lover and encourage them to endure the wait.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7gGo_RPmlKPv8oeaUEnFkg/348s.jpg", "caption": "Full Spice Shoyu Bowl"}]}}, {"review": {"des": "Atmosphere/Ambiance (10%): 4/5<br>Cleanliness (10%): 5/5<br>Service (30%): 5/5<br>Food (50%): 5/5<br><br>Overall: 4.9<br><br>I got the Signature Bowl with Half Spice with Maitake Mushrooms and extra Pork Belly. Everything was delicious and the spice level was to my liking--hot enough to have a good kick but not overly spicy so I was able to add the chili oil to achieve perfect amount of heat. The rest of my party got the Shoyu Ramen, which I tried but I definitely preferred the distinctiveness of the Signature broth. <br><br>Now is it worth the 3 hour wait? If you're planning to grab drinks in the area anyways, sure. Otherwise, I'd rather go get my ramen fix at Ramen Takeya without waiting all night.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IH8rrpvd6VqTTPl_yU7QBg/348s.jpg", "caption": "Signature Bowl - Half Spice"}]}}, {"review": {"des": "Two years later here is my review...<br><br>I went to High Five Ramen a month after they opened in June 2014 and swore I would never go back. Back then they basically only had 1 ramen option with 4 spice levels, and I got the half spice signature bowl. It was so spicy that I could not feel my tastebuds for hours. They were not joking about the numbing pepper! I also didn't care for the overly smoky taste or the crazy long wait. The only highlight was the perfectly cooked egg. <br><br>About a year or so ago, I went back again and gave it a second chance. That time I ordered the no spice and it was much better. If you have any type of spice sensitivity, just be safe and go with no spice. However, this bowl was still super smoky (which they are known for), and I got actual pieces of char. The egg was still perfect, and I loved the pork belly. Something about the char and smokiness didn't do it for me. Someone said maybe it's from the garlic oil but I usually love garlic oil so I dunno. <br><br>My friends Kris and Santi go there every week on Thursday and kept asking me to join them. Santi has been to Japan and loves this place (check out his review). When he told me they introduced Shoyu, Shio, and Maitake, it made me decide to give it a third try. Kris got the No Spice, Santi got the Shio, and I got the Shoyu. The third time was definitely the charm! I loved my Shoyu. I tried the other two bowls that my friends got, and they were both great. <br><br>Maybe it's because they've perfected their craft in the last two years, or maybe my ramen tastebuds have changed. Had I reviewed them in the beginning, I would have probably given them 1 star. Either way, High Five is now in my top 3 spots for ramen in Chicago! <br><br>PS. The egg is still perfect. And Jen is the best!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RmUi-8Z5KSGTuWUCZ65sFg/348s.jpg", "caption": "Shoyu Ramen"}]}}, {"review": {"des": "Not authentic. The chef is not even Japanese. He only went to Japan to train on how to make ramen. <br>The places sits 15 and 2 - 3 hours wait.  <br>Owner wanted to have a same Japanese concept. <br>It's not worth the wait and the worst part, <br>The bar tender dipped her thumb as she was serving the soup,  so watch out eaters,  there's so much more other Japanese \"concept\" out there.", "pics": null}}, {"review": {"des": "A friend recommended this spot and I was shocked to find out that there was only 16 seats in this little basement of a ramen restaurant.<br><br>You'll most likely need to wait to get a spot and by wait I mean 1.5-3 hours. Luckily, we got there around 5:20 and waited in line to try to get in with the first group of people. Although we didn't make it in with the first group, we only had to wait 45 minutes or so.<br><br>Food: The ramen is good, the broth is very flavorful. I got the signature high five bowl- no spice. The pork belly was very tender, although I had a piece with a lot of of fat. The egg was perfectly poached and the noodles were cooked well and tastefully chewy.<br><br>Drinks: We couldn't get ourselves to order $19 sake, but the alcoholic slushies were surprisingly very good. A little strong- but we were happy since alcoholic slushies typically have minimal alcohol. We tried the Coconut Painkiller and the Hibiscus Shochu- both very good. The Coconut Painkiller was better of the two.<br><br>Price: $12-15 for a bowl of ramen- somewhat on the higher end for ramen.<br><br>Service: Great service. They get customers moving through relatively quickly, but are still attentive and friendly.<br><br>Atmosphere: A little dark for my liking. A part of enjoying meals for me includes visualizing it as I eat. The vibe was very laid-back and relaxing.<br><br>The ramen is good here. I haven't eaten ramen at any another spot in Chicago. I'm not sure if I would wait here for more than an hour and a half for ramen since there seems to be a lot of other options in Chicago. This place seems to be pretty hyped up and purposefully extra exclusive with only 16 seats available (I understand that there is limited space). Anyway, I'm happy we got a spot and I would recommend it to people.", "pics": null}}, {"review": {"des": "We had to wait almost two hours to be seated at the small 10 seat restaurant but it was worth it. The ramen was fantastic with crunchy veggies and just the right amount of spice to the broth. Also try the painkiller drink, it's delicious :)", "pics": null}}, {"review": {"des": "This spot is attached to Green Street Smoked meats.  It's the first door to enter into Green Street Smoked Meats, but then you go down a flight stairs on your left to the ramen shop.<br><br>I got in line at 5:45pm on Sunday since they open at 6pm.  I knew there would be a line waiting for them to open.  When they finally opened the doors and we put our name down on the waitlist, we were told it would be another 45-60 min wait.  There are only 13 seats which is why there's such a long wait.<br><br>My friend and I had drinks upstairs at Green Street to kill the time.  I think we only waited about 45 minutes before we got seated.<br><br>My friend told me that the noodles would be spicy for me and recommended that I get the no spice ramen (since I told him Sriracha is spicy for me).  Of course I don't listen and I got the half spice ramen.  The ramen came out pretty quickly...maybe 10 minutes after ordering.  I definitely should have listened to my friend because it was really spicy and I ended up sweating profusely.  The noodles were cooked perfectly.  The meat was ok...not my favorite pork belly. The egg was soft boiled which was so good.  Overall I really liked it!", "pics": null}}, {"review": {"des": "This was by far the best ramen I have ever had. Noodles were an amazing texture and the broth was so flavorful! Have already been twice this month and will be back soon!", "pics": null}}, {"review": {"des": "Easy 5 stars. Half spice ramen feels like a fully-fledged superspice ramen. I love spicy food more than the next guy, so careful what you wish for if you order the full spice ramen.<br><br>Make sure you're either ready to wait 3 hours in line or check in beforehand.", "pics": null}}, {"review": {"des": "The wait is worth it.<br><br>Chicago has seen an influx of ramen spots promising experiences to dazzle and touch the senses like of Chicago's growing foodie culture but what high five does is a very different approach. You come in and you eat ramen in a small space and then you get out. Simple. But in that simplicity is something amazing happening. A space that's close quarters so you're more likely to talk with the people next to you. Food that tastes amazing where your mouth and stomach will tingle with spice and lust for more. Staff that are literally working and not worried about giving you an experience of frills versus an experience of amazing food and drink (try the juice box).<br><br>I can't wait to go back and do it again... except this time I'll definitely be earlier because that 1.5 hour wait was crucial for a hungry man :)", "pics": null}}, {"review": {"des": "If you like spicy, go for the full spice ramen! Great depth of flavor, attentive but not obnoxious service, and great casual environment. It took 5 attempts to finally get a table here but I will be back.", "pics": null}}, {"review": {"des": "LOVE, and<br>- unique;<br>- the one and only highly marbled broth in Chicago;<br>- affordable slushy;<br>- good service;<br>- clean and organize.<br><br>HATE.<br>- unable to experience broth marbling with hint of spice/chili;<br>- Ramen best consumed at venue: (1) broth coagulates (high heat melts it again), (2) hot chicken broth dents plastic to-go container;<br>- wait/line, small venue, inconsiderate dating humans pondering to mate/not to mate (heaven's sake, flip a coin!)<br><br>To-Go portion seems smaller, true?", "pics": null}}, {"review": {"des": "The wait wasn't too bad.  About an hour but it was worth it.  The ramen was delicious.  The broth was great. Must try", "pics": null}}]}